[{"_id": "KFdoqhChdoXeMRCFE", "postedAt": "2023-08-06T13:45:59.663Z", "postId": "EAA5YeR6s6Ye2cZjD", "htmlBody": "<p>Thank you for the post!&nbsp;</p><p>Makes me wonder: If this could reduce animal product consumption by making easier to get calories and protein from beans?</p>", "parentCommentId": null, "user": {"username": "tseyipfai@gmail.com"}}, {"_id": "przyNfShohZMqDsCT", "postedAt": "2023-08-06T15:01:03.104Z", "postId": "EAA5YeR6s6Ye2cZjD", "htmlBody": "<p>This is a really interesting idea, thanks for putting this together!&nbsp;</p><p>Is there any risk of harm due to bacterial growth during soaking? I know soaking beans is typically considered 100% safe, but I'm curious if there are any risks when doing so in areas with limited access to clean water.&nbsp;</p>", "parentCommentId": null, "user": {"username": "MHR"}}, {"_id": "REhbykGHGwXRQ22WE", "postedAt": "2023-08-06T15:19:38.926Z", "postId": "EAA5YeR6s6Ye2cZjD", "htmlBody": "<p>Thanks MHR. Yes most water here is at risk of contamination. Fortunately even with soaking you still boil them for an hour or more so no issue there ;)</p>\n", "parentCommentId": "przyNfShohZMqDsCT", "user": {"username": "NickLaing"}}, {"_id": "cbEPzyfJAiKvMC3mk", "postedAt": "2023-08-06T16:21:27.559Z", "postId": "EAA5YeR6s6Ye2cZjD", "htmlBody": "<p>Cool idea, thanks for sharing!</p>\n<p>Do you have any sense for why people don't do this? It doesn't seem like that complicated an idea, which makes me wonder if there is some hidden reason people choose not to.</p>\n", "parentCommentId": null, "user": {"username": "Larks"}}, {"_id": "ryRsseLbXp9xcvtC3", "postedAt": "2023-08-06T16:37:38.225Z", "postId": "EAA5YeR6s6Ye2cZjD", "htmlBody": "<p>I found this piece interesting and surprising. Back when I used to eat a lot of beans I would always soak them, and I guess I just assumed this was common practice amongst bean consumers everywhere.</p><p>Aside from the benefits you've mentioned, another purported benefit of soaking is removing the Phytohaemagglutinin toxin: “The FDA also recommends soaking the beans for five hours to remove any residual toxins and then tossing the water out” (<a href=\"https://www.statefoodsafety.com/Resources/Resources/toxic-beans#:~:text=The%20FDA%20also%20recommends%20soaking,t%20give%20me%20gastrointestinal%20trouble.\">source</a>). (An uncertainty here is that I'm not sure if the types of beans eaten in sub-Saharan Africa contain this toxin.) This toxin-removal consideration potentially raises the “unquantified health benefits” part of <a href=\"https://forum.effectivealtruism.org/posts/EAA5YeR6s6Ye2cZjD/soaking-beans-a-cost-effectiveness-analysis#Overall_Cost_effectiveness_Estimate\">your cost-effectiveness estimate</a>, though my guess is that any additional impact here is small compared to impact via the main two mechanisms. (Impact through this toxin-removal mechanism seems BOTEC-able in theory, but I likely won't attempt it myself.)</p>", "parentCommentId": null, "user": {"username": "Will Aldred"}}, {"_id": "gJYBwozxyDsuQFsDx", "postedAt": "2023-08-06T16:45:45.968Z", "postId": "EAA5YeR6s6Ye2cZjD", "htmlBody": "<p>Right, but there are types of food poisoning that aren't prevented by cooking since they result from a buildup of bacterial waste products. But I'm guessing that 6-12 hours just isn't long enough to run into any problems, even with contaminated water?&nbsp;</p>", "parentCommentId": "REhbykGHGwXRQ22WE", "user": {"username": "MHR"}}, {"_id": "DethxKCzAsYCnghwT", "postedAt": "2023-08-06T17:10:21.221Z", "postId": "EAA5YeR6s6Ye2cZjD", "htmlBody": "<p>Thanks for sharing this idea! I want to encourage you that it may be much more cost-effective if you do include health benefits.&nbsp;</p><p>I appreciate that you left health benefits out of your analysis because of <a href=\"https://www.givewell.org/international/technical/programs/clean-cookstoves#Organizations_that_implement_this_program\">this</a> GiveWell meta-analysis which found that distribution of clean-burning stoves did not have major health benefits. However, my reading of this study is that many of the distribution programs suffered from low usage of the new, non-traditional stoves; hence the indoor air pollution did not decrease much. In your intervention, if people did start soaking beans that seems virtually certain to reduce the amount of time required to cook -&gt; reduce indoor air pollution -&gt; improve health.</p><p>I live and work in North India, where there are also still substantial issues with indoor air pollution. I've started a small program to help subsidize people switching from biomass stoves to gas stoves. Using fairly similar assumptions and methods to yours, my rough <a href=\"https://docs.google.com/spreadsheets/d/1pLDhcbAdqB3sy23gyjepD3lZEhkb-tDuyFeQP94W7Z8/edit#gid=0\">cost-effectiveness analysis</a> found that subsidizing one family's gas connection saved (over a 3 year period) 0.3 DALYs, which is probably more important than the $100 or the 3 tonnes of CO2e which it also saved.</p><p>So I think this is a promising idea!&nbsp;</p>", "parentCommentId": null, "user": {"username": "Tom Delaney"}}, {"_id": "i7AHeDRa8Tfs8QuwJ", "postedAt": "2023-08-06T17:17:17.787Z", "postId": "EAA5YeR6s6Ye2cZjD", "htmlBody": "<p>Interesting!\nMinor comment: there's a missing y in the header \"Why Bean Soaking ma be tractable\".</p>\n<p>Since I'm not familiar with the water situation in Uganda, wanted to check if you have considered what would be the impact of using more water to soak the beans? Would families have to spend more time/money to obtain more clean water?</p>\n<p>And a potential information campaign could take place in the markets where people buy their beans.</p>\n", "parentCommentId": null, "user": {"username": "Eli Kaufman"}}, {"_id": "XBcyjk7hEnDB7Kb8j", "postedAt": "2023-08-06T17:20:01.266Z", "postId": "EAA5YeR6s6Ye2cZjD", "htmlBody": "<p>My bad I was on the wrong track there. I couldn't find anything that suggested there was any problem with bacterial residue, only like Will connected said that some safety bodies advise soaking beans because of potential of phytotoxins.</p>\n<p><a href=\"https://www.statefoodsafety.com/Resources/Resources/toxic-beans#:~:text=The%20FDA%20also%20recommends%20soaking,t%20give%20me%20gastrointestinal%20trouble\">https://www.statefoodsafety.com/Resources/Resources/toxic-beans#:~:text=The FDA also recommends soaking,t give me gastrointestinal trouble</a>.</p>\n", "parentCommentId": "gJYBwozxyDsuQFsDx", "user": {"username": "NickLaing"}}, {"_id": "EgQ9EApC4Bv4wobqP", "postedAt": "2023-08-06T18:02:22.811Z", "postId": "EAA5YeR6s6Ye2cZjD", "htmlBody": "<p>“BOTEC-able”... nice.</p>", "parentCommentId": "ryRsseLbXp9xcvtC3", "user": {"username": "Pablo_Stafforini"}}, {"_id": "369c2CzuLkzXJSrJn", "postedAt": "2023-08-06T19:02:54.959Z", "postId": "EAA5YeR6s6Ye2cZjD", "htmlBody": "<p>I'm skeptical of this. Over thousands of years of practice, there are many compelling reasons for a bean soaking practice to emerge. It saves fuel which is precious. Soaking beans overnight makes cooking beans for breakfast feasible by reducing cook time.</p>\n<p>Given this, I would expect either 1) bean soaking is common contrary to your experience, or 2) there is a good reason why this practice didn't emerge. Perhaps water safety is an issue, or perhaps water is scarce and soaking wastes water, or something else. I just don't see any reason why thousands of years of cultural practice would not generate a behavior with such obvious and immediate benefits.</p>\n", "parentCommentId": null, "user": {"username": "therealslimkt"}}, {"_id": "L2EyHCLK8SoJQ8Lvk", "postedAt": "2023-08-06T19:03:00.674Z", "postId": "EAA5YeR6s6Ye2cZjD", "htmlBody": "<p>One guess is that it occupies your cooking pot for a lot longer. So you could soak beans for the evening meal during the day, but you may need that pot to make other meals during the day. (But beans could be soaked in a different container like a plastic tub or bucket.)</p>", "parentCommentId": "cbEPzyfJAiKvMC3mk", "user": {"username": "Julia_Wise"}}, {"_id": "Qrczu2JrkvKBwT5Ap", "postedAt": "2023-08-06T19:30:30.012Z", "postId": "EAA5YeR6s6Ye2cZjD", "htmlBody": "<p>It’s also possible that something has changed recently that makes this a better practice now than it used to be — to use your example, maybe water access is better now than it was historically. Maybe beans weren’t prevalent in this region or a strain of beans that were worse for soaking were previously more common.</p>\n", "parentCommentId": "369c2CzuLkzXJSrJn", "user": {"username": "isabel"}}, {"_id": "QShKRdnSrrT4JmQzC", "postedAt": "2023-08-06T19:49:40.938Z", "postId": "EAA5YeR6s6Ye2cZjD", "htmlBody": "<p>That's a great question and a difficult one.</p>\n<p>At this point I am a little baffled as to why soaking is not common practice. I have asked a handful of people, and the answers I have got have mostly been a long the lines of \"because that's how we cook beans\" One person said they thought nutrients would leech out. The simple answer is that I think it has been a norm for a long long time, so the question is more how the norm was set I think. I have a couple of very weak ideas smut this.</p>\n<ol>\n<li>\n<p>Time often doesn't come into a calculation here as it often is considered to have little to no value, in the past, and in many places even now, whether you needed twice as much firewood or not might not have been important at all.</p>\n</li>\n<li>\n<p>Beans only came to Uganda I think 300 to 400 years ago, so there might not have been as long as other places to optimize cooking norms.</p>\n</li>\n</ol>\n<p>I don't think water scarcity is a major issues most places now in Uganda. Safe drinking water certainly is, but that's another Matter. People wash bodies and clothes with far more water than is strictly \"necessary\" so I don't think an extra litre to soak beans would mean much if anything. Also you lose a decent amount of extra water boiling for an extra hour which could balance much of the water \"wasted\" soaking.</p>\n<p>I'll put a bit of effort into asking more people why they don't soak beans but I'm not sure how much understanding I'll glean from it.</p>\n", "parentCommentId": "cbEPzyfJAiKvMC3mk", "user": {"username": "NickLaing"}}, {"_id": "6Jzz6GpiurjTHLJru", "postedAt": "2023-08-06T19:54:13.440Z", "postId": "EAA5YeR6s6Ye2cZjD", "htmlBody": "<p>Thanks Isabel that's a great point.</p>\n", "parentCommentId": "Qrczu2JrkvKBwT5Ap", "user": {"username": "NickLaing"}}, {"_id": "MA2CD6zo9zhh77gpw", "postedAt": "2023-08-06T19:56:44.901Z", "postId": "EAA5YeR6s6Ye2cZjD", "htmlBody": "<p>Thanks Khartik. I'm also still rather confused why it isn't the norm. I can assure you in Northern Uganda at least bean soaking is not just uncommon, but vanishingly rare as a practice. I'm sure some people do it, but I'm yet to find someone who even knows someone who soaks their beans.</p>\n<p>And yes, given that there may still be a good reason why the practice didn't emerge. I think the benefits traditionally would not be so clear as they are now as Isabel states below. If time isn't valued, and the only difference might be that you have to cut 30 percent more firewood, than soaking might not really add value.</p>\n<p>Water may also have been more scarce in the past, but now at least I'm pretty sure that's a non issue.</p>\n", "parentCommentId": "369c2CzuLkzXJSrJn", "user": {"username": "NickLaing"}}, {"_id": "GJt4Bv5JANnnWs6SH", "postedAt": "2023-08-06T20:23:35.848Z", "postId": "EAA5YeR6s6Ye2cZjD", "htmlBody": "<p>Thanks Eli nice one. I think having to use an extra litre of water would have minimal - especially because I would guess at least half of that litre would be saved at the other end of the process, with less cooking time messaging Jess e cc aporation time.</p>\n<p>Even buying water a a 20 litre Jerry can costs about 200 shillings, of which a litre would cost 10 shillings (.3 us cents) which is almost negligible even in Uganda.</p>\n", "parentCommentId": "i7AHeDRa8Tfs8QuwJ", "user": {"username": "NickLaing"}}, {"_id": "kRBXPgoEmCrrsEuHF", "postedAt": "2023-08-07T00:25:27.184Z", "postId": "EAA5YeR6s6Ye2cZjD", "htmlBody": "<p>This is possible, but it's speculative and we should have a clear answer to the question of why this did not arise historically. Otherwise this is paternalism without regard for what other people know that we don't.</p>\n", "parentCommentId": "Qrczu2JrkvKBwT5Ap", "user": {"username": "therealslimkt"}}, {"_id": "KNbsvRNx4Fd3QchSW", "postedAt": "2023-08-07T00:36:48.969Z", "postId": "EAA5YeR6s6Ye2cZjD", "htmlBody": "<p>Seems like this might be a cause that \"Canning What We Give\" is well-positioned to address!  <a href=\"https://forum.effectivealtruism.org/posts/ozyQ7PwhRgP7D9b2w/new-org-canning-what-we-give\">https://forum.effectivealtruism.org/posts/ozyQ7PwhRgP7D9b2w/new-org-canning-what-we-give</a></p>\n<p>(seriously though, this is a really cool post and I enjoyed reading it)</p>\n", "parentCommentId": null, "user": {"username": "Jackson Wagner"}}, {"_id": "Pf6oNjPPEb3gD8Zce", "postedAt": "2023-08-07T00:53:01.399Z", "postId": "EAA5YeR6s6Ye2cZjD", "htmlBody": "<p>Soaking screams food poisoning to me; especially with unclean water. Perhaps this is not a risk if done right, but this could be why it's not done.</p>\n", "parentCommentId": null, "user": {"username": "maxeonyx"}}, {"_id": "yZ2598j7DGvwkzZmK", "postedAt": "2023-08-07T04:50:26.474Z", "postId": "EAA5YeR6s6Ye2cZjD", "htmlBody": "<p>Sorry for very short comment\nGreat post , seems like could be amenable to a mass media campaign on it\nCE are looking to start new mass media charities\nI think you should get in touch/ happy to introduce</p>\n", "parentCommentId": null, "user": {"username": "Akhil Bansal"}}, {"_id": "BJse8nasiNiHDtm4w", "postedAt": "2023-08-07T05:04:17.868Z", "postId": "EAA5YeR6s6Ye2cZjD", "htmlBody": "<p>Thanks Karthik I mostly agree, and if this idea progress towards action then for sure will make a concerted effort to understand why. Although finding clear answers to questions like this isn't always easy.</p>\n", "parentCommentId": "kRBXPgoEmCrrsEuHF", "user": {"username": "NickLaing"}}, {"_id": "RE46siAFRrTdD8KQh", "postedAt": "2023-08-07T05:07:37.236Z", "postId": "EAA5YeR6s6Ye2cZjD", "htmlBody": "<p>Nice one :)</p>\n<p>think you have solved the problem conclusively. If we just can all of the beans and put them in supermarkets then we will hardly need to cook them at all. A far more elegant solution ;)</p>\n", "parentCommentId": "KNbsvRNx4Fd3QchSW", "user": {"username": "NickLaing"}}, {"_id": "mejqqKbMiQbmN5BY9", "postedAt": "2023-08-07T07:48:54.262Z", "postId": "EAA5YeR6s6Ye2cZjD", "htmlBody": "<p>People don't always act rationally or optimize. Tradition/norms can have a lot of staying power. E.g. in neighboring eastern Congo, people pay more money for charcoal  than they would for gas plus they are subjecting themselves to more indoor air pollution with charcoal. It's an issue that is stumping the local gas stove companies. They even hire an anthropologist to help them design a new marketing campaign.</p>\n", "parentCommentId": "369c2CzuLkzXJSrJn", "user": {"username": "Yelnats T.J."}}, {"_id": "gkvWKmCHfLxGhyMyj", "postedAt": "2023-08-07T07:54:07.619Z", "postId": "EAA5YeR6s6Ye2cZjD", "htmlBody": "<p>I can imagine this be not just an economic intervention but also a health one. If I recall from one of my uni projects, indoor air pollution causes 600k deaths in SSA and the biggest source is burning biomass for cooking (more certain on the first claim, less certain on the second claim).</p>\n<p>Another mass media intervention that could be considered is moving families from charcoal to gas or electric. Positive byproducts of the intervention is reducing deforestation and reducing revenue to illicit networks in a place like eastern DRC (where charcoal \"makala\" is harvested in protected parks).</p>\n", "parentCommentId": "yZ2598j7DGvwkzZmK", "user": {"username": "Yelnats T.J."}}, {"_id": "GCpGhpTWZo8mCygT4", "postedAt": "2023-08-07T08:18:15.246Z", "postId": "EAA5YeR6s6Ye2cZjD", "htmlBody": "<p>Thanks Max, this was mentioned by be Eli as well but I don't think it's an issue. Because of the 1 hour of boiling, everything that was alive is very dead. The mechanism would have to be a toxin. There's no evidence I can find of toxin production after short term soaking.</p>\n", "parentCommentId": "Pf6oNjPPEb3gD8Zce", "user": {"username": "NickLaing"}}, {"_id": "ndFi5ykgrWo9Qcep7", "postedAt": "2023-08-07T08:22:53.445Z", "postId": "EAA5YeR6s6Ye2cZjD", "htmlBody": "<blockquote><p>I just don't see any reason why thousands of years of cultural practice would not generate a behavior with such obvious and immediate benefits.</p></blockquote><p>I disagree with this. I know of quite a lot of examples of people not using clearly beneficial methods.</p><p>One case study I have done quite extensive research on is the slaughter of a fish called <a href=\"https://en.wikipedia.org/wiki/Pond_loach\">pond loach</a>, commonly consumed in China, Japan, and Korea. They are small and slimy and therefore hard to grab and handle. In most of Korea and many parts of China, pond loaches are <a href=\"https://youtu.be/cPFmxXKyU8U?t=46\">put in buckets and then sprinkled with salt</a> which kills or immobilizes (this method sometimes doesn't kill all of them immediately) them by osmotic dehydration, and also deslime them a bit. This makes salt a very effective way of slaughtering pond loaches as it makes them easy to grab and handle. Another added benefit of using salt is that it is always needed in the dish anyway. But for some reasons, people in some parts of China and Japan are using some other much more <a href=\"https://youtu.be/ZTsh9RiwJ1I\">dangerous</a> and <a href=\"https://haokan.baidu.com/v?pd=wisenatural&amp;vid=9580694166159354906\">time-consuming</a> ways of killing pond loaches. (DISCLAIMER: I am not claiming that people <i>should</i> use salt to kill pond loaches. In fact, I think it is one of the worst slaughters of animals in the world, and I am working on eliminating this practice.)</p><p>Another example is my experience working as a production manager in a garment factory. It took me less than 15 minutes to figure out that one of their processes can be done in a different way that saves &gt;30% labor time, and it is literally as easy as holding a component backwards. They changed to my method and never went back (PM me if you are interested in the full details). My boss and all the previous production managers have huge incentives to optimize everything in the production line - I mean they are a business, in an extremely competitive environment! But no they didn't figure this one out until I joined.&nbsp;</p>", "parentCommentId": "369c2CzuLkzXJSrJn", "user": {"username": "tseyipfai@gmail.com"}}, {"_id": "Pp6qGELtm39B2je74", "postedAt": "2023-08-07T09:06:27.467Z", "postId": "EAA5YeR6s6Ye2cZjD", "htmlBody": "<blockquote><p>I couldn’t find any data on bean soaking habits in Uganda or Sub-Saharan Africa in general but I have heard anecdotally that it is common in some countries, perhaps Zimbabwe? (insider knowledge appreciated).</p></blockquote><p>I happen to have a friend from Zimbabwe staying with me- he says that he is aware of people who soak their beans (his sister, for example), but that it's done pretty much purely for economic reasons and still not common- likely less than 10%.</p>", "parentCommentId": null, "user": {"username": "Joe Pusey"}}, {"_id": "KFdujX3anJf3sMu8k", "postedAt": "2023-08-07T12:02:28.334Z", "postId": "EAA5YeR6s6Ye2cZjD", "htmlBody": "<p>Thanks so much for the information Joseph! Interesting to hear that about Zimbabwe. Yes I suspect economic reasons would be the main reason most people would do it.</p>", "parentCommentId": "Pp6qGELtm39B2je74", "user": {"username": "NickLaing"}}, {"_id": "aDggm8Tvn7DkvJJfv", "postedAt": "2023-08-07T12:17:30.845Z", "postId": "EAA5YeR6s6Ye2cZjD", "htmlBody": "<p>Thanks T.J - yes I mentioned the potential health benefits but they are hard to quantify. There are a lot of reasonable claims of deaths from indoor air pollution in SSA, but finding concrete benefits in large studies from reducing indoor smoke have as of yet been elusive. For example Givewell did a literature review on potential health benefits of converting to clean cookstoves and found nothing conclusive. I still think there is almost certainly a significant health benefit from reduced time breathing in that nasty smoke. I don't know if you've ever been in a cooking hut, its quite an experience - somtimes smoke is so thick you can't see the far wall.<br><br>&nbsp;<a href=\"https://www.givewell.org/international/technical/programs/clean-cookstoves\">https://www.givewell.org/international/technical/programs/clean-cookstoves</a><br><br>On the moving to gas, that's a reasonable ida although there is quite a big initial capital expenditure, and here in Uganda at least cooking beans for 2 hours with gas &nbsp;still costs more than 2 hours with charcoal - it surprises me that DRC is different and that gas is actually cheaper there.&nbsp;</p><p>As a side note here charcoal is \"Maka\", so a similar name!<br><br>Moving to electric is more reasonable as it will likely be cheaper than charcoal, but power outages are so common it can't be relied on. That's a huge behaviour change which again that has a very high initial capital cost so would be very difficult - personally I don't think it would work in Uganda right now at least.</p>", "parentCommentId": "gkvWKmCHfLxGhyMyj", "user": {"username": "NickLaing"}}, {"_id": "tWPZhDmGEjDw6GwkJ", "postedAt": "2023-08-07T14:07:54.089Z", "postId": "EAA5YeR6s6Ye2cZjD", "htmlBody": "<p>Surprised no one’s done the per-capita income comparison, since extra income from less charcoal usage would be a big selling point in an information campaign.</p>\n<p>I did a very rough back-of-the-envelope calculation and estimated only 0.006% extra income via charcoal savings per year per adopter from soaking beans. I suspect that means lower tractability</p>\n<p>If 1% of 50 million Ugandans adopt, we have 0.5 million adopters.</p>\n<p>If 5-year savings for less charcoal used are 1.5 million USD, then annual savings are 0.3 million USD</p>\n<p>So per-adopter savings (annually) is 0.6 USD.</p>\n<p>And that seems low. Compare that against per-capita Uganda GDP of 1000 USD and we’re talking 0.006% extra income per year.</p>\n<p>(Also glanced quickly at a few other indicators like median daily income, per capita GDP in PPP terms, and they seem ballpark similar)</p>\n<p>To put that into a scale my first-world brain can understand, 0.006% over 100,000 USD is 60 USD. It’s definitely something but also feels low return for the habit change. And at that price, could easily see someone reverting back to cooking beans w/o soaking for the convenience.</p>\n", "parentCommentId": null, "user": {"username": "geoffreyyip"}}, {"_id": "GbL2JTipdkHxfDgW3", "postedAt": "2023-08-07T16:26:50.549Z", "postId": "EAA5YeR6s6Ye2cZjD", "htmlBody": "<p>Interesting! 3 potential cruxes for me:<br><br>1) How much does charcoal use contribute to indoor air pollution? And how large are the negative effects in expectation?</p><p>2) How much active time/labor/attention does typical Ugandan bean cooking take? If it takes ~2.5h to cook beans and soaking them reduces it by ~30%, the time savings would be ~45minutes/day or 273 hours. If you conservatively value cooking time at $.10/h, this is worth $27/year, which is considerable. But this assumes active maintenance, which might not be a realistic model.</p><p>3) How large are typical households/ how many people cook for a household? If households are <a href=\"https://www.ubos.org/wp-content/uploads/publications/09_2021Uganda-National-Survey-Report-2019-2020.pdf\">~5 people</a>, and only one person cooks beans for the entire household, then the time (and possibly indoor air pollution) savings are amortized by a factor of 5.&nbsp;<br><br>But this is all very first-principles-y, I'm sure people on the ground would have a much better sense!</p>", "parentCommentId": "tWPZhDmGEjDw6GwkJ", "user": {"username": "Linch"}}, {"_id": "c9bdwLz7vx2v2yYyL", "postedAt": "2023-08-07T16:35:55.107Z", "postId": "EAA5YeR6s6Ye2cZjD", "htmlBody": "<blockquote><p>Even buying water a a 20 litre Jerry can costs about 200 shillings, of which a litre would cost 10 shillings (.003 us cents)</p></blockquote><p>(If Google is correct, should be $.003, or 0.3 US cents)</p>", "parentCommentId": "GJt4Bv5JANnnWs6SH", "user": {"username": "Linch"}}, {"_id": "DyMbA4M7W4EDvy6KC", "postedAt": "2023-08-07T16:45:09.472Z", "postId": "EAA5YeR6s6Ye2cZjD", "htmlBody": "<p>Corrected thanks!</p>\n", "parentCommentId": "c9bdwLz7vx2v2yYyL", "user": {"username": "NickLaing"}}, {"_id": "8uxEC24nMdmREKprQ", "postedAt": "2023-08-07T16:56:51.296Z", "postId": "EAA5YeR6s6Ye2cZjD", "htmlBody": "<p>Very interesting. &nbsp;I'm of Indian origin and was born in the UK. &nbsp;But my parents were born and grew up in East Africa (Uganda and Kenya). &nbsp;As vegetarians, we ate a lot of beans/pulses. &nbsp;It was the norm in our house to soak beans overnight, and also to soak rice prior to cooking.&nbsp;</p><p>Based on my own experience, I'd always assumed that it was common to soak beans in both India and Africa. &nbsp;So this post is an update for me. &nbsp;That said, I still believe with around 60% confidence &nbsp;that soaking is the norm in India (most Indian recipes I've come across suggest soaking).</p><p><br>&nbsp;</p><p><br>&nbsp;</p>", "parentCommentId": null, "user": {"username": "Sagar K Shah"}}, {"_id": "FgwnNepWKy8yPkStr", "postedAt": "2023-08-07T17:02:18.801Z", "postId": "EAA5YeR6s6Ye2cZjD", "htmlBody": "<p>Thanks Geoffrey those are all good points. This is a very preliminary analysis so there are many directions I could have gone that I missed, including this one.</p>\n<p>2 notes on your nice botec.</p>\n<ul>\n<li>first only a third of Ugandans use charcoal in my calculations, so I think you should multiply your pet person calculation by 3.</li>\n<li>second you are calculating for every person, many of whom will be children. Savings per family will therefore be much higher. One person might be buying charcoal for 5-10 people, making their apparent saving much higher and increasing their likelihood of continuing the behavior. I'm not sure the best way to account for this</li>\n</ul>\n<p>This makes the apparent savings more in the ballpark of 1000 - 1500 USD a year. But I could easily have made a mistake here.</p>\n<p>I'm not sure also it would really be \"more convenient\" to go back from soaking to no soaking. It's probably a 45 minutes plus time saving. The real difficulty will bringing about be the behavior change in the first place, which is why I went for something like a 20 percent chance of convincing 1 percent of people. I feel like if people change to soaking, they will stay soaking.</p>\n<p>I have calculated these savings on the conservative end as well.</p>\n", "parentCommentId": "tWPZhDmGEjDw6GwkJ", "user": {"username": "NickLaing"}}, {"_id": "WnX8oqLscmraDvhu4", "postedAt": "2023-08-08T01:00:22.060Z", "postId": "EAA5YeR6s6Ye2cZjD", "htmlBody": "<p>Hi Nick,</p>\n<p>Ah I missed only a third of Ugandans cooking with charcoal (I’m guessing a third of Ugandan households since that’s usually how these surveys work). That does suggest we can bump up the estimate by 3x.</p>\n<p>I don’t think we can 5x the savings because of family size. Household savings go up (compared to my individual model) but so do household expenses. So the percent income gain from charcoal savings stays the same if both scale the same.</p>\n<p>(Technical detail: I’m not following how you got back to 1000-1500 USD from my 0.6 USD per-adopter estimate. That’s about 1500-2500x bigger than what I had!)</p>\n<p>Another point of ignorance is what the cooks are doing when not cooking. (Linch raised a related point in a sibling comment.) If someone’s home all day, has a reliable reserve of both beans and fuel, and cooks on a regular basis, then soaking sounds free. I’m sure these are all things you’ll find out while asking around though.</p>\n<p>On a final meta note, I’m not sure if you want the benefits here to be as large as possible. You’ve mentioned calculating on the conservative end but it’s not obvious to me that larger benefits are always good</p>\n<p>If the charcoal savings benefit is too large, the household would have realized it on their own. To exaggerate this, suppose households could double their income by soaking beans but still weren’t doing it. There’s likely a big obstacle preventing them from soaking beans that we’d have to figure out.</p>\n<p>Put abstractly, importance goes up but tractability goes down with larger immediate benefits.</p>\n", "parentCommentId": "FgwnNepWKy8yPkStr", "user": {"username": "geoffreyyip"}}, {"_id": "YMzsCJwv545LjHPsD", "postedAt": "2023-08-09T07:55:05.056Z", "postId": "EAA5YeR6s6Ye2cZjD", "htmlBody": "<p>There's a big effort to increase access to <a href=\"https://drawdown.org/solutions/clean-cooking\">clean cooking</a>, especially in Africa. So it's entirely possible that this kind of intervention could be bundled with projects that are already giving away stoves (often in exchange for carbon credits now). I actually know someone leading a project like this in west Africa, no idea how different bean-cooking practices are in West Africa vs Uganda, but I could ask!</p>", "parentCommentId": null, "user": {"username": "samuel"}}, {"_id": "rFNBn7LrD6srvZKu9", "postedAt": "2023-08-09T07:57:05.853Z", "postId": "EAA5YeR6s6Ye2cZjD", "htmlBody": "<p>Potential extension project: how would using pressure cookers (not fancy instant pots, a regular old analogue one) affect the calculations? My intuition is that the cost of the cooker, ensuring safety standards are met, should be outweighed by the lifetime fuel and time saved.<br><br>Background: I was born in India and raised in the UK (my parents were born and raised in India). At least based on my Gujarati family in India (PS. a bunch of <a href=\"https://timesofindia.indiatimes.com/city/ahmedabad/gujarats-romance-with-east-africa-many-centuries-old/articleshow/22957037.cms\">Gujaratis (were) moved over to Uganda and Kenya during colonial times</a>...) soaking beans is slam dunk, but so is using a pressure cooker, which in my experience more than halves the time for cooking beans (one of my favourite investments in the past few years).<br><br>PS: Modern pressure cookers have an analogue safety mechanism to prevent exploding. The main downside is that after a few years of use the pressure doesn't build up quite so much since the heat and pressure affects the shape of the vessel.</p>", "parentCommentId": null, "user": {"username": "Dhruv Makwana"}}, {"_id": "KRDmXoGFFCfjgmrcL", "postedAt": "2023-08-09T18:14:59.380Z", "postId": "EAA5YeR6s6Ye2cZjD", "htmlBody": "<p>Love the clarity of the post but I agree with Geoffrey that the $ impact/household seems extremely low and I also don't follow how you get to $1k+/HH (which would be like doubling household income).</p><p>Back calculating to estimate benefits/household:</p><ul><li>$1.5m national savings over 5 years = $300k/year</li><li>Number of adopters:<ul><li>50m people in Uganda</li><li>5 people/household means 10m households</li><li>1/3 of households use charcoal: 10m/3 = ~3m households use charcoal</li><li>1% adopt: 3m * 1% = 30k adopting households</li></ul></li><li>Benefits/household: $300k/year over 30k adopting households = $10/household/ year (or just $1/person/year), which seems super low to me</li></ul><p>I'd guess that's at least part of why you don't see more bean soaking already, the savings are just so modest, unless I've missed something in my calculation.</p><p>As you note, behaviour change around cooking practices is also super hard. When I worked at One Acre Fund Tanzania, our 2 biggest failures were introducing clean cookstoves and high-iron beans, both of which people just didn't want to use because of how they conflicted existing norms, e.g. color of the new bean variety \"bled\" into ugali, making it look dirty.</p><p>So the $ benefits would make me skeptical of this as promising but I'm hoping I missed something big in my calculation!</p>", "parentCommentId": "WnX8oqLscmraDvhu4", "user": {"username": "Rory Fenton"}}, {"_id": "vwehsJ47XHjk87yhw", "postedAt": "2023-08-10T09:44:14.588Z", "postId": "EAA5YeR6s6Ye2cZjD", "htmlBody": "<p>Nice one Dhruv - I've thought about the pressure cooker idea a bit, and even thought of doing an analysis on it. &nbsp;I'm a bit worried about safety and uptake (like with soaking beans) but it has merit.</p><p>We cook on a charcoal stove here and I'm thinking I should get one myself too :D</p>", "parentCommentId": "rFNBn7LrD6srvZKu9", "user": {"username": "NickLaing"}}, {"_id": "7q27CysF59Hjp2pwo", "postedAt": "2023-08-10T09:56:06.459Z", "postId": "EAA5YeR6s6Ye2cZjD", "htmlBody": "<p>Nice one Rory and George I agree with most of your points and appreciate the engagement a lot! Its super true that change around cooking practise is super hard - perhaps I was being ambitious at a 20% chance of 1% conversion to soaking with a $300,000, but its very hard to know.<br><br>Sorry just to clarify, the apparent $1000 a year was in response to this -. <i>\"To put that into a scale my first-world brain can understand, 0.006% over 100,000 USD is 60 USD. It’s definitely something but also feels low return for the habit change. And at that price, could easily see someone reverting back to cooking beans w/o soaking for the convenience.\"</i>&nbsp;<br><br>I was just correcting Geoffry's 60 x 3 (for the 1/3 of population) and then x 5-10 (family size people are cooking for) saying that on his \"American scale\", the apparent savings to the person buying the charcoal might be more like 1000 dollars a year. Probably shouldn't have waded into that because of the cnfusion.</p><p>I think when we look at dollar benefits, it is important to look both on an individual and population level. I completely agree that those small individual monetary benefits will make it hard to convince people to change - but one advantage is the benefits (however tiny) are visible on a day to day basis.&nbsp;</p><p>But if 1% of the population could be convinced, then the aggregate benefit of money saved would be big - even if many families/individuals barely noticed the difference.</p><p>As a side note, I was pretty conservative on some inputs (charcoal saved, charcoal cost) so the benefits might be higher than stated here, even if only by a maximum of maybe 3x at the upper end.<br><br>&nbsp;</p>", "parentCommentId": "KRDmXoGFFCfjgmrcL", "user": {"username": "NickLaing"}}, {"_id": "EHRpTQmRB9jaBgsD6", "postedAt": "2023-08-10T13:32:58.301Z", "postId": "EAA5YeR6s6Ye2cZjD", "htmlBody": "<p>Hi Nick – this is a great post, I also live in Uganda and am a big bean-soaking advocate! So great to hear someone else is fighting the good fight! I have not looked at your calculation but agree that the indoor air pollution reduction benefits could be significant. I do think you are overestimating how easy it is to successfully implement behaviour change interventions though, especially inside the home with gendered decision-making norms. Super happy to see this on the forum :)&nbsp;</p>", "parentCommentId": null, "user": {"username": "harriet"}}, {"_id": "HW6g7fm6XFtmpkMRb", "postedAt": "2023-08-10T14:44:39.033Z", "postId": "EAA5YeR6s6Ye2cZjD", "htmlBody": "<p>Random thought: you mention it's not always easy to get clean drinking water. Is there anything in the water in Uganda that could become dangerous to consume if left sitting around for 12 hours? Maybe there are different bean soaking norms in Uganda compared to other countries because you get sick after consuming stagnant water there? (Bean soaking is the norm for other developing countries I'm aware of.)<br><br>Also, now I'm really hungry for beans ;)</p>", "parentCommentId": null, "user": {"username": "AbbyBabby"}}, {"_id": "mXhCZCSwPBviEgFsg", "postedAt": "2023-08-10T19:36:42.360Z", "postId": "EAA5YeR6s6Ye2cZjD", "htmlBody": "<p>Wow nice one Harriet I didn't know anyone else living in Uganda was in the forum. I must confess I'm not yet \" fighting the good fight\", just writing a potential cost effectiveness pay p ok st</p>\n<p>I'm interested that your think a concerted program with have less than a 20 percent chance of positive persuading 1 percent of people to soak beans. I know changes inside the house are super hard, but what from your experience here makes you think it might be close to impossible?</p>\n", "parentCommentId": "EHRpTQmRB9jaBgsD6", "user": {"username": "NickLaing"}}, {"_id": "x6DDGSEwfzK7nnQAv", "postedAt": "2023-08-10T19:42:34.600Z", "postId": "EAA5YeR6s6Ye2cZjD", "htmlBody": "<p>Haha we ate beans just now (as we do a few nights a week).</p>\n<p>After soaking the beans, the water is discarded and the new water is boiled for an hour. I have fairly high confidence there is no major issues here.</p>\n<p>As a side note, more and more boreholes and protected springs (usually pipees coming out of the ground) are available around Uganda, and the national water piping system is spreading around cities. Development is real, and this has been one clear, positive improvement over the last few years here.</p>\n", "parentCommentId": "HW6g7fm6XFtmpkMRb", "user": {"username": "NickLaing"}}, {"_id": "yLFiBrmrJpFRcAYeH", "postedAt": "2023-08-10T19:43:42.885Z", "postId": "EAA5YeR6s6Ye2cZjD", "htmlBody": "<p>Thanks so much Tom. I'm probably going to just copy your analysis and adjust it to look at that potential here. Appreciate the encouragement!</p>\n", "parentCommentId": "DethxKCzAsYCnghwT", "user": {"username": "NickLaing"}}, {"_id": "jrEpfSuhvLxKcjtx6", "postedAt": "2023-08-10T21:36:10.947Z", "postId": "EAA5YeR6s6Ye2cZjD", "htmlBody": "<p>A minor thing on the CO2 emissions reductions is it should probably be considered whether the trees would be cut down anyway if they weren't used for wood. I think you'd want to know the net deforestation due to collecting firewood, presuming that forest expansion would be cut back anyway for other reasons.</p>", "parentCommentId": null, "user": {"username": "Pagw"}}, {"_id": "b7K82NmqTmoYjpHgG", "postedAt": "2023-08-11T01:06:49.462Z", "postId": "EAA5YeR6s6Ye2cZjD", "htmlBody": "<p>Great to hear the water infrastructure is improving! Seems like a huge boost to quality of life :)&nbsp;<br><br>The mystery of the beans continues though...</p>", "parentCommentId": "x6DDGSEwfzK7nnQAv", "user": {"username": "AbbyBabby"}}, {"_id": "uCsneuFRhjfGX4qeN", "postedAt": "2023-08-11T04:53:34.954Z", "postId": "EAA5YeR6s6Ye2cZjD", "htmlBody": "<p>Thanks that's a really good point, I'm not sure its all that minor, especially if trees were getting planted for the purpose of charcoal) firewood then heartbeats, then replanted. Which is I thinkunfortunately. I will edit the assumptions to include that the trees</p>\n<ol>\n<li>Wood not be replanted</li>\n<li>Would not have been cut down anyway</li>\n</ol>\n<p>Which is very likely to be pretty close to true I think</p>\n<p>Nicer on</p>\n", "parentCommentId": "jrEpfSuhvLxKcjtx6", "user": {"username": "NickLaing"}}, {"_id": "rBeNxftDGAXzvBziC", "postedAt": "2023-08-11T16:07:47.025Z", "postId": "EAA5YeR6s6Ye2cZjD", "htmlBody": "<p>That sounds like a fascinating case study. Do you have a link to somewhere where I can read more about this? Or lacking that, at least the name of the company?</p>", "parentCommentId": "mejqqKbMiQbmN5BY9", "user": {"username": "jlemien"}}, {"_id": "taKhyS2Fcw9Cd6ewo", "postedAt": "2023-08-12T22:53:03.151Z", "postId": "EAA5YeR6s6Ye2cZjD", "htmlBody": "<p>Pretty sure its not public. I only know about it because the anthropologist and I were staying at the house of the same mutual friend for a two week overlap.</p><p>I think it was Bboxx.</p><p>&nbsp;</p><p>The most interesting thing I heard though was how much the military (FARDC) benefits from the illicit trade of charcoal. The FLDR (major armed group) has been described as a charcoal cartel operating in Virunga Park and for this reason US representatives and others have wanted to get people in Goma to switch to another fuel source so that it hurts the revenue of the FDLR.</p><p>The anthropologist followed charcoal from the source to the end market and documented all the mark-ups it went through. The amount that came from the FDLR taxing the movement of the good was less than what traffickers had to pay the FARDC at various check points. The conclusion of the anthropolist was that the framing of the FDLR acting like a cartel with charcoal was not accurate and the military has vested interest in the trade as well.</p>", "parentCommentId": "rBeNxftDGAXzvBziC", "user": {"username": "Yelnats T.J."}}, {"_id": "eXPbrcJvjRidqvw2A", "postedAt": "2023-08-13T16:41:14.250Z", "postId": "EAA5YeR6s6Ye2cZjD", "htmlBody": "<p>Yeah this stuff is really common, pretty interesting that both the rebels and the army were creaming off the top. Any high value commodity in East Africa is highly likely to have army involvement in its control.</p><p>In Uganda here many of the biggest charcoal production operations are controlled by the army..</p>", "parentCommentId": "taKhyS2Fcw9Cd6ewo", "user": {"username": "NickLaing"}}, {"_id": "ov7cw3DogRk4gh6uG", "postedAt": "2023-08-14T19:47:57.691Z", "postId": "EAA5YeR6s6Ye2cZjD", "htmlBody": "<p>Baking soda may not always be readily accessible, but where it is adding about a teaspoon of baking soda to a liter of water also dramatically cuts down bean cooking time from dry. Possible to cook chickpeas in ~45 mins to an hour, instead of 2 or 3 (in my experience), and you don't have to remember as far ahead of time as with soaking.&nbsp;<br>&nbsp;</p><p>Otherwise, I feel like a radio or sms campaign in areas with high access to those resources would be a pretty cheap way to disseminate this info.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Jendayi Jones"}}, {"_id": "tkEA4yvWEdnedQzjy", "postedAt": "2023-08-15T09:45:16.569Z", "postId": "EAA5YeR6s6Ye2cZjD", "htmlBody": "<p>Hey NickLaing, this is a really interesting post, thank you!&nbsp;</p><p>On this note, do you think that the army could be a significant obstacle to soaking beans then? If the army realised that there was this campaign that risked reducing the amount of charcoal bought per person, might they be considered a key obstacle to the chances of success e.g. not allowing bean-soaking campaigns in markets, not allowing it on the radio, etc.?&nbsp;</p><p>I am very naive on how much control the Ugandan army has but just a thought in terms of factoring in likelihood of success, given they may pose a powerful obstacle as they have a clear interest in charcoal consumption going up, not down.&nbsp;</p><p>I love your replies in the comments and openness to feedback/ideas/corrections. I will PM you out of interest re the garment technique you introduced if I may and also 100% agree with you - we can't assume that bean-soaking wouldn't work simply because it's not been done before, just as goes for any number of examples such as the one you make on on pond loaches (also interested to hear what work you are doing on this as that is a horrific way of slaughtering).&nbsp;</p>", "parentCommentId": "eXPbrcJvjRidqvw2A", "user": {"username": "william sorflaten"}}, {"_id": "ie55wisxPcvcYnvTn", "postedAt": "2023-08-27T03:28:16.635Z", "postId": "EAA5YeR6s6Ye2cZjD", "htmlBody": "<p>Perhaps it's because of farts? I hope I don't get downvoted for bringing this up\n– it's serious and, I suspect, a major inconvenience for people who cook beans\nfrom scratch.</p>\n<p>It could be that cooking beans for a long time (maybe combined with regular\nskimming or whatever other techniques we don't know about) makes them cause way\nless flatulence than soaking them in little water and cooking for a short time.\nPeople recommend soaking for reducing beans' gas-generation potential, but in my\nexperience (yes, I've used a tally counter to count my farts under different\nsoaking and cooking conditions and bean species, but obviously N=1) it takes a\nlot of soaking water to do that. I've found 7 l for 500 g of dry beans to work\ndecently. After soaking I drain and then cook in a small amount of water.</p>\n<p>And soaking with a lot of water has implications that might not work for\nUgandans:</p>\n<ul>\n<li>You need a much bigger soaking container than cooking container. (Or have to\nsoak in multiple changes of water, which becomes tedious.)</li>\n<li>You need more water.</li>\n<li>If you want a lot of beans for dinner, draining the water becomes physically\ndifficult for one person.</li>\n</ul>\n<p>Speaking of dinner: If you eat three meals with beans per day, you'll have two\nor three containers going for soaking. It's likely easier to have one pot over\nthe fire that just gets restarted soon after each meal. (Assuming that\nrefrigeration is hard to come by in Uganda.)</p>\n<p>Further practical issues:</p>\n<ul>\n<li>If the beans are small, draining the soaking water requires a sieve or\ncolander, which people might not have.</li>\n<li>Beans start to ferment when soaked in hot weather (as mentioned in other comments, I\nthink). The more they ferment, the stranger they taste and the longer they\nneed to be cooked because of acid building up. (Try and cook some beans with\nvinegar added to the water.)</li>\n<li>It's easy to forget to start soaking them in time.</li>\n</ul>\n<p>Personally, I do soak and use a pressure cooker. But perhaps that's a luxury.</p>\n", "parentCommentId": "cbEPzyfJAiKvMC3mk", "user": {"username": "rmoehn"}}, {"_id": "3Rf2XJuos36pAfpTA", "postedAt": "2023-08-28T12:06:03.707Z", "postId": "EAA5YeR6s6Ye2cZjD", "htmlBody": "<p>Hey Richard thanks so much for the comments.</p>\n<p>We are doing a bit of research, and your fermenting comment is a definite fear here, be and I'm going to test how long we can leave them before they start to ferment soon. This might be the biggest single concern issue people have raised so far</p>\n<p>The beans here are usually quite big, I don't think draining is a major issue.</p>\n<p>The water issues are good ideas, but my impression is at the moment they are not a major issue.</p>\n<p>7 liters per 500g is quite a lot to be sure, but I'm not sure would be a major barrier, I could be wrong</p>\n<p>I'm about to make a quickpost with some initial results from our quick community survey, which will address a couple of these at least</p>\n", "parentCommentId": "ie55wisxPcvcYnvTn", "user": {"username": "NickLaing"}}, {"_id": "J78FCEX2hrZQ2Ns8X", "postedAt": "2023-08-29T01:35:41.032Z", "postId": "EAA5YeR6s6Ye2cZjD", "htmlBody": "<p>Sounds good!</p>\n<p>By the way, another thing one might try: Adding salt during the soaking and again during the cooking. Perhaps one teaspoon per kg of beans. In my experience, it also reduces cooking times. I haven't evaluated it rigorously, though.</p>\n", "parentCommentId": "3Rf2XJuos36pAfpTA", "user": {"username": "rmoehn"}}, {"_id": "RGi7DfxBoCWHBvDdx", "postedAt": "2023-09-02T21:04:27.260Z", "postId": "EAA5YeR6s6Ye2cZjD", "htmlBody": "<p>They're somewhat more fiddly - if the rubber gasket cracks or if the pressure regulator knob gets lost (on an old style one) it just becomes a normal pot. Worst case the valve gets blocked and it explodes.</p>", "parentCommentId": "rFNBn7LrD6srvZKu9", "user": {"username": "Julia_Wise"}}, {"_id": "LkXbpMFX9KqLRQGXK", "postedAt": "2023-09-05T07:08:21.549Z", "postId": "EAA5YeR6s6Ye2cZjD", "htmlBody": "<p>Newer ones come with silicone gaskets which don't crack as easily (and these are easily replaced in any case) and if the valve gets blocked there's an analgoue release valve which is designed to pop first (search for \"pressure cooker safety relief valve\" to see), which is also replaceable.</p>\n<p>So the worst case is actually \"user didn't wait for steam to emerge before putting on the weight, AND the valve gets blocked, AND the safety valve was replaced with a bad one\" and then it explodes.</p>\n<p>The additional handful of steps (lock in lid, wait for steam, place weight, and then after cooking unlock lid, check valve is clear) is definitely worth the time and energy savings.</p>\n", "parentCommentId": "RGi7DfxBoCWHBvDdx", "user": {"username": "Dhruv Makwana"}}, {"_id": "H5DfGQmbHuqTD2Agn", "postedAt": "2023-09-06T16:21:07.880Z", "postId": "EAA5YeR6s6Ye2cZjD", "htmlBody": "<p>Are you aware there is a campaign to double bean consumption by 2028? It is called <a href=\"https://sdg2advocacyhub.org/beans-is-how/\">Beans is How</a> and it seems to be backed by a pretty big and well-funded organization. Bean soaking could potentially be added to their educational materials for additional tractability.</p>", "parentCommentId": null, "user": {"username": "Constance Li"}}, {"_id": "f8yJ4YtjE7cjEDNRT", "postedAt": "2023-09-07T06:47:02.564Z", "postId": "EAA5YeR6s6Ye2cZjD", "htmlBody": "<p>Wow that's amazing they look quite big and serious, will definitely contact them!</p>\n", "parentCommentId": "H5DfGQmbHuqTD2Agn", "user": {"username": "NickLaing"}}, {"_id": "q3TbiEdgd9xxLDAbB", "postedAt": "2023-12-23T05:51:46.410Z", "postId": "EAA5YeR6s6Ye2cZjD", "htmlBody": "<p>Fascinating. I have Indian roots and was born in the UK, while my parents hail from East Africa (Uganda and Kenya). Growing up as vegetarians, our household frequently featured beans and pulses in our meals. It was customary for us to soak beans overnight and also to pre-soak rice before cooking.</p><p>Reflecting on my own experiences, I had always assumed that soaking beans was a common practice in both India and Africa. However, this post has brought me new information. Nevertheless, I still maintain a belief, with about 60% confidence, that soaking is prevalent in India, as many Indian recipes I've encountered often recommend this step.</p>", "parentCommentId": "gkvWKmCHfLxGhyMyj", "user": {"username": "cetter com"}}, {"_id": "3Kb2KbWnFdGhpK3Wq", "postedAt": "2023-12-28T08:46:42.924Z", "postId": "EAA5YeR6s6Ye2cZjD", "htmlBody": "<p>Thanks Cetter what an interesting background your family has.<br><br>Yes from comments here and the research I've done, soaking seems to be mostly the norm in India, while it certainly isn't in Uganda. Also interesting that you would soak rice as well, I've never actually considered that one!</p>", "parentCommentId": "q3TbiEdgd9xxLDAbB", "user": {"username": "NickLaing"}}]