[{"_id": "Lt3qt4YmmdySZdiYg", "postedAt": "2022-11-06T21:32:57.709Z", "postId": "EafGgKEwzE4uQfKwv", "htmlBody": "<p>Interesting approach, trying to synthesize Financial Independence with effective giving!\n(are there others in the forum pursuing FI?)\nWhile I don't have a direct solution to the PDF questions, wanted to mention an initiative that could be relevant - a way to get your savings do good:\n<a href=\"https://forum.effectivealtruism.org/posts/FMgvYitqeikgTxpcw/global-income-coin-a-ubi-generating-currency\">https://forum.effectivealtruism.org/posts/FMgvYitqeikgTxpcw/global-income-coin-a-ubi-generating-currency</a></p>\n", "parentCommentId": null, "user": {"username": "Eli Kaufman"}}, {"_id": "jowJkDSLKxTjGQqKD", "postedAt": "2022-11-06T23:12:46.237Z", "postId": "EafGgKEwzE4uQfKwv", "htmlBody": "<p>From my limited knowledge of finance and law, I think that a <a href=\"https://www.fidelity.com/life-events/estate-planning/trusts\">trust</a> would do everything you are looking for: you put your money into the trust, and the the trust follows particular rules that you set up. Rules such as \"give me a 4% distribution annually\" and \"give all money to X upon my death\" would be pretty easy to set up. The idea of borrowing against it might be a bit trickier.</p><p>But I think that the advantage of having the money outside of your control is relatively minor, while the disadvantages seem a bit larger. If you <strong>really </strong>do not trust your future self, then it might be worth it to set up a trust. But in general I would simply recommend putting the money into an instrument like a 401k or an IRA so that you are able to access the money early in case of emergency, but with a financial penalty to motivate you to not touch it. Excess money can be invested into a target date retirement fund in a brokerage account. Overall, I'm not convinced that the idea is worth doing, although I do find the concept interesting.</p><p>A very nit-picky note: <a href=\"https://en.wikipedia.org/wiki/Trinity_study\">the study </a>that is famous for suggesting 4% of your assets as sustainable is only intended for a retirement of 30 years: it had a .95 probability of still having 0 or more dollars in it after 30 years. If you plan to live off of your investment for more than 30 years, then &nbsp;<a href=\"https://earlyretirementnow.com/2016/12/07/the-ultimate-guide-to-safe-withdrawal-rates-part-1-intro/\">3.5% should serve you pretty well</a> (all the normal caveats apply: allocation matters, sequence of return risk matter, market performance matters, etc.).</p>", "parentCommentId": null, "user": {"username": "jlemien"}}, {"_id": "eGYHboYLf4JYijBx6", "postedAt": "2022-11-07T08:46:27.779Z", "postId": "EafGgKEwzE4uQfKwv", "htmlBody": "<p>If you want to do this, I think you should also be confident the money you save now and donate later will have an impact that is just as big as the money you would donate right now if you hadn't saved it. I do not have a strong opinion on this myself, but if you think the current moment is especially influential (e.g. hinge of history hypothesis) and donations made right now could have an especially large impact, this might influence your decision.</p><p><a href=\"https://forum.effectivealtruism.org/posts/Ne8ZS6iJJp7EpzztP/the-optimal-timing-of-spending-on-agi-safety-work-why-we\">This</a> post explains a framework for thinking about these questions. It's about AGI timelines but maybe the framework explained there could have wider applicability, and it also has a lot of references.</p>", "parentCommentId": null, "user": {"username": "Irene Hulsen"}}, {"_id": "7XkxEieub3SHstKQG", "postedAt": "2022-11-07T16:10:27.813Z", "postId": "EafGgKEwzE4uQfKwv", "htmlBody": "<p>Thanks, this is really helpful information about trusts and the 4% rule!&nbsp;<br><br>On self trust: I feel that a common pattern might be that when you're young, you're 'idealistic' and want to do things like donate. When you're older, you feel like spending your money (if you have it) in ways that might not make you particularly happy. I might even decide I would rather give it all to my kids (if I have some). This makes me think there's a good chance I won't donate it later if I haven't pre-committed.&nbsp;<br><br>On safety: I am from Australia, and to some extent my context is probably quite different to many others. (On the whole, Australia tends to look after you if you get severely injured or run entirely out of money. This makes quick access less of a pressing consideration for me). But to the extent that it is an important consideration, why not have a little money that's easily accessible and most of it in a trust?</p>", "parentCommentId": "jowJkDSLKxTjGQqKD", "user": {"username": "rileyharris"}}, {"_id": "FoGvRYFYJjfyA8xmK", "postedAt": "2022-11-07T18:17:09.841Z", "postId": "EafGgKEwzE4uQfKwv", "htmlBody": "<p>This was another discussion of EA/FIRE</p><p>https://forum.effectivealtruism.org/posts/j2ccaxmHcjiwGDs9T/ea-vs-fire-reconciling-these-two-movements</p>", "parentCommentId": "Lt3qt4YmmdySZdiYg", "user": {"username": "Tyner"}}, {"_id": "nq4CoEmJvFHspjG2Q", "postedAt": "2022-11-07T18:39:43.418Z", "postId": "EafGgKEwzE4uQfKwv", "htmlBody": "<p>Oh, Australia. I fell prey to the common mistake of \"assuming other people people are like me.\" I know a good deal about personal finance in a USA context, but only parts of that are universal: good chunks of it are particular to a specific national context. The national context matters a lot in personal finance issues.</p><p>Your idea of \"have a little money that's easily accessible and most of it in a trust\" does make sense. Have an 'emergency fund' or 'support myself fund' with enough money for a a year or two of expenses, and then have everything else in a fund that transfers X% into your 'support myself fund' each year (or 1/12th of X% each month). If you do it right, the trust should grow indefinitely, and the inflow to your 'support myself fund' will be larger than your expenses.</p><p>I think that I don't have anything particularly wise or useful to write about the whole 'trusting your future self' topic. But I imagine that there are likely personal finance professionals who have done research about that time of thing. It might take some poking around to find it though.</p>", "parentCommentId": "7XkxEieub3SHstKQG", "user": {"username": "jlemien"}}]