[{"_id": "ZNbx3YfauSKW4yhyQ", "postedAt": "2018-03-13T23:57:13.974Z", "postId": "EAi24qrjxdzup3GjJ", "htmlBody": "<p>I find when I do up a draft of a post in Google Docs, and copy-paste the whole thing to either the EA Forum or LW, the hypertext link formatting remains intact. Sometimes it can mess up the other formatting, though, so it's not the best idea if you're using bullet points or other graphical elements in a post. If you could write up posts in Google Docs and copy-paste them to your Medium blog too without having to recreate the links, then you wouldn't have the problem with recreating links on one or the other site. I don't have a Medium blog, so I wouldn't know if it's possible to copy-paste into it with the links intact.</p>\n", "parentCommentId": null, "user": {"username": "Evan_Gaensbauer"}}, {"_id": "NNS2AorMDL5W4ki4b", "postedAt": "2018-03-15T00:03:50.467Z", "postId": "EAi24qrjxdzup3GjJ", "htmlBody": "<p>This is the approach I used to get <a href=\"http://effective-altruism.com/ea/1jo/ea_givingtuesday_fundraiser_matching_retrospective/\">this article</a> on the EA Forum:</p>\n<ul>\n<li>Used the &quot;Publish to the web&quot; feature in Google Docs.</li>\n<li>Did a copy/paste from Firefox to the EA Forum. (Firefox generated much less messy content than Chrome.)</li>\n<li>I manually fixed all the links to remove the <a href=\"https://www.google.com/url\">https://www.google.com/url</a> redirect junk. (Not strictly necessary, but it annoyed me.)</li>\n<li>I edited the HTML heavily to get the one table to show up right.</li>\n<li>I made a lot of other manual edits.</li>\n</ul>\n<p>It was a pain though.</p>\n", "parentCommentId": "ZNbx3YfauSKW4yhyQ", "user": {"username": "AviN"}}, {"_id": "KymMHLrJHQ8zyAaF5", "postedAt": "2018-03-15T03:44:06.956Z", "postId": "EAi24qrjxdzup3GjJ", "htmlBody": "<p>This article has many parallels with Greg Lewis' <a href=\"https://thebulletin.org/horsepox-synthesis-case-unilateralist%E2%80%99s-curse11523\">recent article</a> on the unilateralist's curse, as it pertains to biotechnology development.</p>\n<p>If participation in an SRO is voluntary, even if you have 9/10 organisations on board how do you stop the final from proceeding with AGI development without oversight? I'd imagine that the setup of a SRO may infer disadvantages to participants potentially, thus indirectly incentivizing non-participation (if the lack of restrictions increase the probability of reaching AGI first). </p>\n<p>Do you anticipate a SRO may be an initial step towards a more obligatory framework for oversight?</p>\n", "parentCommentId": null, "user": {"username": "cassidynelson"}}, {"_id": "XaZx9eW7GhH5umeSF", "postedAt": "2018-03-15T18:55:54.060Z", "postId": "EAi24qrjxdzup3GjJ", "htmlBody": "<p>An SRO might incentivize participation in several ways. One is idea sharing, be it via patent agreements or sharing of trade secrets among members on a secure forum. Another is via social and possibly legal penalties for non-participation, or by acting as a cartel to lock non-participants out of the market the way many professional groups do.</p>\n<p>That said it does seem a step in the direction of legal oversight, but moves us towards a model similar to so-called technocratic regulatory bodies rather than one where legislation tries to directly control actions. Creating an SRO would give us an already-existing organization that could step in to serve this role in an official capacity if governments or inter-governmental organizations choose to regulate AI.</p>\n", "parentCommentId": "KymMHLrJHQ8zyAaF5", "user": {"username": "gworley3"}}]