[{"_id": "eNBtZESSrM6HGt8X9", "postedAt": "2022-09-15T15:46:48.686Z", "postId": "EAiwxZN4Jiyup8d9G", "htmlBody": "<p>No comment on the weaker claims in this article, but if Glo reached $11T, it would need to massively increase the amount of outstanding short-term Treasury bills, which would greatly decrease the yield (assuming the US government is willing to lend that much). I believe the Treasury issues roughly $1T in short-term bills every 3 months, so you'd need ~10x this number.</p>\n", "parentCommentId": null, "user": {"username": "MichaelDickens"}}, {"_id": "sMkMhsiMqBWT232wg", "postedAt": "2022-09-15T16:26:31.470Z", "postId": "EAiwxZN4Jiyup8d9G", "htmlBody": "<p>This looks a lot more promising than the original post, so I'm very impressed at the continued evolution of this idea!<br><br>So, if I understand correctly, the current setup (or, the setup in a month or two) is roughly equivalent to the idea of - I give you money, you invest that money in a very low-risk investment, that profit goes to GiveDirectly, and if I need the money back, you give it to me. The reason it's a cryptocurrency is that there are plans to eventually allow GLO to be used as cash for various things. This is important because GLO is designed to be held in checking accounts, savings accounts, and emergency funds, not long-term investments - it doesn't compete in yield with the stock market, but that's not the intention.<br><br>Have I got that right?<br><br>Some additional questions:<br><br>How quickly, and at what cost, will I be able to exchange a currency (whether USD or non-USD) for GLO, and back again?<br><br>Is there a long-term plan to extract some amount of the T-bond interest for operational expenses? Do you see yourself being donor-funded indefinitely?&nbsp;<br><br>&nbsp;</p>", "parentCommentId": null, "user": {"username": "Jay Bailey"}}, {"_id": "gJTo5nwsb5DYkbKP3", "postedAt": "2022-09-15T16:46:38.072Z", "postId": "EAiwxZN4Jiyup8d9G", "htmlBody": "<p>On the T-bond for operational expenses...I really hope not. It really messes with the purity of message, and if the impact is there, they should get support and not be forced to muddy the message for the general public. Just 100% of yield goes to Givedirectly. Then let the people who know the great work that GLO is doing support it.</p>\n<p>Just like Givewell... If people thought their donation was supporting Givewell's overhead, they would be less likely to support the Impact Fund.</p>\n<p>Smart EAs should support effective institutions and enable those institutions to offer clearer propositions to the public.</p>\n", "parentCommentId": "sMkMhsiMqBWT232wg", "user": {"username": "Brad West"}}, {"_id": "xPCqKJz39jdDPw33B", "postedAt": "2022-09-15T16:54:23.972Z", "postId": "EAiwxZN4Jiyup8d9G", "htmlBody": "<p>Hi Michael, just for our own curiosity, what <i>are</i> the weaker claims in this article, from your view?&nbsp;</p><p>We know that there is a limit to the amount of US T-bills that can be efficiently held in the market. If Glo reaches trillions of dollars of market cap, we're most likely operating in a world where we issue multiple stablecoins in different currencies. Each reserve would then be backed by government bonds denominated in each stablecoin's currency.</p><p>Our estimates of yield are based on T-bill yield, but, ofc, what assets will yield (or even exist) in the future where we're planetary scale is hard to speculate about. We think that somewhere in the 2.5%-3% range for cash equivalent investments is a good baseline estimate. Does that seem reasonable to you?</p>", "parentCommentId": "eNBtZESSrM6HGt8X9", "user": {"username": "setgree"}}, {"_id": "9xeJev6BYq9uhiz8e", "postedAt": "2022-09-15T16:59:42.038Z", "postId": "EAiwxZN4Jiyup8d9G", "htmlBody": "<p>Hi Jay, thanks for the kind words!</p><p>Your summary is correct and pithy to boot! Perhaps we'll link people to it if they ask what our deal is 😃&nbsp;</p><ol><li>For individual buyers, Glo will be available at crypto exchanges. Selling Glo for USD on an exchange should be essentially instantaneous (depending on the exchange). How long it takes to get to your <i>bank account</i> will vary from place to place. In Europe, it takes like a day but, for reference, <a href=\"https://help.coinbase.com/en/coinbase/trading-and-funding/buying-selling-or-converting-crypto/why-does-a-sell-take-so-long\">Coinbase estimates 3-5 days for US customers</a>. Hope that helps!</li><li>We don't currently plan to use yield to fund our operations. But standard caveat about the future being unwritten, &nbsp;we'll have to evaluate based on our donor base, etc.</li></ol>", "parentCommentId": "sMkMhsiMqBWT232wg", "user": {"username": "setgree"}}, {"_id": "RkNLmpZpZ9DXKQnqA", "postedAt": "2022-09-15T17:00:58.402Z", "postId": "EAiwxZN4Jiyup8d9G", "htmlBody": "<p><a href=\"https://emojipedia.org/clapping-hands/\"><u>👏 </u></a>Thank you for your kind words Brad!</p>", "parentCommentId": "gJTo5nwsb5DYkbKP3", "user": {"username": "setgree"}}, {"_id": "zWvz3rdXnzM4WSiPw", "postedAt": "2022-09-15T18:17:04.205Z", "postId": "EAiwxZN4Jiyup8d9G", "htmlBody": "<blockquote>\n<p>Hi Michael, just for our own curiosity, what are the weaker claims in this article, from your view?</p>\n</blockquote>\n<p>I meant that if you want to get Glo to, say, $1 billion market cap, then it doesn't run into problems with the supply of T-bills, and I have no comment on whether it's viable. But I disagree with your claim that Glo could eradicate world poverty, even at the most extreme upside.</p>\n", "parentCommentId": "xPCqKJz39jdDPw33B", "user": {"username": "MichaelDickens"}}, {"_id": "vbQFDRzxM42Jmj3TK", "postedAt": "2022-09-15T18:48:36.909Z", "postId": "EAiwxZN4Jiyup8d9G", "htmlBody": "<p>So, speaking for myself and not for Global Income Coin, I think that there are many ways to challenge the link between cash transfers and 'eradication' of poverty. You might argue that&nbsp;</p><ul><li>cash doesn't address the <a href=\"https://economics.mit.edu/files/530\">behavioral components of enduring poverty</a>;&nbsp;</li><li>spillovers are inevitable at essentially anything short of planetary scale, and prelim evidence <a href=\"https://www.vox.com/2016/1/23/10810978/cash-transfer-givedirectly-spillover\">suggests they're harmful</a>;</li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2018/09/chris-blattman-becoming-skeptical-cash-transfers.html\">Some evidence from Uganda</a> suggests that there's no meaningful difference 9 years later between recipients and non-recipients;</li></ul><p>and probably many others. Does one of these motivate your skepticism? Or something else? This is purely for our edification, though we're happy to discuss if you'd like.</p><p>FWIW, extreme poverty is generally declining over time, and our best-case scenario is to speed that up. But either way, <a href=\"https://ourworldindata.org/extreme-poverty\">something like 2/3 of all people are living on less than $10 a day</a> -- so not conventionally defined as <i>extremely</i> poor, but still people for whom $1/day could make a real difference.&nbsp;</p>", "parentCommentId": "zWvz3rdXnzM4WSiPw", "user": {"username": "setgree"}}, {"_id": "v79pxbS24qqdnHpRu", "postedAt": "2022-09-15T22:21:40.880Z", "postId": "EAiwxZN4Jiyup8d9G", "htmlBody": "<p>Hi!</p><p>Glo is still looking like an interesting funding option for GiveDirectly.</p><p>There have been about 8 years in the past 15 year where 3-month US treasury yields were close to 0%, from 2009-2016, and 2020-2022.&nbsp;</p><ol><li>What are your options for delivering $$ to giveDirectly when government bonds stay close to zero (or possibly dip into negative territory)?</li><li>What are your options for alternative investments?</li></ol>", "parentCommentId": null, "user": {"username": "Noah Scales"}}, {"_id": "qv7H4QDyHcSqqxJFG", "postedAt": "2022-09-15T23:00:09.904Z", "postId": "EAiwxZN4Jiyup8d9G", "htmlBody": "<p>The thing that motivates my skepticism is what I said in my first comment: I don't think you can buy $11T of T-bills at anywhere close to current interest rates.</p>\n", "parentCommentId": "vbQFDRzxM42Jmj3TK", "user": {"username": "MichaelDickens"}}, {"_id": "K5EZC5BSZYdfyHmwm", "postedAt": "2022-09-16T00:44:46.469Z", "postId": "EAiwxZN4Jiyup8d9G", "htmlBody": "<p>Does the Impact Fund not take a small percentage to support GiveWell's overhead? I just always assumed they did.</p>", "parentCommentId": "gJTo5nwsb5DYkbKP3", "user": {"username": "Jay Bailey"}}, {"_id": "Q6sGw62FY2LaB5C52", "postedAt": "2022-09-16T03:04:13.424Z", "postId": "EAiwxZN4Jiyup8d9G", "htmlBody": "<p>There aren't any safe investment instruments other than treasuries?</p>\n", "parentCommentId": "qv7H4QDyHcSqqxJFG", "user": {"username": "Brad West"}}, {"_id": "euMauAmJhrdBnpePK", "postedAt": "2022-09-16T13:27:09.865Z", "postId": "EAiwxZN4Jiyup8d9G", "htmlBody": "<p><a href=\"https://emojipedia.org/waving-hand/\"><u>👋</u></a> This comes up often enough that I added a footnote (no. 5) to address it; &nbsp;repasting it here</p><blockquote><p>If Glo reaches trillions of dollars of market cap, we're most likely operating in a world where we issue multiple stablecoins in different currencies. Each reserve would then be backed by government bonds denominated in each stablecoin's currency.</p></blockquote><p>So our truly long-term vision doesn't depend fully on T-bills, though what yield we get in such a scenario is hard to predict. &nbsp;Thanks for prompting us to communicate more clearly about this</p>", "parentCommentId": "qv7H4QDyHcSqqxJFG", "user": {"username": "setgree"}}, {"_id": "494gciST6K9kqtAGq", "postedAt": "2022-09-16T13:50:40.853Z", "postId": "EAiwxZN4Jiyup8d9G", "htmlBody": "<p>Hi Noah, good to hear from you again!</p><ol><li>&nbsp;The post-great recession period has been a historical anomaly, and in general, we expect interest rates (and short-term T-bill yields, which are tightly coupled with interest rates) to be positive. But if and when yield dips to zero, we'll prioritize stability over yield, meaning we'll halt income transfers rather than pursue riskier investments. If zero/negative yield truly is the new normal, then we'll have to seriously reassess.&nbsp;</li><li>I just added this as a footnote to the paper (no. 5), but if we reach planetary scale, we're likely to issue multiple stablecoins in different currencies. Each reserve would then be backed by government bonds denominated in each stablecoin's currency. So for starters, if T-bills go down to zero yield, we'll look at other government bonds first, and then generally look at the cash equivalent category for regulatory-compliant, low-risk options.</li></ol><p>Hope this helps!</p>", "parentCommentId": "v79pxbS24qqdnHpRu", "user": {"username": "setgree"}}, {"_id": "Gy8EyFEcQJiQvgAMC", "postedAt": "2022-09-16T16:27:58.339Z", "postId": "EAiwxZN4Jiyup8d9G", "htmlBody": "<p>Thanks, Seth.</p><p>It's probably worth doing a little assessment of alternatives now, &nbsp;just in case. &nbsp;I'm curious what options you think are low-risk. outside of t-bills and other government bonds. I'm not an investor, but I'm curious what you folks might have to do if t-bill and other government bond yields zero out.</p>", "parentCommentId": "494gciST6K9kqtAGq", "user": {"username": "Noah Scales"}}, {"_id": "bDkLtSXK2MxqHsorf", "postedAt": "2022-09-16T16:53:54.480Z", "postId": "EAiwxZN4Jiyup8d9G", "htmlBody": "<p>yep, this is definitely on my agenda. Hard to scope out -- is it a 1 hour project or a 10 hour or a &nbsp;100 hour? I'd guess 10 but I'm not sure. Anyway you are right and sooner rather than later is better 😃&nbsp;</p>", "parentCommentId": "Gy8EyFEcQJiQvgAMC", "user": {"username": "setgree"}}, {"_id": "ibLFwxLXBWS6fyJAr", "postedAt": "2022-09-16T19:51:13.511Z", "postId": "EAiwxZN4Jiyup8d9G", "htmlBody": "<p>On <a href=\"https://secure.givewell.org/\">https://secure.givewell.org/</a>, you first check a box for what fund you want to donate to, and then there's a a checkbox asking you to \"Add 10% for GiveWell's unrestricted use (likely to support GiveWell's operating expenses)\"</p>", "parentCommentId": "K5EZC5BSZYdfyHmwm", "user": {"username": "setgree"}}]