[{"_id": "Mv44p4rceE8JjXhhr", "postedAt": "2022-10-14T05:18:49.833Z", "postId": "EckMY2g2FsozZDbQn", "htmlBody": "<p>Strong upvote! I came here to say something similar. &nbsp;One of your most compelling points is addressing the needs and wants of the intended beneficiaries, in contrast with pursuing the most economically efficient cause area. I think there is significant moral weight in ensuring people have what they want and need, which cannot be commodified.&nbsp;</p>", "parentCommentId": null, "user": {"username": "LiaH"}}, {"_id": "uJMzb6MNvKXa3G2pt", "postedAt": "2022-10-14T12:51:14.390Z", "postId": "EckMY2g2FsozZDbQn", "htmlBody": "<p>Thank you for your entry!</p>\n", "parentCommentId": null, "user": {"username": "GiveWell"}}, {"_id": "o4Zi8pu8BFnnNPMMG", "postedAt": "2022-10-14T13:14:54.798Z", "postId": "EckMY2g2FsozZDbQn", "htmlBody": "<p>I'm going to say yes, but it doesn't matter too much, because while money and survival isn't everything, it's probably more like 90% of things.</p>\n<p>This is because of the fact that money is very useful for most things (and the areas where money isn't useful are cherry picked, rare examples). Money isn't a total panacea, but it's the closest we've had to one, with others being worse.</p>\n<p>More generally, because of limited resources, GiveWell must prioritize. The world where people's preferences and economies are met is better, but also a naive, fabricated option at scale as of October 14th, 2022.</p>\n<p>Links below on the importance of economics and money:</p>\n<p><a href=\"https://www.lesswrong.com/posts/hRa5c5GaMNkNGtnXq/insights-from-modern-principles-of-economics\">https://www.lesswrong.com/posts/hRa5c5GaMNkNGtnXq/insights-from-modern-principles-of-economics</a></p>\n<p><a href=\"https://www.lesswrong.com/posts/QyZvL6hrmS6AEXJLF/things-i-wish-they-d-taught-me-when-i-was-younger-why-money\">https://www.lesswrong.com/posts/QyZvL6hrmS6AEXJLF/things-i-wish-they-d-taught-me-when-i-was-younger-why-money</a></p>\n", "parentCommentId": null, "user": {"username": "Sharmake"}}, {"_id": "in5WK8siEmmk9Km2F", "postedAt": "2022-10-14T14:45:06.442Z", "postId": "EckMY2g2FsozZDbQn", "htmlBody": "<p>Thanks!</p>", "parentCommentId": "Mv44p4rceE8JjXhhr", "user": {"username": "brb243"}}, {"_id": "yc8RNfHd3kHFCL2h2", "postedAt": "2022-10-14T16:31:47.260Z", "postId": "EckMY2g2FsozZDbQn", "htmlBody": "<p>I think this applies in settings where people know how to spend money to maximize utility and enjoy (money independent) good relationships and people-centered systems.</p><p>Let me argue that normative environment matters more than money. People in absolute poverty can be doing great, if they are safe, know that they receive treatment if they need, many friends around them are quite cool, families are loving, and they have always something to learn which makes them better in some way.</p><p>Monetarily, this can be achieved with health insurance and maybe textbooks/various informational radio shows. Otherwise, it is the norms. Individuals cannot spend on normative development, because others need to progress with them.</p><p>For example, I stayed in a $60/month place and it was cool because of the engineering students' housemates' norms (helped me install my bednet, great convos on race and gender, mutual respect for personal space but enjoyment to greet), guard and good padlocks (we had thieves outside of the doors for a few hours one night but they did nothing because they did not have equipment to cut locked iron doors), malaria testing available about 50m away from the door and medicine for $4, and great work environment and caring colleagues.</p><p>I also stayed (just for a month) at a $200/month place, where the landlady was complaining in front of her two young daughters that contraception was not popular so she regrets, also gave me incorrect information to make me sign the (vague) lease. Also, apparently her cleaning lady stole her valuables when she was away. &nbsp;I also saw four?-year-olds play with money imitation. The boys took the money from the girl/denied her the money when she was excited to play.</p><p>My argument is that a $3/day (rent+food) secure place with cool nice people who normatively enjoy cooperative progress is better than a $10/day place which is less secure, it can be argued that families are not as loving, relationships not as respectful, and mutual support and inspiration to learn is limited.</p><p>This is to illustrate how it can be argued that giving &nbsp;individuals money can have limited impact, if the normative environment is not up to speed. (Maybe they can try to make people sign vague lease agreements with higher value, thieves can get better equipment, men can make it a reality that women do not get money, and children can continue to be rejected while receiving more expensive toys.)</p><p>We do not know how different normative environments are. The two places which I described were a walking distance apart. If you just give people money, you don't know what is going to scale up.</p>", "parentCommentId": "o4Zi8pu8BFnnNPMMG", "user": {"username": "brb243"}}, {"_id": "MwDm2ocRmXRh7bmim", "postedAt": "2022-10-14T17:44:45.621Z", "postId": "EckMY2g2FsozZDbQn", "htmlBody": "<p>The claim I'm making is that at scale, trade-offs like this will exist, and thus the world where everyone has less money but more of everything else is essentially a fabrication.</p>\n<p>Also, market forces are more robust in that even if everyone is guided by self-interest, good things will still happen. And at scales of 1000+, this is very relevant.</p>\n", "parentCommentId": "yc8RNfHd3kHFCL2h2", "user": {"username": "Sharmake"}}, {"_id": "ZwwCHdXKQLtfMboi7", "postedAt": "2022-10-15T00:22:29.320Z", "postId": "EckMY2g2FsozZDbQn", "htmlBody": "<p>OK, for now I disagree but the time when I agree can come within a few years.</p>", "parentCommentId": "MwDm2ocRmXRh7bmim", "user": {"username": "brb243"}}]