[{"_id": "N4pqsmNR6yMYBKEX2", "postedAt": "2024-03-05T19:35:56.143Z", "postId": "EdbiAmNy3x35GwwrB", "htmlBody": "<p>Good initiative! And the website looks great! It would be nice if there was a way to speed up the audio.&nbsp;</p>", "parentCommentId": null, "user": {"username": "バルス"}}, {"_id": "ncuxSvmJnn7otc6oG", "postedAt": "2024-03-06T03:56:30.095Z", "postId": "EdbiAmNy3x35GwwrB", "htmlBody": "<p>Hey Chris, thanks for the comment!</p><p>I am slightly confused about it though, as I am able to control the playback speed of the player on my website (at intervals of .25 from .25x to 2x). Additionally, I know that on Spotify the episode can be played back at up to 3.5x.</p><p>If anyone is still out there thinking: \"I really can't stand people's voices unless they are sped up by more than 3.5x,\" you can also download the mp3 file directly from my podcast website.</p><p>Let me know if I am missing something here, as I want to make sure my content is maximally accessible to everyone :)</p>", "parentCommentId": "N4pqsmNR6yMYBKEX2", "user": {"username": "Jacob-Haimes"}}, {"_id": "vhcojgSTkenjNmynj", "postedAt": "2024-03-06T11:44:21.721Z", "postId": "EdbiAmNy3x35GwwrB", "htmlBody": "<p>I saw the option now, it was hidden behind the three dots. Thanks! :)&nbsp;</p>", "parentCommentId": "ncuxSvmJnn7otc6oG", "user": {"username": "バルス"}}, {"_id": "nCTCyfzQrweimL8tK", "postedAt": "2024-03-06T13:27:06.232Z", "postId": "EdbiAmNy3x35GwwrB", "htmlBody": "<p>This is a really interesting podcast - particularly the section with the discussion on foundation models and cost analysis. You mention a difficulty on exploring this. If you ever want to explore it, I'm happy to give some insight via inbox because I've done a bit of work in industry in this area that I can share.</p>", "parentCommentId": null, "user": {"username": "AI Law"}}, {"_id": "u78GZfniew92npr4z", "postedAt": "2024-03-07T06:08:27.448Z", "postId": "EdbiAmNy3x35GwwrB", "htmlBody": "<p>Hi CAISID, thanks for letting me know that you think the podcast is interesting!</p><p><i>(For context to others, the original comment is referring to an aside that I give at <strong>27:04</strong> about \"foundation models\")</i></p><p>I definitely did have a difficult time finding concrete answers regarding training costs of current cutting edge foundation models. The only numbers I could find from the big companies that were primary sources, i.e. from people within the company/press releases, were very loose numbers that included salaries, which basically makes them meaningless (at least, for the information I want out of them).</p><p>There has been some work done on estimating training costs (e.g., <a href=\"https://epochai.org/trends\">Epoch</a> or the <a href=\"https://aiindex.stanford.edu/report/\">AI Index Report</a>), but it seemed that I would need to spend a significant amount of time collecting data and even doing some forecasting to actually get approximations for <i>current</i> state of the art.</p><p>Would love to hear your thoughts on this either here or whatever messaging format you prefer.</p>", "parentCommentId": "nCTCyfzQrweimL8tK", "user": {"username": "Jacob-Haimes"}}, {"_id": "aeyYEsHE93xtLD2Gm", "postedAt": "2024-03-07T06:09:18.798Z", "postId": "EdbiAmNy3x35GwwrB", "htmlBody": "<p>Of course, glad I could help!</p>", "parentCommentId": "vhcojgSTkenjNmynj", "user": {"username": "Jacob-Haimes"}}]