[{"_id": "G5ZXQjH2Xi9Eph83k", "postedAt": "2015-05-13T06:51:33.371Z", "postId": "EdYBQ67se4Wyz9uzm", "htmlBody": "<blockquote>\n<p>Thus, I propose we build an epic list of every relevant group at every top university and in the world in general.</p>\n</blockquote>\n<p>This seems like it could be automated. I think I recall Students for Education Reform doing this via mass scraping of emails off websites to create chapters at many universities. I also think I recall THINK (The High Impact Network) did this as well.</p>\n", "parentCommentId": null, "user": {"username": "redmoonsoaring"}}, {"_id": "ZSp2ioQZwC5c3LHA7", "postedAt": "2015-05-13T09:05:14.019Z", "postId": "EdYBQ67se4Wyz9uzm", "htmlBody": "<p>Mass-scraping is great when you've already identified the webpages to scrap from. Identifying these webpages, however, is half the battle. (We've already combined THINK's list with ours, but thanks for the heads up!)</p>\n<p>If you know someone at SER, I'd love to chat with them about what their strategy was.</p>\n", "parentCommentId": "G5ZXQjH2Xi9Eph83k", "user": {"username": "tyleralterman"}}, {"_id": "AxgzeQggBcW4Er6Hn", "postedAt": "2015-05-13T14:50:27.973Z", "postId": "EdYBQ67se4Wyz9uzm", "htmlBody": "<p>Why not (also) just take some of that earn-to-give money and hire some virtual assistants to plow through this?</p>\n", "parentCommentId": null, "user": {"username": "Peter_Hurford"}}, {"_id": "cAZRxxYTRNkPxbxjX", "postedAt": "2015-05-13T14:54:32.367Z", "postId": "EdYBQ67se4Wyz9uzm", "htmlBody": "<blockquote>\n<p>Out of this bunch, let’s say that we get only 1 new EA who becomes a Giving What We Can pledger - a measly conversion rate of less than 0.1%. (Note: I made this conversion rate up as one that could feasibly be far below the conversion rate we might actually get to avoid overselling the project. A less than 0.1% conversion rate would be terrible for most companies.)</p>\n</blockquote>\n<p>A 0.1% (or worse) conversion rate doesn't seem that implausible to me, because the ask is so large.  I think it's pretty similar to asking people to go vegetarian based on flyering which, though we don't yet have good evidence, is currently pegged to be a conversion rate somewhere between 0.1% and 3%.</p>\n", "parentCommentId": null, "user": {"username": "Peter_Hurford"}}, {"_id": "itnCRBP8PmziocNCt", "postedAt": "2015-05-13T17:02:35.860Z", "postId": "EdYBQ67se4Wyz9uzm", "htmlBody": "<p>Or indeed many times less than 0.1% - it seems like you have a quite good sense of what the conversion rate is pegged to be, but don't some people think vegan-creation leafleting can healthily be treated as not working for practical purposes?</p>\n", "parentCommentId": "cAZRxxYTRNkPxbxjX", "user": {"username": "jayd"}}, {"_id": "4MeiqYnXBpopzJZhz", "postedAt": "2015-05-13T17:03:54.253Z", "postId": "EdYBQ67se4Wyz9uzm", "htmlBody": "<p>What did THINK do exactly, and how did it go? Are they still doing it?</p>\n", "parentCommentId": "G5ZXQjH2Xi9Eph83k", "user": {"username": "jayd"}}, {"_id": "uzcqQhqAPjadby6Q8", "postedAt": "2015-05-13T17:40:55.450Z", "postId": "EdYBQ67se4Wyz9uzm", "htmlBody": "<p>Peter Buckley attempted to hire some virtual assistants from ODesk. They were way too slow. My guess would be that EAs have a much better sense of what types of groups to look for and where to find them. The task also requires a decent amount of research, which is a comparative advantage of many EAs.</p>\n<p>Would love to get tons of VAs on this though if you can think of a better way to use them.</p>\n", "parentCommentId": "AxgzeQggBcW4Er6Hn", "user": {"username": "tyleralterman"}}, {"_id": "ESnSjCxcS8cxXsefy", "postedAt": "2015-05-13T17:46:17.003Z", "postId": "EdYBQ67se4Wyz9uzm", "htmlBody": "<p>It does seem to be a large and in that respect ill chosen ask and conversion target. I wouldn't be surprised if finding 50 mailing lists yields no one who gets convinced to donate 10% of their lifetime income as a result of getting some emails. At best it might find some more people who are already on track to do something similar, and there has been value to having their numbers listed publicly on the Giving What We Can website, but it's less than that of saving 20 lives.</p>\n<p>Have you thought of choosing a different conversion target? Even keeping to % pledges (which charities wouldn't conventionally consider a good ask), The Life You Can Save pledge seems a better pick. Did you consider this alongside the Giving What We Can one, and if so why did you pick Giving What We Can?</p>\n<p>(I ought to add that you may have talked about saving 20 lives as standard marketing hyperbole  to get people excited, which would be fine! In that case I apologize if I've doused that excitement with cold water - treat this as a somewhat separate academic discussion.)</p>\n", "parentCommentId": "cAZRxxYTRNkPxbxjX", "user": {"username": "Nekoinentr"}}, {"_id": "sTyAZK2wowFZHYCc4", "postedAt": "2015-05-13T17:50:12.747Z", "postId": "EdYBQ67se4Wyz9uzm", "htmlBody": "<p>The difference between this and vegan flyering is that you're already targeting groups that have already self-selected for one aspect of EA. That said, I could definitely see a much lower than .1% rate being the case. Though the cost-effectiveness still seems competitive even at a conversion rate of .01% or even .001%. That's 10 days and 100 days, respectively, of work for a year of earn-to-give.</p>\n<p>That said, as Peter alluded earn-to-give still seems competitive if, e.g., you're funding that much more of this work happens. Unless, by doing the work, you're recruiting EtGers that will fund the work. Unless... [mind explodes]</p>\n", "parentCommentId": "itnCRBP8PmziocNCt", "user": {"username": "tyleralterman"}}, {"_id": "jf8k8KY38mLKQiNFe", "postedAt": "2015-05-13T18:55:52.577Z", "postId": "EdYBQ67se4Wyz9uzm", "htmlBody": "<p>Are we not double-counting &quot;good done&quot; if we follow the guidelines in that post? I.e. by attributing full good done &quot;credit&quot; to the recruiter, we implicitly either can't attribute it also to the EA-convert. But usually we also &quot;credit&quot; the person doing the EtG (or other EA activity) with the full amount of good they do.</p>\n<p>Like, it would seem strange if all the EA good I did for the rest of my life was credited to the people who helped recruit me. They are awesome and deserve lots of praise and credit as well, but perhaps not all or most of the credit for the EA hours I work.</p>\n<p>If most people who will become EAs are basically EAs-in-waiting (they just need to hear the magic EA words or whatever), then the recruiter is probably partly responsible for how much faster he or she made this happen, but not the lifetime good done. If he or she made a person learn about EA a year earlier, that's maybe 1-2 lives saved (if the convert makes like 33-66k per year).</p>\n", "parentCommentId": null, "user": {"username": "ClaireZabel"}}, {"_id": "6TXbh4K7LyMLRZcsq", "postedAt": "2015-05-13T19:11:29.420Z", "postId": "EdYBQ67se4Wyz9uzm", "htmlBody": "<p>I'm not sure assigning credit is a good way to think about this. Instead there are just decisions you can make, and you want to make the ones that most improve the world?</p>\n", "parentCommentId": "jf8k8KY38mLKQiNFe", "user": {"username": "Jeff_Kaufman"}}, {"_id": "LuHa6jg2L4iMfSDDh", "postedAt": "2015-05-13T20:51:06.557Z", "postId": "EdYBQ67se4Wyz9uzm", "htmlBody": "<p>But Claire's talking about moral accounting - which is a way of thinking about those decisions. In any one project etc. there's more than one action or person who could have done something else and let it fall apart - so you can't say its worth x me staying involved otherwise it wouldn't have happened and all the other people doing the same and be consistent in your approach across opportunities - as maybe you could all individually have done x/2 yourselves seperately but thought that keeping the project going was more important. To get past it with perfection you can factor in all the counter-factuals - but that's often easier said than done!</p>\n", "parentCommentId": "6TXbh4K7LyMLRZcsq", "user": {"username": "tomstocker"}}, {"_id": "2JCN4rigvAGRsWvrL", "postedAt": "2015-05-13T20:53:58.209Z", "postId": "EdYBQ67se4Wyz9uzm", "htmlBody": "<p>Have you tried hiring a temp and an Oxford student and putting them in the same room and seeing who can get the most good entries each day - checking a sample of 15 or something at the end of each day - for some kind of reward?</p>\n", "parentCommentId": "uzcqQhqAPjadby6Q8", "user": {"username": "tomstocker"}}, {"_id": "T9zs3hystpSWckovG", "postedAt": "2015-05-13T20:56:52.265Z", "postId": "EdYBQ67se4Wyz9uzm", "htmlBody": "<p>Yes, and its likely Tyler will find a way of populating that list anyway. Its also likely that $68000 doesn't buy you anywhere near 20 lives through AMF having looked at their calcs, Would have thought 30-60 QALYs is closer.</p>\n", "parentCommentId": "ESnSjCxcS8cxXsefy", "user": {"username": "tomstocker"}}, {"_id": "g4r9dqD59BaevbXLY", "postedAt": "2015-05-13T21:02:16.774Z", "postId": "EdYBQ67se4Wyz9uzm", "htmlBody": "<p>If you move ahead with this project, I'd urge you to try asking different things.  It'd be easy to turn this into an experiment.  I'd suggest testing out High (e.g. Take a pledge), Medium (e.g. Watch Peter Singer's TED Talk), and Low (e.g. Check out the EA forum) asks.</p>\n<p>More generally, this seems like an interesting idea though I don't find the logic of the post all that compelling.  Tyler, you seem to be conflating two arguments: 1) conversions are extremely valuable and require low conversion rates and 2) building this list and sending cold emails is our best conversion opportunity.  I agree with 1 (<a href=\"http://www.thelifeyoucansave.org/Blog/ID/181/How-Sponsoring-Giving-Games-Can-Multiply-the-Impact-of-Your-Donations\">and have made similar arguments here</a>) but 2 seems to require a pretty big leap of faith.</p>\n", "parentCommentId": null, "user": {"username": "Jon_Behar"}}, {"_id": "MRD8zbGypJKFo474w", "postedAt": "2015-05-13T23:23:32.973Z", "postId": "EdYBQ67se4Wyz9uzm", "htmlBody": "<p>It's possible for two groups to be casually necessary for something to happen, and in that case, both are 100% responsible for causing the event.</p>\n<p>e.g. I tell the hitman where the target is; the hitman shoots the target. The target wouldn't have died if either of us had failed, so we both 100% caused the person to die.</p>\n<p>e.g. 2. I think it's true that if Will and Toby never existed, I would have never done any EA stuff, so firstly they do get the &quot;credit&quot; in some sense, secondly <em>both</em> may have been casually necessary.</p>\n<p>But then also note:</p>\n<p>1) &quot;causes&quot; doesn't equal &quot;gets the credit for&quot; in the usual sense of &quot;credit&quot;.</p>\n<p>2) In real life situations, it's usually true that if one person didn't persuade X of something, then someone else would have persuaded them later. Once you properly think through the counterfactuals and uncertainties, it's rarely true that one person 100% caused anything. So if you &quot;recruit&quot; an EA, you don't probably cause all of their impact. It's probably better to model it as a speed-up like you suggest.</p>\n", "parentCommentId": "jf8k8KY38mLKQiNFe", "user": {"username": "Benjamin_Todd"}}, {"_id": "EHc7P89zL2NBktgfC", "postedAt": "2015-05-14T08:05:47.338Z", "postId": "EdYBQ67se4Wyz9uzm", "htmlBody": "<p>hitman is replacable</p>\n", "parentCommentId": "MRD8zbGypJKFo474w", "user": {"username": "tomstocker"}}, {"_id": "8hdtwZY7BngPFgyxp", "postedAt": "2015-05-14T08:21:38.238Z", "postId": "EdYBQ67se4Wyz9uzm", "htmlBody": "<p>EA Switzerland did something similar, I think it might be useful to contact them for advice. AFAIK it was a very successful strategy.</p>\n", "parentCommentId": null, "user": {"username": "Denise_Melchin"}}, {"_id": "k4PeFE8gQKXLKgLB4", "postedAt": "2015-05-14T23:56:48.832Z", "postId": "EdYBQ67se4Wyz9uzm", "htmlBody": "<p>Yes, the effect would be more to prevent him from dipping into the several hundreds of thousands of UK pounds of income CEA brings in each year (I'm using <a href=\"http://effective-altruism.wikia.com/wiki/Comparison_of_Organizations\">this figure</a>.)</p>\n", "parentCommentId": "T9zs3hystpSWckovG", "user": {"username": "Nekoinentr"}}, {"_id": "SMfgaGxnbq5vkcCT7", "postedAt": "2015-05-16T18:04:20.686Z", "postId": "EdYBQ67se4Wyz9uzm", "htmlBody": "<blockquote>\n<p>Its also likely that $68000 doesn't buy you anywhere near 20 lives through AMF having looked at their calcs, Would have thought 30-60 QALYs is closer.</p>\n</blockquote>\n<p>Can you elaborate on this? GiveWell estimates $3400/life saved, and $68k/3.4k = 20 lives saved. Do you think GiveWell's calculation is off by an order of magnitude? If so, I'd love to know why!</p>\n", "parentCommentId": "T9zs3hystpSWckovG", "user": {"username": "Ben_Kuhn"}}, {"_id": "mLHNYAHhm4wyfXcH9", "postedAt": "2015-05-16T19:18:50.130Z", "postId": "EdYBQ67se4Wyz9uzm", "htmlBody": "<p>They do seem to look for reasons that their estimates might be too high a lot more vigorously than they look for reasons that their estimates might be too low. (Though that's not necessarily a problem).</p>\n<p>edit: they look hard for reasons that they might be overestimating the benefits</p>\n", "parentCommentId": "SMfgaGxnbq5vkcCT7", "user": {"username": "RyanCarey"}}, {"_id": "ZgpErfbTi5R2w4yQf", "postedAt": "2015-05-16T19:31:43.221Z", "postId": "EdYBQ67se4Wyz9uzm", "htmlBody": "<p>Huh, my impression is the exact opposite: GiveWell leaves out a number of reasons that would lower their estimated cost-per-life-saved (i.e. the estimate tries to err high right now, i.e. they adjusted for reasons that it would otherwise be too <em>low</em>). For instance, they only count the effect of reduced child mortality, not reduced morbidity. And by counting non-AMF costs towards the cost-per-life-saved, they assume that AMF's partners would otherwise spend the money on something just as effective.</p>\n<p>If you took all these into account, it would lower the denominator in the calculation in the grandparent, which would result in 68k saving more than 20 lives.</p>\n", "parentCommentId": "mLHNYAHhm4wyfXcH9", "user": {"username": "Ben_Kuhn"}}, {"_id": "pZZLZ5LS8RTd25Xjq", "postedAt": "2015-05-16T20:28:29.978Z", "postId": "EdYBQ67se4Wyz9uzm", "htmlBody": "<p>Oh, I was trying to say that they seem overly pessimistic, same as you.</p>\n", "parentCommentId": "ZgpErfbTi5R2w4yQf", "user": {"username": "RyanCarey"}}, {"_id": "enfFEMvm7uuurQE7v", "postedAt": "2015-05-17T21:25:57.072Z", "postId": "EdYBQ67se4Wyz9uzm", "htmlBody": "<p>Oh, ok. That would make 68k buy <em>more</em> than 20 lives saved, though, not less as tomstocker alleges.</p>\n", "parentCommentId": "pZZLZ5LS8RTd25Xjq", "user": {"username": "Ben_Kuhn"}}, {"_id": "Z5Bhj2Ttqw7hPmQWG", "postedAt": "2015-05-19T08:48:01.543Z", "postId": "EdYBQ67se4Wyz9uzm", "htmlBody": "<p>I'm conservative when estimating effects. Their spreadsheets let you play around with things like this. There are good reasons to be conservative. Taking two of the main considerations to discount the cost effectiveness estimate outside from givewell's models:\n1). using an outside view, we can see that the cost effectiveness estimates of these charities have decreased over time as greater scrutiny has been brought to bear - if you project going forwards, then we'd expect that estimate to come down further. This is backed up things like insecticide resistance not being in the model.\n2). I don't think we should attribute all of the gain in AMF's activities to money given - I know that there is a causal argument - but I'd like to give some credit to Rob Mathers, partner funders etc. etc. so am unwilling to say I've saved a life by giving $x - its more that I've been part of a team that's done so (so I discount against other activities with different numbers of actions by different people that mean it wouldn't have happened)\n3). Even thinking about causal level changes - AMF might well have little room for funding depending on how the next net distribution agreements go. </p>\n<p>Have a play around with <a href=\"http://www.givewell.org/international/technical/criteria/cost-effectiveness/cost-effectiveness-models\">these</a> and see for yourself how fragile the estimates are on a number of assumptions. Its all related to how confident you are in the data and the assumptions, and how reliable you want to be when you say you can save a life for $x.</p>\n<p>Holden has repeatedly said that these kind of cost effectiveness estimates aren't enough to hang your hat on.</p>\n", "parentCommentId": "SMfgaGxnbq5vkcCT7", "user": {"username": "tomstocker"}}, {"_id": "wXCB47ShYsDa3y5ke", "postedAt": "2015-05-19T08:52:00.315Z", "postId": "EdYBQ67se4Wyz9uzm", "htmlBody": "<p>Oh, right, I don't think I used the money from other partners in my calcs in the way you say givewell does - so if I was inadvertantly increasing the cost of a net that would be a mistake - double discounting. </p>\n<p>Then, with the morbidity, its really a tiny effect in terms of QALYs so I'm not to concerned about that - even the income shock is relatively small in most places.</p>\n", "parentCommentId": "ZgpErfbTi5R2w4yQf", "user": {"username": "tomstocker"}}, {"_id": "4JzwevL6woSpAZeZG", "postedAt": "2015-05-22T19:49:41.830Z", "postId": "EdYBQ67se4Wyz9uzm", "htmlBody": "<p>Do vegan leafleters ever try to target groups they think'd be responsive? Does anyone (e.g. Peter Hurford) know what conversion rate do they get from those, on average?</p>\n", "parentCommentId": "sTyAZK2wowFZHYCc4", "user": {"username": "jayd"}}, {"_id": "6RA526AXLXtT3iKsw", "postedAt": "2015-05-22T19:50:43.160Z", "postId": "EdYBQ67se4Wyz9uzm", "htmlBody": "<p>Good idea. Indeed, doesn't taking the Life You Can Save pledge seems like a pretty good candidate for a High ask?</p>\n", "parentCommentId": "g4r9dqD59BaevbXLY", "user": {"username": "jayd"}}, {"_id": "yNzNndJ3LCLpMDkmz", "postedAt": "2015-05-23T00:52:28.307Z", "postId": "EdYBQ67se4Wyz9uzm", "htmlBody": "<p>I'd argue for using TLYCS's pledge for the high ask for three reasons, two of which seem pretty compelling:</p>\n<p>1) I work for TLYCS\n2) TLYCS has a lower minimum pledge than GWWC, so it'll give a richer, more informative, data set.  Our baseline assumption is presumably that cold-emailing people doesn't get a lot of pledges.  If we get that result with a high minimum pledge, we won't know if a lower minimum would do better.  Conversely, if we use TLYCS's pledge and see a bunch of people pledging 3%, that's valuable info.  (If we see a lot of pledges, we can/should test TLYCS vs. GWWC pledges directly against each other.)\n3)  This would directly inform TLYCS strategy.  Our working assumption is that pledging is too big an initial ask.  We'd be very interested in this data point.</p>\n", "parentCommentId": "6RA526AXLXtT3iKsw", "user": {"username": "Jon_Behar"}}, {"_id": "9PpvFpetaRxviqaoL", "postedAt": "2015-05-25T03:51:09.812Z", "postId": "EdYBQ67se4Wyz9uzm", "htmlBody": "<p>Seems sensible to me. What do you think tyleralterman, if you're reading this?</p>\n", "parentCommentId": "yNzNndJ3LCLpMDkmz", "user": {"username": "jayd"}}]