[{"_id": "XxRsKE4cHT5DvbBFZ", "postedAt": "2022-09-13T12:31:01.133Z", "postId": "EEQuMjGYxxFKCtxjC", "htmlBody": "<p>Hi Serena. I am the CEO and co-founder of School of Thinking, a fully EA-aligned media project with 25.000 followers across three social media profiles (YouTube, TikTok and Instagram) in two languages (Italian and English). Last month we had 700.000 views on the Italian IG profile only. So I guess we can already qualify as EA micro-influencers.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Luca Parodi"}}, {"_id": "7dQAjrCmhMaXnLEvZ", "postedAt": "2022-09-13T13:01:39.483Z", "postId": "EEQuMjGYxxFKCtxjC", "htmlBody": "<blockquote><p><i>strangely</i></p></blockquote><p>It does look strange! But it was pretty intentional: see <a href=\"https://www.centreforeffectivealtruism.org/blog/the-fidelity-model-of-spreading-ideas\">this post</a> for the rationale.&nbsp;</p><p>Recently people have been massively expanding university and \"quality press\" coverage. But these are relatively low-risk ways of doing mass outreach and the original rationale might stand.</p>", "parentCommentId": null, "user": {"username": "technicalities"}}, {"_id": "aMJmxTcdwYBBDPjEE", "postedAt": "2022-09-13T18:48:53.571Z", "postId": "EEQuMjGYxxFKCtxjC", "htmlBody": "<p>Hey, thanks for writing.&nbsp;</p><p>I also used to feel extremely confused about this (e.g. I thought that in-person university groups were <i>\"woefully inefficient\"</i> compared to social media outreach). I did not understand why there weren't EA youtubers or social media marketing campaigns. Much of my own social conscious had been shaped by online creators (e.g. veganism and social justice ideas), and it felt like a tragedy that EA was leaving so much lying on the table.&nbsp;</p><p>I now am less optimistic about short-form social media outreach. Mostly because:</p><ul><li>It seems really hard to preserve epistemics in low fidelity mediums like TikTok;</li><li>I don't see that much value in EA being a house-hold name, if it's a meme-y, low-resolution version (but my mind could easily be changed on this);&nbsp;</li><li>I care about selecting for nerdiness and intellectual curiosity;</li><li>I'm cautious of EA being associated too much with specific influencers;</li><li>I don't want EA to become (or be perceived as) a social media trend.</li></ul><p>All that being said, I do think there are versions of social media outreach that could be great (and aren't currently being done).</p><p>I'm excited about more longer form youtube content (e.g. <a href=\"https://www.youtube.com/c/RobertMilesAI\">Rob Miles</a>). It would be cool if one of the <a href=\"https://leadelimination.org/\">LEEP</a> founders/ <a href=\"https://www.charityentrepreneurship.com/incubation-program\">CE incubatees</a> started vlogging about the experience of running a high impact charity (or something similar).&nbsp;</p><p>Fwiw, youtuber Ali Abdaal has some videos promoting <a href=\"https://www.youtube.com/watch?v=Zi5gD9Mh29A\">longtermism</a>, <a href=\"https://www.youtube.com/watch?v=lJ6n52Lsjfo\">80k</a>, and <a href=\"https://www.youtube.com/watch?v=PHgdXWZLs9g&amp;t=283s\">GWWC</a>. And 80k is currently ramping up their marketing and starting to pay influencers to promote 80k.</p>", "parentCommentId": null, "user": {"username": "Evie Cottrell"}}, {"_id": "oDcmf5SRHarkgqC8u", "postedAt": "2022-09-14T09:38:52.046Z", "postId": "EEQuMjGYxxFKCtxjC", "htmlBody": "<p>The part about being associated with specific influencers could be a major downfall. If someone gains a negative reputation on the internet, will the movement as a whole suffer? Quite possibly.</p><p>I'm unsure about whether EA being a low resolution household name would be net good or bad. I wonder how often people don't give to charity because it's too much effort to find good organizations. If this is a legitimate problem, having EA in the back of their mind might make it easier to donate without thinking about it. &nbsp;Also, it may simply introduce people to the concept that we can measure the usefulness of charities, and we have a really good idea of which ones are the best. &nbsp;</p><p>Selecting for nerdiness and curiosity is great, but I believe EA becoming a household name will attract more nerdy, curious people. I believe there are lots of people who would be involved in EA, but simply don't know it exists. I don't think we should expect people to find EA by themselves- part of our job should be to pique their interest.&nbsp;</p><p>I follow a lot of internet debaters, and I'm just not seeing that sort of stuff in the EA space. Why? Youtube is a great place for people to hash out ideas, have conversations, and for the audience to get involved. Blogs aren't as accessible as long form video content.&nbsp;</p><p>As for short-form content, it has a lot of downsides. The upside however, is that we can reach a lot of people with a single message, which I believe could have large scale political influence (something I believe EA lacks).&nbsp;</p>", "parentCommentId": "aMJmxTcdwYBBDPjEE", "user": {"username": "SereneDesiree"}}, {"_id": "ftNzrTB44uWcxR6yZ", "postedAt": "2022-09-14T09:49:54.376Z", "postId": "EEQuMjGYxxFKCtxjC", "htmlBody": "<p>Followed! Keep up the good work!&nbsp;</p>", "parentCommentId": "XxRsKE4cHT5DvbBFZ", "user": {"username": "SereneDesiree"}}, {"_id": "3v6nWZtm2QvNdmemc", "postedAt": "2022-09-14T10:00:28.980Z", "postId": "EEQuMjGYxxFKCtxjC", "htmlBody": "<p>Quality press sounds like an intelligent idea to be associated with the EA brand.&nbsp;</p><p>I wonder if we could convey simple ideas through influencers without them mentioning EA. For instance, what if we paid an influencer to compare how much money it costs for various charities to complete their goals? We don't need to mention EA, but it may give many charities a significant boost in awareness and (probably) donations.&nbsp;</p>", "parentCommentId": "7dQAjrCmhMaXnLEvZ", "user": {"username": "SereneDesiree"}}, {"_id": "Qtdz4L6m6oLAZ5TSY", "postedAt": "2023-01-23T13:59:28.591Z", "postId": "EEQuMjGYxxFKCtxjC", "htmlBody": "<p>Thanks for writing this post. I recently saw <a href=\"https://www.youtube.com/watch?v=sNe2cQw_3jg&amp;t=338s\">Simone Giertz introducing 80k in one of her videos</a> and liked the result very much. I think one needs to distinguish the different kinds of content to mitigate the risks you described, and I don't think the goal here has ever been to explain everything EA on TikTok - that is indeed quite unrealistic and dangerous. When it comes to pointing to resources that are freely available and have already been written for a broad audience, though, such as the 80k career guide, using influencers seems like an obvious way to reach more people with negligible downsides. It seems like directing more people toward 1. working on one of the well-researched career paths and/or 2. donating to effective charities has quite some unused potential. Not all of them will (want to) understand the more complex concepts, but that is arguably also not necessary.</p>\n", "parentCommentId": "oDcmf5SRHarkgqC8u", "user": {"username": "dzdora"}}]