[{"_id": "GiHLgHYAscg5tcNtZ", "postedAt": "2023-12-26T16:27:27.714Z", "postId": "Eg3WkbzAqfvuigzKe", "htmlBody": "<p>As an econ PhD student, it gives me so much motivation when economists set up organizations that do good, and whose success is based on their economics expertise! (e.g. AidGrade, GiveDirectly, Malengo)</p>\n<p>I'd love to hear your perspective on what academic economists (including PhD students) can do to make their work more impactful, both in research and outside of it.</p>\n", "parentCommentId": null, "user": {"username": "therealslimkt"}}, {"_id": "86Lrj3tZCxSKGxcEg", "postedAt": "2023-12-26T19:27:59.903Z", "postId": "Eg3WkbzAqfvuigzKe", "htmlBody": "<p>Thanks. A quick, non-exhaustive list:</p><ul><li>Get feedback early on. Talking to people can save a lot of time</li><li>You should have a very clear idea of why it is needed. Good ideas sound obvious after the fact</li><li>That's not to say people won't disagree with you. If your idea takes off you will need to have a thick skin</li><li>A super-easy way to have more impact is to collaborate with others. This doesn't help for job market papers, where people tend to want to have solo-authored work. But you can get a lot more done collaborating with others and the outputs will be higher-quality, too</li><li>Apart from collaborating with people on the actual project, do what you can to get buy-in from other people who have no relationship to the project. Other people can magnify the impact in big ways and small</li><li>It can take a while before early-career researchers find a good idea. Have more ideas than you would think</li></ul>", "parentCommentId": "GiHLgHYAscg5tcNtZ", "user": {"username": "Eva"}}, {"_id": "icvEfQD2v4MrCiXoa", "postedAt": "2023-12-31T14:11:14.009Z", "postId": "Eg3WkbzAqfvuigzKe", "htmlBody": "<p>There's another point I don't quite know how to put but I'll give it a go.</p><p>Despite the comments above about having many ideas and getting feedback early about one's projects - which both point to having and abandoning ideas quickly - there's another sense in which actually what one needs is an ability to stick to things. And the good taste to be able to evaluate when to try something else and when to keep going. (This is less about specific projects and more about larger shifts like whether to stay in academia/a certain line of work at all.)</p><p>I feel like sometimes people get <i>too much</i> advice to abandon things early. It's advice that has intuitive appeal (if you can't pick winners, at least cut your losses early),&nbsp;and it's good advice in a lot of situations. But my impression is that while there are some people who would do better failing faster, there are <i>also</i> some people who would do better if they were more patient. At least for myself, I started having more success when sticking with things for longer. The longer you stick to a thing, the more expertise you have in it. That may not matter in some fields, but it matters in academia.&nbsp;</p><p>Now, obviously, you want to be very selective about what you stick to. That's where having good taste comes in. But I'd start by looking honestly at yourself and looking at people near you that you see doing well for themselves in your chosen field, and asking which side of the impatient-patient spectrum you fall on compared to them. Some people are too patient. Some people are too impatient. I was too impatient and improved with more patience, and for some people it's the opposite. Which advice applies the most to you depends on your starting point and field, and of course the outside options.&nbsp;</p><p>For econ PhDs, I think it's worth having a lot of ideas and discarding them quickly especially in grad school because a lot of them are bad at first, but I also think there are people who jump ship from an academic career too early, like when they are on the market or in the first few years after. I suspect this might be generally true in academia where&nbsp;expertise really, really matters and you need to make a long-term investment, but I can't speak for certain about other academic fields beyond economics. And I've definitely met many academics who played it too safe for maximizing impact, and many people who didn't leave quickly enough. What I'm trying to emphasize is that it's possible to make mistakes in both directions and you should put effort into figuring out which type of error you personally are more likely to make.</p>", "parentCommentId": "86Lrj3tZCxSKGxcEg", "user": {"username": "Eva"}}]