[{"_id": "frwisdepF3vnHmzBb", "postedAt": "2014-10-07T01:14:30.283Z", "postId": "EgMRzYLjRxXhceCxH", "htmlBody": "<p>This is very useful. As someone still very new to this who wants to contribute more it can be helpful to see what other EAs are doing in detail. I still struggle from not knowing exactly what I can do now and what are realistic goals for behavioral and social changes, particularly in the short term.</p>\n<p>More generally, as someone trying to be more productive and efficient Toggl looks promising and I'm going to try it out myself.</p>\n", "parentCommentId": null, "user": {"username": "Marcus_A_Davis"}}, {"_id": "pCgohYkNjZKGWEruH", "postedAt": "2014-10-07T02:18:54.291Z", "postId": "EgMRzYLjRxXhceCxH", "htmlBody": "<p>Thanks for the feedback.  I think Toggl is worthwhile, but as a warning it's pretty hard to get into.  I started my time tracking via Google Calendar first (which is easier) for 15 months before getting into Toggl.  So don't be too dismayed if it doesn't work out.  But I think the knowledge of self is definitely worth it, even if you track for just a week!</p>\n", "parentCommentId": "frwisdepF3vnHmzBb", "user": {"username": "Peter_Hurford"}}, {"_id": "LxySEpN5vDrDKgFhb", "postedAt": "2014-10-07T07:47:14.294Z", "postId": "EgMRzYLjRxXhceCxH", "htmlBody": "<p>Interesting review as always Peter. I've looked at <a href=\"https://www.toggl.com/tour/web\">Toggl's tour</a> (and like its name for reasons you can claim a prize for guessing next time we chat ;), but could you say a bit more about what made you pick it over alternatives? I ask as someone who's done time tracking for a while, and settled on <a href=\"http://www.paymo.biz/\">http://www.paymo.biz/</a> but isn't totally satisfied by it (mainly because of the time-consumingness of tagging my time in a fine-grained way).</p>\n", "parentCommentId": "pCgohYkNjZKGWEruH", "user": {"username": "Tom_Ash"}}, {"_id": "sq3Ef6dBnydLdz6Wy", "postedAt": "2014-10-07T17:33:42.934Z", "postId": "EgMRzYLjRxXhceCxH", "htmlBody": "<p>I didn't look at alternatives, so I can't say why I picked it over alternatives.  Toggl has a nice interface.  Paymo looks fine, though!</p>\n", "parentCommentId": "LxySEpN5vDrDKgFhb", "user": {"username": "Peter_Hurford"}}, {"_id": "aT5YvWLWk92stsjCM", "postedAt": "2014-10-07T21:01:53.106Z", "postId": "EgMRzYLjRxXhceCxH", "htmlBody": "<p>The standard advice is just to try it for a week or two. It can be useful to become more aware of how you're spending your time. Doing it permanently is a bit hardcore :)</p>\n<p>Lots of people track their work hours over the long-term, but it's usually just through a spreadsheet or gcal.</p>\n", "parentCommentId": "pCgohYkNjZKGWEruH", "user": {"username": "Benjamin_Todd"}}, {"_id": "fgXzYwoXnJWX85wKo", "postedAt": "2014-10-08T00:50:22.984Z", "postId": "EgMRzYLjRxXhceCxH", "htmlBody": "<blockquote>\n<p>Back in May, .impact launched a survey of effective altruists (still open if you want to participate).  I'm working on doing the data analysis for that.  I'm almost finished.  Except results by the end of the month.</p>\n</blockquote>\n<p>Glad to hear it! I look forward to seeing the results.</p>\n", "parentCommentId": null, "user": {"username": "Dale"}}, {"_id": "89TmQbHeKtuRN7NKG", "postedAt": "2014-10-08T15:59:23.247Z", "postId": "EgMRzYLjRxXhceCxH", "htmlBody": "<p>Paul Christiano and Katja Grace jointly explored several different time-tracking apps and concluded that, while Toggl has flaws, it has fewer flaws than the alternatives. Independently, I did some research myself a while ago and also came to the conclusion that Toggl was superior to its rivals, though I can no longer recall the considerations that led me to reach this conclusion.</p>\n", "parentCommentId": "LxySEpN5vDrDKgFhb", "user": {"username": "Pablo_Stafforini"}}, {"_id": "FmurRDy9HRZyRdM5m", "postedAt": "2014-10-08T17:46:20.707Z", "postId": "EgMRzYLjRxXhceCxH", "htmlBody": "<p>It would be cool if Paul and Katja published their results.</p>\n<p>Also, I remembered the reason why I use Toggl is because you recommended it to me.</p>\n<p>Though, like with Paul and Katja's recommendation of Workflowy, I was skeptical at first.</p>\n", "parentCommentId": "89TmQbHeKtuRN7NKG", "user": {"username": "Peter_Hurford"}}, {"_id": "bg7rD6CjbeeLxuh8Y", "postedAt": "2014-10-13T21:54:39.173Z", "postId": "EgMRzYLjRxXhceCxH", "htmlBody": "<p>Do you have any recommendations on how to avoid wasting time updating the current activity on Toggl?  </p>\n", "parentCommentId": "pCgohYkNjZKGWEruH", "user": {"username": "Max_Carpendale"}}, {"_id": "eYy9ZxtwmpNrDr4wj", "postedAt": "2014-10-13T23:12:59.665Z", "postId": "EgMRzYLjRxXhceCxH", "htmlBody": "<p>1.) Don't have that many Toggl categories, so you don't have to update that often.</p>\n<p>2.) Use the green button to re-start a project rather than typing it over again.</p>\n<p>3.) Don't stare at the timer.</p>\n", "parentCommentId": "bg7rD6CjbeeLxuh8Y", "user": {"username": "Peter_Hurford"}}, {"_id": "PSheHejmdEYGdZZYv", "postedAt": "2014-11-09T21:32:53.030Z", "postId": "EgMRzYLjRxXhceCxH", "htmlBody": "<p>(Typo: &quot;Except results by the end of the month&quot; -- should be &quot;expect&quot;, right?)</p>\n", "parentCommentId": null, "user": {"username": "Gina_Stuessy"}}, {"_id": "6NbcuuXMo4sfAyuZ4", "postedAt": "2014-11-10T03:38:54.708Z", "postId": "EgMRzYLjRxXhceCxH", "htmlBody": "<p>Thanks!  Fixed!</p>\n", "parentCommentId": "PSheHejmdEYGdZZYv", "user": {"username": "Peter_Hurford"}}, {"_id": "qfiggjBJGM93twNeb", "postedAt": "2015-01-07T00:51:58.601Z", "postId": "EgMRzYLjRxXhceCxH", "htmlBody": "<p>I prefer Toggl because it is fastest: a single keypress to stop the current timer or return to the last one, and a single key press followed by typing a uniquely-identifying substring to start a new timer. Katja and/or me also tried yast, freckle, clok, harvest, lumina, and a few other options I've forgotten about. All of these have more clicks/keystrokes per operation.</p>\n<p>Toggl also works offline, which ruled out several alternatives, and has a reasonable (though not excellent) interface for viewing reports, and 3 levels of reporting (name of entry, job, and client).</p>\n<p>Note that Toggl crashes constantly (perhaps 2-4 times a day for me on OSX), but it can be restarted in a few seconds each time, and so this isn't a huge consideration for me.</p>\n", "parentCommentId": "FmurRDy9HRZyRdM5m", "user": {"username": "Paul_Christiano"}}, {"_id": "bzTTbw4LqL6pcZGLi", "postedAt": "2015-01-07T03:01:33.718Z", "postId": "EgMRzYLjRxXhceCxH", "htmlBody": "<blockquote>\n<p>Note that Toggl crashes constantly (perhaps 2-4 times a day for me on OSX), but it can be restarted in a few seconds each time, and so this isn't a huge consideration for me.</p>\n</blockquote>\n<p>Huh.  Is that the desktop app?  I've never used that app, but have had 0 problems with Toggl in any of it's other manifestations (website, mobile, command line tools).</p>\n", "parentCommentId": "qfiggjBJGM93twNeb", "user": {"username": "Peter_Hurford"}}]