[{"_id": "Picsds9G6cbNpvohC", "postedAt": "2022-10-01T23:33:08.254Z", "postId": "EGSNTNdm49RhXxmBt", "htmlBody": "<p>Thank you for this post!&nbsp;</p><p>You identify two parts to developing empathy that I want to note:</p><ol><li>develop knowledge about the situation that some people endure</li><li>develop emotional empathy for those people in that situation</li></ol><p>I develop emotional empathy from videos, photos, and first-hand experiences, but it is not always necessary. &nbsp;For example, I was moved by Gail Eisnitz' book Slaughterhouse to become a vegan for a few years<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefvx066u7rg1\"><sup><a href=\"#fnvx066u7rg1\">[1]</a></sup></span>. Learning in depth about the troubles of factory farmed animals helped me appreciate their plight. It did contain photos, but those were not the convincing part of its content.</p><p>On a related note, I particularly enjoy stories of animals that help humans and help each other, that is, animals that show empathy. Weird as it is, I also enjoy stories of animals helping each other across species, and animals that show empathy or feeling for humans (for example, dolphins rescuing humans or tigers happy to see their former trainers). &nbsp;Video evidence of such interactions are very convincing for me (for example, watching a tiger hug and play with its trainer).</p><p>For me, it seems emotionally moving to learn about the commonalities with humans of animal emotions and affective experience, or to interpret animal behavior as showing those commonalities.&nbsp;</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnvx066u7rg1\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefvx066u7rg1\">^</a></strong></sup></span><div class=\"footnote-content\"><p>I found the diet difficult, and in particular, dealing with protein requirements difficult. However, a kernel of interest in vegan protein remains in me, enough to motivate changes in my food consumption in a future where that is easier.</p></div></li></ol>", "parentCommentId": null, "user": {"username": "Noah Scales"}}, {"_id": "TPEQrovwSgJ2X7vfy", "postedAt": "2022-10-02T01:37:29.433Z", "postId": "EGSNTNdm49RhXxmBt", "htmlBody": "<p>This post is really well written and explains a lot of ideas in an approachable way.</p>", "parentCommentId": null, "user": {"username": "Charles He"}}, {"_id": "R5LFsufravC2jdJAh", "postedAt": "2022-10-06T09:06:39.278Z", "postId": "EGSNTNdm49RhXxmBt", "htmlBody": "<p>This is great - thanks for writing this.</p><p>My addition to this would be that you can increase your empathy for the suffering of others by connecting with your own suffering. Experiences of pain and fear in my own life, definitely make it easier to connect with those feelings in others.&nbsp;</p><p>(And as well as helping empathy, connecting with the motivational usefulness of negative experiences can make the experiences themselves feel a little more meaningful (so a little less bad).)</p>", "parentCommentId": null, "user": {"username": "tobyjolly"}}, {"_id": "wBznZrRNnExbxKbDP", "postedAt": "2022-10-09T17:25:57.552Z", "postId": "EGSNTNdm49RhXxmBt", "htmlBody": "<p>Thanks, great post!</p><p>Both for our own and total wellbeing, I think it is really valuable to align our intuitive <a href=\"https://thedecisionlab.com/reference-guide/philosophy/system-1-and-system-2-thinking\">system-1</a> values with our intelectual <a href=\"https://thedecisionlab.com/reference-guide/philosophy/system-1-and-system-2-thinking\">system-2</a> ones.</p>", "parentCommentId": null, "user": {"username": "vascoamaralgrilo"}}, {"_id": "udp4XzqZte4BCyyBK", "postedAt": "2022-10-11T07:43:47.677Z", "postId": "EGSNTNdm49RhXxmBt", "htmlBody": "<p>Edo and Amber, thanks a lot for writing this. I really enjoyed looking back at when my co-founder and I launched SWP!&nbsp;</p><p>I'm happy to chat with anyone interested in discussing this process further. My email is andres@shrimpwelfareproject.org</p>", "parentCommentId": null, "user": {"username": "Andres Jimenez"}}]