[{"_id": "xfMXse3TjDzadXrAT", "postedAt": "2017-06-27T23:09:34.588Z", "postId": "Eh8Ep3fEPoRnnZwfK", "htmlBody": "<p>I've for a long time seen things this way:</p>\n<ul>\n<li>GiveWell: emphasizes effectiveness: the logic pull</li>\n<li>TLYCS: emphasizes altruism: the emotion pull</li>\n<li>GWWC: emphasizes the pledge: the act that unifies us as a common movement (or I think+feel it does)</li>\n</ul>\n<p>One cute EA family.</p>\n", "parentCommentId": null, "user": {"username": "Cornelius"}}, {"_id": "W6w9zKsMJAFiBQ4Dw", "postedAt": "2017-07-02T22:13:54.067Z", "postId": "Eh8Ep3fEPoRnnZwfK", "htmlBody": "<p>I have some doubts generally about the principle of mainstreaming.  It seems to me that it utilises dominant ideologies 'strategically', thus reifying them.  In terms of the animal movement this is very much the case in regard to One Step for Animals, Pro-Veg and The Vegan Strategist.  All these groups and organisations have adopted a mainstream 'pragmatic' approach which concurrently undermines social justice.</p>\n<p>This is of course one approach, but i do not believe there is sufficient evidence to pursue it, or that it stands to reason.  It would be far better for these mainstream groups to avoid social justice issues completely, so that would include rights and veganism (the cessation of exploitation), rather than essentially undermining them to privilege their approach.</p>\n<p>For example, i think it is deeply unfortunate Matt Ball recently said that we need to utilise the idea that people hate vegans in order to appeal to non-vegans and 'help' animals.  I would question the ethics of this, and also whether it is in fact true that 'people' hate vegans, or that forming and perpetuating this idea would be a good thing anyway.  This is one example, but in my view mainstreaming sets forth a cascade against people that are trying to do good pro-intersectional social justice work, and it is i believe also true that groups involved in 'mainstreaming' have not sufficiently evaluated their approach, so it seems unworthwhile to support it, even whilst many EAs seem to do just that.</p>\n", "parentCommentId": null, "user": {"username": "KevinWatkinson"}}, {"_id": "uGkzJJ4uiDduHCGCp", "postedAt": "2017-07-02T23:22:45.571Z", "postId": "Eh8Ep3fEPoRnnZwfK", "htmlBody": "<p>What empirical tests can we make to measure which approach is more effective? What predictions can be made in advance of those tests?</p>\n", "parentCommentId": "W6w9zKsMJAFiBQ4Dw", "user": {"username": "DonyChristie"}}, {"_id": "pjprMHGEdhems2Fun", "postedAt": "2017-07-03T14:09:49.266Z", "postId": "Eh8Ep3fEPoRnnZwfK", "htmlBody": "<p>First of all we would need to accept there are different approaches, and consider what they are before evaluating effectiveness.  </p>\n<p>The issue with Effective Altruism is that it is fairly one dimensional when it comes to animal advocacy.  That is it works with the system of animal exploitation rather than counter to it, so primarily welfarism and reducetarianism.  In relation to these ideas we need to view the subsequent counterfactual analysis, and yet where is it?  I've asked these sorts of questions and it seems that people haven't applied some fundamental aspects of Effective Altruism to these issues.  They are merely assumed.  </p>\n<p>For some time it has appeared as if EA has been working off a strictly utilitarian script, and has ignored or marginalised other ideas.  Partly this has arisen because of the limited pool of expertise that EA has chosen to draw upon, and this has had a self replicating effect.</p>\n<p>Recently i read through some of Holden Karnofsky's thoughts on Hits-based Giving and something particularly chimed towards the end of the essay.</p>\n<p>&quot;Respecting those we interact with and avoiding deception, coercion, and other behavior that violates common-sense ethics. In my view, arrogance is at its most damaging when it involves “ends justify the means” thinking. I believe a great deal of harm has been done by people who were so convinced of their contrarian ideas that they were willing to violate common-sense ethics for them (in the worst cases, even using violence).</p>\n<p>As stated above, I’d rather live in a world of individuals pursuing ideas that they’re excited about, with the better ideas gaining traction as more work is done and value is demonstrated, than a world of individuals reaching consensus on which ideas to pursue. That’s some justification for a hits-based approach. But with that said, I’d also rather live in a world where individuals pursue their own ideas while adhering to a baseline of good behavior and everyday ethics than a world of individuals lying to each other, coercing each other, and actively interfering with each other to the point where coordination, communication and exchange break down.</p>\n<p>On this front, I think our commitment to being honest in our communications is important. It reflects that we don’t think we have all the answers, and we aren’t interested in being manipulative in pursuit of our views; instead, we want others to freely decide, on the merits, whether and how they want to help us in our pursuit of our mission. We aspire to simultaneously pursue bold ideas and remember how easy it would be for us to be wrong.&quot;</p>\n<p>I think in time we will view the present EAA approach as having commonalities with Karnofsky's concerns, and steps will be taken to broaden the EAA agenda to be more inclusive.  I think it is unlikely however, that these changes will be sought or encouraged by movement leaders, and even within groups such as ACE i remain concerned about bias within leadership toward the 'mainstream' approach.  Unfortunately, ACE has historically been underfunded, and has not received the support it has needed to properly account for movement issues, or to increase the range of the work it undertakes. I think this is partly a leadership issue in that aims and goals have not been reasonably set and pursued, and also an EA movement issue, where a certain complacency has set in.</p>\n<p><a href=\"http://www.openphilanthropy.org/blog/hits-based-giving\">http://www.openphilanthropy.org/blog/hits-based-giving</a></p>\n", "parentCommentId": "uGkzJJ4uiDduHCGCp", "user": {"username": "KevinWatkinson"}}, {"_id": "K384uLYCnXQNqvWYN", "postedAt": "2017-07-05T00:06:02.383Z", "postId": "Eh8Ep3fEPoRnnZwfK", "htmlBody": "<p>I don't see how TYLCS is selling out at all. They have the same maximizing impact message as other EA groups, just with a more engaging feel that also appeals to emotions (the only driver of action in almost all people).</p>\n<p>Matt Ball is more learned and impact-focused than anyone in the animal rights field. One Step for Animals, and the Reducetarian Foundation were formed to save as many animals as possible -- complementing, not replacing, vegan advocacy. Far from selling out, One Step and Reducetarian are the exceptions from most in animal rights who have traded their compassion for animals for feelings of superiority.</p>\n", "parentCommentId": "pjprMHGEdhems2Fun", "user": {"username": "Austen_Forrester"}}, {"_id": "nE9WLwfNY7MG68bXF", "postedAt": "2017-07-05T10:10:50.515Z", "postId": "Eh8Ep3fEPoRnnZwfK", "htmlBody": "<p>Maximising impact wouldn't necessarily rely on messaging that undermines other groups in the broader animal movement.  I don't think it is a good thing to take such an approach either in relation to Effective Altruism or in the broader animal movement.</p>\n<p>Matt Ball's recent vox article stated that people love animals and hate vegans and that we need to act on this.  I think this isn't a good thing, particularly where someone as respected as Matt Ball is equating vegans to hezbollah through someone as dedicated to animal exploitation as Bourdain.  This of course is quite an extreme example compared to what many 'pragmatists' (for instance Tobias Leenaert) have been doing for some time.  Yet it has become a dominant theme in Effective Altruism, and it isn't justified.  Instead, i would argue it is actually quite harmful.</p>\n<p>In terms of where we should be aiming, then i believe we ought not be undermining veganism on an institutional basis, as Reducetarianism and One Step put forward (so they shouldn't utilise a misrepresentation of veganism to privilege their approach).  Neither would recycling anti-vegan rhetoric or irrational justifications for animal consumption reflect well on the integrity of Effective Altruism, nor is there any evidence for it being a particularly 'effective' approach, beside it being popular among people who have been conditioned to exploit animals.  However, popularity need not be pursued through the replication of carnism, or the utility of the carnist system, there are other values and methods with which to make appeals.</p>\n<p>It's also really not a question of superiority, this is something which is generally brought up to dismiss the issue.  Instead it is a question of integrity, responsibility and consideration.  I think these are all central values of Effective Altruism, and they need to be applied.</p>\n", "parentCommentId": "K384uLYCnXQNqvWYN", "user": {"username": "KevinWatkinson"}}, {"_id": "mqEifJ97vxByFzTkz", "postedAt": "2017-07-20T07:02:19.930Z", "postId": "Eh8Ep3fEPoRnnZwfK", "htmlBody": "<p>Thanks for the info.</p>\n", "parentCommentId": null, "user": {"username": "MartinHoover"}}, {"_id": "kF6zF5GotpLwysgtW", "postedAt": "2017-08-02T16:06:57.311Z", "postId": "Eh8Ep3fEPoRnnZwfK", "htmlBody": "<p>In which way do you believe that pragmatism undermines social justice? Couldn't it be that a pragmatic approach increases social justice, if it is shown to be the most effective?</p>\n", "parentCommentId": "W6w9zKsMJAFiBQ4Dw", "user": {"username": "DevonFritz"}}]