[{"_id": "ij3qjchJ7BKSzhMTA", "postedAt": "2021-11-15T15:56:11.778Z", "postId": "Ei2uYbn2zrzmBjEsp", "htmlBody": "<p>Great work, Ben! I appreciate the actionable suggestions &amp; the structure of the post (i.e., summaries at the top and details in the main body). Excited to see the other posts in this series!</p><p>One suggestion: <strong>I think it would be helpful to distinguish between interventions that are helpful for people with poor sleep quality </strong>(e.g., people with insomnia) <strong>and those that are helpful for people with \"average\" sleep quality</strong> (e.g., people who don't have any huge problems with their sleep quality but are trying to optimize their sleep quality).&nbsp;</p><p>In other words: let's assume person A has diagnosable insomnia, and person B has \"average\" sleep quality but is trying to optimize (i.e., by going from 50th percentile sleep quality to 80th percentile). Would you suggest the same intervention for person A and person B?</p><p>My understanding &nbsp;is that many of the top recommendations are typically studied for insomnia, but there is much less research supporting their effectiveness for \"people with ordinary sleep habits who are trying to optimize\" (epistemic status pretty uncertain: I'm not a sleep researcher but have talked with a few about this topic).</p><p>A few questions:</p><ul><li>In general, would you say the evidence for these interventions is strongest for people with insomnia/poor sleep quality?</li><li>Which intervention(s) would you recommend most strongly to someone with insomnia/poor sleep quality?</li><li>Which intervention(s) would you recommend most strongly to someone with average/good sleep quality?</li></ul>", "parentCommentId": null, "user": {"username": "Akash"}}, {"_id": "NhGA5tudtdDqz8ZPf", "postedAt": "2021-11-15T17:09:59.591Z", "postId": "Ei2uYbn2zrzmBjEsp", "htmlBody": "<p>Thank you! I think those are some quite reasonable suggestions/ questions.</p>\n<p>Short response:</p>\n<ul>\n<li>I think differences in effectiveness based on current sleep quality are likely outweighed by differences in individual behaviours (e.g. how much caffeine/ magnesium you already consume).</li>\n</ul>\n<p>Long response:</p>\n<ul>\n<li>I'm reasonably confident that the relative value of each of these interventions is likely to be similar for people regardless of their current quality of sleep, just with reduced effect for those currently with better quality sleep.</li>\n</ul>\n<p>I expect that differences in value on that basis (poor quality vs average quality) are likely outweighed by differences in value based on personal circumstances as the individual effectiveness of several of these interventions depends based on people's current behaviours. (e.g. current bright light exposure/ night-time window policy/ previous exposure to mindfulness/ quality of mattress).</p>\n<p>The only exception to this is likely CBT-I given it's specifically geared to insomnia, though I'd expect improved sleep hygiene and sleep restriction to still offer significant benefits to someone with more average sleep quality.</p>\n<p>From the studies that I've looked at, I'd say that the evidence tends to be strongest for the effect of these interventions on insomnia. In general, I found research to be relatively thin for many of these topics which led me to largely combine findings for people with average sleep quality and those suffering with insomnia/ other sleep issues.</p>\n<p>There's definitely a risk of that skewing the results, which perhaps I should've discussed in the text, but it felt like a trade-off between that and either splitting the recommendations, perhaps making the article more taxing to read, or giving recommendations based on very little evidence (by discounting some of the studies used for being the wrong group).</p>\n<p>Given all that, I'd likely stick with the same recommendations regardless of someone's current sleep quality. I'd encourage anyone to choose what resonates based on their current behaviours and perhaps experiment with multiple interventions.</p>\n", "parentCommentId": "ij3qjchJ7BKSzhMTA", "user": {"username": "ben3536"}}, {"_id": "NoWSGbySjmmPGGqmR", "postedAt": "2021-11-15T20:07:02.128Z", "postId": "Ei2uYbn2zrzmBjEsp", "htmlBody": "<blockquote><p>The simplest method is to <a href=\"https://www.amazon.com/s?k=sad+lamp&amp;crid=24IR27SPJK11A&amp;sprefix=sad%2Caps%2C271&amp;ref=nb_sb_ss_ts-doa-p_1_3\">purchase a SAD lamp</a> that emits 10,000 lux and place this on your desk, maximising exposure while working. <strong>However, the light levels received from a SAD lamp can decrease significantly if placed </strong><a href=\"https://www.google.com/search?q=sad+lamp+distance&amp;rlz=1C1CHBF_en-GBGB864GB864&amp;oq=sad+lamp+distance&amp;aqs=chrome..69i57j69i59j0i271j69i60l5.1977j0j4&amp;sourceid=chrome&amp;ie=UTF-8\"><strong>too far</strong></a><strong> from the face</strong>, while the lamp’s light offers minimal benefit when doing non-desk based activities.</p></blockquote><p>&nbsp;</p><p>This really bears emphasising, &nbsp;since most SAD lamps (accurately) marketed as \"10,000 lux\" are 10,000 lux only at distances much shorter than most people might expect or might be able to achieve with their desk setup (see <a href=\"https://lorienpsych.com/2020/12/19/light-therapy/#42_What_is_the_best_brand_of_light_box\">Scott Siskind's Lorien Psychiatry page</a> on this).</p><p>I was recently shopping for some new SAD lamps and most were 10,000lux at around 15cm (6 inches). See below using a copy of <i>The Life You Can Save</i> as reference. This suggests your eyes would need to be this close for the lamp to count as \"10,000 lux\". I also have a <a href=\"https://smile.amazon.co.uk/Lumie-Desklamp-Light-Therapy-Task/dp/B006BZ68XG/ref=sr_1_11?keywords=lumie&amp;qid=1637006032&amp;qsid=258-5220507-3212612&amp;sr=8-11&amp;sres=B07HWGS78Y%2CB07GB2MMK5%2CB07VHQ5K9B%2CB07FTPFWBH%2CB073P2WNDS%2CB07CN5P1RJ%2CB07VGMNVHZ%2CB07ZZKS67W%2CB006BZ68XG%2CB073P2CKHB%2CB006BZ698K%2CB08H1ZKK7H%2CB00G24NUEQ%2CB0098XHQ84%2CB08JBY465C%2CB07MCKTK1Q%2CB008LR3KD8%2CB00EO4ME1Q%2CB074W8YPK3%2CB08JQ2DDLK&amp;srpt=LAMP\">larger, more expensive lamp</a> which gives about 7cm (2.7inches) more wiggle room. One of the <a href=\"https://smile.amazon.co.uk/Lumie-Brazil-Large-000lux-Therapy/dp/B006BZ698K/ref=sr_1_1?keywords=lumie+brazil+lamp&amp;qid=1637006568&amp;qsid=258-5220507-3212612&amp;sr=8-1&amp;sres=B006BZ698K%2CB073P2WNDS%2CB099WGPQRM%2CB07GB2MMK5%2CB08L4G18XM%2CB08JBY465C%2CB01515Y3T2%2CB006BZ68XG%2CB07FFJYMVS%2CB091B6BFZX%2CB07FTPFWBH%2CB08JQ2DDLK%2CB07VHQ5K9B%2CB08F6ZZS13%2CB07RSG1MV1%2CB07CN5P1RJ%2CB07HWGS78Y%2CB0098XHQ84%2CB07ZZKS67W%2CB073P2CKHB\">most commonly available powerful lamps</a> I've found available in the UK would allow your eyes to be about 3 inches back from the edge of the book.</p><figure class=\"image\"><img src=\"https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/175550c7deb20d335f4bbc4c2e8e94f3ed2377c852e0bcf6.png\" srcset=\"https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/175550c7deb20d335f4bbc4c2e8e94f3ed2377c852e0bcf6.png/w_129 129w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/175550c7deb20d335f4bbc4c2e8e94f3ed2377c852e0bcf6.png/w_209 209w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/175550c7deb20d335f4bbc4c2e8e94f3ed2377c852e0bcf6.png/w_289 289w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/175550c7deb20d335f4bbc4c2e8e94f3ed2377c852e0bcf6.png/w_369 369w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/175550c7deb20d335f4bbc4c2e8e94f3ed2377c852e0bcf6.png/w_449 449w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/175550c7deb20d335f4bbc4c2e8e94f3ed2377c852e0bcf6.png/w_529 529w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/175550c7deb20d335f4bbc4c2e8e94f3ed2377c852e0bcf6.png/w_609 609w\"></figure>", "parentCommentId": null, "user": {"username": "David_Moss"}}, {"_id": "vyFbTSjeaxsidsYck", "postedAt": "2021-11-15T21:00:57.435Z", "postId": "Ei2uYbn2zrzmBjEsp", "htmlBody": "<blockquote><p><strong>Melatonin supplements</strong>: 0.3mg (300mcg) daily taken shortly before bed.</p></blockquote><p>What's the reasoning for taking it shortly before bed? I've heard that the default time to take melatonin should be a couple of hours before bed, except <a href=\"https://slatestarcodex.com/2018/07/10/melatonin-much-more-than-you-wanted-to-know/\">to treat delayed or advanced sleep phase</a>.</p>", "parentCommentId": null, "user": {"username": "tkwa"}}, {"_id": "YJDAptWQcWQmvtygk", "postedAt": "2021-11-16T01:19:22.777Z", "postId": "Ei2uYbn2zrzmBjEsp", "htmlBody": "<p>Have you investigated the effect of night-time darkness?</p><p><a href=\"https://www.pnas.org/content/116/24/12019\">https://www.pnas.org/content/116/24/12019</a>&nbsp;</p><p>Also of blocking blue/green light? Though there's only a handful of studies</p><p><a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7229994/\">https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7229994/</a> - &nbsp;found a 58% increase in night-time melatonin (blocking just blue, though separately it might do well to block green too)</p><p>I think I have some more notes lying around somewhere if you need them</p>", "parentCommentId": null, "user": {"username": "ChrisLakin"}}, {"_id": "nkdfE8LewLKr7vBko", "postedAt": "2021-11-16T01:21:48.287Z", "postId": "Ei2uYbn2zrzmBjEsp", "htmlBody": "<p>I'm surprised you haven't mentioned temperature. E.g. buying a chilipad brought down my night-time insomnia by ~80%. (And I live in the northeast, too!)</p><p>Recently I've moved my bed directly next to my air conditioner, which has been great</p>", "parentCommentId": null, "user": {"username": "ChrisLakin"}}, {"_id": "Nm6npcoKGQ3JANBNR", "postedAt": "2021-11-16T01:22:55.775Z", "postId": "Ei2uYbn2zrzmBjEsp", "htmlBody": "<p>What about the effects of daytime sunlight on sleep? (I would be hesitant about confounding sunlight exposure with vitamin D supplementation, I think it's unlikely that they're equivalent.)</p>", "parentCommentId": null, "user": {"username": "ChrisLakin"}}, {"_id": "HEMmqpkzo7vw8yYao", "postedAt": "2021-11-16T01:23:54.062Z", "postId": "Ei2uYbn2zrzmBjEsp", "htmlBody": "<p>recording oneself sleeping for snoring/sleep apnea seems huge.&nbsp;</p><p>&nbsp;</p><p>(sorry for the comment spam. I have lots more ideas too, feel free to email me, <a href=\"https://chrislakin.com\">https://chrislakin.com</a>/now.)</p>", "parentCommentId": null, "user": {"username": "ChrisLakin"}}, {"_id": "h6dgecbRsRwwg4hkB", "postedAt": "2021-11-16T10:20:02.500Z", "postId": "Ei2uYbn2zrzmBjEsp", "htmlBody": "<p>Thanks for flagging this! I'm going to edit it and clarify as 'shortly' is not a very specific recommendation. I've seen recommendations ranging from 30 minutes to 3 hours, with 1-2 hours being most common, so it's not exactly clear when is most effective. Earlier doses seem to cause some people to wake abnormally early.</p>\n<p>I'll change this to 2 hours as that's what was used in the literature cited.</p>\n", "parentCommentId": "vyFbTSjeaxsidsYck", "user": {"username": "ben3536"}}, {"_id": "XsaAu68JRT5sHmS9Z", "postedAt": "2021-11-16T10:23:55.015Z", "postId": "Ei2uYbn2zrzmBjEsp", "htmlBody": "<p>Thanks for highlighting this! The image really makes apparent the issue in a much more obvious way.\nIt's a shame there aren't SAD lamps designed to offset this, at least from what I've seen (e.g. by producing more than 10k lux to begin with). This issue definitely makes the construction of a whole-room lighting setup a more valuable solution.</p>\n", "parentCommentId": "NoWSGbySjmmPGGqmR", "user": {"username": "ben3536"}}, {"_id": "h6DnfdgBF2KXjyp7N", "postedAt": "2021-11-16T10:32:58.310Z", "postId": "Ei2uYbn2zrzmBjEsp", "htmlBody": "<p>Thanks for the suggestions! I think I may come back to this and expand the number of interventions I've reviewed and these are valuable suggestions that could well be worth promoting.</p>\n<p>Temperature and daytime sunlight are both somewhat mentioned in the article already but may be worthy of their own specific sections. I'd expect the benefits of daytime sunlight to roughly equal light exposure + Vitamin D. Given that, I think light therapy probably covers the majority of the positive effect but this likely warrants more specific research.</p>\n<p>With the larger project I'm working on in mind, there's a balance to be struck between research depth on a certain topic and breadth in the number of topics that I cover over the next few months, so there's definitely more depth that could be added to an article like this to improve it.</p>\n", "parentCommentId": "YJDAptWQcWQmvtygk", "user": {"username": "ben3536"}}, {"_id": "eC6GAhFr9xkAtX2Ge", "postedAt": "2021-11-16T10:58:45.140Z", "postId": "Ei2uYbn2zrzmBjEsp", "htmlBody": "<p>Thanks for writing this up, this is a good list. I used to struggle with getting to sleep for years, taking 1-2 hours to fall asleep on most days. To everybody with sleep problems, I want to encourage you to experiment with some of the above mentioned interventions. <strong>It is possible to improve your sleep</strong>. I have tried most of the things on this list and have had great success.&nbsp;</p><p>Just as an anecdotal data point:&nbsp;</p><p>One of the problems I had specifically was just going to bed way too late because I didn't get tired earlier than midnight. Being a night-owl isn't a problem per se, but honestly the world is more tailored to benefit early-risers. It sucks to have to cut short on your sleep because you have a mandatory Uni course at 08:00.&nbsp;</p><p>For a few months I have been taking <a href=\"https://www.lifeextensioneurope.com/melatonin-300-mcg\">this</a> 300mcg melatonin every day exactly at 17:00 after reading <a href=\"https://lorienpsych.com/2020/12/20/melatonin/#3_What_are_circadian_rhythm_disorders_How_do_I_use_melatonin_for_them\">this</a> article. It reliably makes me tired at 22:00-23:00 and I fall asleep astoundingly quickly if I go to bed in that time range. Something interesting I noticed is that when I go to bed later than that time, e.g. at 02:00, my tiredness is gone again and I find it much harder to fall asleep. Not sure if this is just placebo. Keep in mind that this will vary from person to person and my experience is probably different from yours. Also I do at least 5 other things to sleep better so there are many confounders and I don't know how much to attribute to using melatonin. Just <strong>experiment and see what works for you</strong>.</p><p><i>(I'm not a doctor and this is not medical advice)</i></p>", "parentCommentId": null, "user": {"username": "MaxG"}}, {"_id": "SzLNYbamE73yqHCjG", "postedAt": "2021-11-16T13:09:05.791Z", "postId": "Ei2uYbn2zrzmBjEsp", "htmlBody": "<p>About mindfulness: I have been meditating daily for a few years and have tried a bunch of different apps.</p>\n<p>The one I can recommend the most and use personally is Waking Up (<a href=\"https://wakingup.com/\">https://wakingup.com/</a>). Not only is it IMO the best app for mindfulness meditation, but they are also EA aligned. They signed the GWWC pledge and were among the first batch of companies to do so. If you can't afford the subscription, you can email them and get it for free.</p>\n<p>Would be curious to hear what experiences others have had with meditation apps.</p>\n", "parentCommentId": null, "user": {"username": "MaxG"}}, {"_id": "2ca8kF2rPyBviAkTX", "postedAt": "2021-11-16T17:57:41.600Z", "postId": "Ei2uYbn2zrzmBjEsp", "htmlBody": "<p>Relevant work demonstrating bright full-room lighting as an alternative to an SAD lamp: <a href=\"https://forum.effectivealtruism.org/posts/bwhDhZQvbEcG4FEb8/preprint-is-out-100-000-lumens-to-treat-seasonal-affective\">https://forum.effectivealtruism.org/posts/bwhDhZQvbEcG4FEb8/preprint-is-out-100-000-lumens-to-treat-seasonal-affective</a></p>\n", "parentCommentId": "NoWSGbySjmmPGGqmR", "user": {"username": "Lukas T"}}, {"_id": "qFLuheb8x6erMwXEs", "postedAt": "2021-11-17T10:52:30.729Z", "postId": "Ei2uYbn2zrzmBjEsp", "htmlBody": "<p>+1 for the Waking Up recommendation. Definitely the best meditation app I've used, with a lot of interesting content around what it means to live well more generally, plus the series with Will MacAskill on EA. I'm planning to do a proper write-up of meditation and mindfulness benefits and options in the near future.</p>\n", "parentCommentId": "SzLNYbamE73yqHCjG", "user": {"username": "ben3536"}}, {"_id": "smDmE2vgCtpC4Ftnw", "postedAt": "2021-11-17T12:06:40.014Z", "postId": "Ei2uYbn2zrzmBjEsp", "htmlBody": "<p>Thanks! It's cool they have done a study on the 'full-room' approach.</p><p>I think full-room approaches are worth people looking into, but it's worth noting that they are usually <i>less</i> bright than using SAD lamps (and this goes for the setup described in the pre-print too). As noted, in the <a href=\"https://www.medrxiv.org/content/10.1101/2021.10.29.21265530v1.full.pdf+html\">pre-print</a>, they put out more light, but because you are usually much further away from the lightbulbs distributed around the room than you would be from a light box on your desk, the mean illuminance at eye level was 1433-1829 lux. By comparison, I have three of the light boxes photographed above on my desk (quite a distance, more than arm's length), and they're each around 5000-7680 lux at eye level. Of course, it's <i>possible</i> to get much larger amounts of light from either approach.</p><p>As the pre-print notes, natural summer sunlight exposure has a few characteristics that might be advantageous over typical light therapy, i) much brighter, ii) covers the whole visual field, iii) exposure for many hours of the day, not just a short period in the morning.&nbsp;</p><p>I agree that (ii) might be important and potentially a significant advantage of the full room approach over light boxes. IME, one significant difficulty with getting a large amount of light from a small/concentrated source (such as a light box) is that it's subjectively very uncomfortable. Daylight, conversely, usually provides much more light but without the uncomfortable glare of having a single, very bright light in front of you. Ironically, when I tried setting up &nbsp;large number of bright lightbulbs around my room previously, they are actually <i>less</i> comfortable than light boxes, because without being fully covered by diffusers (as SAD lamps usually are, but which reduces the brightness a lot), the single points of very bright light coming from the bulbs were more unpleasant than the light boxes. Of course, there are very many different ways you could set these up in a room, including having more bulbs, but all with diffusers, so YMMV.</p><p>The authors are also right that being able to just sit in a bright room and move around freely within in might be a significant advantage (or a practical necessity) for many people. This isn't really a factor for me, and I'd imagine many EAs, since I am at my desk most hours and so can be exposed to my SAD lamps pretty easily.&nbsp;</p><p>I'm also uncertain about how less bright light spread roughly evenly across the day compares to the typical very bright dose of light first thing in the morning. It seems possible that the brighter light first thing in the morning is superior for circadian rhythm entrainment (and so improving your sleep), &nbsp;though it is also possible that less bright light throughout more of the day is superior (perhaps mediated by higher volume), or that this is superior for SAD, but not for circadian rhythm per se. I'd be interested if anyone knows any high quality studies that tease this apart. I often wonder, for myself, whether it would be better to have a high light dose only relatively early (and then cut it off) or to maintain a high light dose throughout most of the day.</p>", "parentCommentId": "2ca8kF2rPyBviAkTX", "user": {"username": "David_Moss"}}, {"_id": "FobqmqvNFpkAJhQSs", "postedAt": "2021-11-17T12:56:18.384Z", "postId": "Ei2uYbn2zrzmBjEsp", "htmlBody": "<p>Regarding magnesium, the specific supplement you happened to link to was magnesium oxide. There's some evidence that magnesium oxide is less bioavailable than other forms of magnesium (<a href=\"https://pubmed.ncbi.nlm.nih.gov/11794633/\">1</a>,<a href=\"https://www.tandfonline.com/doi/abs/10.1080/07315724.1990.10720349\">2</a>,<a href=\"https://bmcnutr.biomedcentral.com/articles/10.1186/s40795-016-0121-3\">3</a>) It's true that magnesium oxide is cheaper, but magnesium citrate is still exceptionally cheap (a few pence per dose). So, even if you are uncertain about the benefits of other forms over oxide, I think it's still probably reasonable to err in favour of these other forms.</p><p>I think it's also worth thinking about glycine. There are a few papers suggesting that glycine improves sleep quality (<a href=\"https://link.springer.com/article/10.1111/j.1479-8425.2006.00193.x\">4</a>, <a href=\"https://www.frontiersin.org/articles/10.3389/fneur.2012.00061/full\">5</a>, <a href=\"https://www.nature.com/articles/npp2014326\">6</a>, <a href=\"https://www.sciencedirect.com/science/article/pii/S1347861319305729\">7</a>). You could also take <a href=\"https://en.wikipedia.org/wiki/Magnesium_glycinate\">magnesium bisglycinate</a>, which contains both magnesium and glycine, but aside from convenience of only having to take one thing, I don't see any advantage to doing that rather than just dosing them separately.</p>", "parentCommentId": null, "user": {"username": "David_Moss"}}, {"_id": "jYL8YAFcsGF59HXdy", "postedAt": "2021-11-17T15:32:42.678Z", "postId": "Ei2uYbn2zrzmBjEsp", "htmlBody": "<p>Yeah, time constraints as expected. I think I found the title of this post a bit strong then.</p><p>Also, I would be surprised if light exposure + Vitamin D approximates daytime sunlight at more than 50% effect.</p>", "parentCommentId": "h6DnfdgBF2KXjyp7N", "user": {"username": "ChrisLakin"}}, {"_id": "L7MQRgbXQbSoHQc4n", "postedAt": "2021-11-17T15:33:58.202Z", "postId": "Ei2uYbn2zrzmBjEsp", "htmlBody": "<p>Thank you so much for this post - great work.<br>Your discussion of light therapy made me wonder about the effects of outdoor activities on sleep (and maybe other wellbeing dimensions). Any possibility you're going to analyse it in the future?&nbsp;</p>", "parentCommentId": null, "user": {"username": "Ramiro"}}, {"_id": "CcvdKmeP6BhyR3vnj", "postedAt": "2021-11-17T16:23:19.633Z", "postId": "Ei2uYbn2zrzmBjEsp", "htmlBody": "<p>I think that's a fair point about the title and have changed it in light of that. I'm curious as to what you'd expect the other 50% of effect to come from? (no snarkiness intended)</p>\n", "parentCommentId": "jYL8YAFcsGF59HXdy", "user": {"username": "ben3536"}}, {"_id": "P6hBgpbitC8mcsdHi", "postedAt": "2021-11-17T18:15:27.222Z", "postId": "Ei2uYbn2zrzmBjEsp", "htmlBody": "<p>I appreciate this writeup! Some of the interventions and insights were new to me even after attempting my own research in to improving sleep quality.</p>", "parentCommentId": null, "user": {"username": "KevinO"}}, {"_id": "pMJdWNvzKYBAFuG4q", "postedAt": "2021-11-17T18:41:38.054Z", "postId": "Ei2uYbn2zrzmBjEsp", "htmlBody": "<p>&gt;2 hours as that's what was used in the literature cited</p><p>Are you talking about that single study?</p><p>My current prior is that the optimal time for melatonin before bed changes between people, and I suggest that my friends experiment with it in nights that aren't so important first, in case it doesn't work well. [The reason is that I'm confused about Scott's recommendation to take it mid-day or to take it just-before-sleep]</p><p>Regarding the recommendations you saw - I'd want to dig into \"what are they based on\". The article <a href=\"https://forum.effectivealtruism.org/posts/Ei2uYbn2zrzmBjEsp/sleep-effective-ways-to-improve-it?commentId=vyFbTSjeaxsidsYck#comments\">Thomas linked to</a> gives the best review I've seen about what we know about Melatonin (as Scott Alexander often does when he summarizes scientific topics)</p><p>Adding: The same article recommends a supplier, and I also check suppliers <a href=\"https://www.reddit.com/r/nootropics/wiki/beginners#wiki_reliable_suppliers\">here</a>.</p><p>And while I'm at it, <a href=\"https://forum.effectivealtruism.org/users/gwern\">gwern</a> also writes quality in depth reviews, including about <a href=\"https://www.gwern.net/Melatonin\">melatonin</a></p>", "parentCommentId": "h6dgecbRsRwwg4hkB", "user": {"username": "hibukki"}}, {"_id": "qbv4TERydRi3nzfkH", "postedAt": "2021-11-17T18:50:34.833Z", "postId": "Ei2uYbn2zrzmBjEsp", "htmlBody": "<p>I have a friend who did this and discovered they stop breathing multiple times per night. Later they ordered an OuraRing and confirmed this.</p><p>Easy way to check: The <a href=\"https://play.google.com/store/apps/details?id=com.urbandroid.sleep&amp;hl=en&amp;gl=US\">Sleep As Android</a> app has a snoring-recording feature.</p>", "parentCommentId": "HEMmqpkzo7vw8yYao", "user": {"username": "hibukki"}}, {"_id": "ZfPd54ADYQmjgBRww", "postedAt": "2021-11-17T20:31:02.168Z", "postId": "Ei2uYbn2zrzmBjEsp", "htmlBody": "<p>Both the Slate Star Codex and Gwern articles are great and helped inform the article! (I think both are linked at points in the text)</p>\n<p>And yes, 2 hours is the timing used in the Zhdanova study. I couldn't find a clear consensus on any particular timing so I have chosen this without doing significant further research. I completely agree with you that experimenting with the timing of it seems ideal.</p>\n", "parentCommentId": "pMJdWNvzKYBAFuG4q", "user": {"username": "ben3536"}}, {"_id": "NpazAumAD2gecBCDE", "postedAt": "2021-11-17T20:32:47.026Z", "postId": "Ei2uYbn2zrzmBjEsp", "htmlBody": "<p>Thank you! I'm definitely interested in potential additional benefits from being outside. I have a rough intention to do a more in-depth analysis of bright light exposure and its full range of wellbeing benefits at some point. I think this, alongside vitamin D, approximates a good amount of the benefit of being outdoors.</p>\n", "parentCommentId": "L7MQRgbXQbSoHQc4n", "user": {"username": "ben3536"}}, {"_id": "TnavtKo8jCdyCr4wB", "postedAt": "2021-11-17T20:34:28.215Z", "postId": "Ei2uYbn2zrzmBjEsp", "htmlBody": "<p>Cheers! It's great to know that this work has been useful, or at least interesting, for people.</p>\n", "parentCommentId": "P6hBgpbitC8mcsdHi", "user": {"username": "ben3536"}}, {"_id": "jPAS6cKpaSPHotg6Q", "postedAt": "2021-11-18T01:27:46.908Z", "postId": "Ei2uYbn2zrzmBjEsp", "htmlBody": "<p>I agree on the Waking Up app. I have tried Headspace, Calm and Waking Up and found Waking Up to be the best choice for me. Specifically, the Theory section has been helpful to me as a beginner trying to learn about meditation. I also appreciate that it lacks some feature that I find corny in other apps, such as celebrity cameos. However, it may not be best people who don’t care for Sam Harris due to his various political positions, or those who do like him, but associate his voice with his podcast.</p>", "parentCommentId": "SzLNYbamE73yqHCjG", "user": {"username": "Bryan Hanlon"}}, {"_id": "XrPPAH2Scq2A9pSLd", "postedAt": "2021-11-18T02:31:23.939Z", "postId": "Ei2uYbn2zrzmBjEsp", "htmlBody": "<p>Thanks for this post, and for the links to SSC and Gwern. I just ordered some 1 mg Melatonin and plan to cut it in half to start.</p><p>I’m a pretty poor sleeper, both with falling asleep and staying asleep. I suspect I’ll also benefit from establishing a similar routine for both weekdays and weekends, which tend to pretty distinct right now.</p>", "parentCommentId": null, "user": {"username": "Bryan Hanlon"}}, {"_id": "Xi9bZhi5HZug7fjhp", "postedAt": "2021-11-18T10:48:12.084Z", "postId": "Ei2uYbn2zrzmBjEsp", "htmlBody": "<p>While I am as much a fan of wellbeing research as the next fellow - indeed, probably a much bigger fan - I have to say I found the methodology and conclusions of this research rather confusing.</p><p>If I were approaching this topic, I would have (1) done a review of the existing literature to find out what people thought was effective and what the possible interventions were, then (2) tried to assess the options in terms of (a) a comparable metric of effectiveness and (b) cost, so readers could think about what would do the most for them at the least effort.</p><p>As it is, this research seems to have missed out many of the <a href=\"https://www.elevatedhealth.md/blog/2020/2/5/12-tips-for-good-sleep\">standard pieces of advice</a> like avoiding alcohol, napping after 3pm, having a large meal before bed, or having a sleep routine. &nbsp;The author doesn't mention having looked at the existing literature, but does note that other EAs have mentioned sleep. I don't mean to single out the OP, but I do want to deride the myopic and self-referential tendency among effective altruists in general to overlook work done outside effective altruism. Lots of good has happened 'out there' and we ignore it at our peril.</p><p>What I found least satisfying about this research was how this (partial list of) interventions were assessed. As far as I can see, the 'weighted-factor model' involved assigning unexplained subjective numbers to various seemingly-arbitrarily chosen properties, then assigning a seemingly-arbitrary weight to each factor to aggregate them. * I am reminded of \"Garbage-In-Garbage-Out\" concept in computer science where nonsense inputs products nonsense outputs. As a reader, I have no idea how to interpret the rankings or numbers - what does it mean that melatonin gets \"5.95/10\" or that CBT-I gets \"5.78\"? - or how much to update off them. The results are basically uninterpretable.&nbsp;</p><p>I would strongly&nbsp;recommend that the OP heavily revise their methods and the presentation of their research for any further work. The main thing would be to present the results of the interventions in a standardised metric, e.g. total sleep time, or standard deviations of something, so readers can make a comparison themselves, then make comments on cost and, if necessary research quality. I am happy to provide advice if that's helpeful.</p><p>&nbsp;</p><p>*I recognise the weighted-factor model is something Charity Entrepreneurship use. &nbsp;I have raised it with them several times that, for the reasons given, I find this approach hard to follow or justify and thus questionably useful.&nbsp;</p>", "parentCommentId": null, "user": {"username": "MichaelPlant"}}, {"_id": "EyxafHMfrqsGCzFLu", "postedAt": "2021-11-18T12:16:45.137Z", "postId": "Ei2uYbn2zrzmBjEsp", "htmlBody": "<p>Thank you for the feedback!</p><p>There's a few points you make that I feel are important to clarify but I want to first acknowledge that the format and presentation of the research is a work in progress and could definitely be improved. In particular, I can agree that the \"5.95/10\" numbers aren't particularly useful given the lack of any context/ scale.</p><p>To respond quickly to a few specific points:<br>1) This research was overwhelmingly based on the existing literature. I chose not to include a reference list or in-text citations to maximise the readability of the text but perhaps this was an error.<br>2) The interventions' strength of effect, which accounts for about 40% of the score, is an average of improvements in sleep efficiency and total sleep time found in the literature I reviewed. In hindsight, I think it could have been better to highlight these findings on their own in the text and may add them in.<br>3) The focus of this research was to explore interventions that the reader is less likely to have heard of previously. I assumed that ideas like avoiding alcohol and late naps are things that nearly all readers would already know. On that basis, I felt that highlighting them in an article like this is unlikely to produce any change in behaviour, though I can see now the potential usefulness of presenting the size of effect.&nbsp;<br>4) I think an article like this recommending low-cost, personal interventions can reasonably have a different approach and level of rigour to one recommending charitable interventions and/or shifting large sums of money. A weighted factor model may not be the best way to frame this research but I think additional considerations like the potential risks and additional benefits of a recommendation are important and necessary to highlight.&nbsp;<br><br>These points make me realise that a more explicit description of the methods used and the literature reviewed would be valuable for future posts, rather than linking to them in out-of-text docs or leaving them out for a marginal improvement to the conciseness of the text.</p><p>This is the first post intended in a series and I expect to revise and improve the methods involved with each post and certainly the feedback I get on posts helps to direct that process. As a first attempt, some of the process was not as rigorous as it could or perhaps should be. In part, this is a relatively time-limited project for now (~3 months) so I am sacrificing some potential added depth in each post for the ability to cover more topics.<br><br>On a final note, I have immense respect and appreciation for the work of HLI and so really appreciate the feedback from someone who does wellbeing research at a much higher level!</p>", "parentCommentId": "Xi9bZhi5HZug7fjhp", "user": {"username": "ben3536"}}, {"_id": "DXgc8Mo4ZMuPCcaGL", "postedAt": "2021-11-18T12:52:53.044Z", "postId": "Ei2uYbn2zrzmBjEsp", "htmlBody": "<p>Don’t forget sleep apnea. I recently got a diagnosis and treatment. Felt much better now.</p>\n", "parentCommentId": null, "user": {"username": "newptcai"}}, {"_id": "Rm4hM3yiwoZiGyh6v", "postedAt": "2021-11-18T14:45:23.502Z", "postId": "Ei2uYbn2zrzmBjEsp", "htmlBody": "<p>After reading this post, I'll try out the Dozy app for CBT-I, even though I don't really have insomnia per se.</p>\n<p>For bright light therapy, it's confusing to me why exposure to daylight isn't more often as a solution. Would it make sense to say that, if you live in a reasonably sunny place and have time to spend time in the daylight, then you should consider just spending more time in the daylight, not only light boxes? Sunlight is often a lot brighter than the 10,000 lux of a light box, and it fills the entire visual field.</p>\n", "parentCommentId": null, "user": {"username": "michaelchen"}}, {"_id": "H85ayeHZNgyuPGmWT", "postedAt": "2021-11-19T02:20:21.933Z", "postId": "Ei2uYbn2zrzmBjEsp", "htmlBody": "<p>On the vitamin D side: In I'm pretty skeptical of reductionist viewpoints in general such as here, ~\"the single compound of 'vitamin D' placed into supplements has nearly the same effect as broad-spectrum UV on skin affects the body\". I wouldn't be surprised if broad-spectrum UV had plenty of other effects that we have no idea how to look for, or for example if \"UV → {this specific compound that is put in supplements}\" is a poor approximation (maybe broad-spectrum UV causes the production of plenty of compounds that are also great, and we're only inclined to supplement one).</p><p>E.g. Vitamin D2 could be an easy way to go wrong here (I've only ever criticism about the effectiveness of D2). If Vitamin D supplementation works at all, I would bet on D3, but I haven't seen you make this distinction.</p><p>Overall I think this is pretty complex to make such general reductionist prescriptions (e.g. take 'Vitamin D3, X IUs everyday in the morning…\") unfortunately.&nbsp;</p><p>((Also, we might live in a world where the supplement Vitamin D3 is fairly ineffective, <i>but</i> it still causes the blood biomarker to increase, confounding all studies everywhere.))</p><p>I used to supplement Vitamin D3 for a few years, but I stopped when I heard about all of these subtle ways that it could be ineffective (or harmful). Instead, I took more walks outside, and I took my shirt off while in sunlight more often. I have also noticed I feel much better this way, quite calmer, and I suspect quite a bit more productive on these days, and I've never gotten that from a supplement.</p><p>&nbsp;</p><p>On the light exposure side: 10,000 lux is still an order of magnitude less than sunlight! &nbsp;Also, I doubt these lamps emit any UV, and I expect that a lot of the effect of sunlight comes from UV and that which we cannot see.</p>", "parentCommentId": "CcvdKmeP6BhyR3vnj", "user": {"username": "ChrisLakin"}}, {"_id": "9WnFPCKE7hnMPGdRE", "postedAt": "2021-11-19T02:21:12.185Z", "postId": "Ei2uYbn2zrzmBjEsp", "htmlBody": "<p>ty for the app! do you know of one for iOS?</p>", "parentCommentId": "qbv4TERydRi3nzfkH", "user": {"username": "ChrisLakin"}}, {"_id": "um4JF8DEbS9CoBREw", "postedAt": "2021-11-19T11:36:25.841Z", "postId": "Ei2uYbn2zrzmBjEsp", "htmlBody": "<p>Hello Ben!</p>\n<p>Good to know this was based on existing literature. In most cases, it helps to show the reader you know that literature, to outline what it is, and then go on say what your new contribution is. Like I say, you missed a few of the obvious things, which is unfortunate.  A piece of \"what works for X\" should, I say, include the things that work for X, then perhaps go on to flag which of these are likely to be a surprise, rather than assuming on the reader's behalf what they will already know. If you are going to have a piece on \"what works for X that might but that might surprise you\" you should at least clearly flag that, and then point to something such as \"standard guidance on X\".</p>\n<p>Re strength of interventions being \"40%\" that still seems a confused way of presenting the information. 40% of what? Of a maximum score? A maximum score of what? Of cost-effectiveness? Well, why not just present the effectiveness numbers and divide them by the costs then?</p>\n<p>I agree that this sort of thing can have a lower level of rigour but I stand by my concern that the method you use is so puzzling it's questionably useful at all.  You gathered quite a bit of relevant info, but I think you presented it in a less-than-ideal way. Here, simpler would have been better: I'd have preferred a post that just said \"here's a list of evidence-based ways to improve sleep\" and then listed them and provided a brief discussion on each. That seems the way to go unless you have the data and time to do a quantitative (cost-)effectiveness analysis.</p>\n<p>Glad you think we (at HLI) do good work. Like I see, feel free to reach out if you want to chat about research methods etc.! You can get me at <a href=\"mailto:michael@happierlivesinstitute.org\">michael@happierlivesinstitute.org</a></p>\n", "parentCommentId": "EyxafHMfrqsGCzFLu", "user": {"username": "MichaelPlant"}}, {"_id": "Shf5rHZsfHedNHDM6", "postedAt": "2021-11-19T18:27:07.548Z", "postId": "Ei2uYbn2zrzmBjEsp", "htmlBody": "<p>Thanks - this is useful and I will explore some of the suggestions.</p><p>Is there much research comparing immediate vs extended release melatonin? E.g.:</p><ol><li>Is IR better for speeding sleep onset, as one might expect?</li><li>Does XR actually improve sleep maintenance/duration more than IR?&nbsp;</li><li>Do they have the same effect on sleep efficiency?</li><li>Is the optimal dose the same for each?</li><li>Dose aside, do <a href=\"https://www.lifeextension.com/vitamins-supplements/item02201/melatonin-irxr\">combined IR/XR supplements</a>, or taking a bit of each, give you the 'best of both worlds'?</li></ol>", "parentCommentId": null, "user": {"username": "Derek"}}, {"_id": "YnfA9PuPKbnN2umMs", "postedAt": "2021-11-19T18:37:23.466Z", "postId": "Ei2uYbn2zrzmBjEsp", "htmlBody": "<p>Is the CO2 accumulation entirely due to human (or I suppose animal) respiration? So it will typically be worse in small houses with lots of people (holding other factors, like ventilation, constant)?</p><p>In a modern house, with no open fires, lead paint etc, what \"household air pollution\" might there be?</p>", "parentCommentId": null, "user": {"username": "Derek"}}, {"_id": "Pef4ewBkDdF6qjLep", "postedAt": "2021-11-21T04:11:31.226Z", "postId": "Ei2uYbn2zrzmBjEsp", "htmlBody": "<p>Just wanted to +1 blue blocking glasses.</p>\n", "parentCommentId": "h6DnfdgBF2KXjyp7N", "user": {"username": "iamef"}}, {"_id": "zPorrWaRNcfxowfeJ", "postedAt": "2021-11-21T04:12:58.020Z", "postId": "Ei2uYbn2zrzmBjEsp", "htmlBody": "<p>Agree that the quality of magnesium matters!</p>\n<p><a href=\"https://www.youtube.com/watch?v=XfeiBd8h6Xw\">https://www.youtube.com/watch?v=XfeiBd8h6Xw</a>\n<a href=\"https://www.youtube.com/watch?v=jTiXVGwZLO4\">https://www.youtube.com/watch?v=jTiXVGwZLO4</a></p>\n", "parentCommentId": "FobqmqvNFpkAJhQSs", "user": {"username": "iamef"}}, {"_id": "5c4iRoGJpT3LEcjD4", "postedAt": "2021-11-21T14:36:04.878Z", "postId": "Ei2uYbn2zrzmBjEsp", "htmlBody": "<p><strong>I think it's pretty weird that Melatonin is #1 in your list.</strong> I think it's weird to suggest exogenous supplementation of something like that without an explanation of why melatonin is low to begin with. The efficient market hypothesis, but applied to your own biochemistry. Chesterton's fence, etc.</p><p>The body isn't a machine- as if you can just give it the right amounts of the right compounds and it &nbsp;will perform optimally.</p>", "parentCommentId": null, "user": {"username": "ChrisLakin"}}, {"_id": "GJkSebosWt2QqS5tk", "postedAt": "2022-01-10T18:35:44.353Z", "postId": "Ei2uYbn2zrzmBjEsp", "htmlBody": "<p>Thanks for opening this topic. It's important to realise there are different kinds of sleep problem, so different people will need different solutions:</p><ol><li>sleep onset&nbsp;<br>(which tends to be due to stimulation too late at night; CBT sleep hygiene works well for this, if done diligently, and limiting coffee etc)</li><li>early morning waking&nbsp;<br>(which tends to be due to stress-anxiety-depression or large amounts of alcohol)</li><li>low sleep quality&nbsp;<br>(which can be due to a range of things but alcohol and the wrong medication is a classic cause; Mirtazapine is popular, but has long term dangers like weight gain)</li></ol><p>In the UK, melatonin* is no longer available without prescription, only &nbsp;5-HTP, which is a precursor. Is this because people tended to take dangerously large doses of melatonin? (Precursors tend to be safer, because the body can convert the amount it needs, at the right time.)&nbsp;</p><p>Generally fresh air is a good thing but there are caveats especially during a pandemic winter. If you pull in too much very cold air (with low absolute humidity) you can quickly go below 40% RH which is bad for the protective mucus layer of the lung &amp; airways, and the glycans+non-IgG antibodies which are important for innate immunity.<br><br>What makes you think slightly lower CO2 or higher O2 levels are good for sleep? Isn't the converse equally or more likely? (If not, people who live in mountain areas are in trouble! And I sleep really well in the mountains.) I have noticed that people in higher &nbsp;CO2 environments seem drowsy. Of course, this too may not correlate with good <i>quality</i> &nbsp;sleep!</p><p>Are you defining good sleep just by duration? For more on this, search &lt; sleep architecture CBT &gt;</p><p>On the SAD lighting, many people find the room lighting or boxes impractical. Much easierfor some is a visor or glasses which can be worn while preparing breakfast etc. I've been happy with an Australian brand (www.re-timer.com/the-science/research) but there are others that may look cooler!</p><p>* <a href=\"https://www.webmd.com/sleep-disorders/news/20181112/as-melatonin-use-rises-so-do-safety-concerns\">https://www.webmd.com/sleep-disorders/news/20181112/as-melatonin-use-rises-so-do-safety-concerns</a><br><br><a href=\"https://alaskaregional.com/blog/entry/4-reasons-to-be-cautious-about-melatonin\">https://alaskaregional.com/blog/entry/4-reasons-to-be-cautious-about-melatonin</a>&nbsp;</p>", "parentCommentId": null, "user": {"username": "RayTaylor"}}, {"_id": "cQd5xtAKyRbQAipSW", "postedAt": "2022-01-10T18:43:38.476Z", "postId": "Ei2uYbn2zrzmBjEsp", "htmlBody": "<p>I find the ReTimer glasses much easier to use, £120 and portable for travelling.</p>", "parentCommentId": "smDmE2vgCtpC4Ftnw", "user": {"username": "RayTaylor"}}, {"_id": "tg2xQQqrEg6zQCZeT", "postedAt": "2022-01-10T18:45:41.365Z", "postId": "Ei2uYbn2zrzmBjEsp", "htmlBody": "<p>Being outside daytime and keeping the bedroom area for nighttime use are both known to be helpful which is why they are part of CBT sleep hygiene.&nbsp;</p><p>You're right that it's not linked to vitamin D, which is via the skin not the eye/pineal/melatonin circuit.</p>", "parentCommentId": "Nm6npcoKGQ3JANBNR", "user": {"username": "RayTaylor"}}, {"_id": "BSTniEdJYxBdwKF8g", "postedAt": "2022-01-10T18:47:09.588Z", "postId": "Ei2uYbn2zrzmBjEsp", "htmlBody": "<p>The main effect is on training the subconscious to associate certain times of day and places with sleep, and other times/places with activity.&nbsp;</p>", "parentCommentId": "H85ayeHZNgyuPGmWT", "user": {"username": "RayTaylor"}}, {"_id": "txx2Nuofm8cCGhcmv", "postedAt": "2022-01-10T23:51:52.366Z", "postId": "Ei2uYbn2zrzmBjEsp", "htmlBody": "<p>More than you would think - a lot from kitchen, some from (newer) furniture, some faecal matter from mites, house dust which is largely human skin, cleaning chemicals, ozone, positive ions (the bad ones) from laptops especially Macbooks, mould spores, etc.<br><a href=\"https://www.blf.org.uk/support-for-you/indoor-air-pollution/causes-and-effects\">www.blf.org.uk/support-for-you/indoor-air-pollution/causes-and-effects</a><br><a href=\"https://www.epa.gov/indoor-air-quality-iaq/introduction-indoor-air-quality\">www.epa.gov/indoor-air-quality-iaq/introduction-indoor-air-quality</a>&nbsp;<br>but in may countries the original source of 'household' (indoor) air pollution is actually from outside the home:<br><a href=\"https://www.conserve-energy-future.com/causes-and-effects-of-indoor-air-pollution.php\">www.conserve-energy-future.com/causes-and-effects-of-indoor-air-pollution.php</a>&nbsp;<br><a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5089137/\">www.ncbi.nlm.nih.gov/pmc/articles/PMC5089137</a>&nbsp;<br>I bought two HEPA filters to help protect others during a home isolation, but I also had in mind that it would be useful afterwards!&nbsp;</p>", "parentCommentId": "YnfA9PuPKbnN2umMs", "user": {"username": "RayTaylor"}}, {"_id": "irfPEtAjxtMnCPJ6G", "postedAt": "2022-01-11T00:00:48.936Z", "postId": "Ei2uYbn2zrzmBjEsp", "htmlBody": "<p>The decision may be between IR melatonin and ER 5-HTP which is a precursor:<br>www.foodstuffs.ca/scrapbookmain/2017/5/14/5-htp-vs-melatonin<br><br>\"For some people, taking melatonin will help induce and maintain sleep. However, melatonin supplements usually only work if a person has low levels of melatonin in their system (this situation is commonly found in elderly persons). In other words, if you have normal levels of melatonin, taking melatonin supplements won't be as effective in helping you sleep.</p><p>That's where 5-HTP comes in. Since it works on serotonin as well (and indirectly on melatonin), it may be a better supplement to take for individuals with normal levels of melatonin that are suffering from insomnia. Because it interacts with serotonin, people who are already on anti-depressants or MAOIs should talk to their doctor before trying 5-HTP (melatonin, on the other hand, is generally safe to use with these other drugs when taken as directed).\"<br><a href=\"https://www.quora.com/What-is-the-difference-between-taking-melatonin-and-5HTP\">www.quora.com/What-is-the-difference-between-taking-melatonin-and-5HTP</a>&nbsp;</p><p>General intro to 5-HTP and uses:<br><a href=\"https://www.mountsinai.org/health-library/supplement/5-hydroxytryptophan-5-htp\">www.mountsinai.org/health-library/supplement/5-hydroxytryptophan-5-htp</a>&nbsp;</p>", "parentCommentId": "Shf5rHZsfHedNHDM6", "user": {"username": "RayTaylor"}}, {"_id": "3tbhJwvoqcddnZDLR", "postedAt": "2022-01-11T00:02:59.327Z", "postId": "Ei2uYbn2zrzmBjEsp", "htmlBody": "<p>Yes that would be better.<br><br>(But be careful of sunburn, <i>especially in the tropics and at altitude!</i>)</p>", "parentCommentId": "Rm4hM3yiwoZiGyh6v", "user": {"username": "RayTaylor"}}, {"_id": "58cMZHNEaTeDFoLHu", "postedAt": "2022-01-11T17:17:48.696Z", "postId": "Ei2uYbn2zrzmBjEsp", "htmlBody": "<p>Thanks. I tried 5-HTP a few years ago and didn't notice any benefit, but maybe I'll give it another go.</p>", "parentCommentId": "irfPEtAjxtMnCPJ6G", "user": {"username": "Derek"}}, {"_id": "sr5zYqnzwmYPeqo4z", "postedAt": "2022-04-05T11:07:25.110Z", "postId": "Ei2uYbn2zrzmBjEsp", "htmlBody": "<p><a href=\"https://effectiveselfhelp.org/\">Effective Self-Help</a> is looking for feedback! Hi everyone, we're looking to evaluate our work up to now researching the most effective wellbeing and productivity interventions. We'd really appreciate you filling out <a href=\"https://docs.google.com/forms/d/e/1FAIpQLSfJHCDJM8fKT7om-SCdrhUI4TW-Y0HOLweWSLF2Ruxv7bucKA/viewform\">this 5-10 minute evaluation survey</a> which will help us figure out how we can be of most help to the EA community.<br>You don't need to have read any of our reports up to now to fill out the survey so we'd love to hear your thoughts, even if you've never heard of us before! Thanks in advance for your help!</p>", "parentCommentId": null, "user": {"username": "Manon Gouiran"}}, {"_id": "YXY6GXsCbKL9NrZmL", "postedAt": "2022-04-10T21:07:54.699Z", "postId": "Ei2uYbn2zrzmBjEsp", "htmlBody": "<p>Thanks for taking the initiative to publish this. I offer these resources<br>&nbsp;</p><ol><li>A good <a href=\" https://www.bluezones.com/checklists/bedroom/\">all-around guide from The Blue Zones</a></li><li>Humans may be hard-wired for <a href=\"https://www.webmd.com/sleep-disorders/features/what-is-segmented-sleep\">segmented sleep</a></li><li>If you are getting poor sleep, <a href=\"https://www.theguardian.com/lifeandstyle/2014/mar/15/all-by-myself-is-loneliness-bad-for-you#:~:text=cacioppo's%20breakthrough%20came%20when%20he%20found%20that%2C%20when%20they%20sleep%2C%20the%20lonely%20suffer%20more%20%22micro-awakenings%22%20in%20the%20night.\">you may be lonely</a></li></ol><p>Johann Hari touches on this last one in his excellent book, <a href=\"https://www.amazon.com/dp/B07583XJRW/?t=it4np-20&amp;ie=UTF8\"><i>Lost Connections:</i></a></p><blockquote><p><i>Anywhere in the world where people describe being lonely, they will also—throughout their sleep—experience more of something called ‘micro-awakenings.’ These are small moments you won’t recall when you wake up, but in which you rise a little from your slumber. All other social animals do the same thing when they’re isolated too. The best theory is that you don’t feel safe going to sleep when you’re lonely, because early humans literally weren’t safe if they were sleeping apart from the tribe. You know nobody’s got your back—so your brain won’t let you go into full sleep mode. Measuring these ‘micro-awakenings’ is a good way of measuring loneliness… [A researcher studying the Hutterites in the American Dakotas found] they had barely any. The [Hutterite] community showed the lowest level of loneliness that [the researcher had] seen anywhere in the world. It really stunned [him].</i></p></blockquote>", "parentCommentId": null, "user": {"username": "DaveC"}}, {"_id": "8NQ8EBhJZJWSxdtgo", "postedAt": "2022-04-27T20:47:26.027Z", "postId": "Ei2uYbn2zrzmBjEsp", "htmlBody": "<p>Relaxing sounds help me to sleep well e.g. rain on window with thunderstorm or just rain-sounds. I listen to different vids on youtube, watch below</p><p>https://www.youtube.com/channel/UCH2RKkwU5XbH6DaJgWzHFig</p>", "parentCommentId": null, "user": {"username": "Mecki"}}, {"_id": "ojJqu3ycWPcCDbcDW", "postedAt": "2022-06-08T06:38:20.719Z", "postId": "Ei2uYbn2zrzmBjEsp", "htmlBody": "<p>I had trouble of having enough sleep lately. Often I woke up early and could not go back to sleep again. Last night I took 0.3mg melatonin and this morning I missed my alarm clock and slept for 9 hours straight! 😲</p>\n<p>It may be because that I slept for only 6 hours the night before, but  it has never happened before that I would not wake up by alarm clocks. But this is a promising beginning.</p>\n", "parentCommentId": null, "user": {"username": "newptcai"}}, {"_id": "r7J4FtoGxJBSayJwB", "postedAt": "2022-06-12T23:41:28.782Z", "postId": "Ei2uYbn2zrzmBjEsp", "htmlBody": "<p>My favourite is Ten Percent Happier – it's very accessible and it has a lot of meditations and teachings by Joseph Goldstein, who also appears in the lectures in Waking Up.\nI've also found some value from Sam Harris's meditations, especially the early ones he released long before the app.\nTen Percent Happier don't have the free option AFAIK, but they do have an 8-part free intro. And they have significant discounts at times through the year.</p>\n", "parentCommentId": "SzLNYbamE73yqHCjG", "user": {"username": "Chriswaterguy"}}, {"_id": "qzjBeH3yJZyXnzWp2", "postedAt": "2022-06-12T23:58:59.694Z", "postId": "Ei2uYbn2zrzmBjEsp", "htmlBody": "<p>5-HTP is a precursor to serotonin, which is a precursor to melatonin. I imagine that this would have a much slower and less predictable effect, less suitable for helping to go to sleep in a particular time range.</p>\n<p>I share the concerns about possible overuse of melatonin, though I've found out helpful at times. I try to adjust light exposure (morning and night) as a higher priority than melatonin.</p>\n<p>I may also go back to using low dose melatonin, though, as it's been helpful in the past and may be needed in modern technological society.</p>\n", "parentCommentId": "GJkSebosWt2QqS5tk", "user": {"username": "Chriswaterguy"}}, {"_id": "uBzjJBD4rdJq9Goxi", "postedAt": "2022-06-13T00:02:13.544Z", "postId": "Ei2uYbn2zrzmBjEsp", "htmlBody": "<p>It's worth noting that being outside in sunshine gives much more intense light exposure than any mainstream SAD treatment.\n(My personal experience is that it can give a large boost in alertness, and probably helps my sleep significantly. But I'm in Sydney – I can't speak for northern Europe or Canada.)</p>\n", "parentCommentId": "NpazAumAD2gecBCDE", "user": {"username": "Chriswaterguy"}}, {"_id": "teAwXCPvuEweqbvss", "postedAt": "2022-06-16T11:44:33.756Z", "postId": "Ei2uYbn2zrzmBjEsp", "htmlBody": "<blockquote><p>one study found several common houseplants <a href=\"https://www.researchgate.net/publication/315968651_Effectiveness_of_Indoor_Plant_to_Reduce_CO_2_in_Indoor_Environment\">reduced CO<sub>2</sub> concentration in a room by 15-20%</a>. It seems reasonable to assume that placing several houseplants in a room would significantly increase this effect, though likely with diminishing returns.</p></blockquote><p>&nbsp;</p><p>Unfortunately, I am quite a bit less optimistic about this. &nbsp;(Caveat: I only looked into this very briefly)</p><p>From quickly looking at the conference paper you cite, it seemed that the plants were in 1 cubic meter chambers and reduced CO2 by ~50-100ppm &nbsp;for the most part (~5-12% reduction) based on table 1.&nbsp;</p><figure class=\"image\"><img src=\"https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/2c15c5f3f169d0f4773578078fc41354509c24ce1aa0a5ae.png\" srcset=\"https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/2c15c5f3f169d0f4773578078fc41354509c24ce1aa0a5ae.png/w_100 100w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/2c15c5f3f169d0f4773578078fc41354509c24ce1aa0a5ae.png/w_200 200w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/2c15c5f3f169d0f4773578078fc41354509c24ce1aa0a5ae.png/w_300 300w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/2c15c5f3f169d0f4773578078fc41354509c24ce1aa0a5ae.png/w_400 400w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/2c15c5f3f169d0f4773578078fc41354509c24ce1aa0a5ae.png/w_500 500w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/2c15c5f3f169d0f4773578078fc41354509c24ce1aa0a5ae.png/w_600 600w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/2c15c5f3f169d0f4773578078fc41354509c24ce1aa0a5ae.png/w_700 700w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/2c15c5f3f169d0f4773578078fc41354509c24ce1aa0a5ae.png/w_800 800w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/2c15c5f3f169d0f4773578078fc41354509c24ce1aa0a5ae.png/w_900 900w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/2c15c5f3f169d0f4773578078fc41354509c24ce1aa0a5ae.png/w_962 962w\"></figure><p>But bedrooms are generally a lot larger and contain at least one human breathing out carbon dioxide into them. <a href=\"https://greenplantsforgreenbuildings.org/wp-content/uploads/2014/01/Project-Carbon-HortScience-474.pdf\">This paper</a> suggests that since humans breathe out about 300g per day, ~400 plants, in good conditions, would be needed to offset this. Naturally only a portion of that 300g is breathed out into one's bedroom at night, &nbsp;but it still seems like one might need ~100 plants for one person in a room, and one would need to ensure that these are plants which take up CO2 at night, rather than exhaling it at night.</p>", "parentCommentId": null, "user": {"username": "David_Moss"}}, {"_id": "rvYLkzo6mBBwkikCD", "postedAt": "2022-06-16T12:31:03.982Z", "postId": "Ei2uYbn2zrzmBjEsp", "htmlBody": "<p>If you want to absorb 300g/day of CO2 you need the plants to grow by ~300g/day. Which is a lot!</p>\n<p>(It's only rough: 300g of CO2 is 12/(12+2*18) carbon, but when absorbing carbon plants also take in water with goes the other way)</p>\n", "parentCommentId": "teAwXCPvuEweqbvss", "user": {"username": "Jeff_Kaufman"}}, {"_id": "Kf5JHBJ3eYGT6AZGT", "postedAt": "2022-06-16T13:26:56.186Z", "postId": "Ei2uYbn2zrzmBjEsp", "htmlBody": "<p>I think (though, again, I only read it quickly) the paper includes estimates for both carbon sequestered <i>and</i> biomass growth for the plants.</p><p>I believe the plant which they used as the reference for that rough figure above increased in biomass by 132.5g but sequestered 56.4g carbon over several weeks, and the 0.8g carbon fixed per day comes from that latter figure.</p><figure class=\"image\"><img src=\"https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/de1559d87d6a940726510fb61d6f94dee9cd931f188d23cb.png\" srcset=\"https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/de1559d87d6a940726510fb61d6f94dee9cd931f188d23cb.png/w_90 90w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/de1559d87d6a940726510fb61d6f94dee9cd931f188d23cb.png/w_180 180w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/de1559d87d6a940726510fb61d6f94dee9cd931f188d23cb.png/w_270 270w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/de1559d87d6a940726510fb61d6f94dee9cd931f188d23cb.png/w_360 360w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/de1559d87d6a940726510fb61d6f94dee9cd931f188d23cb.png/w_450 450w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/de1559d87d6a940726510fb61d6f94dee9cd931f188d23cb.png/w_540 540w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/de1559d87d6a940726510fb61d6f94dee9cd931f188d23cb.png/w_630 630w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/de1559d87d6a940726510fb61d6f94dee9cd931f188d23cb.png/w_720 720w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/de1559d87d6a940726510fb61d6f94dee9cd931f188d23cb.png/w_810 810w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/de1559d87d6a940726510fb61d6f94dee9cd931f188d23cb.png/w_876 876w\"></figure>", "parentCommentId": "rvYLkzo6mBBwkikCD", "user": {"username": "David_Moss"}}, {"_id": "dwKeDccDPyJFfZzce", "postedAt": "2022-06-16T19:33:14.507Z", "postId": "Ei2uYbn2zrzmBjEsp", "htmlBody": "<p>This makes sense and seems pretty plausible. Can speak to personal experience of the intensity of the sun in Australia!</p>", "parentCommentId": "uBzjJBD4rdJq9Goxi", "user": {"username": "ben3536"}}, {"_id": "duQvKJuQRSbFsdget", "postedAt": "2022-06-16T19:44:25.303Z", "postId": "Ei2uYbn2zrzmBjEsp", "htmlBody": "<p>Thanks for flagging this. It does seem from this that I've oversold the potential value quite significantly! I'll add a note to the section to flag this comment and that this doesn't appear to be as helpful as hoped.</p>", "parentCommentId": "teAwXCPvuEweqbvss", "user": {"username": "ben3536"}}, {"_id": "JMhgtFXG5ZBGiF7qF", "postedAt": "2022-06-16T20:28:57.537Z", "postId": "Ei2uYbn2zrzmBjEsp", "htmlBody": "<p>Thanks! It's a pity, because I'm a big fan of house plants, &nbsp;and the heavy blackout blinds I use prevent getting fresh air via windows at night, so this would have been convenient if true.</p>", "parentCommentId": "duQvKJuQRSbFsdget", "user": {"username": "David_Moss"}}]