[{"_id": "MAf6sefum3LLA4uJL", "postedAt": "2022-09-09T11:56:47.076Z", "postId": "EiaNkrwfQr4chu2kX", "htmlBody": "<p>Probability that this is useful =\nProb(that you can domesticate these zebras) *\nProb(that a disaster happens that knocks out humanity's ability to make mechanised vehicles while this set of zebras exists) *\nProb(that that disaster doesn't also kill these zebras) *\nProb(that the humans find and figure out how to use the zebras) *\nProb(that these zebras meaningfully increase industrial progress)</p>\n<p>Upvote for creativity</p>\n", "parentCommentId": null, "user": {"username": "Henry Howard"}}, {"_id": "YBDdCQtTEdyEm9MNY", "postedAt": "2022-09-09T13:50:22.629Z", "postId": "EiaNkrwfQr4chu2kX", "htmlBody": "<p>Thank you for your comment.&nbsp;</p><p>My way of looking at it is a little different. I've put comments in square brackets next to your points below.&nbsp;</p><p>Prob(that you can domesticate these zebras) [Agreed. I think this is a high probability.]</p><p>* Prob(that a disaster happens that knocks out humanity's ability to make mechanised vehicles while this set of zebras exists) &nbsp;[Not quite. Perhaps we have mechanised vehicles but they are prohibitively expensive to run. Or we have other calls on our metal resources, e.g. they are needed to deal with some threat from space. Zebras are useful when mechanised transport is not available for any reason. ]</p><p>* Prob(that that disaster doesn't also kill these zebras) [I agree the zebras have to survive, but if we are thinking of some loss of industrial capacity then there is little reason to think that zebras would be at risk. Or we can imagine some catastrophe that harms life in the heavily industrialised areas of the world in which horses mostly live: having domesticated zebras would then be big a bonus for humanity. Or imagine a disease that kills horses: again, domesticated zebras would be a bonus.]</p><p>* Prob(that the humans find and figure out how to use the zebras) [I am envisaging that people live with these zebras in Africa in the same way they live with horses in Europe and North America. The knowledge of how to tame, train, ride, feed and breed horses is pretty widespread. We would have the same for zebras.]&nbsp;</p><p>* Prob(that these zebras meaningfully increase industrial progress). [No. The point is that they would be used for transport (and other horse use-cases) in the same way that horses were prior to industrialisation. That is a good in itself irrespective of whether it aids industrial progress. Of course transport aids trade and the exchange of ideas so it is likely to help, but I don't put much weight on that.]</p><p>The essential point is simply that humankind has found value in having domesticated horses for thousands of years, and the potential of bringing that value to sub-Saharan Africa can be bought at modest cost.&nbsp;</p>", "parentCommentId": "MAf6sefum3LLA4uJL", "user": {"username": "Further or Alternatively"}}, {"_id": "aAZGMpgduwKGvhXJk", "postedAt": "2022-09-09T15:32:24.777Z", "postId": "EiaNkrwfQr4chu2kX", "htmlBody": "<p>I am not convinced by this particular proposal, but there is a creativity &amp; genius to it that makes me want to see a list with 100 such ideas.</p>", "parentCommentId": null, "user": {"username": "NunoSempere"}}, {"_id": "u8sHo6xfD6Dgbb26v", "postedAt": "2022-09-09T16:18:17.340Z", "postId": "EiaNkrwfQr4chu2kX", "htmlBody": "<p>Thank you. I'm happy to be expanding the universe of ideas for people to work on, and perhaps stimulating some new thoughts too.</p><p>Out of interest, what is your objection to the proposal? I think of it as similar to having seedbanks: of course we hope they will never be needed, but if they are needed then people will be very glad we put the work in, and it's not a high cost project.</p>", "parentCommentId": "aAZGMpgduwKGvhXJk", "user": {"username": "Further or Alternatively"}}, {"_id": "qP8niXrYWsyPS9SKL", "postedAt": "2022-09-09T17:01:25.983Z", "postId": "EiaNkrwfQr4chu2kX", "htmlBody": "<p>&gt;100 such ideas</p><p>here's another with the same vibes</p><p>https://forum.effectivealtruism.org/posts/3caZ7LhMsvsS7kRrz/hobbit-manifesto</p>", "parentCommentId": "aAZGMpgduwKGvhXJk", "user": {"username": "Tyner"}}, {"_id": "awvDgYwiN3MaQmoGh", "postedAt": "2022-09-09T17:46:44.945Z", "postId": "EiaNkrwfQr4chu2kX", "htmlBody": "<p>Expanding our exploitation of animals is a moral step backward. &nbsp;This does not seem like the kind of project EA people or organizations should be supporting.</p>", "parentCommentId": null, "user": {"username": "Tyner"}}, {"_id": "DG4qbTa9om6yYAtTn", "postedAt": "2022-09-09T18:48:24.682Z", "postId": "EiaNkrwfQr4chu2kX", "htmlBody": "<p>Domestication isn't the same as exploitation, as wild animal welfare advocates will attest to. Dogs and cats and horses probably live better lives than all other animals.</p>\n", "parentCommentId": "awvDgYwiN3MaQmoGh", "user": {"username": "therealslimkt"}}, {"_id": "as5TeiLTm9oDdwsLd", "postedAt": "2022-09-09T19:06:00.657Z", "postId": "EiaNkrwfQr4chu2kX", "htmlBody": "<p>Why zebras rather than donkeys, which are native to Africa and whose population is increasing there? https://thehorse.com/features/beasts-of-burden-africas-working-horses-and-donkeys/</p>", "parentCommentId": null, "user": {"username": "Julia_Wise"}}, {"_id": "ZpYGoqfGxXRsNFp5u", "postedAt": "2022-09-09T19:06:42.677Z", "postId": "EiaNkrwfQr4chu2kX", "htmlBody": "<p>I think this is a good point in itself to distinguish domestication from exploitation (and I upvoted it for this), but I think it doesn't necessarily address what the comment about exploitation is pointing at.</p>\n<p>I believe that the argument is that any use of animals in an efficient way will lead to industrialization of breeding, farming, etc. and it's hard then to align incentives to make the results net positive for both humans and other species. At least I believe we have an extremely poor track record here.</p>\n", "parentCommentId": "DG4qbTa9om6yYAtTn", "user": {"username": "Jakub Stencel"}}, {"_id": "JCxMSfKEnWvHk8tpw", "postedAt": "2022-09-09T19:21:48.038Z", "postId": "EiaNkrwfQr4chu2kX", "htmlBody": "<p>That's fair but I don't think horses pre-1900 were treated in terrible ways. In particular the incentives for treating farm animals are VERY different from the incentives for treating service animals, whose usefulness depends on their continued health and quality of life.</p>\n", "parentCommentId": "ZpYGoqfGxXRsNFp5u", "user": {"username": "therealslimkt"}}, {"_id": "SB37QJoKZbbSzXW9v", "postedAt": "2022-09-09T19:30:47.612Z", "postId": "EiaNkrwfQr4chu2kX", "htmlBody": "<p>Setting aside the ethics of animal exploitation for a second</p>\n<p>Africa already has Sanga cattle, that are resistant to trypanosomiasis and have been used in subsaharan Africa for thousands of years.</p>\n<p>What benefit would zebras have over Sanga cattle?</p>\n<p>If it’s just speed ( with cattle being stronger and more useful for most manual labor) , does that really increase efficiency in production, or does it just make them more useful for warfare?</p>\n", "parentCommentId": null, "user": {"username": "Vgvt"}}, {"_id": "GnhALBsb8rknEDtW5", "postedAt": "2022-09-09T20:45:12.707Z", "postId": "EiaNkrwfQr4chu2kX", "htmlBody": "<p>Good question. Couple of thoughts:</p><p>(1) Donkeys are already domesticated. More species that can be used = more options.</p><p>(2) The donkey was available in the 19/20th centuries and yet people aimed to domesticate zebras then. Various reasons, I suspect: disease resistance, speed, perhaps strength. There have been roles for both donkeys and horses in places that have both.</p>", "parentCommentId": "as5TeiLTm9oDdwsLd", "user": {"username": "Further or Alternatively"}}, {"_id": "gwe98DJQhaMmw3YSE", "postedAt": "2022-09-09T21:19:52.925Z", "postId": "EiaNkrwfQr4chu2kX", "htmlBody": "<p>I don't think you can ride cattle.</p><p>Also, speed is an advantage in all kinds of communication/communication. E.g. bringing doctors to the scene of an emergency, transporting items with short shelf lives.&nbsp;</p>", "parentCommentId": "SB37QJoKZbbSzXW9v", "user": {"username": "Further or Alternatively"}}, {"_id": "J27naeHnP8FuDYGwS", "postedAt": "2022-09-09T21:22:34.518Z", "postId": "EiaNkrwfQr4chu2kX", "htmlBody": "<p>Some were treated well, some badly pre-1900. But in the near future domesticated zebras would be essentially pets, as horses are today, and would have great lives . They are not needed for work now - we have mechanised transport - but they might be needed in the future.</p>", "parentCommentId": "JCxMSfKEnWvHk8tpw", "user": {"username": "Further or Alternatively"}}, {"_id": "SFTJTbxbzw2RvpRcq", "postedAt": "2022-09-10T00:28:14.696Z", "postId": "EiaNkrwfQr4chu2kX", "htmlBody": "<p>I would consider being sacrificed to gods, being eaten* , and fighting mens wars for them terrible treatment.</p>\n<ul>\n<li>even after Christians stopped eating horses, It’s not like they were allowed to live a long retirement  ones useless</li>\n</ul>\n", "parentCommentId": "JCxMSfKEnWvHk8tpw", "user": {"username": "Vgvt"}}, {"_id": "zkMdo2XcHSw77x5i9", "postedAt": "2022-09-10T01:01:00.011Z", "postId": "EiaNkrwfQr4chu2kX", "htmlBody": "<p><a href=\"https://www.humanesociety.org/resources/what-soring\">https://www.humanesociety.org/resources/what-soring</a></p>\n<p><a href=\"https://animalsaustralia.org/our-work/horse-racing/background/\">https://animalsaustralia.org/our-work/horse-racing/background/</a></p>\n<p><a href=\"https://awionline.org/content/urban-carriage-horses-out-step-responsible-horse-welfare\">https://awionline.org/content/urban-carriage-horses-out-step-responsible-horse-welfare</a></p>\n<p><a href=\"https://www.humanedecisions.com/premarin-horses-the-suffering-of-premarin-mares/\">https://www.humanedecisions.com/premarin-horses-the-suffering-of-premarin-mares/</a></p>\n<p><a href=\"https://www.aspca.org/improving-laws-animals/public-policy/horse-slaughter\">https://www.aspca.org/improving-laws-animals/public-policy/horse-slaughter</a></p>\n<p><a href=\"https://www.humanesociety.org/resources/facts-about-horse-slaughter\">https://www.humanesociety.org/resources/facts-about-horse-slaughter</a></p>\n<p><a href=\"https://www.horsetalk.co.nz/2013/03/11/horses-forgotten-victims-of-bullfighting/\">https://www.horsetalk.co.nz/2013/03/11/horses-forgotten-victims-of-bullfighting/</a></p>\n<p>This is all from wealthy countries</p>\n<p>Even in wealthy countries it’s not easy to be a horse, the fact that they, like all domestic animals are legally commodities, mean there interests will not be respected</p>\n<p>This is not to mention the ubiquity of spinal alteration in seemingly well cared for horses, or how nearly all horses are ridden before There growth plates fuse</p>\n<p><a href=\"https://www.writingofriding.com/wp-content/uploads/2014/02/deb-bennett-maturation.pdf\">https://www.writingofriding.com/wp-content/uploads/2014/02/deb-bennett-maturation.pdf</a></p>\n<p><a href=\"https://www.pferdeheilkunde.de/10.21836/PEM20070506\">https://www.pferdeheilkunde.de/10.21836/PEM20070506</a></p>\n<p>Or the congenital defects , intentional or not, caused by purposefully breeding to maintain breed characteristics</p>\n<p>I honestly imagine these  zebras being used as beasts of burden in poor countries would tbe treated even worse.</p>\n", "parentCommentId": "J27naeHnP8FuDYGwS", "user": {"username": "Vgvt"}}, {"_id": "WvmBgZd9KiEMEPfxT", "postedAt": "2022-09-10T08:45:05.921Z", "postId": "EiaNkrwfQr4chu2kX", "htmlBody": "<p>The comparison is between wild animals and animals in captivity. There is reason to think that the latter have better lives overall (the ready supplies of food and protection from predators provided by humans being obvious examples).&nbsp;</p>", "parentCommentId": "zkMdo2XcHSw77x5i9", "user": {"username": "Further or Alternatively"}}, {"_id": "5aWtNCoALNjEGEQeQ", "postedAt": "2022-09-10T09:07:27.195Z", "postId": "EiaNkrwfQr4chu2kX", "htmlBody": "<blockquote><p>Out of interest, what is your objection to the proposal?</p></blockquote><p>It is oddly specific. If I was looking at helping people after civilizational collapse, I may end up at something like ALLFED. If I was looking at helping people after global catastrophes in specific regions, I might look at which specific regions are easier to help. If I was looking at helping people after catastrophes in Sub-Saharan Africa, I would look at which catastrophes are more likely to happen there (famines?). And if I was looking at ways to help Sub-Saharan Africa after civilizational collapse, I would make a list and then choose the best one, rather than go to this proposal directly.</p>", "parentCommentId": "u8sHo6xfD6Dgbb26v", "user": {"username": "NunoSempere"}}, {"_id": "PgyjbHqu8f73CnRq8", "postedAt": "2022-09-10T19:37:08.880Z", "postId": "EiaNkrwfQr4chu2kX", "htmlBody": "<p>Mine is much less radical than that one! But have you seen the film Downsizing? Highly recommend it. Intelligent (and entertaining) exploration of these issues. I reviewed it here: <a href=\"http://furtheroralternatively.blogspot.com/2018/05/four-film-reviews.html\">http://furtheroralternatively.blogspot.com/2018/05/four-film-reviews.html</a> .</p>", "parentCommentId": "qP8niXrYWsyPS9SKL", "user": {"username": "Further or Alternatively"}}, {"_id": "cEM9R29CezEAizvsL", "postedAt": "2022-09-11T15:53:40.645Z", "postId": "EiaNkrwfQr4chu2kX", "htmlBody": "<p>I see that point. My take is that it is a low-hanging fruit (it's a fun kind of project that may attract many people who would be put off by something more like a new vaccine) that is likely overlooked because of the reputation that zebras have in the West. But one of my hopes in putting this forward is that someone might take it and run with it, perhaps adding it to something your list of best policies for Sub-Saharan Africa.&nbsp;</p>", "parentCommentId": "5aWtNCoALNjEGEQeQ", "user": {"username": "Further or Alternatively"}}]