[{"_id": "kpnNKpAM7Kz7GbzRH", "postedAt": "2022-11-27T06:15:31.451Z", "postId": "EjaBuGDZqcQNxapKH", "htmlBody": "<p>I'd like to see someone in the EA community do some work related to preventing bullying, which seems likely to be one the most intense forms of suffering for children.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Lucas Lewit-Mendes"}}, {"_id": "znmYwjatwA52D7rwH", "postedAt": "2022-11-27T08:59:33.414Z", "postId": "EjaBuGDZqcQNxapKH", "htmlBody": "<p>Why do you think that advocating for children in developed countries is more effective than advocating for children in poor countries? You don't make this claim explicitly, but \"developed countries\" is in the title and you talk a lot about USA, and I assume you have thought about or researched the issue in other countries.</p>\n<p>My (perhaps naive) view is that children in most poor countries have it much more difficult than in the US.</p>\n", "parentCommentId": null, "user": {"username": "harfe"}}, {"_id": "KMCX3GHuyEsJtZ25B", "postedAt": "2022-11-27T20:02:58.749Z", "postId": "EjaBuGDZqcQNxapKH", "htmlBody": "<p>I agree with this comment. &nbsp;While less than <a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5766273/\">0.5%</a> of American students face corporal punishment at school, some <a href=\"https://www.who.int/news-room/fact-sheets/detail/corporal-punishment-and-health#:~:text=Studies%20have%20shown%20that%20lifetime,Africa%20and%20South%2DEast%20Asia.\">70%</a> of African students do. &nbsp;<a href=\"https://www.businessdailyafrica.com/bd/economy/world-bank-ombudsman-probes-death-of-bridge-academies-pupil-2293780\">In school deaths</a> are not incredibly uncommon.&nbsp;</p><p><a href=\"https://twitter.com/susannahhares/status/1596112563590373377?s=20&amp;t=yBkDTo-mdfv-8u1dtqcGnQ\">26% of Zambian girls</a> have been sexually abused in the last year. &nbsp;About <a href=\"https://twitter.com/susannahhares/status/1592876901248380928?s=20&amp;t=yBkDTo-mdfv-8u1dtqcGnQ\">10%</a> of Zambian boys <i>and</i> girls report having been sexually harassed at school within the last month.</p>", "parentCommentId": "znmYwjatwA52D7rwH", "user": {"username": "Lauren Gilbert"}}, {"_id": "dDb5hu5bCZtk3jS2G", "postedAt": "2022-11-27T22:59:29.778Z", "postId": "EjaBuGDZqcQNxapKH", "htmlBody": "<p>Brilliant Harfe and Laura. Here in Uganda many primary students are beaten badly, while in high schools there's a common system, which is borderline torture, where many students only get 4-6 hours sleep a night. &nbsp;My wife works in advocacy and has considered trying to tackle this - I'm not sure where this might fit on the effectiveness scale, but potentially reducing suffering in millions of kids could be a pretty good intervention.<br><br>Like you both I struggle to see a scenario where this would be more effective in Richer countries than places like here in Uganda.</p>", "parentCommentId": "KMCX3GHuyEsJtZ25B", "user": {"username": "NickLaing"}}, {"_id": "tyqEeqm2uGeH6a7XM", "postedAt": "2022-11-27T23:54:34.647Z", "postId": "EjaBuGDZqcQNxapKH", "htmlBody": "<blockquote><p>about <a href=\"https://en.wikipedia.org/wiki/Sexual_harassment_in_education_in_the_United_States#Statistics\">four times</a> the rate in the US</p></blockquote><p>I looked at your link and didn't see evidence of this? Instead, Wikipedia (your link) says:</p><blockquote><p>In their 2000 survey on 2064 students in 8th through 11th grade, the American Association of University Women (AAUW) reported:<a href=\"https://en.wikipedia.org/wiki/Sexual_harassment_in_education_in_the_United_States#cite_note-:1-6\"><sup>[6]</sup></a></p><ul><li>81% or eight out of 10 students experience sexual harassment in school</li><li>83% of girls have been sexually harassed</li><li>78% of boys have been sexually harassed</li><li>38% of the students were harassed by teachers or school employees</li><li>36% of school employees or teachers were harassed by students</li><li>42% of school employees or teachers had been harassed by each other</li></ul></blockquote><p>Also, your source for</p><blockquote><p><br><a href=\"https://twitter.com/susannahhares/status/1596112563590373377?s=20&amp;t=yBkDTo-mdfv-8u1dtqcGnQ\">26% of Zambian girls</a> have been sexually abused at school in the last year</p></blockquote><p>is a <a href=\"https://twitter.com/susannahhares/status/1596112563590373377/photo/1\">Tweet</a> that says 26.4% of Zambian girls have been sexually abused at all, and 1.9% in school (the US comparatively has 15.2% at all, and 0% in school).</p><p>These number all sound very high to me. And my initial prior is very much that the situation is worse on average in developing countries than the US. But I don't think the evidence presented so far is conclusive here.&nbsp;</p>", "parentCommentId": "KMCX3GHuyEsJtZ25B", "user": {"username": "Linch"}}, {"_id": "xC5noQJoWeHsd6wP8", "postedAt": "2022-11-28T00:19:37.927Z", "postId": "EjaBuGDZqcQNxapKH", "htmlBody": "<p>You're right; I misread Susannah's tweet (and read the \"ever\" bar as \"in school\").</p><p>Re. the Wikipedia article: those are ever harassed numbers; the Zambia number is within the last year. &nbsp;Assuming that sexual harassment is spread across all grades (K-12), \"within the last year\" (81/12) would be ~7% (which is how I got a quarter of the 26% I quote, though you're right that I was misreading the tweet). &nbsp;Upon further thought, dividing by 12 is a little aggressive, since sexual harassment is more likely in last six years of that (grades 6-12), so say, 15% risk per year.</p><p>Lee and Susannah have a <a href=\"https://www.cgdev.org/blog/theres-global-school-sexual-violence-crisis-and-we-dont-know-enough-about-it\">longer blog post</a> in which they examine sexual violence in schools, and find somewhat higher rates of sexual violence in developing countries than developed.</p><p>Qualitatively, my impression is that what counts as \"the kind of violence you'd remember and report in surveys\" is a significantly lower bar in the US than in SSA. &nbsp;(I once tried to report being harassed in Uganda, and got completely blank looks like \"this is normal, why are you are complaining\".). But I don't have data to hand to back that up beyond my own experience.</p><p>(Edited to add: I edited my comment above to be correct.)</p>", "parentCommentId": "tyqEeqm2uGeH6a7XM", "user": {"username": "Lauren Gilbert"}}, {"_id": "k8bmw8ahB5mZ9uY7R", "postedAt": "2022-11-28T04:37:07.430Z", "postId": "EjaBuGDZqcQNxapKH", "htmlBody": "<p>I agree that reducing childhood trauma in the USA looks quite tractable, and that it's not as neglected as other issues. Examples of things which are happening:<br><br>1. There's already work being done to understand, prevent, and overcome Adverse Childhood <a href=\"https://www.cdc.gov/vitalsigns/aces/index.html\">Experiences</a> (notably in California, under Surgeon General <a href=\"https://www.ted.com/talks/nadine_burke_harris_how_childhood_trauma_affects_health_across_a_lifetime?language=en\">Nadine Burke Harris</a>). ACEs are dose-dependent, with people who report more childhood trauma having worse health outcomes, including a higher risk of <a href=\"https://www.nih.gov/news-events/news-releases/risk-premature-death-adulthood-influenced-patterns-early-childhood-adversity\">early death</a>.&nbsp;<br><br>2. the intactivist movement appears to be making progress over the last decade on <a href=\"https://intactamerica.org/our-strategy/\">shifting public opinion</a> toward opposing childhood genital cutting.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Cienna"}}, {"_id": "uYHngK2a33p2xRsco", "postedAt": "2022-11-28T04:53:32.137Z", "postId": "EjaBuGDZqcQNxapKH", "htmlBody": "<p>(Writing in cluelessness from the USA) I accept the argument for importance, and notice myself defaulting to considering the problem intractable because I don't know how tractable it is to meaningfully improve school safety in Uganda. Will you please share more about how hard it might be, and what it would take, to make this better?&nbsp;</p>", "parentCommentId": "dDb5hu5bCZtk3jS2G", "user": {"username": "Cienna"}}, {"_id": "yeefx8R3WMZY4zRm9", "postedAt": "2022-11-28T04:55:01.619Z", "postId": "EjaBuGDZqcQNxapKH", "htmlBody": "<p>Meta: looks like this is Skye's first post on the EA Forum. Welcome, Skye! Thanks for your courage in posting this!&nbsp;</p>", "parentCommentId": null, "user": {"username": "Cienna"}}, {"_id": "NKYspedBH87pjfnAF", "postedAt": "2022-11-28T07:00:18.382Z", "postId": "EjaBuGDZqcQNxapKH", "htmlBody": "<blockquote><p>Re. the Wikipedia article: those are ever harassed numbers; the Zambia number is within the last year. &nbsp;Assuming that sexual harassment is spread across all grades (K-12), \"within the last year\" (81/12) would be ~7% (which is how I got a quarter of the 26% I quote, though you're right that I was misreading the tweet). &nbsp;Upon further thought, dividing by 12 is a little aggressive, since sexual harassment is more likely in last six years of that (grades 6-12), so say, 15% risk per year.</p></blockquote><p>Interesting. I think I disagree with this renewed assessment, as:<br><br>1. We shouldn't assume that \"reported sexual harassment in school\" is the same thing as \"have ever been sexually harassed exactly once in school.\" If anything there should be a presumption that this have happened to many people significantly more than once.&nbsp;</p><p>2. The survey is of \"2064 students in 8th through 11th grade,\" so of course many surveyed students literally were not around for the full span of grades 6-12.</p><blockquote><p>&nbsp;Qualitatively, my impression is that what counts as \"the kind of violence you'd remember and report in surveys\" is a significantly lower bar in the US than in SSA. &nbsp;(I once tried to report being harassed in Uganda, and got completely blank looks like \"this is normal, why are you are complaining\".). But I don't have data to hand to back that up beyond my own experience.</p></blockquote><p>I do agree that reporting bias differences are pretty likely. And I'm sorry to hear that you've been harassed in Uganda.</p>", "parentCommentId": "xC5noQJoWeHsd6wP8", "user": {"username": "Linch"}}, {"_id": "koiiJSpWNwJf9ZoLv", "postedAt": "2022-11-28T12:56:52.566Z", "postId": "EjaBuGDZqcQNxapKH", "htmlBody": "<p>Thanks Cienna! I'm sure you are far from clueless :)</p><p>Like with any large scale policy issue, tractability is a big issue - but in this kind of case I have a couple of vaguely similar examples which show that it could well be tractable. &nbsp;I'm an enormous fan of advocacy and actvism as one of the most cost effective ways to solve specific, clear problems, perhaps even a bigger fan than most effective altruists as I've seen my wife succeed spectacularly a couple of times at least.</p><p>My wife worked on something 5 years ago which has some similarity in that it was a policy that was changed, having a big positve effect. Her and a community group from scratch managed to get a local district level law passed to effectively ban alcohol \"sachets\", tiny &nbsp;50ml plastic bags of heavy spirits of varying qualities. 2 years later later this was followed up with a nation al ban. This was based on both strong community will to ban the sachets as they could see the enormous harm caused by them, and a large amount of research that shows if you increase the quantity of the minimum size unit of alcohol (e.g. from 50 to 150ml like what happened here) , you hugely lower the damage done by alcohol.<br><br>Also the banning of lead paint thing in Malawi has some similarities in that it's a harmful policy being overturned through government advocacy, and that seems to be going pretty well.<br><a href=\"https://forum.effectivealtruism.org/posts/ErKzbKWnQMwvzRX4m/seven-things-that-surprised-us-in-our-first-year-working-in\">https://forum.effectivealtruism.org/posts/ErKzbKWnQMwvzRX4m/seven-things-that-surprised-us-in-our-first-year-working-in</a><br><br>What it would take (for example the high school sleep issue) specifically is advocacy to the ministry of education to pass a local (district wide) or national ordinance decreeing minimum sleep in a high school, then ensuring enforcement (harder than getting the law passed). The physical abuse of primary school children would be much harder as it is culturally ingrained - it's such a well known and horrible issue there are in fact a number of BINGOS (big international NGOs like world vision etc.) doing a terrible job already trying to fix that problem mainly through education (posters, trainings, etc.). High level advocacy would be far better.<br><br>The thing is you could throw $30,000 or something at a specific problem such as the borderline torture of sleep deprivation in high school kids and probably have something like a 1 in 10 chance &nbsp;of success(with astronomical uncertainly and probably better odds if it's someone like my wife working on it!) . I'm not going to do the math but it might well be a relatively cost-effective campaign.<br><br>Wow I just wrote an essay oh dear...</p>", "parentCommentId": "uYHngK2a33p2xRsco", "user": {"username": "NickLaing"}}, {"_id": "cLPtAi49x2cG3BABX", "postedAt": "2022-11-28T13:00:50.374Z", "postId": "EjaBuGDZqcQNxapKH", "htmlBody": "<p>To echo this, I'm grateful to Skye for raising the topic here and providing an opening for the discussion between harfe, Lauren, and Linch. &nbsp;I hope that Skye wasn't dissuaded by the criticism, because I think there is a strong case that certain aspects of children's advocacy are (currently) more tractable in developed countries. We have lots of examples of changes to the law in favour of children happening via established institutions.</p><p>Differences between regional legal systems need to be taken into account, but to provide an interesting example from the UK: <a href=\"https://www.legislation.gov.uk/ukpga/2004/31/section/58\">section 58 of the Children Act 2004</a> specifies that hitting a child can be justified by a parent or guardian as long as it is \"reasonable punishment\" and doesn't amount to \"actual bodily harm\" (long-term injury). This was revoked by the <a href=\"https://www.legislation.gov.uk/asp/2019/16\">Children Act 2019 in Scotland</a> and in <a href=\"https://www.legislation.gov.uk/anaw/2020/3\">2020 in Wales</a>, &nbsp;with each taking a couple of years to come into effect. Now children effectively have the same legal protection from assault and battery as adults in these countries, including from their parents. Any EAs based in the UK with any inclination towards national-scale advocacy &nbsp;would be well placed to push for similar changes in England and Northern Ireland.</p><p>How these acts came about might also make an interesting case study for possible replication in other places -- and to determine if these problems are \"neglected\" enough for EAs. I haven't read the history, but I suspect national charities like Barnado's and the NSPCC along with &nbsp;international organisations like UNICEF were involved to varying degrees.&nbsp;</p><p>I also agree with the broader thrust of Skye's post that children almost universally lack the legal and political framework to represent their own interests, so it is up to adults to advocate for them. Even if we can show that conditions are worse for children along most metrics in developing countries (as Lauren puts forward well), I still think &nbsp;children would be worth advocating for in developed countries for the right EAs.</p>", "parentCommentId": "yeefx8R3WMZY4zRm9", "user": {"username": "jserv"}}, {"_id": "bzibJ4w4WCerLxXqp", "postedAt": "2022-11-28T16:06:40.140Z", "postId": "EjaBuGDZqcQNxapKH", "htmlBody": "<p>Neat about the alcohol sachets!&nbsp;</p><p>I don't see how \"decreeing minimum sleep\" would work. Why aren't the high school students getting enough sleep? Are they also working jobs? Do they live far away from the schools?&nbsp;</p>", "parentCommentId": "koiiJSpWNwJf9ZoLv", "user": {"username": "Cienna"}}, {"_id": "XTEkBJ7gGiri4aCCS", "postedAt": "2022-11-28T16:24:02.877Z", "postId": "EjaBuGDZqcQNxapKH", "htmlBody": "<p>Sorry I forget &nbsp;there's a bunch of context I forget to lay out<br>&nbsp;</p><p>Maybe 80% of high schools here are boarding schools, that's what I'm talking about.&nbsp;</p><p><br>So &nbsp;most of these these boarding schools force the students to get up at 4:00am-5:00am to prepare ,and work until 10pm in the evening. It sounds crazy but the schools honestly think this torrid regime will get better results for their students. &nbsp;Of course students end up trying to steal extra sleep wherever they can, just to get by.<br><br>With 2 students we were helping with high school where I think this contributed to serious mental health problems at the school, and one ended up leaving school.</p>", "parentCommentId": "bzibJ4w4WCerLxXqp", "user": {"username": "NickLaing"}}, {"_id": "AXdfySfXhFG4uZ8dH", "postedAt": "2022-11-29T04:42:38.167Z", "postId": "EjaBuGDZqcQNxapKH", "htmlBody": "<p>Thanks! Now it makes sense how a decree would help. I imagine some additional culture shift would be needed to make sure that the kids weren't still under a lot of pressure, just less overt.&nbsp;</p>", "parentCommentId": "XTEkBJ7gGiri4aCCS", "user": {"username": "Cienna"}}, {"_id": "z6ZCWoLotgMqtcuiC", "postedAt": "2022-11-27T13:58:12.419Z", "postId": "EjaBuGDZqcQNxapKH", "htmlBody": null, "parentCommentId": null, "user": null}]