[{"_id": "XpmwYJp7GKfbfKiNL", "postedAt": "2024-02-15T12:53:23.018Z", "postId": "EJccSQwfp2gxWGBwp", "htmlBody": "<p>Great piece. The reflections on how movements look from the outside vs from the inside seemed very insightful.</p><p>I also liked this point about applied moral philosophy: \"there are many situations in which utilitarianism guides my thinking, especially as a philanthropist, but uncertainty still leaves me with many situations where it doesn’t have much to offer. In practice, I find that I live my day to day deferring to side constraints using something more like virtue ethics. Similarly, I abide by the law, rather than decide on a case by case basis whether breaking the law would lead to a better outcome. Utilitarianism offers an intellectual North Star, but deontological duties necessarily shape how we walk the path.\"</p>", "parentCommentId": null, "user": {"username": "RYC"}}, {"_id": "kdpZrnhQx7NuA8hyd", "postedAt": "2024-02-16T12:55:10.661Z", "postId": "EJccSQwfp2gxWGBwp", "htmlBody": "<p>Although I agree with pretty much all he writes, I feel like a crucial piece on the FTX case is missing: it's not only the failure of some individuals to exercise reasonable humility and abide by common sense virtues. It's also a failure by the community, its infrastructure, and processes to identify and correct this problem.</p>\n<p>(The section on SBF starts with \"When EAs Have Too Much Confidence\".)</p>\n", "parentCommentId": null, "user": {"username": "SiebeRozendal"}}, {"_id": "svMkwBgarNtKAwJCf", "postedAt": "2024-02-20T17:30:03.523Z", "postId": "EJccSQwfp2gxWGBwp", "htmlBody": "<p>I don't feel I have much to say about that tbh, though I did talk about auditing financials here <a href=\"https://forum.effectivealtruism.org/posts/eRyC6FtN7QEkDEwMD/should-we-audit-dustin-moskovitz?commentId=qEzHRDMqfR5fJngoo\">https://forum.effectivealtruism.org/posts/eRyC6FtN7QEkDEwMD/should-we-audit-dustin-moskovitz?commentId=qEzHRDMqfR5fJngoo</a><br><br>If we have another major donor with a more mysterious financial background than mine, we should totally pressure them to undergo an audit!<br><br>That said, I'm not convinced the next scandal will look anything like that, and the real problem to me was the lack of smoking guns. It's very hard to remove someone from power without that, as we've recently observed with sama, and continuously observe with Elon.<br><br>So the upshot is my prediction is we will again fail to identify and correct possible scandals, and I'm not sure we should beat ourselves up about it as much as we do. My post was more meant to soften the ground on that likely outcome so that we don't see it as a fatally damning tragedy when it happens, for EA or any other movement.</p>", "parentCommentId": "kdpZrnhQx7NuA8hyd", "user": {"username": "Dustin Moskovitz"}}, {"_id": "RYi52KnobtYN2AHxC", "postedAt": "2024-02-20T17:30:53.345Z", "postId": "EJccSQwfp2gxWGBwp", "htmlBody": null, "parentCommentId": "svMkwBgarNtKAwJCf", "user": null}]