[{"_id": "fmLnFamjHEcCGqqne", "postedAt": "2022-10-21T19:13:37.854Z", "postId": "EK3LoxzHXywZprRnu", "htmlBody": "<blockquote><p>[my intuition is] taking into account at most two out of the whole space of considerations</p></blockquote><p>&nbsp;</p><p>Well, there's a difference between:</p><ul><li><strong>sorting:</strong> prioritizing two out of a larger number of considerations.</li><li><strong>filtering:</strong> only considering two out of a larger number of considerations.</li></ul><p>Humans use cognitive aids (visuals, charts, summaries, recordings) to help them with stuff like:</p><ul><li><strong>memory:</strong> of lists/hierarchies</li><li><strong>calculations:</strong> of numbers</li><li><strong>representations:</strong> &nbsp;of data or information</li></ul><p>That kind of information feeds into filtering and sorting processes and can alter their results.</p><p>Otherwise, <i><strong>beliefs filter and priorities sort</strong></i>.</p><p>Cognitive aids boost your decision-making but only because otherwise we'd rely on:</p><ul><li><strong>faulty memory</strong></li><li><strong>incorrect or absent calculations</strong></li><li><strong>inadequate representations</strong></li></ul><p>The bottom line on explicit reasoning is that, even when done correctly, it can suffer from <i><strong>missing premises</strong></i>. Whatever the reason that the premises are missing, the conclusions are altered no matter what information would be helpful input to the conclusion. &nbsp;Cognitive aids and a knowledgebase can help with that problem.</p><p><i>I believe that in most circumstances internal feelings should have a general correspondence to the information we receive about the state of the world and oneself in it, but we are <strong>cognitively flexible</strong> and have <strong>fallible defaults</strong>.</i></p><p>What you see, hear, or feel internally might reinforce a single conclusion or conflict with it or &nbsp;conflict with each other (for example, when what you tell yourself to do is not what you feel like doing and you don't know what to conclude). &nbsp;</p><p>Marketers use <strong>mental associations</strong> and <strong>different sensory representations</strong> to convey or prioritize conflicting information. They take advantage of our fallible defaults.&nbsp;</p><p>You have probably noticed that in pharma drug commercials:</p><ul><li><strong>verbal information:</strong> a narrator (usually with cheery or flat intonation) comfortably rattles off how some lousy drug could kill you or make a limb fall off &nbsp;in between a discussion of the drug benefits and a suggestion to ask your doctor about it</li><li><strong>visual information: </strong>the visuals show you a person suffering some ailment but then getting the drug and suddenly their life changing to one involving slow-motion &nbsp;smiling, socializing, dating, or walking their dog or playing with their grandkids</li></ul><p>You don't see any visuals of a person dying from using the drug or losing a limb from it. Supplying that would lead your feelings away from the commercial's goals.</p><p>You know how choice of sensory system changes your perception of the information.</p><p>&nbsp;Most people claim that commercials don't work on them. But they do.&nbsp;</p><p>You can be betrayed by (among other things):</p><ul><li>&nbsp;<strong>gut instincts</strong></li><li><strong>mental associations</strong></li><li><strong>distracted attention</strong></li><li><strong>fallible default cognitive processing</strong></li></ul><p>Obviously, just trusting your gut might not always be the best thing, but sometimes doing so does just what you think, &nbsp;it provides information that is not already available in your explicit reasoning.</p><p>I favor use of cognitive aids to compensate for memory, calculation, or representation problems, but they don't always &nbsp;help with internal conflicts or motivated reasoning<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnref2px2zcjxyfr\"><sup><a href=\"#fn2px2zcjxyfr\">[1]</a></sup></span>. An assistant can help lead you through a thought process that, when you are faced with fatigue, becomes too difficult to do alone. That last idea is a gem, actually, but people don't do it much.</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fn2px2zcjxyfr\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnref2px2zcjxyfr\">^</a></strong></sup></span><div class=\"footnote-content\"><p>I like Julia Galef's work in that area, an entire book devoted to the problem of motivated reasoning shows a good awareness of a major problem.</p></div></li></ol>", "parentCommentId": null, "user": {"username": "Noah Scales"}}]