[{"_id": "Sz2GD8nePXLARTX4A", "postedAt": "2018-08-09T04:32:59.945Z", "postId": "EKBt7uvYug7haDAfu", "htmlBody": "<blockquote>\n<p>Two significant limitations are high rates of respondent attrition and the likely influence of social desirability bias and/or demand effects, as it was likely clear (post-workshop) which were the desired responses. </p>\n</blockquote>\n<p>It seems to me one indication of social desirability bias and/or selective attrition is that there is a nearly half point shift in the average response to &quot;I currently eat less meat than I used to for ethical reasons.&quot; On the other hand, it's possible students interpreted it as &quot;I currently plan on eating less meat than I used to for ethical reasons.&quot;</p>\n", "parentCommentId": null, "user": {"username": "RandomEA"}}, {"_id": "FoAjytHXSA3qAMhpH", "postedAt": "2018-08-09T04:35:15.284Z", "postId": "EKBt7uvYug7haDAfu", "htmlBody": "<p>Do you think the general knowledge of EA that a typical EA has is sufficient to run a SHIC workshop? It seems to me that having local groups and university groups give EA lectures at high schools on career day is potentially both high impact and a way for those groups to do direct work. </p>\n", "parentCommentId": null, "user": {"username": "RandomEA"}}, {"_id": "z95h6J93ntvTGAEDb", "postedAt": "2018-08-09T09:50:08.076Z", "postId": "EKBt7uvYug7haDAfu", "htmlBody": "<p>Have you tried / considered tracking career plan changes, and if so, do you have any tentative results you could share? (If not, what's your reasoning for not focusing on this more?)</p>\n", "parentCommentId": null, "user": {"username": "Jonas Vollmer"}}, {"_id": "irh8cKaeBZQxsiCut", "postedAt": "2018-08-09T12:46:23.072Z", "postId": "EKBt7uvYug7haDAfu", "htmlBody": "<p>As a former teacher, I'd suggest that better-than-average presentation skills would also be essential for volunteers. But I'm also curious to hear the response to this question. </p>\n", "parentCommentId": "FoAjytHXSA3qAMhpH", "user": {"username": "Khorton"}}, {"_id": "jG3EyNm7cdoKCktny", "postedAt": "2018-08-09T13:37:56.242Z", "postId": "EKBt7uvYug7haDAfu", "htmlBody": "<p>We experimented with this model in the early days of SHIC and didn't have much success, but it may have been partly because we didn't have the bandwidth to adequately prepare and support the university students who had volunteered. We are considering a second attempt with  a stronger training/support system in place. Some of the limitations we suspect are:</p>\n<ul>\n<li><p>As <strong>@Khorton</strong> mentioned, we place a lot of value on good presentation skills in order to engage the students. Thus we prefer instructors to have some background in teaching or public speaking.</p>\n</li>\n<li><p>Better-than-average knowledge of the relevant topics may also be a key component, as participant questions can be fairly complex. We have been slowly compiling a list of FAQs that future instructors can use in training.</p>\n</li>\n<li><p>As a substantial amount of time and effort goes in to training an instructor, it may only be cost-effective if that instructor is able to commit to running a fair number of workshops. Many university students/local group members are unable to make that commitment.</p>\n</li>\n</ul>\n<p>We believe that these limitations are potentially surmountable, but haven't made any plans as of yet to test this model further.</p>\n", "parentCommentId": "FoAjytHXSA3qAMhpH", "user": {"username": "baxterb"}}, {"_id": "EqbxfTEB59Tdn5PwW", "postedAt": "2018-08-09T13:43:56.439Z", "postId": "EKBt7uvYug7haDAfu", "htmlBody": "<p>Could you put together a handbook and/or video that could be sent to all trainees or is it critical that there be interaction between the trainer and trainee? </p>\n", "parentCommentId": "jG3EyNm7cdoKCktny", "user": {"username": "RandomEA"}}, {"_id": "pKqWtkw8m2Db8cfES", "postedAt": "2018-08-09T13:58:39.569Z", "postId": "EKBt7uvYug7haDAfu", "htmlBody": "<p>Great point, and we should have mentioned more about our intention to track things like career or career path changes as a result of the program. We don't currently have data on this because our audience are generally too young to show reliable signs of moving toward an effective career, but part of what we hope to accomplish with extended engagement (detailed in the <a href=\"http://effective-altruism.com/ea/1rq/students_for_highimpact_charity_2018_update/#plans\">Plans for Autumn 2018</a> section above) is to follow high-potential participants more closely so we can monitor changes like that.</p>\n<p>We have had several participants state their intentions of taking actions like this to make a bigger impact, but it is uncertain as to whether they will follow through.</p>\n", "parentCommentId": "z95h6J93ntvTGAEDb", "user": {"username": "baxterb"}}, {"_id": "gQsJDGDHFo9R3jtAJ", "postedAt": "2018-08-09T13:58:47.490Z", "postId": "EKBt7uvYug7haDAfu", "htmlBody": "<p>Speaking just for myself here, I think tracking career outcomes for SHIC students is important, but Canadian high schoolers in affluent areas are typically 4-7 years away from being able to start a career, so this may take awhile to track well. I also don't expect high schoolers to have meaningful and stable views on their career since it would be so early in their life.</p>\n", "parentCommentId": "z95h6J93ntvTGAEDb", "user": {"username": "Peter_Hurford"}}, {"_id": "GJ6r52Sz4JeKWt9d7", "postedAt": "2018-08-09T13:58:55.726Z", "postId": "EKBt7uvYug7haDAfu", "htmlBody": "<p>Perhaps a mentorship model could also work with a few dedicated volunteers. They could shadow and watch a presentation by a trained staff member the first time, then team teach with the staff member 2-3 times, before teaching on their own. This model would hopefully mean that minimal extra staff time is spent on training, but volunteers are still able to deliver high quality presentations. </p>\n", "parentCommentId": "EqbxfTEB59Tdn5PwW", "user": {"username": "Khorton"}}, {"_id": "DYEEzLmsqpXtzMpcN", "postedAt": "2018-08-09T13:59:26.660Z", "postId": "EKBt7uvYug7haDAfu", "htmlBody": "<p>I wonder if it is possible to add a check for this in a future survey. Maybe ask them if they intentionally conserve their water usage to save the environment? There should be no reason for that to change from pre- to post- without a change in social desirability or attrition.</p>\n", "parentCommentId": "Sz2GD8nePXLARTX4A", "user": {"username": "Peter_Hurford"}}, {"_id": "hC99EJBW73yASDdzL", "postedAt": "2018-08-09T14:01:55.770Z", "postId": "EKBt7uvYug7haDAfu", "htmlBody": "<p>Definitely true on both counts. I suspect that many answers are signalling intentions, but social desirability certainly has a role to play, as we mentioned above. This is one of the reasons we are now placing less emphasis on the future collection of quantitative survey data.</p>\n", "parentCommentId": "Sz2GD8nePXLARTX4A", "user": {"username": "baxterb"}}, {"_id": "4TojLisHJdaNcw2Pk", "postedAt": "2018-08-09T14:07:18.305Z", "postId": "EKBt7uvYug7haDAfu", "htmlBody": "<blockquote>\n<p>Could you put together a handbook and/or video that could be sent to all trainees or is it critical that there be interaction between the trainer and trainee?</p>\n</blockquote>\n<p>This would be along the lines of what we would consider doing if we explore this model further. However, I think there would still need to be a vetting process of some kind so that the we can be confident about the quality of the content and delivery.</p>\n", "parentCommentId": "EqbxfTEB59Tdn5PwW", "user": {"username": "baxterb"}}, {"_id": "PCJLvJs832owwxNrW", "postedAt": "2018-08-09T14:07:52.348Z", "postId": "EKBt7uvYug7haDAfu", "htmlBody": "<p>Great idea, thank you!</p>\n", "parentCommentId": "GJ6r52Sz4JeKWt9d7", "user": {"username": "baxterb"}}, {"_id": "wB6AE4MYrQKqkTtDd", "postedAt": "2018-08-10T02:21:56.306Z", "postId": "EKBt7uvYug7haDAfu", "htmlBody": "<p>My guess is the main problem occurs when it is very clear to students what the instructors want them to say. Since we don't talk about water usage, students may not change their answer for the water usage question, but still change their answer to the questions relating to the content (whether or not they have been impacted by the program), so there may not be a shift in the water question, but still a shift in the other questions. </p>\n<p>We did test out some different social desirability scales in the surveys, which is a common method. The preliminary analysis suggested that social desirability is a factor, but we haven't finished that analysis on the full data yet.</p>\n", "parentCommentId": "DYEEzLmsqpXtzMpcN", "user": {"username": "cafelow"}}, {"_id": "qdt52h9pGeLxHMQfz", "postedAt": "2018-08-10T15:33:34.661Z", "postId": "EKBt7uvYug7haDAfu", "htmlBody": "<p>Right, when I wrote &quot;career plan changes&quot; I mostly meant that they end up studying a subject different from their previous best guess (if they had one) at least partly for EA reasons. (Or at a different university, e.g. a top school.)</p>\n", "parentCommentId": "gQsJDGDHFo9R3jtAJ", "user": {"username": "Jonas Vollmer"}}, {"_id": "YPgW4ZaZZ5gFwzwtk", "postedAt": "2018-08-10T15:36:30.864Z", "postId": "EKBt7uvYug7haDAfu", "htmlBody": "<p>I really don't think doing your undergrad at a &quot;top school&quot; is as important in Canada as it is in the US or UK, and I'm not sure it's worth the money for a Canadian undergrad to study out of the country. </p>\n", "parentCommentId": "qdt52h9pGeLxHMQfz", "user": {"username": "Khorton"}}, {"_id": "C5sD8d4GQYzdjngu9", "postedAt": "2018-08-10T15:37:04.397Z", "postId": "EKBt7uvYug7haDAfu", "htmlBody": "<p>Thanks, makes sense! Would be great to see such data in the future, though I agree it seems hard to track.</p>\n", "parentCommentId": "pKqWtkw8m2Db8cfES", "user": {"username": "Jonas Vollmer"}}, {"_id": "kfYFMtseiB87hJmky", "postedAt": "2018-08-24T13:36:19.505Z", "postId": "EKBt7uvYug7haDAfu", "htmlBody": "<p>What do you see as a better way of gathering data going forward?</p>\n", "parentCommentId": "hC99EJBW73yASDdzL", "user": {"username": "cscanlon_duplicate0.8895599732012125"}}, {"_id": "CurMSpcZaZrqxMZc9", "postedAt": "2018-08-24T20:10:03.250Z", "postId": "EKBt7uvYug7haDAfu", "htmlBody": "<p>In the future SHIC is going to be placing more weight on our impact on the understanding and trajectory changes of the smaller number of students who progress from the primary workshops (of the kind we described in this report) onto our advanced workshops and individual coaching. Because we'll be working more closely with these students and discussing concrete actions (e.g. education and career decisions, pursuing volunteering opportunities with effective charities, and attending EA meetups and conferences), we hope to have a much more reliable insight into whether we're actually producing valuable changes in their understanding and plans.</p>\n", "parentCommentId": "kfYFMtseiB87hJmky", "user": {"username": "David_Moss"}}]