[{"_id": "3udRuLxm7BkQS2yxi", "postedAt": "2022-10-03T04:29:17.461Z", "postId": "EKfixour65Az8W48M", "htmlBody": "<blockquote>\n<p>Many of these individuals took donation pledges, several helped us organize events and raise money, attended EAGs, and some considered or are taking career pivots.</p>\n</blockquote>\n<p>Just wanna add more detail to this one.</p>\n<ul>\n<li>I’d say those that took the donation pledges, attended EAGs, and considered career pivots we’re already part of the core organizers. I’d classify them (us) as already predisposed to EA, which slightly reduces the counterfactual impact vs just laypeople being persuaded this strongly. Still mostly counterfactual, by the establishing of community and shared purpose at Meta</li>\n<li>The donations, however, were fully counterfactual imo. None of the core organizers donated to the drive since they were already going to donate and didn’t want to distort the results in measuring impact</li>\n</ul>\n", "parentCommentId": null, "user": {"username": "Yanjo"}}, {"_id": "NeKnoFm5hcBCjPT5F", "postedAt": "2022-10-03T04:49:10.321Z", "postId": "EKfixour65Az8W48M", "htmlBody": "<blockquote>\n<p>Although these seem like positive signals, 50K total is a fairly marginal increase at the scale of big tech salaries, and the increase in new group members did not lead to a noticeable uptick in engagement or attendance for future events. This also all came at the cost of a fairly large time and effort investment from our organizers and external speakers.\nI agree with the assessment that given tech salaries/average hourly rates vs total time, $50K (really $25K from new donors, who were hoping to influence the most, since us organizers could’ve just maxed the donation matching if it came to it) is a lower ROI given how many organizers put time into it.</p>\n</blockquote>\n<p>But there’s the potential greater impact that’s harder to measure:</p>\n<ul>\n<li>All of the people donation were not part of the core organizers and were likely people recently introduced to EA, and influenced enough by the ideas to donate. It’s possible this leads to future repeated donations (one person has mentioned this intention so far), and engagement with EA</li>\n<li>The increased group membership could pay off in the future, though no noticeable improvements now. Having double the eyes on all the future promotions of EA content we post might pay off in terms of increased engagement or donations. Possibly it might already have - ie the rate of newly engaged faces doesn’t seem to have changed, but maybe the return to in-person events has made our exclusively virtual events less appealing, and without give month the new-person rate would’ve gone down</li>\n</ul>\n", "parentCommentId": null, "user": {"username": "Yanjo"}}, {"_id": "HZhN4DM4PmwfxnyZE", "postedAt": "2022-10-05T14:29:26.961Z", "postId": "EKfixour65Az8W48M", "htmlBody": "<p>Definitely agreed!&nbsp;</p><p>&nbsp;</p><p>To clarify, I don't think that events are low impact - they may very well have the harder-to-measure forms of impact you're describing here!&nbsp;<br><br>Mostly I'm trying to draw a comparison to some of our activities, like our discussion group, which were lower effort to setup and had clear, measurable positive outcomes.</p>", "parentCommentId": "NeKnoFm5hcBCjPT5F", "user": {"username": "Conor McGurk"}}, {"_id": "Ym8Re2XQyyJamXd2o", "postedAt": "2022-10-05T14:33:00.221Z", "postId": "EKfixour65Az8W48M", "htmlBody": "<p>To push back a little: &nbsp;I don't think this is true for all success stories, and although this is true for some core organizers, many eventual organizers were participants in our discussion group/community events first, and then eventually became organizers (which in turn resulted in the outcomes described).&nbsp;<br><br>You're definitely correct that some of the folks though are definitively NOT counterfactual (e.g. Will, you, me) and were already taking EA taking actions without the group's influence.&nbsp;</p>", "parentCommentId": "3udRuLxm7BkQS2yxi", "user": {"username": "Conor McGurk"}}, {"_id": "Pwgsw3oiZLn9uLXu4", "postedAt": "2022-10-08T21:50:45.267Z", "postId": "EKfixour65Az8W48M", "htmlBody": "<p>These tips felt relevant to my chats with teammates at Electronic Arts who participate in social impact.</p><p>A couple of highlights resonated with me:</p><blockquote><p>Community &amp; discussion oriented activities are probably high ROI</p><p>Employees tended to be more skeptical about longtermism compared to the average EA</p></blockquote>", "parentCommentId": null, "user": {"username": "ethankennerly@gmail.com"}}]