[{"_id": "cC9qmxKMF2bS45DLR", "postedAt": "2014-12-12T17:03:42.860Z", "postId": "Ekgk5M4xTjBsSxweY", "htmlBody": "<p>A research area with a great deal of uncertainty but potentially high payoff is anti-ageing medicine. But how good is it to put more resources into?</p>\n<p>To be concrete, let's look at the problem of being able to stop a majority of the ageing processes in cells. Let's:</p>\n<ul>\n<li>Measure R(0) (current resources for the area) in $</li>\n<li>Measure B (annual benefits) in QALYs</li>\n<li>Take <em>p</em> = 0.2</li>\n</ul>\n<p>So the estimate for <em>y/z</em> should be how many times historical efforts to solve the problem we'll need before there's a 20% total chance of success.</p>\n<p>I think this is a particularly uncertain problem in various ways: our error bars on estimates are likely to be large, and the model is not a perfect fit. But it's also a good example of how we might begin with really no idea about how cost-effective we should think it is, and so produce a first number which can be helpful.</p>\n", "parentCommentId": null, "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "4Fk2zrbPYTAowchbr", "postedAt": "2014-12-12T17:19:33.599Z", "postId": "Ekgk5M4xTjBsSxweY", "htmlBody": "<p>My estimates.</p>\n<p>R(0): The <a href=\"http://en.wikipedia.org/wiki/SENS_Research_Foundation\">SENS Foundation</a> has an annual budget of around $4m, plus extra resources in the form of labour. Stem cell research has a global annual budget probably in the low billions, although it's not all directly relevant. Some basic science may be of relevance, but this is likely to be fairly tangential. Overall I will estimate $1b here, although this could be out by an order of magnitude in either direction.</p>\n<p>B: Around 100m people die every year. It's unclear exactly what the effects of success would be on this figure, but providing a quarter of them with an extra 10 years of life seems conservative but not extremely so. So I estimate 250m QALYs/year</p>\n<p>y/z: Real head-scratching time. I think 10 times historical resources wouldn't get us up to a 20% chance of success, but 10,000 times historical resources would be more than enough. I'm going to split the difference and say 300.</p>\n", "parentCommentId": "cC9qmxKMF2bS45DLR", "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "TFFrXMLwLDEHDRorX", "postedAt": "2014-12-14T08:46:23.557Z", "postId": "Ekgk5M4xTjBsSxweY", "htmlBody": "<p>Anti-aging seems like a plausible area for effective altruists to consider giving to, so thank you for raising this thought. It <a href=\"http://lesswrong.com/lw/gwg/sens_and_givewell_conversation_between_holden/\">looks like</a> GiveWell briefly looked into this area before deciding to focus its efforts elsewhere.</p>\n<p>I've seen a few videos of Aubrey de Grey speaking about how SENS could make use of $100 million per year to fund research on rejuvenation therapies, so <em>presumably</em> SENS has plenty of room for more funding. SENS's I-990 <a href=\"http://www.sens.org/about/organizational-reports\">tax forms</a> show that the organization's assets jumped by quite a lot in <a href=\"http://www.sens.org/sites/srf.org/files/reports/2012%20IRS%20Form%20990.pdf\">2012</a>, though this was <a href=\"http://en.wikipedia.org/wiki/SENS_Research_Foundation\">because of de Grey's donations during this year</a>, and though I can't find SENS's I-990 for 2013, I would naively guess that they've been able to start spending the money donated in 2012 during the last couple of years. I still think that it would be worthwhile to ask someone at SENS where the marginal donation to the foundation would go in the short term-- maybe a certain threshold of donations needs to be reached before rejuvenation research can be properly begun in the most cost-effective way.</p>\n<p>I agree with Aubrey that too much money is spent researching cures to specific diseases, relative to the amount spent researching rejuvenation and healthspan-extension technology. I've focused this response on SENS because, as a person with a decent science background, I feel like Aubrey's assertion that (paraphrased from memory) &quot;academic research is constrained in a way that rewards low expected value projects which are likely to yield results quickly over longer term, high expected value projects&quot; is broadly true, and that extra research into rejuvenation technologies is, on the margin, more valuable than extra research into possible treatments for particular diseases.</p>\n", "parentCommentId": "4Fk2zrbPYTAowchbr", "user": {"username": "Fluttershy"}}, {"_id": "rX6fbcWzTeupXybK3", "postedAt": "2014-12-14T13:25:52.731Z", "postId": "Ekgk5M4xTjBsSxweY", "htmlBody": "<p><a href=\"http://reflectivedisequilibrium.blogspot.co.uk/2014/01/upward-and-downward-biases-in-double.html\">It's been argued</a> that open borders could give a massive boost to the world economy. Let's see what happens if we try to apply this cost-effectiveness model to the problem of successfully lobbying for open borders. (Lack of inevitability means the model is not ideally suited compared to with research problems, but it still seems like a reasonable position.)</p>\n<p>We'll look at the problem of getting to a political situation which permits emigration levels of 5% of the population of poor countries. This might produce a 20% increase in the population of rich countries.</p>\n<p>Let's:</p>\n<ul>\n<li>Measure R(0) in $; remember to count any free press or similar that the cause gets.</li>\n<li>Measure B in $</li>\n<li>Take <em>p</em> = 0.3</li>\n</ul>\n", "parentCommentId": null, "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "jL8M38CTygRnccSs9", "postedAt": "2014-12-14T13:35:57.889Z", "postId": "Ekgk5M4xTjBsSxweY", "htmlBody": "<p>My estimates:</p>\n<p>R(0): I'm very unsure. It seems like it's at least in the hundreds of millions of dollars, and not higher than tens of billions of dollars. So I will guess $5 billion. I've put little research into this and this number could easily update a lot.</p>\n<p>B: Based on some of the estimates in <a href=\"http://pubs.aeaweb.org/doi/pdfplus/10.1257/jep.25.3.83\">this paper</a>, emigration of 5% might add in the region of $2.5 trillion to the world economy.</p>\n<p><em>y/z</em>: If $1,000 of resources were dedicated annually to this for each of the ~2 billion people living in the rich world, I'd be happy that there was a significant chance of success. So I'll estimate that <em>y/z</em> = 2000/5 = 400.</p>\n", "parentCommentId": "rX6fbcWzTeupXybK3", "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "PJTf6tFRTZHqTpjPR", "postedAt": "2014-12-14T13:48:04.380Z", "postId": "Ekgk5M4xTjBsSxweY", "htmlBody": "<p>Thanks, lots of useful things here. I absolutely agree with your last paragraph.</p>\n<p>I agree that looking more carefully at SENS would be the right move for a deeper investigation of the area. I think before that step it's worth having some idea of roughly how valuable the area is (which is what I was very crudely doing).</p>\n<p>I don't put too much stock in the particular numbers I produced here. They make anti-ageing look just slightly less promising than the best direct health interventions we know of (hence indeed better than a lot of medical research), but the previous time I came up with numbers for this problem -- for a conference talk -- I must have been in a more optimistic mood, because my estimate was a couple of orders of magnitude better. I wouldn't be surprised if the truth is somewhere in the middle.</p>\n<p>I would like to see more people provide estimates, even if not carefully justified, as I think we can get some wisdom of the crowds coming through, and to understand which figures are the most controversial or would benefit most from careful research.</p>\n", "parentCommentId": "TFFrXMLwLDEHDRorX", "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "SCawMb5XxZQpzYSnf", "postedAt": "2015-01-11T20:00:23.910Z", "postId": "Ekgk5M4xTjBsSxweY", "htmlBody": "<p>I really like this work.  I was originally going to mention a lack of consideration of the time value of money, but when I started reading the linked-to paper I realized it was your starting point.</p>\n<p>Have you thought much about how to use it for x-risk reduction work?  I assume that x-risks may be quite different than the examples you specified, with near-infinite values of B.</p>\n", "parentCommentId": null, "user": {"username": "oagr"}}, {"_id": "23yzrEicBZWoXYXud", "postedAt": "2015-01-12T12:07:07.088Z", "postId": "Ekgk5M4xTjBsSxweY", "htmlBody": "<p>Yes, in fact I'll be releasing an article soon which applies this framework to prioritisation of different methods for reducing existential risk.</p>\n<p>We'll need some extra tools to compare between reducing existential risk and other goods. This is something I hope to come back to.</p>\n", "parentCommentId": "SCawMb5XxZQpzYSnf", "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "BFriS579CNhFNrcnH", "postedAt": "2021-04-28T18:41:19.609Z", "postId": "Ekgk5M4xTjBsSxweY", "htmlBody": "<p>Stumbling on this today-did this article ever get published? Would be keen to read</p>\n", "parentCommentId": "23yzrEicBZWoXYXud", "user": {"username": "eca"}}, {"_id": "jJwzggQya5HpPAaMc", "postedAt": "2021-04-28T19:40:41.257Z", "postId": "Ekgk5M4xTjBsSxweY", "htmlBody": "<p>I'm not certain I remember what I was referring to here, but my best guess is that it was this article:\n<a href=\"https://forum.effectivealtruism.org/posts/HENbwrDYnTktRtNdE/report-allocating-risk-mitigation-across-time\">https://forum.effectivealtruism.org/posts/HENbwrDYnTktRtNdE/report-allocating-risk-mitigation-across-time</a></p>\n", "parentCommentId": "BFriS579CNhFNrcnH", "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "3BcpJg6EAjFdXXkKQ", "postedAt": "2021-04-28T20:51:03.729Z", "postId": "Ekgk5M4xTjBsSxweY", "htmlBody": "<p>Thanks!</p>\n", "parentCommentId": "jJwzggQya5HpPAaMc", "user": {"username": "eca"}}]