[{"_id": "APgcKqXYMXpWL3AB4", "postedAt": "2022-11-09T21:05:27.802Z", "postId": "EKN9Nn89ixriwSXpP", "htmlBody": "<p>Binance have walked away from the deal to buy FTX. Pretty much all customer funds on the site are likely lost for good.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Sabs"}}, {"_id": "oFpsuonCPhfvppbrG", "postedAt": "2022-11-09T21:24:50.117Z", "postId": "EKN9Nn89ixriwSXpP", "htmlBody": "<p><a href=\"https://archive.ph/6AwJo\">https://archive.ph/6AwJo</a></p>", "parentCommentId": null, "user": {"username": "Eddie Liu"}}, {"_id": "S52knLLA9dAKiNLYv", "postedAt": "2022-11-09T22:22:29.254Z", "postId": "EKN9Nn89ixriwSXpP", "htmlBody": "<p>This explanation of events seems to contradict several of SBF's public statements, such as:</p><p>\"FTX has enough to cover all client holdings.\"</p><p>\"We don't invest client assets (even in treasuries).\"</p><p>source: <a href=\"https://cointelegraph.com/news/ftx-founder-sam-bankman-fried-removes-assets-are-fine-flood-from-twitter\">https://cointelegraph.com/news/ftx-founder-sam-bankman-fried-removes-assets-are-fine-flood-from-twitter</a></p><p>I guess we'll know more for sure in the coming days. One big open question for EA is whether SBF's money was obtained through fraudulent or illegal activities. As far as I can tell, it is too soon to tell.</p>", "parentCommentId": null, "user": {"username": "Kevin Lacker"}}, {"_id": "hSRAF4RrvJPzDmTpE", "postedAt": "2022-11-09T23:29:48.168Z", "postId": "EKN9Nn89ixriwSXpP", "htmlBody": "<p>The key paragraph:</p><blockquote><p>The reason for a run on FTX is if you think that FTX loaned Alameda a bunch of customer assets and got back FTT in exchange. If&nbsp;<i>that’s&nbsp;</i>the case, then a crash in the price of FTT will destabilize FTX.&nbsp;If you’re worried about that, you should take your money out of FTX before the crash. If everyone is worried about that, they will all take their money out of FTX. But FTX doesn’t have their money; it has FTT, and a loan to Alameda. If they all take their money out, that’s a bank run.</p></blockquote>", "parentCommentId": null, "user": {"username": "NunoSempere"}}, {"_id": "PNzJuHPyYfhSBLafc", "postedAt": "2022-11-10T00:07:36.096Z", "postId": "EKN9Nn89ixriwSXpP", "htmlBody": "<p>Is this reliable? Unclarified references to a \"leak\" is not reliable, since it doesn't clarify whether the leak was from a hack, and fake documents are easily inserted by the hackers during the hacking process.</p>", "parentCommentId": null, "user": {"username": "trevorw96"}}, {"_id": "ocvqdy3RMHBi4GFo4", "postedAt": "2022-11-10T00:25:18.032Z", "postId": "EKN9Nn89ixriwSXpP", "htmlBody": "<p>I think there's a few serious questions here.&nbsp;</p><ol><li>Morally, if it's found that FTX funded EA through fraudulent activity, is there an imperative to do anything about this? Return funds, support those impacted, etc... Suicide due to a lack of funds is not unprecedented in the crypto space and a ~90% loss of a leading coin may sadly result in loss of life.&nbsp;</li><li>How does this impact current EA initiatives relying on FTX-based funding? Is there an urgent need to find other sources of funds to cover important work here?&nbsp;</li><li>Is there a need to disassociate EA with FTX because of SBF (he was a director of CEA, spoken about it, and there are other links recently made public such as Will MacAskill's texts to Elon Musk introducing SBF to be involved in the Twitter deal).</li></ol><p>There's a huge negative sentiment towards SBF 'playing a white knight' that I've seen on FB/Reddit/HackerNews is leading people to assume EA itself may be fraudulent. Maybe it's water under the bridge within a week? But maybe it impacts future philanthropy and impacted EA groups losing funding lose trust.&nbsp;</p>", "parentCommentId": null, "user": {"username": "EddSH1994"}}, {"_id": "usHYGhgYyfJSB6idS", "postedAt": "2022-11-10T01:32:30.086Z", "postId": "EKN9Nn89ixriwSXpP", "htmlBody": "<p>All of which means it's not a real \"exchange.\" The New York Stock Exchange could never go bankrupt like this. They make money just by small fees on transactions and by membership fees. &nbsp;But an \"exchange\"that gambles with customers' assets by engaging in self-serving loans to sister corporations -- well, that's &nbsp;crazy, and it's part of why humans invented financial regulation in the first place. Looks like Bankman-Fried has just been using new technology to reinvent old forms of fraud.&nbsp;</p>", "parentCommentId": "hSRAF4RrvJPzDmTpE", "user": {"username": "Stuart Buck"}}, {"_id": "wFiNJXHeX6EsYCnbF", "postedAt": "2022-11-10T02:22:41.343Z", "postId": "EKN9Nn89ixriwSXpP", "htmlBody": "<p>Underlying #1 and #3, there’s the additional question of to what extent EA was motivation for SBF to engage in unethical behaviour.</p><p>Sequoia, one of the major investors in FTX, paid a writer to do a lengthy puff piece on SBF in September. EA makes numerous appearances:</p><p><a href=\"https://www.sequoiacap.com/article/sam-bankman-fried-spotlight/\">https://www.sequoiacap.com/article/sam-bankman-fried-spotlight/</a></p><blockquote><p>And MacAskill—Singer’s philosophical heir—had the answer: The best way for him to maximize good in the world would be to maximize his wealth.</p><p>SBF listened, nodding, as MacAskill made his pitch. The earn-to-give logic was airtight. It was, SBF realized, applied utilitarianism. Knowing what he had to do, SBF simply said, “Yep. That makes sense.” But, right there, between a bright yellow sunshade and the crumb-strewn red-brick floor, SBF’s purpose in life was set: He was going to get filthy rich, for charity’s sake. All the rest was merely execution risk.</p></blockquote><p>EA will be subject to intense scrutiny if SBF viewed &nbsp;reckless and fraudulent behaviour as execution risk for altruistic goals.</p>", "parentCommentId": "ocvqdy3RMHBi4GFo4", "user": {"username": "RagtagJack"}}, {"_id": "efTJJWqvjhyjnHYqc", "postedAt": "2022-11-10T03:18:40.580Z", "postId": "EKN9Nn89ixriwSXpP", "htmlBody": "<p>I think there’s two possible next steps:</p>\n<ol>\n<li>\n<p>Be vigilant of what money is being donated to EA - if it comes from grey area fields (and I say this as someone who’s worked in crypto for a few years, albeit I quit the area earlier in the year). Of course this being EA there’s going to be people arguing the money has been moved to more positive uses, but public image is key to have sustainable donations moving on.</p>\n</li>\n<li>\n<p>Have a piece about the pros of EA and thank SBF/FTX for their donations but be clear that EA doesn’t knowingly accept money obtained in potentially immoral ways. Now there’s a chance this was all above board and FTX got beaten by a competitor in an unregulated sector, which is of course possible! However there’s a lot of contradictory points popping up about 1:1 backing and the trading firm was very close to an exchange… market information to front run I get, but hopefully they didn’t loan users funds via FTT to trade.</p>\n</li>\n</ol>\n", "parentCommentId": "wFiNJXHeX6EsYCnbF", "user": {"username": "EddSH1994"}}, {"_id": "mFnAxK5eBF3aJpqbk", "postedAt": "2022-11-10T04:43:00.600Z", "postId": "EKN9Nn89ixriwSXpP", "htmlBody": "<p>Tangential to #2, there’s a scenario where this ends up as a reputational nightmare for EA.</p><ol><li>If SBF committed fraud, there’s a distinct possibility that SBF will use altruism as a defence and/or justification for his actions in the coming months.</li><li>If the above happens, the issue may not die anytime soon. Given the scope of the event, and Sam’s prominence within EA, it would become a borderline obligation for any media outlet to mention it in any coverage of EA for years to come.</li><li>Depending on how things break, anyone with a public association with EA may be viewed through the lens of either “dangerously overcommitted to utilitarianism,” or “using EA as a cover for unethical behaviour.”</li></ol><p>The author that Sequoia paid to write SBF’s puff piece (linked in earlier comment) has already put out a tweet to this effect:</p><blockquote><p>A bad day for #SBF but even worse for #EA. Is this #ultilitarianism as psychological cover to run a #Ponzi scheme?</p></blockquote><p><a href=\"https://twitter.com/AdamcFisher/status/1590466104773992448\">https://twitter.com/AdamcFisher/status/1590466104773992448</a></p><p>My concern at this point is the willingness of MacAskill and other prominent EA’s to condemn SBF. “Wait and see” is often preferred, but there may be permanent damage to EA’s reputation if SBF is not disavowed by EA leadership in due time.</p>", "parentCommentId": "efTJJWqvjhyjnHYqc", "user": {"username": "RagtagJack"}}, {"_id": "XonvxR9xWr97HZ2TY", "postedAt": "2022-11-10T06:54:07.512Z", "postId": "EKN9Nn89ixriwSXpP", "htmlBody": "<p>My understanding is that the rise and fall of FTX was a positive feedback loop turned negative. When FTX had money, they <a href=\"https://mobile.twitter.com/SBF_FTX/status/1587080196292837376\">used it</a> to drive up the price of their own crypocurrency, FTT. One of the biggest <a href=\"https://dirtybubblemedia.substack.com/p/is-alameda-research-insolvent\">holders</a> of FTT was Alameda Research, SBF's hedge fund. They profit nominally from rising FTT, but the only big buyer of FTT is FTX, so how does Alameda turn FTT into cash? It looks like <a href=\"https://twitter.com/lucasnuzzi/status/1590122590206824448?s=42&amp;t=JKx1CmAu6B2dtYDE8so4Rw\">FTX gave Alameda loans</a> on the premise that Alameda's FTT was strong collateral. It's a money printer when times are good: FTX profits on customer transactions and loans to Alameda, and Alameda profits on trades.&nbsp;</p><p>But it's an extremely precarious position. If the price of FTT drops, FTX loses money. People get worried about the money they deposited in FTX and try to withdraw. To pay them back, FTX can try to sell FTT coin, but FTT coin is already trading below where FTX bought it. FTX could also try to call back their loans to Alameda, but those loans are collateralized by FTT, so Alameda can't pay. All of a sudden, customers want their money back and FTX can't provide it. FTT, FTX, and Alameda collapse.&nbsp;</p><p>That's my current best guess at what happened. We're going to find out a lot more in the weeks to come, but this is the story that's currently being reported. &nbsp;Here's <a href=\"https://www.thediff.co/p/ftx-rip\">Byrne Hobart</a>'s timeline:</p><blockquote><p>November 1, 9:44am ET: <a href=\"https://www.coindesk.com/business/2022/11/02/divisions-in-sam-bankman-frieds-crypto-empire-blur-on-his-trading-titan-alamedas-balance-sheet/?outputType=amp\"><u>Coindesk writes a story on a leaked Alameda balance sheet showing large exposure to FTX's FTT token</u></a>.</p><p>November 4, 5:38am: <a href=\"https://dirtybubblemedia.substack.com/p/is-alameda-research-insolvent\"><u>a Substack post asks if the company is insolvent</u></a>, and rumors spread over the weekend.</p><p>November 6th, 10:47am: <a href=\"https://twitter.com/cz_binance/status/1589283421704290306?s=20&amp;t=VZc_zLvRu2oyS5Wv4vg3tA\"><u>Changpeng \"CZ\" Zhao, CEO of rival exchange Binance, announces plans to sell his FTT tokens</u></a>.</p><p>16 minutes later: Alameda Research's CEO <a href=\"https://twitter.com/carolinecapital/status/1589287457975304193?s=20&amp;t=VZc_zLvRu2oyS5Wv4vg3tA\"><u>offers to buy them</u></a>.</p><p>November 6th, 6:28pm: <a href=\"https://twitter.com/SBF_FTX/status/1589399420487208960?s=20&amp;t=VZc_zLvRu2oyS5Wv4vg3tA\"><u>Sam Bankman-Fried tweets that the exchange is solvent</u></a>. Many people <a href=\"https://twitter.com/search?q=%22Every%20banker%20knows%20that%20if%20he%20has%20to%20prove%20he%20is%20worthy%20of%20credit%2C%20in%20fact%20his%20credit%20is%20gone.%22%20&amp;src=typed_query&amp;f=live\"><u>remember their Bagehot</u></a>.</p><p>November 7th, 7:38am: <a href=\"https://twitter.com/SBF_FTX/status/1589598284322328579\"><u>SBF reiterates that the exchange is fine</u></a>. The Bagehot-posting intensifies.</p><p>November 8, 6:00am: <a href=\"https://techcrunch.com/2022/11/08/ftxs-seemingly-sluggish-withdrawals-raise-eyebrows/\"><u>Tech news sites cover slow withdrawals at FTX</u></a>.</p><p>November 8th, 11:03am: <a href=\"https://twitter.com/SBF_FTX/status/1590012124864348160?s=20&amp;t=VZc_zLvRu2oyS5Wv4vg3tA\"><u>SBF announces that FTX has signed a letter of intent to be acquired by Binance</u></a>, which has been <a href=\"https://twitter.com/cz_binance/status/1590013613586411520\"><u>confirmed by CZ</u></a>. By this time, total losses based on the positions in the Coindesk report are at least $2.3bn, mostly from FTT depreciation. (Those losses will roughly double in the next few hours as FTT continues to depreciate.)</p><p>November 9th: <a href=\"https://decrypt.co/114052/binance-cancels-plans-acquire-ftx\">Binance withdraws from deal to acquire FTX</a>.&nbsp;</p></blockquote><p>Byrne speculates that FTX's profitability could be as manufactured as it sounds:</p><blockquote><p>This could have been a completely cynical perpetual motion machine where Alameda makes FTX a better exchange by providing cheap liquidity, and the growth of FTX increases the value of the underlying FTT, giving Alameda more collateral to borrow against for providing more liquidity.</p></blockquote><p><a href=\"https://www.bloomberg.com/opinion/articles/2022-11-09/bankman-fried-s-ftx-had-a-death-spiral-before-binance-deal\">Matt Levine</a> compares it to a bank providing a loan with its own stock as collateral. This is stupid and often &nbsp;illegal because if the loan goes bad, the stock price goes down, making it a double-whammy:</p><blockquote><p>If you go to an investment bank and say “lend me $1 billion, and I will post $2 billion of your stock as collateral,” you are messing with very dark magic and they will say no. &nbsp;The problem with this is that it is wrong-way risk. (It is also, at least sometimes, illegal.) If people start to worry about the investment bank’s financial health, its stock will go down, which means that its collateral will be less valuable, which means that its financial health will get worse, which means that its stock will go down, etc. It is a death spiral. In general it should not be possible to bankrupt an investment bank by shorting its stock. If one of the bank’s main assets is its own stock — is a leveraged bet on its own stock — then it is easy to bankrupt it by shorting its stock.</p></blockquote><p>CZ, CEO of Binance, <a href=\"https://twitter.com/cz_binance/status/1590103159506341888\">says</a> enough to help put the pieces together:</p><blockquote><p>Two big lessons:</p><ol><li>Never use a token you created as collateral.&nbsp;</li><li>Don't borrow if you run a crypto business.&nbsp;</li></ol></blockquote><p>Jon Wu has a <a href=\"https://mobile.twitter.com/i/flow/lite/verify_password\">great thread</a>:</p><blockquote><p>tl;dr</p><p>- CZ dumps $FTT<br>- Alameda faces external margin calls, looks to FTX for liquidity<br>- FTX depositors have withdrawn; piggy bank is broken<br>- FTX's assets are loans Alameda can't repay, against real customer liabilities<br>- FTX in the hole for billions<br>- CZ buys FTX</p></blockquote><p>If this is what happened, then SBF took an incredible gamble with other people's money and lost big, <a href=\"https://www.reuters.com/business/finance/crypto-exchange-ftx-saw-6-bln-withdrawals-72-hours-ceo-message-staff-2022-11-08/\">billions of dollars in customer deposits</a> big. It's a shame for FTX and the EA community.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Aidan O'Gara"}}, {"_id": "ZxaREQGgpFJ3anPNC", "postedAt": "2022-11-10T07:05:53.896Z", "postId": "EKN9Nn89ixriwSXpP", "htmlBody": "<p>I think when doing any sort of dissociating from SBF, there's two errors in opposite directions I would like to see EA avoid:</p>\n<ol>\n<li>\n<p>any responsibility on the part of EA should be very clearly acknowledged. I don't want to get into what sort of responsibility there might be, and I think your questions are a good start. But there's a tendency for corporate PR to want to airbrush responsibility and the movement's long term reputation will win if EA conducts itself with integrity.</p>\n</li>\n<li>\n<p>for integrity's sake, too, I hope we avoid throwing Sam or anyone else under the bus before the facts are clearly demonstrated. I think you can distance without blaming, and in early stages, that might be the most appropriate action.</p>\n</li>\n</ol>\n<p>I want to acknowledge the challenging time leaders in the space right now must be having. Easy for me to write a list of demands here on a thread, but doubtless more difficult to make the calls. Thoughts are with folks having to make big calls on this right now.</p>\n", "parentCommentId": "ocvqdy3RMHBi4GFo4", "user": {"username": "ben.smith"}}, {"_id": "pznDGZ2kBf42vXek9", "postedAt": "2022-11-10T08:13:00.948Z", "postId": "EKN9Nn89ixriwSXpP", "htmlBody": "<p>I think the main thrust of the article is the speculation about \"Customer C\", in this case, Alameda. &nbsp;That speculation being that FTX lended Alameda customer funds for its own token.<br><br>However, this also offers a way out, on the condition that Alameda didn't lose whatever it got. In Matt Levine's analogy, the funds are lost because \"Customer C\" ran away for selfish reasons, to the detriment of the bank. In this case, Alameda and FTX are both closely associated with Bankman-Fried.<br><br>If Alameda still has the assets gotten from FTX customers, it would then be possible to move that back to FTX customers. FTX and Alameda would still be finished in a business sense, but the damage to customers would be minimized.<br><br>Of course this is all just blind speculation on my part, and it doesn't look good because Alameda probably already spent all the assets it got from FTX to pay off previous loans. If that is the case then we're still in the same situation with customer funds lost.</p>", "parentCommentId": null, "user": {"username": "Ataftoti"}}, {"_id": "TyDRyAeMMHnrFMepv", "postedAt": "2022-11-10T10:13:42.607Z", "postId": "EKN9Nn89ixriwSXpP", "htmlBody": "<p>How exactly do you disassociate SBF from EA? The guy grew up with two utilitarian philosopher parents, explicitly started Alameda on earn to give principles, used EA social connections to do Alameda's first major trades (the yen-denominated BTC arbitrage), and gave a ton of money to EA causes. If he isn't an effective altruist, no one is!</p>", "parentCommentId": "ocvqdy3RMHBi4GFo4", "user": {"username": "Sabs"}}, {"_id": "bPC8s5uf7DWEctxyP", "postedAt": "2022-11-10T13:41:35.572Z", "postId": "EKN9Nn89ixriwSXpP", "htmlBody": "<p>Yeah, that's why I think ben.smith's comment in the same thread here is important. Handling the fallout well requires nuance and some additional degree of self-reflection on the part of EA leaders. (I say \"some additional degree\" because it's not like people were completely unaware of these risks – see <a href=\"https://forum.effectivealtruism.org/posts/T975ydo3mx8onH3iS/ea-is-about-maximization-and-maximization-is-perilous\">here</a>.) And I think it would be wrong (and too easy) to see Sam as some kind of cartoon villain. It strongly looks as though some actions were far away from \"defensible\" but I don't for a second doubt that his motivation to do good was sincere, and he got impressively far with it and you can understand how he might have felt increasingly more empowered to act in naive-consequentialist ways after seeing all that success.&nbsp;<br><br>(Edit: To be clear, \"understand\" isn't the same as condone; with enough effort you can maybe also \"understand\" why the Taliban flew a plane into a building, etc.)&nbsp;</p>", "parentCommentId": "TyDRyAeMMHnrFMepv", "user": {"username": "Lukas_Gloor"}}, {"_id": "BTuDEB6F5ahmM4iHf", "postedAt": "2022-11-10T16:13:11.439Z", "postId": "EKN9Nn89ixriwSXpP", "htmlBody": "<p>It is important to wait and see what happened in more light. We must not have EA used as a defense of criminal activities, if anything illegal did take place. I don't mean to throw anyone under the bus here, and I don't really think I mean 'disassociate SBF from EA', I mean we should avoid EA becoming associated with Crypto failures because frankly I believe this will be the first introduction <i>many </i>people have to EA.&nbsp;</p><p>Let's try avoid this trending meme on Twitter becoming the general conception of EA&nbsp;</p><p><a href=\"https://imgur.com/a/7tYOa7M\">https://imgur.com/a/7tYOa7M</a></p><p>And, maybe, this is all water under the bridge in a week and it just goes away.&nbsp;</p>", "parentCommentId": "TyDRyAeMMHnrFMepv", "user": {"username": "EddSH1994"}}, {"_id": "AKHn5CBHfe9pG2cNk", "postedAt": "2022-11-10T16:17:51.407Z", "postId": "EKN9Nn89ixriwSXpP", "htmlBody": "<blockquote><p>for integrity's sake, too, I hope we avoid throwing Sam or anyone else under the bus before the facts are clearly demonstrated. I think you can distance without blaming, and in early stages, that might be the most appropriate action.</p></blockquote><p><br>Yes, I agree. I don't mean to throw Sam under the bus here. I'm sure his intentions were from a good place. I do mean that this is probably going to become the first time <i>many </i>people hear about EA and that should be handled in some way. If EA becomes synonymous with Crypto fraud then we could see less support from existing people and it is first thing people see when they're looking into EA (GWWC, EA Funds, etc).&nbsp;</p>", "parentCommentId": "ZxaREQGgpFJ3anPNC", "user": {"username": "EddSH1994"}}, {"_id": "rQdRFEzidZwguqgz4", "postedAt": "2022-11-10T16:17:58.457Z", "postId": "EKN9Nn89ixriwSXpP", "htmlBody": "<p>But EA is, almost certainly, an important part of the story here . It would be very strange to pretend that EA and utilitarian philosophy have nothing to do with why SBF took these risks. It's not exactly some mysterious connection.</p>", "parentCommentId": "BTuDEB6F5ahmM4iHf", "user": {"username": "Sabs"}}, {"_id": "XdEQmuTxZHxkzuC3v", "postedAt": "2022-11-10T16:24:10.086Z", "postId": "EKN9Nn89ixriwSXpP", "htmlBody": "<p>It's not a mysterious connection but EA must not become synonymous with Fraud under the guise of 'good'. People should not rob banks to send money to CEA.</p><p>Edit: This is a random example, I am not saying Sam robbed a bank!</p>", "parentCommentId": "rQdRFEzidZwguqgz4", "user": {"username": "EddSH1994"}}, {"_id": "DcNddjxSgwDsDPcQh", "postedAt": "2022-11-10T16:32:41.509Z", "postId": "EKN9Nn89ixriwSXpP", "htmlBody": "<p>he probably did rob a bank, actually, insofar as I strongly suspect that Silvergate Capital has some loans outstanding to Alameda that they aren't getting back....</p>", "parentCommentId": "XdEQmuTxZHxkzuC3v", "user": {"username": "Sabs"}}, {"_id": "oXmQNWAMuuwpDe2Cz", "postedAt": "2022-11-10T16:38:24.346Z", "postId": "EKN9Nn89ixriwSXpP", "htmlBody": "<p>I don't really think FTT is considered a \"major coin\" - it's new, and only used by this one exchange. Not sure it has much any use at all outside FTX and would be kinda weird to overinvest in as an outsider other than as a bet on FTX itself.</p>\n", "parentCommentId": "ocvqdy3RMHBi4GFo4", "user": {"username": "John Litborn"}}, {"_id": "aJhtwvxe73fjpZ8gw", "postedAt": "2022-11-10T16:47:57.742Z", "postId": "EKN9Nn89ixriwSXpP", "htmlBody": "<p>People affected aren't just FTT investors but anyone who used the FTX platform. This is I believe $16B? And, to make matters worse, this money was meant to be held 1:1 but looks like it was loaned out to SBFs trading firm (using FTT) in order to trade. They appear to have minted more FTT in order to make up lost funds (possibly in Q2 when other firms went down). This thread explains a pretty plausible version of events:</p><p>&nbsp;https://twitter.com/LucasNuzzi/status/1590122590206824448?t=ZMpzX12eJCqMhXxJgrdLiA</p>", "parentCommentId": "oXmQNWAMuuwpDe2Cz", "user": {"username": "EddSH1994"}}, {"_id": "s2g36D6sC2FC93jEd", "postedAt": "2022-11-10T17:16:57.030Z", "postId": "EKN9Nn89ixriwSXpP", "htmlBody": "<p>I don't think that EA's reputation will be tainted that much by this incident.</p>\n<p>First, startups are inherently risky; the purpose of a startup is to try out an unproven business model in the hope of making money or providing value for customers. FTX exposed investors to what many observers, including me, consider an unacceptable level of risk, but so did Theranos (which was an outright scam).</p>\n<p>Second, risk neutrality as a consequence of utilitarianism is not well understood outside the EA community. It might become more prominent in the discourse soon, but right now journalists are mostly not talking about it.</p>\n", "parentCommentId": "wFiNJXHeX6EsYCnbF", "user": {"username": "evelynciara"}}, {"_id": "TAMBwZNrndvy7KBgW", "postedAt": "2022-11-10T19:44:48.896Z", "postId": "EKN9Nn89ixriwSXpP", "htmlBody": "<p>Levine wrote more about FTX today: <a href=\"https://www.bloomberg.com/opinion/articles/2022-11-10/ftx-is-still-looking-for-money\">https://www.bloomberg.com/opinion/articles/2022-11-10/ftx-is-still-looking-for-money</a></p>\n<p>I edited the original post to add this link.</p>\n", "parentCommentId": null, "user": {"username": "Elliot Temple"}}, {"_id": "QzhP2G2fFfevavTfq", "postedAt": "2022-11-10T20:21:55.424Z", "postId": "EKN9Nn89ixriwSXpP", "htmlBody": "<blockquote><p>If SBF committed fraud, there’s a distinct possibility that SBF will use altruism as a defence and/or justification for his actions in the coming months.</p></blockquote><p>Sadly, I think his having been the second largest donor to the Biden 2020 campaign fund will be a more effective defence. It certainly worked for the people who lost hundreds of billions of Other People's Money in 2008.</p>", "parentCommentId": "mFnAxK5eBF3aJpqbk", "user": {"username": "frenbaim"}}, {"_id": "H8vAbSM5BCmENahtm", "postedAt": "2022-11-11T00:33:02.682Z", "postId": "EKN9Nn89ixriwSXpP", "htmlBody": "<p>Sequoia pulled that link, here's an <a href=\"https://web.archive.org/web/20221110022947/https://www.sequoiacap.com/article/sam-bankman-fried-spotlight/\">archived version</a>.&nbsp;</p>", "parentCommentId": "wFiNJXHeX6EsYCnbF", "user": {"username": "Milan_Griffes"}}, {"_id": "BTJXePToSMdac6pxP", "postedAt": "2022-11-11T04:24:04.876Z", "postId": "EKN9Nn89ixriwSXpP", "htmlBody": "<p>seems he has ended up giving more to the democratic party than ea lol</p>", "parentCommentId": "QzhP2G2fFfevavTfq", "user": {"username": "maxeonyx"}}, {"_id": "Tp8cHmbspE2cmQJcW", "postedAt": "2022-11-12T05:54:04.123Z", "postId": "EKN9Nn89ixriwSXpP", "htmlBody": "<p>sure, I was mostly just disagreeing with \"90% loss of a major coin\" - but I suppose you can read that sentence more charitably. But focusing on the inherent value of FTT as the avenue of affecting customers I think is misguided.</p>\n", "parentCommentId": "aJhtwvxe73fjpZ8gw", "user": {"username": "John Litborn"}}, {"_id": "Gh7k9NAdc9NMT5g5M", "postedAt": "2022-11-12T23:09:51.925Z", "postId": "EKN9Nn89ixriwSXpP", "htmlBody": "<p>From what I have read, Bankman-Fried is claiming that he had an erroneous impression[*] of how much aggregate leverage FTX was offering to its customers. I think many people do not understand that an exchange like FTX does not necessarily make loans to its customers in the same way as a bank does - by depositing the full amount in their account. Rather, it extends a line of credit, which is subject to margin calls and/or collateral requirements, designed to protect FTX and ultimately its other customers. This was a normal practice offered to numerous customers and documented in their public documentation, it was not some special privilege accorded only to Alameda - though the terms may have been more generous for Alameda. Though note that Alameda had billions in assets so, proportionately to its size, it may not have been that generous after all.</p><p>The problem here seems to have been that, according to media reports, the line(s) of credit offered to Alameda were collateralised by FTT - FTX's own exchange token - and shares in Robin Hood - neither of which are particularly high-quality assets compared to, say, US treasuries, especially FTT. But this is an assessment in hindsight, from the perspective of 12 Nov 2022 when FTT is essentially almost worthless - that was not the case earlier in the year!</p><p>Note that again, use of non-government bonds as collateral is hardly something unique to FTX - Tether, to take another example within the same industry, has held non-government bonds on its balance sheet to substitute for cash.</p><p>This is probably why Bankman-Fried said recently that FTX actually <i>had</i> sufficient assets to cover customer withdrawals, they were just very illiquid, so he needed to find someone to give him a liquidity injection (of some billion dollars!)</p><p>When Binance initiated the \"controlled demolition\" of FTT by selling off their FTT stash and loudly announcing they had done so, this of course brought down the whole precarious house of cards.</p><p>This fits with the idea that Bankman-Fried is a \"hardcore utilitarian\" (his own self-description) of the type who values high expected utility over risk-adjusted returns, rather than a deliberate fraudster. He presumably realised that a big holder of FTT could cause its price to crash by selling it, but he probably thought this was unlikely to happen because it would not be in that holder's self-interest to do so. But I suspect that Binance's CEO CZ got so angry about (what he perceived to be) SBF's attacks on him, his business and even his children, that he was prepared to torpedo the whole thing, despite it hurting him financially as well in the short term, because in the long term it would take out a highly-competent competitor, which was valuable.</p><p>Furthermore, perhaps SBF calculated that it would be possible, or even easy to restart the whole shebang if the merry-go-round ever stopped, because FTT was sort of a representation of the money-printing machine that was FTX, so an injection of liquidity into FTX to restart it should have resurrected the value of FTT, enabling the loan to be repaid in the long term. But it turned out that was not the case, because of this little thing called \"reputation\", which formed a key part of FTX's intangible equity, and which was lost during this whole debacle. No-one wanted to go near the now-radioactive company that was FTX, not even CZ or Elon Musk. Elon didn't trust SBF, and CZ may have had obvious personal reasons (see previous paragraph) to pretend to buy FTX and then thrown up his hands in mock horror and say that it was not something he wanted to be involved in, \"pour encourager les autres\". I think it is a testament to Bankman-Fried's lack of ego that he went cap in hand to his adversary to see if he would buy FTX out. But it was perhaps not a wise move because I think CZ kind of poisoned the well.</p><p>[*] I'm not going to go into how I suspect this erroneous impression came about, because it's a technical detail that's not really relevant to the above points, and my theory looks on its face to be so implausible that I don't think you would believe it - and anyway, SBF has promised to publish a full account of the affair so hopefully we'll know soon anyway.</p>", "parentCommentId": "usHYGhgYyfJSB6idS", "user": {"username": "Robin_Green"}}, {"_id": "BhHGQ43g9EhuHLFHe", "postedAt": "2022-11-09T21:54:57.682Z", "postId": "EKN9Nn89ixriwSXpP", "htmlBody": null, "parentCommentId": null, "user": null}]