[{"_id": "FwWCwFjDXRFWvvjDf", "postedAt": "2021-11-19T01:17:20.454Z", "postId": "EktaZtz6DSPbzymjg", "htmlBody": "<p>Hey, first of all +1 for offering coaching, I think this is healthy for early stage projects like this (which might still need product market fit) because 1-on-1 meetings give a lot more important feedback than visitors in a website.</p>", "parentCommentId": null, "user": {"username": "hibukki"}}, {"_id": "JXJcRHwovjuYb6p8L", "postedAt": "2021-11-19T01:19:01.489Z", "postId": "EktaZtz6DSPbzymjg", "htmlBody": "<p>My personal feedback from the post: I think \"learning\" is more generic than what you're doing. If I remember correctly, you're specifically going for \"learning how to memorize facts [using Anki]\". I'd intuitively write the more specific version</p>", "parentCommentId": "FwWCwFjDXRFWvvjDf", "user": {"username": "hibukki"}}, {"_id": "ETibXaDtxwiZJyL47", "postedAt": "2021-11-19T10:36:45.628Z", "postId": "EktaZtz6DSPbzymjg", "htmlBody": "<p>Hey Yonatan, cheers for the feedback! If you haven't already then <a href=\"https://www.teachingyouhowtolearn.com/2021/09/06/key2.html\">key ideas guide 2</a> sums up my rebuttals to the \"anki is just for facts\" view. Definitely agree that I'm only coaching on computer-based learning (Anki + Obsidian mostly), but would argue that as Anki uses the best techniques for learning (spaced repetition, active recall, active encoding), it's fair for me to advertise this as learning coaching. The aim is effective learning, the tool is Anki (+ Obsidian if people are interested!). There are things like experiential learning and generative learning that I won't be covering, but I don't claim to be &nbsp;a one-stop shop for all learning methods</p>", "parentCommentId": "JXJcRHwovjuYb6p8L", "user": {"username": "alexanderklarge"}}, {"_id": "x9HpZBajA62Ej9AsG", "postedAt": "2021-11-19T12:56:07.808Z", "postId": "EktaZtz6DSPbzymjg", "htmlBody": "<p>Although saying that: I have just discovered this learning coach who recommends some <a href=\"https://www.youtube.com/watch?v=VcT8puLpNKA&amp;t=720s\">beyond-anki paradigm</a>s, which I'm very &nbsp;interested to try out!</p>", "parentCommentId": "ETibXaDtxwiZJyL47", "user": {"username": "alexanderklarge"}}, {"_id": "T8CztCbswCjb6EnRH", "postedAt": "2021-11-19T15:48:54.280Z", "postId": "EktaZtz6DSPbzymjg", "htmlBody": "<p>Ah! Sounds like I just didn't understand it well. +1!</p>", "parentCommentId": "ETibXaDtxwiZJyL47", "user": {"username": "hibukki"}}, {"_id": "vjiebwzeKhdrEFGDz", "postedAt": "2021-11-20T03:52:43.477Z", "postId": "EktaZtz6DSPbzymjg", "htmlBody": "<p>Hey, I think Training for Good might be trying to put together a self-paced online course about learning how to learn. Have you by any chance connected with them? : )</p>", "parentCommentId": null, "user": {"username": "Caroline Wiese Young"}}]