[{"_id": "HzK8WPohLdBEgXwd7", "postedAt": "2024-01-03T23:27:03.890Z", "postId": "EkXdfzssWbrNXCmYf", "htmlBody": "<p><a href=\"https://en.wikipedia.org/wiki/Container-deposit_legislation\">Container-deposit legislation</a> seems like existing policy to investigate strengthening:</p>\n<p><a href=\"https://slate.com/technology/2013/08/bottle-deposit-should-keep-up-with-inflation-time-to-raise-fee-from-a-nickel-to-30-cents.html\">https://slate.com/technology/2013/08/bottle-deposit-should-keep-up-with-inflation-time-to-raise-fee-from-a-nickel-to-30-cents.html</a></p>\n", "parentCommentId": null, "user": {"username": "Pat Myron"}}, {"_id": "fGECnqdmzqHroX3s2", "postedAt": "2024-01-07T09:59:37.196Z", "postId": "EkXdfzssWbrNXCmYf", "htmlBody": "<p>Do you mean it seems like it is existing policy or that strengthening it should be investigated?</p>\n", "parentCommentId": "HzK8WPohLdBEgXwd7", "user": {"username": "Elina Christian"}}, {"_id": "dmhb8YobrtxcTtYPA", "postedAt": "2024-01-07T17:32:25.549Z", "postId": "EkXdfzssWbrNXCmYf", "htmlBody": "<p>I've thought about this a little bit and then got stuck when it comes to figuring out where the big wins are and where the dead ends are.</p>\n<p>In no particular order:\nSome metals are valuable. For this reason I don't think they are neglected but I also think the public doesn't know these metals should be recycled.</p>\n<p>Recycling is almost certainly neglected because it is a public good that doesn't pay - these are pretty well always neglected.</p>\n<p>Destroying things and making giant landfills feels bad and looks ugly but actually doesn't do as much damage as it feels like. The main reason that most waste campaigns give for more waste management is that it's destroying the earth. It's not. Getting an accurate picture of where the most damage occurs from bad waste management (perhaps polluted rivers in India? ghost nets left in the ocean?) is something very important and critical to the EA approach. As far as I know this hasn't been done yet. Not by EA and not by recycling orgs.</p>\n<p>Recycling is tricky because there is the benefit of the materials (mostly estimated by their material value) but also the value of preventing more material from being gathered. (environmental damage) The material value is already pretty accurate I suspect. With one big caveat: As new forms of waste (for example plastic) appear, then it takes awhile for new forms of use (recycled plastic shoes? idk) to appear and value the material.</p>\n<p>Some materials are so difficult to reuse that recycling them takes more energy and resources than simply disposing of them AND creating them anew. Those kinds of things ought to NOT be recycled! Maybe they should not created from the outset. Depends on how useful they are probably. Styrofoam is an example.</p>\n<p>Environmental damage of creating more stuff is missing from the recycling economic math equation and is where potential important interventions would lie for society.</p>\n<p>Toxic materials are a whole category that is very important and I know very little about. This is probably where the biggest improvements and most neglect is.</p>\n<p>There are some cool new technologies to look into - a student I met was breeding bacteria to survive in highly metal contaminated environments to breakdown plastics and concentrate useful metals for waste management. Potentially a lot safer than human chemical processing.</p>\n<p>Plastics are generally becoming more biodegradable. I'm not sure what body is pushing that to happen but it's a very good thing.</p>\n<p>Furniture used to be a much bigger investment (like clothes were historically. People used to own 3-4 clothes and have them tailored. hard for us to imagine), but changing technology, culture, and mobility is turning furniture into a disposible resource. Potentially eventually almost as disposible as clothes. This seems like a big shift that recycling and reuse should anticipate and adapt to. Encouraging standards could go a long way to making furniture more valuable materials and increase the post-first-use value for both the purchaser, the recycler, and society.</p>\n", "parentCommentId": null, "user": {"username": "EcologyInterventions"}}, {"_id": "fsj7KzcaedeMCQiTr", "postedAt": "2024-01-08T11:54:48.557Z", "postId": "EkXdfzssWbrNXCmYf", "htmlBody": "<p>I'm also not a subject matter expert, but did spend a couple of years working with an academic spinoff monitoring illegal dumping, so here’s my two cents. Happy to discuss further with anyone interested in researching or acting in the sector, and may get around to writing a longer post if there's interest</p><ul><li>Waste mismanagement can have a significant <strong>quantifiable negative impact on global health.</strong> e.g illegal dumping in a subregion of Campania, Italy was associated with significant increases in cancers in that triangle. Proving causality is much harder than for many other health issues, which may lead to neglect.</li><li>Worse waste management probably has greater health impact in LMI countries with much weaker regulations and worse access to healthcare. This includes impact of waste exported from developed countries (e-waste etc.)</li><li>Negative impacts on wild animals tend to be much greater than on humans.<strong> Plastic waste is estimated to kill 1 million birds annually </strong>(mostly at sea, where regulation can't deal with garbage patches the size of Texas, but <a href=\"https://theoceancleanup.com\">cool tech</a> might)</li><li>Organised waste disposal - where it exists - is an ongoing and expensive operation typically carried out by profit making companies ($400bn-$2tr global industry). Demand is largely created by governments (through waste disposal regulation as well as paying for household collection), so the the <strong>most cost-effective philanthropic interventions may be advocacy</strong>.</li><li>Waste mismanagement is not just lack of care but also&nbsp;organized criminals (e.g. mafia in Campania) running commercial waste disposal operations as avoiding tax and expense of safe disposal in developed countries is <i>very</i> profitable. In theory tax evasion losses provides economic incentive for govts to tackle the issue (but remediation costs can be higher).</li><li>Despite the appeal of the \"circular economy\", promoting recycling is likely low impact in DALY/WELLBY terms; trying to identify and block the subset of exported recyclables that are either unsafely recycled or dumped is lightly higher (but NGOs and govts are working on that)</li><li>Some theoretically beneficial interventions (e.g waste-to-energy incinerators) are likely net negative in many locations they're being promoted.</li><li>Many of the tractable problems are being tackled by multilateral organizations (it's one of the EU DG Environment's highest priorities) and environmental charities down to local cleanup volunteering &amp; NIMBY campaigns). Probably more than people realise because it's an unfashionable but <i>really big</i> sector<ul><li>The biggest gap is in LMI countries where the funding and political will isn't there. Some orgs like <a href=\"https://wasteaid.org\">WasteAid</a> are working with local authorities and entrepreneurs to try to change this, but I have no idea how effective they are</li><li>There are surprisingly high tech solutions, just for the detection, monitoring and tracking of waste (we had space agency funding)</li><li>There are also potentially profitable opportunities to do waste disposal (including recycling) in a slightly less harmful way, which might appeal to social enterprise types. If Australia has a problem with lack of recycling, it's probably a business opportunity.</li></ul></li><li>There are overlaps with existing EA organisations and cause areas (e.g combating the unsafe recycling of lead acid batteries would complement <a href=\"https://leadelimination.org\">LEEP</a>'s mission)</li></ul>", "parentCommentId": null, "user": {"username": "David T"}}, {"_id": "TkGQxHucuYirbE2tL", "postedAt": "2024-01-09T10:14:56.812Z", "postId": "EkXdfzssWbrNXCmYf", "htmlBody": "<p>Great comment, thank you for the info! It seems like there's many aspects to this issue, some which might be neglected and tractable and some which are really saturated already</p>\n", "parentCommentId": "fsj7KzcaedeMCQiTr", "user": {"username": "Elina Christian"}}, {"_id": "kwAih53otKMbDzuws", "postedAt": "2024-01-09T10:17:23.701Z", "postId": "EkXdfzssWbrNXCmYf", "htmlBody": "<p>Love the social enterprise idea</p>\n", "parentCommentId": "fsj7KzcaedeMCQiTr", "user": {"username": "Elina Christian"}}, {"_id": "e5NMoR8Dij8ZXMBqk", "postedAt": "2024-01-09T10:22:01.191Z", "postId": "EkXdfzssWbrNXCmYf", "htmlBody": "<p>Thanks! And totally agree!  Many of these points are similar to the thoughts I've been having since looking into this. Addressing highly toxic or very poorly managed waste sectors makes a lot of sense. Would be interested to know more about the plastic eating bacteria</p>\n", "parentCommentId": "dmhb8YobrtxcTtYPA", "user": {"username": "Elina Christian"}}, {"_id": "ZrtFSoEx3tG9H6BpD", "postedAt": "2024-02-04T17:16:36.003Z", "postId": "EkXdfzssWbrNXCmYf", "htmlBody": "<p>Recently I've been hearing tires are a major cause of air pollution and AND ocean plastic pollution.<br><img style=\"width:73.92%\" src=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/ZrtFSoEx3tG9H6BpD/bfcevzvlvobmjg0f69zl\" srcset=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/ZrtFSoEx3tG9H6BpD/igds3frldmv9wazqosxg 90w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/ZrtFSoEx3tG9H6BpD/vf4i4m8lhdfnloid5bct 180w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/ZrtFSoEx3tG9H6BpD/mzwrubemodyl5u4ebeir 270w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/ZrtFSoEx3tG9H6BpD/hjtepo4cp8svcgwkqczn 360w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/ZrtFSoEx3tG9H6BpD/twmcw5nghaursup54lgf 450w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/ZrtFSoEx3tG9H6BpD/x1eudl9ynav59ilole3u 540w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/ZrtFSoEx3tG9H6BpD/vk3aimn6nltfx3azlb73 630w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/ZrtFSoEx3tG9H6BpD/dghjhlknegvqwomt7ylu 720w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/ZrtFSoEx3tG9H6BpD/cmojr2tdj5syez1v32te 810w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/ZrtFSoEx3tG9H6BpD/ayaqerxo1bfmnqjcsx7u 816w\"><br>&nbsp;I think some changes in tire requirements could go a LONG way to improving these as I doubt much effort has gone into improving tire material's environmental impact yet.<br><a href=\"https://www.theguardian.com/environment/2022/jul/25/tyre-dust-the-stealth-pollutant-becoming-a-huge-threat-to-ocean-life\">https://www.theguardian.com/environment/2022/jul/25/tyre-dust-the-stealth-pollutant-becoming-a-huge-threat-to-ocean-life</a><br><a href=\"https://www.thedrive.com/news/tire-dust-makes-up-the-majority-of-ocean-microplastics-study-finds\">https://www.thedrive.com/news/tire-dust-makes-up-the-majority-of-ocean-microplastics-study-finds</a><br>Looks like gov might be on the case, but perhaps we could get it moving wider and faster. \"In the EU, the Euro 7 standards will regulate tire and brake emissions from 2025. In the U.S., the California EPA will require tire manufacturers to find an alternative chemical to 6PPD by 2024, to help reduce 6PPD-q entering the environment going forward. In turn, manufacturers are exploring everything from alternate tire compositions to special electrostatic methods to capture particulate output.\"</p>", "parentCommentId": null, "user": {"username": "EcologyInterventions"}}, {"_id": "EP9jM4KeuvcsiqtqJ", "postedAt": "2024-02-04T17:33:29.058Z", "postId": "EkXdfzssWbrNXCmYf", "htmlBody": "<p>I remembered incorrectly - it was not the plastics, but the rare earths that they were recycling. Tanzeena Hussain was the graduate student working on it and having success getting bacteria to survive in increasingly toxic environments. She was crushing up old electronics to feed the bacteria - pretty on the nose.&nbsp;<br><br>It was in Elizabeth Skovran's lab at San Jose State University. This is the only write up I can find on it: <a href=\"https://blogs.sjsu.edu/newsroom/2023/taking-bio-recycling-to-the-next-level/\">https://blogs.sjsu.edu/newsroom/2023/taking-bio-recycling-to-the-next-level/</a><br><br>It looks like they are having enough success to file for a patent and investigate if this could eventually be a viable business too. But speeding this up at such early stages could be hugely beneficial to reducing mining and improving human health damaged by rare metal recovery.</p>", "parentCommentId": "e5NMoR8Dij8ZXMBqk", "user": {"username": "EcologyInterventions"}}, {"_id": "vLiAm99auR7GkmW3Y", "postedAt": "2024-02-23T17:04:15.142Z", "postId": "EkXdfzssWbrNXCmYf", "htmlBody": "<p>If you're especially motivated by environmental problems, I recommend reading the newly released book by Hannah Ritchie <i>Not the End of the World </i>(here's her <a href=\"https://www.youtube.com/watch?v=Kl3VVrggKz4&amp;ab_channel=TED\">TED talk</a> as a trailer).</p><p>I'd like to correct something I mentioned in <a href=\"https://forum.effectivealtruism.org/posts/TXjg9HavsJWFXMhGN/a-quick-review-of-resource-depletion-waste-and\">my post</a> - I implied one reason I didn't find plastic pollution impactful, is that it just doesn't have an easy fix. I no longer think that's quite true - Hannah says it actually could be solved tomorrow, if the Western leaders decided to finance waste infrastructure in developing countries. Most of ocean plastic pollution comes from a handful of rivers in Asia. Since we have this kind of infrastructure in Europe and North America, our waste is only responsible for ~5 % of the ocean plastic (<a href=\"https://ourworldindata.org/ocean-plastics\">Our World in Data</a>). Presumably, such infrastructure would also lay ground for reducing the harms coming from other waste.</p><p>I think there are two other reasons for the low attention to waste:</p><ol><li>EA is a young <a href=\"https://forum.effectivealtruism.org/posts/DdSszj5NXk45MhQoq/decision-making-and-decentralisation-in-ea\">do-ocracy</a> - i.e. everybody is trying to spot their \"market advantage\" that allows them to nudge the world in a way that triggers a positive ripple effect - and so far, everybody's attention got caught up by problems that seem bigger. While I have identified ~4 possibly important problems that come with waste in my post (diseases, air pollution, heavy metal pollution, animal suffering), if you asked a random person who lives in extreme poverty how to help them, waste probably wouldn't be on the top of their mind.</li><li>Most people are often reminded of the aesthetic harm of waste. Since people's moral actions are naturally motivated by <a href=\"https://www.youtube.com/watch?v=4jejfXcE4_I&amp;ab_channel=TheDissenter\">disgust</a>, I would presume a lot of smart people who do not take much time to reflect on their moral prioritization would already have found a way to trigger the ripple effect in this area - if there was one.</li></ol><p>While I think one would do more good if they convinced a politician to target developmental aid at alleviating diseases and extreme poverty, than if they convinced them to run the project suggested by Hannah, perhaps given the bias I mentioned in point 2), it may be that politicians are more willing to provide funding for a project that would have the ambition to eradicate ocean plastic (constituting one of these ripple effects). So if you feel motivated to embark on a similar project, best of luck! :)</p><p>(The same potentially goes for the other 2 waste projects I've suggested - supporting biogas plants and improving e-waste monitoring/worker equipment)</p>", "parentCommentId": null, "user": {"username": "Daniel_Friedrich"}}]