[{"_id": "MruMppyp8CL7XTLam", "postedAt": "2017-09-18T21:14:52.002Z", "postId": "Em7kSysc3STrH9HhQ", "htmlBody": "<p>I'd be curious to see how &quot;year joined&quot; correlates with cause area preference.</p>\n", "parentCommentId": null, "user": null}, {"_id": "LKuSoTT7RWH6sBqyz", "postedAt": "2017-09-18T23:01:47.849Z", "postId": "Em7kSysc3STrH9HhQ", "htmlBody": "<p>We actually have a post on that coming up soon, looking at how cause area preferences change over time!</p>\n", "parentCommentId": "MruMppyp8CL7XTLam", "user": {"username": "Peter_Hurford"}}, {"_id": "sTX3RjNYEbyJuMiN7", "postedAt": "2017-09-19T11:57:52.959Z", "postId": "Em7kSysc3STrH9HhQ", "htmlBody": "<p>I'm curious about disabilities demographics in EA (both mental health and physical health). As far as i can remember, the EA survey never asked that, but it seems like something relevant to ask.</p>\n<p>It might not be as relevant as i think though.</p>\n", "parentCommentId": null, "user": {"username": "Vincent-Soderberg"}}, {"_id": "kWRQN2Q5udQLw9T7P", "postedAt": "2017-09-19T18:17:31.072Z", "postId": "Em7kSysc3STrH9HhQ", "htmlBody": "<p>Are there any theories about what is driving the really high non response rate for race? Or any cross tabs about what groups or locations are more likely to have a non response for race? Racial demographics in EA is an important topic, and it's a shame that we can't get better data on it. </p>\n", "parentCommentId": null, "user": {"username": "Rick"}}, {"_id": "5fizoL5rcPjgbFPrM", "postedAt": "2017-09-19T18:56:23.623Z", "postId": "Em7kSysc3STrH9HhQ", "htmlBody": "<p>Sorry to fixate on this, but I've just never seen non response rates this high before - 10% is high in most cases of surveys, 40% is absurd. Like, yes you always have groups who feel like the answers don't accurately capture their reality, but given that you did allow for multiracial answers (and given the homogeneity of EA from a race stand point), this usually would be only a very small fraction of respondents. There's also the population that, for lack of a better term, &quot;don't believe in race&quot; and never answer this question, but given how small this population is in general, unless an absurdly high number of them are EAs then this should also only be a very small fraction.</p>\n<p>I really, really hope this isn't the explanation, but I could see at least some of these answers coming from the perspective of &quot;I don't think race is a problem in EA, and people should stop asking about it, so I'll just not answer at all as a protest or something.&quot; As someone who sees data collection as sacred, I would be appalled by this - so please, someone, for the sake of my sanity explain what could possibly drive a 40% non response rate that is not this.</p>\n", "parentCommentId": "kWRQN2Q5udQLw9T7P", "user": {"username": "Rick"}}, {"_id": "8R82e8TCDGHFqFJcz", "postedAt": "2017-09-19T22:09:44.296Z", "postId": "Em7kSysc3STrH9HhQ", "htmlBody": "<p>I wondered if the oddly high portion of refusal to answer was ideological, too. I hope this isn't the case and inclined to think it's unlikely; though there seem to be some EAs who are wary of questions regarding this kind of diversity, as they reject it is something to be tackled within the movement, I would not have thought that proportion (or rather the proportion who hold the view to the point of refusing the data altogether) would be as large as this.</p>\n<p>It feels rather optimistic to suggest this is an issue of categorisation e.g. though the answers on race were not exclusive, which would be obviously problematic, most race sections on this type of survey that I'm used to have a more fine-grained response options. However, it seems even if this were an issue it ought not cause problems for such a large proportion of respondents.  </p>\n<p>It's maybe worth noting the comparative proportion of respondents who did not answer political leanings (42.7%). If nothing else I think the number of people who refused response on race would be more bizarre/worrying if there was a very high response rate on everything else. My first thought was that refusal to answer on political leanings is likely idealogical (wariness of EA being especially associated with any specific political position) but on second thoughts I wonder if this is more likely to be a category problem? (It may be that people are reluctant to select &quot;other&quot; because their political stance is subsumed within left/right/centre etc, but they feel it is not well described by these options...? However, I'm not confident how likely this is and do not have a background in the intricacies of data gathering - unlike, I assume, those and ReThink who put this together.)</p>\n", "parentCommentId": "5fizoL5rcPjgbFPrM", "user": {"username": "ELW"}}, {"_id": "KvwSr4ipiraPc7N6K", "postedAt": "2017-09-19T23:21:34.663Z", "postId": "Em7kSysc3STrH9HhQ", "htmlBody": "<p>I can see how the non-response rate looks alarming and I definitely owe some context for that. </p>\n<p>One thing we tried this year was a separate donations only survey, where people only reported their donations and a few other questions. Race was not on this slimmer survey. 554 did not answer this race question because they were never asked it.</p>\n<p>Another source of apparent non-response is the fact that we asked people Yes or No for four different races (White, Black, Asian, and Hispanic). It looks like some people checked &quot;Yes&quot; for one race but did not explicitly check &quot;No&quot; for the others. This accounts for another 120 people.</p>\n<p>Combining these first two reasons, there are only 67 people genuinely ignoring the race question. You then have to account for survey fatigue, where people answer some of the questions at the beginning of the survey, but then get bored, busy, or distracted and quit the survey without answering the rest of the questions. Given that race was at the bottom of the seventh page of the survey, this could be acute. I couldn't find anyone who neglected to answer the race question but did answer a question after the race question, so it looks like these three factors may fully account for all non-response.</p>\n", "parentCommentId": "kWRQN2Q5udQLw9T7P", "user": {"username": "Peter_Hurford"}}, {"_id": "8bN7fzyeoC8q9Lwe5", "postedAt": "2017-09-19T23:22:23.511Z", "postId": "Em7kSysc3STrH9HhQ", "htmlBody": "<p>The answer looks to be pretty simple and unimportant, <a href=\"http://effective-altruism.com/ea/1ex/demographics_ii/byb\">as I explain in this comment</a>.</p>\n", "parentCommentId": "5fizoL5rcPjgbFPrM", "user": {"username": "Peter_Hurford"}}, {"_id": "W8MeKrRfYk6YPuGJo", "postedAt": "2017-09-20T02:31:42.742Z", "postId": "Em7kSysc3STrH9HhQ", "htmlBody": "<p>Oh thank goodness, I am glad it is nothing worrying. Thank you for clarifying!</p>\n", "parentCommentId": "8bN7fzyeoC8q9Lwe5", "user": {"username": "Rick"}}, {"_id": "8eZWN3mpn4AR2Z2ub", "postedAt": "2017-09-20T13:11:29.572Z", "postId": "Em7kSysc3STrH9HhQ", "htmlBody": "<p>That's still a very important point that doesn't seem to have been made in the analysis here: the demographic questions were not included in the questions put to all respondents. Since there are good reasons to think that people taking the &quot;full&quot; and &quot;donations only&quot; survey will differ systematically (e.g. more likely to have been involved with EA for longer). If the non responses are not random that's an important caveat on all these findings and very much limits any comparisons that can be done over time. I can't seem to see it discussed in the post?</p>\n", "parentCommentId": "KvwSr4ipiraPc7N6K", "user": {"username": "Bernadette_Young"}}, {"_id": "8EdfgGja2F22HXDQb", "postedAt": "2017-09-20T19:50:10.900Z", "postId": "Em7kSysc3STrH9HhQ", "htmlBody": "<p>Yeah. I <em>personally</em> think that offering the donations only survey was a bad idea for the reason that you said and a few other reasons.</p>\n<p>Even if everyone took the full survey, the non-response would still be pretty non-random -- you still have to have the tenacity to persist to page seven, which I imagine correlates with being more involved in EA and you also have to have taken the survey in the first place, which we also know is not random. It would have been nice to not make this worse, though.</p>\n", "parentCommentId": "8eZWN3mpn4AR2Z2ub", "user": {"username": "Peter_Hurford"}}, {"_id": "PnvgovvhwY8c6fBaz", "postedAt": "2017-10-03T03:29:49.580Z", "postId": "Em7kSysc3STrH9HhQ", "htmlBody": "<p>Mentioned this to Tee -- I would love to see both (1) turnover data, and (2) previous (pre-EA) work with or donations to non-profits/other previous altruistic pursuits.</p>\n<p>For the latter, the survey could maybe ask how much volunteer time, career hours, and money respondents previously put into charity, maybe in the last year and/or five and/or lifetime before finding EA. It could also offer categories for the charities' cause areas.</p>\n<p>Relatedly, whether the respondent was vegetarian or vegan before finding EA would be interesting, and/or some scale about how important they thought issues faced by nonhumans were. Maybe for each of several cause areas (not just the big three) a scale of how important (not necessarily relatively, just &quot;not at all important&quot; to &quot;very important&quot;?) they thought the issue was before coming to EA.</p>\n", "parentCommentId": null, "user": {"username": "Kelly_Witwicki"}}, {"_id": "4uCX8N6DWgMvK3zKZ", "postedAt": "2017-10-03T03:35:19.550Z", "postId": "Em7kSysc3STrH9HhQ", "htmlBody": "<p>Seeing how e.g. depression correlates with cause area preferences would be interesting.</p>\n", "parentCommentId": "sTX3RjNYEbyJuMiN7", "user": {"username": "Kelly_Witwicki"}}, {"_id": "2ET96meEPfLrYXTeD", "postedAt": "2017-10-03T03:36:34.949Z", "postId": "Em7kSysc3STrH9HhQ", "htmlBody": "<p>I would also be interested to see a question for what value people assign to life on Earth at present.</p>\n<p>I imagine for instance this is much higher, and may even be the difference between highly positive and highly negative, for EAs who are most concerned with x-risk as compared to those more interested in animal farming. (And more obviously, s-risk, but it would still be interesting to quantify the difference, if just in terms of e.g. &quot;highly negative&quot; to &quot;highly positive&quot;.)</p>\n", "parentCommentId": "PnvgovvhwY8c6fBaz", "user": {"username": "Kelly_Witwicki"}}, {"_id": "WrEG6QG9JvniSErRD", "postedAt": "2017-10-24T15:20:36.954Z", "postId": "Em7kSysc3STrH9HhQ", "htmlBody": "<p>Also, could respondents not say anything about being e.g. Native American, Middle Eastern, or at least &quot;Other&quot;? I'm sure the structure of these questions has been thoroughly discussed in social sciences literature and I don't think the options shown here are in line with the standard style.</p>\n", "parentCommentId": "KvwSr4ipiraPc7N6K", "user": {"username": "Kelly_Witwicki"}}, {"_id": "ksm7JSaJuQWCiaGEh", "postedAt": "2017-10-25T00:37:27.685Z", "postId": "Em7kSysc3STrH9HhQ", "htmlBody": "<p>These were not options that we presented, but people could implicitly answer &quot;Other&quot; by not answering &quot;Yes&quot; to any of the race questions. We'd be happy to revisit this question if you think we should include additional races or an explicit &quot;Other&quot; option.</p>\n", "parentCommentId": "WrEG6QG9JvniSErRD", "user": {"username": "Peter_Hurford"}}]