[{"_id": "wi3MNuJWrfTyfhqbL", "postedAt": "2023-05-09T16:54:21.299Z", "postId": "EoqeJCBiuJbMTKfPZ", "htmlBody": "<p>Interesting results!</p><p>Does \"TE\" in the graphs mean \"Time 1: Why Uncontrollable AI Looks More Likely Than Ever | Time\" and \"Time 2\" mean \"Time 2: The Only Way to Deal With the Threat From AI? Shut It Down | Time\"? I was a bit confused.</p>", "parentCommentId": null, "user": {"username": "Gabe Mukobi"}}, {"_id": "DvPYKhFdynkZpKarR", "postedAt": "2023-05-10T10:08:56.616Z", "postId": "EoqeJCBiuJbMTKfPZ", "htmlBody": "<p>Thanks Gabriel! Sorry for the confusion. TE stands for The Economist, so this item: https://www.youtube.com/watch?v=ANn9ibNo9SQ</p>", "parentCommentId": "wi3MNuJWrfTyfhqbL", "user": {"username": "Otto"}}, {"_id": "ADviNdh2oZrFKJ9wa", "postedAt": "2023-05-11T06:19:37.680Z", "postId": "EoqeJCBiuJbMTKfPZ", "htmlBody": "<p>I am a big fan of this research! Good to measure the effectiveness of an intervention.&nbsp;<br>And awesome you jumped on this so quickly after the pause letter!<br>Hopeful stuff!&nbsp;<br>Maybe you could use this study to get funding for a bigger study? Maybe hire Americans to go door to door to ask them to participate for a more representative sample? Or get a bigger research corp to do it for you?&nbsp;<br>A question. I think there is a mistake in 8. It says:<br><br>Figure 8: Change in public opinion on AI moratorium per the Pause Government indicator of participants that chose the answer No for Pause Laboratories</p><p><br>But from what it says above the figure, I get the impression that this figure is about the subset of people that answered Yes to the Pause Laboratories indicator. That this subset of people's results on the government pause indicator are shown. Am I correct? In the figure 8 description, it says it shows the people who answered No for the Pause Laboratories.&nbsp;</p>", "parentCommentId": null, "user": {"username": "AlexFromSafeTransition"}}, {"_id": "rAAqwqwzL8hiHgXjB", "postedAt": "2023-05-30T20:41:18.395Z", "postId": "EoqeJCBiuJbMTKfPZ", "htmlBody": "<p>What do you think of your sample size? Is it hard to draw inferences from 300 people?</p>\n<p>Also I'd be careful about drawing inferences from data via Prolific without attempts to reweigh the sample for representativeness. The raw Prolific crew is quite liberal and quite educated. 74% of them voted for Joe Biden over Donald Trump.</p>\n", "parentCommentId": null, "user": {"username": "Peter_Hurford"}}, {"_id": "KyGYs3MggTy9dkagp", "postedAt": "2023-06-01T13:49:32.402Z", "postId": "EoqeJCBiuJbMTKfPZ", "htmlBody": "<p>Hi Peter, thanks for your comment. We do think the conclusions we draw are robust based on our sample size. If course it depends on the signal: if there's a change in e.g. awareness from 5% to 50%, a small sample size should be plenty to show that. However, if you're trying to measure a signal of only 1% difference, your sample size should be much larger. While we stand by our conclusions, we do think there would be significant value in others doing similar research, if possible with larger sample sizes.</p><p>Again, thanks for your comments, we take the input into account.</p>", "parentCommentId": "rAAqwqwzL8hiHgXjB", "user": {"username": "Otto"}}]