[{"_id": "QBmxJvFXSEWEYSxqt", "postedAt": "2023-11-16T08:46:43.662Z", "postId": "EPB3kSwEAx6HYJNaA", "htmlBody": "<p>Maybe a link is missing or the embed function isn't working on my phone? As I'm not seeing anything.</p>\n<p>(Also, do you have a transcript you could post?)</p>\n", "parentCommentId": null, "user": {"username": "SiebeRozendal"}}, {"_id": "ccgxA5EHDqLhpxvWX", "postedAt": "2023-11-16T09:02:46.289Z", "postId": "EPB3kSwEAx6HYJNaA", "htmlBody": "<p>The TED talk is embedded on PC</p>", "parentCommentId": "QBmxJvFXSEWEYSxqt", "user": {"username": "JohnSnow"}}, {"_id": "LKPzeGt2Yyb2df6Nt", "postedAt": "2023-11-16T10:54:26.907Z", "postId": "EPB3kSwEAx6HYJNaA", "htmlBody": "<p>YouTube link here: <a href=\"https://www.youtube.com/watch?v=WX_vN1QYgmE\">https://www.youtube.com/watch?v=WX_vN1QYgmE</a> (it's embedded in the post, as JohnSnow points out — not sure if something is breaking for you?)</p><p>Transcript here: <a href=\"https://www.ted.com/talks/liv_boeree_the_dark_side_of_competition_in_ai/transcript\">https://www.ted.com/talks/liv_boeree_the_dark_side_of_competition_in_ai/transcript</a>&nbsp;</p>", "parentCommentId": "QBmxJvFXSEWEYSxqt", "user": {"username": "Lizka"}}, {"_id": "6ZqzLGenEpM6vrHfz", "postedAt": "2023-11-16T14:03:25.414Z", "postId": "EPB3kSwEAx6HYJNaA", "htmlBody": "<p><strong>Executive summary</strong>: Competition can drive innovation but also create traps that lead to lose-lose outcomes. This dynamic is happening in AI and needs wise leadership to avoid catastrophe.</p><p><strong>Key points</strong>:</p><ol><li>AI filters create body dysmorphia. News media sensationalizes. These competitions lead to lose-lose outcomes.</li><li>Many global problems like pollution arise from misaligned incentives and game theory.</li><li>The AI race risks sacrificing safety in pursuit of capabilities. This is like a trap set by the ancient god Moloch.</li><li>Historical treaties show we can coordinate to escape traps. AI leaders should focus on alignment and safety.</li><li>Steps like Anthropic's scaling policy point the way, but much more leadership is needed to avoid catastrophe.</li><li>We must change the AI game into a race to the top of safety and ethics.</li></ol><p>&nbsp;</p><p><i>This comment was auto-generated by the EA Forum Team. Feel free to point out issues with this summary by replying to the comment, and</i><a href=\"https://forum.effectivealtruism.org/contact\"><i>&nbsp;<u>contact us</u></i></a><i> if you have feedback.</i></p>", "parentCommentId": "LKPzeGt2Yyb2df6Nt", "user": {"username": "SummaryBot"}}, {"_id": "Bo7DXme5yZDFjeScu", "postedAt": "2023-11-18T13:23:55.171Z", "postId": "EPB3kSwEAx6HYJNaA", "htmlBody": "<p>Thanks!</p>\n", "parentCommentId": "LKPzeGt2Yyb2df6Nt", "user": {"username": "SiebeRozendal"}}, {"_id": "yXf5MbTCdokJghF85", "postedAt": "2023-11-18T21:31:57.442Z", "postId": "EPB3kSwEAx6HYJNaA", "htmlBody": "<p>I liked the talk. I also loved the boots! Great job.</p>\n", "parentCommentId": null, "user": {"username": "HakonHarnes"}}, {"_id": "rtm6t5jfNpcFfxFr2", "postedAt": "2023-11-22T22:43:22.478Z", "postId": "EPB3kSwEAx6HYJNaA", "htmlBody": "<p>In terms of feedback/reaction: I work on AI alignment, game theory, and cooperative AI, so Moloch is basically my key concern. And from that position, I highly approve of the overall talk, and of all of the content in particular --- except for one point, where I felt a bit so-so. And that is the part about what the company leaders can do to help the situation.</p><p>The key thing is 9:58-10:09 (\"We need leaders who are willing to flip the Moloch's playbook. ...\") , but I think this part then changes how people interpret 10:59-10:11 (\"Perhaps companies can start competing over who ... \"). I don't mean to say that I strongly disagree here --- rather, I mean that this part seems objectively speculative, which was in contrast with everything else in the talk (which seemed super solid).</p><p>More specifically, the talk's formulation suggested to me that the key thing is whether the leaders would be <i>willing</i> to not play the Moloch game. In contrast, it seems quite possible that this by itself wouldn't help at all, for example because they would just get fired if they tried. My personal guess is that \"the key thing\" is affordance the leaders have for not playing the Moloch game / the costs they incur for doing so. Or perhaps the combination of this and the willingness to not play the Moloch game. And this is also how I would frame the 10:59-10:11 part --- that we should try to <i>make it such </i>that the companies <i>can </i>compete on those other things that turn this into a race to the top. (As opposed to \"the companies should compete on those other things\".)</p>", "parentCommentId": null, "user": {"username": "Pivocajs"}}]