[{"_id": "FGKuAMrzyZwdivkoQ", "postedAt": "2023-07-14T07:48:24.265Z", "postId": "EPcMLx6kYvkDiX8LG", "htmlBody": "<p>Thanks for being somewhere people can put stories like this. To readers, agreevote if you think this is good, disagreevote if you think it's bad.</p><blockquote><p><i>I got an EA job! It’s a temporary role in the US. Unfortunately they’re not able to sponsor a visa but they’re fine with me working from their office as a “tourist”. How big a deal are work visas? Should I be worried?</i></p></blockquote>", "parentCommentId": null, "user": {"username": "nathan"}}, {"_id": "3sCtkGxevsH5zPBNK", "postedAt": "2023-07-14T15:36:11.587Z", "postId": "EPcMLx6kYvkDiX8LG", "htmlBody": "<p>Not too sure about this one. I think \"good\" is a bit strong of phrasing, but ask me \"What's the better world?\" and I think that the pretend tourist world might be, so I agreevoted. It's risky, to be sure, and the negatives certainly should be on the table and considered.&nbsp;</p><p>But on the other side, even the process for temporary work visas is a nightmare, and while I would much prefer to try to change legislation rather than try to go around it, I think communicating clearly both the negatives and positives and allowing the person to take their decision into their own hands seems plausibly like a good answer here.&nbsp;</p><p>But of course, I am considering this locally and not factoring in potential reputation negatives or any of that. But I suppose, given that I think some people with short timelines aren't crazy, and that there is a lot of important work to be done now, it could be worth the tradeoff. That is to say, it probably isn't the decision I'd make, but I can understand how another might sensibly come to making it.&nbsp;</p>", "parentCommentId": "FGKuAMrzyZwdivkoQ", "user": {"username": "tswizzle96"}}, {"_id": "j4a5EZ9Wfip2vfbvL", "postedAt": "2023-07-14T16:16:34.128Z", "postId": "EPcMLx6kYvkDiX8LG", "htmlBody": "<p>I'd highlight that \"our cause is so important that it's OK to break the law\" has certain corrosive effects. I'm not suggesting that it's never warranted to break the US Code, but submit there should be a thumb on the \"no\" side of that scale because it's easy to underweight that corrosion.</p>\n", "parentCommentId": "3sCtkGxevsH5zPBNK", "user": {"username": "Jason"}}, {"_id": "bRxN23AGQM2u8xxAq", "postedAt": "2023-07-14T16:47:35.363Z", "postId": "EPcMLx6kYvkDiX8LG", "htmlBody": "<p>What situations do think could be warranted if you think that \"never\" is not the appropriate reaction?&nbsp;</p><p>I have no idea as to how to model the potentially corrosive effects, beyond pointing to some potential consequences in name and imagining they could be quite bad, it would seem like thumbing the no button would just become a perpetual pressing the no until I learned more. Which maybe is fine? But then again, if there are some situations where it is okay, how would you resolve them with any confidence?</p>", "parentCommentId": "j4a5EZ9Wfip2vfbvL", "user": {"username": "tswizzle96"}}, {"_id": "XYZde6NwunHCpBbNs", "postedAt": "2023-07-14T20:40:26.027Z", "postId": "EPcMLx6kYvkDiX8LG", "htmlBody": "<p>Agree this seems bad. Without commenting on whether this would still be bad, here's one possible series of events/framing that strikes me as less bad:<br>- Org: We're hiring a temporary contractor and opening this up to international applicants<br>- Applicant: Gets the contract<br>- Applicant: Can I use your office as a working space during periods I'm in the states?<br>- Org: Sure</p><p>This maybe then just seems like the sort of thing the org and applicant would want to have good legal advice on (I presume the applicant would in fact look for a B1/B2 visa that allows business during their trip rather than just tourism)</p>", "parentCommentId": "FGKuAMrzyZwdivkoQ", "user": {"username": "CalebWithers"}}, {"_id": "jSCp9bHuqzbSY7KD5", "postedAt": "2023-07-14T22:52:05.950Z", "postId": "EPcMLx6kYvkDiX8LG", "htmlBody": "<p>I don't have a fleshed-out model of when it's OK to break the law due to exigent circumstances or otherwise, but people have written many books on that (e.g., the existence of the much discussed, but never observed \"ticking-bomb terrorist\").</p><p>I think the corrosive effect is something like cumulative on an individual, organizational, and even epistemic-community level. Thus, the decision on when to risk its corrosive power should probably take both absolute magnitude and relative magnitude of the objective to be gained into consideration. It is probably necessary, but maybe not sufficient, that the situation be extra-ordinary from <i>both </i>perspectives.&nbsp;</p><p>For example and limiting the analysis to corrosive effects only, the average person's threshold for when to break the law due to the importance of their mission can probably be lower than a senior government leader's threshold. The latter will frequently be on an important mission, and at greater risk of experiencing a heavy cumulative dose of corrosion.&nbsp;</p>", "parentCommentId": "bRxN23AGQM2u8xxAq", "user": {"username": "Jason"}}, {"_id": "RYAgFtHRGamZCWCnw", "postedAt": "2023-07-16T15:00:03.537Z", "postId": "EPcMLx6kYvkDiX8LG", "htmlBody": "<p>Ah okay that seems like a step towards a more solid metric to me: is what I'm doing (some thing that necessitates breaking the law) truly of potential extraordinary impact?&nbsp;</p><p>This of course would need further definition because extraordinary can be relative, but combine this requirement with placing greater weight on avoiding corrosion at a organizational and community level, and it will probably work out where you will effectively never break the law, but doesn't completely shut the doors.&nbsp;</p><p>A further question would be if you think the chance you get caught should factor in? Say this person thinks there is a 0.0001% chance they get caught doing this, is that enough to override the more caution oriented principle above? Do you think its still not worth it because its corrosive effects don't just come from getting caught but also just undertaking the action at all?</p>", "parentCommentId": "jSCp9bHuqzbSY7KD5", "user": {"username": "tswizzle96"}}, {"_id": "bqnrtyccirxRTkkvh", "postedAt": "2023-07-16T16:38:44.487Z", "postId": "EPcMLx6kYvkDiX8LG", "htmlBody": "<p>The corrosive effects generally occur when one breaks the law due to the perceived importance of one's mission. Getting \"caught\" is not necessary, although more widespread knowledge of the breach may intensify the corrosive effect. You know, and the organization and community may know, that you broke the law because you thought your mission was special enough that it put you above the law. That is a perilous attitude to hold; it may lead to <a href=\"https://en.wikipedia.org/wiki/Crime_and_Punishment\">murdering an elderly pawnbroker</a> and other problematic acts.</p><p>Note that breaking the law for other reasons -- e.g., this dog-leash law makes no sense when my dog is well-trained and there's no one around for 400 feet -- does not necessarily pose a risk of corrosion. It's acting like you have a special exemption that poses heightened risk.<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefj3l4oxd1hos\"><sup><a href=\"#fnj3l4oxd1hos\">[1]</a></sup></span></p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnj3l4oxd1hos\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefj3l4oxd1hos\">^</a></strong></sup></span><div class=\"footnote-content\"><p>Civil disobedience can be tricky, but it is often performed publicly and in full knowledge that the person will be submitting to the punishment set by the laws. Moreover, it is often targeted at laws one strongly believes are unjust, and \"this is a seriously unjust law\" is generally a non-corrosive reason for disobeying it. Thus, civil disobedience generally does not pose the same risks of creating problematic beliefs and patterns of action than silent disobedience of laws that one believes are OK to slightly bad as generally applied.</p></div></li></ol>", "parentCommentId": "RYAgFtHRGamZCWCnw", "user": {"username": "Jason"}}, {"_id": "jRq6mpFoDNNzBSuCG", "postedAt": "2023-07-16T18:14:15.229Z", "postId": "EPcMLx6kYvkDiX8LG", "htmlBody": "<p>I agree with the importance of upholding laws (and for that matter, even societal or field-specific norms). A point of confusion for me is whether it matters (and how much) that the laws in question are just laws vs unjust ones.&nbsp;</p>", "parentCommentId": "j4a5EZ9Wfip2vfbvL", "user": {"username": "Linch"}}]