[{"_id": "zKcFZsXwdzLxGDx8m", "postedAt": "2022-12-20T21:43:52.993Z", "postId": "EPpc2NFu4DTy6rNA3", "htmlBody": "<p>If your analysis is correct, why is purchasing exactly ONE Abbey the correct decision? If meeting venues in general earn money and appreciate in value, then every dollar people donated to philanthropic causes would be better spent on more meeting venues, until the market is saturated with meeting venues and they cease to earn returns that make it worthwhile.</p>\n<p>For that matter, why invest in real estate at all? A diversified portfolio of stocks and shares would give a higher rate of return and hedge against real-estate specific risk, such as another pandemic. I'm fairly sure you could get better than  2.4% if you were prepared to lock your money up for 8522 days.</p>\n<p>It seems to me that your argument proves far too much, and is missing a very important ethical consideration that EA is primarily about doing altruism - there are critically important causes that need funding NOW, not funded at a higher rate in 20 years. The competing use of money is these causes, not real estate investment returns</p>\n", "parentCommentId": null, "user": {"username": "FHenshaw"}}, {"_id": "vnDgBopm5cWnayHdt", "postedAt": "2022-12-21T03:53:27.693Z", "postId": "EPpc2NFu4DTy6rNA3", "htmlBody": "<p>I'm not going to make a comment on whether the Abbey was a good purchase or not but 2.4% rent yield is terrible for a real estate purchase. You aren't factoring in maintenance costs, property taxes, cost of capital, etc. which usually end up being around 5%</p><p>When looking at an investment, you always have to look at the counterfactual.&nbsp;<br>Let's look at 15M GBP invested at an ~8% annual return for 8522 days (23.34 years) while withdrawing $88,000/year to pay for 50 days/year of $1760/day of renting a venue. <a href=\"https://docs.google.com/spreadsheets/d/1g8GLrt1xQNolDaYTOG8aTsaIh-bm53jQg5rWzYH5O5s/edit?usp=sharing\">https://docs.google.com/spreadsheets/d/1g8GLrt1xQNolDaYTOG8aTsaIh-bm53jQg5rWzYH5O5s/edit?usp=sharing</a></p><p>We end up with ~$82.7M. Conversely, a reasonable growth rate for a piece of real estate is something in the realm of 2-5%/year. So buying the Abbey, using it, paying no taxes(I don't know about this) and paying no maintenance (unrealistic) and no financing (since we put the money in up front), the Abbey will be worth $23-46M upon which we sell it.</p><blockquote><p>It is Equivalent of buying a house or renting one. Of course you would buy one if you had the funds without causing your personal finances to break.</p></blockquote><p><br>This just isn't true many factors come into this and on the whole it is definitely not a general rule to buy&gt;rent.</p><p>Lastly, I don't think we want Open Phil, CEA or EVF to be making (financial) investment decisions. The decisions need to be based on some sort of cost-benefit analysis of utility or social (not financial) returns.<br><br>Side note: A lot of people will mistakenly believe that real estate is an amazing investment, likely because&nbsp;<br>1. Their parents (I'll assume the bulk of EAs are between 20-30 and thus their parents are 40-70 years old) will have done extremely well on their real estate purchases.<br>2. Society portrays this as some magic investment where the asset appreciates and you get a payment every year (stocks do this too) and as a magic gateway to the middle class or above.<br><br>The reason that your parents did really well on their home purchases was because they took on a lot of leverage (through loans/a mortgage) at a time where interest rates were at historical lows and sustained there for a lot of time. Most of that time, from 2002-2021, interest rates were below 2%, often just over 0% and real interest rates were negative. These conditions are an anomaly and it is quite unlikely they will hold for the foreseeable future and definitely not with enough certainty upon which to base a multi-year investment.</p><p>It makes a good amount of sense that real estate will yield less than stocks because real estate is a static asset which mainly increases in value due to inflation, increase in population (demand increase) and interest rate changes, not generating anything new while stocks represent ownership of businesses which makes goods and services and sells them at a profit and you get a percentage of that profit. This is born out by looking at long run returns of assets where stocks will outperform real estate significantly. Real estate earned an average real return of 1.3% and stocks returned 5.2% from 1900 to 2007.</p>", "parentCommentId": null, "user": {"username": "MarcusAbramovitch"}}, {"_id": "4EJz4DZrvTiBK4mRD", "postedAt": "2022-12-21T13:57:13.532Z", "postId": "EPpc2NFu4DTy6rNA3", "htmlBody": "<p>Actually I tried to mention that I was not commenting on the ethics of the purchase just the economics as an organisation in the title but maybe that wasn't good enough?</p>\n<p>I also very foolishly made a mistake as we use 1 Lakh here instead of 100K.\nThe new values would further make the arguments stronger.</p>\n", "parentCommentId": "zKcFZsXwdzLxGDx8m", "user": {"username": "Priyanshu Upadhyay"}}, {"_id": "KsexSznnKXeGqmbKS", "postedAt": "2022-12-21T14:36:24.826Z", "postId": "EPpc2NFu4DTy6rNA3", "htmlBody": "<p>I agree with most of your views but actually ended up making a foolish conversion error on my part. The new values would make more sense?</p>\n", "parentCommentId": "vnDgBopm5cWnayHdt", "user": {"username": "Priyanshu Upadhyay"}}, {"_id": "vosp43mtDX5TnxNCy", "postedAt": "2022-12-21T14:37:57.793Z", "postId": "EPpc2NFu4DTy6rNA3", "htmlBody": "<p>No. 17.6k/day for a 40 person venue is absurd.</p>", "parentCommentId": "KsexSznnKXeGqmbKS", "user": {"username": "MarcusAbramovitch"}}, {"_id": "tJNFHmsMJxGkBGHYZ", "postedAt": "2022-12-21T16:32:29.189Z", "postId": "EPpc2NFu4DTy6rNA3", "htmlBody": "<p>That comes around 440 Pounds per head, Adjusted for parity w.r.t my economy it is roughly 15K Indian Rupees which is the cost of a good venue here in Bangalore. Mind you accommodation &nbsp;alone might be cheaper but here we pay for the conference rooms, dining halls etc.&nbsp;</p><p>What is it like where you live would you try to check with some actual data?</p><p><a href=\"https://data.oecd.org/conversion/purchasing-power-parities-ppp.htm\">https://data.oecd.org/conversion/purchasing-power-parities-ppp.htm</a></p><p>Here is the link to an organisation that provides PPP data.</p>", "parentCommentId": "vosp43mtDX5TnxNCy", "user": {"username": "Priyanshu Upadhyay"}}]