[{"_id": "NnAhEnbeXotCmJBHK", "postedAt": "2023-03-22T20:51:09.973Z", "postId": "EPTxTyxwEhg8KMZM8", "htmlBody": "<blockquote><p>However, if you’re thinking about consumption rather than income (as you should), there is a difference which does make the comparison to “$1.25 living in the US” misleading: in the US you just can’t buy the sort of low-quality goods that you can in developing countries.</p></blockquote><p>Can you give some examples for what these low quality goods are?<br>&nbsp;</p><p>(I notice this is an old post, but I read it for the first time today.)</p>", "parentCommentId": null, "user": {"username": "Linda Linsefors"}}, {"_id": "Wq3HmPoRyjBsxECfx", "postedAt": "2023-03-22T22:23:23.039Z", "postId": "EPTxTyxwEhg8KMZM8", "htmlBody": "<p>It's things like a house in a slum made from corrugated iron or mud, with no electricity and a shared latrine pit instead of plumbing, which gets periodically flooded. The rent for something like this in the US would be very cheap, but this option doesn't exist since there's so few people who are poor enough to pay for it (and it's illegal too).</p><p>Likewise cheaper foods like cassava dough that you couldn't find in stores in the US, dentistry from a random person without training, water that isn't clean etc.</p>", "parentCommentId": "NnAhEnbeXotCmJBHK", "user": {"username": "Benjamin_Todd"}}, {"_id": "JxPaHhWxKauRjtbqh", "postedAt": "2024-02-14T14:57:49.640Z", "postId": "EPTxTyxwEhg8KMZM8", "htmlBody": "<p>This is so shocking that I think most of us (me certainly) tend to gloss over it, kind of vaguely assuming that they're probably doing fine, because it hurts too much to actually think about what it would be like.<br><br>Using the latest numbers (2022), there are 719 million people living under the latest world poverty line, which is now $2.15.&nbsp;<br><br>GiveDirectly finds that giving a poor family about $500<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefttqh46zv7fh\"><sup><a href=\"#fnttqh46zv7fh\">[1]</a></sup></span>&nbsp;makes a dramatic difference for them. If we assume that 719 million is about 200 million households, it would only take half of the fortune of one of our tech billionaires (Bezos, Zuckerberg, Musk) to provide $500 to every family living below the poverty line.&nbsp;<br><br>It's just utterly insane that we don't do this. I'm not saying this is necessarily the most effective way to help them (I know other initiatives are more impactful, at least among certain target audiences), but surely something this basic, which is so obviously impactful and costs so little (less than 5% of what we spend on weapons every year - and yes, I know it's a simplistic comparison and we can't let Putin rule the world either ... ).&nbsp;<br><br>I don't even have a suggestion. I'm just imagining an alien being coming to our planet and seeing such poverty and how little is being done to help, and our \"leaders\" trying to explain why they would rather buy the latest multibillion dollar weapons than help people in dire poverty with just a tiny fraction of that money.&nbsp;</p><p>&nbsp;<br><br>&nbsp;</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnttqh46zv7fh\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefttqh46zv7fh\">^</a></strong></sup></span><div class=\"footnote-content\"><p>Just picking a round number that has frequently been tested and seems to consistently prove impactful. Definitely if someone from GiveDirectly tells you differently, they are right and I am wrong ...&nbsp;</p></div></li></ol>", "parentCommentId": null, "user": {"username": "Denis "}}]