[{"_id": "ccRfwL8eBDJ89hhjB", "postedAt": "2023-05-03T03:37:27.069Z", "postId": "EpyJMXZTqLDiKaXzu", "htmlBody": "<p>Thank you so much Habiba, especially and as you mentioned women probably should not do the heavy lifting on issues around sexual misconduct. I want to take the opportunity for especially men to reach out to me if they want to talk about these issues. I am especially keen to hear from men who have mixed feelings about recent events in EA. The reason for me doing this is so that I can hopefully do something useful to improve the situation in our community. But before I do any \"fixing\", I want to understand what I am stepping into and what I am attempting to fix.&nbsp;<br><br>I should perhaps also mention that my previous self was no angel when it came to the treatment of women, so I think I am especially good at listening to men who have conflicted feelings (but I should say that I think I have made progress on becoming a better person - I aspire to be an ally).</p>", "parentCommentId": null, "user": {"username": "Ulrik Horn"}}, {"_id": "9ZA8mhD3BgSm7wgHx", "postedAt": "2023-05-03T09:53:26.480Z", "postId": "EpyJMXZTqLDiKaXzu", "htmlBody": "<p>Thanks so much for making this offer Ulrik! I think it is really helpful for there to be a range of folks that people can reach out to :)</p>\n", "parentCommentId": "ccRfwL8eBDJ89hhjB", "user": {"username": "Habiba"}}, {"_id": "fYQQya5rnXgzwZcvk", "postedAt": "2023-05-15T00:40:02.286Z", "postId": "EpyJMXZTqLDiKaXzu", "htmlBody": "<p>Thank you so much for taking the time to write this up, Habiba!</p><p>I just want to call out what I felt was one of the most valuable parts of this post for me with respect to online conversations:</p><p>&gt; a number of men that I knew where horrified / shocked / shaken but felt some combination of a) anxiety about saying the wrong thing, b) nervousness about taking up space, c) hesitation about just offering words which seemed insubstantial / performative / just virtue signalling, and d) hesitation about having nothing novel or particularly insightful to say</p><p>&gt; I think these hesitations were totally understandable - in the wider world (particularly contemporary American culture) there is a strong emphasis on platforming those affected and a push that we need stronger deeds than just words. However, I think the discourse in EA isn’t that mature yet! That means the simply the way that the online discourse goes and whether \"basic\" stuff gets said, feels more important at this stage.</p>", "parentCommentId": null, "user": {"username": "nsherb"}}, {"_id": "eYzYNn2JhNxpigSpM", "postedAt": "2023-09-13T13:15:46.934Z", "postId": "EpyJMXZTqLDiKaXzu", "htmlBody": "<p>Firstly, thank you in general for writing this up, this is an important piece of information and creates common knowledge and norms around how to behave related to the topic.<br><br>\"You still control your own social circle - you don’t have to be friends with jerks just because they are EAs.\"<br><br>Joining EA at a subjectively still young and starry-eyed age, I equated anyone associating with EA as \"living up to the EA principles\". Now being older and more experienced, I see many younger people in EA making the same mistake. By now, I'm convinced that e.g. interest in ethics and actual ethical behavior and character correlate only very mildly. Similarly, there are many people in EA who are not particularly ethical either. Humans are still humans.&nbsp;<br><br>&nbsp;</p>", "parentCommentId": null, "user": {"username": "annaleptikon"}}]