[{"_id": "qKqmSx7B5LddFMTKR", "postedAt": "2022-10-19T17:48:07.765Z", "postId": "Eq8nwNPNhfXvt2TWj", "htmlBody": "<p>Thanks for posting this, Luisa!<br><br>Depression is a beast that can affect anyone. While I have been lucky enough to evade it, I know plenty of others who suffer from it.<br><br>It's really cool that you kept such detailed logs of your mood, wellbeing, and side effects! Your analysis is very thorough. I hadn't heard of \"brain zaps\" before! This information will no doubt be useful to others.<br><br>I truly wish you the best on your journey toward fulfilment and happiness!</p>", "parentCommentId": null, "user": {"username": "Christian Pearson"}}, {"_id": "ghnTbvEviqygkNmRC", "postedAt": "2022-10-19T17:52:36.093Z", "postId": "Eq8nwNPNhfXvt2TWj", "htmlBody": "<p>Strong upvoted, I found this very interesting and I expect that quite a few people will find it helpful.&nbsp;</p><p>I don't know if it's been posted here before, but Scott Alexander has a <a href=\"https://lorienpsych.com/2021/06/05/depression/#23_What_kind_of_medications_help_with_depression\">detailed writeup on depression treatment</a> that people may also find useful, including information on the order he often has his patients try medications in.&nbsp;</p>", "parentCommentId": null, "user": {"username": "MHR"}}, {"_id": "pD5Yo4bN4Dws4oKpR", "postedAt": "2022-10-19T18:19:12.826Z", "postId": "Eq8nwNPNhfXvt2TWj", "htmlBody": "<p>Thank you for sharing this, Luisa. Your openness reminds us we're not alone in our mental health struggles. And talking about the different medication you tried and how you experimented with them may easily help others find treatments that could greatly improve their lives.</p>", "parentCommentId": null, "user": {"username": "Stephen Clare"}}, {"_id": "LnsEMHXHHd9iXLuwM", "postedAt": "2022-10-19T19:42:08.368Z", "postId": "Eq8nwNPNhfXvt2TWj", "htmlBody": "<p>(Edit: This was an exceptionally badly written comment, and it basically guarantees a misunderstanding. Sorry about wasting everyone's time. It was meant to be supportive, but it was not. Small explanation <a href=\"https://forum.effectivealtruism.org/posts/Eq8nwNPNhfXvt2TWj/my-experience-experimenting-with-a-bunch-of-antidepressants?commentId=phbE28jb6fpmgaXHY\">here</a>.)</p><p>There'll always be some outrageous wretch who can outdo you in depression-or-what-have-you. You have the right to complain without needing to emphasise your \"luck\" so much (lucky you, at least you have tissue to wipe your tears with when your brain tries to eat itself). I can outdo most people in depression without breaking a sweat, but I know I'm not the worst, and that knowledge can make it hard to summon up the gumption to say \"damn, something really needs to change\". At some point you have to realise that if people at the bottom percentile also feel uncomfortable taking their problems seriously for the same relative reasons, it's ridiculous all the way up the chain.</p>", "parentCommentId": null, "user": {"username": "Emrik"}}, {"_id": "ztwLDgPuCajCpzSSK", "postedAt": "2022-10-19T19:46:31.218Z", "postId": "Eq8nwNPNhfXvt2TWj", "htmlBody": "<p>And fwiw, I disagree with saying <i>\"This isn't professional medical advice, it's just my experience and amateur knowledge.\" </i>Perpetuating the illusion that mental health professionals usually know what they're doing can be harmfwl, <i>especially</i> in this crowd, because most people here can do better by trusting their own cursory research.</p>", "parentCommentId": "LnsEMHXHHd9iXLuwM", "user": {"username": "Emrik"}}, {"_id": "NjDL3FQMLDqgxTrjy", "postedAt": "2022-10-19T19:47:32.624Z", "postId": "Eq8nwNPNhfXvt2TWj", "htmlBody": "<p>How did you measure efficacy?</p>\n", "parentCommentId": null, "user": {"username": "Griffin Young"}}, {"_id": "ErZE5mf3Cijm9xZzZ", "postedAt": "2022-10-19T19:58:19.023Z", "postId": "Eq8nwNPNhfXvt2TWj", "htmlBody": "<p>Thanks for sharing.</p>\n<p>I'd be interested to hear more about how  you measured effectiveness.</p>\n<p>If I understand correctly it takes several weeks to taper on and taper off most antidepressants.</p>\n<p>Were you operating from a baseline where your depressive symptoms were fairly consistent for many months?</p>\n<p>If not, how did you guage effectiveness vs placebo?</p>\n<p>Perhaps you approached these tests as mostly about finding one that didn't have acute side-effects, and also wasn't obviously <em>not</em> working?</p>\n", "parentCommentId": null, "user": {"username": "Peter_Hartree"}}, {"_id": "9omssLakfiXSh8XWL", "postedAt": "2022-10-19T20:12:16.550Z", "postId": "Eq8nwNPNhfXvt2TWj", "htmlBody": "<p>What Stephen said ❤️ And CONGRATS ON PERSEVERING 💪 And while I'm here, big shout-out to your partner, therapist, friends, colleagues, and especially to <a href=\"https://docs.google.com/document/d/1niiV8I4cgk_xZ1Blou15ImPmqXU4eb_li9eRVp5NgYo/edit\">Rob</a> (I was actually thinking of thanking him earlier today - I am loving bupropion right now) 🙌</p><p>Small thing:</p><blockquote><p>In head-to-head studies,&nbsp;<strong>agomelatine, amitriptyline, escitalopram, mirtazapine, paroxetine, venlafaxine, and vortioxetine were more effective than other antidepressants</strong> (range of ORs [odds ratios] 1·19–1·96)</p></blockquote><p>I think you've missed out bupropion - OR of ~1.65 according to Figure B? (Also, all the ones you list here seem to have ORs more specifically in the range ~1.45-1.96 according to Figure B?)</p><p>Good to see that your post isn't perfect, but I thought I'd point it out 😉</p>", "parentCommentId": null, "user": {"username": "Holly"}}, {"_id": "DCwApWmJMd4rKZkDw", "postedAt": "2022-10-19T20:23:04.653Z", "postId": "Eq8nwNPNhfXvt2TWj", "htmlBody": "<p>Where's the part of the post you are responding to?</p>\n", "parentCommentId": "LnsEMHXHHd9iXLuwM", "user": {"username": "maxeonyx"}}, {"_id": "vMxKFH8fsiX8gaJrs", "postedAt": "2022-10-19T20:34:12.828Z", "postId": "Eq8nwNPNhfXvt2TWj", "htmlBody": "<p>Highlights from the linked writeup:</p><blockquote><p>Most patients will want either escitalopram or bupropion as first-line treatment. These medications are easy to use and have fewer side effects than most others.</p><p>...</p></blockquote><blockquote><p>[V]ortioxetine [is] very expensive without having obvious advantages over much cheaper drugs, and I can rarely find a use for [it].</p></blockquote>", "parentCommentId": "ghnTbvEviqygkNmRC", "user": {"username": "Holly"}}, {"_id": "ZMRjn9K8YkAbo4Jyg", "postedAt": "2022-10-19T21:11:28.529Z", "postId": "Eq8nwNPNhfXvt2TWj", "htmlBody": "<p>Thank you so much for writing this up, Luisa!  It has lots of good data and advice.</p>\n<p>A quick thought based on what helped me when I was burning out: I'd consider working part-time for a while to see if reduced work stress helps. Work is often a massive source of stress and sometimes we need extended downtime (e.g., not just a weekend) to make progress on recovering from the damage of our past stresses. Working part-time can also give you alot of time for self-care, therapy, changing habits and so on. Eitherway, I wish you the best of luck in the future!</p>\n", "parentCommentId": null, "user": {"username": "Peterslattery"}}, {"_id": "cM6GSoGYfrXmheh6g", "postedAt": "2022-10-19T21:51:55.625Z", "postId": "Eq8nwNPNhfXvt2TWj", "htmlBody": "<p>As a GP myself, I would love patients like you who are evidence based and committed to treatment plans!</p>\n<p>It is well understood depression and other mood disorders are very complex and multimodal. So trying a bunch of stuff outside medication also useful.</p>\n<p>Also worth mentioning there is A LOT or epigenetic factors we don't understand well and can make a big difference on effects and side effects of medications. Trial and error is usually indicated like you have done in refractory and treatment resistance experience like yours.</p>\n<p>Well done on sharing too. Mental health is like any other chronic disease, and important to aim for 'well managed' rather than 'cure' ... Because we all get down from time to time!</p>\n", "parentCommentId": null, "user": {"username": "Dan Epstein"}}, {"_id": "HNKgYxKt2KzJyuNrN", "postedAt": "2022-10-19T22:08:02.025Z", "postId": "Eq8nwNPNhfXvt2TWj", "htmlBody": "<p>Seems like esketamine with \"some effect in a day\", a comparative lack of side effects, and lack of withdrawal issues might be an attractive option. I am curious why wasn't it on your list?</p>\n", "parentCommentId": null, "user": {"username": "Misha_Yagudin"}}, {"_id": "omDTGEYPHgxXv5jmL", "postedAt": "2022-10-19T22:10:32.455Z", "postId": "Eq8nwNPNhfXvt2TWj", "htmlBody": "<p>Thanks for sharing this- it's very inspiring but also difficult to read because it's not realistic for many people struggling with mental health issues.<br><br>It really captures why we (I'm speaking of Canada but I'm sure this applies to many other places) have a mental health crisis. It takes years to see a psychiatrist unless you get yourself checked into the hospital and then risk being admitted to a mental health facility against your will (which is scary to say the least). To actually have a psychiatrist support you through a process like this, as well as family members and your workplace, would almost never happen here.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Lauren Maria"}}, {"_id": "cbshPmv9TPazromx4", "postedAt": "2022-10-19T23:03:05.645Z", "postId": "Eq8nwNPNhfXvt2TWj", "htmlBody": "<p>While I'm sympathetic to some ideas that this comment alludes to, I've downvoted this comment (and your <a href=\"https://forum.effectivealtruism.org/posts/Eq8nwNPNhfXvt2TWj/my-experience-experimenting-with-a-bunch-of-antidepressants?commentId=ztwLDgPuCajCpzSSK\">comment</a> below).<br><br>I think the tone of this message comes across to me as unnecessarily snarky/antagonistic. I interpreted the comments about luck as the author's acknowledgement that this kind of experimentation is not feasible for everyone, and of protective factors that the author found helpful for managing difficult parts of this experimentation. I didn't get a sense that the author was minimising her mental health by comparing herself with people who are less well-off, which is one uncharitable interpretation of your comment.<br><br>I think I might be biased here because I would find it difficult to share a personal post like this publicly, and so perhaps have a higher standard for pushbacks that don't address the &nbsp;main points of the post, but feel more like nitpicks on how these kinds of personal journeys are communicated/what the author should and shouldn't acknowledge as helpful for them. I worry that comments like this can be (mis)interpreted as potential barriers to other people sharing posts I'd be happy to see on the forum.</p><p>RE: your medical advice <a href=\"https://forum.effectivealtruism.org/posts/Eq8nwNPNhfXvt2TWj/my-experience-experimenting-with-a-bunch-of-antidepressants?commentId=ztwLDgPuCajCpzSSK\">comment</a> below - I viewed the disclaimer as helpful reasoning transparency to know what her background knowledge is and how she went about investigating this. I think there are also legal reasons that including a disclaimer is useful, even if the author was confident this post was as helpful as the average mental health professional's advice.</p><p>I also think statements like <strong>\"the illusion that mental health professionals usually know what they're doing\"</strong> and <strong>\"most people here can do better by trusting their own cursory research\"</strong> seem too strong as standalone claims. While I agree there are doctors who are bad, and doctors who are not clearly good, it's a few steps further to suggest that mental health professionals usually don't know what they are doing, and that most people should do their own <i>cursory </i>research instead of seeking input from mental health professionals. I would have found it helpful to see justification that matched the strength of those claims, or more <a href=\"https://forum.effectivealtruism.org/posts/yND9aGJgobm5dEXqF/guide-to-norms-on-the-forum#What_we_encourage:~:text=Clarity%20about%20what,and%20Double%2DCrux\">epistemic legibility</a>.</p><p>For example, if it is the case that people here can benefit (on net) from input from mental health professionals, then your comment may be harmful in a similar way, by perpetuating the illusion that mental health professionals usually don't know what they're doing, and by nudging people towards trusting their own research instead of seeking professional help. It's unclear from the outside that it'd be valuable to update based on what you've said.<br><br>(Speaking in personal capacity etc)<br><br>&nbsp;</p>", "parentCommentId": "LnsEMHXHHd9iXLuwM", "user": {"username": "bruce"}}, {"_id": "7Zfczhjd77qh9cH5n", "postedAt": "2022-10-19T23:12:02.492Z", "postId": "Eq8nwNPNhfXvt2TWj", "htmlBody": "<p>I think there should be a lot more writing in EA forum that:</p><ul><li>&nbsp;direct, brief, and not trying to win the game of politeness/EA rhetoric.&nbsp;</li><li>Also, assuming it's drawing and directly communicating critical skills/experience that EAs don't have, more writing should be lower effort and not cover every base.</li></ul><p>This will get a lot more knowledge and people with time costs/expertise, instead of the lousy situation it is in now.</p><p>But your comment is really bad, I can't even work out what your point is, even after close reading.&nbsp;</p>", "parentCommentId": "LnsEMHXHHd9iXLuwM", "user": {"username": "Charles He"}}, {"_id": "ccusG6PpfppgsovWq", "postedAt": "2022-10-20T03:52:16.996Z", "postId": "Eq8nwNPNhfXvt2TWj", "htmlBody": "<p>Besides the second sentence which is only half about this, every sentence is about how comparing one's level of depression to someone who has it even worse isn't helpful or justified. Emrik also talks about their struggles with this.&nbsp;</p><p>Perhaps they projected onto the post author about luck, but I'd hope people with depression feel like they can say imperfect and real things about depression without getting pilloried for getting something wrong.&nbsp;</p>", "parentCommentId": "7Zfczhjd77qh9cH5n", "user": null}, {"_id": "bvE8RHiG2wMfjo2v4", "postedAt": "2022-10-20T04:40:36.395Z", "postId": "Eq8nwNPNhfXvt2TWj", "htmlBody": "<blockquote><p>every sentence is about how comparing one's level of depression to someone who has it even worse isn't helpful or justified</p></blockquote><ol><li>i can see how you can intrepret this comment as \"the OP is putting up norms by measuring their depression and I discourage this\", in an intellectual sense, but reading the ocmment, this read is still marginal, the comment doesn't really make the case clear.&nbsp;</li><li>whatever their experiences are, the writer of the comment isn't likely writing while currently in a state of depression, and are responsible for communicating. their comment is disorganized and reads like a string of consciousness (because it probably is) and it's self involved.</li></ol><p>note that actually i didn't downvote the comment by the way.</p>", "parentCommentId": "ccusG6PpfppgsovWq", "user": {"username": "Charles He"}}, {"_id": "phbE28jb6fpmgaXHY", "postedAt": "2022-10-20T05:07:42.623Z", "postId": "Eq8nwNPNhfXvt2TWj", "htmlBody": "<p>tl;dr: I intended to be supportive. I knew my comment could be misinterpreted, but I didn't think the misinterpretations would do anyone harm. Although I did not expect it to be misinterpreted by Luisa. And Charles He said he read it closely and didn't decipher my intention, so I'm kinda irrational and will try to update. On rereading it myself, I agree it was very opaque.</p><p>My comment was entirely not intended as pushback on anything. I find Luisa's ability to put in so much conscious effort into this admirable and I appreciate it as inspiration to do the same. She did not seem like she had above-average guilt-feelings for prioritising dealing with her problems when there are always others who suffer more. But because she mentioned luck, and I'm aware that this is something many people struggle with including me, it seemed plausible just on priors that she had an inkling of it. &nbsp;If that's true, then there's an off-chance that my encouragement could help, and if it's not, then my encouragement would fall flat and do no harm.</p><p>My tone tried to be supportive by pointing out the laughable absurdity of not feeling ok taking one's problems seriously unless they were worse than they are. I think pointing this out is high priority, because the dynamic makes for <i>incredibly</i> unfortunate incentives. When people speak to me about my own problems, I often find a humoristic tone to be easier to deal with (and less painfwl) compared to when people conform to an expectation that we all need to be Awfwly Severe and tiptoe around what's being said. Although I'm aware that my intended tone would only come across if you interpreted with a lot of charity and a justifiably high prior on \"Emrik will not try to be rude to someone vulnerably talking about their own depression\".<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnref6d3oj7tm73\"><sup><a href=\"#fn6d3oj7tm73\">[1]</a></sup></span></p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fn6d3oj7tm73\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnref6d3oj7tm73\">^</a></strong></sup></span><div class=\"footnote-content\"><p>Why would I keep making comments that can't be understood without charity? Because I believe the community and the world would be better if collectively learned to interpret with more charity. And I go by the rule <strong>\"act as if we are already closer to optimal social norms than we in fact are,\" </strong>because when norms are stuck in inadequate equilibria, we can't make progress on them unless we are more people acting by this rule.</p></div></li></ol>", "parentCommentId": "cbshPmv9TPazromx4", "user": {"username": "Emrik"}}, {"_id": "CkzhanHbcGGZcXNG5", "postedAt": "2022-10-20T05:13:03.130Z", "postId": "Eq8nwNPNhfXvt2TWj", "htmlBody": "<p>Thanks for pointing out how dense the comment was. I agree, and I should probably up my bar for how clear my comments need to be so I don't waste people's time like this. But two pushbacks:</p><ol><li>It's ok if people make comments they know most people will misinterpret, as long as the misinterpretations are harmless.</li><li>And in response to your second point above, what's wrong with being self-involved?</li></ol>", "parentCommentId": "bvE8RHiG2wMfjo2v4", "user": {"username": "Emrik"}}, {"_id": "siXP65A8KfjA5hhEh", "postedAt": "2022-10-20T05:15:11.568Z", "postId": "Eq8nwNPNhfXvt2TWj", "htmlBody": "<p>I made a bad comment, but I tried to explain it in response to Bruce's comment above. Just letting you know, not requesting that you to read it.</p>", "parentCommentId": "DCwApWmJMd4rKZkDw", "user": {"username": "Emrik"}}, {"_id": "zfmEq8gFeDxq8HKBi", "postedAt": "2022-10-20T06:31:16.357Z", "postId": "Eq8nwNPNhfXvt2TWj", "htmlBody": "<p>I understand what you meant hear Emrik, sorry you got down vote buried</p>\n", "parentCommentId": "LnsEMHXHHd9iXLuwM", "user": {"username": "ElliotJDavies"}}, {"_id": "Qon7RoM3ugfYtZA9j", "postedAt": "2022-10-20T06:36:26.191Z", "postId": "Eq8nwNPNhfXvt2TWj", "htmlBody": "<blockquote>\n<p>I'd hope people with depression feel like they can say imperfect and real things about depression without getting pilloried for getting something wrong.</p>\n</blockquote>\n<p>Agree! The combined aggregate response to the original comment is probably the least sensitive/kind conduct I have ever seen in the EA sphere</p>\n<p>Edit: added \"combined aggregate \" for clarity</p>\n", "parentCommentId": "ccusG6PpfppgsovWq", "user": {"username": "ElliotJDavies"}}, {"_id": "izdET9mqwuEYcBvFA", "postedAt": "2022-10-20T06:36:47.262Z", "postId": "Eq8nwNPNhfXvt2TWj", "htmlBody": "<p>It's no bother, dw dw. I honestly agree it was a bad comment that invited misunderstanding.</p>", "parentCommentId": "zfmEq8gFeDxq8HKBi", "user": {"username": "Emrik"}}, {"_id": "hPcNe5A3Ksdtmeau7", "postedAt": "2022-10-20T13:40:48.579Z", "postId": "Eq8nwNPNhfXvt2TWj", "htmlBody": "<p>Thanks for writing this, great to hear that you're feeling better.</p><p>I'm usually a fan of self-experimentation, and the upside of finding an antidepressant with few side-effects (and that you can take a lower dose of) is definitely valuable. This seems especially true if you can stop taking it during better mental health periods, then have it in your arsenal for future use. But I still have a few doubts about this process, and I'm a little concerned that some of the premises behind your experiment need a bit more scrutiny. I hope someone with a bit more domain-specific knowledge can correct me if I'm wrong, or improve my arguments if I have a point. I'm also aware that there's no such thing as a 'perfect self-experiment', and I don't think there are obvious ways that you could have improved the experiment. But here are a few things that I'd like to hear your &nbsp;thoughts on:</p><p>Firstly, the depression episode was triggered by an disruptive external factor- the pandemic. This would probably invalidate any observational study held in the same period. As this external factor improved, and people could start travelling/ socialising normally, you might expect symptoms to lift naturally from mid-2021 onwards. From what you've mentioned here, you don't seem to have disproved this hypothesis. I gather that depressive episodes seem to last <a href=\"https://www.cambridge.org/core/services/aop-cambridge-core/content/view/406A1D35C7346CB742DFF42A90DE2462/S0007125000027173a.pdf/div-class-title-duration-of-major-depressive-episodes-in-the-general-population-results-from-the-netherlands-mental-health-survey-and-incidence-study-nemesis-div.pdf\">a median of about 6 months</a> ( see pic below), with treatment not making a huge difference for duration within the first year (some obvious caveats about selection effects here). How do you consider the possibility that you would have recovered without antidepressants?</p><p><img src=\"https://res.cloudinary.com/cea/image/upload/v1675260013/mirroredImages/hPcNe5A3Ksdtmeau7/qfsluxjq4r075nvruqsx.png\" srcset=\"https://res.cloudinary.com/cea/image/upload/v1675260013/mirroredImages/hPcNe5A3Ksdtmeau7/kojc9rtqc7qhzmfeykcf.png 154w, https://res.cloudinary.com/cea/image/upload/v1675260014/mirroredImages/hPcNe5A3Ksdtmeau7/vpxb74fxpqcgnlzerx0r.png 234w, https://res.cloudinary.com/cea/image/upload/v1675260014/mirroredImages/hPcNe5A3Ksdtmeau7/mqh0lai7ncphvjs2nwfw.png 314w, https://res.cloudinary.com/cea/image/upload/v1675260014/mirroredImages/hPcNe5A3Ksdtmeau7/yavghzwkyfea7rp5b3r4.png 394w, https://res.cloudinary.com/cea/image/upload/v1675260013/mirroredImages/hPcNe5A3Ksdtmeau7/y8oyfu15whwucc8nrehs.png 474w\"></p><p>Secondly, the process of switching between 5/6 antidepressants seems to be a significant confounding factor here. I don't know how good the evidence base for <a href=\"https://www.slideshare.net/juanluisdelgadoestve/guidelines-forswitchingbetweenspecificantidepressantsa3posterpdf1\">the guidelines </a>link you sent was, but it seems likely that the multiple (start, side-effects, ending, potential relapse) effects of antidepressants &nbsp;are significant enough to really mess up any attempts to have a 'clean slate' between treatments, and to therefore make it a unfair comparison. It seems possible that what you thought was a negative reaction to x medicine was actually contingent on having just tapered off y medicine and/ or experiencing a relapse. Does that seem plausible, or do you think that there was a stable enough baseline for comparisons to be valid?</p><p>Third, just a bit of concern about the downsides of the experiment. There are some long-term side-effects to antidepressants, and they seem understudied for fairly obvious reasons (most clinical studies only last for 6 months, no long-term RCTs). There seems to be <a href=\"https://journals.sagepub.com/doi/full/10.1177/2045125320970325#bibr81-2045125320970325\">a few studies </a>that point to longer-term risks and 'oppositional effects' being underestimated. Unknown confounding factors and additional health risks from going on and off antidepressants would make me very concerned. Obviously, untreated depression also has a range of health risks, so I don't want to discount the other side of the ledger, but I would definitely not be confident that I was doing something safe. How confident do you feel in your comparison of these risks? And did you feel that you had to convince yourself against (potentially irrational) fear of over-medication?</p><p>Finally, a bit unrelated, there's a meta question that often comes to mind when I read posts about more rational/ self-experimenting approaches to health issues, which is: \"How strong should our naturalistic bias/heuristic be when approaching mental health/ general health issues?\" Particularly for my own health, I have a moderate bias against less 'natural' (obviously a very messy term, but I think it's useful) health solutions. I often feel EAs have the opposite bias, preferring pharmacological solutions, perhaps because they can be tested with a nice clean RCT. I'm interested what level of bias you, (and forum readers), think is optimal.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Jack_S"}}, {"_id": "xhvaaBd3kDH2AjJnM", "postedAt": "2022-10-20T19:30:44.951Z", "postId": "Eq8nwNPNhfXvt2TWj", "htmlBody": "<p>Note that people in US/UK and presumably other places can buy drugs on the grey market (e.g. <a href=\"https://www.unitedpharmacies.md/Antidepressants.html\">here</a>) for less than standard prices. Although I wouldn't trust these 100%, they should be fairly safe because they're certified in other countries like India; gwern wrote about this <a href=\"https://www.gwern.net/Modafinil\">here</a> for modafinil and the basic analysis seems to hold for many antidepressants. The shipping times advertised are fairly long but potentially still less hassle than waiting for a doctor's appointment for each one.</p>", "parentCommentId": null, "user": {"username": "tkwa"}}, {"_id": "8qbkhBF3H7yvpLcrw", "postedAt": "2022-10-20T20:50:29.461Z", "postId": "Eq8nwNPNhfXvt2TWj", "htmlBody": "<p>Speaking as a vortioxetine user, the main advantage for me is that it has a quite different side effect profile from other antidepressants of similar effect size and \"risk level\" -- one which I personally prefer to SSRIs, bupropion, or mirtazapine.</p>", "parentCommentId": "vMxKFH8fsiX8gaJrs", "user": {"username": "willbradshaw"}}, {"_id": "6AsCzphvwXPS4DJGc", "postedAt": "2022-10-21T06:56:56.246Z", "postId": "Eq8nwNPNhfXvt2TWj", "htmlBody": "<p>Do you know of anything equivalent for stimulants? They don't seem to have that category, and it's more tightly regulated, so I don't expect a positive response here, but I ask jic. I'm worried that a future dr might not renew my 3-month prescription for whatever reason, and then I'm in shambles.</p>", "parentCommentId": "xhvaaBd3kDH2AjJnM", "user": {"username": "Emrik"}}, {"_id": "rKZPzqErNqrkxCgDJ", "postedAt": "2022-10-21T14:27:52.677Z", "postId": "Eq8nwNPNhfXvt2TWj", "htmlBody": "<p>This doesn't add much, but thank you for sharing this. I honestly believe that the world would be much better (and many people on this forum much happier) if more people did this.&nbsp;</p>", "parentCommentId": null, "user": {"username": "MattBall"}}, {"_id": "MzQxNTdjhToaF7iSY", "postedAt": "2022-10-22T04:20:22.265Z", "postId": "Eq8nwNPNhfXvt2TWj", "htmlBody": "<p>Yeah, I don't think it's possible for controlled substances due to the tighter regulation.</p>", "parentCommentId": "6AsCzphvwXPS4DJGc", "user": {"username": "tkwa"}}, {"_id": "8h73txXMv8KAYJzYm", "postedAt": "2022-10-22T13:38:26.488Z", "postId": "Eq8nwNPNhfXvt2TWj", "htmlBody": "<p>Thanks for writing this up, and sorry to hear you had to suffer through this Luisa!</p>\n<p>Some things I recently learned about antidepressants:</p>\n<ul>\n<li>\n<p>To limit withdrawal effects, hyperbolic tapering (reducing by x% per week) &gt; slow tapering (reducing by fixed amount over months) &gt; fast tapering (fixed amount over 2-4weeks) &gt; cold turkey. <a href=\"https://www.madinamerica.com/2019/03/slow-tapering-best-antidepressant-withdrawal/\">https://www.madinamerica.com/2019/03/slow-tapering-best-antidepressant-withdrawal/</a>\nIn addition, there's cross-tapering (introducing a new SSRI while tapering off an old one) that's supposedly helpful.</p>\n</li>\n<li>\n<p>Some people become permanently disabled from (stopping) antidepressants. It ranges from sexual dysfunction to 9/10 severity and not being able to work. The risk seems to increase with duration of taking it. I don't know how many people experience this, but it was enough to create an All-Party Parliamentary Group in the UK for it (<a href=\"http://prescribeddrug.org/wp-content/uploads/2018/10/APPG-PDD-Survey-of-antidepressant-withdrawal-experiences.pdf\">http://prescribeddrug.org/wp-content/uploads/2018/10/APPG-PDD-Survey-of-antidepressant-withdrawal-experiences.pdf</a>). This implies a risk of 1 in 1,000 to 1 in 10,000 or something? It definitely makes me wary to recommend antidepressants to anyone, especially for an indefinite period of time.</p>\n</li>\n</ul>\n<p>(Note: the survey linked above has a very strong selection bias, so we can't glean much from the actual numbers besides the fact that the phenomenon exists)</p>\n", "parentCommentId": null, "user": {"username": "SiebeRozendal"}}, {"_id": "fSAPKsBb33kH3oeyr", "postedAt": "2022-10-22T16:35:29.925Z", "postId": "Eq8nwNPNhfXvt2TWj", "htmlBody": "<p>Edit (Cutting out a lot in response to Charles' comments): &nbsp;</p><p>Vyvance, Adderall, and coffee can each improve mood. I'll leave it at that.</p>", "parentCommentId": null, "user": {"username": "esc12a"}}, {"_id": "LTyEz2H8zK6nzjbxW", "postedAt": "2022-10-22T21:13:53.068Z", "postId": "Eq8nwNPNhfXvt2TWj", "htmlBody": "<p>Ok there's been a couple comments on \"don't go to your doctor\", \"drug hack\".</p><p>Above:</p><blockquote><p>My two cents: Vyvance / Adderall is worth a try for depression... [Low side effects. Thankfully it's completely in and out of your system in 24 hours.]</p></blockquote><p><a href=\"https://forum.effectivealtruism.org/posts/Eq8nwNPNhfXvt2TWj/my-experience-experimenting-with-a-bunch-of-antidepressants?commentId=ztwLDgPuCajCpzSSK#comments\">Also here</a></p><blockquote><p>Perpetuating the illusion that mental health professionals usually know what they're doing can be harmfwl</p></blockquote><p><strong>Basically, I'm pretty sure this is wrong/dangerous.</strong></p><p>Lisdexamfetamine is indeed being <a href=\"https://journals.healio.com/doi/abs/10.3928/02793695-20120112-03\">explored to treat depression</a>, and some anti depressants like buproprion have a very stimulant sort of flavor. &nbsp;</p><p>But applying these theories directly as a sign of to take stimulants is very very simplistic. <s>Also, there's a clownish level of abuse of medications in US/western society (see opoids).&nbsp;</s></p><p>To be gearsy, one issue is that stimulants bring you up, but then you almost always have a crash or a low phase—it's easy to see how this low phase could be very very bad for some people. These substances also have relationships with other disorders/issues that are complicated. Also, these side effects definitely aren't \"limited to being in out of your system in 24 hours\".&nbsp;</p><p>I don't have a long list of references for this or time to provide this, but you can google to explore the standard issues and side effects the stimulant drugs:</p><figure class=\"image\"><img src=\"https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/c37e79bf1870892e44e096764fd6fd6520ff920963623033.png\" srcset=\"https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/c37e79bf1870892e44e096764fd6fd6520ff920963623033.png/w_90 90w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/c37e79bf1870892e44e096764fd6fd6520ff920963623033.png/w_180 180w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/c37e79bf1870892e44e096764fd6fd6520ff920963623033.png/w_270 270w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/c37e79bf1870892e44e096764fd6fd6520ff920963623033.png/w_360 360w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/c37e79bf1870892e44e096764fd6fd6520ff920963623033.png/w_450 450w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/c37e79bf1870892e44e096764fd6fd6520ff920963623033.png/w_540 540w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/c37e79bf1870892e44e096764fd6fd6520ff920963623033.png/w_630 630w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/c37e79bf1870892e44e096764fd6fd6520ff920963623033.png/w_720 720w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/c37e79bf1870892e44e096764fd6fd6520ff920963623033.png/w_810 810w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/c37e79bf1870892e44e096764fd6fd6520ff920963623033.png/w_878 878w\"></figure><p>&nbsp;</p><blockquote><p>Just don't tell your doctor that's what you want it for</p></blockquote><p>&nbsp;</p><blockquote><p>especially in this crowd, because most people here can do better by trusting their own cursory research.</p></blockquote><p><strong>RE: This and other \"anti doctor stuff\".&nbsp;</strong></p><p>There's a lot to write here, but ultimately, these comments and stuff shouldn't be on a major internet forum, definitely not the EA forum.&nbsp;</p><p>The following gives one pretty good argument:</p><ul><li>Many EAs are privileged. So for this audience, these people should just see a doctor/psychiatrist to get data points, as well as their trusted network for what works.&nbsp;</li><li>For the people who aren't able to see a doctor, and are under resourced, that's bad and unfortunate, especially since on average, they have further challenges—but on average it's likely that taking internet forum drug advice will make things further bad, especially given coincidence of further issues.</li></ul><p>So the above sort of is a logical case that explains why internet forum for \"drug hacking\" (especially for mood/stimulants/depression) is bad.</p><p>This is more complicated (someone I know has a relationship with doctors where they sort of punch through and get whatever script they want, which is exactly in spirit of the above comment; doctors, psychologists are very mixed in quality; being an outlier makes all of this worse). &nbsp;</p><p>It's good to acknowledge the facts above—but unfortunately properly situating this all, without causing an \"EA forum style\" cascade that sort of makes it worse, is hard, in addition to time, it's sort of, \"I don't have enough crayons\" or \"I can't count that low\" sort of flavor.</p>", "parentCommentId": "fSAPKsBb33kH3oeyr", "user": {"username": "Charles He"}}, {"_id": "Q9sAvZuE67Evhm7h5", "postedAt": "2022-10-22T22:04:10.609Z", "postId": "Eq8nwNPNhfXvt2TWj", "htmlBody": "<p>I agree with much of what you said and so edited my post. I do have a few points to make in the abstract though.</p><p>Although patients are prone to make mistakes such as abusing drugs, the medical establishment is sometimes majorly wrong in predictable ways, and waiting for the establishment to fix itself through the official channels can take sometimes decades. If caffeine was just discovered today, I think it would be classified as a controlled substance and restricted to certain diagnoses. (No?) If so, I think that would be a huge loss for humankind.&nbsp;</p><p>The philosophy of clinical psychology/psychiatry as represented in the DSM strikes me as seriously flawed. They group things into discrete categories called \"disorders\" and eschew continuity and multidimensionality. As math (and its offshoots) becomes more wildly known, I think this will change, but it will take time. [I'm not saying that the concept of a disorder or diagnosis should be completely abandoned, but it has limitations].&nbsp;</p><p>Finally, the opioid comparison strikes me as strained.&nbsp;</p>", "parentCommentId": "LTyEz2H8zK6nzjbxW", "user": {"username": "esc12a"}}, {"_id": "SNJ3JsTPzQbgfFHyE", "postedAt": "2022-10-22T22:38:07.821Z", "postId": "Eq8nwNPNhfXvt2TWj", "htmlBody": "<p>I appreciate the thoughtful consideration and I agree with you. IMO I think you are right, including &nbsp;your points like the medical establishment is often wrong and slow. I'm less certain, but it's possible the DSM (and maybe a lot of physiatry) is a mess.</p><blockquote><p>Finally, the opioid comparison strikes me as strained.</p></blockquote><p>Yes, this should be deleted. Maybe I was trying to gesture at creating subcultures that normalize drug use inappropriately, and I was using \"opioid\" as an example in support of this, but this might be wrong and, if anything, supports your points equally or better.&nbsp;</p><p>&nbsp;</p><p>The main difference is my concern about EA having subpopulations/subcultures with different resources.&nbsp;</p><p>I support the OP, but I'm worried she's an outlier, being in a place where there is a huge amount of support, creating agency for her exploration (<a href=\"https://80000hours.org/podcast/episodes/depression-anxiety-imposter-syndrome/\">read the 80,000 hours CEO's story here</a>).</p><p>I don't want to minimizing her journey, such personal work and progress should be encouraged and written up more, because it's great!</p><p>But, partially because this is impractical for many, <strong>I'm worried that something will get lost in translation, or some bad views might piggy back on this e.g. normalizing low-fidelity beliefs about drug use (that are Schedule II stimulants!).</strong></p>", "parentCommentId": "Q9sAvZuE67Evhm7h5", "user": {"username": "Charles He"}}, {"_id": "Xyt7SwZAbtxoQfGtH", "postedAt": "2022-10-23T01:36:20.916Z", "postId": "Eq8nwNPNhfXvt2TWj", "htmlBody": "<p>Inspiring to see someone taking such an organised, systematic approach to their health. Inspiring also to see someone sharing their mental health struggles openly and in a constructive way.</p>\n<p>I feel like I can't draw many conclusions from this data because of the big risk of confounding factors (maybe an external event happened while you were on one medication and not when on another), because drugs tend to work quite differently in different people, because N=1 and because there didn't appear to be blinding.</p>\n<p>Anectodal evidence has its place, though. Please keep up the good work.</p>\n", "parentCommentId": null, "user": {"username": "Henry Howard"}}, {"_id": "iDMibjqeb5rHmZFy4", "postedAt": "2022-10-23T10:08:04.590Z", "postId": "Eq8nwNPNhfXvt2TWj", "htmlBody": "<p>Not sure why people were using the main downvote button on this one, and not just the disagree downvote.</p>\n", "parentCommentId": "ztwLDgPuCajCpzSSK", "user": {"username": "maxeonyx"}}, {"_id": "CgAwjpG2rAgatnEco", "postedAt": "2022-10-23T10:11:29.352Z", "postId": "Eq8nwNPNhfXvt2TWj", "htmlBody": "<p>Wow people really downvoted it. I just ignored it, in general I don't like to downvote people who are talking about their poor mental health 🤷‍♂️</p>\n", "parentCommentId": "siXP65A8KfjA5hhEh", "user": {"username": "maxeonyx"}}, {"_id": "g86sMvDmm27u9CpaH", "postedAt": "2022-10-23T17:28:18.009Z", "postId": "Eq8nwNPNhfXvt2TWj", "htmlBody": "<p>I think people thought it was bad faith or deliberately provocative or something. Or people aren't used to separating between \"disagreement\" and \"I want to discourage this behaviour\". Or maybe they downvoted it because I stated something potentially harmfwl without justifying it, and they were worried that people would defer to me. I think I shouldn't have posted the comment without more explanation, because it predictably would be misunderstood, wouldn't help push communication norms further towards what I want, <i>and</i> made the forum feel less nice for people.</p>", "parentCommentId": "iDMibjqeb5rHmZFy4", "user": {"username": "Emrik"}}, {"_id": "iCqDzBbdCrKr6ejoe", "postedAt": "2022-10-23T21:30:23.110Z", "postId": "Eq8nwNPNhfXvt2TWj", "htmlBody": "<p>Why would your comment have made the forum feel less nice for people? Sincerely curious.&nbsp;</p>", "parentCommentId": "g86sMvDmm27u9CpaH", "user": null}, {"_id": "DqCcELGnrLZfjFdyp", "postedAt": "2022-10-23T21:45:45.732Z", "postId": "Eq8nwNPNhfXvt2TWj", "htmlBody": "<p>I strongly upvoted this comment because I think your middle paragraph is a true and necessary thing to say, and phrased in a fairly kind way (where many nearby phrasings may be substantially less kind). Given the clear cognitive distortions people may have around this and adjacent topics, being reminded of \"obvious facts\" can still be helpful.</p>", "parentCommentId": "Xyt7SwZAbtxoQfGtH", "user": {"username": "Linch"}}, {"_id": "run8n4QZwNgwBdd46", "postedAt": "2022-10-23T22:49:45.736Z", "postId": "Eq8nwNPNhfXvt2TWj", "htmlBody": "<p>Something like, they misinterpret my comment as if written from a culture full of narcissistic/misanthropic/bitter people, and it makes them feel marginally more like the forum is partially a home for those kinds of people. I did use very strong/rude language, which I now regret. Mental health professionals are good folk, and I should've been kinder in my critique.</p>", "parentCommentId": "iCqDzBbdCrKr6ejoe", "user": {"username": "Emrik"}}, {"_id": "DAJEfZWAKhztaLboc", "postedAt": "2022-10-23T23:03:14.645Z", "postId": "Eq8nwNPNhfXvt2TWj", "htmlBody": "<p>I think people downvoted it because it comes across more as criticism of other people, rather than the purpose being to talk about the commenter's own mental health</p>", "parentCommentId": "CgAwjpG2rAgatnEco", "user": {"username": "bec_hawk"}}, {"_id": "9ciRSY5HoJgJ2BSHm", "postedAt": "2022-10-25T14:18:19.547Z", "postId": "Eq8nwNPNhfXvt2TWj", "htmlBody": "<p>No I mean the one I replied to, your sub-comment</p>\n", "parentCommentId": "g86sMvDmm27u9CpaH", "user": {"username": "maxeonyx"}}, {"_id": "Zyxy8smw3xv3okskT", "postedAt": "2022-10-25T18:56:31.700Z", "postId": "Eq8nwNPNhfXvt2TWj", "htmlBody": "<p>I'm curious how you choose the order to try the drugs in. Vortioxetine is such a positive outlier on the \"effectiveness and acceptability\" chart that when I saw that I assumed you would have tried it first, or at least early/soon, but instead it was the sixth you tried. Is there some generally-applicable reason why it'd be wiser to start with the other five first?<br><br>(Note: My intuition that it made sense to start with vortioxetine based on the chart info was definitely strengthened when I saw that it's the drug you decided to stick with, but in reality I probably shouldn't update much at all based on your one case about which drugs it'd make sense to start with.)</p>", "parentCommentId": null, "user": {"username": "WilliamKiely"}}, {"_id": "dZ3XqcsXs6NMtSEKe", "postedAt": "2022-10-26T00:08:06.585Z", "postId": "Eq8nwNPNhfXvt2TWj", "htmlBody": "<p>I am very sceptical that there is a lot you can do about depression. This <a href=\"https://carcinisation.com/2022/09/07/the-limits-of-help/\">post</a> explains why.&nbsp;</p><p>The time, effort and money spent in addition to the side effects of anti-depressants make me strongly doubt that treatment attempts are worth it.</p>", "parentCommentId": null, "user": {"username": "Aithir"}}, {"_id": "CXpYu8sGhbAgnDcmH", "postedAt": "2022-11-01T13:32:37.998Z", "postId": "Eq8nwNPNhfXvt2TWj", "htmlBody": "<p>Funny how the antidepressant which ended up working for you is way higher than the others in your second figure. I'm wondering why you didn't start with this one: the smaller sample size? Also wondering how much I should update from the fact that it ended up being the best one for you.</p>", "parentCommentId": null, "user": {"username": "Troof"}}, {"_id": "ktcnicRdCvYxueX3j", "postedAt": "2023-01-29T11:50:47.367Z", "postId": "Eq8nwNPNhfXvt2TWj", "htmlBody": "<blockquote><p>Perhaps you approached these tests as mostly about finding one that didn't have acute side-effects, and also wasn't obviously <i>not</i> working?</p></blockquote><p>&nbsp;</p><p>Yea, I basically did this ^^&nbsp;<br><br><br>It was just extremely obvious to me when something was working/wasn't, and the fact that many antidepressants I was super optimistic about didn't work makes me think I wasn't getting huge placebo issues.&nbsp;<br><br>While self-reported data is obviously a bit tricky, my sense of whether something was/wasn't working was backed up by the data I collected.<br>&nbsp;</p><ul><li>I use Daylio to track my overall mood once a day and I have 2 years worth of data there.</li><li>I use the GAD9 and PHQ-7 to track my depression and anxiety scores once every week. I have 3 years worth of data from that.</li><li>I use perfectionism and low self esteem questionnaires to track those things once a month. Data for those for about 2 years</li></ul>", "parentCommentId": "ErZE5mf3Cijm9xZzZ", "user": {"username": "Luisa_Rodriguez"}}, {"_id": "uwrtvY3F34H3Hmm9h", "postedAt": "2023-01-29T11:51:45.190Z", "postId": "Eq8nwNPNhfXvt2TWj", "htmlBody": "<p>I tracked my mood and thought patterns in a few different ways:</p><ul><li>I use Daylio to track my overall mood once a day and I have 2 years worth of data there.</li><li>I use the GAD9 and PHQ-7 to track my depression and anxiety scores once every week. I have 3 years worth of data from that.</li><li>I use perfectionism and low self esteem questionnaires to track those things once a month. Data for those for about 2 years</li></ul>", "parentCommentId": "NjDL3FQMLDqgxTrjy", "user": {"username": "Luisa_Rodriguez"}}, {"_id": "Hocbjimgz2DCWMRF4", "postedAt": "2023-01-29T11:53:21.465Z", "postId": "Eq8nwNPNhfXvt2TWj", "htmlBody": "<p>Yea, good question. It's basically because I started with NHS psychiatrists (who strongly prefer to prescribe SSRIs), and only later moved to a private psychiatrist (who recommended I start first with agomelatine because of the excellent side effect profile, given that side effects were my main complaint).</p>", "parentCommentId": "Zyxy8smw3xv3okskT", "user": {"username": "Luisa_Rodriguez"}}, {"_id": "dPvma2XfTKtfpcYSG", "postedAt": "2022-10-22T16:31:26.019Z", "postId": "Eq8nwNPNhfXvt2TWj", "htmlBody": null, "parentCommentId": null, "user": null}]