[{"_id": "CcxczRwdxeroR3ZJc", "postedAt": "2023-03-08T04:07:05.502Z", "postId": "EQPY63WzxmqQnWsmS", "htmlBody": "<p>Severin -- I think this might sound reasonable at first glance. However, it seems to be based on a model of human motivation that is very dubious, empirically false, and deeply sex-negative.</p><p>You claim that \"Status is sexy<strong>.</strong> Predatorily-minded people know this. Thus, they are incentivized to climb the social EA ladder for the wrong reasons. If we set norms that make it harder for people to leverage their social status for romantic purposes, we can correct for this.\"</p><p>Well, you're right that signaling intelligence, creativity, wisdom, and moral virtues is sexually and romantically attractive. Indeed, what we evolutionary psychologists call 'mating effort' (investing in difficult, challenging behaviors to attract mates) seems to be a major driver of human innovation, insight, and moral progress. (I've spent the last 35 years of my academic &nbsp;career studying this, and published 5 books on it.)</p><p>So, it's not just 'predatorily-minded people' who invest mating effort in giving good talks, writing good EA Forum posts, running podcasts, doing public outreach, offering helpful insights, doing social networking, refining their moral virtues, and defending against existential threats to their group. It is, to a first approximation, all of us.&nbsp;</p><p>Is trying to be romantically attractive the \"wrong reason\" for doing excellent intellectual work, displaying genuine moral virtues, and being friendly at meetings? Well, if they're wrong, what would count as the \"right reasons\" for doing these things? Should we rely instead on careerism? Economic ambition? Intellectual vanity? Pure curiosity? A totally dispassionate, disinterested commitment to maximizing ultra-long-term cosmic sentient welfare?&nbsp;</p><p>People generally do good stuff because they're motivated to get some kind of survival benefit or reproductive benefit from doing good stuff. Mating effort is one of the most powerful and effective motivations -- if it's harnessed in productive ways.</p><p>My concern is that if we sexually neuter all EA groups, meetings, and interactions, and sever the deep human motivational links between our mating effort and our intellectual and moral work, we'll be taking the wind out of EA's sails. We'll end up as lonely, dispirited incels rowing our little boats around in circles, afraid to reach out, afraid to fall in love.</p><p>Put another way, human intellectual and moral culture has already spent centuries figuring out effective ways to tame and channel our mate-seeking, status-seeking, and validation-seeking into positive-sum, socially-beneficial work -- rather than into zero-sum competition, aggression, and warfare. This is basically the story of civilization: sublimating our sexual motivations into doing work for the greater good. (This is one of those rare occasions when Sigmund Freud got something right.)</p><p>The social costs of overt sexual harassment, stalking, and coercion are obvious. So there's a temptation to clamp down on all sex and romance within any subculture that values mutual respect, consent, and professionalism. However, there may be hidden motivational costs and relationship costs to going too far in that sex-negative, romance-deterring directions. &nbsp;</p><p>(Disclosure: I fell in love with my wife Diana Fleischman partly because we were both passionate about EA. I admired her work. She admired my work. If EA had been a more sex-negative, romance-negative subculture, we might not have formed a relationship, gotten married, or had our daughter. I would hate for other EAs not to be able to find like-minded mates within the EA community.)</p>", "parentCommentId": null, "user": {"username": "geoffreymiller"}}, {"_id": "F4jnSkg3C4ugRKLNE", "postedAt": "2023-03-08T07:36:15.442Z", "postId": "EQPY63WzxmqQnWsmS", "htmlBody": "<p>Really good to see some concrete suggestions and experiences, thank you for sharing</p>\n", "parentCommentId": null, "user": {"username": "jooke"}}, {"_id": "HGYiPieRpt95CBSRA", "postedAt": "2023-03-08T10:48:32.319Z", "postId": "EQPY63WzxmqQnWsmS", "htmlBody": "<p>Interesting idea. Any evidence/anecdotes on how (far) this rule has been endorsed, and how it has worked out in authentic relating community?&nbsp;</p>", "parentCommentId": null, "user": {"username": "personunderthesun"}}, {"_id": "WTanhkLZrXvJ6ZYA9", "postedAt": "2023-03-08T12:19:11.007Z", "postId": "EQPY63WzxmqQnWsmS", "htmlBody": "<p>When I think \"community builder\", I think of someone who's running an EA group longterm, potentially for years. I think this policy works for one-off events but how does it work for longterm community builders?</p>\n", "parentCommentId": null, "user": {"username": "Khorton"}}, {"_id": "NCqkhp8RBfjMvJmsv", "postedAt": "2023-03-08T12:25:39.603Z", "postId": "EQPY63WzxmqQnWsmS", "htmlBody": "<blockquote><p>My concern is that if we sexually neuter all EA groups, meetings, and interactions, and sever the deep human motivational links between our mating effort and our intellectual and moral work, we'll be taking the wind out of EA's sails. We'll end up as lonely, dispirited incels rowing our little boats around in circles, afraid to reach out, afraid to fall in love.</p></blockquote><p>These are some pretty strong claims that don't seem particularly well substantiated.</p><p>&nbsp;</p><blockquote><p>Is trying to be romantically attractive the \"wrong reason\" for doing excellent intellectual work, displaying genuine moral virtues, and being friendly at meetings?</p></blockquote><p>I also feel a bit confused about this. I think if someone is taking a particular action, or \"investing in difficult, challenging behaviors <strong>to attract mates</strong>\", it does seem clear there are contexts where the added intention of \"to attract mates\" changes how the interaction feels to me, and contexts where that added intention makes the interaction feel inappropriate. For example, if I'm at work and I think someone is friendly at the meeting because they primarily want to attract a mate vs if they are following professional norms vs if they're a kind person who cares about fostering a welcoming space for discussion, I do consider some reasons better than others.</p><p>While I don't think it's wrong to try to attract mates at a general level, I think this can happen in ways that are deceitful, and ways that leverage power dynamics in a way that's unfair and unpleasant (or worse) for the receiving party. In a similar vein, I particularly appreciated Dustin's tweet <a href=\"https://twitter.com/moskov/status/1628910874483396608\">here</a>.</p><p>I do think International Women's Day is a timely prompt for EA folks to celebrate and acknowledge the women in EA who are drawn to EA because they want to help find the best ways to help others, or to put them into practice. I appreciate (and am happy for you &amp; Diana!) that there will be folks who benefit from finding like-minded mates in EA. I also agree that often there are overt actions that come with obvious social costs, and \"going too far\" in the other direction seems bad by definition. But I also want to recognise that sometimes there are likely actions that are not \"overtly\" costly, or may even be beneficial for those who are primarily motivated to attract mates, but may be costly in expectation for those who are primarily interested in EA as a professional space, or as a place where they can collaborate with people who also care about tackling some of the most important issues we face today. And I think this is a tradeoff that's important to consider - ultimately the EA I want to see and be part of is one that optimises for doing good, and while that's not mutually exclusive to trying to attract mates within EA, I'd be <a href=\"https://forum.effectivealtruism.org/posts/omoZDu8ScNbot6kXS/beware-surprising-and-suspicious-convergence\">surprised </a>if doing so as the primary goal also happened to be the best approach for doing good.</p>", "parentCommentId": "CcxczRwdxeroR3ZJc", "user": {"username": "bruce"}}, {"_id": "ThKSYLJBEoCCh3gPr", "postedAt": "2023-03-08T13:20:03.344Z", "postId": "EQPY63WzxmqQnWsmS", "htmlBody": "<p>I like the suggestion of new mechanisms for handling this well (don't do X within Y time period). I don't know what the perfect answer is (and I'm not even sure it's worth our effort to find it, we could just use typical norms and get on with our work) but I think that if we do find something better it will be with nuanced solutions like this.&nbsp;</p><p>Anyone got any other sophisticated solutions?</p>", "parentCommentId": null, "user": {"username": "nathan"}}, {"_id": "fo3oYexpx8ahzz6nA", "postedAt": "2023-03-08T13:48:45.299Z", "postId": "EQPY63WzxmqQnWsmS", "htmlBody": "<p>I'm unclear on the proposal here. I've taken your bit in italics and adapted it to the EA context:</p><blockquote><p><i>For three months after an EAG(x) or EA retreat, and for one month after an evening event, community organisers who organised the event, or speakers/organisers at the conference/retreat are prohibited from engaging romantically, or even hinting at engaging romantically, with attendees. The only exception is when a particular attendee and the facilitator already dated beforehand.</i></p></blockquote><p>Is this what you had in mind? This would mean:</p><ul><li>If an organiser of a local community organises monthly events, they wouldn't be able to date any regular attendee of those events</li><li>People who were organising an EAG in a low-key, not-visible way would be forbidden from dating an attendee, or we would need to define a bar for visibility</li><li>Conference attendees are not prohibited from hitting on other attendees (at least not according to this specific rule)</li></ul><p>Overall, I'd find it much easier to work out whether this is a useful proposal if I were clearer on what is being proposed.</p>", "parentCommentId": null, "user": {"username": "Sanjay"}}, {"_id": "5G36ABokD9n5DA9wg", "postedAt": "2023-03-08T14:10:07.573Z", "postId": "EQPY63WzxmqQnWsmS", "htmlBody": "<p>\"<i>prohibited from engaging romantically, or even hinting at engaging romantically\"</i></p><p>is there a clear definition of romance in this context? my experience is, that there are many different ones out there...</p>", "parentCommentId": null, "user": {"username": "Florian Neetz"}}, {"_id": "X8oB2dqAYSoPvSRkw", "postedAt": "2023-03-08T15:43:32.801Z", "postId": "EQPY63WzxmqQnWsmS", "htmlBody": "<blockquote><p>Well, you're right that signaling intelligence, creativity, wisdom, and moral virtues is sexually and romantically attractive</p></blockquote><p>Geoffrey Miller fighting the good fight, upvoted.</p>", "parentCommentId": "CcxczRwdxeroR3ZJc", "user": {"username": "NunoSempere"}}, {"_id": "Mp8KcKRyB8tEQaMs8", "postedAt": "2023-03-08T15:46:42.566Z", "postId": "EQPY63WzxmqQnWsmS", "htmlBody": "<p>FWIW, I think this post makes progress and could work in the contexts of some groups. As a concrete example, it would probably work for me as an organiser of one-off courses, and probably for organisers of one-off retreats or internships.</p><p>I appreciate the thrust of comments pointing out imperfections in e.g. local group settings, but I just want to be careful that we don't throw out the proposal just because it doesn't work for everyone in all contexts; I think it's better to start with an an imperfect starting point and to iterate on that where it doesn't work in specific contexts, rather than to try to come up with the perfect policy in-theory and get paralysed when we can't achieve that.</p><p>Thanks for highlighting this!</p>", "parentCommentId": null, "user": {"username": "j_bernardi"}}, {"_id": "365sDhu6rdetke9oo", "postedAt": "2023-03-08T15:57:32.729Z", "postId": "EQPY63WzxmqQnWsmS", "htmlBody": "<p>I know that the rule is non-negotiable for people who facilitate retreats under the AuthRev brand.<br><br>AuthRev is rather influential in the (especially north american) AR scene, so I wouldn't be surprised if the rule seeped out further from there. I'm not well-networked enough there to know the details. And even if I could, I don't think I'd want to share the saucy stories that lead to people adjusting the timelines upward and downward until they found their current form.</p>", "parentCommentId": "HGYiPieRpt95CBSRA", "user": {"username": "Severin T. Seehrich"}}, {"_id": "JT6qtn3GrEiy3CmdW", "postedAt": "2023-03-08T16:53:27.134Z", "postId": "EQPY63WzxmqQnWsmS", "htmlBody": "<p>bruce -- I appreciate the respectful and constructive reply.&nbsp;</p><p>For now, I just want to clarify that when we evolutionary psychologists talk about 'mating effort', we're not usually referring to a conscious, self-aware goal of seducing particular people.</p><p>&nbsp;Rather, we're usually referring to an unconscious, evolved motivational state that often nudges people towards public displays of excellence, creativity, and morality, and that is sensitive to contextual &amp; environmental cues of whether such displays are likely to be successful in attracting mates (e.g. tracking local sexual norms, sex ratios, etc). This motivation state evolved because it tends to promote successful reproduction in prehistory -- even if we're not usually making any conscious connection in the modern world between 'giving an excellent, inspiring talk at an EA Global meeting' and 'maximizing genetic self-replication through attracting mates'.</p><p>Mating effort is often unconscious <i>by evolutionary design</i>, because people benefit from having plausible deniability about whether they're really trying to attract mates (e.g. to minimize interference from sexual rivals, to save face after sexual rejections, &amp; to keep any current mates from being jealous). This leads to 'adaptive self-deception' about what they're really doing, and why. But we can still empirically study the effects of mating effort by seeing how it's influenced by the contextual/environmental factors (e.g. it tends to be lower when local sexual norms inhibit courtship).&nbsp;</p><p>So what I'm really trying to argue here is that if EA's sexual norms over-correct for sexual harassment issues by going in an extremely sex-negative direction, &nbsp;without any understanding or acceptance of how mating effort drives a lot of human intellectual, moral, and social life, then we will (1) reduce the formation of happy romantic relationships within EA (which is a significant cost in terms of sentient well-being), and (2) take some of the (unconscious) motivation for excellence and morality out of EA work and social networking.</p>", "parentCommentId": "NCqkhp8RBfjMvJmsv", "user": {"username": "geoffreymiller"}}, {"_id": "fttfA935AXvxrnFoT", "postedAt": "2023-03-08T16:57:55.011Z", "postId": "EQPY63WzxmqQnWsmS", "htmlBody": "<blockquote><p>Well, you're right that signaling intelligence, creativity, wisdom, and moral virtues is sexually and romantically attractive.&nbsp;</p></blockquote><p>Signaling intelligence, creativity, wisdom, and moral virtues is not the same as signaling social power by leading events.</p><p>To the extent that people have power through their roles, that's not directly about signaling intelligence, creativity, wisdom, and moral virtues.&nbsp;</p>", "parentCommentId": "CcxczRwdxeroR3ZJc", "user": {"username": "ChristianKleineidam"}}, {"_id": "QuBxEm7fhnBYNvMWc", "postedAt": "2023-03-08T16:59:12.926Z", "postId": "EQPY63WzxmqQnWsmS", "htmlBody": "<p>This is anecdotal, but a similar rule &nbsp;was implemented in a non-EA community group I was in a long time ago, and &nbsp;the level of misconduct decreased significantly. It was not the only rule employed but I think it helped.&nbsp;</p>", "parentCommentId": "HGYiPieRpt95CBSRA", "user": {"username": "titotal"}}, {"_id": "bK7tfMJess6HwkYW9", "postedAt": "2023-03-08T17:25:47.372Z", "postId": "EQPY63WzxmqQnWsmS", "htmlBody": "<p>Christian -- you're right that signaling intelligence during events is not the same as signaling social power by leading events.</p><p>However, why do you think people are motivated to seek power, status, prestige, influence, etc in the first place? Does (unconscious) mating effort play no role at all in these goals?&nbsp;</p><p>In every culture that's been studied so far (and indeed in every sexually-reproductive highly social species that's been studied so far), &nbsp;leadership, power, status, and prestige tend to be romantically attractive, and mating effort tends to drive a lot of status-seeking and leadership-motivation. This is why 'hypergamy' (desire to mate 'upwards' in terms of status and dominance) is a common pattern in social primates.&nbsp;</p><p>I guess the EA subculture could take the view that both hypergamy (as a mate preference) and status-seeking &nbsp;(as a mating strategy) are morally illegitimate, and should not be tolerated. But, again, I think that carries a lot of hidden costs for our movement.</p><p>These are obviously tricky issues, and it can be very difficult for us to acknowledge many of our unconscious motivations. But I hope that EAs reading these posts and comments will take some time to ruminate on their own mate preferences and motivations, and the roles that they have played -- for better or worse -- in their own intellectual and moral lives.</p>", "parentCommentId": "fttfA935AXvxrnFoT", "user": {"username": "geoffreymiller"}}, {"_id": "DyhcJyhFNvWeWLujZ", "postedAt": "2023-03-08T17:44:17.298Z", "postId": "EQPY63WzxmqQnWsmS", "htmlBody": "<p>I think the model is a good idea, but would work only for those, who run workshops occasionally/outside their usual dating circle, otherwise people would be incentivized not to do so. &nbsp;Plus, it shouldn't be treated as a \"golden solution for all of the issues\", rather used with a fair amount of consideration for everybody involved.</p>", "parentCommentId": "WTanhkLZrXvJ6ZYA9", "user": {"username": "Liv"}}, {"_id": "gtxoNbSmAjjArRRLB", "postedAt": "2023-03-08T18:04:02.548Z", "postId": "EQPY63WzxmqQnWsmS", "htmlBody": "<p>I'm confused about whether this is proposing \"non escalation\" or \"non participation\". From the body of the post I was guessing the latter (\"facilitators are prohibited from engaging romantically, or even hinting at engaging romantically, with attendees\"), but the title had the former?</p>\n<p>If an attendee attempts to escalate with a facilitator is that allowed if the attendee makes all of the advances and the facilitator only responds by indicating whether those advances are welcome? Or does the facilitator reject the advances, perhaps citing the policy?</p>\n", "parentCommentId": null, "user": {"username": "Jeff_Kaufman"}}, {"_id": "GmyysFBiSC9r7MoH6", "postedAt": "2023-03-08T18:19:33.830Z", "postId": "EQPY63WzxmqQnWsmS", "htmlBody": "<p>Thanks for sharing this relevant experience from another community! I think there's probably something we can learn from this, though I'm less convinced about applying it directly.</p>\n<p>In the AR community it seems to me like \"facilitator\" vs \"attendee\" is a good proxy for power differentials and the differential fades as time since the event passes. This seems much less applicable here: someone influential in a field (org leader, senior researcher, community builder, etc) in that people listen to their views on what work should be done, who is good, where funding should go, etc, has most of their influence/power independent of any specific event or interaction.</p>\n<p>This seems most applicable to small intensive workshops: if A leads a weekend retreat for fifteen people then I think this rule is great. But if A speaks on a panel at a small session at a 1,000 person conference or is influential without any specific event, then I think we mostly need to handle this with different norms?</p>\n", "parentCommentId": null, "user": {"username": "Jeff_Kaufman"}}, {"_id": "FxadhavZjdzufyyxk", "postedAt": "2023-03-08T18:44:23.681Z", "postId": "EQPY63WzxmqQnWsmS", "htmlBody": "<blockquote><p>Attendees should focus on getting as much ea-related value as possible out of EA events, and we as organizers should focus on generating as much value as possible. Thinking about which hot community builder you can get with later distracts from that. And, thinking about which hot participant you can get with later on can lead to decisions way more costly than just lost opportunities to provide more value.</p></blockquote><p>Strongly agree. Moreover, I think it's worth us all keeping in mind that the only real purpose of the EA community is to do the most good. An EA community in which members view, for example, EA Globals as facilitating afterparties at which to find hook ups, is an EA community which is likely to spend more {time, money, attention} on EAGs and other events than achieves the most good.</p><hr><p>If the current resource level going toward EA community events does the most good,<br>I desire to believe that the current resource level going toward EA community events does the most good;<br>If less {time, money, attention} spent on EA community events does the most good,<br>I desire to believe that less {time, money, attention} spent on EA community events does the most good;<br>Let me not become attached to beliefs I may not want.</p>", "parentCommentId": null, "user": {"username": "Will Aldred"}}, {"_id": "iy8bmripAKXLzrK85", "postedAt": "2023-03-08T18:56:07.457Z", "postId": "EQPY63WzxmqQnWsmS", "htmlBody": "<p>If you just announced the policy at the start of the event, wouldn't that make it clear enough for everyone?</p>\n<p>Something like ...</p>\n<p>\" Hey, we know the facilitators are amazing and some of you will fall in love with them during the event, but for safety and community reasons we are sorry to inform everyone that we have a rule that they are off limits for 3 months after this events, and you are off limits to them. Please don't flirt with them too much or ask them on a date. We know this is a bit weird but we think it's probably for the best.\"</p>\n<p>That was my first crack at it, but you get the picture :D</p>\n", "parentCommentId": "gtxoNbSmAjjArRRLB", "user": {"username": "NickLaing"}}, {"_id": "G8heRnG5LPBv4Nu3c", "postedAt": "2023-03-08T19:02:48.794Z", "postId": "EQPY63WzxmqQnWsmS", "htmlBody": "<p>Thanks Jeff what makes you less convinced about applying it directly? Im not sure you laid out your issues with it? 100 percent agree it's only one small rule which only applies in limited contexts and doesn't solve what's probably the biggest problem which you laid out (dangerous power differentials unrelated to events) but I think it could make a small positive difference at least.</p>\n<p>Yes there would have to be nuance and I would suspect if you were a speaker on a panel this role wouldn't apply. Or maybe just no romantic stuff during the conference itself for people with less of a power differential?</p>\n", "parentCommentId": "GmyysFBiSC9r7MoH6", "user": {"username": "NickLaing"}}, {"_id": "c5FXqnrdjJkuM9Q57", "postedAt": "2023-03-08T19:11:43.340Z", "postId": "EQPY63WzxmqQnWsmS", "htmlBody": "<p>My confusion is actually over the intent, and not the implementation.  Like, both of these are things I could see people proposing:</p>\n<ol>\n<li>\n<p>Facilitators don't make any advances towards attendees.</p>\n</li>\n<li>\n<p>Additionally attendees don't towards facilitators.</p>\n</li>\n</ol>\n<p>I currently am guessing Severin is proposing (2), but the \"non-escalation\" phrasing meant I wanted to check whether they actually meant (1).</p>\n", "parentCommentId": "iy8bmripAKXLzrK85", "user": {"username": "Jeff_Kaufman"}}, {"_id": "AKBbtk4uk8Tkty8uN", "postedAt": "2023-03-08T19:12:48.861Z", "postId": "EQPY63WzxmqQnWsmS", "htmlBody": "<p>There are different concerns when it comes to Authentic Revolution and the EA community. Authentic Revolution hosts events where people become emotionally vulnerable which calls for rules that prevent that vulnerable state from being abused by people leading the events.</p><p>In the EA community, a lot of concerns about power abuse are about helping with professional connections. Waiting three months reduces the emotional impact of an Authentic Revolution event but it changes little about the power a person in a leadership role has to help a person to get a job at an EA org.&nbsp;</p>", "parentCommentId": null, "user": {"username": "ChristianKleineidam"}}, {"_id": "WjDHbpNnTerQwJtmm", "postedAt": "2023-03-08T19:18:39.828Z", "postId": "EQPY63WzxmqQnWsmS", "htmlBody": "<p>Oh, I interpreted it as clearly 2, 90 percent confident ;).</p>\n", "parentCommentId": "c5FXqnrdjJkuM9Q57", "user": {"username": "NickLaing"}}, {"_id": "ntRojYykv36wc4cd8", "postedAt": "2023-03-08T19:18:55.459Z", "postId": "EQPY63WzxmqQnWsmS", "htmlBody": "<p>Example issues with applying it directly:</p>\n<ul>\n<li>\n<p>If someone hosts weekly EA meetups for their community, mostly because they happen to be a local EA whose apartment/house has a good common space and is centrally located, they can't date anyone in their local EA community, since mostly someone will have attended one of their events within the last month.</p>\n</li>\n<li>\n<p>If someone speaks at an EAGx they can't date anyone who attended for 3m, even if the attendee is of equal or higher status/power within EA.</p>\n</li>\n</ul>\n", "parentCommentId": "G8heRnG5LPBv4Nu3c", "user": {"username": "Jeff_Kaufman"}}, {"_id": "jBRp3ct3ozWA3DtXH", "postedAt": "2023-03-08T19:39:29.330Z", "postId": "EQPY63WzxmqQnWsmS", "htmlBody": "<p>\"don't do X within Y time period\" is also broadly how high school program rules in the EA space I'm familiar with work (though Y is significantly longer, but it's especially relevant when you have junior counselors close to attendees in age)</p>", "parentCommentId": "ThKSYLJBEoCCh3gPr", "user": {"username": "ChanaMessinger"}}, {"_id": "35amvFv4hrDpGMyqq", "postedAt": "2023-03-08T19:40:26.202Z", "postId": "EQPY63WzxmqQnWsmS", "htmlBody": "<p>I'm very sympathetic to this but also really resonate with</p><blockquote><p>The purpose of the effective altruism community is not to make effective altruists happy or to get them relationships, and by the same token the purpose of my personal life<i> is not to improve the health or public relations of the effective altruism movement</i>.</p></blockquote><p>From this <a href=\"https://thingofthings.substack.com/p/on-demandingness-polyamory-and-effective\">piece</a>.<br>&nbsp;</p>", "parentCommentId": "FxadhavZjdzufyyxk", "user": {"username": "ChanaMessinger"}}, {"_id": "q88pjrsgvDtd7zyHx", "postedAt": "2023-03-08T21:23:07.863Z", "postId": "EQPY63WzxmqQnWsmS", "htmlBody": "<p>Your last section appears a nonsequitor to me. Feel free to explain how it is not?&nbsp;<br><br>But to the extent we should be talking about resource allocation, I think someone should flag that some antidating policies may have the effect of less resources being put on interventions that could be good. Let's be honest, community building is not a high status gig in EA say compared to researcher, &nbsp;founder, etc. The mantra \"Those who can't do, teach\" comes to mind, whether it should or not. And EAs rarely do organizing fulltime... even the EA infrastructure fund said they get very few applications for funding to do it as a salary role. But we want someone to do these things.&nbsp;And people leave CB for brighter professional pastures and to solve more novel problems constantly.<br><br>As a community organizer, I am/would be really hesitant to date event attendees before they first become very good friends outside of the context. But one of the few professional benefits that CB has compared to other things is the ability to meet and make connections with people. Remove even part of that, and make people stifle themselves, and I think community organizing will lose some of its zest as a career or freetime focus that keep people motivated about it, and which we want people to focus on. Well, at least it might remove some zest and people working on the problem, and make us less aligned with our priorities, as much as the other side of the coin which you have brought up.</p>", "parentCommentId": "FxadhavZjdzufyyxk", "user": {"username": "Ivy_Mazzola"}}, {"_id": "PeAjwPHowrDtR5wAP", "postedAt": "2023-03-08T22:18:09.447Z", "postId": "EQPY63WzxmqQnWsmS", "htmlBody": "<p>PS -- for folks who have disagree-voted on my post here, I'd appreciate any feedback on which specific ideas or arguments you disagree with.</p>", "parentCommentId": "CcxczRwdxeroR3ZJc", "user": {"username": "geoffreymiller"}}, {"_id": "CLDfBurxeidg424wD", "postedAt": "2023-03-08T22:21:31.819Z", "postId": "EQPY63WzxmqQnWsmS", "htmlBody": "<blockquote><p>Overall, I'd find it much easier to work out whether this is a useful proposal if I were clearer on what is being proposed.</p></blockquote><p>Agree. It's a big ask, but I would also find it much easier to evaluate this if there were examples of something negative that would have been prevented by this policy.</p><p>Are there any other instances of harm that we know about that would have been prevented by this policy, besides the cases at CFAR?</p>", "parentCommentId": "fo3oYexpx8ahzz6nA", "user": {"username": "Lorenzo Buonanno"}}, {"_id": "cBnrWbx9yuMyLh2Ck", "postedAt": "2023-03-08T23:22:15.899Z", "postId": "EQPY63WzxmqQnWsmS", "htmlBody": "<p>I feel like the power differential between community builders and new members decreases over time as the new member \"graduates\" from being a new member and becomes a longer-term members, so perhaps the policy could apply for the first few months of the member's involvement?</p>", "parentCommentId": "WTanhkLZrXvJ6ZYA9", "user": {"username": "Daniel_Eth"}}, {"_id": "Hf7sadyrWzYgwtqZH", "postedAt": "2023-03-09T01:52:23.324Z", "postId": "EQPY63WzxmqQnWsmS", "htmlBody": "<p>Can you share more on your view as to the distinction between \"the purpose of my personal life is not to improve the health of EA\" versus \"I have a personal responsibility to not conduct my personal life in a way that systematically/repeatedly harms the EA community.\" The first sentence, at least in a very literal reading, seems non-controversial to me. The second sentence seems to be where people run into trouble and disagreement, and what proposals like this once are trying to enact. Are you also disagreeing with this second statement? If so, could you share more? Do people generally agree with the second statement, but the disagreement comes from what sorts of behaviors are \"systematically harmful\"?</p><p>Or is there a third position that I'm missing?</p><p>I also want to note that, while I don't think this is severe or anything, I find it concerning that a community health representative is ostensibly endorsing a post which contains an image/meme trivializing a discussion around what norms to set to make EA a less destructive space for women. Not that you can't endorse any ideas expressed in the post, but without a caveat it makes me wonder, does the community health team share that trivializing view towards these discussions?</p><p>(This might be too harsh. But sharing my gut level reaction)</p>", "parentCommentId": "35amvFv4hrDpGMyqq", "user": {"username": "Masha Winchell"}}, {"_id": "p2o2MTBvXgioBAhth", "postedAt": "2023-03-09T10:08:06.125Z", "postId": "EQPY63WzxmqQnWsmS", "htmlBody": "<p>If there were other rules employed that you think helped, feel encouraged to write them up too!</p>\n", "parentCommentId": "QuBxEm7fhnBYNvMWc", "user": {"username": "BenMillwood"}}, {"_id": "XhBPkt5dGGvkifxfp", "postedAt": "2023-03-09T10:52:58.694Z", "postId": "EQPY63WzxmqQnWsmS", "htmlBody": "<p>In EA, the roles of \"facilitator\" and \"attendee\" may not be as straightforward as they appear to be in AR. From personal experience, there are many influential people in the EA community who do not hold designated roles that overtly reveals their power. Their influence/soft power only becomes apparent once you get a deeper understanding of how community members interrelate and how information is exchanged. On the other hand, someone who is newly on a Community Building grant may have more power on paper than in reality.</p><p>I agree with the need for a policy. I just want it to reflect the nuances of power dynamics in EA. While no policy will be perfect, we should aim to create one that does not unnecessarily restrict people – which could lead to disillusionment with the policy. And more importantly, one that does stick in cases where it should stick – e.g. to people with a lot of soft power.</p>", "parentCommentId": "GmyysFBiSC9r7MoH6", "user": {"username": "TobiasH"}}, {"_id": "FPqHtNW7PWHzR6ou9", "postedAt": "2023-03-09T12:44:17.827Z", "postId": "EQPY63WzxmqQnWsmS", "htmlBody": "<p>Thanks Jeff</p><p>Again there needs to be nuance. Weekly events surely wouldn't be included, and like I said below I think maybe a speaker could be off limits for the duration of EAGx but then no restrictions afterwards?&nbsp;</p><p>I don't think those are concrete reasons not to apply it, just scenarios where it should be handled differently from the OP's original scenario</p><p>I agree there are so many potential scenarios it would be hard to be fair and consistant.</p>", "parentCommentId": "ntRojYykv36wc4cd8", "user": {"username": "NickLaing"}}, {"_id": "SsmCutz6orKKKPpzy", "postedAt": "2023-03-09T13:25:21.452Z", "postId": "EQPY63WzxmqQnWsmS", "htmlBody": "<p><em>&gt; Weekly events surely wouldn't be included</em></p>\n<p>I don't think that's obvious from the post? It describes the AR policy as including \"for one month after an evening event\" and then recommends community builders adopt this policy.</p>\n<p>But I'm not really sure that we disagree on anything -- I was trying to answer your \"what makes you less convinced about applying it directly?\"</p>\n", "parentCommentId": "FPqHtNW7PWHzR6ou9", "user": {"username": "Jeff_Kaufman"}}, {"_id": "C9vt45SZLskCNohwq", "postedAt": "2023-03-09T15:11:15.103Z", "postId": "EQPY63WzxmqQnWsmS", "htmlBody": "<p>I think there’s a distinction between people you meet at EA events and people you’ve already connected with outside. Otherwise, this could very easily become unworkable where you connect with people outside EA, you mention the you’re interested in EA and so they come to an event, then any dating momentum is broken because you’re not supposed to flirt with them for a while. If it happens enough, this could easily stifle someone’s dating life.</p>\n<p>(It’s worth noting that AR events are a lot more intense than EA, where this policy might make more sense)</p>\n", "parentCommentId": null, "user": {"username": "casebash"}}, {"_id": "yC84ToC9obgahmyTY", "postedAt": "2023-03-09T18:40:52.495Z", "postId": "EQPY63WzxmqQnWsmS", "htmlBody": "<p><strong>TLDR: Agree with the risks, unsure if it's better to restrict flirting for \"x weeks\" or for \"however long there's a power dynamic and/or vulnerability etc\"</strong><br><br>Thanks for sharing! Good to be reminded that this is a risk in any community (especially communities with both personal and professional relationships) and that others may have thought more about this and found better solutions.&nbsp;<br><br>This seems most risky in situations in which:&nbsp;<br>- Alice is new to EA (still in the \"orientation phase\") and looking for jobs.&nbsp;<br>- Bob is an experienced (paid or volunteer) EA group organiser, could help Alice professionally (knows people who might have jobs for Alice etc) and also finds Alice attractive.&nbsp;<br><br>The risk seems to come from a perceived&nbsp;<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnref8hm3zxpjq8m\"><sup><a href=\"#fn8hm3zxpjq8m\">[1]</a></sup></span>or actual power dynamic, and this is exacerbated if one person is somehow \"vulnerable\", like when they're new to the community and don't yet know the norms, or do not yet feel comfortable expressing boundaries or reaching out to other community members to ask for advice or support. <a href=\"https://forum.effectivealtruism.org/users/severin?mention=user\">@Severin</a> Would you agree?&nbsp;<br><br>If that's the case, would it make sense to discourage/ban flirting not for x amount of weeks but for however long there's a (perceived or actual) power dynamic and/or \"vulnerability\"? This might then vary between one week (?) and forever.&nbsp;<br>&nbsp;</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fn8hm3zxpjq8m\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnref8hm3zxpjq8m\">^</a></strong></sup></span><div class=\"footnote-content\"><p>Note that a perceived power difference is sufficient - if Alice thinks that Bob has the power to help or hinder her career (maybe because he mentioned he knows influential person x personally), that will make her hesitant to express boundaries when she receives unwanted attention from Bob, even if it's not actually true.&nbsp;</p></div></li></ol>", "parentCommentId": null, "user": {"username": "Manuel_Allgaier"}}, {"_id": "p6jL77D54hoGeWNuN", "postedAt": "2023-03-10T02:21:34.154Z", "postId": "EQPY63WzxmqQnWsmS", "htmlBody": "<p>Why would it be a problem for long-term community builders?<br><br>Anecdote: I used to help run a local university group in Australia. While helping run that group, I didn't try to date or sleep with attendees. Also while running that group, I met wonderful woman in a separate context who wasn't involved in the EA community, we entered into a relationship, and are now happily married and expecting a child.<br><br>I've also got lots of EA friends who've done community building in the past and are in really happy romantic relationships with spouses they met in a non-EA context as well.</p>", "parentCommentId": "WTanhkLZrXvJ6ZYA9", "user": {"username": "Xavier_ORourke"}}, {"_id": "dcDkjPsJJ9YbcbdRg", "postedAt": "2023-03-10T03:10:24.453Z", "postId": "EQPY63WzxmqQnWsmS", "htmlBody": "<p>The main reason I disagree is that to me it seems plainly obvious that it's far better for a community organiser's motivations to be related to earning respect/advancing their career/helping others, rather than their reason for participating in EA being so they can have more sex. This is because, if they're motivated by wanting to have more sex, then this predictably leads to more drama and more sexual harrassment.<br><br>I also don't think you did enough to back up the inference \"lots of people are motivated by sex, therefore we should try to harness this, instead of encouraging people to suppress these instincts in problematic contexts\".<br><br>As a comparison, lots of people get excited by conflict and gossip too. That doesn't automatically mean we should be trying to harness, rather than suppress those things</p>", "parentCommentId": "PeAjwPHowrDtR5wAP", "user": {"username": "Xavier_ORourke"}}, {"_id": "SbmiCvEhDNorabij6", "postedAt": "2023-03-10T03:27:04.924Z", "postId": "EQPY63WzxmqQnWsmS", "htmlBody": "<p>Also the claim that<br><br>\"We'll end up as lonely, dispirited incels rowing our little boats around in circles, afraid to reach out, afraid to fall in love.\"&nbsp;<br><br>Srikes me as patently false given myself and many people I know personally who engage with EA have partners from outside the EA community</p>", "parentCommentId": "dcDkjPsJJ9YbcbdRg", "user": {"username": "Xavier_ORourke"}}, {"_id": "gcHcpthyuLsuyMCtY", "postedAt": "2023-03-10T03:37:51.848Z", "postId": "EQPY63WzxmqQnWsmS", "htmlBody": "<p>Not sure, but my guess is the worry here is if many EA community builders end up having the vast majority of their social connections tied to the EA space this might be an issue?</p>", "parentCommentId": "p6jL77D54hoGeWNuN", "user": {"username": "pseudonym"}}, {"_id": "NuaKHyjxwjhxnKh5f", "postedAt": "2023-03-10T04:43:40.448Z", "postId": "EQPY63WzxmqQnWsmS", "htmlBody": "<p>If EA community organisers are ending up isolated from everyone not involved in EA, that a really big problem!</p>\n", "parentCommentId": "gcHcpthyuLsuyMCtY", "user": {"username": "Xavier_ORourke"}}, {"_id": "PGrpWctkMaKnDeA6P", "postedAt": "2023-03-10T09:31:48.987Z", "postId": "EQPY63WzxmqQnWsmS", "htmlBody": "<p>I strongly disagree that the meme or post trivializes that discussion. If you read the post, you'll see that Ozy (the writer) doesn't think the discussion is silly, they just object to people dragging polyamory into it and making unreasonable demands. (Fwiw I'm a woman and Ozy is non-binary, so we are both part of the constituency that these discussions are supposed to help).</p>", "parentCommentId": "Hf7sadyrWzYgwtqZH", "user": {"username": "Amber"}}, {"_id": "kEmg3cG8rKFFeFHTm", "postedAt": "2023-03-10T09:51:10.466Z", "postId": "EQPY63WzxmqQnWsmS", "htmlBody": "<p>This is an interesting idea and I'd be in favour of at least some version of it.&nbsp;<br><br>A distinction I think about often is: who is initiating? Where there is a power dynamic, it seems more risky if the more powerful person initiates romance, and less risky if the less-powerful person does and the more-powerful one just reciprocates. So I might be in favour of versions of these rules which say 'the more-powerful person shouldn't initiate for X time (maybe never, in cases where the power relationship is particularly pronounced), but if the less-powerful person initiates, they may reciprocate'.&nbsp;<br><br>There are some complications here: e.g., maybe it would encourage more-powerful people to kind of 'fish' for interest from the other. But still: 'this powerful person is into me and is sort-of flirting with me, but in a plausibly-deniable way I can ignore' seems a lot better than 'this powerful person asked me out and now I have to turn them down'.&nbsp;<br><br>Fwiw, I don't viscerally feel like there's a strong power dynamic between me and my local community builders - or at least, no more than the dynamic between me and other people who have more general 'EA community status' than me (e.g., people who work at 80k). I don't think I'd find being hit on by a community builder massively fraught. &nbsp;I'm not claiming that others should or do feel this way - just adding my data point.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Amber"}}, {"_id": "gFkR3uM8LcFdorX6C", "postedAt": "2023-03-10T13:31:11.069Z", "postId": "EQPY63WzxmqQnWsmS", "htmlBody": "<p>Yep, the problem this particular rule tries to fix is that of perceived power imbalance and all the troubles that come with it.</p>\n<p>It is an imperfect proxy for sure, but non-proxy rules like \"No dating if there is a perceived power imbalance.\" are very, very prone to tempt people into motivated reasoning. It can get very hard for humans to evaluate their power imbalance with Alice when oh damn are these freckles cute. False beliefs, from the inside, feel not like beliefs, but like the truth. Because of that, I wouldn't trust anyone with power who would trust themselves with power.</p>\n<p>Note also that while \"Bob has power over Alice's career\" is a significant component of how power works in EA, power in humans has many more subtle nuances than factual access to resources. Even without explicit concerns like \"If I don't do what Bob wants, Bob will make my career progression harder.\", power is shiny and overpowering and does all kinds of funny things to our monkey brains. See for example how our brains automatically adjust what we consider good fashion choices to who we deem popular in our particular subcultural bubble, how we mold our habits by them, etc.</p>\n<p>For a more crass example, the 20th century had its wealthy share of spiritual leaders with sex scandals. Though e.g. Osho had no power over his followers' real-world careers, they worshipped him like a demigod. I think it goes without question that it would be if not impossible at least outstandingly difficult for him to have a truly consensual relationship with one of his followers. Because there's no true \"yes\" without an easy \"no\", and there's no easy \"no\" if the prophet himself calls you to his quarters.</p>\n<p>(Which is of course very sad and inconvenient for Osho and requirement to adhere to this rule might have turned him off guruing completely, because the list of documented 20th century female gurus is short.)</p>\n", "parentCommentId": "yC84ToC9obgahmyTY", "user": {"username": "Severin T. Seehrich"}}, {"_id": "EbajhuCeoxzoGQPmn", "postedAt": "2023-03-10T13:37:03.364Z", "postId": "EQPY63WzxmqQnWsmS", "htmlBody": "<p>Yup, \"don't hit on people who don't hit on me first.\" is a weaker rule I already decided to adhere to in EA before I started thinking about the one outlined in this post. Independent of power, it just seems utterly necessary to manage the gender imbalance.</p>\n", "parentCommentId": "kEmg3cG8rKFFeFHTm", "user": {"username": "Severin T. Seehrich"}}, {"_id": "yS8Znc9mjJodLosjr", "postedAt": "2023-03-10T13:44:59.771Z", "postId": "EQPY63WzxmqQnWsmS", "htmlBody": "<p>Yep, I'm with Xavier here. The rule incentivizes community builders a bit to not make EA their only social bubble (which is inherently good I think). And it is not without workarounds, all of which cushion the addressed problem.</p>\n<p>For example, it encourages local community builders to hand over event facilitation to others more often. And if the rule is publicly known, participants can take a break from events that one leader leads to get around the rule. If participants don't know the rule, they'd get informed about its existence when they hit on an organizer. In either case, the consequence of even intentionally working around the rule would be <em>taking it slow</em>.</p>\n", "parentCommentId": "NuaKHyjxwjhxnKh5f", "user": {"username": "Severin T. Seehrich"}}, {"_id": "dBcih9aBzhp48Etq3", "postedAt": "2023-03-10T16:22:11.148Z", "postId": "EQPY63WzxmqQnWsmS", "htmlBody": "<p>The meme is absolutely trivializing. It is mocking the opposite side of the discussion. The text of the post is not trivializing. Agreeing with the meme does not mean the meme is not trivializing.</p>\n", "parentCommentId": "PGrpWctkMaKnDeA6P", "user": {"username": "Masha Winchell"}}, {"_id": "BhXXiZDFBMmFKAP9w", "postedAt": "2023-03-10T18:07:57.296Z", "postId": "EQPY63WzxmqQnWsmS", "htmlBody": "<p>Yeah, happy to clarify; to reiterate I’m very sympathetic to what Will said about how EA isn’t about making sure you have the personal life you want to have. What I’m sympathetic to in the sentence I quoted (while not necessarily agreeing with the whole article, which I didn’t intend to imply by quoting the sentence) was the healthiness of feeling a certain protectiveness over your personal life. While I intended my comment in a personal capacity (and should have said so), it also seems to me to be a matter of community health that people (including when I think particularly of women’s experiences) are able to set boundaries around how much EA takes over their lives, ends up taking away things that are nourishing or important to them, or makes unsustainable demands.</p><p>I think you’re right that the sentence doesn’t really, on its own, help us figure out what the right limits are on what’s appropriate and what’s not, and where the “this is personal” line can get drawn. I’m pretty open to a wide range of possible norms, including those that ask for people to act quite differently in their personal life than they otherwise would because it’s better for the world, and I’m quite up for figuring out the right consequentialist view on it (I personally take on sacrifices in that direction, and think it’s appropriate that many others do as well). I read Ozy as agreeing with this, given their paragraph here<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefjzxs4vh5t58\"><sup><a href=\"#fnjzxs4vh5t58\">[1]</a></sup></span>.</p><p>I do think there is some tension here. I take it as part of the Community Health team’s job to navigate that tension and figure out what overall helps the community be a place where people can flourish and do their best work. Sometimes this isn’t hard - harassment and assault and abuse of power and so on aren’t categorically out of our remit just because they sometimes happen in people’s personal lives - and sometimes it’s more complicated.</p><p>Not the least bit my intention to trivialize the discussion, and the team cares a tremendous amount about figuring these things out well.&nbsp;</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnjzxs4vh5t58\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefjzxs4vh5t58\">^</a></strong></sup></span><div class=\"footnote-content\"><p>\"I of course believe that effective altruists should follow common-sense sexual ethics, which includes not hitting on people in your chain of command, avoiding any pressure into sex, and being careful about relationships with coworkers, with people much younger than you, and people you have power over. I support a norm of no cuddle piles or flirting at effective altruist retreats, meetups, events, or afterparties; effective altruism can certainly set the norms at official EA events, and it makes sense to me that these should be asexual spaces. I agree that certain people, by virtue of their position, grant the effective altruism movement more say in their romantic lives. A grantmaker, a charity founder or executive, or a community organizer should take great care to make sure they don’t have sex with anyone they might wind up with power over.)\"</p></div></li></ol>", "parentCommentId": "Hf7sadyrWzYgwtqZH", "user": {"username": "ChanaMessinger"}}, {"_id": "stebPyQGrb6XbGwyu", "postedAt": "2023-03-11T01:05:42.640Z", "postId": "EQPY63WzxmqQnWsmS", "htmlBody": "<p>I really don't think the crux is people who disagree with you being unwilling to acknowledge their unconscious motivations. I fully admit that sometimes I experience desires to do unsavory things such as</p><p>- Say &nbsp;something cruel to a person that annoys me<br>- Smack a child when they misbehave<br>- Cheat on my taxes<br>- Gossip about people in a negative way behind their backs<br>- Eat the last slice of pizza without offering it to anyone else<br>- Not stick to my GWWC pledge<br>- Leave my litter on the ground instead of carrying it to a bin<br>- Lie to a family member and say \"I'm busy\" when they ask me to help them with home repairs<br>- Be unfaithful to my spouse<br>- etc.</p><p>If you like, for sake of argument let's even grant that for <strong>all</strong> the nice things I've ever done for others, ultimately I only did them because I was subconsciously trying to attract more mates (leaving aside the issue that if this was my goal, EA would be a terribly inefficient means by which to achieve it).<br><br>Even if we grant that that's how my subconscious motivations are operating, it still doesn't matter. It's still better for me to not go around hitting on women at EA events, and the EA movement is still better off if I'm incentivised not to do it.<br><br>Maybe all men have have a part of ourselves which wants to live the life of Genghis Khan and torture our enemies and impregnate every attractive person we ever lay eyes on - but if that were true, that wouldn't imply it's ethical or rational to indulge that fantasy! And it <strong>definitely</strong> wouldn't imply that the EA project would be better off if we designed our cultural norms+taboos+signals of prestige in ways which encourage it.</p><p>The better I am at not giving in to these shitty base urges, and the more the culture around me supports and rewards me for not doing these degenerate things, the happier I will be in the long run and the more positive the impact I have on those around me will be.</p>", "parentCommentId": "bK7tfMJess6HwkYW9", "user": {"username": "Xavier_ORourke"}}, {"_id": "AR7HMgBThEWmjRHoS", "postedAt": "2023-03-11T03:30:58.616Z", "postId": "EQPY63WzxmqQnWsmS", "htmlBody": "<p>Hm, I think I did not communicate my concern clearly. The concern I have is not with the CH lead sympathizing with the text of the post. At least in a personal capacity, I agree that the text of the post adds to the conversation is a useful way.  I also understand that women are not all in agreement on these points.</p>\n<p>The concern I have is the implicit endorsement of the meme shared at the top of the post. Not the text of the post. It's one thing for community members to share these sorts of trivializing memes that mock the position they disagree with. But when the CH lead shares a post that opens with that meme, I wonder, is that how you see that side of the conversation?</p>\n<p>I'm not saying the meme at the top of the post means you can't link to it, quote it, reference it. But I'd want some caveat.</p>\n<p>Maybe my broader point is this is clearly an emotionally intense topic, that touches on many's personal experiences. And as CH lead, many people are looking to you right now, and a lot is riding on it. You have substantial power, and individually us as community members have much less so. So it feels important, at least to me, that I feel this issue is being handled sensitively, with a lot of empathy and understanding. It's fine for you to express sympathy for different positions, and I think it's valuable to transparently see where you are at. But many people have considered this meme to be trivializing and mocking. I think generally memes making fun of an argument they're disagreeing with will have that effect. So seeing you tacitly endorse mocking/trivializing content is upsetting.</p>\n", "parentCommentId": "BhXXiZDFBMmFKAP9w", "user": {"username": "Masha Winchell"}}, {"_id": "kxLLCgm9BqodKeSWt", "postedAt": "2023-03-11T14:40:09.331Z", "postId": "EQPY63WzxmqQnWsmS", "htmlBody": "<p>Full disclosure, because without it, this post would be a bit phony: I haven't always followed this policy within EA or outside, and took just one or two weeks from first thinking it might be good to implement it in EA to writing this post.</p>\n<p>In general, if I write about community dynamics, assume that I think about them this thoroughly not because I'm extraordinary virtuous and clear-sighted in regards to people stuff, but because I'm sometimes socially a bit clumsy and all these models and methods help me function at a level that just comes naturally to others. The question guiding my posts on community dynamics is generally something like: \"What would I-from-ten-years-ago have needed to know to not make the same mistakes I did?\"</p>\n", "parentCommentId": null, "user": {"username": "Severin T. Seehrich"}}, {"_id": "DvBzx5DoGsCDx3qMF", "postedAt": "2023-05-03T15:10:57.754Z", "postId": "EQPY63WzxmqQnWsmS", "htmlBody": "<p>Since writing this, I've done a bunch more debating and thinking about how to handle romantic attraction in communities I'm actively involved in responsibly. So, here's the rule I want to commit to from now on:</p><blockquote><p><i>In any community I'm involved in, I won't be the one driving romantic escalation (or hinting at it) with anyone lower in the institutional hierarchy than me. This applies within 1 month after low-intensity interactions like a 90min workshop and 3 months after high-intensity interactions like a retreat where I was in a lead facilitator role.</i></p></blockquote><p>Some specifications:</p><p>1. Both formal and informal hierarchies count. For example, attendees of workshops I facilitate pro bono or during unconferences still count as \"lower in the hierarchy\".</p><p>2. Responding to advances people lower in hierarchies make towards me is fine. (Unless other reasons make that seem unethical.)</p><p>3. Escalation can only happen if and only if the other person signals at least an obvious 6 on the <a href=\"https://medium.com/prototypethinking/the-should-we-do-this-rating-system-3aac062b1b91\">Decide10 scale</a>. I.e., a lack of proactiveness counts as a \"no\".</p><p>4. Galaxy brain slytherining a la <i>\"I'll just make friends for now and set things up so that they are more likely to propose to me later on.\"</i> or <i>\"You knoooow, I committed to a certain rule because I'm SUCH an ethical person, so if you were to have interest in me, you'd have to be the one to make the first step *wink wink*\"</i> is prohibited.</p><p>5. I might adjust this rule over time as evidence accumulates, but only *after* consulting with people I trust in these matters.</p><p>6. I think a version of this might help us handle EA's gender imbalance better: It might be good if if heterosexual men in general would just accept/decline advances from women, and not proactively flirt themselves.</p>", "parentCommentId": null, "user": {"username": "Severin T. Seehrich"}}]