[{"_id": "mdfWpagebKjH2sbiT", "postedAt": "2022-09-06T18:49:41.202Z", "postId": "ErrJc34wChZW8oHYN", "htmlBody": "<p>Good post; interesting point with that the impact of the founder effect is probably higher in longtermism and I would tend to agree that starting a new field can have a big impact. (Such as wild animal suffering in space, NO FISH ON MARS!)</p><p>Not to be the guy that points something out, but I will be that guy; why not use the classic EA jargon of counterfactual impact instead of contingent impact?</p>", "parentCommentId": null, "user": {"username": "Jonas Hallgren"}}, {"_id": "icmnfRfoMXEtuiTdB", "postedAt": "2022-09-06T19:04:51.991Z", "postId": "ErrJc34wChZW8oHYN", "htmlBody": "<p>Thanks a ton for your kind response (and for being the guy that points something out). :)</p><p>\"Counterfactual\" &amp; \"replaceability\" work too and essentially mean the same thing, so I'm really choosing which beautiful fruit I prefer in this instance (it doesn't really matter).</p><p>I slightly prefer the word <strong>contingent</strong> because it feels less hypothetical and more like you're pulling a lever for impact in the future, which reflects the spirit I want to create in community building. It also seems reflect uncertainty better: e.g. the ability to shift the path dependence of institutions, the ability to shape long-term trends. Contingency captures how interventions affect the full probability spectrum and time-span, rather than just envisioning a hypothetical alternate history world with and without an intervention in x years. Thus, despite hearing the other phrases, it was the first word that <i>clicked</i> for me, if that makes sense.</p>", "parentCommentId": "mdfWpagebKjH2sbiT", "user": {"username": "Richard Ren"}}, {"_id": "DYEbwfTQPinmPaEJc", "postedAt": "2022-09-06T21:34:38.523Z", "postId": "ErrJc34wChZW8oHYN", "htmlBody": "<p>That makes sense, and I would tend to agree that the framing of contingency invokes more of a \"what if I were to do this\" feeling which might be more conducive toward people choosing to do more entrepreneurial thinking which in turn seems to have higher impact</p>", "parentCommentId": "icmnfRfoMXEtuiTdB", "user": {"username": "Jonas Hallgren"}}, {"_id": "uAHXRkQq3rzW8N6qR", "postedAt": "2022-09-07T05:22:53.173Z", "postId": "ErrJc34wChZW8oHYN", "htmlBody": "<p>See also <a href=\"https://forum.effectivealtruism.org/posts/NktbYpwa48u23c5XL/a-cause-can-be-too-neglected\">A cause can be too neglected</a></p>", "parentCommentId": null, "user": {"username": "vaidehi_agarwalla"}}, {"_id": "KmfJLkcdiLpBntChu", "postedAt": "2022-09-11T00:50:37.137Z", "postId": "ErrJc34wChZW8oHYN", "htmlBody": "<p>Nice text, I think it's always valuable to question words and their meaning. However, I don't agree in this case. The whole English-not-as-first-language part of the community took time and effort to squeeze the word \"neglectedness\" into their active memory. Replacing it now with another strange and highly ambiguous term might lead to more confusion than anything else.</p><p>All joking aside, &nbsp;I do think this can cause some misunderstandings. \"Contingency\" in logic/philosophy (according to the <a href=\"https://en.wikipedia.org/wiki/Contingency_(philosophy)\">English</a> and <a href=\"https://de.wikipedia.org/wiki/Kontingenz\">German</a> Wikipedia) defines states that are neither always true nor always false or even a non-necessity of existence. The former, IIUC, is kind of what you want to express—the impact can but doesn't have to be big. But the latter one is definitely too far away from what you describe in (1), (2), and (3): is a cause's existence is not necessary if it is contingent? That makes it seem so unimportant in general and overall! What I would rather like to get out of such a definition is 1) something more like \"It's important but other people are already working on it\" and 2) \"It's important but not right now\". To me, it seems as if \"contingency\" doesn't have such a changeable time dimension, a state described as \"contingent\" to me seems more permanent. \"Neglectedness\", however, does seem to be evaluated at a specific point in time and therefore is able to be subject to change.</p><p>Lastly (and you might just want to disregard this point as not scalable to other languages but maybe other speakers find similarities:), the almost same word \"Kontingenz\" in German means more something like \"subsequent events\". <a href=\"https://de.wikipedia.org/wiki/Kontingenz\">It's closer to the Latin \"contingere\"</a> which stands for \"being close\" or even \"touch\" rather than the Latin \"contingentia\" for \"possibility/chance\". \"Subsequent events\" would of course not make any sense but, again, confuse a lot. (This argument's epistemic status is \"my best guess\" as I don't know Latin very well. Would be glad for anyone who's more familiar here).</p><p>However, there is one dimension I do agree on here with you: In terms of being respected by other research fields. Similar to the effect of the word \"longtermism\", \"neglectedness\" is very specific to the EA community. \"Contingency\" on the other hand, is a term used by <a href=\"https://en.wikipedia.org/wiki/Contingency\">many other disciplines</a>. Especially for new people, an interdisciplinary term is easier to process, find relations to, and maybe even remember. I think this might still hold if the person doesn't know the term beforehand. Alone the possibility of drawing parallels to other fields might make it more intuitive.</p>", "parentCommentId": null, "user": {"username": "ninell"}}, {"_id": "kr4ghcZx44vGF3vpq", "postedAt": "2022-09-16T02:00:09.074Z", "postId": "ErrJc34wChZW8oHYN", "htmlBody": "<p>Alternatively, if you're trying to devise a reliable framework for evaluating decisions, you could just abandon INT in favor of things like <a href=\"https://forum.effectivealtruism.org/posts/gwQNdY6Pzr6DF9HKK/the-coils-framework-for-decision-analysis-a-shortened-intro\">COILS</a> (disclaimer: this is my own personal work), which is actually specifically tailored for decision evaluation (rather than \"evaluating a cause area to indirectly inform decisions\") and is, in my view, actually a relatively reliable framework.</p>", "parentCommentId": null, "user": {"username": "Harrison D"}}]