[{"_id": "Z4ujW5AxMEQWBH2hq", "postedAt": "2023-03-06T03:51:30.212Z", "postId": "Es9wbw3Ptcauvhnrm", "htmlBody": "", "parentCommentId": null, "user": {"username": "more better "}}, {"_id": "yDgJt4TDqa6pXTuha", "postedAt": "2023-03-06T05:08:07.167Z", "postId": "Es9wbw3Ptcauvhnrm", "htmlBody": "<p>Can you describe exactly how much you think the average person, or average AI researcher, is willing to sacrifice on a personal level for a small chance at saving humanity? Are they willing to halve their income for the next ten years? Reduce by 90%?</p>\n<p>I think in a world where there was a top down societal effort to try to reduce alignment risk, you might see different behavior. In the current world, I think the \"personal choice\" framework really is how it works because (for better or worse) there is not (yet) strong moral or social values attached to capability vs safety work.</p>\n", "parentCommentId": "Z4ujW5AxMEQWBH2hq", "user": {"username": "ben.smith"}}, {"_id": "bbaRyjChRH8fsXcu9", "postedAt": "2023-03-06T05:30:39.826Z", "postId": "Es9wbw3Ptcauvhnrm", "htmlBody": "<blockquote><p>What makes you think that the average person rates saving humanity highly enough to make it worth doing alignment research rather than capabilities? &nbsp; That seems like a pretty conservative statement from my experience. Most people I know would definitely take a small-moderate amount of extra money rather than doing more valuable work for humanity. Also building something could feel like more rewarding work than safety work as well.</p></blockquote><p>Maybe I'm missing something, what do you think are the assumptions that that statement makes?</p>", "parentCommentId": "Z4ujW5AxMEQWBH2hq", "user": {"username": "NickLaing"}}, {"_id": "KdxnLJH7NmPqAycec", "postedAt": "2023-03-06T11:49:19.318Z", "postId": "Es9wbw3Ptcauvhnrm", "htmlBody": "<p>Maybe my comment is off, since your article is specifically about AI alignment vs. capabilities research and I was taking the single sentence I quoted out of context. Will remove .</p><p>Reply</p>", "parentCommentId": "bbaRyjChRH8fsXcu9", "user": {"username": "more better "}}]