[{"_id": "dgCYQrJTtHreDJ9an", "postedAt": "2022-11-15T20:48:40.174Z", "postId": "Et7oPMu6czhEd8ExW", "htmlBody": "<p>Thank you for this post Shakeel!</p><p>Correct me if I’m wrong, but I imagine that the main source of frustration you have in mind is professional uncertainty — about funding, job security, etc..</p><p>Another source that might be less obvious is coordination. If it is <i>not</i> the case that major EA orgs are considering e.g. (partial) funding backstops or reparations for the victims of financial crimes, it is possible that people who do not work at these organisations might want to pursue these avenues with urgency.</p><p>I guess all the points made in your post would apply here too. And maybe the second source is obvious. Mentioning just in case!</p>", "parentCommentId": null, "user": {"username": "joel_bkr"}}, {"_id": "WF9QofxkHPzSsmY3b", "postedAt": "2022-11-15T20:55:19.388Z", "postId": "Et7oPMu6czhEd8ExW", "htmlBody": "<p>I think this is sad, and doesn't bode well for the future of the movement. I understand legal risk is scary, but we should be doing some collective soul searching as a community, with more openness and transparency in our communications (including -- or perhaps especially(!) -- from leaders), and less <a href=\"https://srconstantin.github.io/2016/10/20/ra.html\">Ra</a> (arguably it was, ironically, too much worrying about prestige and PR that got us into this mess in the first place!) EDIT to add: staying silent, whist legally safer in most cases, is also a statement (which can be interpreted in multiple ways).</p>", "parentCommentId": null, "user": {"username": "Greg_Colbourn"}}, {"_id": "CtADbiKdwyn5HhxQn", "postedAt": "2022-11-15T21:01:34.594Z", "postId": "Et7oPMu6czhEd8ExW", "htmlBody": "<p>Thank you for posting this. It very much speaks to how I’m feeling right now. I'm grateful you've expressed and explained it.</p>", "parentCommentId": null, "user": {"username": "Michelle_Hutchinson"}}, {"_id": "syZCJsFJpwW9miNXY", "postedAt": "2022-11-15T21:25:28.506Z", "postId": "Et7oPMu6czhEd8ExW", "htmlBody": "<p>Thank you for writing this. It's barely been a week, take your time.</p><p>There's been a ton of posts on the forum about various failures, preventative measures, and more. As much as we all want to get to the bottom of this and ensure nothing like this ever happens again, I don't think our community benefits from hasty overcorrections. While many of the points made are undoubtedly good, I don't think it will hurt the EA community much to wait a month or two before demanding any drastic measures.</p><p>EA's should probably still be ambitious. Adopting rigorous governance and oversight mechanisms sometimes does more harm than good. Let's not throw out the baby with the bathwater.</p><p>I'm still reflecting and am far from having fully formed beliefs yet, I am confused about just how many strong views there have been expressed on the forum. Alone correctly recalling my thoughts and feelings around FTX before the event is difficult. I'm noticing a lot of finger pointing and not a lot of introspection.</p><p>I don't know about everyone else, but I'm pretty horrified at just how similar my thinking seems to have been to SBF's. If a person who seemingly agreed with me on so many moral priorities was capable of doing something so horrible, how can I be sure that I am different?<br><br>I'm going to sit with that thought for a while, and think about what type of person I want to strive to be.</p>", "parentCommentId": null, "user": {"username": "MathiasKirkBonde"}}, {"_id": "mPRxorbHnEXJKzJgT", "postedAt": "2022-11-15T21:46:04.449Z", "postId": "Et7oPMu6czhEd8ExW", "htmlBody": "<p>I have to say that I don't find these reasons especially convincing. It might help if you clarified exactly who you were speaking for and what you mean by the short-term, i.e., days or weeks?</p><p><strong>Legal risk</strong>. I am assuming that you are not suggesting that any of these figureheads have done anything illegal. In which case the risk here is a reputational one: they don't want their words dragged into legal proceedings. But that seems like a nebulous possibility, and legal cases like this can take years in any case. Surely you are not saying that they won't address the subject of FTX or SBF over that entire span lest a lawyer quote them? Or am I misreading you somehow?</p><p><strong>Lack of information. </strong>I agree there's still uncertainty, but there is certainly enough information for the the movement to assess its position and to take action. SBF and an inner circle at FTX/Alameda committed a fraud whose basic contours are now well-known, even if the exact timeline, motivations and particulars are not yet filled in. As this forum proves, that raises some blindingly obvious questions about the governance, accountability and culture of the movement.</p><p><strong>People are busy. </strong>People are always busy, and saying 'I'm too busy' generally means 'I'm choosing not to prioritise this'. It's not an explanation so much as a restatement of an unwillingness to speak.</p><p>To be clear, I am not writing this because I think the leadership should try and set out a comprehensive position on the debacle as soon as possible. I don't think that.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Geuss"}}, {"_id": "kNJWjXcLzdhYPBdSz", "postedAt": "2022-11-16T00:10:17.259Z", "postId": "Et7oPMu6czhEd8ExW", "htmlBody": "<p>Exactly. Let's take some time to reflect and update slowly as needed. First I didn't want to engage at all and saw this as a distraction. Now I'm much more up to date and see it as an opportunity to learn useful lessons about EA and myself as a person so deeply connected with this movement.</p>\n<p>Bit of a wake up call to focus on priorities and not get distracted by the drama, while taking seriously what is happening and keeping accountability within the movement. It's pretty clear something will need to change. Unclear what exactly it will be. My guess that it will be largely around things that are pretty obvious to people who are involved in the community for some time. Such as not being open enough to outside perspective. Not being careful with spending. Not that much resources flowing outside of the movement to bring talented people in. Not that much effort to bring outside sources of funding in (because of easy money we have access to).</p>\n<p>This kind of creates a bubble where everyone can think how good they are without engaging sufficiently with others. Anyway maybe that's not the lesson learned, but just my experience that I now can justify by FTX thingy happening. Still it feels like it gives EAs a permission to question the movement honestly point out core issues they are seeing without feeling like an outcast.</p>\n<p>Things are bad now is the official storyline so we can complain without worries, and that will hopefully lead to fixing things. I guess that's what identity crisis is about. And this is very interesting time to be an EA. Because we will know how it was before that FTX thing happened, haha.</p>\n<p>I believe the shift will be towards being more professional, humble and responsible. This change might help us to be more friendly and reasonable towards people who were not attracted by the EA movement even though they resonate with core ideas (senior professionals, business people, females, environment or social activists, engaged scientists, etc.)</p>\n<p>For me this definitely says I should open myself to outside perspective even more than I was doing before. By this I mean mainly perspectives of people who are in very different bubbles from mine. If they are not trusting EA, my reaction should be that of curiosity. It's much more reasonable reaction to be sceptical than to be sold right away, unless you are in very specific circumstances looking for meaning driven intellectual community.</p>\n<p>Anyway I think EAs are wonderful people and that should probably stay the way it is. We are already very diverse as far as unified communities go. But still a long way to go. My observation of the trend is that EA is becoming more diverse every year. Which is a very good sign and I'd say everyone wants this. While keeping standards of honesty and intellectual engagement high.</p>\n<p>Now we have a bit of honesty crisis, but if we own our parts we might end up stronger than ever before. One person (or few) made silly mistake. We all do from time to time, but luckily most of us doesn't have that much power to make tragic mistake. That's why honesty and transparency or integrity are important. We need some control mechanisms. Many people in this community are incredibly honest. It's not only question of saying what we believe to be true, but being honest enough internally with ourselves that we are aware what are our true believes and motivations. Because easier person to fool with virtue signaling is yourself.</p>\n<p>Anyway my tangent is getting pretty long. We will sleep few more times. Emotions will slowly fade. Only time will tell how good idea this EA project actually is and how good citizens EA aligned people are. Our goal is to contribute to our society. To make it better. So save and improve lives. To make sure future exists. These are beautiful ambitious. But we all know results is what matters. Now we collectively failed. Our hero became point of shame. Ideals were miscalibrated. We need to start again. Think better, be more honest, embrace more perspectives.</p>\n<p>EAs as good people of the world is better framing than EA maximisers. Or better ideal at least for me. We need to come back to earth and reflect on the suffering all around. That's what can keep us grounded. There is humility to acknowledging that world is too complicated for me to control it. Most people are aware of this. EAs a bit less. I think this is a bug of the movement. Not totally sure. I'm definitely not against big ambitions. I think most EAs are not really ambitious. At least less they could be. Largely status competition. But that is part of almost everything people do. Anyway acknowledging that other communities are also important and useful and being in general more appreciative of the outside world might help us to be more aware of our shortcomings and realise that we are not really better than anybody else. Even though we received big funding or have a well respected job. It doesn't mean much. How we behave towards each other and what we actually get done is what matters.</p>\n<p>We should be a community that focuses on getting things done while being kind and considerate of everyone else. That sounds like a nice ambition. I'll end it here.</p>\n", "parentCommentId": "syZCJsFJpwW9miNXY", "user": {"username": "MatejVrzala"}}, {"_id": "qHiQgYMipkKvKHkFn", "postedAt": "2022-11-16T01:02:22.357Z", "postId": "Et7oPMu6czhEd8ExW", "htmlBody": "<blockquote>\n<p>arguably it was, ironically, too much worrying about prestige and PR that got us into this mess in the first place</p>\n</blockquote>\n<p>I'd be curious to hear more about this. Do you mean that EAs wanting to get good press caused or contributed to SBF committing fraud? Or that it caused/contributed to EA being tightly associated with FTX? Or something else?</p>\n", "parentCommentId": "WF9QofxkHPzSsmY3b", "user": {"username": "Erich_Grunewald"}}, {"_id": "yrGEGCXEseJ5mATZ7", "postedAt": "2022-11-16T01:38:23.027Z", "postId": "Et7oPMu6czhEd8ExW", "htmlBody": "<p>\"Legal risk\" is difficult to assess because it could refer any of ten different things. But for some referrents of \"legal risk,\" the fact that many leaders and major organizations all have exposure to the same SBF/FTX-related legal risks would likely itself be indicative of a weakness in how EA is organized and run.</p><p>I'm just making stuff up, but I wonder if movements like EA should have a one or two organizations created to exist on what we might call lukewarm standby. Most of the time, the lukewarm-standby organization wouldn't do much; it has a part-time staff member, some volunteer board members elected by the community (a majority of whom are not affiliated with major organizations), and a minimal fundraising campaign targeted at ordinary EA community members to ensure independence. The closest I can think of to a lukewarm-standby organization in modern life is the Selective Service System in the US (a/k/a \"the draft\"), although it is designed to potentially activate for a specific purpose rather than for a range of purposes.</p><p>However, in a crisis or where major organizations have conflicts, the lukewarm-standby organization could take in some funds and swell in size to handle whatever was needed. At the end of the crisis, the organization could disband if that was seen as prudent, and the community would create another one. For instance, in the current situation, there is potentially a need for an organization to strategize and coordinate surrounding the potential for clawbacks. However, from the original post it sounds like a number of organizations one might ordinarily expect to spearhead this role <i>themselves </i>have SBF/FTX legal risk.</p>", "parentCommentId": null, "user": {"username": "Jason"}}, {"_id": "c2MFBqKvNEWDcKQmE", "postedAt": "2022-11-16T01:58:35.749Z", "postId": "Et7oPMu6czhEd8ExW", "htmlBody": "<p>I like this comment.</p>", "parentCommentId": "syZCJsFJpwW9miNXY", "user": {"username": "RobBensinger"}}, {"_id": "rSLBqSoyHjg8xmbdZ", "postedAt": "2022-11-16T08:18:52.575Z", "postId": "Et7oPMu6czhEd8ExW", "htmlBody": "<p>I was thinking more of what happened at Alameda in <a href=\"https://forum.effectivealtruism.org/posts/xafpj3on76uRDoBja/the-ftx-future-fund-team-has-resigned-1?commentId=jbqsHeeZHrrxkBaxY\">2018</a>, and why (especially if the serious allegations - about SBF nefariously cutting people out of agreed legal ownership of the company - are true) it was (metaphorically) brushed under the carpet.</p>", "parentCommentId": "qHiQgYMipkKvKHkFn", "user": {"username": "Greg_Colbourn"}}, {"_id": "EhnfThmhonDTLR3Rz", "postedAt": "2022-11-16T09:36:14.179Z", "postId": "Et7oPMu6czhEd8ExW", "htmlBody": "<blockquote><p>In particular, I expect that in the short term you’ll get a lot less communication about things than you’d want. This is for a few reasons:</p><ul><li>Legal risk. It’s likely that there will be extensive legal proceedings around FTX that will drag on for a very long time. This means that anything that is said by anyone who is even tangentially involved is at risk of being scrutinised and multiply interpreted by dozens of people, including people whose role (rightly) is to advocate for their clients or those they represent.</li></ul></blockquote><p>I share this concern that everyone will get much less information than they want, which conflicts especially wth the ideals that many EA organisations have of transparency, and integrity.&nbsp;</p><p>Clawback laws can be far-reaching, and in recent cases lawyers (e.g., against Bernard Madoff) have managed to recover significant amounts of investors' money with sufficiently energetic application of these laws.</p><p>So, to give a concrete example, The Centre For Effective Altruism reportedly purchased Wytham Abbey - one of the most beautiful large estates of 2,500 acres in Britain - which was on the the market for £15m last year with Savill's last year.&nbsp;</p><p>https://www.thetimes.co.uk/article/wallet-whisperer-william-macaskill-strikes-again-vrkfpcq6t</p><p>https://www.varenne.fr/files/91410477-f3e6-49a5-a40c-d501dd95550d/The Savills Portfolio.pdf</p><p>As well as being a little unclear about how any such a purchase is consistent with the Centre's altruistic principles in the first place, then if there is the slightest suggestion that any property leases or freehold transfers were funded with money obtained through fraud, it could be vulnerable to seizure.</p><p>My hope that is that the Centre For Effective Altruism could issue some information about their purchase of Wytham Abbey?&nbsp;</p><p>Points to be covered might include:</p><ol><li>What, precisely, was purchased?</li><li>What use is made of it by leaders of the EA movement, employees of CEA and chosen grant-holders?</li><li>The justification for this investment, in terms of EA principles, and who signed off on this reasoning within CEA?&nbsp;</li><li>What was the source of the funding for the purchase, and what are CEA's plans are for the future use of the Wytham Abbey estate?</li></ol><p>Perhaps all this information is available already, in which case I would very much appreciate it if someone could tell me where it is?</p>", "parentCommentId": null, "user": {"username": "iamnotalawyer"}}, {"_id": "pHsRJunktHpdnx2Yt", "postedAt": "2022-11-16T12:16:12.089Z", "postId": "Et7oPMu6czhEd8ExW", "htmlBody": "<blockquote>\n<p>Legal risk. I am assuming that you are not suggesting that any of these figureheads have done anything illegal. In which case the risk here is a reputational one: they don't want their words dragged into legal proceedings. But that seems like a nebulous possibility, and legal cases like this can take years in any case. Surely you are not saying that they won't address the subject of FTX or SBF over that entire span lest a lawyer quote them? Or am I misreading you somehow?</p>\n</blockquote>\n<p>I think you're underestimating how messy being dragged into a court case is - even if you're totally innocent, there can be significant time, emotional, and energy costs, courts aren't perfect at distinguishing truth from falsehood, bankruptcy cases are messy and money can be clawed back, etc etc. I think that taking this seriously is extremely reasonable, regardless of whether you've done something illegal!</p>\n", "parentCommentId": "mPRxorbHnEXJKzJgT", "user": {"username": "Neel Nanda"}}, {"_id": "nAT9rqmcc2Q6ukuB6", "postedAt": "2022-11-16T14:49:13.793Z", "postId": "Et7oPMu6czhEd8ExW", "htmlBody": "<p><i>Edited</i><br><br>I have failed in being too hasty here on some stuff. Someone said to me yesterday ~\"it can wait 2 weeks\" and that's true. If something is true and worth saying, it can wait 2 weeks. Not all decisions/ comments/ thoughts need to happen now.&nbsp;<br><br>I don't regret the initial \"what's happening\" post. But I think I could have waiting longer for reactions.</p>", "parentCommentId": null, "user": {"username": "nathan"}}, {"_id": "ZbumZY6cvDjZKdrbJ", "postedAt": "2022-11-16T15:32:05.053Z", "postId": "Et7oPMu6czhEd8ExW", "htmlBody": "<p>I too would like to know the answers to your questions about Wytham Abbey, but I’m not sure how they’re relevant to the top level post.</p>\n", "parentCommentId": "EhnfThmhonDTLR3Rz", "user": {"username": "David Mears"}}, {"_id": "nfT3dLNsrQsZKnaFL", "postedAt": "2022-11-16T16:04:59.326Z", "postId": "Et7oPMu6czhEd8ExW", "htmlBody": "<p>Do you have something specific in mind where you were too hasty, or do you in hindsight generally think you should've contributed less to trying to figure things out while things were happening? Because my first gut reaction is that the time you and other invested here was likely worth it. Two things that come to mind:&nbsp;</p><ol><li>Some things cannot wait 2 weeks, things are sometimes developing very quickly and one can prevent damages by understanding things better quicklier, even if many things will turn out to be dead-ends and wrong calls.<ol><li>Especially when it seems likely to be such a defining moment in the history of EA.</li></ol></li><li>Related to 1, EA is under a lot of scrutiny right now and cooperating with broader truth-finding processes and clearly saying that we do not condone immoral behavior for the sake of the greater good seems to me very important. And doing this better rather than worse seems important.<ol><li>I saw that people are (I think correctly) worry about legal risk, and that contributes to people close to SBF not wanting to speak up much yet. But I'd guess people who don't face considerable risks are currently being very helpful by trying to contribute to truth-seeking and emphasizing the values of the EA community to outsiders.</li></ol></li></ol>", "parentCommentId": "nAT9rqmcc2Q6ukuB6", "user": {"username": "MaxRa"}}, {"_id": "oa43rBCzuEewcGXWv", "postedAt": "2022-11-16T16:33:38.238Z", "postId": "Et7oPMu6czhEd8ExW", "htmlBody": "<p>In “working on Effective Ventures’ response to the current situation”, who are you representing? Effective Ventures? The EA community?&nbsp;</p><p>If the former, how in principle would you handle conflicting interests between different parts of EV if those were to arise? Do you see it as problematic that nobody is responsible for taking the community's perspective?</p><p>If the latter, are there any mechanisms to protect against potential misaligned incentives (i.e. you being paid by EV) if there were conflicts between the interests of the community and EV?</p>", "parentCommentId": null, "user": {"username": "AnonymousEAForumAccount"}}, {"_id": "LjBsXs6Gwq8raaJor", "postedAt": "2022-11-16T16:45:17.527Z", "postId": "Et7oPMu6czhEd8ExW", "htmlBody": "<p>You make some good points, I may correct the above. As for what I did wrong.. I'll tell you in two weeks.</p>", "parentCommentId": "nfT3dLNsrQsZKnaFL", "user": {"username": "nathan"}}, {"_id": "efPNXQPj8YZCZ9vWB", "postedAt": "2022-11-16T16:55:54.309Z", "postId": "Et7oPMu6czhEd8ExW", "htmlBody": "<p>This doesn't seem like a very empathetic response to me, and doesn't really respond to the two main issues Shakeel notes (that everyone is navigating legal issues and continuing to gather information). There will be plenty of time for open soul-searching, individually and as a community, once the situation has somewhat stabilized.</p>", "parentCommentId": "WF9QofxkHPzSsmY3b", "user": {"username": "Stephen Clare"}}, {"_id": "GbKyjPN3paYNtZxiu", "postedAt": "2022-11-16T17:30:36.017Z", "postId": "Et7oPMu6czhEd8ExW", "htmlBody": "<p>Apologies if it comes across that way; as I say, I understand that legal risk is scary, and can empathise there (speaking from experience). But many people, both inside and outside the EA community, have a lot of questions, and there is a lot of speculation; blanks will be filled in as best they can in the absence of leaders speaking, for better or worse. Are leaders/orgs putting their own reputations first, or the future of the EA movement and what it hopes to achieve? OP says \"short term\", but what exactly is the timescale? How much information gathering is enough information gathering? I'm pessimistic about it being any time soon given the groundwork laid out here. &nbsp;If the timescale for speaking is tied to court proceedings in the FTX bankruptcy/fraud cases, that is likely going to be years! Can we wait that long for any course corrections that are needed? Or is the idea to hope things blow over and carry on largely as we were?</p>", "parentCommentId": "efPNXQPj8YZCZ9vWB", "user": {"username": "Greg_Colbourn"}}, {"_id": "xdPAN7irkz4qSez7N", "postedAt": "2022-11-16T17:54:00.337Z", "postId": "Et7oPMu6czhEd8ExW", "htmlBody": "<p>On Wytham Abbey, my understanding is that CEA's plan  has been for it to be a space for events.  This makes sense to me, as hosting events is a big part of what CEA does and if you're doing enough of that sort of thing it makes sense to buy (for both cost and operational efficiency/consistency) instead of renting?</p>\n", "parentCommentId": "EhnfThmhonDTLR3Rz", "user": {"username": "Jeff_Kaufman"}}, {"_id": "hZvgtevJMbPwPmBaX", "postedAt": "2022-11-16T18:00:02.051Z", "postId": "Et7oPMu6czhEd8ExW", "htmlBody": "<p>They're relevant in terms of being answers that can be provided now, with no additional information gathering, and no additional legal risk to what there already is from the purchase. (The only risk it seems is reputational.)</p>", "parentCommentId": "ZbumZY6cvDjZKdrbJ", "user": {"username": "Greg_Colbourn"}}, {"_id": "eDByr8zp7jTLEdGrA", "postedAt": "2022-11-16T18:04:29.429Z", "postId": "Et7oPMu6czhEd8ExW", "htmlBody": "<p>Is it big enough for an EAG or EAGx?</p>", "parentCommentId": "xdPAN7irkz4qSez7N", "user": {"username": "Greg_Colbourn"}}, {"_id": "6Bao58MJu4eKDu8zH", "postedAt": "2022-11-16T18:16:58.451Z", "postId": "Et7oPMu6czhEd8ExW", "htmlBody": "<p>I don't think so: my vague impression is that it's the right size for a 20-50 person residential workshop/retreat.</p>\n", "parentCommentId": "eDByr8zp7jTLEdGrA", "user": {"username": "Jeff_Kaufman"}}, {"_id": "bcQG2eAbhNyosuu3f", "postedAt": "2022-11-16T18:17:47.657Z", "postId": "Et7oPMu6czhEd8ExW", "htmlBody": "<p>Probably fits max 50-100 people, though I have low certainty and this might change in the future. I think it‘s designed to host smaller events than the above, e.g., cause-area specific conferences/retreats.</p>\n", "parentCommentId": "eDByr8zp7jTLEdGrA", "user": {"username": "Simon_Grimm"}}, {"_id": "kWciohmwT95B3gGrh", "postedAt": "2022-11-17T12:36:28.338Z", "postId": "Et7oPMu6czhEd8ExW", "htmlBody": "<p>Related to this, I applaud Habryka for <a href=\"https://forum.effectivealtruism.org/posts/SP3Hkas3jo6i2cmqb/who-s-at-fault-for-ftx-s-wrongdoing?commentId=5YXZc7pQHkCMGyBgS\">speaking</a> <a href=\"https://forum.effectivealtruism.org/posts/RPTPo8eHTnruoFyRH/some-important-questions-for-the-ea-leadership?commentId=X3Q98gHpShqXe39ph\">out</a> [see bottom para.], and wish more people would do the same.</p>", "parentCommentId": "WF9QofxkHPzSsmY3b", "user": {"username": "Greg_Colbourn"}}, {"_id": "uRDZKw24mYe2NP4eq", "postedAt": "2022-11-17T16:13:14.168Z", "postId": "Et7oPMu6czhEd8ExW", "htmlBody": "<p>Hi — thanks for the question.</p><p>In April, Effective Ventures purchased Wytham Abbey and some land around it (but &lt;1% of the 2,500 acre estate you're suggesting). Wytham is in the process of being established as a convening centre to run workshops and meetings that bring together people to think seriously about how to address important problems in the world. The vision is modelled on traditional specialist conference centres, e.g. <a href=\"https://www.mfo.de/\">Oberwolfach</a>, <a href=\"https://www.rockefellerfoundation.org/bellagio-center\">The Rockefeller Foundation Bellagio Center</a> or the <a href=\"https://fondation-brocher.ch/\">Brocher Foundation</a>.</p><p>The purchase was made from a large grant made specifically for this. There was no money from FTX or affiliated individuals or organizations.</p>", "parentCommentId": "EhnfThmhonDTLR3Rz", "user": {"username": "Shakeel Hashim"}}, {"_id": "eCeFqu8YofsNcmhhp", "postedAt": "2022-11-17T23:14:49.525Z", "postId": "Et7oPMu6czhEd8ExW", "htmlBody": "<p><i>Epistemic status: Probably speaking too strongly in various ways, and probably not with enough empathy, but also feeling kind of lonely and with enough pent-up frustration about how things have been operating that I want to spend some social capital on this, and want to give a bit of a \"this is my last stand\" vibe.</i></p><p>It's been a few more days, and I do want to express frustration with the risk-aversion and guardedness I have experienced from CEA and other EA organizations in this time. I think this is a crucial time to be open, and to stop playing dumb PR games that are, in my current tentative assessment of the situation, one of the primary reasons why we got into this mess in the first place.&nbsp;</p><p>I understand there is some legal risk, and I am trying to track it myself quite closely. I am also worried that you are trying to run a strategy of \"try to figure out everything internally and tell nice narratives about where we are all at afterwards\", and I think that strategy has already gotten us into is so great that I don't think now is the time to double-down on that strategy.&nbsp;</p><p>Please, people at CEA and other EA organizations, come and talk to the community. Explore with us what wrong things happened. Figure out how we should change and what lessons we should learn. We will not figure out a new direction for EA behind closed doors. I am afraid some of you will try to develop some kind of consolidated narrative about what happened and where we are at, and try to present it as fact, when I think the reality of the situation is confusing and messy. I don't want to cooperate with a lot of the PR-focused storytelling that I think EA has had far too much of in the last few years, and especially in this whole FTX situation, and I both want to be clear that I will push back on more of those kinds of narratives, and want to maybe make right now the time where we stop that kind of stuff.</p><p>It isn't my job to answer a lot of straightforward question that people have on Twitter and on the EA Forum that other EA organizational leaders are much better placed to answer, and I think many others are better places to give context and answer people's questions. When you talk about legal risk, I think you are only in a limited way talking about legal risk to the movement, but are instead primarily talking about legal risk to you personally and to your organizations, and your organizations are not the movement. I feel like when you say this, there is some equivocation that you are acting in the best interest of the movement by being hesitant around legal risk, when I think in this case that hesitation is at odds with what is actually good for the world. I have a feeling that one thing we are missing now and have missed before is courage to speak true things even when it is difficult, and I wish we had more of that right now.</p><p>Yes, you might get dragged into some terrible legal proceedings, and possibly even be fined some amount of money as you get caught in the legal crossfire. I expect given my comments on the forum I will probably also get dragged into those terrible legal proceedings. But if indeed we played a part in one of the biggest frauds of the 21st century, then I think we maybe should own up to spending a few hundred hours in legal proceedings, and take on some probability of having some adverse legal consequences. I think it's worth it for actually having us learn from this whole mess.&nbsp;</p><p>[Edit: Edited a bunch of stuff to have a somewhat more nuanced sentiment, also added an epistemic status]</p>", "parentCommentId": null, "user": {"username": "Habryka"}}, {"_id": "Ecjbxy2xjbrsuRybj", "postedAt": "2022-11-17T23:27:43.960Z", "postId": "Et7oPMu6czhEd8ExW", "htmlBody": "<p>A major consideration is that no one wants to enter a space (the EA forum) where the LW/MIRI community easily dominates voting and sentiment. The EA forum is widely believed to be now transformed into an arena to suit your agenda.</p>", "parentCommentId": "eCeFqu8YofsNcmhhp", "user": {"username": "Tyler M"}}, {"_id": "7e45syXPzsPzPnrzN", "postedAt": "2022-11-18T01:05:29.932Z", "postId": "Et7oPMu6czhEd8ExW", "htmlBody": "<p>I'm very sympathetic and would like to figure out how to say more.</p>", "parentCommentId": "eCeFqu8YofsNcmhhp", "user": {"username": "Nicole_Ross"}}, {"_id": "iJmps3pARpa8y5aCn", "postedAt": "2022-11-18T01:35:20.697Z", "postId": "Et7oPMu6czhEd8ExW", "htmlBody": "<p><i>(This account is negative toward your aims but positive of you personally. It seems good to state things like this when using anonymous accounts).</i></p><blockquote><p>I think this is a crucial time to be open, and to stop playing dumb PR games that are, in my current tentative assessment of the situation, one of the primary reasons why we got into this mess in the first place.</p><p>I don't want to cooperate with a lot of the PR-focused storytelling...We will not figure out a new direction for EA behind closed doors.</p><p>Explore with us what wrong things happened. Figure out how we should change and what lessons we should learn.</p></blockquote><p>We can address this by object-level discussion. <a href=\"https://forum.effectivealtruism.org/posts/SP3Hkas3jo6i2cmqb/who-s-at-fault-for-ftx-s-wrongdoing?commentId=5YXZc7pQHkCMGyBgS\">You said this</a>.</p><blockquote><p>I had sat down my whole team, swore them to secrecy, and told them various pretty clearly illegal things that I heard Sam had done [sadly all unconfirmed, asking for confidentiality and only in rumors] that convinced me that we should avoid doing business with him as much as possible (this was when we were considering whether to do a bunch of community building in the Bahamas). Like, in my worldview, I did do my due diligence, and FTX completely failed my due diligence, and I just failed to somehow propagate that knowledge.</p></blockquote><p><br>I think it is very unlikely that you knew of the level of outright theft of customer funds or observed actual criminality.</p><p>My guess is that you probably observed:</p><ul><li>Accounts of the chaotic organization and operational structure&nbsp;</li><li>Accounts by Tara and others who left SBF on terrible terms in the past</li><li>Accounts of dubious or predatory projects in cryptocurrency (SRM, MAPS), liquidation protected trading accounts, self dealing between Alameda and FTX</li></ul><p>Is this correct, is the information you received similar in class or severity to the above?</p>", "parentCommentId": "eCeFqu8YofsNcmhhp", "user": {"username": "2150 Shattuck Ave"}}, {"_id": "pw8Bb5ximvuhEaFuH", "postedAt": "2022-11-18T02:04:18.429Z", "postId": "Et7oPMu6czhEd8ExW", "htmlBody": "<blockquote><p>Is this correct, is the information you received similar in class or severity to the above?</p></blockquote><p>I think the above is a good chunk of the information, though I think there is more than that.</p><p>For example, I remember someone mentioning the Alameda \"ZERO RISK\" flier that they handed out back in 2018, when I think they and I were quite confident that Alameda was very much not zero risk, and there was always a substantial chance it would blow up all the investor money when crypto goes down. I also heard some other similar concerns for which I am still upholding confidentiality. I think this is one step more severe into the \"I assign substantial probability they lied to investors about their books and accounting\" direction, than just the points you listed above, and I think constitutes more straightforwardly criminal activity.&nbsp;</p><p>I was also quite confident, mostly based on contradictory information that I heard from people around Sam, that Sam's opinions on actual regulators and crypto-regulation were extremely cynical (in line with the Kelsey Piper interview), in contrast to the things he testified before congress, and the things he maintained publicly on Twitter and in various news articles.&nbsp;</p><p>That said, absolutely did not expect or consider that the whole thing would blow up this badly. I mean, I might have predicted with &gt;10% probability that Sam's net-worth becomes negative or zero, but I would not have predicted the business to be predicated on remotely as much fraud as it seems to have been.&nbsp;</p><p>Also, the whole situation with Sam and his propensity for dishonesty had already left a very bad taste in my mouth and had already been a major reason for why I had started disengaging from the EA community substantially more (together with the OpenAI situation which I think shares most of the same pathologies) before it all exploded. And like, I think it's &nbsp;pretty plausible I just got lucky in this specific take (not too hard given that I think I have a somewhat low opinion of multiple parts of the EA ecosystem), but I think at the moment I do want to at least explore the hypothesis pretty strongly .&nbsp;</p>", "parentCommentId": "iJmps3pARpa8y5aCn", "user": {"username": "Habryka"}}, {"_id": "Fgp36BfEReEbEww7p", "postedAt": "2022-11-18T02:48:39.503Z", "postId": "Et7oPMu6czhEd8ExW", "htmlBody": "<p>I appreciate your reply very much.</p><p>I think tension and anxiety is very high high now.&nbsp;</p><p>I want to reply to your comment. I believe that most paths in the consequent discussion contain ideas and content that would probably reduce tension a lot.&nbsp;</p><p>However, I need to take a pause for unrelated reasons. I don't want this pause to extend tension (so I declare the above).&nbsp;</p><p>I also want to leave this TikTok here for everyone to enjoy:</p><p><a href=\"https://www.tiktok.com/@fatimashalash/video/7098523079541935403\">https://www.tiktok.com/@fatimashalash/video/7098523079541935403</a></p><p><img src=\"https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/c893765551caccd18c1ad3639be75d09648c5aa9cfc88edf.png\"></p>", "parentCommentId": "pw8Bb5ximvuhEaFuH", "user": {"username": "2150 Shattuck Ave"}}, {"_id": "yFs5kTtPL4b5b8Wuq", "postedAt": "2022-11-18T09:26:14.868Z", "postId": "Et7oPMu6czhEd8ExW", "htmlBody": "<p>Thanks for posting this! Strong upvote. I made a similar <a href=\"https://forum.effectivealtruism.org/posts/Et7oPMu6czhEd8ExW/why-you-re-not-hearing-as-much-from-ea-orgs-as-you-d-like?commentId=WF9QofxkHPzSsmY3b\">point</a> a couple of days ago in anticipation of continued silence.</p>", "parentCommentId": "eCeFqu8YofsNcmhhp", "user": {"username": "Greg_Colbourn"}}, {"_id": "ELeXkWjxdw6ByLfnr", "postedAt": "2022-11-18T10:18:31.618Z", "postId": "Et7oPMu6czhEd8ExW", "htmlBody": "<p>How can CEA be a leader if it isolates itself from the very community &nbsp;it wants to lead when things get difficult and complicated?</p>", "parentCommentId": null, "user": {"username": "Charlie Dougherty"}}, {"_id": "J3NRZw3K87x3h2PKc", "postedAt": "2022-11-18T11:38:26.534Z", "postId": "Et7oPMu6czhEd8ExW", "htmlBody": "<p>Thank you. While I expect I'd disagree with you on some of the details, I overall think this broadly pushes in the right direction.</p>", "parentCommentId": "eCeFqu8YofsNcmhhp", "user": {"username": "Jonas Vollmer"}}, {"_id": "Y8TfFvkJdMZoKgPc4", "postedAt": "2022-11-18T16:22:07.458Z", "postId": "Et7oPMu6czhEd8ExW", "htmlBody": "<p>I think this is pretty well said and I too am worried that what I'm seeing is a certain amount of turning inward and hastily figuring out \"some kind of consolidated narrative\" behind closed doors.</p>\n", "parentCommentId": "eCeFqu8YofsNcmhhp", "user": {"username": "Spencer Becker-Kahn"}}, {"_id": "jcyEcumtDH5hvnB9N", "postedAt": "2022-11-18T17:44:27.747Z", "postId": "Et7oPMu6czhEd8ExW", "htmlBody": "<p><strong>Speaking very much only for myself personally here</strong></p>\n<p>At first I was upset that CEA / EV / etc. didn't have a good statement yet. Then I tried thinking of my own statement. And it took awhile to feel like I knew all the relevant facts. Then awhile to draft something good. And then everyone needed to review it - board members, leadership, staff, lawyers, etc. And then when anyone wanted something changed or we learned a key fact was wrong, etc., everything needed to get re-reviewed. It takes a long time to write something that's meaningful and also feels like everyone is represented. And this must be even harder given Effective Ventures (EV) is made up of many different groups. So I have a lot of empathy here.</p>\n<p>To be clear, I don't actually have anything awesome to say about the situation as I was not a part of it and I don't have any information that isn't public. But I do have enough experience to have sympathy with slow public statements.</p>\n", "parentCommentId": null, "user": {"username": "Peter_Hurford"}}, {"_id": "HFgxwgBkfES4CTDfB", "postedAt": "2022-11-18T18:55:12.397Z", "postId": "Et7oPMu6czhEd8ExW", "htmlBody": "<p>I... Do think I don't want public statements. I would like public conversations, and indeed a process of slow internal drafting and honing feels more likely to harm in this case, than to help.</p>\n<p>I think the big statements and official takes should take many weeks. The situation is confusing, and I don't think we know what lessons to take away from this, and I desperately don't want us to rush out what lessons we are supposed to learn from this.</p>\n<p>But what I want in the meantime is presence. Sharing info so that people are better placed to form their own takes. Thinking together with people and pointing out flaws in each other's arguments. I prefer comments over top-level posts and list of observations over calls for action and lessons learned. Speaking as individuals instead of speaking as organizations.</p>\n", "parentCommentId": "jcyEcumtDH5hvnB9N", "user": {"username": "Habryka"}}, {"_id": "EgjWcsxwjydYs8yqu", "postedAt": "2022-11-18T18:59:45.189Z", "postId": "Et7oPMu6czhEd8ExW", "htmlBody": "<p>(for the record, I do not know why this comment is downvoted. I upvoted it. I think people should feel comfortable taking a break from commenting any time, and I think cute TikTok videos are fine)</p>\n", "parentCommentId": "Fgp36BfEReEbEww7p", "user": {"username": "Habryka"}}, {"_id": "ACfwnqq3BbBhKL7Ej", "postedAt": "2022-11-18T22:01:10.686Z", "postId": "Et7oPMu6czhEd8ExW", "htmlBody": "<p>I think CEA has been relatively clear over the past few years that it is not the leader of the EA community. My impression is that they see themselves as downstream of the community's intellectual leaders and the will of the community, broadly construed.</p>\n", "parentCommentId": "ELeXkWjxdw6ByLfnr", "user": {"username": "Kerry_Vaughan"}}, {"_id": "KDSDFr87hCW29ghCq", "postedAt": "2022-11-21T12:28:41.367Z", "postId": "Et7oPMu6czhEd8ExW", "htmlBody": "<blockquote><p>It's been a few more days, and I do want to express frustration with the risk-aversion and guardedness I have experienced from CEA and other EA organizations in this time. I think this is a crucial time to be open, and to stop playing dumb PR games that are, in my current tentative assessment of the situation, one of the primary reasons why we got into this mess in the first place.&nbsp;</p></blockquote><p>This feels like you characterising the current situation to suit your agenda.</p><p>If you characterise it as \"PR games,\" then you get to say that current behaviour is (many have claimed) \"one of the primary reasons why we got into this mess in the first place.\"</p><p>However, if you characterise it as \"risk-aversion and guardedness,\" then you should probably say that current behaviour is a healthy update <i>away</i> <i>from</i> the risky, move-fast-and-break-things behaviour that is &nbsp;(many have claimed) one of the primary reasons why we got into this mess in the first place?</p><p>Could this not just be a case of \"CEA and other EA organizations\" deciding that when they find themselves wrapped up in hugely consequential situations, they should wait \"<a href=\"https://forum.effectivealtruism.org/posts/qFEwQbetaaSpvHm9e/my-takes-on-the-ftx-situation-will-mostly-be-cold-not-hot\">weeks or months</a>\" rather than days to make big, non-urgent decisions like how to write about the situation? Are they damned if they're risk-averse and damned if they're not?</p><p>And yes I don't think it's urgent. I don't quite understand why so many people are demanding answers <i>now. </i>I can understand grantees facing urgent financial/career decisions wanting info relating to that now, but not people who just want to know details of what happened, what people think about that, how they're planning to change things etc.</p><p>I kind of get the impression that you just want everyone to say what they think all of the time, putting negligible weight on whether people are in situations where adversaries are very likely to severely punish mistakes and to publish quotes out of context in places where corrections can't be made (at least not fast enough)...with the exception of <a href=\"https://forum.effectivealtruism.org/posts/3NYdEcJhxhjkybXHb/nathan-young-s-shortform?commentId=oXJucwjXH9xavSPbg\">interviews with journalists</a>, although I don't quite see why that scenario gets special treatment.</p><p>I wouldn't be surprised by the occasional rationalist placing such a huge value on immediately saying publicly whatever you think you know about anything almost regardless of the situation. But I've been very surprised by the amount of support you're getting and I'm still struggling to understand why.</p>", "parentCommentId": "eCeFqu8YofsNcmhhp", "user": null}, {"_id": "kDjQjLMjsXjCynzXn", "postedAt": "2022-11-22T04:06:02.283Z", "postId": "Et7oPMu6czhEd8ExW", "htmlBody": "<blockquote><p>If you characterise it as \"PR games,\" then you get to say that current behaviour is (many have claimed) \"one of the primary reasons why we got into this mess in the first place.\"</p><p>However, if you characterise it as \"risk-aversion and guardedness,\" then you should probably say that current behaviour is a healthy update <i>away</i> <i>from</i> the risky, move-fast-and-break-things behaviour that is &nbsp;(many have claimed) one of the primary reasons why we got into this mess in the first place?</p></blockquote><p>I agree that there is a genuine tension here, and that I should argue more coherently that the problem was not insufficient risk-aversion and guardedness (indeed, in the PR sphere SBF was also highly risk-averse and guarded), and am working on a post trying to make that argument (In short, I think risk-aversion in PR domains is much more harmful than in other domains, since it makes collective sense-making much harder, and indeed I think a common pattern of behavior is \"reckless in your actions, but highly concerned about your reputation\").</p><blockquote><p>And yes I don't think it's urgent. I don't quite understand why so many people are demanding answers <i>now. </i>I can understand grantees facing urgent financial/career decisions wanting info relating to that now, but not people who just want to know details of what happened, what people think about that, how they're planning to change things etc.</p></blockquote><p>To be clear, I do not support people rushing to conclusions about how EA should change, and what kind of huge institutional changes we should make. I do believe a number of related things:</p><ul><li>I do think there is urgency in people sharing enough information that other people can orient to the situation and can start doing their own sense-making and aggregating the data in their head.&nbsp;</li><li>I also separately think that right now will be the time when most people's attention is already hijacked by this whole situation, and it's better to share info and takes now, and I don't think there will be a natural Schelling-time later on where that conversation can happen in a way that won't cost much more attention in the long run.&nbsp;</li><li>And third, I also think that now is a good time for people to register predictions and stick their neck out, now that we have confirmation that this is a huge deal, but do not yet have all the info on what happened. I think this will later on make discussion easier because we will be less blinded by hindsight bias.&nbsp;</li><li>And finally, fourth, I also think that there are just a good number of people who have to make pretty crucial decisions soon because they were relying on FTX funding, and I do think the absence of information makes that topic harder to navigate. I think the people needing to make decisions here is more than just FTX grantees, since I think almost everyone working in EA, or being interested in working in EA, has plans whose details are dependent on the future funding situation</li></ul><blockquote><p>with the exception of <a href=\"https://forum.effectivealtruism.org/posts/3NYdEcJhxhjkybXHb/nathan-young-s-shortform?commentId=oXJucwjXH9xavSPbg\">interviews with journalists</a>, although I don't quite see why that scenario gets special treatment.</p></blockquote><p>I do think interviews with journalists are uniquely bad at communicating with the public. Usually you won't even have access to the full transcript, and journalists are very happy to quote you out of context.&nbsp;</p><p>If you write yourself online, usually the journalist will at least link back to the full context, or people can find the full context, and while this doesn't help with the lowest-context readers, it does genuinely help with people who are trying to understand what is going on, if you can just link a confused reader to the thread with the full context and have them see for themselves that your quote was out-of-context.</p>", "parentCommentId": "KDSDFr87hCW29ghCq", "user": {"username": "Habryka"}}]