[{"_id": "YwqLumRKWrSWuxbbn", "postedAt": "2022-10-07T20:20:50.079Z", "postId": "EvJxELPauFmLyBqtX", "htmlBody": "<blockquote><p>The catastrophic harms are those studied by people interested in climate change as a GCR/Xrisk. The research is limited (<a href=\"https://www.sciencedirect.com/science/article/abs/pii/S0016328720301646\"><u>1</u></a>, <a href=\"https://www.pnas.org/doi/full/10.1073/pnas.2108146119\"><u>2</u></a>, <a href=\"https://link.springer.com/article/10.1007/s10584-021-02957-w\"><u>3</u></a>, <a href=\"https://theprecipice.com/\"><u>4</u></a>, <a href=\"https://forum.effectivealtruism.org/posts/BvNxD66sLeAT8u9Lv/climate-change-and-longtermism-new-book-length-report\"><u>5</u></a>, <a href=\"https://www.harpercollins.com/products/our-final-warning-six-degrees-of-climate-emergency-mark-lynas\"><u>6</u></a>, <a href=\"https://link.springer.com/article/10.1007/s10584-022-03430-y\"><u>7</u></a>), but for now, the basic picture seems to be of some chance of climate change contributing to global/existential catastrophe. The size of the effect is a point of debate. My sense is that it’s being underestimated, but it’s difficult to pin down.</p></blockquote><p>That paragraph tells me nothing about what order of magnitude of chance we are speaking about. If you want to draw any conclusions then it's important to talk about the likelihood or at least the ballpark of it.</p><p>Being too vague to be wrong is bad.</p>", "parentCommentId": null, "user": {"username": "ChristianKleineidam"}}, {"_id": "QmQtDQfM4w8LRXf7a", "postedAt": "2022-10-07T20:42:13.539Z", "postId": "EvJxELPauFmLyBqtX", "htmlBody": "<blockquote><p>Collective actions: persuasion, policy, and energy systems. I am omitting some more specialized opportunities, such as regarding cement and refrigerants, because they’re arguably less relevant for a general audience and because I just don’t know much about them, my apologies—but see the links if you’re interested.</p></blockquote><p>Why is cement less relevant for a general audience than the policy on how the energy supply works? From an EA perspective, the topic produces significant emissions and is getting little attention from a general audience. That suggests neglectedness and thus that it's more important to talk about it than to talk about solar power.</p>", "parentCommentId": null, "user": {"username": "ChristianKleineidam"}}, {"_id": "MSxeYezzadsX5BfnJ", "postedAt": "2022-10-08T06:37:15.066Z", "postId": "EvJxELPauFmLyBqtX", "htmlBody": "<p>Hi, Seth.</p><p>Really interesting post. You covered a lot of ground quickly, there's lots to follow up on, months of research time, potentially.</p><p>You wrote:</p><blockquote><p>According to the International Energy Agency, “Spending on solar PV, batteries and electric vehicles is now growing at rates consistent with reaching global net zero emissions by 2050” (<a href=\"https://www.iea.org/news/record-clean-energy-spending-is-set-to-help-global-energy-investment-grow-by-8-in-2022\"><u>link</u></a>). That’s really important.</p></blockquote><p>In context, I see why you share this good news with a note of caution. From the linked text:</p><blockquote><p>Clean energy investment grew by only 2% a year in the five years after the Paris Agreement was signed in 2015. But since 2020, the pace of growth has accelerated significantly to 12%. Spending has been underpinned by fiscal support from governments and aided by the rise of sustainable finance, especially in advanced economies. Renewables, grids and storage now account for more than 80% of total power sector investment. Spending on solar PV, batteries and electric vehicles is now growing at rates consistent with reaching global net zero emissions by 2050.</p></blockquote><p>The growth rate increase is only a few years old and subject to change.</p><blockquote><p>Tight supply chains are also playing a large part in the headline rise in investment, though. Almost half of the overall increase in spending is a reflection of higher costs[...]</p></blockquote><p>Half of that spending increase is on higher prices.</p><blockquote><p>[...]despite some bright spots, such as solar in India, clean energy spending in emerging and developing economies (excluding China) remains stuck at 2015 levels, with no increase since the Paris Agreement was reached.&nbsp;</p></blockquote><blockquote><p>[...] Another warning sign comes in the form of a 10% rise in investment in coal supply in 2021, led by emerging economies in Asia, with a similar increase likely in 2022. Although China has pledged to stop building coal-fired power plants abroad, a significant amount of new coal capacity is coming onto the Chinese domestic market.</p></blockquote><p>Coal is going nowhere. I remember watching a report about the drought in China. The narrator in the video was translating chinese while offering commentary, and suggested that the energy shortfall in hydro from the drying up of their rivers could be met with coal if the situation didn't improve. The drop in hydro caused major manufacturing cities to lose power, and rationing in many places.&nbsp;</p><p>Diving into the <a href=\"https://www.iea.org/reports/world-energy-investment-2022\">full report</a> a bit and getting a handle on the current share of energy production from renewables, I don't believe that the NZE (net-zero by 2050) scenario describes the current global development pathway of energy resources.</p><p>I agree with you, there's reason for concern about renewable development and deployment.</p><p>Would you like to share anything about future water shortages, not specific to hydro-electricity, but more generally population pressures on drinking water supplies, habitability of land areas, and food production?&nbsp;</p><p>I have been mostly ignoring mention of impacts on water besides on food production near coasts (rising sea-levels, saltwater intrusion), but droughts and draining of groundwater will add up in the next 20-30 years, and I haven't seen much in the way of solutions for how to help solve the problem at scale.</p>", "parentCommentId": null, "user": {"username": "Noah Scales"}}, {"_id": "9gHjJcojz9feg8pJf", "postedAt": "2022-10-09T15:14:48.899Z", "postId": "EvJxELPauFmLyBqtX", "htmlBody": "<p>Thanks for your comments. Some replies:</p><p>On renewables, coal, etc. - to me, the bottom line is the value of an \"all of the above\" approach to reducing emissions. Where there are opportunities to advance renewables or even nuclear, great. Where there are opportunities to reduce energy consumption, also great. The potential for renewables is amazing but we can't count on it solving the entire emissions problem in a sufficiently timely fashion.</p><p>On water shortages, this is not my expertise. There is a lot of work on climate change &amp; water, but it would not surprise me if it has not focused on more extreme scenarios. I could see a role for this within the scope of careers focused on extreme climate change adaptation - in the careers section, see \"Bonus idea—for people who are good at human development and emergency management/preparedness\".</p>", "parentCommentId": "MSxeYezzadsX5BfnJ", "user": {"username": "SethBaum"}}, {"_id": "e6mK22x9d2cv6WgoZ", "postedAt": "2022-10-09T15:30:26.716Z", "postId": "EvJxELPauFmLyBqtX", "htmlBody": "<p>That's a good question, thanks. My understanding is that opportunities to address cement issues are more specialized; see e.g. <a href=\"https://www.drawdown.org/solutions/alternative-cement\">this</a>. It could be a worthy point of focus for people pursuing a career in climate change or other more extensive involvement, especially people with relevant skill sets/etc. The neglectedness of cement is a point in favor of work on it. (Ditto refrigerants.) However, those who aren't pursuing something like this are unlikely to encounter cement opportunities. I could be wrong about this - I'm not a cement expert myself - though I can say that for all the various things I've been around, I've never had cement opportunities. There could be value in creating such opportunities and making them more widely available, but that process of creating opportunities would be a more specialized project. If it's something you're interested in I would certainly not discourage it.</p><p>In contrast, a basic understanding of how the energy supply works is likely to be useful for a wider range of people. For example, energy issues come up with some regularity in local political debates, such as on whether to shut down nuclear power plants (a major issue in Germany for example) and whether to permit certain renewables projects. A basic understanding may be helpful for people in their capacity as citizens.</p>", "parentCommentId": "QmQtDQfM4w8LRXf7a", "user": {"username": "SethBaum"}}, {"_id": "s3Ht6urgeoMJsu5tA", "postedAt": "2022-10-09T15:52:47.962Z", "postId": "EvJxELPauFmLyBqtX", "htmlBody": "<p>A point that I hope comes across in that section and throughout the post is that a lot of decisions on what to do on climate change do not depend on how large the catastrophic risk is. There is a role for analysis of the risk, and I have linked to studies doing that analysis. However, for purposes of this post, my interest is in discussing the details of the constructive actions that can be taken to address the risk instead of getting bogged down in analysis of the risk itself.</p><p>A more detailed catastrophic risk analysis could be useful for things like evaluating decisions on how much to prioritize climate change relative to other issues. However, even then the risk analysis would only be one component of the decision analysis, alongside a comparison of the quality of the opportunities to address climate change vs. the opportunities for other issues. Some analysis along those lines is in the section \"Climate change warrants massive investment—but not necessarily ours\".</p>", "parentCommentId": "YwqLumRKWrSWuxbbn", "user": {"username": "SethBaum"}}, {"_id": "p6y9qbFTRtCcKLwuD", "postedAt": "2022-10-09T23:30:59.828Z", "postId": "EvJxELPauFmLyBqtX", "htmlBody": "<p>I think we should preserve existing infrastructure and direct all new infrastructure spending toward conservation rather than trying to replace the gas/oil infrastructure at all in the short-term. Society could still do things like add geothermal to homes or increase train use or reduce car fleets or deploy passive solar heating/lighting or &nbsp;even develop coal for energy.&nbsp;</p><p>Countries could end fossil fuel subsidies and take more control over oil/gas corporations. In the 1970's we understood that domestic energy supplies were a national security issue, and that conservation was a way out of oil wars. We didn't take that path but we still can.</p><p>Spending on renewables actually seems too speculative to me, ignoring risks of changes in weather, climate, available resources, energy demand, and infrastructure location requirements. &nbsp;&nbsp;</p><p>Electrifying cars seems like a waste to me. There'll be no one-to-one substitution of an electric fleet for a gas fleet. The total fleet counts will have to radically decline, and then it will be obvious we should have kept the fuel infrastructure we had.</p><p>I'm not talking about the business-as-usual scenario for oil/gas. I also don't agree with the IPCC estimates of the relative value of conservation.&nbsp;</p><p>Most of my thinking is not about creating a vision of an ideal, its about how to negotiate through a very difficult future.&nbsp;</p><p>As far as water availability, it might be a frustrating obstacle to most required societal changes. There are no reassuring models of freshwater availability changes in the next 30 years. They are all extreme as far as I know. But calculating what the impacts are is what's missing from common discourse. People will move. How many? Conflicts might start. What kind? How dangerous? Etc.</p>", "parentCommentId": "9gHjJcojz9feg8pJf", "user": {"username": "Noah Scales"}}, {"_id": "uKip9XkPyHTNvjSbg", "postedAt": "2022-10-10T09:12:50.298Z", "postId": "EvJxELPauFmLyBqtX", "htmlBody": "<p>Dear colleagues.</p><p>Thanks Seth for this comprehensive effort.&nbsp;</p><p>This is a complex piece of highly personal work, which tries hard to do many different things for a diverse audience in one fluid package. Given this very difficult &nbsp;target, it understandably only partially succeeds. Nonetheless within it I am sure many will find some new information, perspectives and links. Rather than critique it any further, I would prefer to follow on just one of the many discussion topics it opens up : climate change (CC) and existential risk (XR). My argument is that this all leads to a potentially high value nich role for the EA community.</p><p><strong>CC is an XR</strong> First point to discuss is whether climate change is an extenstional risk. In summary of my opinion, (and Seth's I believe) it definitely is, and there is a lot of data and analysis on this topic.</p><p>From a purely academic perspective, the most authoritative work on climate change &nbsp;as XR comes from Johan Rockstrom, first presented to world leadership at Davos 2019 <a href=\"https://www.stockholmresilience.org/research/research-news/2018-08-06-planet-at-risk-of-heading-towards-hothouse-earth-state.html\">https://www.stockholmresilience.org/research/research-news/2018-08-06-planet-at-risk-of-heading-towards-hothouse-earth-state.html</a>. Since then the work and underlying theorems, have been critiqued, defended and tuned, but in my opinion remain valid. In contrast the wave of unprecedented climate change linked extreme events of 2019-2021 has undermined the credibility of many conservative climate models and associated viewpoints. Scientists are repeatedly finding change occurring faster and impacts arriving earlier and harder than their models predicted. So, my first and primary point of argument is that climate change IS a priority existential risk – that warrants attention from the EA community.</p><p>What is (unsurprisingly) not enunciated well by climate scientists looking at extreme CC are the geopolitical-social-destabilization aspects. This then connects to a view in some XR circles that the likelihood of human species extinction via CC is too low for it to qualify as a XR event: it is a (only?) a temporary setback for global civilization, not a human species killer. Let me challenge this by referral to our current geopolitical and social situation in Q4 2022, with global average temperatures just beyond 1.1C above pre-industrial levels. <a href=\"https://www.un.org/en/climatechange/science/key-findings\">https://www.un.org/en/climatechange/science/key-findings</a>.&nbsp;</p><p>Noting the presence of multiple other pressures, interconnections and the exponential increase in impacts with linear temperature increases, just imagine what a 4C+ society would look like. In the worse case scenario, we are looking at small groups of inexperienced unvaccinated hunter gatherer oriented survivors in a forced migration mode heading northward into continually destabilized and badly degraded environments. To me, this looks like a credible route to human extinction – with a much higher probability of occurrence or irreversible initation within the next 100 years than many much discussed XR events (asteroids, supervolcanoes etc).</p><p><strong>EA has a potential key niche role in the CC-XR nexus</strong> Here is the connection to the EA agenda, and the gap I think that EA oriented thinkers and large scale philanthropists may be able to partly fill.&nbsp;</p><p>The EA community is unique in that it looks very openly at the basic question of where to allocate efforts, starting from an intellectual and humanist base, without many organizational, cultural, political or budgetary constraints. In short, it searches honestly for the gaps and the added value niches.</p><p>Over the next decades, literally trillions will be lost on CC associated acute and chronic disasters and similar amounts spent on mitigation and adaptation. However 99%+ of those funds will be raised by and channelled through relatively well established institutions and programmes that (in order to attract mainstream funding) offer incremental solutions within what I call the Global Plan A framework.&nbsp;</p><p>Plan A essentially assumes the continuity and stability of the global economic order, irrespective of the increasing destabilizing factors/stressors. I suggest we look at the 2022 news and then critique this near universal assumption – at present the global order appears to be unravelling. Not everywhere and not tomorrow, but the pulled threads are becoming distressingly visible. <a href=\"https://www.un.org/sg/en/content/sg/speeches/2022-09-20/secretary-generals-address-the-general-assembly\">https://www.un.org/sg/en/content/sg/speeches/2022-09-20/secretary-generals-address-the-general-assembly</a> As per above the catalyst is not one event or stressor – it is compound: climate change + geopolitics + environmental degradation + population + inequality + ethnic/ideological divides etc…</p><p>The &lt;1% minority of activities occurring under what I call the Plan B or collapse anticipation mindset, are to date, generally fragmented and very small and intellectually mixed in quality. In some cases they are simply dangerous and/or antisocial ( e.g. billionaire bunkers, NZ land grabs, survivalist cults etc..). What is happening however that is commendable is a rising wave of very earnest and underfunded efforts focusing on the psychological, sociological and even spiritual elements of coping with CC. <a href=\"https://climatepsychologyalliance.org/\">https://climatepsychologyalliance.org/</a></p><p>To all of this we can add the global wildcard of stratospheric geoengineering: modifying the irradiance of the atmosphere to temporarily cool the earth without lowering emissions. At present this topic is essentially taboo in multilateral circles but growing exponentially in importance and likelihood. Without going into the details, geoengineering gone wrong is also an XR.</p><p>I think that we can collectively and feasibly do better than all of this. &nbsp;I note two key gaps:</p><p>A. Serious in depth public domain work on the climatic, environmental, social and political implications of stratospheric geoengineering.</p><p>B. Building a 2<sup>nd</sup> and 3<sup>rd</sup> line of defence, &nbsp;at a low cost &nbsp;and without giving up on the primary fight against CC and other critical issues. Clearly, 99% of CC and related efforts and funding should remain focused on supporting Plan A . This includes focused work on psychological and sociological issues . However I argue that up to 1% should be incrementally refocused on one or more Plan Bs: the two tiered defence of a) civilization and b) the human species and other key species and genetic material, in a partial or full collapse scenario. Consider it insurance for the human race and all that we value.&nbsp;</p><p>These two topics, &nbsp; geoengineering and Plan Bs, &nbsp;are the sort of intellectually anchored, high risk &amp; novelty - high gain items that the EA forum was designed to identify and support. They are niches made for the EA community.</p><p>Let me stop here and await feedback on both the original article and this follow up. If you wish to go further and faster on points A and B above, please do contact me direct.</p><p>Andrew Morton</p>", "parentCommentId": null, "user": {"username": "Andrew Morton"}}, {"_id": "CCw5CFEFKtTF7omKS", "postedAt": "2022-10-10T20:15:14.508Z", "postId": "EvJxELPauFmLyBqtX", "htmlBody": "<p>Thank you for your thoughtful comments.</p><p>To all: Let me just briefly add that I believe this to be a compelling perspective worth taking seriously. Anyone wishing to contact Morton can find his email address on his page at UNEP <a href=\"https://www.unep.org/people/andrew-morton\">here</a>.</p>", "parentCommentId": "uKip9XkPyHTNvjSbg", "user": {"username": "SethBaum"}}, {"_id": "JJoKDsxgLukvBgv2G", "postedAt": "2022-10-10T20:20:37.762Z", "postId": "EvJxELPauFmLyBqtX", "htmlBody": "<p>Thanks for your thoughts on this. To briefly reply, I would disagree with the idea that renewables, electric cars, etc are a waste. As much as I might personally like to see more car-free urban design, it is still the case that renewables + electric cars can substantially reduce emissions. The point about ending fossil fuel subsidies is an important one, albeit with a caveat about political feasibility. To the extent that there can be political will to end these subsidies, it’s clearly a good thing to do, but finding the political will can be elusive.</p>", "parentCommentId": "p6y9qbFTRtCcKLwuD", "user": {"username": "SethBaum"}}, {"_id": "kAkJu8W7Wj4HnzHEZ", "postedAt": "2022-10-10T21:36:16.876Z", "postId": "EvJxELPauFmLyBqtX", "htmlBody": "<p>Well, on cars in the US and China:</p><ul><li>there's no plans that are real for car-free urban design</li><li>all cars take a lot of energy and GHG's and resources to make</li><li>we drive more than we need to</li><li>we drive more than we can sustain</li></ul><p>As far as oil/gas subsidies, I'd like to see governments tax the oil/gas companies but not disallow oil/gas exploration. We will need the fuel.</p><p>I am thinking of what could work, not what's ideal. So, car-free urban design sounds great, it would work. Conservation will work, lowering emissions through renewables and electric cars won't, &nbsp;because:</p><ul><li>building new infrastructure and manufacturing new vehicles will produce lots of GHG's&nbsp;</li><li>we won't know where to put the infrastructure, because climate and other pressures will eat away the existing infrastructure and move people around, we'll have to patch up the infrastructure and keep on.</li><li>supply-chains will take such a hit that doing redundant transportation as we do with multiple cars per family won't happen, there'll be a sharp decline in car sales and use w/in a couple decades.</li><li>energy consumption will reduce because of unexpected shortages, and conservation will be required. It would be nice if it were proactive though, so less damaging to lifestyles and done better.</li><li>energy security will require portable energy-dense fuel and use of the existing infrastructure. We &nbsp;will need oil and gas, and will just have to sip it when before we used to gulp it.</li><li>I imagine the rich will have their own cars and drive them on roads that are mostly empty except for buses, government, ride-sharing vehicles, and a few transport vehicles. And that's if the roads are maintained.&nbsp;</li><li>There'll be less goods transport on roads, and less goods &nbsp;transport overall. Trains might make even more of a contribution there though. Shipping might be stalled because of damaged ports and canals or impassible storms at sea (I only suspect that last one).</li></ul><p>Every market-driven change, because of the time frames involved in relying on the market, is one that could have started &nbsp;30-40 years ago and contributed positively to slowing rates of global warming. We could have gone high-efficiency gas vehicles and skipped the whole SUV and electric thing. But expecting those changes 20-30 years in the future with market solutions? Nah. That is a waste of GHG emissions and will fail.&nbsp;</p><p>That is when wind storms are ripping up solar farms, hydro dams are drying out, there's a battery shortage, roads are being cut off by weather damage and &nbsp;supply chains are failing so car parts aren't available because dust storms are blowing through factories. That is when governments are wanting to move masses of people, there's serious water and food shortages, and having a car requires a garage, maybe driving at night (because daytime is too hot), and definitely life behind a big wall.&nbsp;</p><p>Investing in renewables and replacement infrastructure using the same growth and stability expectations that held in the last several decades will just make the situation worse and fail the goal. We have what we need now, we just don't use it well. We'll either learn how to use it well or our civilization will whither away. There's always moonshot technologies, but basically the problem is a political one with some operations research elements. We need to be much more efficient and change how we live.</p>", "parentCommentId": "JJoKDsxgLukvBgv2G", "user": {"username": "Noah Scales"}}, {"_id": "zuuxsJFdavbb5Hyuj", "postedAt": "2022-10-11T21:25:28.415Z", "postId": "EvJxELPauFmLyBqtX", "htmlBody": "<p>EDIT: made a few light edits 3 hours after posting.</p><p>My bachelors is in geophysics, I got started in Earth Science out of interest in the environment and Earth Systems modeling. My take on geo-engineering is that there's already some interest in Marine Cloud brightening to try and rescue the Arctic Ice. Also, we are already using aerosols (pollution) that cool the planet, with strong results. &nbsp;In fact, there's fears that we will warm the planet by reducing our aerosol pollution. Maybe I'm biased by my background, but I think it's important for us to improve the computer models used to predict tipping point changes and global warming scenarios. Modelers need smaller mesh sizes for modeling earth's atmosphere but even more the oceans and also inclusion of more physical processes into their models (for example, water-pooling and drainage, bottom lubrication, rain, and ocean current effects on Greenland melt). I'm not a modeler myself, but improving model quality seems like a no-brainer to me. The climate science community needs hardware and software expertise and funds to make that happen fast.</p><p>Your appeal to EA folks makes sense, I hope you get the response you're looking for, though I'm unclear on the value of a plan B. Yes, we need adaptation plans for extreme scenarios as their risks grow. Collecting seeds and DNA samples makes good sense, as the 6th great extinction rolls forward. However, adaptation is a near-term concern, more plan A than plan B. I don't think there really is a plan A with any viability, at least from a public perspective. Just limiting the meat and fish supply would seem like armageddon to some folks, but doesn't that qualify as part of plan A? I would hope so, it's an easy, obvious, and powerful intervention to forestall famine and produce fewer GHG's. &nbsp;Well, it's not easy politically, but its easy in every other way.&nbsp;</p><p>I guess there are legitimate concerns about what will supply EAA's (essential amino acids), but there'll be soy (a lot of it no longer fed to farm animals) and whatever substitutes we use (like algae-grown proteins), and there's always amino acid supplements taken separately or added to food.</p><p>I wanted to mention the work of <a href=\"https://allfed.info/\">ALLFED</a>. &nbsp;They frame their efforts as important in case of nuclear war, but I see a larger role for them. They could contribute to proactive changes to the world's food supply. The time to act on replacing animal agriculture is now.&nbsp;</p><p>Also, anything the UN can do to monitor food stocks and flows and provide early warnings of food shortages is welcome. Supposedly there's some mechanism in place but making those redundant seems necessary. I can imagine how slow and painful response to a global shortage would be with some governments slow to recognize and act on the problem, particularly after they seek advice from food corporations rather than independent monitoring organizations.</p><p>Finally wanted to make a quick mention of potential troubles in water markets and virtual water. Water shortages could lead to wars, maybe for other ostensible reasons (protecting democracy or sovereignty), but really over water. &nbsp;Some UN framework to head off development of water scarcity &nbsp;and concentration of power in water markets would be useful, particularly by keeping corporations out of water markets. Their influence could impact sovereignty and environmental issues related to water for big importers or exporters of water-intensive products. Corporate influence over time will worsen freshwater resource disparities, discourage local water conservation, and work against reduction in overall global water use. I can also see them discouraging cheap water capture and purification technologies out of fear of losing monopoly power in water markets. In general, privatization of national water resources seems like an obvious trend to avoid or reverse.&nbsp;</p>", "parentCommentId": "uKip9XkPyHTNvjSbg", "user": {"username": "Noah Scales"}}, {"_id": "waQCCY8X5h569tFAZ", "postedAt": "2022-10-11T23:24:10.061Z", "postId": "EvJxELPauFmLyBqtX", "htmlBody": "<p>Just FYI the RESILIENCER  Project which I am leading <a href=\"http://www.resiliencer.org\">www.resiliencer.org</a> is working on SRM and X-Risk, both on hwo it adds to and reduces X-Risk, so if you wanted to chat about that, I would be up for that!</p>\n", "parentCommentId": "uKip9XkPyHTNvjSbg", "user": {"username": "Gideon Futerman"}}, {"_id": "fmsMGcrkL2xQHsnq2", "postedAt": "2022-10-11T23:25:53.551Z", "postId": "EvJxELPauFmLyBqtX", "htmlBody": "<p>Also, I tend to think the Plan A and Plan B framing can be relatively problematic, particularly when combined with SRM, as it could act to deter mitigation</p>\n", "parentCommentId": "uKip9XkPyHTNvjSbg", "user": {"username": "Gideon Futerman"}}, {"_id": "FDkt8TuRPuG2dJzoz", "postedAt": "2022-10-16T14:06:32.113Z", "postId": "EvJxELPauFmLyBqtX", "htmlBody": "<p>Hi Gideon and thanks for the response. Interesting &nbsp;and important project you are working on... I will follow up 1:1.</p><p>Specifically on your response on framing efforts, I think any framing or initiating of contingency planning for the failure of mainstream efforts to avert catastrophe is going to be problematic and unpopular. However that does not mean that it should not be addresed and serious work started. Here's my thoughts on this stream...</p><p>In simplistic terms, Plan &nbsp;A/ global mainstream efforts, &nbsp;such as CC mitigation, at least in presentation, try to save everyone &nbsp;and everything everywhere and thus do not explicitly or implicitly exclude anyone (leave no-one behind is actually a crosscutting theme in much multilateral programming). So they are simultaneously politically and morally acceptable and utterly non-feasible in the current geopolitical climate.</p><p>&nbsp;In harsh contrast, true global scale contingency planning efforts &nbsp;(which are not just another variant of Plan A or just episodic emergency response), have a starting point of inevitable massive future loss or recent actual loss. In all extreme scenarios I look at , most ecosystems, countries and governments will partialy to fully collapse or least be extremely stressed and population crashes (over time) are in the multi-billions. &nbsp;The very starting point of such planning is deeply unpopular, and always will be for those who fate is forecast..</p><p>On top of that, to be truly feasible and credible, contingency planning and preparatory measures need to respect the current and forecast scale of the challenges and the limits of the resources credibly available or forecast. &nbsp;This in turn inevitably and explicitly narrows &nbsp;the process down to saving only very specific things (such as knowledge and genetic material) and communities and capacities in specific places. &nbsp; It also need to take into account foresight timeframes: preparation need to start yesterday, but credible scenarios indicate an irregular and extended process of degradation and &nbsp;collapse, not doomsday tomorrow, or next year. &nbsp;2030 - 2100+ appears to be the truly critical period.</p><p>In this context, most humans existing today will not be saved or helped by &nbsp;dark scenario contingency planning efforts, if those scenarios come to pass. &nbsp;They will have either died of old age beforehand , or not possible to save.&nbsp;</p><p>Our own likely fates &nbsp;and the nature of the work flow from this point of logic. From a personal level , we individually should assume &nbsp;that we will either not be able &nbsp;to, or simply not need to physically get onto this type of species and civilization lifeboat, even if we help build it. &nbsp;The lifeboats so to speak will be very small, probably located in another countries, not built for years to come and potentially not even designed to physically carry or shelter people.&nbsp;</p><p>This conclusion is actually helpful, because it shifts the moral landscape , narrative and planning objectives from survivalism to broader altruism.</p><p>In closing, I feel that true long term global-species level Plan B or similarly labelled and targeted efforts are never going to be universally popular, nor politically mainstream, nor large enough to divert and thereby starve mainstream efforts of funding, attention &nbsp;or hope. Most people simply do not think in these time frames and scales, nor care enough about the fate of future generations (that are not their direct descendants) to endorse diverting substantial resources to this cause. &nbsp;</p><p>It will only ever be a niche sector.&nbsp;</p><p>PS. All of this is my personal opinion and effort and not at all linked to my UN role.</p>", "parentCommentId": "fmsMGcrkL2xQHsnq2", "user": {"username": "Andrew Morton"}}]