[{"_id": "WQR33RufLC86Cq97A", "postedAt": "2015-08-06T13:37:35.392Z", "postId": "Ew8bD9aM8oDbCrmdN", "htmlBody": "<p>I think you could strengthen the response to the first question by noting that global poverty/health interventions likely promote economic growth, and with a more equal distribution (obviously by a very small amount depending on the size of the intervention).</p>\n", "parentCommentId": null, "user": {"username": "zdgroff"}}, {"_id": "yFEGoaFxYS36rCp7s", "postedAt": "2015-08-07T15:52:44.746Z", "postId": "Ew8bD9aM8oDbCrmdN", "htmlBody": "<p>Do people ask about MNC tax evasion specifically or illicit financial flows generally? And when they do ask about MNC tax evasion - is it tax evasion of LDCs or globally? </p>\n<p>Does anyone know if someone's looked into the likes of these <a href=\"http://www.taxjustice.net/\">http://www.taxjustice.net/</a> for effectiveness. I see this article in a search suggesting donation if its something you care about, but not sure about an evaluation? <a href=\"https://www.givingwhatwecan.org/blog/2014-10-07/donating-in-face-corruption\">https://www.givingwhatwecan.org/blog/2014-10-07/donating-in-face-corruption</a></p>\n", "parentCommentId": null, "user": {"username": "tomstocker"}}, {"_id": "ywhmwvQ5qCSrtbomZ", "postedAt": "2015-08-07T22:24:52.352Z", "postId": "Ew8bD9aM8oDbCrmdN", "htmlBody": "<p>Regarding &quot;should we not focus on growth&quot; the fact that Chinese reforms have been responsible for the bulk of recent poverty relief (with India following up in the rear) really does make a big argument for anything that contributed to that and wasn't ludicrously expensive. For example, the think tanks and technical advice involved in India's reforms, the economists and analysts who contributed to governance in Hong Kong and Singapore (which acted as powerful models for the CCP in deciding to reform).</p>\n<p>I think the response to that shouldn't be &quot;oh, it's too hard&quot; but rather &quot;something along those lines plausibly IS better than what we're doing, these are our plans to investigate it, and we will modify our recommendations if the investigation comes out positive with specific targets.&quot; One might follow that with one's reasons for giving now before such investigation, even a back of the envelope calculation about total spending on such things over the last 100 years and an estimated role for these in growth-inducing reforms.</p>\n", "parentCommentId": null, "user": {"username": "CarlShulman"}}, {"_id": "x94EtCD95sHLNQY9w", "postedAt": "2015-08-10T11:38:13.904Z", "postId": "Ew8bD9aM8oDbCrmdN", "htmlBody": "<p>Absolutely agree that growth has lifted lots of people out of poverty. </p>\n<p>The idea here was that, even under very optimistic growth projections, i.e. Africa emulating China, it would simply take to long for growth to benefit the very poor. Because the main factor for growth is capital, and free market forces already provide that (China is investing a lot in Africa), our marginal dollar might be better spent elsewhere.</p>\n", "parentCommentId": "ywhmwvQ5qCSrtbomZ", "user": {"username": "HaukeHillebrandt"}}, {"_id": "3sZeGmEuXqe9HoAvx", "postedAt": "2015-08-10T11:40:39.858Z", "postId": "Ew8bD9aM8oDbCrmdN", "htmlBody": "<p>This is about illicit financial flows generally. I should probably make this more clear. Thanks for the feedback.</p>\n", "parentCommentId": "yFEGoaFxYS36rCp7s", "user": {"username": "HaukeHillebrandt"}}, {"_id": "mKS76p5XmnRHGn5XG", "postedAt": "2015-08-10T11:41:03.184Z", "postId": "Ew8bD9aM8oDbCrmdN", "htmlBody": "<p>We're looking into this issue currently.</p>\n", "parentCommentId": "WQR33RufLC86Cq97A", "user": {"username": "HaukeHillebrandt"}}]