[{"_id": "rnQ8ZLfjyE9fbKMJe", "postedAt": "2015-06-13T00:27:32.849Z", "postId": "EwGRzxJQpoeirPs56", "htmlBody": "<p>This sounds like a pretty cool project.  Some thoughts:</p>\n<p>Do we have evidence, whether quantitative or anecdotal, about the level of impact that policy comments have?</p>\n<hr />\n<p>Reading about your spreadsheet reminded me of this post on <a href=\"http://blog.givewell.org/2014/06/10/sequence-thinking-vs-cluster-thinking/\">sequence thinking vs cluster thinking</a>.  I think spreadsheets are inherently sequence-ish in nature; a change to a single field can <a href=\"http://www.washingtonpost.com/blogs/wonkblog/wp/2013/04/16/is-the-best-evidence-for-austerity-based-on-an-excel-spreadsheet-error/\">completely alter the result</a>.</p>\n<p>As a software developer, I'm intimately familiar with the phenomenon of tiny subtle mistakes causing unexpected catastrophes... writing production software trains a certain paranoia when dealing with computers that's hard to get elsewhere.  Sometimes I wonder if most scientific simulation code has subtle errors in it that invalidate the results because the researchers don't have enough programming experience to realize how easy it is to write code that's incorrect and simulations are black boxes where errors don't necessarily manifest themselves immediately &amp; visibly.</p>\n<p>One interesting idea might be for each person in your group to try to generate frameworks for evaluating a proposed regulation independently, and meet to compare spreadsheets later.  Probably this would work even better with a group that had a diverse set of backgrounds (educationally, politically, etc.)</p>\n<hr />\n<p>Because politics is apparently inherently interesting to almost everyone, you might be able to start blogging about whatever regulations you are looking in to and extract free cognitive labor from your readers to provide an additional perspective, critique your research, etc.  In fact, maybe there is low-hanging fruit in just redirecting the attention of intelligent policy bloggers to policies that can actually be impacted in the near term instead of just <a href=\"http://www.overcomingbias.com/2015/02/fashion-excuses.html\">whatever the fashionable discussion topics of the day are</a>, then writing up any consensus they come to as a comment.</p>\n<p>(This is a tougher one since there are also downsides to having politics discussions online, which I <a href=\"http://effective-altruism.com/ea/j3/dont_be_discouraged_in_reaching_out_an_open_letter/3sd\">wrote about previously</a>.  Not sure where I currently stand, but leaning towards a blog promoting a high standard of discussion being the best option.)</p>\n<p>Broadly my intuition is that some policy recommendations have the potential for 10x or 100x the impact relative to others, so you are better off aiming to produce a small number of high-quality, highly-targeted recommendations than a large number of lower-quality ones, at least in the long run.  (Incidentally, are animal issues on your radar?)</p>\n", "parentCommentId": null, "user": {"username": "John_Maxwell_IV"}}, {"_id": "kGLE5tNrNzMsuMdEx", "postedAt": "2015-06-13T17:34:59.678Z", "postId": "EwGRzxJQpoeirPs56", "htmlBody": "<p>I second what John Maxwell says -- definitely one of the best things I think you could do is set up a blog and practice some Givewellian transparency where you publish as much as you can.  It would be cool for us all to learn from it!</p>\n<p>Especially if you speak candidly about learning experiences, mistakes, and failures and how you improve from them.</p>\n", "parentCommentId": null, "user": {"username": "Peter_Hurford"}}, {"_id": "TndurfoWqxS5XEpTT", "postedAt": "2015-06-14T02:52:14.313Z", "postId": "EwGRzxJQpoeirPs56", "htmlBody": "<p>This sounds awesome!  Is the idea that policy comments would get regulators to: consider a new policy they weren't previously considering; change their mind about a proposed policy; help back them up politically for something they already want to do; or a combination of these?  I'm not sure which type of impact policy comments are best for.</p>\n", "parentCommentId": null, "user": {"username": "egastfriend"}}, {"_id": "DizAYyzzc6Qa7AeYS", "postedAt": "2015-06-15T13:43:12.746Z", "postId": "EwGRzxJQpoeirPs56", "htmlBody": "<p>Some of these questions require semi-detailed responses, so I will respond with a few different comments. Richard had some examples/anecdotes about the level of impact policy comments could have:</p>\n<p>&quot;A good recent example of FDA making major changes as a result of public comment is the Food Safety Modernization Act (FSMA) Produce Safety rule. This rule was extensively changed as a result of feedback from the public, mostly the affected farmers. Some of the comments were merely self-interested lobbying, but some pointed out where FDA's lack of understanding of specific situations would have led to an inefficient regulation. The changes were so extensive that FDA had to publish a reproposal of the rule.</p>\n<p>This is a large and complex rule, so you can choose how much detail you want to look into. The overview is here:</p>\n<p><a href=\"http://www.fda.gov/Food/GuidanceRegulation/FSMA/ucm334114.htm\">http://www.fda.gov/Food/GuidanceRegulation/FSMA/ucm334114.htm</a></p>\n<p>and it has links to further information. The full Federal Register notice is here:</p>\n<p><a href=\"https://www.federalregister.gov/articles/2014/09/29/2014-22447/standards-for-the-growing-harvesting-packing-and-holding-of-produce-for-human-consumption\">https://www.federalregister.gov/articles/2014/09/29/2014-22447/standards-for-the-growing-harvesting-packing-and-holding-of-produce-for-human-consumption</a></p>\n<p>You can do a text search in the Federal Register document for the phrase &quot;Relevant Comments&quot; to see the FDA responses to comments on various subjects and how those comments changed the regulation.</p>\n<p>This is a link to the economic analysis of the reproposal, which has details on the costs and benefits of the changes in the reproposal:</p>\n<p><a href=\"http://www.fda.gov/downloads/AboutFDA/ReportsManualsForms/Reports/EconomicAnalyses/UCM442801.pdf\">http://www.fda.gov/downloads/AboutFDA/ReportsManualsForms/Reports/EconomicAnalyses/UCM442801.pdf</a></p>\n<p>Another rule where public comments led to major changes and a repropsal is the FSMA Preventative Controls rule:</p>\n<p><a href=\"http://www.fda.gov/Food/GuidanceRegulation/FSMA/ucm334115.htm\">http://www.fda.gov/Food/GuidanceRegulation/FSMA/ucm334115.htm</a></p>\n<p>However, understanding the issues in that rule requires a bit more specialized knowledge.&quot;</p>\n", "parentCommentId": "rnQ8ZLfjyE9fbKMJe", "user": {"username": "Gentzel"}}, {"_id": "nhiqM5w7ZTLcb22ay", "postedAt": "2015-06-15T14:41:40.336Z", "postId": "EwGRzxJQpoeirPs56", "htmlBody": "<p>As for spreadsheets, we could go through a cluster thinking way of producing estimates, but I am under the impression this would take a lot more time per person, and then when comparing spreadsheets at the end, we'd be finding errors that would have been easier to handle earlier if we worked together earlier and got faster feedback.</p>\n<p>There certainly is value to avoiding groupthink though. Overall I do think using multiple sequential techniques could be a rather rigorous way to evaluate something, and make a very good comment, but we are also trying to get useful feedback by making a lot of comments and we are already commenting much slower than we desired to because of outreach. </p>\n<p>I would like to do this, but I think it would be useful to have more comment drafting workers if we want to do this a lot. </p>\n", "parentCommentId": "rnQ8ZLfjyE9fbKMJe", "user": {"username": "Gentzel"}}, {"_id": "oH6G4DEvTYmTNEbDt", "postedAt": "2015-06-15T15:26:53.935Z", "postId": "EwGRzxJQpoeirPs56", "htmlBody": "<p>I think we will start blogging in a limited capacity about regulations we are seriously considering working on and some that we considered and then dismissed. We probably aren't going to blog about every regulation we look at since there are so many. Some comments are likely to be far more impactful than others, however the comments that are likely to have the most impact are also likely to have slower feedback and no nearby certain deadlines for implementation. </p>\n<p>Our current priority list seems to be: \n-Network early to get expert feedback and assistance\n-Produce lots of comments early to get feedback and learn how to make influential comments\n-Focus on high impact comments toward the end of our project trial </p>\n<p>To some degree, these priorities can get jumbled by time sensitive opportunities, but as an overall aim, we think this is correct for moving forward. </p>\n<p>Animal issues are on our radar, but I have yet to see anything lately relevant to factory farming of cows, pigs, or chickens. We have seen a lot of proposed rules about fisheries and species protection, but didn't have the expertise to go after them yet. If there are experts we could consult on animal issues, they would likely be helpful unless their way of sorting policies into &quot;worth going after&quot; and &quot;not worth it&quot; is the same as ours and nothing new comes up/is noticed. </p>\n", "parentCommentId": "rnQ8ZLfjyE9fbKMJe", "user": {"username": "Gentzel"}}, {"_id": "maskhpQgiQNzQrPc9", "postedAt": "2015-06-15T15:44:42.202Z", "postId": "EwGRzxJQpoeirPs56", "htmlBody": "<p>I currently have a google doc that I have been using to record hours, mistakes, lessons learned,   and observations. I do think I should write it up as we make a blog.</p>\n<p>Writing down problems has seemed to function in a similar way to rubber ducking though, trying to get certain problems into words can sometimes highlight a solution, and that has been useful. </p>\n", "parentCommentId": "kGLE5tNrNzMsuMdEx", "user": {"username": "Gentzel"}}, {"_id": "9od5oW5XJ2FkPm3eq", "postedAt": "2015-06-15T15:48:39.211Z", "postId": "EwGRzxJQpoeirPs56", "htmlBody": "<p>I think it is most likely we will be backing up good policies that some regulators want. New policies are hard, and a lot of requests for comments come in a sort of binary way: &quot;should we implement policy x.1 or x.2?&quot;</p>\n", "parentCommentId": "TndurfoWqxS5XEpTT", "user": {"username": "Gentzel"}}, {"_id": "v2Mn685uQ35ghMuXa", "postedAt": "2015-06-16T15:30:40.044Z", "postId": "EwGRzxJQpoeirPs56", "htmlBody": "<p>For those who are interested, this is our current blog:\n<a href=\"https://eapolicy.wordpress.com/\">https://eapolicy.wordpress.com/</a></p>\n<p>We will try to keep it fairly updated.</p>\n", "parentCommentId": null, "user": {"username": "Gentzel"}}, {"_id": "kigQp97cGMd88MM2s", "postedAt": "2015-08-13T20:55:42.842Z", "postId": "EwGRzxJQpoeirPs56", "htmlBody": "<p><a href=\"https://impact.hackpad.com/12-July-2015-Presentation-on-Effective-Altruism-Policy-Analysis-LXE8ksxnz4h\">Here are the notes from the .impact deep dive on EAPA</a>.</p>\n", "parentCommentId": null, "user": {"username": "Tom_Ash"}}]