[{"_id": "vcDkD4fNAupPCxw3Q", "postedAt": "2022-11-03T10:13:23.347Z", "postId": "EWiCySDcLSyiHTRQn", "htmlBody": "<p>A charming and thought-provoking post , to which I will just add a few minor nitpicks. I cannot stand the framing of everything through Newman's dubious concept of development of dogma, which IMO is a slow-motion bomb blowing up Catholic orthodoxy. In fact I don't see that this adds anything to the piece, which stands perfectly well without it! &nbsp;All your excellent points about the antiquity of Christian acceptance of a long timeframe between the life of the Lord and his Second Coming work fine without this bizarre insistence that unchanging dogma develops according to completely arbitrary and post hoc criteria of authenticity. For modern Catholicism, of course, with its fixation on the theological authority of the Pope, this sort of thing is quite nice because ultimately both Newman and his modern interpreters simply made the authoritarian turn down the road of church history and turned authentic doctrinal development a simple matter of \"whatever Rome wills\", but this is IMO historically unsupportable and an evangelistic disaster.<br><br>Another nitpick: 'and even a committed Augustinian notion of perseverance as entirely God’s gift maintains that “a man who does not persevere fails by his own fault.”' - I think a secular audience will misunderstand this. Augustine's \"fault\" is the fallen nature of man: it is not a personal capacity of any individual. Man sins through his own inherited weakness &nbsp;and natural propensity towards sin- the \"fault\" - but can only do good through the grace of God. But I think nowadays this is widely misinterpreted as saying that human nature is morally neutral and individual persons simply make good or bad choices in some kind of vacuum, whereas the Augustinian position is that all of us are born defective, entirely irredeemably so absent the grace of God and so we will inevitably choose the bad. I'm sure you know this perfectly well, of course, but I think this audience will not.<br><br>But again, these are minor nitpicks. To add some more scriptural evidence to the contention that Christian longtermism is theologically viable: Genesis 15:5, where we can, I think, read the text as God showing Abraham all the stars of the universe, by a special grace of extraordinary vision. This would, I think, imply 300 billion trillion descendants of Abraham, which the Earth could never support, so logically I think this must imply an eventual inter-Galactic &nbsp;Empire. In Haggai 2:9, of course, God promises that \"the glory of this latter house shall be greater than of the former\", which we can read as narrowly referring to the rebuilt Temple, more broadly as referring to the New Testament, but which we might read even more broadly as a perpetual promise of the slow ascent of man, up the skyscrapers, towards the stars, and towards the great eventual reunion with the divine. These are, I admit, more speculative readings, but somewhere from heaven I like to think Origen smiles down on them.</p>", "parentCommentId": null, "user": {"username": "Sabs"}}, {"_id": "nCFyN7Kquzvjq4BJD", "postedAt": "2022-11-03T10:40:22.288Z", "postId": "EWiCySDcLSyiHTRQn", "htmlBody": "<p>Thank you for sharing your response. You make some great points for me to think about.&nbsp;</p><p>&nbsp;</p><p>The only thing I'd add is that, writing to a Catholic theological audience, you have to really work quite hard to justify saying anything new, especially if you want to gain traction in more conservative circles. I guess ultimately it's a rhetorical thing: Newman's idea of the development of dogma is a generally accepted framework for legitimising novel ideas, and I believe is applicable in this case in a softer use, as an example of how, in light of new knowledge outside of theology, maintaining dogmatic principles can lead to some surprising implications.</p>", "parentCommentId": "vcDkD4fNAupPCxw3Q", "user": {"username": "Fr Peter Wyg"}}, {"_id": "beaWABELPp3itXBko", "postedAt": "2022-11-03T11:07:12.341Z", "postId": "EWiCySDcLSyiHTRQn", "htmlBody": "<p>Dear Fr,</p><p>&nbsp;</p><p>Yes, that makes sense. I am actually a traditionalist Anglo-Catholic with a strong Augustinian bent, so in my corner of the Church of England things are a little different and I think there's more acceptance of novelty. Nevertheless, I wonder if even in more conservative Catholic circles it would be easier to gain acceptance of more novel takes if the primary framing was exegetical rather than top-down doctrinal, if that make sense? After all, the Fathers always do theology through exegesis rather than vice versa, and I still feel the possibility space of things we can say about Scripture remains vastly under-explored.&nbsp;</p>", "parentCommentId": "nCFyN7Kquzvjq4BJD", "user": {"username": "Sabs"}}, {"_id": "fsu5pBxKKC6nBGPbn", "postedAt": "2022-11-03T13:08:48.389Z", "postId": "EWiCySDcLSyiHTRQn", "htmlBody": "<p>I haven't read this post yet, but it sounds like you might be interested in <a href=\"https://globalprioritiesinstitute.org/stefan-riedener-existential-risks-from-a-thomist-christian-perspective/\">this paper on existential risks from a Thomist Christian perspective</a> if you haven't seen it already.</p>", "parentCommentId": null, "user": {"username": "elliottthornley"}}, {"_id": "bDFgqaChhAAKm3kXd", "postedAt": "2022-11-03T13:10:47.173Z", "postId": "EWiCySDcLSyiHTRQn", "htmlBody": "<p>Thank you for the post!</p><p>Are you aware of catholic institutes/seminars that discuss themes of AXR? Have you considered starting one?<br><br>I could connect you to other Catholics in the EA community who are interested. There's a vibrant <a href=\"https://www.eaforchristians.org/community-directory\">community of Christians</a> engaging with these themes.</p>", "parentCommentId": null, "user": {"username": "JDBauman"}}, {"_id": "YKFRcehXQ7G5khvgd", "postedAt": "2022-11-04T12:57:20.714Z", "postId": "EWiCySDcLSyiHTRQn", "htmlBody": "<p>[For context, Father, I was raised and confirmed as a Catholic, but I have left the faith. Hopefully that explains something that you might pick up from my comment, a kind of frustration and impatience with attempts to reconcile Christian dogma with developments in secular ethics; and hopefully what I write is nonetheless helpful to you.]</p><p>'theology needs to assimilate&nbsp;awareness of&nbsp;the potestas annihilationis, and <strong>so long as no discontinuity of principles arises</strong>, any theological implications and adjustments inferred by the discovery of AXRs would constitute authentic development of dogma.'</p><p>I simply cannot see how the introduction of AXRs into theology could <strong>not</strong> introduce a discontinuity into Christian principles. The words of the Nicene and Apostles' Creeds are pretty clear: Christ will come to 'judge <strong>the living</strong> and the dead'. &nbsp;The words of St Paul are pretty clear: on the day of judgment, those 'who are alive, <strong>who are left</strong>, will be caught up in the clouds together with [the dead] to meet the Lord in the air, and so we will be with the Lord forever'. The words of Christ himself are pretty clear: 'on this rock I will build my church, and the gates of Hades will not prevail against it. ' When Christ returns, there will still be living humans 'who are left', and the church will have been sustained through faith and grace. The obvious inference, then, is that humanity shall not go extinct before the parousia.</p><p>That Christ will return to his creation is not just an accidental part of Christian dogma; along with the atonement and the resurrection, it is the centrepiece of Christianity, defining what it even means to be a Christian. But his creation must still be there when he returns. Taking seriously the possibility that humanity might destroy itself undermines this very basic level of dogma. You may be correct that providence must be reconciled with responsibility; but the idea of a species-level extinction event seems to me incompatible with <i>any</i> conception of providence. If <i>any</i> of scripture's promises of providential protection are to be taken seriously, this must include the very basic providential protection of the human species itself, which was made in <i>imago Dei</i>.</p><p>You speak of our 'awareness' that humanity might annihilate itself. But this is a purely secular awareness, that has come about after the 'death of God' in Western culture (both popular and intellectual) and the emergence of secular science and ethics.<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefc9tokt7m0w\"><sup><a href=\"#fnc9tokt7m0w\">[1]</a></sup></span>&nbsp;I see no way for Christianity to incorporate this awareness while remaining Christian.</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnc9tokt7m0w\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefc9tokt7m0w\">^</a></strong></sup></span><div class=\"footnote-content\"><p>Indeed, it's my scholarly belief that Derek Parfit's arguments about the ethical stakes of extinction (which are the foundation of almost all work on existential risk) came about when he moved away from the cyclical and implicitly providentialist understanding of time that his contemporaries had inherited from Malthus, and moved into a purely secular and catastrophist temporal framework. But I've not published this work yet!</p></div></li></ol>", "parentCommentId": null, "user": {"username": "Peter McLaughlin"}}, {"_id": "pS7DZf4yKRMofwiEY", "postedAt": "2022-11-04T15:00:38.685Z", "postId": "EWiCySDcLSyiHTRQn", "htmlBody": "<p>Thanks for sharing this! One thing I thought you might be interested in is the Pope and Pontifical Academy of Sciences involvement with work on climate change, and biodiversity.</p><p>In a recent post (<a href=\"https://forum.effectivealtruism.org/posts/ukk5f4bqqBAWbF4Zh/lord-martin-rees-an-appreciation\">Lord Martin Rees: an appreciation</a>) I noted:</p><p>\"One particularly notable example on climate is his work at the Vatican. In May 2014, he helped Sir Partha Dasgupta co-organise a major workshop with the Pontifical Academy of Sciences on climate change. After the workshop, Sir Partha spoke to the Pope directly and encouraged him to include climate change in his speeches and to urge people to be better stewards of the planet. The workshop underpinned a major&nbsp;<a href=\"https://www.pas.va/en/publications/extra-series/es41pas.html\"><u>report</u></a> published in April 2015 by the Vatican. The report in turn partly informed the May 2015&nbsp;<a href=\"https://www.vatican.va/content/francesco/en/encyclicals/documents/papa-francesco_20150524_enciclica-laudato-si.html\"><u>Laudato si’</u></a> Papal Encyclical, which focussed on the impending threat of climate change and was&nbsp;<a href=\"https://en.wikipedia.org/wiki/Laudato_si%27\"><u>influential</u></a> in encouraging the 1.3 billion Catholics worldwide to support for the Paris Agreement, agreed in December 2015.\"</p>", "parentCommentId": null, "user": {"username": "HaydnBelfield"}}, {"_id": "ateWsYbnpkd7PvPNK", "postedAt": "2022-11-04T23:18:19.832Z", "postId": "EWiCySDcLSyiHTRQn", "htmlBody": "<p>You partly acknowledge this, but I really think there's probably a bit of pre-compatabilist confusion going on here. Knowing with certainty that you will succeed at preventing catastrophic risks does not excuse you from working hard to do it. Prophesies do not undermine agency, they include it, they are about it, they are realized through and in accordance with the agency of their subjects.</p><p>Consider this: When I was writing this comment, I was absolutely certain that I would finish writing the comment, and that it would be posted. It wouldn't be in spite of my agency but because of it.</p><p>From what I understand, it's impossible to really digest the existence of humanity under the existence of a god that is responsible for everything that happens, without developing this providence-agency compatibalism, I really would expect it to be a majority assumption?</p><p>&nbsp;</p><p>I think there's another thing you're identifying which I'd agree is a complication: Secular longtermist models never actually give us a certain prophesy of success even assuming the cooperation of the agency of humanity, that is not our prophesy. We aren't expecting to reach 0 risk of failure.<br>But I don't know that the metaphysics patch that resolves the conflict is particularly messy... I have something for it... but I'm not quite a christian, so I'll refrain from suggesting a patch unless asked.</p>", "parentCommentId": "YKFRcehXQ7G5khvgd", "user": {"username": "MakoYass"}}, {"_id": "nmazuETfvvmdkfuhy", "postedAt": "2022-11-05T11:02:38.882Z", "postId": "EWiCySDcLSyiHTRQn", "htmlBody": "<p>I think you've imported some intuitions from the secular free will debate into thinking about providence, in potentially unhelpful ways. e.g., the framing of 'compatibilism', which is unhelpful because nobody (not even the Calvinists!) thinks providence is incompatible with agency; the question is not 'are these two things compatible?', but rather 'how are these two things compatible?'. 'Compatibilism' is thus less a position in the debate than the presupposition that makes the debate meaningful in the first place. But you identify the position that agency is compatible with providence with a particular model of the relationship between those two (a model influenced by secular free-will compatibilism), implicitly begging the question against all other models.</p>\n<p>Your model implicitly presumes that, when Christ prophecies that he shall return and judge the living (and the dead), the fact that 'the living' are still around is fully the causal responsibility of human beings—in the nearest (im)possible world where everyone dies before the parousia, nothing about God would have to be different, only some facts about humans. As you had it, prophecies are about agency.</p>\n<p>I think this is false on its strongest readings: prophecies are partly about divine providence. And divine providence cannot just mean that the deist god set everything up just right in the beginning such that everything just worked out as planned; it has to mean that God is actively working in his creation, as is Christian dogma. In this case, in the (im) possible world where the gates of Hades really do prevail against the church and creation is destroyed, some facts about God and his providence must be different - he must be acting in a different way. Your model, I think, is incompatible with Christian dogma, although it might be compatible with other religions (e.g., I think Islam might be closer to this, although I'm no expert).</p>\n<p>To put it slightly differently, what you call 'pre-compatibilist confusions' are exactly what are necessary for this debate, because secular compatibilism is just the position that arises when you start to ignore divine providence and only bare impersonal determinism remains. Compatibilists all deny that impersonal determinism is at all analogous to some agent intervening in the causal structure (this is part of what it means to be a compatibilist); but divine providence <em>is</em> kinda analogous to that. If you want to call this position a 'pre-compatibilist confusion', you are committed to seeing all views on which God is active in his creation as inherently confused. I might be sympathetic to that view; but I doubt that it's the position you thought you were arguing for.</p>\n", "parentCommentId": "ateWsYbnpkd7PvPNK", "user": {"username": "Peter McLaughlin"}}, {"_id": "JK5ZEvcEBMhWi5zKi", "postedAt": "2022-11-06T01:12:26.188Z", "postId": "EWiCySDcLSyiHTRQn", "htmlBody": "<blockquote><p>which is unhelpful because nobody (not even the Calvinists!) thinks providence is incompatible with agency</p></blockquote><p>Mostly I was just trying to derive, in my odd way, that they wouldn't. But if that's common knowledge yeah it might not have been helpful.</p><blockquote><p>And divine providence cannot just mean that the deist god set everything up just right in the beginning such that everything just worked out as planned ... Your model, I think, is incompatible with Christian dogma</p></blockquote><p>Mm, that is my relationship with nature. I'd heard that there were deists in the christian world (I think there still are?) so I didn't realize it was incompatible with Christian dogma as it is carried.</p><p>And I guess... personally... I don't understand how very many people <i>could</i> sustain a perception of the world as a place that is subject to ongoing divine intervention so I'm surprised if it's not common. If there are and were interventions, a lot of them must consist of measures to keep people like me from getting to see any sign of them (and I think about that a lot)</p><p>Could you unpack \"<strong>Compatibilists </strong>all deny that <strong>impersonal determinism </strong>is at all analogous to some agent intervening in the causal structure (this is part of what it means to be a compatibilist)\" a bit?</p><blockquote><p>If you want to call this position a 'pre-compatibilist confusion' -</p></blockquote><p>I... think I probably don't</p>", "parentCommentId": "nmazuETfvvmdkfuhy", "user": {"username": "MakoYass"}}, {"_id": "DTgHAu6SRenw6SQuB", "postedAt": "2022-11-06T11:26:24.278Z", "postId": "EWiCySDcLSyiHTRQn", "htmlBody": "<p>'personally... I don't understand how very many people <i>could</i> sustain a perception of the world as a place that is subject to ongoing divine intervention'.</p><p>I agree! But that's where you differ from Christianity. OP is a Catholic, and it is part of Catholic dogma that miracles are happening all throughout the world right to this day. It is, for example, one of the criteria for sainthood that (excepting cases of martyrdom) the candidate for sainthood must have performed verifiable miracles in their lives. The Vatican often takes this requirement <i>very </i>seriously indeed, sending teams of serious and seemingly-rational men to investigate every facet of the purported miracles; and in a lot of cases - not most, but many - these men are satisfied that the miracle did indeed occur. The most recent canonisations occurred just last month. 'Miracle' here isn't 'nice thing that happened because of the saint that might seem supernatural but could just be surprising'; it is <i>defined</i> as an event 'which can only be attributed to divine power'.</p><p>You might try to explain it away, by saying that the Vatican is just keeping up appearances and the Catholic hierarchy doesn't <i>really</i> believe in constant supernatural intervention in the world; but I think this is pretty unsustainable when you actually look closely at how the people in question behave. This might seem odd to you, but it's a matter of fact that this all happens.</p><p>Things are slightly different in other Christian denominations (Protestantism is especially diverse and thus weird), but in general the belief in some kind of divine providence is shared dogma across all different versions of mainstream (Nicene/Chalcedonian) Christianity. Trying to rationalise Christian belief as 'well I guess they must be compatibilist deists' isn't being charitable, it's potentially offensive as well as philosophically incorrect. It might be hard for you to understand that people genuinely do believe in ongoing divine intervention in the world, but that's what it is.</p><blockquote><p>Could you unpack \"<strong>Compatibilists </strong>all deny that <strong>impersonal determinism </strong>is at all analogous to some agent intervening in the causal structure (this is part of what it means to be a compatibilist)\" a bit?</p></blockquote><p>Contrast your earlier example (you are writing a comment, and you are certain that you are going to finish it <i>because</i> that's what you want to do) with an example of coercion (you are writing a comment, and you are certain that you are going to finish it <i>because</i> someone has a gun to your head and is forcing you to write it). In the latter example, there is obviously some sense in which you are 'unfree'; everyone, except maybe Thomas Hobbes, would agree with that. In the former example, incompatibilists would tend to argue that you are also unfree: if you are able to be <strong>certain</strong>, your decision must be pre-determined in some sense, and this makes you unfree. Compatibilists, however, insist that the former case is not like the latter case: while you are unfree when an agent intervenes in the causal structure of your decision, you are perfectly free when you are 'determined' by the causal structure itself.</p><p>The point that I was making is just that God's providence is more like the former than the latter: it's an instance of some agent <i>intervening</i> in the causal order of your decision, not the causal structure just playing itself out. But Christians, of course, can't say that it's <i>entirely</i> analogous to the gun-to-the-head case, since they want to say that providence is compatible with free agency. So the philosophical question for Christians is how to combine human freedom with divine intervention in the world. This is an entirely different question from the compatibilism question in secular philosophy, which asks how free will might work if we just ignored God or denied that he existed. In that case, issues about divine intervention fall away, and the only question is whether you are free if the initial set-up of the universe was <i>just so</i> such that your decision was in a certain sense 'pre-determined'. As you write, 'that is my relationship with nature'. <i>Nature</i>, sure; but not the Christian God.</p>", "parentCommentId": "JK5ZEvcEBMhWi5zKi", "user": {"username": "Peter McLaughlin"}}, {"_id": "CHhBr2trNio5jE9bD", "postedAt": "2022-11-07T02:46:41.315Z", "postId": "EWiCySDcLSyiHTRQn", "htmlBody": "<blockquote><p>You might try to explain it away</p></blockquote><p>I wouldn't, I didn't realize they were recognizing new saints! That's quite surprising and I can't see why they'd do it unless they believed it was correct.</p><blockquote><p>Trying to rationalise Christian belief as 'well I guess they must be compatibilist deists'</p></blockquote><p>I will persist with this a bit though, there must be an <i>extent</i> of compatibilist deism, given the extent to which the world was obviously and visibly set up to plausibly work in an autonomous way and the extent to which most of the catholics I know are deeply interested in science, believe in evolution, etc, they know how much how many of these machines drive themselves (although they might draw the line at the brain). They may believe in ongoing miracles, but they know that the miracles are not the norm, and they must wonder why.</p>", "parentCommentId": "DTgHAu6SRenw6SQuB", "user": {"username": "MakoYass"}}, {"_id": "axYjQBpKWvAd8zRuW", "postedAt": "2022-11-07T09:38:06.614Z", "postId": "EWiCySDcLSyiHTRQn", "htmlBody": "<p>The world is 'obviously and visibly' autonomous to you, maybe; but not to Christians. From the CCC:</p>\n<blockquote>\n<p>With creation, God does not abandon his creatures to themselves. He not only gives them being and existence, but also, and at every moment, upholds and sustains them in being, enables them to act and brings them to their final end. Recognizing this utter dependence with respect to the Creator is a source of wisdom and freedom, of joy and confidence.</p>\n</blockquote>\n<p>(Again, similar positions are dogma in other Christian denominations; I focus on Catholicism because I know it best and because OP is a Catholic.) The crucial phrase here is 'at every moment': every single act is enabled only by God, every being is sustained by him at all times. Nothing is autonomous; we are 'utterly dependent', both metaphysically and ethically, on God.</p>\n<p>If you think this is an obviously mistaken view, then you believe that Christianity (at least in its orthodox varieties) is obviously mistaken. For what it's worth, I'd warn against being so hasty here: you take your view for granted only because you are benefitting from the centuries of hard intellectual labour it took to even state the naturalist worldview clearly, never mind to argue in favour of it. Your mechanistic view of the universe is not the shared common sense of all humans; it's an incredibly recent intellectual development, and it's worth reading around to discover just how unobvious it actually is.</p>\n<p>But regardless, even if you continue to see some version of your position as 'obviously correct', it's important to be clear that it is not an orthodox Christian view. It's far too easy to underestimate the intellectual diversity of the world, and it's something I have seen on this forum in particular innumerable times. When dealing with alternate worldviews, it's easy to treat them as basically similar to and commensurate with our own, imagining that they share the basic 'obvious' foundations even as they differ sharply on important questions. But other worldviews are in fact far more alien than EAs typically imagine.</p>\n<p>This is why I'm so impatient with things like 'EA for Christians' , which has tended to focus on some surface-level consonances while not even noticing the immense gulf between secular ethics and Christian ethics at the most foundational level. (By contrast, this immense gulf was obvious to proto-EAs like Derek Parfit, who made it the basis of his ethical methodology, and to a lesser extent Peter Singer.) I really enjoyed OP's post, because he really takes seriously that there is a difficult intellectual challenge in trying to accommodate thinking about x-risk into Christianity. But far too many EAs think of this as a messaging and outreach problem, rather than a fundamental philosophical issue.</p>\n", "parentCommentId": "CHhBr2trNio5jE9bD", "user": {"username": "Peter McLaughlin"}}, {"_id": "Qh9soW9E62aZgAXnp", "postedAt": "2022-11-07T17:44:46.572Z", "postId": "EWiCySDcLSyiHTRQn", "htmlBody": "<p>So glad to see this come up. I used to 'intern' at the Pontifical Academy of Sciences when I was training to be a priest in Rome and was a fly-on-the-wall for that very workshop.</p><p>In hindsight, &nbsp;my time there was a big part of me ending up doing this sort of thing, getting used to talking about the big questions. It's a great place!&nbsp;</p>", "parentCommentId": "pS7DZf4yKRMofwiEY", "user": {"username": "Fr Peter Wyg"}}, {"_id": "nHCAzTppHkodWGsmt", "postedAt": "2022-11-07T18:00:42.354Z", "postId": "EWiCySDcLSyiHTRQn", "htmlBody": "<p>I've really enjoyed following this. Thanks so much for engaging here.&nbsp;</p><p>The only thing I'd add is that I see the translation into species-level freedom-to fail as an extension of the individual agent's relationship to providence. We've tended away from talking about how individuals can fail to live up to God's hope for their salvation, despite providence. This is true at a practical level, (people of profound faith checking both ways before crossing the street) , before we even begin to look at sin. &nbsp;The history theology is rich in proposals for reconciling this for the individual, so to the extent to which we have learnt to live in that tension, including the apparent capriciousness of miracles, &nbsp;I am optimistic about &nbsp;this hard-case. I would recommend the publications from the Divine Action Project (https://open.bu.edu/handle/2144/904) which have given me confidence that there is a way forward.&nbsp;</p><p>I'd just reiterate that the discovery of anthrop<s>o</s>genic existential risks indeed has massive implications for theology which need to be worked out, a process that will take many hands but &nbsp;I do not see this as fatal. The core of the Christian faith is the revelation of a means of salvation, but which is a path fraught with opportunities for failure, and a oath we have always had to make a concerted effort to walk.</p>", "parentCommentId": "axYjQBpKWvAd8zRuW", "user": {"username": "Fr Peter Wyg"}}, {"_id": "QMRKHEHpqAaZQ28tg", "postedAt": "2022-11-08T14:15:51.648Z", "postId": "EWiCySDcLSyiHTRQn", "htmlBody": "<p>Thank you for your reply, Father. You're right that this conversation has tended towards broader themes of agency and providence, so I just want to briefly return to (anthropogenic) x-risks specifically in this comment, because I think there's a disanalogy between (a) the well-studied 'hard-case' of individual freedom-to-fail (b) the case of species-level freedom-to-fail.</p><p>[I hope it's OK for me to write what follows, purely for convenience's sake, as if I shared your faith. My first attempt at this comment was quite clunky, with a lot of unnecessary phrases like 'Catholics believe' and 'it is Catholic dogma that' cluttering up the argument. But I understand that this way of writing is not always taken well coming from an atheist, and not for no reason. Feel free to read it all as if it were in scare quotes and preceded with 'if I were a Catholic, I would say:'.]</p><p>In the case of (a), we know from scripture that (despite God's hopes) not all will be saved. This is a repeated theme, for example, in Christ's parables. Now, there is a serious theological problem about how we might reconcile this revealed truth with God's providence and hope for our salvation; but, as you mention, there are serious proposals for how to answer this question. But (importantly) the question only arises because the Holy Spirit has revealed to us, through scripture, that not all shall be saved. It's part of our duty to puzzle out the mystery of <i>how</i> this might be true; but it is not up to us to doubt that it <i>is</i> true.</p><p>By contrast, when we turn to the case of (b) the revelation of scripture is <i>not</i> that humanity might go extinct before the parousia. Indeed, I think there are many verses which seem plainly to have the implication that this is not a real possibility. This is not a case where God <i>hopes</i> for something to come about, but rather one where he has declared that it <i>will </i>come about: Christ will come again to judge the living and the dead. This is not a case where we're asking how something that God has revealed <i>is </i>true, <i>might be </i>true; we're essentially asking how it <i>might not</i> be true. The problem for your position, as I see it, is not primarily a philosophical one; rather, it's a scriptural one.</p><p>There are, of course, cases that are more analogous to (b) than (a) that have been discussed by theologians: similar difficulties abound over the question of whether and how Judas might have had the freedom to <i>not </i>betray his Lord, for example, even as Christ has already declared that he <i>will</i>. But none of these cases seem exactly analogous to me. And I think secular thinking about existential risk has been informed, to such an immense degree, by assumptions incompatible with Christianity (e.g., as <a href=\"https://aeon.co/essays/to-imagine-our-own-extinction-is-to-be-able-to-answer-for-it\">Thomas Moynihan has emphasised</a>, the separation of fact from value) that it's an insurmountable challenge to try to turn back around and integrate it into Christianity.</p>", "parentCommentId": "nHCAzTppHkodWGsmt", "user": {"username": "Peter McLaughlin"}}, {"_id": "ZM9tPdQumDY4itEsc", "postedAt": "2022-11-10T12:11:06.332Z", "postId": "EWiCySDcLSyiHTRQn", "htmlBody": "<p>Important point - religions evolve. Which would raise the question of whether Christianity would still be Christianity. But many people draw upon core religious teaching and integrate it into their moral compasses or insights into reality - what many of us coin as 'spirituality'. For example, Jesus as a role model and Christian insights on love-unity, 'grace', empathy and compassion. &nbsp;Buddhist insights on interconnectedness and direct experience. Islamic themes of surrender. It would not be unconceivable that conflict between dogma and secular 'truths' would drive one's religious believes to evolve.</p>", "parentCommentId": "YKFRcehXQ7G5khvgd", "user": {"username": "Darren_Tindall"}}, {"_id": "8cbSGsdbZgStjt9Z2", "postedAt": "2023-02-07T12:38:30.871Z", "postId": "EWiCySDcLSyiHTRQn", "htmlBody": "<p>Wow, that's super interesting! As a member of <a href=\"https://firstchurchlove.com\">First Church Love</a>, it's great to see a Catholic priest actively researching and advocating for the Catholic Church's role in promoting existential security. Your background in Electronic Engineering and current Ph.D. in Theology give you a unique perspective on this topic. I'd love to read the article and learn more about how a Christian imagination can offer valuable resources for evaluating future human flourishing. Keep us posted, and feel free to contact the First Church Love community for any questions or comments. We're here to support and engage in these important discussions. 👍</p>", "parentCommentId": null, "user": {"username": "TaylerCake"}}]