[{"_id": "X5HQLkpZxj8giW4PT", "postedAt": "2024-03-12T15:28:25.851Z", "postId": "ExAupz9tdTj2s56GG", "htmlBody": "<p><strong>Executive summary:</strong> The animal welfare movement emerged in the 18th-19th centuries, overcoming initial challenges to establish animal cruelty as a legal and moral issue, and was closely linked with the early children's rights movement.</p><p><strong>Key points:</strong></p><ol><li>In the 1700s-1800s, society began shifting from viewing animals as objects to seeing them as beings deserving moral consideration, at least for some species like dogs and horses.</li><li>Early advocates like Richard Martin and Henry Bergh pushed for anti-cruelty legislation in Britain and the US, facing mockery and practical challenges but making gradual progress.</li><li>The British RSPCA and American ASPCA were key organizations in establishing the movement, boosted by endorsement from Queen Victoria and a large bequest to the ASPCA.</li><li>Initially, animal welfare was framed in terms of human morality and avoiding the disgust of witnessing cruelty. Advocates were often seen as sentimental busybodies.</li><li>The animal welfare and children's rights movements were closely linked, as both challenged norms of owners' total control over their animals or children.</li></ol><p>&nbsp;</p><p>&nbsp;</p><p><i>This comment was auto-generated by the EA Forum Team. Feel free to point out issues with this summary by replying to the comment, and</i><a href=\"https://forum.effectivealtruism.org/contact\"><i>&nbsp;<u>contact us</u></i></a><i> if you have feedback.</i></p>", "parentCommentId": null, "user": {"username": "SummaryBot"}}, {"_id": "dYwFYo5DD4bxujHmD", "postedAt": "2024-03-13T14:26:46.261Z", "postId": "ExAupz9tdTj2s56GG", "htmlBody": "<blockquote>\n<p>I haven't read it, but the Oxford Handbook of Social Movements is probably a treasure trove</p>\n</blockquote>\n<p>We have a copy, if anyone in the Boston area would like to borrow it.  I tried to read it but found it very slow going.</p>\n", "parentCommentId": null, "user": {"username": "Jeff_Kaufman"}}, {"_id": "jRKgYxfMovbSfZeTX", "postedAt": "2024-03-13T19:15:15.298Z", "postId": "ExAupz9tdTj2s56GG", "htmlBody": "<p>Nice write up! Henry Bergh was awesome. I highly recommend a biography on him called <a href=\"https://www.amazon.com/Traitor-His-Species-Animal-Movement/dp/0465093868\">\"A Traitor to His Species\"</a>.&nbsp;<br><br>It's a treasure trove of fascinating anecdotes about early animal rights advocacy. It's been a minute since I read it, but these parts stuck with me:</p><ul><li>Bergh didn't start this work until he was like 52! Talk about a late bloomer. He spent the first 3/4 of his life drifting aimlessly about, dabbling in things but never making much of an impact or trying too hard at anything. That's great inspiration for anyone who has ever thought it's too late for them to make a change.&nbsp;</li><li>Bergh's first attempt at stirring up popular opinion in favor of animals was by arresting people who were importing live turtles in disturbing ways (turtles flipped on their back with fins tied up.) I would have guessed he'd go to bat for a cute and cuddly animal first.&nbsp;</li><li>The ASPCA once got a big donation from a guy who was dying and was terrified of being reincarnated as a draft horse. He'd worked intimately with draft horses and knew how bad their lives were, and I guess he felt guilty. The shocking conditions for draft horses were some of the saddest portrayals in the book.&nbsp;</li><li>A \"sport\" where dogs competed to see who could kill the most rats was very popular in late 1800's NYC.&nbsp;</li><li>At one point a method for euthanizing stray dogs involved rounding them up, putting them into a giant container, and lowering that container into the East River.<br><br><br><br>&nbsp;</li></ul>", "parentCommentId": null, "user": {"username": "Drew Housman"}}, {"_id": "EepNHrTj4xvdCdGnu", "postedAt": "2024-03-14T02:35:27.796Z", "postId": "ExAupz9tdTj2s56GG", "htmlBody": "<p>This was a delight to read! I found the fact that an essay competition in 1837 was a successful activist move really striking!</p>", "parentCommentId": null, "user": {"username": "ChanaMessinger"}}]