[{"_id": "2XDLngG3pwCpA8jpb", "postedAt": "2023-09-17T05:16:41.693Z", "postId": "EY9HcM96awXC8y5eW", "htmlBody": "<p>Thank you Luke (and your team) for the conceptualization and implementation of this competition. You did a great job!</p>\n<p>Also, reading through these posts have enriched my mind and it was truly enlightening to see and learn from different intellectual perspectives of EA from Africa</p>\n", "parentCommentId": null, "user": {"username": "Kikiope"}}, {"_id": "FnFCNrsKsDRbqsqAL", "postedAt": "2023-09-17T06:16:21.899Z", "postId": "EY9HcM96awXC8y5eW", "htmlBody": "<p>Congratulations to all the victors! Personally, I've faced challenges when it comes to competitions and applications, particularly within the Effective Altruism (EA) sphere. When it mentioned a \"typical forum style,\" I started doubting my ability to make an impact in the EA context because I felt I didn't align with the ideal EA system.</p>\n<p>As I reflect on it, it seems that EA members possess a distinct mindset, approach, and perspective. I've come to the realization that making a significant impact within the EA context might not be my forte.</p>\n<p>Nevertheless, I want to express my gratitude to the organizers for providing me with the opportunity to voice my thoughts and opinions on various issues. Thank you!</p>\n", "parentCommentId": null, "user": {"username": "emmannaemeka"}}, {"_id": "DbnnurdHYcCQ9iELJ", "postedAt": "2023-09-17T08:18:10.693Z", "postId": "EY9HcM96awXC8y5eW", "htmlBody": "<p>Nice comment and interesting reflections!<br><br>\"As I reflect on it, it seems that EA members possess a distinct mindset, approach, and perspective. I've come to the realisation that making a significant impact within the EA context might not be my forte.\" - I understand this sentiment but would encourage you to stay engaged!&nbsp;<br><br>&nbsp;For what its worth I would have put your fungus post right near the top of the cause exploration section of this competition, found it novel and compelling.</p>", "parentCommentId": "FnFCNrsKsDRbqsqAL", "user": {"username": "NickLaing"}}, {"_id": "mWeot5eRyKqitwSsM", "postedAt": "2023-09-17T09:58:28.188Z", "postId": "EY9HcM96awXC8y5eW", "htmlBody": "<p>Thank you, Nick, for your thoughtful feedback. Perhaps in the future, event organizers could clearly specify the preferred \"article format\" and the criteria for evaluation. This would help eliminate biases and promote transparency. When writers are asked to contribute without clear guidelines, but there are hidden expectations for a specific format, it can be demoralizing. Participating in future competitions may lose its appeal under such circumstances.</p>\n<p>To ensure objectivity, consider implementing an open voting system in the future. This approach can foster fairness and impartiality in the selection process.</p>\n<p>This is all the more important because of the judgment criteria earlier set out</p>\n<p>Posts will be judged based on the following rubric:</p>\n<p>Originality of insight\nClarity\nDiscussion provoked: (judged by the post’s forum score and number of comments)\nPersuasiveness of argument\nThis is replaced by Relevance to forum readers for summaries of existing work</p>\n<p>Looking at the above in the context of</p>\n<p>“ I think it's notable that it is not always the highest karma post that won within each category. We didn't want to anchor too much to reception by forum readers, and to reward posts that were outside the typical forum style (still requiring that a post be original, clear, discussion-provoking, and persuasive or relevant to the forum)”</p>\n<p>You can tell that unexplained rules and changing rules mid way would not help.</p>\n<p>All the same, I am happy I shared my thoughts and I hope it will provoke some research and increased support in studying fungi</p>\n", "parentCommentId": "DbnnurdHYcCQ9iELJ", "user": {"username": "emmannaemeka"}}, {"_id": "ruGukp2h4eN6qo2Qq", "postedAt": "2023-09-17T11:07:12.727Z", "postId": "EY9HcM96awXC8y5eW", "htmlBody": "<p>Thanks Emma</p><p>To be fair the winners displayed a wide range of formats, I don't think there was a standard \"kind\" of post that they were looking for really. Also they did list \"engagement\" as only 1 of 4 criteria, which I personally agree with.<br><br>So we wouldn't expect all of the highest karma posts to win - most of them did I think.</p>", "parentCommentId": "mWeot5eRyKqitwSsM", "user": {"username": "NickLaing"}}, {"_id": "eLPor6xDLZe57p7ZE", "postedAt": "2023-09-17T12:56:26.369Z", "postId": "EY9HcM96awXC8y5eW", "htmlBody": "<p>Hi Emmanuel, I'm sorry to hear that you feel that rules were unexplained and changing in the process.</p><p>I see that you have emailed me on the same, and will respond there.&nbsp;</p>", "parentCommentId": "mWeot5eRyKqitwSsM", "user": {"username": "Luke Eure"}}]