[{"_id": "GtzFDT8mhrATAeWN6", "postedAt": "2022-10-21T08:26:40.250Z", "postId": "EyvGwhHd487ayPfLg", "htmlBody": "<p>This sounds like a great idea! I think it would have the benefit of empowering more people to do independent projects, because it will make the steps clearer, and humanize people who start them. It also reminds me a bit of this article: <a href=\"https://www.lesswrong.com/posts/DdDt5NXkfuxAnAvGJ/changing-the-world-through-slack-and-hobbies\">https://www.lesswrong.com/posts/DdDt5NXkfuxAnAvGJ/changing-the-world-through-slack-and-hobbies</a> (which argues that free-time projects like hobbies or non-work interests can be very impactful).</p>", "parentCommentId": null, "user": {"username": "Amber"}}, {"_id": "djrojfpgsRFkma7CW", "postedAt": "2022-10-21T15:58:38.888Z", "postId": "EyvGwhHd487ayPfLg", "htmlBody": "<p>As you point out in your post, this project would have the most impact if it encourages people who aren't likely to engage in earn-to-give or an effective career to pursue an independent project. As such, I'd suggest that it would be better not to tie the podcast too closely to the EA brand, or assume prior knowledge of EA. The title you're using at the moment would seem pretty confusing to anyone not already in the EA community.</p><p>I've been thinking quite a lot about something similar recently - not a podcast specifically, but a way to engage people outside the elitist circles that the EA movement tends to target in high impact projects. I'd love to chat to you directly if you're interested in pursuing this.</p>", "parentCommentId": null, "user": {"username": "Ree"}}, {"_id": "HTLjAXPZuWj6hLsyD", "postedAt": "2022-10-22T11:23:22.197Z", "postId": "EyvGwhHd487ayPfLg", "htmlBody": "<p>I think this is a lovely idea, I'd be very much in favour of you trying it out so we could all start listening and see how it works in practice!</p>\n", "parentCommentId": null, "user": {"username": "Khorton"}}, {"_id": "vWKSDjMqqi9K8cuFk", "postedAt": "2022-10-22T11:24:07.276Z", "postId": "EyvGwhHd487ayPfLg", "htmlBody": "<p>Yes, I like the  idea of not using the words \"effective altruism\" in the title at all</p>\n", "parentCommentId": "djrojfpgsRFkma7CW", "user": {"username": "Khorton"}}, {"_id": "BLjogMEmXTewDeZ7e", "postedAt": "2022-10-22T14:04:58.538Z", "postId": "EyvGwhHd487ayPfLg", "htmlBody": "<p>I feel like this proposal conflates two ideas that are not necessarily that related:</p><ol><li>Lots of people who want to do good in the world aren't easily able to earn-to-give or do direct work at an EA organization.</li><li>Starting altruistically-motivated independent projects is plausibly good for the world.</li></ol><p>I agree with both of these premises, but focusing on their intersection feels pretty narrow and impact-limiting to me. As an example of an alterative way of looking at the first problem, you might consider &nbsp;instead or in addition having people on who <a href=\"https://forum.effectivealtruism.org/posts/xdMn6FeQGjrXDPnQj/leveraging-labor-shortages-as-a-pathway-to-career-impact\">work in high(ish)-impact jobs where there are currently labor shortages</a>.</p><p>Overall, I think it would be better if you picked which of the two premises you're most excited about &nbsp;and then went all-in on making the best podcast you could focused on that one.</p>", "parentCommentId": null, "user": {"username": "IanDavidMoss"}}, {"_id": "vYEp8GdqCbzHKagQi", "postedAt": "2022-10-24T09:37:02.771Z", "postId": "EyvGwhHd487ayPfLg", "htmlBody": "<p>Thanks, Amber. Great article.</p>", "parentCommentId": "GtzFDT8mhrATAeWN6", "user": {"username": "Stan Pinsent"}}, {"_id": "fL5JpKNsnFhwG4ecf", "postedAt": "2022-10-24T09:42:01.559Z", "postId": "EyvGwhHd487ayPfLg", "htmlBody": "<p>Thanks for your thoughts. You make a good point - EA can be pretty alienating. There's a trade-off: Within the EA community there is a ready-made audience, probably lots of potential guests, less of a need to explain foundational concepts. But less potential impact, perhaps, as the podcast might only marginally help insiders to increase their impact.</p><p>Definitely open to a change in title.</p><p>I've sent you a message.</p>", "parentCommentId": "djrojfpgsRFkma7CW", "user": {"username": "Stan Pinsent"}}, {"_id": "QyTQpGKHfRs3s6tX7", "postedAt": "2022-10-24T10:06:21.997Z", "postId": "EyvGwhHd487ayPfLg", "htmlBody": "<p>Thanks, Ian. You make an excellent point: I don't want to unnecessarily narrow my focus here.</p><p>Perhaps I should focus on 1) because it also allows a broader scope of episode ideas. \"How can ordinary people maximise the good they do in the world?\" allows lots of different responses. Independent projects could be one of them.</p><p>On the other hand 2) seems more neglected. There's probably lots out there about startups or founding charities, but I can't find anything on running altruistic projects (except a few one-off posts).</p>", "parentCommentId": "BLjogMEmXTewDeZ7e", "user": {"username": "Stan Pinsent"}}, {"_id": "ybXvtcuydSLYp8fLu", "postedAt": "2022-10-24T10:51:27.100Z", "postId": "EyvGwhHd487ayPfLg", "htmlBody": "<p>Note that reality has an elitism problem - some people are much more able to affect the world than others. While this is sad, I think it's also true and worth acknowledging.</p><p>EA has an elitism problem on top of this, but I think it's a large chunk of it.&nbsp;</p>", "parentCommentId": null, "user": {"username": "nathan"}}, {"_id": "sGbHyo8DseFLtgAFK", "postedAt": "2022-10-25T06:58:43.681Z", "postId": "EyvGwhHd487ayPfLg", "htmlBody": "<p>Thanks for pointing this out. I agree, and I think we can trace the elitism in the movement to well-informed efforts to get the most from the human resources available.</p><p>While EA remains on the fringe we can keep thinking in terms of maximising marginal gains (ie only targeting an elite with the greatest potential for doing good). But as EA grows it is worth considering the consequences of maintaining such an approach :</p><ol><li>Focusing on EA jobs &amp; earning-to-give will limit the size of the movement, as newcomers increasingly see no place for themselves in it</li><li>With limited size comes limited scope for impact: eg you can't change things that require a democratic majority</li><li>Even if 2) proves false, we probably don't want a future society run by a vaunted, narrow elite (at least based on past experience)</li></ol>", "parentCommentId": "ybXvtcuydSLYp8fLu", "user": {"username": "Stan Pinsent"}}]