[{"_id": "Wri9azRZk6xM2bmAj", "postedAt": "2018-01-28T20:03:54.265Z", "postId": "Ez9m9ejbeYTJZwiMa", "htmlBody": "<p>Nice! I really like the idea of EAs getting ahead by coordinating in unconventional ways.</p>\n<p>The ideas in &quot;Building and EA social safety net&quot; could be indirectly encouraged by just making EA a tighter community with more close friendships. I'm pretty happy giving an EA friend a 0-interest loan, but I'd be hesitant to do that for a random EA. By e.g. organizing social events where close friendships could form, more stuff like that would happen naturally. Letting these things happen naturally also makes them harder to exploit.</p>\n", "parentCommentId": null, "user": {"username": "avacyn"}}, {"_id": "aJTitXEkBxzCEhpBZ", "postedAt": "2018-01-29T00:27:15.144Z", "postId": "Ez9m9ejbeYTJZwiMa", "htmlBody": "<p>For this group to make an effective social safety net for EAs having a bad time, more is needed than just money. When a real problem actually does arise, people tend to spam that person with uninformed suggestions which won't work. They're trying to help, but due to the &quot;what you see is all there is&quot; bias and others, they can't see that they are uninformed and spamming. The result is that the problem doesn't <em>seem</em> real to anyone.</p>\n<p>So, the person who has a problem, who may not have any time or emotional energy or even intellectual capacity left over, must explain why dozens of spitball suggestions won't work.</p>\n<p><strong>How spitballing can totally sabotage people in need of help:</strong></p>\n<p>Imagine that to obtain help, you have to patiently and rigorously evaluate dozens of ill-conceived suggestions, support your points, meet standards of evidence, seem to have a positive attitude about each suggestion, and try not to be too frustrated with the process and your life. </p>\n<p>The task of convincing people your problem is real while a bunch of friends are accidentally spamming you with clever but uninformed suggestions might be the persuasive challenge of a lifetime. If any of the ill-conceived options still seem potentially workable to your friends, you will not be helped. To succeed at this challenge, you have to make sure that every spitball you receive from friends is thoroughly addressed to their satisfaction.</p>\n<p>A person with a real problem will be doing this challenge when they're stressed out, time poor and emotionally drained. They are at their worst.</p>\n<p>A person at their worst shouldn't need to take on the largest persuasive challenge of their lives at that time. To assume that they can do this is about as helpful as &quot;Let them eat cake.&quot;.</p>\n<p>There's an additional risk that people will sour on helping you if they see that lots of solution ideas are being rejected. This is despite the fact that the same friends will tell you &quot;most ideas will fail&quot; in other circumstances. They know that ideas are often useless, but instead of realizing that the specific set of ideas in question are uninformed or not helpful, some people will jump to the conclusion that the problem is your attitude. </p>\n<p>Just the act of evaluating a bunch of uninformed spitball suggestions can get you rejected!</p>\n<p>Making a distinction between a problem that is too hard for the person to solve, and a person who has a bad attitude about solving their problem is a challenge. It's hard for both sides to communicate well enough to figure this out. Often a huge amount of information has to be exchanged.</p>\n<p>The default assumption seems to be that a person with a problem should talk to a bunch of friends about it to see if anyone has ideas. If you count up the number of hours it actually takes to discuss dozens of suggestions in detail multiplied by dozens of people, it's not pretty. For many people who are already burdened by a serious problem, that sort of time investment just is not viable. In some cases the entire problem is insufficient time, so it can be unfair to demand for them to do this.</p>\n<p>In the event that potential helpers are not convinced the problem is real, or aren't convinced to take the actions that would actually work, the person in need of help could easily waste 100 hours or more with nothing to show for it. This will cause them to pass up other opportunities and possibly make their situation far worse due to things like opportunity costs and burnout.</p>\n<p><strong>Solution: well-informed advocates.</strong></p>\n<p>For this reason, people who are experiencing a problem need an <em>advocate</em>. The advocate can take on the burden of evaluating solution ideas and advocating in favor of a particular solution.</p>\n<p>Given that it often requires a huge amount of information to predict which solution ideas will work and which solution ideas will fail, it is probably the case that an advocate needs to be well-informed about the type of problem involved, or at least knows what it is like to go through some sort of difficult time due to past experience.</p>\n", "parentCommentId": null, "user": {"username": "Kathy_Forth"}}, {"_id": "NG6Z97isC4YoEtXKW", "postedAt": "2018-01-29T00:42:10.155Z", "postId": "Ez9m9ejbeYTJZwiMa", "htmlBody": "<p>The main reason I'm not looking for a full-time EA job right now is because I don't have enough runway and financial security. I estimate that it will take around 2 years to accomplish the amount of financial security and runway I need. If you accomplish building a safety net, this might result in a surge of people going into EA jobs. I'm not sure how many people are building up runway right now, or how many hours of EA work you can grab by liberating them from that, but it could be a lot!</p>\n", "parentCommentId": null, "user": {"username": "Kathy_Forth"}}, {"_id": "WnXdj5zsxdW22XdbK", "postedAt": "2018-01-29T20:24:18.394Z", "postId": "Ez9m9ejbeYTJZwiMa", "htmlBody": "<p>Some thoughts on a few of these. I think that EA social safety nets already exist for many people, but it’s not formal in the way you laid out. It’s more based on specific connections and accomplishments. More or less each individual organization and donor has an implicit reputation system that is based on complex and organization/donor specific criteria. Some people will end up fitting multiple positive reputation systems which will give them more safety nets than someone who falls into a few or none. The system is of course dynamic so if you did fall into a category but then your reputation lowered (say by not doing anything that impressive over a long period of time) you could lose a safety net. Additional factors that affect how many safety nets you have in EA also relate to cost. It’s easy to provide a $10k safety net than a $100k safety net.  You can imagine why donors/orgs would generally like this system better instead of funding an EA who scores high enough on community agreed on criteria. They could directly fund/support/loan etc someone who directly does well on their criteria.</p>\n<p>To put this into a more practical perspective, I would expect that an EA with a strong enough reputation would be able to get support for a while doing entrepreneurship without getting insta-VCed. Likewise, the bar would be lower for a low/no interest loan. I think a case could be made that the system is ineffective or in-groupy and misses people who it should not. However, I think it’s worth acknowledging that informal systems like this definitely exist, so it’s more about the marginal cases who would not get supported by an informal system but would get supported by a formal one. For folks who want to do high risk projects but do not currently have informal connections/safety nets it seems worth considering just building up your reputation. This can be done with pretty low risk things like volunteering part time for an organization. </p>\n<p>I agree with the career trajectory points and know that some but definitely not all EAs take this into consideration when determining salary. </p>\n", "parentCommentId": null, "user": {"username": "Joey"}}, {"_id": "GPzxutDZo4LysZmRF", "postedAt": "2018-01-29T20:47:23.953Z", "postId": "Ez9m9ejbeYTJZwiMa", "htmlBody": "<p>One issue with this sort of thinking is in practice setting up lots of events sometimes doesn't lead to people becoming this close. Some local communities for effective altruism have community members being roommates together, working at the same organizations, and doing all the social stuff. That waxes and wanes with how well organized it all is. Lots of EA community organizers will move from where they're from to another city, e.g., Berkeley, and basically on both ends switching the person who takes the role of de facto event organizer means organization will stagnate as someone else gets used to doing it all. That this apparently happens often means sustaining a space in which close friendships are likely to occur is hard. Doing it consistently over multiple years in hindsight appears hard. I don't know how good evidence there is for optimal methods in doing this. </p>\n", "parentCommentId": "Wri9azRZk6xM2bmAj", "user": {"username": "Evan_Gaensbauer"}}, {"_id": "aWxbQmu9zvnkZKexX", "postedAt": "2018-01-29T20:55:44.673Z", "postId": "Ez9m9ejbeYTJZwiMa", "htmlBody": "<p>This is a big part of why I find the 'EA is talent constrained not funding constrained' meme to be a bit silly. The obvious counter is to spend money learning how to convert money into talent. I haven't heard of anyone focusing on this problem as a core area, but if it's an ongoing bottleneck then it 'should' be scoring high on effective actions.</p>\n<p>There is a lot of outside view research on this that could be collected and analyzed.</p>\n", "parentCommentId": "NG6Z97isC4YoEtXKW", "user": {"username": "RomeoStevens"}}, {"_id": "sfiH7uhM2pSYZKSug", "postedAt": "2018-01-29T20:59:50.117Z", "postId": "Ez9m9ejbeYTJZwiMa", "htmlBody": "<p>Another framing of that solution: EA needs a full time counselor who works with EAs gratis. I expect that paying the salary of such a person would be +ROI.</p>\n", "parentCommentId": "aJTitXEkBxzCEhpBZ", "user": {"username": "RomeoStevens"}}, {"_id": "YR2M2tum57cEkq8v7", "postedAt": "2018-01-29T23:58:09.512Z", "postId": "Ez9m9ejbeYTJZwiMa", "htmlBody": "<p>Even if we had funds, the problem of who to fund is a hard one and perhaps it would be better spent simply hiring more staff for EA orgs? The best way to know that you can trust someone is to know them personally, but distributing funds in that manner creates concerns about favouritism, ect.</p>\n", "parentCommentId": "aWxbQmu9zvnkZKexX", "user": {"username": "casebash"}}, {"_id": "KQiiKZb4d8pDjEYTF", "postedAt": "2018-01-30T05:10:17.363Z", "postId": "Ez9m9ejbeYTJZwiMa", "htmlBody": "<p>I strongly disagree on the grounds that these sorts of generators are, while not fully general counterarguments, sufficiently general that I think they are partially responsible for EAs having a bias towards inaction. Also, trying more cheap experiments when money is <em>supposedly</em> not the bottleneck.</p>\n", "parentCommentId": "YR2M2tum57cEkq8v7", "user": {"username": "RomeoStevens"}}, {"_id": "7btLtzmM7KuKwGCo8", "postedAt": "2018-01-30T18:23:38.957Z", "postId": "Ez9m9ejbeYTJZwiMa", "htmlBody": "<p>Regarding potentially tax deductible items mentioned in section 5, usually accommodation or anything regarded as for personal use is not included. It would be regarded as payment in kind and therefore taxable (and also make the tax reporting more complicated!) This in the UK at least. E.g. <a href=\"https://www.gov.uk/expenses-and-benefits-accommodation/whats-exempt\">https://www.gov.uk/expenses-and-benefits-accommodation/whats-exempt</a></p>\n", "parentCommentId": null, "user": {"username": "Greg_Colbourn"}}, {"_id": "YLm4r6xjfdPr2iyrv", "postedAt": "2018-01-30T20:11:38.331Z", "postId": "Ez9m9ejbeYTJZwiMa", "htmlBody": "<p>I had a feeling that might be the case. That page still leaves some possible alternatives, though, eg this exemption:</p>\n<blockquote>\n<p>an employer is usually expected to provide accommodation for people doing that type of work (for example a manager living above a pub, or a vicar looking after a parish)</p>\n</blockquote>\n<p>It seems unlikely, but worth looking at whether developing a sufficient culture of EA orgs offering accommodation might suffice the 'usually expected' criterion.</p>\n<p>It also seems a bit vague about what would happen if the EA org actually owned the accommodation rather than reimbursing rent as an expense, or if a wealthy EA would-be donor did, and let employees (potentially of multiple EA orgs) stay in it for little or no money (and if so, in the latter case, whether 'wealthy would-be donor' could potentially be a conglomerate a la EA funds)</p>\n<p>There seems at least some precedent for this in the UK in that some schools and universities offer free accommodation to their staff, which don't seem to come under any of the exemptions listed on the page.</p>\n<p>Obviously other countries with an EA presence might have more/less flexibility around this sort of thing. But if you have an organisation giving accommodation to 10 employees in a major developed world city, it seems like you'd be saving (in the UK) 20% tax on something in the order of £800 per month per employee, ie about £7600 per year, which seems like a far better return than investing the money would get (not to mention, if it's offered as a benefit for the job, being essentially doubly invested - once on the tax savings, once on the normal value of owning a property).</p>\n<p>So while I'm far from confident that it would be ultimately workable, it seems like there would be high EV in an EA with tax law experience looking into it in each country with an EA org.</p>\n", "parentCommentId": "7btLtzmM7KuKwGCo8", "user": {"username": "Arepo"}}, {"_id": "LmuZYxL8TmqvgmWsG", "postedAt": "2018-01-30T20:37:05.122Z", "postId": "Ez9m9ejbeYTJZwiMa", "htmlBody": "<p>I pretty much agree with this - though I would add that you could also spend the money on just attracting existing talent. I doubt the Venn diagram of 'people who would plausibly be the best employee for any given EA job' and 'people who would seriously be interested in it given a relatively low EA wage' always forms a perfect circle.</p>\n", "parentCommentId": "aWxbQmu9zvnkZKexX", "user": {"username": "Arepo"}}, {"_id": "cxHcpQB4wFahoHGzX", "postedAt": "2018-01-30T20:56:41.887Z", "postId": "Ez9m9ejbeYTJZwiMa", "htmlBody": "<p>Something along these lines that I've been looking into is providing a cheap hotel for EAs to live in for free whilst they independently study/research/work on start-ups. More information in the following facebook group: <a href=\"https://www.facebook.com/groups/1624791014242988/\">https://www.facebook.com/groups/1624791014242988/</a> [EA Hotel, free accommodation and board for up to 2 years, Blackpool, UK] Hoping to post more detail here soon.</p>\n", "parentCommentId": null, "user": {"username": "Greg_Colbourn"}}, {"_id": "QnE4AeW8aCSPgpCDE", "postedAt": "2018-02-02T04:28:50.494Z", "postId": "Ez9m9ejbeYTJZwiMa", "htmlBody": "<p>Of the three Black Mirror episodes I've seen, this reminds me of Nosedive: <a href=\"https://youtu.be/YrpK90bHO2U\">https://youtu.be/YrpK90bHO2U</a></p>\n<p>I'm not saying such a program would succumb to such a weird state in our culture. Just a fun little aside. Regardless, I think if the <strong>EA insurance program</strong> happened, it would be awesome! That goes to say, there's a lot of different ideas in this article. I don't think our emerging movement is big enough...even for an insurance program. What do I know about starting an insurance firm? Nada.</p>\n<p>Although, I do not trust people solely concerned about AI safety ;)</p>\n", "parentCommentId": null, "user": {"username": "adamaero"}}, {"_id": "iSGfdPS8ovG4m6mdf", "postedAt": "2018-02-02T23:01:45.197Z", "postId": "Ez9m9ejbeYTJZwiMa", "htmlBody": "<p>Keep in mind such insurance can happen at pretty much any scale - per Joey's description (above) of richer EAs just providing some support for poorer friends (even if the poorer friends are actually quite wealthy and E2G), for organisations supporting their employees, donors supporting their organisations (in the sense of giving them licence to take risks of financial loss that have positive EV), or EA collectives (such as the EA funds) backing any type of smaller entity.</p>\n", "parentCommentId": "QnE4AeW8aCSPgpCDE", "user": {"username": "Arepo"}}, {"_id": "y9cNsMCMAtRHKT79L", "postedAt": "2018-02-09T16:40:45.660Z", "postId": "Ez9m9ejbeYTJZwiMa", "htmlBody": "<p>I would be interested in funding this.</p>\n", "parentCommentId": "sfiH7uhM2pSYZKSug", "user": {"username": "BenMillwood"}}, {"_id": "Y2pjhDetE3N7XQNEN", "postedAt": "2018-02-10T08:29:16.504Z", "postId": "Ez9m9ejbeYTJZwiMa", "htmlBody": "<blockquote>\n<p>The obvious counter is to spend money learning how to convert money into talent. I haven't heard of anyone focusing on this problem as a core area, but if it's an ongoing bottleneck then it 'should' be scoring high on effective actions.</p>\n</blockquote>\n<p>This is what many of the core organisations are focused on :) You could see it as 80k's whole purpose. It's also why CEA is doing things like EA Grants, and Open Phil is doing the AI Fellowship.</p>\n<p>It's also a central internal challenge for any org that has funding and is trying to scale. But it's not easy to solve:\n<a href=\"https://blog.givewell.org/2013/08/29/we-cant-simply-buy-capacity/\">https://blog.givewell.org/2013/08/29/we-cant-simply-buy-capacity/</a></p>\n", "parentCommentId": "aWxbQmu9zvnkZKexX", "user": {"username": "Benjamin_Todd"}}, {"_id": "2X3srMvivoj4CoDot", "postedAt": "2018-02-10T16:11:34.597Z", "postId": "Ez9m9ejbeYTJZwiMa", "htmlBody": "<p>Is 80k trying to figure out how to interview the very best recruiters and do some judgmental bootstrapping?</p>\n", "parentCommentId": "Y2pjhDetE3N7XQNEN", "user": {"username": "RomeoStevens"}}, {"_id": "ScinJsi35oobrgRhE", "postedAt": "2018-02-14T15:37:45.213Z", "postId": "Ez9m9ejbeYTJZwiMa", "htmlBody": "<p>I'm interpreting what your saying as one going without insurance, and having an arrangement with a much wealthier individual (friend) to cover them in case of an accident or medical procedure. If so, I believe that's ineffective altruism--even if the benefactor is E2G--and too idealistic.</p>\n<p>Now, I assume most university students have their parents pay for their insurance (or get it significantly reduced though a state or university program). And I assume most professionals E2G are working for a company with a health insurance plan. </p>\n<p>With that in mind, I think it wouldn't be worth it to start an EA insurance program. There wouldn't be enough people. And I don't believe the wealthier individuals would be inclined to doll out routine medical tests and high cost surgery to the less wealthy participants just because they claim to be EA. </p>\n<p>I am speaking as someone who does not have an EA meetup/club nearby. I assume you're talking as if one does have comfy surroundings and support of nearby EAs (read: close EA friends).</p>\n<p>Lastly, if I became a high-payed CEO or whatever, I wouldn't be supporting friends in place of them having an insurance program. To assume that other EAs would is unrealistic. Why do their wealthy lives matter more than someone else's in a different place? Each dollar of benevolence towards such a friend is a dollar not going to help someone at the other end. Money is mutually exclusive. </p>\n", "parentCommentId": "iSGfdPS8ovG4m6mdf", "user": {"username": "adamaero"}}, {"_id": "GAgjmxNzhgtNBDkPa", "postedAt": "2018-02-16T09:15:42.820Z", "postId": "Ez9m9ejbeYTJZwiMa", "htmlBody": "<p>Have you got any examples of schools and universities offering free accommodation to staff? I've only heard of subsidised accommodation, and here - <a href=\"https://www.citizensadvice.org.uk/debt-and-money/tax/what-is-taxable-income/tax-on-benefits-in-kind/\">https://www.citizensadvice.org.uk/debt-and-money/tax/what-is-taxable-income/tax-on-benefits-in-kind/</a> - it says that the difference between the rent paid and market rate is taxable.</p>\n", "parentCommentId": "YLm4r6xjfdPr2iyrv", "user": {"username": "Greg_Colbourn"}}, {"_id": "JebL9kd68vSGcLvmZ", "postedAt": "2018-06-04T21:11:31.902Z", "postId": "Ez9m9ejbeYTJZwiMa", "htmlBody": "<p>Project is now active; I've written up the details here: <a href=\"http://effective-altruism.com/ea/1pc/ea_hotel_with_free_accommodation_and_board_for/\">http://effective-altruism.com/ea/1pc/ea_hotel_with_free_accommodation_and_board_for/</a></p>\n", "parentCommentId": "cxHcpQB4wFahoHGzX", "user": {"username": "Greg_Colbourn"}}]