[{"_id": "SjfpJAyfmMKeCLvPa", "postedAt": "2024-03-21T07:12:17.387Z", "postId": "EZennyFKLAZccDg36", "htmlBody": "<p>I am so grateful to Moskovitz and Tuna for making these donations.</p>\n<p>This coming November is — <em>technically</em>— a US election. That being said, if Trump were to win, it would lead to worsened security and immense suffering nationally and internationally. The US cannot let Trump become President and must do everything possible to prevent this from happening (barring illegal or unethical actions).</p>\n<p>Supporting Biden by ensuring he gets the votes he needs seems like the only viable option.</p>\n<p>What organizations/ who is working on this, either in or outside of EA?</p>\n<p>This election is absolutely critical.</p>\n<ul>\n<li>please forgive me in advance for not explaining my rationale fully; I do not currently have access to clean internet network or computer so am typing on my phone.</li>\n</ul>\n", "parentCommentId": null, "user": {"username": "more better "}}, {"_id": "NLT5fcH6uc5qicnRL", "postedAt": "2024-03-21T10:50:57.818Z", "postId": "EZennyFKLAZccDg36", "htmlBody": "<p>I simply cannot understand how some people considers the 2024 a \"normal\" election.&nbsp;</p><p><a href=\"https://forum.effectivealtruism.org/posts/ekM9jQqXq8D8qa2fP/united-states-2024-presidential-election-so-help-you-god\">https://forum.effectivealtruism.org/posts/ekM9jQqXq8D8qa2fP/united-states-2024-presidential-election-so-help-you-god</a></p>", "parentCommentId": "SjfpJAyfmMKeCLvPa", "user": {"username": "Arturo Macias"}}, {"_id": "CmwCAAj5yvQFTLsyd", "postedAt": "2024-03-21T17:54:33.639Z", "postId": "EZennyFKLAZccDg36", "htmlBody": "<p>Can you all help me understand why this is getting downvoted? At the moment the comment’s karma is -2, though 6 people have agreed and 3 have disagreed.</p>\n<p>Is the downvoting likely occurring because:</p>\n<p>A) I shouldn’t have written this as a response to the above post.</p>\n<p>B) I did not provide sufficient rationale.</p>\n<p>C) You prefer Trump over Biden.</p>\n<p>D) You don’t believe electing Trump would threaten national and international security / increase cumulative suffering.</p>\n<p>E) You believe that voting for a write in candidate or third party has a real chance at being successful.</p>\n<p>F) Something else (I’d be grateful if you specify).</p>\n<p>Thanks for the feedback.</p>\n", "parentCommentId": "SjfpJAyfmMKeCLvPa", "user": {"username": "more better "}}, {"_id": "Zq8cxseQN8HnznhjQ", "postedAt": "2024-03-21T17:59:59.437Z", "postId": "EZennyFKLAZccDg36", "htmlBody": "<p>Thanks for sharing. I agree that this election is atypical.</p>\n", "parentCommentId": "NLT5fcH6uc5qicnRL", "user": {"username": "more better "}}, {"_id": "gixhirsjfSNn78RLE", "postedAt": "2024-03-21T18:51:39.060Z", "postId": "EZennyFKLAZccDg36", "htmlBody": "<p>I didn’t vote, but I’d guess that people are trying to discourage politicisation on the forum?</p>\n", "parentCommentId": "CmwCAAj5yvQFTLsyd", "user": {"username": "bec_hawk"}}, {"_id": "yTzLLApNbzJYCJazC", "postedAt": "2024-03-21T19:25:59.794Z", "postId": "EZennyFKLAZccDg36", "htmlBody": "<p>Interesting, thanks for sharing!</p>\n<p>I can see how that may be the case and I appreciate your feedback. It made me think.</p>\n<p>I believe there can be value in keeping a space politically neutral, but that there are circumstances that warrant exceptions and that this is one such case. If Trump wins, I believe that moral progress will unravel and several cause areas will be rendered hopeless.</p>\n<p>If there had been a forum in existence before WW2, I wonder if posts expressing concerns about Hitler or inquiring about efforts to counter actions of Nazis would have been downvoted. I certainly hope not.</p>\n", "parentCommentId": "gixhirsjfSNn78RLE", "user": {"username": "more better "}}, {"_id": "KKbqef3fjQiWRL8PP", "postedAt": "2024-03-21T19:57:39.521Z", "postId": "EZennyFKLAZccDg36", "htmlBody": "<p>This post captures some of my feelings for why I don't think we should make exceptions for US elections:&nbsp;</p><p><a href=\"https://www.benlandautaylor.com/p/the-four-year-locusts\">https://www.benlandautaylor.com/p/the-four-year-locusts</a>&nbsp;</p><p>See also:&nbsp;</p><p><a href=\"https://www.lesswrong.com/posts/9weLK2AJ9JEt2Tt8f/politics-is-the-mind-killer\">https://www.lesswrong.com/posts/9weLK2AJ9JEt2Tt8f/politics-is-the-mind-killer</a>&nbsp;</p>", "parentCommentId": "yTzLLApNbzJYCJazC", "user": {"username": "Habryka"}}, {"_id": "ByE8FRS3fokvwgLve", "postedAt": "2024-03-21T20:53:54.444Z", "postId": "EZennyFKLAZccDg36", "htmlBody": "<p>Thanks for sharing:</p>\n<p>Curious as to your take on this: If this forum existed prior to WW2 and there was a post suggesting that it was imperative to prevent Hitler from gaining power, would you have felt that post should not have been made?</p>\n<p>I do agree that exceptions can be a slippery slope, and certainly don’t think all US elections warrant exception. This one has potential to accelerate harm globally and is occurring in one of the most powerful countries in the world. US citizens can influence its outcome. This election will have global ramifications spanning generations. If some do not feel this is a moral imperative, that’s okay, but I am not sure why downvoting my post would feel like the appropriate course of action.</p>\n<p>Sorry for not engaging with the links you posted. I have had cybersecurity issues and have been advised to be more careful about clicking on unfamiliar links and to avoid certain forums. This is a bummer, as I really enjoyed some of that content .</p>\n", "parentCommentId": "KKbqef3fjQiWRL8PP", "user": {"username": "more better "}}, {"_id": "zTCpaEZY9YySrZEFR", "postedAt": "2024-03-21T21:50:42.924Z", "postId": "EZennyFKLAZccDg36", "htmlBody": "<blockquote><p>I have had cybersecurity issues and have been advised to be more careful about clicking on unfamiliar links and to avoid certain forums.&nbsp;</p></blockquote><p>Someone told you not to go on lesswrong for cybersecurity reasons?</p>", "parentCommentId": "ByE8FRS3fokvwgLve", "user": {"username": "Larks"}}, {"_id": "SL7zyhKZAWodi4jmK", "postedAt": "2024-03-21T22:03:34.390Z", "postId": "EZennyFKLAZccDg36", "htmlBody": "<p>For people not clicking through the first link, I thought <a href=\"https://www.youtube.com/watch?v=72KhiU96YXM\">this youtube video</a> was pretty impressive: almost a hundred years of leading politicians claiming that each election is the or one of the most important elections of our lives / the century / all time.</p>", "parentCommentId": "KKbqef3fjQiWRL8PP", "user": {"username": "Larks"}}, {"_id": "5PHkzzEDpQfmHFjmF", "postedAt": "2024-03-21T22:48:13.738Z", "postId": "EZennyFKLAZccDg36", "htmlBody": "<p>Wow, this went from a karma level 8 to a 1 in under an hour.</p>\n<p>I typically view this forum as a place where civil discourse ought to be, and often is, encouraged. This downvoting feels a bit like a unique form of censorship.</p>\n<p>I would love to understand how people are thinking about this.</p>\n", "parentCommentId": "ByE8FRS3fokvwgLve", "user": {"username": "more better "}}, {"_id": "9KwNXHMLBEmaJhn6y", "postedAt": "2024-03-21T22:51:16.056Z", "postId": "EZennyFKLAZccDg36", "htmlBody": "<p>That was my interpretation, though the specific forums in question were not named directly so I cannot be certain.</p>\n", "parentCommentId": "zTCpaEZY9YySrZEFR", "user": {"username": "more better "}}, {"_id": "4SfFdddSw3hdyqFNG", "postedAt": "2024-03-21T23:02:11.898Z", "postId": "EZennyFKLAZccDg36", "htmlBody": "<p>Thanks for sharing a summary of the content in addition to the link! Super helpful as I do not have streaming right now and am trying to avoid hyperlinks.</p>\n<p>It makes sense that politicians would say this kind of thing leading up to an election. However, the futures that these 2 candidates are proposing are wildly different. I know that I am not alone (neither here on the forum nor IRL)  in believing that this election will be a tipping point and will have implications that ripple far beyond just the US.</p>\n", "parentCommentId": "SL7zyhKZAWodi4jmK", "user": {"username": "more better "}}, {"_id": "BGvSPAwsfGq9tc23D", "postedAt": "2024-03-22T20:10:24.460Z", "postId": "EZennyFKLAZccDg36", "htmlBody": "<p>Good illustration!  I'd be curious how many people saying 2024 is the most important will in 2028 think 2024 was more important?</p>\n<p>I did like the 1:32 bit where Obama says \"this is... certainly the most important election in <em>my</em> lifetime\".  Which I take to be him making fun of this trope.</p>\n", "parentCommentId": "SL7zyhKZAWodi4jmK", "user": {"username": "Jeff_Kaufman"}}, {"_id": "sbpvu2fzjkW2Soezn", "postedAt": "2024-03-23T06:11:13.039Z", "postId": "EZennyFKLAZccDg36", "htmlBody": "<p>Fair point.</p>\n<p>OTOH, If Trump wins or “wins” in 2024, I’m honestly not sure a legitimate election would be possible in 2028, in which case 2024 would have been the most important.</p>\n<p>Hoping 2024 is legitimate. There are justified concerns that Trump will not accept defeat (assuming legitimate defeat) and will stop at nothing to regain power. He is a very dangerous man.</p>\n", "parentCommentId": "BGvSPAwsfGq9tc23D", "user": {"username": "more better "}}]