[{"_id": "WRsGqFfWZZisgEG9H", "postedAt": "2024-01-10T10:37:40.924Z", "postId": "EZZveBtxoZJjSighP", "htmlBody": "<p>Perhaps I missed it in the article, but another challenge to potentially overcome is the seeming reluctance of many decisionmakers to take seriously aerosolized transmission of pathogens. I can probably dig up more and better sources for this issue but <a href=\"https://www.nature.com/articles/d41586-022-00925-7\">here </a>is one I came across by quickly Googling. Here, in Sweden, I am not sure the authorities have yet communicated that one, if not the primary transmission route for COVID, is via aerosols. This barrier might make widespread adoption of UV tech even less likely to succeed.&nbsp;<br><br>Great post BTW!</p>", "parentCommentId": null, "user": {"username": "Ulrik Horn"}}, {"_id": "3xwXTAciv8So3JaS7", "postedAt": "2024-01-10T11:43:43.592Z", "postId": "EZZveBtxoZJjSighP", "htmlBody": "<p>Hi Ulrik, thanks for this comment! Very much agreed on the communications failures around aerosolized transmission. I wonder how much the mechanics of transmission would enter into a policy discussion around GUV (rather than a simplified “These lights can help suppress outbreaks.”)</p>\n", "parentCommentId": "WRsGqFfWZZisgEG9H", "user": {"username": "christian.r"}}, {"_id": "GHsBZBE7o72ztpkJj", "postedAt": "2024-01-10T14:39:41.399Z", "postId": "EZZveBtxoZJjSighP", "htmlBody": "<p><strong>Executive summary</strong>: The report examines germicidal ultraviolet (GUV) light, finding it is a promising intervention for improving indoor biological air quality and reducing pathogen transmission including for future catastrophic risks. Uncertainty remains over the ultimate safety, cost, and real-world effectiveness of different GUV systems and wavelengths of UV light. Far-UVC in particular may have large upside but also risks, suggesting a \"wavelength-agnostic\" approach focused on catalyzing safety studies, market incentives, and large-scale government funded research could maximize impact.<br><br><strong>Key points</strong>:</p><ol><li>GUV can suppress airborne pathogen spread by 30-75%, a historically neglected priority despite heavy disease burden. It offers unique biosecurity benefits as a passive, pathogen-agnostic defense.</li><li>Key forms are far-UVC full room systems, conventional UV upper room systems, and in-duct systems. Each has tradeoffs in safety, cost, installability. Overall potential is high but uncertainties on real-world effectiveness remain.</li><li>Evidence suggests far-UVC is likely safe, but studies are needed on subgroups, eye effects, ozone risks, and indoor air pollution created. Its cost is dropping but still high compared to proven conventional UV.</li><li>Funders should take a \"wavelength-agnostic\" approach focused on safety studies, market incentives, public advocacy for government research on transmission reduction across systems. Rapid deployment without public confidence risks backlash.</li><li>Prioritizing high-income countries first allows leveraging resources and expertise for trials and development. Later focus should ensure equitable global access.</li><li>Impact depends on indoor spaces mapped, air movement dynamics understood. Variable systems expected for different users. Research directions include efficacy studies, safety trials, model validation.</li></ol><p>&nbsp;</p><p><br><i>This comment was auto-generated by the EA Forum Team. Feel free to point out issues with this summary by replying to the comment, and</i><a href=\"https://forum.effectivealtruism.org/contact\"><i>&nbsp;<u>contact us</u></i></a><i> if you have feedback.</i></p>", "parentCommentId": null, "user": {"username": "SummaryBot"}}, {"_id": "9ZMtaDDzpeZNAmsmr", "postedAt": "2024-01-11T02:13:01.676Z", "postId": "EZZveBtxoZJjSighP", "htmlBody": "<p>Low-hanging fruit for someone interested in the public communications side... make a Wikipedia page for far-UVC! One day I'll get to this myself...</p>", "parentCommentId": null, "user": {"username": "ljusten"}}, {"_id": "FAMo7wbfRubpy5df8", "postedAt": "2024-01-11T19:02:27.928Z", "postId": "EZZveBtxoZJjSighP", "htmlBody": "<p>We discussed this, but it might make more sense to add/expand the section of the main GUV article: <a href=\"https://en.wikipedia.org/wiki/Ultraviolet_germicidal_irradiation\">https://en.wikipedia.org/wiki/Ultraviolet_germicidal_irradiation</a> Maybe opening a discussion in wikitalk about whether it merits its own page, too?</p>", "parentCommentId": "9ZMtaDDzpeZNAmsmr", "user": {"username": "vbelenky"}}, {"_id": "7ARg9HxynqrmpEDHe", "postedAt": "2024-01-12T20:00:42.481Z", "postId": "EZZveBtxoZJjSighP", "htmlBody": "<p>I support both ideas - adding/expanding the UVGI page and starting discussion of a new far-UVC page on wikitalk. There is already one mention of starting a separate page on wikitalk.&nbsp;</p><p>I think it's warranted given the distinct biophysical effects of this spectral band as well as the development of far-UVC as a commercial technology and area of broader interest. &nbsp;</p>", "parentCommentId": "FAMo7wbfRubpy5df8", "user": {"username": "ljusten"}}, {"_id": "Mwed754D954usfuEY", "postedAt": "2024-01-13T22:33:54.889Z", "postId": "EZZveBtxoZJjSighP", "htmlBody": "<p>Great to see your thinking laid out this way, and of course thank you for your interest in our (1Day Sooner/Rethink Priorities) report!&nbsp;</p><p>It was useful to see the discussion of possible overhype from the funding side of the field, since I don't have insight into funding decisions. On the other hand, there are reasons funders might want to focus attention on far-UV, without disregarding the usefulness of conventional-wavelength GUV: since far-UV requires more research than conventional-wavelength systems at this time, but might ultimately be easier to install, the far-UV research payoff could be very large for increasing adoption of GUV in general. I expect that conventional-wavelength systems would benefit from investment into R&amp;D for easier installation, but that's not obviously a place for philanthropic funding. The safety studies necessary for far-UV are too expensive for the current market size, so if far-UV research does not get more philanthropic funding than conventional-wavelength GUV, far-UV safety studies might not be performed in a rigorous way. However, I would agree that funders should be wavelength-agnostic if they are directly funding installations.</p><p>Because of the challenges facing comprehensive far-UV analysis, I was surprised that you didn't think it would be very impactful for philanthropists to fund studies--broadly speaking, I agree about the lack of expertise, but this is a small enough field that the informed voices are fairly well-known within the field and I think interested philanthropic bodies would be able to consult those informed opinions. Again, I don't have insight into the funding side of the process, so that may be optimistic. I am certainly biased, since 1Day Sooner does regularly apply/advocate for philanthropic funding for technical research! On the reverse side, personal experience has left me pessimistic about policy advocacy for GUV research, but your report has swayed me somewhat to at least consider the fact that there is not a <i>concerted</i>, heavyweight policy advocacy effort in this area. &nbsp;&nbsp;</p><p>I appreciated the argument on capturing the bulk of the risk by later deployment; it was a very helpful presentation of the case. I do think that there is a learning-by-doing element to GUV rollout (for either type of GUV), where rollout and analysis in select environments is necessary for better understanding broader GUV use cases. Identifying those environments is an element of the current 1Day Sooner IAQ project. I also would love to see the cost of GUV installation fall sooner rather than later in order to address endemic disease burden worldwide, e.g. via widespread installation in TB clinics. (I'm fully aware that this use case might remain impractical, but it's nice to consider the potential to address global health! Of course if a funder is <i>specifically</i> trying to fight TB, I’d still recommend sinking their money into vaccine research or treatment.)</p><p>Finally, this report was extremely helpful for a current 1Day Sooner project! We're working on a report to assess the potential for market shaping techniques to accelerate the adoption of indoor air cleaning technology. This post, and writing up this comment, really helped clarify some of my thinking about the possible directions we'd been tossing around, so a huge thank you for that!&nbsp;</p>", "parentCommentId": null, "user": {"username": "Gavriel Kleinwaks"}}, {"_id": "Nxs2usMQ9GY3qZEFc", "postedAt": "2024-01-17T03:00:28.401Z", "postId": "EZZveBtxoZJjSighP", "htmlBody": "<p>This was very helpful! I found the diagrams particularly useful. Visible lighting design for rooms has a similar problem of uniform illumination, but it is mitigated by the fact that there is significant reflection of the light, which I presume does not apply for far UVC.&nbsp;<br>Has there been any work on planning to relocate existing UV systems to the most critical tasks, if an extreme pandemic hit soon, of making more super PPE/UV systems?</p><blockquote><p>One unpublished study by a Russian academic and a CDC researcher allegedly estimated that the cost of 1 ACH by ventilation is about $135.91 USD and by GUV is about $14.44 USD.<a href=\"https://forum.effectivealtruism.org/posts/EZZveBtxoZJjSighP/are-far-uvc-interventions-overhyped-founders-pledge#fnk7ho9b7wwep\"><sup><u>[131]</u></sup></a> 1DaySooner and Rethink Priorities have estimates that \"The price of current systems is currently too high for at-scale deployment, though there are reasons to think the price can be lowered significantly;\" they estimate that the cost of upgrading all U.S. buildings for improved indoor air quality would be about $120 billion - $420 billion.<a href=\"https://forum.effectivealtruism.org/posts/EZZveBtxoZJjSighP/are-far-uvc-interventions-overhyped-founders-pledge#fns57h5bkeg9\"><sup><u>[132]</u></sup></a>&nbsp;</p></blockquote><p><br>The units do not appear to be complete - cost of 1 ACH for how big of space? Footnote 131 requires a password. Footnote 132 says “all public buildings in the US” not “all US buildings.” If public building is defined as <a href=\"https://www.law.cornell.edu/definitions/uscode.php?width=840&amp;height=800&amp;iframe=true&amp;def_id=40-USC-722344309-548020543&amp;term_occur=2&amp;term_src=#:~:text=%E2%80%94%20The%20term%20%E2%80%9Cpublic%20building%E2%80%9D,)%20includes%E2%80%94%20(i)%20federal\">this</a>, I would guess that would control less than 10% of transmission in the US.</p><p><br>&nbsp;</p>", "parentCommentId": null, "user": {"username": "Denkenberger"}}]