[{"_id": "SGJBxGCfLmMftjnmw", "postedAt": "2023-07-08T06:45:08.207Z", "postId": "F2MfbmRAiMx2PDhaD", "htmlBody": "<p>Thanks for sharing. I think it was brave and I appreciated getting to read this. I'm sorry you've had to go through this and am glad to hear you're feeling optimistic.</p>\n", "parentCommentId": null, "user": {"username": "HowieL"}}, {"_id": "SamEWNtGEofZqgDge", "postedAt": "2023-07-08T11:49:30.586Z", "postId": "F2MfbmRAiMx2PDhaD", "htmlBody": "<p>❤️</p>\n", "parentCommentId": null, "user": {"username": "jpaddison"}}, {"_id": "i9ASKdxWgHPeXs3sS", "postedAt": "2023-07-08T16:52:22.195Z", "postId": "F2MfbmRAiMx2PDhaD", "htmlBody": "<p>Thanks, I really appreciate it</p>\n", "parentCommentId": "SGJBxGCfLmMftjnmw", "user": {"username": "Devin Kalish"}}, {"_id": "2LnkACbQDfzD65icd", "postedAt": "2023-07-08T16:52:30.584Z", "postId": "F2MfbmRAiMx2PDhaD", "htmlBody": "<p>❤️</p>\n", "parentCommentId": "SamEWNtGEofZqgDge", "user": {"username": "Devin Kalish"}}, {"_id": "abg9jJWDDsSGShq6T", "postedAt": "2023-07-08T21:50:27.657Z", "postId": "F2MfbmRAiMx2PDhaD", "htmlBody": "<p>Thanks for sharing. It’s interesting to hear about this from the perspective of someone in this community. I’d be happy to see more posts like this on EA forum.</p>\n<p>This was the most interesting part to me:</p>\n<blockquote>\n<p>It wasn’t some meaningful part of the larger story of my life, replete with a buried darkness in my soul coming to the forefront, or a unique challenge driven by terrible circumstances. I have had to push back in therapy repeatedly on these subtler and more interesting attempts to make something of the event. The truth is sober reflection makes it all look like little more than a meaningless tragedy.</p>\n</blockquote>\n<p>This is kind of relatable. My own past abuse — and the effects it has had on me — both do not fit existing narratives very well at all. People (including therapists) don’t seem to get it, and that makes it harder to figure things out and make progress.</p>\n", "parentCommentId": null, "user": {"username": "ao"}}, {"_id": "uijXttkZ6T9eM7Gqp", "postedAt": "2023-07-09T02:16:31.374Z", "postId": "F2MfbmRAiMx2PDhaD", "htmlBody": "<p>I agree, I think there's some holdover influence from psychoanalysis where the basic intuition seems to be that there's always some deeper explanation for mental illnesses relating to underlying complexes or misdevelopment or something, and that therapy is finding and fixing those, but I don't think this was ever a sensible idea to default to. Sometimes the reason someone is an alcoholic is as dumb as \"I was a little bored at the wrong time to be a little bored, and alcohol is a socially normalized way to address this\".</p>\n", "parentCommentId": "abg9jJWDDsSGShq6T", "user": {"username": "Devin Kalish"}}, {"_id": "oBvxNhsgYs9nrCL54", "postedAt": "2023-07-09T19:23:44.836Z", "postId": "F2MfbmRAiMx2PDhaD", "htmlBody": "<p>Thanks for writing this, it was genuinely informative and interesting. I thought the description of urges as intrusive thoughts was especially helpful for developing empathy for addiction, and I think provides a useful contrast to the picture of irresistible urges, which I think dominates the common view. Hope the trajectory continues well, and kudos for sharing.</p>", "parentCommentId": null, "user": {"username": "paul_dfr"}}, {"_id": "yTp4C95AebcpbSubs", "postedAt": "2023-07-09T23:31:18.361Z", "postId": "F2MfbmRAiMx2PDhaD", "htmlBody": "<p>If I had a bit of backup I think I could organize a virtual group for EAs in addiction recovery. I have organizing experience and am currently 43 days clean/sober.</p>\n", "parentCommentId": null, "user": {"username": "IsabelHasse"}}, {"_id": "9oYNLLeXf5ekJNpf6", "postedAt": "2023-07-10T16:34:44.393Z", "postId": "F2MfbmRAiMx2PDhaD", "htmlBody": "<p>That would be great! What sort of backup would you need?</p>\n", "parentCommentId": "yTp4C95AebcpbSubs", "user": {"username": "Devin Kalish"}}, {"_id": "koEWA5wpxZdMZMxzA", "postedAt": "2023-07-10T16:40:22.850Z", "postId": "F2MfbmRAiMx2PDhaD", "htmlBody": "<p>There was also a commenter on my first, anonymous post who expressed interest in something like this I could try reaching out to.</p>\n", "parentCommentId": "yTp4C95AebcpbSubs", "user": {"username": "Devin Kalish"}}, {"_id": "yaywAL9wC8Dfczjmk", "postedAt": "2023-07-11T16:06:12.469Z", "postId": "F2MfbmRAiMx2PDhaD", "htmlBody": "<p>I would be very interested in being involved as well!</p>", "parentCommentId": "yTp4C95AebcpbSubs", "user": {"username": "SamB"}}, {"_id": "yHddu33GQjyu8dM6g", "postedAt": "2023-07-11T16:06:35.743Z", "postId": "F2MfbmRAiMx2PDhaD", "htmlBody": "<p>I would be very interested in being involved as well!</p>", "parentCommentId": "yTp4C95AebcpbSubs", "user": {"username": "SamB"}}, {"_id": "JS8BYSorRCTF3RYaF", "postedAt": "2023-07-11T17:49:04.219Z", "postId": "F2MfbmRAiMx2PDhaD", "htmlBody": "<p>Now that a few people have expressed interest, I have decided to create a chat so that we can coordinate a bit and work out possible details. For now it's just a discord server here:\n<a href=\"https://discord.gg/DwMw9C6p\">https://discord.gg/DwMw9C6p</a>\nIf Discord doesn't work well for anyone and they have a better idea I would welcome it, I also have little experience with moderating or running a server, so if anyone else wants to takeover please let me know. I've just set this up as something to get started with for now. Thanks for your interest!</p>\n", "parentCommentId": "yTp4C95AebcpbSubs", "user": {"username": "Devin Kalish"}}, {"_id": "vch9uE7ddz6Xd5pj6", "postedAt": "2023-07-11T17:51:50.847Z", "postId": "F2MfbmRAiMx2PDhaD", "htmlBody": "<p>Props for writing candidly about your experience here. Sending you good wishes on your journey!<br><br>For anybody interested in setting up a discussion group for EAs in recovery: here's some <a href=\"https://docs.google.com/document/d/1p8xIN2oFDiPJy-y0_M3mSM56z0Kx5v3QzGCL_CI_fJ0/edit\">advice</a> starting/running online discussion groups I put together a while ago. (Mostly about FB groups but mostly applicable to other platforms.)<br>The <a href=\"https://www.facebook.com/groups/ea.peer.support\">EA Peer Support group</a> is another existing space.</p>", "parentCommentId": null, "user": {"username": "Julia_Wise"}}, {"_id": "Af8yuKqbhwLsA8WgE", "postedAt": "2023-07-11T18:09:52.540Z", "postId": "F2MfbmRAiMx2PDhaD", "htmlBody": "<p>Thanks, I'll have to think over these. I just set up a chat to get things started, but truthfully I am very nervous about running/moderating a group chat like this. I'm not very tech savvy and don't even have social media. I've run a club and a fellowship before, but this was all in-person and I think involves very different skills. I'm kind of hoping the current set up will prove temporary and someone with more experience eventually gets involved if this project grows into something substantial. I'll try to take cues from this document as things develop in the meantime.</p>\n", "parentCommentId": "vch9uE7ddz6Xd5pj6", "user": {"username": "Devin Kalish"}}]