[{"_id": "4kZ4AChaLiqiCTSvS", "postedAt": "2022-12-08T09:17:24.157Z", "postId": "F2YfRtMvHfRJibwkj", "htmlBody": "<p><strong>Post summary</strong> (feel free to suggest edits!):<br>Some suffering is bad enough that non-existence is preferable. The lock-in of uncompassionate systems (eg. through AI or AI-assisted governments) could cause mass suffering in the future.<br><br><a href=\"https://www.preventsuffering.org/\"><u>OPIS</u></a> (Organisation for the Prevention of Intense Suffering) has until now worked on projects to help ensure that people in severe pain can get access to effective medications. In future, they plan to “address the very principles of governance, ensure that all significant causes of intense suffering receive adequate attention, and promote strategies to prevent locked-in totalitarianism”. One concrete project within this is a full length film to inspire people with this vision and lay out actionable steps. They’re looking for support in the form of donations and / or time.<br><br>(If you'd like to see more summaries of top EA and LW forum posts, check out the <a href=\"https://forum.effectivealtruism.org/s/W4fhpuN26naxGCBbN\">Weekly Summaries</a> series.)</p>", "parentCommentId": null, "user": {"username": "GreyArea"}}, {"_id": "b88XgXzF2Chjom4Pe", "postedAt": "2023-01-03T01:51:27.567Z", "postId": "F2YfRtMvHfRJibwkj", "htmlBody": "<p>What do you mean by \"compassionate\"?</p>", "parentCommentId": null, "user": {"username": "tkwa"}}, {"_id": "tbu9xAAEc3BzdbKc4", "postedAt": "2023-01-03T07:58:00.726Z", "postId": "F2YfRtMvHfRJibwkj", "htmlBody": "<p>The definition I use is caring about suffering – others' and also one's own – and being motivated to prevent or alleviate it.</p>", "parentCommentId": "b88XgXzF2Chjom4Pe", "user": {"username": "jonleighton"}}, {"_id": "9rZuN8Yvrgr9uibzn", "postedAt": "2023-01-17T16:11:02.241Z", "postId": "F2YfRtMvHfRJibwkj", "htmlBody": "<p>Thanks Jon. I agree on all fronts. Looking forward to reading your book.</p><p>In addition to normalisation and any \"lock-in\" being based on sentiocentric, compassionate values would baking in a broadly naturalistic epistemology also be desirable?</p><p>I describe the Sentientism worldview as \"evidence, reason and compassion for all sentient beings\" in part because I don't think compassion alone is sufficient.</p>", "parentCommentId": null, "user": {"username": "JamieWoodhouse"}}, {"_id": "82qTLkzYyNtMThPAv", "postedAt": "2023-01-19T11:16:58.784Z", "postId": "F2YfRtMvHfRJibwkj", "htmlBody": "<p>Thanks, Jamie. Yes, I entirely agree, assuming of course that this epistemology encompasses subjective experience. In other places I consistently refer to the combination of compassion and rationality as core values. In fact, one could argue that compassion is a consequence of rationality if one takes into account the content of all current and potential subjective experiences/mind states as &nbsp;the most relevant part of reality to act upon, and one also takes a metaphysically accurate view of personal identity. In this post I didn't focus on rationality because it is already a strong given within the EA community (although I dispute the rationality of some widely held principles), whereas concern for suffering is more variable.</p>", "parentCommentId": "9rZuN8Yvrgr9uibzn", "user": {"username": "jonleighton"}}]