[{"_id": "LY3FPAj8M8xzMhhhb", "postedAt": "2022-09-21T15:18:06.599Z", "postId": "F4DxPrfmnEtEwhPJu", "htmlBody": "<p>I appreciate the time and effort you've put into this, thank you! Also, I appreciate that right off the top you identify that this is an exercise, and a collection of thoughts.&nbsp;</p><p>I've worked in fundraising and philanthropy for over a decade, so I couldn't help read this through the lens of someone on the charity side seeking to better understand donor motivations and finding opportunities to improve fundraising operations and the donor experience.&nbsp;</p><p>Something I would challenge you on is to consider that for every level you've identified here, the lower limit is always $0. For EA'ers responsible for raising any amount of money from individuals, this is incredibly important to factor into planning and risk management. Giving is a voluntary act, donor motivations are incredibly complex, and human behaviour in small sample sizes is tough to predict before any data or giving history is established with an organization.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Brock W."}}, {"_id": "Ac7Jn6zMRrSbeqYip", "postedAt": "2022-09-22T15:14:25.453Z", "postId": "F4DxPrfmnEtEwhPJu", "htmlBody": "<p>Thanks! I think what you said is correct from the viewpoint of individual donees -- an individual donee isn't guaranteed to get all or most of the donation of a donee at a high level. Though especially in the EA community it's probably true that donors donating large sums of money in total will usually donate nontrivial sums per donee if they donate at all (for instance, a level 5 donor is unlikely to make donations of just $100 to things they deem as the most effective uses of money, because marginal value functions rarely cross that quickly). I don't have rigorous data to back this up and maybe I'm wrong about it.</p>\n", "parentCommentId": "LY3FPAj8M8xzMhhhb", "user": {"username": "vipulnaik"}}, {"_id": "GSkQ6mfKdntfdHuCZ", "postedAt": "2022-09-24T04:23:13.575Z", "postId": "F4DxPrfmnEtEwhPJu", "htmlBody": "<p>I don't fully understand your point - can you elaborate on it more? Do you mean that - until the donor transfers the money or signs a binding contract - it remains uncertain whether the donee <em>actually</em> receives money. The donee will have to plan with this risk?</p>\n<p>Counter question: if important, how can a <em>donor</em> redue this risk, in your opinion?</p>\n", "parentCommentId": "LY3FPAj8M8xzMhhhb", "user": {"username": "Imma Six"}}, {"_id": "fs3iaqTQBHxQK4H4D", "postedAt": "2022-09-24T04:23:14.446Z", "postId": "F4DxPrfmnEtEwhPJu", "htmlBody": "<p>I like this post.</p>\n<p>Question to fundraisers: what do you think of this? To what extent does this match your experience?</p>\n", "parentCommentId": null, "user": {"username": "Imma Six"}}, {"_id": "77HocnbfaoFh9sx3C", "postedAt": "2022-09-29T12:23:40.846Z", "postId": "F4DxPrfmnEtEwhPJu", "htmlBody": "<p>I think assuming a minimum donation amount presents as hubris. Donors always have the ability to give little or nothing, regardless of how much capacity they have to give is. Just because a donor <i>can</i> give $10 million does not mean that they are in any way obligated to give a minimum of $1 million.&nbsp;</p><p>In fundraising we have prospect researchers who are great at making informed estimates about a person or foundation's upper limit gift capacity. Other known gifts, company ownership, board positions, family history, real estate, etc. But, I don't know that I've ever seen a prospect profile that provides a minimum ask amount.&nbsp;</p><p>@vipulnaik points out at another point in this thread that a potential major donor fluent in EA theory is unlikely to give a trivial amount, like $100. That is certainly possible, and if you know for certain that a donor makes their giving decisions with an EA lens, then by all means go for it. But, if you find yourself in a situation with a generous and wealthy donor who isn't an EA'er that wants to give a substantial amount to your cause, just don't take for granted that they could walk away at any moment for any reason.&nbsp;</p><p>For your counter question, I'm not entirely sure what donor risk you're referring to. I think maybe you're referring to a risk that the money is lost in transit, embezzled, or misspent? In that case, donors should do due diligence into the organization's leadership (board and executive), review financials like the 501(c)3 or equivalents, insist on a gift agreement if we're talking large amounts tied to specific activities and timelines, etc. &nbsp;</p>", "parentCommentId": "GSkQ6mfKdntfdHuCZ", "user": {"username": "Brock W."}}]