[{"_id": "HnbHPn4foRAY89x5h", "postedAt": "2023-12-21T02:38:16.267Z", "postId": "F7qzoWhiCTK8KpuTM", "htmlBody": "<p>Thank you for writing and sharing this, Alix! I'm sorry that it was scary for you to post and I'm glad you did. You also linked to so many other useful readings I hadn't seen previously!</p><p>I'm wondering how these dynamics play out across different platforms and spaces—e.g. hiring processes for organizations with varying degrees of international staff vs. international online platforms like the Forum or EA Anywhere Slack vs. in-person events—and if there are better moderation mechanisms for acknowledging and accounting for language barriers across each. Online, for example, it's easy to list the languages you speak and some organizations list this on their staff pages (e.g. \"You can contact Alix in French and English.\"). Maybe this could be added to Forum profiles or EA Global Swapcard profiles.</p><p>I'm also wondering how we can better account for this as community builders, especially in places with many immigrants. We remind attendees at the start of most EA NYC events that everyone present has a different starting point and we all have something to learn and something to teach. We began doing this, in large part, to make sure newcomers who don't \"speak EA\" feel welcome. But there might be a benefit to also explicitly noting possible language barriers, given how deeply international and multicultural the community here is. This is also making me want to look into facilitation trainings specifically focused on these dynamics; I'm sure there are non-obvious things we could be doing better.</p>", "parentCommentId": null, "user": {"username": "Rockwell Schwartz"}}, {"_id": "mNoFfcz9n7uNdw8vc", "postedAt": "2023-12-21T08:11:47.687Z", "postId": "F7qzoWhiCTK8KpuTM", "htmlBody": "<p>Thanks Rocky!</p><p>Forum and Swapcard profiles including languages seem like a good idea!</p><p>I think it's an important conversation to have as community builders, as you said in places with many immigrants, <i>especially in places where the community is driven by native English speakers.</i> I'd be keen to discuss what it means for e.g. NYC vs Switzerland: 2 places with high levels of immigrants but different first languages. In Switzerland, we would all speak English at events, but it's not the first language for the vast majority of people, and I've experienced much less frustration in those contexts than at events where English is a mother tongue for most - and then maybe I'm blind to some other dynamics that impairs how welcoming we appear to certain people. What should each of us be more aware of so that we make it as welcoming as possible?</p><p>If you find relevant trainings, please share!</p><p>I like this \"everyone present has a different starting point and we all have something to learn and something to teach\", I'm gonna steal it :p</p><p>Side note regarding hiring, I feel there's also the tricky problem of behavior expectations and cultural bias e.g. during interviews, where your culture can be an obstacle (e.g. from my experience, US and UK people tend to be very friendly and cheerful even to strangers, which could be unconsciously expected of you during interviews, while in your own country it would not be expected of you) - a dynamic that I believe also plays an important role in gender diversity.</p>", "parentCommentId": "HnbHPn4foRAY89x5h", "user": {"username": "alix.pham"}}, {"_id": "Cq22uKZfGJr4qSpxC", "postedAt": "2023-12-21T12:52:24.495Z", "postId": "F7qzoWhiCTK8KpuTM", "htmlBody": "<p>Thanks for writing this, Alix!&nbsp;<br><br>I just wanted to add some data about two of your empirical claims about the prevalence of native English speakers in leadership positions:</p><blockquote><p>Native English speakers are overrepresented in EA’s thought leadership</p></blockquote><p>One very crude measure of this is to look at the attendees of the <a href=\"https://forum.effectivealtruism.org/posts/33o5jbe3WjPriGyAR/announcing-the-meta-coordination-forum-2023\">2023 coordination forum.&nbsp;</a><br>AFAICT, based on the LinkedIn profiles of the 31 attendees that are public: 22 are native English speakers, and 7 are not (two I am not sure about). Hence ~22% are non-native English speakers.</p><blockquote><p>The monopoly on funding does not facilitate this – my impression is that it is especially true in community building. Indeed, homogeneity in culture and ways of thinking might strengthen itself with grantmakers selecting projects and people who are closer to them [...]</p></blockquote><p>The three funders I looked up are OP, CEA, and EA Funds. The percentage of non-native English speakers is slightly higher than the percentage attending the coordination forum (7 out of 23 people are non-native English speakers, ~30%):&nbsp;</p><ol><li>On the <a href=\"https://www.openphilanthropy.org/team/\">OP CB team</a> (\"GLOBAL CATASTROPHIC RISKS CAPACITY BUILDING\"), four out of six people are native English speakers;</li><li>On the <a href=\"https://www.centreforeffectivealtruism.org/team#groups-team\">CEA Groups team</a>, three out of six people are native English speakers;</li><li>At <a href=\"https://funds.effectivealtruism.org/funds/ea-community#fund-managers\">EA Funds</a>, four out of four grant managers are native English speakers, and five out of seven grant advisors are native English speakers;</li></ol>", "parentCommentId": null, "user": {"username": "Jonathan_Michel"}}, {"_id": "RthhEMNZLnvdiGARW", "postedAt": "2023-12-21T13:30:23.676Z", "postId": "F7qzoWhiCTK8KpuTM", "htmlBody": "<p>Thank you Jonathan, that is super helpful to add actual data!&nbsp;</p><p>I'll add, about 2. CEA Groups Team, that out of 40ish people at CEA (the whole team), only 4 are non native English speakers, and 3 of them are in the Groups Team.</p>", "parentCommentId": "Cq22uKZfGJr4qSpxC", "user": {"username": "alix.pham"}}, {"_id": "5cnLvoHBBivhADeLu", "postedAt": "2023-12-21T15:04:31.666Z", "postId": "F7qzoWhiCTK8KpuTM", "htmlBody": "<p>Thanks a lot for writing this, Alix. I can only heartily agree. I'm fairly fluent in English, having studied abroad and lived in an English-speaking country for a few years. Still, especially in deep intellectual conversations, I find myself struggling to explain concepts in English more than in German. I notice too that I sometimes find myself having a hard time keeping up with the speed of talking, especially with people from bigger cities like New York or London.&nbsp;<br>Keeping in mind that I'm very fluent in English, and now trying to extrapolate that experience to people who have e.g. a B3 level of proficiency, I can see why many people wouldn't be able to engage with the EA community, let alone get into a position of influence.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Milena Canzler"}}, {"_id": "rgB5FzEavoDu7cJvc", "postedAt": "2023-12-21T20:20:40.202Z", "postId": "F7qzoWhiCTK8KpuTM", "htmlBody": "<p>I can readily believe the core claims in this post, and I'm sure it's a frustrating situation for non-native English speakers. That said, it's worth keeping in mind that for most professional EA roles, and <i>especially </i>for \"thought leadership\", English-language communication ability is one of the most critical skills for doing the job well. It is not a problem that people who grew up practicing this skill will be \"overrepresented\" in these positions.</p><p>There is certainly a cosmic unfairness in this. It's also unfair that short people will be underrepresented among basketball players, but this does not mean there's a problem with basketball.</p><p>The actions to address this ought to be personal, not structural. It's worth some effort on the margin for native speakers to understand the experience and situation of non-native speakers—indeed this is one part of \"English-language communication ability\". I'm grateful to my foreign friends for explaining many aspects of this to me, it's helped me in a fair number of professional situations. Things like your talk at an international conference to educate people about this stuff seems like a great idea. And of course most non-native speakers who seek positions in EA (or other international movements) correctly put a great deal of effort into improving their fluency in the lingua franca.</p>", "parentCommentId": null, "user": {"username": "Sarah Levin"}}, {"_id": "3reqyqu7KbXHJj4qs", "postedAt": "2023-12-22T10:24:23.764Z", "postId": "F7qzoWhiCTK8KpuTM", "htmlBody": "<p>Thanks for your comment! I think you're right in highlighting that the current situation makes sense, and I agree with that. I also agree with personal actions being necessary if we want to improve this, but I'm more uncertain about it not being structural too. I'm not ready to change my mind about this yet, as I am still convinced a different structure of the movement could help with that issue, but I'm happy to consider additional arguments that could make me change my mind.</p>", "parentCommentId": "rgB5FzEavoDu7cJvc", "user": {"username": "alix.pham"}}, {"_id": "ceyizJmoD3rwSWAi9", "postedAt": "2023-12-22T18:19:05.027Z", "postId": "F7qzoWhiCTK8KpuTM", "htmlBody": "<p>Alix - Thanks for writing this. I think it is a serious issue in terms of spreading EA from being a mostly Anglosphere movement (in UK, US, Australia, etc) to becoming a global movement,</p><p>There <a href=\"https://promova.com/blog/how-many-people-speak-english\">seem to be</a> about 400 million native English speakers in the world, plus around another 1.5 billion people who have English as their second language (e.g. many in India and China), with varying degrees of fluency. From my experience of teaching college classes in China, often people there have much higher English fluency in writing and reading than in speaking.</p><p>So, roughly 75% of the potential English speakers in the world have English as their second rather than native language. This is a very large, often untapped market for EA ideas -- people who might be able to read Singer, Bostrom, MacAskill, Ord, etc., and read EA Forum posts, but who might feel quite intimidated attention an EAG meeting in person and trying to talk with people.</p><p>I think one small, practical step we can take is to be aware of this issue when writing posts and comments on EA Forum. We often use Anglo-American colloquialisms, rather obscure academic vocabulary, and rather convoluted grammar, partly as a coolness-indicator, and partly as an intelligence-indicator. When we use EA/Rationalist in-group dialect, I imagine that might be especially confusing to outsiders.</p><p>So, when we're writing stuff on EA Forum, I would suggest that people try to keep in mind a clear mental image of their audience -- and instead of imaging our US/UK in-group friends, we should try to imagine a 22-year from Shenzhen, Mumbai, Beirut, or Prague who's got pretty good English from a few years of school classes, but who's not fully fluent, or familiar with current US/UK pop culture or Rationalist jargon.</p>", "parentCommentId": null, "user": {"username": "geoffreymiller"}}, {"_id": "5wZkuprsuMJ8fdpns", "postedAt": "2023-12-22T19:10:14.838Z", "postId": "F7qzoWhiCTK8KpuTM", "htmlBody": "<p>\"...for most professional EA roles, and <i>especially </i>for \"thought leadership\", English-language communication ability is one of the most critical skills for doing the job well\"</p><p>Is it, really? Like, this is obviously true to some extent. But I'm guessing that English communication ability isn't much more important for most professional EA roles than it is for eg academics or tech startup founders. These places are much more diverse in native language than EA I think.</p>", "parentCommentId": "rgB5FzEavoDu7cJvc", "user": {"username": "RedStateBlueState"}}, {"_id": "XSLqoGAr6mtxtvwkc", "postedAt": "2023-12-23T04:27:34.388Z", "postId": "F7qzoWhiCTK8KpuTM", "htmlBody": "<p>I agree it's an important skill, but I also think its value is declining due to the ability of ChatGPT to help edit the posts of non-native speakers.</p>", "parentCommentId": "rgB5FzEavoDu7cJvc", "user": {"username": "casebash"}}, {"_id": "rbzSwidjAfPKHCRAz", "postedAt": "2023-12-23T04:54:59.124Z", "postId": "F7qzoWhiCTK8KpuTM", "htmlBody": "<p>That seems symmetric though, in the sense that ChatGPT can also help with many of the issues mentioned in this post</p>\n", "parentCommentId": "XSLqoGAr6mtxtvwkc", "user": {"username": "bec_hawk"}}, {"_id": "NoqTJrjLfLqXb9sSd", "postedAt": "2023-12-23T18:27:16.407Z", "postId": "F7qzoWhiCTK8KpuTM", "htmlBody": "<p>It can't help in face-to-face conversations though, which is a great part of an impression someone has of you, especially with respect to interviews or 1-on-1s during conferences, etc.</p>\n", "parentCommentId": "rbzSwidjAfPKHCRAz", "user": {"username": "alix.pham"}}, {"_id": "dJZKL8eFqy4WLu9it", "postedAt": "2023-12-24T11:16:19.318Z", "postId": "F7qzoWhiCTK8KpuTM", "htmlBody": "<p>I think the concern about jargon is misplaced in this context. Jargon is learned by native and non-native speakers alike as they engage with the community: it's specifically the stuff that already knowing the language doesn't help you with, which means not knowing the language doesn't disadvantage you. That's not to say jargon doesn't have its own problems, but I think that someone who attempts to reduce jargon specifically as a way to reach non-native speakers better has probably misdirected their focus.</p>\n", "parentCommentId": "ceyizJmoD3rwSWAi9", "user": {"username": "BenMillwood"}}, {"_id": "hGebczSnwktHnqHrF", "postedAt": "2023-12-24T19:51:49.082Z", "postId": "F7qzoWhiCTK8KpuTM", "htmlBody": "<p>It will be able to do this soon I think</p>\n", "parentCommentId": "NoqTJrjLfLqXb9sSd", "user": {"username": "david_reinstein"}}, {"_id": "B5cehKwvS3mCgdxD5", "postedAt": "2023-12-27T10:43:01.557Z", "postId": "F7qzoWhiCTK8KpuTM", "htmlBody": "<p>But a core thing that you don't mention (maybe because you are a native speaker, and you have to <i>not </i>be one to realize that, not being mean here but simply stating what I think is a fact), is that jargon <strong>adds </strong>to the effort.&nbsp;</p><p>Not only you have to speak a flawless English and not mull over potential mistakes that potentially make you look foolish in the eyes of your interlocutor and reduce the credibility of your discourse, but you also have to use the right jargon. Add saying something meaningful in top of it: you have to pay attention to <strong>how</strong> you say things (language + jargon) and <strong>what</strong> you say.&nbsp;</p><p>Try handling the feeling of inferiority that inevitably arises when your interlocutor speaks a perfect English and<strong> can </strong>focus 100% <strong>on the content only</strong> on what they say while you have to handle <strong>the language + the jargon + the meaning behind </strong>and that gives you a pretty good mix to feel like a fraud, especially when you disagree with someone. Try a sensitive topic, such as prioritizing x-risk over global health, and add all that mental load. Good luck!&nbsp;</p>", "parentCommentId": "dJZKL8eFqy4WLu9it", "user": {"username": "Vaipan"}}, {"_id": "bBbYrEWdQcqZhsMNg", "postedAt": "2023-12-27T21:24:36.658Z", "postId": "F7qzoWhiCTK8KpuTM", "htmlBody": "<p>Ben recognizes that jargon adds effort, he is just saying it adds effort to both sides of the equation, because the nature of specialized jargon is it is not known to all native speakers:</p><ul><li>Native Speaker: Content + Jargon</li><li>Non-Native Speaker: Content + Language + Jargon</li></ul>", "parentCommentId": "B5cehKwvS3mCgdxD5", "user": {"username": "Larks"}}, {"_id": "KGSMZbexbKyAoFh7B", "postedAt": "2023-12-28T17:39:17.625Z", "postId": "F7qzoWhiCTK8KpuTM", "htmlBody": "<blockquote><p>native English cultures are disproportionately represented ... in grant-making organizations, and within research institutions.</p></blockquote><p>I'm not sure if this makes it better or worse, but I suspect that part of the explanation for this is less about linguistic ability and more about the combination of a) the heavy overrepresentation of Anglophone institutions on <a href=\"https://www.topuniversities.com/student-info/choosing-university/worlds-top-100-universities\">world's top universities lists</a> and b) the tendency of EA orgs to hire people very recently out of university and to bias heavily in doing so towards EAs who've come from top universities.</p>", "parentCommentId": null, "user": {"username": "Arepo"}}, {"_id": "H9opmNzhFan46QyRL", "postedAt": "2023-12-28T17:46:49.414Z", "postId": "F7qzoWhiCTK8KpuTM", "htmlBody": "<p>Yeah, I want thought leaders to be highly proficient in logic, statistics, and/or (preferably 'and') some key area of science, engineering, philosophy or social science. I really don't see any strong need for them to speak pristine English, as long as they can write clearly enough in their native language that someone can easily translate it.</p>", "parentCommentId": "5wZkuprsuMJ8fdpns", "user": {"username": "Arepo"}}, {"_id": "HDdefHXjvNqio4zdi", "postedAt": "2023-12-28T20:44:59.885Z", "postId": "F7qzoWhiCTK8KpuTM", "htmlBody": "<p>I think that's indeed one of the dynamics. Thanks for pointing it out! Not sure what to think of it yet, though...</p>\n", "parentCommentId": "KGSMZbexbKyAoFh7B", "user": {"username": "alix.pham"}}, {"_id": "apAZRmPD25c28MjKH", "postedAt": "2023-12-29T06:24:35.169Z", "postId": "F7qzoWhiCTK8KpuTM", "htmlBody": "<p>You have driven home a point and it's worthy to be reviewed at the thought leaders structure of EA.</p>\n", "parentCommentId": null, "user": {"username": "FrankGreat "}}, {"_id": "2ZQFEoGep9k5iYave", "postedAt": "2023-12-29T16:57:45.395Z", "postId": "F7qzoWhiCTK8KpuTM", "htmlBody": "<p>Still, it might add more effort for the non-native speaker because a native speaker can identify something as jargon more easily. This is only a hypothesis of course, so to make progress in this discussion it might he helpful to review the literature on this.</p>\n", "parentCommentId": "bBbYrEWdQcqZhsMNg", "user": {"username": "Jobst Heitzig (vodle.it)"}}, {"_id": "eWWdnHHYBFhfutdrh", "postedAt": "2023-12-30T02:48:41.959Z", "postId": "F7qzoWhiCTK8KpuTM", "htmlBody": "<p>Maybe 'soon' is slightly too strong, it may take a few years for the tech and the culture to adapt. But voice recognition, translation and language/grammar tools are advancing very quickly.</p>\n<p>I imagine in-ear devices that give you quick summaries and translations, and suggest responses or real-time adjustments to what you are saying.  And people will become more OK with using these tools in conversation.</p>\n", "parentCommentId": "hGebczSnwktHnqHrF", "user": {"username": "david_reinstein"}}, {"_id": "be5DFQjpKrAuaHM6w", "postedAt": "2023-12-30T07:06:31.499Z", "postId": "F7qzoWhiCTK8KpuTM", "htmlBody": "<p>Thanks for posting, Alix!</p><p>I think having lots of native English speakers in top positions at EA-aligned organisations is also explained by founder effects. The effective altruism movement started mostly in the UK and US, which have English as the native language, and top positions will tend to be occupied by people who have been in the movement for longer. In addition, as Arepo <a href=\"https://forum.effectivealtruism.org/posts/F7qzoWhiCTK8KpuTM/the-privilege-of-native-english-speakers-in-reaching-high?commentId=KGSMZbexbKyAoFh7B\">noted</a>, EA-aligned organisations recruit from top universities, where students are either native English speakers, or speak English pretty well anyway.</p><p>In terms of next steps, maybe it would make sense for the <a href=\"https://forum.effectivealtruism.org/s/FxFwhFG227F6FgnKk\">EA Survey</a> to include some questions about to which extent linguistic ability is hindering participation in the movement, <a href=\"https://forum.effectivealtruism.org/users/david_moss?mention=user\">@David_Moss</a> and <a href=\"https://forum.effectivealtruism.org/users/willem-sleegers?mention=user\">@Willem Sleegers</a>?</p>", "parentCommentId": null, "user": {"username": "vascoamaralgrilo"}}, {"_id": "HbfxzhKodREAKnwZk", "postedAt": "2023-12-30T16:50:31.527Z", "postId": "F7qzoWhiCTK8KpuTM", "htmlBody": "<p>Thank you Vasco! Yes, I mentioned the founder's effect <a href=\"https://forum.effectivealtruism.org/posts/F7qzoWhiCTK8KpuTM/the-privilege-of-native-english-speakers-in-reaching-high#Poor_inclusion_of_non_native_English_speakers_means_missed_perspectives\">in this paragraph</a>, and I agree.</p><p>I am uncertain whether asking about participation being hindered is truly where the problem lies, but it should help understand the scale of the problem. There's also something unseen from the participant side, where people you interact with form judgments about you that you will not be aware of, that are biased. I hope this makes sense. What I mean is: I wouldn't say that my participation has been hindered due to my linguistic ability, but I am somewhat sure some of my conversation mates have formed impressions of me that are wrong because English is not my native language or culture.</p><p>I also think this misses the point that those people have perspectives that could benefit the movement but are not as listened to as they could be.</p>", "parentCommentId": "be5DFQjpKrAuaHM6w", "user": {"username": "alix.pham"}}, {"_id": "HZt5HbWoK2NEgzcvE", "postedAt": "2023-12-31T14:01:45.313Z", "postId": "F7qzoWhiCTK8KpuTM", "htmlBody": "<p>I wonder whether the focus on top universities in itself carries Anglophone bias.. most other countries don't have a large disparity in talent-attraction between different universities. Instead, the talent is concentrated within universities in e.g. Honours programmes and by grades.</p>\n", "parentCommentId": "KGSMZbexbKyAoFh7B", "user": {"username": "SiebeRozendal"}}, {"_id": "vRAsnEyyQXqufWEkE", "postedAt": "2023-12-31T18:14:49.339Z", "postId": "F7qzoWhiCTK8KpuTM", "htmlBody": "<p>I think it’s hard for many other countries to a similar level of talent differential as many of the top students from those countries are at the top Anglophone universities</p>\n", "parentCommentId": "HZt5HbWoK2NEgzcvE", "user": {"username": "bec_hawk"}}, {"_id": "L8dSRgprbKeFLXLpf", "postedAt": "2024-01-01T01:18:56.482Z", "postId": "F7qzoWhiCTK8KpuTM", "htmlBody": "<blockquote>\n<p>worthy to be reviewed at the thought leaders structure of EA</p>\n</blockquote>\n<p>I'm not sure what this means?</p>\n<p>(And I'm worried that it might reflect a misunderstanding of how the EA movement is organized.)</p>\n", "parentCommentId": "apAZRmPD25c28MjKH", "user": {"username": "Jeff_Kaufman"}}, {"_id": "ffDmmphFezCytjxC7", "postedAt": "2024-01-01T10:54:48.146Z", "postId": "F7qzoWhiCTK8KpuTM", "htmlBody": "<p>Top Anglophone universities are already quite small, and I find it hard to believe that the migration numbers are significant</p>\n", "parentCommentId": "vRAsnEyyQXqufWEkE", "user": {"username": "SiebeRozendal"}}, {"_id": "tSz4BnGs6EbzEAnyR", "postedAt": "2024-01-05T16:08:31.754Z", "postId": "F7qzoWhiCTK8KpuTM", "htmlBody": "<p>I didn't think about it at first, but I am only now realizing that this could be precisely the kind of interaction this post is talking about!</p>", "parentCommentId": "L8dSRgprbKeFLXLpf", "user": {"username": "alix.pham"}}, {"_id": "dmxnCghtfzgQFxDp2", "postedAt": "2024-01-05T16:14:39.539Z", "postId": "F7qzoWhiCTK8KpuTM", "htmlBody": "<p>Do you think my response contributed to the dynamic you're concerned about in this post?</p>\n", "parentCommentId": "tSz4BnGs6EbzEAnyR", "user": {"username": "Jeff_Kaufman"}}, {"_id": "3DwsuB3zn7wyLAoGr", "postedAt": "2024-01-05T16:27:43.601Z", "postId": "F7qzoWhiCTK8KpuTM", "htmlBody": "<p>Not necessarily no, as you ask for clarification - though if you were to form an opinion about the person commenting before the resolution of this potential misunderstanding, that could be caused by a lower language proficiency than expected and not a misunderstanding of the movement dynamics, then maybe yes?</p>", "parentCommentId": "dmxnCghtfzgQFxDp2", "user": {"username": "alix.pham"}}, {"_id": "h5Q2ZovELGgHihH7m", "postedAt": "2024-01-10T09:44:08.942Z", "postId": "F7qzoWhiCTK8KpuTM", "htmlBody": "<p>Thank you for posting, Alix! I am a non-native English speaking scientist and I have often wondered about it in the context of my own productivity. Working on a manuscript that has 17 previous draft iterations can easily make a biologist think about <i>linguistic bias</i> in academia.</p><p>This is actually the good news that I wanted to share - this linguistic injustice within \"thought leaders\" is an issue that we are already working on. The general idea is that non-native English speakers spend more effort in conducting scientific activities (reading and writing papers and preparing presentations etc), but the experience/insight of the writer overpowers native-speaker status.</p><p>A thought leader has to have ideas. Being able to form grammatically correct and aesthetically pleasing sentences is just the final packaging. In the end, it is the community that determines how important the presentation part actually is. Therefore, it has been also interesting to read the replies.</p><p>Furthermore, I think in case of \"lectures, presentations, chairing etc\" native speakers have only a minute advantage. Yes, when I was living in US (and I started 'thinking in English') - presenting got easier! However, the main skill comes with experience. If you done it hundreds of times - so you don't get nervous, can get/keep the attention of the audience and find ways to explain/emphasize key points in that sea of information.</p><p>Maybe I am wrong. Cheers!</p>", "parentCommentId": null, "user": {"username": "Peeter Laas"}}, {"_id": "wea6fig4ZLLmiwLFr", "postedAt": "2024-01-16T15:42:02.364Z", "postId": "F7qzoWhiCTK8KpuTM", "htmlBody": "<p>Ah I really like the idea of adding languages to swapcard profiles - I'll share this with the events team!</p>", "parentCommentId": "HnbHPn4foRAY89x5h", "user": {"username": "charlottedarnell"}}, {"_id": "5ucrYtaHeH97EnYah", "postedAt": "2024-01-16T15:48:11.260Z", "postId": "F7qzoWhiCTK8KpuTM", "htmlBody": "<p>Thanks for writing this Alix. Something I hadn't been tracking much before this post was how events like EAGs and retreats might be especially tiring if you're doing lots of 1:1s in a different language. I remember being surprised by just how tired I got spending all day in a different language when I worked in France, and can't imagine how much that's multiplied when discussing complicated EA topics and ideas.</p>", "parentCommentId": null, "user": {"username": "charlottedarnell"}}, {"_id": "TiDHHwfQBaWeKRDff", "postedAt": "2024-01-21T12:38:16.364Z", "postId": "F7qzoWhiCTK8KpuTM", "htmlBody": "<p>Thank you Peeter for this message! This is quite interesting, I'll reflect on this!</p>", "parentCommentId": "h5Q2ZovELGgHihH7m", "user": {"username": "alix.pham"}}, {"_id": "SiDsqsg2AD2hxzkyi", "postedAt": "2024-01-21T12:40:43.461Z", "postId": "F7qzoWhiCTK8KpuTM", "htmlBody": "<p>Thank you for your comment Charlotte! Yes I think it's probably something additional (and not necessarily very visible) that non-native speakers might struggle with in intense events such as EAG(x)s and retreats. What do you think you might do differently now?</p>", "parentCommentId": "5ucrYtaHeH97EnYah", "user": {"username": "alix.pham"}}, {"_id": "nASFCRyhtDvqCSmfg", "postedAt": "2023-12-26T15:54:31.459Z", "postId": "F7qzoWhiCTK8KpuTM", "htmlBody": null, "parentCommentId": null, "user": null}]