[{"_id": "oyK2rj2LTiLSfLKoQ", "postedAt": "2018-08-04T22:05:37.105Z", "postId": "FA794RppcqrNcEgTC", "htmlBody": "<p>I <a href=\"http://effective-altruism.com/ea/ei/ea_is_the_best_choice_ive_ever_made/\">previously wrote-up my origin story here</a>.</p>\n", "parentCommentId": null, "user": {"username": "Peter_Hurford"}}, {"_id": "iftNgx5Sx7xkqnqeA", "postedAt": "2018-08-05T08:30:59.352Z", "postId": "FA794RppcqrNcEgTC", "htmlBody": "<p>Great idea!</p>\n<p>When I was around 10, I found the killing and torture of animals for meat and fur atrocious, so this is when I decided to become vegetarian. I have been vegetarian since then.</p>\n<p>It wasn't until a few years later that I became more interested in a larger variety of issues, with my pet topics being environmentalism and feminism. I started doing political work when I was 16. I joined a left-wing political group that also focussed on a lot of other issues, like global poverty, democracy and animal rights. It was the first time in my life I met smart and dedicated people.</p>\n<p>Apart from that, I spent most of my time reading through all the non-fiction books in the library I could find. I had always wanted to go into academia. I think I started looking forward to doing a PhD when I was around 10.</p>\n<p>When I was 17 I found LessWrong. A year later someone who was also interested in LessWrong introduced me to EA and I started talking to the Swiss EA crowd. I had never previously thought about cause prioritisation and was really excited about the concept. This was in 2012.</p>\n<p>At the same time, I started a cultural anthropology degree. Given the focus of psychology on WEIRD subjects, it seemed like a great starting point to dismantle misconceptions about humanity. \nBut I was quite disappointed in how the subject was taught, so half a year later, I switched to maths. </p>\n<p>It was 2013 by now and I stayed in touch with the EA Community online and visited the UK and Swiss EA Hubs a couple of times. I lived in Germany at the time where no EA Community existed yet. I started organizing a local LW meetup.</p>\n<p>I stopped doing political work when I was around 19 because I thought it wasn't &quot;effective&quot; enough. I thoroughly regret this. I had a great network and know quite a few people who have great roles now and lots of experience. EA only came around to politics as a worthwhile avenue to doing good years later.</p>\n<p>I focussed on finishing my degree, continued to make sure to stay in touch with the international EA Community and started organizing a local EA meetup once there was more interest in EA in Germany. I mostly regret now how I spent those years. I wish I had been around more people who were actually trying to do things which I cannot say about my local EA/LW network. Continuing political work would have been good, or moving to an EA Hub. But the latter would have conflicted with my degree.</p>\n<p>I finished my degree last year and moved to London and recently also spent a few months in Berkeley. This has been a large improvement compared to the previous situation.</p>\n", "parentCommentId": null, "user": {"username": "Denise_Melchin"}}, {"_id": "CrZSBzQy5GzPvhzH6", "postedAt": "2018-08-05T10:53:33.647Z", "postId": "FA794RppcqrNcEgTC", "htmlBody": "<p>(Holly probably knows most of my story but writing about myself seems fun so I'm going to do it anyway... maybe it'll be somehow useful for someone too)</p>\n<p>When I was 5, I refused to eat meat for emotional reasons (something along the lines of &quot;Mum, that thing you're cutting up still looks like a real chicken and that is sad, I'm going to cry lots now&quot;).</p>\n<p>When I was about 16, my schoolfriend (also a vegetarian) bought me Peter Singer's Animal Liberation for my birthday. Reading this turned my personal, emotional choice into something which felt like a moral imperative. Despite never having engaged with any philosophy before, Singer's views felt almost like a manifesto of what I thought I believed in. I've been pretty staunchly utilitarian since (although I still haven't engaged very deeply with much philosophy).</p>\n<p>I knew that I wanted to contribute positively to the world through my career. Given that history was my favourite subject, it seemed like the best way to help the world was to become a history teacher. I fixed my career plans upon this, and didn't really consider any alternatives to this for years to come...</p>\n<p>When I went to university I had hoped to find an animal advocacy student society, but there was none, so I set one up within weeks, alongside a few other people.</p>\n<p>It was at uni that I first heard of Effective Altruism. Max Dalton (now at CEA) was at my college at uni and so was in my (extended) friendship group. He was heavily involved in the Oxford GWWC society. I didn't ever speak to Max about EA whilst I was at uni, but I'd guess that most undergrads in my college had heard of EA because of Max. I also went to hear Peter Singer gives talks twice while I was there, and I think one of the talks was about Effective Altruism (before I knew much about it); I don't remember it well, so it obviously didn't leave as much of an impression on me at the time as Animal Liberation had. I thought that EA sounded like a great idea, but that I couldn't engage with it yet, because I wasn't earning any money, and my understanding was that EA was about donating effectively. So I decided I would donate 10% of my income to effective charities once I started earning, but that there was nothing else I needed to do in the meantime.</p>\n<p>After my degree and 1 year teacher training course, I began working as a teacher and immediately began donating 10% of my income. I also started tentatively looking for potential EA-related volunteering opportunities (e.g. ACE) but nothing came of this at the time.</p>\n<p>I spoke to some uni friends who were at similar levels of support for EA as I was. They said they had taken the GWWC pledge. I decided to sign up, since I was already donating 10%.</p>\n<p>After signing up, David Nash (EA London) sent me an email asking if I'd like to come to EA London events. I said yes and asked how else I could get involved; I ended up taking over the majority of the organising of the Effective Animal Altruism London sub-group which he had set up with Saulius (another EA based in London) but didn't have much time to put into organising. </p>\n<p>My responsibility for this group (and my general interest) led to a period of deepening involvement in EA; trying to read as much as I could that came out relating to EA and animals and volunteering for several EAA organisations. At some point I decided that I wanted to change my career to have a greater positive impact; this was why I had chosen teaching in the first place anyway, I just hadn't thought the implications of this through. After  several months of agonising, speaking to various people and an 80K coaching call, I decided to work towards working directly in the Effective Animal Advocacy community (as opposed to focusing on building more flexible career capital). So I started an EAA blog, contiued to focus on reading into the area and my volunteering.</p>\n<p>A few months later, I have just started working full time as a researcher at Sentience Institute.</p>\n", "parentCommentId": null, "user": {"username": "Jamie_Harris"}}, {"_id": "GGrruEZAvCxiJbRvd", "postedAt": "2018-08-08T22:02:23.741Z", "postId": "FA794RppcqrNcEgTC", "htmlBody": "<p>I think this is a great idea, and I was really interested, and also touched, by the stories people have already posted, so thank you all! Holly, I love the sentiment of “an extra dose of empathy and mutual appreciation” – I feel like to some extent EA culture, or at least that of its online spaces like this one, is very good at hiding the many meaningful personal relationships that I know the community has fostered.</p>\n<p>I found EA in late 2012, just after I’d started my first degree in Oxford. At the first meeting of the science fiction society (which I then never ended up going back to), someone pointed me towards HPMoR. I then looked it up when I got back to my room and read a bit of it, and then found someone talking about EA in the comments section. I never did read the rest of HPMoR until a long time later, and apart from that I’ve never interacted with the rationalist community, so I always feel like this origin story is amusingly mismatched to me... Anyway, I then read about EA a bit on the internet, generally thought it was a great idea, and it sat around in the back of my mind for a while. About a year later, I think, I started regular EA-guided donations.</p>\n<p>I know for a fact that I’ve changed a whole lot in the last six years, which I’m happy about, because I really don’t like six-years-ago me. When I started university (studying physics) I was – not remotely to say that I think all of these things are bad, of course, only some of them – very analytical in my approach to most things. I was entirely emotionally inept – I didn’t really form emotional friendships (at least, not ones that were emotional from my side); I sometimes treated people rather badly, enough that I’m pretty surprised looking back that some of my friends stayed with me, and I just really didn’t understand most people’s emotional needs, which often led me to be very judgemental and superior, including on moral issues. I liked having very long, theoretical conversations with my fellow students late into the night (that hasn’t changed!), and I liked being reactionary and expressing opinions that were different enough to be shocking to others. Morally I think I was a pretty rigid deontologist. </p>\n<p>(As a point of interest, for a while afterwards, I held a <em>really weird</em> position of just-about-moral-realism, where I thought that what was, universally and really, right and wrong for one person, might be entirely different for another in the same situation – I thought that real morality existed, but depended on the actor about whom the question was being asked as much as the action. I had this way of visualising it that was of there being a little “moral bubble universe” attached to each consciousness that was real, but that was only true for that one person, and each person had a moral sense pointing into that space, that could tell them only about what was right for them.)</p>\n<p>Once I encountered EA (which was at the time when it seemed to almost entirely concern charitable donations), I did agree with it wholeheartedly; being good is good, and being better is better. But, to be uncharitable to my earlier self, I also liked it because it let me dissociate morality and caring, and because the analytical, counter-intuitive, and just plain unusual nature of it fit well with my, I suppose, aesthetics of ideas at the time.</p>\n<p>I didn’t do a lot more with EA other than read about it and direct my donations, and donate increasing (but still small) amounts for a long while after. In 2015 I finished my physics degree and moved to Cambridge, to start a second undergraduate degree in medieval languages. I read a lot more about EA, on the internet and Doing Good Better once that came out, and also started donating more, and eventually took the Pledge last year. However I didn’t do anything with the Cambridge EA group other than go to one formal hall and hang about on their mailing list. Looking back, I think this was because my plan at the time was firmly to remain in academia in the humanities, and I think I had some guilt over the fact that as someone who felt like I knew a fair bit about EA by now, should probably be using it to direct my career, but didn’t want to and so felt vaguely uncomfortable (although of course I shouldn’t have) about the idea of mixing with lots of core EAs.</p>\n<p>Compared to the me described above, by maybe two years ago, I’d changed a whole lot (fortunately) – I’d become actually vaguely emotionally capable, both in understanding others’ feelings and my own. I’ve been able to make a wonderful group of close emotional friendships, and I think (hope?) that I’ve become a much more pleasant person to know since I became able to care. While I certainly do still like to be analytical, and think things through properly (and this is a good thing), my opinions have mostly become a whole lot more mainstream and acceptable on many matters as I worked out that on thing after thing, the norms that society’s settled on are actually often pretty good to follow – I have also entirely changed on political opinions, from pretty rigidly conservative to pretty radically left-wing. I’m now certainly a consequentialist morally speaking, although I haven’t worked out precisely what kind yet. (Preference utilitarianism appeals the most to me, but doesn’t satisfy, and I’m nowhere near a satisfying position on population ethics.)</p>\n<p>I definitely still fully identify with EA; in some ways it’s the most prominent belief that I feel I’ve actually stuck with, but my reasons for appreciating EA have definitely changed. Obviously a big part of it is still that EA is simply morally correct. However I feel now, if I may risk getting somewhat floaty, more like I’m an effective altruist because I care about people, because I feel like I’m part of a global community of humanity, and it’s tragic that there are so many people who suffer, people who are just like the friends I love in everything except that they were born in the wrong house; it’s tragic that we can’t help them all, and EA is important to me because tells me how we can make the world the biggest little bit less terrible that we can. I also love the idea of EA as a real community of people dedicated to doing good.</p>\n<p>Soon after starting my masters course (still medieval languages) I realised I was much less certain about doing a PhD than I had thought, and didn’t apply for one, instead planning to take a year out and think about what I wanted to do. Since then, I had a bit of an EA renaissance (not that I’d particularly had an off period), started reading things a lot more, listening to the podcasts, went to a couple of EA Cambridge events, talked about things more with the one of my closest friends who is very involved in the Cambridge community. When I read the 80,000 Hours article about operations work, that really clicked with me as I didn’t feel most of the other direct work profiles had, and I ended up getting advice from a couple of CEA people, and now plan to work at something relevant for the next year while I’m committed to living in Cambridge with my friends here, then look for something directly effective after that. </p>\n<p>Thank you also for posting something that I felt confident enough to reply to – I’ve been reading the forum for ages but never yet managed to comment on anything. Hopefully it will be easier now! And I'm sorry that this got a little long...</p>\n", "parentCommentId": null, "user": {"username": "AmritSidhu-Brar"}}, {"_id": "vLSAwRSoFRcYF8LDn", "postedAt": "2018-08-09T21:02:23.900Z", "postId": "FA794RppcqrNcEgTC", "htmlBody": "<p>Pretty cool idea - since I'm new to EA, I hope this will become a neat snapshot for me to look back on in a few years to see how far I've come.</p>\n<p>Growing up, I believe I was raised to be a decent member of society - be kind to others, don't litter, help those in need.  I never really thought explicitly about ethics, or engaged deeply with any causes.  Sure, I'd raise money for cancer at &quot;Relay for Life&quot;, but it wasn't because I thought the $100 dollars would make a difference - more because it would be fun to have a camp-out with friends.</p>\n<p>In my twenties, my goal was primarily to make money to retire early so I could travel, and maybe volunteer my time to help increase financial literacy, or apply my career experience in a not-for-profit.  Fairly ephemeral goals though - I also considered becoming a full-time music producer.</p>\n<p><strong>Rationality</strong></p>\n<p>When I was 28, I found Less Wrong from a link my friend posted on Facebook.  Over the next two years I read every essay in the Rationality sequences, supplemented by a healthy amount of psychology/economy/math/self-help style audiobooks.  Reading that material was an enjoyable journey and lead to a few minor epiphanies.</p>\n<ul>\n<li>I love improving my thinking, and upgrading my effectiveness</li>\n<li>I thought deeply about my ethics for the first time</li>\n<li>I have a responsibility to improve the world in the biggest and best way possible</li>\n</ul>\n<p>Seriously - the last book &quot;Becoming Stronger&quot; and the sequence &quot;Challenging the Difficult&quot; really motivated me to think much larger than I had before.  Discovering 80,000 Hours around the same time was a great template to follow.</p>\n<p><strong>Effective Altruism</strong></p>\n<p>In May 2018 I attended my first EA meet-up.  I recall thinking, &quot;Wow! There are actually other rationalists out there&quot;.  Up until that point, I'd never really met others who thought or spoke similarly, let alone a whole room full of them.  I'm currently enjoying the learning curve, finding more questions than answers.</p>\n<ul>\n<li>Attending weekly meet-ups at the Fox &amp; Fiddle with EA Toronto</li>\n<li>Hosting games nights, going on hikes, watching debates</li>\n<li>Independently tackling cause prioritization, clarifying my ethics and their implications for where I should dedicate my effort</li>\n<li>Excited to attend the EA Summit 2018!</li>\n</ul>\n<p>I'm currently working with a team of amazing EAs towards my top cause priority, and hope to launch this autumn.</p>\n", "parentCommentId": null, "user": {"username": "Naryan"}}, {"_id": "YGfD5dmhSEJe5CPHT", "postedAt": "2018-08-10T13:03:12.678Z", "postId": "FA794RppcqrNcEgTC", "htmlBody": "...", "parentCommentId": null, "user": {"username": "Darius_Meissner"}}, {"_id": "3vQMMWx3oLSx2v4AB", "postedAt": "2018-08-10T13:44:00.604Z", "postId": "FA794RppcqrNcEgTC", "htmlBody": "<p>Some parts of this sound very similar to me, down to 'left-wing youth political organisation who likes to sing socialist songs' (want to PM me which one it was?).</p>\n<p>I have noticed before how much more common activist backgrounds are in German EAs vs. Anglo-Saxon EAs. When I talked about it with other people, the main explanation we could come up with was different base rates of sociopolitical activism in the different countries, but I've never checked the numbers on that.</p>\n", "parentCommentId": "YGfD5dmhSEJe5CPHT", "user": {"username": "Denise_Melchin"}}, {"_id": "KnzJWtKzfrci9y9pG", "postedAt": "2018-08-10T15:07:48.880Z", "postId": "FA794RppcqrNcEgTC", "htmlBody": "<p>In primary school, I wanted to defend nature (no doubt influenced by my dad, an environmentalist). I tried to create the &quot;Environment Club&quot; at my school. I still have some documents, in French, from that time (around 2006).</p>\n<p>Here is an extract form a Microsoft Word document called &quot;convincing.doc&quot;, last edited in March 2006:</p>\n<blockquote>\n<p>Step n°1 : raise awareness about the destruction of the environment  </p>\n<p>Step n°2 : convince to act  </p>\n<p>Step n°3 : act </p>\n</blockquote>\n<p>I made a leaflet explaining pollution and the greenhouse effect in Microsoft PowerPoint. It included slogans such as &quot;Destroying our environment is destroying our future&quot; and &quot;acid rain: danger!&quot;, in WordArt, of course.</p>\n<p>In another document called &quot;PROJECTS.doc&quot;:</p>\n<blockquote>\n<p>SECONDARY PROJECT OF THE CLUB</p>\n<p>Because it is spring, there are many ladybirds in the school courtyard. So children capture them for fun: the club must prevent these children from capturing them, or, if they have already captured them, deliver them. For a tactic, see below. [...]</p>\n<p>PRINCIPAL PROJECT OF THE CLUB</p>\n<p>The principal project of the club is to convince a maximum number of people to environmentalism. </p>\n</blockquote>\n<p>In &quot;TACTICS FOR LADYBIRDS.doc&quot;:</p>\n<blockquote>\n<ol>\n<li><p>If they have put down the animal, take it and release it. But for that one must know if they have put it down and where. For this, place a spy who the children do not know, or know little.</p>\n</li>\n<li><p>To make the children put down their ladybird: someone occupies them and proposes a pleasant game, and then advises them to put down their ladybird for the duration of the game (if needed, do not look at the hiding place, for this place a spy) [...]</p>\n</li>\n<li><p>If the children are very small, tell them that ladybirds release a deadly liquid!</p>\n</li>\n</ol>\n</blockquote>\n<p>I no longer endorse lying for the greater good.</p>\n<p>Skipping forward, when I was around 14 or 15 I read &quot;Poor Economics&quot; by Banerjee and Duflo, which I had seen my dad read. I immediately saw the appeal of randomised trials: Science! Plus, the book contained a good amount of Malcolm-Gladwell-style counter-intuitive &quot;insight porn&quot;, which I was very fond of at the time.</p>\n<p>The book made me realise the scale of global poverty. I was especially impressed by the possibility of substantially helping the very poor with only cheap interventions. I started having thoughts which I would now recognise as consequentialist: &quot;You can help kids get vaccinated using just a bag of lentils (!); this is SO IMPORTANT! Why the hell isn't everyone talking about this?&quot;.</p>\n<p>Eventually I continued on with my life. Perhaps I figured that if no-one around me cared about global poverty, it couldn't be that important. But there remained some cognitive dissonance.</p>\n<p>When I was 16 my dad gave me &quot;The Life You Can Save&quot; as a gift. The book made an explicit, unabashed case for the beliefs which had been implicitly floating at the back of my mind. It was illuminating. I decided that helping the global poor was in fact the most important thing, other people's indifference be damned! Although I did check out GiveWell's website briefly, I didn't dive in deeper, nor did I become aware of other online EA materials. This must have been 2012. </p>\n<p>(My dad later told me that he had hesitated about giving me &quot;The Life You Can Save&quot;, lest it come off as too preachy.)</p>\n<p>Because of inertia, or because these ideas take time to sediment, I didn't actually change my behaviour for at least another few years. At some point between the ages of 16 and 18, my interest in global poverty grew from a trickle to a flood. By the end of 2014, the year I left school, I was aware of Giving What We Can, and was reading more and more about EA. I devoured the websites of GiveWell, 80,000 Hours, and so on. I went vegetarian that year (although at first mostly for environmental reasons); then I volunteered remotely for The Life You Can Save in my first year of university in Paris. After I got an offer to go to Oxford in 2015, I decided to apply for a summer internship at Giving What We Can.</p>\n<p>The internship, in the summer of 2015, was a mind-blowing dive into the EA community. Suddenly I was in an office full of impressively smart people who shared my values and my thinking style. I had found my tribe.</p>\n", "parentCommentId": null, "user": {"username": "tom_sittler"}}, {"_id": "Yi7EHf7xDLiuJnZfK", "postedAt": "2018-08-15T21:26:04.848Z", "postId": "FA794RppcqrNcEgTC", "htmlBody": "<p>That's for the inspiring story, and to all the previous commenters.</p>\n<p>My memory is one of my most failing attributes, but this post has encouraged me to contribute to this forum for the first time after being an occasional spectator, so here goes.</p>\n<p>In early 2016, I was playing table-tennis with my older brother. Table-tennis is a unique game because it takes a lot of concentration, yet it is possible to have a fully engaged conversation with your opponent at the same time. Back and forth, we talked. I said something like this:</p>\n<p>“I’m gonna start a PhD soon. I’ll earn a small stipend. Based on how much living has cost over the last few years, I’ll still have a lot left over. Then I’ll graduate and earn more money, and have more left over. Other people surely need this surplus money more than me. So I should give some of it away.”</p>\n<p>At the same time, I was trying to make better financial decisions, and was dabbling in financial investment. So I asked my brother a question:</p>\n<p>“With this leftover money, is it best to give it to charity now or to invest it and give it later?”</p>\n<p>We threw around some ideas about compound interest, duty to help now, problems now being worse than problems later, and that we might learn more later to give in a more impactful way. We didn’t get very far with the discussion, so I Googled it. The words “Effective Altruism” kept cropping up, and I found my way to Peter Singer’s TED talk.</p>\n<p>I was already convinced by Peter Singer’s anti-speciesist arguments against eating animal products, as I had been vegan for about a year, so it was intriguing to hear about other philosophical stances he argues for. His talk piqued my interest in EA, which, with the aid of our local EA group, has slowly drawn me further and further into its logical and compassionate underworld.</p>\n<p>I had dabbled with various social and intellectual movements previously, but had always felt something not quite right. Some were to insular, some too tribal, some lacking in good intellectual practices, with misaligned incentives. What I loves about EA, that other groups I have dabbled with in the past, is its ability to self criticise, to learn, to change its mind, to accept that we might be wrong, and that other people might be right, but to try to listen to all parties, and to get as close to the right answers as we can be. I also was drawn in by the idea that this movement is not be bound to an arbitrary cause, rather it is about finding correct answers to one of the most fundamental questions we face: how can we do the most good?</p>\n<p>Since then, I have met some of the best people I know, I have changed my mind a lot, and I have improved in many areas of my life. I am now the chair of my city's local group, I volunteer for an EA-aligned organisation, and I am planning on moving from researching mathematics to something closer to what the world needs once I finish my PhD. I can’t wait!</p>\n", "parentCommentId": null, "user": {"username": "M_Allcock"}}, {"_id": "tY9uGifboN55hBC2m", "postedAt": "2018-09-16T00:28:15.687Z", "postId": "FA794RppcqrNcEgTC", "htmlBody": "<p>Part of my origin story is here: <a href=\"http://effective-altruism.com/ea/1sd/doing_vs_talking_at_ea_events/\">Doing vs Talking at EA Events</a>.</p>\n<p>I wrote my full origin story somewhere on Quora. In a nutshell, I didn't see everyone's live as having much of any meaning. I didn't see my life as meaningful. I tried thinking about what what I will eventually do, work wise. But I couldn't think of what that would be. I wanted to start working towards being an expert at whatever work that was to be. And so, I figured in my preteen years, that I really didn't have a purpose. </p>\n<p>Long story short, as an auxiliary sort of life, I decided to live for others. Again, temporarily I would live for the worst off people. Their circumstances had to be much worse. I didn't know the word &quot;poverty&quot; at the time, but that was just it. I knew I could live to help at least one of those people. That would make all the difference: Even in a life devoid of meaning, I could make some sort of impact for at least one person at the opposite end of the spectrum--maybe even not directly (face-to-face). Somehow. </p>\n<p>In high school, in about 2012, I started looking into how to best combat poverty. Since then, I've learned the difference between relative and absolute poverty, signed the GWWC pledge and almost donated a kidney. I will soon be Earning to Give. That's all I truly want to do. I follow Habermas's discourse ethics as a systematic theory; I am a deontologist.</p>\n<p><strong>I wish I knew some stories about specific people in poverty. I recall a few from memory, but the detail is lacking.</strong> I recall something about this woman purchasing rice, kilos, and...</p>\n", "parentCommentId": null, "user": {"username": "adamaero"}}, {"_id": "jY4SpwAYwGcYf9D78", "postedAt": "2020-02-22T15:27:43.921Z", "postId": "FA794RppcqrNcEgTC", "htmlBody": "<p>here&apos;s mine: <a href=\"https://pixelbrowniesoftware.blogspot.com/2020/02/hello-there-effective-altruism-community.html\">https://pixelbrowniesoftware.blogspot.com/2020/02/hello-there-effective-altruism-community.html</a></p>", "parentCommentId": null, "user": {"username": "pixel_brownie_software"}}]