[{"_id": "xKtq8KCNTrn9AyoEC", "postedAt": "2024-03-17T08:45:12.389Z", "postId": "FaqutaCNqccgkgcaf", "htmlBody": "<p>Thanks so much Neil for these interesting reflections, I gave a strong up-karma vote. I agree with your central the thesis <i><strong>(I should not be ashamed of wealth, but exploit it as well as I can). </strong></i>One of my favourite \"pre-EA\" pieces of work, <a href=\"https://christianhistoryinstitute.org/magazine/article/wesleys-sermon-use-of-money\">this John Wesley sermon from about 1750</a> expresses a similar sentiment.</p><p>There's a few aspects here I'd like to explore a bit. First there is a distinction between <i><strong>wealth </strong></i>and <i><strong>spending</strong></i>. <i><strong>Spending less </strong></i>can allow you to <i><strong>Give more, </strong></i>and can also open up conversations around giving and effective altruism<i><strong>.</strong></i> On this note I think its fantastic that you are noticing the price of things and trying to guide your family towards spending less on dessert and perhaps even giving towards mosquito nets - that's amazing keep it up!<br><br>The equation is not necessarily simple as you stated<i><strong> \"More money is more good: that’s a simple equation I can get behind. Were my parents a little richer, it might be 100 euros a month going to AMF instead of 50.\" &nbsp;</strong></i>The \"giving equation\" depends both on how much money you have, and how much you spend + save. To grossly oversimplify, the equation could look something like</p><p><i><strong>Income - (Spending + Saving) = potential to give</strong></i></p><p>So your work reducing your family's spending could potentially help increase their AMF giving, as much as them having more money could as well. Some people spend and save little, and so can give much more than many who earn high salaries and spend/save a lot. For example last year <a href=\"https://forum.effectivealtruism.org/users/mvk?mention=user\">@MvK</a><a href=\"https://forum.effectivealtruism.org/posts/rszgfHdkmzCDDPM9k/?commentId=xcFFXAG56bwXdPYQ2\"> gave around 50,000</a> dollars of his 70,000ish income to charity, which is super cool.</p><p>Also I think there are complexities around wealth that mean it might not simply be \"good\". Here are a few thoughts.</p><ul><li>Under your framework wealth is only \"good\" if its actually given away - otherwise its not very useful apart from perhaps increasing our own happiness a tiny big. On this note, there is a decent argument that its better not accumulate wealth at all, but better to give it now, as you go. <a href=\"https://forum.effectivealtruism.org/posts/7uJcBNZhinomKtH9p/giving-now-vs-later-a-summary\">This 10 year old post</a> by <a href=\"https://forum.effectivealtruism.org/users/julia_wise?mention=user\">@Julia_Wise</a> summarises this arguments for and against this pretty well. If this is true, then \"wealth accumulated\" isn't the best option, but instead giving as we go while never becoming personally wealthy.</li><li>Much wealth is built on both historical and ongoing poor treatment of workers - in the past through slavery and now through poor working conditions in manufacturing and services. This means wealth its not necessarily squeaky clean and <i><strong>guilt free. </strong></i>Like you say this isn't necessarily you or your parents faul, but I think its important to reflect that at least a portion of our personal and nation's wealth often stems from mistreatment of our fellow humans.</li><li>It is harder for the poor than the rich to gain more wealth. Free-ish market capitalism might be the best option we have at the moment, but even its most ardent supporters will admit there is at least some unfairness built into the system, making it easier to make money and build wealth if you already have it (capital begets capital), compared with if you start with less.&nbsp;</li><li>Increasing Inequality from the rich getting richer may cause harm through making the whole society less happy (although there are differing opinions on this, ask Steven Pinker). I won't get into the details here!</li></ul><p>Anyway great post and I hope you write more!</p>", "parentCommentId": null, "user": {"username": "NickLaing"}}, {"_id": "X5XgyWp7CGpH64RCX", "postedAt": "2024-03-17T18:34:32.229Z", "postId": "FaqutaCNqccgkgcaf", "htmlBody": "<p>I agree with all this! Thank you for the comment (the John Wesley sermon looks particularly interesting). I plan to make money for the explicit goal of giving it away, and will keep all your caveats in mind.&nbsp;</p>", "parentCommentId": "xKtq8KCNTrn9AyoEC", "user": {"username": "Neil Warren"}}, {"_id": "skM5uqQgLYjNfHx4s", "postedAt": "2024-03-17T20:04:58.723Z", "postId": "FaqutaCNqccgkgcaf", "htmlBody": "<p>I wrote this thinking in a case like yours. I hope it can be useful to you:</p>\n<p><a href=\"https://forum.effectivealtruism.org/posts/z8H7q3fgY4gCqnpTJ/jeff-bezos-wealth\">https://forum.effectivealtruism.org/posts/z8H7q3fgY4gCqnpTJ/jeff-bezos-wealth</a></p>\n", "parentCommentId": null, "user": {"username": "Arturo Macias"}}, {"_id": "ZJWJXYYqfQHEWfKRx", "postedAt": "2024-03-17T20:20:25.998Z", "postId": "FaqutaCNqccgkgcaf", "htmlBody": "<p>Here I put the abstract: the post was a little bit too long:</p>\n<p>On the contrary, the effective proposal for the high corporate owner’s aristocracy is: i) the preservation of their own existence with a sustainable birth rate, a sense of social purpose and focus on wealth preservation, ii) support for a republican corporate governance inclusive of all stakeholders, and in the case of platforms, designed to foster a competitive ecology, iii) genuine altruism in the use of political influence, iv) the use of business surplus more for conspicuous (and effective!) altruism than for conspicuous consumption or display. Let it be clear, however, that utilitarianism recommends moderation, never asceticism.</p>\n", "parentCommentId": "skM5uqQgLYjNfHx4s", "user": {"username": "Arturo Macias"}}]