[{"_id": "wGhq9hsojC5YzuAm8", "postedAt": "2023-05-08T07:20:43.377Z", "postId": "Fc9yhQygsj3bmJQqy", "htmlBody": "<p>My educated guess (based on researching on this topic interviewing a bunch of charities and fundraising consultants) is that the main reason is that fundraising via a marathon has lower ROI than spending fundraising resources on stewarding a major HNW donor or applying to an additional grant.</p>\n<p>You can see this prioritization in org staffing - at larger orgs (e.g like GW recommended ones) - you could have several major gift officers, but only 1 annual fund (aka small donor) manager. And the one managing those folks are usually spending most of their time on donor communications (and sometimes events).</p>\n<p>Another benefit of a marathon could be peer to peer fundraising. Peopel refer to those donors as \"third party donors\" who don't have a strong loyalty to the org itself, making them less worth acquiring than simply retaining and upgrading existing donors.</p>\n<p>Finally, rather than donations you could say the main benefit of participating is awareness. Most GW recommended charities from my research have foundation heavy portfolios, where public awareness is less important / has less obvious benefits.</p>\n<p>(Side note: I would imagine that being 1/500 charities is probably not going to be a huge publicity boost without a lot of effort from the charity's side, or there being a specific reason why this event vs a more targeted one for their org)</p>\n<p>I also would guess (having not looked into this marathon specifically) that most charities are going to be local UK charities, vs international ones.</p>\n<p>I'd love to hear from actual GW charities though! (I expect you may have better luck directly contacting them, as I'm not sure fundraising staff at a lot of these orgs actually frequent the forum).</p>\n", "parentCommentId": null, "user": {"username": "vaidehi_agarwalla"}}, {"_id": "xuyZTfuzd3wDpZ8ZP", "postedAt": "2023-05-08T07:39:21.528Z", "postId": "Fc9yhQygsj3bmJQqy", "htmlBody": "<p>Hi,<br><br>I don't know this half-marathon in London, so I try to give a picture for everyone else.&nbsp;<br><br>The<a href=\"https://llhm.co.uk/\"> London Landmarks Half Marathon</a> is a closed road, central London run and raised over £37.5 million for charity since its start in 2018.<br>&nbsp;<br>They have 367 different charities listed for which you can run for, with those ten in a prominent place, see all <a href=\"https://llhm.co.uk/charity-places\">here</a>:</p><figure class=\"image\"><img src=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/xuyZTfuzd3wDpZ8ZP/unwc969p6l26v60znpit\" srcset=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/xuyZTfuzd3wDpZ8ZP/qubezy3w9eias7h07cu6 130w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/xuyZTfuzd3wDpZ8ZP/twerrpyxmjeqxznps90j 260w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/xuyZTfuzd3wDpZ8ZP/ekzitymlrkdrj1prjj9u 390w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/xuyZTfuzd3wDpZ8ZP/naa5h95pkvh3ew0da4eu 520w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/xuyZTfuzd3wDpZ8ZP/a86mqknsvbtvffyiibjt 650w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/xuyZTfuzd3wDpZ8ZP/p1mzrr7nfqmz7tzvbo0n 780w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/xuyZTfuzd3wDpZ8ZP/ogk8tcgq9m97asyswf7u 910w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/xuyZTfuzd3wDpZ8ZP/ilwqps9feac3mxl8n5k5 1040w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/xuyZTfuzd3wDpZ8ZP/jiizfmuwrb7syjz8vxfx 1170w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/xuyZTfuzd3wDpZ8ZP/bs9kul3zjvrty7uvg5dh 1206w\"></figure><p><a href=\"https://llhm.co.uk/charity-partner\">Costs</a>:<br>\"Each charity place costs: £142.50<br>Charities must purchase a minimum of 5 places.&nbsp;<br>Places are non-refundable, and cannot be rolled over or transferred.\"<br><br>If you want to buy less, then each cost <a href=\"https://llhm.co.uk/buying-places-run-charity\">£152.50</a>.<br><br>Benefit:<br>I was not able to get numbers on how much money this was able to raise for the charities in comparison with the time and money you have to spend for the event.<br><br>Conclusion:<br>I doubt it's the best event to spend resources on, but maybe I am mistaken and high impact orgs recommended by Give Well can implement something like this in their fundraising.<br><br>Thank you for bringing something up that's important for you. Maybe add more explanation, so that others have a better understanding about why the llhm would be a good opportunity for fundraising compared to the other alternatives.<br>&nbsp;</p>", "parentCommentId": null, "user": {"username": "Felix Wolf"}}]