[{"_id": "2WuTskzBwuKozrxYS", "postedAt": "2023-03-25T19:06:03.817Z", "postId": "FdYzaKxaP7hJNa5AF", "htmlBody": "<p>Hey Julian,<br><br>good job at your try to distil important topics into an approachable medium. I will send this to some friends who were discussing the new release of Chat-GPT-4 and its app feature.<br><br>Thank you and have a nice weekend. :)</p>", "parentCommentId": null, "user": {"username": "Felix Wolf"}}, {"_id": "dKNvy9KycweZZFH3S", "postedAt": "2023-03-25T19:08:30.143Z", "postId": "FdYzaKxaP7hJNa5AF", "htmlBody": "<p>FWIW, I just wrote a midterm paper in the format of a memo to the director of OSTP on basically this topic (\"The potential growth of AI capabilities and catastrophic risks by 2045\"). One of the most frustrating aspects of writing the paper was trying to find <i><strong>externally-credible</strong></i> sources for claims with which I was broadly familiar, rather than links to e.g., EA Forum posts. I think it's good to see the conceptual explainers, but in the future I would very much hope that a <i><strong>heavily time-constrained but AI-safety-conscious staffer</strong></i> can more easily find credible sources for details and arguments such as the analogy to human evolution, historical examples and analyses of discontinuities in technological progress, the scaling hypothesis and forecasts based heavily on compute trends (<i><strong>please, Open Phil, something other than a Google Doc! Like, can't we at least get an Arxiv link?</strong></i>), why alignment may be hard, etc.&nbsp;</p><p>I guess my concern is that as the explainer guides proliferate, it can be harder to find the guides that actually emphasize/provide credible sources... This concern <i>probably</i> doesn't make new guides net negative, but think it could potentially be mitigated, maybe by having clear, up-front links to other explainers which do provide better sources. (Or if there were some spreadsheet/list of \"here are credible sources for X claim, with multiple variant phrasings of X claim,\" that might also be nice...)</p>", "parentCommentId": null, "user": {"username": "Harrison D"}}, {"_id": "WyEz4jFjyA5nxMqYh", "postedAt": "2023-03-25T19:18:42.520Z", "postId": "FdYzaKxaP7hJNa5AF", "htmlBody": "<p>+1, I would like things like that too. I agree that having much of the great object-level work in the field route through forums (alongside a lot of other material that is not so great) is probably not optimal.</p><p>I will say though that going into this, I was not particularly impressed with the suite of beginner articles out there — sans some of Kelsey Piper's writing — and so I doubt we're anywhere close to approaching the net-negative territory for the marginal intro piece.</p><p>One approach to this might be a soft norm of trying to arxiv-ify things that would be publishable on arxiv without much additional effort.</p>", "parentCommentId": "dKNvy9KycweZZFH3S", "user": {"username": "julianhazell"}}, {"_id": "focY2yqrhcq3LDpvB", "postedAt": "2023-03-26T03:45:44.969Z", "postId": "FdYzaKxaP7hJNa5AF", "htmlBody": "<p>I think that another major problem is simply that there is no one-size-fits-all intro guide. I think I saw some guides by Daniel Eth (or someone else?) and a few other people that were denser than the guide you’ve written here, and yeah the intro by Kelsey Piper is also quite good.</p>\n<p>I’ve wondered if it could be possible/valuable to have a curated list of the best intros, and perhaps even to make a modular system, so people can customize better for specific contexts. (Or maybe having numerous good articles would be valuable if eventually someone wanted to and could use them as part of a language model prompt to help them write a guide tailored to a specific audience??)</p>\n", "parentCommentId": "WyEz4jFjyA5nxMqYh", "user": {"username": "Harrison D"}}, {"_id": "quRkSnHyjBjbnip8P", "postedAt": "2023-03-26T18:29:30.882Z", "postId": "FdYzaKxaP7hJNa5AF", "htmlBody": "<p>Interesting points. I'm working on a book which is not quite a solution to your issue but hopefully goes in the same direction.&nbsp;<br>And I'm now curious to see that memo :)</p>", "parentCommentId": "focY2yqrhcq3LDpvB", "user": {"username": "Darren McKee"}}, {"_id": "5KiHBb8PyeEZCt6bH", "postedAt": "2023-03-26T18:48:08.611Z", "postId": "FdYzaKxaP7hJNa5AF", "htmlBody": "<p>Which issue are you referring to? (External credibility?)&nbsp;</p><p>I don’t see a reason to not share the paper, although I will caveat that it definitely was a rushed job. https://docs.google.com/document/d/1ctTGcmbmjJlsTQHWXxQmhMNqtnVFRPz10rfCGTore7g/edit</p>", "parentCommentId": "quRkSnHyjBjbnip8P", "user": {"username": "Harrison D"}}, {"_id": "WMkwtJF3cwTAeevvo", "postedAt": "2023-03-27T12:58:48.067Z", "postId": "FdYzaKxaP7hJNa5AF", "htmlBody": "<p>I was referring to external credibility if you are looking for a scientific paper with the key ideas. Secondarily, an online, modular guide is not quite the frame of the book either (although it could possible be adapted towards such a thing in the future)</p>", "parentCommentId": "5KiHBb8PyeEZCt6bH", "user": {"username": "Darren McKee"}}]