[{"_id": "jYsG4k6Xw8tTdxtFc", "postedAt": "2024-01-12T17:41:26.993Z", "postId": "FfbtkKaPMpLWZzCpm", "htmlBody": "<p>Thank you for this post. I agree that utilitarians and EAs in general should keep common-sense morality in mind, on consequentialist grounds.</p>\n<p>One difficulty with this is that it’s not always clear what common-sense morality prescribes. It’s likely but not at all certain that public opinion would endorse the mission in Saving Private Ryan in the real world, for instance.</p>\n<p>You also mention the atomic bombings of Hiroshima and Nagasaki as an example of wartime consequentialism (which you’re contrasting with common-sense morality), but a majority of Americans endorse the bombings, and a lot of the people who oppose the bombings do so not because they think the ends never justify the means but because they disagree on whether Japan would have surrendered in the counterfactual.</p>\n<p>Finally, to draw on another wartime Spielberg film, it’s interesting that common-sense morality considers Oskar Schindler a hero. He worked in a role that many would consider ethically dubious and accumulated enough wealth (“I could have got more out… If I’d made more money”) and influence to save more than 1,000 lives.</p>\n<p>All of this is to say that we shouldn’t caricature common-sense morality and overstate its differences with utilitarianism. As Sidgwick recognised more than a century ago, they are more similar than some utilitarians and common-sense proponents think.</p>\n", "parentCommentId": null, "user": {"username": "JBentham"}}, {"_id": "rMiZnCCkmMb8kb6hR", "postedAt": "2024-01-14T06:53:30.214Z", "postId": "FfbtkKaPMpLWZzCpm", "htmlBody": "<p>Thanks for your comment! This helped me to think about my argument further.</p><p>I agree that the conception of common sense morality is quite underdeveloped here and can be interpreted in different ways. It acts somewhat as a placeholder and I would like to explore this a bit further with more time. Public opinion might not even be a reliable proxy for what I mean here. Maybe virtue ethics would have been a better choice than common sense morality. For instance, I think Oskar Schindler exhibited many important virtues (though my knowledge about the historical facts is limited), while at the same time thinking quite utilitarian.</p><p>I agree that in practice there are not as many differences between utilitrianism and common-sense morality (or virtue ethics) as one might initially anticipate. I think that most people in the EA movement already accept this, but I do think there are parts of the movement that neglect \"basic virtues\". See my disclaimer about the essay being more of a reminder than a critique.</p><p>Thanks for your reference to Schindler's List. That film is one of my all-time favorites and also highly interesting from an EA perspective. It might be nice to have a series of posts or something like that on exploring EA themes in popular movies, series, books, etc. (if this doesn't exist already).</p>", "parentCommentId": "jYsG4k6Xw8tTdxtFc", "user": {"username": "moritz-stumpe"}}, {"_id": "nZFhXnM6bg5brFLin", "postedAt": "2024-01-15T06:10:09.993Z", "postId": "FfbtkKaPMpLWZzCpm", "htmlBody": "<p>Great post and analogy, and a point I feel very important to keep reiterating! Something to also keep in mind is how what is considered to be common sense morally and the relative significance of different virtues can vary between cultures. As such, the extent to which this may differ from consequentialism and to which one may give weight to common sense morality will also vary.</p>\n", "parentCommentId": null, "user": {"username": "Aashish Khimasia"}}, {"_id": "uDLHSqFCxFEJyKA5r", "postedAt": "2024-01-16T04:10:35.893Z", "postId": "FfbtkKaPMpLWZzCpm", "htmlBody": "<p>While I've seen the war/EA analogy in a few places (Brian Tomasik <a href=\"https://reducing-suffering.org/on-triage/\">on triage</a>, <a href=\"https://slatestarcodex.com/2017/08/16/fear-and-loathing-at-effective-altruism-global-2017/\">Scott Alexander</a>'s \"<i>All of these Effecting Effective Effectiveness people don’t obsess over efficiency out of bloodlessness. They obsess because the struggle is so desperate, and the resources so few</i>\", Holly Elmore's post in your essay), I like how your essay explored this analogy more systematically than the others, and also came to a different conclusion, arguing instead for common sense morality even in wartime as a guardrail against abhorrent moral decision-making. I think it pairs well with Holden Karnofsky's reminder that <a href=\"https://forum.effectivealtruism.org/posts/T975ydo3mx8onH3iS/ea-is-about-maximization-and-maximization-is-perilous\">maximization is perilous</a>:&nbsp;</p><blockquote><p>Most EAs seem to take action by following a formula something like: “Take a job at an organization with an unusually high-impact mission, which it pursues using broadly accepted-by-society <i>means</i> even if its goals are unusual; donate an unusual amount to carefully chosen charities; maybe have some other relatively benign EA-connected habits like veganism or reducetarianism; otherwise, behave largely as I would if I weren’t an EA.”</p><p>I’m glad things are this way, and with things as they stand, I am happy to identify as an EA. But I don’t want to lose sight of the fact that <strong>EA likely works best with a strong dose of moderation</strong>. The core ideas on their own seem perilous, and that’s an ongoing challenge.</p><p>And I’m nervous about what I perceive as dynamics in some circles where people seem to “show off” how <i>little</i> moderation they accept - how self-sacrificing, “weird,” extreme, etc. they’re willing to be in the pursuit of EA goals. I think this dynamic is positive at times and fine in moderation, but I do think it risks spiraling into a problem.</p></blockquote><p>One thing that was not clear to me from your essay is the 'decision procedure' for when to use common sense morality vs the wartime/EA lens. I like 80K's \"<a href=\"https://80000hours.org/articles/what-is-social-impact-definition/#social-impact-is-about-making-the-world-better\">character, then constraints, then consequences</a>\" recipe here: first cultivate good character, then respect constraints e.g. the rights of others, and then do as much good as you can (although I would still be wary of obsessing over the last one too much, cf. Tyler Alterman's <a href=\"https://forum.effectivealtruism.org/posts/AjxqsDmhGiW9g8ju6/effective-altruism-in-the-garden-of-ends\">reflections</a> on balancing it with other wants and needs).</p><p>That said, what constitutes good character and what rights are worth respecting are also contextually contingent (culture, history, etc), sometimes in abhorrent ways; e.g. Kwame Anthony Appiah's <a href=\"https://www.washingtonpost.com/wp-dyn/content/article/2010/09/24/AR2010092404113.html\">reminder</a> that beating one's wife and children was considered a father's duty. This raises the question of whether we can <a href=\"https://www.cold-takes.com/future-proof-ethics/\">'future-proof' our ethics</a>, which forces a closer examination of what common sense morality prescribes (as JBentham mentioned upthread). I don't have any original insight here unfortunately despite having grappled with this set of questions for a while; my revealed-preferences-ethical stance is probably somewhere between the median do-gooder and the median EA as Holden sketched above...&nbsp;</p>", "parentCommentId": null, "user": {"username": "Mo Nastri"}}, {"_id": "eApJmeJoPtH2DgRJc", "postedAt": "2024-01-20T06:28:26.894Z", "postId": "FfbtkKaPMpLWZzCpm", "htmlBody": "<p>Thanks Aashish!</p><p>Important points and I agree that common sense morality is underdeveloped here. I suspect that there are some things that are relatively universal (like love and care for the family or generosity), but yes, the focus/weight of different aspects will vary.</p>", "parentCommentId": "nZFhXnM6bg5brFLin", "user": {"username": "moritz-stumpe"}}, {"_id": "j5Ck8fSdhzrhukHcK", "postedAt": "2024-01-20T07:06:17.791Z", "postId": "FfbtkKaPMpLWZzCpm", "htmlBody": "<p>Thanks for the links to those other pieces that address similar issues. I wasn't aware of most of them and they are suuuper interesting/relevant! Seems like I have some more reading and researching to do.</p><p>I think I agree with what you referenced from 80K. I see virtues and good character as the foundation on which you can then build in a more maximizing way. Satisfying certain personal needs and wants also fits into this foundational category. Of course, how exactly one balances these aspects highly varies from person to person.</p><p>And these decisions are highly context-dependent, yes. What I wrote is only a very high-level frame. In practice, it is of course very important to consider which aspects of \"common sense morality\" we really want to follow, just as it is very important to reflect on which personal needs and wants we should really follow or prioritize. This is a tricky balancing act that I am constantly trying to master. And social norms are always in flux as well.</p><p>For instance, I certaintly don't think it is okay to farm animals in ways that make them suffer unnecessarily, even though it is common practice and might be commonly seen as morally acceptable. This also means that I act in ways that deviate from the norm (i.e. plant-based consumption). But society around me is also adapting and some data suggests that a majority of people actually find the way we treat farmed animal abhorrent (they just don't act on it or rationalize their behavior).</p><p>All of this to say: Yes, moral common sense is vague and constantly changing. Yes, we always need to reflect on it and not follow the majority blindly. But I think it is beneficial to find certain core value and virtues to adhere by (and those should be ones where we are confident that they are not overall harmful).</p>", "parentCommentId": "uDLHSqFCxFEJyKA5r", "user": {"username": "moritz-stumpe"}}]