[{"_id": "CKsnB8xrLBNqaF3gM", "postedAt": "2022-12-20T02:52:39.426Z", "postId": "FFBYAB7g9JMsfGtiT", "htmlBody": "<p>Should grantees wait to be asked for the money or should they do so proactively?</p>", "parentCommentId": null, "user": {"username": "MarcusAbramovitch"}}, {"_id": "kiMBCm7nC6i3dCACX", "postedAt": "2022-12-20T03:23:50.366Z", "postId": "FFBYAB7g9JMsfGtiT", "htmlBody": "<p>I'd advise any sufficiently large grantee to speak to a lawyer on this.</p>", "parentCommentId": "CKsnB8xrLBNqaF3gM", "user": {"username": "Peter Berggren"}}, {"_id": "opkDvk6E49xoFApvS", "postedAt": "2022-12-20T03:25:14.220Z", "postId": "FFBYAB7g9JMsfGtiT", "htmlBody": "<p>For some who are planning to return funds, there <i>could</i> be tax advantages to doing this prior to December 31. (I should note that I have no inside knowledge about the process above and whether returning the monies prior to December 31 is even possible.)&nbsp;</p><p>In many parts of the US, you can get a referral to a lawyer for an initial consult at a low cost, and I think for some individuals and for-profits it may be worth a quick consult with a tax lawyer to ask whether there are different tax consequences for you of returning funds before vs. after December 31. I agree with Molly that you will want to work with a bankruptcy lawyer if you decide to return the money.</p><p>While I can't give any legal advice other than \"consult a lawyer who can represent you,\" one potential scenario that comes to mind involves any US persons for whom the grant would be considered self-employment income that would count for 2022. Having self-employment income in 2022 and an offsetting business loss when the funds are repaid in a later tax year could potentially lead to a situation where you have to pay self-employment taxes in 2022 (i.e., Social Security/Medicare) and won't get a benefit from the later-year repayment (for self-employment tax purposes). I'm not confident in that assessment, but do encourage people who think they &nbsp;would have to pay self-employment tax on an unreturned grant to consider talking to a tax lawyer about that specific point very soon.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Jason"}}, {"_id": "cpCBetyYkptJWo3Kb", "postedAt": "2022-12-20T03:33:16.617Z", "postId": "FFBYAB7g9JMsfGtiT", "htmlBody": "<p>Agree.&nbsp;</p><p>I do note that the press release states that: \"To the extent such payments are not returned voluntarily, the FTX Debtors intend to commence actions before the Bankruptcy Court to require the return of such payments, with interest <i>accruing from the date any action is commenced</i>.\" (emphasis mine). So we can seemingly rule out at least one potential downside of taking some time to think about this; the debtors are not going to seek interest for any period prior to the filing of an avoidance action.</p>", "parentCommentId": "kiMBCm7nC6i3dCACX", "user": {"username": "Jason"}}, {"_id": "RXjhfpy8NQq73LD4y", "postedAt": "2022-12-20T03:56:21.084Z", "postId": "FFBYAB7g9JMsfGtiT", "htmlBody": "<p>Thank you for the helpful announcement, and for all of your other work on this!</p>\n", "parentCommentId": null, "user": {"username": "joel_bkr"}}, {"_id": "CsWaGahqxJyjctBFp", "postedAt": "2022-12-20T18:14:33.443Z", "postId": "FFBYAB7g9JMsfGtiT", "htmlBody": "<p>Is it still true though that FTX Foundation Inc has not filed for bankruptcy? If that's true, returning any funds from FTX Foundation through this mechanism seems premature. But well, I'm no lawyer.&nbsp;</p>", "parentCommentId": null, "user": {"username": "daniel.stein@idinsight.org"}}, {"_id": "cw9nd9z8LHRmLEYgT", "postedAt": "2022-12-20T20:03:10.815Z", "postId": "FFBYAB7g9JMsfGtiT", "htmlBody": "<p>It is worth consulting with a bankruptcy lawyer before returning any funds (and I am not anyone's lawyer).</p><p>If it hasn't filed yet, the best case scenario I can see is that the FTX debtor entities have a bulletproof fraudulent conveyance claim against FTX Foundation / FTX Philantrophy (have seen both names, will call them F/P), and then can use the power of 11 USC 550(a)(2) to go after the grantees as the \"immediate or mediate transferee of such initial transferee [i.e., F/P].\" The claim against F/P seems bulletproof because at least several of its directors not only had actual knowledge of the fraudulent scheme, but actively participated in it. But the ultimate recipient of proceeds from any claim against the grantee would be the FTX entities themselves. Some grantees may have sufficient reasons to go ahead and return the monies to them now, whether for tax reasons or optics reasons.</p><p>I wouldn't expect any 501(c)(3) to be in the main bankruptcy filing at all -- as 501(c)(3)s, they are not \"owned\" by anyone in a beneficial sense, and -- especially under these circumstances -- it would be a conflict of interest for the same attorneys to represent the FTX entities and the 501(c)(3). Based on what has been said, it sounds like F/P had no independent funds or assets of its own; at best, the money was transferred from an FTX entity to F/P immediately before F/P sent it to the grantee. So it can't probably afford to hire attorneys (not that it has any potential defenses anyway) or file for voluntary bankruptcy, although there may be an involuntary petition filed against it at some point. So I wouldn't put too much weight on whether F/P has filed itself.</p>", "parentCommentId": "CsWaGahqxJyjctBFp", "user": {"username": "Jason"}}, {"_id": "iPdkv6yLwjqq5TSMh", "postedAt": "2022-12-20T20:11:44.734Z", "postId": "FFBYAB7g9JMsfGtiT", "htmlBody": "<p>Replying to my own comment, I suspect that the next step will be demand letters from the FTX bankruptcy estate to grantees. Those may come sooner than I had expected; I was somewhat surprised to see so much attention given to charitable/political donations so early in the process, given that the bulk of them are fairly small in the grand scheme of things. That could be due to the media attention given to these donations.</p><p>A few observations on how that could happen -- of course, I cannot predict or offer advice to any individual grantee, including an assessment of any potential defenses the grantee might have. If the Madoff matter is any guide, the estate may be willing to negotiate at that point. The Madoff trustee's stated <a href=\"https://www.madofftrustee.com/avoidance-actions-05.html\">goal </a>was \"to negotiate, not litigate, and [his procedures were] designed to facilitate the evaluation and administration of each case and encourage an out-of-court, amicable resolution.\" The Madoff trustee also dismissed, or decided not to bring, 533 avoidance actions on the basis of demonstrated <a href=\"https://www.madofftrustee.com/hardship-program-17.html\">hardship</a> (although I believe that was a novel program).&nbsp;</p><p>There was apparently some consideration of the \"whether former customers used any fictitious profits to pay taxes\" in assessing hardship claims (p. 40 of document below). I infer that the trustee was willing to consider that money spent to pay taxes on fictitious profits generated no benefit to the potential defendant (to the extent the potential defendant couldn't benefit from taking a tax loss in the year the loss was discovered). In contrast, the trustee doesn't generally seem to have been concerned about potential targets having spent money <i>to their benefit </i>that they wouldn't have spent but for receipt of fictitious profits.</p><p>You can read more about how clawbacks went down in the Madoff matter <a href=\"https://www.gao.gov/assets/gao-12-991.pdf\">here</a>. &nbsp;One outcome of note was that the trustee settled one major claim (Hadassah) for about 58% of the alleged avoidable amounts to prevent closure of a non-profit hospital. Also, there was $84 million from a charitable foundation that \"the Trustee did not seek to recover, because the funds had been donated to charitable causes\" (p. &nbsp;73); it is unclear whether this decision was made for legal reasons or because recovery from downstream charities who did not have any dealings with Madoff seemed inequitable. In general, the \"benchmark for good faith claims at 95 percent, in consideration of the comparative ease in making such cases\" (p. 77), but the discussion is focused on larger targets and I would guess that there was more flexibility for smaller ones since the costs of litigation do not scale linearly with amount demanded.</p>", "parentCommentId": "cpCBetyYkptJWo3Kb", "user": {"username": "Jason"}}, {"_id": "Rz7GFQn69M9fFc3qT", "postedAt": "2022-12-20T20:56:12.212Z", "postId": "FFBYAB7g9JMsfGtiT", "htmlBody": "<p>Thanks, super-helpful.&nbsp;</p>", "parentCommentId": "cw9nd9z8LHRmLEYgT", "user": {"username": "daniel.stein@idinsight.org"}}, {"_id": "bqWdJ4cEiyLgqt7qZ", "postedAt": "2022-12-21T06:19:45.886Z", "postId": "FFBYAB7g9JMsfGtiT", "htmlBody": "<p>If anyone consults a lawyer about this or starts the process with <a href=\"mailto:FTXrepay@ftx.us\">FTXrepay@ftx.us</a> , it could be very useful to many of us if you followed up here and shared what your experience of the process was like.</p>\n", "parentCommentId": null, "user": {"username": "Evan R. Murphy"}}, {"_id": "X6P4HEjheZryFBzXv", "postedAt": "2022-12-22T10:17:41.380Z", "postId": "FFBYAB7g9JMsfGtiT", "htmlBody": "<p>Thanks for this post.<br><br>Regarding your point that F/P doesn't have any potential defences, I would have thought that there's some chance F/P could argue:<br><br>1) Only a certain amount of money was received from FTX-proper within the 90 clawback window (impossible for us outsiders to know how much that would impact anything, if at all, but it could reduce the quantum from 'anything F/P has ever done' to 'the recent activity of F/P'), and<br><br>2) Notwithstanding the above, that the new value defense applies. That is, F/P was given money to do a particular thing (make grants) and that it discharged its obligation to do that thing (it made the grants). &nbsp;<br><br>Any views on that?<br><br>(Usual caveat of not being a US bankruptcy lawyer)&nbsp;</p>", "parentCommentId": "cw9nd9z8LHRmLEYgT", "user": {"username": "Greg S"}}, {"_id": "FQd5mDaLKjCGhYmwy", "postedAt": "2022-12-22T22:40:38.198Z", "postId": "FFBYAB7g9JMsfGtiT", "htmlBody": "<p>There are two mechanisms likely at play here -- fraudulent conveyance under 11 USC 548 and applicable non-bankruptcy law doesn't have a 90 day limit.</p>\n<p>I don't see how F/P provided new value <em>to the insolvent FTX parties</em>, or any value at all, in exchange for the transfers. The theory behind new value is that the other creditors are just as well off as they were before and so there has been no preference.</p>\n", "parentCommentId": "X6P4HEjheZryFBzXv", "user": {"username": "Jason"}}, {"_id": "pbxnL98NoyLEMy2zx", "postedAt": "2022-12-23T10:19:45.487Z", "postId": "FFBYAB7g9JMsfGtiT", "htmlBody": "<p>Which part of 11 USC 548 do you think applies?<br><br>It doesn't seem to me the payments were made to hinder / defraud (I guess that's a stage-of-mind point I don't have information on) ; the payments weren't undervalued ; FTX was solvent when (at least some of) the payments were made.</p>", "parentCommentId": "FQd5mDaLKjCGhYmwy", "user": {"username": "Greg S"}}, {"_id": "mN3MsPbuEPKdkqQer", "postedAt": "2023-02-02T17:44:34.330Z", "postId": "FFBYAB7g9JMsfGtiT", "htmlBody": "<p>Does anyone know if clawbacks and/or the voluntary return process apply to funds received from <i>individuals</i> formerly at FTX?</p>", "parentCommentId": null, "user": {"username": "Roxanne_Heston"}}]