[{"_id": "farycdjjAZb7yeDgb", "postedAt": "2023-08-25T14:18:44.235Z", "postId": "FfDu8HsNEzabqxKrs", "htmlBody": "<p>'It also takes suffering seriously, is overall reasonable, and lacks implausible implications such as when a view recommends that a clearly immoral act should be carried out.'&nbsp;<br><br>'In my view, there is no positive value and no positive quality of life, and there are no positive experiences.'<br><br>The view obviously does have \"implausible\" implications, if that means \"implications that conflict with what seems obvious to most people at first glance\". Few people agree that \"pleasure\" and \"happiness\" are totally worthless in themselves. They easily identify experiences they think are good! People easily classify some pleasures as more or less intense (insofar as that is being denied, which isn't completely clear.) I'm sure Knutsson would argue that his views aren't <i>really</i> implausible, because if people worked through his arguments in a rational and unbiased way, they'd see he was right. But that's what everyone else says about the counterintuitive parts of their theories too! <i>Maybe</i> people agree with the negative utilitarian idea that some suffering is so bad that no amount of pleasure can compensate for it, or don't really think its good to bring happy people into existence, but those are both distinct from the claim that no experiences are good for people who are already here.&nbsp;<br><br>For example people have given arguments with plausible premises for many \"harsh\" sounding classical utilitarian conclusions, even though those conclusions are not themselves plausible to most people. I.e. for example, (roughly, may not be completely accurate characterization of Chappel's argument) that it follows from the idea that it's never wrong to bring about the course of events that a benevolent impartial observer would desire happen on any reasonable moral theory to the conclusion that sometimes you should kill one to save five: <a href=\"https://rychappell.substack.com/p/a-new-paradox-of-deontology\">https://rychappell.substack.com/p/a-new-paradox-of-deontology</a> &nbsp;Nonetheless, I think it's still reasonable to call the conclusion of this argument an \"implausible\" consequence of Richard's views, for the same reason as 'there is no motion' is implausible even if you find the premises of some version of Zeno's paradox all look plausible. (Though obviously \"you should kill one to save five in some moral dilemmas\" or even \"no experiences are good\" are less implausible than \"motion\" doesn't exist.)&nbsp;<br><br>EDIT: I suppose if it turned out ordinary people sometimes accept moral antirealism, there might be a sense in which 'no experiences are good' is not \"implausible\". But that's not really much help to Knutsson, because I take it he wants his view to contain nothing implausible \"from a moral perspective\", however exactly we understand that.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Dr. David Mathers"}}, {"_id": "SD3D5g2LGrPb5GbXQ", "postedAt": "2023-08-25T16:36:22.993Z", "postId": "FfDu8HsNEzabqxKrs", "htmlBody": "<blockquote><p>The view obviously does have \"implausible\" implications, if that means \"implications that conflict with what seems obvious to most people at first glance\".</p></blockquote><p>I don't think what Knutsson means by \"plausible\" is \"what seems obvious to most people at first glance\". I also don't think that's a particularly common or plausible use of the term \"plausible\". (Some examples of where \"plausible\" and \"what seems obvious to most people at first glance\" plausibly come apart include what most people in the past might at first glance have considered obvious about the moral status of human slavery, as well as what most people today might at first glance say about the moral status of farming and killing non-human animals.)</p><blockquote><p>Few people agree that \"pleasure\" and \"happiness\" are totally worthless in themselves.</p></blockquote><p>Note that Knutsson does not deny that pleasure and happiness are worthwhile in the sense of being better for a person than unpleasure and unhappiness (<a href=\"https://www.simonknutsson.com/my-moral-view/#64_Reducing_problems_for_existing_individuals\">cf.</a> \"What about making individuals happier? Yes, we should do that.\"). Nor does he deny that certain experiences can benefit existing beings (e.g. by satisfying certain needs). What he argues against is instead that pleasure and experiential happiness are something \"above\" or \"on the other side of\" a completely <a href=\"https://www.simonknutsson.com/undisturbedness-as-the-hedonic-ceiling/\">undisturbed state</a>.</p><p>As for the claim about \"few people\" (and setting aside that majority opinion is hardly a good standard for plausibility, as I suspect you'd agree), it's not clear that this \"few people\" claim is empirically accurate, especially if it concerns the idea that pleasure isn't something \"above\" a <a href=\"https://www.simonknutsson.com/undisturbedness-as-the-hedonic-ceiling/#21_The_general_description_of_undisturbed_experiences\">completely</a> undisturbed state. The following is an <a href=\"https://www.utilitarianism.com/nu/nufaq.html#2.2.14\">apropos quote</a>:</p><blockquote><p>The intuition that the badness of suffering doesn’t compare to the supposed badness of inanimate matter (as non-pleasure) seems very common, and the same goes for the view that contentment is what matters, not pleasure-intensity [cf. Gloor, <a href=\"https://longtermrisk.org/tranquilism/#21_Contentment_as_the_perfect_state\">2017, sec. 2.1</a>]. There are nearly 1.5 billion Buddhists and Hindus, and while Buddhism is less explicit and less consequentialist than negative utilitarianism, the basic (though not uniform) Buddhist view on how pleasure and suffering are being valued is very similar to negative utilitarianism; Hinduism contains some similar views. Ancient Western philosophers such as Epicurus and some Stoics proposed definitions of “happiness” in terms of the absence of suffering.</p></blockquote><p>(On Buddhism and Epicureanism, see e.g. Breyer, <a href=\"https://blogs.dickinson.edu/buddhistethics/files/2015/12/Breyer-Axiology-final.pdf\">2015</a>; Sherman, <a href=\"https://ore.exeter.ac.uk/repository/bitstream/handle/10871/32103/ShermanT.pdf\">2017</a>; and the recent review of <a href=\"https://forum.effectivealtruism.org/s/MBadsrYLmzLNmYjaj/p/oJJLgJTsQKX3oQ9xw\">minimalist views of wellbeing</a> by Teo Ajantaival.)&nbsp;</p>", "parentCommentId": "farycdjjAZb7yeDgb", "user": {"username": "MagnusVinding"}}]