[{"_id": "4MHBrsDkacHADMBZ5", "postedAt": "2022-12-15T21:11:23.241Z", "postId": "FFY8zfkQq3qdELyvm", "htmlBody": "<p>I like the emphasis on working hard and I think working longer hours is good. Something happens when you start working 60+ hours a week where (in my experience) you begin to have blinders to everything else outside of that work.</p>\n<p>For me it becomes the only thing I think about for weeks on end, and it becomes something in my life that I’m subconsciously working on even when I’m not doing the task. Like the mathematician who gets the answer to a proof she’s working on when swimming laps at the pool.</p>\n<p>But I’m very very pessimistic about hard stimulants. Nicotine, caffeine, adderall, etc have diminishing returns and tolerance increases the dose required to get the originally stimulating effects. We have heard it before but it is worth mentioning. I would not mentor my bright 16 year old cousin to become reliant on any stimulant.</p>\n<p>Weight lifting is underrated. Consciously placing yourself in positive environments is underrated. Maintaining strong mutually beneficially relationships is underrated. And eating a wide variety of fruits and vegetables is underrated.</p>\n", "parentCommentId": null, "user": {"username": "Puggy Knudson"}}, {"_id": "qgmS7QMb96tpGqcsh", "postedAt": "2022-12-15T21:25:32.707Z", "postId": "FFY8zfkQq3qdELyvm", "htmlBody": "<p>I encourage readers to consider whether they are the correct audience for this advice. As I understand it, this advice is directed at those for whom all of the following apply:<br><br>- Making a large impact on the world is overwhelmingly more important to you than other things people often want in their lives (such as spending lot of time with friends/family, raising children, etc.)<br>- You have already experienced a normal workload of ~38h per week for at least a couple of years, and found this pretty easy/comfortable to maintain<br>- You generally consider yourself to be happy, highly composed and emotionally stable. You have no history of depression or other mood-related dissorders.<br><br>If any of these things do not apply, this post is not for you! And it would probably be a huge mistake to seek out an adderall prescription.&nbsp;<br>&nbsp;</p>", "parentCommentId": null, "user": {"username": "Xavier_ORourke"}}, {"_id": "3zBCrCWhCAz7LxBZC", "postedAt": "2022-12-15T22:30:40.830Z", "postId": "FFY8zfkQq3qdELyvm", "htmlBody": "<p>Agree with Xavier's comment that people should consider <a href=\"https://slatestarcodex.com/2014/03/24/should-you-reverse-any-advice-you-hear/\">reversing the advice</a>, but generally confused/worried that this post is getting downvoted (13 karma on 18 votes as of this writing). In general, I want the forum to be a place where bold, truth-seeking claims about how to do more good get attention. My model of people downvoting this is that they are worried that this will make people work harder despite this being suboptimal. I think that people can make these evaluations well for themselves, and that it's good to present people with information and arguments that might change their mind. Just as \"donate lots of your money to global charities\" and \"stop buying animal products\" are unwelcome to hear and might be bad for you if you take them to extremes in your context but are probably good for the world, \"consider working more hours\" could be bad in some cases but also might help people learn faster and become excellent at impactful work, and we should be at least be comfortable debating whether we're at the right point on the curve.&nbsp;</p>", "parentCommentId": null, "user": {"username": "levin"}}, {"_id": "APnwkbKeotN6B4jmQ", "postedAt": "2022-12-16T01:04:57.477Z", "postId": "FFY8zfkQq3qdELyvm", "htmlBody": "<p>I agree that the forum should be a place for bold, truth-seeking claims about how to do more good. However, I think recommending people try taking stimulants is quite different to recommending people try working longer hours. The downside risks of harm are higher and more serious, and more difficult for readers to interpret for themselves. I don't think this post is well argued, but the part on stimulants is particularly weak.</p>", "parentCommentId": "3zBCrCWhCAz7LxBZC", "user": {"username": "BenStewart"}}, {"_id": "WoEj97x5A8fiRPmGD", "postedAt": "2022-12-16T02:41:12.757Z", "postId": "FFY8zfkQq3qdELyvm", "htmlBody": "<blockquote>\n<p>One extremely under-rated impact of working harder is that you learn more. You have sub-linear short-term impact with increasing work hours because of things like burnout, or even just using up the best opportunities, but long-term you have super-linear impact (as long as you apply good epistemics) because you just complete more operational cycles and try more ideas about how to do the work.</p>\n</blockquote>\n<p>Working more hours could help learning in the sense of helping you collect data faster.  But if you want to learn from the data you already have, I'd suggest working fewer hours (or taking a vacation) to facilitate a reflective mindset.</p>\n<p>I had a friend who took a stimulant every day, working at a startup, only to wake up many months later and realize the startup wasn't going anywhere &amp; he'd wasted a lot of time.  <a href=\"https://www.lesswrong.com/posts/4psQW7vRwt7PE5Pnj/too-busy-to-think-about-life\">Beware tunnel vision</a>.  Once you're at 40 hours a week, it's generally more valuable to work smarter than work harder IMO.</p>\n", "parentCommentId": null, "user": {"username": "John_Maxwell_IV"}}, {"_id": "XTeoYwdeRiRazsNGv", "postedAt": "2022-12-16T06:30:58.915Z", "postId": "FFY8zfkQq3qdELyvm", "htmlBody": "<p>Even if all those things apply ... this post may not be for you! Last year I tried to replace sleep with caffeine, and it did not go well. Even if you think you're happy and emotionally stable, you may discover that stimulants are anxiogenic for you, and you may be dumb enough (i.e., me) not to make that connection for a year.&nbsp;</p><p>Stimulants, at least for me, are much better at making me <i>feel</i> productive than increasing my total output. I regularly wasted 3-6 hours chunks plumbing the depths of a rabbit hole that unstimulated me would have rightly avoided. A moderate caveat emptor here.&nbsp;</p>", "parentCommentId": "qgmS7QMb96tpGqcsh", "user": {"username": "JoelMcGuire"}}, {"_id": "2fM8HzJpEcHrXLrLn", "postedAt": "2022-12-16T09:35:59.373Z", "postId": "FFY8zfkQq3qdELyvm", "htmlBody": "<p>I'd be careful with this sort of advice.&nbsp;<br><br>All I have to offer is my personal story which is of course very little evidence (though I've seen similar stories play out among many of my friends and colleagues). I'll first talk about my experience with stimulants and then about my experience with pushing myself to work more.<br><br>In my mid twenties I basically followed the same sort of logic and started taking amphetamines (very reasonable dosages, not more than twice a week). Every skeptic I told, among other things, the story of Paul Erdős who took amphetamines practically <a href=\"https://en.wikipedia.org/wiki/Paul_Erd%C5%91s#Personality\">every day for decades</a> and was perhaps the most productive mathematician ever. (In fact, Erdős was so productive that his friends created the widely used <a href=\"https://en.wikipedia.org/wiki/Paul_Erd%C5%91s#Erd%C5%91s_number\">Erdős number</a> which \"describes a person's degree of separation from Erdős himself, based on their collaboration with him, or with another who has their own Erdős number.\")&nbsp;<br><br>Well, for me personally this worked for a few months after which side effects started to slowly show up (low mood, fatigue, insomnia, etc.). It was so gradual that I needed another few months to attribute them to amphetamines. It was also very much unlike how I expected side effects and withdrawal to manifest. It's (for many people) not this immediate thing that happens after the first time you take amphetamines. It's usually more gradual than that. Several of my friends also experimented with amphetamine for productivity-enhancing effects, for none of them it turned out positively.&nbsp;<br><br>That being said, I've had somewhat better experiences with Ritalin (though I still often wonder whether it was net positive). And I made much better experiences yet with MAO inhibitors like tranylcypromine (which still have lots of side effects). (I might write more on this in the future.)<br><br>Regarding pushing yourself to work more: I think in my case this backfired extremely hard and caused me to burnout. In my twenties I always had this suspicion that talk about burnout is widely exacerbated, perhaps especially by lazy or selfish people who want to work less. (I was pretty stupid.) In my experience, especially if you are a researcher, pushing yourself hard doesn't work that well, at least not in the long &nbsp;term. Your best ideas are probably two orders of magnitude more important than your average idea. If you start caring primarily about how many hours you work, you risk working on ideas that are easy to write about or execute. Coming up with good ideas often doesn't look like work at all. You might just be reading for your own pleasure or out of curiosity. That's at least how it worked for me.&nbsp;(As an example, I've had most of the core ideas for <a href=\"https://forum.effectivealtruism.org/posts/LpkXtFXdsRd4rG8Kb/reducing-long-term-risks-from-malevolent-actors\">this article</a> after I had reduced my working hours substantially.)<br><br>I guess if you have (very) short timeline, are generally quite young, healthy and robust, I'd be much more optimistic about such strategies. And as the case of e.g. Erdős shows, outliers do exist.</p>", "parentCommentId": null, "user": {"username": "David_Althaus"}}, {"_id": "bf6xFGdiJgy3ktFqk", "postedAt": "2022-12-16T13:57:40.146Z", "postId": "FFY8zfkQq3qdELyvm", "htmlBody": "<blockquote><p>\"I agree<a href=\"https://lynettebye.com/blog/2020/3/20/how-long-can-people-usefully-work\">&nbsp;<u>with Lynette Bye</u></a> that most of the working hours literature is poor—I'm even more skeptical than she is about agenda-driven research on Gilded Age factory workers—and that gaining an impression from anecdotes of top performers is better. \"</p></blockquote><p>I am worried about relying on anecdotes of top performers as this has an obvious selection effect neglecting the (probably sizeable) group of people that tried stimuant-driven work binges and simply burned out.<br>&nbsp;</p><p>This is hand-wavingly addressed later</p><blockquote><p>\"A third reason is that burnout risk might be overrated if most of your impact comes from the small chance of you being a very high performer, perhaps because being 99th percentile is 100+ times better than being 90th percentile. This makes studying the habits of top performers even more useful because the survivorship bias is less important.\"</p></blockquote><p>First, I think it seems unattractive to me to have EA become a large group of amphetamine-fueled workaholics with high burnout rates - not even because of optics, but because of the immense suffering of those that will burn out.</p><p>Secondly, this neglects how many of the high-impact performers would have been high-impact absent amphetamines or excessive working hours.&nbsp;</p><p>Third, it strikes me as implausible that the \"99th percentile is 100+ times better than being 90th percentile\" for the target groups of \"operations, entrepreneurship, or community-building \". I did a tad of community-building myself, and would be very surprised if for a community-builder, adding 20 hours of work a week even approximates the value of the first 40 hours spent on community-building, and honestly shocked if it outsized it by a factor of 100.</p><p>Lastly and most importantly, it is entirely unclear to me in what relation the \"small chance of being a very high performer\" and the \"chance of burnout\" is. It seems entirely plausible to me that the chance of me becoming Erdos-like <i>because</i> I take stimulants and work a ton is thousands of times less likely than the chance that I'll burn out because I take stimulants and work a ton.&nbsp;</p><p>&nbsp;</p><p><i>I also generally think that health-related advice that goes against widely-held priors should at least attempt to quantify risks and benefits using actual numbers, rather than waving hands.</i></p>", "parentCommentId": null, "user": {"username": "mhendric"}}, {"_id": "8xHdKpXNsdwDtzTpH", "postedAt": "2022-12-16T22:45:03.330Z", "postId": "FFY8zfkQq3qdELyvm", "htmlBody": "<blockquote>\n<p>And it would probably be a huge mistake to seek out an adderall prescription.</p>\n</blockquote>\n<p>...unless you have other reasons to believe that an Adderall prescription might be good for you. Saliently: if you have adhd symptoms.</p>\n", "parentCommentId": "qgmS7QMb96tpGqcsh", "user": {"username": "Lukas_Finnveden"}}, {"_id": "eZfKomsYTMFfMEHng", "postedAt": "2022-12-17T02:19:38.260Z", "postId": "FFY8zfkQq3qdELyvm", "htmlBody": "<p>This post with its comments is a valuable discussion.</p>\n<p>The post on its own with its lack of cautions and provisos is potentially harmful to many readers, and high upvotes may lead readers to trust it too much. Strong downvote for these reasons.</p>\n", "parentCommentId": null, "user": {"username": "Chriswaterguy"}}, {"_id": "Wv5LurguBQmAx5EEh", "postedAt": "2022-12-17T03:07:42.893Z", "postId": "FFY8zfkQq3qdELyvm", "htmlBody": "<p>I'd say the largest problem is I see the red flag of selection bias and using anecdotes and intuition as reliable evidence. This is dangerous, even though I agree with the takeaway that risks should probably be taken.</p>\n", "parentCommentId": "eZfKomsYTMFfMEHng", "user": {"username": "Sharmake"}}, {"_id": "ScYWuie8GrddEYAxg", "postedAt": "2022-12-17T10:30:55.416Z", "postId": "FFY8zfkQq3qdELyvm", "htmlBody": "<blockquote>\n<p>Something happens when you start working 60+ hours a week where (in my experience) you begin to have blinders to everything else outside of that work.</p>\n</blockquote>\n<blockquote>\n<p>Maintaining strong mutually beneficially relationships is underrated. And eating a wide variety of fruits and vegetables is underrated.</p>\n</blockquote>\n<p>Do you still do the latter when you are in a 60+ h/week period?</p>\n", "parentCommentId": "4MHBrsDkacHADMBZ5", "user": {"username": "Imma Six"}}, {"_id": "AQTTRYWKTxR2ys2RT", "postedAt": "2022-12-17T20:44:26.519Z", "postId": "FFY8zfkQq3qdELyvm", "htmlBody": "<p>Yea absolutely. It takes planning and discipline but you can go to the gym after a 10 or 12 hour work day. occasionally having dry snacks like nuts or Clif bars helps when working 50-60 hours. I like picking up fruits from the store every third day or so.</p>\n<p>I think the wheels come off at 70+, and the type of work that can be done for 70+ hours is probably work that isn’t cognitively demanding.</p>\n<p>50-68 hours is my sweet spot where I don’t compromise my diet and I can workout 4 times a week</p>\n", "parentCommentId": "ScYWuie8GrddEYAxg", "user": {"username": "Puggy Knudson"}}, {"_id": "nNuQgHd8DCS58PbQt", "postedAt": "2022-12-18T08:54:57.381Z", "postId": "FFY8zfkQq3qdELyvm", "htmlBody": "<p>I am impressed and wish I could do that!</p>\n<p>This may not apply to highly intellectual or creative work (as in David__Althaus' comment), but I don't have that kind of job. Tunnel vision is still a potential downside, but that may be mitigated by devoting a part of your work time to maintaining your epistemics.</p>\n", "parentCommentId": "AQTTRYWKTxR2ys2RT", "user": {"username": "Imma Six"}}, {"_id": "CaEbefsjZNEdScYz5", "postedAt": "2022-12-18T09:19:15.392Z", "postId": "FFY8zfkQq3qdELyvm", "htmlBody": "<p>It is really unfortunate that the existing evidence about work hours as mentioned in <a href=\"https://lynettebye.com/blog/2020/3/20/how-long-can-people-usefully-work\">Lynette's post</a> is so weak and we need to make decisions based on anecdotical evidence because there is nothing better. It seems to me quite an important topic to study and I wonder why it is not happening.</p>\n<p>Maybe it's just <em>really hard</em> to study properly but even then it might be worth it.</p>\n", "parentCommentId": null, "user": {"username": "Imma Six"}}, {"_id": "jEYmjoBZnqLPv8dWy", "postedAt": "2022-12-18T20:20:46.007Z", "postId": "FFY8zfkQq3qdELyvm", "htmlBody": "<p>Would be interested in your experience with tranylcypromine; it sounds to me to be <em>way</em> more dangerous than amphetamines.</p>\n", "parentCommentId": "2fM8HzJpEcHrXLrLn", "user": {"username": "HenryStanley"}}, {"_id": "9GkT38ERyppY4MYEZ", "postedAt": "2022-12-18T20:21:49.006Z", "postId": "FFY8zfkQq3qdELyvm", "htmlBody": "<p>I’m not convinced you can really replace sleep with caffeine in any meaningful way; tolerance to caffeine builds so quickly as to make it unuseful after a couple of weeks.</p>\n", "parentCommentId": "XTeoYwdeRiRazsNGv", "user": {"username": "HenryStanley"}}, {"_id": "pADLj6khn6qjAfzi4", "postedAt": "2022-12-18T20:22:55.701Z", "postId": "FFY8zfkQq3qdELyvm", "htmlBody": "<blockquote>\n<p>You generally consider yourself to be happy, highly composed and emotionally stable. You have no history of depression or other mood-related dissorders</p>\n</blockquote>\n<p>Some stimulants seem to work well for depression, however: <a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6375494/\">https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6375494/</a></p>\n", "parentCommentId": "qgmS7QMb96tpGqcsh", "user": {"username": "HenryStanley"}}, {"_id": "jEebxi5BXkNbgpkHn", "postedAt": "2022-12-18T20:56:24.839Z", "postId": "FFY8zfkQq3qdELyvm", "htmlBody": "<p>If you're not the right person for the article, I'd instead recommend this post on <a href=\"https://forum.effectivealtruism.org/posts/WQfsapNHjMkBikyGJ/sustained-effort-potential-and-obligation\">Sustained effort, potential, and obligation</a>. I've found it's given me a helpful framework for making sense of my own limits on working hours, and you may also find it useful.</p><p>I admit that reading this post also stirred up some feelings of inadequacy for me—because, unlike all those CEOs and great men of history, I have actually a pretty low-to-average limit on how much sustained effort my brain will tolerate in a day. If you find yourself with similar feelings (which might be distressing, perhaps even leading you to spiral into self-hatred and/or seek out extreme measures to 'fix' yourself), the best antidote I've found for myself is <a href=\"https://slatestarcodex.com/2015/01/31/the-parable-of-the-talents/\">The Parable of the Talents</a> by Scott Alexander. (TLDR: variation in innate abilities is widespread, and recognizing and accepting the limits on one's abilities is both more truthful and more compassionate than denying them.)</p>", "parentCommentId": "qgmS7QMb96tpGqcsh", "user": {"username": "ryanywho"}}, {"_id": "AXfnLhGhCGnRgbYKJ", "postedAt": "2022-12-18T21:49:14.936Z", "postId": "FFY8zfkQq3qdELyvm", "htmlBody": "<p>I think there's <a href=\"https://www.reuters.com/article/us-shire-vyvanse/shires-adhd-drug-vyvanse-fails-in-trial-to-treat-depression-idUKBREA1521I20140206\">conflicting </a>pieces of <a href=\"https://www.thecarlatreport.com/blogs/3-carlat-psychiatry-webinars/post/4197-amphetamine-vs-methylphenidate#:~:text=than%20with%20methylphenidate.-,Complex%20comorbidities,-These%20are%20often\">evidence</a> on this <a href=\"https://pubmed-ncbi-nlm-nih-gov.proxy.library.georgetown.edu/27807011/\">topic</a>, and most recent studies focus on stimulants as add-ons to antidepressants, rather than as the primary treatment for depression.</p><p>So, if you think you might be some level of depressed (without having ADHD), I think it's sound advice to avoid fixating on stimulants as your most promising option—but know you <i>do</i> have lots of effective options to try that might really improve your wellbeing and productivity, such as those discussed <a href=\"https://lorienpsych.com/2021/06/05/depression/\">here</a> and described by community members <a href=\"https://forum.effectivealtruism.org/posts/hpvs9g4TEEhRkogBC/my-positive-experience-taking-the-antidepressant-wellbutrin\">here</a> and <a href=\"https://forum.effectivealtruism.org/posts/Eq8nwNPNhfXvt2TWj/my-experience-experimenting-with-a-bunch-of-antidepressants\">here</a>.</p>", "parentCommentId": "pADLj6khn6qjAfzi4", "user": {"username": "ryanywho"}}, {"_id": "pcknqRpmYJgWmuRvM", "postedAt": "2022-12-19T16:29:58.835Z", "postId": "FFY8zfkQq3qdELyvm", "htmlBody": "<p>Good point about stimulants mostly being useful as adjuncts and not as monotherapy.</p>", "parentCommentId": "AXfnLhGhCGnRgbYKJ", "user": {"username": "HenryStanley"}}, {"_id": "wDvD5jDuLRYSEbHCz", "postedAt": "2022-12-28T07:59:30.666Z", "postId": "FFY8zfkQq3qdELyvm", "htmlBody": "<p>Did a Bahamian prison cell write this</p>", "parentCommentId": null, "user": {"username": "Sabs"}}]