[{"_id": "paFfwX2sbjwvqe6Fz", "postedAt": "2023-09-07T09:11:07.438Z", "postId": "FHGk5uqpSsjemw4mL", "htmlBody": "<p>Hi Sean,</p><p>Thanks for the write-up and opening the discussion. I agree that material degradation is something that should be thoroughly investigated. Caveat: I'm not a polymer engineer and have read/seen a few papers/talks on the topic, but I'm by no means deeply familiar with all the material types, etc.</p><p>Re. the Boeing study (<a href=\"http://www.boeing.cn/cti/downloads/Boeing-Compatibility-of-Aircraft-Interior-Surfaces-with-222-nm-Far-UV-Light-Exposure.pdf\">working link</a>, btw): The study used fairly low doses <i>per disinfection cycle</i> but simulated 25 years of service, totalling &gt;108 J/cm² of far-UV exposure. Still just about a third of the bus study exposure, but already in the dose range where the bus study measured only marginal effects of additional far-UV on colour or mechanical properties.&nbsp;</p><p>Still, I don't find myself overly worried (but again, not an expert and I also don't have regulator-brain, so interpret this accordingly).</p><p>Far-UV doesn't penetrate deeply and will likely not affect the mechanical properties of solid plastic objects. The bus study found effects in thin sheets of fibre-reinforced materials (in some directions), and I don't doubt that, but in what situations is a 10% decrease in failure strength of thin polymer layers that relevant for consumers or regulators? I genuinely don't know, and there might be specific circumstances in which parts must be replaced more frequently, or the plastic type needs to be switched, but I don't think this will matter a lot in most settings. E.g., Boeing found \"no adverse impact on the mechanical properties of thermoplastic and textile materials\" in the airplane setting at the dose where the bus study already saw decreased tensile strength. I'm very interested in hearing counterexamples, though!&nbsp;</p><p>But ultimately, both Boeing and the bus study have only tested the materials present in those surroundings. Looking around in my office or the office of friends, I'm not sure how many of the materials overlap. There's some testing behind closed doors from lamp manufacturers, but no public database of common materials and the impact of far-UV on them. We eventually want and need such a database to make the far-UV implementation as pain- and seamless as possible for building operators, etc., but I'm not sure how much the average office worker or regulator cares if the back cover of their monitors starts yellowing faster (like you said, open question: Market research opportunity!).&nbsp;</p><p>And in the beachhead markets for far-UV (long-term care homes, ICUs), the cost–benefit calculus is favouring far-UV so much that a premium for far-UV coatings will happily be paid if yellowing is even something they care about. And the plethora of single-use plastics are not affected.&nbsp;</p>", "parentCommentId": null, "user": {"username": "JasperGeh"}}, {"_id": "qqWwDLdzZ2ZoRC7xy", "postedAt": "2023-09-07T09:27:58.394Z", "postId": "FHGk5uqpSsjemw4mL", "htmlBody": "<p>Excellent and timely analysis!&nbsp;<br><br>Looking at proposals to use far-UVC, I've seen a range from saying it could be permanently on to saying that it could be turned on in specific circumstances, such as a pandemic. In addition to plastics, there were concerns about eye-damage, for example, which needed more research.&nbsp;<br><br>I could also imagine where it could be turned on intermittently (e.g. 1 minute every hour, during busy periods only, ...) to maximise the benefit while minimising the damage.</p><p>IMHO your analysis probably suggests that far-UVC for always-on systems is not going to work without some important (and costly, and slow) work. But probably in a pandemic context where the need is benefit is vastly increased and the duration is much shorter, it could still work.&nbsp;<br>&nbsp;<br>All that said, I fully agree with your recommendation that this is an area that needs more study, so that at least we have the relevant information, and potentially have identified some solutions, by the time far-UVC deployment broadly becomes a realistic option.&nbsp;</p><p>For example, maybe there are options of UV-absorbing coatings (like sun-screen, but more durable) for particularly sensitive components like wires or plugs. I don't know, but the right research program should answer these questions.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Denis "}}, {"_id": "Qd4m6sbk5ghTmxL3v", "postedAt": "2023-09-08T00:33:44.072Z", "postId": "FHGk5uqpSsjemw4mL", "htmlBody": "<p>Thanks for the comment Denis.</p><p>I have the same impression about on time. The idea of different duty cycles for different contexts is interesting. I could imagine a useful study looking at the effect of different duty cycles on plastic degradation and pathogen impression to identify the tradeoffs between the two. Perhaps there's a happy medium if you tie the duty study to building occupancy (otherwise a &lt; 100% duty cycle of a full-power far-UVC system is the equivalent to a 100% duty cycle of a lower-power far-UVC system).</p><p>My feeling is that it will be hard to sell far-UVC as a tool only used in pandemics because that will limit the shorter-term upsides of the tech. For example, the cost savings from reducing employee sick leave in an office could be the most significant selling point for the tech in that context. Without that short-term upside, it begins to look more like an 'in case of emergency' system, much like fire sprinklers and extinguishers -- many people only install them because it's required by building code.&nbsp;<br><br>On eye/skin damage, I found <a href=\"https://www.tandfonline.com/doi/full/10.1080/10643389.2022.2084315\">this article</a> informative. My takeaway was that permanent eye/skin damage shouldn't be a concern but more studies are required to develop a more comprehensive understanding of the effects just in case (and also to help the tech pass regulation).<br><br>Coatings could work for retrofitting. There are also ways to make plastics UV stable at the point of manufacturing through additives to the plastic. So maybe retrofitting with UV-stable plastics in critical infrastructure contexts (ie. hospitals, airports, etc.) could be an option if UV stability is indeed a concern. I agree that the right research plan would answer these sorts of questions though.</p>", "parentCommentId": "qqWwDLdzZ2ZoRC7xy", "user": {"username": "Sean Lawrence"}}]