[{"_id": "8qRa8GhXeDXfpFF2r", "postedAt": "2023-09-11T14:26:37.426Z", "postId": "Fhoq7tP9LYPqaJDxx", "htmlBody": "<p>Thank you for sharing these important information. It is important to remind people how important this issue is.</p><p>My extra worry about the consumption of aquatic animals is that they seem to be much less replaceable than terrestrial animal meats and eggs and milk by plant-based mock meat or cultivated meat (PB/CM). In fact for some popular shrimp dishes I just can't see how PB/CM will <i>ever </i>replace the shrimps there in large scale, such as <a href=\"https://travelfoodatlas.com/thai-goong-ten-dancing-shrimp-recipe\">live shrimp salad</a>, <a href=\"https://www.sushifaq.com/sushi-sashimi-info/sushi-item-profiles/amaebi-sweet-shrimp/\">shrimp sashimi</a> (traditionally served with the tails intact, sometimes even the heads), <a href=\"https://www.sohu.com/a/279697961_439025\">Chinese style steamed</a> and <a href=\"https://www.hk01.com/%E6%95%99%E7%85%AE/388705/%E8%9D%A6%E9%A3%9F%E8%AD%9C-%E8%92%9C%E9%A6%99%E7%89%9B%E6%B2%B9%E8%9D%A6%E5%BD%88%E7%89%99%E9%A6%99%E5%99%B4%E5%99%B4-%E9%9B%B6%E5%A4%B1%E6%95%97%E5%AE%B4%E5%AE%A2%E8%8F%9C10%E5%88%86%E9%90%98%E7%85%AE%E5%A5%BD\">fried shrimps</a>, and <a href=\"https://amonblog.com/blog/post/26818886\">hotpots with shrimps</a>.&nbsp;</p><p>It seems to me the solution of some forms of meat eating has to be other than PB/CM.&nbsp;</p>", "parentCommentId": null, "user": {"username": "tseyipfai@gmail.com"}}, {"_id": "X3eg7N7gXY4xYRfyc", "postedAt": "2023-09-11T19:12:39.458Z", "postId": "Fhoq7tP9LYPqaJDxx", "htmlBody": "<p>As a one-liner, would it be accurate to say that the (vast) majority of individual animals (directly) used/exploited by humans per year probably become shrimp paste?</p>\n<p>I'm guessing we aren't \"using\" nematodes, worms or arthropods not included above in larger numbers, at least not directly. Obviously they're affected by and involved in agriculture, and may be affected by fishing.</p>\n<p>And I guess it's also useful to distinguish time spent exploited/used, because an individual wild-caught animal won't be under direct human control nearly as long as the average farmed animal. Farmed insects would plausibly already dominate if you weigh by time under direct human control while alive, and insect farming is growing quickly.</p>\n", "parentCommentId": null, "user": {"username": "MichaelStJules"}}, {"_id": "NGhMCDevyza7BMfgm", "postedAt": "2023-09-11T21:51:55.087Z", "postId": "Fhoq7tP9LYPqaJDxx", "htmlBody": "<p>Shouldn't you normalize for brain tissue?  So instead of counting individuals, sum the entire mass of the brains of the animals humans breed for consumption.</p>\n<p>A \"sapience estimate\" would also be useful. Smaller brains are likely less capable of sapience and it should be possible estimate the scaling empirically.</p>\n<p>How do you handle ecological displacement?  Every shrimp farm occupies a chunk of biomass and ocean territory that other animals would have lived in.  So you're substituting billions of shrimp lives lived for billions of displaced other animals and insects.</p>\n<p>So if you got an animal rights bill passed that made illegal all forms of animal protein, the fallow areas where the farms were would now have other species living there.  These species lives are \"nasty brutish and short\", as whatever species occupy where the farm was\nwill likely have short lifespan and face ocean predators.   Maybe the lack of nets to keep them in the farm will make their lives better.</p>\n<p>Though given the limited cognitive capacity of shrimp I wonder if they can even be upset by a large enough cage. They find one edge of it, but there are barriers in the natural ocean, and then do they \"know\" they are trapped when they wander to the other side of the cage they are in and find another impossible barrier?  I don't know the answer but this could be investigated empirically.</p>\n", "parentCommentId": null, "user": {"username": "Gerald Monroe"}}, {"_id": "ijt4bWcKxZAbdykb7", "postedAt": "2023-09-13T11:09:15.166Z", "postId": "Fhoq7tP9LYPqaJDxx", "htmlBody": "<p>I agree: it definitely seems unlikely that plant-based alternatives could substitute for something like live shrimp salad. But note that the majority (~19 trillion) of shrimp killed are <i>A.&nbsp;japonicus</i> (akiami paste shrimp). Relative to other products, paste texture is less complex and the animal origin perhaps less culturally salient; I bet many consumers would substitute shrimp paste for plant-based paste.</p><p>(I work w/ Daniela and Elisa but wasn't involved in this report)</p>", "parentCommentId": "8qRa8GhXeDXfpFF2r", "user": {"username": "Ben Stevenson"}}, {"_id": "xzzDi9WYiPCrZuoFx", "postedAt": "2023-09-13T12:58:46.281Z", "postId": "Fhoq7tP9LYPqaJDxx", "htmlBody": "<p>Hi all! Thanks for your comments :) While Daniela and I can't thoroughly answer them this week, we will get back to you as soon as possible starting next week.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Elisa Autric"}}, {"_id": "fsdj4kbLzEbzyxEcY", "postedAt": "2023-09-13T19:00:38.840Z", "postId": "Fhoq7tP9LYPqaJDxx", "htmlBody": "<p>I feel much better hearing this! And I do actually agree with you. Thank you!</p><p>I would add that besides PB paste. Another option is to use CM shrimp tissues to make the pastes.</p>", "parentCommentId": "ijt4bWcKxZAbdykb7", "user": {"username": "tseyipfai@gmail.com"}}, {"_id": "xTJNXZNqaeAGAYSPu", "postedAt": "2023-09-14T07:00:28.504Z", "postId": "Fhoq7tP9LYPqaJDxx", "htmlBody": "<p>Thanks for sharing!</p><blockquote><p>At this moment, the problem of shrimp production is greater in scale–i.e., number of individuals affected–than the problem of insect farming, fish captures, or the farming of any vertebrate for human consumption. Thus, while the case for shrimp sentience is weaker than that for vertebrates and other decapods, the expected value of helping shrimp and prawns might be higher than the expected value of helping other animals.</p></blockquote><p>I Fermi <a href=\"https://forum.effectivealtruism.org/posts/ayxasxhHWTvf6r5BF/scale-of-the-welfare-of-various-animal-populations\">estimated</a>, using Rethink's median welfare ranges, and holding the ratio between welfare per unit time and that range constant across farmed animals of different species (and defined based on <a href=\"https://welfarefootprint.org/broilers/\">data</a> from the WFP for broilers in conventional scenarios), that the annual badness of the lives of all farmed shrimps and praw is 7.48 times the annual goodness of all human lives. In comparison, I concluded the lives of all farmed fish and chickens are 1.52 and 1.74 as bad as human lives are good. Of course, all these numbers have huge uncertainty!</p>", "parentCommentId": null, "user": {"username": "vascoamaralgrilo"}}, {"_id": "km3vfr4vqvpDrqui9", "postedAt": "2023-09-16T02:40:44.252Z", "postId": "Fhoq7tP9LYPqaJDxx", "htmlBody": "<p>Is there any charity that works on shrimp welfare that you would consider worth giving to based on this analysis? My preferred charity currently is <a href=\"https://thehumaneleague.org/\">The Humane League</a>.</p>", "parentCommentId": null, "user": {"username": "Aithir"}}, {"_id": "z9peLQckxMghqRqkk", "postedAt": "2023-09-18T23:30:11.752Z", "postId": "Fhoq7tP9LYPqaJDxx", "htmlBody": "<p>I'm curating this post.&nbsp;</p><p>I'm extremely unsure of how I should think about whether shrimp are sentient (or <a href=\"https://forum.effectivealtruism.org/posts/nGrmemHzQvBpnXkNX/what-matters-to-shrimps-factors-affecting-shrimp-welfare-in\">what matters to them</a>, or whether farming them is bad for them) or similar questions, but numbers like these seem like a flashing warning sign spelling out something like \"there might be a <a href=\"https://forum.effectivealtruism.org/posts/Dtr8aHqCQSDhyueFZ/the-possibility-of-an-ongoing-moral-catastrophe-summary\">moral catastrophe</a> over here, we can't afford to casually dismiss this.\"&nbsp;</p><p>I also find myself unable to really comprehend numbers or statements like \"230 billion (90% SCI: 150 billion - 370 billion) shrimp are alive on farms at any moment, which surpasses <i>any</i> farmed animal estimate known to date, including farmed insect numbers.\"</p><p>And as always, I really appreciated the diagrams:&nbsp;</p><blockquote><p><strong>Numbers of farmed shrimp and other farmed animals alive at any time</strong></p><p><img style=\"width:713.525px\" src=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/Fhoq7tP9LYPqaJDxx/k3vnku4pkppzuuhxsqma\" alt=\"\" srcset=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/Fhoq7tP9LYPqaJDxx/vvqmnw0c64hdf3xdmglp 100w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/Fhoq7tP9LYPqaJDxx/axzaol0lugkiprxhp5ls 300w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/Fhoq7tP9LYPqaJDxx/h4kceqdav6mupz2vdmdp 500w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/Fhoq7tP9LYPqaJDxx/jsyitukbyavy8wijompm 750w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/Fhoq7tP9LYPqaJDxx/nrnzw64ugdfywe8utl4t 1000w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/Fhoq7tP9LYPqaJDxx/sqvlxpp4x4003iiy0rkl 1500w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/Fhoq7tP9LYPqaJDxx/r3nhcamj3pa4zxjnz8sq 2500w\"></p><p><i>Fig. 2. Estimated numbers (means) of different farmed animals alive at any time. The figure for farmed shrimp is presented in darker blue.</i></p></blockquote><p>If you could pick research directions, do you have an idea for what might be most pressing to study?</p>", "parentCommentId": null, "user": {"username": "Lizka"}}, {"_id": "EcbQthYe2EB4nsjio", "postedAt": "2023-09-19T06:11:59.731Z", "postId": "Fhoq7tP9LYPqaJDxx", "htmlBody": "<p>So far, the only charity I'm aware of that's working on this topic is the Shrimp Welfare Project.</p>\n", "parentCommentId": "km3vfr4vqvpDrqui9", "user": {"username": "Corentin Fressoz"}}, {"_id": "jFCkP7k6hAnk46YSv", "postedAt": "2023-09-19T08:49:22.979Z", "postId": "Fhoq7tP9LYPqaJDxx", "htmlBody": "<p>Thank you for in-text citation and quality post, felt like quality posts backed by peer-review has been absence from EA Forum lately.</p>", "parentCommentId": null, "user": {"username": "chanakin"}}, {"_id": "G6tXGHKo7earfQjtm", "postedAt": "2023-09-19T12:12:23.232Z", "postId": "Fhoq7tP9LYPqaJDxx", "htmlBody": "<p>The <a href=\"https://www.fishwelfareinitiative.org/impact\">Fish Welfare Initiative</a> also works on improving shrimp welfare.</p>", "parentCommentId": "EcbQthYe2EB4nsjio", "user": {"username": "Vidur_Kapur"}}, {"_id": "gez7wA6GcLM3fJ9r9", "postedAt": "2023-09-19T15:28:41.829Z", "postId": "Fhoq7tP9LYPqaJDxx", "htmlBody": "<p>You can have a look into the <a href=\"https://www.shrimpwelfareproject.org/\">Shrimp Welfare Project</a> (SWP), a new EA organization created through the <a href=\"https://www.charityentrepreneurship.com/shrimp-welfare-project\">Charity Entrepreneurship</a> Incubation Program 2021.</p><p>Andrés Jimenez Zorilla was also on the <a href=\"https://www.howilearnedtoloveshrimp.com/podcast/episode/7bdf5f16/andres-jimenez-zorilla-on-shrimp-welfare-project-and-why-we-should-care-about-shrimp\">how I learned to love shrimp</a> podcast.<br><br>&nbsp;</p>", "parentCommentId": "km3vfr4vqvpDrqui9", "user": {"username": "Felix Wolf"}}, {"_id": "AzyFr5YtN3rfmxNsK", "postedAt": "2023-09-20T16:00:04.612Z", "postId": "Fhoq7tP9LYPqaJDxx", "htmlBody": "<p>Your numbers suggest humans eat over 3000 shrimp per year, or about 10 shrimp per human per day. (27 trillion shrimp / 8 billion humans = 3,375 shrimp/human).</p><p>My sense is that where I live (USA) people might eat a shrimp dish with 10 shrimp maybe once a week, not daily.</p><p>Who is eating all these shrimp? Is it all going into shrimp paste in Asia? Do you know how many individual shrimp go into a representative shrimp-paste-based meal?</p><p>(Very interesting article! Useful facts.)</p><p>[edit: Initially I used 35T instead of 27T. That was the wrong number. Thanks to Angelina for pointing that out.]</p>", "parentCommentId": null, "user": {"username": "Peter Hickman"}}, {"_id": "hfdEGxYrDh6f6JbLc", "postedAt": "2023-09-25T04:11:47.179Z", "postId": "Fhoq7tP9LYPqaJDxx", "htmlBody": "<p>I'm also confused about this. I found a paper<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefj46jy2l32is\"><sup><a href=\"#fnj46jy2l32is\">[1]</a></sup></span>&nbsp;that estimates the annual amount of shrimp paste produced in China at 40,000 tons, and says that China is the largest shrimp paste producer in the world. The spreadsheet states that ~251,093 tons of <i>A. japonicus</i> were caught in the wild in 2020, so depending on what proportion of shrimp paste is produced in China<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefq138zfyomuh\"><sup><a href=\"#fnq138zfyomuh\">[2]</a></sup></span>&nbsp;and how many tons of shrimp are needed to make one ton of shrimp paste, this could be accurate?</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnj46jy2l32is\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefj46jy2l32is\">^</a></strong></sup></span><div class=\"footnote-content\"><p><a href=\"https://www.sciencedirect.com/science/article/pii/S0023643822010313\">https://www.sciencedirect.com/science/article/pii/S0023643822010313</a> .&nbsp;<br>I have low confidence in this estimate because I looked at the paper it's citing and don't see that number anywhere in there.</p></div></li><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnq138zfyomuh\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefq138zfyomuh\">^</a></strong></sup></span><div class=\"footnote-content\"><p>I did a cursory search for information about shrimp paste production in other countries and couldn't find any numbers, but I didn't look very hard and it's possible you could find more accurate information.</p></div></li></ol>", "parentCommentId": "AzyFr5YtN3rfmxNsK", "user": {"username": "Francis"}}, {"_id": "ZEwofndwGxfaKM94B", "postedAt": "2023-09-26T17:34:21.880Z", "postId": "Fhoq7tP9LYPqaJDxx", "htmlBody": "<p>Where did you get the 35 trillion number from? Did you mean something closer to 27T (the median estimate for the \"Total number of shrimp (farmed and wild-caught, 2020)\")?</p>", "parentCommentId": "AzyFr5YtN3rfmxNsK", "user": {"username": "Angelina Li"}}, {"_id": "xnDCDhtwv5wDJQBcv", "postedAt": "2023-09-26T18:16:02.670Z", "postId": "Fhoq7tP9LYPqaJDxx", "htmlBody": "<p>I think there's pretty broad agreement that it is indeed the case that most wild-caught shrimp are being turned into shrimp paste. The recent <a href=\"https://forum.effectivealtruism.org/posts/Qo3559TqP5BzoQyWX/two-years-of-shrimp-welfare-project-insights-and-impact-from\">SWP</a> post has some discussion.</p><p>For what it's worth, the 40,000 ton number is also present in some <a href=\"https://www.sciencedirect.com/science/article/pii/S0023643822008155\">other sources</a>, but it's hard for me to trace it back further than that due to language barriers. Since making shrimp paste involves drying the shrimp, it seems to me that the largest country manufacturing 40000 tons of paste could be consistent with 251000 tons of <i>A. japonicus </i>being caught.</p>", "parentCommentId": "hfdEGxYrDh6f6JbLc", "user": {"username": "MHR"}}, {"_id": "hRYbeNscDknojndaB", "postedAt": "2023-09-26T18:18:57.186Z", "postId": "Fhoq7tP9LYPqaJDxx", "htmlBody": "<p>This was super interesting, thank you so much for your work on this! In general I really admire RP's foundational work on shrimp welfare. The fact that RP, CE and now Shrimp Welfare Project have put in so much high quality work into this area makes me feel proud of the broader EA ecosystem / feels like a real success story. Personally speaking, RP and SWP's work on shrimp welfare has made me care significantly more about this cause area.</p><p>I had some thoughts while digging through your models and methodology:</p><p><strong>1/ On acetes japonicus:</strong></p><p>Wow, if I naively divide up the total number of acetes japonicus from this <a href=\"https://www.getguesstimate.com/models/21689\">spreadsheet</a> with your median 27T total shrimp killed per year figure, I think this implies A. japonicus might make up 70% of the raw number of shrimp killed via farming per year?</p><ul><li>That seems huge! FWIW I think maybe this could be one of the headline results, since it took me some time to realize this.</li><li>Do you or others have thoughts on the relative sentience or moral weights of A. japonicus in particular? Sounds like SWP are <a href=\"https://forum.effectivealtruism.org/posts/Qo3559TqP5BzoQyWX/two-years-of-shrimp-welfare-project-insights-and-impact-from\">thinking</a> about this a bit?</li><li>This very nitpicky, but I'm surprised how low precision the generic estimated mean weight in grams estimates you're <a href=\"https://docs.google.com/spreadsheets/d/1UJl3mMW12zdwQN2eMQ_B86S7AJhuHBPCehpjadIant4/edit#gid=42137106\">using</a> to go from tonnage of A. japonicus -&gt; number of individuals (0.005 to 0.07g) — since these account for so many individuals, I'm curious if there are ways to refine this?&nbsp;</li></ul><p><strong>2/ On landed catches:</strong></p><blockquote><p>The FAO global capture database refers to the total retained catches, which includes “landed” and “non-landed” catches (FAO-Fisheries Division, personal communication, May 27, 2021). That is, it includes the mass of animals that are captured, whether they arrive at the port (“landed”) or not.</p><p>However, in most cases, countries are only able to report the quantities of landed catches (FAO-Fisheries Division, personal communication, May 27, 2021). That is, it is likely that <a href=\"https://perma.cc/6ERV-W2F5\">FAO’s Fishery Statistical Collections on Global Capture Production</a> does not contain data about shrimp (and other animals) that were captured, killed, and used prior to landing, either because they were consumed on board, or used as bait. Similarly, captured shrimp that got spoiled onboard are typically dumped before landing, and therefore, are not reported either. Lastly, landed weight data do not account for shrimp that are unintentionally lost when handling at sea or when landing.</p></blockquote><p>Did you try to make any adjustments for countries that don't report non-landed catch weights, or otherwise bound your uncertainty over this? For instance I could imagine finding the average landed to non-landed catch ratio amongst all regions where you have the data, and bump up total tonnage stats by that percentage for countries where you only have the landed catch weights.</p><p>(Or at least, it would be interesting to know if the landed to non-landed tonnage ratio is more like 2:1, 10:1, 1000:1, etc.)</p><p>On a similar note, I'm not sure if \"total catch weight\" includes individuals caught as part of bycatch?</p>", "parentCommentId": null, "user": {"username": "Angelina Li"}}, {"_id": "et8uzkrh3eKDhYCN9", "postedAt": "2023-09-26T18:29:50.047Z", "postId": "Fhoq7tP9LYPqaJDxx", "htmlBody": "<p>Are there folks working on plant based shrimp paste alternatives, and/or other ways of working on reducing demand for shrimp paste?</p><p>This seems like potentially a very neglected area of intervention for animal motivated entrepreneurs (i.e. a gap I wouldn't expect the market to organically fill):</p><ul><li>My guess is the consumers are generally less wealthy than the average plant-based alternative consumer in Western countries</li><li>Doesn't feel as much of a 'fancy' ingredient vs beef or other expensive meats</li><li>Shrimp are less sympathetic animals :(</li></ul><p>I'd be really excited for folks to work on this! I'm not sure if you think there are a few people on the ball already, or if basically no one is owning this right now?</p>", "parentCommentId": "ijt4bWcKxZAbdykb7", "user": {"username": "Angelina Li"}}, {"_id": "xDnh89TZ6ZD2y9KKQ", "postedAt": "2023-09-28T14:39:48.135Z", "postId": "Fhoq7tP9LYPqaJDxx", "htmlBody": "<p>Good point. I'm not sure now where I got 35T. I just now edited the original post.</p>", "parentCommentId": "ZEwofndwGxfaKM94B", "user": {"username": "Peter Hickman"}}, {"_id": "GHGpFX5BX6Kgwnc2T", "postedAt": "2023-10-03T10:41:13.847Z", "postId": "Fhoq7tP9LYPqaJDxx", "htmlBody": "<p>Hi Angelina!</p><p>I agree: this seems like a potentially high-impact entrepreneurial opportunity and, although I'm not absolutely certain that nobody owns this project right now, I'm confident it's under-explored/under-actioned.</p>", "parentCommentId": "et8uzkrh3eKDhYCN9", "user": {"username": "Ben Stevenson"}}, {"_id": "cZH5v9czXdeTBRmrL", "postedAt": "2023-10-10T23:59:20.686Z", "postId": "Fhoq7tP9LYPqaJDxx", "htmlBody": "<p>Looks like the 2021 catch data is now out <a href=\"https://www.fao.org/fishery/statistics-query/en/global_production/global_production_quantity\">here</a>:</p><ul><li>359,750 tonnes by China</li><li>19,946 tonnes by South Korea</li></ul>", "parentCommentId": null, "user": {"username": "MichaelStJules"}}, {"_id": "jXK9y4ys5we29CsCb", "postedAt": "2023-11-30T04:27:30.775Z", "postId": "Fhoq7tP9LYPqaJDxx", "htmlBody": "<p>Actually Shiok Meats is working on cultivated meat for shrimp. They're a promising startup.&nbsp;</p>", "parentCommentId": "et8uzkrh3eKDhYCN9", "user": {"username": "kewlcats"}}, {"_id": "hHXumvfemGt3ndnPy", "postedAt": "2023-12-22T20:34:46.001Z", "postId": "Fhoq7tP9LYPqaJDxx", "htmlBody": "<p>I think it's a significant mistake to treat invertebrates as beings having moral worth. I believe that investment of time and energy into this project is not only a waste, but actively misleads people from thinking about and understanding reality. Before any of this discussion, we need to come to an agreement about the empirical facts of the situation.</p><p>&nbsp;In examining the nervous systems of invertebrates, we see that there is greatly reduced complexity.</p><p>In examining the behavioral activity of invertebrates, we see no evidence of social contracts, empathy, caring.</p><p>In the brains of humans, we see large complexes of neurons used for social relations, perception of self, modeling the world in abstract ways, recording and retrieving episodic memories, etc. This is complexity is clearly lacking in invertebrates. This matches the evidence from observing their behavior.</p><p>To place moral value on something you have evidence is not a moral agent is morally incorrect. It leads to making trade-offs against actual moral agents in favor of entities without moral value.</p><p>Further discussion on this topic should delve into the physiological details of the nervous systems of invertebrates, and observations of their behavior. Without further establishing those details, and exploring why the initial evidence showing that they are not moral agents is incorrect, we must not presume them to be moral agents.</p>", "parentCommentId": null, "user": {"username": "brighter_future"}}, {"_id": "F2FMvCaGsGaAeM6Cw", "postedAt": "2023-12-22T20:43:35.021Z", "postId": "Fhoq7tP9LYPqaJDxx", "htmlBody": "<p>I strongly disagree with your statement. I have given reasons why this information is not only not important, but is actively deceiving people and encouraging them to act in immoral ways by incorrectly placing moral weight on invertebrates which are not evidenced to be of any moral value. Spreading this incorrect information is thus, in my view, actively harmful.</p><p>Erroneous information like this is diluting discussion and attention on valid issues, and harming our epistemological norms.</p><p>These arguments given in defense of the moral value of shrimp are insufficient:</p><blockquote><p>Recently, <a href=\"https://perma.cc/6FAT-3225\">Birch et al. (2021)</a> and <a href=\"https://doi.org/10.51291/2377-7478.1691\">Crump et al. (2022a)</a> reviewed the evidence of sentience in decapod crustaceans, with a focus on pain experience. Similar to findings previously reported by <a href=\"https://perma.cc/L6E9-F4WJ\">Waldhorn (2019</a>; see also <a href=\"https://perma.cc/2RXZ-6TDR\">Waldhorn et al., 2020</a>), these studies concluded that there is substantial, although limited, evidence that decapods might be sentient.</p></blockquote><p>For this information about the pain experience of shrimp to even be relevant, you must first argue that ability to feel pain necessitates having moral value. I strongly disagree with this point. I believe it is the social relations between thinking beings that is the basis of morality.</p>", "parentCommentId": "8qRa8GhXeDXfpFF2r", "user": {"username": "brighter_future"}}, {"_id": "wvAioMK9cCycavnAg", "postedAt": "2023-12-22T20:58:35.355Z", "postId": "Fhoq7tP9LYPqaJDxx", "htmlBody": "<p><a href=\"https://forum.effectivealtruism.org/posts/wPiPg8qTAuoTKbzzA/new-trolley-problem\">Here's my take on this issue. </a>I think that mistaking pain sensation for moral worth is a big problem, and leading to significant moral costs in our community. I believe that we need to reevaluate what neural structure &amp; function (or other compute substrate) qualifies for moral worth, and to what degree. This should be an empirical study of the physical properties of the system, as well as a philosophical discussion over what attributes matter.</p><p>As a starting point, I suggest we use the presence of a social contract between sapient beings capable of verbally communicating preferences. Then should we consider non-verbal communication. In the lack of any sort of abstract communication, I think we should be extremely suspicious of the entity involved having sufficient computational complexity to have moral worth.</p>", "parentCommentId": "NGhMCDevyza7BMfgm", "user": {"username": "brighter_future"}}]