[{"_id": "5hCTFbHMZHWyhKp9A", "postedAt": "2022-12-15T22:37:18.657Z", "postId": "FiJZduXnddAGSveAC", "htmlBody": "<p>I looked up RIP Medical Debt out of curiosity, and the concept is pretty cool if it works / is true. From <a href=\"https://ripmedicaldebt.org/\">their website</a>:&nbsp;</p><p>“You make a donation We use data analytics to pinpoint the debt of those most in need: households that earn less than 4x the federal poverty level (varies by state, family size) or whose debts are 5% or more of annual income.&nbsp;</p><p>RIP buys medical debt at a steep discount We buy debt in bundles, millions of dollars at a time at a fraction of the original cost.&nbsp;</p><p>This means your donation relieves about 100x its value in medical debt. Together we wipe out medical debt People across the country receive letters that their debt has been erased. They have no tax consequences or penalties to consider. Just like that, they’re free of medical debt.”&nbsp;</p>", "parentCommentId": null, "user": {"username": "vaidehi_agarwalla"}}, {"_id": "My9izAQyxgFG5vz8c", "postedAt": "2022-12-16T05:47:08.866Z", "postId": "FiJZduXnddAGSveAC", "htmlBody": "<p>I'd want to see more details than I could find on their website. There was a reference to buying debt from 1 to 7+ years old . . . the latter is outside what will report on credit reports and is generally outside the statute of limitations. Maybe its retirement has value, but I would want to check the possibility that they are buying a lot of debt that is super-old &nbsp;mainly to pump up their numbers.</p>", "parentCommentId": "5hCTFbHMZHWyhKp9A", "user": {"username": "Jason"}}, {"_id": "3qygTNfSf5hFNhK9W", "postedAt": "2022-12-16T06:12:39.402Z", "postId": "FiJZduXnddAGSveAC", "htmlBody": "<p>Interesting! I know very little about American debt. Agree that the website is very sparse</p>\n", "parentCommentId": "My9izAQyxgFG5vz8c", "user": {"username": "vaidehi_agarwalla"}}, {"_id": "bR8gwQY9rDHBiPAiB", "postedAt": "2022-12-16T11:16:58.763Z", "postId": "FiJZduXnddAGSveAC", "htmlBody": "<p>Question for economists: Would this drive up the prize of the remaining bad debt in expectation, so that so that the marginal utility created by this go down significantly?</p>\n", "parentCommentId": "5hCTFbHMZHWyhKp9A", "user": {"username": "HaukeHillebrandt"}}, {"_id": "LkGmyeBwgTaK4QWDb", "postedAt": "2022-12-16T11:53:01.232Z", "postId": "FiJZduXnddAGSveAC", "htmlBody": "<p>The question I have is what portion of this debt is actually collectable or likely to be collected and is bothersome to the people who owe it. The companies selling the debt will sell uncollectable debts much more cheaply, and they know far more about the situations than the buyers. For example, some debt is legally uncollectable, either because of missing documentation, lack of correct identifying information, or similar - but it can be sold anyways. Other debts are owed by people who have left the country permanently, or have died, or who are in prison for longer than the horizon for debt collection and are planning to ignore it.</p>", "parentCommentId": "5hCTFbHMZHWyhKp9A", "user": {"username": "Davidmanheim"}}, {"_id": "aHnwFn4KAa9xCjDpP", "postedAt": "2022-12-16T11:55:20.216Z", "postId": "FiJZduXnddAGSveAC", "htmlBody": "<p>That's a question about the market for debt, which is not particularly transparent. I think it's something that FTC economists probably could get some information about, since the FTC has a fair amount of insight into debt collection, but otherwise I think it's going to be very hard to answer. Also, see <a href=\"https://forum.effectivealtruism.org/posts/FiJZduXnddAGSveAC/mackenzie-scott-s-grantmaking-data?commentId=LkGmyeBwgTaK4QWDb\">my other comment</a> about collectibility and value.</p>", "parentCommentId": "bR8gwQY9rDHBiPAiB", "user": {"username": "Davidmanheim"}}]