[{"_id": "GKcHc9rPiaP5QzGXd", "postedAt": "2015-03-16T14:49:47.000Z", "postId": "Fiqu3FiEb2GooxJu8", "htmlBody": "<p>The bottom link is broken.  I believe it should point to <a href=\"http://globalprioritiesproject.org/2015/03/ylds-and-ylls/\">http://globalprioritiesproject.org/2015/03/ylds-and-ylls/</a></p>\n", "parentCommentId": null, "user": {"username": "AABoyles"}}, {"_id": "8nDh6P4NmwBLmXAiH", "postedAt": "2015-03-16T18:34:50.442Z", "postId": "Fiqu3FiEb2GooxJu8", "htmlBody": "<p>Thanks, fixed.</p>\n", "parentCommentId": "GKcHc9rPiaP5QzGXd", "user": {"username": "Sebastian_Farquhar"}}, {"_id": "XDcevDCQmw3NzzACo", "postedAt": "2015-03-17T14:56:01.269Z", "postId": "Fiqu3FiEb2GooxJu8", "htmlBody": "<p>This makes a lot of sense and does seem like an important distinction to make. I like the analysis as well.</p>\n<p>Are there ways to apply some more numbers (i.e. in terms of the economic impact of YLL in middle age) where appropriate, or is that number not available? It seems like maybe applying it to those specific geographies could be helpful?</p>\n<p>In addition, one consideration that I didn't see mentioned (but may have missed) is the economic cost of additional children. Infant mortality is a key component of having more children, and therefore there is more familial early capital spent and maternal health risk when infant mortality is higher.</p>\n", "parentCommentId": null, "user": {"username": "joshjacobson"}}, {"_id": "ERxzTkj9FBCb6JWou", "postedAt": "2015-03-17T15:04:56.686Z", "postId": "Fiqu3FiEb2GooxJu8", "htmlBody": "<p>Great article. Very glad to see progress on these questions. Nice work!\nA couple of questions seem a little underdeveloped (possibly lost to parsimony?):</p>\n<p>1 - do YLD from schistosomiasis incur significant externalities (cognitive development, food supply and future prospects seem to be the main ones? Quite a mild condition) of the type that you bring up for the rule of thumb</p>\n<p>2 - doesn't infant death expectation have something to do with the grief phenomenon being less strong in the developing world? Isn't this an important element of a culture in terms of accepting death etc. Doesn't it have knock on effects in terms of family planning choices and growth?</p>\n<p>Once again, good work and thank you!</p>\n", "parentCommentId": null, "user": {"username": "tomstocker"}}, {"_id": "orfs2dLMmqofnJCkB", "postedAt": "2015-03-18T14:27:39.630Z", "postId": "Fiqu3FiEb2GooxJu8", "htmlBody": "<p>1 - Probably yes. GiveWell go into a reasonably detailed discussion of evidence for this <a href=\"http://www.givewell.org/international/technical/programs/deworming#Developmentalimpacts\">here</a>.</p>\n<p>2 - Certainly yes. But I think these effects are likely to be weaker for infants than for young adults.</p>\n", "parentCommentId": "ERxzTkj9FBCb6JWou", "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "oeH73KpALgHGbwQFL", "postedAt": "2015-03-18T14:49:49.652Z", "postId": "Fiqu3FiEb2GooxJu8", "htmlBody": "<p>I'd love to have numbers for these effects. I'm not sure whether they exist.</p>\n<p>There is definitely a substantial economic cost to infant mortality and we weren't trying to claim otherwise. The claim was that this tends to be small in comparison to the economic cost of for example disease in children accruing the same number of DALYs.</p>\n", "parentCommentId": "XDcevDCQmw3NzzACo", "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "5cSyz83LyHWBoL3Xf", "postedAt": "2015-03-27T07:35:05.531Z", "postId": "Fiqu3FiEb2GooxJu8", "htmlBody": "<p>Very helpful as ever Owen, thanks!</p>\n", "parentCommentId": "orfs2dLMmqofnJCkB", "user": {"username": "tomstocker"}}, {"_id": "er3zhnrKECt5gzbf8", "postedAt": "2015-03-27T08:04:00.874Z", "postId": "Fiqu3FiEb2GooxJu8", "htmlBody": "<p>Very helpful as ever Owen, thanks!</p>\n<p>Having read the Givewell page, the side effects / resistance stuff that the now replaced SCI woman in charge of evaluation was worried about are under-explored compared to what I expected of givewell (interestingly, we might be incentivising SCI to omit the routine and systematic collection and reporting of side effects and resistance - and others are not really likely to do it). This is really disappointing because I remember Toby and I being worried about this stuff back in 2010/2011.</p>\n<p>The evidence for developmental correlates of deworming is much weaker than I had assumed knowing about the developmental correlates of under-nutrition (e.g. growing up with a hole in your brain). </p>\n<p>Further, that evidence probably relies on the extra schooling from what they've said. I yet again revise my estimate of SCI's effectiveness downwards :( :) (depending on if I'm sad about the lower marginal effectiveness or happy about having discovered something useful!)</p>\n", "parentCommentId": "orfs2dLMmqofnJCkB", "user": {"username": "tomstocker"}}, {"_id": "Mu23Dq5FJ3dejYRhy", "postedAt": "2015-03-27T08:45:53.640Z", "postId": "Fiqu3FiEb2GooxJu8", "htmlBody": "<p>Woah! Hauke Hillebrand and some Harvard professors cause an extremely quick update with a facebook post to one of his first blogs on SCI effectiveness.</p>\n<p><a href=\"https://www.givingwhatwecan.org/blog/2015-03-14/most-cost-effective-health-intervention-killing-parasitic-worms-malaria-mosquitos\">It seems to help HIV to the point where its effectiveness should be considered doubled (pending checks on the quality of the research).</a></p>\n<p>And HIV very much is a YLD we would want to take extremely seriously, for the reasons you mentioned!</p>\n", "parentCommentId": "er3zhnrKECt5gzbf8", "user": {"username": "tomstocker"}}]