[{"_id": "vF98FyB87rH3NRHyE", "postedAt": "2023-08-23T20:52:57.865Z", "postId": "FJYqRk9AxNNuq9xqp", "htmlBody": "<p>Thank you for writing up your thoughts and experiences, and making the materials available! I really like to hear about people trying out variations on commonly used resources and communicating the results. It seems like a lot of thought went into these modifications.<br><br>I'm really intrigued by the minimised preparation time for participants, since I imagine the original 2h commitment can be an obstacle for some and thus make such fellowships less inclusive. If the performance indicators here can be replicated by others, this could have a big impact on the best practices for local groups to get new members and participants.</p><p>From reading the text, it is a bit unclear to what degree the tools and upskilling parts of this curriculum rely on your experience on those topics in order to be conveyed well. How easy do you suppose it is for a novice organiser to explain and give instructions on these parts? How would this be affected by the recommended adjustments you describe?</p>", "parentCommentId": null, "user": {"username": "Jesper Magnusson"}}, {"_id": "x99F6RiEJHx2uDDht", "postedAt": "2023-09-11T20:42:04.333Z", "postId": "FJYqRk9AxNNuq9xqp", "htmlBody": "<p>I'm definitely not close to an expert on any of the topics; in general, the upskilling parts were highly abbreviated and shallow. Even if you don't have any experience to corroborate the importance of the ideas you're sharing, it probably won't be prohibitively difficult to deliver the content as long as you're willing to read up on the topics beforehand. With that being said, I probably wouldn't recommend spending a bunch of time learning stuff you don't think you would personally use (e.g. maybe specific consulting frameworks if you're mostly into STEM-related things). For those cases, my recommendation would be to either cut that content, have an organizer with a more relevant background deliver it, or replace it with content you're better suited to deliver. I would also highly emphasize being flexible and getting feedback from the most important stakeholders: the participants. The whole point is to provide the most value for them, so I'd encourage asking what they're actually excited to learn about and adjusting accordingly.&nbsp;</p>", "parentCommentId": "vF98FyB87rH3NRHyE", "user": {"username": "Sam Emerman"}}]