[{"_id": "4NsFsxBuDycAWCgHf", "postedAt": "2015-07-26T15:16:10.681Z", "postId": "FK4fHkQqEbgijABqb", "htmlBody": "<p>Thanks for the excellent survey work.  I will take out the blindness cure example we use in our tabling/giving games, and replace it with Toby's lives-saved opportunity example.</p>\n", "parentCommentId": null, "user": {"username": "MatthewDahlhausen"}}, {"_id": "qN79EhDgfgPM9GLKh", "postedAt": "2015-07-27T23:55:11.249Z", "postId": "FK4fHkQqEbgijABqb", "htmlBody": "<p>Thanks for doing this! Awesome initiative, neat survey idea, and thanks so much for posting your data publicly.</p>\n<p>I'd like to take this opportunity to reiterate my <a href=\"http://skillshare.im/offers/193\">standing offer of statistics advice</a> for anyone who needs it. If anyone plans to do more statistical things, I may be able to offer advice on your experimental design or analysis plan.</p>\n<p>I have some statistical comments that I'll post separately, for ease of threading.</p>\n", "parentCommentId": null, "user": {"username": "Ben_Kuhn"}}, {"_id": "CebHtCKWn8PB7kk7C", "postedAt": "2015-07-27T23:56:03.563Z", "postId": "FK4fHkQqEbgijABqb", "htmlBody": "<p>A good rule of thumb is to have at least 10 subjects per group for <em>confirmatory</em> analysis, and you have less than that for <em>exploratory</em> analysis. Because your sample is so small, I would be surprised if very many (if any) of your rankings survived correction for multiple-hypothesis testing.</p>\n<p>I would suggest grouping some of the individual conditions together in different analyses (for instance, test all &quot;opportunity&quot; groups against all &quot;obligation&quot; groups), although this may introduce bias since the &quot;opportunity&quot; groups varied systematically from the &quot;obligation&quot; groups in other ways.</p>\n<p>On a related note, you don't have to simply assert that </p>\n<blockquote>\n<p>the overall ranking of the prompts... has the power of our full sample size of 167 behind it, so that we’re somewhat confident that conclusions drawn about prompts close to its extreme points are valuable.</p>\n</blockquote>\n<p>Instead, you can use something like <a href=\"https://en.wikipedia.org/wiki/Bootstrap_(statistics\">bootstrap resampling</a>) to get an idea of the variance of ranking. I would be interested to see how variable the rankings are under bootstrap resamplings, especially since 167 is actually not that large of a sample for this many groups.</p>\n", "parentCommentId": null, "user": {"username": "Ben_Kuhn"}}, {"_id": "myFHw7gtM4mB59xRE", "postedAt": "2015-07-27T23:56:21.792Z", "postId": "FK4fHkQqEbgijABqb", "htmlBody": "<blockquote>\n<p>Neither correlation showed. Not even the square root of the product of the two features was correlated with responses to our prompts.... But the results are probably more likely to be meaningless.</p>\n</blockquote>\n<p>There are two things that &quot;no correlation&quot; might mean: first, that there is actually no correlation, or second, that you didn't have enough statistical power to detect a correlation. Only in the second case is the result meaningless. You can distinguish between these by providing not just the p-value of the correlation, but the confidence interval on the correlation statistic.</p>\n", "parentCommentId": null, "user": {"username": "Ben_Kuhn"}}, {"_id": "c2GJvNHf7xKgtmsKG", "postedAt": "2015-07-27T23:56:52.376Z", "postId": "FK4fHkQqEbgijABqb", "htmlBody": "<blockquote>\n<p>If these results can be taken at face value, then it seems to us that rationality and altruism may be little more than necessary conditions for becoming effective altruism, and that something else is just as necessary—maybe the principle of “taking ideas seriously,” which is common on Less Wrong, or any number of other such traits.</p>\n</blockquote>\n<p>If rationality and altruism were necessary conditions for EA outreach working well, wouldn't you actually expect to see a reasonably strong correlation between rationality or altruism and responsiveness to EA outreach, because all individuals with low R/A have low responsiveness, whereas some individuals with high R/A have high responsiveness?</p>\n", "parentCommentId": null, "user": {"username": "Ben_Kuhn"}}, {"_id": "2j8sx9ycAPzecPDjk", "postedAt": "2015-07-27T23:57:13.096Z", "postId": "FK4fHkQqEbgijABqb", "htmlBody": "<blockquote>\n<p>The strong correlations between “altruistic” and the two REI dimensions may be just artifacts of people’s different inclinations to answer Likert scales with extreme or moderate values.</p>\n</blockquote>\n<p>I don't think that would explain it, actually. The correlation tests whether a person's rationality average is a good predictor of their altruism average, <em>on expectation</em>. If the person is biased towards choosing extreme values, then a high rationality average becomes <em>less</em> informative about the <em>expected value</em> of the altruism average, because there's more variance in that person's answers.</p>\n<p>(I'm not sure I've explained this well, but if you disagree, try giving an example of a data-generating model where there is no real correlation between A and B, but a correlation appears in the data because some people are disproportionately likely to choose extreme answers. I'm fairly sure this isn't possible.)</p>\n", "parentCommentId": null, "user": {"username": "Ben_Kuhn"}}, {"_id": "e35YdQDSbzxeewmaY", "postedAt": "2015-07-28T17:45:40.509Z", "postId": "FK4fHkQqEbgijABqb", "htmlBody": "<p>Yep, I should’ve done that. See below. Insofar as we can take these numbers at face value, I think they show that we can be fairly confident that there’s no correlation.</p>\n<p>But correct me if I’m wrong, but for a null result to not be meaningless the study would have to be methodologically excellent. I don’t trust our first foray into surveys too far. That’s what I meant in the section you quoted.</p>\n<p>Many thanks for all your comments! (I found this one to be easiest to respond to, but I’ll get to the others next.)</p>\n<p>Correlation between prompts and rationality:</p>\n<pre><code>&gt; bayes.cor.test(\n+   formula = ~ all.mean + rationality.mean,\n+   data = results[!is.na(results$all.mean), ])\n  |**************************************************| 100%\n\n    Bayesian First Aid Pearson's Correlation Coefficient Test\n\ndata: all.mean and rationality.mean (n = 167)\nEstimated correlation:\n  -0.054\n95% credible interval:\n  -0.21 0.10\n\nThe correlation is more than 0 by a probability of 0.256\nand less than 0 by a probability of 0.744 \n</code></pre><p>Correlation between prompts and altruism:</p>\n<pre><code>&gt; bayes.cor.test(\n+   formula = ~ all.mean + altruism.mean,\n+   data = results[!is.na(results$all.mean), ])\n  |**************************************************| 100%\n\n    Bayesian First Aid Pearson's Correlation Coefficient Test\n\ndata: all.mean and altruism.mean (n = 167)\nEstimated correlation:\n  -0.026\n95% credible interval:\n  -0.18 0.13\nThe correlation is more than 0 by a probability of 0.379\nand less than 0 by a probability of 0.621 \n</code></pre>", "parentCommentId": "myFHw7gtM4mB59xRE", "user": {"username": "Telofy"}}, {"_id": "h8hQ26KPim3SdQaZ3", "postedAt": "2015-07-30T06:23:39.698Z", "postId": "FK4fHkQqEbgijABqb", "htmlBody": "<p>Grouping: The gallery I linked is an almost unfiltered assortment of all the graphs I generated, but I eventually ignored the ones where some cohorts were very small. Even in the case of motivation vs. education, where I already grouped the originally five levels into two, the result (that people who hadn’t visited a university were more easily motivated for or curious about EA) was not “significant” (or what the proper term is, Bayes factor of 0.5).</p>\n<p>That was a grouping of demographic levels, though. Is what you’re suggesting closer to <a href=\"https://drive.google.com/file/d/0B_EGIYnWjWAvbXJBcGwwTlMzdUU/view\">this</a> or <a href=\"https://drive.google.com/file/d/0B_EGIYnWjWAvbEpkb2RmOVZubVk/view\">this</a> one?</p>\n<p>Bootstrapping: My university course and my textbook only touch on that in the context of things they wish they had had the time to cover… Do you mean that I could use bootstrapping to determine the variance of the individual measures or of the rank of the items? The first seems doable to me, the latter more tricky.</p>\n", "parentCommentId": "CebHtCKWn8PB7kk7C", "user": {"username": "Telofy"}}, {"_id": "um4DmvrQJb4n7D5wx", "postedAt": "2015-07-30T06:27:12.997Z", "postId": "FK4fHkQqEbgijABqb", "htmlBody": "<p>That’s awesome! I need to bear that offer in mind. Thanks for all your comments! :‑)</p>\n", "parentCommentId": "qN79EhDgfgPM9GLKh", "user": {"username": "Telofy"}}, {"_id": "jvJuR3aZoWqi7FL3r", "postedAt": "2015-08-07T14:58:21.644Z", "postId": "FK4fHkQqEbgijABqb", "htmlBody": "<p>I read this as having an implicit hypothesis - that your responsiveness didn't necessarily mean that you followed through on going through the steps to take EA related actions? And, seeing a load of rationalist people and altruistic people in EA but not many other people, we can assume that they're necessary conditions. So, perhaps you need more than just these traits, as there's no extra responsiveness / motivation that's reported if you have them according to these preliminary findings. (Does that sound right?) </p>\n<p>Which I think might be less plausible than a simpler hypothesis e.g. rational/altruistic people are more likely to execute on and deliberate over new ideas once they've responded / been motivated by them. Or, something like:  EA movement growth has found traction in communities of rationalist people for other reasons. Unless there's some reasoning I'm missing?</p>\n", "parentCommentId": "c2GJvNHf7xKgtmsKG", "user": {"username": "tomstocker"}}, {"_id": "2FRCi3GcMt2Xa5W2x", "postedAt": "2015-08-10T09:08:37.351Z", "postId": "FK4fHkQqEbgijABqb", "htmlBody": "<p>re: standing offer of statistical advice, there might be a great opportunity to get the answer to the question of the distribution of effectiveness of development interventions right by helping AidGrade with their data. I posted in open thread also. Commenting here because you seem to be awesome at all things data / stats, but I bet you have a high opportunity cost to your time!!</p>\n<p>&quot;Eva Vivalt Btw, if anyone would like to help with transforming AidGrade's data so as to better speak to this question and pin down the variance in cost-effectiveness terms, let me know. We have some measures of costs but there is still the matter of converting outcomes.&quot; ?\nSee debates / links on post by Satvik Beri on 7th August on Effective Altruists facebook group for context.</p>\n", "parentCommentId": "qN79EhDgfgPM9GLKh", "user": {"username": "tomstocker"}}, {"_id": "5zvdX3AiKGg5umGGf", "postedAt": "2015-12-09T19:05:23.331Z", "postId": "FK4fHkQqEbgijABqb", "htmlBody": "<p>Amongst the other statistical concerns brought up by others, I feel like I have no idea who the people are that participated in this.</p>\n", "parentCommentId": null, "user": {"username": "joshjacobson"}}, {"_id": "jxLiEqQwutEowDgY5", "postedAt": "2015-12-10T15:54:38.324Z", "postId": "FK4fHkQqEbgijABqb", "htmlBody": "<p>Was the order in which the options were presented to the participants varied randomly?</p>\n", "parentCommentId": null, "user": {"username": "Robert_Wiblin"}}, {"_id": "eFPsuD4pDNMgRiX9C", "postedAt": "2015-12-23T04:07:24.989Z", "postId": "FK4fHkQqEbgijABqb", "htmlBody": "<p>You mean the prompts? We wanted to keep the obligation prompts last in case people are irked by them so it won’t influence the rest. We didn’t see the same risk for the opportunity style ones. But we didn’t shuffle them within the pages either.</p>\n", "parentCommentId": "jxLiEqQwutEowDgY5", "user": {"username": "Telofy"}}, {"_id": "jgfyEfZPawAbLbf9J", "postedAt": "2015-12-23T04:11:07.334Z", "postId": "FK4fHkQqEbgijABqb", "htmlBody": "<p>Mostly students and staff of the Humboldt-Universität zu Berlin. I also recorded my targeting settings for the Facebook ads at the time but forgot to include it. It was mostly targeted at our existing Facebook followers to maximize conversion rates, so fans of My Little Pony: Friendship is Magic.</p>\n", "parentCommentId": "5zvdX3AiKGg5umGGf", "user": {"username": "Telofy"}}, {"_id": "chQWSoXwynNHD7yKQ", "postedAt": "2018-09-18T11:41:09.920Z", "postId": "FK4fHkQqEbgijABqb", "htmlBody": "<p>I was looking for something like this…I found it quiet interesting, hopefully you will keep posting such blogs….Keep sharing.\n<a href=\"http://www.roshnikhanna.in/\">http://www.roshnikhanna.in/</a></p>\n", "parentCommentId": null, "user": {"username": "devayanikaur"}}]