[{"_id": "4aLxFNkzjfq55mnhE", "postedAt": "2022-11-12T05:55:11.696Z", "postId": "FKJ8yiF3KjFhAuivt", "htmlBody": "<p>\"Huh, this person definitely speaks fluent LessWrong. I wonder if they read Project Lawful? Who wrote this post, anyway? I may have heard of them.<br><br>...Okay, yeah, fair enough.\"<br><br>One thing I definitely believe, and have commented on before<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefcnqd73c6kfe\"><sup><a href=\"#fncnqd73c6kfe\">[1]</a></sup></span>, is that median EA's (I.e, EA's without an unusual amount of influence) are over-optimising for the image of EA as a whole, which sometimes conflicts with actually trying to <i>do</i> effective altruism. Let the PR people and the intellectual leaders of EA handle that - people outside that should be focusing on saying what we sincerely believe to be true, and worrying much less about whether someone, somewhere, might call us bad people for saying it. That ship has sailed - there are people out there, by now, who already have the conclusion of \"And therefore, EA's are bad people\" written down - refusing to post an opinion won't stop them filling in the middle bits with something else, and this was true even before the FTX debacle.<br><br>In short - \"We should give the money back because it would help EA's image\" is, imo, a bad take. \"We should give the money back because it would be the right thing to do\" is, imo, a much better take, which I won't take a stand on myself at this point since I don't have a horse in this race.<br><br>Maybe I should write a post about this at some point...though I recognise that now, in particular, isn't exactly the right time to do that.</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fncnqd73c6kfe\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefcnqd73c6kfe\">^</a></strong></sup></span><div class=\"footnote-content\"><p>On a deleted post, so I can't link the comment here, but people can search my comment history for \"Personally, I disagree strenuously\" if they wish to verify this.</p></div></li></ol>", "parentCommentId": null, "user": {"username": "Jay Bailey"}}, {"_id": "gZQ2BrdC5BDy9Db62", "postedAt": "2022-11-12T06:44:50.628Z", "postId": "FKJ8yiF3KjFhAuivt", "htmlBody": "<p>I think the above is correct, on top of what Elizier has written one should also consider the legal issues around this mess.&nbsp;</p><p>I'm by no means a lawyer and so this is definitely not legal opinion, but it's very likely that this will be mired in bankruptcy procedures for a very long time (Lehman Brothers is still unwinding for instance) and even if the money was returned to FTX ventures it isn't certain that it would then be sent on to the ultimate people that you think are most deserving (i.e. the ones that had their accounts wiped out). It sounds as though the structure overall was a shit show and there were multiple entities in between, so where each account was held and how those liabilities sit in terms of priority of debt is probably very very unclear. There are still some chances that there will be some amount of money given back to the account holders as well.</p><p>In addition (and this might be even more controversial), I hope that the people that did get wiped out were using money that they could lose to some degree. Keep in mind that they were investing in crypto in offshore exchanges, and although FTX was thought to be a trustworthy partner, the entire space was known for scams and other mess, so hopefully there was an element of buyer beware for mos t of the account holders. &nbsp;</p>", "parentCommentId": null, "user": {"username": "Arno"}}, {"_id": "caLXhxFzdhfBfFwNG", "postedAt": "2022-11-12T06:45:11.602Z", "postId": "FKJ8yiF3KjFhAuivt", "htmlBody": "<p>I agree with this post from a moral perspective, though one thing it does not touch on is the legal question. My guess is that, in the same way that a court probably wouldn't try to claw back money from a utility company/janitor/etc. that FTXFF beneficiaries are also probably safe, but IANAL so maybe somebody who knows more there could comment.</p>\n", "parentCommentId": null, "user": {"username": "evhub"}}, {"_id": "6oRyCaq3Gp2mQaTKc", "postedAt": "2022-11-12T07:00:29.072Z", "postId": "FKJ8yiF3KjFhAuivt", "htmlBody": "<p>(Separately from all issues above, <i>if</i> you hold yourself responsible for returning money, you definitely should not be trying to return money <i>now,</i> <i>while</i> the FTX accounts are still being looted, first by people buying NFTs from Bahamian accounts that could still transfer out money, and now by an outright hack or \"hack\".)</p>", "parentCommentId": "gZQ2BrdC5BDy9Db62", "user": {"username": "EliezerYudkowsky"}}, {"_id": "8vDosJXTgvdCvd3YW", "postedAt": "2022-11-12T08:23:20.475Z", "postId": "FKJ8yiF3KjFhAuivt", "htmlBody": "<p>I appreciate the post (even though I have no idea what Lawful Good / Neutral means etc. haha).&nbsp;<br>I think it is a good time to remind ourselves that EAs in general (including myself) have a tendency for over-responsibility. And feeling responsible for things which are broader than our scope makes us feel bad... I like the plumber example and the Sequoia Capital example. &nbsp;If the big VC got fooled, how can I not get fooled? And the plumber rightfully deserves money for his sweat, even if this money is dirty. The plumber did not know this in advance. &nbsp;<br>&nbsp;</p>", "parentCommentId": null, "user": {"username": "Dvir Caspi"}}, {"_id": "2YY6rH2Y7ycRPjP5X", "postedAt": "2022-11-12T08:54:38.840Z", "postId": "FKJ8yiF3KjFhAuivt", "htmlBody": "<p>Lawful good/ neutral is part of a Dungeons and Dragons character's 'alignment' chart. It's a way people sometimes use to describe people's morality and motivations in real life. <a href=\"https://www.wnyc.org/story/the-chart-that-explains-everyone-character-alignment/\">https://www.wnyc.org/story/the-chart-that-explains-everyone-character-alignment/</a></p>\n", "parentCommentId": "8vDosJXTgvdCvd3YW", "user": {"username": "Matt g"}}, {"_id": "BGT6kEwEGC5JbK3ST", "postedAt": "2022-11-12T09:11:37.848Z", "postId": "FKJ8yiF3KjFhAuivt", "htmlBody": "<p>Thanks for laying this out. May help many to figure out what to do.&nbsp;<br>&nbsp;<br>My view about a red line at the moment is that a charity should <i><strong>stop accepting</strong></i><strong> </strong>donations once it's know that a source is fraudulent. To avoid fraudsters deriving benefit from being associated with the charity. However, when the donations are in the past, there is only a very weak, if any, &nbsp;PR benefit for the fraudsters at hand. &nbsp;In that situation an important (and in EA context maybe the main) harm is that keeping the money by charity will encourage future naive consequentialists. So this indirect effect on one side, and the immediate harm to the causes on the other. It's a tough call, glad I don't have to make it.<br>&nbsp;</p><p>It would be great if the current discussion leads to a clear precedent and it being clearly stated in EA charity policies what will be done in case of funder's fraud. This would give the clear signals to the naive consequentialists and (in case of fraud) make &nbsp;decisions for charities easier. Actually I bet there are well described precedents and some guidelines available, is anyone aware of such?&nbsp;</p>", "parentCommentId": null, "user": {"username": "akanepajs"}}, {"_id": "6hMTbarcheg3toq3j", "postedAt": "2022-11-12T11:19:37.328Z", "postId": "FKJ8yiF3KjFhAuivt", "htmlBody": "<p>I found <a href=\"https://twitter.com/AutismCapital/status/1591146001108455424\">this tweet</a> encouraging:</p><blockquote><p>Some people are talking about \"clawbacks\". This means feds can take money back within 90 days of bankruptcy declaration. This is only for Chapter 7. FTX entities filed for Chapter 11. This means they will try to liquidate everything they can to *return* to people. Not claw back.</p></blockquote>", "parentCommentId": "caLXhxFzdhfBfFwNG", "user": null}, {"_id": "qYgprjgDgMBmfDcdb", "postedAt": "2022-11-12T11:34:05.577Z", "postId": "FKJ8yiF3KjFhAuivt", "htmlBody": "<blockquote><p>I worry that people who hold the contrary viewpoint, that it's fine to just Lawful Neutrally trade utilons for money and undercharge to the extent you're Good, will feel inhibited and afraid from presenting this viewpoint if they hold it; and when that happens, in EA, I often do suspect that nobody else will dare to speak the contrary viewpoint, if not me.</p></blockquote><p>I tried to <a href=\"https://forum.effectivealtruism.org/posts/xafpj3on76uRDoBja/the-ftx-future-fund-team-has-resigned-1?commentId=7C4k8hdJfqdQrAfgq\">here</a> and <a href=\"https://forum.effectivealtruism.org/posts/xafpj3on76uRDoBja/the-ftx-future-fund-team-has-resigned-1?commentId=rwL7vLDsmyyz4KMci\">here</a>, but I very much appreciate someone with much more eloquence and clout saying it too.</p><p>Strong upvoted for all these other excellent points though IMO:</p><blockquote><p>You can try to do a little good in the world, or even <i>sell</i> a little good into the world, without signing up to be the martyr who gets all the blame for not being better when something goes wrong.</p></blockquote><p>and:</p><blockquote><p>If Sequoia Capital can get fooled - presumably after more due diligence and apparent access to books than you could possibly have gotten while dealing with the charitable arm of FTX FF that was itself almost certainly in the dark - then there is no reasonable way you could have known.</p></blockquote><p>and something I'd been starting to think is more likely:</p><blockquote><p>My current guess is more that it'll turn out Alameda made a Big Mistake in mid-2022. &nbsp;And instead of letting Alameda go under and keeping the valuable FTX exchange as a source of philanthropic money, there was an impulse to pride, to not lose the appearance of invincibility, to not be so embarrassed and humbled, to not swallow the loss, to proceed within the less painful illusion of normality and hope the reckoning could be put off forever. &nbsp;It's a thing that happens a whole lot in finance! &nbsp;And not with utilitarians either! &nbsp;So we don't need to attribute causality here to a cold utilitarian calculation that it was better to gamble literally everything, because to keep growing Alameda+FTX was so much more valuable to Earth than keeping FTX at a slower growth rate. &nbsp;It seems to me to appear on the surface of things, if the best-current-guess stories I'm hearing are true, that FTX blew up in a way classically associated with financial orgs being emotional and selfish, <i>not</i> with doing first-order naive utilitarian calculations.</p></blockquote><p>and, finally, this:</p><blockquote><p>I do think that EA needs more of the spirit of people who say: &nbsp;\"Yeah, you pay me, and I'll get the job done that I said I'll do, and then it's my money and I'll use it to make myself happy; and that I'm a good person shows in how I'm undercharging for this and maybe went and accumulated professional expertise in a field where I'd be underpaid, but I still own myself and what I'm paid is still mine.\" &nbsp;</p></blockquote><p>[Edit: And this! \"though the real criticism cares much less about what you actually do and much more about what they just wildly-guess / satisfyingly-imagine you're doing\"]</p>", "parentCommentId": null, "user": null}, {"_id": "aZg5h72GyYd3Jz98L", "postedAt": "2022-11-12T11:41:22.439Z", "postId": "FKJ8yiF3KjFhAuivt", "htmlBody": "<p>Jason has made a&nbsp;<a href=\"https://forum.effectivealtruism.org/users/jason-1\"> comments on this issue</a> with a number of points worth considering; I found <a href=\"https://forum.effectivealtruism.org/posts/yjGye7Q2jRG3jNfi2/ftx-crisis-what-we-know-and-some-forecasts-on-what-will?commentId=tZL8quzTgsgLncSH6\">this thread particularly eye-opening</a>. I came away feeling that the risk of clawbacks shouldn't be ignored.<br><br>Geoffrey Miller also <a href=\"https://forum.effectivealtruism.org/posts/CcNaQmrtdeC9PPixK/under-what-conditions-should-ftx-grantees-voluntarily-return?commentId=5hykmBFrRznuiK7mN\">made the important point </a>that \"if there are any legal 'clawbacks' of money in the future, that would have to be done through official legal channels -- and they might not care that we've already sent money back somewhere for allegedly honorable reasons. So we might end up returning a bunch of money, and then being legally obligated to return the same amount again, and also being required to pay income tax on whatever we first received.\"</p><p>More useful information at Tyrone-Jay's comment <a href=\"https://forum.effectivealtruism.org/posts/BesfLENShzSMeb7Xi/community-support-given-ftx-situation#CCQppBZcnKo5jABPC\">here</a> including a note that from Molly that <a href=\"https://forum.effectivealtruism.org/posts/BesfLENShzSMeb7Xi/?commentId=y7hEdxGhjsYzpg6p3\">OP intends to share information from its external counsel about clawbacks very shortly</a>.&nbsp;</p><p>I'd say people with unspent funds should pay close attention to what OP has to say in the coming days.&nbsp;<br><br>Molly suggests that \"generally FTX grantees should avoid spending additional $$ on legal advice about this just yet\" before reading what OP has to say on the topic, which seems fair enough. But I suspect some people with significant amount of unspent funds may ultimately want to seek legal advice sometime between now and the end of the year.&nbsp;</p><p>For individuals, my understanding is that unspent funds that are still on one's books at the end of 31 Dec may count as \"profits\" and be taxed accordingly, so \"just never spend any of the money\" may be difficult in practice.&nbsp;</p>", "parentCommentId": "caLXhxFzdhfBfFwNG", "user": {"username": "illative"}}, {"_id": "xA2rGhTcJjN3yCBw5", "postedAt": "2022-11-12T11:58:06.765Z", "postId": "FKJ8yiF3KjFhAuivt", "htmlBody": "<p>I think there's at least some difference between [money you've already been paid for work you've already done] and [money you've been granted for future work that you have not yet done / money you haven't yet spent on hiring other people / etc.]; I very clearly agree with you in the first case and think it's at least murkier in the second case.</p>", "parentCommentId": null, "user": {"username": "tcheasdfjkl"}}, {"_id": "nQjeSGbh6yLshkrRd", "postedAt": "2022-11-12T13:06:45.265Z", "postId": "FKJ8yiF3KjFhAuivt", "htmlBody": "<p>Strongly, very strongly endorse and agree with this take.</p>\n<p>The perspective of lawfully selling utilons for money was a perspective that I didn't know I was missing in viewing philanthropy.</p>\n", "parentCommentId": null, "user": {"username": "Dragon God"}}, {"_id": "tctoMbfgXMrmhitDY", "postedAt": "2022-11-12T13:12:50.788Z", "postId": "FKJ8yiF3KjFhAuivt", "htmlBody": "<blockquote>\n<p>One thing I definitely believe, and have commented on before[1], is that median EA's (I.e, EA's without an unusual amount of influence) are over-optimising for the image of EA as a whole, which sometimes conflicts with actually trying to do effective altruism. Let the PR people and the intellectual leaders of EA handle that - people outside that should be focusing on saying what we sincerely believe to be true</p>\n</blockquote>\n<p>FWIW, I'm directly updating on this (and on the slew of aggressively bad faith criticism from detractors following this event).</p>\n<p>I'll stop trying to think about how we should optimise for and manage PR, and default to honesty and accurate representation (as opposed to strategic presentation of our positions to make them  more appealing/easier to accept).\n(This is not to imply that I ever condoned lying, but I have thought that it may be better to e.g. change which parts of EA messaging we highlight based on what people seem best receptive to vs our real cruxes: e.g. justify existential risk mitigation because 8 billion people dying is bad, instead of via inaccessible longtermist arguments.)</p>\n", "parentCommentId": "4aLxFNkzjfq55mnhE", "user": {"username": "Dragon God"}}, {"_id": "Ckw3bpePqahuHDQW6", "postedAt": "2022-11-12T13:33:17.702Z", "postId": "FKJ8yiF3KjFhAuivt", "htmlBody": "<p>Nitpick:</p><blockquote><p>It's fine to call it your charity and your contribution that you undercharge for those utilons and don't capture as much value as you create - <i>if </i>you're nice enough to do that, which you don't have to be, you can be Lawful Neutral instead of Lawful Good and I won't think you're <i>as </i>cool but I'll still happily trade with you.</p></blockquote><blockquote><p>(I apologize for resorting to the D&amp;D alignment chart, at this point, but I really am not sure how to compactly express these ideas without those concepts, or concepts that I could define more elaborately that would mean the same thing.)</p></blockquote><p>I like \"playing on the side of humanity\" (or the more verbose \"playing on the side of all sentient beings\"), in contrast with \"playing for your own side\". So I might say something like:</p><blockquote><p>You don't have to be playing on the side of humanity all the time, you can also look out for your own interests—and in practice you should be doing a mix of the two. I won't think you are <i>as</i> cool if you are primarily looking out for number one, but I'll still happily collaborate with you.</p></blockquote>", "parentCommentId": null, "user": {"username": "NunoSempere"}}, {"_id": "i2yombqwRLneqzCXH", "postedAt": "2022-11-12T15:11:29.912Z", "postId": "FKJ8yiF3KjFhAuivt", "htmlBody": "<p>I think this is clearly right insofar as it pertains to grant money already \"earned\" and insofar as it states that the moral bar for philantrophic service providers should be no higher than for other service providers.</p>\n<p>However, I think its reasoning may not apply to portions of a grant contract that are presently \"unearned.\" To extend your examples, I am not convinced the grantee's obligations are materially different from those of a stadium authority or a plumber. Both are fine to retain monies for services already rendered.</p>\n<p>But I am not convinced the stadium authority, for instance, could ethically retain the unearned portion of the contract monies as long as it carried through on its commitment to use the FTX name for the next decade. Like the naming, the further execution of the grant contracts generates no utility for the estate/victims, and there is no super strong reliance argument as there is for completed acts.</p>\n<p>That isn't to say that I think there is an ethical obligation to return any funds that are presently unearned -- I think that will depend on facts yet to be discovered.</p>\n", "parentCommentId": null, "user": {"username": "Jason"}}, {"_id": "ZM4Avf6sQqamsEESj", "postedAt": "2022-11-12T16:04:31.213Z", "postId": "FKJ8yiF3KjFhAuivt", "htmlBody": "<p>What does \"IMPCO\" mean? Search engines are failing me.</p>", "parentCommentId": null, "user": {"username": "Taymon"}}, {"_id": "cPxAMdXcjxhTZCg3f", "postedAt": "2022-11-12T16:06:33.578Z", "postId": "FKJ8yiF3KjFhAuivt", "htmlBody": "<p>“In my possibly contrarian opinion”, I assume invented here (it’s the opening line).</p>\n", "parentCommentId": "ZM4Avf6sQqamsEESj", "user": {"username": "Erich_Grunewald"}}, {"_id": "6sJTGKYw7CzgrhdiL", "postedAt": "2022-11-12T16:30:20.542Z", "postId": "FKJ8yiF3KjFhAuivt", "htmlBody": "<p>I agree very much with your guess that SBF's main mistake was pride.</p>\n<p>I still have some unpleasant memories from the 1984 tech stock bubble, of being reluctant to admit that my successes during the bull market didn't mean that I knew how to handle all market conditions.</p>\n<p>I still feel some urges to tell the market that it's wrong, and to correct the market by pushing up prices of fallen stocks to where I think they ought to be. Those urges lead to destructive delusions. If my successes had gotten the kind of publicity that SBF got, I expect that I would have made mistakes that left me broke.</p>\n", "parentCommentId": null, "user": {"username": "PeterMcCluskey"}}, {"_id": "hri2MuqJfyqLLwkE4", "postedAt": "2022-11-12T17:02:15.364Z", "postId": "FKJ8yiF3KjFhAuivt", "htmlBody": "<p>Eliezer -- I strongly agree with this, and thanks for expressing these views in a clear and timely way.&nbsp;</p><p>I've seen some amount of EAs beating themselves up about 'we should have known better than to trust SBF and FTX'.&nbsp;</p><p>Well, FWIW, I've been involved in crypto investing pretty intensively for a couple of years, and have followed crypto news fairly closely. Every crypto protocol, exchange, business, and ideas attracts its share of FUD (fear, uncertainty, &amp; doubt -- i.e. strategic slander from short-sellers and rival businesses). Lots of people were skeptical about Luna before it collapsed. Lots of people have been skeptical about the Tether stablecoin for years, and it hasn't collapsed yet. &nbsp;People were skeptical about Solana being quite centralized and having VC backing -- but I don't recall much concern about Solana having SBF's backing.&nbsp;</p><p>I honestly didn't see big red flags around FTX being waved by crypto journalists or influencers. &nbsp;FTX seemed to attract a lot less FUD and skepticism than most other crypto businesses. (I could be wrong, and this is an empirical question -- one would need to quantify relative FUD amounts across projects, maybe in proportion to their market cap or trading volume.) &nbsp;</p><p>I didn't happen to use FTX myself, because I preferred using exchanges that were registered in the US for legal purposes, and that used 'proof of reserve' audits to verify user funds. But I could easily imagine a counterfactual world in which I transferred a lot of crypto to FTX -- trusting partly in its EA bona fides -- and lost everything.</p><p>Long story short, I agree with one of Eliezer's key points: if the smartest VCs in crypto and Silicon Valley thought FTX was a great investment and an honorable company, and they have access to all the due diligence and internal data and audits that EA organizations didn't, and if crypto journalists were NOT routinely warning that FTX was a shady company, then maybe we shouldn't be beating ourselves up too hard about having been duped.&nbsp;</p><p>(Epistemic status: moderate at best; subject to updating given new information about a complex, ongoing crisis).</p>", "parentCommentId": null, "user": {"username": "geoffreymiller"}}, {"_id": "Xeik59hdJsEWnM7u9", "postedAt": "2022-11-12T18:54:42.268Z", "postId": "FKJ8yiF3KjFhAuivt", "htmlBody": "<p>If the community is paying back, I think it makes more sense for this to become primarily the responsibility of major funders instead of individual grantees, for practical reasons. I don't think individual EAs need to take on hardship to pay it back, and we can consider large funders paying on their behalf to be community support work or grants that they would have made anyway. Also, having major funders pay is more efficient than having individual grantees each worry about this.</p>", "parentCommentId": null, "user": {"username": "MichaelStJules"}}, {"_id": "fgSn7awTCA7o6J3cG", "postedAt": "2022-11-12T20:00:01.706Z", "postId": "FKJ8yiF3KjFhAuivt", "htmlBody": "<p>I strongly endorse this (and also strongly endorse Eliezer's OP).</p><p>A <a href=\"https://forum.effectivealtruism.org/posts/mCCutDxCavtnhxhBR/some-comments-on-recent-ftx-related-events?commentId=a7pGb9BeBdxBgD8LM\">related comment</a> I made just before reading this post (in response to someone suggesting that we ditch the \"EA\" brand in order to reduce future criticism):</p><blockquote><p>I strongly disagree -- first, because this is dishonest and dishonorable. And second, because I don't think EA should try to have an immaculate brand.</p><p>Indeed, I suspect that part of what went wrong in the FTX case is that EA was optimizing <i>too hard</i> for having an immaculate brand, at the expense of optimizing for honesty, integrity, open discussion of what we actually believe, etc. I don't think this is the only thing that was going on, but it would help explain why people with concerns about SBF/FTX kept quiet about those concerns. Because they either were worried about sullying EA's name, or they were worried about social punishment from others who didn't want EA's name sullied.</p><p>IMO, trying super hard to never have your brand's name sullied, at the expense of ordinary moral goals like \"be honest\", tends to sully one's brand far more than if you'd just ignored the brand and prioritized other concerns. Especially insofar as the people you're trying to appeal to are very smart, informed, careful thinkers; you might be able to trick the Median Voter that EA is cool via a shallow PR campaign and attempts to strategically manipulate the narrative, but you'll have a far harder time tricking the sorts of extremely smart, educated, morally scrupulous people who EA is <i>actually</i> mostly trying to recruit and persuade.</p><p>And this is especially especially true insofar as you're trying to get a huge diffuse community to all play along with your fake narrative! It's not as though you can send out a memo to all EAs to dissemble in a specific way that furthers your narrative; the memo will just leak and cause more harm than good. EA needs to give up on this \"have an immaculate brand\" mirage and shift its mindset toward goals more like \"exemplify real virtues\", \"focus on the object level\", and \"specialize in the niche of being The Group That Speaks Truth Even When It's Uncomfortable\". You won't win over everyone that way, but you'll win more of the battles that matter, and that are actually winnable.</p></blockquote><p>I've expressed my own concerns in the past about the term \"EA\", more in line with \"this brand creates too much of a temptation to try to <a href=\"https://www.lesswrong.com/posts/ZSWsWyzW2PfvoLPPi/what-is-ra\">Look Immaculate</a> rather than Be Scrupulously Honest\", and in line with Eliezer's concern that people are twisting themselves up in knots out of a perceived pressure to be Good, rather than finding a more healthy balancing point.</p><p>But I strongly, strongly disendorse this <i>reason</i> to change brand ⁠— not just because it's an obvious overreaction, but because it's moving EA in the wrong direction.</p><p>If we ever rebranded, we should if anything plausibly try for a <i>less</i> immaculate-looking brand ⁠— something messier, weirder, and less possessed of a Virtuous Glow. Something that encourages us more to keep our focus on The Work and on personal integrity (in multiple respects), rather than tempting and distracting participants with the possibility of <a href=\"https://twitter.com/robbensinger/status/1557152326988677120\">Looking Amazingly Good To The Entire World</a>.</p><p>I do think it's good for us to take pride in what we're doing, because I think we're legitimately doing things that warrant pride. I think most of the stuff I've done since joining the rationalists and EAs has been goddam awesome, and I find it fun as heck to get to collaborate and chat with other people working on cool ambitious projects to make the world more awesome.</p><p>But I think there's something that breaks when that personal pride and happy camaraderie sublimates into \"wow I'm participating in this legibly immaculately good Abstraction called Effective Altruism\" sorts of feelings.</p>", "parentCommentId": "4aLxFNkzjfq55mnhE", "user": {"username": "RobBensinger"}}, {"_id": "HCtKaoToXk9XSwn5Y", "postedAt": "2022-11-12T20:10:44.504Z", "postId": "FKJ8yiF3KjFhAuivt", "htmlBody": "<p>I'm mostly uninformed on this topic, but this all sounds very plausible to me ⁠— more plausible than very hindsight-bias-y accounts along the lines of \"I didn't guess this in advance, but of course it should have been obvious\".</p><p>I do want to note that \"we should be wary of hindsight, and not assume this was obvious\" is compatible with \"we should give extra epistemic credit to people who <i>did</i> in fact correctly call this, especially insofar as they gave good supporting arguments at the time\".</p><p>Even if this was difficult to predict, we should expect there to have been <i>some</i> hints out there that people could pick up on, and to some degree we should update in favor of the heuristics that paid attention to those hints.</p>", "parentCommentId": "hri2MuqJfyqLLwkE4", "user": {"username": "RobBensinger"}}, {"_id": "tiMtJrmQb2JhymJsX", "postedAt": "2022-11-12T20:26:14.723Z", "postId": "FKJ8yiF3KjFhAuivt", "htmlBody": "<p>I think Eliezer specifically has in mind something like:</p><ul><li>You're more \"Good\" insofar as you <a href=\"https://www.lesswrong.com/posts/n5ucT5ZbPdhfGNLtP/terminal-values-and-instrumental-values\">terminally</a> care about others' welfare. (Where \"maximum Good\" means that you care about a stranger's happiness just as much as you care about your own happiness.)</li><li>You're more \"Lawful\" insofar as you have <a href=\"https://arbital.com/p/coherence_theorems/\">coherent preferences</a>, employ <a href=\"https://www.lesswrong.com/posts/WQFioaudEH8R7fyhm/local-validity-as-a-key-to-sanity-and-civilization\">valid reasoning patterns</a>, and follow <a href=\"https://arbital.com/p/logical_dt/\">logical decision theory</a>. (So, e.g., the ability to make binding precommitments -- and to do the thing you wish you'd precommitted to, even if you didn't actually precommit -- is part of being \"Lawful\". Which in turn means that being an honest, trustworthy trading partner is part of being \"Lawful\", insofar as you live in a world where being a visibly honest-and-trustworthy trading partner is rewarded more than it's punished.)</li></ul><p>I may be getting the details wrong, but I gather it's something like that. \"Evil\" means that you're minimally Good; \"Chaotic\" means that you're minimally Lawful; \"Neutral\" means that you're somewhere in the middle, on one or both of those axes.</p>", "parentCommentId": "2YY6rH2Y7ycRPjP5X", "user": {"username": "RobBensinger"}}, {"_id": "jE2Gjw6EzLjerBszf", "postedAt": "2022-11-12T20:32:01.754Z", "postId": "FKJ8yiF3KjFhAuivt", "htmlBody": "<p>Still, it might make more sense for this to come from cause-specific budgets, so that longtermist funding from FTX and associates is paid back from the longtermist EA budget, and global health and development funding from FTX and associates is paid back from the GHD EA budget, and so on. You shouldn't be able to shift EA funding between causes by committing fraud.</p>", "parentCommentId": "Xeik59hdJsEWnM7u9", "user": {"username": "MichaelStJules"}}, {"_id": "YusdNdyRqKfp2dhGe", "postedAt": "2022-11-12T20:38:23.067Z", "postId": "FKJ8yiF3KjFhAuivt", "htmlBody": "<p>Agreed.</p><p>I argued for major funders doing this (at least if some conditions hold) <a href=\"https://forum.effectivealtruism.org/posts/xafpj3on76uRDoBja/the-ftx-future-fund-team-has-resigned-1?commentId=KqTMmooorFr79tDaN\">here</a>, and argued against the grant recipients doing this <a href=\"https://forum.effectivealtruism.org/posts/xafpj3on76uRDoBja/the-ftx-future-fund-team-has-resigned-1?commentId=tXaFxp5Zr3mEBasqK\">here</a>.</p>", "parentCommentId": "Xeik59hdJsEWnM7u9", "user": {"username": "RobBensinger"}}, {"_id": "WA2dx5KkE8ETtpYhQ", "postedAt": "2022-11-12T20:43:38.300Z", "postId": "FKJ8yiF3KjFhAuivt", "htmlBody": "<p>Ehhh, maybe? I feel like giving money back to people EAs took advantage of isn't part of the \"longtermist cause\"; it's part of the \"do right by people who EAs harmed\" cause.</p><p>I don't particularly mind if that money comes from the longtermist budget, but I wouldn't want to delay the \"doing right\" part on that account.</p><p>Like, you could claim that it's only longtermists who are responsible, because SBF was a longtermist. But you could also claim that it's only a narrower group that's responsible, because SBF had lots of specific views that aren't universal among longtermists. I don't want to go <i>too</i> far down that road, because carving things up too finely eventually means that no one in EA takes responsibility, since we can all claim to have different views from SBF on some dimension.</p>", "parentCommentId": "jE2Gjw6EzLjerBszf", "user": {"username": "RobBensinger"}}, {"_id": "GHyymQDgiPL2iX5Gg", "postedAt": "2022-11-12T20:54:02.239Z", "postId": "FKJ8yiF3KjFhAuivt", "htmlBody": "<p>I think the main (only?) reason for doing it by cause would be to deter such future harms in the name of specific views, not about righting wrongs to others or attributing responsibility to specific views or groups. Otherwise EAs are more likely to think the expected benefits of unethical behaviour outweigh the expected costs, because they get to shift the expected costs onto other causes they care less about.</p><p>I don't think there needs to be delay here. If Open Phil primarily takes this on, they could pay first and then rebudget later. OTOH, if other longtermist funders take some of this on, it'll be more clear to the public that longtermists are contributing specifically to paying off their \"debts\" (even if funding is pretty fungible and this shouldn't really matter). I agree that carving things up can be pretty complicated, in principle. I guess I don't expect this to matter too much, but I could see others disagreeing, since I'm less familiar with the disagreements within longtermism. Also, it's not about attributing responsibility to specific views, but tracking benefits. We know who got grants from FTX and associates, and we want to simulate them paying it back.</p><p>(I made some edits to this comment within the first 18 minutes of posting this comment, in case you were already reading or replying.)</p><p>EDIT: I guess we know less about where those benefits would have gone otherwise if not for FTX, which is still a problem, and can depend on differences in views within longtermism. This also applies to grantees paying back instead of funders.</p><p>Also, I guess another reason is that it's just more fair to other causes that benefited less that they should pay less.</p>", "parentCommentId": "WA2dx5KkE8ETtpYhQ", "user": {"username": "MichaelStJules"}}, {"_id": "HJiehsbGwmYczD8BD", "postedAt": "2022-11-12T21:16:44.006Z", "postId": "FKJ8yiF3KjFhAuivt", "htmlBody": "<p>Not sure why someone decided to (strong) downvote (and not just disagreevote) your comment here. I've upvoted your comment, since I think it has useful considerations, and neither agree nor disagree overall, since I don't actually have a strong enough opinion here.</p>", "parentCommentId": "WA2dx5KkE8ETtpYhQ", "user": {"username": "MichaelStJules"}}, {"_id": "FQFchzntNbvJisGPK", "postedAt": "2022-11-12T21:53:42.280Z", "postId": "FKJ8yiF3KjFhAuivt", "htmlBody": "<p>Someone raised the point that if EAs try to offset the harm SBF caused, this creates a moral hazard of the form \"people may be more willing to cause harm in the name of EA in the future, expecting other EAs to offset that harm\".</p><p>I think that's a stronger objection to \"offset all of SBF's harms\" (which I don't endorse anyway) than to \"collectively (at the community level, not the individual org level) give back the amount EA received\", but maybe it will shift my view once I've chewed on it a bit more. At a glance, I don't think I'd expect this concern to be a dominant factor?</p>", "parentCommentId": "YusdNdyRqKfp2dhGe", "user": {"username": "RobBensinger"}}, {"_id": "ihT7MZSMMx6K9YF6j", "postedAt": "2022-11-12T21:57:14.209Z", "postId": "FKJ8yiF3KjFhAuivt", "htmlBody": "<p>Our offsetting their harms out of the budget for things they care most about should be bad by their own lights, though, unless they're naive consequentialists (which they may disproportionately be). They should care more about the harms this way, since it's clear it's counterproductive by their own lights, whereas it's easy to discount harms to FTX customers relative to longtermist (or generally EA) donations.</p>\n", "parentCommentId": "FQFchzntNbvJisGPK", "user": {"username": "MichaelStJules"}}, {"_id": "zBiSpFMwNWHA4XQ9g", "postedAt": "2022-11-12T22:23:39.924Z", "postId": "FKJ8yiF3KjFhAuivt", "htmlBody": "<p>Agreed, though I think the primary reason the EA community should collectively give back money that was stolen and given to us is \"it's the right thing to do\".</p><p>This is related to incentives, and there are complicated ways in which being a high-integrity, broadly honorable community finds a lot of its justification in game-theoretic LDT-ish arguments, but I think EAs empirically are better at reasoning about \"what's the right thing to do?\" than at explicitly reasoning about LDT.</p>", "parentCommentId": "ihT7MZSMMx6K9YF6j", "user": {"username": "RobBensinger"}}, {"_id": "2SyCj6PH4bXZoopWq", "postedAt": "2022-11-12T23:22:34.112Z", "postId": "FKJ8yiF3KjFhAuivt", "htmlBody": "<p>Thank you. I appreciate thought leaders stepping up in this crisis, which points to the resilience of this movement. My husband was the happiest I’ve seen him in days when he found that you had written a new post.</p>\n<p>I want to highlight a small section “ Be kind to yourself, ask what a friend would tell you, when you judge how much hardship it would be to repay; because I'm worried I know too many people who are going to be way too harsh about that.”</p>\n<p>This is a technique in psychology called Mindful Self-Compassion, which I have studied and found very useful personally and with my patients (I’m a physician, not a psychologist). The three elements are self-kindness (vs self-judgement), recognizing our common humanity (vs isolation) and mindfulness (vs over-identification).\nSee <a href=\"http://self-compassion.org\">self-compassion.org</a> for more</p>\n<p>Be gentle with yourselves EAs.</p>\n", "parentCommentId": null, "user": {"username": "Lauren Reid"}}, {"_id": "chMGSjzS2tsi4gT7D", "postedAt": "2022-11-12T23:28:18.515Z", "postId": "FKJ8yiF3KjFhAuivt", "htmlBody": "<p>Thank you, Lauren, I feel like this is the first purely kind comment I've seen on this forum in days and it feels super refreshing. (See, even this one of mine is a dig at the rest of us!)</p>", "parentCommentId": "2SyCj6PH4bXZoopWq", "user": null}, {"_id": "ENErMKu4KtZHsXnk6", "postedAt": "2022-11-12T23:39:21.863Z", "postId": "FKJ8yiF3KjFhAuivt", "htmlBody": "<p>I guess it's more complicated than this, because FTX entering as a funder and disproportionately funding longtermism may have freed up funding for other cause areas. Still, I'd guess the counterfactual was disproportionately to the benefit of longtermism. We could try to simulate what would have happened without FTX and check where the extra money went. If only direct beneficiaries pay up, this is unfair to them, and indirect beneficies get away without paying.</p>\n", "parentCommentId": "jE2Gjw6EzLjerBszf", "user": {"username": "MichaelStJules"}}, {"_id": "Jwhigf9zhT7EAtuZE", "postedAt": "2022-11-13T00:25:58.983Z", "postId": "FKJ8yiF3KjFhAuivt", "htmlBody": "<p>I think that's fair, but even when we consider the \"right thing to do\", there's still a question of on whom this burden is supposed to fall and how to do this in a fair way. Even for cross-cause funders, if they model themselves as multiple cause-specific agents or representing sections of the EA community, there's still an issue of being fair to those agents or community sections. I think tracking the counterfactual without FTX/Alameda (or just their bad actions) would be the most accurate way to capture this + maybe some more pooled EA community fund thing.</p>\n<p>One way to think about it is to ask who benefited counterfactually, whether directly and indirectly (through  counterfactually shifting budgets) from FTX funds, and treat those individuals as owing debt equal to the counterfactual funding received. Some individuals who actually received FTX funding might not have even benefited counterfactually. Then funders can decide which debts to take on, which might happen by cause or worldview, e.g. global health people might not feel like they should take on the debts of longtermists, although they might anyway towards a community pool.</p>\n<p>(Also, I don't think LDT really needs to come into it specifically. Are the different decision theories going to disagree dramatically here? Or, at least, I think they should all recognize some deterence value here, but maybe give it different relative weight.)</p>\n", "parentCommentId": "zBiSpFMwNWHA4XQ9g", "user": {"username": "MichaelStJules"}}, {"_id": "zGJPcdDzxRspmy9yK", "postedAt": "2022-11-13T01:42:27.062Z", "postId": "FKJ8yiF3KjFhAuivt", "htmlBody": "<p>Amendment for the sake of thoroughness: &nbsp;Looking back, I think at one point I was passing through the Bahamas anyways, and asked FTX if they wanted me to stay over a week and talk to a bunch of visiting EAs they had in a Nassau hotel. &nbsp;I paid for the hotel (and later an Airbnb when the hotel ran out) out of pocket, and was reimbursed for that by FTX or FTX FF or something. &nbsp;I hardly consider this 'being funded', I didn't go to any beaches or try to turn it into a vacation, more like I did some free work for them and had a place to stay while doing it; but there was nonetheless at one point a reimbursement that went from FTX wallet to Yudkowsky wallet. &nbsp;I myself consider this unimportant, but in matters like these it is important to be thorough.</p>", "parentCommentId": null, "user": {"username": "EliezerYudkowsky"}}, {"_id": "KmNAkhpCXkrwM4kJ3", "postedAt": "2022-11-13T02:19:12.433Z", "postId": "FKJ8yiF3KjFhAuivt", "htmlBody": "<p>I think you earned that 10%, saved it, and it's yours to dispose of as you wish. &nbsp;When you're trading, you are not obligated to trade only for your rent, groceries, tuition, and taxes. &nbsp;You're allowed to trade for more money than that, which can go to your nightlife, computer games, or donations. &nbsp;The electrical company keeps all the money that FTX paid for electricity, rather than trying to calculate how much they spent on fuel and depreciation and returning the excess amount as a dirty profit, and nobody questions that because the electrical company is not trying to be Good so they don't look like targets for urged martyrdom.</p><p>If you think that donating to this particular cause does the most good, go for it; if it'll ease your conscience to donate there rather than elsewhere when you were planning to donate anyways, go for it; if you feel like this is what you should do to be true to your deontology, do it and have no regrets.</p><p>But I am going to push back against the idea that you didn't already earn that 10%. &nbsp;You did; you already performed all of the services that the Future Fund offered to pay you for. &nbsp;The amount that you trade your labor for in excess of rent and groceries is also yours. &nbsp;And it now being yours, you should do with it what you feel rightest about doing - but do so freely, not out of guilt or obligation. &nbsp;I strongly suspect you of being an unusually good person on the basis of having engaged in mutually beneficial trade with the Future Fund rather than any number of better-paying or more career-building employers; I won't tell you to hold yourself to a low standard, but only <i>you</i> have the right to hold yourself to any higher standard than that.</p>", "parentCommentId": "u2pfFxqZSjDqnuAox", "user": {"username": "EliezerYudkowsky"}}, {"_id": "zBi6YBjYK2GmgEFNk", "postedAt": "2022-11-13T14:05:42.955Z", "postId": "FKJ8yiF3KjFhAuivt", "htmlBody": "<blockquote>\n<p>But I am not convinced the stadium authority, for instance, could ethically retain the unearned portion of the contract monies as long as it carried through on its commitment to use the FTX name for the next decade.</p>\n</blockquote>\n<p>That's not really how naming rights deals are structured. IANAL, but the sponsor doesn't pay all the money upfront, but a yearly tranche of money over the terms of a deal (typically 10- 20 years). I doubt Miami will keep collecting now, but I suppose it depends on the contract whether they'll be owed anything in bankruptcy.</p>\n", "parentCommentId": "i2yombqwRLneqzCXH", "user": {"username": "zdk"}}, {"_id": "yCqJbX8YnnPPbKFqF", "postedAt": "2022-11-13T16:29:14.398Z", "postId": "FKJ8yiF3KjFhAuivt", "htmlBody": "<p>Correct, but it's likely that the stadium authority received compensation in advance rather than in arrears. E.g., on day 1 it received $10MM which it \"earned\" through the year by keeping the name on, then gets another $10MM on day 366 which it was to earn from days 366 to 730...</p>\n<p>So like some grantees, it has likely received payment that had not been earned at the time of the insolvency.</p>\n", "parentCommentId": "zBi6YBjYK2GmgEFNk", "user": {"username": "Jason"}}, {"_id": "WbEe2frb5moRavXpk", "postedAt": "2022-11-14T19:13:52.900Z", "postId": "FKJ8yiF3KjFhAuivt", "htmlBody": "<figure class=\"media\"><div data-oembed-url=\"https://manifold.markets/JonathanRay/will-any-ftxff-grantee-be-legally-c\">\n\t\t\t\t<div class=\"manifold-preview\">\n\t\t\t\t\t<iframe src=\"https://manifold.markets/JonathanRay/will-any-ftxff-grantee-be-legally-c\">\n\t\t\t\t</iframe></div>\n\t\t\t</div></figure>", "parentCommentId": null, "user": {"username": "jwray"}}, {"_id": "9jcKxqM2aHfiKm26L", "postedAt": "2022-11-15T00:55:13.005Z", "postId": "FKJ8yiF3KjFhAuivt", "htmlBody": "<figure class=\"media\"><div data-oembed-url=\"https://manifold.markets/EliezerYudkowsky/will-5-of-an-ftx-grant-be-clawed-ba\">\n\t\t\t\t<div class=\"manifold-preview\">\n\t\t\t\t\t<iframe src=\"https://manifold.markets/embed/EliezerYudkowsky/will-5-of-an-ftx-grant-be-clawed-ba\">\n\t\t\t\t</iframe></div>\n\t\t\t</div></figure>", "parentCommentId": "WbEe2frb5moRavXpk", "user": {"username": "EliezerYudkowsky"}}, {"_id": "cPEcpeCLzptnLwfQq", "postedAt": "2022-11-17T09:45:05.406Z", "postId": "FKJ8yiF3KjFhAuivt", "htmlBody": "<blockquote>\n<p>If Sequoia Capital can get fooled - presumably after more due diligence and apparent access to books than you could possibly have gotten while dealing with the charitable arm of FTX FF that was itself almost certainly in the dark - then there is no reasonable way you could have known.</p>\n</blockquote>\n<p>Sequoia has different incentives than EA. By design investments have limited liability, and “companies should be leveraged and hold a linear utility curve” is a dominant concept in finance.  FTX unethically using customer deposits would’ve broadly aligned with Sequoia’s interests so long as Sequoia retained the ability to distance themselves from legal and reputational damage.</p>\n<p>Sequoia was incentivized to engage in a degree of wilful ignorance, and I would suspect they did so.</p>\n", "parentCommentId": null, "user": {"username": "RagtagJack"}}, {"_id": "FS8Mtd98GWekWn6oo", "postedAt": "2022-11-24T22:26:46.795Z", "postId": "FKJ8yiF3KjFhAuivt", "htmlBody": "<p>Here's a list of all the financial interactions between MIRI and FTX/Alameda/SBF: <a href=\"https://twitter.com/robbensinger/status/1595893840484843521\">https://twitter.com/robbensinger/status/1595893840484843521</a>&nbsp;</p>", "parentCommentId": "zGJPcdDzxRspmy9yK", "user": {"username": "RobBensinger"}}]