[{"_id": "RGDt9wf67aektSrcG", "postedAt": "2022-09-06T16:50:01.146Z", "postId": "FKLAbyKwZt3KP4s5c", "htmlBody": "<p>Other views on decision theory and credences matter, too, like how you deal with cluelessness and what you're clueless about, whether you maximize expected value at all, whether you think you should do things that have only a 1 in a million chance of having the intended impact, the shape of your utility function, if any (both bounded and unbounded ones have serious problems).</p>\n", "parentCommentId": null, "user": {"username": "MichaelStJules"}}, {"_id": "yNhDyKojRyfdcLGQw", "postedAt": "2022-09-06T17:19:40.988Z", "postId": "FKLAbyKwZt3KP4s5c", "htmlBody": "<p>What if you did hyperbolic discounting rather than exponential discounting? What would change in this analysis?</p>\n", "parentCommentId": null, "user": {"username": "Sharmake"}}, {"_id": "vD7rnSqH2NrYa9aeN", "postedAt": "2022-09-06T17:22:52.232Z", "postId": "FKLAbyKwZt3KP4s5c", "htmlBody": "<p>I should make a post on cluelessness, but over the very long term future like thousands of years, longtermism suffers less than you think naively on cluelessness considerations.</p>\n", "parentCommentId": "RGDt9wf67aektSrcG", "user": {"username": "Sharmake"}}, {"_id": "ZLKQH5kJqiJ3s8R5r", "postedAt": "2022-09-06T18:20:16.755Z", "postId": "FKLAbyKwZt3KP4s5c", "htmlBody": "<p>Hyperbolic discounting is a 'time inconsistent' form of discounting where delays early on are penalised more than delays later on. This results in a 'fat tail' where it takes a long time for a hyperbolic function to get near zero. Over a long enough time period, an exponential function (for example growth in happiness driven by population growth) will always be more extreme than a hyperbolic function (for example discount rate in this scenario).</p><p>So actually the title should perhaps be reworded; the <strong>shape</strong> of the discount function matters just as much (if not more so than) the parameterisation of that function. A hyperbolic discount function will always result in longtermism dominating neartermism.</p><p>Having said that, I don't think anyone believes hyperbolic discount rates are anything other than a function of time preference, and the consensus amongst EAs seems to be that time preference should be factored out of philanthropic analysis.</p>", "parentCommentId": "yNhDyKojRyfdcLGQw", "user": {"username": "Froolow"}}, {"_id": "spqhkgwmmi3vJEmbs", "postedAt": "2022-09-06T18:22:05.366Z", "postId": "FKLAbyKwZt3KP4s5c", "htmlBody": "<p><strong>ADDENDUM</strong>: There is an excellent post <a href=\"https://forum.effectivealtruism.org/posts/zLZMsthcqfmv5J6Ev/the-discount-rate-is-not-zero\">here</a>&nbsp;about why the discount rate is probably not zero based on an analysis of existential risk rates. However, I think the post assumes a lot of background familiarity with the theory of discount rates, and doesn’t – for example – explicitly identify that existential risk is probably not the biggest reason to discount the future (even absent time-preference). Would an effortpost which is a deep dive into discount rates as understood by economists be helpful?</p>", "parentCommentId": null, "user": {"username": "Froolow"}}, {"_id": "wG3Qir4AQ3KcjdD2w", "postedAt": "2022-09-06T19:16:30.236Z", "postId": "FKLAbyKwZt3KP4s5c", "htmlBody": "<p>Admittedly, this is a bit of a contrarian take on discount functions, but hyperbolic discounting is more rational than economists or EAs think once we introduce uncertainty. I'll provide links here for my contrarian take:</p>\n<p><a href=\"https://www.lesswrong.com/posts/tH8bBKCvfdjBKMDqt/link-hyperbolic-discounting-is-rational\">https://www.lesswrong.com/posts/tH8bBKCvfdjBKMDqt/link-hyperbolic-discounting-is-rational</a></p>\n<p><a href=\"http://physicsoffinance.blogspot.com/2011/07/discountingdetails.html?m=1\">http://physicsoffinance.blogspot.com/2011/07/discountingdetails.html?m=1</a></p>\n", "parentCommentId": "ZLKQH5kJqiJ3s8R5r", "user": {"username": "Sharmake"}}, {"_id": "7AQ6gtnAwEtBH6sT4", "postedAt": "2022-09-07T08:39:34.353Z", "postId": "FKLAbyKwZt3KP4s5c", "htmlBody": "<p>A keyword to search for here might be \"Patient Philanthropy\", and in particular the work of Phil Trammel on this topic (e.g., <a href=\"https://globalprioritiesinstitute.org/wp-content/uploads/Trammell-Dynamic-Public-Good-Provision-under-Time-Preference-Heterogeneity.pdf\">1</a>, <a href=\"https://docs.google.com/document/d/1NcfTgZsqT9k30ngeQbappYyn-UO4vltjkm64n4or5r4/edit\">2</a>)</p>", "parentCommentId": null, "user": {"username": "NunoSempere"}}, {"_id": "tfdahL44SvcytrDmQ", "postedAt": "2022-09-24T04:17:03.161Z", "postId": "FKLAbyKwZt3KP4s5c", "htmlBody": "<p>Can you say a bit more about how each of those considerations affect whether one should be longtermist or short-termist?&nbsp;</p>", "parentCommentId": "RGDt9wf67aektSrcG", "user": {"username": "Mo Nastri"}}]