[{"_id": "2gDHmaatmFYzh6CTj", "postedAt": "2024-03-13T17:55:17.258Z", "postId": "FKWYNcWixfuJK3D7z", "htmlBody": "<p>This was super informative for me, thank you.</p><p>I'm confused by this section in this interview:<br>&nbsp;</p><p>\"Well, the simplest toy example is just going to be, imagine that you have some assessment that says, I think chickens are in a really bad state in factory farms, and I think that if we move layer hens from battery cages into a cage-free environment, we make them 40% better off. And I think that after doing this whole project — whatever the details, we’re just going to make up the toy numbers — I think that chickens have one-tenth of the welfare range of humans.</p><p>So now we’ve got 40% change in the welfare for these chickens and we’ve got 10% of the welfare range, so we can multiply these through and say how much welfare you’d be getting in a human equivalent for that benefit to one individual. Then you multiply the number of individuals and you can figure out how much benefit in human units we would be getting.\"</p><p>&nbsp;</p><p>It doesn't seem to me that this follows. Let's assume the \"typical\" welfare range for chickens is -10 to 10. Let's also assume that for humans it's -100 to 100. &nbsp;This is how I interpret \"chickens have 10% of the welfare range of the humans\". Let's also assume moving from cage to cage-free eliminates 50% of the suffering. We still don't know whether that's a move from -10 to -5 or -6 to -3. We also don't know how to place QALYs within this welfare range. When we save a human, should we assume their welfare to be 100 throughout their life?</p><p>This also makes it even more crucial to provide a tight technical definition for welfare range so that scientists can place certain experiences within that range.</p>", "parentCommentId": null, "user": {"username": "emre kaplan"}}, {"_id": "uEb8pp5ebdGzJdjPQ", "postedAt": "2024-03-13T18:14:56.111Z", "postId": "FKWYNcWixfuJK3D7z", "htmlBody": "<p>I suspect he meant something like an improvement of 40 <i>percentage points</i> along the normalized 0-100% scale, so with a scale of -10 to 10, this would be adding 8 to their welfare: 8=40%*(10-(-10)).</p><p>(Or it could just be 40 percentage points along the normalized negative part of the welfare scale, so +4 on a scale of -10 to 10.)</p>", "parentCommentId": "2gDHmaatmFYzh6CTj", "user": {"username": "MichaelStJules"}}, {"_id": "DLaKgJfpYH2Di7yEG", "postedAt": "2024-03-15T04:32:26.017Z", "postId": "FKWYNcWixfuJK3D7z", "htmlBody": "<p>Love this episode! I really appreciate all the dissemination of work on prioritizing animals - it really helps me understand the case for animals. I just wished someone would do something similar for x-risk. I feel like I understand really well why we should work on animal welfare, but I feel like I understand much less about why we should work on x-risk.<br><br>I am not saying I think x-risk is unimportant. I am just saying I feel like I defer a lot more on x-risk while for animal welfare I could to some degree explain why it is important to a non-EA friend of mine.</p>", "parentCommentId": null, "user": {"username": "Ulrik Horn"}}]