[{"_id": "cf8HQkvX2yh6gg8u9", "postedAt": "2022-10-25T22:51:52.195Z", "postId": "Fm4vAtKoH4nBCzsoQ", "htmlBody": "<p>Nice work. This might be a good use case for <a href=\"http://hypothes.is\">hypothes.is</a> or another collaborative annotation tool.</p>\n", "parentCommentId": null, "user": {"username": "david_reinstein"}}, {"_id": "oDXNqM9dHtiNvyAeh", "postedAt": "2022-10-26T09:18:48.473Z", "postId": "Fm4vAtKoH4nBCzsoQ", "htmlBody": "<p>I think that it's supposed to be Peter Thiel (right) and Larry Page (top) in the cover photo. They are mentioned in the article, are very rich and look to me more like the drawings.</p>", "parentCommentId": null, "user": {"username": "TobiasH"}}, {"_id": "JnextiH7iDaC2vocY", "postedAt": "2022-10-26T21:10:24.522Z", "postId": "Fm4vAtKoH4nBCzsoQ", "htmlBody": "<p>Thanks for pointing this out. I agree. I updated my comments.&nbsp;</p>", "parentCommentId": "oDXNqM9dHtiNvyAeh", "user": null}, {"_id": "u2P5D2pit66h7vbda", "postedAt": "2022-10-26T22:17:51.908Z", "postId": "Fm4vAtKoH4nBCzsoQ", "htmlBody": "<p>Link should be to hypothes.is, right?</p>", "parentCommentId": "cf8HQkvX2yh6gg8u9", "user": {"username": "Ben Dean"}}, {"_id": "jRTTQGCqbykdr3aHn", "postedAt": "2022-10-26T22:42:16.921Z", "postId": "Fm4vAtKoH4nBCzsoQ", "htmlBody": "<p>Looks like it. This clears things up. Thanks.&nbsp;</p>", "parentCommentId": "u2P5D2pit66h7vbda", "user": null}, {"_id": "D4JxTende7Fga53iB", "postedAt": "2022-10-27T12:33:34.027Z", "postId": "Fm4vAtKoH4nBCzsoQ", "htmlBody": "<p>Fixed thanks. Autocorrect on phone overdoing things again</p>\n", "parentCommentId": "jRTTQGCqbykdr3aHn", "user": {"username": "david_reinstein"}}, {"_id": "B44i5HCAu3jFGhm2d", "postedAt": "2022-11-01T13:53:07.327Z", "postId": "Fm4vAtKoH4nBCzsoQ", "htmlBody": "<p>I would add that the criticism of supporting targeted interventions over letting people choose their own priorities is not unique to EA - it applies to almost all charities and government initiatives.</p>\n<p>Chorus Foundation itself explicitly focuses on climate change and American organisations rather than letting local people set their own priorities (I don’t mean this as criticism of Chorus - I think cash transfers are the only way of letting people set their own priorities and even then you are sort of supporting targeted interventions when deciding who to transfer cash to).</p>\n", "parentCommentId": null, "user": {"username": "freedomandutility"}}, {"_id": "Nio3DTwKucu3CrE9C", "postedAt": "2022-11-01T13:55:00.851Z", "postId": "Fm4vAtKoH4nBCzsoQ", "htmlBody": "<p>I disagree with characterising Will MacAskill as “ a single person who is a prominent EA”. He is widely considered a “founder” of EA, wrote the main book introducing the idea of EA and the main book introducing the idea of longtermism. I think it’s more than fair for people to assume his views are representative of a large proportion of the movement.</p>\n", "parentCommentId": null, "user": {"username": "freedomandutility"}}, {"_id": "ia4ypntnZ8DwMtDXN", "postedAt": "2022-11-01T13:58:24.535Z", "postId": "Fm4vAtKoH4nBCzsoQ", "htmlBody": "<p>Also, it is worth pointing out that when the article attempts to contrast EA with Chorus and says that most of Chorus’s grantee orgs are led by people of colour, <em>all</em> of those orgs are based in the USA, one of the richest countries in the world.</p>\n", "parentCommentId": "B44i5HCAu3jFGhm2d", "user": {"username": "freedomandutility"}}, {"_id": "XMuJhx7vQBTP7sgoo", "postedAt": "2022-11-01T14:04:09.161Z", "postId": "Fm4vAtKoH4nBCzsoQ", "htmlBody": "<p>I would also add that this article generally suggests that trade-offs when donating money are unique to EA.</p>\n<p>Eg -</p>\n<p>“EA rewards alliance with its worldviews and penalises nonprofits who have different views”</p>\n<p>This is true for all individual donors and all philanthropic philosophies. Chorus Foundation rewards organisations led by Americans working on climate change and “penalises” organisations in the poorest countries working on malaria. Rewarding alliance with your worldview  is not <em>inherently</em> bad - all donors have finite money and “penalise” some nonprofits when they donate to other nonprofits.</p>\n<p>(As an ethnic minority westerner, but as an internationalist, I do not think that the lives of ethnic minority westerners matter more than those of worse off people in the global south, so I disagree with Chorus’s worldview of focusing on the USA, but don’t think it’s wrong for them to donate in line with their worldview).</p>\n", "parentCommentId": null, "user": {"username": "freedomandutility"}}, {"_id": "iG3mLcC4htaHvKvro", "postedAt": "2022-11-01T14:13:12.667Z", "postId": "Fm4vAtKoH4nBCzsoQ", "htmlBody": "<p>I also think in terms of “what is EA’s political alignment?”, it is worth pointing out how much Moskovitz and SBF donated to the Biden campaign, how SBF has discussed donating more to beat Trump, and linking the EA 2020 survey which reports political alignment.</p>\n", "parentCommentId": null, "user": {"username": "freedomandutility"}}, {"_id": "AnY85ML4ygRNpfk2x", "postedAt": "2022-11-01T17:36:29.526Z", "postId": "Fm4vAtKoH4nBCzsoQ", "htmlBody": "<p>I really appreciate this format and would love to see other inaccurate articles covered in this way (so long as the reviewer is intellectually honest, of course).</p>\n", "parentCommentId": null, "user": {"username": "lukeprog"}}]