[{"_id": "TyzkkTZGbXM7rBu8q", "postedAt": "2023-03-13T16:43:16.705Z", "postId": "FmhYMzoevaBqFTGGs", "htmlBody": "<p>It would be cool to give this survey to top AI forecasters and see what the corresponding graphs look like. E.g. get superforecasters-who-have-forecast-on-AI-questions, or maybe top metaculus users, etc.</p>", "parentCommentId": null, "user": {"username": "kokotajlod"}}, {"_id": "cFQKRrYxdJN3mJ8YG", "postedAt": "2023-03-13T18:08:27.696Z", "postId": "FmhYMzoevaBqFTGGs", "htmlBody": "<p>Katja - thanks for posting these survey data.&nbsp;</p><p>They results are shocking. Really shocking. Appalling, really. It's worth taking a few minutes to soak in the dark implications.&nbsp;</p><p>It's hard to imagine any other industry full of smart people in which researchers themselves realize that what they're doing is barely likely to have a net positive impact on the world. And in which a large proportion believe that they're likely to impose massive suffering and catastrophe on everyone -- including their own friends, families, and kids.</p><p>Yet that's where we are with the AI industry. Almost all of the ML researchers seem to understand 'We might be the baddies'. And a much higher proportion seem to understand the catastrophic risks in 2022 than in 2016.&nbsp;</p><p>Yet they carry on doing what they're doing, despite knowing the risks. Perhaps they're motivated by curiosity, hubris, wealth, fame, status, or prestige. (Aren't we all?) Perhaps these motives overwhelm their moral qualms about what they're doing.</p><p>But IMHO, any person with ethical integrity who found themselves working in an industry where the consensual prediction among their peers is that their work is fairly likely to lead straight to an extinction-level catastrophe would take a step back, re-assess, and re-think whether they should really be pushing ahead.&nbsp;</p><p>I know all the arguments about the inevitability of AI arms races, between companies and between nation-states. But we're not really in a geopolitical arms race. There are very few countries with the talent, money, GPU clusters, and determination to pursue advanced AI. North Korea, Iran, Russia, and other dubious nations are not going to catch up any time soon. China is falling behind, relatively speaking.&nbsp;</p><p>The few major players in the American AI industry are far, far more advanced than the companies in any other country at this point. We're really just talking about a few thousand ML researchers associated with OpenAI/Microsoft, Deepmind/Google, and a handful of other companies. Almost all American. Pushing ahead, knowing the risks, knowing they're far in advance of any other country. It's insane. It's sociopathic. And I don't understand why EAs are still bending over backwards to try to stay friendly with this industry, trying to gently nudge them into taking 'alignment' more seriously, trying to portray them as working for the greater good. They are the baddies, and they increasingly know it, and we know it, and we should call them out on it.</p><p>Sorry for the feisty tone here. But sometimes moral outrage is the appropriate response to morally outrageous behavior by a dangerous industry.</p>", "parentCommentId": null, "user": {"username": "geoffreymiller"}}, {"_id": "aQp5ggZm5eHdjvFf4", "postedAt": "2023-03-13T20:19:51.201Z", "postId": "FmhYMzoevaBqFTGGs", "htmlBody": "<p>I think this would be counterproductive. Most ML researchers don't think the research they personally work on is dangerous, or could be dangerous, or contributes to a research direction that could be dangerous, and most of them actually are right about this. There is all kinds of stuff people work on that's not on the critical path to dangerous AI.</p>", "parentCommentId": "cFQKRrYxdJN3mJ8YG", "user": {"username": "anonymous6"}}, {"_id": "kFgKMZ2JkiHZjtMst", "postedAt": "2023-03-13T21:49:21.356Z", "postId": "FmhYMzoevaBqFTGGs", "htmlBody": "<p>Granted, moral outrage can sometimes be counterproductive.&nbsp;</p><p>However, we have no idea which specific ML work is 'on the critical path to dangerous AI'. Maybe most of it isn't. But maybe most of it is, one way or another.&nbsp;</p><p>ML researchers are clever enough to tell themselves reassuring stories about how whatever they're working on is unlikely to lead straight to dangerous AI. &nbsp;Just as most scientists working on nuclear weapon systems during the Cold War could tell themselves stories like 'Sure, I'm working on ICBM rockets, but at least I'm not working on ICBM guidance systesm', or 'Sure, I'm working on guidance systems, but at least I'm not working on the nuclear payloads', or 'Sure, I'm working on simulating the nuclear payload yields, but at least I'm not physically loading the enriched uranium into the warheads'. The smarter people are, the better they tend to be at motivated reasoning, and at creating plausible deniability that they played any role in increasing existential risk.</p><p>However, there's no reason for the rest of us to trust individual ML researchers' assessments of which work is dangerous, versus which is safe. Clearly a large proportion of ML researchers think that what <i>other</i> ML researchers are doing is potentially dangerous. And maybe we should listen to them about that.&nbsp;</p>", "parentCommentId": "aQp5ggZm5eHdjvFf4", "user": {"username": "geoffreymiller"}}, {"_id": "ohWC7kugmsTdaA7qE", "postedAt": "2023-03-14T03:52:13.479Z", "postId": "FmhYMzoevaBqFTGGs", "htmlBody": "<p>How should we think about the 17% response rate to this survey? Is it possible that researchers who are more concerned about alignment are also more likely to complete the survey?</p>", "parentCommentId": null, "user": {"username": "Ian Turner"}}, {"_id": "F6NKGQyw2ZHbsabhw", "postedAt": "2023-03-14T08:03:32.379Z", "postId": "FmhYMzoevaBqFTGGs", "htmlBody": "<p>I'd guess very slightly, yes. I'm not aware of easy ways to get much evidence, unfortunately.</p>", "parentCommentId": "ohWC7kugmsTdaA7qE", "user": {"username": "zsp"}}, {"_id": "9nK7eyPjnqiYx9sDC", "postedAt": "2023-03-14T11:44:18.941Z", "postId": "FmhYMzoevaBqFTGGs", "htmlBody": "<p>I dream of getting a couple questions added onto a big conference's attendee application form. But probably not possible unless you're incredibly well-connected.</p>", "parentCommentId": "F6NKGQyw2ZHbsabhw", "user": {"username": "technicalities"}}, {"_id": "Jr8xiMcuEif5TWqFt", "postedAt": "2023-03-15T05:01:49.415Z", "postId": "FmhYMzoevaBqFTGGs", "htmlBody": "<p>Do you think it's a serious enough issue to warrant some...not very polite responses?&nbsp;</p><p>Maybe it would be better if policy makers just go and shut AI research down immediately instead of trying to make reforms and regulations to soften its impact?&nbsp;</p><p>Maybe this information (that AI researchers themselves are increasingly pessimistic about the outcome) could sway public opinion enough to that point?&nbsp;</p>", "parentCommentId": "cFQKRrYxdJN3mJ8YG", "user": {"username": "Kinoshita Yoshikazu (pseudonym)"}}, {"_id": "HaMqGDPumKppNHfJ8", "postedAt": "2023-03-15T12:04:24.421Z", "postId": "FmhYMzoevaBqFTGGs", "htmlBody": "<p>I would find it fascinating to see this data for the oil and gas industry. I would guess that far fewer people in that industry think that their work is causing outcomes as bad as human extinction (presumably correctly), and yet they probably face more opprobrium for their work (at least from some left-leaning corners of the population).</p>", "parentCommentId": null, "user": {"username": "Sanjay"}}, {"_id": "kuXe6ECNhHjH5YvHL", "postedAt": "2023-03-15T13:25:48.338Z", "postId": "FmhYMzoevaBqFTGGs", "htmlBody": "<p>I think a better analogy than \"ICBM engineering\" might be \"all of aeronautical engineering and also some physicists studying fluid dynamics\". If you were an anti-nuclear protester and you went and yelled at an engineer who runs wind tunnel simulations to design cars, they would see this as strange and unfair. This is true even though there might be some dual use where aerodynamics simulations are also important for designing nuclear missiles.</p>", "parentCommentId": "kFgKMZ2JkiHZjtMst", "user": {"username": "anonymous6"}}, {"_id": "xbFHP7ustvjafwwYq", "postedAt": "2023-03-15T15:51:07.588Z", "postId": "FmhYMzoevaBqFTGGs", "htmlBody": "<p>Just as anti-AI violence would be counter-productive, in terms of creating a public backlash against the violent anti-AI activists, I would bet (with only low-to-moderate confidence) that an authoritarian government crackdown on AI would also provoke a public backlash, especially among small-government conservatives, libertarians, and anti-police liberals.</p><p>I think public sentiment would need to tip against AI first, and then more serious regulations and prohibitions could follow. So, if we're concerned about AI X-risk, we'd need to get the public to morally stigmatize AI R&amp;D first -- which I think would not be as hard as we expect.</p>", "parentCommentId": "Jr8xiMcuEif5TWqFt", "user": {"username": "geoffreymiller"}}, {"_id": "y7dYi9PuP3pLj8Hu5", "postedAt": "2023-03-15T16:00:56.662Z", "postId": "FmhYMzoevaBqFTGGs", "htmlBody": "<p>I understand your point. But I think 'dual use' problems are likely to be very common in AI, just as human intelligence and creativity often have 'dual use' problems (e.g. Leonardo da Vinci creating beautiful art and also designing sadistic siege weapons).&nbsp;</p><p>Of course AI researchers, computer scientists, tech entrepreneurs, etc may see any strong regulations or moral stigma against their field as 'strange and unfair'. So what? Given the global stakes, and given the reckless approach to AI development that they've taken so far, it's not clear that EAs should give all that much weight to what they think. They do not have some inalienable right to develop technologies that are X risks to our species.</p><p>Our allegiance, IMHO, should be to humanity in general, sentient life in general, and our future descendants. Our allegiance should not be to the American tech industry - no matter how generous some of its leaders and investors have been to EA as a movement.&nbsp;</p>", "parentCommentId": "kuXe6ECNhHjH5YvHL", "user": {"username": "geoffreymiller"}}, {"_id": "bRDGrD3pqwu2LB9sk", "postedAt": "2023-03-15T18:04:07.601Z", "postId": "FmhYMzoevaBqFTGGs", "htmlBody": "<p>Public sentiment is already <a href=\"https://www.pewresearch.org/internet/2022/03/17/how-americans-think-about-artificial-intelligence/\">mostly against</a> AI when public sentiment has an opinion. Though its not a major political issue (yet) so people may not be thinking about it. If it turns into a major political issue (there are ways of regulating AI <em>without</em> turning it into a major political issue, and you probably want to do so), then it will probably become 50/50 due to what politics does to everything.</p>\n", "parentCommentId": "xbFHP7ustvjafwwYq", "user": {"username": "D0TheMath"}}, {"_id": "rpJtnikDiKusLePPM", "postedAt": "2023-03-15T20:03:23.146Z", "postId": "FmhYMzoevaBqFTGGs", "htmlBody": "<p>There are a few obvious flaws in interpreting the survey as is:</p><ol><li><strong>sample size and sampling bias:</strong> 13% respondents amount to 700 ish people surveyed. That is fairly small. Secondly, with MIRI and AI impacts's respective logos on the front page of the survey document, it introduces a bias into who is taking the survey, very likely it is just the people familiar with lesswrong etc who has heard of these organizations. Here's why a lot of serious AI researchers don't engage with MIRI et al:<ol><li>MIRI hasn't shipped a SoTA in AI alignment or AI research in the last 5-6 years</li><li>A quick look at the publications on their website shows they don't publish at top ML conferences ( ICML, ICLR, NeurIPS, etc). Less wrong \"research\" is not research, it is usually philosophy and not backed by performing experiments ( \"thought experiments\" don't count).&nbsp;</li></ol></li><li><strong>appeal to authority fallacy:</strong> a lot of people saying something doesn't make it true, so I'd advise people to not confuse between \"AI research is bad\" and \"a proportion of surveyed people think AI research could be bad\". Some moral outrage in the comment section takes some people feeling this way as evidence for defacto truths, while the reality is that they are contested claims. &nbsp;</li><li><strong>modeling the future:</strong> Human beings are notoriously bad at modeling the future. Imagine if we ran a survey in Oct among EAs about FTX health. Not just that modeling the future is hard, but modeling the far future is exponentially harder and existential risk analyses are often incomplete because:<ol><li>New improvements in AI safety research is not accounted in these projections</li><li>Multiagent dynamics of a world with multiple AIs is not modeled in catastrophic scenario projections</li><li>Multiagent dynamics with governments/stakeholders is not modeled</li><li>Phased deployment: accelerate, then align to use case, then accelerate again, as we are doing today is also not modeled. AI deployment is currently also accelerating alignment research because <i>alignment is needed to build a useful product</i>- a gaslighting chatbot is a bad product compared to a harmless, helpful one.</li><li>New research produces new knowledge previously not known.</li></ol></li></ol><p>Anthropic's write up, afaik, is a nuanced take and may be a reasonable starting point for an informed and calibrated take towards AI research.&nbsp;<br>I usually don’t engage with AI takes here because it is a huge echo chamber in here but these are my two cents!</p>", "parentCommentId": null, "user": {"username": "Keerthana Gopalakrishnan"}}, {"_id": "f5bgZ9aSL57PEKbqL", "postedAt": "2023-03-15T21:25:16.511Z", "postId": "FmhYMzoevaBqFTGGs", "htmlBody": "<p>The graphs above indicate there is no consensus in the industry that AI is on the road to inevitable catastrophe, as the graphs themselves above indicate. The median researcher still considers the field a net positive. But let's set that aside for now and talk only about AI doomers.</p><p>Most researchers predicting bad outcomes also have high confidence that they themselves exiting the industry would do nothing to prevent bad outcomes. &nbsp;Somebody will get the bomb first. The day that person gets the bomb, unless you're a 100% doomer, humanity's chances are better the more \"alignment-ready\" the person who has it is, and if you had to pick an entity to receive the bomb today you could easily do worse than than OpenAI. &nbsp;At least they would have the good sense to turn it off before deciding to do anything else dumb with it.</p><p>The \"other actors aren't here yet\" argument is literally just a punt. &nbsp;They won't stay behind forever. When they catch up, we'll be in the exact same boat, except with the \"overwhelming tech lead by institutions nominally pursuing alignment\" solutions closed out of the book, a net loss in humanity's chances of survival however thin you think that slice is.</p><p>The notion that people simply haven't \"taken a step back, reassessed, and rethought their position\" ascribes a breathtaking amount of NPC-quality to people in the field, as if they somehow manage to believe in an impending apocalypse and still not spend any time thinking about it. The reason that doomers don't quit the industry themselves, a few deranged cultists aside, is the same reason people have never succeeded into baiting Yudkowsky into endorsing anti-AI terrorism: the impact you have on the final outcome is somewhere between net negative and net zero, as you will inevitably be replaced with another researcher who cares even less about alignment.</p><p>The only way quitting the industry actually leads to a better outcome is if you decide that the game is already 100% lost, you only want to maximize years of ignorant bliss before the fall, and you're certain that your competence is so high and your persuasive power so low relative to replacement that you personally quitting represents a net delay on the doom clock. The same argument applies, rescaled, to individual organizations themselves backing out of the game. There's a reason very few people think you can put the genie back in the bottle.</p>", "parentCommentId": "cFQKRrYxdJN3mJ8YG", "user": {"username": "somedoomer"}}, {"_id": "y4g3bjCAgeesHm2bc", "postedAt": "2023-03-16T03:16:18.896Z", "postId": "FmhYMzoevaBqFTGGs", "htmlBody": "<p>I suspect that all three political groups (maybe not the libertarians) you mentioned could be convinced to turn collectively against AI research. Afterall, governmental capacity is probably the first thing that will benefit significantly from more powerful AIs, and that could be scary enough for ordinary people or even socialists.&nbsp;</p><p>Perhaps the only guaranteed opposition for pausing AI research would come from the relevant corporations themselves (they are, of course, immensely powerful. But maybe they'll accept an end of this arms race anyway), their dependents, and maybe some sections of libertarians and progressives (but I doubt there are that many of them committed to supporting AI research).&nbsp;</p><p>The public opinion is probably not very positive about AI research, but also perhaps a bit apathetic about what's happening. Maybe the information in this survey, properly presented in a news article or something, could rally some public support for AI restrictions.</p>", "parentCommentId": "xbFHP7ustvjafwwYq", "user": {"username": "Kinoshita Yoshikazu (pseudonym)"}}, {"_id": "wnvQo2juHTFtgCa9h", "postedAt": "2023-03-18T09:02:11.041Z", "postId": "FmhYMzoevaBqFTGGs", "htmlBody": "<p>I think we're at the stage now where we should be pushing for a global moratorium on AGI research. Getting the public on board morally stigmatizing it is an important part of this (cf. certain bio research like human genetic engineering).</p>\n", "parentCommentId": "xbFHP7ustvjafwwYq", "user": {"username": "Greg_Colbourn"}}, {"_id": "FGw4MJ57hYMWQGGkA", "postedAt": "2023-03-18T11:04:43.872Z", "postId": "FmhYMzoevaBqFTGGs", "htmlBody": "<p>\"Yet they carry on doing what they're doing, despite knowing the risks. Perhaps they're motivated by curiosity, hubris, wealth, fame, status, or prestige. (Aren't we all?) Perhaps these motives overwhelm their moral qualms about what they're doing.\"</p>\n<p>I'd like to add inertia/comfort to this list: people don't like to change jobs, and changing fields is much harder.</p>\n<p>Intervention idea: offer capabilities researchers support to transition out of the field</p>\n", "parentCommentId": "cFQKRrYxdJN3mJ8YG", "user": {"username": "SiebeRozendal"}}, {"_id": "ZKwHcvT26svSbxZHX", "postedAt": "2023-03-19T08:56:21.343Z", "postId": "FmhYMzoevaBqFTGGs", "htmlBody": "<p>Possible, but likely a smaller effect than you might think because:\na) I was very ambiguous about the subject matter until they were taking the survey (e.g. did not mention AGI or risk or timelines)\nb) Last time (for the 2016 survey) we checked the demographics of respondents against those for a random subset of non-respondents, and they weren't very different.</p>\n<p>Participants were also mostly offered substantial payment for taking the survey ($50 usually, for a ~15m survey), in part in the hope of making payment a larger motivator than desire to express some particular view, but I don't think payment actually made a large difference to the response rate, so probably failed have the desired effect on possible response bias.</p>\n", "parentCommentId": "ohWC7kugmsTdaA7qE", "user": {"username": "Katja_Grace"}}, {"_id": "qhgho6iB4owFiEpMC", "postedAt": "2023-03-24T06:16:51.575Z", "postId": "FmhYMzoevaBqFTGGs", "htmlBody": "<p>Disagree-voting for the following reasons:</p><ol><li>700 people — that is a <strong>substantial</strong> sample size.&nbsp;</li><li>I think sampling bias will likely be small/inconsequential, given the sample size.&nbsp;<ol><li>Ideally, yes, not having any logos would be great, but if I got an email asking me, \"fill out this survey, and trust me, I am from a legitimate organization,\" I probably wouldn't fill out the survey.</li><li>\"very likely it is just the people familiar with lesswrong etc who has heard of these organizations\"&nbsp;<ol><li>Hard to say if this is true</li><li>It is wrong to assume that familiarity with LW would lead people to answer a certain way. However, I can imagine people who dislike LW/similar would also be keen to complete the survey.</li><li>The survey questions don't seem to prime respondents one way or the other.</li><li>These 700 people did publish in ICML/NeurIPS; they have some degree of legitimacy.</li></ol></li></ol></li><li>Nitpicky, but \"a proportion of ML researchers who have published in top conferences such as ICML and NeurIPS think AI research could be bad\" is probably a more accurate statement. I agree that this doesn't make the statements they are commenting on = truth; however, I think their opinion has a lot of value.</li></ol><p>I think <a href=\"https://www.metaculus.com/questions/track-record/\">Metaculus does a decent job at forecasting</a>, and <a href=\"https://www.metaculus.com/questions/4815/date-of-first-agi-according-to-forecasters/\">their forecasts are updated based on recent advances</a>, but yes, predicting the future is hard.</p>", "parentCommentId": "rpJtnikDiKusLePPM", "user": {"username": "satpathyakash"}}]