[{"_id": "qN8ELCEQZMCDpHxCJ", "postedAt": "2023-02-17T13:49:42.671Z", "postId": "FnrqBNQ4ascdCuGG6", "htmlBody": "<p>Thanks for sharing. I enjoyed it.</p>", "parentCommentId": null, "user": {"username": "nathan"}}, {"_id": "F9QcfbQ9ZvAgWwZGv", "postedAt": "2023-02-17T14:10:15.457Z", "postId": "FnrqBNQ4ascdCuGG6", "htmlBody": "<p>Cool. I upvoted. I recently <a href=\"https://forum.effectivealtruism.org/posts/NzPwFfzJur5bMmHTg/diversity-takes#Take_7__EA_s_comparative_advantage_is_altruism__not_solidarity\">wrote that EAs don't need to cultivate solidarity because it's not really related to their value prop</a>. But more than happy to coalition with people like you for some goals in particular. &nbsp;</p><p>I'm not worried you're a nationalist (as in the opposite of cosmopolitan, someone who really does think their neighbors are more important than people halfway across the world), because of specifics of the way you articulated yourself. But if you haven't, I urge you to read <a href=\"https://forum.effectivealtruism.org/posts/wkWG4tYEgF6Ko49bH/don-t-leave-your-fingerprints-on-the-future\">Soares on the moral obligation to generalize cosmopolitanism and really double down on it</a> for alignment researchers in particular.&nbsp;</p>", "parentCommentId": null, "user": {"username": "quinn"}}, {"_id": "oMmEAMofDntefHAxh", "postedAt": "2023-02-17T14:44:57.787Z", "postId": "FnrqBNQ4ascdCuGG6", "htmlBody": "<p>Same page here as well.&nbsp;</p><p>Probably is that when we are in search of a calling, we seek to be associated to some groups in hopes of finding our purpose along the way. When we find that calling, we then get to a point where we can see ourselves again in a different way - does my upgraded view of who I would be and what should I do be still aligned with this group, the culture and its concept. That is why I stopped calling myself an effective altruist - as I do adhere to the core belief that we should do our very best to make the future as bright as possible, some of the methods of conversation here is somewhat murky if you are a new and very difficult to build upon for less technically inclined people.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Miguel"}}, {"_id": "C8DpYKMe3mMRRvD6k", "postedAt": "2023-02-17T15:19:18.088Z", "postId": "FnrqBNQ4ascdCuGG6", "htmlBody": "<p>If you would be doing the same things even without the \"for every human being\" and \"for every sentient being\" then I'd agree, but it sounds to me like wanting things to be better for others is a big part of your motivation in working on this.   Which sounds like altruism to me?</p>\n<p>Is the objection that you don't like the connotations of \"altruism\" as taking actions purely for the benefit of others?  Or that it puts you in a frame where you're thinking about sacrifices you're making for others?</p>\n", "parentCommentId": null, "user": {"username": "Jeff_Kaufman"}}, {"_id": "NBQ4bACvs3pSPJaYS", "postedAt": "2023-02-17T15:44:57.923Z", "postId": "FnrqBNQ4ascdCuGG6", "htmlBody": "<p>At the risk of being obtuse : I think the etymology of \"altruism\" is telling. It comes from a word meaning \"other\" or \"other people\". Insofar as I want to make the future go as well as possible, I want to do it as expression of (an idealised) collective agency, not just as an individual helping those in need.&nbsp;</p>", "parentCommentId": "C8DpYKMe3mMRRvD6k", "user": {"username": "clem"}}]