[{"_id": "C8BZyaWBdb54tuiHK", "postedAt": "2024-03-23T15:18:49.451Z", "postId": "FNXbaYueTNMKamcCC", "htmlBody": "<p>In my view, there's a level of badness for being excluded from my friendship, and a level of badness for being excluded from my communities, and I think the 2nd one should be much stricter.&nbsp;</p><p>If I have a work buddy who is prone to making sexist jokes and off-colour comments, I would like them less, but I wouldn't find cause to avoid hanging out 1 on 1 or avoid them in the corridors. But I would keep them away from my dancing community, because it sets a bad tone and makes the place less welcoming for everyone. Everybody you let into a community has an effect on the character of that community, I see&nbsp;</p><p>I think it's completely fair for an intentional community or movement to have reasonable standards about who to include. I think EA has suffered from having incredibly low standards in the past, to the point where someone straight up admitted to being an authoritarian manipulative narcissist and was still welcomed in with open arms. Nobody has a democratic right to be in this movement!</p>", "parentCommentId": null, "user": {"username": "titotal"}}, {"_id": "XDEvLF8xqzSQxrKgh", "postedAt": "2024-03-24T12:52:33.528Z", "postId": "FNXbaYueTNMKamcCC", "htmlBody": "<p>'Someone straight up admitted to being an authoritarian manipulative narcissist and was still welcomed in with open arms\".</p>\n<p>Just to satisfy my curiosity about gossip,what are you referring to here?</p>\n", "parentCommentId": "C8BZyaWBdb54tuiHK", "user": {"username": "Dr. David Mathers"}}, {"_id": "EaMWhDXpJPEeaKFfw", "postedAt": "2024-03-24T16:29:56.832Z", "postId": "FNXbaYueTNMKamcCC", "htmlBody": "<p>This is a great post and captured something that I feel. Thank you for writing it Michelle!!</p>\n", "parentCommentId": null, "user": {"username": "weeatquince"}}, {"_id": "WXrBZBgKeJx7vzuXq", "postedAt": "2024-03-25T13:32:48.991Z", "postId": "FNXbaYueTNMKamcCC", "htmlBody": "<p><strong>Executive summary:</strong> The author argues that friendship should be treated as a \"sacred value\" that is outside the scope of moral optimization, even though friendships can have positive or negative consequences.</p><p><strong>Key points:</strong></p><ol><li>Recent stressful events in the EA community have raised questions about whether the community should take coordinated action to exclude certain individuals.</li><li>The author feels uncomfortable with the idea of morality dictating who one should be friends with, and believes friendship should be a \"sacred value\" outside the domain of moral optimization.</li><li>Sacred values are areas of life that are kept separate from the constant pressure to do more good, in order to make altruism more sustainable. Examples include having children, diet, and travel.</li><li>While friendships can have positive or negative consequences, the author argues that not intentionally optimizing friendships based on values is different from having no correlation between friendships and values.</li><li>Treating friendship as a sacred value may have some personal and broader costs, but the author believes it is important for individuals to figure out their own limits and what is sustainable for them in the long term.</li></ol><p>&nbsp;</p><p>&nbsp;</p><p><i>This comment was auto-generated by the EA Forum Team. Feel free to point out issues with this summary by replying to the comment, and</i><a href=\"https://forum.effectivealtruism.org/contact\"><i>&nbsp;<u>contact us</u></i></a><i> if you have feedback.</i></p>", "parentCommentId": null, "user": {"username": "SummaryBot"}}]