[{"_id": "nakDW5nQz8xtSmkxk", "postedAt": "2022-11-29T21:51:18.826Z", "postId": "Foh2mCycudKgDNZqC", "htmlBody": "<p>Thanks for posting these! It’s helpful both as a nudge to participate and as a way of keeping up with human challenge trials research.</p>\n", "parentCommentId": null, "user": {"username": "samjm"}}, {"_id": "XAoJY55Tsrj5G2pCL", "postedAt": "2022-11-30T11:39:44.761Z", "postId": "Foh2mCycudKgDNZqC", "htmlBody": "<p>Great work. I got malaria in 2016 for a clinical trial of a novel anti-malarial (results <a href=\"https://www.thelancet.com/journals/laninf/article/PIIS1473-3099(19)30611-5/fulltext\">published here</a>). I was paid AUD$2880 and gave it all to the Against Malaria Foundation. It's one of the best things I've ever done.</p>", "parentCommentId": null, "user": {"username": "Henry Howard"}}, {"_id": "Ks3adduyQCC4nT6gC", "postedAt": "2022-11-30T15:40:01.847Z", "postId": "Foh2mCycudKgDNZqC", "htmlBody": "<p>It's great that you know the results. While relatively minor in the grand scheme of things, it's frustrating that trials, at least here in the US, don't often share results with participants, even though it's theoretically as simple as a mass email along the lines of \"here's what we learned\" — presumably an email they're already sending to colleagues, funders, etc., in some &nbsp;form. I had to ask the people running the Shigella trial for my data (not available yet, but I really wanna see if I got the placebo or not)!&nbsp;</p>", "parentCommentId": "XAoJY55Tsrj5G2pCL", "user": {"username": "jeberts"}}, {"_id": "S9oWJJi6zf5xZ6gZo", "postedAt": "2022-12-05T20:33:04.331Z", "postId": "Foh2mCycudKgDNZqC", "htmlBody": "<p>Post summary (feel free to suggest edits!):<br>There is a paid opportunity to be part of a Malaria vaccine trial in Baltimore from January to early March. The vaccine has a solid chance of being deployed for pregnant women if it passes this challenge trial. It’s ~55 hours time commitment if in Baltimore or more if needing to travel, and the risk of serious complications is very low. The author signed up, and knows 6 others who have expressed serious interest. Get in touch with questions or to join an AirBnB the author is setting up for it.<br><br>(If you'd like to see more summaries of top EA and LW forum posts, check out the <a href=\"https://forum.effectivealtruism.org/s/W4fhpuN26naxGCBbN\">Weekly Summaries</a> series.)</p>", "parentCommentId": null, "user": {"username": "GreyArea"}}]