[{"_id": "atfbmePQrsAaoxsjS", "postedAt": "2015-06-20T03:40:28.773Z", "postId": "FPDzJjHo75cGjcZRY", "htmlBody": "<p>When would it make sense for someone to leave a successful earning-to-give tech job to try to work on creating a start up (with the goal of earning to give)?  Which considerations are at play?  How might someone create a framework for making this decision?</p>\n", "parentCommentId": null, "user": {"username": "Peter_Hurford"}}, {"_id": "xrkEHstBi5Ar6qkAx", "postedAt": "2015-06-20T06:08:36.350Z", "postId": "FPDzJjHo75cGjcZRY", "htmlBody": "<p>Which careers give you the best public platform to spread important ideas like effective altruism,  cosmopolitanism, antispeciesism, or accounting for the interests of future generations?</p>\n<p>To put it another way, which individuals have the most influence over the ideas of society (accounting for difficulty in getting those positions)?</p>\n", "parentCommentId": null, "user": {"username": "Jacy"}}, {"_id": "TR3MqGFobE4rEsuQD", "postedAt": "2015-06-20T06:41:16.208Z", "postId": "FPDzJjHo75cGjcZRY", "htmlBody": "<p>I'm just going to state my views not fully back them up. I hope to cover this topic in more depth later.</p>\n<p>I'll go through a couple of key considerations and how to settle them.</p>\n<p>1) Expected earnings</p>\n<p>We have a bunch of unpublished research on this. I think the earnings as a startup founder are considerably higher in expectation (say at least 5x) BUT only if you make it into a top 5 accelerator or similar. More broadly, top accelerators seem to have very strong selection power - almost no-one who's rejected by YC succeeds, but the odds are pretty good if you get in.</p>\n<p>So I think reframe the question as &quot;is it worth me spending a couple of months seeing if I can get into a top accelerator?&quot;.</p>\n<p>That depends on your situation. Do you have a cofounder? Do you have a problem in mind? Other entrepreneurs in the EA community can probably advise you on this.</p>\n<p>Also since the earnings of founding are delayed 5-10 years, they're worth about 50% less.</p>\n<p>2) Career capital</p>\n<p>You'll may improve your technical skills more as a SWE, but as a founder you'll learn more entrepreneurial skills and I think those are more valuable (in particular, within EA, there are loads of SWE, but a real shortage of entrepreneurs).</p>\n<p>It's also better for networking, and you'll have to try out all types of work, making it good for exploration. The greater intensity also means you'll probably push yourself more.</p>\n<p>If you fail as an entrepreneur in the US, I think you can go back to SWE with little or no penalty.</p>\n<p>Overall I'd say the startup path is better for career capital, though there are counterpoints:\n<a href=\"http://philosophyforprogrammers.blogspot.com/2014/09/if-you-want-to-start-startup-go-work.html\">http://philosophyforprogrammers.blogspot.com/2014/09/if-you-want-to-start-startup-go-work.html</a></p>\n<p>3) Lifestyle</p>\n<p>Being a startup founder is far harder work and far more stressful. Most founders say they went through really high highs and really low lows. Even the most successful startups are often close to failure several times. All startup founders work very long hours. If you can't hack this, then don't do it.</p>\n<p>Startups also take over your life and become your sole focus. If you succeed, you'll be locked in for 5-10 years. If you're unwilling to commit to this one thing for so long, don't do it.</p>\n<p>This means you'll also have little time for side projects.</p>\n<p>4) Direct impact</p>\n<p>Entrepreneurship probably generates more consumer surplus and positive externalities than being a SWE because it's more innovative. It'll depend on the companies though.</p>\n<p>How strong a consideration this is depends on what cost-benefit ratio you put on your donations. If it's around 10, then it's probably important. If it's more like 100-1000, the donations dominate.</p>\n<p>5) Flexibility</p>\n<p>The startup founder path involves more 'lock-in', so if you're highly unsure, lean against.</p>\n<p>6) The right reasons</p>\n<p>In the startup world, people don't recommend starting unless you're extremely driven by the problem you're trying to solve. Going into it because you expect to earn more probably isn't good enough.</p>\n<p><a href=\"http://startupclass.samaltman.com/courses/lec01/\">http://startupclass.samaltman.com/courses/lec01/</a></p>\n<p>Conclusion</p>\n<p>Overall, of those 2 options, I'd lean towards encouraging you to experiment with the startup path - try to put something together that you could pitch to an accelerator. </p>\n<p>If you don't have a good idea, try to join an early stage startup instead (especially one via your network that's got top backers). This is also much better for lifestyle, in particular, it's much easier to quit, so you can try several times before hitting on a success.</p>\n<p>Finally, this is a bigger question, but I don't think you should optimise for earning to give. I think you should work towards working at an EA org or potentially exploring other areas neglected by EAs.</p>\n", "parentCommentId": "atfbmePQrsAaoxsjS", "user": {"username": "Benjamin_Todd"}}, {"_id": "oScK6Aa8c7Lwpcen2", "postedAt": "2015-06-20T06:42:26.882Z", "postId": "FPDzJjHo75cGjcZRY", "htmlBody": "<p>And talk a lot to Ben West!</p>\n", "parentCommentId": "TR3MqGFobE4rEsuQD", "user": {"username": "Benjamin_Todd"}}, {"_id": "uWCbRH3kbTygv7iis", "postedAt": "2015-06-20T16:36:16.011Z", "postId": "FPDzJjHo75cGjcZRY", "htmlBody": "<p>80k advice often seems geared to people with quite a particular educational background. I'm keen on earning to give even if my earnings can only be moderate (a different course seems better if they might end up lower than that). But while I'm unusually smart I don't like school, don't have very good A levels (Bs and Cs), and prefer to be self-directed - so I decided to skip university to do self-employed start-up business work. However I figure I could go back, or perhaps do an accelerated business course. How can someone in my general situation best get an outside view of their expected mean/median earnings, if they're willing to do any job to maximise these?</p>\n", "parentCommentId": null, "user": {"username": "Nekoinentr"}}, {"_id": "shvjqNP4xGCenGTaP", "postedAt": "2015-06-20T16:37:38.793Z", "postId": "FPDzJjHo75cGjcZRY", "htmlBody": "<p>As a distant observer, your .impact EA work seems unlikely to get replaced, whereas there are plenty of people doing startups - are you worried that adding a startup to your earning to give might squeeze EA work out?</p>\n", "parentCommentId": "atfbmePQrsAaoxsjS", "user": {"username": "Nekoinentr"}}, {"_id": "W4vtopskqhzqvp2Pk", "postedAt": "2015-06-20T17:34:46.204Z", "postId": "FPDzJjHo75cGjcZRY", "htmlBody": "<p>I've been thinking about how to weigh the direct impact of one's career (e.g., donations) against the impact of being a model for others. For example, imagine option A is a conventional, high-paying salaried job, and option B is something less conventional (e.g., a startup) with a higher expected (direct) impact value. It's not obvious to me that option B has a higher expected impact value when one takes into account the potential to be a model for others. In other words, I think there might be a unique kind of value in doing good in a way that others can emulate. I'm curious whether you agree with this, and if so, how one might factor it into the analysis. </p>\n", "parentCommentId": null, "user": {"username": "mhpage"}}, {"_id": "vhNmoSm5FmKq8fCWt", "postedAt": "2015-06-20T19:53:28.233Z", "postId": "FPDzJjHo75cGjcZRY", "htmlBody": "<p>Thanks Ben, that's a helpful summary. </p>\n<p>Sorry this is slightly off topic. Considering Givewell's recommendations are between 1x and 10-20x and there are questions about room for funding etc. where are you thinking that people might conceivably get a 100-1000x return on their donations?</p>\n", "parentCommentId": "TR3MqGFobE4rEsuQD", "user": {"username": "tomstocker"}}, {"_id": "8pmijHMjcPDEqWPvC", "postedAt": "2015-06-20T20:04:05.884Z", "postId": "FPDzJjHo75cGjcZRY", "htmlBody": "<p>Have you thought much about how to tell if you can attribute to your actions an improvement you've been advocating for? Do the most successful people at direct work even bother with this or do they just get on with it and accept that they won't really be able to tell / optimistically take the credit?</p>\n", "parentCommentId": null, "user": {"username": "tomstocker"}}, {"_id": "JFbxnk8Lf7spZf6fw", "postedAt": "2015-06-20T20:04:17.335Z", "postId": "FPDzJjHo75cGjcZRY", "htmlBody": "<p>Why is management consulting not in the list of top careers anymore? </p>\n", "parentCommentId": null, "user": null}, {"_id": "DhySYH2ApXsQ3S8B9", "postedAt": "2015-06-20T20:25:14.099Z", "postId": "FPDzJjHo75cGjcZRY", "htmlBody": "<p>What do you see as the best opportunities to do EA direct work as a full-time career?  Which considerations might one use to decide between full-time EA direct work and earning to give?</p>\n", "parentCommentId": null, "user": {"username": "Peter_Hurford"}}, {"_id": "W8kfL8t2bcfr9raK9", "postedAt": "2015-06-20T20:36:45.863Z", "postId": "FPDzJjHo75cGjcZRY", "htmlBody": "<p>Those are multipliers in terms of social value created for the community compared to cost. It is a common (but not universal) position that a dollar has a higher value in a poor society than a rich one. If your work creates social value mostly in rich countries but your donations create value mostly in poor ones, this could add one to two orders of magnitude to the relevant ratio.</p>\n<p>This is perhaps easiest to think about with GiveDirectly. At one level it's easy to see that the return is 1x. The reason people think it's a better target than just spending money yourself is that a dollar goes much further in the target community.</p>\n<p>Some people may also or instead think there are more speculative interventions with bigger returns ratios.</p>\n", "parentCommentId": "vhNmoSm5FmKq8fCWt", "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "2Tfv2mz5vxnYLJAmg", "postedAt": "2015-06-20T21:39:01.311Z", "postId": "FPDzJjHo75cGjcZRY", "htmlBody": "<p>My personal take is that being a research manager at CSER is good. Researcher at MIRI or CSER would be good if one was quantitatively inclined or expert in policy or risky tech. Tech policy would be good in general if one was expert at that.</p>\n<p>Broadly, I think that most promising careers currently accumulate and leverage some resource that is not money, but that relates to humanity's future potential, in a way that folks like Musk or Moskovitz can't easily purchase. Things like political clout, influence of researchers and influence of nvestors. If one can't run a program to get any such resources, then earning to give could be decent if - like Matt Wage and Jaan Tallinn, you see opportunities that others miss. </p>\n", "parentCommentId": "DhySYH2ApXsQ3S8B9", "user": {"username": "RyanCarey"}}, {"_id": "mHKjEn7dqE2439zaE", "postedAt": "2015-06-20T22:03:28.387Z", "postId": "FPDzJjHo75cGjcZRY", "htmlBody": "<p>What do you think of <a href=\"http://effective-altruism.com/ea/ix/how_important_is_marginal_earning_to_give/\">&quot;How Important is Marginal Earning to Give?&quot;</a>?</p>\n", "parentCommentId": null, "user": {"username": "Peter_Hurford"}}, {"_id": "HzbWMh22zAq7Tgy4s", "postedAt": "2015-06-20T22:45:40.570Z", "postId": "FPDzJjHo75cGjcZRY", "htmlBody": "<p>That's a mistake (which we're aware of!). We're about to redesign the top careers page, so will be fixed soon.</p>\n", "parentCommentId": "JFbxnk8Lf7spZf6fw", "user": {"username": "Benjamin_Todd"}}, {"_id": "RMoSr2C5EMewDYZZv", "postedAt": "2015-06-21T05:56:07.957Z", "postId": "FPDzJjHo75cGjcZRY", "htmlBody": "<p>Hi, </p>\n<p>I often see references to the value of an economics PhD in the EA community and at the 80k hours site. </p>\n<p>I find it incredibly hard to relate those cost/benefit assessments of the econ PhD to my situation, because I am now a little over 29 years old, have already done a bunch of study (3 bachelors, 1 masters - around econ, maths, business), and have built 5 years of career capital in government economics roles (which might lose much of its value if I take 5-6 years off to do an econ PhD at a top school). </p>\n<p>I am trying to build the greatest amount of career capital to maximise my career impact. Do you have any advice on how I can try to assess the diferences between jumping into an econ PhD for 5-6 years versus just continuing to build up capability and responisibilities along my current career path? </p>\n<p>More generally, I imagine there are many EAs in their mid-to-late 20s who feel that it may be too late to jump into a long PhD, or at least that it is not very straightforward (or involve trade-offs that aren't adequately addressed in existing advice) compared to when they were just a few years younger. I don't have any sense for how justifiable these concerns really are. I'd like to get your views on the matter. </p>\n", "parentCommentId": null, "user": {"username": "obeyesekere"}}, {"_id": "AciZwbJeActCvX6S2", "postedAt": "2015-06-21T07:12:48.168Z", "postId": "FPDzJjHo75cGjcZRY", "htmlBody": "<p>Are there opportunities to pursue EA goals in fields/environments that aren't competitive? I work best in collaborative, supportive environments.</p>\n", "parentCommentId": null, "user": {"username": "Arabella_Devine"}}, {"_id": "L9BxYY5Xyc9QHGjRj", "postedAt": "2015-06-21T12:52:05.424Z", "postId": "FPDzJjHo75cGjcZRY", "htmlBody": "<p>80k now has career profiles on doing Software Engineering, Data Science and a Computer Science PhD. I'm in a position where I could plausibly pursue any of these. What is the ratio of effective altruists currently pursuing each of these options, and where do you think adding an additional EA is of most value? (Having information this information on the career profiles might be a nice touch)</p>\n", "parentCommentId": null, "user": {"username": "William_S"}}, {"_id": "AdrdGe6vc5eEQkx9T", "postedAt": "2015-06-21T13:18:40.074Z", "postId": "FPDzJjHo75cGjcZRY", "htmlBody": "<p>There are more EA software engineers than data scientists. </p>\n<p>Seems pretty person-dependent though. Do you like math? Would you prefer research or industry? If you've done an honours or masters already, that might give you an idea of whether you'd like a PhD. Which skills do you lack in order to be able to work at a CS/data science area like machine learning? </p>\n", "parentCommentId": "L9BxYY5Xyc9QHGjRj", "user": {"username": "RyanCarey"}}, {"_id": "RfcEssZwhSMTm7j6J", "postedAt": "2015-06-21T14:49:00.831Z", "postId": "FPDzJjHo75cGjcZRY", "htmlBody": "<p>Looking at <a href=\"https://80000hours.org/career-guide/profiles/\">80K's career profiles</a>, you could try being a foundation program manager or founding effective non-profits.  Software Engineering and Data Science are also quite collaborative.</p>\n", "parentCommentId": "AciZwbJeActCvX6S2", "user": {"username": "Peter_Hurford"}}, {"_id": "hb9M5Bz6G4oEi6qhb", "postedAt": "2015-06-21T16:29:50.425Z", "postId": "FPDzJjHo75cGjcZRY", "htmlBody": "<p>What do you think is the most promising graduate degree(Masters) for (pure) Math undergrads pursuing earning to give? And maybe more general; how would you structure the answer to the question of what graduate degree one should pursue given that he/she is commited to EtG? Maybe to give you some ideas, I'm currently looking at: computer science(machine learning), econometrics, economics, applied mathematics, financial mathematics, statistics, something related to data science.</p>\n", "parentCommentId": null, "user": {"username": "Amon"}}, {"_id": "nzWEChPBfhaTmJtkA", "postedAt": "2015-06-21T22:15:55.118Z", "postId": "FPDzJjHo75cGjcZRY", "htmlBody": "<p>Say someone has decided they want to work on a problem directly, rather than earn to give.  How do you suggest they find projects?</p>\n", "parentCommentId": null, "user": {"username": "Elizabeth"}}, {"_id": "RMMsSWuD5rmhA7wHL", "postedAt": "2015-06-21T23:31:38.268Z", "postId": "FPDzJjHo75cGjcZRY", "htmlBody": "<p>If you're smart but you don't like school, maybe you have a comparative advantage in doing independent research and blogging about EA topics?  Just a thought.</p>\n", "parentCommentId": "uWCbRH3kbTygv7iis", "user": {"username": "John_Maxwell_IV"}}, {"_id": "xAfE2GJm7bq5hqKFT", "postedAt": "2015-06-22T00:39:57.990Z", "postId": "FPDzJjHo75cGjcZRY", "htmlBody": "<p>Well you could start by assuming you become a better than average programmer in your country? Bureau of Labor Statistics is very handy if you're in the US, but there are equivalents. If you decide to make a business, then you might want to look at 80k's research into startup earnings (I helped with this), although beware that the variance is very high and failure is near certain.</p>\n<p>Other outside views: what are average earnings given your IQ? What did your parents earn?</p>\n", "parentCommentId": "uWCbRH3kbTygv7iis", "user": {"username": "RyanCarey"}}, {"_id": "zecz93ojGHZwwYC6W", "postedAt": "2015-06-22T00:50:43.575Z", "postId": "FPDzJjHo75cGjcZRY", "htmlBody": "<p>What are some pressing problems that would benefit from having someone focus on them for a few years?</p>\n<p>I'm in an earning to give career, but am considering taking a break for a few years, after having pulled some very long hours for many years on end now.  I'm looking for opportunities to contribute through labor.  I could work full-time hours (which would be a significant reduction of workload compared to what I'm doing now) for no salary.  Skills: management, legal, data analysis, basic coding (but could spend some time getting up to speed on this one).  Some language skills as well.  </p>\n", "parentCommentId": null, "user": {"username": "Undercover"}}, {"_id": "QHPYDdCdx6c9txscJ", "postedAt": "2015-06-22T23:09:23.040Z", "postId": "FPDzJjHo75cGjcZRY", "htmlBody": "<p>What about people who are re-entering the workforce as adults after an extended hiatus? This might include taking time off to raise kids, for health reasons, because finding work after getting laid off didn't pan out, etc. I haven't looked at the site in detail but so far what I've seen seems mostly geared to people whose careers never took any breaks or are just getting off the ground.</p>\n<p>In my case, I had to drop out of my bachelors program (senior standing as a Sociology major) for health reasons, and have had some service industry and retail positions since then but have been unemployed for some time while trying to find work that accommodates my health issues. </p>\n<p>I want to go back to school eventually, but I've since married and relocated, so it would involve transferring credits and commuting or settling for an online degree rather than one from a well-known university, let alone seriously stretching the family budget. I'm able to work part-time and will eventually be well enough to work full-time, but earning to give is not really an option for me at this point. I feel most passionately about civil and human rights issues, and would be highly motivated in any position that involved working on policy related to these things, whether local, national, or global (I live in the US). What career skills and experience would be most useful for eventually finding permanent employment in that sort of field?</p>\n", "parentCommentId": null, "user": {"username": "KJSD"}}, {"_id": "QA4fRcgx6FiYgSocM", "postedAt": "2015-06-23T02:17:26.465Z", "postId": "FPDzJjHo75cGjcZRY", "htmlBody": "<p>On the first question:</p>\n<p>One you get to the level of choosing between EA orgs, I think the most key consideration is personal fit (i.e. your chances of being really really good at the job). Within EA orgs, good personal fit seems like the best proxy for both your impact and your career capital. (the next most important would be how generally promising the org is).</p>\n<p>Given that, it's hard to talk about the best generally good opportunities. It's also hard because the situation changes very rapidly. </p>\n<p>And that means, I think it's more about talking to lots of different organisations and seeing if there's a good role for you that's available or could be created.</p>\n", "parentCommentId": "DhySYH2ApXsQ3S8B9", "user": {"username": "Benjamin_Todd"}}, {"_id": "WvuRzyMBbyELGgdu8", "postedAt": "2015-06-23T02:20:31.415Z", "postId": "FPDzJjHo75cGjcZRY", "htmlBody": "<p>Like I say in the comments, I broadly agree. I'm not so excited about more people optimising around earnings at the margin, unless they especially want to go into a high-earning career or have an especially strong advantage for earning money. If I had to guess the optimal medium-term proportion of EAs earning to give, I might go for 10%. Note the balance depends quite a bit on your views of which causes are most important.</p>\n", "parentCommentId": "mHKjEn7dqE2439zaE", "user": {"username": "Benjamin_Todd"}}, {"_id": "485qeEwTrGCwBTLDT", "postedAt": "2015-06-23T02:32:25.309Z", "postId": "FPDzJjHo75cGjcZRY", "htmlBody": "<p>Hi there,</p>\n<p>One quick thing is that although our career profiles (currently) focus on those kinds of people, a lot of our advice is more general e.g. our framework, strategy advice, how to choose pages. </p>\n<p>If you're trying to figure out your next step, then the first thing I'd recommend is working through the process on our how to choose page:\n<a href=\"https://80000hours.org/career-guide/how-to-choose/\">https://80000hours.org/career-guide/how-to-choose/</a></p>\n<p>After you've done that, let me know what your key uncertainties are. </p>\n<p>Turning to expected earnings directly, there's doesn't really exist a general model for someone's expected earnings. You can get an idea of potential earnings of different jobs with these kinds of resources:\n<a href=\"https://80000hours.org/2013/02/how-to-find-out-earnings-for-different-jobs/\">https://80000hours.org/2013/02/how-to-find-out-earnings-for-different-jobs/</a></p>\n<p>There's also some literature about whether doing a degree boosts your earnings:\n<a href=\"https://80000hours.org/2014/01/the-value-of-a-degree/\">https://80000hours.org/2014/01/the-value-of-a-degree/</a>\nIt generally finds that it does, on average, but whether it's worth it for you will depend on your situation. If lack of a degree isn't a blockage with respect to your current set of opportunities, then it might not be an issue. It also depends on what areas you want to enter. It will also depend on which program you could get into and your chances of finishing it.</p>\n<p>There's also some literature about whether being self-employed boosts your earnings. It finds that on average self-employed people earn less, though those who own incorporated companies earn more.</p>\n<p>Ben</p>\n", "parentCommentId": "uWCbRH3kbTygv7iis", "user": {"username": "Benjamin_Todd"}}, {"_id": "h6iMzpmTyTJQ8P8oC", "postedAt": "2015-06-23T02:33:06.299Z", "postId": "FPDzJjHo75cGjcZRY", "htmlBody": "<p>Good question. I'll try to come back to this with a longer answer, but for the time being, which causes did you have in mind? The answer depends quite a bit on the area.</p>\n", "parentCommentId": "nzWEChPBfhaTmJtkA", "user": {"username": "Benjamin_Todd"}}, {"_id": "bWibkpArinvPdN5Lg", "postedAt": "2015-06-23T02:41:23.950Z", "postId": "FPDzJjHo75cGjcZRY", "htmlBody": "<p>We do try to rate careers based on their 'advocacy potential' (basically how promising is this career as a way to spread important ideas), listing some of the most promising of those we've considered here:\n<a href=\"https://80000hours.org/career-guide/strategy/strategies/advocacy/\">https://80000hours.org/career-guide/strategy/strategies/advocacy/</a></p>\n<p>However, more broadly I think this is a very difficult question. You can narrow down to a plausible short-list, but after that it's all about personal fit (i.e. choosing the area where you have the highest chances of outsized success).</p>\n<p>It's also worth bearing in mind that success in almost any field translates into some measure of influence, because success gives you some combination of credibility, money and connections. So again, personal fit could be the key thing to focus on in the medium-term.</p>\n<p>The short-list would be things like:</p>\n<ul>\n<li>Academia with an emphasis on being a public intellectual</li>\n<li>Non-academic public intellectuals</li>\n<li>Journalists and bloggers</li>\n<li>The media generally</li>\n<li>Politicians</li>\n<li>Advocacy and campaigning groups</li>\n</ul>\n<p>Maybe teaching too, though the scale seems somewhat less than those above.</p>\n", "parentCommentId": "xrkEHstBi5Ar6qkAx", "user": {"username": "Benjamin_Todd"}}, {"_id": "dnJvbfvtYhNsCkPer", "postedAt": "2015-06-23T02:50:17.065Z", "postId": "FPDzJjHo75cGjcZRY", "htmlBody": "<p>Just to clarify, I'm not claiming you <em>can</em> get 1000x returns, just that your view about the maximum spread of returns will effect the conclusion.</p>\n<p>Some examples of how you could reason towards CBR of over 100:</p>\n<p>1) It's plausible Give Directly has a CBR of ~30 (just focusing on the short-run welfare effects). \n<a href=\"http://reflectivedisequilibrium.blogspot.com/2014/03/givedirectly-happiness-and-log-income.html\">http://reflectivedisequilibrium.blogspot.com/2014/03/givedirectly-happiness-and-log-income.html</a></p>\n<p>And you could think AMF is 5x that, getting you to over 100.</p>\n<p>Then you could think GiveWell itself (or other EA orgs) get you another 10x due to the multiplier effect, getting you to an overall CBR of 1000x.</p>\n<p>Of course there's lots of ways you could object to this too!</p>\n<p>2) Another way you might get led to CBR of over 100 is that if you care mainly about long-run effects, and you think there's a relatively narrow range of activities that clearly benefit the long-run. e.g. if you think preventing existential risk is the key proxy for a good long-run future, you might think most ways of spending money have about zero effect on that, while some opportunities have very positive effects (e.g. donating to the FHI), creating a very high-return on well targeted donations.</p>\n<p>You can see a great review of the overall debate about how large typical differences in cost-effectiveness are here:\n<a href=\"http://reducing-suffering.org/why-charities-dont-differ-astronomically-in-cost-effectiveness/\">http://reducing-suffering.org/why-charities-dont-differ-astronomically-in-cost-effectiveness/</a></p>\n", "parentCommentId": "vhNmoSm5FmKq8fCWt", "user": {"username": "Benjamin_Todd"}}, {"_id": "uuNhwp3FsiMw4CEMH", "postedAt": "2015-06-23T15:33:28.042Z", "postId": "FPDzJjHo75cGjcZRY", "htmlBody": "<blockquote>\n<p>If I had to guess the optimal medium-term proportion of EAs earning to give, I might go for 10%.</p>\n</blockquote>\n<p>How many EAs are currently earning to give?</p>\n", "parentCommentId": "WvuRzyMBbyELGgdu8", "user": {"username": "Peter_Hurford"}}, {"_id": "Xfc9MeEhakepsE2kz", "postedAt": "2015-06-24T02:35:15.726Z", "postId": "FPDzJjHo75cGjcZRY", "htmlBody": "<blockquote>\n<p>If I had to guess the optimal medium-term proportion of EAs earning to give, I might go for 10%.</p>\n</blockquote>\n<p>Hm, this seems quite low.  What would you have the other 90% be doing?  Intuitively I'm thinking I'd want at least enough EAs earning to give so as to fund the rest of the EA movement working at EA organizations full-time, but that's just a thought off the top of my head.  (The issue is complicated by the fact that many career paths are &quot;earning to give plus&quot;--they both have a decent associated salary and give you the opportunity to do other EA activities.  For example, being an influencer college professor.)</p>\n", "parentCommentId": "WvuRzyMBbyELGgdu8", "user": {"username": "John_Maxwell_IV"}}, {"_id": "uzsXbrMKozHRMazoC", "postedAt": "2015-06-24T03:23:29.616Z", "postId": "FPDzJjHo75cGjcZRY", "htmlBody": "<p>Good point, it's very hard to tell.</p>\n<p>From people who have made significant plan changes, about a third are (in part) earning to give (though usually they're also going for career capital too). But this could overestimate the proportion. [this was also partly the figure I had in mind, though it's a bit different].</p>\n<p>Thinking through EA groups, often a significant fraction (like over 30%) of ppl are software engineers or similar and donating income.</p>\n<p>GiveWell users and GWWC members also make up a big fraction of &quot;dedicated EAs&quot;, and if you count them as mainly contributing through their donations, then it could be a majority. There's thousands of them compared to hundreds changing plans due to 80k (excluding etg).</p>\n", "parentCommentId": "uuNhwp3FsiMw4CEMH", "user": {"username": "Benjamin_Todd"}}, {"_id": "vnstSmTiHE8mcEnGJ", "postedAt": "2015-06-24T20:23:18.995Z", "postId": "FPDzJjHo75cGjcZRY", "htmlBody": "<p>The highest-earning 10% of EAs may have expected earnings of ~$1m per year in the long-run, so they'd be able to fund ~10 people doing direct work at current EA org salaries.</p>\n<p>Also, young EAs who want to do direct work should be able to pull in funds from elsewhere e.g. Good Ventures and other large donors. (or even broader, there's already $300bn given to charity each year; $140bn spent on international dev). </p>\n", "parentCommentId": "Xfc9MeEhakepsE2kz", "user": {"username": "Benjamin_Todd"}}, {"_id": "ZNsEo3yQZqkxQJNiv", "postedAt": "2015-06-25T05:30:14.008Z", "postId": "FPDzJjHo75cGjcZRY", "htmlBody": "<p>Interesting.  I assume you also considered the inverse strategy of hiring non-EAs to work at EA orgs?  Let's say I'm an EA org hiring a personal assistant... if I hire an EA as my personal assistant, that EA no longer has the opportunity to draw a salary from a non-EA organization and funnel that money in to an EA organization via earning to give.  (On the other hand, hiring EAs is useful for dealing with principle-agent problems.)</p>\n", "parentCommentId": "vnstSmTiHE8mcEnGJ", "user": {"username": "John_Maxwell_IV"}}, {"_id": "HnMiAqwNMdi4pbHDC", "postedAt": "2015-06-25T09:28:34.776Z", "postId": "FPDzJjHo75cGjcZRY", "htmlBody": "<p>Civil service</p>\n", "parentCommentId": "AciZwbJeActCvX6S2", "user": {"username": "tomstocker"}}, {"_id": "fMgTqYrC7fdHzvWFm", "postedAt": "2015-06-25T09:32:04.028Z", "postId": "FPDzJjHo75cGjcZRY", "htmlBody": "<p>Also, generally, having more EAs in different areas of the labour market appears on the face of it very useful as long as they are in collaborative communication with the rest of the community. A larger skill set and set of perspectives to draw on. More communal learning value. Better ability to spot opportunitites. Wider networks. What do you think of this perspective Ben?</p>\n", "parentCommentId": "vnstSmTiHE8mcEnGJ", "user": {"username": "tomstocker"}}, {"_id": "pWEvYi9jnm7tBioge", "postedAt": "2015-06-25T09:45:07.167Z", "postId": "FPDzJjHo75cGjcZRY", "htmlBody": "<p>Great responses, thanks both for taking the time.</p>\n", "parentCommentId": "vhNmoSm5FmKq8fCWt", "user": {"username": "tomstocker"}}, {"_id": "5iTd3LJ92NxkGQ36p", "postedAt": "2015-06-25T09:50:56.700Z", "postId": "FPDzJjHo75cGjcZRY", "htmlBody": "<p>Not drawing on the 80k framework or anything: do you think you could become an influential economist in government <em>and</em> be confident that you are really working along the right lines without doing a relevant PhD? There are lots of senior economic advisor roles in and outside government I've seen that look influential that are closed to people without one? So is the question whether you want to become an influential civil servant or whether you want to become an influential economist? And what type of economics PhD would you do - they all have different tracks?</p>\n", "parentCommentId": "RMoSr2C5EMewDYZZv", "user": {"username": "tomstocker"}}, {"_id": "mL8WnG7jkg4LeWPqN", "postedAt": "2015-06-25T15:11:49.294Z", "postId": "FPDzJjHo75cGjcZRY", "htmlBody": "<p>I wonder if anyone here can help me with my university course choice? I'm between two minds trying to choose an undergraduate degree - I think I'm going to pick either a finance course, with an aim towards earning to give, or a more humanities-focused course - philosophy, politics, economics and sociology. The latter is at a more prestigious university, and is apparently a fairly well respected degree among employers, but doesn't show the same clear route to effective altruism that finance does, though I would imagine it is reasonably strong in terms of advocacy potential, especially if I pursue politics or journalism. It's also a broader course and lets me keep my options open until I figure out what I want to do. I'd describe my abilities as fairly well-rounded - I would say I'd perform reasonably well in finance if I could sustain interest, as I do like maths and do well at it. Can anybody offer any input? I'll include the links to the courses below.</p>\n<p><a href=\"http://www.nuigalway.ie/science/undergraduate-courses/financial-mathematics-and-economics.html\">http://www.nuigalway.ie/science/undergraduate-courses/financial-mathematics-and-economics.html</a>\n<a href=\"https://www.tcd.ie/courses/ppes/\">https://www.tcd.ie/courses/ppes/</a></p>\n", "parentCommentId": null, "user": {"username": "rabulah"}}, {"_id": "dRoT7qpapzrQgvc8Q", "postedAt": "2015-06-25T19:20:10.866Z", "postId": "FPDzJjHo75cGjcZRY", "htmlBody": "<p>Sounds hard to decide. Have you any idea what kind of advocacy or research you'd want to do? Do you think many people go into finance from the ppes degree?\nI think financial math would be pretty interesting and would give you some cool technical skill. Another Q: what do people who are familiar with the universities day about them?</p>\n", "parentCommentId": "mL8WnG7jkg4LeWPqN", "user": {"username": "RyanCarey"}}, {"_id": "6JTfNshv3uEW5jDv4", "postedAt": "2015-06-25T21:59:43.730Z", "postId": "FPDzJjHo75cGjcZRY", "htmlBody": "<p>Thanks for the reply! I don't know just yet what kind of advocacy I'd be doing - I would hope to figure that out as I went along. Maybe that's a point against PPES, but maybe even being an effective-altruism-minded public figure of any sort would do some good? The PPES degree is only a few years old so there's no real data on where people end up, but similar degrees at York and Oxford list finance among a broad range of commonly chosen careers (<a href=\"http://www.ppe.ox.ac.uk/index.php/a-future-with-ppe\">http://www.ppe.ox.ac.uk/index.php/a-future-with-ppe</a>) (<a href=\"https://www.york.ac.uk/pep/graduate-profiles/)\">https://www.york.ac.uk/pep/graduate-profiles/)</a>. I suppose this would make PPES the broader option, allowing me to change direction later on. Do you feel that this characteristic is more valuable than speeding up my entry into a potentially high-impact position?</p>\n<p>Regarding the universities, all the students I've talked to in both seem to love their respective universities, but Trinity is ranked higher and is much better known internationally.</p>\n", "parentCommentId": "dRoT7qpapzrQgvc8Q", "user": {"username": "rabulah"}}, {"_id": "JQC5kBmtL9i3yBRrP", "postedAt": "2015-06-25T22:21:52.310Z", "postId": "FPDzJjHo75cGjcZRY", "htmlBody": "<p>I prize being around the best people as pretty important. Seems like the finance degree is mostly better for finance so it might be interesting to watch some online finance courses to think about whether it's something you want to commit to. It'd also be interesting to think about whether you get any good electives in the ppes.</p>\n", "parentCommentId": "6JTfNshv3uEW5jDv4", "user": {"username": "RyanCarey"}}, {"_id": "ojuWKc2tZcLjmfxxk", "postedAt": "2015-06-26T23:04:42.819Z", "postId": "FPDzJjHo75cGjcZRY", "htmlBody": "<p>Oxford PPE -&gt; Banking is a very well trodden route.</p>\n<p>I would definitely choose Trinity over the other. Trinity is respected; the other is a no-name. I expect you would find it easier getting into finance with PPES from Trinity than Finance from the other place.</p>\n", "parentCommentId": "6JTfNshv3uEW5jDv4", "user": {"username": "Larks"}}, {"_id": "AvGNCGT8g9WRDQbZt", "postedAt": "2015-06-27T06:33:45.889Z", "postId": "FPDzJjHo75cGjcZRY", "htmlBody": "<p>At CEA, we haven't had much luck hiring non-EAs, though it can work for relatively mechanical or well standardised tasks e.g. book keeping and some assistant work; and we try to do that as much as possible.</p>\n", "parentCommentId": "ZNsEo3yQZqkxQJNiv", "user": {"username": "Benjamin_Todd"}}, {"_id": "WhDJPhoXe8CQmdYwi", "postedAt": "2015-06-27T06:50:32.775Z", "postId": "FPDzJjHo75cGjcZRY", "htmlBody": "<p>Could you do something more quantitative at Trinity? Generally more hard and quantitative keeps your options open better i.e. maths keeps your options open better than economics, and that keeps your options open better than finance. </p>\n<p>I'd focus on options open more than prep for earning to give at this stage, however, if you were going for earning to give, then quantitative subjects like statistics, applied maths, engineering, and physics are also associated with the highest earnings. Though finance can be fine too.</p>\n<p>I see that at Trinity you could also do pure economics, or you could do maths and economics or maths and philosophy. Maths and philosophy can be a great option if you're into it. From our recent profile:</p>\n<blockquote>\n<p>In our view, philosophy is a good subject to study at undergraduate level if it’s taken in combination with a quantitative subject, like maths, computer science, or economics, because it teaches you how to write clearly, how to think clearly, and because certain issues in moral philosophy seem to us to be crucial in determining how to live your life. It’s a weaker all-purpose qualification than quantitative subjects, so we’d encourage undergraduates not to single-major in philosophy if they have the option of also majoring in a quantitative subject.</p>\n</blockquote>\n<p><a href=\"https://80000hours.org/career-guide/top-careers/profiles/philosophy-phd/\">https://80000hours.org/career-guide/top-careers/profiles/philosophy-phd/</a></p>\n<p>i.e. you can get both writing skills and quantitative skills, learn about important topics in the humanities, and get an impressive general purpose qualification.</p>\n<p>I think the fame of the university you go to is worth putting some weight on, though it's a tricky issue. So, in general I'd say Trinity.</p>\n<p>Finally, don't forget personal fit. Don't take a course you think you'll be bad at or really won't enjoy!</p>\n<p>Some more thoughts here: <a href=\"https://80000hours.org/2013/11/summary-of-our-thoughts-on-how-to-pick-a-degree/\">https://80000hours.org/2013/11/summary-of-our-thoughts-on-how-to-pick-a-degree/</a></p>\n", "parentCommentId": "mL8WnG7jkg4LeWPqN", "user": {"username": "Benjamin_Todd"}}, {"_id": "ntnnfibSRASyTGEaq", "postedAt": "2015-06-27T12:09:01.414Z", "postId": "FPDzJjHo75cGjcZRY", "htmlBody": "<p>Getting into finance, at least high-end finance, from a relatively unknown university is hard. I don't think it's an exaggeration to say that you woud have to network very hard or have something else on your CV that will catch a recruiter's attention. Given that, and without knowing that much detail about PPES, my starting guess is that it would actually be easier to break into banking from PPES at Trinity than from finance at a comparatively unknown university. Since the Trinity course seems better for almost any other option you might pursue, that gives it something like 'full spectrum dominance' in my mind.</p>\n<p>Separate to that, it sounds like you have a fairly balanced skillset and no standout interests that you want to turn into a career. I think you should strongly prioritise keeping your options open, give your interests and abilities another few years to develop, and then hopefully you'll have a better idea of what route you want to go down.</p>\n", "parentCommentId": "6JTfNshv3uEW5jDv4", "user": {"username": "AGB"}}, {"_id": "gCoNN7XSagT6enbHw", "postedAt": "2015-06-27T21:31:22.899Z", "postId": "FPDzJjHo75cGjcZRY", "htmlBody": "<p>I have a degree in computer science and experience with explosives. I am not brilliant at research and poor at interacting with people. My current COA is to become a software engineer for the money. Do I appear to be making some dumb oversight.</p>\n", "parentCommentId": null, "user": {"username": "JMeans"}}, {"_id": "ycsm2nG43FYEsXN2w", "postedAt": "2015-06-28T05:07:14.872Z", "postId": "FPDzJjHo75cGjcZRY", "htmlBody": "<p>Which considerations to use?</p>\n<p>A starting point would be, roughly in order of importance:</p>\n<ol>\n<li><p>Personal fit in high earning careers vs. personal fit in best direct work opportunities. You can start to approximate this by asking various organisations whether they'd prefer to hire you or receive $x per year in donations. The more coordinated you are with other EAs, the closer this gets to something like comparative advantage. In general I think EAs are tilting too far towards etg.</p>\n</li>\n<li><p>Career capital potential of the two options. In particular, how likely are really impressive achievements in each option? to what extent do you expect EA to take off? how impressive will your peers be? how useful are the skills?</p>\n</li>\n<li><p>How uncertain you are about which causes will be best in the future (earning to give is the more flexible strategy, though if you gain transferable skills it's not so bad).</p>\n</li>\n<li><p>Your assessment of whether the top causes are going to be more funding constrained or more constrained by the type of skills you could offer in the future.</p>\n</li>\n</ol>\n<p>Here's a bunch more rough notes on the topic, just considering impact potential:\n<a href=\"https://docs.google.com/document/d/1a5SDGv1bX09fRe7a6mp6BzAv69LJVkZ-o9r3WYFk_yM/edit\">https://docs.google.com/document/d/1a5SDGv1bX09fRe7a6mp6BzAv69LJVkZ-o9r3WYFk_yM/edit</a></p>\n<p>In terms of short-term decision making strategy, also consider:</p>\n<ol>\n<li><p>How can I test each option?</p>\n</li>\n<li><p>Which best keeps my options open?</p>\n</li>\n</ol>\n", "parentCommentId": "DhySYH2ApXsQ3S8B9", "user": {"username": "Benjamin_Todd"}}, {"_id": "ddLfLaSQQJtgcNJQN", "postedAt": "2015-06-28T06:29:23.727Z", "postId": "FPDzJjHo75cGjcZRY", "htmlBody": "<p>I agree that thinking about your advocacy efforts is important, but I'm not sure with this example there's an obvious way to call it one way or the other. It would depend on the extent to which you're actually influencing other people. Also, there's effects in the opposite direction e.g. doing more remarkable, drastic actions makes you stand out more, which gives you greater reach. (e.g. giving 5% of your income is good, but giving 50% means you get international press coverage). Doing what you sincerely believe is best can also be powerful.</p>\n<p>Some more relevant reading:</p>\n<p><a href=\"http://www.jefftk.com/p/optimizing-looks-weird\">http://www.jefftk.com/p/optimizing-looks-weird</a></p>\n<p><a href=\"https://meteuphoric.wordpress.com/2015/03/08/the-economy-of-weirdness/\">https://meteuphoric.wordpress.com/2015/03/08/the-economy-of-weirdness/</a></p>\n", "parentCommentId": "W4vtopskqhzqvp2Pk", "user": {"username": "Benjamin_Todd"}}, {"_id": "u4mefNxt65WARNkqi", "postedAt": "2015-06-28T11:04:29.804Z", "postId": "FPDzJjHo75cGjcZRY", "htmlBody": "<p>Hi, Ben. :)</p>\n<p>What about Bioinformatics?</p>\n<ul>\n<li>Living in Portugal, but I have no problem in going to other coutries</li>\n<li>I just finished by Biology's bachelor's degree. </li>\n<li>I'm good at maths, logic and programming. Haskell, Matlab and I'm doing the The Odin Project course.</li>\n<li>Would like to earn to give</li>\n</ul>\n<p>I think something informatics-related would be a good carrer for me. Since I have no formal education on informatics but have a Biology's degree I'm thinking about doing a Masters on Bioinformatics. But I'm afraid that after finishing it I could only get a job with no great impact on society and with not-so-good earnings, compared with other informatics related jobs. </p>\n<ul>\n<li>How much positive impact does bioinformatic's research has on the world?</li>\n<li>Would the Masters raise the chances of getting a really well paid job, to do 'earning to give', compared with just getting a informatics job after doing self-learning? The Masters is two-years long and costs about 1000 €/year.</li>\n</ul>\n<p>Thanks! </p>\n", "parentCommentId": null, "user": {"username": "LLCampos"}}, {"_id": "6KsXPBaMdzfCHPHeg", "postedAt": "2015-06-28T11:23:27.657Z", "postId": "FPDzJjHo75cGjcZRY", "htmlBody": "<p>I'm doing bioinformatics at present. It seems to pay similarly to programming. Have you considered just doing programming / software development? That is usually more dependent on technical skill than credentialisation. Data science or data engineering could also be feasible  if you like maths.</p>\n", "parentCommentId": "u4mefNxt65WARNkqi", "user": {"username": "RyanCarey"}}, {"_id": "Feztj2mM89sY7iE53", "postedAt": "2015-06-29T10:49:16.358Z", "postId": "FPDzJjHo75cGjcZRY", "htmlBody": "<p>But isn't a total lack of formal education a barrier to many jobs and to a high salary?</p>\n<p>What about the impact of bioinformatics on society? How much good could a person do in research focused on bioinformatics?</p>\n", "parentCommentId": "6KsXPBaMdzfCHPHeg", "user": {"username": "LLCampos"}}, {"_id": "qYukPeL97oPg6jKtC", "postedAt": "2015-06-29T16:14:14.922Z", "postId": "FPDzJjHo75cGjcZRY", "htmlBody": "<p>I'm a High School Senior; my interests are very much concentrated in the arts, but those don't seem like a promising route in terms of effective altruism. I have skills in the areas of math and science, but very little personal interest in them. Any advice on finding the balance for a career that's effective, that I also enjoy sufficiently?</p>\n", "parentCommentId": null, "user": {"username": "Eli_Gaal"}}, {"_id": "BqqFRiLQxB55atTqe", "postedAt": "2015-06-29T16:46:04.784Z", "postId": "FPDzJjHo75cGjcZRY", "htmlBody": "<p>Are there any reasons why a humantiies graduate considering trying out software engineering ought not consider data science instead?</p>\n<p>i.e. if you have a non-technical background and would initially by doing online courses with the aim of applying to a bootcamp if you liked it / seemed to be progressing well.  </p>\n", "parentCommentId": null, "user": {"username": "Nick_Robinson"}}, {"_id": "vhP5amvWAkiXwHcuQ", "postedAt": "2015-06-29T17:23:51.018Z", "postId": "FPDzJjHo75cGjcZRY", "htmlBody": "<p>Maybe, although you already have a bachelor's and might later have a better idea about a preferred masters.</p>\n<p>Bioinformatics could help bring about better medicines or biomedical research generally, and could help with the identification of synthetic pathogens from a risk reduction point of view. So it's not without impact.</p>\n", "parentCommentId": "Feztj2mM89sY7iE53", "user": {"username": "RyanCarey"}}, {"_id": "9hJbnqGaLD5fwEdWk", "postedAt": "2015-06-29T17:28:39.153Z", "postId": "FPDzJjHo75cGjcZRY", "htmlBody": "<p>Generally you'll start as a data engineer (read 'person who uses code to organise data') or data analyst (spreadsheets and business') rather than a data scientist (read commercial statistician). If you're starting from zero, it's worth learning to code regardless, and if you love math then it's plausible that data engineer could be a better entry point than web development. Pay is similar.</p>\n", "parentCommentId": "BqqFRiLQxB55atTqe", "user": {"username": "RyanCarey"}}, {"_id": "uAhZ7aPk5Cm5yer7T", "postedAt": "2015-06-29T18:31:46.992Z", "postId": "FPDzJjHo75cGjcZRY", "htmlBody": "<p>Thanks, Ryan. Do you have a specific starting recommendation? </p>\n<p>i.e. best starting point if you think data engineering will suit you more than web development? (e.g. learn python) </p>\n<p>Or quickest way to test out if you're going to like the data science track? (e.g. start with a stats course rather than the coding) </p>\n", "parentCommentId": "9hJbnqGaLD5fwEdWk", "user": {"username": "Nick_Robinson"}}, {"_id": "2PvCjZ39FdQrcb2Jb", "postedAt": "2015-06-29T19:09:48.252Z", "postId": "FPDzJjHo75cGjcZRY", "htmlBody": "<p>If you want to use Python (which would be nice, although most data courses are in R), then this looks good and practical: <a href=\"https://www.udacity.com/course/intro-to-data-science--ud359\">https://www.udacity.com/course/intro-to-data-science--ud359</a>.</p>\n<p>If you are happy to use R (a less generally useful language), then I can vouch for John's Hopkins' Courses courses being very good:<a href=\"https://www.coursera.org/specialization/jhudatascience/1\">https://www.coursera.org/specialization/jhudatascience/1</a>.</p>\n", "parentCommentId": "uAhZ7aPk5Cm5yer7T", "user": {"username": "RyanCarey"}}, {"_id": "mKqbDSRYeWQz6L55C", "postedAt": "2015-06-29T19:25:51.072Z", "postId": "FPDzJjHo75cGjcZRY", "htmlBody": "<p>Ryan is a more experienced programmer/coder than I am. As a time-poor beginner, I found the MITx course on R much, much easier to use (and far more interesting) than the John Hopkins courses on Coursera. They also have two decent courses on Python, the second of which is more relevant to statistical applications. </p>\n<p>MITx course on R - <a href=\"https://www.edx.org/course/analytics-edge-mitx-15-071x-0\">https://www.edx.org/course/analytics-edge-mitx-15-071x-0</a>\nMITx course(s) on Python - <a href=\"https://www.edx.org/course/introduction-computer-science-mitx-6-00-1x-0\">https://www.edx.org/course/introduction-computer-science-mitx-6-00-1x-0</a>\n<a href=\"https://www.edx.org/course/introduction-computational-thinking-data-mitx-6-00-2x-0\">https://www.edx.org/course/introduction-computational-thinking-data-mitx-6-00-2x-0</a></p>\n", "parentCommentId": "uAhZ7aPk5Cm5yer7T", "user": {"username": "ChrisSmith"}}, {"_id": "ncygYDrKYZ6w9fTo7", "postedAt": "2015-06-29T19:34:44.174Z", "postId": "FPDzJjHo75cGjcZRY", "htmlBody": "<p>Strongly urge Trinity. </p>\n<p>It will be easier to get a job in almost any sector with a degree from Trinity rather than a degree from Galway (particularly outside Ireland), you will probably meet more interesting/driven people there, and you can try to make your PPES degree more quantitative if you want through particular choices (eg the econometrics option in third year economics or quantitative methods in fourth year economics), although it is certainly too early to be making specific choices about modules at this stage! </p>\n<p>As others have said, it will also keep your options broader, which is valuable for all of us but particularly those of us who are still trying to work out what we are particularly good at.</p>\n", "parentCommentId": "6JTfNshv3uEW5jDv4", "user": {"username": "ChrisSmith"}}, {"_id": "hHycDj7ewQDWhFCq3", "postedAt": "2015-06-29T19:39:20.159Z", "postId": "FPDzJjHo75cGjcZRY", "htmlBody": "<p>My guess for maximising salary would be something which is going to make you into a quant trader or financial engineer. There is a useful discussion on this site: <a href=\"https://www.quantstart.com/articles/Why-a-Masters-in-Finance-Wont-Make-You-a-Quant-Trader\">https://www.quantstart.com/articles/Why-a-Masters-in-Finance-Wont-Make-You-a-Quant-Trader</a></p>\n", "parentCommentId": "hb9M5Bz6G4oEi6qhb", "user": {"username": "ChrisSmith"}}, {"_id": "Wd3M7SkL32qTL7Jce", "postedAt": "2015-06-29T21:00:01.761Z", "postId": "FPDzJjHo75cGjcZRY", "htmlBody": "<p>What type of arts do you enjoy? For instance, I always really enjoyed English and drama, and am now in a data science job where I am going to be writing up publications and doing talks in addition to my coding/stats work. If you go for a small or start-up company, you can often have a broader job like this where you can take on tasks that interest you - my perception is that larger companies tend to have more regimented roles.</p>\n<p>If you're more into visual arts, web design, marketing or some sort of community-building/social logistics could be good options. They'd also provide good skills in short supply to volunteer to the EA community.</p>\n", "parentCommentId": "qYukPeL97oPg6jKtC", "user": {"username": "GreyArea"}}, {"_id": "GRTWbMTQwzhdsf7ca", "postedAt": "2015-06-29T21:08:46.243Z", "postId": "FPDzJjHo75cGjcZRY", "htmlBody": "<p>I would believe that there are much better R courses than the Johns Hopkins one for an introduction. I'm not particularly experienced at coding, but I was basically only watching those videos for the stats, rather than paying much attention to the code at all. I agree that the mitx Python courses look decently good and wuantitative (though not mostly statistical) for an absolute beginner. The other thing is to try Kaggle introductory challenges in Python for a practical taste!</p>\n", "parentCommentId": "mKqbDSRYeWQz6L55C", "user": {"username": "RyanCarey"}}, {"_id": "Zg6W3SmCthYEJXkaK", "postedAt": "2015-06-30T14:20:16.986Z", "postId": "FPDzJjHo75cGjcZRY", "htmlBody": "<p>Thanks. English and drama and visual arts are all things I like, so I'll look into these things you've said.</p>\n", "parentCommentId": "Wd3M7SkL32qTL7Jce", "user": {"username": "Eli_Gaal"}}, {"_id": "xs6Ceg58XMptqLtnY", "postedAt": "2015-06-30T15:17:55.397Z", "postId": "FPDzJjHo75cGjcZRY", "htmlBody": "<p>Personally I'm especially interested in cause prioritization, psychology, health and education, which are a lot thinner on the ground than anti-poverty work.</p>\n", "parentCommentId": "h6iMzpmTyTJQ8P8oC", "user": {"username": "Elizabeth"}}, {"_id": "9m8iovFeRTzgEyAeB", "postedAt": "2015-07-01T06:15:07.412Z", "postId": "FPDzJjHo75cGjcZRY", "htmlBody": "<p>I should also say that even just from the perspective of maximising earnings, finance may not be ideal, since it doesn't keep your options open as much. If the finance sector shrinks (which doesn't seem unlikely) then the qualification may end up being less useful than it seems.</p>\n<p>Broader applied maths skills don't have that problem.</p>\n", "parentCommentId": "WhDJPhoXe8CQmdYwi", "user": {"username": "Benjamin_Todd"}}, {"_id": "HaSnwJ5jvsMJbQ5wh", "postedAt": "2015-07-01T06:19:02.291Z", "postId": "FPDzJjHo75cGjcZRY", "htmlBody": "<p>Hi everyone,</p>\n<p>Just a note to say I'm still working on replies - trying to do at least one a day!</p>\n<p>Sorry if I didn't get to you yet.</p>\n", "parentCommentId": null, "user": {"username": "Benjamin_Todd"}}, {"_id": "qsSZXAt6YFW9qK28H", "postedAt": "2015-07-01T12:02:11.381Z", "postId": "FPDzJjHo75cGjcZRY", "htmlBody": "<p>Take your time.  Your efforts are much appreciated.</p>\n", "parentCommentId": "HaSnwJ5jvsMJbQ5wh", "user": {"username": "Undercover"}}, {"_id": "uLbD3HNwxfB2zvECm", "postedAt": "2015-07-01T19:43:37.702Z", "postId": "FPDzJjHo75cGjcZRY", "htmlBody": "<p>I think communication skills are very important. Some careers that 80,000 hours has explored relevant to what you are saying:</p>\n<ul>\n<li><a href=\"https://80000hours.org/career-guide/top-careers/profiles/foundation-program-manager/\">https://80000hours.org/career-guide/top-careers/profiles/foundation-program-manager/</a></li>\n<li><a href=\"https://80000hours.org/career-guide/top-careers/profiles/work-in-marketing/\">https://80000hours.org/career-guide/top-careers/profiles/work-in-marketing/</a></li>\n<li><a href=\"https://80000hours.org/career-guide/top-careers/profiles/policy-oriented-civil-service-uk/\">https://80000hours.org/career-guide/top-careers/profiles/policy-oriented-civil-service-uk/</a></li>\n<li><a href=\"https://80000hours.org/career-guide/top-careers/profiles/program-manager-in-international-organisations/\">https://80000hours.org/career-guide/top-careers/profiles/program-manager-in-international-organisations/</a></li>\n</ul>\n", "parentCommentId": "qYukPeL97oPg6jKtC", "user": {"username": "Ben_West"}}, {"_id": "RCN5omq827kHRKej5", "postedAt": "2015-07-01T21:30:37.101Z", "postId": "FPDzJjHo75cGjcZRY", "htmlBody": "<p>Any idea how quickly career capital gains diminish in software engineering? I'm going to graduate with a degree in computer science and 3 internships. I'm curious if the best way to improve my career capital would be by switching fields into something like data science or economics. </p>\n", "parentCommentId": null, "user": {"username": "JoshCurtis"}}, {"_id": "2Pd4XLC5y8hR77mtP", "postedAt": "2015-07-03T02:47:21.426Z", "postId": "FPDzJjHo75cGjcZRY", "htmlBody": "<p>I'm not sure doing a startup should really be thought of as replaceable.</p>\n<p>But it is true that the .impact work is EA movement building, whereas doing a start-up isn't, so if you think EA movement building is more pressing, then that's reason against the startup.</p>\n", "parentCommentId": "shvjqNP4xGCenGTaP", "user": {"username": "Benjamin_Todd"}}, {"_id": "azYTCqbYAMoWeie8Z", "postedAt": "2015-07-03T03:00:35.422Z", "postId": "FPDzJjHo75cGjcZRY", "htmlBody": "<p>Hi Eli,</p>\n<p>There are many career paths in the arts. You can have an impact in them through:</p>\n<ol>\n<li>Advocacy - gain a platform and use it to spread important ideas e.g. journalist who sometimes covers neglected topics; TV producer who works an important social issue into a plot line.</li>\n<li>Gain skills and use them directly to help effective projects e.g. many projects need design skills for websites, promotional materials etc.</li>\n<li>Seek out higher earning positions and earn to give. I'm not sure exactly what these are though - it's probably the less artistic stuff!</li>\n</ol>\n<p>One concrete option that stands out would be learning web design with some basic front end web development. That's widely in-demand skill set which you could apply to a non-profit, or you could freelance and do pro bono work, or you could use to earn to give.</p>\n<p>Also I'd say that at high school, I don't think you need to worry too much about knowing exactly what you'll go into. Prioritise exploring different areas, personal growth, and building useful skills.\n<a href=\"https://80000hours.org/2014/12/stop-worrying-so-much-about-the-long-term/\">https://80000hours.org/2014/12/stop-worrying-so-much-about-the-long-term/</a></p>\n<p>It's also worth keeping your options open. Many subjects are boring at high school, but turn out to be more interesting at university, when you start studying them 'for real'. Or just lucking into a good teacher can make a difference. There might be other quantitative subjects like economics and computer science that few people study at high school but you turn out to enjoy.</p>\n<p>If you want to keep your options open, bear in mind it's easier to transfer from more quant subjects into more artistic ones than vice versa. So, if you're uncertain, consider at least doing a minor in something more quantitative at university.</p>\n<p>Finally, don't forget that personal fit is always very important. If you're going to excel in arts, but be average at science, it could easily be better to do arts. If you're good at what you do (and it's not totally random!), then there will likely be good opportunities to use your skills to have an impact in the future.</p>\n", "parentCommentId": "qYukPeL97oPg6jKtC", "user": {"username": "Benjamin_Todd"}}, {"_id": "HoeCXZefBDsTaggjM", "postedAt": "2015-07-03T03:22:56.999Z", "postId": "FPDzJjHo75cGjcZRY", "htmlBody": "<p>I agree that communication skills are very important, though bear in mind that arts majors are much more likely to end up unemployed or in jobs that don't require a college degree.\n<a href=\"http://fivethirtyeight.com/features/the-economic-guide-to-picking-a-college-major/\">http://fivethirtyeight.com/features/the-economic-guide-to-picking-a-college-major/</a></p>\n<p>And sometimes more likely to find their work unmeaningful too! Notice that visual comm and drama are near the bottom.\n<a href=\"http://www.payscale.com/college-salary-report-2013/majors-that-change-the-world\">http://www.payscale.com/college-salary-report-2013/majors-that-change-the-world</a></p>\n<p>So, don't necc extrapolate from 'communication skills are valuable' to 'study arts at university'. Work on your communication skills, but consider doing that in a more quant subject e.g. economics, or doing a joint major.</p>\n", "parentCommentId": "uLbD3HNwxfB2zvECm", "user": {"username": "Benjamin_Todd"}}, {"_id": "2vPmxRryD5EerPkad", "postedAt": "2015-07-03T03:36:37.226Z", "postId": "FPDzJjHo75cGjcZRY", "htmlBody": "<p>1) For the causes you're interested in, do web research to find all the most relevant organisations in the cause. Open Phil's cause overviews are a great starting point: <a href=\"http://www.givewell.org/labs/causes\">http://www.givewell.org/labs/causes</a></p>\n<p>Try to identify the best run and most effective projects in the cause, then go and speak to people at those organisations, then try and get jobs whereever you've got the best fit.</p>\n<p>2) If you want to start a new project, it's harder. The main thing is to get to know people working in the causes you're working on who are succeeding and doing innovative things. That's how you'll discover new projects, and find people who want to work with you, and trust you enough to go ahead.</p>\n<p>How to meet people depends on the cause. Maybe there's a good conference, a meet-up, or a certain organisation that's the centre of everything.</p>\n<p>Try to discover what the big problems are in the cause, then try to figure out how they can be solved. Try to hack together a basic version of your idea to show that you can solve it, then use that to raise money.</p>\n<p>More generally, learn about all the writing on tech startups, since this seems to the be state of the art on how to start new projects (though it doesn't apply to everything you'd do in the nonprofit sector).</p>\n<p><a href=\"http://paulgraham.com/startupideas.html\">http://paulgraham.com/startupideas.html</a></p>\n<p>I realise this is only a very partial answer, so let me know what other questions you have.</p>\n", "parentCommentId": "nzWEChPBfhaTmJtkA", "user": {"username": "Benjamin_Todd"}}, {"_id": "gijDNYB5nWYafsEBg", "postedAt": "2015-07-03T03:47:34.772Z", "postId": "FPDzJjHo75cGjcZRY", "htmlBody": "<p>Hi Amon,</p>\n<p>If you're just looking to maximise salary, then I reckon look for the following factors:</p>\n<ol>\n<li>Average earnings of graduates</li>\n<li>Flexibility of skills</li>\n<li>Personal fit - test this by trying out the subject</li>\n</ol>\n<p>Average earnings of graduates is a clue to the earning potential. \n<a href=\"http://www.payscale.com/college-salary-report/majors-that-pay-you-back/graduate-degrees\">http://www.payscale.com/college-salary-report/majors-that-pay-you-back/graduate-degrees</a>\n<a href=\"http://fortune.com/2015/04/27/best-worst-graduate-degrees-jobs/\">http://fortune.com/2015/04/27/best-worst-graduate-degrees-jobs/</a></p>\n<p>However, bear in mind the data is normally not corrected for selection effects (i.e. smarter ppl study maths, and that's why maths phds earn more etc.). So take it with quite a bit of salt.</p>\n<p>Also, you need to take into account flexibility of the skills, because it's highly uncertain what professions will be highest paid in the future. </p>\n<p>Petroleum engineer graduate degrees are currently among the highest paid, but that industry might go into structural decline due to cheap solar panels. More broadly, it's common for skilled professions to be highly cyclical.</p>\n<p>So, I'd say it's better to go for more widely applicable subjects like statistics or computer science, rather than something narrower like finance or a particular type of engineering.</p>\n<p>Finally, the rankings are only averages. It also really matters how good you'll be within the subject i.e. it's probably better to be great at economics than mediocre at engineering, even if  engineers are higher paid on average. So that's why to factor in personal fit.</p>\n<p>Finally, I'd say put especially high weight on flexbility, in case you decide to stop earning to give.</p>\n<p>What would you say now ranks top based on this?</p>\n", "parentCommentId": "hb9M5Bz6G4oEi6qhb", "user": {"username": "Benjamin_Todd"}}, {"_id": "MbLoNMSNX6LxGJ2w9", "postedAt": "2015-07-03T04:27:30.563Z", "postId": "FPDzJjHo75cGjcZRY", "htmlBody": "<p>Hi there,</p>\n<p>We haven't yet put much thought into whether to do phds later on in your career.</p>\n<p>One point is that because you'll have less time to utilise the qualification, the overall returns will be lower. e.g. if you graduate from a phd age 25, then you have 40 years to use the career capital. If you graduate from one age 35, then you only have 30 years, so the return will be about 75% as large. Whether or not this means it's not worth it, I'm not sure.</p>\n<p>My other guess is that the more qualifications you have, the more diminishing the returns are. However, there is a boost from having a phd vs. a masters.</p>\n<p>Two other thoughts:</p>\n<p>1) Are you finding yourself constrained by the lack of an economics phd? What positions would you most like to take? Do these require phds? If not, consider just going into them directly.</p>\n<p>2) Just a thought, you may be putting too much weight on 'career capital as qualifications'. You can also get career capital by just working on important projects, notching up achievements and through that building your network. </p>\n", "parentCommentId": "RMoSr2C5EMewDYZZv", "user": {"username": "Benjamin_Todd"}}, {"_id": "K3vdS9Sqx3JhsKeHz", "postedAt": "2015-07-04T12:58:30.559Z", "postId": "FPDzJjHo75cGjcZRY", "htmlBody": "<p>True, the chances of someone doing a very similar startup aren't 100% (though they're not 0%). I was more thinking that there's more of a shortage of people doing EA movement building than of people doing startups, and partly as a result of this a marginal extra person doing EA work is more valuable.</p>\n", "parentCommentId": "2Pd4XLC5y8hR77mtP", "user": {"username": "Nekoinentr"}}, {"_id": "yfB6coNsdqXC8cirw", "postedAt": "2015-07-06T04:50:48.535Z", "postId": "FPDzJjHo75cGjcZRY", "htmlBody": "<p>Software engineers most common by some margin I think.\nThen data science and compsci phd; not sure which is more common.</p>\n<p>We're not aiming the profiles at just at EAs, so aren't including this info right now. I hope to have blog posts about EA skill shortages in the future though.</p>\n<p>If you especially care about AI, then I reckon lean towards the compsci phd.</p>\n", "parentCommentId": "L9BxYY5Xyc9QHGjRj", "user": {"username": "Benjamin_Todd"}}, {"_id": "Lxw45CMr2FoiiQGiw", "postedAt": "2015-07-06T04:51:12.140Z", "postId": "FPDzJjHo75cGjcZRY", "htmlBody": "<p>Agree with Ryan that personal fit is also a very big consideration at this point</p>\n", "parentCommentId": "AdrdGe6vc5eEQkx9T", "user": {"username": "Benjamin_Todd"}}, {"_id": "uFh4P3xQxp7FwKpeZ", "postedAt": "2015-07-11T21:22:36.681Z", "postId": "FPDzJjHo75cGjcZRY", "htmlBody": "<p>Re: number two: one of the reasons I dislike going into entrepreneurship right away for career capital is just a basic principle that, if you want to learn something, it's almost never optimal to rediscover that thing independently. You almost always want to have someone else teach you, if possible.</p>\n<p>With this more precise statement, it's more of a criticism of the &quot;standard model&quot; of startups (two friends from college with similar backgrounds starting a company) versus a critique of startups per se. If you start a company with someone who is significantly more experience than you you might be able to get the best of both worlds.</p>\n", "parentCommentId": "TR3MqGFobE4rEsuQD", "user": {"username": "Ben_West"}}, {"_id": "nmvbDuZYN8JaGks8i", "postedAt": "2015-07-11T23:57:16.054Z", "postId": "FPDzJjHo75cGjcZRY", "htmlBody": "<p>I'm currently doing a PhD in bioinformatics after doing a B.S. in biology. This probably isn't where I would have ended up if I could do it all over again, but it's a great way to get into a more quantitative field from a life sciences background. I took little math and no computer science in college, but I got into my PhD program on the strength of my biology experience. Now I'm using my PhD to make up for the skills I lack.</p>\n<p>I did consider doing a masters, but I think a PhD offers much more career capital and prestige than a masters or certification. It also leaves more options open: for example, I've considered working for a funding agency like NSF.  This would be impossible without a PhD. In my experience, biotech masters students were noticeably less sophisticated than the PhD students. They took fairly easy classes and did little research. Most PhDs in the U.S. are free and pay you a stipend. Compare that to masters degrees, which can cost $40K or more at a private university.  </p>\n", "parentCommentId": "u4mefNxt65WARNkqi", "user": {"username": "Lila"}}, {"_id": "jeDqgWzGZekubKDfe", "postedAt": "2015-07-12T00:03:11.314Z", "postId": "FPDzJjHo75cGjcZRY", "htmlBody": "<p>If you decide to go back to school, sociology may not offer a good return on investment, according to this article that Ben linked earlier: <a href=\"http://fivethirtyeight.com/features/the-economic-guide-to-picking-a-college-major/\">http://fivethirtyeight.com/features/the-economic-guide-to-picking-a-college-major/</a></p>\n<p>Some of your credits would probably transfer to public policy, which offers better pay. </p>\n", "parentCommentId": "QHPYDdCdx6c9txscJ", "user": {"username": "Lila"}}, {"_id": "iLofEEg2HsBYMA4aJ", "postedAt": "2015-08-09T01:08:47.324Z", "postId": "FPDzJjHo75cGjcZRY", "htmlBody": "<p>Going into an accelerator could also help a lot.</p>\n", "parentCommentId": "uFh4P3xQxp7FwKpeZ", "user": {"username": "Benjamin_Todd"}}, {"_id": "Qhq6ataZNFmrFCmqP", "postedAt": "2015-08-09T01:11:36.563Z", "postId": "FPDzJjHo75cGjcZRY", "htmlBody": "<p>From that short info, it sounds like a sensible decision.</p>\n<p>I'd also recommend doing a thorough review of how your career is going once a year. And try to meet people in the effective altruism community and ask them if there's something you've overlooked.</p>\n", "parentCommentId": "gCoNN7XSagT6enbHw", "user": {"username": "Benjamin_Todd"}}, {"_id": "948xRaiR33TTFWAYT", "postedAt": "2015-08-09T01:21:32.539Z", "postId": "FPDzJjHo75cGjcZRY", "htmlBody": "<p>Hard to say.</p>\n<p>One quick thought is it depends a lot on what you want to do long-term. e.g. Studying economics would be a bit of a shift in direction, which could make sense if you wanted to go into policy or research, but not so much otherwise.</p>\n<p>Another thought is to focus more on figuring out where you can really kick ass at what you do. All the options you list are good, so often then it comes more down to personal fit. Being really really good at something is often one of the best things you can do for your career capital.</p>\n<p>A lot will also depend on the specific opportunities. Where can you work with great people? Where can you get a good mentor? If you want to build career capital, these are really important considerations too.</p>\n<p>Final small thing, overall data science seems a little more in demand and a little higher paid than SWE, so could be good to move in that direction. I wouldn't put much weight on this though.</p>\n", "parentCommentId": "RCN5omq827kHRKej5", "user": {"username": "Benjamin_Todd"}}, {"_id": "ivwEXssp4L8XyzKcv", "postedAt": "2015-08-09T01:59:50.191Z", "postId": "FPDzJjHo75cGjcZRY", "htmlBody": "<p>Hi KJSD,</p>\n<p>Start by working through our how to choose process:\n<a href=\"https://80000hours.org/career-guide/how-to-choose/\">https://80000hours.org/career-guide/how-to-choose/</a>\nAll you can do is try to take the best option available at the time, no matter what life throws at you. </p>\n<p>In terms of specifics:</p>\n<p>I think in general it's worth finishing college. (unless there's a good chance you'll drop out if you return). <a href=\"https://80000hours.org/2014/02/should-you-do-a-degree/\">https://80000hours.org/2014/02/should-you-do-a-degree/</a></p>\n<p>In terms of subject, generally those with more applied quantitative skills will give you more options and make you more employable than the others. If you also want to do something related to social science, then economics is the natural choice. (Though don't do it if you'll dislike or it perform badly).</p>\n<p>Another option might be to start learning web development (e.g. via the Odin Project) / web design / copyediting / sales part-time, with the aim of later using them at an organisation that works in a cause you want to focus on later. I recommend these skills because you can often get this type of work without formal credentials. They can also be pursued part-time.</p>\n", "parentCommentId": "QHPYDdCdx6c9txscJ", "user": {"username": "Benjamin_Todd"}}, {"_id": "Xxe7PP3FCWsfStL8t", "postedAt": "2015-08-09T02:01:25.599Z", "postId": "FPDzJjHo75cGjcZRY", "htmlBody": "<p>No, this isn't something we've focused on. The best piece I'm aware of in this area though is this: <a href=\"http://csi.gsb.stanford.edu/elusive-craft-evaluating-advocacy\">http://csi.gsb.stanford.edu/elusive-craft-evaluating-advocacy</a></p>\n<p>You could also look at &quot;process tracing&quot; as a methodology: <a href=\"http://betterevaluation.org/evaluation-options/processtracing\">http://betterevaluation.org/evaluation-options/processtracing</a>\nThat's what Oxfam tried using to evaluate their advocacy efforts.</p>\n", "parentCommentId": "8pmijHMjcPDEqWPvC", "user": {"username": "Benjamin_Todd"}}, {"_id": "MmEePcAedPsvpbNpD", "postedAt": "2015-12-06T02:51:54.396Z", "postId": "FPDzJjHo75cGjcZRY", "htmlBody": ".", "parentCommentId": null, "user": {"username": "elephantower"}}, {"_id": "ch92jSwDAqMt2kHck", "postedAt": "2015-12-27T23:53:43.220Z", "postId": "FPDzJjHo75cGjcZRY", "htmlBody": "<p>This site is a great idea, but its frustrating that people in situations like myself seem to be unaccounted for. I'm looking for ethical job ideas that someone like myself could actually obtain out there in the world. I'm 36, and not in a financial position to return to school, nor do I want to. I'm low income and working a seasonal factory job at the moment. I make about $10,000-12,000 a year (yes, I actually live on that) so donating money is out of the question (I do however donate my time when I can). I had a good laugh when this website suggested I could donate &quot;just&quot; $12,000 a year! That's all there is here folks! lol. I do what I can for the causes I care about such as not driving a car for the environment and being vegan for both the environment and for my personal convictions that enslavement and killing of our fellow beings is morally wrong. I'd love to find a way to increase my income and also do more to help people, animals, and the planet. Any realistic suggestions are very welcome!!</p>\n", "parentCommentId": null, "user": {"username": "ryderw"}}, {"_id": "bC5axJPoedmQykuEG", "postedAt": "2016-01-05T17:56:22.618Z", "postId": "FPDzJjHo75cGjcZRY", "htmlBody": "<p>Hi Ryder,</p>\n<p>Unfortunately we only have a very small team, so we've had to choose a narrow audience to focus on for the time being.</p>\n<p>We do have this article:\n<a href=\"https://80000hours.org/articles/how-to-make-a-difference-in-any-career/\">https://80000hours.org/articles/how-to-make-a-difference-in-any-career/</a></p>\n<p>I think you're right that you can focus on using your free time to make a difference. Then the question is which cause to focus on?\n<a href=\"https://80000hours.org/articles/cause-selection/\">https://80000hours.org/articles/cause-selection/</a></p>\n<p>You mention promoting the end of factory farming. Within that, check this out:\n<a href=\"http://www.animalcharityevaluators.org/resources/volunteering-advice/\">http://www.animalcharityevaluators.org/resources/volunteering-advice/</a>\nOne solid option seems to be vegan flyering. \nAlso just eating vegan and convincing your friends to do the same.</p>\n<p>You could also hold a fundraiser e.g. a birthday fundraiser: <a href=\"http://www.charityscience.com/birthday-fundraisers.html\">http://www.charityscience.com/birthday-fundraisers.html</a></p>\n<p>Otherwise you could aim to get into a higher earning job. What are some common jobs that people doing what you do right now transition into? Could you learn a trade? \nIt all comes down to our general process: make a list of options, find out more about them, try to narrow them down etc.\n<a href=\"https://80000hours.org/career-guide/how-to-choose/\">https://80000hours.org/career-guide/how-to-choose/</a></p>\n<p>Hope that's a little help,</p>\n<p>Ben</p>\n", "parentCommentId": "ch92jSwDAqMt2kHck", "user": {"username": "Benjamin_Todd"}}, {"_id": "49BiuQ8vrcfgKP2yR", "postedAt": "2016-01-05T18:07:38.489Z", "postId": "FPDzJjHo75cGjcZRY", "htmlBody": "<p>Hi there,</p>\n<p>In the most harmful jobs post we do say:</p>\n<blockquote>\n<p>Working in the coal industry\nClimate change and particulate pollution are very bad things. But the responsibility for it is spread over tens of millions of people working in the sector, and billions of people using the products. Furthermore, greater availability of energy through fossil fuels is also helping to lift billions out of poverty. This makes it unlikely to be one of the most harmful careers per employee.</p>\n</blockquote>\n<p>The oil industry isn't as bad as coal. Overall, my guess is that marginal oil exploration is harmful, in that we're extracting more than would be socially optimal (if you were to factor in the costs of carbon dioxide), though it's not super harmful. So earning to give in the sector <em>could</em> be permissible, though if you could find an industry that also has positive effects that would be much better. Also this isn't a thoroughly considered view so could easily change.</p>\n<p>Also, if you were just setting out to earn to give, I don't think focusing on petroleum engineering is an especially good strategy because it's very narrow. You might just turn out not to like it. More worrying, if a carbon tax was introduced (which sounds pretty likely in 10-20 years), then the amount of oil that gets extracted will fall significantly, which will especially harm new entrants to the field. Further, if solar prices keep coming down as fast as they have, then solar electricity will soon be cheaper than fossil fuel produced electricity, and that's going to be another massive hit to the industry. \n<a href=\"http://www.telegraph.co.uk/finance/comment/ambroseevans_pritchard/10755598/Global-solar-dominance-in-sight-as-science-trumps-fossil-fuels.html\">http://www.telegraph.co.uk/finance/comment/ambroseevans_pritchard/10755598/Global-solar-dominance-in-sight-as-science-trumps-fossil-fuels.html</a></p>\n<p>More generally, you're building career capital that isn't very robust to the future. It's better to focus on more generally transferable skills rather than betting on one industry.</p>\n<p>In terms of comparing your other options, work through our tool: <a href=\"https://80000hours.org/career-guide/how-to-choose/\">https://80000hours.org/career-guide/how-to-choose/</a></p>\n<p>Ben</p>\n", "parentCommentId": "MmEePcAedPsvpbNpD", "user": {"username": "Benjamin_Todd"}}]