[{"_id": "DQCtb4FETpz6xxDE4", "postedAt": "2014-10-16T16:35:55.757Z", "postId": "FpjQMYQmS3rWewZ83", "htmlBody": "<p>I agree with this, and try (sometimes awkwardly) not to put the phrase &quot;effective altruist&quot; in materials whose intended audience is the general public, much as I do with the acronyms GWWC and 80k.  </p>\n<p>My worry though is that people will use &quot;effective altruists&quot; as a phrase to describe people in our movement unless we give them a better one to use.  Other than &quot;aspiring effective altruist&quot;, which I have used occasionally when talking with journalists, I don't find any of the others 'sticky' enough.  </p>\n<p>I would love to hear suggestions from others on a short memorable phrase that we can use to describe ourselves collectively and as individuals, because I worry that otherwise &quot;effective altruists&quot; will end up being used.  </p>\n", "parentCommentId": null, "user": {"username": "Niel_Bowerman"}}, {"_id": "T9W4nNkg784GinPqk", "postedAt": "2014-10-16T19:24:51.632Z", "postId": "FpjQMYQmS3rWewZ83", "htmlBody": "<p>Neil, I agree with your sentiment that declarative phrase “effective altruist” is an ideal/abstraction. No mortal can be true (100%) effective altruist. Term “effective altruist” will confuse most people. It also infers ideology “effective altruism”.</p>\n<p>I feel that translating declarative abstract meaning into operational average-person words shall help better sustain common sense of  what we want to do. Take popular key words, having altruistic flavors, such as voluntarism, charity, giving, etc., and decorate them with qualifiers that imply a degree of effectiveness relatively to an average person cognition.  For example, phrases like Charity Wise, Giving It Right, Smart Givers, Giving With Wisdom, etc. </p>\n", "parentCommentId": "DQCtb4FETpz6xxDE4", "user": {"username": "Ilya"}}, {"_id": "4HWfHg3dtqnF6bCrH", "postedAt": "2014-10-17T11:39:30.254Z", "postId": "FpjQMYQmS3rWewZ83", "htmlBody": "<p>I don't know how really usable you might intend those examples to be, but they could be tested out to see what if we ourselves like using them.</p>\n", "parentCommentId": "T9W4nNkg784GinPqk", "user": {"username": "Evan_Gaensbauer"}}, {"_id": "cf33dzhx3EteJ9Pt6", "postedAt": "2014-10-17T11:48:31.051Z", "postId": "FpjQMYQmS3rWewZ83", "htmlBody": "<p>&quot;Effectiveness-minded altruist&quot; has the right meaning, but it's not very pithy.</p>\n", "parentCommentId": "DQCtb4FETpz6xxDE4", "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "fvJKy3CjM6GmWLS59", "postedAt": "2014-10-17T11:54:26.481Z", "postId": "FpjQMYQmS3rWewZ83", "htmlBody": "<ul>\n<li><p>This post is serendipitous because I myself was thinking of writing a post sometime about how effective altruism is more a method than it is a philosophy. That is, effective altruism <em>is</em> philosophy in action, but it doesn't need to be <em>a</em> philosophy, i.e., complete way of life. i.e., ideology. I still want to write that article in the future because framing effective altruism as a method taking its first steps into discovering what tends to work well in doing good, and what tends to work not as well. </p>\n</li>\n<li><p>How you framed it in the article is that ideologies answer questions, while effective altruism asks questions. Is another way of saying this the distinction between asking descriptive vs. normative questions, or making descriptive vs. normative claims? I don't think so, but I'm unsure. Either way, I don't believe it makes sense to make effective altruism into something that doesn't ask normative claims, or doesn't ask normative questions. Effective altruism is a community of people as much as it is anything else, so it's not something that exists on its own (yet) as being indifferent to <em>how</em> 'good' is defined, so long as much as possible of it is done.</p>\n</li>\n<li><p>In the interest of reducing the size of identities for not just myself, but for others, and bunches of individuals, I've taken to referring to 'effective altruism' as if it's a single agent sometimes. This may seem strange, but we do it all the time. In the news, 'The White House' wants all sorts of things; this is to the point that sometimes not only are the decisions of the executive branch conflated with the opinions of the whole federal government, but the position of America as a whole. Of course, that's a problem on the other side that effective altruism doesn't need worry about right now (see what I did there?). Sometimes I'll also use 'the effective altruist community', similar to the 'scientific community'. For example, the effective altruist community has mixed feelings on the efficacy of yet untested charitable interventions. </p>\n</li>\n<li><p>Again, I was thinking along similar lines with the idea of our actions and suggestions being features of effective altruism as it exists in the present, not the source of what effective altruism means at its core. Even more than people identifying themselves with 'effective altruism', I'm worried that identifying effective altruism with distinct causes permanently may limit the potential of what effective altruism can become, and also dilute it to the point that it doesn't feel different than any other advocacy movement.</p>\n</li>\n</ul>\n", "parentCommentId": null, "user": {"username": "Evan_Gaensbauer"}}, {"_id": "Dzveb79awALDabm3u", "postedAt": "2014-10-17T11:59:19.929Z", "postId": "FpjQMYQmS3rWewZ83", "htmlBody": "<p>How pithy do thousands of us really need be? This is a serious question. I'm aware that the Centre of Effective Altruism is trying to manage the public image of effective altruism out of Oxford, so they care about terminology, what with the power of a few words can have, and such. However, is there a risk in how creative the rest of us in how we refer to ourselves, with another sensible phrase aside from 'effective altruist'? I don't know how much of how effective altruism is perceived by the outside public is generated what most of us do uncoordinated across social media, in public, for presentations, etc.</p>\n", "parentCommentId": "cf33dzhx3EteJ9Pt6", "user": {"username": "Evan_Gaensbauer"}}, {"_id": "h5Bps7Mmkddrx8tMg", "postedAt": "2014-10-17T12:09:21.175Z", "postId": "FpjQMYQmS3rWewZ83", "htmlBody": "<blockquote>\n<p> We should try to avoid calling ourselves “effective altruists”</p>\n</blockquote>\n<p>I just realized a big factor into why we have been calling ourselves &quot;effective altruists&quot; is because the public Facebook group, with thousands of members who all join the group openly, and voluntarily, is called &quot;Effective Altruists&quot;. The Facebook group is maybe the most public landing pad for individuals new to effective altruism. Additionally, the term 'effective altruist' seems likely to have been generalized to other public-facing events, such as the Effective Altruism Summit. How important is it that this change, considering we might need to muster great effort to do it.</p>\n", "parentCommentId": null, "user": {"username": "Evan_Gaensbauer"}}, {"_id": "xivABNRgh6KwNk2RZ", "postedAt": "2014-10-17T16:19:41.149Z", "postId": "FpjQMYQmS3rWewZ83", "htmlBody": "<p>I disagree with a bit of the intro and part one.</p>\n<p>You can easily say that Effective Altruism answers a question.  The question is, &quot;What should I do with my life?&quot; and the answer is, &quot;As much good as possible (or at least a decent step in that direction).&quot;  Only if you take that answer as a starting premise can you then say that EA asks the question, &quot;How do I do the most good?&quot;</p>\n<p>Conversely, you can just as easily say that feminism doesn't ask whether men and women should be equal (that they should be is the starting premise), it asks how society is structurally unequal and how we might re-make society so that it becomes equal.</p>\n<p>So I don't see EA as necessarily in some different category than the (other) ideologies that you list.</p>\n<p>In part one, I just... don't really see a big issue with -ism versus -ist, at least not one any near as large as you're claiming exists.  “Can I [x] and still be a member of the Effective Altruism movement?” seems about as natural a question to ask as “Can I [x] and still be an Effective Altruist?”  As long as there's an EA movement that's in any way demanding of its followers, it provokes the same sort of questions regardless of whether we call ourselves followers of Effective Altruism or Effective Altruists.  Insofar as there's a problem, I think it's the &quot;impudence&quot; that you mention of calling this movement Effective Altruism in the first place.</p>\n<p>(If someone comes up with a better term for EA followers, I'll be happy to adopt it -- I don't see it as a big issue.  In the meantime I'll occasionally call myself an &quot;EA&quot; if it makes sense to do so in context.)</p>\n<blockquote>\n<p>Alternative descriptors include “aspiring effective altruist”, “interested in Effective Altruism”, “member of the Effective Altruism movement”… What do you think of those options?</p>\n</blockquote>\n<p>&quot;Aspiring effective altruist&quot; doesn't describe me: I don't aspire to anything more than what I'm currently doing, which is donating a decent-sized fraction of my salary to charity.  I plateaued in my journey towards an idealised EA several years ago.</p>\n<p>&quot;Interested in Effective Altruism&quot; is far too weak.</p>\n<p>&quot;Member of the Effective Altruism movement&quot; is something I'd happy to call myself.</p>\n", "parentCommentId": null, "user": {"username": "pappubahry"}}, {"_id": "PqusgAr8oNSPNY2rk", "postedAt": "2014-10-17T22:32:20.289Z", "postId": "FpjQMYQmS3rWewZ83", "htmlBody": "<p>I see two claims in the post: 1) EA is asking a question not answering it and 2) the practical benefits of thinking of EA as asking a question outweigh the costs. I'm uncertain about the first claim and I disagree with the second.</p>\n<p>For the first claim, it seems to me that EA is answering a question. The question is &quot;what should I do with my life&quot; and the answer is &quot;do the most good with the resources available to me.&quot; This at least seems equally as reasonable as the interpretation you suggest. Perhaps there's some method of determining which interpretation is better, but I don't know what that method might be.</p>\n<p>For the second claim, I think there are very significant practical downside to thinking of EA as a question and avoiding calling ourselves &quot;effective altruists.&quot; It seems to me that, Paul Graham's arguments aside, people like creating identities. We build identities around all kinds of things and are motivated to act based on the identities we create. So, if increasing the number of people with the EA meme is beneficial (and I think it is) and if building an identity around it is useful for spreading the meme, then it seems like there are huge practical benefits to representing EA as an identity.   </p>\n", "parentCommentId": null, "user": {"username": "Kerry_Vaughan"}}, {"_id": "rRdoyXCMp2axeyvEX", "postedAt": "2014-10-17T23:27:12.449Z", "postId": "FpjQMYQmS3rWewZ83", "htmlBody": "<p>I thought the reason was that we were looking for a term to replace &quot;super-duper hardcore people&quot;, and settled on &quot;effective altruists&quot;. This predated the facebook group by a considerable time. Indeed, initially I thought the facebook group was a bad idea, as 'EA' was not intended to be public facing at all.</p>\n", "parentCommentId": "h5Bps7Mmkddrx8tMg", "user": {"username": "Larks"}}, {"_id": "prwKd9ZTprRiiEXZG", "postedAt": "2014-10-18T02:08:22.334Z", "postId": "FpjQMYQmS3rWewZ83", "htmlBody": "<blockquote>\n<p>&quot;Aspiring effective altruist&quot; doesn't describe me: I don't aspire to anything more than what I'm currently doing, which is donating a decent-sized fraction of my salary to charity. </p>\n</blockquote>\n<p>Do you aspire to find donation targets that are more effective?</p>\n", "parentCommentId": "xivABNRgh6KwNk2RZ", "user": {"username": "RyanCarey"}}, {"_id": "mFWAY7MeGmce6sACc", "postedAt": "2014-10-18T03:06:22.093Z", "postId": "FpjQMYQmS3rWewZ83", "htmlBody": "<p>Pretty passively.... Like I'll send some money GiveWell's way later this year to help find effective giving opportunities, but it doesn't feel inside of me as though I'm <em>aspiring</em> to something here.  The GiveWell staff might aspire to find those better giving opportunities; I merely help them a bit and hope that they succeed.</p>\n<p>I also think that describing ourselves primarily as having a never-ending aspiration is selling us short if we're actually achieving stuff.</p>\n", "parentCommentId": "prwKd9ZTprRiiEXZG", "user": {"username": "pappubahry"}}, {"_id": "ddkGmTQ2HyAG8JhBf", "postedAt": "2014-10-18T10:26:30.026Z", "postId": "FpjQMYQmS3rWewZ83", "htmlBody": "<p>Great comment, thanks Kerry. To your first point:</p>\n<blockquote>\n<p>...it seems to me that EA is answering a question. The question is &quot;what should I do with my life&quot; and the answer is &quot;do the most good with the resources available to me.&quot;</p>\n</blockquote>\n<p>I'm really glad you stated this clearly (and it's the same idea as in <a href=\"http://effective-altruism.com/ea/9s/effective_altruism_is_a_question_not_an_ideology/13x\">pappubahry's comment</a>). If this were the core idea of EA, then I agree that this whole post would be incorrect. </p>\n<p>Is it the core idea though? None of the introductions I linked to above mention anything about what one &quot;should&quot; do. Certainly there are several EA organisations that are linked to spreading the idea of EA &amp; motivating more people to donate, but that seems to me to be easily explained by:</p>\n<ol>\n<li><p>The ease with which resources can be turned into life-improvements (&quot;ease&quot; referring to convenience, speed, low information barriers) compared to just about any other time in human history.</p>\n</li>\n<li><p>The stable instrumental goal of trying to spread one's own values, to make it more likely they are fulfilled.</p>\n</li>\n</ol>\n<p>My impression is not that the organisations in question (which are made up of aspiring effective altruists, or people interested in Effective Altruism, or whatever) see some kind of terminal value in persuading others to dedicate their lives to helping others. Certainly I find the idea of this (persuade others to do good with their resources) being a core motivating philosophy of my life very off-putting. </p>\n<p>One of the things I love about EA (or perhaps just my interpretation of EA) is that it's driven by curiosity and compassion, not moralising.</p>\n<p>--</p>\n<p>For your second point:</p>\n<p>I think what you've said actually splits into two things:</p>\n<p>a) Should we promote having an EA identity, and\nb) Should people who have that identity call themselves &quot;effective altruists&quot;</p>\n<p>I think you're right about a), and about the huge benefits of community, signalling, self-signalling, commitment etc that come with making Effective Altruism part of one's identity.</p>\n<p>But I don't think it necessarily follows that the name &quot;effective altruists&quot; is the best way to refer to oneself, and one of the reasons I wrote this post was to point out the downsides of using that phrase. </p>\n<p>I particularly care about the first impressions of people who have the potential to have a large impact on the world - who I expect will generally be more analytical, better informed and more sceptical than the typical person. In my experience organising EA Melbourne, this kind of person is often really put off by a group of people who just get together every few weeks to talk about stuff, and who call themselves both effective and altruistic. They are also put off if people in that group claim (as lots do, initially) that maximising your earnings and donating to global health charities is the best way to improve the world. </p>\n<p>I think it's really important that our memes don't get stuck on one object-level strategy like that.</p>\n<p>(I do wish I could think of another identifier that's as pithy as &quot;effective altruist&quot; though.)</p>\n<p>What do you think?</p>\n", "parentCommentId": "PqusgAr8oNSPNY2rk", "user": {"username": "HelenToner"}}, {"_id": "qtq9gbJ4awEo6dYJm", "postedAt": "2014-10-18T10:29:42.137Z", "postId": "FpjQMYQmS3rWewZ83", "htmlBody": "<blockquote>\n<p>You can easily say that Effective Altruism answers a question. The question is, &quot;What should I do with my life?&quot; and the answer is, &quot;As much good as possible (or at least a decent step in that direction).&quot;</p>\n</blockquote>\n<p>I think this is the key part of our disagreement - I don't think this is the case - and I've answered more fully in <a href=\"http://effective-altruism.com/ea/9s/effective_altruism_is_a_question_not_an_ideology/142\">my comment in reply to Kerry</a>. Would love to hear your thoughts there.</p>\n", "parentCommentId": "xivABNRgh6KwNk2RZ", "user": {"username": "HelenToner"}}, {"_id": "LWhDjraqAdu2ipSM4", "postedAt": "2014-10-18T10:33:26.834Z", "postId": "FpjQMYQmS3rWewZ83", "htmlBody": "<p>I think it's fair to say that &quot;aspiring&quot; doesn't quite fit for you. The point of that word being there is to reduce the strength of the claim: you're focused on being effective, you're trying hard to be effective, but to say that you <em>are</em> effective is different. </p>\n<p>Maybe the slightly poor epistemology doesn't matter enough to make up for the much clearer name... I'm not sure.</p>\n", "parentCommentId": "mFWAY7MeGmce6sACc", "user": {"username": "HelenToner"}}, {"_id": "uoBFty2Rh2EGFtSsj", "postedAt": "2014-10-18T13:20:09.486Z", "postId": "FpjQMYQmS3rWewZ83", "htmlBody": "<p>Thanks for mentioning that you run EA Melbourne -- I think this difference in perspective is what's driving our -ism/-ist disagreement that I talk about in my earlier comment.  I've never been to an EA meetup group (I moved away from Brisbane earlier in February, missing out by about half a year on the new group that's just starting there...), and I'd wondered what EA &quot;looked like&quot; in these contexts.  If a lot of it is just meeting up every few weeks for a chat about EA-ish topics, then I agree that &quot;effective altruist&quot; is a dubious term if applied to everyone there.</p>\n<blockquote>\n<p>Is it the core idea though? None of the introductions I linked to above mention anything about what one &quot;should&quot; do.</p>\n</blockquote>\n<p>Perhaps a different phrasing would be a little better, but however it's worded, moral beliefs and/or moral reasoning motivated most of what I see in the EA movement today -- totally fundamental to everything, even if it's not always explicitly stated.  Certainly what keeps <em>me</em> sending out donations every month or so is the internal conviction that it's the right thing to do.</p>\n<p>Maybe this is another difference of perspective thing?  Like if many of the EA people you see are more passive consumers of EA material, instead of structuring their lives/finances around it, then the fundamental moral motivation of introductions to EA seems absent?  I don't know.</p>\n<blockquote>\n<p>Certainly I find the idea of this (persuade others to do good with their resources) being a core motivating philosophy of my life very off-putting.</p>\n</blockquote>\n<p>I see the core motivating philosophy of my life as trying to do good with <em>my</em> resources.  Some no doubt see persuading others as an important part of their resources (I mostly fail at it), but to me EA most fundamentally is about maximising one's own impact, in whichever ways one can.</p>\n", "parentCommentId": "ddkGmTQ2HyAG8JhBf", "user": {"username": "pappubahry"}}, {"_id": "MFJyCsr6HeAKChdej", "postedAt": "2014-10-18T13:36:38.419Z", "postId": "FpjQMYQmS3rWewZ83", "htmlBody": "<blockquote>\n<p>The point of that word being there is to reduce the strength of the claim: you're focused on being effective, you're trying hard to be effective, but to say that you <em>are</em> effective is different.</p>\n</blockquote>\n<p>I don't really want to reduce the strength of my claim though[1] -- if I have to be pedantic, I'll talk about being effective in probabilistic expectation-value terms.  If donating to our best guesses of the most cost-effective charities we can find today doesn't qualify as &quot;effective&quot;, then I don't think there's much use in the word, either to describe an -ism or an -ist.  It'd be more accurate to call it &quot;hopefully effective altruism&quot;, but I don't think it's much of a sacrifice to drop the &quot;hopefully&quot;.</p>\n<p>[1] At an emotional level, I have a bit of a <em>I've donated a quarter of my salary to the best charities I could find for the last five years, stop trying to take my noun phrase away</em> reaction as well.</p>\n", "parentCommentId": "LWhDjraqAdu2ipSM4", "user": {"username": "pappubahry"}}, {"_id": "qFQps5fhC4vJgZH9G", "postedAt": "2014-10-18T15:53:39.215Z", "postId": "FpjQMYQmS3rWewZ83", "htmlBody": "<p>I'm still not sure how to distinguish between EA as a question versus an answer. You mention that the &quot;should&quot; component of my question is not represented in the intros to EA. I suspect that this is a PR move, not a philosophical move. In any case, I can rewrite the question to avoid this. The question might be &quot;what's the best way to improve the world?&quot; Where EA provides some tentative answers (reduce X-risk, earn to give) and a general schema for answering the question (use the best available reasoning tools to analyze your options and then act on one of them).</p>\n<p>Based on the way people in this community behave, they seem to see EA as an answer not a question. Questions don't seem to generate identity and radical life change. Yet both of these sometimes occur in EA.</p>\n<hr />\n<p>In terms of the actual term &quot;effective altruist,&quot; I agree that there are downsides to the term. It can be elitist and condescending. But, I've never really seen a better term. My guess is that it's at least close to being the best available option.</p>\n<p>A separate question is how closely the EA meme should be related to sub-memes like earn to give or X-risk. I agree with your concern that we don't want to be defined by any particular object-level strategy, but I don't see that the name or identity of EA as currently construed is a problem. It seems to me to be a great strength of the EA meme that we have created a social movement where what people actually do is relatively diverse. My sense of other social movements is that this is not the case.</p>\n", "parentCommentId": "ddkGmTQ2HyAG8JhBf", "user": {"username": "Kerry_Vaughan"}}, {"_id": "hSn3jvG5WdwigBQMx", "postedAt": "2014-10-19T05:23:46.329Z", "postId": "FpjQMYQmS3rWewZ83", "htmlBody": "<p>Young people &quot;determined to make a difference&quot; I think captures the grit of those who intend to become EAs, but haven't necessarily already started. I think it sounds kinda catchy, myself. &quot;Ambitious to make their mark in the world&quot; is another one that I think makes EA seem aspirational and part of a leading a successful life, even if the grammar isn't perfect (try correcting the grammar and it sounds really lame!).</p>\n", "parentCommentId": "DQCtb4FETpz6xxDE4", "user": {"username": "Austen_Forrester"}}, {"_id": "okAea7KDe55FkZjS5", "postedAt": "2014-10-19T21:56:35.132Z", "postId": "FpjQMYQmS3rWewZ83", "htmlBody": "<p>&quot;Do-bester&quot; might have the inverse problem.</p>\n", "parentCommentId": "cf33dzhx3EteJ9Pt6", "user": {"username": "Ales_Flidr"}}, {"_id": "M3RfdTTaptyYr67Fg", "postedAt": "2014-10-20T05:29:38.938Z", "postId": "FpjQMYQmS3rWewZ83", "htmlBody": "<p>How about &quot;rational altruists?&quot;  This to me is actually a better descriptor of the head and the heart than effective altruist, as a person could be really effective (on a QALY basis) without using the head at all - Live Aid was essentially emotionally driven, and drove a huge groundswell of support for tackling extreme poverty.   The thing that sets effective altruism as currently named apart is the very high level of rational thinking that goes on in deciding what to do.  Whether that is more or less effective than other approaches is probably an unhelpful starting point when it comes to outreach, as it can indeed sound arrogant, and ignores the fact that most people are emotionally driven in deciding how to give.  </p>\n", "parentCommentId": "ddkGmTQ2HyAG8JhBf", "user": {"username": "DavidRooke"}}, {"_id": "CasMxBtdWscBphoEy", "postedAt": "2014-10-20T07:37:14.655Z", "postId": "FpjQMYQmS3rWewZ83", "htmlBody": "<p>The term 'effective altruism' was created before the FB group, but I think Evan is referring to the fact that the FB group uses the 'ist' form rather than the 'ism' form and is the most prominent thing to do so. I think it would have been an improvement if it had used the 'ism' form (and it is not a co-incidence that this forum does).</p>\n", "parentCommentId": "rRdoyXCMp2axeyvEX", "user": {"username": "Toby_Ord"}}, {"_id": "zJHEdLmWhmFHE9SXf", "postedAt": "2014-10-20T16:00:49.790Z", "postId": "FpjQMYQmS3rWewZ83", "htmlBody": "<p>Evan, your suggestion of usability testing makes sense to me. I just don't have enough energy or experience to undertake such work alone. Can you help in setting up a test activity/project?</p>\n", "parentCommentId": "4HWfHg3dtqnF6bCrH", "user": {"username": "Ilya"}}, {"_id": "ziHuiAzNS8bcAcvmw", "postedAt": "2014-10-21T00:18:11.517Z", "postId": "FpjQMYQmS3rWewZ83", "htmlBody": "<p>One possibility is &quot;good-seeker&quot;, although it may be insufficiently descriptive.</p>\n", "parentCommentId": "DQCtb4FETpz6xxDE4", "user": {"username": "MichaelDickens"}}, {"_id": "TypbCTB6XSCqKxivJ", "postedAt": "2014-10-21T05:38:10.583Z", "postId": "FpjQMYQmS3rWewZ83", "htmlBody": "<p>Yeah, okay. Send me a private message about it, and we can discuss what either of us have in mind.</p>\n", "parentCommentId": "zJHEdLmWhmFHE9SXf", "user": {"username": "Evan_Gaensbauer"}}, {"_id": "vewWPeE4or9BXNzoz", "postedAt": "2014-10-23T01:58:45.298Z", "postId": "FpjQMYQmS3rWewZ83", "htmlBody": "<p>I'm pretty confident Will used the 'ist' form in conversation with me. </p>\n", "parentCommentId": "CasMxBtdWscBphoEy", "user": {"username": "Larks"}}, {"_id": "vGdxdM4vx3w6y6wxR", "postedAt": "2014-10-24T20:37:49.006Z", "postId": "FpjQMYQmS3rWewZ83", "htmlBody": "<p>I sent 2 days ago a private message to your mail box at this forum. Did you receive it?</p>\n", "parentCommentId": "TypbCTB6XSCqKxivJ", "user": {"username": "Ilya"}}, {"_id": "rTkZ3mENozjAXZdNv", "postedAt": "2014-10-25T05:13:02.989Z", "postId": "FpjQMYQmS3rWewZ83", "htmlBody": "<p>Yeah, I did. I'll send you a message to your private email address you shared with me. Sorry I didn't respond in a timely fashion. I've been swamped the last few days.</p>\n", "parentCommentId": "vGdxdM4vx3w6y6wxR", "user": {"username": "Evan_Gaensbauer"}}, {"_id": "5NBFKuvg6KH26zemW", "postedAt": "2014-11-12T17:08:21.962Z", "postId": "FpjQMYQmS3rWewZ83", "htmlBody": "<p>I agree that EA shouldn't be defined by any particular conclusions about how to do the most good. But in addition to the question, there is also a methodology that goes along with it:</p>\n<ul>\n<li>Impartiality or cosmopolitanism - that is to say, that everyone is (close to) equally important, and non-humans deserve some weight as well</li>\n<li>A willingness to consider and compare all options in a open-minded way</li>\n<li>Epistemic humility - we shouldn't assume our conclusions are better than others, and so it is important to...</li>\n<li>Use evidence and reason in an attempt to be persuasive to others.</li>\n</ul>\n<p>Then we should also be willing to act on the above rather than ignore it. These certainly aren't new ideas, but rather the application of approaches from the enlightenment, natural sciences and social science (at least when done well) to altruistic endeavours.</p>\n<p>I agree that 'effective altruist' is an awkward term that is unintentionally self-aggrandising, but I use it for lack of a better alternative. 'Aspiring effective altruists', or 'members of the effective altruist community', might be better.</p>\n", "parentCommentId": null, "user": {"username": "Robert_Wiblin"}}, {"_id": "6fHYc6FFMx6ZpDTHt", "postedAt": "2014-12-18T04:19:20.376Z", "postId": "FpjQMYQmS3rWewZ83", "htmlBody": "<p>Regarding concerns about the name &quot;effective altruist&quot;: I think it's good that the term &quot;EA&quot; is coming into coming use, at least in this community.  Someday it may be so ingrained that thinking about the etymology will require conscious effort. As Steven Pinker points out, this is a common process in language. &quot;Breakfast&quot; means to &quot;break fast&quot;, but most people don't think about this consciously.  </p>\n", "parentCommentId": null, "user": {"username": "Lila"}}, {"_id": "FztfD2ZLos2TPPn52", "postedAt": "2015-01-05T20:41:06.395Z", "postId": "FpjQMYQmS3rWewZ83", "htmlBody": "<p>How about &quot;pragmatic altruist&quot;? It conveys the idea we want to do good but we approach it rationally rather than emotionally. Also it conveys the idea we want people to do things that are reasonable (like donating 10% of their income) rather than things that most people wouldn't consider to be reasonable (like donating everything except a minimal subsistence wage).</p>\n", "parentCommentId": "DQCtb4FETpz6xxDE4", "user": {"username": "Squark"}}, {"_id": "9mwFgnuqSYreXbo5N", "postedAt": "2015-01-14T09:18:36.240Z", "postId": "FpjQMYQmS3rWewZ83", "htmlBody": "<p>EBA? (Evidence based altruistim - no identifier as it's aspirational as mentioned)Like EBM..while this.particular suggestion may be poor, I'd like to try and see if there's a word that puts humility at the heart of it. I think it will be appealing and accurate- rationality, evidence and caring about other people as much as yourself all have roots in humility? \nI find EA difficult, as it defines others as either stupid or selfish and sounds exclusive and.elitist to non academic types, and think under promising with overdelivery has many benefits. It draws a parallel with evidence based movements, which seek to overturn people's God complex and over riding belief in ad hoc.guesswork, shower inspiration, social proofing, and emotional intuition, as well as the motivational vices that lead there?</p>\n", "parentCommentId": "DQCtb4FETpz6xxDE4", "user": {"username": "tomstocker"}}, {"_id": "8HouYeZXAL8Wf2ofm", "postedAt": "2015-01-14T17:24:02.556Z", "postId": "FpjQMYQmS3rWewZ83", "htmlBody": "<p>Yeah, I feel better about identifying as 'evidence-based' than 'effective' actually.</p>\n", "parentCommentId": "9mwFgnuqSYreXbo5N", "user": {"username": "RyanCarey"}}, {"_id": "sDLga9ynZ9fhyBNDL", "postedAt": "2015-01-14T17:38:54.951Z", "postId": "FpjQMYQmS3rWewZ83", "htmlBody": "<p>Everyone wants to be 'evidence based' - no one wants to be 'prior probability informed'. #foreveralone</p>\n", "parentCommentId": "8HouYeZXAL8Wf2ofm", "user": {"username": "Robert_Wiblin"}}, {"_id": "fb2ng2m6kTPRWuBdM", "postedAt": "2015-01-14T17:41:37.291Z", "postId": "FpjQMYQmS3rWewZ83", "htmlBody": "<p>The only bit of your beliefs that you're able to share is the evidence, not the prior belief. So I think it works.</p>\n", "parentCommentId": "sDLga9ynZ9fhyBNDL", "user": {"username": "RyanCarey"}}, {"_id": "Cr6eeZsbFemezzcTW", "postedAt": "2015-01-14T18:03:20.765Z", "postId": "FpjQMYQmS3rWewZ83", "htmlBody": "<p>Prior Probability Informed Altruism isn't exactly catchy either.</p>\n", "parentCommentId": "fb2ng2m6kTPRWuBdM", "user": {"username": "Robert_Wiblin"}}, {"_id": "tWuiJ6S4W4Wwp6iz7", "postedAt": "2015-01-15T10:51:34.826Z", "postId": "FpjQMYQmS3rWewZ83", "htmlBody": "<p>Pragmatic altruist suggests someone who tempers their altruism.</p>\n", "parentCommentId": "FztfD2ZLos2TPPn52", "user": {"username": "Tom_Ash"}}, {"_id": "8jaqGpNwT58Rw5HFh", "postedAt": "2015-04-21T00:25:24.032Z", "postId": "FpjQMYQmS3rWewZ83", "htmlBody": "<p>Does anyone like &quot;skeptical altruist&quot;?</p>\n", "parentCommentId": null, "user": {"username": "TimothyTelleenLawton"}}, {"_id": "3LmiPdeiDpQcxqd7d", "postedAt": "2015-04-21T14:04:39.921Z", "postId": "FpjQMYQmS3rWewZ83", "htmlBody": "<p>I do!</p>\n", "parentCommentId": "8jaqGpNwT58Rw5HFh", "user": {"username": "XioKikauka"}}, {"_id": "ATLuDcxBH2GwjxatB", "postedAt": "2015-04-21T14:06:00.634Z", "postId": "FpjQMYQmS3rWewZ83", "htmlBody": "<p>And me - we've put a lot of work into marketing effective charity to sceptics at Charity Science, having identified them as a promising audience (based partly on their donating in response to our marketing).</p>\n", "parentCommentId": "3LmiPdeiDpQcxqd7d", "user": {"username": "Tom_Ash"}}, {"_id": "w2gwg84e36LeY6dRz", "postedAt": "2015-04-28T23:20:43.386Z", "postId": "FpjQMYQmS3rWewZ83", "htmlBody": "<p>This is a great comment. If I were to rewrite this post now, I would make sure to include these. </p>\n<p>Also, going back to a conversation with you: if I were to rewrite, I would also try to make it clearer that I'm not trying to give a formal definition of Effective Altruism (which is what it sounds like in the post), just trying to change the feeling or connotations around it, and how we think about it.</p>\n", "parentCommentId": "5NBFKuvg6KH26zemW", "user": {"username": "HelenToner"}}, {"_id": "mHi9uJ7mqAp4cnSnu", "postedAt": "2015-10-04T02:00:07.326Z", "postId": "FpjQMYQmS3rWewZ83", "htmlBody": "<p>I think the AE should be considered a philosophy, whose supporters disseminate and put into practice, individually, when, how and if they want to. I also think that it started not long ago and that 'speaks' more to the mind than to the heart, becoming, therefore, unattractive. Somehow, the AE, with an elitist trend, just selecting who should participate in it, which unfortunately excludes the largest share of the world population, as 'lady' of much practice charity in their own way and without rational appeal any, still sees undervalued given the demands it places Singer. I have found the Effective Altruism, page also visit, very fertile in ideas but sterile on projects or specific actions. What might be great to be discussed, including the mentor, it is that it should be promoted and developed differently from country to country according to local needs.</p>\n", "parentCommentId": null, "user": {"username": "MARIALUCIADARIO"}}, {"_id": "CN8YJzDSEPtHsGXhq", "postedAt": "2016-10-16T01:02:32.841Z", "postId": "FpjQMYQmS3rWewZ83", "htmlBody": "<p>I am quite puzzled by the first paragraph of this post, because even after reading the rest of it, I still find them perfectly meaningful. It appears to me that the post not only fails to defend the idea that the three questions don't make sense, but it actually answers them, just as follows:</p>\n<p>&quot;What is the definition of Effective Altruism?&quot;: The action or habit of asking oneself the question of how to do the most good with the available resources, using a particular methodology (as per the author's comment on Robert_Wilbin's reply below).\n&quot;What claims does it make?&quot; :  None, as per the definition above.\n&quot;What do you have to believe or do, to be an Effective Altruist?&quot;: Asking yourself the question above and trying to answer it using the given methodology. I have my doubts on the answer to the first question. The term EA often seems to be denoting a social movement or a philosophy, rather than a habit.</p>\n<p>But more importantly, when the author and some other people in the comments talk about the &quot;definition&quot; of EA, they appear to refer to something akin to a definition in a mathematical theory: a succint but correct and complete statement describing EA that can later be used to draw conclusions in arguments about EA. However (if you have read mathematics textbooks, you may be familiar with this) such definitions are often insufficient in order to get a clear and complete idea of what something is.</p>\n<p>In other words, if somebody asks in good faith what EA is, a much more illuminating reply would not only frame EA as a social movement, rather than a personal habit, but it would note that the general tendency in this movement is to understand the idea of 'a better world' in line with some brand of consequentialism, and it would also describe the kind of &quot;actions&quot; that are typically considered by EAs, such as donating to charities, choosing a career, etc. This can still be done succintly, and yet a much more accurate picture of EA is transmitted. </p>\n<p>My point is: it can be misleading to think of EA as being asking a question; instead, one has a more accurate picture if they think of it as a movement, based on a key question and methodology, but also with its correspoding history and particularities. The post, however, does a good job in reminding any aspiring effective altruist that there is a possibility that particular conclusions about how to do the most good which have been determined by the EA community could, in principle, be wrong, and that the only certain invariant of EA is the question (and methodology) of how to do the most good with the available resources.</p>\n", "parentCommentId": null, "user": {"username": "LeahBlake"}}, {"_id": "Bym6sJcXntN6BCoew", "postedAt": "2020-10-11T20:37:21.989Z", "postId": "FpjQMYQmS3rWewZ83", "htmlBody": "<p>But I am an Effective Altruist, Helen -- <strong>&#x1F613;</strong> By definition, as a member of the Effective Altruism community, no matter what I do or what I ask. Of course, engaging with the movement, I am more likely to expand my moral circles, gain knowledge and motivation to do great, et cetera, just like the other Effective Altruists. Held accountable by the institution itself, I enter, remain, or exit freely.</p>", "parentCommentId": null, "user": {"username": "brb243"}}, {"_id": "3D9X7rxWGA7utwrgX", "postedAt": "2021-12-03T08:32:57.233Z", "postId": "FpjQMYQmS3rWewZ83", "htmlBody": "<p>This article affected me a lot when I first read it (in 2015 or so), and is/was a nontrivial part of what I considered \"effective altruism\" to mean. Skimming it again, I think it might be a little oversimplified, and has a bit of a rhetorical move that I don't love of conflating \"what the world is like' vs \"what I want the world to be like.\"<br><br>Still, I think this article was strong at the time, and I think it is still strong now.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Linch"}}, {"_id": "3MDhidPEimaCKbuyu", "postedAt": "2021-12-03T10:28:06.254Z", "postId": "FpjQMYQmS3rWewZ83", "htmlBody": "<p>Seconded. This describes it's effect on me as well.</p>", "parentCommentId": "3D9X7rxWGA7utwrgX", "user": {"username": "jpaddison"}}, {"_id": "y5J97hahKTJiy4BHE", "postedAt": "2021-12-24T01:15:06.040Z", "postId": "FpjQMYQmS3rWewZ83", "htmlBody": "<p>Can you elaborate on where or how it conflates the 'is' and the 'ought'?</p>\n", "parentCommentId": "3D9X7rxWGA7utwrgX", "user": {"username": "david_reinstein"}}, {"_id": "jEKgxCaK46AW4FTeu", "postedAt": "2022-01-11T05:35:28.598Z", "postId": "FpjQMYQmS3rWewZ83", "htmlBody": "<p><strong>Key points</strong></p><ul><li>We (the effective altruism community) probably want a community centred around values/principles/axioms rather than conclusions.</li><li>This post is a great starting point to value-centric discussions instead of conclusion-centric.<ul><li>It communicates that asking the question honestly and then acting on its answer is more important than the specific current conclusions</li><li>It is very accessible so newcomers can easily understand it (having this be articulated for people new to effective altruism helps make this a central part of the effective altruism movement in the future because some newcomers will make up our future community)<br>&nbsp;</li></ul></li></ul><p><strong>Elaboration on key points&nbsp;</strong><br><br>I think this post nudges the culture of the effective altruism movement in a really good direction. I don’t think it necessarily accurately describes what the effective altruism movement is, but more of what it aspires to be. Having this compass on where we want to be helps us nudge the movement towards that.<br><br><i>Why do we want to emphasise values/principles/axioms over conclusions?</i></p><p>The answer to the question “how do we do as much good as possible with our limited resources” (referred to as the EA question for the rest of this review) is an uncertain one: we never have complete information. The answer to the EA question is also a dynamic one: our judgement of the best answer, even if we did have all the information, is likely to be constantly changing with time, as our world changes.&nbsp;</p><p>Reasonable conclusions tend to be context-dependent and should change rapidly as we learn new information and our world changes. &nbsp;Principles/values/axioms can and should remain much more stable over time (though they likely should gain nuance with time too, hopefully, as we've thought more).&nbsp;<br><br><i>How this post (and posts like it) help</i></p><p>We can’t help but be at least a little bit defined by our current conclusions, but posts like this remind us that we aspire to be about the question, not any specific current answer.&nbsp;</p><p>This post's usefulness for communicating to newcomers what effective altruism is aspiring to be about is helped by it being an exceptionally accessible piece of writing. Someone new to effective altruism can read it without reading much other material and still understand it. This makes it particularly useful because it helps newcomers see effective altruism more like how we want effective altruism to be. This helps us bring in more people interested in effective altruism’s question more than effective altruism’s current conclusions. It also helps new people see effective altruism as more about its question than its current conclusions.<br><br>This post certainly helped me to feel like I belonged in the effective altruism community soon after I first came across the movement, while I was still forming my best guesses on the answer to the question \"how do I do the most good?\". It helped me feel like I belonged in the community while my guesses were often very different from those I knew in the community.&nbsp;Why? It brought the emphasis back to values that I completely was on board rather than conclusions I wasn't fully convinced by or didn't fully understand. For me, posts like this one did not act in a vacuum. Reading this was probably only convincing because I &nbsp;also had great conversations with people in the community that emphasised these points.&nbsp;</p><p>&nbsp;If we can make people who are curious about the question “how do we do as much good with our lives” feel more welcome in our community, then we'll attract more curious, more independent thinkers. In the long run, this will probably create a healthier effective altruism movement (even if there are some costs from a loss in cohesiveness from not all having the same conclusions). &nbsp;<br><br>Material like this, along with people in the community demonstrating these ideas in real-time in conversations and their actions, can go a long way to create a movement united by principles instead of one united by (hopefully) transient conclusions.&nbsp;</p><p><strong>Some follow-up thoughts</strong></p><p>&nbsp;Should we be united around ideas like “AI safety is one of the most important issues of our time” or ideas like “all people (and perhaps more than just people) are worthy of moral consideration”? I suspect we want to have a stronger identity around ideas like the latter than the former.&nbsp;</p><p>Given the answer to the EA question is uncertain and dynamically changing, I suspect that we want to be more united by fundamental principles (values/ axioms) like “all people (or all sentient beings) are worthy of moral consideration” rather than conclusions like “AI safety is one of the most important issues of our time”.*</p><p>Diversity in conclusions is desirable, as long as we all have clear common ground (that is narrow enough that having a community is still useful). What should that clear and sufficiently narrow common ground be? This is a challenging question, but my guess is that we want to find more principle/value-centric common ground. &nbsp;Posts like this help us map that out right from our first introduction and can help remind us of what we want effective altruism to be many years later.&nbsp;<br><br>Note: lots has been written more recently that is related, but because I am short on time and reviews need to be posted by tomorrow, I am posting this review now (but I might come back and add some links I think are particularly relevant).</p><p>*This is a fuzzy distinction, “future lives are worthy of moral consideration” might reasonably be classed as a conclusion or a principle. However, I still think it is a meaningful one, despite the existence of edge cases.<br>&nbsp;</p>", "parentCommentId": null, "user": {"username": "Sophia"}}]