[{"_id": "CBgg9zpsohrm9qT2n", "postedAt": "2024-01-08T09:25:46.528Z", "postId": "FrH3gdFHxbuDgzftR", "htmlBody": "<p>Nice post! An eudaemonic focus pairs nicely with a capabilities approach to human welfare - where we might conceive of global health and development as enabling individuals' substantive freedom to lead the lives they wish to. Ryan Briggs gives a great intro <a href=\"https://forum.effectivealtruism.org/posts/zy6jGPeFKHaoxKEfT/the-capability-approach-to-human-welfare\">here</a>.</p>", "parentCommentId": null, "user": {"username": "BenStewart"}}, {"_id": "QW9faunxB8wmSxfdJ", "postedAt": "2024-01-08T14:31:23.731Z", "postId": "FrH3gdFHxbuDgzftR", "htmlBody": "<p><strong>Executive summary</strong>: The post proposes modifications to utilitarianism to make it more intuitive and robust in practice, specifically by using eudaimonia (human flourishing) as the utility to maximize and Kantian priors as default rules that can be overridden given sufficient evidence.</p><p><strong>Key points</strong>:</p><ol><li>Eudaimonia, meaning objective well-being or human flourishing, is proposed as the utility to maximize rather than just happiness. This avoids problematic scenarios like experience machines.</li><li>Kantian priors, or principled default positions, are suggested to provide a framework for decision making amidst uncertainty. These can be overridden given enough evidence.</li><li>The modifications integrate insights from virtue ethics and deontology to make utilitarianism more consistent and trustworthy in practice.</li><li>Examples are given for how eudaimonic utilitarianism and Kantian priors give different and arguably more intuitive conclusions in situations like secret adultery or lying.</li><li>The ideas are meant as practical ways to pursue ethics given the complexities of the real world and avoid pitfalls like those affecting Sam Bankman-Fried.</li></ol><p>&nbsp;</p><p>&nbsp;</p><p><i>This comment was auto-generated by the EA Forum Team. Feel free to point out issues with this summary by replying to the comment, and</i><a href=\"https://forum.effectivealtruism.org/contact\"><i>&nbsp;<u>contact us</u></i></a><i> if you have feedback.</i></p>", "parentCommentId": null, "user": {"username": "SummaryBot"}}]