[{"_id": "bkT9yBxXbsjpsPWJh", "postedAt": "2015-02-03T05:03:36.482Z", "postId": "FrSaKohTYqkA4KZYs", "htmlBody": "<p>Here are some examples of interesting things the Bill and Melinda Gates Foundation has looked into:</p>\n<p>(1) Inexpensive <a href=\"http://en.wikipedia.org/wiki/Mosquito_laser\">lasers</a> which only target the mosquitoes that can carry malaria</p>\n<p>(2) Producing inexpensive meat substitutes that actually taste like <a href=\"https://www.youtube.com/watch?v=P_NVy4PJwYE\">meat</a></p>\n<p>(3) <a href=\"http://theincidentaleconomist.com/wordpress/bill-and-melinda-gates-want-to-make-a-difference-and-theyre-going-about-it-right/\">Malaria vaccines and education</a> about children’s health</p>\n", "parentCommentId": null, "user": {"username": "Gentzel"}}, {"_id": "PQ4YyHSPFTo9RY2cB", "postedAt": "2015-02-03T05:12:26.336Z", "postId": "FrSaKohTYqkA4KZYs", "htmlBody": "<p>Earlier from Peter Hurford:</p>\n<p>“I think I recall GiveWell agreeing that some of the Gates Foundation work is higher impact than GiveWell top charities, but it's already exceeded room for more funding (because of the Gates Foundation). Some of the vitamin fortification stuff seems like good examples, though GiveWell has recently recognized some vitamin fortification charities as standout charities.”</p>\n", "parentCommentId": null, "user": {"username": "Gentzel"}}, {"_id": "6fmiQsvBvdsSJnaCd", "postedAt": "2015-02-03T06:42:43.702Z", "postId": "FrSaKohTYqkA4KZYs", "htmlBody": "<p>You raise an interesting point. If I have a quarter, what's the best I could buy with it? A chewing gum, perhaps. Certainly not a car. But if I successfully encouraged millions of others to do as I did (and buy chewing gum), I possibly could have convinced them to cooperate into buying a car instead.</p>\n<p>If the EA movement had not hundreds or thousands of members, but millions or billions, would giving 10 percent of their income still be the best that they could do? Lets say that the EA movement grows enormously, and a decade from now comprises more than half the electorate of the US. Would the EA organisations recommend them to all vote for a specific candidate?</p>\n", "parentCommentId": null, "user": {"username": "GabrielEhrnstGrundin"}}, {"_id": "nhWHZ7kYxrb9DgCP5", "postedAt": "2015-02-03T10:22:35.140Z", "postId": "FrSaKohTYqkA4KZYs", "htmlBody": "<p>I think there's a real question here and it is plausible that large donors do better.</p>\n<p>I will point out that if it's correct that there are better returns from scale the conclusion probably isn't that small donors are best giving to charities like the GiveWell recommendations while large donors can do better. Instead small donors would be best getting to a position where their money acts like that of large donors.</p>\n<p>Here are three possible mechanisms for that:\n(i) Give money to large donors, such as the Gates foundation;\n(ii) Coordinate with others, pooling money so that many small donors act as a single large donor;\n(iii) Gamble, exchanging certainty of a small donation for a small probability of a large donation.</p>\n", "parentCommentId": null, "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "9PhRNvrFPYqEAerq2", "postedAt": "2015-02-03T14:07:13.513Z", "postId": "FrSaKohTYqkA4KZYs", "htmlBody": "<blockquote>\n<p>some of the Gates Foundation work is higher impact than GiveWell top charities</p>\n</blockquote>\n<p>Hasn't GiveWell also said that large orgs tend to do so many different things that some end up being effective and others not? Does this criticism apply to the Gates Foundation?</p>\n", "parentCommentId": "PQ4YyHSPFTo9RY2cB", "user": {"username": "Giles"}}, {"_id": "bifzf5AvEa2hFutY5", "postedAt": "2015-02-03T15:04:06.557Z", "postId": "FrSaKohTYqkA4KZYs", "htmlBody": "<p>Yeah if there are increasing returns to scale we can just head to the Blackjack table and have some excitement with our do-gooding!</p>\n", "parentCommentId": "nhWHZ7kYxrb9DgCP5", "user": {"username": "Robert_Wiblin"}}, {"_id": "bQYfcscnso8QMu7jt", "postedAt": "2015-02-04T01:23:04.354Z", "postId": "FrSaKohTYqkA4KZYs", "htmlBody": "<p>I think there is a danger in overlooking the small scale which sometimes cannot be readily duplicated or enlarged. A family friend, with lots of help from my mom, started an orphanage and school in Zambia. Projects like that are highly dependent on the individuals involved, their priorities, and their honesty. There is not another Kathi in the world and I would expect nearly everyone else to be less effective at trying to accomplish what she has done. Now, if you just want to count bodies, her project is not the most effective at saving lives per dollar. However, just as in nature, one must consider quality as well as quantity. Three of her orphaned formerly street children were in the top five on the national test for admission to high school the first year any of her kids took it. Her goal is to get as many through university as possible, but she also teaches farming and sewing and other skills. She could save more lives, but she wants to give Zambia the educated population it needs to thrive on its own. </p>\n", "parentCommentId": null, "user": null}, {"_id": "cuGvNQ8QNPNrRJMPK", "postedAt": "2015-02-04T03:17:49.741Z", "postId": "FrSaKohTYqkA4KZYs", "htmlBody": "<p>I suspect that such a criticism does apply. I remember a friend criticizing the way the Bill and Melinda Gates Foundation funded charter schools and scholarships as ineffective. You can see some of the grants they have awarded <a href=\"http://www.gatesfoundation.org/How-We-Work/Quick-Links/Grants-Database\">here</a>.</p>\n", "parentCommentId": "9PhRNvrFPYqEAerq2", "user": {"username": "Gentzel"}}, {"_id": "G4nkrqAeZKEHFBLi6", "postedAt": "2015-02-04T03:27:56.979Z", "postId": "FrSaKohTYqkA4KZYs", "htmlBody": "<p>If that scale was achieved, I think we would be able to make a political party. When you have a large amount of people trying to be effective, the actions that we consider effective now may be the type that are replaceable in such an environment.</p>\n", "parentCommentId": "6fmiQsvBvdsSJnaCd", "user": {"username": "Gentzel"}}, {"_id": "XHhFJgR79MjMDxfgy", "postedAt": "2015-02-04T03:42:26.040Z", "postId": "FrSaKohTYqkA4KZYs", "htmlBody": "<p>A friend made the argument to me yesterday that large organizations have high costs to finding such investments, since people may try to scam them or just compete for their funding by exaggerating. As an individual, who already has knowledge of these small scale circumstances, you can spend time and money on such small projects without facing similar risks. This might be a comparative advantage for small donors who are good at evaluating persons working on such projects.</p>\n<p>I agree that quality matters, but it does help accountability for progress to be measurable. Do you know if there are any proposed improvements to measurements like <a href=\"http://en.wikipedia.org/wiki/Quality-adjusted_life_year\">QALYs</a>? If the EA movement proposed a new such measurement, backed by good data, it might be a very valuable contribution. Depression is now causing a very high <a href=\"http://www.medscape.com/viewarticle/813896\">DALY</a> burden, so it seems plausible that the most effective interventions may be in reducing depression, rather than saving lives. </p>\n", "parentCommentId": "bQYfcscnso8QMu7jt", "user": {"username": "Gentzel"}}, {"_id": "eDo9dGdTMjBbkKDG3", "postedAt": "2015-02-04T06:30:03.107Z", "postId": "FrSaKohTYqkA4KZYs", "htmlBody": "<p>I'm especially interested in coordinating with others, something like a crowdfunding site with prescreened projects would be great.</p>\n<p>Otherwise, gambling's cool too :)</p>\n", "parentCommentId": "nhWHZ7kYxrb9DgCP5", "user": {"username": "Phil_Thomas"}}, {"_id": "JzQ6XpA2AcvP74bzL", "postedAt": "2015-02-04T07:19:16.000Z", "postId": "FrSaKohTYqkA4KZYs", "htmlBody": "<p>I think GiveWell was initially much more critical of the Gates Foundation than they are today.  Perhaps this is because during the OPP they found that what Gates does is (1) <a href=\"http://blog.givewell.org/2011/06/11/why-we-should-expect-good-giving-to-be-hard/\">very difficult</a> and that (2) Gates (or other foundations/govs) had <a href=\"http://blog.givewell.org/2013/03/21/trying-and-failing-to-find-more-funding-gaps-for-delivering-proven-cost-effective-interventions/\">already funded</a> many of the most promising opportunities.  </p>\n<p>It's probably best to evaluate the GF like a venture capitalist rather than on a project by project basis.  </p>\n", "parentCommentId": "9PhRNvrFPYqEAerq2", "user": {"username": "Phil_Thomas"}}, {"_id": "ep3neu2Yg5PkS7APB", "postedAt": "2015-02-04T20:54:21.181Z", "postId": "FrSaKohTYqkA4KZYs", "htmlBody": "<p>Yes. But its about how easy something is to treat also?</p>\n<p>Small minnows definitely have some advantages (small is beautiful has a lot of arguments in this direction)</p>\n<p>The issues is that we haven't found little charities that are making a difference as well / cheaply as SCI/AMF.</p>\n<p>I think that actually, scale is very important unless you're doing knowledge based stuff. Economies of scale exist, and are often more important than the kinds of advantages small players have?</p>\n", "parentCommentId": "XHhFJgR79MjMDxfgy", "user": {"username": "tomstocker"}}, {"_id": "J6JwDrKLtMkR9ZAfR", "postedAt": "2015-02-04T20:57:02.847Z", "postId": "FrSaKohTYqkA4KZYs", "htmlBody": "<p>How much of the large donor effect is due to leadership and catalysing teams to solve problems etc. by brand/authority/charisma/reasoning etc. rather than necessarily the funding behind it? I think we're already doing quite a lot of this, but there's probably room to stimulate more front line promising initiatives?</p>\n", "parentCommentId": "nhWHZ7kYxrb9DgCP5", "user": {"username": "tomstocker"}}, {"_id": "hQF2gmPZmcHAxyBw5", "postedAt": "2015-02-05T22:16:30.625Z", "postId": "FrSaKohTYqkA4KZYs", "htmlBody": "<p>One point to consider is that if there really are large gains from scale, small donors can make risky bets to buy a chance of getting large, e.g. if large donors can get triple cost-effectiveness, then it would make sense to go to Las Vegas, and then if you win buy out-of-the-money options, to convert a small amount of money into a chance at a large amount. I have <a href=\"http://reflectivedisequilibrium.blogspot.com/2014/01/if-big-donors-have-much-better.html\">blog post</a> discussing this.</p>\n<p>In the same vein, you can give to big donors, or coordinate with them to let them allocate your donations.</p>\n", "parentCommentId": null, "user": {"username": "CarlShulman"}}]