[{"_id": "S2ygZSoSbLtDqHmQH", "postedAt": "2023-11-09T12:33:56.960Z", "postId": "FST9XBYgbbjyN79DF", "htmlBody": "<p><strong>Executive summary</strong>: Animal Charity Evaluators announces six Recommended Charities to donate to in order to reduce animal suffering most effectively.</p><p><strong>Key points</strong>:</p><ol><li>ACE evaluated 14 animal advocacy organizations and selected 6 as Recommended Charities.</li><li>Faunalytics, The Humane League, and Wild Animal Initiative retained Recommended status.</li><li>Legal Impact for Chickens, New Roots Institute, and Shrimp Welfare Project are newly recommended.</li><li>Good Food Institute, Fish Welfare Initiative, Dansk Vegetarisk Forening, Çiftlik Hayvanlarını Koruma Derneği and Sinergia Animal retained 2022 status.</li><li>Recommended Charities are exceptionally impactful giving opportunities to help animals.</li><li>ACE provides comprehensive reviews to help donors make informed decisions.</li></ol><p>&nbsp;</p><p><i>This comment was auto-generated by the EA Forum Team. Feel free to point out issues with this summary by replying to the comment, and</i><a href=\"https://forum.effectivealtruism.org/contact\"><i>&nbsp;<u>contact us</u></i></a><i> if you have feedback.</i></p>", "parentCommentId": null, "user": {"username": "SummaryBot"}}, {"_id": "FbEYcXqznGK44DrBc", "postedAt": "2023-11-15T13:37:37.312Z", "postId": "FST9XBYgbbjyN79DF", "htmlBody": "<p>Thanks so much for these recommendations! They’re really helpful, and I’m likely to donate to one of the recommended organizations this giving season.</p>\n<p>I do have a question: which of the recommended organizations have close ties to EA? I realize that “close ties” is a vibe-y concept, but things like “incubated by CE,” “director has been involved in EA since 2015,” or “received most of their funding from EA funders prior to being recommended by ACE” would count. (I’d be eager to hear others’ input on how I’m cashing “close ties” out.)</p>\n<p>The reason I ask is not because being closely tied to EA is a bad thing; clearly, if someone is an EA, and starts an impactful charity based on ITN reasoning etc etc this is not an argument against funding them. That said, I do think EA is rife with conflicts of interest, and that (1) this does presumably have an effect on who receives grants/support/endorsements, so I’d likely subject these organizations to closer scrutiny before donating and (2) in general, I think we should strive to be as transparent as possible about this stuff.</p>\n", "parentCommentId": null, "user": {"username": "hobbes"}}, {"_id": "wMWH8vbmyk9bFgosm", "postedAt": "2023-11-17T11:00:01.281Z", "postId": "FST9XBYgbbjyN79DF", "htmlBody": "<p>Thanks for the update!</p><p>I would be curious to know whether ACE plans to move to a recommendation system closer to <a href=\"https://www.givewell.org/\">GiveWell</a>'s where there is a cost-effectiveness bar to be met. In GiveWell's case, 10 times the cost-effectiveness of direct cash transfers. In ACE's case, the bar (e.g. in QALY/$ calculated using Rethink's median welfare <a href=\"https://forum.effectivealtruism.org/s/y5n47MfgrKvTLE3pw/p/Qk3hd6PrFManj8K6o\">ranges</a>) could be informed by the marginal cost-effectiveness of corporate campaigns for chicken welfare. I have the impression these are among the interventions with best track record and receiving more investment in the animal welfare space.</p>", "parentCommentId": null, "user": {"username": "vascoamaralgrilo"}}, {"_id": "gB6dkYanebhCvoscT", "postedAt": "2023-11-30T16:01:55.753Z", "postId": "FST9XBYgbbjyN79DF", "htmlBody": "<p>Thank you for your thoughtful question and interest in our evaluation approach. At ACE, we recognize the unique challenges present in our domain, where there is often less data and consensus on effective interventions compared to GiveWell's focus on global health and poverty. We also evaluate charities using a diverse range of 26 types of interventions, some with complex, long-term Theories of Change that are challenging to quantify.</p><p>For these reasons, we currently don't apply a specific cost-effectiveness bar across all charities, but we are consistently reevaluating this decision and exploring the potential of incorporating quantitative cost-effectiveness estimates. However, due to the diversity of interventions and the varying degrees of available data, applying a uniform cost-effectiveness bar to all charities, comparable to GiveWell's method, might not be feasible for us.</p><p>- Alina</p>", "parentCommentId": "wMWH8vbmyk9bFgosm", "user": {"username": "AnimalCharityEvaluators"}}, {"_id": "ctABKuA6ASBf2vr7j", "postedAt": "2023-12-01T17:18:47.421Z", "postId": "FST9XBYgbbjyN79DF", "htmlBody": "<p>Thanks for the kind words! Really glad to hear you're likely to support the great work being done by our Recommended Charities.</p><p>Like you say, involvement with EA is a hard thing to judge: I wouldn't feel qualified to name directors that I believe are involved in EA, for example. Also, while all the charities we recommend use evidence-driven strategies to achieve the maximum benefits for animals, many of them might not consider themselves EA, or might not want to be labelled as such for strategic reasons. In answer to your more specific question, two of our Recommended Charities were incubated by Charity Entrepreneurship: Fish Welfare Initiative and Shrimp Welfare Project.</p><p>As it sounds like you're already aware, we don't assess 'EA alignment' as part of our evaluations. In part, this is because we think it's very likely that the animal advocacy movement needs to be pluralistic if it's going to bring about long-term systemic change, so we want to support a wide range of organizations rather than limiting ourselves to a specific sub-set. That said, we're also very aware of the risk of personal biases affecting our assessments and the need to mitigate that risk, which is one of the reasons that we seek to quantify our decision-making as much as possible and to be transparent about all of our methodology and decision-making. It might also be helpful to know that not all of our researchers identify as EA.</p><p>If this is something you're still concerned with, the best option for you might be to give to&nbsp;<a href=\"https://animalcharityevaluators.org/donation-advice/recommended-charity-fund/\">ACE's Recommended Charity Fund</a>&nbsp;instead of to a single charity. Then your donation will be distributed among each of our recommended charities. That's also the easiest option if you want to simplify your giving while supporting the diversity of solutions that we believe are necessary to reduce animal suffering effectively. And donations to this fund will be matched if made by December 6!</p><p>I hope that's partway helpful despite not answering your specific question, and thanks again for engaging with our work and considering supporting our Recommended Charities' excellent work.</p><p>- Max</p>", "parentCommentId": "FbEYcXqznGK44DrBc", "user": {"username": "AnimalCharityEvaluators"}}]