[{"_id": "tBKNPDCRTr2fkrseE", "postedAt": "2022-10-10T15:37:25.565Z", "postId": "FtggfJ2oxNSN8Niix", "htmlBody": "<p>Sam -- good points. I would add:</p><p>There's deference (adopting views of people &amp; groups we respect as experts), and then there's anti-deference (rejecting views of people &amp; groups who are arguably experts in some domain, but whose views contradict the dominant AI safety/EA narrative -- e.g. Steven Pinker, Gary Marcus, others skeptical of AI X risk and/or speed of AI development). &nbsp;</p><p>Anti-deference can also be somewhat irrational, tribal, and conformist, such that if Gary Marcus says deep learning systems have cognitive architectures that can't possibly support AGI, and if nobody in AI safety research takes him seriously, then we might react to his pessimism by updating even harder to think that AGI is arriving sooner than we would otherwise have predicted.</p><p>Anti-deference can also take a more generalized form of ignoring whole fields of study that haven't been well-connected to the AI safety/EA in-group, but that have some potentially informative things to say about AGI timelines; this could include mainstream cognitive science, evolutionary psychology, intelligence research, software engineering, electrical engineering, history of technology, national security and intelligence, corporate intellectual property law, etc.</p>", "parentCommentId": null, "user": {"username": "geoffreymiller"}}, {"_id": "qSTCJmQqvvHTjEZiL", "postedAt": "2022-10-10T15:54:54.739Z", "postId": "FtggfJ2oxNSN8Niix", "htmlBody": "<p>I love this idea. Hoping you'll catch some deference cycles in the survey for the lols ^^</p><p>There's also this pernicious thing that people fall pray too, where they <i>think </i>they're forming an independent model of this because they only update on \"gears-level evidence\". Unfortunately, when someone tells you \"AI is N years away because XYZ technical reasons,\" you may <i>think</i> you're updating on the technical reasons, but your brain was actually just using XYZ as excuses to defer to them.</p><p>Adding to the trouble is the fact that arguments XYZ have probably gone through strong filters to reach your attention. Would the person give you the counterarguments if they knew them? How did you happen to land in a conversation with this person? Was it because you sought out \"expert advice\" from \"FOOM AI Timelines Experts Hotline\"?</p><p>When someone gives you gears-level evidence, and you update on their opinion because of that, <i>that can still constitute deferring</i>. <strong>What you think of as gears-level evidence is nearly </strong><i><strong>always</strong></i><strong> disguised testimonial evidence. </strong>At least to some, usually damning, degree. And unless you're unusually socioepistemologically astute, you're just lost to the process.</p>", "parentCommentId": null, "user": {"username": "Emrik"}}, {"_id": "hfQcWawatz8W9fWps", "postedAt": "2022-10-10T16:15:38.478Z", "postId": "FtggfJ2oxNSN8Niix", "htmlBody": "<p>Cool idea to run this survey and I agree with many of your points on the dangers of faulty deference.</p>\n<p>A few thoughts:</p>\n<p>(Edit: I think my characterisation of what deference means in formal epistemology is wrong. After a few minutes of checking this, I think what I described is a somewhat common way of modelling how we ought to respond to experts)</p>\n<ol>\n<li>\n<p>The use of the concept of deference within the EA community is unclear to me. When I encountered the concept in formal epistemology I remember \"deference to someone on claim X\" literally meaning (a) that you adopt that persons probability judgement on X. Within EA and your post (?) the concept often doesn't seem to be used in this way. Instead, I guess people think of deference as something like (b) \"updating in the direction of a persons probability judgement on X\" or (c)\"taking that person's probability estimate as significant evidence for (against) X if that person leans towards X (not-X)\"?</p>\n</li>\n<li>\n<p>I think (a) - (c) are importantly different. For instance, adopting someones credence doesn't always mean that you are taking their opinion as evidence for the claim in question even if they lean towards it being true: you might adopt someones high credence in X and thereby lowering your credence (because yours was even higher before). In that case, you update as though their high credence was evidence <em>against</em> X.\nYou might also update in the direction of someones credence without taking on their credence. Lastly, you might lower your credence in X by updating in someones direction even if they lean towards X.</p>\n</li>\n</ol>\n<p>Bottom line: these three concepts don't refer to the same \"epistemic process\" so I think its good to make clear what we mean by deference.</p>\n<ol start=\"3\">\n<li>Here is how I would draw the conceptual distinctions:</li>\n</ol>\n<p>(I) deference to someones credence in X = you adopt their probability in X\n(II) positively updating on someone's view = increasing your confidence in X upon hearing their probability on X\n(III) negatively updating on someones view = decreasing your confidence in X upon hearing their probability in X</p>\n<p>I hope this comment was legible, please ask for clarification if anything was unclearly expressed :)</p>\n", "parentCommentId": null, "user": {"username": "Aaron__Maiwald"}}, {"_id": "oSybF5o64oT7p5Pdz", "postedAt": "2022-10-10T17:19:58.030Z", "postId": "FtggfJ2oxNSN8Niix", "htmlBody": "<p>Thanks for your comment!</p><blockquote><p>Asking \"who do you defer to?\" feels like a simplification</p></blockquote><p>Agreed! I'm not going to make any changes to the survey at this stage, but I like the suggestion and if I had more time I'd try to clarify things along these lines.</p><p>I like the distinction between deference to people/groups and deference to processes.</p><blockquote><p>deference to good ideas</p></blockquote><p>[This is a bit of a semantic point, but seems important enough to mention] I think \"deference to good ideas\" wouldn't count as \"deference\", in the way that this community has ended up using it. As per the <a href=\"https://forum.effectivealtruism.org/topics/epistemic-deference\">forum topic entry on epistemic deference</a>:</p><blockquote><p>Epistemic deference is the process of updating one's beliefs in response to what others appear to believe, <i>even if one ignores the reasons for those beliefs or do not find those reasons persuasive</i>. (emphasis mine)</p></blockquote><p>If you find an argument persuasive and incorporate it into your views, I think that doesn't qualify as \"deference\". Your independent impressions don't (and in most cases won't) be the views you formed in isolation. When forming your independent impressions, you can and should take other people's arguments into account, to the extent that you find them convincing. Deference occurs when you take into account knowledge about what other people believe, and how trustworthy you find them, without engaging with their object level arguments.</p><blockquote><p>non-defensible original ideas</p></blockquote><p>A similar point applies to this one, I think.</p><p>(All of the above makes me think that the concept of deference is even less clear in the community than I thought it was -- thanks for making me aware of this!)</p>", "parentCommentId": "ooHya7nb8zgsn888E", "user": {"username": "SamClarke"}}, {"_id": "zBMokSvGr7BdrgBHz", "postedAt": "2022-10-10T17:31:16.168Z", "postId": "FtggfJ2oxNSN8Niix", "htmlBody": "<p>Thanks for your comment! I agree that the concept of deference used in this community is somewhat unclear, and <a href=\"https://forum.effectivealtruism.org/posts/FtggfJ2oxNSN8Niix/when-reporting-ai-timelines-be-clear-who-you-re-not?commentId=oSybF5o64oT7p5Pdz\">a separate comment exchange on this post</a> further convinced me of this. It's interesting to know how the word is used in formal epistemology.</p><p><a href=\"https://forum.effectivealtruism.org/topics/epistemic-deference\">Here is the EA Forum topic entry</a> on epistemic deference. I think it most closely resembles your (c). I agree there's the complicated question of what your priors should be, before you do any deference, which leads to the (b) / (c) distinction.</p>", "parentCommentId": "hfQcWawatz8W9fWps", "user": {"username": "SamClarke"}}, {"_id": "5DKKn6jWbQp7BQcce", "postedAt": "2022-10-10T17:36:46.398Z", "postId": "FtggfJ2oxNSN8Niix", "htmlBody": "<blockquote><p>Unfortunately, when someone tells you \"AI is N years away because XYZ technical reasons,\" you may <i>think</i> you're updating on the technical reasons, but your brain was actually just using XYZ as excuses to defer to them.</p></blockquote><p>I really like this point. I'm guilty of having done something like this loads myself.</p><blockquote><p>When someone gives you gears-level evidence, and you update on their opinion because of that, <i>that still constitutes deferring</i>. <strong>What you think of as gears-level evidence is nearly </strong><i><strong>always</strong></i><strong> disguised testimonial evidence. </strong>At least to some, usually damning, degree. And unless you're unusually socioepistemologically astute, you're just lost to the process.</p></blockquote><p>If it's easy, could you try to put this another way? I'm having trouble making sense of what exactly you mean, and it seems like an important point if true.</p>", "parentCommentId": "qSTCJmQqvvHTjEZiL", "user": {"username": "SamClarke"}}, {"_id": "da2GmkckucXZngN5J", "postedAt": "2022-10-10T18:04:27.264Z", "postId": "FtggfJ2oxNSN8Niix", "htmlBody": "<p>I'm confused why you characterized as \"fashionable\" to ask other people about timelines. That's technically true but both in and outside of EA, nobody asks either about why it's become more \"fashionable\" in the last couple years to ask about the chance of nuclear war or tipping points for climate change.</p>\n<p>It's presumably obvious that people are asking for reasons like:</p>\n<ul>\n<li>\n<p>already working in AI alignment and checking how timelines might influence how their own trajectories should change.</p>\n</li>\n<li>\n<p>to check whether transformative AI is so imminent it should be someone's top priority.</p>\n</li>\n<li>\n<p>they are skeptical or simply curious and want more information.</p>\n</li>\n</ul>\n<p>If there is a good reason it was phrased that way I haven't noticed, please feel free to clarify. Otherwise, it seems best to be clear what we directly mean to talk about.</p>\n", "parentCommentId": null, "user": {"username": "Evan_Gaensbauer"}}, {"_id": "eWEA2258EPKaFiX5Q", "postedAt": "2022-10-10T18:16:33.371Z", "postId": "FtggfJ2oxNSN8Niix", "htmlBody": "<blockquote><p>\"When someone gives you gears-level evidence, and you update on their opinion because of that, <i>that still constitutes deferring</i>.\"</p></blockquote><p>This was badly written. I just mean that if you <i>update on their opinion</i> as opposed to just taking the patterns &amp; trying to adjust for the fact that you received them through filters, is updating on testimony. I'm saying nothing special here, just that you might be tricking yourself into deferring (instead of impartially evaluating patterns) by letting the gearsy arguments <a href=\"https://en.wikipedia.org/wiki/Woozle_effect\"><i>woozle</i></a> you.</p><p>I wrote a bit about how testimonial evidence can be \"filtered\" in <a href=\"https://www.lesswrong.com/posts/S6Qcf5EgX5zAozTAa/the-paradox-of-expert-opinion\">the paradox of expert opinion</a>:</p><blockquote><p>If you want to know whether string theory is true and you're not able to evaluate the technical arguments yourself, who do you go to for advice? Well, seems obvious. Ask the experts. They're likely the most informed on the issue. Unfortunately, they've also been heavily <a href=\"https://www.lesswrong.com/tag/filtered-evidence\">selected for</a> belief in the hypothesis. It's unlikely they'd bother becoming string theorists in the first place unless they believed in it.</p><p>If you want to know whether God exists, who do you ask? Philosophers of religion agree: 70% accept or lean towards theism compared to 16% of all <a href=\"https://philpapers.org/surveys/results.pl?affil=Philosophy+faculty+or+PhD&amp;areas0=22&amp;areas_max=1&amp;grain=coarse\">PhilPaper Survey</a> respondents.</p><p>If you want to know whether to take <a href=\"https://www.openphilanthropy.org/blog/potential-risks-advanced-artificial-intelligence-philanthropic-opportunity\">transformative AI</a> seriously, what now?</p></blockquote>", "parentCommentId": "5DKKn6jWbQp7BQcce", "user": {"username": "Emrik"}}, {"_id": "M5GucobHBPKyF53sa", "postedAt": "2022-10-10T19:49:25.696Z", "postId": "FtggfJ2oxNSN8Niix", "htmlBody": "<p>Edit: I wrote this comment hastily when I didn't have much time today, so it may be clear or concise enough. I may return to clean it up later, especially on request, so please notify me of any parts of this comment that are hard to understand.</p>\n<p>Thank you for writing this. I've tried having conversations during the last year to learn more about this and not only do people no report who they're deferring to but when asked, they don't answer. That's not as bad as when someone answers with \"I've just heard a lot of people saying this\" but that doesn't address the problem you mentioned that it might be only 10 people who they're getting their timelines from.</p>\n<p>I don't live in the Bay Area and I'm not as personally well-connected to professionals in relevant fields, so most of these conversations I've had or seen like this are online. I understand why some might people might perceive online conversations that take longer and where nuance can get lost to be too tedious and take too much time for the value they provide. Yet why I ask is because I know I could dive deep into Metaculus forecasts or how many dozens of posts but I don't know where to start and I don't want to waste time.  Never mind opting not to disclose a name or source of information, there are scarcely answers like \"I'm too busy to get into this right now' or a suggestion for a website for others to check and figure it out for themselves.</p>\n<blockquote>\n<p>Of course, the arguments here apply more widely too. Whilst I think AI timelines is a particularly worrying case, being unclear if/how you're deferring is a generally poor way of communicating. Discussions about p(doom) are another case where I suspect we could benefit from being clearer about deference.</p>\n</blockquote>\n<p>To launch a survey is technically a good first step but the value of it may be lost if nobody else follows suit to engender better norms. I understand the feeling of urgency for the particular issue of AI timelines but the general problem you're getting at has in my experience been a common, persistent and major problem across all aspects of EA for years.</p>\n<p>I remember when I was following conversations more like this a few years ago in 2018 that there was some threshold for AI capabilities over a dozen people I talked to saying it would be imminently achieved. When I asked why they thought that, they said they knew a lot of smart people they trust saying it. I talked to a couple of them and they said a bunch of smart people they know were saying it and heard it from Demis Hassabis from DeepMind. I forget what it was but Hassabis was right because it happened around a year later.</p>\n<p>What stuck with me is how almost nobody could or would explain their reasoning. Maybe there is way more value to deference as implicit trust in individuals, groups or semi-transparent processes. Yet the reason why Eliezer Yudkowsky, Ajeya Cotra or Hassabis is because they have a process. At the least, more of the alignment community would need to understand those processes instead of having faith in a few people who probably don't want the rest of the community deferring to them that much. It appears the problem has only gotten worse.</p>\n<p>Between those like you feeling a need to write a post like this and those like me who barely get answers when we ask questions, all the problems here seem like they could be much, much worse than you're thinking.</p>\n", "parentCommentId": null, "user": {"username": "Evan_Gaensbauer"}}, {"_id": "mp4zSwK5cjHztRDBF", "postedAt": "2022-10-10T21:26:58.562Z", "postId": "FtggfJ2oxNSN8Niix", "htmlBody": "<p>In addition to the EA Forum topic post, there is this specific post by Owen Cotton-Barratt reviewing a taxonomy of types of deference considered in EA, and open issues related to each.</p>\n<p><a href=\"https://forum.effectivealtruism.org/posts/LKdhv9a478o9ngbcY/deferring\">https://forum.effectivealtruism.org/posts/LKdhv9a478o9ngbcY/deferring</a></p>\n", "parentCommentId": "ooHya7nb8zgsn888E", "user": {"username": "Evan_Gaensbauer"}}, {"_id": "a6bhxDqyryEXwoADg", "postedAt": "2022-10-10T21:37:18.434Z", "postId": "FtggfJ2oxNSN8Niix", "htmlBody": "<p>In addition to the EA Forum topic entry, there is a forum post from a few months ago by a researcher on topics related to epistemology in EA named Owen Cotton-Barratt reviewing a taxonomy of common types of deference in EA, and open issues with them, that I found informative.</p>\n<p><a href=\"https://forum.effectivealtruism.org/posts/LKdhv9a478o9ngbcY/deferring\">https://forum.effectivealtruism.org/posts/LKdhv9a478o9ngbcY/deferring</a></p>\n<p>I wrote another comment below that touched on deference, though I wrote it more quickly than carefully and I might have used the concept in a confused way as a I don't have much formal understanding of deference outside of EA, so don't take my word for it. How deference as a concept has been used in EA differently in the last year has seemed ambiguous to me, so I'm inclined to agree that progress in EA in understanding deference could be made through your challenge to the current understanding of the subject.</p>\n", "parentCommentId": "hfQcWawatz8W9fWps", "user": {"username": "Evan_Gaensbauer"}}, {"_id": "JjMJYyz5rdEjSB92i", "postedAt": "2022-10-10T21:39:31.026Z", "postId": "FtggfJ2oxNSN8Niix", "htmlBody": "<p>What's the best post to read to learn about how EAs conceive of \"gears-level understanding\"/\"gears-level evidence\"?</p>\n", "parentCommentId": "qSTCJmQqvvHTjEZiL", "user": {"username": "Evan_Gaensbauer"}}, {"_id": "h9ZYBeet8EwscSEoa", "postedAt": "2022-10-10T21:57:24.581Z", "postId": "FtggfJ2oxNSN8Niix", "htmlBody": "<p>I was short on time today and hurriedly wrote my own comment reply to Sam here before I forgot my point so it's not concise and let me know if any of it is unclear.</p>\n<p><a href=\"https://forum.effectivealtruism.org/posts/FtggfJ2oxNSN8Niix/when-reporting-ai-timelines-be-clear-who-you-re-not?commentId=M5GucobHBPKyF53sa\">https://forum.effectivealtruism.org/posts/FtggfJ2oxNSN8Niix/when-reporting-ai-timelines-be-clear-who-you-re-not?commentId=M5GucobHBPKyF53sa</a></p>\n<p>Your comment also better describes a kind of problem I was trying to get at, though I'll post again an excerpt of my testimony that dovetails with what you're saying:</p>\n<blockquote>\n<p>I remember when I was following conversations more like this a few years ago in 2018 that there was some threshold for AI capabilities over a dozen people I talked to saying it would be imminently achieved. When I asked why they thought that, they said they knew a lot of smart people they trust saying it. I talked to a couple of them and they said a bunch of smart people they know were saying it and heard it from Demis Hassabis from DeepMind. I forget what it was but Hassabis was right because it happened around a year later.</p>\n</blockquote>\n<blockquote>\n<p>What stuck with me is how almost nobody could or would explain their reasoning. Maybe there is way more value to deference as implicit trust in individuals, groups or semi-transparent processes. Yet the reason why Eliezer Yudkowsky, Ajeya Cotra or Hassabis is because they have a process. At the least, more of the alignment community would need to understand those processes instead of having faith in a few people who probably don't want the rest of the community deferring to them that much. It appears the problem has only gotten worse.</p>\n</blockquote>\n", "parentCommentId": "qSTCJmQqvvHTjEZiL", "user": {"username": "Evan_Gaensbauer"}}, {"_id": "PN3vJguYNdkCKvmob", "postedAt": "2022-10-11T09:05:35.239Z", "postId": "FtggfJ2oxNSN8Niix", "htmlBody": "<p>On timelines, other people I've most recently updated most on:</p><p><a href=\"https://www.lesswrong.com/posts/uMQ3cqWDPHhjtiesc/agi-ruin-a-list-of-lethalities?commentId=9ZhXbv8p2fr8mkXaa\">Matthew Barnett</a> (I updated to slower timelines):</p><blockquote><p>I think raw intelligence, while important, is not the primary factor that explains why humanity-as-a-species is much more powerful than chimpanzees-as-a-species. Notably, humans were once much less powerful, in our hunter-gatherer days, but over time, through the <a href=\"https://slatestarcodex.com/2019/06/04/book-review-the-secret-of-our-success/\">gradual process of accumulating technology, knowledge, and culture</a>, humans now possess vast productive capacities that far outstrip our ancient powers.</p><p>...</p><p>There are strong pressures -- including the principle of comparative advantage, diseconomies of scale, and gains from specialization -- that incentivize making economic services narrow and modular, rather than general and all-encompassing. Illustratively, a large factory where each worker specializes in their particular role will be much more productive than a factory in which each worker is trained to be a generalist, even though no one understands any particular component of the production process very well.<br><br>What is true in human economics <a href=\"https://www.overcomingbias.com/2019/02/how-lumpy-ai-services.html\">will apply to AI services as well</a>. This implies we should expect something like <a href=\"https://www.fhi.ox.ac.uk/wp-content/uploads/Reframing_Superintelligence_FHI-TR-2019-1.1-1.pdf\">Eric Drexler's AI perspective</a>, which emphasizes economic production across many agents who trade and produce narrow services, as opposed to monolithic agents that command and control.</p></blockquote><p>And I updated to faster and sooner timelines from a combination of 1) noticing some potential quick improvements in AI capabilities and feeling like there could be more similar stuff in this direction, plus 2) having heard several people say they think AI is soon because (I'm inferring their \"because\" here) they think the innovation frontier is fructiferous (Eliezer, and conversation+tweets from <a href=\"https://twitter.com/Maxeonyx/status/1549984640337088517\">Max</a>). I am likely forgetting some people here.</p><p>While I read the Sequences in 2014-15, I did feel like the model for unfriendly AI made sense, but I was mostly deferring to Eliezer on it because I had noticed how much smarter he was than me on these things.</p>", "parentCommentId": "M5GucobHBPKyF53sa", "user": {"username": "Emrik"}}, {"_id": "u4SqWd7tv2TKvtE5Y", "postedAt": "2022-10-11T09:37:17.983Z", "postId": "FtggfJ2oxNSN8Niix", "htmlBody": "<p>I'm not sure. I used to call it \"technical\" and \"testimonial evidence\" before I encountered \"gears-level\" on LW. While evidence is just evidence and Bayesian updating stays the same, it's usefwl to distinguish between these two categories because if you have a high-trust community that frequently updates on each others' opinions, you risk information cascades and <a href=\"https://en.wikipedia.org/wiki/Double_counting_(fallacy)\">double-counting</a> of evidence.</p><blockquote><p>Information cascades develop consistently in a laboratory situation [for naively rational reasons, in which other incentives to go along with the crowd are minimized]. Some decision sequences result in reverse cascades, where initial misrepresentative signals start a chain of incorrect [but naively rational] decisions that is not broken by more representative signals received later. - (<a href=\"https://econweb.ucsd.edu/~jandreon/Econ264/papers/Holt%20Anderson%20AER%201997.pdf\">Anderson &amp; Holt, 1998</a>)</p></blockquote><p>Additionally, if your model of a thing has has \"gears\", then there are multiple things about the physical world that, if you saw them change, it would change your expectations about the thing.</p><p>Let's say you're talking to someone you think is smarter than you. You start out with different estimates and different models that produce those estimates. From Ben Pace's a <a href=\"https://www.lesswrong.com/posts/yeADMcScw8EW9yxpH/a-sketch-of-good-communication\">Sketch of Good Communication</a>:</p><figure class=\"image\"><img src=\"https://39669.cdn.cke-cs.com/rQvD3VnunXZu34m86e5f/images/c6563e7c1e4c9b1819d278cb9645ce84e2204582944a3c41.png\"></figure><p>Here you can see both blue and red has <a href=\"https://www.lesswrong.com/tag/gears-level\">gears</a>. And since you think their estimate is likely to be much better than yours, and you want get some of that amazing decision-guiding power, you throw out your model and adopt their estimate (cuz you don't understand or don't have all the parts of their model):</p><figure class=\"image\"><img src=\"https://39669.cdn.cke-cs.com/rQvD3VnunXZu34m86e5f/images/edc69e552644817a63d245574aa87d38c272a012579d5936.png\"></figure><p>Here, you have \"destructively deferred\" in order to arrive at your interlocutor's probability estimate. Basically zombified. You no longer have any gears, even if the accuracy of your estimate has potentially increased a little.</p><p>An alternative is to try to hold your all-things-considered <a href=\"https://forum.effectivealtruism.org/posts/2WS3i7eY4CdLH99eg/independent-impressions\"><i>estimates</i> separate from your <i>independent impressions</i></a> (that you get from your models). But this is often hard and confusing, and they bleed into each other over time.</p>", "parentCommentId": "JjMJYyz5rdEjSB92i", "user": {"username": "Emrik"}}, {"_id": "ZkGynxwwfEJaiRedY", "postedAt": "2022-10-11T11:21:14.732Z", "postId": "FtggfJ2oxNSN8Niix", "htmlBody": "<p>I wonder if it would be good to create another survey to get some data not only on <i>who </i>people update on but also on <i>how </i>they update on others (regarding AGI timelines or something else). I was thinking of running a survey where I ask EAs about their prior on different claims (perhaps related to AGI development), present them with someone's probability judgements and then ask them about their posterior. &nbsp;That someone could be a domain expert, non-domain expert (e.g., professor in a different field) or layperson (inside or outside EA).&nbsp;<br><br>At least if they have not received any evidence regarding the claim before, then there is a relatively simple and I think convincing model of how they should update: they should set their posterior odds in the claim to the product of their prior odds and someone else's odds (this is the result of<a href=\"https://quod.lib.umich.edu/cgi/p/pod/dod-idx/updating-on-the-credences-of-others-disagreement-agreement.pdf?c=phimp;idno=3521354.0016.011;format=pdf\"> this paper</a>, see e.g. p.18). It would then be possible to compare the way people update to this rational ideal. Running such a survey doesn't seem very hard or expensive (although I don't trust my intuition here at all) and we might learn a few interesting biases in how people defer to others in the context of (say) AI forecasts.&nbsp;</p><p>I have a few more thoughts on exactly how to do this, but I'd be curious if you have any initial thoughts on this idea!&nbsp;</p>", "parentCommentId": "zBMokSvGr7BdrgBHz", "user": {"username": "Aaron__Maiwald"}}, {"_id": "paExn8kdJSsdD9yRN", "postedAt": "2022-10-16T22:08:53.385Z", "postId": "FtggfJ2oxNSN8Niix", "htmlBody": "<p>First of all, thank you for reporting who you've deferred to in different ways in specific terms. Second, thank you for putting in some extra effort to not only name this or that person but make your reasoning more transparent and legible.&nbsp;<br><br>I respect Matthew because when I read what he writes, it feels like I tend to agree with half of the points he makes and disagree with the other half. It's what makes him interesting. While some are more real and some are only perceived, there are barriers to posting on the EA Forum, like an expectation of too high a burden of rigour, that have people post on social media or other forums off of this one when they can't resist the urge to express a novel viewpoint to advance progress in EA. Matthew is one of the people I think of when I wish a lot of insightful people were more willing to post on the EA Forum.&nbsp;<br><br>I don't agree with all of what you've presented from Matthew here or what you've said yourself. I might come back to specify which parts I agree and disagree with later when I've got more time. Right now, though, I just want to positively reinforce your writing a comment that is more like the kind of feedback from others I'd like to see more of in EA.&nbsp;</p>", "parentCommentId": "PN3vJguYNdkCKvmob", "user": {"username": "Evan_Gaensbauer"}}, {"_id": "mx3xp2GY2YhHbTS9t", "postedAt": "2023-02-05T06:00:35.024Z", "postId": "FtggfJ2oxNSN8Niix", "htmlBody": "<p>Thanks, this seems right to me.</p><p>Are the survey results shareable yet? Do you have a sense of when they will be?&nbsp;</p>", "parentCommentId": null, "user": {"username": "MichaelA"}}, {"_id": "h8fDrzh5sxrWueegu", "postedAt": "2023-02-17T00:53:55.945Z", "postId": "FtggfJ2oxNSN8Niix", "htmlBody": "<p>Will get them written up this month—sorry for the delay!</p>\n", "parentCommentId": "mx3xp2GY2YhHbTS9t", "user": {"username": "SamClarke"}}, {"_id": "sPqLHMnuXyqKpRPeZ", "postedAt": "2023-03-30T23:35:14.467Z", "postId": "FtggfJ2oxNSN8Niix", "htmlBody": "<p><a href=\"https://forum.effectivealtruism.org/posts/BGFbwca4nfagvB9Xb/deference-on-ai-timelines-survey-results\">Finally posted</a></p>", "parentCommentId": "mx3xp2GY2YhHbTS9t", "user": {"username": "SamClarke"}}]