[{"_id": "8AGKqoPaK4yrJHKdp", "postedAt": "2017-10-07T13:41:00.929Z", "postId": "FuzoJwhPtaJTCkSzr", "htmlBody": "<p>I want to add additional thanks to Ellie Karslake for organising these events, finding venues and so on.</p>\n", "parentCommentId": null, "user": {"username": "weeatquince"}}, {"_id": "etmdzr4Ga2Av9ddtk", "postedAt": "2017-10-09T11:59:59.811Z", "postId": "FuzoJwhPtaJTCkSzr", "htmlBody": "<p>A really interesting project and process.  I would like to know how the group first came across NMNW?</p>\n<p>In terms of including animal groups that would have been a particularly interesting process in terms of non-utilitarianism and the types of organisations the group would have considered. However, that also could have been an additional process that consumed too much time (on top of the time taken to choose to incorporate speciesism).  I would say that even within EAA non-utilitarian perspectives are generally neglected, and sometimes marginalised, so negotiating that issue might have been difficult.  </p>\n<p>Overall, I think it is a good thing that utilitarians are giving more consideration to non-utilitarian perspectives, and potentially groups that fit into an area that utilitarians and non-utilitarians can agree with.  However, this seems to me to largely be the point of Effective Altruism.  So the idea EA is more inclined toward Effective Utilitarianism (particularly with EA weighting toward utilitarianism) is quite a complicated issue overall which the movement seems to struggle with, so I appreciate the effort made here with this project.</p>\n<p>I think for me this issue continues to point toward the need for meta-evaluation.  A commitment to reflection and evaluation ought to be a core component to EA and yet is fairly neglected at the foundational level.  I know there are pros and cons for meta-evaluation, but I see few reasons why it couldn't largely benefit the movement and the organisations associated with it.</p>\n<p>I hope some of the issues related to this project will be discussed at the forthcoming EA Global conference in London.  </p>\n", "parentCommentId": null, "user": {"username": "KevinWatkinson"}}, {"_id": "4uiikANaMTBKbufoh", "postedAt": "2017-10-10T00:59:52.108Z", "postId": "FuzoJwhPtaJTCkSzr", "htmlBody": "<p>Does the need to exist of future generations qualify?</p>\n", "parentCommentId": null, "user": {"username": "Denkenberger"}}, {"_id": "mFde9nZ3uojn44ELQ", "postedAt": "2017-10-19T16:03:55.634Z", "postId": "FuzoJwhPtaJTCkSzr", "htmlBody": "<p> If anyone wants more info about No  means no please email me my email address is <a href=\"mailto:Ekarslake@yahoo.com\">Ekarslake@yahoo.com</a></p>\n", "parentCommentId": null, "user": {"username": "Elliek"}}]