[{"_id": "npQMDYYgkxbYxkqSB", "postedAt": "2023-10-18T21:12:53.879Z", "postId": "FWEKtG5k9qpKnnBmZ", "htmlBody": "<p><strong>Executive summary</strong>: Superforecasters' aggregated probabilities differ from the author's original report on the premises of power-seeking AI as an existential risk, with higher probabilities on some premises and lower probabilities on others.</p><p><strong>Key points</strong>:</p><ol><li>Superforecasters rated premises on AI timelines and incentives higher but alignment difficulty and impact of failures lower than the original report.</li><li>The overall probability of existential catastrophe by 2070 was 1% versus 5% originally.</li><li>The author has not substantially updated given unpersuasive arguments and uncertainty about deferring to group probabilities.</li><li>Engaging with reasoned disagreements is an open question in forecasting methodology.</li><li>The author sees this as similar to determining how much to update based on disagreements from markets and economists.</li></ol><p>&nbsp;</p><p><i>This comment was auto-generated by the EA Forum Team. Feel free to point out issues with this summary by replying to the comment, and</i><a href=\"https://forum.effectivealtruism.org/contact\"><i>&nbsp;<u>contact us</u></i></a><i> if you have feedback.</i></p>", "parentCommentId": null, "user": {"username": "SummaryBot"}}, {"_id": "i2yvNSostgzRCQ7sJ", "postedAt": "2023-10-20T09:09:24.712Z", "postId": "FWEKtG5k9qpKnnBmZ", "htmlBody": "<p>Maybe there's just nothing interesting to say (though I doubt it), but I really feel like this should be getting more attention. It's an (at least mostly, plausible some of the supers were EAs) outside check on the views of most big EA orgs about the single best thing to spend EA resources on.</p>", "parentCommentId": null, "user": {"username": "Dr. David Mathers"}}, {"_id": "FgQEXnz8L5koJF9tz", "postedAt": "2023-10-21T17:28:32.743Z", "postId": "FWEKtG5k9qpKnnBmZ", "htmlBody": "<p>I think the \"alignment difficulty\" premise was given higher probability by superforecasters, not lower probability.</p>", "parentCommentId": "npQMDYYgkxbYxkqSB", "user": {"username": "Paul_Christiano"}}]