[{"_id": "fvryCsy85oYdknxQt", "postedAt": "2024-01-11T13:31:45.920Z", "postId": "FWh2S5g56ghWsw3na", "htmlBody": "<p><strong>Executive summary</strong>: CEEALAR, a center supporting EA talent, highlights 10 successes in 2023, including hosting organizations' retreats, appointing new trustees, updating their theory of change, launching an alumni network, improving their physical space, transitioning talented individuals into AI safety careers, and supporting impactful projects. However, they missed their 2022 fundraising target and have limited runway.</p><p><strong>Key points</strong>:</p><ol><li>Hosted retreats and launches for ALLFED and Orthogonal</li><li>Appointed 2 new trustees, said goodbye to 2 outgoing ones</li><li>Updated theory of change to focus on global catastrophic risks</li><li>Launched alumni network and surveyed alumni</li><li>Improved physical space of center</li><li>Refined application process and hosted 60 grantees</li><li>~7.4% of funding came from alumni and guests</li><li>Launched new website</li><li>Highlighted several grantee achievements in AI safety and ML</li><li>Have short fundraising runway despite 2023 successes</li></ol><p>&nbsp;</p><p>&nbsp;</p><p><i>This comment was auto-generated by the EA Forum Team. Feel free to point out issues with this summary by replying to the comment, and</i><a href=\"https://forum.effectivealtruism.org/contact\"><i>&nbsp;<u>contact us</u></i></a><i> if you have feedback.</i></p>", "parentCommentId": null, "user": {"username": "SummaryBot"}}, {"_id": "nDKeNHyyn4oNLtFoe", "postedAt": "2024-01-13T10:17:17.028Z", "postId": "FWh2S5g56ghWsw3na", "htmlBody": "<p>In my observed experience there are lots of young people (many whom I know personally) who want to help with AI-alignment and are in my opinion capable of doing so, they just need to spend a year or two trying and learning things to get the necessary skills.&nbsp;<br><br>These are people who usually lack prior achievement and therefore are not able to access various EA-adjacent grants to buy themselves the slack needed to put in the time and focus on a singular goal. When really what they need is not salary-sized grants but just a guarantee that they will have food, housing and a supportive environment and community, while they take a pause from formal education or jobs meant to keep them afloat.<br><br>I personally know one such person who got helped out of prior dependence through CEEALAR and has started to become productive. My own (and Orthogonals) stay at CEEALAR strongly positive as well.<br><br>Ive heard that grant makers are often operationally constrained on giving out smaller hit based grants to for example individuals. By giving to CEEALAR, grant makers would outsource this operational cost and would be able to bootstrap people doing AI-alignment, in a hits based manner for low cost compared to alternatives such as individual grants. Which I do think is one of the most cost effective ways to help with AI-alignment. Myself and many others I know doing good work in Alignment would not exist in the space if not for personal hit-based grants.<br><br>I'm very confused and sad that CEEALAR has not recieved more funding. Not only do I wish that CEEALAR could stay afloat and expand, but I also think we would STRONGLY benefit from similar institutions aimed at low cost housing for motivated, but potentially unproven individuals, at other geographical locations, say east and west coast in the US, as well as somewhere in Europe. If CEEALAR was able to consistently get funded, that would grant confidence for people to start similar organizations elsewhere.</p>", "parentCommentId": null, "user": {"username": "JuliaHP"}}, {"_id": "y3wfpp9gpkNTcGcYB", "postedAt": "2024-01-17T17:19:50.838Z", "postId": "FWh2S5g56ghWsw3na", "htmlBody": "<p>From having been involved for several years, I can also say we were sufficiently funding constrained that seeking funding to stay afloat took a large proportion of the staff and trustee's time, and made planning for greater long term efficiency very hard. All of these achievements are despite that constant friction, so I really hope the new team get a chance to find out what a fully focused version of the project could do.&nbsp;</p>", "parentCommentId": "nDKeNHyyn4oNLtFoe", "user": {"username": "Arepo"}}]