[{"_id": "jSNyoxqo52rTfAKn4", "postedAt": "2018-05-12T13:24:19.030Z", "postId": "FYuMgcNq2quC8CSyc", "htmlBody": "<p>You seem to be comparing prediction markets to perfection, not to the real mechanisms that we now use today instead. People proposing prediction markets are suggesting they'd work better than the status quo. They are usually not comparing them to something like GJP. </p>\n", "parentCommentId": null, "user": {"username": "RobinHanson"}}, {"_id": "fHgFmse7G3K46fqhD", "postedAt": "2018-05-12T16:59:59.436Z", "postId": "FYuMgcNq2quC8CSyc", "htmlBody": "<p>Who are you arguing against? The three links in your first paragraph go to articles that don't clearly disagree with you.</p>\n<blockquote>\n<p>I’d also be curious about a prediction market in which only superforecasters trade.</p>\n</blockquote>\n<p>I'd guess that there would be fewer trades than otherwise, and this would often offset any benefits that come from the high quality of the participants.</p>\n", "parentCommentId": null, "user": {"username": "PeterMcCluskey"}}, {"_id": "AgNmoupdLwnEegdAi", "postedAt": "2018-05-12T17:02:46.554Z", "postId": "FYuMgcNq2quC8CSyc", "htmlBody": "<p>I agree with you prediction markets are in many cases better than the status quo. I'm not comparing prediction markets to perfection but to their alternatives (like extremizing team forecasts). I'm also only arguing that prediction markets are overrated <em>within EA</em>, not in the wider world. I'd assume they're underrated outside of libertarian-friendly circles.</p>\n<p>All in all, for which problems prediction markets do better than which alternatives is an empirical question, which I state in the post:</p>\n<blockquote>\n<blockquote>\n<p>How stringently the conditions for market efficiency need to be met for a market to actually be efficient is an empirical question. How efficient a prediction market needs to be to give better forecasts than the alternatives is another one.</p>\n</blockquote>\n</blockquote>\n<p>Do you disagree that in the specific examples I have given (an office prediction market about the timeline of a project, an election prediction market) having a prediction market is worse than the alternatives?</p>\n<p>It would be good if you could give concrete examples where you expect prediction markets to be the best alternative.</p>\n<p>Prediction markets are a neat concept, and are often regarded highly in the EA sphere. I think they are often not the best alternative for a given problem and are insufficiently compared to those alternatives <em>within EA</em>. Perhaps because they are such a neat concept - &quot;let's just do a prediction market!&quot; sounds a lot more exciting than discussing a problem in a team and extremizing the team's forecast even though a prediction market would be a lot more work.</p>\n", "parentCommentId": "jSNyoxqo52rTfAKn4", "user": {"username": "Denise_Melchin"}}, {"_id": "4DtCqqZRNLfCPz7oB", "postedAt": "2018-05-12T17:15:13.870Z", "postId": "FYuMgcNq2quC8CSyc", "htmlBody": "<p>Without some concrete estimate of how highly prediction markets are currently rated, its hard to say if they are over or under rated. They are almost never used, however, so it is hard to believe they are overused. </p>\n<p>The office prediction markets you outline might well be useful. They aren't obviously bad. </p>\n<p>I see huge potential for creating larger markets to estimate altruism effectiveness. We don't have any such at the moment, or even much effort to make them, so I find it hard to see that there's too much effort there. </p>\n<p>For example, it would be great to create markets estimating advertised outcomes from proposed World Bank projects. That might well pressure the Bank into adopting projects more likely to achieve those outcomes.</p>\n", "parentCommentId": "AgNmoupdLwnEegdAi", "user": {"username": "RobinHanson"}}, {"_id": "f3xsRmbofL29RXpiL", "postedAt": "2018-05-12T18:40:44.872Z", "postId": "FYuMgcNq2quC8CSyc", "htmlBody": "<p>Two points about prediction markets:</p>\n<ul>\n<li>I think it's interesting that in the limit, prediction markets don't have prices that converge to probabilities--they converge to <a href=\"https://ordinaryideas.wordpress.com/2011/12/16/risk-arbitrage/\">risk-adjusted prices</a>.</li>\n<li>I think the strongest case for prediction markets is that they're unbiased and hard to manipulate in the limit. See this <a href=\"https://webcache.googleusercontent.com/search?q=cache:joiVxRittskJ:https:%2F%2Fsquid314.livejournal.com%2F352406.html%20&amp;cd=1&amp;hl=en&amp;ct=clnk&amp;gl=us\">cached old blog post</a>. Your post doesn't take that into account.</li>\n</ul>\n", "parentCommentId": null, "user": {"username": "Buck"}}, {"_id": "Tkzfa4YopMiMnaKFG", "postedAt": "2018-05-13T08:33:06.773Z", "postId": "FYuMgcNq2quC8CSyc", "htmlBody": "<p>I don't think prediction markets are overused by EAs, I think they are advocated for too much (both for internal lower stakes situations as well as for solving problems in the world) when they are not the best alternative for a given problem. </p>\n<p>One problem with prediction markets is that they are hassle to implement which is why people don't actually want to implement them. But since they are often the first alternative suggestion to the status quo within EA, better solutions in lower stakes situations like office forecasts which might have a chance of actually getting implemented don't even get discussed.</p>\n<p>I don't think an office prediction market would be bad or not useful once you ignore opportunity costs, just worse than the alternatives. To be fair, I'm somewhat more optimistic for implementing office prediction markets in large workspaces like Google, but not for the small EA orgs we have. In those they would more likely take up a bunch of work without actually improving the situation much.</p>\n<p>How large do you think a market needs to be to be efficient enough to be better than, say, asking Tetlock for the names of the top 30 superforecasters and hiring them to assess the problem? Given that political betting, despite being pretty large, had such big trouble as described in the post, I'm afraid an efficient enough prediction market would take a lot of work to implement.\nI agree with you the added incentive structure would be nice, which might well make up for a lack of efficiency.</p>\n<p>But again, I'm still optimistic about sufficiently large stock market like prediction markets.</p>\n", "parentCommentId": "4DtCqqZRNLfCPz7oB", "user": {"username": "Denise_Melchin"}}, {"_id": "zB6L8cviSgjwQgi6S", "postedAt": "2018-05-13T08:36:41.303Z", "postId": "FYuMgcNq2quC8CSyc", "htmlBody": "<p>I'm arguing against prediction markets being the best alternative in many situations contemplated by EAs, which is something I have heard said or implied by a lot of EAs in conversations I've had with them. Most notably, I think a lot of EAs are unaware of the arguments I make in the post and I wanted to have them written up for future reference.</p>\n", "parentCommentId": "fHgFmse7G3K46fqhD", "user": {"username": "Denise_Melchin"}}, {"_id": "dp5FfHkAQAwMzRzz4", "postedAt": "2018-05-13T08:41:39.368Z", "postId": "FYuMgcNq2quC8CSyc", "htmlBody": "<p>I'm arguing that the limit is hard to reach and when it isn't being reached, prediction markets are usually worse than alternatives. I'd be excited about a prediction market like Scott is describing in his post, but we are quite far away from implementing anything like that.</p>\n<p>I also find it ironic that Scott's example discusses how hard election prediction markets are to corrupt, which is precisely what happened in the Intrade example above.</p>\n", "parentCommentId": "f3xsRmbofL29RXpiL", "user": {"username": "Denise_Melchin"}}, {"_id": "zMMy4nFdY8fcrsoHZ", "postedAt": "2018-05-13T12:09:32.363Z", "postId": "FYuMgcNq2quC8CSyc", "htmlBody": "<p>Political betting had a problem relative to perfection, not relative to the actual other alternatives used; it did better than them according to accuracy studies. </p>\n<p>Yes there are overheads to using prediction markets, but those are mainly for having any system at all. Once you have a system, the overhead to adding a new question is much lower. Since you don't have EA prediction markets now, you face those initial costs. </p>\n<p>For forecasting in most organizations, hiring top 30 super forecasters would go badly, as they don't know enough about that organization to be useful. Far better to have just a handful of participants from that organization. </p>\n", "parentCommentId": "Tkzfa4YopMiMnaKFG", "user": {"username": "RobinHanson"}}, {"_id": "qYsnfYoBeyCxweCpT", "postedAt": "2018-05-13T15:37:09.652Z", "postId": "FYuMgcNq2quC8CSyc", "htmlBody": "<p>I assumed you didn't mean an internal World Bank prediction market, sorry about that. As I said above, I'm more optimistic about large workplaces employing prediction markets. I don't know how many staff the World Bank employs. Do you agree now that prediction markets are an inferior solution to forecasting problems in small organizations? If yes, what do you think is the minimum staff size of a workplace for a prediction market to be efficient enough to be better than e.g. extremized team forecasting?</p>\n<p>Could you link to the accuracy studies you cite that show that prediction markets do better than polling on predicting election results? I don't see any obvious big differences on a quick Google search. The next obvious alternative is asking whether people like Nate Silver did better than prediction markets. \nIn the GJP, individual superforecasters did sometimes better than prediction markets, but team superforecasters did consistently better. Putting Nate Silver and his kin in a room seems to have a good chance to outperform prediction markets then.</p>\n<p>You also don't state your opinion on the Intrade incident. Since I cannot see that prediction markets are obviously a lot better than polls or pundits (they didn't call the 2016 surprises either), I find it questionable whether blatant attempts at voter manipulation through prediction markets are worth the cost. This is a big price to pay even if prediction markets did a bit better than polls or pundits.</p>\n", "parentCommentId": "zMMy4nFdY8fcrsoHZ", "user": {"username": "Denise_Melchin"}}, {"_id": "ospQrEqdoZiBm55yJ", "postedAt": "2018-05-13T16:36:47.071Z", "postId": "FYuMgcNq2quC8CSyc", "htmlBody": "<p>I think markets that have at least 20 people trading on any given question will on average be at least as good as any alternative.</p>\n<p>Your comments about superforecasters suggest that you think what matters is hiring the right people. What I think matters is the incentives the people are given. Most organizations produce bad forecasts because they have goals which distract people from the truth. The biggest gains from prediction markets are due to replacing bad incentives with incentives that are closely connected with accurate predictions.</p>\n<p>There are multiple ways to produce good incentives, and for internal office predictions, there's usually something simpler than prediction markets that works well enough.</p>\n", "parentCommentId": "Tkzfa4YopMiMnaKFG", "user": {"username": "PeterMcCluskey"}}, {"_id": "gFRhygf9dixY3ktAm", "postedAt": "2018-05-13T21:02:20.440Z", "postId": "FYuMgcNq2quC8CSyc", "htmlBody": "<blockquote>\n<p>I find it questionable whether blatant attempts at voter manipulation through prediction markets are worth the cost. This is a big price to pay even if prediction markets did a bit better than polls or pundits.</p>\n</blockquote>\n<p>Robin's <a href=\"http://faculty.arts.ubc.ca/roprea/manipTH.pdf\">position</a> is that manipulators can actually improve the accuracy of prediction markets, by increasing the rewards to informed trading. On this view, the possibility of market manipulation is not in itself a consideration that favors non-market alternatives, such as polls or pundits.</p>\n", "parentCommentId": "qYsnfYoBeyCxweCpT", "user": {"username": "Pablo_Stafforini"}}, {"_id": "CFrBqg8QxBD7EbA8p", "postedAt": "2018-05-13T21:38:26.588Z", "postId": "FYuMgcNq2quC8CSyc", "htmlBody": "<p>I have had a lot of EAs say this to me in person as well.</p>\n", "parentCommentId": "zB6L8cviSgjwQgi6S", "user": {"username": "Joey"}}, {"_id": "CZutnK9yvZgnnw7eG", "postedAt": "2018-05-14T05:20:20.778Z", "postId": "FYuMgcNq2quC8CSyc", "htmlBody": "<p>A way to frame this question is how do we get the best predictions per least amount of effort, with different strategies having different levels of effort/accuracy of output. A strategy would be considered dominated if a different strategy required both less effort and gave better accuracy.  I think a pretty good case can be made for “teams of forecasters working together with their results extremized” cleary requiring less effort and being possibly more accurate or in the same ballpark as prediction markets. If that is the case, I think the argument for setting up/using prediction markets is greatly weakened. It seems like if someone did systematic research into the highest value/least resource consumption predictions, prediction markets would not score at the top of many overall rankings given its high cost. Also some evidence about the high resource cost might be that EAs, although quite excited, driven and intelligent, cannot get a prediction market going with more than a few bets on a given question. </p>\n", "parentCommentId": null, "user": {"username": "Joey"}}, {"_id": "gvkhb8N5Yr9SjLGKx", "postedAt": "2018-05-14T20:32:20.963Z", "postId": "FYuMgcNq2quC8CSyc", "htmlBody": "<p>Interesting! I am trading off accuracy with outside world manipulation in that argument, since accuracy isn't actually the main end goal I care about (but 'good done in the world' for which better forecasts of the future would be pretty useful).</p>\n", "parentCommentId": "gFRhygf9dixY3ktAm", "user": {"username": "Denise_Melchin"}}, {"_id": "tPKKkQ5WGbTASXAPh", "postedAt": "2018-05-15T17:10:08.920Z", "postId": "FYuMgcNq2quC8CSyc", "htmlBody": "<p>Feel free to ignore if you don't think this is sufficiently important, but I don't understand the contrast you draw between accuracy and outside world manipulation. I thought manipulation of prediction markets was concerning precisely because it reduces their accuracy. Assuming you accept Robin's point that manipulation increases accuracy on balance, what's your residual concern?</p>\n", "parentCommentId": "gvkhb8N5Yr9SjLGKx", "user": {"username": "Pablo_Stafforini"}}, {"_id": "aK59Q5BY9rCeqNGBh", "postedAt": "2018-05-19T16:09:22.541Z", "postId": "FYuMgcNq2quC8CSyc", "htmlBody": "<p>So let's assume that teams of superforecasters with extremized predictions can do significantly better than any other mechanism of prediction that we've thought of, including prediction markets as they've existed so far. If so, then with prediction markets of sufficiently high volume and liquidity (just for the sake of argument, imagine prediction markets on the scale of the NYSE today), we would expect firms to crop up that would identify superforecasters, train them, and optimize for exactly how much to extremize their predictions (as well as iterating on this basic formula). These superforecaster firms would come to dominate the prediction markets (we'd eventually wind up with companies that were like the equivalent of goldman sachs but for prediction markets), and the prediction markets would be better than any other method of prediction. Of course, we're a LONG way away from having prediction markets like that, but I think this at least shows the theoretical potential of large scale prediction markets.</p>\n", "parentCommentId": null, "user": {"username": "Daniel_Eth"}}, {"_id": "ejL3MYseiqPbvuvEq", "postedAt": "2018-05-25T18:22:45.717Z", "postId": "FYuMgcNq2quC8CSyc", "htmlBody": "<p>On the thin markets problem, there's been some prior work (on doing some googling I found <a href=\"https://mason.gmu.edu/~rhanson/mktscore.pdf\">https://mason.gmu.edu/~rhanson/mktscore.pdf</a>, but I recall reading a paper with a less scary tile).</p>\n<p>In the office case, an obvious downside to incentivising the market is that one may divert labour away from normal work, so it <em>may</em> still be that non-market solutions are superior</p>\n", "parentCommentId": null, "user": {"username": "rjmk"}}, {"_id": "Y5XgMiEhSgeA3QhXb", "postedAt": "2018-05-30T19:17:41.757Z", "postId": "FYuMgcNq2quC8CSyc", "htmlBody": "<p>Regarding section 1, is there a reliable way to determine who these market-beating superforecasters are? What about in new domains? Do we have to have a long series of forecasts in any new domain before we can pick out the superforecasters?</p>\n<p>Somewhat relatedly, what guarantees do we have that the superforecasters aren't just getting lucky? Surely, <em>some</em> portion of them would revert to the mean if we continued to follow their forecasts.</p>\n<p>Altogether, this seems somewhat analogous to the arguments around active vs passive investing where I think passive investing comes out on top.</p>\n", "parentCommentId": null, "user": {"username": "cole_haus"}}, {"_id": "2TwJXvYygoC8WhdQw", "postedAt": "2020-10-14T10:50:42.311Z", "postId": "FYuMgcNq2quC8CSyc", "htmlBody": "<p>That&apos;s what I thought, too. Hiring the top 30 superforecasters seems much less scalable than a big prediction market like you describe it, where becoming a superforecaster suddenly would become a valid career. I wonder if it&apos;s not too far off to expect some more technocratic government to set one up at some point in the coming years. I wonder what the OT and others here would think about lobbying for predictions markets from an EA perspective.</p>", "parentCommentId": "aK59Q5BY9rCeqNGBh", "user": {"username": "MaxRa"}}]