[{"_id": "zrmCjhPdQBhrvxoG7", "postedAt": "2015-01-26T01:59:32.914Z", "postId": "FzbdRr3uGEnHkyypi", "htmlBody": "<blockquote>\n<p>average approximately $20,000 in pledges per year</p>\n</blockquote>\n<blockquote>\n<p>However participation costs $2,500 a year (as well as a 5% commission on donations)</p>\n</blockquote>\n<p>You'd only have to be 15% confident ($20K * 0.95 - $2.5K = $16.5K.  $16.5K / $2.5K = 6.6.  1 / 6.6 = ~15%) you would achieve the average or more for it to be worth worth trying out, not accounting for the existence of better investment opportunities.</p>\n<p>And you'd only have to raise $2.7K to more than break even, not accounting for time costs or better investment opportunities (X * 0.95 = $2.5K.  $2.5K / 0.95 = $2632).</p>\n<p>Seems worth exploring a little bit more to me.</p>\n", "parentCommentId": null, "user": {"username": "Peter_Hurford"}}, {"_id": "BakDNxgWKr68xd5kF", "postedAt": "2015-01-26T05:26:06.422Z", "postId": "FzbdRr3uGEnHkyypi", "htmlBody": "<blockquote>\n<p>I found consistent advice that the typical forms of corporate fundraising require the charity to have something worth offering to the company, such as an ability to reach a valuable audience through (for example) prominently sponsoring a charity event.</p>\n</blockquote>\n<p>This is pretty interesting.  Givewell spends a lot of time thinking about effective giving; I wonder what an effective charity event looks like?</p>\n", "parentCommentId": null, "user": {"username": "John_Maxwell_IV"}}, {"_id": "48wfoie8uMBs2JirC", "postedAt": "2015-01-26T06:30:38.529Z", "postId": "FzbdRr3uGEnHkyypi", "htmlBody": "<p>I’ve just written a business plan for a payroll giving and matching gifts SaaS provider that specializes in highly effective giving. I can send you a copy if you like, but I attached my full CV to it, so I don’t want to publish it in its current form.</p>\n<p>The idea is to replicate the established model of such a SaaS provider but to convince companies to only match employee donations to highly effective charities to incentivize effective giving. Additionally, the management of the clients of such a provider will be in a perfect position to convey the idea of EA to their employees, so my idea was to add an EA outreach consulting service to the portfolio of the hypothetical SaaS provider.</p>\n<p>CSR can take the form of shared value, risk management, corporate philanthropy, and possibly some mixed forms. Such a SaaS provider could add little benefit for the company if it already runs a shared value scheme, but in the other cases, especially in the last, an EA matching gifts scheme would add value to CSR that focuses on such goals as attracting talent or improving public perception. Especially since a common criticism leveled against CSR is that it is often self-serving and hence unfocused and nontransparent about its impact, such a program would enable a company to distinguish itself from other companies that engage in CSR.</p>\n<p>My current plan is not to start such a SaaS provider, or not as a first option, but rather to first reach out to the existing providers of such software worldwide and ask whether they would be ready to use their position and leverage to approach their existing corporate clients and promote the same scheme themselves. With the help of AMF, I’ve compiled a list of ten more or less large providers. If this is close to what Charity Science would be interested in pursuing, then I’d be delighted to collaborate with you!</p>\n", "parentCommentId": null, "user": {"username": "Telofy"}}, {"_id": "wsx9XCZcgNk4mL4Ew", "postedAt": "2015-01-26T12:28:04.847Z", "postId": "FzbdRr3uGEnHkyypi", "htmlBody": "<p>I agree with this. You might try raising money for this directly. I'd think if you put together a 1-2 page document outlining the giving opportunity with the potential benefits (including value of information!), there's a fair chance that you could get money for it from people in this community.</p>\n", "parentCommentId": "zrmCjhPdQBhrvxoG7", "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "mS2g5RvD5eTsBzPPT", "postedAt": "2015-01-26T13:35:14.089Z", "postId": "FzbdRr3uGEnHkyypi", "htmlBody": "<p>Interesting to read! Good to see you're considering such a wide variety of ways to fundraise. </p>\n<p>My thought in reading this was that it seems difficult for outsiders to companies to sway them to give to more effective charities. But could there be a bigger chance of success if it was driven by EA employees at companies e.g. talking to their CSR department? Charity Science's role could then be in supporting these EAs. </p>\n", "parentCommentId": null, "user": {"username": "MarkusAnderljung"}}, {"_id": "4kx5XjFSwjCgYTpcD", "postedAt": "2015-01-26T15:18:46.581Z", "postId": "FzbdRr3uGEnHkyypi", "htmlBody": "<p>That's a very good point, I agree and should have mentioned that - I've added it in. I've talked to an EA who works as a management consultant and got GiveWell recommendations included in the list of charities donated to at his company. He suggested that it would be helpful to have glossy, persuasive materials on the charities from Charity Science, and we plan to create those.</p>\n", "parentCommentId": "mS2g5RvD5eTsBzPPT", "user": {"username": "Tom_Ash"}}, {"_id": "95LAXcdC7rJc6ti6W", "postedAt": "2015-01-26T16:30:38.623Z", "postId": "FzbdRr3uGEnHkyypi", "htmlBody": "<p>That's an interesting suggestion, thanks for that - we'll consider it.</p>\n", "parentCommentId": "wsx9XCZcgNk4mL4Ew", "user": {"username": "Tom_Ash"}}, {"_id": "bMWhBo6tsRKg4DpFs", "postedAt": "2015-01-26T16:31:57.754Z", "postId": "FzbdRr3uGEnHkyypi", "htmlBody": "<p>The idea in this advice is that the company would sponsor a charity event like a big walk or dinner that the charity does, likely for fundraising.</p>\n", "parentCommentId": "BakDNxgWKr68xd5kF", "user": {"username": "Tom_Ash"}}, {"_id": "xuP4TQ6C8MLkHJqDw", "postedAt": "2015-01-27T20:59:07.108Z", "postId": "FzbdRr3uGEnHkyypi", "htmlBody": "<p>These materials should be useful for peer-to-peer fundraising as well.</p>\n<p>To pick an example from a mainstream charitable context, Macmillan Cancer Support produce materials which explain what cancer is, why it is a problem and how they (Macmillan) tackle it (something close to their theory of change). These materials are mostly designed for peer-to-peer fundraising, but would also be useful for me if I wanted to promote Macmillan in a corporate fundraising case as well.</p>\n<p><a href=\"http://be.macmillan.org.uk/be/default.aspx\">http://be.macmillan.org.uk/be/default.aspx</a></p>\n<p>(Disclosure - I'm the management consultant Tom is referring to in the opening post)</p>\n", "parentCommentId": "4kx5XjFSwjCgYTpcD", "user": {"username": "ChrisSmith"}}, {"_id": "BM9AKN48cb9v2fa8n", "postedAt": "2015-01-28T23:38:14.813Z", "postId": "FzbdRr3uGEnHkyypi", "htmlBody": "<p>GOOD/Corps (<a href=\"http://www.goodcorps.com\">www.goodcorps.com</a>) is another nice resource. I've been in contact with them in case anyone wants an intro.</p>\n", "parentCommentId": null, "user": {"username": "tyleralterman"}}, {"_id": "9hJzu4YEa6fpbff4c", "postedAt": "2015-01-28T23:42:05.054Z", "postId": "FzbdRr3uGEnHkyypi", "htmlBody": "<p>Also, I plan to strategize soon on shifting corporate philanthropy in a top-down way with Google's global corporate social responsibility lead (she self-identifies as EA). (Example: sell corporate decision-makers on EA.) So let me know if you dig up anything in this arena. </p>\n", "parentCommentId": null, "user": {"username": "tyleralterman"}}, {"_id": "Rh68ntcG4fAQePr3Z", "postedAt": "2015-01-29T16:47:11.630Z", "postId": "FzbdRr3uGEnHkyypi", "htmlBody": "<p>&quot;However participation costs $2,500 a year (as well as a 5% commission on donations). We feel that we do not have sufficient evidence to justify this expenditure. Among other things, Charity Science is not in a financial position to take punts which have a good chance of not paying off, even if in expectation they will have a large positive impact.&quot;</p>\n<p>feels like a shame to let a small financial barrier get in the way of a large positive impact...</p>\n<p>If you did feel like there was a 7% or greater chance, I'd put in £100-£400 on this gamble if you were raising for amf and £100-£400 loss coverage if this was raising for charity science (I'd want a claim on the first £x equivalent to what I put in after recouperating costs) - but need to agree with my giving partner first.</p>\n", "parentCommentId": "95LAXcdC7rJc6ti6W", "user": {"username": "tomstocker"}}, {"_id": "D6XzJjHMg9QGuBHet", "postedAt": "2015-02-13T19:57:29.771Z", "postId": "FzbdRr3uGEnHkyypi", "htmlBody": "<p>As an update we're going to do this, so thanks for the suggestion! It'd be great if anyone interested could comment or message me in the meantime.</p>\n", "parentCommentId": "wsx9XCZcgNk4mL4Ew", "user": {"username": "Tom_Ash"}}, {"_id": "upz6eekh3sn6LJTeW", "postedAt": "2015-02-13T19:58:13.375Z", "postId": "FzbdRr3uGEnHkyypi", "htmlBody": "<p>Hi Tom, we'd love to take you up on that as we've decided that there is sufficient chance!</p>\n", "parentCommentId": "Rh68ntcG4fAQePr3Z", "user": {"username": "Tom_Ash"}}, {"_id": "ERtXWsL8gHtYDPrHD", "postedAt": "2022-11-01T03:27:50.765Z", "postId": "FzbdRr3uGEnHkyypi", "htmlBody": "<p>When it comes to marketing materials in B2B SaaS at <a href=\"thenewsinsides.com\"><u>Thenewsinsides</u></a>, etc., I'd think you'll have a lot more direct touch and influence with small firms.</p><p>However, you will also be welcomed with relatively smaller wallets. This is not a terrible thing since you could have a large prospect list but low conversion rates. As the market changes, you'll eventually be able to convert that list. A no today does not equal a no tomorrow.</p><p>Your competitors will target medium and large enterprises and will provide them with a lot more information. You may provide them a more individualised experience that caters to their particular place in society by concentrating on small enterprises.</p>", "parentCommentId": "48wfoie8uMBs2JirC", "user": {"username": "RainGunn"}}]