[{"_id": "6ftt9YwgTRuEFYsZo", "postedAt": "2023-03-16T04:39:37.833Z", "postId": "FZFzqPYpTpGGRhyrj", "htmlBody": "<p>EA's meta-strategy is 'simp for tech billionaires and AI companies'. EA systematically attracts people who enjoy this strategy. So no it does not attract the best. Maybe a version of EA with more integrity would attract the best people.</p>", "parentCommentId": null, "user": {"username": "deluks917"}}, {"_id": "o3mahDSh4wuHTvsXh", "postedAt": "2023-03-16T15:18:56.923Z", "postId": "FZFzqPYpTpGGRhyrj", "htmlBody": "<p>We have a higher bar for taking moderation action against criticism, but considering that sapphire was <a href=\"https://forum.effectivealtruism.org/posts/WgziByhhKGDfuEgyy/share-the-burden?commentId=Wgs6jdkT4RfGPs9NX\">warned two days ago</a> we have decided to ban sapphire for one month for breaking <a href=\"https://forum.effectivealtruism.org/posts/yND9aGJgobm5dEXqF/guide-to-norms-on-the-forum#The_essentials_of_Forum_discussion\">forum norms</a> multiple times.</p>", "parentCommentId": "6ftt9YwgTRuEFYsZo", "user": {"username": "Lorenzo Buonanno"}}, {"_id": "sLwcycWovfMepm6yi", "postedAt": "2023-03-16T19:09:19.731Z", "postId": "FZFzqPYpTpGGRhyrj", "htmlBody": "<p>Can you say which norms the current comment breaks? I think it was not clear to me upon reading both the comment, and looking at the forum norms again.</p>", "parentCommentId": "o3mahDSh4wuHTvsXh", "user": {"username": "Linch"}}, {"_id": "4hgTBWhPi8oaArcSA", "postedAt": "2023-03-16T20:15:05.515Z", "postId": "FZFzqPYpTpGGRhyrj", "htmlBody": "<p>The meaning of \"simp\" differs from place to place, but it's not particularly civil and decidedly not in this context. I support a suspension action in light of the recent warning, but given the dissimilar type of violation maybe a week or two would have been sufficient.</p>\n<p><a href=\"https://www.cnn.com/2021/02/19/health/what-is-simp-teen-slang-wellness/index.html\">https://www.cnn.com/2021/02/19/health/what-is-simp-teen-slang-wellness/index.html</a></p>\n", "parentCommentId": "sLwcycWovfMepm6yi", "user": {"username": "Jason"}}, {"_id": "kixfqkBnQyGm8JcZA", "postedAt": "2023-03-17T00:53:30.003Z", "postId": "FZFzqPYpTpGGRhyrj", "htmlBody": "<p>I think this is entirely legitimate criticism. It's not at all clear to me that the net impact of Effective Altruism, from end to end, has even been positive. And if it has been negative, it has been negative BECAUSE of the impact the movement has had on AI timelines.&nbsp;<br><br>This should prompt FAR more reflection than I have seen within the community. People should be racking their brains for what went wrong and crying mea culpa. And working for OpenAI/Anthropic/etc/etc should not be seen as \"effective\". &nbsp;(Well, maybe <i>now</i> &nbsp;it's okay. Cat's out of the bag. But certainly being an AI capabilities researcher in 2020 did a lot of harm.)<br><br>As far as I can tell, the \"Don't Build the Torment Nexus\" community went ahead and built the Torment Nexus because it was both intellectually interesting and a path for individuals to acquire more power. Oops.&nbsp;<br><br>And to be clear, this pales in comparison - in my mind at least - to any harms done from the FTX debacle or the sexual abuse scandals. And that is not in any way a trivialization of either of those harms, both of which were also pretty severe. \"Accelerate AI timelines\" is just that bad.&nbsp;</p>", "parentCommentId": "6ftt9YwgTRuEFYsZo", "user": {"username": "wolframhead"}}, {"_id": "8fhi7AykXrfh2eXab", "postedAt": "2023-03-17T19:42:07.917Z", "postId": "FZFzqPYpTpGGRhyrj", "htmlBody": "<p>I strongly, strongly, strongly disagree with this decision.&nbsp;</p><p>Per my own values and style of communication, I think that welcoming people like sapphire or <a href=\"https://forum.effectivealtruism.org/users/sabs\">Sabs</a> who a) are or can be intensely disagreeable, and b) have points worth sharing and processing, is strongly on the side of worth doing, even if c) they make other people uncomfortable, and d) even if they occasionally misfire, and even if they are wrong most of the time, as long as the expected value of the stuff they say remains high.&nbsp;</p><p>In particular, I think that doing so is good for arriving at correct beliefs and for becoming stronger, which I value a whole lot. It is the kind of communication which we use on my forecasting group, where the goal is to arrive at correct beliefs.</p><p>I understand that the EA Forum moderators may have different values, and that they may want to make the forum a less spiky place. Know that this has the predictable consequence of losing a Nuño, and it is part of the reason why I've bothered to create a <a href=\"https://nunosempere.com/blog/\">blog</a> and added comments to it in a way which I expect to be fairly uncensorable<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefoqqz8a6ph6j\"><sup><a href=\"#fnoqqz8a6ph6j\">[1]</a></sup></span>.</p><p>Separately, I do think it is the case that EA \"simps\" for tech billionaires<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefmrttzddtmu\"><sup><a href=\"#fnmrttzddtmu\">[2]</a></sup></span>. An answer I would have preferred to see would be a steelmanning of why that is good, or an argument of why this isn't the case.</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnoqqz8a6ph6j\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefoqqz8a6ph6j\">^</a></strong></sup></span><div class=\"footnote-content\"><p>Uncensorable by others: I am hosting the blog on top of <a href=\"https://njal.la/\">nja.la</a> and the comments on my own servers. Not uncensorable by me; I can and will censor stuff that I think is low value by my own utilitarian/consequentialist lights.</p></div></li><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnmrttzddtmu\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefmrttzddtmu\">^</a></strong></sup></span><div class=\"footnote-content\"><p>Less sure of AI companies, but you could also make the case, e.g., 80kh does recommend positions at OpenAI (&lt;https://jobs.80000hours.org/?query=OpenAI&gt;)&nbsp;</p></div></li></ol>", "parentCommentId": "o3mahDSh4wuHTvsXh", "user": {"username": "NunoSempere"}}, {"_id": "6Gys5yorX3ubpbLfX", "postedAt": "2023-03-18T01:10:01.513Z", "postId": "FZFzqPYpTpGGRhyrj", "htmlBody": "<p>The mods can't realistically call different strike  zones based on whether or not \"expected value of the stuff [a poster says] remains high.\" Not only does that make them look non-impartial, it actually is non-impartial.</p>\n<p>Plus, warnings and bans are the primary methods by which the mods give substance to the floor of what forum norms require. That educative function requires a fairly consistent floor. If a comment doesn't draw a warning, it's at least a weak signal that the comment doesn't cross the line.</p>\n<p>I do think a history of positive contributions is relevant to the sanction.</p>\n", "parentCommentId": "8fhi7AykXrfh2eXab", "user": {"username": "Jason"}}, {"_id": "mQi25Z5MSC4b64sdF", "postedAt": "2023-03-20T10:53:37.578Z", "postId": "FZFzqPYpTpGGRhyrj", "htmlBody": "<p>Sorry for the late reply,<br><br>The comment was unnecessarily rude and antagonistic — it didn't meet the minimum bar for civility. (See the Forum norm \"Stay civil, at the minimum\".)</p><p>In isolation, this comment is a mild norm violation. But having a lot of mildly-bad (unnecessarily antagonistic) comments often corrodes the quality of Forum discourse more than a single terrible comment.</p><p>It's hard to know how to respond to someone who seems to have a pattern of posting such comments. There's often no \"smoking gun\" comment that clearly deserves a ban. That's why we have our current setup — we generally give warnings and then proceed to bans if nothing changes.</p><p>I think we've not been responding to cases like this enough, recently. At the same time, I wish we could figure out a more collaborative approach than our current one, and it's possible that a 1-month warning was too long — we're discussing it in the moderation team.</p><p>(Note: some parts of this comment, as with some other comments that moderators post, were written by other moderators, but I personally believe what I'm posting. This seems worth flagging, given that I'm sharing these opinions as my own. I don't know if all the people on the moderation team agree with everything as I put it here.)</p>", "parentCommentId": "sLwcycWovfMepm6yi", "user": {"username": "Lorenzo Buonanno"}}, {"_id": "pqBeJwXXixsghmzku", "postedAt": "2023-03-22T16:37:52.784Z", "postId": "FZFzqPYpTpGGRhyrj", "htmlBody": "<p>I'm conflicted on this: on the one hand I agree that it's worth listening to people who aren't skilled at politeness or aren't putting enough effort into it. On the other hand, I think someone like Sapphire is capable of communicating the same information in a more polite way, and a ban incentivizes people to put more effort into politeness, which will make the community nicer.</p>\n", "parentCommentId": "8fhi7AykXrfh2eXab", "user": {"username": "MichaelDickens"}}, {"_id": "nm9Cm8dbxajDF4vgZ", "postedAt": "2023-03-22T20:38:22.048Z", "postId": "FZFzqPYpTpGGRhyrj", "htmlBody": "<p>Yeah, you also see this with criticism, where for any given piece of criticism, you could put more effort into it and make it more effective. But having that as a standard (even as a personal one) means that it will happen less.</p><p>So I don't think we disagree on the fact that there is a demand curve? Maybe we disagree that I want to have more sapphires and less politeness, on the margin?</p>", "parentCommentId": "pqBeJwXXixsghmzku", "user": {"username": "NunoSempere"}}]