[{"_id": "XCKGZusnZ3BPhEK9x", "postedAt": "2023-07-27T03:53:00.458Z", "postId": "FzoMPHtXzTig8pXuh", "htmlBody": "<p>Thanks for writing up this post.</p>\n<p>I think it makes sense for us to increase the amount of work that happens under specific cause areas, but I think it’s also important for us to maintain the EA brand. I agree that we should be reluctant to discard a proven brand that has done a great job of attracting the kind of people who are capable of having a significant impact.</p>\n", "parentCommentId": null, "user": {"username": "casebash"}}, {"_id": "o3cAfpZZMot8oqqTQ", "postedAt": "2023-07-27T07:43:09.829Z", "postId": "FzoMPHtXzTig8pXuh", "htmlBody": "<p>I wholeheartedly agree with this post.</p>\n<p>I think there has been a bit of over-reacting to recent events. I don't think the damage is that bad, and to some degree I think we've just been unlucky. Maybe we need to do some things differently (e.g. try to project less of an air of certainty, which many critics seem to perceive) but we should also beware the illusion of control.</p>\n", "parentCommentId": null, "user": {"username": "Michael_PJ"}}, {"_id": "787Ygp8FvZcmuL4gB", "postedAt": "2023-07-28T20:25:34.736Z", "postId": "FzoMPHtXzTig8pXuh", "htmlBody": "<blockquote><p>I also hope that some of the (what I perceive to be) silent majority will chime in and demonstrate that we’re here and don’t want to see EA splintered, rebranded, or otherwise demoted in favor of some other label.</p></blockquote><p>🙋‍♀️</p><p>This is one of my favourite posts on this forum and I imagine the large majority of EAs I know IRL would largely agree with it (although there's definitely a selection bias there). Thank you! I feel like there have been several moments in the past year or so where I've been like, \"Man, EA NYC seems really cool.\"<br><br>Re \"best EA win,\" I couldn't pick a favourite but here's one I learnt a few hours ago: Eitan Fischer - who I remember from early CEA days when he <a href=\"https://animalcharityevaluators.org/about/background/our-history/\">founded</a> Animal Charity Evaluators - now runs the cultivated meat company <a href=\"https://missionbarns.com/\">Mission Barns</a>. The Guardian <a href=\"https://www.theguardian.com/environment/2023/jan/23/lab-grown-meat-animals-climate\">says</a>, \"[A] handful of outlets have agreed to stock its products once they are approved for sale.\" 🥳</p>", "parentCommentId": null, "user": {"username": "Holly"}}, {"_id": "8hXYr8bcmh5uvDbRA", "postedAt": "2023-07-29T21:44:34.390Z", "postId": "FzoMPHtXzTig8pXuh", "htmlBody": "<p>Strong agree.&nbsp;<br>I think having EA as a movement encompassing all those different cause areas also makes it possible to have EA-groups in smaller places, that could not sustain an AI-safety and a Global Health and Animal Rights group.&nbsp;</p>", "parentCommentId": null, "user": {"username": "wuschel"}}, {"_id": "zEobxZkoY8MJDfGyc", "postedAt": "2023-08-03T07:52:44.269Z", "postId": "FzoMPHtXzTig8pXuh", "htmlBody": "<p>Being relatively new to EA and to this forum, I strongly agree with the message here. While reading, I found a few specific points I would mention that you didn't stress:</p><ol><li>A good part of what you discuss relates to the business concept of \"Brand Equity\" - more or less, what is the subconscious and then conscious reaction of people when they hear a name. A good Brand is incredibly valuable. I worked for a consumer goods company and so I've heard quantitative estimates of the value of a Brand (like <i>Walgreens</i> or <i>Tide</i> or <i>Hershey's</i>) - to put it in perspective, if someone gave you the choice between owing all the factories used to make a specific consumer product, but not the Brand-name, or owning the Brand-name but not the factories, there are many cases where people would choose the Brand-name. I've also seen the massive effort involved in trying to create a new Brand, and to manage Brand-equity. Right now, EA is a very powerful Brand with a very positive equity. We need to realise that if we were to change it, it would mean re-starting brand-building from scratch. The equity isn't perfect, and there have been some negative PR events (some not our fault), but it's still very good. If we were to give that up and not just merge into existing charities, we'd really struggle to get anywhere near where we are today.&nbsp;</li><li>What you cite as almost a counter-example (that you don't feel so strongly about animals) is actually a powerful argument in favour of your conclusion. How many of us joined EA because of just one or two beliefs, and then through the EA community have widened our understanding of the ways we can make a difference. Rather than focus on the few where we may not fully agree, we could focus on how each of us, every day, gets a chance to interact with passionate, eloquent, rational people who want to educate us about more ways we can make the world better. What's not to love about that? And yet, again using you as an example, nobody forces any of us to fully embrace every cause or to feel passionate about every one.&nbsp;</li><li>EA is still a relatively new movement, growing fast. Some people still have not heard of it, or have heard of it only by name. It feels to me that getting more and more people involved can only help - the movement and the world - and that starts by making people aware that it exists and letting them see what it is. Splitting into different movements, or even renaming our movement, would be a step backwards in terms of growth just for the simple reason that each new name would be unknown again, and we'd need to start the whole effort again, and for each new group, there wouldn't be a history that interested people could read about (for example, the EA Forum) to find out more. (It's great if you're Elon Musk and you can change \"Twitter\" to \"X\" because you have enough name-recognition that people everywhere hear the news. We don't have that luxury).&nbsp;</li></ol><p>You suggest that we include one EA win. For me, one powerful EA win has been Direct Giving, the idea that people in dire poverty are far better judges of what they need than even the most well-meaning charity executives. It is through EA, or at least, through the kind of quantitative studies that EA supports, that direct giving has gained support and credibility as a very effective way to help.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Denis "}}, {"_id": "yzXkboiaGJovDgZbD", "postedAt": "2023-08-03T08:14:48.350Z", "postId": "FzoMPHtXzTig8pXuh", "htmlBody": "<p>I wholeheartedly agree.</p><p>To me, the \"effective\" supplements the \"altruism\". There are so many resources available via EA that could benefit those already involved in altruistic endeavours. A Big Tent community that does not require cause-neutral, hyper-optimised members would be able to provide those services more effectively. This should naturally result in a hedged movement and provides stronger appeal to those already committed to making the world better (presumably with stronger adherence to positive values than those responsible for the recent bad publicity).</p><p>A question posed by a local EA club member comes to mind: Is it better to teach an altruist to be more effective, or an effector to be more altruistic?</p>", "parentCommentId": null, "user": {"username": "crobertson"}}, {"_id": "stYp2wCfAugT8QcGN", "postedAt": "2023-08-07T09:54:42.653Z", "postId": "FzoMPHtXzTig8pXuh", "htmlBody": "<p>Thanks so much for writing this Arthur.</p><p>I'm still interested in the possibilities of changing various aspects of how the EA community works, but this post does a great job of explaining important things that we're getting right already and — perhaps more importantly — in helping us remember what it is all about and why we're here.</p>", "parentCommentId": null, "user": {"username": "Toby_Ord"}}]