[{"_id": "WFzWXumw647yZAYuY", "postedAt": "2023-08-07T16:24:29.054Z", "postId": "G2KkiFtNcXHiocr4K", "htmlBody": "<p>\"the\" focus violates the spirit of EA, and feels like a weird title for the post. \"a\" focus is what the correct title would be.&nbsp;</p><p>It's not disinterest, it's always been an open question and viable for prioritization. Either properties of particular peoples' subjective EV formulas (which incorporate each of the ITN, presumably) or social contingencies (like the patents/IP culture of biotech investing feeling weird from a more software industry perspective, or something more like \"people not going to <i>enough</i> of the same parties\", etc.) lead to it appearing to have very little EA cashflow.&nbsp;</p><p>I saw <a href=\"https://forum.effectivealtruism.org/posts/4Pek6aKbEoXSZvNFT/open-thread?commentId=igAzDDuyyZXiXdZZz\">this comment</a> recently asking a similar question but 9 years ago.&nbsp;</p><p>A friend had a draft of a givewell-style \"QALYs bought by the marginal dollar spent in the longevity field\" in guesstimate, but I don't want to put his name on blast in case he thinks the draft is really bad or he didn't get far enough. My guess is that more projects like this could meaningfully change the conversation.&nbsp;</p>", "parentCommentId": null, "user": {"username": "quinn"}}, {"_id": "TcEThaWSHpNXnKJys", "postedAt": "2023-08-07T16:27:53.564Z", "postId": "G2KkiFtNcXHiocr4K", "htmlBody": "<p>Welcome to the Forum!</p><p>I think part of the explanation relates to what you point out at the end: “radical life extension is <i>speculative</i>”. You note that “so is preventing risks from AI”, but preventing such risks seems to be higher impact than extending life. In general, causes vary both in how “speculative” they are and in what their expected impact is, and EA may be seen as an attempt to have the most impact for varying levels of “speculativeness”. One could argue that, while the impact of life extension as a cause is relatively high, its “speculativeness-adjusted” impact is considerably lower — just like the risk-adjusted return of some financial instruments is low despite having comparatively high expected returns. This may in part explain why it is relatively neglected among EAs. (I do not think it fully explains it.)</p><p>(I have added the tag <a href=\"https://forum.effectivealtruism.org/topics/aging-research\">Aging research</a>. There's a list of relevant posts at the end which you may want to consult.)</p>", "parentCommentId": null, "user": {"username": "Pablo_Stafforini"}}, {"_id": "kEDYgR2CDxCCPJ5qe", "postedAt": "2023-08-07T16:29:59.942Z", "postId": "G2KkiFtNcXHiocr4K", "htmlBody": "<p><a href=\"https://forum.effectivealtruism.org/posts/jd4ycHq8aqFgJGvkY/is-there-a-hedonistic-utilitarian-case-for-cryonics-discuss\">This is also relevant.</a></p>", "parentCommentId": null, "user": {"username": "emre kaplan"}}, {"_id": "5twQZNwhebqbnHY96", "postedAt": "2023-08-07T17:31:37.993Z", "postId": "G2KkiFtNcXHiocr4K", "htmlBody": "<p>This seems false. Dramatic increases in life extension technology have been happening ever since <a href=\"https://ourworldindata.org/grapher/life-expectancy\">the invention of modern medicine</a>, so its strange to say the field is speculative enough not to even consider.</p>\n", "parentCommentId": "TcEThaWSHpNXnKJys", "user": {"username": "D0TheMath"}}, {"_id": "YWEMNAyKXsnqpYeJA", "postedAt": "2023-08-07T18:17:16.901Z", "postId": "G2KkiFtNcXHiocr4K", "htmlBody": "<p>To be clear, I was only trying to describe what I believe is going on here, without necessarily endorsing the relative neglect of this cause area. And it does seem many EA folk consider radical life extension a “speculative” way of improving global health, whether or not they are justified in this belief.&nbsp;</p>", "parentCommentId": "5twQZNwhebqbnHY96", "user": {"username": "Pablo_Stafforini"}}, {"_id": "CTCwQQj4GoeksvJHJ", "postedAt": "2023-08-08T00:07:33.659Z", "postId": "G2KkiFtNcXHiocr4K", "htmlBody": "<p>Radical life extension is IMO a big part of the <a href=\"https://www.lesswrong.com/tag/life-extension\">rationalist</a> worldview, if not the EA movement. &nbsp;(Although recent progress in AI has taken attention away from anti-aging, on the grounds that if we get AI alignment wrong, we're all dead, and if we get alignment right, the superintelligent AI will easily solve aging for us.)<br><br>One of the problems with radical life extension as an EA cause area is that it seems like other people ought to be rationally self-interested in funding anti-aging research, so it's not clear why EA should foot the bill:<br><br>Health interventions in the world's poorest countries -- a lot of the leverage comes from the fact that poor people often don't have the resources or knowledge to help themselves<br><br>Animal welfare &amp; longtermism -- animals obviously have about ~0 ability to advocate for themselves. &nbsp;Ditto for unborn far-future generations of human civilization.<br><br>Anti-aging -- sure, there is a pretty significant collective-action problem (I might pay for anti-aging research because I personally don't want to die, but then the benefits are diffused around to all humanity), but still, wouldn't there be plenty of especially rich people willing to pay the $$$ to do the anti-aging research?? &nbsp;Yes, indeed, this is what we see:</p><ul><li>a billion-dollar-per-year fund of saudi oligarchs funding anti-aging trials <a href=\"https://www.technologyreview.com/2022/06/07/1053132/saudi-arabia-slow-aging-metformin/\">https://www.technologyreview.com/2022/06/07/1053132/saudi-arabia-slow-aging-metformin/</a></li><li>Vitalik Buterin has made a bunch of inspiring donations to anti-aging groups: <a href=\"https://www.lifespan.io/news/vitalik-buterin-longevity-ai-zuzalu/\">https://www.lifespan.io/news/vitalik-buterin-longevity-ai-zuzalu/</a>&nbsp;</li><li>Google funds a variety of anti-aging moonshot projects, which are probably money-losing propositions in expectation but are supported by various top executives: <a href=\"https://www.calicolabs.com/\">https://www.calicolabs.com/</a>&nbsp;</li><li>Jeff Bezos, Yuri Milner, Peter Thiel, etc, have funded several ambitious projects in the anti-aging space: <a href=\"https://www.technologyreview.com/2021/09/04/1034364/altos-labs-silicon-valleys-jeff-bezos-milner-bet-living-forever/\">https://www.technologyreview.com/2021/09/04/1034364/altos-labs-silicon-valleys-jeff-bezos-milner-bet-living-forever/</a> &nbsp; &nbsp;<a href=\"https://www.washingtonpost.com/business/on-leadership/peter-thiels-life-goal-to-extend-our-time-on-this-earth/2015/04/03/b7a1779c-4814-11e4-891d-713f052086a0_story.html\"><strong>https://www.washingtonpost.com/business/on-leadership/peter-thiels-life-goal-to-extend-our-time-on-this-earth/2015/04/03/b7a1779c-4814-11e4-891d-713f052086a0_story.html</strong></a><strong>&nbsp;</strong></li></ul><p>Personally, I cheer these billionares on, I think they're doing a great thing, and I think people in general ought to wise up about the badness of death and aging (it would be great if millions more people had read \"The Fable of the Dragon-Tyrant\"!) and support more anti-aging research through government-funded health agencies. &nbsp;HOWEVER, even with all that enthusiasm... I don't think it's really a great fit for an EA cause, since so many other people have a self-interested incentive to fund this stuff.</p>", "parentCommentId": null, "user": {"username": "Jackson Wagner"}}, {"_id": "pNCZbxk94z2zv64YH", "postedAt": "2023-08-08T01:01:10.739Z", "postId": "G2KkiFtNcXHiocr4K", "htmlBody": "<p>My understanding of what's happening is, more or less, \"~everyone who's willing to bite the bullet on anti-aging being higher EV than GH&amp;D is wiling to bite the further bullet on X-risk reduction being higher EV than both\". I could imagine some combination of views leading to thinking anti-aging is the highest impact – for instance, someone who subscribed to all of: person-affecting view, longtermism, and long AI timelines – but that's a pretty unusual combination.</p>", "parentCommentId": null, "user": {"username": "Daniel_Eth"}}, {"_id": "8Jbf7pvaefLaCGveh", "postedAt": "2023-08-08T09:11:30.659Z", "postId": "G2KkiFtNcXHiocr4K", "htmlBody": "<p>I'd also note that <a href=\"https://blogs.biomedcentral.com/on-health/2018/01/16/bang-for-your-buck-the-return-from-public-investments-in-biomedical-and-health-research/\">hundreds of billions of dollars</a> are spent on biomedical research generally each year. While most of this isn't targeted at anti-aging specifically, there will be a fair amount of spillover that benefits anti-aging research, in terms of increased understanding of genes, proteins, cell biology etc.</p>", "parentCommentId": "CTCwQQj4GoeksvJHJ", "user": {"username": "Matt_Sharp"}}, {"_id": "NF3Eyjw5YtfxtPGQt", "postedAt": "2023-08-08T10:00:31.779Z", "postId": "G2KkiFtNcXHiocr4K", "htmlBody": "<p>CEARCH did a shallow dive into this (https://docs.google.com/spreadsheets/d/116DqgnzADo8zAmJ_QAp9AKcjKPMlgBs2Hc9E7SSAASM/edit#gid=0) and our preliminary conclusion is that the marginal expected value of funding life extension research doesn't meet our threshold of 10x GiveWell. A lot of uncertainty, obviously, but generally things look good upfront and worse later, so this wasn't a promising sign, and we decided not to spend more time on this.</p>", "parentCommentId": null, "user": {"username": "Joel Tan"}}, {"_id": "xnakgQyHtE9pNY6Xp", "postedAt": "2023-08-08T13:47:13.873Z", "postId": "G2KkiFtNcXHiocr4K", "htmlBody": "<p>Quick thought: in some population models, in particular ones where human population peaks in the next 50-100 years and then continues declining (see <a href=\"https://globalprioritiesinstitute.org/david-thorstad-three-mistakes-in-the-moral-mathematics-of-existential-risk/\">Three mistakes in the moral mathematics of existential risk</a>), there is a longtermist case to make that without life extension, the economy will not be sustainable when:</p><ol><li>Elderly people comprise a large part of society and thus require more societal help</li><li>There are fewer people to fill niche sub-specialties</li></ol><p>of course, a lot of things change with AGI as well, so it all depends on your timelines. I generally believe that EA doesn't emphasize aging enough and would like to help you make the case if you're interested.</p>", "parentCommentId": null, "user": {"username": "Bary Levi"}}]