[{"_id": "8JBFyYybTpvg38nKv", "postedAt": "2022-11-21T06:39:55.183Z", "postId": "G3DJ2qsZiZjdvmgSv", "htmlBody": "<p>Thanks for sharing this report! Happy to see more global health content on the forum.<br><br>Two quick questions on skimming it:</p><ol><li>When working out the marginal value of sodium taxation policy advocacy, <strong>do you discount for the possibility of salt reduction policies happening independent of any EA efforts in this area? </strong>(i.e. your advocacy is speeding up the policy passing by X number of years as opposed to bringing it in a world where it otherwise would never have existed). For example, if you crudely take 2023 figures, and assume that the intervention successfully speeds up salt taxes globally by 5 years compared to a world without any additional resources, the this would mean ~1.2E9 DALYs are at stake, compared to your topline figure of 1.2E10 DALYs.&nbsp;<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnref60oy58k6zaw\"><sup><a href=\"#fn60oy58k6zaw\">[1]</a></sup></span></li><li>The cost per intervention of US$137,000 for getting a salt tax advocacy are in part based on assessments like:<br>i) \"I assess that around <strong>1 year of operations is a reasonable timeframe </strong>for the charity to lobby/prepare supporting research reports on the health and economics benefits of the tax/do public polling to show public support/construct a coalition of NGOs and advocates in support and hence succeed\", and<br>ii) \"my sense is that <strong>this is doable by a 2 person EA charity </strong>in the style of Charity Entrepreneurship incubatees\".<br><br>I wonder whether you'd be happy to elaborate on these assessments / how you got to these figures, as both seem optimistic to me (though perhaps I'm too cynical).</li></ol><p>Thanks again for doing this work!<br><br>(commenting in personal capacity etc)</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fn60oy58k6zaw\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnref60oy58k6zaw\">^</a></strong></sup></span><div class=\"footnote-content\"><p>2.43E8 * 5 = 1.215E9</p></div></li></ol>", "parentCommentId": null, "user": {"username": "bruce"}}, {"_id": "Xj69qpN2CiyYyMkp3", "postedAt": "2022-11-21T07:43:55.782Z", "postId": "G3DJ2qsZiZjdvmgSv", "htmlBody": "<p>Hey Joel, great report- overall, I am also pretty excited about interventions for hypertension. &nbsp;A couple of questions about your report:</p><ol><li>You decided to narrow down on sodium policy taxation advocacy- whilst I think this is probably one of the more appealing interventions in this space, I wonder whether you considered other interventions e.g. community salt substitution, which was <a href=\"https://www.givewell.org/international/technical/programs/community-salt-substitution\">looked into by Givewell</a> and recently had a very large RCT conducted.</li><li>The impact of sodium reduction extends beyond BP effects- Although the majority of the health effect of sodium reduction does seem to be through reducing BP, there are some other causal mechanisms that are suggested e.g. reducing oxidative stress, reducing sympathetic tone. I wonder whether you looked into/considered these</li><li>The cost of advocacy- it seems like you have by and large taken the cost of quite a lean charity doing this. I wonder whether it would be worthwhile looking at organisations that have previously successfully helped advocate for taxation policy, and estimated their size/cost. I would imagine this might be a higher cost by several factors</li><li>Are there good advocacy groups out there- I would be really interested to know whether there are highly effective organisations advocacy for sodium taxation policy already out there, that funders might be able to look int further + potentially fund!</li></ol><p>A great report- thanks Joel!</p>", "parentCommentId": null, "user": {"username": "Akhil Bansal"}}, {"_id": "RiMQDLKZHdzzGuCr2", "postedAt": "2022-11-21T17:18:16.777Z", "postId": "G3DJ2qsZiZjdvmgSv", "htmlBody": "<p>I doubt most claims about sodium causing health problems. High sodium consumption seems quite correlated with dietary choices that have other problems, which makes studying this hard.</p>\n<p>See <a href=\"https://www.overcomingbias.com/2011/11/forget-salt.html\">Robin Hanson's</a> <a href=\"https://www.overcomingbias.com/2011/05/strange-salt.html\">comments</a>.</p>\n", "parentCommentId": null, "user": {"username": "PeterMcCluskey"}}, {"_id": "dvhHDPtoxJ2BYysGa", "postedAt": "2022-11-22T01:45:38.436Z", "postId": "G3DJ2qsZiZjdvmgSv", "htmlBody": "<p>Hi Bruce, thanks for the comments!<br><br>On (1): Will definitely be looking to examine the counterfactual policy passage issue more explicitly, in deeper research rounds - but one view is that this is already automatically factored in by any analysis (like the rough one here) of how age-standardized DALYs lost per capita will evolve in the future based on past trends (since any chance in sodium consumption due to policy reasons will show up in both prevalence/severity of hypertension and hence in these age-standardized DALYs).<br><br>Any advice on how counterfactual policy passage should be incorporated would be welcome! The way I've done it in the past (and what the way CE does it, I believe) is case study analysis (look at past instances, and calculate country-years of policy passage against total country-years, or something like that), but it's not always wholly satisfactory.<br><br>On (2): You're right that this may be too optimistic! My assessment here is based partly on my understanding of the work of CE policy charities (LEEP/PEN/Good Policies), researching and planning out a potential tobacco taxation charity in the recent CE incubation programme (went with CEARCH in the end), and also my past work in government/policy consulting. I have moderate confidence in the view that conditional on there being interest from policymakers, you can work your way up to cabinet ministers within a year in a LMIC and get a yes/no answer by then. I also have high confidence in the view that if the government is not interested, you get the feedback from lower level civil servants long before that, allowing you to pivot accordingly. All this is premised on a high willingness to ignore sunk costs and pivot quickly, and excludes implementation time (folding that into the next year of operations, as you juggle both advising the persuaded government and lobbying the next country)<br><br>I'll recalibrate this as I get more expert advice (and also update on the more recent work of CE policy charities, including Mathias Bonde's aid policy organization).</p>", "parentCommentId": "8JBFyYybTpvg38nKv", "user": {"username": "Joel Tan"}}, {"_id": "K2TubkxfWDn8K6NA7", "postedAt": "2022-11-22T02:02:36.717Z", "postId": "G3DJ2qsZiZjdvmgSv", "htmlBody": "<p>Hi Akhil! Hope you're enjoying your new role!<br><br>(1) I didn't look at community salt substitution at any real depth. My quick prioritization on tractable solutions (definitely the weakest part of the 5-day shallow research process) was that policy intervention via a tax would be more effective than direct delivery (including providing communities with free salt substitutes). And with GiveWell also less optimistic on this issue, there doesn't seem to be a strong case for re-examination.<br><br>(2) Didn't look at the other positive effects - will look to incorporate these in deeper research reports, as well as with the negative side effects (especially on how poorer families are likely to be affected - it's going to be the thorniest part of the political case for sodium taxes)<br><br>(3) Good point! Will be looking to re-examine the costing, by talking to experts and orgs (especially WASSH) in the area, especially since the topline cost-effectiveness number is so sensitive to this. I think it's very possible that my view is overly influenced by the implicit understanding that this will be an EA organization running on CE-style leanness, but I was also encouraged by the fact that WASSH didn't have a monster budget or anything.<br><br>(4) The Thai Low Salt Network seems to be on the verge of success, and WASSH seemed successful in getting supermarkets to reduce product sodium content, but salt taxes are rare enough, and I don't believe there &nbsp;will be many organizations (unlike for sugar) that have a strong track record here. &nbsp;Will definitely be doing a deeper dive on this - unfortunately, deeper case analysis (let along talking to experts) is just really hard to do within the 1-week shallow research stage</p>", "parentCommentId": "Xj69qpN2CiyYyMkp3", "user": {"username": "Joel Tan"}}, {"_id": "nQyPuqxbvP2FwgYKX", "postedAt": "2022-11-22T02:13:37.134Z", "postId": "G3DJ2qsZiZjdvmgSv", "htmlBody": "<p>It seems the scientific consensus, and Cochrane reviews/meta-analysis of RCTs(e.g. <a href=\"https://www.bmj.com/content/346/bmj.f1325)\">https://www.bmj.com/content/346/bmj.f1325)</a> are supportive. I wouldn't rule out the possibility that sodium isn't as harmful as health authorities think it is (c.f. the whole fracas over saturated fat vs sugar), but I guess I don't see this as a serious worry or something that demands more research given the current evidence/expert opinion and limited research time.</p>", "parentCommentId": "RiMQDLKZHdzzGuCr2", "user": {"username": "Joel Tan"}}, {"_id": "XhxxZEFFfpzPDCNkn", "postedAt": "2022-11-22T02:26:33.704Z", "postId": "G3DJ2qsZiZjdvmgSv", "htmlBody": "<p>Couple things (I've only skimmed the post):</p><ol><li><strong>How certain are you that increased sodium consumption causes hypertension?</strong> (I'm skeptical of this personally)<ol><li>(<i>Do prediction markets exist on this? Could you make one?</i>)</li></ol></li><li>How certain are you that decreasing increased sodium consumption causes not less hypertension, <i>but also less mortality/more DALYs overall? &nbsp;</i>Some interventions are backwards like this. (E.g. Limiting <a href=\"https://www.outsideonline.com/health/wellness/sunscreen-sun-exposure-skin-cancer-science/\">sun exposure</a> fairly certainly decreases skin cancer, but it also might fairly significantly increase mortality, on net)</li><li>Why specifically taxation, instead of other ways to influence individual behavior? (Taxation seems rather coercive IMO, an overstepping of bounds of individuals by their government)</li></ol><p>(I have more questions like this but I'll leave just these three for now.)</p>", "parentCommentId": null, "user": {"username": "ChrisLakin"}}, {"_id": "j2GnEpWogdL4BSxnn", "postedAt": "2022-11-22T04:05:27.503Z", "postId": "G3DJ2qsZiZjdvmgSv", "htmlBody": "<p>Although probably appropriate to ignore at the shallow-analysis level, I think one would need to look into substitution effects very carefully at some point. Specifically, I'm concerned that people might substitute other foods that are reinforcing and pleasurable -- for instance, people may substitute fries for brownies, which would have negative effects on (e.g.) diabetes rates. You could get around this with a general \"junk food tax,\" but the difficult of getting that enacted goes up significantly.</p>", "parentCommentId": null, "user": {"username": "Jason"}}, {"_id": "JHEsgDQsQvRk3f54D", "postedAt": "2022-11-22T04:11:38.114Z", "postId": "G3DJ2qsZiZjdvmgSv", "htmlBody": "<p>No worries! I'll DM ya some additional thoughts &nbsp;:)</p><p>Thanks again!</p>", "parentCommentId": "dvhHDPtoxJ2BYysGa", "user": {"username": "bruce"}}, {"_id": "7nC98HAkeRmbTZche", "postedAt": "2022-11-22T12:24:13.591Z", "postId": "G3DJ2qsZiZjdvmgSv", "htmlBody": "<p>Thanks - this is super interesting and I agree that hypertension is a promising cause area - and that taxes on unhealthy foods may be a promising intervention.</p><blockquote><p>The estimate of the degree to which an average 1 mg reduction in sodium consumption reduces incidence of high systolic blood pressure in a single country and hence the global disease burden of hypertension, relies on an extremely long and complicated chain of calculations – there is hence a high degree of uncertainty here.</p></blockquote><p>I agree with your assessment that this is an area of uncertainty. In particular, I think we need to be careful about assuming linear effects on BP and burden of disease based on a very small change in daily sodium intake. You've thought deeply about this problem, so would be keen to hear your thoughts on what I've sketched out below.</p><p>You estimated that a tax would reduce sodium consumption by 67 mg per day; a <a href=\"https://www.bmj.com/content/346/bmj.f1325\">meta-analyses suggests</a> that reducing dietary salt by a mean of 4.4 g per day leads to a mean reduction of systolic BP of 4.18 mm Hg. There was a bigger drop (5.39 mm Hg) in hypertensive people. [Note: my best guess is that your estimate of sodium reduction is for molecular sodium whereas these numbers are for salt - NaCl - &nbsp;4.4 g of NaCl would be about 1.7 g of Na.] Based on this, I would say it's very generous to assume any more than 0.5 mm Hg average reduction in systolic BP from 67 mg less sodium per day. 0.5 mm Hg is well within measurement error. This may be a case where a very small effect multiplied by a huge number of people still has a huge effect, but I think more evidence would be helpful. In particular, can we find evidence that:</p><ul><li>the relationship between sodium intake and BP is linear and holds true for <i>milligram</i> quantities of change? BP is a homeostatic system where I don't think we can always assume linear effects.</li><li>very small reductions in BP over time lead to meaningful changes in health outcomes?</li></ul><p>Maybe deriving additional estimates of the health impacts of -67 mg/day salt intake, using different reference classes, could reduce this uncertainty.&nbsp;</p>", "parentCommentId": null, "user": {"username": "mpt7"}}, {"_id": "ig5yzk6Nxfn7BTqiu", "postedAt": "2022-11-22T17:20:20.705Z", "postId": "G3DJ2qsZiZjdvmgSv", "htmlBody": "<p>Thanks for writing this! This is really interesting. I only skimmed, but my basic reaction is that I agree that hypertension is an important problem, but am skeptical about salt taxes as a solution. Here are a few reasons why:<br><br>1) &nbsp;I suspect salt taxes are less effective at reducing consumption of the offending agent than other kinds of sin taxes (e.g., sugar, tobacco) for two reasons. First, per the linked article, the taxes have historically been applied to salty foods, like chips, instant noodles, and salted nuts. But I suspect a large percentage of the salt people consume comes from the food they cook. Second, it is easier to replace the salt that is taken out of salty foods. You wouldn't buy a sugar-free soda and add sugar to it, but you might well add salt to nuts, instant noodles, and so on. (My parents would buy unsalted microwave popcorn when I was a kid, and I developed workarounds...)&nbsp;<br><br>2) This is very speculative, but I worry that salt taxes—which, as you note, will be unpopular—could lead to broader backlash against sin taxes, in much the same way that more draconian masking rules have, perhaps, incited broader backlash against masking. It would be very bad if pushing for salt taxes led to reduced public support for tobacco taxes.<br><br>3) Like other commenters, I'm a bit skeptical of the extent to which reducing salt consumption reduces blood pressure. Just looking quickly at this Cochrane review, the drop in systolic blood pressure (SBP) for hypertensive people was 5mm Hg (and only 2mm Hg for normotensive people) with reduced salt consumption. These drops may be statistically significant, but I'm not bowled over by their clinical significance. If a patient with a BP of 150/90 reduced their SBP to 145 by limiting salt consumption, you'd put them on an antihypertensive.&nbsp;<br><br>4) I'm perhaps most confused by how quickly antihypertensives are dismissed as an option—<br>\"medications, will by their nature be more expensive as an intervention than policy change.\" My understanding is that the substantial reductions in cardiovascular mortality seen in the Western world are <a href=\"https://www.nejm.org/doi/full/10.1056/NEJM199904223401601 \">largely attributable</a> to the use of antihypertensives and statins. Even in the US, you can get a 30-day supply of lisinopril for $3.75, and you'd expect this to reduce the above patient's SBP by <a href=\"https://pubmed.ncbi.nlm.nih.gov/2442549/#:~:text=When%20lisinopril%20is%20given%20once,hyperglycemia%2C%20hyperuricemia%2C%20or%20hypercholesterolemia\">17-23 mm Hg</a>—a 3-4x greater reduction than you'd see with reduced salt consumption. &nbsp;<br><br>5) Of course, health care costs much more than just the cost of medications. But if you want a policy solution, I'm inclined to think that a better intervention would involve widespread population BP screening and incentivizing providers to prescribe (and patients to take) antihypertensives. <a href=\"https://www.nejm.org/doi/full/10.1056/NEJMoa2208275\">Polypills</a>—which include, e.g., antihypertensives, aspirin, and statins—also look really promising and do more than just reduce hypertension, although pharmaceutical companies have little incentive to make these. So I'd also be eager to see policy solutions aimed at making polypills more widely available.</p>", "parentCommentId": null, "user": null}, {"_id": "A6cqzzeN3QvzdGyPt", "postedAt": "2022-11-23T05:13:18.533Z", "postId": "G3DJ2qsZiZjdvmgSv", "htmlBody": "<p>Thanks for the feedback!<br><br>(1) My understanding is that literal packs/shakers of salt sold in supermarkets would not be exempt from the sodium tax. But that raises more dramatic political problems (e.g. at a $0.3 per mg tax, that increases a 500g packet of salt by 100x), and I presume the per mg tax on literal raw salt would have to be far lower. In general, I do agree that substitution with home food is a worry, though there will also be frictions (i.e. not perfect substitutes because of the social element, time needed to cook, etc).<br><br>(2) I'm not sure if this is a significant concern - it depends on your frame of reference, and one could easily argue the opposite (e.g. more aggressive sin taxes normalizes them/shifts the overton window, so even if the extreme version gets rejected, people see the more conventional ones like on tobacco and alcohol as reasonable by comparison). In general, I'm not sure if we have strong reason to believe one way or another.</p><p>(3) I think I'm fairly deferential to the scientific consensus in this area, which seems strong - it's something I'll definitely look more closely into via expert intervews.<br><br>(4) &amp; (5) Generally, direct delivery (whether of medication or general checkups/treatments) is a lot more expensive due to (a) actually requiring ongoing resources, and (b) counterfactual costliness, for an EA charity. I agree that they could be promising, but in the context of a shallow review I made the call to focus on what seemed to be the most impactful solution - I could be wrong!</p>", "parentCommentId": "ig5yzk6Nxfn7BTqiu", "user": {"username": "Joel Tan"}}, {"_id": "zwvNhYCa5yX5wxmtD", "postedAt": "2022-11-23T05:18:07.479Z", "postId": "G3DJ2qsZiZjdvmgSv", "htmlBody": "<p>Agreed that the linear vs non-linear issue is a major outstanding issue. My rough sense now is that you capture more of the benefits at higher levels of blood pressure (less so at lower levels/for healthier people) - so diminishing returns - but in general I don't have a good answer and it's something I'll have to get a better sense of via expert interviews.&nbsp;</p>", "parentCommentId": "7nC98HAkeRmbTZche", "user": {"username": "Joel Tan"}}, {"_id": "KtyZ5dphspFtCyeGw", "postedAt": "2022-11-23T05:22:27.293Z", "postId": "G3DJ2qsZiZjdvmgSv", "htmlBody": "<p>Definitely agreed that more advanced modelling has to take into account substitution into sugar - I believe an empirical study in NZ found substitution into sugar, while others found the fat/salt/sugar correlation in food to be high enough that it's actually benefit. Will take a far closer look at this at the deeper research stages!</p>", "parentCommentId": "j2GnEpWogdL4BSxnn", "user": {"username": "Joel Tan"}}, {"_id": "AkBsBRXDadHp3oXPy", "postedAt": "2022-11-23T05:36:33.440Z", "postId": "G3DJ2qsZiZjdvmgSv", "htmlBody": "<p>(1) &amp; (2) The Cochrane reviews/GBD results (e.g. <a href=\"https://www.bmj.com/content/346/bmj.f1325\">https://www.bmj.com/content/346/bmj.f1325</a> on sodium/hypertension and <a href=\"https://jamanetwork.com/journals/jama/fullarticle/2596292\">https://jamanetwork.com/journals/jama/fullarticle/2596292</a> on hypertension/DALYs) and the scientific consensus more generally seems fairly compelling to be, and while I wouldn't rule out all this being wrong (e.g. the saturated fat issue), it seems fairly reasonable/prudent to deprioritize research into this area of uncertainty relative to others.<br><br>(3) Taxation is highly effective, because if affects massive numbers of people are low to no additional counterfactual cost. CEAs that I've run myself (or that <a href=\"https://www.charityentrepreneurship.com/research\">Charity Entrepreneurship</a> has done) on tobacco/alcohol taxation, plus the extremely strong underlying epidemiological/economic research on the price elasticity of demand for tobacco/alcohol, all reinforces this point.<br><br>I'm fairly sympathetic to the freedom of choice argument. Quick calculations I've done on this area suggest that under fairly plausible moral weights of freedom to smoke/drink etc, (a) it's welfare negative to legally ban alcohol/smoking (even leaving aside the black market effects and assuming these taxes work perfectly, which of course they won't); however (b) aggressive taxes while keeping the product legal generally pass the cost-benefit analysis test. See <a href=\"https://docs.google.com/document/d/1j67pOUpC5vhC1-H516PAj2-4Fvm5rxJhZNeBVav3kik/edit\">CEARCH's evaluative framework</a> for our treatment of moral weights for freedom, or <a href=\"https://docs.google.com/spreadsheets/d/1Le22BVZOLkpNgYZI8ytXtYfUETQjrr3L/edit#gid=1928628582\">examples</a> of BOTECs/CEAs where tax policies are evaluated based on both health and freedom considerations.</p>", "parentCommentId": "XhxxZEFFfpzPDCNkn", "user": {"username": "Joel Tan"}}, {"_id": "9urqwwdqRNue3AGoh", "postedAt": "2022-11-23T14:21:44.650Z", "postId": "G3DJ2qsZiZjdvmgSv", "htmlBody": "<p>oh cool! &nbsp;(Also I'm glad you proactively acknowledge the eg saturated fat)</p><p><strong>Also, are there risks to over-reduction in salt intake?</strong></p><p>Hmmmm. I'm suspicious is because it doesn't make any sense for anyone to decide what's best for me. (Sure, educate me instead, whatever.) (I'm particularly suspicious of this because of the discourse I've seen around proposed 'meat taxes', typically pedaled by people who think the climate and nutritional (and ethical) effects are far worse than I think they are. So I'm worried about the same thing here.)</p>", "parentCommentId": "AkBsBRXDadHp3oXPy", "user": {"username": "ChrisLakin"}}, {"_id": "nyCCgJ7LdJntJrWfz", "postedAt": "2023-02-06T11:55:53.300Z", "postId": "G3DJ2qsZiZjdvmgSv", "htmlBody": "<p>\"Public Health England has estimated that 85% of the salt people ingest is already in food at the point of purchase and consumers only add the other 15% during cooking or at the table.\"</p><p>https://www.theguardian.com/society/2022/jun/21/uk-needs-to-tax-salt-in-the-same-way-it-does-sugar-says-heart-charity</p><p>Anecdotally, people add less salt to the food they cook themselves than is added to processed foods in the factory. If this is true, even if people do 'top up' salt levels in their food, they will likely still end up with less salt.</p><p>Plus there's salt in all sorts of crazy things like breakfast cereal. If that gets reduced, I don't think people are going to start salting their fruit loops.</p>", "parentCommentId": "ig5yzk6Nxfn7BTqiu", "user": {"username": "Stan Pinsent"}}]