[{"_id": "vRfr8uX3NLKhCWXkr", "postedAt": "2023-07-19T20:11:29.611Z", "postId": "G3noASLkNuXkdjEFA", "htmlBody": "<p>I feel like 'valuism' is redefining utilitarianism, and the contrasts to utilitarianism don't seem very convincing. For instance, you define valuism as noticing what you intrinsically value and trying to take effective action to increase that. This seems identical to a utilitarian whose utility function is composed of what they intrinsically value.<br><br>I think you might be defining utilitarianism such that they are only allowed to care about one thing? Which is sort of true, in that utilitarianism generally advocates converting everything into a common scale, but that common scale can measure multiple things. My utility function includes happiness, suffering, beauty, and curiosity as terms. This is totally fine, and a normal part of utilitarian discourse. Most utilitarians I've talked to are total preference utilitarians, I've never met a pure hedonistic utilitarian.</p><p>Likewise, I'm allowed to maintain my happiness and mental health as an instrumental goal for maximizing utility. This doesn't mean that utilitarianism is wrong, it just means we can't pretend we can be utility maximizing soul-less robots. I feel like there is a post on folks realizing this at least every few months. Which makes sense! It's an important realization!<br><br>Also, utilitarianism also doesn't need objective morality any more than any other moral philosophy, so I didn't understand your objection there.</p>", "parentCommentId": null, "user": {"username": "dan.pandori"}}, {"_id": "aunuPdmKxiesEuKDd", "postedAt": "2023-07-19T21:36:32.573Z", "postId": "G3noASLkNuXkdjEFA", "htmlBody": "<p>From the AI \"engineering\" perspective, values/valued states are \"rewards\" that the agent adds themselves in order to train (in RL style) their reasoning/planning network (i.e., generative model) to produce behaviours that are adaptive but also that they like and find interesting (aesthetics). This RL-style training happens during conscious reflection.</p>\n<p>Under this perspective, but also more generally, you cannot distinguish between intrinsic and instrumental values because intrinsic values are instrumental to each other, but also because there is nothing \"intrinsic\" about self-assigned reward labels. In the end, what matters is the generative model that is able to produce highly adaptive (and, ideally, interesting/beautiful) behaviours in a certain range of circumstances.</p>\n<p>I think you confusion about the ontological status of values is further corroborated by this phrase for the post: \"people are mostly guided by forces other than their intrinsic values [habits, pleasure, cultural norms]\". Values are not forces, but rather inferences about some features or one's own generative model (that help to \"train\" this very model in \"simulated runs\", i.e., conscious analysis of plans and reflections). However, the generative model itself is effectively the product of environmental influences, development, culture, physiology (pleasure, pain), etc. Thus, ultimately, values are not somehow distinct from all these \"forces\", but are indirectly (through the generative model) derived from these forces.</p>\n<p>Under the perspective described above, valuism appears to switch the ultimate objective (\"good\" behaviour) for \"optimisation of metrics\" (values). Thus, there is a risk of Goodharting. I also agree with dan.pandori who noted in another comment that valuism pretty much redefines utilitarianism, whose equivalent in AI engineering is RL.</p>\n<p>You may say that I suggest an infinite regress, because how \"good behaviour\" is determined, other than through \"values\"? Well, as I explained above, it couldn't be through \"values\", because values are our own creation within our own ontological/semiotic \"map\". Instead, there could be the following guides to \"good behaviour\":</p>\n<ul>\n<li>Good old adaptivity (survival) [roughly corresponds to so-called \"intrinsic value\" in expected free energy functional, under Active Inference]</li>\n<li>Natural ethics, if exists (see the discussion here: <a href=\"https://www.lesswrong.com/posts/3BPuuNDavJ2drKvGK/scientism-vs-people#The_role_of_philosophy_in_human_activity\">https://www.lesswrong.com/posts/3BPuuNDavJ2drKvGK/scientism-vs-people#The_role_of_philosophy_in_human_activity</a>). If \"truly\" scale-free ethics couldn't be derived from basic physics alone, there is still evolutionary/game-theoreric/social/group stage on which we can look for an \"optimal\" ethics arrangement of agent's behaviour (and, therefore, values that should help to train these behaviours), whose \"optimality\", in turn, is derived either from adaptivity or aesthetics on the higher system level (i.e., group level).</li>\n<li>Aesthetics and interestingness: there are objective, information-theoretic ways to measure these, see Schmidhuber's works. Also, this roughly corresponds to \"epistemic value\" in expected free energy functional under Active Inference.</li>\n</ul>\n<p>If the \"ultimate\" objective is the physical behaviour itself (happening in the real world), not abstract \"values\" (which appear only in agent's mind), I think Valuism could be cast as any philosophy that emphasises creation of a \"good life\" and \"right action\", such as Stoicism, plus some extra emphasis on reflection and meta-awareness, albeit I think Stoicism already puts significant emphasis on these.</p>\n", "parentCommentId": null, "user": {"username": "Roman Leventov"}}, {"_id": "SyXDTbDgqgxPYXEyn", "postedAt": "2023-07-19T21:52:32.844Z", "postId": "G3noASLkNuXkdjEFA", "htmlBody": "<p>You're the one who's redefining utilitarianism- which is commonly defined as maximization of happiness and well-being of conscious beings. You can consider integrating other terminal values into what you'd like to do, but you're not really discussing utilitarianism at that point, as it's commonly used. For instance, Greenberg points to truth as a potential terminal value, which would be at odds with utilitarianism as it's typically used.</p>\n<p>I think Singer is a hedonic utilitarian for what it's worth, and I think I subscribe to it while acknowledging that weighing the degrees of positive and negatively subjective experiences of many kinds is daunting.</p>\n<p>As for having other instrumental values (which is why I don't really think the \"burnout\" argument is very good as against utilitarianism, I agree with you on that one.</p>\n", "parentCommentId": "vRfr8uX3NLKhCWXkr", "user": {"username": "Brad West"}}, {"_id": "DkqQkSYAzk7YkABQy", "postedAt": "2023-07-19T22:56:47.263Z", "postId": "G3noASLkNuXkdjEFA", "htmlBody": "<p>I agree that 'utilitarianism' often gets elided into meaning a variation of hedonic utilitarianism. I would like to hold philosophical discourse to a higher bar. In particular, once someone mentions hedonic utilitarianism, I'm going to hold them to the standard of separating out hedonic utilitarianism and preference utilitarianism, for example.<br><br>I agree hedonic utilitarians exist. I'm just saying the utilitarians I've talked to always add more terms than pleasure and suffering to their utility function. Most are preference utilitarians.</p>", "parentCommentId": "SyXDTbDgqgxPYXEyn", "user": {"username": "dan.pandori"}}, {"_id": "s8njw7dSBFegfAGZJ", "postedAt": "2023-07-24T03:02:18.376Z", "postId": "G3noASLkNuXkdjEFA", "htmlBody": "<p>Preference utilitarianism and valuism don't have much in common.</p><p>Preference utilitarianism: maximize the interests/preferences of all beings impartially.</p><p>First, preferences and intrinsic values are not the same thing. For instance, you may have a preference to eat Cheetos over eating nachos, but that doesn't mean you intrinsically value eating Cheetos or that eating Cheetos necessarily gets you more of what you intrinsically value than eating nachos will. Human choice is driven by a lot of factors other than just intrinsic values (though intrinsic values play a role).</p><p>Second, preference utilitarianism is not about your own preferences, it's about the preferences of all beings impartially.</p>", "parentCommentId": "DkqQkSYAzk7YkABQy", "user": {"username": "spencerg"}}, {"_id": "BGwoRyqht4dKJtkXA", "postedAt": "2023-07-24T03:06:41.166Z", "postId": "G3noASLkNuXkdjEFA", "htmlBody": "<p>The way you define values in your comment:</p><p>\"From the AI \"engineering\" perspective, values/valued states are \"rewards\" that the agent adds themselves in order to train (in RL style) their reasoning/planning network (i.e., generative model) to produce behaviours that are adaptive but also that they like and find interesting (aesthetics). This RL-style training happens during conscious reflection.\"</p><p>is just something different than what I'm talking about in my post when I use the phrase \"intrinsic values.\"&nbsp;</p><p>From what I can tell, you seem to be arguing:</p><p>&nbsp;</p><p>[paraphrasing] \"In this one line of work, we define values this way\", and then jumping from there to \"therefore, you are misunderstanding values,\" when actually I think you're just using the phrase to mean something different than I'm using it to mean.&nbsp;</p>", "parentCommentId": "aunuPdmKxiesEuKDd", "user": {"username": "spencerg"}}, {"_id": "BEWYE2AC4ZnHkncw7", "postedAt": "2023-07-24T05:39:30.386Z", "postId": "G3noASLkNuXkdjEFA", "htmlBody": "<p>Hey Spencer, really enjoyed these posts. I found it insightful to mentally separate out actions related to mimicry, instinctive behavior, habits, and other sources from actions actually connected to intrinsic values, loosely defined as values that stand the test of thought experiment. On a personal level, the simplicity and lightness of the philosophy resonate with me.&nbsp;</p><p>I'm curious about the downsides of valuism. In your opinion, what are some good critiques against valuism? My initial thoughts:&nbsp;</p><ul><li>It's a subjective, individual life philosophy that doesn't set a stake in any area:&nbsp;<ul><li>This might be a feature given the diversity of minds and the difficulty in 100% proving aspects of moral realism.&nbsp;</li><li>It is interesting and potentially concerning that a valuist can be anything, eg a terrible person that would like to make the world suffer. The focus on effectiveness in this context isn't ideal.&nbsp;</li></ul></li><li>In a similar vein, it's plausible that spreading valuism can lead to unintended outcomes because of the focus on individualism:&nbsp;<ul><li>Culture, mimicry, etc may lead to better collective and societal outcomes in some contexts. Valuism emphasizes personal interpretations of value which can be conflicting between individuals and societies.&nbsp;</li></ul></li></ul><p>Other than these angles - what would be good reasons for a person to explicitly say they're not a valuist? It seems daunting for someone to disclaim pursuing intrinsic values, so I'd like to understand a plausible situation better.&nbsp;</p>", "parentCommentId": null, "user": {"username": "linengrass"}}]