[{"_id": "nDuhjpAQeEKff9oRf", "postedAt": "2022-09-07T13:32:41.020Z", "postId": "G6EWTrArPDf74sr3S", "htmlBody": "<p>I think you mean 'moral realism' when you write 'non-naturalism'? Note that Rawlette, for example, is a <i>naturalist</i> moral realist. (According to her <a href=\"https://www.utilitarianism.net/guest-essays/precis-of-the-feeling-of-value#analytic-hedonism\">analytic hedonism</a>, normative properties are conceptually reducible to the natural properties of pleasure and pain.)</p>", "parentCommentId": null, "user": {"username": "RYC"}}, {"_id": "YichM65S4ttgLz99m", "postedAt": "2022-09-07T15:03:59.639Z", "postId": "G6EWTrArPDf74sr3S", "htmlBody": "<p><a href=\"https://forum.effectivealtruism.org/posts/oXhhxeQMBjJriMjb8/dismantling-hedonism-inspired-moral-realism?commentId=ehftbbCNdR4QshHpA#comments\">I was recently wrong about the same thing</a>. I think her position has some similarities with non-naturalism, but it's true that she labels it as naturalism.<br><br>&nbsp;</p>", "parentCommentId": "nDuhjpAQeEKff9oRf", "user": {"username": "Lukas_Gloor"}}, {"_id": "rypYCFn6M99RSohXC", "postedAt": "2022-09-07T15:17:31.128Z", "postId": "G6EWTrArPDf74sr3S", "htmlBody": "<p>Ah, thanks. I've removed the mention of Hewitt-Rawlette from footnote #2.</p>\n<p>I do mean non-naturalism for the rest. If that still seems confused or wrong to you, please do let me know.</p>\n<p>(I'm not sure if I agree that Hewitt-Rawlette is as naturalistic as she thinks she is, but I've not gone deep enough to argue against her self-categorisation.)</p>\n", "parentCommentId": "nDuhjpAQeEKff9oRf", "user": {"username": "Peter_Hartree"}}, {"_id": "nebZmZmiGeYiZamvE", "postedAt": "2022-09-07T15:31:18.503Z", "postId": "G6EWTrArPDf74sr3S", "htmlBody": "<p>There is a bit of a terminology problem with \"moral realism\" vs \"non-naturalism\".</p>\n<p>As I understanding things:</p>\n<ol>\n<li>\n<p>\"Moral realism\" usually just means that moral beliefs can be true or false, and at least some of them are true. That leaves lots options for explaining what the <em>truth conditions</em> of these beliefs are.</p>\n</li>\n<li>\n<p>Naturalistic moral realism says that the truth  conditions of moral statements are reducible (or at least based on) natural properties.</p>\n</li>\n<li>\n<p>Non-naturalistic moral realism says the truth conditions are not natural properties.</p>\n</li>\n<li>\n<p>And then we have to decide what counts as natural properties. There's a risk that people just draw boundaries differently here and then argue definitions. Or that they say \"all pictures of the world that includes uncontingent moral properties is basically religious, and any that doesn't is secular\".</p>\n</li>\n<li>\n<p>And finally there's the question of mind-independence. Are the natural properties relational properties that involve all possible minds, or at least some minds? Or are they independent of all minds?</p>\n</li>\n</ol>\n", "parentCommentId": "rypYCFn6M99RSohXC", "user": {"username": "Peter_Hartree"}}, {"_id": "xGA6FM5N6XXaxEAkS", "postedAt": "2022-09-07T15:33:03.095Z", "postId": "G6EWTrArPDf74sr3S", "htmlBody": "<p>I read Williams as a naturalistic moral realist with a pragmatic theory of truth (i.e. we call true those beliefs which \"work well\" for us, where \"working well\" is ultimately about evolutionary fitness).</p>\n", "parentCommentId": "nebZmZmiGeYiZamvE", "user": {"username": "Peter_Hartree"}}, {"_id": "wCmrvs3vNWKHMPMsQ", "postedAt": "2022-09-07T17:24:03.897Z", "postId": "G6EWTrArPDf74sr3S", "htmlBody": "<p>So the terminology here gets used differently by different people, but the view that moral statements can be true or false is usually called \"cognitivism\", not \"realism\" (though there definitely are people who use \"realism\" for that view). My own personal preference is to define realism as cognitivism plus the metaphysical claim that moral properties are mind-independent (i.e. not grounded in facts about anyone's moral beliefs or attitudes).</p>\n", "parentCommentId": "nebZmZmiGeYiZamvE", "user": {"username": "Ikaxas"}}, {"_id": "TaAxnxEYy4YT2Ct7o", "postedAt": "2022-09-07T18:29:55.128Z", "postId": "G6EWTrArPDf74sr3S", "htmlBody": "<blockquote><p>\"Moral realism\" usually just means that moral beliefs can be true or false. That leaves lots options for explaining what the <i>truth conditions</i> of these beliefs are.</p></blockquote><p>Moral realism is often (though not always) taken to, by definition, also include the claim that at least <i>some </i>moral beliefs are true – e.g. <a href=\"https://plato.stanford.edu/entries/moral-realism/\">here in the Stanford Encyclopedia of Philosophy</a>. A less ambiguous way to refer to <i>just </i>the view that moral beliefs can be true or false is <a href=\"https://plato.stanford.edu/entries/moral-cognitivism/\">'moral cognitivism'</a>, as also mentioned <a href=\"https://forum.effectivealtruism.org/posts/G6EWTrArPDf74sr3S/bernard-williams-ethics-and-the-limits-of-impartiality?commentId=wCmrvs3vNWKHMPMsQ\">here</a>.</p><p>This is to <i>exclude </i>from moral realism the view known as <a href=\"https://plato.stanford.edu/entries/moral-anti-realism/#ErroTheo\">'error theory'</a>, which says that moral beliefs are the sorts of things that can have truth values but that all of them are false.</p><p>[I'm using \"belief\" in a loose sense in this comment, on which it is not just true by definition that a belief can be true or false. People using 'belief' in the latter sense would describe the noncognitivist view as saying that those things that appear to be moral beliefs in fact aren't beliefs at all.]</p>", "parentCommentId": "nebZmZmiGeYiZamvE", "user": {"username": "Max_Daniel"}}, {"_id": "RpCx5GFuuZv3mcs5d", "postedAt": "2022-09-07T20:03:23.890Z", "postId": "G6EWTrArPDf74sr3S", "htmlBody": "<p>Thanks. I've edited (1) to exclude error theory.</p>\n<p>(This is a bit tricky because one might be a moral realist who thinks all our current beliefs are false, but we might get some right at some point. But anyway.)</p>\n", "parentCommentId": "TaAxnxEYy4YT2Ct7o", "user": {"username": "Peter_Hartree"}}]