[{"_id": "Y2dqjv6gyR9sKmPBF", "postedAt": "2022-11-13T13:12:23.274Z", "postId": "G9RHEcHMLguGJY7uP", "htmlBody": "<p>Hmmmmmm....probable yearly cost of a decent Internal Audit Team:</p><ul><li>Chief Audit Executive: 100,000 USD to 150,000 USD</li><li>Two staff internal auditors: 45,000 to 65,000 each</li><li>Opex: 40,000 usd approx.</li></ul><p>Roughly 320,000 USD per year...to ensure that controls are reviewed and assessments are made to EA organizations. I don't know how many are there but let's say its 5 institutions that it will review each year then there is a 64,000 USD per company additional cost</p><p>&nbsp;</p><p>Considering the funding that EA organizations get - 64K USD is like .5% to 3% of the yearly funding. Investing in this will very much improve the operations and safeguard from large scale errors and fraud.&nbsp;</p><p>&nbsp;</p><p>Obviously these are just estimates, but I'm trying to literally make the numbers much more easier for people to view or understand as most are not familiar as to approach the problem of creating teams from cost benefit perspective.</p><p>&nbsp;</p><p>Fraud and error will always be a part of money allocation - it just is and have seen this personally as I have worked across the world where either big or small companies take their own inventive ways on how to handle the problem of money. Unfortunately our human nature seems so prone to bad ideas that the humanity in us just leaves us when there is a gap that presents...this is where fraud starts.</p>", "parentCommentId": null, "user": {"username": "Miguel"}}, {"_id": "Eppq4fJJNw4wq3EGH", "postedAt": "2022-11-13T13:32:03.981Z", "postId": "G9RHEcHMLguGJY7uP", "htmlBody": "<p>Btw, I posted this yesterday where <a href=\"https://forum.effectivealtruism.org/posts/PkFenL3DcEJDjERwY/ftx-prob-related-strongly-recommending-creating-an-internal\">Creating An Internal Audit Committee that will Periodically Assess EA Organizations, Its Objectives And Processes Based on IIA Standards</a> which is a call improvements for to governance that you might be interested in reading too.</p>", "parentCommentId": "Y2dqjv6gyR9sKmPBF", "user": {"username": "Miguel"}}]