[{"_id": "cRM2sEHGJbjYEcvto", "postedAt": "2024-02-20T23:52:11.015Z", "postId": "GaCRw4fj9FEhQxnQ4", "htmlBody": "<p>I’d imagine the natural functions of city and national groups to vary substantially.</p>\n", "parentCommentId": null, "user": {"username": "casebash"}}, {"_id": "txnqzkBSxzxzcJmc3", "postedAt": "2024-02-21T11:17:42.836Z", "postId": "GaCRw4fj9FEhQxnQ4", "htmlBody": "<p>Has it been considered to use MEAROs strategically to address EA causes? I am thinking e.g.:<br>-EA Taiwan for semiconductor work on AI safety<br>-EA in the Global South for local talent pipelines where interventions are delivered (I think EA Nigeria has posted about this)<br>-Probably other causes that have particular geographical focal points, e.g. EA China or similar<br><br>I am sure people have thought of this, but it struck me as a potential use of MEAROs that naively seem high impact.<br><br>Excellent post, it offers a really nice overview!</p>", "parentCommentId": null, "user": {"username": "Ulrik Horn"}}, {"_id": "pA7yMSnb7RE4oRjGJ", "postedAt": "2024-02-21T14:54:43.317Z", "postId": "GaCRw4fj9FEhQxnQ4", "htmlBody": "<p><strong>Executive summary</strong>: The post introduces Meta Effective Altruism Regional Organizations (MEAROs), which support EA within geographical regions, and argues they are currently underutilized despite significant potential for impact.</p><p><strong>Key points</strong>:</p><ol><li>MEAROs promote EA within specific regions through translation, media, events, advising, infrastructure, and more.</li><li>MEAROs provide unique value but are early-stage, small, and underfunded, reaching just a fraction of potential.</li><li>With more funding, MEAROs could greatly expand current functions and pioneer new ones like research, education, corporate partnerships.</li><li>The post aims to define MEAROs, outline their value, and prompt discussion on better utilizing them going forward.</li></ol><p>&nbsp;</p><p>&nbsp;</p><p><i>This comment was auto-generated by the EA Forum Team. Feel free to point out issues with this summary by replying to the comment, and</i><a href=\"https://forum.effectivealtruism.org/contact\"><i>&nbsp;<u>contact us</u></i></a><i> if you have feedback.</i></p>", "parentCommentId": null, "user": {"username": "SummaryBot"}}, {"_id": "dt7LnTcYq6uurbGgH", "postedAt": "2024-02-22T17:57:59.397Z", "postId": "GaCRw4fj9FEhQxnQ4", "htmlBody": "<p>I think that's a common intuition! I'm curious if there were particular areas covered (or omitted) from this post that you see as more clearly the natural function of one versus the other.<br><br>I'll note that a couple factors seem to blur the lines between city and national MEARO functions:</p><p>-Size of region (e.g. NYC's population is about 8 million, Norway's is about 5.5 million)<br>-Composition of MEAROs in the area (e.g. many national MEAROs end up with a home base city or grew out of a city MEARO, some city MEAROs are in countries without a national MEARO)<br><br>I could see this looking very different if more resources went toward assessing and intentionally developing the global MEARO landscape in years to come.</p>", "parentCommentId": "cRM2sEHGJbjYEcvto", "user": {"username": "Rockwell Schwartz"}}, {"_id": "PME4ym2PPeEtZGMfP", "postedAt": "2024-02-25T16:18:09.390Z", "postId": "GaCRw4fj9FEhQxnQ4", "htmlBody": "<p>Thanks for the write-up! I agree with Chris that the natural functions can vary substantially, and Ulrik's comment shows how (another example could be a policy focus in EA DC and EA Brussels). But there are for sure many universal things like the ones you mentioned.</p>\n<p>My main nitpick is with the term. I don't see why \"local EA groups\" isn't good enough. There are already so many abbreviations within the EA movement that it gets overwhelming. If you read \"MEAROs\" you have no idea what you're talking about without prior context, while \"local EA groups\" is very clear and not even that long. The term covers points 1 and 2 of your definition (\"local\" means it's regional and \"EA group\" already signals it's meta). Differentiating local groups with and without an organizational structure doesn't seem particularly useful. I assume most unstructured local EA groups aspire to get such a structure, and many of the present and future values listed also apply to them.</p>\n", "parentCommentId": null, "user": {"username": "Jeroen_W"}}, {"_id": "KPtgHh64C5ouRkjZR", "postedAt": "2024-03-05T18:54:31.474Z", "postId": "GaCRw4fj9FEhQxnQ4", "htmlBody": "<p>I'm ambivalent about jargon; strongly pro when it seems sufficiently useful, but opposed to superfluous usage. One benefit I can see for MEARO is that it isn't nominatively restricted to community building like most \"local EA groups.\"&nbsp;</p><p>I recently attended a talk at EAGxLatAm by <a href=\"https://forum.effectivealtruism.org/topics/doebem\">Doebem</a>, a Brazilian based and locally focused equivalent of GiveWell, that made a decent case for the application of EA principles to \"think global, act local.\" Their work is very distinct from EA Brazil, but it falls solidly into regional and meta EA, and I think there is strong potential for other similar orgs that would work tightly with local CB groups but have different focus.</p>", "parentCommentId": "PME4ym2PPeEtZGMfP", "user": {"username": "Arthur Malone"}}]