[{"_id": "Cifk9hjqnjfbA3PMv", "postedAt": "2024-03-21T09:27:50.915Z", "postId": "Gazt9dKDD4isGcupy", "htmlBody": "<p><strong>\"If boosting economic growth&nbsp;is the best proxy\" to future welfare...</strong></p><p>I feel like this is a real crux here, because to me it seems counterintuitive to the point of absurd when applied to high income countries, but I'm always trying to keep an open mind. I can understand how economic growth could be a proxy in a low income country as welfare is likely to increase as a poor country gets richer.<br><br>It doesn't seem to me likely that high economic growth in an already rich country would increase welfare very much at all. Can you point me to a resource which steelman's this idea?</p>", "parentCommentId": null, "user": {"username": "NickLaing"}}, {"_id": "Mezo6KiZkcDnCjmgt", "postedAt": "2024-03-21T10:19:36.137Z", "postId": "Gazt9dKDD4isGcupy", "htmlBody": "<p>Thanks for the comment and keeping an open mind, Nick!</p><p>Just for reference, I share your intuition that one should not be focussing on economic growth:</p><blockquote><p>I guess improving nearterm welfare is a better proxy [to increase future welfare] than boosting economic growth.</p></blockquote><p>However:</p><blockquote><p>If improving nearterm welfare is the best proxy to increase future welfare, helping animals seems better than saving human lives in low income countries. I&nbsp;<a href=\"https://forum.effectivealtruism.org/posts/hXH2KbPK29zxKBRGC/linkpost-prospective-cost-effectiveness-of-farmed-fish?commentId=RprsxaFw3dbzjxFwJ\"><u>estimate</u></a> corporate campaigns for chicken welfare increase nearterm welfare 1.37 k times as cost-effectively as&nbsp;<a href=\"https://www.givewell.org/charities/top-charities\"><u>GiveWell’s top charities</u></a>, and I am not confident that saving human lives is good/bad accounting for effects on animals<span class=\"footnote-reference\" data-footnote-reference=\"\" data-footnote-index=\"19\" data-footnote-id=\"xe3b047b2ye\" role=\"doc-noteref\" id=\"fnrefxe3b047b2ye\"><sup><a href=\"#fnxe3b047b2ye\">[19]</a></sup></span>.</p></blockquote><hr><blockquote><p>It doesn't seem to me likely that high economic growth in an already rich country would increase welfare very much at all. Can you point me to a resource which steelman's this idea?</p></blockquote><p>Intuitively, I would say doubling the income of everyone in high income countries would lead to greater nearterm human welfare (although it may decrease overall nearterm welfare due to increasing consumption of factory-farmed animals). However, I think the paper <a href=\"https://www.pnas.org/doi/10.1073/pnas.2208661120\">Income and emotional well-being: A conflict resolved</a> is one of the best resources on this question. Here is the abstract:</p><blockquote><p>Do larger incomes make people happier? Two authors of the present paper have published contradictory answers. Using dichotomous questions about the preceding day, [Kahneman and Deaton,&nbsp;Proc. Natl. Acad. Sci. U.S.A.&nbsp;<strong>107</strong>, 16489–16493 (2010)] reported a flattening pattern: happiness increased steadily with log(income) up to a threshold and then plateaued. Using experience sampling with a continuous scale, [Killingsworth, Proc. Natl. Acad. Sci. U.S.A.&nbsp;<strong>118</strong>, e2016976118 (2021)] reported a linear-log pattern in which average happiness rose consistently with log(income). We engaged in an adversarial collaboration to search for a coherent interpretation of both studies. A reanalysis of Killingsworth’s experienced sampling data confirmed the flattening pattern only for the least happy people. Happiness increases steadily with log(income) among happier people, and even accelerates in the happiest group. Complementary nonlinearities contribute to the overall linear-log relationship. We then explain why Kahneman and Deaton overstated the flattening pattern and why Killingsworth failed to find it. We suggest that Kahneman&nbsp;and Deaton might have reached the correct conclusion if they had described their results in terms of unhappiness rather than happiness; their measures could not discriminate among degrees of happiness because of a ceiling effect. The authors of both studies failed to anticipate that increased income is associated with systematic changes in the shape of the happiness distribution. The mislabeling of the dependent variable and the incorrect assumption of homogeneity were consequences of practices that are standard in social science but should be questioned more often. We flag the benefits of adversarial collaboration.</p></blockquote><p>Across countries, self-reported life satisfaction <a href=\"https://ourworldindata.org/grapher/gdp-vs-happiness\">is</a> correlated with real GDP per capita even for high income countries, which <a href=\"https://en.wikipedia.org/wiki/World_Bank_high-income_economy\">have</a> a gross national income per capita of at least 13.8 k 2022-$:</p><figure class=\"image\"><img src=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/Mezo6KiZkcDnCjmgt/iw0irjksbkf9k3bt1x98\" srcset=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/Mezo6KiZkcDnCjmgt/snlkwlcns3m2mos4kf9n 330w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/Mezo6KiZkcDnCjmgt/j9u9hy50veietdgfv4fu 660w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/Mezo6KiZkcDnCjmgt/k09ctvmhcte5fjx0ru5c 990w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/Mezo6KiZkcDnCjmgt/qesrk96xgylxxe4jd2ak 1320w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/Mezo6KiZkcDnCjmgt/x69fmccw2mw6vmbpzl8w 1650w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/Mezo6KiZkcDnCjmgt/uv6jcgqdzzitvzbsbfpz 1980w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/Mezo6KiZkcDnCjmgt/p1aye273klmj9njo11kk 2310w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/Mezo6KiZkcDnCjmgt/itwc4o35fnx1hkkovusx 2640w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/Mezo6KiZkcDnCjmgt/iuzf7pmuc6nvetuqzhms 2970w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/Mezo6KiZkcDnCjmgt/dsijernowpwg8pweuar9 3240w\"></figure><p>Zooming out, you may want to have a look at some of the links here:</p><blockquote><p>The above does not capture all the benefits of saving human lives due to <a href=\"https://forum.effectivealtruism.org/topics/indirect-long-term-effects\">indirect longterm effects</a>. Based on an <a href=\"https://en.wikipedia.org/wiki/Reference_class_forecasting\">outside view</a>&nbsp;perspective, one can say&nbsp;these (u_1) are roughly proportional to the <a href=\"https://forum.effectivealtruism.org/posts/Doa69pezbZBqrcucs/shaping-humanity-s-longterm-trajectory\">advancement</a>&nbsp;in time of the trajectory of the global real GDP<span class=\"footnote-reference\" data-footnote-reference=\"\" data-footnote-index=\"3\" data-footnote-id=\"yus22drveq\" role=\"doc-noteref\" id=\"fnrefyus22drveq\"><sup><a href=\"#fnyus22drveq\">[3]</a></sup></span>, as <a href=\"https://ourworldindata.org/economic-growth\">economic growth</a>&nbsp;<a href=\"https://ourworldindata.org/economic-growth#all-charts\">is</a>&nbsp;one of the best markers of progress<span class=\"footnote-reference\" data-footnote-reference=\"\" data-footnote-index=\"4\" data-footnote-id=\"h1i9sjmgjb7\" role=\"doc-noteref\" id=\"fnrefh1i9sjmgjb7\"><sup><a href=\"#fnh1i9sjmgjb7\">[4]</a></sup></span>, although arguably still far from ideal. Such advancement decreases <a href=\"https://nickbostrom.com/astronomical/waste\">astronomical waste</a>, <a href=\"https://globalprioritiesinstitute.org/leopold-aschenbrenner-existential-risk-and-growth/\">may</a>&nbsp;decrease extinction risk, and&nbsp;<a href=\"https://reflectivedisequilibrium.blogspot.com/2018/10/flow-through-effects-of-saving-life.html\">is</a>&nbsp;arguably approximately proportional to the real GDP per capita of the country where the life is saved times&nbsp;the life expectancy at birth there<span class=\"footnote-reference\" data-footnote-reference=\"\" data-footnote-index=\"5\" data-footnote-id=\"kxxhntkm1t\" role=\"doc-noteref\" id=\"fnrefkxxhntkm1t\"><sup><a href=\"#fnkxxhntkm1t\">[5]</a></sup></span>, which I suggested above is proportional to ln(r/r_0).</p></blockquote><p>In one of the footnotes, I mention Tyler Cowen’s book <a href=\"https://web.archive.org/web/20170722055801/https://medium.com/stubborn-attachments/stubborn-attachments-full-text-8fc946b694d\">Stubborn Attachments</a>, which was <a href=\"https://80000hours.org/podcast/episodes/tyler-cowen-stubborn-attachments/\">discussed</a>&nbsp;on The 80,000 Hours Podcast.</p>", "parentCommentId": "Cifk9hjqnjfbA3PMv", "user": {"username": "vascoamaralgrilo"}}, {"_id": "SnkqX2kvf2n7nsGTx", "postedAt": "2024-03-21T12:56:50.871Z", "postId": "Gazt9dKDD4isGcupy", "htmlBody": "<p>Thanks for the interesting post - definitely gives one some things to think about!&nbsp;</p><p>Here’s another point to consider: depending on the costs, one of the most effective interventions may be to raise the self-esteem levels of people in high income countries. Note: I’m operating under a model in which self-esteem is determined primarily by personal responsibility level, first for one’s emotions and then one’s actions (see <a href=\"https://www.amazon.com/Six-Pillars-Self-Esteem-Nathaniel-Branden-ebook/dp/B007JK9BAY/ref=sr_1_1?crid=28LOYRTO8Q319&amp;dib=eyJ2IjoiMSJ9.BAfkQ-KoxoY35H_-enprmBvL0NL2L-ngKHF1nltB6qx2IOcFvR4afG8YbyDOQ3aXx2q_y6LC06BQcLVO-10KKjx835hV4hMa8XlYiySEkcRCI6EavnBjQjgFhEyeu6tH_kEziqyiKvOz4zyvfqOI2M53hr2GTazL84nb94EWX6h05NBY4AJt3OoMz_eo-fISbEur8AI6UYupUgZJYNNyC2IzACtl3DNLBhJgfTHTRbE.kM2rsW8MqBa8_JfBkb3MO_t56Iwzh6jZvQjPhSyLFi0&amp;dib_tag=se&amp;keywords=six+pillars+of+self+esteem&amp;qid=1711024490&amp;sprefix=six+pilla%2Caps%2C94&amp;sr=8-1\">“The Six Pillars of Self-Esteem”</a> by N. Branden). Raising people’s self-esteem levels should raise their self-reported life satisfactions, and also likely have secondary effects on those they interact with. In addition, people who have higher self-esteem due to being more responsible are more likely to practice responsibility in terms of human and animal suffering (as by donating to causes and/or going vegetarian/vegan, with people from high income countries having more potential impact here). Of course, raising self-esteem levels in low income countries could also be quite beneficial - for instance, higher self-esteem people may be more of a driving force for raising health standards in their countries.</p>", "parentCommentId": null, "user": {"username": "Sean Sweeney"}}, {"_id": "eQ3nazkKrpRjcTXnN", "postedAt": "2024-03-21T13:25:18.897Z", "postId": "Gazt9dKDD4isGcupy", "htmlBody": "<p><strong>Executive summary:</strong> Saving human lives in high income countries may be better than in low income countries from the perspective of boosting economic growth, while helping animals may be better than saving human lives in low income countries from the perspective of improving near-term welfare.</p><p><strong>Key points:</strong></p><ol><li>The author's views on saving human lives have evolved over time, from rational egoism to now considering effects on animals and economic growth.</li><li>The cost-effectiveness of saving human lives depends on the benefits to the person saved (proportional to life satisfaction and life expectancy) and indirect long-term effects on economic growth (uncomfortable conclusion that lives in high income countries may be instrumentally more valuable).</li><li>It's unclear if saving human lives has a positive or negative impact on near-term animal welfare due to the \"meat-eater problem\" and potential effects on wild animals. The effect may be negative.</li><li>However, saving human lives, especially in high income countries, may decrease long-term animal suffering if it boosts economic growth and speeds up the end of factory farming.</li><li>If improving near-term welfare is the best proxy for increasing future welfare, then helping animals seems better than saving human lives in low income countries. But if boosting economic growth is the best proxy, then saving lives in high income countries seems better.</li><li>More research is needed on whether indirect long-term effects dominate and what the best proxies are for maximizing welfare. The author believes the effective altruism community may have prematurely converged on minimizing human disease burden.</li></ol><p>&nbsp;</p><p>&nbsp;</p><p><i>This comment was auto-generated by the EA Forum Team. Feel free to point out issues with this summary by replying to the comment, and</i><a href=\"https://forum.effectivealtruism.org/contact\"><i>&nbsp;<u>contact us</u></i></a><i> if you have feedback.</i></p>", "parentCommentId": null, "user": {"username": "SummaryBot"}}, {"_id": "hMu8b2eTmdDaiHDtg", "postedAt": "2024-03-21T13:36:39.128Z", "postId": "Gazt9dKDD4isGcupy", "htmlBody": "<p>Thanks for commenting, and welcome to the EA Forum, Sean! I wonder whether there are cost-effectiveness analyses of interventions aiming to raise self-esteem.</p>", "parentCommentId": "SnkqX2kvf2n7nsGTx", "user": {"username": "vascoamaralgrilo"}}, {"_id": "pAoAmsi43SLCRBEAv", "postedAt": "2024-03-21T13:59:16.057Z", "postId": "Gazt9dKDD4isGcupy", "htmlBody": "<p>Thanks. I don't know the answer to that, although a quick search didn't yield anything too promising. I don't believe the concept of self-esteem as being primarily about personal responsibility has really caught on, so perhaps it would be better to look for studies on interventions to raise personal responsibility.</p>", "parentCommentId": "hMu8b2eTmdDaiHDtg", "user": {"username": "Sean Sweeney"}}, {"_id": "tuYR2KiBA6AoNavEH", "postedAt": "2024-03-22T03:13:50.352Z", "postId": "Gazt9dKDD4isGcupy", "htmlBody": "<p>Thank you for this post, Vasco.&nbsp;<br><br>I'm really glad to see a post challenging what seems to be the status quo opinion of saving lives in cheapest countries is the best / 'most effective' thing to do. <i>(Perhaps there are more posts challenging this - I'm still new to the forum and haven't gone through the archives, but from what I've seen more generally, the saving lives most cheaply view seems to be fairly ubiquitous and I worry it's an overly simplistic way to look at things)</i><br><br>I tend to agree that focusing on cost to save a life is not necessarily the best proxy for effectiveness, and that considering WELLBY type metrics seems a very sensible thing to take into account.&nbsp;<br><br>I also think there's a bit of an under-consideration in common discourse of indirect effects. If you save a life in a rich country, does that sometimes have the potential to do more good overall because they might, post-intervention be in a better position to help others with donations/volunteering/high tax contribution? And if we only addressed what's espoused to be \"the most cost-effective\" - only the malaria net charities etc. and we ignore dealing with more expensive issues, we could make the issues we neglect exponentially worse and do more harm than good. It's not necessarily the case that the more expensive issues just say constant if we don't fund interventions for them. The world is far more complex than that. Many problems have a tipping point where things get much worse beyond a set point, and if we just say 'no funding for causes not on the effective charities lists' there's a strategic cost/implication to that. For example, child exploitation by criminal gangs - not something you find on the cause prioritisation lists, but if nothing is done to address issues like that, guess what - organised crime thrives without challenge and it becomes a much, much more complex, expensive problem to fix. <i>(There are probably better examples, but I did find this </i><a href=\"https://www.bbc.co.uk/news/uk-68615776\"><i>https://www.bbc.co.uk/news/uk-68615776</i></a><i> from the UK news today really interesting and it seems like an example where there is a problem getting worse and without attention it will become effectively an epidemic. Yet, the general EA wisdom would say funding charities that try to help children escape exploitation by criminal gangs is not cost-effective so don't put it on your list - don't we need a more nuanced view?)&nbsp;</i><br><br>Cause prioritisation is really important, considering effectiveness and cost-effectiveneness is really important, but it feels like the model needs to evolve to something a bit less simplistic than how many lives can you save with £X. To be clear, I do genuinely think charities like Against Malaria Foundation and GiveDirectly are fantastic and should receive a high level of funding - but not to the exclusion of everything else. If we fund ONLY those causes described by EA community as cost-effective, there are huge repercussions to that. We need to think about addressing root causes of issues, including those that are complex and may be expensive to solve, not just individual lives saved per £100k<i> (or if we go for lives/£ then at least factor in WELLBYs as suggested, and make some attempt to consider knock on impacts of funding or not , including the difference between low funding for a cause vs zero funding for a cause).</i><br><br>I'd love to see more posts like this one that ask bold questions challenging existing assumptions - strong upvote!</p>", "parentCommentId": null, "user": {"username": "RedTeam"}}, {"_id": "ySbpy7wEQHNt2Pj7t", "postedAt": "2024-03-22T10:00:15.398Z", "postId": "Gazt9dKDD4isGcupy", "htmlBody": "<p>Thanks for the support, RedTeam!</p>", "parentCommentId": "tuYR2KiBA6AoNavEH", "user": {"username": "vascoamaralgrilo"}}]