[{"_id": "uBLHZztkzjkikGqpK", "postedAt": "2022-08-23T11:08:50.074Z", "postId": "GcH55oG8HiQwdAs83", "htmlBody": "<p>Could you write a little about the successes, positive impact, and theory of change of the recruitment industry? My personal and professional experience has not given me a positive perspective on the role of recruiters or their success in finding the right candidates. The success rate of recruited candidates doesn't seem to be (in my anecdotal experience) any greater than those who are vetted by the org or company in a normal process. &nbsp;Have I just been unlucky?</p>", "parentCommentId": null, "user": {"username": "Charlie Dougherty"}}, {"_id": "qJNRkFrctcsPsiQHR", "postedAt": "2022-08-23T18:03:59.399Z", "postId": "GcH55oG8HiQwdAs83", "htmlBody": "<p>Hi Charlie. Great question. I don't have any data at hand on the recruitment industry as a whole compared to in-house recruiting. I know that the demand and market for recruitment services are growing as it gets harder and harder for companies to fill their positions. There are economic calculations comparing the total costs of in-house recruitment vs. hiring an external service, of course assuming that external services are doing a better job (as in successful and efficient). I do believe that there are plenty of services that only do an okay job and might not be better than in-house recruitment. But sometimes these services just get hired because the in-house recruiters don't have the capacity to manage all recruiting processes themselves.&nbsp;</p><p>This being said, my article wasn't about promoting the recruitment industry as a whole. I think what makes recruitment impactful is if you are hiring for an impactful project or organization. So I was referring to in-house recruiters of EA (or EA-aligned) organizations and recruiters for EA (or EA-aligned)<strong> </strong>hiring agencies.&nbsp;<br><br>I hope this was helpful and thanks for sharing your experience :-)&nbsp;</p>", "parentCommentId": "uBLHZztkzjkikGqpK", "user": {"username": "PV"}}, {"_id": "ZaEqabTSWsdpA2fbL", "postedAt": "2022-08-23T18:44:42.324Z", "postId": "GcH55oG8HiQwdAs83", "htmlBody": "<p>Thanks for writing this! There's been a lot of interest of EA community building, but I think the one of the most valuable parts of EA community building is basically just recruiting – e.g., notifying interested people about relevant opportunities and inspiring people to apply for impactful opportunities. A lot of potential talent isn't looped in with a local EA group or the EA community at all, however, so I think more professional recruiting could help a lot with solving organizational bottlenecks.</p>", "parentCommentId": null, "user": {"username": "michaelchen"}}, {"_id": "NcP7tjyQPBBTEmYc7", "postedAt": "2022-08-23T21:22:28.755Z", "postId": "GcH55oG8HiQwdAs83", "htmlBody": "<p>Thank you for this article, Pia!&nbsp;<br><br>I agree that as EA grows, I believe there will be an increase in demand for recruiters (in-house to organizations, and external in different niches/cause areas). And I also have observed that there are not many people with prior experience in recruiting within the EA ecosystem, but many people could have the skills and aptitudes that could make them a good recruiter.&nbsp;<br><br>Recruiting is also a relatively flexible career, with opportunities in many sectors all around the world!&nbsp;<br><br>I hope that people who are hiring for recruiters within EA make it explicit when they need someone with past experience, and when they're able to provide training/mentorship to support someone who could excel in the role with the right supports.&nbsp;<br><br>&nbsp;</p>", "parentCommentId": null, "user": {"username": "Lee McC"}}, {"_id": "2H89ZNrEvqtHDJxBz", "postedAt": "2022-08-23T23:42:58.693Z", "postId": "GcH55oG8HiQwdAs83", "htmlBody": "<p>Talist seems like it would be useful for advancing the alternate protein space. I could see value in their being a similar recruitment agency for the top global poverty charities. On the other hand, I am a bit more uncertain about the value-add of recruiters for roles which require more value alignment.</p><p>I'm guessing the greatest value add comes when you can recruit people outside of the community, but maybe there's value even for just recruiting within the (broader) community?</p>", "parentCommentId": null, "user": {"username": "casebash"}}, {"_id": "FNcfpRE7k8St7FRgB", "postedAt": "2022-08-24T07:11:57.260Z", "postId": "GcH55oG8HiQwdAs83", "htmlBody": "<p>Hi Pia,</p><p>Thanks for the reply, that is helpful! Hiring is definitely difficult and getting it right has absurdly good benefits! Tangential to this, I think Open Phil has recently been putting a lot of effort into having a good recruitment team. Might be worth getting in touch with them!</p>", "parentCommentId": "qJNRkFrctcsPsiQHR", "user": {"username": "Charlie Dougherty"}}, {"_id": "NEF43JXuc98gXGqs8", "postedAt": "2022-08-24T08:07:51.016Z", "postId": "GcH55oG8HiQwdAs83", "htmlBody": "<p>Hi Charlie,</p><p>yes, I am very pleased to see that there are more and more initiatives in the EA space to build up professional recruitment for the EA community. And this is why we need more recruiters ;-)&nbsp;</p>", "parentCommentId": "FNcfpRE7k8St7FRgB", "user": {"username": "PV"}}, {"_id": "JkYDNHeNXxhNkrGcF", "postedAt": "2022-08-24T08:38:42.730Z", "postId": "GcH55oG8HiQwdAs83", "htmlBody": "<p>Hi Chris,&nbsp;</p><p>thanks for sharing your thoughts and questions. In the linked job profile I also mention that I think for EA organizations having a value-aligned recruiter might be very valuable. I would love to see more people from the EA community consider this role for themselves because they already are mission-aligned. :-)&nbsp;</p>", "parentCommentId": "2H89ZNrEvqtHDJxBz", "user": {"username": "PV"}}, {"_id": "n4WYiRngXz3iYdFdP", "postedAt": "2022-08-24T08:44:13.637Z", "postId": "GcH55oG8HiQwdAs83", "htmlBody": "<p>Hi Lee,&nbsp;<br>thanks a lot for your comment and perspective - I second that. Given the variety of skills and education in the EA community, I am quite optimistic that there are enough people who could work successfully as a recruiter for EA (or EA-aligned) organizations, even without prior experience in this field. Training and mentorship could be very helpful in these cases. I'd be happy to offer some sort of support, as we have a lot of recruitment experience in our Tälist team. :-)</p>", "parentCommentId": "NcP7tjyQPBBTEmYc7", "user": {"username": "PV"}}, {"_id": "5ZcDv8h2QrRZiKCms", "postedAt": "2022-08-30T03:30:59.301Z", "postId": "GcH55oG8HiQwdAs83", "htmlBody": "<p>Rethink Priorities just recently hired an excellent full-time recruiter. Surprisingly (and perhaps ironically) this was the role we had the most trouble hiring for.</p>\n", "parentCommentId": null, "user": {"username": "Peter_Hurford"}}, {"_id": "6JhDH8AExQYn2mtbu", "postedAt": "2022-09-15T17:42:06.054Z", "postId": "GcH55oG8HiQwdAs83", "htmlBody": "<p>Hi Peter, thanks for sharing this experience. Unfortunately, this doesn't surprise me at all. Glad to hear you eventually found someone.&nbsp;</p>", "parentCommentId": "5ZcDv8h2QrRZiKCms", "user": {"username": "PV"}}]