[{"_id": "XLh2hjzKD8vjbffX5", "postedAt": "2024-02-17T19:26:48.521Z", "postId": "GD6Lmxcim4rufEJqp", "htmlBody": "<p>I suppose my main objection to the collective decision-making response to the no difference argument is that there doesn't seem to be any sufficiently well-motivated and theoretically satisfying way of taking into account the collective probability of making a difference, especially as something like a welfarist consequentialist, e.g. a utilitarian. (It could still be the case that probability difference discounting is wrong, but it wouldn't be because we should take collective probabilities into account.)</p><p>Why should I care about <i>this collective probability</i>, rather than the probability differences between outcomes of the choices actually available to me? As a welfarist consequentialist, I would compare probability distributions over population welfare values<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefjyq8lrlra1n\"><sup><a href=\"#fnjyq8lrlra1n\">[1]</a></sup></span>&nbsp;for each of my options, and use rules that rank them pairwise, or within subsets of options, or selects maximal options from subsets of options. Collective probabilities don't seem to be intrinsically important here. They wouldn't be part of the descriptions of the probability distributions of population welfare values for options actually available to you or calculable from them, if and because you don't have enough actual influence over what others will do. You'd need to consider the probability distributions of unavailable options to calculate them. Taking those distributions into account in a way that would properly address collective action problems seems to require <i>non-welfarist</i> reasons. This seems incompatible with act utilitarianism.</p><p>The differences in probabilities between options, on the other hand, do seem potentially important, if the probabilities matter at all. They're calculable from the probability measures over welfare for the options available to you.</p><p>Two possibilities Kosonen discusses that seem compatible with utilitarianism are rule utilitarianism and evidential decision theory. Here are my takes on them:</p><ol><li>For rule utilitarianism, you could assume you should follow universalizable procedures that lead to the best outcomes (or best distributions of outcomes) <i>if everyone (had the same beliefs and) followed them</i> (e.g. <a href=\"https://globalprioritiesinstitute.org/on-the-desire-to-make-a-difference-hilary-greaves-william-macaskill-andreas-mogensen-and-teruji-thomas-global-priorities-institute-university-of-oxford/\">Greaves et al., 2022</a> (section 4.5), Kant (his first formulation of the categorical imperative), Parfit and others). Pairwise probability difference discounting without collective thresholds leads to collective defeat, so it would be ruled out.<ol><li>I'm not really convinced that collective defeat under these unrealistic universalizations is a big deal at all. I don't get to choose what procedures <i>everyone else</i> follows (or what they believe), so why should I care about that?</li><li>I expect that changing my preferences or procedures to satisfy this constraint will lead to worse outcomes according to my current preferences. That seems self-defeating in a way, too.</li><li>Mendola (<a href=\"https://www.jstor.org/stable/4319850\">1986</a>, p.158, and responses to objections to his argument in the rest of the paper) argues that this is too strong as a formal constraint, based on aliens or machines that harshly punish you and ensure your actions are net negative for following your theory, because even consequentialists couldn't meet it. That being said, I'm not entirely convinced by this. Maybe you just need to follow the right decision theory. Or, we could still think avoiding collective defeat under universalization counts in favour of some procedures over others, and we should try to (more approximately) satisfy it in more situations than fewer.</li><li>You'd probably need to be only boundedly sensitive to stakes, at least in many conceivable decision situations, e.g. <a href=\"https://forum.effectivealtruism.org/posts/KGfBhsFzCqr9vq6Y6/utilitarianism-is-irrational-or-self-undermining\">my post</a> and <a href=\"https://alexanderpruss.blogspot.com/2022/10/expected-utility-maximization.html\">Pruss, 2022</a>. Depending on how exactly you are sensitive to the stakes, this could undermine longtermism.</li></ol></li><li>Evidential decision theory and other acausal decision theories seem pretty plausible to me, but I'm very skeptical they make enough difference <i>unless</i> you take into account correlations with agents <i>across a large (e.g. infinite) multiverse</i>. I do in fact think it's pretty likely we live in the right kind of multiverse that longtermism seems pretty plausible (or at least worthy of being a big part of my portfolio) even with probability difference discounting, though!</li></ol><p>&nbsp;</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnjyq8lrlra1n\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefjyq8lrlra1n\">^</a></strong></sup></span><div class=\"footnote-content\"><p>Or aggregate welfare, or pairwise differences in individual welfare between outcomes.</p></div></li></ol>", "parentCommentId": null, "user": {"username": "MichaelStJules"}}]