[{"_id": "JEzdxu6AfDhwpKaLi", "postedAt": "2023-05-18T08:20:51.040Z", "postId": "GD73T2xpNcx4Rvt2E", "htmlBody": "<p>Gorsuch wrote that the law would impose costs on farmers but that it 'serve[d] moral and health interests of some (disputable) magnitude for in-state residents.' These considerations were, supposedly, 'incommensurable', and should thus be left up to the voters.&nbsp;</p><p>Interestingly, he does not specify whether he means <i>human</i> or <i>non-human </i>in-state residents. Almost surely he meant the first. The magnitude of the interests involved becomes <i>indisputably </i>overwhelming if we factor in the latter. However, the rationale for respecting the judgement of the voters is correspondingly weakened, since the majority of those affected are disenfranchised.</p>", "parentCommentId": null, "user": {"username": "Matthew Rendall"}}, {"_id": "wSkCTgQBrY7jTpZPE", "postedAt": "2023-05-19T04:00:47.276Z", "postId": "GD73T2xpNcx4Rvt2E", "htmlBody": "<p>I'm slightly confused with that justification by Gorsuch. Prop 8 already put forth a production ban in California, so the health interests of Californians should already be served. Prop 12 affected the health of residents in <i>other </i>states.&nbsp;</p><p>I agree that this was clearly not about serving the interests of non-human animals, and therefore doesn't really serve as precedent for granting animals moral rights or weightage <i>independent of voters caring about them.</i></p>", "parentCommentId": "JEzdxu6AfDhwpKaLi", "user": {"username": "ishankhire"}}, {"_id": "q8APptrav4vmHtyAJ", "postedAt": "2023-05-22T00:37:51.301Z", "postId": "GD73T2xpNcx4Rvt2E", "htmlBody": "<p>The respondents argued that one of the functions of Proposition 12 was to protect the health of California customers w/r/t foodborne illness, which might be more likely from intensive farming systems where diseases spread easier.</p>\n<p>So essentially claiming that pork products would be safer under Prop 12, since most of the pork sold in CA wasn't impacted by Prop 2.</p>\n", "parentCommentId": "wSkCTgQBrY7jTpZPE", "user": {"username": "Tyler Johnston"}}]