[{"_id": "QnXTt2dCXLSEqaSQh", "postedAt": "2023-09-05T17:21:34.854Z", "postId": "GDdvdhbGfCehnoJzY", "htmlBody": "<p>Various \"auto-GPT\" schemes seem like a good demonstration of power-seeking behavior (and perhaps very limited forms of self-preservation or self-improvement), insofar as auto-GPT setups will often invent basic schemes like \"I should try to find a way to earn some money in order to accomplish my goal of X\", or \"I should start a twitter account to gain some followers\", or other similarly \"agenty\" actions/plans.<br><br>This might be a bit of a stretch, but to the extent that LLMs exhibit \"<a href=\"https://but in a certain sense there is a bit of &quot;specification gaming&quot; built into the outcome of RLHF processes used by all the big companies when training their LLMs?  \">sycophancy</a>\" (ie, telling people what they want to hear in response to stuff like political questions), this seems like it might be partially fueled by the LLM \"specification gaming\" the RLHF process? &nbsp;Since I'd expect that an LLM might get higher \"helpful/honest/harmless\" scores by trying to guess which answers the grader most wants to hear, instead of trying to give its truly most \"honest\" answer? &nbsp;(But I don't have a super-strong understanding of this stuff, and it's possible that other effects are fueling the sycophancy, such as if most of the sycophancy comes from the base model rather than emerging after RLHF.) &nbsp;But specification gaming seems like <a href=\"https://www.youtube.com/watch?v=nKJlF-olKmg\">such a common phenomenon</a> that there must be better examples out there.</p>", "parentCommentId": null, "user": {"username": "Jackson Wagner"}}, {"_id": "LctduA3kRzvoBjxMm", "postedAt": "2023-09-06T09:04:01.431Z", "postId": "GDdvdhbGfCehnoJzY", "htmlBody": "<p>Maybe it doesn’t quite answer your question, but Bing was an example that AI arms races are likely due to the profit incentive. Thought it was worth mentioning because that's part of the story.</p>\n", "parentCommentId": null, "user": {"username": "casebash"}}, {"_id": "gxXretFb2drCMatzR", "postedAt": "2023-09-06T22:00:18.534Z", "postId": "GDdvdhbGfCehnoJzY", "htmlBody": "<p>I predict people would find simple demos almost as compelling as real-world examples, and that a visually appealing collection of 20 videos like the classic <a href=\"https://openai.com/research/faulty-reward-functions\">boat race</a> clip would be a good potentially-quick (sub)project. Not sure how you make it visually appealing or publicize it.</p>", "parentCommentId": null, "user": {"username": "zsp"}}, {"_id": "MEhSvD9aTEjGtqaQy", "postedAt": "2023-09-07T17:49:35.934Z", "postId": "GDdvdhbGfCehnoJzY", "htmlBody": "<p>The only part of the Bing story which really jittered me is that time the patched version looked itself up through Bing Search, saw that the previous version Sydney was a psycho, and started acting up again. \"<a href=\"https://twitter.com/repligate/status/1668696054571704320\">Search is sufficient for hyperstition</a>.\"</p>", "parentCommentId": "LctduA3kRzvoBjxMm", "user": {"username": "technicalities"}}]