[{"_id": "KEgvb8azbY7uJmRBx", "postedAt": "2015-07-23T19:25:55.016Z", "postId": "GdMc3jrrRYqkJKyYJ", "htmlBody": "<p>Excellent response, and good job beating out GiveWell. It describes the main difference between SCI and DtW as being the specific worms treated, but isn't it that SCI's effectiveness is based on health, whereas DtW's is based on education? Otherwise, I would think there would be a plausible case that today's studies generalize to SCI, as one of the many &quot;worm wars&quot; pieces was saying.</p>\n<p>Of course, that's only the case if this re-analysis is worth its salt, which it doesn't appear to be.</p>\n", "parentCommentId": null, "user": {"username": "zdgroff"}}, {"_id": "6xZvLTXupzTz47b4N", "postedAt": "2015-07-23T23:19:08.079Z", "postId": "GdMc3jrrRYqkJKyYJ", "htmlBody": "<blockquote>\n<p>good job beating out GiveWell</p>\n</blockquote>\n<p>Does speed realistically make that much difference? I don't see what good it would do for GiveWell to start rushing to get responses out first.</p>\n", "parentCommentId": "KEgvb8azbY7uJmRBx", "user": {"username": "Nekoinentr"}}, {"_id": "S9aEfjEfchs5keGrS", "postedAt": "2015-07-23T23:31:48.069Z", "postId": "GdMc3jrrRYqkJKyYJ", "htmlBody": "<p>That was more of a joke. I don't think there's any competition here.</p>\n", "parentCommentId": "6xZvLTXupzTz47b4N", "user": {"username": "zdgroff"}}, {"_id": "MaTy5m4aEoup7vv5C", "postedAt": "2015-07-24T10:30:21.106Z", "postId": "GdMc3jrrRYqkJKyYJ", "htmlBody": "<p>SCI effectiveness is based on health, because schistosomiasis is much worse than STHs. DtWI is present in India, where they consult the Indian government to huge mass deworming operations, so their effectiveness is due the scalability and the donations have lots of leverage. But they're also in Africa already and want to further expands there, where they treat schisto. And then they spend a significant part of their money on research. That's why they're also very effective.</p>\n", "parentCommentId": "KEgvb8azbY7uJmRBx", "user": {"username": "HaukeHillebrandt"}}, {"_id": "dMRnxZbae4TAeJTDx", "postedAt": "2022-06-25T20:51:22.898Z", "postId": "GdMc3jrrRYqkJKyYJ", "htmlBody": "<p>Note that the hyperlink given no longer works. GWWC now has the deworming study response post at <a href=\"https://www.givingwhatwecan.org/blog/deworming-really-effective-response-recent-deworming-studies\">this updated link</a>.</p>", "parentCommentId": null, "user": {"username": "EricHerboso"}}]