[{"_id": "MzMyhby4iZqFWzqAR", "postedAt": "2017-04-06T10:57:28.443Z", "postId": "GdWyH3ScsjvSXhK6h", "htmlBody": "<p>When you get to scenario three where a nuclear submarine is operating under a private non-governmental organization I have to wonder about precedent for governments allowing fissile material into private control, especially absent a lot of the governmental controls that existing power plants have in place.</p>\n<p>(You have a typo in figure 1, years not tears.) </p>\n", "parentCommentId": null, "user": {"username": "JacobLBryan"}}, {"_id": "gDqfTpNLYavTzaJC4", "postedAt": "2017-04-06T12:34:47.537Z", "postId": "GdWyH3ScsjvSXhK6h", "htmlBody": "<p>Thanks for typo hint!</p>\n<p>I think that they mostly should be operating under general government control. There are also several private companies which licensed to make nuclear power plants etc like Westinghouse, and the same companies could operate nuclear powered ships and submarines. </p>\n", "parentCommentId": "MzMyhby4iZqFWzqAR", "user": {"username": "turchin"}}, {"_id": "7M6NSMf2ouoSNGTD9", "postedAt": "2017-04-07T00:25:21.453Z", "postId": "GdWyH3ScsjvSXhK6h", "htmlBody": "<p>Looks like good work! My biggest question is how would you get people to actually do this? I'd imagine there are a lot of people that would want to go to Mars since that seems like a great adventure, but living in a submarine in case there's a catastrophe isn't something that I think would appeal to many people, nor is funding the project.</p>\n", "parentCommentId": null, "user": {"username": "Daniel_Eth"}}, {"_id": "c7XiNFoKRLPX6dtjE", "postedAt": "2017-04-07T07:11:11.932Z", "postId": "GdWyH3ScsjvSXhK6h", "htmlBody": "<p>If we promise that people who want to go to Mars have to serve a year on a refuge-submarine, there will be a lot of volonteers  - and we could choose the best.</p>\n<p>Or we could collect the crews the same way as military crews are collected - combining prestige and salary. </p>\n", "parentCommentId": "7M6NSMf2ouoSNGTD9", "user": {"username": "turchin"}}]