[{"_id": "poBdBQvAAyEBPtvmm", "postedAt": "2022-09-22T15:43:28.262Z", "postId": "Geh9DFZQnj9s5HjoW", "htmlBody": "<p>I’m very interested in this. Some of what we’re doing at <a href=\"http://bit.ly/eamtt\">bit.ly/eamtt</a> gets at this, as well as some of the ‘research and agenda’ I try to synthesize at <a href=\"https://daaronr.github.io/ea_giving_barriers/\">“Increasing effective giving (&amp; action): The puzzle, what we (need to) know”</a>. (See also earlier/related work at <a href=\"http://innovationsinfundraising.org\">innovationsinfundraising.org</a> .)</p>\n<p>... Whew, end of self-promo.</p>\n<p>So in my case, you are preaching to the choir. However, there had been some pushback on this view, which I hope others present in the comments below (if not, I'll try to 'steel-man' it).</p>\n<p>By the way, one additional point that I frequently make on the above is that, in addition to the importance of charitable giving <em>itself</em></p>\n<blockquote>\n<p>Drivers and barriers to effective giving are also drivers/barriers to effective pro-social personal, professional and political choices.</p>\n</blockquote>\n<p>So (learning how to) promoting effective charitable-giving-related ideas to 'the masses' will also help (learn how to convince people)  to vote for effective government policies.</p>\n", "parentCommentId": null, "user": {"username": "david_reinstein"}}, {"_id": "Sccu8SDMkwgNW3AAQ", "postedAt": "2022-09-22T15:52:10.926Z", "postId": "Geh9DFZQnj9s5HjoW", "htmlBody": "<p>In addition to the work I link above, there are obviously other groups and initiatives 'in this space'. You are not alone, even though the thrust of most efforts within 'core EA' seems to have moved to 'making more highly-engaged EAs' and getting the smartest people to pursue longtermist-relevant career paths.</p>\n<p>E.g., see the work of (some of which is discussed in the above links) ...</p>\n<ul>\n<li>\n<p>GiveWell, Giving What We Can, One for The  World, The Life You Can Save</p>\n</li>\n<li>\n<p>(Spinoffs) Charity Elections, Giving Games</p>\n</li>\n<li>\n<p><a href=\"https://forum.effectivealtruism.org/topics/workplace-advocacy\">Workplace advocacy</a>,  [High Impact Professionals]\n(<a href=\"https://forum.effectivealtruism.org/posts/M2KrWyG2X8iQaHGJv/introducing-high-impact-professionals\">https://forum.effectivealtruism.org/posts/M2KrWyG2X8iQaHGJv/introducing-high-impact-professionals</a>)</p>\n</li>\n<li>\n<p>Groups: <a href=\"https://www.eaforchristians.org/\">EA for Christians</a> (and Muslims, Jews, etc)</p>\n</li>\n<li>\n<p><a href=\"https://forum.effectivealtruism.org/posts/ZuxtR4YpebXQqsjXa/a-new-strategy-for-broadening-the-appeal-of-effective-giving\">Giving Multiplier</a></p>\n</li>\n<li>\n<p><a href=\"https://forum.effectivealtruism.org/posts/tWawcXaNnLAihA2Fv/announcing-ea-pulse-large-monthly-us-surveys-on-ea\">EA Pulse</a></p>\n</li>\n</ul>\n", "parentCommentId": "poBdBQvAAyEBPtvmm", "user": {"username": "david_reinstein"}}, {"_id": "pK7ss7iawPrhaXMov", "postedAt": "2022-09-22T17:06:21.741Z", "postId": "Geh9DFZQnj9s5HjoW", "htmlBody": "<p>Re more charity evaluators, there is <a href=\"https://sogive.org/#home\">SoGive</a>, which aims to evaluate a wide variety of popular charities, with the idea of nudging people toward more effective choices (they are EAs). Also with the idea of nudging people toward donating more to more effective charities, there is &nbsp;<a href=\"https://givingmultiplier.org/\">Giving Multiplier</a> (\"Give to both your favorite charity and a super-effective charity recommended by experts. We'll add to your donations.\")</p>", "parentCommentId": null, "user": {"username": "Greg_Colbourn"}}, {"_id": "KhefHSebbhMtaxHyb", "postedAt": "2022-09-22T17:47:12.745Z", "postId": "Geh9DFZQnj9s5HjoW", "htmlBody": "<p>I would prefer it quite a lot if this post didn't have me read multiple paragraphs (plus a title) that feel kind of clickbaity and don't give me any information besides \"this one opportunity that Effective Altruists ignore that's worth billions of dollars\". I prefer titles on the EA Forum to be descriptive and distinct, whereas this title could be written about probably hundreds of posts here.&nbsp;</p><p>A better title might be \"Why aren't EAs spending more effort on influencing individual donations?\" or \"We should spend more effort on influencing individual donations\".</p>", "parentCommentId": null, "user": {"username": "Habryka"}}, {"_id": "cpoyYdL9ChkjHgnhi", "postedAt": "2022-09-22T18:56:37.037Z", "postId": "Geh9DFZQnj9s5HjoW", "htmlBody": "<p><a href=\"https://forum.effectivealtruism.org/posts/dTdSnbBB2g65b2Fb9/eaf-s-ballot-initiative-doubled-zurich-s-development-aid\">EAF’s ballot initiative doubled Zurich’s development aid</a><br>Would love to see more initiatives like this one.<br><br>(I havent read the whole top level post, only skimmed)</p>", "parentCommentId": null, "user": {"username": "Jsevillamol"}}, {"_id": "ytZHgSnwxAr5sWsj2", "postedAt": "2022-09-22T19:15:15.301Z", "postId": "Geh9DFZQnj9s5HjoW", "htmlBody": "<p>I'm <a href=\"https://forum.effectivealtruism.org/posts/zrrnK7WkopYRTyKmc/effektiv-spenden-a-meta-opportunity-in-germany-and\">obviously biased</a>, but wholeheartedly agree with you that EA should invest even more in effective giving (because of the impact the donations will have and also to get more people interested in EA). In the last couple of weeks I have started to become more optimistic that this will happen though (e.g. Open Phil seems to consider supporting this space directly).<br><br>With regards to the \"pick a fight\" strategy you might want to check out some of the very early GiveWell blog posts (2007 - 2009). They definitely didn't shy away from a fight (just ask Charity Navigator) and I actually think that this was a smart strategy at the time and might still be under some circumstances.&nbsp;</p>", "parentCommentId": null, "user": {"username": "EA-Basti"}}, {"_id": "ycmCqPMh6pYP2f7Wc", "postedAt": "2022-09-22T20:03:12.808Z", "postId": "Geh9DFZQnj9s5HjoW", "htmlBody": "<p>I appreciate this response because I think it's symbolic of something I think is important.</p><p>EA has a lot of internal norms, like any group. It seems like on the EA forum one of those is to use more factual, descriptive, neutral titles. But elsewhere, the norm is to be attention getting, provocative, etc. &nbsp;You could fairly call this 'clickbait' if you'd like. Clickbait exists because it <i>works</i>. &nbsp;It is startlingly effective, and not just at cheap engagement that dies quickly. &nbsp;It's effective at prompting deep engagement as well. &nbsp;One quick example - video essayists on youtube who do incredibly informative deep dives on technical subjects still use clickbait titles, image previews, etc. The big channels literally have consultants that help A/B test which reaction face will get more clicks. It doesn't detract from the quality of their videos or the depth of their communities, it's just part of what you have to do to get people to care.</p><p>My experience is more in that world. I'm used to phrasing things with the explicit goal to make people click, draw their eyeballs, cause a stir, etc. By using that kind of title on the EA forum, I've probably committed a minor faux pas. &nbsp;But it actually does help me illustrate the point that EAs shouldn't be allergic to that kind of thing all the time.</p><p>EAs using factual, descriptive, neutral titles on their own forums is an interesting quirk of the community. &nbsp;But if EAs only ever use factual, descriptive, neutral language in all forums, that's a strategic mistake, and hinders their ability to effectively communicate with the public. This comment is a corollary to the 'Pick a fight' argument - I believe that sometimes EAs need to abandon internal norms in order to win attention for their ideas.</p>", "parentCommentId": "KhefHSebbhMtaxHyb", "user": {"username": "JeremiahJohnson"}}, {"_id": "mpmRBGY3yNFPZHYyu", "postedAt": "2022-09-22T20:37:23.441Z", "postId": "Geh9DFZQnj9s5HjoW", "htmlBody": "<p>I think this comment misses the point. The crux is not whether clickbait does in fact draw attention – the fact that clickbait works is precisely why we don't want it on the forum. We have a limited amount of attention to spend, and encouraging clickbait means necessarily drawing away attention from less-clickbaity posts.</p><blockquote><p>\"But if EAs only ever use factual, descriptive, neutral language in all forums, that's a strategic mistake, and hinders their ability to effectively communicate with the public.\"</p></blockquote><p>I don't think the purpose of the EA forum is to communicate with the public.</p>", "parentCommentId": "ycmCqPMh6pYP2f7Wc", "user": {"username": "updated"}}, {"_id": "s59thNECK2xNztKh6", "postedAt": "2022-09-22T23:25:16.701Z", "postId": "Geh9DFZQnj9s5HjoW", "htmlBody": "<p>I submitted an entry to Open Phil (not sure if it came through) that was short and sweet. Reprinted here:&nbsp;</p><p>This essay will be short and simple.&nbsp;</p><p>The problem at hand is this: Far too much potential philanthropy isn’t happening at all.&nbsp;</p><p>First, when you look at the list of Giving Pledge signatories (<a href=\"https://givingpledge.org/pledgerlist\">https://givingpledge.org/pledgerlist</a>), all of whom are billionaires who have promised to give away half their wealth, most of them haven’t set up foundations or made any significant effort to actually follow through on their pledge. Indeed, even the Pledgers that <i>have </i>engaged in serious philanthropy have often been able to increase their net worth by more than they gave away (see <a href=\"https://www.marketwatch.com/story/giving-away-money-well-is-very-hard-the-giving-pledge-turns-10-and-its-signers-are-richer-than-ever-2020-08-08\">https://www.marketwatch.com/story/giving-away-money-well-is-very-hard-the-giving-pledge-turns-10-and-its-signers-are-richer-than-ever-2020-08-08</a>).</p><p>Second, the <a href=\"https://acceleratecharitablegiving.org/about/\">Initiative to Accelerate Charitable Giving</a> estimates that over $1 trillion is locked up in private foundations and donor-advised funds, most of which don’t provide any transparent way to apply for funding. Indeed, the major firms that manage DAFs (e.g., Schwab) are highly incentivized by management fees <i>not</i> to facilitate transfers out to actual charities.&nbsp;</p><p>Open Philanthropy and associated efforts in EA have focused on <i>how to optimize the philanthropy that already occurs</i>. But what if a focused public campaign and some policy work on DAFs etc. could vastly increase the <i>amount of</i> <i>philanthropy available to optimize</i>? Getting DAFs and Giving Pledge members to distribute 5% of their assets a year could be worth at least $50 billion a year.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Stuart Buck"}}, {"_id": "aZe5exMbAxbDrBPN2", "postedAt": "2022-09-23T01:40:40.854Z", "postId": "Geh9DFZQnj9s5HjoW", "htmlBody": "<p>\"<i>Giving What We Can's mission is to make giving effectively and significantly a cultural norm. We mean this quite literally: our goal isn't just to marginally increase the amount of money going to effective charities — we're aiming to make meaningful cultural change.\"</i></p><p>At Giving What We Can we are trying to bring effective giving and the ideas of effective altruism to a much broader audience through the lens of engaging those who are generally in the top 10% of earners worldwide.&nbsp;</p><p>There are many other organisations and new projects that aim to share the ideas to a wider audience - One example I'm personally excited about is Asterisk, a new magazine shaped by the philosophy of EA. <a href=\"https://asteriskmag.com/\">https://asteriskmag.com/</a></p>", "parentCommentId": null, "user": {"username": "GraceAdams"}}, {"_id": "zKo4brxbqkdEAYgxp", "postedAt": "2022-09-23T03:02:53.901Z", "postId": "Geh9DFZQnj9s5HjoW", "htmlBody": "<p>(I was about to send something like this as a private message, any opinions on that vs a comment?) (I did in fact send a similar message very recently, should it have been a comment?)</p>", "parentCommentId": "KhefHSebbhMtaxHyb", "user": {"username": "hibukki"}}, {"_id": "jdYoLviBZYfaNwtDc", "postedAt": "2022-09-23T03:25:42.294Z", "postId": "Geh9DFZQnj9s5HjoW", "htmlBody": "<p>I believe there is a strong need for mainstream EA influencers.</p>", "parentCommentId": null, "user": {"username": "EffAlt"}}, {"_id": "2EvKpiNgp2Pc9LY8h", "postedAt": "2022-09-23T06:07:42.863Z", "postId": "Geh9DFZQnj9s5HjoW", "htmlBody": "<p>I think it's not obvious in this case what is better, though I think I mildly prefer publicly. Sending it privately keeps the conversation less tense and has less risk of making people feel embarrassed, but sending it publicly is better for helping newcomers orient to the culture (99% of people never post or comment, so private norm enforcement is a losing battle, especially if you hope that EA Forum norms expand to the in-person realm).</p>", "parentCommentId": "zKo4brxbqkdEAYgxp", "user": {"username": "Habryka"}}, {"_id": "EsKdBbpe2qBb3Lyta", "postedAt": "2022-09-23T09:19:52.002Z", "postId": "Geh9DFZQnj9s5HjoW", "htmlBody": "<p>If EA starts to abandon internal norms about factual communication that's bad. It hinders what EA is about. When a GiveWell analyst gets told not to speak about the drawbacks of a certain cause because that might demotivate people to donate to that cause, that's a problem. That kind of behavior should happen less not more.&nbsp;</p><p>Fighting for keeping the core norms intact is important.&nbsp;</p>", "parentCommentId": "ycmCqPMh6pYP2f7Wc", "user": {"username": "ChristianKleineidam"}}]