[{"_id": "DEQKLouyFyLSy586A", "postedAt": "2015-03-06T10:15:08.586Z", "postId": "GG6HiDFhKqG5whrHN", "htmlBody": "<p>This is brilliant, thank you Owen. One of those really useful but apparently obvious things you wonder why you never thought of - but then you've extended it in some quite wonderful ways: I particularly like that if you're starting on a high in terms of clarity / mental energy - whatever you do will be <em>more</em> costly in terms of lost energy on average as this is a hard state to maintain: so, rather than feeling like you can take on the world and blasting through whatever, its really important to recognize the impermanence and the temporal nature of that state.</p>\n<p>Potential extension: how to think about things that affect your baseline energy levels over a longer time frame - I don't seem to find this as intuitive as direct comparisons as I'm unsure how to value an additional x% effectiveness or energy across all activities + the enjoyment I and others get from it + the change in the types of decisions made as a result in practical terms. I think that this uncertainty means I end up neglecting things at this level. E.G. I know that from past experience meditation done every day greatly increases my energy, rationality, sense, clarity etc. but I find it hard to prioritise this as there's always something else to do with clear value.</p>\n<p>A potential application: pain or disease management. There's already an intuitive approach to this <a href=\"http://www.lupus.org.uk/patients-stories/111-the-spoons-theory\">http://www.lupus.org.uk/patients-stories/111-the-spoons-theory</a>\nBut helping people to understand the comparative costs in terms of biological / psychological burden when they're planning and making decisions about their day, and taking the stress out of this where possible, would be valuable to do.\nMight be worth a conversation about how to take this forward with pain management people?</p>\n", "parentCommentId": null, "user": {"username": "tomstocker"}}, {"_id": "Bc8cKztDHbQEYmPEW", "postedAt": "2015-03-06T15:27:23.231Z", "postId": "GG6HiDFhKqG5whrHN", "htmlBody": "<p>Great comments.</p>\n<blockquote>\n<p>Potential extension: how to think about things that affect your baseline energy levels over a longer time frame</p>\n</blockquote>\n<p>This would certainly be useful. You can frame it as changing the neutral time costs of different activities, but I don't know if that's helpful. It might be that it's more appropriate to use a different framework to evaluate these things, but I'll think about it some more. Let us know if you have any extra insights on this!</p>\n<blockquote>\n<p>A potential application: pain or disease management.</p>\n</blockquote>\n<p>Yeah, this is interesting. I think it's potentially quite applicable here, but the question is whether it's easy enough to use. Let's chat about it in person.</p>\n", "parentCommentId": "DEQKLouyFyLSy586A", "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "5JirCqiJePs8HEB4d", "postedAt": "2015-03-27T07:14:46.535Z", "postId": "GG6HiDFhKqG5whrHN", "htmlBody": "<p>Thanks Owen - the only insight I have is that it seems to be complicated re: baseline energy levels over a longer time frame - this might well be because I just don't have a good model for what's going on!! (Also partly related to attitude and social support/prestige for what you're doing? Or it might be that I'm a particularly fickle individual!!)</p>\n", "parentCommentId": "Bc8cKztDHbQEYmPEW", "user": {"username": "tomstocker"}}, {"_id": "a27e6yKvEaiDbnpxi", "postedAt": "2015-04-08T02:58:59.278Z", "postId": "GG6HiDFhKqG5whrHN", "htmlBody": "<p>This is very interesting. However, I suspect that for many people, the percentage of time required to recharge is not that large. For instance, many people work 50 or 60 hours a week. And even when they are not working, they might be mostly doing things that would not be considered recharging, like housework or commuting. My personal recharge percentage might only be around 5%. So I might be biased, but I would guess it would typically be around 20%, at least for people who are motivated like effective altruists.\nAs for the question about whether timesaving interventions are worth it, I have done a lot of calculations for my own personal decisions. To my surprise, I found that many things make sense even if you value your time at order of magnitude 1 dollar per hour or less. They include things like dishwasher (you can get a countertop version if you are in a single person household), having laundry in your apartment (you can get a combination washer dryer that uses a standard outlet-this actually saves you money even when you count the increase in rent due to the lost square footage), having a second monitor, using voice recognition software (this is one of the biggest timesaving interventions), using a hands-free phone so you can do housework while on the phone, having a wireless headset so you can listen to things like TED talks while grooming, etc.</p>\n", "parentCommentId": null, "user": {"username": "Denkenberger"}}]