[{"_id": "JhEWj2CdEECMijALF", "postedAt": "2022-09-21T20:15:15.280Z", "postId": "GHd8vyC3qAX5spdpG", "htmlBody": "<p>Amazing 🙂I &nbsp;can see this getting big so I can think of a couple helpful columns for sorting. &nbsp;Would you mind adding them?<br><br>1. \"Willing to Relocate?\" with drop-down options \"yes,no,likely eventually\"<br>2. \"Relationship style\" with dropdown options &nbsp;\"polyamorous,monogamous,ambiamorous\" (honestly I could get way more granular on this one but I guess this is okay)<br>3. &nbsp;\"Wants kids?\" with dropdown option \"yes,no,undecided\"<br><br>Edit: Saw your footnote about wanting other people to edit, made this tweaked copy for you to poach what you like (anyone else reading this, ignore this and use the original sheet):&nbsp;<br><a href=\"https://docs.google.com/spreadsheets/d/1ID--eOZhyYnrqIGtYXPWLcWMe8VuMHMYO6dmeqVJX44/edit?usp=sharing\">https://docs.google.com/spreadsheets/d/1ID--eOZhyYnrqIGtYXPWLcWMe8VuMHMYO6dmeqVJX44/edit?usp=sharing</a>&nbsp;</p>", "parentCommentId": null, "user": {"username": "Ivy_Mazzola"}}, {"_id": "t5XdKWbQgDdq6kvHS", "postedAt": "2022-09-21T20:22:41.309Z", "postId": "GHd8vyC3qAX5spdpG", "htmlBody": "<p>This is a really valuable community service and I guess very cheap if anyone gets together via your spreadsheet. Thanks for doing it.</p>", "parentCommentId": null, "user": {"username": "nathan"}}, {"_id": "ZANEzYL6i9xzovsR6", "postedAt": "2022-09-21T21:55:52.414Z", "postId": "GHd8vyC3qAX5spdpG", "htmlBody": "<p>Sorry, couldn't resist. Glanced at the spreadsheet:</p>\n<p>Gender\nMan\nMan\nMan\nMan\nMan\nMan\nMan\nMan\nMan\nMan\nMan\nMan\nWoman\nMan</p>\n<p>To increase the efficiency of altruism of social animals that humans represent and obtain belonging and love in an effective, optimal and fully rational way that has low risks and has proven to work since the Roman empire and has perfect forecasts in terms of QALYs created via studies of Roman culture by renowned EA scientists, and make EAs more productive, I propose a new cause area: questioning gay tendencies in the Effective Gay therapy in order to increase personal fit for participation in EA, boost morale, release dopamine and maximize productivity and finally obtain optimal effectiveness of longtermist cause areas and complete, coherent and extrapolated rationality, uninterrupted by unnecessary risky behaviours like self-search or outdated mechanisms like human emotion.</p>\n<p>Be Gay For EA</p>\n<p>Be Gay For Future Generations</p>\n<p>William said today: be gay for me. Come to our events. Please read the instructions first.</p>\n<p>(joke yes yes. or maybe... hmm...)</p>\n", "parentCommentId": null, "user": {"username": "sergeivolodin"}}, {"_id": "ZQGjSAtLZAMyYnuzX", "postedAt": "2022-09-21T22:37:24.569Z", "postId": "GHd8vyC3qAX5spdpG", "htmlBody": "<p>I don't get this - I posted it as a comment and the <em>post itself</em> went like -2 but was like +3 or something... Causality, correlation? Shall I delete it? Just a joke folks, so strange, people don't want to discuss dating ...</p>\n<p>And now it's +8</p>\n<p>Maybe I'm just seeing things that are not there, oh la la</p>\n<p>I wrote something about empathy and strength, vibes and rationality, maybe that helps (\"left and right brain\", not taken well by modern neuroscientists, treat it as an abstraction rather than direct mapping)</p>\n<p>I feel and think I need both. With only the left brain I forget about <em>now</em> (like now, not \"what my actions would give\" or \"what happened in the past when similar actions were taken\"). And I not see some options available if I forget the <em>now</em>. With only the right brain I forget about systems that sometimes help. Left brain implements models, right brain tunes and \"reloads\" them when they become too bloated, too contradictory and need new axioms. Those spiritual vibes (can be seen instantiated in music styles, for example) can be seen as different \"cultures\" of axiom-building. That's why people who recover from trauma (like me) talk about spirituality and vibes - old axioms went into contradictions and couldn't explain or predict or give actions to adapt to the environment. So it's time for music and new axioms.</p>\n<p>LRLRLR</p>\n<p>Such an oh la la, I feel and think that EA forum needs more jokes or it's only L and no R</p>\n", "parentCommentId": "ZANEzYL6i9xzovsR6", "user": {"username": "sergeivolodin"}}, {"_id": "WZgoirBDrjLju9Dk3", "postedAt": "2022-09-21T23:11:53.731Z", "postId": "GHd8vyC3qAX5spdpG", "htmlBody": "<p>For those wondering \"and what about AGI and left-right brains\" I did some on it in my thesis (left causal model and right neural decoder) - I put it as creative commons non-profit. Merging symbolic and neural systems is probably a way to go but maybe we don't want to go so fast into the unknown imho.</p>\n<p>And date me, yes.</p>\n", "parentCommentId": "ZQGjSAtLZAMyYnuzX", "user": {"username": "sergeivolodin"}}, {"_id": "3DbBnHfX55W6MFCvk", "postedAt": "2022-09-23T23:46:41.788Z", "postId": "GHd8vyC3qAX5spdpG", "htmlBody": "<p>Yeah there are more men in EA but notice this: you can have a gender ratio of 54% men, 46% women and have 9x as many single men if 45% of men and 45% of women are partnered already. Looking at single people only amplifies gender ratio.<br>&nbsp;<br>Aside: this is also why there are so many guys in the Bay Area complaining they can't find a girlfriend vs places like Boston even though the overall gender ratio isn't that much different.&nbsp;</p>", "parentCommentId": "ZANEzYL6i9xzovsR6", "user": {"username": "Dan Elton"}}, {"_id": "RpK3RkDq74PLBCdwe", "postedAt": "2023-06-04T19:34:05.152Z", "postId": "GHd8vyC3qAX5spdpG", "htmlBody": "<p>Added mine. :)</p>", "parentCommentId": null, "user": {"username": "jaythibs"}}]