[{"_id": "ao5oYwwbjmyoNT3Kc", "postedAt": "2018-01-25T20:42:38.191Z", "postId": "GhHirpH9uzxKCr3Lx", "htmlBody": "<p>Thanks a lot for sharing this. The topics and readings lists strike me as pretty well chosen and interesting. This could be a very useful resource for local groups running discussion groups.</p>\n", "parentCommentId": null, "user": {"username": "Sebastian_Oehm"}}, {"_id": "44Af7Yy4eZNkBmJYD", "postedAt": "2018-01-26T19:09:42.918Z", "postId": "GhHirpH9uzxKCr3Lx", "htmlBody": "<p>I run The Life You Can Save’s “Giving Game” project- we give students (among others) real money to donate in structured decision making process (e.g. between pre-selected charities representing major EA causes).  Let me know if you’d be interested in incorporating a GG into this class or future iterations.  I’d be happy to discuss ways to tailor the model to your needs, explain what other teachers have done, etc.  Background here: <a href=\"https://www.thelifeyoucansave.org/giving-games\">https://www.thelifeyoucansave.org/giving-games</a></p>\n", "parentCommentId": null, "user": {"username": "Jon_Behar"}}, {"_id": "85fEZNTfctcQR5qoa", "postedAt": "2018-01-29T00:02:25.389Z", "postId": "GhHirpH9uzxKCr3Lx", "htmlBody": "<p>Thank you! I'll check it out.</p>\n", "parentCommentId": "44Af7Yy4eZNkBmJYD", "user": {"username": "geoffreymiller"}}, {"_id": "SwsxTSvBK5rT5grdk", "postedAt": "2018-01-29T16:49:39.491Z", "postId": "GhHirpH9uzxKCr3Lx", "htmlBody": "<p>Thanks for creating this. I've added your course to <a href=\"http://www.stafforini.com/blog/effective-altruism-syllabi/\">this list</a>.</p>\n", "parentCommentId": null, "user": {"username": "Pablo_Stafforini"}}, {"_id": "Fgnfcfbf8PCcj2RBt", "postedAt": "2018-02-08T00:03:51.144Z", "postId": "GhHirpH9uzxKCr3Lx", "htmlBody": "<p>This seems lovely &lt;3 Thank you for sharing!!! </p>\n<p>If I may, Buddhism if seen as a system for self and collective development, and the art of acquiring what is called as a clear mind (bodhicitta), is also a great resource for what you teach. </p>\n<p>I also found that the Yoga Sutras of Patanjali, from the Vedic tradition, is one of the most precious and precise guided analysis of the Psychology and Essential nature of Effective Altruism. </p>\n<p>My third proposal would be the Bhagavad Gita,  a wonderful treasure full of images on the psychology of effective altruism, which your students could read during their summer holidays and get inspired.  </p>\n<p>You seem to already have a great and complete syllabus! I bring some blast from the past which can bring some magic to the students' path, and this is why I thought that these might be helpful. </p>\n<p>Thanx again,\nBilly.</p>\n", "parentCommentId": null, "user": {"username": "padmabilly"}}, {"_id": "G9sHodfDhq7G7CwRd", "postedAt": "2018-02-08T20:35:34.436Z", "postId": "GhHirpH9uzxKCr3Lx", "htmlBody": "<p>Thanks for this, it's a good resource for teachers and learners alike!</p>\n", "parentCommentId": null, "user": {"username": "turnercore"}}]