[{"_id": "6ezN9D6XSbuo4g2LD", "postedAt": "2023-08-04T10:28:44.310Z", "postId": "Gi2MLKooCBBbh8vAJ", "htmlBody": "<p>I think this is a great idea. I agree that it is much easier to shift giving within a cause area than between cause areas.&nbsp;</p><p>I do wonder if there are ways to build in cross-causal giving using this platform. For example, I am curious whether the <a href=\"https://givingmultiplier.org/\">giving multiplier</a> mechanism would be an effective way to achieve both 1) increased effectiveness within climate change donations and 2) substitute some donations to other cause areas. However, I would be hesitant to include this straight away, but if the EEA EF gets momentum it is something to consider.&nbsp;</p><p>Also, I am curious what your strategy is in marketing the platform to non EAs who care about climate change. Have you had any success stories so far?&nbsp;</p>", "parentCommentId": null, "user": {"username": "benleo"}}, {"_id": "MovMwMvkF2Wv5dxmB", "postedAt": "2023-08-18T19:40:08.681Z", "postId": "Gi2MLKooCBBbh8vAJ", "htmlBody": "<p>Thanks for the support Ben. I love what giving multiplier are doing and we entertained the idea down here but we have more restrictive charity regranting laws down here. My understand is that giving multiplier can basically just forward re-grants to the donor's target, but our read of the Aussie legislation is that we'd need to formally partner with every charity that a donor would want to choose.</p><p>Our strategy for marketing to non-EAs is to partner with <a href=\"https://www.givinggreen.earth/about-us#:~:text=Jack%20Rafferty%20is%20the%20Manager%20of%20Climate%20Giving%20for%20Giving%20Green%20Australia.\">Giving Green to support a Manager of Climate Giving for Giving Green Australia</a>. Basically, we work closely with Jack who's job is to both evaluate Australian options but also to market and fundraise around effective climate giving in Australia. We're also planning to hire a fundraiser and marketer for EAA.</p>", "parentCommentId": "6ezN9D6XSbuo4g2LD", "user": {"username": "mnoetel"}}]