[{"_id": "sc4XmFQBpvAGJhwyW", "postedAt": "2015-03-01T08:28:38.923Z", "postId": "GiMB54XKnGfX8k9Qx", "htmlBody": "<p>When donation challenges become the new high-status thing in the EA community, please remember to credit Ben Kuhn.</p>\n<p>Really cool post (I just read it on Ben's blog, but am commenting here because he wants to consolidate discussion in a single place).</p>\n", "parentCommentId": null, "user": {"username": "Pablo_Stafforini"}}, {"_id": "uasBjmxt9AALFnGqn", "postedAt": "2015-03-01T13:14:24.358Z", "postId": "GiMB54XKnGfX8k9Qx", "htmlBody": "<blockquote>\n<p>A strong majority thought that all matches were fully counterfactually valid, so if this isn’t true of your match, you should say so.</p>\n</blockquote>\n<p>To be crystal clear for people who haven't read the survey, people didn't express an explicit opinion on whether they thought the matches were &quot;counterfactually valid&quot; (using those explicit terms). What they were saying was that they thought more money would go to the charities in the matching cases. (When I first saw the survey it looked like I was being asked a maths problem and I answered it as such.)</p>\n<p>Whether they explicitly thought about counterfactuals probably depended on whether they were EAs who were familiar with these - I'd guess that many/most were, since it was posted on Facebook by EAs and would have been of most interest to them. I imagine a typical matching fundraiser audience are merely generally motivated by the matching without explicitly thinking about counterfactuals. I don't think they take there to be even an implication about counterfactuals, which I imagine is why charities are comfortable with matches (which GiveWell apparently think are typically non-counterfactual). So talking about dishonesty is too strong - not being actively transparent about this element is more on the mark.</p>\n", "parentCommentId": null, "user": {"username": "jayd"}}, {"_id": "oawWy3XgiT3gdBYnw", "postedAt": "2015-03-01T17:16:59.131Z", "postId": "GiMB54XKnGfX8k9Qx", "htmlBody": "<blockquote>\n<p>they thought more money would go to the charities in the matching cases.</p>\n</blockquote>\n<p>In particular, they thought that for each $10 donated, <em>a full additional $10</em> would go to the charity if the match was still active. (Some people thought that more money would go to the charity in the matching case, but less than the full $10.)</p>\n", "parentCommentId": "uasBjmxt9AALFnGqn", "user": {"username": "Ben_Kuhn"}}]