[{"_id": "jwpxvzfGcJHZGaG5Y", "postedAt": "2023-11-17T18:27:14.598Z", "postId": "Gixg28wwaketTAhNh", "htmlBody": "<p>My two cents:</p>\n<ul>\n<li>Most governments heavily subsidise R&amp;D (which is equivalent to a deliberate negative externality), often through tax credits</li>\n<li>The patent system allows companies to extract abnormal profits for 20 years and incentivise a race (even if somebody independently develops the technology, they can’t use it if somebody else has patented it). This system is a deliberate inefficient market</li>\n<li>Corporate R&amp;D tends to be much more short-term and customer-focused. If you come from an academic background, you will be shocked by what is counted as R&amp;D. For example, if you ask a consumer products company about innovation, they will talk about things that really aren’t humanity advancing (e.g. adding another blade to a razor, changing the shape of a chocolate bar to make it smaller without the consumer noticing)</li>\n</ul>\n", "parentCommentId": null, "user": {"username": "Grayden"}}, {"_id": "9QGbLDWHLowiR6aAG", "postedAt": "2023-11-17T18:50:55.170Z", "postId": "Gixg28wwaketTAhNh", "htmlBody": "<p><strong>Executive summary</strong>: The emergence of artificially sentient beings raises moral, political, and legal issues that deserve scrutiny.</p><p><strong>Key points</strong>:</p><ol><li>The private sector spends much more on R&amp;D than the public sector despite the large positive externalities from R&amp;D.</li><li>Governments have incentives to care about spatial externalities (between firms/consumers) but not temporal ones.</li><li>Private firms care about long-term returns so invest more in R&amp;D with delayed payoffs.</li><li>Evidence suggests social returns to R&amp;D are very high, so more investment is likely beneficial.</li><li>Government underinvestment may be explained by political incentives, not just externality theory.</li></ol><p>&nbsp;</p><p><i>This comment was auto-generated by the EA Forum Team. Feel free to point out issues with this summary by replying to the comment, and</i><a href=\"https://forum.effectivealtruism.org/contact\"><i>&nbsp;<u>contact us</u></i></a><i> if you have feedback.</i></p>", "parentCommentId": null, "user": {"username": "SummaryBot"}}, {"_id": "KS9JAxpbLvixWMij2", "postedAt": "2023-11-18T22:28:29.017Z", "postId": "Gixg28wwaketTAhNh", "htmlBody": "<p>You may be interested in <a href=\"https://www.arnauddyevre.com/files/arnaud_dyevre_jmp.pdf\">Arnaud Dyevre's job market paper</a> which looks at how much the source of R&amp;D matters in terms of spillover effects. He finds that public sector R&amp;D tends to have much higher spillover effects than private sector.</p>", "parentCommentId": null, "user": {"username": "jazzbuck"}}, {"_id": "xQLpKHafsiGp5J76h", "postedAt": "2023-11-19T03:18:09.202Z", "postId": "Gixg28wwaketTAhNh", "htmlBody": "<p>The executive summary is entirely hallucinated.</p>\n", "parentCommentId": "9QGbLDWHLowiR6aAG", "user": {"username": "Halffull"}}, {"_id": "LCFAE9J6nYGobDvJ9", "postedAt": "2024-01-21T01:09:29.149Z", "postId": "Gixg28wwaketTAhNh", "htmlBody": "<p>Another incentive for private firms to do R&amp;D is to make their product at least 30% more valuable than the competition to compel customers to switch. Applies to b2b mostly and long-term products and contracts.</p>\n<p>And another reason for why governments don't do more R&amp;D is that they cannot do it effectively, outside of the context of concrete problems and without resources (infrastructure, tools, know-how, data, etc.) available to a concrete firm.</p>\n", "parentCommentId": null, "user": {"username": "Roman Leventov"}}]