[{"_id": "Wjh9ayJo63kPbd4Ei", "postedAt": "2017-11-24T10:46:30.506Z", "postId": "Gm4EThxfxtFY8EcQQ", "htmlBody": "<p>Thanks for this, I found it interesting. Many of your experiences resonate with mine, in charge of a charitable organisation dealing with many volunteers whose motivations seemed unclear or dubious. I found it difficult to convert people to effective donating or to get them excited about effective altruism, even though those I was working with were highly intelligent, rational and mostly vibrant people. </p>\n<p>There is certainly something to be said for trying to influence charities towards more effective interventions, rather than focusing on cause prioritisation. Often charities don't focus on this simply because they lack the tools to measure the effectiveness of interventions, not because they lack resources, have a narrow mission statement or don't think that impact is important. At the moment, I am working on a project to automate randomised control trials to make them more affordable for charities wanting to evaluate their impact in a more rigorous way.</p>\n<p>Overall I think the realist perspective you have outlined here quite refreshing. Charities do, and will continue to, work in areas that are not typically regarded as the most impactful by EA organisations. People are, and will continue to be, motivated strongly by their emotions. What can we do within those parameters to make things more effective?</p>\n", "parentCommentId": null, "user": {"username": "Kieranhammmond20"}}, {"_id": "F9GfK9xGTuJY35FYd", "postedAt": "2017-11-25T15:08:57.303Z", "postId": "Gm4EThxfxtFY8EcQQ", "htmlBody": "<p>Are there, in fact, any such trips organized by EA charities?</p>\n", "parentCommentId": null, "user": {"username": "Liam_Donovan"}}, {"_id": "PNXzaiP5ZAizHxiar", "postedAt": "2017-12-01T17:44:42.006Z", "postId": "Gm4EThxfxtFY8EcQQ", "htmlBody": "<p>Thanks for sharing this. As a previous volunteer I understand where you're coming from completely. Unfortunately the scene you described in the woman's house is one that occurs even in the United Kingdom. The conversation you had with the site visitor is quite moving, if you remember anything more specific about her answers I'd be interested to read them.</p>\n<p>I have been doing some research on volunteer programmes, especially those that take volunteers abroad and the 'voluntourism' industry. Like Liam, I'm wondering if there is scope for EA to compile a list of the more effective volunteer organisations.</p>\n<p>From what I can tell, the key difference seems to be in whether the charity is searching specifically for volunteers with skills that are not locally available. </p>\n<p>I am considering taking a voluntary placement with VSO in 2018, one that I have selected for its emphasis on skills and anti-poverty goals. Any other recommendations or comments would be very welcome.</p>\n", "parentCommentId": null, "user": {"username": "jserv"}}, {"_id": "ZtNgrFYBoceN3Gcz9", "postedAt": "2017-12-01T20:23:37.581Z", "postId": "Gm4EThxfxtFY8EcQQ", "htmlBody": "<p>Maybe JPAL-IPA field research qualifies in some sense?</p>\n", "parentCommentId": "PNXzaiP5ZAizHxiar", "user": {"username": "Liam_Donovan"}}, {"_id": "mLL932qsFLaSSHAc3", "postedAt": "2017-12-01T22:46:05.289Z", "postId": "Gm4EThxfxtFY8EcQQ", "htmlBody": "<p>As you say, people are and will be driven by emotion for the forseeable future. Therefore there will always be demand to give to charities which cater to this need, so their will always be charities that target relatively ineffective solutions. Within that though, I think charities understand that they have some scope for discretion as to how exactly to spend their budget. I'd be hopeful by nudging the right people at the right time, and by making EA a thing that people have heard about, we can have a positive impact on effectiveness.  </p>\n", "parentCommentId": "Wjh9ayJo63kPbd4Ei", "user": {"username": "jamie_cassidy"}}, {"_id": "yfAYaWWgFD8Xour82", "postedAt": "2017-12-01T22:50:45.748Z", "postId": "Gm4EThxfxtFY8EcQQ", "htmlBody": "<p>Not that I'm aware, although I do remember reading that Philipp Gruissem went to Uganda, and the Givewell guys have been on site visits. I imagine that if you are a frequent or large donor one of them would facilitate, but it would be interesting to explore an organised EA trip. </p>\n", "parentCommentId": "F9GfK9xGTuJY35FYd", "user": {"username": "jamie_cassidy"}}, {"_id": "vnePdkafyD4MndxsZ", "postedAt": "2017-12-01T23:04:45.788Z", "postId": "Gm4EThxfxtFY8EcQQ", "htmlBody": "<p>I want to be careful not to put words in her mouth here, as it's been a while now, but I can share more detail on what I took out of the conversation. Basically, to have any large impact you need to change the whole chain of events rather than focus on one particular area. Taking an extreme example, consider a mining town in Britain in the 19th century, where after primary school, working class children go to work in the mines and remain there for the rest of their lives. Improving the standard of primary education they achieve will have very little direct impact on their lives, if they still end up with the same probability of ending up in the mines. \nThis is an extreme example, and I imagine that some (more) of the kids in the schools we contributed will progress further in education and employment. Even for those that don't, it's likely better reading and writing skills will stand to them over the course of their lives. \nStill, there is a reality here that needs to be faced, there were 3 young girls who spoke at the 'closing ceremony', thanking us deeply for helping them in their dream of becoming doctors, which all 3 of them were determined to do and confident they would achieve. However, from speaking to this lady it seems very unlikely that any of these three most promising students from the school will actually make it all the way through university and medical school. </p>\n", "parentCommentId": "PNXzaiP5ZAizHxiar", "user": {"username": "jamie_cassidy"}}, {"_id": "DTyWPDJWBq2iLHMM8", "postedAt": "2017-12-02T17:53:19.938Z", "postId": "Gm4EThxfxtFY8EcQQ", "htmlBody": "<p>This is one of my long term goals. I know JPAL utilises volunteers locally, but I don't think there are any programmes to send volunteers from other countries to sites. Field researchers are employed by the organisation.</p>\n", "parentCommentId": "ZtNgrFYBoceN3Gcz9", "user": {"username": "jserv"}}, {"_id": "dEtLTjsQDgASJnzMt", "postedAt": "2017-12-03T20:17:20.315Z", "postId": "Gm4EThxfxtFY8EcQQ", "htmlBody": "<p>I'm impressed by how perceptive you are even in such an unaccustomed environment!</p>\n", "parentCommentId": null, "user": {"username": "Telofy"}}, {"_id": "7xJGtb2TuiN4wusMt", "postedAt": "2018-01-20T10:16:13.523Z", "postId": "Gm4EThxfxtFY8EcQQ", "htmlBody": "<p>This is really interesting. Thanks for sharing your experiences regarding volunteering. Your experiences really inspire me a lot towards volunteering. As I have never been on any volunteering trip yet. But after reading this, my mind has diverted to go a mission humanitaire volunteering program soon with my cousin. As my cousin always engages with different volunteering program, he recently heard about <a href=\"http://www.mission-humanitaire-afrique.org/\">mission humanitaire volunteering program</a> and insisted me to go on a trip with him, but I never think of that, but after reading your experiences I think it would be good to go with him in this life changing experience.</p>\n", "parentCommentId": null, "user": {"username": "GeorgeWilliam"}}, {"_id": "hbPagJt5sGEQwxpfw", "postedAt": "2023-02-13T02:29:05.853Z", "postId": "Gm4EThxfxtFY8EcQQ", "htmlBody": "<p>How far along is your automation of randomized control trials now? Would organizations be able to access your work at this time?</p>\n", "parentCommentId": "Wjh9ayJo63kPbd4Ei", "user": {"username": "kerschl.alexander"}}]