[{"_id": "viHWTtFWFfcc6cD47", "postedAt": "2023-05-04T11:18:07.749Z", "postId": "GmDsZDTcQkMQZMbZp", "htmlBody": "<p>Hey Maya, super excited to see more people interested in projects like this! For reference, I did this a couple months ago (https://forum.effectivealtruism.org/posts/bTMdEfeaLbGmf9LHn/reading-group-launch-introduction-to-nuclear-issues-march) and we just had our last meeting this week, in case it helps to have another example syllabus. I notice it's very similar already!&nbsp;</p><p>Here are a few takeaways from my experience:</p><ul><li>Getting participation is even harder than you expect. Of the people who signed up for my course, maybe 1/4 actually came to weekly meetings. If I could try again, I would do more pointed outreach to EA organizations tangentially working in nuclear issues, fellowship groups, and university groups.&nbsp;</li><li>Facilitation on this issue needs a lot of preparation. \"What was your biggest takeaway?\" turned into, more often than not, \"there is no political will to do anything about this glaring risk to humanity\" and it's actually really hard to turn that into a productive discussion.&nbsp;</li><li>My weekly time commitment was too large — it's good that yours is 1-2 hours of reading and 1 hour of discussion. I started providing notes every week with key takeaways from readings to facilitate discussion in case some participants hadn't done all of the reading.&nbsp;</li></ul><p>Would be really interested in talking more about this if you're looking for someone to bounce ideas off of.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Isabel"}}, {"_id": "Q3weoj2E2uLxot4QW", "postedAt": "2023-05-05T13:01:39.406Z", "postId": "GmDsZDTcQkMQZMbZp", "htmlBody": "<p>Hey Isabel, thanks so much for all of this! I'd definitely love to chat, I'll send a private message.&nbsp;</p>", "parentCommentId": "viHWTtFWFfcc6cD47", "user": {"username": "Maya Deutchman"}}, {"_id": "KpDWkJYxi8C2G9tDm", "postedAt": "2023-05-18T14:24:49.876Z", "postId": "GmDsZDTcQkMQZMbZp", "htmlBody": "<p>Thanks for putting this together Maya! I hope you get a good number of people taking part!!</p>", "parentCommentId": null, "user": {"username": "Hairmissing"}}, {"_id": "HPcmGiJDvejfAHRX7", "postedAt": "2023-05-25T19:49:27.185Z", "postId": "GmDsZDTcQkMQZMbZp", "htmlBody": "<p>Hi! Any update on timeframes for this? E.g. when you'll start, if there's a deadline on expressing interest?</p>\n<p>This seems cool and I was about to share the opportunity with a group of ~60 teenagers who went through some online programmes that I organised, but wasn't sure if it was still open?</p>\n<p>(Apologies for only seeing this almost a month after you shared it.)</p>\n<p>Thanks!</p>\n", "parentCommentId": null, "user": {"username": "Jamie_Harris"}}, {"_id": "Wh4hjFc7zc8hvLiSx", "postedAt": "2023-05-26T12:36:00.689Z", "postId": "GmDsZDTcQkMQZMbZp", "htmlBody": "<p>Hi, thanks so much for reaching out!&nbsp;</p><p>The updated timeframe is that we'll meet for the first time this Sunday (May 28) and meet for the following seven Sundays from 3-4pm ET. If you think that time might work for some of the group then feel free to share the interest form with them and I will reach out! I would also consider doing another session at a different time if there's considerable interest. Hope this helps, thanks again!&nbsp;</p>", "parentCommentId": "HPcmGiJDvejfAHRX7", "user": {"username": "Maya Deutchman"}}]