[{"_id": "AHSorcShM8Dn5B4da", "postedAt": "2023-07-15T01:05:18.178Z", "postId": "GNBJjBdMokxBrtvfK", "htmlBody": "<p>I'm a <a href=\"https://forum.effectivealtruism.org/posts/vQpk3cxdAe5RX9xzo/we-are-in-triage-every-second-of-every-day?commentId=iJm79yxewHT6ZhuNj\">noted fan of Holly</a>, but I disagree with your hagiography.</p><ul><li>Her published work at <a href=\"https://rethinkpriorities.org/animal-welfare\">RP</a> seems typical</li><li>I'm not familiar with her work at Harvard EA and I doubt you are either</li><li>Elsewhere you <a href=\"https://manifund.org/projects/holly-elmore-organizing-people-for-a-frontier-ai-moratorium\">say</a> \"Holly has launched a GoFundMe to fund her work independently; it's this kind of entrepreneurial spirit that gives me confidence she'll do well as a movement organizer!\"; I disagree that launching a GoFundMe is nontrivial evidence of success</li></ul>", "parentCommentId": null, "user": {"username": "zsp"}}, {"_id": "RCM9ckxLb4E8dpZbf", "postedAt": "2023-07-15T01:18:15.590Z", "postId": "GNBJjBdMokxBrtvfK", "htmlBody": "<p>Thanks for the feedback. I'm not sure what our disagreement cashes out to - roughly, I would expect \"if funded, Holly would do a good job such that 1 year later, we were happy to have funded her for this\"?</p>", "parentCommentId": "AHSorcShM8Dn5B4da", "user": {"username": "akrolsmir"}}, {"_id": "3chtLsv9C9Lph6duj", "postedAt": "2023-07-15T01:24:38.225Z", "postId": "GNBJjBdMokxBrtvfK", "htmlBody": "<p>I wasn't commenting on expectations, just your framing of the evidence.</p><p>(Conditional or counterfactually-conditional on Holly being funded, I expect her to mostly fail because I think most advocacy mostly fails, and 1 year later I agree you will probably still think it was a reasonable grant at the time.)</p>", "parentCommentId": "RCM9ckxLb4E8dpZbf", "user": {"username": "zsp"}}, {"_id": "wkfhs93FzSiLBwncG", "postedAt": "2023-07-15T19:00:36.295Z", "postId": "GNBJjBdMokxBrtvfK", "htmlBody": "<p>This comment came across as unnecessarily aggressive to me.</p>\n<p>The original post is a newsletter that seems to be trying to paint everyone in their best light. That's a nice thing to do! The epistemic status of the post (hype) also feels pretty clear already.</p>\n", "parentCommentId": "AHSorcShM8Dn5B4da", "user": {"username": "dan.pandori"}}, {"_id": "uNgGsKaQHcuaRXDbq", "postedAt": "2023-07-15T19:12:51.232Z", "postId": "GNBJjBdMokxBrtvfK", "htmlBody": "<p>Yeah, I hear you. [Edit: well, I think it was the least aggressive way of saying what I wanted to say.]</p><p>(I note that in addition to <i>hyping</i> the post is kinda <i>making an ask for funding</i> for the three projects it mentions--\"Some of our favorite proposals which could use more funding\"--and I'm pretty uncomfortable with one-sided-ness in funding-asks.)</p>", "parentCommentId": "wkfhs93FzSiLBwncG", "user": {"username": "zsp"}}, {"_id": "kGCEJH8hDgWZwBBjg", "postedAt": "2023-07-15T19:54:40.983Z", "postId": "GNBJjBdMokxBrtvfK", "htmlBody": "<p>I agree with Zach here (and I’m also a fan of Holly). I think it’s great to spotlight people whose applications you’re excited about, and even reasonable for the tone to be mostly positive. But I think it’s fair for people to scrutinize the exact claims you make and the evidence supporting those claims, especially if the target audience consists of potential donors.</p>\n<p>My impression is that the crux is less about “should Holly be funded” and more about “were the claims presented precise” and more broadly some feeling of “how careful should future posts be when advertising possible candidates.”</p>\n", "parentCommentId": "3chtLsv9C9Lph6duj", "user": {"username": "Akash"}}, {"_id": "3qfT7jzLfYeCzcgQ5", "postedAt": "2023-07-16T02:26:32.537Z", "postId": "GNBJjBdMokxBrtvfK", "htmlBody": "<p>Just another +1 to Zach and Akash.</p><p>A related point, speaking for myself: The likelihood of me funding these projects based on descriptions if these are mainly to hype is lower, because I may not have the time and energy to evaluate how much they are hyped, and I don't know Manifund's track record well enough to defer. On the other hand, if I have reason to believe these are well-calibrated statements then I'm more likely to be happy to defer in future. Don't feel like you should change your approach based on one individual's preferences, but just thought this might be a useful data point.</p>", "parentCommentId": "kGCEJH8hDgWZwBBjg", "user": {"username": "pseudonym"}}, {"_id": "krnzGyPsrQzriAFco", "postedAt": "2023-07-16T16:02:03.101Z", "postId": "GNBJjBdMokxBrtvfK", "htmlBody": "<p>Yeah idk, this just seems like a really weird nitpick, given that you both like Holly's work...? I'm presenting a subjective claim to begin with: \"Holly's track record is stellar\", as based on my evaluation of what's written in the application plus external context.</p>\n<p>If you think this shouldn't be funded, I'd really appreciate the reasoning; but I otherwise don't see anything I would change about my summary.</p>\n", "parentCommentId": "kGCEJH8hDgWZwBBjg", "user": {"username": "akrolsmir"}}, {"_id": "gheQQonbtFj2kxvDf", "postedAt": "2023-07-17T20:54:09.583Z", "postId": "GNBJjBdMokxBrtvfK", "htmlBody": "<p>😂</p>\n<p>Fwiw I was not offended by this comment and I think it’s valid (important!) to question potential halo-ing behavior in the context of funding grants even if it’s totally normal and nice in any other context</p>\n", "parentCommentId": "AHSorcShM8Dn5B4da", "user": {"username": "Holly_Elmore"}}, {"_id": "xbbkxFXM8yJaYghcM", "postedAt": "2023-07-17T21:23:20.412Z", "postId": "GNBJjBdMokxBrtvfK", "htmlBody": "<p>I see where Zach is coming from and I sort of agree with his assessment of my work at RP. While I'm proud of what I did (including unpublished/internal/ supporting role stuff), ultimately I don't think my work at RP was unusually impactful within my cause area, and I think my manager will agree. (I felt conflicted about wild animal welfare as a cause area and part of the reason I was ready to leave RP when I did to do moratorium organizing is that I had lost confidence that WAW was tractable. My work that is public was on the best interventions within the cause area, which were way lower impact than, say, farmed animal welfare, so in EA absolute impact terms I think that work can only be so good.)</p>\n", "parentCommentId": "AHSorcShM8Dn5B4da", "user": {"username": "Holly_Elmore"}}, {"_id": "9Jyv6LDk9NaLKWNnM", "postedAt": "2023-07-17T21:27:21.583Z", "postId": "GNBJjBdMokxBrtvfK", "htmlBody": "<p>And I also appreciate Austin’s vote of confidence and don’t think he did anything <em>wrong</em> hyping us, even if he finds it prudent to do things differently in the future</p>\n", "parentCommentId": "AHSorcShM8Dn5B4da", "user": {"username": "Holly_Elmore"}}]