[{"_id": "XexW4c2B9YeGawdAt", "postedAt": "2022-11-25T09:34:20.618Z", "postId": "GnJQaSaXRebZgrmg3", "htmlBody": "<p>Thanks so much for organizing this!<br><br>As the winner of <a href=\"https://www.givingwhatwecan.org/donor-lottery/161434944147561\">the last $500k lottery</a>, I wrote some of my thoughts in a comment <a href=\"https://forum.effectivealtruism.org/posts/nSvGaK74GyYYjCmiH/mildly-against-donor-lotteries?commentId=sjCKaFSDNksHyYRiu#sjCKaFSDNksHyYRiu\">here</a>.</p><p>If you have any questions, I would be happy to share my experience! Have a low bar to send me a DM</p>", "parentCommentId": null, "user": {"username": "Lorenzo Buonanno"}}, {"_id": "SNJLFLLw6Zg4t2xSs", "postedAt": "2022-11-25T13:17:38.056Z", "postId": "GnJQaSaXRebZgrmg3", "htmlBody": "<p>Is anything publicly disclosed about the benefactor?</p>\n<p>Looking at past lotteries, it seems that much or most of the block size did not fill . . .  meaning that the winner may be allocating mostly money that would have counterfactually been allocated by the benefactor, not by people making smaller donations.</p>\n<p>Thus, it seems that in deciding whether to enter, I should heavily weight a comparison of how effectively I think I could  allocate (with extra research and resources)  versus how effectively I think <em>the benefactor</em> could allocate.</p>\n<p>I don't know anything about the benefactor beyond that they are in a position to stake up to 2.6 MM -- which makes me think a good bit of time/resources would have gone into their decision about where to counterfactually donate the benefactor's share of each block. In contrast, the logic looks a lot more compelling if I'm predominately allocating monies from smaller donors who wouldn't have counterfactually spent much time / resources on allocation.</p>\n", "parentCommentId": null, "user": {"username": "Jason"}}, {"_id": "vhEaLbeJxWpr5hWgt", "postedAt": "2022-11-25T15:21:03.524Z", "postId": "GnJQaSaXRebZgrmg3", "htmlBody": "<p>I disagree:</p><ol><li>If you win you can always decide to ask GWWC to defer to the benefactor for the allocation (if they would be interested in doing so), or to the people or funds that you think would best allocate the winnings.</li><li>The benefactor chose to participate in the lottery, if they thought it would be worse for the world they wouldn't have, so allocating resources to something other than the lottery because you think their allocation is better than yours is counterintuitive to me.</li><li>In expectation, you are not \"taking money\" from the benefactor by playing, since the expected value is the same as donating directly. In expected value, the benefactor gets the same money that they put in.<br>To say it in a different way: the amount of money that was allocated by participants instead of the benefactor is the same as the amount of money that was allocated by the benefactor instead of the participants, so who is a better allocator seems independent from whether the lottery is a good idea.</li></ol><p>(I don't know who the benefactor is, I assume it's a large fund or an individual large donor for whom $2.6M is not a large amount of money)</p>", "parentCommentId": "SNJLFLLw6Zg4t2xSs", "user": {"username": "Lorenzo Buonanno"}}, {"_id": "rG822RLvjEm8MJXQr", "postedAt": "2022-11-25T16:19:40.758Z", "postId": "GnJQaSaXRebZgrmg3", "htmlBody": "<p>Previously the benefactor has been Carl Shulman (and I'd guess he is again, but this is pure speculation). From <a href=\"https://www.centreforeffectivealtruism.org/blog/announcing-the-2019-20-donor-lottery\">2019-2020</a> donor lottery page:</p><blockquote><p>Carl Shulman will provide backstop funding for the lotteries from his discretionary funds held at the Centre for Effective Altruism.</p></blockquote><p>The funds mentioned are likely <a href=\"https://www.openphilanthropy.org/grants/centre-for-effective-altruism-new-discretionary-fund/\">these</a> $5m from March 2018:</p><blockquote><p>The Open Philanthropy Project awarded a grant of $5 million to the Centre for Effective Altruism USA (CEA) to create and seed a new discretionary fund that will be administered by Carl Shulman</p></blockquote>", "parentCommentId": "SNJLFLLw6Zg4t2xSs", "user": {"username": "Tristan Cook"}}, {"_id": "iM92uzegp7FeCLLpC", "postedAt": "2023-01-27T21:39:54.417Z", "postId": "GnJQaSaXRebZgrmg3", "htmlBody": "<p>Hey, I missed the lottery this year. Do you know when the next one will be?</p><p>Is this also the only one running in EA right now? Does it replace the one run by the EA Funds in the past?</p>", "parentCommentId": null, "user": {"username": "Benjamin_Todd"}}, {"_id": "7Z9dDDmAbhGZKPH6r", "postedAt": "2023-02-01T04:10:10.147Z", "postId": "GnJQaSaXRebZgrmg3", "htmlBody": "<p><strong>Update: The 2022 Donor Lottery has been drawn!</strong></p><p>The draw for the donor lottery took place on January 24th and no winner was drawn for all 3 lotteries - meaning that the ‘benefactor’ was selected.</p><p>View the draws here:<br><a href=\"https://www.givingwhatwecan.org/donor-lottery/195080723894455\">$2M lottery: No winner</a><br><a href=\"https://www.givingwhatwecan.org/donor-lottery/195080723894454\">$500K lottery: No winner</a><br><a href=\"https://www.givingwhatwecan.org/donor-lottery/195080723894453\">$100K lottery: No winner</a></p><p>This means that the funds will stay in the pot and will have the chance to be won in the next lottery.</p><p>This year, there was a high chance that the ‘benefactor’ would have won each of the lotteries and this is what occurred. The probability ranged from 74% for the $100K to 96.6% for the $2M. You can view <a href=\"https://www.givingwhatwecan.org/donor-lottery\">the probabilities and payouts of past lotteries</a>.</p><p>Thank you to those who entered the lottery, and best of luck if you choose to enter in the future!</p>", "parentCommentId": null, "user": {"username": "Giving What We Can"}}, {"_id": "w6mrF6EcMhsqcKbEz", "postedAt": "2023-02-01T04:25:11.543Z", "postId": "GnJQaSaXRebZgrmg3", "htmlBody": "<p>Hi Ben,</p><p>The donor lottery should be run again at the end of 2023.</p><p>As far as we're aware this is the only donor lottery occurring.&nbsp;</p><p>And yes, the GWWC team took over the donor lottery from EA Funds at the end of 2021.</p><p>Thanks,</p><p>Grace</p>", "parentCommentId": "iM92uzegp7FeCLLpC", "user": {"username": "Giving What We Can"}}, {"_id": "tcFXKSBf6AaKiRfSi", "postedAt": "2023-02-01T12:42:16.552Z", "postId": "GnJQaSaXRebZgrmg3", "htmlBody": "<p>Thank you!</p>", "parentCommentId": "w6mrF6EcMhsqcKbEz", "user": {"username": "Benjamin_Todd"}}]