[{"_id": "KhgFQFMpyCs8f8HiB", "postedAt": "2022-11-10T04:25:59.922Z", "postId": "GoaKjhQGqAgk6sKKT", "htmlBody": "<p>I'd posit that non-technical entrepreneurship can also be a great way to learn operations, especially at a startup that is operating in some formal capacity (at minimum, is incorporated). A lot of the responsibilities perfectly overlap with operations; you start doing everything from filing corporate taxes, to setting up task management systems to track what everyone should be doing, to getting an ATS operational.</p><p>In addition to the four listed areas of mindset &amp; interest, multitasking &amp; detail orientation, learning quickly &amp; thinking in particulr ways, and having prior experience, I think that there are a few other beneficial things:</p><ul><li>Some amount of tech savviness. Nearly all aspects of running an org will require software, such as using digital banking and accounting to manage the organization's money. The organization's specific needs will also require procuring, setting up, and configuring roles and permissions for critical software, whether that's general purpose stuff like Google Workspace (for email, all documents, all storage, etc.) or configuring Swapcard without issue for EAG and Future Forum (I am reminded of how improper configuration caused the meeting scheduler to break during the last couple days of Future Forum, and I persuaded the operations team it was in fact a configuration issue, and someone finally caught and fixed it).</li><li>This was very briefly touched on in a couple phrases and the upstream thinking section in the article, but I want to strongly +1 having a \"systems optimization mindset.\" This mindset involves: (1) understanding the current systems, including how they work and their short-term and long-term pros and cons for the team, (2) identifying the various ways to improve the design of a potential system or a currently implemented system, and (3) constantly exploring and keeping in mind the possibility space of all of the other possible systems (in order to determine whether and when to switch systems).</li></ul><p>As an example of how a systems optimization mindset can be applied:</p><blockquote><p>I once joined a startup that used a credit union as a bank. While the credit union was supporting the local community with its services (a pro) and was already set up (a pro to avoid switching costs) it had no multi-user access (a serious short-term con if we needed more than one person to be able to make many types of payments), paid low interest rates (lower priority near-term and long-term con), was inefficient to use for certain use cases like sending wires (short-term and long-term con), and switching costs would accrue over time if more accounts were connected to that account (a more and more serious long-term con). Based on this it was clear to me that we needed to switch banks within several weeks, and it was abundantly clear in hindsight that it was a good decision to do that earlier rather than sticking with the credit union.</p></blockquote><p>An organization has many such systems and processes, and each of them have various ways they can be improved, and various priority levels for deciding which to take action on. This skillset is more useful when setting up an organization or managing operations for an existing organization; it isn't as helpful for repeatedly executing specific and/or recurring operational tasks (like running payroll, moderating an online community, onboarding new team members, etc.) which mostly require detail orientation.</p><p>Also, in addition to Anti-Entropy, my organization <a href=\"https://www.better.so/\">Better</a> will soon be entering the space of launching online operations resources as well as doing operations consulting! Although this sounds similar, the actual focus of the organizations will be quite different; I believe Anti Entropy will mostly focus on sharing standard best practices (like their resource portal documentation on contractors) and advising on implementing those, whereas Better will mostly focus on counterfactually changing organizational behavior via non-standard, creative/opinionated practices, like which bank to use and why organizations should pursue corporate treasury management, and what the most predictive hiring practices are and which ATS to use to best enable that.</p>", "parentCommentId": null, "user": {"username": "Brendon_Wong"}}, {"_id": "c3HxuwFGjMQnZwvDS", "postedAt": "2023-01-02T04:25:44.419Z", "postId": "GoaKjhQGqAgk6sKKT", "htmlBody": "<p>I found this guide extremely useful and well formatted. Thanks for putting the effort into writing it! The quotes from Ops people were also &nbsp;a fun way to break up such a big info dump :)</p>", "parentCommentId": null, "user": {"username": "AbbyBabby"}}, {"_id": "ydtkSKvBrpjXT9B3g", "postedAt": "2023-01-02T11:18:22.591Z", "postId": "GoaKjhQGqAgk6sKKT", "htmlBody": "<p>Thanks Abby! I'm glad you found it useful. Great to get feedback on the quotes too - I had a theory it was more readable (also put them in the consulting and ea guide), so it's great to hear positive feedback!</p>\n", "parentCommentId": "c3HxuwFGjMQnZwvDS", "user": {"username": "vaidehi_agarwalla"}}]