[{"_id": "R8TPy9ZZnrpwnGtEQ", "postedAt": "2024-01-02T00:41:27.564Z", "postId": "GPAaNikxGH7P87n3Y", "htmlBody": "<p>This is a nice read, however, in your conclusion, you asked the question \"Should we lie?\" Why that may seem self-explanatory and intriguing, where is the place of diplomacy in this regard? You know, as you've said your type of audience matters and others apart from your direct audience might or will see through the lies, here now lies the question, the exploration of diplomacy and frankness, can the two go pari-passu?</p>", "parentCommentId": null, "user": {"username": "Adebayo Mubarak"}}, {"_id": "9fDmPp2BEAqpHgA9T", "postedAt": "2024-01-02T12:01:45.813Z", "postId": "GPAaNikxGH7P87n3Y", "htmlBody": "<blockquote><p>I’m struck by how often two theoretical mistakes manage to (mostly) cancel each other out.</p></blockquote><p>If that's so, one might wonder why that happens.</p><p>In these cases, it seems that there are three questions; e.g.:<br><br>1) Is consequentialism correct?<br>2) Does consequentialism entail Machiavellianism?<br>3) Ought we to be Machiavellian?<br><br>You claim that people get the answer to the two first questions wrong, but the answer to the third question right, since the two mistakes cancel out each other. In effect, two incorrect premises lead to a correct conclusion.<br><br>&nbsp;It's possible that in the cases you discuss, people tend to have the firmest intuitions about question 3) (\"the conclusion\"). E.g. they are more convinced that we ought not to be Machiavellian than that consequentialism is correct/incorrect or that consequentialism entails/does not entail Machiavellianism.<br><br>If that's the case, then it would be unsurprising that mistakes would cancel each other out. E.g. someone who would start to believe that consequentialism entails Machiavellianism would be inclined to reject consequentialism, since they otherwise would need to accept that we ought to be Machiavellian (which they by hypothesis don't do).<br><br>(Effectively, I'm saying that people reason holistically, reflective equilibrium-style; and not just from premises to conclusions.)</p><p>A corollary of this is that it's maybe not as common as one might think that \"a little knowledge\" is as dangerous as one might believe. Suppose that someone initially believes that consequentialism is wrong (Question 1), that consequentialism entails Machiavellianism (Question 2), and that we ought not to be Machiavellian (Question 3). They then change their view on Question 1, adopting consequentialism. That creates an inconsistency between their three beliefs. But if they have firmer beliefs about Question 3 (the conclusion) than about Question 2 (the other premise), they'll resolve this inconsistency by rejecting the other incorrect premise, not by endorsing the dangerous conclusion that we ought to be Machiavellian.</p><p>My argument is of course schematic and how plausible it is will no doubt vary depending which of the six cases you discuss we consider. I do think that \"a little knowledge\" is sometimes dangerous in the way you suggest. Nevertheless, I think the mechanism I discuss is worth remembering.</p><p>In general, I think <a href=\"https://stefanschubert.substack.com/p/peaks-and-valleys-too-clever-by-half\">a little knowledge is usually beneficial</a>, meaning our prior that it's harmful in an individual case should be reasonably low. However, priors can of course be overturned by evidence in specific cases.</p>", "parentCommentId": null, "user": {"username": "Stefan_Schubert"}}, {"_id": "nsK2cAF3gTpGgfD56", "postedAt": "2024-01-02T14:31:54.948Z", "postId": "GPAaNikxGH7P87n3Y", "htmlBody": "<p>Thanks, yeah, I think I agree with all of that!</p>", "parentCommentId": "9fDmPp2BEAqpHgA9T", "user": {"username": "RYC"}}, {"_id": "nr3ovkCPzgH2rbk6G", "postedAt": "2024-01-04T14:04:33.157Z", "postId": "GPAaNikxGH7P87n3Y", "htmlBody": "<p>amazing read richard!</p>", "parentCommentId": null, "user": {"username": "Arsalaan Alam"}}]