[{"_id": "tvuCckdeuXY55JsTe", "postedAt": "2022-10-20T09:32:08.386Z", "postId": "GqLGFsZxApn87qQa8", "htmlBody": "<p>Apologies for the long-winded highbrow response, but I did really like this <a href=\"https://80000hours.org/podcast/episodes/david-chalmers-nature-ethics-consciousness/\">podcast episode on consciousness</a> from 80,000 Hours (and I listen to very few of their episodes). They discuss:</p><blockquote><ul><li>Why is there so little consensus among philosophers about so many key questions?</li><li>Can free will exist, even in a deterministic universe?</li><li>Might we be living in a simulation? Why is this worth talking about?</li><li>The hard problem of consciousness</li><li>Materialism, functionalism, idealism, illusionism, panpsychism, and other views about the nature of consciousness</li><li>The story of ‘integrated information theory’</li><li>What philosophers think of eating meat</li><li>Should we worry about AI becoming conscious, and therefore worthy of moral concern?</li><li>Should we expect to get to conscious AI well before we get human-level artificial general intelligence?</li><li>Could minds uploaded to a computer be conscious?</li><li>If you uploaded your mind, would that mind be ‘you’?</li><li>Why did Dave [the interviewee] start thinking about the ‘singularity’?</li><li>Careers in academia</li><li>And whether a sense of humour is useful for research.</li></ul></blockquote><p>I think the wakefulness/self-awareness distinction and the question of whether we can slow down time are important from an ethical perspective (I think people often dismiss something as not capable of <i>experiencing pain/happiness</i> just because it doesn't appear to be <i>self-aware</i> and presumably if things are in some sense \"perceiving things more slowly and stretching out their existence\" then those experiences should <i>count</i> for more).</p>", "parentCommentId": null, "user": {"username": "Holly"}}, {"_id": "XrcbBg85qBgM49DvF", "postedAt": "2022-12-19T16:28:54.935Z", "postId": "GqLGFsZxApn87qQa8", "htmlBody": "<p>The creative process consists of a singularity consciousness (1) in a universe of nothingness (0) vibrating and creating everything you imagine exists.\n1001100 vibrating energy\nWhat you hear and say decibels\nWhat you see angstroms\nWhat you think consciousness\nAll are just a creation and expression of vibrating energy\nThere is nothing physical\nAtoms are electrons protons neutrons\nThose are leptons quarks bosons\nThis are actually subatomic electromagnetic energy waves\nNOT PARTICLES\nI THINK THEREFORE “I AM\nTell them I AM has sent you.\nThe Creator is our collective consciousness\nPURPOSE:\nTo make our existence as a BORED LONELY SINGULARITY CONSCIOUSNESS (1) IN A UNIVERSE OF nothingness (0) a more enjoyable experience.</p>\n", "parentCommentId": null, "user": {"username": "James Germiquet"}}]