[{"_id": "stYqBwu6WywmjBh3L", "postedAt": "2024-03-21T13:13:00.640Z", "postId": "GqRMqAJFwtTQjDtye", "htmlBody": "<p><strong>Executive summary:</strong> Clear Solutions' pilot program in Kano, Nigeria showed promising results in increasing usage of oral rehydration solution and zinc (ORSZ) to treat diarrhea in children under 5 through free, preemptive community distribution by community health workers.</p><p><strong>Key points:</strong></p><ol><li>Clear Solutions aims to reduce child mortality from diarrhea by increasing usage of ORSZ in a cost-effective way, inspired by a 2019 Uganda RCT.</li><li>A pilot in Kano, Nigeria reached ~6,900 under-5 children. Surveys measured diarrhea prevalence and ORSZ usage rates before and after the intervention.</li><li>ORSZ usage rates for under-5s increased substantially, by 43-84 percentage points depending on the ward. Some diversion of ORSZ to older age groups was observed.</li><li>Results are promising but have limitations. Social desirability bias and overlap with another ORSZ program may have inflated the effect size.</li><li>Next steps include scaling up the intervention, collaborating with CHAI on their GiveWell-funded RCT, and testing operational variants to improve cost-effectiveness.</li><li>Clear Solutions seeks additional funding of ~$100K to support ambitious plans through 2024.</li></ol><p>&nbsp;</p><p>&nbsp;</p><p><i>This comment was auto-generated by the EA Forum Team. Feel free to point out issues with this summary by replying to the comment, and</i><a href=\"https://forum.effectivealtruism.org/contact\"><i>&nbsp;<u>contact us</u></i></a><i> if you have feedback.</i></p>", "parentCommentId": null, "user": {"username": "SummaryBot"}}, {"_id": "dTu5tP2QujLGf3vM7", "postedAt": "2024-03-21T16:42:10.095Z", "postId": "GqRMqAJFwtTQjDtye", "htmlBody": "<p>Thanks for sharing this report, and for all the work that went into this program so far.</p><p>Regarding the social desirability bias, and survey problems generally, there may be a few tweaks that would help with the situation.</p><ul><li>Social desirability bias in surveys can be significantly reduced by using the \"list experiment\" technique.</li><li>There might we a way to phrase the question so that the social desirability bias goes the other way. For example, instead of asking \"did you use the products\", you could ask \"do you still have the products?\"</li><li>If you ask people to keep the packaging after use, then you could ask to see it (and observe if it has been used, or not). This might also help estimate diversion.</li></ul><p>Regarding the overlap with ANRiN, have you estimated the prior probability of that happening, given the size of the programs? It makes me wonder if there is a bias in the selection of treatment locations that makes this more likely, and which might also affect results in other ways. For example, maybe both organizations are selecting treatment locations with better transportation infrastructure, in which case the program might prove harder to scale in the future.</p>", "parentCommentId": null, "user": {"username": "Ian Turner"}}, {"_id": "uafAEiMBXwnBTG7zP", "postedAt": "2024-03-22T08:02:59.838Z", "postId": "GqRMqAJFwtTQjDtye", "htmlBody": "<p>Hi Ian, thank you for your comment!</p><p>Thank you for your suggestions on the social desirability front. Do you have specific resources you could suggest regarding this? We have tried incorporating some of your points such as packet counting in the pilot but are always looking for other methods like you listed.</p><p>We unfortunately did not have an in-depth view of the ANRiN program during our pilot implementation. However, we have since gotten in touch and are aiming to understand some of your questions retrospectively if possible. Going forward, it is likely that the overlap will not be of major concern as this is the <a href=\"https://anrin.org.ng/about-us/\">final year of funding</a> for ANRiN. However, we will aim to monitor this status as well.</p><p>Regardless, your point on the treatment location bias is an important consideration that we have not paid as much attention to at the pilot stage. Instead, we focused more on quickly learning the operational feasibility and were not as meticulous in treatment location selection beyond having diverse rurality representation. We will certainly pay more attention to this as we plan for the next phase.</p>", "parentCommentId": "dTu5tP2QujLGf3vM7", "user": {"username": "Charlie Jeong"}}, {"_id": "JvHDMdYBPwqDXxSxi", "postedAt": "2024-03-22T16:18:39.529Z", "postId": "GqRMqAJFwtTQjDtye", "htmlBody": "<p>Hi Charlie, thanks for your reply.</p>\n<p>I am a dilettante and don’t have much further to offer on social desirability bias, unfortunately. You might try connecting with a social scientist, development economist, or staff at one of the EA or EA-adjacent global health and development charities operating at the frontier of evidence for their respective interventions, such as GiveWell, GiveDirectly, Living Goods, IDinsight, DMI, Evidence Action, etc.</p>\n", "parentCommentId": "uafAEiMBXwnBTG7zP", "user": {"username": "Ian Turner"}}, {"_id": "6BfcDztQB4cdJxqDd", "postedAt": "2024-03-23T06:20:07.570Z", "postId": "GqRMqAJFwtTQjDtye", "htmlBody": "<p>This point about altering the questioning is brilliant. Personally (many disagree with me) I think that social desirability and \"future hope,\" bias are so overwhelming when free stuff has been given out that there's almost no point in asking someone if they used the ors correctly.</p>\n<p>I like the \"do you still have the products\" as a betterquestion to partly mitigate that or you could take that further and ask \"can you show me the ORS\".</p>\n<p>I also find the drop in \"2 week prevalence\" suspicious pre and post, as is the pre prevalence of 38 percent in the slum. This high rate seems implausible, unless there's a cholera epidemic going on or similar (and even then it's probably still almost impossible).</p>\n<p>I also had a question about what percent of the ORS given was actually used during the 4 week period. Not what percent of diarrhea was treated with ORS, but what percent of what was overall given out was reportedly used. This is an important figure to help you check potential reporting bias as well. I might be missing it but I couldn't see it there.</p>\n<p>Interested to hear your thoughts on this. Thanks for all the amazing work</p>\n", "parentCommentId": "dTu5tP2QujLGf3vM7", "user": {"username": "NickLaing"}}, {"_id": "h5FsugGpsyHNTMrFm", "postedAt": "2024-03-25T15:09:08.020Z", "postId": "GqRMqAJFwtTQjDtye", "htmlBody": "<p>Hi Nick, thanks for sharing your thoughts and excellent points.</p><p>Regarding the urban slum rates, thank you for calling this out! On digging back into it, we realise we unfortunately missed copy-pasting corrected prevalence data into the report when we fixed a code bug for urban slum Baseline (which initially included diarrhoea instances for an additional week for both timeframes). The other wards used a later survey version with separate logic and are not impacted. The pre-post results data in the report&nbsp;<i>were</i> updated after the fix, so no change needed there.</p><p>That all said, the&nbsp;<i>corrected</i> urban slum Baseline 2-week and 4-week prevalences of 30.1% and 41.8% (will update original post) are still comparatively high.</p><p>Regarding the proportion of all distributed ORS that was used, we asked households how many ORS sachets they used by age-group for the 6-week follow-up period and counted how many sachets they had left, so we do have those extra signals with which to scrutinise their claimed ORS treatment rates. A complicator here is the unknown volume of ORS used in a given treatment; 2 x one litre sachets are provided per co-pack, but one litre can be sufficient depending on the diarrhoea duration and whether the caregiver abides by the instruction to discard prepared ORS after 24 hours. Nonetheless, this is certainly something for us to look into further.&nbsp;</p><p>Thanks again for your thoughtful comments and for helping improve our program!</p>", "parentCommentId": "6BfcDztQB4cdJxqDd", "user": {"username": "Martyn J"}}, {"_id": "JbZWbKCPfBDRfuD9Q", "postedAt": "2024-03-26T08:16:55.574Z", "postId": "GqRMqAJFwtTQjDtye", "htmlBody": "<p>Nice one great reply!&nbsp;</p><p>Just to double check (still not completely clear) did you distribute to about 1000 households and about 930 of those used the ORS over a 6 week follow up period? Or did you distribute to more than that, but about 1000 households said their kid had diarrhoea in that time?&nbsp;<br><br>A bit confused whether 93% - ish of all families given ORS used it over 6 weeks or something different? Obviously it would be impossible for that higher proportion of the families to have kids with Diarrhoea in only a 6 week period - still trying to get my head around this.<br><br>Nick.</p>", "parentCommentId": "h5FsugGpsyHNTMrFm", "user": {"username": "NickLaing"}}, {"_id": "8zuvAHbwx3d4x9pXa", "postedAt": "2024-03-26T11:04:34.774Z", "postId": "GqRMqAJFwtTQjDtye", "htmlBody": "<blockquote><p>whether 93% - ish of all families given ORS used it over 6 weeks or something different?</p></blockquote><p>Something different :) But I think I see what you’re getting at.</p><p>Total&nbsp;<i>distribution</i> was to ~4000 households (families) across the 4 wards. The question on usage by age group of ‘our’ ORS was asked at follow-up, with approx. 2400 HHs surveyed.&nbsp; Of the ORS sachets <i>used</i> by HHs in that sample, the data in the table “% Clear Solutions ORS sachets used, % by age group” expresses&nbsp;<i>who</i> (by age group) used them.</p><p>I think you’re asking what proportion of&nbsp;<i>all</i> the ORS provided was used (1) by anyone, and (2) by under-5s. This is a good point, as it gives an idea of what revisit cadence, or potential increase in packets given-per-child, would be needed for continuous coverage.</p><p>Said sample of HHs reported 3317 co-packs received (ie. 6634 ORS sachets, 2 per co-pack), with 2046 sachets reported used (with ~80%, varying by ward, used for under-5s). So 2046/6634 = 30.8% of the ORS sachets distributed were reported used within the 6-week follow-up period. We'll prep this also for addition to the report - thank you!</p>", "parentCommentId": "JbZWbKCPfBDRfuD9Q", "user": {"username": "Martyn J"}}, {"_id": "aQKwGvisDGnzXkksc", "postedAt": "2024-03-26T12:09:31.342Z", "postId": "GqRMqAJFwtTQjDtye", "htmlBody": "<p>Thanks that makes sense. I was actually trying to ask what proportion of the households reported using ORS, not what percent of sachets were used. I think I get most of it it now nice one, still one thing I'm not clear on is...</p><p><strong>Of the 2400 Households surveyed, how many of them reported using any ORS at all after 6 weeks? </strong>That's a crucial number for me both as a sanity check and uptake check. I'm not sure if that's in this report here or not<br><br>Just my 2 cents, but I think its helpful to start a report with the really basic design stuff, ie We gave out xxxx ORS sachets to XXXX Families while doing XXXXX education, then followed them up after XXXX weeks - I struggled a little bit to follow the process here. Not a big deal</p>", "parentCommentId": "8zuvAHbwx3d4x9pXa", "user": {"username": "NickLaing"}}, {"_id": "BYZkCmAKj2vZC6nRF", "postedAt": "2024-03-26T14:48:08.763Z", "postId": "GqRMqAJFwtTQjDtye", "htmlBody": "<p>That's good feedback, thanks: we've perhaps leapt too directly from the conceptual description to the results, without properly quantifying the basic operation. Noted for improvement.</p><p>To (finally, I hope!) answer your question, of the ~2400 (2381) households surveyed - actually 2163 once we filter-out the non-consents:</p><ul><li>1518 (70.1%) reported <i>any</i> occupant using ORS from <i>any source; and</i></li><li>924 (42.7%) reported <i>any</i> occupant using ORS from <i>our distribution</i>.</li></ul><p>in the 6 weeks of our follow-up period.</p><p>This is \"all wards\" data, so may skew somewhat according to exact response numbers per ward. Please take these numbers as provisional / subject-to-error in the name of a timely response.&nbsp;</p><p>We have not looked at them in more depth yet, but I see the value in this perspective and we'll think more about what we might learn from them. I'm also interested in your take on what we might infer from these, Nick (and others).</p>", "parentCommentId": "aQKwGvisDGnzXkksc", "user": {"username": "Martyn J"}}]