[{"_id": "t9nPeYbcSMqZstErA", "postedAt": "2015-03-02T11:38:51.373Z", "postId": "GQTgTtvja4toZHwrk", "htmlBody": "<p>This is a nice document that has produced a lot of interesting discussion in the GDoc comments. I'm struck by how a handful of the ideas were already done or being done, suggesting that .impact isn't succeeding in its aim to be a venue for communicating and coordinating EA projects. I'd be interested to hear ideas for how to better do that, as I think communication and coordination is somewhat lacking.</p>\n", "parentCommentId": null, "user": {"username": "Tom_Ash"}}, {"_id": "fifahPJ8quy7eu5BA", "postedAt": "2015-03-13T11:24:58.232Z", "postId": "GQTgTtvja4toZHwrk", "htmlBody": "<p>That's a great point Tom. Is .impact widely advertised? </p>\n", "parentCommentId": "t9nPeYbcSMqZstErA", "user": {"username": "tomstocker"}}, {"_id": "bSjoBtbedNPHJSgk2", "postedAt": "2015-03-14T12:21:41.139Z", "postId": "GQTgTtvja4toZHwrk", "htmlBody": "<p>I don't generally have the impression that when people have a new EA idea, they check if .impact has done or is doing it. I've seen many examples of duplication or near-duplication*.</p>\n<p>Partly it's an advertising issue, partly I think that when .impact is marketed it's more 'If you want projects to work on, come to this' as opposed to 'if you have an idea for a project, talk to us'.</p>\n<p>*To take the one that has come up most, I think at least 4 people from different groups have independently talked to me about a REG-for-finance-people concept. </p>\n", "parentCommentId": "t9nPeYbcSMqZstErA", "user": {"username": "AGB"}}, {"_id": "Kke75TooCj9fJsunF", "postedAt": "2015-03-15T06:10:21.094Z", "postId": "GQTgTtvja4toZHwrk", "htmlBody": "<p>No, I think it's fairly poorly advertised. I plan to post about it here on the forum at some point (though it'd be great if someone beat me to it!) This poll suggested knowledge was middling: <a href=\"https://www.facebook.com/groups/effective.altruists/permalink/832289520160740/?qa_ref=qd\">https://www.facebook.com/groups/effective.altruists/permalink/832289520160740/?qa_ref=qd</a></p>\n<p>I've put this on the agenda to discuss in tomorrow's meeting, including asking if anyone would be up for writing that post.</p>\n", "parentCommentId": "fifahPJ8quy7eu5BA", "user": {"username": "Tom_Ash"}}, {"_id": "X86iQDJFnwxfaKsJg", "postedAt": "2017-11-19T10:44:23.908Z", "postId": "GQTgTtvja4toZHwrk", "htmlBody": "<p>Hi all,</p>\n<p>I'm currently participating in the MIINT Impact Investing programme (<a href=\"http://www.themiint.org\">www.themiint.org</a>) at the Said Business School in Oxford, and trying to find opportunities to invest in high-impact/low-medium-return projects or companies. They need to be at a fairly early stage in their development and looking to raise $250k to $750k in the next round. We're cause agnostic and considering any opportunities to improve welfare for anything sentient.</p>\n<p>If it exists, can you please point me in the direction of something like the above list, but for existing companies? I've not been able to find any info on EAventures; did it not get off the ground?</p>\n<p>Thanks very much in advance!\nHuw</p>\n", "parentCommentId": null, "user": {"username": "huwfthomas"}}]