[{"_id": "Xz93CrEQeLAHfcAKQ", "postedAt": "2022-11-09T23:32:45.672Z", "postId": "Gr3t8vWcWpwBoNNTk", "htmlBody": "<p>Banning slaughterhouses is essentially a ban on eating meat, right? I can't imagine that 43% of the US public would support that, when no more than 10% of the US public is vegetarian in the first place. (Estimates vary, you say 1% in this article, and 10% is the most aggressive one I could find.)</p><p>It seems much more likely that these surveys are invalid for some reason. Perhaps the word \"slaughterhouses\" confused people, or perhaps people are just answering surveys based on emotion without bothering to think through what banning slaughterhouses actually means.</p>", "parentCommentId": null, "user": {"username": "Kevin Lacker"}}, {"_id": "KDbK8xWsuHidWC62Q", "postedAt": "2022-11-10T01:06:29.148Z", "postId": "Gr3t8vWcWpwBoNNTk", "htmlBody": "<p>This is great data to have! Thanks for collecting and sharing it. I think the Sioux Falls <a href=\"https://www.metaculus.com/questions/12284/support-for-sioux-falls-slaughterhouse-ban/\">(Metaculus underestimate of the 48% ban support)</a> and Swiss <a href=\"https://www.metaculus.com/questions/12300/will-switzerland-ban-factory-farming-2022/\">(Metaculus overestimate of the 37% ban support)</a> &nbsp;factory farming ban proposals are particularly interesting opportunities to connect this survey data to policy results. I'll share a few scattered, preliminary thoughts to spark discussion, and I hope to see more work on this topic in the future.</p><ul><li>These 2022 results seem to be in line with the very similar surveys conducted by Rethink Priorities in 2019, which I found very useful, but I don't know if those results have been shared publicly. Will you be sharing that data too? I know it's been eagerly anticipated, and Sentience Institute has held off on similar work while waiting for it. I'm not sure if that 2019 data is now seen as just a pilot for this 2022 data collection?</li><li>In addition to 2017 and 2020, Sentience Institute asked these questions in <a href=\"https://www.sentienceinstitute.org/aft-survey\">the 2019 and 2021 Animals, Food, and Technology (AFT) surveys with similar results</a>.</li><li>In 2017, we <a href=\"https://www.sentienceinstitute.org/animal-farming-attitudes-survey-2017#table-\">preregistered credible intervals </a>and informally solicited estimates from many others. <strong>The data was surprisingly ban-supporting relative to priors, which may be a more important takeaway than any post-hoc explanation.</strong> I didn't preregister any CIs for the 2019 or 2022 RP results. I think these drops in ban support are around what I'd expect, but it's very hard to say in hindsight, especially with other variation (e.g., different outcome scales, presumably different samples).</li><li>The Sentience Institute AFT survey also has questions with pro/con information, e.g., \"Some people think that we should ban all animal farming and transition to plant-based and cultured foods, to reduce harm to humans and animals. Others think that we should keep using animals for food, to provide the conventional meat consumers are used to eating. Where would you place yourself on this scale?\" (wording based on <a href=\"https://gssdataexplorer.norc.org/variables/759/vshow\">the GSS</a>). <strong>That wording seems to </strong><a href=\"https://www.sentienceinstitute.org/aft-survey-2021#means-and-distributions\"><strong>elicit much stronger ban support</strong></a><strong> than this new wording (though take with a large grain of salt due to other variation in the surveys), which seems to make sense as it is much more ban-supporting than the ban-opposing \"it is wrong to kill animals\" and \"right to eat meat if they choose\" wordings.</strong> Concretely, on a 1–6 support scale, we found a mean of 4.12 (95% CI: 4.04–4.21) &nbsp;for \"ban all animal farming\" with our nationally representative sample in 2021. I think it's fair to say that's much higher despite also having pro/con information, and <strong>I think it's important qualification for interpreting the 2022 RP results that people may miss out on in this post.</strong></li><li>Social scientists have long asked \"Is there really any such thing as public opinion?\" <a>(Lewis 1939)</a>, and I think the majority answer has been some version of &nbsp;\"public opinion does not exist\" (e.g., <a href=\"https://www.semanticscholar.org/paper/Public-Opinion-and-Public-Opinion-Polling-Blumer/1bdf4991e814553094b045be1bd481d8706883c8\">Blumer 1948</a>, <a href=\"https://is.muni.cz/el/fss/podzim2019/POLn4102/um/blok1/Bourdieu_PO_Does_Not_Exist.pdf\">Bourdieu 1972</a>): There are many interesting wordings to consider: simple vs complex, ban-supporting vs ban-opposing, socially desirable and acquiescing vs socially undesirable and anti-acquiescing, politically left vs right favored, financially incentivized, politically engaged, etc. <strong>All question wordings matter, and none are objectively correct or objectively biased. I think we may disagree on this point because you say some question wordings &nbsp;\"are biased towards answering “Yes”...\", though you may mean some subjective standard of bias, such as distance from likely counterfactual ballot measure results.</strong> Some wordings more naturally jibe with what people have in mind when they see survey results—I prioritize simple wordings in part for this reason—but ideally we share the exact survey wording alongside percentages or scores whenever possible to ensure that clarity.</li><li>If you have time, what was the sample (M Turk, Prolific, Civis Analytics, Ipsos Omnibus, Knowledge Panel, etc.), what were the demographics, and was it weighted for representativeness, and if so, how?</li><li>What exactly do you mean by \"strong\" in \"strong basis for more radical action\"? One operationalization I like is: <strong>All things considered, I think these survey and ballot results should update the marginal farmed animal advocate towards more radical approaches relative to their prior.</strong> I'd love to know if you agree.</li></ul><p>Well-done again on this very interesting work! <i>[minor edits made to this comment for clarity and fixing typos]</i></p>", "parentCommentId": null, "user": {"username": "Jacy"}}, {"_id": "FHbwuWfMMZ4rCKDmD", "postedAt": "2022-11-10T01:45:19.295Z", "postId": "Gr3t8vWcWpwBoNNTk", "htmlBody": "<p>Thanks for doing this important work! I think this is one of the most important findings in animal advocacy research, so understanding it deeply and accurately is critical.</p><p>My operating model of the underlying psychology is that \"slaughterhouse\", \"factory farm\" and \"animal farming\" &nbsp;can suggest to varying degrees the idea of \"place where animals are treated poorly.\" People &nbsp;generally don't want animals to be treated poorly, so they express support for banning such places. Then, if it's made clear that, in fact, slaughterhouses are just where animals are killed for meat, this support goes away.</p><p>If we think of people as being pro-animal welfare, but also pro-meat, all the data is explainable. As activist, it can be easy to go from \"animals are mistreated on farms\" to \"we shouldn't eat them,\" but for most people I think the more natural response is \"The people mistreating them should stop.\"</p><p>Just wanted to throw this out there, since I think all this data is still consistent with a surprisingly pro-welfare stance of a lot of people :)</p>", "parentCommentId": null, "user": {"username": "reyeahman0920"}}, {"_id": "r8grbhBoj9sxP3ohy", "postedAt": "2022-11-10T03:58:16.062Z", "postId": "Gr3t8vWcWpwBoNNTk", "htmlBody": "<p>Yes I implore readers to defer to common sense here. The face validity of there results is poor and I would suggest further work is done to improve the survey methodology, understanding people's understanding of the question and how they'd change their response in relation to a political campaign where there would be a saturation of information from very powerful commercial agricultural interests. I'm sick of seeing EA making political blunders.</p>\n", "parentCommentId": "Xz93CrEQeLAHfcAKQ", "user": {"username": "Pseudonym101"}}, {"_id": "4eHdcx9rn2LcfF5vu", "postedAt": "2022-11-10T18:32:03.110Z", "postId": "Gr3t8vWcWpwBoNNTk", "htmlBody": "<p>Thanks for reading and engaging with our work!</p><ul><li>In 2019 we conducted some exploratory small-N, low-confidence studies on this topic that informed these high-quality, larger N studies. We feel comfortable presenting these recent results as we want to promote the norm of advocates choosing strategies and messages based on the best quality evidence, so would rather the community update based on the results of high-quality studies rather than low-confidence small-N studies where the wrong inferences may be drawn.</li><li>[Update 2022-Nov-18: I added a methods section to make it clearer for readers. Thanks Jacy for flagging this issue]. Respondents were recruited via Prolific and surveyed using Qualtrics and were weighted for representativeness using 5-year 2019 American community survey data and general social survey data. More details and data are available in the OSF project, but let us know if it's not clear or something is missing since the 2nd survey was part of a <a href=\"https://osf.io/3unzb/?view_only=\">larger survey</a> that is <a href=\"https://osf.io/e7jb6\">described here</a> which we have not finished publication of yet. (minor update- the pre-registration for the experimental study was still, unintentionally, embargoed at the time of publication so that information wasn't easily accessible for readers, but it has been lifted and should be available <a href=\"https://osf.io/gjyzu/registrations\">here</a> by Nov 12)</li><li>I don't think one should take a survey showing 16% support for banning slaughterhouses when animal welfare frames are used as reason for the marginal farmed animal advocate to update towards more radical approaches relative to their prior, unless that farmed advocate assumed there would be basically 0% support. In practice, I imagine many advocates have been relying on surveys showing much higher support as their benchmark so this survey would update them toward more pessimism.&nbsp;</li><li>More generally, given the clear variation in support results from well-done surveys from different organizations on this specific item it doesn't seem advisable for advocates to update their beliefs strongly on how support for other specific or the whole class of radical policies will be. As we wrote, it would be better to test the specific policies in question with a variety of messages to get closer to understanding how the public might actually act if given the chance to vote. And of course compare these to more moderate asks that the movement thinks are also worthwhile in expectation. I don't think we should take attitudes towards a specific policy as very indicative of attitudes to all of animal agriculture or other anti-factory farming policies. I also don't think we should take attitudes towards all of animal agriculture as indicative of support for specific policy proposals advocated for under specific messages. It was the claim that support for banning slaughterhouses should encourage advocates to push stronger messages and policies that we wanted to raise more questions about.&nbsp;</li><li>Thanks for the reminder about the 2021 AFT survey!- which if I'm correct also showed ~43% support for banning slaughterhouses, when including No Opinion. I'll add it to the report.</li></ul>", "parentCommentId": "KDbK8xWsuHidWC62Q", "user": {"username": "Incogneilo18"}}, {"_id": "3vzNmmjdTgNDyzjXq", "postedAt": "2022-11-10T23:46:25.700Z", "postId": "Gr3t8vWcWpwBoNNTk", "htmlBody": "<p>Thanks for doing this work Neil (and the great RP survey team) - it's super interesting and helpful as useful! I'm particularly quite interested in this idea you had in your conclusion:</p><blockquote><p>It would be better to test people's responses to more detailed messages and policy proposals, paying special attention to how radical messages compare to counterfactual moderate messages. One could also test a radical ask (ban factory farming) and a moderate ask (labelling for cage-free eggs, say) each with a radical message (\"meat is murder\") versus a moderate one (\"human/consumer welfare\").&nbsp;</p></blockquote><p>Is RP planning on doing anything in this vein? I know of <a href=\"https://academic.oup.com/pnasnexus/article/1/3/pgac110/6633666\">one experimental paper</a> released quite recently that tested this for both different radical messages, and also radical tactics (in a 2x2 design). They found that radical messages (ending all animal use vs improve animal welfare) didn't increase support for more moderate messages, but the use of radical tactics did. The author isn't an animal person (I'm fairly sure) so the different conditions were quite broad - which you can see in the supplemental files of the paper. For example, the radical agenda spoke about &nbsp;'eliminating the human consumption of meat and creating a \"vegan world\"' whereas the moderate treatment focused on 'increasing the number of farms using humane methods' which is fairly coarse-grained!&nbsp;</p><p>Would be interesting to try replicate this experiment with more specific policy proposals as you mention, as it will probably yield more realistic results.&nbsp;</p>", "parentCommentId": null, "user": {"username": "JamesOz"}}, {"_id": "qA98kpkePqPr3S2KW", "postedAt": "2022-11-14T20:37:15.759Z", "postId": "Gr3t8vWcWpwBoNNTk", "htmlBody": "<p>We should also note that Norwood (one of the authors who replicated SI’s original 2017 study) this year ran a new slaughterhouse ban survey experiment&nbsp;&nbsp;([Britton &amp; Norwood 2022](<a href=\"https://doi.org/10.1017/aae.2022.17\"><u>https://doi.org/10.1017/aae.2022.17</u></a>))&nbsp;and found lower support. (I only just received the data from them so I couldn’t include it in the post).<br><br>Here is my summary from just skimming the article and quickly aggregating the data.<br><br>They test a hypothesis that the question ordering in the 2017 SI study cued respondents' ideal self (like whether voting is a moral virtue) rather than their common self (like whether they actually voted). Their theory is that by asking respondents first whether they agreed with statements about meat reduction, discomfort with the way animals are used in the food industry, and animal sentience it cued their ideal self so that “the desire to not appear hypocritical induced them to activate a mixture of their ideal and common self” when answering questions about bans on animal farming, factory farming, and slaughterhouses.</p><p><br>The actual design of their study is a little too complicated to explain here (involving four treatments that altered the order and wording of ideal and common self questions, some food-related and some non-food related, as well as inserting buffer questions), but basically some respondents saw the ban questions before the ideal self questions, and others saw them in the same order as in the original 2017 SI study. Furthermore, to build on their tests about whether respondents understood the implications of bans,&nbsp; \"roughly half of the subjects are given the [common self] statements exactly as they appeared on the Animal Sentience survey, while the other half contain an addition [. . .] For example, some see the statement “I support a ban on slaughterhouses” while others see the statement “I support a ban on slaughterhouses and will stop eating meat”. \"</p><p>While the primary aim of their study was to test something they call “identity inertia” and they fail to find convincing evidence of it, their finding on the slaughterhouse ban issue was \"once individuals are informed about the implications of actions like banning slaughterhouses, they are less eager to do so.\"&nbsp;</p><p>Data were collected via an online survey through Qualtrics from August to October 2019 of a representative sample of nearly 2600 drawn from the U.S. population. A subset of the results (N=1528) show</p><ul><li>26.48% \"agreed\" with the statement \"I support a ban on slaughterhouses\" (36.5% disagreed, 37.02% no opinion) (N=759)</li><li>18.21% \"Agreed\" with the statement \"I support a ban on slaughterhouses and will stop eating meat.\" (58.13% disagreed, 23.67% no opinion (N=769)</li></ul><p>(Though Norwood say they couldn’t confirm this was correct since they never went into the data to get raw numbers like that, and I couldn't see an easy way to break these results down according to whether respondents saw the ideal-self or common-self questions first- though that probably doesn't matter since Norwood didn't find a lot of evidence that it matters)</p><p><br>&nbsp;</p>", "parentCommentId": "KDbK8xWsuHidWC62Q", "user": {"username": "Incogneilo18"}}, {"_id": "QqGFEFb6486xyBrMC", "postedAt": "2022-11-23T22:20:40.786Z", "postId": "Gr3t8vWcWpwBoNNTk", "htmlBody": "<p>You might also be interested in this recent polling by Data for Progress* on likely U.S. voters' attitudes around farm animal cruelty. We found strong support across political ideologies for preventing farm animal cruelty. Note, though, that we did not ask about things like banning slaughterhouses.<br><br><a href=\"https://www.dataforprogress.org/blog/2022/8/2/voters-demand-farm-animal-protections-from-both-politicians-and-companies\">https://www.dataforprogress.org/blog/2022/8/2/voters-demand-farm-animal-protections-from-both-politicians-and-companies</a><br><br>* I work here, but was not involved in fielding this survey.</p>", "parentCommentId": null, "user": {"username": "KyleGracey"}}, {"_id": "W2Ffovtjr2gXqwjhn", "postedAt": "2022-11-24T01:59:55.902Z", "postId": "Gr3t8vWcWpwBoNNTk", "htmlBody": "<p>In the fourth decade of animal advocacy, I honestly wonder what has hurt animals more than AR advocates pointing to polls.&nbsp;</p><p>Why would we ever, ever, ever look at opinion polls, when every day, everyone is casting an actual ballot at the grocery store and restaurant?&nbsp;</p><p>This reminds me of all the interviews where Beyond Meat's Ethan Brown said, \"People tell me they don't want GMOs.\" He is simply talking to the wrong people. Nearly everyone only cares about cheap meat. Full stop. Nothing else matters, no matter what they say.</p>", "parentCommentId": null, "user": {"username": "MattBall"}}, {"_id": "ciHemsYp4nh2MHQPH", "postedAt": "2022-11-24T17:51:42.240Z", "postId": "Gr3t8vWcWpwBoNNTk", "htmlBody": "<p>I think polls can be useful indicators for the likelihood of success of a ballot measure (e.g. banning intensive confinement,  like some US states have), but they have to be framed concretely and with enough context to emphasize the costs to consumers. Also, people have voted to ban cages and crates despite it increasing their costs and not already really buying cage-free or crate-free. See this for some discussion:\n<a href=\"https://jaysonlusk.com/blog/2019/2/18/why-dont-we-vote-like-we-shop\">https://jaysonlusk.com/blog/2019/2/18/why-dont-we-vote-like-we-shop</a></p>\n", "parentCommentId": "W2Ffovtjr2gXqwjhn", "user": {"username": "MichaelStJules"}}]