[{"_id": "vNKwp6wMF8rqf3aYS", "postedAt": "2023-11-05T16:36:38.176Z", "postId": "GRYFJGnye2gCxCTG4", "htmlBody": "<p>* <i>Apologies that I'm not able to engage more in depth with the arguments presented here at the moment. So only sharing some quick thoughts for now.</i></p><blockquote><p>This is hard because the benefits of sponsorship are legible and predictable, and the costs are nebulous and erratic. But that makes it all the more important to deliberately investigate them.</p></blockquote><p>I <strong>agree somewhat</strong> with the first sentence. Some benefits from fiscal sponsorship are much more predictable than others. Impact being one of the less predictable ones.</p><p>I <strong>agree strongly</strong> with the second sentence. I think it is part of any fiscal sponsor (and sponsees) due diligence to do that. Fiscal sponsorship relationships should be reassessed continually and with care. I think this <a href=\"https://www.arabellaadvisors.com/wp-content/uploads/2021/09/Fiscal-Sponsorship-White-Paper.pdf\">white paper </a>describes this very well.</p><blockquote><p>My guess is that this will show that having multiple large orgs share a legal structure is not worth it, but using sponsorship for short term projects or a launching pad will continue to make sense.</p></blockquote><p>This seems roughly right. However this depends a lot on:</p><ul><li>The risk profile of the projects</li><li>How the legal structure itself is set up, for instance if the fiscal sponsorship relationship is set up as a <a href=\"https://fiscalsponsorship.com/the-models-summary/\">Model L relationship</a>, most of the liabilities actually remain with the sponsee.</li><li>Among other factors</li></ul><p>I think something that I'm missing in this post is more mention that fiscal sponsorship is <a href=\"https://www.socialimpactcommons.org/member-directory#!directory/map\">widely practiced</a> (especially in the US). However, as Emma Geering puts it - way better than I could - <i><u>:&nbsp;</u></i></p><p><i><u>\"</u>As a practical construct that addresses market failures and motivates social change, fiscal sponsorship needs formal recognition in the law. New state corporate codes and Internal Revenue Code provisions cementing fiscal sponsorship in the doctrines supporting nonprofit law are necessary to continuous growth in the nonprofit sector.</i>\" (<a href=\"https://repository.uchastings.edu/hastings_law_journal/vol72/iss5/6/\"><i><u>The Legal Value of Fiscal Sponsorship: A Proposal of New Law</u></i></a><i><u>)</u></i></p><p><i><u>(I work within the Special Projects team at RP, but all views are my own)</u></i></p>", "parentCommentId": null, "user": {"username": "CristinaSchmidtIbáñez"}}, {"_id": "6xXjLYkDMRztqLBp6", "postedAt": "2023-11-06T00:41:35.459Z", "postId": "GRYFJGnye2gCxCTG4", "htmlBody": "<p>Sharing some quick personal thoughts, all views based on EA forum posts:</p><p>&nbsp;</p><blockquote><p>there are very few EA organizations, in the legal sense</p></blockquote><p>Only if you have a very strict definition of what counts as an EA org. There are probably <a href=\"https://whimsical.com/ea-organizations-4EAx6c2MPbTRVjtjUBXfhx\">dozens</a> related to the EA brand and at least <a href=\"https://jobs.80000hours.org/?query=gates\">hundreds</a> doing EA in practice</p><blockquote><p>The king umbrella is Effective Ventures Foundation, which hosts CEA, 80k, Longview, EA Funds, Giving What We Can, Asterisk magazine, Centre for Governance of AI, Forethought Foundation, Non-Trivial, and BlueDot Impact. Posts on the castle&nbsp;<a href=\"https://forum.effectivealtruism.org/posts/xof7iFB3uh8Kc53bG/why-did-cea-buy-wytham-abbey?commentId=u3yJfbm2pes8TFpYX\"><u>also describe it</u></a> as an EVF project, although it’s not listed on the website.</p></blockquote><p><a href=\"https://www.wythamabbey.org/\">https://www.wythamabbey.org/</a> confirms that \"Wytham Abbey is a project of the Effective Ventures group\".</p><blockquote><p>The easiest thing to do is just take fewer risks. Don’t buy retreat centers that could be described as lavish.</p></blockquote><p>Arguably, being less risk seeking is a good thing, that many people have been intensely <a href=\"https://forum.effectivealtruism.org/posts/i7DWM6zhhPr2ccq35/thoughts-on-ea-post-ftx\">advocating</a> for <a href=\"https://forum.effectivealtruism.org/posts/aryJKRDxLejPHommx/sbf-extreme-risk-taking-expected-value-and-effective#Tentative_thoughts_on_where_I_think_SBF_went_wrong_in_his_thinking\">after</a> FTX, if the risks involve the EA project as a whole. And often they do, regardless of the legal status, see e.g. Nonlinear. See also all the recent posts about the need for \"more governance\".</p><blockquote><p>They gave me a new, more complicated story. Maybe it was good they never published those comments, because they were coming from an angry place.</p></blockquote><p>This seems likely, given the asymmetry of the negative and positive consequences of posting angry comments, it makes me update in favor of more governance being a good thing.</p><blockquote><p>Will MacAskill has written up reflections on the SBF debacle, but EVF told him not to publish.</p></blockquote><p>This could be seen as censorship, but also as preventing MacAskill from deciding the narrative or influencing witnesses before the investigation is concluded. On priors, I think we should assume that there's a reasonable chance that the board had good reason to prevent this, and they're not just being evil. It's not obvious that more governance was bad in this case, compared to MacAskill doing what he thought was best (as a general process, even if you absolutely trust MacAskill in particular).</p><blockquote><p>it didn’t raise any alarm bells for me when my first check from “the FTX Future Fund (regrantor program)” came via CEA, and the second used the name North Dimensions.</p></blockquote><p>When someone accepts money from an ethically and legally dubious entity like a cryptocurrency exchange, I would be extremely surprised if the reaction would be different because they have interacted with fiscally sponsored projects in the past. If the money came from Binance instead of FTX, would an account from a random American company be suspicious? What kind of alarm bells would it raise, that they use different legal entities to make small transactions since the main business is not licensed in the US?</p><p>I find it really weird to blame the practice of fiscal sponsorship for having accepted FTX money given the <a href=\"https://web3isgoinggreat.com/\">base rates of fraud in crypto</a>.</p><blockquote><p>training people to accept misdirection creates cover for malfeasance</p></blockquote><p>All EV projects and all RP projects seem very clearly labeled as such, what do you think is the misdirection?</p><blockquote><p>EA should grapple with the risk creation and risk aversion caused by fiscal sponsorship, especially umbrella orgs, and how those trade-off against the benefits.</p></blockquote><p>Definitely strongly agree with this, see e.g. QURI asking for <a href=\"https://forum.effectivealtruism.org/posts/P55P4YJoncfQmZ2RR/downsides-of-small-organizations-in-ea#More_Fiscal_Sponsorship_Programs\">more fiscal sponsorship</a> (and mentioning not getting a sponsorship in their <a href=\"https://quantifieduncertainty.org/78a6811f8e2c4d04b66107e063e0a5cd\">mistakes</a> page) and the other 13 forum posts tagged \"<a href=\"https://forum.effectivealtruism.org/topics/fiscal-sponsorship\">fiscal sponsorship</a>\" including this post arguing for <a href=\"https://forum.effectivealtruism.org/posts/mLua7KbJRbXa6oeZ3/more-centralisation\">More Centralisation</a>.</p><p>I would expect most people to agree with you that sponsorship is very good for small projects but has downsides for large projects, but some to disagree on the trade-offs and what counts as \"large\"</p>", "parentCommentId": null, "user": {"username": "AnonymousAccount"}}, {"_id": "neLn3txxeipmmBjhd", "postedAt": "2023-11-07T17:06:13.421Z", "postId": "GRYFJGnye2gCxCTG4", "htmlBody": "<p>Some quick thoughts:</p><ul><li>Happy to see more discussion into costs &amp; benefits on this topic.&nbsp;</li><li>As you might expect from <a href=\"https://forum.effectivealtruism.org/posts/P55P4YJoncfQmZ2RR/downsides-of-small-organizations-in-ea#More_Fiscal_Sponsorship_Programs\">my previous writing</a>, I still think that the benefits of being large are generally larger than the negatives. But at the same time, I think we can often get better tradeoffs.&nbsp;</li><li>My impression is that the situation with Effective Ventures Foundation was usually bad. I think some of it was because they're primarily based in the UK, which has certain rules, and some of it was that they were really unprepared for disasters like this. My org, QURI, is now sponsored by Rethink Priorities, and I've haven't seen things like this happen there, so far.&nbsp;</li><li>In business, my impression is that large organizations tend to dominate many industries. My impression is that much of this is due to reasons of effectiveness/efficiency, though some is definitely anti-competitive pressures. I think it's still telling how rarely businesses seem concerned to spin off sub-compartments, for reasons of liability specifically. (Maybe one good example is Alphabet selling off Boston Dynamics due to it's involvement with the military)</li><li>I think the point you mention about \"Confusion tolerance\" is one that the org has control over. They can still choose to be very explicit about things, but this does sometimes give them the option to be vague in certain situations.</li><li>I think it's very possible that it would be good to split up parts of EVF in particular, given its unusual restrictions. Again, there are some cases where splitting things is warranted. I think we're often getting mediocre trade-offs, and can be more intentional and optimal here.&nbsp;</li></ul>", "parentCommentId": null, "user": {"username": "oagr"}}, {"_id": "63h3oBPtj4ysNfHD4", "postedAt": "2023-11-07T19:22:41.340Z", "postId": "GRYFJGnye2gCxCTG4", "htmlBody": "<p>I'd love to hear more about any of this. In particular...</p><p>I don't see fiscal sponsorship alone providing the benefits you describe in your post. I think those require active management, genuinely viewing one project as owned by an org, rather than two separate orgs/projects that happen to share a legal structure. When I (and I think others) say fiscal sponsorship, I mean only sharing legal structure and specifically not providing oversight.&nbsp;</p><p>But you had already done the work to establish QURI independently and chose to change to sponsorship, so I imagine there was a big win there. What was that?</p><p>Do you think there were warning signs of this at EVF? Because my understanding was it was a rubber stamp until it wasn't, and by the time it wasn't it was too late to fix. So I currently don't think \"I've haven't seen things like this happen [at RP]\" is strong evidence.</p><p>It's true that large companies exist and benefit from size, but large companies rarely have department heads that want to risk their own organization in service of the public good. The prosocial motivation changes the math, although I don't know by how much.&nbsp;</p>", "parentCommentId": "neLn3txxeipmmBjhd", "user": {"username": "Elizabeth"}}, {"_id": "quzvLhHHj4EY3k9h3", "postedAt": "2023-11-07T21:04:23.842Z", "postId": "GRYFJGnye2gCxCTG4", "htmlBody": "<blockquote><p>I don't see fiscal sponsorship alone providing the benefits you describe in your post.</p></blockquote><p>At least our relationship with RP now is fairly heavy. They take a lot of ownership over our finances and operations. If QURI were to do sketchy operations/financial activities, I'd expect them to object and/or to remove us.&nbsp;</p><p>So I think fiscal sponsorships can create a floor insofar as operations and basic policies go. They don't help much with strategy/product, but ops is an area where orgs can really falter.<br><br>&gt; But you had already done the work to establish QURI independently and chose to change to sponsorship, so I imagine there was a big win there. What was that?<br><br>I didn't want to hire someone full-time or part-time to do ops. They have a team familiar with operations challenges, and available to do much of what we needed. If our ops liason leaves, they will find another - we don't have to. We get some package of \"direct operations support\" with \"oversight/availability from someone fairly junior\" (the COO).&nbsp;<br><br>&gt; Do you think there were warning signs of this at EVF? Because my understanding was it was a rubber stamp until it wasn't, and by the time it wasn't it was too late to fix.<br><br>I'm not a legal expert, but I'd expect that ones could have flagged this, if they would have spent much time searching. My impression is that EVF was sort of hastily set up for the level of complexity it was. For example, they brought in Howie to lead the UK side, but fairly late along.&nbsp;<br><br>&gt; large companies rarely have department heads that want to risk their own organization in service of the public good<br><br>I'm not sure how unique this is. I'm sure that lots of company departments would like to take brand/liability risks that would be bad for the company as a whole - for example, maybe a very scammy/broken Sony product that would make a lot of money in the short term, but be really bad for the Sony brand. I think it's generally assumed that subdivisions get more benefit from the good brand and organization, than they lose by the loss of flexibility. There's a lot of writing about acquisitions and spinoffs - occasionally, various ones make sense, and I assume there are good heuristics as to when.&nbsp;</p>", "parentCommentId": "63h3oBPtj4ysNfHD4", "user": {"username": "oagr"}}, {"_id": "rzRitfvcru9b563T4", "postedAt": "2023-12-14T02:09:22.746Z", "postId": "GRYFJGnye2gCxCTG4", "htmlBody": "<blockquote>\n<p>it is killing me that I couldn’t follow the rule of three with that list, but it turns out there aren’t that many legible, publicly visible examples of decisions to not share information</p>\n</blockquote>\n<p>An ironic third example could be that at the time you wrote this EV was already working on <a href=\"https://forum.effectivealtruism.org/posts/HjsfHwqasyQMWRzZN/ev-updates-ftx-settlement-and-the-future-of-ev\">implementing the changes you were recommending</a>, but had not yet shared that they were doing so.</p>\n", "parentCommentId": null, "user": {"username": "Jeff_Kaufman"}}]