[{"_id": "MoS8cSHBQqQAsiSJn", "postedAt": "2022-10-23T23:22:43.618Z", "postId": "GsJJfzMWynrizKJkD", "htmlBody": "<ul><li>I am glad people suggest things like this.</li><li>I disagree with this suggestion; I think it's sufficiently easy to find how to create posts. (Edit: also agree with Habryka.)</li><li>I like the thing in the bottom-right corner as it is; relative to alternatives, the current way requires little activation energy to get in touch with the forum team.</li></ul>", "parentCommentId": null, "user": {"username": "zsp"}}, {"_id": "NLv2BySHZGQgEPmxX", "postedAt": "2022-10-24T00:10:18.762Z", "postId": "GsJJfzMWynrizKJkD", "htmlBody": "<p>At least on LW, we intentionally didn't make the new-post button super easy to find, since it is not actually an action we want new users to take. We want it to be a thing someone does after having lurked for a few weeks. Commenting is a much more discoverable action, since that's something that I feel happier about people doing earlier in their journey.</p><p>It's not like we tried to hide it, but I think a website that has a giant new-post button in the bottom right corner, for example, would communicate that new users should feel quite comfortable pressing that button, and that it should be one of the primary ways for them to engage with the site, when I think that will somewhat reliably make people sad (both readers and authors).&nbsp;</p>", "parentCommentId": null, "user": {"username": "Habryka"}}, {"_id": "2kjidKLS9av7AWNpZ", "postedAt": "2022-10-24T10:54:07.523Z", "postId": "GsJJfzMWynrizKJkD", "htmlBody": "<p>Happy to read suggestions are welcome. :)\nGiving positive feedback (even if one disagrees with the content) is appreciated, since it encourages me (probably other users too) to continue interacting. Something I'd love to see more.</p>\n<p>Question about your last pointer:</p>\n<p>So is the chat in the bottom right corner for getting in touch with the technical forum team? Or chatting with anybody from the EA community?</p>\n<p>From the chat interface itself and your last pointer that isn't fully clear to me. When pressing \"Send a message\", there is no previous chat history, so it doesn't seem like and ongoing community chat.</p>\n<p>When typing a message there I wouldn't be sure at the moment, whether I would get a response via email or come back to the chat tomorrow. And if I come back tomorrow, whether my question will be hidden due to other people chatting after me.</p>\n<p>I don't fully understand how it works so I am not able to give suggestions. But if the Forum Team values new users understanding this chat (over e.g. creating a post), then perhaps my questions can be seen as a first-user-impression and hence possible feedback.</p>\n", "parentCommentId": "MoS8cSHBQqQAsiSJn", "user": {"username": "Cassidy"}}, {"_id": "bDdZ99Pr2EjrTKw47", "postedAt": "2022-10-24T11:08:03.984Z", "postId": "GsJJfzMWynrizKJkD", "htmlBody": "<p>I'm only rarely on the LW forum (mainly reading via email summaries), so I don't know what LW's target audience or approach to new users is.</p>\n<p>From the impression I got during various EA activities, theEA  forum is meant to be a welcoming place for new users who are encouraged to interact. This doesn't necessarily mean making full standalone posts, but can include creating question-posts or shortforms. The issue I've described applies to all post types.</p>\n<p>Note that with new users I mainly mean users new to the forum, not necessarily new to EA. Having good knowledge of EA principles doesn't include forum-navigation skills.</p>\n<p>I understand you prefer new users to comment, and I agree that commenting is something that is easier to find. As a new user basic actions I picked up quickly were: viewing posts, voting, commenting, searching, opening my profile, using the sidebar. None of these actions included finding the forum manual and learning how or when to create posts.</p>\n<p>So even after having lurked for a few weeks (so being within your \"create-post target audience\"), these things weren't clear to me. There is no guide between creating comments and creating posts.</p>\n<p>So aside from changing the general UI, what do you think about the other proposed suggestions?</p>\n", "parentCommentId": "NLv2BySHZGQgEPmxX", "user": {"username": "Cassidy"}}, {"_id": "YvEp9xqGg6AtebsET", "postedAt": "2022-10-24T12:57:39.909Z", "postId": "GsJJfzMWynrizKJkD", "htmlBody": "<p>Props for writing this suggestion.&nbsp;</p>", "parentCommentId": null, "user": {"username": "nathan"}}, {"_id": "iPK3Sti6dbph8CRZy", "postedAt": "2022-10-24T19:27:10.905Z", "postId": "GsJJfzMWynrizKJkD", "htmlBody": "<p>Thanks for posting this. I definitely understand the cognitive dissonance between <a href=\"https://forum.effectivealtruism.org/posts/4WxHNBf5LeM9gQneT/you-should-write-on-the-ea-forum\">guidance that encourages people to write on the Forum</a> and a UX that isn't intuitive for a brand new user coming from standard web tools.</p><p>The Forum team is currently hiring for a product designer, and I'm hopeful that we'll have a chance to take a look at our information architecture and interaction design, among other things. I don't think confusing UX should be a reason for not using a tool, even if there are <a href=\"https://forum.effectivealtruism.org/posts/KzDm9soPKHJ8nZeKP/why-don-t-people-post-on-the-forum-some-anecdotes\">various other reasons</a> (which perhaps we should also work on).</p><p>Also, I'd note that we have a <a href=\"https://forum.effectivealtruism.org/posts/NhSBgYq55BFs7t2cA/ea-forum-feature-suggestion-thread\">feature suggestion thread</a> that you can use in the future for suggestions like this.</p>", "parentCommentId": null, "user": {"username": "Sharang Phadke"}}, {"_id": "d6AWr9BKbndKgBZfZ", "postedAt": "2022-10-24T21:25:15.262Z", "postId": "GsJJfzMWynrizKJkD", "htmlBody": "<p>Thanks for your reply and the link. I wasn't aware of that thread before and added a comment there now. Hope you'll have success with the hiring process. :)</p>\n", "parentCommentId": "iPK3Sti6dbph8CRZy", "user": {"username": "Cassidy"}}, {"_id": "mhyeTiBecT45mC4j8", "postedAt": "2022-10-24T22:35:23.027Z", "postId": "GsJJfzMWynrizKJkD", "htmlBody": "<p>I think having a better linked forum manual, or something in that space seems pretty good to me. I feel like we can generally do better at cultural onboarding and helping people orient to the site, though it's a hard problem, since people do rarely read things even when they are pretty prominently linked, so I am not super sure how much a prominently linked forum manual might help.</p>", "parentCommentId": "bDdZ99Pr2EjrTKw47", "user": {"username": "Habryka"}}]