[{"_id": "AHtCASH6adc6uZ6gg", "postedAt": "2022-12-13T16:00:32.416Z", "postId": "GvWiCxwLQJAzF6aK9", "htmlBody": "<blockquote>\n<p>Although it seems likely that it was &gt;90 days before FTX filed for bankruptcy, so clawbacks seem like they might be less likely to apply.</p>\n</blockquote>\n<p>I'm not able to give legal advice but I would also watch out for fraudulent conveyance claims. While your statement is literally true as far as I can tell (it is indeed \"less likely\"), the 90 day lookback window is not as much protection as I would've hoped. Happy to help you in more detail if you'd like.</p>\n", "parentCommentId": null, "user": {"username": "Peter_Hurford"}}, {"_id": "ygxFSiJWDyKj8wKiM", "postedAt": "2022-12-13T16:53:49.507Z", "postId": "GvWiCxwLQJAzF6aK9", "htmlBody": "<p>Thanks, I've amended the wording to mention this (and also correct the first bit - it was definitely &gt;90 days before the bankruptcy filing). I note that Molly says in her post <a href=\"https://forum.effectivealtruism.org/posts/o8B9kCkwteSqZg9zc/thoughts-on-legal-concerns-surrounding-the-ftx-situation#:~:text=The%20second%20clawback,the%20specific%20transaction.\">that</a>:</p><blockquote><p>The second clawback process (called a “fraudulent conveyance claim”) targets transactions that happened up to two years prior to the bankruptcy filing. The root of these claims is an allegation that the debtor moved assets out of their organization&nbsp;<i>for the purpose of</i> frustrating future creditor claims. These types of claims are more complicated to prove, less commonly brought, and more individualized to the specific transaction.&nbsp;</p></blockquote><p>IANAL, but \"<i>for the purpose of</i> frustrating future creditor claims\" seems like quite a high bar. Have DM'd you.</p>", "parentCommentId": "AHtCASH6adc6uZ6gg", "user": {"username": "Greg_Colbourn"}}, {"_id": "it8Si5seQ93y2ivqc", "postedAt": "2022-12-13T17:03:14.649Z", "postId": "GvWiCxwLQJAzF6aK9", "htmlBody": "<p>The <a href=\"https://www.law.cornell.edu/uscode/text/11/548\">fraudulent conveyance statute </a>requires satisfaction of one of two conditions. One is \" actual intent to hinder, delay, or defraud any entity to which the debtor was or became . . . intended.\" The other is that the debtor \"received less than a reasonably equivalent value in exchange for such transfer or obligation\" and was insolvent at the time (or met one of three other criteria).&nbsp;</p><p>That being said -- while it wouldn't be appropriate for me to speculate on any specific organization's exposure -- both the foreign nature of an organization and a relatively small grant size are favorable predictors for the estate deciding clawback proceedings would not be cost-effective and/or settling the claim on favorable terms in light of those costs. I think those kinds of facts may ultimately matter more than the timing of a grant.</p>", "parentCommentId": "ygxFSiJWDyKj8wKiM", "user": {"username": "Jason"}}, {"_id": "74YrMygBBmy6MtsrC", "postedAt": "2022-12-13T17:57:56.234Z", "postId": "GvWiCxwLQJAzF6aK9", "htmlBody": "<p>Greg and crew: Thanks for all your work, happy to see you made it through the pandemic.</p><p>Others: If you want a third-party opinion on what it's like, DM me.</p>", "parentCommentId": null, "user": {"username": "technicalities"}}, {"_id": "MAqrxtCvL78bY7Wrj", "postedAt": "2022-12-13T22:05:30.315Z", "postId": "GvWiCxwLQJAzF6aK9", "htmlBody": "<p>Thanks a lot for the update! &nbsp;I feel excited about this project and grateful that it exists!<br><br>As someone who stayed at CEEALAR for ~6 months over the last year, I though I'd share some reflections that might help people decide whether going to the EA Hotel is a good decision for them. I'm sure experiences vary a lot, so, general disclaimer, this is just my personal data point and not some broad impression of the <i>typical</i> experience.&nbsp;</p><p>Some of the best things that happened as a result of my stay:</p><ol><li>&nbsp;I made at least three close friends I'm still in regular contact with, despite leaving the hotel half a year ago. That is a lot by my standards! I also increased my \"network\" by at least 20 people from all parts of the world and various professional/academic backgrounds that I'd be pretty happy to reach out to.</li><li>I greatly increased my productivity. During my stay, a friend and I came up with an accountability system that increased my productivity on average by &gt;5 focused hours per week over the last year (compared to previous years) and made me generally more healthy (e.g. I would estimate that I now exercise &gt;1h more per week on average).<ol><li>Relatedly, I managed to create four episodes of a German podcast about EA in my first two months there.</li></ol></li><li>Harder to quantify: a lot of inspiration! I came to the hotel after a year of being more or less in covid-isolation and so I went from that to talking hours every day to researchers and creators with loads of new ideas. I hope that spending so much time around people who were smarter and more knowledgeable than I lead to a decent amount of intellectual growth for me. Somewhat relatedly, I wouldn't be surprised if a lot of the value of my stay came from many small suggestions other people casually made in conversation (e.g. of some concept, some website or some other product).<ol><li>I think this varied a lot over time as the group of people changed and especially as we became a smaller group over the summer it became less of a stimulating environment.&nbsp;</li></ol></li></ol><p>Some downsides:&nbsp;</p><ol><li>I'm not a fan of Blackpool. I remember it largely as being grimy and dull, especially in winter. The proximity to the sea and the park are quite nice though&nbsp;</li><li>I think the hotel rooms were also less comfortable and nice than what I'm used to from home. I think this was fine for the most part since I mostly used my room to sleep. &nbsp;</li></ol><p>On balance, I think I benefitted a lot from staying at the hotel and I'm very glad I made the decision to go! Thanks to Greg, Lumi, Denisa, Dave and everyone else who spend time with me while I was there &lt;3<br>Please reach out if you have any questions you'd rater like to ask me in private.</p>", "parentCommentId": null, "user": {"username": "Aaron__Maiwald"}}, {"_id": "CrQDznKaEQYn6Bp3j", "postedAt": "2022-12-14T23:09:10.907Z", "postId": "GvWiCxwLQJAzF6aK9", "htmlBody": "<p><strong>Post summary</strong> (feel free to suggest edits!):<br>The Centre for Enabling EA Learning &amp; Research (CEEALAR) is an EA hotel that provides grants in the form of food and accommodation on-site in Blackpool, UK. They have lots of space and encourage applications from those wishing to learn or work on research or charitable projects in any cause area. This includes study and upskilling with the intent to move into those areas.</p><p>Since opening 4.5 years ago, they’ve supported ~100 EAs with their career development, and hosted another ~200 visitors for events / networking / community building. It costs CEEALAR ~£800/month to host someone - including free food, logistics, and project guidance. This is ~13% the cost of an established EA worker, and an example of hits-based giving.<br><br>They have plans to expand, and are fixing up a next door property that will increase capacity by ~70%. They welcome&nbsp;<a href=\"http://ceealar.org/donate\"><u>donations</u></a>, though aren’t in imminent need (they have 12 - 20 months of runway, depending on factors covered in the post). They’re also looking for a handy-person.<br><br>(If you'd like to see more summaries of top EA and LW forum posts, check out the <a href=\"https://forum.effectivealtruism.org/s/W4fhpuN26naxGCBbN\">Weekly Summaries</a> series.)</p>", "parentCommentId": null, "user": {"username": "GreyArea"}}, {"_id": "o7EBKEZrAvJNSYcfY", "postedAt": "2023-01-11T19:08:16.932Z", "postId": "GvWiCxwLQJAzF6aK9", "htmlBody": "<p>We are hiring for a full-time Operations Manager, please share with anyone you think may be interested: <a href=\"https://ceealar.org/job-operations-manager\">https://ceealar.org/job-operations-manager</a></p><p>To start mid-late February. £31,286 – £35,457 per year (full time, 40 hours a week).</p>", "parentCommentId": null, "user": {"username": "EA Hotel"}}]