[{"_id": "E6MSHzya8r7S4hWfg", "postedAt": "2023-10-21T10:55:18.119Z", "postId": "GW3cxBurTNKHs352S", "htmlBody": "<p>I'm surprised that you didn't put down signaling as Robin Hanson's \"big idea\".</p>", "parentCommentId": null, "user": {"username": "casebash"}}, {"_id": "bxa7FCcp6kd67PMgq", "postedAt": "2023-10-21T11:15:09.587Z", "postId": "GW3cxBurTNKHs352S", "htmlBody": "<p>Hi Chris,</p><p>For reference, I think you are referring to the ideas expressed in the book <a href=\"https://en.wikipedia.org/wiki/The_Elephant_in_the_Brain\">The Elephant in the Brain</a>. Maybe they do not qualify as \"big ideas\" because they had already been widely discussed before the book.</p>", "parentCommentId": "E6MSHzya8r7S4hWfg", "user": {"username": "vascoamaralgrilo"}}, {"_id": "MnuAhEFFbenYYzZzY", "postedAt": "2023-10-21T11:27:59.494Z", "postId": "GW3cxBurTNKHs352S", "htmlBody": "<p>I took \"big idea\" to mean an idea that is a) key to someone's worldview and b) somewhat particular to them, in that they make use of it to an unusual degree, even if it isn't entirely original to them.</p>", "parentCommentId": "bxa7FCcp6kd67PMgq", "user": {"username": "casebash"}}, {"_id": "vHSgYJTHnKGhLusr5", "postedAt": "2023-10-21T13:35:10.559Z", "postId": "GW3cxBurTNKHs352S", "htmlBody": "<p>This is a good point. The two other examples which seem salient to me:</p><ol><li>Deutsch's brand of techno-optimism (which comes through particularly clearly when he tries to reason about the future of AI by saying things like \"AIs will be people, therefore...\").</li><li>Yudkowsky on misalignment.</li></ol>", "parentCommentId": null, "user": {"username": "richard_ngo"}}, {"_id": "hckgDztA3eZqRQXrY", "postedAt": "2023-10-21T14:12:49.356Z", "postId": "GW3cxBurTNKHs352S", "htmlBody": "<p>Imagine citing Henry Farrell as evidence I overstate my big ideas. The guy disagrees with me for ideological reasons and for some reason has always been snotty toward me, probably because I refused to suck up to him like some other BHL people. But his actual critique is of nearly zero intellectual value.&nbsp;<br><br>-Jason Brennan&nbsp;</p>", "parentCommentId": null, "user": {"username": "Jason Brennan"}}, {"_id": "oFgKiEzgP3uqvCCQc", "postedAt": "2023-10-22T08:52:54.974Z", "postId": "GW3cxBurTNKHs352S", "htmlBody": "<p>One aspect is that we might expect people who believe unusually strongly in an idea to be more likely to publish on it (winner's curse/unilateralist's curse).</p>\n", "parentCommentId": null, "user": {"username": "Stefan_Schubert"}}, {"_id": "dQQeg2a7pnm7485C3", "postedAt": "2023-10-30T14:59:37.308Z", "postId": "GW3cxBurTNKHs352S", "htmlBody": "<p>\"Hanson et al.’s basic model might be wrong in that expansionist alien civilizations could generally converge to be quiet, in the sense of not being clearly visible; or at least some fraction of expansionist civilizations could be quiet (both possibilities are excluded by Hanson et al.’s model).\"</p><p>A large part of our main paper considers the ratio of quiet to loud aliens, and allows that ratio to be very large. Thus it is not at all true that that we ignore the possibility of many quiet civs. We also explicitly consider the possibility that we haven't yet noticed large expansive civs, and we calculate the angle lengths of borders we might see in the sky in that case.&nbsp;</p>", "parentCommentId": null, "user": {"username": "RobinHanson"}}, {"_id": "9YurbuPXHhKqc6y69", "postedAt": "2023-11-08T20:36:02.215Z", "postId": "GW3cxBurTNKHs352S", "htmlBody": "<p>For someone not familiar with Farrell's work, what's the main problem with it?</p>", "parentCommentId": "hckgDztA3eZqRQXrY", "user": {"username": "nathan98000"}}, {"_id": "eBHhwyEXEgHgSqTip", "postedAt": "2023-11-09T11:00:42.726Z", "postId": "GW3cxBurTNKHs352S", "htmlBody": "<blockquote><p>Thus it is not at all true that that we ignore the possibility of many quiet civs.</p></blockquote><p>But that's not the claim of the quoted text, which is explicitly about quiet <i>expansionist</i> aliens (e.g. expanding as far and wide as loud expansionist ones). The model does seem to ignore those (and such quiet expansionists might have no borders detectable by us).</p>", "parentCommentId": "dQQeg2a7pnm7485C3", "user": {"username": "MagnusVinding"}}, {"_id": "NdXebfALLh5xzukWD", "postedAt": "2023-11-09T11:08:04.069Z", "postId": "GW3cxBurTNKHs352S", "htmlBody": "<p>Yeah, it would make sense to include it. :) As I wrote \"Robin Hanson has many big ideas\", and since the previous section was already about signaling and status, I just mentioned some other examples here instead. Prediction markets could have been another one (though it's included in futarchy).</p>", "parentCommentId": "E6MSHzya8r7S4hWfg", "user": {"username": "MagnusVinding"}}, {"_id": "4LoYxhHeM8wzHpn2E", "postedAt": "2024-01-09T14:47:21.746Z", "postId": "GW3cxBurTNKHs352S", "htmlBody": "<p>A similar critique has been made in Friederich &amp; Wenmackers' article \"<a href=\"https://www.cambridge.org/core/journals/international-journal-of-astrobiology/article/future-of-intelligence-in-the-universe-a-call-for-humility/9F39318C37765ECEA6E07443E2B8D424\">The future of intelligence in the Universe: A call for humility</a>\", specifically in the section<u> \"Why FAST and UNDYING civilizations may not be LOUD\".</u></p>", "parentCommentId": "dQQeg2a7pnm7485C3", "user": {"username": "MagnusVinding"}}]