[{"_id": "KKiArgpDe3cdW3Ndm", "postedAt": "2024-02-06T15:13:33.030Z", "postId": "GWya8sJzsy9xLpdX6", "htmlBody": "<p>Thanks for the summary, Nicholas. For reference, the paper was discussed on EA Forum <a href=\"https://forum.effectivealtruism.org/posts/WSytm4XG9DrxCYEwg/andreas-mogensen-s-maximal-cluelessness\">here</a>.</p>", "parentCommentId": null, "user": {"username": "vascoamaralgrilo"}}, {"_id": "nvcEJGhLzxtWQmDBi", "postedAt": "2024-02-06T18:41:28.144Z", "postId": "GWya8sJzsy9xLpdX6", "htmlBody": "<p>This is a fun paper. But it rests a <i>lot</i> on an unsupported intuition about what's required in order to \"take the depth of our uncertainty seriously\" (i.e., that this requires imprecise credences with a very wide range of imprecision). &nbsp;Since this intuition leads to the (surely false) conclusion that a rational beneficent agent might just as well support the <i>For Malaria Foundation </i>as the <i>Against Malaria Foundation</i>, it seems to me that we have very good reason to reject that theoretical intuition.</p>", "parentCommentId": null, "user": {"username": "RYC"}}, {"_id": "jDaDZP7q87dwEExwx", "postedAt": "2024-02-07T00:02:53.652Z", "postId": "GWya8sJzsy9xLpdX6", "htmlBody": "<p>I'm a bit surprised that this is getting downvoted, rather than just disagree-voted. It's fine to reach a different verdict and all, but y'all really think the methodological point I'm making here <i>shouldn't even be said</i>? &nbsp;Weird.</p>", "parentCommentId": "nvcEJGhLzxtWQmDBi", "user": {"username": "RYC"}}, {"_id": "udeNAvDpksaACCgAM", "postedAt": "2024-02-07T06:04:43.068Z", "postId": "GWya8sJzsy9xLpdX6", "htmlBody": "<p>Hi Richard,</p><blockquote><p>Since this intuition leads to the (surely false) conclusion that a rational beneficent agent might just as well support the <i>For Malaria Foundation </i>as the <i>Against Malaria Foundation</i>, it seems to me that we have very good reason to reject that theoretical intuition.</p></blockquote><p>Is this a fair comparison? For readers' context, Andreas compares the Against Malaria Foundation (AMF) with Make-A-Wish Foundation:</p><blockquote><p>In comparing Make-A-Wish Foundation unfavourably to Against Malaria Foundation, Singer (2015) observes that ³saving a life is better than making a wish come true.´ (6) Arguably, there is a qualifier missing from this statement: µall else being equal. Saving a child's life need not be better than fulfilling a child's wish if the indirect effects of saving the child's life are worse than those of fulfilling the wish. We have already touched on some of the potential negative indirect effects associated with the mass distribution of insecticide-treated anti-malarial bed-nets in section 2.2, but they are worth revisiting in order to make clear the depth of our uncertainty.</p><p>Firstly, there are potential effects on population. When people survive childhood in greater numbers, it is natural to expect the population to grow. The explosion in global population observed since the 17th century is arguably attributable principally to declining mortality (McKeown 1976). However, we must also account for the impact of reduced childhood mortality on family planning. When childhood mortality declines, parents in developing countries need not have as many children in 14 order to ensure that they can be supported in old age. As a result, averting child deaths may cause the rate of population growth to decline (Heer and Smith 1968). It is the position of the Gates Foundation that averting child deaths at the current margin will reduce population size (Gates and Gates 2014). Many studies confirm that the effect of reduced childhood mortality on population size is offset by reduced fertility (Schultz 1997; Conley, McCord, and Sachs 2007; Lorentzen, McMillan, and Wacziarg 2008; Murtin 2013). Others find that the reduction in births is less than one-to-one with respect to averted child deaths (Bhalotra and van Soest 2008; Herzer, Strulik, and Vollmer 2012; Bhalotra, Hollywood, and Venkataramani 2012). Unfortunately, the studies just noted are of different kinds (cross-country comparisons, panel studies, quasi-experiments, large-sample micro-studies), with different strengths and weaknesses, making it difficult to draw firm conclusions. 13</p></blockquote><p>I agree increasing malaria is surely worse than decreasing malaria, but I would not say Make-A-Wish Foundation is surely worse than AMF. Given this distinction, I (lightly) downvoted your comment.</p>", "parentCommentId": "jDaDZP7q87dwEExwx", "user": {"username": "vascoamaralgrilo"}}, {"_id": "ihks4FmXPEvCBf7jk", "postedAt": "2024-02-07T11:00:44.603Z", "postId": "GWya8sJzsy9xLpdX6", "htmlBody": "<p>Thanks, Richard! In some sense, I think I agree; as I say in the conclusion, I'm most inclined to think this is one of those cases where we've got a philosophical argument we don't immediately know how to refute for a conclusion that we should nonetheless reject, and so we ought to infer that one of the premises must be false.&nbsp;</p><p>On the other hand, I think I'm most inclined to say that the problem lies in the fact that standard models using imprecise credences and their associated decisions rules have or exploit too little structure in terms of how they model our epistemic predicament, while thinking that it is nonetheless the case that our evidence fails to rule out probability functions that put sufficient probability mass on potential bad downstream effects and thereby make AMF come out worse in terms of maximizing expected value relative to that kind of probability function. I'm more inclined to identify the problem as being that the maximality rule gives probability functions of that kind too much of a say when it comes to determining permissibility. Other standard decision rules for imprecise credences argaubly suffer from similar issues. David Thorstad and I look a bit more in depth at decision rules that draw inspiration from voting theory and rely on some kind of measure on the set of admissible probability functions in our paper '<a href=\"https://link.springer.com/article/10.1007/s11229-022-03566-5\">Tough enough? Robust satisficing as a decision norm for long-term policy analysis</a>' but we weren't especially sold on them.</p>", "parentCommentId": "nvcEJGhLzxtWQmDBi", "user": {"username": "Andreas_Mogensen"}}, {"_id": "LdosMNRiL2AnZZqiQ", "postedAt": "2024-02-07T14:38:08.895Z", "postId": "GWya8sJzsy9xLpdX6", "htmlBody": "<p>Thanks, yeah, I remember liking that paper. Though I'm inclined to think you should assign (precise) higher-order probabilities to the various \"admissible probability functions\", from which you can derive a kind of higher-order expected value verdict, which helpfully seems to avoid the problems afaict?</p><p>General lesson: if we don't have any good way of dealing with imprecise credences, we probably shouldn't regard them as rationally mandatory. Especially since the case for thinking that we <i>must</i> have imprecise credences (i.e., that any kind of precision is <i>necessarily</i> irrational) seems kind of weak.</p>", "parentCommentId": "ihks4FmXPEvCBf7jk", "user": {"username": "RYC"}}, {"_id": "62whsMp2vZxxYP6nT", "postedAt": "2024-02-07T14:44:41.369Z", "postId": "GWya8sJzsy9xLpdX6", "htmlBody": "<p>Thanks for explaining!</p><p>It is a fair comparison. Andreas' relevant claim is that it isn't clear what the sign of the effect from AMF is. If AMF is negative, then its opposite--FMF--would presumably be positive.</p>", "parentCommentId": "udeNAvDpksaACCgAM", "user": {"username": "RYC"}}, {"_id": "2WBFanPtqB7intkhx", "postedAt": "2024-02-07T16:04:48.601Z", "postId": "GWya8sJzsy9xLpdX6", "htmlBody": "<p>Thanks for following up!</p><blockquote><p>If AMF is negative, then its opposite--FMF--would presumably be positive.</p></blockquote><p>I am not sure about this. I think Andreas' claim is that AMF may be negative due to indirect effects. So, conditional on AMF being negative, one should expect the indirect effects would dominate the direct ones. This means a good candidare for \"Minus AMF\", an organisation whose value is symmetric to that of AMF, would have both direct and indirect effects symmetric to those of AMF.</p><p>The name For Malaria Foundation (FMF) suggested to me an organisation whose interventions have direct effects with similar magnitude, but opposite sign of those of AMF. However, the negative indirect effects of intentionally increasing malaria deaths seem worse than the negative of the positive indirect effects of decreasing malaria deaths<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnref23gsuysv2ek\"><sup><a href=\"#fn23gsuysv2ek\">[1]</a></sup></span>. So, AMF being negative would imply FMF having positive direct effects, but in this case I would expect FMF's indirect effects to be sufficiently negative for it to be overall net negative.</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fn23gsuysv2ek\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnref23gsuysv2ek\">^</a></strong></sup></span><div class=\"footnote-content\"><p>I am utilitarian, but recognise saving a life, and abstaining from saving a live can have different indirect consequences.</p></div></li></ol>", "parentCommentId": "62whsMp2vZxxYP6nT", "user": {"username": "vascoamaralgrilo"}}, {"_id": "kbaQjRqMKs4bW2PDK", "postedAt": "2024-02-07T19:53:23.949Z", "postId": "GWya8sJzsy9xLpdX6", "htmlBody": "<p>If you're worried that a real-life FMF would not be truly symmetrical to AMF in its effects, just mentally replace it with \"Minus AMF\" in my original comment. (Or imagine stipulating away any such differences.) &nbsp;It doesn't affect the essential point.</p>", "parentCommentId": "2WBFanPtqB7intkhx", "user": {"username": "RYC"}}, {"_id": "o9HpejWfzZEwozuzj", "postedAt": "2024-02-10T16:22:40.855Z", "postId": "GWya8sJzsy9xLpdX6", "htmlBody": "<p>Hi Andreas! I'm worried that the maximality rule will overgeneralize, implying that little is rationally required of us. Consider the decision whether to have children. There are obvious arguments both for and against from a self-interested point of view, and it isn't clear exactly how to weigh them against each other. So, plausibly, having children will max EU according to at least one probability function in our representor, whereas not having children will max EU according to at least one other probability function in our representor. Result via maximality rule: either choice is rationally permissible. Or consider some interesting public policy problem from the perspective of a benevolent social planner. Given the murkiness of social science research, it seems like that, if we've gone in for the imprecise credence picture, no one policy will maximize EU relative to every credence function in the representor, in which case, many policy choices will be rationally permissible. I wonder if you have thoughts on this?&nbsp;</p>", "parentCommentId": null, "user": {"username": "Calvin_Baker"}}, {"_id": "LjruC7Qa3b5wFYeBp", "postedAt": "2024-02-14T22:24:51.026Z", "postId": "GWya8sJzsy9xLpdX6", "htmlBody": "<blockquote><p>I'm more inclined to identify the problem as being that the maximality rule gives probability functions of that kind too much of a say when it comes to determining permissibility.</p></blockquote><p>Another response could be to just look for more structure in our credences we've failed to capture. Say we have a bunch of probability functions according to which AMF is bad and a bunch according to which AMF is good, but we nonetheless think AMF is good. Why would we think AMF is good anyway? If we're epistemically rational, it would presumably be because we doubt the functions according to which it is bad more than we do the ones according to which it is good. So, we've actually failed to adequately capture our credences and their structure with these probability functions as they are.</p><p>One way to represent this is to have another probability function to mix all of those probability functions (\"(precise) higher-order probabilities to the various \"admissible probability functions\"), reducing to precise credences, in such a way that AMF turns out to look good, like <a href=\"https://forum.effectivealtruism.org/users/ryc?mention=user\">@Richard Y Chappell</a> suggests in reply <a href=\"https://forum.effectivealtruism.org/posts/GWya8sJzsy9xLpdX6/summary-maximal-cluelessness-andreas-mogensen?commentId=LdosMNRiL2AnZZqiQ\">here</a>. Another, still permitting imprecise credences, is to have <i>multiple</i> such mixing functions of probability functions, but such that AMF still looks good on <i>each</i> mixing function. If you're sympathetic to imprecise credences in the first place (like I am), the latter seems like a pretty good solution.</p><p>Of course, an alternative explanation could be that we aren't actually aren't justified in thinking AMF is good. We should be careful in how we pick these higher-order probabilities to avoid motivated reasoning. In picking these higher-order probabilities, we should remain open to the possibility that AMF is not actually robustly good.</p>", "parentCommentId": "ihks4FmXPEvCBf7jk", "user": {"username": "MichaelStJules"}}, {"_id": "7nuH7MFWCLf8D6KMH", "postedAt": "2024-02-14T22:42:04.090Z", "postId": "GWya8sJzsy9xLpdX6", "htmlBody": "<p>One move we can make to reduce paralysis with the maximality rule is to consider whole portfolios/sequences of actions, rather than acts in isolation. We can make up for the potential downsides of some acts with the upsides of others. See my post <a href=\"https://forum.effectivealtruism.org/posts/Mig4y9Duu6pzuw3H4/hedging-against-deep-and-moral-uncertainty\">Hedging against deep and moral uncertainty</a>.</p>", "parentCommentId": null, "user": {"username": "MichaelStJules"}}, {"_id": "6Ki9msdTNuiKkvkvy", "postedAt": "2024-02-14T22:43:19.735Z", "postId": "GWya8sJzsy9xLpdX6", "htmlBody": "<p>I didn't downvote, but if I had, it would be because I don't think it's <i><strong>surely false</strong></i> that \"that a rational beneficent agent might just as well support the <i>For Malaria Foundation </i>as the <i>Against Malaria Foundation</i>\", and that claim seems overconfident. (Or, rather, AMF could be no better than burning money or the Make a Wish Foundation, even if all are better than FMF, in case there is asymmetry between AMF and FMF.)</p><p>I specifically worry that AMF could be bad if and because it hurts farmed animals more than it helps people, considering also that descendants of beneficiaries will likely consume more factory farmed animal products, with increasing animal product consumption and intensification with economic development. Wild animal (invertebrate) effects could again go either way. If you're an expectational total utilitarian or otherwise very risk-neutral wrt aggregate welfare, then you may as well ignore the near term benefits and harms and focus on the indirect effects on the far future, e.g. through how it affects the EA community and x-risks. (Probably FMF would have very bad community effects, worse than AMF's are good relative to more direct near term effects, unless FMF <i>quietly</i> acts to convince people to stop donating to AMF.)</p><p>And I say this as a recurring small donor to malaria charities including AMF. I think AMF can still be a worthwhile part of a portfolio of interventions, even if it turns out to not look robustly good on its own (it could be that few things do). See my post <a href=\"https://forum.effectivealtruism.org/posts/Mig4y9Duu6pzuw3H4/hedging-against-deep-and-moral-uncertainty\">Hedging against deep and moral uncertainty</a> for illustration.</p>", "parentCommentId": "jDaDZP7q87dwEExwx", "user": {"username": "MichaelStJules"}}, {"_id": "ccTFQhhpmuzfF7Wrc", "postedAt": "2024-02-14T22:54:40.113Z", "postId": "GWya8sJzsy9xLpdX6", "htmlBody": "<blockquote><p>General lesson: if we don't have any good way of dealing with imprecise credences, we probably shouldn't regard them as rationally mandatory.</p></blockquote><p>I worry that this is motivated reasoning. Should what we can justifiably believe will happen as a consequence of our actions depend on whether it results in satisfactory moral consequences (e.g. avoiding paralysis)?</p>", "parentCommentId": "LdosMNRiL2AnZZqiQ", "user": {"username": "MichaelStJules"}}]