[{"_id": "iEMb5rAjKussTurKP", "postedAt": "2022-11-06T16:20:24.282Z", "postId": "GWyidA3fbXKXErDn4", "htmlBody": "<blockquote><p>, she interviewed 8 persons who were or had been involved in effective altruism through the university/city group Effective Altruism Helsinki</p></blockquote><p>Seems unclear whether the generalization from EA Helsinki to EA in general is valid.</p>", "parentCommentId": null, "user": {"username": "NunoSempere"}}, {"_id": "69MoSrGQAhHX5X4kS", "postedAt": "2022-11-06T20:52:38.229Z", "postId": "GWyidA3fbXKXErDn4", "htmlBody": "<p>I agree. Weirdly this is not addressed in the thesis.</p>", "parentCommentId": "iEMb5rAjKussTurKP", "user": {"username": "Ada-Maaria Hyvärinen"}}, {"_id": "77JfvEq75AGpLjoPk", "postedAt": "2024-02-03T12:55:55.217Z", "postId": "GWyidA3fbXKXErDn4", "htmlBody": "<blockquote>\n<p>actions are never taken just for the sake of participating in the movement, but they are always tied to the end goal of having an impact</p>\n</blockquote>\n<p>This seems a bit aspirational to me. Participating in DEAM, attending a secular solstice, sharing vegan recipes, or just hanging out with an EA friend group seem primarily about participating in the movement. Yes, you can chain these back to impact, but I'd be surprised if in the movements they're comparing EA to you couldn't similarly construct such chains.</p>\n", "parentCommentId": null, "user": {"username": "Jeff_Kaufman"}}, {"_id": "nCDHtrMq8AgmLhLyh", "postedAt": "2024-02-03T19:11:20.828Z", "postId": "GWyidA3fbXKXErDn4", "htmlBody": "<p>I obviously don't have access to Mikkola's full interview transcripts, but when I think back to EA Helsinki on 2021, it is possible that none of us who were interviewed told her we'd do anything like that, and would only list serious sounding stuff such as donating and career planning as our EA actions :) this, again, shows the limitations of inspecting a whole movement with a limited interview study like this.</p>", "parentCommentId": "77JfvEq75AGpLjoPk", "user": {"username": "Ada-Maaria Hyvärinen"}}]