[{"_id": "f3eofYavseDnmQ5AH", "postedAt": "2015-02-23T08:37:45.025Z", "postId": "GYEmaX99ikgXcSbFo", "htmlBody": "<p>Hi, \nI'm new in the group, and this is the first post that I have read.  And I find myself realising that you can find the most useful resources if you look properly.\nAs social entrepreneurs, we are about to launch a project whose objective is to provide the cash-flow to fund social causes in each city or country where the product is purchased.<br />As a part of the overall strategy, we will be taking a co-creation workshop on the road, and have been trying to formulate a list of cities that we could visit.\nThe roadshow will co-create versions of our product, with a percentage of profits funding social impact organisations (charities, NGOs) that have been identified by our community in each city/country that we visit.\nI also see the ability to work with networks of local consultants that can contract their services, at market rates, to the social impact organisations, through our funding.  I just need a bit of help on this last piece.\nAnyhow, is the list above a good place to start as we think about where we would take our event?</p>\n", "parentCommentId": null, "user": {"username": "AlCasey"}}, {"_id": "d2pm9vSMrKvqL4ijN", "postedAt": "2015-02-23T17:26:30.195Z", "postId": "GYEmaX99ikgXcSbFo", "htmlBody": "<p>Hey AlCasey,\nThe above is a list of people who are interested in finding the charities that are the highest in impact, it's a bit more specific than just social entrepreneurship in general, so you might find interested people there, or not, depending.</p>\n", "parentCommentId": "f3eofYavseDnmQ5AH", "user": {"username": "RyanCarey"}}, {"_id": "7hmWwQwdFA28gcoP9", "postedAt": "2015-02-24T08:39:07.143Z", "postId": "GYEmaX99ikgXcSbFo", "htmlBody": "<p>Hi, this isn't really a good place to start as these local presences are pretty new and small, and I don't want to overwhelm them as they mostly signed up for something minimal. Plus what Ryan said - at least from what you say, it's not clear that the effective altruist community will be the best audience for you, as it's quite specific and in particular funds quite a small range of organisations.</p>\n", "parentCommentId": "f3eofYavseDnmQ5AH", "user": {"username": "Tom_Ash"}}, {"_id": "cFQJQ7CXfhtGM7cDr", "postedAt": "2015-02-24T11:44:24.280Z", "postId": "GYEmaX99ikgXcSbFo", "htmlBody": "<p>&quot;It often takes a fair bit of in-person communication for people to resolve any initial questions and the message to click.&quot;</p>\n<p>Is this the new 'consensus'? What is it based on? I've heard some say on facebook that ususally people either get EA right away or they don't end up getting it at all.</p>\n", "parentCommentId": null, "user": null}, {"_id": "iWNcrBPgndjbiMJ6X", "postedAt": "2015-02-24T14:02:05.106Z", "postId": "GYEmaX99ikgXcSbFo", "htmlBody": "<p>In my experience, it's both! Some people are drawn to it right away, whereas others find it really unintuitive. And then, most people require some serious reflection before really getting involved, and this often happens through lots of conversations, though I think it could also happen via reading loads online or online communities.</p>\n", "parentCommentId": "cFQJQ7CXfhtGM7cDr", "user": {"username": "Benjamin_Todd"}}, {"_id": "cHQZiiKbScdtviujR", "postedAt": "2015-02-24T15:08:17.003Z", "postId": "GYEmaX99ikgXcSbFo", "htmlBody": "<p>I'm pretty sure I've said something like that myself ;) However I don't think that's contradictory. Rather, I think there are 3 categories of people:</p>\n<ul>\n<li>People who were sold on the ideas and often taking the actions before hearing about EA.</li>\n<li>People who when they hear about EA are quite sceptical.</li>\n<li>People who when they hear about EA have a more positive reaction than that.</li>\n</ul>\n<p>What I've meant is that barely any people in the 2nd category end up as EAs. I base that partly on the fact that I don't know of any such people (having asked others if they do, and knowing quite a few EAs myself). So the sentence you quoted was about the 3rd category of people.</p>\n<p>I do think that the 1st category is larger than the 3rd based on the people I know about, which does reduce this aspect of the value of the project. However plausibly some of these people wouldn't otherwise have found equally effective charities.</p>\n", "parentCommentId": "cFQJQ7CXfhtGM7cDr", "user": {"username": "Tom_Ash"}}, {"_id": "ZmEGdqnjfQsPEZGrG", "postedAt": "2015-02-25T00:11:05.011Z", "postId": "GYEmaX99ikgXcSbFo", "htmlBody": "<p>Thanks for doing this, Tom!</p>\n", "parentCommentId": null, "user": {"username": "lukeprog"}}]