[{"_id": "eef2tS5YSNwMrGzD9", "postedAt": "2024-03-12T14:05:08.918Z", "postId": "H2KJYySJMfF4CsMPm", "htmlBody": "<p>I think you'd have to freeze oils, which would be pricey. I've heard that vegetable shortening (US Crisco) lasts ~forever, at the cost of being truly terrible for you. You'd need more than that, though, because eating 100% fats would kill everyone off due to protein deficiency at some point. You'd also need some source of vitamins, or you'd see a lot of scurvy and similar diseases.</p><p>Most preppers interested in long-term food storage (and/or members of the LDS church, which has long advised food storage and sells long-lasting foods to all) predominately store things like beans and rice. On the market, those are significantly more expensive than buying the goods in non-long term packaging (examples <a href=\"https://www.amazon.com/Augason-Farms-Grain-Emergency-Storage/dp/B00LBGNHE8/\">here </a>(rice) and <a href=\"https://www.amazon.com/Augason-Farms-Black-Emergency-Storage/dp/B0755HDGLC/\">here </a>(beans), although I'm sure the government could get economies of scale).</p><p>On the other hand, you could realize some value from the food near the end of the usable period, either by selling it or donating it. Some governments might choose to feed it to prisoners. Sadly, that might be an improvement over what they currently feed prisoners....</p>", "parentCommentId": null, "user": {"username": "Jason"}}, {"_id": "YpwmfqnALD8r7B2LL", "postedAt": "2024-03-12T14:48:04.509Z", "postId": "H2KJYySJMfF4CsMPm", "htmlBody": "<p>Just about oils specifically:</p><p>My best guess is that either freezing or storing them as a liquid in an inert environment could be quite economical, very rough OOM maths:</p><p><strong>For frozen storage</strong></p><p>Apparently ice costs <a href=\"https://www.wired.com/2014/08/how-much-does-it-cost-to-make-ice/\">~$0.01/kg</a> to produce, this is just for the upfront cost of initially freezing, oil would be similar/lower because it has a lower heat capacity and similar freezing point. The cost for keeping it frozen is not that easy to work out, but still I would say \"well the square-cube law takes care of this if you are freezing in large enough quantities\" so I would be quite surprised if it were way more than the $3.7/year depreciation cost (OOM logic: even if it melted and you re-froze it every day that would only cost $3.65/year).</p><p><strong>For liquid storage</strong></p><p>You can store crude oil for something like <a href=\"https://wp.lancs.ac.uk/finec2023/files/2023/01/FEC-2023-096-Lazaros-Symeonidis.pdf\">$1.2 to $6</a><span class=\"footnote-reference\" data-footnote-reference=\"\" data-footnote-index=\"1\" data-footnote-id=\"q2ggouc1ru9\" role=\"doc-noteref\" id=\"fnrefq2ggouc1ru9\"><sup><a href=\"#fnq2ggouc1ru9\">[1]</a></sup></span>&nbsp;per barrel per year, with the cheapest method being putting it in salt caverns, but other methods are not way more expensive. This corresponds to about 2 person-years of calories with palm oil ($0.6 to $3 per person-year for storage). There are some reasons to think storing an edible oil<span class=\"footnote-reference\" data-footnote-reference=\"\" data-footnote-index=\"2\" data-footnote-id=\"0ifln57lbj8a\" role=\"doc-noteref\" id=\"fnref0ifln57lbj8a\"><sup><a href=\"#fn0ifln57lbj8a\">[2]</a></sup></span>&nbsp;could be more expensive:</p><ul><li>You would probably need to backfill with an inert gas to preserve it</li><li>Other food-grade safety related things? Although I think this would be a misguided concern tbh because it's intended for a use case where you would otherwise starve, so it only has to not kill you, it could be quite contaminated</li></ul><p>And reasons to think it would be cheaper:</p><ul><li>You would be storing for a known, very long, amount of time, so you could save on things required for quick access to the oil (like pumps)</li><li>It's easier to handle, less flammable, no noxious gases etc</li></ul><p>I would guess the cheaper side would win here, as backfilling with an inert gas doesn't seem very hard if you have a large enough volume. Apparently oil tankers already do this (not sure about salt cavern storage) so this may be priced in already.</p><ol class=\"footnote-section footnotes\" data-footnote-section=\"\" role=\"doc-endnotes\"><li class=\"footnote-item\" data-footnote-item=\"\" data-footnote-index=\"1\" data-footnote-id=\"q2ggouc1ru9\" role=\"doc-endnote\" id=\"fnq2ggouc1ru9\"><span class=\"footnote-back-link\" data-footnote-back-link=\"\" data-footnote-id=\"q2ggouc1ru9\"><sup><strong><a href=\"#fnrefq2ggouc1ru9\">^</a></strong></sup></span><div class=\"footnote-content\" data-footnote-content=\"\"><p>\"Global Platts reveal that the price of onshore storage varies between 10 and 50 cents per barrel per month.\", then adjusted based on 158 litres/barrel, corresponding to ~140kg of palm oil, which is 2 person-years worth</p></div></li><li class=\"footnote-item\" data-footnote-item=\"\" data-footnote-index=\"2\" data-footnote-id=\"0ifln57lbj8a\" role=\"doc-endnote\" id=\"fn0ifln57lbj8a\"><span class=\"footnote-back-link\" data-footnote-back-link=\"\" data-footnote-id=\"0ifln57lbj8a\"><sup><strong><a href=\"#fnref0ifln57lbj8a\">^</a></strong></sup></span><div class=\"footnote-content\" data-footnote-content=\"\"><p>You couldn't actually use palm oil in this case, because it's a solid, but e.g. sunflower oil has similar calories/$</p></div></li></ol>", "parentCommentId": "eef2tS5YSNwMrGzD9", "user": {"username": "Will Howard"}}, {"_id": "L8NaBDYTBoJNZhXnK", "postedAt": "2024-03-12T21:15:31.614Z", "postId": "H2KJYySJMfF4CsMPm", "htmlBody": "<p>Food stockpiling already exist as mitigation strategy in many countries and international aid organisation (FAO, UNHCR etc.). Not just to tackle short-term non nuclear winter (&lt; 3+ years) scale for GCR. The goal is not only to feed population, but also to stabilise food price in such events. Stabilisation of food price is important to prevent local and global famines, especially in an event where communication and industrial infrastructure collapse.</p><p>The reason GCR focused orgs are focused on the production scalability and deploy-ability of resilient food is partly to ensure adequate nutrition and calorie requirement, but this could also stabilise food price for diminishing food stock in such an event.<br><br>Thus, food price movement is often a catalyst for instabilities in food insecure regions and structurally unstable regions (e.g. First and Second Arab Spring).<br><br>Freezing food and the 'cold-chain' distribution of require access to stable energy supply, which fuel inequality and poverty in many unstable regions don't have access to, we could postulate this would also happen in many GCR scenarios. Particularly in higher-likelihood human caused GCR (war --&gt; nuclear exchanges) food and fuel infrastructure is often weaponise as political tokens, rendering stockpile and transportation infrastructures around such supply chains vulnerable to attack.<br><br>Corentin wrote an excellent yet underappreciated <a href=\"https://forum.effectivealtruism.org/posts/qG8k5pzhaDk6FhcYv/the-great-energy-descent-part-1-can-renewables-replace\">3-part long posts</a> on our reliance on fossil-fuel which maybe of interest to you , part 3, in particular discussed under-researched areas, which are relevant to the topic.&nbsp;</p>", "parentCommentId": null, "user": {"username": "chanakin"}}, {"_id": "4HxS7kicbGvBGYQNB", "postedAt": "2024-03-17T02:07:14.120Z", "postId": "H2KJYySJMfF4CsMPm", "htmlBody": "<p>Thanks for mentioning resilient foods! It is true that more food storage would give more time to scale up resilient foods. Stored food could be particularly valuable for some countries in loss of trade scenarios. Some have suggested that getting the World Trade Organization to change its rules would result in more food storage automatically. Still, I think the priority now is spending <a href=\"https://allfed.info/images/pdfs/Cost-Effectiveness%20global.pdf\">a few hundred million dollars</a> total on resilient foods to research, pilot, and plan for them. If we extend your proposal for 20 years and for the world, then you are up to ~$1 trillion. I think this is significantly less likely to happen and lower cost effectiveness than resilient foods.</p>", "parentCommentId": null, "user": {"username": "Denkenberger"}}]