[{"_id": "r3xbBMhXAjYPWDGf3", "postedAt": "2015-07-26T21:14:40.488Z", "postId": "H2MaFXcQ9eBDyLiHe", "htmlBody": "<p>Any data on the effect of visiting the website on donations to highly-effective charities? I'm wondering what the return was. Also curious about the return to website ads to get a sense of the overall effectiveness of such outreach measures.</p>\n<p>The difficulty of actually getting people to hand out pamphlets is interesting and, I think, an underrated reason why it's a difficult way to spread a cause.</p>\n", "parentCommentId": null, "user": {"username": "zdgroff"}}, {"_id": "ARCBaat7AtLJCioNX", "postedAt": "2015-07-27T10:54:25.533Z", "postId": "H2MaFXcQ9eBDyLiHe", "htmlBody": "<p>Thanks for writing this up, very interesting! </p>\n<p>The cost presumably doesn't include the volunteer time to hand out the pamphlets? I would guess the time cost associated with pamphleting is much more than the time cost associated with online advertising, and that the difference there is even more significant than the pure monetary difference. (Particularly given that it sounds like there was quite a lot of coordination effort, as well as the actual handing out leaflets.)</p>\n<p>On the other hand, if someone takes the trouble to go on the website from having been handed a leaflet, they seem plausibly much more likely to take further action than if they just clicked on a link online. Looking into the donations to top charities, as Zach suggests, could be indicative here (though I guess it would be very hard!). </p>\n", "parentCommentId": null, "user": {"username": "Michelle_Hutchinson"}}, {"_id": "q9qiY95eDAwMBqBRR", "postedAt": "2015-07-27T18:19:45.025Z", "postId": "H2MaFXcQ9eBDyLiHe", "htmlBody": "<p>Unfortunately, we could only track website visitors as far as clicking a &quot;donate&quot; button on TLYCS &quot;Where To Donate&quot; page (<a href=\"http://www.thelifeyoucansave.org/Where-to-Donate)\">http://www.thelifeyoucansave.org/Where-to-Donate)</a>. After clicking the button they are directed to the individual charity website, so we don't have visibility into if they actually followed through with making a donation, or how much that donation was.</p>\n<p>That being said, we only had one visitor that plausibly came from the pamphlets that clicked a donate button; if we had paid closer to Vegan Outreach prices for the pamphlets ($0.07), the cost of the 3500 pamphlets would have been about $245, and so the donation would have had to be on that level to get parity. Would definitely have been an interesting data point to see if / how much our clicker actually donated.</p>\n", "parentCommentId": "r3xbBMhXAjYPWDGf3", "user": {"username": "jonathonsmith"}}, {"_id": "iNqMkZeCC9fR3Krgh", "postedAt": "2015-07-27T18:34:12.668Z", "postId": "H2MaFXcQ9eBDyLiHe", "htmlBody": "<p>Yeah, one of the main &quot;unmeasurables&quot; of the pilot was how much more of an impression a pamphlet, handed out by a real volunteer, can have on someone over an online add. This goes into the &quot;touchpoint&quot; theory, where it may take multiple exposures to an idea before someone bites; and maybe getting a pamphlet is a much stronger &quot;touchpoint&quot; than seeing an online add. I personally think that getting handed a pamphlet by a non-paid volunteer is a really powerful thing; and that's the reason that (again personally) I think that it would be great to see someone in the EA movement give a pamphleting program another shot, along the lines I sketched in the lessons learned (branded on EA, including multiple organizations, with a stronger, repeated ask). </p>\n<p>We ran cost numbers including volunteer time and pamphlet development expenses, but I decided to ignore those for the final writeup, mainly because; the way we envisioned the program, the leaflets would be handed out on a volunteer basis by college students not paid TLYCS staff; and the cost of developing the pamphlets would amortize to a minimal effect over the lifetime of an ongoing pamphleting program. It's definitely a debatable decision though.</p>\n", "parentCommentId": "ARCBaat7AtLJCioNX", "user": {"username": "jonathonsmith"}}, {"_id": "t7FRjowJqW259dXRr", "postedAt": "2015-07-28T05:43:06.678Z", "postId": "H2MaFXcQ9eBDyLiHe", "htmlBody": "<blockquote>\n<p>Unfortunately, we could only track website visitors as far as clicking a &quot;donate&quot; button on TLYCS &quot;Where To Donate&quot; page (<a href=\"http://www.thelifeyoucansave.org/Where-to-Donate)\">http://www.thelifeyoucansave.org/Where-to-Donate)</a>. After clicking the button they are directed to the individual charity website, so we don't have visibility into if they actually followed through with making a donation, or how much that donation was.</p>\n</blockquote>\n<p>Does LYCS have any estimates which speak to that, even tangentially, for instance for it's general impact evaluations?</p>\n", "parentCommentId": "q9qiY95eDAwMBqBRR", "user": {"username": "jayd"}}, {"_id": "7ZMctKHNasWmC9HKr", "postedAt": "2015-07-29T18:54:13.758Z", "postId": "H2MaFXcQ9eBDyLiHe", "htmlBody": "<p>They must have some visibility into how many people are donating via their website, because they release yearly estimates for money moved. I'm not sure exactly how they go about doing this; it can't be via TLYCS website analytics though, so maybe they work with the charities themselves to track donations originating from TYLCS. I only partnered up with them for this study, so unfortunately I don't have any details.</p>\n", "parentCommentId": "t7FRjowJqW259dXRr", "user": {"username": "jonathonsmith"}}, {"_id": "tZwncZRThAJfvyevE", "postedAt": "2015-08-12T16:01:44.365Z", "postId": "H2MaFXcQ9eBDyLiHe", "htmlBody": "<p>TLYCS's (very) rough estimate is that on average each &quot;donate click&quot; equates to ~$100 in donations.  However, that's on overall average for our site, so my guess for a new visitor, currently enrolled in college, would be significantly lower.</p>\n<p>As a reminder, TLYCS also expects to generate a multiplier on its expenditures, so the true breakeven cost would have to be &lt;33% or so of the expected donations.</p>\n<p>Sorry to take so long to respond to this!</p>\n", "parentCommentId": "7ZMctKHNasWmC9HKr", "user": {"username": "Jon_Behar"}}]