[{"_id": "vMvhJYev2NzWwTGXY", "postedAt": "2018-05-06T01:52:48.306Z", "postId": "H38METsWhPwAXp7RC", "htmlBody": "<p>I think I'm mostly in agreement here. This thinking can lead to cult-ish groups, but my guess is deliberate decision-making could lead to very productive and safe outcomes.</p>\n<p>I also think that it's nice to be able to have groups of people to aspire to. This is obviously a fictional example, but I think the fact that the Jedi of Star Wars lived such strict routines made them more admirable; as opposed to being seen as &quot;holier-than-though&quot; individuals that others would shame for setting too good an example.</p>\n<p>One point I'd press back against is the line:\n&quot;Salaries at EA orgs have gone up significantly over time as well as more frequent retreats and other staff benefits. &quot;\nMy impression is that there is a lot of money out there (for groups that OpenPhil is comfortable funding), so the cost of paying these employees is relatively low. It seems to me like making more money should help your productivity and allow you to be more intense. I would be a lot more focused on total output per person than I would be financial stinginess. </p>\n<p>My model of a very intense person is similar to one of the intense entrepreneurs here; hopefully, they have a lot of resources available to them, but they do a lot with those resources.</p>\n", "parentCommentId": null, "user": {"username": "oagr"}}, {"_id": "JbMXAe66PCCEJgxM8", "postedAt": "2018-05-06T02:04:41.730Z", "postId": "H38METsWhPwAXp7RC", "htmlBody": "<p>Related: Dragon Army kind of tried something in this vein. I think the main posts about it have been taken down. \n<a href=\"https://www.lesswrong.com/posts/KShZSJyBwY7K3hcWN/on-dragon-army\">https://www.lesswrong.com/posts/KShZSJyBwY7K3hcWN/on-dragon-army</a></p>\n<p>I believe it didn't work as well as they were hoping, but I don't think them failing is much evidence that intense communities can't work. </p>\n", "parentCommentId": "vMvhJYev2NzWwTGXY", "user": {"username": "oagr"}}, {"_id": "fRvPcy7eFAaBBAhfs", "postedAt": "2018-05-06T05:48:12.853Z", "postId": "H38METsWhPwAXp7RC", "htmlBody": "<p>So I am not sure the focus on total output per person vs financial stinginess is so clear. To stick with the Open Phil example, it's not just the max they are willing to fund, it’s the counterfactual of their last donated dollar. For example, if one AR charity takes say x2 what it could run off (focusing on output per person vs frugalness) you would have to factor that counterfactual 50% of the donation going to the last charity that Lewis ends up funding with Open Phil (or maybe the last in that given year). In either of those situations the counterfactuals are definitely not 0. For example, say I personally would be 25% more effective if I was paid 50k vs 100k (x2 salary). I would have to assume my project is x4 better than the counterfactual project Lewis donates to otherwise. This could be true for one AR charity vs another, but I would say it's far from obvious and I will also note I would be quite surprised if the personal gains are that high in most cases of increased salaries, but would be super keen on more data on this. </p>\n", "parentCommentId": "vMvhJYev2NzWwTGXY", "user": {"username": "Joey"}}, {"_id": "nJx77ERMNW8AyeB9D", "postedAt": "2018-05-06T06:13:26.812Z", "postId": "H38METsWhPwAXp7RC", "htmlBody": "<p>I'd agree that you would have to assume that your project is 4x more efficient on the marginal dollar. However, I think this actually is the case for many of the things Open Phil funds. This could be much less the case in the animals space, but it definitely seems to be the case in the x-risk space, where there are relatively few groups in the space. My impression is that the current thinking is that groups below some &quot;threshold&quot; are expected to be neutral or actually net-negative, and very few groups are safely above that threshold (in the x-risk space.)</p>\n<p>Open Phil has access to a lot of money; I'm quite sure they could safely spend a lot more than they currently do and be fine.</p>\n", "parentCommentId": "fRvPcy7eFAaBBAhfs", "user": {"username": "oagr"}}, {"_id": "MqXRDq79wzXoAonHG", "postedAt": "2018-05-06T06:15:51.522Z", "postId": "H38METsWhPwAXp7RC", "htmlBody": "<p>I guess the crux here is if marginal group effectiveness follows an exponential curve or similar. My impression is that it does, but accept that this is an empirical question where I am not very sure.</p>\n<p>Outside of the space of things &quot;Open Phil and related groups find interesting&quot; though, all bets are off in regard to this. It seems like there are a bunch of small things that do deserve more funding.</p>\n", "parentCommentId": "fRvPcy7eFAaBBAhfs", "user": {"username": "oagr"}}, {"_id": "mFSqXu4wK38JFmTdw", "postedAt": "2018-05-06T06:17:55.600Z", "postId": "H38METsWhPwAXp7RC", "htmlBody": "<p>Another point: living in the bay is pretty expensive and is becoming more so. I don't see any solutions to this on the horizon. Having a bunch of people all live &amp; work here seems pretty efficient, at least until internet communication becomes a decent amount better.</p>\n<p>Rent + taxes + health expenses (gym memberships, healthy food), etc, can add up pretty quickly.</p>\n", "parentCommentId": "nJx77ERMNW8AyeB9D", "user": {"username": "oagr"}}, {"_id": "M9b4v5ACaKnSKMdsp", "postedAt": "2018-05-06T09:15:30.883Z", "postId": "H38METsWhPwAXp7RC", "htmlBody": "<p>I’m curious what kind of experiences people in the dedicated group actually had that put them off if you could elaborate on that. </p>\n<p>I share the impression that dedication is less encouraged in EA these days than five years ago. I’m also personally very disappointed by that since high dedication felt like a major asset I could bring to EA. Now I feel more like it doesn’t matter which is discouraging. </p>\n<p>My guess is that this is because high dedication is a trait of youth movements and the age of the median and perhaps more importantly the most influential EAs has gone up in the mean time. EA has lost its youth movement-y vibe. </p>\n<p>I’m also interested whether the other movements you’re comparing EA to are youth movements?</p>\n", "parentCommentId": null, "user": {"username": "Denise_Melchin"}}, {"_id": "runMxtZcaZYhCohoL", "postedAt": "2018-05-06T09:26:06.951Z", "postId": "H38METsWhPwAXp7RC", "htmlBody": "<p>Another factor leading to dedication being emphasized less might be that people are less motivated to be dedicated these days. The growth of the movement and the funding available have resulted in an individual’s EA contributions mattering far less than they used to. </p>\n<p>The increased concern about downside risk has also made it much harder to ‘use up’ your dedication. A few years ago you could at least always do some outreach - now it’s commonly considered far less clear the sign on that is positive. </p>\n", "parentCommentId": "M9b4v5ACaKnSKMdsp", "user": {"username": "Denise_Melchin"}}, {"_id": "bDM9mEX4rKLs9uRJZ", "postedAt": "2018-05-06T10:25:38.358Z", "postId": "H38METsWhPwAXp7RC", "htmlBody": "<p>Can you explain what you mean by &quot;dedication&quot;? In this post, it seems to mean something like &quot;caring a lot and acting accordingly&quot; - is that what you meant? </p>\n", "parentCommentId": null, "user": {"username": "Khorton"}}, {"_id": "vqjFiKWZP3CTrWxb6", "postedAt": "2018-05-06T10:36:49.740Z", "postId": "H38METsWhPwAXp7RC", "htmlBody": "<blockquote>\n<p>The increased concern about downside risk has also made it much harder to ‘use up’ your dedication. </p>\n</blockquote>\n<p>Thanks for articulating that - it was a undefined sense of ill-ease, that I now have words for. When I joined EA initially I naively thought everything I did (donating, outreach) was certainly net positive, and I could boldly dedicate away! The uncertainty I now feel about everything makes motivation harder and deprives me of the satisfaction I used to get (especially as my brain prefers to fixate on the possible negatives, rather than the expected value). </p>\n", "parentCommentId": "runMxtZcaZYhCohoL", "user": {"username": "cafelow"}}, {"_id": "RzHzpTH5ZDHh9hRC3", "postedAt": "2018-05-06T18:10:43.605Z", "postId": "H38METsWhPwAXp7RC", "htmlBody": "<p>I think living in an EA city is one of the strongest cases for spending more money in terms of increasing impact per $ spent. I think it’s the more marginal stuff I am generally careful about (e.g. eating at restaurants).</p>\n", "parentCommentId": "mFSqXu4wK38JFmTdw", "user": {"username": "Joey"}}, {"_id": "nPT7wDg96EqETqDPA", "postedAt": "2018-05-06T18:11:33.548Z", "postId": "H38METsWhPwAXp7RC", "htmlBody": "<p> &quot;I’m also personally very disappointed by that since high dedication felt like a major asset I could bring to EA. Now I feel more like it doesn’t matter which is discouraging.&quot; It’s still very helpful to other dedicated people to know people like you :) </p>\n<p>The main movement I am comparing EA to is its younger self, but I think the AR movement also came to mind a lot while writing this post.</p>\n<p>I agree that age seems to play a pretty noticeable role, with older movements being wiser but less energetic. I think there might just be some biological mechanism at play, but I also think that in many movements people do &quot;what they can get away with&quot;. If I can work 30 hours and my organization is still successful, it’s less motivating to work 60 than if that 30 extra hours will be the make more break. Wisdom gives me more ability to slack on energeticness.</p>\n", "parentCommentId": "M9b4v5ACaKnSKMdsp", "user": {"username": "Joey"}}, {"_id": "zCC9hRHeznMCawYaq", "postedAt": "2018-05-06T18:14:33.783Z", "postId": "H38METsWhPwAXp7RC", "htmlBody": "<blockquote>\n<p>I share the impression that dedication is less encouraged in EA these days than five years ago</p>\n</blockquote>\n<p>Not sure i agree with this. Certainly there is less focus on donating hug sums of money, but that may also be explained by the shift to EA Orgs now often recommending direct work. But i think the EA community as a hole now focusses less on attracting huge ammounts of people and more on keeping the existing members engaged and dedicated and influencing their career choice (if i remember correctly the strategic write-ups from both CEA and EAF seem to reflect this). </p>\n<p>For instance, the recent <a href=\"https://www.centreforeffectivealtruism.org/ceas-current-thinking/\">strategy write-up</a> by CEA mentions dedication as an important factor:</p>\n<blockquote>\n<p>We can think of the amount of good someone can be expected to do as being the product of three factors (in a mathematical sense):</p>\n<ol>\n<li>Resources: The extent of the resources (money, useful labor, etc.) they have to offer;</li>\n<li>Dedication: The proportion of these resources that are devoted to helping;</li>\n<li>Realization: How efficiently the resources devoted to helping are used</li>\n</ol>\n</blockquote>\n<p>But i agree that there is a lot of focus on 'talent' and dedication seems to take a second role behind it. This may be defensable but i think that we could probably stress dedication a bit more, because talking about 'dedication' may turn less people of than talk about 'talent'. To me talent seems more like something you have while dedication seems like something that 'merely' requires willpower. I would generaly be more worried about 'lacking talent' than 'lacking dedication', but I don't really know how many people share that intuition.</p>\n", "parentCommentId": "M9b4v5ACaKnSKMdsp", "user": {"username": "Yannick_Muehlhaeuser"}}, {"_id": "jgmYopiXqPtsSTdLo", "postedAt": "2018-05-06T19:29:11.630Z", "postId": "H38METsWhPwAXp7RC", "htmlBody": "<p>I think an increase in median age would have less to do with the shift than emphasizing dedication less. One of the primary drivers of growth for EA is outreach to undergraduate students at universities around the world, and constantly bringing in 18-22 year-olds into the movement should exert a statistical pressure that would keep the median age down. On the other hand, if messaging was emphasizing less the importance of dedication to EA, I'd naively expect the younger and fresher individuals movement organizations are bringing into the movement are being less selected for dedication than a few years ago.</p>\n", "parentCommentId": "M9b4v5ACaKnSKMdsp", "user": {"username": "Evan_Gaensbauer"}}, {"_id": "jnWWDGo4CAsBQPX3k", "postedAt": "2018-05-06T19:31:56.702Z", "postId": "H38METsWhPwAXp7RC", "htmlBody": "<p>It's my impression it's a handful of coordinator organizations in EA who think it's not clear the sign of outreach is positive. It's my impression from most individual effective altruists I talk to, and I expect this would extend to their opinion as a bloc, the sign of outreach, even after taking into account the possibility of rogue/unilateral actors, is moderately positive.</p>\n", "parentCommentId": "runMxtZcaZYhCohoL", "user": {"username": "Evan_Gaensbauer"}}, {"_id": "3FS7pBej2q3JyGzpB", "postedAt": "2018-05-06T19:33:16.226Z", "postId": "H38METsWhPwAXp7RC", "htmlBody": "<p>As I stated in <a href=\"http://effective-altruism.com/ea/1o3/the_importance_of_ea_dedication_and_why_it_should/e92\">this comment</a>, it's far from a consensus actions like donating or outreach are of an ambiguous sign.</p>\n", "parentCommentId": "vqjFiKWZP3CTrWxb6", "user": {"username": "Evan_Gaensbauer"}}, {"_id": "Ccxf396TiZTFZykEg", "postedAt": "2018-05-06T19:36:28.069Z", "postId": "H38METsWhPwAXp7RC", "htmlBody": "<p>See <a href=\"http://effective-altruism.com/ea/1o3/the_importance_of_ea_dedication_and_why_it_should/e91\">this comment</a> I made about why an increase in the median age of effective altruists might not play as much a role as one would expect at first glance.</p>\n", "parentCommentId": "nPT7wDg96EqETqDPA", "user": {"username": "Evan_Gaensbauer"}}, {"_id": "zP2EgpJhKu2KBd5Jc", "postedAt": "2018-05-06T21:12:31.670Z", "postId": "H38METsWhPwAXp7RC", "htmlBody": "<p>The tension of over- vs. under-dedication on the part of individuals to find the best balance for the needs of EA has always been at the heart of the movement: it's called Giving What We <em>Can</em> for a reason, and Singer's book was called <em>The Most Good You Can Do</em> not the <em>The Most Good You <strong>Should</strong> Do</em>. I think it's the experience of some the message of EA combined with a call for dedication can be so overwhelming many people feel compelled to do more than they can; burn out; and feel dejected enough by their self-perception of failure they can't summon as much dedication as they did before. Unfortunately, as you point out, de-emphasizing dedication doesn't lead to effective altruists dedicated at all times as much as they can be in a sustainable manner, but effective altruists who aren't dedicated once the clock at the office is up. Now that EA has been around for a few years, and even if it were slowing down (which it isn't), it'd be around for a while longer. So we can take a longer-term view of investing resources into individual effective altruists. I don't think dedication is fixed: newcomers to EA don't come in with either a level of dedication we can work with, or not, and that's the end of it. Given we can expect some individuals to be dedicated to community projects indefinitely, we can foster a growth of dedication in effective altruists. I think to prevent outcomes like burnout in fostering increased dedication, it's the responsibility of existing community members to create an evidence-based tool-kit for how to do so. Currently we don't have either of those two evidence-based tool-kits (they're two separate tool-kits), but that might because not enough effective altruists were interested in creating them. Pushing 'excited altruism' over 'dedicated altruism' often seems motivated by PR concerns of not being offputting to newcomers, but that's based on assumptions of what kinds of people we should be reaching out to to bring into the movement in the first place. Of all the pieces written cautioning against both the appearance and reality of over-exertion in EA, I think the best is <a href=\"http://effective-altruism.com/ea/n8/a_defense_of_normality/\">A Defense of Normality</a> by Eric Herboso. A difference between Eric's post and others is his comes from a motivation of both fostering dedication <em>and</em> caring about the sustainable, long term well-being of individual community members, so that dedication and the work those effective altruists do is itself sustainable. This is unlike other motivations to de-emphasize dedication in EA, as you mentioned above:</p>\n<blockquote>\n<ul>\n<li>What topics that are researched in an organization. Does it lean more towards what the researchers find fun or towards what will help the most people?</li>\n</ul>\n</blockquote>\n<blockquote>\n<ul>\n<li>Management choices. Does one hire/fund someone they are friends with or do they hire/fund the strongest applicant chosen by more objective criteria?</li>\n</ul>\n</blockquote>\n<blockquote>\n<ul>\n<li>Strategic direction. Does the person point their organization in a direction that might be higher impact but less personally or organizationally prestigious?</li>\n</ul>\n</blockquote>\n<p>At the time Eric wrote his post, <a href=\"http://effective-altruism.com/ea/n8/a_defense_of_normality/4vz\">Peter Hurford and others commented</a> the level of dedication Eric was observing was to a degree past which we'd see diminishing marginal returns to productivity and also health and well-being were (some) effective altruists were to dedicate themselves as much as the picture Eric was painting. It might be the case Eric was observing other effective altruists personally over-correcting to make up for what they saw as a decline in the average level of dedication in the community. De-emphasizing dedication in EA on shortsighted grounds doing what's more comfortable, fun or prestigious, even if it's not the best plan for how to do the most good from whatever perspective, is the problem to solve. Making EA based on appearances of drawing in people who want to feel comfortable, fun or prestigious, without too much dedication, may be what's drawing in people who who aren't willing to up their dedication when EA stops being fun, comfortable or prestigious. They may not want to become more dedicated, because when they joined the movement they were told they wouldn't have to be. </p>\n<p>Having been a past moderator for the EA Peer Support group on Facebook, and a long-time community organizer, I've seen the toll in hundreds of effective altruists of being sent the mixed message of dedicating yourself while doubting everything you're doing but doing so in a self-effacing way so it's not offputting to potentially anyone else. I'd like to construct effective, robust evidence-based tool-kits for both fostering a growth in dedication and long-term sustainable self-care which suits the unique demands of effective altruism. If anyone is interested in such a project, I welcome anyone's contributions, so don't hesitate to contact me.</p>\n", "parentCommentId": null, "user": {"username": "Evan_Gaensbauer"}}, {"_id": "a9rGrAKejZe2cpcRm", "postedAt": "2018-05-07T12:50:07.702Z", "postId": "H38METsWhPwAXp7RC", "htmlBody": "<p>Thanks Joey, that's an important subject!</p>\n<p>We want to build a culture that fosters dedication without putting off newcomers too much, and right now we are trying to see where to put the cursor between these two positions:</p>\n<ol>\n<li>“Even small efforts are good, EA Should stay fun!”</li>\n<li>“EA is a moral duty that requires full dedication!”</li>\n</ol>\n<p>I think this is the wrong way to look at it. The apparent trade-off between them is based on a false dichotomy, because these two statements don’t talk about the same things: the first is about psychology, while the second is about philosophy. Debates where we discuss different things tend to be less productive. Instead, we could frame the message so that both views are aligned. After all, when the right conditions are met, people can be very dedicated <em>and</em> have a blast, without feeling that they are sacrificing themselves.</p>\n<p>We could say “Dedication for a cause and well-being are both very important, and thankfully they tend to go hand in hand. Therefore, find a job that suits you well and has a big impact, and chances are you will be happy.” That way, we could still promote the value of a strong dedication but without putting people off.</p>\n<p>In my experience, dedication is like motivation: it’s good to have, but it can only be increased indirectly. Just like it’s not helpful to say “be more motivated!’, it’s probably not very useful to encourage people to &quot;be more dedicated&quot;. But if we see dedication as a consequence, something that happens when specific elements are present, then we can focus on these elements. To find which ones influence dedication the most, we should look at the science of dedication (anyone?), but one simple concept we could use is Ikigai (<a href=\"https://en.wikipedia.org/wiki/Ikigai)\">https://en.wikipedia.org/wiki/Ikigai)</a>. According to the Ikigai concept, doing something for the world is only one piece of the dedication puzzle. Using this example, in order to increase the number of dedicated EAs, we could try to make it easier for us to find people who can fill these 4 circles with EA stuff. Recommendations could include:</p>\n<ul>\n<li><p>“What you love” circle: let’s find more people who love the things that should be done (by doing more/different outreach, and by showing the fun aspects of impactful careers).</p>\n</li>\n<li><p>“What you are good at” circle: let’s find more people who are good at those things (e.g. headhunting) and let’s provide training for those who need it.</p>\n</li>\n<li><p>“What the world needs” circle: let’s identify more ways to have positive impact.</p>\n</li>\n<li><p>“What you can be paid for”: let's fund more projects.</p>\n</li>\n</ul>\n<p>In summary, by considering dedication as an emergent feature, we could optimize for it by acting on its causes rather than by trying to convince people of its importance (which I think is way harder to do).</p>\n", "parentCommentId": null, "user": {"username": "FlorentBerthet"}}, {"_id": "5Xxkttpw8f3HvWQq7", "postedAt": "2018-05-08T06:42:34.327Z", "postId": "H38METsWhPwAXp7RC", "htmlBody": "<p>More reasons for why sharing the mission of EA (which includes dedication as a component) is important in most roles in EA non-profits:</p>\n<p><a href=\"https://80000hours.org/articles/operations-management/#why-is-it-important-for-operations-staff-to-share-the-mission-of-effective-altruism\">https://80000hours.org/articles/operations-management/#why-is-it-important-for-operations-staff-to-share-the-mission-of-effective-altruism</a></p>\n", "parentCommentId": null, "user": {"username": "Benjamin_Todd"}}, {"_id": "8hn9B6FS8C2Nnucd5", "postedAt": "2018-05-08T09:10:38.611Z", "postId": "H38METsWhPwAXp7RC", "htmlBody": "<p>But should we not expect coordinator organizations to be the ones best placed to have considered the issue? </p>\n<p>My impression is that they have developed their view over a fairly long time period after a lot of thought and experience.</p>\n", "parentCommentId": "jnWWDGo4CAsBQPX3k", "user": {"username": "Alex_Barry"}}, {"_id": "DJZ8xRwD7Ejz9ukQ7", "postedAt": "2018-05-08T10:28:54.471Z", "postId": "H38METsWhPwAXp7RC", "htmlBody": "<p>Yes,  but I think the current process isn't inclusive of input from as many EA organizations as it could or should be. It appears it might be as simple as the CEA having offices in Berkeley and Oxford meaning they receive a disproportionate amount of input on EA from those organizations, as opposed to EA organizations whose staff are geographically distributed and/or don't have an office presence near the CEA. I think the CEA should still be at the centre of making these decisions, and after recent feedback from Max Dalton from the CEA on the EA Handbook 2.0, I expect they will make a more inclusive process for feedback on outreach materials. </p>\n", "parentCommentId": "8hn9B6FS8C2Nnucd5", "user": {"username": "Evan_Gaensbauer"}}, {"_id": "ksf7CrmvYp7tcTnAD", "postedAt": "2018-05-08T13:11:40.503Z", "postId": "H38METsWhPwAXp7RC", "htmlBody": "<p>I'm not quite sure what argument you are trying to make with this comment.</p>\n<p>I interpreted your original comment as arguing for something like:\n&quot;Although most of the relevant employees at central coordinator organisations are not sure about the sign of outreach, most EAs think it is likely to be positive, thus it is likely to in fact be positive&quot;.</p>\n<p>Where I agree with first two points but not the conclusion, as I think we should consider the staff at the 'coordinator organizations' to be the relevant expert class and mostly defer to their judgement. </p>\n<p>Its possible you were instead arguing &quot;The increased concern about downside risk has also made it much harder to ‘use up’ your dedication&quot; is not in fact a concern faced by most EAs, since they still think outreach is clearly positive, so this is not a discouraging factor. </p>\n<p>I somewhat agree with this point, but based on your response to cafelow I do not think it is very likely to be the point you were trying to make.</p>\n", "parentCommentId": "DJZ8xRwD7Ejz9ukQ7", "user": {"username": "Alex_Barry"}}, {"_id": "sdPaNqS7C9Ze7b9pz", "postedAt": "2018-05-09T21:18:25.169Z", "postId": "H38METsWhPwAXp7RC", "htmlBody": "<blockquote>\n<blockquote>\n<p>Not sure i agree with this. Certainly there is less focus on donating hug sums of money, but that may also be explained by the shift to EA Orgs now often recommending direct work. But i think the EA community as a hole now focusses less on attracting huge ammounts of people and more on keeping the existing members engaged and dedicated and influencing their career choice (if i remember correctly the strategic write-ups from both CEA and EAF seem to reflect this).</p>\n</blockquote>\n</blockquote>\n<blockquote>\n<p>For instance, the recent strategy write-up by CEA mentions dedication as an important factor:</p>\n</blockquote>\n<blockquote>\n<blockquote>\n<p>We can think of the amount of good someone can be expected to do as being the product of three factors (in a mathematical sense): 1. Resources: The extent of the resources (money, useful labor, etc.) they have to offer; 2. Dedication: The proportion of these resources that are devoted to helping; 3. Realization: How efficiently the resources devoted to helping are used</p>\n</blockquote>\n</blockquote>\n<p>(top level comment to not make the thread even more messy)</p>\n<p>When we talk about dedication and what that looks like in people, I think we can have very different images in mind. We could think of a 'dedicated EA' and think of two different archetypes (of course, reality is more messy than that and people might actually be both):</p>\n<p>Person A talks about dedicating their life to having a high impact, about the willingness for self-sacrifice, about optimising everything for this one goal. They're very enthusiastic, think about all their options to do good and talk about nothing but EA.</p>\n<p>Person B is careful and measured. They think about how they can use their career and other resources to have a very high impact and about the long road to being in highly impactful position in a later point in their career. They want to make sure they get there by having a proper work-life balance in the process. </p>\n<p>When I say (and I think this is true for Joey as well) that EA emphasises dedication much less, I think about dedication in the way that person A embodies. I think CEA in their material think about dedication more in the way of Person B.</p>\n<p>EA was much smaller and less professional in the past. That also meant that the 'highest status' positions were much more easily accessible. When I met Joey in 2013, he was interning at 80,000hours and then started his own project with Charity Science and people thought highly of him for that. Now it is not possible anymore to easily intern or volunteer at high profile EA orgs ('management capacity constraints'). Easily accessible positions still exist, but due to the professionalisation and growth of the EA movement, they're less 'high status' and therefore less appealing.</p>\n<p>The type of people like Joey who just went out and started their own projects they were enthusiastic about are also relatively speaking (compared to the now 'high status' EA endeavours)  less likely to get funding today.\nI think this might actually be where some part of the conflict about funding constraints and whether small student-y projects are worth funding or not is actually coming from - do we want to support an EA culture where we encourage young people to do random EA projects? Or do we want to foster a professional environment? </p>\n<p>I think the move towards professionalising EA has been correct, but we should be aware of the costs it has imposed on people who liked the young people dedicated person A vibe of EA in the past. One alternative name proposal for EA was 'super hardcore do-gooder' - unthinkable today.</p>\n", "parentCommentId": null, "user": {"username": "Denise_Melchin"}}, {"_id": "ijPgnDtHv59iinSkz", "postedAt": "2018-05-10T02:52:29.031Z", "postId": "H38METsWhPwAXp7RC", "htmlBody": "<p>Good post.</p>\n<blockquote>\n<p>Excited altruism has become a more predominant force in EA which implies a lower level of self-sacrifice.</p>\n</blockquote>\n<p>Excited vs obligatory altruism strikes me as orthogonal to dedicated vs less dedicated.  When an excited altruist is dedicated, that's passion.  When an obligatory altruist is dedicated, that's self-discipline.  Seems like two different ways to reach a similar point.  Also, there is an empirical question here: It may be that telling people to be excited altruists creates passionate altruists at a higher rate than telling people to be obligatory altruists creates self-disciplined altruists, in the same way salespeople seem to have discovered that telling prospects they have an '<a href=\"https://www.youtube.com/watch?v=xFr0FKnaLDk\">opportunity</a>' to buy seems to work better than telling prospects they have an 'obligation' to buy.</p>\n", "parentCommentId": null, "user": {"username": "John_Maxwell_IV"}}, {"_id": "Z4geTYvniY846qd4n", "postedAt": "2018-05-10T02:54:51.362Z", "postId": "H38METsWhPwAXp7RC", "htmlBody": "<p>A possible solution to this problem is to 'use up' your dedication in <a href=\"http://effective-altruism.com/ea/1lz/why_we_should_be_doing_more_systematic_research/\">systematic research</a> working to resolve important uncertainties.</p>\n", "parentCommentId": "vqjFiKWZP3CTrWxb6", "user": {"username": "John_Maxwell_IV"}}, {"_id": "qGPDQHov4TqcBo3sn", "postedAt": "2018-08-23T18:28:20.733Z", "postId": "H38METsWhPwAXp7RC", "htmlBody": "<p>I believe there is a threshold difference between passionate and self-disciplined EAs. As excited EAs become more dedicated, they tend to hit a wall where their frugality starts to affect them personally much more than it previously have. This wall takes effort to overcome, if it is overcome at all.</p>\n<p>Meanwhile, when an obligatory EA becomes more dedicated, that wall doesn't exist (or at least it has less force). So it's easier for self-disciplined EAs to get to more extreme levels than for passionate EAs.</p>\n", "parentCommentId": "ijPgnDtHv59iinSkz", "user": {"username": "EricHerboso"}}, {"_id": "8vP5kcJ8MB8BYqDDe", "postedAt": "2018-08-27T00:20:11.376Z", "postId": "H38METsWhPwAXp7RC", "htmlBody": "<p>Well if we believe 80K that talent gaps matter more than funding gaps, maybe it's good for excited EAs to worry less about donating and more about direct impact?</p>\n", "parentCommentId": "qGPDQHov4TqcBo3sn", "user": {"username": "John_Maxwell_IV"}}]