[{"_id": "vPJn7z8HHhiBsH3bi", "postedAt": "2023-11-09T12:09:55.925Z", "postId": "H3dCunWkJ6J6u7AYv", "htmlBody": "<p>Thanks for sharing this piece.<br><br>From your review, did you get a sense of how many ABFT are farmed at the moment (in terms of number of animals), or how big the industry could get if successful?<br><br>Looking very quickly at <a href=\"http://fishcount.org.uk/studydatascreens2/2017/numbers-of-farmed-fish-A0-2017.php?sort2/full\">fishcount's 2017 data,</a> it would suggest 7.4k metric tonnes, but they don't provide a mean slaughter weight. &nbsp;Based on the weight of a mature adult provided above, it might suggest only around 30k were slaughtered in 2017. &nbsp;That's seems pretty small for a farmed finfish species. &nbsp;<br><br>All else equal, I'd be surprised that growth since then might make it look like a top priority farmed fish species from a purely scale perspective. &nbsp;That said its possible the FAO data might not accurately reflect extent of farming, that hatchery mortality rates could be several times higher than for other farmed fish species, and growth could accelerate if there are breakthroughs in farming methods.</p><p>Assuming scale in terms of number farmed is relatively small, do you think there would be a case for prioritising allocating resources to improving the welfare this species?<br><br>I can see the case that the high-value (both per kg and per animal) of ABFT means that producers might have the financial means to experiment with and implement welfare improvements in a way that might not be true for other fish. &nbsp;I can also see public campaigns about ABFT farming gathering more support than campaigns about other farmed fish species.</p>", "parentCommentId": null, "user": {"username": "Sagar K Shah"}}, {"_id": "F3wQMRYt8XYBhPKDz", "postedAt": "2023-11-09T13:08:41.855Z", "postId": "H3dCunWkJ6J6u7AYv", "htmlBody": "<p><strong>Executive summary</strong>: Domesticating Atlantic bluefin tuna raises sustainability benefits but also welfare concerns that require more research.</p><p><strong>Key points</strong>:</p><ol><li>Domesticating Atlantic bluefin tuna enables closed-cycle aquaculture, reducing reliance on unsustainable wild catch. However, many larvae still die in hatcheries.</li><li>Conditions in captivity like small tanks, noise, and handling may cause stress for these large predator fish. More research on their needs and welfare is required.</li><li>Common slaughter methods for small tuna seem inhumane with crowding and spiking. It's unclear what proportion face this cruel death.</li><li>As the industry develops, producers have incentives to ensure good welfare since stress harms meat quality. But welfare is not yet a big priority.</li><li>Overall, more research is required on Atlantic bluefin tuna welfare in captivity to guide humane practices as domestication increases.</li></ol><p>&nbsp;</p><p><i>This comment was auto-generated by the EA Forum Team. Feel free to point out issues with this summary by replying to the comment, and</i><a href=\"https://forum.effectivealtruism.org/contact\"><i>&nbsp;<u>contact us</u></i></a><i> if you have feedback.</i></p>", "parentCommentId": null, "user": {"username": "SummaryBot"}}]