[{"_id": "2qHsHLr4hqq3bzFFP", "postedAt": "2023-10-02T22:41:12.171Z", "postId": "H7BwgJAuhNa7stRfr", "htmlBody": "<p>I’ve read conflicting things about how individual contributor skills (writing the code) and people management skills relate to one another in programming.</p>\n<p>Hacker News and the cscareerquestions subreddit give me the impression that they’re very separate, with many complaining about how advancement dries up on a non-management track.</p>\n<p>But I’ve also read a few blog posts (which I can’t recall) arguing the most successful tech managers / coders switch between the two, so that they keep their technical skills fresh and know how their work fits in a greater whole.</p>\n<p>What’s your take in this? Has it changed since starting your new job?</p>\n", "parentCommentId": null, "user": {"username": "geoffreyyip"}}, {"_id": "k9WFkXfRaxweZdPQW", "postedAt": "2023-10-02T23:56:59.405Z", "postId": "H7BwgJAuhNa7stRfr", "htmlBody": "<p>I'm a fan of the going back and forth approach, though I don't think I've worked with anyone else whose done it.  I've gone IC -&gt; Manager -&gt; IC -&gt; Manager -&gt; IC, based on organizational needs. On the other hand some people are just a really great fit for management and should specialize in it. How strong you need to keep your technical skills depends a lot on your style of management, your specific strengths, and whether your org uses a \"tech lead\" system.</p>\n<p>While advancement does dry up in many places if you're not willing to move into management, that wasn't my experience at Google.  I knew some very influential (and well-compensated) non-managers. Though even if you stay on the technical track more of your impact still comes via other people: designing things, giving feedback on other people's designs, reviewing code, teaching other people how to do things, etc.</p>\n", "parentCommentId": "2qHsHLr4hqq3bzFFP", "user": {"username": "Jeff_Kaufman"}}, {"_id": "ek66LTnWwNcYwxrbM", "postedAt": "2023-10-03T05:49:06.494Z", "postId": "H7BwgJAuhNa7stRfr", "htmlBody": "<p>Jeff, your transition from a professional programmer with over a decade of experience in ads and web performance to a career in biosecurity is quite fascinating. Can you share what motivated or inspired you to make this significant switch in your career path? Additionally, &nbsp;do you believe that your impact on addressing global health threats is more substantial compared to your previous career, and what are the key differences you've noticed in terms of the impact you can make? Lastly, I hold a PhD in Medical Microbiologist considering switching my research career to biosecurity. &nbsp;What sincere advice or insights would you offer a person like me who is considering a switch to biosecurity this time as a researcher, based on your own experiences and observations in your new role? &nbsp;A Major hurdle has been securing funding, impact for a researcher comes with increased funding. &nbsp;As someone who has funded research, what attracts you to a project to fund?</p>", "parentCommentId": null, "user": {"username": "emmannaemeka"}}, {"_id": "gtwuqh4XazmkTmz59", "postedAt": "2023-10-03T12:12:24.221Z", "postId": "H7BwgJAuhNa7stRfr", "htmlBody": "<p>Just curious, why did you decide not to tackle AI risks? This seems like it would be more of a natural flow based on your interest in existential risk and experience with programming.</p>", "parentCommentId": null, "user": {"username": "JordanStone"}}, {"_id": "ZmW4t6GqeDBricAmo", "postedAt": "2023-10-03T12:37:41.992Z", "postId": "H7BwgJAuhNa7stRfr", "htmlBody": "<p>Several reasons:</p>\n<ul>\n<li>\n<p>Some areas of bio are also very computational, including where I am.</p>\n</li>\n<li>\n<p>I strongly value both working in person with other people and living in Boston. Short term and long term, working in bio seemed better for that than AI.</p>\n</li>\n<li>\n<p>It seemed to me that the EA community was overinvesting in AI relative to bio</p>\n</li>\n</ul>\n", "parentCommentId": "gtwuqh4XazmkTmz59", "user": {"username": "Jeff_Kaufman"}}, {"_id": "pbWbb5DonRd43qrc6", "postedAt": "2023-10-03T12:40:37.579Z", "postId": "H7BwgJAuhNa7stRfr", "htmlBody": "<p>I <a href=\"https://www.linkedin.com/in/skip-addison-03a28/\">know a guy</a><span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefca9b8o0thn\"><sup><a href=\"#fnca9b8o0thn\">[1]</a></sup></span>&nbsp;who's done the same Manager ↔ IC transition. Google as well. I do really respect this part of Google's culture.</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnca9b8o0thn\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefca9b8o0thn\">^</a></strong></sup></span><div class=\"footnote-content\"><p>My dear old Dad</p></div></li></ol>", "parentCommentId": "k9WFkXfRaxweZdPQW", "user": {"username": "jpaddison"}}, {"_id": "v2RyEHhDoGPKmT28u", "postedAt": "2023-10-03T13:10:27.655Z", "postId": "H7BwgJAuhNa7stRfr", "htmlBody": "<blockquote>\n<p>Can you share what motivated or inspired you to make this significant switch in your career path?</p>\n</blockquote>\n<p>I wrote some about this <a href=\"https://forum.effectivealtruism.org/posts/AfFacofBAT8HaKQiw\">at the time</a> but my biggest motivation was that, given the situation with funding and talent, I thought it was pretty likely that organizations would rather have my time than my money? This is not what I thought earlier on: in, say, 2013, there were a ton of really important things people could have been doing if they had the money, and very little funding available.</p>\n<p>My sense of where I would be most altruistically useful, earning versus doing, changed <a href=\"https://www.jefftk.com/p/giving-vs-doing\">around 2016</a>, but for a long time I continued earning to give because I couldn't find projects that I thought were were a good fit for my interests, abilities, and constraints.</p>\n<blockquote>\n<p>Do you believe that your impact on addressing global health threats is more substantial compared to your previous career, and what are the key differences you've noticed in terms of the impact you can make?</p>\n</blockquote>\n<p>This is tricky to answer, because the main impact of my new line of work comes from helping flag a pandemic earlier than we would otherwise, plus some deterrence. We don't yet have a system up that could flag anything, let alone a system that has flagged anything, so there's a sense in which my impact so far in my new role has been zero. But I think my impact in expectation is still much more substantial than it would have been had I continued with my previous approach.</p>\n<blockquote>\n<p>I hold a PhD in Medical Microbiologist considering switching my research career to biosecurity.  What sincere advice or insights would you offer a person like me who is considering a switch to biosecurity this time as a researcher, based on your own experiences and observations in your new role?</p>\n</blockquote>\n<p>That's great!</p>\n<p>What is your background within medical microbiology?</p>\n<p>I'm not sure where you are along in your process of considering this, so I may be offering advice that is not at the right level, but my normal advice here would be to start with the <a href=\"https://80000hours.org/problem-profiles/preventing-catastrophic-pandemics/\">80,000 hours problem profile</a> and start by thinking about whether you're a better fit for biosecurity policy or concrete technical work. Happy to answer more detailed questions if you've already narrowed your search down some!</p>\n<blockquote>\n<p>As someone who has funded research, what attracts you to a project to fund?</p>\n</blockquote>\n<p>I haven't directly funded very much: most of my donations have been via funds, where smaller donors pool their money and a grantmaker reviews applications and makes decisions.</p>\n", "parentCommentId": "ek66LTnWwNcYwxrbM", "user": {"username": "Jeff_Kaufman"}}, {"_id": "dSPhEC8v7ASmnbgh5", "postedAt": "2023-10-03T15:58:43.084Z", "postId": "H7BwgJAuhNa7stRfr", "htmlBody": "<p>Hey Jeff, thanks for writing this!</p><p>I'm wondering if you'd be willing to opine on what the biggest blockers are for mid-career people who are considering switching to more impactful career paths — particularly those who are not doing things like earning to give, or working on EA causes?</p>", "parentCommentId": null, "user": {"username": "julianhazell"}}, {"_id": "BfLo2fTYKfK5LsLAC", "postedAt": "2023-10-03T20:33:52.562Z", "postId": "H7BwgJAuhNa7stRfr", "htmlBody": "<p>Speculating, I'd guess the most common blockers are risk/loss aversion and not having much slack.  If you are spending most of what you earn and are reasonably happy with how your life is going, it's quite hard to make the jump to doing something very different -- what if it doesn't work out, you burn through your savings quickly, and you can't go back?</p>\n", "parentCommentId": "dSPhEC8v7ASmnbgh5", "user": {"username": "Jeff_Kaufman"}}, {"_id": "Q6C7xaq5bdMoXviun", "postedAt": "2023-10-05T10:03:57.473Z", "postId": "H7BwgJAuhNa7stRfr", "htmlBody": "<p>Hi Jeff, thanks for posting about this--I feel that we clearly don't talk enough about biorisks. Could you share how much background knowledge was necessary for you to do the switch? Was it an interest of yours as a hobby, or did you follow fellowships? I understand very much how your skills were highly transferrable, but I wonder about the background knowledge part since this is something many of my working professionals worry about when thinking about making a switch (since they have not been in academia before they worry that they won't be good enough despite having similar skills to yours).&nbsp;</p>", "parentCommentId": null, "user": {"username": "Vaipan"}}, {"_id": "Fg8BsMgK5sGsT8sba", "postedAt": "2023-10-05T10:37:38.055Z", "postId": "H7BwgJAuhNa7stRfr", "htmlBody": "<p>I didn't have much background in biorisk. My last formal bio training was 9th grade bio, though I've also paid attention to news etc and knew more than I got from that class. I read some about the overall problem area from the 80k problem profile and reading lists, but the specific domain knowledge has almost all been on-the-job learning. Which isn't a new experience for me, or I suspect most programmers: it's also how I learned web performance optimization, the advertising ecosystem, and all the other domains I've worked in.</p>\n<p>I think this approach does require a high enough fraction of people with real training, but a senior person with transferable skills (hi!) can still be very useful matched with domain experts who are either busy or have fewer of those skills.</p>\n", "parentCommentId": "Q6C7xaq5bdMoXviun", "user": {"username": "Jeff_Kaufman"}}, {"_id": "FTeXoDFwja3Abbggy", "postedAt": "2023-10-05T11:05:23.427Z", "postId": "H7BwgJAuhNa7stRfr", "htmlBody": "<p>That's what I felt! Do you feel that people with experience in management or leadership could be useful, even if they come from a background of sales or consulting?</p>", "parentCommentId": "Fg8BsMgK5sGsT8sba", "user": {"username": "Vaipan"}}, {"_id": "fyqfYFa72whymCEtu", "postedAt": "2023-10-05T13:38:43.252Z", "postId": "H7BwgJAuhNa7stRfr", "htmlBody": "<p>I think it depends a lot on the organization, but potentially!</p>\n", "parentCommentId": "FTeXoDFwja3Abbggy", "user": {"username": "Jeff_Kaufman"}}, {"_id": "PRZYM8C2gWxnxfwun", "postedAt": "2023-10-05T21:45:22.172Z", "postId": "H7BwgJAuhNa7stRfr", "htmlBody": "<blockquote><p>It seemed to me that the EA community was overinvesting in AI relative to bio</p></blockquote><p>Your sentence was stated in past tense, do you still believe this?</p>", "parentCommentId": "ZmW4t6GqeDBricAmo", "user": {"username": "Linch"}}, {"_id": "K8FyFsvCCwaFcqGgo", "postedAt": "2023-10-05T22:24:58.763Z", "postId": "H7BwgJAuhNa7stRfr", "htmlBody": "<p>Past tense since that's what went into the decision ;)</p>\n<p>I think it is probably still true now, but I haven't been thinking much about it because it hasn't been very decision relevant?</p>\n", "parentCommentId": "PRZYM8C2gWxnxfwun", "user": {"username": "Jeff_Kaufman"}}, {"_id": "az4aczicZFLrABtEw", "postedAt": "2023-10-06T13:52:11.611Z", "postId": "H7BwgJAuhNa7stRfr", "htmlBody": "<p>I just graduated from a computer science degree with a focus on ML and Data science. I have no training or experience in anything biology related. Do you think it would be possible (in principle) to do a similar jump without further formal training (i.e. just learn the biology stuff on the job)? Or do you think that if I don't have your management and project experience this will be quite difficult?&nbsp;</p>", "parentCommentId": null, "user": {"username": "Lucas Florin"}}, {"_id": "jxcAqJwchDWQHv6sf", "postedAt": "2023-10-06T15:07:15.582Z", "postId": "H7BwgJAuhNa7stRfr", "htmlBody": "<p>In my case, as I think is often true, having a lot of experience and training in other areas made up for having less in bio. If the field were more mature, and there were a lot of senior people looking for people to mentor and delegate to I think it would be easier to bring people with less experience on and have them learn on the job (as is common in industry programming).</p>\n", "parentCommentId": "az4aczicZFLrABtEw", "user": {"username": "Jeff_Kaufman"}}, {"_id": "xTBT2uwPPyqfQHqZg", "postedAt": "2023-10-06T18:21:40.835Z", "postId": "H7BwgJAuhNa7stRfr", "htmlBody": "<p>Hi Jeff, thanks for your response. I hold a PhD in Medical Microbiology and am a lecturer in the Department of Microbiology, at Plateau State University, Bokkos, Nigeria. &nbsp;My passion lies in deciphering how this changing climate fosters the emergence of novel and more formidable pathogens, posing a grave risk to human lives. I &nbsp;believe that climate change will make us more vulnerable to pathogens like fungi, however, I am realising that \" natural pandemics\" may not be an existential risk based on Toby Ord's opinion in \"The Precipice\". Do you think funders will be willing to fund research focused on looking at how climate change will lead to the evolution of pathogens leading to \"natural\" pandemics?</p>", "parentCommentId": "v2RyEHhDoGPKmT28u", "user": {"username": "emmannaemeka"}}, {"_id": "ZBKg4gLCcMnvbf3Lw", "postedAt": "2023-10-06T18:40:24.253Z", "postId": "H7BwgJAuhNa7stRfr", "htmlBody": "<p>I think it's pretty common within EA to think that pathogens evolving in the wild are very unlikely to present existential risks. We could be wrong on this, though, and a good first step could be to write up a top-level post here explaining why you see climate change-driven biological risks as potentially existential?</p>\n", "parentCommentId": "xTBT2uwPPyqfQHqZg", "user": {"username": "Jeff_Kaufman"}}, {"_id": "9K74erHRyt8G67pxv", "postedAt": "2023-10-06T20:03:36.401Z", "postId": "H7BwgJAuhNa7stRfr", "htmlBody": "<p>Thanks Jeff for the reply. I had written on climate change and emerging pathogens earlier. Here is the link to a thought I had earlier</p>\n<p><a href=\"https://forum.effectivealtruism.org/posts/wh6sCGu8qYMrAznJL/climate-change-and-emerging-fungal-infections-impacts\">https://forum.effectivealtruism.org/posts/wh6sCGu8qYMrAznJL/climate-change-and-emerging-fungal-infections-impacts</a></p>\n", "parentCommentId": "ZBKg4gLCcMnvbf3Lw", "user": {"username": "emmannaemeka"}}, {"_id": "2iEnAmMDGmpvBqiTq", "postedAt": "2023-10-06T20:23:34.531Z", "postId": "H7BwgJAuhNa7stRfr", "htmlBody": "<p>Thanks for sharing the post!  I don't see an argument in it for how emerging fungal infections could be potentially civilization-ending, though?</p>\n", "parentCommentId": "9K74erHRyt8G67pxv", "user": {"username": "Jeff_Kaufman"}}, {"_id": "xgdhFyppTtrF5MwWE", "postedAt": "2023-10-20T16:29:24.853Z", "postId": "H7BwgJAuhNa7stRfr", "htmlBody": "<p>Thanks for the insight! I'm also considering a mid-career move but not sure if it's the right call or not as my primary path is ETG.&nbsp;</p><p>I'm a product manager who works in corporate tech at the moment. I've found that finding EA-aligned orgs that are looking for PMs is very difficult especially in this market.</p><p>Wondering if there's anywhere or any resources I should be looking at or any tips on how you find your role? I know you're not a PM but typically where's there is programmers, they could be hiring a PM.&nbsp;</p>", "parentCommentId": null, "user": {"username": "warrenjordan"}}, {"_id": "scuEKXaiSS8bNR9gJ", "postedAt": "2023-10-03T12:38:40.702Z", "postId": "H7BwgJAuhNa7stRfr", "htmlBody": null, "parentCommentId": "k9WFkXfRaxweZdPQW", "user": null}]