[{"_id": "zMFoDJGHKXNzmwY9p", "postedAt": "2022-12-21T22:21:23.265Z", "postId": "H7iXfpmdoJHbsWK7A", "htmlBody": "<p>Do you know <a href=\"https://forum.effectivealtruism.org/users/sella\">Sela Nevo</a>, working on Google's <a href=\"https://g.co/floods\">Flood Forecasting Initiative</a>? I wonder if you'd change each other's minds on this</p>", "parentCommentId": null, "user": {"username": "hibukki"}}, {"_id": "rCXGBcSkpBCcgKH3z", "postedAt": "2022-12-22T08:43:52.197Z", "postId": "H7iXfpmdoJHbsWK7A", "htmlBody": "<p>I think you're wrong on policy tractability of some approaches. In some cases, policy for \"appropriate zoning of flood-prone areas (perhaps as parks, recreation facilities),\" and &nbsp;\"compulsory flood insurance for flood-prone areas\" are relatively easy policies, and if there are places where EA has policy influence, these seem like potentially big wins for at least preventing additional exposure to flood risk going forward. (For the second idea, I think the key caveat is to do this for all new construction, rather than taxing current occupants.)<br><br>If people are interested in the topic of policy for reducing flood risk, please reach out. It's been years, but I did a bunch of work on this in NYC at RAND, both<a href=\"https://www.rand.org/pubs/research_reports/RR328.html\"> here</a>, and for the Rockefeller foundation, but unfortunately the latter report was never released. &nbsp;And the applications for developing countries weren't explored, but I think a small part of the work transfers.</p>", "parentCommentId": null, "user": {"username": "Davidmanheim"}}, {"_id": "2fThmtCvAFiZrLcrz", "postedAt": "2022-12-22T08:56:08.589Z", "postId": "H7iXfpmdoJHbsWK7A", "htmlBody": "<p>Thanks, no I had not come across this!  I should say, I'm still excited to see this work and think it is great and very net positive. I just didn't find the quality of evidence and effect sizes I would want to see to make a good case to GiveWell or Charity Entrepreneurship or OpenPhil or anyone that they should really expand into this area.  So in that sense I had a pretty high bar in mind.  I think it is still compatible with my views on the relative promisingness of flooding work that someone particularly well suited to it would be best placed working on it.  (And working at Google seems perfect for this - particularly given I am roughly indifferent to Google having more or less money so do not need to weigh the opportunity cost of their money being spent.)\nSo if you're reading this Sela, good on you, I celebrate your work, feel free to criticise my piece here, I think I stand by my argumentation though should perhaps make clearer the audience I had in mind for this being 'not promising'.</p>\n", "parentCommentId": "zMFoDJGHKXNzmwY9p", "user": {"username": "Oscar Delaney"}}, {"_id": "zhX2mkMYvvptAQdFc", "postedAt": "2022-12-22T09:01:49.943Z", "postId": "H7iXfpmdoJHbsWK7A", "htmlBody": "<p>Hmm yes policy work is tricky - probably even harder to model in a CEA than the more physical interventions I was mainly thinking about.\nI suppose this is what I was gesturing at with \"So plausibly EAs that have significant sway over government decision-makers and can convince them to invest more in flood defences should do this. This would be the case for almost any good policy though: if it is low-effort to convince the government to do it, you should.\"\nBut yes perhaps I did undersell the value of policy here.\nI think I mostly stand by my claim that if you are able to influence policy a lot you should probably focus on other things first. If as you say the policies needed for flooding are unusually tractable then yes that would change things.</p>\n", "parentCommentId": "rCXGBcSkpBCcgKH3z", "user": {"username": "Oscar Delaney"}}, {"_id": "3ireZYcvTRvuiCmPJ", "postedAt": "2022-12-22T09:12:03.584Z", "postId": "H7iXfpmdoJHbsWK7A", "htmlBody": "<p>FYI, I added an edit at the end of the summary reflecting some of the discussion in the comments.</p>\n", "parentCommentId": null, "user": {"username": "Oscar Delaney"}}, {"_id": "tAciGxHjjzusvE6no", "postedAt": "2022-12-22T09:39:16.400Z", "postId": "H7iXfpmdoJHbsWK7A", "htmlBody": "<p>Overall, given the fact (?) that EAs generally believe in seeking out cause X, and are generally averse to publication bias, I'm surprised I don't see more content on the EA Forum that says something like \"X is not a promising cause area\"</p>", "parentCommentId": null, "user": {"username": "Sanjay"}}, {"_id": "HcsHYwxQgYMCjrrqc", "postedAt": "2022-12-22T10:11:05.806Z", "postId": "H7iXfpmdoJHbsWK7A", "htmlBody": "<p>This is a decent note that, by virtue of its \"shallow\" scope of inquiry, leaves out some interesting policy solutions that might be cost-effective. &nbsp;This is especially true for policies involving flood prevention. It has been <a href=\"https://www.natureinfocus.in/environment/why-is-bangalore-suddenly-prone-to-floods#:~:text=Encroachment%20of%20lakes%2C%20tanks%20and%20drains%2C%20poor%20planning%20of%20drainage,the%20city%20to%20urban%20flooding.\">shown</a> that different cities flood at different rates for the same amount of rainfall (recommendations for better studies and links welcome!). In developing countries, flooding is worsened by encroachments, loss of urban lakes, concretization of surfaces, etc. As a consequence, the open space that permits seepage of water into the earth reduces. If more open spaces were present, (a) more water would seep into the ground, reducing volume of flood water, and (b) water would slow down, causing less damage (<a href=\"https://slowwater.world/\">speed of water </a>is associated with flood damages).</p><p>&nbsp;</p><p>Thus, potential EA partners might purchase large tracts of land in flood prone cities, greenify them, and make the surface more amenable to water seepage. This has strict parallels with provision of ecosystem services like planting trees or preserving wetlands. The CEA is relatively easy. Even when urban land is expensive, strategic placement of these tracts can potentially lower damages from flooding. Studies that causally link flooding and concretization of surfaces remain scarce, with natural variations being hard to find. So, it remains an active area of inquiry.</p><p>&nbsp;</p><p>Quick Edit: Potentially more relevant for urban, rain-induced flooding.</p>", "parentCommentId": null, "user": {"username": "Vastav Ratra"}}, {"_id": "iPbqFnDEMuyEFyYtD", "postedAt": "2022-12-22T11:27:39.883Z", "postId": "H7iXfpmdoJHbsWK7A", "htmlBody": "<p>Epistemic status should be 'no pun intended'...</p>", "parentCommentId": null, "user": {"username": "Arepo"}}, {"_id": "6RxMkmEitkfDHc2MY", "postedAt": "2022-12-22T17:23:48.489Z", "postId": "H7iXfpmdoJHbsWK7A", "htmlBody": "<p>Yeah, my only disagreement with you is that I think people who have policy influence should look at tractability and effectiveness across more domains than just ones you've identified as the most effective, since policy windows are fairly unpredictable, and in my experience, over-focusing on \"your\" issues often means you miss opportunities to get very impactful things done, while spinning your wheels on items that aren't currently possible.</p>", "parentCommentId": "zhX2mkMYvvptAQdFc", "user": {"username": "Davidmanheim"}}, {"_id": "EzZrYKCWY7ps7hFXw", "postedAt": "2022-12-24T12:32:58.244Z", "postId": "H7iXfpmdoJHbsWK7A", "htmlBody": "<p>I think floods often result in an increase in snakebites, due to both humans and &nbsp;snakes seeking out the bits of land and houses that are above water. I'm linking <a href=\"https://forum.effectivealtruism.org/posts/WyqGircJgCBG9ivNL/snakebites-kill-100-000-people-every-year-here-s-what-you\">this post</a> about snakebites as a cause area, in case it's helpful.</p>", "parentCommentId": null, "user": {"username": "Matt g"}}, {"_id": "eSfWYirmWrubsRMeH", "postedAt": "2022-12-24T23:36:40.203Z", "postId": "H7iXfpmdoJHbsWK7A", "htmlBody": "<p>Thanks, I hadn't read that post, very interesting! I did read in one of the review papers on flooding that there can be injuries from being confined with animals, but chose not to included it as I didn't see any data on it and my subjective impression was that this would not be as large an impact as the others (but this could be wrong, if anyone finds good info on the flood --&gt; bites causal link I'd be keen to see it).</p>\n", "parentCommentId": "EzZrYKCWY7ps7hFXw", "user": {"username": "Oscar Delaney"}}, {"_id": "EFLHLDzcFLmjQhdHi", "postedAt": "2023-01-18T15:43:29.924Z", "postId": "H7iXfpmdoJHbsWK7A", "htmlBody": "<p>Hey Oscar, I am indeed reading this! (albeit a bit late)</p>\n<p>First, I really appreciate you looking into this and writing this. I'm excited to see people explore more cause areas and give rough estimates of how promising they are.</p>\n<p>There are quite a few details in the cost-effectiveness analysis that I think are inaccurate, and I've mentioned a few at the bottom of the comment in case it is of interest. However, I still think this is a good and valuable shallow investigation. If there weren't discrepancies between the conclusions from 50 hours of investigation and 6 years of work by different people that would be quite surprising (and Google would have wasted quite a lot of money on external analyses, RCTs, etc.).</p>\n<p>Details aside, I broadly agree with what you wrote in this comment. There's a big difference between statements about the promisingness of a field as a whole, vs. claiming that there aren't uniquely impactful opportunities in a field - and I think we have a uniquely impactful opportunity. I think flooding is an incredibly important problem and there are many organizations I would love to see investing more in it, but I would not make the case that this should be a top priority focus area for GiveWell / OpenPhil / CE.</p>\n<p>It’s also worth noting explicitly that even if I had more meaningful disagreements with the conclusions of this investigation I’d still be very appreciative of it. These questions are complex, multiple perspectives are incredibly valuable, and even well-informed intelligent people can disagree.</p>\n<p>Finally, just in case it is of interest and useful, I’ll note the largest drivers of where my estimates diverge from those in the report:</p>\n<ul>\n<li>\n<p>Total impact - the EMDAT is definitely a candidate for the most comprehensive source of recorded flood (and other natural disaster) deaths, but it’s not a great source for an estimate of total deaths. This is partially due to undercounting of deaths (and other estimates that use EMDAT alongside other sources find higher numbers<sup class=\"footnote-ref\"><a href=\"#fn-gjggiowRwksEaWAyG-1\" id=\"fnref-gjggiowRwksEaWAyG-1\">[1]</a></sup>&lt;sup&gt;&lt;strong&gt;,&lt;/strong&gt;&lt;/sup&gt;<sup class=\"footnote-ref\"><a href=\"#fn-gjggiowRwksEaWAyG-2\" id=\"fnref-gjggiowRwksEaWAyG-2\">[2]</a></sup>), but more significantly due to these types of counts only counting immediate deaths (due to reasons such as trauma) and not due to longer term health effects<sup class=\"footnote-ref\"><a href=\"#fn-gjggiowRwksEaWAyG-3\" id=\"fnref-gjggiowRwksEaWAyG-3\">[3]</a></sup>. Tracking the relationship between floods and all-cause mortality (or other health indicators)<sup class=\"footnote-ref\"><a href=\"#fn-gjggiowRwksEaWAyG-4\" id=\"fnref-gjggiowRwksEaWAyG-4\">[4]</a></sup> leads to vastly larger numbers. Both these methodologies are probably far from the true numbers, but in opposite directions. The World Bank report you linked to thinks warning systems can <em>save</em> 23,000 lives per year, and though this may be an overestimate of the number of lives that would be saved by that plan, I think it might indeed be a reasonable lower bound on the number of lives lost annually in total. My current best estimate of fatalities is about an order of magnitude higher than yours.</p>\n</li>\n<li>\n<p>Comparison between top intervention to all harms vs. all investment - we both already commented on how unique opportunities might be more promising than the field as a whole. I want to make a related but broader point here, because I’m worried the methodology here will systematically bias us in favor of existing cause areas over new ones. At least in parts, your analysis asks how much funding it would take to address all flood harms globally. You then compare your estimate of the cost-effectiveness of that to GiveDirectly, one of the top interventions globally, which invests immensely in targeting<sup class=\"footnote-ref\"><a href=\"#fn-gjggiowRwksEaWAyG-5\" id=\"fnref-gjggiowRwksEaWAyG-5\">[5]</a></sup> to maximize its cost-effectiveness. Due to diminishing returns, almost any domain you’d look into would be very cost-ineffective to try and completely solve the problem globally (for example, trying to solve all poverty via cash transfers would also be far less cost-effective than GiveDirectly’s current margin). Specifically in floods this can lead to a difference in orders of magnitude. While on average the cost-benefit ratio of early warning systems has been estimated as 1:9<sup class=\"footnote-ref\"><a href=\"#fn-gjggiowRwksEaWAyG-6\" id=\"fnref-gjggiowRwksEaWAyG-6\">[6]</a></sup>, but in highly-affected low income countries the cost-benefit ratio can rise to the hundreds<sup class=\"footnote-ref\"><a href=\"#fn-gjggiowRwksEaWAyG-7\" id=\"fnref-gjggiowRwksEaWAyG-7\">[7]</a></sup>. Also, I won’t name names, but most $100M+ programs in this space that I’ve seen were never actually completed or used - so the average cost-effectiveness numbers in this space are very far from the effectiveness of a well-functioning organization doing good work. Concretely, I think that your statements might be more than an order of magnitude off if we’re considering investing in promising projects to mitigate flood harms (focusing on severely affected low and middle income countries, early warning, and organizations/solutions with a strong track record).</p>\n</li>\n<li>\n<p><em>Note: my views are disproportionately influenced by work on early warning systems, which are only a part of the work you’ve aimed to review, and you noted  towards monitoring, forecasting, and alerting, which are the areas I’ve been most involved in, while your report touched on other areas in flood management as well.</em></p>\n</li>\n</ul>\n<p>Finally, you might also be interested in a <a href=\"https://drive.google.com/file/d/10v1MJ9BCo_3pBtyStXtuRrAHur3PzIbb/view\">report from 2016 by CEA</a>, which also includes a review of the cost-effectiveness of flood management. I think it misses different nuances but again provides another interesting perspective.</p>\n<p>I have A LOT more things to say about the empirical statements, framework for evaluation, and assumptions that went into this - happy to chat if you’re interested.</p>\n<hr class=\"footnotes-sep\">\n<section class=\"footnotes\">\n<ol class=\"footnotes-list\">\n<li id=\"fn-gjggiowRwksEaWAyG-1\" class=\"footnote-item\"><p><a href=\"http://hydro.ou.edu/files/publications/2010/A%20digitized%20global%20flood%20inventory%201998-2008%20compilation%20and%20preliminary%20results.pdf\">A digitized global flood inventory (1998–2008): compilation and preliminary results</a> <a href=\"#fnref-gjggiowRwksEaWAyG-1\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"fn-gjggiowRwksEaWAyG-2\" class=\"footnote-item\"><p><a href=\"http://currents.plos.org/disasters/article/the-human-impact-of-floods-a-historical-review-of-events-1980-2009-and-systematic-literature-review/\">The Human Impact of Floods: a Historical Review of Events 1980-2009 and Systematic Literature Review</a> <a href=\"#fnref-gjggiowRwksEaWAyG-2\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"fn-gjggiowRwksEaWAyG-3\" class=\"footnote-item\"><p><a href=\"https://academic.oup.com/cid/article/67/9/1450/4945455\">Health Risks of Flood Disasters</a> <a href=\"#fnref-gjggiowRwksEaWAyG-3\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"fn-gjggiowRwksEaWAyG-4\" class=\"footnote-item\"><p><a href=\"https://www.researchgate.net/profile/Peter-Streatfield/publication/51797904_Health_Effects_of_Flooding_in_Rural_Bangladesh/links/5a4204570f7e9ba868a27b4e/Health-Effects-of-Flooding-in-Rural-Bangladesh.pdf\">Health Effects of Flooding in Rural Bangladesh</a> <a href=\"#fnref-gjggiowRwksEaWAyG-4\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"fn-gjggiowRwksEaWAyG-5\" class=\"footnote-item\"><p><a href=\"https://www.givedirectly.org/study-ai-targeting-togo/\">Study: AI targeting helped reach more of the poorest people in Togo</a> <a href=\"#fnref-gjggiowRwksEaWAyG-5\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"fn-gjggiowRwksEaWAyG-6\" class=\"footnote-item\"><p><a href=\"https://files.wri.org/s3fs-public/uploads/GlobalCommission_Report_FINAL.pdf\">Global Commission on Adaptation's Adapt Now report</a> <a href=\"#fnref-gjggiowRwksEaWAyG-6\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"fn-gjggiowRwksEaWAyG-7\" class=\"footnote-item\"><p><a href=\"https://web.archive.org/web/20220709123025/http://ral.ucar.edu/~hopson/Verkade/Economics/Subbiah_EWS.pdf\">Background Paper on Assessment of the Economics of Early Warning Systems for Disaster Risk Reduction</a> <a href=\"#fnref-gjggiowRwksEaWAyG-7\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n</ol>\n</section>\n", "parentCommentId": "2fThmtCvAFiZrLcrz", "user": {"username": "sella"}}, {"_id": "fHcFiWowhoofjRTvG", "postedAt": "2023-01-26T06:27:14.872Z", "postId": "H7iXfpmdoJHbsWK7A", "htmlBody": "<p>Hi Sela, thanks for the long and thoughtful comment, and for your kind words. That is reassuring that you also do not feel this is a key area for GiveWell/OP to expand into.</p><p>Really interesting re EMDAT possibly being off by ~10x, I was aware that longer-term harms are a lot harder to measure but wasn't expecting the effect to be that large.</p><p>Re my references to ending all flooding harms, that makes sense; I wasn't trying to suggest that the average cost-effectiveness would be the same as marginal cost-effectiveness. Perhaps a better thing to say would be that in order to be competitive with top charities, marginal targeted interventions would need to be far better than the average of existing interventions.</p><p>Hmm yes I was a bit surprised at how expensive EWS were made out to be, particularly when I would have thought a lot of costs could be saved by rolling out the same model and infrastructure across different countries.</p><p>Thanks for the offer, I am not currently working on this and don't expect to go back to it, so I don't think there would be much value in talking further - I'll let you know if I am coming back to this though. I hope you make great progress on your flood forecasting work!</p>", "parentCommentId": "EFLHLDzcFLmjQhdHi", "user": {"username": "Oscar Delaney"}}, {"_id": "3cCY43itSvnXBhcJe", "postedAt": "2022-12-22T11:27:23.579Z", "postId": "H7iXfpmdoJHbsWK7A", "htmlBody": null, "parentCommentId": null, "user": null}]