[{"_id": "GE7Y4zCK9rFisq5Mz", "postedAt": "2023-12-03T16:38:13.469Z", "postId": "H7rjCEmhcWscZsEnE", "htmlBody": "<p>Love this and excited to see more of it. (3) is the biggest surprise for me and I think I’m more positive on education now.</p>\n<p>Interested to hear your thoughts on growth diagnostics if you ever get around to it</p>\n", "parentCommentId": null, "user": {"username": "geoffreyyip"}}, {"_id": "eyccesdCcsWjGwwsh", "postedAt": "2023-12-04T08:31:15.286Z", "postId": "H7rjCEmhcWscZsEnE", "htmlBody": "<p>I appreciate that you give evidence for how economic growth seems to be a requirement for increases in well being and I think I agree. If I might make one request if you are intending to write more posts on this topic: Could you please include a colonial &nbsp;and even more of a \"temporal\" angle to growth and well-being? You do go into some detail around skipping the manufacturing \"step\" and going directly to services. However, my lay understanding of the topic is that it somehow seemed much easier for the \"colonizing\" nations to move beyond agriculture and achieve both growth and increases in well-being than it today does for LMICs. Currently, it seems like an uphill struggle for previous colonies to do the same. Is there some sort of temporal thing going on here where the \"colonizing\" nations had some sort of first-mover advantage? Perhaps I missed something by only reading quickly through your article - perhaps most of you analysis only focuses on what we know about growth in previous colonies, after colonization ended, for example.&nbsp;<br><br>One reason for commenting is that I recently read a book both on the famines in India under British rule as well as another book on China under Mao. In both instances, it seems economic structural reform was pushed forcefully and urgently from the top which as we know lead to two of the greatest disasters in history. Thus, I would, without deep knowledge of the topic, be very careful advocating strongly for general economic reforms across many countries as we could end up having a net negative outcome, just based on historical priors. I would, as a lay economist and historian, feel more confident about a portfolio of interventions that have been crafted to fit with the local context and strategic environment a country currently finds itself in.</p>", "parentCommentId": null, "user": {"username": "Ulrik Horn"}}, {"_id": "KfDb9JwnyYfAk3Buk", "postedAt": "2023-12-04T10:56:45.609Z", "postId": "H7rjCEmhcWscZsEnE", "htmlBody": "<p>I'm not super interested in stories of growth that put a large emphasis on history, not because I think they're wrong, but because they don't offer a lot of practical advice for today. There are a thousand and one papers showing that colonial legacies affect development today, but I don't see how they help think about increasing growth today. Certainly, I wouldn't completely generalize from the growth experience of the West, and almost all of the research I cover is about current LMICs or about late industrializers in East Asia.</p>\n<p>I agree that advocating strongly for general economic reforms - call it the Lant Pritchett view - is not a useful path. The Pritchett view seems like the only one that EAs know about, which is a big part of my motivation for writing this. Rather than big claims about \"growth\" as a singular phenomenon, I want to break it down into more granular factors.</p>\n<p>Edit: in response to your direct question about whether there's a first mover advantage, the story is mixed. There's a lot of evidence that colonial legacies hold countries back today, especially in Africa. On the other hand there's strong reasons to believe that new technologies are the drivers of growth, and poor countries today have the advantage that they don't need to reinvent all modern technology - they have all the advantages of frontier knowledge. The net effect of this is so vague as to be unanswerable.</p>\n<p>As a concrete example, think about London's campaign to end cholera in the 19th century. Compared to countries with cholera problems today, those people <em>didn't even know what caused disease.</em> There were all kinds of crazy views about the causes of disease that made eradicating cholera a difficult task. On the other hand, Britain had a pretty effective state that could enforce public health regulations, and a good scientific establishment that could study the problem. Poor countries today have 1000x more knowledge than rich countries did a century ago, but have all kinds of problems with turning that knowledge into prosperity.</p>\n", "parentCommentId": "eyccesdCcsWjGwwsh", "user": {"username": "therealslimkt"}}, {"_id": "dk49oKHbx4A8s56oe", "postedAt": "2023-12-04T10:59:02.216Z", "postId": "H7rjCEmhcWscZsEnE", "htmlBody": "<p>I don't know enough about growth diagnostics to give any authoritative take. it seems like a pretty useful way to structure thinking/field observations, but with sweeping/high-level conclusions that don't feel quite so useful.</p>\n", "parentCommentId": "GE7Y4zCK9rFisq5Mz", "user": {"username": "therealslimkt"}}, {"_id": "AoKg7XK4YL8bq9dY2", "postedAt": "2023-12-04T12:20:18.273Z", "postId": "H7rjCEmhcWscZsEnE", "htmlBody": "<p>Thanks for your super thoughtful response Karthik. It seems you are aware (perhaps not unsurprisingly!) of the issues I raised and I appreciate your clarification on the \"Lant Pritchett view\". I also like your optimism in not focusing on historical wrongs, but rather trying to see what advantages LMICs can leverage. I look forward to your future posts and to learning more about a perhaps more nuanced and effective take on growth as a cause area.</p>", "parentCommentId": "KfDb9JwnyYfAk3Buk", "user": {"username": "Ulrik Horn"}}, {"_id": "M4Fuo5rnSgbazrFk5", "postedAt": "2023-12-04T14:02:09.499Z", "postId": "H7rjCEmhcWscZsEnE", "htmlBody": "<p><strong>Executive summary: </strong>Sectoral transformation, the process of workers moving from agriculture to manufacturing and services, is critical for economic growth in developing countries. Research reveals key drivers like agricultural productivity, education, and barriers to mobility.</p><p><strong>Key points:</strong></p><ol><li>Agricultural productivity growth can promote sectoral transformation by reducing labor demand and if the country has limited trade. But it can also incentivize staying in agriculture.</li><li>Education expansions lead people to leave agriculture for other sectors, accounting for 20% of historical transformation. But there are negative spillovers on those left behind.</li><li>Barriers to mobility across sectors are smaller than believed. Wage gains suggest workers select sectors based on skills.</li><li>Now most transformation is into services, not manufacturing. This may reduce growth prospects unless trade, scale, and skills in services can improve.</li><li>Overall, drivers that improve agricultural productivity, education, and skills are critical for continued transformation. But global trends pose challenges for traditional manufacturing-led growth.</li></ol><p>&nbsp;</p><p><i>This comment was auto-generated by the EA Forum Team. Feel free to point out issues with this summary by replying to the comment, and</i><a href=\"https://forum.effectivealtruism.org/contact\"><i>&nbsp;<u>contact us</u></i></a><i> if you have feedback.</i></p>", "parentCommentId": null, "user": {"username": "SummaryBot"}}, {"_id": "bLvDCbjhD8c9fgvsD", "postedAt": "2023-12-04T16:54:08.498Z", "postId": "H7rjCEmhcWscZsEnE", "htmlBody": "<p>You never appreciate how scarily accurate SummaryBot is until it summarizes you...</p>\n<p>Good bot!</p>\n", "parentCommentId": "M4Fuo5rnSgbazrFk5", "user": {"username": "therealslimkt"}}, {"_id": "EFkiFMavhe4ysHTMF", "postedAt": "2023-12-05T15:08:43.733Z", "postId": "H7rjCEmhcWscZsEnE", "htmlBody": "<p>Great post, thanks for taking the time to put this together.&nbsp;</p><p>One thing I would add on to your argument in Section 4 is the work of Gollin, Jedwab, and Vollrath (<a href=\"https://www.theigc.org/blogs/urbanisation-and-without-industrialisation\">blog</a>, <a href=\"https://link.springer.com/article/10.1007/s10887-015-9121-4\">paper</a>) on \"urbanization without industrialization.\" What they document is that there are essentially two types of urbanization -- resource-led and industrialization-led. In the former, you see a higher share of the population going into low value-added services, what they call \"consumption cities\". This is especially true in much of Sub-Saharan Africa, with the result being rapidly growing cities without the historically observed rise in living standards or productivity. There's also a related story here with <a href=\"https://www.cgdev.org/publication/can-africa-be-manufacturing-destination-labor-costs-comparative-perspective\">work</a> by Gelb, Meyer, Ramachandran, and Wadhwa on African labor costs and manufacturing, which argues that there's been limited manufacturing in the continent, outside of Ethiopia, in part because labor costs are already too high to compete with SE Asia and elsewhere.&nbsp;</p><p>You mention India and China -- I think comparing the two provides about as close as you can get to a natural experiment comparing manufacturing-led growth and services-led growth. Starting from a similar baseline in 1990 (which itself is instructive in just how bad the License Raj was given the Great Leap Forward and Cultural Revolution, but that's a separate point), the divergence in GDP per capita is stunning. Bangladesh overtaking India and Pakistan over the past decade is also I think an instructive case in the value of an effective manufacturing-led growth strategy.&nbsp;</p>", "parentCommentId": null, "user": {"username": "jeffrey-mason"}}, {"_id": "jLcTAApPckYf66onb", "postedAt": "2023-12-05T17:59:36.141Z", "postId": "H7rjCEmhcWscZsEnE", "htmlBody": "<p>Interesting stuff, thanks for adding. I never know what to do with natural resources in the economic development story, so I usually just leave them out, but of course they can have negative effects like this. And yes, labor costs are important.</p>\n", "parentCommentId": "EFkiFMavhe4ysHTMF", "user": {"username": "therealslimkt"}}, {"_id": "8jeqehpFyXuLzq6pr", "postedAt": "2023-12-06T15:12:32.821Z", "postId": "H7rjCEmhcWscZsEnE", "htmlBody": "<p>Yeah, I think trying to account for the dynamic effects of a significant natural resource endowment is not always easy, and neither is successfully making the transition from exporting unprocessed resources to doing more processing and other activities further up the value chain domestically.&nbsp;</p><p>That being said, I do think the China-West decoupling is an opportunity for some countries to start making that transition, especially places rich in critical minerals. And the same can be said with regard to the nearshoring/friendlyshoring trend in manufacturing.&nbsp;</p>", "parentCommentId": "jLcTAApPckYf66onb", "user": {"username": "jeffrey-mason"}}, {"_id": "z3jCQXht7H4B6Kmch", "postedAt": "2023-12-06T19:19:31.440Z", "postId": "H7rjCEmhcWscZsEnE", "htmlBody": "<blockquote><p><strong>The way I hope for you to read this series is with an entrepreneurial eye&nbsp;</strong></p></blockquote><p>&nbsp;</p><p>I appreciate this specific call to action, so I'll kick us off. &nbsp;How will AI advances affect sectoral transformations moving people into the service sector? &nbsp;It will depend on where AI is a complement vs replacement for labor. &nbsp;In the complement case, high-quality instantaneous translations could dramatically expand the export market for services by eliminating English fluency as a barrier. &nbsp;In the replacement case, AI agents trained to write code could replace many routine contract software jobs.</p><p>Is there literature on skill gaps in LMI countries that is more granular than proxy metrics like years of schooling? &nbsp;That could be a good place to start to look for where AI complements could open up opportunities.&nbsp;</p>", "parentCommentId": null, "user": {"username": "colin"}}, {"_id": "wFn4eRJ4bosdCaWNK", "postedAt": "2023-12-06T19:30:04.458Z", "postId": "H7rjCEmhcWscZsEnE", "htmlBody": "<blockquote><p>However, agricultural productivity growth also increases the income people can earn in agriculture relative to in other sectors, so it could also incentivize people to <i>stay</i> in agriculture. That is the opposite of what we want!</p></blockquote><p>Higher incomes is the goal so why is it a problem if that comes from staying in agriculture? &nbsp;Is the idea that this tops out at a lower level than manufacturing or service-focused economies? &nbsp;Aren't there some developed countries, like New Zealand, where agriculture makes up more than half of their exports?</p>", "parentCommentId": null, "user": {"username": "colin"}}, {"_id": "DcENGy39hqPH8dXpF", "postedAt": "2023-12-06T20:18:33.992Z", "postId": "H7rjCEmhcWscZsEnE", "htmlBody": "<blockquote>\n<p>Is the idea that this tops out at a lower level than manufacturing or service-focused economies?</p>\n</blockquote>\n<p>Yes, this is the idea - evidence mainly being that</p>\n<p>a) no country has ever gotten rich while staying agrarian. New Zealand may export a lot of agriculture but only 6% of their population works in it.\nb) across countries, agricultural wages are consistently lower than non agricultural wages.</p>\n", "parentCommentId": "wFn4eRJ4bosdCaWNK", "user": {"username": "therealslimkt"}}, {"_id": "cnafdWwwaXjSuowcv", "postedAt": "2023-12-08T15:57:22.347Z", "postId": "H7rjCEmhcWscZsEnE", "htmlBody": "<p>I’m curating this post. Karthik Tadepalli makes the point that EAs have often accepted the argument, <a href=\"https://forum.effectivealtruism.org/posts/bsE5t6qhGC65fEpzN/growth-and-the-case-against-randomista-development\">given here</a>, that the most cost effective global health interventions are likely to be aimed at increasing growth in LMICs rather than directly targeted at health outcomes. However, there hasn’t yet been a focus on producing growth interventions within EA global health work that is proportional to this interest. In a careful, well evidenced manner, this post outlines some factors which affect economic growth in LMICs, and which may be amenable to interventions.<br><br>You can read more about the discussion of boosting economic growth as a potentially tractable cause in Global Health and Wellbeing on <a href=\"https://forum.effectivealtruism.org/topics/economic-growth\">this topics tag</a>, and in this <a href=\"https://80000hours.org/podcast/episodes/elie-hassenfeld-givewell-critiques-and-lessons/#whether-economic-policy-is-what-really-matters-overwhelmingly-022000\">recent 80k podcast episode</a> with GiveWell’s co-founder Elie Hassenfeld.&nbsp;<br><br>I hope, with Karthik, that this post and the series to follow is read with “an entrepreneurial eye”, and reignites debate in this pressing question.&nbsp;</p>", "parentCommentId": null, "user": {"username": "tobytrem"}}, {"_id": "aHdSN8tSHERpsAiAq", "postedAt": "2023-12-08T19:00:50.679Z", "postId": "H7rjCEmhcWscZsEnE", "htmlBody": "<p>Thanks for sharing this, I found it very interesting.</p><p>I was curious about the sectoral transformation. Presumably we will always need some people working in agriculture. A lot of this specialisation has occurred between rural and urban areas, but might it not also make sense for some entire countries to focus on agriculture? They could focus their education systems, regulations and so on the industry, which might improve efficiency, rather than having smaller numbers of people in more countries doing agriculture. If this is the case then we could see some countries getting rich entirely off agriculture - just like there are wealthy farmers in the US, Australia, etc. If so pushing for sectoral transformation could be a mistake if some countries really have a comparative advantage in agriculture.</p><p>This also connects to your points about agricultural productivity. My impression was that many third world countries have chronic under-utilisation of labour; you literally just have a lot of working age men hanging around doing nothing all day. This is labour slack is implicit in the model for why GiveDirectly might boost economic activity that they <a href=\"https://forum.effectivealtruism.org/posts/KAzSt4w57yHmdvFwS/169-on-whether-cash-transfers-cause-economic-growth-and\">described on the 80k podcast</a>. If so, productivity growth that incentivized people to stay in agriculture could be good, especially if it replaced unemployment, even though it would retard the sectoral transformation.</p><p>Finally, I was interested in the negative effects of the services transition. Could this be because poor regulatory setup means many of the 'service' jobs are essentially rent-seeking rather than providing socially valuable services? e.g. an increase in lawyers or bureaucrats primarily creating more work for other people.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Larks"}}, {"_id": "LFNxhhoji8gLK8N9s", "postedAt": "2023-12-08T22:29:53.488Z", "postId": "H7rjCEmhcWscZsEnE", "htmlBody": "<p>I guess the fact that no country in history has gotten rich while being agrarian gives me a very strong prior against it. And there are clear reasons why; agricultural goods are commodities that are extremely cheap, so even having an advantage in them, you can only have a slim advantage. Plus different countries will always have different comparative advantages in different crops. Compare that to manufacturing where you can make increasingly specialized and high-quality goods that generate much more profits.</p>\n<p>My impression is that underutilization of labor is even more severe of a problem in agriculture than in non-agriculture. This is why in most developing countries, output <em>per worker</em> is higher in manufacturing than in agriculture. You would likely not observe that if surplus labor was unique to manufacturing, and indeed the surplus labor hypothesis was first proposed to explain why agriculture is so unproductive. (Edit: I think I misunderstood this point from you. Yes, productivity growth that increases the demand for labor could put some of that surplus labor to good use, and that can be good. However, if the surplus workers would have counterfactually moved into non-agriculture where they would have been more productive, then it's still a negative outcome.)</p>\n<p>No, that's not why services have a negative effect. Theres no assumption that services are not valuable, just that productivity growth (as measured by revenue per worker growth) is much slower. This is mostly because services are nontradable, so you can't have specialization/competition between producers in different regions. But I have a footnote pointing out why we should be careful in claiming that shifting to services has a negative effect. After all, every rich country today is primarily a service economy, and most of what we consume is services.</p>\n", "parentCommentId": "aHdSN8tSHERpsAiAq", "user": {"username": "therealslimkt"}}, {"_id": "YDePi34K8MnEwwrcZ", "postedAt": "2023-12-08T22:36:14.953Z", "postId": "H7rjCEmhcWscZsEnE", "htmlBody": "<p>My guess is that AI adoption in developing countries will substantially lag adoption in rich countries. Firstly because this is true of most technologies, and secondly because AI adoption will be faster in places where labor costs are higher - ie rich countries with higher wages. This is why when US companies gained FDI access to China, they became less likely to use automation technologies. (<a href=\"https://papers.ssrn.com/sol3/papers.cfm?abstract_id=2613248\">Source</a>) Even when it is adopted, within-country adoption lags will probably be substantial, and services are nontradable, so even if AI services are widely used in one city, they can't exactly be exported from there. So my guess is that AI will not have a first order impact on the service sector in developing countries.</p>\n", "parentCommentId": "z3jCQXht7H4B6Kmch", "user": {"username": "therealslimkt"}}, {"_id": "pQMaHdR8SAXmvZD8q", "postedAt": "2023-12-09T03:00:12.290Z", "postId": "H7rjCEmhcWscZsEnE", "htmlBody": "<p>Thanks for the response!</p><blockquote><p>I guess the fact that no country in history has gotten rich while being agrarian gives me a very strong prior against it. And there are clear reasons why; agricultural goods are commodities that are extremely cheap, so even having an advantage in them, you can only have a slim advantage.&nbsp;</p></blockquote><p>My impression is that Argentina became a very rich country, by the standards of today, largely as <a href=\"https://en.wikipedia.org/wiki/Economic_history_of_Argentina#Export-led_boom\">an agricultural exporter</a>? And just because a product is cheap doesn't mean you can't have a big advantage in them if it is a very scaled business; according to <a href=\"https://ourworldindata.org/grapher/agriculture-value-added-per-worker-wdi\">OWID</a>, US agricultural productivity is over 100x higher than in Liberia in dollar term; I don't have the bushels/farmer figures to hand but I suspect there are also orders of magnitude difference.</p><blockquote><p>Theres no assumption that services are not valuable, just that productivity growth (as measured by revenue per worker growth) is much slower.</p></blockquote><p>I'm not assuming it, I'm offering it as an explanation. The 'nontradable' explanation doesn't really make sense to me, because it doesn't explain why people would choose to work in a less productive sector (agriculture or services), where wages are presumably lower, instead of manufacturing. Unless you think that manufacturing has to be combined with labour suppression, where wages will be held lower than productivity, in order to facilitate more investment? I do get the impression that is part of the story behind east asian growth, and it does make sense it would be easier in manufacturing than services.&nbsp;</p>", "parentCommentId": "LFNxhhoji8gLK8N9s", "user": {"username": "Larks"}}, {"_id": "hxDRWfLyvEwcHmiov", "postedAt": "2023-12-09T09:55:38.053Z", "postId": "H7rjCEmhcWscZsEnE", "htmlBody": "<p>Thanks for writing this up, excited for the next!</p>\n<p>One major bottleneck to adoption of software &amp; service industries is that the infrastructure doesn't exist - more than 50% of people don't have access to the bandwidth that makes our lives on the internet possible. <a href=\"https://www.brookings.edu/articles/fixing-the-global-digital-divide-and-digital-access-gap/\">https://www.brookings.edu/articles/fixing-the-global-digital-divide-and-digital-access-gap/</a> (That's also not solved by Starlink because it's too expensive.)</p>\n<p>For export of services to benefit the workers, you'd need local governance infrastructure that effectively maintains public goods, which also currently doesn't exist for most people.</p>\n<p>As you hint at, access to the digital economy helps more developed areas at best, the worst off don't benefit. The poverty trap many are in is unfortunately harder to crack, and requires substantial upfront investment, not trickle down approaches. But most countries cannot get loans for such efforts and companies have little incentive to advance/maintain such large public goods.</p>\n<p>I haven't thought about this enough and would appreciate reading reactions to the following:\nFor lasting poverty alleviation, I'd guess it's better to focus on scalable education, governance and infrastructure initiatives, powered by locals to enable integration into the culture. Does it seem correct that the development of self-determination creates positive feedback loops that also aid cooperation?</p>\n<p>Also, this can all be aided by AI, but focusing on AI, as some suggest in the comments, seems unlikely to succeed at solving economic &amp; governance development in the poorest areas. Would you agree that AI deployment can't obviously reduce the drivers of coordination failures at higher levels of governance, as those are questions of inter-human trust?</p>\n", "parentCommentId": null, "user": {"username": "konrad"}}, {"_id": "NYGTqk3AyQDYe7k8D", "postedAt": "2023-12-11T12:51:52.307Z", "postId": "H7rjCEmhcWscZsEnE", "htmlBody": "<p>This low growth urbanisation is heartbreaking to see first hand. Here in gulu city, Northern Uganda crime is skyrocketing as young men flood into the city without job or educational opportunities</p>\n<p>Don't have much productive to offer, but this is a fantastic article Karthik she a great comment Jeffery!</p>\n", "parentCommentId": "EFkiFMavhe4ysHTMF", "user": {"username": "NickLaing"}}, {"_id": "LvXDWidSjdqpZ6Xne", "postedAt": "2023-12-11T13:08:29.016Z", "postId": "H7rjCEmhcWscZsEnE", "htmlBody": "<p>Great discussion</p>\n<p>You could argue that Argentina, and even my home country of new Zealand have kind of \"made it\" through agriculture.</p>\n<p>My issue is, even assuming you are right Larks and African countries somehow manage become far more productive at farming and become more competitive on the global stage, thats unlikely to solve the jobs problem. Increased productivity means industrialized farming, means less farming jobs not more. Especially in countries like Uganda with high population and low land area, it's hard to see how this could solve the jobs problem, although obviously it would probably be net positive and help the economy.</p>\n<p>New Zealand and Argentina also have huge land area to population ratios, which enables large scale farming to have a bigger impact.</p>\n<p>As a side note the absolute nail in the coffin for any opportunity for African countries to become serious food exporters are the insane farming subsidies and tariffs both in the EU and the US, which wipe out one of the only sectors African countries have a chance to be competitive in. Noone talks about it much, but it's not impossible these subsidies and tariffs might cause more net suffering than all the aid these countries reduce IDK.</p>\n", "parentCommentId": "pQMaHdR8SAXmvZD8q", "user": {"username": "NickLaing"}}, {"_id": "M5aTaTQdbrFC9F67w", "postedAt": "2023-12-11T13:18:30.375Z", "postId": "H7rjCEmhcWscZsEnE", "htmlBody": "<p>Although I agree with all your substantive points here Karthik, I don't think the agriculture sector as a whole is \"poorer\" than the rest of the country. Sure wage workers aren't paid that much, but Kiwi farners are often mega rich sure to their insane and ever growing land/infrastructure/livestock asset base. Most new Zealand farmers would have net worth well into the millions, wages only tell part of the story.</p>\n", "parentCommentId": "DcENGy39hqPH8dXpF", "user": {"username": "NickLaing"}}, {"_id": "HAWDv6FkdvCRNgvaA", "postedAt": "2023-12-11T13:41:12.766Z", "postId": "H7rjCEmhcWscZsEnE", "htmlBody": "<p>I wasn't aware of Argentina as an example and spent some time looking into it. My takeaway is that it's interesting and I don't have a great story about it, other than that at the time, agriculture was <a href=\"https://cepr.org/voxeu/columns/world-trade-historical-database\">most of all trade</a>, and most of all consumption globally, whereas today with a much richer and industrialized world, demand for food is not large enough to make it competitive with manufacturing as a path. But that's tentative.</p>\n<blockquote>\n<p>just because a product is cheap doesn't mean you can't have a big advantage in them if it is a very scaled business; according to OWID, US agricultural productivity is over 100x higher than in Liberia in dollar terms</p>\n</blockquote>\n<p>This is largely <em>because</em> the US uses so much more capital and so much less labor than developing countries, so I don't interpret this in support of the idea that developing countries can get rich without most labor leaving agriculture.</p>\n<blockquote>\n<p>it doesn't explain why people would choose to work in a less productive sector (agriculture or services), where wages are presumably lower, instead of manufacturing.</p>\n</blockquote>\n<p>That's the puzzle I was talking about in point #3. The likely explanation is that people select into the less productive sector because they don't have the skills to work in manufacturing, for reasons elaborated more in that section.</p>\n", "parentCommentId": "pQMaHdR8SAXmvZD8q", "user": {"username": "therealslimkt"}}, {"_id": "eRDhadGNXTb52iq43", "postedAt": "2023-12-11T13:44:15.928Z", "postId": "H7rjCEmhcWscZsEnE", "htmlBody": "<p>I should have specified that I meant across developing countries. It's possible that wages and output figures underestimate prosperity in the sector due to assets, but the vast majority of farms in developing countries are very small, so I doubt that changes the takeaway.</p>\n", "parentCommentId": "M5aTaTQdbrFC9F67w", "user": {"username": "therealslimkt"}}, {"_id": "8ckaJXALGaguqLDce", "postedAt": "2023-12-11T13:45:59.132Z", "postId": "H7rjCEmhcWscZsEnE", "htmlBody": "<p>That's sobering, I'm glad to hear the human side of it.</p>\n", "parentCommentId": "NYGTqk3AyQDYe7k8D", "user": {"username": "therealslimkt"}}, {"_id": "2AF6iAaLi2Rt7HuZm", "postedAt": "2023-12-11T13:50:01.200Z", "postId": "H7rjCEmhcWscZsEnE", "htmlBody": "<p>Oh yeah I thought you were including places like new Zealand too based on the previous comment.</p>\n", "parentCommentId": "eRDhadGNXTb52iq43", "user": {"username": "NickLaing"}}, {"_id": "KBitu2Dhk6YJjQztn", "postedAt": "2023-12-13T02:51:06.214Z", "postId": "H7rjCEmhcWscZsEnE", "htmlBody": "<p>Another note on the struggle to industrialise in Africa is <a href=\"https://www.nber.org/papers/w31740\">this paper</a> (2023) - suggesting that manufacturing firms fail to scale due to lack of labour specialisation which appears to be driven by demand for more personalised goods. In other words, the goods demanded hinder economies of scale and talent leveraging. I haven't read the whole paper and I'm not sure why Africa (Uganda was the country studied) in particular is different, but it seems interesting. &nbsp;</p>", "parentCommentId": "EFkiFMavhe4ysHTMF", "user": {"username": "Kyler Blackburn"}}, {"_id": "HnKbgYsNjQp8nvsnj", "postedAt": "2023-12-13T13:10:40.661Z", "postId": "H7rjCEmhcWscZsEnE", "htmlBody": "<p>This is a whole topic in the next post! I think the authors' interpretation is probably wrong. There's no clear reason why demand for more personalized goods would be different in Uganda, you're right - my suspicion is that the root cause is the small size of the output market. The authors document that each firm sells to a very small output market, and one possible consequence of that is that firms don't see any benefit to task specialization, because the benefits of specialization increase with the scale of goods you are selling. If you can only sell to a small number of people, then selling them personalized goods could be a way to get the maximum revenue out of this small market. Thus, firms would choose not to specialize even if there were no barriers to specialization.</p>\n<p>The main evidence they provide for why personalized demand is the cause is that specialization is larger in grain milling, where grain is a homogeneous product. But grain is also more easily traded, so the output market is larger, which means their evidence is totally consistent with small output markets as the cause of low specialization and firm growth.</p>\n<p>Small output markets are a problem everywhere but especially in Africa because transportation costs are higher than in other developing countries (this is something I've heard dev economists say casually a lot, but I've never seen an explicit citation).</p>\n", "parentCommentId": "KBitu2Dhk6YJjQztn", "user": {"username": "therealslimkt"}}, {"_id": "LZqppD6rD4vxLRPhc", "postedAt": "2023-12-13T16:21:22.802Z", "postId": "H7rjCEmhcWscZsEnE", "htmlBody": "<p>An intervention that's on my mind is leveraging the sheer intelligence of some EAs to build a <i>factory design company</i> that is focused on building tools and processes for manufacturing. Might it be possible, for example, to build machines that can be used to help construct a wide variety of products? Could we invent the industrial equivalent of FoldScope (the paper microscope that makes medical diagnosis affordable) for small-scale manufacturing, build the machines at scale in an LMIC, and sell them around the world at cost? Or, could there be something like this for mining on small ore deposits that the big players don't touch?</p>", "parentCommentId": null, "user": {"username": "dpiepgrass"}}, {"_id": "GcjTrCCGXt9gEjcdb", "postedAt": "2023-12-13T16:43:45.667Z", "postId": "H7rjCEmhcWscZsEnE", "htmlBody": "<p>One way to think about services vs manufacturing: suppose you're very poor and you suddenly earn more money. How do you spend this limited new resource? Certainly you spend some of it on <i>stuff</i>: furniture, a better phone, electricity. If a country lacks manufacturing or exports, the money you spend on stuff leaves the country with no balancing inflow. And when you buy services, the person from whom you bought the services also buys stuff. So if people get richer at scale, the country as a whole tends to bleed that money back out. You can export services somewhat (customer service, or software development if your country has enough education) but you'll be competing with the likes of India and GPT4/AIs.</p><p>If you can manufacture stuff locally, more money stays in-country, and if the manufacturing sector grows large enough, it can become <i>efficient</i>, which allows exports. And my intuition says that limited, targeted protectionism (tariffs) would be beneficial, or even required, to nurture whatever local industries are developing.</p>", "parentCommentId": "aHdSN8tSHERpsAiAq", "user": {"username": "dpiepgrass"}}, {"_id": "y6JqEYjW3TSxubTMx", "postedAt": "2023-12-13T17:05:43.356Z", "postId": "H7rjCEmhcWscZsEnE", "htmlBody": "<blockquote><p>with no balancing inflow.&nbsp;</p></blockquote><p>There must always be a balancing flow. Your country has to be doing something to get the foreign currency required for that import. This could be exporting more of something else, or it could be attracting more foreign investment (or more aid), but there must be a balance. Your mercantilist intuition is a common one but it is mistaken.</p>", "parentCommentId": "GcjTrCCGXt9gEjcdb", "user": {"username": "Larks"}}, {"_id": "NmTzFtRF3Yihdso7J", "postedAt": "2023-12-13T17:12:16.571Z", "postId": "H7rjCEmhcWscZsEnE", "htmlBody": "<p>Ugh, yes of course if you got richer you got the money <i>from</i> somewhere. If you thought I thought otherwise, you were mistaken. (Of course it could've just been printed by the government, but that will cause inflation if not balanced by some kind of in-country value creation or spending reduction.) (Edit: also, Google tells me \"Mercantilism was based on the principle that the world's wealth was static\" and I do not have any such \"mercantilist intuition\".)</p>", "parentCommentId": "y6JqEYjW3TSxubTMx", "user": {"username": "dpiepgrass"}}, {"_id": "Zwqa3EnjCH7qJoEie", "postedAt": "2023-12-17T09:42:26.912Z", "postId": "H7rjCEmhcWscZsEnE", "htmlBody": "<p>Great post, Karthik! You may want to create an EA Forum sequence with the posts of the series.</p><p>Do you have any thoughts on preventing the increase in the consumption of farmed animals as a way of boosting sectoral transformation? Greater consumption of animals would create demand for greater agricultural production, so it naively seems like it may hinder sectoral transformation.</p>", "parentCommentId": null, "user": {"username": "vascoamaralgrilo"}}, {"_id": "yiFXepZguApinnn6E", "postedAt": "2023-12-17T10:44:24.144Z", "postId": "H7rjCEmhcWscZsEnE", "htmlBody": "<p>How does making a sequence work?</p>\n<p>I don't know how you would operationalize \"prevent the increase in consumption of farmed animals\", so it's hard to say. Also, meat substitutes are also produced by agriculture.</p>\n", "parentCommentId": "Zwqa3EnjCH7qJoEie", "user": {"username": "therealslimkt"}}, {"_id": "mT5twbXipbiWGrPoD", "postedAt": "2023-12-17T14:03:53.112Z", "postId": "H7rjCEmhcWscZsEnE", "htmlBody": "<blockquote><p>How does making a sequence work?</p></blockquote><p>&nbsp;I have never created one, but one can create one in the same menu used to create new posts:</p><figure class=\"image\"><img src=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/mT5twbXipbiWGrPoD/lkb2p5nsoqnct7u2o5vi\" srcset=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/mT5twbXipbiWGrPoD/r574ljslkinjshuzxdsd 330w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/mT5twbXipbiWGrPoD/irkqbvqm3fn7emjl3cv7 660w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/mT5twbXipbiWGrPoD/cqw7n8uftvsie9zs7gw4 990w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/mT5twbXipbiWGrPoD/cejcm1h8rlfzyshadyhi 1320w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/mT5twbXipbiWGrPoD/yrbtf5xwxz4gmzk0exqp 1650w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/mT5twbXipbiWGrPoD/hmyt9bvkukc3cq1bkwhm 1980w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/mT5twbXipbiWGrPoD/qmahr6hdqysy2a9zui3v 2310w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/mT5twbXipbiWGrPoD/ygd83xbwyhjhfabzhaa6 2640w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/mT5twbXipbiWGrPoD/dkynysw3jzet1xgprfth 2970w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/mT5twbXipbiWGrPoD/y3rfulslcjeztvznxfxk 3240w\"></figure><p>Then I think you can just add a description and past posts to the sequence (see <a href=\"https://forum.effectivealtruism.org/sequences/y5n47MfgrKvTLE3pw\">The Moral Weight Project Sequence</a> for an example).</p><blockquote><p>I don't know how you would operationalize \"prevent the increase in consumption of farmed animals\", so it's hard to say. Also, meat substitutes are also produced by agriculture.</p></blockquote><p>For example, by not subsidising the factory-farming industry, making producers internalise the harm inflicted to animals, and supporting the work of organisations like <a href=\"https://www.animaladvocacyafrica.org/\">Animal Advocacy Africa</a>.&nbsp;</p>", "parentCommentId": "yiFXepZguApinnn6E", "user": {"username": "vascoamaralgrilo"}}, {"_id": "Qpc7vShwsmg7jth8u", "postedAt": "2023-12-17T14:23:45.910Z", "postId": "H7rjCEmhcWscZsEnE", "htmlBody": "<p>I think those things are good, but \"hindering structural transformation\" is very far down the list of bad things about animal agriculture.</p>\n", "parentCommentId": "mT5twbXipbiWGrPoD", "user": {"username": "therealslimkt"}}, {"_id": "DnonyZs97fpeawodM", "postedAt": "2023-12-17T14:56:39.300Z", "postId": "H7rjCEmhcWscZsEnE", "htmlBody": "<p>Agreed! Do you have an idea about the economic cost of factory-farming as a fraction of gross world product? The <a href=\"https://eatforum.org/content/uploads/2019/07/EAT-Lancet_Commission_Summary_Report.pdf\"><u>EAT-Lancet diet</u></a> has 12.2 % (= (153 + 30 + 62 + 19 + 40)/2500; see Table 1) of calories coming from animals, and, according to the results of 3 approaches, would decrease adult deaths by 21.7 % (= (0.19 + 0.224 + 0.236)/3; see Table 2). If this is so, even if \"hindering structural transformation\" is very far down the list of bad things about animal agriculture, it could still be up the list of good things to boost economic growth?&nbsp;</p>", "parentCommentId": "Qpc7vShwsmg7jth8u", "user": {"username": "vascoamaralgrilo"}}, {"_id": "AAqaoDiBzk8haBGfr", "postedAt": "2023-12-17T18:17:39.371Z", "postId": "H7rjCEmhcWscZsEnE", "htmlBody": "<p>I doubt it would be, for suspicious convergence reasons, but I'm not informed enough to know.</p>\n", "parentCommentId": "DnonyZs97fpeawodM", "user": {"username": "therealslimkt"}}, {"_id": "aAwDPrkdsMDfqvkum", "postedAt": "2024-01-03T08:02:05.866Z", "postId": "H7rjCEmhcWscZsEnE", "htmlBody": "<p>Hi Karthik,</p><p>Do you know about estimates of the benefit-to-cost ratio of sectoral transformation interventions? For reference, cash transfers to poor households in Kenya <a href=\"https://www.nber.org/system/files/working_papers/w26600/w26600.pdf\">had</a> one of 2.4. I did a quick search, and found Copenhagen Consensus Center's 12 <a href=\"https://www.ifpri.org/publication/benefit-cost-analysis-increased-funding-agricultural-research-and-development-global\">best investment papers</a> for the sustainable development goals. <a href=\"https://copenhagenconsensus.com/sites/default/files/2023-03/Ag%20R%26D%20Best%20Investment%20Manuscript%20230311.pdf\">One</a> of them is about agricultural research and development, and found a benefit-to-cost ratio of 33.</p>", "parentCommentId": null, "user": {"username": "vascoamaralgrilo"}}, {"_id": "LcjpqbxLFkWtH7GRc", "postedAt": "2024-01-03T08:23:11.407Z", "postId": "H7rjCEmhcWscZsEnE", "htmlBody": "<p>I don't know of any such estimates, mainly because academic papers don't tend to focus on any tangible intervention and when they do there's no cost measurement. I'm pretty bullish on agricultural R&amp;D though, so nice to see that IFPRI paper.</p>\n", "parentCommentId": "aAwDPrkdsMDfqvkum", "user": {"username": "therealslimkt"}}, {"_id": "mFpmoPxSiAwXGHZpf", "postedAt": "2024-01-08T21:47:53.527Z", "postId": "H7rjCEmhcWscZsEnE", "htmlBody": "<p>Thanks for this interesting series! I've also been subscribed to <a href=\"https://www.thegpi.org/\">The Global Prosperity Institute's newsletter</a>, which releases interesting analyses of different approaches/policies to increase growth. At least one of the founders is a long-time EA, and the analyses are interesting to read!</p>", "parentCommentId": null, "user": {"username": "Jessica Wen"}}, {"_id": "5mx5Jfv2AmR2Q6to2", "postedAt": "2024-01-14T07:55:42.301Z", "postId": "H7rjCEmhcWscZsEnE", "htmlBody": "<p>Hi Karthik,</p><p>Thanks for writing this! Very useful summary to the economics literature on development for someone unfamiliar with it.&nbsp;</p><p>I note in your caveat that \"a large body of work emphasizes the importance of good institutions for development; I don't believe that topic will yield any promising interventions\". You seem to have given alot of thought on this so I'm wondering if there are any clear signs you see which suggest that such institutional development work are indeed not promising.&nbsp;</p><p>There seem to be a number of organisations working on this front (e.g. Artha Global as suggested in this <a href=\"https://forum.effectivealtruism.org/posts/oTuNw6MqXxhDK3Mdz/economic-growth-donation-suggestions-and-ideas\">post</a>, anti-corruption institutions etc.), though the outcomes may be hard to quantify. The EA community also often faces criticisms that it neglects interventions which aim at <a href=\"https://forum.effectivealtruism.org/topics/systemic-change\">systemic change</a>. Without having looked at the evidence, such interventions seem possibly promising to me.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Axby"}}]