[{"_id": "AFJAiCEC4DG3NT8PY", "postedAt": "2023-05-24T11:08:51.730Z", "postId": "HAaXks5QgurLLJub2", "htmlBody": "<p>Cool work! Thanks for this, I'll pass these on to potential entrepreneurs. &nbsp;</p><p>Regarding the CEAs, could you say a bit more about the metrics used? Ideally, what would be a naive translation to QALYs?</p>", "parentCommentId": null, "user": {"username": "edoarad"}}, {"_id": "MtSmcYWr2xFEhdTm9", "postedAt": "2023-05-24T13:11:43.657Z", "postId": "HAaXks5QgurLLJub2", "htmlBody": "<p>Excited to see more work on mental health charities! Thank you for this. I will need a bit of time to read before I comment I could comment in more detail.&nbsp;<br><br>What's stopping me from have a good overview of your results is that the cost-effectiveness of each proposed intervention is on a different mental-health outcome. If I am not mistaken, these have different scale sizes. Do you have results converted in effect sizes (Cohen's d)? This would mean all the outcomes are converted to the same unit, standard deviations. This makes it easier to compare and allows you to compare them to other interventions that are also evaluated in affect/wellbeing (e.g., <a href=\"https://www.happierlivesinstitute.org/report/happiness-for-the-whole-family/\">McGuire et al., 2022</a>).&nbsp;</p>", "parentCommentId": null, "user": {"username": "Samuel Dupret"}}, {"_id": "b3JKZzhxyrGYSpnJx", "postedAt": "2023-05-26T11:02:44.953Z", "postId": "HAaXks5QgurLLJub2", "htmlBody": "<p>Thank you! Regarding the metrics for the CEAs, we struggled to look for studies on the interventions that used QALYs/DALYs. We also found it challenging to convert the available metrics into QALYs/DALYs since it is not something the team was knowledgeable about. We decided just to use the most common metric we found among the studies for each intervention to be more accurate in describing its effectiveness.</p>", "parentCommentId": "AFJAiCEC4DG3NT8PY", "user": {"username": "Shen Javier"}}, {"_id": "nb8MT8h9De7n8bkc9", "postedAt": "2023-05-26T11:08:07.494Z", "postId": "HAaXks5QgurLLJub2", "htmlBody": "<p>Hi Samuel! We don't have results converted in effect sizes but most of the studies would have those reported. We used the mental health metrics instead of effect sizes since we thought it was easier for showing how effective it was for a certain mental health outcome. Having it in effect sizes would be helpful too though!</p>", "parentCommentId": "MtSmcYWr2xFEhdTm9", "user": {"username": "Shen Javier"}}]