[{"_id": "uEsn3EG8LRmxoiW6s", "postedAt": "2015-07-14T07:48:50.853Z", "postId": "HbunzTyFPRwcYihg6", "htmlBody": "<p>Aren't you double-counting DALYs here? Imagine 2 charities:</p>\n<p>Charity 1 prevents Malaria deaths in children.\nCharity 2 pays for the costs of living of poor people.</p>\n<p>If Charity 1 prevents a Malaria death and then Charity 2 pays for the costs of living of the saved person, each will count each year as a DALY win per x$ donated. But they can't both claim full credit.</p>\n<p>Of course, maybe the person won't be poor. Maybe they'll be a great inventor. Or maybe they'll be a violent criminal. Or something in between.</p>\n<p>And what is the unpleasantness of using Malaria bed nets in hot regions? It is my understanding that in order to prevent one death, hundreds of people need to use it on a daily basis for years (though I am not an expert on the matter). How much does this reduce quality of life?</p>\n", "parentCommentId": null, "user": {"username": "DisposableUsername"}}, {"_id": "JvRNGyJr8Tcuoavzb", "postedAt": "2015-07-14T10:49:30.048Z", "postId": "HbunzTyFPRwcYihg6", "htmlBody": "<p>~80 years of life maybe (seems optimistic for these regions) but surely not ~80 DALYs in expectancy for under 5s? What about morbidity that can be expected to be had by the kids you save? Does this come into the discounting decision?</p>\n<p>Also, Hauke, do you have an idea, personally, of the additional benefit (as a number) in terms of HIV / adult suffering / disease dynamics / reduction of health income shocks etc. etc. from reducing the incidence of malaria beyond avoiding child deaths that you helpfully walk people through in your GWWC article on malaria?</p>\n", "parentCommentId": null, "user": {"username": "tomstocker"}}, {"_id": "vndiuc7AiZ3giuvXR", "postedAt": "2015-07-14T11:08:05.970Z", "postId": "HbunzTyFPRwcYihg6", "htmlBody": "<blockquote>\n<p>~80 years of life maybe (seems optimistic for these regions) but surely not ~80 DALYs in expectancy for under 5s? What about morbidity that can be expected to be had by the kids you save? Does this come into the discounting decision?</p>\n</blockquote>\n<p>In the DALY framework, people never take into account the regional life expectancy, but a more general or sometimes even western standard life expectancy (Average worldwide life expectancy is 70 years). I think this might be justified as life expectancy is increasing world wide and because of that could even be an underestimate.</p>\n<blockquote>\n<p>Also, Hauke, do you have an idea, personally, of the additional benefit (as a number) in terms of HIV / adult suffering / disease dynamics / reduction of health income shocks etc. etc. from reducing the incidence of malaria beyond avoiding child deaths that you helpfully walk people through in your GWWC article on malaria?</p>\n</blockquote>\n<p>These coinfections are complex issues and all estimates are very uncertain. I review the literature around this here:</p>\n<p><a href=\"https://www.givingwhatwecan.org/blog/2015-04-24/update-against-malaria-foundation\">https://www.givingwhatwecan.org/blog/2015-04-24/update-against-malaria-foundation</a></p>\n<p>The main point here is that, Malaria interventions are already very cost-effective even when just taking into account childhood mortality, and independent of the effect size of these interactions, you might avert some HIV infections on top the more established effects 'for free'.</p>\n", "parentCommentId": "JvRNGyJr8Tcuoavzb", "user": {"username": "HaukeHillebrandt"}}, {"_id": "R4sisceBLCirnPWmm", "postedAt": "2015-07-14T11:14:51.486Z", "postId": "HbunzTyFPRwcYihg6", "htmlBody": "<blockquote>\n<p>Aren't you double-counting DALYs here? Imagine 2 charities:</p>\n</blockquote>\n<p>Charity 1 prevents Malaria deaths in children. Charity 2 pays for the costs of living of poor people.</p>\n<p>If Charity 1 prevents a Malaria death and then Charity 2 pays for the costs of living of the saved person, each will count each year as a DALY win per x$ donated. But they can't both claim full credit.</p>\n<p>Great question. Yes, you'd be double counting in this case. The DALY is not perfect, and should always be seen as just a general rough guide, and never be the sole influence for making decisions. As they say, all models are wrong, but some are useful :)</p>\n<p>Malaria nets are unpleasant to sleep under, but it's much better than getting malaria. I'm not aware of any studies that measure how much of a reduction in quality of life they result in, but I imagine the effect to be quite small.</p>\n", "parentCommentId": "uEsn3EG8LRmxoiW6s", "user": {"username": "HaukeHillebrandt"}}, {"_id": "Eir8XAXCj7vMFifew", "postedAt": "2015-07-15T18:30:29.746Z", "postId": "HbunzTyFPRwcYihg6", "htmlBody": "<p>Also, the sooner malaria is controlled, the fewer bed-net-nights there will be overall??</p>\n", "parentCommentId": "uEsn3EG8LRmxoiW6s", "user": {"username": "tomstocker"}}, {"_id": "Zaxtq7taqSSD4ibkC", "postedAt": "2015-07-15T18:43:05.663Z", "postId": "HbunzTyFPRwcYihg6", "htmlBody": "<p>Casually, the Lancet article is making a very big claim - that general health spending on kids has led to averted deaths at $4205 each across the board since 2000. This is a simple average of the association between spending and reduced deaths. So it attributes 100% of the progress in this area to the amount of spending in each country. As they point out, the correlation is not tight. So it would not be sensible to attribute 100% of the improvement to the spending. Which is in a way disappointing because we can't then just throw more money at the problem and expect this return. But in another way isn't such a surprise that all Givewell found was a very slight improvement on that average. Education, culture, the economy, general efficiency of public services, declining fertility probably all had quite a lot to do with each country's story. So the Lancet article isn't that useful in this way?</p>\n", "parentCommentId": null, "user": {"username": "tomstocker"}}, {"_id": "BP42zFWo9yxvMD7wz", "postedAt": "2015-07-17T18:05:13.178Z", "postId": "HbunzTyFPRwcYihg6", "htmlBody": "<p>The analysis is a bit more sophisticated than that:</p>\n<p>&quot;To avoid overestimation of the number of child deaths averted through health intervention, we take advantage of the analysis published by Wang et al (1), which examined the component of changes in child mortality that can be linked to changes in income per capita and educational attainment. Based on the econometric model used by Wang et al (1), we estimate counterfactual deaths in a scenario where income, education, and number of live births change with time but everything else is set at its year 2000 value.&quot;\nSee supplemental material: <a href=\"http://www.thelancet.com/cms/attachment/2033982751/2049751458/mmc1.pdf\">http://www.thelancet.com/cms/attachment/2033982751/2049751458/mmc1.pdf</a></p>\n", "parentCommentId": "Zaxtq7taqSSD4ibkC", "user": {"username": "HaukeHillebrandt"}}, {"_id": "MK2QCtsgwjZSbSPPk", "postedAt": "2015-07-22T09:52:38.994Z", "postId": "HbunzTyFPRwcYihg6", "htmlBody": "<p>OK, so then either it is surprising that givewell hasn't found better, there are some harder to observe links between child health spending and child health, or there are other variables that probably aren't covered off properly in the model?</p>\n", "parentCommentId": "BP42zFWo9yxvMD7wz", "user": {"username": "tomstocker"}}, {"_id": "fzv5xpC96yaJJDCe8", "postedAt": "2015-07-24T10:20:26.031Z", "postId": "HbunzTyFPRwcYihg6", "htmlBody": "<p>Big development organisations (Gates, UNICEF, etc) can do certain things that are very effective, such as vaccinations, and might also enjoy economies of scale. It's actually quite surprising that individual donors can do significantly better ($3340 per life saved by donating to AMF vs. $4205 per life saved). Note also, that the $4205 figure is a biased sample of any big development organisations programme - because most are not only active in low income countries.\nIndividual donors cannot donate in a ringfenced fashion to development organisation through big organisations such as UNICEF unfortunately.</p>\n", "parentCommentId": "MK2QCtsgwjZSbSPPk", "user": {"username": "HaukeHillebrandt"}}, {"_id": "hmwuvr9SFHDK4kpdM", "postedAt": "2015-08-12T02:26:06.361Z", "postId": "HbunzTyFPRwcYihg6", "htmlBody": "<p>Depends on how realistic it is to eliminate malaria completely.</p>\n", "parentCommentId": "Eir8XAXCj7vMFifew", "user": {"username": "DisposableUsername"}}]