[{"_id": "36FEFd2XxoR5LbjPN", "postedAt": "2023-09-29T16:10:33.166Z", "postId": "HbYHjrpBJogmsSBkd", "htmlBody": "<p>On your last point, if you believe that the EV from a \"effective neartermism -&gt; effective longtermism\" career change is greater than a \"somewhat harmful career -&gt; effective neartermism\" career change, then the downside of using a \"somewhat harmful career -&gt; effective longtermism\" example is that people might think the \"stopped doing harm\" part is more important than the \"focused on longtermism\" part.</p><p>More generally, I think your \"arguments for the status quo\" seem right to me! I think it's great that you're thinking clearly about the considerations on both sides, and my guess is that you and I would just weight these considerations differently.</p>", "parentCommentId": null, "user": {"username": "Isaac_Dunn"}}, {"_id": "W46sKWeExfTz8J3LJ", "postedAt": "2023-09-29T16:16:50.546Z", "postId": "HbYHjrpBJogmsSBkd", "htmlBody": "<p>Thanks Isaac for the encouragement on the validity of the \"arguments for the staus quo\". I'm not really sure how I weight the considerations to be honest, I'm more raising the questions for discussion.<br><br>Yes that's a fair point about the story at the end. I hadn't consider the \"stopped doing harm\" part might make my example confusiton. Maybe then I would prefer a \"went from being a doctor\" to \"focused on longtermism\", because otherwise it feels like a bit of a kick in the teeth to a decent chunk of the EA community who have decided that global health is.a great thing to devote your life to ;).</p>", "parentCommentId": "36FEFd2XxoR5LbjPN", "user": {"username": "NickLaing"}}, {"_id": "Tw9ntyNNFcBiXDv8F", "postedAt": "2023-09-29T21:39:36.082Z", "postId": "HbYHjrpBJogmsSBkd", "htmlBody": "<blockquote><p>Surely as their gold standard “career change” pin-up story, they could find a higher EV career change.</p></blockquote><p>You're assuming that the EV of switches from global health to biosecurity is lower than the EV of switching from something else to biosecurity. Even though global health is better than most cause areas, this could be false in practice for at least two reasons</p><ul><li>If the impact of biosecurity careers is many times higher than the impact of global health, and people currently in global health are slightly more talented, altruistic, or hardworking.</li><li>If people currently in global health are not doing the most effective global health interventions.</li></ul>", "parentCommentId": null, "user": {"username": "tkwa"}}, {"_id": "FLDPCFdW9LvmAbo3R", "postedAt": "2023-09-29T22:10:10.082Z", "postId": "HbYHjrpBJogmsSBkd", "htmlBody": "<p>Losing some parsimony, perhaps <i>80,000 Hours </i>could allow users to toggle between a \"short-termist\" and \"longtermist\" ranking of top career paths? The cost of switching rankings seems low enough that ~anyone who's inclined to work on a longtermist cause area under the status-quo would still do so with this change.</p>", "parentCommentId": null, "user": {"username": "nemeryxu"}}, {"_id": "p3XmWn739Dq5PNyWd", "postedAt": "2023-09-30T00:55:11.004Z", "postId": "HbYHjrpBJogmsSBkd", "htmlBody": "<p>Flagging quickly that ProbablyGood seems to have moved into this niche. Unsure exactly how their strategy differs from 80k hours but their career profiles do seem more animals and global health focused</p>\n<p>I think they’re funded by similar sources to 80k\n<a href=\"https://probablygood.org/career-profiles/\">https://probablygood.org/career-profiles/</a></p>\n", "parentCommentId": null, "user": {"username": "geoffreyyip"}}, {"_id": "3zijfrMripXsGNCeF", "postedAt": "2023-09-30T01:08:28.532Z", "postId": "HbYHjrpBJogmsSBkd", "htmlBody": "<p>As one data point: I was interested in global health from a young age, and found 80K during med school in 2019, which led to opportunities in biosecurity research, and now I'm a researcher on global catastrophic risks. I'm really glad I've made this transition! However, it's possible that I would have not applied to 80K (and not gone down this path) if I had gotten the impression they weren't interested in near-termist causes.&nbsp;</p><p>Looking back at my 80K 1on1 application materials, I can see I was aware that 80K thought global health was less neglected than biosecurity, and I was considering bio as a career (though perhaps only with 20-30% credence compared to global health). If I'd been aware at the time just how longtermist 80K is, I think there's a 20-40% chance I would have not applied.&nbsp;</p><p>I think Elika's is a great example of having a lot of impact, but I agree that an example shifting from global health is maybe unnecessarily dismissive. I don't think the tobacco thing is good - surely any remotely moral career advisor would advise moving away from that. Ideally a reader who shifted from a neutral or only very-mildly-good career to a great career would be better (as they do for their other examples). I'd guess 80K know some great examples? Maybe someone working exclusively on rich-country health or pharma who moved into bio-risk?</p>", "parentCommentId": null, "user": {"username": "BenStewart"}}, {"_id": "2d7FyRzp2f3qWtv6y", "postedAt": "2023-09-30T03:43:30.132Z", "postId": "HbYHjrpBJogmsSBkd", "htmlBody": "<p>Hey Thomas - I think Isaac was making a related point above as well.</p><p>Yes you're right that under my assumptions the potential EV switch from global health to biosecurity could well be high than switching from something else. Like you said especially if their global health work is bad, or if they are doing less effective things.</p><p>On the flipside someone could also be very, very good at global health work with a lot of specific expertise, passion and career capital, which they might not carry into their biosecurity job. This could at the very least least could narrow the EV gap between the 2 careers.</p>", "parentCommentId": "Tw9ntyNNFcBiXDv8F", "user": {"username": "NickLaing"}}, {"_id": "WhuPJLwYcEuCh4nRk", "postedAt": "2023-09-30T03:48:32.947Z", "postId": "HbYHjrpBJogmsSBkd", "htmlBody": "<p>Thanks for your example - a 20-40% chance you wouldn't have applied is quite high. And I do think if anyone (EA or otherwise) looked through the 80,000 hours website you probably would get the impression that they weren't interested at all in near-termist causes.<br>&nbsp;</p><p>Also I think you've nailed it with the \"ideal\" example career-shift here.<br><br><i><strong>\"Ideally a reader who shifted from a neutral or only very-mildly-good career to a great career would be better (as they do for their other examples). I'd guess 80K know some great examples? Maybe someone working exclusively on rich-country health or pharma who moved into bio-risk?\"</strong></i></p>", "parentCommentId": "3zijfrMripXsGNCeF", "user": {"username": "NickLaing"}}, {"_id": "yFr4toZfr8Qg9LbjZ", "postedAt": "2023-09-30T04:00:55.414Z", "postId": "HbYHjrpBJogmsSBkd", "htmlBody": "<p>Thanks Geoffry, yes I agree that ProbablyGood have now basically taken over the niche of high EV near-termist career advice and are a great resource. As a doctor, I think their content<a href=\"https://probablygood.org/career-profiles/medicine/\"> on medicine as a career</a> is outstanding</p><p>A couple of reasons though (from above) why 80,000 hours might still be better having 20-30% near-termist content despite there being a great alternative.</p><p>1. Perhaps the argument I'm most interested in is whether 80,000 hours might produce <i><strong>more </strong></i>long-termist workers in the long term by having more of a short term focus.</p><p>2. ProbablyGood will probably never be.a \"front page\" of EA. As in I would imagine that 80,00 hours has 100=1000x the traffic of ProbablyGood, and I doubt many people first contact EA through ProbablyGood (happy to be corrected here though). &nbsp;</p>", "parentCommentId": "p3XmWn739Dq5PNyWd", "user": {"username": "NickLaing"}}, {"_id": "LpmBJLyqRMerXb4dJ", "postedAt": "2023-09-30T07:20:25.389Z", "postId": "HbYHjrpBJogmsSBkd", "htmlBody": "<p>Strongly agree. I definitely would like to see more content on <i>neartermist</i> causes/ careers. But importantly, I would like to see this content contributed by authors who hold <i>neartermist</i> views and can give those topics justice. Whilst I am appreciative of 80,000 Hours and GWWC attempting to accomodate longtermism-skeptics with some <i>neartermist</i> content, their <i>neartermist</i> content feels condescending because it doesn't properly showcase the perspectives of Effective Altruists who are skeptical of longtermist framings.</p><p>&nbsp;</p><p>I also personally worry 80,000 Hours is seen as the \"official EA cause prioritisation\" resource and this:</p><ul><li>alienates readers with different views and conclusions,</li><li>does not show that the EA community has diverse and varied views,</li><li>has misled readers into thinking there is an \"official EA position\" on best careers/ cause areas</li></ul><p>Having more neartermist content will help with this, but I also would like to see 80,000 Hours host content from authors with clashing views. E.g., 80,000 makes a very forceful case that Climate Change is not a material X-Risk, and I would like to see disagreeing writers critique that view on their site.</p><p>&nbsp;</p><p>I also think you hit the nail on the head about many readers being unreceptive to longtermism for concerns like tractability, and that is entirely valid for them.</p>", "parentCommentId": null, "user": {"username": "Mohammad Ismam Huda"}}, {"_id": "FFKTu22kYAdqDMDwB", "postedAt": "2023-09-30T07:56:25.190Z", "postId": "HbYHjrpBJogmsSBkd", "htmlBody": "<p>Thanks Mohammed - yes as a mostly-near-termist myself I agree with many your concerns as well. For this post though I was making an argument which <i><strong>assumes longtermist causes are by far the most important</strong></i>, but like you say there are plenty of other arguments that can be made if we don't necessarily assume that as well.</p><p>I agree that as 80,000 hours is so influential and a \"front door\" to Effective Altruism, the site could mislead readers into thinking there is an official \"EA position\" on the best careers and causes - although 80,000 hours do say they are \"part of the EA community\" rather than actively claiming a leadership role.</p><p>And I really like the idea of having some discourse and disagreement on the site itself, that feels like a genuine and \"EA\" style way to go about things.</p><p>And thinking about your \"condescending\" comment, as well as the career example I listed, The <i><strong>\"Problems many of our readers prioritise\" </strong></i>could be easily interpreted as condescention as well. I don't think 80,000 hours are trying to be condescending, but it is easy to interpret that way.&nbsp;</p>", "parentCommentId": "LpmBJLyqRMerXb4dJ", "user": {"username": "NickLaing"}}, {"_id": "HpuL6M2DkyLnDbopB", "postedAt": "2023-09-30T09:02:36.368Z", "postId": "HbYHjrpBJogmsSBkd", "htmlBody": "<p>Agree and thanks for writing this up Nick!</p>\n<p>I like 80k's recent shift to pushing it's career guide again (what initially brought me into EA - the writing is so good!) and focusing on skill sets.</p>\n", "parentCommentId": null, "user": {"username": "Gemma Paterson"}}, {"_id": "rTPE6BYDFqkePEnhS", "postedAt": "2023-09-30T09:58:41.323Z", "postId": "HbYHjrpBJogmsSBkd", "htmlBody": "<p>Makes sense. To be clear, I think global health is very important, and I think it's a great thing to devote one's life to! I don't think it should be underestimated how big a difference you can make improving the world now, and I admire people who focus on making that happen. It just happens that I'm concerned the future might be even higher priority thing that many people could be in a good position to address.</p>\n", "parentCommentId": "W46sKWeExfTz8J3LJ", "user": {"username": "Isaac_Dunn"}}, {"_id": "bBMikceyTpG7PfcRS", "postedAt": "2023-09-30T10:18:46.195Z", "postId": "HbYHjrpBJogmsSBkd", "htmlBody": "<p>Thanks I really like this idea and hadn't thought about it myself. Obviously there are still potential negative tradeoffs as discussed.</p>\n", "parentCommentId": "FLDPCFdW9LvmAbo3R", "user": {"username": "NickLaing"}}, {"_id": "cJ8KKTLcDaGoPtabp", "postedAt": "2023-09-30T15:40:26.462Z", "postId": "HbYHjrpBJogmsSBkd", "htmlBody": "<p>Hi Nick —</p>\n<p>Thanks for the thoughtful post! As you said, we’ve thought about these kinds of questions a lot at 80k. Striking the right balance of content on our site, and prioritising what kinds of content we should work on next, are really tricky tasks, and there’s certainly reasonable disagreement to be had about the trade-offs.</p>\n<p>We’re not currently planning to focus on neartermist content for the website, but:</p>\n<ul>\n<li>We just released a giant update to our career guide and re-centered it on our site. It is targeted at a broad audience, not just those interested in x-risk or similar causes, and it discusses many neartermist causes.</li>\n<li>Our podcast often covers topics relevant to neartermist causes, including some episodes currently in the pipeline.</li>\n<li>Our job board lists many roles in organisations that work on near-term cause areas.</li>\n<li>Much of our website content is useful for readers whether or not they priorritise longtermist cause areas, and we're pretty dedicated to keeping it this way.</li>\n</ul>\n<p>So I think we’re probably covering a lot (though not all) of the benefits we can get by being pretty “big tent” while also trying to (1) not to mislead people about the cause areas we think are most pressing (a reason you touch on above) and (2) focus our efforts where we they'll be as useful as possible. On the latter point: to be honest, much of this is ultimately about capacity constraints. For example, we think that we could do more to make our site helpful and appealing to mid-career people (it can be off-putting for them currently due to a vibe of treating the reader like a 'blank slate'), and my current guess is that our marginal resources would be better put there in the near future vs. doing more neartermist content.</p>\n", "parentCommentId": null, "user": {"username": "Ardenlk"}}, {"_id": "K5jtLDrc3Cmpcetn6", "postedAt": "2023-09-30T16:10:18.829Z", "postId": "HbYHjrpBJogmsSBkd", "htmlBody": "<p>(I work at 80,000 Hours but on the 1on1 side rather than website.) Thanks for writing out your thoughts so clearly and thoroughly Nick. Thanks also for thinking about the issue from both sides - I think you’ve done a job job of capturing reasons against the changes you suggest. The main one I’d add is that having a lot more research and conversations about lots of different areas would need a very substantial increase in capacity.</p><p>I’m always sad to hear about taking away the impression that 80,000 Hours doesn’t care about helping present sentient creatures. I think the <a href=\"https://forum.effectivealtruism.org/posts/3k4H3cyiHooTyLY6p/why-i-find-longtermism-hard-and-what-keeps-me-motivated\">hardest thing about effective altruism</a> to me is having to prioritise some problems over others when there are so many different sources of suffering in the world. Sometimes the thing that feels most painful to me is the readily avoidable suffering that I’m not doing anything about personally, like malaria. Sometimes it’s the suffering humans cause each other that it feels like we should be able to avoid causing each other, like cutting apart families on the US border. Sometimes it’s suffering that particularly resonates with me, like the lack of adequate health care for pregnancy complications and losses. I so much wish we were in a world where we could solve all of these, rather than needing to triage.</p><p>I’m glad that Probably Good exists to try out a different approach from us, and add capacity more generally to the space of people trying to figure out how to use their career to help the world most. You’re right that Probably Good currently has far lower reach than 80,000 Hours. But it’s far earlier in its journey than 80,000 Hours is, and is ramping up pretty swiftly.</p>", "parentCommentId": null, "user": {"username": "Michelle_Hutchinson"}}, {"_id": "cLP5nBC4F7yjJGBqQ", "postedAt": "2023-10-01T11:08:42.531Z", "postId": "HbYHjrpBJogmsSBkd", "htmlBody": "<p>If this is de-railing the convo here feel free to ignore, but what do you mean concretely by the distinction between \"near-termist\" and \"long-termist\" cause areas here? Back in spring 2022 when some pretty senior (though not decision-critical) politicians were making calls for NATO to establish a no-fly zone over Ukraine, preventing Nuclear Catastrophe seemed pretty \"near-termist\" to me?</p><p>I also suspect many if not most AIXR people in the Bay think that AI Alignment is a pretty \"near-term\" concern for them. Similarly, concerns about Shrimp Welfare have only been focused on the here-and-now effects and not the 'long run digital shrimp' strawshrimp I sometimes see on social media.</p><p>Is near-term/long-term thinking actually capturing a clean cause area distinction? Or is it just a 'vibe' distinction? I think you clearest definition is:</p><blockquote><p>Many people are drawn to the clear and more palatable idea that we should devote our lives to doing the most good to humans and animals alive right now</p></blockquote><p>But to me that's a philosophical debate right, or perspecitve? Because of <a href=\"https://80000hours.org/problem-profiles/#most-pressing-world-problems\">80K's top 5 list</a>, I could easily see individuals in each area making arguments that it is a near-term cause.</p><p>To be clear, I actually think I agree with a lot of what you say so I don't want to come off as arguing the opposite case. But when I see these arguments about near v long termism or old v new EA or bednets v scifi EA, it just doesn't seem to <i>\"carve nature at its joints\" </i>as the saying goes, and often leads to confusion as people argue about different things while using the same words.</p>", "parentCommentId": null, "user": {"username": "JWS"}}, {"_id": "8kP5qmW4sqgucFCr3", "postedAt": "2023-10-01T14:36:29.888Z", "postId": "HbYHjrpBJogmsSBkd", "htmlBody": "<p>Thanks those are some fair points. I think I am just using language that others use, so there is some shared understanding, even though it carries with it a lot of fuzziness like you say.</p>\n<p>Maybe we can think of better language than \"near term\" or \"long term\" framing or just be more precise.</p>\n", "parentCommentId": "cLP5nBC4F7yjJGBqQ", "user": {"username": "NickLaing"}}, {"_id": "ed4ijMwx8A5ZGpR5f", "postedAt": "2023-10-01T15:59:11.114Z", "postId": "HbYHjrpBJogmsSBkd", "htmlBody": "<p>Open Phil had this issue - they <a href=\"https://www.openphilanthropy.org/our-global-health-and-wellbeing-and-global-catastrophic-risks-grantmaking-portfolios/\">now use</a> 'Global Health &amp; Wellbeing' and 'Global Catastrophic Risks', which I think captures the substantive focus of each.</p>", "parentCommentId": "8kP5qmW4sqgucFCr3", "user": {"username": "BenStewart"}}, {"_id": "2juqd8DAZzCHitM64", "postedAt": "2023-10-02T20:00:34.199Z", "postId": "HbYHjrpBJogmsSBkd", "htmlBody": "<p>Thanks Michelle - great to see 80,000 hours staff respond!<br><br><i><strong>\"I’m always sad to hear about taking away the impression that 80,000 Hours doesn’t care about helping present sentient creatures.\" </strong>- </i>This is a bit of a side issue to the points I raised, but I think any passer by could easily get this impression from your website. I don't think its mainly about the prioritisation issue, just slightly cold and calculated presentation. A bit more warmth, kindness and acknowledgement of the pains of prioritisation could make the website feel more compassionate.</p><p>Even just some of this sentiment from of your fantastic comment here, displayed on the website in some prominent places could go a long way to demonstrating that 80,000 hours cares about current people</p><p><i><strong>\"I think the </strong></i><a href=\"https://forum.effectivealtruism.org/posts/3k4H3cyiHooTyLY6p/why-i-find-longtermism-hard-and-what-keeps-me-motivated\"><i><strong>hardest thing about effective altruism</strong></i></a><i><strong> to me is having to prioritise some problems over others when there are so many different sources of suffering in the world. Sometimes the thing that feels most painful to me is the readily avoidable suffering that I’m not doing anything about personally, like malaria. Sometimes it’s the suffering humans cause each other that it feels like we should be able to avoid causing each other, like cutting apart families on the US border. Sometimes it’s suffering that particularly resonates with me, like the lack of adequate health care for pregnancy complications and losses. I so much wish we were in a world where we could solve all of these, rather than needing to triage.\"</strong></i></p>", "parentCommentId": "K5jtLDrc3Cmpcetn6", "user": {"username": "NickLaing"}}, {"_id": "gu6tqhcR4ARP8zeeT", "postedAt": "2023-10-15T00:39:51.168Z", "postId": "HbYHjrpBJogmsSBkd", "htmlBody": "<p>Plenty of Christians would love more neartermist career content (and would be unlikely to engage with 80k as it's currently branded). So over the past year a group of Christian EAs created an advisory for this, under the direction of EA for Christians</p>\n<p>See <a href=\"http://www.christiansforimpact.org\">www.christiansforimpact.org</a></p>\n", "parentCommentId": null, "user": {"username": "JDBauman"}}]