[{"_id": "W8nm4t6RGfrEqbz9s", "postedAt": "2023-03-03T03:06:36.149Z", "postId": "HCuoMQj4Y5iAZpWGH", "htmlBody": "<p>Thanks very much for writing this. Unnecessarily alienating people for stupid reasons like misusing terminology or not understanding their perspective seems like a clear mistake and hopefully this can help people avoid these pitfalls.</p><p>I was curious about your suggestion that a lot of researchers think that basically all biomedical research is gain/loss of function. My impression is that one of the key defenses that the Fauci/NIH/EcoHealth/etc. offered for their research in Wuhan was that it was <a href=\"https://theintercept.com/2021/09/09/covid-origins-gain-of-function-research/\">technically not Gain of Function</a>, even if some parts of it might sound like Gain of Function to the layperson, which seems in tension with this claim. Do you think they were wrong about this?</p><p>Your point about many researchers in this area feeling defensive was a good one, and it's important to take this into account when talking to people. It's not fun to be blamed for causing a global crisis, especially if its possible you didn't do it!</p><p>I do think there's a risk of a missing mood, however. Speaking as an outsider, the amount of regulation on what you refer to as ePPP (adding functionality to make diseases more dangerous) seems shockingly low. The <a href=\"https://journals.asm.org/doi/10.1128/mBio.00188-23?_ga=2.214861973.322453087.1677791919-1488878016.1667664275\">article you link to</a> tries to make it sound like there are a lot of safeguards, but it seems to me like virtually all the steps only apply if you are seeking federal funding. This is not a standard we accept in other areas! If you are making a car, or building a nuclear power plant, or running a bank or airline, you have to accept extremely intrusive regulation regardless of your funding, and for many things - like nuclear weapons or money laundering - US regulation has world-wide reach.&nbsp;</p><p>For comparison, here are some of the regulatory approaches used in finance, another industry that was widely blamed for causing a global crisis:</p><ul><li>Monitoring of all electronic communications.</li><li>Quarterly reporting of activities to regulators.</li><li>Regulators placed inside your organization.</li><li>Risk Management departments at every firm, making up a non-trivial fraction of their total size.</li><li>Compliance departments at every firm, making up a non-trivial fraction of their total size.</li><li>Mandatory compliance training for all employees.</li><li>Novel regulatory bodies with broad mandate to find and punish things that seem bad.</li><li>AML &amp; KYC rules that impose stringent penalties for doing business with suspisious actors.</li><li>Mandatory insurance.</li><li>Direct government control over key areas.</li><li>'Voluntary' advice from regulators (100% adoption due to legal risks of disobedience).</li><li>Multi-million-dollar whistleblower awards.</li><li>Billion-dollar fines.</li><li>Decades long jail sentences.</li><li>Lifetime bans from the industry.</li><li>... and most importantly, if you mess up, you will probably lose a lot of money.</li></ul><p>As far as I can, few if any of these approaches are imposed on Gain of Function research, despite the potential to directly cause the death of all of humanity.</p>", "parentCommentId": null, "user": {"username": "Larks"}}, {"_id": "ic4NKrtvE52N9BuKC", "postedAt": "2023-03-03T03:10:17.579Z", "postId": "HCuoMQj4Y5iAZpWGH", "htmlBody": "<p>Just wanted to give my hearty +1 to approaching biosecurity issues with humility and striving to gain important context (which EAs often lack!)</p>\n", "parentCommentId": null, "user": {"username": "ASB"}}, {"_id": "gNY2bjqArb5CXmBGb", "postedAt": "2023-03-03T03:26:55.852Z", "postId": "HCuoMQj4Y5iAZpWGH", "htmlBody": "<p>Without getting too far into the specifics, I think that this is a good attitude to have across a wide range of policy concerns, and that similar issues apply to other policy areas EAs are interested in.</p>", "parentCommentId": null, "user": {"username": "keller_scholl"}}, {"_id": "vYwgzWtyMKtGezJcd", "postedAt": "2023-03-03T03:37:25.561Z", "postId": "HCuoMQj4Y5iAZpWGH", "htmlBody": "<p>I think it's quite sensible that people hoping to have a positive impact in biosecurity should become well-informed first. However, I don't think this necessarily means that radical positions that would ban a lot of research are necessarily wrong, even if they are more often supported by people with less detailed knowledge of the field. I'm not accusing you of saying this, I just want to separate the two issues.</p><blockquote><p>&nbsp;Many professionals in this space are scared and stressed. Adding to that isn’t necessarily building trust and needed allies. The professionals in this space are good people – no reputable virologist is trying to do research that intentionally releases or contributes to a pandemic. Biosafety professionals spend their life working to prevent lab leaks. If I’m being honest, many professionals in and around the biosecurity field don’t think incredibly highly of recent (the past few years) journalistic efforts and calls for total research bans.</p></blockquote><p>Many people calling for complete bans think that scientists are unreliable on this - because they want to continue to do their work, and may not be experts in risk - and the fact that said scientists do not like people doing this doesn't establish that anyone calling for a complete ban is wrong to do so.&nbsp;<br><br>As a case in point regarding the unreliability of involved scientists: your <a href=\"https://journals.asm.org/doi/10.1128/mBio.00188-23?_ga=2.214861973.322453087.1677791919-1488878016.1667664275\">reference number 6</a> repeatedly states that there is \"no evidence for a laboratory origin of SARS-CoV-2\", while citing arguments around the location of initial cases and phylogeny of SARS-CoV-2 as evidence for a zoonotic emergence. However, a survey of <a href=\"https://zenodo.org/record/4067919/files/BSL3_Labs_In_China.xlsx?download=1\">BSL-3 facilities in China</a> found that 53% of associated coronavirus-related Nature publications were produced by Wuhan-based labs between 2017 and 2019, and it is extremely implausible that Wuhan bears 50% of the risk for novel zoonotic virus emergence in all of China! (it's possible that the authors of that survey erred - the do seem ideologically committed to the lab leak theory). Furthermore, I have to the best of my ability evaluated arguments about the presence of the furin cleavage site in the SARS-CoV-2 genome and my conclusion is that it is around 5 times as likely to be present in the lab origin scenario (accounting the fact that the WIV is an author on a proposal to insert such sites into SARS-like coronaviruses; also, I consider anywhere from 1.1 to 20 times as likely to be plausible). One can debate the relative strength of different pieces of evidence - and many have - but the claim that there is evidence on one side and none on the other is not plausible in my view, and I at least don't trust &nbsp;anyone making such a claim is able to capably adjudicate questions about risks of certain kinds of pathogen research.<br><br>(not that it's especially relevant, but I currently think the case for zoonosis is slightly stronger than the case for a lab leak, I just don't think you can credibly claim that there's <i>no evidence</i> that supports the lab leak theory)</p><p><br>A little bit of proof reading</p><blockquote><p>stating confidentiality</p></blockquote><p>confidently</p><blockquote><p>You don’t likely don’t know more than professionals</p></blockquote><p>You likely don't know</p>", "parentCommentId": null, "user": {"username": "David Johnston"}}, {"_id": "23fYFzqCw2JaEcT2n", "postedAt": "2023-03-03T09:26:34.264Z", "postId": "HCuoMQj4Y5iAZpWGH", "htmlBody": "<p>Hi Elika,&nbsp;<br><br>Thanks for writing this, great stuff! &nbsp;</p><p>I would probably frame some things a bit differently (more below), but I think you raise some solid points, and I definitely support the general call for nuanced discussion.<br><br>I have a personal anecdote that really speaks to your \"do your homework point.\" When doing research for our <a href=\"https://journals.asm.org/doi/10.1128/mBio.01864-21\">2021 article</a> on dual-use risks (thanks for referencing it!) , I was really excited about our argument for implementing \"dual-use evaluation throughout the research life cycle, including the conception, funding, conduct, and dissemination of research.\" The idea that effective dual-use oversight requires intervention at multiple points felt solid, and some feedback we'd gotten on presentations of our work gave me the impression that this was a fairly novel framing.&nbsp;<br><br>It totally wasn't! NSABB called for this kind of oversight throughout the research cycle (at least) as early as 2007,&nbsp;<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefa02akmtijak\"><sup><a href=\"#fna02akmtijak\">[1]</a></sup></span>&nbsp;and, in hindsight, it was pretty naïve of me to think that this simple idea was new. In general, it's been a pretty humbling experience to read more of the literature and realise just how many of the arguments that I thought were novel based on their appearance in recent op-eds and tweets can be found in discussions from 10, 20, or even <a href=\"https://www.pnas.org/doi/abs/10.1073/pnas.72.6.1981\">50 years ago</a>.<br><br>Alright, one element of your post that I would've framed differently: You put a lot of emphasis on the <i>instrumental</i> benefits of nuanced discussion in the form of building trust and credibility, but I hope readers of your post also realise the <i>intrinsic</i> value of being more nuanced.</p><p>E.g., from the summary&nbsp;</p><blockquote><p>\"<i>[what you say] does impact how much you are trusted, whether or not you are invited back to the conversation, and thus the potential to make an impact</i>\"</p></blockquote><p>And the very last sentence:</p><blockquote><p>&nbsp;\"<i>Always make sure ‘you’re invited back to the table’.</i>\"&nbsp;</p></blockquote><p>This is a great point, and I really do think it's possible to burn bridges and lose respect by coming across as ignorant or inflammatory. But getting the nuanced details wrong is <i>also</i> a recipe for getting solutions wrong! As you say, proper risk-benefit analysis for concrete dual-use research is almost always difficult, given that the research in question very often has some plausible upside for pandemic preparedness or health more generally.</p><p>And even if you know what specific research to draw red lines around, implementation is riddled with challenges: How do you design rules that won't be obsolete with scientific advances? &nbsp;How do you make criteria that won't restrict research that you didn't intend to restrict? How do you avoid inadvertent attention hazards from highlighting the exact kinds of research that seem the most risky? Let's say you've defined the perfect rules. Who should be empowered to make the tough judgment calls on what to prohibit? If you're limiting access to certain knowledge, who gets to have that access? And so on, and so on.<br><br>I do think there's value in strongly advocating for more robust dual-use oversight or lab biosafety, and (barring infohazard concerns), I think op-eds aimed at both policymakers and the general public can be helpful. It's just that I think such advocacy should be more in the tone of \"Biosecurity is important, and more work on it is urgently needed\" and less \"Biosecurity Is Simple, I Would Just Ban All GOF.\"&nbsp;<br><br>Bottom line, I especially like the parts of your post that encourage people to <i>be</i> more nuanced, not just <i>sound</i> more nuanced.</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fna02akmtijak\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefa02akmtijak\">^</a></strong></sup></span><div class=\"footnote-content\"><p>From <a href=\"https://journals.asm.org/doi/full/10.1128/mBio.01236-15\">Casadevall 2015</a>: <i>\"In addition to defining the type of research that should elicit heightened concern, the NSABB recommended that research be examined for DURC potential throughout its life span, from experimental conception to final dissemination of the results.\"</i></p></div></li></ol>", "parentCommentId": null, "user": {"username": "jtm"}}, {"_id": "vCYaevEdDCrCnzTnh", "postedAt": "2023-03-03T10:04:49.986Z", "postId": "HCuoMQj4Y5iAZpWGH", "htmlBody": "<p>On “learning from people outside EA and those who slightly disagree with EA views” I highly recommend reading everything by Dr Filippa Lentzos: <a href=\"https://www.filippalentzos.com/\">https://www.filippalentzos.com/</a>.</p>\n<p>Also, subscribe to the Pandora Report newsletter:<br>\n<a href=\"https://pandorareport.org/\">https://pandorareport.org/</a></p>\n<p>Global Biodefense was great but sadly seems to have become inactive: <a href=\"https://globalbiodefense.com/\">https://globalbiodefense.com/</a></p>\n", "parentCommentId": null, "user": {"username": "freedomandutility"}}, {"_id": "XyPXA7nrCCRsHxfMn", "postedAt": "2023-03-03T16:51:25.134Z", "postId": "HCuoMQj4Y5iAZpWGH", "htmlBody": "<p>Strong +1!! Thanks :)</p>", "parentCommentId": "vCYaevEdDCrCnzTnh", "user": {"username": "ElikaSomani"}}, {"_id": "rigzbPYbaaYcYuoXB", "postedAt": "2023-03-04T00:40:06.474Z", "postId": "HCuoMQj4Y5iAZpWGH", "htmlBody": "<p>I'm not that knowledgeable on the biosecurity field, but from afar I've thought that working biosecurity EAs tend to be some of the more collaborative, professional, and respectful of non-EA contributions. And this post is an example of that, thanks for sharing.</p>\n<p>Do you have any additional sources you'd recommend? Things you didnt add to the initial list for whatever reason? I'd like to read widely on this topic.</p>\n", "parentCommentId": null, "user": {"username": "Masha Winchell"}}, {"_id": "NQYzNjxqMRHqZpFFy", "postedAt": "2023-03-05T07:02:24.050Z", "postId": "HCuoMQj4Y5iAZpWGH", "htmlBody": "<p>This is a perfectly reasonable point to bring up, and I agree that we should critically consider whether or not policy and regulation in the field is adequate. &nbsp;I want to emphasize some ways that high-risk biological research differs from finance, nuclear weapons, and money laundering.</p><ul><li>First, people don't do gain of function research (or whatever we ought to call it) for profit, so imposing gigantic fines, the threat of jail time, and constant severe scrutiny would be tantamount to banning it outright. Likewise, private companies are pursuing profits when they build nuclear weapons. Medicine is, of course, heavily regulated, and once again it is the profit motive that allows the industry to thrive even in such a heavily regulated context.</li><li>Soldiers operating and maintaining nuclear weapons have given permission for the military to exert extremely intrusive control over their activities. Some of the best and brightest scientists worked for the military as an act of patriotic service to build the nuclear bomb during WWII. However, the Manhattan Project was aimed at a specific engineering outcome, while GoF research would be an ongoing effort with no \"definition of done,\" and it might be hard to convince an adequate number of high-quality scientists to sign up for such strict controls if it was for their entire careers.</li><li>Money laundering is a crime, so it is not \"regulated\" but policed. Nobody but terrorists would do gain of function research if it was illegal.</li></ul><p>For a person who'd like to see gain of function research banned, any move to regulate it and punish violations would be a step in the right direction. However, those who'd like to enforce responsible behavior, perhaps by using regulations on part with those you describe, have to explain how they'd motivate already-beleaguered scientists to do GoF research when their proposal is \"even more stick, still no carrot.\"</p><p>I'm curious to know whether and to what extent we've considered ways to reward basic science researchers for making pandemic-mitigating discoveries in a public health context. Is there a way we can reward people for achieving the maximum public health benefit with the minimum risk in their research?</p>", "parentCommentId": "W8nm4t6RGfrEqbz9s", "user": {"username": "AllAmericanBreakfast"}}, {"_id": "nHadJaosMzkTphFdG", "postedAt": "2023-03-05T17:30:35.115Z", "postId": "HCuoMQj4Y5iAZpWGH", "htmlBody": "<blockquote><p>Money laundering is a crime, so it is not \"regulated\" but policed. Nobody but terrorists would do gain of function research if it was illegal.</p></blockquote><p>Money laundering is a crime, one which the government primarily combats using AML (Anti Money Laundering) regulations. This apply to essentially all financial companies, and require them to evaluate their clients and counterparties for money laundering risk. If a bank facilitates money laundering it can be punished for this even if it didn't want to do it; all that is required for AML violations is that the bank didn't try hard enough to avoid accidentally helping launder money. These regulations are a big deal, with very large number of people employed in their enforcement and large fines for violations. It is much easier to fine a bank than it is to fine the underlying money launderer. AML rules are effectively a way for governments, which are not really capable of catching money laundering, to outsource the expense and difficulty.</p><p>The equivalent here would be if medical equipment companies, reagent companies, lab animal companies had to do due diligence on researchers and were liable if they lacked sufficient processes to ensure they didn't sell supplies to researchers who performed dangerous experiments. As with AML, this allows the government to impose large fines on for-profit companies (which it can easily force to pay) over smaller, potentially judgement-proof labs, which still achieving much the same goal.</p>", "parentCommentId": "NQYzNjxqMRHqZpFFy", "user": {"username": "Larks"}}, {"_id": "tABKwys9kyEnbqpwa", "postedAt": "2023-03-05T22:26:38.024Z", "postId": "HCuoMQj4Y5iAZpWGH", "htmlBody": "<p>That's a helpful reframing, thank you. I think there is still a disconnect between the two cases, however. As money laundering is a crime, companies have a relatively simple task before them: to identify and eliminate money laundering.</p><p>By contrast, GoF research is not a crime, and the objective, from a \"responsibly pro-GoF\" point of view, is to improve the risk/reward ratio to an acceptable level. A company would be likely to be highly conservative in making these judgments, as they would capture none of the benefits of successful and informative GoF research, but would be punished for allowing overly risky or failed GoF research to go forward. In other words, companies would likely refuse to sell to GoF research entirely in order to minimize or eliminate their risk.</p><p>The problem is even more acute if the work of evaluating GoF research was foisted onto companies. Scientists might be motivated by curiosity, altruism, or a desire for scientific credit, so there is at least some reward to be had even if GoF research were much more stringently regulated. By contrast, regulating companies in the manner you propose would come with no incentive whatsoever for companies to sell to GoF research, thus effectively banning it.</p>", "parentCommentId": "nHadJaosMzkTphFdG", "user": {"username": "AllAmericanBreakfast"}}, {"_id": "LB4u4ydceT7BxLLX9", "postedAt": "2023-03-06T01:04:52.655Z", "postId": "HCuoMQj4Y5iAZpWGH", "htmlBody": "<blockquote><p>I was curious about your suggestion that a lot of researchers think that basically all biomedical research is gain/loss of function.</p></blockquote><p>Not completely clear on what the context the researchers were speaking to but a standard strategy in figuring out what genes do is to knock out (loss of function) the gene of interest in a model organism and observe what happens. Synthetic biology also has a lot of 'gain of function' engineering e.g. make microbes produce insulin.</p>", "parentCommentId": "W8nm4t6RGfrEqbz9s", "user": {"username": "chelsea_liang"}}, {"_id": "rB7irMvZRMy4WKazL", "postedAt": "2023-03-06T04:56:24.527Z", "postId": "HCuoMQj4Y5iAZpWGH", "htmlBody": "<p>I think actually the analogy extends even here!&nbsp;</p><p>What exactly is money laundering is not always black and white, and financial firms do not have anything like certainty about whether any given person, entity or transaction is guilty. Instead they adopt a series of rules that, on average, reduce money laundering, but not to zero, and there are false positives. These especially effect low income people, immigrants, those with little documentation, and people with unusual situations. AML rules directly contribute to the problem of people being unbanked (lacking access to the formal financial system, being reliant on cheque cashers etc.) - the government knows this and accepts it as a necessary cost.&nbsp;</p><p>Similarly, I would imagine that not all GoF research would be illegal - but some would, and governments could deputize firms to help to differentiate. This would disrupt some legitimate researchers but could be generally regarded by policymakers as an acceptable price to pay.</p><p>Clearly there are some dis-analogies. There are many fewer biomedical researchers than money transfers, which makes in-depth evaluation of each one more viable. And as you noted the (financial and otherwise) benefit of research is more distant from the people undertaking it. I'm not trying to make a strong claim that this is a particularly good model for GoF regulation; just noting that I think researchers don't realize quite how unregulated they are relative to other industries.&nbsp;</p>", "parentCommentId": "tABKwys9kyEnbqpwa", "user": {"username": "Larks"}}, {"_id": "jBx6KBmxC3E48p7Bu", "postedAt": "2023-03-06T06:58:13.597Z", "postId": "HCuoMQj4Y5iAZpWGH", "htmlBody": "<p>It's important to keep in mind that while money laundering is typically carried out by profit-seeking criminals who take advantage of complex financial transactions to hide their illegal activities, GoF research is not driven by financial gain. Therefore, we need to consider the unique nature of GoF research when assessing the need for regulation.</p><p>It's not just a matter of how much regulation is in place, but also about finding a balance between the pressures to engage in the research and a regulatory framework that effectively manages any potential risks. If there's an inadequate regulatory apparatus in place relative to the pressures to participate, then the field is \"underregulated.\" Conversely, if there's too much regulation, the field may be at risk of becoming \"overregulated.\"</p><p>Given the significant risks associated with GoF research, it requires a high level of regulation compared to other public service research areas that have similarly limited pressures to participate. However, because profit is not a driving force, the field can only tolerate a certain amount of regulation before participation becomes difficult.</p><p>Rather than focusing on increasing regulation dramatically or maintaining the status quo, we should look to refine and improve regulation for GoF research. While some scope exists to tighten regulations, excessive regulation could stifle the field altogether, which may or may not be desirable. If we wish the field to continue while enhancing the risk-benefit ratio, our focus should be on regulating the field proportionately to the pressures to participate.</p><p>It's time to shift the discussion from \"how regulated is the field\" to \"how regulated is the field relative to the pressures to participate.\" By doing so, we can strike a balance between promoting the field's progress and ensuring appropriate risk management.</p>", "parentCommentId": "rB7irMvZRMy4WKazL", "user": {"username": "AllAmericanBreakfast"}}, {"_id": "LiM3tgfctdKzBMEEj", "postedAt": "2023-03-07T06:22:05.799Z", "postId": "HCuoMQj4Y5iAZpWGH", "htmlBody": "<p>Just echoing the experience of \"it's been a pretty humbling experience to read more of the literature\"; biosecurity policy has a long history of good ideas and nuanced discussions. On US gain-of-function  policy in particular, I found myself particularly humbled by the 2015 article <a href=\"https://www.nature.com/articles/nrmicro3405\">Gain-of-function experiments: time for a real debate</a>, an adversarial collaboration between researchers involved in controversial viral gain-of-function work and biosecurity professionals who had argued such work should face more scrutiny. It's interesting to see where the contours of the debate have changed and how much they <em>haven't</em> changed in the past 7+ years.</p>\n", "parentCommentId": "23fYFzqCw2JaEcT2n", "user": {"username": "tessa"}}, {"_id": "4KYc7EAGkJ8GhnG6u", "postedAt": "2023-03-07T06:40:34.116Z", "postId": "HCuoMQj4Y5iAZpWGH", "htmlBody": "<p>Thanks for this post! I agree with your point about being careful on terms, and thought it might be useful to collect a few definitions together in a comment.</p>\n<h3>DURC (Dual-Use Research of Concern)</h3>\n<p>DURC is defined differently by different organizations. The <a href=\"https://www.who.int/news-room/questions-and-answers/item/what-is-dual-use-research-of-concern\">WHO defines</a> it as:</p>\n<blockquote>\n<p>research that is intended to provide a clear benefit, but which could easily be misapplied to do harm</p>\n</blockquote>\n<p>while the definition given in the <a href=\"https://www.phe.gov/s3/dualuse/Pages/USGOversightPolicy.aspx\">2012 US government DURC policy</a> is:</p>\n<blockquote>\n<p>life sciences research that, based on current understanding, can be reasonably anticipated to provide knowledge, information, products, or technologies that could be directly misapplied to pose a significant threat with broad potential consequences to public health and safety, agricultural crops and other plants, animals, the environment, materiel, or national security</p>\n</blockquote>\n<h3>ePPP (enhanced Potential Pandemic Pathogen)</h3>\n<p>ePPP is a term (in my experience) mostly relevant to the US regulatory context, and was set out in the <a href=\"https://www.phe.gov/s3/dualuse/Documents/P3CO.pdf\">2017 HHS P3CO Framework</a> as follows:</p>\n<blockquote>\n<p>A potential pandemic pathogen (PPP) is a pathogen that satisfies both of the following:</p>\n<ol>\n<li>It is likely highly transmissible and likely capable of wide and uncontrollable spread in human populations; and</li>\n<li>It is likely highly virulent and likely to cause significant morbidity and/or mortality in humans.</li>\n</ol>\n<p>An enhanced PPP is defined as a PPP resulting from the enhancement of the transmissibility\nand/or virulence of a pathogen. Enhanced PPPs do not include naturally occurring pathogens\nthat are circulating in or have been recovered from nature, regardless of their pandemic\npotential.</p>\n</blockquote>\n<p>One way in which this definition has been criticized (quoting the recent <a href=\"https://osp.od.nih.gov/wp-content/uploads/2023/03/NSABB-Final-Report-Proposed-Biosecurity-Oversight-Framework-for-the-Future-of-Science.pdf\">NSABB report</a> on updating the US biosecurity oversight framework) is that \"research involving the enhancement of pathogens that do not meet the PPP definition (e.g., those with low or moderate virulence) but is anticipated to result in the creation of a pathogen with the characteristics described by the PPP definition could be overlooked.\"</p>\n<h3>GOF (Gain-of-Function)</h3>\n<p>GOF is not a term that I know to have a clear definition. In the linked <a href=\"https://journals.asm.org/doi/10.1128/mBio.00188-23\">Virology under the microscope</a> paper, examples range from making Arabidopsis (a small flowering model plant) more drought-resistant to making H5N1 (avian influenza) transmissible between mammals. I suggest avoiding this term if you can. (The paper acknowledges the term is fuzzily defined, citing <a href=\"https://www.nature.com/articles/d41586-021-02903-x\">The shifting sands of ‘gain-of-function’ research</a>.)</p>\n<h3>Biosafety, biosecurity, biorisk</h3>\n<p>The definitions you gave in the footnote seem solid, and similar to the ones I'd offer, though one runs into competing definitions (e.g. the definition provided for biosafety doesn't mention unintentional exposure). I will note that EA tends to treat \"biosecurity\" as an umbrella term for \"reducing biological risk\" in a way that doesn't reflect its usage in the biosecurity or public health communities. Also, as far as I can tell, <a href=\"https://www.biosecurity.gov.au/\">Australia means a completely different thing</a> by \"biosecurity\" than the rest of the English-speaking world, which will sometimes lead to confusing Google results.</p>\n", "parentCommentId": null, "user": {"username": "tessa"}}, {"_id": "v65rMK83QZWj4mEnD", "postedAt": "2023-03-07T21:48:55.936Z", "postId": "HCuoMQj4Y5iAZpWGH", "htmlBody": "<p>Thanks! I don't have any other one's I broadly recommend but happy to share topic specific resources if there's something in particular you're interested in.&nbsp;</p>", "parentCommentId": "rigzbPYbaaYcYuoXB", "user": {"username": "ElikaSomani"}}, {"_id": "4EvjXBiTmTg5ogDii", "postedAt": "2023-03-07T21:53:08.690Z", "postId": "HCuoMQj4Y5iAZpWGH", "htmlBody": "<p>Thanks!! This is great additional detail.</p>", "parentCommentId": "4KYc7EAGkJ8GhnG6u", "user": {"username": "ElikaSomani"}}, {"_id": "HGFdTeouZwDHu5Fxk", "postedAt": "2023-03-07T21:57:30.532Z", "postId": "HCuoMQj4Y5iAZpWGH", "htmlBody": "<p>Thanks! I do broadly agree with your points. I linked &nbsp;<a href=\"https://journals.asm.org/doi/10.1128/mBio.00188-23?_ga=2.214861973.322453087.1677791919-1488878016.1667664275\">reference 6 </a>as an example of the benefits and nuances of dual-use research, but don't / shouldn't comment on COVID-19 origins and their views expressed on it.</p>", "parentCommentId": "vYwgzWtyMKtGezJcd", "user": {"username": "ElikaSomani"}}, {"_id": "2gnXmk7NeWHNG6LYL", "postedAt": "2023-03-07T21:58:53.455Z", "postId": "HCuoMQj4Y5iAZpWGH", "htmlBody": "<p>Great! Might reach out in a few weeks (when I plan to dive into bio resources)</p>", "parentCommentId": "v65rMK83QZWj4mEnD", "user": {"username": "Masha Winchell"}}, {"_id": "xm4viGSS5Zw7HCrwJ", "postedAt": "2023-03-07T22:00:20.853Z", "postId": "HCuoMQj4Y5iAZpWGH", "htmlBody": "<p>Thanks!! Strongly agree on your points of the intrinsic value of understanding and being nuanced in this space, I just didn't have the words to frame it as well as you put it :)</p>", "parentCommentId": "23fYFzqCw2JaEcT2n", "user": {"username": "ElikaSomani"}}, {"_id": "TRqcLb4jACBYdzyei", "postedAt": "2023-03-07T22:07:26.621Z", "postId": "HCuoMQj4Y5iAZpWGH", "htmlBody": "<p>Hi, thanks for the comments! Some broad thoughts in response:</p><p>Re</p><blockquote><p>My impression is that one of the key defenses that the Fauci/NIH/EcoHealth/etc. offered for their research in Wuhan was that it was <a href=\"https://theintercept.com/2021/09/09/covid-origins-gain-of-function-research/\">technically not Gain of Function</a>, even if some parts of it might sound like Gain of Function to the layperson, which seems in tension with this claim. Do you think they were wrong about this?</p></blockquote><p>It's hard for me to go into detail on a public platform on this (just to be cautious to my job) but I can broadly say that there's a difference between research that is a) gaining a function, b) gain-of-function as defined by informal norms in the biomedical community, and c) what is formally DURC / GoF research as defined by U.S. government policy. The EcoHealth grants fall confusingly as or as not GoF depending on how GoF is defined.&nbsp;</p><p>Re</p><blockquote><p>Speaking as an outsider, the amount of regulation on what you refer to as ePPP (adding functionality to make diseases more dangerous) seems shockingly low. The <a href=\"https://journals.asm.org/doi/10.1128/mBio.00188-23?_ga=2.214861973.322453087.1677791919-1488878016.1667664275\">article you link to</a> tries to make it sound like there are a lot of safeguards, but it seems to me like virtually all the steps only apply if you are seeking federal funding. This is not a standard we accept in other areas! If you are making a car, or building a nuclear power plant, or running a bank or airline, you have to accept extremely intrusive regulation regardless of your funding, and for many things - like nuclear weapons or money laundering - US regulation has world-wide reach.&nbsp;</p></blockquote><p>I fully agree! I think there are many concrete needs in this space including legal regulation over DURC /ePPP/GoF research in the U.S. particularly but also &nbsp;every country that practices such research. To achieve such regulation requires a ton of work, consensus building, and thought into what constructive regulation that captures risk while not alienating / shutting down an entire research field &nbsp;is tough and part of the nuances that I think we as a community need to work towards</p>", "parentCommentId": "W8nm4t6RGfrEqbz9s", "user": {"username": "ElikaSomani"}}, {"_id": "PqdBxRZnFEagwg7F7", "postedAt": "2023-03-17T20:26:19.720Z", "postId": "HCuoMQj4Y5iAZpWGH", "htmlBody": "<p>Great post! This matches closely with the lessons I've learned and advice I've given after working with virologists and biosafety professionals. I'd also give a plug for the book<a href=\"https://a.co/d/eNKZJss\"> Biosecurity Dilemmas </a>for anyone who wants to do a deeper dive in the trade offs in this space.</p>", "parentCommentId": null, "user": {"username": "James Montavon"}}, {"_id": "xSb3RZc9j76qRNEd7", "postedAt": "2023-03-30T19:54:57.561Z", "postId": "HCuoMQj4Y5iAZpWGH", "htmlBody": "<blockquote><p>My impression is that one of the key defenses that the Fauci/NIH/EcoHealth/etc. offered for their research in Wuhan was that it was <a href=\"https://theintercept.com/2021/09/09/covid-origins-gain-of-function-research/\">technically not Gain of Function</a>, even if some parts of it might sound like Gain of Function to the layperson, which seems in tension with this claim.</p></blockquote><p>It not only sounds that way to a lay-person. The NIH stopped the EcoHealth grant that was partly paying for the research in Wuhan for a short time in 2016. When they renewed the grant <a href=\"https://blog.whitecoatwaste.org/2021/11/04/bombshell-wcw-foia-investigation-proves-nih-ignored-gof-research-wuhan-lab-funder-calls-it-terrific/\">Peter Dasek</a> from EcoHealth wrote back:</p><p>\"This is terrific! We are very happy to hear that our Gain of Function research funding pause has been lifted.\"</p><p>Fauci himself wrote on the 1st February 2020 and email that had one of the study in the attachment with the file name \"Baric, Shi et al - Nature medicine - SARS Gain of function\".</p><p>What Fauci/NIH/EcoHealth is saying seems to be something like \"when people say 'gain of function' they really mean ePPP and the research they funded in Wuhan wasn't ePPP because we never put it through the P3O process that could have decided that it was an ePPP\".</p>", "parentCommentId": "W8nm4t6RGfrEqbz9s", "user": {"username": "ChristianKleineidam"}}, {"_id": "gandBMoFpCa9tXGqy", "postedAt": "2023-03-30T20:04:47.959Z", "postId": "HCuoMQj4Y5iAZpWGH", "htmlBody": "<p>The international community funded a database of Coronaviruses that was held by the lab in Wuhan. In September 2019, the month when the Chinese military overtook the lab, that database was taken offline.</p><p>If that database would have been important for pandemic prevention and vaccine development, I would have expected the virologists to write OPs publically calling on China to release the data. That they didn't is a clear statement about what they think for how useful that data is for pandemic prevention and how afraid they are that people look critically at the Wuhan Institute of Virology.</p><blockquote><p>I'm curious to know whether and to what extent we've considered ways to reward basic science researchers for making pandemic-mitigating discoveries in a public health context.&nbsp;</p></blockquote><p>The virologists seemed to ignore the basic science questions such as \"How do these viruses spread?\" and \"Are they airborne?\" that actually mattered.&nbsp;</p><p>Asking those questions would mean doing more biomedical research that isn't gain of function and loss of function.</p><blockquote><p>have to explain how they'd motivate already-beleaguered scientists to do GoF research when their proposal is \"even more stick, still no carrot.\"</p></blockquote><p>That assumes that it's important to motivate them to do GoF research. It seems that research served for them as a distraction from doing the relevant research.&nbsp;</p>", "parentCommentId": "NQYzNjxqMRHqZpFFy", "user": {"username": "ChristianKleineidam"}}, {"_id": "HrhnjMbb7mempNCBk", "postedAt": "2023-03-31T00:52:27.801Z", "postId": "HCuoMQj4Y5iAZpWGH", "htmlBody": "<blockquote><p>If that database would have been important for pandemic prevention and vaccine development, I would have expected the virologists to write OPs publically calling on China to release the data. That they didn't is a clear statement about what they think for how useful that data is for pandemic prevention and how afraid they are that people look critically at the Wuhan Institute of Virology.</p></blockquote><p>Are you sure that virologists didn't write such OPs?</p><blockquote><p>The virologists seemed to ignore the basic science questions such as \"How do these viruses spread?\" and \"Are they airborne?\" that actually mattered.&nbsp;</p></blockquote><p>My understanding is that in the US, they actually studied these questions hard and knew about things like airborn transmission and asymptomatic spread pretty early on, but were suppressed by the Trump administration. That doesn't excuse them - they ought to have grown a spine! - but it's important to recognize the cause of failure accurately so that we can work on the right problem.</p>", "parentCommentId": "gandBMoFpCa9tXGqy", "user": {"username": "AllAmericanBreakfast"}}, {"_id": "L9DCsGq8Xyrtbg8aq", "postedAt": "2023-04-05T16:48:38.579Z", "postId": "HCuoMQj4Y5iAZpWGH", "htmlBody": "<blockquote><p>Are you sure that virologists didn't write such OPs?</p></blockquote><p>Pretty much, when I googled about the fact that they took down the database I found no such OPeds. If you have any evidence to the contrary I would love to see it.</p><p>If you talk about that it's wrong that they took down the database that points to the fact that the early lab leak denial was bullshit and the virologists cared nobody finding out that the arguments they made were bullshit. &nbsp;</p><p>Jeremy Farrar describes in his book that one of the key arguments they used to reject the lab leak theory as the huge distance from the openly published sequences to the COVID-19 sequence. That argument becomes a lot weaker when you factor in that the military overtook the lab in September 2019 and at that month they took down their database.</p><p>The virologists cared more about keeping the public uninformed about what happened at the Wuhan Institute for Virology than they cared about the database being available to help for fighting the pandemic.&nbsp;</p><blockquote><p>My understanding is that in the US, they actually studied these questions hard and knew about things like airborn transmission and asymptomatic spread pretty early on, but were suppressed by the Trump administration.</p></blockquote><p>Knowing that airborne transmission matters has consequences about what actions you want to take.&nbsp;</p><p>When the Japanese health authorities advice at the beginning of the pandemic to avoid closed spaces with poor ventilation US and EU authorities didn't give that advice.&nbsp;</p><p>I find it pretty unlikely that Fauci et al didn't give the same advice of avoiding closed spaces that the Japanese authorities gave out because the Trump administration didn't want them to tell people to avoid closed spaces but the Trump administration preferred the advice of telling people to wash their hands.&nbsp;</p><p>One of the corollaries of \"avoid closed spaces with poor ventilation\" is that forbidding people from meeting each other outside is bad policy.&nbsp;</p><p>The 1.5 meter distance recommendation makes little sense with airborne spread but was quite central for pandemic guidance.&nbsp;</p><p>There's some research that suggests that flu transmission can be reduced in school by controlling the humidity level. There's a good chance that you can also reduce COVID-19 transmission by controlling indoor humidity but the virologists didn't care enough about doing the basic research to establish that to get a policy in place that all public buildings get humidity controlled.&nbsp;</p><p>There was no ramp-up of indoor ventilation production at the start of the pandemic but it would have been the reasonable step if the problem would have been seen as one of airborne transmission.&nbsp;</p><p>The WHO took two years to acknowledge airborne transmission. If the virologist community would have done their job, they would have explained to the WHO early on that it has to acknowledge airborne transmission or be branded by the virologists as science deniers.&nbsp;</p>", "parentCommentId": "HrhnjMbb7mempNCBk", "user": {"username": "ChristianKleineidam"}}, {"_id": "7yr6Jqu3588sKxsim", "postedAt": "2023-03-03T00:54:41.884Z", "postId": "HCuoMQj4Y5iAZpWGH", "htmlBody": null, "parentCommentId": null, "user": null}]