[{"_id": "quMidcZDfeqQNJdLx", "postedAt": "2023-07-07T17:30:08.449Z", "postId": "HdzcvrDnKnkQ65MW2", "htmlBody": "<p>In the face of such a negative reaction I would probably just continue to eat meat around your family and (optionally) donate to some animal welfare charities. Personally abstaining some fraction of the time isn't that impactful and it seems very costly to you/your family.</p>", "parentCommentId": null, "user": {"username": "Larks"}}, {"_id": "LQRRztgXjejsLfjxc", "postedAt": "2023-07-07T21:16:20.899Z", "postId": "HdzcvrDnKnkQ65MW2", "htmlBody": "<p>Interesting post; thanks for raising this issue of how EA might fit (or not fit) with Eastern cultures.</p><p>I think that the concepts of 'ren', 'mianxi', 'li', &nbsp;'guanxi', and 'Confucian filial piety' can often sound more alien than they really are. All of them have pretty close analogs in Western societies, I think, because they're all based in human social and familial instincts. So I'm not sure how 'deep' EA vs. Eastern culture mismatches really go. I doubt that they're reflecting some fundamentally different psychology of family life or social network structure.&nbsp;</p><p>Rather, I suspect that a lot of EA values, norms, strategies, tactics, etc are implicitly shaped by specific cultural norms in the US and UK, such as a higher average tolerance for ethical disagreements within close family members or with peer groups and coworkers (e.g. it's a tradition in American extended families to argue about politics during Thanksgiving holiday meals).&nbsp;</p><p>As you point out, shared meat-eating at communal tables has become quite a strong signal of being a good and generous host in Chinese culture, especially since the rapid increase in prosperity (and meat-eating) in the last four decades. So, making a fuss about being a vegan in that context might create tension -- not so much because Confucian filial piety is stronger than the Western ethos of 'honor they father and mother' -- but rather, just because there's this cultural link between meat-sharing, family meals, and social gratitude.</p>", "parentCommentId": null, "user": {"username": "geoffreymiller"}}, {"_id": "NkC7LKW9Jobr3moGL", "postedAt": "2023-07-08T12:54:02.170Z", "postId": "HdzcvrDnKnkQ65MW2", "htmlBody": "<p>Hi! This is a common action by many and at times me as well. I agree the disutility of conflict is perhaps not worth the gain in reduced suffering when I’ve already cut meat out of my diet ~95% of the time. Really appreciate your comment! I think it’s a hard bullet to bite and the post’s was to highlight how some actions prevalent in EA can be significantly harder for some.</p>\n", "parentCommentId": "quMidcZDfeqQNJdLx", "user": {"username": "Bill!"}}, {"_id": "ofMJYRwWuEJCyYfoK", "postedAt": "2023-07-08T12:56:16.500Z", "postId": "HdzcvrDnKnkQ65MW2", "htmlBody": "<p>Hi! This makes sense. I think the average higher tolerance of certain ideals in the UK/US and the following EA ideals still make it harder for significant groups of people to undertake the same actions which I hope EA at times can recognise.</p>\n", "parentCommentId": "LQRRztgXjejsLfjxc", "user": {"username": "Bill!"}}, {"_id": "j4J3vm9amG43EtXma", "postedAt": "2023-07-09T00:55:18.408Z", "postId": "HdzcvrDnKnkQ65MW2", "htmlBody": "<p>Makes sense, thanks for sharing such an interesting post!</p>", "parentCommentId": "NkC7LKW9Jobr3moGL", "user": {"username": "Larks"}}, {"_id": "TPjyczqJHPsFJgmwW", "postedAt": "2023-07-09T01:17:45.691Z", "postId": "HdzcvrDnKnkQ65MW2", "htmlBody": "<p>Thank you for this post. I agree that EA’s moral roots are very weird to almost everyone, but it’s for that reason that I’m unclear why the “Western-Eastern” dichotomy needed to be invoked? I imagine vegetarianism has been poorly received by many Western parents/families too.</p>\n<p>Many of the philosophical ideas that underpin EA are also very close to those found in some “Eastern/Asian” traditions, including Mohism, Buddhism and Jainism (edit: and Hinduism). Asia probably had the first recorded consequentialist (Mozi, in China), the first recorded utilitarian (Santideva, in India) and the first recorded vegan (al-Ma'arri, in Syria) in history. And estimates vary, but India probably has the highest prevalence of vegetarianism in the world?</p>\n", "parentCommentId": null, "user": {"username": "JBentham"}}, {"_id": "dPb2aqyAHpn7waNvB", "postedAt": "2023-07-09T12:29:24.106Z", "postId": "HdzcvrDnKnkQ65MW2", "htmlBody": "<blockquote><p>Many of the philosophical ideas that underpin EA are also very close to those found in some “Eastern/Asian” traditions, including Mohism, Buddhism and Jainism.</p></blockquote><p>Just want to point out that all of these schools of thought are minorities (maybe even unpopular) in their original countries. It seems to me that the stories of these schools of thoughts with similarities to EA ideas having a hard time in their original countries might be evidence supporting, rather than against, the notion that \"the East\" (I do have troubles with the use of the \"East/West divide after discussing with some) doesn't take EA ideas well.</p><p>There's a nuance though, Buddhism, despite being not very successful in India, is a huge success in China. But my understanding is that, very naively speaking and oversimplifying, Buddhism had to lose a lot of ideas that we recognize as \"EA-similar\" in order to become successful in China. One of the ideas is \"caring about actually doing good rather than just wanting to do good\". And maybe it isn't only lost, but flipped. In China and Taiwan, from my observation, Buddhists' most common attitude to altruism is \"if your intention is good then it's good, the consequence doesn't matter\".</p>", "parentCommentId": "TPjyczqJHPsFJgmwW", "user": {"username": "tseyipfai@gmail.com"}}, {"_id": "Gqf7P8D8dd68BoT6k", "postedAt": "2023-07-09T12:37:52.933Z", "postId": "HdzcvrDnKnkQ65MW2", "htmlBody": "<p>Not suggesting people should learn from me, just saying what I did.&nbsp;</p><p>I got similar reactions from my family and what I did was keep reducing the number of animals I abstain from (originally I thought crustaceans can't suffer, so I kept eating them but eventually I told my family that I won't eat them either, and then I later cut even bivalves to become full vegan). Besides sticking with my dietary choice, I kept engaging in debates with them. I even have to distance myself a bit from them. It was a few painful years, but they have eventually accepted my change and even got influenced by me. Two of my family members reduced thei consumption of animal products (one became vegetarian), my mother agrees to slaughter fish in more humane ways.</p><p>I think the calculus doesn't only involve the suffering induced vs hassle caused by the conflicts. The value one signals might be significant, or maybe the dominant effect in some cases.</p>", "parentCommentId": "quMidcZDfeqQNJdLx", "user": {"username": "tseyipfai@gmail.com"}}, {"_id": "dWLBY7dSH2hFXKwax", "postedAt": "2023-07-09T12:48:21.821Z", "postId": "HdzcvrDnKnkQ65MW2", "htmlBody": "<p>Grew up in a Chinese Singaporean family and I always find the \"against vegetarianism\" thing a strange thing to learn about other Chinese families because a lot of my relatives growing up (grandmother, greatgrandmother, etc) were vegetarian by way of Buddhism! And now my immediate family is mostly vegetarian (only eats fish sometimes), partly to be healthier, and partly because they never liked red meat very much, but I think the Chinese Buddhist cultural and ethical background also helped.</p>\n", "parentCommentId": null, "user": {"username": "xuan"}}, {"_id": "eWYyGQENWJ2RW6v2y", "postedAt": "2023-07-09T12:52:42.253Z", "postId": "HdzcvrDnKnkQ65MW2", "htmlBody": "<p>I also avoid the \"Eastern\" label for similar reasons that others have raised, but if we're just speaking about the Chinese cultural and ethical context, there is a longstanding practice of giving up family ties in service of more universal end (albeit one that is often met by opposition) -- shaving one's head and becoming a monastic!</p>\n", "parentCommentId": "dWLBY7dSH2hFXKwax", "user": {"username": "xuan"}}, {"_id": "jfhLNAfvAjm5kkXfz", "postedAt": "2023-07-09T14:16:52.272Z", "postId": "HdzcvrDnKnkQ65MW2", "htmlBody": "<p>Yes, I probably should have mentioned Hinduism too, because that is after all what explains the prevalence of vegetarianism in India.</p>\n<p>I do again agree that the East doesn’t take EA ideas well. But neither, unfortunately, does the West, despite being much wealthier and better educated on average. Even people within the existing community find it difficult to commit to impartiality.</p>\n", "parentCommentId": "dPb2aqyAHpn7waNvB", "user": {"username": "JBentham"}}, {"_id": "AyCCLJa7wYvEtSkFX", "postedAt": "2023-07-09T15:57:22.417Z", "postId": "HdzcvrDnKnkQ65MW2", "htmlBody": "<p>Agreed. I'm reminded of when I was writing my undergraduate thesis and researching the practice of Buddhists releasing captured animals in order to generate good karma, which (at least among these Thai/Dai Buddhists) involved a vibrant market for capturing the animals. That is the story that spring to my mind regarding the \"Buddhism tends to be more focused on individual karma than on good for all\" narrative.</p>", "parentCommentId": "dPb2aqyAHpn7waNvB", "user": {"username": "jlemien"}}, {"_id": "ENkCXLeGwyAgkfKYw", "postedAt": "2023-07-09T16:15:28.265Z", "postId": "HdzcvrDnKnkQ65MW2", "htmlBody": "<p>While it is true that Mohism originated in China, it isn't very popular. Indeed, people cared for it so little that it was almost lost to history: \"<a href=\"https://plato.stanford.edu/entries/mohism/#historical\">Mozi and his school fell into neglect and obscurity, their texts largely unread. Centuries later, the bulk of the Mozi was nearly lost to history, surviving only because it had been copied into a massive collection of Daoist scripture.</a>\"</p><p>I suspect that utilitarianism (or similar <i>not focused on the self and social connections</i> ideas) are even less popular in China than in the USA &amp; the United Kingdom. As a single data point, this is an excerpt of text I saved several years ago regarding charitable giving and volunteering in China.</p><blockquote><p>For the 2016 World Giving Index, the foundation polled an average of 1,000 people in 140 different countries or regions, asking them if in the last month they had helped a stranger, donated money to charity or volunteered their time. While donating time and money to charitable causes is becoming more and more popular around the world, the situation is still not pretty in China, which ranked 140th out of 140 in the poll...</p><p>Meanwhile, just 6% of Chinese said they had donated to charity, placing China at 138th in the world, behind only Yemen and Morocco. Finally, only 6% of Chinese said they had volunteered their time, once again ranking China 138th.</p></blockquote><p>I'm also reminded of a display from the Exploratorium, showing how willing people in different countries are to help strangers. This isn't an area I've read much about, but I suspect that the cultures we grow up with affect behavior more than more people acknowledge.</p><figure class=\"image\"><img src=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/ENkCXLeGwyAgkfKYw/wwjxvlhpypc1pgljbwlb\" srcset=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/ENkCXLeGwyAgkfKYw/wxyj19x4keksikrcijp5 410w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/ENkCXLeGwyAgkfKYw/zthh6vqauntpnzuh83tz 820w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/ENkCXLeGwyAgkfKYw/ij43fybmohx6nlvyypxr 1230w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/ENkCXLeGwyAgkfKYw/er1bwhfp7fypomz9ldap 1640w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/ENkCXLeGwyAgkfKYw/h8jwsnruw86gzlvitgue 2050w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/ENkCXLeGwyAgkfKYw/epphyxkft5vpwx2mcvgs 2460w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/ENkCXLeGwyAgkfKYw/aoojysjqwqvz48nsx767 2870w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/ENkCXLeGwyAgkfKYw/qw3u9dit7xm5u7qhgt1k 3280w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/ENkCXLeGwyAgkfKYw/e8nprbir3aesyqkqojmx 3690w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/ENkCXLeGwyAgkfKYw/mctmcck7m88vftwpmqzk 4032w\"></figure>", "parentCommentId": "TPjyczqJHPsFJgmwW", "user": {"username": "jlemien"}}, {"_id": "WEqaeWKDPthTdEp7v", "postedAt": "2023-07-09T17:19:11.652Z", "postId": "HdzcvrDnKnkQ65MW2", "htmlBody": "<p>That display seems to illustrate my point — that the West/East distinction is a bit odd and rather outdated — well! People in cities in Brazil, Costa Rica, Malawi, India and China were more helpful than people in the United States, the Netherlands, Italy and Israel. But also, people in Vienna, Madrid and Copenhagen were more helpful than people in other parts of Europe, while people in Shanghai were more helpful than people in Taipei, Bangkok and Kuala Lumpur.</p>\n<p>Why many EAs are so eager to make broad, hasty generalisations about entire continents and hemispheres is something I’ve never understood.</p>\n", "parentCommentId": "ENkCXLeGwyAgkfKYw", "user": {"username": "JBentham"}}, {"_id": "xg8tYkwrcw4TujDSh", "postedAt": "2023-07-09T21:17:46.788Z", "postId": "HdzcvrDnKnkQ65MW2", "htmlBody": "<p>I agree that people often make overly-broad generalizations too easily. There are a lot of variables that affect behavior, and \"west\" and \"east\" are categories so broad as to be of very little use. But I would resist anyone suggesting that this means there are no broad, generalizable differences between people's behaviors between cultures.</p><p>You might be interested in the book <a href=\"https://en.wikipedia.org/wiki/The_Geography_of_Thought\">The Geography of Thought: How Asians and Westerners Think Differently...and Why</a>. It describes some of the ways that the cultures we grow up in affect how we think, and it had a pretty big influence on opening my mind to cultural differences. Or for a more specific example of within-country difference, <a href=\"https://drive.google.com/file/d/1EnAq12wYeeg8_eei3ch0cn7-llQs--Rl/view?usp=sharing\">Large-Scale Psychological Differences Within China Explained by Rice Versus Wheat Agriculture</a> is nice, and has created a whole \"subgenre\" of papers exploring within country behavioral differences.</p>", "parentCommentId": "WEqaeWKDPthTdEp7v", "user": {"username": "jlemien"}}, {"_id": "JLDb7r7ycsKv3qcTF", "postedAt": "2023-07-09T22:17:42.890Z", "postId": "HdzcvrDnKnkQ65MW2", "htmlBody": "<p>I’ll have a look, thanks! I do tend to be quite sceptical of this research due to the replication crisis and I’m not sure how useful it is. The same was true with Heinrich’s questionable “WEIRD” book. The common factor linking people whose parents/families object to them becoming vegetarian isn’t being Eastern/Western or Asian/Western, but “having families who object to vegetarianism”. This post uses a personal anecdote and those of two other people raised in East Asian households to speak on behalf of every single Asian on the planet — “those of us brought up in Asian households” apparently find these issues “particularly challenging”.</p>\n<p>On a population scale, there are of course behavioural and ideological differences on average. And this can inform population-level policies and strategies, to some extent. Farmed animal welfare charities might use this information to tailor their messages to audiences in different countries, for example. But applying population averages to individuals is not good practice.</p>\n", "parentCommentId": "xg8tYkwrcw4TujDSh", "user": {"username": "JBentham"}}]