[{"_id": "JrEu64iJqudXuXqCD", "postedAt": "2023-09-26T11:43:48.343Z", "postId": "HeDvLBezyFzb9nmNx", "htmlBody": "<p>Do you have any thoughts on how to think about indirect paths to impact and their relative fragility, relying heavily on subjective value estimates?</p><p>Specifically in your/our<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefkvu63umtar\"><sup><a href=\"#fnkvu63umtar\">[1]</a></sup></span>&nbsp;case, the pathway from GCR research to preventing deaths is a relatively convoluted one - you raise awareness or get funding for policy activism which then convinces policymakers to act differently, which in turn reduces risk. This seems quite reasonable, but has enough steps that it's both very hard to evaluate impact in ways that can justify the investments other than via prior beliefs about impact, and has lots of failure points, with all the pitfalls of the ways complex plans usually fail.</p><p>&nbsp;</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnkvu63umtar\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefkvu63umtar\">^</a></strong></sup></span><div class=\"footnote-content\"><p>I do work on similar problems, so any implicit criticism here applies to myself as well - but this is something that seems important for EAs to think about clearly, and which seems to get little attention in practice. (Of course, I have tentative thoughts, but I want to hear other people's perspectives.)</p></div></li></ol>", "parentCommentId": null, "user": {"username": "Davidmanheim"}}, {"_id": "bcMYPw7wiTMJrdTFM", "postedAt": "2023-09-26T14:22:08.458Z", "postId": "HeDvLBezyFzb9nmNx", "htmlBody": "<blockquote><p>I first got interested in civilizational collapse and global catastrophic risks by working on a Maya archaeological excavation in Guatemala.</p></blockquote><p>I didn't know this, and it's awesome.</p><p>What did your work on the Mayans teach you about civilizational collapse?</p>", "parentCommentId": null, "user": {"username": "Stephen Clare"}}, {"_id": "rTiZJv7b8eyLQYx8u", "postedAt": "2023-09-26T14:24:54.019Z", "postId": "HeDvLBezyFzb9nmNx", "htmlBody": "<p>Asssume \"<a href=\"https://forum.effectivealtruism.org/posts/fpudvy4KB6np324Fx/philanthropy-to-the-right-of-boom-founders-pledge\">Philanthropy to the Right-of-Boom</a>\" is a roaring success (say, a 95th-percentile good outcome for that report). In a few years, how does the world look different? (Pick any number of years you'd like!)</p>", "parentCommentId": null, "user": {"username": "Stephen Clare"}}, {"_id": "nDMTFDRHzxK3yXT7S", "postedAt": "2023-09-26T14:27:22.978Z", "postId": "HeDvLBezyFzb9nmNx", "htmlBody": "<p>What's the best elevator pitch for convincing people to give more for nuclear risk reduction?</p>\n", "parentCommentId": null, "user": {"username": "jackva"}}, {"_id": "JDuwD5Hn9Hwtq8CHj", "postedAt": "2023-09-26T14:43:45.252Z", "postId": "HeDvLBezyFzb9nmNx", "htmlBody": "<p>What opportunities are you most excited about for GCR mitigation outside the Anglosphere?</p>\n", "parentCommentId": null, "user": {"username": "Jsevillamol"}}, {"_id": "izjgbk7t6Er3hASGc", "postedAt": "2023-09-26T14:43:58.508Z", "postId": "HeDvLBezyFzb9nmNx", "htmlBody": "<p>What risks do you feel are particularly neglected by the EA community?</p>\n", "parentCommentId": null, "user": {"username": "Jsevillamol"}}, {"_id": "hduBLRXepe37f7hJr", "postedAt": "2023-09-26T14:44:24.789Z", "postId": "HeDvLBezyFzb9nmNx", "htmlBody": "<p>What are some open questions in your mind, for potential GCR priorities you haven't had time to investigate?</p>\n", "parentCommentId": null, "user": {"username": "Jsevillamol"}}, {"_id": "DqMyFaEibevjowWtf", "postedAt": "2023-09-26T17:06:21.233Z", "postId": "HeDvLBezyFzb9nmNx", "htmlBody": "<blockquote><p>including the sorry state of nuclear security philanthropy</p></blockquote><p>I'd be interested in hearing more about this! I'd be curious how nuclear security work is funded in general (almost entirely government funding? Or a wider mix than people might expect?), and what you think are the biggest problems with nuclear security philanthropy today?</p>", "parentCommentId": null, "user": {"username": "Angelina Li"}}, {"_id": "uadTZ2QJnEiizhrT3", "postedAt": "2023-09-26T23:46:13.793Z", "postId": "HeDvLBezyFzb9nmNx", "htmlBody": "<p>Is there anything that can be done to get New START fully reinstated?</p>", "parentCommentId": null, "user": {"username": "Akmon Ra"}}, {"_id": "CpS7zKfRjL2sTJmKQ", "postedAt": "2023-09-27T09:04:28.826Z", "postId": "HeDvLBezyFzb9nmNx", "htmlBody": "<p><a href=\"https://scottrogowski.com/the-production-functions-of-smart-and-successful-people\">What is your production function?</a></p>", "parentCommentId": null, "user": {"username": "HaukeHillebrandt"}}, {"_id": "ATGWDhjDKcf9bCGqb", "postedAt": "2023-09-27T12:32:59.774Z", "postId": "HeDvLBezyFzb9nmNx", "htmlBody": "<p>How do you think about comparing GCR vs Global Health effectiveness? Is it different for money compared to careers?</p>\n", "parentCommentId": null, "user": {"username": "jooke"}}, {"_id": "mPbQEhc6SkNn4BGev", "postedAt": "2023-09-27T22:37:09.086Z", "postId": "HeDvLBezyFzb9nmNx", "htmlBody": "<p>Do you think your area is more talent-constrained or cash-constrained? How about your particular role? Read this in whatever way makes sense</p>\n", "parentCommentId": null, "user": {"username": "geoffreyyip"}}, {"_id": "jbCskp9GKDqkZKjt7", "postedAt": "2023-09-28T12:46:40.366Z", "postId": "HeDvLBezyFzb9nmNx", "htmlBody": "<p>Has anyone, to your knowledge, assessed the chances that an <a href=\"https://forum.effectivealtruism.org/posts/wXzc75txE5hbHqYug/the-great-energy-descent-short-version-an-important-thing-ea\">energy descent</a> (\"<a href=\"https://forum.effectivealtruism.org/posts/TdMSpzSqkQDccnSy2/posts-from-2022-you-thought-were-valuable-and-underrated#Which_were_most_underrated_by_Forum_karma_\">Most Underrated EA Forum Post in 2022</a>\") poses a significant global catastrophic risk? If not, who should look into that? If yes, what were the outcomes and how do/should they change EA's priorities?</p>", "parentCommentId": null, "user": {"username": "mikbp"}}, {"_id": "gnvnYLPvM6yv33BHZ", "postedAt": "2023-09-29T14:18:10.728Z", "postId": "HeDvLBezyFzb9nmNx", "htmlBody": "<p>Hi Angelina! Thanks for the great question! There are several government actors, like&nbsp;<a href=\"https://www.dtra.mil/\"><u>DTRA</u></a>, the&nbsp;<a href=\"https://minerva.defense.gov/Research/Research-Priorities/\"><u>Minerva Research Initiative</u></a>, and the&nbsp;<a href=\"https://www.stratcom.mil/Academic-Alliance/USSTRATCOM-Academic-Alliance/\"><u>STRATCOM Academic Alliance</u></a>, that play an important role in the non-governmental nuclear security space, including with funding. Then there are the&nbsp;<a href=\"https://www.energy.gov/national-laboratories\"><u>National Labs</u></a> as well as&nbsp;<a href=\"https://en.wikipedia.org/wiki/Federally_funded_research_and_development_centers\"><u>FFRDCs</u></a> and&nbsp;<a href=\"https://en.wikipedia.org/wiki/University_Affiliated_Research_Center\"><u>UARCs</u></a> that receive government funding and often work on relevant issues. Then there are defense contractors that will provide funding to think tanks and organizations that just so happen to support the latest weapons systems.&nbsp;</p><p>But that funding isn’t really optimized for reducing risk from nuclear weapons. I also think it isn’t (as some advocates would have us believe) the evil plans of crazy war-mongers. Rather, it’s just bureaucratic actors pursuing their bureaucratic incentives, and the result is kind of muddled work that mostly just supports programs of record and the conventional wisdom.&nbsp;</p><p>So I think that’s where private philanthropy can really do a lot of good. I really like this quote from the recent&nbsp;<a href=\"https://www.vox.com/future-perfect/2023/8/4/23819209/nuclear-war-philanthropies-oppenheimer-united-states-china-russia-cold-war-existential-risk\"><u>Vox</u></a> piece that Matt Gentzel and I wrote:</p><blockquote><p>As James Scouras, a senior expert on the risk of nuclear war at the Johns Hopkins Applied Physics Laboratory recently wrote in response to the<a href=\"https://docs.google.com/document/d/1Sops0AM_kTvsKEHnFmwSCbI3pufTujOI9kjUxyDHvQY/edit#heading=h.wvh8mrk9otqr\"><u> Founders Pledge report</u></a>, philanthropy can help challenge “unimaginative, even wrongheaded and dangerous, government policies.” Nuclear risk, he writes, is “far too important to leave to the generals.”&nbsp;</p></blockquote><p>also:</p><blockquote><p>Philanthropists can devote resources to policy interventions intended to bear fruit beyond the current election cycle and to protect people regardless of what side of an international border they’re on. Without careful philanthropy, policy influence outside government becomes a contest between defense industry lobbying and under-informed activism.</p></blockquote><p>This is the part that I think is in a sorry state. The MacArthur Foundation — previously the biggest funder in nuclear security — withdrew what amounted to about 32% of the field’s total funding, distributing the final grants this year. That leaves the field with funding somewhere around $30-$40 million a year. (The exact numbers here are less important than the order of magnitude — compare it to the numbers on any other major global problem, or even to the&nbsp;<a href=\"https://screenrant.com/oppenheimer-movie-christopher-nolan-genre-trick-exciting/\"><u>$100 million budget of the Oppenheimer movie</u></a>). This is all happening against the background of an&nbsp;<a href=\"https://www.politico.com/news/magazine/2023/07/28/nuclear-experts-russia-war-00108438\"><u>aging field and small talent pipeline</u></a>, as well as new risks on the horizon (like China potentially quadrupling its arsenal). Then within that, the large funders are fairly homogenous in their worldviews,&nbsp;<a href=\"https://www.founderspledge.com/research/philanthropy-to-the-right-of-boom\"><u>leading some very important issues to be doubly neglected</u></a>.</p><p>I think there’s a general perception that nuclear security is highly professionalized and well-funded compared to other global catastrophic risks, and that had been&nbsp;<i>partly</i> true for a long time. For various reasons, I wouldn’t argue that nuclear security should receive more funding than biosecurity and risks from transformative technologies, for example. But we’re now in a place where a single wealthy donor could double the philanthropy on nuclear issues, and yet no one has stepped in! So all the changes to the risk landscape are going un-studied and I think we will look back with regret if this funding does not increase.</p><p>&nbsp;</p><p>Hope this answers your question!</p>", "parentCommentId": "DqMyFaEibevjowWtf", "user": {"username": "christian.r"}}, {"_id": "7FXZhLAyjtMA3jveN", "postedAt": "2023-09-29T14:51:45.861Z", "postId": "HeDvLBezyFzb9nmNx", "htmlBody": "<p>Thanks for the question, Johannes! My best elevator pitch is roughly an ITN case that starts with neglectedness:</p><p>The biggest funder in nuclear security just withdrew from the field, leaving only ~$32 million/year in philanthropic funding. That's a third of the budget of <i>Oppenheimer</i>, and several orders of magnitude smaller than philanthropic spending on climate change. This is a huge blow to a field that's already small and aging, and would leave defense contractors and bureaucrats to determine nuclear policy. But it's also an opportunity to reshape the field for the better to deal with new challenges: unravelling arms control agreements, emerging technologies and new weapons systems, and a new world where there are three nuclear superpowers (two of them revisionist authoritarian states). Best of all, there are cheap funding opportunities! For example, $500,000 lets you <i>triple</i> the number of backchannel diplomatic exchanges between the U.S. and China on strategic nuclear issues. And there is <a href=\"https://www.founderspledge.com/research/philanthropy-to-the-right-of-boom\">low-hanging fruit that other funders</a> ignore for non-impact-related reasons</p><p>For EAs, I would add that we don't need to get bogged down in the debates about nuclear winter and extinction -- nuclear war is:</p><ol><li>A major <strong>global catastrophic risk for current generations </strong>in terms of death, suffering, grief, infrastructure and economic damage, and long-term radiation effects. And...</li><li>A potential <strong>existential risk factor</strong> with a technology that is already here and deployed. Consider<ol><li>What cost-benefit calculations would Russia start to make about mass-casualty bioweapons as it depletes its nuclear arsenal in a protracted great power war?</li><li>Where do your compute supply chain chokepoints go after a limited nuclear war in the Indo-Pacific?</li><li>Do we really want to roll the dice on post-war values, global leadership, and the prospects of international cooperation?</li></ol></li></ol><p>Given this, I think $30 million to <i>double the funding</i> starts looking like a reasonable hits-based bet</p>", "parentCommentId": "nDMTFDRHzxK3yXT7S", "user": {"username": "christian.r"}}, {"_id": "4f9bjappScSN9wqoC", "postedAt": "2023-09-29T14:51:56.178Z", "postId": "HeDvLBezyFzb9nmNx", "htmlBody": "<p>(It's a long elevator ride)</p>", "parentCommentId": "7FXZhLAyjtMA3jveN", "user": {"username": "christian.r"}}, {"_id": "qswrGq63rqdLtpy34", "postedAt": "2023-09-29T14:55:21.349Z", "postId": "HeDvLBezyFzb9nmNx", "htmlBody": "<p>I would say cash-constrained. There are plenty of good opportunities out there, and a field of smart scholars, advocates, and practitioners with transferable skills. Just need a lot more money</p>", "parentCommentId": "mPbQEhc6SkNn4BGev", "user": {"username": "christian.r"}}, {"_id": "z5mfzfeavAwnEk8sz", "postedAt": "2023-09-29T16:00:30.881Z", "postId": "HeDvLBezyFzb9nmNx", "htmlBody": "<p>Maybe, but I'm not really qualified to say much about this. I do think we need to think beyond New START (which was going to need a follow-on agreement anyway), and <a href=\"https://www.amacad.org/sites/default/files/publication/downloads/Daedalus_Sp20_6_Brooks.pdf\">beyond arms control as \"formal, legally binding, ratified treaties.\"</a> I think some nonprofits and funders have been playing a very reactive kind of whack-a-mole game when it comes to nuclear security, reacting to the latest news about new weapon systems, doctrinal changes, and current events. Instead, are there ways to think bigger about arms control, to make some of these ideas more politically palatable to conservative administrations, and to discuss strategic stability with China as well as Russia?</p>", "parentCommentId": "uadTZ2QJnEiizhrT3", "user": {"username": "christian.r"}}, {"_id": "MXMdRb9pRAFs4HvfE", "postedAt": "2023-09-29T16:09:41.423Z", "postId": "HeDvLBezyFzb9nmNx", "htmlBody": "<p>Definitely difficult. I think my colleagues' work at Founders Pledge (e.g. <a href=\"https://forum.effectivealtruism.org/posts/kuopGotdCWeNCDpWi/how-to-evaluate-relative-impact-in-high-uncertainty-contexts\">How to Evaluate Relative Impact in High-Uncertainty Contexts</a>) and iterating on \"<a href=\"https://forum.effectivealtruism.org/posts/GzmJ2uiTx4gYhpcQK/effectiveness-is-a-conjunction-of-multipliers\">impact multipliers</a>\" to make ever-more-rigorous comparative judgments is the most promising path forward. I'm not sure that this is a problem unique to GCRs or climate. A more <a href=\"https://forum.effectivealtruism.org/posts/bsE5t6qhGC65fEpzN/growth-and-the-case-against-randomista-development#:~:text=Randomista%20development%20(RD)%20is%20a,primarily%20works%20in%20economic%20development).\">high-leverage risk-tolerant</a> approach to global health and development faces the same issues, right?</p>", "parentCommentId": "JrEu64iJqudXuXqCD", "user": {"username": "christian.r"}}, {"_id": "KQbBEghp5TRzFdsDD", "postedAt": "2023-09-29T16:13:28.035Z", "postId": "HeDvLBezyFzb9nmNx", "htmlBody": "<p>A few that come to mind:</p><ul><li>Risk-general/threat-agnostic/all-hazards risk-mitigation (see e.g. <a href=\"https://www.globalshieldpolicy.org/\">Global Shield</a> and the GCRMA)</li><li>\"Civil defense\" interventions and resilience broadly defined</li><li>Intrawar escalation management</li><li>Protracted great power war</li></ul>", "parentCommentId": "hduBLRXepe37f7hJr", "user": {"username": "christian.r"}}, {"_id": "pyBB5vHzznBpDxtYs", "postedAt": "2023-09-29T16:17:07.634Z", "postId": "HeDvLBezyFzb9nmNx", "htmlBody": "<p>Not that I know of, but my colleage <a href=\"https://forum.effectivealtruism.org/users/jackva?mention=user\">@jackva</a> may have more to say here</p>", "parentCommentId": "jbCskp9GKDqkZKjt7", "user": {"username": "christian.r"}}, {"_id": "FiaoA7mbqffqbFiMX", "postedAt": "2023-09-29T16:26:45.950Z", "postId": "HeDvLBezyFzb9nmNx", "htmlBody": "<p>Thanks for the question! In 3 years, this might include:</p><ul><li>Overall, \"right of boom\" interventions make up a larger fraction of funding (perhaps 1/4), even as total funding grows by an order of magnitude</li><li>There are major public and private efforts to understand escalation management (conventional and nuclear), war limitation, and war termination in the three-party world.</li><li>Much more research and investment in \"civil defense\" and resilience interventions across the board, not just nuclear. So that might include food security, bunkers, transmission-blocking interventions, better P4E, better national stockpiles and distribution systems, resilient crisis-communication systems, etc.&nbsp;</li><li>There are multiple ongoing track 2 and 1.5 talks, and eventually official dialogues between the U.S., Russia, and China to better understand each other's views on limited war and find common ground on risk reduction measures and arms control beyond formal treaty-based tools</li></ul>", "parentCommentId": "rTiZJv7b8eyLQYx8u", "user": {"username": "christian.r"}}, {"_id": "saSgXijnA9yPopzyc", "postedAt": "2023-09-29T16:58:13.764Z", "postId": "HeDvLBezyFzb9nmNx", "htmlBody": "<p>I think: read a lot, interview a lot of people who are smarter (or more informed, connected, etc.) than I am about the problem, snowball sample from there, and then write a lot.</p><p>I wonder if FP's research director, <a href=\"https://forum.effectivealtruism.org/users/mattlerner?mention=user\">@Matt_Lerner</a>, has a better answer for me, or for FP researchers in general</p>", "parentCommentId": "CpS7zKfRjL2sTJmKQ", "user": {"username": "christian.r"}}, {"_id": "cy2qAC7beXqoJRwhg", "postedAt": "2023-09-29T17:15:16.625Z", "postId": "HeDvLBezyFzb9nmNx", "htmlBody": "<p>I think in general, it's a trade-off along the lines of uncertainty and leverage -- GCR interventions pull bigger levers on bigger problems, but in high-uncertainty environments with little feedback. I think evaluations in GCR should probably be framed in terms of relative impact, whereas we can more easily evaluate GHD in terms of absolute impact.</p><p>This is not what you asked about, but I generally view GCR interventions as highly relevant to current-generation and near-term health and wellbeing. When we launched the Global Catastrophic Risks Fund last year, we wrote in the prospectus:</p><blockquote><p>The Fund’s grantmaking will take a balanced approach to existential and catastrophic risks. Those who take a longtermist perspective in principle put special weight on existential risks—those that threaten to extinguish or permanently curtail humanity’s potential—even where interventions appear less tractable. Not everyone shares this view, however, and people who care mostly about current generations of humanity may prioritize highly tractable interventions on global catastrophic risks that are not directly “existential”. In practice, however, the two approaches often converge, both on problems and on solutions. A common-sense approach based on simple cost-benefit analysis points us in this direction even in the near-term.</p></blockquote><p>I like that the GCR framing is becoming more popular, e.g. with <a href=\"https://www.openphilanthropy.org/our-global-health-and-wellbeing-and-global-catastrophic-risks-grantmaking-portfolios/\">Open Philanthropy renaming their grant portfolio</a>:&nbsp;</p><blockquote><p>We recently renamed our “Longtermism” grant portfolio to “Global Catastrophic Risks”. We think the new name better reflects our view that AI risk and biorisk aren’t only “longtermist” issues; we think that both could threaten the lives of many people in the near future.</p></blockquote>", "parentCommentId": "ATGWDhjDKcf9bCGqb", "user": {"username": "christian.r"}}, {"_id": "zEHFeaaMkcBCvq3bm", "postedAt": "2023-09-29T17:25:08.999Z", "postId": "HeDvLBezyFzb9nmNx", "htmlBody": "<p>China and India. Then generally excited about leveraging U.S. alliance dynamics and building global policy advocacy networks, especially for risks from technologies that seem to be becoming cheaper and more accessible, e.g. in synthetic biology</p>", "parentCommentId": "JDuwD5Hn9Hwtq8CHj", "user": {"username": "christian.r"}}, {"_id": "PeYimxJCcjvZ5FpNQ", "postedAt": "2023-09-29T19:11:34.183Z", "postId": "HeDvLBezyFzb9nmNx", "htmlBody": "<p>I think the idea of an energy descent is extremely far outside the expert consensus on the topic, as Robin discusses at length in his replies to that post.</p>\n<p>This is nothing we need to worry about.</p>\n", "parentCommentId": "pyBB5vHzznBpDxtYs", "user": {"username": "jackva"}}, {"_id": "ed47iNbrpCJ2Fmyi7", "postedAt": "2023-10-01T08:33:18.547Z", "postId": "HeDvLBezyFzb9nmNx", "htmlBody": "<blockquote><p>For example, $500,000 lets you <i>triple</i> the number of backchannel diplomatic exchanges between the U.S. and China on strategic nuclear issues.</p></blockquote><p>Huh! Is this a specific live funding opportunity you are tracking, or just an example of a specific outcome that philanthropic nuclear funding has generated before? Curious if you can elaborate, if not too sensitive!</p>", "parentCommentId": "7FXZhLAyjtMA3jveN", "user": {"username": "Angelina Li"}}, {"_id": "s3BAQThEqtN5WwFrA", "postedAt": "2023-10-02T12:40:20.566Z", "postId": "HeDvLBezyFzb9nmNx", "htmlBody": "<p>There is currently just one track 2/track 1.5 diplomatic dialogue between the U.S. and China that focuses on strategic nuclear issues. ~$250K/year is roughly my estimate for what it would cost to start one more</p>", "parentCommentId": "ed47iNbrpCJ2Fmyi7", "user": {"username": "christian.r"}}]