[{"_id": "v6cvucAhmKd2DK3Aa", "postedAt": "2022-08-26T02:38:11.470Z", "postId": "HethBnC3GAFFno7KW", "htmlBody": "<p>From the first essay:</p>\n<p>\"However, I believe it’s a mistake to think that the descriptive and the normative can never overlap. Imagine that you are a scientist taking an inventory of all the various qualities present in conscious human experience. You’ve written down the qualities of experiencing various colors, sounds, and smells. But there are two distinct experiential qualities that you can’t quite figure out how to describe. In the end, you realize that the only way to describe the one is to say that it’s “good” or “positive”, and that you can only describe the other by saying it’s “bad” or “negative”. That is, you have to mention the normativity of the experiences in order to describe them accurately. The qualities of these experiences are simultaneously normative and descriptive.\"</p>\n<p>I can't imagine being satisfied with such a theory of consciousness. It seems like there will always be another question about how to explain \"good\" and \"bad\" or the appearance of them. Stopping here and invoking normative properties that aren't further explained physically is giving up, a lot like invoking the supernatural or gods to explain natural phenomena.</p>\n<p>Intrinsic good and intrinsic bad as properties necessary to describe pleasure and suffering also seem incompatible with functionalism and illusionism, which both seem basically true to me. Are any popular theories of consciousness compatible with this?</p>\n", "parentCommentId": null, "user": {"username": "MichaelStJules"}}, {"_id": "8tWcTHvE7LsY5aaCz", "postedAt": "2022-08-26T03:26:26.253Z", "postId": "HethBnC3GAFFno7KW", "htmlBody": "<p>It might be tough to make a lot of progress on these things until we're allowed to start poking people in the brain and asking them about it. My sense is that the current science and philosophy of the emotions (and adjacent topics) is not well developed at all. Perhaps once we have a better grasp of those things maybe we can start to think more usefully about metaethics (though maybe not).&nbsp;</p>", "parentCommentId": "v6cvucAhmKd2DK3Aa", "user": {"username": "banon"}}, {"_id": "uDmLHTSaWFTmGyz6G", "postedAt": "2022-08-26T04:25:30.452Z", "postId": "HethBnC3GAFFno7KW", "htmlBody": "<p>On the second essay, with respect to the reliability argument:</p>\n<p>\"R2. Phenomenal introspection is reliable in generating belief that pleasure is good\"</p>\n<p>Some people, like tranquilists and some moral antirealists, don't have the belief that pleasure is good, even after phenomenal introspection. So either pleasure is not good, or phenomenal introspection is not (perfectly) reliable, undermining R1 and the rest of the argument. The author also refers to disagreement as reason to doubt the reliability of a process in R3.</p>\n<p>\"Phenomenal introspection generates belief that pleasure is good, just as it generates belief that sound-experience has volume.\"</p>\n<p>Maybe this comes down to definitions and is kind of besides the point, but inner monologues don't seem to have volume, at least not my own.</p>\n", "parentCommentId": null, "user": {"username": "MichaelStJules"}}, {"_id": "LjNrhGDwqF8oY3SKb", "postedAt": "2022-08-26T13:10:36.530Z", "postId": "HethBnC3GAFFno7KW", "htmlBody": "<blockquote><p>normative properties that aren't further explained physically</p></blockquote><p>You've misunderstood Rawlette here. &nbsp;Her view--analytic hedonism--holds that normative properties are <i>analytically reducible</i> to pleasure and suffering. So her suggestion here is not that we need metaphysically primitive normative properties to explain the experience. Quite the opposite! &nbsp;It's rather (as I understand it) that the normativity \"comes along for free\" (so to speak) with the familiar felt nature of the experience.</p>", "parentCommentId": "v6cvucAhmKd2DK3Aa", "user": {"username": "RYC"}}, {"_id": "ju8AwoMeFvBcxitTj", "postedAt": "2022-08-26T14:57:29.280Z", "postId": "HethBnC3GAFFno7KW", "htmlBody": "<p>I'm not sure how to interpret this, then:</p>\n<p>\"In the end, you realize that the only way to describe the one is to say that it’s “good” or “positive”, and that you can only describe the other by saying it’s “bad” or “negative”. \"</p>\n<p>Was this not a motivating example for her view? Or just proposed as an example where the descriptive and normative may overlap?</p>\n<p>Does she have a specific descriptive definition of pleasure she's working with that doesn't directly use normative terms but from which she can derive its normative goodness? (I don't expect a persuasive solution to the is-ought problem; at some point you need to assume a normative fact to obtain any further ones, and I think we could prove this formally.)</p>\n", "parentCommentId": "LjNrhGDwqF8oY3SKb", "user": {"username": "MichaelStJules"}}]