[{"_id": "hQGxNFEE2BDNmN5xZ", "postedAt": "2017-11-04T19:41:54.720Z", "postId": "HFa28vs5tMg9mmMcs", "htmlBody": "<p>Thanks a lot guys. I'm starting to understand the value of all this information for other organizers (like myself).</p>\n", "parentCommentId": null, "user": {"username": "EschersDemon"}}, {"_id": "pJpkA5JexC3bqy3Tv", "postedAt": "2017-11-06T15:41:32.178Z", "postId": "HFa28vs5tMg9mmMcs", "htmlBody": "<p>Thanks for letting us know. I'm glad to hear that long write-ups like this one can give useful insights to other organisers. </p>\n", "parentCommentId": "hQGxNFEE2BDNmN5xZ", "user": {"username": "remmelt"}}, {"_id": "DowqokqMPujNrna5Q", "postedAt": "2018-01-28T08:28:12.159Z", "postId": "HFa28vs5tMg9mmMcs", "htmlBody": "<p>Thanks very much for posting all this detailed information. A quick question about making 80000 hours referrals your main metric: my impression from their website is that they are very over-subscribed. So do you have an estimate of the value of getting someone coached (replacement effects etc)? </p>\n<p>I notice in your impact assessment for Sjir you talk almost exclusively in terms of getting people involved in EA rather than 80kh referrals, so maybe this is not relevant to your analysis. </p>\n<p>Another quick comment: the google doc `See Remmelt’s considerations.' seems to need permissions changed (can't currently access). </p>\n", "parentCommentId": null, "user": {"username": "26david26"}}, {"_id": "3qnFhoDZcL7go5a7c", "postedAt": "2018-03-20T13:03:56.859Z", "postId": "HFa28vs5tMg9mmMcs", "htmlBody": "<p>Hi David, only just saw your comment (I wonder how I can turn on notifications for posts).</p>\n<p>At the moment, 80,000 Hours have even <a href=\"https://80000hours.org/coaching/#priority-areas\">closed</a> applications for coaching. We also haven't been able to get a referral link set up through CEA Groups, who strongly recommended to us to use successful 80K referrals as the key metric. </p>\n<p>Most of our efforts right now are going to building a committed and active core community. For our monthly community events, we ask people registering to fill in the hours spend on EA, % of income donated and what cause area they would currently see themselves working on. \nAside from that, we keep track of people that we think belong to our core community based on multiple criteria, track gender and student/non-student diversity, note down anecdotes of impactful decisions that we might have helped others in making and (new) projects that we've supported.\nThis system is definitely not perfect since we miss important data points but I can consistently incorporate this in my work routine. </p>\n<p>Perhaps we should have made a more concerted effort to refer to 80K coaching. Instead, the more natural thing to do in conversation seemed to be to either discuss promising cause areas and career opportunities with a good fit and to point to the career guide. </p>\n<p>You raise a good point on replacement effects that I hadn't given thought. I haven't made an estimate on the value of 80,000 Hours referrals and would be interested in seeing one made by someone else.</p>\n<p>(also turned on sharing for <a href=\"https://docs.google.com/document/d/10FmdAbmLR1E1a5LzGhxARxPfomHgIM57uBLPAc7YGJA/edit#\">See Remmelt's considerations</a>)</p>\n", "parentCommentId": "DowqokqMPujNrna5Q", "user": {"username": "remmelt"}}]