[{"_id": "m6bmuhBjfJn4D6kdW", "postedAt": "2022-12-28T22:08:16.667Z", "postId": "HgZymWBTAovWTa7F8", "htmlBody": "<p>My experience: I’ve been living in the south of Japan for six years. It’s far from the most effective place to be. I gave up on being an independent researcher. I wanted financial stability and got a permanent work contract. If things go well, I’m going to have children soon. (Will MacAskill encourages people to have children in What We Owe the Future, by the way.) I don’t feel  that guilty because I’m still a lot more effectively altruistic than the vast majority of people who would have the means.</p>\n", "parentCommentId": null, "user": {"username": "rmoehn"}}, {"_id": "RxaBCsfbwHzHnuLK7", "postedAt": "2022-12-28T22:19:21.505Z", "postId": "HgZymWBTAovWTa7F8", "htmlBody": "<p>I felt a lot of this when I was first getting involved in effective altruism. Two of the things that I think are most important and valuable in the EA mindset -- being aware of tradeoffs, and having an acute sense of how much needs to get done in the world and how much is being lost for a lack of resources to fix it -- can also make for a pretty intense flavor of guilt and obligation. These days I think of these core elements of an EA mindset as being pieces of mental technology that really would ideally be installed gradually alongside other pieces of mental technology which can support them and mitigate their worst effects and make them part of a full and flourishing life.</p><p>Those other pieces of technology, at least for me, are something like:</p><ul><li>a conviction that I should, in fact, be aspiring to a full and flourishing life; that any plan which doesn't viscerally feel like it'll be a good, satisfying, aspirational life to lead is not ultimately a viable plan; that I may find sources of strength and flourishing outside where I imagined, and that it'd fine if I have to be creative or look harder to find them, but that I cannot and will not make life plans that don't entail having a good life.</li><li>a deep comfort with my own values, some of which are altruistic and some of which are selfish, and with my own failings as a person; the ability to look at myself and see a lot of shortcomings and muddled thinking and mistakes and ways I've hurt people and to nonetheless feel love and pride for myself. For me, at least, the reason it hurt to notice I had selfish values was very close to the reason it hurt to notice I'd made a mistake or handled a situation poorly; I had a lot of my self-esteem and my conviction I deserved to be happy and to be loved tied up in high expectations of myself. But of course it's very damaging to your altruistic endeavors, and to your personal growth, to be unwilling to look at yourself the way you truly are, or to love yourself only for things you won't always live up to, so I'm actually much stronger and better once I deeply internalized that I am flawed, and that I am selfish, and that I am incoherent and muddled in many ways, and that this is also true of all other humans and we all remain deserving of good lives all the same.&nbsp;</li><li>a sense that I am better and a better EA when I'm stronger and happier; that depression and burnout genuinely sap my productivity and my creativity and affect my epistemics; that miserably dragging myself across the finish line actually produces worse results than living a life I take pride in and enjoy deeply; an appreciation for just how much I'm capable of when I'm happy and love my life and love the people around me and love the work I do and don't have to fight with myself to focus or prioritize.</li><li>a healthier relationship to my own motivational system: I used to do a lot of what I think of as 'dragging my brain across sharp rocks' to get stuff done. The stuff was aversive; I didn't want to do it; I hated doing it; I forced myself to do it anyway. This changed how I related to all kinds of tasks, even one that didn't have to be aversive. I thought of 'intrinsic motivation' as basically willpower, the willingness to make myself hurt to get things done. It was hard to imagine doing things out of an uncomplicated, not-internally-coercive interest in making them happen. It took me a long time, and I had the luxury of a home environment and job that made it possible, but I flat-out don't do that anymore. I do things when I want to do them; when it would take internal coercion and 'dragging my brain over rocks' to do things, I don't do them. (I allow myself to make myself <i>start</i> a thing for a few seconds, to see if it just needed activation energy, but I don't force myself through things that require ongoing internal making-myself). And it turns out that once I have some trust that doing things won't be unpleasant and aversive, I do plenty of things, and it's more achievable to add new things.&nbsp;</li></ul><p><br><br>For me, this has taken a decade. I don't think I was particularly good at it, I don't know that I made all the right tradeoffs in doing it, and I hope it's faster and better for other people. But I do want people to know that there's a way of living your values that doesn't feel fueled by guilt, that it's possible to be an EA and have a life you just love, and that you should absolutely be aiming to be your strongest and best self rather than the version of yourself who sacrificed the most.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Kelsey Piper"}}, {"_id": "oxfSvHuJWQFCzKhL3", "postedAt": "2022-12-28T23:05:06.353Z", "postId": "HgZymWBTAovWTa7F8", "htmlBody": "<p>For me, I have:<br><br>Not wanting to donate more than 10%.<br>(\"There are people dying of malaria right now, and I could save them, and I'm not because...I want to preserve option value for the future? Pretty lame excuse there, Jay.\")<br><br>Not being able to get beyond 20 or so highly productive hours per week.<br>(\"I'm never going to be at the top of my field working like that, and if impact is power-lawed, &nbsp;if I'm not at the top of my field, my impact is way less.\")<br><br>Though to be fair, the latter was still a pressure before EA, there was just less reason to care because I was able to find work where I could do a competent job regardless, and I only cared about comfortably meeting expectations, not achieving maximum performance.</p>", "parentCommentId": null, "user": {"username": "Jay Bailey"}}, {"_id": "46J9jYFtRA3PesLeZ", "postedAt": "2022-12-29T10:47:56.509Z", "postId": "HgZymWBTAovWTa7F8", "htmlBody": "<p>Hey Jay,<br><br>Over the years, I have talked to many very successful and productive people, and most do, in fact, not work more than 20 productive hours per week. If you have a job with meetings and low-effort tasks in between, it's easy to get to 40 hours plus. Every independent worker who measures hours of real mental effort is more in the 4-5 hours per day range. People who say otherwise tend to lie and change their numbers if you pressure them to get into the detail of what \"counts as work\" to them. It's a marathon, and if you get into that range every day, you'll do well.</p>", "parentCommentId": "oxfSvHuJWQFCzKhL3", "user": {"username": "annaleptikon"}}, {"_id": "on7rRH6qABpMCkH76", "postedAt": "2022-12-29T12:21:07.018Z", "postId": "HgZymWBTAovWTa7F8", "htmlBody": "<p>I'm interested in building a career around technological risks. Sometimes, I think about all the problems we're facing. From biosecurity risks to AI safety risks to cybersecurity risks to ... And it all feels so big and pressing and hopeless and whatnot.&nbsp;</p><p>Clearly, me being existential about these issues wasn't helping anyone. So I've had to accept that I have to pick a smaller, very specific problem that my skillset could be useful in. Even if it's not solving everything, I won't solve anything if I don't specialise in that way.&nbsp;</p><p>Maybe some spirit of that could also apply to the altruistic actions I take in general? Ie. I have to start by going vegan OR setting up regular donations OR working towards a more flexible career OR thinking about whether I want kids OR ... I can't take on all those things at once.&nbsp;</p><p>I suppose the simple way I might remind myself of that is <strong>\"Altruism requires one step at a time and not </strong><i><strong>every </strong></i><strong>altruistic person needs to generalise in </strong><i><strong>all </strong></i><strong>methods of being altruistic.\"</strong></p>", "parentCommentId": null, "user": {"username": "madhav-malhotra"}}, {"_id": "sTscaohAeY3gm8rJi", "postedAt": "2022-12-29T18:16:04.487Z", "postId": "HgZymWBTAovWTa7F8", "htmlBody": "<p>That's just silly. There's absolutely no reason to feel guilty about any of those decisions / choices if they maximise your utility.</p>\n", "parentCommentId": null, "user": {"username": "Bob"}}, {"_id": "ShnBApZBNA5XMbYCk", "postedAt": "2022-12-29T19:02:57.076Z", "postId": "HgZymWBTAovWTa7F8", "htmlBody": "<p>I agree with the sentiment that ideally we'd accept that we have unchangeable personal needs and desires that constrain what we can do, so it might not \"make sense\" to feel guilty about them.</p>\n<p>But I think the language \"that's just silly\" risks coming across as saying that anyone who has these feelings is being silly and should \"just stop\", which of course is easier said than done with feelings! And I'm worried calling feelings silly might make people feel bad about having them (see number 7 in the original post).</p>\n", "parentCommentId": "sTscaohAeY3gm8rJi", "user": {"username": "Isaac_Dunn"}}, {"_id": "qbMuNygnCRa3e75bo", "postedAt": "2022-12-30T11:04:58.195Z", "postId": "HgZymWBTAovWTa7F8", "htmlBody": "<p>I totally agree and I think EA should be less totalizing.</p>\n<p>EA indirectly asks us to devalue our own direct communities in order to more effectively help others globally. For most people, this creates a big problem.</p>\n<p>I want to see more focus on a version of EA for Normal People.</p>\n", "parentCommentId": null, "user": {"username": "ludwigbald"}}, {"_id": "wdCugC4zzvKXDCKqh", "postedAt": "2022-12-30T12:12:24.598Z", "postId": "HgZymWBTAovWTa7F8", "htmlBody": "<p>Yes, that's fair. And it was silly of me to potentially cause someone to feel guilty about feeling guilty.</p>\n<p>But I stand by the point that there is no reason to feel guilty about choosing something that masimises one's own utility.</p>\n", "parentCommentId": "ShnBApZBNA5XMbYCk", "user": {"username": "Bob"}}]