[{"_id": "yRMMqotqS8KQ23vQt", "postedAt": "2017-10-05T01:40:57.884Z", "postId": "HHeaoX47aAa8dgt7a", "htmlBody": "<p>Nice post. A few comments:</p>\n<p>i) I'd focus more on the opportunity cost of the people involved than the financial cost.</p>\n<p>ii) Being half as cost effective as CEA would still be pretty good! So long as CEA wasn't significantly funding constrained, it would make sense to fund others groups that could do that well. BTW I'd heard of marginal cost of pledge acquisitions as low as a few hundred dollars 3 years ago, but maybe that has gone up. I've also heard concerns the pledge quality could be declining as GWWC has scaled and made it easier to join.</p>\n<p>iii) $2,000 for a pledge makes it better than funding AMF just from a fundraising point of view. You only need someone to follow through on giving 10% for an extra 1 year or so to break even. People who are part of a local community are probably above-average quality members as well (likely to donate to better places and for longer). But if you think about the staff's opportunity cost (i.e. their ability to do useful direct work if they weren't doing EA London) maybe it's not so good.</p>\n<p>iv) I expect the long-term impact on the people involved to be more valuable again than the 12 pledge-equivalents, but people's mileage varies on that quite a lot.</p>\n", "parentCommentId": null, "user": {"username": "Robert_Wiblin"}}, {"_id": "8brYenRpmZZetBtP5", "postedAt": "2017-10-05T19:58:22.201Z", "postId": "HHeaoX47aAa8dgt7a", "htmlBody": "<p>Thanks for sharing this! Out of curiosity, was there any particular evidence that drove the basic theory of outreach (awareness -&gt; engagement -&gt; behavior change)? This seems like actually a hotly contested empirical area so I'm curious. Thanks!</p>\n", "parentCommentId": null, "user": {"username": "zdgroff"}}, {"_id": "8Su8uxCNe8Tvi8Pfd", "postedAt": "2017-10-14T21:44:53.067Z", "postId": "HHeaoX47aAa8dgt7a", "htmlBody": "<p>This is great stuff! Really appreciate the effort you put into measuring things.</p>\n", "parentCommentId": null, "user": {"username": "Michael_PJ"}}, {"_id": "Rdqey884WsmFLCK7p", "postedAt": "2017-10-29T23:10:19.480Z", "postId": "HHeaoX47aAa8dgt7a", "htmlBody": "<p>Thanks for the feedback Rob</p>\n<p>i) The opportunity cost of time has been low.</p>\n<p>• For me, there were minimal opportunities to do something higher impact at this stage in my career. For example, I may have stayed in government and I doubt this would have had much impact (also this year out has not significantly damaged my civil service career, I was able to return on a promotion). It is not clear that I had the credibility on any other EA project that I could have found funders willing to cover my costs for the year. I could have worked part time in the civil service and tried to found a different type of other organisation but I think it is unlikely to have gone as well.</p>\n<p>• David Nash has invested time but it is helping him move career-wise in a direction he wants to be going in.</p>\n<p>• I expect the interns taken on would not have spent time as effectively otherwise.</p>\n<p>• Time invested by others was minimal.</p>\n<p>ii)-iv) Agree</p>\n", "parentCommentId": "yRMMqotqS8KQ23vQt", "user": {"username": "weeatquince"}}, {"_id": "K9vAqT7BzYnKHSXHG", "postedAt": "2017-10-29T23:14:37.339Z", "postId": "HHeaoX47aAa8dgt7a", "htmlBody": "<p>It roughly came from the idea of treating movement builidng as a marketing funnel. It is similar to the marketing funnel you'd expect of any other organisation except &quot;buy our junk&quot; is replaced with &quot;behaviour change&quot;.</p>\n<p>I did not have specific evidence on community building that this was a particularly good theory of change, although nothing I read when looking for data on this suggested it would not be a good theory of change.</p>\n<p>What is it that it contested about this?</p>\n", "parentCommentId": "8brYenRpmZZetBtP5", "user": {"username": "weeatquince"}}]