[{"_id": "HyGv24zfvSQSQJmMf", "postedAt": "2022-08-24T02:22:52.392Z", "postId": "HigACkirm7kEq2cNL", "htmlBody": "<p>I shall become the holder of the most historic hedon heist in history! 😈</p>", "parentCommentId": null, "user": {"username": "Daryl D'Souza"}}, {"_id": "zXeXDACEcXBKvps92", "postedAt": "2022-08-24T02:53:23.536Z", "postId": "HigACkirm7kEq2cNL", "htmlBody": "<blockquote><p>like a speedrunner discovering new exploits</p></blockquote><p>Sounds like a good idea, EA affiliated people should strive to be the type of person who is at the table instead of on the menu.</p>", "parentCommentId": null, "user": {"username": "trevorw96"}}, {"_id": "YHSxvSyFRmxMvSMJK", "postedAt": "2022-08-24T15:23:00.979Z", "postId": "HigACkirm7kEq2cNL", "htmlBody": "<p>This was a great short post and I enjoyed it a lot, thanks!</p>", "parentCommentId": null, "user": {"username": "OllieBase"}}, {"_id": "arXy6fsj83enRWuRF", "postedAt": "2022-08-24T15:52:09.352Z", "postId": "HigACkirm7kEq2cNL", "htmlBody": "<p>This is an attitude I hold strongly, though my internal spin on it is something like:</p>\n<blockquote>\n<p>When you're trying to help others, ruthlessly pursue that goal</p>\n</blockquote>\n<blockquote>\n<p>When you're not trying to help others, ruthlessly <em>do whatever you want <strong>all</strong> the time.</em></p>\n</blockquote>\n<p>This really works for me as a framing, personally. Someone pointed out to me today it's very MTG red, if that means anything to you.</p>\n<p>(Obviously, this only works well if 'whatever you want' is ~always harmless)</p>\n", "parentCommentId": null, "user": {"username": "Bella_Forristal"}}, {"_id": "Ccii9BFcthPbr3fyM", "postedAt": "2022-08-24T17:44:09.609Z", "postId": "HigACkirm7kEq2cNL", "htmlBody": "<p>Yep. As the author of <a href=\"https://nothingismere.com/2014/12/03/chaos-altruism/\">https://nothingismere.com/2014/12/03/chaos-altruism/</a> , I think of myself as an MtG red person who cosplays as esper because I happen to have found myself in a world that has a lot of urgent WUB-shaped problems.</p><p>(The world has plenty of fiery outrage and impulsive action and going-with-the-flow, but not a lot of cold utilitarian calculus, principled integrity, rationalism, utopian humanism, and technical alignment research. If I don't want humanity's potential to be snuffed out, I need to prioritize filling those gaps over pure self-expression.)</p><p>The specific phrasing \"ruthlessly do whatever you want all the time\" sounds more MtG-black to me than MtG-red, but if I interpret it as MtG-red, I think I understand what it's trying to convey. :)</p>", "parentCommentId": "arXy6fsj83enRWuRF", "user": {"username": "RobBensinger"}}, {"_id": "HEkM4G4i9xxDy4NtW", "postedAt": "2022-08-24T19:03:08.432Z", "postId": "HigACkirm7kEq2cNL", "htmlBody": "<p>The most devious, dastardly, diabolical hedon <a href=\"https://en.wikipedia.org/wiki/Devious_lick\">lick</a></p>", "parentCommentId": "HyGv24zfvSQSQJmMf", "user": {"username": "Phil Masiakowski"}}, {"_id": "9LvjyHLYJpiZrstNZ", "postedAt": "2022-08-25T09:36:50.713Z", "postId": "HigACkirm7kEq2cNL", "htmlBody": "<p><a href=\"https://drethelin.tumblr.com/post/617052190388994048/does-anyone-else-get-mischievous-joy-out-of-being\">https://drethelin.tumblr.com/post/617052190388994048/does-anyone-else-get-mischievous-joy-out-of-being</a></p>\n", "parentCommentId": null, "user": {"username": "technicalities"}}, {"_id": "Ap8Tpqh8PJjwS7Swi", "postedAt": "2022-08-25T21:35:37.342Z", "postId": "HigACkirm7kEq2cNL", "htmlBody": "<p>I think you are talking about guilty pleasures, yes?</p><p>From Wikipedia: &nbsp;A guilty pleasure is something, such as a film, a television program, or a piece of music, that one enjoys despite understanding that it is not generally held in high regard, or is seen as unusual or weird. &nbsp;https://en.wikipedia.org/wiki/Guilty_pleasure</p><p>Personally, I like the more common phrase,\"guilty pleasure\" &nbsp;better, because I wouldn't want to label anything I do as evil. &nbsp;How can secretly listening to Barry Manilow be considered evil? lol</p>", "parentCommentId": null, "user": {"username": "Melissa"}}, {"_id": "MwtrbCz9RhCMfdCa8", "postedAt": "2022-08-30T05:56:40.323Z", "postId": "HigACkirm7kEq2cNL", "htmlBody": "<p>This is of course, pretty much the conclusion of Yudkowsky's classic <a href=\"https://forum.effectivealtruism.org/posts/EcCW8L7ej47sCgo4k/purchase-fuzzies-and-utilons-separately\">Purchase fuzzies and utilons separately</a>.</p><blockquote><p>But the main lesson is that all three of these things—warm fuzzies, status, and expected utilons—can be bought <i>far</i> more efficiently when you buy <i>separately</i>, optimizing for only one thing at a time</p></blockquote>", "parentCommentId": "arXy6fsj83enRWuRF", "user": {"username": "agucova"}}, {"_id": "7CrhfKhDsXrNHwxBY", "postedAt": "2022-09-22T15:53:20.901Z", "postId": "HigACkirm7kEq2cNL", "htmlBody": "<p>Whatever works for you!</p><p>For me, \"guilty pleasure\" is a worse tag because it encourages me to <i>feel guilty</i>, which is exactly what I don't want to encourage myself to do.</p><p>\"I'm being so evil by listening to Barry Manilow\" works well for me exactly because it's too ridiculous to take seriously, so it diffuses guilt. I'm making light of the feel-guilty impulse, not just acknowledging it.</p>", "parentCommentId": "Ap8Tpqh8PJjwS7Swi", "user": {"username": "RobBensinger"}}, {"_id": "H7zagAXxLjPJxqB2F", "postedAt": "2022-09-23T00:42:16.630Z", "postId": "HigACkirm7kEq2cNL", "htmlBody": "<p>This is meant in a lighthearted fashion - but you would feel guilty listening to Barry Manilow? These days, the colloquialism, \"guilty pleasure,\" is meant to be funny, not to invoke actual guilt.&nbsp;</p><p>That being said, the concept of feeling guilty when appropriate, actually serves a useful purpose. Those on the anti-social personality disorder spectrum lack a sense of guilt, which is why they so often purposely hurt others. To me, that is evil personified.</p><p>In psychology, it is said that all of the disorders in the DSM usually only hurt the person who has the disorder. The exception is &nbsp;the anti-social spectrum disorders - those are the disorders that hurt everyone else. It is said jokingly, however it is truer than not.</p><p>Anyway, linguistics is an interesting topic because language literally shapes our perceptions, whether we are consciously aware of it or not.&nbsp;</p><p>Add to that the concept of cognitive dissonance, and how our behavior changes in accordance with our words, and you soon realize how powerful language is.&nbsp;</p><p>Words have the power to shape what we see, quite literally, and words can determine how we act. This isn't new, it is why we pledge allegiance to our respective flags, or take oaths, or swear on a bible in court to tell the truth.</p><p>I'm currently working on a post about the subject, so please stay tuned...</p>", "parentCommentId": "7CrhfKhDsXrNHwxBY", "user": {"username": "Melissa"}}]