[{"_id": "eArgcfwDRhyKgpv9Q", "postedAt": "2023-12-13T22:17:08.254Z", "postId": "HjsfHwqasyQMWRzZN", "htmlBody": "<p>Thanks for this update, your leadership, and your hard work over the last year, Zach.</p><p>It's great to hear that Mintz's investigation has wrapped (and to hear they found no evidence of knowledge of fraud, though of course I'm not surprised by that). I'm wondering if it would be possible for them to issue an independent statement or comment confirming your summary?</p>", "parentCommentId": null, "user": {"username": "Stephen Clare"}}, {"_id": "L2ssPxbj7NosvBcd9", "postedAt": "2023-12-13T22:30:14.883Z", "postId": "HjsfHwqasyQMWRzZN", "htmlBody": "<p>Zachary - thanks very much for this update. I imagine a lot of us were pretty worried about how the FTX debacle would affect the core EA organizations and their budgets.</p><p>Is it fair to say that the organizations under the EV umbrella are still doing OK in terms of their budgets and funding situation, at least in the short term? (eg being able to pay salaries, rents, funding grants they're committed to, etc)? &nbsp;Or is there any urgent need for fund-raising that EAs could help with?</p>", "parentCommentId": null, "user": {"username": "geoffreymiller"}}, {"_id": "qHMiXpxinBtjAr6Fo", "postedAt": "2023-12-13T23:11:35.966Z", "postId": "HjsfHwqasyQMWRzZN", "htmlBody": "<p>Thanks for this update! Two questions…</p><ol><li>When all the sponsored projects have been spun out, will EV continue to exist? If so, what will it do?</li><li>“I plan to share other non-privileged information on lessons learned in the aftermath of FTX and encourage others to share their reflections as well.” Do you have an estimated timeline for this?&nbsp;</li></ol>", "parentCommentId": null, "user": {"username": "AnonymousEAForumAccount"}}, {"_id": "QKfjGqbehxNG3z28w", "postedAt": "2023-12-14T01:16:48.335Z", "postId": "HjsfHwqasyQMWRzZN", "htmlBody": "<blockquote><p>we are convinced this push towards decentralization will make the EA ecosystem more resilient and better enable our projects to pursue their own goals.</p></blockquote><p>I'm surprised. Why? What was wrong with the EV sponsorship system?</p><p>(I've seen <a href=\"https://forum.effectivealtruism.org/posts/GRYFJGnye2gCxCTG4/ea-orgs-legal-structure-inhibits-risk-taking-and-information\">Elizabeth's</a> and <a href=\"https://forum.effectivealtruism.org/posts/P55P4YJoncfQmZ2RR/downsides-of-small-organizations-in-ea\">Ozzie's</a> posts on this topic and didn't think the downsides of sponsorship were decisive. Curious which downsides were decisive for you.)</p><p>[Edit: someone offline told me <i>probably shared legal liability is pretty costly</i>.]</p>", "parentCommentId": null, "user": {"username": "zsp"}}, {"_id": "fam5wePGde2WCPjRr", "postedAt": "2023-12-14T02:15:41.034Z", "postId": "HjsfHwqasyQMWRzZN", "htmlBody": "<p>My take is basically that (a) the projects have been run so independently that there was minimal benefit from being within the same legal entity, (b) organizations with very different legal risk profiles sharing a legal entity requires either excessive caution from some or excessive risk to others, and (c) board oversight is important for nonprofits and overseeing so many independent projects with their own CEOs didn't make sense for part-time volunteer board members.</p>\n<p>(Also seconding Elizabeth's post.)</p>\n", "parentCommentId": "QKfjGqbehxNG3z28w", "user": {"username": "Jeff_Kaufman"}}, {"_id": "EP9zxh5rukvFahjtD", "postedAt": "2023-12-14T10:12:29.490Z", "postId": "HjsfHwqasyQMWRzZN", "htmlBody": "<p>Why wouldn't the same apply to Alphabet?</p><p>I'm curious to what extent these issues are linked to worries about the brand's reputation, specifically the negative connotations currently associated with the EA brand.</p>", "parentCommentId": "fam5wePGde2WCPjRr", "user": {"username": "AnonymousAccount"}}, {"_id": "oepCk83KnzBE8jLnE", "postedAt": "2023-12-14T12:27:59.104Z", "postId": "HjsfHwqasyQMWRzZN", "htmlBody": "<p>Why would for-profit and non-profit be the same?</p>\n", "parentCommentId": "EP9zxh5rukvFahjtD", "user": {"username": "bec_hawk"}}, {"_id": "mgufFEREgK6DJErnL", "postedAt": "2023-12-14T13:27:45.810Z", "postId": "HjsfHwqasyQMWRzZN", "htmlBody": "<blockquote>\n<p>Why wouldn't the same apply to Alphabet?</p>\n</blockquote>\n<p>I'm not entirely convinced it doesn't! But I think the biggest difference there is that the other companies under the alphabet umbrella benefit a lot from their connection with Google for (a) money, which works very differently from a non-profit, and (b) technology, where being able to use internal tech helps a lot in a way I don't see analogs for within EV.</p>\n<blockquote>\n<p>I'm curious to what extent these issues are linked to worries about the brand's reputation, specifically the negative connotations currently associated with the EA brand.</p>\n</blockquote>\n<p>I doubt that's much of it: at least the largest orgs spinning off (CEA, 80k, GWWC) are explicitly EA branded.</p>\n", "parentCommentId": "EP9zxh5rukvFahjtD", "user": {"username": "Jeff_Kaufman"}}, {"_id": "7qBmWyzfWofEeKtaW", "postedAt": "2023-12-14T13:36:19.867Z", "postId": "HjsfHwqasyQMWRzZN", "htmlBody": "<p><strong>Executive summary: </strong>Effective Ventures has reached settlements with the FTX bankruptcy estate, paying $26.8 million to resolve claims. It plans to decentralize and spin off its projects into independent entities over the next 1-2 years.</p><p><strong>Key points:</strong></p><ol><li>EV paid $26.8 million to the FTX estate to settle claims, using funds originally from FTX or donated for this purpose. This resolves EV's financial issues with FTX.</li><li>An independent investigation found no evidence EV staff or leadership knew about FTX's criminal fraud. More lessons learned will be shared later.</li><li>EV has implemented governance improvements like policies, procedures, due diligence processes. It will continue improving oversight.</li><li>EV plans to decentralize by transitioning projects like CEA and 80K Hours into independent legal entities over 1-2 years.</li><li>Decentralization will increase ecosystem resilience, enable custom structures, but involves some friction. EV will share more reflections on lessons learned.</li></ol><p>&nbsp;</p><p>&nbsp;</p><p><i>This comment was auto-generated by the EA Forum Team. Feel free to point out issues with this summary by replying to the comment, and</i><a href=\"https://forum.effectivealtruism.org/contact\"><i>&nbsp;<u>contact us</u></i></a><i> if you have feedback.</i></p>", "parentCommentId": null, "user": {"username": "SummaryBot"}}, {"_id": "ohJfKgWDJq9f7mcHK", "postedAt": "2023-12-14T14:48:53.733Z", "postId": "HjsfHwqasyQMWRzZN", "htmlBody": "<p>I haven't looked at Alphabet specifically, but generally similar corps are holding companies. They are the sole shareholder in their subsidiaries, which are legally distinct corporations in their own right. Basically, as long as proper formalities are observed and the subsidiaries aren't alter egos of the holding company, shareholders enjoy protection from corporate liabilities.</p>\n<p>That model probably wouldn't work for an org like EV -- making all the orgs sufficiently independent to not be alter egos of EV would largely defeat the whole point of centralization in the first place.</p>\n", "parentCommentId": "EP9zxh5rukvFahjtD", "user": {"username": "Jason"}}, {"_id": "oqdKAGHXvXc2LJymz", "postedAt": "2023-12-14T15:19:02.121Z", "postId": "HjsfHwqasyQMWRzZN", "htmlBody": "<p>I’m really happy to hear this and have previously posted on this forum wondering whether splitting up EA orgs might make sense (<a href=\"https://forum.effectivealtruism.org/posts/SBSC8ZiTNwTM8Azue/a-libertarian-socialist-s-view-on-how-ea-can-improve\">https://forum.effectivealtruism.org/posts/SBSC8ZiTNwTM8Azue/a-libertarian-socialist-s-view-on-how-ea-can-improve</a>)</p>\n<p>In that same post I proposed:</p>\n<p>I would recommend that individuals are only allowed to hold leadership, board or governance positions in one EA organisation each. Beyond reducing risks of bias in funding allocation, this would also help to distribute power at the top of EA, safeguarding against individual irrationality and increasing diversity of thought, which may generate additional benefits.</p>\n<p>Is this something you would consider?</p>\n", "parentCommentId": null, "user": {"username": "freedomandutility"}}, {"_id": "okHfhLgfaWGhc88Tw", "postedAt": "2023-12-14T15:32:13.103Z", "postId": "HjsfHwqasyQMWRzZN", "htmlBody": "<p>There's no inherent contradiction between <i>the current sponsorship program isn't a good fit for this sponsor</i> and these sponsored orgs and <i>fiscal sponsorship is often a good thing</i>.</p><p>There are a number of specific reasons I could see that this wasn't a good fit:</p><ul><li>EV's reputation took damage due to the FTX scandal, particularly with the Charity Commission</li><li>We don't know what action the CC will take, but -- either by CC mandate or \"voluntary\" action -- EV's board will likely have to be significantly more involved in monitoring sponsored orgs than another sponsor would be, given that the CC appears to be concerned about lack of control issues</li><li>There's no reason for sponsored orgs to be linked to a corporation that is seen as the flagship corporation of effective altruism. Under that structure, bad stuff that happens at a sponsored org can disproportionately affect EA as a whole (and bad stuff that happens with EA senior leadership can have a disproportionate negative effect on sponsored orgs).</li><li>EA Funds and GWWC may be relatively legal-risk-intolerant in that they regrant large amounts of donor monies</li><li>CEA is relatively legal-risk-creating, especially the Community Health / Special Projects team</li><li>Certain sponsored orgs may create reputational risk for other sponsored orgs (e.g., GWWC seems relatively sensitive to reputational risk given its purpose and target audience)</li></ul><p>In my view, fiscal sponsorship is a good thing for the right sponsored orgs. But that function should be placed in a corporation whose primary role is to be a fiscal sponsor. Its board should consist mainly of people who have the time and talents to guide sponsored orgs, not some of the most prominent people in EA. Their role would be more to make the trains run on time than trying to lead the effective altruism movement.</p>", "parentCommentId": "QKfjGqbehxNG3z28w", "user": {"username": "Jason"}}, {"_id": "nDcrwTKNobpHd46nc", "postedAt": "2023-12-14T15:44:58.145Z", "postId": "HjsfHwqasyQMWRzZN", "htmlBody": "<p>[<i><u>Edit</u></i>: Rob Glenhill responded below that the CC didn't encourage offboarding projects and that this is not being done because of any possible anticipated action by the CC. Retaining my original comment text below, in strikeout, for the record.]&nbsp;</p><p><s>One </s><i><s>possible </s></i><s>explanation is that this change is motivated by statements from the Charity Commission, or concerns about what the CC might do as a result of its inquiry. I don't expect Zach or others at EV could comment on that, so I would not update as a result of their silence on that point.&nbsp;</s></p><p><s>There are a number of reasons that could motivate the spinoffs, so it is difficult to estimate the probability that CC issues were at least a motivating factor. I don't think we can do much more than observe that this would be a rational -- maybe even a likely -- response to significant expected action by the CC.</s></p>", "parentCommentId": null, "user": {"username": "Jason"}}, {"_id": "WaojXdo3gDAokL4u4", "postedAt": "2023-12-14T15:56:09.924Z", "postId": "HjsfHwqasyQMWRzZN", "htmlBody": "<blockquote><p>paid the estate $26,786,503, an amount equal to 100% of the funds the entities received from FTX and the FTX Foundation</p></blockquote><p>Interested to know whether this was a result of EV being pro-active, or being pressured by the FTX bankruptcy estate, given the relationship(s) between EV (trustees) and SBF. And what the implications might be for other orgs who received FTX funding. Have/are any other EA orgs paying money back?</p>", "parentCommentId": null, "user": {"username": "Greg_Colbourn"}}, {"_id": "sM62bmHWgC5Bx7t8Q", "postedAt": "2023-12-14T16:05:51.052Z", "postId": "HjsfHwqasyQMWRzZN", "htmlBody": "<p>I think a key detail here is they gave back all the 2022 money (90% of total) and kept all pre-2022 money (10% of total).</p><figure class=\"image\"><img src=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/sM62bmHWgC5Bx7t8Q/be57rfp2ezzo1tjdt27t\" srcset=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/sM62bmHWgC5Bx7t8Q/enk4x6dnhkpv6dncoycf 110w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/sM62bmHWgC5Bx7t8Q/bkxaaya9czzfhsevy9pu 220w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/sM62bmHWgC5Bx7t8Q/coew9s19zzjj2dry5ee8 330w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/sM62bmHWgC5Bx7t8Q/xlw9wu7pi8qbtb85yoga 440w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/sM62bmHWgC5Bx7t8Q/xbkmxtafi3vfuf5mrqnc 550w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/sM62bmHWgC5Bx7t8Q/sxjgmkjbbfxbee95dprl 660w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/sM62bmHWgC5Bx7t8Q/xv6nkff4gopn7kwd0jyo 770w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/sM62bmHWgC5Bx7t8Q/mkebamrfi2bm5zatntpe 880w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/sM62bmHWgC5Bx7t8Q/xyypyvwkfel1au2rtbqx 990w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/sM62bmHWgC5Bx7t8Q/hnegjk1vew5cfdvrofhv 1041w\"></figure><p>https://restructuring.ra.kroll.com/FTX/Home-DownloadPDF?id1=MjU5MTQzNg==&amp;id2=-1</p>", "parentCommentId": "WaojXdo3gDAokL4u4", "user": {"username": "Larks"}}, {"_id": "jdZPQRR5JuJnpru2R", "postedAt": "2023-12-14T16:11:43.005Z", "postId": "HjsfHwqasyQMWRzZN", "htmlBody": "<p>Although I directionally agree with this idea, I'd note the tension between it and some other goals implied by this and other announcements. In a decentralized ecosystem, there are lots of orgs. In my view, the target board size for a smaller org is five, 7-9 for a medium-sized org, and 9-11 for larger size ones. Resignations and recusals are going to be a reality in EA (and elsewhere, really), so a 3-person board doesn't have enough redundancy to ensure effective operations when that happens. So you're looking at several hundred board spots.&nbsp;</p><ul><li>In many orgs, some of those slots should be filled by those with specialized skill and/or experience that is not in wide supply within EA (e.g., legal, accounting, senior managerial).</li><li>Although I'm all for deepening the bench, I'm not yet convinced that there are several hundred people at the moment with the skillset and bandwidth to serve on boards.</li></ul><p>So I'd suggest something more like a point system, under which (e.g.) being on the board of RP, or spun-off CEA, etc. would consume most/all of your points. However, being on the board of a smaller org would consume fewer points. Someone being on five small-org boards whose organizations have a combined 10 FTE &amp; $2MM budget is fairly low on my concerns list at the present juncture.</p>", "parentCommentId": "oqdKAGHXvXc2LJymz", "user": {"username": "Jason"}}, {"_id": "XFmtDDB8suF25pSXA", "postedAt": "2023-12-14T16:21:45.953Z", "postId": "HjsfHwqasyQMWRzZN", "htmlBody": "<p>This take makes a lot of sense to me.</p><p><br>I think centralization can have a lot of benefits, but the situation with EV in particular seemed to have substantial downsides. (I'm not sure how much of this was historic aspects of EV vs. being a charity in the UK, which, from what I understand, has some unique hurdles).&nbsp;</p>", "parentCommentId": "okHfhLgfaWGhc88Tw", "user": {"username": "oagr"}}, {"_id": "kJp8TazayFch5FmNM", "postedAt": "2023-12-14T16:29:52.881Z", "postId": "HjsfHwqasyQMWRzZN", "htmlBody": "<p>Also, it's not entirely clear to me that each of the spun-off orgs need to have the whole cumbersome dual US/UK structure. There are simpler ways for a UK non-profit to be able to access tax-advantaged donations from the US (e.g., a so-called \"Friends Of\" organization). And as you imply, UK charitable regulation is more onerous, so it's not clear that an organization whose funding and operations were primarily in the US would find having a legal existence in the UK sufficiently worthwhile.</p>", "parentCommentId": "XFmtDDB8suF25pSXA", "user": {"username": "Jason"}}, {"_id": "v6YNSknoGdnvEBhK3", "postedAt": "2023-12-14T18:31:05.651Z", "postId": "HjsfHwqasyQMWRzZN", "htmlBody": "<p>The Charity commission didn’t encourage us to offboard projects, and we aren’t off-boarding projects because of anything that we anticipate the Charity Commission might do.</p>", "parentCommentId": "nDcrwTKNobpHd46nc", "user": {"username": "Oldman"}}, {"_id": "Xm9WW4eoF3GNAHTFR", "postedAt": "2023-12-14T18:42:16.243Z", "postId": "HjsfHwqasyQMWRzZN", "htmlBody": "<p>Thanks, Rob. I was hoping someone would be able to rule this out -- I didn't actually ask for a response out of concern that people might read a negative inference into a non-response. (There could be very valid reasons for not responding, whether or not there were CC influence on the decision). I struck out the text of my original comment above.</p>", "parentCommentId": "v6YNSknoGdnvEBhK3", "user": {"username": "Jason"}}, {"_id": "RhQcGabTFanDKrXAi", "postedAt": "2023-12-14T19:44:49.627Z", "postId": "HjsfHwqasyQMWRzZN", "htmlBody": "<p>Alphabet was created because investors got tired of Google's founders keeping control, and a series of bad financial results gave investors enough power to force the founders to partially cede control.</p><p>I think it's clear that investors would prefer that alphabet further split up into separate companies, e.g. see <a href=\"https://hbr.org/2015/08/why-google-became-alphabet\">this Harvard business review article</a> about the founding of Alphabet:</p><blockquote><p>Investors will inevitably push for more. The market’s response has so far been positive, with the stock price up 6%. And I suspect it will also have a longer-term performance impact, as greater transparency of both its cash flows and investments prompts greater discipline and accountability. But I doubt this move will fully pacify the uneasy investor. While this new organizational form increases transparency, that transparency only further illuminates the disconnect between Alphabet’s various businesses. It simply highlights the question of why the various businesses are bundled together. Investors are still buying the whole collection of projects, only now they’ll be able to see clearly just how much search advertising is subsidizing the rest.</p></blockquote>", "parentCommentId": "EP9zxh5rukvFahjtD", "user": {"username": "Ben_West"}}, {"_id": "b4hkGRFEhgohZrDGQ", "postedAt": "2023-12-14T19:51:56.111Z", "postId": "HjsfHwqasyQMWRzZN", "htmlBody": "<p>Dear Stephen and the EA community:&nbsp;&nbsp;</p><p>Shortly after the early November 2022 collapse of FTX, EV asked me and my law firm, Mintz, to conduct an independent investigation into the relationship between FTX/Alameda and EV.&nbsp; I led our team’s investigation, which involved reviewing tens of thousands of documents and conducting dozens of witness interviews with people who had knowledge about EV’s relationship with FTX and Alameda.&nbsp; As background, I spent 11 years serving as a federal prosecutor in the United States Attorney’s Office for the Southern District of New York, the same USAO that prosecuted Sam Bankman-Fried and the other FTX/Alameda executives.&nbsp;&nbsp;</p><p>I can confirm that the statements in Zach Robinson’s post from yesterday, December 13, 2023, about the results of the investigation are 100% true and accurate.&nbsp;&nbsp;&nbsp;</p><p>Mintz’s independent investigation found no evidence that anyone at EV knew about the alleged fraudulent criminal conduct at FTX and Alameda.&nbsp; This conclusion was later reinforced by the evidence at this fall’s trial of <i>United States v. Sam Bankman-Fried</i>, where the three cooperating witnesses who had all pled guilty (Caroline Ellison, Gary Wang, and Nishad Singh) testified that only four people knew about the alleged criminal fraud – those three people plus SBF.&nbsp; Accordingly, the testimony at the SBF trial was consistent with our conclusion that there is no evidence that anyone at EV knew about the alleged criminal fraud. &nbsp;</p><p>Finally, I want to add this point.&nbsp; Over the last year, my team and I had the chance to meet dozens of people affiliated with the various EV projects.&nbsp; We were consistently impressed by everyone’s genuine commitment and dedication to the EA mission, particularly during a very challenging year.&nbsp; I wish you all the best in your future endeavors.&nbsp;&nbsp;</p><p>-- Jason P.W. Halperin</p>", "parentCommentId": "eArgcfwDRhyKgpv9Q", "user": {"username": "Jason P.W. Halperin"}}, {"_id": "mp7rpKjLLBudb8pQA", "postedAt": "2023-12-14T20:14:20.401Z", "postId": "HjsfHwqasyQMWRzZN", "htmlBody": "<p>This is a very good point, when huge companies get split the stock usually rises.</p><p>When Alibaba was forced to split into six separate groups the stock went up 10%. Please someone correct me if I'm wrong, but if I remember correctly when Standard Oil split into 43 companies the combined stocks also appreciated a lot.</p>", "parentCommentId": "RhQcGabTFanDKrXAi", "user": {"username": "AnonymousAccount"}}, {"_id": "NatAL7Wfkhs5TbSab", "postedAt": "2023-12-14T20:31:01.791Z", "postId": "HjsfHwqasyQMWRzZN", "htmlBody": "<p>Good point, I don’t think I had considered the large number of board spots. That being said, I’d be excited for some senior people who don’t explicitly identify as EA to be on boards of EA orgs, who may have general relevant experience and connections in relevant sectors. So I’d probably stand by my previous recommendation, but would still prefer your idea to heavily overlapping boards.</p>\n", "parentCommentId": "jdZPQRR5JuJnpru2R", "user": {"username": "freedomandutility"}}, {"_id": "eEsLvnBtGCBQdoNgD", "postedAt": "2023-12-14T22:37:36.501Z", "postId": "HjsfHwqasyQMWRzZN", "htmlBody": "<p>Excited to hear both of these announcements!</p>", "parentCommentId": null, "user": {"username": "ElliotJDavies"}}, {"_id": "XYNLhSiDTvcgSBPse", "postedAt": "2023-12-14T23:19:57.440Z", "postId": "HjsfHwqasyQMWRzZN", "htmlBody": "<p>I'd note that the pre-2022 transfers were in 2018 and 2019, to avoid any inference about years with no transfers (2020 and 2021). (Source pasted <a href=\"https://forum.effectivealtruism.org/posts/W7AMKT8qssjS8WwjN/habryka-s-quick-takes?commentId=f49rhzATiSuPFe8Pu\">here</a>.) Also -- I wouldn't draw any conclusions about transfers in 2019 (or even the parts of November/December 2018 that were within four years of the bankruptcy filing) given how small they were here. They were uneconomical to litigate, and so I wouldn't have updated too much if they were or were not paid back.</p>", "parentCommentId": "sM62bmHWgC5Bx7t8Q", "user": {"username": "Jason"}}, {"_id": "v7e8JppmxuHqAWoKP", "postedAt": "2023-12-14T23:27:50.634Z", "postId": "HjsfHwqasyQMWRzZN", "htmlBody": "<p>I haven't seen anything to update my initial reaction <a href=\"https://forum.effectivealtruism.org/posts/W7AMKT8qssjS8WwjN/habryka-s-quick-takes?commentId=rBkq93gBLvzrrrqg3\">here</a>. I'm cautious about applying to any other organization because I can't be giving anyone legal advice.</p><p>I'd add that almost all other potential clawbacks are metaphorically classified as relatively small potatoes (using the threshold amount at which the proposed settlement must be publicly filed on the open docket as the dividing line for small vs. midsize potatoes). Many are at least an order of magnitude <i>under </i>the small-potatoes threshold. I expect the estate's willingness to litigate those cases with its $2000-per-hour lawyers, or even junior associates billing more like $750-$1000 per hour, will be significantly lower than it would have been with EV, and that might be reflected in the deals that were offered. I have no inside info, though.</p>", "parentCommentId": "WaojXdo3gDAokL4u4", "user": {"username": "Jason"}}, {"_id": "KHnnAS8Lt5hGzCfuy", "postedAt": "2023-12-14T23:43:23.757Z", "postId": "HjsfHwqasyQMWRzZN", "htmlBody": "<p>I generally agree with that, but also think that large board changes can be pretty challenging.</p><p>Placing a significant number of people who don't explicitly identify as EAs on EA boards feels more like a task on the five-year plan for many orgs rather than something that I'd expect them to manage with all the other necessary board-related changes in the next year or so.</p><p>Several significant changes are hopefully already in the cards -- much more active boards, fewer seats held by the people who have commonly served on boards, more seats overall. I think it's going to be difficult to make all of those changes happen in the short-to-medium run, and how to prioritize them best will likely vary on an organization-by-organization basis.&nbsp;</p><p>I also wonder if many boards would be able to attract better not-explicitly-EA candidates if they waited for a bit more chronological distance from the FTX situation and for the resultant litigation risk to be cleaned up.</p>", "parentCommentId": "NatAL7Wfkhs5TbSab", "user": {"username": "Jason"}}, {"_id": "PpMuCaJzknHj27igr", "postedAt": "2023-12-15T10:43:26.808Z", "postId": "HjsfHwqasyQMWRzZN", "htmlBody": "<p>Related to (1) is the question: which sponsored projects are definitely being spun out?</p>", "parentCommentId": "qHMiXpxinBtjAr6Fo", "user": {"username": "RyanCarey"}}, {"_id": "Qbg8Hkg6pSW4Nt9bw", "postedAt": "2023-12-15T11:59:43.170Z", "postId": "HjsfHwqasyQMWRzZN", "htmlBody": "<p>I'd read \"offboarding the projects which currently sit under the Effective Ventures umbrella. This means CEA, 80,000 Hours, Giving What We Can and other EV-sponsored projects will transition to being independent legal entities\" as \"all of them\" but now I'm less sure.</p>\n", "parentCommentId": "PpMuCaJzknHj27igr", "user": {"username": "Jeff_Kaufman"}}, {"_id": "HP8FuDSSGXnmzbqCW", "postedAt": "2023-12-15T12:11:24.347Z", "postId": "HjsfHwqasyQMWRzZN", "htmlBody": "<p>I guess you're right, but even so I'd ask:</p><ul><li>Is it 11 new orgs, or will some of them stick together (perhaps with CEA) when they leave?&nbsp;</li><li>What about other orgs not on the website, like GovAI and Owain's team?&nbsp;</li><li>Separately, are any teams going to leave CEA?</li></ul>", "parentCommentId": "Qbg8Hkg6pSW4Nt9bw", "user": {"username": "RyanCarey"}}, {"_id": "dmfmqpoYYmFeegCeB", "postedAt": "2023-12-15T14:46:36.716Z", "postId": "HjsfHwqasyQMWRzZN", "htmlBody": "<p>Quick flag that this is mixed evidence for \"EA organizations should be very small\".<br><br>First, this focuses on gigantic organizations. Alphabet has around 190k employees now, ~60k in 2015 when it \"split\". <a href=\"https://www.macrotrends.net/stocks/charts/GOOG/alphabet/number-of-employees.\">https://www.macrotrends.net/stocks/charts/GOOG/alphabet/number-of-employees.</a> I believe we have more information about mergers and acquisitions than we do companies splitting up, and there I think things seem more favorable. (My impression is that companies often do more M&amp;A than investors would want, but there are definitely some cases where it's a good fit for both executives and investors.)</p><p>Second, I believe one big reason why the stock market prefers large companies be split up is because that way they could invest less in the parts that funders don't like. In the case of Alphabet, I believe the executives were spending a lot of money on non-search products that investors would have rather been shut down. I'm not sure how much this applies to the nonprofit case, at least in worlds where funders have a lot of control.&nbsp;</p>", "parentCommentId": "mp7rpKjLLBudb8pQA", "user": {"username": "oagr"}}, {"_id": "Li4JW8KRXc4Nzrgcb", "postedAt": "2023-12-16T01:51:45.147Z", "postId": "HjsfHwqasyQMWRzZN", "htmlBody": "<p>I agree, if anything data in the for-profit world probably updates me against very-small-sized companies being optimal.</p><p>That argument just doesn't go all the way to trillion dollar behemoths like I thought.</p><p>In the non-profit world, GiveWell's top charities seem to have very different team sizes, so maybe we just can't say much with generality.</p>", "parentCommentId": "dmfmqpoYYmFeegCeB", "user": {"username": "AnonymousAccount"}}, {"_id": "AJ3vKLgvNpZoiQvXa", "postedAt": "2023-12-18T04:02:02.127Z", "postId": "HjsfHwqasyQMWRzZN", "htmlBody": "<p>How much of this decision for the sponsored projects to spin out was at the request of the individual organisations, and to what extent was it initiated by EV?</p>\n", "parentCommentId": null, "user": {"username": "Akhil Bansal"}}, {"_id": "9iCjvSEdNvSeNY2Ns", "postedAt": "2024-01-09T12:04:07.698Z", "postId": "HjsfHwqasyQMWRzZN", "htmlBody": "<p>Thanks for this info, Zach. It's a great relief to know we have disentangled from FTX and fulfilled our obligations to the bankruptcy estate. (My heart goes out to all the investors who were hurt by SBF and co.) People like myself who are considering applying to EA funds can now do so with a clear conscience.</p>\n<p>The move to decentralise is very welcome. This will reduce the potential for groupthink and confirmation bias among EA initiatives, while hopefully maintaining committment to overall goals.</p>\n<p>The balancing act between increasing diversity (and the improved collective intelligence that brings) and the resulting requirement for better coordinating ability is a fine one. Continuous dialog, epistemic humility, and iterative improvements will be key to success.</p>\n", "parentCommentId": null, "user": {"username": "Hedgie"}}, {"_id": "6XwTs6F3r8T9scBnW", "postedAt": "2024-01-12T06:44:00.985Z", "postId": "HjsfHwqasyQMWRzZN", "htmlBody": "<p>I think you’re underrating run-of-the-mill operational/bureaucratic reasons why a project might want to be its own org rather than part of a larger org</p>\n", "parentCommentId": "okHfhLgfaWGhc88Tw", "user": {"username": "bec_hawk"}}, {"_id": "day7hZRz5BoLLSQrf", "postedAt": "2024-01-22T20:13:14.437Z", "postId": "HjsfHwqasyQMWRzZN", "htmlBody": "<p>FWIW I’m pretty surprised and disappointed that <a href=\"https://forum.effectivealtruism.org/posts/HjsfHwqasyQMWRzZN/ev-updates-ftx-settlement-and-the-future-of-ev?commentId=qHMiXpxinBtjAr6Fo\">my question</a> about whether EV will continue to exist after the spinoffs never got a response. It’s a key piece of information about one of the most important EA orgs, and it’s clear that others are curious about it from the karma of my question, the comments replying to it, and the <a href=\"https://forum.effectivealtruism.org/posts/R6qu7LhcLKLob7t9r/zach-robinson-will-be-cea-s-next-ceo?commentId=ubwFKccEseJ2aKXww\">same question</a> being raised in another thread. Even if the answer is “we don’t know yet”, that would be valuable to communicate. And if the answer is known, giving clarity to the rest of the community feels like extraordinarily low hanging fruit.</p>", "parentCommentId": "qHMiXpxinBtjAr6Fo", "user": {"username": "AnonymousEAForumAccount"}}, {"_id": "anSXyZdAKuhxqpiaR", "postedAt": "2024-01-29T21:34:34.148Z", "postId": "HjsfHwqasyQMWRzZN", "htmlBody": "<p>1. It's unclear what the legal status of EV will be at the end of the process. If it does exist, I expect it would be in a minimalist fashion and I wouldn't expect it to resemble what it has historically looked like (e.g. I don't expect it to be a fiscal sponsor for multiple projects).</p><p>2. No specific timeline. It's in a queue with other pieces of public communications I expect to do after I transition into a new role at CEA, and I'm not planning on it being the first piece.</p>", "parentCommentId": "qHMiXpxinBtjAr6Fo", "user": {"username": "Zachary Robinson"}}, {"_id": "35WRkD4ayKEJpj9Ew", "postedAt": "2024-01-30T13:03:13.813Z", "postId": "HjsfHwqasyQMWRzZN", "htmlBody": "<p>Thanks for these updates Zach!</p>", "parentCommentId": "anSXyZdAKuhxqpiaR", "user": {"username": "AnonymousEAForumAccount"}}]