[{"_id": "ctTkbGiGx7L3M8oCQ", "postedAt": "2023-05-23T20:06:09.484Z", "postId": "Hk8ivqMsbiBFycmS3", "htmlBody": "<p>Counterpoint:</p><p>In hunter-gatherers, trust is generally established under conditions of scarcity, when people develop networks of social reciprocity for food-sharing, child-care, sickenss-care, and catastrophe-avoidance. Only when people face starvation, illness, disasters, or warfare can they learn who they can really trust. And the trust functions mostly for <a href=\"https://pubmed.ncbi.nlm.nih.gov/34045721/\">risk-pooling</a>.</p><p>By contrast, only under conditions of local abundance - e.g. unusually high-productivity hunter-gatherer environments (e.g. pacific northwest salmon &amp; shellfish areas), or farming with agricultural surpluses -- do we see a lot of top-down hierarchical coercion, with persistent inequality, divisions of labor, despotism, harems, large-scale warfare, etc.</p>", "parentCommentId": null, "user": {"username": "geoffreymiller"}}, {"_id": "vxk9utWe8AZxffhRm", "postedAt": "2023-05-23T20:34:57.726Z", "postId": "Hk8ivqMsbiBFycmS3", "htmlBody": "<p>It's actually kinda upsetting to think about how pre internet people had to sort of adapt their preferences such that they could be friends with people in a mostly geographical dunbar radius. There just must've been way lower standards for friendship quality, compatibility, etc. Leading to more dysfunctions along the lines of abuse (however defined), to say nothing of the conformity.&nbsp;</p><p>Related: I have a high bar for romance <i>because</i> distance relationships, conditioning on my city is <i>a bad time</i> or at least some notion of \"settling\".&nbsp;</p><p>I guess what I'm saying is if everyone dramatically raises the bar in terms of what kind of interpersonal <i>quality</i> they can expect, shouldn't an observer expect a correspondingly dramatic increase in happiness?&nbsp;</p>", "parentCommentId": null, "user": {"username": "quinn"}}, {"_id": "LPBHFBokh6jKy9cDh", "postedAt": "2023-05-23T22:08:32.038Z", "postId": "Hk8ivqMsbiBFycmS3", "htmlBody": "<p>I'm really enjoying this sequence so far, thanks for writing it!</p>", "parentCommentId": null, "user": {"username": "Amber"}}, {"_id": "vQ7DiuEDgcLrGZPQc", "postedAt": "2023-05-23T22:25:09.842Z", "postId": "Hk8ivqMsbiBFycmS3", "htmlBody": "<blockquote><p>Only when people face starvation, illness, disasters, or warfare can they learn who they can really trust.</p></blockquote><p>Isn't this approximately equivalent to the claim that trust becomes much more risky/costly under conditions of scarcity?</p><blockquote><p>only under conditions of local abundance do we see a lot of top-down hierarchical coercion</p></blockquote><p>Yeah, this is an interesting point. I think my story here is that we need to talk about abundance at different levels. E.g. at the highest level (will my country/civilization survive?) you should often be in scarcity mindset, because losing one war is disastrous. Whereas at lower levels (e.g. will my city survive?) you can have more safety: your city is protected by your country (and your family is protected by your city, and you're protected by your family, and so on).</p><p>And so even when we face serious threats, we need to apply coercion only at the appropriate levels. AI is a danger on a civilizational level; but the best way to deal with danger on a civilizational level is via cultivating abundance at the level of your own community, since that's the only way it'll be able to make a difference at that higher level.</p>", "parentCommentId": "ctTkbGiGx7L3M8oCQ", "user": {"username": "richard_ngo"}}, {"_id": "iqtqxzBP4HuNm9fE4", "postedAt": "2023-05-24T20:37:01.595Z", "postId": "Hk8ivqMsbiBFycmS3", "htmlBody": "<p>Ditto.</p>", "parentCommentId": "LPBHFBokh6jKy9cDh", "user": {"username": "NunoSempere"}}]