[{"_id": "LEjPFMnMGmgu33KJj", "postedAt": "2023-01-09T18:04:18.631Z", "postId": "Hk9vhBhrWbyBYX6xb", "htmlBody": "<p>Interesting and helpful, thanks for doing this research</p>\n", "parentCommentId": null, "user": {"username": "ElliotJDavies"}}, {"_id": "o6HsvbbMWXDfRonfs", "postedAt": "2023-01-09T21:45:07.289Z", "postId": "Hk9vhBhrWbyBYX6xb", "htmlBody": "<p>I'd be interested to see what you think of Giving What We Can's social media presence!&nbsp;</p><p>(I am Head of Marketing and produce most of the social media posts and content promoted via our social media. This is not a large focus of my role but something I am happy to receive feedback on.)</p>", "parentCommentId": null, "user": {"username": "GraceAdams"}}, {"_id": "fgHt9oXvyri2iAvbm", "postedAt": "2023-01-10T21:26:24.651Z", "postId": "Hk9vhBhrWbyBYX6xb", "htmlBody": "<p>Hi Stan, I manage Giving Green's social-media accounts. Really appreciate your analyses here and fascinating to see what works for other orgs. &nbsp;I'd love to see how these trends change, if it's not too much work to repeat!</p><p>I'm in the process of analysing our social data from the past giving season. Happy to share what I discover and compare notes. I'm at <a href=\"mailto:sunnie.huang@idinsight.org\">sunnie.huang@idinsight.org</a>&nbsp;</p>", "parentCommentId": null, "user": {"username": "Sunnie Huang"}}, {"_id": "ySyXt6q6uy6yL8mqw", "postedAt": "2023-01-11T01:14:36.020Z", "postId": "Hk9vhBhrWbyBYX6xb", "htmlBody": "<p>The data I would be most interested to see (if you plan to do further research on this) is of when people started following the page (rather than overall numbers of followers). I believe you mentioned this briefly in the limitations footnote.</p>\n<p>A lot of people follow a lot of pages, and may have followed something years ago. If their interests change, but the page doesn't post, it seems relatively unlikely that someone will go out of their way to unfollow it. Perhaps they've even forgotten that they've followed it to begin with!</p>\n<p>That was my first thought (intuition, no evidence) when you mentioned that the correlation between followers and date since last post was steeper when organisations that have not posted in the last 2 months were removed, i.e. this cuts out the 'followed this years ago and forgot, no new posts to remind me' followers.</p>\n", "parentCommentId": null, "user": {"username": "LinBowkerLonnecker"}}, {"_id": "3KXgfiEGhrpetaeni", "postedAt": "2023-01-12T15:35:27.548Z", "postId": "Hk9vhBhrWbyBYX6xb", "htmlBody": "<p>I have sent some feedback via email. Thanks!</p>", "parentCommentId": "o6HsvbbMWXDfRonfs", "user": {"username": "Stan Pinsent"}}, {"_id": "YeNuvQ3xqGia4fbjP", "postedAt": "2023-01-12T15:35:54.863Z", "postId": "Hk9vhBhrWbyBYX6xb", "htmlBody": "<p>Yes please! I have sent an email.</p>", "parentCommentId": "fgHt9oXvyri2iAvbm", "user": {"username": "Stan Pinsent"}}, {"_id": "37YHBgvnRn9pDSk2D", "postedAt": "2023-01-12T15:44:59.993Z", "postId": "Hk9vhBhrWbyBYX6xb", "htmlBody": "<p>I would love to do that. Maybe I'll learn more data stuff, because I want to be able to scrub data so I can get more of it, faster. Any idea if that sort of data is even public?</p><p>I agree with you on engagement. It would be good to get better data &nbsp;on that, because number of followers is probably quite a poor proxy for engagement. Numbers of views, likes and comments are probably far better.</p>", "parentCommentId": "ySyXt6q6uy6yL8mqw", "user": {"username": "Stan Pinsent"}}, {"_id": "LCQkaz4fzSSmQMcCk", "postedAt": "2023-02-14T09:56:47.887Z", "postId": "Hk9vhBhrWbyBYX6xb", "htmlBody": "<p>Would love to see a similar analysis for LinkedIn, for example. There are a decent list of groups, from 80K to GWWC, Founders Pledge to the project I work with, GWWC Charity Elections, that aim to target people as professionals, or in specific professions or professional contexts. It would be instructive to see what success EA has had engaging audiences through that platform, and how.</p>", "parentCommentId": null, "user": {"username": "Adam Steinberg"}}]