[{"_id": "sJyEZMhTT74aCdhCo", "postedAt": "2023-01-15T18:31:58.595Z", "postId": "HkmSgJdrPxLuoBDJj", "htmlBody": "<p>[Opinions given are my own].&nbsp;<br><br>I think these are some really good questions, and I would too love to see answers to them.&nbsp;<br><br>Unfortunately, over time I've continuously updated towards thinking that the answers (given or withheld), are not very well thought out.&nbsp;<br><br>A general \"catch-all\" answer I suspect you might receive: countries are prioritised based on the size of their current community, or how many elite universities they have.&nbsp;<br><br>An a positive note, if you suspect (like me), that this prioritisation is partly arbitrary, &nbsp;it puts you in a good position to do \"impact arbitrage\" , because these areas of the world will be relatively neglected by others. I am excited about efforts like the EA-Eastern European community building retreat, as well as community building networks in Africa and India. On a final note, I would just like to quote:</p><blockquote><p><br>Whatever you think the world is withholding from you, you are withholding from the world</p></blockquote>", "parentCommentId": null, "user": {"username": "ElliotJDavies"}}, {"_id": "8ZFFETn8gntumigos", "postedAt": "2023-01-16T02:53:06.274Z", "postId": "HkmSgJdrPxLuoBDJj", "htmlBody": "<p>Those are some excellent questions, although I imagine it would take quite a bit of work to compile the answers to those questions so I would be surprised if you received answers to these questions.</p>", "parentCommentId": null, "user": {"username": "casebash"}}, {"_id": "rAFyJhioximBL5mcr", "postedAt": "2023-01-18T12:44:46.680Z", "postId": "HkmSgJdrPxLuoBDJj", "htmlBody": "<p>Sorry to hear about your experience!&nbsp;</p><blockquote><p><br>Which countries are at the top/bottom of the priority list to be funded? [And why?]</p></blockquote><p>I think this is a great question, and I suspect it's somewhat under-considered. I looked into this a couple years ago as a short research project, and I've heard there hasn't been a ton more work on it since then. So my guess is that the reasoning might be somewhat ad-hoc or intuitive, but tries to take into account important factors like \"size / important-seemingness of country for EA causes\", talent pool for EA, and ease of movement-building (e.g. do we already have high-quality content in the relevant language).&nbsp;</p><p>My guess is that:</p><ul><li>There are some valuable nuances that could be included in assessments of countries, but are either not included or are done so inconsistently.&nbsp;<ul><li>For example, for a small-medium country like Romania it might be more useful to think of a national group as similar to a city group for the country's largest city, and Bucharest looks pretty promising to me based on a quick glance at <a href=\"https://en.wikipedia.org/wiki/Bucharest\">its Wiki page</a> -- but I wouldn't have guessed that if I hadn't thought to look it up. Whereas e.g. Singapore benefits from being a well-known world-class city.&nbsp;</li><li>Similarly, it looks like Romania has a <a href=\"https://en.wikipedia.org/wiki/List_of_countries_by_English-speaking_population\">decent share of English-speakers</a> (~30% or ~6 million) and they <a href=\"https://en.wikipedia.org/wiki/EF_English_Proficiency_Index\">tend to be pretty fluent</a>, but again I wouldn't have really known that beforehand. Someone making an ad-hoc assessment may not have thought to check those data sources, + might not have context on how to compare different countries (is 30% high? low?) .</li></ul></li><li>The skills / personality of group members and leaders probably make up a large part of funders' assessments, but are kinda hard to assess if they don't have a long track record. But they probably need funding to get a track record in the first place!&nbsp;<ul><li>And intuitive assessments of leaders are probably somewhat biased against people who don't come from the assessor's context (e.g. have a different accent), though I hope and assume people at least try to notice &amp; counteract that. &nbsp;&nbsp;</li></ul></li></ul>", "parentCommentId": null, "user": {"username": "deep"}}]