[{"_id": "QhqQN25ixqSxwaJSp", "postedAt": "2022-12-17T17:36:20.680Z", "postId": "Hmbmm7a6BgjKPSqtx", "htmlBody": "<p>Really interesting post. I paricularly like the framework you lay out, and hope it is useful to other advocacy groups. However, I am concerned with the conclusions you have come to for the reasons outlined below. I have focused on the area with which I am most familiar with (expert academic advice to government) but given the amount of errors I have found I have low confidence in the accuaracy of the rest.</p>\n<p>On a high level, I'm interested on why your goal was influencing MPs specifically (rather than eg: cabinet ministers, their SPADs, or influential journalists). My impression is that most MPs have little real influence on policy, but I might be wrong here.</p>\n<p>I will now list parts of this post and the linked mapping PDF which appear wrong or questionable to me.</p>\n<blockquote>\n<p>one government expert is the Scientific Advisory Group for Emergencies (SAGE), which had huge influence on the policy making process for COVID response and worked directly with MPs to achieve this</p>\n</blockquote>\n<p>This is not really how the process worked. SAGE was appointed by the government and their advice went directly to the cabinet. Perhaps occaisionally the committee directly worked with cabinet ministers but for the most part their advice would first go to civil servants (eg: Patrick Vallance as Chief Scientific Advisor). MPs, including senior ones such as the Leadeer of the Opposition, would not see their advice before it was public. Their influence was due to the mandate the governement gave them, rather than any political process SAGE undertook.</p>\n<p>You talk about how SAGE does not have any responsibility for pandemic preparedness. While true, other expert advisory bodies (most notably NERVTAG, SPI-M, and SPI-B) do have this responsibility, and most SAGE attendees from the pandemic are also on one of these other bodies.</p>\n<p>SAGE attendees are academic experts, I'm not sure why you've got them under government experts that \"rely on external scientific advice\". Its the attendees themselves, and their groups, doing the science the vast majority of the time!</p>\n<p>Public Health England, NHS Test and Trace, and the Joint Biosecurity Centre (JBC) have all been discontinued with all their pandemic-relevant work being transferred into UKHSA. The JBC wasn't activated in 2020, it was created.</p>\n<p>You have ranked government experts as highly likely to support your campaign. However, most of them are civil servants and therefore cannot take a public poltical position or lobby MPs on behalf of a pressure group.</p>\n<blockquote>\n<p>Academic experts were included to a very limited extent during the pandemic planning and response.</p>\n</blockquote>\n<p>You said yourself that SAGE was very influential! <a href=\"https://www.gov.uk/government/publications/scientific-advisory-group-for-emergencies-sage-coronavirus-covid-19-response-membership/list-of-participants-of-sage-and-related-sub-groups\">SAGE is full of academic experts, including from both LSHTM and the University of Oxford, both of which you singled out</a>.</p>\n<blockquote>\n<p>Academic expert engagement process with the policymakers is not clear-cut and quite difficult, which makes this group's influence low, unless the experts are explicitly brought on to an internal group, such as a panel, which increases their impact to medium.</p>\n</blockquote>\n<p>I am confused how being on a panel means your impact is medium when that panel (SAGE and its subgroups) is high impact.</p>\n<blockquote>\n<p>There were a few groups that were evaluated as representing academic experts involved in the covid-19 pandemic response, including London School of Hygiene and Tropical Medicine, The Lancet (a scientific journal), Nobel Laureate Sir Paul Nurse, University of Oxford. Most of their responses were critical of the responses put forth by the UK Government as being inadequate.</p>\n</blockquote>\n<p>This is a very strange and narrow set of academic experts you have chosen.</p>\n<blockquote>\n<p>We did not find academic experts who would oppose measures to mitigate or prevent pandemics.</p>\n</blockquote>\n<p>What about the Great Barrington Declaration?</p>\n<blockquote>\n<p>while [SAGE] may not have a large impact on this stakeholder, a pandemic-related campaign will still be calling on political reform that may ease their role in future pandemics</p>\n</blockquote>\n<p>I'm confused who exactly you are referring to here. SAGE does not have a permanent membership (except its chair, the UK Chief Scientific Advisor) but experts (normally academics) are invited each time it meets. They are chosen to have the relevant expertise for the specific emergency.</p>\n<blockquote>\n<p>Lastly, the academic experts that were involved in the COVID-19 pandemic response had little influence on the government making policy during the pandemic, and thus their influence is low.</p>\n</blockquote>\n<p>At times this was true, but is overly strong. Here is a few things that were heavily influenced by academic experts.</p>\n<ul>\n<li>The 2021 reopening plan was heavily based on modelling experts from academic groups.</li>\n<li>Delaying step 4 in 2021 was based on similar evidence.</li>\n<li>The use of rapid testing for early release was heavily informed by academic work.</li>\n<li>Testing on borders was informed by several academic analyses.</li>\n<li>JCVI (a committee of academic experts) produced guidance that was always followed for vaccinations.</li>\n<li>The decision to implement the first lockdown is often credited to a paper from Imperial College.</li>\n</ul>\n", "parentCommentId": null, "user": {"username": "jooke"}}, {"_id": "qLmXwaMj65AyFPXBE", "postedAt": "2023-01-20T01:46:09.756Z", "postId": "Hmbmm7a6BgjKPSqtx", "htmlBody": "<p>Hi @JoshuaBlake - thank you so much for taking the time to read the post and especially providing this feedback. This is incredibly helpful in providing additional context and information which we would like to add to the post/report. We would like to address and clarify some of the points you’ve brought up:</p><p>1. The post focuses on influencing MPs because the campaign that was aiming to &nbsp;garner support from the public. Since MPs have the opportunity to listen and represent the ideas of their community, they would be a bridge between their constituents and the government. Knowing that MPs can propose new laws, raise issues, and ask questions to government ministers, having the support of and raising awareness to MPs has a potential impact on future pandemic-related policies. While there may be other politicians or stakeholders that could have been influenced, we kept the scope of this narrow to have a more focused topic to research on. It could be a good recommendation for other future research or articles to look into and compare the political influence of the stakeholders you mentioned to gain a better understanding of how to influence on policy in the UK.&nbsp;</p><p>2. You’ve made a fair point on the process of counselling that SAGE provides to the government. Seeing that they do not directly influence MPs, then their relation to policy-making would stem from their influence on the cabinet as you’ve mentioned. Having a campaign supported by SAGE could indirectly influence MPs to support as well from the perspective that it would give credential to the campaign. With this, ranking them as medium for political influence still stands as while they seldomly/never work directly with MPs, policy is still heavily impacted by their guidance.&nbsp;</p><p>3. Including NERVTAG, SPI-M and SPI-B to the stakeholder map could provide a greater number of examples to compare against for the ranking of government experts. This could be included in an edited/future post or report.</p><p>4. You mention that SAGE is the same as academic experts. While you're right that SAGE is made up of academic experts, their&nbsp;influence&nbsp;is different from academic&nbsp;experts who are not on government panels, of which we wanted to make the distinction. The Parliament themselves acknowledged&nbsp;that the influence of academic experts outside of SAGE was&nbsp;<a href=\"https://committees.parliament.uk/publications/7496/documents/78687/default/\">limited during the pandemic</a>, and thus potentially poor choices were made at the beginning of the pandemic due to the narrow focus of SAGE. &nbsp;</p><p>5. Thank you for noting the discontinuation of JBC. Since work has been transferred to UKSHA, perhaps it would be better to replace JBC with them and determine the ranking based on its current responsibilities and role.</p><p>6. For the Great Barrington Declaration, noting its international reach, it would be difficult to place and determine the influence that it would have over UK politics. We aimed to focus on more local groups to better gauge how we might rank them. Would love to hear any thought processes you might have for including such international initiatives and how to determine the influence it might have over MPs.</p><p>7. Placing academic experts as “low” for political influence was based on the articles we came across and read. Seeing the examples you gave on how these experts influenced decisions such as rapid testing or reopening, we would love to look into those articles. Would be great if you had the links for these, and we can look into adjusting the ranking for a future post.&nbsp;</p><p>8. The impact of any one group is difficult to quantify and will depend on the person, the policy issue, at a minimum. We collected the information based on reports we found from various government and public sources (see&nbsp;<a href=\"https://drive.google.com/file/d/1nc5wHr1XVn8gYNfBxX0JvPSxj2ygQV5z/view\">here</a>&nbsp;for the summary of the examples), supplemented by review from those who have worked in or with the government sector. While we tried to inject some nuance into the report, considering the complexities of government and influence, but realize that it's difficult to do it well.</p><p>Again, we would like to express our thanks to you for taking the time to read the article and write your feedback. We understand that there are shortcomings to this article given information accessed, and limited background and context of UK politics. However, we still stand by the potential of the information compiled to be helpful and act as a starting point for other organisations who might be new to the campaigning space in the UK. Having constructive and helpful discussions on how these perspectives can be improved, can be a great step forward in better understanding how to influence MPs and policy.</p><p>-Alex and Nikki</p>", "parentCommentId": "QhqQN25ixqSxwaJSp", "user": {"username": "Alexandra Malikova"}}]