[{"_id": "WgsqMFc6k9SjFYg5Q", "postedAt": "2023-12-20T05:55:27.281Z", "postId": "HMgwRxMEe86TYyQZZ", "htmlBody": "<p>I am somewhat dissapointed that there are no recommendations for political candidates, which often benefit disproportionately from support from individual donors, and it also seems that there are no c(4)s which are highlighted in any of these cause areas, despite their usefulness in many policy areas.</p>\n", "parentCommentId": null, "user": {"username": "Davidmanheim"}}, {"_id": "haiTKmnBvcfZj2f2J", "postedAt": "2023-12-20T07:43:32.683Z", "postId": "HMgwRxMEe86TYyQZZ", "htmlBody": "<p>Thanks for the interesting recommendations.</p>\n<p>I've realized post writing this may be a bit nitpicky but leaving it up for now ..</p>\n<p>As usual maybe I'm missing something obvious, but it seems a little strange to me that an institution should post recommendations from staff. Why should I put any more weight on a recommendation from an OpenPhil staff rather than any other EA person who had thought a lot about this?</p>\n<p>My initial feelings are that I would prefer</p>\n<ol>\n<li>\n<p>Staff to post individually their ideas as themselves independently (or semi independently) of their org.</p>\n</li>\n<li>\n<p>Follow the CEA lead where each individual staff posted where they donated their money and a little on why. I really liked this format as it showed both skin in the game and a diverse range of perspectives.</p>\n</li>\n</ol>\n<p>EDIT: have realized this post isn't so different from that.</p>\n<p>I suppose I'm asking what's the benefit of this format over individual recommendations?</p>\n", "parentCommentId": null, "user": {"username": "NickLaing"}}, {"_id": "Gw4FQ3h5PBuTAkufo", "postedAt": "2023-12-20T13:39:53.920Z", "postId": "HMgwRxMEe86TYyQZZ", "htmlBody": "<p>Open New York is a c(4) (as noted in the writeup above).</p>", "parentCommentId": "WgsqMFc6k9SjFYg5Q", "user": {"username": "Lauren Gilbert"}}, {"_id": "b7tiGHxN5b8TY4A2e", "postedAt": "2023-12-20T14:27:45.316Z", "postId": "HMgwRxMEe86TYyQZZ", "htmlBody": "<p>I think there are valid reasons that Open Phil might not want to convey staff members' suggestions about political candidates that third parties might consider funding. In particular, assuming that Open Phil is directing money toward getting candidate X elected, it might not want to take the next step and appear to be fundraising for candidate X. (I know these are not official Open Phil recommendations, but most third parties would view listing candidates here as close enough to fundraising for them.)</p>", "parentCommentId": "WgsqMFc6k9SjFYg5Q", "user": {"username": "Jason"}}, {"_id": "EjajpgAxAd4DRHd55", "postedAt": "2023-12-20T15:20:38.496Z", "postId": "HMgwRxMEe86TYyQZZ", "htmlBody": "<p><strong>Executive summary</strong>: This post shares staff-suggested giving opportunities for individuals interested in the same cause areas that Open Philanthropy focuses on.</p><p><strong>Key points</strong>:</p><ol><li>Recommendations are for strong options, not outright recommendations or views of best options across all causes. GiveWell top charities are also highly cost-effective evidence-backed options.</li><li>Suggestions fit areas Open Philanthropy focuses on and may be good fits for individual donors, but don't represent overall strongest Open Phil grantees.</li><li>Explanations are informal and meant to indicate judgment of suggesting staff member. Don't necessarily represent institutional views.</li><li>Suggestions cover a range of focus areas: global health and development, effective altruism, farm animal welfare, land use reform, potential AI risks.</li><li>Multiple options suggested for some areas to provide portfolio choice. Most need to diversify funding sources.</li><li>All suggestions represent opportunities staff members find promising for individual donors to consider based on their expertise.</li></ol><p>&nbsp;</p><p>&nbsp;</p><p><i>This comment was auto-generated by the EA Forum Team. Feel free to point out issues with this summary by replying to the comment, and</i><a href=\"https://forum.effectivealtruism.org/contact\"><i>&nbsp;<u>contact us</u></i></a><i> if you have feedback.</i></p>", "parentCommentId": null, "user": {"username": "SummaryBot"}}, {"_id": "zJnKAErz5kN77CLBA", "postedAt": "2023-12-20T16:07:12.560Z", "postId": "HMgwRxMEe86TYyQZZ", "htmlBody": "<p>Candidate advocacy is somewhat discouraged for legal and social reasons by the <a href=\"https://forum.effectivealtruism.org/posts/yND9aGJgobm5dEXqF/guide-to-norms-on-the-forum#Politics_on_the_EA_Forum\">forum 'norms' (rules)</a>:</p><blockquote><p>The following types of posts will be in <a href=\"https://forum.effectivealtruism.org/posts/Y8gkABpa9R6ktkhYt/forum-user-manual#_Personal_blog__posts\">the “Personal Blog” category</a> (meaning that they will not appear on Frontpage for users who haven't modified the default settings, but will appear in “All Posts,” in the author’s profile, and on any relevant tag pages):</p><ul><li>Posts advocating for or against a specific political candidate or group of candidates (e.g. “Why effective altruists should vote for candidate Y”)</li></ul></blockquote>", "parentCommentId": "WgsqMFc6k9SjFYg5Q", "user": {"username": "Larks"}}, {"_id": "HRc6xdWEADxjQkLt5", "postedAt": "2023-12-20T17:12:35.496Z", "postId": "HMgwRxMEe86TYyQZZ", "htmlBody": "<p>I'm an OP staffer who helped to put the post together. Thanks for the nitpicks!</p><blockquote><p>I suppose I'm asking what's the benefit of this format over individual recommendations?</p></blockquote><p>I see the main benefit as convenience. If I'd asked OP staff to write individual Forum posts, I'd have gotten less interest than I did with \"send me a few sentences and you can be part of a larger post\". Writing an entire post is a bigger hurdle, and I think some people would feel weird writing a post just a few sentences long (even if the alternative was \"no post\").</p><blockquote><p>Why should I put any more weight on a recommendation from an OpenPhil staff rather than any other EA person who had thought a lot about this?</p></blockquote><p>I don't necessarily think you should.</p><p>But I personally put at least moderate weight on recommendations from people in research roles who’ve thought a lot about an issue, inside or outside of OP. (I like the GiveWell “where our people give” posts for the same reason!) I wish we had more charity recommendations from such people. And at OP, we’ve heard from enough people who find these posts valuable that we thought it was worth putting another one together.</p>", "parentCommentId": "haiTKmnBvcfZj2f2J", "user": {"username": "aarongertler"}}, {"_id": "33PFxgAfjn9yDX5Da", "postedAt": "2023-12-20T17:28:30.555Z", "postId": "HMgwRxMEe86TYyQZZ", "htmlBody": "<p>Apologies for the slightly 'gotcha' question, but would you mind talking a little about why OP isn't funding these things, or funding them more? From a very naive theoretical perspective it seems like the utility of the marginal dollar to everything OP gives money to should be ~ equal, at least within cause areas.</p>", "parentCommentId": null, "user": {"username": "Larks"}}, {"_id": "88cy3Rnqo3Gtj9wa2", "postedAt": "2023-12-20T19:48:40.039Z", "postId": "HMgwRxMEe86TYyQZZ", "htmlBody": "<p>One reason:</p>\n<blockquote>\n<p>Many of these recommendations appear here because they are particularly good fits for individual donors. This shouldn’t be seen as a list of our strongest grantees overall (although of course there may be overlap).</p>\n</blockquote>\n<p>Plus, people can have idiosyncratic preferences/weights on some issues, so I wouldn't expect all recommendations to be equal to each other and to OP's grant portfolio.</p>\n", "parentCommentId": "33PFxgAfjn9yDX5Da", "user": {"username": "therealslimkt"}}, {"_id": "wfQMTE6YqnnygGkHP", "postedAt": "2023-12-21T07:00:38.559Z", "postId": "HMgwRxMEe86TYyQZZ", "htmlBody": "<p>Thanks nice one appreciate the reply</p>\n", "parentCommentId": "HRc6xdWEADxjQkLt5", "user": {"username": "NickLaing"}}, {"_id": "cvFqbxtGFeBaDjJKx", "postedAt": "2023-12-21T11:05:07.348Z", "postId": "HMgwRxMEe86TYyQZZ", "htmlBody": "<p>(Original comment retracted, however,) I would think that staff members could recommend funding political campaigns without endorsing specific candidates. I think almost all of the hesitation of recommending doing so is the FTX fiasco and the impact on almost all of the political work that had been done in EA, which SBF was funding a large portion of - but I think that's a really bad reason not to pursue this type of work, albeit obviously not doing so with dubious campaign finance ethics, much less stolen customer funds.</p>", "parentCommentId": "b7tiGHxN5b8TY4A2e", "user": {"username": "Davidmanheim"}}, {"_id": "PzsiXfknFzBoDmFaR", "postedAt": "2023-12-21T11:10:23.278Z", "postId": "HMgwRxMEe86TYyQZZ", "htmlBody": "<p>Thank you for noting this, and I obviously missed it, and have retracted the comment due to you pointing this out and other replies that changed my view.&nbsp;<br><br>That said, I think that housing policy is the most obvious place for c(4) donations, given the local political nature of the work, but I'm frustrated that there's currently so little similar direct work on the national level in the US, for example, in farm animal welfare, in biosecurity and global health, and in AI policy. I think that more political engagement in each area by individual donors small and medium size could be very useful. But as I said in another comment: \"I think almost all of the hesitation of recommending [this type of donating] is the FTX fiasco and the impact on almost all of the political work that had been done in EA, which SBF was funding a large portion of - but I think that's a really bad reason not to pursue this type of work, albeit obviously not doing so with dubious campaign finance ethics, much less stolen customer funds.\"</p>", "parentCommentId": "Gw4FQ3h5PBuTAkufo", "user": {"username": "Davidmanheim"}}, {"_id": "pkutBs4fMzTJYeNxJ", "postedAt": "2023-12-23T15:45:06.533Z", "postId": "HMgwRxMEe86TYyQZZ", "htmlBody": "<p>Thanks for sharing, Alexander!</p><blockquote><p>Ah, I am also allocating the construction budget at the same time to expanding&nbsp;farms and manufacturing dryers now (previously, I was reserving half for each).&nbsp;If a country whose real GDP is 1 % of the global one has the goal of satisfying e.g. 10 % of the national caloric requirement, it would spend 0.1 % (= 0.01*0.1) of the global non-final CapEx building seaweed farms and manufacturing dryers during the scale-up period (during which I assume no seaweed production).</p></blockquote><p>Are there plans to estimate the marginal cost-effectiveness of effective giving initiatives?</p>", "parentCommentId": null, "user": {"username": "vascoamaralgrilo"}}, {"_id": "kmDic7EswQoBtxWha", "postedAt": "2023-12-24T13:43:54.660Z", "postId": "HMgwRxMEe86TYyQZZ", "htmlBody": "<p>Is it possible to elaborate at all on <em>why</em> they'd be particularly good fits for individual donors? I imagine in many cases the answer is a bit sensitive as to why OP may prefer to fund an org more but the org itself may prefer not to be funded by OP more but instead funded by individual donors. And I certainly can use my own private information to make some of those guesses. But reading this list it's actually pretty hard to tell what is going on.</p>\n", "parentCommentId": "88cy3Rnqo3Gtj9wa2", "user": {"username": "Peter_Hurford"}}]