[{"_id": "PtTdQ9mbJxJm58Bba", "postedAt": "2021-11-10T09:50:16.500Z", "postId": "HmohraBsqhxZkrpeD", "htmlBody": "<p>Hi, everyone! &nbsp;I think the question here is focused on the higher order questions of what GiveWell will recommend (and one level higher) how to ask forecasting questions about it. &nbsp;But, to not answer that, I will say that at r.i.c.e., our fieldwork in India is, in the sense of a majority of our time, effort and staff, mostly spent on lactation consulting and Kangaroo Mother Care &nbsp;for low birthweight babies right now. &nbsp;(One question for the author might be whether a KMC program, which is fundamentally about breastfeeding but also has other mechanisms (keeping the baby warm, keeping the caregiver informed about the baby's status) would could as breastfeeding promotion for this forecast.)</p><p>We're working in Uttar Pradesh, which is a context where women's modesty is an important cultural issue. &nbsp;But one challenge we are facing is demand: it's hard for us to get mothers and families more broadly to want to go along with our program. &nbsp;I don't think this should have surprised us so much, but in fact the bindingness of this constraint did surprise us. &nbsp;I would be very excited to hear about practical research, ethnography, or just trial and error anyone is doing about this.</p><p>From a prioritization point of view, this sort of approach competes against more resource-intensive neonatal care, such as investing in incubators (which may or may not be plugged in and turned on) which work against establishing breastfeeding by separating the moms and babies. &nbsp;So, another indirect way of doing \"breastfeeding promotion\" may be to lean against that sort of medicalized policy.</p><p>Like so many things for early-life health in poor populations (open defecation, clean cooking fuel use,...), this is an area where the \"second stage\" biological mechanism seems very well established to me, and what we need is good evidence and strategies for a better \"first stage\" effect of programs on behavior change.</p>", "parentCommentId": null, "user": {"username": "deanspears"}}, {"_id": "ozsqirunMT647BGcu", "postedAt": "2021-11-10T11:08:01.129Z", "postId": "HmohraBsqhxZkrpeD", "htmlBody": "<p>Thanks Dean, love to hear from an expert.&nbsp;</p>", "parentCommentId": "PtTdQ9mbJxJm58Bba", "user": {"username": "nathan"}}]