[{"_id": "z5qE9pa4YKNEwKdXJ", "postedAt": "2023-05-31T09:24:07.361Z", "postId": "HMXAgWrCZ6aagHYqg", "htmlBody": "<p>Impressive results and great seeing the community grow so fast.&nbsp;<br><br>Any tips on getting high-level endorsements? What's your strategy? We had Rutger Bregman write about us too and it moved the needle on a bunch of levels, but we're still wondering what's the best way to replicate.</p><p><br><br>&nbsp;</p>", "parentCommentId": null, "user": {"username": "BOAS"}}, {"_id": "owW9dTzZcno9tzvKe", "postedAt": "2023-05-31T10:17:13.295Z", "postId": "HMXAgWrCZ6aagHYqg", "htmlBody": "<p>Thanks!&nbsp;<br><br>I wish I could claim credit for the endorsements EA has received from Rutger Bregman but much of it happened before my time and he mostly just followed his own curiosity anyway. It's not like he was persuaded to endorse, he just thought it was a good idea.&nbsp;<br><br>The only maybe helpful anecdote I can provide is as follows. Before Bregman had spoken much about EA in public, one of our uni organisers slid him a cheeky DM: \"Hey, fancy doing an event with us?\" and, to his surprise, he agreed. Despite being relatively new to EA organising, said organiser proceeded to double down and book a 500-person lecture hall. They then worked together with other uni group organisers to sell out the venue and put on a very successful event.&nbsp;<br><br>The takeaways: don't be afraid of cheeky DMs, aim high, and work with others.&nbsp;</p>", "parentCommentId": "z5qE9pa4YKNEwKdXJ", "user": {"username": "James Herbert"}}, {"_id": "z5uzYQwXfRDavBvog", "postedAt": "2023-05-31T16:10:50.298Z", "postId": "HMXAgWrCZ6aagHYqg", "htmlBody": "<p>Great takeaways. What worked for me in getting NYT bestsellers and CEO's (obviously aiming high) to respond is the same: send highly relevant DMs that show you know their work deeply. This can actually be a 10 page email contrary to everyone saying it has to be short. You have to make sure your message is different/better than 99% of what they get, and you can only do that by building something that takes long/hard work so no shortcuts there.&nbsp;<br>&nbsp;</p>", "parentCommentId": "owW9dTzZcno9tzvKe", "user": {"username": "BOAS"}}]