[{"_id": "28HRjE4hbLWNtPixL", "postedAt": "2023-08-05T11:46:41.609Z", "postId": "HMxwYsFBbSnNjzq4y", "htmlBody": "<p>Downvoted because it was very uninformative on the topic that matters most. Just saying 'there are a range of estimates' is about as unhelpful as you can be w.r.t a datapoint.</p>\n<p>If I take the time to read through the linked papers I will return with a more substantive comment.</p>\n<p>Also the fact that the scene ended with the most pessimistic estimates highlighted was annoying.</p>\n<p>Edit: also the title is clickbaity and unsupported-- I get the impression they don't really know what the word 'probably' means beyond what they read in a pdf about SEO?</p>\n", "parentCommentId": null, "user": {"username": "Fergus Fettes"}}, {"_id": "rHphCLEqRpGo92NKF", "postedAt": "2023-11-05T21:33:00.482Z", "postId": "HMxwYsFBbSnNjzq4y", "htmlBody": "<p>While I agree with Fergus that the video shared above is not very informative, I do think we should reflect more on the feasibility of cultured meat within the community. A report commissioned by Open Philanthropy from a top scientist found that cultured meat might never work at scale.&nbsp;<br>I would encourage you to read this article on it here:<br><br><a href=\"https://thecounter.org/lab-grown-cultivated-meat-cost-at-scale/\">Lab-grown meat is supposed to be inevitable. The science tells a different story.</a></p><p>Recent reporting by WIRED on Upside Foods is also concerning.&nbsp;</p><p><a href=\"https://www.wired.com/story/upside-foods-lab-grown-chicken/\">Insiders Reveal Major Problems at Lab-Grown-Meat Startup Upside Foods | WIRED</a></p><p>My fear is that cultured meat might be (another) area in which the community has fallen into groupthink, causing us to direct a lot of resources in a misguided way (i.e. the Good Food Institute's cultured meat efforts).&nbsp;<br><br>Very low confidence, but maybe it would make more sense to double down on plant-based meat, making products less competitive, and boring old moral advocacy?<br>I'd be very keen to hear what others think.&nbsp;<br>&nbsp;</p>", "parentCommentId": null, "user": {"username": "Meursault"}}, {"_id": "arz6RMtLHJboiQSva", "postedAt": "2023-11-06T10:47:51.335Z", "postId": "HMxwYsFBbSnNjzq4y", "htmlBody": "<p>Thanks so much for sharing the article from The Counter. It was a gripping read, although it didn't tell me what I wanted to hear.</p>\n<p>I really hope the technical challenges can be overcome. I would be super sad and discouraged if cell cultured meat didn't start to take off within, say, the next 15 years.</p>\n", "parentCommentId": "rHphCLEqRpGo92NKF", "user": {"username": "Yarrow Bouchard"}}, {"_id": "hyaiPnCrZvBbPwWnR", "postedAt": "2023-11-12T17:05:44.871Z", "postId": "HMxwYsFBbSnNjzq4y", "htmlBody": "<p>I'm happy you found it insightful, despite the discouraging content.&nbsp;</p><p>I have no direct knowledge of the field, but if the analysis holds true, I assume takeoff within the next 15 years seems very unlikely.&nbsp;</p><p>That being said, maybe we can be more optimistic about progress in plant-based meat alternatives in that timeframe. I recently learned about Rebellyous Foods and found their (reported) progress on making fake chicken more cost and taste-competitive encouraging!</p><p>Although I assume that will also only take us so far (see the recent post by Jacob Peacock on this forum). In the end, we might just be stuck hoping that humans' values vis-à-vis animals improve. Along with trying to guide them in that direction, regardless of how ineffective or at least hard to quantify moral advocacy might be.&nbsp;<br>&nbsp;</p>", "parentCommentId": "arz6RMtLHJboiQSva", "user": {"username": "Meursault"}}]