[{"_id": "M9kCqEbGcavosrsE6", "postedAt": "2022-11-16T05:38:20.544Z", "postId": "HPdWWetJbv4z8eJEe", "htmlBody": "<p>You may want to also consider the situation where an organisation doesn't want to pay employees with funds that could potentially be clawed back or which could be seen to be morally-tainted (depending on what information we find out).</p>", "parentCommentId": null, "user": {"username": "casebash"}}, {"_id": "sGFsymdBN92vXBigt", "postedAt": "2022-11-16T09:09:08.586Z", "postId": "HPdWWetJbv4z8eJEe", "htmlBody": "<p>This is wonderful news. Thank you very much for getting that up and running.</p>", "parentCommentId": null, "user": {"username": "Michelle_Hutchinson"}}, {"_id": "Zf7B288M3HW4qbZy4", "postedAt": "2022-11-16T09:41:53.159Z", "postId": "HPdWWetJbv4z8eJEe", "htmlBody": "<p>If a grant / grantee is doing work which aligns with Open Phil's work, but is more properly classified as global health or animal welfare, can they still apply here, should they apply in some other way, or is Open Phil not the correct vehicle?</p>", "parentCommentId": null, "user": {"username": "Davidmanheim"}}, {"_id": "ck4oyNqqaCXyniKAj", "postedAt": "2022-11-16T12:37:11.326Z", "postId": "HPdWWetJbv4z8eJEe", "htmlBody": "<p>This sort of falls under the second category, \"Grantees who received funds, but want to set them aside to return to creditors or depositors.\" At least that's how I read it, though the more I think about it the more this category is kind of confusing and your wording seems more direct.</p>", "parentCommentId": "M9kCqEbGcavosrsE6", "user": {"username": "sawyer"}}, {"_id": "eEEynrSoeMksMzX3q", "postedAt": "2022-11-16T12:37:17.008Z", "postId": "HPdWWetJbv4z8eJEe", "htmlBody": "<p>Really excited to see this initiative!</p>\n<p>Should grantees with significant runway apply for this, (ie, they lost out on money, but this mostly cut into future runway, and this won't really affect things for the next few months), or would you like to reserve this for grantees with urgent need?</p>\n<p>Also, has OpenPhil considered guaranteeing some/all grantees for covering clawbacks? This seems like it might be reasonably cheap in expectation, but save a lot of people from stressful distractions and unnecessary conservatism (but I imagine also has a bunch of legal consequences and possibly significantly increases the risk of clawbacks!)</p>\n", "parentCommentId": null, "user": {"username": "Neel Nanda"}}, {"_id": "h3iq5LdiBhMhrreGa", "postedAt": "2022-11-16T15:46:26.701Z", "postId": "HPdWWetJbv4z8eJEe", "htmlBody": "<p>I think it'd be preferable to explicitly list as a reason for applying something along the lines of \"Grantees who received funds, but want to set them aside to protect themselves from potential clawbacks\".&nbsp;</p><p>Less importantly, it'd possibly be better to make it separate from \"to return to creditors or depositors\".&nbsp;</p>", "parentCommentId": "ck4oyNqqaCXyniKAj", "user": {"username": "renanaraujo"}}, {"_id": "tExqcmqHm7w5eBWMo", "postedAt": "2022-11-16T19:28:09.778Z", "postId": "HPdWWetJbv4z8eJEe", "htmlBody": "<p>On the second paragraph, I don't think it has been established that insuring clawback risk would be cheap in expectation. Also, in many cases, insurance increases the risk of a lawsuit or reduces the other side's willingness to settle.&nbsp;</p><p>For example, suppose I think someone negligently breaks my leg and I am considering whether it is worthwhile to litigate. If I find out the person is an uninsured second-year philosophy grad student, I probably won't bother -- collecting any judgment will be very difficult, and a rational judgment debtor will just file for bankruptcy and get the debt wiped anyway. If the person is a middle-class tourist from the UK, I will probably find it worthwhile to sue if the damages are big enough and if I think there is a good enough chance I could collect on any judgment. Now, if I know that either of these people were insured, I am much more likely to sue, and I am not going to be willing to reduce a settlement demand based on doubts about collectability.</p><p>However, I think there is a good idea here. I would suggest there is a legal clawback risk and a \"moral clawback risk\" -- that the grantee will be (and/or feel) ethically obliged to return some or all money although not legally required. Replacing some or all of the FTX-aligned funds seems to weigh the combined legal + moral clawback risk at 100%. Although offering insurance has some downsides, it does seem less expensive than unconditionally replacing the funds.&nbsp;</p><p>So there may be some conditions under which a funder would find it wortwhile to provide clawback insurance while it would not fund the project.&nbsp;</p><p>That sounds <i>relatively</i> straightforward as it comes to legal clawback risk; it is interesting to consider how &nbsp;\"insurance\" might work if the \"insurer\" were willing to provide some coverage for moral clawback risk. For those with certain beliefs about moral clawback, the grantee's moral-clawback obligation or non-obligation can already be determined, so an \"insurance\" paradigm makes no sense. But for some of us, the nature and extent of a moral-clawback obligation depends on information that is not yet known.</p><p>Would the \"insurer\" decide the extent to which the ultimately determined facts create an ethical obligation to return funds? Or perhaps the \"insurer\" would offer 100% coverage for legal clawback risk and would allow the \"insured\" to decide moral clawback subject to a coinsurance requirement. For example, the \"insurer\" might only match the amount the \"insured\" was willing to voluntarily return out of its own pocket. &nbsp;That would address concerns that grantees may be too quick to find a moral-clawback obligation if the cost is coming entirely out of someone else's pocket, and reduce the cost of providing \"insurance.\"</p>", "parentCommentId": "eEEynrSoeMksMzX3q", "user": {"username": "Jason"}}, {"_id": "hbGBMACiHHnX3qTKR", "postedAt": "2022-11-16T19:44:55.609Z", "postId": "HPdWWetJbv4z8eJEe", "htmlBody": "<p>I strongly suspect there are legal reasons that covering future clawbacks, especially if they say so explicitly, is not going to be workable, or at least is significantly more complex / dangerous legally.</p>", "parentCommentId": "M9kCqEbGcavosrsE6", "user": {"username": "Davidmanheim"}}, {"_id": "LEpRNzuif6iHLzzyC", "postedAt": "2022-11-16T22:26:17.289Z", "postId": "HPdWWetJbv4z8eJEe", "htmlBody": "<p>(I work at Open Phil assisting with this effort.)</p>\n<p>We think that people in this situation should apply. The language was intended to include this case, but it may not have been clear.</p>\n", "parentCommentId": "M9kCqEbGcavosrsE6", "user": {"username": "reallyeli"}}, {"_id": "FBMspjfwvm6b35BwA", "postedAt": "2022-11-16T22:27:05.168Z", "postId": "HPdWWetJbv4z8eJEe", "htmlBody": "<p>(I work at Open Phil assisting with this effort.)</p>\n<ol>\n<li>\n<p>Any grantee who is affected by the collapse of FTXFF and whose work falls within our focus areas (biosecurity, AI risk, and community-building) should feel free to apply, even if they have significant runway.</p>\n</li>\n<li>\n<p>For various reasons, we don’t anticipate offering any kind of program like this, and are taking the approach laid out in the post instead. Edit: We’re still working out a number of the details, and as the <a href=\"https://forum.effectivealtruism.org/posts/HPdWWetJbv4z8eJEe/open-phil-is-seeking-applications-from-grantees-impacted-by?commentId=LEpRNzuif6iHLzzyC\">comment below</a> states, people who are worried about this should still apply.</p>\n</li>\n</ol>\n", "parentCommentId": "eEEynrSoeMksMzX3q", "user": {"username": "reallyeli"}}, {"_id": "gj6WdzF8edobdsZgX", "postedAt": "2022-11-18T06:33:11.089Z", "postId": "HPdWWetJbv4z8eJEe", "htmlBody": "<p>(I work at Open Phil on Effective Altruism Community Building: Global Health and Wellbeing)</p>\n<p>Our understanding is that only a small proportion of FTXFF’s grantees would be properly classified as global health or animal welfare. Among that subset, there are some grantees who we think might be a good fit for our current focus areas and strategies. We’ve reached out individually to grantees we know of who fit that description</p>\n<p>That being said, it’s possible we’ve missed potential grantees, or work that might contribute across multiple cause areas. If you think that might apply to your project, you can apply through the same form.</p>\n", "parentCommentId": "Zf7B288M3HW4qbZy4", "user": {"username": "JamesSnowden"}}, {"_id": "CxDxfudjjzEBmE8jN", "postedAt": "2022-11-19T10:03:26.331Z", "postId": "HPdWWetJbv4z8eJEe", "htmlBody": "<p>How quickly should grantees impacted by recent events apply to this call? Is there a hard or soft deadline for these applications? I have to decide how much time I should invest in adapting, updating, and improving the previous application. I assume you want applicants to attach a proposal detailing the planned projects, the project's pathway to impact, and evidence of its chances to succeed.</p>", "parentCommentId": null, "user": {"username": "Falk Lieder"}}, {"_id": "mZhhhnZEWykiB4RAy", "postedAt": "2022-11-21T00:14:47.528Z", "postId": "HPdWWetJbv4z8eJEe", "htmlBody": "<p>I recently filled out the Airtable form, but was surprised to see when I got my e-mail receipt that many of the answers I provided did not appear.</p>\n<p>How would you suggest that I and others affected by this proceed? Thanks!</p>\n<p>[edit: extraneous information removed]</p>\n", "parentCommentId": null, "user": {"username": "pseudobison"}}, {"_id": "PLQAbAciriyScPbFx", "postedAt": "2022-11-21T06:27:45.061Z", "postId": "HPdWWetJbv4z8eJEe", "htmlBody": "<p>(I work at Open Phil assisting with this effort.)</p>\n<p>Thanks for pointing this out;&nbsp;it looks like there was a technical error which excluded these from the email receipt, which we've now fixed. The information was still received on our end, so you don't need to take any extra actions.</p>\n", "parentCommentId": "mZhhhnZEWykiB4RAy", "user": {"username": "reallyeli"}}, {"_id": "aWRe4g9J7SFkcRqCQ", "postedAt": "2022-11-22T05:02:43.711Z", "postId": "HPdWWetJbv4z8eJEe", "htmlBody": "<p>The application form is actually really restrictive once you open it-- when I filled it out, it explicitly instructed not to write any new material and only attach old material that was sent to FTXFF, and only had a &lt;20 word box and &lt;150 word box for grant descriptions. Today when I open the form even those boxes have disappeared. I think it's meant to be a quite quick form, where they'll reach out for more details later.</p>", "parentCommentId": "CxDxfudjjzEBmE8jN", "user": {"username": "Vael Gates"}}, {"_id": "iZdhRLzN7WPHGgBmt", "postedAt": "2022-11-22T06:21:36.535Z", "postId": "HPdWWetJbv4z8eJEe", "htmlBody": "<p>Thank you so much for pointing that out, Vael! I had completely overlooked that information. That's really helpful to know.</p>", "parentCommentId": "aWRe4g9J7SFkcRqCQ", "user": {"username": "Falk Lieder"}}, {"_id": "dxhpBFe3a43eMjkhb", "postedAt": "2022-11-25T08:13:37.017Z", "postId": "HPdWWetJbv4z8eJEe", "htmlBody": "<p>I have some clarification questions about the form:<br><br>1. Does \"total grant amount\" refer to the amount we requested or the amount we were promised?</p><p>2. Does \"amount that has been committed but not received yet\" refer to a) the amount that the grantor promised but did not pay out or b) project-related financial obligations and expenditures of the grantee, such as the salaries of people working on the project, that would have been paid from the grant?</p>", "parentCommentId": null, "user": {"username": "Falk Lieder"}}, {"_id": "o39cxZnq8FTseTBfE", "postedAt": "2022-11-29T00:12:17.804Z", "postId": "HPdWWetJbv4z8eJEe", "htmlBody": "<ol>\n<li>This refers to the amount you were promised from FTXF.</li>\n<li>This refers to the amount that was promised, but hasn’t been paid out.</li>\n</ol>\n", "parentCommentId": "dxhpBFe3a43eMjkhb", "user": {"username": "reallyeli"}}, {"_id": "PunLTFXCPqupCfGQc", "postedAt": "2022-11-29T21:27:13.541Z", "postId": "HPdWWetJbv4z8eJEe", "htmlBody": "<p>Thank you very much for answering my questions. :)</p>", "parentCommentId": "o39cxZnq8FTseTBfE", "user": {"username": "Falk Lieder"}}, {"_id": "4vbqnAzPyfW25GDxp", "postedAt": "2023-04-16T01:29:06.997Z", "postId": "HPdWWetJbv4z8eJEe", "htmlBody": "<p>Looking back five months later, can you say anything about whether this program ended up making grants, and if so how much/how many? Thanks!</p>", "parentCommentId": null, "user": {"username": "Sarah Levin"}}]