[{"_id": "AtkgrHLuTTiA3eBcc", "postedAt": "2015-08-14T11:52:48.111Z", "postId": "Hr5bQLH22wdAvFA7D", "htmlBody": "<p>From the spreadsheet linked there ( <a href=\"https://docs.google.com/spreadsheets/d/1b7ohoyAi2MlyBOzgarvJ-bOE2v9mJ8a9YDfQYGNk9vk/edit#gid=1273928110\">https://docs.google.com/spreadsheets/d/1b7ohoyAi2MlyBOzgarvJ-bOE2v9mJ8a9YDfQYGNk9vk/edit#gid=1273928110</a> )</p>\n<p>Does anybody find the row on Anthropogenic climate change (other than geoengineering) puzzling in the sense that it seems to be not given sufficient priority?</p>\n<p>&quot;Not many suitable remaining funding opportunities&quot; for &quot;R&amp;D on clean tech, adaptation preparations, and working toward carbon pricing are all possibilities but all generally highly funded already.&quot;</p>\n<p>The likelihood  of highest-damage scenario over the next 100 years is categorized on the same level as AI risk ('Highly uncertain, somewhat conjunctive, but plausible').</p>\n", "parentCommentId": null, "user": {"username": "HaukeHillebrandt"}}, {"_id": "SJZR2RBHdE8dXMSQe", "postedAt": "2015-08-14T17:12:49.253Z", "postId": "Hr5bQLH22wdAvFA7D", "htmlBody": "<p>Climate change is a very crowded space, and AFAIK geoengineering is the only cost-effective climate change intervention (I haven't really researched this but that's my impression). There's already tons of research going into e.g. clean energy, so marginal research is not very valuable. Geoengineering by contrast is a lot less crowded and potentially much more cost-effective.</p>\n", "parentCommentId": "AtkgrHLuTTiA3eBcc", "user": {"username": "MichaelDickens"}}, {"_id": "GvXeL4HQX2E99bxjh", "postedAt": "2015-08-16T23:10:44.027Z", "postId": "Hr5bQLH22wdAvFA7D", "htmlBody": "<p>I was puzzled!</p>\n", "parentCommentId": "AtkgrHLuTTiA3eBcc", "user": {"username": "Demosthenes"}}, {"_id": "gshTq6wNSEL5YEMoZ", "postedAt": "2015-08-17T04:46:37.929Z", "postId": "Hr5bQLH22wdAvFA7D", "htmlBody": "<p>Copied from my comment on a Facebook post:</p>\n<p>I especially liked Nick's sapling analogy, and found it fitting. I worry that EAs are drawn from subgroups with a tendency to believe relatively simple formalistic and mechanistic processes essentially describe complex ones, with perhaps a decrease in accuracy (relative to more complex models) but not in the general sign and magnitude of the result. This seems really dangerous. </p>\n<p>&quot;Imagine a Level 1 event that disproportionately affected people in areas that are strong in innovative science (of which we believe there are a fairly contained number). Possible consequences of such an event might include a decades-long stall in scientific progress or even an end to scientific culture or institutions and a return to rates of scientific progress comparable to what we see in areas with weaker scientific institutions today or saw in pre-industrial civilization.&quot;\nIt seems likely that any Level 1 event will have disproportionate effects on certain groups (possibly ones that would be especially useful for bringing civilization back from a level 1 event), and this seems like a pretty under-investigated consideration. A pandemic that was extremely virulent but only contagious enough to spread fully in big cities. Or extreme climate change or geoengineering gone awry knocking out mostly the global north or mostly equatorial regions or coastal regions.</p>\n<p>He doesn't really discuss the possibility of a Level 1 event immediately provoking a Level 2 event, but that also seems possible (for example, one catastrophic use of biowarfare could incentivize another country to develop even more powerful bioweapons, or to develop some sort of militaristic AI for defense. Or catastrophic climate change could cause the use of extreme and ill-tested geoengineering). This actually seems moderately likely, and I wonder why he didn't discuss it.</p>\n", "parentCommentId": null, "user": {"username": "ClaireZabel"}}, {"_id": "X29c8s8LFPmtZvLBt", "postedAt": "2015-08-17T13:47:30.991Z", "postId": "Hr5bQLH22wdAvFA7D", "htmlBody": "<p>This is a comment from Jim Terry, reposted with permission (none of it mine)</p>\n<blockquote>\n<p>There is essentially no precedent for level 1 catastrophes&quot; is followed by immediately listing at least one level 1 catastrophe, by his previous definition. (&quot;Hundreds of millions of people;&quot; the Black Death qualifies by body count, depending on your estimates; the others would count if you adjust proportionally for world population.) If we use the retro rated threshold of 5% or more of the global population dying (350m, in today's terms), the Mongol conquests (100m, 20-25%), the Wars of the Three Kingdoms (40m, 10-25%), the Plague of Justinian (25-50m, 10-25%) and potentially the Native American die-out consequent to the Columbian exchange (estimates are hard) count. (Note that all of these except for the plague of Justinian were spread over decades, but even doing some generational amortization, all of them except the Native American die-out likely make the cut anyway.) </p>\n</blockquote>\n<blockquote>\n<p>&quot;For the most part, these events don’t seem to have placed civilizational progress in jeopardy.&quot; </p>\n</blockquote>\n<blockquote>\n<p>Wild speculation! We don't know the counterfactual scenarios. My off-the-cuff counter-speculation is that if not for the Plague of Justinian, we might be settling Alpha Centauri by now, and looking back at the possibility of still being an earthbound civilization in the third millennium as a grim dark alternate history.</p>\n</blockquote>\n<blockquote>\n<p>To point to specific past events that probably should be considered level 1 catastrophes, not just by death toll but by impact, the Mongol Conquests are a plausible explanation for why the Muslim world didn't continue to be dramatically more enlightened and advanced than non-ERE Europe. 1258 was one of those watershed years in history, after which the future of Islam was a lot grimmer. Mongols also had a dramatically bad impact on the Russian cultural bloc, too (viz., they overran them and infected them with their values), which did some bad things to human progress. Generally speaking, Nick's worries about what might happen to social progress following a level 1 catastrophe all in fact did happen in this instance. Worries about the stall to scientific progress are validated here, too; the loss of the House of Wisdom is probably the most dramatic example, but flourishing scientific progress took a downturn. </p>\n</blockquote>\n<blockquote>\n<p>Also, consider the fall of the Western Roman Empire. It was a catastrophic event widely thought to have had a significant negative impact on technological and social progress but without a particularly impressive direct death toll. </p>\n</blockquote>\n<blockquote>\n<p>Both of these tie into the disastrous repercussions of the plague of Justinian--Justinian later became known as the emperor who reconquered Italy and large portions of the Med. If not for the plague weakening the ERE by killing 40% of his bros, things might have gone very differently. (Potential outcomes: no Middle Ages, ERE hegemony over the West and Arab world; Mongol aggression confined to East Asia, because horse archers don't do as well against automatic weapons.)</p>\n</blockquote>\n<blockquote>\n<p>Interestingly enough, the one non-modern global catastrophe the author was aware of actually may have had some positive social impact. It's a controversial historical view, but the thought is that the Black Death may have created some space (....where a lot of people used to be...) for the Renaissance to blossom.</p>\n</blockquote>\n<blockquote>\n<p><a href=\"http://www.gmanetwork.com/.../the-black-death-gave-life..\">http://www.gmanetwork.com/.../the-black-death-gave-life..</a>.</p>\n</blockquote>\n", "parentCommentId": null, "user": {"username": "ClaireZabel"}}]