[{"_id": "TjJ7TE7y5qEe93HcE", "postedAt": "2022-09-25T21:10:17.823Z", "postId": "HrFBf2DuSo6KPBYG5", "htmlBody": "<p>“Family and Computer Sciences” sounded peculiar. Clicking the link revealed it was “Family and Consumer Sciences.”</p>\n", "parentCommentId": null, "user": {"username": "Eli Kaufman"}}, {"_id": "YdjPQGquGktWiNz9u", "postedAt": "2022-09-25T21:26:02.800Z", "postId": "HrFBf2DuSo6KPBYG5", "htmlBody": "<p>thank you!</p>", "parentCommentId": "TjJ7TE7y5qEe93HcE", "user": {"username": "ColdButtonIssues"}}, {"_id": "FuMi7WfSrDNBNJ6xq", "postedAt": "2022-09-25T21:37:10.261Z", "postId": "HrFBf2DuSo6KPBYG5", "htmlBody": "<p>But wouldn’t this be hampered  by welfare economics already being (seen as) an existing field of economics?</p>\n<p>Also the name “welfare economic”  seems like one that students might see as dry or impractical.  Micro anecdata point is that when I taught microeconomics and had the students vote on which topics they were interested in “social welfare functions”  got among the fewest votes.</p>\n", "parentCommentId": null, "user": {"username": "david_reinstein"}}, {"_id": "wPEWcjqEcS7GRLQaB", "postedAt": "2022-09-25T21:44:59.672Z", "postId": "HrFBf2DuSo6KPBYG5", "htmlBody": "<p>The anecdata point is pretty interesting to me- I'm not an economist. Do you think if the field combined things like DALYs vs QUALYS or debates about subjective life expectation or stuff like that would be interesting to students?</p><p>I don't think it would be harmed by existing within normal econ departments- some normal econ depts. have ag economics within them and other places Ag Econ is independent.</p>", "parentCommentId": "FuMi7WfSrDNBNJ6xq", "user": {"username": "ColdButtonIssues"}}, {"_id": "jdDhZoquk3pCfkq6F", "postedAt": "2022-09-26T00:31:02.624Z", "postId": "HrFBf2DuSo6KPBYG5", "htmlBody": "<p>Thanks for writing this. I think about these sorts of things a lot. Given the title, do you know of examples of movements that did not start academic disciplines and appear to have suffered as a result?</p><p>The Global Priorities Institute and clusters of work around that do work in economics, including welfare economics. I'd also be curious to hear what you think they should do differently.</p>", "parentCommentId": null, "user": {"username": "zdgroff"}}, {"_id": "S2TYrg7nNGuNjgAh6", "postedAt": "2022-09-26T01:34:51.805Z", "postId": "HrFBf2DuSo6KPBYG5", "htmlBody": "<p>Not quite a discipline, but I think American Christianity lost cultural influence by denominations ceding control of their colleges (<a href=\"https://www.amazon.com/Dying-Light-Disengagement-Universities-Christian/dp/0802844812/ref=sr_1_1?crid=222401KZNIAY0&amp;keywords=dying+of+the+light+college&amp;qid=1664154884&amp;sprefix=dying+of+the+light+college%2Caps%2C111&amp;sr=8-1&amp;ufe=app_do%3Aamzn1.fos.f5122f16-c3e8-4386-bf32-63e904010ad0\">based off this book</a>).</p><p>Had the men's right movement established<a href=\"https://en.wikipedia.org/wiki/Men%27s_studies\"> men's studies</a> as more distinct from women's studies maybe they would have benefited (hard to believe they ever had the political power to achieve this.)</p><p>I can imagine a world where <a href=\"https://en.wikipedia.org/wiki/Sociobiology\">sociobiology</a> became its own discipline. It did not.</p><p>I think the establishment of <a href=\"https://en.wikipedia.org/wiki/List_of_chiropractic_schools\">chiropractic schools</a> legitimized the practice in the United States compared to other alternative medicines. Also, allowed the practice to survive despite opposition to physicians.</p><p>I don't have any criticisms of the GPI. Having a center seems to really free up the time of important researchers and gives them a lot more flexibility. But trying to create dozens of EA centers around the country/world would be less promising to me than trying to foster a discipline.</p><p>UNC Chapel Hill, a prestigious state school in the US, <a href=\"https://policies.unc.edu/TDClient/2833/Portal/KB/ArticleDet?ID=132148\">lets you endow a distinguished professorship for $2M</a>. A major donor could endow several departments worth of professorships. The &nbsp;Agricultural and Applied Association <a href=\"https://projects.propublica.org/nonprofits/organizations/610705416\">has annual revenue less than $2M</a>. &nbsp;The money to kickstart this discipline seems high but not outrageous.</p>", "parentCommentId": "jdDhZoquk3pCfkq6F", "user": {"username": "ColdButtonIssues"}}, {"_id": "gNfrkNbDJN9bygBMR", "postedAt": "2022-09-26T11:49:37.798Z", "postId": "HrFBf2DuSo6KPBYG5", "htmlBody": "<p>Thank you for writing this! I strong upvoted it.</p><p>One potential new academic field that can be set up and is now an EA cause area is wild animal welfare. While we call it wild animal welfare or wild animal suffering, Yew-Kwang Ng proposed the name \"welfare biology\" for the field, and some conservationists are calling for \"compassionate conservation\". Maybe none of these names is perfect, but you get the idea.</p>", "parentCommentId": null, "user": {"username": "tseyipfai@gmail.com"}}, {"_id": "KnJFMF5A3YxF9KuEo", "postedAt": "2022-09-26T13:14:15.824Z", "postId": "HrFBf2DuSo6KPBYG5", "htmlBody": "<p>I think another example is neoliberals, who did not \"establish\" a discipline, but took over much of the existing discipline of economics, and it helped them gain very wide influence.</p>\n", "parentCommentId": null, "user": {"username": "Guy Raveh"}}, {"_id": "FPn6spG9iGscQT8mB", "postedAt": "2022-09-26T13:37:31.123Z", "postId": "HrFBf2DuSo6KPBYG5", "htmlBody": "<p>Yes, it's true that Ag Economics (e.g., at Berkeley) presents a pretty good example of the coexistence of separate departments for two very much overlapping fields. Might be worth looking into more detail about how the Ag Econ departments  managed to set that arrangement up.</p>\n<p>By the way,  the stuff is all potentially interesting to idealistic students. I fear I was largely teaching a group of personal-financially-motivated students.</p>\n<p>But still, I'm not sure the term \"Welfare economics\" will bring them in. Worth doing some surveying on, perhaps</p>\n", "parentCommentId": "wPEWcjqEcS7GRLQaB", "user": {"username": "david_reinstein"}}, {"_id": "MKymyyw2i6XQo9Dkz", "postedAt": "2022-09-26T14:08:29.580Z", "postId": "HrFBf2DuSo6KPBYG5", "htmlBody": "<p>I like this idea. But why not set up <em>welfare science</em>, an interdisciplinary field including welfare economics, welfare biology, and positive psychology?</p>\n", "parentCommentId": null, "user": {"username": "evelynciara"}}, {"_id": "EqqqmNzMHmXJTQ9wR", "postedAt": "2022-09-26T17:22:37.870Z", "postId": "HrFBf2DuSo6KPBYG5", "htmlBody": "<p>A great article on this, for those who haven't read it yet: <a href=\"https://www.effectivealtruism.org/articles/ea-neoliberal\">What the EA community can learn from the rise of the neoliberals | Effective Altruism</a></p>", "parentCommentId": "KnJFMF5A3YxF9KuEo", "user": {"username": "finnhambly"}}, {"_id": "Gy6eMiykSWJMQJBgG", "postedAt": "2022-09-26T22:36:46.472Z", "postId": "HrFBf2DuSo6KPBYG5", "htmlBody": "<p>Or “wellbeing science”. Either would be better than welfare economics. We’re more than economists.</p>\n", "parentCommentId": "MKymyyw2i6XQo9Dkz", "user": {"username": "JoelMcGuire"}}, {"_id": "QBSvCndLwFqbKDkeh", "postedAt": "2022-09-27T03:33:29.709Z", "postId": "HrFBf2DuSo6KPBYG5", "htmlBody": "<p>As a PhD student in economics, I'm skeptical that funding a \"welfare economics\" department would actually change the research outputs of universities:</p><ol><li>Pretty much all economic research could be called \"welfare economics\", so (without further stipulations) a funder couldn't point to a specific project and say \"Umm that's not the sort of thing we want\".</li><li>Economists are fairly insular, and I can't see a department ran by economists hiring (e.g.) crop scientists or AI engineers (I'm an economist so I'm allowed to say that). Rather, I think economists would hire economists, who would probably do the economics they would have done in other jobs.</li><li>While I'm not 100% sure how universally true this is, my sense is that funders (rightly) have limited control over the departments they fund. That's been my experience as both a predoc in a well-funded lab and as a PhD student.</li></ol><p>I agree with other commenters that \"wellbeing science\" is maybe a better fit. I guess \"environmental science/studies\" departments are probably the best model here.</p><p>That said, my sense is that this would be a low priority either way. Universities have pretty high overheads and are pretty inefficiently run. It would probably be easier to set up independent think tanks. If you wanted to influence curricula / academic conversations you could perhaps do so by giving part-time fellowships to individual professors.</p>", "parentCommentId": null, "user": {"username": "Wilbur"}}, {"_id": "ZFPotJvif7DzEbWSg", "postedAt": "2022-09-27T05:30:39.981Z", "postId": "HrFBf2DuSo6KPBYG5", "htmlBody": "<p>The Santa Fe Institute is an example of what I'm suggesting at the end of this comment. <a href=\"https://www.santafe.edu/\">https://www.santafe.edu/</a></p>\n", "parentCommentId": "QBSvCndLwFqbKDkeh", "user": {"username": "Wilbur"}}, {"_id": "y3pr5QcpcaLn56eqN", "postedAt": "2022-09-27T11:36:43.851Z", "postId": "HrFBf2DuSo6KPBYG5", "htmlBody": "<p>I think it's right to think outside econ, but this name doesn't quite sound right to me - things that call themselves \"X science\" often aren't, e.g. Christian science. And there already is an emerging field around \"global priorities research\", which seems to me to get closer to the pivotal questions in EA than a narrow focus on econ/bio/psych would.</p>\n", "parentCommentId": "MKymyyw2i6XQo9Dkz", "user": {"username": "RyanCarey"}}, {"_id": "tPGsR9EqpMXXABFnZ", "postedAt": "2022-09-27T14:59:47.787Z", "postId": "HrFBf2DuSo6KPBYG5", "htmlBody": "<p>Yeah, imo the most natural thing is to make \"global priorities research\" a discipline. Maybe there should also be other (sub)disciplines that are more cause specific, ie related to (human) wellbeing, existential risks, etc.</p>\n", "parentCommentId": "y3pr5QcpcaLn56eqN", "user": {"username": "MichaelPlant"}}, {"_id": "Qti3tmAYTiaBiCEcE", "postedAt": "2022-09-28T22:13:28.621Z", "postId": "HrFBf2DuSo6KPBYG5", "htmlBody": "<p>Hasn't EA already greatly contributed to establishing existential risk studies, AI safety, welfare biology and cellular agriculture as (small) academic disciplines?&nbsp;</p><p>I think we should seek to solidify these disciplines</p>", "parentCommentId": null, "user": {"username": "freedomandutility"}}, {"_id": "WMeFff4LJAMfGparG", "postedAt": "2022-09-29T00:27:19.561Z", "postId": "HrFBf2DuSo6KPBYG5", "htmlBody": "<p>Or maybe just \"priorities research\". You could have different researchers focusing on different levels, some on global problems and some on local ones.</p>\n<p>Pros:</p>\n<ul>\n<li>Easier to digest for most people, who also value solving local issues</li>\n<li>We do want prioritisation to also happen at national/municipal levels and not just globally\n<ul>\n<li>Perhaps this could even free up budget for more foreign aid, although I'm a bit doubtful</li>\n</ul>\n</li>\n</ul>\n<p>Cons:</p>\n<ul>\n<li>Maybe national level research would be much more popular, and thus we'd lose an important part of what we want this to achieve</li>\n<li>National interests often conflict with global ones</li>\n</ul>\n", "parentCommentId": "tPGsR9EqpMXXABFnZ", "user": {"username": "Guy Raveh"}}]