[{"_id": "dbLd59bWndaGiJL6w", "postedAt": "2023-12-02T07:21:43.320Z", "postId": "Hs9X8LirL5GWTFNnN", "htmlBody": "<p>I am so excited to read this summary and these results! Thank you and everyone involved for bringing and sharing the gift of group therapy with EA. &nbsp;</p>", "parentCommentId": null, "user": {"username": "Dvir Caspi"}}, {"_id": "YH3C5ii8ZsKeLYFRd", "postedAt": "2023-12-03T19:13:57.229Z", "postId": "Hs9X8LirL5GWTFNnN", "htmlBody": "<p>Thanks for the concise summary and for your work! It looks thoughtfully executed and promising.</p>", "parentCommentId": null, "user": {"username": "Báo"}}, {"_id": "SLwkc5kKAR7qmD7tq", "postedAt": "2023-12-04T12:21:36.244Z", "postId": "Hs9X8LirL5GWTFNnN", "htmlBody": "<p>I'm excited about this!</p>\n<p>One question, I notice a bit of a tension with the EA justification of this project (\"improving EA productivity\") and the common EA mental health issues around feeling pressure to be productive. I know CBT is more about providing thinking tools rather than giving concrete advice on what to do/try, but might there be a risk that people who take part will feel like they are expected to show a productivity increase? Would you still recommend to EA clients to take time off generously if someone is having burnout symptoms? I'm curious to hear your thoughts on this.</p>\n", "parentCommentId": null, "user": {"username": "Lukas_Gloor"}}, {"_id": "ZNaQDoiSQeytiwrw3", "postedAt": "2023-12-04T14:34:42.544Z", "postId": "Hs9X8LirL5GWTFNnN", "htmlBody": "<p>Hi Lukas,<br>Thank you for this thoughtful comment. I hope you allow me to quote our program manager, Sam. She crafted a beautifully phrased answer to something similar in a former post:<br><br>\"I’m the Mental Health Program Manager at Rethink Wellbeing, and I’d like to offer my perspective on framing the program as a way to increase productivity. My thoughts are my own, not an official RW statement, but I have given my colleagues a chance to review this message before sending it.</p><p>I agree that basing one’s self-worth on one’s productivity can be a recipe for poor mental health (and rarely is effective at increasing productivity!).[...]</p><p>Despite agreeing with you, there are several reasons why RW highlights productivity in some of our marketing materials.</p><ul><li>Many members of the EA community who struggle with mental health problems are very motivated to increase their productivity (see, e.g., the&nbsp;<a href=\"https://forum.effectivealtruism.org/posts/itR4a9x5vCDr8bgPf/2023-ea-mental-health-and-productivity-survey-results\"><u>EA mental health survey results</u></a>, under “Topics people struggle with or would like to improve the most”), so emphasizing this as a possible benefit might encourage people to take care of themselves.&nbsp;</li><li>Sometimes members of the EA community don’t feel like they “deserve” to engage in self-care for their own sake. If we note the possible benefit to others, it might alleviate some guilt about investing time in one’s own well-being.&nbsp;</li><li>I believe that&nbsp;<i>everyone in the world</i> deserves access to a program like this one (or whatever tools for mental well-being are appropriate for them). But resources are limited. People in the EA community are no more or less deserving than others, but as Jason notes, we can justify prioritizing support to this community if there’s a multiplier effect because it allows them to do more good. Taking into account the productivity / impact increase is important for making strategic decisions when calculating the potential impact of such an intervention; plus, EA funders will want to see that RW is keeping its eye on productivity as an outcome metric.&nbsp;</li></ul><p>With all that said, because we agree that obsessing about impact is often harmful, we&nbsp;<i>aren’t&nbsp;</i>planning to emphasize productivity as a goal throughout the program. We are measuring it as one outcome, since it is a meaningful part of flourishing, even if just one; we also may&nbsp;<i>briefly&nbsp;</i>invite people to reflect on the effects of mental health on productivity if that is an effective source of motivation for them. But during the core of the program, we want to give people a chance to work on exactly this: the dysfunctional relationship they may have with productivity and impact, such as believing one needs to be productive, or close to perfect to be worthy.<a href=\"https://forum.effectivealtruism.org/posts/cZwQWeThqgXxmuFpG/apply-for-the-ea-mental-wellbeing-summer-program#fnwedekb0bit\"><sup>[1]</sup></a></p><p>Talking about productivity is a way of getting people in the door by addressing a common core concern for EA community members. However, our model is that helping people increase their well-being, including developing a well-rounded life and engaging in self-care, should have a side effect of increasing their capacity to do good for others … without needing to focus on it or put any pressure on people. Rather, we hope to alleviate pressure. And participation in the program does not “obligate” people to do any particular EA work or change the world.</p><p>I expect that the team will continue to reflect on how to walk this tightrope in our marketing. It’s tough to get it right, because the messaging lands different ways with different people, so feedback like yours is incredibly valuable. Thank you.\"</p>", "parentCommentId": "SLwkc5kKAR7qmD7tq", "user": {"username": "Inga"}}, {"_id": "3xp36f49QA8CGDkgb", "postedAt": "2023-12-19T17:43:09.404Z", "postId": "Hs9X8LirL5GWTFNnN", "htmlBody": "<p>Congratulations on running the pilot and getting these results!<br><br>They seem rather promising to me and above a threshold for testing more rigorously and scaling. However, a couple of questions:</p><ol><li>When did you measure the end effects and are you planning on doing a follow-up?</li><li>How does this compare to interventions such as eight weeks therapy or coaching?</li></ol>", "parentCommentId": null, "user": {"username": "SebastianSchmidt"}}, {"_id": "9rmdfYRdBWWb49hNK", "postedAt": "2023-12-23T19:45:37.862Z", "postId": "Hs9X8LirL5GWTFNnN", "htmlBody": "<p>Thanks, Sebastian.&nbsp;<br>1. We measured once right at the end of the program at week 8 and once 4 weeks after the program, i.e., 12 weeks after the start of it. A follow-up is planned, likely after 3 but, at the latest, after 6 months, so that we can better estimate the course of the effect decline. In the post above, we present the 8 and 12-week results compared to the pre-course measurements.<br><br>2. Hopefully, I remember the research correctly, so take my answer below with some caution. As far as I know:<br>- professional 1:1 CBT-Psychotherapy for depression and anxiety shows very similar effect sizes to guided self-help CBT.&nbsp;<br>- 1:1 CBT-based coaching can help just as professional 1:1 CBT-Psychotherapy&nbsp;<br>- our effects look like very similar to the average of typical professional 1:1 CBT-Psychotherapy / guided self-help programs&nbsp;<br>I am uncertain if 1:1 psychotherapy reached the effects that quickly.&nbsp;</p>", "parentCommentId": "3xp36f49QA8CGDkgb", "user": {"username": "Inga"}}, {"_id": "szzRtjDR2wZETFnDv", "postedAt": "2024-01-01T17:57:42.660Z", "postId": "Hs9X8LirL5GWTFNnN", "htmlBody": "<p>2.&nbsp;<br>- How do you define guided self-help? Do you mean facilitated group sessions?<br>- Do you have any specific papers/references that you've used to for those estimates?</p>", "parentCommentId": "9rmdfYRdBWWb49hNK", "user": {"username": "SebastianSchmidt"}}, {"_id": "5XLzHFcZxSo427xab", "postedAt": "2024-01-09T22:56:43.833Z", "postId": "Hs9X8LirL5GWTFNnN", "htmlBody": "<p>Is it also possible to read the materials for the sessions without participating? I guess this could also help many people - at least more than not having any access to that kind of information at all.</p>", "parentCommentId": null, "user": {"username": "Janika"}}, {"_id": "LhtTct94MWyKx5EfE", "postedAt": "2024-03-18T22:41:06.394Z", "postId": "Hs9X8LirL5GWTFNnN", "htmlBody": "<p>How do you manage participants who fear being judged and may be afraid to interact with the group?</p>", "parentCommentId": null, "user": {"username": "Richard_Leyba_Tejada"}}]