[{"_id": "oWJFoiHJC8NXt2FwD", "postedAt": "2023-05-12T03:52:41.206Z", "postId": "HssFFgW67ujd3ZaFs", "htmlBody": "<p>I think defining a spec with your minimum acceptable features would make this more likely to happen. I was semi-interested in doing this, but then saw that you added a few more features (graphs &amp;c).</p>", "parentCommentId": null, "user": {"username": "NunoSempere"}}, {"_id": "CsP72F8us986Y8LKi", "postedAt": "2023-05-12T05:30:58.806Z", "postId": "HssFFgW67ujd3ZaFs", "htmlBody": "<p>This kinda feels like vote brigading:</p>\n<p>\"where N is the total karma of this post three months from now, up to a max of $20,000\"</p>\n<p>Ad I'm torn because I obviously want to entice you to donate more, but I don't support people buying Karma in a direct \" $ donated in -&gt; Karma out\" fashion like this.</p>\n<p>Recent forum post on vote brigading here:</p>\n<p><a href=\"https://forum.effectivealtruism.org/posts/sDkHTdBsrpz7teMR2/please-don-t-vote-brigade\">https://forum.effectivealtruism.org/posts/sDkHTdBsrpz7teMR2/please-don-t-vote-brigade</a></p>\n", "parentCommentId": null, "user": {"username": "TheOtherHannah"}}, {"_id": "NBSguDx4aaT28Jz9J", "postedAt": "2023-05-12T08:36:03.427Z", "postId": "HssFFgW67ujd3ZaFs", "htmlBody": "<blockquote><p>I often feel guilty for eating out at restaurants. Especially when meat is involved.</p></blockquote><p>I kinda feel like I personally wouldn't want to use the app like this, it spontaneously feels like I wouldn't fully own the tradeoffs I'm under or something? Like I'd be trying to distract myself from the outcomes of the choices I'm making? If I'd think I made the best tradeoffs by eating meat now and then, I'd probably just want to one time cry about how sad it is and make peace with living in a world that also features this particular cruel tradeoff.</p><p>(And now back to reducing x-risks from AI! &lt;3 )</p>", "parentCommentId": null, "user": {"username": "MaxRa"}}, {"_id": "fnMmxHF4MPzdzJz37", "postedAt": "2023-05-12T10:19:25.790Z", "postId": "HssFFgW67ujd3ZaFs", "htmlBody": "<p>The World Food Programma already has an <a href=\"https://sharethemeal.org/\">app </a>(Android, iOS) that lets you do something similar. It might be of inspiration to those working on this</p>", "parentCommentId": null, "user": {"username": "Jeroen De Ryck"}}, {"_id": "dDjy7hG6WLsK5FhNe", "postedAt": "2023-05-12T10:28:39.001Z", "postId": "HssFFgW67ujd3ZaFs", "htmlBody": "<p>I've seen people do a thing where, if they're using karma to collect votes, for example, they include a second comment to downvote, so their net karma remains the same. You could also use the agree-votes on a comment to collect votes (rather than the post karma itself).</p>", "parentCommentId": "CsP72F8us986Y8LKi", "user": {"username": "Amber"}}, {"_id": "AJEZ7iSFHbHjwJChC", "postedAt": "2023-05-12T10:31:49.265Z", "postId": "HssFFgW67ujd3ZaFs", "htmlBody": "<p>I think this is a great idea, I'd download this app. I don't have the technical skills to make it, but if there was a copywriting element, I could help with that.<br><br>I also had the thought a while ago that I could try out a policy of donating an equal amount to charity when I made a purchase that felt 'extravagant' (in addition to giving 10%-ish). This would both disincentivize extravagance (extravagance would cost twice as much!) but also make me feel less guilty when I did do it (because the guilt stems from a place of 'that money could help the needy instead', whereas if the extravagance is instead directly tied to a donation to the needy, that's less true).</p>", "parentCommentId": null, "user": {"username": "Amber"}}, {"_id": "e7M3GhufF2Xy9eJjD", "postedAt": "2023-05-12T12:20:15.489Z", "postId": "HssFFgW67ujd3ZaFs", "htmlBody": "<p>I would use this! I go back and forth on whether I should give money to beggars. Whilst I think the answer to this question depends on the specific location and context, this app would make the “but I should rather give that discretionary money to an effective charity” option a lot more realistic.</p>\n", "parentCommentId": null, "user": {"username": "Aidan Alexander"}}, {"_id": "rozCP96x6Ejs9HwyK", "postedAt": "2023-05-12T14:16:53.523Z", "postId": "HssFFgW67ujd3ZaFs", "htmlBody": "<p>Hmmm. I really don't want the karma, I was using it as a signal of how good the idea is. Like, creating this app is only worth someone's time and money if it becomes a popular app that lots of people use. So if it only gets &nbsp;like 20 karma then it isn't worth it, and arguably even if it gets 50 karma it isn't worth it. But if it blows up and hundreds of people like it, that's a signal that it's going to be used by lots of people.<br><br>Maybe I should have just asked \"Comment in the comments if you'd use this app; if at least 30 people do so then I'll fund this app.\" Idk. If y'all think I should do something like that instead I'm happy to do so.<br><br>ETA: Edited the OP to remove the vote-brigady aspect.</p>", "parentCommentId": "CsP72F8us986Y8LKi", "user": {"username": "kokotajlod"}}, {"_id": "KYHmqYsZeMSdsBLJd", "postedAt": "2023-05-12T14:18:25.160Z", "postId": "HssFFgW67ujd3ZaFs", "htmlBody": "<p>Good idea. Everyone please downvote this comment of mine if they want to support the app idea but don't want to give me karma as a byproduct of my polling strategy.</p>", "parentCommentId": "dDjy7hG6WLsK5FhNe", "user": {"username": "kokotajlod"}}, {"_id": "k6XFDveKzeHGiMEwv", "postedAt": "2023-05-12T14:19:19.301Z", "postId": "HssFFgW67ujd3ZaFs", "htmlBody": "<p>Everyone please downvote this comment of mine if they want to support the app idea but don't want to give me karma as a byproduct of my polling strategy; this cancels out the karma I get from the OP.</p>", "parentCommentId": "rozCP96x6Ejs9HwyK", "user": {"username": "kokotajlod"}}, {"_id": "Jxobge3WaneXaQr5y", "postedAt": "2023-05-12T15:25:52.533Z", "postId": "HssFFgW67ujd3ZaFs", "htmlBody": "<p>I like this idea in the abstract.</p><p>One implementation detail that I worry about is how much friction would exist in the micro-transaction. For example, if I do this on my iPhone would it just go &lt;ching&gt; and then make the donation, or would it then pop up a little screen saying \"pick your method of payment, then I double press the side button for apple pay, then it scans my face and I wait a beat\". I think it <i>has</i> to be the latter given iOS platform constraints (to stop scammers from just taking people's money), but I think that might greatly reduce the \"fun, friction-free\" thing that I see as the draw here.</p>", "parentCommentId": null, "user": {"username": "ryancbriggs"}}, {"_id": "qJzSThMDspXKJJKRg", "postedAt": "2023-05-12T15:31:00.990Z", "postId": "HssFFgW67ujd3ZaFs", "htmlBody": "<p>both Apple's App Store and Google Play Store have policies in place that require you to provide clear and transparent communication to users about charges before processing in-app purchases.</p><p>Apple's App Store Review Guidelines state that you must \"clearly and accurately describe the in-app purchase and its terms\" to users before they initiate the purchase. This means you need to provide sufficient information about the charge, such as the price, what the user will receive in return, and any applicable terms or conditions. It's essential to obtain explicit user consent before processing any charges.</p><p>Similarly, Google Play's Developer Policy Center requires that you \"clearly disclose the price, currency, and the specific functionality or content users are purchasing\" and \"obtain explicit consent from the user before charging them.\" The pricing information should be presented in a way that is easily understandable to users.</p><p>To comply with these policies, it is common practice to display a clear and prominent dialog or popup within your app, informing users about the charge and requesting their consent before proceeding with the purchase. This popup should provide a clear description of the purchase, the associated cost, and any relevant terms or conditions.<br><br>Thus, having a button to click that charges 1$ isn't possible without a popup between each click.<br>Anyone got ideas for alternatives?</p>", "parentCommentId": null, "user": {"username": "Daryl D'Souza"}}, {"_id": "Nfhc6MTrCKLt2LE4m", "postedAt": "2023-05-12T16:27:05.635Z", "postId": "HssFFgW67ujd3ZaFs", "htmlBody": "<p>Oh dang. I definitely want it to be the former, not the latter. Maybe we can get around the iOS platform constraints somehow, e.g. when you press the button it doesn't donate the money right away, but just adds it to an internal tally, and then once a quarter you get a notification saying 'time to actually process this quarter's donations, press here to submit your face for scanning, sorry bout the inconvenience'</p>", "parentCommentId": "Jxobge3WaneXaQr5y", "user": {"username": "kokotajlod"}}, {"_id": "5BtJeHLxyoFsaHyAs", "postedAt": "2023-05-12T16:28:02.784Z", "postId": "HssFFgW67ujd3ZaFs", "htmlBody": "<p>Oh dang. How about: When you press the button it doesn't donate the money right away, but just adds it to an internal tally, and then once a quarter you get a notification saying 'time to actually process this quarter's donations, press here to submit your face for scanning, sorry bout the inconvenience'</p>", "parentCommentId": "qJzSThMDspXKJJKRg", "user": {"username": "kokotajlod"}}, {"_id": "hYW8HaRQ8Hsrw2Nra", "postedAt": "2023-05-12T20:34:27.300Z", "postId": "HssFFgW67ujd3ZaFs", "htmlBody": "<p>I would lean towards making the first version a website instead so you wouldn't have to go through the hassle of following Apple / Google's rules. For example in the App Store Review Guidelines there are extra procedures to follow for such apps - <a href=\"https://developer.apple.com/app-store/review/guidelines/\">https://developer.apple.com/app-store/review/guidelines/</a> it explicitly states:&nbsp;</p><p><strong>3.2.1 Acceptable</strong>: <strong>(vi)</strong> Approved nonprofits may fundraise directly within their own apps or third-party apps, provided those fundraising campaigns adhere to all App Review Guidelines and offer Apple Pay support. These apps must disclose how the funds will be used, abide by all required local and federal laws, and ensure appropriate tax receipts are available to donors. Additional information shall be provided to App Review upon request. Nonprofit platforms that connect donors to other nonprofits must ensure that every nonprofit listed in the app has also gone through the nonprofit approval process. Learn more about becoming an <a href=\"https://developer.apple.com/apple-pay/nonprofits/\">approved nonprofit</a>.</p><p><strong>3.2.2 Unacceptable: (iv)</strong> Unless you are an approved nonprofit or otherwise permitted under Section 3.2.1 (vi) above, collecting funds within the app for charities and fundraisers. Apps that seek to raise money for such causes must be free on the App Store and may only collect funds outside of the app, such as via Safari or SMS.</p>", "parentCommentId": null, "user": {"username": "Eddie Liu"}}, {"_id": "N87572dEwuEhKJWdH", "postedAt": "2023-05-12T21:49:01.288Z", "postId": "HssFFgW67ujd3ZaFs", "htmlBody": "<p>Why does what you quoted mean a dialog is necessary? Couldn't the button itself just say something like \"$1, goes to GiveWell\" and then tapping it is you giving consent?</p>", "parentCommentId": "qJzSThMDspXKJJKRg", "user": {"username": "Aaron Fink"}}, {"_id": "RpbGNKHNwAFauRPp2", "postedAt": "2023-05-12T23:49:34.273Z", "postId": "HssFFgW67ujd3ZaFs", "htmlBody": "<p>Minimum acceptable features are the bits prior to \"That's it really.\"</p>", "parentCommentId": "oWJFoiHJC8NXt2FwD", "user": {"username": "kokotajlod"}}, {"_id": "SkytspQGqtFQhHqEf", "postedAt": "2023-05-13T00:31:51.829Z", "postId": "HssFFgW67ujd3ZaFs", "htmlBody": "<p>But really, before anyone actually goes and invests significant effort into building this, you should coordinate with me + other people in this comment section.</p>", "parentCommentId": "RpbGNKHNwAFauRPp2", "user": {"username": "kokotajlod"}}, {"_id": "NC7Funx7WbkWn8SEQ", "postedAt": "2023-05-13T00:33:13.193Z", "postId": "HssFFgW67ujd3ZaFs", "htmlBody": "<p>Ouch, I wasn't aware of those rules, they do seem quite restrictive. If it's a website rather than an app, how easy would it be to set it up so that you can access it with a single button press? I guess you can have favorites, default sites, etc.</p>", "parentCommentId": "hYW8HaRQ8Hsrw2Nra", "user": {"username": "kokotajlod"}}, {"_id": "tBTgwSnnebQeXW7Lz", "postedAt": "2023-05-13T02:12:29.433Z", "postId": "HssFFgW67ujd3ZaFs", "htmlBody": "<p>On both iOS and Android, you can add websites to your home screen like apps. It’s just usually not quite as nice an experience and not as intuitive for people.</p>\n", "parentCommentId": "NC7Funx7WbkWn8SEQ", "user": {"username": "Aaron Fink"}}, {"_id": "xocibbHsMjLz2wPC3", "postedAt": "2023-05-18T13:08:03.458Z", "postId": "HssFFgW67ujd3ZaFs", "htmlBody": "<p>In Canada there is a company called TipTapPay (https://tiptappay.com/) and I'm sure they have competitors here and equivalents in other countries. They offer a simple, instant contactless payment that goes directly to a charity.&nbsp;</p><p>Existing tap-to-give solutions don't function like your hypothetical app, but they could achieve a fairly similar end-result with far less friction. For example users don't have to download an app, link and authorize payment types, etc.&nbsp;</p><p>One more case for this potentially being a better fit for a hardware solution, rather than software, is that if I were to see a stranger eating alone at a restaurant tapping away at a noisy app, I'm not likely going to approach them. I'll assume they are playing a Candy Crush-style game and don't want to be interrupted.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Brock W."}}, {"_id": "oszMRXKh4ag7wJhZ3", "postedAt": "2023-05-24T08:36:11.236Z", "postId": "HssFFgW67ujd3ZaFs", "htmlBody": "<p>Thanks for mentioning this, I was going to post this myself.</p>", "parentCommentId": "fnMmxHF4MPzdzJz37", "user": {"username": "Martin Lundberg"}}, {"_id": "WRPtKDr37uevFH6rP", "postedAt": "2023-05-24T09:20:37.198Z", "postId": "HssFFgW67ujd3ZaFs", "htmlBody": "<p>As another commenter already mentioned, this is exactly the idea behind the World Food Programme's app called <a href=\"https://sharethemeal.org/de/\">Share The Meal</a>. It is quite a successful app.</p><p>The closest thing to the app you want that I know of is <a href=\"https://www.thelifeyoucansave.org/app/\">this app</a> from The Life You Can Save, which I was part of developing when I was working at <a href=\"https://www.meepo.se/\">Meepo</a>. We really liked the Share The Meal app and wanted to create something similar for effective charities.&nbsp;<br><br>Payment is not complicated; you just need to integrate a payment provider such as Stripe or Adyen. However, one problem with these payment providers is that they charge per transaction. This hits micro-transactions such as $1 especially hard. For Stripe, for example, the <a href=\"https://stripe.com/en-de/pricing\">fees for European cards</a> are 1.5% + 0.25€. For many people this might not be an issue but to me it feels wrong that more than 25% of my donation would go to the payment provider. But if the app is just for fuzzies and not your main way of donating, perhaps it could be fine.<br><br>As others have pointed out, you won't be able to create a button that you can \"spam\" to donate because Apple and Google won't allow it. Maybe your internal tally idea would be allowed by Apple and Google, I am not sure.<br><br>Thanks for making this post, I really like this app idea and I'm glad others do too.</p>", "parentCommentId": null, "user": {"username": "Martin Lundberg"}}]