[{"_id": "utddp7bTtHuQXdGpC", "postedAt": "2017-12-20T03:55:22.328Z", "postId": "HwFqCwvBRWctgAGmJ", "htmlBody": "<p>Here's mine, copied and pasted from <a href=\"http://www.zachgroff.com\">my blog</a> :</p>\n<p>1) The importance of artificial general intelligence:</p>\n<p>I'd previously been dismissive of superintelligence as being something altruists should focus on, but that was in large part motivated reasoning. I read books like Superintelligence and Global Catastrophic Risks, and I knew their theses were right initially but would not admit it to myself. With time, though I came to see that I was resisting the conclusion that superintelligence is an important priority mostly because it was uncomfortable. Now I recognize that it is potentially the most important problem and want to explore opportunities to contribute.</p>\n<p>2) The economic argument for animal welfare reforms:</p>\n<p>One of the reasons often given for supporting animal welfare reforms to those who want to see fewer (read: no) animals tortured for food is that welfare reforms make the industry less profitable, cutting down on the numbers of animals raised. I did not think this effect was strong enough to be worth the effort activists put into such reforms, but I've changed my mind significantly based on three pieces of evidence. The first was an analysis by economists Jayson Lusk and Conner Mullaly finding that Proposition 2 made a significant dent in egg production. The second was a write-up by Lewis Bollard at the Open Philanthropy Project on how the Sierra Club managed to shrink the coal industry through regulations and subsidies. The third was Sentience Institute's report on nuclear power and clean meat, which found that economic institutions can powerfully shape the success or failure of novel technologies. I now think the economic approach to animal advocacy is an exceptionally promising strategy.</p>\n<p>3) The value of research for animal advocacy: </p>\n<p>I've always thought animal advocates had a large research gap. When I look at the economic development world as an animal advocate, I feel envy. I'd previously thought that a lot of advocacy tactics simply could not be tested, but after looking around at datasets on social movements (for instance, Erica Chenoweth's dataset on the &quot;Resistance&quot;), reading the ingenious work of institutional economists on using instrumental variables to set up quasi-experimental studies, and reading about experimental work in political science and other disciplines, I think there's a lot more that can be done than has, enough for it to be one of the most promising routes for animal advocates.</p>\n<p>4) The importance–and neglectedness–of social institutions:</p>\n<p>This was a year when through reading, following the news, and personal experience, I saw how much rules, norms, and processes matter–and how forgotten this can be. I saw how charismatic men with easy scapegoats and enchanted people behind them can pervert and break important and worthwhile structures. At the same time, I saw how dissent and conviction can preserve and improve safeguards.</p>\n<p>5) The interplay of protests and politics:</p>\n<p>I fiercely avoided this conclusion until recently, but I now think that in situations without sufficient, actionable public support, protests do not mix well with politics. As I've concluded before, protests have two primary effects: growing a movement and pressuring institutions. As a movement grows in size and support, the most important effect of a protest should shift from the former to the latter. When a protest is raising awareness, and the public does not agree with the protesters, I think the protest should probably be largely separate from political campaigns.</p>\n<p>6) The importance of wild animal suffering:</p>\n<p>I've followed a similar path here to that on artificial intelligence. I avoided an uncomfortable conclusion, but I ended up having to accept it: that given the massive numbers of wild animals in the world (anywhere from 1,000 to 1,000,000,000 sentient wild animals for every human), figuring out what effect we do and can have on their suffering is of first order importance for animal advocates.</p>\n<p>7) Religion, the internet, and social cohesion:</p>\n<p>I've tended in the past to think that electronic communications are clearly positive, and I'm an atheist and have a staunch secularist streak. (Écrasez l'infame!) Nonetheless, various readings have moved me toward wondering if the Internet is creating an overly individualistic generation, and if we could use some institutions that resemble and replicate religion in some ways. I read up on the Bowling Alone theory and Cass Sunstein's #Republic. I think the health of civic society in the face of an increasingly atomistic world is a worthy concern.</p>\n<p>8) How much cause there is for optimism:</p>\n<p>I am a pessimist by nature but for a while have been a deliberate optimist. By poverty, violence, and oppression, I think it is hard to make the case that the broad sweep of history is negative. Even against that background, I end the year with more optimism about the causes that concern me. Most important, I am more hopeful that current animal advocacy strategies will put a massive dent in industry (see number 2). I am excited about the direction effective altruist organizations are going in, with Animal Charity Evaluators' research standards improving and groups like Sentience Institute carefully examining a broader body of evidence. I am more hopeful than ever that for most sentient beings, the future is growing brighter.</p>\n", "parentCommentId": null, "user": {"username": "zdgroff"}}, {"_id": "7mn25pWtbEoBJHngh", "postedAt": "2017-12-20T13:16:03.017Z", "postId": "HwFqCwvBRWctgAGmJ", "htmlBody": "<p>I changed my mind about the probability, importance and neglectedness of threats to humanity. I used to think that chance of humanity's extinction is very small, and that anything that could be done to reduce risks in a particular country was probably already being done by the government. I've changed my mind, and now I think it's a good idea for altruistic people to work on reducing x-risks/s-risks. </p>\n", "parentCommentId": null, "user": {"username": "Khorton"}}, {"_id": "9y3D2WLqWNGttpmXP", "postedAt": "2017-12-22T02:18:47.434Z", "postId": "HwFqCwvBRWctgAGmJ", "htmlBody": "<p>Thanks for this post! I don't often sit and review how I've updated and I agree it's a useful exercise. Some questions:</p>\n<blockquote>\n<p>wondering if the Internet is creating an overly individualistic generation, and if we could use some institutions that resemble and replicate religion in some ways.</p>\n</blockquote>\n<p>Can you expand on this? It's not clear to be if you're drawing a link between an overly individualistic and an athiest generation? How would establishing institutions that resemble religion address the individualism? And if so, is a replicating religion the best way to combat it? </p>\n<p>I'm actually also not totally clear why individualism is problematic. </p>\n", "parentCommentId": "utddp7bTtHuQXdGpC", "user": null}]