[{"_id": "yNeRmdJf2bBp6QWYY", "postedAt": "2023-11-10T13:09:11.122Z", "postId": "HwFtAQPfif2ZwirB6", "htmlBody": "<p>Thanks for doing this work. I especially appreciate the recommendations on applying best practices for boards, CEOs, etc.<br><br>One question, and apologies if I did not read all the material around this project carefully enough: Could the composition of the participants of this initiative have influenced results? I think you said that some suggestions for reforms could not be agreed upon and/or that they could be net negative. I am asking especially as some recent issues in EA have been around gender and race and such initiatives could have different levels of support based on the composition of the team reviewing such initiatives.</p>", "parentCommentId": null, "user": {"username": "Ulrik Horn"}}, {"_id": "cfETCxishu2mSJZHe", "postedAt": "2023-11-10T21:21:41.415Z", "postId": "HwFtAQPfif2ZwirB6", "htmlBody": "<p>I'm sure it's true that a different group of people would have come up with different projects that seemed most useful and practical to them. I don't remember noticing disagreement that seemed to be along demographic lines. My perception is that the main <a href=\"https://forum.effectivealtruism.org/posts/Cvn6fwzdoLNLgTJif/further-possible-projects-on-ea-reform#Key_Factors\">axis</a> on which we often had different ideas was \"centralization vs decentralization\", for example with Ozzie often proposing more centralization and me leaning toward decentralization. My hunch is this is related to Ozzie's experience at small organizations and my experience at a larger (for EA) one.</p>", "parentCommentId": "yNeRmdJf2bBp6QWYY", "user": {"username": "Julia_Wise"}}, {"_id": "L7pgE4yHaRrmYpHi6", "postedAt": "2023-11-11T04:29:28.110Z", "postId": "HwFtAQPfif2ZwirB6", "htmlBody": "<p>Thanks for clarifying Julia. And again I am really glad you undertook this work.</p>\n", "parentCommentId": "cfETCxishu2mSJZHe", "user": {"username": "Ulrik Horn"}}, {"_id": "vazpfwiQdjYFkc5gK", "postedAt": "2023-11-12T23:35:51.306Z", "postId": "HwFtAQPfif2ZwirB6", "htmlBody": "<p>There are a few things I want to flag on the topic of <strong>investigations related to FTX</strong></p><ul><li>Does this mean that the EV investigation hasn’t finish? (Maybe I missed this somewhere). It’s been over a year later, SBF was convicted, and Michael Lewis published a whole book which gave the community greater insights into the ordeal &amp; FTX/Alameda’s entanglements with EA than EA community leaders privy to details. If at this point the investigation isn’t finished, then I think the EA community should receive an explanation.</li><li>Why would EV not “publish any of its results?” I think the EA community is entitled to the justification for this.</li><li>If it was known that EV’s investigation had inadequate scope to investigate all the things that should have been investigated, then why haven’t major orgs in EA pursued this/why is it being flagged a year later? (forgive me if this was flagged earlier).</li></ul>", "parentCommentId": null, "user": {"username": "Yelnats T.J."}}, {"_id": "CE99MTZ6dhTyD7jus", "postedAt": "2023-11-14T18:05:41.636Z", "postId": "HwFtAQPfif2ZwirB6", "htmlBody": "<p>I'm not part of EV/CEA, so can't speak for them.&nbsp;</p><p>Some quick, very rough and speculative, thoughts:<br><br>1. The legal battles will probably take at least a few more years to resolve. SBF was convicted, but there's a lot more to it. The bankruptcy proceedings could take a long time, it's a massive pain to all involved. I'd expect that EV is continuing to be cagey with releasing certain information, as recommended by their lawyers.<br>2. We listed some project ideas for either investigating the FTX situation in a more thorough and public way, and for setting up groups to prevent similar issues in the future. We're enthusiastic about people taking these on. <a href=\"https://forum.effectivealtruism.org/s/jxBRTDWZZYBbknuGK/p/Cvn6fwzdoLNLgTJif\">https://forum.effectivealtruism.org/s/jxBRTDWZZYBbknuGK/p/Cvn6fwzdoLNLgTJif</a></p><p>3. Even though Julia works at CEA, I wouldn't take these posts at all as an official stance by CEA. Opinions listed are mainly those of the three of us, they're not meant to represent others.<br>4. I'm not sure how much enthusiasm there is by decision makers with real authority, on these issues. Many prominent longtermist EAs are really focusing on direct longtermist projects, especially with the intensity around AI now. I believe CEA is still searching for a new ED, and once they find one, it will likely take them a while to decide on large new initiatives.<br>5. \"then why haven’t major orgs in EA pursued this/why is it being flagged a year later?\" -&gt; For one thing, there's a question of what one could do about it at this point. It's unlikely that a similar disaster will happen soon, so it might not be particularly urgent to set up programs to prevent similar future disasters.&nbsp;</p><p>In terms of what we'd learn investigating the history of the FTX issues:<br>1. These topics have been heavily investigated and discussed publicly, then later on the forums. It's not clear to me just how much more would be uncovered with more EA investigation.<br>2. I think the basic remaining story is fairly straightforward (at least, the parts that people could agree upon). I think many EAs believe they have a decent enough grasp on it (though it's of course possible they're wrong). I might write up my very personal takes sometime, but this is based on very little semi-insider knowledge.</p><p>I'd still like to see more work here, just trying to outline why \"extended public postmortems on EA/FTX\" &nbsp;might not be a huge priority right now.&nbsp;</p>", "parentCommentId": "vazpfwiQdjYFkc5gK", "user": {"username": "oagr"}}, {"_id": "y7XikEaBomCWFPoQx", "postedAt": "2023-11-15T17:04:50.451Z", "postId": "HwFtAQPfif2ZwirB6", "htmlBody": "<p>So when it comes to \"programs we'd like to see\" including \"a comprehensive investigation into FTX&lt;&gt;EA connections / problems,\" I take it that you disagree with that recommendation I.. I'd be interested to hear from those that proposed it what they hope to get out of it.</p><p>I'm not in an authoritative vantage point to say it would be fruitful. But from a conversation I had with someone that knew much more intimately how exposed non-FTX EAs were to SBF/FTX prior to the crash, and they said there are still many people in influential positions in EA that have not been held accountable for having enough exposure to have raised a yellow-flag (about SBF/FTX governance practices and behavior that on first look would have been value misaligned).<br><br>That to seems to me like one concrete benefit to the community of having another investigation. I've heard from a few people that the multi tens-of-millions dollar penthouse was known by multiple influential EAs and Lewis's book corroborates that. The penthouse and FTX's sponsorship deals (paying way over market to sponsor an E-sports team or buying StoryBook Brawl) appear to me like the clearest yellow/red flags that should have elicited scrutiny from non-FTX EAs.</p><p>As a community member, I'd like to know if influential non-FTX EAs</p><ol><li>saw this as yellow/red flags. If not, why didn't they.</li><li>if so, what did they do about.</li><li>If they didn't do anything about it, why was that. Did they just assume SBF knew what he was doing, were they afraid of offending him, etc?</li></ol><p>I've heard from one person a rationale for why the penthouse made sense. And there could be more merits as to why some of these things that appear as yellow/red flags actually aren't. yet this discussion doesn't seem to be happening publicly and I don't know to what extent its happening privately, but it strikes me as a discussion that should happen and should be public to the community.</p><p>The FTX episode--not whether EAs could have caught the fraud, but if they should have been scrutinizing FTX/SBF more--is an important reflection how well the community/movement currently manages itself, especially the orgs and people with the most power in shaping the movement. I.e. there are important lessons to be learnt from. Especially since their were known concerns about SBF as early Alameda (another thing whispered about on the Forum that we didn't get more insight into until Lewis's book).</p><p><br>\"It's unlikely that a similar disaster will happen soon, so it might not be particularly urgent to set up programs to prevent similar future disasters.\"<br>^ This sentiment reflects why I'm worried that some parts of EA haven't fully learned the lessons of the FTX saga (which some think only apply to FTX and the broader community, but I've yet to be convinced). When triaging, you can always push off something important that isn't urgent, but this is the slippery slope that leads to never doing it before it's too late. Governance and PR disasters are not always going to foreseeable.<br>Also, memory fades with time, which can affect the ability to understand what happened.</p>", "parentCommentId": "CE99MTZ6dhTyD7jus", "user": {"username": "Yelnats T.J."}}, {"_id": "B9ek3igRJaoLKGFDJ", "postedAt": "2023-11-16T04:52:11.709Z", "postId": "HwFtAQPfif2ZwirB6", "htmlBody": "<blockquote><p>So when it comes to \"programs we'd like to see\" including \"a comprehensive investigation into FTX&lt;&gt;EA connections / problems,\" I take it that you disagree with that recommendation</p></blockquote><p>To be clear, I'd still like to see this, it's just that I probably don't see it as urgent as you seem to. I was trying to represent the arguments on the other side of the issue - I personally fall somewhere in-between.&nbsp;</p><p>The penthouse wasn't really a secret, but it wasn't publicized. When I saw that, it seemed weird, but more like a minor yellow flag, in comparison to all the craziness that startups can be like.<br><br><a href=\"https://www.facebook.com/ozzie.gooen/posts/pfbid034iQ1W3e4f1ovuoN7W4DsQBpQMxus7L8zqWqf5boed6z7fm2UsDAPZg9puxxHoYubl\">https://www.facebook.com/ozzie.gooen/posts/pfbid034iQ1W3e4f1ovuoN7W4DsQBpQMxus7L8zqWqf5boed6z7fm2UsDAPZg9puxxHoYubl</a><br><br>My quick, incredibly personal opinion, is that the task of \"<i>doing serious investigation and negotiation, regarding the EA+FTX relationship</i>\", is a task no EA organization really owned. Open Phil didn't want to own this, as they were sort of a competitor. &nbsp;CEA wasn't well placed for this, in part because they were a significant donee of FTX. I think there has been a serious gap that we don't have significant evaluation/investigation into the funders themselves, but this is an awkward topic (the funders are often the most powerful actors, and don't like being investigated). I think there were enough yellow/red flags around that if a serious and lengthy investigation would have happened, it might have revealed interesting insights. I am excited about the investigation type work we proposed.</p><p>I'd also flag that I think there's a fairly unhealthy power imbalance in EA. A gigantic amount of funding and power comes from OP. This is awkward because they would likely be some of the main people organizing/funding such an FTX investigation, so that might well change incentives around it revealing public information about mistakes that they made.</p><p>I'd really like to see more diversified funding and leadership around the future of EA.&nbsp;</p>", "parentCommentId": "y7XikEaBomCWFPoQx", "user": {"username": "oagr"}}]