[{"_id": "2gPztJ9rb2txLmqT7", "postedAt": "2023-01-14T22:49:38.837Z", "postId": "HWnLXCyxxcoarQZvg", "htmlBody": "<p>You mention opportunity cost, but I think it's worth further emphasizing. To do this well, you'd need somebody who has been around a while (or at least a lot of time and cooperation from people who have). You'd need them to manage different perspectives and opinions about various things that happened. You'd need them to be a very good writer. And you'd need the writer to be someone people trust--my perspective is \"Open Phil hired this person\" would probably not be sufficient for trust.</p>\n<p>There are people who could do this: Kelsey Piper is one as you suggest. But these are all pretty unusual characteristics and the opportunity costs for the sort of person who could do this well just seem really massive. I might be wrong about this, but that's my first thought when reading your post.</p>\n", "parentCommentId": null, "user": {"username": "ThomasWoodside"}}, {"_id": "i5JrjQGzh6v39pcFa", "postedAt": "2023-01-15T02:49:29.827Z", "postId": "HWnLXCyxxcoarQZvg", "htmlBody": "<p>I don't know that I'm the kind of person OP is thinking of, but beyond opportunity cost there's also a question of reportorial distance/objectivity. I've thought a lot about whether to do a project like this and one sticking point is (a) I identify as an EA (b) I donate to GiveWell and signed the GWWC pledge (c) many of my friends are EAs, so I'm not sure any book I produce would be perceived as having sufficient credibility among non-EA readers.</p>", "parentCommentId": "2gPztJ9rb2txLmqT7", "user": {"username": "Dylan Matthews"}}, {"_id": "Z467jX7SBLsTJbgZM", "postedAt": "2023-01-15T13:04:46.566Z", "postId": "HWnLXCyxxcoarQZvg", "htmlBody": "<p>I'd encourage you to consider taking it on. Even if identifying as an EA would reduce the credibility for outsiders, I'm sure whatever you produced would be a wonderful starting point for anyone else tackling it down the line.</p>", "parentCommentId": "i5JrjQGzh6v39pcFa", "user": {"username": "casebash"}}, {"_id": "Htmj6inJmvwPQfxNT", "postedAt": "2023-01-15T14:14:23.715Z", "postId": "HWnLXCyxxcoarQZvg", "htmlBody": "<p>A possible middle ground is to make efforts to ensure that important source material was preserved, to keep option value of doing this project later. That would presumably require significantly fewer resources, and wouldn't require opportunity costs from \"the sort of person who could do [the writing of a book] well.\"</p>\n", "parentCommentId": "2gPztJ9rb2txLmqT7", "user": {"username": "Jason"}}, {"_id": "TqoLHHbCo4qdhXCSa", "postedAt": "2023-01-15T17:04:44.207Z", "postId": "HWnLXCyxxcoarQZvg", "htmlBody": "<p>I think opportunity cost is well worth mentioning, but I don't know that I think it's as high as you believe it to be.</p><p>Choosing someone who has been around a while is optional. &nbsp;The value of having an experienced community member do it is built-in trust, access, and understanding. &nbsp;The costs are the writer's time (though that cost is decreasing as more people start writing about EA professionally) and the time of those being interviewed. &nbsp;I would also note that while there's lots of work for technical people in EA, writers in the community may not have found such great opportunities for impact.</p><p>Having a relative outsider take on the project would add objectivity, as Dylan noted. &nbsp;Objectivity would both improve credibility to outsiders and increase that likelihood of robust criticism being made. &nbsp;I also think there are just a lot of pretty great writers in the world who might find EA interesting. &nbsp;Perhaps you just get different benefits from different types of writers.</p><p>There's a cost to waiting as well. &nbsp;The longer you wait, the more likely it is that important parts of the story will be forgotten or deleted.</p>", "parentCommentId": "2gPztJ9rb2txLmqT7", "user": {"username": "Pete Rowlett"}}, {"_id": "Jsagh98xy9wwcGF7c", "postedAt": "2023-01-15T17:06:04.280Z", "postId": "HWnLXCyxxcoarQZvg", "htmlBody": "<p>Definitely agree with Chris here! &nbsp;Worst case scenario, you create useful material for someone else who tackles it down the line, best case scenario, you write the whole thing yourself.</p>", "parentCommentId": "i5JrjQGzh6v39pcFa", "user": {"username": "Pete Rowlett"}}, {"_id": "NZJKse2CHdvuBbWBh", "postedAt": "2023-01-15T17:07:43.761Z", "postId": "HWnLXCyxxcoarQZvg", "htmlBody": "<p>Great point! &nbsp;A historian or archivist could take on this role. &nbsp;Maybe CEA could hire one? &nbsp;I’d say it fits within their mission “to nurture a community of people who are thinking carefully about the world’s biggest problems and taking impactful action to solve them.”</p>", "parentCommentId": "Htmj6inJmvwPQfxNT", "user": {"username": "Pete Rowlett"}}, {"_id": "ZgjpmRvrQoHvzbEGD", "postedAt": "2023-01-15T19:43:22.602Z", "postId": "HWnLXCyxxcoarQZvg", "htmlBody": "<p>I expect a project like this is not worth the cost. I imagine doing this well would require dozens of hours of interviews with people who are more senior in the EA movement, and I think many of those people’s time is often quite valuable.</p>\n<p>Regarding the pros you mention:</p>\n<ol>\n<li>\n<p>I’m not convinced that building more EA ethos/identity based around shared history is a good thing. I expect this would make it even harder to pivot to new things or treat EA as a question, it also wouldn’t be unifying for many folks (e.g. who having been thinking about AI safety for a decade or who don’t buy longtermism). According to me, the bulk of people who call themselves EAs, like most groups, are too slow to update on new arguments and information and I would expect that having a written and agreed upon history would not help with this. Then again, my point might be made better if I could reference common historical cases of what I mean lol</p>\n</li>\n<li>\n<p>I don’t see how this helps build trust.</p>\n</li>\n<li>\n<p>I don’t see how having a written history makes the movement less likely to die. I also don’t know what it looks like for the EA movement to die or how bad this actually is; the EA movement is largely instrumental toward other things I care about: reducing suffering, increasing the chances of good stuff in the universe, my and my friends’ happiness to a lesser extent.</p>\n</li>\n<li>\n<p>This does seem like a value add to me, though the project I’m imagining only does a medium job at this given it’s goal is not “chronology of mistakes and missteps”. Maybe worth checking out <a href=\"https://www.openphilanthropy.org/research/some-case-studies-in-early-field-growth/\">https://www.openphilanthropy.org/research/some-case-studies-in-early-field-growth/</a></p>\n</li>\n</ol>\n<p>With ideas like this I sometimes ask myself “why hasn’t somebody done this yet”. Some reasons that come to mind: too busy doing other things they think are important, might come across as self aggrandizing, who’s going to read it?-and ways I expect it to get read are weird and indoctorinaty (“welcome to the club, here’s a book about our history”, as opposed to “oh, you want to do lots of good, here are some ideas that might be useful”), it doesn’t directly improve the world and the indirect path to impact is shakier than other meta things.</p>\n<p>I’m not saying this is necessarily a bad idea. But so far I don’t see strong reasons to do this over the many other things openphil/cea/Kelsey piper/interviewees could be doing.</p>\n", "parentCommentId": null, "user": {"username": "Aaron_Scher"}}, {"_id": "LKYGwFiSyqtpa2NJt", "postedAt": "2023-01-15T23:59:15.158Z", "postId": "HWnLXCyxxcoarQZvg", "htmlBody": "<p>A few months ago I received a grant to spend six months researching the history of effective altruism, conducting interviews with early EAs, and sharing my findings on a dedicated website. Unfortunately, the funds for this grant came from the Future Fund, and have been affected by the collapse of FTX. I still intend to carry out this project eventually, but finding alternative funding sources is not a high priority for me, since my current projects are more urgent and perhaps more important.</p><p>If you think I should prioritize this project, or have thoughts on how it should be carried out, feel free to get in touch.</p>", "parentCommentId": null, "user": {"username": "Pablo_Stafforini"}}, {"_id": "QdC73jjnX9mbbgSuF", "postedAt": "2023-01-16T01:06:20.900Z", "postId": "HWnLXCyxxcoarQZvg", "htmlBody": "<p>I’d also say take it on. Someone objective can always rewrite it later, but if we don’t save it now we could lose a lot.</p>\n", "parentCommentId": "i5JrjQGzh6v39pcFa", "user": {"username": "Wil Perkins"}}, {"_id": "4FhacGqJD9ho9a4ts", "postedAt": "2023-01-16T01:07:02.304Z", "postId": "HWnLXCyxxcoarQZvg", "htmlBody": "<p>You should definitely prioritize it! What about creating an open source wiki of sorts to crowd source information?</p>\n<p>You could always double check / get citations later on.</p>\n", "parentCommentId": "LKYGwFiSyqtpa2NJt", "user": {"username": "Wil Perkins"}}, {"_id": "7oqokF5wvfaodHYbr", "postedAt": "2023-01-16T04:11:51.089Z", "postId": "HWnLXCyxxcoarQZvg", "htmlBody": "<p>I’ve addressed the point on costs in other commentary, so we may just disagree there!</p><ol><li>I think the core idea is that the EA ethos is about constantly asking how we can do the most good and updating based on new information. &nbsp;So the book would hopefully codify that spirit rather than just talk about how great we’re doing.</li><li>I find it easier to trust people whose motivations I understand and who have demonstrated strong character in the past. &nbsp;History can give a better sense of those two things. &nbsp;Reading about Julia Wise in <i>Strangers Drowning</i>, for example, did that for me.</li><li>Humans often think about things in terms of stories. &nbsp;If you want someone to care about global poverty, you have a few ways of approaching it. &nbsp;You could tell them how many people live in extreme poverty and that by donating to GiveDirectly they’ll get way more QALYs per dollar than they would by donating elsewhere. &nbsp;You could also tell them about your path to donating, and share a story from the GiveDirectly website about how a participant benefited the money they received. &nbsp;In my experience, that’s the better strategy. &nbsp;And absolutely, the EA community exists to serve a purpose. &nbsp;Right now I think it’s reasonably good at doing the things that I care about, so I want it to continue to exist.</li><li>Agreed!</li></ol><p>I think there could be a particular audience for this book, and it likely wouldn’t be EA newbies. &nbsp;The project could also take on a lot of different forms, from empirical report to personal history, depending on the writer. &nbsp;Hopefully the right person sees this and decides to go for it if and when it makes sense! &nbsp;Regardless, your commentary is appreciated.<br>&nbsp;</p>", "parentCommentId": "ZgjpmRvrQoHvzbEGD", "user": {"username": "Pete Rowlett"}}, {"_id": "sDu6NerQSQfqeeBY5", "postedAt": "2023-01-16T04:56:27.232Z", "postId": "HWnLXCyxxcoarQZvg", "htmlBody": "<p>People enjoyed reading Winston Churchill's <a href=\"https://en.wikipedia.org/wiki/The_Second_World_War_(book_series)\">history of the war</a> and he was hardly a neutral observer! Pretty clear which side he wanted to win.</p>", "parentCommentId": "i5JrjQGzh6v39pcFa", "user": {"username": "Larks"}}, {"_id": "ecd5DdCKMYFKmhJjj", "postedAt": "2023-01-16T10:00:44.092Z", "postId": "HWnLXCyxxcoarQZvg", "htmlBody": "<p>See also: Thomas Young's <a href=\"https://oll.libertyfund.org/title/clarkson-the-history-of-the-abolition-of-the-african-slave-trade-vol-1\">history of abolitionism</a>, Friedrich Engels' <a href=\"https://en.wikipedia.org/wiki/Socialism:_Utopian_and_Scientific\">history of Marxism.</a></p>", "parentCommentId": "sDu6NerQSQfqeeBY5", "user": {"username": "matthew.vandermerwe"}}, {"_id": "uFu6a8jYKdrEHq5gi", "postedAt": "2023-01-26T21:30:01.296Z", "postId": "HWnLXCyxxcoarQZvg", "htmlBody": "<p>I wonder whether Larissa MacFarquhar would be interested?  She wrote about the early EA community in her 2015 book Strangers Drowning (chapters \"At Once Rational and Ardent\" and \"From the Point of View of the Universe\") and also wrote a 2011 profile <a href=\"https://www.newyorker.com/magazine/2011/09/05/how-to-be-good\">of Derek Parfit</a>.</p>\n", "parentCommentId": "2gPztJ9rb2txLmqT7", "user": {"username": "Jeff_Kaufman"}}, {"_id": "ASsxCbB6cj6gBoqH9", "postedAt": "2023-01-26T22:24:20.575Z", "postId": "HWnLXCyxxcoarQZvg", "htmlBody": "<p>That would certainly be great if she would. I actually first heard about EA when I read Strangers Drowning in 2016! It's very well written.</p>\n", "parentCommentId": "uFu6a8jYKdrEHq5gi", "user": {"username": "ThomasWoodside"}}]