[{"_id": "fWAzijXJRBdi6KqXu", "postedAt": "2022-12-15T15:42:25.616Z", "postId": "Hyco4iMbL6phJwCH2", "htmlBody": "<p>Thank you for this wonderful post!</p><p>I think that this was certainly lacking in the EA community</p>", "parentCommentId": null, "user": {"username": "Jesus de Sivar"}}, {"_id": "PwvRC2WmAP888Whzg", "postedAt": "2022-12-15T15:45:40.427Z", "postId": "Hyco4iMbL6phJwCH2", "htmlBody": "<p>(thank you all for this post - I think this will be shared widely and be a really useful resource for many new EAs!)</p><p>Another reason against community building early in your career / doing global work first: I've noticed some (now) thriving communities outside traditional hubs often have a few people from that country who've gone on to do direct EA work, but are also then helping / advising &nbsp;people in their countries to set up local EA national groups or just helping them to have more impact in their own careers. Sometimes not starting with community building can put you in a better position to help it later on.&nbsp;</p>", "parentCommentId": null, "user": {"username": "vaidehi_agarwalla"}}, {"_id": "pdutRp8rL2sJjAzPw", "postedAt": "2022-12-15T16:32:27.192Z", "postId": "Hyco4iMbL6phJwCH2", "htmlBody": "<p>&nbsp;EA career advice tailored for people in based in LMICs was urgently &nbsp;needed, very glad to see this!&nbsp;<br><br>People in countries with low-EA presence can be very well-positioned to have a lot of impact even in the very short-run, as the number of low hanging fruits(really neglected high-impact opportunities where even a single person can plausibly make a substantial difference) in most of the LMICs are considerably higher compared to Western European and American countries, this post will probably empower a lot of people have more impact, thank you for writing this great post!</p>", "parentCommentId": null, "user": {"username": "Berke"}}, {"_id": "jYLLpc6E5qEHzykXv", "postedAt": "2022-12-15T17:35:28.372Z", "postId": "Hyco4iMbL6phJwCH2", "htmlBody": "<p>Fantastic work! Strongly upvoted.</p>", "parentCommentId": null, "user": {"username": "pmelchor"}}, {"_id": "bicRkCvr7zNqcLEgd", "postedAt": "2022-12-15T20:37:40.243Z", "postId": "Hyco4iMbL6phJwCH2", "htmlBody": "<p>I don't have much experience with starting charities or giving career advice, but I've often wondered if it might be very effective for people in LMIC to advocate for various institution-design innovations that are blocked by hostile regulations across most of the rich world.<br><br>Quoting from <a href=\"https://forum.effectivealtruism.org/posts/vcxj7bGERxDzuiEzr/forecasting-newsletter-looking-back-at-2021?commentId=3ddJhcPgfgJiwGksd#HLLdAiwnTypqNKiZa\">a comment of mine</a> in response to the Forecasting Newsletter bemoaning the USA's failure to recognize the immense potential value of prediction markets:</p><blockquote><p>Okay, so the USA has mostly dropped the ball on [allowing prediction markets that could inform national decisionmaking] for forty years. &nbsp;But what about every other country? &nbsp;China seems pretty ambitious and willing to make things happen in order to secure their place on the world stage -- where is the CCP-subsidized market hive-mind driving all the crucial central planning decisions? &nbsp;Well, maybe a prediction market doesn't play well with wanting to exert lots of top-down control and suppress free speech. &nbsp;Okay, what about countries in Europe? &nbsp;What about Taiwan or Singapore? &nbsp;Nobody has yet achieved some kind of <a href=\"https://blog.ethereum.org/2014/08/21/introduction-futarchy\">Hansonian utopia</a>, so what is the limiting factor?</p><p>...But maybe it's misleading to frame the question this way, as \"why is EVERY COUNTRY failing in the SAME WAY\", because most prediction market advocates have all been inside the USA/anglosphere, so other countries haven't really had a fair shot at being persuaded? &nbsp;(In this case, maybe all that's necessary is to fund some prediction-market advocacy groups in Taiwan, Singapore, India, Dubai, South Korea, and other diverse locations until somebody finally takes the offer! &nbsp;Then, once one country is doing it, that will make it easier for the innovation to spread elsewhere.</p></blockquote><p>So it seems to me like it could be very impactful for a group of university students in LMIC to start advocating for greater adoption of prediction markets, since if the idea took off in just one country, their example might inspire many others. &nbsp;And there are a variety of other issues, besides prediction markets, that seem to have this same structure:</p><ul><li>Human challenge trials of new vaccines often face strong headwinds in western nations, despite their potential to save many lives for low risk by accelerating medical progress. &nbsp;<a href=\"https://www.vox.com/future-perfect/2022/11/3/23436548/tuberculosis-tb-malawai-africa-human-challenge-trials-vaccine\">These scientists in Malawi, working on a tuberculosis vaccine</a>, seem to me like they are in a position to really do pioneering work with global impact even beyond the vaccine they're developing, by changing the wider narrative around human challenge trials. &nbsp;Beyond just the issue of human challenge trials, there are a variety of other ways that broken regulations can <a href=\"https://astralcodexten.substack.com/p/adumbrations-of-aducanumab\">block progress in medical science</a>.</li><li>Improved voting systems (<a href=\"https://electionscience.org/library/approval-voting/\">like approval voting</a>), and other fundamental governance reforms, are not in the unique situation of \"opposed by western countries, allowed in developing countries\" &nbsp;like prediction markets or human challenge trials. &nbsp;But it is another area where policy experimentation is rare and very valuable -- I think the whole world could benefit from seeing successful experiments pulled off in a few small countries.</li><li>I always get excited about the idea of implementing <a href=\"https://astralcodexten.substack.com/p/does-georgism-work-is-land-really\">Georgist land taxes</a> and other efficiency-boosting <a href=\"https://en.wikipedia.org/wiki/Pigouvian_tax\">\"Pigouvian\" taxes</a>, although these ideas (like congestion pricing to reduce traffic in crowded city centers) often take a lot of administrative capacity to implement, so might be more suited to places like the EU than the leaner, less-experienced government bureaucracies of many LMICs.</li><li>Finally, the idea of \"<a href=\"https://chartercitiesinstitute.org/intro/\">Charter cities</a>\" might be one of the most impactful things for people in LMIC to advocate for. &nbsp;This is similar the common practice of \"special economic zones\" that provide support for developing industries, except bigger and more ambitious -- instead of just giving a tax break to some businesses that agree to set up factories in a local port, a charter city creates a special jurisdiction for a whole city, and has more freedom to create its own laws and governing structures according to international best practices. &nbsp;Charter cities thus have a dual promise: as laboratories for institutional innovation, they can help test out new ideas (like the ones I've mentioned above) that could later spread to many countries (<a href=\"https://astralcodexten.substack.com/p/prospectus-on-prospera\">Prospera, Honduras</a> is a good example of a very cutting-edge, experimental charter city that is trying to leapfrog the developed world with a dazzling array of new concepts). &nbsp;But by starting with proven best practices in development economics that helped the growth of cities like Hong Kong, Singapore, and Dubai, they can also act as a powerful engine for growth of their home country, providing prosperity to both the people who move to the new city and the country where the city is located. &nbsp;(<a href=\"https://www.fdiintelligence.com/content/feature/charter-cities-offer-alternative-to-ailing-african-sezs-81786\">Nkwashi, Zambia</a>, is another promising project that is more closely following what has worked for developing countries in the past. &nbsp;Here is a whole <a href=\"https://www.startupcitiesmap.com/map\">map of similar such projects</a> in different nations.)</li></ul><p>All that is to say, that I would be super-excited to see some fellow effective altruists in India, or the Spanish-speaking world, or etc, set up an organization to advocate for whichever of the above ideas make the most sense in their local context. &nbsp;And I think EA as a whole should consider providing more support to people in diverse countries who are helping humanity as a whole take more \"shots on goal\" when it comes to implementing ideas that might improve democratic governance, economic growth, or scientific progress.</p>", "parentCommentId": null, "user": {"username": "Jackson Wagner"}}, {"_id": "zd6FjL3XmHw6AfmbQ", "postedAt": "2022-12-15T22:12:04.798Z", "postId": "Hyco4iMbL6phJwCH2", "htmlBody": "<p>Yes, I was surprised not to see policy work in LMICs on this list to be honest!</p>\n", "parentCommentId": "bicRkCvr7zNqcLEgd", "user": {"username": "Khorton"}}, {"_id": "FZHxWjJ5NSqumjQGN", "postedAt": "2022-12-15T22:48:14.550Z", "postId": "Hyco4iMbL6phJwCH2", "htmlBody": "<p>Thanks for writing this and broadening the conversion on LMIC :)</p>", "parentCommentId": null, "user": {"username": "Claudette Salinas"}}, {"_id": "y73qMjApkFF2To32Q", "postedAt": "2022-12-15T22:53:23.206Z", "postId": "Hyco4iMbL6phJwCH2", "htmlBody": "<blockquote><p>Always remember that impact is achieved through direct work...</p></blockquote><p>Even in emerging economies, impact needs funding. (Effective) donations are not mentioned in the post. However, they should be quite central, because of</p><p>1) Solidarity: Even little privileged people in EA in LMICs should keep solidarity with large donors: everyone is giving up some 'next level' comforts, compared to their norm. Whether that is the smaller Tesla or walking for the hour every day.</p><p>That personal commitment can make the community a yet more honorable place to be a part of.</p><p>2) Impact: Not only \"[s]mall donors can sometimes beat large donors in terms of cost-effectiveness,<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefc6hvnsddmo5\"><sup><a href=\"#fnc6hvnsddmo5\">[1]</a></sup></span>\" for example by identifying the 1 in 10,000 children who would have died from malaria in a community with or without nets and buying them the $4 treatment, but also they can show/test paths for more cost-effective donations.</p><p>This will make dialogues with large donors very fruitful, as both parties<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefwt1kok8jyp\"><sup><a href=\"#fnwt1kok8jyp\">[2]</a></sup></span>&nbsp;will be bringing their very significant comparative advantages.</p><p>3) Change leverage: People who are invested in finding yet better ways of caring for others whose issues they connect with should enjoy greater community approval than those who waited for instructions and received funding to advance others' solutions.</p><p>People who could be supported in scaling up programs will be the ones who sincerely care. This is necessary for a change to happen.</p><p>4) Solutions pressure: For many relatively privileged people in LMICs, it can be common to support many others. For example, it is possible to meet even 5 begging children trying to gain attention every day and donate to some. If one is spending others' funding, they may seek to just gain the $1,000 GiveDirectly transfer for each of them, which is unrealistic given the scale of poverty.</p><p>If one is spending their own funds, they may think twice about a sustainable yet affordable program that would make a decisive impact for the children.</p><blockquote><p>We think it is unlikely that new EAs in LMICs will find comparable charities to existing GiveWell’s recommended charities, particularly in middle income countries. Existing charity evaluators are probably better suited to do this work.</p><p>On the other hand, engaging in some charity evaluation efforts can be formative for some EAs to help them internalize cost effectiveness evaluation and prioritization.&nbsp;</p></blockquote><p>The post suggests to start with values and methodologies used by prominent Western institutions<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefxmopa3hnvzf\"><sup><a href=\"#fnxmopa3hnvzf\">[3]</a></sup></span>&nbsp;and conduct evaluations of local situations only after these values are internalized.</p><p>This can lead to value imposition.</p><p>Rather, one can start with local values or value systems and develop/refine/discuss methodologies for their measurement. This can enrich the discourse on the meaning(s) of 'good.'</p><p>Some resources on values presented by local scholars and their measurements include &nbsp;this paper on <a href=\"https://repository.up.ac.za/bitstream/handle/2263/79761/Mutsonziwa_Ubuntu_2020.pdf?sequence=1&amp;isAllowed=y\">measuring Ubuntu</a>, this \"Buddhist <a href=\"https://www.researchgate.net/publication/332107582_The_Buddhist_perspective_on_measuring_wellbeing_and_happiness_in_sustainable_development\">perspective</a> on measuring wellbeing and happiness in sustainable development,\" and this page on broad <a href=\"https://www.insightsonindia.com/ethics-integrity-and-aptitude/human-values/human-values-in-hinduism/\">values in Hinduism</a>.<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefj7m9jjc95le\"><sup><a href=\"#fnj7m9jjc95le\">[4]</a></sup></span></p><p>The key can be to discern which values are truly held by the people vs. presented by a scholar but not held as well as which are internalized based on own decisions vs. based on conformation to a previous or an external standard.</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnc6hvnsddmo5\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefc6hvnsddmo5\">^</a></strong></sup></span><div class=\"footnote-content\"><p>I interpret, here, small and large donor as an average-income person in a LIC and a HIC.</p></div></li><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnwt1kok8jyp\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefwt1kok8jyp\">^</a></strong></sup></span><div class=\"footnote-content\"><p>I am imagining a person who had only $4 to donate in a month and someone who had $4,000 speaking about effective ways of saving lives. I am not stating a LMICs vs. HICs dichotomy.</p></div></li><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnxmopa3hnvzf\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefxmopa3hnvzf\">^</a></strong></sup></span><div class=\"footnote-content\"><p>based on the presumed origin of the frameworks in the post and the resources sheet</p></div></li><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnj7m9jjc95le\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefj7m9jjc95le\">^</a></strong></sup></span><div class=\"footnote-content\"><p>People in different contexts in LMICs (and HICs) can be better informed on various quality values-measurements resources.</p></div></li></ol>", "parentCommentId": null, "user": {"username": "brb243"}}, {"_id": "s6wajuqMKurovALHb", "postedAt": "2022-12-15T23:50:45.783Z", "postId": "Hyco4iMbL6phJwCH2", "htmlBody": "<p><strong>Post summary</strong> (feel free to suggest edits!):<br>The authors broadly recommend the following for EAs from low and middle income countries (LMICs):</p><ul><li>Build career capital early on</li><li>Work on global issues over local ones, unless clear reasons for the latter</li><li>Some individuals to do local versions of: community building, priorities research, charity-related activities, or career advising</li></ul><p>They discuss pros, cons, and concrete next steps for each. Individuals can use the scale / neglectedness / tractability framework, marginal value, and personal fit to assess options. They suggest looking for local comparative advantage at global priorities, and taking the time to upskill and engage deeply with EA ideas before jumping into direct work.</p><p>(If you'd like to see more summaries of top EA and LW forum posts, check out the <a href=\"https://forum.effectivealtruism.org/s/W4fhpuN26naxGCBbN\">Weekly Summaries</a> series.)</p>", "parentCommentId": null, "user": {"username": "GreyArea"}}, {"_id": "GB8mJTwFCLYXzqNCP", "postedAt": "2022-12-16T03:24:07.899Z", "postId": "Hyco4iMbL6phJwCH2", "htmlBody": "<p>Thank you for sharing this. I am a professor and I reside in Nigeria. I've also interacted with a number of colleagues from my own nation. You'll see that many of them believe they can't compete with their Western colleagues. You may imagine that funders will believe that the person from the west will perform better and be more likely to receive funding if, for instance, someone from LMIC and the west propose wastewater surveillance as a technique to monitor the environment for important infections. So far I have had 100% rejection with EA funds and open philanthropy fellowships. The mentorship component appears to be fascinating. My opinion is this, EA should consider strengthening Mentorship for &nbsp;LMICs to help solve the problem of capacity, or proposing ideas that look a good fit as well as solving problems of inferiority following a series of rejections. &nbsp;</p><p>If you are interested in mentoring a faculty member from LMIC to pursue a cause that is global and relevant to the EA goals, kindly reach out via DM. I will be glad to talk with you.&nbsp;</p>", "parentCommentId": null, "user": {"username": "emmannaemeka"}}, {"_id": "AAHNGNRxNoHkSqPFC", "postedAt": "2022-12-16T10:38:48.225Z", "postId": "Hyco4iMbL6phJwCH2", "htmlBody": "<p>This is a great post! It's really good to see some specific advice for people in LMICs - something sorely needed in EA.</p><p>Speaking as part of Probably Good, we're trying to fill some of this gap (to the extent we're able). On top of our profile on <a href=\"https://www.probablygood.org/profile-civil-service-careers\">civil service careers in LMICs</a> , we also recently released a profile on <a href=\"https://www.probablygood.org/profile-monitoring-and-evaluation-specialist\">monitoring and evaluation careers</a>, a path we note could be particularly promising for people based in LMICs. We'd be really keen to hear your thoughts on how we might do this more/better!</p>", "parentCommentId": null, "user": {"username": "Dylan_Balfour"}}, {"_id": "anJtCbLuhAvd8m4md", "postedAt": "2022-12-20T14:33:34.487Z", "postId": "Hyco4iMbL6phJwCH2", "htmlBody": "<p>This was an amazing post – well done!! :-)</p>", "parentCommentId": null, "user": {"username": "weeatquince"}}, {"_id": "jihQRtG3ySSsMroLL", "postedAt": "2023-02-03T21:35:26.406Z", "postId": "Hyco4iMbL6phJwCH2", "htmlBody": "<p>Curious to hear more about your thought and perfectives and your experience with the Nigerian context. Hopefully, we can chat.&nbsp;</p>", "parentCommentId": "GB8mJTwFCLYXzqNCP", "user": {"username": "zakariyauu"}}]