[{"_id": "JXQJyBw8Yf6F3XN3j", "postedAt": "2022-09-28T19:42:18.947Z", "postId": "HYoo94dsMyWD4Jy3F", "htmlBody": "<p>Sadly the video isn't available in the UK</p>", "parentCommentId": null, "user": {"username": "nathan"}}, {"_id": "soJnW6mvbbxojv5A8", "postedAt": "2022-09-28T20:29:48.736Z", "postId": "HYoo94dsMyWD4Jy3F", "htmlBody": "<p><a href=\"https://www.youtube.com/watch?v=Lm3LjX3WhUI\">UK version</a></p>", "parentCommentId": "JXQJyBw8Yf6F3XN3j", "user": {"username": "tylermaule"}}, {"_id": "brwqbNtijbqKfn3eE", "postedAt": "2022-09-28T21:34:01.125Z", "postId": "HYoo94dsMyWD4Jy3F", "htmlBody": "<p>❤️</p>", "parentCommentId": "soJnW6mvbbxojv5A8", "user": {"username": "nathan"}}, {"_id": "xSiQhhqYj3da3eQBa", "postedAt": "2022-09-28T21:35:46.699Z", "postId": "HYoo94dsMyWD4Jy3F", "htmlBody": "<p>The interview went really well. Props to Will, that looked really difficult to navigate.</p>", "parentCommentId": null, "user": {"username": "nathan"}}, {"_id": "KBdobD7wpmykpknam", "postedAt": "2022-09-29T01:10:30.899Z", "postId": "HYoo94dsMyWD4Jy3F", "htmlBody": "<p>Canadian version <a href=\"https://www.youtube.com/watch?v=Lm3LjX3WhUI\">here</a>. He did a really good job.</p>", "parentCommentId": null, "user": {"username": "ryancbriggs"}}, {"_id": "JrmeNatjqaC9Kb8Ft", "postedAt": "2022-09-29T01:13:30.398Z", "postId": "HYoo94dsMyWD4Jy3F", "htmlBody": "<p>I'm starting to think there's no possible question for which Will can't come up with an answer that's true, useful, and crowd-pleasing. We're lucky to have him!</p>", "parentCommentId": "xSiQhhqYj3da3eQBa", "user": {"username": "smountjoy"}}, {"_id": "7AjMkWeBpo5xtAz6h", "postedAt": "2022-09-29T02:06:24.721Z", "postId": "HYoo94dsMyWD4Jy3F", "htmlBody": "<p>I think this went really well, although MacAskill could make another point, which I'm not sure why he chose not to - which is that the people living paycheck to paycheck, not being sure where their rent will come from, aren't really expected to do these things. That these are the obligations of people in stable lives, and that those who don't yet have stability should focus on obtaining it for themselves first.</p>\n", "parentCommentId": null, "user": {"username": "Guy Raveh"}}, {"_id": "BbJmaKndodevj76GW", "postedAt": "2022-09-29T12:17:45.698Z", "postId": "HYoo94dsMyWD4Jy3F", "htmlBody": "<p>Minor nitpick. I don't want to drive fossil fuel companies out of business. I want to tax their carbon-producing activities to the point they clear up the damage they have done and are carbon neutral in future.&nbsp;<br><br>Giving a short nuanced answer to this effect would have been really difficult, but, alongside praising Will for what was a superb interview, it feels worth pointing out possible improvements. The world is lucky that Will did not accidentally die falling through the roof of some Scottish abandoned building<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefvj2t4wnvf4q\"><sup><a href=\"#fnvj2t4wnvf4q\">[1]</a></sup></span>.</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnvj2t4wnvf4q\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefvj2t4wnvf4q\">^</a></strong></sup></span><div class=\"footnote-content\"><p>I'm paraphrasing, but this is a real thing that really nearly happened and if it had, I wonder where we'd all be now.</p></div></li></ol>", "parentCommentId": null, "user": {"username": "nathan"}}, {"_id": "cNnH9yfipc8EHKmLf", "postedAt": "2022-09-29T12:19:06.509Z", "postId": "HYoo94dsMyWD4Jy3F", "htmlBody": "<p>I guess it didn't occur to him. You can see he's nervous and speaking succinctly and winsomely in front of a crowd and tv cameras is <i>really</i> hard. I was impressed how many relevant facts he had at his immediate disposal.</p>", "parentCommentId": "7AjMkWeBpo5xtAz6h", "user": {"username": "nathan"}}, {"_id": "3P3bRssQKkP2Z6Gi3", "postedAt": "2022-09-29T12:21:25.808Z", "postId": "HYoo94dsMyWD4Jy3F", "htmlBody": "<p><i>heavily edited</i></p><p>This isn't an easy question, but I think it's valuable enough to ask. How easily do non-British-Isles people understand Will's speech?&nbsp;<br>&nbsp;<br>Tick -&gt; you struggle to understand it<br>Cross -&gt; you understand it fine<br><br>I think this is both a delicate topic and something that <i>seems</i> reasonable to ask. I don't love that I am discussing a hugely over-scrutinised person's accent, but equally, if it turns out that Will's comprehensibility could be improved, valuable to know. Nor is this really a Will thing, we could all work on our comprehensibility. It's just that only 1 of us is on Trevor Noah.<br><br>Mostly, lets see what the non-British-Isles community actually thinks. Hopefully, this gets x-voted into oblivion.<br><br><i>Editing notes. The original text was a bit blunter and I felt bad. Feel free to downvote it if you think it was a bad question in general. Thanks to Karthik for the challenge. Also I wanted to give people a way to vote on the substance of the issue. The tick and cross are the other way round so that if people say they understand him fine, I'm punished for asking the question in the first place.</i></p>", "parentCommentId": null, "user": {"username": "nathan"}}, {"_id": "heJ9z3mnm3vkGfGhw", "postedAt": "2022-09-29T13:13:14.170Z", "postId": "HYoo94dsMyWD4Jy3F", "htmlBody": "<p>I'm not a native speaker and found his accent very easy to understand. But yeah, info on Americans might be valuable.</p>\n", "parentCommentId": "3P3bRssQKkP2Z6Gi3", "user": {"username": "Guy Raveh"}}, {"_id": "9NLw4hkaCAsWJMcJG", "postedAt": "2022-09-29T13:20:23.273Z", "postId": "HYoo94dsMyWD4Jy3F", "htmlBody": "<p>As another point, I'm really glad to see how well Trevor Noah understood this, and how intelligently he tried to confront Will's argument with the prevalent progressive views.</p>\n", "parentCommentId": null, "user": {"username": "Guy Raveh"}}, {"_id": "RaGup3yRYXnsuzzNj", "postedAt": "2022-09-29T15:34:38.674Z", "postId": "HYoo94dsMyWD4Jy3F", "htmlBody": "<p>Apart from a few things (rs) I actually think his accent might be phonetically closer to an American accent than most UK accents. It didn't seem hard to understand.</p>", "parentCommentId": "3P3bRssQKkP2Z6Gi3", "user": {"username": "anonymous6"}}, {"_id": "NTGhGRsc4xwc3z2qY", "postedAt": "2022-09-29T18:42:17.202Z", "postId": "HYoo94dsMyWD4Jy3F", "htmlBody": "<p>I think his accent might actually have the effect of being a draw due to the novelty for Americans. Plus it then additionally forces a listener to listen more closely if they cant follow as easily - and it is hardly a bad thing for your audience to be paying more close attention to you if you're making nuanced arguments.</p><p>But I'm just projecting my own experience here, probably.</p>", "parentCommentId": "3P3bRssQKkP2Z6Gi3", "user": {"username": "Cornelis Dirk Haupt"}}, {"_id": "8XzriyJF2zhf4zosr", "postedAt": "2022-09-29T18:54:16.569Z", "postId": "HYoo94dsMyWD4Jy3F", "htmlBody": "<p>While we're nitpicking, I think \"above a certain threshold, money doesn't make a difference to your life\" is probably false. My best sense of the literature is that there are sharply diminishing returns but I don't think additional money gets you zero or negative utility<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnref5eh7ci9zfbg\"><sup><a href=\"#fn5eh7ci9zfbg\">[1]</a></sup></span>.&nbsp;</p><p>But overall I thought the interview was quite good. I got the impression people really liked him. Intuitively it must be really hard to be honest for 10+ minutes without saying something that goes against leftist dogma, and of course doing it live adds a lot of pressure.</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fn5eh7ci9zfbg\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnref5eh7ci9zfbg\">^</a></strong></sup></span><div class=\"footnote-content\"><p>Now of course we don't have accurate data/studies on billionaires, so basically we're back at intuition/priors.</p></div></li></ol>", "parentCommentId": "BbJmaKndodevj76GW", "user": {"username": "Linch"}}, {"_id": "PY32jSaKJ6NBQtGoo", "postedAt": "2022-09-29T20:48:46.456Z", "postId": "HYoo94dsMyWD4Jy3F", "htmlBody": "<p>I understand this is a question in good faith that is concerned about comprehensibility. Nonetheless, I downvoted because I think this form of discussion is generally bad. I don't think it's okay for us to tell people - even community leaders like Will - how they should sound, no more than we should opine on how they look. The New Yorker profile has examples of how weird this can get, with Will asking his friends if he should get dental surgery to be a more appealing public figure. Discussing how to engineer a person into the perfect PR machine has limits.</p>\n<p>I understand that <em>comprehensibility</em> is important. But the overlap with accent is not that large - comprehensibility is also about diction, pace, modulation, command over language, etc.</p>\n", "parentCommentId": "3P3bRssQKkP2Z6Gi3", "user": {"username": "therealslimkt"}}, {"_id": "ZLtMuhsuAiDsfkNCj", "postedAt": "2022-09-29T21:01:13.550Z", "postId": "HYoo94dsMyWD4Jy3F", "htmlBody": "<p>I have some difficulty in understanding Will's accent (as an American who grew up in the northeast--New Hampshire), though notably less difficulty than plenty of Americans who aren't as articulate. Specfically, I listened to WWOTF at 2x speed and I struggled to hear everything. I know I can easily comprehend other voices at the same wpm, but with Will I was missing occasional words and it took until the second half of the book before I felt I was really hearing everything. I wished they had gone with a professional narrator for selfish reasons, though I understood the motivation behind Will narrating it himself. (At 1x speed I have the same issues with Will's voice, except my brain has more time to process and figure out what word he said based on context, so it's not an issue.).</p>\n", "parentCommentId": "3P3bRssQKkP2Z6Gi3", "user": {"username": "WilliamKiely"}}, {"_id": "gyiRovyXE6fEXoBXe", "postedAt": "2022-09-29T21:31:12.174Z", "postId": "HYoo94dsMyWD4Jy3F", "htmlBody": "<p>Ok, I'm really confused about the downvotes here. If someone cares to explain, I'd be grateful.</p>\n", "parentCommentId": "7AjMkWeBpo5xtAz6h", "user": {"username": "Guy Raveh"}}, {"_id": "iEtJnvFbBzHexySxn", "postedAt": "2022-09-30T02:04:47.824Z", "postId": "HYoo94dsMyWD4Jy3F", "htmlBody": "<p>I didn't downvote but my guess is that there are two distinct reasons:</p><ul><li>The Daily Show is the big leagues. MacAskill's interview was really well done, which is hard for the audience and context. &nbsp;I think that every phrase MacAskill said was carefully chosen to be correct and serve the intended narrative, while at the same time appearing succinct and natural. A digression, which IMO is what you're suggesting, would take up time and attention.&nbsp;<br><br>The natural place where MacAskill could insert your proposed point was inside a potentially problematic subthread that EA attracts billionaire wealth. MacAskill responded by an argument revolving around the idea that that billionaires should pay more than others.&nbsp;<ul><li>To be more exact, &nbsp;at \"6:16\" the host said \"<i><strong>It's also interesting to see how many billionaires have signed onto your ideas.\"</strong></i></li><li>IMO, this is a pretty \"hingey\" place in the interview and MacAskill responds perfectly by talking about how wealth doesn't matter much proportionately to the wealthy, and even lands applause with a punchy point.</li><li>At about 7:05 is the most natural place for your comment, and MacAskill uses it to press on the (hyper)privileged giving more. Here's a rough transcript:</li><li><img src=\"https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/0b1eb3ee1dd3ae02c50041a5a5558aefa846098e7eab611c.png\" srcset=\"https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/0b1eb3ee1dd3ae02c50041a5a5558aefa846098e7eab611c.png/w_139 139w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/0b1eb3ee1dd3ae02c50041a5a5558aefa846098e7eab611c.png/w_219 219w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/0b1eb3ee1dd3ae02c50041a5a5558aefa846098e7eab611c.png/w_299 299w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/0b1eb3ee1dd3ae02c50041a5a5558aefa846098e7eab611c.png/w_379 379w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/0b1eb3ee1dd3ae02c50041a5a5558aefa846098e7eab611c.png/w_459 459w\"></li></ul></li><li>The second issue is that, in this specific enviromment, I think there's a risk of having &nbsp;your point conflated: your point that the underprivileged should not have to give, might be conflated with the <i><strong>idea that underprivileged should not engage with EA</strong></i>.&nbsp;<ul><li>This conflation outcome seems bad: it’s possible that non-\"elite\", lower income people could make major contributions to EA by being employees, leaders or founders (which is like, your personal belief right?). Also, this idea is terrible optics.</li><li>I think there is some risk of this conflation and it would take care and attention to communicate this original point. Even 15 seconds would be costly and risk redirecting the flow of the conversation.<br>&nbsp;</li></ul></li></ul><p><i><strong>I'm not sure this is true, also, I'm personally a carpet bagger and chancer and I learned about EA two weeks ago: </strong></i>My sense is that the original, OG EAs, were hard core and took the idea of frugality very seriously. There's stories about Julia Wise crying about having candy bought for her, when it could buy a bednet instead. MacAskill has had serious back problems, presumably because he avoided spending money on furniture or specialists for himself.&nbsp;</p><p>Even among very established, \"EA elite\", there might many who miss things about that old spirit. The ideas in your comment seem against this level of dedication and might screen out new \"instances\" of these people.&nbsp;<br><br>&nbsp;</p>", "parentCommentId": "gyiRovyXE6fEXoBXe", "user": {"username": "Charles He"}}, {"_id": "mGhwbLvhyBwCw6prd", "postedAt": "2022-09-30T05:44:46.119Z", "postId": "HYoo94dsMyWD4Jy3F", "htmlBody": "<p>&gt;My sense is that the original, OG EAs, were hard core and took the idea of frugality very seriously<br><br>The relevant story:</p><blockquote><p>It was a sunny day in September, and they were at an apple orchard outside Boston. There were candy apples for sale, and Julia wanted one. Normally she would have told herself that she could not justify spending her money that way, but Jeff had told her that if she wanted anything he would buy it for her with his money. He had found a job as a computer programmer; <i><strong>Julia was still unemployed, and did not have any savings, because she had given everything she had earned in the summer to Oxfam.</strong></i></p><p>That night they lay in bed and talked about money. Jeff told Julia that, inspired by her example, he was thinking of giving some percentage of his salary to charity. And Julia realised that, if Jeff was going to start giving away his earnings, then, by asking him to buy her the apple, she had spent money that might have been given. <i><strong>With her selfish, ridiculous desire for a candy apple, she might have deprived a family of an anti-malarial bed net or deworming medicine that might have saved the life of one of its children. The more she thought about this, the more horrific and unbearable it seemed to her, and she started to cry. </strong></i>She cried for a long time, and it got so bad that Jeff started to cry, too, which he almost never did. He cried because, more than anything, he wanted Julia to be happy, but how could she be happy if she went through life seeing malarial children everywhere, dying before her eyes for want of a bed net? He knew that he wanted to marry her, but he was not sure how he could cope with a life that was going to be this difficult and this sad, with no conceivable way out.</p><p>They stopped crying and talked about budgets. They realised that Julia was going to lose her mind if she spent the rest of her life weighing each purchase in terms of bed nets, so, after much discussion, they came up with a system...</p></blockquote><p><a href=\"https://www.theguardian.com/world/2015/sep/22/extreme-altruism-should-you-care-for-strangers-as-much-as-family\">https://www.theguardian.com/world/2015/sep/22/extreme-altruism-should-you-care-for-strangers-as-much-as-family</a></p>", "parentCommentId": "iEtJnvFbBzHexySxn", "user": {"username": "Charles He"}}, {"_id": "EHguajEmY3FoBdZnv", "postedAt": "2022-09-30T12:12:11.278Z", "postId": "HYoo94dsMyWD4Jy3F", "htmlBody": "<p>American, find it easy to understand. Evidence that this isn't a large problem: the movie Shrek chose to use a Scottish accent for it's main character.</p>\n", "parentCommentId": "3P3bRssQKkP2Z6Gi3", "user": {"username": "jpaddison"}}, {"_id": "imkrtA8aTzhhcSQmu", "postedAt": "2022-09-30T13:32:22.449Z", "postId": "HYoo94dsMyWD4Jy3F", "htmlBody": "<p>Agreed. I don't think these questions should be off limits, but it's good to be thoughtful and remember there's a real person at the other end who probably has his own views about his voice, appearance etc - this isn't a theoretical optimisation problem!</p>\n", "parentCommentId": "PY32jSaKJ6NBQtGoo", "user": {"username": "Khorton"}}, {"_id": "ypnZHbMFF75JuvwZW", "postedAt": "2022-09-30T14:02:41.290Z", "postId": "HYoo94dsMyWD4Jy3F", "htmlBody": "<p>I made some edits. Thank you for the challenge.<br><br>&nbsp;I guess I disagree that personal branding isn't real and a choice. People make choices about their presentation all the time. I think the question is more whether this is a reasonable question to ask in public. I'm open to the idea that it isn't.</p>", "parentCommentId": "PY32jSaKJ6NBQtGoo", "user": {"username": "nathan"}}, {"_id": "E8E3zjM3JCmQJ74fJ", "postedAt": "2022-09-30T14:05:05.070Z", "postId": "HYoo94dsMyWD4Jy3F", "htmlBody": "<p>Any thoughts on my edited version?</p>", "parentCommentId": "imkrtA8aTzhhcSQmu", "user": {"username": "nathan"}}, {"_id": "u8GELzNB8YHo24Koq", "postedAt": "2022-09-30T16:27:15.967Z", "postId": "HYoo94dsMyWD4Jy3F", "htmlBody": "<p>I just don't think an accent is identical to other forms of presentation. Accents are deeply personal and cultural. When I debated in high school for a non-indian audience, we were repeatedly told in euphemistic terms that our accents made us less \"compelling\". It was deeply demoralizing to know that not being from Eton made us worse to listen to, and I know people who consciously changed their accent because of it.</p>\n<p>Now that my accent has become Americanized after years of living in the US, it is genuinely painful and isolating to meet Indian people who think I grew up in the US because of my Americanized accent. I have lost something of my connection to India because of my accent change. I listen to myself and I sometimes wonder who the hell is speaking.</p>\n<p>Sidenote: since you've essentially removed the original comment, some of the context has been lost. In particular the thing that ticked me off the most was not you saying that some people might not understand Will, but that his accent \"might be something to work on\".</p>\n", "parentCommentId": "ypnZHbMFF75JuvwZW", "user": {"username": "therealslimkt"}}, {"_id": "273btWctRjszPJjoX", "postedAt": "2022-09-30T16:46:36.714Z", "postId": "HYoo94dsMyWD4Jy3F", "htmlBody": "<p>Ha, it's probably over the top the other way now, but seems fine!</p>\n", "parentCommentId": "E8E3zjM3JCmQJ74fJ", "user": {"username": "Khorton"}}, {"_id": "YbTqBZyGZwhoT866h", "postedAt": "2022-10-03T17:32:43.893Z", "postId": "HYoo94dsMyWD4Jy3F", "htmlBody": "<p>I am much less confident this is a comment worth making given people have voted as much. I, therefore, retract it. Oops/sorry.</p>", "parentCommentId": "3P3bRssQKkP2Z6Gi3", "user": {"username": "nathan"}}]