[{"_id": "b8pjvXyAWmsrBvj35", "postedAt": "2022-11-18T13:12:55.937Z", "postId": "HYRfAGwNc6jzKkWt7", "htmlBody": "<p>My understanding of both Universal Basic Income and Guaranteed Minimum Income are as programs that cover all of a given population and that can essentially only be achieved by policy /government intervention. The reason being that the cost of both, to cover a whole population, is just so expensive that it could only ever be funded by tax revenue. My (far less than perfectly informed) instinct is that true UBI or GMI in a developed country isn't financially possible with private funding but only with a more radically mandated redistribution through tax (especially UBI which is the more expensive of the two).&nbsp;</p><p>I see your immediate pilot proposal isn't an actual GMI but is a limited cash transfer program over a period of time for a specific population. Your information on Arizona is really interesting and I tend to agree with you that cash is probably one of the best ways to solve this problem, but I probably wouldn't describe it as a guaranteed income due to the reasonably short duration.</p>", "parentCommentId": null, "user": {"username": "Chantal"}}, {"_id": "Tg7QnDnbEhiGWYLGk", "postedAt": "2022-11-18T15:11:05.924Z", "postId": "HYRfAGwNc6jzKkWt7", "htmlBody": "<p>Thanks for reading this 30-minute thing. I first wanted to make a short 5-minute read but I realized that many of you would probably really want all of the evidence laid out clearly, and our plan explained in excruciating detail. - <i>so you can point out the super obvious reason why this has a 0% chance of success, that I've completely overlooked &nbsp;- &nbsp;<strong>despite my search for fundamental issues since I came up with the idea, and asking all of the experts I can find</strong></i><strong>.&nbsp;</strong></p><p>The EA community is probably the most knowledgeable community in the world about helping people. Considering the world-changing impact potential I've outlined, even a 1% chance of success would justify spending millions to make this happen. Unless of course, someone can find a problem.</p><p>Please find a <a href=\"https://fs.blog/first-principles/\">fundamental, first-principles problem</a> with my plan, and, if you can't, please <a href=\"https://thelogicalfoundation.org\">help us succeed</a>. <strong>My challenge for you: Find an insurmountable problem, or help us change the world.</strong></p><p>&nbsp; I think our odds are more like 40% without support from EA organizations and as high as 75% with your support. The faster we can grow (<a href=\"https://www.forbes.com/sites/forbescoachescouncil/2021/01/25/15-warning-signs-that-show-a-company-is-growing-too-fast/?sh=316f8ed2509f\">but not too fast</a>), the faster we may be able to end poverty. Time is very much of the essence.</p>", "parentCommentId": null, "user": {"username": "Michael Simm"}}, {"_id": "wBgiyX3gxSwmLrWqs", "postedAt": "2022-11-18T15:31:21.959Z", "postId": "HYRfAGwNc6jzKkWt7", "htmlBody": "<p><a href=\"https://gicp.info/what-is-guaranteed-income/\">Guaranteed Income</a> is generally defined as regular cash payment accessible to members of a community, with no strings attached and no work requirements. There's no minimum amount of regular payments, and the \"Guaranteed Income Movement\" is a thing growing under that verbiage. I use GI instead of UBI because UBI means every person in an entire geographic region.</p><p>You're right that it can't completely scale with just private funding, we'll have to apply for funding and advocate for government grants at all levels and across the country under the same platform. We can do this without getting in 501(c)(3) trouble with the IRS for politicking.&nbsp;</p><p>The thought process is, \"if we get <a href=\"https://www.bbc.com/future/article/20190513-it-only-takes-35-of-people-to-change-the-world\">enough people </a>guaranteed income, they will be very loud about how awesome it is and the rest of the population will demand national UBI policy.\" <strong>Then repeat in every country.</strong></p>", "parentCommentId": "b8pjvXyAWmsrBvj35", "user": {"username": "Michael Simm"}}]