[{"_id": "TLatLuoCCfGg8eo2A", "postedAt": "2022-09-26T04:34:21.340Z", "postId": "HytJXbmxGtF7guqnJ", "htmlBody": "<p>Do you have a take on whether your recommendations here would change GW's funding allocation, and how (up or down), as per the contest details? If I understand you correctly, the efficiencies of scale section implies slightly increasing funding while switching to WHO data over IHME implies slightly reducing it; I'm unclear as to what the direction of the change is on net.</p>", "parentCommentId": null, "user": {"username": "Mo Nastri"}}, {"_id": "j8So2HCWQHoHarx34", "postedAt": "2022-09-26T09:24:46.983Z", "postId": "HytJXbmxGtF7guqnJ", "htmlBody": "<p>Thanks for the comment. I don't think that these recommendations would significantly change GW's funding allocation to be honest, they just lead to more accurate estimates of what will still be a very cost-effective program.</p><p>My caveat is, I think there is a larger potential decrease in cost-effectiveness from the second point on burden of malaria. It's unsatisfactory I think that the estimates in several of these smaller countries are significantly different. It's possible that the cost-effectiveness of SMC in some of these geographies could be quite a bit lower than Givewell estimates, simply because there is less malaria in those countries than previously thought.&nbsp;</p><p>One of the problems I would have liked to have gotten into - is that other febrile diseases are often misdiagnosed as malaria (or no diagnosis is performed other than just assuming fever = malaria).&nbsp;</p><p>My hypothesis going into this analysis was that I might be able to investigate this further, and perhaps show that some of the disease burden is not malaria. But I haven't really turned up many good resources on this.&nbsp;</p><p>Given that Givewell have a lot more resources than just me &amp; malaria is a big part of their programming, I think best way forwards is for them to look into the issue and try to get to the bottom of how much malaria is really out there.</p>", "parentCommentId": "TLatLuoCCfGg8eo2A", "user": null}, {"_id": "hsiNAwFnPjgfsoT5T", "postedAt": "2022-09-26T18:07:04.784Z", "postId": "HytJXbmxGtF7guqnJ", "htmlBody": "<p>Thank you for your entry!</p>\n", "parentCommentId": null, "user": {"username": "GiveWell"}}]