[{"_id": "hsjjm79vyZze5zrkx", "postedAt": "2023-12-08T09:14:10.505Z", "postId": "J3pfg9YsHCTcupNAh", "htmlBody": "<p><strong>warning - mildly spicy take</strong></p><p>In the wake of the release, I was a bit perplexed by how much of Tech Twitter (answered by own question there) really thought this a major advance.</p><p>But in actuality a lot of the demo was, shall we say, <i>not consistently candid </i>about Gemini's capabilities (see <a href=\"https://news.ycombinator.com/item?id=38559582\">here</a> for discussion and <a href=\"https://nitter.net/parmy/status/1732811357068615969#m\">here</a> for the original).</p><p>At the moment, all Google have released is a model inferior to GPT-4 (though the multi-modality does look cool), and have dropped an I.O.U for a totally-superior-model-trust-me-bro to come out some time next year.</p><p>Previously some AI risk people confidently thought that <a href=\"https://thezvi.wordpress.com/2023/08/31/ai-27-portents-of-gemini/\">Gemini would be substantially superior to GPT-4</a>. As of this year, it's clearly not. Some EAs <a href=\"https://nitter.net/Liv_Boeree/status/1732427988321419545#m\">were not sceptical enough</a> of a for-profit company hosting a product announcement dressed up as a technical demo and report.</p><p>There have been a couple of other cases of this overhype recently, notably 'AGI has been achieved internally' and 'What did Ilya see?!!?!?' where people jumped to assuming a massive jump in capability on the back on very little evidence, but in actuality there hasn't been. That should set off warning flags about 'epistemics' tbh.</p><p>On the 'Benchmarks' - I think most 'Benchmarks' that large LLMs use, while the contain some signal, are mostly noisy due to the significant issue of data contamination (papers like <a href=\"https://arxiv.org/pdf/2309.12288.pdf\"><i>The Reversal Curse</i></a><i> </i>indicate this imo), and that since LLMs don't think as humans do we shouldn't be testing them in similar ways. Here are two recent papers - one from Melanie Mitchell, <a href=\"https://arxiv.org/pdf/2311.09247.pdf\">one about LLMs failing to abstract and generalise</a>, and another by Jones &amp; Bergen<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnref9ufy3qrueim\"><sup><a href=\"#fn9ufy3qrueim\">[1]</a></sup></span>&nbsp;from UC San Diego actually <a href=\"https://arxiv.org/pdf/2310.20216.pdf\">empirically performing the Turing Test with LLMs</a> (<i>the results will shock you</i>)</p><p>I think this announcement should make people think near term AGI, and thus AIXR, is less likely. To me this is what a relatively continuous takeoff world looks like, if there's a take off at all. If Google had announced and proved a massive leap forward, then people would have shrunk their timelines even further. So why, given this was a PR-fueled disappointment, should we not update in the opposite direction?</p><p>Finally, to get on my favourite soapbox, dunking on the Metaculus <a href=\"https://www.metaculus.com/questions/3479/date-weakly-general-ai-is-publicly-known/\">'Weakly General AGI' forecast</a>:</p><ul><li>13% of the community prediction is already in the past (x &lt; Dec 2023). Lol, lmao.</li><li>Also judging by Cumulative Probability:<ul><li>~20% likely in 2024 (<i>really??!?!?!? if only this was real that'd be free money for sceptics)</i></li><li>~16% likely in 2025</li><li>Median Date March 2026</li><li>The operationalisation of points 1 and 3 to my mind make this nearly ~0-1% in that time frame<ul><li>Number 1 is an <i>adversarial Turing Test. </i>LLMs, especially with RLHF, are like the worst possible systems at this. I'm not even in kidding, in the paper I linked above sometimes ELIZA does better</li><li>Number 3 requires SAT tests (or, i guess, tests with overlapping Questions and Answers) not be in the training data. The current paradigm relies on scooping up everything, and I don't know how much fidelity the model makers have in filtering data out. Also, it's unlikely they'd ever show you the data they trained on as these models aren't proprietary. So there's know way of knowing if a model can meet point 3!</li><li>1 &amp; 3 makes me think a lot of AGI forecasts are from vibes and not looking at the question operationalisations and the technical performance of models</li></ul></li></ul></li></ul><p><strong>tl;dr - </strong>Gemini release is disappointing. Below many people's expectations of its performance. Should downgrade future expectations. Near term AGI takeoff v unlikely. Update downwards on AI risk (YMMV).</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fn9ufy3qrueim\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnref9ufy3qrueim\">^</a></strong></sup></span><div class=\"footnote-content\"><p>I originally thought this was a paper by Mitchell, this was a quick system-1 take that was incorrect, and I apologise to Jones and Bergen.&nbsp;</p></div></li></ol>", "parentCommentId": null, "user": {"username": "JWS"}}, {"_id": "vTKcnYXXqNhFweRRB", "postedAt": "2023-12-10T00:18:12.529Z", "postId": "J3pfg9YsHCTcupNAh", "htmlBody": "<blockquote><p>Finally, to get on my favourite soapbox, dunking on the Metaculus <a href=\"https://www.metaculus.com/questions/3479/date-weakly-general-ai-is-publicly-known/\">'Weakly General AGI' forecast</a>:</p></blockquote><p>I think the forecast seems broadly reasonable, but the question and title seem quite poor. As in, the operationalization seems like a very poor definition for \"weakly general AGI\" and the tasks being forecast don't seem very important or interesting.<br><br>I think GPT-4V likely already achieves 2 (winograd) and 3 (SAT) while 4 (montezuma's revenge) seems plausible for GPT-4V, though unclear. Beyond this, 1 (turing test) seems to be extremely dependent on the extent to which the judge is competently adversarial and whether or not anyone actually finetunes a powerful model to perform well on this task. This makes me think that this could plausibly resolve without any more powerful models, but might not happen because no one bothers running a turing test seriously.</p><blockquote><ul><li>Number 3 requires SAT tests (or, i guess, tests with overlapping Questions and Answers) not be in the training data. The current paradigm relies on scooping up everything, and I don't know how much fidelity the model makers have in filtering data out. Also, it's unlikely they'd ever show you the data they trained on as these models aren't proprietary. So there's know way of knowing if a model can meet point 3!</li></ul></blockquote><p>Can't we just use an SAT test created after the data cutoff? Also, my guess is that the SAT results discussed in the GPT-4 blog post (which are &gt;75th percentile) aren't particularly data contaminated (aside from the fact that different SAT exams are quite similar which is the same for human students). You can see the technical report for more discussion on data contamination (though account for bias accordingly etc.)</p>", "parentCommentId": "hsjjm79vyZze5zrkx", "user": {"username": "Ryan Greenblatt"}}, {"_id": "ooreHHgyXardaKZvd", "postedAt": "2023-12-10T00:28:18.958Z", "postId": "J3pfg9YsHCTcupNAh", "htmlBody": "<blockquote><p>Previously some AI risk people confidently thought that <a href=\"https://thezvi.wordpress.com/2023/08/31/ai-27-portents-of-gemini/\">Gemini would be substantially superior to GPT-4</a>.</p></blockquote><p><s>I think this slightly misrepresents the corresponding article and the state of the forecasts. The quote from the linked article is:</s></p><blockquote><p>By all reports, and as one would expect, Google’s Gemini looks to be substantially superior to GPT-4. We now have more details on that, and also word that Google plans to deploy it in December, <a href=\"https://manifold.markets/RH/will-googles-gemini-llm-be-released\">Manifold gives it 82% to happen this year</a> and similar probability of being superior to GPT-4 on release.</p></blockquote><p><s>This doesn't seem to exhibit that much confidence in \"gemini being substantially superior\"? I expect that if Zvi gave specific probabilites, they would be pretty reasonable.</s><br><br>ETA: I retract my claim about Zvi, on further examination, he seems pretty wrong here. That said, manifold doesn't seem to have done too badly.</p><p>Further, manifold doesn't seem that wrong here on GPT4 vs gemini? See for instance, this market:&nbsp;</p><figure class=\"media\"><div data-oembed-url=\"https://manifold.markets/YoavTzfati/will-gemini-be-widely-considered-be\">\n\t\t\t\t<div class=\"manifold-preview\">\n\t\t\t\t\t<iframe src=\"https://manifold.markets/embed/YoavTzfati/will-gemini-be-widely-considered-be\">\n\t\t\t\t</iframe></div>\n\t\t\t</div></figure><p>The forecast has updated from 80% to about 60%, which doesn't seem like much of an update.<br><br>I agree that we should update down on google competence and near term AGI, but it just doesn't seem like that big of an update yet?</p>", "parentCommentId": "hsjjm79vyZze5zrkx", "user": {"username": "Ryan Greenblatt"}}, {"_id": "2xukeNq9NcFQv76oA", "postedAt": "2023-12-10T00:30:24.953Z", "postId": "J3pfg9YsHCTcupNAh", "htmlBody": "<p>[Unimportant]</p><blockquote><p>here are two recent papers from Melanie Mitchell, [...] and another actually <a href=\"https://arxiv.org/pdf/2310.20216.pdf\">empirically performing the Turing Test with LLMs</a> (<i>the results will shock you</i>)&nbsp;</p></blockquote><p>This doesn't seem to be by Melanie Mitchell FYI. At least she isn't an author.</p>", "parentCommentId": "hsjjm79vyZze5zrkx", "user": {"username": "Ryan Greenblatt"}}, {"_id": "ERNGcArYfcCbozT9h", "postedAt": "2023-12-10T00:34:36.359Z", "postId": "J3pfg9YsHCTcupNAh", "htmlBody": "<blockquote><p>I think this announcement should make people think near term AGI, and thus AIXR, is less likely. To me this is what a relatively continuous takeoff world looks like, if there's a take off at all. If Google had announced and proved a massive leap forward, then people would have shrunk their timelines even further. So why, given this was a PR-fueled disappointment, should we not update in the opposite direction?</p><p>[...]<br>Gemini release is disappointing. Below many people's expectations of its performance. Should downgrade future expectations. Near term AGI takeoff v unlikely. Update downwards on AI risk (YMMV).</p></blockquote><p>I think the update here should be pretty small. I'm unsure if you disagree. I would also think the update should be pretty small if gemini is notably better than GPT4, but not wildly better. It seems plausible to me that people would (incorrectly) have a large update toward shorter timelines if gemini was merely substantially better than GPT4, but we don't have to make the same mistake in the other direction.<br><br>It's worth noting there is some asymmetry in the likely updates with a high probability of a mild negative update on near term AI and a low probability of a large positive update toward powerful near term AI. E.g., even if google were to explode and never release a better LLM than gemini, this would be a relatively smaller update than if they were to release transformatively powerful AI.</p>", "parentCommentId": "hsjjm79vyZze5zrkx", "user": {"username": "Ryan Greenblatt"}}, {"_id": "mdn2XGqufEkEycsGL", "postedAt": "2023-12-10T20:21:33.940Z", "postId": "J3pfg9YsHCTcupNAh", "htmlBody": "<p>Hey Ryan, thanks for your engagement :) I'm going to respond to your replies in one go if that's ok</p><p><strong>#1:</strong></p><blockquote><p>It's worth noting there is some asymmetry in the likely updates with a high probability of a mild negative update on near term AI and a low probability of a large positive update toward powerful near term AI.</p></blockquote><p>This is a good point. I think my argument would point to larger updates for people who put susbtantial probability on near term AGI in 2024 (or even 2023)! Where do they shift that probability in their forecast? I think just dropping it uniformly over their current probability would be suspect to me. So maybe it'd wouldn't be a large update for somebody already unsure what to expect from AI development, but I think it should probably be a large update for the ~20% expecting 'weak AGI' in 2024 (more in response #3)</p><p><strong>#2:</strong></p><blockquote><p>Further, manifold doesn't seem that wrong here on GPT4 vs gemini? See for instance, this market:&nbsp;</p></blockquote><p>Yeah I suppose ~80%-&gt;~60% is a decent update, thanks for showing me the link! My issue here would be the resolution criteria realy seems to be CoT on GSM8K, which is almost orthogonal to 'better' imho, especially given issues accounting for <a href=\"https://nitter.net/suchenzang/status/1701615026648605095\">dataset contamination</a> - though I suppose the market is technically about wider perception rather than technical accuracy. I think I was basing a lot of my take on the response on Tech Twitter which is obviously unrepresentative, and prone to hype. But there were a lot of people I generally regard as smart and switched-on who really over-reacted in my opinion. Perhaps the median community/AI-Safety researcher response was more measured.</p><p><strong>#3:</strong></p><blockquote><p>As in, the operationalization seems like a very poor definition for \"weakly general AGI\" and the tasks being forecast don't seem very important or interesting.</p></blockquote><p>I'm sympathetic to this, but Metaculus questions are generally meant to be resolved according a strict and unambiguous criteria afaik. So if someone thinks that weakly general AGI is near, but that it wouldn't do well at the criteria in the question, then they should have longer timelines than the current community response to that question imho. The fact that this isn't the case to me indicates that many people who made a forecast on this market aren't paying attention to the details of the resolution and how LLMs are trained and their strengths/limitations in practice. (Of course, if these predictors think that weak AGI will happen from a non-LLM paradigm then fine, but then i'd expect the forecasting community to react less to LLM releases)</p><p>I think where I absolutely agree with you is that we need different criteria to actually track the capabilities and properties of general AI systems that we're concerned about! The current benchmarks available seem to have many flaws and don't really work to distinguish interesting capabilities in the trained-on-everything era of LLMs. I think funding, supporting, and popularising research into what 'good' benchmarks would be and creating a new test would be high impact work for the AI field - I'd love to see orgs look into this!</p><p>B</p><blockquote><p>Can't we just use an SAT test created after the data cutoff?...You can see the technical report for more discussion on data contamination (though account for bias accordingly etc.)</p></blockquote><p>For the Metaculus question? I'd be very upset if I had a longer-timeline prediction that failed because this resolution got changed - it says 'less than 10 SAT exams' in the training data in black and white! The fact that these systems need such masses of data to do well is a sign against their generality to me.</p><p>I don't doubt that the Gemini team is aware of issues of data contamination (they even say so at the end of page 7 in the technical report), but I've become very sceptical about the state of public science on Frontier AI this year. I'm very much in a 'trust, but verify' mode and the technical report is to me more of a fancy press-release that accompanied the marketing than an honest technical report. (which is not to doubt the integrity of the Gemini research and dev team, just to say that I think they're losing the internal tug-of-war with Google marketing &amp; strategy)</p><p><strong>#4:</strong></p><blockquote><p>This doesn't seem to be by Melanie Mitchell FYI. At least she isn't an author.</p></blockquote><p>Ah good spot. I think I saw Melanie share it on twitter, and assumed she was sharing some new research of hers (I pulled together the references fairly quickly). I still think the results stand but I appreciate the correction and have amended my post.</p><p>&lt;&gt; &nbsp; &nbsp;&lt;&gt; &nbsp; &nbsp;&lt;&gt; &nbsp; &nbsp;&lt;&gt; &nbsp; &nbsp;&lt;&gt;</p><p>I want to thank you again for the interesting and insightful questions and prompts. They definitely made me think about how to express my position slightly more clearly (at least, I hope I make more sense to you after this reponse, even if we don't agree on everything) :)</p>", "parentCommentId": "ERNGcArYfcCbozT9h", "user": {"username": "JWS"}}, {"_id": "8jucEY2keojvCMqYv", "postedAt": "2023-12-10T21:01:57.071Z", "postId": "J3pfg9YsHCTcupNAh", "htmlBody": "<p>Thanks for the response!<br><br>A few quick responses:</p><blockquote><p>it says 'less than 10 SAT exams' in the training data in black and white</p></blockquote><p>Good to know! That certainly changes my view of whether or not this will happen soon, but also makes me think the resolution criteria is poor.</p><blockquote><p>I think funding, supporting, and popularising research into what 'good' benchmarks would be and creating a new test would be high impact work for the AI field - I'd love to see orgs look into this!</p></blockquote><p>You might be interested in the recent <a href=\"https://forum.effectivealtruism.org/posts/bBuE78yQPfahfWgs9/open-phil-releases-rfps-for-llm-benchmarks-and-forecasting\">OpenPhil RFP on benchmarks and forecasting</a>.</p><blockquote><p>Perhaps the median community/AI-Safety researcher response was more measured.</p></blockquote><p>People around me seemed to have a reasonably measured response.<br><br>I think we'll probably get a pretty big update about the power of LLM scaling in the next 1-2 years with the release of GPT5. Like, in the same way that each of GPT3 and GPT4 were quite informative even for the relatively savvy.&nbsp;</p><figure class=\"media\"><div data-oembed-url=\"https://manifold.markets/VictorLJZ/will-gpt5-be-released-before-2025\">\n\t\t\t\t<div class=\"manifold-preview\">\n\t\t\t\t\t<iframe src=\"https://manifold.markets/embed/VictorLJZ/will-gpt5-be-released-before-2025\">\n\t\t\t\t</iframe></div>\n\t\t\t</div></figure>", "parentCommentId": "mdn2XGqufEkEycsGL", "user": {"username": "Ryan Greenblatt"}}]