[{"_id": "K9sZZy4skZfcsXv7L", "postedAt": "2022-12-21T07:53:33.992Z", "postId": "J6Mp9tyBkbFrXHYnu", "htmlBody": "<p>Thank you for this article, I thoroughly enjoyed reading and thought it was really illuminating!&nbsp;</p><p>The &nbsp;essentialization of chinese people and the chinese state seem to me to be particularly harmful and dominating a lot of the popular discussion and analysis on China. It doesn't help that the there is a large language and cultural barrier to interaction with chinese people, and that the chinese state is quite opaque in the way it organizes and acts. If you could recommend any additional literature or news sources of good and accessible China scholars in English, I'd be very grateful.</p><p><br>&gt; “I’ve spent so much time learning about China that my grounding in methods and methodology is not in any way as solid as if I had studied anthropology and then taken on an interest in China. And it is … because the language is difficult, and because there is so much that we as China scholars need to know about China. So it’s actually a huge field. So it’s difficult to do both.”</p><p>This seems to be a sad but common issue in a lot of fields: Those who are supposed to be good friends don't really appreciate each other, because they compete for the same sources of funding and often come to different, even opposing, results in their research. &nbsp;Here in Germany for example the quant. sociologists founded their own organization a while ago because they felt marginalized by the qual. research-oriented majority. &nbsp;</p><p>In the particular case of China studies, the case for collaboration seems to be quite obvious: If researchers with methodological expertise collaborate with those with cultural and language expertise, the complexity and quality of the research should increase&nbsp;</p>", "parentCommentId": null, "user": {"username": "Anton Wille"}}, {"_id": "LhfwmqTgtWQ54h8oy", "postedAt": "2022-12-21T13:55:29.763Z", "postId": "J6Mp9tyBkbFrXHYnu", "htmlBody": "<p>Hi Anton, glad to hear that you found this post valuable!<br><br>On your first question, I think could check out the <a href=\"https://podcasts.apple.com/us/podcast/sinica-podcast/id1121407665\">Sinica Podcast</a>. I believe it is one of the sources on China that is quite accessible, but still tries really hard to go below the surface of issues they cover. &nbsp;Of course just my personal recommendation.</p>", "parentCommentId": "K9sZZy4skZfcsXv7L", "user": {"username": "gabriel_wagner"}}, {"_id": "DAKZ6oQPBmoeaAd3B", "postedAt": "2022-12-21T13:55:47.126Z", "postId": "J6Mp9tyBkbFrXHYnu", "htmlBody": "<p>Interesting also the second point you bring up on Sociology in Germany! I agree that collaborations between researchers who come with slightly different types of expertise could be super valuable.&nbsp;</p><p>Do you have any ideas how to promote it in practice though? As you say, various incentive structures are not really made for that. I also find that surprisingly often, researchers just really rather want to prove why \"their\" approach is better, rather than try to understand how another approach could help them better understand the world.&nbsp;</p><p>All this makes me feel slightly pessimistic^^ But I would be super glad to hear ideas on how to overcome these difficulties.&nbsp;</p>", "parentCommentId": "K9sZZy4skZfcsXv7L", "user": {"username": "gabriel_wagner"}}]