[{"_id": "GKxePxtxLYwdAiH6v", "postedAt": "2022-12-09T23:52:45.877Z", "postId": "J7gdciCXFgqyimAAe", "htmlBody": "<p>CLR (and previously FRI) regularly came out at the top of my prioritized list of charities to donate to when I was in ETG, and I wish I still had a sizable donation budget to invest today!</p>", "parentCommentId": null, "user": {"username": "Telofy"}}, {"_id": "JsfJhqdw6WzuTrhqo", "postedAt": "2022-12-09T23:57:08.037Z", "postId": "J7gdciCXFgqyimAAe", "htmlBody": "<p>You can publish an impact certificate for some article that CLR owns (think copyright) on <a href=\"https://app.impactmarkets.io/\">app.impactmarkets.io</a> and hope for investments. Maybe you’ll have a big donor again in the future who’ll profitably reward all of today’s supporters for pitching in when they couldn’t.</p>", "parentCommentId": "GKxePxtxLYwdAiH6v", "user": {"username": "Telofy"}}, {"_id": "vxK3adYkgATgkDKnz", "postedAt": "2022-12-13T04:07:46.433Z", "postId": "J7gdciCXFgqyimAAe", "htmlBody": "<p>How \"hingey\" is it to donate? I mean, if I donate $1000 and it turns out that CLR didn't raise enough money to meet one of your fundraising goals, will my donation have been for nothing?</p>", "parentCommentId": null, "user": {"username": "evelynciara"}}, {"_id": "KNP5FRwnwZGjG2uKS", "postedAt": "2022-12-13T13:37:26.589Z", "postId": "J7gdciCXFgqyimAAe", "htmlBody": "<p>I'm not sure I understand your question correctly, so please respond if I didn't get it.</p><p>You ask: Could your donation be for nothing if we don't meet our fundraising goals. I don't think this is the case. If we don't even meet our minimal goal, we will possibly have to downsize or do so sooner than otherwise. Your donation would still help in those cases. The only scenario I see where your donation \"would have been for nothing\" is short-term insolvency. This is very unlikely.</p><p>Even if there were some scenarios in which your donation \"will have been for nothing\" in hindsight, I am not sure this is the right way to think about it. Your donation would still have made a difference ex-ante in expectation.&nbsp;</p><p>To answer your broader question about \"hingey\"-ness: I think at the moment is a particularly good and important time to donate CLR compared to the past and also likely compared to the future. That would make this time particularly \"hingey\".</p>", "parentCommentId": "vxK3adYkgATgkDKnz", "user": {"username": "storges"}}]