[{"_id": "iKYJzjBQWdbXMtWCx", "postedAt": "2023-09-01T00:19:49.402Z", "postId": "J7nmbqcWncPMZFhGC", "htmlBody": "<p>Suggestion for how people go about developing this expertise from ~scratch, in a way that should be pretty adaptable to e.g. the context of an undergraduate or grad-level course, or independent research (a much better/stronger version of things I've done in the past, which involved lots of talking and take-developing but not a lot of detail and publication, which I think are both really important):</p><ol><li>Figure out who, both within the EA world and not, would know at least a fair amount about this topic -- maybe they just would be able to explain why it's useful in more context than you have, maybe they know what papers you should read or acronyms you should familiarize yourself with -- and talk to them, roughly in increasing order of scariness/value of their time, such that you've at least had a few conversations by the time you're talking to the scariest/highest-time-value people. Maybe this is like a list of 5-10 people?</li><li>During these conversations, take note of what's confusing you, ideas that you have, connections you or your interlocutors draw between topics, takes you find yourself repeating, etc.; you're on the hunt for a first project.</li><li>Use the \"<a href=\"https://www.cold-takes.com/learning-by-writing/\">learning by writing</a>\" method and just try to write \"what you think should happen\" in this area, as in, a specific person (maybe a government agency, maybe a funder in EA) should take a specific action, with as much detail as you can, noting a bunch of ways it could go wrong and how you propose to overcome these obstacles.</li><li>Treat this proposal as a hypothesis that you then test (meaning, you have some sense of what could convince you it's wrong), and you seek out tests for it, e.g. talking to more experts about it (or asking them to read your draft and give feedback), finding academic or non-academic literature that bears on the important cruxes, etc., and revise your proposal (including scrapping it) as implied by the evidence.</li><li>Try to publish something from this exercise -- maybe it's the proposal, maybe it's \"hey, it turns out lots of proposals in this domain hinge on this empirical question,\" maybe it's \"here's why I now think [topic] is a dead end.\" This gathers more feedback and importantly circulates the information that you've thought about it a nonzero amount.</li></ol><p>Curious what other approaches people recommend!</p>", "parentCommentId": null, "user": {"username": "levin"}}, {"_id": "bDj8uh46DdSMtYYBM", "postedAt": "2023-09-01T00:28:54.122Z", "postId": "J7nmbqcWncPMZFhGC", "htmlBody": "<p>So of course developing expertise in something important is better than \"ending up in a never-ending strategy spiral.\" But I largely disagree about your focus on established, specific, boring, prosaic questions. The relevant way I can impact governance by discovering something good, telling EAs, and thus causing EAs to use their influence to make it happen. And I think I can do that much better by starting at questions like \"if AI goes well, what happened\" and \"what intermediate goals improve AI safety\" and \"what should labs do\" than the kind of topics on your list.</p>", "parentCommentId": null, "user": {"username": "zsp"}}, {"_id": "GeyWfosWtJCRTAqbP", "postedAt": "2023-09-01T01:39:09.755Z", "postId": "J7nmbqcWncPMZFhGC", "htmlBody": "<p>Man, the topics you mention feel <i>too</i> boring (i.e. too far removed from the important questions). Quoting from Richard Ngo's <a href=\"https://www.alignmentforum.org/posts/ho63vCb2MNFijinzY/agi-safety-career-advice#List_of_governance_topics\">AGI safety career advice</a> for another flavor of question:</p><blockquote><p>Here are some topics where I wish we had a world expert on applying it to AGI safety. . . . :</p><ol><li>What regulatory apparatus within the US government would be most effective at regulating large training runs?</li><li>What tools and methods does the US government have for auditing tech companies?</li><li>What are the biggest gaps in the US export controls to China, and how might they be closed?</li><li>What AI applications or demonstrations will society react to most strongly?</li><li>What interfaces will humans use to interact with AIs in the future?</li><li>How will AI most likely be deployed for sensitive tasks (e.g. advising world leaders) given concerns about privacy?</li><li>How might political discourse around AI polarize, and what could mitigate that?</li><li>What would it take to automate crucial infrastructure (factories, weapons, etc)?</li></ol></blockquote><p>(I know you weren't just writing about AI safety. Even given that, these questions are substantially more <i>relevant to stuff that matters</i> than yours, and I think that's good.)</p>", "parentCommentId": null, "user": {"username": "zsp"}}, {"_id": "gBNqqH76RRFLP4yq7", "postedAt": "2023-09-01T04:27:08.593Z", "postId": "J7nmbqcWncPMZFhGC", "htmlBody": "<p>I think I strongly agree with this post on becoming specific, having observed how the fossil fuels vs renewables \"fight\" is playing out. Perhaps it is not directly relevant to bio, but the climate action takes place in obscure places, often at state level in the US where the fossil fuel lobby <a href=\"https://thelensnola.org/2018/05/04/actors-were-paid-to-support-entergys-power-plant-at-new-orleans-city-council-meetings/\">hired actors</a> to influence some local politics (not recommended!) and how very important decision are made in <a href=\"https://naacp.org/resources/engaging-public-utilities-and-public-service-commissions\">esoteric hearings</a> of unknown government entities. I am not saying bio will play out similarly, but that it is important to find these arenas/levers within the large and complex government landscape, build alliances and engage on specific points in the bureaucracy.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Ulrik Horn"}}, {"_id": "WuKqEgciCgKdu3LuW", "postedAt": "2023-09-01T09:28:35.857Z", "postId": "J7nmbqcWncPMZFhGC", "htmlBody": "<p>1-3 seem good for generating more research questions like ASB's, but the narrower research questions are ultimately necessary to get to impact. 4-8 seem like things EA is over-invested in relative to what ASB lays out here, not that more couldn't be done there.&nbsp;</p>", "parentCommentId": "GeyWfosWtJCRTAqbP", "user": {"username": "Mjreard"}}, {"_id": "oMdAhdoEHKEjeN8Hx", "postedAt": "2023-09-01T09:58:40.224Z", "postId": "J7nmbqcWncPMZFhGC", "htmlBody": "<p>Speaking just to the little slice of the world I know:</p><p>Using a legal research platform (i.e. Westlaw, LexisNexis, Casetext) could be really helpful with several of these. If you're good at thinking up search terms and analogous products/actors/circumstances (3D firearms, banned substances, and squatting on patents are good examples here), there's basically always a case where someone wasn't happy someone else was doing X, so they hired lawyers to figure out which laws were implicated by X and file a suit/indict someone, usually on multiple different theories/laws.&nbsp;</p><p>The useful part is that courts will then write opinions on the theories which provide a clear, lay-person explanation of the law at issue, what it's for, how it works, etc. before applying it to the facts at hand. Basically, instead of you having to stare at some pretty abstract, high-level, words in a statute/rule and imagine how they apply, a lot of that work has already been done for you, and in an authoritative, citable way. Because cases rely on real facts and circumstances, they also make things more concrete for further analogy-making to the thing you care about.&nbsp;</p><p>Downside is these tools seem to cost at least ~$150/mo, but you may be able to get free access through a university or find other ways to reduce this. Google Scholar case law is free, but pretty bad.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Mjreard"}}, {"_id": "K2YoLdE6yrup476cQ", "postedAt": "2023-09-01T15:01:31.549Z", "postId": "J7nmbqcWncPMZFhGC", "htmlBody": "<p>Honestly, my biggest recommendation would be just getting a job in policy! You'll get to see what \"everyone knows\", where the gaps are, and you'll have access to a lot more experts and information to help you upskill faster if you're motivated.</p>\n<p>You might not be able to get a job on the topic you think is most impactful but any related job will give you access to better information to learn faster, and make it easier to get your next, even-more-relevant policy job.</p>\n<p>In my experience getting a policy job is relatively uncorrelated with knowing a lot about a specific topic  so I think people should aim for this early. You can also see if you actually LIKE policy jobs and are good at them before you spend too much time!</p>\n", "parentCommentId": "iKYJzjBQWdbXMtWCx", "user": {"username": "Khorton"}}, {"_id": "5DfbYeRpLTkCPcHrB", "postedAt": "2023-09-01T15:42:49.726Z", "postId": "J7nmbqcWncPMZFhGC", "htmlBody": "<p>A Biosecurity area I'd add to the list is regulation and policy around contact tracing apps.</p>\n<p>Example questions:</p>\n<ol>\n<li>How come Google and Apple got to dictate the privacy constraints rather than democratic governments?</li>\n<li>What policies could boost uptake if the apps?</li>\n<li>Why didn't politicians make the tracing legally enforceable, unlike traditional contact tracing (this was the case in the UK, I'm not sure the international situation)?</li>\n</ol>\n", "parentCommentId": null, "user": {"username": "jooke"}}, {"_id": "kWQGvrbhe7iPdt8uK", "postedAt": "2023-09-01T19:00:42.772Z", "postId": "J7nmbqcWncPMZFhGC", "htmlBody": "<p>Thanks for writing this!</p>\n<ul>\n<li>\n<p>Another way to think about it: it's much more likely that a boring thing is neglected than something that sounds sexy.</p>\n</li>\n<li>\n<p>A potential meta-skill I've been somewhat successful at building is to approach these superficially bland topics like a photographer: [If it's boring, you're not close enough.] (<a href=\"https://www.theartnewspaper.com/2021/07/29/if-your-pictures-arent-good-enough-youre-not-close-enough-vintage-prints-by-war-photographer-robert-capa-to-headline-photo-london\">https://www.theartnewspaper.com/2021/07/29/if-your-pictures-arent-good-enough-youre-not-close-enough-vintage-prints-by-war-photographer-robert-capa-to-headline-photo-london</a>) For example, you can challenge yourself to give a 5 minute lightning talk that gets others excited after 1h of research on such a topic!</p>\n</li>\n<li>\n<p>I was also really surprised how easy it was to get experts on product certification (CE testing) and standardisation on the phone. They don't seem used to talking to an overly enthusiastic person in their twenties and have been insanely helpful.</p>\n</li>\n</ul>\n", "parentCommentId": null, "user": {"username": "nadia_mir-montazeri"}}, {"_id": "6gobhJvQ2EAi2Hzo8", "postedAt": "2023-09-01T19:37:49.773Z", "postId": "J7nmbqcWncPMZFhGC", "htmlBody": "<p>I might be able to help on this one — I did some of the early work on Exposure Notification tech and was somewhat involved with discussions between Apple/Google/a few governments. &nbsp;</p><p>We partially answer some of your questions here: <a href=\"https://arxiv.org/abs/2306.00873\"><u>https://arxiv.org/abs/2306.00873</u></a>. I'm also happy to try to answer any related questions (some parts are closer to informed guesses and didn't make it into the academic paper).</p>", "parentCommentId": "5DfbYeRpLTkCPcHrB", "user": {"username": "James Petrie"}}, {"_id": "bFwvXNjidjZznh8cL", "postedAt": "2023-09-01T19:55:22.417Z", "postId": "J7nmbqcWncPMZFhGC", "htmlBody": "<p>Agree, basically any policy job seems to start teaching you important stuff about institutional politics and process and the culture of the whole political system!</p><p>Though I should also add this important-seeming nuance I gathered from a pretty senior policy person who said basically: \"I don't like the mindset of, get anywhere in the government and climb the ladder and wait for your time to save the day; people should be thinking of it as proactively learning as much as possible about their corner of the government-world, and ideally sharing that information with others.\"</p>", "parentCommentId": "K2YoLdE6yrup476cQ", "user": {"username": "levin"}}, {"_id": "H5xhcyLmJyDiLSKdM", "postedAt": "2023-09-01T21:47:15.702Z", "postId": "J7nmbqcWncPMZFhGC", "htmlBody": "<p>I think I mostly disagree with this post.&nbsp;</p><p>I think Michael Webb would be an example of someone who did pretty abstract stuff (are ideas, in general, getting harder to find) at a relatively junior level (PhD student) but then because his work was impressive and rigorous became very senior in the British government and DeepMind.&nbsp;</p><p>Tamay Besiroglu's MPhil thesis on ideas getting harder to find in ML I think should be counted as strategy research by a junior person but has been important in feeding into various Epoch papers and the Davidson takeoff speeds model. &nbsp;I expect the Epoch papers and the takeoff model to be very impactful. Tamay is now deputy director of Epoch.&nbsp;</p><p>My guess is that it's easier to do bad strategy research than it is to get really good at a niche but important things, but I think it's very plausible that it's the better-expected value decision provided you can make your strategy research legibly impressive, and your strategy research is good research. &nbsp;It seems plausible that doing independent strategy research one isn't aiming to be published in a journal is particularly bad since it doesn't provide good career capital, there isn't good mentorship or feedback and there's no clear path to impact. &nbsp;</p><p>I would guess that economists are unusually well-suited to strategy research because it can often be published in journals which is legibly impressive and so is good career capital, and the type of economics strategy research that one does is either empirical and so has good feedback loops, or is model-based but drawn from economic theory and so much more structured than typical theory would be. I think this latter type of research can clearly be impactful - for instance, Racing to the Precipice is a pure game theory paper but informs much of the conversation of avoiding race dynamics. Economics is also generally respected within government and economists are often hired as economists which is unusual amongst the social sciences.&nbsp;</p><p>My training is as an economist and it's plausible to me that work in political science, law, and political philosophy would also be influential but I have less knowledge of these areas.&nbsp;</p><p>I don't want to overemphasise my disagreement - I think lots of people should become experts in very specific things - but I think this post is mostly an argument against doing bad strategy research that doesn't gain career capital. I expect doing strategy research at an organization that is experienced at doing good and/or legibly impressive research e.g. in academia mostly solves this problem.&nbsp;</p><p>A final point, I think this post underrates the long-run influence of ideas on government and policy. The neoliberals of the 60s and 70s are a well-known example of this, but also Jane Jacob's influence on US urban planning, the influence of legal and literary theory on the Modern American left, and the importance of Silent Spring for the US environmental movement. Research in information economics has been important in designing healthcare systems, e.g. the mandate to buy healthcare under the ACA. The EUs cap and trade scheme is another idea that came quite directly from pretty abstract research.&nbsp;</p><p>This is a different kind of influence to proposing a specific or implementing a specific policy in government - which is a very important kind of influence - but I suspect over the long run is more important (though with weak confidence and I don't think this is especially cruxy.)</p>", "parentCommentId": null, "user": {"username": "Nathan_Barnard"}}, {"_id": "sgvycXjWA3SX6SAd3", "postedAt": "2023-09-01T23:58:29.665Z", "postId": "J7nmbqcWncPMZFhGC", "htmlBody": "<p>I think this is true if for some particular reason you are set on working outside government and want to be an external academic expert advising policymakers. I think this is what the poster’s experience has been.</p>\n<p>But if you want to optimise for impacting policy, it is much higher impact to get roles inside government and to become a policymaker yourself, which usually requires broad, generalist expertise and skills, so overall I <em>strongly</em> disagree with this recommendation, but can see how the poster’s personal experience led to them to their view.</p>\n", "parentCommentId": null, "user": {"username": "freedomandutility"}}, {"_id": "gs7WYauhAgAMyABZ9", "postedAt": "2023-09-02T05:28:12.426Z", "postId": "J7nmbqcWncPMZFhGC", "htmlBody": "<p>4 and 7 are not really questions that one can meaningfully develop expertise on. Even politicians, whose jobs depend on understanding public opinion, are worse at this than just running a poll, and depend heavily on polling to assess public opinion when they have the money to run adequate polls. They do bring a useful amount of additional judgment to that process and can give you a sense of when a poll result is likely to not hold up in an adversarial environment, but I don't think you can develop an equivalent skill without actually spending a lot of time talking to the public. I also don't think that would allow you to do much prediction of where public opinion is headed. Hillary Clinton would probably have been elected President in 2008 if she had been able to predict how Dem primary voters' opinions on her Iraq vote would change, and she never lacked access to world-class experts at the time she was making her decision.&nbsp;</p><p>&nbsp;</p><p>You could spend 30k to run a poll and get a better sense of current public sentiment and specific ways opinions can be pushed given information currently available. A world-expert level pollster could perhaps help you write better questions, and you could review the history of pubic opinion on topics you find to be analogous. I think with all that you'd outperform most unelected policymakers in understanding current public opinion, but only because their condescension toward the average person makes them especially bad at it (see, e.g. their obvious bungling of covid). I'd be extremely skeptical that you'd do any better at predicting what shifts public and elite opinion better than an average swing-district member of Congress who took 10 min to review your poll.</p>", "parentCommentId": "GeyWfosWtJCRTAqbP", "user": {"username": "Bluefalcon"}}, {"_id": "ANm6hpANsbxKfyNGK", "postedAt": "2023-09-02T05:32:53.099Z", "postId": "J7nmbqcWncPMZFhGC", "htmlBody": "<p>Mostly disagree. \"What AI applications or demonstrations will society react to most strongly?\" depends a lot on what AI applications will be powerful in the future, not just what people say in polls today.</p><p>And polls today leave lots of uncertainty about \"How might political discourse around AI polarize\"-- that depends not just on <i>what people say in polls today</i> but also <i>what the future of AI looks like</i> and especially <i>how polarization works</i>.</p>", "parentCommentId": "gs7WYauhAgAMyABZ9", "user": {"username": "zsp"}}, {"_id": "jNqGKZ5ZaybhbgGGF", "postedAt": "2023-09-02T06:48:20.229Z", "postId": "J7nmbqcWncPMZFhGC", "htmlBody": "<p>Thanks! I don't have any particular insights or questions (I'm on the tech side of things), just that: I think these apps are really promising, we need better (lower cost and less blunt) tools for dealing with outbreaks, and the biggest issues seem to be on the regulatory/acceptability/political/etc side rather than technical. I will have a look at your paper though, thank you for the link.</p>\n", "parentCommentId": "6gobhJvQ2EAi2Hzo8", "user": {"username": "jooke"}}, {"_id": "SXeNQhb53eK3WLtBf", "postedAt": "2023-09-02T14:52:08.706Z", "postId": "J7nmbqcWncPMZFhGC", "htmlBody": "<p>Commenting to try to figure out where you disagree with the original poster, and what your cruxes are.<br><br>It sounds like you're saying:<br>1) Conditional on being able to do legibly impressive and good strategy research, it's more valuable for junior people to do strategy research than to become an expert in a specific boring topic<br>2) Nonetheless, many people should become experts in specific boring topics<br>3) Over the long run, ideas influence the government more than the OP suggests they do (and probably more than the proposal/implementation of specific policies do)<br><br>Does that sound right to you?<br><br>I think there's (at least) two ways to read the original post: either as a claim about the total comparative utility of boring/specific expertise vs. strategy work, or as a claim about the marginal utility of boring/specific expertise vs. strategy work.&nbsp;<br>For example:<br>A) As a general rule, if you're a junior person who wants to get into policy, becoming an expert on a specific boring topic is more useful than attempting strategy work (\"Instead, people that want to make the world safer with policy/governance should become experts on very specific and boring topics\")<br>B) On the margin, a junior person having expertise on a specific boring topic is more useful than a junior person doing strategic work (\"I’d be more excited about somebody pursuing one of these concrete, specific dead ends and getting real feedback from the world (and then pivoting<a href=\"https://forum.effectivealtruism.org/posts/J7nmbqcWncPMZFhGC/want-to-make-a-difference-on-policy-and-governance-become-an#fnsplobups5fc\"><sup>[2]</sup></a>), rather than trying to do broad strategy work and risk ending up in a never-ending strategy spiral\")<br><br>It wasn't clear to me whether you agree with 1), 2), both, or neither. Agreeing with A is compatible with accepting 1-3 (e.g. maybe most junior people can't do legibly impressive and good strategy work), as is disagreeing with A and agreeing with B (e.g. maybe junior people likely can do legibly impressive and good strategy work, but the neglectedness of boring/specific expertise means that its marginal utility is higher than of strategy work). Where'd you stand on A and B, and why? And do you think it's the case that many junior people could do legibly impressive and good strategy research?<br><br>(I'm sorry if this comment sounds spiky - it wasn't meant to be! I'm interested in the topic and trying to get better models of where people disagree and why :) )<br>&nbsp;</p>", "parentCommentId": "H5xhcyLmJyDiLSKdM", "user": null}, {"_id": "aijx8iRg8qWjtFagr", "postedAt": "2023-09-03T10:34:01.486Z", "postId": "J7nmbqcWncPMZFhGC", "htmlBody": "<p>Terrible advice. I did that, became a Superforecaster. Checked a bazillion boring facts. Came to the conclusion of a 1% AI X-Risk in the XPT tournament, together with many of my thoughtful peers.&nbsp;</p><p>Then our (repeated, active) attempts to actively engage and foster a dialog with the \"AI experts\" in the tournament went to nowhere. There was disagreement at the end of the tournament. All the pundits, once results went up, said surely this can't possibly be. Pundits also missed that in areas where we did engage in productive reasoning with actual experts during the tournament (cough cough nuclear X-risk) there was a lot of agreement in the end.</p><p>Motivated reasoning beats boring each time. Become a pompous self promoter, please! EA needs more egomaniacs!</p>", "parentCommentId": null, "user": {"username": "mudiku"}}, {"_id": "r5pLSfDCxMNBWn9Xy", "postedAt": "2023-09-03T12:18:04.938Z", "postId": "J7nmbqcWncPMZFhGC", "htmlBody": "<p>I mostly agree. Though having worked in research, policy and now policy analysis, it's also the case that sectors can get stuck in established practices. Big-picture /blue sky thinking is of course also important. But I agree that the value of work to get the basics/details right is under recognised. So thumbs up for your post, except the framing of \"boring\"; one person's boring is another's wildly fascinating - who are we to judge.&nbsp;</p>", "parentCommentId": null, "user": {"username": "TomDrake"}}, {"_id": "6tFrnWBfyqQiqHZJF", "postedAt": "2023-09-03T12:26:15.846Z", "postId": "J7nmbqcWncPMZFhGC", "htmlBody": "<p>At a glance, each of these questions could easily (1 week to 6 mos) be answered by a U.S. lawyer or dedicated law student. If you have money to spend, hire someone; if not, link up with a law firm's pro bono program or a law school's security clinic.</p>\n<p>Just a quick note on \"Patent law - can companies patent dangerous technology in order to prevent others from developing or misusing it?\"  --  No. The U.S. patent tradeoff is that you make an idea public (describe it fully and accurately) in return for (max) 20 years of protection. So the patent process would publicize the dangerous tech, and then (at max, if you had good lawyers and good judges) protect the tech for 20 years -- after which anyone could use the tech you had publicized. Please don't do this.</p>\n", "parentCommentId": null, "user": {"username": "Kay Starks"}}, {"_id": "dt5z4h9aJgrhkS7oJ", "postedAt": "2023-09-04T04:52:41.115Z", "postId": "J7nmbqcWncPMZFhGC", "htmlBody": "<p>Strongly agree. Having been on both sides of the policy advocacy fence (i.e. in government and as a consultant/advocate working from the ouside), policy ideas have to be concrete. Asking the government to improve disease surveillance (as opposed to something specific like e.g. implementing threatnet) is about as useful as asking a government to improve education outcomes by improving pedagogy, or to boost the economy by raising productivity.</p>\n<p>Of course, you don't have to be an expert yourself per se, but you have to talk to those who are, and get their inputs - and beyond a certain point, if your knowledge of that specific space becomes great enough after working in it for a long time, you're practically an expert yourself.</p>\n<p>While EA is great, a lot of us have naive views of how governance works, and for that matter have overly optimistic theories of change of how abstract ideas and research affect actual policies and resource allocation, let alone welfare.</p>\n", "parentCommentId": null, "user": {"username": "Joel Tan"}}, {"_id": "C84uA8NGw6TdAEuS3", "postedAt": "2023-09-04T11:54:34.759Z", "postId": "J7nmbqcWncPMZFhGC", "htmlBody": "<p>I think I just don't have sufficiently precise models to know whether it's more valuable for people to do implementation or strategy work on the current margin.&nbsp;</p><p>I think compared to a year ago implementation work has gone up in value because there appears to be an open policy window and so we want to have shovel-ready policies we think are, all things considered, good. I think we've also got a bit more strategic clarity than we had a year or so ago thanks to the strategy writing that Holden, Ajeya and Davidson have done.&nbsp;</p><p>On the other hand, I think there's still a lot of strategic ambiguity and for lots of the most important strategy questions there's like one report with massive uncertainty that's been done. For instance, both bioanchors and Davidson's takeoff speeds report assume we could get TAI by just by scaling up compute. This seems like a pretty big assumption. We have no idea what the scaling laws for robotics are, there are constant references to race dynamics but like one non-empirical paper from 2013 that's modelled it at the firm level (although there's another coming out.) The two recent Thorstad papers to come out I think are a pretty strong challenge to longtermism not grounded in digital minds being a big deal. &nbsp;</p><p>I think people, especially junior people, should be baised towards work with good feedback loops but I think this is a different axis from strategy vs implementation. Lots of epochs work is stratagy work but also has good feedback loops. The legal priorities project and GPI both do pretty high level work but I think both are great because they're grounded in academic disciplines. Patiant philanthripy is probably the best example of really high level, purely conceptual, work that is great.&nbsp;</p><p>In AI in particualr so high level stuff that I think would be great would be: a book on what good post TAI futures look like, forcasting the growth of the Chinese economy under different political setups, scaling laws for robotics, modelling the elasticity of the semi-conductor supply chain, proposals for transfering ownership capital to the population more broadly, investigating different funding models for AI safety.&nbsp;</p>", "parentCommentId": "SXeNQhb53eK3WLtBf", "user": {"username": "Nathan_Barnard"}}, {"_id": "KYABGXhJxiWaXYvcu", "postedAt": "2023-09-05T03:32:12.781Z", "postId": "J7nmbqcWncPMZFhGC", "htmlBody": "<p>+1 on \"specialist experts are surprisingly accessible to enthusiastic youth\", cf <a href=\"https://guzey.com/follow-up/\">some relevant advice from Alexey Guzey</a></p>\n", "parentCommentId": "kWQGvrbhe7iPdt8uK", "user": {"username": "tessa"}}, {"_id": "D85xi8oYpboj7Jm4X", "postedAt": "2023-09-05T21:25:15.251Z", "postId": "J7nmbqcWncPMZFhGC", "htmlBody": "<p>ASB - thanks for sparking a fascinating discussion, and to the many comment-writers who contributed.&nbsp;</p><p>I'm left with mixed feelings about the pros and cons of developing narrow, 'boring', expertise in specific policy topics, versus more typical EA-style big-picture thinking.</p><p>The thing is, there are important and valuable roles for people who specialize in connecting these two approaches, in serving as 'middle men' between the specialist policy wonks and the EA strategists. This requires some pro-active networking, some social skills, a capacity for rapid getting-up-to-speed in new areas, a respect for subject matter experts, and an ability to understand what can help policy experts do their jobs, and advance their careers, more effectively. This intermediary role could probably benefit from a few years of immersion in the gov't/policy/think tank world -- but not such deep immersion that one soaks up all of the conventional wisdom and groupthink and unexamined assumptions that tend to characterize many policy subcultures. So, the best intermediaries may still keep one foot in the EA subculture and one foot in a very specialized policy subculture.</p><p>(I say this as someone who's spent most of his academic career trying to connect specialist knowledge in evolutionary and genetic theory to bigger-picture issues in human psychology.)</p>", "parentCommentId": null, "user": {"username": "geoffreymiller"}}, {"_id": "9qLvQy2XSix9EArkx", "postedAt": "2023-09-06T01:13:49.073Z", "postId": "J7nmbqcWncPMZFhGC", "htmlBody": "<p>Thanks, I thought these were useful comments, particularly about the longer-term influence of big ideas (neoliberalism etc).\nI would be interested in reading/skimming the Thorstad papers you refer to, where are they? I found <a href=\"https://onlinelibrary.wiley.com/doi/full/10.1111/papa.12248\">https://onlinelibrary.wiley.com/doi/full/10.1111/papa.12248</a> which is presumably one of them. Do they have EA Forum versions, and if not do you know if David planning to put them up as such? Seems potentially valuable.</p>\n", "parentCommentId": "C84uA8NGw6TdAEuS3", "user": {"username": "Oscar Delaney"}}, {"_id": "5zyxFuvkCn36KyH2W", "postedAt": "2023-09-06T13:02:34.999Z", "postId": "J7nmbqcWncPMZFhGC", "htmlBody": "<p>Add Electromagnetic Spectrum policy and regulations to the list. The world is wireless and a few experts at the ITU-R, as well as state run regulatory bodies like the USA's NTIA, decide what that wireless world will be. Become an expert in Electromagnetic Spectrum policy and regulations is a great way to change the world. (and the money isn't bad either)</p>\n", "parentCommentId": null, "user": {"username": "Thomas Kidd"}}, {"_id": "App375ThsP7K5ppfa", "postedAt": "2023-09-07T09:11:13.372Z", "postId": "J7nmbqcWncPMZFhGC", "htmlBody": "<p>I took Nathan to be referring to <a href=\"https://globalprioritiesinstitute.org/david-thorstad-three-mistakes-in-the-moral-mathematics-of-existential-risk/\">https://globalprioritiesinstitute.org/david-thorstad-three-mistakes-in-the-moral-mathematics-of-existential-risk/</a> and <a href=\"https://globalprioritiesinstitute.org/david-thorstad-high-risk-low-reward-a-challenge-to-the-astronomical-value-of-existential-risk-mitigation/\">https://globalprioritiesinstitute.org/david-thorstad-high-risk-low-reward-a-challenge-to-the-astronomical-value-of-existential-risk-mitigation/</a> -- Thorstad's blog (<a href=\"https://ineffectivealtruismblog.com/\">https://ineffectivealtruismblog.com/</a>) has some summaries/further discussion, so far as I remember.</p>", "parentCommentId": "9qLvQy2XSix9EArkx", "user": null}, {"_id": "fqMqaLxGb6vcQWjpp", "postedAt": "2023-09-07T09:50:51.828Z", "postId": "J7nmbqcWncPMZFhGC", "htmlBody": "<p>I mostly agree with this, with one addition.&nbsp;<br><br>You yourself probably know better than ASB or anyone else what are the specific boring areas in which you could become an expert that would be useful and impactful.&nbsp;<br><br>Or maybe you already are an expert in a boring area and just need to build on that.&nbsp;<br><br>For example, a chemical engineer will already have studied areas like explosion risk-management, quality control/assurance and safety. An engineer with Pharma experience might also have had extensive dealings with the FDA and their audits. To you, this might seem obvious - but you can be sure that your knowledge represents a vast, complex and yes, boring field of knowledge to someone who hasn't had your experience and learning.&nbsp;<br><br>It feels like these all provide important perspective to any discussions on AI Safety, Safety verification, etc., that probably most of the people working on this topic will not have. There are so many comments like \"we need an agency like the FDA or the IAEA\" from people who only have a superficial notion of how these agencies operate. So if you have a deep understanding, that could be valuable, impactful knowledge. In a policy discussion, it is powerful perspective if you can argue that \"this is how the FDA does it\".&nbsp;<br><br>One area where there seems to be a huge lack of expertise among the EA community is China. I don't know how many discussions I've had about AI Safety and Governance in the context of China, but almost nobody (certainly not me!) has been in the discussions providing perspective of how things actually work in China, how policies can be influenced, how corporations and government actually influence each other (i.e. who meets whom, when, where, what flexibility do they have, ...). So this could be a great area for someone who has worked in that kind of area in China, or who has a network of people in that area.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Denis "}}, {"_id": "4mDBCACLLot9Ra5pt", "postedAt": "2023-10-05T13:22:38.405Z", "postId": "J7nmbqcWncPMZFhGC", "htmlBody": "<p>Another +1 that it's surprisingly easy to get experts to talk to you. Once for a job I had to find out this super obscure thing about the Federal Reserve. Instead of spending hours trying to research it on my own (which I don't think would have gone anywhere), I found a Fed expert at a think tank. He also didn't know the answer to the question, but helped immensely in tracking an answer down. I was surprised by how much time he spent on it!</p><p>If you're becoming an expert in something neglected, chances are there won't be good public writing about it, so you should really lean on speaking with experts.</p>", "parentCommentId": "kWQGvrbhe7iPdt8uK", "user": {"username": "Masha Winchell"}}]