[{"_id": "75qBFdpbtj4LmDpZY", "postedAt": "2017-09-07T19:38:46.082Z", "postId": "J7XLAwiB47L3zjTcR", "htmlBody": "<p>Great podcasts!</p>\n", "parentCommentId": null, "user": {"username": "Tom_Davidson"}}, {"_id": "WyZZp7HnvidHSukYc", "postedAt": "2017-09-07T20:18:15.993Z", "postId": "J7XLAwiB47L3zjTcR", "htmlBody": "<p>Glad you like them! Tell your friends. ;)</p>\n", "parentCommentId": "75qBFdpbtj4LmDpZY", "user": {"username": "Robert_Wiblin"}}, {"_id": "T7DHG2LvXJFqM98cW", "postedAt": "2017-09-08T01:00:00.524Z", "postId": "J7XLAwiB47L3zjTcR", "htmlBody": "<p>The article on machine learning doesn't discuss the possibility that more people to pursuing machine jobs can have a net negative effect. It's true your venue will generally encourage people that will be more considerate of the long-term and altruistic effects of their research and so will likely have a more positive effect than the average entrant to the field, but if accelerating the development of strong AI is a net negative then that could outweigh the benefit of the average researcher being more altruistic.</p>\n", "parentCommentId": null, "user": {"username": "itaibn"}}, {"_id": "jyC5CpkHYFq7th9th", "postedAt": "2017-09-08T05:03:32.055Z", "postId": "J7XLAwiB47L3zjTcR", "htmlBody": "<p>Accelerating the development of machine intelligence is not a net negative since it can make the world better and safer at least as much as it is a risk. The longer it takes for AGI algorithms to be developed, the more advanced hardware and datasets there will be to support an uncontrolled takeoff. Also, the longer it takes for AI leaders to develop AGI then the more time there is for other nations and organizations to catch up, sparking more dangerous competitive dynamics. Finally, even if it were a net negative, the marginal impact of one additional AI researcher is tiny whereas the marginal impact of one additional AI safety researcher is large, due to the latter community being much smaller. </p>\n", "parentCommentId": "T7DHG2LvXJFqM98cW", "user": {"username": "kbog"}}, {"_id": "yw98cxb6K4f3Yjr5g", "postedAt": "2017-09-08T19:46:57.283Z", "postId": "J7XLAwiB47L3zjTcR", "htmlBody": "<p>Like me, I suspect many EA's do a lot of &quot;micro advising&quot; to friends and younger colleagues. (In medicine, this happens almost on a daily basis). I know I'm an amateur, and I do my best to direct people to the available resources, but it seems like creating some basic pointers on how to give casual advice may be helpful. </p>\n<p>Alternatively, I see the value in a higher activation energy for potentially reachable advisees- if they truly are considering adjusting their careers, then they'll take the time to look at the official EA material. </p>\n<p>Nonetheless, it seems like even this advice to amateurs like myself could be helpful - &quot;Give your best casual advice. If things are promising, give them links to official EA content.&quot;</p>\n", "parentCommentId": null, "user": {"username": "astupple"}}]