[{"_id": "TvbRHBqyuKjDefkcK", "postedAt": "2023-08-31T16:25:50.886Z", "postId": "JaACyD72oacQB9WDn", "htmlBody": "<p>I found this piece a little hard to parse, so can I ask some questions?&nbsp;</p><p>It seems the main conclusion you have is that geospacial data is really important and maybe underrated in EA? And the we should focus on it being more accurate?</p><p>Thanks for your work writing this piece.</p>", "parentCommentId": null, "user": {"username": "nathan"}}, {"_id": "BQEXXYM4LiD4codPh", "postedAt": "2023-08-31T16:50:30.140Z", "postId": "JaACyD72oacQB9WDn", "htmlBody": "<p>Hi Nathan, thanks for reading. The point of this post was really to address 2 problems:<br><br>1. It is generally really difficult to find geospatial scientists (Earth Observation, GIS...) and Earth System Scientists (Geophysicist, Volcanologist...) people in EA. We are a minority here. We get really excited when we meet each other. We want to gather a community and say we can contribute.<br><br>&nbsp;2. Geospatial data is very useful in many aspect of our cause areas, hence the breadth of case studies listed above, from neartermist to semi-longtermist (particularly supervolcano impact). While EA as a community don't seem to attract a lot of geoscientists in general (perhaps it should). Current career advice seem to always err on the side of take your quantitative skills and go work in consulting or finance (which was what I did too). We know that geospatial data and our niche skillsets can contribute, therefore, this post is also a chance to inform the rest of EAs the current geospatial research happening. Think about geospatial data and spatial analysis as a \"common language\" between an epidemiologist and a volcanologist. Perhaps direct cross-pollination might not happen, but a platform for skill-sharing would be useful.<br><br>So yes, geospatial research is underrated. I am not arguing more people should become a satellite image analyst, more advocating for if you work in global health or poverty alleviation already, perhaps also pay more attention to the geospatial aspect of it. Additionally, we could be a platform that perhaps provide geospatial research support if this community gain traction.<br><br>Hope this clarifies,<br>Chris</p>", "parentCommentId": "TvbRHBqyuKjDefkcK", "user": {"username": "chanakin"}}, {"_id": "shGidprSFGnvcqPyB", "postedAt": "2023-08-31T16:57:47.620Z", "postId": "JaACyD72oacQB9WDn", "htmlBody": "<p>Thanks. Can I suggest some slight changes to the tl dr at the start</p><p>&nbsp;</p><p>Tl;dr</p><ul><li>I am a geospacial scientist who wants to connect with other geospacial scientist EAs</li><li>I think that since many EA orgs already use geospacial data, this is perhaps underrated (examples below)</li><li>Currently, we will gather on channel&nbsp;<a href=\"https://eavirtualmeetupgroup.slack.com/archives/C05PQCZ2B8T\"><u>role-geoscientists on EA Anywhere slack</u></a>. so if you are interested, check it out</li><li>We listed a few distilled topics that geoscientists EA might be interested in.</li></ul>", "parentCommentId": "BQEXXYM4LiD4codPh", "user": {"username": "nathan"}}, {"_id": "iBJ4DWtdSS4vCPrBE", "postedAt": "2023-09-06T19:33:24.804Z", "postId": "JaACyD72oacQB9WDn", "htmlBody": "<p>Hi Christopher and Ewelina, thanks for this post, it's nice to see geoscientists in EA and advocating for the skillset that Geoscientists pose and you're right that it already plays a role in many of the EA causes. I may use this these examples to share with my undergrads!</p><p>I like the estimation calculation you do to equate the money proportional to planetary defense weighted to its odds. However you seem to use the Ord value of 1 in 8000 per century of a Supereruption. But Toby is talking here of a super eruption the size of Toba eruption which is 5000 km3 in volume. To be registered as a super eruption it's 1000km3 and the estimated probability of this supereruption volume is 1 in 170 per century (Rougier et al 2017). So it would be interesting to re-hash your model with this value instead- I would be interested to see how it compares with our expected value estimation in our paper here: <a href=\"https://www.nature.com/articles/d41586-022-02177-x\">https://www.nature.com/articles/d41586-022-02177-x</a> \"The financial losses resulting from a large-magnitude eruption are estimated to be in the multi-trillions<a href=\"https://www.nature.com/articles/d41586-022-02177-x#ref-CR8\"><sup>8</sup></a>, roughly comparable to those of the pandemic. Given the estimated recurrence rate for a magnitude-7 event, this equates to more than US$1 billion per year.\"&nbsp;</p><p>Another point to make here is the volume of the eruption is not necesarrily proportion to its impact, for the global climate-impacts sulfur content is a better metric, and sometimes there is an asymmetry between eruption volume (or VEI) and climatic impact (Schmidt and Black, 2022). This is where the ice-core record is a good proxy.</p><p>I should also add that we have been trying to attain funding from EA sources to conduct research on impacts from large eruptions on society for a few years<strong> </strong>(e.g. quantifying lives lost and mitigation strategies), but despite the neglectedness, tractability and importance of this risk, the funders have not been interested to date.</p><p>To end on a better note, I'd be happy to join your slack group- thanks for creating it. &nbsp;&nbsp;</p><p>P.S. We have a paper on the Ethics of Volcano Geoengineering coming out next month</p>", "parentCommentId": null, "user": {"username": "Mike Cassidy"}}, {"_id": "9nEa9zcxDcGukDD6T", "postedAt": "2023-09-07T12:32:30.048Z", "postId": "JaACyD72oacQB9WDn", "htmlBody": "<p>Thanks for reading Mike.<br><br>With an odd of 1 in 170, that will result in ~$8.964 billion USD (Note that this number and the above numbers are also yearly investment). Not exactly a trillion just yet. The report states that $428.51 trillion over 5-years loss should be considered, if the mean: $85.702 trillion USD GDP loss could be averted by 8.964 billion yearly, this will result in a cost-effectiveness ratio of roughly 9,600:1.<br><br>I.e. $1 USD in investment would save ~$9,600 USD in potential economic loss yearly. Although, given my modest understanding of insurance products, if a supereruption does occur, &nbsp;I suspect that payout to loss will have a P&lt;1 chance of actually materialising. I will need to do more research on this to provide a better answer...</p>", "parentCommentId": "iBJ4DWtdSS4vCPrBE", "user": {"username": "chanakin"}}]