[{"_id": "wF5xAKE8Kmke9w3PC", "postedAt": "2023-11-06T12:25:53.721Z", "postId": "JALJeiqtZJbQfsMeq", "htmlBody": "<p><strong>Executive summary</strong>: The post discusses the pros and cons of running a city-wide university EA group instead of a university-specific group, based on the author's experience in Budapest.</p><p><strong>Key points</strong>:</p><ol><li>A city-wide group allows for a bigger pool of applicants from multiple universities. However, university-specific marketing should still be done when possible.</li><li>It can be more inclusive for students from universities without existing EA groups.</li><li>It can help seed other university groups more quickly by getting university students involved.</li><li>Group cohesion may be lower with students from different universities. Specific outreach to shy students can help.</li><li>It blurs lines between university and city groups. Separate student meetups and professional meetups can help.</li><li>It could crowd out new organizers. Clearly encourage starting new university groups.</li><li>Event locations may be more constrained without a university-specific office.</li><li>The author recommends trying this model in the right context while coordinating with CEA and being mindful of potential issues. Seeding new university groups can retain the benefits while mitigating cons.</li></ol><p>&nbsp;</p><p><i>This comment was auto-generated by the EA Forum Team. Feel free to point out issues with this summary by replying to the comment, and</i><a href=\"https://forum.effectivealtruism.org/contact\"><i>&nbsp;<u>contact us</u></i></a><i> if you have feedback.</i></p>", "parentCommentId": null, "user": {"username": "SummaryBot"}}, {"_id": "xENbFqFMoMELYEXkv", "postedAt": "2023-11-06T14:55:20.705Z", "postId": "JALJeiqtZJbQfsMeq", "htmlBody": "<p>Here in Munich, we are dealing with many similar issues since we started as a group focused on professionals and are now registered at the two big unis (TUM and LMU), which are the best in Germany. We have some irregular events catering to professionals, but the Intro Program and most of our event are frequented by both universities</p>", "parentCommentId": null, "user": {"username": "Jacob_Schaal"}}, {"_id": "vsWN6LASrWF54ggfK", "postedAt": "2023-11-07T14:20:44.139Z", "postId": "JALJeiqtZJbQfsMeq", "htmlBody": "<p>Thank you for sharing!</p>", "parentCommentId": "xENbFqFMoMELYEXkv", "user": {"username": "gergogaspar"}}]