[{"_id": "hkB84EwaaHDqsfHo3", "postedAt": "2023-01-12T22:29:19.544Z", "postId": "JcaecPXE8am7MYJXZ", "htmlBody": "<p>Hi Megan &nbsp;- I just wanted to say thank you for writing this. For being you. For showing up. This so well encapsulates how I and so many others are feeling. I just wanted to say thank you &lt;3</p><p>(and i'm tired too ).&nbsp;</p>", "parentCommentId": null, "user": {"username": "ElikaSomani"}}, {"_id": "sdBnyZPwgA2DFtErT", "postedAt": "2023-01-12T22:40:25.280Z", "postId": "JcaecPXE8am7MYJXZ", "htmlBody": "<p>Yeah, I empathise.&nbsp;</p>", "parentCommentId": null, "user": {"username": "nathan"}}, {"_id": "GDHrBg9kCxD8qjFyr", "postedAt": "2023-01-12T22:46:00.964Z", "postId": "JcaecPXE8am7MYJXZ", "htmlBody": "<p>Thank you for writing this Megan. I don't even consider myself liberal or left but it is quite exhausting, as a community builder, to explain to friends, colleagues at work, and the fellowship members, that EA is a method of thinking and a goal of doing the most good and not shady billionaire schemes, self-promotion, and justifying lack of sensitiveness with rationality. So there is not much epistemic value to my comment but I just wanted to express that I am tired as well.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Davit Jintcharadze"}}, {"_id": "htr62fZomw9RMegKg", "postedAt": "2023-01-12T23:02:36.610Z", "postId": "JcaecPXE8am7MYJXZ", "htmlBody": "<p>Sorry you're in this situation! :(</p><p>&nbsp;</p><p>I want to allow my problem solver side to say a few things, but, eh, if that's not what you want, totally skip my comment</p><p>&nbsp;</p><p>So:</p><p>[reminder this is ignorable]&nbsp;</p><p>Maybe community building isn't a good fit for you now, in a time where it involves all these things you don't like?&nbsp;</p><ol><li>Or maybe you could do community building in some niche (like.. run the EA Product Managers group or something, if they don't have someone doing that) where you're not exposed to the parts you don't like?</li><li>My cold take is that too many EAs are in roles they find tiring/stressful/something, and that these EAs can find another role that is (in my interpretation of 80k's words) a better fit for them.<ol><li>I personally see software developers who want to be data scientists, and data scientists who want to be software developers, and each think they've got to do the not-fun-thing. Maybe you're somehow in this situation? I know at least one person who is fascinated by preventing and managing PR problems. I personally don't get it, but these people do exist. I know another person mission driven (in a good way) about reducing the.. toxicity. Maybe there's something you're excited about that you don't understand why not everybody else wants to do?</li></ol></li><li>A reminder that I know nothing about you, this is a long shot guess + pattern matching. Ignoring my comment is totally a legit move. (or maybe someone else who resonates with your post would resonate with this comment, I hope)</li></ol><p>&lt;3</p>", "parentCommentId": null, "user": {"username": "hibukki"}}, {"_id": "tj2Tavj6Erw9K5M3d", "postedAt": "2023-01-12T23:04:02.661Z", "postId": "JcaecPXE8am7MYJXZ", "htmlBody": "<p>Rich and powerful people have hijacked this movement.</p>\n", "parentCommentId": null, "user": {"username": "Mohammad Ismam Huda"}}, {"_id": "oAbf6dCszHpzAk5Rx", "postedAt": "2023-01-12T23:32:48.647Z", "postId": "JcaecPXE8am7MYJXZ", "htmlBody": "<p>Thank you for writing this.</p>\n<p>I don't do community building work, but I too am tired of these things being so present, and even accepted. Other than some specific projects that seem good to me (e.g. GiveWell, Charity Entrepreneurship), I'm having a harder and harder time sticking to the view that the movement as it exists is expected to have a big positive impact.</p>\n", "parentCommentId": null, "user": {"username": "Guy Raveh"}}, {"_id": "o5PwecfcM8oYmPXHs", "postedAt": "2023-01-13T00:10:28.375Z", "postId": "JcaecPXE8am7MYJXZ", "htmlBody": "<p>I think you've entirely misidentified the point. OP is not tired of community-building, but of the way that EA elevates certain people and the problems left in its wake. \"Cult of personality\" as it's commonly known. EA might have less problems with optics if it wasn't for people elevating people like Bostrom and SBF to these ridiculous heights. Community-building is probably fine, damage control is what sucks.</p>", "parentCommentId": "htr62fZomw9RMegKg", "user": {"username": "whatever"}}, {"_id": "as3q3AHxcGy5haF47", "postedAt": "2023-01-13T00:13:12.161Z", "postId": "JcaecPXE8am7MYJXZ", "htmlBody": "<p>Thanks for explaining, retracted</p>", "parentCommentId": "o5PwecfcM8oYmPXHs", "user": {"username": "hibukki"}}, {"_id": "giB5NwDLQLbZWw7T4", "postedAt": "2023-01-13T00:20:23.777Z", "postId": "JcaecPXE8am7MYJXZ", "htmlBody": "<p>Valid.</p>\n<p>Thanks for expressing your position.</p>\n", "parentCommentId": null, "user": {"username": "Dragon God"}}, {"_id": "QLZX8dgwkgghxnbNd", "postedAt": "2023-01-13T01:11:11.889Z", "postId": "JcaecPXE8am7MYJXZ", "htmlBody": "<p>Surely, damage control and crisis management is part of community building work?&nbsp;</p>", "parentCommentId": "as3q3AHxcGy5haF47", "user": {"username": "weuer"}}, {"_id": "wMrPSX8EM6FGPko3X", "postedAt": "2023-01-13T01:14:59.703Z", "postId": "JcaecPXE8am7MYJXZ", "htmlBody": "<p>Retracted even the heart</p>\n", "parentCommentId": "as3q3AHxcGy5haF47", "user": {"username": "Brad West"}}, {"_id": "Hbfreoe53KZf6Emfv", "postedAt": "2023-01-13T01:16:38.434Z", "postId": "JcaecPXE8am7MYJXZ", "htmlBody": "<p>I strongly disagree with your implication that \"these things\" (presumably \"sexism, racism, and other toxic ideologies\" as mentioned in the original post) are \"accepted\" within this movement, and I'm tired of stuff like this being brought up and distracting us from the mission we're all here for, which is to help others.</p>", "parentCommentId": "oAbf6dCszHpzAk5Rx", "user": {"username": "robirahman"}}, {"_id": "asu36dbKHjLpmtPL2", "postedAt": "2023-01-13T01:17:44.963Z", "postId": "JcaecPXE8am7MYJXZ", "htmlBody": "<p>Surely the heart is still endorsed by the author!</p>", "parentCommentId": "wMrPSX8EM6FGPko3X", "user": {"username": "robirahman"}}, {"_id": "Fht649vhnsmEcgZLf", "postedAt": "2023-01-13T01:33:25.948Z", "postId": "JcaecPXE8am7MYJXZ", "htmlBody": "<p>This. I do not think Nick Bostrom made a good apology at all for his views, but I do like CEA's response here to link it:</p>\n<p><a href=\"https://forum.effectivealtruism.org/posts/ALzE9JixLLEexTKSq/cea-statement-on-nick-bostrom-s-email\">https://forum.effectivealtruism.org/posts/ALzE9JixLLEexTKSq/cea-statement-on-nick-bostrom-s-email</a></p>\n", "parentCommentId": "Hbfreoe53KZf6Emfv", "user": {"username": "Sharmake"}}, {"_id": "HAykcHtEZbjHKaJwg", "postedAt": "2023-01-13T01:54:22.917Z", "postId": "JcaecPXE8am7MYJXZ", "htmlBody": "<p>My understanding is that it's not that she never wants to do damage control and crisis management - but that she is tired of constantly having to do it and the fact that it crowds out the other aspects of EA and Community-Building</p>\n", "parentCommentId": "QLZX8dgwkgghxnbNd", "user": {"username": "Moritz von Knebel"}}, {"_id": "Ks4BLkoJyvu29F3Cj", "postedAt": "2023-01-13T02:10:02.872Z", "postId": "JcaecPXE8am7MYJXZ", "htmlBody": "<p>Thanks for all your hard work, Megan.</p>\n<p>I'm reminded of this post from a few months ago: <a href=\"https://forum.effectivealtruism.org/posts/7ZjJ9w2xf7Mkdofk8/does-sam-make-me-want-to-renounce-the-actions-of-the-ea\">Does Sam make me want to renounce the actions of the EA community? No. Does your reaction? Absolutely.</a></p>\n<p>And this point from a <a href=\"https://forum.effectivealtruism.org/posts/X47rn28Xy5TRfGgSj/21-criticisms-of-ea-i-m-thinking-about\">post Peter Wildeford wrote</a>: \"I think criticism of EA may be more discouraging than it is intended to be and we don't think about this enough.\"</p>\n<p>In theory, the EA movement isn't about us as EAs.  It's about doing good for others.  But in practice, we're all humans, and I think it's human nature to have an expectation of recognition/gratitude when we've done an altruistic act.  If instead of gratitude, we get a punishment in the form of a bad outcome or sharp words, that feels like a bait &amp; switch.</p>\n<p>My hypothesis is that being surrounded by other do-gooders makes the situation worse.  You feel like you're in a recognition deficit, many people around you feel the same way, and no one is injecting gratitude into the ecosystem to resolve the misery spiral.  Internal debates exacerbate things, insofar as trying to understand someone else's perspective depletes the same emotional resource that altruism does.</p>\n<p>Anyway, most of that wasn't very specific to your post -- I'm just wondering if emphasizing \"other-care\" in addition to \"self-care\" would help us weather ups &amp; downs.</p>\n<p>And, thanks to all the EAs reading this for all the good you are doing.</p>\n", "parentCommentId": null, "user": {"username": "John_Maxwell_IV"}}, {"_id": "NFLSi7bQD5bGjrHT3", "postedAt": "2023-01-13T06:25:06.509Z", "postId": "JcaecPXE8am7MYJXZ", "htmlBody": "<p>girl*, same</p>\n<p>*or however you identify</p>\n", "parentCommentId": null, "user": {"username": "Larissa Schiavo"}}, {"_id": "SYwehWCMuggZ7v9bj", "postedAt": "2023-01-13T10:07:13.786Z", "postId": "JcaecPXE8am7MYJXZ", "htmlBody": "<p>Yes, so do I. But look at the comments on the various posts about this. Look how many people back him up, after an \"apology\" that basically says \"I said blacks are stupider than whites, and I stand by that, but I'm sorry for using a racial slur. Also I feel the need to mention I like eugenics.\"</p>\n", "parentCommentId": "Fht649vhnsmEcgZLf", "user": {"username": "Guy Raveh"}}, {"_id": "haFJuYo2uekbFaonv", "postedAt": "2023-01-13T10:19:19.242Z", "postId": "JcaecPXE8am7MYJXZ", "htmlBody": "<p>I resonated with this post a lot. Thank you for writing it.</p>", "parentCommentId": null, "user": {"username": "Shakeel Hashim"}}, {"_id": "arvnzyKFEFxzoiPQZ", "postedAt": "2023-01-13T11:19:34.518Z", "postId": "JcaecPXE8am7MYJXZ", "htmlBody": "<p>I strongly felt the same when I opened the forum today. When reading the post titles mentioning \"some apology email of Bostrom\" I figured it couldn't have been anything good and my first thought was \"Oh god, not again\". I'd love to think about and discuss how to make the world the best place it can be. I'd also love to spread the EA ideas to other people, but <a href=\"https://forum.effectivealtruism.org/posts/x9Rn5SfapcbbZaZy9/ea-for-dumb-people\">the bar to then also join the community is high</a> and <a href=\"https://forum.effectivealtruism.org/posts/i6Hday6mudh5j4mZ4/ea-can-sound-less-weird-if-we-want-it-to#qt3euaaikgvCwTAZy\">the ideas once you're beyond the principles are weird and for many, difficult to grasp.</a> When I first learned about EA, I thought of it as a <a href=\"https://forum.effectivealtruism.org/posts/jmbP9rwXncfa32seH/after-one-year-of-applying-for-ea-jobs-it-is-really-really#5Hp6TtNTTscSCCS55\">very elite thing</a>. I'd love to be able to say that this is no longer the case, but sadly, it isn't. &nbsp;I've been thinking about starting an EA University group, but the feelings expressed above have made me doubt doing so. The \"drama\" (apology for not finding a better word) of today and the previous months makes me doubt even more. I don't want to represent a community that is about apologizing for other people's actions, nor do I want to invite other people into such a community.</p>", "parentCommentId": null, "user": {"username": "Jeroen De Ryck"}}, {"_id": "YWeGj4M4sHd59hq5T", "postedAt": "2023-01-13T12:19:43.432Z", "postId": "JcaecPXE8am7MYJXZ", "htmlBody": "<p>It became a broken heart after retraction! 💔</p>", "parentCommentId": "asu36dbKHjLpmtPL2", "user": {"username": "hibukki"}}, {"_id": "PimnjrmqjoyBbdCJw", "postedAt": "2023-01-13T13:41:54.130Z", "postId": "JcaecPXE8am7MYJXZ", "htmlBody": "<p>I strongly disagree with this.</p>\n<ol>\n<li>This is not an accurate representation of Bostrom's apology</li>\n<li>Bostrom is a transhumanist philosopher, and has written on human enhancement; it is important to defend human enhancement as a noble pursuit and distinct from the historical eugenics movement</li>\n<li>If Bostrom believes that there may be racial differences in intelligence, I don't want him to lie about it.</li>\n</ol>\n<p>Maintaining epistemic integrity is important as individuals, but it's especially important for our intellectuals thinking about the long term future of humanity.</p>\n<p>A scenario where the public statements of our intellectuals can't be trusted because they're optimising for social acceptability is a very bad situation. I think the aggregate harm from eroding such epistemic trust is likely much worse than the harm from Bostrom's offensive remarks.</p>\n", "parentCommentId": "SYwehWCMuggZ7v9bj", "user": {"username": "Dragon God"}}, {"_id": "Ls3CFYv3CjmeRAuzD", "postedAt": "2023-01-13T13:59:48.471Z", "postId": "JcaecPXE8am7MYJXZ", "htmlBody": "<p>I'm tired, too. I'm tired of constantly having to watch what I say or don't say because of the fear that some mob will descend on me and try to ruin my life as they are now trying to do to Nick Bostrom. Perhaps someone in your situation can find it in themselves to have sympathy for people in my position and not just people in yours.</p>", "parentCommentId": null, "user": {"username": "throwaway791"}}, {"_id": "CSBdjeeoAXqExojCR", "postedAt": "2023-01-13T14:04:30.913Z", "postId": "JcaecPXE8am7MYJXZ", "htmlBody": "<p>Does Bostrom actually have a cult of personality/is elevated to ridiculous heights?</p>\n<p>He doesn't have a Twitter account (or any other social media presence as far as I'm aware), doesn't participate on EA (or EA adjacent) forums, doesn't blog frequently and doesn't do media tours to promote himself.</p>\n<p>&nbsp;</p>\n<p>Is this necessarily an EA optics problem?</p>\n<p><a href=\"https://www.thetimes.co.uk/article/blacks-more-stupid-than-whites-wrote-oxford-don-8gsj8l0wf\">The Times article on the controversy</a> mentions \"Oxford don\", in the headline, and there was no mention of \"effective altruism\" in the body of the article.</p>\n<p>I expect the mainstream zeitgeist on this article to be more about Bostrom's Oxford connection than his effective altruism connection.</p>\n<p>&nbsp;<br>\nI'm unconvinced that:</p>\n<ol>\n<li>EA has a Bostrom specific optics problem</li>\n<li>Bostrom has a cult of personality within EA</li>\n</ol>\n", "parentCommentId": "o5PwecfcM8oYmPXHs", "user": {"username": "Dragon God"}}, {"_id": "rmNy3L2viGTb7CcAW", "postedAt": "2023-01-13T14:10:48.857Z", "postId": "JcaecPXE8am7MYJXZ", "htmlBody": "<p>I think you're actually right here. A couple of points stand out to me:&nbsp;</p><ol><li>Megan says she still wants to build a movement that 'wants the world to be a better, kinder, softer place'</li><li>EA, like it or not, probably isn't that movement- EA is a movement that mashes together lots of different counterintuitive, often edgy ideas, makes trade-offs that clash with more mainstream ethical views, relies on often obscure philosophies and the work of a few very clever, fairly weird people... and is funded to a pretty major degree by those billionaires she's so tired of. &nbsp;</li></ol><p>I suspect that she really wants the EA movement to be something it's not, and finds the cognitive dissonance of trying to build this movement particularly stressful. As you mention, some people just enjoy PR and some people might just be happy defending a movement that they have major disagreements with, because the alternative is worse (political parties seem the obvious example) but Megan doesn't seem to be in either category.&nbsp;</p><p>Personally, I feel more comfortable with the way EA is, and I acknowledge the trade-offs- &nbsp;when I do community building (less frequently), I don't feel tired by any of the issues mentioned. I tend to take the fairly consistent line that, if a certain scandal or drama within EA makes the movement something that you really don't want to identify with, you're probably not right for EA (but I'm happy talking about recommended charities etc.). I don't feel like I've ever been 'in a position where I have to apologize for sexism, racism, and other toxic ideologies within this movement'.&nbsp;</p>", "parentCommentId": "htr62fZomw9RMegKg", "user": {"username": "Dzoldzaya"}}, {"_id": "LSz9Sfv7Qevm6e39f", "postedAt": "2023-01-13T14:23:51.911Z", "postId": "JcaecPXE8am7MYJXZ", "htmlBody": "<p>Yes, having to consider the potential consequences of one's words and actions can be a real drag.</p>", "parentCommentId": "Ls3CFYv3CjmeRAuzD", "user": {"username": "Megan Nelson"}}, {"_id": "FyexurdnWNJKjiJ6Y", "postedAt": "2023-01-13T14:27:37.097Z", "postId": "JcaecPXE8am7MYJXZ", "htmlBody": "<p>Thanks for your invaluable contribution in pointing this out :)</p>", "parentCommentId": "LSz9Sfv7Qevm6e39f", "user": {"username": "throwaway791"}}, {"_id": "FnKFbX2dforXXR5rv", "postedAt": "2023-01-13T14:27:37.312Z", "postId": "JcaecPXE8am7MYJXZ", "htmlBody": "<p>I am very surprised by the warm reception to this post. To my mind, this is exactly the type of rhetoric we should be discouraging on the Forums. It's insinuating all kinds of scandals</p><blockquote><p>(I am tired of drama, scandals, and PR. I am tired of being in a position where I have to apologize for sexism, racism, and other toxic ideologies within this movement)</p></blockquote><p>without making any specific allegations or points, which becomes somehow acceptable within the emotional frame of \"I am TIRED.\" Presumably many other people, including those directly impacted by these things, are tired too, and we need to use reason to adjudicate how we should respond. &nbsp;</p>", "parentCommentId": null, "user": {"username": "burner"}}, {"_id": "hvdBvKrP7o7X9we5u", "postedAt": "2023-01-13T14:32:19.768Z", "postId": "JcaecPXE8am7MYJXZ", "htmlBody": "<p>Phrases like \"EA elevates people\" are becoming common, but it is very unclear what it means. Nick Bostrom created groundbreaking philosophical ideas. Will MacAskill has written extremely popular books and built communities and movements. Sam Bankman Fried became the richest man under 30 in a matter of months. All of these people have influenced and inspired many EAs because of their actions.&nbsp;</p><p>Under any reasonable sense of the word, people are elevating themselves. I think EA is incredibly free from 'cult of personality' problems - in fact it's amazing how quickly people will turn against popular EAs. But in any group, some people are going to get status for doing their work well.&nbsp;</p>", "parentCommentId": "o5PwecfcM8oYmPXHs", "user": {"username": "burner"}}, {"_id": "i4qJZrwimb7xyFcaM", "postedAt": "2023-01-13T15:28:04.017Z", "postId": "JcaecPXE8am7MYJXZ", "htmlBody": "<p>I had a negative reaction to the post but felt hesitant to reply because of the emotional content. It does suck what the OP is experiencing - I think they (and others) could make less of their identity be about the EA movement and that this would be a good thing. I don't like that 'small-scale EA community builders' are having to apologise for things others into EA have done or having to spend time figuring out how to react to EA drama. That does seem like a waste of time and emotional energy, and also unnecessary.&nbsp;</p>", "parentCommentId": "FnKFbX2dforXXR5rv", "user": {"username": "Quadratic Reciprocity"}}, {"_id": "etturdCS5nxrRByzC", "postedAt": "2023-01-13T15:33:22.523Z", "postId": "JcaecPXE8am7MYJXZ", "htmlBody": "<p>Unfortunately, issues like the FTX debacle or the Bostrom stuff recently might be a significant amount of a prospective EA's experience about EA because other aspects may not have penetrated to his/her news sources. Even a small-scale community builder might want some good answers in the face of troubling news one has been in contact with.</p>\n", "parentCommentId": "i4qJZrwimb7xyFcaM", "user": {"username": "Brad West"}}, {"_id": "8oxJANyxhf7A4EafF", "postedAt": "2023-01-13T16:18:24.379Z", "postId": "JcaecPXE8am7MYJXZ", "htmlBody": "<p>I want EA to be a movement about ambitiously working towards a brighter future for humanity.</p>\n<p>To that end, it's a feature not a bug that some EAs are rich/powerful and that EA attracts some of those kinds of people.</p>\n", "parentCommentId": "tj2Tavj6Erw9K5M3d", "user": {"username": "Dragon God"}}, {"_id": "kFTbLj2bD6XdetC4J", "postedAt": "2023-01-13T17:21:55.789Z", "postId": "JcaecPXE8am7MYJXZ", "htmlBody": "<p>It seems a number of people agree with your sentiment, throwaway791, so I'm choosing to respond:<br><br>Most people do not experience a \"mob descending on them and trying to ruin their life,\" especially for merely something they said, and especially for something they couldn't have anticipated—perhaps by first getting input from a few trusted friends or colleagues—would cause life-altering backlash.<br><br>If this is a sensation you genuinely routinely find yourself experiencing such that it is causing you exhaustion, it sounds horribly stressful and I'm very sorry you are going through this. I would encourage you to consider speaking to a mental health professional because my layperson perspective is that this is an exaggerated fear that may be indicative of larger issues around anxiety.<br><br>That aside, words and the concepts they perpetuate have consequences. Those consequences can range from hurt feelings to genocidal ideologies taking root. I consistently express views that are outside the social norm, but I don't share your fear. I think this is because (1) I am never \"an edgelord\", (2) I don't often express ideas that are likely to harm others, and (3) I spend enough time learning about the world and others' views and experiences to trust I am calibrated well to what is incendiary <i>and why</i>. If you're spending a great deal of time watching what you say and experiencing uncertainty regarding how others will respond, maybe you're experiencing a calibration issue. If so, this seems very addressable by exposing yourself to more areas of discourse, cultivating and practicing empathy, and doing more listening than speaking.</p>", "parentCommentId": "Ls3CFYv3CjmeRAuzD", "user": {"username": "Rockwell Schwartz"}}, {"_id": "4kidGonTYL6fgkCam", "postedAt": "2023-01-13T18:50:44.624Z", "postId": "JcaecPXE8am7MYJXZ", "htmlBody": "<p>How much drama/scandal has there actually been in EA beyond FTX (admittedly a huge scandal) and now Bostrom (in my opinion something that doesn't need to be given all that much oxygen)?</p><p>Serious question.</p>", "parentCommentId": null, "user": {"username": "jackmalde"}}, {"_id": "MHCjEnka8u3G8HtgS", "postedAt": "2023-01-13T21:03:13.622Z", "postId": "JcaecPXE8am7MYJXZ", "htmlBody": "<blockquote><p>I consistently express views that are outside the social norm, but I don't share your fear.</p></blockquote><p>What you're missing here is the concept of <i>heresy</i>.</p><p>Plenty of views that are outside the social norm are not considered heretical. For instance, if you don't like a movie that most people like or vice versa, that view is going to be outside the social norm but not in a way that means people who express it are punished for their opinions.</p><p>The problem is that <i>some</i> true things are considered heretical, and therefore you must be cautious in how much you reveal of what you really believe, even in private as such private communications can end up being publicized in a way that's out of your control.</p><blockquote><p>That aside, words and the concepts they perpetuate have consequences. Those consequences can range from hurt feelings to genocidal ideologies taking root.</p></blockquote><p>Yes, I'm sure Catholics in 16th century Spain also believed that \"words and the concepts they perpetuate have consequences\", for example such as God deciding to punish your civilization by causing crop harvests to fail three years in a row because you were insufficiently pious and didn't suppress opponents of Catholicism sufficiently strongly.</p><p>You can always tell stories about how people expressing views you don't like will have bad consequences. Most of these stories are utter hogwash and are nothing more than exercises in self-delusion. Please keep the past record of such storytelling in mind when you make claims of alleged harm supported only by poor evidence and implicit intuitions you're unable to share with others.</p><blockquote><p>If you're spending a great deal of time watching what you say and experiencing uncertainty regarding how others will respond, maybe you're experiencing a calibration issue.</p></blockquote><p>I know exactly how others will respond. My uncertainty is about what I have said where and when will suddenly become the subject of attention by people who wish to attack me. There's no calibration issue if you're afraid to declare you're an atheist in 16th century Spain, just a well-calibrated recognition that doing this will be very bad for you.</p>", "parentCommentId": "kFTbLj2bD6XdetC4J", "user": {"username": "throwaway791"}}, {"_id": "sZx4C47ojDorK5Bow", "postedAt": "2023-01-13T22:23:29.292Z", "postId": "JcaecPXE8am7MYJXZ", "htmlBody": "<p>It is difficult to engage with you because the potential range of beliefs you could be referring to is so vast, there is no context aside from the Bostrom email, and you're an anonymous account so there is even less context. Regardless, it sounds like this still comes down to a question of why making (allegedly) truthful statements would lead to life-altering backlash and I see a distinction between \"because it threatens the norm and people see it as heretical\" and \"because &nbsp;it is tied to ideologies that have caused vast suffering.\" I also would want to know the purpose of making the incendiary statements: Are they helpful in actually improving the world? Or are they promoting a truth for truth's sake?</p><p>Fwiw, many of the views I express would accurately be described as heretical, by your definition. And I <i>have</i> personally experienced a mob descending and attempting to ruin my life as a result.</p>", "parentCommentId": "MHCjEnka8u3G8HtgS", "user": {"username": "Rockwell Schwartz"}}, {"_id": "oYND8XBrM59Ahsk7H", "postedAt": "2023-01-13T23:49:31.141Z", "postId": "JcaecPXE8am7MYJXZ", "htmlBody": "<p>There were also <a href=\"https://medium.com/@zoecurzi/my-experience-with-leverage-research-17e96a8e540b\">these</a>, <a href=\"http://zizians.info/\">cults</a>.</p>\n", "parentCommentId": "4kidGonTYL6fgkCam", "user": {"username": "Guy Raveh"}}, {"_id": "XzXj5gDWtdPjzvn9y", "postedAt": "2023-01-14T02:45:48.042Z", "postId": "JcaecPXE8am7MYJXZ", "htmlBody": "<p>You asked for sympathy; you don't seem willing to receive it.</p>\n<p>You insist that <em>your</em> unpopular views are targeted like atheists in 16th century Spain,\n&amp; dismiss others who feel persecuted for their viewpoints as utter hogwash.</p>\n<p>So, it seems what you want is self-glorification?\nYou put yourself forward as singularly persecuted,\nyou ask for sympathy in what seems to have actually been a passive aggressive accusation of hypocrisy,</p>\n<p>&amp; so, I do believe that you're experiencing constant worry about saying the wrong thing,\nbecause for whatever reason, that constant anxiety is the price you've decided to pay for the righteous certainty of your unpopular convictions.</p>\n<p>Dogma is like that.</p>\n", "parentCommentId": "MHCjEnka8u3G8HtgS", "user": {"username": "Wasserperson"}}, {"_id": "c8tf86xPdY6jGL8kz", "postedAt": "2023-01-15T15:49:42.609Z", "postId": "JcaecPXE8am7MYJXZ", "htmlBody": "<p>Fairs. I think in FTX worlds, it should actually be in fact harder to get people who strongly dislike fraud to get on board with EA &nbsp;and in Bostrom email worlds, it should actually be in fact harder to get people who strongly dislike the apology to get on board with EA. And that this difficulty, to the extent we care about people turned off by either event having favourable opinion of EA, is actually right and just.&nbsp;</p>", "parentCommentId": "etturdCS5nxrRByzC", "user": {"username": "Quadratic Reciprocity"}}, {"_id": "c6rQPF3pGfdFGmgcn", "postedAt": "2023-01-16T06:14:21.728Z", "postId": "JcaecPXE8am7MYJXZ", "htmlBody": "<p>I empathise with this a lot, and know many others who do too.</p><p>Thanks for sharing where you're at and also for all the effort you've put in and for not quitting &lt;3</p>", "parentCommentId": null, "user": {"username": "Luke Freeman"}}, {"_id": "YtBWBo9MB6pAhEBD2", "postedAt": "2023-01-17T22:03:16.611Z", "postId": "JcaecPXE8am7MYJXZ", "htmlBody": "<p>I share this feeling. I feel like EA has trended in the direction of some other groups I've dealt with where the personalities and interpersonal issues of a small number of people at the top come to be overly dominant.&nbsp;</p><p>I've also had my faith in the movement fractured a bit by seeing how much of how things were run seems to be based on friends of friends networks. I had naively assumed they were doing the kind of due diligence and institutional division of power that other charitable organisations do.</p><p>A lot of this isn't a particular specific set of issues, but its a general sense of ones estimates of people being shifted downward</p>", "parentCommentId": null, "user": {"username": "projectionconfusion"}}, {"_id": "Nt48ptEyBgbkua6Mo", "postedAt": "2023-01-17T22:32:40.701Z", "postId": "JcaecPXE8am7MYJXZ", "htmlBody": "<p>Thanks for your thoughts here.</p>", "parentCommentId": "YtBWBo9MB6pAhEBD2", "user": {"username": "Brian Ayofemi"}}, {"_id": "qQocJqtF7knEeDcu8", "postedAt": "2023-01-18T09:16:37.316Z", "postId": "JcaecPXE8am7MYJXZ", "htmlBody": "<p>Thank you for your hard work, Megan. Being a social worker sounds hard in itself to me. I think it's extremely generous and impressive that in addition to that you volunteer, and donate, and are vegan. That does sound exhausting, even without the community dramas that feel kind of incessant at the moment.&nbsp;</p><p>It feels really tiring to me too. EA itself feels tiring. It's tiring that there's always more to do and that I could always be prioritising harder and helping others more. A thing that makes that bearable to me is working together - having a community supporting each other other in trying to do good but also giving each other a break. It feels horrid to instead have people angry at each other, and getting fire from outside the community too. I hope your local community is supportive. I hope you guys are able to help each other to focus on the good and to take breaks, and deeply care about each other, while you're all improving the lives of others. &nbsp;I hope some of the appreciative, caring messages people have left in response to this post have helped the burden feel a little lighter. &nbsp;</p>", "parentCommentId": null, "user": {"username": "Michelle_Hutchinson"}}]