[{"_id": "kFXBBTdxaxHFkMErc", "postedAt": "2022-08-24T02:06:45.975Z", "postId": "JD6QvQG3q5p6heKuA", "htmlBody": "<p>Thanks for this post.&nbsp;</p><blockquote><p>In summary, if we expect AI companies to beat the market, then we may or may not prefer to invest in AI stocks on the margin, and it could easily go either way depending on what assumptions we make.</p></blockquote><p>As you noted, I think this is an important caveat/assumption, and should probably be highlighted more in the intro.</p><p>As I read/skimmed this, I realized that I was confused because (mostly due to other people's) &nbsp;talking about AI mission hedging is confused and doesn't clearly differentiate between two different claims:</p><ol><li>We should mission hedge AI progress, because money matters more in worlds where AI makes more progress (what your post tries to answer)</li><li>We should invest in AI, because (some) EAs believe that we know a \"secret\" about the world, namely that other people are underestimating AI progress.</li></ol><p>Your post fairly clearly answers the first claim (in the negative) but does not shed much light on the second.</p>", "parentCommentId": null, "user": {"username": "Linch"}}, {"_id": "STXfiKs5a7vzaqmuK", "postedAt": "2022-08-24T03:08:18.809Z", "postId": "JD6QvQG3q5p6heKuA", "htmlBody": "<p>Yeah I'm explicitly not addressing #2 because it would require an entirely different approach. I can edit the intro to clarify.</p>\n", "parentCommentId": "kFXBBTdxaxHFkMErc", "user": {"username": "MichaelDickens"}}, {"_id": "F73erje38gHnfgLun", "postedAt": "2022-08-24T04:08:55.925Z", "postId": "JD6QvQG3q5p6heKuA", "htmlBody": "<p>Great, thanks for the edits! &nbsp;:)<br>&nbsp;</p><p>Agreed that it'd take a different approach and you can't be expected to do everything!</p>", "parentCommentId": "STXfiKs5a7vzaqmuK", "user": {"username": "Linch"}}, {"_id": "KfyfRz8ky59vPfAJy", "postedAt": "2022-08-24T15:23:00.519Z", "postId": "JD6QvQG3q5p6heKuA", "htmlBody": "<p>One thing I struggle with is writing summaries. My natural inclination is to want to include every possible caveat and clarification, but then the summary turns into the whole essay. My general approach is to write the summary for someone with a lot of context who fully trusts me, and then in the rest of the post, assume low context / low trust.</p>\n<p>If there are certain issues that people are particularly likely to get hung up on, it can make sense to include them in the summary. The fact that you had this confusion suggests that it's common, so I figured it's worth adding.</p>\n", "parentCommentId": "F73erje38gHnfgLun", "user": {"username": "MichaelDickens"}}, {"_id": "bgmtbTJeEhnF5rtwo", "postedAt": "2022-08-24T21:40:13.841Z", "postId": "JD6QvQG3q5p6heKuA", "htmlBody": "<p>FWIW I've spent a bit of time thinking about #2 without much progress.</p>\n<p>A few disjointed thoughts:</p>\n<ul>\n<li>Things in the same reference class as AI (i.e., growth stocks) have systematically underperformed the market, but the top-performing stocks are almost always growth stocks.</li>\n<li>How much should we act on idiosyncratic beliefs? Some EAs (eg SBF) clearly have market-beating skill, although Alameda-style short-term trading using math has much quicker feedback loops than trying to predict long-term market trends, so it's much easier to know whether you're good at it. I'm not sure anyone in history has been demonstrably good at predicting long-term trends. (Maybe George Soros? Not too familiar with his work.)</li>\n<li>EAs are thinking much more than most people about the impact of transformative AI. On the other hand, EA AI timeline forecasts are pretty similar to expert forecasts, and some market participants are extremely bullish on AI/technological growth (eg Cathie Wood).</li>\n<li>Investing in AI only makes sense given certain assumptions: there must be a slow takeoff, you must invest in the company(ies) that succeed, and the benefits must accrue disproportionately to those companies (rather than to the whole economy, which you might see if eg OpenAI is the market leader).</li>\n<li>Under the right circumstances, investing in AI might generate some insane amount of utility like 10^20 times bigger than the current value of earth. Not sure how to think about that. Does the EV calculation say to invest in AI for that small chance of a 10^20 gain?</li>\n<li>I'd like to have an idea of how to value AI companies. How much should we be willing to pay? Even if we would pay more for AI companies than for the broad market, AI companies are already  expensive vs the market. Are they too expensive, or still cheap enough to be worth buying?</li>\n</ul>\n<hr>\n<p>I had an idea a few months ago for how to allocate to AI stocks. It seemed promising but it's incomplete. I will post my personal notes below in case anyone's interested:</p>\n<ul>\n<li>Let our investment thesis be:\n<ol>\n<li>There will be a slow takeoff</li>\n<li>Takeoff will start soon enough before singularity that we have time to spend most of our money on things we care about</li>\n<li>Takeoff will be driven by publicly-traded companies</li>\n</ol>\n</li>\n<li>Under thesis, suppose optimal strategy is to invest in each company in proportion to how much of AI progress it captures\n<ul>\n<li>This makes intuitive sense. Not sure how to justify</li>\n<li>Sort of like risk parity</li>\n<li>Sort of like fundamental weighting, where companies get weight in proportion to their value</li>\n</ul>\n</li>\n<li>If thesis is wrong, invest in factor portfolio</li>\n<li>Say 35% chance that thesis is true: 70% chance of slow takeoff * 50% chance that takeoff happens slowly enough for us to spend most of our money\n<ul>\n<li>I actually think there's less than a 70% chance of slow takeoff but whatever</li>\n<li>Could better estimate this probability by drawing some overlapping curves of takeoff speeds + achievable spending rates</li>\n</ul>\n</li>\n<li>Stock proportions should be a weighted average of the optimal proportion in true-thesis vs. false-thesis worlds\n<ul>\n<li>growth-y AI stocks will probably end up underweighted unless they look particularly likely to get big gains in true-thesis world</li>\n<li>value-y AI stocks will end up double-overweighted (not many of these. FB is one example)</li>\n</ul>\n</li>\n<li>A fundamental index underweights mega-cap tech companies by 0.5pp to 3pp. The thesis maybe overweights mega-cap tech companies by 5pp to 8pp. At 1/3 chance thesis and 2/3 chance not-thesis, net overweight is roughly +1pp\n<ul>\n<li>But depends on individual company, eg NVDA would probably get net overweight, while AMZN gets net underweight</li>\n<li>INTC is overweighted by both value and thesis</li>\n</ul>\n</li>\n</ul>\n", "parentCommentId": "kFXBBTdxaxHFkMErc", "user": {"username": "MichaelDickens"}}, {"_id": "iSk8J5Hms4pAZ76Ac", "postedAt": "2022-08-24T22:35:04.066Z", "postId": "JD6QvQG3q5p6heKuA", "htmlBody": "<p>I think I broadly agree with this decomposition (not that I know much about the field or anything). Some specific disagreements:</p><blockquote><p>Under the right circumstances, investing in AI might generate some insane amount of utility like 10^20 times bigger than the current value of earth. Not sure how to think about that. Does the EV calculation say to invest in AI for that small chance of a 10^20 gain?</p></blockquote><p>I think basically (within the space of longtermist interventions) a lot of these concerns <a href=\"https://forum.effectivealtruism.org/posts/myp9Y9qJnpEEWhJF9/linch-s-shortform?commentId=jsitx3grbpt7Pwyhb\">approximately add up to normality</a>. Investing in AI might generate 10^20 utility than the current value of Earth, sure, but most plausible x-risk interventions will be within a small number of OOMs of this as well, as well a fair number of longtermist movement building interventions.</p><blockquote><ul><li>Let our investment thesis be:<ol><li>There will be a slow takeoff</li><li>Takeoff will start soon enough before singularity that we have time to spend most of our money on things we care about</li><li>Takeoff will be driven by publicly-traded companies</li></ol></li></ul></blockquote><p>Re 2: Maybe you're already thinking of this (otherwise \"50% chance that takeoff happens slowly enough for us to spend most of our money\" feels a bit high), but one thing to keep in mind is that we're still operating in a world where markets are mostly rational. The investment thesis implicitly is betting on EAs knowing an open \"secret\" about the world (specifically, the rest of the world undervalues AI in the medium-long term). However, this doesn't mean the financial world will keep being \"irrational\" (by our lights) about AI. We might expect this secret to become apparent to the rest of the world well before AI is actually contributing to speeding up GDP doublings in the technical \"slow takeoff\" ways.<br><br>Unfortunately timing the market is famously hard and I'm not sure there's a reasonable way to model this (even for people who legitimately know secrets, pricing seems a lot easier than timing). So I don't have great ideas of how to model \"when will people wake up to AI, conditional upon slow-takeoff EAs being right about AI.\" Though I have a few mediocre ideas like starting with an ignorance prior and for you to interview EAs in hedge funds to see if they have the relevant psychological insights.</p>", "parentCommentId": "bgmtbTJeEhnF5rtwo", "user": {"username": "Linch"}}, {"_id": "MqvaoqocWh7Xy2mtu", "postedAt": "2022-09-08T08:48:49.686Z", "postId": "JD6QvQG3q5p6heKuA", "htmlBody": "<p>It seems strange to talk about leveraged MVO assets, but not talk about leveraged investments in the AI basket. Am I missing something?</p>", "parentCommentId": null, "user": {"username": "Davidmanheim"}}, {"_id": "P9BZ6rxLxLAvXRHjt", "postedAt": "2022-09-08T15:57:54.632Z", "postId": "JD6QvQG3q5p6heKuA", "htmlBody": "<p>You want to match the volatility of the two assets you're comparing. In my simulations, I leveraged both up to 30% volatility, but I might have neglected to mention that I was leveraging the AI basket.</p>\n", "parentCommentId": "MqvaoqocWh7Xy2mtu", "user": {"username": "MichaelDickens"}}, {"_id": "kECegQqXJXQgDtr3A", "postedAt": "2022-09-09T08:55:26.140Z", "postId": "JD6QvQG3q5p6heKuA", "htmlBody": "<p>Yeah, I didn't go through carefully, but I definitely missed that - though arguably leveraging AI more as a hedge would make sense, since it's only valuable in worlds where it takes off.</p>", "parentCommentId": "P9BZ6rxLxLAvXRHjt", "user": {"username": "Davidmanheim"}}]