[{"_id": "Jiu7LqWwRtwh4YYE9", "postedAt": "2013-12-31T02:19:00.000Z", "postId": "JdK4CeErZGhnaSxgB", "htmlBody": "<p>&quot;setting up an Effective Altruism Fund&quot;</p><p>The cheap and easy first step along these lines would be for CEA to make a page on its website where people saving to donate later, or putting money in Donor Advised Funds, could register the amounts saved/invested and their intentions for the funds. This would be a very cheap and easy effort (you could even just use a Google Form) and would allow evidence of interest to accumulate.</p><p>You don't need $20,000 to do it, just a bit of staff time, and there are definitely people saving for later or using DAFs (Peter Hurford just posted about his plans along those lines, earlier in this blog series).</p><p>&quot;Even after trying to correct for obvious personal bias, I think that CEA wins out for my comparatively small donation; if I had info that the relevant position at CSER wouldn’t be funded anyway, and if I had more to give (e.g. ~$70k) then I think that CSER would be better...This expenditure is also pretty lumpy, and I don’t expect them to get all their donations from small individual donations, so it seems to me that donating 1/50th of the cost of a program manager isn’t as good as 1/50th of the value of a program manager. For those with a larger amount to give, the situation is different.&quot;</p><p>Why not make a long odds bet with a wealthy counterparty or use high-risk derivatives to get a chance at making the large donation? In principle, economies of scale like this should always be subject to circumvention at modest cost.</p><p>Also see: <a href=\"http://www.indiegogo.com/\">http://www.indiegogo.com/</a></p><p>&quot;that Lomborg’s (inaccurate) reputation as a climate skeptic might taint the idea of global prioritisation.)&quot;</p><p>He does accept the scientific consensus and relies on IPCC figures, but he does seem to spend a really disproportionate portion of his writing and speaking on the idea of trading off climate mitigation costs against more effective interventions. It is far less common to see him pitting highly effective global public health interventions against farm subsidies, military spending, social security, rich country health care, tax cuts, or other non-climate competing expenditures.</p>", "parentCommentId": null, "user": {"username": "CarlShulman"}}, {"_id": "FQRK98CnQQZduZLyv", "postedAt": "2013-12-31T06:51:00.000Z", "postId": "JdK4CeErZGhnaSxgB", "htmlBody": "<p>Will, are you saying that this fund would basically just be a registry?  (As opposed to an actual central collection of money with some sort of manager.)  </p><p>\nDo you really think people would just send money to 1st-world strangers (ii)  on the promise that the recipient was training to earn to give?  I have similar misgivings about (iv).</p>", "parentCommentId": null, "user": {"username": "Jess_Riedel"}}, {"_id": "4rSzcJGi5c5u2SEaX", "postedAt": "2014-01-01T15:37:00.000Z", "postId": "JdK4CeErZGhnaSxgB", "htmlBody": "<p>Why CSER and not FHI?</p>\n", "parentCommentId": null, "user": {"username": "XXY52891"}}, {"_id": "ZXzngzoPXT4JDnbCD", "postedAt": "2014-01-01T23:06:00.000Z", "postId": "JdK4CeErZGhnaSxgB", "htmlBody": "<p>CSER is at startup stage, with a lot of valuable resources going underutilized, so it looks more leveraged.</p>\n", "parentCommentId": "4rSzcJGi5c5u2SEaX", "user": {"username": "CarlShulman"}}, {"_id": "KkCth8vH7uZ7W3G3f", "postedAt": "2014-01-02T20:11:00.000Z", "postId": "JdK4CeErZGhnaSxgB", "htmlBody": "<p>In addition to Carl's comments on why the registery would be easier, it has the added benefit of people being able to control their own funds and thus being more willing to contribute to the 'fund'.  </p><p>&quot;Do you really think people would just send money to 1st-world strangers \n(ii)  on the promise that the recipient was training to earn to give?&quot;  They needn't be strangers.  This has already happened in the UK EA community amongst EAs who met through 80,000 Hours and supported each other financially in the early training and internship stages of their earning to give careers.</p>", "parentCommentId": "FQRK98CnQQZduZLyv", "user": {"username": "Niel_Bowerman"}}, {"_id": "wypWA8gAovi6ThKps", "postedAt": "2014-01-02T20:20:00.000Z", "postId": "JdK4CeErZGhnaSxgB", "htmlBody": "<p>You say the usual arguments to give to only one charity don't apply to you because you want to show your support, but isn't that one of the bad arguments listed on the page you link to? If so I presume you have a good reason why you still donate to multiple charities, but also presumably most people do not have that reason (otherwise the argument would not be a bad argument). So I wondered why you have this reason and whether as a result I and others might have that reason, and if they do then you ought to amend the article on giving to one charity so that people do not give at less than maximum efficiency</p>\n", "parentCommentId": null, "user": {"username": "Howtogive"}}, {"_id": "C4QrX9dNTNPbk9hcf", "postedAt": "2014-01-02T21:00:00.000Z", "postId": "JdK4CeErZGhnaSxgB", "htmlBody": "<p>I would imagine Will donates to multiple charities because the impact of his donations come primarily through their ability to inspire others to donate.  Because of Will's profile as a columnist and public intellectual, he often meets with potential donors who favour one of his recommendations over the others, and Will is able to say that he also donates to them, which may increase the likelihood of donations via the &quot;actions speak louder than words&quot; heuristic.  </p><p>This would apply to others if they believe {{the impact of donations they can inspire by donating to multiple charities} - {the impact of donations they can inspire by donating to their top recommended charity}} &gt; {{the impact of the donation to their top recommended charity} - {the impact of instead donating to multiple charities}}.  Presumably Will believes that this inequality is true for his case.  The exact quantities of donations that you need to be able to inspire for this to be true depend on your assessment of the relative efficiencies of the different charities that you are considering donating to.  Of course in reality these quantities are virtually impossible to calculate and so there is always going to be signficant uncertainty associated with this decision.  </p><p>It is also possible that Will is using some variant of the argument used by Julia Wise: &quot;I wouldn’t want the whole effective altruist community to donate to only one place.  So I’m okay with dividing things up a bit.&quot;  /ea/5l/where_im_giving_and_why_julia_wise/</p><p>It is also interesting to note that many of the GiveWell staff have chosen to donate to only one of their recommendations, presumably because they agree that they can have more impact that way.  <a href=\"http://blog.givewell.org/2013/12/12/staff-members-personal-donations/\">http://blog.givewell.org/2013/12/12/staff-members-personal-donations/</a></p>", "parentCommentId": "wypWA8gAovi6ThKps", "user": {"username": "Niel_Bowerman"}}, {"_id": "sHcSxQswwbZFaacGF", "postedAt": "2014-01-02T21:06:00.000Z", "postId": "JdK4CeErZGhnaSxgB", "htmlBody": "<p>&gt; They needn't be strangers. This has already happened in the UK EA community amongst EAs who met through 80,000 Hours and supported each other financially in the early training and internship stages of their earning to give careers.</p><p>\nAgreed, but if the funds are effectively restricted to people you know and can sort of trust, then the public registry loses most of its use.  Just let it be known among your trusted circle that you have money that you'd be willing share for EA activities.  This has the added benefit of not putting you in the awkward position of having to turn down less-trusted folks who request money.</p>", "parentCommentId": "KkCth8vH7uZ7W3G3f", "user": {"username": "Jess_Riedel"}}, {"_id": "Dq9w4JseqXiWL6uCy", "postedAt": "2014-01-02T21:15:00.000Z", "postId": "JdK4CeErZGhnaSxgB", "htmlBody": "<p>Yes, unless you were able to meet with people and create time to develop the neccessary trust.  Also, like any grant-making foundation, I wouldn't expect people in the registry to fund all or even most of the oppertunities that came along, though the registry would lose some of its value if it appears to be unlikely to give out donations to good projects.</p>\n", "parentCommentId": "sHcSxQswwbZFaacGF", "user": {"username": "Niel_Bowerman"}}, {"_id": "7ay4AbBijh3Gakx3e", "postedAt": "2014-01-02T21:18:00.000Z", "postId": "JdK4CeErZGhnaSxgB", "htmlBody": "<p>I think the claim, which I do not necessarily support, would be this: Many people give to multiple orgs <i>as a way of selfishly benefiting themselves</i> (by looking good and affiliating with many good causes), whereas a &quot;good&quot; EAer might spread their donation to multiple orgs as a way to (a) persuade the rest of the world to accomplish more good or (b) coordinate better with other EAs, a la the argument you link with Julia.  (Whether or not there's a morally important distinction between the laymen and the EAer as things actually take place in the real world is a bit dubious.  EA arguments might just be a way to show off how well you can abstractly justify your actions.)</p>\n", "parentCommentId": "C4QrX9dNTNPbk9hcf", "user": {"username": "Jess_Riedel"}}, {"_id": "G6W5nKArLqGZf9B3m", "postedAt": "2014-01-02T21:21:00.000Z", "postId": "JdK4CeErZGhnaSxgB", "htmlBody": "<p>My impression is more that FHI is at the startup stage and CSER is simply an idea people have been kicking around.  Whether or not you support CSER would depend on whether or not you think it's actually going to be instantiated.  Am I confused?</p>\n", "parentCommentId": "ZXzngzoPXT4JDnbCD", "user": {"username": "Jess_Riedel"}}, {"_id": "toMQGDXcoTWFiic6k", "postedAt": "2014-01-02T21:26:00.000Z", "postId": "JdK4CeErZGhnaSxgB", "htmlBody": "<p>I'm not sure of the exact numbers but my impression is that FHI has perhaps half a dozen full-time staff members, and CSER has one part-time person who is based in FHI and has been working on grant applications but I am unclear about the long-term financial viability of having this person working on applying for grants.</p>\n", "parentCommentId": "G6W5nKArLqGZf9B3m", "user": {"username": "Niel_Bowerman"}}, {"_id": "47qJZ5gMN5aush635", "postedAt": "2014-01-05T03:50:00.000Z", "postId": "JdK4CeErZGhnaSxgB", "htmlBody": "<p>I like Carl's idea for the EA fund.  I have some money in a DAF that I would register on an &quot;EA fund website&quot;.</p>\n", "parentCommentId": "Jiu7LqWwRtwh4YYE9", "user": {"username": "Matt_Wage"}}, {"_id": "wZucpqk9Pdmra6PWM", "postedAt": "2014-01-05T18:37:00.000Z", "postId": "JdK4CeErZGhnaSxgB", "htmlBody": "<p>I don't know about the appropriate legal hurdles, but if you wanted to scale this, you would set it up as a loan with a reasonable interest rate rather than a gift. That way the individual needs to trust the central body which is making the loan (that it will use the money raised for good ends), rather than the central body trusting the individual. This is a much lower bar to cross.</p>\n", "parentCommentId": "FQRK98CnQQZduZLyv", "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "s3vc6AKg4FHP3Dka2", "postedAt": "2014-03-13T23:09:00.000Z", "postId": "JdK4CeErZGhnaSxgB", "htmlBody": "<p><blockquote>This expenditure is also pretty lumpy, and I don’t expect them to get all their donations from small individual donations, so it seems to me that donating 1/50th of the cost of a program manager isn’t as good as 1/50th of the value of a program manager.</blockquote></p><p>Carl Shulman explores the implications of this claim <a href=\"http://reflectivedisequilibrium.blogspot.co.uk/2014/01/if-big-donors-have-much-better.html\">in this post</a>.</p>", "parentCommentId": null, "user": {"username": "Pablo_Stafforini2"}}, {"_id": "f8QtLMJwrJvDES6bQ", "postedAt": "2014-03-17T03:47:00.000Z", "postId": "JdK4CeErZGhnaSxgB", "htmlBody": "<p>&quot;Why not make a long odds bet with a wealthy counterparty or use high-risk derivatives to get a chance at making the large donation? In principle, economies of scale like this should always be subject to circumvention at modest cost.&quot;</p><p>Yes, as Paul Christiano <a href=\"http://rationalaltruist.com/2013/05/10/what-is-the-return-on-giving/\">writes</a>,</p><p><blockquote>In principle some opportunities might only be accessible for big donors. $1B might go more than a thousand times farther than $1M. But if we are really only interested in expectations, then we can always just take a 1000:1 bet and turn our $1M into a 1/1000 chance of $1B. This guarantees that there are no increasing returns to money.</blockquote></p>", "parentCommentId": "Jiu7LqWwRtwh4YYE9", "user": {"username": "Pablo_Stafforini2"}}]