[{"_id": "7NvkNsfsxyFsvDzks", "postedAt": "2018-03-03T18:19:38.277Z", "postId": "JDM2tgaxJMujP5D7H", "htmlBody": "<p>Great work!</p>\n<p>I wonder how indicative household income or &quot;typical wealth&quot; is for the prospects of fund-raising though (at least when you are comparing relatively wealthy developed countries to each other). This depends, no doubt, on precisely how you are fundraising, which in turn begs the question of how you (or EAs in general) should be fundraising. If one were to focus more on HNWs or trying to change the culture/institutions associated with giving more generally (e.g. via workplace giving and/or nudging people, companies or the government to give to more effective charities), rather than general/mass fundraising from the typical income household (it's not entirely clear what your methods are), then other figures might be more relevant (the number of HNWs/UHNWs, the culture of giving etc.). None of this suggests that working in Norway is a bad idea (I suspect it performs well on multiple different metrics), but other metrics might be more informative.</p>\n<p>More generally, if EAs can be expected to reliably get this kind of fundraising venture to work, then comparing Norway to the US/Germany/Switzerland may not be so important: plausibly we should just be encouraging EAs to trial this across a fairly wide array of countries.</p>\n", "parentCommentId": null, "user": {"username": "David_Moss"}}, {"_id": "eM3g5kX3u5pmvfRRF", "postedAt": "2018-03-06T16:57:33.963Z", "postId": "JDM2tgaxJMujP5D7H", "htmlBody": "<p>We are working on all the strategies you mention in Norway.\nThere was recently a report posted on the potential of CSR (which I imagine is what you mean by &quot;workplace giving&quot;) in Norway (<a href=\"http://effective-altruism.com/ea/1js/project_report_on_the_potential_of_norwegian/)\">http://effective-altruism.com/ea/1js/project_report_on_the_potential_of_norwegian/)</a>.</p>\n<p>There is also work being done in political action, both on improving the efficiency of our substantial foreign aid budget (~4.4 billion USD in 2017) and some preliminary work on prioritization of future generations.</p>\n", "parentCommentId": "7NvkNsfsxyFsvDzks", "user": {"username": "HakonHarnes"}}, {"_id": "SHGoo98avsz5dRukN", "postedAt": "2018-03-06T17:31:45.250Z", "postId": "JDM2tgaxJMujP5D7H", "htmlBody": "<p>By workplace giving I had in mind things more like outreach in workplaces, payroll giving etc. (see Charity Science's old report on this: <a href=\"http://www.charityscience.com/uploads/1/0/7/2/10726656/workplace_giving_report_pdf.pdf)\">http://www.charityscience.com/uploads/1/0/7/2/10726656/workplace_giving_report_pdf.pdf)</a>. CSR would fall under what I referred to as nudging companies. (I did read the earlier report on CSR in Norway btw, and had forwarded it to a colleague working on CSR and EA). </p>\n", "parentCommentId": "eM3g5kX3u5pmvfRRF", "user": {"username": "David_Moss"}}, {"_id": "hG98irmkgsc2pJfXk", "postedAt": "2018-03-25T12:43:39.818Z", "postId": "JDM2tgaxJMujP5D7H", "htmlBody": "<p>Thanks for the writeup, I was not aware of the Effect Foundation before now.</p>\n<p>After reading the above I am still not sure exactly what kind of outreach you perform. Could you give me a quick rundown of how you think you influenced the donations, and what you plan to continue doing going forwards?</p>\n", "parentCommentId": null, "user": {"username": "Alex_Barry"}}, {"_id": "XGp97QXAsWDqqHugN", "postedAt": "2018-04-06T20:55:51.561Z", "postId": "JDM2tgaxJMujP5D7H", "htmlBody": "<p>As of now it is quite low effort. We got a website that works like a donation portal providing information about GW orgs in Norwegian, general arguments for why one should give effectively and transparent information about the Effect Foundation. The main value here is the information is provided in Norwegian and that we support Norwegian payment methods. These payment methods are no or low fees so there are some savings in transaction cost by donating through us rather than directly.</p>\n<p>In addition to the website we use Facebook to promote the organizations and effective giving, and we use the new facebook fundraising feature. Also we have a promotional video shown on national television 1-2 days a year(<a href=\"http://effective-altruism.com/ea/l0/eacommersials_on_national_tv_in_norway_for_free/)\">http://effective-altruism.com/ea/l0/eacommersials_on_national_tv_in_norway_for_free/)</a>.</p>\n<p>We have experimented with donor events (AMF visited Oslo last year for a talk and get together at a pub afterwards) and reaching out to companies and their CSR-projects (<a href=\"http://effective-altruism.com/ea/1js/project_report_on_the_potential_of_norwegian/)\">http://effective-altruism.com/ea/1js/project_report_on_the_potential_of_norwegian/)</a>.</p>\n", "parentCommentId": "hG98irmkgsc2pJfXk", "user": {"username": "Jorgen_Ljones"}}, {"_id": "vDCMs8AEtJAMAwjov", "postedAt": "2018-04-07T14:33:47.765Z", "postId": "JDM2tgaxJMujP5D7H", "htmlBody": "<p>Ah great, thanks for the response!</p>\n", "parentCommentId": "XGp97QXAsWDqqHugN", "user": {"username": "Alex_Barry"}}]