[{"_id": "qYxCkxQgFXHMCSNWW", "postedAt": "2018-06-04T19:21:26.790Z", "postId": "JdqHvyy2Tjcj3nKoD", "htmlBody": "<p>Is this real life? This is mindblowingly cool. I wish I had the option to study here when I was younger. </p>\n", "parentCommentId": null, "user": {"username": "deluks917"}}, {"_id": "gCrgkdYFuZk3wr7KG", "postedAt": "2018-06-04T21:59:47.125Z", "postId": "JdqHvyy2Tjcj3nKoD", "htmlBody": "<p>Yeah, this is really cool, good work on this. £45 a month... Just crazy you can by a 17 room hotel in Blackpool for 1/3 the price of a 2 bed flat in London. </p>\n", "parentCommentId": null, "user": {"username": "MichaelPlant"}}, {"_id": "pisAtfRTQfCR2MZqm", "postedAt": "2018-06-04T22:07:37.132Z", "postId": "JdqHvyy2Tjcj3nKoD", "htmlBody": "<p>&quot;is £25/week enough for phone, laptop, clothes, travel, entertainment, and all other non-food-or-housing expenditure&quot;\nNo, but that's probably okay. I have a friend who received a similarly stipend during an internship and supplemented it with savings. </p>\n<p>I'd expect people to want to travel occasionally for personal reasons (eg home for Christmas) and need to occasionally pay for new phones or laptops (several hundred pounds, once every couple years). They might also find something like Spotify Premium, Netflix, or Headspace useful. The point is, £25 a week is unrealistic for a middle class Brit, but again, I think it's fine to expect people to freelance or use savings for these extra expenses. </p>\n", "parentCommentId": null, "user": {"username": "Khorton"}}, {"_id": "FZZgFQEPBebWjkyma", "postedAt": "2018-06-04T22:15:51.631Z", "postId": "JdqHvyy2Tjcj3nKoD", "htmlBody": "<p>Hey Greg, this is a super interesting project - I really hope it takes off. Some thoughts on your essay:</p>\n<p>1) Re the hotel name, I feel like this should primarily be made with the possibility of paying non-EAs in mind. EAs will - I hope - hear of the project by reputation rather than name, so the other guests are the ones you're most likely to need make a strong first impression on. 'Effective Altruism Hotel' definitely seems poor in that regard - 'Athena' seems ok (though maybe there's some benefits to renaming for the sake of renaming if the hotel was failing when you bought it)</p>\n<p>2) &gt; Another idea for empty rooms is offering outsiders the chance to purchase a kind of “catastrophic risk insurance”; paying, say, £1/day to reserve the right to live at the hotel in the event of a global (or regional) catastrophe. </p>\n<p>This seems dubious to me (it's the only point of your essay I particularly disagreed with). It's a fairly small revenue stream for you, but means you're attracting people who're that little bit more willing to spend on their own self-interest (ie that little bit less altruistic), and penalises people who just hadn't heard of the project. Meanwhile, in the actual event, what practical effect would it have? Would you turn away people who showed up early when the sponsors arrived for their room?</p>\n<p>If you want an explicit policy on using it as a GCR shelter, it seems like 'first come first served' would be at least as meritocratic, require less bureaucracy and offer a much more enforceable Schelling point.</p>\n<p>3) As you say, I think this will be more appealing the more people it has involved from the beginning,  so I would suggest aggressively marketing the idea in all EA circles which seem vaguely relevant, subject to the agreement of the relevant moderators - not that high a proportion of EAs read this forum, and of those who do, not that many will see this post. It's a really cool idea that I hope people will talk about, but again they'll do so a lot more if it's already seen as a success.</p>\n<p>4) You describe it in the link, but maybe worth describing the Trustee role where you first mention it - or at least linking to it at that point.</p>\n", "parentCommentId": null, "user": {"username": "Arepo"}}, {"_id": "ZjR4wPWorRnK5Hk6C", "postedAt": "2018-06-04T22:29:42.197Z", "postId": "JdqHvyy2Tjcj3nKoD", "htmlBody": "<p>I agree with all of these points, esp #2. </p>\n", "parentCommentId": "FZZgFQEPBebWjkyma", "user": {"username": "Khorton"}}, {"_id": "K8Kxiqh3P5EmsdLiv", "postedAt": "2018-06-05T13:13:07.219Z", "postId": "JdqHvyy2Tjcj3nKoD", "htmlBody": "<p>Kudos for doing this. The main piece of advice which comes to mind is to make sure to push this via university EA groups. I don't think you explicitly identified students as a target demographic in your post, but current students and new grads have the three traits which make the hotel such an attractive proposition: they're unusually time-rich, cash-poor, and willing to relocate.</p>\n", "parentCommentId": null, "user": {"username": "richard_ngo"}}, {"_id": "dSfr3ArMX7cHMRRaE", "postedAt": "2018-06-05T22:07:41.196Z", "postId": "JdqHvyy2Tjcj3nKoD", "htmlBody": "<p>Hey, thanks for the comments.</p>\n<p>1) Think it's fine to leave it as the Athena. Keeps things simple. The hotel wasn't failing as such, more that the previous owners have now retired and for a while had been happy to just have old regulars stay. The few public reviews it has are good.</p>\n<p>2) You're probably right about &quot;first come first served&quot; being best for use of the hotel as a GCR shelter. Realistically, I wouldn't expect many EAs to make it to Blackpool from elsewhere in such an event, but they would be welcome.</p>\n<p>3) I don't want to personally spam it too much, but I'd be grateful if others promote it to various groups they think are relevant. Especially UK groups (so far there haven't been that many UK people interested. Maybe something to do with the North-South divide?), and uni groups (as Richard mentions below).</p>\n<p>4) Have added in footnote [7a].</p>\n", "parentCommentId": "FZZgFQEPBebWjkyma", "user": {"username": "Greg_Colbourn"}}, {"_id": "AMkyCn3Q7mW6eFtzG", "postedAt": "2018-06-05T22:13:29.092Z", "postId": "JdqHvyy2Tjcj3nKoD", "htmlBody": "<p>Good idea! Happy for anyone to promote it to any EA uni groups they are involved with. I can be on hand to comment/answer questions if added/tagged in posts on Facebook (or otherwise notified if elsewhere).</p>\n", "parentCommentId": "K8Kxiqh3P5EmsdLiv", "user": {"username": "Greg_Colbourn"}}, {"_id": "JajSSn7FQyjJ8W5ot", "postedAt": "2018-06-05T22:42:02.990Z", "postId": "JdqHvyy2Tjcj3nKoD", "htmlBody": "<p>Bravo!</p>\n<p>I'm not so sure whether this is targetting the narrowest constraint for developing human capital in EA, but I'm glad this is being thrashed out in reality rather than by the medium of internet commentary.</p>\n<p>A more proximal worry is this. The project seems to rely on finding a good hotel manager. On the face of it, this looks like a pretty unattractive role for an EA to take on: it seems the sort of thing that demands quite a lot of operations skill, altready in short supply - further, 20k is just over half the pay of similar roles in the private sector (and below many unis typical grad starting salary), I imagine trying to run a hotel (even an atypical one) is hard and uninspiring work with less of the upsides the guests will enjoy, and you're in a depressed seaside town.</p>\n<p>Obviously, if there's already good applicants, good for them (and us!), and best of luck going forward.</p>\n", "parentCommentId": null, "user": {"username": "Gregory_Lewis"}}, {"_id": "yESANzRb9Kbbnf2YH", "postedAt": "2018-06-05T22:50:26.706Z", "postId": "JdqHvyy2Tjcj3nKoD", "htmlBody": "<p>I did factor in a £200 flight home once a year and mid-price phone contracts and laptops (just realised that the budget spreadsheet wasn't visible with the link before; it should be now). Netflix premium (£9.99/month) allows 4 simultaneous streams, so perhaps there could be one or two hotel accounts (I'm hoping to keep the hotel TV-free though, so there are no actual TVs). Doesn't look like Spotify has anything equivalent (but really, there is Soundcloud; and pretty much any music you can think of is on YouTube, and there are ways to play it ad free and in the background from a phone). But yes, I do expect that some people will want some over-budget luxuries, which they will hopefully be able to otherwise pay for. </p>\n<p>Although of course it would be somewhat problematic if someone was spending a lot of their own money on extra luxuries (say they were spending an additional £5k/year. As mentioned in the OP with the digital nomad example, the cost-effectiveness of their funding would effectively be halved).</p>\n", "parentCommentId": "pisAtfRTQfCR2MZqm", "user": {"username": "Greg_Colbourn"}}, {"_id": "XMa2e5zTwCfhKdcoG", "postedAt": "2018-06-05T23:05:44.652Z", "postId": "JdqHvyy2Tjcj3nKoD", "htmlBody": "<p>Maybe I should stress more the fact that the Hotel Manager will get to hang out with loads of cool EAs and make them happy (the number of cool EAs, and their happiness, being somewhat correlated to how well a job they do as Manager). £20k is not bad for Blackpool. And given they also have free accommodation and board too, they should have quite a bit left over to save/donate.</p>\n", "parentCommentId": "JajSSn7FQyjJ8W5ot", "user": {"username": "Greg_Colbourn"}}, {"_id": "m5frmxg9kXvK99E7K", "postedAt": "2018-06-05T23:08:20.194Z", "postId": "JdqHvyy2Tjcj3nKoD", "htmlBody": "<p>The biggest risk seems to be in the hotel manager position. My guess is there is underestimation of the learning curve and ongoing maintenance costs/time to run a 17 person hotel.</p>\n", "parentCommentId": null, "user": {"username": "RomeoStevens"}}, {"_id": "s8LaxWd9RyuY5WfeL", "postedAt": "2018-06-06T00:09:07.995Z", "postId": "JdqHvyy2Tjcj3nKoD", "htmlBody": "<p>Yes, the goal is to simplify and streamline things as much as possible (e.g. self-service buffet for breakfasts and lunches, 1 or 2 option set menus for dinners, trolleys and trays for clearing/dishwashing, bulk buying of nearly all supplies - pretty much everything apart from salad veg and fruit - on a 6-8 week basis (large freezer), contracted out cleaning, bed linen/towel laundering and building repairs, automated booking systems, all-digital financial transactions, etc). Although I'm sure the planning fallacy will no doubt still strike. If need be, more volunteer time could be used, or the weekend manager could up their hours to add some in the week too (I have budgeted for a part-time salaried Weekend Manager, but have not made an ad for it yet. Priority is filling the full-time role).</p>\n", "parentCommentId": "m5frmxg9kXvK99E7K", "user": {"username": "Greg_Colbourn"}}, {"_id": "p2wpemi4rQfeGcAWC", "postedAt": "2018-06-06T00:34:23.348Z", "postId": "JdqHvyy2Tjcj3nKoD", "htmlBody": "<p>I love this idea with so many 😍emojis</p>\n", "parentCommentId": null, "user": {"username": "Luke Freeman"}}, {"_id": "aFRSb6EfwmHZpNz6g", "postedAt": "2018-06-06T00:44:28.777Z", "postId": "JdqHvyy2Tjcj3nKoD", "htmlBody": "<p>This is so great - are you aware of any similar projects in the States?</p>\n", "parentCommentId": null, "user": {"username": "SamSilver"}}, {"_id": "dxjGa9tjGYPDyNZJa", "postedAt": "2018-06-06T00:46:08.573Z", "postId": "JdqHvyy2Tjcj3nKoD", "htmlBody": "<p>Greg, this is fantastic. Congratulations on  everything involved in making this a reality. I&#x27;m sure many of us will head over for a visit to collaborate and build community (I especially appreciate the handy google calendar!). </p>", "parentCommentId": null, "user": {"username": "NickFitz"}}, {"_id": "8dzdhJTPWoRa7XnqR", "postedAt": "2018-06-06T01:09:29.516Z", "postId": "JdqHvyy2Tjcj3nKoD", "htmlBody": "<p>This is terrific - thanks for taking steps to make this a reality! Excited to see what wonderful things come out of the people who are staying there.</p>\n", "parentCommentId": null, "user": {"username": "arikagan"}}, {"_id": "rRXsW9xqZ6Jo6vkcF", "postedAt": "2018-06-06T03:16:01.394Z", "postId": "JdqHvyy2Tjcj3nKoD", "htmlBody": "<p>Is the main value of this coordination to cause EAs to live together in a group? Or is it causing poor EAs to be able to do direct work without having to build up savings first?</p>\n<p>If the former, it's unclear to me why there would only be value in grouping together EAs who don't have much money/income (would getting other EAs with money to live together not be equally as valuable?).</p>\n<p>And if it's the latter, it's unclear to me why this idea would be better than just funding poor EAs directly and letting them decide where to live -- e.g. Alex K. Chen has proposed that paying for talented young people with high potential to live in the Harvard/MIT area so they could unschool themselves there is potentially very high value.</p>\n", "parentCommentId": null, "user": {"username": "WilliamKiely"}}, {"_id": "Q7Mt2xjLHC3dLjQmj", "postedAt": "2018-06-06T03:35:32.559Z", "postId": "JdqHvyy2Tjcj3nKoD", "htmlBody": "<p>Alex K Chen says: &quot;You should like talk to people who do summer camp housing too, like SPARC&quot; <a href=\"https://sparc-camp.org/\">https://sparc-camp.org/</a></p>\n", "parentCommentId": null, "user": {"username": "WilliamKiely"}}, {"_id": "GcKkRLMm4mZp9wswb", "postedAt": "2018-06-06T03:45:58.896Z", "postId": "JdqHvyy2Tjcj3nKoD", "htmlBody": "<blockquote>\n<p>And if it's the latter, it's unclear to me why this idea would be better than just funding poor EAs directly and letting them decide where to live</p>\n</blockquote>\n<p>That would cost much more per person. With that cost would come an expectation of filtering and grant proposals, which would keep out a lot of people who might otherwise use this to do good things.</p>\n", "parentCommentId": "rRXsW9xqZ6Jo6vkcF", "user": {"username": "jimrandomh"}}, {"_id": "nvPZseoLjssx98uu9", "postedAt": "2018-06-06T03:59:19.828Z", "postId": "JdqHvyy2Tjcj3nKoD", "htmlBody": "<p>Good point. Do you think EAs with more money ought to consider living in group houses for the sake of reducing the cost of living to enable them to donate more?</p>\n", "parentCommentId": "GcKkRLMm4mZp9wswb", "user": {"username": "WilliamKiely"}}, {"_id": "5B9nbbL5PESqFp2rq", "postedAt": "2018-06-06T12:26:37.038Z", "postId": "JdqHvyy2Tjcj3nKoD", "htmlBody": "<blockquote>\n<p>only be value in grouping together EAs who don't have much money/income </p>\n</blockquote>\n<p>The hotel is open to anyone who wants to live frugally. Ideally EAs with money would pay their own way (i.e. the cost price of their stay). (In the event of demand outstripping supply, precedence will be given to EAs who don't have money/income though). Also EAs with means are welcome to form their own group houses in the nearby area.</p>\n<blockquote>\n<p>just funding poor EAs directly and letting them decide where to live</p>\n</blockquote>\n<p>The umbrella charity being formed will be open to funding EAs to live at similar costs in other places (as mentioned in OP, SE Asia is a possibility). A key metric is how much working time you are buying with the amount granted. As jimrandomh says, funding people at a higher level places higher expectations and demands on applicants (and there are prestigious and selective grants people can already apply for).</p>\n", "parentCommentId": "rRXsW9xqZ6Jo6vkcF", "user": {"username": "Greg_Colbourn"}}, {"_id": "cLjTgak2fJajBSbTB", "postedAt": "2018-06-06T12:57:48.345Z", "postId": "JdqHvyy2Tjcj3nKoD", "htmlBody": "<p>I've just looked over the budget (<a href=\"https://docs.google.com/spreadsheets/d/1bTwMRAD4TQjvHZ0eRCsN4uFdN5Se4zdcP1ikFOKj6-4/edit?usp=sharing)\">https://docs.google.com/spreadsheets/d/1bTwMRAD4TQjvHZ0eRCsN4uFdN5Se4zdcP1ikFOKj6-4/edit?usp=sharing)</a>. I really like how thorough and detailed it is. I am concerned that it may be overly optimistic, though - I'm sure other expenses will come up. For example, here are some things I use regularly that I don't see money set aside for:</p>\n<p>-Tampons</p>\n<p>-Medications (prescription or not)</p>\n<p>-Razors</p>\n<p>-Moisturizer/lotion</p>\n<p>-Sunblock</p>\n<p>-Contact lenses and solution</p>\n<p>-Stationery</p>\n<p>-Haircuts</p>\n", "parentCommentId": "yESANzRb9Kbbnf2YH", "user": {"username": "Khorton"}}, {"_id": "vLtqSuEh7ZPm7jwYT", "postedAt": "2018-06-06T16:56:20.295Z", "postId": "JdqHvyy2Tjcj3nKoD", "htmlBody": "<p>First, big kudos for your strong commitment to put your personal funding into this, and for the guts and drive to actually make it happen!</p>\n<p>That said, my overall feelings about the project are mixed, mainly for the following reasons (which you also partly discuss in your post):</p>\n<p>It seems plausible that most EAs who do valuable work won't be able to benefit from this. If they're students, they'll most likely be studying at a university outside Blackpool and might not be able to do so remotely. If they're launching a new great project, they'll very likely be able to get funding from an EA donor, and there will be major benefits from being in a big city or existing hub such as Oxford, London, or the Bay (so donors should be enthusiastic about covering the living costs of these places). While it's really impressive how low the rent at the hotel will be, rent cost is rarely a major reason for a project's funding constraints (at least outside the SF Bay Area).</p>\n<p>Instead, the hotel could become a hub for everyone who doesn't study at a university or work on a project that EA donors find worth funding, i.e. the hotel would mainly support work that the EA community as a whole would view as lower-quality. I'm not saying I'm confident this will happen, but I think the chance is non-trivial without the leadership and presence of highly experienced EAs (who work there as e.g. hotel managers / trustees).</p>\n<p>Furthermore, people have repeatedly brought up the argument that the first &quot;bad&quot; EA project in each area can do more harm than an additional &quot;good&quot; EA project, especially if you consider tail risks, and I think this is more likely to be true than not. E.g. the first political protest for AI regulation might in expectation do more harm than a thoughtful AI policy project could prevent. This provides a reason for EAs to be risk-averse. (Specifically, I tentatively disagree with your claims that &quot;we’re probably at the point where there are more false negatives than false positives, so more chances can be taken on people at the low end&quot;, and that we should invest &quot;a small amount&quot;.) Related: Spencer Greenberg's idea that <a href=\"https://80000hours.org/podcast/episodes/spencer-greenberg-social-science/\">plenty of startups cause harm</a>.</p>\n<p>The fact that this post got way more upvotes than other projects that are similarly exciting in my view (such as <a href=\"http://effective-altruism.com/ea/1pj/introducing_charity_entrepreneurship_an/\">Charity Entrepreneurship</a>) also makes me think that the enthusiasm for this project may be partly driven by social reasons (it feels great to have a community hotel hub with likeminded people) as opposed to people's impact assessments. But maybe there's something I'm overlooking, e.g. maybe this post was just shared much more on social media.</p>\n<p>What happens if you concentrate a group of EAs who wouldn't get much funding from the broader community in one place and help them work together? I don't know. It could be very positive or very negative. Or it just couldn't lead to much at all. Overall, I think it may not be worth the downside risks.</p>\n", "parentCommentId": null, "user": {"username": "Jonas Vollmer"}}, {"_id": "PhynMbodGriuW7Axi", "postedAt": "2018-06-06T17:47:11.971Z", "postId": "JdqHvyy2Tjcj3nKoD", "htmlBody": "<p>I sypathise with Gregory (Lewis') point and it not being an attractive role for an EA. It might work better if billed as a short duration role, possibily for someone who wants to develop operational experience to do so in another EA org. </p>\n", "parentCommentId": "XMa2e5zTwCfhKdcoG", "user": {"username": "MichaelPlant"}}, {"_id": "gYFbKfskCSGjXFwfk", "postedAt": "2018-06-06T17:49:40.175Z", "postId": "JdqHvyy2Tjcj3nKoD", "htmlBody": "<blockquote>\n<p>Furthermore, people have repeatedly brought up the argument that the first &quot;bad&quot; EA project in each area can do more harm than an additional &quot;good&quot; EA project, especially if you consider tail risks, and I think this is more likely to be true than not. E.g. the first political protest for AI regulation might in expectation do more harm than a thoughtful AI policy project could prevent. This provides a reason for EAs to be risk-averse. (Specifically, I tentatively disagree with your claims that &quot;we’re probably at the point where there are more false negatives than false positives, so more chances can be taken on people at the low end&quot;, and that we should invest &quot;a small amount&quot;.) Related: Spencer Greenberg's idea that plenty of startups cause harm.</p>\n</blockquote>\n<p>I thought this was pretty vague and abstract. You should say why you expect this particular project to suck!</p>\n<blockquote>\n<p>It seems plausible that most EAs who do valuable work won't be able to benefit from this. If they're students, they'll most likely be studying at a university outside Blackpool and might not be able to do so remotely</p>\n</blockquote>\n<p>I also wonder what the target market is. EA doing remote work? EAs need really cheap accommodation for certain time?</p>\n", "parentCommentId": "vLtqSuEh7ZPm7jwYT", "user": {"username": "MichaelPlant"}}, {"_id": "ahcsKNoAWyRrrtjNT", "postedAt": "2018-06-06T17:51:33.468Z", "postId": "JdqHvyy2Tjcj3nKoD", "htmlBody": "<p>A potential spanner: how would you restrict this to EAs? Is that legal? I doubt you can refuse service to people on the basis of what would be considerd an irrelevant characteristic. Analogy: could you have a hotel only for people of a certain race or sex?</p>\n", "parentCommentId": null, "user": {"username": "MichaelPlant"}}, {"_id": "aRPKkaqxmyQM89eCi", "postedAt": "2018-06-06T18:37:43.071Z", "postId": "JdqHvyy2Tjcj3nKoD", "htmlBody": "<p>Wow, this is absolutely stunning. I can't myself participate, but I genuinely hope this project takes off. I'm sure you're familiar with the famous (but not demolished) Building 20 at MIT: <a href=\"https://en.wikipedia.org/wiki/Building_20\">https://en.wikipedia.org/wiki/Building_20</a>. It provided a space for interdisciplinary work -- and wow, the results were truly amazing.</p>\n", "parentCommentId": null, "user": {"username": "philosophytorres"}}, {"_id": "Av2A5CXeiwoFWdupQ", "postedAt": "2018-06-06T21:16:44.894Z", "postId": "JdqHvyy2Tjcj3nKoD", "htmlBody": "<blockquote>\n<p>I thought this was pretty vague and abstract. You should say why you expect this particular project to suck!</p>\n</blockquote>\n<p>I wasn't making a point about this particular project, but about all the projects this particular project would help.</p>\n", "parentCommentId": "gYFbKfskCSGjXFwfk", "user": {"username": "Jonas Vollmer"}}, {"_id": "YbuDgnsoTaBp6Do6R", "postedAt": "2018-06-06T22:29:40.739Z", "postId": "JdqHvyy2Tjcj3nKoD", "htmlBody": "<p>I forgot to include this in the Google forum I filled, so I wanted to come back and comment on this. Are you going to help EAs with student loan debt on their payments? I know that many people, including myself, have a few hundred dollars a month that we have to pay, and being without income for a long period of time could make this a non-option for them. Alternatives like deferments could potentially be used, but it's an area that should be explored at least.</p>\n", "parentCommentId": null, "user": {"username": "branperr"}}, {"_id": "H3Ty5RkrfyBwk48TF", "postedAt": "2018-06-07T09:19:36.452Z", "postId": "JdqHvyy2Tjcj3nKoD", "htmlBody": "<blockquote>\n<p>If they're launching a new great project, they'll very likely be able to get funding from an EA donor</p>\n</blockquote>\n<p>EA Grants rejected <a href=\"http://effective-altruism.com/ea/1fc/effective_altruism_grants_project_update/\">95%</a> of the applications they got.</p>\n", "parentCommentId": "vLtqSuEh7ZPm7jwYT", "user": {"username": "John_Maxwell_IV"}}, {"_id": "uLHQZeYmyYY572bGD", "postedAt": "2018-06-07T10:54:19.695Z", "postId": "JdqHvyy2Tjcj3nKoD", "htmlBody": "<p>I think it's important for the manager to be at least a medium-term position. Familiarity with the guests, culture, operations, building and location will make things run more smoothly (having new people take up the role every few months would be quite disruptive). There is also a lot of scope in the job for development - building and refining systems, assisting guests with their work/plans, assisting in developing the ideas behind the project, franchising to other locations (/supporting &quot;digital nomads&quot;).</p>\n<p>So yes, it could be seen as a stepping stone to working in ops at a more established EA org. But it could equally be seen as getting in at the bottom and building a new EA org.</p>\n", "parentCommentId": "PhynMbodGriuW7Axi", "user": {"username": "Greg_Colbourn"}}, {"_id": "tmYS4MrszP5fAi4w3", "postedAt": "2018-06-07T12:20:09.290Z", "postId": "JdqHvyy2Tjcj3nKoD", "htmlBody": "<p>Is there any particular reason why the role needs to be filled by an EA? I think we as a community are too focused on hiring internally in general, and in this case almost no engagement with the ideas of EA seems like it would necessary - they just need to be good at running a hotel (and ok with working around a bunch of oddballs).</p>\n", "parentCommentId": "PhynMbodGriuW7Axi", "user": {"username": "Arepo"}}, {"_id": "TyakDq6Lvd5u28s9M", "postedAt": "2018-06-07T14:38:26.026Z", "postId": "JdqHvyy2Tjcj3nKoD", "htmlBody": "<p>You're right; I have increased the &quot;Misc/Other&quot; category to £200/year, and added an item for &quot;Pharmacy&quot; (£5/month)*. This ups the stipend to £30/week (increasing baseline costs 5% to ~£5700/person/year [EDIT 06 July 2018: have updated the OP to reflect this]). If in practice people are consistently running out of money covering their basic expenses it can be reviewed. I do want to try and keep the baseline costs as low as possible though, rather than have a higher amount to cover things that not everyone will need. However, as mentioned in the OP, it makes sense to have some kind of hardship/emergency fund (as well as a &quot;career progression&quot; fund for attending events). These would probably be means tested to some degree though.</p>\n<p>*I have got a stock of basic things like toothpaste, toothbrushes, shower gel, shampoo, conditioner, sunblock, sunglasses, eye masks, ear plugs, combs, nail scissors, pain killers, tampons, hay fever tablets, paper and pens etc.</p>\n", "parentCommentId": "cLjTgak2fJajBSbTB", "user": {"username": "Greg_Colbourn"}}, {"_id": "HSBupGRHbCqtoW5p8", "postedAt": "2018-06-07T15:44:17.095Z", "postId": "JdqHvyy2Tjcj3nKoD", "htmlBody": "<p>I think this is something that would come under the &quot;hardship&quot; fund mentioned above. Any kind of debts would probably be best treated as special cases deserving of individual assessment and means testing. (Student debt is not something I've especially considered as in the UK it only has to be paid if you are earning a significant amount, and gets written off after a number of years otherwise, so can basically be better considered as just another form of income tax).</p>\n", "parentCommentId": "YbuDgnsoTaBp6Do6R", "user": {"username": "Greg_Colbourn"}}, {"_id": "k8drNAGjhxo8uY4Mk", "postedAt": "2018-06-07T16:06:26.486Z", "postId": "JdqHvyy2Tjcj3nKoD", "htmlBody": "<p>Thanks! Yes, Building 20 sounded great. It's mentioned in Deep Work, from which I reference the the &quot;hub-and-spoke&quot; model in the OP.</p>\n", "parentCommentId": "aRPKkaqxmyQM89eCi", "user": {"username": "Greg_Colbourn"}}, {"_id": "x7Y5ZCdA2kPLvLjPg", "postedAt": "2018-06-07T16:15:37.927Z", "postId": "JdqHvyy2Tjcj3nKoD", "htmlBody": "<p>I think 80k make a good case for why it's important to have EAs in ops roles <a href=\"https://80000hours.org/articles/operations-management/#why-is-it-important-for-operations-staff-to-share-the-mission-of-effective-altruism]\">here</a>.</p>\n", "parentCommentId": "tmYS4MrszP5fAi4w3", "user": {"username": "Greg_Colbourn"}}, {"_id": "tnAZMctPo2g2sAs9T", "postedAt": "2018-06-07T17:48:58.739Z", "postId": "JdqHvyy2Tjcj3nKoD", "htmlBody": "<blockquote>\n<p>If they're students, they'll most likely be studying at a university outside Blackpool and might not be able to do so remotely.</p>\n</blockquote>\n<p>Regarding studying, it would mainly be suitable for those doing so independently online (it’s possible to take many world class courses on EdX and Coursera for free). But could also be of use to university students outside of term time (say to do extra classes online, or an independent research project, over the summer).</p>\n<blockquote>\n<p>they'll very likely be able to get funding from an EA donor</p>\n</blockquote>\n<p>As John Maxwell says, I don’t think we are there yet with current seed funding options.</p>\n<blockquote>\n<p>the hotel would mainly support work that the EA community as a whole would view as lower-quality</p>\n</blockquote>\n<p>This might indeed be so, but given the much lower costs it’s possible that the quality-adjusted-work-per-£-spent rate could still be equal to - or higher than - the community average.</p>\n<blockquote>\n<p>.. without the leadership and presence of highly experienced EAs (who work there as e.g. hotel managers / trustees).</p>\n</blockquote>\n<p>I think it’s important to have experienced EAs in these positions for this reason.</p>\n<p>Regarding “bad” EA projects, only <a href=\"http://effective-altruism.com/ea/12z/concerns_with_intentional_insights/\">one</a> comes to mind, and it doesn’t seem to have caused much lasting damage. In the OP, I say that the “dynamics of status and prestige in the non-profit world seem to be geared toward being averse to risk-of-failure to a much greater extent than in the for-profit world (see e.g. the high rate of failure for VC funded start-ups). Perhaps we need to close this gap, considering that the bottom line results of EA activity are often considered in terms expected utility.” Are PR concerns a solid justification for this discrepancy between EA and VC? Or do Spencer Greenberg’s concerns about start-ups mean that EA is right in this regard and it’s VC that is wrong (even in terms of their approach to maximising <em>monetary</em> value)?</p>\n<blockquote>\n<p>the enthusiasm for this project may be partly driven by social reasons</p>\n</blockquote>\n<p>There’s nothing wrong with this, as long as people participating at the hotel for largely social reasons pay their own way (and don’t disrupt others’ work).</p>\n", "parentCommentId": "vLtqSuEh7ZPm7jwYT", "user": {"username": "Greg_Colbourn"}}, {"_id": "6meMhjGobGRnWjr9A", "postedAt": "2018-06-07T17:49:15.537Z", "postId": "JdqHvyy2Tjcj3nKoD", "htmlBody": "<blockquote>\n<p>maybe this post was just shared much more on social media.</p>\n</blockquote>\n<p>I see Facebook and Twitter share buttons at the bottom of the post (but only when I load the page on my phone). They currently have the numbers 174 and 18 next to them. Seems like an excessive number of Facebook shares!? Surely that can’t be right? (I’ve only seen - and been tagged on - <em>one</em>, in any case. Clicking on the numbers provides no info. as to where the shares went, if indeed they are shares. Ok, actually, clicking on them brings up a share window, but also ups the counter! So maybe that explains a lot as to why the numbers are so high (i.e. people wanting to see where all these shares are going, but only adding to the false counter)).</p>\n", "parentCommentId": "vLtqSuEh7ZPm7jwYT", "user": {"username": "Greg_Colbourn"}}, {"_id": "7LvmKAWFM4RZXJdX9", "postedAt": "2018-06-07T21:58:12.898Z", "postId": "JdqHvyy2Tjcj3nKoD", "htmlBody": "<p>Several of the reasons listed in that article don't matter for the hotel because the hotel manager will be the only full time member of staff. For example, the hotel manager won't be likely to switch into other roles/be promoted at the same organization and won't need to communicate with other staff about EA-specific things. Additionally, the article suggests that being involved in the EA community is a benefit, but not the only thing to consider when hiring. That sounds about right to me.</p>\n<p>I would seriously consider splitting up the hotel manager role and the community mentory person. It's hard enough to find an awesome cook who can do 17 people's laundry, keep everything clean, pay all the bills, and keep everything legal. Requiring them to be one of a couple thousand EAs IN THE WORLD sounds really hard. </p>\n", "parentCommentId": "x7Y5ZCdA2kPLvLjPg", "user": {"username": "Khorton"}}, {"_id": "uj43yjbK8Bkvj2BXt", "postedAt": "2018-06-08T11:19:54.975Z", "postId": "JdqHvyy2Tjcj3nKoD", "htmlBody": "<blockquote>\n<p>the hotel manager won't be likely to switch into other roles/be promoted at the same organization</p>\n</blockquote>\n<p>But they would be in at the ground level of a new organisation that could potentially grow (if the model is franchised, or expands to supporting digital nomads). It should be seen as an exciting opportunity to co-create and mould an institution.</p>\n<blockquote>\n<p>and won't need to communicate with other staff about EA-specific things.</p>\n</blockquote>\n<p>But they will need to communicate with lots of EA guests about EA-specific things.</p>\n<blockquote>\n<p>splitting up the hotel manager role and the community mentory person.</p>\n</blockquote>\n<p>I'm open to doing this as a plan B. A good manager should be able to optimise/outsource the tasks they find tedious though.</p>\n", "parentCommentId": "7LvmKAWFM4RZXJdX9", "user": {"username": "Greg_Colbourn"}}, {"_id": "ce2a6rKK8Z37ZM9my", "postedAt": "2018-06-08T16:23:41.599Z", "postId": "JdqHvyy2Tjcj3nKoD", "htmlBody": "<p>Sure, but an EA hotel seems like a weird way to address this inefficiency: only few people with worthwhile projects can move to Blackpool to benefit from it, the funding is not flexible, it's hard to target this well, the project has some time lag, etc. The most reasonable approach to fixing this is simply to give more money to some of the projects that didn't get funded.</p>\n<p>Maybe CEA will accept 20-30% of EA Grants applications in the next round, or other donors will jump in to fill the gaps. (I'd expect that a lot of the grants applications (maybe half) might have been submitted by people not really familiar with EA, and some of the others weren't worth funding.)</p>\n", "parentCommentId": "H3Ty5RkrfyBwk48TF", "user": {"username": "Jonas Vollmer"}}, {"_id": "EYF4mkyZcjDfGYb4Q", "postedAt": "2018-06-08T16:30:16.752Z", "postId": "JdqHvyy2Tjcj3nKoD", "htmlBody": "<blockquote>\n<p>Regarding “bad” EA projects, only one comes to mind, and it doesn’t seem to have caused much lasting damage. In the OP, I say that the “dynamics of status and prestige in the non-profit world seem to be geared toward being averse to risk-of-failure to a much greater extent than in the for-profit world (see e.g. the high rate of failure for VC funded start-ups). Perhaps we need to close this gap, considering that the bottom line results of EA activity are often considered in terms expected utility.” Are PR concerns a solid justification for this discrepancy between EA and VC? Or do Spencer Greenberg’s concerns about start-ups mean that EA is right in this regard and it’s VC that is wrong (even in terms of their approach to maximising monetary value)?</p>\n</blockquote>\n<p>Just wanted to flag that I disagree with this for a number of reasons. E.g. I think some of EAF's sub-projects probably had negative impact, and I'm skeptical that these plus InIn were the only ones. I might write an EA forum post about how EA projects can have negative impacts at some point but it's not my current priority. See also this <a href=\"https://www.facebook.com/groups/effective.altruists/permalink/1722174211172262/?comment_id=1722478034475213&amp;reply_comment_id=1734970129892670&amp;comment_tracking=%7B%22tn%22%3A%22R9%22%7D\">facebook comment</a> for some of the ideas.</p>\n<p>Regarding your last point, VCs are maximizing their own profit, but Spencer talks about externalities.</p>\n", "parentCommentId": "tnAZMctPo2g2sAs9T", "user": {"username": "Jonas Vollmer"}}, {"_id": "vBkD2b9gdEDJjejgS", "postedAt": "2018-06-09T00:00:47.691Z", "postId": "JdqHvyy2Tjcj3nKoD", "htmlBody": "<p>[Disclosure: I'm planning to move to Blackpool before the end of this month.]</p>\n<blockquote>\n<p>only few people with worthwhile projects can move to Blackpool to benefit from it, the funding is not flexible</p>\n</blockquote>\n<p>If you're working on a project full-time, there's a good chance you're not location-constrained.</p>\n<blockquote>\n<p>the project has some time lag</p>\n</blockquote>\n<p>I'm not sure what you're referring to.</p>\n<p>Over 3 months passed between the EA grants <a href=\"http://effective-altruism.com/ea/1b5/announcing_effective_altruism_grants/\">announcement</a> and <a href=\"http://effective-altruism.com/ea/1fc/effective_altruism_grants_project_update/\">disbursement</a>.  Does that count as &quot;time lag&quot;?</p>\n<p>The disadvantages you cite don't seem compelling to me alongside the advantages cited in this post: dramatically lower costs, supportive EA community, etc.  Yes, it's not a great fit for every project--but if you're offered a bargain on supporting one project, it seems silly to avoid taking it just because you weren't offered a bargain on supporting some other project.</p>\n<p>I think maybe our core disagreement is that you believe the bottom 95% of EA projects are risky and we should discourage people from funding them.  Does that sound like an accurate summary of your beliefs?</p>\n<p>I've <a href=\"https://www.facebook.com/groups/effective.altruists/permalink/1263971716992516/\">written</a> <a href=\"http://effective-altruism.com/ea/ju/i_am_nate_soares_ama/3zt\">some</a> about why I want to see more discussion of downside risk (and I'm compiling notes for several longer posts--maybe if I was living in Blackpool I'd have enough time to write them).  However, the position that we should discourage funding the bottom 95% of projects seems really extreme to me, and it also seems like a really crude way to address downside risk.</p>\n<p>Even if there is some downside risk from any given project, the expected value is probably positive, solely based on the fact that some EA thinks it's a good idea.  <a href=\"https://www.effectivealtruism.org/articles/the-moral-value-of-information-amanda-askell/\">Value of information</a> is another consideration in favor of taking action, especially doing research (I'm guessing most people who move to Blackpool will want to do research of some sort).</p>\n<p>As for a good way to decrease downside risk, I would like to see a lot more people do what Joey does in <a href=\"http://effective-altruism.com/ea/xj/500_prize_for_anybody_who_can_change_our_current/\">this post</a> and ask people to provide the best arguments they can against their project (or maybe ask a question on <a href=\"https://www.metaculus.com/questions/\">Metaculus</a>).</p>\n<p>The issue with downside risk is not that the world is currently on a wonderful trajectory that must not be disturbed.  Rather, any given disturbance is liable to have effects that are hard to predict--but if we spent more time thinking and did more research, maybe we could get a bit better at predicting these effects.  Loss aversion will cause us to overweight the possibility of a downside, but if we're trying to maximize expected value then we should weight losses and gains of the same size equally.  I'm willing to believe highly experienced EAs are better at thinking about downside risk, but I don't think the advantage is overwhelming, and I suspect being a highly experienced EA can create its own set of <a href=\"http://effective-altruism.com/ea/16g/anonymous_comments/a0p\">blind spots</a>.  I am definitely skeptical that CEA can reliably pick the 33 highest-impact projects from a list of 722.  Even experienced investors miss winners, and CEA is an inexperienced charitable &quot;investor&quot;.</p>\n<p>Your example &quot;the first political protest for AI regulation might in expectation do more harm than a thoughtful AI policy project could prevent&quot; is one I agree with, and maybe it illustrates a more general principle that public relations efforts should be done in coordination with major EA organizations.  Perhaps it makes sense to think about downside risk differently depending on the kind of work someone is interested in doing.</p>\n<p>BTW, if the opinion of experienced EAs is considered reliable, maybe it's worth noting that <a href=\"https://80000hours.org/2014/09/should-you-move-to-thailand/\">80k advocated</a> something like this a few years ago, and ideas like it have been floating around EA for a long time.</p>\n", "parentCommentId": "ce2a6rKK8Z37ZM9my", "user": {"username": "John_Maxwell_IV"}}, {"_id": "SzjK26dRzqYLJnA2Y", "postedAt": "2018-06-09T03:43:26.183Z", "postId": "JdqHvyy2Tjcj3nKoD", "htmlBody": "<p>It's pretty simple: just get EAs to move in and don't advertise vacancies the rest of the time. That might sound sketchy, but I think it's essentially what the old owners did -- they let friends/long-time guests stay but didn't rent out the rest of the rooms. It might not fly in, like, Tahiti, but Blackpool has an enormous glut of accomodation. The impression I got from Greg is that lots of hotel owners there are already restricting occupancy to friends/family; a de-facto restriction to EAs shouldn't be a major problem, especially since (at least in the US) non-EAs are not a protected class. </p>\n<p>Furthermore, if some random person really wants to stay there at inflated rates despite the complete lack of advertising, that would be a net benefit for the hotel, as Greg mentions in his post.</p>\n", "parentCommentId": "ahcsKNoAWyRrrtjNT", "user": {"username": "Liam_Donovan"}}, {"_id": "mz6a7ZcYk4WT2sxXh", "postedAt": "2018-06-10T05:59:29.820Z", "postId": "JdqHvyy2Tjcj3nKoD", "htmlBody": "<p>From my perspective, the manager should </p>\n<ol>\n<li>Not (necessarily) be an EA</li>\n<li>Be paid more (even if this trades off against capacity, etc)</li>\n<li>Not also be a community mentor</li>\n</ol>\n<p>One of the biggest possible failure modes for this project seems to be hiring a not-excellent manager; even a small increase in competence could make a big difference between the project failing and succeeding. Thus, the #1 consideration ought to be &quot;how to maximize the manager's expected skill&quot;. Unfortunately, the combination of undesirable location, only hiring EAs, and the low salary seem to restrict the talent pool enormously. My (perhaps totally wrong) impression is that some of these decisions are made on the basis of a vague idea of how things ought to be, rather than a conscious attempt to maximize success. </p>\n<p>Brief arguments/responses:</p>\n<ul>\n<li><p>Not only are EAs disproportionately unlikely to have operations skills (as 80K points out), but I suspect that the particular role of hotel manager requires even less of the skills we tend to have (such as a flair for optimization), and even more of the skills we tend not to have (consistency, hotel-related <em>metis</em>). I'm unsure of this but it's an important question to evaluate. </p>\n</li>\n<li><p>The manager will only be at the ground floor of a new organization if it doesn't fail. I think failure is more likely than expansion, but it's reasonable to be risk averse considering this is the first project of its kind in EA (diminishing marginal benefit). Consequently, optimizing for initial success seems more important than optimizing for future expansion. </p>\n</li>\n<li><p>The best feasible EA candidate is likely to have less external validation of managerial capability than a similarly qualified external candidate, who might be a hotel manager already! Thus, it'll be harder to actually identify the strong EA candidates, even if they exist. </p>\n</li>\n<li><p>The manager will get free room/board and live in low-CoL Blackpool, but I think this is outweighted by the necessity of moving to an undesirable location, and not being able to choose where you stay/eat. On net, I expect you'd need to offer a higher salary to attract the same level of talent as in, say, Oxford (though with more variance depending on how people perceive Blackpool). </p>\n</li>\n<li><p>You might be able to hire an existing hotel manager in Blackpool, which would reduce risk of turnover and guarantee a reasonable level of competence. This would obviously require separating the hotel manager and the community mentor, but I'm almost certain that doing would maximize the chances of success either way (division of labor!). I'm also not sure what exactly the cost is: the community mentor could just be an extroverted guest working on a particularly flexible project. </p>\n</li>\n<li><p>Presumably many committed and outgoing EAs (i.e. the people you'd want as managers) are already able to live with/near other EAs; moving to Blackpool would just take away their ability to choose who to live with.  </p>\n</li>\n</ul>\n<p>Of course, there could already be exceptional candidates expressing interest, but I don't understand why the default isn't hiring a non-EA with direct experience.</p>\n", "parentCommentId": "uj43yjbK8Bkvj2BXt", "user": {"username": "Liam_Donovan"}}, {"_id": "xCF4S3Epjms5wQe9S", "postedAt": "2018-06-10T06:13:10.111Z", "postId": "JdqHvyy2Tjcj3nKoD", "htmlBody": "<p>Following on vollmer's point, it might be reasonable to have a blanket rule against policy/PR/political/etc work -- anything that is irreversible and difficult to evaluate. &quot;Not being able to get funding from other sources&quot; is definitely a negative signal, so it seems worthwhile to restrict guests to projects whose worst possible outcome is unproductively diverting resources. </p>\n<p>On the other hand, I really can't imagine what harm research projects could do; I guess the worst case scenario is someone so persuasive they can convince lots of EAs of their ideas but so bad at research their ideas are all wrong, which doesn't seem very likely. (why not \n'malicious &amp; persuasive people'? the community can probably identify those more easily by the subjects they write about)</p>\n<p>Furthermore, guests' ability to engage in negative-EV projects will be constrained by the low stipend and terrible location (if I wanted to engage in Irish republican activism, living at the EA hotel wouldn't help very much). I think the largest danger to be alert for is reputation risk, especially from bad popularizations of EA, since this is easier to do remotely (one example is Intentional Insights, the only negative-EV EA project I know of)</p>\n", "parentCommentId": "tnAZMctPo2g2sAs9T", "user": {"username": "Liam_Donovan"}}, {"_id": "pkbgvFgutMtHJJTBk", "postedAt": "2018-06-10T06:23:40.836Z", "postId": "JdqHvyy2Tjcj3nKoD", "htmlBody": "<p>I suspect Greg/the manager would not be able to filter projects particularly well based on personal interviews; since the point of the hotel is basically 'hits-based giving', I think a blanket ban on irreversible projects is more useful (and would satisfy most of the concerns in the fb comment vollmer linked)</p>\n", "parentCommentId": "vBkD2b9gdEDJjejgS", "user": {"username": "Liam_Donovan"}}, {"_id": "snd27NpGXeoeAzwdS", "postedAt": "2018-06-10T16:26:08.542Z", "postId": "JdqHvyy2Tjcj3nKoD", "htmlBody": "<p>I agree research projects are more robustly positive. <a href=\"https://nickbostrom.com/information-hazards.pdf\">Information hazards</a> are one main way in which they could do a significant amount of harm.</p>\n", "parentCommentId": "xCF4S3Epjms5wQe9S", "user": {"username": "Jonas Vollmer"}}, {"_id": "vFhcBTr7HhYNx47gg", "postedAt": "2018-06-11T12:04:48.383Z", "postId": "JdqHvyy2Tjcj3nKoD", "htmlBody": "<blockquote>\n<p>irreversible and difficult to evaluate</p>\n</blockquote>\n<p>This basically applies to everything as a matter of degree, so it looks impossible to put in a blanket rule. Suppose I raise £10 and send it to AMF. That's irreversible. Is it difficult to evaluate? Depends what you mean by 'difficult' and what the comparison class is.</p>\n", "parentCommentId": "xCF4S3Epjms5wQe9S", "user": {"username": "MichaelPlant"}}, {"_id": "rEtmL6Qg2yCmPyxHQ", "postedAt": "2018-06-11T13:40:02.184Z", "postId": "JdqHvyy2Tjcj3nKoD", "htmlBody": "<blockquote>\n<p>vague idea of how things ought to be, rather than a conscious attempt to maximize success.</p>\n</blockquote>\n<p>I would say it’s a bit more than vague ;) I think it’s important to have someone who really understands and shares the goals of the project. Someone who doesn’t get EA is not likely to care about it much beyond seeing it as a means to get paid. It would then be largely up to part time volunteers (the other Trustees) to direct the project and keep it aligned with EA. This scenario seems more likely to lead to stagnation/failure to me. </p>\n<blockquote>\n<p>less of the skills we tend to have (such as a flair for optimization)</p>\n</blockquote>\n<p>I think a flair for optimisation is needed in any kind of ops role. The more you optimise, the greater your capacity (/free time).</p>\n<blockquote>\n<p>and even more of the skills we tend not to have (consistency, hotel-related metis)</p>\n</blockquote>\n<p>Conscientiousness would be required. But there are a fair amount of EAs with that trait, right?</p>\n<blockquote>\n<p>optimizing for initial success seems more important than optimizing for future expansion.</p>\n</blockquote>\n<p>In practice I think these are mostly the same thing. The more initial success there is, the more likely expansion is. The point I was making is that the manager will have a large stake in the course the project takes, so it will depend on what they make of it (hence meaning it should be seen as an exciting opportunity. I mean yeah, there will be some amount of “boring” (mindfulness promoting?) tasks - but it could be so much more fun than “Hotel Manager in Blackpool” initially sounds).</p>\n<blockquote>\n<p>less external validation of managerial capability than a similarly qualified external candidate, who might be a hotel manager already!</p>\n</blockquote>\n<p>In many ways this won’t be a typical hotel (non-profit, longer term stays, self-service breakfast and lunch, simplified dinner menu, weekly linen/towel changes, EA evening events etc), so I’m not sure how much prior hotel experience is relevant. Really anyone who is a reasonably skilled generalist, passionate about the project, and friendly should be able to do it. </p>\n<blockquote>\n<p>I expect you'd need to offer a higher salary to attract the same level of talent</p>\n</blockquote>\n<p>Salary is open to negotiation (have amended <a href=\"http://www.eawork.club/jobs/135\">ad</a>).</p>\n<blockquote>\n<p>require separating the hotel manager and the community mentor</p>\n</blockquote>\n<p>I think that once everything is set up, the day-to-day management of the hotel itself won’t require full time hours. Would prefer to have one full time employee rather than two part-time employees, but as I’ve said previously, I am open to splitting the role.</p>\n<blockquote>\n<p>division of labor</p>\n</blockquote>\n<p>As mentioned above, part of optimisation can be outsourcing tasks you are less good at (or don’t like doing). e.g. hiring someone else to do the cooking or laundry (depending on how much you value your time/money).</p>\n", "parentCommentId": "mz6a7ZcYk4WT2sxXh", "user": {"username": "Greg_Colbourn"}}, {"_id": "t8gMMghnxsq39FPs4", "postedAt": "2018-06-11T17:17:40.227Z", "postId": "JdqHvyy2Tjcj3nKoD", "htmlBody": "<p>&quot;In many ways this won’t be a typical hotel (non-profit, longer term stays, self-service breakfast and lunch, simplified dinner menu, weekly linen/towel changes, EA evening events etc), so I’m not sure how much prior hotel experience is relevant. Really anyone who is a reasonably skilled generalist, passionate about the project, and friendly should be able to do it.&quot;</p>\n<p>I think this is where we disagree. It's taken me years to develop the (rather basic) domestic skills I have. I think it would be quite a challenge for someone like me, who can competently manage a household, to competently manage a hotel with 17 people. For example, when I organized EA London's weekend retreat and oversaw the housing, cooking and cleaning for 25 people, it was really hard and I made some significant mistakes.</p>\n<p>This worries me because a large majority of the EAs I meet in London are worse at cooking/cleaning/household management than I am. If I'm not currently capable of the task, and most EAs are less capable than I am, then I wonder who CAN do the job.</p>\n<p>There are a couple of things I might be wrong about: maybe people are better at domestic tasks outside of London, or maybe there are one or two exceptional candidates (and that's really all it takes!). But based on my experience, I really don't think &quot;anyone who is a reasonably skilled generalist, passionate about the project, and friendly should be able to do it&quot;  - or at least, not to a high standard, not right away. </p>\n", "parentCommentId": "rEtmL6Qg2yCmPyxHQ", "user": {"username": "Khorton"}}, {"_id": "2MDzsfGrodRXoaXqz", "postedAt": "2018-06-12T13:36:48.908Z", "postId": "JdqHvyy2Tjcj3nKoD", "htmlBody": "<blockquote>\n<p>when I organized EA London's weekend retreat and oversaw the housing, cooking and cleaning for 25 people, it was really hard and I made some significant mistakes.</p>\n</blockquote>\n<p>Would be interested to hear more details about this (fine to PM).</p>\n<p>Also, it's unlikely to be 17 guests all at once to start with, things are ramping up gradually so far (have a few people booked in over the next few weeks), so the learning curve should be relatively gentle.</p>\n", "parentCommentId": "t8gMMghnxsq39FPs4", "user": {"username": "Greg_Colbourn"}}, {"_id": "8MZHHzfPjyiWB2Sfr", "postedAt": "2018-06-15T18:58:46.619Z", "postId": "JdqHvyy2Tjcj3nKoD", "htmlBody": "<p>Thinking about the hotel manager role, it's useful to use earning to give as a baseline for comparing impact.  Maybe someone who could do a good job at this role could otherwise earn to give at $75-$150k/year if they were only to keep $20k/year for themself? [1]  At full capacity there would be 16 bedrooms, but maybe you average 80% full, so this is an effective subsidy of $6k to $12k per resident per year.  This on its own is in the same range as just giving people money to rent housing, even in an expensive market like London or the Bay Area.  Then add in the other costs (real estate, upkeep, tasks that are contracted out) and this doesn't actually seem cheaper.</p>\n<p>Might still be worth it, for the value of crystalizing a new EA hub in a generally cheaper area, but I'm not sold on it.</p>\n<p>[1] Long term my expectation is that working a high paying job is probably building a lot more career capital than working as a hotel manager, but let's ignore that for now.</p>\n", "parentCommentId": null, "user": {"username": "Jeff_Kaufman"}}, {"_id": "iqj5qn2TC745Dqycm", "postedAt": "2018-06-17T16:56:43.258Z", "postId": "JdqHvyy2Tjcj3nKoD", "htmlBody": "<p>This is brilliant. I have several thoughts on the idea and on the comment threads so I will number them.</p>\n<ol>\n<li><p>For long term sustainability working towards some paying/donation shorter term guests and some stipend non-paying long term guests seems practical and doable. Another name for a Bed &amp; Breakfast, Lunch, and Dinner, is a spa. A growing market that is largely not directly advertised to in mainstream ad campaigns is the over 50 year old bracket. They have more time and money, and also likely more concern for health. A vegan diet can be a healing diet. A quiet relaxing bird watching venue may be very desirable for a stress reducing get away. Marton Mere Local Nature Reserve is nearby and sounds underutilized from the online descriptions as it has no parking of its own and no gift shop/organized tours etc.. Bus transport from the hotel for spa type guest might also include educational tours by some non-paying residents whose altruistic goals are wetland or bird sanctuary oriented. The murmurations  and beach front nearby would fit nicely into a spa type program.</p>\n</li>\n<li><p>Athena was the goddess who sprang forth from Zeus in full armor and ready for battle. She is considered the &quot;Goddess of wisdom, war and the crafts, and favourite daughter of Zeus, Athena was, perhaps, the wisest, most courageous, and certainly the most resourceful of the Olympian gods.&quot; <a href=\"https://www.ancient.eu/athena/\">https://www.ancient.eu/athena/</a> . I don't think you could think of a more effective altruistic champion if you had two years to focus on that. I also wouldn't recommend highlighting some letters of a name more than others. Passers-by would likely just think your sign needed a fresh coat of paint. If the goal was a mixed set of paying/donating guests and nonpaying EA workers than a simple name for the mainstream would be ideal. Passersby might stay for the birdwatching and good food and then become interested and active in the EA work. EA activists would already be aware of your hotel - springing forth fully ready to support EA work in a variety of ways.</p>\n</li>\n<li><p>EA workers interested in relocating to a hotel/spa like resort might have projects that coincide with health management, quantity food production, stress reduction, wetland management or ocean health. Your location might be the magnet for the project.</p>\n</li>\n<li><p>Preventative health or non-pharmaceutical health care is difficult to fund and often faces roadblocks from lobbyists or government that funds more profit oriented health care. The population as a whole is getting sicker on average, young and old, and increased heat is going to negatively impact the chronically ill more than the person of ideal health. Increased temperature increases oxidative stress on the body and increases volatile chemical release into the atmosphere which adds additional oxidative stress to the body, whether healthy or chronically ill. Increased temperatures are associated with increased irritability and violence.</p>\n</li>\n<li><p>Homelessness and lack of jobs that support living costs within commuting range is an increasing problem in many or most areas. Group living situations are not allowed in many zoning areas so as a model project of something different your hotel project is a prototype. Having donating/paying guests could help support more amenities such as tour buses or an exercise facility onsite and better fund a healthy menu and adequate staff to prepare it. Nonpaying EA guests might volunteer or also be working on quantity food production projects and be interested in a test group for recipe development. The production of healthy food that is low cost and easy to prepare would be an effective altruistic need for refugee or climate crisis response as well as urban homeless populations. </p>\n</li>\n<li><p>The Hotel Manager position does sound like more staff or volunteers would be needed to delegate some responsibility for daily chores and food production. I am a Registered Dietitian with food safety training and some experience in quantity food production for baked goods and overseeing the work of a full-time dietary manager for a residential facility kitchen. It is a lot of work and part of the work can be achieved by starting with a set of quantity food recipes and menu. If that is provided by a wholesale food business it can mean a menu and recipes based on processed foods that are quicker to prepare but are likely not providing as much health for an increased grocery expense. Bulk ingredients are cost effective and healthy but need time to prepare. Dividing the job into a person focused on hotel and dietary management and another person focused on EA project support and review of applications might be a good idea. </p>\n</li>\n<li><p>Menus and recipes and kitchen management for a vegetarian cafeteria may be available already, why re-invent the wheel - the best cafeteria food I've ever eaten was not at a hospital. It was at the university where I did my post Bachelor's credentialing program for dietetics, Andrews University. They only have vegetarian food. <a href=\"https://www.andrews.edu/shp/publichealth/\">https://www.andrews.edu/shp/publichealth/</a></p>\n</li>\n<li><p>I am interested in your idea and the Hotel Manager or Trustee positions but am not a U.K. resident, however I have a current passport and the virtual world is already at our fingertips. Thanks for putting your profits into such an interesting idea.</p>\n</li>\n</ol>\n", "parentCommentId": null, "user": {"username": "Jen"}}, {"_id": "kefYZDNrGLTKF3DGY", "postedAt": "2018-06-17T17:38:52.531Z", "postId": "JdqHvyy2Tjcj3nKoD", "htmlBody": "<p>Addition: Andrews University also focuses on made from scratch vegan recipes. <a href=\"https://www.andrews.edu/news/2010/08/dining_services.html\">https://www.andrews.edu/news/2010/08/dining_services.html</a> , contact info: <a href=\"mailto:pr@andrews.edu\">pr@andrews.edu</a>\nIt is a faith based university - example thesis: <a href=\"https://digitalcommons.andrews.edu/theses/10/\">https://digitalcommons.andrews.edu/theses/10/</a> .\nI wasn't sure about my memory regarding vegetarian vs vegan menu so I fact checked my previous comment - yes, vegetarian is the main cuisine. The vegan or gluten free or other special diet needs are included in their preventative health care focused approach. <a href=\"https://www.andrews.edu/undergrad/academics/programs/nutrition-dietetics/\">https://www.andrews.edu/undergrad/academics/programs/nutrition-dietetics/</a></p>\n", "parentCommentId": "iqj5qn2TC745Dqycm", "user": {"username": "Jen"}}, {"_id": "kuGjgSGAi6kiSS5qw", "postedAt": "2018-06-17T18:25:58.371Z", "postId": "JdqHvyy2Tjcj3nKoD", "htmlBody": "<p>Virtually I could help with recipe/menu/food safety type of questions from anywhere. My own recipe development focus has switched to vegan and egg free baking due to autoimmune disease and it has helped my health. Traveling has been difficult for me due to health problems and that has led to problems online as travel to urban centers and large events is encouraged. Reputation in the modern world can be too easily effected with the speed of virtual communication and the rumor mill makes up and spreads stories that are difficult to address as mentioning a rumor can be taken as proof the rumor is true. </p>\n<p>From my reading regarding the EA movement, it seemed there was a concern about reputation because an early focus on a fundraising message became attached as a primary goal instead of only being part of the larger goal of reviewing and encouraging projects that are shown to be effective. The long term benefits and sustainability of group living has been an interest of mine for decades. In the U.S. many problems can be traced back the closing of public residential mental health facilities. Mental health patients now are overly represented in homeless and prison populations and the cost of total care is likely more than a group home would cost. Add children and the story gets more complex. Answers are not easy but communal cooking and shared expenses can be more cost effective than supporting many individual residences. </p>\n<p>Virtual commuting does make teamwork easier if the team is willing to work together from a distance instead of placing demands that are not possible due to physical illness and then blaming a person for not fulfilling the impossible demands. Facts are not excuses.</p>\n", "parentCommentId": "kefYZDNrGLTKF3DGY", "user": {"username": "Jen"}}, {"_id": "vJF7hSJm3eNX72WdR", "postedAt": "2018-06-18T03:58:00.063Z", "postId": "JdqHvyy2Tjcj3nKoD", "htmlBody": "<p>Nice idea! The free health care in the UK helps make it low cost, though is there a probationary period for immigrants?</p>\n", "parentCommentId": null, "user": {"username": "Denkenberger"}}, {"_id": "ZMrx8sSC7LbZ7q9ru", "postedAt": "2018-06-18T04:15:13.363Z", "postId": "JdqHvyy2Tjcj3nKoD", "htmlBody": "<p><a href=\"http://effective-altruism.com/ea/1e5/ea_survey_2017_series_cause_area_preferences/\">This</a> says 20% of EA is vegan or vegetarian, so I would guess less than 10% vegan. Granted, the hard core EAs you are attracting may be more likely vegan, and you are lowering the barrier if someone else is reading labels and is hopefully a good cook. But I still think you are really limiting your pool by having all meals vegan. I understand you want to be frugal, and vegan from scratch is cheaper, but animal product substitutes are generally more expensive than animal products.</p>\n", "parentCommentId": null, "user": {"username": "Denkenberger"}}, {"_id": "nav5y2iTXpS3iLKwD", "postedAt": "2018-06-18T07:26:51.039Z", "postId": "JdqHvyy2Tjcj3nKoD", "htmlBody": "<p>Do you know, there are many people who have the skills to be great hotel managers and are making $15-$25k a year? In cheaper countries, such as Slovakia, Czech, Poland ... I really do not think people who are able to make 75 - 150 k a year will be interested in this job.</p>\n", "parentCommentId": "8MZHHzfPjyiWB2Sfr", "user": {"username": "MatejVrzala"}}, {"_id": "PgWzrdeWPTXjLFb2s", "postedAt": "2018-06-18T09:02:46.396Z", "postId": "JdqHvyy2Tjcj3nKoD", "htmlBody": "<p>No, your free (edit: pre-paid for most immigrants) health care starts when you start working/studying and register with a GP.\nIf you need to apply for a visa, you will likely pay an NHS surcharge as part of your visa application.</p>\n", "parentCommentId": "vJF7hSJm3eNX72WdR", "user": {"username": "Khorton"}}, {"_id": "yeountE9Novf4XNEq", "postedAt": "2018-06-18T13:53:40.470Z", "postId": "JdqHvyy2Tjcj3nKoD", "htmlBody": "<p>Hi Vollmer, appreciate your criticism. Upvoted for that.</p>\n<blockquote>\n<p>While it's really impressive how low the rent at the hotel will be, rent cost is rarely a major reason for a project's funding constraints</p>\n</blockquote>\n<p>Do you realise that the figure cited (3-4k a year) isn't rent cost? It's total living cost. At least in my case that's 4 times as little as what I'm running on, and I'm pretty cheap. For others the difference might be much larger.</p>\n<p>For example a project might have an actually high-impact idea that doesn't depend on location. Instead of receiving $150k from CEA to run half a year in the bay with 3 people, they could receive $50k and run for 3 years in Blackpool with 6 people instead. CEA could then fund 3 times as many projects, and it's impact would effectively stretch 6<em>2</em>3=36 times further.\nComing from that perspective, staying in the world's most expensive cities is just non-negotiable. At least for projects (coding, research, etc) that wouldn't benefit an even stronger multiplier from being on-location.\nAnd this isn't just projection. I know at least one project that is most likely moving their team to the EA hotel.</p>\n<blockquote>\n<p>Instead, the hotel could become a hub for everyone who doesn't study at a university or work on a project that EA donors find worth funding, i.e. the hotel would mainly support work that the EA community as a whole would view as lower-quality.</p>\n</blockquote>\n<p>I'm pretty sure EA projects find many projects net-positive even if they don't find them worth funding. For the same reason that I'd buy a car if I could afford one. Does that mean I find cars lower-quality than my bicycle? Nope.</p>\n<p>Imo it's a very simple equation. EA's need money to live. So they trade (waste) a major slice of their resources to ineffective endeavors for money. We can take away those needs for &lt;10% the cost, effectively making a large amount of people go from part-time to full-time EA. Assuming that the distribution of EA effectiveness isn't too steeply inequal (ie there are still effective EA's out there), this intervention is the most effective I've seen thus far.</p>\n", "parentCommentId": "vLtqSuEh7ZPm7jwYT", "user": {"username": "toonalfrink"}}, {"_id": "p4CxHuLnf8EZndJzw", "postedAt": "2018-06-18T14:14:29.859Z", "postId": "JdqHvyy2Tjcj3nKoD", "htmlBody": "<p>I've not yet had anyone say it's a dealbreaker (and of course people are allowed to buy meat from takeaways - or microwaveable burgers etc - with their spending money if they are really craving it..). Whilst frugality comes into it, the main reason for the all vegan catering is ethics. </p>\n<p>Also, I'd put money on the 2018 survey coming out with higher numbers for veg*anism :)</p>\n", "parentCommentId": "ZMrx8sSC7LbZ7q9ru", "user": {"username": "Greg_Colbourn"}}, {"_id": "QHqdLAa3LCWkusTg5", "postedAt": "2018-06-18T22:21:37.374Z", "postId": "JdqHvyy2Tjcj3nKoD", "htmlBody": "<p>Congrats on such a creative idea and the commitment in wanting to realize it! :)\nMy main worry concerns a very basic premise that seems to underlie the project: that providing an optimal space for individuals to do research is likely to result in efficient and effective research. While conducting online courses may indeed be useful, conducting unguided research is not only hard, but unlikely to lead anywhere concerning effectiveness and efficiency. A junior researcher, without an access to a supervisor who has in-depth knowledge of the given subject domain, is likely to end up tapping in the dark and trying out all kinds of paths that are far from being optimal. This is why the task of a supervisor is so important: one learns which topics to focus on, which gaps in the knowledge should first be filled in, how this should be done, which blind spots are hindering one's research, etc. And that only concerns knowledge acquisition. </p>\n<p>Knowledge production is probably even harder: without having an access to guidance concerning how to conduct e.g. empirical research, how to write academic papers, which workshops and conferences are optimal places for receiving critical feedback, which journal would be good for the given paper, etc. - one's own output is likely to remain unknown, unrecognized by the relevant community (academic or EA-related) and hence entirely ineffective.</p>\n<p>I am not sure which steps could be taken to tackle these problems. The only solution I currently see is opening the hotel for larger project applications, by experts willing to coordinate the research done in the center, and who would regularly visit the place to guide junior researchers.</p>\n", "parentCommentId": null, "user": {"username": "Dunja"}}, {"_id": "qXBAR53G8RX7pz7WR", "postedAt": "2018-06-18T23:10:55.012Z", "postId": "JdqHvyy2Tjcj3nKoD", "htmlBody": "<p>I haven't read the whole thing. But this seems to be one of the, if not the coolest idea in EA in 2018. Glad you did it. </p>\n<p>Good luck for everyone who goes to live or work there! </p>\n", "parentCommentId": null, "user": {"username": "Diego_Caleiro"}}, {"_id": "m98rr6SpFPBXovhDX", "postedAt": "2018-06-20T22:42:55.552Z", "postId": "JdqHvyy2Tjcj3nKoD", "htmlBody": "<p>Remote supervision of research is a possibility, but depends on people with relevant knowledge and experience being available. Peer support from other guests will be available to some extent, especially given the preponderance of people in the movement with postgraduate degrees. However, plenty of research can be self-directed, especially things that are more a case of collating existing knowledge than developing new science (e.g. meta-analyses, review articles, writing books). And the hotel will probably appeal to autodidacts who can plow through published texts and then build on top of them (without much need for explanation additional to what they find in writing).</p>\n<p>The hotel is open to hosting research groups, and also conferences and workshops.</p>\n", "parentCommentId": "QHqdLAa3LCWkusTg5", "user": {"username": "Greg_Colbourn"}}, {"_id": "wPum2sSoWrwCfRXk5", "postedAt": "2018-06-21T04:06:23.763Z", "postId": "JdqHvyy2Tjcj3nKoD", "htmlBody": "<p>Not all EAs are on board with AI risk, but it would be rude for this EA hotel to commit to funding general AI research on the side. Whether <em>all</em> EAs are on board with effective animal advocacy isn't the key point when deciding whether the hotel's provided meals are vegan.</p>\n<p>An EA who doesn't care about veganism will be mildly put off if the hotel doesn't serve meat. But an EA who believes that veganism is important would be very strongly put off if the hotel served meat. The relative difference in how disturbed the latter person would be is presumably at least 5 times as strong as the minor inconvenience that the former person would feel. This means that even if only 20% of EAs are vegan, the expected value from keeping meals vegan would beat out the convenience factor of including meat for nonvegans.</p>\n", "parentCommentId": "ZMrx8sSC7LbZ7q9ru", "user": {"username": "EricHerboso"}}, {"_id": "uCzrrrYpfQqhAobME", "postedAt": "2018-06-21T07:45:59.969Z", "postId": "JdqHvyy2Tjcj3nKoD", "htmlBody": "<p>That's all fine, but how does one make sure their meta-analysis follows the adequate methodological rigor of the given domain unless they have a prior experience with research or an in-depth knowledge of such methods? Writing review articles may be easier, though writing books that will make an impact is yet again hard without already having research experience. I've noticed in the area of EA that for some reason there is a misconception concerning the research in humanities: everyone would agree that conducting natural sciences outside of an appropriate expert team or a research institution is almost impossible. Yet, people tend to assume that humanities are different. They are not. When it comes to using reliable methods, engaging with the relevant literature, making studies (even meta-analysis) that actually matter - all this is far from trivial and requires expertise. It's extremely hard to weave through tons of information and uncover the one that actually matters, that should be reviewed, and then pushing that towards a finding that will actually make an impact. So when you say that autodidacts can plow through published texts and build on top of them- that's not at all simple without having had experience with such research beforehand and knowing quite well:</p>\n<ul>\n<li>how to sort through the given texts and order them according to relevance</li>\n<li>how to assess the given texts (depending on the domain, one might need to acquire additional skills for this)</li>\n<li>what exactly to write about to &quot;build on top of that&quot;: which standards should be employed in the given field so that they lead to an actual publication\netc.\nSo I'd say: regular supervision (even if remote) for any pre-doc is extremely important. As well as having funds to attend the relevant events in the field where one can get feedback on their work.</li>\n</ul>\n", "parentCommentId": "m98rr6SpFPBXovhDX", "user": {"username": "Dunja"}}, {"_id": "Tf7LM9ahsfXb3siBp", "postedAt": "2018-06-21T08:24:18.806Z", "postId": "JdqHvyy2Tjcj3nKoD", "htmlBody": "<p>Plus there's reason to believe that of the non-vegans/vegetarians, a substantial subset probably still agrees to some extent that it's generally a good idea, and simply doesn't commit to the diet due to lack of motivation, or practicality in their situation, and thus would still welcome or at least be open to vegan food being provided in the hotel. So I guess even if 80% of EAs consider themselves to be omnivores, we can't assume that the whole 80% would personally perceive this policy of the hotel as negative.</p>\n", "parentCommentId": "wPum2sSoWrwCfRXk5", "user": {"username": "markus_over"}}, {"_id": "Rs6uREtDhiTGdRyCu", "postedAt": "2018-06-21T08:59:28.368Z", "postId": "JdqHvyy2Tjcj3nKoD", "htmlBody": "<p>I'm getting tired of the 'veganism is only a minor inconvenience' point being made:</p>\n<ul>\n<li>V*ganism shows very high 'recidivism' rates in the general population. Most people who try to stop eating meat/animal products usually end up returning to eat these things before long.</li>\n<li>The general public health literature on behaviour/lifestyle change seldom says these things are easy/straightforward to effect.</li>\n<li>When this point is made by EAAs, there is almost always lots of EAs who they say, 'No, actually, I found going v*gan really hard', or, 'I tried it but I struggled so much I felt I had to switch back'.</li>\n<li>(The selection effect that could explain why 'ongoing v*gans' found the change only a minor convenience is left as an exercise to the reader).</li>\n</ul>\n<p>I don't know many times we need to rehearse this such that people stop saying 'V*ganism is a minor inconvenience'. But I do know it has happened enough times that other people in previous discussions have also wondered how many times this needs to be rehearsed such that people stop saying this.</p>\n<p>Of course, even if it is a <em>major</em> inconvenience (FWIW, I'm a vegetarian, and I'd find the relatively small 'step further' to be exclusively vegan a major inconvenience), this could still be outweighed by other factors across the scales (there's discussion to be had 'relative aversion', some second-order stuff about appropriate cooperative norms, etc. etc.). Yet discussions of the cost-benefit proceed better if the costs are not wrongly dismissed.</p>\n", "parentCommentId": "wPum2sSoWrwCfRXk5", "user": {"username": "Gregory_Lewis"}}, {"_id": "cJLmdX7iYcAuag4q7", "postedAt": "2018-06-21T10:11:22.978Z", "postId": "JdqHvyy2Tjcj3nKoD", "htmlBody": "<p>I would say, in many cases, we could consider veganism to be a major inconvenience. </p>\n<p>For example </p>\n<ul>\n<li>when the whole family is eating meat and one has to live with them. </li>\n<li>when one cannot really choose in school or work because of cafeteria offer</li>\n<li>when one doesn't have a belief animal suffering should be avoided</li>\n<li>when one has low tendency to stand up against colleagues/friends/family/society pressure</li>\n<li>when one doesn't know how to cook (or doesn't have time) and there are not good enough vegan services in place of living</li>\n</ul>\n<p>But when you change the context to Hotel for effective altruists where one can just eat what is given, is supported to eat what's given by everyone around we could call it only a &quot;minor inconvenience&quot;. And in a case, the food will be really good it could be called &quot;great opportunity&quot; for non-vegan EA to experience vegan living without even trying.</p>\n", "parentCommentId": "Rs6uREtDhiTGdRyCu", "user": {"username": "MatejVrzala"}}, {"_id": "a9xeMwrRcry9sLEpf", "postedAt": "2018-06-21T23:23:30.900Z", "postId": "JdqHvyy2Tjcj3nKoD", "htmlBody": "<p>Greg this is awesome - go you!!! :-D :-D</p>\n<p>To provide one extra relevant reference class: I have let EAs stay for free / donations at my place in London to work on EA projects and on the whole was very happy I did so. I think this is worthwhile and there is a need for it (with some caution as to both risky / harmful projects and well intentioned free-riders).</p>\n<p>Good luck registering as a CIO - not easy. Get in touch with me if you are having trouble with the Charity Commission.\nNote: you might need Trustee's that are not going to live for free at the hotel (there's lots of rules against Trustees receiving any direct benefits from their charity).</p>\n<p>Also if you think it could be useful for there to be a single room in London for Hotel guests to use for say business or conference attendance then get in touch.</p>\n", "parentCommentId": null, "user": {"username": "weeatquince"}}, {"_id": "Y9u9m3HLq8qb864jC", "postedAt": "2018-06-22T02:34:19.145Z", "postId": "JdqHvyy2Tjcj3nKoD", "htmlBody": "<p>There are protected characteristics, like race and gender, and the only way I can see EA/non-EA being covered is through beliefs. This first link only says religion specifically, but the second includes philosophical beliefs more generally:</p>\n<p><a href=\"https://www.gov.uk/discrimination-your-rights\">https://www.gov.uk/discrimination-your-rights</a></p>\n<p><a href=\"http://www.legislation.gov.uk/ukpga/2010/15/section/10\">http://www.legislation.gov.uk/ukpga/2010/15/section/10</a></p>\n<p>More here:\n<a href=\"http://www.legislation.gov.uk/ukpga/2010/15/contents\">http://www.legislation.gov.uk/ukpga/2010/15/contents</a></p>\n<p>I would guess that nonprofits that only serve people of a certain protected characteristics can also be legal, e.g. women's shelters. Maybe it could fall under Services and public functions, Premises or Associations: </p>\n<p><a href=\"http://www.legislation.gov.uk/ukpga/2010/15/part/3\">http://www.legislation.gov.uk/ukpga/2010/15/part/3</a></p>\n<p><a href=\"http://www.legislation.gov.uk/ukpga/2010/15/part/4\">http://www.legislation.gov.uk/ukpga/2010/15/part/4</a></p>\n<p><a href=\"http://www.legislation.gov.uk/ukpga/2010/15/part/7\">http://www.legislation.gov.uk/ukpga/2010/15/part/7</a></p>\n", "parentCommentId": "ahcsKNoAWyRrrtjNT", "user": {"username": "MichaelStJules"}}, {"_id": "Mo2BzyBFb8Zgu5wjd", "postedAt": "2018-06-22T02:57:15.747Z", "postId": "JdqHvyy2Tjcj3nKoD", "htmlBody": "<blockquote>\n<p>V*ganism shows very high 'recidivism' rates in the general population. Most people who try to stop eating meat/animal products usually end up returning to eat these things before long.</p>\n</blockquote>\n<p>FWIW, based on Faunalytics surveys, the recidivism rate seems to be about 50% for vegans motivated by animal protection specifically: </p>\n<p><a href=\"https://www.facebook.com/groups/EffectiveAnimalAdvocacy/permalink/906516599519212/\">https://www.facebook.com/groups/EffectiveAnimalAdvocacy/permalink/906516599519212/</a></p>\n", "parentCommentId": "Rs6uREtDhiTGdRyCu", "user": {"username": "MichaelStJules"}}, {"_id": "QRk6TGYZs2wZXXahE", "postedAt": "2018-06-23T18:37:46.068Z", "postId": "JdqHvyy2Tjcj3nKoD", "htmlBody": "<p>Indeed, I think I'm not the only one to whom the nudge towards eating more fully vegan would seem a highly welcome side-effect of a stay in the hotel.</p>\n", "parentCommentId": "Tf7LM9ahsfXb3siBp", "user": {"username": "FlorianH"}}, {"_id": "K39hWCcMHqg3coqnw", "postedAt": "2018-06-24T16:13:29.591Z", "postId": "JdqHvyy2Tjcj3nKoD", "htmlBody": "<p>Good backup plan. That's great that it has not been a dealbreaker for anyone.</p>\n", "parentCommentId": "p4CxHuLnf8EZndJzw", "user": {"username": "Denkenberger"}}, {"_id": "oisENJQaNpoEFzoYF", "postedAt": "2018-06-25T07:43:21.796Z", "postId": "JdqHvyy2Tjcj3nKoD", "htmlBody": "<blockquote>\n<p>Do you realise that the figure cited (3-4k a year) isn't rent cost? It's total living cost. At least in my case that's 4 times as little as what I'm running on, and I'm pretty cheap. For others the difference might be much larger.</p>\n</blockquote>\n<p>Yes, I do. But in times when talent is the bigger constraint than funding, I'd rather create $100k worth of impact at a financial cost of $25k than $50k at a cost of $4k. Often, interacting in-person with specific people in specific places (often in major hubs) will enable you to increase your impact substantially. This isn't true for everyone, and not always, but it will often be the case, even for coding/research projects. E.g. it's commonly accepted wisdom that for-profit (coding) startups can increase their value substantially by moving to the Bay, and individual programmers can increase their salaries by more than the higher living cost by moving there. Similar things might apply to EA projects in Oxford / London / Berkeley / San Francisco.</p>\n<p>So the potential benefits of the EA hotel might be somewhat limited, and there might also be some costs / harms (as I mentioned in the other comments).</p>\n", "parentCommentId": "yeountE9Novf4XNEq", "user": {"username": "Jonas Vollmer"}}, {"_id": "HRJv6kbk8bBM3cA8M", "postedAt": "2018-06-25T09:29:26.704Z", "postId": "JdqHvyy2Tjcj3nKoD", "htmlBody": "<p>HI Greg,  </p>\n<p>I just signed up to effective-alturism because I found a link to this post.  I read what you wrote and thought it was an amazing idea.  I also read the comments that seemed to be a little bit negative and prompted me to write a comment.</p>\n<p>Firstly I think that giving people the space to work on projects is hugely valuable and people underestimate what can be done with the space just to work on a project.</p>\n<p>Secondly, some of the comments are assuming this a cut-price alternative and everyone would really be better being in LDN / SF etc if cost were no obstacle.  I would suggest you have a unique opportunity understand the context of the area and use the talent of the people involved to directly improve the place you are in.  Making smaller towns in the UK more attractive places for young people to live in would be a huge service to mankind.</p>\n", "parentCommentId": null, "user": {"username": "TomBers"}}, {"_id": "y6peTZek7Fs537vAt", "postedAt": "2018-06-26T02:03:53.243Z", "postId": "JdqHvyy2Tjcj3nKoD", "htmlBody": "<blockquote>\n<p>Regarding studying, it would mainly be suitable for those doing so independently online (it’s possible to take many world class courses on EdX and Coursera for free). But could also be of use to university students outside of term time (say to do extra classes online, or an independent research project, over the summer).</p>\n</blockquote>\n<p>Fully-funded living expenses could also open up the option of <a href=\"http://www.open.ac.uk\">The Open University</a> for some people.</p>\n<blockquote>\n<blockquote>\n<p>the enthusiasm for this project may be partly driven by social reasons</p>\n</blockquote>\n</blockquote>\n<blockquote>\n<p>There’s nothing wrong with this, as long as people participating at the hotel for largely social reasons pay their own way (and don’t disrupt others’ work).</p>\n</blockquote>\n<p>I think vollmer just meant to caution against readers taking upvotes as a proxy for the value of a project.</p>\n", "parentCommentId": "tnAZMctPo2g2sAs9T", "user": null}, {"_id": "JkAc4LhmPkgcP7Sam", "postedAt": "2018-06-26T02:53:07.836Z", "postId": "JdqHvyy2Tjcj3nKoD", "htmlBody": "<blockquote>\n<p>Even if there is some downside risk from any given project, the expected value is probably positive, solely based on the fact that some EA thinks it's a good idea.</p>\n</blockquote>\n<p>I think the <a href=\"https://concepts.effectivealtruism.org/concepts/unilateralists-curse/\">Unilateralist's Curse</a> is relevant here.</p>\n", "parentCommentId": "vBkD2b9gdEDJjejgS", "user": null}, {"_id": "JdCNiecX8zDDQ8iEr", "postedAt": "2018-06-26T04:40:36.199Z", "postId": "JdqHvyy2Tjcj3nKoD", "htmlBody": "<p>First of all, Greg_Colbourn, very impressed with all the thought that's gone into this. I was already super impressed that you were doing the project in the first place, but this was a good read. Criticism tends to hit people harder than praise, so good on you for continuing to engage with that too.</p>\n<p>vollmer, thanks for the time you're putting into the discussion here. I think a lot of your worries have less force if you think of the Hotel as a stepping stone / gap-filler / early incubator / refuge / safety net. If you don't have a lot of savings, you can't dedicate a focused chunk of time to:</p>\n<ul>\n<li><p>earning the trust of other EAs who can then fund or at least vouch for you (this seems to be an important part of funding decisions, especially for new projects/orgs)</p>\n</li>\n<li><p>making a career move (the number of people I've known stuck in jobs they don't want to be in because they don't have the time to research, try out and apply for what they want to do next, and can't afford to to quit first and then figure it out...)</p>\n</li>\n<li><p>general reading/thinking/discussion around EA/rationality/self-improvement, without knowing where it might take you (I'd love to see EA Grants accept a funding proposal for &quot;Sitting on a beach and reading whatever seems useful for a few months...maybe I'll start with the sequences, maybe I won't, who knows lol&quot;)</p>\n</li>\n<li><p>coming up with project proposals to take to the more official EA funding streams</p>\n</li>\n<li><p>recovering from burn-out or another knock (I know Greg_Colbourn hasn't mentioned this here and it's quite different from the others, so maybe I'm really straying into general &quot;EA Hotels and Low-cost Living&quot; territory now)</p>\n</li>\n</ul>\n<p>Put another way - if we want to invoke the Argument From 80k Authority <a href=\"http://effective-altruism.com/ea/1pc/ea_hotel_with_free_accommodation_and_board_for/ek5\">again</a> - Greg_Colbourn has just provided a free <a href=\"https://80000hours.org/2015/11/why-everyone-even-our-readers-should-save-enough-to-live-for-6-24-months/\">personal runway community insurance scheme</a>.</p>\n<p>There's a two-year limit. It's not meant to be a long-term lifestyle for an EA. I think it's meant to give less financially comfortable EAs a bit of freedom and breathing space between projects/careers.</p>\n<p>I think this gap exists. The funder who says, &quot;I know you don't have the time or energy to make a grant-proposal-standard case for why I should support you yet. And that's why I'm going to.&quot; Maybe I'm wrong. But hey, let's build it and see if they come :-)</p>\n<p>I also think that often the way in which funding is offered is important. In my case, if I started to struggle financially, I'd be excited and proud to move into the EA Hotel. On the other hand, I'd feel somewhat embarrassed and burdensome to move back in with my parents, I've turned down financial support from three close EA friends because of what it might do to our relationship (and accepted very gratefully from two other less close EA friends &lt;3), and I hate the thought of people questioning my motives as a community organiser if I accept a higher salary at EA London. I can also imagine people treating the EA Hotel as a last resort because e.g. future employers might think it looks like a cult. My point is more that it's a different kind of option, and people have all sorts of reasons for not wanting to accept funding that they need. (Note that the personal, somewhat emotional relevance probably makes me slightly biased in favour of this project overall.)</p>\n<p>Then again, maybe I'm being too blase. I have no idea how many EA project ideas aren't getting funded due to lack of coordination / management time / funds in a particular area, and how many aren't getting funded because funders think they <em>shouldn't be</em> funded. The term &quot;crucial considerations&quot; makes me immediately think, &quot;Ah. Yes. Yes, it's very easy to do well-intentioned harm.&quot; And actually I think I place an unusually high value on private research relative to action (publicising research can be pretty <a href=\"https://nickbostrom.com/information-hazards.pdf\">action-y</a>), which might warrant a small group of community leaders withholding a lot of funding without much explanation until they've done a lot more research...Unfortunately, I also think it makes sense to be pretty suspicious of that approach.</p>\n<p>No conclusions. Just some considerations for y'all.</p>\n<p>(Incidentally, rejection is usually at least a bit hurtful. I wouldn't be surprised if all the job/funding rejections in our community - especially alongside all the headhunting, careers advice, talent gap talk, &quot;EA's not funding-constrained&quot; talk, pressure to reach relentlessly higher and reprioritise every 5 minutes etc. - was driving a lot of the enthusiasm for funders with more relaxed standards, including the upvotes on this article relative to the Charity Entrepreneurship one.)</p>\n", "parentCommentId": "vLtqSuEh7ZPm7jwYT", "user": null}, {"_id": "8p3xJYe4idwHycfAx", "postedAt": "2018-07-05T23:09:30.177Z", "postId": "JdqHvyy2Tjcj3nKoD", "htmlBody": "<p>The Unilateralist's Curse refers to situations where many people oppose a project and only one person supports it.  This is an important case to consider, but I think a randomly chosen EA project is unlikely to fall into this category.</p>\n", "parentCommentId": "JkAc4LhmPkgcP7Sam", "user": {"username": "John_Maxwell_IV"}}, {"_id": "g9vkaZrboGYPCGpMu", "postedAt": "2018-07-06T00:36:04.215Z", "postId": "JdqHvyy2Tjcj3nKoD", "htmlBody": "<p>Hmm. I think the Unilateralist's Curse rests on the assumption that individuals underestimate potential downsides relative to their estimations concerning potential upsides, at least when it comes to the consequences for other people. (Anecdotally this assumption seems likely but I basically have no idea if it's true.) Centralised coordination/control is a way to counteract that. But the situation is even worse in this case because not only are we potentially facilitating projects with no centralised filtering, we're actually selecting for projects that are more likely to have been rejected by a central filter.</p>\n<p>Thank you for prompting me to clarify my thinking here. I expect it's wrong, I haven't read Bostrom's paper on it, but that's where I'm up to.</p>\n<p>(Also it might be worth me saying that I currently still think the EA Hotel has positive expected value - I don't think it's giving individuals enough power for the Unilateralist's Curse to really apply. But it's worth continuing to think about the UC and it doesn't seem clear to me that &quot;the fact that some EA thinks it's a good idea&quot; is sufficient grounds to attribute positive expected value to a project, given no other information, which seemed to be what you were saying.)</p>\n", "parentCommentId": "8p3xJYe4idwHycfAx", "user": null}, {"_id": "4ykX5fdBATQp8Evk4", "postedAt": "2018-07-08T20:48:09.603Z", "postId": "JdqHvyy2Tjcj3nKoD", "htmlBody": "<p>Thanks :) Yes I have two independent Trustees now, we're in the process of registering the CIO. Good of you to offer of the London room, will let you know if anyone needs to go to London for (EA) business!</p>\n", "parentCommentId": "a9xeMwrRcry9sLEpf", "user": {"username": "Greg_Colbourn"}}, {"_id": "oc4FRZL3sCedWKDkM", "postedAt": "2018-07-12T14:56:53.424Z", "postId": "JdqHvyy2Tjcj3nKoD", "htmlBody": "<p>Just to play devil's advocate for a moment, aren't personal interviews and hits-based giving essentially the process used by other EA funders?  I believe it was OpenPhil who coined the term <a href=\"https://www.openphilanthropy.org/blog/hits-based-giving\">hits-based giving</a>.  It sounds like maybe your issue is with the way funding works in EA broadly speaking, not this project in particular.</p>\n<p>The same seems to apply to vollmer's point about adverse selection effects.  Over time, the project pool will increasingly be made up of <a href=\"https://www.lesswrong.com/posts/HCssSWMp7zoJAPtcR/you-are-not-hiring-the-top-1\">projects everyone has rejected</a>.  So this could almost be considered a fully general counterargument against funding any project.  (Note that this thinking directly opposes replaceability: replaceability encourages you to fund projects no other funder is willing to fund; this line of reasoning says just the opposite.)  Anyway, I think the EA Hotel could easily be <em>less</em> vulnerable to adverse selection effects, if it appeals to a different crowd.  I'm the first long-term resident of the hotel, and I've never applied for funding from any other source.  (I'm self-studying machine learning at the hotel, which I don't think I would ever get a grant for.)</p>\n<p>Sounds like you really want a broader rule like &quot;no irreversible projects without community consensus&quot; or something.  In general, mitigating downside risk seems like an issue that's fairly orthogonal to establishing low cost of living EA hubs.</p>\n", "parentCommentId": "pkbgvFgutMtHJJTBk", "user": {"username": "John_Maxwell_IV"}}, {"_id": "ditHMZogDyaaK8Cti", "postedAt": "2018-07-12T14:59:12.743Z", "postId": "JdqHvyy2Tjcj3nKoD", "htmlBody": "<blockquote>\n<p>Centralised coordination/control is a way to counteract that.</p>\n</blockquote>\n<p><a href=\"http://benjaminrosshoffman.com/openai-makes-humanity-less-safe/\">OpenPhil funding OpenAI</a> might be a case of a &quot;central&quot; organization taking unilateral action that's harmful.  vollmer also mentions that he thinks some of EAF's subprojects were probably negative impact elsewhere in this thread--presumably the EAF is relatively &quot;central&quot;.</p>\n<p>If we think that &quot;individuals underestimate potential downsides relative to their estimations concerning potential upsides&quot;, why do we expect funders to be immune to this problem?  There seems to be an assumption that if you have a lot of money, you are unusually good at forecasting potential downsides.  I'm not sure.  People like Joey and Paul Christiano have offered prizes for the best arguments against their beliefs.  I don't believe OpenPhil has ever done this, despite having a lot more money.</p>\n<p>In general, funding doesn't do much to address the unilateralist's curse because any single funder can act unilaterally to fund a project that all the other funders think is a bad idea.  I once proposed an <a href=\"http://effective-altruism.com/ea/19d/update_on_effective_altruism_funds/asa\">EA donor's league</a> to address this problem, but people weren't too keen on it for some reason.</p>\n<blockquote>\n<p>it doesn't seem clear to me that &quot;the fact that some EA thinks it's a good idea&quot; is sufficient grounds to attribute positive expected value to a project, given no other information</p>\n</blockquote>\n<p>Here's a thought experiment that might be helpful as a baseline scenario.  Imagine you are explaining effective altruism to a stranger in a loud bar.  After hearing your explanation, the stranger responds &quot;That's interesting.  Funny thing, I gave no thought to EA considerations when choosing my current project.  I just picked it because I thought it was cool.&quot;  Then they explain their project to you, but unfortunately, the bar is too loud for you to hear what they say, so you end up just nodding along pretending to understand.  Now assume you have two options: you can tell the stranger to ditch their project, or you can stay silent.  For the sake of argument, let's assume that if you tell the stranger to ditch their project, they will ditch it, but they will also get soured on EA and be unreceptive to EA messages in the future.  If you stay silent, the stranger will continue their project and remain receptive to EA messages.  Which option do you choose?</p>\n<p>My answer is, having no information about the stranger's project, I have no particular reason to believe it will be either good or bad for the world.  So I model the stranger's project as a small random perturbation on humanity's trajectory, of the sort that happen thousands of times per day.  I see the impact of such perturbations as basically neutral on expectation.  In the same way the stranger's project could have an unexpected downside, it could also have an unexpected upside.  And in the same way that the stranger's actions could have some nasty unforeseen consequence, my action of discouraging the stranger could also have some nasty unforeseen consequence!  (Nasty unforeseen consequences of my discouragement action probably won't be as readily observable, but that doesn't mean they <a href=\"https://en.wikipedia.org/wiki/Status_quo_bias\">won't exist</a>.)  So I stay silent, because I gain nothing on expectation by objecting to the project, and I don't want to pay the cost of souring the stranger on EA.</p>\n<p>Suppose you agree with my argument above.  If so, do you think that we should default to discouraging EAs from doing projects in the absence of further information?  Why?  It seems a bit counterintuitive/implausible that being part of the EA community would increase the odds that someone's project creates a downside.  If anything, it seems like being plugged into the community should increase a person's awareness of how their project might pose a risk.  (Consider the EA hotel in comparison to an alternative of having people live cheaply as individuals.  Being part of a community of EAs = more peer eyeballs on your project = more external perspectives to spot unexpected downsides.)  And in the same way giving strangers default discouragement will sour them on EA, giving EAs default discouragement on doing any kind of project seems like the kind of thing that will suck the life out of the movement.</p>\n<p>I don't want to be misinterpreted, so to clarify:</p>\n<ul>\n<li><p>I am in favor of people discouraging projects if, after looking at the project, they actually think the project will be harmful.</p>\n</li>\n<li><p>I am in favor of bringing up considerations that suggest a project might be harmful with the people engaged in it, even if you aren't sure about the project's overall impact.</p>\n</li>\n<li><p>I'm in favor of people trying to make the possibility of downsides mentally available, so folks will remember to check for them.</p>\n</li>\n<li><p>I'm in favor of more people doing what Joey does and offering prizes for arguments that their projects are harmful.</p>\n</li>\n<li><p>I'm in favor of people publicly making themselves available to shoot holes in the project ideas of others.</p>\n</li>\n<li><p>I'm in favor of people in the EA community trying to coordinate more effectively, engage in moral trade, cooperate in epistemic prisoner's dilemmas, etc.</p>\n</li>\n<li><p>In general, I think brainstorming potential downsides has high value of information and people should do it more.  But a gamble can still be positive expected value without having purchased any information!  (Also, in order to avoid bias, maybe you should try to spend an equal amount of time brainstorming unexpected upsides.)</p>\n</li>\n<li><p>I think it may be reasonable to focus on projects which have passed the acid test of trying to think of plausible downsides (since those projects are likely to be higher expected value).</p>\n</li>\n</ul>\n<p>But I don't really see what purpose blanket discouragement serves.</p>\n", "parentCommentId": "g9vkaZrboGYPCGpMu", "user": {"username": "John_Maxwell_IV"}}, {"_id": "ZbD4i9qv4nRpSNAKZ", "postedAt": "2018-07-16T12:40:02.209Z", "postId": "JdqHvyy2Tjcj3nKoD", "htmlBody": "<p>The OpenPhil/OpenAI article was a good read, thanks, although I haven't read the comments on either post or Ben's latest thoughts, and I don't really have an opinion either way on the value/harm of OpenPhil funding OpenAI if they did so &quot;to buy a seat on OpenAI’s board for Open Philanthropy Project executive director Holden Karnofsky&quot;. But of course, I wasn't suggesting that centralised action is never harmful; I was suggesting that it's better on average [edit: in UC-type scenarios, which I'm not sure your two examples were...man this stuff is confusing!]. It's also ironic that part of the reason funding OpenAI might have been a bad idea seems to be that it creates more of a Unilateralist's Curse scenario (although I did notice that the first comment claims this is not their current strategy): &quot;OpenAI’s primary strategy is to hire top AI researchers to do cutting-edge AI capacity research and publish the results, in order to ensure widespread access.&quot;</p>\n<blockquote>\n<p>If we think that &quot;individuals underestimate potential downsides relative to their estimations concerning potential upsides&quot;, why do we expect funders to be immune to this problem? </p>\n</blockquote>\n<p>Excellent question. No strong opinion as I'm still in anecdote territory here, but I reckon emotional attachment to one's own grand ideas is what's driving the underestimation of risk, and you'd expect funders to be able to assess ideas more dispassionately.</p>\n<p>I'm not sure that EA is all that relevant to the answer I'd give in your thought experiment. If they didn't have much power then I'd say go for it. If their project would have large consequences before anyone else could step in I'd say stop. As I said before, &quot;I currently still think the EA Hotel has positive expected value - I don't think it's giving individuals enough power for the Unilateralist's Curse to really apply.&quot; I genuinely do expect the typical idea someone has for improving the status quo to be harmful, whether they're an EA or a stranger in a bar. Most of the time it's good to encourage innovation anyway, because there are feedback mechanisms/power structures in place to stop things getting out of hand if they start to really not look like good ideas. But in UC-type scenarios i.e. where those checks are not in place, we have a problem.</p>\n<p>We <em>might</em> be talking past each other. Perhaps we agree that: In your typical real-life scenario i.e. where an individual does not have unilateral power, we should encourage them to pursue their altruistic ideas. Perhaps this was even what you were saying originally, and I just misinterpreted it.</p>\n<p>[Edit: I'm pretty sure we're talking past each other to at least some extent. I don't think there should be &quot;blanket discouragement&quot;. I think the typical project that someone/an EA thinks is a good idea is in fact a bad idea, but that they should test it anyway. I do think there should be blanket discouragement of actions with large consequences that can be taken by a small minority without the endorsement of others (eg. relating to reputational risk or information hazards).]</p>\n", "parentCommentId": "ditHMZogDyaaK8Cti", "user": null}, {"_id": "P8Rg7fx5HccgcfJzF", "postedAt": "2018-08-09T17:37:20.460Z", "postId": "JdqHvyy2Tjcj3nKoD", "htmlBody": "<p>The <a href=\"https://eahotel.org\">website</a> is now up at eahotel.org. It's possible to book via the <a href=\"https://eahotel.org/booking\">Booking</a> page, and the <a href=\"https://eahotel.org/wiki\">Wiki</a> has information for guests and an <a href=\"https://eahotel.org/wiki#faqs\">FAQ</a>. People can also book video calls to talk about proposals for free stays working on EA stuff via the <a href=\"https://eahotel.org/contact\">Contact</a> page (I have updated the <a href=\"http://effective-altruism.com/ea/1pc/ea_hotel_with_free_accommodation_and_board_for/#section8\">Next Steps</a> section in the OP to reflect this).</p>\n", "parentCommentId": null, "user": {"username": "Greg_Colbourn"}}, {"_id": "aJqR5gdcDXWrJ5rPq", "postedAt": "2018-08-21T21:30:15.711Z", "postId": "JdqHvyy2Tjcj3nKoD", "htmlBody": "<p>Whether you live in a hotel or not, there are certain chores that need to be done for your life to run smoothly: grocery shopping, cooking, laundry, etc.  These chores don't go away if you live in an expensive housing market or make a high income.  But if you live with roommates, it's possible to coordinate with your roommates to achieve economies of scale in these tasks.  Right now at the EA hotel, we are trading off so we each take turns cooking for the entire hotel (currently ~6 people) one night per week.  This creates economies of scale because cooking for 6 people is much less than 6 times as hard as cooking for one person.  I expect that these economies of scale effects will become even more valuable as the number of people in the hotel grows.</p>\n", "parentCommentId": "8MZHHzfPjyiWB2Sfr", "user": {"username": "John_Maxwell_IV"}}, {"_id": "hZgbY6pRZuF22fGJD", "postedAt": "2018-08-24T18:14:25.934Z", "postId": "JdqHvyy2Tjcj3nKoD", "htmlBody": "<blockquote>\n<p>These chores don't go away if you live in an expensive housing market or make a high income.</p>\n</blockquote>\n<p>If you have a high income, though, you can pay other people to do them: for example, instead of cooking you could buy frozen food, buy restaurant food, or hire a cook.</p>\n<blockquote>\n<p>I expect that these economies of scale effects will become even more valuable as the number of people in the hotel grows.</p>\n</blockquote>\n<p>My experience with cooking is that above about 6-10 people the economies of scale drop off a lot.  I really like living in a house with enough adults that I can cook about once a week, but as the number of people (and combinations of dietary restrictions) grows you get beyond what one person can cook easily.</p>\n<p>Overall, though, it sounds like you're more arguing for &quot;group houses are great&quot; (which I agree on) and not &quot;taking the hotel manager job has high counterfactual impact&quot; (which I think is much more important?)</p>\n", "parentCommentId": "aJqR5gdcDXWrJ5rPq", "user": {"username": "Jeff_Kaufman"}}, {"_id": "EaFvAde8ADRx3NEvb", "postedAt": "2018-08-27T00:29:34.999Z", "postId": "JdqHvyy2Tjcj3nKoD", "htmlBody": "<p>(I'm assuming that the counterfactual here is someone who wants to do unpaid direct work full time, has some funds available that could be used to either support themselves or could be donated to something high impact, and could either live in SF or Blackpool.)</p>\n<blockquote>\n<p>If you have a high income, though, you can pay other people to do them: for example, instead of cooking you could buy frozen food, buy restaurant food, or hire a cook.</p>\n</blockquote>\n<p>These options don't go away if you move to Blackpool.  But your rent does get a lot cheaper.</p>\n<p>It seems like maybe there are two questions here which are more or less orthogonal: the value of hiring a very talented full-time manager for your group house (someone who is passing up a job that pays $75K+ in order to be manager), and the value of moving to Blackpool.  I think the value of having a very talented full-time manager for your group house is not about reducing expenses, it's about creating a house culture that serves to multiply the impact of all the residents.  If that's not possible then it probably makes less sense to hire a manager whose opportunity cost is high.</p>\n", "parentCommentId": "hZgbY6pRZuF22fGJD", "user": {"username": "John_Maxwell_IV"}}, {"_id": "2NWb5Rm79MpbSvNSJ", "postedAt": "2018-08-27T17:16:46.941Z", "postId": "JdqHvyy2Tjcj3nKoD", "htmlBody": "<blockquote>\n<p>I'm assuming that the counterfactual here is someone who wants to do unpaid direct work full time, has some funds available that could be used to either support themselves or could be donated to something high impact, and could either live in SF or Blackpool.</p>\n</blockquote>\n<p>Is this the counterfactual for the hotel manager, or for a resident?  I'm only trying to address the hotel manager role here, but I wouldn't expect the counterfactual for a hotel manager to be unpaid direct work.</p>\n<blockquote>\n<p>I think the value of having a very talented full-time manager for your group house is not about reducing expenses, it's about creating a house culture that serves to multiply the impact of all the residents</p>\n</blockquote>\n<p>This makes a lot of sense to me, but reading the <a href=\"http://effective-altruism.com/ea/1pc/ea_hotel_with_free_accommodation_and_board_for/#section4\">Hotel Manager section</a> the impression I get is that a hotel manager would be too busy to do much in that direction.  There's no discussion of their role in setting culture, and a lot of operations work.</p>\n", "parentCommentId": "EaFvAde8ADRx3NEvb", "user": {"username": "Jeff_Kaufman"}}, {"_id": "d5TjCW6pCvFsQupXY", "postedAt": "2019-01-12T13:23:46.748Z", "postId": "JdqHvyy2Tjcj3nKoD", "htmlBody": "<p>We are now fundraising for the hotel: http://eahotel.org/fundraiser/ (Unfortunately the cryptocurrency markets are now a lot lower than anticipated. But I also want the project to become genuinely community supported. i.e. if others don&#x27;t think it&#x27;s worth funding then I should probably update in the direction that I shouldn&#x27;t continue funding it either).</p>", "parentCommentId": null, "user": {"username": "Greg_Colbourn"}}, {"_id": "8tY2gdBmD2hiup8iF", "postedAt": "2019-03-19T23:06:08.398Z", "postId": "JdqHvyy2Tjcj3nKoD", "htmlBody": "<p>I would be wary of equivocating different forms of &#x27;inconvenience&#x27;. There are at least three being alluded to here:</p><p>1) Fighting the akrasia of craving animal products</p><p>2) The hassle of finding vegan premade food (else of having to prepare meals for yourself)</p><p>3) Reduced productivity gains from missing certain nutrients (else of having to carefully supplement constantly)</p><p>Of these, the first basically irrelevant in the hotel - you can remove it as a factor by just not giving people the easy option to ingest them. The second is completely irrelevant, since it&#x27;s serving or supplying 90% of the food people will be eating.</p><p>So that only leaves three, which is much talked about, but so far as I know, little studied, so this &#x27;inconvenience&#x27; could even have the wrong sign: the only study on the subject I found from a very quick search showed <a href=\"https://www.karger.com/Article/Abstract/288281\">increased</a> productivity from veganism for health reasons; also on certain models of willpower that treat it as analogous to a muscle, it could turn out that depriving yourself (even by default, from the absence of offered foods) you improve your willpower and thus become more productive.  </p><p>I&#x27;ve spoken to a number of people who eat meat/animal products for the third reason, but so far as I know they rarely seem to have reviewed any data on the question, and almost never to have actually done any controlled experiments on themselves. Honestly I suspect many of them are using the first two to justify a suspicion of the third (for eg, I know several EAs who eat meat with productivity justifications, but form whom it&#x27;s usually *processed* meat in the context of other dubious dietary choices, so they demonstrably aren&#x27;t optimising their diet for maximal productivity).</p><p>Also, if the third does turn out to be a real factor, it seems very unlikely that more than a tiny bit of meat every few days would be necessary to fix the problem for most people, and going to the shops to buy that for themselves seems unlikely to cause them any serious inconvenience.</p>", "parentCommentId": "Rs6uREtDhiTGdRyCu", "user": {"username": "Arepo"}}, {"_id": "mptqDFwftkC8JBxSX", "postedAt": "2019-03-20T02:23:17.829Z", "postId": "JdqHvyy2Tjcj3nKoD", "htmlBody": "<p>The inconvenience I had in mind is not in your list, and comprises things in the area of, &quot;Prefer to keep the diet I&#x27;m already accustomed to&quot;, &quot;Prefer omnivorous diets on taste etc. grounds to vegan ones&quot;, and so on. I was thinking of an EA who is omnivorous and feels little/no compunction about eating meat (either because they aren&#x27;t &#x27;on board&#x27; with the moral motivation for animal causes in general, or doesn&#x27;t find the arguments for veganism persuasive in particular). I think switching to a vegan diet isn&#x27;t best described as a minor inconvenience for people like these.</p><p>But to be clear, this doesn&#x27;t entail any moral obligation whatsoever on the hotel to serve meat - it&#x27;s not like they are forcing omnivorous guests to be vegan, but just not cooking them free (non-vegan) food. If a vegan offers me to stay at their house a) for free, b) offers vegan food for free too, c) welcomes me to, if I&#x27;m not a fan of vegan food, get my own food to cook at their house whenever I like - which seems basically the counterfactual scenario if I wasn&#x27;t staying with them in the first place, and d) explains all of this before I come, they&#x27;ve been supererogatory in accommodating me, and it would be absurd for me to say they&#x27;ve fallen short in not serving me free omnivorous food which they morally object to.</p><p>Yet insofar as &#x27;free food&#x27; is a selling point of the hotel, &#x27;free <em>vegan</em> food&#x27; may not be so enticing to omnivorous guests. Obviously the offer is still generous by itself, leave alone combined with free accommodation, but one could imagine it making a difference on the margin to omnivores (especially if they are cost-sensitive). </p><p>Thus there&#x27;s a trade-off in between these people and vegans who would be put off if the hotel served meat itself (even if vegan options were also provided). It&#x27;s plausible to me the best option to pick here (leave alone any other considerations) is the more &#x27;vegan-friendly&#x27; policy. But this isn&#x27;t because the trade-off is in fact illusory because the &#x27;vegan-friendly&#x27; policy is has minimal/minor costs to omnivores after all.</p><p>[Empirically though, this doesn&#x27;t seem to amount to all that much given (I understand) the hotel hasn&#x27;t been struggling for guests.] </p>", "parentCommentId": "8tY2gdBmD2hiup8iF", "user": {"username": "Gregory_Lewis"}}, {"_id": "yMLGjXHfydB8EKz9J", "postedAt": "2020-10-12T11:47:16.142Z", "postId": "JdqHvyy2Tjcj3nKoD", "htmlBody": "<p>I&apos;ve just stumbled across this and it seems like an incredible idea to me. Given the quantity of users potentially at the site, gas/electricity stick out to me as the most obvious commercial overheads to consider.</p><p>The best way that I believe we may be able to help with this would be to throw this over to our commercial gas/electricity broker and ask for special energy pricing for the site, on the basis that this is a charitable endeavour. </p><p>Please get in touch here: <a href=\"https://www.forever-group.co.uk\">Forever Group</a>. And no for the avoidance of any doubt before anyone panics we are not looking to charge you anything - just offer some help for this great project for free.</p>", "parentCommentId": null, "user": {"username": "forevergroup"}}, {"_id": "gMpiaExfbATwRhRBh", "postedAt": "2021-07-24T23:15:17.866Z", "postId": "JdqHvyy2Tjcj3nKoD", "htmlBody": "<p>It's cool that someone is willing to make that kind of investment. I remember looking for a good hotel near the coast, so I had to study how people had already vacationed there and what emotions they had left. It is necessary to study it, so if you have already picked up a hotel, you know where you are going. This is a very necessary thing. So I studied a lot of reviews about <a href=\"https://silverleaf-resorts.pissedconsumer.com/review.html\">silverleaf resorts</a> and already know almost all the features and so on. So it's good that I came across this information.</p>", "parentCommentId": null, "user": {"username": "Slaren"}}]