[{"_id": "Me8GZrudWrQeWYevk", "postedAt": "2014-11-17T16:20:31.544Z", "postId": "JdqzNvvPscsghW8xR", "htmlBody": "<p>I'm thinking of giving &quot;Giving games&quot; for Christmas this year. </p>\n<p>Family and friends gets a envelope with two cards. A nice Christmas card saying they now have x NOK to give on a charity of their choosing. Then it presents some interesting recommendations and encourage them to look more into them if they want to. When they have decided they have to write it down on an accompanying empty (but postaged) card addressed to me and when I get the card after Christmas I will donate the money.</p>\n<p>Have somebody else though of something similar? Do you have any ideas that could make it more interesting or better in any way?</p>\n", "parentCommentId": null, "user": {"username": "Jorgen_Ljones"}}, {"_id": "bX9QgBkbiEyzpqfcg", "postedAt": "2014-11-17T16:33:33.819Z", "postId": "JdqzNvvPscsghW8xR", "htmlBody": "<p>That could be interesting. You could count the numbers with tracking URLs. You could even get a group of effective altruists to run a similar giving game using the same tracking URLs so that everyone can (anonymously) see how many people have voted for the same or different charity from you. This could be a pretty cool project I think.</p>\n", "parentCommentId": "Me8GZrudWrQeWYevk", "user": {"username": "RyanCarey"}}, {"_id": "JkwrE2prJpc33KexN", "postedAt": "2014-11-18T02:30:03.370Z", "postId": "JdqzNvvPscsghW8xR", "htmlBody": "<p>I'm planning on starting an EA group at the University of Utah once I get back in January, and I need a good first meeting idea that will have broad appeal. </p>\n<p>I was thinking that I could get someone who's known outside of EA to do a short presentation/question and answer session on Skype. Peter Singer is the obvious choice, but I doubt he'd have time (let me know if you think otherwise). Can anyone suggest another EA who might have name recognition among college students who haven't otherwise heard of EA?</p>\n", "parentCommentId": null, "user": {"username": "JacobLBryan"}}, {"_id": "34EAZimPumnxHLQwx", "postedAt": "2014-11-18T02:38:50.338Z", "postId": "JdqzNvvPscsghW8xR", "htmlBody": "<p>I made a map with the opinions of many Effective Altruists and how they changed over the years. </p>\n<p>My sample was biased by people I live with and read. I tried to account for many different starting points, and of course, I got many people's opinions wrong, since I was just estimating them. </p>\n<p>Nevertheless there seems to be a bottleneck on accepting Bostrom's Existential Risk as The Most Important Task for Humanity.  If the trend is correct, and if it continues, it would generate many interesting predictions about where new EA's will come from. </p>\n<p>Here, have a look:</p>\n<p><a href=\"http://i.imgur.com/jQhoQOZ.png\">http://i.imgur.com/jQhoQOZ.png</a></p>\n<p>For the file itself (open through the <a href=\"http://www.yworks.com/en/products/yfiles/yed/\">program yED</a> by clicking File -&gt; Open URL and copying the link below):  </p>\n<p><a href=\"https://dl.dropboxusercontent.com/u/72402501/EA%20flowchart%20Web.graphml\">https://dl.dropboxusercontent.com/u/72402501/EA%20flowchart%20Web.graphml</a></p>\n", "parentCommentId": null, "user": {"username": "Diego_Caleiro"}}, {"_id": "3ymyWkkjNNz4orgkm", "postedAt": "2014-11-18T02:46:29.432Z", "postId": "JdqzNvvPscsghW8xR", "htmlBody": "<p>I posted this late before, and was told to post in a newer Open Thread so here it goes: </p>\n<p>Is voting valuable?</p>\n<p>There are four costs associated with voting:</p>\n<p>1) The time you spend deciding on whom to vote.</p>\n<p>2) The risk you incur in going to the place where you vote (a non-trivial likelihood of dying due to unusual traffic that day).</p>\n<p>3) The attention you pay to politics and associated decision cost.</p>\n<p>4) The sensation you made a difference (this cost is conditional on voting not making a difference).</p>\n<p>What are the benefits associated with voting:</p>\n<p>1) If an election is decided based on one vote, and you voted on one of the winning contestants, your vote decides who is elected, and is causally responsible for the counterfactual difference between candidates.</p>\n<p>2) Depending on your inclinations about how decision theory and anomalous causality actually work in humans, you may think your vote is numerically more valuable because it changes/indicates/represents/maps what your reference class will vote. As if you were automatically famous and influential.</p>\n<p>Now I ask you to consider whether benefit (1) would in fact be the case for important elections (elections say where the elected will govern over 10 000 000 people). If 100 Worlds had an election decided based on one vote, which percentage of those would be surreptitiously biased by someone who could tamper with the voting? How many would request a recount? How many would ask it's citizens to vote again? Would deem the election illegitimate? Etc... \nMaybe some of these worlds would indeed accept the original counting, or do a fair recounting that would reach the exact same number, I find it unlikely this would be more than 80 of these 100 worlds, and would not be surprised if it was 30 or less.</p>\n<p>We don't know how likely it is that this will happen, in more than 16000 elections in the US only one was decided by one vote, and it was not an executive function in a highly populated area.</p>\n<p>This has been somewhat discussed in the rationalist community before, with different people reaching different conclusions.</p>\n<p>Here are some suggestions for EA's that are consistent with the point of view that voting is, ceteris paribus, not valuable:</p>\n<p>EA's who are not famous and influential should consider never making political choices.</p>\n<p>EA's who are uncertain or live in countries where suffrage is compulsory may want to consider saving time by copying the voting decisions of someone who they trust, to avoid time and attention loss.</p>\n<p>Suggestions for those who think voting is valuable:</p>\n<p>EAs should consider the marginal cost of copying the voting policy of a non-EA friend/influence they trust highly, and weight it against the time, attention and decision cost of deciding themselves.</p>\n<p>EAs should consider using safe vehicles (all the time and) during elections.</p>\n<p>EAs who think voting is valuable because it represents what all agents in their reference class would do in that situation should consider other situations in which to apply such decision procedure. There may be a lot at stake in many decisions where using indication and anomalous causation applies - even in domains where this is not the sole ground of justification.</p>\n", "parentCommentId": null, "user": {"username": "Diego_Caleiro"}}, {"_id": "sCswkL9y7RBHBmogD", "postedAt": "2014-11-18T02:55:36.674Z", "postId": "JdqzNvvPscsghW8xR", "htmlBody": "<p><a href=\"http://effective-altruism.com/ea/ad/open_thread_4/1cg\">Previous thread</a></p>\n", "parentCommentId": "3ymyWkkjNNz4orgkm", "user": {"username": "pappubahry"}}, {"_id": "QxzXD45pNKWPEDWc6", "postedAt": "2014-11-18T15:47:00.965Z", "postId": "JdqzNvvPscsghW8xR", "htmlBody": "<p>Is it possible to get a picture of the graph, or does that not make sense?</p>\n", "parentCommentId": "34EAZimPumnxHLQwx", "user": {"username": "Peter_Hurford"}}, {"_id": "DXGquocBvg4yqa3r9", "postedAt": "2014-11-18T19:50:14.328Z", "postId": "JdqzNvvPscsghW8xR", "htmlBody": "<p>There are more things to add to the benefits list:</p>\n<ul>\n<li>When I talk to friends about how to vote I get to exhibit some of the ways I think about policy which may influence their thinking in the future</li>\n<li>Becoming educated about local political issues helps you look educated and gain respect among other local people</li>\n<li>Learning about public policy might be enjoyable</li>\n</ul>\n<p>Overall, though, none of this seems to justify either not voting if you want to vote, or voting if you don't want to vote.</p>\n", "parentCommentId": "3ymyWkkjNNz4orgkm", "user": {"username": "ruthie"}}, {"_id": "wsAqRLLfAyDWaS3Jb", "postedAt": "2014-11-19T01:36:20.960Z", "postId": "JdqzNvvPscsghW8xR", "htmlBody": "<p>I would also recommend running a Christmas Fundraiser (Basically asking for donations instead of gifts during Christmas). <a href=\"http://christmas.causevox.com/\">http://christmas.causevox.com/</a></p>\n<p>I will post a longer description + guide on how to set this up on a main thread early December.</p>\n", "parentCommentId": "Me8GZrudWrQeWYevk", "user": {"username": "Joey"}}, {"_id": "AcRewmHzci26PduzX", "postedAt": "2014-11-19T11:51:13.711Z", "postId": "JdqzNvvPscsghW8xR", "htmlBody": "<p>What do people think should be the downvoting culture and criteria around here? I've seen some pretty harsh downvoting, and am concerned that this might make the forum seem less welcoming to new people.</p>\n", "parentCommentId": null, "user": {"username": "Tom_Ash"}}, {"_id": "DXxFqkpY9xDxeffhQ", "postedAt": "2014-11-19T12:43:10.779Z", "postId": "JdqzNvvPscsghW8xR", "htmlBody": "<p>I haven't seen a downvote here that I've agreed with, and for the moment I'd prefer an only-upvote system.  I don't know where I'd draw the line on where downvoting is acceptable to me (or what guidelines I'd use); I just know I haven't drawn that line yet.</p>\n", "parentCommentId": "AcRewmHzci26PduzX", "user": {"username": "pappubahry"}}, {"_id": "SHc2rNQLY8mCxY79C", "postedAt": "2014-11-19T13:16:06.716Z", "postId": "JdqzNvvPscsghW8xR", "htmlBody": "<p>Having some downvoting is good, and part of the raison d'etre of this forum as opposed to the Facebook group. I agree that people downvote slightly too often, but that's a matter of changing the norms.</p>\n", "parentCommentId": "DXxFqkpY9xDxeffhQ", "user": {"username": "jayd"}}, {"_id": "tPAuRgmXLjMM5qvFi", "postedAt": "2014-11-19T13:28:08.270Z", "postId": "JdqzNvvPscsghW8xR", "htmlBody": "<p>I'll just note that we're pointing people somewhat in the right direction by labelling the up- and down-vote buttons &quot;I found this useful&quot; and &quot;I didn't find this useful&quot;, in order to encourage people to appraise whether the posts are valuable and evidence-based, rather than whether they're to the reader's personal taste.</p>\n<p>I think the big picture here is not whether one agrees with individual upvotes or downvotes but how the system is working overall. Largely, I think it's identifying real differences in post quality and also the fact that about 95% of votes appear to be upvotes means that the system will encourage people to post more. So, I'm pretty encouraged by the way things are going so far. Maybe we can tilt people to consider slightly more comments 'useful', though.</p>\n", "parentCommentId": "AcRewmHzci26PduzX", "user": {"username": "RyanCarey"}}, {"_id": "uXYokoyYf3W3f4f3d", "postedAt": "2014-11-19T13:46:54.922Z", "postId": "JdqzNvvPscsghW8xR", "htmlBody": "<p>Here you go: <a href=\"http://i.imgur.com/jQhoQOZ.png\">image</a></p>\n", "parentCommentId": "QxzXD45pNKWPEDWc6", "user": {"username": "RyanCarey"}}, {"_id": "bP3L4smTkHpLCpWgF", "postedAt": "2014-11-19T13:49:58.508Z", "postId": "JdqzNvvPscsghW8xR", "htmlBody": "<p>This is because we want to encourage people to contribute, right? One approach is to be the norm you want to promote. If you want to encourage people to post, then upvote more posts. If you're concerned that material is getting downvoted when it is not spam, then give it an upvote and a substantial reply. :)</p>\n", "parentCommentId": "SHc2rNQLY8mCxY79C", "user": {"username": "RyanCarey"}}, {"_id": "eprmXy4BdBHRskcXF", "postedAt": "2014-11-19T14:04:32.806Z", "postId": "JdqzNvvPscsghW8xR", "htmlBody": "<blockquote>\n<p>upvote more posts</p>\n</blockquote>\n<p>I wasn't personally saying that was a good idea, just that I thought there should (somewhat) fewer downvotes. Of note, I'm not thinking about myself getting downvotes but occasions where it happened to other people!</p>\n", "parentCommentId": "bP3L4smTkHpLCpWgF", "user": {"username": "Tom_Ash"}}, {"_id": "bWeKEP7xo3Acdozdb", "postedAt": "2014-11-19T14:38:27.864Z", "postId": "JdqzNvvPscsghW8xR", "htmlBody": "<p>[Your recent EA activities]</p>\n<p>Tell us about these, as in <a href=\"http://effective-altruism.com/ea/9g/tell_us_about_your_recent_ea_activities/\">Kaj's thread</a> last month. I would love to hear about them - I find it very inspirational to hear what people are doing to make the world a better place!</p>\n<p>(Giving this thread another go after it didn't get any responses last month.)</p>\n", "parentCommentId": null, "user": {"username": "Vincent_deB"}}, {"_id": "kyJZ7AJuyE6CSpthE", "postedAt": "2014-11-19T14:57:20.823Z", "postId": "JdqzNvvPscsghW8xR", "htmlBody": "<p>Thanks!</p>\n", "parentCommentId": "uXYokoyYf3W3f4f3d", "user": {"username": "Peter_Hurford"}}, {"_id": "5onZHNh3uteoJ82st", "postedAt": "2014-11-19T17:36:03.098Z", "postId": "JdqzNvvPscsghW8xR", "htmlBody": "<p>The difficulty (that no-one seems to have figured out how to solve) is a system that effectively  hides low quality posts without becoming more of an echo chamber over time. While a community is small it is not too much of a problem, because even mildly down voted posts have good attention - but as it grows, highly up voted posts that reflect existing tastes or confirm existing biases increasingly dominate. </p>\n", "parentCommentId": "AcRewmHzci26PduzX", "user": {"username": "AlasdairGives"}}, {"_id": "8mdS2CcA9sp5hNjpK", "postedAt": "2014-11-19T22:01:59.464Z", "postId": "JdqzNvvPscsghW8xR", "htmlBody": "<p>Thank you Ryan, I tried doing this but failed to be tech savvy enough. </p>\n", "parentCommentId": "uXYokoyYf3W3f4f3d", "user": {"username": "Diego_Caleiro"}}, {"_id": "sBtH8QR4o8q9RKNqo", "postedAt": "2014-11-19T22:11:54.357Z", "postId": "JdqzNvvPscsghW8xR", "htmlBody": "<p>I've been growing skeptical that we will make it through AI, due to </p>\n<p>1) civilizational competence (that is incompetence) and</p>\n<p>2) Apparently all human cognition is based on largely subjective metaphors of radial categories which have arbitrary internal asymmetries that we have no chance of teaching a coded AI in time. </p>\n<p>This on top of all the other impossibilities (solving morality, consciousness, the grounding problem, or at least their substitute: value loading). </p>\n<p>So it is seeming more and more to me that we have to go with the forms of AI's that have some small chance of converging naturally into human-like cognitionn, like neuromorphic or WBE.  Since those are already low probability (see e.g. <em>Superintelligence</em>) to begin with, my growing impression is that we are very, very likely doomed.</p>\n<p>So far the arena of people doing control problem related activities has been dominated by pessimists (say people who think we have less than 8% chance of making through). Over time as more and more people join it is likely more optimists will join. How will that affect our outcomes? Are optimists more likely to underestimate important strategical considerations?</p>\n<p>A separate question would be: what does EA look like in a doomed world? Suppose we knew for certain that AGI would destroy life on earth; what are the most altruistic actions we can take between now and then? Is postponing the end by a few days more valuable than donating to sub-saharan effective charities?</p>\n<p>These thoughts are not fully formed, but I wanted people to give their own opinions on these issues. </p>\n", "parentCommentId": null, "user": {"username": "Diego_Caleiro"}}, {"_id": "LkvhaRd3yhWyxr6br", "postedAt": "2014-11-20T00:22:58.769Z", "postId": "JdqzNvvPscsghW8xR", "htmlBody": "<p>I have mixed feelings on this.</p>\n<p>From the point of view of highlighting the best comments to allow good reading order, I think there may not be enough downvoting. Having more downvoting as well perhaps as more upvoting would give a richer distinction and help the best stuff to rise to the top quickly, even if it's new content on an old thread.</p>\n<p>On the other hand from the point of view of experienced feedback, downvoting might be a turn-off, and more of it might reduce people's inclination to post. But this effect might be reduced if downvoting were more normal.</p>\n<p>Overall I guess I'd weakly prefer more upvoting and more downvoting -- including downvoting things that you don't disagree with but would have been happy to skip reading.</p>\n", "parentCommentId": "AcRewmHzci26PduzX", "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "WZ9YYJf4mrDkqjvfL", "postedAt": "2014-11-20T01:14:40.102Z", "postId": "JdqzNvvPscsghW8xR", "htmlBody": "<p>I find receiving downvotes pretty demoralising, in particular when they are given for disagreeing with the conclusion, rather than thinking something is poorly reasoned.</p>\n", "parentCommentId": "AcRewmHzci26PduzX", "user": {"username": "Robert_Wiblin"}}, {"_id": "MKWWwaZai9xdsdPZx", "postedAt": "2014-11-20T01:17:59.781Z", "postId": "JdqzNvvPscsghW8xR", "htmlBody": "<p>I've been thinking of doing a 'live below the line' to raise money for MIRI/CFAR, and asking someone at MIRI/CFAR to do the same for CEA in return. The motivation is mostly to have a bit of fun. Does anyone think this is a good or bad idea?</p>\n", "parentCommentId": null, "user": {"username": "Robert_Wiblin"}}, {"_id": "Xu9Tfb4RBKSGKap7u", "postedAt": "2014-11-20T07:49:22.675Z", "postId": "JdqzNvvPscsghW8xR", "htmlBody": "<p>That's a good point, though being extra sparing in your upvoting would achieve a decent fraction of the same benefits. On the other hand, that would mean that fewer people got the warm fuzzies of upvotes, so that fewer people would get demoralising downvotes.</p>\n", "parentCommentId": "LkvhaRd3yhWyxr6br", "user": {"username": "Tom_Ash"}}, {"_id": "izMYYpYAyLBYA7v2L", "postedAt": "2014-11-20T09:24:22.763Z", "postId": "JdqzNvvPscsghW8xR", "htmlBody": "<p>Being sparing in your upvoting? That seems to be the worst of both worlds!</p>\n", "parentCommentId": "Xu9Tfb4RBKSGKap7u", "user": {"username": "RyanCarey"}}, {"_id": "SPAxeeixyioc3gqQs", "postedAt": "2014-11-20T09:32:08.727Z", "postId": "JdqzNvvPscsghW8xR", "htmlBody": "<p>I've volunteered for CSER. Also, I've done most of Andrew Ng's Coursera course on Machine Learning. It seems like a valuable skill to acquire, so I think that belongs on the list.</p>\n", "parentCommentId": "bWeKEP7xo3Acdozdb", "user": {"username": "RyanCarey"}}, {"_id": "D9rQK5kEFujyhGxHx", "postedAt": "2014-11-20T09:33:48.964Z", "postId": "JdqzNvvPscsghW8xR", "htmlBody": "<p>I've hidden my thoughts in <a href=\"http://www.rot13.com/index.php\">rot-13</a> to avoid biasing others:\nVg pbhyq or pbafgehrq nf gevivnyvfvat cbiregl</p>\n", "parentCommentId": "MKWWwaZai9xdsdPZx", "user": {"username": "RyanCarey"}}, {"_id": "SHLBReGAhijBxsaKk", "postedAt": "2014-11-20T09:41:02.932Z", "postId": "JdqzNvvPscsghW8xR", "htmlBody": "<p>It makes sense that the earliest adopters of the idea of existential risk are more pessimistic and risk-aware than average. It's good to attract optimists because it's good to attract anyone and also because optimistic rhetoric might help to drive political change.</p>\n<p>I think it would be pretty hard to know with probability &gt;0.999 that the world was doomed, so I'm not that interested in thinking about it.</p>\n", "parentCommentId": "sBtH8QR4o8q9RKNqo", "user": {"username": "RyanCarey"}}, {"_id": "JSxsNYgwYyX6iDoG2", "postedAt": "2014-11-20T09:42:04.991Z", "postId": "JdqzNvvPscsghW8xR", "htmlBody": "<p>No problem. There's an Export button in YeD's file menu. Then, you have the image file that you can upload Imgur.</p>\n", "parentCommentId": "8mdS2CcA9sp5hNjpK", "user": {"username": "RyanCarey"}}, {"_id": "2BKbzCKjNGbinRxmP", "postedAt": "2014-11-20T10:32:57.493Z", "postId": "JdqzNvvPscsghW8xR", "htmlBody": "<p>It'd be an interesting experiment to see how much this raised.</p>\n", "parentCommentId": "MKWWwaZai9xdsdPZx", "user": {"username": "arrowind"}}, {"_id": "JRXzjrC5brPEiLhEC", "postedAt": "2014-11-20T12:23:15.485Z", "postId": "JdqzNvvPscsghW8xR", "htmlBody": "<p>Downvoted to follow my own suggestion -- I'm afraid I found this confusing/confused, as I think just being more sparing with upvoting gets you no benefits at all, and you didn't explain how it was meant to work.</p>\n<p>Upvoted your original comment though. :)</p>\n", "parentCommentId": "Xu9Tfb4RBKSGKap7u", "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "XCt8iG6RaPZ8Q5ZSe", "postedAt": "2014-11-20T13:16:23.530Z", "postId": "JdqzNvvPscsghW8xR", "htmlBody": "<p>I don't usually use forums, so I don't know what the norm is. But I have found it somewhat demoralising so far when I've taken time to respond carefully and detailedly to questions, and then been downvoted with no explanation as to why people didn't find the comment useful. (I'm very willing to believe this is just because I'm not used to forums though - I'm only used to Facebook, where you can only upvote, hence all negative feedback has to be spelled out.)</p>\n<p>Thanks for bringing this up - seems like a useful discussion to have!</p>\n", "parentCommentId": "AcRewmHzci26PduzX", "user": {"username": "Michelle_Hutchinson"}}, {"_id": "KezAQMf6TGgLAd2tf", "postedAt": "2014-11-20T17:05:59.056Z", "postId": "JdqzNvvPscsghW8xR", "htmlBody": "<p>I'm imagining 2 scenarios:</p>\n<p>1) People have a very low threshold for upvoting, so upvote most comments. They only downvote in extreme circumstances.</p>\n<p>2) People have a high threshold for upvoting, so only upvote comments they think particularly helpful. They only downvote in extreme circumstances.</p>\n<p>My thought is that more information about comment quality is conveyed in the second.</p>\n", "parentCommentId": "izMYYpYAyLBYA7v2L", "user": {"username": "Tom_Ash"}}, {"_id": "bCRzSkNq6d6vKdemQ", "postedAt": "2014-11-20T17:06:33.006Z", "postId": "JdqzNvvPscsghW8xR", "htmlBody": "<p>Ha, fair enough! I tried to explain it in my reply to Ryan: <a href=\"http://effective-altruism.com/ea/b2/open_thread_5/1h2\">http://effective-altruism.com/ea/b2/open_thread_5/1h2</a></p>\n", "parentCommentId": "JRXzjrC5brPEiLhEC", "user": {"username": "Tom_Ash"}}, {"_id": "Xq78is6WRiQTeBqTj", "postedAt": "2014-11-20T17:36:48.985Z", "postId": "JdqzNvvPscsghW8xR", "htmlBody": "<p>I guess that people currently upvote in the vicinity of 20% of comments they read (this is a guess, but based on how many more upvotes the top articles/comments get than the median), and downvote somewhat under 1%.</p>\n<p>Optimal for information in theory might be a 1/3 1/3 1/3 split between upvoting, downvoting and not voting. But I think  higher thresholds for downvoting than that probably make sense. I guess I might like to see upvoting at about 30% and downvoting at about 3%?</p>\n", "parentCommentId": "KezAQMf6TGgLAd2tf", "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "MGndE6vLx42KxgTLP", "postedAt": "2014-11-20T17:51:15.814Z", "postId": "JdqzNvvPscsghW8xR", "htmlBody": "<p>Should we try to make a mark on the Volgbrother's &quot;Project 4 Awesome&quot;? It can expose effective altruism to a wide and, on average, young audience.</p>\n<p>I would love to help in any way possible, but video editing is not my thing...</p>\n<p><a href=\"https://www.youtube.com/watch?v=kD8l3aI0Srk\">https://www.youtube.com/watch?v=kD8l3aI0Srk</a></p>\n", "parentCommentId": null, "user": {"username": "UriKatz"}}, {"_id": "RqhpCJfovafiuksM2", "postedAt": "2014-11-21T00:37:31.636Z", "postId": "JdqzNvvPscsghW8xR", "htmlBody": "<p>&quot;This person disagrees with me&quot; and &quot;the person thinks my reasoning is bad&quot; are closely related - if your reasoning was good, they'd agree with you. And even when they differ, the original author is hardly an unbiased judge.</p>\n", "parentCommentId": "WZ9YYJf4mrDkqjvfL", "user": {"username": "Larks"}}, {"_id": "CuHrngwZp3hSc2F2j", "postedAt": "2014-11-21T03:29:10.959Z", "postId": "JdqzNvvPscsghW8xR", "htmlBody": "<p>The underlying assumption is that for many people working on probability shifts that are between 0 and 1 percent is not desirable. They would be willing to work for the same shift if it was betwen, say, 20 and 21, but not if it is too low. This is an empirical fact about people, I'm not issuing that it is a relevant moral fact. </p>\n", "parentCommentId": "SHLBReGAhijBxsaKk", "user": {"username": "Diego_Caleiro"}}, {"_id": "NJ8NMrYDukMyeKoBR", "postedAt": "2014-11-21T04:58:31.571Z", "postId": "JdqzNvvPscsghW8xR", "htmlBody": "<p>I suspect that one could make a chart to show a bottle neck in a lot of different places. From my understanding GW does not seem to think what the YED chart would imply. </p>\n<p>&quot;I reject the idea that placing high value on the far future – no matter how high the value – makes it clear that one should focus on reducing the risks of catastrophes&quot;\n<a href=\"http://blog.givewell.org/2014/07/03/the-moral-value-of-the-far-future/\">http://blog.givewell.org/2014/07/03/the-moral-value-of-the-far-future/</a></p>\n", "parentCommentId": "34EAZimPumnxHLQwx", "user": {"username": "Joey"}}, {"_id": "vypvqTCvLFt3oicmi", "postedAt": "2014-11-21T07:53:49.893Z", "postId": "JdqzNvvPscsghW8xR", "htmlBody": "<p>There are different cultures for upvoting and downvoting for different websites:</p>\n<ul>\n<li><p>As a passive user of Reddit, I'm aware of the voting culture there. Depending on the subreddit, it might be as bad as any other forum on the Internet which is a wilds of impoliteness and inconsideration. However, you might end up with one that's better. Obviously, this varies widely depending on the subreddit(s) one is using.</p>\n</li>\n<li><p>As an active user of Less Wrong, I tend not to downvote too much. Voting there is on the basis of whether something adds to the level of discourse, in terms of moving it in a direction of greater or less quality. </p>\n</li>\n<li><p>I try to treat how I vote on this forum based on the sentences that go along with the votes. For example, I upvote a comment on this site if I actively find it useful, i.e., it provides a new framing or new information which clarifies or enriches my understanding of an essay's subject matter. There are lots of comments that I don't find 'useful', per se, in the sense that I don't learn anything new from them. However, I don't (want to) downvote those comments because I don't want to imply anything is wrong with them when I don't really believe that. Such comments are just-so to me. I believe I would only downvote an essay, article, or comment on this forum if I believe it was actively harmful to people's understanding, because it would decrease clarity, or level of discourse. I would like to think I would do this regardless of whether it was from a position I agreed with it not.</p>\n</li>\n</ul>\n<p>Generally, I tend to be liberal with upvotes, and conservative with downvotes. However, this is a personal preference based on my perception that online communities with voting systems tend to be less friendly than I would like them to be, so I try correcting for this in the opposite direction in what small way I can as a user.</p>\n", "parentCommentId": "AcRewmHzci26PduzX", "user": {"username": "Evan_Gaensbauer"}}, {"_id": "yrjPNrgMrxAy4xefu", "postedAt": "2014-11-21T07:56:35.281Z", "postId": "JdqzNvvPscsghW8xR", "htmlBody": "<p>The second scenario isn't how I started upvoting, but what I'm leaning towards now, on this forum.</p>\n", "parentCommentId": "KezAQMf6TGgLAd2tf", "user": {"username": "Evan_Gaensbauer"}}, {"_id": "4tekZ8i8RPCzmXSWg", "postedAt": "2014-11-21T09:59:59.327Z", "postId": "JdqzNvvPscsghW8xR", "htmlBody": "<p><a href=\"http://www.animalcharityevaluators.org/recommendations/top-interventions/\">Animal Charity Evaluators</a> has/have found that leafleting is a highly effective form of antispeciesist activism. I want to use it generally for effective altruism too. Several times a year I’m at conventions with lots of people who are receptive to the ideas behind EA, and I would like to put some well-designed flyers into their hands.</p>\n<p>That’s the problem—“well-designed” is. My skills kind of end at “tidy,” and I haven’t been able to find anything of the sort online. So it would be great if a gifted EA designer could create some freely licensed flyers as SVG with the basic tenets of EA and some entry points for further research, all for anyone to print and distribute.</p>\n<p>I could then just apply some minor edits for a specific convention theme to build greater rapport with the con goers and have it printed.</p>\n", "parentCommentId": null, "user": {"username": "Telofy"}}, {"_id": "mCPDxfPkMKvbmsBzn", "postedAt": "2014-11-21T10:55:05.058Z", "postId": "JdqzNvvPscsghW8xR", "htmlBody": "<p>Relevant to this, there's an (inactive) .impact <a href=\"https://impact.hackpad.com/EA-Infographics-DBE9f2iXwfW\">project to make EA infographics</a>, with some discussion of them. There's also an <a href=\"https://impact.hackpad.com/Projects-aRiPtncmuKS\">idea</a> to create an EA design collective, consulting on design for EA orgs and projects.</p>\n<p>It's not quite the same thing, but you might be interested in <a href=\"http://tog.philosofiles.com/uploads/linked-elsewhere/deworming-infographic%202.fw.png\">this infographic about deworming</a> that I made for Charity Science.</p>\n", "parentCommentId": "4tekZ8i8RPCzmXSWg", "user": {"username": "Tom_Ash"}}, {"_id": "LPGHJpDHuauPd9aSx", "postedAt": "2014-11-21T11:01:26.245Z", "postId": "JdqzNvvPscsghW8xR", "htmlBody": "<p>The yED chart shows Givewell being of the opinion that poverty alleviation is desirable and quite likely the best allocation of resources in 2013. This does not seem to be a controversial claim. There are no other claims about Givewell's opinion in any other year. </p>\n<p>Notice also that the arrows in that chart mean only that empirically it has been observed that individuals espousing one yellow opinion frequently change their opinion to one below it. The reverse can also happen, though it is less frequent, and frequenty people spend years, if not decades, within a particular opinion.</p>\n<p>Can you give an example of a chart where a bottleneck would occur in a node that is not  either the X-risk node, or the transition to the far future node? I would be interested in seeing patterns that escaped my perception, and it is really easy to change the yED graph if you download it.  </p>\n", "parentCommentId": "NJ8NMrYDukMyeKoBR", "user": {"username": "Diego_Caleiro"}}, {"_id": "ByGKjZk8MoLK9eqWG", "postedAt": "2014-11-21T12:10:08.828Z", "postId": "JdqzNvvPscsghW8xR", "htmlBody": "<p>Thanks, that’s a great info graphic! I’d need something more generic, intervention agnostic, though, because we’ll be fund-raising for LLINs. Maybe something will come of that design collective.</p>\n", "parentCommentId": "mCPDxfPkMKvbmsBzn", "user": {"username": "Telofy"}}, {"_id": "A6oG48qHBkizdfHbj", "postedAt": "2014-11-21T12:37:18.672Z", "postId": "JdqzNvvPscsghW8xR", "htmlBody": "<p>The bottom part of your diagram has lots of boxes in it.  Further up, &quot;poverty alleviation is most important&quot; is one box.  If there was as much detail in the latter as there is in the former, you could draw an arrow from &quot;poverty alleviation&quot; to a lot of other boxes: economic empowerment, reducing mortality rates, reducing morbidity rates, preventing unwanted births, lobbying for lifting of trade restrictions, open borders (which certainly doesn't exclusively belong below your existential risk bottleneck), education, etc.  There could be lots of arrows going every which way in amongst them, and &quot;poverty alleviation is most important&quot; would be a bottleneck.</p>\n<p>Similarly (though I am less familiar with it), if you start by weighting animal welfare highly, then there are lots of options for working on that (leafleting, lobbying, protesting, others?).</p>\n<p>I agree that there's some real sense in which existential risk or far future concerns is more of a bottleneck than human poverty alleviation or animal welfare -- there's a bigger &quot;cause-distance&quot; between colonising Mars and working on AI than the &quot;cause-distance&quot; between health system logistics and lobbying to remove trade restrictions.  But I think the level of detail in all those boxes about AI and &quot;insight&quot; overstates the difference.</p>\n", "parentCommentId": "LPGHJpDHuauPd9aSx", "user": {"username": "pappubahry"}}, {"_id": "79webApWcsmqL6DaN", "postedAt": "2014-11-21T16:08:50.183Z", "postId": "JdqzNvvPscsghW8xR", "htmlBody": "<p>Yeah so if it started to look like the world was doomed, then less people would work on x-risk, true.</p>\n", "parentCommentId": "CuHrngwZp3hSc2F2j", "user": {"username": "RyanCarey"}}, {"_id": "KDbF87vTF6dRrMMnT", "postedAt": "2014-11-22T05:11:28.885Z", "postId": "JdqzNvvPscsghW8xR", "htmlBody": "<p>As a follow-up to <a href=\"http://effective-altruism.com/ea/ad/open_thread_4/1ca\">this comment</a>: I gave my 10-minute talk on effective altruism at <a href=\"https://www.scribd.com/about\">Scribd</a>.  The talk went better than I expected: several of my coworkers told me afterwards that it was really good.  So I thought I would summarize the contents of the talk so it can be used as a data point for presenting on effective altruism.</p>\n<p>You can see the slides for my talk in <a href=\"https://www.dropbox.com/sh/7ec38lpg1cpo7hj/AAA1m_SZNs4Qxa-NXYqEf7wTa?dl=0\">keynote</a>, <a href=\"https://www.dropbox.com/s/nanyxfo3cgq9y7s/effective-altruism.pptx?dl=0\">pptx</a>, and <a href=\"https://www.dropbox.com/sh/cl2ounpj1y48j8d/AAD-boyIYg5KvXfetuK1V7-ea?dl=0\">html</a>.  Here are some notes on the slides:</p>\n<ul>\n<li><p>The thought experiment on the second slide was Peter Singer's drowning child thought experiment.  After giving everyone a few seconds to think about the thought experiment, I asked everyone who thought there was 50% probability or higher that they would save the drowning child to raise their hand (inspired by <a href=\"http://www.aaronsw.com/weblog/handwritingwall\">this essay</a>).  Almost everyone raised their hands.</p>\n</li>\n<li><p>I threw in a few ideas that haven't seen wide discussion of in the effective altruist community.  For example, in the last chapter of Martin Seligman's book Learned Optimism he explains how he thinks that Western culture's focus on consumerism and our lack of purpose and connection has contributed to our depression epidemic, which I covered on slides 6-7.</p>\n</li>\n<li><p>On slide 9, I tried to make things concrete and interesting by suggesting that Scribd could save money by giving everyone Chromebooks to work with, but this would probably end up being bad for the company's bottom line in the long run because we would work less efficiently.</p>\n</li>\n<li><p>Another thing I haven't seen wide discussion of in the EA community is the analogy between groups like Givewell and scientists (see <a href=\"http://lesswrong.com/lw/l89/the_value_of_doing_ones_own_philanthropic_research/bl3o\">this LW comment</a> for more on this idea).  I discussed this on slides 11-12.</p>\n</li>\n<li><p>On slide 14, I discussed in depth the idea that doctors don't do all that much good due to replaceability effects.  (The 4 principles were stolen from <a href=\"http://www.benkuhn.net/ea-reading#on-thinking-like-an-effective-altruist\">Ben Kuhn's writeup</a>.)</p>\n</li>\n</ul>\n<p>Overall, I found this experience really encouraging.  Initially I was afraid that the drowning child thought experiment would make people hostile, but that didn't seem to happen at all... there wasn't any criticism of the idea even during the Q&amp;A period at the end.  I was also afraid that the talk tried to cram too many ideas in to just 10 minutes, which may have occurred but all the evidence I observed afterwards suggested to me that the concepts I tried to communicate were well-understood.  The people at Scribd are pretty smart though: the talk before mine was about the physics of motorcycle riding, and the talk after mine was by a champion Go player.  So a different presentation might be optimal for a different crowd.</p>\n<p>Although several people told me they thought the talk was good, I didn't hear much discussion about the concepts I presented afterwards.  And of course it's hard to measure whether people actually became significantly inclined towards effective altruism or not.  So in the long run we should still probably do rigorous message A/B testing.</p>\n", "parentCommentId": null, "user": {"username": "John_Maxwell_IV"}}, {"_id": "pS4seSGrRLW3FFhht", "postedAt": "2014-11-22T11:59:33.387Z", "postId": "JdqzNvvPscsghW8xR", "htmlBody": "<p>I just read <a href=\"http://meteuphoric.wordpress.com/2014/11/21/when-should-an-effective-altruist-be-vegetarian/\">Katja's post on vegetarianism</a> (recommended). I have also been convinced by arguments (from Beckstead and others) that resources can probably be better spent to influence the long-term future. Have you seen any convincing arguments that vegetarianism or veganism are competitively cost-effective ways of doing good?</p>\n", "parentCommentId": null, "user": {"username": "Daniel_Dewey"}}, {"_id": "SY4jDLbbi7wQtQeQ5", "postedAt": "2014-11-22T12:00:35.191Z", "postId": "JdqzNvvPscsghW8xR", "htmlBody": "<p>Related thought 1: I think some tension can be defused here by avoiding the framing &quot;should EAs be vegetarian?&quot;, since answering &quot;no&quot; makes it feel like &quot;EAs should not be vegetarian&quot;, when really it seems to me that it just implies that I can't put any costs incurred in my Altruism Budget, the same as costs I incur by doing other mundane good things.</p>\n", "parentCommentId": "pS4seSGrRLW3FFhht", "user": {"username": "Daniel_Dewey"}}, {"_id": "nDzKp7m77eMxcqish", "postedAt": "2014-11-22T12:01:21.687Z", "postId": "JdqzNvvPscsghW8xR", "htmlBody": "<p>Related thought 2: as someone who's already vegetarian, I think it would be more costly in terms of effort, bad feels, etc. to switch back than to stay veggie or slowly drift back over time.</p>\n", "parentCommentId": "pS4seSGrRLW3FFhht", "user": {"username": "Daniel_Dewey"}}, {"_id": "fkgNonGrTyLrmBrfB", "postedAt": "2014-11-22T12:06:32.305Z", "postId": "JdqzNvvPscsghW8xR", "htmlBody": "<p>Yes, that was a good argument that EAs aren't obligated to be vegetarian, even if reasonable people can disagree about the numbers.</p>\n", "parentCommentId": "pS4seSGrRLW3FFhht", "user": {"username": "Vincent_deB"}}, {"_id": "6gqvgiKYSC6Bh2rqn", "postedAt": "2014-11-22T12:06:33.126Z", "postId": "JdqzNvvPscsghW8xR", "htmlBody": "<p>Related thought 3: Katja's points about trading inconveniences and displeasures are interesting. Is it good to have a norm that all goods and &quot;currencies&quot; that take part in one's altruism budget and spending must be tradeable with one another? Is this psychologically realistic?</p>\n<p>One reason for thinking that goods in the altruism budget should be tradeable is that in some sense my Altruism Budget is what I call the part of my life where I take the <a href=\"http://en.m.wikipedia.org/wiki/Demandingness_objection\">demandingness</a> of ethics seriously. Is this how anyone else thinks about it?</p>\n", "parentCommentId": "pS4seSGrRLW3FFhht", "user": {"username": "Daniel_Dewey"}}, {"_id": "tJ4vTgfdfqqh7CLiF", "postedAt": "2014-11-22T12:15:56.981Z", "postId": "JdqzNvvPscsghW8xR", "htmlBody": "<p>Yes, I agree with this. It seems like it's easier to stay vegetarian. It's cheap, it feels good. It's probably not very disadvantageous to health. Long live the status quo - for diet ethics, at least.</p>\n", "parentCommentId": "nDzKp7m77eMxcqish", "user": {"username": "RyanCarey"}}, {"_id": "jtCFD7GdAyu4PEbzg", "postedAt": "2014-11-22T12:41:28.520Z", "postId": "JdqzNvvPscsghW8xR", "htmlBody": "<p>Yes, 'are altruistic people obligated to become vegetarian?' might be better</p>\n", "parentCommentId": "SY4jDLbbi7wQtQeQ5", "user": {"username": "RyanCarey"}}, {"_id": "AnwCswkNmFGPRTFbX", "postedAt": "2014-11-22T18:58:03.306Z", "postId": "JdqzNvvPscsghW8xR", "htmlBody": "<p>I loath the voting system. Actually, I have never clicked the up or down vote button once and I never will because it's juvenile to turn commenting on something as important as how to improve the world into a popularity contest. We are adults and should be treated like adults. It's not even useful, anyhow – I've found no correlation between the quality of the comment and its points. The highest rated comments are usually questions, or short comments like “thanks for this”. Does anyone else see the contradiction in a subculture that's purports to be about rationality bringing social approval bias into the mix? I value judging people's views solely on their merits; I don't want my judgement to be skewed by the judgement of “the group” and likewise, I only want people to judge my views by their merits, not by how popular they are.</p>\n<p>Besides skewing the logical reasoning of visitors to the forum, the voting system also promotes conservatism – people will naturally be too scared to write something original for fear of it having low points. I think that someone cannot think too broadly about how to help the world – crazy ideas should be welcomed! Perhaps most of them will be duds, but there only needs to be one that turns out to be a winner! Even without the voting system, posters have to deal with the judgement of other posters, but at least written comments can provide helpful feedback whereas simply having low votes will make the poster self-conscious and shy to write something against the grain. </p>\n", "parentCommentId": "AcRewmHzci26PduzX", "user": {"username": "Austen_Forrester"}}, {"_id": "tahFc9rkqvxohJbAT", "postedAt": "2014-11-24T02:51:40.865Z", "postId": "JdqzNvvPscsghW8xR", "htmlBody": "<p>Wow, this is amazing! It brings to mind the idea of a &quot;what kind of altruist are you?&quot; quiz, with the answer providing a link to the most relevant essay or two which might change your mind about something...</p>\n", "parentCommentId": "34EAZimPumnxHLQwx", "user": {"username": "Giles"}}, {"_id": "JbHbJzeZYFRr4iMp5", "postedAt": "2014-11-24T14:22:10.545Z", "postId": "JdqzNvvPscsghW8xR", "htmlBody": "<p>I don't think of it that way, because usually there are multiple important considerations on both sides of a disagreement.</p>\n<p>If someone raised a legitimate reason for their point of view, but I disagreed with their conclusion all things considered, I would not down-vote unless I thought the reason they were focussed on in their comment didn't make sense. That's rarely the case here; disagreements are most often about different weight given to different considerations.</p>\n", "parentCommentId": "RqhpCJfovafiuksM2", "user": {"username": "Robert_Wiblin"}}, {"_id": "WMqhWteNiqMZc2yf6", "postedAt": "2014-11-25T03:32:37.505Z", "postId": "JdqzNvvPscsghW8xR", "htmlBody": "<p>People often criticise GWWC for bad reasons. In particular, people harshly criticise it for not being perfect, despite not doing anything much of value themselves. Perhaps we should somewhat discount such armchair reasoning.</p>\n<p>However, if we do so, we should pay extra attention when people who have donated hundreds of millions of dollars, a majority of their net worth, and far more than most of us will, <a href=\"http://www.buzzfeed.com/rosiegray/exclusive-emails-reveal-deceased-hedge-fund-manager-refused\">have harsh criticism of giving pledges</a>.</p>\n", "parentCommentId": null, "user": {"username": "Larks"}}, {"_id": "KrfRqm3ajhKWao4QY", "postedAt": "2014-11-25T10:50:17.867Z", "postId": "JdqzNvvPscsghW8xR", "htmlBody": "<p>Pbhyq lbh ng yrnfg pnyy vg fbzrguvat bgure guna &quot;yvir orybj gur yvar&quot;.  V jbeel gung fbzr crbcyr zvtug svaq vg bssrafvir, nf yvir orybj gur yvar vf gurzrq fb urnivyl nebhaq cbiregl.  V qba'g frr jung rngvat gur fnzr purnc sbbq sbe n jrrx unf gb qb jvgu ZVEV/PSNE/PRN.  </p>\n", "parentCommentId": "MKWWwaZai9xdsdPZx", "user": {"username": "Niel_Bowerman"}}, {"_id": "J5F3Cjv8sehTwv2x7", "postedAt": "2014-11-25T10:58:14.937Z", "postId": "JdqzNvvPscsghW8xR", "htmlBody": "<p>From his email:</p>\n<p>&quot;When I talk to young people who seem destined for great success, I tell them to forget about charities and giving. Concentrate on your family and getting rich—which I found very hard work. I personally and the world at large are very glad you were more interested in computer software than the underprivileged when you were young. And don’t forget that those who don’t make money never become philanthropists.&quot;</p>\n<p>There is certainly truth in this.</p>\n<p>But not all of Wilson's giving was in areas suitable for effective altruism. In particular, donating to the Catholic Church arguably causes active harm. Preserving monuments and wildlife reserves is at least a good distance away from optimal.</p>\n<p>I think the strongest objection to his objection is that becoming rich doesn't make the world a better place in itself. Even if you make other people richer in the process, it's not a clear-cut world improvement. Especially if you consider replaceability effects and negative externalities from certain forms of business, making rich people more altruistic, and more effectively altruistic, could be more important than making more rich people.</p>\n", "parentCommentId": "WMqhWteNiqMZc2yf6", "user": {"username": "Nicholas_Bregan"}}, {"_id": "GgCw5xtQ9joLzWema", "postedAt": "2014-11-26T04:51:17.437Z", "postId": "JdqzNvvPscsghW8xR", "htmlBody": "<blockquote>\n<p>not all of Wilson's giving was in areas suitable for effective altruism. In particular, donating to the Catholic Church arguably causes active harm.</p>\n</blockquote>\n<p>Arguably donating to global health causes active harm (via the effect on fertility). Arguably veganism causes active harm (via wild animal suffering). Arguably donating to Xrisk causes active harm (ok, not so clear on the mechanism here, but I'm sure people have argued it). </p>\n<p>Yet these last three causes are EA causes. So merely 'arguably' causing active harm cannot be enough. What matters is how much actual good it does. And I think it is very plausible that the Catholic Church actually does a lot of good.</p>\n<p>Yes, perhaps donating to the Church is less effective than donating to SCI. On the other hand, it could be significantly less effective and him still have done more good with his donations than most EAs. Giving a lot more money slightly less efficiently does more good to others than giving a small amount of money very efficiently.</p>\n<p>More importantly, this doesn't really affect the argument. In general we should pay more attention to criticism when the critic is overcoming <a href=\"http://en.wikipedia.org/wiki/Social_desirability_bias\">social desirability bias</a>. And in this case, even if you disagree with his donation choices, he clearly scores very highly on altruism, which makes his criticism of our attempts to spread it all the more potent. Given </p>\n", "parentCommentId": "J5F3Cjv8sehTwv2x7", "user": {"username": "Larks"}}, {"_id": "4xG9jxqcQHZLKjg5w", "postedAt": "2014-11-26T07:53:50.302Z", "postId": "JdqzNvvPscsghW8xR", "htmlBody": "<p>Actually, my point was that donating to the Catholic Church does more harm than good, not just that it causes harm. Perhaps you should look up how little it spends on things like poverty relief, how much money it absorbs from presenting itself as an official institution of morality while spreading supernatural superstition and promoting socially harmful policies. I would probably pay money to make the Catholic Church poorer, though certainly not at a 1:1 exchange rate.</p>\n<p>I think the other EA causes you mention, while mixed blessings, have a much better profile.</p>\n<p>I do agree with Wilson's core argument, but would still point out that his money didn't come out of thin air, and neither would the money of other rich people. A lot of that is competing for profit margins, that is, a successfull hedge fund manager replaces other hedge fund managers. It can therefore be more effective to try to make rich people more altruistic rather than to make more people rich.</p>\n", "parentCommentId": "GgCw5xtQ9joLzWema", "user": {"username": "Nicholas_Bregan"}}, {"_id": "oquHhZAhEKh6jfQzx", "postedAt": "2014-11-26T12:43:15.143Z", "postId": "JdqzNvvPscsghW8xR", "htmlBody": "<p>The altruism budget idea is plausible. It works well when you're literally talking about money. For example, it's really psychologically difficult to face the decision of whether to redirect your funds to charity every time you buy a dinner or go to a movie. It's much better to take out a fixed fraction of your budget each month and give it away. Then, you can make non-altruistic decisions with your 'you' money without feeling selfish. Then, if you want to change the fraction of your budget that you give away, you make that decision at the end of the month or year.</p>\n<p>It seems reasonable that something like that should happen with time i.e. that effective altruists should retain a concept of &quot;leisure&quot;!</p>\n", "parentCommentId": "6gqvgiKYSC6Bh2rqn", "user": {"username": "RyanCarey"}}, {"_id": "pwQynfKYaku6hsETr", "postedAt": "2014-11-26T14:37:15.926Z", "postId": "JdqzNvvPscsghW8xR", "htmlBody": "<p>Yes, I think about it in the same way, and think that demanding or difficult non-monetary decisions like vegetarianism should fall into your altruism budget, where you should consider the trade-off between them and, say, donating money.</p>\n", "parentCommentId": "6gqvgiKYSC6Bh2rqn", "user": {"username": "Tom_Ash"}}, {"_id": "6FgeRvFWN37eN3jfk", "postedAt": "2014-11-26T15:34:57.014Z", "postId": "JdqzNvvPscsghW8xR", "htmlBody": "<p>But maybe it works poorly when things aren't obviously commodities. Like, I think there's a place for virtue ethics - just being the kind of person you would want to see in the world. And I think lots of people who take a virtue-based approach could reasonably object that always thinking of good in terms of money could be self-defeating.</p>\n<p>Also, some psychological studies apparently show that thinking about money decreases your generosity.</p>\n", "parentCommentId": "oquHhZAhEKh6jfQzx", "user": {"username": "RyanCarey"}}, {"_id": "2e6ujfXLwyPCDpztP", "postedAt": "2014-11-28T10:39:09.126Z", "postId": "JdqzNvvPscsghW8xR", "htmlBody": "<p>Is there an audio recording of Holden's &quot;Altruistic Career Choice Conference call&quot;? If so, can someone point me in the right direction. I'm aware of the transcript:</p>\n<p><a href=\"http://files.givewell.org/files/calls/Altruistic%20career%20choice%20conference%20call.pdf\">http://files.givewell.org/files/calls/Altruistic%20career%20choice%20conference%20call.pdf</a></p>\n<p>Thanks!</p>\n", "parentCommentId": null, "user": {"username": "imben"}}, {"_id": "nMqKZgAZkZzEjea5t", "postedAt": "2014-11-28T23:53:44.642Z", "postId": "JdqzNvvPscsghW8xR", "htmlBody": "<p>Michelle, I looked through all your posts and they're all really good, not even controversial, so I wouldn't assume that they were downvoted or had low points for a legit reason. If someone had a legit criticism of something you said, he should write what it is. That's the whole point of the forum: to exchange ideas. I don't find the points system affects that in a positive way. I think without points people would have to write what they're criticism of a post is and defend it. Button clicking seems more like an act of emotion to me.</p>\n", "parentCommentId": "XCt8iG6RaPZ8Q5ZSe", "user": {"username": "Austen_Forrester"}}, {"_id": "2bB54nQ9S3KANdfz8", "postedAt": "2014-11-29T04:34:45.345Z", "postId": "JdqzNvvPscsghW8xR", "htmlBody": "<p>Hi there! In this comment, I will discuss a few things that I would like to see 80,000 Hours consider doing, and I will also talk about myself a bit. </p>\n<p>I found 80,000 Hours in early/mid-2012, after a poster on LessWrong linked to the site. Back then, I was still trying to decide what to focus on during my undergraduate studies. By that point in time, I had already decided that I needed to major in a STEM field so that I would be able to earn to give. Before this, in late 2011, I had been planning on majoring in philosophy, so my decision in early 2012 to do something in a STEM field was a big change from my previous plans. I hadn't known which STEM field I wanted to major in at this point; I had only realized that STEM majors generally had better earning potentials than philosophy majors.</p>\n<p>The way that this ties back into 80,000 Hours is that I think that I would have liked someone to help me decide which STEM field to go into. Actually, I can't find any discussion of choosing a college major on the 80,000 Hours site, though there are <a href=\"http://lesswrong.com/lw/jzy/career_prospects_for_physics_majors/\">a</a> <a href=\"http://lesswrong.com/lw/9tp/which_college_major/\">couple</a> of threads on this topic posted to LessWrong. I would like to see an in-depth discussion page on major choice as one of the core posts on 80,000 Hours.</p>\n<p>Anyhow, I ended up majoring in chemistry because it seemed like one of the toughest things that I could major in-- I made this decision under the rule-of-thumb that doing hard things makes you stronger. I probably should have majored in mathematics, because I actually really enjoy math, and have gotten good grades in most of my math classes; neither of those two things are true of the chemistry classes I have taken. I think that my biggest previous misconception about major choice was that all STEM majors were roughly equal in how well they prepared you for the job market-- looking back, I feel that CS and Math are two of the best choices for earning to give, followed by engineering and then biology, with chemistry and physics as the two worst options for students interested in earning to give. Of course, YMMV, and people with physics degrees do go into quantitative finance, but I do think that not all STEM majors are equally useful for earning to give.</p>\n<p>The second thing that I would like to mention is that, <em>from my point of view</em>, 80,000 Hours seems very elitist. I don't mean this in a bad way, <em>really</em>, I don't, but it is hard to be in <a href=\"https://80000hours.org/career-guide/top-careers/profiles/trading-in-quantitative-hedge-funds/\">the top third</a> of mathematics graduates from an ivy league university. The first time that I had a face-to-face conversation with an effective altruist who had been inspired by 80,000 Hours, I told them that I was planning on doing important scientific research, and they just gave me a <em>look</em> and asked me why I wasn't planning on going into one of the more lucrative earning-to-give type of careers.</p>\n<p>I am sure that this person is a good person, but this episode leads me to wonder if adding more jobs that very smart people who aren't quite ready to go into quantitative finance or strategic consulting could do to the <a href=\"https://80000hours.org/career-guide/top-careers/\">top careers</a> page on 80,000 Hours' site would be a good idea. Specifically, mechanical, chemical, and electrical engineering, as well as the actuarial sciences, could be acceptable fields for one to go into for earning to give.</p>\n", "parentCommentId": null, "user": {"username": "Fluttershy"}}, {"_id": "663z5Zpj9GAZH8fht", "postedAt": "2014-11-29T04:58:22.026Z", "postId": "JdqzNvvPscsghW8xR", "htmlBody": "<p>Seems like 80K could probably stand to link to more of Cognito Mentoring's old stuff in general.  No reason to duplicate effort.</p>\n", "parentCommentId": "2bB54nQ9S3KANdfz8", "user": {"username": "John_Maxwell_IV"}}, {"_id": "tKntqHeaBzrB7djNH", "postedAt": "2014-11-29T10:24:31.932Z", "postId": "JdqzNvvPscsghW8xR", "htmlBody": "<p>Not to take away from the substance of your post, but when you note that impact is power-law distributed, doing important scientific research sounds (much)[<a href=\"https://80000hours.org/2012/08/should-you-go-into-research-part-1/]\">https://80000hours.org/2012/08/should-you-go-into-research-part-1/]</a> (more skill-dependent)[<a href=\"https://80000hours.org/2013/01/should-you-go-into-research-part-2/]\">https://80000hours.org/2013/01/should-you-go-into-research-part-2/]</a> than quantitative finance.</p>\n", "parentCommentId": "2bB54nQ9S3KANdfz8", "user": {"username": "RyanCarey"}}, {"_id": "skHLDqe9FgmGpx2gb", "postedAt": "2014-11-29T22:21:09.409Z", "postId": "JdqzNvvPscsghW8xR", "htmlBody": "<p>Something can be well-reasoned but still be disagreeable if it ignores an important consideration.</p>\n", "parentCommentId": "RqhpCJfovafiuksM2", "user": {"username": "Peter_Hurford"}}, {"_id": "ycSKmgXEDJPfyAp5R", "postedAt": "2014-11-29T22:22:54.107Z", "postId": "JdqzNvvPscsghW8xR", "htmlBody": "<p>I personally think that if someone downvotes something, especially a post where it costs -10 on karma, then they owe that person a brief explanation for the downvote.</p>\n", "parentCommentId": "AcRewmHzci26PduzX", "user": {"username": "Peter_Hurford"}}, {"_id": "g7drxwr5LbZLMtJw4", "postedAt": "2014-11-30T06:59:10.055Z", "postId": "JdqzNvvPscsghW8xR", "htmlBody": "<p>I think people have a tendency, though, to think that vegetarianism is more costly than it actually is, though.  So I'm skeptical unless a person has actually tried to give up meat and faced some sort of problem.  For example, I'm not vegan because of social pressure, but I am vegetarian.</p>\n<p>At heart, even if you eat meat, there's no reason I can fathom why you can't simply try to eat less of it...</p>\n", "parentCommentId": "pS4seSGrRLW3FFhht", "user": {"username": "Peter_Hurford"}}, {"_id": "5D2fPeheTvJLWDhXC", "postedAt": "2014-11-30T07:00:30.316Z", "postId": "JdqzNvvPscsghW8xR", "htmlBody": "<p>Would you be raising money mainly from an EA audience?  The idea of &quot;living below the line&quot; seems to have no connection at all to MIRI / CFAR, so it kind of feels like a non sequiter to non-EAs.  Maybe more thematic would be living without computers (or without rationality!), but that seems not worthwhile.</p>\n", "parentCommentId": "MKWWwaZai9xdsdPZx", "user": {"username": "Peter_Hurford"}}, {"_id": "unuZAuuDoS5gjJGSz", "postedAt": "2014-11-30T08:02:04.080Z", "postId": "JdqzNvvPscsghW8xR", "htmlBody": "<p>Hi UriKatz, there's a group of us trying to do just that, and we'd love to have your help. Join the EA Nerdfighters Facebook group and I'll brief you on what we've been up to. :)</p>\n<p><a href=\"https://www.facebook.com/groups/254657514743021/\">https://www.facebook.com/groups/254657514743021/</a></p>\n", "parentCommentId": "MGndE6vLx42KxgTLP", "user": {"username": "Roxanne_Heston"}}, {"_id": "qaJ34mq5AdtZpfyvZ", "postedAt": "2014-11-30T12:00:17.879Z", "postId": "JdqzNvvPscsghW8xR", "htmlBody": "<p>You may be right that people overestimate the cost. I'm not sure how to gather data about this.</p>\n<p>Re: your second point (&quot;there's no reason I can fathom...&quot;), how about this lens: view meat as a luxury purchase, like travel, movies, video games, music, etc. Instead of spending on these, you <em>could</em> donate this money, and I can imagine making a similar argument: &quot;there's no reason I can fathom why you can't simply try to do less of that...&quot;, but clearly we see foregoing luxuries as a cost of some kind, and don't think that it's reasonable to ask EAs to give up all their luxuries. When one does give up luxuries for altruistic reasons, I think it's fine to try to give up the ones that are subjectively least costly to give up, and that will have the biggest impact.</p>\n<p>Other costs: changing your possibly years-long menu for lunch and dinner; feeling hungry for a while if you don't get it figured out quickly; having red meat cravings (much stronger for some people than others, e.g. not bad for me, but bad for Killian).</p>\n<p>I don't think what I've said is a case against vegetarianism; just trying to convey how I think of the costs.</p>\n<p>ETA: there are other benefits (and other costs), this is just my subjective slice. An expert review, on which individuals can base their subjective cost breakdowns, would probably be helpful.</p>\n", "parentCommentId": "g7drxwr5LbZLMtJw4", "user": {"username": "Daniel_Dewey"}}, {"_id": "WakFmYDn5smdwje5X", "postedAt": "2014-11-30T15:31:12.024Z", "postId": "JdqzNvvPscsghW8xR", "htmlBody": "<p>I guess if we get a Hansonian future the line would be very low. It's unlikely pre-upload Rob could actually survive at such a level though, so probably not the best idea.</p>\n", "parentCommentId": "5D2fPeheTvJLWDhXC", "user": {"username": "Larks"}}, {"_id": "zAPCnMS9hKtbBhFBq", "postedAt": "2014-11-30T18:57:20.093Z", "postId": "JdqzNvvPscsghW8xR", "htmlBody": "<p>&quot;Actually, I can't find any discussion of choosing a college major on the 80,000 Hours site, though there are a couple of threads on this topic posted to LessWrong.&quot;</p>\n<p>Not a tremendous excuse, but it wouldn't surprise me if this is basically because 80k is UK-based, where there is no strong analogue to 'choosing a major' as practised by US undergraduates; by the time someone is an undergraduate in the UK (actually, probably many months before that, given application deadlines), they've already chosen their subject and have no further choices to make on that front except comparatively minor specialisation choices.</p>\n", "parentCommentId": "2bB54nQ9S3KANdfz8", "user": {"username": "AGB"}}, {"_id": "RnFYZXwTSW65CQDKv", "postedAt": "2014-12-01T16:24:05.684Z", "postId": "JdqzNvvPscsghW8xR", "htmlBody": "<p>The fact that it's a bit of a non-sequitur is why I find it a fun idea.</p>\n<p>It sounds like most people see it as outright weird, rather than quirky in an amusing way as I intended, so I won't do it.</p>\n", "parentCommentId": "5D2fPeheTvJLWDhXC", "user": {"username": "Robert_Wiblin"}}, {"_id": "FN88KJ2aNuErDmf5i", "postedAt": "2014-12-03T23:08:01.067Z", "postId": "JdqzNvvPscsghW8xR", "htmlBody": "<p>Hi Fluttershy,</p>\n<p>Really appreciate hearing you're feedback.</p>\n<p>We've written about how to choose what subject to study <a href=\"https://80000hours.org/topic/other-topics/choosing-education/\">a bunch of times</a>, but I agree it's hard to find, and it's not a major focus of what we do. Unfortunately we have very limited research capacity and have decided to focus on choosing jobs rather than subjects because we think we'll be able to have more impact that way. In the future I'd love to have more content on subject choice though.</p>\n<p>I also realise our careers list comes across badly. I'm really keen to expand the range of careers that we consider - we're trying to hire someone to do more career profiles but haven't found anyone suitable yet. Being an actuary and engineering are both pretty high on the list.</p>\n<p>I also know that a lot of people around 80,000 Hours think most people should do earning to give. That's not something I agree with. Earning to give is just one of a <a href=\"https://80000hours.org/career-guide/top-careers/strategies/\">range of strategies</a>.</p>\n<p>Ben</p>\n", "parentCommentId": "2bB54nQ9S3KANdfz8", "user": {"username": "Benjamin_Todd"}}, {"_id": "oy65hRTYzoisvfG3u", "postedAt": "2014-12-03T23:08:27.510Z", "postId": "JdqzNvvPscsghW8xR", "htmlBody": "<p>Yeah I'll add a link to Cognito on the best resources page next time I update it.</p>\n", "parentCommentId": "663z5Zpj9GAZH8fht", "user": {"username": "Benjamin_Todd"}}, {"_id": "Eby5CAn9T4TdFhQXc", "postedAt": "2014-12-10T00:15:53.968Z", "postId": "JdqzNvvPscsghW8xR", "htmlBody": "<p>I thought that the voting system is beneficial primarily because it allows others to &quot;upvote&quot; something as important. When I glance at comments, I am unlikely to read dozens of comments (limited time), but the upvotes are a simple way for me to tell which comments are more likely to provide something of value. </p>\n<p>Upvotes are not a true demonstration of value, but they help. Consider if a comment gets 100 upvotes - that suggests there is something there that others like and I would do well to at least glance at it.</p>\n<p>The points you raise are worth considering, though I think the benefits outweigh the concerns you have. Do you think otherwise?</p>\n", "parentCommentId": "AnwCswkNmFGPRTFbX", "user": {"username": "yboris"}}, {"_id": "hghd2j8Ntk6KnNDBH", "postedAt": "2014-12-10T00:32:38.899Z", "postId": "JdqzNvvPscsghW8xR", "htmlBody": "<p>There is a brochure created by Fox Moldrich that I edited (he shared the Adobe Illustrator file with me). Here is a PDF of it: <a href=\"https://www.dropbox.com/s/jpcjarysntk1ih5/EA%20Brochure%20%28J%20MOLDRICH%29%20v7.1%20%28Boris%20Edit%29.pdf?dl=0\">Trifold</a></p>\n<p>Please contact me for the *.AI file and/or directly contact Fox.</p>\n", "parentCommentId": "4tekZ8i8RPCzmXSWg", "user": {"username": "yboris"}}, {"_id": "BM3JFRGYwcYE74A4W", "postedAt": "2014-12-10T22:33:54.390Z", "postId": "JdqzNvvPscsghW8xR", "htmlBody": "<p>If someone thinks that the better comments have higher votes, then certainly for him the points system would be helpful, especially for long threads. I don't find that's usually the case, which is one reason why I'm not fond of it. I find that people “like” (whether that means clicking a button on your computer, or agreeing to someone in person) things that validate their pre-existing feelings, rather than open them up to new ideas they hadn't considered before (most respond with fear to the latter). I heard on the radio a few months ago that studies show that problem solving meetings are more productive when the people there have opposing perspectives, come from different fields, etc. IOW, the perspective you don't want to hear is probably the one you need to. </p>\n<p>Having said that, even if the points system doesn't correlate with the most helpful comments it could still be net positive for other reasons: encouraging more participation than it discourages, providing support/validation for those interested in EA, being normal (since most sites have voting now, people might think it was weird if CEA didn't).</p>\n<p>Another thing, that just occurred to me yesterday, is that the posts on the forum seem mostly geared to people who are already involved in EA, when it could be more productive to write posts that are geared to new people learning about EA (both in terms of content and writing style). TLYCS/GWWC blogs are more like that, although they are only for poverty. </p>\n", "parentCommentId": "Eby5CAn9T4TdFhQXc", "user": {"username": "Austen_Forrester"}}, {"_id": "GsEw93bmTwNSBpAzy", "postedAt": "2014-12-11T17:39:54.803Z", "postId": "JdqzNvvPscsghW8xR", "htmlBody": "<p>yeah, I agree that we've talked about effective altruism using the assumption that people already know roughly what that is and why we would care about it. It's a good idea to post more material that is of interest to a wider audience. Although having started off with stuff that affirms the purpose of the forum and our shared identity is not a bad thing, it's just that it'd be good to balance it out now with some materials that a wider range of people can enjoy.</p>\n", "parentCommentId": "BM3JFRGYwcYE74A4W", "user": {"username": "RyanCarey"}}]