[{"_id": "kd6vPfmshkZQgH59B", "postedAt": "2024-01-15T13:49:12.605Z", "postId": "JDXsPZwb23ybgWL94", "htmlBody": "<p>I was surprised to see that the Finance position is volunteer. It seems not in line with the responsibilities?</p>\n", "parentCommentId": null, "user": {"username": "SiebeRozendal"}}, {"_id": "WsgF9dKqAYjqDWjWh", "postedAt": "2024-01-15T14:10:00.937Z", "postId": "JDXsPZwb23ybgWL94", "htmlBody": "<p>In case this question was aimed at me, I'm just link-posting this because I thought people might be interested: I can't answer questions about the role (the above is ~all I know)</p>", "parentCommentId": "kd6vPfmshkZQgH59B", "user": {"username": "tobytrem"}}, {"_id": "3r7AMgxStcnyhdGyZ", "postedAt": "2024-01-16T21:59:20.709Z", "postId": "JDXsPZwb23ybgWL94", "htmlBody": "<p>I know! I wanted to tag Jan Willem van Putten but didn't know how to do that (on mobile)</p>\n", "parentCommentId": "WsgF9dKqAYjqDWjWh", "user": {"username": "SiebeRozendal"}}, {"_id": "Apx9Yvv4cfr68yg9S", "postedAt": "2024-01-17T15:14:30.856Z", "postId": "JDXsPZwb23ybgWL94", "htmlBody": "<p><a href=\"https://forum.effectivealtruism.org/users/jan-willem?mention=user\">@Jan-Willem</a>&nbsp;</p>", "parentCommentId": "3r7AMgxStcnyhdGyZ", "user": {"username": "David Mears"}}, {"_id": "c4KCbJozefhy32Ss4", "postedAt": "2024-01-18T21:37:07.128Z", "postId": "JDXsPZwb23ybgWL94", "htmlBody": "<p>In the meantime: good spot. I assume <i>they</i> assumed that an experienced \"finance\" person could probably take on this part-time role pro bono.</p>", "parentCommentId": "Apx9Yvv4cfr68yg9S", "user": {"username": "GuillaumeVrx"}}, {"_id": "2jbHEAAHot9xf8upr", "postedAt": "2024-01-19T11:32:38.278Z", "postId": "JDXsPZwb23ybgWL94", "htmlBody": "<p>I wanted to question the €1000 per month for the internships? (Note I appreciate the forum poster isn’t responsible) To me this amount seems exploitative and I’d like to know the The School of Moral Ambition’s reasoning behind this.</p>\n<p>These internships are 6-12 months long, based in Amsterdam - which is an expensive place to live. From the government’s own website, minimum wage for 21+ is €2,317.83 per month, and the €1000 offered will barely cover living costs.</p>\n<p>I recognise that the organisation's ambitions are good and that internships offering this amount are not infrequent in the Netherlands. However, I don’t think this provides an excuse.</p>\n<ol>\n<li>\n<p>This is not an internship at the IMF or an investment bank, where the role has a large value in future employment. These are roles in operations and event management.</p>\n</li>\n<li>\n<p>This pay level encourages elitism within EA - most people who take this job will need support from family or reliance on savings. Those from a low income background are heavily penalised given the wage is much lower than minimum wage.</p>\n</li>\n<li>\n<p>More importantly, even if this behaviour is acceptable in other industries, we should ask if this is how we, the EA community, want to treat our young talent. In my eyes, we can do a lot better.</p>\n</li>\n</ol>\n", "parentCommentId": null, "user": {"username": "SamG"}}, {"_id": "BxpQBiektCRJkwuQL", "postedAt": "2024-01-22T15:16:49.235Z", "postId": "JDXsPZwb23ybgWL94", "htmlBody": "<p>I think this is a real concern. But a few observations to add:</p><ul><li>Points 1 and 2 appear to be somewhat in tension. The strongest argument for penalization in point 2, to me, is that EAs from a lower income background are unable to participate in an internship that has a significant value in career advancement. However, point 1 is based on the assumption that the role does not have such a value.</li><li>I'm inclined to give <i>somewhat </i>more grace to new, lean organizations than to established &amp; well-funded organizations on this issue. I believe upstart nonprofits generally pay even less than nonprofits generally, and that may be a consequence of the funding situation those organizations often face.&nbsp;</li><li>Therefore, I'm not sure it is appropriate to put too much of the burden of being better than other industries (cf. point 3) on cash-strapped organizations. To the extent that there are ecosystem-wide goals here (like promoting meritocracy rather than privilege), it may be more appropriate to evaluate them at the ecosystem level rather than primarily at the organizational level. It may be possible to achieve those goals while giving newer, leanly-funded organizations more of a pass.<ul><li>If it really is critical to have all entry-level positions paying a certain floor wage, then funders probably need to offer grants specifically for that (or size their regular grants accordingly and include a restriction against paying anyone less than the specified floor).</li></ul></li><li>In some non-profits -- certain types of religious work come to mind -- the worker is expected to fundraise part or all of their own salary. This system has its problems for sure, but it's not obvious untenable to offer partially-funded positions with the expectation that candidates would need to find grants, do fundraising, etc.&nbsp;<ul><li>Of course, the organization or someone else would need to provide appropriate support (e.g., in the US, one can generally get tax-deductibility for this kind of thing if jumping through the right hoops).</li></ul></li><li>None of this is intended to imply a view that the offered salary is acceptable; I think it probably is not. But I wouldn't, for instance, endorse a position that any salary under €2,317.83 per month is per se exploitative.<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefy1xd60rmm5g\"><sup><a href=\"#fny1xd60rmm5g\">[1]</a></sup></span></li></ul><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fny1xd60rmm5g\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefy1xd60rmm5g\">^</a></strong></sup></span><div class=\"footnote-content\"><p>I don't read your comment as making such an assertion.</p></div></li></ol>", "parentCommentId": "2jbHEAAHot9xf8upr", "user": {"username": "Jason"}}, {"_id": "hhrqxZCEeWRnLig35", "postedAt": "2024-01-24T13:47:23.379Z", "postId": "JDXsPZwb23ybgWL94", "htmlBody": "<p>I don't know if you're familiar with the Netherlands but I think EUR 1000 is quite a lot for an intern here. See <a href=\"https://dutchreview.com/expat/guide-internships-in-the-netherlands/\">this</a> article for more info.<br><br>I'm still undecided about intern salaries in the Netherlands. Initially, I was surprised by how low they are, but then it was pointed out to me that interns here face a different situation to what they would face elsewhere. For one, students receive substantial financial support, and secondly, they can travel cheaply due to the Student Travel Product. Basically, it feels very different from my experience in the UK (and very different from what I have heard about the US).&nbsp;<br><br>But I'm also biased because I know the people behind SMA.</p>", "parentCommentId": "2jbHEAAHot9xf8upr", "user": {"username": "James Herbert"}}, {"_id": "y8xCRhZj5aATBa3mD", "postedAt": "2024-01-25T01:55:20.227Z", "postId": "JDXsPZwb23ybgWL94", "htmlBody": "<p>Many students in the Netherlands don't receive these benefits 😔. If you are Dutch, it's easy to get it. But <a href=\"https://www.government.nl/latest/news/2023/04/21/steps-to-improve-the-management-of-incoming-international-students\">internationals now make up 40% of incoming university students </a>(and I think there are a disproportionate amount of internationals in the Dutch EA community), and even for EU students there are a lot <a href=\"https://duo.nl/particulier/student-finance/eligibility.jsp\">more barriers</a> -- you have to have lived in the Netherlands for at least 5 years, a parent or partner needs to work in the Netherlands, or you have to be employed -- internships unfortunately don't count as an eligible employment contract. On top of that, the eligibility for student finance dictates your eligibility for the student travel product.</p><p>Anecdotally, many (international) students I know at uni have not pursued internships for this reason (low wage + no govt benefits).</p>", "parentCommentId": "hhrqxZCEeWRnLig35", "user": {"username": "liam"}}, {"_id": "wCa5uqix4KeFhks8C", "postedAt": "2024-01-25T08:42:13.229Z", "postId": "JDXsPZwb23ybgWL94", "htmlBody": "<p>That’s a good point Liam, thanks! I should have mentioned it since I was an EU student myself and went through the same thing…</p>\n", "parentCommentId": "y8xCRhZj5aATBa3mD", "user": {"username": "James Herbert"}}, {"_id": "WCKiyE3wJC5YRMqoo", "postedAt": "2024-02-06T07:36:34.162Z", "postId": "JDXsPZwb23ybgWL94", "htmlBody": "<p>To be honest, I don't really see these kinds of comments criticising young organisations that likely have access to limited amounts of funding to be helpful. I think there are some valid issues to be discussed, but I'd much rather see them discussed at an ecosystem level. Sure, it's less than ideal that low-paid internships provide an advantage to those from a particular class, but it's also easier for wealthier people to gain a college degree as well, I think it'd be a mistake for us to criticise universities for offering college degrees. At least with these internships, you're being paid something, as opposed to accruing debt, so they're actually much more accessible than the comparative.</p><p>But I suppose this doesn't address my real objection which is that there are people who are willing to work to make the world better and an organisation that is willing to provide them with some financial support to make it happen. In return, these people gain the opportunity to develop new skills and if these interns are particularly talented, they are likely to be referred on to further opportunities. They might even change the course of someone's career: someone who was just going to go into the business world might end up having a highly impactful career instead.</p><p>So I guess it just feels like that given how many benefits there are, we should have a really high bar for standing in the way of things. And I don't really feel that this is met here. There's so much that is horrible in the world, but we have the opportunity to change that. And if that involves a large number of 1000 EURO/month internships, well, that seems like an incredibly low price to pay.</p>", "parentCommentId": "2jbHEAAHot9xf8upr", "user": {"username": "casebash"}}]