[{"_id": "dYEbgpzzTDFAxB5aa", "postedAt": "2023-01-09T17:40:12.508Z", "postId": "JeR7HcuNpnb87JPaG", "htmlBody": "<p>I think a rebrand is likely too late. But if it's possible, I wonder if something with 'Global Priorities' in the name would be great. We could copy Progress Studies and go for Global Priorities Studies, or call ourselves the Global Priorities Movement.</p>\n", "parentCommentId": null, "user": {"username": "Jeroen_W"}}, {"_id": "AmgxQEBacmEpQxxPs", "postedAt": "2023-01-09T18:47:20.989Z", "postId": "JeR7HcuNpnb87JPaG", "htmlBody": "<p>A rebrand at the moment would look like a  attempt to disassociate from SBF/FTX, and might earn a long-term reference to \"the New Name movement, which rebranded itself from EA to disassociate from FTX/SBF....\"</p>\n", "parentCommentId": "dYEbgpzzTDFAxB5aa", "user": {"username": "Jason"}}, {"_id": "pbxwy73BaXic54veo", "postedAt": "2023-01-09T19:02:38.054Z", "postId": "JeR7HcuNpnb87JPaG", "htmlBody": "<p>One difference is that Melinda owns the money she’s putting into the Bill &amp; Melinda Gates Foundation. From a certain cynical point of view, EA is mostly a bunch of white entitled Silicon Valley men with a side hustle as “charity influencers,” obsessed with how rich people spend their money, but who don’t themselves actually have much to give. Melinda is making a sacrifice, EAs are just smiling at the ribbon-cutting. Furthermore, Melinda exclusively focused on issues that read as charitable, while EA’s high interest in X-risk can be portrayed as sci-fi anxieties. It also probably helps that Melinda didn’t herself do anything morally questionable to acquire her money - she convinced a man who’d formerly been seen as a selfish tech villain to donate their fortune.</p>\n<p>EA has a wide attack surface, and I think we’d sustain big coordination costs to change our name, while not appreciably decreasing the size of that attack surface. Besides, “beset by scandal, shadowy Silicon Valley movement rebrands itself to hide from scrutiny” is a story that writes itself.</p>\n", "parentCommentId": null, "user": {"username": "AllAmericanBreakfast"}}, {"_id": "yMobFuyk2d3BtdpTE", "postedAt": "2023-01-09T19:10:25.751Z", "postId": "JeR7HcuNpnb87JPaG", "htmlBody": "<p>Of course, Gates has several advantages over EA in this regard. The Gates cause areas are more popular than longtermism, which attracts a greater amount of attention than its actual share of the \"EA budget\" so far. Gates has little need to attract adherents or additional financing -- and if this is happening, it is largely in private conversations with other megarich persons not in the public eye. So there's less need to compete in the marketplace for donors/adherents. Some of EA's best arguments, especially those grounded in utilitarianism, are inherently going to draw objections from large swaths of the public. Gates doesn't have to compete and thus ruffles fewer feathers.</p>\n<p>The Gates movement has a lot of fairly establishment figures vs. EA being much more heavily a 20s/30s movement + sometimes edgy academics. That has its pros and cons, as does the Gates movement's greater centralization. In a sense, EA is like a group of startups and the Gates movement is like IBM. Each setup has certain advantages and challenges.</p>\n<p>My branding take is that not everything needs to be done under the same brand name. Corporations know how to do this -- think of your big hotel chains with 30+ brands so they can compete at different price points without devaluing their prestige brands.</p>\n", "parentCommentId": null, "user": {"username": "Jason"}}, {"_id": "LaaJkQ2azmwftLDmj", "postedAt": "2023-01-10T02:47:06.646Z", "postId": "JeR7HcuNpnb87JPaG", "htmlBody": "<p>Agreed. If we were to rebrand, now would be the wrong time.</p>", "parentCommentId": "AmgxQEBacmEpQxxPs", "user": {"username": "casebash"}}, {"_id": "jCSEFznhm8NZCoH4X", "postedAt": "2023-01-10T02:48:31.972Z", "postId": "JeR7HcuNpnb87JPaG", "htmlBody": "<p>\"Cause Agnostic Altruism\" doesn't really roll off the tongue though.</p>", "parentCommentId": null, "user": {"username": "casebash"}}, {"_id": "c3c3yYkDbvzCo8Axy", "postedAt": "2023-01-10T22:38:45.602Z", "postId": "JeR7HcuNpnb87JPaG", "htmlBody": "<p>A possible name that I don’t instantly hate just popped into my mind: aspirational altruism.</p>\n<p>I don’t love the AA shorthand but the connotation seems apt to what this movement is about. Really aspiring to do the most good but recognizing how that’s only an ideal that can never be reached.</p>\n<p>Some variations on this theme seem possible as well like ambitious altruism or daring altruism.</p>\n<p>But, yeah wouldn’t hold my breath for a rebranding of EA that ship has mostly sailed. Maybe new adjacent communities will pop up though.</p>\n", "parentCommentId": null, "user": {"username": "alexherwix"}}]