[{"_id": "Ajr5GheWuo23cvkEw", "postedAt": "2024-03-02T15:59:31.611Z", "postId": "JGazpLa3Gvvter4JW", "htmlBody": "<p>Thanks for the post, Chi and Will. Somewhat relatedly, I liked Veritasium video on <a href=\"https://www.youtube.com/watch?v=mScpHTIi-kM&amp;ab_channel=Veritasium\">What Game Theory Reveals About Life, The Universe, and Everything</a>.</p><blockquote><p><strong>Spatio-temporal expanse.</strong>&nbsp;The universe is very plausibly spatially infinite.</p></blockquote><p>I do not think there is any empirical evidence for this. We can only measure finite quantities, so any measurement we make would be perfectly compatible with a large finite universe. In other words, empirical evidence can update one towards a larger universe, but not from a finite to an infinite one. So my understanding is that claims about the universe being infinite rest entirely on having a prior with some probability mass on this possibility.</p><blockquote><p>The universe is <a href=\"https://en.wikipedia.org/wiki/Flatness_problem\"><u>measured to be almost exactly flat</u></a>: to a first approximation, under a uniform prior and ignoring anthropic considerations, this gives us 50% probability that the universe is positively curved and therefore finite, and 50% probability that the universe is negatively curved and therefore infinite.</p></blockquote><p>Note the universe is measured to be almost exactly flat locally. If I am looking into a straight railway track which extends a few kilometers in my field of view, it would maybe not be reasonable for me to conclude it is infite in expectation. A reasonable probability density function (<a href=\"https://en.wikipedia.org/wiki/Probability_density_function\">PDF</a>) for its length would decay sufficiently fast to 0 as the length increases, such that the expected length is still finite. Similarly, even though the universe looks flat locally (like the Earth does in some places, even though it is not), I feel like it would be reasonable to have a PDF describing its size which decays to 0 as the size increases. The tail of the PDF would have to decay faster than the squared size for the expected size to be finite<span class=\"footnote-reference\" data-footnote-reference=\"\" data-footnote-index=\"1\" data-footnote-id=\"7d7nvcjp4nt\" role=\"doc-noteref\" id=\"fnref7d7nvcjp4nt\"><sup><a href=\"#fn7d7nvcjp4nt\">[1]</a></sup></span>.</p><ol class=\"footnote-section footnotes\" data-footnote-section=\"\" role=\"doc-endnotes\"><li class=\"footnote-item\" data-footnote-item=\"\" data-footnote-index=\"1\" data-footnote-id=\"7d7nvcjp4nt\" role=\"doc-endnote\" id=\"fn7d7nvcjp4nt\"><span class=\"footnote-back-link\" data-footnote-back-link=\"\" data-footnote-id=\"7d7nvcjp4nt\"><sup><strong><a href=\"#fnref7d7nvcjp4nt\">^</a></strong></sup></span><div class=\"footnote-content\" data-footnote-content=\"\"><p>The mean of a <a href=\"https://en.wikipedia.org/wiki/Pareto_distribution\">Pareto distribution</a> would be infinite otherwise.</p></div></li></ol>", "parentCommentId": null, "user": {"username": "vascoamaralgrilo"}}, {"_id": "X7ubKDr9TnrE6xcxZ", "postedAt": "2024-03-02T17:15:19.081Z", "postId": "JGazpLa3Gvvter4JW", "htmlBody": "<p>Hi Vasco, I’m having trouble parsing your comment. For example, if the universe’s large-scale curvature is exactly zero (and the universe is&nbsp;<a href=\"https://en.wikipedia.org/wiki/Simply_connected_space\"><u>simply connected</u></a>), then by definition it’s infinite, and I’m confused as to why you think it could still be finite (if this is what you’re saying; apologies if I’m misinterpreting you).</p><p>I’m not sure what kind of a background you already have in this domain, but if you’re interested in reading more, I’d recommend first going to the “<a href=\"https://en.wikipedia.org/wiki/Shape_of_the_universe\"><u>Shape of the universe</u></a>” Wikipedia page, and then, depending on your mileage, lectures 10–13 of Alan Guth’s&nbsp;<a href=\"https://ocw.mit.edu/courses/8-286-the-early-universe-fall-2013/video_galleries/video-lectures/\"><u>introductory cosmology lecture series</u></a>.</p>", "parentCommentId": "Ajr5GheWuo23cvkEw", "user": {"username": "Will Aldred"}}, {"_id": "W7TPPkpXD85ZcE72h", "postedAt": "2024-03-02T18:00:30.554Z", "postId": "JGazpLa3Gvvter4JW", "htmlBody": "<p>Thanks for following up, Will!</p><blockquote><p>if the universe’s large-scale curvature is exactly zero (and the universe is&nbsp;<a href=\"https://en.wikipedia.org/wiki/Simply_connected_space\"><u>simply connected</u></a>), then by definition it’s infinite</p></blockquote><p>I agree. However, my understanding is that it is impossible to get empirical evidence supporting exactly zero curvature, because all measurements have finite sensitivity. I guess the same applies to the question of whether the universe is simply connected. In general, I <a href=\"https://forum.effectivealtruism.org/posts/weBqHK7J32FE5oozd/why-i-am-happy-to-reject-the-possibility-of-infinite-worlds\">assume</a> zeros and infinities do not exist in the real world, even though they are useful in maths and physics to think about limiting processes.</p><blockquote><p>I’m not sure what kind of a background you already have in this domain, but if you’re interested in reading more, I’d recommend first going to the “<a href=\"https://en.wikipedia.org/wiki/Shape_of_the_universe\"><u>Shape of the universe</u></a>” Wikipedia page, and then, depending on your mileage, lectures 10–13 of Alan Guth’s&nbsp;<a href=\"https://ocw.mit.edu/courses/8-286-the-early-universe-fall-2013/video_galleries/video-lectures/\"><u>introductory cosmology lecture series</u></a>.</p></blockquote><p>Thanks for the links. I had skimmed that Wikipedia page.</p>", "parentCommentId": "X7ubKDr9TnrE6xcxZ", "user": {"username": "vascoamaralgrilo"}}, {"_id": "t7gcrmBLuYtGpaxnR", "postedAt": "2024-03-02T18:47:26.780Z", "postId": "JGazpLa3Gvvter4JW", "htmlBody": "<p>Thanks for replying, I think I now understand your position a bit better. Okay, so if your concern is around measurements only being finitely precise, then my exactly-zero example is not a great one, because I agree that it’s impossible to measure the universe as being&nbsp;<i>exactly</i> flat.</p><p>Maybe a better example: if the universe’s large-scale curvature is either zero or negative, then it necessarily follows that it’s infinite.</p><p>—(I didn’t give this example originally because of the somewhat annoying caveats one needs to add. Firstly, in the flat case, that the universe has to be simply connected. And then in the negatively curved case, that our universe isn’t one of the unusual finite types of hyperbolic 3-manifold given by&nbsp;<a href=\"https://en.wikipedia.org/wiki/Mostow_rigidity_theorem\"><u>Mostow’s rigidity theorem</u></a> in pure math. (As far as I’m aware, all cosmologists believe that if the universe is negatively curved, then it’s infinite.))—</p><p>I think this new example might address your concern? Because even though measurements are only finitely precise, and contain uncertainty, you can still be ~100% confident that the universe is negatively curved based on measurement. (To be clear, the actual measurements we have at present don’t point to this conclusion. But in theory one could obtain measurements to justify this kind of confidence.)</p><p>(For what it’s worth, I personally have high credence in&nbsp;<a href=\"https://www.scientificamerican.com/custom-media/biggest-questions-in-science/the-founder-of-cosmic-inflation-theory-on-cosmologys-next-big-ideas/#:~:text=The%20theory%20of,it%20every%20instant.\"><u>eternal inflation</u></a>, which posits that there are infinitely many bubble/pocket universes, and that each pocket universe is negatively curved—very slightly—and infinitely large. (The latter on account of details in the equations.))</p>", "parentCommentId": "W7TPPkpXD85ZcE72h", "user": {"username": "Will Aldred"}}, {"_id": "zByRWxyvm6dyKocBZ", "postedAt": "2024-03-02T19:50:11.507Z", "postId": "JGazpLa3Gvvter4JW", "htmlBody": "<p>Thanks for elaborating!</p><p>I agree it makes sense to have some probability mass on the universe having null or negative local curvature. However, I think there is no empirical evidence supporting a null or negative global curvature:</p><ul><li>One can gather empirical evidence that the observable universe has a topology which, if applicable to the entire universe, would imply an infinite universe.</li><li>Yet, by definition, it is impossible to get empirical evidence that the topology of the entire universe matches that of the observable universe.<ul><li>Inferring an infinite universe based on properties of the observable universe seems somewhat analogous to deducing an infite flat Earth based on the obervable ocean around someone in the sea being pretty flat.</li></ul></li></ul><p>Wikipedia's page seems to be in agreement with my 2nd point (emphasis mine):</p><blockquote><p>If the observable universe encompasses the entire universe, we might determine its structure through observation. However, if the observable universe is smaller [as it would have to be for the entire universe to be infinite], we can only grasp a portion of it, making it <strong>impossible to deduce the global geometry through observation</strong>.</p></blockquote><p>I guess cosmologists may want to assume the properties of the observable universe match those of the entire universe in agreement with the <a href=\"https://en.wikipedia.org/wiki/Cosmological_principle\">cosmological principle</a>. However, this has only proved to be useful to make predictions in the observable universe, so extending it to the entire universe would not be empirically justifiable. As a result, I get the impression the hypothesis of an infinite universe is not falsifiable, such that it cannot meaningly be true or false.</p>", "parentCommentId": "t7gcrmBLuYtGpaxnR", "user": {"username": "vascoamaralgrilo"}}, {"_id": "6ZkxGpifwtPmqopaL", "postedAt": "2024-03-02T20:03:26.476Z", "postId": "JGazpLa3Gvvter4JW", "htmlBody": "<blockquote><p>However, this has only proved to be useful to make predictions in the observable universe, so extending it to the entire universe would not be empirically justifiable.</p></blockquote><p>Useful <i>so far</i>! <a href=\"https://en.wikipedia.org/wiki/Problem_of_induction\">The problem of induction</a> applies to all of our predictions based on past observations. Everything could be totally different in the future. Why think the laws of physics or observations will be similar tomorrow, but very different outside our observable universe? It seems like essentially the same problem to me.</p><blockquote><p>As a result, I get the impression the hypothesis of an infinite universe is not falsibiable, such that it cannot meaningly be true or false.</p></blockquote><p>Why then assume it's finite rather than infinite or possibly either?</p><p>What if you're in a short-lived simulation that started 1 second ago and will end in 1 second, and all of your memories are constructed? It's also unfalsifiable that you aren't. So, the common sense view is not meaningfully true or false, either.</p>", "parentCommentId": "zByRWxyvm6dyKocBZ", "user": {"username": "MichaelStJules"}}, {"_id": "fxvQsiuXxaLQHqFhb", "postedAt": "2024-03-02T20:16:52.600Z", "postId": "JGazpLa3Gvvter4JW", "htmlBody": "<p>Hmm, okay, so it sounds like you’re arguing that even if we measure the curvature of our observable universe to be negative, it could still be the case that the overall universe is positively curved and therefore finite? But surely your argument should be symmetric, such that you should also believe that if we measure the curvature of our observable universe to be positive, it could still be the case that the overall universe is negatively curved and thus infinite?</p>", "parentCommentId": "zByRWxyvm6dyKocBZ", "user": {"username": "Will Aldred"}}, {"_id": "fjXafrScgApH7Gdeq", "postedAt": "2024-03-02T20:42:24.080Z", "postId": "JGazpLa3Gvvter4JW", "htmlBody": "<p>My answer to both questions would be yes. In other words, whether the entire universe is finite or infinite is not a meaningful question to ask because we will never be able to gather empirical evidence to study it.</p>", "parentCommentId": "fxvQsiuXxaLQHqFhb", "user": {"username": "vascoamaralgrilo"}}, {"_id": "ZD5N2emMfqemijyoB", "postedAt": "2024-03-02T21:24:47.651Z", "postId": "JGazpLa3Gvvter4JW", "htmlBody": "<p>Thanks for jumping in, Michael!</p><blockquote><p>Why think the laws of physics or observations will be similar tomorrow, but very different outside our observable universe? It seems like essentially the same problem to me.</p></blockquote><p>I agree it is essentially the same problem. I would think about it as follows:</p><ul><li>If I observed the ground around me is pretty flat and apparently unbounded (e.g. if I were in the middle of a large desert), it would make sense to assume the Earth is larger than a flat circle with a few kilometers centred in me. Ignoring other sources of evidence, I would have as much evidence for the Earth extending for only tens of kilometers as for it being infinite. Yet, I should not claim in this case that there is empirical evidence for the Earth being infinite.</li><li>Similarly, based on the Laws of Physics having worked a certain way for a long time (or large space), it makes sense to assume they will work roughly the same way closeby in time (or space). However, I should not claim there is empirical evidence they will hold infinitely further away in time (or space).</li></ul><blockquote><p>Why then assume it's finite rather than infinite or possibly either?</p></blockquote><p>Sorry for the lack of claririty. I did not mean to argue for a finite universe. I like to assume it is finite for simplicity, in the same way that it is practical to have physical laws with zeros even though all measurements have finite precision. However, I do not think there will ever be evidence for/against the entire universe being finite/infinite.</p>", "parentCommentId": "6ZkxGpifwtPmqopaL", "user": {"username": "vascoamaralgrilo"}}]