[{"_id": "QhpCTZaCoogTpEE3p", "postedAt": "2023-03-28T11:53:09.981Z", "postId": "JgexokNweDkTbkynG", "htmlBody": "<p>Thanks for this nice to see Global health stuff again on the forum (definitely a minority of posts :D ). Nice shallow investigation it was good to get a bit of an update on the situation here.&nbsp;</p><p>A couple of queries/criticisms</p><p><strong>I've got some issues with your IDSR &nbsp;analysis. </strong>I &nbsp;basically, agree with your points 2 to 5, but point 1 feels loose with unlikely assumptions. \"<strong>ISDR\" </strong>is such a vague concept I think it would have been worth spending a couple of paragraphs outline what that actually is and how it worked in this test case.</p><p><i><strong>\"Probably much more cost-effective than it seems due to overlapping benefits of IDSR for all other diseases and preventing further epidemics. Given the per capita cost of establishing the system is $0.07, and the system may have overlapping benefits for all diseases, the intervention seems very cost-effective. Such surveillance systems may have a strong use case for antimicrobial resistance and novel pathogen detection (especially those with pandemic potential).\"</strong></i></p><p>I don't understand why you make the leap to ISDR seeming \"very cost-effective\" t based on the low cost and potential overlap for other diseases. Having seen these kind of vague programs in Uganda, the net benefit might be close to zero, so it's dangerous to make assumptions of any impact at all. This kind of system will never detect a new pathogen, and unless it actually changes behaviour of prescribing health professionals (unlikely), then I don't see how it would prevent antimicrobial resistance.</p><p>Out of interest as wellwhat triggered you to focus on Bacterial Meningitis? It seems to me instinctively like a fairly well understood problem, with vaccines already available for Meningitis and in development for Group B strep. You might have found something promising in your research but it seems unlikely.</p>", "parentCommentId": null, "user": {"username": "NickLaing"}}, {"_id": "bbeebu3fgDftAkCj2", "postedAt": "2023-04-03T12:39:50.930Z", "postId": "JgexokNweDkTbkynG", "htmlBody": "<p>Interesting analysis. I learned a bunch of things.</p>\n<p>One comment: the 1/10 rate is the mortality of treated patients. The mortality rate of untreated bacterial meningitis is much closer to 100%.<sup class=\"footnote-ref\"><a href=\"#fn-ciqYEShQWdiwYE69Z-1\" id=\"fnref-ciqYEShQWdiwYE69Z-1\">[1]</a></sup>\nThis means the number-needed-to-treat for antibiotics goes from above 10 to between 1 and 2.\nHow would an order of magnitude difference here change your analysis?</p>\n<hr class=\"footnotes-sep\">\n<section class=\"footnotes\">\n<ol class=\"footnotes-list\">\n<li id=\"fn-ciqYEShQWdiwYE69Z-1\" class=\"footnote-item\"><p>Reliable recent numbers are hard to come by, probably because ~all conclusively diagnosed patients in western countries are treated or diagnosed posthumously. There is an <a href=\"https://www.nejm.org/doi/full/10.1056/NEJM198410043111409\">NEJM paper</a> citing numbers (from the pre-antibiotic era) between 70% and 100% for the different pathogens. <a href=\"#fnref-ciqYEShQWdiwYE69Z-1\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n</ol>\n</section>\n", "parentCommentId": null, "user": {"username": "habakukhain"}}]