[{"_id": "5zYDL2eSDuLuE2uLk", "postedAt": "2022-11-18T17:44:50.439Z", "postId": "JgqEqsa6iAtqGLYmw", "htmlBody": "<p>Thanks for the analysis!</p><blockquote><ol><li><i>Worldview Diversification&nbsp;</i>(<a href=\"https://www.openphilanthropy.org/research/worldview-diversification/\">Karnofksy, 2016</a>): Divide your resources across different theoretical ‘buckets’ in proportion to your confidence in each theory, then choose the best option for each ‘bucket’. For example, if you have 30% credence in <i>deprivationism</i>&nbsp;and 100% credence that the neutral point is below one, you should award 30% of your resources to AMF and the rest to StrongMinds.</li></ol></blockquote><p>It is worth noting the portfolio approach corresponding to worldview diversification applies to the allocation of resources of the community as a whole, as far as I understand. So, even if one has \"30% credence in <i>deprivationism</i>&nbsp;and 100% credence that the neutral point is below one\", assuming AMF (or other life-saving interventions which score highly under deprivationist views) currently receives more than 30 % of resources, one could reasonably direct (at the current margin) all donations to StrongMinds (or other life-improving interventions which score highly under epicurean views).</p><p>I also wonder whether GiveWell's moral weights being majorly determined by its donors (60 %) has the intention of capturing other effects besides those directly related to the death of the person. For example, <a href=\"https://papers.ssrn.com/sol3/papers.cfm?abstract_id=3452844\">Wilde 2019</a> analyses the effect of bednets on fertility, concluding:</p><blockquote><p>[Abstract:] The effect on fertility is positive only temporarily – lasting only 1-3 years after the beginning of the ITN distribution programs – and then becomes negative. Taken together, these results suggest the ITN distribution campaigns may have caused fertility to increase unexpectedly and temporarily, or that these increases may just be a tempo effect – changes in fertility timing which do not lead to increased completed fertility</p><p>[Conclusion:] In contrast, our findings do not support the contention that erosion of international funding for malaria control, specifically of ITNs, would lead to higher fertility rates in the short-run. While our results are suggestive that this may be the case for long-run fertility, we show the exact opposite for the short-run</p></blockquote><p>If the results are suggestive that decreasing ITNs leads to higher long-run fertility, AMF would tend to decrease longterm fertility. This would tend to decrease the future population size, but it is unclear whether this is good or bad.</p><p>I guess population size considerations did not play much of a role on the moral weight answers of GiveWell's donors. However, such considerations could play a major role in determining the longterm cost-effectiveness of life-saving interventions, so they should arguably be investigated.</p>", "parentCommentId": null, "user": {"username": "vascoamaralgrilo"}}, {"_id": "AngCjwSBYwXzJ5h5g", "postedAt": "2022-11-18T18:52:21.001Z", "postId": "JgqEqsa6iAtqGLYmw", "htmlBody": "<p>Just to clarify, is the only benefit you're considering from AMF a longer life for a few people, or are you also taking into account all the people who don't get sick from malaria?</p>\n", "parentCommentId": null, "user": {"username": "Khorton"}}, {"_id": "emwd8ahRvj52ufmxz", "postedAt": "2022-11-18T19:41:58.358Z", "postId": "JgqEqsa6iAtqGLYmw", "htmlBody": "<p>This is great work, and I think it's super valuable to everyone thinking about the best ways to go about improving global health and wellbeing. I wanted to share a couple comments on it as well as a couple specific questions.</p><p>First, I think it's really good you're looking at these questions in so much detail despite the fact that they can feel unpleasant or difficult. I personally think that there's something pretty screwed up about the world when a random upper-middle class person in the United States can choose whether someone in Sub-Saharan Africa lives or dies depending on the choice of how much and where to donate. But given that's the world we live in, I think it's really important to do our best to try and figure out answers to these kinds of moral questions you're looking at. (Note: I also think it's worth trying to bring about systemic changes to remove the need for aid, but systemic change isn't something that we can snap our fingers and bring about. It's a complex process that carries its own costs and benefits, and the potential for systemic change doesn't remove the need to think carefully about options for improving wellbeing immediately).&nbsp;</p><p>In light of my more general feelings, I'm pretty strongly in favor of efforts that try and ask aid recipients what they want and value, rather than trying to make these tradeoffs based on our own moral reasoning. For that reason, I've been very pleased that GiveWell has incorporated surveys in its computation of moral weights, and I'll be very excited to see the results from HLI's survey on the neutral point. I would love to see more survey work that tries to tease out views on deprivationism vs. TRIA vs. Epicurianism among individuals actually impacted by aid. However, these might be complicated enough questions that focus groups and other more in-depth approaches would work better than surveys.&nbsp;</p><p>With those comments out of the way, I also wanted to ask a couple specific questions:</p><ol><li>When you computed your 4 WELLBY/$1,000 cost-effectiveness estimate for AMF's development effects, is that after correcting for the previous <a href=\"https://forum.effectivealtruism.org/posts/qo2QpLXBrrvdqJHXQ/?commentId=Bfzg5aoGgG56q6cnK\">arithmetic error</a> from the Dozen Doubts post? (Edit: I tried to check this myself, but the Google sheet link didn't seem to work for me).</li><li>Does anyone use a simple total utilitarian framework when doing this kind of cost-benefit accounting? I would think that such a framework might look sort of in between deprivationism and Epicurianism, depending on how interventions impacted fertility. I don't want to come across as endorsing the total utilitarian framework as a uniquely desirable one to use, but it seems worth at least thinking about in this context.&nbsp;</li></ol>", "parentCommentId": null, "user": {"username": "MHR"}}, {"_id": "avBxGBxd7Lc9RJWK2", "postedAt": "2022-11-18T19:49:48.050Z", "postId": "JgqEqsa6iAtqGLYmw", "htmlBody": "<p>Yes, we try to account for the benefit that'd accrue to everyone who doesn't get sick. We mention this at the beginning of Section 3 and discuss the calculations in more detail in the appendix. &nbsp;Overall we think these \"life improving\" (as opposed to \"life extending\") effects are relatively small. And if malaria prevention is cost-effective (which we argue depends on your philosophy), then I think it'll be the life-extending benefits that drive that.&nbsp;</p><p>Currently, we're primarily relying on evidence about how malaria prevention increases incomes -- and then converting that into estimates of how it'd affect people's subjective wellbeing. We're currently missing good data on how malaria prevention affects people's feelings.&nbsp;</p>", "parentCommentId": "AngCjwSBYwXzJ5h5g", "user": {"username": "JoelMcGuire"}}, {"_id": "unqijBHtSKJQgH9et", "postedAt": "2022-11-18T20:13:51.440Z", "postId": "JgqEqsa6iAtqGLYmw", "htmlBody": "<p>It looks like you're only accounting for increased incomes and avoided grief when estimating the effects of AMF other than on the people who would have died. Have you looked at all about trying to account for all the factors GiveWell lists under supplemental adjustments in their CEA? Just to take an example, GiveWell increases AMF's benefits 9% to account for the reduction in malaria morbidity (time spent ill). If you take out the benefits from averted deaths, the morbidity effect is still 9% of the original benefit, not 9% of the new lower benefit. I would think that (and the other supplemental adjustment effects) might moderately shift your conclusions if you aren't currently accounting for them.&nbsp;</p>", "parentCommentId": "avBxGBxd7Lc9RJWK2", "user": {"username": "MHR"}}, {"_id": "K7dGdEAfjkvKiS4LT", "postedAt": "2022-11-18T20:23:58.526Z", "postId": "JgqEqsa6iAtqGLYmw", "htmlBody": "<p>Hi MHR,</p><p>I also wish that these choices need not be made.&nbsp;</p><p>I find myself still trying to form a view on how much we can and should outsource our moral reasoning by surveying people in general and beneficiaries in particular. I think this is a tricky question, as there are many technical questions we don't and probably shouldn't survey the affected people to decide on the best course of action (i.e., setting interest rates). That being said, I would welcome more work understanding people's views on these tough philosophical questions. I think this could be a promising line of research<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefts5hb962xqj\"><sup><a href=\"#fnts5hb962xqj\">[1]</a></sup></span>.&nbsp;</p><p>Answering your specific comments.&nbsp;</p><ol><li>Yes, this is after correcting the previous error.&nbsp;</li><li>I would hesitate to ever put \"simple\" next to \"total utilitarian\"! But more seriously, we considered adding this perspective, but we found it difficult to implement and more difficult to communicate. The difficulty with incorporating fertility is when to stop counting. Take the immediate \"replacement\" effect. Roodman (<a href=\"https://davidroodman.com/blog/2014/04/16/the-mortality-fertility-link/\">2014</a>) estimates for every &nbsp;4 children who die, this leads to between 1 and 2 extra children being born. So if we just stop there, adding fertility in a totalist perspective makes AMF look relatively worse. But why stop there? Why not count the next generation? If we save 4 people, but only 2 are counterfactually created, then there are still 2 people who could have 3 children of their own. So instead of just saving 4 people (which would have been the result in the non-totalist analysis), you've actually saved &nbsp;8! Double the value! But would it make sense to add the generation after that? What about the 4th, 5th or 6th generations?<i><strong> At what point are we just making up numbers?</strong></i> A further issue is that this whole discussion doesn't incorporate a whole lot of more speculative effects that could potentially swamp the totalists calculus. These are infamously tough problems like: is it better or worse for the rest of the population for more people to exist? AKA is the world under or overpopulated? Does adding new people increase or decrease existential risk? I don't have good, confident answers to these questions, and I'd be sceptical of anyone who claims to! My hunch is that if you're a totalist, your view on saving lives will probably not be driven by crunching the numbers about fertility but about your speculation on how adding people affects the wellbeing of the population and existential security.&nbsp;</li></ol><p>&nbsp;</p><p>&nbsp;</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnts5hb962xqj\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefts5hb962xqj\">^</a></strong></sup></span><div class=\"footnote-content\"><p>But the IDinsight report on this topic (<a href=\"https://www.idinsight.org/project/using-peoples-preferences-and-values-to-inform-funding-decisions/\">2019</a>) made me think this type of work may be more difficult to do in very low-income settings than I might have hoped.&nbsp;</p></div></li></ol>", "parentCommentId": "emwd8ahRvj52ufmxz", "user": {"username": "JoelMcGuire"}}, {"_id": "sRzqku9iiBsBPTnPe", "postedAt": "2022-11-18T20:44:44.797Z", "postId": "JgqEqsa6iAtqGLYmw", "htmlBody": "<p>Thanks Joel!</p>\n", "parentCommentId": "avBxGBxd7Lc9RJWK2", "user": {"username": "Khorton"}}, {"_id": "DECyNgY7C43LvscZr", "postedAt": "2022-11-18T22:26:07.748Z", "postId": "JgqEqsa6iAtqGLYmw", "htmlBody": "<p>Skimming through this, this is great! My only bone to pick is that, skimming through this, I don't have an easy understanding of the intuition behind the key results. For example, it would be good to know (from reading the summary?) what the intuition behind the following results are:</p><ul><li>Why AMF is the best under deprivationism followed by TRIA (AC=5), then TRIA (AC=25), then Epicureanism.<ul><li>If AMF is better under deprivationism than TRIA, is this because we tend to be saving younger rather than older people from death by giving to AMF?</li><li>Similarly, if AMF is better under TRIA (AC=5) than TRIA (AC=25), presumably this is because we are saving some young people (younger than 25 years)?</li><li>AMF is the worst under epicureanism because, quite simply, death isn't bad under epicureanism (other than the pain of death), so you get relatively little from averting deaths due to malaria.</li></ul></li><li>Why giving to AMF becomes worse if the neutral point is higher.<ul><li>The higher the neutral point, the less well-off people of a given life satisfaction level are and therefore the less bad it is if they die from malaria.</li></ul></li><li>Why StrongMinds is generally better than AMF (almost irregardless of what your philosophical view is).<ul><li>This could be for a few reasons I guess. Maybe:<ul><li>People are generally pretty sad on a life satisfaction view, or the pain of death is little. So saving lives is generally just not that good.</li><li>StrongMinds is just really cost-effective at improving life satisfaction, compared to how cost-effective AMF is at averting deaths.</li></ul></li></ul></li></ul><p>Not sure what others think, but personally I like to understand intuitions like the above!</p>", "parentCommentId": null, "user": {"username": "jackmalde"}}, {"_id": "vsySryxsZPQB8oWrL", "postedAt": "2022-11-18T23:38:23.228Z", "postId": "JgqEqsa6iAtqGLYmw", "htmlBody": "<p>Is there any website or spreadsheet where we can see how different ethical views affect the ranking of charities we should donate to? Specifically, where we can plug in our own parameters into the model, like we can do with the GiveWell CEA, except for more complicated positions (like the ones expressed in this post)?&nbsp;<br><br>If not, would such a project potentially be in the cards for HLI?</p>", "parentCommentId": null, "user": {"username": "Tanae"}}, {"_id": "kHuSFF23xEysEptom", "postedAt": "2022-11-19T00:11:35.310Z", "postId": "JgqEqsa6iAtqGLYmw", "htmlBody": "<p>We already include GiveWell's adjustments, including their supplemental intervention adjustments in the lives saved and income-generated figures we use (and then adjust in the case of the income effects).</p>", "parentCommentId": "unqijBHtSKJQgH9et", "user": {"username": "JoelMcGuire"}}, {"_id": "fd6nneyyFBK8cJGcw", "postedAt": "2022-11-19T00:21:55.065Z", "postId": "JgqEqsa6iAtqGLYmw", "htmlBody": "<p>Unfortunately, no. I don't know of a website or spreadsheet that does this. I made a toy version of this just for the AMF to GiveDirectly and StrongMinds comparison, but it only includes the topics discussed in this report.&nbsp;</p><p>This is on HLI's wishlist of things to do, but we have a very small team, so I'm not sure when we'll get around to it. I'm personally very into this idea.&nbsp;</p>", "parentCommentId": "vsySryxsZPQB8oWrL", "user": {"username": "JoelMcGuire"}}, {"_id": "rCux2v3hPGkaRhPes", "postedAt": "2022-11-19T00:33:54.675Z", "postId": "JgqEqsa6iAtqGLYmw", "htmlBody": "<p>Hi Jack, thanks for the feedback! I think your suggested intuitions are about right for the first two points.</p><p>Regarding your third point, I'm inclined to phrase it slightly differently. People aren't generally pretty sad on a life-satisfaction view, it's more that the people AMF saves will live hard lives. That's why we're trying to help them. If we expected them to be considerably more satisfied with their lives, then I think the cost-effectiveness comparison would look very different.&nbsp;</p>", "parentCommentId": "DECyNgY7C43LvscZr", "user": {"username": "JoelMcGuire"}}, {"_id": "GpmLB6Cabm8iyCfX8", "postedAt": "2022-11-19T01:44:19.934Z", "postId": "JgqEqsa6iAtqGLYmw", "htmlBody": "<p>I guess I'm not quite sure what to make of your answer here. &nbsp;To take a concrete example, when computing AMF's cost-effectiveness in an Epicurian framework, how many WELLBYs/$1k are you attributing to reduced morbidity?&nbsp;</p>", "parentCommentId": "kHuSFF23xEysEptom", "user": {"username": "MHR"}}, {"_id": "EYntK36jAinjpAxHy", "postedAt": "2022-11-19T01:55:43.810Z", "postId": "JgqEqsa6iAtqGLYmw", "htmlBody": "<p>Thanks so much for your answer. I generally think what you're saying here makes sense, but I wanted to dig into one specific point. You say:&nbsp;</p><blockquote><p>My hunch is that if you're a totalist, your view on saving lives will probably not be driven by crunching the numbers about fertility but about your speculation on how adding people affects the wellbeing of the population and existential security.&nbsp;</p></blockquote><p>What worries me here is that you don't need to be a totalist to have these concerns. Even under a TRIA framework, wouldn't you still care about the population-level wellbeing impacts of any intervention (at least on the portion of the population that exists in both the world where the intervention happens and does not happen)? It feels like a little bit of a selective demand for rigor to say that this makes the total utilitarian calculus &nbsp;intractable, but not that it makes any of the other calculi intractable.</p><p>Still, I do recognize that total utilitarianism sometimes leads to <a href=\"https://twitter.com/panickssery/status/1546246157243924484\">galaxy-brained worries</a> about higher-order effects.&nbsp;</p>", "parentCommentId": "K7dGdEAfjkvKiS4LT", "user": {"username": "MHR"}}, {"_id": "ByhH9GPoxWHdhiEwg", "postedAt": "2022-11-19T05:22:33.115Z", "postId": "JgqEqsa6iAtqGLYmw", "htmlBody": "<blockquote><p>What worries me here is that you don't need to be a totalist to have these concerns.</p></blockquote><p>Right, I should have clarified that the gnarly thing with totalism is considering the effect on all future 14k+ generations and the likelihood they exist, not just the higher-order effects on the presently existing population.&nbsp;</p><p>However, I'm not the philosopher, so Michael may disagree with my sketch of the situation.&nbsp;</p>", "parentCommentId": "EYntK36jAinjpAxHy", "user": {"username": "JoelMcGuire"}}, {"_id": "Cac7zFTtukujjtEkS", "postedAt": "2022-11-19T05:54:00.319Z", "postId": "JgqEqsa6iAtqGLYmw", "htmlBody": "<p>This is implicitly 0.42 WELLBYs per $1k if we go with the HLI adjusted figures, or it's 1.67 WELLBYs per $1k if you take GiveWell's income figures at face value.&nbsp;</p><p>Again, GiveWell doesn't explicitly model the morbidity effects other than by inflating the value of malaria prevention's life-saving and income-increasing effect by 9%. We didn't tinker with the supplemental charity-level adjustments, supplemental intervention-level adjustments or their leverage/funging adjustments because that is, I expect, a whole can of worms. Because we kept these adjustments that GiveWell uses to tweak the value of income and life -- &nbsp;the morbidity effects that GiveWell implicitly incorporates, we implicitly include it as well.&nbsp;</p><p>Basically, if you think that the morbidity effects should merit a different adjustment than 9%, we don't account for that. If you're satisfied with 9%, then it's already accounted for, just in a weird opaque way as part of GiveWell's suite of subjective adjustments.&nbsp;</p>", "parentCommentId": "GpmLB6Cabm8iyCfX8", "user": {"username": "JoelMcGuire"}}, {"_id": "egb6B4z6kELg3CEua", "postedAt": "2022-11-19T13:54:38.195Z", "postId": "JgqEqsa6iAtqGLYmw", "htmlBody": "<blockquote><p>Here’s one problematic case.&nbsp;A woman is pregnant. She can take a drug that will treat an illness but will cause substantial birth defects (a real-life example of this would be <a href=\"https://en.wikipedia.org/wiki/Thalidomide\">Thalidomide</a>). According to <i>TRIA</i>, the mother would do little or nothing wrong in taking the drug because the foetus currently has quite weak interests in its own future.</p></blockquote><p>I don't think this is accurate. In explaining the wrong of pre-natal injury&nbsp;(which causes harm to the future adult), McMahan writes that \"we must evaluate the act in terms of its effect on <i>all</i> those time-relative interests it affects, present or future.\" (<i>The Ethics of Killing</i>, p. 283.)&nbsp; That is, while the pre-natal being has little or no time-relative interest in avoiding the pre-natal injury, the future adult's time-relative interests would be gravely affected (we may suppose), which explains why the pre-natal injury is a morally weighty affair.&nbsp; (In case of pre-natal death, by contrast, there are no future time-relative interests to be negatively affected; the death prevents those interests from arising in the first place.)</p>", "parentCommentId": null, "user": {"username": "RYC"}}, {"_id": "otX9wwFKyKL5hEqpq", "postedAt": "2022-11-19T15:30:36.632Z", "postId": "JgqEqsa6iAtqGLYmw", "htmlBody": "<p>You outline a moral dichotomy between the following:</p><ol><li>Actions which <i>negatively affect</i> a person's future interests,<ul><li>e.g. a mother taking a drug which causes birth defects in her child,</li><li>which are morally <strong>wrong</strong></li></ul></li><li>Actions which <i>prevent the occurrence of</i> a person having future interests,<ul><li>&nbsp;e.g. a mother preventing the birth of her child,</li><li>which are morally <strong>neutral</strong></li></ul></li></ol><p>It seems to me that longtermism explicitly rejects this dichotomy, because longtermists believe the prevention of the occurrence of the interests of innumerable future people would be a catastrophic moral loss. A believer in this dichotomy would argue that a human extinction event is morally neutral with respect to the interests of innumerable future people who would have lived, because the extinction event simply \"prevents those interests from arising in the first place\". Do you agree that this dichotomy is inconsistent with longtermism?</p>", "parentCommentId": "egb6B4z6kELg3CEua", "user": {"username": "Ariel Simnegar"}}, {"_id": "5JDnArEhLAYPbodMZ", "postedAt": "2022-11-19T19:06:43.451Z", "postId": "JgqEqsa6iAtqGLYmw", "htmlBody": "<p>Not exactly -- though it is a good question!</p><p>The dichotomy merely suggests that failing to create a person does not harm or <i>wrong that individual</i> in the way that negatively affecting their interests (e.g. by killing them as a young adult) does. &nbsp;Contraception isn't murder, and neither is abstinence.</p><p>But avoiding wrongs isn't all that matters. &nbsp;We can additionally claim that there's always some (albeit weaker) reason to <i>positively benefit</i> possible future people by bringing them into a positive existence. &nbsp;So there's some moral reason to have kids, for example, even though it doesn't <i>wrong</i> anyone to remain childless by choice.</p><p>And when you multiply those individually weak reasons by zillions, you can end up with <i>overwhelmingly strong</i> reasons to prevent human extinction, just as longtermists claim. (This reason is so strong it would plausibly be wrong to neglect or violate it, even though it does not wrong any particular individual. Just as <a href=\"https://rychappell.substack.com/i/56650827/the-non-identity-problem\">the non-identity problem</a> shows that one outcome can be worse than another without necessarily being worse for any particular individual.)</p>", "parentCommentId": "otX9wwFKyKL5hEqpq", "user": {"username": "RYC"}}, {"_id": "SXfZvxqpKudqo6XHD", "postedAt": "2022-11-19T21:52:36.781Z", "postId": "JgqEqsa6iAtqGLYmw", "htmlBody": "<p>Very interesting report thanks folks! I am very sympathetic to the WELLBY approach. I wonder if anyone shares the intuition that the <i>real</i> improvement of subjective wellbeing doesn't follow linearly when people report on a 10 point scale. When I think about how I rate something something like how tasty a meal was, there is a bigger <i>real </i>difference between a 6/10 and 7/10 than between a 5/10 and a 6/10 even though the difference in my ratings was 1/10 in both cases. I wonder if &nbsp;something similar applies to ratings of SWB.&nbsp;</p><p>This could have important &nbsp;implications for which groups to target with certain interventions, if for example through further research we found something like: the first WELLBY &nbsp;point increase from the neutral point is 'worth more' than a WELLBY point increase at a higher starting point.&nbsp;</p><p>I'm fairly new to this area and have just engaged with it through HLI's posts so I'm not sure if this has been talked about before. Keep up the awesome work.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Samuel Harvey"}}, {"_id": "Y3jsE3ZDLFrgqK3dR", "postedAt": "2022-11-20T06:30:45.784Z", "postId": "JgqEqsa6iAtqGLYmw", "htmlBody": "<p>Thanks HLI. I really like the post.</p><p>Pointing out an issue with the links to sheets that are referenced. Remove everything after \"/edit\" to make them work (as per below), and the latter one regardless is not publicly accessible:</p><p>https://docs.google.com/spreadsheets/d/1NMAU-a1X4vqjodjI6kf8KnUyCJaK9uyNvXWj5VetDZw</p><p><a href=\"https://docs.google.com/spreadsheets/d/1RrBuiPVgL-t8hlr6EqkqABiaqdHMGkpvfeiqiiX49LU/edit%23gid%3D309035308%26range%3DA35\">https://docs.google.com/spreadsheets/d/1RrBuiPVgL-t8hlr6EqkqABiaqdHMGkpvfeiqiiX49LU</a></p><p>---</p><p>Regarding the content, &nbsp;as explained in Joel's comment above the immediate expected replacement effects are not included, and if they were to be you need to ask why stop after the first generation. Is there a legitimate argument however to count the first generation and stop there? Because:</p><ul><li>first generation replacement effect is relevant immediately, or at least within the next few years. Second generation is relevant in ~20 years, when the state of the world is much less predictable. Hopefully subjective wellbeing of people in these regions will be noticeably better in 20 years, and any replacement effect/rate might also be noticeably different.</li><li>it is similar in immediacy and measurability (I think) to developmental, morbidity and grievance impacts that are included.</li></ul><p>&nbsp;</p><p>Thanks.</p>", "parentCommentId": "ByhH9GPoxWHdhiEwg", "user": {"username": "Punty"}}, {"_id": "BSopTDjLYb4zcuWcm", "postedAt": "2022-11-20T09:09:16.358Z", "postId": "JgqEqsa6iAtqGLYmw", "htmlBody": "<p>The Economist, last week: \"[EA] doesn’t seriously question whether attempting to quantify an experience might miss something essential about its nature. How many WALYs for a broken heart?\" (Nov 2022, <a href=\"https://www.economist.com/1843/2022/11/15/the-good-delusion-has-effective-altruism-broken-bad\">Source</a>)</p><p>HLI, this week: \"...Hence, an overall effect of grief per death prevented is (0.72 x 5 x 0.5) x 4.03 = 7.26 WELLBYs\"&nbsp;</p><p>&nbsp;</p><p>Great article – well done!!!</p>", "parentCommentId": null, "user": {"username": "weeatquince"}}, {"_id": "ibQvzGyzLp9EbwPoe", "postedAt": "2022-11-20T09:46:41.111Z", "postId": "JgqEqsa6iAtqGLYmw", "htmlBody": "<p>Thanks very much for flagging the issues with the spreadsheet links. I believe I've fixed them all now but do let me know if you encounter any further issues.</p>", "parentCommentId": "Y3jsE3ZDLFrgqK3dR", "user": {"username": "BarryGrimes"}}, {"_id": "Q7jQEpnZ7tRgoB4JS", "postedAt": "2022-11-20T14:58:48.829Z", "postId": "JgqEqsa6iAtqGLYmw", "htmlBody": "<p>Thanks for the response! If I'm understanding you right, then I'm not convinced I like your approach to this specific aspect of the model. But I do think any approach to handling the morbidity benefits is going to be very coarse without a lot of further research.&nbsp;</p><p>To try and illustrate my concern, let me just give a quick example for the DRC, working in GiveWell's units of value rather than WELLBYs (because that's what I'm more familiar with). If we take GiveWell's estimate that the morbidity reduction is equal to a 9% of AMF's pre-adjustment benefits, that means that per $100000, morbidity reduction generates 0.09*8570 = 771 units of value.&nbsp;</p><p>Based on how I think you're doing it, when you go to calculate the non-life-extension benefits of AMF, you compute the benefits of morbidity reduction as 9% of (development benefits + avoided bereavement). If we just work with GiveWell's numbers (which don't include the bereavement effects), that would be 0.09*2582 = 232 units of value/$100000. Then when you go to calculate the life-extension benefits, you add in a 9% adjustment for morbidity reduction, which is &nbsp;0.09*5987 = 539 units of value/$100000. But that bookkeeping doesn't make any sense, as all the morbidity benefits should be accounted for in the non-life-extension category. &nbsp;Doing it the way I think you are, where you're adding a factor of 0.09 to all benefits, ends up making AMF look worse in the Epicurean case, as well as in all cases with a higher neutral point for happiness.&nbsp;</p><p>This is actually even more important because you're applying such a big downward adjustment to GiveWell's numbers. If we divide GiveWell's estimate of the development benefits by 4, &nbsp;then the development benefits are about 709 units of value/$100000 and the total morbidity reduction benefits under GiveWell's assumptions are 9% of the new total, or 597 units of value/$100000. If you do the bookkeeping how I think you're doing, only 58 units of value/$100000 of morbidity reduction would get attributed to the non-life-extension benefit category. Correctly attributing all 597 units of value/$100000 from morbidity reduction nearly doubles the estimated non-life-extension benefits of AMF.&nbsp;</p><p>I recognize that to some extent we're working with made-up numbers here. But I think the general point that the supplemental adjustments need to be handled with care when doing this kind of component analysis is an important one. However, I do apologize in advance if I'm misunderstanding how you're approaching this right now.&nbsp;</p>", "parentCommentId": "Cac7zFTtukujjtEkS", "user": {"username": "MHR"}}, {"_id": "irruMjMabnkGbhmbX", "postedAt": "2022-11-20T15:55:19.838Z", "postId": "JgqEqsa6iAtqGLYmw", "htmlBody": "<p>Yep that makes sense to me</p>", "parentCommentId": "ByhH9GPoxWHdhiEwg", "user": {"username": "MHR"}}, {"_id": "mAaKSk3rQtzPNY2Dn", "postedAt": "2022-11-21T15:52:27.606Z", "postId": "JgqEqsa6iAtqGLYmw", "htmlBody": "<p>Well, if we think feelings matter, we should try to quantify them in a sensible way. That's what we try to do.</p>\n<p>But I share the sentiment that you really do miss something if you try to quantify feelings by measuring something <em>other</em> than feelings, such as income.</p>\n", "parentCommentId": "BSopTDjLYb4zcuWcm", "user": {"username": "MichaelPlant"}}, {"_id": "S9LjrziDByE4ovFwt", "postedAt": "2022-11-21T16:05:24.137Z", "postId": "JgqEqsa6iAtqGLYmw", "htmlBody": "<blockquote><p>It is worth noting the portfolio approach corresponding to worldview diversification applies to the allocation of resources of the community as a whole, as far as I understand.</p></blockquote><p>It does? Says who? And why does it? Given that attempts there have been, as far as I can tell, almost nil attempts to think through the worldview diversification approach - despite it being appealed to in decision-making for many years - it strikes me as an open question about how it should be understood. I see moral uncertainty as asking a first-personal question - what should <i>I </i>do, given my beliefs about morality?&nbsp;</p><blockquote><p>I also wonder whether GiveWell's moral weights being majorly determined by its donors (60 %) has the intention of capturing other effects besides those directly related to the death of the person</p></blockquote><p>Ah, I too used to spend many hours wondering what GiveWell really thought about things. But now I am a man, I have put away such childish things.&nbsp;</p>", "parentCommentId": "5zYDL2eSDuLuE2uLk", "user": {"username": "MichaelPlant"}}, {"_id": "h7caHGtCEE5yzacpY", "postedAt": "2022-11-21T16:12:38.449Z", "postId": "JgqEqsa6iAtqGLYmw", "htmlBody": "<blockquote><p>Why AMF is the best under deprivationism followed by TRIA (AC=5), then TRIA (AC=25), then Epicureanism.</p></blockquote><p>Um, because these are literally the results these views are structured to give! To me, your question is akin to asking \"why does consequentialism care more about consequences than deontology?\" Sorry, maybe I've misunderstood.&nbsp;</p><blockquote><p>Why StrongMinds is generally better than AMF (almost irregardless of what your philosophical view is).</p></blockquote><p>To be clear, there is no intuition here! These are the outputs of an empirical analysis. There's absolutely no reason it has to be true that the purported best life-extending intervention is better, under a range of different philosophical assumptions, than the purported best life-improving one. In a nearby possible world, AMF* could have been very many times more cost-effective on the assumptions most generous to saving lives.&nbsp;</p>", "parentCommentId": "DECyNgY7C43LvscZr", "user": {"username": "MichaelPlant"}}, {"_id": "NYxBRJLTsJXihMrqe", "postedAt": "2022-11-21T16:17:33.207Z", "postId": "JgqEqsa6iAtqGLYmw", "htmlBody": "<p>Hi! Thanks for engaging. Yes, the issue you raise does get discussed quite a bit, and is much worried about (by effective altruists but not in general). I've <a href=\"https://www.happierlivesinstitute.org/report/the-comparability-of-subjective-scales/\">got a working paper here</a> where I review the theory and evidence and tentatively conclude people probably do interpret the difference between each unit as having the same value (i.e. the scales are interpreted linearly).&nbsp;</p><p>My colleague, Casper Kaiser, who is also an HLI trustee, <a href=\"https://www.pnas.org/doi/10.1073/pnas.2210412119\">has a more recent paper</a> which shows an approximately linear relationship between reports and later behaviour.</p><p>Internally at HLI we're working on doing our own survey on this stuff too! &nbsp;</p>", "parentCommentId": "SXfZvxqpKudqo6XHD", "user": {"username": "MichaelPlant"}}, {"_id": "nHHcCMW5JmPn4oys5", "postedAt": "2022-11-21T16:28:17.971Z", "postId": "JgqEqsa6iAtqGLYmw", "htmlBody": "<p>Is it not true that if AMF generally saved older people then giving to AMF would have been equally as good under TRIA as deprivationism?</p>\n<p>If so I think it’s worth making this explicit. It’s an interesting and important point that for interventions that prolong the lives of older people, it isn’t nearly as consequential what moral theory you choose. It’s far more consequential for interventions that save young people.</p>\n<p>I generally think intuitions like this are very useful as it allows your analysis to be applied to more scenarios than just the one at hand.</p>\n", "parentCommentId": "h7caHGtCEE5yzacpY", "user": {"username": "jackmalde"}}, {"_id": "nakYdFRpD6G2oDSni", "postedAt": "2022-11-21T20:10:39.222Z", "postId": "JgqEqsa6iAtqGLYmw", "htmlBody": "<p>Hi Michael,</p><p>Thanks for the reply!</p><blockquote><p>It does? Says who? And why does it?</p></blockquote><p>The decision of which interventions to support depends on their marginal cost-effectiveness, which in turn depends on the amount of resources invested in the interventions globally, not just by me.</p><blockquote><p>Given that attempts there have been, as far as I can tell, almost nil attempts to think through the worldview diversification approach - despite it being appealed to in decision-making for many years - it strikes me as an open question about how it should be understood.</p></blockquote><p>I agree the worldview diversification approach is quite ad hoc, and I much prefer the softmax approach suggested <a href=\"https://forum.effectivealtruism.org/posts/8Ban7AnoqwdzQphsK/we-can-do-better-than-argmax\">here</a> by Jan Kulveit and Gavin Leech.</p><blockquote><p>Ah, I too used to spend many hours wondering what GiveWell really thought about things. But now I am a man, I have put away such childish things.</p></blockquote><p>I think it is useful to understand the reasoning behind certain assumptions (e.g. giving large weight to donors' moral weights), because they may inform our own analyses. However, one should still question whether the reasoning makes sense.</p>", "parentCommentId": "S9LjrziDByE4ovFwt", "user": {"username": "vascoamaralgrilo"}}, {"_id": "Qh6JhZRkppeCzxK9q", "postedAt": "2022-11-21T20:40:06.168Z", "postId": "JgqEqsa6iAtqGLYmw", "htmlBody": "<p>Awesome, will check it those out.&nbsp;</p>", "parentCommentId": "NYxBRJLTsJXihMrqe", "user": {"username": "Samuel Harvey"}}, {"_id": "DaJ4A79tceExkm2ph", "postedAt": "2022-11-26T08:41:17.202Z", "postId": "JgqEqsa6iAtqGLYmw", "htmlBody": "<p>I'm currently taking a class with Jeff McMahan in which he discusses prenatal injury, and I'm pretty sure he would agree with how you put it here, Richard. This doesn't affect your point, but he now likes to discuss a complication to this: what he calls \"the divergent lives problem.\" The idea is that an early injury can lead to a very different life path, and that once you're far enough down this path—and have the particular interests that you do, and the particular individuals in your life who are important to you—Jeff thinks it can be irrational to regret the injury. So, if someone's being injured as a fetus leads them to later meet the particular life partner they love and to have particular the children they have, and if their life is good, &nbsp;Jeff thinks they probably shouldn't regret the injury—even if avoiding the injury would have led to their having a life with more wellbeing. That's because avoiding the injury would have led to them having particular people and interests in their life which they don't in fact care about from their standpoint now. However, Jeff does add that if an early injury makes the later life not worth living, or maybe even barely worth living, then the future person who developed from the injured fetus does have reason to regret that injury. He would say that children of mothers who took Thalidomide have reason to regret that.&nbsp;</p>", "parentCommentId": "egb6B4z6kELg3CEua", "user": {"username": "RhysSouthan"}}, {"_id": "PYywqoJufNY8BJrKj", "postedAt": "2022-11-26T16:52:22.235Z", "postId": "JgqEqsa6iAtqGLYmw", "htmlBody": "<p>I don't know if StrongMinds explicitly has a goal of reducing suicides, or what its predicted effect on suicide risk might be, but searching for \"suicide\" on the StrongMinds site (<a href=\"https://strongminds.org/?s=suicide\">https://strongminds.org/?s=suicide</a>) brings up a lot of results. Whether or not suicide prevention is part of their mission, treating depression would seem to potentially reduce the risk of suicide for some people . If so, some of the value of StrongMinds might come from the extension of lives. This would mean the value of StrongMinds could vary depending on which view of the harm of death we take. &nbsp;</p>", "parentCommentId": null, "user": {"username": "RhysSouthan"}}, {"_id": "u7qtuB2oKs2f2njQB", "postedAt": "2022-11-28T13:38:19.160Z", "postId": "JgqEqsa6iAtqGLYmw", "htmlBody": "<p>Hello Rhyss. We actually hadn't considered incorporating a suicide-reducing effect of talk therapy onto our model. I think <a href=\"https://en.wikipedia.org/wiki/List_of_countries_by_suicide_rate\">suicide rates in eg Uganda</a>, one place where SM works, are pretty low - I gather they are pretty low in low-income countries in general.&nbsp;</p><p>Quick calculation. I came across <a href=\"https://publichealth.jhu.edu/2014/suicide-risk-falls-substantially-after-talk-therapy\">these Danish numbers</a>, which found that \"After 10 years, the suicide rate for those who had therapy was 229 per 100,000 compared to 314 per 100,000 in the group that did not get the treatment.\" Very very naively, then, that's one life saved via averted suicide per 1,000 treated, or about $150k to save a life via therapy (vs $3-5k for AMF), so probably wouldn't make much difference. But &nbsp;that is just looking at suicide. We could look at the all-cause mortality effects on treating depression (mental and physical health are often comorbid, etc.).</p>", "parentCommentId": "PYywqoJufNY8BJrKj", "user": {"username": "MichaelPlant"}}, {"_id": "u6o2mwRPLrzEwizpt", "postedAt": "2022-11-28T13:39:47.727Z", "postId": "JgqEqsa6iAtqGLYmw", "htmlBody": "<p>Serious question: Tanae, what else would you like to see? We've already displayed the results of the different ethical views, even if we don't provide a means of editing them</p>\n", "parentCommentId": "fd6nneyyFBK8cJGcw", "user": {"username": "MichaelPlant"}}, {"_id": "GWzjBswaGp7CpxqWK", "postedAt": "2022-11-28T14:10:39.051Z", "postId": "JgqEqsa6iAtqGLYmw", "htmlBody": "<p>Hello Richard. &nbsp;I'm familiar with the back-and-forths between McMahan and others over the nature and plausibility of TRIA, e.g. those in <a href=\"https://academic.oup.com/book/2706\">Gamlund and Solberg (2019)</a> which I assume is still the state of the art (if there's something better, I would love to know). However, I didn't want to get into the details here as it would require the introduction of lots of conceptual machinery for very little payoff. (I've even been to a whole term of seminars by Jeff McMahan on this topic when I was at Oxford)</p><p>But seeing as you've raised it ...&nbsp;</p><p>As Greaves (<a href=\"https://academic.oup.com/book/2706/chapter/143168473\">2019</a>) presses, there is an issue of which person-stages count:</p><blockquote><p>Are the relevant time-relative interests, for instance, only those of present person-stages (“presentism”)? All actual person-stages (“actualism”)? All person-stages that will exist regardless of how one resolves one’s decision (“necessitarianism”)? All person-stages that would exist given <i>some</i> resolution of one’s decision (“possibilism”)? Or something else again?</p></blockquote><p>Whichever choice the TRIA-advocate makes, they will inherit structurally the same issues for those as one finds for the equivalent theories in population ethics (for those, see <a href=\"https://compass.onlinelibrary.wiley.com/doi/abs/10.1111/phc3.12442\">Greaves (2017)</a>).</p><p>The version of TRIA you are referring to is, I think, actualist person-stage version: if so, then the view is not action-guiding (the issue of normative invariance). If you save the child, it will have those future stages, so it'll be good that it lived; if you don't save the child, it won't, so it won't be bad that it didn't. Okay, should you save the child? Well, the view doesn't tell you either way!&nbsp;</p><p>The actualist version can't be the one at hand, as it doesn't say that it's good (for the child) if you save it (vs the case where you don't).&nbsp;</p><p>I am, I &nbsp;think, implicitly assuming a present-stage-interest version of TRIA, as that's the one that generates the value-of-death-at-different-ages curve that is relevantly different from the deprivationist one.</p>", "parentCommentId": "egb6B4z6kELg3CEua", "user": {"username": "MichaelPlant"}}, {"_id": "hf6yvHikg9WpGakDB", "postedAt": "2023-01-12T10:15:58.781Z", "postId": "JgqEqsa6iAtqGLYmw", "htmlBody": "<p>If you found this post helpful, please consider completing HLI's <a href=\"https://hello289806.typeform.com/to/UUJ5iZK2\">2022 Impact Survey</a>.</p><p>Most questions are multiple-choice and all questions are optional. It should take you around 15 minutes depending on how much you want to say.</p>", "parentCommentId": null, "user": {"username": "BarryGrimes"}}, {"_id": "8N45MwB7acTiAAaFF", "postedAt": "2023-04-01T00:08:52.529Z", "postId": "JgqEqsa6iAtqGLYmw", "htmlBody": "<p>Based on this post I felt motivated to try to give a more visual and interactive explanation of the underlying philosophies and their bearing on WELLBYs. This is now available <a href=\"https://observablehq.com/@johnwelford/the-philosophy-of-extending-or-improving-lives\">here</a> (with an EA forum version <a href=\"https://forum.effectivealtruism.org/posts/GrEs8NREK77AAGfYf/the-philosophy-of-choosing-between-extending-and-improving\">here</a>).</p>", "parentCommentId": null, "user": {"username": "JohnW"}}, {"_id": "rgNZC8ZiK9irRvBn9", "postedAt": "2023-05-01T13:00:35.741Z", "postId": "JgqEqsa6iAtqGLYmw", "htmlBody": "<p>I've really enjoyed reading this topic and reading the comments here as well. I'm really excited to join the community and although I find myself vastly under-educated in the terminologies and brilliantly contrasting epistemological memes I do hope to add some Earth to the arena.</p><p>One of the most dangerous fallacies in the practical applications of social ethics and structured altruism an issue that tends to occur in the quantification of third-party experiential qualia which <a href=\"https://forum.effectivealtruism.org/users/weeatquince_duplicate0-37104097316182916\"><strong>weeatquince</strong></a><strong>, </strong><a href=\"https://forum.effectivealtruism.org/users/michaelplant\"><strong>MichaelPlant</strong></a><strong>, </strong>and<strong> </strong><a href=\"https://forum.effectivealtruism.org/users/ryc\"><strong>Richard Y Chappell</strong></a><strong> </strong>beautifully highlighted, and the specific point I'd like to substantiate is the sunk-cost fallacy that becomes almost a default of a happenstance when any quantification of a third-party's hypothetical experiential valued outcomes to the charted and plotted undertakings of a presupposing individual or party.</p><p>That presupposition being - that they, the individual or party that is doing the quantifying of the third-party individual's values, do actually care about that individual which their oversight and conjecture by all means is going to impact <i>(assuming there is a actual real-world application which the hypothesis is being formulated for, whether the individual is precise or hypothetical themselves.)</i></p><p>Notice the extreme difference in the amount of actual consideration to all aspects and dynamics we attend to when the consideration is of a loved one in mind. With a loved one in mind whom we care about we do not leave room for any variable to arise and cause harm to them, and we are committed to the safety and well-being of them as was we can very well consider a universally human virtue, as we do take responsibility for those we love and care for.</p><p>If we look at the characters in the old tale of Cain and Abel, the projected shame denied facing by Cain is elementally psychological in the depicted scenario through the expression <i>\"Am I my brother's keeper?\" </i>- which is the very sunk-cost fallacy that is the whole of my point.</p><p>We are <i>\"our brother's keepers\" &nbsp;</i>when we sincerely care. We take ownership of the risks and the dangers personally and we put ourselves responsible and accountable for all possible dangers and damages that may occur to or upon another - when we love another.&nbsp;</p><p>That is the only valid quantifier which can be attributed scientifically procuring, as it is the only stance which allows for the continuance of accounting of all data.</p><p>A third-party stance conjecturing hypothesis does not account for all data by the very nature of it's outside-party perspective, ergo, forms of itself a sunk-cost fallacy in the terms of its limits by the dimensions it can quantify values from.</p><p>And we can see this is a default to the process in every application of it we find in history, so much so that it's been the very reason we created terms like <i>\"socially immoral\"</i> and <i>\"community guidelines\" </i>to begin with, because there is a inherent understanding that when it comes to the application of ethics coming from a policy where the authors of the policy are alien to it's subjects -there is a X-factor of unknown immoral infliction <i>(or just as likely, a known immoral infliction) </i>that is due to the policy makers being alien to the subjects over which they are policing.</p><p>To me this does not leave us at an impasse, the impasse we've so-far carried over this clearly defined and outlined structural flaw is the shadow of the denial we've ironically deflected ownership of, and there is a vast amount of uncharted grounds which we could invent and create off of it if we ever did commit to the admittance if these factors and the sincere actuation, and sincere application of those illuminated avenues and realities arisen from what implications we're left with.</p><p>Here's one example of use-case I can think of just off the top of my head: upon the first sign of a politician lacking care for what harm and damages their actions had caused- they should no longer be entrusted with governance of that area and criteria which they were not seen holding themselves accountable to.</p><p>That should be common sense, it should be law, and in fact I might argue that it's even a threat to national security to not have that as a deterrent to protect the innocent.</p><p>Maybe I'm wrong, and maybe I'm shortsighted even somewhere, but that was just off the top of my head and I do hope someone more knowledgeable and better educated than I am can either take this to practical application or teach me how, because I care enough to want to see it through.</p><p>No one should be entrusted with care over things they do not care about, and the verification of care is as simple as measuring the actions taken in responsibility over the care of it, not just words. Anyone can say any words. The proof is in the actual real world pudding.</p><p>The difference between a person who actually cares for the individuals of a matter and a person who doesn't care for them is as enormous the difference between a native Alaskan Eskimo being asked to map out a valley's frozen lake and a blind flat-Earther from New Mexico who's never seen snow before in his life and thinks you're talking about \"hypothetical\" things that only exist in his imagination but are completely non-existent to him.</p><p>And that's what it is like every time when we think our 2-dimensional conceptualizing can somehow grasp a 5-dimensional reality impact, which accounts for ongoing-time with our inarguable accountability unquestionably married to the answering-for and managing of all risks and interrelating aspects including all interpersonal impacts caused by, from, to, and with -what influences over the ultra-personal values of the lives of others we plot to tread on.</p><p>It's always hypothetical to the CEO until it's money in the bank -and then it becomes <i>\"proof of concept\"</i> for them, while it's called <a href=\"https://www.youtube.com/watch?v=6xGyKuyGhaE&amp;t=1057\"><i>structural violence</i> </a>to us.</p>", "parentCommentId": null, "user": {"username": "Villafana. S."}}]