[{"_id": "XXkK3cCjQoYT7CebJ", "postedAt": "2022-09-02T08:07:02.356Z", "postId": "JHbYYjTWFJcwg6b5a", "htmlBody": "<p>Hey Trev, certainly an important topic! However, I downvoted because the post doesn't meet the standards I'd like to see from a post. </p><ul><li>Your core argument and claims are packed into fluff which distracted me and made it harder for me to follow.</li><li>You make a lot of (imho) insubstantial claims without backing them up or citing and engaging with any previously published research on that (not very small) field: \"wars are sparked when people follow egoistic/convenient motives\", the whole EvoPsych claims, etc.</li><li>The conclusions seem vague/not actionable/wrong: \"Promote atheism\", \"realise that status exists\", \"shame soldiers\". </li></ul><p>I'd recommend reading more EA forum posts and familiarising yourself with the style of posts that people would like to read before (re)posting tangentially related essays.</p>", "parentCommentId": null, "user": {"username": "JasperGeh"}}, {"_id": "ZH5qGDiQWPd4vu46a", "postedAt": "2022-09-03T14:00:47.345Z", "postId": "JHbYYjTWFJcwg6b5a", "htmlBody": "<p>Hi JasperGeh</p><p>Thanks for you comments. I take your point that I do not make citations references etc. I'm not an academic, so I don't have to follows rules and can write with complete freedom. It's great therapy for me at least!</p><p>&nbsp;I guess EA is not the social group for me, so I wish you all well and I will continue with my solo actions of writing to Ambassadors, newspapers, Politicians, Religious leaders, MP's &nbsp;and any one else who might listen and has power to make the world a better place. I put my faith in the chaos theory, that a small insignificant butterfly has a small non zero probability of &nbsp;creating a storm one day.</p><p>Keep up the good work, but apologies for wasting your valuable time.</p><p>Best Regards&nbsp;</p><p>Trevor Prew</p>", "parentCommentId": "XXkK3cCjQoYT7CebJ", "user": {"username": "Trev Prew"}}]