[{"_id": "a8L6CmRqwY9ANmboq", "postedAt": "2022-09-01T18:37:10.297Z", "postId": "JiEyCNoGD3WwTgDkG", "htmlBody": "<p>\"Imagine that every time there was a big crisis in the news, some EAs produced well-researched, sensible lists of the most plausibly-effective ways for people to help with that crisis. The lists would be produced voluntarily by EAs who were passionate about or informed about the cause, and shared widely by other EAs. \"</p><p>I agree that working on LICAs can be a good idea for individuals EAs and I think your examples were well-chosen. I disagree that it is a good idea for the EA community or institutions to work on LICAs.</p><p>I completely agree that addressing important, but \"less important\" issues can be a good use of time. If an individual EA could meaningfully improve US food bank management that seems really good, even if rich country food banks aren't an EA cause overall.</p><p>For EA institutions to work on these issues is a bad idea, IMO. If Open Phil staked out a position of abortion, for instance, it would alienate a lot of people. The only reason for EA orgs to work on divisive issues is because they are so important that the importance offsets the costs of division.</p>", "parentCommentId": null, "user": {"username": "ColdButtonIssues"}}, {"_id": "Bhv4xonW9HaQxW5iD", "postedAt": "2022-09-01T18:40:17.771Z", "postId": "JiEyCNoGD3WwTgDkG", "htmlBody": "<p>Another possible benefit is that doing cost-benefit analyses might make you better at doing other cost -benefit analyses, or give you other transferrable skills or knowledge that are helpful for top-priority causes. I think that for all our enthusiasm about these kinds of assessments, we don't actually as a community produce that many of them. Scaling up the analysis industry might lead to all sorts of improvements in how quickly and accurately we can do them.</p>\n", "parentCommentId": null, "user": {"username": "BenMillwood"}}, {"_id": "bqYGzaw5QLeDZ44aH", "postedAt": "2022-09-01T18:47:40.570Z", "postId": "JiEyCNoGD3WwTgDkG", "htmlBody": "<p>Though the flipside of this is I think we probably don't have a bunch of people sitting around like \"ah, I would do a cost-benefit analysis, but none of the things to analyse are worth my time\", so reading this post probably doesn't generate LICAs unless we also figure out what people are missing to be <em>able</em> to do more of this stuff.</p>\n<p>I expect partly it's just that doing Real, Important Research is more intimidating than it deserves to be, and it would be useful to try to \"demystify\" some of this work a bit.</p>\n", "parentCommentId": "Bhv4xonW9HaQxW5iD", "user": {"username": "BenMillwood"}}, {"_id": "GoeRxtAxDGQQNRvTM", "postedAt": "2022-09-01T18:53:49.696Z", "postId": "JiEyCNoGD3WwTgDkG", "htmlBody": "<p>This was intended to be part of SoGive's approach. Alongside ratings of how charities compared to top (~GiveWell) charities, we wanted to identify 'best in cause area' charities. Unfortunately no one wanted to pay us to do this, so we stopped.</p><p>One difficulty is the range of cost-effectiveness in many cause areas is likely to be much smaller than (e.g.) for global health. This could mean the best charity is only 2-3x as good as an average charity in that cause area. And unless there is a lot of high-quality evidence, you might expect there to be a big overlap in the confidence intervals for the expected cost-effectiveness of the best and average charities, such that it's not clear which is actually the best.</p>", "parentCommentId": null, "user": {"username": "Matt_Sharp"}}, {"_id": "Hv7xnfmQwdWY8QRaC", "postedAt": "2022-09-01T18:57:02.506Z", "postId": "JiEyCNoGD3WwTgDkG", "htmlBody": "<p>Another organization that is spending some time on this is sogive.org &nbsp;They have impact assessments for groups like Planned Parenthood and Muslim Aid.</p><p>I can provide an anecdotal use case that is maybe not quite tackled in your write up. &nbsp;My mother-in-law is a retired dentist. &nbsp;She gives money to the American Dental Association every year. &nbsp;This strikes me as an ineffective organization mostly because US dentists are typically quite wealthy. &nbsp;If I told her \"forget all that, give your money to Humane League/Helen Keller/Intelligence.org\" I think it would be a non-starter. &nbsp;If I can tell her about a more effective way to help people with dental issues that's a much shorter moral distance for her to travel. &nbsp;That was part of why I was really pleased to see Founder's Pledge release their report on Oral Health recently <a href=\"https://founderspledge.com/stories/oral-healthcare\">https://founderspledge.com/stories/oral-healthcare</a>&nbsp;</p>", "parentCommentId": null, "user": {"username": "Tyner"}}, {"_id": "EXwkFm9LLNixeYPJ6", "postedAt": "2022-09-01T21:17:58.106Z", "postId": "JiEyCNoGD3WwTgDkG", "htmlBody": "<p>Completely agree.&nbsp;</p><p>I'd also add that there are plenty of situations where individuals are required to disperse funds which have already been earmarked for spending on a particular cause. For example, many large businesses have staff \"LGBT+ inclusion committees\" and provide funds which these committees are expected to donate to LGBT+ charities.</p><p>In this situation, whether or not charities focussed on improving the lives of LGBT+ people are more or less effective than others is irrelevant. The funds are earmarked for that purpose and so the task of the committee members is to determine which charities that fall under their remit are most impactful.&nbsp;</p><p>If discussion relating to how to do so is not welcome and encouraged in EA spaces then there is a risk that such evaluation won't take place at all.</p>", "parentCommentId": null, "user": {"username": "Stuart"}}, {"_id": "uwD7rpXFqaZjqj5v8", "postedAt": "2022-09-01T22:14:19.340Z", "postId": "JiEyCNoGD3WwTgDkG", "htmlBody": "<p>Strong agree, and part of this is just that EAs should be more modest about how much their assessments of sector impact out-perform other people's. In the long term, weird second-order social impacts of interventions matter a lot more than the direct impact. For example, the (disputed) effects of abortion on crime rates <a href=\"https://www.sciencedirect.com/science/article/pii/S0047272721001043?via%3Dihub\">https://www.sciencedirect.com/science/article/pii/S0047272721001043?via%3Dihub</a> and female employment/social engagement <a href=\"https://link.springer.com/article/10.1007/s12122-004-1028-3\">https://link.springer.com/article/10.1007/s12122-004-1028-3</a> may create social spirals that continue long after the medical harm of the pregnancy and therefore considerably bump abortion rights up the virtual list of longtermist goals, but these effects are very hard to assess in simple models.</p>", "parentCommentId": null, "user": {"username": "Robin"}}, {"_id": "x6voCbFvhGuNmMDcS", "postedAt": "2022-09-02T10:04:30.458Z", "postId": "JiEyCNoGD3WwTgDkG", "htmlBody": "<p>Thanks for writing this post Amber! My first and overwhelming reaction is to think of this post: <a href=\"https://forum.effectivealtruism.org/posts/Pz7RdMRouZ5N5w5eE/ea-should-taboo-ea-should\">https://forum.effectivealtruism.org/posts/Pz7RdMRouZ5N5w5eE/ea-should-taboo-ea-should</a></p>\n<p>I think you get around this a little by suggesting this is a call for unorganized volunteers (to post their thoughts on the Forum?) but it's still more ambiguous than I would like</p>\n", "parentCommentId": null, "user": {"username": "Khorton"}}, {"_id": "Gcd3uHqWdtmRpTMyZ", "postedAt": "2022-09-02T14:40:10.675Z", "postId": "JiEyCNoGD3WwTgDkG", "htmlBody": "<p>I once had this argument with my friend, who convinced me against this position with the problem of redirecting resources. In theory, some resources are locked into a cause area (e.g. donors are committed to abortion) and some are not (donors are willing to change cause areas). Finding the best giving area within a cause will increase the efficiency of resources that are locked into that cause, but it will also encourage some amount of redirection. IIRC, when GiveDirectly introduced cash transfers for the US, their normal arms actually <em>lost</em> donations despite donations overall being way up during COVID. That's an example that demonstrates the worry that people will direct their money to less important areas if you give them a winning donation opportunity within that area.</p>\n", "parentCommentId": null, "user": {"username": "therealslimkt"}}, {"_id": "z2ycDz2b9LPygYMCP", "postedAt": "2022-09-02T16:15:56.836Z", "postId": "JiEyCNoGD3WwTgDkG", "htmlBody": "<p>Yeah, that is a good point. It makes a lot of sense for EA orgs to avoid divisive issues, particularly if they are not among the most pressing anyway.&nbsp;<br><br>A friend pointed out elsewhere that if producing LICAs was the norm for institutions, you might end up with institutions producing recommendations on <i>both</i> sides of a contentious social issue - e.g., how to effectively improve abortion access, <i>and </i>how to effectively reduce it. This could be bad both for PR reasons (*everyone* would hate us!) and because different sets of EAs are essentially doing work that cancels each other out.</p>", "parentCommentId": "a8L6CmRqwY9ANmboq", "user": {"username": "Amber"}}, {"_id": "qhmFB6yyW6g4MhwMm", "postedAt": "2022-09-02T16:16:32.056Z", "postId": "JiEyCNoGD3WwTgDkG", "htmlBody": "<p>Thanks! That's a really good example.</p>", "parentCommentId": "Hv7xnfmQwdWY8QRaC", "user": {"username": "Amber"}}, {"_id": "9qHD9uvFXnnWpRDd2", "postedAt": "2022-09-02T16:19:38.428Z", "postId": "JiEyCNoGD3WwTgDkG", "htmlBody": "<p>Ah, that's interesting! :( that no-one wanted to pay you to do it.&nbsp;<br><br>Why do you think the range of cost-effectiveness is greater in global health than in many other areas?</p>", "parentCommentId": "GoeRxtAxDGQQNRvTM", "user": {"username": "Amber"}}, {"_id": "NijYMrTvBdiqMtxQi", "postedAt": "2022-09-02T16:21:14.145Z", "postId": "JiEyCNoGD3WwTgDkG", "htmlBody": "<p>This is a good point, thanks!</p>", "parentCommentId": "EXwkFm9LLNixeYPJ6", "user": {"username": "Amber"}}, {"_id": "uQy7eJ6GtBRiNaHrY", "postedAt": "2022-09-02T16:22:07.199Z", "postId": "JiEyCNoGD3WwTgDkG", "htmlBody": "<p>Thanks Robin! Very good points.</p>", "parentCommentId": "uwD7rpXFqaZjqj5v8", "user": {"username": "Amber"}}, {"_id": "mLCep4NAz5uoN6KZc", "postedAt": "2022-09-02T16:27:40.595Z", "postId": "JiEyCNoGD3WwTgDkG", "htmlBody": "<p>Yeah this is a really good point! Something I was kind of aware of while writing this is that I'm a hypocrite - <i>I've</i> never done this. It's probably really hard to do, and probably one reason why people don't do it that much is just 'it will take me ages and ages, no-one is paying me to do, and I have a day job/studies/life to deal with'.&nbsp;<br><br>I would definitely sign up for, like, a 'cost-effectiveness analysis 101 fellowship'.&nbsp;</p>", "parentCommentId": "bqYGzaw5QLeDZ44aH", "user": {"username": "Amber"}}, {"_id": "NkmAKKQbcdpNCz3zq", "postedAt": "2022-09-02T16:30:45.194Z", "postId": "JiEyCNoGD3WwTgDkG", "htmlBody": "<p>Yeah, I was thinking of that post! Possibly the title to this post shouldn't even include 'should', but instead 'EAs can, if they want to...'<br><br>But then again, although I anticipate this mainly being done by people who feel some intrinsic motivation, maybe I <i>do</i> think that it's something the EA community \"should\" do more of?<br><br>I think it wouldn't be a bad idea for EA orgs to do some of this, though as ColdButtonIssues said above, it might be a good idea to avoid doing it for extremely divisive issues.&nbsp;<br><br>&nbsp;</p>", "parentCommentId": "x6voCbFvhGuNmMDcS", "user": {"username": "Amber"}}, {"_id": "xB3RihkeZz8FWgGPm", "postedAt": "2022-09-02T16:35:34.883Z", "postId": "JiEyCNoGD3WwTgDkG", "htmlBody": "<p>Hmm yes, that's interesting! I'd be interested to know how much this happens.</p>", "parentCommentId": "Gcd3uHqWdtmRpTMyZ", "user": {"username": "Amber"}}, {"_id": "gHzy6L75HtRd5rKQt", "postedAt": "2022-09-03T05:40:15.932Z", "postId": "JiEyCNoGD3WwTgDkG", "htmlBody": "<p>This is likely if the maximum cost effectiveness is highest in global health compared to other areas. If global health is just a uniquely high leverage area - which is plausible, so many people in poor countries suffer from easily preventable diseases with terrible impacts - then it's just going to have an exceptionally high ceiling compared to areas where the suffering is less preventable or less impactful.</p>\n", "parentCommentId": "9qHD9uvFXnnWpRDd2", "user": {"username": "therealslimkt"}}]