[{"_id": "iR743rutD3ZTGsoot", "postedAt": "2022-12-01T15:21:40.375Z", "postId": "Jiy3dNLvg7vvsvCHs", "htmlBody": "<p>I'm sure others can do a better job responding to this than I can, but a few thoughts:&nbsp;</p><ul><li>It's true that the high US debt/GDP ratio is not harmless, especially insofar as it leaves less fiscal headroom to deal with future recessions, wars etc.&nbsp;</li><li>If investors thought the US were likely to need to default or inflate away debt, then 30-year treasury rates would be extraordinarily high (since otherwise they wouldn't purchase them). That's the <a href=\"https://www.ustreasuryyieldcurve.com/\">opposite of what we see</a>, where long-run interest rates are less than short-run interest rates.&nbsp;</li><li>The US economy is <a href=\"https://www.cnbc.com/2022/10/27/us-gdp-accelerated-at-2point6percent-pace-in-q3-better-than-expected-as-growth-turns-positive.html\">growing faster than inflation</a>. So cost of living adjustments aren't such a big deal since tax revenue is growing as well&nbsp;</li><li>I'd expect US debt to grow much less in a potential upcoming recession than in 2008 or 2020. It made sense to be doing a lot of fiscal stimulus in response to the 2008 financial crisis, but if the fed intentionally triggers a recession as part of controlling inflation, fiscal stimulus doesn't make as much sense to do.&nbsp;</li></ul>", "parentCommentId": null, "user": {"username": "MHR"}}, {"_id": "AP4ky4rWv5RJkjNEr", "postedAt": "2022-12-01T15:55:58.513Z", "postId": "Jiy3dNLvg7vvsvCHs", "htmlBody": "<p>So are you shorting US stonks or the USD?</p>", "parentCommentId": null, "user": {"username": "ago"}}, {"_id": "qx25ptvs6MKzgTXtC", "postedAt": "2022-12-01T16:40:31.234Z", "postId": "Jiy3dNLvg7vvsvCHs", "htmlBody": "<p>My understanding is that persistent higher inflation may actually be very good for the U.S. government as it'll essentially erode the debt as inflation eats away at the value of the loans, so that should be taken into account. Of course, it's bad for stability, especially if you runaway inflation, but with high employment mitigating some of the downside this seems like a major positive factor for the U.S. gov given the amount of debt it holds.&nbsp;</p><p>&nbsp;</p><p>Edit to add: Thanks for taking the time to write this up, found it enjoyable and was a fun thought experiment!</p><p>&nbsp;</p><p>https://www.stlouisfed.org/on-the-economy/2022/aug/inflation-real-value-debt-double-edged-sword#:~:text=An%20increase%20in%20the%20price,higher%20prices%20increase%20nominal%20GDP.</p>", "parentCommentId": null, "user": {"username": "atlasunshrugged"}}, {"_id": "sKm4z6pChAkzfYgPw", "postedAt": "2022-12-01T16:42:26.463Z", "postId": "Jiy3dNLvg7vvsvCHs", "htmlBody": "<p>At this point I'd think higher interest rates have knocked many overinflated stonks down to a reasonable level (at least based on the bloodbath that is the tech stock market over the last few months), that's not to say of course that other risks haven't been adequately priced in... like the most valuable company in the world for instance being hugely dependent on the manufacturing of a geopolitical competitor to the U.S.</p>", "parentCommentId": "AP4ky4rWv5RJkjNEr", "user": {"username": "atlasunshrugged"}}, {"_id": "oQdCPj6THYS4kGe4b", "postedAt": "2022-12-01T17:03:51.973Z", "postId": "Jiy3dNLvg7vvsvCHs", "htmlBody": "<p>One more note. You say</p><blockquote><p>The US gov tax revenue is $4.9T. According to <a href=\"https://www.cbo.gov/publication/58147\">the CBO (Congressional Budget Office)</a>, Mandatory spending will cost $3.7 trillion dollars in 2022. This includes all entitlements and expenditures that are signed into legislation and are considered absolute obligations, such as social security and medicare. Then we add in the estimated $800B of defense spending (which is contractual), and we get a total of $4.5T.</p><p><i>$4.9T revenue - $3.7T entitlements - $800B defense = $400B leftover for interest expense.</i></p><p>The problem is interest expense itself is currently costing $482 Billion dollars. So we have at least <strong>$82 Billion</strong> in deficit, which means we have to borrow even more money to pay back the extra interest expense that we can't pay back. Note that this doesn't even take into account some of the other discretionary spending as well as unfunded liabilities.</p></blockquote><p>This is true of the current budget, but &nbsp;the US could raise taxes to cover interest payments in the future. The US has relatively low taxes compared to other rich countries. Raising the US tax/GDP ratio to that of Germany would raise about $2T more per year in taxes than the US currently takes in.</p>", "parentCommentId": "iR743rutD3ZTGsoot", "user": {"username": "MHR"}}, {"_id": "3WGdSLFfLgA5dNKnh", "postedAt": "2022-12-01T19:33:54.778Z", "postId": "Jiy3dNLvg7vvsvCHs", "htmlBody": "<blockquote>\n<p>As the government debt reaches maturity, it needs to roll over and be repriced at current interest rates of 4% (but let's take an average of 3%) - think of this as your fixed-term interest rates on your mortgage running out so you need to renegotiate a new rate with the bank. If we reprice the current $31.3T of debt at 3% interest rates, the interest expense would increase by ~$500 billion per year to almost $1 Trillion per year - That will overtake military spending as the biggest single line item for spending.</p>\n</blockquote>\n<p>Not all the debt matures at the same time, does it? If not then maybe only the portion that matures gets repriced?</p>\n", "parentCommentId": null, "user": {"username": "supesanon"}}, {"_id": "DjHmPGB9a8zsdmbAJ", "postedAt": "2022-12-01T19:45:05.504Z", "postId": "Jiy3dNLvg7vvsvCHs", "htmlBody": "<p>The public debt to GDP ratio in Japan is over 260% and they still haven't defaulted (it somewhat boggles my mind that they can sustain such high debt levels even though it seems that there are reasonable explanations for it). There are ostensibly some differences between the Japanese and American contexts but nonetheless it seems possible for developed countries to sustain high levels of public debt for a considerable amount of time. I think how long of a time is still an open question. I'd expect to see the Japanese situation unravel before the American one and maybe that might give an indication of how sustainable extreme high levels of debt are if there is ever such an unraveling.</p>\n", "parentCommentId": null, "user": {"username": "supesanon"}}, {"_id": "TPd2bwTbKfXtsSaT7", "postedAt": "2022-12-02T00:40:41.078Z", "postId": "Jiy3dNLvg7vvsvCHs", "htmlBody": "<p>Correct, that's why it says</p>\n<blockquote>\n<p>it needs to roll over and be repriced at current interest rates of 4% (but let's take an average of 3%)</p>\n</blockquote>\n", "parentCommentId": "3WGdSLFfLgA5dNKnh", "user": {"username": "robirahman"}}, {"_id": "6kZGvKJh4vd5MBKqp", "postedAt": "2022-12-02T07:57:23.715Z", "postId": "Jiy3dNLvg7vvsvCHs", "htmlBody": "<p>I agree &nbsp;with the overall reasoning for why we need inflation hedges.</p><p>I also agree that US debt poses a risk, as all debts do, but I would view this risk slightly differently, using a historical rather than budgetary lens:</p><ul><li>to a large degree, the privilege of the dollar is due to the US being the largest economy, the major world power and a stable government. That makes it \"too big to fail\"</li><li>eventually, the US will not be the largest economy / major world power (looking at history you have to make a strong bet against permanent supremacy). At that point, it will have to come back to Earth and make much more constrained choices like all the other countries have to</li><li>this course of events is unlikely to happen because some Fed decision about the timing of interest rates, or because some politician in the 2020s refused to cut back entitlements by a small percentage. It will happen because some other country starts to be seen as the safer option. Prolonged GDP decline, a major military defeat, and/or government overthrow could all help precipitate such an outcome.</li></ul><p>The reason this matters is that typical US debt hawks will advocate as a main solution reduced spending on long-term infrastructure, military technology and so on.</p><p>However, if you're concerned with debt, you should be more concerned about GDP (what you get out of the dollar) than government spending (what you put into it, so to speak); about military power than military leanness;and about government stability than government drama (including periodic debt ceiling freakouts). &nbsp;A strong government backed by a strong share of the world economy - that is what investors see in the US dollar. The minute they stop seeing that, the party is over and hard choices will need to be made. (Remember how the markets reacted to Liz Truss's budget a few months ago? That is what a former empire making economic decisions looks like.)</p><p>So if you keep GDP running, prevent China from overturning the world order, and avoid obvious own-goals such as January 6 style craziness the US should be fine for a while longer.&nbsp;</p><p>Now, is this US-favourable outcome the most beneficial to the world? I don't know - it may be better to shift the equilibrium at some point (though on balance, I would tend to say, probably not now). But if it is the outcome you want, those would be the key items to safeguard.</p>", "parentCommentId": null, "user": null}, {"_id": "WHgixyXfcimHoggJG", "postedAt": "2022-12-02T18:46:34.217Z", "postId": "Jiy3dNLvg7vvsvCHs", "htmlBody": "<p>Firstly, I want to flag that this prediction is in strong disagreement with market predictions: the rate on a 20-year treasury is <a href=\"https://ycharts.com/indicators/20_year_treasury_rate\">3.85%</a> as I write this, suggesting that investors do not expect a dramatic increase in inflation. This is in one of the largest, most liquid, and most attended-to markets on the planet, the only competition I am aware of being other US Government bonds.</p><p>Secondly, the weighted average maturity of US government debt is around <a href=\"https://www.brookings.edu/blog/up-front/2022/07/27/projecting-the-structure-of-us-treasury-debt/\">five years</a>, to give a concrete value for thinking about how long the US government can have much higher inflation before markets are able to fully react. That's a moderate amount of time, but if you say that the US government is willing to accept multiple years of 15% inflation (an extremely bold claim), you could still only get a temporary 50% reduction in the debt without fixing the underlying entitlement issues.</p><p>Which is why it is very strange that this post assumes as a hard constraint that the US government will fulfill its entitlement obligations. I'm not sure why that is assumed. Faced with the option set \"inflation\" and \"cut Medicare and Social Security\", the government might easily choose Medicare and Social Security. Yes, there have been promises, but they are not very credible. Maybe the inflation target gets set to 3% or 4%, numbers that are still very small, but cuts to the commitments seem as or more plausible as spending expands.&nbsp;</p><p>Once you drop that assumed constraint, the option set of the government expands to a wide variety of more acceptable solutions.</p><p>Finally, \"Inflation is going to be terrifyingly high any day now: buy gold/crypto/my special security\" has been a recurrent promise of financial snake oil salesmen for decades. Always be careful when you see people claiming it, particularly if they're also selling something. Debt fears have a similar pedigree: we might be told to be terrified of 130% now, but I remember back when it was 90%, which turned out to be an <a href=\"https://theconversation.com/the-reinhart-rogoff-error-or-how-not-to-excel-at-economics-13646\">Excel error</a>.</p><p>They might be right this time, but you should look for a lot more than a single analysis without theoretical justification, which relies heavily on datapoints following legendarily expensive wars. In the period since the 1950s, attitudes towards government defaults have shifted. Monarchies act differently from independent central banks.</p>", "parentCommentId": null, "user": {"username": "keller_scholl"}}]