[{"_id": "p9fLWMbZnjQPErjrk", "postedAt": "2023-03-29T15:45:20.434Z", "postId": "Jj4QppJpDgyDAEXiu", "htmlBody": "<p>Hey everyone, we (the moderators) realize that seeing this post on the Forum may cause some negative emotions and that it might be worth discussing how to process this post in light of his <a href=\"https://forum.effectivealtruism.org/posts/QMee23Evryqzthcvn/a-statement-and-an-apology\">recent apology</a>. But we also want to give space to object-level discussion of the contents of the post, and separate those out somewhat. So <strong>we ask that you avoid commenting on Owen's recent apology anywhere but in this thread</strong>. New top-level comments (and responses to them) should focus on the contents of the post; if they don't, we'll move them to this thread.</p><p>We're not doing this to prevent any specific conversations from happening, but rather because we hope that separating the conversations out will make them go better.</p><p><i>We've never tried this setup before but might try it again for important (and difficult) conversations depending on how it goes here.</i></p>", "parentCommentId": null, "user": {"username": "jpaddison"}}, {"_id": "LKxmWiuyLd7v9RR6x", "postedAt": "2023-03-29T17:16:06.241Z", "postId": "Jj4QppJpDgyDAEXiu", "htmlBody": "<p>This must be one of the best FTX reflections I've heard for avoiding the all-too-tempting 'us vs them' / 'goodies vs baddies' mindset.</p><p>And I think the assumption that 'almost no one is evil; almost everything is broken' generally leads to both much more accurate takes and much more openness to cooperation moving forward.</p>", "parentCommentId": null, "user": null}, {"_id": "nEucXa8yoBAGhqsXs", "postedAt": "2023-03-29T22:32:40.243Z", "postId": "Jj4QppJpDgyDAEXiu", "htmlBody": "<p>Nathan (or anyone else) I doubt I will read the whole google doc but would appreciate a ~1 page summary, and I think that would be appropriate to include in this post (with, of course, a disclaimer that it is your gloss on what Owen is saying)</p>\n", "parentCommentId": null, "user": {"username": "Oscar Delaney"}}, {"_id": "JhHHzy5yvEJPPuCX6", "postedAt": "2023-03-30T00:57:43.938Z", "postId": "Jj4QppJpDgyDAEXiu", "htmlBody": "<p>Very interesting, thanks for sharing Nathan, and to Owen for writing.</p><p>Minor question, maybe I just missed it: why is '<i><s><strong>Exceptionalism</strong></s></i> ' written in strike-through every time?</p>", "parentCommentId": null, "user": {"username": "Larks"}}, {"_id": "SyG2f3NJ52k7wFnQd", "postedAt": "2023-03-30T07:28:30.447Z", "postId": "Jj4QppJpDgyDAEXiu", "htmlBody": "<p>I interpreted that as \"against exceptionalism\" or \"place lower credence in EA exceptionalism\", but I'm not sure.</p>", "parentCommentId": "JhHHzy5yvEJPPuCX6", "user": {"username": "Maxdalton"}}, {"_id": "MCPPsGtsY247KxoPw", "postedAt": "2023-03-30T15:15:49.546Z", "postId": "Jj4QppJpDgyDAEXiu", "htmlBody": "<p>That was my guess, but other phrases like <i><strong>Uncompromising utilitarianism</strong></i> do not get the same treatment. Maybe exceptionalism is a theory about the world while the others are policies that can be adopted or rejected?<br><br>&nbsp;</p>", "parentCommentId": "SyG2f3NJ52k7wFnQd", "user": {"username": "Larks"}}, {"_id": "9qxRiY8KZz5bstbtm", "postedAt": "2023-03-30T19:16:44.679Z", "postId": "Jj4QppJpDgyDAEXiu", "htmlBody": "<p>As someone who read the whole piece, I think you could just read the bolded lines and read the explanatory bits below for those lines you find interesting/key.&nbsp;It's also already an outline, so you could just read the bullets further to the left, and read the further-right bits as your curiosity and ethical compass direct you. Reading the left-ward bits can always be assumed to function as a summary of an outline (and author's fault if it doesn't).&nbsp;<br><br>[EDIT: This is what Angelina Li did above, nice :) Hopefully if anyone finds any bit intriguing, they go read more in the source :)<br><br>The rest is me reflecting on EAs and appropriateness of summaries vs different types of info-gleaning]<br><br>I'm not confident that summarizing pieces like this for an EA audience [like, typical summary paragraph-style] really works tbh. Different EAs will need very different things from it. Eg, community builders will be way more interested in the CB section and want to read it in detail even if they disagree, so as to understand the modes of thinking that others might adopt and what they might want to refute or adapt to.&nbsp;</p><p>This is also, after all, just someone's personal reflections and won't necessarily be the way EAs move forward on any of these things. And for reflections, summaries often cut reasoning and therefore lead to information cascades that need to be addressed later, I think. We already have way too much deference and information cascades in EA anyway, so I'd rather see people lean more toward engaging with material semi-deeply that is relevant to them or not repeat ideas at all tbh. This leads me to say that each reader should be proactive [by reading the bolded/leftward parts of the the outline themselves], and try to sort out the bits they care about or want to improve their thinking on and read anything further on that carefully.&nbsp;<br><br>It's totally okay to say \"this isn't really my bag, and I trust others to get it right eventually, so I'm not gonna engage with this\". And if you don't trust others to get it right eventually (and the FTX debacle is certainly around a low-trust theme), I still think EAs should engage semi-deeply (enough to evaluate trust in others or actually do the better job yourself) or hardly at all (even if this means pulling back from EA til you have the spoons to check-in deeply on your concerns), because engaging lightly will probably only waste your time, confuse discussion, and waste the time of others if they retroactively have to correct misunderstandings that spread thanks to poor-quality/surface-level engagement. [I've gone on a long time which makes it sound like a big ask, but honestly I am just talking about semi-deep engagement (eg, reading the leftward parts of the full outline as the author intended when in flow with the work and any further details as needed) vs light engagement (reading a summary which I don't think works for long pieces like this), <strong>not</strong> mandating very-deep engagement (reading the piece in full detail). So I think most people can do it.]<br><br>That said, I appreciate your sentiment, and I think a table of contents and better section titles would be extremely helpful for easier semi-deep engagement. Also, using numbered outline instead of bullet points. I think these are also easier asks less likely to get future posts hung up in procrastination-land.</p>", "parentCommentId": "nEucXa8yoBAGhqsXs", "user": {"username": "Ivy_Mazzola"}}, {"_id": "mSeb7hARJpSzSkrHQ", "postedAt": "2023-03-30T19:36:53.814Z", "postId": "Jj4QppJpDgyDAEXiu", "htmlBody": "<p>Here’s just the headings from the updates + implications sections, lightly reformatted. I don’t necessarily agree with all/any of it (same goes for my employer).</p><h3>Updates</h3><p><strong>Factual updates (the world is now different, so the best actions are different)</strong></p><ul><li><i><strong>Less money&nbsp;</strong></i>— There is significantly less money available</li><li><i><strong>Brand&nbsp;— EA/longtermism has a lot more media attention, and will have a serious stain on its reputation (regardless of how well deserved you think that is)</strong></i></li><li><i><strong>Distrust&nbsp;</strong></i>— My prediction is that if we polled the EA community, we’d find EAs have less trust in several institutions and individuals in this community than they did before November. I think this is epistemically correct: people should have less trust in several of the core institutions in the community (in integrity; in motives; in decision-making)</li></ul><p><strong>Epistemic updates&nbsp;(beliefs about the world I wish I’d had all along, that I discovered in processing this evidence)</strong></p><ul><li><i><strong>Non-exceptionalism</strong></i> — Seems less likely that a competent group of EAs could expect to do well in arbitrary industries / seems like making money is generally harder (which means the estimate of future funding streams goes down beyond the immediate cut in funding)</li><li><i><strong>Dangerous ideas</strong></i> — We should be more worried that aspects of our memeplex systematically increase the risk of people taking extreme actions that are harmful</li><li><i><strong>By the book</strong></i> — The robustness that comes from doing things by the book seems more important</li><li><i><strong>Uncompromising utilitarianism</strong></i> — We should be more worried about people orienting to utilitarian arguments in absolutist ways that don’t admit other heuristics</li><li><i><strong>Tribalism&nbsp;</strong></i>— I’m more worried that people identifying as EAs is net destructive</li><li><i><strong>Conflicts&nbsp;</strong></i>— I’ve moved towards thinking conflicts of interest, broadly understood, are frequent and really guide people’s thinking</li><li><i><strong>Integrity&nbsp;</strong></i>— I think that upholding consistently high standards of integrity is particularly important</li><li><i><strong>Taking responsibility&nbsp;— Diffusion of responsibility for cross-cutting issues for the EA community can mean nobody works on them</strong></i></li><li><i><strong>Complicity&nbsp;</strong></i>— Tacit tolerance of bad behaviour is a serious issue</li></ul><h3>Implications</h3><p><strong>Implications for object level work:</strong></p><ul><li>We should be a bit more positive on people doing crucial work within established institutions</li><li>We should have a somewhat higher bar for funding things</li><li>We should consider lower salaries</li><li>We should care a bit more that plans look robustly good</li><li>We should be a bit more positive on&nbsp;<a href=\"https://distill.pub/2017/research-debt/\"><u>research distillation</u></a></li></ul><p><strong>Implications for community-building activities:</strong></p><ul><li>Content (reading lists, talks, etc.) should:<ul><li>Bit more positive on content from outside EA</li><li>Bit more tools-driven, and a bit less answers-driven</li><li>Bit more emphasis on the value of looking at things from several perspectives</li><li>Focus a bit more on social epistemology</li></ul></li><li>The vibe of community-building activities should:<ul><li>Lean a bit further away from encouraging people to identify as EA</li><li>Lean a bit further away from “we have the answers” and towards “we’re giving you the questions”</li><li>Send somewhat fewer in-group signals</li><li>Focus on building a culture which is high-integrity</li><li>Focus on building a culture which treats consequentialist analysis as just one tool in the toolkit</li><li>Focus on building a culture which asks people to make sure they know who has responsibility for things</li></ul></li><li>Structurally, community-building activities should:<ul><li>Put somewhat lower estimates on the monetary value of outcomes or programs</li><li>Be more transparent about these valuations and other tools for decision-making about community building</li><li>Scale down activities a little (or slow the growth trajectory)</li><li>Scale down salaries a bit</li></ul></li></ul><p><strong>Implications for central community coordination:</strong></p><ul><li>We should lean a bit further towards professionalism</li><li>We should lean a bit further towards transparency</li><li>We should consider creating mechanisms for anonymously sharing updates/impressions</li><li>Orgs should be very explicit about what they are and aren’t taking responsibility for</li><li>Coordination mechanisms should facilitate making sure someone is taking responsibility for important things</li><li>We should ensure that people can access some core discussions by application, not just by networking</li><li>We should lean a bit more towards legible invite criteria, especially for flagship events like Coordination Forum</li><li>We should lean a bit further towards frugality</li></ul><p><strong>Implications for governance:</strong></p><ul><li>We should increase oversight of projects and decisions</li><li>We should increase transparency of governance</li><li>We should err towards doing more impact analyses</li><li>Projects and orgs should invite accountability primarily for whether they took responsibility for the right things, and how those things went</li><li>We should give less weight to straightforward consequentialist PR arguments&nbsp;</li><li>We should spread governance work over more people</li></ul>", "parentCommentId": null, "user": {"username": "Angelina Li"}}, {"_id": "qih98Yejn63BvNLHv", "postedAt": "2023-03-30T19:38:41.879Z", "postId": "Jj4QppJpDgyDAEXiu", "htmlBody": "<p>Here's my <a href=\"https://forum.effectivealtruism.org/posts/Jj4QppJpDgyDAEXiu/?commentId=mSeb7hARJpSzSkrHQ\">attempt</a> (just copy pasting the bolded lines, as Ivy suggests).</p>", "parentCommentId": "nEucXa8yoBAGhqsXs", "user": {"username": "Angelina Li"}}, {"_id": "LDXsgcCWc8HFnjiGC", "postedAt": "2023-03-30T20:10:54.030Z", "postId": "Jj4QppJpDgyDAEXiu", "htmlBody": "<p>Nice job, I was super happy to notice that :) :thumb:</p>", "parentCommentId": "qih98Yejn63BvNLHv", "user": {"username": "Ivy_Mazzola"}}, {"_id": "moagnaewCWanZrBPA", "postedAt": "2023-03-31T19:02:37.917Z", "postId": "Jj4QppJpDgyDAEXiu", "htmlBody": "<p>Thanks for writing and sharing this. I feel confused about the scale on some of these. For example:</p><blockquote><p>it now somewhat less appears that a competent group of EAs could expect to do well in arbitrary industries... “How exceptional are EAs, compared to other social groups?”: 5/10 → 3/10</p></blockquote><p>Pre-FTX collapse, an EA was the richest self-made person in the world under 30 after having switched to an industry they had no experience in (crypto), and this is evaluated as 5/10 ability to do well in arbitrary industries? What is the scale here? What are social groups that are 10/10? Is the claim that Sam was 10/10 but the rest of us were 1/10 so it averages out to 5/10? But weren't something like &gt;0.1% of EAs billionaires at that point? Surely that's at like the 99th percentile of billionaire density for social groups?&nbsp;</p><p>And we are currently 3/10? The fact that most EA's have the right to work in an OECD country seems like it automatically should put us at at least the 80th percentile or something?</p><p>Maybe this is pedantic, but this lack of precision on the scale makes it hard for me to interpret the strength of these updates. E.g. if Owen is making the claim that EA's have below-average ability amongst humans to accomplish arbitrary business goals (which is my naïve interpretation of the 3/10 rating) then this seems like a really strong and surprising claim.</p><p>(Note: I'm more sympathetic to the claim that EAs do things that are impactful in absolute value but have a negative sign, so the overall net impact is lower. But I understand Owen to be talking about a different thing here.)</p>", "parentCommentId": null, "user": {"username": "Ben_West"}}, {"_id": "LbRTFnMu3xgyhuxLH", "postedAt": "2023-03-31T22:08:31.833Z", "postId": "Jj4QppJpDgyDAEXiu", "htmlBody": "<p>I read the endpoints as 0 is no <em>extraordinary</em> abilities at all (i.e., similiar to most groups with similiar characteristics like education and geography) and 10 as a group of Nobel prize winners or something.</p>\n", "parentCommentId": "moagnaewCWanZrBPA", "user": {"username": "Jason"}}, {"_id": "vwipH8FiKeG7ng5Jx", "postedAt": "2023-04-03T06:36:07.330Z", "postId": "Jj4QppJpDgyDAEXiu", "htmlBody": "<blockquote><p>“How much do we need robust application-based mechanisms to access core discussions?”: 5/10 → 8/10...</p><p>For a few months I was collaborating with the CEA Events team to plan the Summit on Existential Security [LINK], which is in the broad category referred to here (more recently I stepped back from that). Since plans were already significantly in motion before the FTX collapse, some of the updates weren’t very actionable this time around (e.g. the venue had been paid for, so there’s relatively little to do from the frugality update; and we’d largely settled on an invite process).</p></blockquote><p>Even if it was not possible to allow applications this time, I think it would be useful for people know that events like this are happening, and ideally some key takeaways after. But the link is not active.</p>", "parentCommentId": null, "user": {"username": "Denkenberger"}}, {"_id": "HeA36vRmGDd8hwmPc", "postedAt": "2023-04-03T10:07:46.311Z", "postId": "Jj4QppJpDgyDAEXiu", "htmlBody": "<p><a href=\"https://forum.effectivealtruism.org/posts/WLZabqQGCd2joZpxR/summit-on-existential-security-2023\">Here's a post from a few months ago where they announced the event</a>. (Maybe this is what Owen wanted to link to.)</p>", "parentCommentId": "vwipH8FiKeG7ng5Jx", "user": {"username": "Maxdalton"}}, {"_id": "Dy87FgdNhHRpG5C3e", "postedAt": "2023-04-03T21:45:10.921Z", "postId": "Jj4QppJpDgyDAEXiu", "htmlBody": "<p>Thanks!</p>", "parentCommentId": "HeA36vRmGDd8hwmPc", "user": {"username": "Denkenberger"}}, {"_id": "ZmygDnWLCyzBzEZAY", "postedAt": "2023-04-04T19:01:11.834Z", "postId": "Jj4QppJpDgyDAEXiu", "htmlBody": "<blockquote><p>“We should do things by the book”: Agree 6/10 → 9/10</p></blockquote><p>This feels like a confusing update, largely due to \"by the book\" being a vague phrase.</p><p>I agree that FTX's \"move fast and break things\" culture seems to be upstream of some of their problems, and this is a point in favor of, for example, separating the bank accounts of legally distinct entities (which is a \"by the book\" practice).</p><p>But if I imagine a world in which EA organizations caught/prevented the FTX issues, I think this would have required a bunch of non-\"by the book\" work. I think very few nonprofits would do the kind of due diligence that would have been required to uncover this level of fraud in one of their donors, and if EA's had been compelled to do so it would have been through arguments like \"'by the book' behavior underrates the severity of tail risks so therefore you should do this weird stuff despite it being costly and different from 'the book.'\" So I think you could make the opposite update, for a reasonable definition of \"do things by the book\".</p><p>One concrete example from your document: you say that an implication of the update that we should do more things \"by the book\" is that we should do more impact evaluations. I think impact evaluations are great, but I'm confused what \"book\" you are referring to which states that nonprofits should do more impact evaluation. Normal nonprofits do ~0 impact eval. Arguably all of EA is a reaction to the fact that normal nonprofits do ~0 impact eval. If you think we should do more impact evals then this does not seem to be justifiable by an appeal to what normal/best practice/\"by the book\" nonprofits do.</p>", "parentCommentId": null, "user": {"username": "Ben_West"}}, {"_id": "au5EC8Gsfkpnbs2iE", "postedAt": "2023-03-29T15:24:36.372Z", "postId": "Jj4QppJpDgyDAEXiu", "htmlBody": null, "parentCommentId": null, "user": null}, {"_id": "533N4jWKhRLHaLjFy", "postedAt": "2023-03-30T19:39:04.176Z", "postId": "Jj4QppJpDgyDAEXiu", "htmlBody": null, "parentCommentId": "nEucXa8yoBAGhqsXs", "user": null}]