[{"_id": "Pd3nr7kMHhu6GCNxD", "postedAt": "2022-12-17T13:39:35.976Z", "postId": "JjAcacdCHqj9wqmKx", "htmlBody": "<p>I'm not sure if I understand where you're coming from, but I'd be curious to know: do you think similarly of EAs who are Superforecasters or have a robust forecasting record?</p>\n<p>In my mind, updating may as well be a ritual, but if it's a ritual that allows us to better track reality then there's little to dislike about it. As an example of how precise numerical reasoning could help, the book Superforcasting describes how rounding Superforecasters predictions (interpreting .67 probability of X happens as .7 probability of X happening) increases the error of the prediction. The book also includes many other examples where I think numerical reasoning confers a sizable advantage to its user.</p>\n", "parentCommentId": null, "user": {"username": "Alejandro Acelas"}}, {"_id": "DrKMpuG7uvh8eEi94", "postedAt": "2022-12-17T20:11:10.880Z", "postId": "JjAcacdCHqj9wqmKx", "htmlBody": "<p>Thank you for the question!</p>\n<p>In my understanding, superforecasters claim to do well at short-term predictions, in the range of several years, and with respect to a few domains.   That is not me speaking about my judgement, that's some discussion that I read about them. They have no reason to update on their own forecasts outside a certain  topic and time domain, so to speak.I can track down the references and offer them if you like, but I think the problem I'm referring to is well-known.</p>\n<p>I want to learn more about the narrow context and math where superforecasters are considered \"accurate\" versus in error, and why that is so.  Offering odds as predictions is not the same as offering a straightforward prediction, and interpretation and use of odds as a prediction is not the same as acting on a prediction. I suspect that there's a mistaken analogy about what superforcaster's actually do and what it means for assigning subjective probabilities to credences in general.</p>\n<p>EA's offer probabilities for just about any credence, but especially credences whose truth is very hard to ever determine, such as their belief in an upcoming existential harm. Accordingly, I don't believe that the mystique that supeforecasters have can rub off on EA's, and certainly superforecaster success cannot.</p>\n<p>Other approaches for different purposes, like fermi estimates, where you attempt to estimate the size of something by breaking it down into components and multiplying, are good ways to get a better estimate of whatever is being estimated, but I don't consider that an attempt to assign a probability to a credence by an EA in a typical context, and that is all I was focused on with my critique.</p>\n<p>Statistical estimation is used in a lot of domains, but not in the domain of beliefs. If I were taking samples of runs in a factory, looking to estimate numbers of widgets with construction errors coming off the line with some random sampling, I wouldn't be thinking as I do here about EA updating. EA's don't do much random sampling as part of offering their subjective probabilities. While it might be useful to check for background distributions relevant to event occurrences under the assumption that some outcomes are determined by a population distribution, most of what happens in the world is not random in that sense, and our feelings and beliefs are not about interpretation of such random events, for the most part.  An EA working in a factory would do what everybody else does, some random sampling, not use their \"priors\" and guess a percentage and thus a probability of a random widget having a construction error.</p>\n<p>I don't object to numerical reasoning. It's really the \"updating\" that I think is dubious. There are a lot of great equations in mathematics, any of which you could build a a community around, and Baye's theorem is, I guess, one of them, but it's gone wrong in EA.</p>\n", "parentCommentId": "Pd3nr7kMHhu6GCNxD", "user": {"username": "Noah Scales"}}, {"_id": "ZQLytdyf9qohGKnwe", "postedAt": "2022-12-18T23:43:03.190Z", "postId": "JjAcacdCHqj9wqmKx", "htmlBody": "<p>Thanks for taking the time to respond! I find your point of view more plausible now that I understand it a little bit better (though I'm still not sure of how convincing I find it overall).</p>\n", "parentCommentId": "DrKMpuG7uvh8eEi94", "user": {"username": "Alejandro Acelas"}}, {"_id": "dxjtkvRFtewXDoSMJ", "postedAt": "2022-12-19T08:21:00.793Z", "postId": "JjAcacdCHqj9wqmKx", "htmlBody": "<p>Sure, and thank you for being interested in what I have written here.</p>\n<p>I didn't offer an argument meant to convince, more a listing of perspectives on what is actually happening around EA \"updating\". For example, to know that an EA is confusing judgments of feeling intensity and truth probability, I would have to have evidence that they are acting in good faith to\" update\" in the first place, rather than (unconsciously) pursuing some other agenda. As another example, to know that an EA has a betting problem, the psychological kind, I would have see pathological betting behavior on their part (for example, that ruined their finances or their relationships). Different EA's are typically doing different things with their \"updating\" at different times. Some of them are sure to have a bit of risk-seeking that is unhealthy and distorts their perspective, others are doing their best to measure their feelings of certainty as a fractional number, and still others are being cynical with their offerings of numbers. If the superforecasters among the EA's are doing so well with their probability estimates, I wish they would offer some commentary on free will, game theory, and how they model indeterminism. I would learn something.</p>\n<p>If there were a tight feedback loop about process, if everyone understood not only the math, but also the evidence that moves your credence numbers, if there were widespread agreement that a new bit of evidence <em>X</em> should move probability of credence <em>Y</em> an amount <em>Z</em> , then I could believe that there was systematic care about epistemics involved in the community.  I could believe that EA folks are always training to improve their credence probability assignments. I could believe that EA folks train their guts, hone their rationality, and sharpen their research skills, all at the same time.</p>\n<p>But what actually goes on in EA seems very subjective, anyone can make up any number and claim their evidence justifies it and don't really have to prove anything, and in fact, it's hard to make a case that is not subjective, and there's a spread of numbers on most credences, or there really isn't but I'm looking at the numbers and seeing most people quoting somebody else then, while everyday credences are just treated as regular beliefs (binary or constrained with experience)  plus there is plenty of secondary gain potential, so I don't believe that EA folks are using their probability estimates well at all, no.</p>\n<p><strong>NOTE:</strong> By \"secondary gain potential\", I mean gain from an action other than the  action's ostensible gains. A person doing updating for its secondary gains might be developing:</p>\n<ul>\n<li>feelings of belonging in the EA community.</li>\n<li>a sense of control over their feelings of doubt or certainty.</li>\n<li>an addiction to betting or other financial risk-taking.</li>\n<li>a (false) sense of efficacy in rational arguments.</li>\n<li>or something else that they would have to tell you.</li>\n</ul>\n<p>I suspect that most EA's are being sloppy in their offerings of probabilities and credence levels.  They offer something closer to epistemic status metrics for their own statements, which rely on poor evidence or no evidence, just a feeling, maybe of worry or disappointment at failing other's expectations, or the converse, a high metric corresponding to a poor judgement of the quality of their own work, typically basing that  on other work in EA, unsurprisingly. EA folks choose numbers to emphasize a message to their audience that reflects what they're comfortable sharing, not what they actually believe. There's some real controversy among EA's, but it comes from outside the community, apparently, through people like me.</p>\n<p>So as I said, this whole updating thing has gone wrong in EA. EA as a research community would do better to drop updating and the bayesian kick until they have a better handle on contexts suitable for it. If superforecasting offers those contexts, then great!</p>\n<p>Lets see superforecasters address existential risk with any success. Lets just see them do the research first so they that  have some clear preliminary answers to what the dangers can shape up to be. Presuming that they are not using foresight but forecasting techniques, that should be interesting.</p>\n<p><strong>NOTE:</strong>  Once I learn more about superforecasting, I might constrain my beliefs about how EA's update to exclude superforecasters working in their  successful forecasting domains. I would  do that right now, but I'm suspicious of the superforecaster reputation, so I'll wait until I can learn more.</p>\n", "parentCommentId": "ZQLytdyf9qohGKnwe", "user": {"username": "Noah Scales"}}]