[{"_id": "tQqGS2cjSCnpffxMp", "postedAt": "2024-02-06T16:31:29.195Z", "postId": "JLgMvTsYB8nGwLC8E", "htmlBody": "<p>Thanks for posting, these look super interesting!</p><p>I'm hoping to read (and possibly respond to) more, but I ~randomly started with the final article <a href=\"https://www.law.georgetown.edu/public-policy-journal/in-print/volume-21-special-issue-2023/saving-the-world-starts-at-home/\">\"Saving the World Starts at Home.\"</a>&nbsp;</p><p>My thoughts on this one are mostly critical: I think it fundamentally misunderstands what EA is about (due to relying too heavily on a single book for its conception of EA), and will not be persuasive to many EAs. But it raises a few interesting critiques of EA prioritization at the end.</p><h3>Summary</h3><ul><li><i>The Most Good You Can Do</i> has a list (referred to as \"The List\") of some prototypical EA projects; roughly: \"earn to give, community building, working in government, research, organizing, organ donation.\"<ul><li>Thesis of the piece: \"Building a good home\" should be on The List.</li></ul></li><li>Some reasons it's good to build a good home: having a refuge (physical and psychological safety), showing hospitality to others, raising a family.<ul><li>I was expecting to see discussion of externalities here; perhaps focusing on how creating a good home can boost effectiveness in other altruistic endeavors, or how there are more spillovers to society than might be expected. The latter shows up a bit, but this mostly discusses benefits to the people who physically enter your home.</li></ul></li><li>Traditional EA priorities have been critiqued on the following grounds:<ul><li>Demandingness</li><li>Motivational obstacles / they're psychologically difficult</li><li>Epistemic limits: the world is very complicated</li><li>Ineffectiveness</li><li>Grift</li></ul></li><li>Building a good home is not subject to these criticisms: it's not overly demanding, it's intrinsically motivating (or at least more than traditional EA interventions), it clearly produces direct good outcomes and isn't subject to difficult-to-determine n-th order effects.</li><li>According to Singer, EAs don't need to maximize the good at all times, and don't have to be perfectly impartial. So it's not necessary to discuss whether this is among the most effective interventions in order to argue that this should be an EA priority -- effectively creating <i>some</i> good is enough.<ul><li>(IMO this is simply a misunderstanding of EA, and undermines much of the article.)</li></ul></li><li>Why do EAs ignore this issue? Some suggestions:<ul><li>It's not effective enough to count as an EA priority. (The rest of the article is arguing against this point.)</li><li>Status: It's lower-status than other EA priorities, like donating lots of money to charity or producing interesting research</li><li>It's less amenable to calculation</li><li>EAs have a bias toward \"direct\" rather than \"indirect\" forms of benevolence<ul><li>(This seems in tension with the point from earlier about how reading to your kid produces clear, direct value, in contrast to the unclear and more-prone-to-backfire approach of donating to Oxfam. I also think EAs are <i>super</i> willing to consider indirect benevolence, but I digress.)</li></ul></li><li>Politics: \"Building a home\" is conservative-coded in the US, and EA is left-leaning.</li></ul></li></ul><h3>What I liked best</h3><p>I think the \"status\" and \"politics\" critiques of EA prioritization are useful and probably under-discussed.&nbsp;</p><p>Certain fields (e.g. AI safety research) are often critiqued for being suspiciously interesting / high-status / high-paying, but this makes the case that even donating to GiveWell is a little suspicious in how much status it can buy. (But I think there are likely much more efficient ways to buy status; donating 1% of your income probably buys much more than 1/10 the status you'd get from donating 10%.)</p><p>I also think it's reasonably likely that there are some conservative-coded causes that EAs undervalue for purely political reasons (but I don't have any concrete examples at hand).</p><h3>Critiques</h3><p>There are a few fundamental issues with the analysis that cause this to fail to connect for me.</p><p>(this is a bit scattershot; I tried to narrow it down to a few points to prevent this from being 3x longer)</p><ul><li>It's too anchored on Singer's description of EA in <i>The Most Good You Can Do</i>, rather than the current priorities of the community.<ul><li>A recurring example is \"should you work an extra hour at Starbucks to donate $10 to Oxfam, or spend that hour hosting friends or reading a story to your kid?\"&nbsp;<ul><li>Oxfam is not currently a frequently-recommended charity in EA circles (it's not recommended by <a href=\"https://www.givingwhatwecan.org/donate/organizations\">GWWC</a>, although Singer's org <a href=\"https://www.thelifeyoucansave.org/best-charities/oxfam/\">The Life You Can Save</a> does recommend it).&nbsp;</li><li>I've never heard \"work a low-wage job to give\" advocated as a top EA recommendation, so this isn't a strong point of comparison.</li></ul></li></ul></li><li>It doesn't engage with the typical criteria for EA causes (e.g. the ITN framework), and especially fails to engage with on-the-margin thinking.<ul><li>“Are we to believe that effective altruists think that if we had more bad homes, this would not affect how much people care about the global poor or give to charities? Surely not.”<ul><li>The question of how big this impact is, or how much a marginal increase in \"good homes\" creates a marginal increase in charitable giving (and how that compares to other approaches to increasing donations) is not discussed.</li></ul></li><li>\"If large numbers of people were regularly giving much of their income to charity and donating their kidneys, these activities would not thereby cease being acts of effective altruism. So, home life cannot be excluded from the List simply because many people already do it.\"<ul><li>Neglectedness <i>is</i> a key consideration for determining EA priorities: if there were no shortage of kidney donors, the argument for kidney-donation-as-effective-altruism would indeed be much weaker.</li></ul></li></ul></li><li>Rather than arguing directly that \"building a good home\" has positive externalities on par with the good done by other EA priorities, the main argument seems to be something like \"this is technically compatible with the definition of effective altruism in <i>TMGYCD.</i>\"<ul><li>From the conclusion of section VII: \"Assuming home life is an effective way of [creating] great good for the world, then effective altruists should have no complaint about recommending it as one potential expression of effective altruism. ... [Otherwise,] the effective altruist commits to a very demanding view, one they should state and defend.\"<ul><li>I think this conflates \"demandingness\" (asking people to sacrifice a lot) with \"having a high bar for declaring something an EA intervention.\" For instance, you can recommend only the top 0.01% of charities, but still only ask people to give 10%.</li><li>EAs <i>do </i>state and defend the view that there should be a very high bar for what counts as an EA intervention.</li></ul></li></ul></li></ul>", "parentCommentId": null, "user": {"username": "det"}}]