[{"_id": "4cJhwv6iRc4znzaHG", "postedAt": "2022-08-27T08:49:01.913Z", "postId": "JP5f93QKmGGgGhFiH", "htmlBody": "<p>I’d recommend concepts from <a href=\"https://conceptually.org/\">https://conceptually.org/</a>. Should be short enough for TikTok videos!</p>\n", "parentCommentId": null, "user": {"username": "freedomandutility"}}, {"_id": "EppEQpgettfWxutps", "postedAt": "2022-08-27T09:56:57.713Z", "postId": "JP5f93QKmGGgGhFiH", "htmlBody": "<p>As a fellow ed tech traveller and big fan of Khan Academy, very excited to see this initiative!<br><br>If the goal is to get young learners excited, compelling stories and/or thought experiments can be a good entry point for the format you're thinking of.<br><br>None of this is mutually exclusive:</p><p><br>- The drowning child definitely. Showing you don't need to literally save a drowning child to save lives.</p><p><br>- Related - maybe an overall framing about heroism, how much easier it is to be a hero than it seems. This can be a good narrative thread to get the core points of EA thinking across.</p><p><br>- Something from the point of you of an idealistic young student who is undecided about her career choices, giving her different frames to think through her problem. The 80000 hours concept, how much of your life it represents, how a good career can meaningfully contribute those 80000 towards positive outcomes, possibly the earning to give concept as well (but presented as a complement rather than a substitute).</p><p><br>- On longtermism, I find the thought experiment about living every sentient life at the beginning of What We Owe the Future quite moving and motivating to think about the significance of living a moral life. Also the hypothesis that we could stand at the beginning of history is easiest to get across with a visual format such as video.</p><p><br>-Existential risk I'm less sure of how best to approach it. I have some experience doing online trainings (the target audience was adult professionals) on climate change. Even though they were based on solid data stakeholders found them catastrophist... and yet at the end of it learners loved them and from their verbatim feedback it seemed like they were really fired up and motivated to do something. &nbsp;I'm somewhat confused by this finding, my guess would be you shouldn't wait too long in the video to introduce some kind of hope+actionable plan, it doesn't have to be too specific, but something that doesn't just leave the learner depressed and anxious at the end of it.</p>", "parentCommentId": null, "user": null}, {"_id": "9cFhHhzdp63gwpd7D", "postedAt": "2022-08-27T14:59:09.195Z", "postId": "JP5f93QKmGGgGhFiH", "htmlBody": "<p>Thanks! I'm the author of most of the concepts on Conceptually, and also the founder of <a href=\"https://non-trivial.org/\">Non-trivial</a>. I'll send you an email. :)</p>", "parentCommentId": "4cJhwv6iRc4znzaHG", "user": {"username": "Peter McIntyre"}}, {"_id": "rMCzytdjscGifBaGq", "postedAt": "2022-08-27T15:40:58.880Z", "postId": "JP5f93QKmGGgGhFiH", "htmlBody": "<p>Going very broad, I'd recommend going through the <a href=\"https://forum.effectivealtruism.org/topics/all\">EA Forum Topics Wiki</a> and considering the concepts included there. Similarly, you may look at the posts that make up the <a href=\"https://forum.effectivealtruism.org/handbook\">EA Handbook </a>and look for suitable concepts there.</p>", "parentCommentId": null, "user": {"username": "Darius_Meissner"}}, {"_id": "BLRJxWuLFfP9vbbgY", "postedAt": "2022-08-27T17:33:37.207Z", "postId": "JP5f93QKmGGgGhFiH", "htmlBody": "<p>Techniques for reasoning under uncertainty, like Fermi estimates!</p>\n", "parentCommentId": null, "user": {"username": "AllAmericanBreakfast"}}, {"_id": "FN6kkszk8vTTcGJdT", "postedAt": "2022-08-27T20:37:10.040Z", "postId": "JP5f93QKmGGgGhFiH", "htmlBody": "<p>Neglectedness.</p><p>The prior for deprioritizing the topic they keep hearing about in social media.</p><p>For example, like <a href=\"https://forum.effectivealtruism.org/posts/ZBuNBAjwLFhfpGgzj/announcing-non-trivial-an-ea-learning-platform-for-teenagers?commentId=o4h9ehTzgpcYPqdmK\">this</a></p>", "parentCommentId": null, "user": {"username": "hibukki"}}, {"_id": "C72GzML6PTEYNk7eg", "postedAt": "2022-08-27T20:38:41.203Z", "postId": "JP5f93QKmGGgGhFiH", "htmlBody": "<p>Changing \"is this doing good\" (a yes/no question which invites answers like \"med tech? yeah that's good!\"),</p><p>with \"how much good is this doing?\" or \"can we do 100x as much good with the same effort?\" (which invites comparing different directions)</p>", "parentCommentId": "FN6kkszk8vTTcGJdT", "user": {"username": "hibukki"}}, {"_id": "wSpCCco8eBhdMh78L", "postedAt": "2022-08-27T20:40:09.747Z", "postId": "JP5f93QKmGGgGhFiH", "htmlBody": "<p>\"There is more than one thing that could destroy the world, so before picking one to work on, let's compare them\"</p><p>Because lots of people are worried about the world ending already, I think, and this is the nudge I'd add</p>", "parentCommentId": "FN6kkszk8vTTcGJdT", "user": {"username": "hibukki"}}, {"_id": "LCKTENy2GpwKCrTyw", "postedAt": "2022-08-27T20:44:03.698Z", "postId": "JP5f93QKmGGgGhFiH", "htmlBody": "<p>Ideas which I assume you're not interested in, but I'll post anyway and tell me if I'm wrong:</p><ol><li>Advertising programs like the <a href=\"https://forum.effectivealtruism.org/topics/atlas-fellowship\">Atlas Fellowship</a>.</li><li>Nudging them away from studying at university as a default don't-think-about-it action</li><li>Other generic advice which isn't related to important problems in the world, for example<ol><li>Productivity</li><li>Career</li><li>Decision making</li><li>Mental health</li></ol></li></ol>", "parentCommentId": "FN6kkszk8vTTcGJdT", "user": {"username": "hibukki"}}, {"_id": "KadKictXpYFgLhhHo", "postedAt": "2022-08-27T20:46:38.846Z", "postId": "JP5f93QKmGGgGhFiH", "htmlBody": "<p>Read hpmor (full <a href=\"https://www.lesswrong.com/posts/HL6x8zHo9BkuK3tic/transcript-you-should-read-hpmor\">pitch</a>).</p><p>How I thought of this ( == what I'm actually trying to solve) : The main value people will get is probably from getting into a community, more than what they'd get from a course of a few hours, by far, I expect. Perhaps you have some other idea on how to do this</p>", "parentCommentId": "FN6kkszk8vTTcGJdT", "user": {"username": "hibukki"}}, {"_id": "b9DdeHaEpe6apGint", "postedAt": "2022-08-27T23:06:30.813Z", "postId": "JP5f93QKmGGgGhFiH", "htmlBody": "<p>General information about people in low-HDI countries to humanize them in the eyes of the viewer.</p>\n<p>Similar for animals (except not “humanizing” per se!). Spreading awareness that e.g. pigs act like dogs may be a strong catalyst for caring about animal welfare. Would need to consult an animal welfare activism expert.</p>\n<p>My premise here: it is valuable for EAs to viscerally care about others (in addition to cleverly working toward a future that sounds neat).</p>\n", "parentCommentId": null, "user": {"username": "tae"}}, {"_id": "mzDGLzqhWDEbByAxD", "postedAt": "2022-08-27T23:50:39.969Z", "postId": "JP5f93QKmGGgGhFiH", "htmlBody": "<p>Hello, Hailey. As a big fan and long-time <a href=\"http://www.khanacademy.org/profile/benthamite\">user</a> of Khan Academy, I'm thrilled to see KA express interest in creating EA-related content! I'll send you an email shortly with some thoughts and suggestions.</p>", "parentCommentId": null, "user": {"username": "Pablo_Stafforini"}}, {"_id": "EaoqLEnGjw3c3bds5", "postedAt": "2022-08-28T20:18:00.319Z", "postId": "JP5f93QKmGGgGhFiH", "htmlBody": "<p>Yeah, I support this. Using a tool like <a href=\"https://www.getguesstimate.com/scratchpad\">https://www.getguesstimate.com/scratchpad</a> &nbsp;- free scratchpad &nbsp;that could help late-highschoolers (a) understand that you can make guesses under uncertainty, and how uncertain the result is, and (b) make decisions about their careers using tools. That tool could be demonstrated in a TikTok I reckon.</p>", "parentCommentId": "BLRJxWuLFfP9vbbgY", "user": {"username": "TheOtherHannah"}}, {"_id": "oDdRAHB2nsiJ4jLBD", "postedAt": "2022-09-01T23:23:07.402Z", "postId": "JP5f93QKmGGgGhFiH", "htmlBody": "<p>I love these recommendations, I think a strong storytelling approach like you mentioned will be very powerful! Bookmarking your ideas to keep in mind for for future content :)</p>", "parentCommentId": "EppEQpgettfWxutps", "user": {"username": "Hailey Dickson"}}, {"_id": "MaxCTLnfQedYnhhEN", "postedAt": "2022-09-05T11:19:15.517Z", "postId": "JP5f93QKmGGgGhFiH", "htmlBody": "<p>I'd be happy to help explain how building capacity for responding to abrupt food catastrophes (nuclear winter, volcanic winter, collapse of electricity/industry, etc.) by rapidly increasing food production could help save lives and reduce the chance of civilizational collapse (see <a href=\"https://allfed.info/\">ALLFED - Alliance to Feed the Earth in Disasters</a>)</p>", "parentCommentId": null, "user": {"username": "JuanGarcia"}}, {"_id": "eqZm5SBaLwPisJWyu", "postedAt": "2022-09-08T03:02:37.863Z", "postId": "JP5f93QKmGGgGhFiH", "htmlBody": "<p>Three related ideas:</p><p><a href=\"https://www.cold-takes.com/why-talk-about-10-000-years-from-now/\">The long view</a> -- looking at history from the perspective of someone who has lived for millions or billions of years rather than decades.</p><p><a href=\"https://www.cold-takes.com/this-cant-go-on/\">This Can't Go On</a>  / <a href=\"https://www.overcomingbias.com/2009/09/limits-to-growth.html\">Limits to Growth</a>  -- The economy can't continue to grow at the rate it has for the last several decades for more than 10,000 years. Total compute can't continue to grow at the same rate it has the last several decades for more than 350 years, since the physical limit of the maximum size computer in the observable universe would be reached by then.</p><p><a href=\"https://www.overcomingbias.com/2009/09/this-is-the-dream-time.html\">This is the Dream Time</a>  --  Billions of years from now, if civilization is still around, people will look back on this era of only a few centuries that we are in now as being special and unique.</p>", "parentCommentId": null, "user": {"username": "WilliamKiely"}}, {"_id": "r2zhAm7uX3ZautKi4", "postedAt": "2022-09-09T14:47:43.796Z", "postId": "JP5f93QKmGGgGhFiH", "htmlBody": "<p>The EA Austin group brainstormed some more ideas. In the order they came up:</p><ul><li>How many people could exist in the future?</li><li>Top 10 Ways Humanity Fails To Reach A Star Trek Future</li><li>Anthropomorphic (Existential/Extinction Risks) are Much Greater than Natural Risks</li><li>How Do We Know Bed Nets Work?</li><li><a href=\"https://en.wikipedia.org/wiki/Human_challenge_study\">Human Challenge Trials</a> Explained</li><li>What It's Like To Donate Your Kidney</li><li>What It's Like To Donate Your Bone Marrow</li><li>AI Risk Explained in One Minute</li><li>Hack Your Happiness Scientifically (approaching mediation from a trial and error perspective)</li><li>80,000 Hours in your career -- worth spending 1% of that time choosing a career a career to do good</li><li>Impact matters more than Overhead (when it comes to choosing charities)</li><li>Cultured Meat Could Prevent A Lot of Animal Suffering</li><li>Why worry about \"Suffering-Risks\" -- It'd be very bad if in the future humanity spread some of the bad stuff that happens on Earth today (e.g. extreme animal suffering) across the universe.</li><li>Explainer videos on e.g. Vitamin A supplementation, deworming, bed bets as malaria prevention, other GiveWell recommended charities</li><li>Steelman arguments you disagree with (<a href=\"https://www.lesswrong.com/tag/steelmanning\">Steelmanning</a> explained)</li><li>5 Things More Dangerous Than Donating A Kidney</li><li><a href=\"https://mhollyelmoreblog.wordpress.com/2016/08/26/we-are-in-triage-every-second-of-every-day/\">We are in triage every second of every day</a></li><li>Opportunity cost - explained (one of the most important concepts in economics)</li></ul>", "parentCommentId": null, "user": {"username": "WilliamKiely"}}, {"_id": "JmkzFyorEENorTjB5", "postedAt": "2022-09-30T13:30:21.034Z", "postId": "JP5f93QKmGGgGhFiH", "htmlBody": "<p>I like the low-HDI country idea, I've been really taken with something I can't find which gives you a random person and facts about that person [kids, religion, etc], weighted by actual probabilities.</p>", "parentCommentId": "b9DdeHaEpe6apGint", "user": {"username": "ChanaMessinger"}}, {"_id": "gyGuZZzn24mGvZefi", "postedAt": "2022-09-30T13:36:22.002Z", "postId": "JP5f93QKmGGgGhFiH", "htmlBody": "<p>Woah, love a bunch of these! Especially \"How Do We Know Bed Nets Work?\"</p>", "parentCommentId": "r2zhAm7uX3ZautKi4", "user": {"username": "ChanaMessinger"}}]