[{"_id": "24yeyLRLyTnZ8CdWe", "postedAt": "2018-06-14T11:41:53.955Z", "postId": "Jp5Gs9nsRA6pzBeQN", "htmlBody": "<p>I think it depends somewhat on the concept of giving effectively.  Whilst i think it can be argued that people could give more effectively by shifting their giving from animal shelters to farmed animal advocacy, it depends somewhat on precision.  For people who are already donating to animal organisations which aren't shelters then it isn't necessarily better to give to &quot;effective&quot; organisations as put forward by ACE because there aren't sufficient comparisons that can be made between organisations they are already supporting, and there is also the issue of further marginalising organisations which aren't deemed a more mainstream fit (something which seems somewhat at odds with effective altruism). </p>\n<p>As an example, I continue to wonder why someone would necessarily believe it is better to give to GFI over an organisation doing pluralistic work in the animal movement?  One is well supported by various foundations and is far from underconsidered or neglected, whilst others that work on more meta level questions of plurality and inclusivity tend to be marginalised, particularly through not reflecting a favoured &quot;mainstream&quot; ideology.  Another issue is that ACE doesn't account for moral theory in relation to rights or utilitarianism thus largely presenting a fairly unfortunate picture in the animal movement in terms of utilitarian = effective and rights = ineffective.  This isn't something which would be reflective of effective altruism.  (I'm aware that NHRP is a &quot;standout&quot; charity and could be seen as an exception, yet their legal work is fairly separate from the more mainstream charities that work within / tend to reify speciesism in various ways).</p>\n<p>As a general matter at least some of my time is spent on social media informing people of the reasons why they ought to be sceptical of &quot;top charity&quot; recommendations when they have shared them from ACE, because non-EAs sometimes have a tendency to accept them at face value because they haven't particularly looked into the issues or wondered about ACE reasoning or process.  However, the same can also be said of many EAs who likely somewhat give to ACE on the basis of its EA association.  I support the idea of evaluation by ACE but i'm sceptical that the claims that ACE tend to make sufficiently reflect the work that has taken place, or that there is enough transparency in terms of the underlying values and beliefs that ACE tend to represent.  I continue to believe that some form of external meta-evaluation would be useful for ACE in order to thoroughly consider this type of issue, whilst donation matching and the sharing of cute animals could form a part of that.</p>\n", "parentCommentId": null, "user": {"username": "KevinWatkinson"}}, {"_id": "mWzWK5Ru5uTRc74nA", "postedAt": "2018-06-14T16:33:36.193Z", "postId": "Jp5Gs9nsRA6pzBeQN", "htmlBody": "<blockquote>\n<p>Anecdotally, we’ve found that our matching campaigns have brought in a disproportionately large number of new donors—the majority of whom were not previously involved with effective giving. [...] we were able to teach them about effective animal advocacy and to support them in effective giving elsewhere in the EA movement. The amount that these donors will give to effective charities during their lifetime is significantly higher than the donation-matching campaign that attracted them; we continue to build relationships with these new donors.</p>\n</blockquote>\n<p>I think this might be a key part that merits more explication. I can think of two major objections that evidence here would help answer:</p>\n<p>1) The consequentialist benefit of 'standard' marketing techniques isn't worth the deontological cost.</p>\n<p>2) 'Standard' marketing techniques are self-defeating for EA. This relies upon a belief that those that are put off by the utilon approach and attracted by the fuzzy approach are unlikely to 'assimilate' into EA.</p>\n<p>Can you share more information on the number of new donors and particularly their subsequent engagement with EA? Or, if you can't or aren't ready to share that data, can you at least attest that you're tracking it and working on it?</p>\n", "parentCommentId": null, "user": {"username": "cole_haus"}}, {"_id": "piTGQ6cocAvnreumf", "postedAt": "2018-06-14T17:39:25.011Z", "postId": "Jp5Gs9nsRA6pzBeQN", "htmlBody": "<blockquote>\n<p>we had a donor who would not otherwise have given to our Recommended Charity Fund</p>\n</blockquote>\n<p>Do you know anything else about what they would have done with the money otherwise, aside from that it wouldn't have gone to this particular fund?</p>\n", "parentCommentId": null, "user": {"username": "Jeff_Kaufman"}}, {"_id": "jWPy2yPpwQhujqoRq", "postedAt": "2018-06-15T06:38:18.894Z", "postId": "Jp5Gs9nsRA6pzBeQN", "htmlBody": "<p>Really appreciate you putting out your honest thinking behind the way you market recommended charities to people not involved in EA. </p>\n<p>My amateur sense is that ACE is now striking the right balance between factual correctness and appeal/accessibility. My worry in the past was that ACE staff members were allowing image considerations to seep into the actual analyis that they were doing (sidenote: I’d be interested to what extent ACE now uses Bayesian reasoning in their estimates, e.g. by adjusting impact by how likely small sample studies are false positives). </p>\n<p>When someone is already committed to EA, it tends to become difficult for them to imagine what got them originally excited about effectiveness in helping others and what might motivate new people who are not part of the ‘early adopter crowd’. There is a reason why EA pitches to newcomers also tend to be simple, snappy and focus on one ‘identifiable victim’ before expanding across populations, probabilities and time (my point being that these principles also apply to ACE’s outreach). You cannot expect people to relate to abstract analysis and take action if they have not bridged that gap yet.</p>\n<p>However, I hope that ACE’s stance on matching donations will cause other organisations in the effective animal advocacy community to follow their lead. The newsletter by Good Food Institute in December 2017 also had a misleading header saying ‘Twice your impact’. This is an easy thing to slip into when you are focused on raising money. </p>\n<p><em>This was ACE’s marketing material that originally mentioned ‘double your impact’:</em>\n<a href=\"https://animalcharityevaluators.org/blog/updated-charity-recommendations-december-2017/\">https://animalcharityevaluators.org/blog/updated-charity-recommendations-december-2017/</a></p>\n<p>I heard this might have been a mistake by less experienced communication staff members as ACE is usually more careful (though it was concerning that outsiders had to mention it to someone working for ACE to start internal Slack discussions). You can find Marianne and I’s original conversation on that below, which we passed on to ACE:</p>\n<blockquote>\n<p>Marianne van der Werf: Animal Charity Evaluators has released their new charity recommendations!</p>\n</blockquote>\n<blockquote>\n<p>Updated Charity Recommendations: &gt;December 2017 | Animal Charity Evaluators\nACE updates our recommendations each year by December 1. This year, we are publishing our recommendations a few days early in order to have our most…\nANIMALCHARITYEVALUATORS.ORG</p>\n</blockquote>\n<blockquote>\n<p>Remmelt Ellen: This statement is intellectually dishonest.🙁\n&quot;A generous donor will match donations to ACE’s Recommended Charity Fund, starting today.\nDONATE TO THE RECOMMENDED CHARITY FUND\nThis means that you can double the impact of your donation from now through the end of the year by donating to our Recommended Charity Fund. We will distribute all of the funds raised through the end of the year to our recommended charities in January. You can find more details about the Fund, including how donations will be divided among charities, here.&quot;</p>\n</blockquote>\n<blockquote>\n<p>Remmelt Ellen: <a href=\"http://benjaminrosshoffman.com/matching-donation-fundraisers-can-be-harmfully-dishonest/\">http://benjaminrosshoffman.com/matching-donation-fundraisers-can-be-harmfully-dishonest/</a></p>\n</blockquote>\n<blockquote>\n<p>Remmelt Ellen: I'm not happy with the way they've stated that. It doesn't make me feel as confident that they've shifted their marketing-orientation to more rigour.</p>\n</blockquote>\n<blockquote>\n<p>Remmelt Ellen: Mind you, I'd still recommend donating to one of their recommended charities if you want to donate to prevent factory farming.</p>\n</blockquote>\n<blockquote>\n<p>Marianne van der Werf: In general that's a good point, but in the case of ACE they're aware of the dishonesty of donation drives and make a point of only doing them when the money is not going to be donated anyway. <a href=\"https://animalcharityevaluators.org/about/background/faq/\">https://animalcharityevaluators.org/about/background/faq/</a> </p>\n</blockquote>\n<blockquote>\n<p>Marianne van der Werf ACE should probably mention it in their posts sometimes, because last year people thought less of ACE because of this as well.</p>\n</blockquote>\n<blockquote>\n<p>Remmelt Ellen: Hmm, but even in this case 'double your impact' is a disingenuous claim to make. That donor would have made a donation to a charity anyway, and probably one in the factory farming space. </p>\n</blockquote>\n<blockquote>\n<p>Therefore counterfactually-speaking, you can say that the donor probably wouldn't have donated to the recommended charity fund otherwise, not that another donor has doubled their impact.</p>\n</blockquote>\n<blockquote>\n<p>Remmelt Ellen: &quot;You're donation is being matched –&gt; you've just doubled your impact&quot; is a bold claim to make that's almost impossible to live up to – especially when done by a charity evaluator that should know better.</p>\n</blockquote>\n<blockquote>\n<p>Remmelt Ellen: More on coordination matching and influence matching: <a href=\"https://blog.givewell.org/2011/12/15/why-you-shouldnt-let-donation-matching-affect-your-giving/\">https://blog.givewell.org/2011/12/15/why-you-shouldnt-let-donation-matching-affect-your-giving/</a></p>\n</blockquote>\n<blockquote>\n<p>Marianne van der Werf: Good points Remmelt, you should share this conversation with ACE or ask them about their messaging in their upcoming Reddit AMA. I agree that the doubling your impact claim is overly simplistic. It would have been more accurate to just talk about doubling the donations and have people draw their own conclusions about how it influences their impact, because that also depends on people's personal values.</p>\n</blockquote>\n", "parentCommentId": null, "user": {"username": "remmelt"}}, {"_id": "btekb46Hpxh2xb322", "postedAt": "2018-06-15T19:49:43.434Z", "postId": "Jp5Gs9nsRA6pzBeQN", "htmlBody": "<p>I think ACE is acting responsibly. These criticisms strike me as off, particularly the one involving cute/fuzzy animals. I think some in EA are put off by the use of emotions as a tactic, and that's going to lead us to a completely warped picture of human behavior and a correspondingly warped approach to changing it.</p>\n", "parentCommentId": null, "user": {"username": "zdgroff"}}, {"_id": "EkmCBnj5gPfG2C8ej", "postedAt": "2018-06-16T10:29:44.310Z", "postId": "Jp5Gs9nsRA6pzBeQN", "htmlBody": "<p>Regarding #2: The direct goal of EA is to do the most good, not to grow the community of people that identify with EA as much as possible. The latter is a means to the end. If their current approach directs a lot of money from non-EA animal lovers to effective charities, then that does a lot of good regardless of whether said animal lovers then assimilate into EA. Furthermore, I don't think people who like the utilon approach are necessarily turned away just because there is a cute animal picture present. So long as the cute animal picture is merely a hook and not the main message, then there seems little to no harm to people who are likely receptive to the EA message, while being highly beneficial for non-EA animal lovers. I'm not seeing this as a likely downside...</p>\n", "parentCommentId": "mWzWK5Ru5uTRc74nA", "user": {"username": "MvdSteeg"}}, {"_id": "Bn9wTCnP6Kf6R5a3a", "postedAt": "2018-06-19T20:02:46.793Z", "postId": "Jp5Gs9nsRA6pzBeQN", "htmlBody": "<p>This donor is a major general animal welfare donor, and had the ~$600k they gave to the Recommended Charity Fund not occurred, they likely would have given it to other non-EAA animal charities, or they may have just left the money in their foundation for future donations.</p>\n<p>While they do support some of our Top Charities and Standout Charities, we do not think it likely that the counterfactual ~$600k would have been donated to any of those Recommended Charities. Also, the ~$600k is in addition to their normal donations to our Recommended Charities.</p>\n", "parentCommentId": "piTGQ6cocAvnreumf", "user": {"username": "EricHerboso"}}, {"_id": "rTyF2gazcXs48j6cK", "postedAt": "2018-06-19T21:59:52.264Z", "postId": "Jp5Gs9nsRA6pzBeQN", "htmlBody": "<p>We had on the order of hundreds of new donors during our 2017 matching campaign, making up 56% of the pre-matched amount raised. A very large portion of these donors are new to effective giving, as most come from the AR space.</p>\n<p>We track donor engagement with EAA directly through retention and surveys, and we have limited indirect tracking of engagement with EA more generally. (Concerns about privacy (and GDPR) prevent us from tracking more deeply, such as through social media engagement.)</p>\n<p>We also actively advocate EAA and EA ideas to these donors via email and other messaging.</p>\n", "parentCommentId": "mWzWK5Ru5uTRc74nA", "user": {"username": "EricHerboso"}}, {"_id": "ayNiwasqAeQ8Bg3yx", "postedAt": "2018-06-19T22:26:19.776Z", "postId": "Jp5Gs9nsRA6pzBeQN", "htmlBody": "<blockquote>\n<p>sidenote: I’d be interested to what extent ACE now uses Bayesian reasoning in their estimates, e.g. by adjusting impact by how likely small sample studies are false positives.</p>\n</blockquote>\n<p><a href=\"https://animalcharityevaluators.org/research/methodology/our-use-of-cost-effectiveness-estimates/#3.4.3\">Our current methodology</a> uses an alternative approach of treating cost-effectiveness estimates as only one input into our decisions. We then take care to &quot;<a href=\"https://www.lesswrong.com/posts/5JDkW4MYXit2CquLs/your-strength-as-a-rationalist\">notice when we are confused</a>&quot; by remaining aware that if a cost-effectiveness estimate is much higher than we would expect based on the other things we know about an intervention or charity, that may be due to an error in our estimate rather than to truly exceptional cost effectiveness.</p>\n<p>We admit that Bayesian techniques would more accurately adjust for uncertainty, but this  would require additional work in developing appropriate priors for each reference class, and this process <a href=\"https://www.lesswrong.com/posts/5gQLrJr2yhPzMCcni/the-optimizer-s-curse-and-how-to-beat-it\">may not generate worthwhile differences in our evaluations, given our data set</a>. See <a href=\"https://animalcharityevaluators.org/research/methodology/our-use-of-cost-effectiveness-estimates/#3.4.3\">this section of our Cost-Effectiveness Estimates page</a> for details on our thinking about this.</p>\n", "parentCommentId": "jWPy2yPpwQhujqoRq", "user": {"username": "EricHerboso"}}, {"_id": "MaSaYRaRFsA63FKWZ", "postedAt": "2018-06-19T23:20:45.255Z", "postId": "Jp5Gs9nsRA6pzBeQN", "htmlBody": "<p>You raise a number of points; I’ll try to respond to each of them.</p>\n<blockquote>\n<p>For people who are already donating to animal organisations which aren't shelters then it isn't necessarily better to give to &quot;effective&quot; organisations as put forward by ACE because there aren't sufficient comparisons that can be made between organisations they are already supporting.</p>\n</blockquote>\n<p>We do not believe this is true. We explicitly rank our top charities as being better targets for effective giving than our standout charities, and we explicitly rank our standout charities as better targets than organizations not on our Recommended Charity list.</p>\n<p>This doesn’t mean that more effective EAA charities necessarily don’t exist. We’re currently expanding our focus to several organizations across the world to which we hadn’t previously looked. (There's still time to <a href=\"https://animalcharityevaluators.org/about/contact-us/\">submit charities for review</a> in 2018.) There are also <a href=\"https://animalcharityevaluators.org/charity-reviews/all-charity-reviews/\">some charities that we were not able to evaluate</a> last year for one reason or another. These charities may or may perform better than our current Top Charities. We encourage you to <a href=\"https://animalcharityevaluators.org/charity-reviews/evaluating-charities/\">learn more about how we evaluate charities</a>.</p>\n<blockquote>\n<p>As an example, I continue to wonder why someone would necessarily believe it is better to give to GFI over an organisation doing pluralistic work in the animal movement? One is well supported by various foundations and is far from underconsidered or neglected, whilst others that work on more meta level questions of plurality and inclusivity tend to be marginalised, particularly through not reflecting a favoured &quot;mainstream&quot; ideology.</p>\n</blockquote>\n<p><a href=\"https://animalcharityevaluators.org/charity-review/the-good-food-institute/#comprehensive-review\">GFI rates well on all of our criteria</a>. If you want to compare them to another group doing pluralistic work, then you’d need to directly compare our reviews of each organization. Alternatively, you are free to perform your own analysis to compare relative potential effectiveness; if performed well, such analyses could then be used in future reviews by ACE.</p>\n<p>Keep in mind that we explicitly believe a pluralistic approach is best overall. It's just that individual charities working on pluralistic approaches may have wildly different levels of effectiveness, and, given limited resources, we should prioritize whatever results in the most good.</p>\n<blockquote>\n<p>Another issue is that ACE doesn't account for moral theory in relation to rights or utilitarianism thus largely presenting a fairly unfortunate picture in the animal movement in terms of utilitarian = effective and rights = ineffective.</p>\n</blockquote>\n<p>We are quite transparent about the <a href=\"https://animalcharityevaluators.org/about/background/our-philosophy/\">philosophical foundations of our work</a>. We explicitly maintain that the most effective approach is probably a pluralistic one, and we hope that a diverse group of animal charities will continue pursuing a wide range of interventions to help all populations of animals. However, we will continue to recommend that marginal resources support the most effective tactics.</p>\n<p>This is not an issue of rights vs utility. Whether you believe in rights or in utility, presumably you would want to do twice as much good with limited resources if you get the chance.</p>\n<p>(A quick aside on deontology vs consequentialism as it relates to cause prioritization: Let's say you're a deontologist who believes murder is wrong. You're given a coupon that you can redeem at one of two locations. If you redeem at the first, you prevent a murder. If you redeem at the second, you prevent two murders. Can you honestly say that, even as a deontologist, you wouldn't prefer to redeem at the second location?)</p>\n<p>The suffering of all animals is important, whether those animals are companion animals, animals in a lab, animals used in entertainment, or farmed animals. But when you have limited resources, you should prioritize helping those animals for which you can effectively reduce suffering. This is true whether you're talking about a rights organization or a utilitarian organization (to use your terminology).</p>\n<blockquote>\n<p> I support the idea of evaluation by ACE but i'm sceptical that the claims that ACE tend to make sufficiently reflect the work that has taken place, or that there is enough transparency in terms of the underlying values and beliefs that ACE tend to represent. I continue to believe that some form of external meta-evaluation would be useful for ACE.</p>\n</blockquote>\n<p>If there are specific claims that you believe do not reflect the work that we do, you are always welcome to <a href=\"https://animalcharityevaluators.org/about/contact-us/\">give feedback</a>. We also strive to be <a href=\"https://animalcharityevaluators.org/transparency/\">as transparent as possible in everything that we do</a>. With regard to outside evaluation, we have <a href=\"https://animalcharityevaluators.org/blog/research-review-process-call-for-external-reviewers/\">explicitly asked for external reviewers</a> and have <a href=\"https://animalcharityevaluators.org/about/contributors/external-reviewers/\">a public list of external reviewers</a> on our site.</p>\n<p>I hope that these responses help to alleviate some of your concerns.</p>\n", "parentCommentId": "24yeyLRLyTnZ8CdWe", "user": {"username": "EricHerboso"}}, {"_id": "AaZkdZ4mzyQoCv2LP", "postedAt": "2018-06-22T01:11:45.701Z", "postId": "Jp5Gs9nsRA6pzBeQN", "htmlBody": "<blockquote>\n<p>they likely would have given it to other non-EAA animal charities</p>\n</blockquote>\n<p>Thanks!  It sounds like how counterfactual to consider this match is depends a lot on how much better you think ACE's Recommended Charities are than the sorts of charities this funder tends to support.  Which I'm guessing isn't public information?</p>\n<blockquote>\n<p>just left the money in their foundation for future donations</p>\n</blockquote>\n<p>This is also important for assessing counterfactual impact, and is probably not something the funder knows either.  If it would go to an ACE Recommended Charity in 2018 instead of 2017 that's pretty different than if it (a) wouldn't get donated for a long time or (b) would go to a much less valuable charity (see previous paragraph).</p>\n<p>Overall, I think when an EA organization describes a match they offer as counterfactually valid they should link to details describing how they're reasoning that.  For example &quot;funder wouldn't otherwise donate to any ACE recommended charity this year&quot;, &quot;funder would otherwise donate to GiveWell's recommendations&quot;, or &quot;funder would otherwise spend the money on a yacht&quot;.</p>\n", "parentCommentId": "Bn9wTCnP6Kf6R5a3a", "user": {"username": "Jeff_Kaufman"}}]