[{"_id": "X2eoHmANPaZ9NeyMT", "postedAt": "2018-06-11T18:16:31.677Z", "postId": "JPtptap3cdvXRq2BY", "htmlBody": "<blockquote>\n<p>There is a significant gap in effective altruism for structural change in between “buy bed nets” and “literally build God”.</p>\n</blockquote>\n<p>[Laughing crying face]</p>\n<p>[Not because I'm crying with laughter, but because I'm laughing and crying at the same time]</p>\n", "parentCommentId": null, "user": null}, {"_id": "cHqR8g8HLnRgZuc75", "postedAt": "2018-06-11T18:26:58.326Z", "postId": "JPtptap3cdvXRq2BY", "htmlBody": "<p>Evan, just a data point: I don't understand a lot of what you're saying in most of your posts/comments, and I can only think of one person I find more difficult to understand out of everyone I've come across in the EA community who I've really wanted to understand. (By which I mean &quot;I find the way you speak confusing and I often don't know what you mean&quot;, not &quot;Boi, you crazy&quot;.)</p>\n", "parentCommentId": null, "user": null}, {"_id": "cuzEpbGHvHo9nrWDP", "postedAt": "2018-06-12T00:03:11.130Z", "postId": "JPtptap3cdvXRq2BY", "htmlBody": "<p>Thanks. Are you referring to my posts and comments on social media? That's more transient, so I make less of an effort on social media to be legible to everyone. Do you have examples of the posts or comments of mine you mean? I don't get tons of feedback on this. Of course people tell me I'm often confusing. But the feedback isn't actionable. I can decode any posts you send me. For example, here is a <a href=\"http://effective-altruism.com/ea/1oc/volunteer_opportunities_in_effective_altruism/\">post of mine</a> where I haven't gotten any negative feedback on the content or writing style. This post was like a cross between a personal essay and dense cause prioritization discussion, so it's something I wouldn't usually post to the EA Forum. It's gotten some downvotes, but clearly more upvotes than downvotes, so somebody is finding it useful. Again, if I get some downvotes it's ultimately feedback on what does or doesn't work on the EA Forum. This is the kind of clearer feedback specifying something. </p>\n", "parentCommentId": "cHqR8g8HLnRgZuc75", "user": {"username": "Evan_Gaensbauer"}}, {"_id": "9E4GZiX8e4PncYZiN", "postedAt": "2018-06-12T00:51:30.937Z", "postId": "JPtptap3cdvXRq2BY", "htmlBody": "<p>I also have some posts I've taken more time to edit for clarity on my personal blog about <a href=\"https://ideasyncretic.wordpress.com/tag/effective-altruism/\">effective altruism</a>. </p>\n", "parentCommentId": "cHqR8g8HLnRgZuc75", "user": {"username": "Evan_Gaensbauer"}}, {"_id": "vnDsWs8eurkZZqYYw", "postedAt": "2018-06-12T10:39:10.865Z", "postId": "JPtptap3cdvXRq2BY", "htmlBody": "<p>I don't want to spend too long on this, so to take the most available example (i.e. treat this more as representative than an extreme example): Your summary at the top of this post.</p>\n<ul>\n<li>General point: I get it now but I had to re-read a few times.</li>\n<li>I think the old &quot;you're using long words&quot; is a part of this, which is common in EA and non-colloquial terms are often worth the price of reduced accessibility, but you seem to do this more than most (e.g. &quot;posit how&quot; could be &quot;suggest that&quot;/&quot;explore how&quot;, &quot;heretofore&quot; could be &quot;thus far&quot;, &quot;delineate&quot; could be &quot;identify&quot;/&quot;trace&quot; etc....it's not that I don't recognise these words, they're just less familiar and so make reading more effort).</li>\n<li>Perhaps long sentences with frequent subordinate clauses - and I note the irony of my using that term - and, indeed, the irony of adding a couple here - add to the density.</li>\n<li>More paragraphs, subheadings, italics, proofing etc. might help a bit.</li>\n</ul>\n<p>I also have the general sense that you use <em>too many</em> words - your comments and posts are usually long but don't seem to be saying enough to justify the length. I am reminded of Orwell:</p>\n<blockquote>\n<p>It is easier — even quicker, once you have the habit — to say &quot;In my opinion it is not an unjustifiable assumption that&quot; than to say &quot;I think&quot;.</p>\n</blockquote>\n<p>And yes - mostly on social media. But starting to read this post prompted the comment (I feel like you have useful stuff to say so was surprised to not see many upvotes and wondered if it's because others find you hard to follow too).</p>\n", "parentCommentId": "cuzEpbGHvHo9nrWDP", "user": null}, {"_id": "bx3tembSCtkgRtkJD", "postedAt": "2018-06-12T10:42:08.594Z", "postId": "JPtptap3cdvXRq2BY", "htmlBody": "<p>Thanks. Data point: the summary at the top of &quot;Crucial Considerations for Terraforming as an S-Risk&quot; seems like a normal level of hard-to-read-ness for EA.</p>\n", "parentCommentId": "9E4GZiX8e4PncYZiN", "user": null}, {"_id": "erFRbPWv48bR6oapN", "postedAt": "2018-06-12T10:49:24.402Z", "postId": "JPtptap3cdvXRq2BY", "htmlBody": "<p>Also the dank memes stuff...at the meta level of treating it like valuable, serious stuff... This is a separate thing as it's a case of me thinking, &quot;Surely they're still joking...but it really sounds like they're not,&quot; but it's another reason for me to give up on trying to understand you because it's too much effort.</p>\n", "parentCommentId": "cuzEpbGHvHo9nrWDP", "user": null}, {"_id": "izgM9XPX8RJzX22io", "postedAt": "2018-06-13T18:47:36.279Z", "postId": "JPtptap3cdvXRq2BY", "htmlBody": "<p>The summary wasn't supposed to be easier to be read. It was a condensed version so those who are already familiar with the concept would be aware of where the post was going. It was primarily intended for those effective altruists who are already (quite) familiar with risks of astronomical suffering; and the research of Brian Tomasik and the Foundational Research Institute. </p>\n", "parentCommentId": "bx3tembSCtkgRtkJD", "user": {"username": "Evan_Gaensbauer"}}, {"_id": "8siQhs4xuqP3qTnji", "postedAt": "2018-06-17T18:17:13.077Z", "postId": "JPtptap3cdvXRq2BY", "htmlBody": "<p>One heuristic I use for writing is to try <a href=\"http://paulgraham.com/talk.html\">Writing Like I Talk</a> from Paul Graham. Of course, I already tend to speak differently than most people. I find keeping my head in books changes how I think internally, and thus how I speak. It comes full circle when I write like I talk, which is different than most people talk or write. The perfect is the enemy of the good, and there are trade-offs in time taken to write. Another is to know your audience. The post in question was meant to be read by suffering reducers and those familiar with the work on the Foundational Research Institute, from whom I've already received good feedback from, so I relatively achieved my goal with my writing. Also, those posts are rougher on my personal blog, but I would edit them before I put them up on the EA Forum.</p>\n<p>As long as it takes to read my stuff, I use a lot of words because it provides full context. For example, I'd hope someone familiar with academic jargon but relatively new to EA might come to fully understand the case of potential s-risks from terraforming, having come in knowing little to nothing about the subject. I'm aware I often use too many words, but when the time comes to make posts more accessible, I can and will do so. I appreciate this feedback though. Please feel free to provide feedback anytime. I update on it quite quickly, even from a single person. I wish more people felt comfortable doing so. </p>\n<p>I wrote this post up because it will tie into a series of blog posts I'll be rolling out. When it's done, in context, I hope this post will make more sense. I'm going to be working with various EA organizations to bring <a href=\"http://effective-altruism.com/ea/1oc/remote_volunteering_opportunities_in_effective/\">remote volunteering opportunities</a> to local EA groups to do <a href=\"http://effective-altruism.com/ea/1ow/why_groups_should_consider_direct_work/\">direct work</a>. I'm going to consult with Rethink Charity's research team to tighten up a model I have for coordinating teams together numbering in potentially hundreds of individuals. Soon time too may be a unit of caring.</p>\n", "parentCommentId": "vnDsWs8eurkZZqYYw", "user": {"username": "Evan_Gaensbauer"}}, {"_id": "qw4jNjkQwbaMwawP2", "postedAt": "2018-07-04T17:00:44.912Z", "postId": "JPtptap3cdvXRq2BY", "htmlBody": "<blockquote>\n<p>The perfect is the enemy of the good, and there are trade-offs in time taken to write. Another is to know your audience. </p>\n</blockquote>\n<p>Of course. My comment was an offer of a data point, not a judgment that you're prioritising badly.</p>\n<blockquote>\n<p>I'm going to be working with various EA organizations to bring remote volunteering opportunities to local EA groups to do direct work.</p>\n</blockquote>\n<p>Have you chatted to <a href=\"https://davidfurlong.github.io\">David Furlong</a> of Deedmob?</p>\n", "parentCommentId": "8siQhs4xuqP3qTnji", "user": null}, {"_id": "q9ZEENm93npTPHyyq", "postedAt": "2018-07-04T17:04:21.641Z", "postId": "JPtptap3cdvXRq2BY", "htmlBody": "<blockquote>\n<p>The summary wasn't supposed to be easier to be read.</p>\n</blockquote>\n<p>I was saying that it <em>was</em> easier to read ;-) You seemed to be asking for feedback on posts that you've &quot;taken more time to edit for clarity&quot;.</p>\n<p>Although I should say that I am &quot;already (quite) familiar with risks of astronomical suffering; and the research of Brian Tomasik and the Foundational Research Institute&quot;.</p>\n", "parentCommentId": "izgM9XPX8RJzX22io", "user": null}, {"_id": "6cTZftMxpZDsyNCyL", "postedAt": "2018-07-04T22:47:19.306Z", "postId": "JPtptap3cdvXRq2BY", "htmlBody": "<p>Oh, I see, the summary was the standard level of difficulty. That makes sense. One thing is when responding to Brian and others for whom the info in my post isn't new, I might be assuming some background context I left out because I assumed it was common knowledge. My post as is might be too condensed. To unpack an essay already so long seems daunting :/</p>\n", "parentCommentId": "q9ZEENm93npTPHyyq", "user": {"username": "Evan_Gaensbauer"}}]