[{"_id": "Wxqit3Hn2Zse2b5oQ", "postedAt": "2014-10-10T20:35:30.044Z", "postId": "JrtgQMxEcJDRZCg2r", "htmlBody": "<p>I found this post interesting but ultimately a bit confusing. You claim that having a plan is very important, and point to people with plans, but I don't see real arguments for why it's good to have a plan, or a discussion of the upsides and downsides.</p>\n<p>I wonder if you could clarify your view on some of these points?</p>\n", "parentCommentId": null, "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "bKggozwi45tPN6ATb", "postedAt": "2014-10-10T21:01:23.343Z", "postId": "JrtgQMxEcJDRZCg2r", "htmlBody": "<p>I'll clarify some more on upsides and downsides on the next post.</p>\n<p>Here I intended to show the need by induction, that is, by showing many examples of people with plans who created interesting features of the movement, and let those who agree there is causation involved follow through. That is why the second section starts with a conditional &quot;If&quot;. Only if you accept the stories as good evidence for points 1 and 2 you'd be urged to make plans. </p>\n<p>Seems that you'd prefer a proof by principles or by deduction, which you described as &quot;real arguments&quot;. I could indicate books about planning, but I feel that would betray my purpose. Showing examples and providing a template seem to me as real and easy as it gets. Most people are not motivated by abstract convoluted reasons, they are motivated by stories, only once they are motivated it makes sense on a gut level to plan. </p>\n<p>I'm curious however about what sort of writing would entice you into making plans? Knowing what makes you tick I can try to cover more territory on the next post, since I don't want to leave behind those whose motivational structure works like yours. </p>\n", "parentCommentId": "Wxqit3Hn2Zse2b5oQ", "user": {"username": "Diego_Caleiro"}}, {"_id": "TeswDLyiaMCBTR8fq", "postedAt": "2014-10-11T18:55:05.054Z", "postId": "JrtgQMxEcJDRZCg2r", "htmlBody": "<p>I found this useful. I already believe that plans are important, but going through your plan made me realize some useful tactics (&quot;Have someone else understand the importance of this in case I die&quot;). </p>\n<p>I suspect that to convince people that plans are useful you will need to address the broader philosophical systems that make one believe that plans are or are not useful. These systems seem to hinge on the questions: 1) Can we control the future? 2) Can we predict the future? 3) Do we need to predict the future to shape it? This view is broader than Thiel's 2x2 matrix. <a href=\"www.effectuation.org\">Effectuation</a> claims that you can control the future and thus don't need to predict. Fail faster startup mentality (Lean Startup?) claims that you can predict to a limited extent. Nicholas Nassim Taleb claims that you don't need to predict and you can't, but you can play the odds by becoming antifragile.</p>\n<p>A naive view of plans sees them as fixed. I suspect you need to address this as well and argue why Eisenhower was wrong when he said &quot;Plans are worthless, but planning is everything&quot;. I further think you need to address Tempo.</p>\n", "parentCommentId": null, "user": {"username": "Vasco_Queiros"}}, {"_id": "vyZkW8qRA3C8PqKLu", "postedAt": "2014-10-14T17:12:12.956Z", "postId": "JrtgQMxEcJDRZCg2r", "htmlBody": "<p>WRT indefinite vs definite futures: You should be doing both. We often review inside view and outside view for mealsquares. Outside view we try to position ourselves as well as possible given the successes and failures of other similar companies. Inside view we make concrete plans and execute on them believing they will work.</p>\n", "parentCommentId": null, "user": {"username": "RomeoStevens"}}, {"_id": "KLF3vuo3WqgXHHNWQ", "postedAt": "2014-10-16T17:30:22.282Z", "postId": "JrtgQMxEcJDRZCg2r", "htmlBody": "<p>Sorry for the slow reply! I think the change to the name of the post is good.</p>\n<p>I guess when giving stories about people with plans, I'd like to hear more about how the plans helped them. The main takeaway I had from your stories was &quot;Geoff Anders' plan helped him to persuade other people to work with him&quot;. But I don't get the impression that you're claiming the main benefit of a plan is to be able to get others on board.</p>\n<p>I also feel that planning is a question of degree. It's obvious that some thought about the future is useful. It's also obvious that you don't want to spend 100% of your time planning minutae. So I kind of wanted to see discussion of the advantages and disadvantages of planning more, and claims about where the sweet spot was, and why people tend to get it wrong (if they do).</p>\n", "parentCommentId": "bKggozwi45tPN6ATb", "user": {"username": "Owen_Cotton-Barratt"}}]