[{"_id": "Dh4z3mXcj3Fud4hNa", "postedAt": "2022-10-21T18:06:19.520Z", "postId": "Js4uiJEahHhQBKE3h", "htmlBody": "<p>Well, the contest involves some EAish stuff about making probability estimates and &nbsp;justifying them, etc. I think it helps to include some explicit statements of dependent probabilities and the precise question you intend to answer.</p><p>If you believe in this &nbsp;biological neuron stuff, can you provide the development steps, engineering hurdles, and expected timeline for overcoming each hurdle or finishing each step?</p><p>For example, hurdles dealing with (I'm making stuff up):</p><ol><li>SBI/substrate scaling R&amp;D</li><li>SBI/Silicon interface R&amp;D&nbsp;</li><li>SBI training</li><li>SBI testing</li><li>SBI deployment</li><li>SBI maintenance issues</li></ol><p>Also, with something like this, what are your options for cloning or deploying knowledge or skills? You say it can leverage existing silicon hardware, but is that enough to allow rapid manufacture of trained SBI? Is there some other way to transfer knowledge quickly from &nbsp;a source SBI to a target SBI?</p><p>Finally, how do you define the similarities or differences between artificial life and AGI, as the FTX folks envision it?</p>", "parentCommentId": null, "user": {"username": "Noah Scales"}}, {"_id": "i5dotGyRJJ3Eh4qdt", "postedAt": "2022-10-22T17:14:37.008Z", "postId": "Js4uiJEahHhQBKE3h", "htmlBody": "<p>The reason why I believe SBI is seminal is that it proves that natural neural networks and even single cells, not necessarily neurons, behave in accordance with clearly defined mathematical rules, which enable us to (a) predict and program the behaviour and morphogenesis of living tissue, organs and organisms, (b) to create synthetic forms of life (minds) which never exist, (c) create mathematical, in silica and other substrate based minds which will perform like or better than biological ones, (d) integrate seamlessly all SBIs across the entire array of substrates. &nbsp;</p><p>All these things can be done by scientists in labs or by SBI itself as it evolves if we allow it to do it. &nbsp;</p><p>Active inference theory and minds everywhere framework based on it both show that there is no such thing as unintelligent life. All life forms, organs, and even single cells have intelligence on a spectrum.</p><p>I don't know how &nbsp;to better estimate the probability. SBI is here. Its probability is 1.</p>", "parentCommentId": "Dh4z3mXcj3Fud4hNa", "user": {"username": "Yuri Barzov"}}, {"_id": "YMChiESGbSTuD4ane", "postedAt": "2022-10-22T18:38:39.997Z", "postId": "Js4uiJEahHhQBKE3h", "htmlBody": "<p>OK, Yuri, that sounds exciting, if you're into AGI or artificial life. I was asking my questions to suggest that you produce answers as part of your write-up. I think creating estimates of \"this will happen by...\"or \"this has probability X to happen by ...\" with more detail about engineering hurdles will help with your FTX submission.</p><p>Doing an assessment of SBI development to some level of capability comparable to what interests FTX would meet their criteria better, whether it's agi working in companies or just destroying the place.</p><p>When you say \"SBI is here\" that seems to ignore a timeline for SBI to go from very small lab experiments to much larger (and more relevant) digital/artificial life. &nbsp;It's that transformation that defines the relevance of SBI better, I think. After all, I remember reading about first steps in using DNA as computing apparatus, and the promise was that we would one day have full biological computers, but those are still a long way off, or maybe some engineering hurdle came up, and the idea is abandoned.</p><p>I'm looking at this as someone who would like you to submit the best contest entry that you can, and am just trying to think of what might help.</p><p>As far as agi or artificial life go, I don't believe that they were ever a good idea, in the sense that our civilization will actually benefit from them. OTOH, maybe SBI technology will inform efforts to build better replacement limbs or something like that....</p>", "parentCommentId": "i5dotGyRJJ3Eh4qdt", "user": {"username": "Noah Scales"}}, {"_id": "mJCpfChb5BXpGJdxv", "postedAt": "2022-10-23T15:59:41.679Z", "postId": "Js4uiJEahHhQBKE3h", "htmlBody": "<p>Thank you very much. I understand that you are helping me and appreciate it very much.</p><p>The point that I failed to make clear in the paper is that I'm not telling, \"Look, here are brains in a dish playing pong and it's cool.\"</p><p>I'm trying to tell that there's a mathematical algorithm &nbsp;that enables dishbrains to learn. Dishbrains just prove that the algorithm works &nbsp;with natural neurons embedded in digital environment. We can now use this algorithm to make both biological synthetic organisms and machines which will be sentient and able to talk to each other and to natural organisms in the same language.&nbsp;</p><p>There will be different technological hurdles depending on the substrate and the goal chosen but there are no more fundamental understanding problems which blocked the development of DNA based computer and block now the quantum computer development as well.</p><p>There are several labs lead by passionate scientists which work on SBI for many years. Fortune-hunters are joining the gang as they smell success. That's the situation right now&nbsp;</p>", "parentCommentId": "YMChiESGbSTuD4ane", "user": {"username": "Yuri Barzov"}}, {"_id": "8ALA9gsxKjjpvPfuv", "postedAt": "2022-10-24T17:50:04.120Z", "postId": "Js4uiJEahHhQBKE3h", "htmlBody": "<p>Oh, so SBI can run on silicon only, and the fundamental discovery is not how to interface natural neurons, but how to use this algorithm &nbsp;that's been discovered. Well, that's important to convey, and I think you have done so, but I still feel like offering explicit prediction information and creating one article per FTX question is a good idea.&nbsp;</p><p>Thanks, Yuri, for your replies, I'm learning a lot from you.</p>", "parentCommentId": "mJCpfChb5BXpGJdxv", "user": {"username": "Noah Scales"}}, {"_id": "eCwXc4kKAcCKikcwg", "postedAt": "2022-12-22T13:42:33.861Z", "postId": "Js4uiJEahHhQBKE3h", "htmlBody": "<p>In two months following our conversation in this white paper you can now find answers to all you questions and the roadmap of AGI development based of the first principle of SBI <a href=\"https://arxiv.org/abs/2212.01354\">https://arxiv.org/abs/2212.01354</a>&nbsp;</p>", "parentCommentId": "Dh4z3mXcj3Fud4hNa", "user": {"username": "Yuri Barzov"}}, {"_id": "RFCfcaBWMjG3CoATd", "postedAt": "2022-12-22T20:31:59.180Z", "postId": "Js4uiJEahHhQBKE3h", "htmlBody": "<p>Thank you for remembering me, Yuri! I will read the article.</p>\n", "parentCommentId": "eCwXc4kKAcCKikcwg", "user": {"username": "Noah Scales"}}]