[{"_id": "cWXBmxBYj2ZrTuLPj", "postedAt": "2023-07-13T14:30:51.169Z", "postId": "JsnhfXsNgi3GxfScL", "htmlBody": "<p>Last I checked, Tetlock's result on the efficacy of superforecasters vs. domain experts wasn't apples-to-apples: it was comparing individual domain expert forecasts vs. superforecaster forecasts that had been aggregated.</p>", "parentCommentId": null, "user": {"username": "Peter Berggren"}}, {"_id": "P4S2PbZZfrDimpTcK", "postedAt": "2023-07-13T15:13:51.652Z", "postId": "JsnhfXsNgi3GxfScL", "htmlBody": "<p>Teddy - this is an important and fascinating paper, and I'd highly recommend EAs to read it.</p><p>I'm genuinely baffled about why the superforecasters are giving such an _extremely_ low risk of extinction compared to the AI domain experts, and I'd value any suggestions from others about this.</p><p>I don't think the superforecaster estimates being so low is a strong reason to significantly revise our views on X risk, until we have better insights into the huge discrepancy in risk estimates.</p>", "parentCommentId": null, "user": {"username": "geoffreymiller"}}, {"_id": "mm5RcWBDJjpouT9cP", "postedAt": "2023-07-13T15:53:59.999Z", "postId": "JsnhfXsNgi3GxfScL", "htmlBody": "<p>One possible explanation for the disparity is the sampling of participants: 42% of the domain experts had attended EA meetups, whereas only 9% of the superforecasters had (page 9 of report). This could have caused a systematic shift in opinion.&nbsp;</p><p>Another explanation: Anchoring bias. The general public changed their estimates of x-risk six orders of magnitude from 5% to 1 in 15 million when the question was phrased differently (page 29). Presumably at least some of this effect would persist for experts as well. Participants were given a list of previous predictions of AI x-risk which were mostly around the 5% range (page 132). I propose that the domain experts anchored to this value, whereas the superforecasters were more willing to deviate.&nbsp;</p>", "parentCommentId": "P4S2PbZZfrDimpTcK", "user": {"username": "titotal"}}, {"_id": "esoDpWd7snb7gGQ37", "postedAt": "2023-07-13T16:01:05.754Z", "postId": "JsnhfXsNgi3GxfScL", "htmlBody": "<p>There's a giant financial and status incentive for AI safety workers to inflate the dangers. It's also more likely that someone becomes an ai safety expert if they over-estimate the risk.</p>\n", "parentCommentId": "P4S2PbZZfrDimpTcK", "user": {"username": "John Salter"}}, {"_id": "4cH2af4HAPYcaKR9g", "postedAt": "2023-07-13T16:14:27.273Z", "postId": "JsnhfXsNgi3GxfScL", "htmlBody": "<p>I am a bit worried about a narrative of \"the forecasters think x-risk is low\" when I know a bunch of excellent forecasters who have much higher AI x-risk probabilities.&nbsp;<br><br>For example, Samotsvety (who afaict have an excellent forecasting track record on domain-relevant questions) gave some estimates <a href=\"https://forum.effectivealtruism.org/posts/EG9xDM8YRz4JN4wMN/samotsvety-s-ai-risk-forecasts\">here</a> (on sep-8-2022) :</p><blockquote><p>A few of the headline aggregate forecasts are:</p><ol><li>25% chance of misaligned AI takeover by 2100, barring pre-<a href=\"https://docs.google.com/document/d/1smaI1lagHHcrhoi6ohdq3TYIZv0eNWWZMPEy8C8byYg/edit%23heading%3Dh.14onymzb0y9\"><u>APS-AI</u></a>&nbsp;catastrophe</li><li>81% chance of <a href=\"https://www.openphilanthropy.org/research/some-background-on-our-views-regarding-advanced-artificial-intelligence/\"><u>Transformative AI</u></a>&nbsp;(TAI) by 2100, barring pre-TAI catastrophe</li><li>32% chance of AGI being developed in the next 20 years</li></ol></blockquote>", "parentCommentId": null, "user": {"username": "calebp"}}, {"_id": "hJMyzhH43KzvAahio", "postedAt": "2023-07-13T16:23:09.745Z", "postId": "JsnhfXsNgi3GxfScL", "htmlBody": "<p>titotal - thanks for these helpful observations. Both sound plausible!</p>", "parentCommentId": "mm5RcWBDJjpouT9cP", "user": {"username": "geoffreymiller"}}, {"_id": "fwDYh8wDNzSf4HssA", "postedAt": "2023-07-13T16:26:48.827Z", "postId": "JsnhfXsNgi3GxfScL", "htmlBody": "<p>John - yes, it is plausible that there could be selection effects, such that only people with a P(doom) over 1% even bother becoming AI safety researchers.&nbsp;</p><p>But this cuts both ways: any 'forecasting experts' who think the P(doom) is over 1% might have already become AI safety researchers, rather than remaining general forecasting experts.</p><p>Also, I'm a bit baffled by this narrative that there are 'giant financial and status incentives' for AI safety researchers to inflate the dangers.&nbsp;</p><p>If somebody wanted to become rich and famous, becoming an AI safety researcher wouldn't even make the Top 1000 list of good career strategies.</p>", "parentCommentId": "esoDpWd7snb7gGQ37", "user": {"username": "geoffreymiller"}}, {"_id": "TFTKre7yqzkHM6YhZ", "postedAt": "2023-07-13T19:10:33.412Z", "postId": "JsnhfXsNgi3GxfScL", "htmlBody": "<p>The entirety of their job security and status in society depends on the risk being high. You don't view that as a strong incentive to create the impression that the risk is high?</p>\n", "parentCommentId": "fwDYh8wDNzSf4HssA", "user": {"username": "John Salter"}}, {"_id": "LFdxKsiEopvhxn2Hg", "postedAt": "2023-07-13T20:05:26.145Z", "postId": "JsnhfXsNgi3GxfScL", "htmlBody": "<p>I wouldn't expect a lot of scarcity mindset, because there's a lot of generically in demand talent and experience among AI x-risk orgs. Status may be a more reasonable question, but job security doesn't really make sense.</p>", "parentCommentId": "TFTKre7yqzkHM6YhZ", "user": {"username": "quinn"}}, {"_id": "TqREmPEmiXTSLQdJm", "postedAt": "2023-07-13T20:08:23.015Z", "postId": "JsnhfXsNgi3GxfScL", "htmlBody": "<p>This study wasn't recruiting AI safety workers? Rather it had AI domain experts, many of whom appeared to have thought about AI x-risk not much more than I'd have expected the median AI researcher to have thought of AI x-risk.[EDIT 2023/07/16: I'm less sure that this is true]&nbsp;</p><p>There was a follow up study with both superforecasters and people who have thought about or worked in AI safety (or adjacent fields). I was involved as a participant. That study had some more (though arguably still limited) engagement between the two camps, and I think there was more constructive dialogue and useful updates in comparison.&nbsp;</p>", "parentCommentId": "esoDpWd7snb7gGQ37", "user": {"username": "Linch"}}, {"_id": "BvRKhiwHKSLJKgp6R", "postedAt": "2023-07-13T20:11:08.325Z", "postId": "JsnhfXsNgi3GxfScL", "htmlBody": "<p>To explain my disagree-vote, this kind of explanation isn't a good one <i>in isolation</i></p><p>I could also say it benefits AI developers to downplay<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefgrffmvrh38\"><sup><a href=\"#fngrffmvrh38\">[1]</a></sup></span>&nbsp;risk, as that means their profits and status will be high, and society will have a more positive view of them as people who are developing fantastic technologies rather than raising existential risks</p><p>And what makes this a bad explanation is that it is so easy to vary. Like above, you can flip the sign. I can also easily swap out the area for any other existential risk (e.g. Nuclear War or Climate Change), and the argument could run exactly the same.</p><p>Of course, I think motivated reasoning is something that exists and may play a role in explaining the gap between superforecasters and experts in this survey. But on the whole I don't find it convincing without further evidence.</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fngrffmvrh38\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefgrffmvrh38\">^</a></strong></sup></span><div class=\"footnote-content\"><p>consciously or not</p></div></li></ol>", "parentCommentId": "TFTKre7yqzkHM6YhZ", "user": {"username": "JWS"}}, {"_id": "PcKnzDBtctaMFCjRr", "postedAt": "2023-07-14T03:38:20.886Z", "postId": "JsnhfXsNgi3GxfScL", "htmlBody": "<p>\"when I know a bunch of excellent forecasters...\"</p><p>Perhaps your sampling techniques are better than Tetlock's then.</p>", "parentCommentId": "4cH2af4HAPYcaKR9g", "user": {"username": "TeddyW"}}, {"_id": "hpFE3Z6vcD27fnpdX", "postedAt": "2023-07-14T06:54:58.303Z", "postId": "JsnhfXsNgi3GxfScL", "htmlBody": "<p>The <a href=\"https://samotsvety.org/track-record/\">Samotsvety track record</a> does straightforwardly look better than what I expect the median superforecaster's track record to be (which I think is ~99th percentile in either the original Tetlock studies or on GJO), especially on AI. Though perhaps Tetlock's team also selected for better forecasters than the median superforecaster? It's unclear to me.</p>", "parentCommentId": "PcKnzDBtctaMFCjRr", "user": {"username": "Linch"}}, {"_id": "JWcYaLfomi9EMa6vY", "postedAt": "2023-07-14T13:58:04.431Z", "postId": "JsnhfXsNgi3GxfScL", "htmlBody": "<p>As <a href=\"https://forum.effectivealtruism.org/posts/qZqvBLvR5hX9sEkjR/comparing-top-forecasters-and-domain-experts\">this post explains</a>, the main study that people cite when saying that \"superforecasters are better than experts\" comes from a competition where the aggregation methods for the two groups was different (Good Judgment Project's aggregation algorithm versus prediction market with low liquidity for amateur forecasters and experts, respectively). Prediction markets for forecasters and experts had similar performance.</p>", "parentCommentId": "cWXBmxBYj2ZrTuLPj", "user": {"username": "LuisMota"}}, {"_id": "tJSGGb7xmPhxftaNo", "postedAt": "2023-07-14T21:21:50.083Z", "postId": "JsnhfXsNgi3GxfScL", "htmlBody": "<p>Conversely, the median estimate of <i>all</i> domain level experts is probably lower than the 3.9% presented here. The sampling of experts is non-random: people who are already concerned about AI risk are more likely to do the voluntary survey. The sample here had ~40% of experts attending at least one AI meetup, which is not at all typical for AI experts as a group.&nbsp;</p><p>This could also be true of previous surveys, like the <a href=\"https://wiki.aiimpacts.org/doku.php?id=ai_timelines:predictions_of_human-level_ai_timelines:ai_timeline_surveys:2022_expert_survey_on_progress_in_ai\">2022</a> AI impacts survey which had a response rate of only 17%. I reckon that if you added in the other 83% of experts, the median estimate would drop by a fair margin.&nbsp;</p>", "parentCommentId": "4cH2af4HAPYcaKR9g", "user": {"username": "titotal"}}]