[{"_id": "HdcwgGNEj3u6piAXL", "postedAt": "2023-12-18T09:31:15.475Z", "postId": "Jt7p4JcbmiunZwsh6", "htmlBody": "<p>Thanks team! I can't keep track of which email address I've used from year to year on the surveys, do you plan to send an email to those who filled in the previous surveys with a link to fill it in again which pre-fills the email address? That'd be wonderful if so 🙌</p>", "parentCommentId": null, "user": {"username": "Luke Freeman"}}, {"_id": "44s9Dsih2sq6yk8ZR", "postedAt": "2023-12-18T10:24:57.338Z", "postId": "Jt7p4JcbmiunZwsh6", "htmlBody": "<p>Thanks Luke! Everyone who opted to receive additional surveys by email in the last EA Survey, will have received an email with this survey (December 11-12th). We find they often get sent to the spam folder though, so you might want to check.</p><p>If you follow the link in that email, it won't automatically pre-fill your email or automatically track you, but you will be able to know which email address it was sent to, so that you can enter that one.</p>", "parentCommentId": "HdcwgGNEj3u6piAXL", "user": {"username": "David_Moss"}}, {"_id": "pEw6WqP4CRqy8wtEd", "postedAt": "2023-12-18T13:32:07.912Z", "postId": "Jt7p4JcbmiunZwsh6", "htmlBody": "<p>One piece of feedback: my view on \"resource\" allocation depends pretty significantly on whether I'm thinking of mainly financial-type resources or people-type resources. There's obviously some, albeit incomplete, fungability between the two. Anyway, I found the resource-allocation question hard to answer because I found it hard to consider \"resources\" as an abstraction.</p>\n", "parentCommentId": null, "user": {"username": "Jason"}}, {"_id": "4ujTvMCwKnHykD3dr", "postedAt": "2023-12-18T14:45:40.504Z", "postId": "Jt7p4JcbmiunZwsh6", "htmlBody": "<p>Thanks! I agree that allocating a percentage of \"resources\", where this contains very different kinds of resources (money and labour) can be difficult. Still, we wanted this to largely match <a href=\"https://forum.effectivealtruism.org/s/d32npjG3dv2oPXxbH/p/eygnoHEFnkzsZmu5u#Views_on_Resource_Allocation__see_more_\">the question asked at the Meta Coordination Forum</a>, which also combined this, so we matched their wording.</p>", "parentCommentId": "pEw6WqP4CRqy8wtEd", "user": {"username": "David_Moss"}}, {"_id": "p4MeBstecqQYFHFE6", "postedAt": "2023-12-18T22:22:52.223Z", "postId": "Jt7p4JcbmiunZwsh6", "htmlBody": "<p>Thanks! Found it (yep, was in spam unfortunately).</p>", "parentCommentId": "44s9Dsih2sq6yk8ZR", "user": {"username": "Luke Freeman"}}]