[{"_id": "kFizbCm3WgYXgAK3L", "postedAt": "2023-06-07T06:12:55.418Z", "postId": "JuzgngibdtcEvQRFy", "htmlBody": "<p>I continue to find the speed at which these posts accrue initial at least one initial early strong-downvote surprising and frustrating. Once again, I invite downvoters to articulate their disagreement in a comment. Based on analytics, I know it is one of the first 6 readers, and that they spent less than 5 minutes on this 11 minute article. I precommit to responding with a \"thanks for your feedback\" or something more positive and thoughtful than that.</p>", "parentCommentId": null, "user": {"username": "AllAmericanBreakfast"}}, {"_id": "hRu44zJR2vWhYsLK9", "postedAt": "2023-06-07T10:13:22.792Z", "postId": "JuzgngibdtcEvQRFy", "htmlBody": "<p>I remain unconvinced by the suggestion that the benefits of the proposal would outweigh its costs.</p><p>Some thoughts, in no particular order</p><blockquote><p>1. \"So the 10% figure is not exactly <i>arbitrary</i>. It is chosen for a specific set of practical reasons - having brand recognition, being a nice round number, and being used by religious groups.\"</p></blockquote><p>In the comment you refer to, I was arguing that you misunderstood criticisms that target the % of donation EA requires. Specifically, any % is arbitrary on normative grounds: if you have a duty of beneficence towards the global poor, it is unclear why it would discharge at 10%, 12%, 18%, 90% and so on. There are indeed practical reasons to choose 10% over others, but they do not solve the normative problem. Normatively, EA chooses an arbitrary number. Scott Alexander has a decent discussion of this point here: https://slatestarcodex.com/2014/12/19/nobody-is-perfect-everything-is-commensurable/</p><blockquote><p>2. If the 10% community standard is all that's preventing a subset of current pledgers from redirecting 20% of their annual giving to the opera instead of GiveWell, are we really pleased that the 10% community standard is having that effect?\"</p></blockquote><p>I do not currently believe the amount of donors that you would sway by offering them the opportunity to donate X% to Givewell and Y% to other charities is large. Notably, this is already possible with the current pledge: you offer some sort of official badge of approval for the Y%.</p><blockquote><p>3. And our critics most often criticize our donation standards as preventing them from donating to secular causes, such as alma maters, political movements, the arts, and so on. Showing them that there is a way to include these interests in their giving, while still saving lives in a way that can be demonstrated with cost-benefit analysis in the manner of Effective Altruism seems to be a promising strategy to me.</p></blockquote><p>Somewhat more meta: I think you fundamentally misunderstand the nature of most criticism levied at the EA. I think most individuals are not criticizing that they won't be allowed to donate to anything else. Rather, they criticize that EA focuses on specific charities/careers/volunteering over others. For example, they disagree that a banker doing earning to give does more good than a social worker (an example that was central in your last post). Or they disagree that EA says Malaria is more efficient than e.g. the local political fundraiser because the latter provides benefits that are hard to quantify, yet huge. I take it to not be typical that someone thinks <strong>\"EA is correct in their appraisal, yet I want to have their approval to donate 2% to something that is not effective\"</strong>. Your proposal is orthogonal to the concerns of critics of EA: you offer them approval to donate to a cause that is explicitly second-rate in the ranking of donations of the pledge. You also don't offer a reason for EA to believe these donations will do most good outside of EA being able to trick more people into doing a pledge, or the public looking more favorably upon us. This strikes me as a transparent move that will likely backfire significantly.&nbsp;</p><p>I'm happy to continue this conversation, but I think a more direct conversation may be more productive than continuing via Forum-Post &amp; Comments. If you want to schedule a zoom call, please reach out!</p>", "parentCommentId": null, "user": {"username": "mhendric"}}, {"_id": "fNpfsK4ksqrFdNQuq", "postedAt": "2023-06-07T15:54:09.968Z", "postId": "JuzgngibdtcEvQRFy", "htmlBody": "<p>Hi mhendric,</p>\n<p>Thanks for your feedback! Researching and writing up my posts takes enough time that adding in individual zoom calls on top would be tough - I work full time. Maybe at some point?</p>\n<p>I see two strains of EA criticism. The one you point out comes from EA’s ideological opponents. That doesn’t mean they are bad, wrong, or that their lives revolve around some sort of other political activism. It means that they have decided on a different organizing ideology for their worldview that generates conclusions incompatible with EA’s way of looking at a variety of questions.</p>\n<p>I don’t think it’s productive to try and persuade this group of people.</p>\n<p>By contrast, I think a large number of people who are potential donors exist who can basically get behind EA ideas, but who would raise concerns along the lines that the 2%/8% pledge idea is meant to address. Here, the barrier isn’t an organized ideology incompatible with EA. It’s the way we organize our conversations with the public and the background perceptions that people have of EA before they encounter our people, books, websites and donation platforms, and before they’ve put more than a few seconds of thought into our ideas.</p>\n<p>The reason I am carrying out this series of posts is partly because I think my proposal is genuinely useful and something we should be experimenting with. But it’s also because I think EA can benefit from kicking the tires of its central ideas. It helps us maintain a culture of open-mindedness, and it also exposes where an apparent community consensus and cogent framing of an issue in fact needs work. I continue to think this is the case in this area.</p>\n", "parentCommentId": "hRu44zJR2vWhYsLK9", "user": {"username": "AllAmericanBreakfast"}}, {"_id": "3ojBJftHKkXkwSzE7", "postedAt": "2023-06-10T02:50:55.704Z", "postId": "JuzgngibdtcEvQRFy", "htmlBody": "<p>I don't think \"you should donate to charity, and at least 10% to effective charities\" is a more difficult message to convey than \"you should donate at least 10% to charity, and at least 8% of that 10% to effective charities.\"&nbsp;</p><p>To the extent \"you should <u>only </u>donate to effective charities\" is being conveyed in practice, it's not clear to me why deploying a 2/8 message is the most effective way to correct that mismessaging. It seems you could get much of the value you're seeking by explaining that many (probably most?) people choose to give to causes that are meaningful to them above and beyond the pledge.</p><p>And I do think the costs of a 2/8 message would be substantial. The 10% community standard is implicitly making some sort of moral claim. I struggle to come up with a rationale that gives someone the green checkmark of moral approval for giving 8% to effective causes + 2% for music for predominately rich people (i.e., opera) but denies the checkmark for just the 8% to effective causes. In my view, the idea that one can partially satisfy the moral claim implied by the community standard by donating to music for rich people substantially weakens the claim.</p><p>As you imply, the 10% figure is morally arbitrary -- but at least it has some cultural grounding<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefl2vjqeudh6p\"><sup><a href=\"#fnl2vjqeudh6p\">[1]</a></sup></span>&nbsp;and is a nice round number. Adding in a 2/8 split adds a second arbitrariness -- and one that lacks any clear cultural grounding or status as a nice round number. Why not 3/7? or, more likely given the desire for round numbers, 5/5?</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnl2vjqeudh6p\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefl2vjqeudh6p\">^</a></strong></sup></span><div class=\"footnote-content\"><p>The grounding is not based in an appeal for religious donors to replace their religious tithe with a secular one. Rather, using a percentage that was culturally salient reduces the impression that we pulled the 10% number out of thin air. Even to those who are not religious, there's a decent chance they would recognize the figure as a traditional aspiration for charity.</p></div></li></ol>", "parentCommentId": null, "user": {"username": "Jason"}}, {"_id": "YA4GJjdr2dJhbx6yY", "postedAt": "2023-06-10T05:40:23.684Z", "postId": "JuzgngibdtcEvQRFy", "htmlBody": "<p>Hi Jason, thank you for your response.</p><blockquote><p>To the extent \"you should only donate to effective charities\" is being conveyed in practice, it's not clear to me why deploying a 2/8 message is the most effective way to correct that mismessaging.</p></blockquote><p>It's certainly not the <i>most</i> effective way in <i>all</i> circumstances. I think that, on a substantial the margin, a 2/8 message would be <i>more</i> effective in <i>many</i> circumstances. I think a sophistated EA take would be that the real goal is to find a substantial yet isustainable level of giving to effective causes, one that is tailored to the individual's material situation and the constituency of their <a href=\"https://www.fhi.ox.ac.uk/wp-content/uploads/2021/06/Parliamentary-Approach-to-Moral-Uncertainty.pdf\">moral parliament</a>.</p><p>For people who haven't encountered this complex bundle of ideas and aren't going to give us a huge amount of time before writing us off, a 2/8 message gestures at subtlety of thought, implying moral parliamentarian ideas, the idea of distinguishing effective causes from personal passions, the idea of a substantial habit of charitable giving.</p><p>A 10% message hits the latter two points, but implies that we're trying to frame the personal passions of the target of our giving appeal as unworthy targets of charitable giving. This is indeed the direct implication of the idea that altruistic efficiency follows a power law distribution - ineffective charities are massively worse than the best, and we lose huge value on the margin when we direct funds and energies to suboptimal causes.</p><p>But this totalizing view is one of the major reasons why even people who see the sense of cost-benefit calculations resist thinking in this manner. The implications are profoundly destabilizing if you don't moderate them. So we moderate them. But when you get hit with that realization that there's a whole community of people whom you haven't met, who think in terms of cost/benefit altruistic calculations, and that the straight-line calculation is that you ought to give everything to a narrow band of super-effective causes and live on the level of the global poor, that borks the brain and causes people distance themselves.</p><p>A 10% standard addresses many of those concerns and is much better than the straight-line calculation by protecting people from utilitarian ravages and promoting movement growth. But its limit is that it seems to imply that symbolically, every other area in life is valueless and that our aim is to reduce the amount of non-EA charitable giving you engage in to zero. This is a bad argument but one that people reliably seem to come up with, because people aren't all mathematically literate or careful reasoners the first time they encounter an idea. A 2/8 message addresses this specific way that the thought process and conversation can go wrong by saying: \"Yes, your passion causes <i>are</i> valuable and we <i>do</i> approve of them, and you <i>can</i> keep giving to them, and that <i>is</i> a positive thing that you do. We are <i>also</i> asking you to recognize the sheer magnitude of clear, unambiguous good you can do by donating to things like X-risk prevention or malaria bednets and to really step up your donating in order to support these causes.\" Putting hard numbers on it gives people a sense of the proportions we might consider appropriate as a community standard, which is why \"2%/8%\" and not just the qualitative description is a necessary part of the message, just as \"10%\" is necessary rather than \"a very substantial level of giving.\"</p><blockquote><p>I struggle to come up with a rationale that gives someone the green checkmark of moral approval for giving 8% to effective causes + 2% for music for predominately rich people (i.e., opera) but denies the checkmark for just the 8% to effective causes.</p></blockquote><p>I originally meant to include a metaphor that I think is a helpful reframing of the idea of a community standard/line in the sand/Schelling point, but apparently I never worked it into the main post.</p><p>I think of a community standard not as a rigid number that's a pass/fail, but an elastic tether. We have anchored it at 10%. Obviously, for a solid earner in a country like the USA, being at 9% is a little worse, 11% a little better, but we don't encourage you to \"stretch the standard\" all the way up to 50% (because it can set an intimidating or extremely demanding-sounding image of what our standard is and provoke a sense of being not good enough in ways that are bad for community growth) or all the way down to 0%. But a little variability around 10% really doesn't matter much. The idea of the \"elastic\" standard is that it resists further deformation the further you try and move away from it. Having elasticity built into the standard makes it a better standard because it emphasizes the ways our community embraces flexibility and personal fit whlie still having actual, meaningful standards.</p><p>So yeah, full agree, no \"green checkmark\" mentality. More like a \"green tether\" or something like that.</p>", "parentCommentId": "3ojBJftHKkXkwSzE7", "user": {"username": "AllAmericanBreakfast"}}, {"_id": "T7shhxved5Kf786p3", "postedAt": "2023-06-10T06:02:03.155Z", "postId": "JuzgngibdtcEvQRFy", "htmlBody": "<p>In fact, ignoring concerns about message complexity and not trying to be <i>too </i>fancy, I might suggest we eliminate any hard percentage standard in favor of a recommended % donation that scales with income. So somebody earning &lt; $10,000-$20,000/year might be advised not to donate. Someone earning $80,000 might be asked to donate 10%. Someone earning $10,000,000/year might be asked to donate 90%. These are just rough numbers. But I think this might be better treated in book form or in tailored appeals to individual people. In the EA community I think it would be nice if we often discussed specific ways we could refine and tailor this community standard in a way that's optimized for \"it's easy to understand how this number was computed yet it makes sense for me\" rather than being optimized for compatibility with a sound bite in a media appearance.</p>", "parentCommentId": "3ojBJftHKkXkwSzE7", "user": {"username": "AllAmericanBreakfast"}}, {"_id": "TBuLLdiqgiMmAKAKp", "postedAt": "2023-06-17T03:41:38.314Z", "postId": "JuzgngibdtcEvQRFy", "htmlBody": "<p>I think you've hit on one of the challenging bits here -- what the 10% represents is not particularly well defined, certainly not to someone just encountering EA ideas. We can approximate the intent with metaphors or phrases like \"community standard,\" \"some sort of moral claim,\" \"green tether,\" etc. But if we're assuming a target audience who hasn't \"encountered this complex bundle of ideas and aren't going to give us a huge amount of time before writing us off,\" then we can't assume any kind of nuanced understanding of what the pledge represents.&nbsp;</p><p>If I understand the perceived problem you're trying to fix correctly, the theory is that at least a meaningful fraction of the target audience is going to misinterpret the community standard as somehow precluding or discouraging less-effective donations out of the 90% -- even though this is a pretty unreasonable interpretation to start with,&nbsp;<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefy4uz3p3ewgd\"><sup><a href=\"#fny4uz3p3ewgd\">[1]</a></sup></span>&nbsp;and can be disclaimed pretty early in a presentation.</p><p>To me, a more plausible inference would be to read the standard as embodying a claim that following the standard is morally obligatory -- or at least significantly morally superior -- to not following it, at least for a median-income adult in a developed country with no special circumstances.<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefy1nscgs9qo\"><sup><a href=\"#fny1nscgs9qo\">[2]</a></sup></span>&nbsp;And if the listener comes in with that inference, the 2/8 standard seems much harder to justify as a philosophical matter than the 10% standard. And that seems like a significant downside to me, given that EA has had more success with philosophically-minded people.</p><p>In the end, some of what we're discussing touches on empirical questions that Giving What We Can might find worth evaluating. When presented with brief information about the GWWC pledge, what beliefs about the community standard do people endorse? How do various ways of explaining the community standard effect the listener's understanding? That's not about trying to manipulate people; it is seeing if the way things are being communicated faithfully conveys the community's beliefs. If we are unsuccessful in tweaking the presentation to dispel the incorrect idea that less-effective donations are discouraged through messaging tweaks, how do more substantial reforms (like a 2/8 standard) perform in accuracy?</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fny4uz3p3ewgd\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefy4uz3p3ewgd\">^</a></strong></sup></span><div class=\"footnote-content\"><p>The community standard doesn't say anything about what to do with the other 90%, and a standard that was totally fine with the pledger buying Taylor Swift tickets but objected to donating the same money to a local animal shelter instead would be &nbsp;. . . bizarre.&nbsp;</p></div></li><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fny1nscgs9qo\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefy1nscgs9qo\">^</a></strong></sup></span><div class=\"footnote-content\"><p>I think most people would intuitively grasp the implications of partial compliance: the median-income adult meeting 80% of the standard is acting in a morally superior to an adult in the same circumstances meeting 60% of it, and so on.</p></div></li></ol>", "parentCommentId": "YA4GJjdr2dJhbx6yY", "user": {"username": "Jason"}}, {"_id": "i8DPxyqPwiFGgmk9f", "postedAt": "2023-06-17T03:51:36.886Z", "postId": "JuzgngibdtcEvQRFy", "htmlBody": "<p>That would be more accurate, but doing it well would start to feel like a tax return. But going on income alone without considering cost of living, debt obligations, family size, etc. would produce inaccurate results.&nbsp;</p><p>Maybe it could be a range -- e.g., We recommend the <i>average</i> person earning $80K a year donate 11%; for most people at this income we would recommend donating somewhere between 8-14% depending on personal circumstances. (I changed 10 percent from your example to 11 percent as a starting point, because I think the median person would assign themselves a slightly-less-than-median point in the range.)&nbsp;</p>", "parentCommentId": "T7shhxved5Kf786p3", "user": {"username": "Jason"}}]