[{"_id": "QhAHCnqgRbFD8rpLY", "postedAt": "2022-11-08T20:38:20.431Z", "postId": "JvcGEvtusHACdsbXC", "htmlBody": "<p>Personally I think people get the worry about demographic collapse a little backwards. &nbsp;Yes, <a href=\"https://forum.effectivealtruism.org/posts/vFfoqL74kmZbydKjp/new-cause-area-demographic-collapse\">population decline is plausibly bad</a> for a variety of economic reasons. &nbsp;But I think that the bigger issue is that population decline is a symptom of society's problems, rather than a source of them. &nbsp;I think demographic decline is probably caused by things like the economic/technological \"<a href=\"https://en.wikipedia.org/wiki/The_Great_Stagnation\">great stagnation</a>\", assorted cultural changes too numerous to mention, increasing sclerosis and inertia of political institutions, and the disempowerment of young people due to factors like those (plus, importantly, <a href=\"https://www.worksinprogress.co/issue/the-housing-theory-of-everything/\">high housing prices</a> and <a href=\"https://www.niskanencenter.org/cost-disease-socialism-how-subsidizing-costs-while-restricting-supply-drives-americas-fiscal-imbalance/\">high childcare/education prices</a>). &nbsp;Although of course it is hard to be sure.<br><br>I think people can sense that demographic decline is an indicator of an unhealthy society, and I think that focusing on \"how do we raise birhrates\" is indeed one good concrete way of identifying ways to make society healthier. &nbsp;But I don't think it's the low birthrates themselves that are the problem -- it's the stuff causing the low birthrates that is the problem.</p>", "parentCommentId": null, "user": {"username": "Jackson Wagner"}}, {"_id": "HAqBZibu3Wc5vBmbJ", "postedAt": "2022-11-08T20:59:47.396Z", "postId": "JvcGEvtusHACdsbXC", "htmlBody": "<p>I agree to your comment that reasons for the population decline are many and hard to parse. It is just that we never had this issue before, with the rise of alternative actions where we can derive the meaning of life now seemingly trumping the conventional or literal one - having kids &nbsp;(enabling life on earth).....But yeah, it is a very real concern where the decline in population will drastically alter the capacity of us to continue the growth we had since the 1950s..</p>", "parentCommentId": "QhAHCnqgRbFD8rpLY", "user": {"username": "Miguel"}}, {"_id": "oi8nHqTcjAkvjasHs", "postedAt": "2022-11-08T21:50:52.151Z", "postId": "JvcGEvtusHACdsbXC", "htmlBody": "<p>I'm curious about the specific global population numbers that you predict by, say, 2050, and how you calculated them or what your source is. The numbers I'm familiar with predict a slowing of growth, with stability <a href=\"https://www.un.org/en/desa/world-population-projected-reach-98-billion-2050-and-112-billion-2100#:~:text=COVID%2D19-,World%20population%20projected%20to%20reach%209.8%20billion%20in%202050%2C%20and,Nations%20report%20being%20launched%20today.\">around 10 billion in 2050</a> with an eventual 11 billion by 2100. According to the linked United Nations article, half the continued growth is expected in 9 countries, including the US.</p>\n<p>I recall reading that US population growth can be attributed almost solely to migration, including a flow of immigrants from Mexico and maybe Cuba, but looking at the most recent census data, I'm surprised to see that during <a href=\"https://www.census.gov/library/stories/2021/08/more-than-half-of-united-states-counties-were-smaller-in-2020-than-in-2010.html\">the last decade</a> there was slow <a href=\"https://www.census.gov/library/stories/2021/12/us-population-grew-in-2021-slowest-rate-since-founding-of-the-nation.html\">population growth</a> in the US.  This seems to draw UN expectations into doubt. A suggestion is that Trump's policies drew down immigration rates and <a href=\"https://www.theatlantic.com/newsletters/archive/2022/03/american-population-growth-rate-slow/629392/\">Biden has not done much to pick them back up</a>. Do you think that anti-immigration trend could continue past the Biden administration? I assume you think it should not continue.</p>\n<p>As far as US population growth, we could certainly accept more immigrants into the country, there was such an opportunity during the Trump administration, but it was rejected by the administration. What are compelling reasons, if any,to accept flows of migrants that are not already technically trained, highly educated, or immediately employable? President Trump infamously suggested that we should seek <a href=\"https://www.washingtonpost.com/news/wonk/wp/2018/01/12/trump-wants-more-immigrants-from-norway-theres-a-reason-they-arent-coming/\">immigrants from Norway</a>. He objected to some nations as a source of migrants in a way that could be taken as racist. However, immigration is commonly evaluated on whether migrants could contribute to society economically or financially. What are your ideas for immigration policy in the case of migrants seeking to live in the US to escape poverty, political persecution, or environmental disaster?</p>\n<p>I agree with you about the importance of education to the country's population, and wonder what level of investment, compared to today, you think would be useful for tomorrow's adults, and furthermore, what sort of jobs you think will be most common in 20-30 years that will accept a larger population. What sorts of jobs in what ranges of numbers do you envision?</p>\n<p>I asked a number of questions, but answer whichever you would like. I'm looking to become reoriented to the details of population growth in developed countries. Thank you.</p>\n", "parentCommentId": null, "user": {"username": "Noah Scales"}}, {"_id": "R9kxD4giY5h2oh4ku", "postedAt": "2022-11-09T01:26:46.361Z", "postId": "JvcGEvtusHACdsbXC", "htmlBody": "<p>Hello Noah,&nbsp;</p><p>Thank you for your effort to outlining your ideas and questions in Immigration and yeah I will try to stretch myself into these inquiries of yours....</p><p>US is the land of immigrants, people aspiring for a better life had come to build the dreams they wanted for themselves and for their families. I do not see immigration in US or its stagnation a longterm issue - yet what I see that may affect this is the wild politics that you US have - as self biases of government officials is first served than the people themselves. I am an outsider and just observing - anyone correct me if you see this observation inaccurate. I am pro immigration as long as it's parameterized with structure and an immersion scheme so common barriers like wealth, language, religious beliefs and education backgrounds can be eliminated for newly absorbed immigrants.</p><p>The level of investment for education for the youth (future adults)? if I were to reorganize how we teach people - it should be mandatory to incorporate art, music, dance, martial arts, mindfulness and psychology as the base layer for any student. Computer science and Math are great ones too. Then other fields should be optional after teaching kids a better foundation on how the world really works - choosing a certain field can be even done while training on the job. Most common jobs if we do not mess the stability of the world in the next 30 years will be content creators and programmers. Construction and mechanical work is still in play. My wild bet as a new thing is robotics and space exploration.</p><p>Don't hesitate to ask questions, add more if you wish so.</p><p>All the best,</p><p>Miguel&nbsp;</p>", "parentCommentId": "oi8nHqTcjAkvjasHs", "user": {"username": "Miguel"}}]