[{"_id": "XRuNj2bkydY7RHnG2", "postedAt": "2022-10-27T10:15:22.368Z", "postId": "JvEHiKWWwtvT3YanA", "htmlBody": "<p>Nice!</p><blockquote><p>However, I still doubt my conclusion because on the meta level it seems like an obvious thing that would be surprising if no one at GiveWell had ever thought of doing, which is evidence I am missing something important.</p></blockquote><p>A thing that you might be missing is that GiveWell is only assigning limited manpower to its CEAs. This means that I think that they may not have noticed relatively subtle issues like this—clear when you notice them, but perhaps hard to notice unprompted.</p>", "parentCommentId": null, "user": {"username": "NunoSempere"}}, {"_id": "2yJ3buacGeZzdyNnQ", "postedAt": "2022-10-27T15:43:43.319Z", "postId": "JvEHiKWWwtvT3YanA", "htmlBody": "<p>Thanks. &nbsp;I suppose I was thinking that the CEAs are one of the core products GiveWell creates and a lot of effort has gone into them. &nbsp;But yes, once I have thought of something it probably seems more obvious than it is.</p>", "parentCommentId": "XRuNj2bkydY7RHnG2", "user": {"username": "Oscar Delaney"}}, {"_id": "xN2Ks2p84gzfSkpEb", "postedAt": "2022-10-27T16:38:45.799Z", "postId": "JvEHiKWWwtvT3YanA", "htmlBody": "<p>You can never escape Jensen's inequality :) nice, clean argument!</p>\n", "parentCommentId": null, "user": {"username": "therealslimkt"}}, {"_id": "PrJjFAGAcw3F4qGW9", "postedAt": "2022-10-28T23:11:28.915Z", "postId": "JvEHiKWWwtvT3YanA", "htmlBody": "<p>Very interesting argument. As someone fond of Bayesian modeling, I am almost always in favor of replacing point estimates with distributions.</p><p>GiveWell links to<a href=\"https://academic.oup.com/heapol/article/35/1/107/5591528\"> this paper</a> in their CEA spreadsheet. Their recommendation is a discount rate of 4% for upper-middle-income countries and 5% for low-income countries. This recommendation seems to be based on three factors: Past growth of GDP, implied social discount rate, and projected GDP growth. All three, are measured with uncertainty and will vary by country. I think it would be very interesting to take that variability into account!</p>", "parentCommentId": null, "user": {"username": "Fernando Irarrázaval"}}, {"_id": "wP6DuPnK9HoFrGTAp", "postedAt": "2022-10-28T23:28:16.327Z", "postId": "JvEHiKWWwtvT3YanA", "htmlBody": "<p>Thanks!  I think most of the value would be captured by just switching to a single distribution for all countries, but yes having slightly different distributions for each country could be slightly better.  My (fairly uninformed) guess would be that the socio-economic status of each of GiveWell's countries is similar enough that we wouldn't have much reason to use different distributions.</p>\n", "parentCommentId": "PrJjFAGAcw3F4qGW9", "user": {"username": "Oscar Delaney"}}, {"_id": "FLF4iEhA5MDHNJSAq", "postedAt": "2022-10-28T23:48:15.087Z", "postId": "JvEHiKWWwtvT3YanA", "htmlBody": "<blockquote>\n<p>I cannot think of any plausible ways in which these three random variables correlate. Surely learning that the price of vitamin A tablets just doubled (C) does not affect how effective they are</p>\n</blockquote>\n<p>Price and effectiveness correlate because people are willing to pay higher prices for more effective things. One reason the price would double abruptly is because of new information indicating higher effectiveness.</p>\n", "parentCommentId": null, "user": {"username": "Elliot Temple"}}, {"_id": "rPRE8pXHYCptGXqwt", "postedAt": "2022-10-29T00:11:09.306Z", "postId": "JvEHiKWWwtvT3YanA", "htmlBody": "<p>Ah good point, OK I think I was too bold there.  Perhaps the weaker thing I should have said is that I don't think these effects would be large and that I don't have a good suggestion for what GiveWell could practically do to implement any possible correlations among these variables.</p>\n", "parentCommentId": "FLF4iEhA5MDHNJSAq", "user": {"username": "Oscar Delaney"}}, {"_id": "CfAWJ9kaBtDsKDpgB", "postedAt": "2022-10-29T00:19:28.586Z", "postId": "JvEHiKWWwtvT3YanA", "htmlBody": "<p>Do you think you making that mistake could serve as a good model for how they could have made the mistakes that you think they made?</p>\n", "parentCommentId": "rPRE8pXHYCptGXqwt", "user": {"username": "Elliot Temple"}}, {"_id": "TAt6wPKhcmAQaoctG", "postedAt": "2022-10-29T02:09:47.198Z", "postId": "JvEHiKWWwtvT3YanA", "htmlBody": "<p>Yes perhaps, I suppose one disanalogy is the length of time spent thinking about the topic - I would hope GiveWell's work is more thorough than mine.</p>\n", "parentCommentId": "CfAWJ9kaBtDsKDpgB", "user": {"username": "Oscar Delaney"}}, {"_id": "Psu2iJkHBnajscHKM", "postedAt": "2022-10-30T10:18:04.477Z", "postId": "JvEHiKWWwtvT3YanA", "htmlBody": "<p>Thanks for your entry!</p>\n", "parentCommentId": null, "user": {"username": "GiveWell"}}, {"_id": "qkECGisnyEnyQJmuR", "postedAt": "2022-11-01T12:02:13.450Z", "postId": "JvEHiKWWwtvT3YanA", "htmlBody": "<p>With limited manpower, GiveWell also has to prioritize <i>which</i> CEA improvements to make--and added complexity can moreover increase the risk of errors.&nbsp;</p>", "parentCommentId": "2yJ3buacGeZzdyNnQ", "user": {"username": "katriel"}}, {"_id": "SHiM6C79HcNFqmtmc", "postedAt": "2022-11-02T17:49:42.580Z", "postId": "JvEHiKWWwtvT3YanA", "htmlBody": "<p>I was actually thinking of the same thing. &nbsp;Nice work here bro.</p>", "parentCommentId": null, "user": {"username": "Miguel"}}, {"_id": "MBgyKZppuWx7EczCQ", "postedAt": "2022-11-03T12:12:49.325Z", "postId": "JvEHiKWWwtvT3YanA", "htmlBody": null, "parentCommentId": null, "user": null}]