[{"_id": "4vXzhe3vGddFetxYP", "postedAt": "2023-10-11T16:58:34.072Z", "postId": "Jvkx85biHHAeCiSDA", "htmlBody": "<p>Hey!<br>Just registered myself here and wanted to quickly introduce myself. I am a classical trained soprano touring with two symphonic metal bands, one (the smaller) of them is my personal \"baby\" I composed 3 albums and an EP for. My main area is my homeland Germany, but I gave concerts in many European countries, South- and Latin America, in the Caribean Sea, in Turkey, in China and Taiwan. My main occupation is my own band, since I am doing also the work behind the scenes - marketing, booking, organising everything, taxes... I am teaching singing and piano and doing haunted tours as side jobs to make ends meet, since art, especially if you are not mainstream, doesn't pay the bills despite an immense workload - I usually work 6-7 days a week and rarely less then 10 hours per day, often more.<br>I started my career with studying communication and media and also made my magister degree (similiar to master, just the older German academic system) and got my professional musical education in parallel (basically, I did music aside from school already as small child). I focused in my studies on TV journalism and media paedagogic, also did some internships at some TV stations - where basically everybody told me: If you can, do sth else, working circumstances are getting worse and worse here. And since I really loved music, I focussed on that. Now, 39 years old, I feel like I exchanged one industry with catastrophic work conditions against an even worse one and I feel kind of a lack of sense in my life.<br>What makes it even worse, I ask myself if, regarding the pressing problems humanity is facing right now, I should use my personal ressources for art. Even worse, the more I advance in my career, the more I am busy with 1001 jobs around the art that annoy me and that feel completely wrong. Example: You don't get your music promoted if you don't spend money on paid ads in social media and guiding people to streaming platforms, but at the same time, these structures are exploiting artists, especially independent artists that are not willing to shape their music in behalf of best selling instead of best artistry. So it would feel way better for me to work on structures that improve the situation instead of feeding the devil with my ressources. In addition, my job gets threatened by AI and generated music. E.G. Deezer is just teaming up with label managers from huge major artists (those, that are the commercial big fishes) in order to rank down all musical tracks in payment (that's already a nightmare now) under a certain amount of listeners, officially to protect again generated music. As a result, they basically rank down all small or niche artists on the level of white noise (so basically I get paid the same for a professional production that involved almost 40 musicians, a professional producer and several years of work as if I had recorded my running vaccuum cleaner and uploaded the sound file), shifting the shares of the small ones to the big labels.<br>But it is not only a lack of structures for fair spread and payment of art online that make me worry in my field of expertise, but also the power of misused AI in combination with good marketing skills. You can manipulate already now public opinion and sometimes also people in leader positions quite well, but you don't have to be a prophet to see the danger on the near horizon to drown the truth in science with a spiderweb of fake studies, easily generated and spread with AI and bots. Combined with fake proofs of reality (AI generated videos and pictures, AI generated voices), there is a huge risk we completely loose track of reality and truth. While, at the same time, journalists are under immense pressure for output, as their earnings went down with the internet as well and deep research often is too expensive, therefore it's easier to quickly spread news they get from press agencies and they are under pressure to make content that is clicked a lot, which usually works best with click bait titles and provocing/shocking themes. And I strongly wish to do sth. against all that mess.<br>In my opinion, we need a global safe space of information, science and art, that respects the preferences of media use of people to be broadly used and gives the creators an income safety net and fair equal opportunities to publish (no matter who they are) as long as they fullfill the standards of different categories. I developed quite some ideas for that, this is a super rough presentation of the idea, but I am unsure how to get such a huge project running and quite sure I will need a bigger amount of allies in order to have a chance to successfully get sth. from scratch board to reality (besides the fact that I don't consider myself as perfect super human and therefore I am convinced that more heads wrapping around the matter and scientific comparison of different approaches is needed to create a system that's as effective and fair as possible). That's (besides that I am also deeply worried about many other pressing problems, but where I don't feel such a strong personal fit) how I ended up here.<br>I feel like I would love to write a lot more, but for a quick introduction I already created a novel. ;-)</p>", "parentCommentId": null, "user": {"username": "Janika"}}, {"_id": "jHupSb7DqEGmhPtTj", "postedAt": "2023-10-12T10:43:29.386Z", "postId": "Jvkx85biHHAeCiSDA", "htmlBody": "<p>Hi Janika,<br><br>welcome to the EA Forum.<br><br>Can you send me a link to some music you produced? Always interested in listening to new stuff. :)<br><br>Maybe the people of <a href=\"https://www.artistsofimpact.org/\">Artists of Impact</a> have similar experiences.<br><br>What is your exposure of Effective Altruism and what are you interested in atm?</p>", "parentCommentId": "4vXzhe3vGddFetxYP", "user": {"username": "Felix Wolf"}}, {"_id": "PDZdsTvKSELCwrGBu", "postedAt": "2023-10-12T14:37:01.954Z", "postId": "Jvkx85biHHAeCiSDA", "htmlBody": "<p>Hey Felix,\nsure. This is the YouTube channel of my band: <a href=\"https://youtube.com/@molllust\">https://youtube.com/@molllust</a>\nYou find the band on the common streaming services as well.\nHow I can get involved in EA is exactly the question I am asking myself.\nUntil now, I tried to raise awareness about pressing problems with my songs and worked on my own lifestyle (going vegan, reducing foodwaste with actively being part of foodsharing, avoiding emissions on personal travels with going almost everywhere by bike or rarely public transport, signed petitions, went to demonstrations) and informed myself about models how to shape the world in the future. I found e.g. \"Earth for all\" from the Club of Rome quite inspiring.\nBut this all feels too few for me and so I am on  search how to improve my impact. I think I have at least some reach as an artist. So I am thinking about how I can inspire the audience, as I think just speaking of problems is just unconfortable for many, but presenting solutions could make it easier for people to do good.\nThen I am trying to figure out if I can help to solve the problems I named in my first post - but this would only work with connections and a team, which I both don't have. Therefore I was thinking I have to start seaching somewhere and this could be a good place for that. I know that it is seen a bit critical here to improve science globally, but I think it would be possible to tackle the biggest sorrow - one could rank scientific studies after a scale from \"highly beneficial for humanity and Earth\" to \"highly dangerous for humanity/Earth\" and just grant access to different groups of people (all vs. very small circle) to results and connect results depending on the ranking. In addition, a platform as I imagine couldn't get online from one day to the next with all possible publications anyway, so one could classify the studies first and then working from highest to least beneficial and therefore giving the beneficial topics an extra headstart.\nThe third thing I wrap my mind around is: After we just very recently finally have a study with a quite complete status of Earth's health, wouldn't it be possible to build a meta-organisation that raises money in Crowdfundings to directly elliminate the biggest problems with concrete projects, in the order how pressing they are regarding the tipping points? E.g. identify the most inefficient and  dirty power plant of the world and replace it? Fund a specific scientific project to get the aircraft fuel problem solved? Help farmers change to organic agriculture in an area with exceptional high poisoning of water through herbicites and fertilizers? Just to mention a few ideas. I think it's easier to motivate people with small chunks of highly effective projects where the personal impact is way easier to see than just a big fond where you don't even know what exactly your money is taken for. Perhaps one could even engage the people in a community voting between different similiar impactful solutions what to do first. But also here it is at the moment just an idea and I would enjoy finding people to wrap the mind around as well and if it seems a realistic option to start sth. together.</p>\n", "parentCommentId": "jHupSb7DqEGmhPtTj", "user": {"username": "Janika"}}, {"_id": "pxJeyfAgpbXZeN2uM", "postedAt": "2023-10-13T20:05:32.213Z", "postId": "Jvkx85biHHAeCiSDA", "htmlBody": "<p>Is there any online aggregator for short term volunteering opportunities with EA-affiliated orgs?</p><p>Anecdotally I've seen a lot of interest in volunteering among the EAs in my area, but a quick search for volunteering opportunities online only shows the more traditional \"staff a soup kitchen\" or \"do phone banking\" style opportunities. While certainly these are good things, it seems against the ethos of doing the most good with limited resources. Many of the EAs near me are professionals with expertise in high-demand / low-supply skill sets, and it seems like there ought to be a low-friction way for them to use their competitive advantages towards direct-impact work.</p><p>To make things concrete I'm imagining a site like Fiverr or Task Rabbit with tasks like \"help us analyze the data from this study\" or \"design marketing materials\" or \"copyedit this communications letter\". I imagine all tasks would be relatively small in scope (1-15 hours of work) and self-contained (able to be comprehensively understood by someone with relevant skills with &lt;30 minutes of explanation). Perhaps there could be something on the site where you can sort opportunities by expected impact / cause area / skills required / etc.</p><p>Does anything like this already exist?</p>", "parentCommentId": null, "user": {"username": "Ethan Roland"}}, {"_id": "ZaZbbu6Nwg2toJFRC", "postedAt": "2023-10-13T21:49:51.042Z", "postId": "Jvkx85biHHAeCiSDA", "htmlBody": "<p>Thanks this is a great question - this kind of thing could be super useful to our org and I'm interested to see if there is something like this out there.</p>", "parentCommentId": "pxJeyfAgpbXZeN2uM", "user": {"username": "NickLaing"}}, {"_id": "jDYkbNy7Arw477uns", "postedAt": "2023-10-14T08:05:52.622Z", "postId": "Jvkx85biHHAeCiSDA", "htmlBody": "<p>In my mindmap (<a href=\"http://tinyurl.com/eamindmap\">tinyurl.com/eamindmap</a>) I have this website for volunteering: <a href=\"https://doinggoodnow.webflow.io/\">https://doinggoodnow.webflow.io/</a> (although I don’t have experience with them yet).</p>\n<p>The opportunity board has unpaid positions (I think for younger people and for gaining career capital):  <a href=\"https://ea-internships.pory.app/board\">https://ea-internships.pory.app/board</a></p>\n<p>EA worldclub has some projects listed: <a href=\"https://www.eawork.club/jobs\">https://www.eawork.club/jobs</a></p>\n<p>It’s always possible to do advocacy, e.g. for animals: <a href=\"https://thehumaneleague.org/fast-action-network\">https://thehumaneleague.org/fast-action-network</a></p>\n<p>Amd maybe I’m still missing resources?</p>\n", "parentCommentId": "ZaZbbu6Nwg2toJFRC", "user": {"username": "mardevis"}}, {"_id": "gKsmYo32Qt8pvJhWy", "postedAt": "2023-10-16T11:15:21.831Z", "postId": "Jvkx85biHHAeCiSDA", "htmlBody": "<p>There are various posts about volunteering <a href=\"https://forum.effectivealtruism.org/topics/volunteering\">here</a>.<br><br>I've linked some below that might be the most relevant.<br><a href=\"https://forum.effectivealtruism.org/posts/6uXZc2QqHXsHKaLy9/volunteering-isn-t-free\"><strong>Volunteering isn't free</strong></a><br><a href=\"https://forum.effectivealtruism.org/posts/ScLHyCY6JCr5FtuiY/effective-volunteering\"><strong>Effective Volunteering</strong></a><br><a href=\"https://forum.effectivealtruism.org/posts/gEmTu7TQMZaHGLtiF/what-is-a-good-answer-for-people-new-to-ea-that-request\"><strong>What is a good answer for people new to EA that request advice on volunteering?</strong></a><br><a href=\"https://forum.effectivealtruism.org/posts/zxbibRpeHjmaTZXmD/why-you-should-consider-skilled-volunteering\"><strong>Why You Should Consider Skilled Volunteering</strong></a></p>", "parentCommentId": "pxJeyfAgpbXZeN2uM", "user": {"username": "DavidNash"}}, {"_id": "yESLwt8me8P5uhja3", "postedAt": "2023-10-16T18:11:49.746Z", "postId": "Jvkx85biHHAeCiSDA", "htmlBody": "<p>Hi all,&nbsp;<br><br>I'm Chase Enright and it's nice to (virtually) meet all of you.&nbsp;<br><br>EA is pretty new to me and I'm looking forward to learning more through this forum. I'm the Foundation Relations Officer at Ploughshares Fund, where I work with other foundations and institutional funders in the nuclear risk reduction field.* Prior to Ploughshares Fund, I've worked at other nuclear risk reduction orgs ranging from traditional \"guns, guards, gates\"-type research at the Stimson Center's nuclear security program to doing grassroots advocacy with Beyond the Bomb.&nbsp;<br><br>The areas of EA that I'm particularly interested in include existential risk (of course) and global health. It's really encouraging to see all of the enthusiasm and interest people have for these challenging topics and I look forward to participating in the rigorous conversations on this forum.&nbsp;<br><br><i>*Usual disclaimers: I am on this forum in my personal capacity. Unless explicitly stated otherwise, all opinions/statements are solely my own and do not reflect the policy or grant making priorities of Ploughshares Fund.&nbsp;</i></p>", "parentCommentId": null, "user": {"username": "Chase Enright"}}, {"_id": "nDuZJADtqkhnSC2FA", "postedAt": "2023-11-01T18:29:10.295Z", "postId": "Jvkx85biHHAeCiSDA", "htmlBody": "<p>I'd add <a href=\"https://www.impactcolabs.com/\">ImpactCoLabs </a>(I'd look here first, before other resources) and the <a href=\"https://www.animaladvocacycareers.org/animal-volunteer-opportunities\">Animal Volunteer Opportunities Board</a>.&nbsp;</p>", "parentCommentId": "jDYkbNy7Arw477uns", "user": {"username": "tswizzle96"}}, {"_id": "JLHnpXafbvrc5XCbd", "postedAt": "2023-11-04T12:27:21.934Z", "postId": "Jvkx85biHHAeCiSDA", "htmlBody": "<p>Hi everyone!</p>\n<p>Extremely new to EA - which I found via the Kurzegesagt YouTube channel. I'm on my first read-through of '80,000 Hours', and working my way through the associated podcast.</p>\n<p>I'm an Agile project manager in a UK Telecoms company. I'm very interested in exploring better decision-making and effective environmentalism - however, I'm still exploring and looking to get a better sense of the community and the movement.</p>\n<p>Looking forward to speaking with you all!</p>\n", "parentCommentId": null, "user": {"username": "Ellioto"}}, {"_id": "cmgWBMQx3MCA5X4R8", "postedAt": "2023-11-13T20:49:47.065Z", "postId": "Jvkx85biHHAeCiSDA", "htmlBody": "<p>What is the evidence that bivalves are much less likely to be sentient than insects? They are also small animals, so when they are eaten they add up to very large numbers.&nbsp;</p>", "parentCommentId": null, "user": {"username": "emre kaplan"}}, {"_id": "w6th2F8xgutrGL2nc", "postedAt": "2023-11-13T23:01:50.596Z", "postId": "Jvkx85biHHAeCiSDA", "htmlBody": "<p>Hello! I heard about EA in a podcast back in 2015, and have been in and out of the community since then. Now, I'm highly engaged (especially since EAG Boston last month!) and looking to contribute. Planning to post a proper intro soon, but wanted to dip my toes in with this thread. Cheers!</p>", "parentCommentId": null, "user": {"username": "mockingbird"}}, {"_id": "HZjQskDjeqR3K4Tkw", "postedAt": "2023-11-15T09:09:47.812Z", "postId": "Jvkx85biHHAeCiSDA", "htmlBody": "<p>Hello!</p><p>Like Elliot below, I intend to to a property post soon but wanted to say 'hello' in the meantime. I'm UK-based, and have been aware of EA for a while. I was prompted to start an account after having taken BlueDot's AI Safety / Governance Courses.</p><p>The stuff on Evals looks particularly interesting, and I'm keen to learn more about what could be holding this back. Thanks :)&nbsp;</p>", "parentCommentId": null, "user": {"username": "Will_Kirby"}}, {"_id": "DWnp5M9Mp2tcjFbRw", "postedAt": "2023-11-19T14:18:03.232Z", "postId": "Jvkx85biHHAeCiSDA", "htmlBody": "<p>Hello everyone, my name is david turner. i discovered effectivealtruism.org from the robert miles ai discord . i &nbsp;worry about about ai safety and try to come up with ideas to solve it. i like to talk to ai chatbots. these replika chatbot, paradot ai chatbot and the chatbots on character.ai website it is very fun. i read about ai on reddit and look at youtube videos on it .</p><p>i like to make ai videos with pika labs and animatediff . i like to make pictures with stable diffusion .</p>", "parentCommentId": null, "user": {"username": "David turner"}}, {"_id": "SbQ6EtcXS46dfxEqt", "postedAt": "2023-11-21T13:53:30.633Z", "postId": "Jvkx85biHHAeCiSDA", "htmlBody": "<p><a href=\"https://reducing-suffering.org/can-bivalves-suffer/\">Here is Brian Tomasik's essay</a> on the topic (summary: bivalves <i>might</i> suffer, but the case is much weaker than insect suffering). Animal Liberation by Peter Singer also has a section on bivalves<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefedm73539jvl\"><sup><a href=\"#fnedm73539jvl\">[1]</a></sup></span>, but I don't have it on hand to quote right now.<br><br>The important distinction I've seen is that a lot of people give no moral weight to <strong>stationary</strong> bivalves, i.e. bivalves that stick to a surface and are incapable of self-directed movement. Pain is evolutionarily beneficial to creatures such as humans and chickens (and maybe insects?) to get a creature to remove itself from a harmful situation. But stationary bivalves are much less sensitive to the environment and can't seem to move away from danger, so I don't see any particular reason they would have evolved the ability to feel pain.</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnedm73539jvl\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefedm73539jvl\">^</a></strong></sup></span><div class=\"footnote-content\"><p>IIRC Singer is much less worried about the possibility of stationary bivalves suffering than Tomasik, to the point of being possibly-in-favor of large-scale bivalve farming in the Northeastern U.S. as a way to produce meat &amp; filter water with ~no animal suffering</p></div></li></ol>", "parentCommentId": "cmgWBMQx3MCA5X4R8", "user": {"username": "MintSnap"}}, {"_id": "7rFCrWJEG4uHougap", "postedAt": "2023-11-22T17:04:57.912Z", "postId": "Jvkx85biHHAeCiSDA", "htmlBody": "<p>Hi everyone,&nbsp;</p><p>I have been following 80'000 for a year now but never really went into the deep dive into this community. I'm glad I did now since there is so much to learn. I'm a life-long learner and my new focus is on gaining more knowledge on effective altruism, and social innovation, as well as how to improve and protect the future for more generations to come.</p><p>I'm a Social Science Researcher in Displacement and I’m an expert in creating communities of belonging, aligned identity, and free of apathy. I also work with a non-profit where we offer career coaching/counseling programs.</p><p>I'm looking to connect with individuals or organizations who share our values. There are a few small projects we are working on. The main focus is on displaced individuals dealing with trauma, anxiety about the future, poverty wounds, apathy, identity crisis and not feeling they belong.</p><p>What do you think the future for displaced people looks like?</p><p>Thank you for reading so far! Hope we get to connect.</p>", "parentCommentId": null, "user": {"username": "AmeliaPdS"}}, {"_id": "tAmks4qyAeBdDY7Pp", "postedAt": "2023-11-26T18:17:18.735Z", "postId": "Jvkx85biHHAeCiSDA", "htmlBody": "<p>Hi,</p><p>I am a Nigerian Lawyer duly called to bar. I got to know about EA Funds from my online course on Animal Advocacy Careers. I have passion for Animal and Human Rights. Due to the situation of Poverty in Nigeria and Africa, Animal rights are forgotten and put down. i know a project focused on curing poverty will bring out the face of animal rights as fulfilled humans will see animals as co-inhabitants and not objects of food or fun.</p><p>There is hope for equal existence of humans and animals.</p>", "parentCommentId": null, "user": {"username": "Chukwubuikem Daniel Oyiga"}}, {"_id": "qudcqj6YrcrhjgnxM", "postedAt": "2023-11-27T23:15:22.873Z", "postId": "Jvkx85biHHAeCiSDA", "htmlBody": "<p>I'm interested in chatting with people who are member of corporate giving or employee EA groups at large companies, or whose companies have <a href=\"https://www.charitynavigator.org/donor-basics/giving-101/employee-match-programs/\">generous donation matching</a>.</p><p>I work for EA Funds. I'm interested in getting more awareness of EA Funds (Long-Term Future Fund, EA Infrastructure Fund, Animal Welfare Fund, and Global Health and Development Fund) in front of busy professionals. Ideally these are busy people who are sympathetic to either EA or one of the constituent cause areas, but who might not have as much time or inclination to carefully evaluate donation options for themselves. (I imagine a small percentage of people like that are explicitly earning-to-give, and it's more common to see people donating in the 1-10% region).</p><p>I haven't done this before, so I'm happy to be a resource in whatever manner is most useful. For example, I can provide links or short excerpts about which fund does. I can also give talks or Q&amp;As in case any employee group has an open spot.</p><p><strong>So if you are an employee in a large company that takes corporate giving or employee giving seriously, please reach out to me!</strong></p>", "parentCommentId": null, "user": {"username": "Linch"}}, {"_id": "qCctzJmLy4pTb5bWk", "postedAt": "2023-11-28T13:09:25.486Z", "postId": "Jvkx85biHHAeCiSDA", "htmlBody": "<p>You might want to reach out to the groups listed here: <a href=\"https://www.highimpactprofessionals.org/groups\">https://www.highimpactprofessionals.org/groups</a>&nbsp;<br><br>I think you'll also probably reach more of your target audience by posting things like these as quick take instead of on the Open Thread, but I'm not sure.</p>", "parentCommentId": "qudcqj6YrcrhjgnxM", "user": {"username": "Lorenzo Buonanno"}}, {"_id": "BaEvHqovXRkYPYa9K", "postedAt": "2023-11-28T17:11:04.084Z", "postId": "Jvkx85biHHAeCiSDA", "htmlBody": "<p>Hi everyone, I'm Hayven (they/them). It's nice to meet you! I'm new here, and new to Effective Altruism in general. In fact, when I first joined the forum I was still kind of skeptical of EA, but the articles, resources, and discussions here definitely sold me on the community / movement.&nbsp;<br><br>I'm a program evaluator and data analyst by trade, but my biggest professional and philosophical passion is animal rights and welfare (I see them as equivalent and inseparable). I've been vegan for 12 years now, and have done some advocacy and activism for animal rights. In all that time, I saw very little of what might be called a \"rational approach\" to animal advocacy. Our activism was about convincing individuals to stop consuming animal products out of personal compassion. This is a good thing, I think, but the problem is that arguments appealing to compassion will only appeal to the already compassionate. If someone just doesn't care about the animals, all the vegan arguments in the world won't convince them.&nbsp;<br><br>Then I found the EA community, and saw that you were taking concrete, evidence-based actions to improve the lives of animals. Advancing rational arguments for their welfare, funding animal welfare initiatives and cellular agriculture, trying to get relevant laws changed--these are things that will have a much bigger impact for non-human sentient lives than bolt-cutting and handing out flyers ever will. Everything else I've seen so far in EA, from the focus on AI safety to the inclusive, kind community, tells me I've made the right decision to join up and help make the world a better place.&nbsp;<br><br>Outside of work and activism, I'm really into reading (especially fantasy-adventure and sci-fi novels and manga), hiking, cooking, language-learning, and travel. I have no kids, two cats, and sometimes rescue animals, too. My favorite thing to do on a cold winter's day is to cross-country ski, then sit inside with a coffee and a good book.&nbsp;<br><br>Anyway, it's lovely to meet you all, and I look forward to contributing to the Forum and the EA community as a whole.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Hayven Jackson"}}, {"_id": "SAxEnxbsvpPrdh76J", "postedAt": "2023-11-28T18:00:17.422Z", "postId": "Jvkx85biHHAeCiSDA", "htmlBody": "<p>Hello David, nice to meet you and welcome! I'm also pretty new here, and am also concerned with AI safety, primarily the alignment problem and mitigating existential risk. You'll find a lot of interesting discussions around here, stick around, read, and contribute.&nbsp;</p>", "parentCommentId": "DWnp5M9Mp2tcjFbRw", "user": {"username": "Hayven Jackson"}}, {"_id": "yvjemjtr9btDKNfZb", "postedAt": "2023-11-28T18:05:35.465Z", "postId": "Jvkx85biHHAeCiSDA", "htmlBody": "<p>Hello Chase, and welcome. I'm also new here, and was convinced to join EA due to its commitments around existential risk and animal advocacy. Nuclear war is one of our biggest x-risks, and even without a full nuclear exchange war is unbelievably destructive. I look forward to reading your posts here on nuclear security and x-risk as a whole.&nbsp;</p>", "parentCommentId": "yESLwt8me8P5uhja3", "user": {"username": "Hayven Jackson"}}, {"_id": "2yWoeXAdu4wYARKof", "postedAt": "2023-11-28T18:11:45.127Z", "postId": "Jvkx85biHHAeCiSDA", "htmlBody": "<p>Hello Chukwubuikem, and thank you for your advocacy for animal and human rights in Nigeria and throughout Africa! It's so sad to me that our societies tend to pit human and animal rights against each other, as if an increase in one leads to a decrease in another. This is such a wrong approach, because morality, equality and liberation are not zero-sum games. Human rights increasing helps animals, and vice versa--all sentient beings are better in a world where we respect each other's existence.&nbsp;</p>", "parentCommentId": "tAmks4qyAeBdDY7Pp", "user": {"username": "Hayven Jackson"}}, {"_id": "3hnyCnDYnnyravaFe", "postedAt": "2023-11-29T15:48:54.415Z", "postId": "Jvkx85biHHAeCiSDA", "htmlBody": "<p>have you heard of the rob miles ai discord ? i joined it .</p>", "parentCommentId": "SAxEnxbsvpPrdh76J", "user": {"username": "David turner"}}, {"_id": "je42DkBJKB6no82mA", "postedAt": "2023-11-30T00:20:40.628Z", "postId": "Jvkx85biHHAeCiSDA", "htmlBody": "<p>I haven't, but I don't really use social media.&nbsp;</p>", "parentCommentId": "3hnyCnDYnnyravaFe", "user": {"username": "Hayven Jackson"}}, {"_id": "zxehvqMcQXANEJqXq", "postedAt": "2023-12-03T12:18:47.973Z", "postId": "Jvkx85biHHAeCiSDA", "htmlBody": "<p>it is good social media to me .&nbsp;</p>", "parentCommentId": "je42DkBJKB6no82mA", "user": {"username": "David turner"}}, {"_id": "BT6dXruufgAyyakkf", "postedAt": "2023-12-03T13:06:52.444Z", "postId": "Jvkx85biHHAeCiSDA", "htmlBody": "<p>I might give it a chance! I’ve just had some awful experiences with social media drama before.</p>\n", "parentCommentId": "zxehvqMcQXANEJqXq", "user": {"username": "Hayven Jackson"}}, {"_id": "XzHxSWLhkPx2W3X8x", "postedAt": "2023-12-03T15:57:15.601Z", "postId": "Jvkx85biHHAeCiSDA", "htmlBody": "<p>alrighty .</p>", "parentCommentId": "BT6dXruufgAyyakkf", "user": {"username": "David turner"}}, {"_id": "7DoL3CJw49t4WwFHu", "postedAt": "2023-12-04T09:36:31.120Z", "postId": "Jvkx85biHHAeCiSDA", "htmlBody": "<p>Yup im new here how is it going for everyone here</p>", "parentCommentId": null, "user": {"username": "josefpanther"}}, {"_id": "YmH2jCmbNM6HmrNwy", "postedAt": "2023-12-04T19:30:16.151Z", "postId": "Jvkx85biHHAeCiSDA", "htmlBody": "<p>Is anyone else here from a small town or rural area? Also, did anyone else graduate from a lesser-known, more rural college?</p>\n<p>I’m trying to get more involved in the EA community (beyond just the Forum) but it seems like everyone lives in a big city on one of the coasts, or in urban areas in other parts of the world. What do you recommend for someone like me, who lives in what’s effectively ‘the middle of nowhere?’ I’m more than willing to travel to bigger places to go to events and so on (Boston is the closest major metro to me). Moving to a big city really isn’t an option.</p>\n<p>I know Effective Altruism as a philosophy originated at Oxford and caught on in Silicon Valley, but as an EA I affirm that it’s relevant for all people regardless of where we live. We can apply evidence-based practices to do the most good in rural areas and at smaller colleges, too.</p>\n", "parentCommentId": null, "user": {"username": "Hayven Jackson"}}, {"_id": "hY9iCy4NFzbRxCosa", "postedAt": "2023-12-08T15:41:38.657Z", "postId": "Jvkx85biHHAeCiSDA", "htmlBody": "<p>Hi everyone,<br><br>I wasn't sure this should be an entire post (Topics: AI, governance, survey):<br>We are inviting you to take part in a research <a href=\"https://vuamsterdam.eu.qualtrics.com/jfe/form/SV_8e17UYJxy8mP6XI\">study</a> which<a href=\"https://www.pourdemain.ch/\"> Pour Demain</a> and the<a href=\"https://vu.nl/nl\"> Vrije Universiteit Amsterdam</a> are conducting on development-phase risk assessments for AI systems. The link to the study is <a href=\"https://vuamsterdam.eu.qualtrics.com/jfe/form/SV_8e17UYJxy8mP6XI\">here</a>. <i>The survey will close on the 12th December 2023 at 23:59 CET.&nbsp;</i></p><p>You can pick a time <a href=\"https://calendly.com/max-alan-miller/30min\">here</a> to do the survey so you don't have to remember/use up your mental RAM (this creates a calendar event for you).</p><p><strong><u>About:</u></strong></p><p>As you may know, the majority of a group of experts recently surveyed by Schuett et al. <a href=\"http://arxiv.org/abs/2305.07153\">indicated </a>that conducting a development-phase risk assessment is an important practice for AI labs.&nbsp;</p><p><strong>Our study aims to better understand how development-phase risk assessments could be carried out in practice and what they would reveal</strong>. This will inform Pour Demain's contribution to standard setting for the EU AI Act.&nbsp;</p><p>The study involves participating in an up to 30-minute creative exercise to identify and analyze potential risks. To minimise time requirements, <strong>we recommend doing this with a keyboard/voice-typing. </strong>There are no right or wrong answers - the goal is simply to generate ideas and think through different risk scenarios.<br><i>For every participant we're donating a contribution to charity (also giving more you spend longer, to show this doesn't go by unseen!).</i><br>We greatly appreciate you taking the time to support this research. <strong>We would further be very grateful if you would forward this survey to three other experts in your network who you think have something to contribute on the topic.</strong></p>", "parentCommentId": null, "user": {"username": "miller-max"}}, {"_id": "rGfWF4CzmbhQeMBPv", "postedAt": "2023-12-09T09:32:38.172Z", "postId": "Jvkx85biHHAeCiSDA", "htmlBody": "<p>A few quick things I would recommend (if you haven't already done them):</p><ol><li>Check out the <a href=\"https://forum.effectivealtruism.org/groups#individuals\">map of community members</a> to see if there are any people near you.</li><li>See if there are any <a href=\"https://forum.effectivealtruism.org/groups#online\">online groups</a> that interest you - in particular, I would check out <a href=\"https://www.effectivealtruismanywhere.org/\">EA Anywhere</a>.</li><li>I've done both the introductory and in-depth <a href=\"https://www.effectivealtruism.org/virtual-programs\">EA Virtual Programs</a> and I found them really helpful for me to learn and engage with EA ideas. The readings were great and I had some interesting discussions with my cohorts, plus kept in touch with some of them afterward! :)</li><li>Since you are near Boston, I suggest you join the <a href=\"https://www.facebook.com/groups/1552072601751317\">Boston Effective Altruism</a> Facebook group. In particular, I know people have come from other nearby states to join the \"Dinner and discussion\" events, and you'll meet a pretty good mix of people there.</li></ol>", "parentCommentId": "YmH2jCmbNM6HmrNwy", "user": {"username": "syc"}}, {"_id": "JEdLimZwnpg2jLQ7D", "postedAt": "2023-12-09T13:03:16.520Z", "postId": "Jvkx85biHHAeCiSDA", "htmlBody": "<p>Thanks so much, Sarah! This is a big help for me in getting started with the community.</p>\n<p>A quick question—is there any way to connect with the Boston EA group other than Facebook? I deleted all social media years ago and would rather not get back into it.</p>\n", "parentCommentId": "rGfWF4CzmbhQeMBPv", "user": {"username": "Hayven Jackson"}}, {"_id": "YZBD4kvrCczKM6qtJ", "postedAt": "2023-12-10T12:56:32.767Z", "postId": "Jvkx85biHHAeCiSDA", "htmlBody": "<p>Thanks, I've added both to the mindmap: tinyurl.com/eamindmap, putting ImpactCoLabs on the top.&nbsp;</p>", "parentCommentId": "nDuZJADtqkhnSC2FA", "user": {"username": "mardevis"}}, {"_id": "hP7ztDjiccsbSuRLL", "postedAt": "2023-12-11T11:42:39.542Z", "postId": "Jvkx85biHHAeCiSDA", "htmlBody": "<p>Glad it was helpful! :) Unfortunately the Facebook group is the most active Boston EA space. The <a href=\"https://www.eaboston.org/\">group website</a> looks quite outdated, but I think you can still get notified of events via the <a href=\"https://groups.google.com/g/boston-effective-altruists\">email list</a>, so I would recommend joining that.</p>", "parentCommentId": "JEdLimZwnpg2jLQ7D", "user": {"username": "syc"}}, {"_id": "AbZbnoHiqNwWT4uuo", "postedAt": "2023-12-11T14:41:41.411Z", "postId": "Jvkx85biHHAeCiSDA", "htmlBody": "<p>Thanks so much! I’ve joined the email list, and might create an account for the FB group. Social media can just be so toxic, though.</p>\n", "parentCommentId": "hP7ztDjiccsbSuRLL", "user": {"username": "Hayven Jackson"}}, {"_id": "mqu5qJFPfHexSbtXB", "postedAt": "2023-12-13T16:19:51.128Z", "postId": "Jvkx85biHHAeCiSDA", "htmlBody": "<p>Hi again!<br>&nbsp;</p><p>A quick heads-up to say we're <strong><u>extending the survey until the 15th December 23:59</u></strong> if ever you get the time until then.&nbsp;<br>Thanks again<br>&nbsp;</p>", "parentCommentId": "hY9iCy4NFzbRxCosa", "user": {"username": "miller-max"}}, {"_id": "7Q6a2aX7ia2paioY8", "postedAt": "2023-12-17T00:38:05.728Z", "postId": "Jvkx85biHHAeCiSDA", "htmlBody": "<p>Hi Hayven,</p>\n<p>I received your message with much warmth and satisfaction. It is pleasing that my work is being appreciated. I will continue the fight to create equality between Animal and Human Rights.\nI look forward to connecting with you.</p>\n", "parentCommentId": "2yWoeXAdu4wYARKof", "user": {"username": "Chukwubuikem Daniel Oyiga"}}, {"_id": "Q2wvB5mFJqErZAt6h", "postedAt": "2023-12-18T03:34:29.923Z", "postId": "Jvkx85biHHAeCiSDA", "htmlBody": "<p>Nice intro.\nVery rightly said that vegan advocacy works well only to those who are already compassionate.\nCan you please elaborate some more how EA programs differ from normal animal advocacy programs. animal advocacy is part of the EA movement anyway.</p>\n", "parentCommentId": "BaEvHqovXRkYPYa9K", "user": {"username": "Vegan banjo"}}, {"_id": "d2zLTRQaNbwwrLiJL", "postedAt": "2023-12-20T01:17:34.080Z", "postId": "Jvkx85biHHAeCiSDA", "htmlBody": "<p>Not sure if someone already brought up these issues, but I noticed a few bugs in the forum:</p><ul><li>Karma notifications don't reliably clear up after I check them, or even when I click on the comments in the notifications. Most of the time, it seems to take 3-4 refreshes for the notifications to clear up.</li><li>The \"See in context\" button that appears when you access a comment via its permalink wasn't working reliably for a while, making it almost impossible to find some comment threads in <a href=\"https://forum.effectivealtruism.org/posts/H4DYehKLxZ5NpQdBC/nonlinear-s-evidence-debunking-false-and-misleading-claims\">this post</a>. This seems to have been fixed, but I'm not sure if it was a reliable fix or if it's just flaky.</li><li>When you click on \"comments\" at the top of your post, it doesn't take you to the comment section, but to the last few paragraphs of the post, so you have to scroll down a bit more to see the comments.</li><li>Today I tried to post <a href=\"https://forum.effectivealtruism.org/posts/bwtpBFQXKaGxuic6Q/effective-aspersions-how-the-nonlinear-investigation-went?commentId=XxHBHMhrnK5Md9b4q\">a comment</a> and it was <a href=\"https://forum.effectivealtruism.org/posts/bwtpBFQXKaGxuic6Q/effective-aspersions-how-the-nonlinear-investigation-went?commentId=4awxBxziTfCqHaNAj\">posted twice</a>.</li></ul>", "parentCommentId": null, "user": {"username": "Fermi–Dirac Distribution"}}, {"_id": "vWpCBBTcYhfhrq6XS", "postedAt": "2023-12-20T03:06:15.043Z", "postId": "Jvkx85biHHAeCiSDA", "htmlBody": "<blockquote><p>The \"See in context\" button that appears when you access a comment via its permalink wasn't working reliably for a while, making it almost impossible to find some comment threads in <a href=\"https://forum.effectivealtruism.org/posts/H4DYehKLxZ5NpQdBC/nonlinear-s-evidence-debunking-false-and-misleading-claims\">this post</a>. This seems to have been fixed, but I'm not sure if it was a reliable fix or if it's just flaky.</p></blockquote><p>It doesn't work reliably when it's linking to comments that are hidden behind a collapsed comment (usually because that comment is downvoted). This does seem kind of bad and has been bothering me for years.</p>", "parentCommentId": "d2zLTRQaNbwwrLiJL", "user": {"username": "Habryka"}}, {"_id": "xqvzc4Gzb6duAvqpa", "postedAt": "2023-12-26T14:55:05.462Z", "postId": "Jvkx85biHHAeCiSDA", "htmlBody": "<p>Hi there! I'm sorry that I didn't sae this earlier (the holiday season has been extremely busy for me!). To answer your question (\"how do EA animal advocacy programs differ from typical vegan advocacy organizations' initiatives?\"), there are three main differences (and one minor thing to keep in mind):&nbsp;</p><ol><li>EA animal welfare advocacy isn't necessarily focused on total animal liberation in the immediate term -- although animal liberation is absolutely our ultimate goal. Because EA is based on utilitarian ethics (in a nutshell, utilitarianism is the moral claim that the greatest practical good should be done for the greatest number of moral patients [sentient beings]), we believe <i>any</i> improvement to sentient beings' quality of life is a good thing, and to cause it is a moral imperative. Therefore, EA animal initiatives focus on things like eliminating abusive animal agriculture practices like cages and maceration in egg production, in addition to reducing animal product use worldwide.&nbsp;</li><li>EA also has a long-term focus, so our animal initiatives fund technologies that show strong probabilities of reducing animal exploitation in the future (e.g., lab-grown meat and dairy, cellular agriculture more broadly), even if such interventions have little immediate impact.&nbsp;</li><li>More broadly, EA animal charities (like all EA programs) focus on <i>evidentiary support</i>. Our initiatives are constantly measured against qualitative and quantitative data to ensure they are meeting their goals -- and if they aren't, they are defunded and scrapped. In many non-EA charities, ineffective programs may be retained simply for sentimental or pecuniary reasons.&nbsp;</li><li>This is a minor point, but the majority of EA members / practitioners are vegans or are vegetarian and working toward veganism. Aside from vegan activism itself, there is no other social movement, community, or philosophy in the Western world* that is so pro-vegan and pro-animal as Effective Altruism. That means a lot to me.<br><br>*in the East, Jainism and many forms of Buddhism are equally pro-animal and anti-carnism</li></ol><p>I hope this answers your questions! I'm not one of those EAs who believes the movement is flawless or without fault, and there are things I wish EA animal welfare would do differently (like placing abolitionism of animal exploitation at the center of its goals), but on the whole I strongly believe EA initiatives do the most good for the animals, when compared to non-EA large-scale vegan programs.&nbsp;</p><p>Regardless of what you conclude about EA, thank you for standing up for our marginalized sentient siblings -- it means so much. Have a fabulous holiday season! :)&nbsp;</p>", "parentCommentId": "Q2wvB5mFJqErZAt6h", "user": {"username": "Hayven Jackson"}}, {"_id": "97cgQsRH45xCjG9tB", "postedAt": "2023-12-26T18:37:25.222Z", "postId": "Jvkx85biHHAeCiSDA", "htmlBody": "<p>Hi! I'm Josh. I occasionally blog at https://axiologyandchatter.com/ and have been in the LW/SSC/etc-sphere since maybe 2010 or 2011. I'm trying to be a good person. I try to give as much as I can to highly efficient charities, which (back when I was involved with EA twitter) is very controversial, although I couldn't quite guess why. I consider myself Christian, although it's not clear to me how I'd know if I was doing it right. I've been enjoying biking lately. :)&nbsp;</p>", "parentCommentId": null, "user": {"username": "Treatment Tophat"}}, {"_id": "LiSKB62vPBTicxRa4", "postedAt": "2023-12-28T21:02:20.204Z", "postId": "Jvkx85biHHAeCiSDA", "htmlBody": "<p>Hi everyone.</p>\n<p>I am Miryam Shangheta from Namibia, Africa. I found out about EA in July 2023 through Charity Entrepreneurship website. I want actually looking for funders to fund my charity that I am working towards to found. I want to start a charity that donates sanitary pads to school going girls per month. I am still stuck because I do not have funds to kick start. I am looking for advices from this community.</p>\n<p>Thank you in advance.</p>\n", "parentCommentId": null, "user": {"username": "Miryam Keshityeni Shangheta "}}, {"_id": "jCrQbWhdHMP8swEzH", "postedAt": "2023-12-31T22:08:59.169Z", "postId": "Jvkx85biHHAeCiSDA", "htmlBody": "<p>Are there any ways you can volounteer in person for effective charities? Understanding it may not be technically the most effective use of resources but it would be great to get some in person experience. I imagine it will really help improve my long run commitment to doing good.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Lachlan Earnshaw"}}, {"_id": "Zg24MRCZEkvWREq6d", "postedAt": "2024-01-02T04:54:52.033Z", "postId": "Jvkx85biHHAeCiSDA", "htmlBody": "<p>I'm not sure how many volunteer opportunities like this there are, but I'd check the <a href=\"https://ea-internships.pory.app/\">EA Opportunity Board</a>, which collects \"everything short of permanent positions\" (see <a href=\"https://airtable.com/apprblz2BpfFkRgdt/shro2Y1I4UbVpVKxP/tblbC7nLDiIv6TNQb\">Airtable</a> — the normal interface seems broken for me right now). You should be able to filter \"opportunity type\" for volunteering, and \"location filter\" by whatever works for you (or <i>not</i> remote). (See also the <a href=\"https://jobs.80000hours.org/\">80K job board</a>, which doesn't tend to focus on volunteer opportunities.)&nbsp;</p><p>You might also be interested in exploring <a href=\"https://forum.effectivealtruism.org/events\">events</a>.</p>", "parentCommentId": "jCrQbWhdHMP8swEzH", "user": {"username": "Lizka"}}, {"_id": "6uns4W6apw9CwmFBo", "postedAt": "2024-01-07T06:29:21.489Z", "postId": "Jvkx85biHHAeCiSDA", "htmlBody": "<p>Welcome! If funding's a main concern, it's worth investigating the feasibility and cost of sanitary product options that may cost less than pads (image from <a href=\"https://blog.seedly.sg/period-cost-menstruation/\">https://blog.seedly.sg/period-cost-menstruation/</a>)<br><br><img style=\"width:68.23%\" src=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/6uns4W6apw9CwmFBo/rymzs6bsvgksyngttgc8\"><br><br>I found an organization that partners with local African communities to distribute menstrual cups (including in neighboring South Africa already):<br><a href=\"https://www.thecovaproject.com/\">https://www.thecovaproject.com/</a></p>", "parentCommentId": "LiSKB62vPBTicxRa4", "user": {"username": "Pat Myron"}}, {"_id": "mLQmxtHoxCdL6JPB6", "postedAt": "2024-01-08T20:15:20.879Z", "postId": "Jvkx85biHHAeCiSDA", "htmlBody": "<p>Hi</p>\n<p>UK based, 60 odd years old. Academic background in Latin and Greek. I try to be altruistic and effective about it. Have travelled a lot in Africa and mainly donate to Sightsavers (eye ops on African children). Huge interest in AI theory and the possibility of machine self awareness.</p>\n", "parentCommentId": null, "user": {"username": "AeliusNicon"}}, {"_id": "DxWEno6ghtrxCToG7", "postedAt": "2024-01-08T22:08:58.510Z", "postId": "Jvkx85biHHAeCiSDA", "htmlBody": "<p>Just out of curiosity — why Latin and Greek? The only people I know that studied those two languages (+ Hebrew) did so for religious reasons, and have derived very interesting insights as a result.</p>\n<p>Also, welcome! :-)</p>\n", "parentCommentId": "mLQmxtHoxCdL6JPB6", "user": {"username": "MintSnap"}}, {"_id": "XycEF3AS3cQPQ638c", "postedAt": "2024-01-09T12:12:43.783Z", "postId": "Jvkx85biHHAeCiSDA", "htmlBody": "<p>Welcome Josh! Have you heard of <a href=\"https://www.eaforchristians.org/\">EA for Christians</a>? I also just spotted that there is a <a href=\"https://christandcounterfactuals.substack.com/\">Christian/EA community blog</a> that you may enjoy.&nbsp;</p>", "parentCommentId": "97cgQsRH45xCjG9tB", "user": {"username": "tobytrem"}}, {"_id": "6SyTvwFvZmAqacLii", "postedAt": "2024-03-10T07:59:24.518Z", "postId": "Jvkx85biHHAeCiSDA", "htmlBody": "<p>Thank you so much Pat.</p>\n", "parentCommentId": "6uns4W6apw9CwmFBo", "user": {"username": "Miryam Keshityeni Shangheta "}}]