[{"_id": "ZaJRswqZAvGTFQ3PE", "postedAt": "2022-11-16T03:22:07.683Z", "postId": "JWBhv5EfHyQoFd6SL", "htmlBody": "<p>I believe there is a real opportunity to come out stronger if EA demonstrates it has learned a prioritization lesson by doing its part to make the financial fraud victims whole before returning to its regular program. &nbsp;Correct me if I'm wrong, but if the EA community returns to victims an amount totaling twice the amount they received from FTX, would that be a historical first?</p><p>(And I don't expect unconditional return of FTX grant money when it's not legally required. &nbsp;Search your own heart; if you are not guilty of contempt for the greater fools that FTX thought it was profiting off of, I see no moral obligation.)</p><p>As for reasoning, I'd like to call attention to the first paragraph of <a href=\"https://www.lesswrong.com/posts/BZ6XaCwN4QGgH9CxF/the-kelly-criterion?commentId=3JEaWCYG2B5ocBJg7\">https://www.lesswrong.com/posts/BZ6XaCwN4QGgH9CxF/the-kelly-criterion?commentId=3JEaWCYG2B5ocBJg7</a> , especially the last sentence.</p>", "parentCommentId": null, "user": null}, {"_id": "h4eF25EoMy3uRAmev", "postedAt": "2022-11-16T03:33:56.178Z", "postId": "JWBhv5EfHyQoFd6SL", "htmlBody": "<p>Thanks for writing this! I want to push back a bit. There's a big middle ground between (i) naive, unconstrained welfare maximization and (ii) putting little to no emphasis on how much good one does. I think \"do good, using reasoning\" is somewhat too quick to jump to (ii) while passing over intermediate options, like:</p>\n<ul>\n<li>\"Do lots of good, using reasoning\" (roughly as in <a href=\"https://forum.effectivealtruism.org/posts/RnqFdWhEqHTnfKK52/clarifying-the-core-of-effective-altruism\">this post</a>)</li>\n<li>\"be a good citizen, while ambitiously working towards a better world\" (as in <a href=\"https://forum.effectivealtruism.org/posts/mCCutDxCavtnhxhBR/some-comments-on-recent-ftx-related-events\">this post</a>)</li>\n<li>\"maximize good under constraints or with constraints incorporated into the notion of goodness\"</li>\n</ul>\n<p>There are lots of people out there (e.g. many researchers, policy professionals, entrepreneurs) who do good using reasoning; this community's concern for scope seems rare, important, and totally compatible with integrity. Given the large amounts of good you've done, I'd guess you're sympathetic to considering scope. Still, it seems important enough to include in the tagline.</p>\n<p>Also, a nitpick:</p>\n<blockquote>\n<p>now it's obvious that the idea of maximizing goodness doesn't work in practice--we have a really clear example of where trying to do that fails (SBF if you attribute pure motives to him); as well as a lot of recent quotes from EA luminaries saying that you shouldn't do that</p>\n</blockquote>\n<p>This feels a bit fast; the fact that this example had to include a (dubious) \"if\" clause means it's not a really clear example, and maximizing goodness is compatible with constraints if we incorporate constraints into our notion of goodness (just by the fact that <a href=\"https://www.alignmentforum.org/posts/NxF5G6CJiof6cemTw/coherence-arguments-do-not-entail-goal-directed-behavior\">any behavior can be thought of as maximizing some notion of goodness</a>).</p>\n<p>(Made minor edits.)</p>\n", "parentCommentId": null, "user": {"username": "Mauricio"}}, {"_id": "tXTeLFbbJLLP3qKwF", "postedAt": "2022-11-16T05:18:47.895Z", "postId": "JWBhv5EfHyQoFd6SL", "htmlBody": "<p>Do you mean that FTX grantees should attempt to make the victims whole by paying the amount they received from FTX back to the estate, or that \"EA\" at large - so organizations and people with no relation to FTX, but who consider themselves \"EA\" - should do so?</p>", "parentCommentId": "ZaJRswqZAvGTFQ3PE", "user": {"username": "Vivian.Lwd"}}, {"_id": "9nHNiXSo8Kiy9tmeC", "postedAt": "2022-11-16T17:23:03.535Z", "postId": "JWBhv5EfHyQoFd6SL", "htmlBody": "<p>Thanks for writing!</p>\n<p>To be clear, I don't think we as a community should be scope insensitive. But here's the FAQ I would write about this...</p>\n<ul>\n<li>Q: does EA mean I should only work on the most important cause areas?\n<ul>\n<li>no! being in EA means you choose to do good with your life, and think about those choices. We hope that you'll choose to improve your life / career / donations in more-altruistic ways, and we might talk with you and discover ideas for making your altruistic life even better.</li>\n</ul>\n</li>\n<li>Q: does EA mean I should do or support [crazy thing X] to improve the world?\n<ul>\n<li>Probably not: if it sounds crazy to you, trust your reasoning! However, EA is a big umbrella and we're nurturing lots of weird ideas; some ideas that seem crazy to one person might make sense to another. We're committed to reasoning about ideas that might actually help the world even if they sound absurd at first. Contribute to this reasoning process and you might well make a big impact.</li>\n</ul>\n</li>\n<li>Q: does ea's \"big umbrella\" mean that I should avoid criticizing people for not reaching their potential or doing as much good as I think they could do?\n<ul>\n<li>This is very nuanced! You'll see lots of internal feedback and criticism in EA spaces. We do have a norm against loudly and unsolicitedly critiquing people's plans for not doing enough good, but this is overridden in cases where a) the person has asked for the feedback first or b) the person making the critique has a deep and nuanced understanding of the existing plan, as well as a strong relationship with the recipient of the feedback. Our advice, if you see something you want to critique, is to ask if they want feedback before offering.</li>\n</ul>\n</li>\n<li>Q: what about widely-recommended canonical public posts listing EA priorities, implicitly condemning anything that's not on the priority list?\n<ul>\n<li>...yeah this feels like a big part of the problem to me. I think it makes sense to write up a standard disclaimer for such posts, saying \"there's lots of good things not on this list\" (GiveWell had something like this for a while I think?) but I don't know if it is enough.</li>\n</ul>\n</li>\n<li>Q: So is EA scope sensitive or not?\n<ul>\n<li>We are definitely scope sensitive. One of the best ways that reasoning can help figure out how to make the world better is by comparing different things, putting numbers on stuff, and/or figuring out other reasons why path A is better than path B.</li>\n</ul>\n</li>\n</ul>\n", "parentCommentId": "h4eF25EoMy3uRAmev", "user": {"username": "lincolnq"}}, {"_id": "2boEuMfW7PAxoqF94", "postedAt": "2022-11-16T21:11:39.560Z", "postId": "JWBhv5EfHyQoFd6SL", "htmlBody": "<p>There's going to be a lot of suggestions for how to improve EA. For sake of organisation, it would be nice if you choose a title that says something specific about the nature of the improvement, e.g. \"Suggested change: broaden to doing good using reasoning\". Whereas the current title is really only one possible consequence of that change.</p>", "parentCommentId": null, "user": {"username": "RyanCarey"}}, {"_id": "gvLHsEEALzg5LYKof", "postedAt": "2022-11-17T03:11:01.545Z", "postId": "JWBhv5EfHyQoFd6SL", "htmlBody": "<p>I like this comment, but also genuinely think that this Q&amp;A would indicate that EA had lost a lot of what I think makes it valuable, and I would likely be much less interested in being engaged.</p>", "parentCommentId": "9nHNiXSo8Kiy9tmeC", "user": {"username": "Habryka"}}, {"_id": "e5CqotgkKbRNoJfqK", "postedAt": "2022-11-17T03:15:37.656Z", "postId": "JWBhv5EfHyQoFd6SL", "htmlBody": "<p>Useful input. Can you give a bit more color about your feelings? In particular whether this is a disagreement with the core direction being proposed vs. just something I wrote down that seems off? (if the latter - i wrote this quickly trying to give a gist so not surprised. if the former i'm more surprised and interested in what I am missing.)</p>\n", "parentCommentId": "gvLHsEEALzg5LYKof", "user": {"username": "lincolnq"}}, {"_id": "sWukdGHFzd2v7RAq7", "postedAt": "2022-11-17T07:37:57.886Z", "postId": "JWBhv5EfHyQoFd6SL", "htmlBody": "<p>I am not fully sure, and it's a bit late. Here are some thoughts that came to mind on thinking more about this:&nbsp;</p><p>I think I do personally believe if you actually think hard about the impact, few things matter, and also that the world is confusing and lots of stuff turns out to be net-negative (like, I think if you take AI X-risk seriously a lot of stuff that seemed previously good in terms of accelerating technological progress now suddenly looks quite bad).&nbsp;</p><p>And so, I don't even know whether a community that just broadly encourages people to do things that seem ambitious and good ends up net-positive for the world, since the world does indeed strike me as the kind of place that has lots of crucial considerations that suddenly invert the sign on various things, and I am primarily excited about EA as a place that can collectively orient towards those crucial considerations and create incentives and systems that align with those crucial considerations.&nbsp;</p><p>I am also separately excited about a community that just helps people reason better, but indeed one of the key things I would try to get across in such a community is the contingency of the goodness of various actions in the world, and that the world is confusing and heavy-tailed. Making for a world where you really have to make the right decisions, or you might very well end up having caused great harm, or ended up missing out on extremely great benefits. &nbsp;</p>", "parentCommentId": "e5CqotgkKbRNoJfqK", "user": {"username": "Habryka"}}, {"_id": "DfJpQvg9acC4etp4E", "postedAt": "2022-11-17T15:57:23.721Z", "postId": "JWBhv5EfHyQoFd6SL", "htmlBody": "<p>Useful perspective. (I'm excited about this debate because I think you're wrong, but feel free to stop responding anytime obviously! You've already helped me a ton, to clarify my thoughts on this.)</p>\n<p>First, what I agree with: I am excited by your last paragraph - my ideal EA community also helps people reason better, and the topics you listed definitely seem like part of the 'curriculum'. I only think it needs to be introduced gently, and with low expectations (e.g. in my envisioned EA world, the ~bottom 75% of engaged EAs will probably not change their careers).</p>\n<p>I even agree with this:</p>\n<blockquote>\n<p>EA is a place that can collectively orient towards those crucial considerations and create incentives and systems that align with those crucial considerations</p>\n</blockquote>\n<p>I have two main disagreements:</p>\n<ol>\n<li>most stuff that seems good is good</li>\n<li>siphoning people into AI without supporting the ones left behind leaves behind a hollow, inauthentic movement</li>\n</ol>\n<h2>Most stuff that seems good is good</h2>\n<p>You wrote:</p>\n<blockquote>\n<p>lots of stuff turns out to be net-negative</p>\n</blockquote>\n<p>I don't really agree with this, but I don't really expect to make much progress in a debate. I interpret this as you being generally against 'progress studies' also? I have pretty low priors on someone thinking they are working on something useful/innovative/altruistic, and then putting a lot of thought/effort behind it, and it ending up net negative.</p>\n<h2>Siphoning people into AI</h2>\n<p>A thing that I perceive is: EA is an important onramp into AI safety stuff. (How does this work? EA is broadly acceptable, incontrovertible - it gets a lot of people talking about it positively. Then the EA onboarding process is shaped to attracting and identifying people good at working on weird ideas, and pushes those people into AI.)</p>\n<p>(To be clear, I may be misinterpreting you - you didn't say this explicitly but I kind of get it from the \"orient towards those crucial considerations\" thing and so I'm addressing it directly.)</p>\n<p>This is an ok thing to do on its own, and I think is a valid reason-to-exist of the community. But not the only one! I don't think it will work in the long run without the community being able to exist on its own, independently of being a feeder into important projects. It has worked for a while \"under the radar\" of the recruitment process. I expect this to stop working for various reasons.</p>\n<p>One major point of the changes I'm proposing is to make that more explicit, and one optional way that people can engage with EA.</p>\n", "parentCommentId": "sWukdGHFzd2v7RAq7", "user": {"username": "lincolnq"}}, {"_id": "tswRGqZGPETQhkekF", "postedAt": "2022-11-21T06:05:46.693Z", "postId": "JWBhv5EfHyQoFd6SL", "htmlBody": "<p>Can you say a bit more about what you think EA has lost that makes it valuable?</p>", "parentCommentId": "gvLHsEEALzg5LYKof", "user": {"username": "Evan R. Murphy"}}]