[{"_id": "aGC8XFp7edRWAjwY7", "postedAt": "2023-10-06T19:50:56.596Z", "postId": "JWuPdMaPiNy7AD3AX", "htmlBody": "<p>My understanding is that screwworm eradication in North America has been treated by wild animal welfare researchers as a sort of paradigmatic example of what wild animal welfare interventions could look like, so I think it is on folks' radar. And, as Kevin mentions, <a href=\"https://www.vice.com/en/article/qjk8kd/uruguay-cryogenically-frozen-screwworm-fly\">it looks like Uruguay is working on this now</a> with hopes of turning it into a regional campaign across South America.</p><p>I'm guessing one of the main reasons there hasn't been more uptake in promoting this idea is general uncertainty — both about the knock-on effects of something so large scale, and about whether saving the lives of animals who would have died from screwworm really results in higher net welfare for those animals (in many cases it's probably trading off an excruciating death now for a painful death later with added months or years of life in-between that may themselves be net-negative). So I do think it's a big overstatement for the guest to suggest that eradicating screwworm would be two orders of magnitude better than preventing the next 100 years of factory farming, which basically assumes that the wild animal lives saved directly trade-off (positively) against the (negative) lives of farmed animals.</p><p><a href=\"https://forum.effectivealtruism.org/users/saulius?mention=user\">@saulius</a> might know more about this. One quote from <a href=\"https://forum.effectivealtruism.org/posts/saEQXBgzmDbob9GdH/why-i-no-longer-prioritize-wild-animal-welfare#There_seem_to_be_no_cost_effective_interventions_to_pursue_now\">a recent post</a> of his: \"To my surprise, most WAW researchers that I talked to agreed that we’re unlikely to find WAW interventions that could be as cost-effective as farmed animal welfare interventions within the next few years.\"</p>", "parentCommentId": null, "user": {"username": "Tyler Johnston"}}, {"_id": "Po7ezsBHpewSnpuxs", "postedAt": "2023-10-07T16:56:02.060Z", "postId": "JWuPdMaPiNy7AD3AX", "htmlBody": "<p>Interesting point, that what's at stake here is <em>the delta</em> between an excruciating death now vs a few years of wild animal life and painful death later.</p>\n", "parentCommentId": "aGC8XFp7edRWAjwY7", "user": {"username": "Daryl D'Souza"}}, {"_id": "ghDZejSQhRfDr8CCa", "postedAt": "2023-10-08T08:52:49.845Z", "postId": "JWuPdMaPiNy7AD3AX", "htmlBody": "<p>I remember talking about screwworms with <a href=\"https://forum.effectivealtruism.org/users/kcudding?mention=user\">@kcudding</a> and <a href=\"https://forum.effectivealtruism.org/users/holly_elmore?mention=user\">@Holly_Elmore</a>, I don't know how deeply they looked into it but maybe they could comment.</p>", "parentCommentId": "aGC8XFp7edRWAjwY7", "user": {"username": "saulius"}}, {"_id": "waPTcZjHbHfdH2nNf", "postedAt": "2023-10-09T19:56:27.500Z", "postId": "JWuPdMaPiNy7AD3AX", "htmlBody": "<blockquote><p>They seem potentially important/actionable, if true!&nbsp;</p></blockquote><p>Had the same thought as you OP. It had been rattling around in my head for a few days now, so I appreciate you making this post.&nbsp;</p>", "parentCommentId": null, "user": {"username": "ElliotJDavies"}}, {"_id": "aKRmZa8AijEiWMLFZ", "postedAt": "2023-10-09T22:23:23.546Z", "postId": "JWuPdMaPiNy7AD3AX", "htmlBody": "<p>At least some chance of a less terrible death later, no? I'm really not sure what the distribution of causes of death looks like for different types of wild animal hosts</p>", "parentCommentId": "Po7ezsBHpewSnpuxs", "user": {"username": "aaronb50"}}, {"_id": "QcanL3aYE3NgB4cDp", "postedAt": "2023-10-09T22:23:41.803Z", "postId": "JWuPdMaPiNy7AD3AX", "htmlBody": "<p>I'm interested in supporting this financially (that sounds like something a rich person would say so I should clarify this would not be a ton of money lol) and possibly in other ways as well (e.g., helping set up a website)</p>", "parentCommentId": null, "user": {"username": "aaronb50"}}, {"_id": "W8jA7Gs3didjptJBD", "postedAt": "2023-10-10T01:05:25.880Z", "postId": "JWuPdMaPiNy7AD3AX", "htmlBody": "<p>Yes! The biggest issue with eradication in the US and Central America is that it has to be maintained with pretty massive international effort. It uses a non-genetic sterile male technique, which means rearing huge amount of males (which require meat and certain conditions to grow), sterilizing them with x-rays, and releasing them by helicopter over <a href=\"https://www.theatlantic.com/science/archive/2020/05/flesh-eating-worms-disease-containment-america-panama/611026/\">the line Panama/Colombia border where the eradication is maintained</a>. The US needs the cooperation of the rest of the North American countries in providing facilities and granting access to distribute the worms to keep it up, and it needed Mexico's partnership to do the initial eradication, part of which was a public health campaign to get ranchers to treat affected cattle to reduce the spread (as you can see in these <a href=\"https://www.nal.usda.gov/exhibits/speccoll/items/show/7394\">amazing comic books</a> the joint commission put out). So far it has proved too difficult to keep going through the jungles of South America to finish the job.<br><br>But using gene drives could make it could be easier. There are just all the standard concerns about using gene drives, like it affecting related species. I don't know enough about the relatives of the screw worm to know if it's a good candidate there or not.</p>", "parentCommentId": "ghDZejSQhRfDr8CCa", "user": {"username": "Holly_Elmore"}}, {"_id": "6EZSGLHqBtmyiDoyo", "postedAt": "2023-10-10T08:21:39.584Z", "postId": "JWuPdMaPiNy7AD3AX", "htmlBody": "<p>This looks like an exciting cause, but I'm not sure why we should have confidence that this screwworm can be completely eliminated in the near future. I know it has been eradicated from central America which is very impressive, but many diseases have been removed from much of the world (malaria, polio, measles, cholera etc.), yet are far from elimination. I have had a very cursory look at literature and I haven't seen a strong argument or pathway as to why eradication might be probable - maybe someone could point me to it. There are a number of reasons this might be very, very difficult</p><p>(Note that I'm a global human health guy so basing my reasoning mainly on that, so I might be missing important things here)<br><br>1. <strong>Humanities track record so far (the best way to predict the future is look at the past).</strong> Only smallpox (1980) and rindepest (2011) have been eradicated so far. This is despite billions of dollars being poured into trying to eradicate diseases like polio and guinea worm. Perhaps a parallel to screwworm l is guinea worm, which should in theory be not that hard to eradicate given that humans are the main host, yet guinea worm still infects handfuls of people and animals in multiple countries despite us successfully reducing the global burden by 99.xx percent. We may well eradicate guinea worm soon, but it seems to me an easier task than this screwworm</p><p>2. <strong>This is a tropical parasite, with North and central America at the top of the range.</strong> The distribution map looks not so dissimilar to Malaria. This means that it is likely to be harder to eradicate closer to the equator. We talk about \"shrinking the malaria map\", which means eradicating malaria from countries where it is less viable, to the south and the north of the equator. That's why southern Europe, North Africa and Southern Africa can clear out their malaria, while most of sub-saharan africa currently can't. The closer you get to the equator, the harder malaria becomes to eradicate. This may be similar<br><br><a href=\"https://www.agriculture.gov.au/biosecurity-trade/pests-diseases-weeds/animal/ead-bulletin/ead-bulletin-109\">https://www.agriculture.gov.au/biosecurity-trade/pests-diseases-weeds/animal/ead-bulletin/ead-bulletin-109</a></p><p><strong>3. The current control method is expensive</strong>, sterile flies have to be produced in the hundreds of millions over a number of years. This would have to be performed over a huge land area accross many countries. To be fair this didn't stop the USA and central America from successfully eradicating it there, so I don't think this is a dealbreaker in and of itself</p><p><strong>4. Screwworm</strong> infects many species as primary hosts, making complete eradication and surveilance much harder - especially among wild species.</p><p><a href=\"https://parasitesandvectors.biomedcentral.com/articles/10.1186/s13071-020-04499-z\">https://parasitesandvectors.biomedcentral.com/articles/10.1186/s13071-020-04499-z</a></p><p><strong>5. Political will and conflict. </strong>A LOT of countries would need to come on board and there would need to be a LOT of co-operation. <i>Would Venezuela get on board with this right now?</i> A big reason that guinea worm and polio haven't yet been eradicated, is that we lose the ability to vaccinate, treat and monitor in warzones. You would need a lot of co-operation and to have luck with lack of conflict in the region.</p><p><strong>I'm not saying we shouldn't invest a lot more money in controlling screwworm, and that we couldn't reduce the population of worms by 95% or even 99% which could be a great investment, but looking seriously at the EV of complete eradication seems premature.</strong></p>", "parentCommentId": null, "user": {"username": "NickLaing"}}, {"_id": "b36Z3PNGYjvrqMnSu", "postedAt": "2023-10-12T00:19:52.367Z", "postId": "JWuPdMaPiNy7AD3AX", "htmlBody": "<p>This really piqued my interest when I listened to the Podcast episode, but after some investigation, I was unable to verify his estimated 1 billion screwworm infections per year. I couldn’t find any estimates at all—only a study of its infection rate in a sample of pigs. Still, I think it’s a cause that STRONGLY deserves further research (namely estimates of annual screwworm infections) given its potential benefit.</p>\n", "parentCommentId": null, "user": {"username": "NicholasNicholas"}}, {"_id": "z9meQurx8uJ42E86W", "postedAt": "2023-10-12T15:06:04.246Z", "postId": "JWuPdMaPiNy7AD3AX", "htmlBody": "<p>I've made this market to help predict the likelihood:</p>\n<p><a href=\"https://manifold.markets/RobertCousineau/when-will-the-new-world-screwworm-b?r=Um9iZXJ0Q291c2luZWF1\">https://manifold.markets/RobertCousineau/when-will-the-new-world-screwworm-b?r=Um9iZXJ0Q291c2luZWF1</a></p>\n", "parentCommentId": null, "user": {"username": "Robert Cousineau"}}, {"_id": "3nDdNjwChzfD3yfdz", "postedAt": "2023-10-12T23:56:52.781Z", "postId": "JWuPdMaPiNy7AD3AX", "htmlBody": "<p>I also tried and failed to find a good source to support his claim of screwworm prevalence (and would love further research).</p>\n", "parentCommentId": "b36Z3PNGYjvrqMnSu", "user": {"username": "David Roberts"}}, {"_id": "fecBGsxRRRudFie3q", "postedAt": "2023-11-17T10:15:42.774Z", "postId": "JWuPdMaPiNy7AD3AX", "htmlBody": "<p>Uruguay is a promising place to start. the IAEA web site says that Chile is the only South American country that doesn't have a Screwworm problem. that takes care of most of Argentina's border. Success for Uruguay would make the job a bit easier for Argentina to follow. it's fun to imagine a bunch more deer and capibaras and bunnies<br><br>hopefully international cooperation and funding would be feasible, as each country that undertakes eradication presumably makes subsequent tries a bit easier, especially for neighboring countries</p><p>Island-hopping would make sense for thrift, as eradication in Puerto Rico and Curacao doesn't seem to have been as high-maintenance to keep up as eradication in Panama. IAEA web site says Cuba, DR, Haiti, Jamaica, and T&amp;T have screwworm. Islands belonging to South American countries like Colombia's San Andres and Providencia and Ecuador's Galapagos islands may also have them</p>", "parentCommentId": null, "user": {"username": "artilugio"}}, {"_id": "arv3KEDqTvXFfCgSA", "postedAt": "2023-10-10T08:19:22.425Z", "postId": "JWuPdMaPiNy7AD3AX", "htmlBody": null, "parentCommentId": null, "user": null}]