[{"_id": "Qj8dLDPZC27fzHPnP", "postedAt": "2017-12-14T23:49:40.987Z", "postId": "JXuCqrAzqSfzHqjeh", "htmlBody": "<p>This is all very exciting. Just fyi, the application links for the research fellow and senior research fellow that you mention in your last paragraph are broken. </p>\n", "parentCommentId": null, "user": {"username": "MichaelPlant"}}, {"_id": "gsA2rCmvEZKqSK3qR", "postedAt": "2017-12-15T12:15:53.347Z", "postId": "JXuCqrAzqSfzHqjeh", "htmlBody": "<p>Thanks for the heads up! I think this is a browser issue with the uni website. It actually works for me on Chrome and Edge, but others have found they don't work on Chrome, but do work on Safari. Would you mind trying a different browser and seeing if that works? </p>\n", "parentCommentId": "Qj8dLDPZC27fzHPnP", "user": {"username": "Michelle_Hutchinson"}}, {"_id": "9Gpx3gHuMfvfJFY6H", "postedAt": "2017-12-15T15:24:07.356Z", "postId": "JXuCqrAzqSfzHqjeh", "htmlBody": "<p>They also work for me, using Firefox.</p>\n<p>But what I really wanted to say is that the reserach agenda looks great! I'm of course especially excited about the potential research projects mentioned in the section &quot;The Value of the Future&quot; :) Great to see that these questions are getting more attention!</p>\n<p>I've shared the post with EA group leaders in the German-speaking community.</p>\n", "parentCommentId": "gsA2rCmvEZKqSK3qR", "user": {"username": "tobiaspulver"}}, {"_id": "m2muA79LscHbK8cjh", "postedAt": "2017-12-16T00:37:46.248Z", "postId": "JXuCqrAzqSfzHqjeh", "htmlBody": "<p>Yeah, works with explorer but not chrome...</p>\n", "parentCommentId": "gsA2rCmvEZKqSK3qR", "user": {"username": "MichaelPlant"}}, {"_id": "pPKkHXNDmGTESR56n", "postedAt": "2017-12-16T00:38:14.251Z", "postId": "JXuCqrAzqSfzHqjeh", "htmlBody": "<p>Totally agree. I combed through the research agenda and thought there was loads of cool stuff there.</p>\n", "parentCommentId": "9Gpx3gHuMfvfJFY6H", "user": {"username": "MichaelPlant"}}, {"_id": "QSzeJv9T7aFa5gNpR", "postedAt": "2017-12-16T05:04:09.701Z", "postId": "JXuCqrAzqSfzHqjeh", "htmlBody": "<p>It looks like these all require relocating to Oxford, is that accurate?</p>\n", "parentCommentId": null, "user": {"username": "sdspikes"}}, {"_id": "ZS8Lhs8aFXcMJsv3C", "postedAt": "2017-12-16T21:12:41.346Z", "postId": "JXuCqrAzqSfzHqjeh", "htmlBody": "<p>Yes, that's right. For the researcher roles, you would at least need to be in Oxford during term time. For the operations role, it would important to be there for essentially the whole period.</p>\n", "parentCommentId": "QSzeJv9T7aFa5gNpR", "user": {"username": "Michelle_Hutchinson"}}, {"_id": "ZYjwtzhxep9YFhMe4", "postedAt": "2017-12-18T15:46:08.754Z", "postId": "JXuCqrAzqSfzHqjeh", "htmlBody": "<p>Very exciting to read about this, especially the research agenda! I will definitely consult it when deciding on a topic for my master's thesis in philosophy. </p>\n<p>I have a few questions about the strategy (Not sure if this is the best medium for these questions, but I didn't know where else);</p>\n<ul>\n<li>a) Are you planning to be the central hub of EA-relevant academics? </li>\n<li>b) What do you think about the Santa Fe Institute's model of a core group of resident academics, and a larger group of affiliated researchers who regularly visit?</li>\n<li>c) Are you planning on incorporating more fields in the future, such as behavioural economics or complexity theory, and how do you decide on where to expand in?</li>\n<li>d) Where can I find more information about GPI's strategy, and are you planning on publishing it to the EA Forum?</li>\n</ul>\n<p>Btw, on p. 26 of the agenda there's an unfinished sentence: &quot;How important is the distinction between ‘sequence’ thinking and ‘cluster’ thinking? What’s &quot;</p>\n", "parentCommentId": null, "user": {"username": "SiebeRozendal"}}, {"_id": "YZbx9DLbHikY8s5tc", "postedAt": "2017-12-21T17:02:42.226Z", "postId": "JXuCqrAzqSfzHqjeh", "htmlBody": "<p>Glad to hear you're finding it useful! </p>\n<p>a) Yes, that's the plan</p>\n<p>b) We haven't decided on our model yet. Right now, we have a number of full-time academics, a number of research associates who attend seminars and collaborate with the full-time crew, and research research visitors coming periodically. Having researchers visit from other institutions seems useful for bringing in new ideas, getting to collaborate more closely than one could online, and having the visitors take back elements of our work to their home institutions. I would guess in future it would make sense to have at least some researchers who visit periodically, as well as people coming just as a one-off. But I couldn't say for sure at the moment. </p>\n<p>c) Yes, we are. Behavioural economics is already something we've thought a little about. Our reason for not expanding into more subjects at the moment is the difficulty of building thoroughly interdisciplinary groups within academia. As a small example, GPI is based in the Philosophy Department at Oxford, which isn't ideal for hiring Economists, who would prefer to be based in the Economics department. Given that, and the close tie in the past between EA and philosophy, we see a genuine risk of GPI/EA being thought of as 'philosophy plus' rather than truly multi/interdisciplinary. For that reason, we're starting with just one other discipline, and trying to build strong roots there. At the same time, we're trying to remain cognisant of other disciplines likely to be relevant, and the work that's going on there. (As an example in psychology, Lucius Caviola has been publishing interesting work both on speciesism and on how to develop a better scale for measuring moral traits EAs might be interested in.) </p>\n<p>d) The best source of information is <a href=\"https://globalprioritiesinstitute.org/\">our website</a>. I do plan on putting occasional updates on the EA forum, but as our work output will largely be academic papers, we're unlikely to publish them on here.</p>\n<p>Thanks for the heads up!   </p>\n", "parentCommentId": "ZYjwtzhxep9YFhMe4", "user": {"username": "Michelle_Hutchinson"}}]