[{"_id": "n2DRu6smqCaRCqWAg", "postedAt": "2021-11-13T19:24:05.711Z", "postId": "K2cmHxscYFtrK5np8", "htmlBody": "<p>On LinkedIn <a href=\"https://www.linkedin.com/feed/update/urn:li:activity:6864886447606910976/\">Ben Todd repeated his claim about room for more funding&nbsp;</a> up until the end of 2023, based on this <a href=\"https://docs.google.com/spreadsheets/d/11HsJLpq0Suf3SK_PmzzWpK1tr_BTd364j0l3xVvSCQw/edit#gid=81756163\">GiveWell spreadsheet</a></p><p>I'll repeat my reply here:</p><p>I'd really like to hear from someone at GiveWell (or the specific charities) to verify that this is the right interpretation of the funding gaps. For example, presumably this considers the funding gaps for specific programmes/countries that the likes of AMF are currently focusing on. But once that funding gap is filled, it seems plausible that there are other countries they could work on.<br><br>As an example, <a href=\"https://www.againstmalaria.com/ImmediateFundingGap.aspx\">AMF currently state they have a funding gap of $53m</a> (vs less than $1m according to that GiveWell spreadsheet). They state that \"Agreements are being finalised with each country's Ministry of Health. This process is far advanced for the above programmes and we do not anticipate any issues. We do not publicly identify countries involved until an Agreement is signed\". It seems plausible that these countries are not included in GiveWell's figures.</p><p>Another possibility is that the funding gap on AMF's website is for programmes that will be implemented after 2023</p>", "parentCommentId": null, "user": {"username": "Matt_Sharp"}}, {"_id": "FgNaGi8aJhqZyshHK", "postedAt": "2021-11-13T19:49:01.927Z", "postId": "K2cmHxscYFtrK5np8", "htmlBody": "<p>I totally agree - I replied <a href=\"https://twitter.com/JamesOzOz/status/1458509889832095752\">something very similar</a> to Ben on Twitter. His reply seems to imply that AMF's DRC program (referenced in the <a href=\"https://docs.google.com/spreadsheets/d/11HsJLpq0Suf3SK_PmzzWpK1tr_BTd364j0l3xVvSCQw/edit#gid=81756163\">GiveWell room for more funding spreadsheet</a>) meets the bar for cost-effectiveness whereas programs in other countries don't therefore aren't included. I'm somewhat skeptical of this however as GiveWell don't mention anything about this in their <a href=\"https://www.givewell.org/charities/amf\">review of AMF</a> but really not sure at all. I would also love if someone from GiveWell or AMF could weigh in on this and clear this up!</p>", "parentCommentId": "n2DRu6smqCaRCqWAg", "user": {"username": "JamesOz"}}, {"_id": "3eoyqMw3wD8mJ7CdA", "postedAt": "2021-11-13T20:17:38.780Z", "postId": "K2cmHxscYFtrK5np8", "htmlBody": "<p>Also interesting: when I posted my tweet on the 10th (3 days ago) AMF had a listed funding gap of $74m and today (on the 13th) it's $54m! Either crazy coincidence that they got $20m in donations in three days or funding really is coming in that fast (semi-joking..)</p>", "parentCommentId": "n2DRu6smqCaRCqWAg", "user": {"username": "JamesOz"}}, {"_id": "eQECnLEBjQn9ShAih", "postedAt": "2021-11-18T01:03:27.344Z", "postId": "K2cmHxscYFtrK5np8", "htmlBody": "<p><i>(I work at GiveWell)</i></p><p>Thanks for sharing the news, James! The success of 2020 was surprising and exciting.&nbsp;We plan on publishing an update on our room for more funding before the end of November, and we’ll have much more detail to share then. A few high-level points we plan to address:</p><ul><li>Room for more funding has gone up significantly. This has been a major focus of our work in 2021, and we’ve succeeded.</li><li>We expect our funds raised will continue to increase rapidly.</li></ul><p>We’ll share more details and answer further questions once our update is live.</p>", "parentCommentId": null, "user": {"username": "Taylor"}}]