[{"_id": "iuHMYtkssjJ5nCLQx", "postedAt": "2022-11-17T21:43:34.339Z", "postId": "K7aA9YXRoRQvqjXuq", "htmlBody": "<p>Thank you for this work. I appreciate the high-level transparency throughout (e.g what is an opinion, how many sources have been read/incorporated, reasons for assumptions etc.)!<br><br>I have few key (dis)agreements and considerations. Disclaimer: I work for <a href=\"https://allfed.info/\">ALLFED </a>(Alliance to Feed the Earth in Disasters) where we look at preparedness and response to nuclear winter among other things.<br><br>1) Opportunity Costs</p><p>I think it is not necessary for work on either <strong>preventing the worst nuclear conflicts</strong> or work on <strong>preparedness/response</strong> to be mutually exclusive with <strong>preventing nuclear conflict</strong> in general.</p><p>My intuition is that if you are working on preventing the worst nuclear conflicts then you (also) have to work on escalation steps. And understanding of how wars escalate and what we can do about it seems to be very useful generally no matter if we go from a war using 0 to ~10 nukes or from a war escalating from 10 to 100 nukes. At each step we would want to intervene. I do not know how a specialization would look like that is only relevant at the 100 to 1000 nukes step. I know me not being able to imagine such a specialization is only a weak argument but I am also not aware of anyone only looking at such a niche problem.</p><p>Additionally, preparedness/response work has multiple uses. Nuclear winter is only one source for an abrupt sunlight reduction scenario (ASRS), the others being super volcanic eruptions and asteroid impacts (though one can argue that nuclear winter is the most likely out of the 3). Having 'slack' critical infrastructure (either through storage or the capacity to quickly scale-up post-catastrophe) is also helpful in many scenarios. Examples: resilient communication tech is helpful if communication is being disrupted either by war or by say a solar storm (same goes for electricity and water supply). The ability to scale-up food production is useful if we have Multiple Bread Basket Failures due to coinciding extreme weather events or if we have an agricultural shortfall due to a nuclear winter. In both cases we would want to know how feasible it is to quickly ramp up greenhouses (one example).</p><p>Lastly, I expect &nbsp;these different interventions to require different skillsets (e.g civil engineers vs. policy scholars). (Not always, surely there will be overlap.) So the opportunity costs would be more on the funding side of the cause area, less so on the talent side.</p><p>2) Neglectedness&nbsp;</p><p>I agree that the cause area as a whole is neglected and share the concerns around reduced funding. But within the broader cause area of 'nuclear conflict' the tail-risks and the preparedness/response are even more neglected. Barely anyone is working on this and I think this is one strength of the EA community to look into highly neglected areas and add more value per person working on the problem. I don't have numbers but I would expect there to be at least 100 times more people working on preventing nuclear war and informing policy makers about the potential negative consequences because as you rightly stated that one does not need to be utilitarian, consequentialist, or longtermist to not want nukes to be used under any circumstances.</p><p>&nbsp;and 3) High uncertainty around interventions</p><p>Exactly because of the uncertainty you mentioned I think we should not rely on a narrow set of interventions and go broader. You can discount the likelihood, run your own numbers and advocate your ideal funding distribution between interventions but I think that we can not rule out nuclear winter happening and therefore some funding should go to response.</p><p>For context: <a href=\"https://forum.effectivealtruism.org/posts/EixrWYgkox7noLacn/probability-of-extinction-for-various-types-of-catastrophes\">Some </a>put the probability of nuclear war causing extinction at (only) 0.3% this century. Or <a href=\"https://allfed.info/images/pdfs/Long_term_cost_effectiveness_of_resilien.pdf\">here is ALLFED's cost-effectiveness model</a> looking at 'agriculture shortfalls' and their longterm impact, making the case for the marginal dollar in this area being extremely valuable.</p><p>In general I strongly agree with your argument that more efforts should go into prevention of any kind of nuclear war. I do not agree that this should happen at the expense of other interventions (such as working on response/preparedness).</p><p>4) Premise 1 --&gt; Civilizational Collapse (through escalation after a single nuke)</p><p>You write that a nuclear attack could cause a global conflict (agree) which could then escalate to civilizational collapse (and therefore pose an xrisk) even if no further nukes are being used (strong disagree).</p><p>I do not see a plausible pathway to that. Even in an all out physical/typical explosives kind of war (I would expect our supply chains to fail and us running out of things to throw at each other way before civilization itself collapses). Am I missing something here?&nbsp;</p><p>Tongue in cheek related movie quote:</p><p><i>A: \"Eye for an eye and the world goes blind.\"</i></p><p><i>B: \"No it doesn't. There'll be one guy left with one eye.\"</i></p><p>But I do not think it changes much of what you write here even if you cut-out this one consideration. It is only a minor point. Not a crux. Agree on the aspect that a single nuke can cause significant escalation though.</p><p>5) Desensitizing / Language around size of events</p><p>I am also saddened to hear that someone was dismissive about an India/Pakistan nuclear exchange. I agree that that is worrisome.&nbsp;</p><p>I think that Nuclear Autumns (up to ~25 Tg (million tons) of soot entering the atmosphere) still pose a significant risk and could cause ~1 billion deaths through famines + cascading effects, that is if we do not prepare.&nbsp; So dismissing such a scenario seems pretty bad to me</p>", "parentCommentId": null, "user": {"username": "AronM"}}, {"_id": "eMmTkPkLoe9cXFAFL", "postedAt": "2022-11-19T04:15:38.837Z", "postId": "K7aA9YXRoRQvqjXuq", "htmlBody": "<p>Thanks Sarah, important issues. &nbsp;I basically agree with Aron's comment and am interested in your thoughts on the various points raised there.</p><p>Like Aron, I think the route from a single nuclear deployment to an existential catastrophe runs mainly through nuclear escalation. &nbsp;I think you are arguing for a more expansive conclusion, but the smaller claim that the best way to prevent a large nuclear exchange is to prevent the first deployment seems very defensible to me, and is still big if true. &nbsp;I don't have the necessary object-level knowledge to judge how true it is. &nbsp;So I agree with P1.</p><p>For P2, I agree with Aron that in general being more uncertain leads to a more diversified portfolio of interventions being optimal. &nbsp;I think while the point you raise - the future of complex systems like global geopolitics is hard to predict - is pretty obviously true, I resist the next step you take to say that using probabilities is useless/bad. &nbsp;Not to the same degree perhaps, but predicting whether a startup will succeed is very complex and difficult: it involves the personalities and dynamics of the founders and employees, the possibility of unforeseen technological breakthroughs, the performance of competitors including competitors that don't yet exist, the wider economy and indeed geopolitical and trade relationships. &nbsp;And yet people make these predictions all the time, and some venture capitalists make more money than others and I think it is reasonable to believe we can make more and less informed guesses. &nbsp;Likewise with your questions, I think some probabilities we could use are more wrong than others. &nbsp;So I think like in any other domain, we make a best guess, think about how uncertain we are and use that to inform whether to spend more time thinking about it to narrow our uncertainty. &nbsp;My guess is you believe after making our initial probability guess based mainly on intuition it is hard to make progress and narrow our uncertainty. I think this could well be true. &nbsp;I suppose I just don't see a better competing method of making decisions that avoids assigning probabilities to theory questions. &nbsp;My claim is that people/institutions that foreswear the use of probabilities will do systematically worse than those that try their best to predict the future, acknowledging the inherent difficulty of the endeavour.</p><p>Plausibly we can reformulate this premise as claiming that preventing the first nuclear deployment is more tractable because preventing escalation has more unknowns. &nbsp;I would be on board with this. &nbsp;I think it is mainly the anti-probability stance I am pushing back against.</p><p>For P3, I share the intuition that being cavalier about the deaths of millions of people seems bad. &nbsp;I think as a minimum it is bad optics, and quite possibly more (corrosive to our empathy, and maybe empathy is useful as altruists?). &nbsp;It seems trivially true that taking resources that would be used to try to prevent a first deployment and incinerating those resources is negative EV (ie \"de-emphasizing the goal ... has adverse effects\"). &nbsp;It is a much stronger more controversial claim that moving resources from escalation prevention to first-use prevention is good, and I feel ill-equipped to assess this claim.</p><p>Also, as a general point, I think these three premises are not actually premises in a unified logical structure (ie 'all forum posts are in English, this is a forum post, therefore it is in English') but rather quite independent arguments pointing to the same conclusion. &nbsp;Which is fine, just misleading to call them each premises in the one argument I think. &nbsp;FInally, I am not that sure of your internal history but one worry would be if you decided long ago intuitively based on the cultural milieu that the right answer is 'the best intervention in nuclear policy is to try to prevent first use' and then subconsciously sought out supporting arguments. &nbsp;I am not saying this is what happened or that you are any more guilty of this than me or anyone else, just that it is something I and we all should be wary of.</p>", "parentCommentId": null, "user": {"username": "Oscar Delaney"}}, {"_id": "wR5LLePrgSKad9Xsa", "postedAt": "2022-11-19T10:11:20.965Z", "postId": "K7aA9YXRoRQvqjXuq", "htmlBody": "<p>Thanks for taking the time to read through the whole thing and leaving this well-considered comment! :)</p><p>In response to your points:</p><p>1) Opportunity costs</p><ul><li>“I do not know how a specialization would look like that is only relevant at the 100 to 1000 nukes step. I know me not being able to imagine such a specialization is only a weak argument but I am also not aware of anyone only looking at such a niche problem.” - If this is true and if people who express concern mainly/only for the worst kinds of nuclear war are actually keen on interventions that are equally relevant for preventing any deployment of nuclear weapons, then I agree that the opportunity cost argument is largely moot. I hope your impressions of the (EA) field in this regard are more accurate than mine!</li><li>My main concern with preparedness interventions is that they may give us a false sense of ameliorating the danger of nuclear escalation (i.e., “we’ve done all these things to prepare for nuclear winter, so now the prospect of nuclear escalation is not quite as scary and unthinkable anymore”). So I guess I’m less concerned about these interventions the more they are framed as attempts to increase general global resilience, because that seems to de-emphasize the idea that they are effective means to substantially reduce the harms incurred by nuclear escalation. Overall, this is a point that I keep debating in my own mind and where I haven’t come to a very strong conclusion yet: There is a tension in my mind between the value of system slack (which is large, imo) and the possible moral hazard of preparing for an event that we should simply never allow to occur in the first place (i.e.: preparation might reduce the urgency and fervor with which we try to prevent the bad outcome in the first place).</li><li>I mostly disagree on the point about skillsets: I think both intervention targets (focus on tail risks vs. preventing any nuclear deployment) are big enough to require input from people with very diverse skillsets, so I think it will be relatively rare for a person to be able to only meaningfully contribute to either of the two. In particular, I believe that both problems are in need of policy scholars, activists, and policymakers and a focus on the preparation side might lead people in those fields to focus less on the preventing any kind of nuclear deployment goal.</li></ul><p>2) Neglectedness:&nbsp;</p><ul><li>I think you’re empirically right about the relative neglectedness of tail-ends &amp; preparedness within the nuclear risk field.&nbsp;</li><li>(I’d argue that this becomes less pronounced as you look at neglectedness not just as “number of people-hours” or “amount of money” dedicated to a problem, but also factor in how capable those people are and how effectively the money is spent (I believe that epistemically rigorous work on nuclear issues is severely neglected and I have the hope that EA engagement in the field could help ameliorate that).)</li><li>That said, I must admit that the matter of neglectedness is a very small factor in convincing me of my stance on the prioritization question here. As explained in the post, I think that a focus on the tail risks and/or on preparedness is plausibly net negative because of the intractability of working on them and because of the plausible adverse consequences. In that sense, I am glad that those two are neglected and my post is a plea for keeping things that way.</li></ul><p>3) High uncertainty around interventions: Similar thoughts to those expressed above. I have an unresolved tension in my mind when it comes to the value of preparedness interventions. I’m sympathetic to the case you’re making (heck, I even advocated (as a co-author) for general resilience interventions in <a href=\"https://forum.effectivealtruism.org/posts/faW24r7ocbcPisgCH/a-critique-of-the-precipice-chapter-6-the-risk-landscape-red#Broad_interventions_side_step_the_challenges_with_the_prioritization_frameworks\">a different post</a> a few months ago); but, at the moment, I’m not exactly sure I know how to square that sympathy with the concerns I simultaneously have about preparedness rhetoric and action (at least in the nuclear risk field, where the danger of such rhetoric being misused seems particularly acute, given vested interests in maintaining the system and status-quo).</p><p>4) Civilizational Collapse:</p><ul><li>My claim about civilization collapse in the absence of the deployment of multiple nukes is based on the belief that civilizations can collapse for reasons other than weapons-induced physical destruction.&nbsp;</li><li>Some half-baked, very fuzzy ideas of how this could happen are: destruction of communities’ social fabric and breakdown of governance regimes; economic damage, breakdown of trade and financial systems, and attendant social and political consequences; cyber warfare, and attendant social, economic, and political consequences.&nbsp;</li><li>I have not spent much time trying to map out the pathways to civilizational collapse and it could be that such a scenario is much less conceivable than I currently imagine. I think I’m currently working on the heuristic that societies and societal functioning is hyper-complex and that I have little ability to actually imagine how big disruptions (like a nuclear conflict) would affect them, which is why I shouldn’t rule out the chance that such disruptions cascade into collapse (through chains of events that I cannot anticipate now).&nbsp;</li><li>(While writing this response, I just found myself staring at the screen for a solid 5 minutes and wondering whether using this heuristic is bad reasoning or a sound approach on my part; I lean towards the latter, but might come back to edit this comment if, upon reflection, I decide it’s actually more the former)</li></ul>", "parentCommentId": "iuHMYtkssjJ5nCLQx", "user": {"username": "Sarah Weiler"}}, {"_id": "iNRbZtzemdWtFLBix", "postedAt": "2022-11-19T22:06:13.962Z", "postId": "K7aA9YXRoRQvqjXuq", "htmlBody": "<p>On moral hazard, I did some analysis in a journal <a href=\"https://allfed.info/images/pdfs/Long_term_cost_effectiveness_of_resilien.pdf\">article </a>of ours:</p><p>\"Moral hazard would be if awareness of a food backup plan makes nuclear war more likely or more intense. It is unlikely that, in the heat of the moment, the decision to go to nuclear war (whether accidental, inadvertent, or intentional) would give much consideration to the nontarget countries. However, awareness of a backup plan could result in increased arsenals relative to business as usual, as awareness of the threat of nuclear winter likely contributed to the reduction in arsenals [74]. Mikhail Gorbachev stated that a reason for reducing the nuclear arsenal of the USSR was the studies predicting nuclear winter and therefore destruction outside of the target countries [75]. One can look at how much nuclear arsenals changed while the Cold War was still in effect (after the Cold War, reduced tensions were probably the main reason for reduction in stockpiles). This was ~20% [76]. The perceived consequences of nuclear war changed from hundreds of millions of dead to billions of dead, so roughly an order of magnitude. The reduction in damage from reducing the number of warheads by 20% is significantly lower than 20% because of marginal nuclear weapons targeting lower population and fuel loading density areas. Therefore, the reduction in impact might have been around 10%. Therefore, with an increase in damage with the perception of nuclear winter of approximately 1000% and a reduction in the damage potential due to a smaller arsenal of 10%, the elasticity would be roughly 0.01. Therefore, the moral hazard term of loss in net effectiveness of the interventions would be 1%.\"</p><p>Also, as Aron pointed out, resilience protects against other catastrophes, such as supervolcanic eruptions and asteroid/comet impacts. Similarly, there is some evidence that people drive less safely if they are wearing a seatbelt, but overall we are better off with a seatbelt. So I don't think moral hazard is a significant argument against resilience.</p><p>I think direct cost-effectiveness analyses like this journal <a href=\"https://allfed.info/images/pdfs/cost_effective.pdf\">article</a> are more robust, especially for interventions, than Importance, Neglectedness and Tractability. But it is interesting to think about tractability separately. It is true that there is a lot of uncertainty of what the environment would be like post catastrophe. However, we have <a href=\"https://allfed.info/images/pdfs/Preprint%20V2.0%20Integrated%20assessment%20ALLFED.docx.pdf\">calculated </a>that resilient foods would greatly improve the situation with and without global food trade, so I think they are a robust intervention. Also, I think if you look at the state of resilience to nuclear winter pre-2014, it was basically to store up more food, which would cost tens of trillions of dollars, would not protect you right away, and if you did it fast, it would raise prices and exacerbate current malnutrition. In 2014, we estimated that resilient foods could be scaled up to feed everyone technically. And then in the last eight years, we have done research estimating that it could also be done affordably for most people. So I think there has been a lot of progress with just a few million dollars spent, indicating tractability.</p><blockquote><p>I mostly disagree on the point about skillsets: I think both intervention targets (focus on tail risks vs. preventing any nuclear deployment) are big enough to require input from people with very diverse skillsets, so I think it will be relatively rare for a person to be able to only meaningfully contribute to either of the two. In particular, I believe that both problems are in need of policy scholars, activists, and policymakers and a focus on the preparation side might lead people in those fields to focus less on the preventing any kind of nuclear deployment goal.</p></blockquote><p>I think that Aron was talking about prevention versus resilience. Resilience requires more engineering.</p>", "parentCommentId": "wR5LLePrgSKad9Xsa", "user": {"username": "Denkenberger"}}, {"_id": "DR73B87FvrzhnZqGG", "postedAt": "2022-11-20T19:50:54.739Z", "postId": "K7aA9YXRoRQvqjXuq", "htmlBody": "<p>Thanks for going through the \"premises\" and leaving your comments on each - <strong>very</strong> helpful for myself to further clarify and reflect upon my thoughts!</p><p>On P1 (that nuclear escalation is the main or only path to existential catastrophe):&nbsp;</p><ul><li>Yes, I do argue for the larger claim that a one-time deployment of nuclear weapons could be the start of a development that ends in existential catastrophe even if there is no nuclear escalation.&nbsp;</li><li>I give a partial justification of that in the post and in my comment to Aron,&nbsp;</li><li>but I accept that it's not completely illegitimate for people to continue to disagree with me; opinions on a question like this rest on quite foundational beliefs, intuitions, and heuristics, and two reasonable people can, imo, have different sets of these.&nbsp;</li><li>(Would love to get into a more in-depth conversation on this question at some point though, so I'd suggest putting it on the agenda for the next time we happen to see each other in-person :)!)</li></ul><p>On P2:</p><ul><li>Your suggested reformulation (\"preventing the first nuclear deployment is more tractable because preventing escalation has more unknowns\") is pretty much in line with what I meant this premise/proposition to say in the context of my overall argument. So, on a high-level, this doesn't seem like a crux that would lead the two of us to take a differing stance on my overall conclusion.</li><li>You're right that I'm not very enthusiastic about the idea of putting actual probabilities on any of the event categories I mention in the post (event categories: possible consequences of a one-time deployment of nukes; conceivable effects of different types of interventions). We're not even close to sure that we/I have succeeded in identifying the range of possible consequences (pathways to existential catastrophe) and effects (of interventions), and those consequences and effects that I did identify aren't very specific or well-defined; both of these seem like <s>necessary</s> &nbsp;prudent steps to precede the assignment of probabilities. I realize while writing that you will probably just once again disagree with that leap I made (from deep uncertainty to rejecting probability assignment), and that I'm &nbsp;not doing much to advance our discussion here. Apologies! On your specific points: correct, I don't think we can advance much beyond an intuitive, extremely uncertain assignment of probabilities; I think that the alternative (whose existence you deny) is to acknowledge our lack of reasonable certainty about these probabilities and to make decisions in the awareness that there are these unknowns (in our model of the world); and I (unsurprisingly) disagree that institutions or people that choose this alternative will do systematically worse than those that always assign probabilities.</li><li>(I don't think the start-up analogy is a good one in this context, since venture capitalists get to make many bets and they receive reliable and repeated feedback on their bets. Neither of these seem particularly true in the nuclear risk field (whether we're talking about assigning probabilities to the consequences of nuclear weapons deployment or about the effects of interventions to reduce escalation risk / prepare for a post-nuclear war world).)</li></ul><p>On P3: Thanks for flagging that, even after reading my post, you feel ill-equipped to assess my claim regarding the value of interventions for preventing first-use vs. interventions for preventing further escalation. Enabling readers to navigate, understand and form an opinion on claims like that one was one of the core goals that I started this summer's research fellowship with; I shall reflect on whether this post could have been different, or whether there could have been a complementary post, to better achieve this enabling function!</p><p>On P4: Haha yes, I see this now, thanks for pointing it out! I'm wondering whether renaming them \"propositions\" or \"claims\" would be more appropriate?</p>", "parentCommentId": "eMmTkPkLoe9cXFAFL", "user": {"username": "Sarah Weiler"}}, {"_id": "Wi6LsX5rZaoDGQWEf", "postedAt": "2022-11-21T11:58:22.375Z", "postId": "K7aA9YXRoRQvqjXuq", "htmlBody": "<p>Thanks!</p><p>Fair enough re the disanalogy between investing and nuclear predictions. &nbsp;My strong suspicion (from talking to some of them + reading write-ups + vibes) is that the people with the best Brier scores in various forecasting competitions use probabilities plenty, and probably more than the mediocre forecasters who just intuit a final number. &nbsp;But then I think you could reasonably respond that this is a selection effect that of course the people who love probabilities will spend lots of time forecasting and rise to the top.</p><p>I wonder what adversarial collaboration would resolve this probabilities issue? &nbsp;Perhaps something like: get a random group of a few hundred people and assign one group some calibration training and probability theory and practice and so forth a bit like what Nuno gave us, and assign the other group a curriculum of your choice that doesn't emphasise probabilities. &nbsp;Then get them all to make a bunch of forecasts, and a year or however long later see which group did better. &nbsp;This already seems skewed in my favour though as the forecasts are just probabilities. &nbsp;I am struggling to think of a way to test predictive skill nicely without using probability forecasts though.</p><p>Re your goals for the summer project, oh no that certainly wasn't the vibe I was intending to convey. &nbsp;I think this post succeeded in making me understand some of the issues at stake here better, and get a sense for some of the arguments and tensions. &nbsp;I think if after reading a 3000-word article with minimal background knowledge I had come to form strong and well-founded inside takes on (as you say) a very complex issue like nuclear policy, this would be remarkable! &nbsp;I don't think it is a failing of you or the essay at all that this isn't (very much) the case. &nbsp;To have good inside views I think I would need to at least be familiar with the various nuclear research/policy agendas out there, and how they fit into the preventing first use/preventing 100--&gt;1000 escalation, and how tractable they each seem.</p><p>I think I still like calling them each 'arguments' but I think anything is probably better than 'premise' given the very special meaning of that word in logic.</p>", "parentCommentId": "DR73B87FvrzhnZqGG", "user": {"username": "Oscar Delaney"}}, {"_id": "jETNr9QyiaAxqWsrj", "postedAt": "2022-11-23T10:36:40.064Z", "postId": "K7aA9YXRoRQvqjXuq", "htmlBody": "<p>You wrote:</p>\n<blockquote>\n<p>\" I am struggling to think of a way to test predictive skill nicely without using probability forecasts though.\"</p>\n</blockquote>\n<p>The list of forecasting methods that do not rely on subjective or unverifiable probability estimates includes:</p>\n<ul>\n<li>in response to a yes/no forecasting question, given what you believe now about the current situation and what it will cause, answer with whether the questioned future scenario is what the current situation leads to.</li>\n<li>in response to a multiple option (mutually exclusive choice) forecasting question, given what you believe now about the current situation and what it could cause, answer what alternative future scenarios the current situation could lead to.</li>\n<li>in response to any forecasting question, if you lack sufficient knowledge of the facts of the current situation, then list the contingencies and contingent situations that you would match to better knowledge of the facts in order to determine the future.</li>\n<li>in response to any forecasting question, if you lack sufficient knowledge of causal relations that lead to a scenario, backtrack necessary (and together sufficient) causes from the scenario (one of the alternative forecast answers) to as close to the present as you can. From there, decide whether the causal gap between the present situation and that near-future situation (backtracked from the forecast scenario) is plausible to causally bridge. In other words, is that near-future situation causally possible? If you don't believe so, reject the scenario in your forecast. If you do believe so, you have a starting point for research to close the information gap corresponding to the causal gap.</li>\n</ul>\n<p>The list of forecasting methods that do not provide a final forecast probability includes:</p>\n<ul>\n<li>for a yes/no forecast, use whatever probability methods to reach a conclusion however you do. Then establish a probability floor below which the answer is \"no\", a ceiling above which the answer is \"yes\", and a range between the floor and ceiling an answer of \"maybe\". Work to reduce your uncertainty enough to move your forecast probability below or above the maybe zone.</li>\n<li>for an alternatives forecast,use whatever probability methods to reach a conclusion however you do. Then establish a floor of probability above which an option is selected. List all options above the floor as chosen alternatives (for example, \"I forecast scenario A or B but not C or D.\"). Work to reduce your uncertainty enough to concentrate forecast probability within fewer options (for example, \"I forecast scenario B only, not A or C or D.\").</li>\n</ul>\n<p>The definition of <em>scenario</em> in the domain of forecasting (as I use it here) includes:</p>\n<ul>\n<li>an option among several that answer a forecast multiple-choice (single-answer) question.</li>\n<li>a proposed future about which a yes/no forecast is made.</li>\n</ul>\n", "parentCommentId": "Wi6LsX5rZaoDGQWEf", "user": {"username": "Noah Scales"}}, {"_id": "infeGoDNt6cTohsLQ", "postedAt": "2022-11-23T20:33:19.699Z", "postId": "K7aA9YXRoRQvqjXuq", "htmlBody": "<p>Ah, I think mybe there is/was a misunderstanding here. I don't reject the claim that the forecasters are (much) better on average when using probabilities than when refusing to do so. I think my point here is that the questions we're talking about (what would be the full set of important* consequences of nuclear first-use or the full set of important* consequences of nuclear risk reduction interventions X and Z) are not your standard, well-defined and soon-to-be-resolved forecasting questions. So in a sense, the very fact that the questions at issue cannot be part of a forecasting experiment is one of the main reasons for why I think they are so deeply uncertain and hard to answer with more than intuitive guesswork (if they could be part of a forecasting experiment, people could test and train their skills at assigning probabilities by answering many such questions, in which case I guess I would be more amenable to the claim that assigning probabilities can be useful). The way I understood our disagreement, it was <strong>not about the predictive performance of actors who do vs don't (always) use probabilities, but rather about their decision quality</strong>. I think the actual disagreement may be that I think that there is a significant difference (for some decisions, high decision quality is not a neat function of explicit predictive ability), whereas you might be close to equating the two?</p>\n<p>[*by \"full set\" I mean that this is supposed to include indirect/second-order consequences]</p>\n<p>That said, I can't, unfortunately, think of any alternative ways to resolve the disagreement regarding the decision quality of people using vs. refusing to use probabilities in situations where assessing the effects of a decision/action after the fact is highly difficult... (While the comment added by Noah Scales contains some interesting ideas, I don't think it does anything to resolve this stalemate, since it is also focused on comparing &amp; assessing predictive success for questions with a small set of known answer options)</p>\n<p>One other thing, because I forgot about that in my last response:</p>\n<p>\"FInally, I am not that sure of your internal history but one worry would be if you decided long ago intuitively based on the cultural milieu that the right answer is 'the best intervention in nuclear policy is to try to prevent first use' and then subconsciously sought out supporting arguments. &nbsp;I am not saying this is what happened or that you are any more guilty of this than me or anyone else, just that it is something I and we all should be wary of.\"</p>\n<p>-&gt; I think this is a super important point, actually, and agree that it's a concern that should be kept in mind when reading my essay on this topic. I did have the intuitive aversion against focusing on tail end risks before I came up with all the supporting arguments; basically, this post came about as a result of me asking myself \"Why do I think it's such a horrible idea to focus on the prevention of and preparation for the worst case of a nuclear confrontation?\" I added a footnote to be more transparent about this towards the beginning of the post (fn. 2). Thanks for raising it!</p>\n", "parentCommentId": "Wi6LsX5rZaoDGQWEf", "user": {"username": "Sarah Weiler"}}, {"_id": "NGKBky8aFGaTbeweH", "postedAt": "2022-11-24T00:35:10.222Z", "postId": "K7aA9YXRoRQvqjXuq", "htmlBody": "<p>Yes, I think this captures our difference in views pretty well: I do indeed think predictive accuracy is very valuable for decision quality.  Of course, there are other skills/attributes that are also useful for making good decisions.  Predicting the future seems pretty key though.</p>\n", "parentCommentId": "infeGoDNt6cTohsLQ", "user": {"username": "Oscar Delaney"}}, {"_id": "eFZCveSFhP3TMLHe7", "postedAt": "2022-11-24T10:48:18.260Z", "postId": "K7aA9YXRoRQvqjXuq", "htmlBody": "<p>Thanks for your comment and for adding to Aron’s response to my post!</p><p>Before reacting point-by-point, one more overarching warning/clarification/observation: My views on the disvalue of numerical reasoning and the use of BOTECs in deeply uncertain situations are quite unusual within the EA community (though not unheard of, see for instance <a href=\"https://forum.effectivealtruism.org/posts/KfqFLDkoccf8NQsQe/potential-downsides-of-using-explicit-probabilities\">this EA Forum post on \"Potential downsides of using explicit probabilities\"</a> and <a href=\"https://blog.givewell.org/2011/08/18/why-we-cant-take-expected-value-estimates-literally-even-when-theyre-unbiased/\">this GiveWell blog post on \"Why we can’t take expected value estimates literally (even when they’re unbiased)\" </a>which acknowledge some of the concerns that motivate my skeptical stance). I can imagine that this is a heavy crux between us and that it makes advances/convergence on more concrete questions (esp. through a forum comments discussion) rather difficult (which is not at all meant to discourage engagement or to suggest I find your comments unhelpful (quite the contrary); just noting this in an attempt to avoid us arguing past each other).</p><ul><li>On moral hazards:<ul><li>In general, my deep-seated worries about moral hazard and other normative adverse effects feel somewhat inaccessible to numerical/empirical reasoning (at least until we come up with much better empirical research strategies for studying complex situations). To be completely honest, I can’t really imagine arguments or evidence that would be able to substantially dissolve the worries I have. That is not because I’m consciously dogmatic and unwilling to budge from my conclusions, but rather because I don’t think we have the means to know empirically to what extent these adverse effects actually exist/occur. It thus seems that we are forced to rely on fundamental worldview-level beliefs (or intuitions) when deciding on our credences for their importance. This is a very frustrating situation, but I just don’t find attempts to escape it (through relatively arbitrary BOTECs or plausibility arguments) in any sense convincing; they usually seem to me to be trying to come up with elaborate cognitive schemes to diffuse a level of deep empirical uncertainty that simply cannot be diffused (given the structure of the world and the research methods we know of).</li><li>To illustrate my thinking, here’s my response to your example:<ul><li>I don’t think that we really know anything about the moral hazard effects that interventions to prepare for nuclear winter would have had on nuclear policy and outcomes in the Cold War era.</li><li>I don’t think we have a sufficiently strong reason to assign the 20% reduction in nuclear weapons to the difference in perceived costs of nuclear escalation after research on nuclear winter surfaced.</li><li>I don’t think we have any defensible basis for making a guess about how this reduction in weapons stocks would have been different had there been efforts to prepare for nuclear winter in the 1980s.</li><li>I don’t think it is legitimate to simply claim that fear of nuclear-winter-type events has no plausible effect on decision-making in crisis situations (either consciously or sub-consciously, through normative effects such as those of the nuclear taboo). At the same time, I don’t think we have a defensible basis for guessing the expected strength of this effect of fear (or “taking expected costs seriously”) on decision-making, nor for expected changes in the level of fear given interventions to prepare for the worst case.</li><li>In short, I don’t think it is anywhere close to feasible or useful to attempt to calculate “the moral hazard term of loss in net effectiveness of the [nuclear winter preparation] interventions”.</li></ul></li></ul></li><li>On the cost-benefit analysis and tractability of food resilience interventions:<ul><li>As a general reaction, I’m quite wary of cost-effectiveness analyses for interventions into complex systems. That is because such analyses require that we identify all relevant consequences (and assign value and probability estimates to each), which I believe is extremely hard once you take indirect/second-order effects seriously. (In addition, I’m worried that cost-effectiveness analyses distract analysts and readers from the difficult task of mapping out consequences comprehensively, instead focusing their attention on the quantification of a narrow set of direct consequences.)</li><li>That said, I think there sometimes is informational value in cost-effectiveness analyses in such situations, if their results are very stark and robust to changes in the numbers used. I think the article you link is an example of such a case, and accept this as an argument in favor of food resilience interventions.</li><li>I also accept your case for the tractability of food resilience interventions (in the US) as sound.</li><li>As far as the core argument in my post is concerned, my concern is that the majority of post-nuclear war conditions gets ignored in your response. I.e., if we have sound reasons to think that we can cost-effectively/tractably prepare for post-nuclear war food shortages but don’t have good reasons to think that we know how to cost-effectively/tractably prepare for most of the other plausible consequences of nuclear deployment (many of which we might have thus far failed to identify in the first place), then I would still argue that the tractability of preparing for a post-nuclear war world is concerningly low. I would thus continue to maintain that preventing nuclear deployment should be the primary priority (in other words: your arguments in favor of preparation interventions don’t address the challenge of preparing for the full range of possible consequences, which is why I still think avoiding the consequences ought to be the first priority).</li></ul></li></ul>", "parentCommentId": "iNRbZtzemdWtFLBix", "user": {"username": "Sarah Weiler"}}, {"_id": "ASc7Z3TWyp98Svwfx", "postedAt": "2022-12-02T06:50:49.851Z", "postId": "K7aA9YXRoRQvqjXuq", "htmlBody": "<p>Sarah, you wrote:</p>\n<blockquote>\n<p>(While the comment added by Noah Scales contains some interesting ideas, I don't think it does anything to resolve this stalemate, since it is also focused on comparing &amp; assessing predictive success for questions with a small set of known answer options)</p>\n</blockquote>\n<p>Yes, that's right that my suggestions let you assess predictive success, in some cases, for example, over a set of futures partitioning a space of possibilities. Since the futures partition the space, one of them will occur, the rest will not. A yes/no forecast works this way.</p>\n<p>Actually, if you have any question about a future at a specific time about  which you feel uncertain, you can phrase it as a yes/no question. You then partition  the space of possibilities at that future time. Now you <em>can</em>  answer the question, and test your predictive success. Whether your answer has any value is the concern.</p>\n<p>However, one option I mentioned is to list contingencies that, if present, result in contingent situations (futures). That is not the same as predicting the future, since the contingencies don't have to be present or identified (EDIT: in the real world, ie as facts), and you do not expect their contingent futures otherwise.</p>\n<blockquote>\n<p>If condition X, then important future Y happens.</p>\n<p>Condition X could be present now or later, but I can't identify or infer its presence now.</p>\n</blockquote>\n<p>Deep uncertainty is usually taken as responding to those contingent situations as meaningful anyway. As someone without predictive information, you can only start offering models, like:</p>\n<blockquote>\n<p>If X, then Y</p>\n<p>If Y, then Z</p>\n<p>If W and G, then B</p>\n<p>If B, then C</p>\n<p>A</p>\n<p>T</p>\n<p>I'm worried that A because ...</p>\n</blockquote>\n<p>You can talk about scenarios, but you don't know  or haven't seen their predictive indicators.</p>\n<p>You can discuss contingent situations, but you can't claim that they will occur.</p>\n<p>You can still work to prevent those contingent situations, and that seems to be your intention in your area of research. For example, you can work to prevent current condition \"A\", whatever that is. Nuclear proliferation, maybe, or deployment of battlefield nukes. Nice!</p>\n<p>You are not asking the question, \"What will the future be?\" without any idea of what some scenarios of the future depend on. After all, if the future is a nuclear holocaust, you can backtrack to at least some earlier point in time, for example, far enough to determine that nuclear weapons were detonated prior to the holocaust, and further to someone or something detonating them, and then maybe further to who had them, or why they detonated them, or that might be where gaps in knowledge appear.</p>\n", "parentCommentId": "infeGoDNt6cTohsLQ", "user": {"username": "Noah Scales"}}, {"_id": "CryjAXdFeBr5LPLmM", "postedAt": "2023-11-21T10:27:24.810Z", "postId": "K7aA9YXRoRQvqjXuq", "htmlBody": "<p>Hi Sarah,<br><br>Many thanks for pointing me to this. I had a brief look at the content and the comments, not yet the preceding posts and succesive posts. While I generally remain in agreement with the ALLFED teams on the neglectedness of the tail end, and how solving this also solves for other naturally occuring ASRS scenarios (albeit lower probabilities). Your argument reminds me of a perspective in animal welfare. If we improve the current condition of the billions of animal suffering, we have more of an excuse to slaughter them, in turn, empowering the meat companies, and thus it impedes our transition towards a cruelty free world.<br><br>Now I don't think I have anything to add that was not covered by the others a year ago, but I want to take this opportunitiy to steelman your case: If the lower neglectedness and higher tractability of civil movement / policy in denuclearisation to less than 300 nuclear weapons (approximate number for not causing a nuclear winter) &gt; higher neglectedness and lower tractability of physical intervention (resilience food and supply chain resilience plan), you might be correct!<br><br>The tractability can be assessed on the civilian organisations (in and out of EA) that have been working on this and the success rate of reduced stockpile / dollar spent<br><br>But note that at least half of the nuclear weapon deployed are in the hands of authoritarian countries [Russia: 3859, China: 410, North Korea: 30] which does not have good track record in listening to civil societies. While you could argue that Russia had drastically reduced their stockpile at the end of the cold war, many non-alligned countries [non-NATO, non Russia Bloc] have only increased their stockpile absolutely. I suspect with low confidence that reducing stockpile by a lot is tractable but complete denuclearisation, squeezeing the last 10% is an extremely hard up-hill battle if not impossible as countries continue to look up for their interests. There's been a lot of recent talks about in hindsight Ukraine should not have given up their nuclear weapons and Russia just lifted their ban on testing them.<br><br>Interested in your thoughts here :)<br>Chris</p>", "parentCommentId": null, "user": {"username": "chanakin"}}, {"_id": "Lhwa5YtEutxvv9Qr2", "postedAt": "2023-11-24T08:13:59.969Z", "postId": "K7aA9YXRoRQvqjXuq", "htmlBody": "<p>Thanks a lot for taking the time to read &amp; comment, Chris!&nbsp;</p><h3>Main points</h3><blockquote><p>I want to take this opportunitiy to steelman your case: If the lower neglectedness and higher tractability of civil movement / policy in denuclearisation to less than 300 nuclear weapons (approximate number for not causing a nuclear winter) &gt; higher neglectedness and lower tractability of physical intervention (resilience food and supply chain resilience plan), you might be correct!</p></blockquote><p>I (honestly!) appreciate your willingness to steelman a case that (somewhat?) challenges your own views. However, I think I don't endorse/buy the steelmanned argument as you put it here. It seems to me like the kind of simplified evaluation/description that I don't think is very well-suited for assessing strategies to tackle societal problems. More specifically, I think the simple argument/relation you outline wrongfully ignores second- and third-order effects (incl. the adverse effects outlined in the post), which I believe are both extremely important and hard to simplify/formalize.</p><p>In a similar vein, I worry about the simplification in your comment on assessing the tractability of denuclearization efforts. I don't think it's appropriate to assess the impact of prior denuclearization efforts based simply on observed correlations, for two main reasons: first, there are numerous relevant factors aside from civil society's denuclearization efforts, and the evidence we have access to has a fairly small sample size of observations that are not independent from each other, which means that identifying causal impact reliably is challenging if not impossible. Second, this is likely a \"threshold phenomenon\" (not sure what the official term would be), where observable cause-and-effect relations are not linear but occur in jumps; in other words, it seems likely here that civil society activism needs to build up to a certain level to result in clearly visible effects in terms of denuclearization (and the level of movement mobilisation required at any given time in history depends on a number of other circumstances, such as geopolitical and economic events). I don't think that civil society activism for denuclearization is meaningless as long as it remains below that level, because I think it potentially has beneficial side-effects (on norms, culture, nuclear doctrine, decision-makers' inhibitions against nuclear use, etc) and because we will never get above the threshold level if we consider efforts below the level to be pointless and not worth pursuing; but I do think that its visible effects as revealed by the evidence may well appear meaningless because of this non-linear nature of the causal relationship.</p><blockquote><p>squeezeing the last 10% is an extremely hard up-hill battle if not impossible as countries continue to look up for their interests</p></blockquote><p>I completely agree that denuclearization is an extremely hard up-hill battle, and I would argue that this is true even before the last 10% are reached. But I don't think we have the evidence to say that it's an impossible battle, and since I'm not convinced by the alternatives on offer (interventions \"to the right of boom\", or simple nihilism/giving up/focusing on other things), I think it's worthwhile - vital, actually - to keep fighting that uphill battle.</p><h3>Some further side-notes</h3><blockquote><p>But note that at least half of the nuclear weapon deployed are in the hands of authoritarian countries [Russia: 3859, China: 410, North Korea: 30] which does not have good track record in listening to civil societies. While you could argue that Russia had drastically reduced their stockpile at the end of the cold war, many non-alligned countries [non-NATO, non Russia Bloc] have only increased their stockpile absolutely.</p></blockquote><p>A short comment on the point about authoritarian states: At least for Russia and China, I think civil society/public opinion is far from unimportant (dictators tend to care about public approval at least to some extent) but agree that it's a different situation from liberal democracies, which means that assessing the potential for denuclearization advocacy would require separate considerations for the different settings. On a different note, I think there is at least some case for claiming that changing attitudes/posture in the US has some influence on possibly shifting attitudes and debate in other nuclear-weapons states, especially when considered over a longer timeframe (just as examples: there are arguments that Putin's current bellicosity is partially informed by continued US hostility and militarism esp. during the 2000s; and <a href=\"https://www.foreignaffairs.com/china/chinas-misunderstood-nuclear-expansion\">China justifies its arms build-up mainly by arguing that the huge gap between its arsenal and that of the US is unacceptable</a>). All of this would require a much larger discussion (which would probably lead to no clear conclusion, because uncertainty is immense), so I wouldn't be surprised nor blame you if the snippets of an argument presented above don't change your mind on this particular point ^^</p><p>(And a side-note to the side-note: I think it's worth pointing out that the biggest reduction in Russia's stockpiles occurred before the end of the cold war, when the Soviet Union still seriously considered themselves a superpower)</p><blockquote><p>Your argument reminds me of a perspective in animal welfare. If we improve the current condition of the billions of animal suffering, we have more of an excuse to slaughter them, in turn, empowering the meat companies, and thus it impedes our transition towards a cruelty free world.</p></blockquote><p>The analogy makes sense to me, since both some of my claims and the animal advocats' claim you mention seem to fall into the <a href=\"https://www.sciencedirect.com/topics/economics-econometrics-and-finance/moral-hazard\">moral hazards category</a>. Without having looked closely at the animal case, I don't think I <i>strongly </i>share their concern in that case (or at least, I probably wouldn't make the tradeoff of giving up on interventions to reduce suffering).&nbsp;</p><p>&nbsp;</p><p>Again, thanks a lot for your comment and thoughts! Looking forward to hearing if you have any further thoughts on the answers given above.</p>", "parentCommentId": "CryjAXdFeBr5LPLmM", "user": {"username": "Sarah Weiler"}}]