[{"_id": "B6KdMs8bAyKGj5CEJ", "postedAt": "2021-11-15T21:45:23.418Z", "postId": "K7tjvcDurrCj72D7H", "htmlBody": "<p>Thanks for writing this up. Really impressive!</p>\n", "parentCommentId": null, "user": {"username": "Peterslattery"}}, {"_id": "jnqxQiPjSRfjrTLDy", "postedAt": "2021-11-16T18:38:45.908Z", "postId": "K7tjvcDurrCj72D7H", "htmlBody": "<p>I've respected Rethink's work for a long time. Excited to see you guys expanding into the longtermist space!</p>\n<p>Could you clarify how your stated \"room for more funding\" relates to your budget plans? For example, the maximally ambitious RFMF for longtermism in 2022 is $5.34m, but the maximally ambitious budget for 2022 is $2.5m. Is the idea that you would hold onto some money for 2023?</p>\n", "parentCommentId": null, "user": {"username": "AshwinAcharya"}}, {"_id": "acbBDrtnZgnrCJNu5", "postedAt": "2021-11-16T20:04:30.211Z", "postId": "K7tjvcDurrCj72D7H", "htmlBody": "<p>This is correct - the RFMF is how much we think we'd like to raise between now and the end of 2022 to spend in 2022 and 2023 according the budgets above.&nbsp;</p>", "parentCommentId": "jnqxQiPjSRfjrTLDy", "user": {"username": "abrahamrowe"}}, {"_id": "3cpqGkoFYCWCjiPQe", "postedAt": "2021-11-18T01:17:04.342Z", "postId": "K7tjvcDurrCj72D7H", "htmlBody": "<blockquote><p>These and other large organizations often only fund 25–50% of our needs in any particular area</p></blockquote><p><br>I'm confused about this phrasing. Is this saying that large orgs only fund 25-50% of our needs <i>each</i>, or <i>total</i>?</p><p>I keep up with the fundraising much less than you and some others at RP do, but my impression is that the number is more like 25-50% from <i>each</i> funding org, rather than 25-50% total.&nbsp;<br><br>E.g., LTFF may only be willing to fund <a href=\"https://funds.effectivealtruism.org/funds/payouts/may-2021-long-term-future-fund-grants#rethink-priorities--70000\">up to 25% for our longtermism team's work</a>, Open Phil 50%, and other large orgs less willing to \"top up\" after 75% from existing institutional donors.&nbsp;<br><br>So maybe 50-75% may be more accurate. Though again I haven't really kept up with the numbers since late 2020 (thanks Peter, Marcus, Janique et al for sparing researcher time!), so maybe my impressions are way off. &nbsp;</p>", "parentCommentId": null, "user": {"username": "Linch"}}, {"_id": "aJvuj3JCC2mngijRg", "postedAt": "2021-11-19T15:09:35.039Z", "postId": "K7tjvcDurrCj72D7H", "htmlBody": "<p>Yes, we were referring to several instances in which a major grantmaker either gave us only 25% or only 50% of the amount we requested in a specific grant application.<br>Thanks for helping us clarify!</p>", "parentCommentId": "3cpqGkoFYCWCjiPQe", "user": {"username": "Janique"}}, {"_id": "Jo9vmETngkCtnTszL", "postedAt": "2021-11-24T16:16:34.871Z", "postId": "K7tjvcDurrCj72D7H", "htmlBody": "<p>How do I make cause area restricted donations?</p>\n", "parentCommentId": null, "user": {"username": "anishazaveri"}}, {"_id": "KdbmyQiD5WsPJLpMb", "postedAt": "2021-11-24T20:54:06.441Z", "postId": "K7tjvcDurrCj72D7H", "htmlBody": "<p>If you're donating on our website (https://rethinkpriorities.org/donate), on the second part of the donate form, you can add a comment. Just add a note there if you'd like us to restrict your gift to a specific pool - our finance team sees these notes.</p><p>If you're giving via another platform (EA Funds, a DAF, etc.) feel free to just email us at info@rethinkpriorities.org and let us know!</p><p>Thanks for supporting us!</p>", "parentCommentId": "Jo9vmETngkCtnTszL", "user": {"username": "abrahamrowe"}}, {"_id": "FpNJfw8prQC6QwB2X", "postedAt": "2021-11-28T00:47:00.200Z", "postId": "K7tjvcDurrCj72D7H", "htmlBody": "<p>Can you give more details on the $$ you moved in EU animal welfare advocacy/funding? What kinds of approaches did it move from and to? Any exact numbers and specific organizations you can share?</p><p>I poked around your website but couldn't see more on this—apologies if I missed it!</p>", "parentCommentId": null, "user": {"username": "anpr"}}, {"_id": "JqjatFynhZ8cZeZhj", "postedAt": "2021-11-29T00:03:15.603Z", "postId": "K7tjvcDurrCj72D7H", "htmlBody": "<p>Thanks for the question, but unfortunately we can not share more about those involved or the total.</p>\n<p>I can say we're confident this unlocked millions for something that otherwise wouldn't have happened. We think maybe half of the money moved would not have been spent, and some lesser amount would have been spent on less promising opportunities from an EA perspective.</p>\n", "parentCommentId": "FpNJfw8prQC6QwB2X", "user": {"username": "Marcus_A_Davis"}}]