[{"_id": "5J4mZPDzno3rDoZwe", "postedAt": "2017-09-19T00:09:30.881Z", "postId": "K8D8hmaCYFtvhg5ZJ", "htmlBody": "<blockquote>\n<p>Would a transparent idea directory enable refinement of good ideas into great ones, help great ideas find a team, all the while reducing the overall burden of transaction costs associated with considering new ideas?</p>\n</blockquote>\n<p>A transparent idea of <em>proposals</em> should have some effect in this direction. I've asked for a transparent directory of projects for months; it's something I'd like to see funders like EA Grants and thought-leaders like 80,000 work on. However, we need to be cautious because pure ideas are not very scarce. They may be 20% of the bottleneck but 80% is getting talented people. So new project proposals should be presented in such a way that founders will see these ideas and notice if they are a good fit for them.</p>\n<blockquote>\n<p>I- Ready for implementation. These are extremely well considered ideas that support EA principles and have/will contribute good evidence for effectiveness.\nII- Worth refining. These are promising ideas that can be upgraded to type I with more background research, adjustments in strategy, etc.\nIII- Back to the drawing board. These are well intentioned but miss the mark in an important way, perhaps an over-reliance on intuition or misinformation.</p>\n</blockquote>\n<p>I guess that (II-III) are more like forum posts and should usually be filtered out without need for formal review. I think even most proposals in category (I) are too weak to be likely to suceed. I would use a more stringent checklist e.g. (a) funding may be available (b) part of a founding team is available (c) there is some traction demonstrated.</p>\n<blockquote>\n<p>Too many ideas and not enough doers increases the likelihood that doers will settle on weak ideas... if the number of doers is saturated, they only gum up the works. </p>\n</blockquote>\n<p>There are forces in both directions. If more high-quality ideas are shared, then doers may be less likely to settle on weak ideas.</p>\n<blockquote>\n<p>Finally, the main goal of a transparent idea directory is to reduce the unavoidable transaction costs of new ideas. </p>\n</blockquote>\n<p>Then the focus of such a project should not just be to archive ideas, it should be to have more ideas turned into action.</p>\n<p>General thought: I think the quality of ideas is far more important than quantity here. I would much rather see two ultra-high-quality proposals online in a system like this than ten mid-range quality ones. It would be good if people could be encouraged to solicit line-by-line feedback by putting their proposals in google docs, and also if there was a requirement for authors to allow anonymous private feedback. Proposals that are substantially downvoted should perhaps disappear for redrafting. Perhaps team-members should be able to submit themselves as candidates for future projects, awaiting a suitably matched project, IDK. It seems like an important space!</p>\n", "parentCommentId": null, "user": {"username": "RyanCarey"}}, {"_id": "JMsoS5yEb8cStzYGY", "postedAt": "2017-09-19T03:27:47.777Z", "postId": "K8D8hmaCYFtvhg5ZJ", "htmlBody": "<p>Thanks for the thoughtful comments, agree almost completely, particularly your closing points.</p>\n<p>My main quibble is the comparison of talent vs ideas as a bottleneck, where you say talent is 80% of the problem compared to ideas at 20%. I certainly agree that lots of weak ideas pose problems, but the trouble with with this comparison is that the first step to recruiting more talent will be an idea. So, in a sense, the talent gap IS an idea gap. In fact, aside from blind luck, every improvement on what we have will first be an idea. Perhaps we shouldn't think of ideas in opposition to anything, but instead work to maximize them (and keep the bad ones out of the way). Every gap has an idea component, essentially waiting for a better idea for how to close it. </p>\n<p>Additionally, having high-yield, impactful ideas on hand that will make a difference could attract talent that might otherwise see EA as a bunch of airy headed idealists. Finally, if talent rather than ideas is the true bottleneck, then it's all the more important to make sure talent gets connected with the best ideas.  </p>\n<p>Minor point- Regarding weak ideas, I think there is some value for people to see (a) what makes bad ideas bad and (b) whether or not a particular idea has already been floated, thereby cutting down on redundancy.</p>\n", "parentCommentId": "5J4mZPDzno3rDoZwe", "user": {"username": "astupple"}}, {"_id": "nZ7GZzrQjgdgCJynF", "postedAt": "2017-09-19T04:49:48.728Z", "postId": "K8D8hmaCYFtvhg5ZJ", "htmlBody": "<p>I strongly agree with you that the kinds of qualities required to think of a good idea are very different from the kinds of qualities that are required to put that idea into action. I think this would be a very interesting experiment.</p>\n<p>One of the main challenges is that it is often hard to separate an idea from its implementation. For example, suppose I have a broad idea to spread EA-style thinking within the global warming community in order to increase their effectiveness and also, hopefully, make it more likely that some of them get involved in EA.</p>\n<p>There are a lot of questions that come immediately to mind:</p>\n<ul>\n<li><p>What kind of organisation are we talking about? Are we thinking of publishing papers in environmental journals or building a website to convince people on a grassroots level or running a seminar?</p>\n</li>\n<li><p>What organic attempts have there been to spread such thinking and why have they failed or not succeeded completely, ect?</p>\n</li>\n<li><p>Where will I get the necessary funds, volunteers and advice from?</p>\n</li>\n</ul>\n<p>Some of these questions will end up being questions highly contingent on local situations. Some of these questions are best approached via trial and error. Some of these questions will lead different people to come to different conclusions so that even if someone has mostly the same general idea, they are likely to discard or not make use of much of your work because it is contingent on an assumption that they reject (ie. that you should reach out to the grassroots rather than to the leaders).</p>\n<p>So there are all of these challenges, but nonetheless, I'd love to see someone try this experiment.</p>\n", "parentCommentId": null, "user": {"username": "casebash"}}, {"_id": "zz885NLGBN6Rrj3Sw", "postedAt": "2017-09-19T19:09:25.439Z", "postId": "K8D8hmaCYFtvhg5ZJ", "htmlBody": "<p>I'm going to try to explain here why I am suspicious of the need for this.</p>\n<p>People who do things are not, in general, idea constrained from what I can tell. Lots of people have lots of ideas about what they could do and there are already people making arguments for and against these ideas in public forums. People who choose to act do so based in part of how these discussions of ideas influence their thinking, but filtered through the lens of experience at making stuff happen.</p>\n<p>Additionally, we already have a lot of ideas people recognize as being worth implementing that no one is working on or work being done on them has not yet come to fruition. It doesn't take long, relative to the effort that will be invested to do something, to read and think enough to decide what to do, so it seems more likely to me that on the margin we need more desire to do than more curation of ideas about what to do.</p>\n<p>All this said, if you want to do something I think there is something to be done in terms of curating the list of ideas/projects you want to see people know about and promoting the existence of that list. Or writing about specific ideas/projects you think people should work on and trying to convince folks they should work on those. But an idea directory of the sort you propose sounds to me like a lot of make-work to see only slightly more clearly the landscape doers are already navigating.</p>\n", "parentCommentId": null, "user": {"username": "gworley3"}}, {"_id": "y3mSLLnH98BQcxCui", "postedAt": "2017-09-20T02:08:19.489Z", "postId": "K8D8hmaCYFtvhg5ZJ", "htmlBody": "<p>While I completely see what you're saying, at the risk of sounding obtuse, I think the opposite of your opener may be true.</p>\n<p>&quot;People who do things are not, in general, idea constrained&quot;</p>\n<p>The contrary of this statement may be the fundamental point of EA (or at least a variant of it): People who do things in general (outside of EA) tend to act on bad ideas. In fact, EA is more about the ideas underlying what we do than it is about the doing itself. Millions of affluent people are doing things (going to school, work, upgrading their cars and homes, giving to charity), without examining the underlying ideas. EA's success is its ability to convert doers to adopt its ideas. It's creating a pool of doers who use EA ideas instead of conventional wisdom. </p>\n<p>Perhaps there are two classes of doers, those already in the EA community who &quot;get it,&quot; and those outside who are just plugging away at life. When I think of filling talent gaps, I think that can be filled by (A) EA community members developing skills, and (B) recruiting skilled people to join the community. Group A probably doesn't need good ideas because they've already accepted the ideas of our favorite thinkers etc. The marginal benefit of even better ideas is small. Instead, group A is better off if it simply gets down to the hard work of growing talent. But group B is laboring under bad ideas, and for many, it might not take much at all to get them to substitute bad ideas for EA-ideas. My guess is that, to grow talent, it is easier to convert doers from group B than to optimize doers in group A (which is certainly not to say group A shouldn't do the hard work of optimizing their talent).</p>\n<p>There is an odd circularity here- I think I just argued myself out of my original stance. I seem to have just concluded that we shouldn't focus on the ideas of the EA community (which was my original intention) and instead should focus on methods of recruiting. </p>\n<p>Maybe I'm arguing that we should develop recruiting ideas?</p>\n<p>Also- any suggestions for good formal discussions of the philosophy and sociology of ideas (beyond the slightly nauseating pop business literature)? &quot;Where Good Ideas Come From&quot; by Steven Johnson is excellent, but not philosophically rigorous.</p>\n", "parentCommentId": "zz885NLGBN6Rrj3Sw", "user": {"username": "astupple"}}, {"_id": "gckfTFfQJGowMDEx4", "postedAt": "2017-09-20T17:54:27.902Z", "postId": "K8D8hmaCYFtvhg5ZJ", "htmlBody": "<blockquote>\n<p>Maybe I'm arguing that we should develop recruiting ideas?</p>\n</blockquote>\n<p>Yep :-)</p>\n<blockquote>\n<p>Also- any suggestions for good formal discussions of the philosophy and sociology of ideas (beyond the slightly nauseating pop business literature)? &quot;Where Good Ideas Come From&quot; by Steven Johnson is excellent, but not philosophically rigorous.</p>\n</blockquote>\n<p>I don't but I suspect some folks around here do. Talk to Malcolm Ocean maybe?</p>\n", "parentCommentId": "y3mSLLnH98BQcxCui", "user": {"username": "gworley3"}}, {"_id": "iuGnRvYYw8SzKvjJv", "postedAt": "2017-09-21T00:39:25.968Z", "postId": "K8D8hmaCYFtvhg5ZJ", "htmlBody": "<p>Malcolm Ocean- fantastic! thanks!</p>\n", "parentCommentId": "gckfTFfQJGowMDEx4", "user": {"username": "astupple"}}, {"_id": "Mo8co5akHP3CgoB5k", "postedAt": "2017-09-21T00:39:32.404Z", "postId": "K8D8hmaCYFtvhg5ZJ", "htmlBody": "<p>Interesting. It sounds like you're possibly suggesting there's a taxonomy of ideas. Some ideas warrant simple experiments (in this case, a simple experiment would be to review the various EA threads and simply enter proposed ideas in a table online), others warrant further research (like some of the questions begot by your global warming example), etc. Am I describing this right? I'm guessing this must have been done- any ideas on where to look.</p>\n<p>Perhaps it's worthwhile to review the analysis of- &quot;What are productive ideas?&quot; Ultimately, this could result in a one-pager about what a good idea is, how to develop it, and how (when, and to whom) to pitch it. </p>\n", "parentCommentId": "nZ7GZzrQjgdgCJynF", "user": {"username": "astupple"}}, {"_id": "oqvgyBSYLt8xYv25m", "postedAt": "2017-09-21T06:42:52.545Z", "postId": "K8D8hmaCYFtvhg5ZJ", "htmlBody": "<p>If we've got more ideas than talented people, it seems like being able to prioritize ideas well is very important.  Having people work on the best 10% of ideas is much better than having people work on 10% of the ideas that are chosen at random.  I think a transparent idea directory could be very valuable for prioritization, because in order to prioritize well, you would like to be able to brainstorm as many possible pros and cons for any given idea as possible.</p>\n<p>To put it another way, getting more people involved in prioritization means we can take advantage of a broader array of perspectives.  See <a href=\"http://blog.givewell.org/2014/06/10/sequence-thinking-vs-cluster-thinking/\">Givewell on cluster thinking</a>.  I think having people brainstorm ways in which a proposal might end up being <a href=\"https://www.facebook.com/groups/effective.altruists/permalink/1263971716992516/\">unexpectedly harmful</a> could be especially valuable.</p>\n<blockquote>\n<p>General thought: I think the quality of ideas is far more important than quantity here.</p>\n</blockquote>\n<p>My impression is that idea production is <a href=\"https://blog.codinghorror.com/quantity-always-trumps-quality/\">like pottery</a> in the sense that the best way to get quality is to aim for quantity.</p>\n", "parentCommentId": "5J4mZPDzno3rDoZwe", "user": {"username": "John_Maxwell_IV"}}, {"_id": "Ft9Jgj6Hsaghxb8tj", "postedAt": "2017-09-21T14:34:58.142Z", "postId": "K8D8hmaCYFtvhg5ZJ", "htmlBody": "<p>You don't need to have argued yourself out of the position. Here's the thought: ideas are important. Evidence in this direction is EA coming along and showing people their previous ideas were bad. Continuing in the same line, unless we think we have all the best ideas already - which would be frighteningly arrogant - that suggests continuing to developing our ideas would be very useful. Hence working on ideas is still very important for those who, as you said, already &quot;get it&quot;. </p>\n<p>Gworly is right that people aren't lacking ideas. You (astupple) were right that they often lacking good ideas. </p>\n<p>Further, on this:</p>\n<blockquote>\n<p>It doesn't take long, relative to the effort that will be invested to do something, to read and think enough to decide what to do, so it seems more likely to me that on the margin we need more desire to do than more curation of ideas about what to do</p>\n</blockquote>\n<p>This is statement lots of philosophers, including those within EA, would disagree with. Indeed, the whole point of 80k is that your life is a long time and it's fitting to spend a non-trivial period reflecting on how to do good. </p>\n", "parentCommentId": "y3mSLLnH98BQcxCui", "user": {"username": "MichaelPlant"}}, {"_id": "ooBAsaYMqrxqNXe5k", "postedAt": "2017-09-21T18:59:40.737Z", "postId": "K8D8hmaCYFtvhg5ZJ", "htmlBody": "<blockquote>\n<p>The proposed website would need to be fairly sophisticated to handle the multiple inputs, and would likely need nearly constant updating.</p>\n</blockquote>\n<p>It's possible that you could cobble something together using Google Forms + Google Sheets/<a href=\"https://fieldbook.com/\">Fieldbook</a>/<a href=\"https://airtable.com/\">Airtable</a>/wiki software/etc. until you really understood the needs of your use case.</p>\n", "parentCommentId": null, "user": {"username": "John_Maxwell_IV"}}]