[{"_id": "vuoCFALkkYgWcnYjH", "postedAt": "2023-02-16T19:27:28.132Z", "postId": "K9GdCuiz5tanoiDKN", "htmlBody": "<p>Really interesting post. Your responses to the stock arguments seem pretty compelling. Looking forward to seeing your positive proposal.</p>\n<p>I wonder what you think of the idea that consistency is an externally imposed constraint on preferences akin to every other moral requirement. So from a totally self involved standpoint there might be no way to reason yourself into really striving for consistency, in the same way that for someone who didn't already care about suffering, there might be no way to reason themself into caring about it. Instead it's just this constraint we impose on people so they can function in a society. If you don't care about suffering, we do various things to punish you until you do -- and specifically we do stuff until you actually care about suffering for its own sake, not just pretend you do when that stops you from being punished. Similarly we enforce consistency as a constraint on preferences/moral views because of broader societal benefits of existing in a group of people who are like that (eg we can actually reason together).</p>\n<p>Related to this, I feel like the antirealist might reply to the point about not having a strong enough brute preference for consistency to outweigh real stakes in terms of pleasure and suffering in a basically deontological way. Well-socialized people don't just have preferences of some particular strength for outcomes of various moral value; they internalize moral rules for action that just rule out certain behaviors even if they lead to better states (of course maybe this just means that aspect of socialization is bad). In the same way, it's not like I have a preference of whatever strength for worlds where I'm consistent, and then I weigh that preference against the value of the stuff I have to trade it off against. I just internalize an epistemic rule governing my moral attitudes and I abide by it.</p>\n<p>None of this is actually an argument that people who don't currently care about consistency should start doing so. But I think you could spin a vindicatory story, from the point of view of someone who has internalized consistency as a norm, of the value of doing so. And that story would look a lot like the story you'd tell about the value of internalizing norms against lying, etc., even when doing so might maximize utility.</p>\n", "parentCommentId": null, "user": null}, {"_id": "9GRc4PrWe3kQrHJa2", "postedAt": "2023-02-17T00:25:39.972Z", "postId": "K9GdCuiz5tanoiDKN", "htmlBody": "<p>What an interesting and fun post! Your analysis goes many directions and I appreciate your investigation of normative, descriptive, and prescriptive ethics.</p>\n<p>The repugnant conclusion worries me. As a thought experiment, it seems to contain an uncharitable interpretation of principles of utilitarianism.</p>\n<ol>\n<li>\n<p><strong>You increase total and average utility to measure increases in individual utility across an existing and constant population.</strong>  However, those measures, total and average, are not adequate to handle the intuition people associate with them. Therefore, they should not be used for deciding changes in utility across a population of changing size or one containing drastic differences in individual utility. For example, there's no value in increasing total utility by adding additional people, but it will drive total utility up, even if individual utility is low.</p>\n</li>\n<li>\n<p><strong>You pursue egalitarianism to <em>raise</em> everyone's utility up to the same level.</strong> Egalitarian is not an aspiration to lower some people's well-being while raising other's well-being. Likewise, egalitarianism is not pursuit of equality of utility at any utility level. Therefore, egalitarianism does not imply an overriding interest in equalizing everyone's utility. For example, there's no value in lowering other's utility to match those with less.</p>\n</li>\n<li>\n<p><strong>You measure utility accumulated by existent people in the present or the future to know utility for all individuals in a population and that utility is only relevant to the time period during when those people exist.</strong> Those individuals have to exist in order for the measures to apply. Therefore, utilitarianism can be practiced in contexts of arbitrary changes in population, with a caveat: consequences for others of specific changes to population, someone's birth or death, are relevant to utilitarian calculations. <strong>TIP:</strong> the repugnant conclusion thought experiment only allows one kind of population change: increase. You could ask yourself whether the thought experiment says anything about the real world or requirements of living in it.</p>\n</li>\n<li>\n<p><strong>Utility is defined with respect to purposes (needs, reasons, wants) that establish a reference point of accumulation of utility suitable for some purpose.</strong> That reference point is always at a finite level of accumulation. Therefore, to assume that utility should be maximized to an unbounded extent is an error, and speaks to a problem with some arguments for transitivity.  <strong>NOTE:</strong> by definition, if there is no finite amount of accumulated utility  past which you have an unnecessary amount for your purposes, then it is not utility for you.</p>\n</li>\n</ol>\n<p>The repugnant conclusion does not condemn utilitarianism to disuse, but points 1-4 seem to me to be the principles to treat charitably in showing that utilitarianism leads to inconsistency. I don't believe that current formulations of the repugnant conclusion are charitable to those principles and the intuitions behind them.</p>\n", "parentCommentId": null, "user": {"username": "Noah Scales"}}, {"_id": "pMqPnqzwNvfRAw3N3", "postedAt": "2023-02-17T05:31:40.206Z", "postId": "K9GdCuiz5tanoiDKN", "htmlBody": "<blockquote><p>Finally, at T<sub>3</sub>, I learn that in fact, the pregnancy hasn’t yet occurred, so I pay to avoid becoming pregnant at all.<a href=\"#fn3g7sr1is6lz\"><sup>[34]</sup></a></p></blockquote><p>Do you also avoid most of the cost of the operation? E.g. there was a fee to sign up (you said you \"pay to sign up for the operation\"), but then you'd pay much more later, and you've now avoided that extra cost. Or you paid for the operation upfront but then get most of it reimbursed.</p><p>Otherwise, if you've already mostly paid and can't get your money back, then I'd think you'd just go through with the pregnancy and operation. Unless, you now think it's worse to have a child than not with your current level of wealth, which is much lower because of the cost of the operation.</p>", "parentCommentId": null, "user": {"username": "MichaelStJules"}}, {"_id": "qgBRFEGPJTEWsp5NK", "postedAt": "2023-02-20T08:40:07.137Z", "postId": "K9GdCuiz5tanoiDKN", "htmlBody": "<p>Great post.\nI think the money pump argument still works to some extent because:\nIn some remote possible worlds accepting the repugnant conclusion (or not) costs huge utility\nwhile inconsistency costs infinite utility because you get pumped and pumped again.\nIn the real world it won't cost much but accepting the repugnant conclusion won't either, because you probably don't get to make such population choices.\nThus the only remaining downside is making yourself uncomfortable, but how uncomfortable really? If you're really that uncomfortable (to be considered a big utility loss) then you probably shouldn't think about it even if you're a moral realist. Maybe it isn't a special problem for anti realist after all?</p>\n", "parentCommentId": null, "user": {"username": "Ryze"}}, {"_id": "uw6yaWLybu5kpR28N", "postedAt": "2023-02-24T18:51:18.662Z", "postId": "K9GdCuiz5tanoiDKN", "htmlBody": "<p>I'm curating this post. I'll try to outline what I particularly appreciate about it later, but for now, I'll just excerpt this bit:&nbsp;</p><blockquote><p>The standard practice – both amongst realists and anti-realists — often works within an implicitly realist frame, on which one’s intuitions are (imperfect) evidence about the true underlying principles (<a href=\"https://joecarlsmith.com/2022/01/17/the-ignorance-of-normative-realism-bot\">why would you think that</a>?), which are typically assumed to have pr operties are like consistency, coherence, and so on. To find these principles, one attempts to “curve fit” one’s intuitions – and different ethicists make different trade-offs between e.g. the simplicity and elegance of the principles themselves, vs. the accuracy with which they predict the supposed “data.”<a href=\"https://forum.effectivealtruism.org/posts/K9GdCuiz5tanoiDKN/why-should-ethical-anti-realists-do-ethics#fn0uut1b6aqov\"><sup>[5]</sup></a>&nbsp;But if this practice isn’t helping us towards the objective normative truth, why would we go in for it?</p></blockquote><p><img src=\"https://res.cloudinary.com/cea/image/upload/v1676524831/mirroredImages/K9GdCuiz5tanoiDKN/qphfubnyriqubimgrsln.png\" alt=\"\" srcset=\"https://res.cloudinary.com/cea/image/upload/v1676524831/mirroredImages/K9GdCuiz5tanoiDKN/qphfubnyriqubimgrsln.png 1010w, https://res.cloudinary.com/cea/image/upload/v1676524831/mirroredImages/K9GdCuiz5tanoiDKN/dspzveoddavtlevgn0u9.png 300w, https://res.cloudinary.com/cea/image/upload/v1676524831/mirroredImages/K9GdCuiz5tanoiDKN/sbkikuehsar0ztetbfda.png 768w, https://res.cloudinary.com/cea/image/upload/v1676524831/mirroredImages/K9GdCuiz5tanoiDKN/vamnl2mkoa3xe1lc86nd.png 402w, https://res.cloudinary.com/cea/image/upload/v1676524830/mirroredImages/K9GdCuiz5tanoiDKN/xtgvzevcf1ycqhzp9t7r.png 462w, https://res.cloudinary.com/cea/image/upload/v1676524831/mirroredImages/K9GdCuiz5tanoiDKN/owfyfax8sqfuu2mhplwk.png 662w, https://res.cloudinary.com/cea/image/upload/v1676524831/mirroredImages/K9GdCuiz5tanoiDKN/tn5ns6bj0bx4ibfib619.png 722w, https://res.cloudinary.com/cea/image/upload/v1676524830/mirroredImages/K9GdCuiz5tanoiDKN/ecp3jsamotdbrygakecd.png 982w\"></p>", "parentCommentId": null, "user": {"username": "Lizka"}}, {"_id": "XG59SPdbmc42BYSWG", "postedAt": "2023-02-25T05:07:09.157Z", "postId": "K9GdCuiz5tanoiDKN", "htmlBody": "<p>Great post! You do a great job walking readers through the whole thought process.</p><p>&nbsp;</p><p>As far as this line goes:</p><blockquote><p><i>Me</i>: … but, like, intransitive preferences… like, what are you even doing with your life, yano?</p></blockquote><p><br>It seems like you're dancing around this idea with the feeling that if ethics are inconsistent, then why should I have/follow ethics?</p><p>A helpful way to investigate this idea is to start with the question: even if I'm a moral realist with consistent ethics, why should I have/follow ethics?</p>", "parentCommentId": null, "user": {"username": "Cole Killian"}}, {"_id": "XCjYsd6auX3xdkmcF", "postedAt": "2023-02-26T00:11:06.902Z", "postId": "K9GdCuiz5tanoiDKN", "htmlBody": "<p>Just a small note here about Frick's case you mentioned in footnote 34. I believe Frick's case is now in print, in \"Context-Dependent Betterness and the Mere Addition Paradox\", which I think is in Ethics and Existence (2022). You know the book I guess. I've only got a preprint in front of me, but the case there is called \"Change of Plans\". I'd guess he kept the name.</p>", "parentCommentId": null, "user": {"username": "Tomi Francis"}}, {"_id": "gHhtBc9gLLMSPGkbT", "postedAt": "2023-02-28T08:03:51.132Z", "postId": "K9GdCuiz5tanoiDKN", "htmlBody": "<p>Some random thoughts:</p><ol><li>Whenever I hear someone (usually Will Macaskill) say: \"If utilitarianism is correct...\" I don't hear it as a coherent sentence. I don't think there is a fundamental ethical truth that utilitarianism is trying to get at. I'd still happily call myself a utilitarian, as I believe it's the best, most coherent way of thinking about ethics- I even 'bite the bullet' of the repugnant conclusion. But utilitarianism doesn't feel like the kind of thing that can be 'true' or 'false'.&nbsp;</li><li>But I feel I agree with the 'realist' side of this paper more than the 'anti-realist'. When I'm 'doing' ethics, I'd rather do it well and consistently. I tend to slightly disagree with Scott Alexander in that post.&nbsp;</li><li>But ethics, especially utilitarianism, is so demanding that you need a way to 'get out of it' - I do that by just 'not doing ethics' - I would be a 'better person' if I did ethics more consistently, but I just don't - I also spend most of my time not even considering utilitarian ethics. I <i>should </i>but don't <i>need </i>to be ethical. I'm bound by utilitarian ethics in a similar way that I'm bound by my own bodily desires, politeness norms, family ties, occasional propensity to turn into a dire wolf etc.&nbsp;</li><li>But I don't think it works in the Scott Alexander/ lizard/ utopia case. If there's a time to take ethics deadly seriously, it's when you've got a zillion potentially net-positive lizard lives on the scales!&nbsp;</li></ol>", "parentCommentId": null, "user": {"username": "Dzoldzaya"}}, {"_id": "FqKzQ9H63S8JY8eEC", "postedAt": "2023-02-28T20:08:24.139Z", "postId": "K9GdCuiz5tanoiDKN", "htmlBody": "<p>Curve-fitting on an individual level can be selfishly driven, as you say, by a desire to become more coherent in order to avoid money-pumps and develop a better \"active posture\" guide for action / decision theory.</p><p>But one reason that people care so much about curve-fitting (when, as you note, those individual selfish motives seem kinda weak) is that curve-fitting is a very important societal project. &nbsp;In order to create societies where many people (with conflicting desires, values, etc) can live together harmoniously/prosperously, we need to have some objective-ish standards (morality, criminal law, norms, etc) that are simple and universal enough that people can actually use them to make decisions and assign status and enforce punishments for violations.</p><p>So, there is a middle ground between trying to create the simplest possible curve (like total hedonic utilitarianism) in an attempt to capture realist moral truth with scientific elegance, versus drawing a ridiculously overfitted curve because \"whatever\". &nbsp;In practice, the degree of curve-fitting / \"overfitting\" to do is determined by:</p><ul><li>Society is curve-fitting to the \"data points\" of the moral intuitions of many people in society, not a single individual. &nbsp;Fortunately, humans are sorta similar, so most people can be mostly satisfied by enforcing that everyone follow the \"average\" of everyone's different intutions. &nbsp;This prohibits the most severe kinds of overfitting.</li><li>Societal rules also have to be somewhat coherent and universal in order to work -- everyone might simultaneously believe that \"stealing other people's stuff is fun\" and \"it sucks when people steal my stuff\", but those desires are in conflict so society will have to come up with some unsatisfying compromise like \"stealing is never okay for anyone\" or \"stealing is always okay for everyone\" or \"only the king can steal other people's stuff, and nobody else can steal\" or etc, otherwise people will constantly get into fights. &nbsp;This universality / coherence requirement also prohibits extreme, self-serving types of overfitting.</li><li>Otherwise, the rules should be overfit as much as possible to try to capture as many details of the average human moral intuition as possible, so that people can live as comfortably and happily as possible with the rules.</li><li>But! &nbsp;The rules can't be too complex, because then people couldn't remember them or apply them in normal life. &nbsp;This also constrains the amount of overfitting that can be done.</li></ul><p>Of course, as an ethical anti-realist, you don't have to participate in the societal project of trying to create the moral theory which will result in the most coherent, satisfied, prosperous society or whatever! &nbsp;You can just say \"screw society's rules\" and decide to be total hedonic utilitarian if you want, because you like scientific-style parsimony! &nbsp;But in practice, human psychology and society has been deeply shaped by this project of creating societally optimal curves for morality / laws / norms. &nbsp;So, you probably were raised in a culture that imbued you with a desire to have a moral system that is some intermediate level of overfitted. &nbsp;So that's where the feeling that we should quest for a moral law of intermediate overfittedness comes from.<br><br>Hopefully this was helpful or at least thought-provoking. &nbsp;I'd be happy to talk more about this if you are interested:<br>- how this intersects with the examples of slavery, factory farming, and other moral circle expansions<br>- how we might be able to overfit harder and thus better satisfy human preferences if we got better at remembering the rules by writing them down in law or applying them automatically or something<br>- how the situation might change if the diversity of values/desires/etc in society went up or down, making the average of everyone's intuition more or less satisfying to the typical person<br>- analagous situations (under capitalism, we use money as an imperfect curve-fit-style representation of who owes favors to whom -- but the requirements for universality and coherency force some weird deviations from the ordinary/intuitive way that favors are reckoned)<br>- why individual people might develop preferences for relatively more or less overfit ethics<br><br>Anyways, &nbsp;I really loved your post and it helped clarify some important stuff for me! &nbsp;Thank you for writing it.</p>", "parentCommentId": null, "user": {"username": "Jackson Wagner"}}, {"_id": "nC5HfKhySXFecdXeA", "postedAt": "2023-03-02T22:40:30.397Z", "postId": "K9GdCuiz5tanoiDKN", "htmlBody": "<p>Late to the party (and please forgive me if I overlooked a part where you address this), but I think this all misses the boring and kinda unsatisfying but (I’d argue) correct answer to the question posed:</p><blockquote><p>Why should ethical anti-realists do ethics?</p></blockquote><p><i>Because they might be wrong! &nbsp;</i></p><p>Ok, my less elegant, more pedantically precise claim (argument?) is that:&nbsp;</p><ol><li>Ethical anti-realists <i>should</i> do ethics iff moral realism is true in such a way that includes normativity (rather than just 'objective ordering'-flavor realism)</li><li>It <i>would be good </i>for anti-realists to do ethics<i> </i>iff moral realism is true<i> </i>(even if normativity is<i> </i>fake but statements like \"all else equal, a world with more suffering is worse than its alternative\" have truth values )</li><li>Anti-realism, if true, would (intrinsically) have no positive implications<ol><li>I know this is a controversial claim, and kinda what this whole post is about!&nbsp;</li><li>(I initially wrote 'anti-realism<span><span class=\"mjpage\"><span class=\"mjx-chtml\"><span class=\"mjx-math\" aria-label=\"\\implies\"><span class=\"mjx-mrow\" aria-hidden=\"true\"><span class=\"mjx-mspace\" style=\"width: 0.278em; height: 0px;\"></span><span class=\"mjx-mo\"><span class=\"mjx-char MJXc-TeX-main-R\" style=\"padding-top: 0.225em; padding-bottom: 0.372em;\">⟹</span></span><span class=\"mjx-mspace\" style=\"width: 0.278em; height: 0px;\"></span></span></span><style>.mjx-chtml {display: inline-block; line-height: 0; text-indent: 0; text-align: left; text-transform: none; font-style: normal; font-weight: normal; font-size: 100%; font-size-adjust: none; letter-spacing: normal; word-wrap: normal; word-spacing: normal; white-space: nowrap; float: none; direction: ltr; max-width: none; max-height: none; min-width: 0; min-height: 0; border: 0; margin: 0; padding: 1px 0}\n.MJXc-display {display: block; text-align: center; margin: 1em 0; padding: 0}\n.mjx-chtml[tabindex]:focus, body :focus .mjx-chtml[tabindex] {display: inline-table}\n.mjx-full-width {text-align: center; display: table-cell!important; width: 10000em}\n.mjx-math {display: inline-block; border-collapse: separate; border-spacing: 0}\n.mjx-math * {display: inline-block; -webkit-box-sizing: content-box!important; -moz-box-sizing: content-box!important; box-sizing: content-box!important; text-align: left}\n.mjx-numerator {display: block; text-align: center}\n.mjx-denominator {display: block; text-align: center}\n.MJXc-stacked {height: 0; position: relative}\n.MJXc-stacked > * {position: absolute}\n.MJXc-bevelled > * {display: inline-block}\n.mjx-stack {display: inline-block}\n.mjx-op {display: block}\n.mjx-under {display: table-cell}\n.mjx-over {display: block}\n.mjx-over > * {padding-left: 0px!important; padding-right: 0px!important}\n.mjx-under > * {padding-left: 0px!important; padding-right: 0px!important}\n.mjx-stack > .mjx-sup {display: block}\n.mjx-stack > .mjx-sub {display: block}\n.mjx-prestack > .mjx-presup {display: block}\n.mjx-prestack > .mjx-presub {display: block}\n.mjx-delim-h > .mjx-char {display: inline-block}\n.mjx-surd {vertical-align: top}\n.mjx-surd + .mjx-box {display: inline-flex}\n.mjx-mphantom * {visibility: hidden}\n.mjx-merror {background-color: #FFFF88; color: #CC0000; border: 1px solid #CC0000; padding: 2px 3px; font-style: normal; font-size: 90%}\n.mjx-annotation-xml {line-height: normal}\n.mjx-menclose > svg {fill: none; stroke: currentColor; overflow: visible}\n.mjx-mtr {display: table-row}\n.mjx-mlabeledtr {display: table-row}\n.mjx-mtd {display: table-cell; text-align: center}\n.mjx-label {display: table-row}\n.mjx-box {display: inline-block}\n.mjx-block {display: block}\n.mjx-span {display: inline}\n.mjx-char {display: block; white-space: pre}\n.mjx-itable {display: inline-table; width: auto}\n.mjx-row {display: table-row}\n.mjx-cell {display: table-cell}\n.mjx-table {display: table; width: 100%}\n.mjx-line {display: block; height: 0}\n.mjx-strut {width: 0; padding-top: 1em}\n.mjx-vsize {width: 0}\n.MJXc-space1 {margin-left: .167em}\n.MJXc-space2 {margin-left: .222em}\n.MJXc-space3 {margin-left: .278em}\n.mjx-test.mjx-test-display {display: table!important}\n.mjx-test.mjx-test-inline {display: inline!important; margin-right: -1px}\n.mjx-test.mjx-test-default {display: block!important; clear: both}\n.mjx-ex-box {display: inline-block!important; position: absolute; overflow: hidden; min-height: 0; max-height: none; padding: 0; border: 0; margin: 0; width: 1px; height: 60ex}\n.mjx-test-inline .mjx-left-box {display: inline-block; width: 0; float: left}\n.mjx-test-inline .mjx-right-box {display: inline-block; width: 0; float: right}\n.mjx-test-display .mjx-right-box {display: table-cell!important; width: 10000em!important; min-width: 0; max-width: none; padding: 0; border: 0; margin: 0}\n.MJXc-TeX-unknown-R {font-family: monospace; font-style: normal; font-weight: normal}\n.MJXc-TeX-unknown-I {font-family: monospace; font-style: italic; font-weight: normal}\n.MJXc-TeX-unknown-B {font-family: monospace; font-style: normal; font-weight: bold}\n.MJXc-TeX-unknown-BI {font-family: monospace; font-style: italic; font-weight: bold}\n.MJXc-TeX-ams-R {font-family: MJXc-TeX-ams-R,MJXc-TeX-ams-Rw}\n.MJXc-TeX-cal-B {font-family: MJXc-TeX-cal-B,MJXc-TeX-cal-Bx,MJXc-TeX-cal-Bw}\n.MJXc-TeX-frak-R {font-family: MJXc-TeX-frak-R,MJXc-TeX-frak-Rw}\n.MJXc-TeX-frak-B {font-family: MJXc-TeX-frak-B,MJXc-TeX-frak-Bx,MJXc-TeX-frak-Bw}\n.MJXc-TeX-math-BI {font-family: MJXc-TeX-math-BI,MJXc-TeX-math-BIx,MJXc-TeX-math-BIw}\n.MJXc-TeX-sans-R {font-family: MJXc-TeX-sans-R,MJXc-TeX-sans-Rw}\n.MJXc-TeX-sans-B {font-family: MJXc-TeX-sans-B,MJXc-TeX-sans-Bx,MJXc-TeX-sans-Bw}\n.MJXc-TeX-sans-I {font-family: MJXc-TeX-sans-I,MJXc-TeX-sans-Ix,MJXc-TeX-sans-Iw}\n.MJXc-TeX-script-R {font-family: MJXc-TeX-script-R,MJXc-TeX-script-Rw}\n.MJXc-TeX-type-R {font-family: MJXc-TeX-type-R,MJXc-TeX-type-Rw}\n.MJXc-TeX-cal-R {font-family: MJXc-TeX-cal-R,MJXc-TeX-cal-Rw}\n.MJXc-TeX-main-B {font-family: MJXc-TeX-main-B,MJXc-TeX-main-Bx,MJXc-TeX-main-Bw}\n.MJXc-TeX-main-I {font-family: MJXc-TeX-main-I,MJXc-TeX-main-Ix,MJXc-TeX-main-Iw}\n.MJXc-TeX-main-R {font-family: MJXc-TeX-main-R,MJXc-TeX-main-Rw}\n.MJXc-TeX-math-I {font-family: MJXc-TeX-math-I,MJXc-TeX-math-Ix,MJXc-TeX-math-Iw}\n.MJXc-TeX-size1-R {font-family: MJXc-TeX-size1-R,MJXc-TeX-size1-Rw}\n.MJXc-TeX-size2-R {font-family: MJXc-TeX-size2-R,MJXc-TeX-size2-Rw}\n.MJXc-TeX-size3-R {font-family: MJXc-TeX-size3-R,MJXc-TeX-size3-Rw}\n.MJXc-TeX-size4-R {font-family: MJXc-TeX-size4-R,MJXc-TeX-size4-Rw}\n.MJXc-TeX-vec-R {font-family: MJXc-TeX-vec-R,MJXc-TeX-vec-Rw}\n.MJXc-TeX-vec-B {font-family: MJXc-TeX-vec-B,MJXc-TeX-vec-Bx,MJXc-TeX-vec-Bw}\n@font-face {font-family: MJXc-TeX-ams-R; src: local('MathJax_AMS'), local('MathJax_AMS-Regular')}\n@font-face {font-family: MJXc-TeX-ams-Rw; src /*1*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/eot/MathJax_AMS-Regular.eot'); src /*2*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/woff/MathJax_AMS-Regular.woff') format('woff'), url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/otf/MathJax_AMS-Regular.otf') format('opentype')}\n@font-face {font-family: MJXc-TeX-cal-B; src: local('MathJax_Caligraphic Bold'), local('MathJax_Caligraphic-Bold')}\n@font-face {font-family: MJXc-TeX-cal-Bx; src: local('MathJax_Caligraphic'); font-weight: bold}\n@font-face {font-family: MJXc-TeX-cal-Bw; src /*1*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/eot/MathJax_Caligraphic-Bold.eot'); src /*2*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/woff/MathJax_Caligraphic-Bold.woff') format('woff'), url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/otf/MathJax_Caligraphic-Bold.otf') format('opentype')}\n@font-face {font-family: MJXc-TeX-frak-R; src: local('MathJax_Fraktur'), local('MathJax_Fraktur-Regular')}\n@font-face {font-family: MJXc-TeX-frak-Rw; src /*1*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/eot/MathJax_Fraktur-Regular.eot'); src /*2*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/woff/MathJax_Fraktur-Regular.woff') format('woff'), url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/otf/MathJax_Fraktur-Regular.otf') format('opentype')}\n@font-face {font-family: MJXc-TeX-frak-B; src: local('MathJax_Fraktur Bold'), local('MathJax_Fraktur-Bold')}\n@font-face {font-family: MJXc-TeX-frak-Bx; src: local('MathJax_Fraktur'); font-weight: bold}\n@font-face {font-family: MJXc-TeX-frak-Bw; src /*1*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/eot/MathJax_Fraktur-Bold.eot'); src /*2*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/woff/MathJax_Fraktur-Bold.woff') format('woff'), url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/otf/MathJax_Fraktur-Bold.otf') format('opentype')}\n@font-face {font-family: MJXc-TeX-math-BI; src: local('MathJax_Math BoldItalic'), local('MathJax_Math-BoldItalic')}\n@font-face {font-family: MJXc-TeX-math-BIx; src: local('MathJax_Math'); font-weight: bold; font-style: italic}\n@font-face {font-family: MJXc-TeX-math-BIw; src /*1*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/eot/MathJax_Math-BoldItalic.eot'); src /*2*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/woff/MathJax_Math-BoldItalic.woff') format('woff'), url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/otf/MathJax_Math-BoldItalic.otf') format('opentype')}\n@font-face {font-family: MJXc-TeX-sans-R; src: local('MathJax_SansSerif'), local('MathJax_SansSerif-Regular')}\n@font-face {font-family: MJXc-TeX-sans-Rw; src /*1*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/eot/MathJax_SansSerif-Regular.eot'); src /*2*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/woff/MathJax_SansSerif-Regular.woff') format('woff'), url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/otf/MathJax_SansSerif-Regular.otf') format('opentype')}\n@font-face {font-family: MJXc-TeX-sans-B; src: local('MathJax_SansSerif Bold'), local('MathJax_SansSerif-Bold')}\n@font-face {font-family: MJXc-TeX-sans-Bx; src: local('MathJax_SansSerif'); font-weight: bold}\n@font-face {font-family: MJXc-TeX-sans-Bw; src /*1*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/eot/MathJax_SansSerif-Bold.eot'); src /*2*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/woff/MathJax_SansSerif-Bold.woff') format('woff'), url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/otf/MathJax_SansSerif-Bold.otf') format('opentype')}\n@font-face {font-family: MJXc-TeX-sans-I; src: local('MathJax_SansSerif Italic'), local('MathJax_SansSerif-Italic')}\n@font-face {font-family: MJXc-TeX-sans-Ix; src: local('MathJax_SansSerif'); font-style: italic}\n@font-face {font-family: MJXc-TeX-sans-Iw; src /*1*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/eot/MathJax_SansSerif-Italic.eot'); src /*2*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/woff/MathJax_SansSerif-Italic.woff') format('woff'), url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/otf/MathJax_SansSerif-Italic.otf') format('opentype')}\n@font-face {font-family: MJXc-TeX-script-R; src: local('MathJax_Script'), local('MathJax_Script-Regular')}\n@font-face {font-family: MJXc-TeX-script-Rw; src /*1*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/eot/MathJax_Script-Regular.eot'); src /*2*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/woff/MathJax_Script-Regular.woff') format('woff'), url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/otf/MathJax_Script-Regular.otf') format('opentype')}\n@font-face {font-family: MJXc-TeX-type-R; src: local('MathJax_Typewriter'), local('MathJax_Typewriter-Regular')}\n@font-face {font-family: MJXc-TeX-type-Rw; src /*1*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/eot/MathJax_Typewriter-Regular.eot'); src /*2*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/woff/MathJax_Typewriter-Regular.woff') format('woff'), url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/otf/MathJax_Typewriter-Regular.otf') format('opentype')}\n@font-face {font-family: MJXc-TeX-cal-R; src: local('MathJax_Caligraphic'), local('MathJax_Caligraphic-Regular')}\n@font-face {font-family: MJXc-TeX-cal-Rw; src /*1*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/eot/MathJax_Caligraphic-Regular.eot'); src /*2*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/woff/MathJax_Caligraphic-Regular.woff') format('woff'), url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/otf/MathJax_Caligraphic-Regular.otf') format('opentype')}\n@font-face {font-family: MJXc-TeX-main-B; src: local('MathJax_Main Bold'), local('MathJax_Main-Bold')}\n@font-face {font-family: MJXc-TeX-main-Bx; src: local('MathJax_Main'); font-weight: bold}\n@font-face {font-family: MJXc-TeX-main-Bw; src /*1*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/eot/MathJax_Main-Bold.eot'); src /*2*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/woff/MathJax_Main-Bold.woff') format('woff'), url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/otf/MathJax_Main-Bold.otf') format('opentype')}\n@font-face {font-family: MJXc-TeX-main-I; src: local('MathJax_Main Italic'), local('MathJax_Main-Italic')}\n@font-face {font-family: MJXc-TeX-main-Ix; src: local('MathJax_Main'); font-style: italic}\n@font-face {font-family: MJXc-TeX-main-Iw; src /*1*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/eot/MathJax_Main-Italic.eot'); src /*2*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/woff/MathJax_Main-Italic.woff') format('woff'), url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/otf/MathJax_Main-Italic.otf') format('opentype')}\n@font-face {font-family: MJXc-TeX-main-R; src: local('MathJax_Main'), local('MathJax_Main-Regular')}\n@font-face {font-family: MJXc-TeX-main-Rw; src /*1*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/eot/MathJax_Main-Regular.eot'); src /*2*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/woff/MathJax_Main-Regular.woff') format('woff'), url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/otf/MathJax_Main-Regular.otf') format('opentype')}\n@font-face {font-family: MJXc-TeX-math-I; src: local('MathJax_Math Italic'), local('MathJax_Math-Italic')}\n@font-face {font-family: MJXc-TeX-math-Ix; src: local('MathJax_Math'); font-style: italic}\n@font-face {font-family: MJXc-TeX-math-Iw; src /*1*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/eot/MathJax_Math-Italic.eot'); src /*2*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/woff/MathJax_Math-Italic.woff') format('woff'), url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/otf/MathJax_Math-Italic.otf') format('opentype')}\n@font-face {font-family: MJXc-TeX-size1-R; src: local('MathJax_Size1'), local('MathJax_Size1-Regular')}\n@font-face {font-family: MJXc-TeX-size1-Rw; src /*1*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/eot/MathJax_Size1-Regular.eot'); src /*2*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/woff/MathJax_Size1-Regular.woff') format('woff'), url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/otf/MathJax_Size1-Regular.otf') format('opentype')}\n@font-face {font-family: MJXc-TeX-size2-R; src: local('MathJax_Size2'), local('MathJax_Size2-Regular')}\n@font-face {font-family: MJXc-TeX-size2-Rw; src /*1*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/eot/MathJax_Size2-Regular.eot'); src /*2*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/woff/MathJax_Size2-Regular.woff') format('woff'), url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/otf/MathJax_Size2-Regular.otf') format('opentype')}\n@font-face {font-family: MJXc-TeX-size3-R; src: local('MathJax_Size3'), local('MathJax_Size3-Regular')}\n@font-face {font-family: MJXc-TeX-size3-Rw; src /*1*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/eot/MathJax_Size3-Regular.eot'); src /*2*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/woff/MathJax_Size3-Regular.woff') format('woff'), url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/otf/MathJax_Size3-Regular.otf') format('opentype')}\n@font-face {font-family: MJXc-TeX-size4-R; src: local('MathJax_Size4'), local('MathJax_Size4-Regular')}\n@font-face {font-family: MJXc-TeX-size4-Rw; src /*1*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/eot/MathJax_Size4-Regular.eot'); src /*2*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/woff/MathJax_Size4-Regular.woff') format('woff'), url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/otf/MathJax_Size4-Regular.otf') format('opentype')}\n@font-face {font-family: MJXc-TeX-vec-R; src: local('MathJax_Vector'), local('MathJax_Vector-Regular')}\n@font-face {font-family: MJXc-TeX-vec-Rw; src /*1*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/eot/MathJax_Vector-Regular.eot'); src /*2*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/woff/MathJax_Vector-Regular.woff') format('woff'), url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/otf/MathJax_Vector-Regular.otf') format('opentype')}\n@font-face {font-family: MJXc-TeX-vec-B; src: local('MathJax_Vector Bold'), local('MathJax_Vector-Bold')}\n@font-face {font-family: MJXc-TeX-vec-Bx; src: local('MathJax_Vector'); font-weight: bold}\n@font-face {font-family: MJXc-TeX-vec-Bw; src /*1*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/eot/MathJax_Vector-Bold.eot'); src /*2*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/woff/MathJax_Vector-Bold.woff') format('woff'), url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/otf/MathJax_Vector-Bold.otf') format('opentype')}\n</style></span></span></span>nihilism,' but the latter term seems to be defined in a sentiment-laden way in <a href=\"https://en.wikipedia.org/wiki/Nihilism\">several</a> <a href=\"https://iep.utm.edu/nihilism/\">places</a>)</li></ol></li><li>A person who accepts the above three bulleted premises and also :<ol><li>Has (for whatever reason) a desire or goal to 'do ethics' conditional on there being good reason to do ethics</li><li>Uses (for whatever reason) any procedure consistent with any form of what I'll call \"normal, prima facie non-insane, &nbsp;coherent decision theoretic reasoning\" to make decisions...</li></ol></li></ol><p>&nbsp;... <strong>would</strong> in fact find him/herself (i) 'doing ethics' and [slightly less confident about this one] (ii) 'doing ethics' as though moral realism were true even if they believe that moral realism is probably not true.</p><p>[ok that's it for the argument]🔚</p><p>Two more things...</p><ol><li>It looks like Will MacAskill's book <a href=\"https://static1.squarespace.com/static/5506078de4b02d88372eee4e/t/5f5a3ddd466873260486fb06/1599749604332/Moral+Uncertainty.pdf\">Moral Uncertainty</a> has a chapter on this which I haven't engaged with, but prima facie I can't see why his arguments concerning normative moral uncertainty wouldn't apply at the meta-ethical level as well</li><li>I should note that I may be inclined towards this answer because I think anti-realists <i>are</i> wrong (for reasons discussed in <a href=\"https://80000hours.org/podcast/episodes/sharon-hewitt-rawlette-hedonistic-utilitarianism/ \">this 80k episode</a> )</li></ol>", "parentCommentId": null, "user": {"username": "aaronb50"}}]