[{"_id": "EWto2WLLPpHyaWxdk", "postedAt": "2018-04-13T23:04:39.283Z", "postId": "KAsnFWNdasSSTu9rP", "htmlBody": "<blockquote>\n<p>The economic impact of vegetarianism or veganism is only one factor in the decision of whether one should become a vegetarian or vegan, but an important one</p>\n</blockquote>\n<p>I'm confused by this. If you genuinely think your purchase decisions will make no difference to what happens to animals, then you might as well go ahead and order the big bucket at KFC with a guiltless conscience.</p>\n", "parentCommentId": null, "user": {"username": "MichaelPlant"}}, {"_id": "KYqxJsWJNfiDCG3Kg", "postedAt": "2018-04-13T23:27:42.440Z", "postId": "KAsnFWNdasSSTu9rP", "htmlBody": "<p>I'm referring to effective altruists who aren't (yet) veg-n but are considering becoming so, and are open-minded about but currently unconvinced by the argument veg-nism has a genuine economic impact. </p>\n", "parentCommentId": "EWto2WLLPpHyaWxdk", "user": {"username": "Evan_Gaensbauer"}}, {"_id": "8Bnzr3gq8JgtLyi2y", "postedAt": "2018-04-14T11:43:52.937Z", "postId": "KAsnFWNdasSSTu9rP", "htmlBody": "<p>I took this to mean &quot;even if you don't expect your choice to have economic impact, like your friend ordered the KFC bucket but doesn't want to finish it and asks if you'd like some, there are still other factors to consider like norm-setting and your own cognitive dissonance.&quot;</p>\n", "parentCommentId": "EWto2WLLPpHyaWxdk", "user": {"username": "Julia_Wise"}}, {"_id": "EhFmCCjD7yqCH7TP2", "postedAt": "2018-04-16T17:29:31.384Z", "postId": "KAsnFWNdasSSTu9rP", "htmlBody": "<p>I haven't seen many debates about this within EA. New people are sometimes confused about the issue, but aside from that, pretty much everyone seems to recognize the expected economic impact of vegetarianism.</p>\n", "parentCommentId": null, "user": {"username": "kbog"}}, {"_id": "wY9yuEbPHXKHCYZT3", "postedAt": "2018-04-18T13:30:30.477Z", "postId": "KAsnFWNdasSSTu9rP", "htmlBody": "<p>I get it pretty frequently from newcomers (maybe in the top 20 questions for animal-focused EA?), but everyone seems convinced by a brief explanation of how there's still a small chance of big purchasing changes even if every small consumption change doesn't always lead to a purchasing change.</p>\n", "parentCommentId": "EhFmCCjD7yqCH7TP2", "user": {"username": "Jacy"}}, {"_id": "yFeuEZvuzuekGXhBy", "postedAt": "2018-04-19T20:48:09.505Z", "postId": "KAsnFWNdasSSTu9rP", "htmlBody": "<p>I am puzzled by the value of non-born animals in this case. Ok, less chicken will be born and later culled, but it means that some chickens will never be born at all. In extreme case, the whole species of farm chicken could go extinct if there will be no meet consumption.</p>\n", "parentCommentId": null, "user": {"username": "turchin"}}, {"_id": "Jimg8Q2NGip9AaKMm", "postedAt": "2018-04-20T01:07:59.368Z", "postId": "KAsnFWNdasSSTu9rP", "htmlBody": "<p>Following a preference utilitarian system, you are correct. Hare discusses this in, <em>Why I Am only a Demi-vegetarian</em>. Singer also mention it in, <em><a href=\"https://www.goodreads.com/review/show/2227114171\">Singer and His Critics</a></em>.</p>\n<p>Although, that's not the reality today (in the US at least). Unethical living conditions, such at battery cages for chickens or a short life confined to small pens for other livestock is the point. No such being wants to suffer unnecessarily. On the other hand, if factory farming was like ol' MacDonald farm, then sure. Kind of a paradox...</p>\n", "parentCommentId": "yFeuEZvuzuekGXhBy", "user": {"username": "adamaero"}}, {"_id": "EEFbxjBXNyAhtSzfr", "postedAt": "2018-04-20T21:47:13.211Z", "postId": "KAsnFWNdasSSTu9rP", "htmlBody": "<p>That some chickens will never be born at all is the goal, as:</p>\n<ol>\n<li><p>it's believed those chickens born would have lives of only suffering, not redeemed by happiness;</p>\n</li>\n<li><p>the degree and constancy of the suffering is so great considerations of preferences the chicken may have, like a 'will to live', are overridden by the preference/desire to be free of suffering;</p>\n</li>\n<li><p>the expected consensus is we know enough about animal minds to conclude they have preferences like the instantaneous desire to be free of suffering in any given moment, but we don't have sufficient reason to believe they abstractly think of the future, and meaningfully have a 'will to live';</p>\n</li>\n<li><p>the collective experience of the farm animal rights movement has been decades of reforms of factory farms remain unenforced or are insufficient to overcome the above considerations about how the lives of chickens on factory farms will never be worth living.</p>\n</li>\n</ol>\n<p>So the goal of some effective altruists focused on present and near-term future non-human animal well-being isn't to advocate for the animal's rights so much as it is to mitigate factory farming as an industry. This is from a perspective of EA from years ago, when <em>Doing Good Better</em> was published. There has been an empirical revolution within effective animal advocacy since then. The evidence has borne out employing messaging focused on systemic change over individual dietary/behavioural change, and not splitting hairs in messaging based on ideological differences internal to the animal welfare/rights movement. So if one cares about the rights of species to not go extinct, one doesn't have to fear the movement strategy implied by the OP, as effective animal advocacy (EAA) organizations are mostly not pursuing that strategy anymore. Given how expansive factory farming is in developed Western countries, and how it's expanding in developing countries, it appears factory farming, and thus the species of farm chicken, isn't going away soon. That stated, I've no reason to think effective animal advocates would object to preserving the genome of the farm chicken, or rearing individual farm chickens under humane conditions, e.g., at an animal shelter or <a href=\"https://en.wikipedia.org/wiki/Hobby_farm\">hobby farm</a>.</p>\n<p>Of course peers of EA outside the movement have weighed on the topic, disagreeing with the consensus EA position on either side. An argument against vegetarianism and for the continuation of factory farming exists in the <a href=\"https://concepts.effectivealtruism.org/concepts/logic-of-the-larder/\">logic of the larder</a>, as laid out by Robin Hanson and others. On the other side, another animal liberation movement called <a href=\"https://www.directactioneverywhere.com/\">Direct Action Everywhere</a> (DxE) thinks EAA doesn't go far enough. While I haven't followed them closely, and so I find their end goals confusing, I believe DxE's strategy is to mitigate factory farming isn't to have them not be born into net-negative lives, but raising sufficient public consciousness global human civilization will at some point in the future literally directly liberate all presently factory-farmed animals, presumably to freely roam the Earth.</p>\n<p>*&quot;effective animal advocacy&quot; is the term for the interstitial movement emerging from the combination of effective altruism and the conventional animal welfare/rights movement.</p>\n", "parentCommentId": "yFeuEZvuzuekGXhBy", "user": {"username": "Evan_Gaensbauer"}}, {"_id": "5NX5QwSL94NxnPfiR", "postedAt": "2018-04-20T22:42:40.947Z", "postId": "KAsnFWNdasSSTu9rP", "htmlBody": "<p>Another useful, well-writtten statement of this argument is in <a href=\"http://reducing-suffering.org/does-vegetarianism-make-a-difference/#A_hypothetical_supermarket_supply_system\">Brian Tomasik's &quot;Does Vegetarianism Make a Difference?&quot;</a>:</p>\n<blockquote>\n<p>Suppose that a supermarket currently purchases three big cases per week of factory-farmed chickens, with each case containing 25 birds. The store does not purchase fractions of cases, so even if several surplus chickens remain each week, the supermarket will continue to buy three cases. This is what the anti-vegetarian means by &quot;subsisting off of surplus animal products that would otherwise go to waste&quot;: the three cases are purchased anyway, so consuming one or two more chickens simply attenuates the surplus.</p>\n<p>What would happen, though, if 25 customers decided to buy tempeh or beans instead of chickens? The purchasing agent who orders weekly cases of chickens would probably buy two cases instead of three. But any given consumer can't tell how far the store is from that cutoff point between three vs. two cases. The probability that any given chicken is the chicken that causes two cases instead of three to be purchased is 1/25. If you do avoid the chicken at the cutoff point, you prevent a whole case -- 25 chickens -- from being ordered next week. Thus, the expected value of any given chicken is (1/25) * 25 = 1 chicken, just like common sense would suggest.</p>\n</blockquote>\n", "parentCommentId": null, "user": {"username": "jayquigley"}}, {"_id": "cC8Mdej3mmDQJYNsG", "postedAt": "2018-04-21T17:31:21.213Z", "postId": "KAsnFWNdasSSTu9rP", "htmlBody": "<p>The idea behind trying to end factory farming for animals' sake is that animals who spend their whole lives on factory farms are enduring lives that are not worth living. It is better not to bring creatures into existence who would live net negative lives.</p>\n<p>You're right that extinction is a (very) extreme case. It's more likely that even with a drastic reduction in factory farming, a small fraction of descendants of farmed species would be preserved--either for farming, or in zoos or similar institutions. After all, they're easy to domesticate, having been bred over the centuries for precisely those purposes.</p>\n", "parentCommentId": "yFeuEZvuzuekGXhBy", "user": {"username": "jayquigley"}}, {"_id": "4G6DNngfr8xTfwAbY", "postedAt": "2018-04-22T13:39:38.184Z", "postId": "KAsnFWNdasSSTu9rP", "htmlBody": "<p>I wonder if the cutoff point is more like 25,000 though, the number of broiler chickens raised in a shed. It's unclear to me whether producers respond to small changes in demand by adjusting the numbers of broilers in a shed or only by adjusting the number of sheds in use.</p>\n<p>If the cutoff point is more like 25,000, then this would imply that most veg*ns go their entire lives without preventing the existence of a single broiler through their consumption changes, while a minority prevent the existence of a huge number.</p>\n<p>For what it's worth, it seems likely that donations to AMF are similar since their distributions typically cover hundreds of thousands or millions of people.</p>\n", "parentCommentId": "5NX5QwSL94NxnPfiR", "user": {"username": "AviN"}}, {"_id": "hbemsrfESfoQzsZC9", "postedAt": "2018-04-23T15:24:41.138Z", "postId": "KAsnFWNdasSSTu9rP", "htmlBody": "<p>It seems to me that this passage is conflating two distinct issues:</p>\n<p>1) whether your decision not to purchase one pound of chicken will shift the demand curve for chicken by one pound i.e. whether it will cause producers to know that there is now one fewer pound of demand for chicken at the current price</p>\n<p>2) how much that shift in the demand curve will change the quantity produced i.e. how much the production of chicken will decrease given that producers will lower the price of chicken and that the demand for chicken will be greater at that lower price (thus partially offsetting the reduction in demand that you caused)</p>\n<p>The argument that MacAskill makes is related to the first issue, but the evidence he cites from Compassion for the Pound is related to the second issue. I think MacAskill is correct on the first issue, but I do not think that the evidence he cites supports his position.</p>\n", "parentCommentId": null, "user": {"username": "RandomEA"}}, {"_id": "5dhM6MvD2WHQvAqaW", "postedAt": "2018-04-23T22:52:10.654Z", "postId": "KAsnFWNdasSSTu9rP", "htmlBody": "<p>Is there other evidence supporting or falsifying Will's position from another source.</p>\n", "parentCommentId": "hbemsrfESfoQzsZC9", "user": {"username": "Evan_Gaensbauer"}}, {"_id": "MEbpqpmyGNaHuwzg7", "postedAt": "2018-04-25T15:08:50.204Z", "postId": "KAsnFWNdasSSTu9rP", "htmlBody": "<p>Whether the cutoff point is 25 or 25,000 the expected value of avoiding eating meat remains the same. So, it shouldn't affect one's motivation to reduce their meat intake.</p>\n", "parentCommentId": "4G6DNngfr8xTfwAbY", "user": {"username": "LewisWilliams"}}, {"_id": "BsT6deK6omjxEhB3o", "postedAt": "2018-04-30T09:26:23.130Z", "postId": "KAsnFWNdasSSTu9rP", "htmlBody": "<p>Hey there,</p>\n<p>anyone have the link for the economists guesses Askill refers to? I have no copy of doing good better around so I cant check myself.</p>\n<p>Also, anyone know if demand-independent subsidies are factored in? I would expect the expected value to be lower when subsidies allow producers to be producing below &quot;production/world market price&quot;, as they could easily export whatever is not locally consumed (as some EU countries do).</p>\n<p>Thanks for the post. This issue regularly arises in our local EA group (mainly due to me desperately grasping straws to justify my carnivorous ways), and it is surprisingly hard to get good information on the topic. So far I knew only the &quot;Does Vegetarianism make a difference&quot; post, which is well-written but does seem a bit light on the economics side, with no peer-reviewed articles or analyses being quoted as far as I remember. </p>\n", "parentCommentId": null, "user": {"username": "mhendric"}}, {"_id": "3FN7K3f9pGHiD6D9Y", "postedAt": "2018-04-30T11:03:08.695Z", "postId": "KAsnFWNdasSSTu9rP", "htmlBody": "<p>I think the economist guesses are from <em>Compassion, By the Pound</em>, though I also don't have a copy of either book.</p>\n<blockquote>\n<p>no peer-reviewed articles or analyses being quoted</p>\n</blockquote>\n<p>Yeah. <a href=\"https://doi.org/10.1111/1468-5930.00223\">Matheny (2003)</a> is a journal article on the same topic, though it's not an economics journal.</p>\n<blockquote>\n<p>they could easily export whatever is not locally consumed (as some EU countries do).</p>\n</blockquote>\n<p>Perhaps that would reduce local meat production in the destination countries.</p>\n", "parentCommentId": "BsT6deK6omjxEhB3o", "user": {"username": "Brian_Tomasik"}}, {"_id": "bhyuoYafrDKMnGmva", "postedAt": "2018-04-30T19:35:45.208Z", "postId": "KAsnFWNdasSSTu9rP", "htmlBody": "<p>How could we know that they are unhappy? Photos of overcrowded farms look terrible, but animals may have different value structure, like:</p>\n<ul>\n<li>warm</li>\n<li>safe</li>\n<li>many friends</li>\n<li>longer life expectancy than in the forest</li>\n<li>guaranteed access to unlimited amounts of food. </li>\n</ul>\n<p>Technically, we could have two ways to measure their preferences: do they feel constant pain according to their EEG + do they want to escape at any price and even happy to be slaughtered? </p>\n", "parentCommentId": "cC8Mdej3mmDQJYNsG", "user": {"username": "turchin"}}, {"_id": "TpQn8JE9nSEWFJBMd", "postedAt": "2018-04-30T19:43:28.588Z", "postId": "KAsnFWNdasSSTu9rP", "htmlBody": "<p>Were chicken preferences measured by EEG or choice? see also may comment above.</p>\n", "parentCommentId": "EEFbxjBXNyAhtSzfr", "user": {"username": "turchin"}}, {"_id": "z7BNsqqD65cp2ba43", "postedAt": "2018-05-02T20:32:15.005Z", "postId": "KAsnFWNdasSSTu9rP", "htmlBody": "<p>I was just relaying the consensus as I perceive in the community, but I haven't studied this myself. I don't know what kind of empirical evidence these conclusions are based on.</p>\n", "parentCommentId": "TpQn8JE9nSEWFJBMd", "user": {"username": "Evan_Gaensbauer"}}, {"_id": "zLexeaTfpW9Ngm2Ke", "postedAt": "2018-05-13T09:06:49.046Z", "postId": "KAsnFWNdasSSTu9rP", "htmlBody": "<p>I think it's sort of bizarre to suggest that out of 25,000 vegetarians, one is responsible for the shed being closed, and the others did nothing at all. Why privilege the &quot;last&quot; decision to not purchase a chicken? It makes more sense to me that you'd allocate the &quot;credit&quot; equally to everyone who chose not to eat meat.</p>\n<p>The first 24,999 needed to not buy a chicken in order for the last one to be in a position for their choice to make a difference.</p>\n", "parentCommentId": "4G6DNngfr8xTfwAbY", "user": {"username": "BenMillwood"}}, {"_id": "WH8AgfgRBy94AmmiD", "postedAt": "2020-01-08T12:55:42.037Z", "postId": "KAsnFWNdasSSTu9rP", "htmlBody": "<p>I just looked it up, you&apos;re right. Here the full quote:</p><blockquote>F. Bailey Norwood and Jayson L. Lusk, Compassion, by the Pound: The Economics of Farm Animal Welfare (New York: Oxford University, 2011), 223. </blockquote>", "parentCommentId": "3FN7K3f9pGHiD6D9Y", "user": {"username": "MaxRa"}}]