[{"_id": "x9bytgoLsYxoJP3cr", "postedAt": "2023-01-15T21:12:31.091Z", "postId": "KB8XPfh7dJ9uJaaDs", "htmlBody": "<p>Thanks for posting this. Should be pinned.</p>", "parentCommentId": null, "user": {"username": "Very Effective"}}, {"_id": "JDBdyjvJv2GgFW2aG", "postedAt": "2023-01-15T21:37:00.412Z", "postId": "KB8XPfh7dJ9uJaaDs", "htmlBody": "<p>I liked this, thank you. Also well written.<br><br>But I genuinely think that for many it's not clear why 5 is not part of a good apology. I think \"imagine it is being spoken to a black person\" is a great intuition pump.&nbsp;</p>", "parentCommentId": null, "user": {"username": "nathan"}}, {"_id": "YoxTaFMhhyvu8Zqtk", "postedAt": "2023-01-15T21:41:43.612Z", "postId": "KB8XPfh7dJ9uJaaDs", "htmlBody": "<p>In addition, if half of your paragraphs are discussing something that is irrelevant to the stated purpose of the piece of writing, at worst people will question if that's really why you're writing and at best will detract from effect you're trying to achieve.</p>\n", "parentCommentId": "JDBdyjvJv2GgFW2aG", "user": {"username": "jooke"}}, {"_id": "BerCJxEsvpDWDrjFy", "postedAt": "2023-01-15T22:04:02.687Z", "postId": "KB8XPfh7dJ9uJaaDs", "htmlBody": "<p>Eugenics was not an unrelated tangent.</p>\n<p>Bostrom has been accused of being a eugenicist, and Bostrom has defended views that could be characterised as eugenics.</p>\n<p>Probably the people trying to cancel him would have attempted to cancel him for eugenics.</p>\n<p>It was very much in topic.</p>\n", "parentCommentId": null, "user": {"username": "Dragon God"}}, {"_id": "obn2e83GmwtowCeFA", "postedAt": "2023-01-15T22:23:27.821Z", "postId": "KB8XPfh7dJ9uJaaDs", "htmlBody": "<p>Could you (or someone else) actually make the case for \"good apologies\" (in the sense you outline in this post) that goes beyond PR concerns?</p><p>I understand the desire to know what Bostrom <i>really thinks</i>, but the attention on the structural quality of his apology seems completely undue. None of these elements would presumably reveal more about how Bostrom really thinks than his actual apology.&nbsp;</p><p>In fact, it seems like if our preference is to understand how Bostrom really feels, your \"good apology\" approach might take us further away from that! Your emphasis is on <i>appearing</i> &nbsp;\"sincere and genuine\" which again, fair enough for PR concerns, but presumably we are after some sort of larger reconciliation here that necessitates being honest and forthright?</p><p>If an apology was terribly written - but was in fact genuine and sincere - that seems preferable? If a good apology is just to \"sell forgiveness\", what could the point be beyond PR?</p><p>My apologies if I am missing something here, but you seem to be writing a guide for some kind of dishonesty? And if you mean it to be about true honesty, I think this scheme really fails.&nbsp;</p>", "parentCommentId": null, "user": {"username": "burner"}}, {"_id": "HrKNWAZGn6jZ3suNP", "postedAt": "2023-01-15T22:53:33.609Z", "postId": "KB8XPfh7dJ9uJaaDs", "htmlBody": "<p>Beyond any matter related to Nick Bostrom's recent apology, my two cents is that the answer is that, generally, no, most of the effective altruism community doesn't know how to apologize well.</p>\n", "parentCommentId": null, "user": {"username": "Evan_Gaensbauer"}}, {"_id": "jtphnvdBaA9JvzsQ3", "postedAt": "2023-01-15T23:03:04.502Z", "postId": "KB8XPfh7dJ9uJaaDs", "htmlBody": "<p>This strengthens OP's point: this is not an apology at all, it's an attempted (and failed) defense.</p>\n", "parentCommentId": "BerCJxEsvpDWDrjFy", "user": {"username": "Guy Raveh"}}, {"_id": "SpfZv2qtn6BcYZktt", "postedAt": "2023-01-15T23:03:50.619Z", "postId": "KB8XPfh7dJ9uJaaDs", "htmlBody": "<blockquote><p>In response to the drama over Bostroms <a href=\"https://nickbostrom.com/oldemail.pdf\">apology for an old emai</a>l, the original email has been universally condemned from all sides.</p></blockquote><p>I do not condemn Bostrom.&nbsp;</p><p>And if the content is so offensive as to be upsetting and harmful to the movement, it must also be harmful to continue posting and discussing its contents.&nbsp;</p><p>I think he discussed eugenics because he was preemptively addressing potential attacks that he suspected where coming.</p>", "parentCommentId": null, "user": {"username": "Parrhesia"}}, {"_id": "ytF2TGjPNwxMM86dQ", "postedAt": "2023-01-15T23:05:22.758Z", "postId": "KB8XPfh7dJ9uJaaDs", "htmlBody": "<p>When you say \"PR concerns\", do you mean \"every social aspect of human communication\"? If so, then the point is exactly that people arguing the factual correctness of an apology are ignoring every social aspect of human communication.</p>\n", "parentCommentId": "obn2e83GmwtowCeFA", "user": {"username": "Guy Raveh"}}, {"_id": "oXTBevZjqDbfAe2gz", "postedAt": "2023-01-15T23:06:36.365Z", "postId": "KB8XPfh7dJ9uJaaDs", "htmlBody": "<p><s>I really can't express clearly how badly I think of FLI's </s><a href=\"https://forum.effectivealtruism.org/posts/5vFmMXWsh6PaYjqab/?commentId=Dn88oPPMdDK9dpmjh\"><s>non-apology</s></a><s>.&nbsp;</s></p><p><s>Why on earth would they think a neo-nazi publication would ever be a good thing to fund?</s></p><blockquote><p><s>The Future of Life Institute makes no apologies for engaging with many people across the immensely diverse political spectrum, because our mission is so important that it needs broad support from all sectors of society</s></p></blockquote><p><s>Why on earth would they put this in their response, rather than condemning neo-nazism?</s></p><p><s>@Tegmark</s></p>", "parentCommentId": null, "user": {"username": "Matt g"}}, {"_id": "AWf2G2KgE8xu3Lvfz", "postedAt": "2023-01-15T23:07:46.937Z", "postId": "KB8XPfh7dJ9uJaaDs", "htmlBody": "<p>My only objection here is the omission of the words \"neo-Nazi\". Which Nya Dagbladet undoubtedly are, despite Tegmark's claims to the contrary.</p>\n", "parentCommentId": null, "user": {"username": "Guy Raveh"}}, {"_id": "TKwXcbXDfxnsB7Nxz", "postedAt": "2023-01-16T01:43:36.913Z", "postId": "KB8XPfh7dJ9uJaaDs", "htmlBody": "<p>I think these are great principles for apologies in the context of personal relationships, however, I do wonder how we would have to adapt them for a public context. For start, making amends works well for an individual who is in a position to accept or reject your offer and much less well in a public context where it can easily end up being seen as a cynical PR move. And indeed, it is especially likely to be seen as a cynical PR move if it is in fact a cynical PR move, which it would be if the person was to write something that didn't represent their true views. So while I definitely think these apologies could have been improved, I think that the situation is more complex than you give it credit for.</p>", "parentCommentId": null, "user": {"username": "casebash"}}, {"_id": "ijNpCtreczcfLGLq9", "postedAt": "2023-01-16T03:11:47.073Z", "postId": "KB8XPfh7dJ9uJaaDs", "htmlBody": "<p>No, that's not really what I mean. I mean that I generally doubt these public apologies are generally able to give people the emotional reconciliation that they desire.</p><p>They can provide a few things, presumably including PR damage mitigation, a sincere account of their thinking, and perhaps some amount of reconciliation.</p><p>My criticism of your post is that it seems intent on optimizing for only one of those - indeed considering it entirely sufficient for a \"good apology\" without considering how these things trade off, nor considering what we might normatively want an apology to do. In my view, a sincere account of someone's beliefs is very valuable.&nbsp;</p>", "parentCommentId": "ytF2TGjPNwxMM86dQ", "user": {"username": "burner"}}, {"_id": "eZs7eZ5abL7yE2RTf", "postedAt": "2023-01-16T07:54:04.949Z", "postId": "KB8XPfh7dJ9uJaaDs", "htmlBody": "<p>When someone's actions are criticised, they are often criticised for several different things. They may wish to apologise for some of these things, while explaining and defending others.</p>\n", "parentCommentId": "jtphnvdBaA9JvzsQ3", "user": {"username": "Peter_Hartree"}}, {"_id": "vNJgiZLJ3vMyjexBq", "postedAt": "2023-01-16T09:22:48.917Z", "postId": "KB8XPfh7dJ9uJaaDs", "htmlBody": "<p>The problem with Bostrom's apology is that it made the argument worse rather than achieving (the presumed) goal of making the conversation around it as small as possible.</p>\n<p>There were true things and true impressions he could have said and left that would have done that.</p>\n", "parentCommentId": "obn2e83GmwtowCeFA", "user": {"username": "timunderwood"}}, {"_id": "H2aDSbxPDWrm6N2ey", "postedAt": "2023-01-16T09:31:11.747Z", "postId": "KB8XPfh7dJ9uJaaDs", "htmlBody": "<p>I am confused.</p>\n<p>The bad thing would be if FLI funded them. FLI did not fund them due to things discovered due to due diligence. So FLI literally did nothing wrong, and literally has nothing to apologize for.</p>\n<p>Unless we actually are saying that talking with 'bad people' is automatically bad and something you should apologize to all your right thinking friends for having contaminated them with proximity to badness afterwards .</p>\n<p>Is there a principled argument that thinking about funding a group like that, and then changing your mind is bad?</p>\n", "parentCommentId": "oXTBevZjqDbfAe2gz", "user": {"username": "timunderwood"}}, {"_id": "yhHvF5Ao2MvhGRvga", "postedAt": "2023-01-16T10:39:28.691Z", "postId": "KB8XPfh7dJ9uJaaDs", "htmlBody": "<blockquote><p><s>Unless we actually are saying that talking with 'bad people' is automatically bad and something you should apologize to all your right thinking friends for having contaminated them with proximity to badness afterwards.</s></p></blockquote><p><s>This is putting it very, very euphemistically, if you want to call 'offering $100,000 in funding to a neo-Nazi publication' ,'talking with bad people'.</s></p><blockquote><p><s>Is there a principled argument that thinking about funding a group like that, and then changing your mind is bad?</s></p></blockquote><p><s>Yes. Even if they thankfully never granted the money, the question remains - why was </s><i><s>Nya Dagbladet </s></i><s>ever anywhere near a shortlist of things that FLI would consider funding?&nbsp;</s></p><p><s>The fact remains that FLI has not disavowed </s><i><s>Nya Dagbladet </s></i><s>for their neo-nazi views. This is the most FLI gave as an explanation for them rescinding the offer &nbsp;of funding:&nbsp;</s></p><blockquote><p><s>we ultimately decided to reject it because of what our subsequent due diligence uncovered</s></p></blockquote><p><s>This is incredibly vague and could be talking about almost anything! Other parts of their non-apology seem to hint that they consider </s><i><s>Nya Dagbladet's </s></i><s>political views&nbsp;</s><i><s> </s></i><s>are acceptable, and ok to be engaging with. Again, this is taken from their apology:</s></p><blockquote><p><s>The Future of Life Institute makes no apologies for engaging with many people across the immensely diverse political spectrum, because our mission is so important that it needs broad support from all sectors of society...</s></p></blockquote><blockquote><p><s>We will continue to engage the broadest sample of humankind, whether or not we are criticized by anyone who questions our motives, or who may have their own agendas.</s></p></blockquote><p><s>I can't believe I'm writing this, but some political views should be roundly rejected and never considered acceptable when thinking about the future of humankind. Holocaust deniers should be top of that list, and FLI needs to say as such ASAP.</s></p>", "parentCommentId": "H2aDSbxPDWrm6N2ey", "user": {"username": "Matt g"}}, {"_id": "ZWfthoL935ascbErs", "postedAt": "2023-01-16T10:41:37.606Z", "postId": "KB8XPfh7dJ9uJaaDs", "htmlBody": "<p>Maybe part of the problem here is that social media demands fast apologies.  There could be a speed/quality tradeoff for apologies.</p>\n<p>titotal writes:</p>\n<blockquote>\n<p>The FLI has managed to fail at point 1 of an apology: understanding that they did something wrong.</p>\n</blockquote>\n<p>Understanding that you did something wrong is not always an easy thing.  <s>Suppose, for the sake of discussion, that Max Tegmark is, in fact, partway down some sort of far-right pipeline.</s>  [<strong>EDIT</strong>: With the <a href=\"https://forum.effectivealtruism.org/posts/LvwihGYgFEzjGDhBt/fli-faq-on-the-rejected-grant-proposal-controversy\">recent FAQ release</a>, such speculation now seems unwarranted.  I'm leaving the rest of this comment as it was, but please don't assume I endorse it.]  It seems unlikely that a few angry EA Forum comments are going to pull him out of whatever is going on.  If you've ever argued politics with people online, you know they don't budge easily.</p>\n<p>Demanding fast apologies could cause people to optimize for the appearance of remorse, instead of taking the time to look for genuine remorse within themselves, then express what they find.</p>\n<p>If I was an FLI board member, I might do something like:</p>\n<ul>\n<li>\n<p>Make an announcement that Tegmark and others involved in the Nya Dagbladet grant are on leave pending an investigation.  This sends a signal on social media that the org is responsive to the concerns people have, and hopefully reduces the pressure to produce another statement quickly.  It might be best to have the investigation conducted by a 3rd party, so outsiders get a credible view on what happened.</p>\n</li>\n<li>\n<p>Get Tegmark &amp; others to do an \"apology steelman\" exercise, spending time talking to people who are predicted to have the highest chance of persuading him that the existing statement is inadequate -- including a mix of relevant domain experts and EAs.  Pay those people for their time.  Make conditions as favorable as possible for a genuine change of heart: communicate face-to-face (or at least via video call), spend the first 15 minutes of every conversation finding common ground through casual chitchat, maybe pull in a 3rd party mediator, probably get people involved to sign NDAs so he doesn't feel the need to be in \"PR mode\", etc.  (There's likely literature on political persuasion to consult here.)</p>\n</li>\n<li>\n<p>If a change of heart occurs, Tegmark can release a second statement.  He could get feedback on the draft from people involved in the steelman exercise (and people dissatisfied with the existing statement more generally).  It could be that he's able to satisfy most everyone without compromising his epistemic integrity.</p>\n</li>\n</ul>\n", "parentCommentId": "TKwXcbXDfxnsB7Nxz", "user": {"username": "Aptdell"}}, {"_id": "nqW2ghFKYjtXGDaKT", "postedAt": "2023-01-16T10:52:35.587Z", "postId": "KB8XPfh7dJ9uJaaDs", "htmlBody": "<blockquote>\n<p>Imagine if I called someone's mother overweight in a vulgar manner. When they get upset, I compose a long apology email where I apologize for the language, but then note that I believe it is factually true their mother has a BMI substantially above average, as does their sister, father, and wife.</p>\n</blockquote>\n<p>Strong downvote. Readers who have not read Bostrom's apology can get the false impression that the apology contains a note that is analogous to the above. It does not.</p>\n", "parentCommentId": null, "user": {"username": "ofer"}}, {"_id": "Zuxur8c45nA8CBdCS", "postedAt": "2023-01-16T10:57:25.039Z", "postId": "KB8XPfh7dJ9uJaaDs", "htmlBody": "<p>In a <a href=\"https://forum.effectivealtruism.org/posts/Zynbd3nF6eCyvrnz3/do-better-please?commentId=wwrFHLAdpuqb3fJJn\">previous comment</a>, I mentioned that far-right ideas have created enormous suffering over the past few centuries.  As an exercise, let's consider \"preventing harms from far-right ideology\" as an EA cause.  Some facts:</p>\n<ul>\n<li>\n<p><a href=\"https://electionbettingodds.com/\">Betting markets say</a> Donald Trump has a 14.2% chance of being US President in 2024, despite public knowledge of him hanging out with far-right thought leaders.</p>\n</li>\n<li>\n<p><a href=\"https://www.newsweek.com/40-americans-think-2020-election-stolen-days-before-midterms-1756218\">Newsweek says</a> 40% of Americans still believe the 2020 election was stolen, despite heavy censorship of this claim on social media.</p>\n</li>\n</ul>\n<p>There's been a lot of noise about Donald Trump over the past few years, and a lot of people have \"Trump fatigue\".  \"Trump fatigue\" might cause people to neglect that the US is actually in a very bad situation.  It seems very reasonable to estimate a &gt;10% chance the US is a far-right dictatorship within 5-10 years.  If this happens, it will be a far-right dictatorship with an incredibly powerful military and intelligence apparatus, likely including all the tech company data that privacy advocates have been nagging us about.</p>\n<p>Given the numbers above, \"preventing people from adopting far-right ideology\" (as I discussed in <a href=\"https://forum.effectivealtruism.org/posts/Zynbd3nF6eCyvrnz3/do-better-please?commentId=wwrFHLAdpuqb3fJJn\">this comment</a>) seems like a weak intervention for the \"preventing harms from far-right ideology\" cause area.  The facts suggest there <em>already are</em> millions of Americans who've adopted far-right ideology, and existing measures haven't exactly caused them to go away.  Deconversion seems like a better intervention than prevention at this point.</p>\n<p><s>Point being, <em>if</em> Tegmark really is partway down a far-right pipeline, it may be worth investing effort in deconverting him as a case study.</s> [<strong>EDIT</strong>: This speculation now seems unwarranted given <a href=\"https://forum.effectivealtruism.org/posts/LvwihGYgFEzjGDhBt/fli-faq-on-the-rejected-grant-proposal-controversy\">recent statements from FLI</a>]</p>\n", "parentCommentId": "ZWfthoL935ascbErs", "user": {"username": "Aptdell"}}, {"_id": "MZuzSChvQuTnzw85H", "postedAt": "2023-01-16T11:20:23.290Z", "postId": "KB8XPfh7dJ9uJaaDs", "htmlBody": "<blockquote>\n<p>...rather than condemning neo-nazism?</p>\n</blockquote>\n<p>There was this section:</p>\n<blockquote>\n<p>And in this effort, the Future of Life Institute stands and will always stand emphatically against racism, bigotry, bias, injustice and discrimination at all times and in all forms.  They are antithetical to our mission to safeguard the future of life and to advance human flourishing.</p>\n</blockquote>\n", "parentCommentId": "oXTBevZjqDbfAe2gz", "user": {"username": "Aptdell"}}, {"_id": "wfH8n5cYAiHfCbDv5", "postedAt": "2023-01-16T11:59:28.451Z", "postId": "KB8XPfh7dJ9uJaaDs", "htmlBody": "<p>I guess that the motivation for OP was that people were referring to Bostrom's apology as evidence that he sincerely repented, and deserves to be welcomed back into the fold already; whereas in fact the apology provides scant evidence of sincere introspection and remorse, and so we should not treat him as redeemed, yet. OP describes the way the apology fails to provide this evidence, without which there's no cause for redeeming him yet.</p><p>Perhaps unlike OP, I don't want Bostrom to write a false apology by following those rules. Nor do I want a lazy or perfunctory apology to be accepted by the community. We should welcome Bostrom back into the fold <i>on certain conditions</i>, namely, that he is sincerely remorseful; and writing a dysfunctional apology doesn't get him closer to meeting that condition.<br><br>If we successfully coordinated to withhold our acceptance until he makes serious amends, we may in fact succeed in causing him to introspect and change more than he otherwise would. Or he might just lie about his remorse. But accepting a bad (or non-) apology throws away the possibility of Nick introspecting.</p>", "parentCommentId": "obn2e83GmwtowCeFA", "user": {"username": "David Mears"}}, {"_id": "o95CZcHNoABgKuPFm", "postedAt": "2023-01-16T12:11:52.274Z", "postId": "KB8XPfh7dJ9uJaaDs", "htmlBody": "<p><s>....which makes no mention of the neo-nazi views of </s><i><s>Nya Dagbladet, </s></i><s>and does not condemn them. That section reads to me as almost an afterthought to their response, which is a rant about how Expo.se is unfairly criticising FLI, and how </s><i><s>Nya Dagbladet </s></i><s>is not neo-nazi</s><i><s>.</s></i></p><p><s>Here's that quote in context:</s></p><blockquote><p><s>We will continue to engage the broadest sample of humankind, whether or not we are criticized by anyone who questions our motives, or who may have their own agendas.&nbsp;&nbsp;And in this effort, the Future of Life Institute stands and will always stand emphatically against racism, bigotry, bias, injustice and discrimination at all times and in all forms.</s></p></blockquote><p><s>This is very vague and makes no mention of </s><i><s>Nya Dagbladet</s></i><s>! In fact, when read immediately after the sentence before it, it could appear to be a kind of hit back at Expo.se's criticism of FLI in a </s><i><s>'those damn intolerant liberal bigots'</s></i><s> kind of way.</s></p><p><s>This is why I take issue with FLI talking about engaging 'across the immensely diverse political spectrum' and standing again 'discrimination at all times and in all forms' - <strong>it's ok to discriminate against neo-nazis! </strong>In fact, </s><a href=\"https://en.wikipedia.org/wiki/Paradox_of_tolerance\"><s>it's completely necessary, in order for a tolerant society to survive.&nbsp;</s></a></p><p><s>Platitudes like 'we stand against injustice and discrimination' do not cut it when your organisation has ben accused of offering funding to neo-nazis. FLI needs to explicitly condemn and disavow </s><i><s>Nya Dagbladet </s></i><s>and neo-nazi ideas.</s></p>", "parentCommentId": "MZuzSChvQuTnzw85H", "user": {"username": "Matt g"}}, {"_id": "TWWRgHKBNh4J2sS62", "postedAt": "2023-01-16T14:41:36.215Z", "postId": "KB8XPfh7dJ9uJaaDs", "htmlBody": "<p>Taking both parts of that paragraph seriously, I think the statement is best read as saying (1) we condemn neo-nazism but (2) we're okay with partnering with neo-nazis if it helps achieve our goals. &nbsp;I agree it would have been much better to specifically condemn neo-nazism by name, but I find the existence of (2) to be the most alarming part of the statement.</p><p>There's also a failure to reckon with how vile the material Nya Dagbladet has published is and instead legitimate it as an organization (e.g., look, they got $30K in public funding!).</p>", "parentCommentId": "o95CZcHNoABgKuPFm", "user": {"username": "Jason"}}, {"_id": "DGivhA72GMtTfCWku", "postedAt": "2023-01-16T15:04:00.922Z", "postId": "KB8XPfh7dJ9uJaaDs", "htmlBody": "<p>FLI \"approved\" the grant, as documented by a letter Expo published, and then walked back the approval. I don't see \"thinking about funding\" or \"talking with 'bad people'\" as accurate characterizations of what happened.&nbsp;</p><p>We also don't know if FLI walked the grant back because they &nbsp;learned more about the vile views expressed by the everyone associated with the foundation, or for some other reason. For instance, the Nya Dagbladet website contains advocacy for a political party that several dozen US lawmakers have called to be<a href=\"https://forward.com/fast-forward/433244/neo-nazi-terrorist-congress-max-rose/\"> identified as a foreign terrorist group</a>. Although supporting neo-nazis is constitutionally protected in the US and raises no legal concerns, few organizations want to be anywhere in the same ballpark as a potential foreign terrorist organization.</p>", "parentCommentId": "H2aDSbxPDWrm6N2ey", "user": {"username": "Jason"}}, {"_id": "x7mXoHia2PfWyXisF", "postedAt": "2023-01-16T15:08:28.050Z", "postId": "KB8XPfh7dJ9uJaaDs", "htmlBody": "<p>What I am arguing for are principles of kindness, empathy, and decency.&nbsp;</p><p>When you engage in actions that hurt people, I think it is a good thing to address that hurt and make things right, and mitigate the damage as much as possible. I do not think Bostrom achieved this goal with his apology.&nbsp;</p><p>&nbsp;I do not oppose people stating beliefs that might be upsetting to some people, if such beliefs are relevant and important to a discussion at hand. &nbsp;However, when those beliefs are stated, they should be done so in an empathetic and sensitive manner, with the appropriate context in mind.&nbsp;</p><p>For example, &nbsp;if your friend has a problem with obesity, you should not address that by calling them a \"fatso\", even if said claim is arguably true. &nbsp;You should certainly not do so at their wedding. Instead you would take them aside at an opportune time and start something like \"hey, I know you've been struggling lately, and I'm concerned about you\".</p><p>The paragraphs on eugenics were not relevant to the apology. They should not have been brought up in that context, and the controversial topics were not treated with appropriate levels of sensitivity or kindness to the people he harmed. This is not dishonesty. This is human decency.&nbsp;</p>", "parentCommentId": "obn2e83GmwtowCeFA", "user": {"username": "titotal"}}, {"_id": "TjxjgePbe6SeKNkE8", "postedAt": "2023-01-16T15:50:44.527Z", "postId": "KB8XPfh7dJ9uJaaDs", "htmlBody": "<p>It appears that Bostrom was trying to make his document both an apology and a defense, ended up making it mostly the latter, and ultimately failed at both tasks.&nbsp;</p><p>It reads like he was getting pre-emptively angry at the twitter threads that would misrepresent him. And yes, twitter mobs can occasionally be quite awful and unreasonable, but that is not the majority of people that are going to read this apology, and not the majority of people affected by his words.&nbsp;</p><p>This greatly undermined his apology, for the reasons I outlined in my post, but it also undermined his defense, because he had no examples of unreasonableness to point to at that point, and the bad apology makes him look like a jerk.</p><p>For future reference of people who are apologising: You should prioritise a kind and empathetic response first, and deal with whatever twitter &nbsp;comes up with later. The first thing will give you credibility when dealing with the second thing (and more importantly, it's the <i>right thing to do</i>.) And for the record, it is, in fact, possible to be kind and empathetic without lying or misrepresenting your own views.&nbsp;</p>", "parentCommentId": "eZs7eZ5abL7yE2RTf", "user": {"username": "titotal"}}, {"_id": "FSg5sYtHHmsbckchc", "postedAt": "2023-01-16T19:09:06.869Z", "postId": "KB8XPfh7dJ9uJaaDs", "htmlBody": "<p>Agree wholeheartedly. Nick Bostrom's apology was very bad, and this is a big reason I'm starting to agree a lot more with his opposition, because of that problematic apology.</p>\n", "parentCommentId": null, "user": {"username": "Sharmake"}}, {"_id": "uwQjQ4JAoZuaTHKuB", "postedAt": "2023-01-17T02:19:37.234Z", "postId": "KB8XPfh7dJ9uJaaDs", "htmlBody": "<p>It appears that a paragraph was <a href=\"https://forum.effectivealtruism.org/posts/5vFmMXWsh6PaYjqab/linkpost-fli-alleged-to-have-offered-funding-to-far-right?commentId=Dn88oPPMdDK9dpmjh\">added to the statement</a> today:</p>\n<blockquote>\n<p>Added Jan 16: Just to be absolutely unambiguous: FLI finds Nazi, neo-Nazi or pro-Nazi groups or ideologies despicable and would never knowingly support them. In case FLI’s past work, its website and the lifetime work, writing, and talks by FLI leadership left any doubt about that, we included this final sentence in our statement above just to be 100% clear: “the Future of Life Institute stands and will always stand emphatically against racism, bigotry, bias, injustice and discrimination at all times and in all forms.  They are antithetical to our mission to safeguard the future of life and to advance human flourishing.”  In terms of Nya Dagbladet, further investigation of them has only further validated our November decision to reject their proposal, and we regret that we did not understand their organization and history better sooner, so as to reject them earlier in the process. We will be improving our processes to reduce the risk of anything like this ever happening again.</p>\n</blockquote>\n<p>For what it's worth, as someone who mentioned the possibility that Tegmark was \"partway down some sort of far-right pipeline\" elsewhere in this thread, I found the addition reassuring.</p>\n<p>My personal best guess is now that FLI made an honest mistake, and we are reaching diminishing returns on litigating this further.  My sense is that it is incredibly difficult to please everyone with this kind of statement.  It doesn't seem like <em>any</em> of the recent statements by major EA organizations or figures have been well-received overall.  I think devoting a lot of energy to dissecting public statements does not achieve much &amp; is bad for the community's social capital, and we should be a bit more reluctant to publish dissections.</p>\n<p>Others are free to disagree, of course.</p>\n", "parentCommentId": "o95CZcHNoABgKuPFm", "user": {"username": "Aptdell"}}, {"_id": "fAZLtSj8CkgD8jnem", "postedAt": "2023-01-17T03:34:54.616Z", "postId": "KB8XPfh7dJ9uJaaDs", "htmlBody": "<p>Thanks for pointing this out!</p>\n<p>I think the \"dissection\" produced good results here -- it seems to have triggered a helpful revision that acknowledges a failure to adequately vet earlier in the process, which is much more reassuring than other possibilities the original statement left open. It also includes a promise to improve processes to mitigate the risk of this happening again. I'm not 100 percent happy with the revised version, but it is much better.</p>\n<p>Also, as far as \"social capital,\" comments from this forum are regularly reposted as evidence of what \"EA thinks\" of a given controversy. If an apology is insufficient and we are all silent, the inference that we think the apology sufficient will be drawn.</p>\n", "parentCommentId": "uwQjQ4JAoZuaTHKuB", "user": {"username": "Jason"}}, {"_id": "LXQEFYXmbcQohqeHa", "postedAt": "2023-01-17T03:55:37.900Z", "postId": "KB8XPfh7dJ9uJaaDs", "htmlBody": "<blockquote>\n<p>Also, as far as \"social capital,\" comments from this forum are regularly reposted as evidence of what \"EA thinks\" of a given controversy. If an apology is insufficient and we are all silent, the inference that we think the apology sufficient will be drawn.</p>\n</blockquote>\n<p>And arguably rightly, IMO.</p>\n", "parentCommentId": "fAZLtSj8CkgD8jnem", "user": {"username": "Sharmake"}}, {"_id": "qNpuoXqHn5kehSnhD", "postedAt": "2023-01-17T04:12:31.918Z", "postId": "KB8XPfh7dJ9uJaaDs", "htmlBody": "<p>&gt;&gt;&gt; the apology provides scant evidence of sincere introspection and remorse<br><br>He described his old email as \"disgusting.... repulsive.... idiotic and offensive.\"&nbsp;</p>", "parentCommentId": "wfH8n5cYAiHfCbDv5", "user": {"username": "SantaRedux"}}, {"_id": "sJKkZB7LfJaseR9kw", "postedAt": "2023-01-17T04:19:55.129Z", "postId": "KB8XPfh7dJ9uJaaDs", "htmlBody": "<p>WRT the broader theme of EAs and apologies, I'm waiting for Will MacAskill's apology or explanation regarding his statements to journalists supporting SBF's ascetic image.</p>", "parentCommentId": null, "user": {"username": "SantaRedux"}}, {"_id": "eNpgKCQSm39M5j5jR", "postedAt": "2023-01-17T13:30:00.440Z", "postId": "KB8XPfh7dJ9uJaaDs", "htmlBody": "<p>Thankyou for linking that. I'm glad FLI has issued that statement, and it reassures me somewhat. I'd still like to hear more detail of FLI's logic around this grant - why it was considered in the first place, what FLI's pipeline for considering grants is, at what stage Nya Dagblade was rejected, and why. (Hopefully the 'why' part is obvious, but it would be good to understand what information they received that changed their minds, that they didn't have in the first place).</p>", "parentCommentId": "uwQjQ4JAoZuaTHKuB", "user": {"username": "Matt g"}}, {"_id": "hbCbtaLNjs9DqrwFq", "postedAt": "2023-01-17T13:54:05.392Z", "postId": "KB8XPfh7dJ9uJaaDs", "htmlBody": "<p>Here I go with something &nbsp;else completely unhelpful:</p><p>https://en.wikipedia.org/wiki/Struggle_session</p>", "parentCommentId": "wfH8n5cYAiHfCbDv5", "user": {"username": "timunderwood"}}, {"_id": "i3rhAEXAzHMAgwhiJ", "postedAt": "2023-01-17T14:26:59.951Z", "postId": "KB8XPfh7dJ9uJaaDs", "htmlBody": "<p>I'd go so far as to say that most people do not know how to apologize well, especially outside of an interpersonal context. I actually thought the Bostrom apology was about average (which is say bad but not totally meaningless).</p>", "parentCommentId": "HrKNWAZGn6jZ3suNP", "user": {"username": "Erin"}}, {"_id": "3sqR8HioMvoeHYZ7d", "postedAt": "2023-01-17T14:28:28.553Z", "postId": "KB8XPfh7dJ9uJaaDs", "htmlBody": "<p>I think OP's point is that \"preemptively addressing potential attacks\" is not part of a good apology.&nbsp;</p>", "parentCommentId": "SpfZv2qtn6BcYZktt", "user": {"username": "Erin"}}, {"_id": "rBLXLZhckM3Aeg64k", "postedAt": "2023-01-17T14:50:51.473Z", "postId": "KB8XPfh7dJ9uJaaDs", "htmlBody": "<p>Well, I think Bostrom is doing damage control rather than feeling guilty, so I largely agree with that.</p>\n", "parentCommentId": "3sqR8HioMvoeHYZ7d", "user": {"username": "Parrhesia"}}, {"_id": "reWunaMKSEkDrAkjw", "postedAt": "2023-01-17T18:14:32.952Z", "postId": "KB8XPfh7dJ9uJaaDs", "htmlBody": "<p>Please explicitly make the argument, rather than linking a definition. I'm inclined to take this as a tribalistic \"that's communism!\" remark, which is, indeed, unhelpful.</p>", "parentCommentId": "hbCbtaLNjs9DqrwFq", "user": {"username": "David Mears"}}, {"_id": "BLogbTkKgMmreRuQA", "postedAt": "2023-01-17T18:38:25.445Z", "postId": "KB8XPfh7dJ9uJaaDs", "htmlBody": "<p>There's a general lack of competence in (and at times active disdain for) skills in PR and communications in EA. Which for a movement that wants to convince people of things and attract membership seems problematic</p>", "parentCommentId": "HrKNWAZGn6jZ3suNP", "user": {"username": "projectionconfusion"}}, {"_id": "CLnFoKxa4ztNB3BQA", "postedAt": "2023-01-17T21:20:47.792Z", "postId": "KB8XPfh7dJ9uJaaDs", "htmlBody": "<p>Yeah, given that no violence by the people criticizing Bostrom's apology is happen, unlike the actual struggle sessions, I don't understand how they're very comparable.</p>\n", "parentCommentId": "reWunaMKSEkDrAkjw", "user": {"username": "Sharmake"}}, {"_id": "5Qc8SAgAJ2XwQwEkP", "postedAt": "2023-01-17T23:20:13.673Z", "postId": "KB8XPfh7dJ9uJaaDs", "htmlBody": "<p>I tend to agree, though I answered the question this way because I've noticed a pattern much of the time during the last few years of actors in the EA community tending to apologize poorly much of the time.</p>\n<p>I didn't have time to provide more examples when I wrote the comment, though I figure offering simple takes are okay to open-ended question posts like this anyway. It seems from how my comment has received that most people who've bothered checking this comment have in mind that kind of trend in EA I'm alluding to and, not only agree, but appreciate at least one person, like me, putting it plainly.</p>\n", "parentCommentId": "i3rhAEXAzHMAgwhiJ", "user": {"username": "Evan_Gaensbauer"}}, {"_id": "PyLRBiwoahTHkhgye", "postedAt": "2023-01-20T16:35:43.494Z", "postId": "KB8XPfh7dJ9uJaaDs", "htmlBody": "<p>I don't understand what you think FLI did wrong. Looks like their due diligence process worked as intended.<br><br>I also don't condemn Nick Bostrom's original email and don't see what's racist about it.</p><p>If someone calls me, personally, fat, I will see it as an insult in some contexts. But if someone made a true statement about the average BMI of people leaving in the US, it would be ridiculous for me to take it as an insult.&nbsp;</p><p>You call the lanuage used vulgar. I call it efficient. You can call someone \"fat\", or \"overweight\", or \"having a BMI substantially above average\". You can call someone \"dumber\", or \"stupider\", or \"less intelligent\", or \"having a smaller IQ score\". &nbsp;The number of letters increases, but the intended meaning stays the same. Once we make an euphemism for something society deems undesirable, negative connotations grow back over time, so we have to invent more and more elaborate euphemisms. It wouldn't do to be too rude, but we have to stop somewhere before the number of syllables gets out of hand. \"Stupid\" or \"overweight\" seem like reasonable compromises to me.</p><p>It is true that <a href=\"https://slatestarcodex.com/2014/05/12/weak-men-are-superweapons/\">in some contexts</a> true statements can be used to coordinate violence against a group of people, and it is reasonable to be concerned in these situations. But there are also contexts where people need to communicate clearly and efficiently, without adding a thousand disclaimers to every factual statement they make, because it's necessary to solve problems. You don't take offence if your doctor tells you you're overweight, or if a scientist writes a paper discussing possible causes of rising obesity rates. Writing by rationalists and EAs should be treated the same way. Given the track record of EA in general and Nick Bostrom in particular, and the explicit clarification in his letter that his statement should be understood literally and not as an expression of hatred towards Black people, it is crazy to assume that the statement was intended to coordinate some racial violence. EA community did a lot to help Black people.</p><p>EA and rationalist communities have always leaned towards <a href=\"https://www.lesswrong.com/posts/7cAsBPGh98pGyrhz9/decoupling-vs-contextualising-norms\">decoupling norms</a> in a conversation. Following decoupling norms means you must understand statements literally and avoid unwarranted inferences. If someone says X, and you believe that X implies Y, or you believe that the speaker believes that X implies Y, you are not allowed to just act like they said Y. You should first clarify.&nbsp;</p><p>Epistemic rigor of EA is valuable and unique. It is what distinguishes EA from other do-gooder organizations. I was, for example, a part of Russian opposition movement. It was outright taboo to discuss whether this or that tactic was effective (what if we looked into it and it turned out ineffective? It would be so discouraging to everyone!). I rarely saw anyone express less than complete confidence in our victory (surely making different predictions would just mean you were rooting for the other side). I've seen people try to organize a popular opposition movement while reassuring each other that they were NOT trying to gain power (surely only bad people could have goals like that...). You all saw the outcome of that endeavor.&nbsp;<br><br>This is why I am extremely disappointed and dismayed to see EA community violate its own social norms and surrender the unique value it brings to the world, just because some Twitter people are angry or something.</p>", "parentCommentId": null, "user": {"username": "ViktoriaMalyasova"}}, {"_id": "48mQXGzYaYagHpH7w", "postedAt": "2023-01-20T22:06:19.187Z", "postId": "KB8XPfh7dJ9uJaaDs", "htmlBody": "<p>We are issuing timunderwood a warning for this comment. This is a needlessly inflammatory comparison.</p>", "parentCommentId": "hbCbtaLNjs9DqrwFq", "user": {"username": "Ben_West"}}, {"_id": "mRwQzArtovZNtLha6", "postedAt": "2023-01-21T09:30:05.271Z", "postId": "KB8XPfh7dJ9uJaaDs", "htmlBody": "<p>Fair.</p><p>But I also want to say here aloud: Bostrom is fine. He has no need at any point in this to engage in sincere repentence, introspection or remorse. He is not a bad person, and I would be happy to associate with him. He has shown no signs of factual views that are empirically untenable, and he has shown no sign of moral views that involve not valuing the well being of everyone in an approriate and equal manner, no matter who they are or where they came from.&nbsp;</p><p>He made a mistake in terms of communication and said something offensive twenty five years ago, that he understands was a mistake to say. But that mistake was one of judgement not of fundamental moral character. &nbsp;</p><p>You do not repent for making a mistake of judgement, you apologize for being dumb and move on.&nbsp;</p><p>There is <i>nothing </i>in this that indicates poor moral character or views that I find reprehensible in Bostrom. I do not view him as a sinner in need of repentence.</p><p>Further expecting those who have sinned to sincerely introspect and to sincerely repent is the sort of thing that religious fanatics and other sorts of bad people ask people to do.</p><p>That is my honest view. It is my honest view that David Mears is suggesting we create a community culture that is fundamentally designed to enforce conformity and prevent truth seeking. And I think just like those who think that discussion about race, genetics and intelligence should be allowed to happen somewhere (though that place definitely should not be the EA forum) need to ask themsevles 'is what I am thinking similar in some important way to what Nazis thought' and 'might allowing these conversations lead to somewhere bad and unfairly exclude people' those who want to demand the sort of conformist policy <i>should </i>ask themselves if this is similar to the sort of thought control that has been exerted by ideologically motivated villians throughout history, and if this sort of policy might lead to very bad places also.&nbsp;</p>", "parentCommentId": "48mQXGzYaYagHpH7w", "user": {"username": "timunderwood"}}, {"_id": "fC8xhwwJjipegRgLc", "postedAt": "2023-01-21T21:35:59.947Z", "postId": "KB8XPfh7dJ9uJaaDs", "htmlBody": "<p>Update: <a href=\"https://forum.effectivealtruism.org/posts/LvwihGYgFEzjGDhBt/fli-faq-on-the-rejected-grant-proposal-controversy\">FLI FAQ on the rejected grant proposal controversy</a>.</p><p>Although I still think the original statement was not good, reading the FAQ and comments in the linked post have helped me have more empathy for the difficulties of releasing a PR when under public pressure to say something urgently.&nbsp;</p><p>I think my tone here was too confrontational and demanding, and I'm sorry if that caused additional stress for FLI.</p><p>Thankyou to FLI for updating both the initial statement, and putting out the FAQ, which clears things up.</p>", "parentCommentId": "oXTBevZjqDbfAe2gz", "user": {"username": "Matt g"}}, {"_id": "pRW2Ad6WvgeWBbd8a", "postedAt": "2023-01-22T00:50:45.625Z", "postId": "KB8XPfh7dJ9uJaaDs", "htmlBody": "<blockquote><p>But I also want to say here aloud: Bostrom is fine. He has no need at any point in this to engage in sincere repentence, <strong>introspection </strong>or remorse.&nbsp;</p></blockquote><p>Without defending David's views, I think saying Nick doesn't need to engage in <strong>any </strong>introspection goes too far-are you saying there was nothing Nick could have done better?</p>", "parentCommentId": "mRwQzArtovZNtLha6", "user": {"username": "pseudonym"}}, {"_id": "fPWfXmkoSanaMRCRP", "postedAt": "2023-01-22T16:06:45.963Z", "postId": "KB8XPfh7dJ9uJaaDs", "htmlBody": "<p>He should recognize that his autism (after I recognized the sort of errors my own mind makes in reading his apology email, I non-expert with an Asperger's diagnosis outside diagnosed him) makes him an idiot about PR things, and before making any future public announcements he should get several people who are 'woke' or whatever the right word to describe them is to read it first.&nbsp;</p><p>He also should introspect about the thing in his brain that made him feel like it was really, really important to be precise about what he thought about racism and eugenics in this apology, and he should recognize that sometimes it is not the time to say anything.&nbsp;</p><p>I mean, he made errors of judgement. Both 25 years ago, and last week. The one last week was actually a bigger error of judgement in my view, since he <i>should </i>have taken into account that he is currently in a position of public responsibility.</p><p>However the 'introspection' I want Bostrom to engage in is fundamentally different in kind from the 'introspection' that I think David wanted him to engage in.</p>", "parentCommentId": "pRW2Ad6WvgeWBbd8a", "user": {"username": "timunderwood"}}, {"_id": "xt4bzGG8hdoj8gCbv", "postedAt": "2023-02-12T19:50:29.997Z", "postId": "KB8XPfh7dJ9uJaaDs", "htmlBody": null, "parentCommentId": null, "user": null}]