[{"_id": "LixhCZttArH7qk7RQ", "postedAt": "2023-09-26T10:43:49.972Z", "postId": "KbTasufbtJwZYiJQ8", "htmlBody": "<p>Do you have any recommendations for doing threat modeling well? In particular, resources that seem applicable to many different risks - nuclear, AI, bio.</p>", "parentCommentId": null, "user": {"username": "PatrickL"}}, {"_id": "eXqfSjWm4WTqrqzxk", "postedAt": "2023-09-26T11:35:06.972Z", "postId": "KbTasufbtJwZYiJQ8", "htmlBody": "<p>Very happy to see you doing this, and hope you're doing well.</p><p>Question: What is your view on catastrophic risks from communicable versus noncommunicable biological or chemical threats - for example, biotoxins, anthrax, or chemical weapons, as opposed to possible communicable disease bioweapons like smallpox? Specifically, do you see a justification for considering [noncommunicable threats] global catastrophic risks? [Edited to clarify.]</p><p>(I'm interested in hearing your views on lots of topics, but since I'm not going to ask fifty question here, I wanted to pick something I think you may disagree with the \"EA consensus\" about.)</p>", "parentCommentId": null, "user": {"username": "Davidmanheim"}}, {"_id": "GeH8JJqaoWDtPeAdz", "postedAt": "2023-09-26T14:00:19.928Z", "postId": "KbTasufbtJwZYiJQ8", "htmlBody": "<p>How seriously are national security people taking the threat of AI today (in particular, extinction risk)? Can we expect meaningful action to create a <a href=\"https://twitter.com/NPCollapse/status/1706330290371653936\">kill switch</a> soon?</p>", "parentCommentId": null, "user": {"username": "Greg_Colbourn"}}, {"_id": "rnjBJ8o2vkqjxwdJA", "postedAt": "2023-09-26T14:02:07.759Z", "postId": "KbTasufbtJwZYiJQ8", "htmlBody": "<p>Do we need more people at the big AI companies to be like Petrov? (e.g. disobey orders to commence/continue a dangerous training run).</p>", "parentCommentId": null, "user": {"username": "Greg_Colbourn"}}, {"_id": "TcuzydTJqBYC9ohyK", "postedAt": "2023-09-26T23:51:27.248Z", "postId": "KbTasufbtJwZYiJQ8", "htmlBody": "<p>Should the US start mass-producing hazmat suits? So that, in the event of an engineered pandemic, the spread of the disease can be prevented, while still being able to maintain critical infrastructure/delivery of basic necessities.</p>", "parentCommentId": null, "user": {"username": "Akmon Ra"}}, {"_id": "G3XWxNQvdfiobkuP7", "postedAt": "2023-09-27T11:43:16.149Z", "postId": "KbTasufbtJwZYiJQ8", "htmlBody": "<p>After what happened in Iraq, do you think the USA is likely to take unilateral action against nuclear/chemical/biological threats if they emerge in the near future? If not then what might their approach be too such threats?</p>\n", "parentCommentId": null, "user": {"username": "NickLaing"}}, {"_id": "NDFtYgX6ejPpwAESE", "postedAt": "2023-09-27T12:28:33.117Z", "postId": "KbTasufbtJwZYiJQ8", "htmlBody": "<p>What are you more concerned about in the biological weapons space: states, terrorist groups, or lone wolves? Why (if you can share the information)?</p>\n", "parentCommentId": null, "user": {"username": "jooke"}}, {"_id": "2jLymJGB9KS5k6JBi", "postedAt": "2023-09-27T18:27:05.533Z", "postId": "KbTasufbtJwZYiJQ8", "htmlBody": "<p>Context: I'm hoping to find lessons from nuclear security that are transferable to the security of bioweapons and transformative AI.&nbsp;</p><p>Question: <strong>Are there specific reports you could recommend on prevening these nuclear security risks</strong>:</p><ul><li>Insider threats (including corporate/foreign espionage)</li><li>Cyberattacks</li><li>Arms races</li><li>Illicit / black market proliferation</li><li>Fog of war</li></ul>", "parentCommentId": null, "user": {"username": "madhav-malhotra"}}, {"_id": "zqbde73jAxy4tj4aZ", "postedAt": "2023-09-27T18:32:54.392Z", "postId": "KbTasufbtJwZYiJQ8", "htmlBody": "<p>Could you share the top 3 constraints and benefits you had in improving global nuclear security while you were working for the US DoD compared to now, when you're working as an academic? &nbsp;</p>", "parentCommentId": null, "user": {"username": "madhav-malhotra"}}, {"_id": "bdWQ9dnbYZdrj887i", "postedAt": "2023-09-27T18:34:38.863Z", "postId": "KbTasufbtJwZYiJQ8", "htmlBody": "<p>Are there any misconceptions, stereotypes, or tropes that you commonly see in academic literature around nuclear security or biosecurity that you could correct given your perspective inside government?</p>", "parentCommentId": null, "user": {"username": "madhav-malhotra"}}, {"_id": "ntc32sonCgQn6kdxx", "postedAt": "2023-09-27T18:56:37.010Z", "postId": "KbTasufbtJwZYiJQ8", "htmlBody": "<p>If, in the next 15 years, there is a human caused biological global catastrophe (say, kills &gt;1% of global population), what credence would you give that artificial intelligence was somehow involved?</p>", "parentCommentId": null, "user": {"username": "Ben_West"}}, {"_id": "qAxgfk5dxXhniftDt", "postedAt": "2023-09-27T18:59:31.837Z", "postId": "KbTasufbtJwZYiJQ8", "htmlBody": "<p>Do you think research into game theory has increased, decreased, or had no effect on the risks from nuclear weapons? Should this tell us anything about the value of research into the theoretical basis of conflict in the future?</p>", "parentCommentId": null, "user": {"username": "Ben_West"}}, {"_id": "4BxPgLegN53kchh43", "postedAt": "2023-09-27T19:42:49.399Z", "postId": "KbTasufbtJwZYiJQ8", "htmlBody": "<p>Context: I'm hoping to learn lessons in nuclear security that are transferable to AI safety and biosecurity.&nbsp;</p><p>Question: Would you have any case studies or advice to share on how regulatory capture and lobbying was mitigated in US nuclear security regulations and enforcement?</p>", "parentCommentId": null, "user": {"username": "madhav-malhotra"}}, {"_id": "QSEavtzRfKmiJ78zH", "postedAt": "2023-09-28T02:42:05.125Z", "postId": "KbTasufbtJwZYiJQ8", "htmlBody": "<p>Do you think that raising life scientists' awareness about the potential dual-use risks of their work is net-positive, because they can mitigate those risks, or net-negative, because they will draw the attention of bad actors?</p>", "parentCommentId": null, "user": {"username": "Daniel Greene"}}, {"_id": "znQhrpFjaQCrpdbBJ", "postedAt": "2023-09-28T07:18:13.858Z", "postId": "KbTasufbtJwZYiJQ8", "htmlBody": "<p>Does the development of regional groupings like the EU improve X-risk mitigation, or exacerbate risks?</p>\n<p>If they help mitigate risks, how could development of such groupings become aligned with US interests?</p>\n", "parentCommentId": null, "user": {"username": "bhrdwj"}}, {"_id": "Mrx7QCMJzBqxCmbHf", "postedAt": "2023-09-28T07:20:41.335Z", "postId": "KbTasufbtJwZYiJQ8", "htmlBody": "<p>\"Specifically, do you see a justification for considering the former global catastrophic risks?\"</p>\n<p>Which is the \"former\", communicable or non-communicable?</p>\n", "parentCommentId": "eXqfSjWm4WTqrqzxk", "user": {"username": "bhrdwj"}}, {"_id": "rLNGt4DgxvwtY3Lwr", "postedAt": "2023-09-28T09:31:50.190Z", "postId": "KbTasufbtJwZYiJQ8", "htmlBody": "<p>Thanks, fixed!</p>", "parentCommentId": "Mrx7QCMJzBqxCmbHf", "user": {"username": "Davidmanheim"}}, {"_id": "E2cXnnD8qiimm9gE6", "postedAt": "2023-09-28T09:31:53.476Z", "postId": "KbTasufbtJwZYiJQ8", "htmlBody": "<p>What role should international organizations and treaties play in regulating emerging biotechnologies to prevent their misuse for bioweapons development?</p><p>How can we strike a balance between scientific research and security concerns in the field of biotechnology to prevent the accidental or deliberate creation of bioweapons?</p>", "parentCommentId": null, "user": {"username": "Vee"}}, {"_id": "PJ9D2eQ7jBcxdhf48", "postedAt": "2023-09-28T09:39:54.140Z", "postId": "KbTasufbtJwZYiJQ8", "htmlBody": "<p>Hindsight is 20:20, but do you think it was a net good for Ukraine to give up its nukes? I know it didn't have the C2 capabilities to actually use them at the time and economically was kind of strongarmed into it and all else equal I know it's better if fewer countries have them, but maybe it would have prevented this current war which has significant escalation potential.</p>\n", "parentCommentId": null, "user": {"username": "mhint199"}}, {"_id": "XQo748pPMmGdshXrd", "postedAt": "2023-09-28T12:32:48.572Z", "postId": "KbTasufbtJwZYiJQ8", "htmlBody": "<p>What metrics should be used to evaluate the success of arms control agreements in effectively monitoring and limiting the deployment of tactical nuclear weapons?</p><p>In what ways do regional security dynamics influence the decisions of nations to acquire and deploy tactical nuclear weapons, and how can these dynamics be managed to reduce the risk of conflict?</p>", "parentCommentId": null, "user": {"username": "Vee"}}, {"_id": "2STkZ78fYyvgte6oh", "postedAt": "2023-09-28T21:32:42.027Z", "postId": "KbTasufbtJwZYiJQ8", "htmlBody": "<p>AI is increasing the BW threat in at least two ways.  It is expanding “recipe” access to more players, like the internet did.  For the last thirty years there were terrorist groups with intent to deploy BW, but they were either interdicted or not very capable.  AI will expand access to capability.\nThe second concern is that sophisticated actors will use AI-enabled bioengineering to make enhanced pathogens.  I’m pleased that responsible AI companies are working feverishly to put in place guardrails to mitigate both of these risks.  To answer your specific question, I would not be at all surprised if in 15 years a global biological catastrophe is AI-enabled.</p>\n", "parentCommentId": "ntc32sonCgQn6kdxx", "user": {"username": "Andy Weber"}}, {"_id": "o5LRfD2ipuyDWc2LE", "postedAt": "2023-09-28T21:44:59.310Z", "postId": "KbTasufbtJwZYiJQ8", "htmlBody": "<p>David,\nGreat to hear from you, and I look forward to your other forty nine questions the next time we meet in person.  Communicable biological weapons represent an existential or omnicidal risk.  Non-communicable biological weapons could also be catastrophic.  In my opinion several million dead is catastrophic, even if it is not existential.  Thankfully, much that we can do to prevent the worst case will also reduce the lesser included case.  Also, some non-communicable BW agents like antibiotic and vaccine resistant anthrax are more probable.  So if there is an “EA consensus” to ignore toxins and anthrax, I would disagree.</p>\n", "parentCommentId": "eXqfSjWm4WTqrqzxk", "user": {"username": "Andy Weber"}}, {"_id": "BrbyC6wfiKzqwtumG", "postedAt": "2023-09-28T21:52:48.231Z", "postId": "KbTasufbtJwZYiJQ8", "htmlBody": "<p>It is one somewhat useful tool to try to assess and potentially mitigate risks.  With nuclear weapons the data on use and near misses are extremely limited.  Untested theories can be helpful, but we can’t rely on them too much because the stakes of getting it wrong are so high.</p>\n", "parentCommentId": "qAxgfk5dxXhniftDt", "user": {"username": "Andy Weber"}}, {"_id": "MJCx8nh7i3rGqJAfH", "postedAt": "2023-09-28T21:54:11.448Z", "postId": "KbTasufbtJwZYiJQ8", "htmlBody": "<p>How much do you think the risk of nuclear war would increase over the century if Iran acquired nuclear weapons? And what measures, if any, do you think are appropriate to attempt to prevent this or other examples of nuclear proliferation?</p>", "parentCommentId": null, "user": {"username": "JoelMcGuire"}}, {"_id": "d3v3kkgXoLD76sD2C", "postedAt": "2023-09-28T21:59:53.413Z", "postId": "KbTasufbtJwZYiJQ8", "htmlBody": "<p>The prospect of a nuclear conflict is so terrifying I sometimes think we should be willing to pay almost any price to prevent such a possibility.&nbsp;</p><p>But when I think of withdrawing support for Ukraine or Taiwan to reduce the likelihood of nuclear war, that doesn't seem right either -- as it'd signal that we could be threatened into any concession if nuclear threats were sufficiently credible.</p><p>How would you suggest policymakers navigate such terrible tradeoffs?</p>", "parentCommentId": null, "user": {"username": "JoelMcGuire"}}, {"_id": "xeATTzbvn3j4hZ7gc", "postedAt": "2023-09-28T22:01:04.993Z", "postId": "KbTasufbtJwZYiJQ8", "htmlBody": "<p>Lately it is quite high on the national security agenda.  The upcoming UK summit demonstrates the importance some leaders attach to it.  A lot of this resides in the private sector, so governments will have to work in close partnership with private stakeholders to take meaningful action.  I don’t know enough to answer your specific “kill switch” question.</p>\n", "parentCommentId": "GeH8JJqaoWDtPeAdz", "user": {"username": "Andy Weber"}}, {"_id": "YqbtbzRWRxafhkvSv", "postedAt": "2023-09-28T22:02:49.616Z", "postId": "KbTasufbtJwZYiJQ8", "htmlBody": "<p>Definitely net-positive.  It is actually shocking how little on this is included in the education of life scientists.  We teach bio-ethics but rarely biosecurity.</p>\n", "parentCommentId": "QSEavtzRfKmiJ78zH", "user": {"username": "Andy Weber"}}, {"_id": "gd9NiMbkWuSacAEQR", "postedAt": "2023-09-28T22:06:30.263Z", "postId": "KbTasufbtJwZYiJQ8", "htmlBody": "<p>I’m deeply concerned about all of these.  Thankfully, only a handful of countries are actively pursuing biological weapons.  That said, the few countries that have offensive BW programs are very dangerous.\nGiven the expanding access to knowledge and BW capabilities, I worry also worry a lot about terrorist groups and lone wolves.  They represent a very difficult intelligence and law enforcement challenge.</p>\n", "parentCommentId": "NDFtYgX6ejPpwAESE", "user": {"username": "Andy Weber"}}, {"_id": "Z6RPWPTsqo4G5gBxa", "postedAt": "2023-09-28T22:12:47.183Z", "postId": "KbTasufbtJwZYiJQ8", "htmlBody": "<p>Some of our amazing former Council on Strategic Risks Ending Bioweapons Fellows wrote this outstanding paper debunking common misconceptions about biological weapons:  <a href=\"https://councilonstrategicrisks.org/wp-content/uploads/2020/12/Common-Misconceptions-About-Biological-Weapons_BRIEFER-12_2020_12_7.pdf\">https://councilonstrategicrisks.org/wp-content/uploads/2020/12/Common-Misconceptions-About-Biological-Weapons_BRIEFER-12_2020_12_7.pdf</a></p>\n", "parentCommentId": "bdWQ9dnbYZdrj887i", "user": {"username": "Andy Weber"}}, {"_id": "FQHQfwi8TiMYECQpS", "postedAt": "2023-09-28T22:40:08.825Z", "postId": "KbTasufbtJwZYiJQ8", "htmlBody": "<p>Unilateral action should be the last resort.  The Iraqi BW program was successfully destroyed by 1996, and it was never reconstituted.  Rolf Ekeus wrote a very good book on UNSCOM’s successful efforts.\nThe only place today that such unilateral action would even be considered is Syria’s rump chemical weapons program.  The only other countries that have biological and chemical weapons also have nuclear weapons, so unilateral action would not be considered unless it were part of a larger direct conflict.<br>\nOur approach should be to do everything we can to strengthen the norm against developing and using biological and chemical weapons.  Thankfully very few countries pursue these prohibited weapons.\nI am also a strong believer in deterrence by denial, and the Council on Strategic Risks has written about this.  We and our Allies and partners should have a visible, greatly expanded biodefense effort to deter bio attacks and deny our adversaries the mass casualty effects of such weapons.  The U.S. Department of Defense spends less than 1/5 of one percent of its budget on chemical and biological defense.  This needs to change.  The recent Biodefense Posture Review is a good step in the right direction.</p>\n", "parentCommentId": "G3XWxNQvdfiobkuP7", "user": {"username": "Andy Weber"}}, {"_id": "5oKuzvdwE8LRArLAG", "postedAt": "2023-09-28T22:45:49.324Z", "postId": "KbTasufbtJwZYiJQ8", "htmlBody": "<p>Physical protection works, so this would be our best defense until medical countermeasures are developed and distributed.  We need better and cheaper masks and suits, and they should be widely available in a crisis.</p>\n", "parentCommentId": "TcuzydTJqBYC9ohyK", "user": {"username": "Andy Weber"}}, {"_id": "Jziobff5AHHSKiTwE", "postedAt": "2023-09-28T22:51:03.247Z", "postId": "KbTasufbtJwZYiJQ8", "htmlBody": "<p>Removing nuclear weapons from Kazakhstan, Belarus, and Ukraine was an extremely important success.  Had Ukraine tried to retain nuclear weapons, I believe an armed conflict with Russia would have broken out in the 1990’s.<br>\nThere are many other things that could have been done to prevent Russia’s unprovoked, illegal attack on Ukraine.  Ukraine keeping nuclear weapons is not one of them.</p>\n", "parentCommentId": "PJ9D2eQ7jBcxdhf48", "user": {"username": "Andy Weber"}}, {"_id": "iGotrzio3sDjvX9yh", "postedAt": "2023-09-28T23:00:35.302Z", "postId": "KbTasufbtJwZYiJQ8", "htmlBody": "<ol>\n<li>\n<p>International organizations and treaties have a vital role in preventing BioWeapons development.  We need to redouble our efforts to strengthen the BWC.  There also needs to be stronger global governance to prevent accidents and misuse.  Kazakhstan President Tokayev has proposed establishing and International Biosafety Agency.  This and other similar concepts to strengthen biosecurity should be actively promoted.</p>\n</li>\n<li>\n<p>We definitely need to do more on the security side of this equation.</p>\n</li>\n</ol>\n", "parentCommentId": "E2cXnnD8qiimm9gE6", "user": {"username": "Andy Weber"}}, {"_id": "bPAuX52EWaexks7Eo", "postedAt": "2023-09-29T01:08:16.413Z", "postId": "KbTasufbtJwZYiJQ8", "htmlBody": "<p>Because you've been a public servant who took on the responsibility of shutting down the Soviet bioweapons program, securing loose nuclear material, and kickstarting a wildly successful early career program while at the DoD, I need to know: is it ever difficult being so awesome?</p>\n<p>And, what would your advice be for younger folks aiming to follow in your footsteps?</p>\n", "parentCommentId": null, "user": {"username": "ASB"}}, {"_id": "7WeXeJ8sCh9mRqRyb", "postedAt": "2023-09-29T11:20:14.218Z", "postId": "KbTasufbtJwZYiJQ8", "htmlBody": "<p>\"There are many other things that could have been done to prevent Russia’s unprovoked, illegal attack on Ukraine. Ukraine keeping nuclear weapons is not one of them.\"</p><ul><li>Could you explain your thinking more for those not familiar with the military strategy involved? What about having nuclear weapons makes an invasion more viable? Which specific alternatives would be more useful in preventing the attacks and why?</li></ul>", "parentCommentId": "Jziobff5AHHSKiTwE", "user": {"username": "madhav-malhotra"}}, {"_id": "vSszf3EpYyN9Fgw68", "postedAt": "2023-09-29T11:32:16.578Z", "postId": "KbTasufbtJwZYiJQ8", "htmlBody": "<p>Here's a <a href=\"https://poe.com/s/CFK0fXNHG2fqD5rlWoFj\">summary of the report from Claude-1</a> if someone's looking for an 'abstract':</p><blockquote><p>There are several common misconceptions about biological weapons that contribute to underestimating the threat they pose. These include seeing them as strategically irrational, not tactically useful, and too risky for countries to pursue.</p><p>In reality, biological weapons have served strategic goals for countries in the past like deterrence and intimidation. Their use could also provide tactical advantages in conflicts.</p><p>Countries have historically taken on substantial risks in pursuing risky weapons programs when they believe the strategic benefits outweigh the costs. Accidents and blowback would not necessarily deter programs.</p><p>Decisions around biological weapons activities are not always top-down and known to all national leaders. Bureaucratic and individual interests can influence programs apart from formal policy.</p><p>International norms and laws alone are insufficient to deter or discover clandestine biological weapons work given lack of verification. COVID has shown existing vulnerabilities.</p><p>Dispelling these misconceptions is important for strengthening defenses against the real biological weapons threat, which pandemic has shown remains serious despite decades of effort. More investment is needed.&nbsp;</p></blockquote>", "parentCommentId": "Z6RPWPTsqo4G5gBxa", "user": {"username": "madhav-malhotra"}}, {"_id": "vAx8TXE3Gj5rmMMtq", "postedAt": "2023-09-29T14:32:37.710Z", "postId": "KbTasufbtJwZYiJQ8", "htmlBody": "<p>Do you see a realistic prospect for any state with nuclear weapons giving them up?&nbsp;</p><p>Either unilaterally or as part of some kind of agreement?</p>", "parentCommentId": null, "user": {"username": "Ray_Kennedy"}}, {"_id": "XJ4HaPFzj8zjbj6i7", "postedAt": "2023-09-29T20:17:22.058Z", "postId": "KbTasufbtJwZYiJQ8", "htmlBody": "<p>ASB,\nMaybe I’ll try answering both questions at once, because the first one is too ridiculous to answer directly without being snotty.  While some of my work during a thirty year public service career has received attention, it is very important to understand that anything we achieved was the result of teamwork.  Indeed, one of the most satisfying aspects of public service is that it is a team sport.  So my advice is don’t have personal ambition, but rather focus on mission ambition.  Together we can accomplish big things to make the world a safer place.  One of the aspects I love about the EA community is how supportive and kind people are to one another.</p>\n", "parentCommentId": "bPAuX52EWaexks7Eo", "user": {"username": "Andy Weber"}}, {"_id": "94P5qd3BRrmweseqF", "postedAt": "2023-09-29T20:22:38.145Z", "postId": "KbTasufbtJwZYiJQ8", "htmlBody": "<p>That’s part of the job - there are few easy policy decisions.  I would give NATO and the Biden Administration high marks for lowering the risk of nuclear war AND supporting Ukraine and Taiwan.  When Putin and his minions were making reckless and dangerous nuclear threats, we were calm and did not change our nuclear posture.  This approach seems to be working.</p>\n", "parentCommentId": "d3v3kkgXoLD76sD2C", "user": {"username": "Andy Weber"}}, {"_id": "S5MxBvfKRrAv7kMqF", "postedAt": "2023-09-29T21:00:44.243Z", "postId": "KbTasufbtJwZYiJQ8", "htmlBody": "<p>Joel,\nI’m highly confident Iran will not acquire a nuclear weapon.  The U.S. and Israel have exquisite intelligence on the Iranian nuclear program, which has been a high priority for decades.  Should Supreme Leader Ali Khamenei change his policy and pursue a nuclear weapon, we would know.</p>\n<p>During my time in government I was involved in convincing the Israeli government not to launch a military strike against Iranian nuclear facilities.  I was also involved in developing the military capabilities needed if Iran did opt for nuclear weapons, and these capabilities are now mature.  The Iranian leadership understands well that pursuit of nuclear weapons would provoke an Israeli military strike.</p>\n<p>The above said, Trump’s decision to pull the U.S. out of the JCPOA to pursue a better deal was a stupid and reckless failure.  Undoing that damage should be a high priority for our diplomats.</p>\n", "parentCommentId": "MJCx8nh7i3rGqJAfH", "user": {"username": "Andy Weber"}}, {"_id": "vGrk7XTFr4YjyZqhr", "postedAt": "2023-09-29T21:08:33.228Z", "postId": "KbTasufbtJwZYiJQ8", "htmlBody": "<p>See my comments above on Iran.  A tougher response to Putin’s attack on Georgia in 2008 and the illegal occupation of Crimea and Eastern Ukraine in 2014 might have prevented Putin’s terrible decision to invade in 2022.  We could have provide more military assistance and training to Ukraine after 2014.  Perhaps we should have been more receptive to Ukraine and Georgia’s NATO membership aspirations in the late 1990’s and early 2000’s.</p>\n", "parentCommentId": "7WeXeJ8sCh9mRqRyb", "user": {"username": "Andy Weber"}}, {"_id": "WfHZAsgNkQk4sukJe", "postedAt": "2023-09-29T21:15:21.082Z", "postId": "KbTasufbtJwZYiJQ8", "htmlBody": "<p>There are a few examples of states giving up nuclear weapons or the pursuit of them.  South Africa gave them up.  Sweden, Argentina, and Brazil gave up seeking them.  I do believe that we can make serious steps towards the vision of a world without nuclear weapons.  It will take determination, energy, and creativity to get us there.  That is one reason I am so excited that so many young leaders have shown a renewed interest in nuclear weapons issues.</p>\n", "parentCommentId": "vAx8TXE3Gj5rmMMtq", "user": {"username": "Andy Weber"}}, {"_id": "cLMrK4B7XZJ3EaQhn", "postedAt": "2023-09-29T21:20:01.419Z", "postId": "KbTasufbtJwZYiJQ8", "htmlBody": "<p>The Council on Strategic Risks just released a report on tactical nuclear weapons:  <a href=\"https://councilonstrategicrisks.org/2023/08/01/ending-tactical-nuclear-weapons/\">https://councilonstrategicrisks.org/2023/08/01/ending-tactical-nuclear-weapons/</a></p>\n<p>The INF Treaty and the 1991 Presidential Nuclear Initiatives were two historic examples of eliminating so-called tactical nuclear weapons.  We need to build on these lessons and make capping and eliminating tactical nuclear weapons the highest arms control priority.</p>\n", "parentCommentId": "XQo748pPMmGdshXrd", "user": {"username": "Andy Weber"}}, {"_id": "nRJcRasbtjFsPtLmz", "postedAt": "2023-09-29T21:26:28.315Z", "postId": "KbTasufbtJwZYiJQ8", "htmlBody": "<p>This answer seems very diplomatically phrased, and also compatible with many different probabilities for a question like: \"in the next 10 years, will any nuclear capable states (<a href=\"https://en.wikipedia.org/wiki/List_of_states_with_nuclear_weapons#Launch_authority\">wikipedia list</a> to save some people a search) cease to be so\"</p>", "parentCommentId": "WfHZAsgNkQk4sukJe", "user": {"username": "NunoSempere"}}, {"_id": "34rofZGyH7ugNFTcr", "postedAt": "2023-09-30T00:03:36.934Z", "postId": "KbTasufbtJwZYiJQ8", "htmlBody": "<blockquote><p>The only other countries that have biological and chemical weapons also have nuclear weapons, so unilateral action would not be considered unless it were part of a larger direct conflict.</p></blockquote><p>This seems like a strong incentive for countries like Syria to try to acquire nuclear weapons.</p>", "parentCommentId": "FQHQfwi8TiMYECQpS", "user": {"username": "Larks"}}, {"_id": "xSyfAc9sKoQzQTCMp", "postedAt": "2023-09-30T00:04:57.118Z", "postId": "KbTasufbtJwZYiJQ8", "htmlBody": "<blockquote><p>Had Ukraine tried to retain nuclear weapons, I believe an armed conflict with Russia would have broken out in the 1990’s.</p></blockquote><p>Could you explain your reasoning here? My impression was that nukes generally make war less likely (through deterrence) but more costly if it occurs.</p>", "parentCommentId": "Jziobff5AHHSKiTwE", "user": {"username": "Larks"}}, {"_id": "oCFhtJE7KLnbmbBic", "postedAt": "2023-10-05T15:00:23.389Z", "postId": "KbTasufbtJwZYiJQ8", "htmlBody": "<p>Syria tried and failed to develop nuclear weapons.  In 2007 the Israeli Defense Forces destroyed a nascent nuclear reactor under construction.  Any renewed attempt would face a similar fate.</p>\n", "parentCommentId": "34rofZGyH7ugNFTcr", "user": {"username": "Andy Weber"}}, {"_id": "sCgwYkNb4iknxSnqZ", "postedAt": "2023-10-05T15:05:05.169Z", "postId": "KbTasufbtJwZYiJQ8", "htmlBody": "<p>Every specific case is different.  I’m not sure that we can generalize and state that nuclear weapons make war less likely.  That said, I am a supporter of stable deterrence for the U.S. and its Allies.  In my view so-called tactical nuclear weapons weaken deterrence.  Do we really want Putin to think that use of a “small” nuclear weapon would be met with a proportionate nuclear response?</p>\n", "parentCommentId": "xSyfAc9sKoQzQTCMp", "user": {"username": "Andy Weber"}}, {"_id": "72Yuqky9jquE5cxL5", "postedAt": "2023-10-05T15:09:58.883Z", "postId": "KbTasufbtJwZYiJQ8", "htmlBody": "<p>I believe significant changes to U.S. nuclear weapons policy and posture only occur when the President personally intervenes.  This was also true of the U.S. decision to eliminate its biological weapons program in 1969.  President Nixon demanded it.</p>\n", "parentCommentId": "zqbde73jAxy4tj4aZ", "user": {"username": "Andy Weber"}}]