[{"_id": "quEh96hZAtX6mdP4Y", "postedAt": "2023-04-28T23:49:34.979Z", "postId": "KDMosgfZKsa2P3hNu", "htmlBody": "<p>Thanks for sharing! My suggestion at a high level would be to include more materials with a somewhat critical perspective for balance purposes. That may be challenging given the reading/watching time constraints you identified, but including most of them in the optional reading/watching section would mitigate that. (I'm also curious if the requirements for grad students match those for undergrads; the suggestion above would apply particularly to grad students.)&nbsp;</p>", "parentCommentId": null, "user": {"username": "Jason"}}, {"_id": "vrJZF5zNSZftWzkD6", "postedAt": "2023-04-29T18:58:51.361Z", "postId": "KDMosgfZKsa2P3hNu", "htmlBody": "<p>Jason - this is an interesting issue. In previous iterations of this class, I included more anti-EA critiques. But, honestly, the anti-EA critiques mostly relied on moral intuitions that many students already have. So, the same points tend to come up organically in the seminar discussions, as students raise issues, objections, and criticisms.</p><p>In other words, the added value from including anti-EA critiques, above and beyond the critiques that students already think up on their own, has proven fairly limited.</p><p>Another take on this might be: very few anti-EA critiques are any more informed or sophisticated than the arguments that a typical undergrad at a state university can make for themselves.</p>", "parentCommentId": "quEh96hZAtX6mdP4Y", "user": {"username": "geoffreymiller"}}, {"_id": "HHfxuL2uAHFYPzmkL", "postedAt": "2023-05-01T15:06:45.313Z", "postId": "KDMosgfZKsa2P3hNu", "htmlBody": "<p>PS For links to other people's EA course syllabi, Pablo Stafforini has been keeping a very helpful list <a href=\"https://www.stafforini.com/blog/effective-altruism-syllabi/\">here</a>.&nbsp;</p>", "parentCommentId": null, "user": {"username": "geoffreymiller"}}, {"_id": "K3WPyirbh4c4bEyvZ", "postedAt": "2023-05-01T16:17:38.758Z", "postId": "KDMosgfZKsa2P3hNu", "htmlBody": "<p>PPS I've uploaded all the powerpoint slides for this course to a dropbox folder, and I can send you a dropbox share link if you email me (gfmiller65@gmail.com).&nbsp;</p>", "parentCommentId": null, "user": {"username": "geoffreymiller"}}]