[{"_id": "2KtQABe22uqD4FSKD", "postedAt": "2022-12-16T10:54:30.423Z", "postId": "KDtg6dzjcETnJGaQr", "htmlBody": "<blockquote><p>Ride the current way of AI skepticism by people worried about&nbsp;<a href=\"https://en.wikipedia.org/wiki/Ethics_of_artificial_intelligence#Biases_in_AI_systems\"><u>it being racist</u></a>, or&nbsp;<a href=\"https://www.vice.com/en/article/ake9me/artists-are-revolt-against-ai-art-on-artstation\"><u>being replaced and left unemployed</u></a>. To lobby for significantly more government involvement, to slow down progress (like the FDA in medicine).</p></blockquote><p>&nbsp;</p><p>I agree! In recent days, I've been soundboarding an idea of mine:&nbsp;</p><h1><br><u>Idea: AI Generated Content (AIGC) Policy Consultancy</u></h1><p><u>Current Gaps:</u><br>1. Policy around services provided by AIGC is probably not gonna be good within the next decade, despite the speed with which AI will begin automating tasks and industries. See: social media, crypto policy.<br><br>2. AI Safety community currently struggles with presenting strong, compelling value propositions or near-term inroads into policymaking circles. This is consistent with other x-risk topics. See: climate and pandemic risk.</p><p><br><u>Proposition:</u> EA community gathers law and tech people together to formulate and AIGC policy framework. Will require ~10 tech/law people which is quite feasible as an EA project.</p><h2><br><u>Benefits:</u></h2><p>1. Formulating AIGC policy will establish credibility and political capital to tackle alignment problems</p><p>2. AIGC is the most publicly understandable way to present AI risk to the public, allowing AIS to reach mainstream appeal</p><p>3. Playing into EA’s core competencies of overanalysing problems</p><p>4. Likely high first mover advantage, where if EA can set the tone for AI policy discourse, it will mitigate people believing misconceptions about AI as a new tech, which of course benefits AIS in the long run</p><h3><u>Further Thoughts</u></h3><p>Coming from a climate advocate background, I think this is the least low-probability way for EA to engage the&nbsp;public and policymakers on AIS. It seeks to answer <i>“How to we get politicians to take EA’s AIS stances seriously”</i><br><br>I find that some AIS people I've talked to don't immediately see the value of this idea. However, my context is that having been a climate advocate, I learned of an incredibly long history of scientists' input being ignored simply because the public and policymakers did not prioritise the value of climate risk work.<br><br>It was ultimately engaging, predominantly youth, advocacy that mobilised institutional resources and demand to the level required. I highly suspect this will hold true for AI Safety, and I hope this time, the x-risk community doesn't make the same mistake of undervaluing external support. So this plan is meant to&nbsp;provide a value proposition for AI Safety that non-AIS people understand better.<br><br>So far, I haven't been able to make much progress on this idea. Problem being that I am neither in the law field nor technical AIS field (something I hope to work on next year), so if it happens, I essentially need to find someone else to spearhead it.<br><br>Anyway, I posted this idea publicly because I've procrastinating on developing it for ~1 week, so I figured it was better to send it out into the ether and see if anyone feels inspired, rather than just let it sit in my Drafts. Do reach out if you or anyone you know might be interested!</p>", "parentCommentId": null, "user": {"username": "Minh Nguyen"}}, {"_id": "ZTMXgqvoLDWkAfAbM", "postedAt": "2022-12-16T11:01:18.172Z", "postId": "KDtg6dzjcETnJGaQr", "htmlBody": "<p>Hoo boy, I think we can get a paradox out of this:</p><p>Givewell is looking at the loss of potential life for the people that currently exist. Save 30000 lives that live for an average of 50 years each, and that’s 30000*50 =1.5 million years worth of potential lives saved.&nbsp;</p><p>Suppose the population stayed constant at 10^10 people forever, with average 50 years left.&nbsp;</p><p>In the event of a human extinction, the number of potential life years lost if the apocalypse happened today would be 50*10^10.&nbsp;</p><p>Now what happens if we survive another hundred years, and the extinction happens then?&nbsp;</p><p>Well, there are still 10^10 people averaging 50 years left, so the number of potential life years lost as a result of the apocalypse is… 50*10^10. &nbsp;</p><p>So it seems like if you go by the givewell calculations, delaying the apocalypse makes no difference at all! In fact, if the population were to increase, then the amount of potential life lost in the extinction would be greater, so arguably delaying would make it <i>worse</i>. &nbsp;</p>", "parentCommentId": null, "user": {"username": "titotal"}}, {"_id": "Dz3kbsTArTvHMG8Ai", "postedAt": "2022-12-16T11:02:24.670Z", "postId": "KDtg6dzjcETnJGaQr", "htmlBody": "<p>Hoo boy, I think we can get a paradox out of this:</p><p>Givewell is looking at the loss of potential life for the people that currently exist. Save 30000 lives that live for an average of 50 years each, and that’s 30000*50 =1.5 million years worth of potential lives saved.&nbsp;</p><p>Suppose the population stayed constant at 10^10 people forever, with average 50 years left.&nbsp;</p><p>In the event of a human extinction, the number of potential life years lost if the apocalypse happened today would be 50*10^10.&nbsp;</p><p>Now what happens if we survive another hundred years, and the extinction happens then?&nbsp;</p><p>Well, there are still 10^10 people averaging 50 years left, so the number of potential life years lost as a result of the apocalypse is… 50*10^10. &nbsp;</p><p>So it seems like if you go by the givewell calculations, delaying the apocalypse makes no difference at all! In fact, if the population were to increase, then the amount of potential life lost in the extinction would be greater, so arguably delaying would make it <i>worse</i>. &nbsp;</p>", "parentCommentId": null, "user": {"username": "titotal"}}, {"_id": "bqARvc4CLsKnyWZAY", "postedAt": "2022-12-16T11:49:59.224Z", "postId": "KDtg6dzjcETnJGaQr", "htmlBody": "<p>[Edit: this post has been updated, and this comment applies substantially less now. See this thread for details. ]</p><p>As a longtermist, I think this post is bad and harmful. I strongly dislike this framing, and I think it's very unhealthy for an altruistic community.&nbsp;</p><p>First, I think the fermi estimate here is &nbsp;not good, principally for a lack of any discounting and for failing to try to &nbsp;incorporate the objections raised in the post into the actual estimate. &nbsp;But'll leave the specifics of the back-of-the envelope &nbsp;estimate aside in favor of putting emphasis on what think is the most harmful thing.&nbsp;</p><p>Pitting X-risks against other ways of making the world better (1) is extremely unlikely to convince anyone to work on x-risk who isn't already doing so, (2) hedges on very unlikely risky scenarios without incorporating principles involving discounting, epistemic humility, or moral uncertainty, (3) &nbsp;is certain to alienate people and &nbsp;is the kind of thing that makes enemies--not friends--which reduces the credibility and sociopolitical capital of longtermism, and (4) is very disrespectful toward real people in the real world who suffer from real, large problems that GiveWell charities try to address.&nbsp;</p><p>I would encourage deleting this post.&nbsp;</p>", "parentCommentId": null, "user": null}, {"_id": "kN6d6GPvwS86EiHNx", "postedAt": "2022-12-16T12:06:47.755Z", "postId": "KDtg6dzjcETnJGaQr", "htmlBody": "<p>I think it's good to make object-level criticisms of posts, but I think it's important that we encourage rather than discourage posts that make a genuine attempt to explore unusual ideas about what we should prioritise, even if they seem badly wrong to you. That's because people can make up their own minds about the ideas in a post, and because some of these posts that you're suggesting be deleted might be importantly right.</p><p>In other words, having a community that encourages debate about the important questions seems more important to me than one that shuts down posts that seem \"harmful\" to the cause.</p>", "parentCommentId": "bqARvc4CLsKnyWZAY", "user": {"username": "Isaac_Dunn"}}, {"_id": "bmcHAiG5NQvpZ79Em", "postedAt": "2022-12-16T12:06:56.974Z", "postId": "KDtg6dzjcETnJGaQr", "htmlBody": "<p>Oh no, I'm sorry if that's the case!</p><p>I'm unsure if deletion is the right response to bad posts (which this one likely is!), instead of explaining why the post is bad so that others can understand that it's wrong (and that the forum thinks is wrong, which I guess could be as important!).<br>For context, I'm not a longtermist. I'm just worried about global catastrophic risks, since a billion people is a lot of people, and the marginal cost of life saved per GiveWell seems relatively high ($10k/life)</p><p>&nbsp;</p><blockquote><p>1) is extremely unlikely to convince anyone to work on x-risk who isn't already doing so</p></blockquote><p>My personal current career trajectory hinges a bit on this :/<br>Like, is it more likely for me to (help) influence AI timelines or billions of capital?</p><blockquote><p>2) hedges on very unlikely risky scenarios without incorporating principles involving discounting, epistemic humility, or moral uncertainty</p></blockquote><p>Is that the same as <i>There's significantly less than a 1% risk from AGI for lives that morally matter</i> (which I agree is my main uncertainty), or is it a different consideration?</p><blockquote><p>3) &nbsp;is certain to alienate people and &nbsp;is the kind of thing that makes enemies--not friends--which reduces the credibility and sociopolitical capital of longtermism</p></blockquote><p>What would make friends and not enemies? In a conflict between e.g. workers/artists and AI companies that want to stay unregulated, can you avoid making enemies while helping one side?</p><blockquote><p>4) is very disrespectful toward real people in the real world who suffer from real, large problems that GiveWell charities try to address.&nbsp;</p></blockquote><p>I am mostly worried about real people in the real world that (maybe) suffer from a real large risk. I think a marginal GiveWell dollar might help us real people less than lowering those risks.</p>", "parentCommentId": "bqARvc4CLsKnyWZAY", "user": {"username": "AnonymousAccount"}}, {"_id": "FFrsuJ8JPxBwisGrG", "postedAt": "2022-12-16T12:25:10.530Z", "postId": "KDtg6dzjcETnJGaQr", "htmlBody": "<blockquote><p>Is that the same as <i>There's significantly less than a 1% risk from AGI for lives that morally matter</i> (which I agree is my main uncertainty), or is it a different consideration?</p></blockquote><p>I believe so. This post is about one day of delayed extinction. Not about preventing it. Not tryna split hairs tho.</p><blockquote><p>What would make friends and not enemies?</p></blockquote><p>Not using x-risks to imply that donating to GiveWell charities is of trivial relative importance. It's easy to talk about the importance of x-risks without making poverty and health charities the direct comparison.&nbsp;</p><blockquote><p>I am mostly worried about real people in the real world that (maybe) suffer from a real large risk.</p></blockquote><p>I still presume you care about people who suffer from systemic issues in the world. This kind of post would not be the kind of thing that would make anyone like this feel respected.&nbsp;</p><hr><p>A case for deletion. Consider a highly-concrete and pretty likely scenario. Emille Torres finds out about this post, tweets about it along with a comment about moral rot in EA, and gets dozens of retweets and a hundred likes. Then Timnut Gebru retweets it along with another highly-negative comment and gets hundreds of retweets and a thousand likes. This post contributes to hundreds or more people more actively disliking EA--especially because it's on the actual EA forum and not a more ignorable comment from someone in a lower profile space.&nbsp;</p><p>I would recommending weighing the possible harms of this post getting tons of bad press against how likely you think that it will positively change anyone's mind or lead to high-quality discussion. My beliefs here are that deleting it might be very positive in EV.&nbsp;</p>", "parentCommentId": "bmcHAiG5NQvpZ79Em", "user": null}, {"_id": "fFEEpR8KAjk5e8P4A", "postedAt": "2022-12-16T12:42:43.556Z", "postId": "KDtg6dzjcETnJGaQr", "htmlBody": "<p>I generally agree, but not in this specific case for two reasons. First, I think there are more thorough, less provocative, strictly better discussions of this kind of thing already. See writing from Beckstead, Bostrom, etc. Second, I think there are specific direct harms this post could have. See my latest reply to the OP on the other branch of this thread.&nbsp;</p>", "parentCommentId": "kN6d6GPvwS86EiHNx", "user": null}, {"_id": "mEL4C5mvbtGsTNzrr", "postedAt": "2022-12-16T12:53:38.971Z", "postId": "KDtg6dzjcETnJGaQr", "htmlBody": "<p>[deleted]</p>", "parentCommentId": null, "user": null}, {"_id": "PbuQrdF5S5jGtwmZi", "postedAt": "2022-12-16T12:56:58.701Z", "postId": "KDtg6dzjcETnJGaQr", "htmlBody": "<blockquote><p>This assumes that there is a 10% chance of extinction via AGI <i>per day</i>. I don't think anyone believes it to be that high; frankly if it ever gets that high we've already lost.</p></blockquote><p><br>I don't think so, I think it assumes a 10% of extinction one time after we get AGI.<br><br>E.g. \"we get AGI in 2050 -&gt; 10B people die (on average) in 2060 with a 10% chance\" vs \"we get AGI in 2050 + 1 day -&gt; 10B people die (on average) in 2060 + 1 day with a 10% chance\"</p>", "parentCommentId": "mEL4C5mvbtGsTNzrr", "user": {"username": "AnonymousAccount"}}, {"_id": "NJiR8bH8i66iHutm3", "postedAt": "2022-12-16T13:02:29.664Z", "postId": "KDtg6dzjcETnJGaQr", "htmlBody": "<p>Do you think it would be possible to edit this post to make it less harmful/bad/wrong, and still allow me to get feedback on what's wrong with my thinking? (I think something's wrong, and posted asking for feedback/thoughts).<br><br>E.g. keeping feedback like <a href=\"https://forum.effectivealtruism.org/posts/KDtg6dzjcETnJGaQr/delaying-agi-by-1-day-might-be-equivalent-to-usd500-000-000?commentId=mEL4C5mvbtGsTNzrr\">this</a></p><p>&nbsp;</p><p>&nbsp;</p><blockquote><p>It's easy to talk about the importance of x-risks without making poverty and health charities the direct comparison.&nbsp;</p></blockquote><p>For me it is the direct comparison that matters though, I need to choose between those two</p><blockquote><p>I believe so.</p></blockquote><p>I don't understand, you believe which one?</p><blockquote><p>I still presume you care about people who suffer from systemic issues in the world. This kind of post would not be the kind of thing that would make anyone like this feel respected.&nbsp;</p></blockquote><p>Does that also &nbsp;apply to any post about e.g. animal welfare and climate change?</p><p>As for damage: maybe I can write more clearly that I'm probably wrong and that I'm a random anonymous account? Would be happy to edit this post!</p>", "parentCommentId": "FFrsuJ8JPxBwisGrG", "user": {"username": "AnonymousAccount"}}, {"_id": "hXx6WrvFffuzvRz2L", "postedAt": "2022-12-16T13:41:42.197Z", "postId": "KDtg6dzjcETnJGaQr", "htmlBody": "<blockquote><p>Does that also &nbsp;apply to any post about e.g. animal welfare and climate change?</p></blockquote><p>This would apply to a post titled \"Reducing carbon emissions by X may be equivalent to 500M in donations to GiveWell charities.\"</p><p>On the question of deleting</p><ul><li>I don't think this post will be particularly good at sparking good conversations.&nbsp;</li><li>I think it would be better to have a different post that makes more effort in the estimation proposed and clearly asks a question in the title.</li><li>Relatedly, I think the large majority of the potential downside of this post comes from the title. Someone like Torres may have no interest in reading the actual post or taking any nuances into account when commenting on it. They likely wouldn't even read anything beyond the title. They'd just do their thing and be a pundity troll, and the title gives exactly the kind of ammunition they want.&nbsp;<br>&nbsp;</li></ul>", "parentCommentId": "NJiR8bH8i66iHutm3", "user": null}, {"_id": "e9fW9iR8TdLFiX73K", "postedAt": "2022-12-16T13:58:29.130Z", "postId": "KDtg6dzjcETnJGaQr", "htmlBody": "<p>Edited the title, do you think this is good enough?</p><p>Could you please point out your estimation? Since at the end of the day we do need to decide what to work on.</p>", "parentCommentId": "hXx6WrvFffuzvRz2L", "user": {"username": "AnonymousAccount"}}, {"_id": "AKakBa4rMc88QFxG4", "postedAt": "2022-12-16T14:16:07.764Z", "postId": "KDtg6dzjcETnJGaQr", "htmlBody": "<p>I believe this is a big improvement.&nbsp;</p><p>I work on AI safety tools. I believe this might be the most important thing for someone like me to do FWIW. I think AI doom is not likely but likely enough to be my personal top priority. &nbsp;But when I give money away I do it to GiveWell charities for reasons involving epistemic humility, moral uncertainty, and my belief in the importance of a balanced set of EA priorities.&nbsp;</p>", "parentCommentId": "e9fW9iR8TdLFiX73K", "user": null}, {"_id": "pWqdu75FDRBK47mif", "postedAt": "2022-12-16T14:19:50.326Z", "postId": "KDtg6dzjcETnJGaQr", "htmlBody": "<p>Thank you for the pushback on the title!</p><p>I wonder what are your thoughts on delaying timelines, instead of working on tooling, but I guess it might hinge on being more longtermist and personal fit.</p>", "parentCommentId": "AKakBa4rMc88QFxG4", "user": {"username": "AnonymousAccount"}}, {"_id": "4MH2wYWzptJEpFtN6", "postedAt": "2022-12-16T14:41:16.342Z", "postId": "KDtg6dzjcETnJGaQr", "htmlBody": "<p>I very badly want to delay timelines, especially because doing so gives us more time to develop responses, governance strategies, and tools to handle rapid changes. I think this is underemphasized. And lately, I have been thinking that the most likely thing that could make me shift my focus is the appeal of work that makes it harder to build risky AI or that improves our ability to respond to or endure threats. This contrasts with my current work which is mostly about making alignment easier. &nbsp;</p>", "parentCommentId": "pWqdu75FDRBK47mif", "user": null}, {"_id": "YpzE45JXnj3YJxAuq", "postedAt": "2022-12-16T15:49:03.713Z", "postId": "KDtg6dzjcETnJGaQr", "htmlBody": "<p>I'm interested in why you don't think AI doom is likely, given a lot of people in the AI safety space at least seem to suggest it's reasonably likely (&gt;10% likelihood in the next 10 or 20 years)</p>\n", "parentCommentId": "AKakBa4rMc88QFxG4", "user": {"username": "Gideon Futerman"}}, {"_id": "qz6HHiq3dsLP5hNDe", "postedAt": "2022-12-16T17:20:41.290Z", "postId": "KDtg6dzjcETnJGaQr", "htmlBody": "<p>My guess is like 5-10%</p>", "parentCommentId": "YpzE45JXnj3YJxAuq", "user": null}, {"_id": "xnyxbwJjfHc4ewzYJ", "postedAt": "2022-12-16T21:24:22.813Z", "postId": "KDtg6dzjcETnJGaQr", "htmlBody": "<p>I liked this post and would like to see more of people thinking for themselves about cause prioritization and doing BOTECs.</p><p>Some scattered thoughts below, also in the spirit of draft amnesty.</p><p>I had a little trouble understanding your calculations/logic, so I'm going to write them out in sentence form: GiveWell's current giving recommendations correspond to spending about $0.50 to save an additional person an additional year of life. &nbsp;A 10% chance of extinction from misaligned AI means that postponing misaligned AI by a year gets us 10%*current population number of person days, or about 10 million. If we take GiveWell's willingness to spend and extrapolate it to the scenario of postponing misaligned AI, we get that GiveWell might be willing to spend $500 million to postpone misaligned AI by a day.&nbsp;</p><p>I think it's important that these are different domains, and the number of people who would be just as happy to see their donation buy a bednet as lobby for tech regulation (assuming similar EV) is unfortunately small. Many donors care about much more than some cause-neutral how-much-good their donation does. e.g., for instance I see to care (I'm confiused) that <i>some</i> of my donations help extremely poor people.</p><p>You point out that maybe regulation doesn't work, but there's the broader problem which is that we don't have shovel ready projects that can turn $500 million into postponing misaligned AI by a day; I suspect there are many interventions which can do this for much cheaper, but they are not interventions which can just absorb money and save lived like many global health charities can (perhaps they need projects to be founded and take years to develop).&nbsp;</p><p>The above problems point to another important idea: The GiveWell bar is able to be where it is because of what projects to improve the world can actually be funded by GiveWell dollars — not because of some fact about the value of postponing a life by a day. You might think about the GiveWell bar as, the cheapest scalable ways to save lives in the global health and development space can provide an additional day of life for $0.50. If you ask individuals in the US how much they would pay to extend their own life or that of a loved one by a day, you will get numbers much higher than this; if you look at spending on healthcare in the developed world my guess is that it is very normal to spend thousands of dollars to postpone a life by a day. GiveWell's bar for funding would be higher if there were other great opportunities for saving lives salably for cheap (at least in global health and development).&nbsp;</p><p>An abstraction I notice I'm using is thinking about $0.50/person/day as the current market price. However, this is not an efficient market, for a number of reasons. This post draws the parallel of \"hey look, at that price we should be willing to spend $0.5b on postponing misaligned AI by a day\". However, if we actually had many opportunities to spend $0.5b on postponing misaligned AI by a day, the funding bar would increase, because there isn't enough money in the cause-neutral altruism bucket.&nbsp;</p><p>Some implications: cause-neutral donors who put above negligible probability on existential risks from AI will probably get much more bang for their buck trying to reduce existential risks or buy time, at least contingent on there being projects that can absorb money in that space. More importantly, those working on reducing AI x-risk have a lot of work to do in terms of closing the cost-effectiveness gap between themselves and global health. By closing the gap I mean getting enough projects to exist in the space such that we can consistently take in more money and turn it into x-risk reduction or buying time.&nbsp;</p><p>If you haven't read <a href=\"https://nickbostrom.com/astronomical/waste\">Astronomical Waste</a>, you might like it.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Aaron_Scher"}}]