[{"_id": "vuDzZRdTNtjP3pBtx", "postedAt": "2021-02-12T12:13:58.134Z", "postId": "KdxGwxwY3t7iw9xjB", "htmlBody": "<p>Personally I agree with the economic forecasts and approximate timelines here, but I haven’t seen a way of reconciling the “accelerating growth” prediction with the efficient market hypothesis.</p>\n<p>Low 30-year government bond rates in the US (and 50- or 100-year rates in some other countries!) imply the market expects low growth over this time horizon, not ever-accelerating economic growth rates.</p>\n<p>If growth goes up and interest rates rise, these are massively overvalued. It’s possible, but, we’d have to tell some some more elaborate stories (AI-led growth is not broad-based? It’s all captured by one firm...? It FOOMs?) if we want to be consistent with EMH.</p>\n", "parentCommentId": null, "user": {"username": "bhalperin"}}, {"_id": "aYCNP5PgDYsZpxsbX", "postedAt": "2021-02-12T17:59:22.351Z", "postId": "KdxGwxwY3t7iw9xjB", "htmlBody": "<p>I I think the market just doesn't put much probability on a crazy AI boom anytime soon. If you expect such a boom then there are plenty of bets you probably want to make. (I am personally short US 30-year debt, though it's a very small part of my AI-boom portfolio.)</p><p>I think it's very hard for the market to get 30-year debt prices right because the time horizons are so long and they depend on super hard empirical questions with ~0 feedback. Prices are also determined by supply and demand across a truly huge number of traders, and making this trade locks up your money forever and can't be leveraged too much. So market forecasts are basically just a reflection of broad intellectual consensus about the future of growth (rather than views of the \"smart money\" or anything), and the mispricing is just a restatement of the fact that AI-boom is a contrarian position.</p>", "parentCommentId": "vuDzZRdTNtjP3pBtx", "user": {"username": "Paul_Christiano"}}, {"_id": "xGFbfmAwqBtXtdFFs", "postedAt": "2021-02-13T00:38:36.193Z", "postId": "KdxGwxwY3t7iw9xjB", "htmlBody": "<p>Agreed re: \"mispricing = restatement that this is a contrarian position\" -- but to push back on your \"lack of feedback\" point:</p><p>If the market can't price 30-year cashflows, it can't price <i>anything</i>, since for any infinitely-lived asset (eg stocks!), most of the present-discounted value of future cash flows is far in the future.&nbsp;</p><p>See eg this <a href=\"https://twitter.com/rkoijen/status/1291478305510694915\">Ralph Koijen thread and linked paper</a>, \"the first 10 years of dividends only make up ~20% of the value of the stock market. 80% is due to value of cash flows beyond 10 years\"</p><p>(I wonder how big EMH proponents like Hanson and Yudkowsky explain the dissonance.)</p>", "parentCommentId": "aYCNP5PgDYsZpxsbX", "user": {"username": "bhalperin"}}, {"_id": "SvrL8QTRb6JHgmSMc", "postedAt": "2021-02-13T02:03:15.499Z", "postId": "KdxGwxwY3t7iw9xjB", "htmlBody": "<blockquote><p>If the market can't price 30-year cashflows, it can't price <i>anything</i>, since for any infinitely-lived asset (eg stocks!), most of the present-discounted value of future cash flows is far in the future.&nbsp;</p></blockquote><p>If an asset pays me far in the future, &nbsp;then long-term interest rates are one factor affecting its price. But it seems to me that in most cases that factor still explains a minority of variation in prices (and because it's a slowly-varying factor it's quite hard to make money by predicting it).</p><p>For example, there is a ton of uncertainty about how much money any given company is going to make next year. We get frequent feedback signals about those predictions, and people who win bets on them immediately get returns that let them show how good they are and invest more, and so that's the kind of case where I'd be more scared of outpredicting the market.</p><p>So I guess that's saying that I expect the relative prices of stocks to be much more efficient than the absolute level.</p><blockquote><p>See eg this <a href=\"https://twitter.com/rkoijen/status/1291478305510694915\">Ralph Koijen thread and linked paper</a>, \"the first 10 years of dividends only make up ~20% of the value of the stock market. 80% is due to value of cash flows beyond 10 years\"</p></blockquote><p>Haven't looked at the claim but it looks kind of misleading. Dividend yield for SPY is &lt;2% which I guess is what they are talking about? But buyback yield is a further 3%, and with a 5% yield you're getting 40% of the value in the first 10 years, which sounds more like it. So that would mean that you've gotten half of the value within 13.5 years instead of 31 years.</p><p>Technically the stock is still valued based on the future dividends, and a buyback is just decreasing outstanding shares and so increasing earnings per share. But for the purpose of pricing the stock it should make no difference whether earnings are distributed as dividends or buybacks, so the fact that buybacks push cashflows to the future can't possibly affect the difficulty of pricing stocks.</p><p>Put a different way, the value of a buyback to investors doesn't depend on the actual size of future cashflows, nor on the discount rate. Those are both cancelled out because they are factored into the price at which the company is able to buy back its shares. (E.g. if PepsiCo was making all of its earnings in the next 5 years, and ploughing them into buybacks, after which they made a steady stream of not-much-money, then PepsiCo prices would still be equal to the NPV of dividends, but the current PepsiCo price would just be an estimate of earnings over the next 5 years and would have almost no relationship to long-term interest rates.)</p><p>Even if this is right it doesn't affect your overall point too much though, since 10-20 year time horizons are practically as bad as 30-60 year time horizons.</p>", "parentCommentId": "xGFbfmAwqBtXtdFFs", "user": {"username": "Paul_Christiano"}}, {"_id": "QJXrEdfj6mPddFnXd", "postedAt": "2023-01-10T18:02:13.004Z", "postId": "KdxGwxwY3t7iw9xjB", "htmlBody": "<p>FWIW -- eventually wrote up some more thoughts on this <a href=\"https://forum.effectivealtruism.org/posts/8c7LycgtkypkgYjZx/agi-and-the-emh-markets-are-not-expecting-aligned-or\">here</a>.</p>", "parentCommentId": "SvrL8QTRb6JHgmSMc", "user": {"username": "bhalperin"}}]