[{"_id": "8vxnLd45zRTMbyCbo", "postedAt": "2023-05-15T16:43:35.036Z", "postId": "KGqAvdxN6KypkmdPb", "htmlBody": "<p>Wow. This is great.</p>\n<p>I've been looking for a write-up like this for a long time. And thanks for formatting it so well (sections, subsections, effect sizes, hyperlinks, 250+ references).</p>\n<p>It's a bit depressing that so many of the effect sizes for interventions with a strong base of evidence are relatively small. I guess there's part of me that wants a silver bullet, but I know well enough that no such thing exists — at least not broadly across the population. Nonetheless, I'm guessing people could get a lot out of experimenting with and implementing many of these.</p>\n<p>I'm looking forward to digging more into this!</p>\n", "parentCommentId": null, "user": {"username": "Tyler Johnston"}}, {"_id": "DGFxwPAnAD6ZZCZd8", "postedAt": "2023-05-17T12:57:41.838Z", "postId": "KGqAvdxN6KypkmdPb", "htmlBody": "<p>This is fantastic! Thank you for writing it up!! One small point - would it be worth pulling up the broad advice into the summary? You could come away from reading this downgrading the importance of positive relationships and a general healthy lifestyle</p>", "parentCommentId": null, "user": {"username": "Gemma Paterson"}}, {"_id": "AJuBbJ6wiCNfHTbQ8", "postedAt": "2023-05-18T14:07:54.406Z", "postId": "KGqAvdxN6KypkmdPb", "htmlBody": "<p>Awesome work. I'm hoping this approximates the best one could hope for, but I also speculate there are limitations impossible to get around: (a) appropriateness of intervention - how do I know if e.g. ACT makes sense for <i>me</i>? Are there indicators, or triggers, likely to make it useful? The more particular the intervention the more pertinent this seems (in contrast with e.g. 'exercise'), and (b) the typical psychology study may be a pretty different environment from some ideal case where someone agentically, systematically tries lots of things. To address both of these items, I think one would have to become <i>more educated</i> on these 'interventions' in order to think through them and make better decisions. I notice that Ngo's self-paced AGI safety fundamentals curriculum sorta does what I have in mind for AI safety--curated readings, ideally paired with discussion, sustained over several weeks to give one a sort of baseline for sense-making. Perhaps Effective Self-Help could look into structuring a similar curriculum in the future.</p>", "parentCommentId": null, "user": {"username": "adam.isom"}}, {"_id": "Rib9b7YYo9tmGKqa8", "postedAt": "2023-05-21T21:44:14.038Z", "postId": "KGqAvdxN6KypkmdPb", "htmlBody": "<p>Thanks Gemma! I’ve slightly rephrased and pulled up the bullet point on the broad recommendations to make it clear that I also think they’re central. :)</p>", "parentCommentId": "DGFxwPAnAD6ZZCZd8", "user": {"username": "Raphael_Pesah"}}, {"_id": "3DJJAAfchPaKDjaok", "postedAt": "2023-05-21T21:53:51.089Z", "postId": "KGqAvdxN6KypkmdPb", "htmlBody": "<p>Thank you!&nbsp;<br>I agree your points are relevant concerns. :)<br><br>I think David Althaus addresses them well in&nbsp;<a href=\"https://forum.effectivealtruism.org/posts/w9hKmNvhEnHo2wcr7/many-therapy-schools-work-with-inner-multiplicity-not-just?commentId=tRsCrXAC7cpkXdQCA\"><u>his comment</u></a> from another Forum post that I cite in the section <a href=\"https://forum.effectivealtruism.org/posts/KGqAvdxN6KypkmdPb/effective-self-help-a-guide-to-improving-your-subjective#Suggestions_on_how_to_implement_our_advice_on_interventions\">Suggestions on how to implement our advice on interventions</a>.<br><br>I intentionally tried to include details on interventions, when I found them, such that one could get an idea of whether the intervention is suited given one’s personal situation, characteristics or preferences.<br><br>But indeed, methodically trying out the recommendations seems like quite a good way to get that knowledge, as I write in the paragraph “So we suggest you adopt an open-minded and curious approach…” from the same section. The suggestion I give there to first try a&nbsp;<a href=\"https://forum.effectivealtruism.org/posts/KGqAvdxN6KypkmdPb/effective-self-help-a-guide-to-improving-your-subjective#Multi_component_Positive_Psychology_Interventions__MPPIs_\"><u>Multi-component Positive Psychology intervention</u></a> is inspired by this consideration, and for instance the first book and first online program I recommend for this intervention take this approach (i.e. a multi-week and relatively methodical exploration of some of the main happiness-enhancing strategies).</p>", "parentCommentId": "AJuBbJ6wiCNfHTbQ8", "user": {"username": "Raphael_Pesah"}}, {"_id": "xzkkAbhurZhYuTkaR", "postedAt": "2023-06-01T21:17:32.280Z", "postId": "KGqAvdxN6KypkmdPb", "htmlBody": "<p>Thank you for this!</p><p>But, uh, Best Possible Self sounds awful. Surely you're just setting yourself up for disappointment later on? And from a quick look, it looks like the top study hasn't measured or even considered this?</p><p>Just going by anecdote/common-sense, sure, I'd expect an exercise like that to cheer me up. And I think there's something to be said for generally feeling mildly optimistic about life - which I think is compatible with acting <i>realistic</i> on important decisions - and for really trying to stay optimistic in a moment of crisis. But spending hours visualizing this perfect future life sounds like a terrible idea.</p><p>YMMV but I'm not even sure I'd put this on the list, let alone at the top.</p><p>(But genuinely, thank you for this 🙏 Sorry to be one of those commenters who only has one interesting thing to say about your post and it's kinda negative.)</p>", "parentCommentId": null, "user": null}, {"_id": "YMyuN8CHmifsaAjen", "postedAt": "2023-07-27T14:22:50.081Z", "postId": "KGqAvdxN6KypkmdPb", "htmlBody": "<p>It's an interesting point, but they're just reviewing the evidence...&nbsp;</p><p>A better exercise to not fall into self-deception is 'mental contrasting', in which you first think about achieving your goals, and then about the obstacles that stand in your way and how to overcome them. It might also help in goal achievement, especially in combination with a technique called 'implementation intention'.<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnref1ns9oa9tmg\"><sup><a href=\"#fn1ns9oa9tmg\">[1]</a></sup></span></p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fn1ns9oa9tmg\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnref1ns9oa9tmg\">^</a></strong></sup></span><div class=\"footnote-content\"><p>Wang G, Wang Y and Gai X (2021) A Meta-Analysis of the Effects of Mental Contrasting With Implementation Intentions on Goal Attainment. <i>Front. Psychol.</i> 12:565202. doi: 10.3389/fpsyg.2021.565202</p></div></li></ol>", "parentCommentId": "xzkkAbhurZhYuTkaR", "user": {"username": "alamo 2914"}}]