[{"_id": "4KwSmzFkTnYvDAkQs", "postedAt": "2018-05-23T14:49:55.455Z", "postId": "KhwiyLpJmW6fcAuuo", "htmlBody": "<p>I admire many things about this story, not least being your willingness to try &amp; fail, and your brutal honesty in sharing what lessons you learned (or didn't learn).</p>\n<p>There are many bad things about silicon valley, but one thing I think it gets right is giving partial credit for failed moonshots. Thank you for Really Trying to make this happen.</p>\n", "parentCommentId": null, "user": {"username": "MikeJohnson"}}, {"_id": "mFpSaqQCaTMtgv8Rs", "postedAt": "2018-05-23T21:46:58.347Z", "postId": "KhwiyLpJmW6fcAuuo", "htmlBody": "<p>Thanks for writing this up! I've forwarded it to a friend who was interested in the happiness app space a while back.</p>\n<p>I would add to the advice, from my experience, pick something not too far out of people's comfort zones for a startup or research idea. There seems to be a horizon beyond which you don't get feedback or help at all.</p>\n", "parentCommentId": null, "user": {"username": "WillPearson"}}, {"_id": "i7KYGdSXabb3KwGue", "postedAt": "2018-05-23T22:07:06.776Z", "postId": "KhwiyLpJmW6fcAuuo", "htmlBody": "<p>Brutal honesty, the most useful and most painful start up lesson...</p>\n<p>'Moonshots', great expression I'd not used! I edited the text to included that phrase, hope you don't mind the thievery.</p>\n", "parentCommentId": "4KwSmzFkTnYvDAkQs", "user": {"username": "MichaelPlant"}}, {"_id": "oy2efq4rHGpuudXf6", "postedAt": "2018-05-23T22:27:28.725Z", "postId": "KhwiyLpJmW6fcAuuo", "htmlBody": "<p>This pattern of slow decay with punctuated bursts of enthusiasm is pretty typical of how every failed project I've been on has gone. Thanks for a very useful case study.</p>\n", "parentCommentId": null, "user": {"username": "Peter_Hurford"}}, {"_id": "dh5MrvQn7KCCRX83H", "postedAt": "2018-05-24T03:06:35.470Z", "postId": "KhwiyLpJmW6fcAuuo", "htmlBody": "<p>Thank you for sharing! This type of critical feedback is much needed in the EA community (for many of the reasons you stated). </p>\n<p>&quot;A potential danger with an EA start-up is that you might, as I did, find a hypothetical solution and try to retro-fit a business case.&quot; This is a really important takeaway from your conclusion, and I'm glad to hear it mentioned. A good piece of business/entrepreneurship advice I'd heard thrown around in startup circles before is to fall in love with the problem, not the solution. Keeping a constant internal check to evaluate how a venture, whether it be a new startup or a non-profit working on a global health intervention, is tackling the problem as effectively as possible ensures that venture is on the right track and producing the right solutions. Optimizing for the solution itself can veer those ventures off course. </p>\n<p>Finally, I'd like to point out that you did find success here, even if the mobile application itself was a failure. By starting work on the PhD and the app at the same time, you gave yourself much more career capital than if you'd worked on one alone. In this case, the capital was not transferrable across both sides, but there's an alternate universe that exists where the work on your app led to a industry career. You kept your options open, and that's led you to a place where you're more confident in the career you've chosen. If other EAs find themselves in a similar opportunity (i.e. working on a side business and academia at the same time), it's probably a good thing to gain experience in both for awhile. The incremental amount of improvements each individual project would see if you went at it full time (i.e. one more published research paper, a fully functioning machine learning feature) likely do not matter in the long term. If you take value from the experience, and not the outcome, I think there are many positives to be had from this kind of work. </p>\n", "parentCommentId": null, "user": {"username": "amb"}}, {"_id": "Gp3QvXzJxB27osSYB", "postedAt": "2018-05-24T11:23:11.749Z", "postId": "KhwiyLpJmW6fcAuuo", "htmlBody": "<blockquote>\n<p>you gave yourself much more career capital than if you'd worked on one alone</p>\n</blockquote>\n<p>I don't think this is true, and that's my main takeaway. It's true I gave myself two opportunities to acquire career capital - the PhD and the startup - but the latter never turned into actual career capital. In expectation, the start up looked promising (to my, possibly deluded eyes) but it turned out, in fact, to be much use to me. When i started it I thought &quot;if Hippo works I'll be a tech billionaire. If it doesn't work, at least I'll have learnt loads&quot; but in reality Hippo didn't work and I didn't learn much. That's the, somewhat subtle, cautionary tale.</p>\n<blockquote>\n<p>The incremental amount of improvements each individual project would see if you went at it full time (i.e. one more published research paper, a fully functioning machine learning feature) likely do not matter in the long term.</p>\n</blockquote>\n<p>I want to push back on this too. I can see how much more progress I'm making on philosophy now I'm just focused on that. I basically scraped through my first year review. One important thought is that you only get really good at X by focusing on X (e.g. see Cal Newport's Deep Work) and that most work is done by the top performers, e.g. 20% of academics get 80% of the citations, etc. Hence if you're not laser focused you're ruling yourself out of the top category where the real change happens. Again, I'm making a nuanced point: I'm not saying there is no value to exploration, but I am saying there is value to focus. I don't think I'd adequately recognised the trade-off. Would I have changed my choices? Not obviously, but this might be a useful lesson which could change what someone in a different position would do. Hence I'm sharing and hoping this is useful for someone else!</p>\n", "parentCommentId": "dh5MrvQn7KCCRX83H", "user": {"username": "MichaelPlant"}}, {"_id": "Cn2L9GL6gXiFxDyYt", "postedAt": "2018-05-24T17:46:02.461Z", "postId": "KhwiyLpJmW6fcAuuo", "htmlBody": "<p>Really interesting. I appreciate you sharing this and your attitude toward this. Good luck with your career in philosophy - epistemic honesty will take you far. </p>\n<p>You might consider cross-posting this on a site like Medium to reach a larger audience. </p>\n", "parentCommentId": null, "user": {"username": "Lila"}}, {"_id": "HjZqsEbkDESm8auqt", "postedAt": "2018-05-24T18:42:07.418Z", "postId": "KhwiyLpJmW6fcAuuo", "htmlBody": "<p>&quot;I’d compiled a list of 40-odd evidence-based activities and re-thinking exercises, i.e. behavioural and cognitive interventions, that I’d come across during my research&quot;</p>\n<p>Have you made this list public anywhere? I'd be interested in seeing the list (and I assume others would be too).</p>\n", "parentCommentId": null, "user": {"username": "Daniel_Eth"}}, {"_id": "RJfish2okfFoqJj9C", "postedAt": "2018-05-24T22:03:51.893Z", "postId": "KhwiyLpJmW6fcAuuo", "htmlBody": "<p>Interesting thought puting it on medium. Someone put it on Hacker News <a href=\"https://news.ycombinator.com/item?id=17133203\">here</a> were people were, um, not terribly nice about it, so I had some reservations about that. </p>\n", "parentCommentId": "Cn2L9GL6gXiFxDyYt", "user": {"username": "MichaelPlant"}}, {"_id": "eD76Cubng8nbYCjYk", "postedAt": "2018-05-24T22:18:05.172Z", "postId": "KhwiyLpJmW6fcAuuo", "htmlBody": "<p>Ah, I wondered if anyone was going to spot this Easter egg! Yeah, the list isn't public. This might sound outrageously petty, but having spend so long compiling it, I feel strange about giving it away or making it freely available for other people to copy. </p>\n<p>I've trying to work out what to do with it and the rest of the algorithm I designed. If I wasn't so un-enthused about start ups I'd want to build something that just randomly gave you one of the suggestions (the suggestions are just text) as that seems to be the easiest version to do. Maybe that will happen at some point. Honestly I'm not sure what to do. </p>\n", "parentCommentId": "HjZqsEbkDESm8auqt", "user": {"username": "MichaelPlant"}}, {"_id": "vnTwDJkLGan59faxR", "postedAt": "2018-05-25T01:42:19.735Z", "postId": "KhwiyLpJmW6fcAuuo", "htmlBody": "<p>Maybe turn it into a quick self-published book or something?</p>\n", "parentCommentId": "eD76Cubng8nbYCjYk", "user": {"username": "Peter_Hurford"}}, {"_id": "TYDtcbHCsZWqQG3kv", "postedAt": "2018-05-25T03:47:13.787Z", "postId": "KhwiyLpJmW6fcAuuo", "htmlBody": "<p>Have you given any consideration to open sourcing what you do have?</p>\n", "parentCommentId": "eD76Cubng8nbYCjYk", "user": {"username": "Nicholas_G"}}, {"_id": "pF4igEm2zu79eSRTh", "postedAt": "2018-05-25T10:13:54.915Z", "postId": "KhwiyLpJmW6fcAuuo", "htmlBody": "<p>If you want to make something to randomise the text suggestions, you might be able to do it pretty quickly and easily with <a href=\"https://www.guidedtrack.com/\">Guided Track</a>. \nPersonally, I think I would find it more helpful looking at the whole list than being given a random suggestion from it. If you wanted to give people that option without making it publicly available for free, you could put the list on the private and unsearchable Facebook group EA self help, with a request not to share.</p>\n", "parentCommentId": "eD76Cubng8nbYCjYk", "user": {"username": "Michelle_Hutchinson"}}, {"_id": "xYPRfKkLYCChp6RP3", "postedAt": "2018-05-25T12:26:27.984Z", "postId": "KhwiyLpJmW6fcAuuo", "htmlBody": "<p>Can you elaborate? I'm not really sure what you have in mind. 'Quick self-published book' sounds like an oxymoron. I'd like to publish a book on happiness at some point, but would hope for it not to be self-published.</p>\n", "parentCommentId": "vnTwDJkLGan59faxR", "user": {"username": "MichaelPlant"}}, {"_id": "bSaXbmC9rSDBTB2bC", "postedAt": "2018-05-25T12:29:20.359Z", "postId": "KhwiyLpJmW6fcAuuo", "htmlBody": "<blockquote>\n<p>you might be able to do it pretty quickly and easily with Guided Track</p>\n</blockquote>\n<p>Interesting. Will think about this. Not sure I should prioritise this pre-thesis submission. The reason I wrote the post-mortem was so I could move on from Hippo.</p>\n<blockquote>\n<p>If you wanted to give people that option without making it publicly available for free, you could put the list on the private and unsearchable Facebook group EA self help, with a request not to share.</p>\n</blockquote>\n<p>Also interesting. I might be too paranoid/precious to do this, but will think about it. </p>\n", "parentCommentId": "pF4igEm2zu79eSRTh", "user": {"username": "MichaelPlant"}}, {"_id": "ifwide6GP2oh52vXt", "postedAt": "2018-05-25T12:31:48.733Z", "postId": "KhwiyLpJmW6fcAuuo", "htmlBody": "<p>Can you explain how I might do that? You can just provide a link if it's easier. The source code for the current app is held by David, my co-founder, who seems to have dropped off the face of the Earth (at least with regards to my emails to him). The list of happiness-suggestions is just in a spreadsheet. </p>\n", "parentCommentId": "TYDtcbHCsZWqQG3kv", "user": {"username": "MichaelPlant"}}, {"_id": "FfaAN8PB68ApN6uit", "postedAt": "2018-05-25T14:12:28.086Z", "postId": "KhwiyLpJmW6fcAuuo", "htmlBody": "<p>I don't think you should update too much on people being unkind on the internet :)</p>\n", "parentCommentId": "RJfish2okfFoqJj9C", "user": {"username": "BenMillwood"}}, {"_id": "Ehm498SgSqifraGhP", "postedAt": "2018-05-25T14:55:21.722Z", "postId": "KhwiyLpJmW6fcAuuo", "htmlBody": "<p>Basically, you can sell an e-book for a small amount, like $0-5. The e-book is way more detailed than a typical blog post, but is way less detailed than a full book you'd buy for ~$30 at your local bookstore. You get a small amount of money and can also collect emails and use them to build a list for further marketing. This is a pretty common thing a lot of online entrepreneurs seem to do.</p>\n", "parentCommentId": "xYPRfKkLYCChp6RP3", "user": {"username": "Peter_Hurford"}}, {"_id": "wfBGivnrjamowTRYX", "postedAt": "2018-05-25T17:59:23.684Z", "postId": "KhwiyLpJmW6fcAuuo", "htmlBody": "<p>1)Thanks for writing this, it’s a very helpful case study for the community.</p>\n<p>2)You absolutely earned career capital and I 100% disagree with your claim that you “walk away with no cool story, no CV points.”  Let’s say you wanted to earn to give (because I can speak to that from experience). I’ve screened thousands of resumes and conducted hundreds of interviews for highly competitive finance jobs (consulting is similar too).  Most of the resumes look very similar, and there are likely more philosophy and other humanities PhDs from great schools than you’d expect.  I’ve heard hundreds of people tell me about their investment banking internships, which is as excruciating as it sounds.  People who screen resumes and conduct interviews are <em>desperate</em> to talk about something different, and Hippo is a perfect example.  So you do have CV points that will help get you in the door.  </p>\n<p>And you have a cool story too.  You’ve reflected a lot, and learned a lot about your interests, strengths, and weaknesses.  That is valuable to you, and to prospective employers.  You’ve also taken the time to share it so others can learn, which speaks to your character. You just need to learn how to frame your story right (let me know if you want to have a quick chat about how to frame this experience in a job interview). </p>\n<p>3) I’ve heard a lot of stories about various “EA apps”. A lot of them have had significant resources invested in them. And the vast majority never actually get finished, let alone widely used. My suspicion is that your experience is pretty typical. So folks with plans for an EA app may way to think about pooling resources and/or there may an opportunity to have a repository where failed EA apps can share experiences, code, etc. so that future efforts aren't starting from scratch.</p>\n", "parentCommentId": null, "user": {"username": "Jon_Behar"}}, {"_id": "nY9i5KaxbrKMtk79c", "postedAt": "2018-05-25T18:57:12.640Z", "postId": "KhwiyLpJmW6fcAuuo", "htmlBody": "<p>If you're short on time, you might be able to have someone ghostwrite it for a lump sum or co-write it with you for a share of the profit. </p>\n", "parentCommentId": "Ehm498SgSqifraGhP", "user": {"username": "Khorton"}}, {"_id": "LkcuqrJvvjrsLLxxc", "postedAt": "2018-05-26T04:10:22.440Z", "postId": "KhwiyLpJmW6fcAuuo", "htmlBody": "<blockquote>\n<p>We went back to them apologetically telling them “hey, we’ve built something” but they never replied. Too slow, clearly.</p>\n</blockquote>\n<p>Companies drop the ball on all kinds of stuff all the time.  With MealSquares, we've observed that it's difficult to get companies to reply to email inquiries about buying their products!  See <a href=\"https://pmarchive.com/guide_to_startups_part5.html\">The Moby Dick theory of big companies</a>.  There's an entire science to selling to big companies which I don't know much about.  <a href=\"https://smile.amazon.com/SPIN-Selling-Neil-Rackham/dp/0070511136?sa-no-redirect=1\">This book</a> might be a good place to start.  Often in sales you talk about a sales funnel with leads, prospects, etc.--you try to gather as many leads as possible and then minimize the amount of dropoff at each stage (not 100% sure I'm using the correct terminology).</p>\n<blockquote>\n<p>Hardcore techies will probably be thinking I should have just dropped the PhD.</p>\n</blockquote>\n<p>My hardcore techie take on your post is: Now you know why Silicon Valley is obnoxiously elitist when it comes to hiring software developers :)  I wouldn't have told you to drop the PhD; I would have told you to start programming as a hobby in your spare time, and if you were having fun &amp; it seemed like something you were good at it, perhaps start a company (or maybe get a job as a developer for a while first--nothing like getting paid to level up your skills).  As a nontechnical person, you were lucky to get technical people to work with you on a project for free, and you were taking a gamble on their skills and commitment.  It's not at all surprising that the gamble didn't pay off.</p>\n<p>Ending with a whimper not a bang seems to be a common outcome when I talk to other people who have started companies.  Sometimes I hear about someone's project and I'm like &quot;wow that sounds really exciting&quot; and they're like &quot;yeah but I've been working on it so long that it's no longer exciting to me&quot;.  (Actually, that's about how I feel about your project too--it sounds like a good idea, although I'm not sure it would have been big outside of the quantified self market.)  So it might be worthwhile to figure out exactly when it is/isn't acceptable to quit in advance before you start a new project.  You want a way to differentiate temporary demoralization that should be pushed through from indicators that the project is legitimately not worth pursuing.</p>\n", "parentCommentId": null, "user": {"username": "John_Maxwell_IV"}}, {"_id": "SjA9rx29bPB6pCny8", "postedAt": "2018-05-27T15:42:39.380Z", "postId": "KhwiyLpJmW6fcAuuo", "htmlBody": "<p>It's a good story, thanks!</p>\n<p>Some thoughts, in case other effective altruists, want to try something similar.</p>\n<p>If you are more interested in changing the world than becoming a tech startup entrepreneur, it make make sense to partner up with a company doing something similar, and just offer them the idea (and expertise). \nIn this case a reasonable fit could be e.g. the team of developers behind Dailyio, or behind Sleep as an Android, Twilight, Mindroid, etc. Their apps seem to be some of the more useful happiness interventions on Android Market, have millions of downloads, and plausibly big part of their users are the sample people who would be interested in your app.</p>\n", "parentCommentId": null, "user": {"username": "Jan_Kulveit"}}, {"_id": "2MgzgdSyQShubZrDZ", "postedAt": "2018-05-29T11:38:04.656Z", "postId": "KhwiyLpJmW6fcAuuo", "htmlBody": "<p>Hello Jon</p>\n<blockquote>\n<p>Let’s say you wanted to earn to give</p>\n</blockquote>\n<p>I agree, if I wanted to do that, my start up failure would be interesting. As it is, it's probably of very limited use. My appeal is to get people to consider what they would do if their start up failed and how useful that would be for their other line of work. Entrepreneurial experience is of basically no use in academia, as far as I can tell.</p>\n", "parentCommentId": "wfBGivnrjamowTRYX", "user": {"username": "MichaelPlant"}}, {"_id": "Dzg9QvAK49q64ihgP", "postedAt": "2018-05-29T11:49:18.693Z", "postId": "KhwiyLpJmW6fcAuuo", "htmlBody": "<blockquote>\n<p>it make make sense to partner up with a company doing something similar, and just offer them the idea (and expertise</p>\n</blockquote>\n<p>FWIW, I considered this and it didn't seem like a good idea. If I'd walked over and said &quot;hey, here are some ideas, take them for free&quot; I doubt they'd have taken them seriously and, if they had, I would have had no control over what they'd done with the ideas or their product and wouldn't have made any money if they'd be successful. </p>\n<p>It might work if they'd given me equity in their company in exchange, but it would be crazy, I stress, for a company to hand over equity to a stranger on the vague promise of some good ideas!</p>\n<p>I could have offered myself to those other companies as a consultant, but I doubt they'd be interested either (&quot;um, who are you?&quot;). </p>\n<p>What might work would be to build my own app, get a bunch of users, then try to partner with other people on that basis. That strikes me as maybe useful and is something i would have considered had we succeeded.</p>\n", "parentCommentId": "SjA9rx29bPB6pCny8", "user": {"username": "MichaelPlant"}}, {"_id": "ntZqfd4nNBzeH7Xmc", "postedAt": "2018-05-30T15:20:05.079Z", "postId": "KhwiyLpJmW6fcAuuo", "htmlBody": "<p>Having the story to tell might not serve you that well if you stay in academia (though increased self-knowledge should help quite a bit). But I'd generalize my previous comments to say that you've picked up meaningful CV/interview capital if at any point in your career you end up leaving academia.  </p>\n", "parentCommentId": "2MgzgdSyQShubZrDZ", "user": {"username": "Jon_Behar"}}, {"_id": "dkQzmNnHQo25XjW27", "postedAt": "2018-06-04T20:28:47.059Z", "postId": "KhwiyLpJmW6fcAuuo", "htmlBody": "<p>If your goal is to make the world a better place, just making the list available seems like the most Effective and Altruistic way of doing that, no? Software developers tend to be way too afraid somebody will &quot;steal their ideas&quot; as the best ideas are HARD to popularize. Nobody but you sees as much value in YOUR ideas as they do in their OWN ideas. In practice, good ideas are cheap; what matters most is following through with implementation (and being lucky and having good timing...)</p>\n<p>Keeping your ideas secret might prevent other people from stealing them but also prevents other people from IMPROVING them. Or sometimes even HEARING ABOUT them.</p>\n", "parentCommentId": "eD76Cubng8nbYCjYk", "user": {"username": "glenra"}}, {"_id": "T4hdhqFkXwLqWMDAY", "postedAt": "2018-06-06T21:46:43.436Z", "postId": "KhwiyLpJmW6fcAuuo", "htmlBody": "<p>You'd make a repository on e.g. <a href=\"http://github.com\">GitHub</a> and upload the code there. Then other people can see it and suggest changes, or can fork (make a copy of) the repository and start their own thing based off it.</p>\n", "parentCommentId": "ifwide6GP2oh52vXt", "user": {"username": "HenryStanley"}}, {"_id": "69SH9pEm7Sza6qzPx", "postedAt": "2018-06-11T14:12:52.089Z", "postId": "KhwiyLpJmW6fcAuuo", "htmlBody": "<p>Thank you for this data point!</p>\n<blockquote>\n<p>I’m glad to see there are three other mental health apps being created by EAs - Mind Ease (Peter Brietbart, stress and anxiety), Inuka (Robin van Dalen, support chat app) and UpLift.us (Eddie Liu, depression)</p>\n</blockquote>\n<p>There's also Moodimodo (Mike P Sinn), which I used for a couple of years after trying several other mood-tracking apps and disliking them. It was only later that I realised the connection.</p>\n", "parentCommentId": null, "user": null}, {"_id": "o7GbnJTjCjGdvM633", "postedAt": "2018-06-14T18:13:09.626Z", "postId": "KhwiyLpJmW6fcAuuo", "htmlBody": "<p>Pushing the code into the open is the easy part; if the technical cofounder was on board with open sourcing it that would be very easy for them.  The hard parts are things like:</p>\n<ul>\n<li>Does the code contain anything you don't have the rights to share?</li>\n<li>Does the code contain any passwords, tokens, or other secrets? (It shouldn't, but this is common.)</li>\n<li>Is the code a mess that they're worried would reflect poorly on them as a developer?  (Very likely; I deal with this by just pushing things publicly anyway, but I also have a good enough traditional resume that I'm not reliant on my github resume.)</li>\n</ul>\n", "parentCommentId": "T4hdhqFkXwLqWMDAY", "user": {"username": "Jeff_Kaufman"}}, {"_id": "xpssHHqmbaRqpgi3e", "postedAt": "2018-06-17T06:15:42.481Z", "postId": "KhwiyLpJmW6fcAuuo", "htmlBody": "<p>I volunteer/advise (part-time) a non-profit, that develops and tests evidence-based apps designed to improve mental health.  <a href=\"http://www.m2health.paloaltou.edu/\">http://www.m2health.paloaltou.edu/</a></p>\n<p>There are in fact a lot of those apps around, and a lot more coming on-line from for-profit start-ups. \nOf course, none would exactly match what Michael created.  I personally love the idea that promises to increase happiness rather than remedy the absence of the same.   That gives it a somewhat unique position, even if some of the evidence-based techniques are those used in, say, anti-depression apps.  It sounds like an app I might recommend to clients (I'm a psychologist).</p>\n<p>Sadly/interestingly, none of the general apps has really succeeded in getting widespread use and/or making money.  This includes, so far, some apps which have used up millions of venture funding.    The problem is not that the apps don't work, if used.  It's that people won't pay for them and if given them, usually don't use them.  </p>\n<p>Despite the lack of success, so far, I believe that these sorts of apps offer enormous potential to improve well-being.  The right app - an app that would get used, has an AI base and whose effects can be scientifically evaluated -- could enormously improve well-being.  </p>\n<p>EA'ers who are interested in this area and looking to get involved with others with similar interests should feel free to contact me: <a href=\"mailto:jbankman@stanford.edu\">jbankman@stanford.edu</a> </p>\n", "parentCommentId": null, "user": {"username": "Jbankman"}}, {"_id": "BP7HEkByuCjiw4WFu", "postedAt": "2018-11-07T10:54:02.767Z", "postId": "KhwiyLpJmW6fcAuuo", "htmlBody": "<p>Very interesting in lots of ways. Hippo sounds a bit like Brave New World to me, which isn't entirely to knock it, but I wouldn't like an app to be in charge of my mood! On the development front appinventor.mit.edu is a very flexible (and brilliant and powerful) tool for novices to program android apps. I suspect that producing a working version yourself might have avoided many of your problems.  I got into appinventor because I wanted to produce an app to monitor health symptoms, mood, activity etc at random times. (Mine has a gong not a ping.) I've sort of succeeded but, as often happens I think, I'm now using the app I made for something rather different, but am redesigning and extending the original idea.</p>\n", "parentCommentId": null, "user": {"username": "mickofemsworth"}}, {"_id": "LKYLtwcTkuHixFCuB", "postedAt": "2019-05-31T19:43:29.789Z", "postId": "KhwiyLpJmW6fcAuuo", "htmlBody": "<p>Really great write-up Michael - thank you for your honesty and sharing that with us.  As a fellow altruistic tech entrepreneur, I can relate to a lot of what you&#x27;re talking about.  I started my journey last summer and have already had a few ups and downs.  I&#x27;m sharing with others too at www.philhewinson.com.  We&#x27;ll see where our respective journeys take us :)</p>", "parentCommentId": null, "user": {"username": "philhewinson"}}, {"_id": "hm9j3PwSx7AJqPKWh", "postedAt": "2020-11-18T12:34:36.274Z", "postId": "KhwiyLpJmW6fcAuuo", "htmlBody": "<p>(Belatedly) Re trusting that people will do the work they say they will: in particular this illustrates that developers are notoriously unreliable &amp; hard to manage (due to typical personality type). And unless they are very experienced,&nbsp;they underestimate how long development will take, by a factor of at least 2; because they fail to take into account the time required for specification, testing, bug-fixing, rewriting, documentation,&nbsp;management, admin, and unforeseen problems. Development is mostly <i>not </i>writing code, but doing these other things.</p><p>Additionally, R&amp;D involves research as well as development to varying degrees, and this project required a fair bit of research (e.g. trial &amp; error), as you weren't sure what you were developing and what might work.</p><p>These are well-known, almost universal problems with software startups. In an established business they can be solved by management: hiring an experienced&nbsp;CTO and often also a project manager. With a startup it's harder, unless a founder or lead developer has sufficient relevant experience. (An experienced advisor can help somewhat.)</p>", "parentCommentId": null, "user": {"username": "bfinn"}}, {"_id": "8LJ44oerjHJpRFHn9", "postedAt": "2020-11-24T14:12:39.586Z", "postId": "KhwiyLpJmW6fcAuuo", "htmlBody": "<p>Yes, these are some of the many things I wish I'd known in advance of starting on the project!&nbsp;</p>", "parentCommentId": "hm9j3PwSx7AJqPKWh", "user": {"username": "MichaelPlant"}}, {"_id": "n6tNjgezZ6Z54ZutA", "postedAt": "2020-11-26T04:11:54.565Z", "postId": "KhwiyLpJmW6fcAuuo", "htmlBody": "<p>Has the list been made public, or has the app been made open-source yet?</p>\n", "parentCommentId": "eD76Cubng8nbYCjYk", "user": {"username": "michaelchen"}}, {"_id": "DzNhzHYFzrNKJGYgu", "postedAt": "2021-12-19T22:38:06.346Z", "postId": "KhwiyLpJmW6fcAuuo", "htmlBody": "<p>Thank you for trying to build the app, and for taking the time to reflect on and write about the experience.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Alastair Farrugia"}}, {"_id": "bhTfcPXDeCf3HJdjr", "postedAt": "2022-04-28T15:27:52.244Z", "postId": "KhwiyLpJmW6fcAuuo", "htmlBody": "<p>Wow!&nbsp;<br>Not so long ago, I had a similar idea in mind, and seeing how trying to implement something like it went on for 2.5 years is insane!<br>Sad to see the story stops just when it's starts to give people some actual value (via messenger) :/<br><br>Do you still think it might be an efective form of intervention?<br>Let's say someone used it for a few months to a year, do you believe the benefits might stick after they stop?&nbsp;<br><br>p.s \"if only there was an app to help people with their moods, oh wait…\" noce one lol :)</p>", "parentCommentId": null, "user": {"username": "Shargil"}}]