[{"_id": "5u6xgTueDX2By6c9r", "postedAt": "2022-09-05T15:56:07.409Z", "postId": "KiafCpixvtg5BWfyZ", "htmlBody": "<p>A key point about Ben Franklin is that his longtermist efforts were for the <i>benefit</i> of the future, whereas EA-style longtermist causes like AI risk and biosecurity are about ensuring there actually <strong>is </strong>a future.&nbsp;</p><p>I think as long as there are x-risks that we can plausibly influence there will be people carrying the torch for longtermism in one form or another.&nbsp;</p>", "parentCommentId": null, "user": {"username": "dotsam"}}, {"_id": "boR4y9b5WjQrcrWE8", "postedAt": "2022-09-05T17:29:41.755Z", "postId": "KiafCpixvtg5BWfyZ", "htmlBody": "<ol><li>It seems like if the issue is Benjamin Franklin's endowment wasn't used well enough, maybe he should have thought more about setting conditions on how it would be used most helpfully. That seems like a useful data point that can be used to do better the next time someone tries to improve the future rather than that it's too difficult to even try.&nbsp;</li><li>If you are going to say communist revolution is an example of a longtermist movement because some people involved cared about the future, don't you have to say the same for democratic revolutions? Or any revolution?</li><li>Also, is caring about the future really enough to meaningfully equate movements with vastly different ideas about how to improve the world?&nbsp;</li><li>If it does, then does focus on the present connect all movements meaningfully? I think communists and democrats and basically every movement that failed or succeeded to some extent was concerned with the effects of problems like the distribution of power on the world today, but I'm not sure that means focusing on today is bad and it didn't seem to lock them into the same outcomes as each other. &nbsp;</li></ol>", "parentCommentId": null, "user": {"username": "Peter Gebauer"}}, {"_id": "cCWnEifC5uwSsDP3a", "postedAt": "2022-09-05T17:36:43.172Z", "postId": "KiafCpixvtg5BWfyZ", "htmlBody": "<p>I do think Communism was on average a more longtermist movement than democratic revolutions. Maybe the typical revolutionary in all revolutions had similar goals, but Marx and many of his followers had a vision for how history was supposed to play out, and envisioned an intermediate form of society, between the revolution and an eventual classless society.</p><p>In contrast, a lot of democratic revolutions were more like \"King George bad.\" I don't think the American founding fathers were utopian in the same sense as a lot of Marxists.</p>", "parentCommentId": "boR4y9b5WjQrcrWE8", "user": {"username": "ColdButtonIssues"}}, {"_id": "agtF9rQZeCkFwx8mS", "postedAt": "2022-09-05T18:00:49.578Z", "postId": "KiafCpixvtg5BWfyZ", "htmlBody": "<p>You don't think the Russian revolution was like \"Tsar Nicholas bad\"?<br><br>I mean, \"liberty and justice for all\" sounds like a pretty strong vision of the future to me.&nbsp;<br><br>I guess I'd like to see more evidence that 1) there were significant differences in caring about the future between movements and 2) how these differences contributed to movement failures concretely.&nbsp;<br><br>If I had to guess, I'd hypothesize that there's something else that is the main factor(s), like social dominance orientation of leaders and the presence or absence of group mechanisms to resist that or channel it in less destructive ways.&nbsp;</p>", "parentCommentId": "cCWnEifC5uwSsDP3a", "user": {"username": "Peter Gebauer"}}, {"_id": "HMvCS33BX5AJzSdcq", "postedAt": "2022-09-05T18:06:42.574Z", "postId": "KiafCpixvtg5BWfyZ", "htmlBody": "<blockquote>\n<p>is caring about the future really enough to meaningfully equate movements with vastly different ideas about how to improve the world?</p>\n</blockquote>\n<p>Given that longtermism is literally defined as a focus on improving the long-term future, I think yes? You can come up with many vastly different ways to improve the long-term future, but we should think of the category as \"all movements to improve the long term future\" and not \"all movements to improve the long term future focusing on AI and bio risk and value lock in\".</p>\n", "parentCommentId": "boR4y9b5WjQrcrWE8", "user": {"username": "therealslimkt"}}, {"_id": "8PvQwYGMTLm7m8pgY", "postedAt": "2022-09-05T18:22:15.630Z", "postId": "KiafCpixvtg5BWfyZ", "htmlBody": "<p>Let me rephrase: is focus on improving the long-term future enough to equate movements with vastly different ideas about how to improve the world, such that if one of those ideas turns out poorly, all ideas that similarly focus on the long-term future are just as risky or tainted by association?</p>", "parentCommentId": "HMvCS33BX5AJzSdcq", "user": {"username": "Peter Gebauer"}}, {"_id": "XQ5TWirbMwLnukh3H", "postedAt": "2022-09-05T18:32:00.115Z", "postId": "KiafCpixvtg5BWfyZ", "htmlBody": "<p>This argument has some force but I don't think it should be overstated.</p>\n<p><strong>Re perpetual foundations:</strong> Every mention of perpetual foundations I can recall has opened with the Franklin example, among other historical parallels, so I don't think its advocates could be accused of being unaware that the idea has been attempted!</p>\n<p>It's true at least one past example didn't pan out. But cost-benefit analysis of perpetual foundations builds in an annual risk of misappropriation or failure. In fact such analyses typically expect 90%+ of such foundations to achieve next to nothing, maybe even 99%+. Like business start-ups, the argument is that the 1 in 100 that succeeds will succeed big and pay for all the failures.</p>\n<p>So seeing failed past examples is entirely consistent with the arguments for them and the conclusion that they are a good idea.</p>\n<p><strong>Re communist revolutions:</strong> Many groups have tried to change how society is organised or governed hoping that it will produce a better world. Almost all the past examples of such movements I can think of expected benefits to come fairly soon — within a generation or two at most — and though advocates for such changes usually hoped the benefits will be long-lasting, benefits to be derived millions of years in the future is hardly what motivated their participants.</p>\n<p>Many, especially the most violent ones, have been disastrous, like the various communist revolutions you refer to. Others of course have  been by and large positive, such as people advocating for broadening the franchise, ending slavery, weakening the power of monarchies or phasing out non-self-governing territories. Many also died for those causes. Advocates for those ideas hoped to benefit both current and future generations in much the same way as did communists, and on the whole I think human governance has improved as a result of all these efforts in aggregate over the last thousand years.</p>\n<p>On balance I don't think communists are a closer match to longtermism than many other incremental and radical political movements (culturally it's probably the opposite). And if you broaden the range of reform movements considered then it's hard to know whether they've been a success or failure.</p>\n<p>(Or, as they say, it's still too soon to tell whether the French revolution was a good idea!)</p>\n<p><strong>Re religions:</strong> Religions are a possible analogy for longtermism but while very numerous I think the similarities are not enough to make them an especially compelling reference class.</p>\n<p>What's most distinctive about religions isn't that they're focused on the very long term. In fact many of them are millennialist, or see the universe as fundamentally cyclical, or are focused on reaching an unchanging Platonic realm in which time is a meaningless concept.</p>\n<p>For comparison one could also argue from 'almost all religions proposed are wrong' (necessarily so because they are numerous and contradictory) to 'almost all broad worldviews or opinions are wrong, including the pro-incrementalist one you present in this blog post'.  I don't find that a very strong rebuttal to your view for the same reason I don't find it a strong rebuttal of longtermism.</p>\n<p><strong>Re the longtermist paradox:</strong> I agree 99%+ of improvements to the world have been driven by people trying to improve things in a more immediate way than longtermists typically do. But using the same definition I also think 99.9%+ of all human effort has gone towards such things.</p>\n<p>We need to divide the impact by the inputs to see how cost-effective those actions are. Even if longtermism is far more cost-effective than non-longtermism, we should expect non-longtermism to be dominating total impact because it's wildly wildly larger in scale.</p>\n<p>Through history so few people have done things that would only be particularly recommended by longtermism that we just don't know yet whether it will pan out in practice. The distribution of impact across projects should be expected to be very fat tailed, so even after the fact it will require a huge sample to empirically assess in a statistically sound way. Sometimes life just sucks that way!</p>\n", "parentCommentId": null, "user": {"username": "Robert_Wiblin"}}, {"_id": "x7dE3AdxCPLCLwtHd", "postedAt": "2022-09-05T20:56:17.312Z", "postId": "KiafCpixvtg5BWfyZ", "htmlBody": "<p>Thanks for writing this. I think there are actually some pretty compelling examples of people/movements being quite successful at helping future generations (while partly trying to do so):</p>\n<ul>\n<li><a href=\"https://www.sethkaller.com/freedomdocuments/13th-amendment/\">Some sources</a> suggest that Lincoln had long-term motivations for permanently abolishing slavery, saying, \"The abolition of slavery by constitutional provision settles the fate, for all coming time, not only of the millions now in bondage, but of unborn millions to come--a measure of such importance that these two votes must be procured.\" Looking back now, abolition still looks like a great move for future generations.\n<ul>\n<li>I don't know how accurate those sources are, but at least a U.S. constitutional amendment is structured to have very long-lasting impacts, given the extreme difficulty of undoing it.</li>\n</ul>\n</li>\n<li>The U.S. constitution appears to have been partly aiming to create a long-lasting democracy, citing \"our posterity\" in its preamble. It seems to have largely worked.</li>\n<li>Proponents of measures to avoid nuclear war and reduce nuclear weapons testing often cited future generations as one motivation. (For example, in a famous speech he gave before launching U.S.-Soviet cooperation on limiting nuclear testing and nonproliferation, Kennedy <a href=\"https://www.jfklibrary.org/archives/other-resources/john-f-kennedy-speeches/american-university-19630610\">appealed</a> to the importance of \"not merely peace in our time but peace for all time\" and to \"the right of future generations to a healthy existence.\") These efforts have been quite successful; we've had about 77 <a href=\"https://www.nobelprize.org/prizes/economic-sciences/2005/schelling/lecture/\">years with no wartime use of nuclear weapons</a>, nuclear testing has <a href=\"https://ourworldindata.org/grapher/number-of-nuclear-weapons-tests\">plummeted</a>, and far few states than once feared now have nuclear weapons.</li>\n</ul>\n<p><em>[Edited to add]</em> All this looks to me like a mixed (and maybe fairly good overall) track record, not a terrible one. (Though a deeper problem is that we can't justifiably draw almost <em>any</em> conclusions about base rates from these or the post's examples, since we've made no serious efforts to find a representative sample of historical longtermist efforts.)</p>\n", "parentCommentId": null, "user": {"username": "Mauricio"}}, {"_id": "6fSvRdgdpv8aGrtEi", "postedAt": "2022-09-05T21:14:20.845Z", "postId": "KiafCpixvtg5BWfyZ", "htmlBody": "<p>A short objection:</p>\n<blockquote>\n<p>One danger of perpetual foundations is that they might end up pursuing goals antithetical to what their creators wanted. The classic example here is the Ford Foundation,  founded by successful capitalists within the Ford family, which eventually took a sharp left turn...</p>\n</blockquote>\n<p>I don't think this is a problem. Yes, I'm biased because I'm a leftist - but I also think values change with time, and we needn't worry about our children or grandchildren having different values than us, as theirs might be better. Looking over history, it looks like they probably will be.</p>\n<p>As long as we care about \"making sure our money benefits the entire future\", the only value we need to lock in somehow is that one itself.</p>\n", "parentCommentId": null, "user": {"username": "Guy Raveh"}}, {"_id": "ZA7zFDphQmCLBBHM9", "postedAt": "2022-09-05T22:23:49.946Z", "postId": "KiafCpixvtg5BWfyZ", "htmlBody": "<p>Thanks for the counterexamples!</p><p>I'm trying to think of a way to get a fair example: Coding party manifestos by attention to long-term future and trying to rate their success in office? I'm really unsure.</p>", "parentCommentId": "x7dE3AdxCPLCLwtHd", "user": {"username": "ColdButtonIssues"}}, {"_id": "Btxd2EWERWFCrdzHX", "postedAt": "2022-09-06T03:23:26.515Z", "postId": "KiafCpixvtg5BWfyZ", "htmlBody": "<blockquote><p>If a malaria charity fails to achieve anything, people with malaria can try to complain. But if a longterm-oriented charity fails to achieve anything, the only people who could complain would be time travelers!</p></blockquote><p>I appreciate this concern, but as I explained in <a href=\"https://forum.effectivealtruism.org/posts/HWniFd5CsuTaGiAXy/where-are-the-long-termist-theories-of-victory-impact?commentId=LyCxBfHLHesG7FGt4\">this comment here</a>, I think this is not a very strong argument against longtermism. To briefly summarize the ideas I explain in more detail there:</p><ol><li>Many people are already not held very accountable in the near term, despite what we might hope.</li><li>Near-term interventions can also prove to be relatively unimportant from a long-term lens.</li><li>You can definitely be held accountable or feel guilty if it becomes apparent in the near-term that your arguments/proposals will actually be bad in the long-term.</li><li>Due to the massive expected value, Long-termism can probably still just bite the bullet here even if you mostly dismiss the previous points.</li></ol>", "parentCommentId": null, "user": {"username": "Harrison D"}}, {"_id": "LjRpbXkvzjiTSA5sA", "postedAt": "2022-09-06T08:08:15.563Z", "postId": "KiafCpixvtg5BWfyZ", "htmlBody": "<blockquote><p>The ones who aimed at the distant future mostly failed. The longtermist label seems mostly unneeded and unhelpful- and I’m far from <a href=\"https://www.slowboring.com/p/whats-long-term-about-longtermism\"><u>the first</u></a> <a href=\"https://forum.effectivealtruism.org/posts/rFpfW2ndHSX7ERWLH/simplify-ea-pitches-to-holy-shit-x-risk\"><u>to think</u></a> <a href=\"https://forum.effectivealtruism.org/posts/KDjEogAqWNTdddF9g/long-termism-vs-existential-risk\"><u>so</u></a>.</p></blockquote><p>&nbsp;</p><p>Firstly, in my mind, you're trying to say something akin to that we shouldn't advertise longtermism as it hasn't worked in the past. Yet this is a claim about the tractability of the philosophy and not necessarily about the idea that future people matter.</p><p>Don't confuse the philosophy with the instrumentals, longtermism matters, but the implementation method is still up for debate.</p><blockquote><p>&nbsp;But I don’t view the effective altruist version of longtermism as particularly unique or unprecedented.I think the dismal record of (secular) longtermism speaks for itself.&nbsp;&nbsp;</p></blockquote><p>Secondly, I think you're using the wrong outside view.&nbsp;</p><p>There is a problem with using historical presidents as you assume similar conditions exist in the EA community as it did in the other communities.&nbsp;</p><p>An example of this is HPMOR and how unpredictable the success of this fan fiction would have been if you looked at an average Harry Potter fan fiction from before. The underlying outside view is different because the underlying causal thinking is different.&nbsp;</p><p>As Nasim Nicholas Taleb would say, you're trying to predict a black swan, an unprecedented event in the history of humanity.&nbsp;</p><p>What is it that makes longtermism different?&nbsp;</p><p>There is a fundamental difference in understanding of the world's causal models in the EA community. There is no outside view for longtermism as its causal mechanisms are too different from existing reference classes.</p><p>To make a final analogy, it is useless to predict gasoline prices for an electric car, just like it is useless to predict the success of the longtermist movement from previous ones.</p><p>(Good post, though, interesting investigation, and I tend to agree that we should just say holy shit, x-risk instead)</p>", "parentCommentId": null, "user": {"username": "Jonas Hallgren"}}, {"_id": "YTgZe5irk8XBJFMBR", "postedAt": "2022-09-06T09:01:39.608Z", "postId": "KiafCpixvtg5BWfyZ", "htmlBody": "<blockquote>\n<p>Religion is probably the best prospect for showing that longtermist movements are a good idea.</p>\n</blockquote>\n<p>Hmm. Maybe. I could imagine Tom Holland making a case for this.</p>\n<p>I've not looked into this much <sup class=\"footnote-ref\"><a href=\"#fn-TnbEw6rHGdGevyBKr-1\" id=\"fnref-TnbEw6rHGdGevyBKr-1\">[1]</a></sup>, but my guess is that a bunch of religious leaders have in fact thought pretty long term and quite deeply about what matters and what kinds of guidance humanity most needs (e.g. Saint Paul).</p>\n<p>Even more speculative: perhaps one of the main weaknesses of most contemporary religious leaders  is not knowing much about Bostromian / FHI-ish stuff on technology.</p>\n<hr class=\"footnotes-sep\">\n<section class=\"footnotes\">\n<ol class=\"footnotes-list\">\n<li id=\"fn-TnbEw6rHGdGevyBKr-1\" class=\"footnote-item\"><p>Mainly just watched <a href=\"https://en.m.wikipedia.org/wiki/The_Young_Pope\">The Young Pope</a> which is outstanding and many people should try, especially season 2 but don't skip season 1. <a href=\"#fnref-TnbEw6rHGdGevyBKr-1\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n</ol>\n</section>\n", "parentCommentId": null, "user": {"username": "Peter_Hartree"}}, {"_id": "a3EuzefbN5tP7Bvv7", "postedAt": "2022-09-06T09:05:35.813Z", "postId": "KiafCpixvtg5BWfyZ", "htmlBody": "<p>Will's book mentions USA Founding Fathers as an example. Success? Seems good so far. But too early to tell, perhaps.</p>\n", "parentCommentId": null, "user": {"username": "Peter_Hartree"}}, {"_id": "gXkpnznJsffxEMdcP", "postedAt": "2022-09-06T09:31:31.368Z", "postId": "KiafCpixvtg5BWfyZ", "htmlBody": "<p>Related:<strong> </strong><a href=\"https://www.lesswrong.com/posts/dhj9dhiwhq3DX6W8z/hero-licensing\"><strong>Hero Licensing</strong></a> (the title of the first section is \"Outperforming the outside view\").&nbsp;</p>", "parentCommentId": "LjRpbXkvzjiTSA5sA", "user": {"username": "Lizka"}}, {"_id": "Jyrr6aAqbnrxBxAL5", "postedAt": "2022-09-06T10:56:46.335Z", "postId": "KiafCpixvtg5BWfyZ", "htmlBody": "<blockquote><p>There is a fundamental difference in understanding of the world's causal models in the EA community. There is no outside view for longtermism as its causal mechanisms are too different from existing reference classes.</p></blockquote><p>What do you mean by this?&nbsp;</p>", "parentCommentId": "LjRpbXkvzjiTSA5sA", "user": null}, {"_id": "et678SQvcNbqmivwJ", "postedAt": "2022-09-06T18:39:04.809Z", "postId": "KiafCpixvtg5BWfyZ", "htmlBody": "<p>Thank you! I was looking for this one but couldn't find it</p>", "parentCommentId": "gXkpnznJsffxEMdcP", "user": {"username": "Jonas Hallgren"}}, {"_id": "seJ9f2a3AYTq68GRQ", "postedAt": "2022-09-06T18:43:34.017Z", "postId": "KiafCpixvtg5BWfyZ", "htmlBody": "<p>Essentially that the epistemics of EA is better than in previous longtermist movements. EA's frameworks are a lot more advanced with things such as thinking about the traceability of a problem, not Goodharting on a metric, forecasting calibration, RCTs... and so on with techniques that other movements didn't have.</p>", "parentCommentId": "Jyrr6aAqbnrxBxAL5", "user": {"username": "Jonas Hallgren"}}, {"_id": "2fqDm3NggusiYYXsW", "postedAt": "2022-09-06T20:53:07.043Z", "postId": "KiafCpixvtg5BWfyZ", "htmlBody": "<p>And worth noting that Ben Franklin was involved in the constitution, so at least some of his longtermist time seems to have been well spent.</p>", "parentCommentId": "x7dE3AdxCPLCLwtHd", "user": {"username": "zdgroff"}}, {"_id": "Kd9eQaKdxcQC6RqoF", "postedAt": "2022-09-07T20:52:22.280Z", "postId": "KiafCpixvtg5BWfyZ", "htmlBody": "<p>ColdButtonIssues makes some good points about religion as a major traditional &nbsp;focus of longtermist imagination and morality in most human societies. I agree that EA should pay closer attention to the intellectual/moral history of religious conceptions of the afterlife &amp; reincarnation -- at least as cautionary tales about how runaway consequentialist reasoning can go astray. (eg 'it's worth burning this person at the stake if there's even a 1% chance that the excruciation will make them recant their apostasy to save their immortal soul, which could enjoy heaven for &gt;10 quadrillion times as long as they're being burned....').</p><p>I would add that political conservatism has also been more longtermist, traditionally, than most revolutionary movements such as communism (which may give lip service to future generations, but is often more interested in immediate vengeance against the local bourgeoisie). This seems especially true of the more family-values, pronatalist versions of conservatism that focus on multi-generational/dynastic thinking.&nbsp;</p><p>This also seems true of conservative political philosophers who tend to ask questions like:</p><p>'How will this new policy really affect our grand-kids and great-grand-kids?</p><p>'Is it really worth giving up this tradition that's worked for dozens of generations (that's 'Lindy'), to try something new and untested?'</p><p>'Will this new social/technical/governance innovation really prove stable for multiple generations against perturbation, exploitation, propaganda, mission drift, regulatory capture, security exploits, savvy adversaries, and future folly?'</p><p>'Is this proposed strategy even a Nash equilibrium in the game of life, given all the easily-anticipated counter-strategies?'</p><p>Implicit in a lot of conservative/traditionalist political philosophy is a concern for how stable certain social arrangements will be, in the long term, against future adversaries, activists, virtue-signalers, foreign powers, misguided do-gooders, government powers, self-interested elites, etc.&nbsp;</p><p>In other words, there's a focus on which strategies are evolutionarily stable equilibria in long-term iterated games. In that regard, I see a strong overlap between conservative political philosophy and some current EA longtermist concerns such as the game theory involved in AI alignment, or the geopolitical governance issues around nuclear war and bioweapons development.</p>", "parentCommentId": null, "user": {"username": "geoffreymiller"}}, {"_id": "vFSyHA9vqEnKQbNJL", "postedAt": "2022-09-09T14:11:01.956Z", "postId": "KiafCpixvtg5BWfyZ", "htmlBody": "<p>This is a cool post. Though, I wonder if there's switching between longtermism as a theory of what matters vs the idea you should try to act over long timescales (as with a 200yr foundation).</p>\n<p>You could be a longtermist in terms of what you think is of moral value, but believe the best way to benefit the future (instrumentally) is to 'make it to the next rung'. Indeed this seems like what Toby, Will etc. basically think.</p>\n<p>Maybe then relevant reference class is more something like 'people motivated to help future generations but who did that by solving certain problems of the day', which seems a very broad and maybe successful reference class  - eg encompassing many scientists, activists etc.</p>\n<p>PS shouldn't the environmentalism, climate change and anti nuclear movements be part of your reference class?</p>\n", "parentCommentId": null, "user": {"username": "Benjamin_Todd"}}, {"_id": "edCtmyZc6Gk2kC8Jq", "postedAt": "2022-09-09T14:41:31.464Z", "postId": "KiafCpixvtg5BWfyZ", "htmlBody": "<p>I was thinking the reference class was something like \"people explicitly orienting their actions for the benefit of &nbsp;far future generations.\"&nbsp;</p><p>I was trying to be more specific than every good deed that also benefits the future. I didn't want to include things like \"this vaccine will save our children (and future generations)\" or \"we will win this war against our evil enemy (and also for our children's sake)\".&nbsp;</p><p>What seems new about longtermism to me is not the belief that good things will have positive consequences in the long-run- \"classic\" EA and bednet funders think that- but that decisions should be made specifically with the future as the primary end in mine. That's what seems to distinguish Ord and MacAskill from other EA's and altruists in general.</p><p>I agree with your suggested examples in the end- and some other commenters suggested some other movements to consider- so I want to revisit this topic with a better collection of examples. I don't want to be unfair to longtermists despite my skepticism of their emphasis.</p>", "parentCommentId": "vFSyHA9vqEnKQbNJL", "user": {"username": "ColdButtonIssues"}}, {"_id": "rMELof3MgtmGkL8Qf", "postedAt": "2022-09-10T17:20:45.713Z", "postId": "KiafCpixvtg5BWfyZ", "htmlBody": "<p>Another example: <a href=\"https://marginalrevolution.com/marginalrevolution/2022/09/the-true-long-termist-has-passed-from-the-scene.html\">The British Royal Family</a>.</p>\n", "parentCommentId": null, "user": {"username": "Peter_Hartree"}}, {"_id": "WR8TRAadtQbftup3c", "postedAt": "2022-09-20T08:28:09.642Z", "postId": "KiafCpixvtg5BWfyZ", "htmlBody": "<blockquote><p>Advocates for those ideas hoped to benefit both current and future generations in much the same way as did communists, and on the whole I think human governance has improved as a result of all these efforts in aggregate over the last thousand years.</p></blockquote><p>That sounds doubtful to me. Hegelian ideas about the nature of history are an important part of communism and part of how communist thinkers thought their actions will have effects on the far future.</p><p>Just because you observe that people who argued for ending slavery had positive longterm effects doesn't imply that those longterm effects were central to how those people thought about the issue.&nbsp;</p>", "parentCommentId": "XQ5TWirbMwLnukh3H", "user": {"username": "ChristianKleineidam"}}, {"_id": "vqffzoun3nJEzejjt", "postedAt": "2022-09-20T08:40:17.017Z", "postId": "KiafCpixvtg5BWfyZ", "htmlBody": "<p>Anti-nuclear advocates frequently talk about the long time that certain isotopes need to decay.</p><p>Stewart Brand who came out of the environmentalist field founded the LongNow foundation and there are plenty of people in that field who think similar to him.</p>", "parentCommentId": "edCtmyZc6Gk2kC8Jq", "user": {"username": "ChristianKleineidam"}}, {"_id": "NYhZwAEsaPYdohtHW", "postedAt": "2022-09-20T08:46:09.862Z", "postId": "KiafCpixvtg5BWfyZ", "htmlBody": "<p>Whether or not AI risk is tractable is in doubt. <a href=\"https://www.lesswrong.com/posts/j9Q8bRmwCgXRYAgcJ/miri-announces-new-death-with-dignity-strategy\">Eliezer </a>argued that it's likely not tractable but that we should still invest in it. The longermist arguments about the value of the far future suggest that even if there's only a 0.1% chance that AI risk is tractable we should still fund it as the most important cause.&nbsp;</p>", "parentCommentId": "seJ9f2a3AYTq68GRQ", "user": {"username": "ChristianKleineidam"}}, {"_id": "4vJ3WDgFzfoEyRRaX", "postedAt": "2022-12-05T22:03:26.887Z", "postId": "KiafCpixvtg5BWfyZ", "htmlBody": "<p>Your response to perpetual foundations seems to have <a href=\"https://gregoryjlewis.com/2016/01/24/beware-surprising-and-suspicious-convergence/\">surprising and suspicious convergence.&nbsp;</a><br><br>At some base-rate we cannot just keep saying \"oh, another failed past example of perpetual foundation. But that is ok, this is actually consistent with the conclusion that they are still a good idea.\"</p><p>The dis-analogy here with business startups is that we actually have clear evidence that some business startups do drastically succeed to make up for all the failures. Granted, this could just be because there haven't been enough perpetual foundations for us to finally hit on the great result that will make up for the failures.</p><p>So, although I agree your response on perpetual foundations is warranted, it still makes me raise my eyebrow.</p>", "parentCommentId": "XQ5TWirbMwLnukh3H", "user": {"username": "Cornelis Dirk Haupt"}}]