[{"_id": "ZXTTWGqSbxzw6cisg", "postedAt": "2024-02-17T09:09:18.078Z", "postId": "KKLsou9ZS5PhdnGfA", "htmlBody": "<p>Hi Josh,</p><blockquote><p>At the current rate of carbon emissions, the global temperature is expected to rise to 4 degrees Celsius from the 1850 baseline.</p></blockquote><p>This is too high if it refers to 2100? Metaculus' community <a href=\"https://www.metaculus.com/questions/605/how-much-global-warming-by-2100/\">is</a> predicting 2.67 ºC in 2100 relative to 1880. In the Existential Risk Persuasion Tournament (<a href=\"https://static1.squarespace.com/static/635693acf15a3e2a14a56a4a/t/64f0a7838ccbf43b6b5ee40c/1693493128111/XPT.pdf\">XPT</a>), superforecasters and domain experts predicted 2.6 and 2.55 ºC in 2100 relative to 1850-1900 (pp. 462 and 463).</p>", "parentCommentId": null, "user": {"username": "vascoamaralgrilo"}}, {"_id": "SXaA6Rcj3bx5t4po3", "postedAt": "2024-02-18T18:52:27.207Z", "postId": "KKLsou9ZS5PhdnGfA", "htmlBody": "<blockquote><p>In this case, the example is no longer hypothetical as an individual who changes his habits to reduce carbon emissions is literally saving not one but many children who are at risk of drowning from floods caused by rising global temperatures, among other disasters caused by global warming. Thus, there is strong support for the second premise. The actions an individual can take to reduce the carbon emissions of his consumption habits are simple and at little cost to the individual. These actions include switching off electrical appliances when not in use, using fans instead of air-conditioners, switching off water taps when brushing teeth and air-drying clothes in the sun instead of using a dryer.</p></blockquote><p>I think if you actually attempted to do these calculations rather than just gesturing at you would not get such a large impact. Suggesting that a single person making lifestyle adjustments 'is literally saving not one but many children' (though they are only 'at risk'?) seems like a dramatic overestimate to me. It seems basically impossible for this to be the case given that you are a very small fraction of the total population and a small fraction of carbon emissions.</p>", "parentCommentId": null, "user": {"username": "Larks"}}, {"_id": "ng522vEaqPBiZ7geb", "postedAt": "2024-02-21T09:54:05.563Z", "postId": "KKLsou9ZS5PhdnGfA", "htmlBody": "<p><a href=\"https://www.nature.com/articles/s41467-021-24487-w\">This paper</a> I read a few years ago gives an estimate for the mortality cost of carbon emissions. Obviously this is highly uncertain and would change based on projected policy changes/ new technology. The mainline estimate is that the average American's lifetime emissions lead to 1.16 excess deaths before 2100.&nbsp;</p>", "parentCommentId": "SXaA6Rcj3bx5t4po3", "user": {"username": "tobytrem"}}, {"_id": "nZHgJXzQKhKkakEWr", "postedAt": "2024-02-21T20:16:28.316Z", "postId": "KKLsou9ZS5PhdnGfA", "htmlBody": "<p>Thanks for sharing. I didn't quite understand the methodology in the paper (e.g. why 4.1 degrees as baseline? and I saw 0.29 as the total lifetime impact, rather than 1.16) but either way it seems to agree that the post's implicit estimates were way too high.</p>", "parentCommentId": "ng522vEaqPBiZ7geb", "user": {"username": "Larks"}}]