[{"_id": "q8wqHSZMBZfYBeY5t", "postedAt": "2023-09-24T13:00:53.508Z", "postId": "KkmbSbu2MhLmyj2Rd", "htmlBody": "<p>I wrote another post about how the possibility of AGI making us immortal could screw up incentives from a selfish perspective. Your likelihood indicate a bet that some might be willing to take (even though delay for safety increases might be much higher EV from an altruistic perspective).</p>\n<p><a href=\"https://forum.effectivealtruism.org/posts/ggSXcuMzRaowDbKTz/possible-divergence-in-agi-risk-tolerance-between-selfish\">https://forum.effectivealtruism.org/posts/ggSXcuMzRaowDbKTz/possible-divergence-in-agi-risk-tolerance-between-selfish</a></p>\n", "parentCommentId": null, "user": {"username": "Brad West"}}, {"_id": "dTGF2s6tDBAWKAcJG", "postedAt": "2023-09-24T17:03:47.088Z", "postId": "KkmbSbu2MhLmyj2Rd", "htmlBody": "<blockquote><p><i>Time between surviving AGI and solving aging</i></p><p><strong>I model this as an exponential distribution with a mean time of 5 years.</strong> I mostly think of it as requiring a certain amount of “intellectual labor” (distributed lognormally) to be solved, with the amount of intellectual labor per unit of time increasing rapidly with the advent of AGI as its price decreases dramatically.</p></blockquote><p>This is an extremely wild claim, and one I believe to be almost certainly false. Efforts to even slow down aging in some parts of the body have barely gotten anywhere, you think a mere AGI can suddenly jumpstart us to immortality? Running experiments on aging requires <i>people to age, </i>which inherently puts a bottleneck on this type of experiment.&nbsp;</p><p>I am somewhat concerned that people are ascribing near-godlike abilities to AGI without even bothering to supply evidence or even an argument in favor of this hypothesis. All intelligences are <a href=\"https://titotal.substack.com/p/the-first-agi-will-be-a-buggy-mess\">flawed</a>, and all intelligences have <a href=\"https://titotal.substack.com/p/bandgaps-brains-and-bioweapons-the\">computational limits</a>.&nbsp;</p>", "parentCommentId": null, "user": {"username": "titotal"}}]