[{"_id": "ygrZELEhBCmefFHz4", "postedAt": "2022-10-14T23:23:37.841Z", "postId": "KLctBFtEzBtugGup7", "htmlBody": "<p>Cost-effectiveness doesn't mean only efficiency. I think when you're trying to do the most good, ditching the use of cost-effectiveness is quite hard because what will you use instead? Cost-effectiveness isn't only about efficiency or consequentalist perspectives, it's about doing the most good possible the scarce money we have(as EAs). Don't you think it'd be better to think about how cost effective human-rights lobbying is or will be before taking these actions? When you're trying to decide on which programs to fund from a Rawlsian framework, what will you use if you won't cost-effectiveness?&nbsp;If two programs achieve the same thing, and one of them costs 10k and the other costs 25k, you shouldn't donate money to the latter program.<br><br>Also, saving African children from Malaria by distributing bednets, vaccinating Nigerian kids with certain incentives or preventing humanity from destroying itself is not valuable only from a utilitarian point of view, the number of moral views that somehow imply \"No you shouldn't save an African kid for 4.5k, just buy a better car\" isn't probably high. But on the other hand \"Billionaire philanthropy isn't okay, it'd be better if the masses decided what to do\" and \"Universal healthcare is a moral imperative\" are claims which a lot of moral theories would disagree with. &nbsp;So if you accept that it's quite possible for us to be mistaken about which moral theory is correct, the case for changing global discourse and setting up effective bureucracies that would be able to provide high-quality universal healthcare would quite hard.<br>&nbsp;</p><p>A third critique is tractability. Isn't it quite hard to change global political discourse, especially in Africa where most EAs do not have no connection to, and institute health as a global right and actually enforce this? This seems quite unlikely, because this would require increasing state capacity all over the global south, advancement of technologies in underdeveloped countries(if we take veil of ignorance seriously), setting effective and capable health bureucracies in countries where bureucracies tend to be home clientelistic and kleptocratic tendencies rather than effectiveness. Again, I don't think the goal this post propose are actually tractable. This is different distributing bednets.<br><br>What are we actually optimizing for? Are we optimizing for improving health outcomes of the most disadvantaged people? If I was behind a veil of ignorance, I'd like to have a more functional FDA and overall better medical innovation, when there are tradeoffs between medical innovation and extending universal healthcare, what should we do? How would we understand if we're making progress on these goals? Number of states claiming that healthcare is a human right? I live in Turkey where healthcare is universally provisioned by the state, but can't get an appointment before 3 months on most hospital, and quality of healthcare at state hospitals are quite low.(at a level where 4 doctors misdiagnosed me, they all diagnosed with different diseases, failing spectacularly)<br>&nbsp;<br>&nbsp;</p>", "parentCommentId": null, "user": {"username": "Berke"}}, {"_id": "G7TAefD65QsbmzkhG", "postedAt": "2022-10-16T08:02:24.786Z", "postId": "KLctBFtEzBtugGup7", "htmlBody": "<p>Thank you for your reply. I am sorry to hear about your poor personal healthcare experience.&nbsp;</p><p>Regarding your other points:</p><p>\"Cost-effectiveness doesn't mean only efficiency. I think when you're trying to do the most good, ditching the use of cost-effectiveness is quite hard because what will you use instead?\"</p><p>Equity. I am suggesting a paradigm shift to considering equity as the most important goal. It means spending more on those less fortunate, but sometimes cost-effectiveness and equity align. For example, Give Well donates to low income countries because it is more cost-effective, but it happens to also be a more equitable choice. The provision of primary health care for all is equitable, and is not &nbsp;always at odds with cost-effectiveness, see the US spending on healthcare and morbidity and mortality outcomes vs other rich countries which have social health care. The only process by which equity is advanced is through human rights lobby, as far as I can tell.</p><p>\"\"Billionaire philanthropy isn't okay, it'd be better if the masses decided what to do\" and \"Universal healthcare is a moral imperative\" are claims which a lot of moral theories would disagree with\"</p><p>I am interested to see these moral theories.</p><p>\"A third critique is tractability. Isn't it quite hard to change global political discourse, especially in Africa where most EAs do not have no connection to, and institute health as a global right and actually enforce this? This seems quite unlikely, because this would require increasing state capacity all over the global south, advancement of technologies in underdeveloped countries(if we take veil of ignorance seriously), setting effective and capable health bureucracies in countries where bureucracies tend to be home clientelistic and kleptocratic tendencies rather than effectiveness. Again, I don't think the goal this post propose are actually tractable. This is different distributing bednets.\"</p><p>I agree with this; it highlights the purpose of my post, which is to suggest EAs aim higher in their altruistic goals.</p>", "parentCommentId": "ygrZELEhBCmefFHz4", "user": {"username": "LiaH"}}, {"_id": "vt9wBafobPwePmxze", "postedAt": "2022-10-16T09:05:57.567Z", "postId": "KLctBFtEzBtugGup7", "htmlBody": "<p>Even when you are trying advance equity, there will be certain charities that are more cost-effective and \"efficient\", efficient in the sense that they'll be successful. Again, if you want to do human rights lobbying, probably doing that in the US would probably be more expensive compared to a relatively globally irrevelant low-income country x where there isn't much lobbying. Cost-effectiveness isn't the endpoint of EA, it's a method that enables you to choosse the best intervention when you have scarce money.<br><br>For billionaire philanthropy, there are a lot of moral theories that don't assume what you assume about democracy or assume billionaires shouldn't make decisions about public good.Most consequentalists doesn't assume automatically or a priori that billionaires should be less powerful, their stance on this would be based on more empirical truths but still, this part of your post also has a moral assumption involved in it. Libertarian-ish moral views, prioritarianism, utilitarianism and not a theory but a view called <a href=\"https://philpapers.org/rec/HALHSI\">high-stakes instrumentalism</a> &nbsp;are all views that are quite popular and we should integrate into our normative uncertainty model. &nbsp;You can check<a href=\"https://slatestarcodex.com/2019/07/29/against-against-billionaire-philanthropy/\"> this blogpost</a> on why some people aren't &nbsp;against billionaire philanthropy. I personally wouldn't want state or masses to prevent people from spending their money as they'd like, many people from countries that are experiencing democratic backsliding or have low trust in government too wouldn't agree with you. In Turkey, it's really hard to have abortions outside of private hospitals for instance, universal healthcare for the globally disadvantaged people means growing a state that's usually corrupt and anti-liberal. I'm not saying this is defintiely wrong, we should be less confident of our views when we're talking about this issue.<br>&nbsp;<br><br>Aiming higher in our altruistic goals doesn't alleviate the requirement of having a theory of change and<a href=\"https://slatestarcodex.com/2017/04/07/yes-we-have-noticed-the-skulls/\"> noticing the skulls</a>, there are many organizations trying to do what you want to do, advance equity, but world and a lot of places these specific charities operate are still quite unequal, they aren't very successful, vaccines still have patents, what will you do differently this time?<br><br>Also I think a probabilistic standpoint is useful, like for instance when equity and health outcomes tradeoff, let's imagine a parallel universe when universal healthcare will result in slightly worse outcomes and slightly worse wellbeing overall, both for the average and the well-off person. But, it will be equal, variation of health outcomes between wealthy people and poor people will decrease, even though poor people's health outcomes won't improve and this will take palce because of wealthy people's loss of welfare. Do you think still, effective altruists should advance equity? This is a very specific conceptualization of good. I'm not saying equity is unimportant, other things may be important too, that's why taking normative uncertainty and empirical uncertainty is really important when we're talking about these issues.</p>", "parentCommentId": "G7TAefD65QsbmzkhG", "user": {"username": "Berke"}}]