[{"_id": "TBmYjRxtpKGQNzPLz", "postedAt": "2018-07-11T12:32:16.380Z", "postId": "KnoWtbBtXB8amBDpS", "htmlBody": "<p>If capital markets are efficient and most people aren't impact investors, then there is no benefit to impact investing, as the coal company can get capital from someone else for the market rate as soon as you back out, and the solar company will lose most of its investors unless it offers a competitive rate of return. At the same time, there is no cost to impact investing.</p>\n<p>In reality I think things are not always like this, but not only does inefficiency imply that impact investing has an impact, it also implies that you will get a lower financial return. </p>\n<p>For most of us, our cause priorities are not directly addressed by publicly traded companies, so I think impact investing falls below the utility/returns frontier set by donations and investments. You can pick a combination of greedy investments and straight donations that is Pareto superior to an impact investment. If renewable energy for instance is one of your top cause priorities, then perhaps it is a different story.</p>\n", "parentCommentId": null, "user": {"username": "kbog"}}, {"_id": "29FswRtGkYaAawg9P", "postedAt": "2018-07-11T13:28:23.845Z", "postId": "KnoWtbBtXB8amBDpS", "htmlBody": "<p>If the solar company is offering below market returns, then an impact investment is equivalent to a grant to that company. This opens up some space for impact investing to have counterfactual impact, provided the investment opportunity stands a decent chance of success.</p>\n", "parentCommentId": "TBmYjRxtpKGQNzPLz", "user": null}, {"_id": "9YqQAdjb5WbBc9vJA", "postedAt": "2018-07-11T13:42:28.323Z", "postId": "KnoWtbBtXB8amBDpS", "htmlBody": "<p>Thanks for getting the conversation going on this topic, which hasn't received enough systematic attention by EAs. An excellent treatment of this issue is given by Paul Brest here - <a href=\"https://ssir.org/articles/entry/impact_investing\">https://ssir.org/articles/entry/impact_investing</a> . This suggests that the prospects of achieving market rate returns and having social impact are dim.  One may be able to have counterfactual impact by accepting below market returns or at the extreme providing a grant to a company. (Open Phil has invested in Impossible Foods, presumably accepting below market returns).</p>\n<p>One observation I have is that there is a big step between showing that impact investing might work in some conditions and actually finding good opportunities. It seems like identifying good opportunities would take serious up a lot of serious research time - of the same order we would expect to identify a recommended GW charity. A glance through some impact investing platforms suggests they offer quite shallow analysis of enterprises that look unlikely to be effective. So, I think we should acknowledge that this space is worth exploring but be very sceptical about any particular opportunity, whether that be Wave, World Tree or whatever</p>\n", "parentCommentId": null, "user": null}, {"_id": "Jxs2vjMPM9W89T5QA", "postedAt": "2018-07-11T18:54:09.429Z", "postId": "KnoWtbBtXB8amBDpS", "htmlBody": "<p>I agree that markets are inefficient, but believe that the inefficiency results in opportunities that are both worse than average and better than average.  Since I suspect most investors under-value the social impact, this would result in impact investments  that are more attractive than average to someone who does value the impact as well as the return.</p>\n<p>Generally when was looking to invest, I looked for options that I expected to outperform market average at a set risk level, and I didn't assess social utility in that calculation (assuming I could donate the return more effectively, as you suggest).  I'm not sure if this logically follows, but if my choice is between effective charity and impact investment, generally an effective charity would do more good.  But if I'm considering my retirement fund, I believe the right impact investment could be better than a comparable equity investment - I just need to remember to include the social utility in my valuation.</p>\n", "parentCommentId": "TBmYjRxtpKGQNzPLz", "user": {"username": "Naryan"}}, {"_id": "8ovZMyGbBpqNSEjQT", "postedAt": "2018-07-11T19:10:16.129Z", "postId": "KnoWtbBtXB8amBDpS", "htmlBody": "<p>I think you hit the nail on the head - the current offering of impact investment platforms and offerings for a retail investor is fairly uninspiring.  Can they stack up against the best EA charitable causes?  Odds are against it.</p>\n<p>I did allocate some of my retirement funds (currently in equity) towards buying a few acres with World Tree, which I think is a step in the right direction - more impact, and likely higher returns (ask me again in 10 years).  I know mental bucketing of finances is some kind of bias, but keeping my charitable donations separate from my retirement fund will lead me to a future of financial security, rather than donating everything to my favourite charity today.</p>\n<p>From a utilitarian view - I'd love to hear more perspectives on the trade off between traditional investing vs charitable giving.  Is this an optimization problem?  Or is there a strong argument against one or the other?</p>\n", "parentCommentId": "9YqQAdjb5WbBc9vJA", "user": {"username": "Naryan"}}, {"_id": "ahmiDNDBGjj8xdafv", "postedAt": "2018-07-11T22:55:08.575Z", "postId": "KnoWtbBtXB8amBDpS", "htmlBody": "<p>(quoting from the open thread)</p>\n<blockquote>\n<p>The timber is sold after 10 years, conservative return to the investor is $20k</p>\n</blockquote>\n<blockquote>\n<p>This kind of investment would be considered high risk - this company only started this program three years ago, and the first trees haven't yet produced profit.</p>\n</blockquote>\n<p>This sounds extremely suspect. Conservative investments do not generate 23% CAGRs, and there are plenty of investors willing to fund credible 10 year projects. Timber was a particularly fashionable asset class for a while, and 'enviromental' investments are extremely fashionable right now.</p>\n<p>[This is an opinion and is for information purposes only.  It is not intended to be investment advice. You should consult a licensed financial advisor for investment advice. This is not the opinion of my firm. My firm may have positions in the discussed securities. This is not an invitation to buy or sell securities].</p>\n", "parentCommentId": null, "user": {"username": "Larks"}}, {"_id": "LythGE2Hrwc8WHzGc", "postedAt": "2018-07-12T01:09:06.133Z", "postId": "KnoWtbBtXB8amBDpS", "htmlBody": "<p>I'd also guess the social impact estimate would regress quite a long way to the mean if it was investigated to a similar level of depth as something like Cool Earth.</p>\n", "parentCommentId": "ahmiDNDBGjj8xdafv", "user": {"username": "Gregory_Lewis"}}, {"_id": "b4GGkFPZgHZpG24W7", "postedAt": "2018-07-12T03:04:22.736Z", "postId": "KnoWtbBtXB8amBDpS", "htmlBody": "<p>Unless you assign relatively high priority to the cause that is addressed by the company, I think it's appropriate to suppose that other impact investors are over-valuing the social impact. Also, since other impact investors don't think about counterfactuals, they are likely to greatly overestimate the social impact. They may think that when they invest $1000 in a different company, they are actually making that company $1000 richer on balance... when in reality it is only $100 or $10 or $1 richer in the long run, due to market efficiency. I don't think markets are generally inefficient, just a bit, sometimes, it really depends on how you define it.</p>\n", "parentCommentId": "Jxs2vjMPM9W89T5QA", "user": {"username": "kbog"}}, {"_id": "5PFNPWBcK2SPhnH2E", "postedAt": "2018-07-12T07:51:06.261Z", "postId": "KnoWtbBtXB8amBDpS", "htmlBody": "<p>This point about the cause is very important, since cause areas can have orders of magnitude difference in their impact.</p>\n<p>However, at times, it may be possible to invest in companies in high priority cause areas. See <a href=\"https://www.openphilanthropy.org/focus/us-policy/farm-animal-welfare/impossible-foods\">OPP's investment into Impossible Foods here</a></p>\n<p><a href=\"https://butcantheysuffer.wordpress.com/2018/03/01/initial-investigation-combined-impact-investing-fund-for-small-investors-into-plant-based-meat/\">I've written about this topic elsewhere</a>, to explore whether it would be worth EA Funds or another EA group setting up opportunities for smaller donors/investors to get involved in impact investing. I was focusing on clean meat and plant-based meat to reduce animal suffering, but briefly consider other cause areas in the piece. TLDR: there probably aren't good opportunities for doing this at the moment, but if the landscape changes and some areas become more funding constrained, then it could be a really useful intervention.</p>\n", "parentCommentId": "TBmYjRxtpKGQNzPLz", "user": {"username": "Jamie_Harris"}}, {"_id": "cEsNE8dvPYtwHRCZ7", "postedAt": "2018-07-12T08:10:48.111Z", "postId": "KnoWtbBtXB8amBDpS", "htmlBody": "<p>Thanks for exploring this topic! </p>\n<p>A few relevant links you might find useful, if you were unaware of any of them: </p>\n<p>1) There's an <a href=\"https://www.facebook.com/groups/590429401146494/\">EA FB group on the topic</a>, although unfortunately it's quite inactive</p>\n<p>2) Hauke Hillebrandt has <a href=\"http://effective-altruism.com/ea/1kx/a_generalized_strategy_of_mission_hedging/\">written</a> and <a href=\"https://www.youtube.com/watch?v=uepoRvgny54\">spoken</a> about EAs engagement with impact investing </p>\n<p>3) <a href=\"https://butcantheysuffer.wordpress.com/2018/03/01/initial-investigation-combined-impact-investing-fund-for-small-investors-into-plant-based-meat/\">My blog post</a> exploring whether it would be worth EA Funds or another EA group setting up opportunities for smaller donors/investors to get involved in impact investing. I was focusing on clean meat and plant-based meat to reduce animal suffering, but briefly consider other cause areas in the piece. TLDR: there probably aren't good opportunities for doing this at the moment, but if the landscape changes and some areas become more funding constrained, then it could be a really useful intervention.</p>\n<p>General thoughts:</p>\n<p>I think there are two main issues for EAs with regards to impact investing, if you come at it from a utilitarian perspective + want to maximise good.</p>\n<p>1) Is the social impact greater in total for the same amount of &quot;lost money&quot; in many impact investment opportunities? Through impact investing, in theory at least, you will be losing ROI compared to the market rate. This is equivalent to a donation. Could you do more good by donating directly? If so, then EAs don't need to consider impact investing.</p>\n<p>2) The practical issues. How do we manage this? As you note, smaller donors/investors can't invest themselves. Could we pool money together through an EA impact investing fund manager? </p>\n<p>I explore both ideas in my blog post linked above. If you come at the issue from a non-utilitarian perspective, then you might still value Socially Responsible Investing. </p>\n<p>Specific request / suggestion:</p>\n<p>I like the look at a particular investment option above. But I'm not following your opinion on how impact investment there might compare to donation to Cool Earth.\nSince an issue for EAs is the comparison (in social &quot;bang for your buck&quot; terms) between a direct donation to a charity and an impact investment (which will lose you money since it will have a lower ROI than the top of the market investments), it might be helpful to have a detailed model of an individual case study, which covers <em>estimates</em> on impact for the same amount of lost money, and the timescales involved.</p>\n", "parentCommentId": null, "user": {"username": "Jamie_Harris"}}, {"_id": "oFTL6QvucNTRdvwW8", "postedAt": "2018-07-13T21:43:51.950Z", "postId": "KnoWtbBtXB8amBDpS", "htmlBody": "<p>Hey Jamie, thanks for linking me up with those additional resources - it's a refreshing perspective on the topic after combing through so many non-EA articles.</p>\n<p>Continuing the conversation from your blog post on impact investing, I really like the perspective that the appeal of impact investing depends on how funding-constrained a cause or company is.  If they have no problem raising money for free or at low cost, they have no need to promise a high return.  Inversely, in a place where it is hard to raise capital, companies should be more willing to offer higher returns to attract investment.  For someone who is interested in this area, it may still be better to offer a donation rather than take the money, but if you think there are better causes then you could invest for medium good + high profit, then take the earnings to a cause with even better social utility.</p>\n<p>From your general thoughts:\n1) I'm trying to extrapolate this concept out to a general thought about donating vs investing in general.  The hard question looks something like this:</p>\n<p><em>If you compare your best cause/charity vs an index fund earning 7%, under what circumstances are you ambivalent between directing your money to either?</em></p>\n<p>I don't have an answer to that question for myself, but here is the sidestep:</p>\n<ul>\n<li><p>Finding either a better charity or a better investment opportunity aught to change your preference</p>\n</li>\n<li><p>If the market is efficient, and any social good tagged onto the investment would reduce the financial return, then you'd be wise not to invest in any impact investment whose social utility was worse than your best charity.</p>\n</li>\n<li><p>If you think markets are inefficient and it's possible earn greater than average returns (by skill), or if you think the charity market is inefficient (less worthy causes get more funding than your most worthy cause), then you'd theoretically be able to find impact investments that would benefit you.</p>\n</li>\n</ul>\n<p>2) I do think it would be really cool to have an EA themed impact fund.  Offer an investment vehicle that targets at-market returns while investing in particularly effective cause areas.  I'd set it up where the fund invested in securities that matched the preferences of the investors.  If half the investors really valued animal rights, 50% of the holdings would be in that area.  I wonder if any of the 250 EAs in the FB group have any expertise in setting up something like this...</p>\n<p>Re: Specific suggestions:\nI'm not super up on my knowledge of charity evaluations, but for climate change, it seems that the common currency is $/CO2 tonne.  For World Tree, the estimate looks like this:\n<em>1 acre costs $2500 CAD, and <a href=\"http://worldtreecop.com/carbon-offsets/\">sequesters 103 tonnes/year</a> (I wasn't able to find a third party # on this).  Lifespan of the trees is 50 years,  for a total of 5150 tonnes per acre.</em></p>\n<p>I'm having a bit of a rationality crisis here though; Halstead recently posted the new research on climate change charities, which found that the Coalition for Rainforest Nations can reduce carbon for an estimated <a href=\"https://founderspledge.com/research/Cause%20Report%20-%20Climate%20Change.pdf\">$0.12/tonne</a>.  Should I cancel my World Tree investment and additionally take out a loan to fund this initiative since it is so much more effective?  It's really tough being half a rationalist... I want to do good now but also good in the future.</p>\n<p>Next steps: figure out my own utility function, while searching for those sweet impact investments that the market has overlooked.</p>\n", "parentCommentId": "cEsNE8dvPYtwHRCZ7", "user": {"username": "Naryan"}}, {"_id": "PD6XagHPvhRKehezy", "postedAt": "2018-07-14T17:18:13.982Z", "postId": "KnoWtbBtXB8amBDpS", "htmlBody": "<p>I do want to share a cautionary tale about such investing: in the UK, there are tax-efficient investment vehicles called EISes and VCTs, which are designed to encourage investors to put money into somewhat risky early-stage UK businesses (and give big tax breaks as a result).</p>\n<p>At one point, there were renewable energy EIS/VCT funds which seemed to give excellent returns – but only because the companies involved were claiming substantial, risk-free government subsidies for renewables schemes (&quot;feed-in tariffs&quot;). Eventually <a href=\"https://www.ft.com/content/1ddd3e72-af83-11e3-a006-00144feab7de\">these schemes were scrapped</a>, as were feed-in tariffs.</p>\n<p>So an unwise impact investor might have put money into such a scheme, made a nice profit, and thought they were doing social good. In reality, the profits were just money taken from taxpayers (FITs were funded by making energy more expensive for all households), and impact (building inefficient, small-scale solar in a country where solar energy doesn't make much sense[1]) probably pretty minimal.</p>\n<p>[1] - Peak energy demand in the UK is in the winter when it's coldest and darkest, so solar is basically useless here. Compare that to California, where peak demand is when people switch on their A/C during the sunniest part of the day.</p>\n", "parentCommentId": null, "user": {"username": "HenryStanley"}}, {"_id": "6qbX6cnz2ycfsLH42", "postedAt": "2018-07-22T18:13:14.147Z", "postId": "KnoWtbBtXB8amBDpS", "htmlBody": "<p>Among the most significant confusions in investing is this: when you buy a stock for $10, you give up $10 now in exchange for some variable return in the future. Importantly, <em>the seller gets back $10 and gives up the same variable return in the future</em>. Both parties are happy with this trade (due to different preferences or beliefs about the world).</p>\n<p>This symmetry applies to the social impact too. The buyer gets a stock producing social impact. <em>The seller gives up a stock producing social impact.</em> It is unclear whether this transaction has affected the total social impact in the world at all. My understanding is that the section <em>A Rational Take on Investing</em> does not take this into account.</p>\n<p>The above paragraph is the typical second-order reasoning in this space, and is a more explicit version of a point kbog made.</p>\n<ul>\n<li><p>First-order: I claim credit for whatever good/bad things I'm associated with, thus impact investing counts for a lot.</p>\n</li>\n<li><p>Second-order: taking counterfactuals into account, impact investing appears to have approximately zero impact.</p>\n</li>\n<li><p>The interesting stuff: controlling or launching important startups, and shareholder activism in general, seems like it might do something, and can sometimes be targeted at the most promising cause areas. Plant-based meat alternative companies are the companies that I'm aware of that seem likely to be worth EA investors' attention for this reason. Maybe holding tobacco company shares in order to be able to more easily lobby them might be attractive for EAs focused on global health. Note that these activist approaches are entirely distinct from what most of the impact investing industry is doing.</p>\n</li>\n</ul>\n", "parentCommentId": null, "user": {"username": "Kit"}}, {"_id": "NjR9P6MWR8F2ffwAT", "postedAt": "2018-07-23T01:00:24.885Z", "postId": "KnoWtbBtXB8amBDpS", "htmlBody": "<p>There might be a further consideration, people might not start or fund impactful startups if there wasn't a good chance of getting investment. The initial investors (if not impact oriented), might still be counting on impact oriented people to buy the investment. So while each individual impact investor is not doing much in isolation, collectively they are creating a market for things that might not get funded otherwise. How you account for that I'm not sure.</p>\n", "parentCommentId": "6qbX6cnz2ycfsLH42", "user": {"username": "WillPearson"}}, {"_id": "nninJAE8Ywihtd3Dx", "postedAt": "2018-08-01T06:44:16.659Z", "postId": "KnoWtbBtXB8amBDpS", "htmlBody": "<blockquote>\n<p>One may be able to have counterfactual impact by accepting below market returns</p>\n</blockquote>\n<p>I think this is an important possibility. Some invested funds cannot be turned into donations, but there may be a chance of getting them invested in something with a social payoff.</p>\n", "parentCommentId": "9YqQAdjb5WbBc9vJA", "user": {"username": "ole_koksvik"}}, {"_id": "ZmyKZLMHnMXpdaRFF", "postedAt": "2018-08-02T16:30:44.073Z", "postId": "KnoWtbBtXB8amBDpS", "htmlBody": "<p>Great post!</p>\n<p>This is something I've considered quite a bit. </p>\n<p>My personal take is that if you can find the right impact investment, it would be much more effective than a non-profit because by the nature of their setup a non-profit can never exhibit exponential growth. I can't find the research but I saw something which showed that non-profit giving has been pretty much exactly x.y% across the board for many years and that pie rarely changes so EA in it's current form seems to be a lot about allocating that fixed amount of charity money to more effective charities which do the most good.</p>\n<p>What appeals to me about impact investing is that if you find the right product/service it should be able to not only grow without any future dollars but also scale exponentially after my initial investment. e.g. if I give $50k to a company which produces a meat alternative that supplants animal products and it takes off then theoretically it could grow into a business generating billions of dollars in revenue and subsequently making a huge dent in the reduction of greenhouse gases (fewer cows needed), reduced animal suffering, and depending on your perspective revolving meat consumption a potential for great individual health in the form of reduced cancer, etc.</p>\n<p>This is not necessarily a hypothetical because Beyond Meat and Impossible Burger are both growing massively and seem to be having an actual impact in reducing meat consumption (56% of their consumers are meat eaters who just like their food and are looking to reduce their consumption).</p>\n<p>Anyways, that's just one example but I think the same could be said for other arenas like solar, lumbering with sustainable practices etc.</p>\n<p>In terms of accessing these investments, unfortunately the majority require being an accredited investor but I assume there is a way to create a fund or non-profit which invests exclusively in these opportunities which could then be held to a similar standard as EA charities in terms of evaluating their potential impact.</p>\n", "parentCommentId": null, "user": {"username": "spendispencer"}}, {"_id": "efwvnex2qa72soMiL", "postedAt": "2018-08-12T19:24:30.170Z", "postId": "KnoWtbBtXB8amBDpS", "htmlBody": "<p>Thanks Naryan for starting this interesting discussion! My own two cents:</p>\n<p>-I attended a presentation organized by Valeurs Mobilières Desjardins about two years back on socially responsible investing (SRI). The upshot was that the research on this indicates that SRI investments perform comparably (neither better nor worse) to non-SRI investments in general. Assuming this applies to impact investment, and that the vast majority of EAs will invest part of the money they earn, it seems to me that as long as there are any positive social impacts from SRI and impact investment, these should be the default mode of investment of EAs, all else being equal... If so, this seems well worth discussing.</p>\n<p>-I didn’t fully get the distinction you make between SRI and impact investment. For instance, I’m part of the Ethical Investment Group <a href=\"http://www.gie-eig.ca\">http://www.gie-eig.ca</a> in Montreal. We’ve long been investing in individual companies we think of as having beneficial impact, as well as in community loans, etc (some of which are listed in the links you gave). I always thought of this as ethical or socially responsible investment. Which would you say it is? </p>\n", "parentCommentId": null, "user": {"username": "Huwelium"}}]