[{"_id": "utirDs5WdQBA6AdLx", "postedAt": "2023-05-05T18:26:40.929Z", "postId": "KnRcbttvkgmCvPvyn", "htmlBody": "<p>This is really sad and shocking. His family, colleagues, and students have my sincere condolences.</p><p>For people that didn't know him, one thing that stood out about him was his extreme generosity in helping students and junior colleagues. If you want to read some of their small tributes, the replies and quote tweets <a href=\"https://twitter.com/osupolisci/status/1653857431188029440\">here</a> are full of political scientists and others sharing stories. He will be deeply missed.</p>", "parentCommentId": null, "user": {"username": "ryancbriggs"}}, {"_id": "suGfvCHZs2yiZAB6A", "postedAt": "2023-05-06T08:26:23.991Z", "postId": "KnRcbttvkgmCvPvyn", "htmlBody": "<p>I noticed that the book and article you recommended were both less recent than the 80k appearance. Do you have any information about a recent project, paper, or appearance?</p>", "parentCommentId": null, "user": {"username": "trevorw96"}}, {"_id": "GnvkuCqMs3wA8X5nf", "postedAt": "2023-05-08T15:42:43.598Z", "postId": "KnRcbttvkgmCvPvyn", "htmlBody": "<p>It's sad to think how much this will set back the research agenda he was a part of. Sometimes one researcher really can move forward a field.</p>\n<p>Bear will be missed by many including me.</p>\n", "parentCommentId": null, "user": {"username": "Robert_Wiblin"}}, {"_id": "EpE7ft4EkB23D2duQ", "postedAt": "2023-05-25T08:54:57.514Z", "postId": "KnRcbttvkgmCvPvyn", "htmlBody": "<p>&nbsp; &nbsp; &nbsp;Bear was a close friend of my brother (Dave) from high school or before and they remained in touch. &nbsp;He was a joyful, warm person from the start. &nbsp; His open friendliness made me feel I knew him well, disproportionate, to the time actually spent with him (which was quite little, my being 6 years older than my brother, and it has been quite some time). &nbsp;&nbsp;</p><p>&nbsp; &nbsp; &nbsp; I teach history in a public university. &nbsp;Some 18 years ago or so, Dave relayed that Bear saw a dramatic decrease in students’ plagiarism after he announced he was using a plagiarism detector. &nbsp;I've used one ever since, but never passed back my thanks to Bear for its benefits.&nbsp;</p><p>&nbsp; &nbsp; &nbsp; I imagine most people finding this page join me in never having known another Bear. &nbsp;But my second child struck me at 3 days old as needing a fitting nickname for her evidently outsized (and beguiling) personality. &nbsp;I'm sure I wouldn't have called my daughter, now 23, \"Stella-Bear\" from that day to this if Bear B had not been so cherished.&nbsp;</p><p>&nbsp; &nbsp; It seems terribly unfair that his family has lost him, and, as has been said, the world has lost an extremely important voice.</p>", "parentCommentId": null, "user": {"username": "ElizabHovey"}}]