[{"_id": "zBKdsfNfY6Mq7ZkKK", "postedAt": "2023-04-29T07:52:45.999Z", "postId": "Kp4J2PS8u8jtc3xkH", "htmlBody": "<p>When I began writing in the EA forum I was often told that I was unclear, but this is because there is “rationalistic style” that in my view is not conductive to understanding, but to the signaling of community belonging.</p>\n", "parentCommentId": null, "user": {"username": "Arturo Macias"}}, {"_id": "GWfqByBmNCYaSFFnC", "postedAt": "2023-04-29T08:37:40.947Z", "postId": "Kp4J2PS8u8jtc3xkH", "htmlBody": "<p>I think a lot of people have become complacent within their EA/rationalist bubbles, and have forgotten that communication requires meeting people halfway and adjusting your language to the audience.&nbsp;</p><p>All the useful information or important people in the world are not confined to our tiny subcultures. If you want to make an impact, you have to talk to the outside world, and not dismiss people out of hand.&nbsp;</p>", "parentCommentId": null, "user": {"username": "titotal"}}, {"_id": "HCApXtLZLXDEgdGG3", "postedAt": "2023-04-29T17:19:45.141Z", "postId": "Kp4J2PS8u8jtc3xkH", "htmlBody": "<blockquote>\n<p>This helps people \"parse\" your</p>\n</blockquote>\n<p>Just a note, this sentence is unfinished</p>\n", "parentCommentId": null, "user": {"username": "ElliotJDavies"}}, {"_id": "33dpPFfN6XnLFHxT3", "postedAt": "2023-04-29T17:53:33.381Z", "postId": "Kp4J2PS8u8jtc3xkH", "htmlBody": "<p>Nicholas - yes; strongly upvoted.</p><p>The debate over AI risk went mainstream in the last few weeks. It's suddenly within the Overton window (the set of things considered reputable to discuss and believe in public).&nbsp;</p><p>This means we all need to raise our game in terms of public communication -- especially around the topic of AI alignment and risks.</p><p>As you imply, this isn't just a matter of building better communication skills (simplicity, clarity, logic, links, vividness, reading Pinker's book, etc) -- crucial though those are. It's also a matter of embracing broader public communication values -- e.g. respect for the audience's time, good will, and ability to contribute to the conversation, and respect for their varying levels of knowledge, backgrounds, levels of fatigue, distraction, and mood, neurodiversity, etc.</p><p>This is a crucial time when the EA, Rationalist, and X risk communities either make a positive &amp; decisive impact on the public discourse -- or when we confuse, alienate, and aggravate people.&nbsp;</p><p>One good heuristic when communicating on social media is to try to cultivate more self-aware about which technical terms, arguments, and writing styles are more intended to do status-signaling and virtue-signaling for one's ingroup (e.g. other EAs), versus which are actually intended to communicate effectively with ordinary folks outside the ingroup. Almost always, there's a tradeoff. What's impressive to our EA peers typically won't be persuasive outside EA. And what's persuasive to normies on Twitter won't be impressive to our EA peers.&nbsp;</p><p>We have to be willing to bite the bullet on this latter point. When AI risk suddenly comes into public consciousness, and we have a time-limited opportunity to shape the public discourse in helpful directions, is <i>not</i> the time to try to build one's status and prestige within the movement by showing off how many obscure AI alignment terms one happens to know, or how clever a philosophical critique one can offer of some LessWrong post.</p>", "parentCommentId": null, "user": {"username": "geoffreymiller"}}, {"_id": "LvvEkoppNMMmysrvs", "postedAt": "2023-04-29T19:31:47.930Z", "postId": "Kp4J2PS8u8jtc3xkH", "htmlBody": "<p>Thank you! Another person pointed this out on LW.</p>\n", "parentCommentId": "HCApXtLZLXDEgdGG3", "user": {"username": "NicholasKross"}}, {"_id": "ndTCuFKnEtbLjLJNR", "postedAt": "2023-05-01T02:45:17.006Z", "postId": "Kp4J2PS8u8jtc3xkH", "htmlBody": "<p>Strongly agreed! The quote that springs to mind is, \"The critic hates most what he would have done himself if he had had the guts\" - Steven Pressfield.<br><br>I'm close to releasing a new EA research communications video, and I hope it embodies some of these great ideas!</p>", "parentCommentId": null, "user": {"username": "Christian Pearson"}}, {"_id": "ctg6dfHhLuDQ7mqYJ", "postedAt": "2023-05-01T07:27:49.380Z", "postId": "Kp4J2PS8u8jtc3xkH", "htmlBody": "<p>This post would benefit from heeding its own advice to \"Repeat your main points. Summarize your main points. Use section headers and bullet points and numbered lists. Color-highlight and number-subscript the same word when it's used in different contexts (\"apple1 is not apple2\").\"</p>\n<p>In particular, in this post is no clear summary or conclusion and the most concrete action (a list of suggestions) is somewhat buried in the middle and not referred to in the rest of the post. That list could have bullet points or numbers to make it clearer.</p>\n", "parentCommentId": null, "user": {"username": "jooke"}}, {"_id": "tk8uMCSQgzqnuj9xz", "postedAt": "2023-05-01T22:47:33.426Z", "postId": "Kp4J2PS8u8jtc3xkH", "htmlBody": "<p>Good points, thanks! (Mainly the list part)</p>\n", "parentCommentId": "ctg6dfHhLuDQ7mqYJ", "user": {"username": "NicholasKross"}}]