[{"_id": "wnrPuui9f7fAgMKvu", "postedAt": "2022-12-13T12:20:09.816Z", "postId": "KphWqKCJEybZRBZuh", "htmlBody": "<p>Hi Kynan thanks for writing this post.<br><br>&nbsp;It is great to see other people looking into more rigorous community building work! I really like the objective and methodology you set out, and do think that there are currently huge inefficiencies and loss in how information is currently transferred between groups.<br><br>I think one thing I am worried about with doing this on a large scale is the loss of qualitative nuance behind quantitative data. It seems difficult to really develop good models of why things work and what the key factors to consider are, without actually visiting groups or taking the time to properly understand the culture and people there. &nbsp;I would guess that processing the raw numbers are useful for being able to roll out products/outreach methods that are better in expectation better than current methods, but I would still expect there to be lots of variance in outcomes without developing a richer model that groups can then adapt.&nbsp;<br><br>I am one of the full-time organisers of EA Oxford and am currently looking at doing some better coordination and community building research with other full-time organisers in England. I would be keen to chat if you would like to talk more about this!<br>&nbsp;</p>", "parentCommentId": null, "user": {"username": "CEvans"}}, {"_id": "5EQ8zDXX6g72CcjkX", "postedAt": "2022-12-15T16:30:41.768Z", "postId": "KphWqKCJEybZRBZuh", "htmlBody": "<p>Agreed on all points. An important consideration is heavily involving group leaders and organisers in this process to preserve the qualitative aspects of 'what works' in outreach. Keeping those involved with implementing the methods engaged throughout the research process is vital for ensuring these methods transfer into the real world. Whilst some of the nuances are inevitably going to be lost through large-scale testing, we can counteract this by knowing where to allow room for flexibility and where rigidity is worthwhile.<br><br>I'll be in touch, thanks!</p>", "parentCommentId": "wnrPuui9f7fAgMKvu", "user": {"username": "Kynan Behan"}}, {"_id": "xzgaugaZd3MgFi778", "postedAt": "2023-01-14T15:28:52.139Z", "postId": "KphWqKCJEybZRBZuh", "htmlBody": "<p>Thanks for the post and interested to see the results! Is EAMT considering doing a similar future project with professionals? My current sense is that we have, as a community, a far weaker model of what works for outreach and retention amount professionals than students. Feel free to reach out if you’d be interested in discussing further.</p>\n", "parentCommentId": null, "user": {"username": "SarahPomeranz"}}, {"_id": "WJgDAuZXp8kmyD5jt", "postedAt": "2023-04-27T13:42:49.518Z", "postId": "KphWqKCJEybZRBZuh", "htmlBody": "<p>Thanks Sarah, I would be interested in this. We have already established connections with local groups, not just limited to the university ones, and they could be included in this research.</p>\n<p>There might be a case to make that  outreach and  retention among professionals, whether associated with a group or not, could be even more valuable. This is an area that has not been explored much. I have talked about this with HIP, but it would be great to have someone who can take the lead or co-lead this project and focus on it more.</p>\n", "parentCommentId": "xzgaugaZd3MgFi778", "user": {"username": "david_reinstein"}}, {"_id": "oCetSRj639L4dqqf2", "postedAt": "2023-04-27T13:49:43.126Z", "postId": "KphWqKCJEybZRBZuh", "htmlBody": "<p>Thanks for being in touch (and I enjoyed our conversation).</p>\n<p>One thing to note is that some of the trials we are considering could be considered trials in 'what general paths and approaches to recommend', rather than narrowly-defined specific scripts.</p>\n<p>E.g., \"reach out to a broad group of students\" vs \"focus on a small number of likely high-potential students.\" This could be operationalized, e.g., through which 'paths to involvement' (through fellowship completion or through attending meetings and events), or through 'which courses/majors to reach out to'.</p>\n<p>However, every university group could still have  the flexibility to adopt the recommended guidelines in a manner that aligns with their unique culture and surroundings.</p>\n<p>We could then try to focus on some generally agreed  'aggregate outcome measures'. This could then be considered a test of  'which recommended general approach works better' (or, if we can have subgroup analysis, 'which works better where'.</p>\n", "parentCommentId": "wnrPuui9f7fAgMKvu", "user": {"username": "david_reinstein"}}]