[{"_id": "sJHdbfFDdgh87CjHP", "postedAt": "2024-01-08T09:17:23.082Z", "postId": "KqTH5Yvxv3LbvcQz2", "htmlBody": "<p>Good post, aligns with a lot of my (anecodtal) expreience in a related but different field (biostatistics, still doing computational work but not ML and much more mature as a field).</p>\n<p>Under communication: I think your missing actively reading papers (or listening to presentations). Each time you read a paper, ask yourself if it was easy to understand the idea, why or why not? A big problem in reasearch writing IMO is that the reader often is not reading the paper for the main reason you wrote it. Perhaps they care more about your methodology than your results, so they can apply it in a different context. Or their most interested in some implications or secondary result, which you didn't elucidate or explain as clearly. I think this part is hard and I don't have good ideas beyond release data* (where possible / ethical) and intermediatory results (for example, your trained model*) to allow secondary analyses.</p>\n<ul>\n<li>Caveat: ethics, privacy, open-sourcing model weights might be bad, legal, etc. mean this isn't always net-positive. I guess it is for the vast majority of research.</li>\n</ul>\n", "parentCommentId": null, "user": {"username": "jooke"}}, {"_id": "bNcvJcAnvDdxneCN5", "postedAt": "2024-01-08T14:32:47.031Z", "postId": "KqTH5Yvxv3LbvcQz2", "htmlBody": "<p><strong>Executive summary</strong>: Research involves navigating large spaces of hypotheses and experiments. Success requires research taste to hone in on promising ideas, avoiding uninformative directions; sufficient paranoia to avoid overinterpreting evidence; and communication skills to transfer knowledge.</p><p><strong>Key points</strong>:</p><ol><li>Research taste helps prune large spaces of possibilities and select informative hypotheses and experiments. It develops through seeing lots of evidence about what works.</li><li>Avoid jumping to conclusions by thinking creatively about how your evidence could be misleading. Peer review helps instill needed paranoia.</li><li>Communication transfers research ideas and multiplies impact. Precision and explaining intuitions are key challenges.</li><li>Motivation matters with uncertain feedback. Collaborating provides support and more brains.</li><li>Log everything to enable future analyses. Tolerate stupid questions. Prioritize informative experiments over what's easiest.</li><li>Iterate rapidly to accelerate learning. Balance shipping with thoughtfulness.</li></ol><p>&nbsp;</p><p>&nbsp;</p><p><i>This comment was auto-generated by the EA Forum Team. Feel free to point out issues with this summary by replying to the comment, and</i><a href=\"https://forum.effectivealtruism.org/contact\"><i>&nbsp;<u>contact us</u></i></a><i> if you have feedback.</i></p>", "parentCommentId": null, "user": {"username": "SummaryBot"}}]