[{"_id": "xPLr68AQsqEKXazRc", "postedAt": "2022-12-07T05:51:25.933Z", "postId": "KsN4BL39zZAYByXGg", "htmlBody": "<p>Thanks so much for this (I'm in Uganda). Love hearing from Africans on the EA forum nice one!<br><br>I love the idea of phages, and I hope they can become a useful antimicrobial agent in time. &nbsp;Unfortunately though I'm not sure it's worth focusing on things like phage banks, until phages are proven to be useful as an antimicrobial agent in the general population.</p><p>Also tragic as it is, I sadly don't have confidence that investing in phage research within Africa will yield fruit. I could be wrong about this, but north of South Africa there have been very few meaningful biomedical innovations come out of any country. I can't think of any vaccine, medication or test which has been innovated &nbsp;This may be due to a range of factors like poor education systems, poor infrastructure and most importantly I think horrendous beauracracies which stifle talent like yours and have no agility.&nbsp;</p><p>In saying that, if something was going to work it would more likely be a smaller \"cottage\" type project like yours. I think that's why Tech innovators in Africa have so many amazing achievements, because they can innovate alone and in small groups, without needing the infrastructure and beuracratic support needed by biomedical researches.&nbsp;</p><p>Anyway I love the idea, nice one!</p>", "parentCommentId": null, "user": {"username": "NickLaing"}}, {"_id": "MbJRNZakfQHSQsTCT", "postedAt": "2022-12-07T21:07:41.337Z", "postId": "KsN4BL39zZAYByXGg", "htmlBody": "<p>Thanks, NickLaing for your kind words.&nbsp;</p><p>I have a different view about the success of phage therapy in Africa. It may interest you to know that this has gained traction lately. In 2020, along with other phage researchers in Kenya and Uganda, we formed the<a href=\"https://apf.phage.directory/\"> Africa Phage forum</a> (APF). APF has done considerably well in driving phage research in Africa, you can find our latest pre-print<a href=\"https://www.preprints.org/manuscript/202201.0345/v1\"> here</a>.&nbsp;</p><p>&nbsp;</p><p>Are phages worth researching in Africa? Are Phage banks worth the investment? Will it yield fruit?&nbsp;</p><p>During the COVID-19 pandemic, we waited for the west to spare us some vaccines. &nbsp; The narrative has to change, we need to prepare for pandemics, and we need to have the capacity to tackle our problems. Antimicrobial resistance is a huge problem in Africa and Africa must lead in her own battle. APF has been systematic, currently, Nigeria and Kenya are working towards formulating a framework for Phage therapy adoption. In a sense its yields fruit. Hopefully, with the right funding and support, Nigeria will treat her first patient with Phages next year(I am working hard to get this done. Clinicians in Nigeria are being sensitized to adopt phages. &nbsp;In Kenya, Phages have been formulated for Salmonellosis in poultry, field trials start next year.&nbsp;</p><p>&nbsp;</p><p>Do we need a phage bank in Africa?</p><p>Yes! A phage bank in Africa is not only for Africa. In Australia, they treated a patient with phages from phages isolated and banked in Israel. We need phages across the world. This will guarantee phage effectiveness across the globe. What will a phage bank achieve, aside from storing phages, a phage bank will solve the infrastructure problem associated with research in Africa. A lab that can isolate, characterize, sequence and store phages will surely meet the global standards needed for phage innovation.</p><p>&nbsp;</p><p>\"I can't think of any vaccine, medication or test which has been innovated &nbsp;This may be due to a range of factors like poor education systems, poor infrastructure and most importantly I think horrendous beauracracies which stifle talent like yours and have no agility. \"</p><p>&nbsp;</p><p>Sadly yes, I have been looking for funding for my lab, it's been almost so difficult securing such funds. However, I am hopeful. My long-term goal is to reverse this trend. Get phage therapy to solve common problems. My PhD student currently works on formulating phages for the treatment of Typhoid fever as well as a water treatment solution(Phagebased). &nbsp;Wish me well to get funded soon. &nbsp;The infrastructure issue should be taken seriously. &nbsp;</p>", "parentCommentId": "xPLr68AQsqEKXazRc", "user": {"username": "emmannaemeka"}}]