[{"_id": "9sga5bQ4cDoAQTzWr", "postedAt": "2023-08-18T01:49:04.989Z", "postId": "KT2Cc3fY3WfhLFRj4", "htmlBody": "<p><strong>Three well-intentioned critiques of improving agricultural productivity in Sub-Saharan Africa as a poverty intervention:</strong></p><ul><li><strong>Income from smallholder cereal farming has a low ceiling (as noted by Hannah): </strong>the average maize farmer in Malawi (<a href=\"https://ourworldindata.org/grapher/maize-yields\">2.6 tonnes/hectare</a> and <a href=\"https://blogs.worldbank.org/africacan/amid-global-food-crisis-commercial-small-farmers-offer-hope-malawi\">0.7 hectares</a>) will earn an extra 4.9 USD per day (for the whole family) if they triple their yields (assuming zero costs<i><strong> </strong></i>for accessing required seeds, labour, fertilizers, pesticides, irrigation, credit and government farm-gate price of <a href=\"https://www.tridge.com/insights/government-set-new-minimum-farmgate-prices-for-2023-harvest-season-maize-soya-beans\">0.49 USD per kg</a> of maize)</li><li><strong>Pursuing higher yields can increase risk for farmers: </strong>higher yields generally require more investment (and credit can be <a href=\"https://www.aeaweb.org/articles?id=10.1257/jep.21.1.141\">very expensive</a> for smallholder farmers). This makes crop failures even more harmful for poor farmers, and climate change makes crop failures more likely.</li><li><strong>Commercial productivity metrics neglect other (perhaps much larger) benefits of smallholder farming: </strong>rural poor people often value their farms for resilience more than revenue (such as subsistence, housing, balanced nutrition, culture/lifestyle, income diversification, backup asset). In view of this, many smallholder farming families might be uninterested or harmed by interventions to aggregate farms for higher agricultural productivity.</li></ul><p>Perhaps a more effective cause framing would be around creating <i><strong>off-farm</strong></i> income/resilience opportunities for farmers in Sub-Saharan Africa? This might improve incomes while indirectly improving agricultural productivity (as farms naturally become bigger and more productive with marginal farmers proactively move away from farming)</p><p>I was still excited to see this podcast episode as carefully-targeted agricultural interventions can be really beneficial across many areas (food security, poverty, emissions reductions etc) and seem neglected by EA community (from my perspective). I'd be very happy to informally support anyone working on this (I'm a PhD student specializing in scalable farmer communication and Nitrogen productivity of rice farms in South Asia)</p>", "parentCommentId": null, "user": {"username": "Sam_Coggins"}}]