[{"_id": "uzjrbCdPtyNmCM3Pw", "postedAt": "2023-11-06T12:37:38.762Z", "postId": "Kt4wLHXLh8PBAyDbe", "htmlBody": "<blockquote>\n<p>Our friends estimate the cost at about $258 billion dollars to end extreme poverty for a year, and point out that this is a small portion of yearly philanthropic spending or [...]</p>\n</blockquote>\n<p>Is that true?</p>\n<p>Just ballparking this based on fractions of GDP given to charitable organisations (big overestimate imo), I get global giving at ~500bn/year. So I don't believe this is true</p>\n", "parentCommentId": null, "user": {"username": "Simon_M"}}, {"_id": "CXomBSHv5jfG2vfCT", "postedAt": "2023-11-06T12:50:24.978Z", "postId": "Kt4wLHXLh8PBAyDbe", "htmlBody": "<p>You're right, I shouldn't have taken them at their word there, it's probably not a small portion of philanthropic spending. US phil spending is about 500 billion per year, and the US has the highest spending as % of GDP. Can't find sources for total worldwide spending online, but if I had to guess, it's about 1.5 trillion, in which case the named figure is some 20-ish percent of the total.</p><p>Will edit post.</p>", "parentCommentId": "uzjrbCdPtyNmCM3Pw", "user": {"username": "Alexander de Vries"}}, {"_id": "kGMaFNEHmN7GJMSTG", "postedAt": "2023-11-06T12:52:41.952Z", "postId": "Kt4wLHXLh8PBAyDbe", "htmlBody": "<p>Sorry, I edited while you posted. I see US as 1.44% * 27tn = ~400bn, which is the vast majority of charitable giving when I add in the rest of the countries Wikipedia lists and interpolate based on location for other biggish economies</p>\n", "parentCommentId": "CXomBSHv5jfG2vfCT", "user": {"username": "Simon_M"}}, {"_id": "Sv2sEnGGzHven8sfX", "postedAt": "2023-11-06T13:55:29.985Z", "postId": "Kt4wLHXLh8PBAyDbe", "htmlBody": "<p>Thank you for saving me the time of writing this myself!</p>", "parentCommentId": null, "user": {"username": "Larks"}}, {"_id": "bHJyzqhfsoggdFwad", "postedAt": "2023-11-06T16:52:33.007Z", "postId": "Kt4wLHXLh8PBAyDbe", "htmlBody": "<p>I have worked in the field in rural Africa on projects for almost 30 years, and from my experience you seem to be missing a pretty huge factor in your argument that there is insufficient evidence that the annual cost of extreme poverty reduction through cash transfers would decline over time.&nbsp;</p><p>I don't quite understand how your argument can ignore household capital accumulation?</p><p>A portion of the $100 billion per year that the poor recipients would receive would be spent on durable goods and productive assets that raise the standard of living to some degree for several years for the beneficiary households. &nbsp;Say each year 25% of money is spent on durable goods and assets that have a lasting effect of three years. &nbsp;Then the first year, you need $100 billion, but the next year, you need only $75 billion, and then year after that you need only 0.75 x 75 = &nbsp;$56 billion ... &nbsp;One could of course build a much better conceptual model and estimation of this, but any durable goods and productive asset investments by beneficiaries should decrease the need for future cash transfers.</p><p>And there are many investments that people make in rural Africa that have very long, durable effects: sending kids to school, cement floors, durable metal roofs, buying a motorcycle to replace your bicycle, a mechanical irrigation pump so you can grow crops in the dry season and increase agricultural income.&nbsp;</p><p>In order NOT to have a fairly rapid decrease in the amount of annual cash transfers (i.e. the hypothesis of your post), you would have to have only a very small amount of the cash transfers spent on productive or durable assets that last two to several years.&nbsp;</p><p>I think the studies have satisfied a very high burden of proof with respect to showing that a substantial portion of the cash transfers are spent on durable and productive assets and that there exists a multi-year positive impact.&nbsp;</p><p>I think that now the burden of proof is on you to show or demonstrate how spending on productive and durable assets would not lead to capital accumulation that would decrease the cost of maintaining a certain minimum standard of living in subsequent years. &nbsp;I don't think you have shown that yet in your post.&nbsp;</p><p>If a portion of income is spent on something that has a positive return, then that positive return needs to be subtracted from the income subsidy for the following year that is needed to maintain the minimum income level. But maybe I am I missing something in this logic?</p><p>In the course of my work over the past 30 years, I have talked to hundreds of rural African households about their finances and economics. When they get more money, they spend some on consumption, but they also invest. Very low-income households in rural Africa also have many very small investment opportunities that have payback times of months, not years. The investments they make can give them a return which increases income over the next year of which they take a portion of the surplus and invest again. &nbsp;This becomes household equity that is used to sustain a long-term increase in household income. When you visit villages in Africa over many years, you see the dynamic of increased durable infrastructure and household financial equity over time: Dirt floors change to cement floors, mud walls become brick walls, thatch roofs become metal roofs, kids playing in the dirt become kids going to school, people who used to have to walk everywhere are able to ride motorcycle or minivan.&nbsp;</p><p>Perhaps this comment is useful to you. Or maybe I am missing something and you can enlighten me as to why household asset accumulation would not necessarily decrease the cost of a global cash transfer program that is meant to eliminate extreme poverty at large scale.</p>", "parentCommentId": null, "user": {"username": "Robert Van Buskirk"}}, {"_id": "pFjjHEAqTeYrwdM7K", "postedAt": "2023-11-06T17:06:59.896Z", "postId": "Kt4wLHXLh8PBAyDbe", "htmlBody": "<blockquote>\n<p>which is entirely correct and appropriate but still somehow annoying.</p>\n</blockquote>\n<p>Haha. Love this.</p>\n<p>Great post overall. Appreciate you sharing.</p>\n", "parentCommentId": null, "user": {"username": "Yarrow Bouchard"}}, {"_id": "pPg6Ds7bGfmG4HXte", "postedAt": "2023-11-06T17:20:29.643Z", "postId": "Kt4wLHXLh8PBAyDbe", "htmlBody": "<p>Thanks for bringing your considerable expertise here! To be clear, my contention was that GiveDirectly hasn't shown this, not that the evidence doesn't exist. If they had made something like your comment, I would never have written this post in the first place.</p>\n<p>That said, to engage with what you're saying:</p>\n<p>-Many durable goods <em>are</em> a permanent or long-term increase in quality of life (like the metal roofs and cement floors you mentioned) without bringing an increase in productive capacity. Those goods are important in their own right, but don't support the claim made.</p>\n<p>-Here I'm really going out of my knowledge zone, but based on what I currently know, I'm skeptical that kids going to school more in developing countries has a large total effect. The main reason I'm worried about this is that I've seen too many studies where it turns out that most of the teachers aren't showing up at these schools, or the kids can't actually write simple words by age 10, that kind of stuff. This opinion is lightly held because I'm not very familiar with the literature here.</p>\n<p>-I do believe <em>some</em> poverty traps exist, and there is probably a long-term effect of cash transfers, mostly through investments like those you described. I just think the effect is likely small to medium.</p>\n<p>The main reason I feel like I can make some of these statements with reasonable confidence (besides my econ background) is that, well, anyone can interpret a randomized controlled trial. And the few randomized controlled trials done show mixed to no effects, over the long term. More data coming in a few years though!</p>\n", "parentCommentId": "bHJyzqhfsoggdFwad", "user": {"username": "Alexander de Vries"}}, {"_id": "HxMXtSZkDj4PCyH5x", "postedAt": "2023-11-06T17:35:43.315Z", "postId": "Kt4wLHXLh8PBAyDbe", "htmlBody": "<p>Thank you :)</p>\n", "parentCommentId": "pFjjHEAqTeYrwdM7K", "user": {"username": "Alexander de Vries"}}, {"_id": "qvCftbSQ233J2ZFwh", "postedAt": "2023-11-06T21:24:23.501Z", "postId": "Kt4wLHXLh8PBAyDbe", "htmlBody": "<p>You claim that investments that improve the quality of services consumed (such as cement floors, brick walls and metal roofs) are not \"productive investments\" and do not produce a long-term improvement in income.&nbsp;</p><p>This is our key point of disagreement. I disagree with your claim. &nbsp;We can agree to disagree.&nbsp;</p><p>I think we are disagreeing on how income/poverty is properly measured.&nbsp;</p><p>In my work in low-income developing country conditions the most relevant measurement of income is \"consumption income\" the value of the goods and services that people consume.&nbsp;</p><p>Where I work, it is common for 1/3 to 1/2 of household consumption to be self-produced: i.e. generated with no cash income, and no cash expenditure.&nbsp;</p><p>In these conditions, an investment in improved housing does produce a long-term increase in <i>consumption</i> income because it increases the value of the housing services that the family is consuming over many years with no further cash expenditure. It is a one-time cash expenditure and a long-term consumption income increase.&nbsp;</p><p>Increasing consumption income is what households in rural Africa see as real, tangible poverty reduction.&nbsp;</p><p>I agree that GiveDirectly did not support its claims in ways that certain people can find convincing. Because many people in richer countries live in places where most consumption has an associated financial transaction, and many folks do not have familiarity with living in a subsistence economy that can enable an intuitive understanding of un-monetized production and consumption economics.&nbsp;</p><p>But for those who do spend time working in the practice of improving rural African household economic conditions, GiveDirectly's claims seem well-supported because in rural Africa it is very common for people to make cash expenditures to increase consumption income over the long term. People like me consider such improvements in housing and infrastructure as productive investments even if they produce benefits that are not monetized.&nbsp;</p><p>GiveDirectly has shown that the impact of cash transfers are multi-year, and if the benefit lasts more than one year, then the cash transfer in an subsequent year can be less than the cash transfer in the previous year to maintain a household above the extreme poverty threshold. &nbsp;Thus, IMHO, GiveDirectly has shown what it needs to show to make the claim that cash transfers likely can decrease year-over-year to maintain incomes above the extreme poverty threshold in a larger scale program.&nbsp;</p>", "parentCommentId": "pPg6Ds7bGfmG4HXte", "user": {"username": "Robert Van Buskirk"}}, {"_id": "6ajNGv2iSkrNkDYmE", "postedAt": "2023-11-07T08:14:43.970Z", "postId": "Kt4wLHXLh8PBAyDbe", "htmlBody": "<p>Great point, I hadn't thought of it that way. Indeed, if you consider \"increase in de facto consumption income over the next 4 years\" to be a production increase (which I now agree is a reasonable point of view to take), then the long term effects on production are positive. I need to think more about how exactly that works out, but you've possibly convinced me of this.</p>\n<p>My remaining point of contention, then, is that you say this argument isn't intuitive to those without experience in the field, which is true, but GiveDirectly didn't even try to make it! The only argument they affirmatively used to support their big claim was pointing vaguely at the Eggers (2022) spillovers study, which has general equilibrium models and economic slack as its focus, saying very little about durable consumption goods at all. So if GD wants to explain their reasoning to anyone, they should do it more like you did, and IMO a\nfull analysis of multiple pages would be not just worthwhile but necessary.</p>\n", "parentCommentId": "qvCftbSQ233J2ZFwh", "user": {"username": "Alexander de Vries"}}, {"_id": "AWzhQf5nmrmAcLrCH", "postedAt": "2023-11-07T18:39:24.180Z", "postId": "Kt4wLHXLh8PBAyDbe", "htmlBody": "<p>I completely agree that GiveDirectly could explain this a hell of a lot better. I suspect that their team has a diversity of points of view and this prevents them from committing to a more concrete explanation like what I presented. &nbsp;I explained the capital accumulation in terms of what I see when I visit actual households: someone starts with mud walls and a thatch roof, then they take their surplus and build a bigger house with concrete floors, brick walls and metal roof, move into that and then they can buy nicer furniture because dirt isn't falling down from the thatch roof all of the time. &nbsp;They have obviously invested in higher productivity housing services which increases their consumption income. &nbsp;But this evidence is anecdotal.&nbsp;</p><p>I think GiveDirectly tried to anecdotally explain how cash transfers get invested with their shop example in the video. But again, I totally agree that their explanation has holes that make it hard for people who don't already agree with them to have the explanation that they need to understand why cash transfer requirements are likely to decrease substantially over time.&nbsp;</p>", "parentCommentId": "6ajNGv2iSkrNkDYmE", "user": {"username": "Robert Van Buskirk"}}, {"_id": "LHFrpvH9Qi7AyK6md", "postedAt": "2023-11-06T13:03:18.682Z", "postId": "Kt4wLHXLh8PBAyDbe", "htmlBody": null, "parentCommentId": "kGMaFNEHmN7GJMSTG", "user": null}]