[{"_id": "WwxbqvDj24vxMAGpc", "postedAt": "2023-05-01T15:20:39.487Z", "postId": "KTsaZ69Ctkuw6n4tu", "htmlBody": "<p>I think I’ve said it elsewhere, but it might make sense to get a group of smart, young EA’s with diverse views and ask them to think through how they’d design EA if they could design it from the ground up. Then again, maybe this is only the kind of thing that can only be success if it happens organically.</p>\n", "parentCommentId": null, "user": {"username": "casebash"}}, {"_id": "BAff9goqBT6ReFHSk", "postedAt": "2023-05-03T18:11:18.086Z", "postId": "KTsaZ69Ctkuw6n4tu", "htmlBody": "<p>I'm confused as to why CEA is doing a \"governance reform\" project when it is probably badly in need of some governance reform itself, and in any case it does not control the supply of funds to the EA community. OpenPhil does, and is more or less the sole funder (RIP FTX, sadly). If OpenPhil wants to see change it has all the tools it needs to make it happen.</p>", "parentCommentId": null, "user": {"username": "Sol3:2"}}, {"_id": "p6B3bTirppFCEWkCH", "postedAt": "2023-05-07T12:44:20.323Z", "postId": "KTsaZ69Ctkuw6n4tu", "htmlBody": "<p>I would not call it a project but I am working very slowly (due to limited bandwidth) at trying to better understand what the EA community thinks about recent diversity issues. I focus especially on what white males think. The purpose is to better inform any future D&amp;I initiatives.</p>\n", "parentCommentId": null, "user": {"username": "Ulrik Horn"}}, {"_id": "CoD47Ke5khesDgSA8", "postedAt": "2023-07-07T23:14:22.468Z", "postId": "KTsaZ69Ctkuw6n4tu", "htmlBody": "<p>Thanks for collecting this! Minor comment: your link for Owen Cotton-Barratt is wrong, I think.</p>", "parentCommentId": null, "user": {"username": "Ben_West"}}, {"_id": "5oDemmnN2jAdvCg8A", "postedAt": "2023-07-11T11:04:13.054Z", "postId": "KTsaZ69Ctkuw6n4tu", "htmlBody": "<p>Thank you, edited!</p>", "parentCommentId": "CoD47Ke5khesDgSA8", "user": {"username": "Joris P"}}]