[{"_id": "cynhvN7kwcmgxHE2C", "postedAt": "2023-10-06T19:09:07.962Z", "postId": "KuByzfn6yiKMWBKmr", "htmlBody": "<p>Interesting to see a clear statement by OP on the expected dominance of advocacy and other leveraged interventions over traditional direct delivery work.</p>\n", "parentCommentId": null, "user": {"username": "jackva"}}, {"_id": "GLummYYKFHyhkj6wq", "postedAt": "2023-10-06T21:20:36.047Z", "postId": "KuByzfn6yiKMWBKmr", "htmlBody": "<p><strong>Executive summary</strong>: Open Philanthropy commits $300 million over 3 years to GiveWell's evidence-backed, cost-effective recommendations in global health and development.</p><p><strong>Key points</strong>:</p><ol><li>Open Philanthropy's commitment will be spent at GiveWell's discretion, with the aim of maximizing benefit to beneficiaries. This follows active discussions between the two entities regarding the allocation of funds.</li><li>Notable past funded grants include $67.5M to Helen Keller International for vitamin A supplementation programs, $61.4M to Malaria Consortium for malaria prevention programs, and $13.2M to Evidence Action for syphilis testing and treatment in pregnancy.</li><li>Open Philanthropy has raised its \"bar\" for funding in its Global Health and Wellbeing portfolio due to a decrease in available assets and growth in giving opportunities to combat global catastrophic risks, causing a reduction in the annual rate of funding for GiveWell’s recommendations.</li><li>GiveWell's growth and the higher funding bar have influenced Open Philanthropy's funding plans, with GiveWell's funding being more responsive to changes in assets and the bar due to its large base of donors and scalable interventions.</li><li>Open Philanthropy notes a possible discrepancy between its estimated cost-effectiveness bar and GiveWell’s, but commits to working closely with GiveWell to assess these differences and ensure the best opportunities are funded.</li><li>Despite uncertainties, Open Philanthropy states that GiveWell's cost-effectiveness margin is expected to remain strong, making it a promising opportunity for donors.</li></ol><p>&nbsp;</p><p><i>This comment was auto-generated by the EA Forum Team. Feel free to point out issues with this summary by replying to the comment, and</i><a href=\"https://forum.effectivealtruism.org/contact\"><i>&nbsp;<u>contact us</u></i></a><i> if you have feedback.</i></p>", "parentCommentId": null, "user": {"username": "SummaryBot"}}, {"_id": "XkbcnB6uRaXp32dJn", "postedAt": "2023-10-06T21:40:07.551Z", "postId": "KuByzfn6yiKMWBKmr", "htmlBody": "<p>I am curious about whether you might consider abandon worldview diversification, aim to have parsimonious exchange rates between your cause areas, have more frequent rebalancings, etc.</p><p>In a sense, increasing your bar for global health means that you are already doing some of this, and your committment to worldview diversification seems much watered down?</p>", "parentCommentId": null, "user": {"username": "NunoSempere"}}, {"_id": "Gptphxqf9A7KiNxR3", "postedAt": "2023-10-07T04:57:53.711Z", "postId": "KuByzfn6yiKMWBKmr", "htmlBody": "<p>Thanks for the thoughtful and informative post. Your decision strikes me as a mix of good, bad, and, well, I’m not too sure.</p>\n<p>The good: It’s great to hear that OP has confidence in novel, high-leverage global health and wellbeing (GHW) opportunities with such significant upside. GiveWell is an incredible, safe sponge for GHW funding and it’s exciting to hear about projects that, at least on some axis, are even better.</p>\n<p>The bad (the unfortunate): Less funding is available in the aggregate.</p>\n<p>Not too sure: I’m uncertain about rebalancing toward the global catastrophic risks (GCR) portfolio. The post explains that an increase in GCR funding opportunities has contributed to that shift. Given that, was the rebalancing “waiting” on those opportunities to arise or did OP change its relative prioritization between GHW and GCR? If further GCR opportunities emerge, would OP expect to allocate an even greater proportion of its funding to the GCR portfolio?</p>\n", "parentCommentId": null, "user": {"username": "variouslymistaken"}}, {"_id": "8obwbMiCMFZmpQorm", "postedAt": "2023-10-07T06:29:41.682Z", "postId": "KuByzfn6yiKMWBKmr", "htmlBody": "<p>I’ve argued this largely on Twitter, but it seems pretty clear to me that no marginal dollars at all, at least up to say $1B, should in fact be going to the GiveWell portfolio (or similar charities for that matter). I don’t think it’s obvious what the alternative should be, but do think that (virtually) no well informed person trying to allocate a marginal dollar most ethically would conclude that GiveWell is the best option.</p>\n<p>I feel like this/adjacent debates often gets framed as “normal poverty stuff vs weird longtermist stuff” but a lot of my confidence in the above comes from farmed animal welfare strictly dominating GiveWell in terms of any plausibly relevant criteria save for maybe PR. And then there’s an important and interesting debate to be had over farmed animals vs GCR vs everything else.</p>\n<p>I’d be super keen to hear from anyone who disagrees from an affirmative “no really, AMF etc is more deserving than every other org I know about” perspective, as I don’t think I’ve encountered anyone who’s argued this.</p>\n", "parentCommentId": null, "user": {"username": "aaronb50"}}, {"_id": "t9GFRPk6YEkCmcRAA", "postedAt": "2023-10-07T07:11:11.343Z", "postId": "KuByzfn6yiKMWBKmr", "htmlBody": "<p>[Epistemic status: unsure how much I believe each response but more pushing back against that \"no well informed person trying to allocate a marginal dollar most ethically would conclude that GiveWell is the best option.\"]</p><ol><li>I think worldview diversification can diversify to a worldview that is more anthropocentric and less scope sensitive across species/not purely utilitarian. This would directly change the split with farmed animal welfare.</li><li>There's institutional and signalling value in showing that OpenPhil is willing to stand behind long commitments. This can in the worst instances be PR but in the best instances be a credible signal to many cause areas that OpenPhil is an actor in the non-profit space that will not change tact just due to philosophical changes in worldview (that seem hard to predict from the outside). For instance what if Korsgaard or Tarsney<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefubiqvmr5jps\"><sup><a href=\"#fnubiqvmr5jps\">[1]</a></sup></span>&nbsp;just annihilates Utilitarianism with a treatise? I don't think NGOs should have to track GPI's outputs nor to know if they'll be funded next year.</li><li>I think there's something to be said for how one values \"empirical evidence\" over \"philosophical evidence\" even when the crux for animal welfare. Alexander Berger makes the argument <a href=\"https://80000hours.org/podcast/episodes/alexander-berger-improving-global-health-wellbeing-clear-direct-ways/\">here</a> (I'm too lazy to fully type it out).</li><li>A moral parliaments view given uncertainty can lead to a lot of GiveWell looking much better. Even a Kantian sympathetic to animals like Korsgaard would have limitations towards certain welfarist approaches. For instance, I don't know how a Kantian would weigh wild animal welfare or even shrimp welfare (would neuron weights express a being willing something?).</li><li>The animal welfare movement landscape is very activist driven such that a flood of cash on the order of magnitude of say the current $300MM given to GiveWell could lead to an activist form of dutch disease and be incredibly unhealthy for it.</li><li>OpenPhil could just have an asymmetric preference against downside risk such that it's not a pure expected value calculation. I think there are good reasons to a-priori not invest in interventions that could carry downside risk and very plausible reasons why animal welfare interventions are more likely to entail those risks. For instance, political risks from advocacy and diet switches meaning more egg is consumed than beef. I think the largest funder in EA being risk averse is good given contemporary events.</li><li>OpenPhil seems really labour constrained in other cause areas as shown by the recent GCR <a href=\"https://www.openphilanthropy.org/research/new-roles-on-our-gcr-team/\">hiring round</a> such that maybe the due dilgence and labour costs for non-Givewell interventions are just not available to be investigated or executed.</li></ol><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnubiqvmr5jps\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefubiqvmr5jps\">^</a></strong></sup></span><div class=\"footnote-content\"><p>I know Tarsney is a utilitarian but I'm just throwing him out there as a name that can change .</p></div></li></ol>", "parentCommentId": "8obwbMiCMFZmpQorm", "user": {"username": "zichenghuang"}}, {"_id": "zEafKMmCFJSmSprWQ", "postedAt": "2023-10-07T08:52:47.714Z", "postId": "KuByzfn6yiKMWBKmr", "htmlBody": "<blockquote><p>a lot of my confidence in the above comes from farmed animal welfare strictly dominating GiveWell in terms of any plausibly relevant criteria save for maybe PR</p></blockquote><p>Well some people might have ethical views or moral weights that are extremely favourable to people-focused interventions.</p><p>Or people could really value certainty of impact, and the evidence base could lead them to be much more confident that marginal donations to GiveWell charities have a counterfactual impact than marginal donations to animal welfare advocacy orgs.</p><p>FWIW I'm more likely to donate to animal welfare orgs too, but I'm sufficiently uncertain that I wouldn't say I believe they <i>dominate</i> the GW orgs on relevant criteria. That would be pretty surprising, they're very different in their goals and approach!</p>", "parentCommentId": "8obwbMiCMFZmpQorm", "user": {"username": "Stephen Clare"}}, {"_id": "5aWuB3px68zjGhttP", "postedAt": "2023-10-07T11:27:10.872Z", "postId": "KuByzfn6yiKMWBKmr", "htmlBody": "<p>What specifically in farmed animal welfare do you think beats GiveWell? (GiveWell is a specific thing you can actually donate money to; \"farmed animal welfare\" is not)<br><br>Farmed animal welfare is politically controversial in a way that GiveWell is not. This is potentially bad:<br>- Maybe people who don't care about farmed animals are correct<br>- Farmed animal advocacy is so cost-effective because, if successful, it forces other people (meat consumers? meat producers?) to bear the costs of treating animals better. I'm less comfortable spending other people's money to make the world better than spending my own money to make the world better<br>- Increased advocacy for farm animals might just cause increased advocacy for farms, just burning money rather than improving the world<br>- It's hard to be as confident in political interventions - humans and groups of humans are much less predictable than e.g. malaria<br>- Farmed animal welfare sometimes seems overly-connected with dubious left-wing politics (e.g. <a href=\"https://forum.effectivealtruism.org/posts/5iCsbrSqLyrfP55ry/concerns-with-ace-s-recent-behavior-1)\">https://forum.effectivealtruism.org/posts/5iCsbrSqLyrfP55ry/concerns-with-ace-s-recent-behavior-1</a>)</p>", "parentCommentId": "8obwbMiCMFZmpQorm", "user": {"username": "Jonathan Paulson"}}, {"_id": "CJvim5a99sNiQdEH9", "postedAt": "2023-10-07T15:32:30.630Z", "postId": "KuByzfn6yiKMWBKmr", "htmlBody": "<p>Thanks for pointing that out, Aaron!</p><blockquote><p>I feel like this/adjacent debates often gets framed as “normal poverty stuff vs weird longtermist stuff” but a lot of my confidence in the above comes from farmed animal welfare strictly dominating GiveWell in terms of any plausibly relevant criteria save for maybe PR.</p></blockquote><p>I do not agree with the \"any plausibly relevant criteria\" part. However, I do think the best interventions to help farmed animals increase welfare way more cost-effectively than GiveWell's top charities. Some examples illustrating this:</p><ul><li>I <a href=\"https://forum.effectivealtruism.org/posts/vBcT7i7AkNJ6u9BcQ/prioritising-animal-welfare-over-global-health-and#Corporate_campaigns_for_chicken_welfare_increase_nearterm_wellbeing_way_more_cost_effectively_than_GiveWell_s_top_charities\">estimated</a> corporate campaigns for chicken welfare increase welfare 1.71 k times as cost-effectively as GiveWell's top charities. I used Rethink Priorities' median welfare change for chickens of <a href=\"https://forum.effectivealtruism.org/posts/Qk3hd6PrFManj8K6o/rethink-priorities-welfare-range-estimates\">0.332</a>, which I think is the best we have.</li><li>Stephen Clare and Aidan Goth (at Founders Pledge at the time) <a href=\"https://forum.effectivealtruism.org/posts/ahr8k42ZMTvTmTdwm/how-good-is-the-humane-league-compared-to-the-against\">estimated</a> corporate campaigns for chicken welfare <a href=\"https://www.getguesstimate.com/models/15687\">are</a> 926 (= 25/0.027) times as effective as Against Malaria Foundation.</li></ul><p>For Open Phil's bar to be consistent with the above, it has to:</p><ul><li>Put very low weight on <a href=\"https://utilitarianism.net/theories-of-wellbeing/#hedonism\">hedonism</a>.</li><li>Stipulate non-hedonic benefits are very poorly correlated with hedonic benefits, contra <a href=\"https://forum.effectivealtruism.org/posts/WfeWN2X4k8w8nTeaS/theories-of-welfare-and-welfare-range-estimates\">this</a> post of Rethink Priorities' moral weight project <a href=\"https://forum.effectivealtruism.org/s/y5n47MfgrKvTLE3pw\">sequence</a>. \"We argue that even if hedonic goods and bads (i.e., pleasures and pains) aren't all of welfare, they’re a lot of it. So, probably, the choice of a theory of welfare will only have a modest (less than 10x) impact on the differences we estimate between humans' and nonhumans' welfare ranges\".</li></ul><p>I share your sense that Open Phil should ideally be commenting on the points above, as opposed to just framing the movement of their global health and wellbeing bar as a trade-off with spending on their human-centric areas (including mitigation of GCRs).</p>", "parentCommentId": "8obwbMiCMFZmpQorm", "user": {"username": "vascoamaralgrilo"}}, {"_id": "HNdZDgJuokRDApp2s", "postedAt": "2023-10-07T16:38:20.009Z", "postId": "KuByzfn6yiKMWBKmr", "htmlBody": "<p>Nice points, zchuang!</p><blockquote><p>I think worldview diversification can diversify to a worldview that is more anthropocentric and less scope sensitive across species/not purely utilitarian. This would directly change the split with farmed animal welfare.</p></blockquote><p>Right. On the other hand, I wonder whether it is a little arbitrary that Open Phil has ended up with 3 worldviews. For example, in the context of global health and wellbeing, I think current GiveWell's top charities mostly decrease mortality (by saving lives), but there could be an area supporting interventions which mostly improve quality of life. Relatedly, see <a href=\"https://forum.effectivealtruism.org/posts/JgqEqsa6iAtqGLYmw/the-elephant-in-the-bednet-the-importance-of-philosophy-when-1\">The elephant in the bednet: the importance of philosophy when choosing between extending and improving lives</a>.</p><blockquote><p>There's institutional and signalling value in showing that OpenPhil is willing to stand behind long commitments. This can in the worst instances be PR but in the best instances be a credible signal to many cause areas that OpenPhil is an actor in the non-profit space that will not change tact just due to philosophical changes in worldview (that seem hard to predict from the outside). For instance what if Korsgaard or Tarsney<a href=\"https://forum.effectivealtruism.org/posts/KuByzfn6yiKMWBKmr/our-planned-allocation-to-givewell-s-recommendations-for-the#fnubiqvmr5jps\"><sup>[1]</sup></a>&nbsp;just annihilates Utilitarianism with a treatise? I don't think NGOs should have to track GPI's outputs nor to know if they'll be funded next year.</p></blockquote><p>I think this is a good point. However, I would say it does not apply so much to this case:</p><ul><li>Open Phil could easily have seen long time ago (and I guess they did) that, under hedonism, the best interventions to help farmed animals are way more cost-effective than GiveWell's top charities:<ul><li>From their worldview diversification 2016 <a href=\"https://www.openphilanthropy.org/research/worldview-diversification/\">post</a>, \"if you value chicken life-years equally to human life-years, this implies that corporate campaigns do about 10,000x as much good per dollar as top charities. If you believe that chickens do not suffer in a morally relevant way, this implies that corporate campaigns do no good\".</li><li>Following Open Phil's 2017 <a href=\"https://www.openphilanthropy.org/research/2017-report-on-consciousness-and-moral-patienthood/\">report</a> on consciousness and moral patienthood by Luke Muehlhauser, Luke <a href=\"https://www.lesswrong.com/posts/2jTQTxYNwo6zb3Kyp/preliminary-thoughts-on-moral-weight\">guessed</a> in 2018 a chicken life-year to be worth 0.00005 to 10 human life-years. Pairing this with the above would suggest corporate campaigns for chicken welfare to be 0.5 (= 0.00005*10000) to 100 k (= 10*10000) times as cost-effective as GiveWell's top charities.</li><li>In other words, under <s>almost any</s>most plausible assumptions, under hedonism, corporate campaigns for chicken welfare increase welfare way more cost-effectively than GiveWell's top charities.</li></ul></li><li>Open Phil spun out of GiveWell, and both organisations are aligned with effective altruism, and unusually interested in phylosophical topics (relative to random non-profits).</li></ul><blockquote><p>I think there's something to be said for how one values \"empirical evidence\" over \"philosophical evidence\" even when the crux for animal welfare. Alexander Berger makes the argument <a href=\"https://80000hours.org/podcast/episodes/alexander-berger-improving-global-health-wellbeing-clear-direct-ways/\">here</a> (I'm too lazy to fully type it out).</p></blockquote><p>Agreed. At the same time, I feel like Rethink Priorities' moral weight <a href=\"https://forum.effectivealtruism.org/s/y5n47MfgrKvTLE3pw\">project</a> (funded by Open Phil) makes use of the best available empirical evidence (greatly illustrated <a href=\"https://forum.effectivealtruism.org/s/y5n47MfgrKvTLE3pw/p/tnSg6o7crcHFLc395\">here</a>), and it <a href=\"https://forum.effectivealtruism.org/posts/Qk3hd6PrFManj8K6o/rethink-priorities-welfare-range-estimates\">found</a> a median welfare range for chickens of 0.332 (i.e. having a chicken for 1 year in its best possible state, instead of its worst possible state, is 0.332 times as good as having a human for 1 year in its best possible state, instead of her/his worst possible state). This implies, under hedonism, that corporate campaigns for chicken welfare are way more cost-effective that GiveWell's top charities (in my mind, unsurprinsingly given Luke's guess, but really important to have an in-depth investigation like Rethink's to have a better sense of the difference).</p><blockquote><p>A moral parliaments view given uncertainty can lead to a lot of GiveWell looking much better. Even a Kantian sympathetic to animals like Korsgaard would have limitations towards certain welfarist approaches. For instance, I don't know how a Kantian would weigh wild animal welfare or even shrimp welfare (would neuron weights express a being willing something?).</p></blockquote><p>There are many Kantian-like reasons for improving the living conditions of factory-farmed animals, and/or eliminating factory-farming. For example, caged chickens have so little freedom that they often cannot open their wings. Factory-farmed animals also endure extreme pain, and are killed, being used mostly as a means to an end.</p><blockquote><p>The animal welfare movement landscape is very activist driven such that a flood of cash on the order of magnitude of say the current $300MM given to GiveWell could lead to an activist form of dutch disease and be incredibly unhealthy for it.</p></blockquote><p>This is something to have in mind. I would like to see Open Phil describing their views on the diminishing returns of spending on farmed animal welfare. Anecdotally, the area seems quite constrained by funding. It surprises me a little that Animal Charity Evaluators' <a href=\"https://animalcharityevaluators.org/donation-advice/recommended-charities/\">recommended charities</a>, which are relatively small, are seemingly not fully funded:</p><ul><li><a href=\"https://animalcharityevaluators.org/charity-review/faunalytics/\">Faunalytics</a>. \"We believe that overall, Faunalytics continues to have room for $1,260,000 of additional funding in 2022 and $1,259,000 in 2023\".</li><li><a href=\"https://animalcharityevaluators.org/charity-review/the-humane-league/\">The Humane League</a>. \"We believe that overall, THL continues to have room for $4,881,000 of additional funding in 2022 and $5,249,000 in 2023\".</li><li><a href=\"https://animalcharityevaluators.org/charity-review/the-good-food-institute/\">The Good Food Institute</a>. \"We estimate that GFI has room for $5,000,000 of additional funding in 2023 and $5,000,000 in 2024, beyond their current projected revenues in those years\".</li><li><a href=\"https://animalcharityevaluators.org/charity-review/wild-animal-initiative/\">Wild Animal Initiative</a>. \"We believe that overall, Wild Animal Initiative continues to have room for $1,772,000 of additional funding in 2022 and $1,685,000 in 2023\".</li></ul><blockquote><p>OpenPhil could just have an asymmetric preference against downside risk such that it's not a pure expected value calculation. I think there are good reasons to a-priori not invest in interventions that could carry downside risk and very plausible reasons why animal welfare interventions are more likely to entail those risks. For instance, political risks from advocacy and diet switches meaning more egg is consumed than beef. I think the largest funder in EA being risk averse is good given contemporary events.</p></blockquote><p>Note life-saving and income-increasing interventions have a significant downside risk in the <a href=\"https://forum.effectivealtruism.org/topics/meat-eater-problem#:~:text=The%20meat%2Deater%20problem%20(sometimes,real%20income%20or%20human%20population.\">meat-eater problem</a>. I Fermi-<a href=\"https://forum.effectivealtruism.org/posts/vBcT7i7AkNJ6u9BcQ/prioritising-animal-welfare-over-global-health-and#Farmed_animals\">estimated</a> accounting for this decreases the cost-effectiveness of GiveWell's top charities by 22.4 %, but there is huge uncertainty. Depending on how the living conditions and consumption per capita of animals evolves in the countries targeted by GiveWell, one can easily conclude GiveWell's top charities are harmful under hedonism. Accounting for the effect on wild animals, the sign of the benefits <a href=\"https://forum.effectivealtruism.org/posts/vBcT7i7AkNJ6u9BcQ/prioritising-animal-welfare-over-global-health-and#Wild_animals\">is</a> even more unclear.</p><p>If the goal was minimising the chance of doing harm, I think interventions improving the living conditions of humans (e.g. reducing depression) or farmed animal (e.g. corporate campaigns for chicken welfare) would tend to be more robustly positive.</p><blockquote><p>OpenPhil seems really labour constrained in other cause areas as shown by the recent GCR <a href=\"https://www.openphilanthropy.org/research/new-roles-on-our-gcr-team/\">hiring round</a> such that maybe the due dilgence and labour costs for non-Givewell interventions are just not available to be investigated or executed.</p></blockquote><p>Open Phil has started \"new programs in South Asian air quality, global aid policy, innovation policy, effective altruism with a GHW focus, and global health R&amp;D\", which are very much related to improving human welfare. If their spending on farmed animal welfare was constrained by staff capacity, and they thought the marginal opportunities in the farmed animal welfare space were much better than the ones to improve human welfare, I would expect to see a greater focus on expanding the farmed animal welfare team.</p>", "parentCommentId": "t9GFRPk6YEkCmcRAA", "user": {"username": "vascoamaralgrilo"}}, {"_id": "ukJvDGeaGRMgqdeHi", "postedAt": "2023-10-07T17:31:17.019Z", "postId": "KuByzfn6yiKMWBKmr", "htmlBody": "<p>Thanks for sharing, Alex and Emily!</p><blockquote><p>We’ve reduced the annual rate of our funding for GiveWell’s recommendations because <a href=\"https://www.openphilanthropy.org/research/technical-updates-to-our-global-health-and-wellbeing-cause-prioritization-framework/#2-our-previous-bar\"><u>our “bar” for funding</u></a> in our Global Health and Wellbeing (GHW) <a href=\"https://www.openphilanthropy.org/our-global-health-and-wellbeing-and-longtermism-grantmaking-portfolios/\"><u>portfolio</u></a> has risen substantially. In July 2022, it was roughly in the range of <a href=\"https://www.openphilanthropy.org/research/update-on-our-planned-allocation-to-givewells-recommended-charities-in-2022/#how-we-chose-this-years-allocation-to-givewell\"><u>1100x-1200x</u></a>; we recently raised it to slightly over 2000x.</p></blockquote><p>Could you describe more mechanistically how you updated the bar (e.g. why slightly over 2000x instead of sligly over 1800x or 2200x)? I sense you have done more than considering a bunch of qualitative considerations, and then deciding on a new bar. If there is a background analysis, are there any reasons for not sharing it?</p><p>In addition, could you say more about how your bar affects your grantmaking decisions? Do you estimate the cost-effectiveness of the last dolar of each GHW grant, and then compare it with your bar (at least for big grants)?</p>", "parentCommentId": null, "user": {"username": "vascoamaralgrilo"}}, {"_id": "vmn4ifa5sDJyPSk6K", "postedAt": "2023-10-08T08:50:35.735Z", "postId": "KuByzfn6yiKMWBKmr", "htmlBody": "<blockquote><p>A moral parliaments view given uncertainty can lead to a lot of GiveWell looking much better. Even a Kantian sympathetic to animals like Korsgaard would have limitations towards certain welfarist approaches. For instance, I don't know how a Kantian would weigh wild animal welfare or even shrimp welfare (would neuron weights express a being willing something?).</p></blockquote><p>This is a bit of a tangent, but Korsgaard discusses wild animals a bit in <i>Fellow creatures</i>. Some excerpts follow ...</p><p>Korsgaard says work on animal ethics produces an \"antinomy\", where the same premise seemingly yields two opposite conclusions (\"creation ethics\" – we should do lots to reduce animal suffering – and \"abolitionism\" – we should do nothing except stay away):</p><blockquote><p>The natural world staunchly resists moral reorganization. As a result, we are unable to treat all animals in the way that morality demands, that is, as ends in themselves who have a claim to be treated in a way that is consistent with their good. Many people try to deal with the resulting problems by telling themselves that animals are so dimwitted that they cannot really suffer very much, or so unimportant that their suffering does not matter. The friends of animals, knowing that these things are not true, think that we have to try to reorganize the population of the natural world, so that all animals are either domestic and under our protection [\"creation ethicists\"], or wild animals with whom we do not interact at all [\"abolitionists\"].</p><p>[...] Morality teaches us how to construct a world that is, to a large extent anyway, good for all of us, governed by standards to which all of us can agree. But we cannot extend these benefits to all of the animals, in part because the system of predator and prey, and the competition for natural resources, sets them inevitably against each other.</p></blockquote><p>She also brings up invertebrate suffering as another problem for either of these views:</p><blockquote><p>Another problem is size. It is pretty hard to avoid harming things that are not somewhere in the same general size range as you are. But the world is teeming with organisms, most of them tiny by our standards. Some of these creatures may, for all we know, be sentient.</p></blockquote><p>She says we can resolve the antinomy by distinguishing between what we ought to do and what we can do, and advocates what she calls a \"preservation ethics\":</p><blockquote><p>Rather than trying to create new and more morally tractable species of animals, I think we should do what we can to interact with the existing animals and the ongoing animal communities that already exist, in a way that respects the absolute value of their good.</p><p>Abolitionists, like creationists, want to change the nature of animals in a way that they think would make it easier for us to treat them well, or rather, to stop mistreating them. [...] But in one way their position is stronger than that of the creationists. I argued before that although one world cannot be better than another if they have different inhabitants, the creator of a world has a duty to make things as good as possible for whoever she creates. As I have tried to emphasize, part of the problem with creation ethics is that it invites us to <i>take up</i> the position of the creator with respect to wild animals, and it is not clear why we should do that, or if we would have the right to even if we could. But we are <i>already</i> in the position of the creator towards domestic animals, so the claim that we might have a duty to stop creating them is more plausible.</p></blockquote><p>In practice, what Korsgaard recommends may not be that different from <i>current</i> EA wild animal welfare work, which I would guess Korsgaard would mostly endorse. But my sense is that EAs may support stronger interventions – even where humans are not involved in creating harms – in theory at least, and not pursue those right now simply because they are too uncertain/intractable, a thing that could change in the future.</p><p>Of course it's possible that Korsgaard's view is involves status quo bias. You could say that any interaction with animals &nbsp;– and even a decision <i>not</i> to assume the role of creator – does involve acting as creator of sorts, such that you are inevitably in that position.</p>", "parentCommentId": "t9GFRPk6YEkCmcRAA", "user": {"username": "Erich_Grunewald"}}, {"_id": "sCFdYspYneHp5Akao", "postedAt": "2023-10-08T23:15:30.827Z", "postId": "KuByzfn6yiKMWBKmr", "htmlBody": "<p>Good point, and I'll throw out The Humane League as one specific recipient of money.&nbsp;</p><blockquote><p>Farmed animal welfare is politically controversial in a way that GiveWell is not. This is potentially bad:</p></blockquote><p>Is OpenPhil's current support of farmed animal welfare politically controversial? I don't get that sense but, if so, among who?</p><blockquote><p>Maybe people who don't care about farmed animals are correct</p></blockquote><p>Sure but same goes for literally everything, including eg AMF being net positive. Happy to discuss object level though.</p><blockquote><p>Farmed animal advocacy is so cost-effective because, if successful, it forces other people (meat consumers? meat producers?) to bear the costs of treating animals better. I'm less comfortable spending other people's money to make the world better than spending my own money to make the world better</p></blockquote><p>Interesting point and yeah I think this is valid. At some margin I think this would become an important consideration (e.g., advocating some policy that made being non-vegan super expensive) but at the current margin it seems like these costs are just extremely small relative to the suffering reduction they induce.</p><blockquote><p>Increased advocacy for farm animals might just cause increased advocacy for farms, just burning money rather than improving the world</p></blockquote><p>Farm lobby is strong. I agree this has to be accounted for but trust OpenPhil, ACE, and e.g. The Humane League to account for this when deciding what to do and who to fund. Empirically, it seems to be the case that e.g. cage free advocacy has worked and laws like California's prop 12 have passed and been upheld.</p><blockquote><p>It's hard to be as confident in political interventions - humans and groups of humans are much less predictable than e.g. malaria</p></blockquote><p>First, at one level I agree but then would point to all the non-political animal welfare interventions like cage free advocacy without bans and Shrimp Welfare Project paying for farms to install stunners. At another I just disagree that e.g. AMF has high-confidence certain impact on the world. All the analyses explicitly don't even try to account for 3rd+ order effects (not sure about 2nd) which is plausibly where a ton of impact lies.</p><blockquote><p>- Farmed animal welfare sometimes seems overly-connected with dubious left-wing politics (e.g. <a href=\"https://forum.effectivealtruism.org/posts/5iCsbrSqLyrfP55ry/concerns-with-ace-s-recent-behavior-1)\">https://forum.effectivealtruism.org/posts/5iCsbrSqLyrfP55ry/concerns-with-ace-s-recent-behavior-1)</a></p></blockquote><p>I've definitely seen first hand how much of especially veganism/vegan advocacy per se is very lefty and, more importantly, less clear eyed and epistemically rigorous than EA in general and certainly meta level EA orgs. IMO the appropriate response here is to be a countervailing force in the sense of technocratic rigor (not conservatism), not to \"leave those people be\".</p>", "parentCommentId": "5aWuB3px68zjGhttP", "user": {"username": "aaronb50"}}, {"_id": "FRrrrWsdtbKzBeGLX", "postedAt": "2023-10-09T15:56:17.876Z", "postId": "KuByzfn6yiKMWBKmr", "htmlBody": "<blockquote><ul><li>Following Open Phil's 2017 report on consciousness and moral patienthood by Luke Muehlhauser, Luke guessed in 2018 a chicken life-year to be worth 0.00005 to 10 human life-years. Pairing this with the above would suggest corporate campaigns for chicken welfare to be 0.5 (= 0.00005*10000) to 100 k (= 10*10000) times as cost-effective as GiveWell's top charities.</li><li>In other words, under almost any plausible assumptions, under hedonism, corporate campaigns for chicken welfare increase welfare way more cost-effectively than GiveWell's top charities.</li></ul></blockquote><p>Here, you have a lower-bound that corporate campaigns are only half as cost-effective as GiveWell's top charities. That contradicts the following bullet point.</p>", "parentCommentId": "HNdZDgJuokRDApp2s", "user": {"username": "jooke"}}, {"_id": "mEcRdy6GJfHjzgRKA", "postedAt": "2023-10-09T23:07:34.445Z", "postId": "KuByzfn6yiKMWBKmr", "htmlBody": "<p>Thanks, Joshua!</p><p>Assuming a loguniform distribution for the cost-effectiveness of corporate campaigns for chicken welfare as a fraction of the cost-effectiveness of GiveWell's top charities ranging from 0.5 to 100 k, there would be 75.5 % (= (ln(10^5) - ln(10))/(ln(10^5) - ln(0.5))) chance of corporate campaigns being at least 10 times as cost-effective as GiveWell's top charities. So I agree my wording above (\"under almost any plausible assumption\") was too strong in light of Luke's 2018 guesses. I changed the wording to \"under most plausible assumptions\".</p><p>Rethink Priorities' welfare range estimates seem roughly in line with the above. Rethink's 5th and 95th percentile welfare range for chickens <a href=\"https://forum.effectivealtruism.org/s/y5n47MfgrKvTLE3pw/p/Qk3hd6PrFManj8K6o\">are</a> 0.602 % (= 0.002/0.332) and 2.62 times (= 0.869/0.332) the median welfare range I used to <a href=\"https://forum.effectivealtruism.org/posts/vBcT7i7AkNJ6u9BcQ/prioritising-animal-welfare-over-global-health-and#Corporate_campaigns_for_chicken_welfare_increase_nearterm_wellbeing_way_more_cost_effectively_than_GiveWell_s_top_charities\">estimate</a> corporate campaigns increase welfare 1.71 k times as cost-effective as GiveWell's top charities. If I had used the 5th and 95th percentile welfare range, I would have concluded corporate campaigns increase welfare 10.3 (= 0.00602*1.71*10^3) and 4.48 k times as cost-effectively as GiveWell's top charities. In reality, there are uncertainty in other inputs, so maybe the plausible range of values is actually similar to what Luke guesses back in 2018 (one roughly gets Luke's interval of 0.5 to 100 k multiplying 10.3 and 4.48 k by 1/20 and 20).</p>", "parentCommentId": "FRrrrWsdtbKzBeGLX", "user": {"username": "vascoamaralgrilo"}}, {"_id": "TXT4hpLLYBeKMy8BM", "postedAt": "2023-10-13T20:21:55.172Z", "postId": "KuByzfn6yiKMWBKmr", "htmlBody": "<blockquote><p>At some margin I think this would become an important consideration (e.g., advocating some policy that made being non-vegan super expensive) but at the current margin it seems like these costs are just extremely small relative to the suffering reduction they induce.</p></blockquote><p>Is there a cost-effectiveness analysis that takes these costs into account? I don't think I've seen one.</p>", "parentCommentId": "sCFdYspYneHp5Akao", "user": {"username": "Jonathan Paulson"}}, {"_id": "7avxjLj9rBn5YTCkq", "postedAt": "2023-10-13T20:33:26.845Z", "postId": "KuByzfn6yiKMWBKmr", "htmlBody": "<p>People have voted for legislation improving animal welfare in ballot measures or elected candidates to government whose policies include improving animal welfare, so rather than imposing net burdens on people, it could be in <i>our</i> net interest. Of course, many people will oppose these welfare improvements, and they may be worse off.</p><p>Corporate+institutional animal welfare campaign/outreach work may also depend on implicit or explicit public support in order to succeed.</p><p>There's related research on animal welfare as a public good and the vote-buy gap.</p>", "parentCommentId": "TXT4hpLLYBeKMy8BM", "user": {"username": "MichaelStJules"}}, {"_id": "wdvQvDM6jJLwTmhkc", "postedAt": "2023-10-16T19:42:25.856Z", "postId": "KuByzfn6yiKMWBKmr", "htmlBody": "<p>I'm curating this post. I think for many EA donors, knowing about Open Philanthropy's plans will be an important part of their models. I appreciate the transparency in general, and the detailed writeup aimed at critical donors in particular.</p>", "parentCommentId": null, "user": {"username": "jpaddison"}}]