[{"_id": "wfyAxjEx5WAuKe6ZJ", "postedAt": "2024-03-21T22:18:59.529Z", "postId": "KufkTYjBDd324XFRS", "htmlBody": "<p>Have you used any ads to promote these videos? For me as a viewer, it's always suspicious to see a large number of views with very little engagement (for AI video: 1.1M views, 500 likes, 50 comments). I'd suggest relying more on organic growth in the future, it will give the videos more credibility in the eyes of viewers.</p>", "parentCommentId": null, "user": {"username": "Alex_Berezhnoy"}}, {"_id": "nyxzinSHREp8NPcsM", "postedAt": "2024-03-21T22:56:48.499Z", "postId": "KufkTYjBDd324XFRS", "htmlBody": "<p>Yeah wow the views vs engagement ratio is the most unbalanced I’ve seen (not saying this is a bad or good thing, just noting my surprise)</p>\n", "parentCommentId": "wfyAxjEx5WAuKe6ZJ", "user": {"username": "Phib"}}, {"_id": "wXTgt9a4aQ8ozp7Bq", "postedAt": "2024-03-22T09:59:38.361Z", "postId": "KufkTYjBDd324XFRS", "htmlBody": "<p>Hey Sasha!</p>\n<p>Yes, we ran a bunch of ads to show the videos to new audiences.</p>\n<p>I agree with you that organic growth would lead to more engagement in the form of likes and comments, and that it'd increase the credibility of the video in the eyes of viewers.</p>\n<p>However, on balance I don't think it'd have been better overall to not promote these videos. (Of course, I could be wrong!)</p>\n<p>There's two main reasons:</p>\n<ol>\n<li>\n<p>I think the videos would have been seen by <strong>many</strong> fewer people (&amp; I think the videos have important ideas in them, so I'm excited for more people to watch them)</p>\n</li>\n<li>\n<p>I think we still see really good engagement with the <em>videos</em> themselves. The average view duration for the AI video is currently 58.7% of the video, and 25% of viewers watched the whole video. Though we don't have internal comparisons for content of this length, a quick Google suggests that 50% avg view duration or higher is \"good.\"</p>\n</li>\n</ol>\n<p>Also, organic growth on YouTube:</p>\n<ul>\n<li>Is subject to uncontrollable variation, and very hard to directly predict</li>\n<li>Is more likely with more \"popular\" and \"exciting\" topics, which we didn't necessarily want to restrict ourselves to</li>\n<li>Is best achieved via very consistent uploads, which we weren't sure we should commit to at this time</li>\n</ul>\n<p>Hope that helps explain our decisionmaking here!</p>\n", "parentCommentId": "wfyAxjEx5WAuKe6ZJ", "user": {"username": "Bella_Forristal"}}, {"_id": "LHicHvFzBixnY5puJ", "postedAt": "2024-03-23T10:56:10.649Z", "postId": "KufkTYjBDd324XFRS", "htmlBody": "<blockquote><p>I think we still see really good engagement with the <i>videos</i> themselves. The average view duration for the AI video is currently 58.7% of the video, and 25% of viewers watched the whole video</p></blockquote><p>This average percentage relates to organic traffic only, right? The paid traffic APV must look much lower, something like 5%?</p>", "parentCommentId": "wXTgt9a4aQ8ozp7Bq", "user": {"username": "Writer"}}, {"_id": "eKu23dS3HW8YzAy7x", "postedAt": "2024-03-23T14:14:28.893Z", "postId": "KufkTYjBDd324XFRS", "htmlBody": "<p>As far as we can tell (e.g. by looking at metrics in the Google ads platform directly) this percentage viewed incorporates all ads served on YouTube (which is most, but not all of them).</p>\n<p>Average percentage viewed was indeed a lot worse on other ad platforms :)</p>\n", "parentCommentId": "LHicHvFzBixnY5puJ", "user": {"username": "Bella_Forristal"}}]