[{"_id": "tk5xzkKpF5w2zgBZ7", "postedAt": "2023-08-03T00:28:56.861Z", "postId": "Kugwq3jmoNEgrmAZG", "htmlBody": "<p>I've spent quite a bit of time thinking about marketing over the past few weeks and found this really interesting. I think it will help me refine my thinking around our org's marketing strategy, thanks for sharing it!</p>", "parentCommentId": null, "user": {"username": "Sean Lawrence"}}, {"_id": "7aJoZg9AyAASucpxS", "postedAt": "2023-08-03T05:11:12.101Z", "postId": "Kugwq3jmoNEgrmAZG", "htmlBody": "<p>You write:</p>\n<p>\"Now you have an ROI of 2 (LTV / CAC), which is quite good for most organizations.\"</p>\n<p>Note, in the case where the client may have donated to some other organization, the impact of this marketing is:</p>\n<p>LTV x IE1 - LTV x IE2 - CAC</p>\n<p>Where IE1 is the impact efficiency of what you are fundraising for IE2 is the counterfactual impact efficiency of what the customer would have donated to, and CAC is client acquisition cost.</p>\n<p>I think what you are missing is that EA's are fundraising to make a better world, not to grow their organization at the expense of other organizations, necessarily. Thus they want to grow the EA movement, while not having their cause area compete with other highly impactful cause areas.  You do not seem to be considering this perpective in your marketing tutorial.</p>\n<p>I hope you find this comment useful in customizing your advice to the EA context.</p>\n", "parentCommentId": null, "user": {"username": "Robert Van Buskirk"}}, {"_id": "XP2b8JewjEDo3EcmK", "postedAt": "2023-08-03T11:01:39.906Z", "postId": "Kugwq3jmoNEgrmAZG", "htmlBody": "<p>Thanks for taking the effort Igor, the space definitely needs good thinkers in marketing and messaging for knowledge translation and impact!</p>\n", "parentCommentId": null, "user": {"username": "Dan Epstein"}}, {"_id": "LeDCmsRKJoGrrrpNQ", "postedAt": "2023-08-05T00:12:11.491Z", "postId": "Kugwq3jmoNEgrmAZG", "htmlBody": "<p>Thanks, Robert! Your comment made me think. If I understand your point correctly, marketing would be a problem if it is used to grow at the expense of other organizations - and I agree with you on that. However, I only can see this happening is if two or more organizations target the same audience, which I think is unlikely and avoidable in most cases. Do you think my reasoning makes sense?&nbsp;</p>", "parentCommentId": "7aJoZg9AyAASucpxS", "user": {"username": "Igor Scaldini"}}, {"_id": "dZCLEYiWowjtY3oEo", "postedAt": "2023-08-05T00:12:36.436Z", "postId": "Kugwq3jmoNEgrmAZG", "htmlBody": "<p>I'm happy to know! That was the goal. :)&nbsp;</p>", "parentCommentId": "tk5xzkKpF5w2zgBZ7", "user": {"username": "Igor Scaldini"}}]