[{"_id": "MoiHrqh97Th5vGdTg", "postedAt": "2023-09-27T01:22:12.483Z", "postId": "KuNsnszBxENS3tWMm", "htmlBody": "<p>Congrats on launching GWWC Local Groups! Community building infrastructure can be hard to set up, so I appreciate the work here.</p>\n", "parentCommentId": null, "user": {"username": "michaelchen"}}, {"_id": "j7JMaRTcaQTupzsGK", "postedAt": "2023-09-27T12:48:02.189Z", "postId": "KuNsnszBxENS3tWMm", "htmlBody": "<p>Congrats on the group launch, that's a really exciting development!&nbsp;</p><p>I'm curious if you're willing to share any thoughts about why the original transition form GWWC chapters to EA groups didn't end up accomplishing all of its objectives. It seems like in theory, an effective giving subgroup within an EA group could accomplish all the same things as a GWWC chapter (and my guess is that this was the thinking at the time of the original transition). But in my experience with EA groups, it's seems like it's been hard to get a critical mass of people focused on effective giving.&nbsp;</p>", "parentCommentId": null, "user": {"username": "MHR"}}, {"_id": "Z2BucpCJL5sWibhQM", "postedAt": "2023-09-28T01:07:24.463Z", "postId": "KuNsnszBxENS3tWMm", "htmlBody": "<p>Some of my loose thoughts on this are:</p><ul><li>Many EA groups are focused on fellowships/programs that require a lot of engagement</li><li>Many EA groups have a longtermist focus</li><li>Many EA groups prioritise careers over donations, which can make people feel like if they're only donating that they don't belong</li><li>Many EA group members use a lot of jargon, technical terms, or have social norms that can make it hard for lower context people to feel welcome or engaged. Another way of putting this is that EA groups can feel a bit \"in-group\"-y.</li></ul><p>The types of people that generally attend GWWC/effective giving events tend to be:</p><ul><li>More focused on global health and wellbeing</li><li>Lower context on EA, and often unfamiliar with jargon</li><li>More likely to have a minor interest in effective altruism (and less of a desire for this to become their main social group)</li></ul><p>I actually think more \"effective giving sub-groups\" within EA groups is a great idea, but I would be careful to make sure that it's truly serving those who want to attend that group. &nbsp;</p><p>My hope with the new GWWC groups is that they are really accessible, and welcoming to people at all levels of engagement with effective giving and effective altruism. I'd like to see groups thinking about how to include parents more, and how to reach people that might not typically come along to EA group events. Effective giving is a concept that I think almost everyone could benefit from, so I think creating an inclusive environment is really important. Earlier this year I wrote a guide with One for the World about running safe and inclusive events which covers some of this: https://forum.effectivealtruism.org/posts/CtACh7xRBFnpK3NW4/guide-to-safe-and-inclusive-events-by-gwwc-and-oftw</p><p>It's hard to generalise as EA groups vary a lot in terms of their focus, and engagement strategies but I hope some of the above is helpful!</p>", "parentCommentId": "j7JMaRTcaQTupzsGK", "user": {"username": "GraceAdams"}}, {"_id": "sdSib4n99tuLEsHQg", "postedAt": "2023-09-30T05:03:45.310Z", "postId": "KuNsnszBxENS3tWMm", "htmlBody": "<p>I’m keen to hear how this strategy ends up working for you.</p>\n<p>Your strategy sounds really well thought out and you’ve clearly put a lot of thought in thinking about the key differences in audiences between EA and Giving What We Can.</p>\n<p>Fingers crossed that this works out in practise as well.</p>\n", "parentCommentId": "Z2BucpCJL5sWibhQM", "user": {"username": "casebash"}}, {"_id": "g9aY9KGJw6YQqDozw", "postedAt": "2023-09-30T08:07:02.576Z", "postId": "KuNsnszBxENS3tWMm", "htmlBody": "<p>I'm heartened to see GWWC so alive and enthusiastic!&nbsp;</p><p>In my year-ish on the forum, I've been surprised how little discussion I have seen about effective giving, when for me at least it remains one of the most beautiful, attractive and logically straightforward facets of EA.</p><p>Also surely <i><strong>the Bay area</strong></i> at least could have at least one GWWC group. 10% (or 50%) of a Machine learning or AI safety workers' salary could fund a lot more AI safety researchers - buy 1 get 10% free ;).</p>", "parentCommentId": null, "user": {"username": "NickLaing"}}, {"_id": "CNLaNg4mJdaZFsFgk", "postedAt": "2023-10-03T11:33:05.310Z", "postId": "KuNsnszBxENS3tWMm", "htmlBody": "<p>We’d be very excited to see applications for the Bay Area!! 🎉🎉🙏</p>", "parentCommentId": "g9aY9KGJw6YQqDozw", "user": {"username": "Luke Freeman"}}, {"_id": "9XWEgdh9Xszfb4qrQ", "postedAt": "2023-10-04T16:39:44.461Z", "postId": "KuNsnszBxENS3tWMm", "htmlBody": "<p>Thanks, that makes a lot of sense!</p>", "parentCommentId": "Z2BucpCJL5sWibhQM", "user": {"username": "MHR"}}]