[{"_id": "sTAgnmLkQiTL9xYnv", "postedAt": "2023-01-16T20:47:22.687Z", "postId": "KXSBb2zgkLE6gnn3K", "htmlBody": "<blockquote>\n<p>For instance, given utilitarianism, the Equality Result probably implies that there should be a massive shift in neartermist resources toward animals, and someone might find this unbelievable.</p>\n</blockquote>\n<p>I would make the same claim more strongly: \"modus tollens\" / \"reductio ad absurdum\" (as in, \"this assumption gives a conclusion I don't like\", rather than \"this gives an internally inconsistent conclusion\")  style ethical reasoning is, broadly speaking, not good. Unless you believe standard 21st century morality is correct about everything, you should expect your ethical assumptions to lead to some unexpected results. Ozy wrote something about this that I really liked:</p>\n<blockquote>\n<p>[I]f your moral reasoning doesn’t produce conclusions that seem absurd on the face of it… why are you bothering? I want to be the sort of person who would have come up with the absurd conclusion that slavery is wrong, or the absurd conclusion that women should have rights, or the absurd conclusion that sodomy shouldn’t be illegal; therefore, right now, I am the sort of person who comes up with the absurd conclusions that eating meat is wrong, malaria net donations are morally mandatory, and global warming is really important.</p>\n</blockquote>\n<p>OP said something similar, which is a less general argument but, I think, harder to dispute:</p>\n<blockquote>\n<p>Essentially, it amounts to casting doubt on a broadly&nbsp;empirical&nbsp;conclusion—that particular animals have certain capacities that allow them to realize some amount of welfare—based on a&nbsp;moral conclusion.</p>\n</blockquote>\n<p>I thought this was the most powerful sentence under the \"Balking at the Implications\" heading.</p>\n", "parentCommentId": null, "user": {"username": "MichaelDickens"}}, {"_id": "SuFpoLvemJmwCiJ7g", "postedAt": "2023-01-16T21:56:02.774Z", "postId": "KXSBb2zgkLE6gnn3K", "htmlBody": "<p><strong>Tangential</strong>:&nbsp;</p><p>I think the whole issue of \"one person's modus ponens is another's person's modus tolens\" is not very well understood by most people and including most philosophers and myself. In fact, I'm don't think anyone knows quite how to think about these things. I guess it gets into Quinean holism and the intractability problems that accompany it.&nbsp;</p><p>But, presumably, it has something to do with Bayesian networks of beliefs and regularization in machine learning (~valuing simplicity) as well as Bayesian philosophy of science more generally. [<a href=\"https://ibb.co/P5DQLRJ\">Part IV </a>of Itzhak Gilboa's decision theory <a href=\"https://www.cambridge.org/core/books/theory-of-decision-under-uncertainty/18B73C5038191683B3F7F30B72B77FCB\">book</a> gets into some of this stuff, which seemed pretty interesting.]</p><p>I don't understand why much more attention is not paid to these things in philosophy, where formal epistemology seems to still be considered a pretty niche field.&nbsp;</p><p>I hope people think more about these issues. &nbsp;</p>", "parentCommentId": null, "user": {"username": "Lixiang"}}, {"_id": "sztSyAz7XSYbT2fxg", "postedAt": "2023-01-17T01:13:43.439Z", "postId": "KXSBb2zgkLE6gnn3K", "htmlBody": "<blockquote><p>[The Equality Result:] chickens and humans can realize roughly the same amount of welfare at any given time.</p></blockquote><p>Do your arguments really support this? &nbsp;Or just the weaker <strong>S-Equality Result</strong>, that chickens and humans have roughly the same capacity to suffer negative welfare?</p><p>fwiw, only that weaker claim seems plausible to me, since the hedonic contribution to welfare strikes me as plausibly asymmetric: suffering is very bad, but mere pleasure is only mildly good. I think the vast majority of positive well-being comes from non-hedonic sources. &nbsp;So I don't think chickens <i>or wireheading humans</i> can realize much positive well-being at all -- like, orders of magnitude less than a well-lived human life (featuring love, genuine accomplishments, etc.).</p>", "parentCommentId": null, "user": {"username": "RYC"}}, {"_id": "tGTthGqtq2BF9hCAm", "postedAt": "2023-01-17T09:57:27.596Z", "postId": "KXSBb2zgkLE6gnn3K", "htmlBody": "<p>Thanks for this, Michael! I hadn't seen that line from Ozy. I really like it.</p>", "parentCommentId": "sTAgnmLkQiTL9xYnv", "user": {"username": "bob-fischer"}}, {"_id": "keBq6mR4QjpjNPAws", "postedAt": "2023-01-17T10:07:07.978Z", "postId": "KXSBb2zgkLE6gnn3K", "htmlBody": "<p>Thanks for this question, Richard. You're right that I don't focus on positive affective states in the post, though I think most of the arguments would port over. In any case, since the MWP assumes hedonism, the result that chickens and wireheaded humans can realize the same amount of welfare is still pretty significant. &nbsp;Indeed, even the weaker S-Equality Result is significant if your asymmetry hypothesis is correct, as S-Equality would get you most of the way toward (plain old) Equality.</p><p>Separately, and as you might guess, I'm skeptical of the view that humans who are maxed out hedonically are still realizing orders of magnitude less welfare than humans who are flourishing by more conventional standards. I think the intuitions that support that view boil down to humans preferring the human way of life--a preference that doesn't strike me as having much evidential value. But &nbsp;I suppose that's a conversation for another time!</p>", "parentCommentId": "sztSyAz7XSYbT2fxg", "user": {"username": "bob-fischer"}}, {"_id": "vcntDnxMkhjRq5Woy", "postedAt": "2023-01-25T16:44:29.114Z", "postId": "KXSBb2zgkLE6gnn3K", "htmlBody": "<p>Thank you for writing this. This is awesome.</p>", "parentCommentId": null, "user": {"username": "alene"}}, {"_id": "rCKSbsWBH5aSSgi6p", "postedAt": "2023-01-25T21:26:20.991Z", "postId": "KXSBb2zgkLE6gnn3K", "htmlBody": "<p>Appreciate the support!</p>", "parentCommentId": "vcntDnxMkhjRq5Woy", "user": {"username": "bob-fischer"}}]