[{"_id": "HJqpeqEmRbbmdDRmd", "postedAt": "2017-08-13T10:29:26.248Z", "postId": "KZz5ajM5gLfY29SCH", "htmlBody": "<p>Hello Thomas,</p>\n<blockquote>\n<p>no cost-effectiveness estimates comparing near-term causes</p>\n</blockquote>\n<p>On reflection, I should state 'there's only one model' rather than 'there are none' but mention one in the footnote. I guess I meant, which is still true, &quot;there are no models I known how to use&quot;...</p>\n<blockquote>\n<p>ix Ways DPR Could Do Good, yet your quantitative model only seems to take into account the first of these, improved treatment for mental health. </p>\n</blockquote>\n<p>I think the mental health effect is the biggest, it's also the easiest to think about because I know what the numbers are - it would take me a long time to assess the happiness impact of DPR caused by reducing crime (how much happiness does a crime remove? how many are there around the world? how many of those are attributable to drugs? etc...). I don't plan to do any further modelling as I need to get back to my thesis and the detail of DPR now looks like it will be outside it. FWIW, I think the mental health impact of DPR is about 80% of it's value, but when I asked Lee the same question (before telling him my view) I think he said it was about 30% (we were potentially using different moral philosophies).</p>\n<blockquote>\n<p>Does this assume that every single person suffering from depression or anxiety in the UK will adopt the new treatment? </p>\n</blockquote>\n<p>Yeah, I'm not clear on this. It's probably unreasonable to assume everyone would get/use the new treatment, although that's what I initially thought. I take the 0.1 as the (mean) average change across all those could be treated.</p>\n<blockquote>\n<p>You assume a 0.1 change</p>\n</blockquote>\n<p>I just guessed the number based on (a) the happiness impact of removing depression via other methods and (b) my qualitative sense from reading the studies of how much more effective psychedelics seems to be than alternatives. If there's a cardinal scale I can use that shows how much better psychedelics are that would be great, but I didn't dig through because doing something like what Lovisa and Konstantin did didn't occur to me.</p>\n<blockquote>\n<p>with regard to the £166m figure. It would be useful to get an order of magnitude estimate of the cost of past campaigns</p>\n</blockquote>\n<p>I agree it would be good to do this. I looked into this a bit but couldn't find anything useful on the cost-effectiveness of lobbying (I skimmed your paper too; it doesn't really bear on the question at hand). It's also a long way from my area of expertise and thought I was better to share what I had rather that wait until I'd found time to dig into this (which may not happen for months). If anyone read this and wanted to have a go, I'd be very grateful.</p>\n<p>FWIW, two more things, 1) I think £166m figure is conservative and the real figure is closer to £10.5bn. </p>\n<p>2) This is compared to AMF. As I note above and have argued elsewhere, you would have you to hold a particular, implausible philosophical view to believe AMF is as cost-effective as I stated; I was being generous to my imagined critics. A more realistic comparison is probably Basic Needs, which I say above is about 3x less cost-effective than AMF on AMF's unbelievable numbers, So really we should multiply the ammount we would spend on a DPR campaign by three to get something like £560m (conservative) or £35bn (optimistic).</p>\n", "parentCommentId": "5QgAtvoYYMXJFSTJK", "user": {"username": "MichaelPlant"}}, {"_id": "kGKZFzpTkhQzBj9vb", "postedAt": "2017-08-15T23:25:01.118Z", "postId": "KZz5ajM5gLfY29SCH", "htmlBody": "<p>Thanks - very interesting. Could an EA pay for drug medical studies in Portugal? It seems like there are millions of people working on marijuana legalization, and many critics of the war on drugs. I know you are looking more holistically, but overall it doesn't seem that neglected. </p>\n<blockquote>\n<p>For those who think something else is more important, I would be very grateful if you could produce some (very rough) estimates of how many times more cost effective money to their preferred cause is than DPR.</p>\n</blockquote>\n<p>Some people would say <a href=\"https://nickbostrom.com/astronomical/waste.html\">~10^40 times</a> (computer consciousnesses and spreading intergalactically). Of course there are many reasons why this vision may not pan out, but it does seem like we should have a non-negligible probability that we are alone in the galaxy (or even the visible universe) and that we can and have the will to colonize the stars if we don't destroy ourselves. These qualifiers might only take a few orders of magnitude off. Then even if you do not believe in the tractability of AI, there are many other concrete interventions that could reduce existential risk, like <a href=\"http://users.physics.harvard.edu/~wilson/pmpmta/Mahoney_extinction.pdf\">asteroid defense</a> and <a href=\"https://en.wikipedia.org/wiki/Feeding_Everyone_No_Matter_What\">alternate foods</a>. So basically I do not believe the prior of cost effectiveness of global poverty interventions should be strong, so I don't think we should adjust these expected value calculations downward nearly as much as some proposed models have done. </p>\n<p>Also, if one does not value the far future, there are other claims of cost effectiveness <a href=\"http://effective-altruism.com/ea/14y/saving_expected_lives_at_10_apiece/\">better than global poverty</a>.</p>\n", "parentCommentId": null, "user": {"username": "Denkenberger"}}, {"_id": "oGYYpJJPoYFzKHA5s", "postedAt": "2017-08-16T20:30:07.283Z", "postId": "KZz5ajM5gLfY29SCH", "htmlBody": "<p>Hey Denkenberger, thanks for your comment. I too tend to weight the future heavily and I think there are some reasons to believe that DPR <em>could</em> have nontrivial benefits with this set of preferences. This was in fact why, as Michael mentions above:</p>\n<blockquote>\n<p>&quot;FWIW, I think the mental health impact of DPR is about 80% of it's value, but when I asked Lee the same question (before telling him my view) I think he said it was about 30% (we were potentially using different moral philosophies).&quot;\nbecause I think DPR's effects on the far future could be the source of most of its expected value. </p>\n</blockquote>\n<p>DPR sits at the juncture between international development &amp; economic growth, global &amp; mental health, national &amp; international crime, terrorism, conflict &amp; security, and human rights. I think we should expect solving the world drug problem to improve some or all of these issues, as Michael argued in the series. </p>\n<p>I think it could be easy to overlook the expected benefits of significant reductions in funding and motivation for crime, corruption, terrorism, and conflict for fostering a stable, trusting global system. My weak conjecture is that such reductions would bring an array of global benefits composed of reduced out-group fear (on community and international levels), stronger institutions, and richer societies. </p>\n<p>DPR might thus offer a step in the right direction towards solving issues of global coordination, which in turn may increase our expectations for solving the coordination problem for AI and, thence, the long-term future. I admit this is a fairly hand-wavy notion and that the causal chains are undesirably long and uncertain, relying on unpredictable assumptions (such as the timing of an intelligence takeoff compared with the length of time it would take to observe the international social benefits, for a start). My confidence intervals are therefore commensurately wide, but still I struggle to think of ways in which it could be net negative for global coordination. So almost all of my probability weight is positive. Multiplied by humanity's cosmic endowment, I weigh this relatively heavily. Of course, there may be other, more certain activities that we can do to improve the EV of humanity's future, and I think there are, but I don't think DPR is obviously a waste of time if that's what we care about. </p>\n", "parentCommentId": "kGKZFzpTkhQzBj9vb", "user": {"username": "Lee_Sharkey"}}, {"_id": "w9iTSBCFw9jpgdg8i", "postedAt": "2017-08-21T21:44:28.731Z", "postId": "KZz5ajM5gLfY29SCH", "htmlBody": "<p>This is a very impressive series. My fiancé and I are focused on animal and far-future causes at the moment, but he had been pushing for us to choose a mental health charity to the extent we'd focused on present-day humans. I'm going to send this his way, as I think he'll appreciate it.</p>\n", "parentCommentId": null, "user": {"username": "zdgroff"}}, {"_id": "LLWw8s7rFtnD7KjvZ", "postedAt": "2017-08-22T16:18:30.045Z", "postId": "KZz5ajM5gLfY29SCH", "htmlBody": "<p>good to hear!</p>\n", "parentCommentId": "w9iTSBCFw9jpgdg8i", "user": {"username": "MichaelPlant"}}, {"_id": "nXpmuJCffkoZfMjkA", "postedAt": "2017-08-23T12:51:29.692Z", "postId": "KZz5ajM5gLfY29SCH", "htmlBody": "<p>thanks</p>\n", "parentCommentId": null, "user": {"username": "maxbale"}}, {"_id": "uyR83GxTjMC9Zd8Wt", "postedAt": "2017-08-29T06:59:00.311Z", "postId": "KZz5ajM5gLfY29SCH", "htmlBody": "<p>I'm a huge supporter of drug policy reform and try to advocate it as much as I can in my personal life.  Originally, I was going to post here suggesting we need a better breakdown of particular issues which are particularly ripe for policy reform (say reforming how drug weights are calculated)\n and the relative effectiveness of various interventions (lobbying, ads, lectures etc..).</p>\n<p>However, on reflection I think there might be good reasons not to get involved in this project.</p>\n<p>Probably the biggest problem for both EA and drug policy reform is the perception that the people involved are just a bunch of weirdos (we're emotionally stunted nerds and they are a bunch of stoners).  This perception reduces donations to EA causes (you don't get the same status boost if its weird) and stops people from listening to the arguments of people in dpr.</p>\n<p>If EA is seen as being a big supporter of DPR efforts this risks making the situation worse for both groups.  I can just imagine an average lesswrong contributor being interviewed on TV as to why he supports dpr and when the reporter asks him how this affects him personally he starts enthusiastically explaining his use of nootropics and the public dismisses the whole thing as just weird druggies trying to make it legal to get high.  This doesn't mean those of us who believe in EA can't quietly donate to dpr organizations but it probably does prevent us from doing what EA does best, determining the particular interventions that work best at a fine grained level and doing that.</p>\n<p>This makes me skeptical this is a particularly good place to intervene.  If we are going to work in policy change at all we should pick an area where we can push for very particular effective issues without the risk of backlash (to both us and dpr organiations).</p>\n", "parentCommentId": null, "user": {"username": "TruePath"}}, {"_id": "PLrkFaW8jprRPExrx", "postedAt": "2017-08-29T09:39:22.558Z", "postId": "KZz5ajM5gLfY29SCH", "htmlBody": "<p>You could have written the same thing 2 years ago replacing &quot;drug policy reform&quot; with &quot;artificial intelligence&quot; and made exactly the same argument: &quot;AI is weird, it will damage EA, imagine interviewing an AI nerd like Elon Musk on tv, etc&quot;. Except lots of people now take AI seriously, it's received lots of public money and attention and lots is getting done.This is presumably because the arguments for AI were strong. </p>\n<p>You seem to be presenting me with a Morton's Fork (a false dilemma caused by contradictory observations reaching the same conclusons): &quot;if X is seen as weird, don't work on it. If X is not seen as weird, then it can't be neglected so there's no point working on it either.&quot; This can't be right, because it would rule out every cause.</p>\n<p>I think the role EA fills in the world is exactly finding the important problems in the world others are ignoring, perhaps because those problems seem to weird, and then argue they are worth taking seriously. Notice there's something odd about saying &quot;I've become convinced the arguments for X are very strong, but no one else will be convinced so let's abandon cause X&quot;. If you found argument for X persuasive, others probably will too and X is well worth working on. Clearly, we should avoid arguing for weird causes that would do no good. I didn't think DPR was important, now I think it's very substantial.</p>\n<p>More generally, I think concerns about reputation and backlash our overstated (#spotlight effect), but I'd be open to someone showing me evidence to the contrary. </p>\n", "parentCommentId": "uyR83GxTjMC9Zd8Wt", "user": {"username": "MichaelPlant"}}, {"_id": "SFSMTbN9gM3a5GJc3", "postedAt": "2017-08-29T09:53:04.381Z", "postId": "KZz5ajM5gLfY29SCH", "htmlBody": "<p><a href=\"http://www.maps.org/gmp\">http://www.maps.org/gmp</a> :</p>\n<blockquote>\n<p>Donate to Make MDMA a Legal Medicine</p>\n</blockquote>\n<blockquote>\n<p>Research is showing that MDMA combined with psychotherapy can be an effective option for people who haven't been helped by other treatments for posttraumatic stress disorder (PTSD). PTSD can be caused by trauma from war, sexual assault, violence, accidents, natural disasters, and other stressful events.</p>\n</blockquote>\n<blockquote>\n<p>You can help make MDMA a legal medicine and heal people suffering from trauma by making a tax-deductible gift to fund Phase 3 clinical trials of MDMA-assisted psychotherapy for PTSD.</p>\n</blockquote>\n<blockquote>\n<p>[...]</p>\n</blockquote>\n<blockquote>\n<p>We estimate that it will take $870,000 to complete our Phase 2 studies, and roughly $25 million to complete Phase 3 and establish MDMA-assisted psychotherapy as a legally available treatment. </p>\n</blockquote>\n", "parentCommentId": null, "user": {"username": "ChristianKleineidam"}}, {"_id": "7J5TmXLFy5jc3B7Ar", "postedAt": "2017-08-29T10:07:29.846Z", "postId": "KZz5ajM5gLfY29SCH", "htmlBody": "<p>I don't think the average nootropics user would appear to have a goal of getting a legal high in a television broadcast.</p>\n<p>It's more interesting for a journalist to tell a story about a computer programmer who takes LSD to help him with a difficult programming problem on which he worked for months without a satisfying answer than to tell a story about the computer programmer wanting to get high with LSD. </p>\n<p>The story about how nerds in Silicon Valley do everything to enchance their performance is more interesting than the story about a random person taking drugs.</p>\n<p>More generally EA is also full of weird causes as Scott Alexander describes very well in his blog post about EA Global. </p>\n", "parentCommentId": "uyR83GxTjMC9Zd8Wt", "user": {"username": "ChristianKleineidam"}}, {"_id": "EQXdpNdsC7qZekQBC", "postedAt": "2019-04-30T07:32:39.381Z", "postId": "KZz5ajM5gLfY29SCH", "htmlBody": "<html><head></head><body><p>Are the drugs you're talking about actually cheaper than existing treatments for depression? That surprised me a lot.</p>\n</body></html>", "parentCommentId": null, "user": {"username": "Khorton"}}]