[{"_id": "qZ6ntmiY5PGFyTn3F", "postedAt": "2017-07-03T16:56:26.205Z", "postId": "L32odKCdp7xqJ3p5w", "htmlBody": "<p>Interesting strategy, focusing on building networks rather than direct activities. Will be very curious to see if this works!</p>\n", "parentCommentId": null, "user": {"username": "casebash"}}, {"_id": "nu8RF9yZh3ZY2KeaD", "postedAt": "2017-07-03T18:06:02.254Z", "postId": "L32odKCdp7xqJ3p5w", "htmlBody": "<p>First off: sign me up. There's a bunch of (potentially) relevant networks I'm connected into in Leiden, e.g. Amnesty, ISN (International student network), LDU (Leiden Debating Union), EUSA (European Student Association), but in which I have yet not been able to get through the change I should have pushed harder for. For example, I once had the idea to set up a debating tournament as to not only raise awareness, but do so amongst those who would be most open to its message and most able to then do something about it, namely debaters. This particular idea might not be as feasible as I once thought it was, but there's always other opportunities to be thought of. </p>\n<blockquote>\n<p>Here are potential network collaborations that we’re exploring right now:\nLocal/student groups \nThese would clearly define their target groups and offer newcomers a path to learn about EA principles and build up their capacity to do good (established groups like EA London and EA Berkeley are inspirations to us here).</p>\n</blockquote>\n<p>Based on having been in a book club with a community of about ~300 individuals, it's really difficult to get a large group of individuals to be consistently involved. It follows that this strategy has a high risk of failing, demotivating those involved in the failure from staying involved in EA. If you want to go ahead with this, it needs to be thought out well. </p>\n", "parentCommentId": null, "user": {"username": "DardanBastiaan"}}, {"_id": "tjhnohkcqioj6xBGK", "postedAt": "2017-07-03T22:49:24.783Z", "postId": "L32odKCdp7xqJ3p5w", "htmlBody": "<p>Thanks for the points!</p>\n<p>First off, you might be interested in helping continue the EA Leiden group (the current organiser has just finished her Masters and is going back to Germany): <a href=\"https://www.facebook.com/?_rdr#~!/profile.php?id=100015874785676\">https://www.facebook.com/?_rdr#~!/profile.php?id=100015874785676</a>\nPlease let me know if you want me to connect you with her. </p>\n", "parentCommentId": "nu8RF9yZh3ZY2KeaD", "user": {"username": "remmelt"}}, {"_id": "MRhYW8rW2TZetyvwQ", "postedAt": "2017-07-03T23:17:00.816Z", "postId": "L32odKCdp7xqJ3p5w", "htmlBody": "<p>Ah, I totally missed about a chapter having opened this april. But yes: I'd be very much interested in helping continue the EA Leiden group, so feel free to connect me with the current organiser. </p>\n", "parentCommentId": "tjhnohkcqioj6xBGK", "user": {"username": "DardanBastiaan"}}, {"_id": "g8DHAEvwEZtyfmoBC", "postedAt": "2017-07-03T23:19:34.674Z", "postId": "L32odKCdp7xqJ3p5w", "htmlBody": "<p>Second, I lean towards focusing on enabling a handful of small number of highly-committed and capable people in a network instead of trying to shift hundreds of people towards EA. </p>\n<p>Besides the outsized impact that these few individuals can have, the time cost of coordinating a large group of slightly motivated people (as you alluded to) and the difficulty of fostering a rigorous EA culture and network effects within such a group for those who the concept 'clicks', mean that I personally have a strong preference for quality over quantity (similar to Kevin Kelly's 1000 true fans concept or Y Combinator's advice of focusing on making initial customers love the product). </p>\n<p>To some extent, EAN's strategy leans this way because we focus on building EA Networks instead of influencing existing networks. </p>\n<p>The broad reasoning done by Sjir and I (based in part on useful advice given by others in the community) are build on layers of unproven assumptions. I can imagine counterexamples for local groups such as having low cost, low bar ways of getting people acquainted with EA like pub socials, to help build up a core circle of people. </p>\n<p>In general, I want to be wary though of aiming for short-term effects by collecting many people instead of building up our collective capacity to solve big problems. </p>\n", "parentCommentId": "tjhnohkcqioj6xBGK", "user": {"username": "remmelt"}}, {"_id": "7o9RobWq4jSfAFrnq", "postedAt": "2017-07-04T11:33:15.269Z", "postId": "L32odKCdp7xqJ3p5w", "htmlBody": "<p>Looking at the list of friends to the Leiden chapter, I am impressed with both the amount of people on it as well as with the amount of talent I know some of these folk to possess. On the other hand, the activities thus far planned out and put out there these past few months, based on for example the 2 people that attended the last event, seem to have been largely unsuccessful. </p>\n<p>There is a middle road, I think, combining the best of both our views. Rather than having a core group hosting activities which very few would attend, I envision having a core group that first raises awareness throughout Leiden and otherwise working pragmatically, which could include hosting events, to further the EA agenda. If some of these people are anything I know them to be, i.e. highly talented, motivated individuals, then we'd be able to stick together based on our shared passion and desire for a stimulating environment alone. The risk of such a group falling apart would in that sense be far smaller than what I had estimated it to be in my previous post. </p>\n<p>Anyway, again, I very much look forward to working more closely with you and those already active in Leiden. </p>\n", "parentCommentId": "g8DHAEvwEZtyfmoBC", "user": {"username": "DardanBastiaan"}}, {"_id": "PTeYdwGqh83WeCwJX", "postedAt": "2017-07-04T14:03:03.778Z", "postId": "L32odKCdp7xqJ3p5w", "htmlBody": "<p>Yes, I think connecting with potentially interested people on existing platforms makes sense for local groups, as an example. The subtle difference for me is that you wouldn't try to 'convert' the entire existing network but instead have targeted conversations with participants (e.g. talking with altruistic, analytical people at an Amnesty event or inviting people to schedule a cup of coffee at the end of your own event). </p>\n<p>I'll connect you with the current organiser. Looking forward to exploring this idea further with you!</p>\n", "parentCommentId": "7o9RobWq4jSfAFrnq", "user": {"username": "remmelt"}}, {"_id": "vFuN9JmMSdHrTjmcf", "postedAt": "2017-07-14T16:14:20.516Z", "postId": "L32odKCdp7xqJ3p5w", "htmlBody": "<p>suggestion for possible low hanging fruit: getting DGB, The life you can save, and 80k into all the libraries in netherlands. Im constantly surprised how few libraries have the books in sweden, and the benefit of it is that once you get it in, at least a few people will read it, and it gets easier for a potental EA to get into EA if there is good reading material in their vicinity. thats my idea at least</p>\n<p>other then that, i'll be going to Fest i Nord (a mormon convent), and i'll likely meet someone from netherlands. I'll be sure to mention the EAN to them!</p>\n", "parentCommentId": null, "user": {"username": "Vincent-Soderberg"}}, {"_id": "hjiP4tf4x8rQNzbsd", "postedAt": "2017-08-11T13:18:04.270Z", "postId": "L32odKCdp7xqJ3p5w", "htmlBody": "<p>I had missed your comment, Vincent, so here's a late reply. :-)</p>\n<p>I like your idea of distributing introductory books to EA through libraries (especially university colleges, where students seem more multidisciplinary and idealistic). Last May, we actually collaborated with a publisher to get a <a href=\"http://www.lemniscaat.nl/Non-fictie/Filosofie/titels/9789047709442/Effectief%20altruisme\">new translated book</a> of Peter Singer out.</p>\n<p>Here's the deal. From my perspective, it will probably take too much time and attention away from EAN to directly work on distributing the books. Our current strategy for representing EA publicly in the Netherlands is to do it in limited, low marginal cost ways – through our online channels and invitations from media or lecture platforms (this falls under strategy point 4: EA-related in the Netherlands). </p>\n<p>I think we should aim to become extremely competent by specialising in these approaches, which also means not getting distracted by other outreach opportunities (unless focusing on one of those instead will contribute more to building a thriving EA community). </p>\n<p><strong>To explore this concept more deeply:</strong></p>\n<p>People tend to <a href=\"http://www.econlib.org/library/Essays/hykKnw1.html\">naturally specialise</a> in economic markets. This seems more difficult in the EA community because in a transaction, a product (information, skills, and other forms of capital) is often not offered in return for currency units (a medium of exchange) but instead in the expectation of reciprocity (that the other party is 1. aligned enough with your consequentialist preferences and 2. capable of fulfilling these moral preferences sufficiently using what you give them). It's not even barter (the exchange of products as would be done in moral trade, i.e. where moral preferences diverge) but the formation of trust-based partnerships towards shared long-term goals.</p>\n<p>My hope (and what we're testing) is that collaborating on building a fractal social network structure – with EAs clustering around different adaptable network targets with corresponding specialised expertise at each layer – would result in a more optimal division of labour.</p>\n<p>So should a competent organiser in the Netherlands reach out to us wanting to build an 'EA Literature network', we'd be open to exploring this! </p>\n", "parentCommentId": "vFuN9JmMSdHrTjmcf", "user": {"username": "remmelt"}}]