[{"_id": "q4mfaK3nNiimFLypQ", "postedAt": "2022-09-23T17:06:02.741Z", "postId": "L3WPuztkSMohBTWqZ", "htmlBody": "<p>Thanks for working so hard on this! Great stuff.</p>", "parentCommentId": null, "user": {"username": "Kevin Kuruc"}}, {"_id": "tfkytCjEoWTCKTww2", "postedAt": "2022-09-23T17:11:25.544Z", "postId": "L3WPuztkSMohBTWqZ", "htmlBody": "<p>Thanks! And thanks for presenting!!</p>", "parentCommentId": "q4mfaK3nNiimFLypQ", "user": {"username": "trammell"}}, {"_id": "douj8JCBatwmEZvGy", "postedAt": "2022-10-01T20:35:55.522Z", "postId": "L3WPuztkSMohBTWqZ", "htmlBody": "<p>So many of these topics seem really interesting to me personally that your saying \"It was designed primarily for economics graduate students considering careers in global priorities research.\" made me wonder: Is there something similar for people with a less robust background in economics? Maybe for economics (or political science) <i>under</i>graduate students? :)</p>", "parentCommentId": null, "user": {"username": "Dario Citrini"}}, {"_id": "xPXTgHfvT9ykd9hFt", "postedAt": "2022-10-03T10:35:21.804Z", "postId": "L3WPuztkSMohBTWqZ", "htmlBody": "<p>Glad to hear you find the topics interesting!</p><p>First, I should emphasize that it's not designed <i>exclusively</i> for econ grad students. The opening few days try to introduce enough of the relevant background &nbsp;material that mathematically-minded people of any background can follow the rest of it. As you'll have seen, many of the attendees were pre-grad-school, and 18% were undergrads. My impression from the feedback forms and from the in-person experience is that some of the undergrads did struggle, unfortunately, but others got a lot out of it. Check out the materials, and if you think you'd be a good fit, you're more than welcome to apply for next year.</p><p>That said, I agree that a more undergrad-focused version of the program would be valuable. I don't have plans to make one myself in the near future, but I would like to at some point. In the meantime, if anyone reading this wants to do it, please feel free to reach out!</p>", "parentCommentId": "douj8JCBatwmEZvGy", "user": {"username": "trammell"}}]