[{"_id": "kAjY69JxSiAvSnzHB", "postedAt": "2022-11-13T21:24:25.806Z", "postId": "L4S2NCysoJxgCBuB6", "htmlBody": "<p>Hm, how could this interact with hypothetical clawbacks?</p><p>E.g.</p><ol><li>your org has $0</li><li>your org receives $100 from FTXF, now your org has $100</li><li>your org spends $50 of that money, and then decides to stop</li><li>your org receive $10 from Nonlinear, now your org has $60</li><li>the clawback effort comes to your org and says \"hey we need $100\". org say \"I don't have $100, I only have $50\"</li><li>Does the clawback effort then say \"No actually you have $60, we're taking all $60\" because of money fungibility?</li></ol>", "parentCommentId": null, "user": {"username": "ChrisLakin"}}, {"_id": "7wvBmpifopBuJBg8A", "postedAt": "2022-11-13T21:40:51.761Z", "postId": "L4S2NCysoJxgCBuB6", "htmlBody": "<p>I do think this is a good question, but on the other hand clawbacks will take months or years to happen. If an org expects to hold on to this money for that much time, <em>emergency</em> funding should probably be directed elsewhere.</p>\n", "parentCommentId": "kAjY69JxSiAvSnzHB", "user": {"username": "Guy Raveh"}}, {"_id": "buChBtEYAWRHRTh76", "postedAt": "2022-11-13T21:52:42.742Z", "postId": "L4S2NCysoJxgCBuB6", "htmlBody": "<p>There is probably way too much in the air for anyone to answer your question, especially at that level of generality.</p>\n<p>This is a opportunity for bridge funding, so presumably the grantee would have spent additional funds in the amount of the bridge grant that they would not have spent otherwise.</p>\n<p>So the risk that Nonlinear's generosity ends up in the bankruptcy estate somehow seems acceptable to me given the strong argument for the program, the amounts involved, and the low likelihood of clawback litigation against small grantees in the very near term (there are bigger fish for the estate to go after first).</p>\n", "parentCommentId": "kAjY69JxSiAvSnzHB", "user": {"username": "Jason"}}, {"_id": "rKAx6qnYKutnPEvaw", "postedAt": "2022-11-13T22:03:39.210Z", "postId": "L4S2NCysoJxgCBuB6", "htmlBody": "<p>I don't really understand the specific situation your describing, and this is not legal advice, but I think in general one can say that if how much money \"your org\" has (wherever they get it from) shouldn't really influence the size or validity of a hypothetical clawback claim, but it of course might influence if the claim is persued and how much money the claimer might actually be able to get from \"your org\".</p>", "parentCommentId": "kAjY69JxSiAvSnzHB", "user": {"username": "Aleks_K"}}, {"_id": "5P75dFuKLo894MQFf", "postedAt": "2022-11-13T22:10:20.837Z", "postId": "L4S2NCysoJxgCBuB6", "htmlBody": "<p>[EDIT: I'd like to clarify that, strictly speaking, the comment below is gossip without hard substantiating evidence. Gossip can have an important community function - at the very least, from this comment you can conclude that things happened at Nonlinear which induced people (in fact, many people) to negatively gossip about the organization - but should also be treated as different from hard accusations, especially those backed by publicly available evidence.  In the wake of the FTX fiasco, I think it's likely that people are more inclined to treat gossip of the sort I share below as decisive.</p>\n<p>That said, I do think that the gossip below paints a basically accurate picture. I also have other reasons to distrust Nonlinear that I don't feel comfortable sharing (more gossip!). I know this is hard epistemic territory to work in, and I'm sorry. I would feel best about this situation if someone from, e.g., CEA would talk to some of the people involved, but I'm sure anyone who could deal with this is swamped right now. In the meantime, I think it's fine for this gossip to make you unsure about Nonlinear, but still  e.g. consider applying to them for emergency funding. I personally wouldn't, but I have different information from you, and a community which overindexes on gossip will have problems.]</p>\n<p>Considering recent events, I feel that I ought to share the following:</p>\n<p>Based on things I've heard from various people around Nonlinear, Kat and Emerson have a recent track record of conducting Nonlinear in a way inconsistent with EA  values. More specifically, they have a history of mistreating their employees and interns, and of not fulfilling obligations to them, including financial obligations and mentorship they promised to provide. I have general sense that they had a pattern of taking on young, idealistic  interns with poor ability to stand up for themselves and exploiting them to a standard many would consider unacceptable (e.g. manipulating them into accepting unreasonably little pay, and sometimes not following through on payment when they thought they could get away with it).</p>\n<p>As I understand things, in July 2022 a group of Nonlinear employees and interns quit because they were unhappy with either their own treatment or the treatment of their coworkers.</p>\n<p>I've also heard that Emerson can be retributive, and that some people around Nonlinear were scared about Emerson finding out they'd spoken badly about him. (Generally speaking, to the extent that things were bad at Nonlinear, I have the general sense that Emerson, and not Kat, was the main source of bad behavior.)</p>\n<p>I feel quite conflicted about posting this because:</p>\n<ul>\n<li>The people I've spoken to also think that Nonlinear has done a lot of good, despite their mistreatment of employees and interns. But I've recently become quite weary of this \"ends justify the means\"-type reasoning.</li>\n<li>I can't share any specifics because anything specific was told to me in confidence; I also have no way of knowing whether the things I've heard were exaggerated. Additionally, a lot of what I was told I remember only vaguely.</li>\n<li>Given that none of the people wronged spoke up, it's not clear that I should (due to concerns about the reliability of secondhand knowledge, for example).</li>\n<li>The EA community certainly doesn't need any more drama right now.</li>\n</ul>\n<p>But I decided to post anyway because I like to think that I've learned the hazards of waiting until after misbehavior is publicly revealed to write about the evidence that I had all along. Sorry for any unfortunate consequences of this comment.</p>\n<p>If someone trusted would like to verify my identity and that I could plausibly have knowledge about this, I'd be willing to share my identity in a direct message.</p>\n", "parentCommentId": null, "user": {"username": "anonymous-7"}}, {"_id": "fXiqLoDWCcRXQofby", "postedAt": "2022-11-13T22:59:52.851Z", "postId": "L4S2NCysoJxgCBuB6", "htmlBody": "<p>This wouldn't be that surprising, because Nonlinear are known to have violated various kinds of mild norms previously - they named an eponymous <a href=\"https://forum.effectivealtruism.org/posts/bvK44CdpG7mGpQHbw/the-usd100-000-truman-prize-rewarding-anonymous-ea-work\">prize</a> without consent from the named person or their estate, and they set up a <a href=\"https://forum.effectivealtruism.org/posts/cTQfWpobqk4nDWsfG/new-use-the-nonlinear-library-to-listen-to-the-top-ea-forum\">podcast</a> using text-to-speech without obtaining copyright permissions from the authors of the text.</p>", "parentCommentId": "5P75dFuKLo894MQFf", "user": {"username": "Robert Z"}}, {"_id": "WnB9BGJ6HguB9vcah", "postedAt": "2022-11-13T23:22:31.320Z", "postId": "L4S2NCysoJxgCBuB6", "htmlBody": "<p>More minorly, they also manipulate things like voting scores on the EA forum (and pay a lot of attention to online presence).&nbsp;</p><p>&nbsp;</p><p><strong>More substantively but with greater uncertainly:&nbsp;</strong></p><p>Back in 2021, there were a bunch of potential EA meta orgs, that are essentially natural monopolies, there can only be one. As another feature, these meta EA orgs naturally have to attract/involve a lot of EA resources and talent. The nature of these potential orgs is that they have less legible or viewable output (than say, distributing mosquito nets or producing research).</p><p>1+ grantmakers at a major EA grantmaking organization said it's known people didn't have ideal views on them (but suggested I meet with Kat because we had to, they were in the space).&nbsp;</p><p>After the meeting, I got a bit of an elbowing/redirection vibe, which in hindsight was extremely not justifiable by their output.</p>", "parentCommentId": "fXiqLoDWCcRXQofby", "user": {"username": "Anonymous (for unimpressive reasons =[ )"}}, {"_id": "pL87YnfSGeedD8min", "postedAt": "2022-11-13T23:29:02.781Z", "postId": "L4S2NCysoJxgCBuB6", "htmlBody": "<p>Hi anonymous,</p><p>Thank you for sharing your concerns, though we do not feel this is the relevant or appropriate venue to discuss anonymous accusations from a former intern(s) without first discussing them privately, especially given the personal issues of the ex-interns involved and the fact that every organization has disgruntled former interns/employees.</p><p>Importantly, key details of the above can be easily proven false. For example, the outflux of people was just two people, who we have verifiable evidence we paid as much as we committed to.&nbsp;</p><p>We are DMing you right now, and if you do not respond promptly, we will respond publicly.</p>", "parentCommentId": "5P75dFuKLo894MQFf", "user": {"username": "katherinesavoie"}}, {"_id": "FwWFsmJbRRRf9mjPE", "postedAt": "2022-11-13T23:31:45.975Z", "postId": "L4S2NCysoJxgCBuB6", "htmlBody": "<p>What is the evidence for manipulating voting scores? Feel free to say you can't share, but if it can be publicly evidenced in some way, as it seems it might, that would be more informative.</p>", "parentCommentId": "WnB9BGJ6HguB9vcah", "user": {"username": "Perkins"}}, {"_id": "HnszKBbMq78pmKnEx", "postedAt": "2022-11-13T23:36:56.147Z", "postId": "L4S2NCysoJxgCBuB6", "htmlBody": "<p>To clarify:</p>\n<ul>\n<li>I never worked with Nonlinear.</li>\n<li>I haven't specified whether I heard my info from the employees/interns themselves. (My language was \"Based on things I've heard from various people around Nonlinear.\")</li>\n<li>I never used the word \"outflux,\" but rather \"group.\" That said, I believe that Kat is right about it being only two people (I had thought I remembered three, but I now think that was wrong).</li>\n<li>I think it's plausible but not &gt;50% likely that this is based on the exaggerated report of an ordinary disgruntled employee. [EDIT: actually, considering other negative gossip I've heard about Nonlinear, I'd be extremely surprised if this was all downstream of an exaggerated report from a single person.] I'm pretty unsure whether it was a good idea to post this. Sorry if I made the wrong call.</li>\n</ul>\n", "parentCommentId": "pL87YnfSGeedD8min", "user": {"username": "anonymous-7"}}, {"_id": "gdnwNRFGXH5vr624R", "postedAt": "2022-11-13T23:41:06.060Z", "postId": "L4S2NCysoJxgCBuB6", "htmlBody": "<p>Unfortunately it seems like every major EA organisation will have allegations like this against them at some point.</p>", "parentCommentId": "5P75dFuKLo894MQFf", "user": {"username": "Perkins"}}, {"_id": "wZRFgTxrBYZka2gDt", "postedAt": "2022-11-13T23:43:46.009Z", "postId": "L4S2NCysoJxgCBuB6", "htmlBody": "<p>(n.b., My comment was referring to a quote in Kat's comment that they edited out at some point after I posted this.)</p><p>That blatant misquote is minor in the scheme of things but seems concerning.</p>", "parentCommentId": "HnszKBbMq78pmKnEx", "user": {"username": "Perkins"}}, {"_id": "NzuqH4Lcp8MzG97tu", "postedAt": "2022-11-13T23:59:11.126Z", "postId": "L4S2NCysoJxgCBuB6", "htmlBody": "<p>What you did was valuable, useful and brave.</p><p>&nbsp;</p><p><strong>With difficulty, trying to communicate in a way </strong><a href=\"https://forum.effectivealtruism.org/posts/7hCCdw8LhWFiMjCff/a-common-failure-for-foxes\"><strong>that gets at the heart of the issue and not pick out facts</strong></a><strong> and tries to be fair:&nbsp;</strong></p><p>My guess (50% true/certain) is that it's probably fair to say that Kat and Emerson have a bit of a hustle vibe (I mean look at <a href=\"https://www.nonlinear.org/about.html\">Emerson's description</a>).</p><p><img src=\"https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/1f827bd0a42eee795b16b0a26f6abdbe666a05c1782572ca.png\" srcset=\"https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/1f827bd0a42eee795b16b0a26f6abdbe666a05c1782572ca.png/w_90 90w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/1f827bd0a42eee795b16b0a26f6abdbe666a05c1782572ca.png/w_180 180w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/1f827bd0a42eee795b16b0a26f6abdbe666a05c1782572ca.png/w_270 270w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/1f827bd0a42eee795b16b0a26f6abdbe666a05c1782572ca.png/w_360 360w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/1f827bd0a42eee795b16b0a26f6abdbe666a05c1782572ca.png/w_450 450w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/1f827bd0a42eee795b16b0a26f6abdbe666a05c1782572ca.png/w_540 540w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/1f827bd0a42eee795b16b0a26f6abdbe666a05c1782572ca.png/w_630 630w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/1f827bd0a42eee795b16b0a26f6abdbe666a05c1782572ca.png/w_720 720w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/1f827bd0a42eee795b16b0a26f6abdbe666a05c1782572ca.png/w_810 810w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/1f827bd0a42eee795b16b0a26f6abdbe666a05c1782572ca.png/w_827 827w\"></p><p>Like I would do, and you would do, they try to maximize their local success. However, their output hasn't been extremely high. There might be a small departure from some EA cooperate norms, that might be due cultural differences.</p><p>&nbsp;</p><p><strong>With the greatest uncertainty, but the most importance?: </strong>I think the potentially major issue is that by trying to sit as a meta org, Nonlinear can attract inflows of EA talent that scales with the movement (and not their ability), and also self-replicate. That is bad for movement health and incentives. EA is also small enough (and the course has seen a negative trajectory) that this could be an issue, e.g. the lemons sit in the aftermath, there's a path dependency. The communication/publicity maximization adds to this concern.</p><p>As this thread shows, they are unpopular enough at this point, that I think the concerns are probably minor, like top #30-50 item on the list of things that CEA or OP needs to worry about in the next year or two.</p>", "parentCommentId": "HnszKBbMq78pmKnEx", "user": {"username": "Anonymous (for unimpressive reasons =[ )"}}, {"_id": "iqgG5iYEtFzKH8Jy8", "postedAt": "2022-11-14T00:22:44.409Z", "postId": "L4S2NCysoJxgCBuB6", "htmlBody": "<p>a couple of comments on this from a mere bystander:</p><ul><li>\"we do not feel this is the relevant or appropriate venue to discuss anonymous accusations from a former intern(s) without first discussing them privately\"<ul><li><strong>this is how gossip works</strong></li><li>also confused because the original commenter says that they were not involved:<ul><li>\"I can't share any specifics because anything specific was told to me in confidence; I also have no way of knowing whether the things I've heard were exaggerated. Additionally, a lot of what I was told I remember only vaguely. Given that none of the people wronged spoke up, it's not clear that I should (due to concerns about the reliability of secondhand knowledge, for example).\"</li></ul></li></ul></li><li>\"especially given the personal issues of the ex-interns involved\"<ul><li>this seems disingenuous to me, esp b/c you could've chosen not to say this</li></ul></li><li>\"the fact that every organization has disgruntled former interns/employees\"<ul><li>for small orgs (ie # of employees and contractors &lt; 30), I think this is just false.<ul><li>I partially agree that even small orgs will likely have someone who's disgruntled <i>if you ask them</i>, I think this is just not true about having a number of people <i>who complain about it unprovoked or warn others</i> &nbsp;(as seems to be the case here)</li></ul></li></ul></li><li>\"who we have verifiable evidence we paid as much as we committed to.\"<ul><li>fwiw, this could still be consistent with the main comment</li></ul></li></ul>", "parentCommentId": "pL87YnfSGeedD8min", "user": {"username": "a different anon"}}, {"_id": "bTZSB6CHmKJ8msq33", "postedAt": "2022-11-14T00:48:46.008Z", "postId": "L4S2NCysoJxgCBuB6", "htmlBody": "<p>Nitpick, but I found the sentence:</p><blockquote><p>Based on things I've heard from various people around Nonlinear, Kat and Emerson have a recent track record of conducting Nonlinear in a way inconsistent with <strong>EA values </strong>[emphasis mine].</p></blockquote><p>A bit strange in the context of the rest of the comment. If your characterization of Nonlinear is accurate, it would seem to be inconsistent with ~every plausible set of values and not just \"EA values\".</p>", "parentCommentId": "5P75dFuKLo894MQFf", "user": {"username": "elifland"}}, {"_id": "DSGXGxw9mGqZs9rN3", "postedAt": "2022-11-14T01:19:50.741Z", "postId": "L4S2NCysoJxgCBuB6", "htmlBody": "<p>Hi anonymous, thanks for adding that this is gossip without hard evidence. I’d like to highlight that leaving these accusations up is following the principle of guilty until proven innocent.&nbsp;</p><p>We are currently working on a response comment that deals with each accusation, but wanted to post this in the meantime.&nbsp;</p><p><strong>We think that anonymous accounts posting unsusbtantiated gossip without checking with both sides first is a bad community health norm.&nbsp;</strong></p><p><br>&nbsp;</p>", "parentCommentId": "5P75dFuKLo894MQFf", "user": {"username": "katherinesavoie"}}, {"_id": "mo6XGcbe49oCHeehG", "postedAt": "2022-11-14T01:50:46.264Z", "postId": "L4S2NCysoJxgCBuB6", "htmlBody": "<p>Gossip is alright. The presumption of innocence is a <i>legal</i> principle.</p><p>As we are not in court, people can raise their opinions without hard evidence. Given balance of upvotes/agreements and downvotes/disagreement, community appreciated anonymous-7 decision to speak up. In certain situations, it's the best we can reasonably hope to do. It's also alright to voice these opinions anonymously, and anonymous-7 gave a reason why others (and probably them) are uncomfortable speaking about it:</p><blockquote><p>I've also heard that Emerson can be retributive, and that some people around Nonlinear were scared about Emerson finding out they'd spoken badly about him.</p></blockquote><p>As you misrepresented anonymous-7, and as you repeatedly applied pressure to make them retract accusations (by trying to move the conversation from subject matter to norms). I want to call you out on such blatant use of <a href=\"https://www.lesswrong.com/posts/bQ6zpf6buWgP939ov/frame-control\">frame control</a> and condemn it as \"a bad community health norm.\"</p>", "parentCommentId": "DSGXGxw9mGqZs9rN3", "user": {"username": "gossip-is-useful-social-technology"}}, {"_id": "9WMBfWYtfhPdbmd5F", "postedAt": "2022-11-14T02:22:09.751Z", "postId": "L4S2NCysoJxgCBuB6", "htmlBody": "<p>[Edit: for anybody reading this now, I am very happy to talk to anybody about what happened. Simply reach out to me at katwoods [at] nonlinear [dot] org and I'd be happy to provide more information.]</p><p>Hi anonymous,</p><p>First, I want to say that I do believe you have good intentions. Second, an important point about source diversity: we have heard from many people in the community that one particular disgruntled ex-employee was previously widely spreading these accusations<strong>.</strong>&nbsp;</p><p>While this person, no doubt, wasn’t the only disgruntled ex-employee, most people hear these allegations secondhand, and this creates an echo chamber where it can appear that there were more disgruntled ex-employees than actually existed.</p><p>I’d also like to ask,&nbsp;<i>when&nbsp;</i>did you get this information? There was a period in which we had an open disagreement with one of the former employees, and we believe we have since rectified it. It’s possible we already addressed some of these issues after you heard about them.</p><p>This is a problem with unsubstantiated rumors and gossip: people might hold an opinion about something even after that problem was fixed.</p><blockquote><p>I have general sense that they had a pattern of taking on young, idealistic interns with poor ability to stand up for themselves and exploiting them to a standard many would consider unacceptable (e.g. manipulating them into accepting unreasonably little pay, and sometimes not following through on payment when they thought they could get away with it).</p></blockquote><p><br>We can provide concrete evidence in terms of bank screenshots and recorded interviews showing that this is not true. We are happy to talk to CEA about it if they would like.&nbsp;</p><p>For mentorship, I do not know the standard for mentorship, but some previous interns found working at Nonlinear to be lifechanging. Some, I’m sure, wished there had been more mentorship.&nbsp;</p><p>Some people have not liked that we have unpaid internships, but we have always been up front and clear about that in our job ads and interviews.&nbsp;</p><p>For the accusation of the payment being delayed, we have heard that particular employee’s claims, and we can show receipts of DMs and bank transactions showing that they were saying things that are verifiably incorrect.&nbsp;</p><blockquote><p>As I understand things, in July 2022 a group of Nonlinear employees and interns quit because they were unhappy with either their own treatment or the treatment of their coworkers.</p></blockquote><p>There were two employees who left in June. This is a complicated topic and would rather respect our ex-employees’ privacy by not mentioning the details publicly. Happy to talk with CEA about it.&nbsp;&nbsp;</p><blockquote><p>I've also heard that Emerson can be retributive, and that some people around Nonlinear were scared about Emerson finding out they'd spoken badly about him. (Generally speaking, to the extent that things were bad at Nonlinear, I have the general sense that Emerson, and not Kat, was the main source of bad behavior.)</p></blockquote><p>This is a vague accusation that is hard to address. We can’t prove a negative.</p><blockquote><p>I feel quite conflicted about posting this because:</p><ul><li>The people I've spoken to also think that Nonlinear has done a lot of good, despite their mistreatment of employees and interns. But I've recently become quite weary of this \"ends justify the means\"-type reasoning</li></ul></blockquote><p>This is gossip without providing any evidence and is impossible to disprove.&nbsp;</p><p>I personally am a mix of a rule utilitarian combined with a moral counsel approach due to moral uncertainty.&nbsp;</p><blockquote><p>I can't share any specifics because anything specific was told to me in confidence; I also have no way of knowing whether the things I've heard were exaggerated. Additionally, a lot of what I was told I remember only vaguely.</p></blockquote><p>This is a good a reason to hear both sides before publicly accusing somebody of something.&nbsp;</p><blockquote><p>Given that none of the people wronged spoke up, it's not clear that I should (due to concerns about the reliability of secondhand knowledge, for example).</p></blockquote><p>In the future, I would ask both sides first before making allegations like this, especially in a public forum,&nbsp;<strong>because most people won’t come back to re-read the comments later.&nbsp;</strong></p><blockquote><p>But I decided to post anyway because I like to think that I've learned the hazards of waiting until after misbehavior is publicly revealed to write about the evidence that I had all along. Sorry for any unfortunate consequences of this comment.</p></blockquote><p>People should definitely look into allegations against nonprofits. However,&nbsp;<strong>it’s important to&nbsp;</strong><i><strong>look into them</strong></i><strong>, not just report hearsay without doing proper due diligence. It’s important that EAs maintain good epistemics, not just publicly report any gossip that they’ve heard.&nbsp;</strong></p><p><br>&nbsp;</p>", "parentCommentId": "5P75dFuKLo894MQFf", "user": {"username": "katherinesavoie"}}, {"_id": "DFvnbhQciPLJHxq2h", "postedAt": "2022-11-14T02:43:32.406Z", "postId": "L4S2NCysoJxgCBuB6", "htmlBody": "<p>I can see how you might think that, and thanks for sharing your thoughts.&nbsp;</p><p>My opinion is that the presumption of innocence is not just a legal principle, it is a foundational principle of most justice systems because&nbsp;one accusation can forever ruin someone’s reputation whether or not they are proven innocent in the future.</p><p>Accusations can draw a lot of attention, but retractions receive far less attention.</p><p>I believe it’s very important to&nbsp;<i>be careful damaging someone’s reputation before hearing both sides because it’s really hard to repair it.</i></p><p>Additionally, it’s much harder to prove accusations wrong than it is to anonymously make them in the first place, so most cultures have immune reactions against anonymous accusations.</p><p>It’s also just bad epistemics to only hear one side. Every side always thinks they’re in the right, so if you only hear one side, it’s practically impossible to have good epistemics.&nbsp;</p>", "parentCommentId": "mo6XGcbe49oCHeehG", "user": {"username": "Meta"}}, {"_id": "YdyTSGuKQd35R2N9x", "postedAt": "2022-11-14T02:45:05.728Z", "postId": "L4S2NCysoJxgCBuB6", "htmlBody": "<ul><li>1. \"...not just publicly report any gossip that they’ve heard.\"<ul><li><i>Gossip is cheap. Gossip is noisy. </i>This is common knowledge to our social protocol. Besides, I would rather a norm of gossip and claims about orgs in public— <i>at least here where you can address it</i>— than gossip in private</li><li>Secondly, <strong>such a norm would drastically discourage useful gossip because it becomes so much more expensive to share</strong>. - Alternatively, gossip could be cheap and we could all acknowledge how noisy it can be.</li><li><strong>Third, a trouble with gossip is that there's an evaporative cooling effect: once you get put off by something/someone, you don't engage with that org/person anymore, and so you </strong><i><strong>stop collecting hard evidence of misbehavior</strong></i><strong>. This is the reasonable thing to do— and makes 'due diligence' impossible.</strong></li></ul></li><li>2. \"This is a good a reason to hear both sides before publicly accusing somebody of something. \"<ul><li>I think this is absolutely unrealistic, per above</li></ul></li><li>3. \"and this creates an echo chamber where it can appear that there were more disgruntled ex-employees than actually existed\"<ul><li>For the record, though this effects your organization, such comments are not nonlinear's problem. How to evaluate the truth and applicability of gossip like this is the problem of anyone who hears it. We all know how inaccurate gossip can be.</li></ul></li><li>4. \"might hold an opinion about something even after that problem was fixed\"<ul><li>this is a good point, though again see #3</li></ul></li></ul>", "parentCommentId": "9WMBfWYtfhPdbmd5F", "user": {"username": "a different anon"}}, {"_id": "uj6mvuHs2PMKkYnZb", "postedAt": "2022-11-14T03:54:38.343Z", "postId": "L4S2NCysoJxgCBuB6", "htmlBody": "<p>Those accusations seem of a dramatically more minor and unrelated nature and don't update me much at all that allegations of mistreatment of employees are more likely.</p>", "parentCommentId": "fXiqLoDWCcRXQofby", "user": {"username": "Ruby"}}, {"_id": "pxadCsZ8oxJxkHHW7", "postedAt": "2022-11-14T04:34:05.112Z", "postId": "L4S2NCysoJxgCBuB6", "htmlBody": "<blockquote><p>My opinion is that the presumption of innocence is not just a legal principle, it is a foundational principle of most justice systems because one accusation can forever ruin someone's reputation whether or not they are proven innocent in the future.&nbsp;</p></blockquote><ul><li>That's not how a lot of justice systems work.<ul><li>The widespread of gossip is one example.</li><li>Another example is that one can sue before establishing \"guilt beyond reasonable doubt\" as required by the presumption of innocence.</li></ul></li><li>Readers can update their opinion of Nonlinear based on these accusations as they see fit including incorporating their understanding of the presumption of innocence.</li></ul><blockquote><p>Additionally, it's much harder to prove accusations wrong than it is to anonymously make them in the first place, so most cultures have immune reactions against anonymous accusations.&nbsp;</p></blockquote><ul><li>This is a tradeoff. The higher the standards for accusations are, the less common knowledge about bad behaviour would be established. The laxer standards are, the more reputations would be damaged without proper reasons.<ul><li>I believe that EA tends to give bad actors too much benefit of the doubt.</li></ul></li><li>I don't think EA Forum has a different cultural code. Upvotes indicate that anonymous-7's decision to post was reasonably well received despite EA Forum readers, who probably share general skepticism about anonymous accusations.</li></ul><blockquote><p>It's also just bad epistemics to only hear one side. Every side always thinks they're in the right, so if you only hear one side, it's practically impossible to have good epistemics.&nbsp;</p></blockquote><ul><li>Once again, this is a matter of tradeoff. Readers are aware that anonymous-7 hasn't reached out to Nonlinear to hear their side of the story and can adjust their updates accordingly.</li></ul>", "parentCommentId": "DFvnbhQciPLJHxq2h", "user": {"username": "gossip-is-useful-social-technology"}}, {"_id": "yZEkDzgf3Fz8Fpn4i", "postedAt": "2022-11-14T05:00:43.126Z", "postId": "L4S2NCysoJxgCBuB6", "htmlBody": "<p>I largely agree with Ruby here, but wanted to note one <a href=\"https://forum.effectivealtruism.org/posts/bvK44CdpG7mGpQHbw/the-usd100-000-truman-prize-rewarding-anonymous-ea-work?commentId=J6DmBYHrmEAg5xjLF#comments\">comment</a>, where one justification for \"violating \" (this word seems too strong) this norm was \"a descendant of Truman would have to <strong>actually learn of this prize</strong>\". If the <a href=\"https://forum.effectivealtruism.org/posts/bvK44CdpG7mGpQHbw/the-usd100-000-truman-prize-rewarding-anonymous-ea-work?commentId=nRgvjdhjKwKQxZgsg#J6DmBYHrmEAg5xjLF\">research eventually done</a> happened prior to the announcement, I think there would not be any meaningful update for me. OTOH, if this justification was a reason to not have done this research, and if it was applied more generally and not just for the naming of the prize, it would make me more suspicious that the allegations leveled against them are plausible, and it fits the \"ends justify the means\"-type reasoning that the OP refers to.<br>&nbsp;</p>", "parentCommentId": "uj6mvuHs2PMKkYnZb", "user": {"username": "pseudonym"}}, {"_id": "opaTW7rhCafvmxkZA", "postedAt": "2022-11-14T05:52:30.093Z", "postId": "L4S2NCysoJxgCBuB6", "htmlBody": "<p>If you think someone is breaking the Forum's rules, I encourage you to <a href=\"https://forum.effectivealtruism.org/posts/yND9aGJgobm5dEXqF/guide-to-norms-on-the-forum#Contact_the_moderators_or_report_inappropriate_behavior\">contact the moderation team</a>.&nbsp;</p><p>If something seems sketchy but doesn't clearly break any rules, you should still reach out. The situation might lead to a rule change, or at least alert moderators to pay more attention to threads involving specific users.</p><p>FWIW, I don't love nonspecific allegations like this — it's nigh-impossible for Nonlinear to respond to them, and serves as a cheap or free way to make others think worse of them at no cost to yourself. By contrast, the initial comment at least gave enough information that Nonlinear could respond to some of the claims.</p>", "parentCommentId": "WnB9BGJ6HguB9vcah", "user": {"username": "aarongertler"}}, {"_id": "uBBrjaPF5z7ENovwp", "postedAt": "2022-11-14T06:19:03.956Z", "postId": "L4S2NCysoJxgCBuB6", "htmlBody": "<p>Is a claim like this something the moderators would have the ability to actually verify? If so, would a public claim like this be something the moderators would be interested in verifying? I similarly dislike the allegation as written and I think if this was verified in some way it would be useful regardless of the outcome</p>", "parentCommentId": "opaTW7rhCafvmxkZA", "user": {"username": "pseudonym"}}, {"_id": "fw8Zkoe4erQGZ3qMQ", "postedAt": "2022-11-14T06:44:31.090Z", "postId": "L4S2NCysoJxgCBuB6", "htmlBody": "<p>I am satisfied with the truth, accuracy and confidence of my statements in this post. Based on some of the responses from Non-linear, I would probably change my content to increase my concerns somewhat.</p><p>&nbsp;</p><p>I'm not immediately able to say anything useful about the meta question of anonymous comments—this seems extremely complicated and I probably might not agree if I think about it.</p><p>I might be anonymous (?) right now. I have unique reasons that I am anonymous, and I might not be for long.</p><p>&nbsp;</p><p>I am interested if you have contravening information about my representations on my account, or any other concerns. Please write them publicly.</p>", "parentCommentId": "opaTW7rhCafvmxkZA", "user": {"username": "Anonymous (for unimpressive reasons =[ )"}}, {"_id": "YwsqrANoYyqdennD7", "postedAt": "2022-11-14T06:49:10.548Z", "postId": "L4S2NCysoJxgCBuB6", "htmlBody": "<p>Here is one instance of what I consider vote manipulation.</p><p><a href=\"https://forum.effectivealtruism.org/posts/cTQfWpobqk4nDWsfG/new-use-the-nonlinear-library-to-listen-to-the-top-ea-forum#comments\">https://forum.effectivealtruism.org/posts/cTQfWpobqk4nDWsfG/new-use-the-nonlinear-library-to-listen-to-the-top-ea-forum#comments</a></p><p>I interpret the situation as an incident that Kat did not honor her word about content, Kirsten was upset, and Kat suppressed Kirsten's concerns. As you can see, Charles He (who seems otherwise unintelligent) pointed this out clearly.</p><p>I grudge providing this, and I do so because of interest which I think is disproportionate, as this is not substantive compared to the rest of the claims. Frankly, I assumed this voting behavior was common knowledge.</p><figure class=\"image\"><img></figure><figure class=\"image\"><img src=\"https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/679a3aa9aa997c488a91467b4fa19f5652e019328d306cb3.png\" srcset=\"https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/679a3aa9aa997c488a91467b4fa19f5652e019328d306cb3.png/w_90 90w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/679a3aa9aa997c488a91467b4fa19f5652e019328d306cb3.png/w_180 180w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/679a3aa9aa997c488a91467b4fa19f5652e019328d306cb3.png/w_270 270w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/679a3aa9aa997c488a91467b4fa19f5652e019328d306cb3.png/w_360 360w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/679a3aa9aa997c488a91467b4fa19f5652e019328d306cb3.png/w_450 450w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/679a3aa9aa997c488a91467b4fa19f5652e019328d306cb3.png/w_540 540w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/679a3aa9aa997c488a91467b4fa19f5652e019328d306cb3.png/w_630 630w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/679a3aa9aa997c488a91467b4fa19f5652e019328d306cb3.png/w_720 720w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/679a3aa9aa997c488a91467b4fa19f5652e019328d306cb3.png/w_810 810w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/679a3aa9aa997c488a91467b4fa19f5652e019328d306cb3.png/w_822 822w\"></figure><figure class=\"image\"><img></figure>", "parentCommentId": "FwWFsmJbRRRf9mjPE", "user": {"username": "Anonymous (for unimpressive reasons =[ )"}}, {"_id": "vv8BsrJe8aaoE5wHZ", "postedAt": "2022-11-14T14:10:43.893Z", "postId": "L4S2NCysoJxgCBuB6", "htmlBody": "<p>As a moderator, I think the phrase \"seems otherwise unintelligent\" is clearly not <a href=\"https://forum.effectivealtruism.org/posts/yND9aGJgobm5dEXqF/guide-to-norms-on-the-forum#What_we_encourage\">generous or collaborative</a> and breaks &nbsp;<a href=\"https://forum.effectivealtruism.org/posts/yND9aGJgobm5dEXqF/guide-to-norms-on-the-forum#What_we_discourage__and_may_delete_\">Forum norms</a>. This is a warning, please don't insult other users.</p>", "parentCommentId": "YwsqrANoYyqdennD7", "user": {"username": "Lizka"}}, {"_id": "nsX9xXkqW5zQKNonX", "postedAt": "2022-11-14T14:45:25.194Z", "postId": "L4S2NCysoJxgCBuB6", "htmlBody": "<p>There's probably a rationale I don't understand here - but what's the reason for allowing someone to strong upvote their own comment, irrespective of whether the thread was about a misaction? (though this makes it worse). <s>Like do they get karma for doing this and are just doing this to boost their own karma? [Edit: deleted, as this does not appear to be the case, at least not when I tried it just now]</s><br>Are we suggesting that people with higher karma both make better comments and can be trusted to judge themselves independently? Are we not worried this could bias other peoples' judgements?<br><br>From <a href=\"https://www.goodreads.com/book/show/55339408-noise\">Noise</a>:</p><blockquote><p>\"...The researchers automatically and artificially gave certain comments on stories an immediate up vote - the first vote that a comment would receive. You might well think that after hundreds or thousands of visitors and ratings, a single initial vote on a comment could not possibly matter. That is a sensible thought, but it is wrong. After seeing an initial up vote, the next viewer became 32% more likely to give an up vote. Remarkably, this effect persisted over time. After five months, a single positive initial vote artificially increased the mean rating of comments by 25%.\"</p></blockquote><p>Source: <a href=\"https://www.science.org/doi/10.1126/science.1240466\">https://www.science.org/doi/10.1126/science.1240466</a></p>", "parentCommentId": "YwsqrANoYyqdennD7", "user": {"username": "pseudonym"}}, {"_id": "rdMhk6CNjdhhFJzHH", "postedAt": "2022-11-14T15:17:41.009Z", "postId": "L4S2NCysoJxgCBuB6", "htmlBody": "<figure class=\"image\"><img src=\"https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/44b87b86962990584988fb53fbf89983bc6b28ed0044d8a9.png\" srcset=\"https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/44b87b86962990584988fb53fbf89983bc6b28ed0044d8a9.png/w_90 90w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/44b87b86962990584988fb53fbf89983bc6b28ed0044d8a9.png/w_180 180w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/44b87b86962990584988fb53fbf89983bc6b28ed0044d8a9.png/w_270 270w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/44b87b86962990584988fb53fbf89983bc6b28ed0044d8a9.png/w_360 360w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/44b87b86962990584988fb53fbf89983bc6b28ed0044d8a9.png/w_450 450w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/44b87b86962990584988fb53fbf89983bc6b28ed0044d8a9.png/w_540 540w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/44b87b86962990584988fb53fbf89983bc6b28ed0044d8a9.png/w_630 630w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/44b87b86962990584988fb53fbf89983bc6b28ed0044d8a9.png/w_720 720w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/44b87b86962990584988fb53fbf89983bc6b28ed0044d8a9.png/w_810 810w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/44b87b86962990584988fb53fbf89983bc6b28ed0044d8a9.png/w_839 839w\"></figure><p><br>Would someone be happy to explain what <a href=\"https://forum.effectivealtruism.org/posts/yND9aGJgobm5dEXqF/guide-to-norms-on-the-forum#What_we_discourage__and_may_delete_or_edit_out_\">forum norm</a> I've broken with my above comment, or the reason for the strong downvote, given the <a href=\"https://forum.effectivealtruism.org/posts/yND9aGJgobm5dEXqF/guide-to-norms-on-the-forum#Voting_norms\">voting norms</a>?</p>", "parentCommentId": "nsX9xXkqW5zQKNonX", "user": {"username": "pseudonym"}}, {"_id": "s7JECwfsQG3LabbDa", "postedAt": "2022-11-14T15:28:09.611Z", "postId": "L4S2NCysoJxgCBuB6", "htmlBody": "<p>I would be very curious if there were any complaints about Nonlinear founders' work ethics sent to Community Liaison, that would confirm the points brought up here?<br>It would be great if the community at least investigated things that were brought up here in the comments, and actually talked with ex-employees about their experience.&nbsp;<br>My experience working with Katherine Savoie (this is the previous name of Kat Woods) was very negative.<br>Based on the gossip below, it looks like a pattern other people also experienced. I wonder if Community Liaison has investigated?<br>The gossip below seems well known in the community, hopefully CEA is already looking into it?<br><br>However, I am not sure how such a gossip could affect accepting funding from Nonlinear. It seems like this is beneficial to longterm projects? So I see no need to mix the two things.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Ula"}}, {"_id": "ZhfRBpp3ECGo8nCvj", "postedAt": "2022-11-14T15:36:31.080Z", "postId": "L4S2NCysoJxgCBuB6", "htmlBody": "<p>\"one particular disgruntled ex-employee\" - I am not an ex-employee, but happy to confirm working with you is not a pleasant experience for an employee. So there are at least two people in the EA community. I expect if CEA investigates, there would maybe be more?&nbsp;</p>", "parentCommentId": "9WMBfWYtfhPdbmd5F", "user": {"username": "Ula"}}, {"_id": "8Xhp9cEdnDddNxKdT", "postedAt": "2022-11-14T15:58:36.494Z", "postId": "L4S2NCysoJxgCBuB6", "htmlBody": "<p>I'm curious about what's the original source of the funding you're giving out here. According to <a href=\"https://forum.effectivealtruism.org/topics/nonlinear-fund\">this</a> Nonlinear received $250k from Future Fund and $600k from Survival and Flourishing Fund. Is the funding being distributed here coming solely from the SFF grant? Does Nonlinear have other funding sources besides Future Fund and SFF?&nbsp;<br><br>(I didn't do any deeper dive than looking at Nonlinear's website, where I couldn't find anything about funding sources.)</p>", "parentCommentId": null, "user": {"username": "aman-patel"}}, {"_id": "pne7gpffwEbWvWeBu", "postedAt": "2022-11-14T16:21:45.004Z", "postId": "L4S2NCysoJxgCBuB6", "htmlBody": "<p>I’m surprised and sad to hear you now think that way about our past experience. The last time you reached out to me you were overwhelmingly positive towards me. Let me know if you’d like to talk about this more.&nbsp;</p><p>On a minor note, I felt important to say about the quote: we didn't claim there was only one disgruntled ex-employee. In fact, the next sentence says: \"While this person, no doubt, wasn’t the only disgruntled ex-employee\".</p>", "parentCommentId": "ZhfRBpp3ECGo8nCvj", "user": {"username": "katherinesavoie"}}, {"_id": "ifZw8RdhigduKcqHW", "postedAt": "2022-11-14T16:37:31.505Z", "postId": "L4S2NCysoJxgCBuB6", "htmlBody": "<p>I was afraid of you because you were my boss, so I could not criticize your work and behavior, and I was scared to do it for a long time. I also know you as a very manipulative manager (just a subjective experience, no evidence here), so I was very afraid of you, and even given the above response, I still am. &nbsp;On the day you quit, I was about to talk to the leadership about quitting unless I no longer have to work with you. Luckily you quit, and I was able to stay in my highly impactful work. But yeah, I am still afraid of you, and it is very saddening to me there is no investigation into the gossip mentioned below. But again, I am just afraid of the manipulative skills I witnessed and you in general. Hopefully, some people can stand up to you.&nbsp;</p>", "parentCommentId": "pne7gpffwEbWvWeBu", "user": {"username": "Ula"}}, {"_id": "JSqeThHbkmSgiJBvy", "postedAt": "2022-11-14T17:02:02.386Z", "postId": "L4S2NCysoJxgCBuB6", "htmlBody": "<p>I'm trying to more succinctly understand what you're saying since your second last paragraph has confusing wording. You're saying that Nonlinear can scale as EA scales (as opposed to scaling by their ability) and thereby attract competent clout like Emerson (since EA has become more famous as a whole it attracts big-shots), but that as an organization they don't yet produce enough value/output for someone like Emerson to be a good fit at their organization? And that this plausibly has a causal relationship to why there has been conflict? e.g. Emerson being a bad fit leads to him more easily getting frustrated with other employees?<br><br>(PS: just a note that this doesn't excuse Emerson mistreating employees if he was indeed mistreating employees. My comment here is just trying to understand what the comment above is saying since it confused me, but I think it might be valuable to clarify)</p>", "parentCommentId": "NzuqH4Lcp8MzG97tu", "user": {"username": "Cornelis Dirk Haupt"}}, {"_id": "haQfRPhd9PtxCyzdu", "postedAt": "2022-11-14T17:06:19.098Z", "postId": "L4S2NCysoJxgCBuB6", "htmlBody": "<p>While I feel bad that this conversation is happening on a post for what I'd consider an act of service to the EA community (coming in with extra funding at short notice for those affected by the FTX events), I'm grateful you feel comfortable speaking up about your experience now, and I think this information is also potentially useful to the EA community - thank you for this! I hope you are thriving where you are now.<br><br>At the same time, I think it could be useful for a third party to help with facilitating this (especially since this is what Ula seems to prefer), otherwise I worry we'll get into an acrimonious \"your word against mine\" situation. I don't know if this is within the scope of the CEA community health team?</p>", "parentCommentId": "ifZw8RdhigduKcqHW", "user": {"username": "pseudonym"}}, {"_id": "fezdJ46Nu69dCX7YJ", "postedAt": "2022-11-14T17:32:38.224Z", "postId": "L4S2NCysoJxgCBuB6", "htmlBody": "<p>Hi! Just a few questions:<br><br>I remember hearing that Emerson/Nonlinear invested quite a lot into crypto - presumably with the current markets, his/Nonlinear's portfolio must've taken a hit?&nbsp;</p><p>Secondly, &nbsp;Nonlinear received a Future Fund grant: <a href=\"https://ftxfuturefund.org/our-grants/?_search=nonlinear\">https://ftxfuturefund.org/our-grants/?_search=nonlinear</a></p><p>Are you potentially concerned about clawbacks to the money you hand out, especially if you're dispersing small amounts to several people who could then be affected?</p><p>Also, will additional funders top you up, or will the money go directly to the people affected?&nbsp;</p><p>If funders top you up, would that potentially commingle FTX money with non-FTX funders' money?&nbsp;</p>", "parentCommentId": null, "user": {"username": "bystander_effect"}}, {"_id": "4qjujwrHJHvMQMWQD", "postedAt": "2022-11-14T18:01:21.135Z", "postId": "L4S2NCysoJxgCBuB6", "htmlBody": "<p>I’m a current intern at Nonlinear and I think It would be good to add my point of view.</p>\n<p>I was offered an internship by Drew around 3 months ago after I contributed to a project and had some chats with him. From the first moment I was an intern he made me feel like a valuable member of the team, my feedback was always taken seriously, and I could make decisions on my own. It never felt like a boss relationship, more like coworkers and equals.</p>\n<p>And when I started putting in less hours, I never got “hey you should work more or this is not gonna work out” but rather Drew took the time to set up a weekly 1 on 1 to help me develop personally and professionally and get to know me.</p>\n<p>I can only speak for myself but overall I’m very happy to be working with them and there’s nothing about the situation I would call mistreatment.</p>\n", "parentCommentId": "5P75dFuKLo894MQFf", "user": {"username": "Luca De Leo"}}, {"_id": "WMQp7oRr8fdzaADus", "postedAt": "2022-11-14T18:57:11.592Z", "postId": "L4S2NCysoJxgCBuB6", "htmlBody": "<p>What was apparently a good intentioned move seems to be getting sidetracked by the majority of anonymous (and non anonymous) comments. Quite unfortunate.<br><br>Can't we all just kiss and make up? We are supposed to be altruists, right? RIGHT???&nbsp;</p><p>On a more serious note, I don't personally know and have never worked personally with Kat or Emerson but I've been a member of one of the Nonlinear/Superlinear discords for some weeks now and have interacted with Drew and a few others and that place feels more or less like a family where everyone's opinion is valued and respected.&nbsp;</p><p>They are very open, helpful and supportive people and one of the most welcoming of all the EA communities I've been in so far (I'm quite new to EA, about three months old in the community). I've never felt any negative vibes interacting with them and I am of the strong opinion that the work being done there is highly impactful and relevant to EA.</p><p>All the same I believe \"there is no smoke without fire\" as they say and I believe some kind of official investigation should be made into these allegations (if possible). But I don't think this thread is the best place to discuss this issue as it distracts from the import of the original post (which would be beneficial to a lot of people in the community given the current situation of things).</p><p>The anonymous accuser should have created a different post and linked to it in a brief comment here for a more robust discussion of that issue without distracting from the original purpose of this thread.</p><p>And on the issue of forum voting, I think posters and commenters should NOT be able to vote on their own posts and comments. I believe the effects of being able to vote on one's own post/comment are net negative.</p>", "parentCommentId": null, "user": {"username": "DAOMaxi"}}, {"_id": "H8HW3ZtDX3SEM8CdD", "postedAt": "2022-11-14T19:48:46.061Z", "postId": "L4S2NCysoJxgCBuB6", "htmlBody": "<blockquote><p>Gossip can have an important community function</p></blockquote><p><br>True, but gossip is also normally shared between a few people in a private setting, and spreads organically that way. It is NOT shared publicly on the internet.<br><br>By spreading unconfirmed rumors on the internet, you are doing undue reputational damage that you CANNOT UN-DO. Imagine someone posting this about your institute and that showing up in search results.&nbsp;<br><br>This is completely unthoughtful and unnecessary behavior and it's insane to me how much of that happens on this forum. I really expect better from a community that claims to be very smart.</p>", "parentCommentId": "5P75dFuKLo894MQFf", "user": {"username": "Olli"}}, {"_id": "XSaHd5aRbEdS9GhqW", "postedAt": "2022-11-14T20:10:45.261Z", "postId": "L4S2NCysoJxgCBuB6", "htmlBody": "<p>I worked closely with Kat for a year or so (2018-2019) when I was working at (and later leading) Charity Science Health. She's now a good friend. &nbsp;</p><p>I considered Kat a good and ethical leader. I personally learned a lot from working with her. In her spending and life choices, she has shown a considerable moral courage: paying herself only $12K/year, dropping out of college because she didn't think it passed an impact cost-benefit test. Obviously that doesn't preclude the possibility that she has willfully done harmful things, but I think willfully bad behavior by Kat Woods is quite unlikely, a priori.&nbsp;</p>", "parentCommentId": "5P75dFuKLo894MQFf", "user": {"username": "katriel"}}, {"_id": "2vDgJpBYsmhu7zLxr", "postedAt": "2022-11-15T00:36:47.129Z", "postId": "L4S2NCysoJxgCBuB6", "htmlBody": "<p>Hi! Thanks for the questions.&nbsp;</p><blockquote><p>I remember hearing that Emerson/Nonlinear invested quite a lot into crypto - presumably with the current markets, his/Nonlinear's portfolio must've taken a hit?&nbsp;</p></blockquote><p>Yes, most crypto people have taken a hit, including Emerson. As far as I know, he has no plans to slow down his donations to Nonlinear.</p><blockquote><p>Secondly,&nbsp; Nonlinear received a Future Fund grant:&nbsp;<a href=\"https://ftxfuturefund.org/our-grants/?_search=nonlinear\"><u>https://ftxfuturefund.org/our-grants/?_search=nonlinear</u></a> Are you potentially concerned about clawbacks to the money you hand out, especially if you're dispersing small amounts to several people who could then be affected?</p></blockquote><p>We’re not using Future Fund grant money for this. That being said, we are still gathering information, but based on our conversations with lawyers and distressed debt investors, we are not as concerned as some community members are about clawbacks, especially for very small grants. This may update in the future as more information comes out.</p><blockquote><p>Also, will additional funders top you up, or will the money go directly to the people affected?&nbsp;</p></blockquote><p>We have had several funders reach out to us. Still working out the details :)</p>", "parentCommentId": "fezdJ46Nu69dCX7YJ", "user": {"username": "Meta"}}, {"_id": "KGHAqyDjCBaWiYAHQ", "postedAt": "2022-11-15T00:41:44.518Z", "postId": "L4S2NCysoJxgCBuB6", "htmlBody": "<p>Hi Aman,&nbsp;</p><p>Appreciate the question. We’ve received funding from different sources like the Survival and Flourishing Fund, Future Fund, and other private donors, with Emerson Spartz donating six figures annually.</p><p>This project would not fall under the scope of what the Future Fund granted us, so we will not be using their funding for this.&nbsp;</p><p>This is coming directly out of our operating budget, so we're aiming to make payouts that have a higher counterfactual likelihood of impact.</p>", "parentCommentId": "8Xhp9cEdnDddNxKdT", "user": {"username": "Meta"}}, {"_id": "wfS7koCMEYDRnpYZJ", "postedAt": "2022-11-15T12:00:18.048Z", "postId": "L4S2NCysoJxgCBuB6", "htmlBody": "<p>Regarding legalities, seeing that the grant is from April, I will also add that <a href=\"https://forum.effectivealtruism.org/posts/o8B9kCkwteSqZg9zc/thoughts-on-legal-concerns-surrounding-the-ftx-situation\">Molly mentions</a> the general clawbacks are only relevant 3 months back into time from the dissolution of FTX organizations.</p>", "parentCommentId": "2vDgJpBYsmhu7zLxr", "user": {"username": "esben-kran"}}, {"_id": "h3ba4pLeoQxdYZiBh", "postedAt": "2022-11-15T17:18:59.145Z", "postId": "L4S2NCysoJxgCBuB6", "htmlBody": "<p>Depends on the claim.</p><p>When we (the moderation team) have a good reason to believe that <a href=\"https://forum.effectivealtruism.org/posts/yND9aGJgobm5dEXqF/guide-to-norms-on-the-forum\">norm-breaking behavior</a> is going on, we can access information including which accounts voted, and how, on any given post or comment (we'd need to work with the developers on this; this information isn't readily available to us). To protect users' privacy, we check whether something is weird before we look at IDs by looking at things like the timing and weight of votes without looking at who voted.</p><p>But we don't investigate without good reason, both because we don't have capacity for it, and because we want to give users privacy. So we'd need a reason to investigate, which is where reports like this come in.</p><ul><li>Sample good reasons:<ul><li>\"A bunch of my comments from past months were all downvoted in the last day or two, can you see if someone was mass-downvoting?\"</li><li>\"I heard USERNAME say they paid people to upvote them on MTurk, can you see if a bunch of new users just joined to vote on their posts?\"</li></ul></li><li>Sample bad reason:<ul><li>\"I think USERNAME is manipulating karma, can you investigate them?\"</li></ul></li></ul><p>(You can also make the claims privately by <a href=\"https://forum.effectivealtruism.org/posts/yND9aGJgobm5dEXqF/guide-to-norms-on-the-forum#Contact_the_moderators_or_report_inappropriate_behavior\">directly getting in touch</a>, which can be better than speculating publicly.)</p>", "parentCommentId": "uBBrjaPF5z7ENovwp", "user": {"username": "Lizka"}}, {"_id": "vGXpZan7qDbtEBQTy", "postedAt": "2022-11-15T18:58:39.772Z", "postId": "L4S2NCysoJxgCBuB6", "htmlBody": "<p>The community health team at CEA is available to talk about concerns like this. You can <a href=\"https://docs.google.com/forms/d/e/1FAIpQLScJooJD0Sm2csCYgd0Is6FkpyQa3ket8IIcFzd_FcTRU7avRg/viewform\">reach us here</a>.</p>", "parentCommentId": "5P75dFuKLo894MQFf", "user": {"username": "Julia_Wise"}}, {"_id": "NQTw9wzKE72gkbJDt", "postedAt": "2022-11-15T19:03:43.444Z", "postId": "L4S2NCysoJxgCBuB6", "htmlBody": "<p>True, but fraudulent conveyance claims plausibly extend further than 90 days. As <a href=\"https://forum.effectivealtruism.org/posts/o8B9kCkwteSqZg9zc/thoughts-on-legal-concerns-surrounding-the-ftx-situation#Clawbacks\">Molly says in the same article</a>, \"<strong>It is way too early to tell</strong> whether and how fraudulent conveyance claims might be used in the FTX bankruptcy proceeding...\"</p>", "parentCommentId": "wfS7koCMEYDRnpYZJ", "user": {"username": "bystander_effect"}}, {"_id": "GooLhgnRs2g9roMTn", "postedAt": "2022-11-16T13:59:24.619Z", "postId": "L4S2NCysoJxgCBuB6", "htmlBody": "<p>Drew and I have known each other for about 2 years.\nWhile it's only natural to issue appalled call-outs after hearing \"from various people around Nonlinear\", I am willing to continue to trust him and vouch for him and Nonlinear.\nNo fairly large organization is immune from the corruption of wealth and power. Having said that, Drew, to me personally, engenders directness and sincerity in all the works we've pursued; I'll continue to trust him and vouch for him and Nonlinear unless evidence against them appears. It's said that the purpose of a system is what it does and to my 2 years of experience of them, they have been serving their purpose truthfully.</p>\n", "parentCommentId": "5P75dFuKLo894MQFf", "user": {"username": "Chongtham"}}, {"_id": "pAw5iBE2A886Mg7hm", "postedAt": "2022-12-01T19:50:00.443Z", "postId": "L4S2NCysoJxgCBuB6", "htmlBody": "<p>I know nothing about most of the discussion here, but...</p><blockquote><p>they named an eponymous <a href=\"https://forum.effectivealtruism.org/posts/bvK44CdpG7mGpQHbw/the-usd100-000-truman-prize-rewarding-anonymous-ea-work\">prize</a> without consent from the named person or their estate</p></blockquote><p>That wasn't them, it was me. Since I came up with the prize, and suggested the name. Ryan reasonably reached out them to get clarity, and I wasn't initially in the loop, but that's a communication problem, not an ethics issue. And if you look at the comments, I really don't think it was mishandled.</p>", "parentCommentId": "fXiqLoDWCcRXQofby", "user": {"username": "Davidmanheim"}}, {"_id": "bgqBgaz4BvpdsS5bP", "postedAt": "2022-12-01T19:50:44.076Z", "postId": "L4S2NCysoJxgCBuB6", "htmlBody": "<p>Also, the naming was completely on me, not them, as I explained in another comment.</p>", "parentCommentId": "uj6mvuHs2PMKkYnZb", "user": {"username": "Davidmanheim"}}, {"_id": "ncmzTCbh8xjvoTTcJ", "postedAt": "2022-12-01T19:53:05.893Z", "postId": "L4S2NCysoJxgCBuB6", "htmlBody": "<p>No, that's not how any of that works.</p>", "parentCommentId": "kAjY69JxSiAvSnzHB", "user": {"username": "Davidmanheim"}}, {"_id": "2GKWKdAay2oY9y2B8", "postedAt": "2022-12-03T15:39:48.788Z", "postId": "L4S2NCysoJxgCBuB6", "htmlBody": "<blockquote><p>I don't know if this is within the scope of the CEA community health team?<br>&nbsp;</p></blockquote><p>This has almost certainly been flagged at the highest levels of CEA.<s> As to why exactly it's been so poorly that it's spilled out here, is &nbsp;beyond me.&nbsp;</s><br><br><s>Likely relevant information on which to &nbsp;update on the competency of the CEA community health team.&nbsp;</s><br><br>Edit: I was feeling frustrated when I wrote this, and it no longer represents my views. I now <a href=\"https://forum.effectivealtruism.org/posts/NbkxLDECvdGuB95gW/the-community-health-team-s-work-on-interpersonal-harm-in\">understand more about how tricky these problems are to deal with.&nbsp;</a></p>", "parentCommentId": "haQfRPhd9PtxCyzdu", "user": {"username": "ElliotJDavies"}}, {"_id": "ktqzGDGKfCHT4xKj7", "postedAt": "2022-12-03T15:43:40.846Z", "postId": "L4S2NCysoJxgCBuB6", "htmlBody": "<p>Hey Julia, this reads as if these problems have not been reported to the community health team. I understand (with modest confidence) that they have.&nbsp;</p>", "parentCommentId": "vGXpZan7qDbtEBQTy", "user": {"username": "ElliotJDavies"}}, {"_id": "Sj7vnBDvkQm8JoEc8", "postedAt": "2022-12-03T19:49:57.025Z", "postId": "L4S2NCysoJxgCBuB6", "htmlBody": "<p>After a ~5min online research on <a href=\"https://www.glassdoor.com/Reviews/Dose-Reviews-E1145514.htm\">Emerson Spartz's past CEO role at his previous company \"Dose\"</a>, it looks like there were a lot more \"disgruntled ex-employee[s]\" (even if this is external to EA).&nbsp;<br><br>Overall, CEO approval is at 0%. &nbsp;Some examples out of the many:</p><blockquote><ul><li>&nbsp;<a href=\"https://www.glassdoor.com/Reviews/Employee-Review-Dose-RVW68558376.htm\"><strong>Terrible, Toxic, Traumatizing, Environment</strong></a><strong> </strong>I actually consulted lawyers about a potential retaliation lawsuit after my experience working at this sicko company. 4 years later, I still have nightmares. Like, actual nightmares while I'm asleep. There are some seriously manipulative, narcissists at Dose. If you are a semi-decent person who cares even an inkling about your own well being or the well being of others, I highly suggest staying away from this insane company.</li><li><a href=\"https://www.glassdoor.com/Reviews/Employee-Review-Dose-RVW23841412.htm\"><strong>Yikes.</strong></a><strong> </strong>Working at Dose is like being in a sorority who thinks they're really cool, popular and making a difference in the world, but are so blinded by their own delusions and egos, that it couldn't be further from the truth. Specifically, I'm talking specifically about upper management. The \"leaders\" not only have no clue what they're doing, but they refuse to listen to other people's opinions and play favorites. If you're not extroverted or as \"hyped\" about the company, you’ll become less respected. Those who can speak their language of BS buzzwords with enthusiasm are those who get promotions, get invited to happy hours, etc.</li><li><a href=\"https://www.glassdoor.com/Reviews/Employee-Review-Dose-RVW68359722.htm\"><strong>Stepping Stone Job</strong></a><strong> </strong>Toxic workplace, with little to no career pathway. Inexperienced management.</li><li><a href=\"https://www.glassdoor.com/Reviews/Employee-Review-Dose-RVW51897116.htm\"><strong>Toxic</strong></a><strong>:</strong>Truly the only way to succeed at dose is to suck up to upper management, as your growth there will depend more on how well you manage to befriend the higher ups than your actual work ethic. Beware: lack of training, constant gaslighting, putting people on the spot [...] are the norm. Dose acts like it's fun and cool but there is a reason why half the team quit [...]. Also, there is rampant nepotism at dose, with the CEO hiring many of his friends that aren't actually competent (and you can't really say anything because they are friends and there is NO HR - big red flag). I could go on, but in general, upper management at dose is stuck in a high school mean girl attitude and it seems that will never change. if you're looking to 1up your career, use them for a period of time and then get out. Otherwise, run far far away. The managers put on an amazing front of being friendly and will tell you things like oh your mental health is important etc etc so you think it's this amazing place, but it's really not.</li><li><a href=\"https://www.glassdoor.com/Reviews/Employee-Review-Dose-RVW43169466.htm\"><strong>Progressive Company?</strong></a><strong> </strong>No amount of snacks make up for the toxic and traumatizing workplace environment nurtured here. The leadership micromanaged, gaslit and blamed everything and everyone but themselves while team members quit one after the other and the remaining unrealistic workload fell on fewer and fewer shoulders. The expectation was that working “just” 40 hours a week wasn’t enough. On any given week in the office, the chances were pretty high that someone would end up crying, screaming or melting down. All this from a company that once called itself “progressive.” Also, from a diversity perspective, look out if you are a person of color. The sometimes “subtle” and often explicit racism and prejudice I witnessed had real impacts on many careers, kept promising candidates away and sent talented professionals to the door. Everyone was aware this was happening and nothing was done. This is not a progressive company and I don't think it's an ethical one. Maybe things have changed. I hope they will. Advice to Management: Try kindness, trust people and believe what they tell you. do something</li><li><a href=\"https://www.glassdoor.com/Reviews/Employee-Review-Dose-RVW38897327.htm\"><strong>A discouraging place to work</strong></a><strong> </strong>Toxic work environment -Lack of infrastructure -Burnout galore. Witnessed employees having crying breakdowns at least half a dozen times due to the pressure and workload. -Unpaid overtime -Tight deadlines for a high volume of work -Too many cooks in the kitchen/top-heavy upper management/everyone wants to feel important -No matter how hard you work or how much you accomplish, unless you're willing to consistently be on call past working hours, your work is seen as lacking,&nbsp;or, at best, on par. -The other reviews say it all. The goalposts are always changing, workflow is chaotic, and everyone is overworked. Advice to Management: &nbsp;Stop taking miles when your employees offer inches. When you're a decade-old company, the \"we're a scrappy startup\" line comes off as a glib excuse to treat your employees like workhorses. Deliver when you say you care about your employees' well-being by creating actionable solutions instead of just doing damage control and trying to placate them when things get especially bad. Hire more people, especially creatives, to handle the workload or stop overpromising to clients.</li><li><a href=\"https://www.glassdoor.com/Reviews/Employee-Review-Dose-RVW36379176.htm\"><strong>Values their clients more than their employees</strong></a><strong> </strong>Toxic culture - Expected to work overtime without extra pay - Our mistakes are called out constantly, but our hard work is rarely acknowledged - Management often changes the organizational structure/goals of the company, which results in disorganization and more stress. - Creatives (designers and copywriters) are not being heard by upper management. No matter what the client asks for, management says yes without even thinking about the capabilities or bandwidth of their creative team. This often results in creatives spending an unnecessary amount of hours bending over backwards to execute something. - At least half of the company has had one foot out the door for the past 6 months. There is nobody here who enjoys this company. - Don't work here unless you want to be belittled, stretched too thin, and undervalued. Advice to Management: It's not enough to just say \"I hear you\" when your employees are expressing their concerns. Stop telling them to \"be agile.\" Listen to them, believe that they know what they're talking about, and learn how to push back to your clients when necessary. Your employees are exhausted and unhappy. Get it together.</li></ul></blockquote><p>There are many more negative and honestly <a href=\"https://www.glassdoor.com/Reviews/Dose-Reviews-E1145514_P2.htm?filter.iso3Language=eng\">very sad comments on Glassdoor</a>.&nbsp;</p><p>Given the time it took me to look this up, <strong>I wonder if background checks are ever being done at EA</strong> in the first place (specifically when multi-b/millionaires such as SBF and Emerson feel the urge to embellish their reputation by suddenly becoming \"highly caring altruists\" without having displayed any signs of altruism before). &nbsp;Highly wealthy people could simply be treated like new hires at regular companies because they have a lot more power and are more likely to have different intentions than the average EA.</p><p><i><strong>Doing quick background checks is a very low-cost and reasonable thing to do in order to protect &nbsp;EA &nbsp;and its members.&nbsp;</strong></i><strong>&nbsp;</strong></p><p>The problem with people like Emerson S. is that they come with a lot of private resources, enabling organizations like Nonlinear to pop up, rise and survive out of nowhere. They never had to gain the trust or follow standards like everyone else had to - they can just self-fund.</p><p>&nbsp;<strong>They're not subject to the same scrutiny as others.&nbsp;</strong></p><p>This is even worse, given that they learned how to get so far/accumulate so much wealth in the first place: they know how to behave strategically to get what they want.&nbsp;<br><br>I am truly sorry for anyone who has had to endure such management practices inside and outside of EA. I hope that background checks will be normalized to avoid such problems in the future.</p>", "parentCommentId": "ZhfRBpp3ECGo8nCvj", "user": {"username": "Richard TK"}}, {"_id": "J26MeCcmwToKBA5en", "postedAt": "2022-12-03T20:34:14.065Z", "postId": "L4S2NCysoJxgCBuB6", "htmlBody": "<p>It's important to note that Emerson hasn't worked at Dose since 2017 so none of those Glassdoor reviews were about him</p>\n<p>Additionally, if you have as many employees as Dose has, you will inevitably get some bad reviews. There's especially the bias that people who had a good experience at an organization are less motivated to leave a review.</p>\n<p>Lastly, Nonlinear had been predominantly funded by not Emerson. He's been less than 10% of our funds and we've been funded by all the major EA funders.</p>\n", "parentCommentId": "Sj7vnBDvkQm8JoEc8", "user": {"username": "katherinesavoie"}}, {"_id": "9twvLoYojkYHiNbnT", "postedAt": "2022-12-03T21:15:23.220Z", "postId": "L4S2NCysoJxgCBuB6", "htmlBody": "<p>Thank you for your response.</p><blockquote><p><br>It's important to note that Emerson hasn't worked at Dose since 2017 so none of those Glassdoor reviews were about him</p></blockquote><p><br>Glassdoor states 12 of these comments are directed at Emerson Spartz as CEO.&nbsp;<br>&nbsp;</p><blockquote><p>Additionally, if you have as many employees as Dose has, you will inevitably get some bad reviews</p></blockquote><p><br>This repeated statement that every large org will have the same problem does not seem to be correct. There might be some disappointed or unhappy ex-employees - but not every company will have an average of 0% management approval and a rating of 2.7 while employees repeat the same very serious issues over a long period of time (starting in 2014).&nbsp;</p><blockquote><p><br>Lastly, Nonlinear had been predominantly funded by not Emerson. He's been less than 10% of our funds and we've been funded by all the major EA funders.</p></blockquote><p><br>I am referring to the initial funder playing the most critical role, enabling an organization to jump-start easily (increasing the possibility of securing outside funding in the future) vs. having to rely on external funders / having to gain their trust first.&nbsp;</p><p>I am surprised about the immediacy of strong downvotes of my comment within the first couple of minutes (7 votes). It does not seem to be such a clearly poor comment, nor does the strong negative reaction seem like the standard EA community behavior.</p>", "parentCommentId": "J26MeCcmwToKBA5en", "user": {"username": "Richard TK"}}, {"_id": "tvA6mTqBN6TmgATPa", "postedAt": "2022-12-04T15:34:43.114Z", "postId": "L4S2NCysoJxgCBuB6", "htmlBody": "<p>Hi!</p><p>I’m Minh, current intern at Nonlinear. Since this thread is clearly picking up again, I’d like to provide my perspective as someone who’s worked at Nonlinear, and on the Emergency Fund. First, context:&nbsp;</p><ol><li><strong>All this is my own experience and opinion.</strong> The fact that I had overall positive experiences does not invalidate someone else’s negative experience. I admit it’s … not a good look to have such a high rate of strong negative sentiment.</li><li><strong>I’ve been working with Nonlinear for ~3 months.</strong> About 80% of my interaction is with Drew Spartz&nbsp;<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefr8k5xqsmzk\"><sup><a href=\"#fnr8k5xqsmzk\">[1]</a></sup></span>and Luca (the other intern). The other 20% is Kat who I’ve had one 2-hour meeting with when planning the Nonlinear Emergency Fund and text correspondence/coordination as Nonlinear processes applications. I have never interacted with Emerson.&nbsp;</li></ol><p>What I can do is provide additional context. So far, we’ve received ~40 applications for the Nonlinear Emergency Fund. Kat has been personally following up on requests, coordinating with external funders and handling relevant documents for dozens of grantees. To my knowledge, ~10 of the most time-sensitive requests have been approved. The responsibility is kind of insane, since improper follow-up/delay has immediate consequences on the grantee’s end. About 8 requests indicated they needed to hear back in less than a week, and the shortest was less than three days.</p><p><u>Motivations behind the Emergency Fund</u><br>Keep in mind that none of this is something Nonlinear actually has to do. There’s practically no direct impact to us, and the emergency funding we give out are, to my knowledge, unconditional. I did see one grant that stipulated additional non-emergency funding contingent on producing policy-actionable research, but that doesn’t benefit Nonlinear either.</p><p>During the 2-hour call when Kat, Luca and I discussed the Emergency Fund, the 2 main focuses were:</p><ol><li><strong>Prioritising immediate financial/personal emergencies of grantees</strong></li><li><strong>Prioritising counterfactual impact on EA work</strong> This means bridge-funding projects/work that would otherwise have to be stopped as grantees have to cease their work. I won’t give names, but let’s just say I was very surprised to see projects I’d used before/applied to.</li></ol><p>At no point did I hear ulterior motives. And frankly, I feel like launching an emergency fund of your own money, when you don’t have to, isn’t the kind of thought process a selfish opportunist jumps at.</p><p><u>Implications</u><br>Also, keep in mind that, at the time:</p><ol><li><strong>Nonlinear also lost $250k in funding from FTX Future Fund.</strong> I have been told some of the team also had larger personal funds on FTX. If anything, FTX is paying Nonlinear if clawbacks occur.</li><li><strong>Kat was entirely focused on the community.</strong> Video calling someone on a treadmill while she earnestly details plans to distribute six figures in emergency funding, right after a third of EA funding vanished overnight, is a very surreal experience.</li><li><strong>Kat had no reassurance that any other funders would also step up for any of the grantees.</strong> Hence the explicit assumption was that Nonlinear’s founders would self-fund the grantees out of their own pockets. I distinctly recall her saying “<i>If we need to fund them, that’s a good thing to do.</i>”</li></ol><p><u>Conclusion</u><br>I’ve told this story because:</p><ol><li>This thread about the Nonlinear Emergency Fund has gotten wildly off tangent, so&nbsp;<strong>I might as well update the community with positive news.</strong> Hi!</li><li><strong>I wanted to provide a contrasting perspective.</strong> The team I’ve interacted with has been talking about helping the EA community this entire time, actively coordinating and willingly paid out of pocket for people directly. While this doesn’t invalidate or excuse alleged mistreatment, I just figured my perspective would be significantly belief-updating to people who have only read accusations of morally unscrupulous behaviour for the past month.</li></ol><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnr8k5xqsmzk\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefr8k5xqsmzk\">^</a></strong></sup></span><div class=\"footnote-content\"><p>Drew is great btw, but the accusations so far aren’t directed at him.</p></div></li></ol>", "parentCommentId": null, "user": {"username": "Minh Nguyen"}}, {"_id": "5bC2xP49wiNsDW2mS", "postedAt": "2022-12-04T18:27:52.731Z", "postId": "L4S2NCysoJxgCBuB6", "htmlBody": "<p>Good to know Drew treats you well, though you're right that the allegations so far aren't directed at him.</p><p>Given your impressions of Kat are largely based off a 2 hour call, I don't know if I'd consider this \"significantly belief-updating\" compared to other claims on this thread, though I'm glad you shared your experience.</p><p>Out of curiosity, did anyone ask you, or Luca to make comments on this post, or was this completely unprompted (aside from seeing the recent forum comments?</p>", "parentCommentId": "tvA6mTqBN6TmgATPa", "user": {"username": "pseudonym"}}, {"_id": "vwRZ7gbvqpm3trDBw", "postedAt": "2023-12-15T14:07:22.036Z", "postId": "L4S2NCysoJxgCBuB6", "htmlBody": "<p>I disagree because (i) the forum is my main link to the EA community, and (ii) the SBF scandal suggests that it's better if negative info gets around more easily... though of course we should also be mindful of the harms of gossip.</p>", "parentCommentId": "H8HW3ZtDX3SEM8CdD", "user": {"username": "dpiepgrass"}}]