[{"_id": "pNcX6ivaexWnX9cfz", "postedAt": "2023-05-31T00:53:27.867Z", "postId": "L5EuQ3araz7iESjEA", "htmlBody": "<p>Thanks for writing this! I've been waiting to hear how that residency played out.</p>\n", "parentCommentId": null, "user": {"username": "Guy Raveh"}}, {"_id": "RMXaBbXzBRBW8ou8g", "postedAt": "2023-05-31T02:19:27.008Z", "postId": "L5EuQ3araz7iESjEA", "htmlBody": "<p>I think the title is misleading. Africa is a large continent, and this was just one fellowship of ~15 people (of which I was one). There are some promising things going on in EA communities in Africa. At the same time, and I speak for several people when I say this, EA community building seems quite neglected in Africa, especially given how far purchasing power goes. And many community building efforts to date have been off the mark in one way or another.<br><br>I expect this to improve with time. But I think a better barometer of the health of EA in Africa is the communities that have developed&nbsp;around Africa metropolises (e.g. EA Abuja, EA Nairobi).</p><p><br>I also dislike Fumba being framed to the broader EA community as the perfect compromise. Fumba town was arguably the thing that the residents most disliked. There are a lot of valid reasons as to why the residency took place in Fumba, but this general rosy framing of the residency overlooks the issues it had and, more importantly, the lessons learned from them.</p>", "parentCommentId": null, "user": {"username": "Yelnats T.J."}}, {"_id": "mdXkAytonpot85ZjM", "postedAt": "2023-05-31T09:29:45.067Z", "postId": "L5EuQ3araz7iESjEA", "htmlBody": "<p>I appreciate the feedback, and would love to hear more about your experience (I think many of us would!)</p>\n", "parentCommentId": "RMXaBbXzBRBW8ou8g", "user": {"username": "Khorton"}}, {"_id": "vm8MKWorsjp6Kpv4w", "postedAt": "2023-05-31T13:20:59.710Z", "postId": "L5EuQ3araz7iESjEA", "htmlBody": "<p>Would like to connect with the cohort members or the team organising &nbsp;this &nbsp;community.&nbsp;</p>", "parentCommentId": null, "user": {"username": "monadica"}}]