[{"_id": "bDpyaozFvCrQkyKAJ", "postedAt": "2023-08-08T14:29:40.085Z", "postId": "L8BfajG59MCyCciwf", "htmlBody": "<p>Thanks for posting this - in my sessions with varying EA orgs, I'm finding myself trying to prove the point of why they should be investing in branding and marketing as an effective way to increase funding potential and impact. In order to function like a non-profit not exclusive to EA funding, this is vital for the organization's survival. I'll definitely refer people back here as it comes up!</p>", "parentCommentId": null, "user": {"username": "Deena Englander"}}, {"_id": "CQovzDaJwzJco82Cb", "postedAt": "2023-08-10T08:11:57.359Z", "postId": "L8BfajG59MCyCciwf", "htmlBody": "<p>Thanks Deena! Really appreciate the support.</p>", "parentCommentId": "bDpyaozFvCrQkyKAJ", "user": {"username": "J_Odene_UF"}}, {"_id": "RPzxGdkvghZvfrqWo", "postedAt": "2023-08-14T01:25:30.449Z", "postId": "L8BfajG59MCyCciwf", "htmlBody": "<p>I'm also agree that marketing should have more preference in the EA community. Thanks for all the numbers, it helps put a generalized sentiment into tangible data. A few thoughts:</p><p>(1) Is more value created by better branding for individual organizations vs. the EA movement as a whole? Better branding for individual organizations is definitely more immediate and tangible. However, this the branding of individual organizations (as well as perhaps generalized EA branding), also has long-term effects to increase awareness of the EA movement as a whole. If you think of the competition for the EA movement as a whole, it's the non-EA non-profit movement but also just, anything anyone could spend their money or time on! Obviously there is a huge untapped market here, and I imagine better marketing will help us tap into it more.</p><p>(2) I've had the sentiment for some time that we could utilize emotion much, much more to increase awareness of our causes, our organizations, our donations. Think–for instance–website with full bleed imagery of (gosh, at the risk of sounding offensive, sorry) animals on factory farms vs. animals in their natural, happy, free state. What we see more often is just some text with some data. Anyway, thanks for the study reference regarding emotion here.</p><p>To sum it up: If many billionaires were exposed to very well designed emotional EA-promoting content, backed by amazing reasoning as well, imagine how much more traction this movement could gain.</p>", "parentCommentId": null, "user": {"username": "melissasamworth"}}, {"_id": "YFhX7nsGAabduxQoN", "postedAt": "2023-08-24T23:14:43.403Z", "postId": "L8BfajG59MCyCciwf", "htmlBody": "<p>This is fantastic. Those of us who believe EA needs more art come from virtually an identical motivation - it communicates and amplifies all the great stuff that EA has spent so much time and sweat and money creating...why leave so much impact on the table when you can amplify it to a waiting world? &nbsp;There's more of course with art, but that's a big part of it.&nbsp;<br><br>As another commenter said, this should stand as an EA Marketing reference for all of us...and with so much data, James proves he knows how to speak to his audience! Now we also have to speak to those other audiences that don't want data but want emotion and intellectual inspiration, people just waiting to send in a donation or join a local EA group or move overseas with one of our charities.&nbsp;<br><br>And speaking of inspiration, wait until you see what we've got in store for the \"ea-X-hibition\" art exhibit at EAGx Berlin in September...the piece we are putting up will blow everyone away and other conferences are already asking for it. Tell your friends in Europe.&nbsp;</p>", "parentCommentId": null, "user": {"username": "JeffreyK"}}, {"_id": "TfCFPfjrfcP7hHuKG", "postedAt": "2023-08-29T06:34:25.818Z", "postId": "L8BfajG59MCyCciwf", "htmlBody": "<p>Thanks for your message Jeffrey, always great to hear from fellow creatives.</p>", "parentCommentId": "YFhX7nsGAabduxQoN", "user": {"username": "J_Odene_UF"}}, {"_id": "ydJCjgvKogEw4srib", "postedAt": "2023-08-29T06:41:02.706Z", "postId": "L8BfajG59MCyCciwf", "htmlBody": "<p>Thanks for your comment Melissa.<br><br>In terms of EA as a movement or individual orgs, I would vote for the latter. They typically will have clearer CTAs and modes of supporting their target audiences. Whereas we've seen many challenges to having one unified movement that must represent us all, and us all it. The fundementals of the approach can guide and inform the organisations, but I'm not sure 'the movement' needs to be a something we present to the gen-pop vs organisations, though of course I wouldn't see this as an either/or decision. Both need to improve the marketing work, but perhaps for different reasons.</p>", "parentCommentId": "RPzxGdkvghZvfrqWo", "user": {"username": "J_Odene_UF"}}]