[{"_id": "5KfTKA9EADBXEfNpt", "postedAt": "2023-08-26T18:56:47.431Z", "postId": "L8kEmQgghxS9LXF3H", "htmlBody": "<p>Incredible post, thanks for writting it.</p>", "parentCommentId": null, "user": {"username": "NunoSempere"}}, {"_id": "vswczLrhzKvtrjJXW", "postedAt": "2023-08-26T19:31:13.717Z", "postId": "L8kEmQgghxS9LXF3H", "htmlBody": "<p>Thanks! I think that things with even a ~3% chance of destroying EA are still worthwhile for people to look into.</p>", "parentCommentId": "5KfTKA9EADBXEfNpt", "user": {"username": "trevorw96"}}, {"_id": "xLE9ATByssjbPfp7A", "postedAt": "2023-08-27T13:31:42.417Z", "postId": "L8kEmQgghxS9LXF3H", "htmlBody": "<p>Why do you think that Western intelligence services could be dangerous for EA? My political view is the opposite: EA is the distilled form of our elite ideology. If they are nor investing in us is precisely because they are not very efficient, nor very long term oriented.&nbsp;</p><p>In fact, if I were in 80.000 hours I would make an special program on NatSec positions: we need commited utilitarians in the NatSec apparatus (are our goals anything different from <a href=\"https://forum.effectivealtruism.org/posts/6j6qgNa3uGmzJEMoN/artificial-intelligence-as-exit-strategy-from-the-age-of\">the extension of American Pax Democratica</a> to the entire world?).&nbsp;</p>", "parentCommentId": null, "user": {"username": "Arturo Macias"}}, {"_id": "kCXH6hNxsGnEuSJxf", "postedAt": "2023-09-07T20:41:04.270Z", "postId": "L8kEmQgghxS9LXF3H", "htmlBody": "<p>FWIW I think it's still the case that psychologists/neuroscientists are nowhere near developing an accurate lie detector. And the paper you cite doesn't seem to support the claim that lie detection technology is accurate. From the abstract (emphasis mine):</p><blockquote><p>Analyzing the myriad issues related to fMRI lie detection, the article identifies the key limitations of the current neuroimaging of deception science as expert evidence and explores the problems that arise from using scientific evidence before it is proven scientifically valid and reliable. <strong>We suggest that courts continue excluding fMRI lie detection evidence until this potentially useful form of forensic science meets the scientific standards currently required for adoption of a medical test or device.</strong><br>&nbsp;</p></blockquote><p>There are methodological challenges associated with the typical studies done on lie detection. From a <a href=\"https://onlinelibrary.wiley.com/doi/full/10.1111/psyp.12609\">2016 paper</a> (emphasis mine):</p><blockquote><p>Great hopes and expectations were expressed regarding the potential use of brain imaging techniques for the detection of deception. Contrary to what has been advocated by many researchers as well as practitioners (e.g., Bles &amp; Haynes, <a href=\"https://onlinelibrary.wiley.com/doi/full/10.1111/psyp.12609#psyp12609-bib-0013\"><strong>2008</strong></a>; Farwell, <a href=\"https://onlinelibrary.wiley.com/doi/full/10.1111/psyp.12609#psyp12609-bib-0031\"><strong>2012</strong></a>; Langleben et al., <a href=\"https://onlinelibrary.wiley.com/doi/full/10.1111/psyp.12609#psyp12609-bib-0070\"><strong>2005</strong></a>), <strong>the introduction of new measures such as P300 and fMRI is by no means a solution to the problems associated with the ANS-based CQT polygraph test.</strong> The CQT has been criticized for lacking proper controls and being unstandardized. In addition, its outcome is often contaminated by prior information available to the examiner. None of these criticisms can be resolved by replacing ANS recordings with fMRI measures.</p><p>Moreover, all paradigms face a similar logical problem: deception cannot be directly inferred either from the presence of emotional arousal in the CQT or from attentional orienting or inhibition in the CIT or DoD, regardless of whether ANS, reaction times, ERPs, or fMRI measures have been used.</p></blockquote><p>So I'm not sure what the basis is for saying it's an \"unambiguous mistake\" to think accurate lie detection technology is a long way off.</p>", "parentCommentId": null, "user": {"username": "nathan98000"}}]