[{"_id": "dZnZF89sbwYt7rsds", "postedAt": "2023-11-07T17:50:45.690Z", "postId": "L8N4uh4GixhWCoGAg", "htmlBody": "<p>Looking back, what were the most worthwhile decisions you've made to increase the amount you can donate?</p>\n", "parentCommentId": null, "user": {"username": "Angelina Li"}}, {"_id": "g4myziETtRn4Fm9Lw", "postedAt": "2023-11-07T17:54:05.306Z", "postId": "L8N4uh4GixhWCoGAg", "htmlBody": "<ul><li>Do you think it was a mistake (ex ante) for some folks to de-emphasize earning to give a few years back?</li><li>What sorts of field building efforts around earning to give are you more excited about? E.g., focusing on promising students versus trying to recruit high-net-worth individuals (aka rich people).</li><li>Which of your past donations do you feel best/worst about?</li></ul>", "parentCommentId": null, "user": {"username": "Erich_Grunewald"}}, {"_id": "tDZp6SNE8Ex8enikn", "postedAt": "2023-11-07T18:38:50.695Z", "postId": "L8N4uh4GixhWCoGAg", "htmlBody": "<p>Do you think it would be great for a lot more EAs to donate like you did? Either around 50 percent of the salary, or perhaps capping their income at a certain level and giving the rest, like Maccaskill did back in the day (or maybe still does), and is an option on the giving what you can pledge?</p>\n<p>And why do you think there there not 1000+ EAs giving this kind of money? Even just a thousand people giving 100k a year is 100 million. Not too far from matching Dustin. Is it because there aren't enough high earners, or is it still a rare decision to give these amounts even though it is a high profile coreish EA thing? Or something else?</p>\n<p>Love it and thanks for the Q And A, this is super interesting</p>\n", "parentCommentId": null, "user": {"username": "NickLaing"}}, {"_id": "4676tTc3C6YqqRKYB", "postedAt": "2023-11-07T19:08:09.723Z", "postId": "L8N4uh4GixhWCoGAg", "htmlBody": "<p>Did you ever consider starting your own company (software or otherwise) for earning to give?</p>", "parentCommentId": null, "user": {"username": "akrolsmir"}}, {"_id": "6fMrHz9MrCZrquMgZ", "postedAt": "2023-11-07T19:15:27.865Z", "postId": "L8N4uh4GixhWCoGAg", "htmlBody": "<p>How did this unusual lifestyle choice affect the way you present yourself to others? Opinion conformity is a common impression management technique, and do-gooder derogation is a well documented phenomenon. Do you think earning-to-give affected your career or relationships, compared to the earning-to-spend hypothetical?</p>\n", "parentCommentId": null, "user": {"username": "Ian Turner"}}, {"_id": "xRYv97v5dZTMsdJcz", "postedAt": "2023-11-07T19:44:10.689Z", "postId": "L8N4uh4GixhWCoGAg", "htmlBody": "<p>RE: why aren't there as many EAs giving this much money: I'm (obviously) not Jeff, but I was at Alphabet for many of the years Jeff was. Relevantly, I was also involved in the yearly donation matching campaigns. There were around 2-3 other folks who donated similar amounts to Jeff. Those four-ish people were the majority of EA matching funds at Alphabet.<br><br>It's hard to be sure how many people actually donated outside of giving campaigns, so this might undercount things. But to get to 1k EAs donating this much money, you'd need like 300 companies with similarly sized EA contingents. I don't think there are 300 companies with as large of a (wealthy) EA contingent as Alphabet, so the fact that Jeff was a strong outlier at Google explains most of this to me.</p><p>I think that there are only like 5k individuals as committed to EA as Jeff and his wife are. And making as much money as they did is fairly rare, especially when you consider the likelihood of super committed folks going into direct work.</p>", "parentCommentId": "tDZp6SNE8Ex8enikn", "user": {"username": "dan.pandori"}}, {"_id": "B6FfFQhoYL5ebgMBt", "postedAt": "2023-11-07T23:20:19.894Z", "postId": "L8N4uh4GixhWCoGAg", "htmlBody": "<p>Not a question, just wanted to say that your commitment (to impact) and (actual) impact is inspiring.&nbsp;</p>", "parentCommentId": null, "user": {"username": "yanni"}}, {"_id": "dj93qhp7NqxqtGYxu", "postedAt": "2023-11-07T23:30:32.796Z", "postId": "L8N4uh4GixhWCoGAg", "htmlBody": "<p>I don't understand this reply. It seems to say that few people are donating as much as Jeff because Jeff is a strong outlier, which seems to be a tautology, what am I missing?</p><blockquote><p>But to get to 1k EAs donating this much money, you'd need like 300 companies with similarly sized EA contingents.</p></blockquote><p>Or you'd need a 30 times larger EA contingent at Alphabet and at 10 other high-paying companies. Why aren't more people donating 50%?</p>", "parentCommentId": "xRYv97v5dZTMsdJcz", "user": {"username": "AnonymousAccount"}}, {"_id": "6eF38uBK9nEKKW8wi", "postedAt": "2023-11-08T02:15:17.935Z", "postId": "L8N4uh4GixhWCoGAg", "htmlBody": "<blockquote>\n<p>Do you think it was a mistake (ex ante) for some folks to de-emphasize earning to give a few years back?</p>\n</blockquote>\n<p>How many years back? ;) There used to be a lot of clearly important work that was shockingly underfunded, and I think the early EA approach of encouraging earning to give as a good default option was reasonable. There clearly wasn't the money to support most of us going into direct work.  With <a href=\"https://blog.givewell.org/2014/08/20/open-philanthropy-project-formerly-givewell-labs/\">Good Ventures / Open Phil</a> this changed, however, and I think EAs were generally a bit slow to adjust to the new funding landscape. By the time <a href=\"https://en.wikipedia.org/wiki/Doing_Good_Better\">Doing Good Better</a> came out in 2015 (I'm guessing exacerbated by the long lead times of print) I think we would have ideally no longer been presenting effective giving as the core of EA.  Then I think we overcorrected some pre-FTX, and even more during FTX (when I think we collectively really messed up on risk assessment).  I'm glad to see the community post-FTX shifting back towards including earning to give as one of several core ways to be an EA and one that's a good fit for a lot of people and a lot of life circumstances.</p>\n<p>We should also keep in mind how it's really hard to accurately \"steer\" a movement with as many people as EA.  Even in a community where people care as much about detail, nuance, and getting things right as this one does, a lot of people will still mostly update on discussion of effective giving by becoming somewhat more positively or negatively inclined towards the approach. You can push EA, and any large thing, much more than you can target it. So a history of under- and over-correction is not surprising.</p>\n<p>Still, talking publicly about where we think we should be, and thinking specifically about where we want to be and not just which direction we'd like to shift in, seems like it should be able to do a lot to help us not get top far from the right level of emphasis (both on the question of earning to give and all the other important questions).</p>\n", "parentCommentId": "g4myziETtRn4Fm9Lw", "user": {"username": "Jeff_Kaufman"}}, {"_id": "4YGBvwAkyybtSwuof", "postedAt": "2023-11-08T02:30:10.102Z", "postId": "L8N4uh4GixhWCoGAg", "htmlBody": "<blockquote>\n<p>Which of your past donations do you feel best/worst about?</p>\n</blockquote>\n<p>Looking over <a href=\"https://www.jefftk.com/donations\">the list</a> I feel most proud of my 2012-11-07 donation to <a href=\"https://80000hours.org/\">80k</a>. I don't feel bad about any of my donations, in the sense of thinking they were harmful or did less good than spending the money on myself, though I do think there were often options that would have done a lot more good.  For example, I think the thing where I <a href=\"https://www.jefftk.com/p/give-well-and-deciding-who-to-give-to\">knew about and liked GiveWell</a> in 2010 but <a href=\"https://www.jefftk.com/p/why-i-think-oxfam-is-a-good-choice\">continued donating to Oxfam</a> (though earmarked for monitoring and evaluation) was worse than I should have been able to do. I also think my post-OpenPhil donations have been less effective in expectation than they would have been if I had been seriously leaning into my freedom as an independent and reasonably well-connected individual donor instead of donating via funds, but that also would have required a lot more investment of time and energy than I was willing to dedicate.</p>\n", "parentCommentId": "g4myziETtRn4Fm9Lw", "user": {"username": "Jeff_Kaufman"}}, {"_id": "o8P9hcuAT3rSox27r", "postedAt": "2023-11-08T02:30:36.328Z", "postId": "L8N4uh4GixhWCoGAg", "htmlBody": "<p>Aww, thanks!</p>\n", "parentCommentId": "B6FfFQhoYL5ebgMBt", "user": {"username": "Jeff_Kaufman"}}, {"_id": "5Nvrq22oY8hKASFiw", "postedAt": "2023-11-08T02:34:14.594Z", "postId": "L8N4uh4GixhWCoGAg", "htmlBody": "<p>I’ll pick one of the examples: why do you still donate some even though you are being funded by EA donors?</p>\n", "parentCommentId": null, "user": {"username": "Constance Li"}}, {"_id": "X2WD9RiLfKu7hisw7", "postedAt": "2023-11-08T02:47:28.900Z", "postId": "L8N4uh4GixhWCoGAg", "htmlBody": "<p>Overall, I don't think it has hurt me, and it's helped me in a few ways.</p>\n<p>Work:</p>\n<ul>\n<li>\n<p>When I was working in tech (mostly Google) as far as I could tell people either didn't care (there are a lot of eccentric engineers) or found it inspiring.  It also made it easier for me to negotiate hard for more compensation both psychologically and without risking my relationship with my management chain: I don't think I would have been able to say with a straight face \"I just don't think $400k is an appropriate total compensation\" if it had just been for myself, but I could do \"while this is far more than what I need to live on, you know I work this job so I can donate and I think $400k is below market\".</p>\n</li>\n<li>\n<p>Optimizing for income got me to switch <a href=\"https://www.jefftk.com/p/leaving-cogolabs-joining-google\">to Google</a>, avoiding my natural preferences for satisficing, in a way that ended up being way better for my career.</p>\n</li>\n<li>\n<p>When I did decide to switch into direct work I think people took me more seriously because I had a track record of putting my beliefs into practice through donating.</p>\n</li>\n</ul>\n<p>Personal:</p>\n<ul>\n<li>\n<p>I don't think this has affected my relationship with non-EA friends and family. Both are, as with tech, groups that are very tolerant of weirdness. I do think some of this is being lucky with my particular friends and family: making a lot of money and then donating instead of sharing is something that I've heard from other EAs as causing a <em>lot</em> of tension, and even doing direct work at well below your maximum earning capacity can have the same issues. I'm just very lucky how my extended family has a good culture of boundaries while staying unusually close for Americans.</p>\n</li>\n<li>\n<p>I've met a lot of really interesting people through EA, and have a lot of great conversations. A non-EA me would probably have other friends, but probably drawing more from the contra dance and traditional music communities and I think the variety is great.</p>\n</li>\n<li>\n<p>While I do think my wife and I have the kind of relationship where we could have made an EA/non-EA pairing work, I think we both get a lot out of having a partner with such close value alignment.</p>\n</li>\n</ul>\n", "parentCommentId": "6fMrHz9MrCZrquMgZ", "user": {"username": "Jeff_Kaufman"}}, {"_id": "yaqzpRPjnAssewC68", "postedAt": "2023-11-08T02:57:46.096Z", "postId": "L8N4uh4GixhWCoGAg", "htmlBody": "<p>Yes.  In <a href=\"https://www.jefftk.com/p/found-a-startup-limit-dance-organizing\">Fall 2011</a> I was thinking pretty hard about founding a startup as a way to maximize my income, and was considering the <a href=\"https://www.jefftk.com/p/found-a-startup-limit-dance-organizing#gp-1317926992440\">Summer 2012 YC batch</a>. With what I know about myself now I think I would have been something like 80% likely to get in if I'd gone this route, and the <a href=\"https://web.stanford.edu/~rehall/HallWoodward6.pdf\">Hall and Woodward (2009)</a> estimate I was using (expected value of $5.8M conditional on getting in) was too low. But overall this ended up not being a direction I wanted to go: I wasn't willing to give my life over to my work to the extent it would have required.</p>\n<p>(My dad founded several small businesses growing up, and while these days we get to see him a lot—which is great!—as a kid I saw less of him than I wish I had.)</p>\n", "parentCommentId": "4676tTc3C6YqqRKYB", "user": {"username": "Jeff_Kaufman"}}, {"_id": "Xy6peEr6yjpScYqKm", "postedAt": "2023-11-08T03:01:16.785Z", "postId": "L8N4uh4GixhWCoGAg", "htmlBody": "<p>The biggest one was switching to working at Google in 2012.  While I liked the startup I was working at it clearly wasn't going places and Google had a reputation even then for paying well. My income more than doubled on switching, and then I was lucky that Google continued doing well.</p>\n", "parentCommentId": "dZnZF89sbwYt7rsds", "user": {"username": "Jeff_Kaufman"}}, {"_id": "GR63TaE7uWhbJJG7h", "postedAt": "2023-11-08T03:14:08.785Z", "postId": "L8N4uh4GixhWCoGAg", "htmlBody": "<blockquote>\n<p>Do you think it would be great for a lot more EAs to donate like you did?</p>\n</blockquote>\n<p>I think there are a lot of people donating 10% while working very high paying jobs who really could still have very nice lives giving, say, 30%.  I think it's especially important to <a href=\"https://www.jefftk.com/p/careful-with-luxuries\">avoid</a> letting your standard of living rise with your income, or no matter how much you earn you still won't feel secure.</p>\n<p>But I don't want to be too pushy: people donating 10% effectively are still doing way more than most people do, and I'm glad to see anyone join us at 10%.</p>\n<blockquote>\n<p>perhaps capping their income at a certain level and giving the rest, like Maccaskill did back in the day (or maybe still does)</p>\n</blockquote>\n<p>As of 2022-08-10 MacAskill <a href=\"https://time.com/6204627/effective-altruism-longtermism-william-macaskill-interview/\">still</a> was sticking with his \"<a href=\"https://www.givingwhatwecan.org/en-US/get-involved/further-pledge\">further pledge</a>\".</p>\n<p>I think the further pledge is a good idea for somewhere between \"almost no one\" and \"no one\". Possibly MacAskill, as a way to demonstrate that he's really not in this for the money?</p>\n<p>If a government wants to maximize tax revenue would they set anyone's marginal tax rate at 100%?  Clearly not: they'll make some choices where they forgo cash earnings for non-monetary benefits. When you decide your donation rules you're doing a bit of this yourself, and you should consider what incentives you want to be setting up for yourself.</p>\n", "parentCommentId": "tDZp6SNE8Ex8enikn", "user": {"username": "Jeff_Kaufman"}}, {"_id": "gkzocHZsRsnZGQGMB", "postedAt": "2023-11-08T03:16:26.795Z", "postId": "L8N4uh4GixhWCoGAg", "htmlBody": "<p>I'm curious, since EA's are concentrated in the same places that big tech companies are: Is it that surprisingly few EA's work at Google, or are there a lot and they just mostly donate like 10% of their salaries instead of 50%?</p>\n", "parentCommentId": "xRYv97v5dZTMsdJcz", "user": {"username": "Brendan Long"}}, {"_id": "YrMj6AJhByCFkkMgR", "postedAt": "2023-11-08T03:19:37.857Z", "postId": "L8N4uh4GixhWCoGAg", "htmlBody": "<blockquote>\n<p>And why do you think there there not 1000+ EAs giving this kind of money? Even just a thousand people giving 100k a year is 100 million. Not too far from matching Dustin. Is it because there aren't enough high earners, or is it still a rare decision to give these amounts even though it is a high profile coreish EA thing?</p>\n</blockquote>\n<p>I think there are thousands of times more people who could be giving $100k/y on incomes of $300k+/y than actually are.  It's a very rare thing.</p>\n<p>Some of this is that in the normal world people who feel that seriously about doing good go and work valuable jobs that don't maximize income instead of using donations as an intermediate step. Teachers, public defenders, academics, civil service.  And within EA we've also been encouraging people to strongly consider leaving their well-paying jobs to do directly useful things (<a href=\"https://www.jefftk.com/p/leaving-google-joining-the-nucleic-acid-observatory\">hi!</a>). But I think most of it is that money is tempting, there are always things to spend it on, and we're embedded in a culture where it's normal to keep your earnings for yourself.</p>\n", "parentCommentId": "tDZp6SNE8Ex8enikn", "user": {"username": "Jeff_Kaufman"}}, {"_id": "qmNDbecpMEHgaDJub", "postedAt": "2023-11-08T07:44:11.365Z", "postId": "L8N4uh4GixhWCoGAg", "htmlBody": "<p>As one who donates 50%, it doesn't seem like it should be that uncommon. One way I think about it is earning like upper-middle-class, living like middle-class, and donating like upper-class. Tens of percent of people work for tens of percent less money in sectors like nonprofits and governments. And I've heard of quite a few non-EAs who have taken jobs for half the money. And yet most people think about donating that large of a percent very differently than taking a job that pays less. I'm still not sure why - other than that it is uncommon or \"weird.\"&nbsp;</p>", "parentCommentId": "dj93qhp7NqxqtGYxu", "user": {"username": "Denkenberger"}}, {"_id": "Qv37rEmAEpfSACFYL", "postedAt": "2023-11-08T08:22:41.576Z", "postId": "L8N4uh4GixhWCoGAg", "htmlBody": "<p>Yeah, <a href=\"https://forum.effectivealtruism.org/posts/W7Ms6fvE2ZzoqcEPH/giving-isn-t-demanding\">Giving isn’t demanding</a> and the <a href=\"https://forum.effectivealtruism.org/posts/SZ6reaQ2HkABAcY2N/job-opportunity-to-found-charity-entrepreneurship-ngo?commentId=96JF24PZjB7wZkQCj\">median annual UK salary is £26,800</a><br>&nbsp;</p>", "parentCommentId": "qmNDbecpMEHgaDJub", "user": {"username": "AnonymousAccount"}}, {"_id": "GiGEWHpgukYAF4Qce", "postedAt": "2023-11-08T08:36:35.541Z", "postId": "L8N4uh4GixhWCoGAg", "htmlBody": "<blockquote><p>I think the further pledge is a good idea for somewhere between \"almost no one\" and \"no one\". Possibly MacAskill, as a way to demonstrate that he's really not in this for the money?</p><p>If a government wants to maximize tax revenue would they set anyone's marginal tax rate at 100%? Clearly not: they'll make some choices where they forgo cash earnings for non-monetary benefits. When you decide your donation rules you're doing a bit of this yourself, and you should consider what incentives you want to be setting up for yourself.</p></blockquote><p>&nbsp;</p><p>I don't follow this, don't incentives cut both ways? Someone who has not taken the further pledge will have strong incentives to work in AI Safety/capabilities (where some EAs are making &gt;=7 digits) compared to working in animal welfare, and you had a strong incentive to stay at Alphabet instead of moving into direct work, despite thinking that the latter could be more positive for the world.</p>", "parentCommentId": "GR63TaE7uWhbJJG7h", "user": {"username": "AnonymousAccount"}}, {"_id": "ScsSfYiLgDXwGJnSb", "postedAt": "2023-11-08T10:27:06.995Z", "postId": "L8N4uh4GixhWCoGAg", "htmlBody": "<p>This is a complex of questions on the theme of 'did you actually enjoy your job, and is this important?'<br><br>When you were earning to give, did you enjoy your day-to-day work and find it motivating and meaningful, even if you expected your largest impact to be from your donations? If not, was that difficult, and how did you deal with it? Is your impression that other EtG-ers had/have a similar experience? In general, is it important for EtG-ers to feel positive about their work, or can one compensate for a less good working life by focusing on the positive impact of one's donations?&nbsp;</p>", "parentCommentId": null, "user": {"username": "Amber"}}, {"_id": "xHhFW25w49a2AjCqf", "postedAt": "2023-11-08T10:41:00.743Z", "postId": "L8N4uh4GixhWCoGAg", "htmlBody": "<p>How have you maintained and nurtured a focus on impact when working in places and communities which follow different incentives?&nbsp;<br>Specifically- I can imagine how someone could commit to donating a percentage, and then adhere to that, not worrying about impact day-to-day. But to maintain flexibility (and be able to switch from Earning to Give to a more direct career if and when that becomes the best option) requires a persistent motivation. It looks as though you have achieved that for a long time. What helped?&nbsp;</p>", "parentCommentId": null, "user": {"username": "tobytrem"}}, {"_id": "C5c5aeWCvvWgKWfc5", "postedAt": "2023-11-08T14:49:20.605Z", "postId": "L8N4uh4GixhWCoGAg", "htmlBody": "<p>That's not a way I was thinking about it, thanks for bringing this up!  I normally think of the GWWC pledges as about donations, so the idea that it might be useful via keeping people from making choices that would lead to larger donations is initially a bit counterintuitive, but seems right.</p>\n", "parentCommentId": "GiGEWHpgukYAF4Qce", "user": {"username": "Jeff_Kaufman"}}, {"_id": "KRCrtcLM56Q6vXnwX", "postedAt": "2023-11-08T14:53:23.699Z", "postId": "L8N4uh4GixhWCoGAg", "htmlBody": "<blockquote>\n<p>When you were earning to give, did you enjoy your day-to-day work and find it motivating and meaningful, even if you expected your largest impact to be from your donations?</p>\n</blockquote>\n<p>Yes, I enjoyed it a lot.  I like solving problems and doing good work, and in my various technical positions there's been a lot of that.</p>\n<blockquote>\n<p>Is your impression that other EtG-ers had/have a similar experience?</p>\n</blockquote>\n<p>I do think that's a common experience; <a href=\"https://forum.effectivealtruism.org/posts/gxppfWhx7ta2fkF3R/10-years-of-earning-to-give\">ex</a>:</p>\n<blockquote>\n<p>AGB: \"I like my work. I get to work with incredibly sharp and motivated people. I get to work on a diverse array of intellectual challenges. Most of all, I've managed to land a career that bears an uncanny resemblance to what I do with my spare time; playing games, looking for inconsistencies in others' beliefs, and exploiting that to win.\"</p>\n</blockquote>\n<p>I think people who don't like their work should generally be thinking about whether there's something else they'd like more -- there are so many things you can do with your life that there's probably something you'd like better.</p>\n", "parentCommentId": "ScsSfYiLgDXwGJnSb", "user": {"username": "Jeff_Kaufman"}}, {"_id": "AbfcAdeik3rtRh8Wm", "postedAt": "2023-11-08T15:44:27.432Z", "postId": "L8N4uh4GixhWCoGAg", "htmlBody": "<p>Could you share where you donate?\nI've always found it fascinating when people like you (leading a - dare I say - successful effective nonprofit) donate.</p>\n<ul>\n<li>\n<p>If you don't donate to ALLFED, why is that? (Are you hedging, are you actually not convinced it's the best giving opportunity out there...)</p>\n</li>\n<li>\n<p>If you donate to ALLFED, what's the case for not just taking a lower salary? (Or is that what you do?)</p>\n</li>\n</ul>\n", "parentCommentId": "qmNDbecpMEHgaDJub", "user": {"username": "Moritz von Knebel"}}, {"_id": "Bdz8P8KzEuokYh6ty", "postedAt": "2023-11-08T16:46:06.427Z", "postId": "L8N4uh4GixhWCoGAg", "htmlBody": "<p>For your global health donations, you mostly donated to the Against Malaria Foundation until 2019, then switched to Malaria Consortium until a few years ago, and now donate to GiveWell All Grants Fund. What was the reasoning behind these changes? Do you think it makes any counterfactual difference at the end of the day, given the size of GiveWell's discretionary budget? I expect GiveWell to fund AMF and MC until marginal donations meet the cost-effectiveness bar anyway.</p><p>Asking because my friends and relatives aren't interested in animal welfare or EA Meta, and I don't know if I should advise them to give to AMF (more warm fuzzies, easier sell) or GW All Grants Fund (maybe more impact)</p>", "parentCommentId": null, "user": {"username": "AnonymousAccount"}}, {"_id": "rhic2EkHHDTNj2G7N", "postedAt": "2023-11-08T17:10:30.076Z", "postId": "L8N4uh4GixhWCoGAg", "htmlBody": "<p>There are a lot of 'lurkers', but less than 30 folks would be involved in the yearly holiday matching thread and sheet.  Every self-professed EA I talked to at Google was involved in those campaigns, so I think that covers the most involved US Googlers.</p>\n<p>Most people donated closer to 5-10% than Jeff or Oliver's much higher amounts, that is for sure true.</p>\n<p>So I think both your explanations are true. There are not that many EAs at Google (although I don't think that's surprising), and most donate much less than they likely could. I put myself in that bucket, as I donated around 20%, but likely could have done close to twice that. Although it would be hard for me to do that in recent years, as I switched to Waymo where I can't sell my stock.</p>\n", "parentCommentId": "gkzocHZsRsnZGQGMB", "user": {"username": "dan.pandori"}}, {"_id": "KFcL6Az8rJKAFgbhE", "postedAt": "2023-11-08T18:34:23.325Z", "postId": "L8N4uh4GixhWCoGAg", "htmlBody": "<p>Don't read too much into those changes!  I think I thought of which one to donate to as having a relatively small effect, since as you say others are looking to send their money wherever has the most remaining room for more funding.  But we switched from AMF to MC after <a href=\"https://blog.givewell.org/2019/11/26/announcing-our-2019-top-charities/\">GiveWell's 2019 giving season recommendations</a> said \"We think that Malaria Consortium’s seasonal malaria chemoprevention program can use funding most effectively in the near term.\" Switching from there GiveWell's funds  was downstream from deciding that since we trusted GiveWell's judgement here we should just let them allocate the money directly.</p>\n", "parentCommentId": "Bdz8P8KzEuokYh6ty", "user": {"username": "Jeff_Kaufman"}}, {"_id": "G3TSGsdTgNGnbTs4P", "postedAt": "2023-11-08T20:25:03.784Z", "postId": "L8N4uh4GixhWCoGAg", "htmlBody": "<blockquote><p>(leading a - dare I say - successful effective nonprofit)</p></blockquote><p>Sure - go ahead and dare. :)</p><p>My day job is associate professor of mechanical engineering at University of Canterbury in New Zealand, and I volunteer for ALLFED. Nearly 100% of my donations are to ALLFED. I think that ALLFED is the most cost-effective way of improving the long run future at the margin (see <a href=\"https://allfed.info/images/pdfs/Long_term_cost_effectiveness_of_resilien.pdf\">here</a> and <a href=\"https://allfed.info/images/pdfs/Long-term%20cost-effectiveness%20of%20interventions%20for%20loss%20of%20electricity%20or%20industry.pdf\">here</a>, though I'm not quite as bullish as the mean survey/poll results in those papers), but there are orders of magnitude of uncertainty, and I think more total money should be put into AGI safety.</p>", "parentCommentId": "AbfcAdeik3rtRh8Wm", "user": {"username": "Denkenberger"}}, {"_id": "2FNrfLqWdagXo3Mgr", "postedAt": "2023-11-09T03:07:24.734Z", "postId": "L8N4uh4GixhWCoGAg", "htmlBody": "<p>That's a hard question; I don't know why past me decided to list it as an example!</p>\n<p>A few reasons, none of which are especially compelling:</p>\n<ul>\n<li>\n<p>I took the GWWC pledge, though since I'm \"ahead\" of where I've pledged in terms of the fraction of income I've donated vs the fraction I'd pledged to donate I guess I could hold off for a while?</p>\n</li>\n<li>\n<p>Continuing to give shows others (and reassures myself!) that I'm not going selfish as I get older.</p>\n</li>\n<li>\n<p>I'm skeptical of <a href=\"https://forum.effectivealtruism.org/posts/un3fHR8azykyCoCui\">salary sacrifice</a>, and specifically whether employers really treat it similarly to salary+donation. (Working below market doesn't have this issue because no one is claiming it's equivalent to salary+donation.)</p>\n</li>\n<li>\n<p>If there are opportunities I think are super valuable and going overlooked I'd like to be able to fund them (this is aspirational, though, and I think my last donations that could have been described this way were ~10 years ago)</p>\n</li>\n</ul>\n<p>I don't at all know what norm is a good one for people working 30%+ below market to do something directly valuable, and am open to arguments here!</p>\n", "parentCommentId": "5Nvrq22oY8hKASFiw", "user": {"username": "Jeff_Kaufman"}}, {"_id": "9sNXjssGYjWEmhCRs", "postedAt": "2023-11-09T08:34:38.323Z", "postId": "L8N4uh4GixhWCoGAg", "htmlBody": "<p>Thanks for doing this! I find your blog really inspiring and I'm enjoying reading this q&amp;a.</p>\n<p>Maybe you've already answered this elsewhere but I'm just curious about the switch from donating to global health charities to doing direct anti biorisk work. Was this motivated by theoretical long termist considerations at all? If you could have switched to doing direct malaria prevention work would you have done that instead? (If you hadn't been able to switch to direct work would you have switched your EtG donations to a long termist cause?) Do you worry much about philosophical arguments for long termism Vs helping people right now, or do you focus on more practical considerations when deciding how to help?</p>\n", "parentCommentId": null, "user": {"username": "JM"}}, {"_id": "seNXopwPYqazP3qhu", "postedAt": "2023-11-09T17:16:43.815Z", "postId": "L8N4uh4GixhWCoGAg", "htmlBody": "<p>Do you have thoughts on giving now vs. later? &nbsp;</p><p>Investing to give e.g. (https://www.founderspledge.com/research/investing-to-give)?</p><p>If you got google stock options or grants from 2013 (I don't know if you did) then those would have increased in value about 800%, so could your giving go much further if delayed to take advantage of gain? &nbsp;Or do you think of it some other way?</p><p>Thanks.</p>", "parentCommentId": null, "user": {"username": "Tyner"}}, {"_id": "q4jjiSgeNDoWBznzK", "postedAt": "2023-11-10T01:34:22.129Z", "postId": "L8N4uh4GixhWCoGAg", "htmlBody": "<blockquote>\n<p>Do you have thoughts on giving now vs. later?</p>\n</blockquote>\n<p>The higher you think the risk of extinction is, the less valuable giving later looks: you probably do better giving now either to improve the lives of pre-extinction people or to reduce the risk of extinction.</p>\n<p>Futures where we avoid extinction are likely <a href=\"https://www.cold-takes.com/all-possible-views-about-humanitys-future-are-wild/\">pretty strange</a>, and I think historical reasoning around growth patterns seems unlikely to apply well. I don't know how this goes overall, but it generally makes me more optimistic around capacity building (movement, governance, institutions, technology) than around building large financial reserves.  But I'm far from an expert here!</p>\n<blockquote>\n<p>If you got google stock options or grants from 2013 (I don't know if you did) then those would have increased in value about 800%, so could your giving go much further if delayed to take advantage of gain?</p>\n</blockquote>\n<p>About half my Google compensation was in stock grants, but I sold them as they vested.  My future income was already so correlated to Google's performance that I didn't want any additional correlated risk if I could avoid it.  Yes, Google did well over that period, but that wasn't something we knew would happen.  If I had wanted to be investing-to-give I would have done it with index funds.  And if there were low-fee \"everything except Google\" index funds that would have been even better.</p>\n", "parentCommentId": "seNXopwPYqazP3qhu", "user": {"username": "Jeff_Kaufman"}}, {"_id": "gBh3YxzhoKRaPQxew", "postedAt": "2023-11-10T21:04:15.355Z", "postId": "L8N4uh4GixhWCoGAg", "htmlBody": "<p>[I'm married to Jeff.] As a counterpoint, around the same time Jeff was figuring out some of this earning to give stuff, I was having a <a href=\"https://forum.effectivealtruism.org/posts/pnsK8xFwF5nGZFfwT/snapshot-of-a-career-choice-10-years-ago\">crisis</a> about whether I should also go into earning to give. I just couldn't think of any high-earning career I thought I would be ~happy in, so I stuck with social work. And then it turned out that my skills were a lot more useful in EA community work than I had anticipated.</p>", "parentCommentId": "KRCrtcLM56Q6vXnwX", "user": {"username": "Julia_Wise"}}, {"_id": "ijr98eecSpK2jbLDZ", "postedAt": "2023-11-11T03:43:32.245Z", "postId": "L8N4uh4GixhWCoGAg", "htmlBody": "<p>Hi Jeff! Something that I've been thinking about re: earning to give is that it seems popular to donate a portion of one's income each year. However, this feels like it necessarily requires one to re-evaluate the space of possible donations each year and have a consistently good estimate of the best place for the money. On the other hand, one could donate far more infrequently (or even just donate upon retirement) and more deeply research the best charity of the time. However, this latter approach is more complicated and seems more vulnerable to issues like value drift and akrasia. Do you have any thoughts on this tension? How did you decide to give every year?</p>", "parentCommentId": null, "user": {"username": "ada"}}, {"_id": "Z7GhZgK3u9h2hqzPe", "postedAt": "2023-11-11T15:52:38.779Z", "postId": "L8N4uh4GixhWCoGAg", "htmlBody": "<p>I think if you're thinking along these lines, a <a href=\"https://forum.effectivealtruism.org/topics/donor-lotteries\">donor lottery</a> might be a good fit for you? It has the advantage of getting money out the door quite a bit sooner, though some people don't like the randomization aspect or how it can seem weird/crass/illegible.</p>\n", "parentCommentId": "ijr98eecSpK2jbLDZ", "user": {"username": "Jeff_Kaufman"}}, {"_id": "TvFS94vDPm78DxR4f", "postedAt": "2023-11-12T09:51:09.151Z", "postId": "L8N4uh4GixhWCoGAg", "htmlBody": "<p>As an ETG, one thing I struggle with is work/life balance, knowing the more I work and progress in the corporate world, the more I can donate. Have you faced similar struggles and any advice you would share? Thank you!</p>\n", "parentCommentId": null, "user": {"username": "Zuber Nosimohomed"}}]