[{"_id": "wCsMCnESMia6PpaBQ", "postedAt": "2015-01-11T21:30:41.014Z", "postId": "L9TWehZhpPAf6tcrj", "htmlBody": "<p>Thanks for the paper Owen.</p>\n<p>Existential hope sounds like an opposite to existential despair, rather than to existential risk and could increase the already common confusion regarding that!! Of course, it's only a private paper, but since it's designed to establish terminologies, it's something to think about.</p>\n", "parentCommentId": null, "user": {"username": "RyanCarey"}}, {"_id": "s8nR4eT3FMJXepc26", "postedAt": "2015-01-12T04:11:21.740Z", "postId": "L9TWehZhpPAf6tcrj", "htmlBody": "<p>I like &quot;x-dream&quot;!</p>\n", "parentCommentId": "wCsMCnESMia6PpaBQ", "user": {"username": "Austen_Forrester"}}, {"_id": "9fjwX28ML3nL3Mp9P", "postedAt": "2015-01-12T04:26:04.071Z", "postId": "L9TWehZhpPAf6tcrj", "htmlBody": "<p>This is the kind of nugget I visit this forum for! I have x-dreams for veganism and EA to become the norm globally. Other x-dreams I can think of are making electricity out of nothing (or close to it); high yield, drought resistant crops; a technological breakthrough that will permit people to work less, or not at all; Islam to go the way of Christianity in giving up violence; a strong African Union that keeps peace on the continent; a way of preventing global warming or of cooling the earth; an end to the practice of girl killing in Asia responsible for huge gender imbalances; compassion replacing domination as the prevailing worldview/lifestyle choice; and an end put to anonymous shell companies and secret bank accounts that enable the corrupt. </p>\n", "parentCommentId": null, "user": {"username": "Austen_Forrester"}}, {"_id": "Jrvj74HBiZAmKn59E", "postedAt": "2015-01-12T11:25:57.447Z", "postId": "L9TWehZhpPAf6tcrj", "htmlBody": "<p>Probably the most important &quot;good things that can happen&quot; after FAI are:</p>\n<ul>\n<li><p>Whole brain emulation. It would allow eliminating death, pain and physical violence, not even mentioning ending discrimination and social stratification on the basis of appearance (although serious investment into cybersecurity would be required).</p>\n</li>\n<li><p>Full automation of the labor required to maintain a comfortable style of living for everyone. Avoiding a Malthusian catastrophe would still require reasonable reproduction culture (especially given immortality due to e.g. WBE).</p>\n</li>\n</ul>\n", "parentCommentId": null, "user": {"username": "Squark"}}, {"_id": "SM5K9nCdySS2oQGLe", "postedAt": "2015-01-12T11:44:01.092Z", "postId": "L9TWehZhpPAf6tcrj", "htmlBody": "<p>Thanks Ryan, I hadn't actually spotted that issue with the term &quot;existential hope&quot;. I don't think it's necessarily enough to sink the term, but it's worth being aware of.</p>\n<p>English doesn't have a work for the chance of a good thing, which makes it awkward to find the right term. Earlier drafts just stuck to &quot;existential eucatastrophe&quot;, which has the right meaning. However it was pointed out that eucatastrophe is very obscure and most people would see the word 'catastrophe' inside it and assume it meant something bad. We wanted a term which would give something of the right impression. </p>\n", "parentCommentId": "wCsMCnESMia6PpaBQ", "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "aH6mFxEwBhPdj8gv6", "postedAt": "2015-01-12T11:48:49.169Z", "postId": "L9TWehZhpPAf6tcrj", "htmlBody": "<p>&quot;Existential dream&quot; is an interesting alternative. It carries some helpful connotations. However, it doesn't sound like the kind of thing you can increase or decrease, which makes it less good as the term mirroring &quot;existential risk&quot;. </p>\n<p>You seem to be using it closer to the sense of &quot;existential eucatastrophe&quot;. I admit that it's more grokkable than that!</p>\n", "parentCommentId": "s8nR4eT3FMJXepc26", "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "r3QeBJZ6nQcSJwMwR", "postedAt": "2015-01-12T11:52:43.904Z", "postId": "L9TWehZhpPAf6tcrj", "htmlBody": "<p>It seems like the development of these would increase expected value massively in the medium term. I'm not sure what the effect on long term expected value would be (because we'd expect to develop these at some point anyway in the long term).</p>\n", "parentCommentId": "Jrvj74HBiZAmKn59E", "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "bxXezcogctoC2Dd9c", "postedAt": "2015-01-12T18:16:29.865Z", "postId": "L9TWehZhpPAf6tcrj", "htmlBody": "<p>'Existential opportunity'?</p>\n", "parentCommentId": "aH6mFxEwBhPdj8gv6", "user": {"username": "Arepo"}}, {"_id": "uWLTpYeZKXiBLndFy", "postedAt": "2015-01-12T18:42:41.134Z", "postId": "L9TWehZhpPAf6tcrj", "htmlBody": "<p>Everything I can think of sounds mercantile:\n'Existential profit'\n'Existential gain'</p>\n", "parentCommentId": "bxXezcogctoC2Dd9c", "user": {"username": "Arepo"}}, {"_id": "pAzGntfzfNFgYkmnL", "postedAt": "2015-01-12T20:59:29.187Z", "postId": "L9TWehZhpPAf6tcrj", "htmlBody": "<p>When I first heard of Bostrom's phrase &quot;existential risk&quot;, I felt it was overly philosophical because it sounded like a concept in existentialism. I agree with Owen+Toby's paper that &quot;extinction risk&quot; is already adequate when talking about extinction.</p>\n<p>Words are sticky, so it may be hard to ditch &quot;existential risk&quot;, but if we were doing it over again, I'd choose something else, like &quot;astronomical risks&quot; and &quot;astronomical benefits&quot;.</p>\n", "parentCommentId": "wCsMCnESMia6PpaBQ", "user": {"username": "Brian_Tomasik"}}, {"_id": "N63sCkezDcKZAEain", "postedAt": "2015-01-13T06:30:09.008Z", "postId": "L9TWehZhpPAf6tcrj", "htmlBody": "<p>Okay, I thought x-hope/eucatastrophe were the same thing. I was thinking of &quot;existential dream&quot; for the latter.</p>\n<p>For a positive parallel to &quot;risk&quot; that can increase or decrease, I'd use &quot;potentiality&quot;. Potential/potentiality is generally used to refer to something good/beneficial, but I can't say that &quot;existential potentiality&quot; exactly roles off the tongue!</p>\n", "parentCommentId": "aH6mFxEwBhPdj8gv6", "user": {"username": "Austen_Forrester"}}, {"_id": "4PfdZtbYQz5h9RrY3", "postedAt": "2015-01-23T10:57:25.725Z", "postId": "L9TWehZhpPAf6tcrj", "htmlBody": "<p>I think all those are great. But I am more suspicious that taking work out of the equation will improve society - how will we ensure that surplus is distributed reasonably?</p>\n<p>my x-hopes are really a kind of success criteria for the movement: a culture pinned around evidence, scientific reasoning and trial and error in policy, medicine and other important areas. A culture around prioritising what problems to solve based on suffering, human flourishing and equality (and that includes the brakes on trial and error in some areas such as new technologies). A global economic/political system that comes from/whose creation is the genesis of those two things that is immensely more effective in improving the human condition than we have currently.</p>\n", "parentCommentId": "9fjwX28ML3nL3Mp9P", "user": {"username": "tomstocker"}}, {"_id": "DZFYivQaQ9nzSea9B", "postedAt": "2015-01-25T16:50:06.065Z", "postId": "L9TWehZhpPAf6tcrj", "htmlBody": "<p>Perhaps you could use the phrase 'existential reward' instead of 'existential eucatastrophe'?</p>\n", "parentCommentId": "SM5K9nCdySS2oQGLe", "user": {"username": "RyanCarey"}}, {"_id": "vXTZhtY3vXa9TZ2vk", "postedAt": "2015-01-26T12:43:23.003Z", "postId": "L9TWehZhpPAf6tcrj", "htmlBody": "<p>That falls a bit flat for me -- neither the right connotations (as 'existential dream' more or less has) nor the right actual meaning (as 'existential eucatastrophe' has).</p>\n", "parentCommentId": "DZFYivQaQ9nzSea9B", "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "CT8XvEuCmapKP28Km", "postedAt": "2015-01-30T07:46:27.565Z", "postId": "L9TWehZhpPAf6tcrj", "htmlBody": "<p>Good point. In the long run, the important thing is to reach the best attractor point / asymptotic trajectory. We need to develop much better understanding of the space of attractors (&quot;possible ultimate fates&quot;) and the factors leading to reaching one rather than another. I'd say that the things I mentioned are definitely on the wish list of the attractor we want to select.</p>\n", "parentCommentId": "r3QeBJZ6nQcSJwMwR", "user": {"username": "Squark"}}]