[{"_id": "tpMX7GK57aY2hWdEY", "postedAt": "2023-11-19T15:29:35.698Z", "postId": "LA7jgMjkgfpu4QCGx", "htmlBody": "<p>I was at the career fair, hosted a workshop for first-timers and attended a few things.</p><ul><li>I was really happy to see the geographic diversity of attendees. My session was attended by people in India, Norway, Indonesia, Germany, Ethiopia, the Czech Republic, Austria, Spain, Finland, Canada, the US and the UK (from memory, I'm probably missing many more).</li><li>I spoke with someone who had spent a decade teaching English in China who was finding out how to contribute (spoiler: this is <a href=\"https://80000hours.org/skills/experience-with-an-emerging-power-especially-china/\">valuable work experience for a range of EA issues</a>).&nbsp;</li><li>I was part of a discussion between group leaders from Barcelona and Indonesia who were figuring out which language to host their intro fellowships in.</li><li>I feel very grateful to all the speakers, organisers, volunteers, meet-up hosts, workshop hosts, staff and attendees who joined this event, often at odd hours and probably in place of other weekend plans. Thank you!</li></ul>", "parentCommentId": null, "user": {"username": "OllieBase"}}, {"_id": "LvmLkeLtF8F3zWosD", "postedAt": "2023-11-19T17:19:30.030Z", "postId": "LA7jgMjkgfpu4QCGx", "htmlBody": "<p>I had a lovely conversation with someone currently working for Mercy for Animals about food systems in Southeast Asia, including some aspects of the logistics for transporting vegetables as opposed to animal-based food that I wasn't aware of. I think I might have I learned more from this conversation than from any other conversation I've had at an EAG or EAGx event.</p>", "parentCommentId": null, "user": {"username": "jlemien"}}, {"_id": "fJJxmu3bpG9p5jguh", "postedAt": "2023-11-28T20:22:37.224Z", "postId": "LA7jgMjkgfpu4QCGx", "htmlBody": "<p>During EAGxVirtual, I hesitantly reached out to almost everyone tagged with a particular affiliation group to ask for their brief input, and was very positively surprised by 1) the ratio of responses to non-responses, and 2) that the responses were more positive and enthusiastic than I might have expected.</p>", "parentCommentId": null, "user": {"username": "VictorW"}}]