[{"_id": "Tj9LsbhJvGWjaQz8j", "postedAt": "2023-01-07T17:36:29.627Z", "postId": "LaDGhL8yZuz28rdKG", "htmlBody": "<p>Interesting post and curriculum. I look forward to hearing about the outcomes of the first run as you evaluate them and get results. My own estimates for the likeliness of this achieving 85% better outcomes than the current method are significantly lower, but I think there's a chance this will be an improvement.</p><p>That being said, some points of disagreement.</p><ol><li>I think the framing of \"creating\" rather than \"finding\" motivated altruistic individuals does not match my own expectation of dealing with university students. When I was an undergraduate myself, I definitely conceived of myself as altruistic, and was actively looking for a cause/group to become active in, both for the social and ethical aspects of activism. Now that I teach first-year students, I think there is a large group of similar motivated altruistic individuals that seek a group to engage with, and I think there is a lot of value in identifying them and pointing them towards EA as a way to act on their altruistic motivation. Many students I meet then stay in the first group/broad direction they focused their altruism on, making it even more valuable to present them with EA as an option early-on.</li><li>I am worried that this group in particular would be somewhat turned off by the flair of the syllabus you present. Young people that are already altruistically motivated may not look to \"Understand Themselves\", \"Find Meaning\" or \"Try to live a happy life\". Rather, they may be focused on their altruistic motivation, being angry and upset not at their own life not going well, but the injustice they have become aware of as they grew up (think: Climate Change, Poverty, Racism, Discrimination etc). A syllabus that focuses on one-self, rather than others, may not be a good fit for already altruistic young adults. I myself would likely not have enrolled in this program at an early age, having been a pretty arrogant young man that thought he \"figured out\" the problems and solutions facing the world, as I was mainly scouting for groups that helped me address problems I found most pressing.</li><li>One reason for skepticism about your predictions is that my prior for \"intervention induces altruistic motivation\" is relatively low after reading about a series of philosophers experimenting with using prompts and/or courses to induce altruistic behaviour, which turned out to be pretty tough! That being said, if this program were to achieve this goal, that would be very impressive and meaningful, so I applaud the effort going into executing and evaluating the program.</li></ol>", "parentCommentId": null, "user": {"username": "mhendric"}}, {"_id": "hpPhKqN5k5mPxhSNb", "postedAt": "2023-01-07T18:21:01.334Z", "postId": "LaDGhL8yZuz28rdKG", "htmlBody": "<p>I like the general idea of this post, and I think this idea/program is something worth experimenting with. Would love to see how it goes, if you decide to run it. That being said, I have a couple thoughts.<br><br><strong>Weak criticism: (I expect there is probably a good rebuttal to this) </strong>We might want some selection for students who have already determined that they want to make \"doing good\" a large part of their life. Maybe these students are more conscientious than the average individual, and this is an early signal of them being people who self reflects on their values/thoughts/beliefs more. This could mean that they will perform better at careers that take a lot of critical thinking and/or careful moral reasoning. That's not to say these kinds of thinking skills cannot be learned, but they may be picked up faster and performed better by students who already exhibit some level of personal reflection at a younger age.<br><br><strong>Stronger criticism:</strong> If students have not internalized that doing good matters to them, and would therefore not want to join the Intro EA Program, I strongly suspect they will also <i>not</i> be interested in a 5-week program about their purpose and life planning. My main concern here is that outreach will be difficult (but it's easy to prove me wrong empirically, so feel free to go out and do it!)<br><br><strong>A final thought on framing/overstepping: </strong>If I were a student first hearing about this program, I think I would be a little bit suspicious of the underlying motives. From a surface-level impression, I would think that the goal of the program would be for me \"find my purpose\"... then I would look more into who is running the program and ask myself \"who are these EA people, and why do they care about my purpose?\", after which I would quickly find out that they want me to join their organization.<br>&nbsp;</p><p>I think the main concern that I want to bring up is that I think this program could easily be turned into a sort of bait-and-switch. Finding one's purpose and life goals is a very individual process, and I wouldn't want this process to be \"hijacked\" by an EA program that directs people in a very specific direction. I.e. my concern is that the program will presented as if it is encouraging people to find their values and purpose, but in reality it's &nbsp;just trying to incept them into following an EA career path.&nbsp;<br><br>Not sure if/how this can be avoided, except for being really up-front about the motivation of the program with applicants. I also might be misunderstanding something, so feel free to correct me.</p>", "parentCommentId": null, "user": {"username": "harrygietz@gmail.com"}}, {"_id": "diTTakYam8LBhLrcw", "postedAt": "2023-01-07T20:58:35.004Z", "postId": "LaDGhL8yZuz28rdKG", "htmlBody": "<p>I agree with this last point on underlying motives. &nbsp;EA is one direction for purpose-seeking people to go in, but not everyone will choose it. &nbsp;This program could also look vaguely religious, which is generally preferable to avoid.</p><p>I would also question whether a focused program is the best way to develop people with EA motivation. &nbsp;I think sometimes people go through the intro program and find purpose in it because...</p><ol><li>They see their peers struggling with the same questions about meaning and purpose</li><li>Their facilitator has found meaning through EA and are acting based on EA ideas</li><li>It's grounded in an empirical context (\"Wow, I didn't realize that lots of people live on $2 a day, 70 billion land animals are slaughtered each year for no good reason, and AGI may pose an existential risk.\")</li></ol><p>I do, however, want to say that I appreciate the thinking you've done here. &nbsp;The identifying vs. generating talent topic is one that I look forward to reading more about, including follow-ups to this post with results.</p>", "parentCommentId": "hpPhKqN5k5mPxhSNb", "user": {"username": "Pete Rowlett"}}, {"_id": "dN7KDqxiW6HzsNomd", "postedAt": "2023-01-08T05:54:10.570Z", "postId": "LaDGhL8yZuz28rdKG", "htmlBody": "<blockquote><p>This is because the current paradigm for community building emphasises&nbsp;<strong>finding</strong> talented and ambitious people that want to tackle the world's most pressing problem, and not to&nbsp;<strong>create</strong> them.</p></blockquote><p>Can you clarify this? This could mean different things:</p><ol><li>We should make EA people more talented</li><li>We should make EA people more ambitious</li><li>We should make people more talented</li><li>We should make people more ambitious</li><li>We should make people want to tackle the world's most pressing problems</li></ol><p>and other stuff. I assume you mean (3)+(4)+(5) all at once via a new strategy targeting the \"four reasons why people are not joining your Introductory EA Program.\" IMO current community building is already trying to do (5). And there seem to be efforts to make people more productive (e.g. some office spaces provide food and bring people together so they can share ideas).</p>", "parentCommentId": null, "user": {"username": "jakubkraus07@gmail.com"}}, {"_id": "nXWkoJHnvvzDkA8FR", "postedAt": "2023-01-09T14:33:04.530Z", "postId": "LaDGhL8yZuz28rdKG", "htmlBody": "<p>Thank you for your criticism and feedback, Harrison. I agree that if EA groups are not careful, they can come across as preachy or manipulative. Therefore, it's very important to emphasise that the PLP Track is <strong>not intended to convince</strong> students to join the Introductory EA Program or our EA group. Its aim is to help students think about their values and their life and choose what is best for them, not what is best for any particular group. In the upcoming time we will work on strategies that attempt to mitigate risks like these.</p><p>Regarding your strong criticism, I believe your argument is plausible, but there are a few reasons why I have a different opinion. &nbsp;Many young adults are still figuring out what they want to do with their lives. While<a href=\"https://www.simplypsychology.org/maslow.html\"> Maslow's hierarchy of needs</a> has limitations, I believe we can draw some important conclusions from it. According to Maslow, people must have their basic needs more or less met before they can focus on higher level needs. Before people focus on giving something back to the world (which is in my eyes self-actualisation), people must first satisfy their own basic needs (like having intimate relationships or the perception of security and safety). I think there is a substantial amount of young adults who simply can't afford to invest a lot of time into caring about others. Before this can effectively happen people need to take care of themselves.</p><p>The PLP Track can potentially aid this process by helping people learn more about what is actually important to them and what they are good at. Once these areas are addressed individuals may be more likely to move on to caring about others and generating social impact. I think this is also one of the reasons why <a href=\"https://forum.effectivealtruism.org/posts/F9E8MwsPLiqSYhXJm/lessons-from-running-stanford-ea-and-seri#Lessons\">career-focuses messaging</a> is a lot more effective than donation-focused messaging. It addresses the more urgent and important needs of younger adults.</p><p>As for your \"weaker\" criticism about the filtering effect, I agree that it can be beneficial. However, people come from a variety of backgrounds and often have different levels of support and resources available to them. External factors, such as privilege and luck, can significantly impact an individual's ability to focus on personal development and meeting their basic needs before they can consider \"giving something back\" to the world. To put it bluntly, I think the current paradigm for EA community building of \"finding\" talented and ambitious people may actually be identifying those that are the most privileged. Those that had the time to lay the groundwork for EA ideas and to figure out that they want to make \"doing good\" large part of their life. I think it is difficult to argue that &nbsp;someone who is not interested in EA as a student won't likely be a good fit. What about those who had to spend a significant portion of their time working outside of university and dealing with a variety of other challenges?&nbsp;They simply did not have the time yet to figure these things out for themselves.</p><p>I think there is a high chance that we are losing out on a substantial amount of people who could be a very good fit, but are not (yet) due to external factors people often can't control. Moreover, while I think it's true that genetics and personality play a significant role in an individual's inclination towards EA ideas, there is <a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2743415/\">evidence</a> that suggests that personality traits can change throughout the 20s and even beyond. However, I believe this is a strong point you make. I am also rather skeptical about the extent to which personality changes throughout adulthood.</p><p>To conclude my response, I think it's important &nbsp;to recognize that individuals are at very different stages in their development. As a result, I believe that (established) EA university groups should develop more programs that cater to a diverse range of people in order to avoid missing out on those who may be a good fit for EA, but are not yet due to external factors.</p>", "parentCommentId": "hpPhKqN5k5mPxhSNb", "user": {"username": "Johan de Kock"}}, {"_id": "PygTYxMvevKC5JxfH", "postedAt": "2023-01-09T14:39:12.856Z", "postId": "LaDGhL8yZuz28rdKG", "htmlBody": "<p>Also thank you Pete for your point here! I agree that the intro program can be a very good way for people to find purpose. However, I argue that a significant proportion of people are less interested in learning about \"doing good better\" simply because more basic needs are not being met (you can read more about this in my response to Harrison's comment I just posted). If people read through the curriculum before signing up to the intro fellowship and see concepts like \"effectiveness mindset\" or \"scope insensitivity\", then I think many will ask themselves \"Great, that's all very nice. But how is that going to help me find a job with which I support myself and my family?\"</p><p>People will prioritise their time according to what is <strong>currently</strong> most important to them. And if you are in a phase of your life where you are not as privileged to be able to make doing good a core part of your life, you will often have more urgent things to manage than joining an Introductory EA Program. So while I agree that the intro program has many potential benefits, I believe the actual challenge is getting people to sign up for it in the first place.</p><p>That's why the PLP Track might be more effective at attracting those who wouldn't normally consider the Intro Program. It provides value in a different way and addresses different priorities.</p>", "parentCommentId": "diTTakYam8LBhLrcw", "user": {"username": "Johan de Kock"}}, {"_id": "CDhBgHHXxWrgxQEmE", "postedAt": "2023-01-10T09:24:57.734Z", "postId": "LaDGhL8yZuz28rdKG", "htmlBody": "<p>I appreciate your thoughts Malte. Thank you for sharing them! I agree with your point that there are university students who are already altruistically motivated and actively seeking ways to make an impact. I also agree that this type of audience may be less interested in this track because they have already covered the related topics and themes. It will be interesting to see to what extent this is the case. I think the Introductory EA Program is very appropriate for this group.</p><p>However, I argue that there is a large group of students who have not yet reflected on their core priorities in life and the importance of doing good. These students may not be immediately inclined to explore ways to improve their impact, as they have not yet internalised the reasons of why doing good matters to them.</p><p>The PLP Track is primarily intended to provide value to this second group of students. It's goal is to help them consider what they truly value in the long-term and what kind of life they want to live. Through this process, they may come to realize that incorporating a focus on doing good aligns with their values and goals, and become more motivated to explore ways of doing good better, such as by participating in the Introductory EA Program.</p><p>It is important to note that that my first hypothesis intended to convey that the PLP Track is 85% more effective in converting this type of audience, those that are not altruistically motivated yet.&nbsp;I hypothesize that this type of audience will not even join the Introductory EA Program in the first place (there are of course exceptions). This is because unless people have internalised <strong>why</strong> doing good&nbsp;matters <strong>to them</strong> I argue that they will be a lot less likely to care about <strong>how</strong> to do good better.</p><p>I could have made that clearer in the post, and I think it is possible that my prediction is overly confident. Time will most likely reveal the validity of this hypothesis and whether my tendency to be rather optimistic distorted the accuracy of my prediction. Then I am happy to update my beliefs and learn from it for the next time.&nbsp;Thanks again for your thoughts!</p>", "parentCommentId": "Tj9LsbhJvGWjaQz8j", "user": {"username": "Johan de Kock"}}, {"_id": "37pJaYeSMC68KGWr3", "postedAt": "2023-01-10T11:59:17.568Z", "postId": "LaDGhL8yZuz28rdKG", "htmlBody": "<p>Yes, I will give my best! Thanks for asking Jakub. Using your list, it would be points 4 and 5.&nbsp;</p><p>To provide further nuance, I would like to emphasize two points.&nbsp;<br>First, regarding point 4, I believe that many individuals possess a great deal of talent and ambition, however, they may be directed towards different pursuits. When I speak of \"creating,\" I am primarily referring to <strong>redirecting</strong> ambition towards tackling the world's most pressing problems.&nbsp;<br><br>Secondly, in regards to point 5, I believe that encouraging individuals to address the most pressing issues is not always best accomplished simply by educating them about these issues.&nbsp;</p><p>People have different priorities and ambitions at various stages in their lives, which is natural. I would argue that the challenge is that many individuals have not thoroughly reflected on their most important values and goals. As a result, it becomes hard for them to tell if what they're doing aligns with their goals they might find most important in the end. In fact, determining this can be challenging. In other words, when I speak of \"creating\" individuals who want to tackle the world's most pressing problems, I mean that we should empower people to <strong>re-evaluate their existing priorities </strong>and to let them learn about the \"fact\" that making a positive impact may be one of many meaningful ways to lead a fulfilling life. Through this process, individuals may come to realize that this path will bring them (and others) more happiness.&nbsp;</p><p>This ties into the second point. Before individuals can care about addressing the most pressing issues, they need to understand why it matters to <strong>them</strong> personally. Unless an individual has established that making a positive impact is a core part of their life, why should they be motivated to tackle the world's most pressing problems? The underlying reason for wanting to do so often stems from a desire to prevent large-scale suffering or improve the wellbeing of many.&nbsp;</p><p>I agree with you that community building is already working towards point 5, however, the current approach is only effective for a relatively small portion of people - namely, those who have already determined that making a positive impact is important to them. For those who have not yet reached this realization, learning about how to make a bigger impact will not be particularly effective unless they are first motivated to do so. Improving their productivity or time management skills will not be particularly helpful unless they have a desire to use their time to make a positive impact. I believe that we need a more diverse range of strategies to inspire this motivation in different types of individuals. For some, learning about how to make a big impact may be sufficient, while for others, learning about why making an impact matters may be necessary as a foundation for intrinsic motivation.&nbsp;<br><br>I hope this helps!</p>", "parentCommentId": "dN7KDqxiW6HzsNomd", "user": {"username": "Johan de Kock"}}, {"_id": "FnntRumQKK6BPchec", "postedAt": "2023-01-12T23:09:50.685Z", "postId": "LaDGhL8yZuz28rdKG", "htmlBody": "<p>Thanks for the detailed reply. So instead of informing people who value altruism about the best ways to help, we should also try to elevate the importance of altruism within people's values. Am I understanding correctly?</p>", "parentCommentId": "37pJaYeSMC68KGWr3", "user": {"username": "jakubkraus07@gmail.com"}}, {"_id": "Ff9PWxxeznYaduAuA", "postedAt": "2023-01-22T19:49:30.838Z", "postId": "LaDGhL8yZuz28rdKG", "htmlBody": "<p>Yes indeed. It is not only about providing guidance for those who already prioritize making a positive impact, but also about inspiring and fostering that desire in individuals who may not have fully considered that option. By providing people with the opportunity to think about the relevance of altruism in their own lives we might not only be able to elevate its importance within individuals' values but also create a more motivated and well-informed group of individuals who are eager to learn about the most effective ways to make a difference.</p>", "parentCommentId": "FnntRumQKK6BPchec", "user": {"username": "Johan de Kock"}}, {"_id": "qro2D7LNRxpJF9jN6", "postedAt": "2023-01-23T13:46:24.249Z", "postId": "LaDGhL8yZuz28rdKG", "htmlBody": "<p>I've skimmed this post - thanks so much for writing it!</p><p>Here's a quick, rushed comment.</p><p>I have several points of agreement:</p><ul><li>If we could get more people on board with the goal of EA (i.e., making the biggest positive difference they can), then that would be much better than just seeking out people who already have (or nearly have) that goal.</li><li>So it seems worth investing effort now into figuring out how to get people motivated towards this goal.</li><li>I agree that the four \"reasons why people aren't joining your introductory EA program\" you give are true statements (although I'm less sure they're the most important things to focus on)</li><li>I agree that getting people intrinsically motivated to maximise good seems really valuable if it can be done</li></ul><p>But I think I disagree about several important things:</p><ul><li>I think it's true that doing good is beneficial for one's own life. But I think that the <i>magnitude </i>of your impact matters much less for one's own sense of purpose, self-approval, etc.<ul><li>People can live very purposeful &amp; fulfilling lives by picking a cause; being cause-neutral and trying to maximise your positive impact seems if anything slightly less fulfilling, because it means you'll probably end up working on something that is more neglected and so is less emotionally fulfilling.</li></ul></li><li>I think that helping already-altruistic people to realise that they care about the magnitude of their impact seems more promising than trying to help more people to be altruistic. I think that your program is mostly targeted at the second of these.</li><li>I suspect that the way people can end up with the goal of actually maximising good is more like:<ul><li>Believe that the magnitude of your impact matters, and that bigger is better</li><li>Feel that have a large impact is achievable</li><li>Feel that doing the EA project is good for my own purposes (makes me feel fulfilled, etc)</li><li>Identify as someone that is trying to do the EA project</li><li>Feel belonging to a social group that is trying to do the EA project</li></ul></li></ul><p>So I think I'm more keen on projects that focus on helping altruistic people to get on board with the EA project. &nbsp;I'd be very interested in any updates on how your plans go, though!</p>", "parentCommentId": null, "user": {"username": "Isaac_Dunn"}}, {"_id": "Yq8JYhGMAErK7ch85", "postedAt": "2023-02-20T16:41:21.370Z", "postId": "LaDGhL8yZuz28rdKG", "htmlBody": "<p>Thanks for writing up your thoughts Isaac! You present some thought-provoking perspectives that I have not yet considered.</p><p>I particularly resonate with your first point of disagreement that individuals can derive personal benefits from being altruistic simply by choosing <strong>some</strong> cause. Your argument that striving for cause-neutrality and maximizing positive impact may be less fulfilling is a valid one. However, I am unsure why working on a less neglected cause would necessarily be less emotionally fulfilling. In fact, pursuing something \"unique\" may be quite exciting. Nonetheless, I agree that cause-neutrality may be less fulfilling, as we all have unconscious biases that may favor certain causes due to personal experiences or connections. This may make steering against these inclinations more difficult, perhaps even unpleasant.</p><p>I also agree that targeting \"already-altruistic people\" who care about the magnitude of their impact probably is very promising. Social impact is heavy tailed so it is likely that these individuals could contribute to most of the net impact generated. I just think that EA university groups should not be the stakeholder group that make this trade-off.</p><p>In my view, it is important to carefully consider how to differentiate and vary the strategies of EA university, city, and national groups.</p><p>With the target audience of university groups being very young adults, I believe it is detrimental to exclude those who may not yet be \"there yet\". As I have previously argued, there are many young and ambitious individuals who have not yet determined their life's direction, and they could be easily nudged towards becoming \"already-altruistic\". The loss of counterfactual impact would be huge.</p><p>I would agree, however, that for city or national groups, a narrower focus might be a better strategy.</p><p>What are your thoughts on having a broader focus for EA university groups, but a narrower one for city &nbsp;groups?</p>", "parentCommentId": "qro2D7LNRxpJF9jN6", "user": {"username": "Johan de Kock"}}, {"_id": "mrckQCH34YWi5tz8i", "postedAt": "2023-02-20T17:54:39.816Z", "postId": "LaDGhL8yZuz28rdKG", "htmlBody": "<p>Oh to be clear, I think that almost all altruistic people do <i>not </i>much care about the magnitude of their impact (in practice).</p><p>So I think the approach I'd suggest is to focus on altruistic people, and helping them realise that they probably do really care about the magnitude of their impact on reflection.</p><p>That's a much larger group than the people who are already magnitude-sensitive, and I think the intervention is probably more feasible at the moment than for people who have no existing interest in altruism.</p><p>&nbsp;</p><p>I haven't thought much about strategy for city/national groups, but I think I agree that later in life, people are much more set on their existing path, so if any stage is to focus on people who aren't altruistic yet, it would be university or high-school groups.</p>", "parentCommentId": "Yq8JYhGMAErK7ch85", "user": {"username": "Isaac_Dunn"}}, {"_id": "554TuDbS7pAYGQFRm", "postedAt": "2023-03-04T07:33:57.580Z", "postId": "LaDGhL8yZuz28rdKG", "htmlBody": "<p>I listened to this post &nbsp;through the Non-Linear Library yesterday, thanks for writing this.<br>I think this post misses several things - (sorry if you already addressed some of these and I missed it). &nbsp;</p><p>1. Most people struggle to \"think big\" (related: Scope Insensitivity). It is hard and unintuitive to fathom that Charity X could be three orders of magnitude more effective than Charity Y.&nbsp;<br><br>2. Most people want practical certainty. Cultivated meat could be huge for the world. But it is still very uncertain whether this could be affordable in the foreseeable future. &nbsp;And no one guarantees that the industry of cultivated meat &nbsp;would still exist in ten years. &nbsp;</p><p>Due to these -<br>Many people's default image of charity is still volunteering in a soup kitchen (This is partly because many famous celebrities, including athletes, donate their money to provide warm meals in a certain community or toys for children). And many people's default image of doing good but not in a charity perspective is community oriented and very practical straightforward jobs like becoming a firefighter or &nbsp;a school teacher. &nbsp;<br>These are practical, certain to be good, could never backfire, and the smile of the recipient of the soup is guaranteed and not far away in time.</p><p>3. This point is extremely important in my eyes - many people do not believe they are capable of \"doing something big\". Even if someone is convinced for example that &nbsp;being a cultivated meat scientist is effective, he might not believe in himself that he has the capabilities to become one.&nbsp;</p><p>4. Regarding your correct point that meaning can bring more happiness than a yacht. I think that many people do in fact realize this more and more (even though many still do not) - but most students don't think about yachts and mansions, as they can't &nbsp;even afford the insurance for the yacht they do not have. They just want to get a job that could enable them to afford the down payment for an apartment later down the road. Most people want some financial security and stability before wanting to save the world. It is like convincing someone to donate 10% of his income to charity - but he doesn't even have an income he could donate from.&nbsp;</p><p>5. Which brings me to this point. &nbsp;Many people view doing good as a sacrifice - school teachers make less money than programmers. What I think they don't necessarily &nbsp;realize is that being a cultivated meat scientist or AI researcher or several other EA careers are actually not necessarily a financial sacrifice at all, and even if they are, they could still afford the down payment for the apartment they dream of. We could really emphasize this point.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Dvir Caspi"}}, {"_id": "xhL35c2fFqntRYBsg", "postedAt": "2023-03-25T07:49:22.674Z", "postId": "LaDGhL8yZuz28rdKG", "htmlBody": "<p>Hi Dvir, thank you for sharing your thoughts and raising some interesting points. I appreciate the insights and would like to address each of them in the context of my original post and previous responses.</p><ol><li>Your first point about scope insensitivity and the difficulty for people to \"think big\" is well-taken. This ties in nicely with your third point about many people not believing they are capable of \"doing something big.\" I completely agree that these challenges exist, which is why I believe it is important to help people gain this confidence in themselves. As expressed previously, I am quite skeptical to what extent the existing introduction track actually enables people to build this. Surely, people can learn about the fact that we live in a very important time and that each of us can make a big impact, but I think that real belief in yourself and ambitiousness stems from seeing evidence of the things you have already accomplished. It also comes from a deep understanding of who you are, where you come from, and what you are about. This is what I try to address with the PLP Track partially. The point you bring up is very important in my eyes, and I think one of the most influential factors in people considering high-impact opportunities.</li><li>I appreciate your point about the importance of financial security and stability in people's lives. As you rightly pointed out (I think), many people need to have their basic needs met before they can focus on higher-level goals, such as making a positive impact in the world. This highlights the importance of presenting EA as not only a path to do good but also as a means to achieve personal fulfillment and security. Emphasizing the variety of careers and opportunities within the EA community that can provide both financial stability and the chance to make a difference could be a powerful motivator for many individuals.</li><li>This leads me to my last point. The perception of doing good as a sacrifice is indeed a challenge that needs to be addressed. I think that reframing EA as a fulfilling and purpose-driven pursuit that can be integrated into one's life without requiring a sacrifice of everything can make the ideas of Effective Altruism more appealing and accessible to a wider audience. I am not entirely sure, though, to what extent we want this, as I do think that the majority of impact stems from a very small fraction of people. On the other hand, you could flip the argument again and argue that due to the young age of students at university, there is not an insignificant chance that people could become highly engaged if approached from a different angle.</li></ol><p>In light of your points, I wonder if you have any suggestions on how EA university groups could better communicate the potential personal benefits and opportunities for personal growth that come with engaging in Effective Altruism? Do you have any ideas on how we can better address the concerns and challenges you've raised to create a more inclusive and empowering community for individuals at different stages of their lives?</p><p>Thank you for sharing your insights and prompting further discussion on this topic!</p>", "parentCommentId": "554TuDbS7pAYGQFRm", "user": {"username": "Johan de Kock"}}]