[{"_id": "GuPg7cg3yEZcRdEfo", "postedAt": "2017-04-06T17:37:09.706Z", "postId": "LaXGf6hZXXqZ7sj5m", "htmlBody": "<blockquote>\n<p>these bottom lines remain in every estimate of the global income distribution I’ve seen so far...\nMany people in the world live in serious absolute poverty, surviving on as little as one hundredth the income of the upper-middle class in the US.</p>\n</blockquote>\n<p>But is this bottom line really approximately true? </p>\n<p>A salary of $70,000 could be considered upper-middle-class. 1/100th of $70,000 is $700. </p>\n<p>According to the chart, that is slightly greater than the income of the median Indian, adjusted for PPP. </p>\n<p>Since these figures have been adjusted, that should mean that <em>$700 in Western Europe or the US will afford you the same quality of life as the median Indian person</em>, without you getting any additional resources such as extra meals from sympathetic passers-by or free accommodation in a shelter (because otherwise, to be 100 times richer you would have to have 100 units per day of these additional resources - i.e. $70,000 plus 100 meals/day plus owning low-quality accommodation for 100 people). </p>\n<p>However, $700/year (= $1.91/day, =€1.80/day, =£1.53 /day) (without gifts or handouts) is not a sufficient amount of money to be alive in the west. You would be homeless. You would starve to death. In many places, you would die of exposure in the winter without shelter. Clearly, the median person in India is better off than a dead person. </p>\n<p>A realistic minimum amount of money to not die in the west is probably $2000-$5000/year, again without gifts or handouts, implying that to be 100 times richer than the average Indian, you have to be earning at least $200,000-$500,000 net of tax (or at least net of that portion of tax which isn't spent on things that benefit you - which at that level is almost all of it, unless you are somehow getting huge amounts of government money spent on you in particular). </p>\n<p>The reality is that a PPP conversion factor is trying to represent a nonlinear mapping with a single straight line, and it fails badly at the extremes. But the extremes are exactly where one is getting this (misleading) factor of 100 from. </p>\n", "parentCommentId": null, "user": {"username": "the_jaded_one"}}, {"_id": "T6ebvHYoPJtsyTNSQ", "postedAt": "2017-04-06T19:21:14.983Z", "postId": "LaXGf6hZXXqZ7sj5m", "htmlBody": "<p>I think your last paragraph is plausibly true and relevant, but this is a common argument and it has common rebuttals, one of which I'm going to try and lay out here.</p>\n<blockquote>\n<p>However, $700/year (= $1.91/day, =€1.80/day, =£1.53 /day) (without gifts or handouts) is not a sufficient amount of money to be alive in the west. You would be homeless. You would starve to death. In many places, you would die of exposure in the winter without shelter. Clearly, the median person in India is better off than a dead person.</p>\n</blockquote>\n<p>The basics of survival are food, water, accommodation and medical care. Medical care is normally provided by the state for the poorest in the West so let's set that to one side for a moment. For the rest we set a lot of minimum standards on what is available to buy; you can't get rice below some minimum safety standard even if that very low-quality rice is more analogous to the rice eaten by a poor Indian person, I would guess virtually all (maybe actually all?) dwellings in the US have running water, etc.</p>\n<p>This presents difficult problems for making these comparisons, and I think it's part of what Rob is talking about in his point (2). One method that comes to mind is to take your median Indian and find a rich Indian who is 10x richer, then work out how that person compares to poor Americans since (hopefully) the goods they buy have significantly more overlap. Then you might be able to stitch your income distributions together and say something like [poor Indian] = [Rich Indian] / 10 = [Poor American] / 10 = [Rich American] / 100. I have some memory that this is what some of the researchers building these distributions actually do but I can't recall the details offhand; maybe someone more familiar can fill in the blanks.</p>\n<blockquote>\n<p>A realistic minimum amount of money to not die in the west is probably $2000-$5000/year, again without gifts or handouts, implying that to be 100 times richer than the average Indian, you have to be earning at least $200,000-$500,000 net of tax (or at least net of that portion of tax which isn't spent on things that benefit you - which at that level is almost all of it, unless you are somehow getting huge amounts of government money spent on you in particular).</p>\n</blockquote>\n<p>Building on the above, hypothetically suppose over the next 50 years the West continues on its current trend of getting richer and putting more minimum standards in place; the minimum to survive in the West is now $10,000 per year and the now-much-richer countries have a safety net that enables everyone to reach this. However, in India nothing happens. </p>\n<p>Is it now true that I need at least $1,000,000 per year to be 100x richer than the median Indian? That seems peverse. Supposing my income started at $100,000 and stayed constant in real terms throughout, why do increases in minimum standards that basically don't affect me (I was already buying higher-than-minimum-quality things) and don't at all affect the median Indian make me much poorer relative to the median Indian? As a result I think this particular section 'proves too much'.</p>\n", "parentCommentId": "GuPg7cg3yEZcRdEfo", "user": {"username": "AGB"}}, {"_id": "4bdLLSdKsxEcijdXd", "postedAt": "2017-04-06T20:10:47.075Z", "postId": "LaXGf6hZXXqZ7sj5m", "htmlBody": "<p>Just a quick aside: currently the <em>mean</em> individual income for a US college grad is about $77,000. If you have a kid, that's a bit lower, and these are 2016 figures, which makes them a bit higher. Still, I think upper middle class implies higher earning than the mean college grad.</p>\n<p>See footnote 2 here:\n<a href=\"https://80000hours.org/career-guide/job-satisfaction/\">https://80000hours.org/career-guide/job-satisfaction/</a></p>\n<p>I think of 'upper middle class' as jobs like doctor, finance, corporate management. The means here are quite a bit higher e.g. the mean income of doctors in the US is over $200k.</p>\n", "parentCommentId": "GuPg7cg3yEZcRdEfo", "user": {"username": "Benjamin_Todd"}}, {"_id": "SKiFqgdQwJrW9jhAE", "postedAt": "2017-04-07T00:43:27.569Z", "postId": "LaXGf6hZXXqZ7sj5m", "htmlBody": "<p>2 (Different ways of adjusting for ‘purchasing power’) is tough, since not all items will scale the same amount. And markets typically are aimed at specific populations, so rich countries like America often won't even have markets for the poorest people in the world. The implication of this is that living on $2 per day in America is basically impossible, while living on $2 per day, even when &quot;adjusted for purchasing power&quot; in some poorer parts of the world (while still incredibly difficult), is more manageable.</p>\n", "parentCommentId": null, "user": {"username": "Daniel_Eth"}}, {"_id": "gde7KuozbGdcNdyqH", "postedAt": "2017-04-07T07:28:58.475Z", "postId": "LaXGf6hZXXqZ7sj5m", "htmlBody": "<p>In my experience, what the Brits humbly call &quot;upper middle class&quot; is what Aussies would call upper class.</p>\n", "parentCommentId": "4bdLLSdKsxEcijdXd", "user": {"username": "RyanCarey"}}, {"_id": "D8FK5HqzfA5qrqG6h", "postedAt": "2017-04-07T22:34:56.869Z", "postId": "LaXGf6hZXXqZ7sj5m", "htmlBody": "<p>Thanks for this and thanks as always for all the fantastic 80,000 Hours content.</p>\n", "parentCommentId": null, "user": {"username": "nonzerosum"}}, {"_id": "L4dtQ8sCW6TLLuQkb", "postedAt": "2017-04-08T00:38:14.499Z", "postId": "LaXGf6hZXXqZ7sj5m", "htmlBody": "<blockquote>\n<p>why do increases in minimum standards that basically don't affect me (I was already buying higher-than-minimum-quality things) and don't at all affect the median Indian make me much poorer relative to the median Indian?</p>\n</blockquote>\n<p>Well, this itself may prove too much. </p>\n<p>Suppose that the minimum to survive in the west is raised to $90,000, and if you have less than that you are thrown out onto the streets and made homeless. </p>\n<p>If the minimum to not be homeless is $90,000 and you earn $100,000, are you REALLY 100 times richer than someone on $1000 who has a shack to live in and food to eat? </p>\n<blockquote>\n<p>and the now-much-richer countries have a safety net that enables everyone to reach this.</p>\n</blockquote>\n<p>that's a nice fantasy but in reality the way the west works is if you are a single young male and you have less than enough money to afford rent, there is no safety net in many places, especially the USA and the UK. You are thrown into the homelessness trap. </p>\n", "parentCommentId": "T6ebvHYoPJtsyTNSQ", "user": {"username": "the_jaded_one"}}, {"_id": "yHP8DceA9DWxpuwyb", "postedAt": "2017-04-08T16:51:58.488Z", "postId": "LaXGf6hZXXqZ7sj5m", "htmlBody": "<p>If minimum standards rise to $90,000 and I'm earning $100,000, I would argue they do probably affect me substantially and my original premise of 'minimum standards that basically don't affect me' no longer holds. For example, I might to start putting substantial money aside to make sure I can meet the minimum if I lose my job, which will eat into my standard of living. That's why I used numbers where I think that statement does actually hold ($10,000 minimum versus $100,000 income).</p>\n<blockquote>\n<p>that's a nice fantasy but in reality the way the west works is if you are a single young male and you have less than enough money to afford rent, there is no safety net in many places, especially the USA and the UK. You are thrown into the homelessness trap.</p>\n</blockquote>\n<p>Sure, this is why I said 'hypothetically' and 'in 50 years'. I'm not sure your above claim is true in the UK even as of today in any case.</p>\n<p>(UK benefits are a bit of a maze so I'm wary of saying anything too general, but running through one website (<a href=\"http://www.entitledto.co.uk\">www.entitledto.co.uk</a>) and trying to select answers that correspond to '22 year old single healthy male living in my area with no source of income', I get an entitlement of £8,300 per year, most of which (around £5,200) is meant to cover the cost of shared housing. Eyeballing that number I <em>think</em> 100pw should indeed be enough to get a room in a shared property at the low end of the housing market around here. </p>\n<p>I think it is also true that a 21 year old wouldn't get that entitlement because they are supposed to live with their parents, but there are meant to be 'protections' in place where that isn't possible for whatever reason. I haven't dug further than that.)</p>\n", "parentCommentId": "L4dtQ8sCW6TLLuQkb", "user": {"username": "AGB"}}, {"_id": "P8axT7XtNWLJKX8qJ", "postedAt": "2017-04-08T21:21:25.857Z", "postId": "LaXGf6hZXXqZ7sj5m", "htmlBody": "<p>Thanks for writing this!  This is a helpful overview of some of the challenges in coming up with a single quantitative view.</p>\n<p>Overall, I think this suggests two things about how to display and interpret the relevant data.</p>\n<p>First, when using purely quantitative estimates of distributions in currency terms to illustrate an overall trend, use a variety of different consistent estimates. It seems like when the whole thing you're trying to estimate is income inequality, stitching together different sources for the portions below and above the 80th percentile is very likely to introduce problems. For instance, if your above-80% source is better at detecting income, or otherwise biased upwards relative to your below-80% source, then this will substantially overestimate income inequality.</p>\n<p>I would have liked to instead see the whole curve drawn from PovCalNet numbers, with the trendline from Milanovic overlaid on it. Or, ideally, as many different estimated lines as you can measure on the same axis. It's fine to merely footnote or link to explanations for exactly <em>why</em> the lines differ, how they were generated, and your thoughts on which ones are better estimates for which quantiles, but when you use a single graph, people are likely to assume that it's an authoritative illustration of a single data source, whereas showing multiple estimates makes it clearer that there is uncertainty about the details, but not about the fact that the distribution is very unequal.</p>\n<p>If you're worried that this would lead to a too-noisy graph, I highly recommend Edward Tufte's books for advice on how to visually display a large amount of quantitative information elegantly.</p>\n<p>Second, we shouldn't use these numbers directly to make judgments about specific programs to help poor people. Instead, when trying to evaluate any particular decision, we should make sure we understand how a difference in dollar figures relates to a difference in material conditions, since this will not be perfectly consistent.</p>\n<p>For instance, if you use &quot;purchasing power parity&quot; figures, you may get a better estimate of how big differences in material circumstances are, but at the cost of obscuring things like what percentage of someone's income a cash transfer of a certain size will constitute. For this reason, the work charities like GiveDirectly and JPAL are doing directly reporting on <em>what happens</em> as a result of various interventions is extremely important.</p>\n", "parentCommentId": null, "user": {"username": "BenHoffman"}}, {"_id": "WTc6iWoH76KzkQD5P", "postedAt": "2017-04-08T21:47:00.097Z", "postId": "LaXGf6hZXXqZ7sj5m", "htmlBody": "<p>Thanks Ben, this sounds reasonable. I'm working to create a new figure that will have more recent data, inflation adjust up to 2017, and offer more details about precisely how it was constructed. I'll keep these ideas in mind.</p>\n<p>Unfortunately, as I'm waiting on other people busy people to get back to me with the data/information I need, I can't say when I'll be able to put it up.</p>\n", "parentCommentId": "P8axT7XtNWLJKX8qJ", "user": {"username": "Robert_Wiblin"}}, {"_id": "7bASu9aFGtH7Cczry", "postedAt": "2017-04-08T22:10:11.144Z", "postId": "LaXGf6hZXXqZ7sj5m", "htmlBody": "<p>I'm looking forward to it whenever it's ready.</p>\n<p>As an aside, one advantage to Tufte-style information-dense charts is that they can be interesting enough to engage readers with more of the details of the content, and not just say &quot;yeah, OK&quot; to your main point. For instance, the first graph in your post rewards additional attention. When readers engage with the details, they may learn more valuable things from the data than the ones you'd had in mind.</p>\n", "parentCommentId": "WTc6iWoH76KzkQD5P", "user": {"username": "BenHoffman"}}, {"_id": "3P5TTFcw6xdWfPeqx", "postedAt": "2017-04-09T11:41:11.484Z", "postId": "LaXGf6hZXXqZ7sj5m", "htmlBody": "<blockquote>\n<p>If minimum standards rise to $90,000 and I'm earning $100,000, I would argue they do probably affect me substantially and my original premise of 'minimum standards that basically don't affect me' no longer holds. </p>\n</blockquote>\n<p>And I think the reality of the situation facing many people <em>in the intended audience of the original graph</em> is at least somewhat like that. </p>\n<p>As this debate has progressed, the amount of income corresponding the targeted person has gradually moved upwards from $70k gross in an expensive area of The West (Bay Area, Oxford UK, NYC, London) to $200k net in an average-cost-area (Ohio). I feel like there is something of a motte-and-bailey defence going on here: </p>\n<ul>\n<li><p>the &quot;motte&quot; is the position that the superstar lawyer earning $200k after tax who inexplicably lives in Cleveland, Ohio could pretty reasonably be said to be roughly 200 times richer than the person in the developing world on $1000. Not quite true (because it still fails the division test), but close. Problem with the &quot;motte&quot;: If you literally told young EA recruitment targets that they all earned $200k post tax and lived in Cleveland, Ohio where living costs are average, they would unanimously object that that's nowhere near their situation in life.  </p>\n</li>\n<li><p>the &quot;bailey&quot; is position that young potential EA recruits earning $70k net in an expensive area are literally 100 times richer than an average Indian earning $700. Advantage of the &quot;bailey&quot;: makes people feel extremely guilty and more likely to donate money or sign the pledge. Disdvantage of the &quot;bailey&quot;: as always, it's not actually a defensible position. We can see this by the fact that as I push on it, a retreat is happening. </p>\n</li>\n</ul>\n", "parentCommentId": "yHP8DceA9DWxpuwyb", "user": {"username": "the_jaded_one"}}, {"_id": "DfGvAxdfNpgCfYpmZ", "postedAt": "2017-04-11T18:00:31.641Z", "postId": "LaXGf6hZXXqZ7sj5m", "htmlBody": "<p>On reflection, it's not clear to me that anyone has the appropriate level of urgency around this. Two distinct datasets were stitched together at the 80th percentile. The dataset used for the above-80 figures was chosen specifically because it had higher numbers. This chart was then used specifically to illustrate how unequally the quantity was distributed.</p>\n<p>This is not a problem on the level of &quot;someone could potentially be misled&quot;. This is a problem on the level of &quot;this chart was cooked up specifically to favor the intended conclusion.&quot; When you're picking and choosing sources for <em>part</em> of a trend, it stops mattering that the chart was originally based on real data.</p>\n<p>It's entirely possible for someone to make this sort of error thoughtlessly rather than maliciously, but now that the error has been discovered, the honest thing to do is promptly and prominently retract the chart, with an explanation.</p>\n<p>It's also possible I'm somehow misunderstanding. For instance, I'm confused about why there isn't at least a small discontinuity around the 80th percentile - substantially differing methodologies shouldn't get the exact same numbers.</p>\n", "parentCommentId": "WTc6iWoH76KzkQD5P", "user": {"username": "BenHoffman"}}, {"_id": "BKhWCWqgmStFbSvnh", "postedAt": "2017-04-11T20:18:03.990Z", "postId": "LaXGf6hZXXqZ7sj5m", "htmlBody": "<p>&quot;However, $700/year (= $1.91/day, =€1.80/day, =£1.53 /day) (without gifts or handouts) is not a sufficient amount of money to be alive in the west. You would be homeless. You would starve to death. In many places, you would die of exposure in the winter without shelter.&quot;</p>\n<p>One could live on that amount of money per day in the West. You'd live in a second-hand tent, you'd scavenge food from bins (which would count towards your 'expenditure', because we're talking about consumption expenditure, but wouldn't count that much). Your life expectancy would be considerably lower than others in the West, but probably not lower than the 55 years which is the life expectancy in Burkina Faso (as an example comparison, bear in mind that number includes infant mortality). Your life would suck very badly, but you wouldn't die, and it wouldn't be that dissimilar to the lives of the millions of people who live in makeshift slums or shanty towns and scavenge from dumps to make a living. (Such people aren't representative of all extremely poor people, but they are a notable fraction.)</p>\n", "parentCommentId": "GuPg7cg3yEZcRdEfo", "user": {"username": "William_MacAskill"}}, {"_id": "JsBXBop7CtLJMMvzD", "postedAt": "2017-04-12T04:19:02.801Z", "postId": "LaXGf6hZXXqZ7sj5m", "htmlBody": "<p>Hey, a few comments:</p>\n<blockquote>\n<p>But is this bottom line really approximately true?</p>\n</blockquote>\n<p>Rob is saying “in <em>every estimate</em> of the global income distribution I’ve seen so far”, there has been a 100:1 ratio, which is true because this is what's shown by all the official data.</p>\n<p>You could, of course, doubt the existing estimates. My general policy is to go with the expert view when it comes to issues that have been thoroughly researched, unless I've looked into it a lot myself. At 80,000 Hours, we don't see ourselves as experts on measuring global income, so instead go with the World Bank, Milanovic and others. Moreover, to our knowledge, the objections raised here are all well understood by the experts on the topic, and have already been factored into the analyses.</p>\n<p>That said, here a few comments to show why the Milanovic etc. estimates are not obviously wrong. First, I'll state the problem, then consider the arguments.</p>\n<p>I'm claiming that US upper middle class = $100k+ for the reason above.\nThe World Bank estimated 800m people live under $1.9 per day in their 2015 figures, or $600 per year. In reality, many of them will live well below that level. So there's probably hundreds of millions living under $300 per year.\nThis means there's over a factor of 300 difference between &quot;upper middle class&quot; and &quot;large numbers of the global poor&quot;</p>\n<p>So, for the claim to be strictly wrong, the consumption of the poor have to be relatively underestimated by a factor of 3. Given the difficulties in making these estimates, this doesn't seem out of the question, but is not obvious. </p>\n<p>Moreover, for it to be wrong in a way that becomes decision-relevant, you'd need the understatement to be more like a factor of 10. Even then, it would still be true that upper middle class earn 30x what the global poor earn, so they'd still be able to benefit others at little cost of themselves, and have a disproportionate influence on the world. But, it would be less pressing than a 300x difference.</p>\n<p>Here are a couple of reasons why it's not obvious the world bank etc is off by a factor of 10.</p>\n<p>It seems the main argument is that you'd die with under $2/day in the west and no hand-outs, so quality of life is worse than $2 in the developing world.</p>\n<p>Will gives one response to that in another comment. You wouldn't actually die.</p>\n<p>Another point is that it would <em>indeed</em> be harder to live in the west on $2/day, because the low-quality goods that the global poor use are not available to buy. I think the relevant comparison is more like &quot;if there were <em>lots</em> of people living on $2/day in the west, what quality of living would you get?&quot;. It's artificial to imagine one person living in extreme poverty without a market and community around them. The PPP adjustments are meant as a hypothetical &quot;what you could buy on $2 per day if the same goods were sold in stores, or if there were lots of other poor people in the country&quot;. (Though of course this is one reason why the comparisons are difficult conceptually.)</p>\n<p>You've argued that the incomes of the poor are understated, but I think the incomes of the rich are also understated. As an inhabitant of a rich country, you get to consume lots of extra public goods that aren't fully included in the post-tax income figures in these data-sets e.g. safety, clean air, beautiful buildings, being surrounded by lots of educated people. You wouldn't get as many of these in a poor community in a poor country, so this is a way in which the global poor are relatively <em>even worse</em> off than the income comparisons suggest.</p>\n<p>Finally, you mention cost of living in another comment as being relevant. Our audience lives in cities where cost of living is higher, making them relatively poorer. However, I think this might be a red herring. Generally, people move to a city to get higher income. If the market is roughly efficient, then the income boost from being in a city should at least offset the increase in cost of living. So it factors out of the equation.</p>\n", "parentCommentId": "GuPg7cg3yEZcRdEfo", "user": {"username": "Benjamin_Todd"}}, {"_id": "AgZQ567puceMK76Zc", "postedAt": "2017-04-12T04:22:43.340Z", "postId": "LaXGf6hZXXqZ7sj5m", "htmlBody": "<blockquote>\n<p>“This is a problem on the level of “this chart was cooked up specifically to favor the intended conclusion....”</p>\n</blockquote>\n<p>Actually, our incentives were the precise reverse when this data was being put together. These figures first appeared in the ‘How Rich Are You Calculator’. In that context we took people who <em>knew</em> their income, and told them what percentage of households they were richer than. It would have been in our interests to include the <em>lowest</em> income numbers possible for the richest folks in the world, in order to inflate what global income percentile people stood at.</p>\n<p>That could have been achieved by going with PovcalNet’s numbers the whole way. Had we been lazy we could have done this more easily than what we did do, as these numbers were already public. We could have then claimed that an individual earning $36,500 is richer than 99.85% of the world! But this is quite wrong. PovcalNet is designed to be reliable for lower incomes, as part of the World Bank’s attempt to measure poverty and economic development around the world. It progressively understates the incomes of people at the top of the income distribution as they aren’t well sampled; hence the need for Milanović’s alternative numbers for that group.</p>\n<p>GWWC used Milanović’s numbers for as much of the distribution as he gave us data for (i.e. it did not exercise discretion about where to switch).</p>\n<p>Unfortunately, I was not working at GWWC when the two datasets were combined, so I wouldn’t want to comment on how that was done. Any new chart should document how things like that are performed (and mine will).</p>\n<p>The most material problem as I see it is that PovcalNet and other measures of poverty usually measure <em>consumption</em> (to ensure inclusion of e.g. growing your own food or foraging for free things), while figures for people in developed countries measure <em>income</em> (as that’s what people know and it can be found in on tax records, while most households don’t know their net consumption in any given year). The effect on the shape should be modest:</p>\n<ul>\n<li>Most people on the graph, which caps out at $100k, are not being among the super-rich, which means they will consume most of their lifetime income before they die. The US personal household savings rate is a measly 6%, suggesting pretty small adjustments.</li>\n<li>A large fraction of people at the bottom of the distribution are not in a position to accumulate significant financial assets - most ‘savings’ will come in the form of consumer durables (e.g. bricks or a roof on a house) that will be picked up as consumption. Furthermore using consumption inflates the income of the poor relative to the rich because it includes things received for free that wouldn’t be included in income measures for people in the developing world.</li>\n</ul>\n<p>Nonetheless, I think this does bias the graph towards showing higher inequality. I’m not yet sure how I'll fix this, as I don’t know of reliable figures across the whole distribution that use only one of these measures, or figures of net savings as a percent of income across the income distribution, which could be used to fix the discrepancy. I’m open to ideas or new data sources if anyone has one. In the absence of that we’ll just have to continue explaining this weakness of the method.</p>\n<p>I’m looking forward to improving this as far as I can, but I suspect that it won’t change the big picture very much.</p>\n", "parentCommentId": "DfGvAxdfNpgCfYpmZ", "user": {"username": "Robert_Wiblin"}}, {"_id": "wDfLRcgdDCLFSixbk", "postedAt": "2017-04-12T04:44:44.496Z", "postId": "LaXGf6hZXXqZ7sj5m", "htmlBody": "<p>I'm glad I was mistaken about at least part of this - if the stitching-together was originally meant to avoid overstating what percentile someone was in, and originally intended for point estimates rather than to illustrate a trend, then that seems pretty reasonable.</p>\n<p>In that context (which I didn't have, and I hope it's clear to you how without that context I'd have drawn the opposite conclusion), using the existing stitched-together data to make a chart seems like a neutral error, the sort of thing someone does because that's the dataset they happen to have lying around. (Unless, of course, someone would have been more likely to notice and flag a chart with a suppressed trend than a chart with an exaggerated one. That sort of bias is very hard to overcome.)</p>\n<p>This is why things like keeping track of sources are so important, though. Without that, a decision intended to make a tool more conservative ended up being used in a graph where it could be expected to exaggerate a trend, and no one seems to have noticed until you went digging (for which, again, thank you). I'm glad you intend to do better with your version.</p>\n", "parentCommentId": "AgZQ567puceMK76Zc", "user": {"username": "BenHoffman"}}, {"_id": "QX6iCqbAGN2AS8hAZ", "postedAt": "2017-04-12T05:35:16.406Z", "postId": "LaXGf6hZXXqZ7sj5m", "htmlBody": "<p>Hi Ben, thanks for retracting the comment.</p>\n<p>The broader concern I share is the risk of data moving from experts to semi-experts to non-experts, with a loss of understanding at each stage. This is basically a ubiquitous problem, and EA is no exception. From looking into this back in 2013 I understand well where these numbers come from, the parts of the analysis that make me most nervous, and what they can and can't show. But I think it's fair to say that there has existed a risk of derivative works being produced by people dabbling in the topic on a tough schedule, and i) losing the full citation, or ii) accidentally presenting the numbers in a misleading way.</p>\n<p>A classic case of this playing out at the moment is the confusion around GiveWell’s estimated 'cost per life saved' for AMF, vs the new 'cost per life saved equivalent'. GiveWell has tried, but research communication is hard. I feel sorry for people who engage in EA advocacy part time as it's very easy for them to get a detail wrong, or have their facts out of date (snap quiz, how probable is each of these in light of the latest research: deworming impacts i) weight, ii) school attendance, iii) incomes later in life?). This stuff should be corrected, but with love, as folks are usually doing their best, and not everyone can be expected to fully understand or keep up with research in effective altruism.</p>\n<p>One valuable thing about this debate has been that it reminds us that people working on communicating ideas need to speak with the experts who are aware of the details and stress about getting things as accurate as they can be in practice. Ideally one individual should become the point-person who truly understands any complex data source (and gets replaced when staff move on).</p>\n", "parentCommentId": "wDfLRcgdDCLFSixbk", "user": {"username": "Robert_Wiblin"}}, {"_id": "BZjyHkKJ94vjonYdS", "postedAt": "2017-04-12T06:18:16.354Z", "postId": "LaXGf6hZXXqZ7sj5m", "htmlBody": "<p>Here are some other thoughts off the top of my head. As I see it there are different points this figure could be used to support:</p>\n<p>i) The social impact of someone earning, e.g. $100k a year, is potentially quite large, as they are earning more than the global average, making them unusually powerful.</p>\n<p>ii) It's high-impact to help people in the developing world because many people are so very poor.</p>\n<p>iii) This high level of inequality is an indication of a deep injustice in the economic system that needs to be resolved.</p>\n<p>It seems like some folks are particularly worried about the graph being used to support the third point. But I can't actually recall anyone in EA circles using it to make that case (though I think one could try). Our workshop notes that some in the audience may see things that way, but then works to remain neutral on the topic as it would be a big debate in itself.</p>\n<p>Point i) seems best measured by someone's disposable income as a fraction of total global disposable income, or at least the average global disposable income.</p>\n<p>Point ii) is best made by the ratio of the income of our hypothetical donor to that of someone at the 10th percentile (e.g. or whatever income percentile is the beneficiary of marginal work by GiveDirectly or AMF). Despite outstanding income growth in the middle of the distribution, IIRC the 10th percentile's income hasn't risen much at all. It remains around the minimum subsistence level. With graduate incomes rising in the US, this ratio has probably <em>increased</em> since 2008. Whether this ratio is 30, 100 or 300 is one factor relevant to how good the opportunities look in poverty reduction as a cause relatively to others (what the ratio is and how much that matters is discussed in the_jaded_one's thread). We turn to this ratio later in our career guide, and recently did a fact check on the incomes of GiveDirectly recipients.</p>\n<p>Interestingly, the ratio of a reader’s income to the global median doesn’t seem the best measure for any of these purposes.</p>\n", "parentCommentId": "wDfLRcgdDCLFSixbk", "user": {"username": "Robert_Wiblin"}}, {"_id": "KKTnbt5fdS9oMgizQ", "postedAt": "2017-04-15T20:08:16.857Z", "postId": "LaXGf6hZXXqZ7sj5m", "htmlBody": "<p>What are the answers to the snap quiz btw?</p>\n", "parentCommentId": "QX6iCqbAGN2AS8hAZ", "user": {"username": "michaelchen"}}, {"_id": "M2CD4hkrtWMiCHyQe", "postedAt": "2017-04-16T12:40:24.973Z", "postId": "LaXGf6hZXXqZ7sj5m", "htmlBody": "<p>Was this intended as a response to my comment? I didn't bring up the $70k figure or the $200k figure. I did take up one part of your argument (the 'minimum standards' part) and try to explain why I don't think using a $2k - $5k minimum as equivalent to the median Indian actually makes sense.</p>\n<blockquote>\n<p>Advantage of the &quot;bailey&quot;: makes people feel extremely guilty and more likely to donate money or sign the pledge.</p>\n</blockquote>\n<p>FWIW I doubt this is actually true. I have generally strongly preferred to understate people's relative income rather than overstate it when 'selling' the pledge, because it shrinks the inferential distance.</p>\n", "parentCommentId": "3P5TTFcw6xdWfPeqx", "user": {"username": "AGB"}}, {"_id": "YnFGKvRBz3WP2qgDS", "postedAt": "2017-04-17T19:36:25.241Z", "postId": "LaXGf6hZXXqZ7sj5m", "htmlBody": "<p>The nature of the correction, I think, is that I underestimated how much individual caution there was in coming up with the original numbers. I was suggesting some amount of individual motivated cognition in generating the stitched-together dataset in the first place, and that's what I think I was wrong about.</p>\n<p>I still think that:</p>\n<p>(1) The stitching-together represents a big problem and not a minor one. This is because it's basically impossible to &quot;sanity check&quot; charts like this without introducing some selection bias. Each step away from the original source compounds this problem. Hugging the source data as tightly as you can and keeping track of the methodology is really the only way to fight this. Otherwise, even if there is no individual intent to mislead, we end up passing information through a long series of biased filters, and thus mainly flattering our preconceptions.</p>\n<p>I can see the appeal of introducing individual human gatekeepers into the picture, but that comes with a pretty bad bottlenecking problem, and substitutes the bias of a single individual for the bias of the system. Having experts is great, but the point of sharing a chart is to give other people access to the underlyling information in away that's intuitive to interpret. Robin Hanson's <a href=\"http://www.overcomingbias.com/2016/12/chip-away-at-hard-problems.html\">post</a> on academic vs amateur methods puts the case for this pretty clearly:</p>\n<blockquote>\n<p>A key tradeoff in our methods is between ease and directness on the one hand, and robustness and rigor on the other. [...] When you need to make an immediate decision fast, direct easy methods look great. But when many varied people want to share an analysis process over a longer time period, more robust rigorous methods start to look better. Easy direct easy methods tend to be more uncertain and context dependent, and so don’t aggregate as well. Distant others find it harder to understand your claims and reasoning, and to judge their reliability. So distant others tend more to redo such analysis themselves rather than building on your analysis. [...]</p>\n</blockquote>\n<blockquote>\n<p>You might think their added freedom would result in amateurs contributing proportionally more to intellectual progress, but in fact they contribute less. Yes, amateurs can and do make more initial progress when new topics arise suddenly far from topics where established expert institutions have specialized. But then over time amateurs blow their lead by focusing less and relying on easier more direct methods. They rely more on informal conversation as analysis method, they prefer personal connections over open competitions in choosing people, and they rely more on a perceived consensus among a smaller group of fellow enthusiasts. As a result, their contributions just don’t appeal as widely or as long.</p>\n</blockquote>\n<p>GiveWell is a great example of an organization that keeps track of sources so that people who are interested can figure out how they got their numbers.</p>\n<p>(2) It's weird and a little sketchy that there's not a discontinuity around 80%. This could easily be attributable to Milanovic rather than CEA, but I still think it's a problem that that wasn't caught, or - if there turns out to be a good explanation - documented.</p>\n<p>(3) It's entirely appropriate to hold CEA's CEO (the one who used this chart at the start of the controversy you're responding to by adding helpful information) to be held to a much higher standard than some amateur or part-time EA advocate who got excited about the implications of the chart. For this reason, while I think you're right that it's hard to avoid amateurs introducing large errors and substantial bias by oversimplifying things, that doesn't seem all that relevant to the case that started this.</p>\n", "parentCommentId": "QX6iCqbAGN2AS8hAZ", "user": {"username": "BenHoffman"}}, {"_id": "6dFpQXFmm6hnhrXHL", "postedAt": "2017-04-26T15:37:54.804Z", "postId": "LaXGf6hZXXqZ7sj5m", "htmlBody": "<blockquote>\n<p>I didn't bring up the $70k figure or the $200k figure</p>\n</blockquote>\n<p>that may be true, but they are figures that have been brought up</p>\n<blockquote>\n<p>FWIW I doubt this is actually true.</p>\n</blockquote>\n<p>Maybe. But the promotional materials certainly seem to frame it that way. </p>\n", "parentCommentId": "M2CD4hkrtWMiCHyQe", "user": {"username": "the_jaded_one"}}, {"_id": "NEGvKuNSeNErymGBp", "postedAt": "2017-04-26T15:57:19.054Z", "postId": "LaXGf6hZXXqZ7sj5m", "htmlBody": "<p>I think that on £1.53/day you could easily die, depending on your location (esp. cold locations). No food in the bins for a while, police evict you from your tent or <a href=\"http://www.ebaumsworld.com/videos/police-destroy-homeless-mans-shack-while-he-watches/84247120/\">destroy your shelter</a>, you get drenched with water and then really cold, you get an injury or infection. </p>\n<p>Are these kind of things (dying from exposure or hunger, police bulldoze your house) actually happening all the time to the <em>median</em> person in India at $700? I don't think so. I don't imagine it's easy to be the median average Indian, but I expect that you would have a shack, and food, and not freeze to death. </p>\n<p>Also, there is a larger issue here. Being &quot;100 times richer&quot; than someone hides a lot of important assumptions. Let me grant the point that I could survive as a barely-alive hobo for £1.53/day. Well, that existence is not compatible with having a job in the west. There are amounts of money that I have to spend whether I like it or not, if I am to continue to earn any money at all, let alone my current salary. Others have argued that that restriction is irrelevant since it isn't binding, but actually I would quite like the option to live in a really small room in sharing facilities with 4 people if it was 4x cheaper. The option just isn't on the market.  I am looking for accommodation right now, and plenty of people want to sell me 50m^2 for $1000/month with a 3 month penalty clause ($3000!) if I want to leave in less than 3 years, but no-one is selling 12m^2 for $250/month. In fact, the government in my country (western Europe) has passed laws that prevent me from living in a student house (closer to what I want to pay), because I am not a student; they have deliberately split the housing market into two and made people with jobs ineligible for the cheaper half. I would like to pay insurance that only paid out to a maximum of $1000 because that is all my car is worth, but other people on the roads drive $50000 cars and that impacts my premium.  Then there's the social aspect of wealth. If I lived with the same quality of stuff that an Indian person at the 75th percentile of wealth in India lived on, and took a girl back to my shack, she would urgently have something else to do; whereas I can imagine a female from the 50th percentile in pretty much any place being impressed by a male from the 75th percentile. </p>\n<p>With all these things in mind, I would say that I am not 100 times richer than a guy in India earning $700. If I were earning $70,000 <strong>IN INDIA</strong>, I would say it would be closer to the truth (though some of the same problems would apply, especially having to spend money to hold down a white collar job). For starters, I could easily afford a servant or three on that kind of money in India, which paints a picture that is more intuitively commensurate with the factor of 100 that the numbers imply. </p>\n<p>Anyway, thanks for responding, I realize your time is valuable!</p>\n", "parentCommentId": "BKhWCWqgmStFbSvnh", "user": {"username": "the_jaded_one"}}, {"_id": "mq22bbrgYr3cka8hd", "postedAt": "2017-04-26T17:27:42.917Z", "postId": "LaXGf6hZXXqZ7sj5m", "htmlBody": "<blockquote>\n<p>it would indeed be harder to live in the west on $2/day, because the low-quality goods that the global poor use are not available to buy. I think the relevant comparison is more like &quot;if there were lots of people living on $2/day in the west, what quality of living would you get?&quot;. It's artificial to imagine one person living in extreme poverty without a market and community around them.</p>\n</blockquote>\n<p>OK, so maybe appeals to donate money based on factors of <strong>100</strong> wealth difference should be limited to people who actually have a third-world price/quality market for (food, accommodation, shelter) available to them. Hmmmm OK that would be no-one at all. </p>\n<p>Then we come to this: </p>\n<blockquote>\n<p>You could, of course, doubt the existing estimates. My general policy is to go with the expert view when it comes to issues that have been thoroughly researched, </p>\n</blockquote>\n<p>...</p>\n<blockquote>\n<p>The PPP adjustments are meant as a hypothetical &quot;what you could buy on $2 per day if the same goods were sold in stores, or if there were lots of other poor people in the country&quot;.</p>\n</blockquote>\n<p>So they've thoroughly researched a question which is completely different than the one I care about, which is what I can <em>actually</em> buy and do. </p>\n<blockquote>\n<p>As an inhabitant of a rich country, you get to consume lots of extra public goods that aren't fully included in the post-tax income figures in these data-sets e.g. safety, clean air, beautiful buildings, being surrounded by lots of educated people. </p>\n</blockquote>\n<p>But these things are mostly not worth the massive amount of tax money I have to pay. And that's partly because that tax money is not being spent on me, (I have looked at government spending and the part of the pie that is spent on &quot;things that childless healthy 30 year-olds want&quot; is extremely small.), partly because taxation is progressive so punishes people who earn well, and partly because others in the west have different preferences about how much to spend reducing various risks (such as the risk of a $50,000 car being damaged in a collision with my $1000 old banger). </p>\n<p>I would contend that I am not (on $60k) 100 times richer than the average Indian, at least not in the same way that someone on $6M is 100 times richer than me; the way that they really can buy my entire life 90 times over and still be way better off than me. </p>\n<p>Anyway, thanks for responding to me, \nbest regards, \nJaded.</p>\n", "parentCommentId": "JsBXBop7CtLJMMvzD", "user": {"username": "the_jaded_one"}}, {"_id": "pZtKYkoCAHAstiAk5", "postedAt": "2017-04-27T05:37:21.482Z", "postId": "LaXGf6hZXXqZ7sj5m", "htmlBody": "<blockquote>\n<p>OK, so maybe appeals to donate money based on factors of 100 wealth difference should be limited to people who actually have a third-world price/quality market for (food, accommodation, shelter) available to them. Hmmmm OK that would be no-one at all.</p>\n</blockquote>\n<p>I agree that makes sense given one interpretation of the claim. But that definition also has some odd implications. Why does the actual option need to be available to you, even if you're never going to take it?</p>\n<p>If a shanty town opens down the road from me, giving me the option to live like the global poor, I become richer relative to my neighbors, but I don't become richer in absolute terms. The reason the super cheap goods the global poor buy don't exist in the West is because no-one wants them. Even if a shanty town opened, I'd buy the same stuff as before, so my quality of life would be exactly the same. Your definition, however, would say I've become ~10x richer, which seems odd.</p>\n<p>I think both senses of the term are relevant and interesting. Personally, I find the sense used by the World Bank better at capturing what I intuitively think about when comparing living standards and income. But it's useful to consider both.</p>\n<p>You also haven't shown that the differences would amount to a factor of 10. Even though the exact goods the global poor would use are not available in the West, there are still <em>very</em> cheap goods available (as in Will's comment).</p>\n<blockquote>\n<p>But these things are mostly not worth the massive amount of tax money I have to pay. </p>\n</blockquote>\n<p>That's a good point - you're likely a net contributor of taxes right now. But many of things I mentioned aren't a result of taxes. There are lots of public goods produced by being around lots of other educated, wealthy people that you benefit from but aren't captured in the income figures, such as lower crime, more beautiful buildings, more opportunities to talk to people like that, lack of sewage on the street and so on.</p>\n<p>Moreover, you're going to get some of those taxes back in the future (and you've benefited from taxes when younger). I think the lifecycle comparison is more relevant. </p>\n<p>Over your life, you're probably not net-losing more than 10-20% of your income, so it's not a big factor in the comparison. We're looking for a 10x difference, not a 10% difference.</p>\n<p>You can also reclaim tax on donations, so if the message if to donate more, arguably we should use pre-tax income instead.</p>\n", "parentCommentId": "mq22bbrgYr3cka8hd", "user": {"username": "Benjamin_Todd"}}, {"_id": "DpJRofAvno22M6vk9", "postedAt": "2017-04-28T08:17:35.731Z", "postId": "LaXGf6hZXXqZ7sj5m", "htmlBody": "<blockquote>\n<p>If a shanty town opens down the road from me, giving me the option to live like the global poor, I become richer relative to my neighbors, but I don't become richer in absolute terms. Even if a shanty town opened, I'd buy the same stuff as before, so my quality of life would be exactly the same.</p>\n</blockquote>\n<p>I think this is incorrect. Right now I am looking for accommodation. The cheapest option I can find (which doesn't have a working washing machine and is a single small room with shared facilities) costs €5400 per year. It would be very useful for me to have the option to live in a room of quality and price at the level of the 75th or 80th percentile in India. Eyeballing the graph above, the 80th percentile in India is on $1500 or so. They can't be paying more than $700 for their accommodation. </p>\n<p>I have to go live in this room - the alternatives are even more expensive, or being homeless and losing my job. </p>\n<p>I agree that the shanty town wouldn't help me - I would stink of feces and quickly lose my job on personal hygiene grounds - but the 50th and 75th and 80th percentiles in India do not live in 'shanty towns'. Or am I completely misinformed here? </p>\n<blockquote>\n<p>The reason the super cheap goods the global poor buy don't exist in the West is because no-one wants them.</p>\n</blockquote>\n<p>that's false - they don't exist because the government bans or taxes them, or because of <a href=\"https://en.wikipedia.org/wiki/Baumol%27s_cost_disease\">cost disease</a>. In almost every relevant category (cars, accommodation, food, household goods), the government bans you from buying the cheap options. </p>\n<p>E.g. </p>\n<ul>\n<li>Bike helmet made in China for $3 but sells for €40. (Compulsory safety testing to ludicrously high standards, tax, overheads)</li>\n<li>Want to buy a second hand toaster? Nope, banned in many countries because it <em>might</em> be hazardous. Pay for a new one, including all the tax and overheads and then when you've finished, throw the old one away.</li>\n<li>Learn to drive in the UK as a new young, male driver)? That'll be £1500 for lessons, plus <a href=\"http://www.telegraph.co.uk/finance/personalfinance/insurance/motorinsurance/11340679/Young-driver-Thatll-cost-6768-car-insurance-is-not-the-only-rising-expense.html\">£3800 for insurance</a> Why? Do people in India or Brazil need to pay that much? You tell me! </li>\n<li>Want to buy a cheap new car like the Tata Nano? <a href=\"https://en.wikipedia.org/wiki/Tata_Nano#European_export\">Nope, your government has banned it</a> because it's 99.999% safe rather than 99.9999% safe. </li>\n<li>Surely a speeding fine will be inconsequential to someone in the top 1% of the global income distribution, because the harm from speeding on a road is a fixed quantity? <a href=\"http://www.telegraph.co.uk/cars/news/speeding-fines-increase-majority-drivers-unaware-changes/\">No, the government wisely decided to make it it scale with your income!</a></li>\n<li>want to buy/rent a very small house/flat/room? <a href=\"https://www.citylab.com/housing/2017/04/why-is-affordable-housing-so-expensive/523707/\">Nope!</a> It has to have a bunch of amenities and features that you don't need, by law. </li>\n<li>Want to buy a simple product like milk at market price? <a href=\"http://www.telegraph.co.uk/comment/telegraph-view/9399667/A-fair-price-for-a-farmers-milk.html\">Nope!</a> The government, media and farming lobby are getting together to make sure that consumers subsidize unprofitable dairy farms. </li>\n</ul>\n<p>I think the key here is that once you have some money, the <strong>government finds many ways to take that money away from you</strong>, and those ways tend to scale as a percentage of your income for people in the range that we are talking about ($1000-$100,000). Being able to afford a place to live has a minimum threshold which depends on the average income in your country. </p>\n<p>If you (in the west) fall behind in this race to make enough money so that once the government has thieved from you at both ends you can still afford a room to live, you end up falling into the homelessness trap which is very hard to escape from and is actually worse than the life of a median person in India. </p>\n", "parentCommentId": "pZtKYkoCAHAstiAk5", "user": {"username": "the_jaded_one"}}, {"_id": "MXW5CyWFELN3T7zz3", "postedAt": "2019-09-24T03:02:31.432Z", "postId": "LaXGf6hZXXqZ7sj5m", "htmlBody": "<p>An interactive chart comparing incomes between and within countries:  </p><p><a href=\"https://income-inequality.info\">https://income-inequality.info</a> </p>", "parentCommentId": null, "user": {"username": "yboris"}}]