[{"_id": "ZXGMSYgZtGxNpybLC", "postedAt": "2023-09-14T12:44:17.254Z", "postId": "Lb2TjSsjpqA8rQ7dP", "htmlBody": "<p><strong>Executive summary</strong>: Based on ML models, publications, patents, talent, investments, and supply chain factors, the United States and its allies seem to have a significant lead in AI development over China.</p><p><strong>Key points</strong>:</p><ol><li>The top AI labs, breakthroughs, and models come from the U.S. and allies. China leads in publications and patents but trails in quality.</li><li>The U.S. invests the most in AI and has more access to top talent.</li><li>The semiconductor supply chain is dominated by the U.S. and allies. Export controls will likely limit China's access.</li><li>Censorship and other factors may hinder AI progress in China.</li><li>Slowing AI progress in the U.S. would likely also slow progress in China, as China relies significantly on research from abroad.</li></ol><p>&nbsp;</p><p><i>This comment was auto-generated by the EA Forum Team. Feel free to point out issues with this summary by replying to the comment, and</i><a href=\"https://forum.effectivealtruism.org/contact\"><i>&nbsp;<u>contact us</u></i></a><i> if you have feedback.</i></p>", "parentCommentId": null, "user": {"username": "SummaryBot"}}, {"_id": "cgQE22KDuG3gxJZe8", "postedAt": "2023-09-14T12:56:02.403Z", "postId": "Lb2TjSsjpqA8rQ7dP", "htmlBody": "<p>Great post! I think this is a valuable introduction to an uncertain and rapidly developing situation.</p><blockquote><p>Taiwan Semiconductor Manufacturing Company (TSMC) is responsible for over 90% of the manufacturing of the most advanced chips; South Korea makes the rest. ASML (based in the Netherlands) is the only company that makes the machinery needed for this process. And Japan controls photolithography, which draws circuit patterns on layers of silicon used in a chip.&nbsp;</p></blockquote><p>This seems a bit off. It seems to imply that ASML makes all or most of the machinery in the manufacturing process, and/or that ASML is the only company in the space. I think it would be more correct to say that ASML is the only company that makes the most advanced photolithography machines, and that photolithography is a key and necessary part of the chip fabrication process. (Other photolithography manufacturers -- Nikon (Japan), Canon (Japan), and SMEE (China) -- cannot produce EUV photolithography machines, and also seem to produce substantially worse machines than ASML of older types. So it is true that ASML is broadly dominant in photolithography as a whole.)</p><p>Similarly, it is misleading/ambiguous to say that Japan controls photolithography -- perhaps the sentence is meant to say that Japan controls some photolithography materials, like photoresists?</p>", "parentCommentId": null, "user": {"username": "Erich_Grunewald"}}, {"_id": "eu9b5shAsMxhcshmG", "postedAt": "2023-09-14T15:52:43.440Z", "postId": "Lb2TjSsjpqA8rQ7dP", "htmlBody": "<p>Thanks for these corrections! You're right. I'll make a few quick edits for now, and try to update it properly later (digging into the CSET report again).&nbsp;</p>", "parentCommentId": "cgQE22KDuG3gxJZe8", "user": {"username": "Lizka"}}, {"_id": "r9WqqXqRfEeboKmf9", "postedAt": "2023-09-14T23:50:24.713Z", "postId": "Lb2TjSsjpqA8rQ7dP", "htmlBody": "<p>I wonder how large the USSRs fission research budget - the total across every institution - was prior to the Trinity test.  My point is that this model is a lagging indicator.  If the Trinity equivalent already happened then you will see a spike of research, a clean out of plagiarized results, and real effort from China.</p>\n<p>There are routes that would allow Chinese labs to match current top Western labs and even proceed forward if they had full nation support.   The obvious routes are espionage- historically this was how the USSR caught up on fission - and RSI.  (Which requires an immense quantity of silicon.  It's as crucial as finding a source of uranium ore that the USSR faced for China to catch up on silicon fabrication if it is possible to do so)</p>\n<p>It's hard to say if Trinity has happened.  Gpt-4 is strong but it's not undeniably capable and it makes frequent errors.   Maybe the next major model will be that moment.</p>\n<p>I don't know how much AI slowdown the west can afford, but maybe it should focus on measures that won't lead to a significant deceleration.  For example simply disallowing large interconnected GPU clusters in data centers unregistered with the government would be a start.  Logging the users of the hardware, the source of the funds, their human contact information, and how much compute they are using would be another.</p>\n<p>Requiring better cyber security especially on prototype AI systems is another measure that wouldn't cost much or slow things down but would improve safety.</p>\n", "parentCommentId": null, "user": {"username": "Gerald Monroe"}}, {"_id": "nqWbHtJfWfhu4Rodb", "postedAt": "2023-10-05T09:51:54.843Z", "postId": "Lb2TjSsjpqA8rQ7dP", "htmlBody": "<p>I appreciate posts that provide concise comparative overviews of complex concepts. I have some questions that may seem basic to some, but I'd love to receive answers nonetheless.</p><p>OpenPhil, DeepMind, and Meta are leading labs in AI development, both empirically (e.g., ChatGPT) and financially (in terms of resources). China is known for its ability to replicate existing research rather than creating it. <strong>Given the concerns about AI and AGI development, particularly the risks of extinction, why do these American and British labs continue their AI work without pausing?</strong> Is there external pressure from governments or other nations that might be hostile? I'm trying to understand if there are motivations beyond just capitalizing on AI's current momentum, similar to some scientists during the development of the A-bomb who pursued it for personal fame and scientific curiosity while disregarding risks.</p><p>Additionally, although this may not directly relate to your post, have we considered that the emphasis on AI safety, while creating more jobs in that field, might actually stimulate AI growth and increase the risks of extinction? There's a shared sentiment in the Effective Altruism (EA) community that more people are joining out of interest in AI (safety or otherwise), as it serves as a hub for discussions and funding related to AI. These newcomers might face a dilemma: <strong>Are they willing to work for the greater good, even if it means pausing AI development and potentially affecting their livelihoods?</strong> How committed are they to their values when it comes to reducing job opportunities and growth in their passionate field? I apologize if this isn't the ideal platform for these discussions, but they are infrequently addressed in the forum, and I thought they might relate to the topic of talent in AI.&nbsp;</p><p>Edit : all I do is asking genuine questions and I'm being downvoted to hell. If you disagree with the usefulness of the questions tick the 'I disagree' box(and even that why do care that my question are being answered?), but downvoting me just screams 'I refuse criticism on this topic and such questions should'nt be answered'. Which is not honest nor rational, and I'm quite sure that those who downvoted me pride themselves a great deal of being overly rational.</p>", "parentCommentId": null, "user": {"username": "Vaipan"}}, {"_id": "ECKaTBeoW77KGLiwK", "postedAt": "2023-10-19T14:25:19.760Z", "postId": "Lb2TjSsjpqA8rQ7dP", "htmlBody": "<p>This post might need to be updated as China made a big pace in terms of regulations : <a href=\"https://www.linkedin.com/feed/update/urn:li:activity:7120579820261908480/\">At the third Belt and Road Forum for International Cooperation, President Xi announced the 'Global AI Governance Initiative' (GAIGI) for participating countries of the Belt and Road Initiative (i.e. China’s $1 trillion global infrastructure program).</a></p>", "parentCommentId": null, "user": {"username": "Vaipan"}}]