[{"_id": "6DfGjebrgCL93EASC", "postedAt": "2022-12-20T02:03:18.877Z", "postId": "LCagfA2uS7idsLfoN", "htmlBody": "<p>I agree with this post.&nbsp;<br><br>When tracking diversity, nationality or (family) income seems much more relevant than e.g. gender or skin colour. Depending on purpose, we might want to lump together nationality into fewer categories, and in this case, an in this case the LMICs vs HICs seem like a good categorisation.</p><p>Western vs non-Western probably should be fleshed out with more categories, but I don't know which.<br><br>English speaking vs non-English speaking is a tricky one. It makes sense as a inclusivity metric since almost all EA communication (including EA Forum) is in English. But I'm not sure where to draw the line. For example, I would want to classify Sweden (my home country) as \"an English speaking country\". Technically English is &nbsp;second language, but I'm fluent enough for it not to be any hindrance, and the same is true for practically every Swede of my generation. I think the same is true for many other small western European countries.</p>", "parentCommentId": null, "user": {"username": "Linda Linsefors"}}, {"_id": "w2kh6g6fqepxgBAGX", "postedAt": "2022-12-29T03:45:28.948Z", "postId": "LCagfA2uS7idsLfoN", "htmlBody": "<p>Thanks for writing this up! Some rough thoughts about the LMIC category:</p><p>1. I think the LMIC is a pretty useful category insofar as it's used as \"non-high-income-countries\".&nbsp;</p><p>2. Otherwise, I worry that folks might conflate with LMICs as just \"low income countries\", when <a href=\"https://en.wikipedia.org/wiki/Developing_country#/media/File:IMF_advanced_economies_and_UN_least_developed_countries.svg\">most countries in the LMIC category are lower to upper middle income (or developing)</a>.&nbsp;</p><p>3. I have a light preference for separating LMICs into two categories: \"<a href=\"https://en.wikipedia.org/wiki/Least_developed_countries\">least developed countries</a>\" and \"middle income countries\".&nbsp;</p>", "parentCommentId": null, "user": {"username": "yiyang"}}]