[{"_id": "tEbaj2m6z8Nrncdaz", "postedAt": "2023-10-30T20:23:50.243Z", "postId": "LCfd56cBeRzrMiAhw", "htmlBody": "<p>No chance there's a ~10 word summary of the executive summary? I'm interested but pretty sleep-deprived/jetlagged and found it hard to interpret the table.</p>\n", "parentCommentId": null, "user": {"username": "DanielFilan"}}, {"_id": "NuticoyubdxQqWr3X", "postedAt": "2023-10-30T21:31:22.437Z", "postId": "LCfd56cBeRzrMiAhw", "htmlBody": "<p>These were the 3 snippets I was most interested in</p><p><strong>Under pure risk-neutrality, whether an existential risk intervention can reduce more than 1.5 basis points per billion dollars spent determines whether the existential risk intervention is an order of magnitude better than the Against Malaria Foundation (AMF).&nbsp;</strong></p><p><strong>If you use welfare ranges that are close to Rethink Priorities’ estimates, then only the most implausible existential risk intervention is estimated to be an order of magnitude more cost-effective than cage-free campaigns and the hypothetical shrimp welfare intervention that treats ammonia concentrations.&nbsp;All other existential risk interventions are competitive with or an order of magnitude less cost-effective than these high-impact animal interventions.&nbsp;</strong></p><p><strong>Even if you think that Rethink Priorities’ welfare ranges are far too high, many of the plausible existential risk interventions are not an order of magnitude more cost-effective than the hypothetical ammonia-treating shrimp welfare intervention or cage-free campaigns.&nbsp;</strong></p>", "parentCommentId": "tEbaj2m6z8Nrncdaz", "user": {"username": "elifland"}}, {"_id": "4upchhRmbLYtPcGxq", "postedAt": "2023-10-30T21:45:55.080Z", "postId": "LCfd56cBeRzrMiAhw", "htmlBody": "<p>Thanks!</p>\n", "parentCommentId": "NuticoyubdxQqWr3X", "user": {"username": "DanielFilan"}}, {"_id": "adj7iQ2nqoJpXXNHH", "postedAt": "2023-11-09T10:42:48.017Z", "postId": "LCfd56cBeRzrMiAhw", "htmlBody": "<p>Great post, Laura!</p><blockquote><p>The cost-effectiveness models include only first-order effects of spending on each cause. It’s likely that there are interactions between causes and/or positive and negative externalities to spending on each intervention.</p></blockquote><p>I think this is an important point. The <a href=\"https://forum.effectivealtruism.org/topics/meat-eater-problem\">meat-eater problem</a> may well imply that live-saving interventions are harmful. I estimated it reduces the cost-effectiveness of <a href=\"https://www.givewell.org/charities/top-charities\">GiveWell's top charities</a> by <a href=\"https://forum.effectivealtruism.org/posts/vBcT7i7AkNJ6u9BcQ/prioritising-animal-welfare-over-global-health-and#Farmed_animals\">22.4 %</a> based on the suffering linked to the current consumption of poultry in the countries targeted by GiveWell, adjusted upwards to include the suffering caused by other farmed animals. On the one hand, the cost-effectiveness reduction may be lower due to animals in low income countries generally having better lives than broilers in a reformed scenario. On the other, the cost-effectiveness reduction may be higher due to future increases in the consumption of farmed animals in the countries targeted by GiveWell. I estimated the suffering of farmed animals globally is <a href=\"https://forum.effectivealtruism.org/posts/ayxasxhHWTvf6r5BF/scale-of-the-welfare-of-various-animal-populations\">12.0</a> the happiness of humans globally, which suggests saving a random human life leads to a nearterm reduction in suffering.</p><p>Has the WIT considered analysing under which conditions saving lives is robustly good after accounting for effects on farmed animals? This would involve forecasting the consumption and conditions of farmed animals (e.g. in the countries targeted by GiveWell). Saving lives would tend to be better in countries whose peak and subsequent decline of the consumption of factory-farmed crayfish, crabs, lobsters, fish, chicken and shrimp happened sooner, or in countries which are predicted to have good conditions for these animals (which <a href=\"https://forum.effectivealtruism.org/posts/ayxasxhHWTvf6r5BF/scale-of-the-welfare-of-various-animal-populations\">I guess</a> account for most of the suffering of farmed animals).</p><p>Ideally, one would also account for effects on wild animals. I <a href=\"https://forum.effectivealtruism.org/posts/vBcT7i7AkNJ6u9BcQ/prioritising-animal-welfare-over-global-health-and#Wild_animals\">think</a> these may well be the major driver of the changes in welfare caused by GiveWell's top charities, but they are harder to analyse due to the huge undercainty involved in assessing the welfare of wild animals.</p>", "parentCommentId": null, "user": {"username": "vascoamaralgrilo"}}, {"_id": "rPHLYLXCbF3WbtGAF", "postedAt": "2023-11-19T13:14:40.108Z", "postId": "LCfd56cBeRzrMiAhw", "htmlBody": "<p>(Meta thought, not sure who this should be addressed to)</p>\n<p>Is it worth making a Forum tag to the effect of \"X-risk without longtermism\"? There are quite a few posts on the Forum to this effect now, and it'd be handy to be able to find or link to them all in one place!</p>\n", "parentCommentId": null, "user": {"username": "Jamie_Harris"}}, {"_id": "FE8DmoKSYaXoPE87q", "postedAt": "2023-11-19T19:51:05.629Z", "postId": "LCfd56cBeRzrMiAhw", "htmlBody": "<p>Global catastrophic risks might already do the job.</p>\n", "parentCommentId": "rPHLYLXCbF3WbtGAF", "user": {"username": "MichaelStJules"}}, {"_id": "tB7eYKFPKyuTqQsHm", "postedAt": "2023-11-20T14:48:47.881Z", "postId": "LCfd56cBeRzrMiAhw", "htmlBody": "<p>Definitely overlap, although that seems broader and things aren't being listed there in practice. E.g. <a href=\"https://forum.effectivealtruism.org/posts/rFpfW2ndHSX7ERWLH/simplify-ea-pitches-to-holy-shit-x-risk\">these</a> <a href=\"https://forum.effectivealtruism.org/posts/cP7gkDFxgJqHDGdfJ/ea-and-longtermism-not-a-crux-for-saving-the-world\">posts</a> were examples of the sort of thing I was thinking of, and weren't tagged there.</p>", "parentCommentId": "FE8DmoKSYaXoPE87q", "user": {"username": "Jamie_Harris"}}]