[{"_id": "rrwotAvx53K9inrhW", "postedAt": "2023-02-27T15:22:42.052Z", "postId": "LDiStRpF2HSvbgPks", "htmlBody": "<p>To continue the metaphor, suppose EA is the dairy industry, and realizes markedly higher profits (impact) the weirder up the dairy ladder a consumer goes (e.g., makes 5x as much from a cheddar consumer as milk, 5x as much from a bleu consumer than a cheddar one, etc.).</p>\n<p>What does the extended metaphor suggest about how to market to maximize profit/impact? Obviously you want to make milk, cheddar, bleu, and casu marzu customers feel like welcome members of the dairy empire. Given that the potential market size substantially diminishes as you step up the weird-dairy latter, and the cost of customer acquisition increases, how much of your marketing resources will be spent on promoting each type of dairy?</p>\n<p>My guess is that the EA ecosystem under-emphasizes acquiring new cheddar consumers, but I could easily be wrong. My theory is that that the potential market for cheddar is still very large, and that most conversions to bleu will come from the cheddar crowd anyway.</p>\n", "parentCommentId": null, "user": {"username": "Jason"}}, {"_id": "wrTBPLKdyJeSupzxu", "postedAt": "2023-02-27T15:53:55.270Z", "postId": "LDiStRpF2HSvbgPks", "htmlBody": "<p>On FB someone replied:</p>\n<blockquote>\n<p>cheese made out of live maggots sounds not only very weird but also bad and possibly unethical? so i don't love this comparison; i assume you think even the very weird ea stuff is fundamentally good and ethical, even if you might disagree that it's the highest priority good and ethical thing to focus on.</p>\n</blockquote>\n<p>My response was that work you thought was positive on the basis of complicated reasoning is unusually likely to turn out to be negative for reasons you missed, and this is a real risk of trying to go so far from well-explored territory. So I'll endorse this aspect of the metaphor.</p>\n<p>[EDIT: also see <a href=\"https://forum.effectivealtruism.org/posts/DJTpSNbNfCqKzc7ja/counterproductive-altruism-the-other-heavy-tail\">Counterproductive Altruism: The Other Heavy Tail</a>]</p>\n", "parentCommentId": null, "user": {"username": "Jeff_Kaufman"}}, {"_id": "YBxEi55WdnGmNus6v", "postedAt": "2023-02-27T16:07:44.135Z", "postId": "LDiStRpF2HSvbgPks", "htmlBody": "<p>I'm not sure the metaphor holds up.</p><p>I imagine there are many more people interested in AI Safety, Biosecurity, Nuclear Risks who would be put off if they had to start by learning about the GWWC pledge.</p><p><a href=\"https://80000hours.org/podcast/episodes/kelsey-piper-important-advocacy-in-journalism/\">Kelsey Piper</a> &nbsp;writing about Vox analytics - 'Global poverty stuff doesn’t do very well. This is something that makes me very sad, and it makes my mother very sad. She reads all my articles, and she’s like, “The global poverty stuff is the best, you should do more of that.” I also would love to do more of that. I think it’s a really important topic, but it doesn’t get nearly as many views or as much attention as both the existential risk stuff and sort of the animal stuff and the weird big ideas sort of content.'</p>", "parentCommentId": "rrwotAvx53K9inrhW", "user": {"username": "DavidNash"}}, {"_id": "YEYWTcwFe2dfGbtWx", "postedAt": "2023-02-27T16:28:28.314Z", "postId": "LDiStRpF2HSvbgPks", "htmlBody": "<p>I think you're maybe treating the \"clearly good\" / mild end of this spectrum as being specific to global poverty?  But I think there's a lot of x-risk work that's towards this end too: reducing the risk of nuclear war, reducing airborne pathogen spread, etc.</p>\n<p>But with Jason's extension of the metaphor, I also think maybe Kelsey's audience on Vox wants to be challenged a bit, and the clearly-good stuff is less interesting.  But that doesn't mean hitting them with the weirdest ideas anyone within EA is playing with is going to work well!  You still need to match your offering to your audience, and balance wanting to introduce stranger things against not overwhelming them with something too different.</p>\n", "parentCommentId": "YBxEi55WdnGmNus6v", "user": {"username": "Jeff_Kaufman"}}, {"_id": "pcf4dH3GroubXJnrm", "postedAt": "2023-02-27T16:51:01.225Z", "postId": "LDiStRpF2HSvbgPks", "htmlBody": "<p>Fair point (although Vox's readers may not be representative of all or even most audiences, and pageviews may be only loosely correlated with willingness to commit. I find many things interesting to read and even write about that I wouldnt devote my career or serious money to.).</p>\n<p>Maybe it's not true of all potential cause areas, but I think most of them have a range of options from cheddar to maggot cheese. So cheddar does not necessarily imply global health, and maggots don't necessarily imply x-risk.</p>\n", "parentCommentId": "YBxEi55WdnGmNus6v", "user": {"username": "Jason"}}, {"_id": "CucLHR4LWNzhccKJb", "postedAt": "2023-02-27T17:46:48.098Z", "postId": "LDiStRpF2HSvbgPks", "htmlBody": "<p>I think every cause can be presented normally/weirdly depending on how you do it, it was just in that example Kelsey was discussing global dev and I think a lot of people in EA assume that more people are interested in global development as they are just looking outside their bubble into a slightly larger bubble.</p><p>I would agree that it's usually best to introduce people to ideas closer to their interests (in any cause area) before moving onto related ones. Although sometimes they'll be more interested in the 'weird' ideas before getting involved in EA, and EA helps them approach it practically. &nbsp;</p>", "parentCommentId": "YEYWTcwFe2dfGbtWx", "user": {"username": "DavidNash"}}, {"_id": "BFw8TmN2gWxe5KGzq", "postedAt": "2023-02-28T00:43:33.160Z", "postId": "LDiStRpF2HSvbgPks", "htmlBody": "<p>I still think it works for some causes. I met people who thought it wasn't just bad, but <i>evil </i>to do wild animal welfare stuff. I'm not sure why, maybe their introduction to the idea was about predator euthanasia or something.</p>", "parentCommentId": "wrTBPLKdyJeSupzxu", "user": {"username": "SamiM"}}, {"_id": "HKPw2SfEj6t9LSccE", "postedAt": "2023-02-28T21:24:13.459Z", "postId": "LDiStRpF2HSvbgPks", "htmlBody": "<p>Yeah my personal intro to EA is generally pretty aversive. This is weird and you might not like it. Rather than bednets. The people who push through that I think are happy to be in a weird movement, but I wouldn't want people to be blindsided.</p>", "parentCommentId": null, "user": {"username": "nathan"}}, {"_id": "KJgrau3RHprr7erxg", "postedAt": "2023-03-03T20:46:43.862Z", "postId": "LDiStRpF2HSvbgPks", "htmlBody": "<p>I found it surprising that you described cash transfers as \"milk\" and bednets, vaccines and avoiding nuclear war as \"cheese\".&nbsp;</p><p>In my experience, it's more likely to be the latter category which is, \"to nearly everyone, intuitively and obviously good.\"</p><p>By contrast, I've heard lots of people confidently and knowingly say that cash transfers don't work (because they don't get to the root of the problem, because the poor will waste the money on alcohol, etc)</p>", "parentCommentId": null, "user": {"username": "Sanjay"}}, {"_id": "w7PFeMhcJ4K9b5og5", "postedAt": "2023-03-03T23:14:17.138Z", "postId": "LDiStRpF2HSvbgPks", "htmlBody": "<p>I interpret those criticisms of cash transfers as people saying they think you can do more good other ways, not that poor people having more money is neutral or harmful?</p>\n<p>For the ones I described as mild cheeses, the idea is there's a little background knowledge required before you can see that the work is valuable, but people tend to already have that background.</p>\n<p>One way to get at this is to look at what you see in world religions around charity: there's a lot about giving to the poor and not much about more complex ways of trying to make the world better.</p>\n", "parentCommentId": "KJgrau3RHprr7erxg", "user": {"username": "Jeff_Kaufman"}}, {"_id": "8McM9oCTJ4wsrqQac", "postedAt": "2023-03-07T02:05:18.010Z", "postId": "LDiStRpF2HSvbgPks", "htmlBody": "<p>Actually I think the popular concept is that cash transfers are neutral or harmful. That's one reason why there was no charity like GiveDirectly until ~15 years ago, and arguably GiveDirectly would not exist today without funding from EA sources. The earliest news coverage I could find about GiveDirectly is not until 2011 (<a href=\"https://business.time.com/2011/08/03/givedirectly-a-charity-that-just-gives-money-to-poor-people-so-theyre-not-so-poor/\">Time</a>/<a href=\"https://www.npr.org/sections/money/2011/08/02/138920991/charitys-mission-give-money-to-poor-people\">NPR</a>/<a href=\"http://archive.boston.com/bostonglobe/ideas/brainiac/2011/07/is_cash_the_bes.html\">Boston.com</a>) and two of those pieces described it as \"radical\".</p>", "parentCommentId": "w7PFeMhcJ4K9b5og5", "user": {"username": "Ian Turner"}}, {"_id": "GFPtJNvuEJrwXmtna", "postedAt": "2023-03-07T02:54:44.433Z", "postId": "LDiStRpF2HSvbgPks", "htmlBody": "<p>Thanks for digging up the early news coverage!</p>\n<p>I interpret the \"radical\" claim in Time and NPR as \"give directly proposes a massive change in how we address poverty\". What about it makes you think it's intended in a \"you would think that this proposal is actually harmful, but it's not\" sort of way?</p>\n<p>Unfortunately all three articles no longer have a comment section, and I couldn't load comments through the Internet Archive. But my memory about the non EA discussion at the time was that it was all \"there's got to be something better you can do\" and not \"this is useless or counterproductive\"?</p>\n", "parentCommentId": "8McM9oCTJ4wsrqQac", "user": {"username": "Jeff_Kaufman"}}, {"_id": "Ag3TufGdb4yYGHLqP", "postedAt": "2023-03-09T05:00:39.742Z", "postId": "LDiStRpF2HSvbgPks", "htmlBody": "<p>In my experience, an extremely common lay objection to GiveDirectly is something along the lines of, \"Won't recipients waste the money on alcohol/drugs/tobacco/luxuries/etc.?\", with a second-tier objection of, \"Won't cash transfers cause inflation/conflict/dependence/etc.?\".</p>\n<p>I think both these questions have been pretty well addressed by the research, but those who are not aware of (or do not trust) that research are, I think, pretty likely to believe that cash transfers are neutral or harmful.</p>\n", "parentCommentId": "GFPtJNvuEJrwXmtna", "user": {"username": "Ian Turner"}}, {"_id": "Xu7BBAt8swYjJxkuP", "postedAt": "2023-03-09T13:19:19.976Z", "postId": "LDiStRpF2HSvbgPks", "htmlBody": "<p>The second objection does sound like saying it is harmful, thanks!</p>\n<p>The first one is more mixed. My interpretation has always been that people were saying they didn't think it was very useful, not that it was harmful: I doubt the person making the objection thinks that all of the money will go to buy luxuries, and if some of the money goes to buy valuable things and some of it goes to buy luxuries that are essentially morally neutral then the effect is less positive than if it all went to buy valuable things. But maybe they think that providing luxuries is actually harmful, and not just neutral? (Which, conditional on thinking they spend lots of the money on drugs and alcohol, it could easily be, since it's funding people to buy addictive drugs they won't be able to continue consuming.)</p>\n", "parentCommentId": "Ag3TufGdb4yYGHLqP", "user": {"username": "Jeff_Kaufman"}}]