[{"_id": "Aq8xYRZSD9MydQZvP", "postedAt": "2024-03-27T01:40:06.797Z", "postId": "LDPiCjh6tcjaaoiZL", "htmlBody": "<p>The <a href=\"https://www.lesswrong.com/posts/xDNyXGCDephBuNF8c/dark-forest-theories\">Dark Forest Problem</a> implies that people centralizing power might face strong incentives to hide, act through proxies, and/or disguise their centralized power as decentralized power. The question is to what extent high-power systems are dark forests vs. the usual quid-pro-quo networks and stable factions.</p><p>Changing technology and applications for power, <a href=\"https://en.wikipedia.org/wiki/COINTELPRO#cite_note-60:~:text=Examples%20of%20surveillance,Supreme%20Court%20Justice.\">starting in the 1960s</a>, implies that factions would not be stable and iterative trust is less reliable, and therefore a dark forest system was more likely to emerge.</p>", "parentCommentId": null, "user": {"username": "trevorw96"}}, {"_id": "hLp9QLpAz97W4jrcY", "postedAt": "2024-03-27T13:18:36.690Z", "postId": "LDPiCjh6tcjaaoiZL", "htmlBody": "<p><strong>Executive summary:</strong> Crises reveal that power is more centralized than it appears during normal times, both within nations and globally, which has implications for thinking about AI risk.</p><p><strong>Key points:</strong></p><ol><li>\"Extrapolation from normalcy\" and \"naive behaviourism\" heuristics lead people to think power is more decentralized than it actually is.</li><li>In crises, governments exert more centralized control nationally, and powerful countries constrain smaller countries globally.</li><li>Even in normal times, less powerful actors often refrain from challenging more powerful ones due to implicit threats or power dynamics.</li><li>Ideology, such as liberal values, is a key reason smaller actors have leeway under normal circumstances.</li><li>If AI progress by companies or foreign actors is seen as a security threat, the US government would likely intervene, revealing the true centralized power structure.</li></ol><p>&nbsp;</p><p>&nbsp;</p><p><i>This comment was auto-generated by the EA Forum Team. Feel free to point out issues with this summary by replying to the comment, and</i><a href=\"https://forum.effectivealtruism.org/contact\"><i>&nbsp;<u>contact us</u></i></a><i> if you have feedback.</i></p>", "parentCommentId": null, "user": {"username": "SummaryBot"}}]