[{"_id": "wD4mEp6W94GKW2aFg", "postedAt": "2022-09-17T15:20:52.716Z", "postId": "LdS8DuExNdAxuckrn", "htmlBody": "<p>Interesting post- since my academic training is heavily in political science (+ stats and CS), I’ve thought about this topic some as well. Disclaimer is that I engage with poli sci research pretty heavily through working in electoral politics/follow broader PS through friends who do other work, but I don’t have a poli sci PhD and don’t have a particular identity as a political scientist.</p>\n<p>A general thought here is that this post is a little hard to engage with because you’re making two related claims at the same-ish time, and not providing particularly concrete  suggested actions specifically related to EA. As I read you, the claims are:</p>\n<ol>\n<li>EAs could benefit from familiarity with the formal modeling literature in those 3 areas. It’d be helpful to have some sense of how you envision these being leveraged.</li>\n<li>Poli Sci programs (it seems especially PhDs, but I’m reading in there) could produce stronger quantitative researchers who are more equipped to handle new developments in quant methods by deepening engagement with 2a) Foundations of Probability Theory 2b) DAG based causal inference. Not sure there’s an EA related claim here as written.</li>\n</ol>\n<p>One thing I’m especially left wondering here is <strong>whether you have a specific claim about how relatively important engaging with these topics is, and for which parts of the EA community that’s true.</strong> For example, how much of a priority should engaging with the gerrymandering literature be, and for which EAs? Where does this fall in the hierarchy of things EAs could spend time learning about versus say, microeconomic quant tools? Hopefully that’s a helpful point in trying to flesh out the case you’re making here (I realize you posted this as “some thoughts”, and not “here is a deeply researched, group reviewed long form piece with deeply felt calls to action”.)</p>\n<p>Moving on to discussing the specific points you make:</p>\n<ol>\n<li>On teaching Pearl more- I broadly agree this is a good idea. The most common educational background on my team at the senior level is a poli sci PhD and I interview a decent number of political science PhDs. It seems many folks know  a little bit about Pearl’s work and those that do benefit from it, but never had DAGs taught deeply and formally. I think there are signs of this changing in some programs (I don’t have the knowledge to make a general discipline level claim), with a move towards teaching both PO and DAG approaches jointly. I certainly benefited from being taught both together, but I got this in a stats department.</li>\n<li>On teaching more probability theory- I believe there are some programs where this is available either directly or through partnership with other departments, and I’m much less confident in a general claim like “all quant poli sci educational programs should teach more of this”. I think the more a prospective students wants and expects to work on methods development, the more this should be emphasized, but I guess my (uncertain) belief right now is deeper education here is available to those who want it, and the discipline does a pretty good job of prioritizing things to teach the average student.</li>\n<li>On gerrymandering research- Your suggestion is roughly a “quiver” of more objective methods. My (non-expert) impression is that there are a number of such available tools proposed, even once you get past the somewhat hamfisted solutions like  shortest splitline that completely ignore the complex and competing demands that legal precedent place on redistricting. My impression is that these tools are already sufficient to be <strong>more fair and objective than current practice</strong>, but that implementing them is a problem of political will and organizing (that’s not to say there isn’t promising research being done to improve solutions). So the challenge here to me is how EAs should choose to spend their time given this dilemma- it’s not clear to me that getting improvements implemented in the US is particularly tractable at the moment, and thus I’d argue likely not suitable as a recommendation for broader work.</li>\n</ol>\n<p>To clearly caveat with my level of knowledge here, my undergraduate thesis was on why fixing gerrymandering is harder than proposing good algorithms, and I learned quite a bit after that from seeing researchers speak at the <a href=\"https://cds.nyu.edu/math-democracy-seminar/\">MaDS</a> seminar series while I was in grad school at NYU. So I have a decent impression, but you may well know more and have a good basis to disagree.</p>\n<p>I’m completely unequipped to respond on the other formal methods ideas you propose, but looping back to the broader response I have to this post, it would be beneficial to have more concrete applications of these ideas for EA, as am well as discussion of how they rank in priorities of things we could learn.</p>\n<p>This is a pretty long response already, so will end by saying that this is definitely a topic I’d be interested in discussing more.</p>\n<p>For example, I could envision trying to seek out specific EA problems that could benefit from recent hot topics in quant poli sci like conjoint experiments (to name one example). Separately, this is a more a intersection of my background (political practitioner) and quant poli sci, but I’ve been pondering wether it’s a good use of time to produce general educational materials on better understanding campaigning effectively and how elections are won- it seems many EAs fall prey to many of the common misconceptions that typical well-educated but not politically experienced people fall into. To the extent there are folks who might try something like another Flynn campaign or try to give effectively in influencing the 2024 cycle, there seem to be some easy wins in providing better mental models.</p>\n", "parentCommentId": null, "user": {"username": "Andy Timm"}}]