[{"_id": "EdKngw5W7m2dM9swL", "postedAt": "2022-11-04T16:27:51.867Z", "postId": "LEDXWzixD56yXsCDp", "htmlBody": "<blockquote><p>But only 2-10% of students who start an intro fellowship end up engaging with EA afterwards;</p></blockquote><p>&nbsp;</p><p>Do you have a source for this? Thank you!</p>", "parentCommentId": null, "user": {"username": "BenSchifman"}}, {"_id": "ATiqgaB4qjvT94ufa", "postedAt": "2022-11-04T18:46:34.303Z", "postId": "LEDXWzixD56yXsCDp", "htmlBody": "<p>This is just based on what Stanford/Harvard organizers have said to me. It depends who you ask and how they define retention but 10% is the number I hear thrown around the most.</p>", "parentCommentId": "EdKngw5W7m2dM9swL", "user": {"username": "Rachel Weinberg"}}, {"_id": "LFcu9EPczsGsrjcu5", "postedAt": "2022-11-05T17:21:39.755Z", "postId": "LEDXWzixD56yXsCDp", "htmlBody": "<p>“There are also strong selection effects on retreat attendees vs. intro fellows”</p>\n<p>I wonder what these selection effects are. I imagine you get a higher proportion of people who think they are very excited about EA. But also, many of the wicked smart, high achieving people I know are quite busy and don’t think they have time for a retreat like this, so I wonder if you’re somewhat selecting against these people?</p>\n<p>Similarly, people who are very thoughtful about opportunity costs and how they spend their time might feel like a commitment like this is too big given that they don’t know much about EA yet and don’t know how much they agree/want to be involved.</p>\n", "parentCommentId": null, "user": {"username": "Aaron_Scher"}}, {"_id": "khqutJfiotFrhpDuu", "postedAt": "2022-11-07T16:16:58.962Z", "postId": "LEDXWzixD56yXsCDp", "htmlBody": "<p>Thanks Rachel. If anyone else reading this has any more data on this point I'd be very interested. I'm helping with the first <a href=\"https://eaforjews.org/fellowship\">EA for Jews intro fellowship</a> and we're thinking about how to assess its impact. &nbsp;If 90-98% of people who do an intro fellowship <i>never</i> engage with EA again afterwards that seems quite strong grounds for rethinking whether we (as a community) should invest in intro fellowships as much as we seem to. And/or if we should experiment much more on different types of intros to see if there is greater impact.</p>", "parentCommentId": "ATiqgaB4qjvT94ufa", "user": {"username": "BenSchifman"}}, {"_id": "b7wFp2XQtbhze2rTt", "postedAt": "2022-11-07T21:51:20.439Z", "postId": "LEDXWzixD56yXsCDp", "htmlBody": "<p>I think there is a lot to learn from this piece and I'm glad you posted it :) I like the idea of bringing EA professionals to speak and for AMAs, especially afterward, to help people realize just how deep they can go. I like the idea of using the venue well to have 2 concurrent workshops or what have you in different rooms, who can mingle during meals and off-hours. It also sounds like you got all the informational stuff out of the way on the first day and thats great, leaving the second for more hands-on stuff. I am also very happy that people didn't have to read intro materials beforehand.&nbsp;<br><br>It does seem really time intensive for organizers though. And money intensive. &nbsp;Have any groups just tried doing daylong things, with no sleepovers/retreat aspect? It would mean renting a much cheaper airbnb for the weekend, with only 2-4 bedrooms (for organizers), but with really nice common areas for everyone during the day, well-located near walking areas and central enough people can drive or uber to twice without a big issue?&nbsp;For students you could offer to subsidize ubers. You can provide snacks, lunch, and dinner. Maybe you do lunch as something simple that can be made in an instapot or the oven (burritos, burgers, vegan chicken tenders), and cater dinner.<br><br>I imagine 2 full saturdays is doable for a lot of people and we have gotten good feedback that people (professionals) would attend &nbsp;a 2 day condensed in-person program. But we havent done an intro course over 2 days yet. Right now we are doing 4 week condensed thing, but we plan to try 2 day as well.</p>", "parentCommentId": null, "user": {"username": "Ivy_Mazzola"}}, {"_id": "evsEZkf6uNqvwzNg8", "postedAt": "2022-11-08T10:22:57.169Z", "postId": "LEDXWzixD56yXsCDp", "htmlBody": "<p>Sorry if this is only tangentially relevant, but I honestly think more courses, discussion groups, and especially virtual programs could benefit from using the <a href=\"https://forum.effectivealtruism.org/groups/MCtKD7oex9jhsAWvD\">EA Gather Town</a> for their sessions. This doesn't suit everyone, of course, but I think there are a lot of people for whom it would be optimal on the margin. I would be happy to help with this in any way I can.<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefkdf1lmzajz\"><sup><a href=\"#fnkdf1lmzajz\">[1]</a></sup></span>&nbsp;Get <a href=\"https://calendly.com/emrik/talking\">in touch</a> if you're interested. : )</p><p>Yellow hosted some unofficial intro course cohorts here, and one of them became &nbsp;a regular coworker, and several others have returned to the space every now and then. (Yellow actually invited the students and hosted the courses on their own initiative, and they made <a href=\"https://forum.effectivealtruism.org/posts/6qL8sqy4pwWS3ZSTn/host-your-ea-fellowship-in-the-ea-gathertown\">a guide</a>! Needless to say, Yellow is pretty awesome.)</p><p>One-off events that people travel to are really great for inspiration, learning seriously, and strong connections. But there are significant obstacles to keeping up those connections after people return home to their daily routines. The environments (locale, incentives, activities) where they made the connections are often very different from their habitual environments &nbsp;where they'd have to find a way to maintain the connections. If they live far apart, they might not be the kind of people who have much bandwidth for communicating online, so the connection fades despite wanting to keep in touch.</p><p>For fostering long-term high-communication connections between EAs, I suspect local or online activities are &nbsp;underexplored. Events that are more specifically optimised for kickstarting a perpetual social activity (e.g. coworking, or regular meetups in a place they can always return to) for those who want it seem more likely to enable people to keep in touch, and EA Gather is great for that. Probably locally hosted activities work too, but I don't know much about them.</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnkdf1lmzajz\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefkdf1lmzajz\">^</a></strong></sup></span><div class=\"footnote-content\"><p>Either me or any of the other <a href=\"https://docs.google.com/document/d/13Kb5umCiub-zepbdHZwQFzz8Z0FqUw42LrAO6_pkxVs/\">stewards</a> could give quick intro tours to newcomers on e.g. how &nbsp;to connect with others via the space, community norms, benefits of coworking, etc. We could also build out or customise the space for what people want to use it for, but we have plenty of space so we might already have what you need for what you want to do.</p></div></li></ol>", "parentCommentId": null, "user": {"username": "Emrik"}}]