[{"_id": "7bEyFRjEukru2MSoz", "postedAt": "2022-11-23T13:16:34.082Z", "postId": "LFNibDPRRmPW6jj9q", "htmlBody": "<p>If anyone has the means to do this, act quickly: funds not spent by Dec 31 (which might be deductible if spent before then) are likely to be taxed as income in the US, to the best of my knowledge.<br><br>That said, this seems hard due to correlated risks: if a few clawbacks happen, then probably many do. Amy would need to have a high level of trust that Bill could and would pay out if this happened without going bankrupt himself.</p>", "parentCommentId": null, "user": {"username": "illative"}}, {"_id": "bMzJnxpuZoRM3TKbL", "postedAt": "2022-11-23T14:18:30.007Z", "postId": "LFNibDPRRmPW6jj9q", "htmlBody": "<p>Is it not possible that, if it became public knowledge that grants were insured against clawback, lawyers would try harder to get them? If the money is already spent and it’s a bunch of broke individuals, it may not be worth the expense of trying to claw it back. I guess that would just be something Bill would have to account for.</p>\n", "parentCommentId": null, "user": {"username": "captainjc"}}, {"_id": "DGL2CJYcgtqDqb5NC", "postedAt": "2022-11-24T02:07:55.734Z", "postId": "LFNibDPRRmPW6jj9q", "htmlBody": "<p>This is not an acceptable attitude to the clawbacks.</p><p>Grantees who are in possession of stolen funds need to commit to return the funds as soon as the appropriate recovery mechanism is in place. They should view the possibility of spending the funds as 0%, because they should endeavour sincerely to return them.</p><p>Let's say you're a grantee who's currently in possession of some funds from FTX that have not been spent yet. Presumably you'll readily agree with the statement, \"I wish these funds had not been stolen\". This is something I'd expect anybody to say. But this should also come with a consistent preference for the funds to be in the not-stolen state, rather than their current, stolen, state.</p><p>If you're happy with the funds to be in their current, stolen, state, and view the possibility of clawbacks as an unfortunate problem that might happen to you, then it's very difficult to take seriously the claim that you wish the funds had not been stolen.</p><p>Amy cannot spend any of the $20,000 in her bank account <i>because it doesn't belong to her. </i>There's nowhere currently for her to send it, so she just has to keep it safe. She should hope for an outcome where it can be returned to its owners.</p><p>If Amy instead took active steps to try to prevent the money from being returned to its owners, or even simply failed to assist in the recovery, her actions should be condemned. This would make her complicit in the theft.</p><p>In contrast, clawbacks against money that have already been spent are much less clear. I think there are lots of situations where you can view that as the law being discordant with fairness, and it's not inconsistent to hope that you don't have to go through that. But if the money <i>hasn't</i> been spent, it absolutely does need to be returned.</p>", "parentCommentId": null, "user": {"username": "Matthew H"}}, {"_id": "wCzTnvHXadMCwASGr", "postedAt": "2022-11-24T21:25:15.309Z", "postId": "LFNibDPRRmPW6jj9q", "htmlBody": "<p>The difficulty with this position is that it assumes the funds were stolen. We're still waiting for a court to decide that. A couple possibilities</p><ul><li>What if FTX was law-abiding (just stupid) until recently. At the time Amy received her funds, FTX hadn't yet started committing fraud</li><li>What if 20% of FTX's losses are due to fraud, but 80% are due to some non-criminal combination of negligence and risk seeking?</li></ul><p>In both cases, Amy is just an innocent bystander. It's reasonable for her to buy insurance</p><p>Alternatively, if it turns out that FTX was entirely a fraud, then Bill still pays out the entire value of the clawback. The defrauded people are actually better off, since Bill ensures the funds will still be available</p><p>Insurance is just a good way to deal with uncertainty. It's a positive-sum trade with a positive externality:</p><ul><li>Amy reduces her risk in exchange for a negative EV</li><li>Bill gets a positive EV in exchange for extra risk</li><li>People seeking clawbacks are more likely to be made whole</li></ul>", "parentCommentId": "DGL2CJYcgtqDqb5NC", "user": {"username": "Grant Demaree"}}, {"_id": "vhamB5HRKzydrvZoz", "postedAt": "2022-11-27T04:14:45.845Z", "postId": "LFNibDPRRmPW6jj9q", "htmlBody": "<blockquote><p>The difficulty with this position is that it assumes the funds were stolen. We're still waiting for a court to decide that.</p></blockquote><p>&nbsp;</p><p>I disagree that we have to wait for a court ruling before making reasonable inferences. We can judge the situation on a balance of probabilities, and it seems overwhelmingly likely that yes he took user deposits and used them directly, including getting out a $1b personal loan.</p><blockquote><p>What if 20% of FTX's losses are due to fraud, but 80% are due to some non-criminal combination of negligence and risk seeking?</p></blockquote><p>It's not like he only lost his investment capital, or only lost money loaned to FTX for business purposes. You can chalk those up to bad business, even negligence.</p><p>He lost the deposits! That's not just bad business. Even his own excuse, in the Twitter DM with Piper, is that the money was deposited in an Alameda account and they just never sent that $8b to FTX. I don't think this story at all adds up, but even just that version of events is enough to say that there was no attempt to separate the user deposits from FTX's working capital.</p>", "parentCommentId": "wCzTnvHXadMCwASGr", "user": {"username": "Matthew H"}}]