[{"_id": "pwFHcpSccpSzuGP3p", "postedAt": "2018-03-09T19:04:30.352Z", "postId": "LFS5muaDW9LpbNT72", "htmlBody": "<p>Great content. I just poured through looking for feedback to give but the content is really great. Only note is if this is going to be done as a presentation in June I think it could get a lot more engaging with less written texts on the slide.</p>\n", "parentCommentId": null, "user": {"username": "selfactualizer"}}, {"_id": "ZcKaD5SDmpGoqorMW", "postedAt": "2018-03-09T21:49:02.338Z", "postId": "LFS5muaDW9LpbNT72", "htmlBody": "<p>Yes, I always put too much text on slides the first few times I present on a new topic, and then gradually strip it away as I remember better what my points are. Thanks!</p>\n", "parentCommentId": "pwFHcpSccpSzuGP3p", "user": {"username": "geoffreymiller"}}, {"_id": "Ws9WWMMWPuZsXGgRi", "postedAt": "2018-03-09T22:49:33.008Z", "postId": "LFS5muaDW9LpbNT72", "htmlBody": "<p>Seconded, this is worth sharing more broadly via the facebook groups!</p>\n", "parentCommentId": "pwFHcpSccpSzuGP3p", "user": {"username": "Ervin"}}, {"_id": "zyuAKBRFG7Zb3GXCC", "postedAt": "2018-03-10T16:12:50.260Z", "postId": "LFS5muaDW9LpbNT72", "htmlBody": "<p>Thanks. This will be useful for a future presentation. Although, I am going to modify challenges 3-6. Using the word &quot;utilitarian&quot; seems...limiting. EA has utilitarian/consequentialist underpinnings--but not a full blown subscription to only that moral system (i.e., not exclusive). But I'm sure you knew that already. (See Macaskill's comment on <a href=\"http://lesswrong.com/lw/j5r/effective_altruism_as_utilitarian_equivocation/a3x7\">'Effective Altruism' as utilitarian equivocation</a>.)</p>\n<p>Off the top of my head, I'm thinking something more along the lines as maximizing impact and the empathy-altruism hypothesis related to meaning well (benevolence) versus actually doing good (beneficence). (Additionally, going to add an outline =)</p>\n<p>Also, the slide about Effective Altruism as a movement, founded in 2011? I'm guessing that's for 80k Hours because GWWC has been around since 2009, and the main idea has been around since at least 1972.</p>\n", "parentCommentId": null, "user": {"username": "adamaero"}}, {"_id": "hTK3QNiaXG3R4SddL", "postedAt": "2018-03-10T16:23:56.029Z", "postId": "LFS5muaDW9LpbNT72", "htmlBody": "<p>This is well done! Acknowledging and talking about what makes hyper-rationalism repulsive to many people - mostly very unfairly! - is constructive and interesting.</p>\n<p>Maybe out of scope, but in the introduction section describing EA, I'd probably also include a slide or two of some of the more reasonable criticisms of typical EA beliefs and behaviors as well, and separate those from the list of 10 barriers of bias and irrational intuition. </p>\n<p>Doing that would better set aside the question of the merits of the EA approach, and make it easier to focus on these other blockers to wider adoption. It also would make the presentation come off more even-handed rather than &quot;here are the bad reasons people don't support what I support&quot;. That might get you more buy-in from the more skeptical members of the audience, along with inducing some questioning about how to improve EA from people who do find the answers intuitive.</p>\n", "parentCommentId": null, "user": {"username": "purpleskates"}}, {"_id": "tjycoBLAsa86voeh7", "postedAt": "2018-03-11T22:45:52.736Z", "postId": "LFS5muaDW9LpbNT72", "htmlBody": "<p>On slide 10 (EA challenge 1), I think you meant “that” rather than “than”. </p>\n<p>Good luck! \nAlso, I'm new to this forum and would appreciate it if I could get some likes so that I could make a post! Thanks. </p>\n", "parentCommentId": null, "user": {"username": "Jeffhe"}}, {"_id": "NRSr4GZEGRKvszEJd", "postedAt": "2018-03-12T01:35:31.881Z", "postId": "LFS5muaDW9LpbNT72", "htmlBody": "<p>Great stuff! A few quibbles:</p>\n<ul>\n<li><p>It feels odd to specify an exact year EA (or any movement) was 'founded'. Givewell (surprisingly not mentioned other than a logo on slide 6) have been around since 2007; MIRI since 2000; FHI since 2005; Giving What We Can since 2009. Some or all of these (eg GWWC) didn't exactly have a clear founding date, though, rather becoming more like their modern organisations over years. One might not consider some of them more strictly 'EA orgs than others' - but that's kind of the point.</p>\n</li>\n<li><p>I'd be wary of including 'moral offsetting' as an EA idea. It's fairly <a href=\"http://www.rationalreflection.net/can-we-offset-immorality/\">controversial</a>, and sounds like the sort of thing that could turn people off the other ideas</p>\n</li>\n<li><p>Agree with others that overusing the word 'utilitarianism' seems unnecessary and not strictly accurate (any moral view that included an idea of aggregation is probably sufficient, which is probably all of them to some degree). </p>\n</li>\n<li><p>Slide 12 talks about suffering exclusively; without getting into whether happiness can counterweigh it, it seems like it could mention positive experiences as well</p>\n</li>\n<li><p>I'd be wary of criticising intuitive morality for not updating on moral uncertainty. The latter seems like a fringe idea that's received a lot of publicity in the EA community, but that's far from universally accepted even by eg utilitarians and EAs</p>\n</li>\n<li><p>On slide 18 it seems odd to have an 'other' category on the right, but omit it on the left with a tiny 'clothing' category. Presumably animals are used and killed in other contexts than those four, so why not just replace clothing with 'other' - which I think would make the graph clearer</p>\n</li>\n<li><p>I also find the colours on the same graph a bit too similar - my brain keeps telling me that 'farm' is the second biggest categorical recipient when I glance it it, for eg</p>\n</li>\n<li><p>I haven't read the Marino paper and now want to, 'cause it looks like it might update me against this, but provisionally: it still seems quite defensible to believe that chickens experience substantially less total valence per individual than larger animals, esp mammals, even if it's becoming rapidly less defensible to believe that they don't experience something qualitatively similar to our own phenomenal experiences. [ETA] Having now read-skimmed it, I didn't update much on the quantitative issue (though it seems fairly clear chickens have <em>some</em> phenomenal experience, or at least there's no defensible reason to assume they don't)</p>\n</li>\n<li><p>Slide 20 'human' should be pluralised</p>\n</li>\n<li><p>Slide 22 'important' and 'unimportant' seem like loaded terms. I would replace with something more factual like (ideally a much less clunkily phrased) 'causes large magnitude of suffering', 'causes comparatively small magnitude of suffering'</p>\n</li>\n<li><p>I don't understand the phrase 'aestivatable future light-cone'. What's aestivation got to do with the scale of the future? (I know there are proposals to shepherd matter and energy to the later stages of the universe for more efficient computing, but that seems way beyond the scope of this presentation, and presumably not what you're getting at)</p>\n</li>\n<li><p>I would change 'the species would survive' on slide 25 to 'would probably survive', and maybe caveat it further, since the relevant question for expected utility is whether we could reach interstellar technology after being set back by a global catastrophe, not whether it would immediately kill us (cf eg <a href=\"https://www.openphilanthropy.org/blog/long-term-significance-reducing-global-catastrophic-risks\">https://www.openphilanthropy.org/blog/long-term-significance-reducing-global-catastrophic-risks</a>) - similarly I'd be less emphatic on slide 27 about the comparative magnitude of climate change vs the other events as an 'X-risk', esp where X-risk is defined as here: <a href=\"https://nickbostrom.com/existential/risks.html\">https://nickbostrom.com/existential/risks.html</a>)</p>\n</li>\n<li><p>Where did the 10^35 number for future sentient lives come from for slide 26? These numbers seem to vary wildly among futurists, but that one actually seems quite small to me. Bostrom estimates 10^38 lost just for a century's delayed colonization. Getting more wildly speculative, Isaac Arthur, my favourite futurist, <a href=\"https://youtu.be/Ef-mxjYkllw?t=1032\">estimates</a> a galaxy of Matrioska brains could emulate 10^44 minds - it's slightly unclear, but I think he means running them at normal human subjective speed, which would give them about 10^12 times the length of a human life between now and the end of the <a href=\"https://en.wikipedia.org/wiki/Future_of_an_expanding_universe#Stelliferous_Era\">stelliferous era</a>. The number of galaxies in the Laniakea supercluster is approx 10^5, so that would be 10^61 total, which we can shade by a few orders of magnitude to account for inefficiencies etc and still end up with a vastly high number than yours. And if Arthur's claims about <a href=\"https://www.youtube.com/watch?v=Qam5BkXIEhQ&amp;t=1s\">farming Hawking radiation and gravitational energy</a> in the <a href=\"https://www.youtube.com/watch?v=Pld8wTa16Jk\">post-stellar eras</a> are remotely plausible, then the number of sentient beings Black Hole era would dwarf that number again! (ok, this maybe turned into an excuse to talk about my favourite v/podcast)</p>\n</li>\n<li><p>Re slide 29, I think EA has long stopped being 'mostly moral philosophers &amp; computer scientists' if it ever strictly was, although they're obviously (very) overrepresented. To what end do you note this, though? It maybe makes more sense in the talk, but in the context of the slide, it's not clear whether it's a boast of a great status quo or a call to arms of a need for change</p>\n</li>\n<li><p>I would say EA needs more money <em>and</em> talent - there are still tonnes of underfunded projects!</p>\n</li>\n</ul>\n", "parentCommentId": null, "user": {"username": "Arepo"}}, {"_id": "XJptMb2AywPRd4fjc", "postedAt": "2018-03-12T06:06:04.664Z", "postId": "LFS5muaDW9LpbNT72", "htmlBody": "<p>You write, &quot;Agree with others that overusing the word 'utilitarianism' seems unnecessary and not strictly accurate (any moral view that included an idea of aggregation is probably sufficient, which is probably all of them to some degree).&quot;</p>\n<p>One thing I am sure about effective altruism is that it endorses helping the greater number, all other things being equal (by which I am here only concerned with the quality of pain being equal, for simplicity’s sake). So, for example, if $10 can be used to either save persons A and B each from some pain or C from a qualitatively identical pain, EA would say that it is morally better to save the two over the one. </p>\n<p>Now, this in itself does not mean that effective altruism believes that it makes sense to</p>\n<ol>\n<li><p>sum together certain people’s pain and to compare said sum to the sum of other people’s pain in such a way as to be able to say that one sum of pain is in some sense greater/equal to/lesser than the other, and</p>\n</li>\n<li><p>say that the morally best action is the one that results in the least sum of pain and the greatest sum of pleasure (which is more-or-less utilitarianism)</p>\n</li>\n</ol>\n<p>(Note that 2. assumes the intelligibility of 1.; see below)</p>\n<p>The reason is because there are also non-aggregative ways to justify why it is better to save the greater number, at least when all other things are equal. For a survey of such ways, see &quot;Saving Lives, Moral Theory, and the Claims of Individual&quot; (Otsuka, 2006) However, I'm not aware that effective altruism why it's better to save the greater number, all else equal, via these non-aggregative ways. Likely, it is purposely silent on this issue. Ben Todd (in private correspondence) informed me that &quot;effective altruism starts from the position that it's better to help the greater number, all else equal. Justifying that premise in the first place is in the realm of moral philosophy.&quot; If that’s indeed the case, we might say that all effective altruism says is that the morally better course of action is the one that helps more people, everything else being equal (e.g. when the suffering to each person involved in the choice situation is qualitative the same), and (presumably) also sometimes even when everything isnt equal (e.g. when the suffering to each person in the bigger group might be somewhat less painful than the suffering to each person in the smaller group). </p>\n<p>Insofar as effective altruism isn’t in the business of justification, then perhaps moral theories shouldn’t be mentioned at all in a presentation about effective altruism. But inevitably people considering joining the movement are going to ask why is it better to save the greater number, all else equal (e.g. A and B instead of C), or even sometimes when all else aren’t equal (e.g. one million people each from a relatively minor pain instead of one other person from a relatively greater pain)? And I think effective altruists ask themselves that question too. The OP might have and thought utilitarianism offers the natural justification: it is better to save A and B instead of C (and the million instead of the one) because doing so results in the least sum of pain. So, utilitarianism clearly offers a justification (though one might question if it is an adequate justification). On the other hand, it is not clear to me at all how other moral theories propose to justify saving the greater number in these two kinds of choice situations. So it is not surprising that OP has associated utilitarianism with effective altruism. I am sympathetic. </p>\n<p>A bit more on utilitarianism:\nRoughly speaking, according to utilitarianism (or the principle of utility), among all the actions we can undertake at any given moment, the right action (ie the action we ought to take) is the one that results in the least sum of pain and the greatest sum of pleasure. </p>\n<p>To figure out which action is the right action among a range of possible actions, we are to, for each possible action, add up all its resulting pleasures and pains. We are then to compare the resulting state of affairs corresponding to each action to see which resulting state of affairs contains the least sum of pain and greatest sum of pleasure. For example, suppose you can either save one million people each from a relatively minor pain or one other person from a relatively greater pain, but not both. Then you are to add up all the minor pains that would result from saving the single person, and then add up all the major pains (in this case, just 1) that would result from saving the million people, and then compare the two states of affairs to see which contains the least sum of pain. </p>\n<p>From this we can clearly see that utilitarianism assumes that it makes sense to aggregate distinct people's pains and to compare these sums in such a way as to be able to say, for example, that the sum of pain involved in a million people's minor pains is greater (in some sense) than one other person’s major pain. Of course, many philosophers have seriously questioned the intelligibility of that. </p>\n", "parentCommentId": "NRSr4GZEGRKvszEJd", "user": {"username": "Jeffhe"}}, {"_id": "wJJxsdYjYaBsoaALE", "postedAt": "2018-03-12T11:00:58.247Z", "postId": "LFS5muaDW9LpbNT72", "htmlBody": "<p>Do you offer any recommendations for communicating utilitarian ideas based on Everett's research or someone else's? </p>\n<p>For example, in Everett's 2016 paper the following is said:</p>\n<p>&quot;When communicating that a consequentialist judgment was made with difficulty, negativity toward agents who made these judgments was reduced. And when a harmful action either did not blatantly violate implicit social contracts, or actually served to honor them, there was no preference for a deontologist over a consequentialist.&quot;</p>\n", "parentCommentId": null, "user": {"username": "Risto_Uuk"}}, {"_id": "Z363bERE83TvJsCnR", "postedAt": "2018-03-12T18:13:32.478Z", "postId": "LFS5muaDW9LpbNT72", "htmlBody": "<p>Good points. I don't think &quot;(benevolence)&quot;/&quot;(beneficence)&quot; adds anything, either. Beneficence is effectively EA lingo. You're not going to draw people in by teaching them lingo. Do that a little further into on-boarding. </p>\n", "parentCommentId": "zyuAKBRFG7Zb3GXCC", "user": {"username": "DustinWehr"}}, {"_id": "x5zCRgMvtfWWiBCfL", "postedAt": "2018-03-12T19:06:59.323Z", "postId": "LFS5muaDW9LpbNT72", "htmlBody": "<p>I'm glad you said so. From now on I'll use well-meaning/ good intentions, and evidence-based good instead. </p>\n", "parentCommentId": "Z363bERE83TvJsCnR", "user": {"username": "adamaero"}}, {"_id": "z62tCsFFYYyxNdpZp", "postedAt": "2018-03-12T21:13:30.949Z", "postId": "LFS5muaDW9LpbNT72", "htmlBody": "<p>I imagine more or less anything which expresses conflictedness about taking the 'utilitarian' decision and/or expresses feeling the pull of the contrary deontological norm would fit the bill for what Everett is saying here. That said, I'm not convinced that Everett (2016) is really getting at reactions to &quot;consequentialism&quot; (see here ( <a href=\"https://www.sciencedirect.com/science/article/pii/S0010027714002054\">1</a> , <a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4642180/\">2</a> )</p>\n<p>I think that <a href=\"https://davetannenbaum.github.io/documents/Bad%20person%20good%20thing.pdf\">this</a> paper by Uhlmann et al, does show that people judge negatively those who take utilitarian decisions though, even when they judge that the utilitarian act was the right one to take. Expressing conflictedness about the utilitarian decision may be a double-edged sword, therefore. I think it may well offset negative character evaluations of the person taking the utilitarian decision, but plausibly it may also reduce any credence people attached to the utilitarian act being the right one to take.</p>\n<p>My collaborators and I did some work relevant to this, on the negative evaluation of people who make their donation decisions in a deliberative rather than explicitly empathic way. The most relevant of our experiments for this looked at the evaluation of people who both deliberated about the cost effectiveness of the donation and expressed empathy towards the recipient of the donation simultaneously. The empathy+deliberation condition was close to the empathy condition in moral evaluation (see figure 2 <a href=\"https://osf.io/d9t4n/\">https://osf.io/d9t4n/</a>) and closer to the deliberation condition in evaluation of reasonableness. </p>\n", "parentCommentId": "wJJxsdYjYaBsoaALE", "user": {"username": "David_Moss"}}, {"_id": "jsjpPYN3scWydYzfe", "postedAt": "2018-03-15T01:58:05.436Z", "postId": "LFS5muaDW9LpbNT72", "htmlBody": "<p>DR ULTIMATE  is a very genuine lottery spell caster and a very unique and a powerful man of wisdom. i am a lottery winner. I had some very bad experience in playing the lottery, because my life was at stake, then lottery seemed to be the only means that came into my head, i played the lottery steadily over 11 years , but i could not win more than $45, but i always see people winning millions of dollars, so with that i extended my search for victory ,then i found DR ULTIMATE  a powerful voodoo Dr. who promised to help me win the lottery. He did his normal work for me and finally i won $758.700,000 Powerball Jackpot lottery, This spell changed my life into riches. I am now out of debts and experiencing the most amazing good work of DR ULTIMATE after i won that huge amount of money. You can contact him for you own lottery number.  CALL or  whatsapp him on (+1{325}2619144} he will surely help you to win any kind of lottery</p>\n", "parentCommentId": null, "user": {"username": "MAVISWANCZYK"}}, {"_id": "gRify93KZGfmrK9Ad", "postedAt": "2018-03-15T02:43:43.612Z", "postId": "LFS5muaDW9LpbNT72", "htmlBody": "<p>Great work and I really enjoyed reading this presentation.</p>\n<p>On slide 27, where did you get the estimates for &quot;Human-caused X-risks are thousands of times more likely per year than natural X-risks&quot;</p>\n<p>I agree with this generally but was wondering if you have a source for the thousands times more.</p>\n", "parentCommentId": null, "user": {"username": "cassidynelson"}}, {"_id": "Jmmsqyc3esJ5Ke629", "postedAt": "2018-03-15T23:55:13.394Z", "postId": "LFS5muaDW9LpbNT72", "htmlBody": "<p>When people ask when EA &quot;started&quot; I'm never sure what to say. But I imagine Geoffrey is referring to when we chose the name with &quot;2011&quot; (see <a href=\"http://effective-altruism.com/ea/5w/the_history_of_the_term_effective_altruism/)\">http://effective-altruism.com/ea/5w/the_history_of_the_term_effective_altruism/)</a>, plus a quick nod to the longer history in Singer's work with &quot;+ Peter Singer&quot;.</p>\n", "parentCommentId": "zyuAKBRFG7Zb3GXCC", "user": null}]