[{"_id": "ykC6PXJSvttJMYsDk", "postedAt": "2022-12-04T13:59:10.140Z", "postId": "LGFgcRvhJBLL9eexP", "htmlBody": "<blockquote>\n<p>This and increasingly EA interest in funding American politics indicate a willingness to make compromises (like decreasing impact/dollar) to benefit Americans.</p>\n</blockquote>\n<p>I think we should  <em>not</em>  make compromises that decrease impact/dollar to benefit Americans. Americans are not more valuable than people from Poland or Pakistan or Kenya.</p>\n", "parentCommentId": null, "user": {"username": "harfe"}}, {"_id": "TDP4wh4eNHuxkm9jW", "postedAt": "2022-12-04T20:12:01.856Z", "postId": "LGFgcRvhJBLL9eexP", "htmlBody": "<p>I agree that Americans are not more valuable than any other people, but EA orgs like GiveDirectly have made the choice to support impoverished Americans because they are based in the US and can reach them more easily.</p>\n", "parentCommentId": "ykC6PXJSvttJMYsDk", "user": {"username": "Jasper Meyer"}}, {"_id": "gudk3XoLxLdWTLLGc", "postedAt": "2022-12-04T20:51:48.065Z", "postId": "LGFgcRvhJBLL9eexP", "htmlBody": "<p>I am skeptical that that's the reason for it. I haven't seen numbers on this but I would be shocked if the cost of delivery of any intervention to Americans is less than delivery in developing countries, because operating costs for any intervention are higher in the US - hiring people to identify recipients, for example, would be an order of magnitude more expensive than doing the same in Kenya.</p>\n<p>I suspect the real reason, which is maybe worth centering in this post, is that the pool of money that people are potentially willing to donate to Americans is a) very large, b) not fungible with money they would otherwise donate to global poverty.</p>\n", "parentCommentId": "TDP4wh4eNHuxkm9jW", "user": {"username": "therealslimkt"}}, {"_id": "MnXd6S5tWHR7kEw3s", "postedAt": "2022-12-05T19:51:03.354Z", "postId": "LGFgcRvhJBLL9eexP", "htmlBody": "<p>Point taken - I suppose my comment was a little oversimplified. I do think that identifying recipients is probably easier in the U.S., but that's irrelevant considering a poor American lives on $50/day versus $1-2 &nbsp;in Kenya.</p><blockquote><p>I suspect the real reason, which is maybe worth centering in this post, is that the pool of money that people are potentially willing to donate to Americans is a) very large, b) not fungible with money they would otherwise donate to global poverty.</p></blockquote><p>Yes, this is the motivation behind my question. GiveDirectly states that \"<a href=\"https://www.givedirectly.org/united-states/\">the additional attention from U.S. work generated $70 million in <i>new</i> donations for our Africa programs from donors who initially only gave to our U.S. COVID-19 response</a>.\" In some cases, it may be wise for EA-aligned organizations to funnel some of their interventions \"closer to home\" for their donors. GiveDirectly was able to spur new funding opportunities by directing some of their revenue to U.S. recipients. Perhaps an org focused on health media campaigns in Africa could better fundraise in the U.S. by touting a the success of an U.S. program. Again, I don't think U.S.-based interventions are ever as effective as those in poorer nations, but they have the potential to expand the donor base of EA orgs.</p>", "parentCommentId": "gudk3XoLxLdWTLLGc", "user": {"username": "Jasper Meyer"}}]