[{"_id": "RX9XmyDAftMWo2kyw", "postedAt": "2023-01-12T17:35:55.902Z", "postId": "LHN8mfi9Dc7bKD6Gu", "htmlBody": "<p>Very cool! Any plans to acquire the new .giving domain names discussed in <a href=\"https://forum.effectivealtruism.org/posts/JbXa7zuEWbJBp9N3B/giving-domains-will-be-available-soon\">this post</a>?</p>", "parentCommentId": null, "user": {"username": "Rockwell Schwartz"}}, {"_id": "ma9gFoviucbd7XnPj", "postedAt": "2023-01-12T18:07:52.368Z", "postId": "LHN8mfi9Dc7bKD6Gu", "htmlBody": "<p>Probably a few depending on price, yeah. I'm fairly AI x-risk focused in my own purchases so probably wouldn't get the full set that would be good (might get a few core EA ones if they're still available though), but would be happy to list any that anyone else picks up.</p>", "parentCommentId": "RX9XmyDAftMWo2kyw", "user": {"username": "plex"}}, {"_id": "QZ2eqeuPzoJRkz9z3", "postedAt": "2023-01-12T19:02:35.293Z", "postId": "LHN8mfi9Dc7bKD6Gu", "htmlBody": "<p>Great, thanks!</p>", "parentCommentId": "ma9gFoviucbd7XnPj", "user": {"username": "Rockwell Schwartz"}}, {"_id": "k9ounwiLrsjJ87Nqq", "postedAt": "2023-01-12T19:56:06.446Z", "postId": "LHN8mfi9Dc7bKD6Gu", "htmlBody": "<p>Congrats on launching this website, I'm excited about it!! Side note, woah coda.io makes such pretty looking homepages :D<br><br>How would you like people to contribute domains to this project, if they have some to offer?</p>", "parentCommentId": null, "user": {"username": "Angelina Li"}}, {"_id": "fCTxnizDzZthGiNQK", "postedAt": "2023-01-12T22:59:35.872Z", "postId": "LHN8mfi9Dc7bKD6Gu", "htmlBody": "<p>Thanks! And yeah, it's an incredibly powerful tool too! It's a relational database integrated with an awesome editor and scripting engine, but all absurdly easy to use. The homepage is actually <a href=\"https://carrd.co/\">carrd.co</a>, though, with coda embedded.</p><p>You can add them via <a href=\"https://coda.io/form/Add-domain-to-ea-domains_ds_ed_7xJli\">the form</a>, or you can DM me or post here request a bulk addition them if there are more than is easy to add by a form. You'll remain the owner of them, unless you want to ask Ben West for CEA to be the custodian.</p>", "parentCommentId": "k9ounwiLrsjJ87Nqq", "user": {"username": "plex"}}, {"_id": "yDpdHvGEhsbLaLneG", "postedAt": "2023-01-18T08:17:06.938Z", "postId": "LHN8mfi9Dc7bKD6Gu", "htmlBody": "<p>I'm confused by several of these. Why did they register médecinssansfrontières.com, or globalcatastrophicriskinstitute.com, given that those are extent organizations?</p>", "parentCommentId": null, "user": {"username": "Davidmanheim"}}, {"_id": "At6qFyadZWmh8oiec", "postedAt": "2023-01-18T11:06:34.343Z", "postId": "LHN8mfi9Dc7bKD6Gu", "htmlBody": "<p>My understanding is that they asked someone to register the domains for things that had an EAF tag entry, which accidentally included some which didn't really make sense. The full list includes a bunch of names of individuals, which were removed from EA domains.</p>\n<p>I think ideally we should reach out to all individuals and orgs who CEA bought domains about and offer them, but it isn't a super high priority for me.</p>\n", "parentCommentId": "yDpdHvGEhsbLaLneG", "user": {"username": "plex"}}, {"_id": "zrsei6HchekoS5iSh", "postedAt": "2023-02-01T23:55:04.707Z", "postId": "LHN8mfi9Dc7bKD6Gu", "htmlBody": "<p>Small note on CEA being the custodian: someone transferred a couple domains to us a few years ago and it seems like the renewal information wasn't set up appropriately so we lost them. (I'm not entirely sure what happened, the person involved doesn't work here anymore and our registrar says they don't have records.)</p><p>So consider that we have a decent though not perfect track record here and if you really want to be sure that you don't lose the domain you should probably keep it yourself.</p>", "parentCommentId": "fCTxnizDzZthGiNQK", "user": {"username": "Ben_West"}}]