[{"_id": "7cgWvvJCzc4ks2Ja6", "postedAt": "2022-11-25T08:32:42.577Z", "postId": "Liphmkodcu7XPDKfK", "htmlBody": "<p>Formatting note: your footnotes seem to link to an external private Google doc that I can’t view. Might be better to unlink them and leave them as normal footnotes!</p>\n", "parentCommentId": null, "user": {"username": "JamesOz"}}, {"_id": "Rvpyq9AsZJsbohkbF", "postedAt": "2022-11-25T09:36:40.950Z", "postId": "Liphmkodcu7XPDKfK", "htmlBody": "<p>Thanks for flagging! I will fix that now :)</p>", "parentCommentId": "7cgWvvJCzc4ks2Ja6", "user": {"username": "kierangreig"}}, {"_id": "umk2txvEGgnkSgjrL", "postedAt": "2022-11-25T16:15:17.173Z", "postId": "Liphmkodcu7XPDKfK", "htmlBody": "<p>(also the inner-doc links inside footnote 46 point to the doc)</p>", "parentCommentId": "Rvpyq9AsZJsbohkbF", "user": {"username": "edoarad"}}, {"_id": "D4WKwr4YAcB9u5feq", "postedAt": "2022-11-25T16:55:27.938Z", "postId": "Liphmkodcu7XPDKfK", "htmlBody": "<p>Ah, thanks. Fixing that now :)&nbsp;</p>", "parentCommentId": "umk2txvEGgnkSgjrL", "user": {"username": "kierangreig"}}, {"_id": "C4GevvKE53nYnZKbu", "postedAt": "2022-12-01T04:08:24.342Z", "postId": "Liphmkodcu7XPDKfK", "htmlBody": "<p>Formatting thing: you may have meant to indent some bullets under \"Work on any single area can gain from our working on multiple areas:\"</p>\n<p>I think this b/c it ends with a \":\"</p>\n", "parentCommentId": null, "user": {"username": "Gina_Stuessy"}}, {"_id": "E6hYnsEwkhJsaQg6N", "postedAt": "2022-12-01T05:45:18.411Z", "postId": "Liphmkodcu7XPDKfK", "htmlBody": "<p>You're right! Just updated :)&nbsp;</p>", "parentCommentId": "C4GevvKE53nYnZKbu", "user": {"username": "kierangreig"}}, {"_id": "bugyGn8wxAjvQ45Bi", "postedAt": "2022-12-06T15:06:06.033Z", "postId": "Liphmkodcu7XPDKfK", "htmlBody": "<p>Thanks for the post!</p><blockquote><p>Much of our commissioned work in 2022—particularly in Global Health and Development and AI Governance and Strategy—was not published.</p></blockquote><p>Would it be possible to provide further details, maybe using fictitious examples?</p>", "parentCommentId": null, "user": {"username": "vascoamaralgrilo"}}, {"_id": "EKYLSLaCLnmbLsT3F", "postedAt": "2022-12-07T09:31:52.775Z", "postId": "Liphmkodcu7XPDKfK", "htmlBody": "<p>Thanks for your engagement!&nbsp;</p><p>Yes, for instance, as mentioned in&nbsp;<a href=\"https://forum.effectivealtruism.org/posts/Liphmkodcu7XPDKfK/rethink-priorities-2022-impact-2023-strategy-and-funding-1#Appendix\">the appendix</a>, some non-fictitious examples for Global Health and Development are:&nbsp;</p><blockquote><p>We produced numerous research reports for Open Phil assessing the potential of global health and development interventions, looking for interventions that could be as or more cost-effective as the ones currently ranked top by GiveWell. This included full reports on the following:</p><ul><li><a href=\"https://forum.effectivealtruism.org/posts/xanSjg6Hq2PaGEkZP/how-effective-are-prizes-at-spurring-innovation\">The effectiveness of large cash prizes in spurring innovation</a> (the report was also shared with FTX Future Fund, and another large foundation).</li><li>The badness of a year of life lost vs. a year of severe depression.&nbsp;&nbsp;</li><li>Scientific research capacity in sub-Saharan Africa.</li><li>The landscape of climate change philanthropy.</li><li>Energy frontier growth (this report explores several of the key considerations for quantifying the potential economic growth benefits of clean energy R&amp;D).</li><li>Funding gaps and bottlenecks to the deployment of carbon capture, utilization, and storage technologies.</li><li>A literature review on damage functions of integrated assessment models in climate change.</li><li>A confidential project that we won’t give further details on.</li><li>Detailing the process of the World Health Organizations’s prequalification process for medicines, vaccines, diagnostics and vector control, as well as the potential impact of additional funding in this area.</li><li>Describing the World Health Organization’s Essential Medicines List and the potential impact of additional funding in this area.</li><li>Whether Open Phil should make a major set of grants to establish better weather forecasting data availability in low- and middle-income countries (LMICs).</li><li>Further examination of hypertension, including its scale and plausible areas a philanthropist could make a difference.&nbsp;&nbsp;&nbsp;&nbsp;</li></ul></blockquote><p>And for AI Governance and Strategy respectively, some examples could include the following:&nbsp;</p><blockquote><p>Ongoing projects include the following: (Note: this list isn’t comprehensive and some of these will soon result in public outputs.)</p><ul><li>Developing what’s intended to be a comprehensive database of AI policy proposals that could be implemented by the US government in the near- or medium-term. This database is intended to capture information on these proposals’ expected impacts, their levels of consensus within longtermist circles, and how they could be implemented.</li><li>Planning another Long-term AI Strategy Retreat for 2023, and potentially some smaller AI strategy events.</li><li>Thinking about what the leadup to transformative AI will look like, and how to generate economic and policy implications from technical people’s expectations of AI capabilities growth.</li><li>Mentoring AI strategy projects by promising people outside of our team who are interested in testing and building their fit for AI governance and strategy work.</li><li>Preparing a report on the character of AI diffusion: how fast and by what mechanisms AI technologies spread, what strategic implications that has (e.g. for AI race dynamics), and what interventions could be pursued to influence diffusion.</li><li>Surveying experts on intermediate goals for AI governance.</li><li>Investigating the tractability of bringing about international agreements to promote AI safety and the best means of doing so, focusing particularly on agreements that include both the US and China.</li><li>Investigating possible mechanisms for monitoring and restricting possession or use of AI-relevant chips.</li><li>Assessing the potential value of an AI safety bounty program, which would reward people who identify safety issues in a specified AI system.</li><li>Writing a report on “Defense in Depth against Catastrophic AI Incidents,” which makes a case for mainstream corporate and policy actors to care about safety/security-related AI risks, and lays out a “toolkit” of 15-20 interventions that they can use to improve the design, security, and governance of high-stakes AI systems.</li><li>Experimenting with using&nbsp;<a href=\"https://en.wikipedia.org/wiki/Expert_network\">expert networks</a> for EA-aligned research.</li><li>Trying to create/improve pipelines for causing mainstream think tanks to do valuable longtermism-aligned research projects, e.g. via identifying and scoping fitting research projects.</li></ul></blockquote>", "parentCommentId": "bugyGn8wxAjvQ45Bi", "user": {"username": "kierangreig"}}, {"_id": "gifEMjKuqiCzGCPK2", "postedAt": "2022-12-07T12:44:49.860Z", "postId": "Liphmkodcu7XPDKfK", "htmlBody": "<p>Thanks, and sorry for not having checked the appendix!&nbsp;</p><p>It looks like it would be quite valuable to publish that research, even if just as posts which would contain the summary and link to the relevant report, to save time. This would not be possible for the ones containing information hazards, but I hope there will not be many under such conditions.</p>", "parentCommentId": "EKYLSLaCLnmbLsT3F", "user": {"username": "vascoamaralgrilo"}}, {"_id": "ZZNRLHmqzWNhNP7mC", "postedAt": "2022-12-08T20:02:20.660Z", "postId": "Liphmkodcu7XPDKfK", "htmlBody": "<p>Thanks Kieran, this is very interesting! I would also be quite keen to hear about what RP has tried and didn't go so well. For example, I know RP has been trying to launch the Insect Welfare Project (or whatever it'll be called ultimately) since early 2021 <a href=\"https://www.reddit.com/r/EAjobs/comments/mw86it/rethink_priorities_is_hiring_an_executive/\">or so</a>. I know you had to re-hire for this recently as the last executive director left, so I was wondering if you could share some learnings from that? For example:</p><ul><li>How come it's taken longer than anticipated for the Insect Welfare Project to launch and start running programs?</li><li>What mistakes do you think you made in this process?</li><li>How will this change the approach to which you incubate new organisations?&nbsp;</li></ul><p>etc. This list is non-exhaustive so would be keen to hear other useful lessons from this experience! Sorry if this comes across as critical, as it's not my intention, but I'm genuinely curious on what's been happening re Insect Welfare Project as it's a much needed endeavour.&nbsp;</p>", "parentCommentId": null, "user": {"username": "JamesOz"}}]