[{"_id": "oWw2cf6fhp6WQyahc", "postedAt": "2022-10-22T14:21:03.958Z", "postId": "LjAMCM34JmCzACEQq", "htmlBody": "<p>Hi there! Is there any way to still tune in/watch some part of the conference later if I've missed the sign-up deadline?&nbsp;</p>", "parentCommentId": null, "user": null}, {"_id": "9gGmaMmrpfzyv5yAu", "postedAt": "2022-10-22T14:41:04.151Z", "postId": "LjAMCM34JmCzACEQq", "htmlBody": "<p>A few from me!</p><ul><li>In the conference office hours yesterday, there was a good discussion about the demandingness of EA. One attendee said they always felt pressure to work more to help more people. Other attendees in the session introduced considerations such as being able to work sustainably for long periods of time, and the importance of cause prioritisation above marginal output. I thought it was really brave of the attendee to seek help in a public forum, and everyone was super welcoming.</li><li>A colleague mentioned helping a community builder focused on AI safety. During the meeting, they looked up professors at their university that they might be able to tap to start an AIS hub, and did some brainstorming on how to get CS PhD students to engage with AIS.</li><li>One person I bumped into in Gathertown thought that the EA Gathertown space was made just for the conference - not so! They said they'd probably visit again after the event.</li><li>I met someone who was interested in community-building efforts in MENA (Middle East and North Africa) and was able to connect them to someone else I know. Just really exciting that this person is seeking and able to connect with the global EA community.</li></ul>", "parentCommentId": null, "user": {"username": "OllieBase"}}, {"_id": "ue8kXXw2JCPu4sJhf", "postedAt": "2022-10-22T15:11:01.473Z", "postId": "LjAMCM34JmCzACEQq", "htmlBody": "<p>Hi Mischi, all the talks, workshops, and fireside chats will be available on CEA's <a href=\"https://www.youtube.com/c/EffectiveAltruismVideos/videos\">YouTube channel</a> next week.</p>", "parentCommentId": "oWw2cf6fhp6WQyahc", "user": {"username": "Alex_Berezhnoy"}}, {"_id": "gsJn4f7hMPvvyFf5w", "postedAt": "2022-10-23T11:47:06.884Z", "postId": "LjAMCM34JmCzACEQq", "htmlBody": "<p>As an organiser, I am constantly amazed at how helpful everyone has been. Thank you to all the volunteers, speakers and attendees who have been so willing to contribute! I love this community &lt;3</p>", "parentCommentId": null, "user": {"username": "Jordan Pieters"}}, {"_id": "aNSY5iNBfCziHA2WC", "postedAt": "2022-10-23T11:53:03.620Z", "postId": "LjAMCM34JmCzACEQq", "htmlBody": "<p>The EA forum introductory workshop has been very encouraging, I might actually write my own first post.&nbsp;</p><p>For accountability reasons, it is gonna be something like \"Coming back to EA after 6 years\" :-)</p>", "parentCommentId": null, "user": {"username": "Martin Hrádela"}}, {"_id": "s2BrB8vsGxGdThDkx", "postedAt": "2022-10-23T11:54:39.203Z", "postId": "LjAMCM34JmCzACEQq", "htmlBody": "<p>Personal progress update regarding the cause priority of alternative proteins (resulted from GHI talk):<br><br>Question: Is it worth the EA Community trying to accelerate the growth of alt protein production, or should we just allow market forces to move it forward? What are the neglected areas of the alt protein landscape that an EA should get involved instead of purely profit-motivated agents?<br><br>Answer: GFI thinks the market will not solve these problems on its own. A particular case of this seems to be fundamental scientific research, where markets need better products, but are not willing to invest in the research themselves.<br><br>Update: I initially thought profit-motivated agents would be sufficient to accelerate the growth of alt protein production, but I now doubt that stance, and realize that there likely are neglected areas within alt protein where EAs can have a high marginal impact.&nbsp;<br>&nbsp;</p>", "parentCommentId": null, "user": {"username": "Per Ivar Friborg"}}, {"_id": "xzdXLqE372zoh8M2K", "postedAt": "2022-10-23T12:07:12.452Z", "postId": "LjAMCM34JmCzACEQq", "htmlBody": "<p>As a short preface - I was very positively surprised by the quality of the sessions. I will most definitely join more (virtual) EA &nbsp;conferences in the future.</p><p>Here are just a few things I take away from the conference:</p><p><strong>Charity Entrepreneurship</strong></p><p>Founding an EA aligned start-up has been on my mind for a while now but it was all very vague and I was not sure, if I would &nbsp;a good fit for that particular branch of altruism.&nbsp;</p><p>Steve Thompson's talk \"How and Why You Should Start a High-Impact Nonprofit\" was inspiring in that regard. He made the point that it is is generally hard to know your fit before trying it. Charity Entrepreneurship's application process, however, &nbsp;is quite good at judging the fit and the program provides feedback on applications. &nbsp;</p><p>Long story short - I took the time to apply last night and am looking forward to hearing from them. Have a look at their <a href=\"https://www.charityentrepreneurship.com/\">website </a>and their short <a href=\"https://charityentrepreneurship.aidaform.com/CEQuiz\">quiz </a>to find out if it could be something for you too.</p><p><strong>Better Writing</strong></p><p>Shakeel's Session \"How to Write Well\" gave me some additional ideas on how to get better at (surprise) writing. If I had to quote one (very basic) thing it would be \"Don't use a long word, when you could use &nbsp;a short one\"</p><p>I'd recommend watching the session as VOD.</p>", "parentCommentId": null, "user": {"username": "Christopher Strahle"}}, {"_id": "jekduJirka6LDwrhD", "postedAt": "2022-10-23T17:43:42.073Z", "postId": "LjAMCM34JmCzACEQq", "htmlBody": "<p>I heard an amazing comment in the live chat of the 'Will AI be an Existential Risk: An Intro to AI Safety Risk Arguments' talk. (note this is from memory so not an actual quote)</p><blockquote><p>\"I feel that Human-AI alignment is no different than Human-Human Alignment, we need to get better at Human-Agent Alignment as a whole\" &nbsp;(note this is from memory so not an actual quote)</p></blockquote><p>I found this a profound statement, I wonder if the bucket of Human-AI Alignment was to expand to include the most tractable topics/causes in Human-Agent Alignment, what might emerge that could have otherwise been missed.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Alex_Z"}}, {"_id": "gq9EEbtzodbbdro8x", "postedAt": "2022-10-23T20:02:35.273Z", "postId": "LjAMCM34JmCzACEQq", "htmlBody": "<p>I also got a lot out of the Charity Entrepreneurship talk. Lead to me applying and also doing a 1-1 with Steve. This talk changed my thinking about what to do with my carrier!&nbsp;</p>", "parentCommentId": "xzdXLqE372zoh8M2K", "user": {"username": "Alex_Z"}}, {"_id": "p5HRnseKuBgjbKCs7", "postedAt": "2022-10-24T00:12:38.238Z", "postId": "LjAMCM34JmCzACEQq", "htmlBody": "<p>Hi all. Attending my first EA conference at EAGx virtual was an amazing experience. Thank you to all the organizers and contributors :)</p><p>Value add:&nbsp;</p><ol><li>Found a potential match to collaborate/consult on one interesting project in Farmed Animal Welfare space.&nbsp;</li><li>Connected with about 10-15 cool people in the community with whom I would be comfortable to ask a favor or questions. Prior to the event, knew only 1-2 within EA movement.&nbsp;</li><li>Discovered <a href=\"https://www.givinggreen.earth/\">Giving Green</a> at a session. Giving Green is likely to influence a portion (10-20 %) of my annual donations for 2022 or 2023 (based on when they publish their first recommendations).</li><li>Discovered BlueDot <a href=\"https://airtable.com/shr41jcUXUc62n1SM\">Impact programmes</a> and applied for it (Himanshu).</li><li>On the mental health front, going to try personal growth app called Vivid (Gidi Kadosh talk), read/refer to <a href=\"https://www.eamentalhealthnavigator.com/\">https://www.eamentalhealthnavigator.com/</a> and try a free call with a coach.</li><li>Learned about one strategy for networking and increasing my visibility: Posting regularly on EA forum or other EA blogs (Aditya).</li><li>Learned about one strategy to make the transition into EA careers: Volunteer at multiple orgs (small projects) to assess personal fit and the need at the org (Aditya). Going to try volunteering at one org as a trial run.</li><li>Got recommendations to read 80k career profiles, speak with people from <a href=\"https://www.animaladvocacycareers.org/\">Animal Advocacy Careers</a> and read their resources on current job role bottlenecks in Farmed Animal Welfare space.</li></ol>", "parentCommentId": null, "user": {"username": "ShreyansChordia"}}, {"_id": "jaaFN5RQDN6X8nk5J", "postedAt": "2022-10-31T14:49:12.780Z", "postId": "LjAMCM34JmCzACEQq", "htmlBody": "<p>I had a great overall experience at the conference. As a speaker, everything went smoothly for me. The organizers were great and I would definitely recommend them for future events. I would also recommend people attend future EAGxVirtual events.</p><p>It's important to emphasize the overall value of remove events. Advantages include reduced greenhouse gas emissions (especially from air travel), lower cost, less time intensive, less time away from family, COVID-safe, no travel visa required (facilitates geographic diversity), and more. I talk about this in <a href=\"https://forum.effectivealtruism.org/posts/EvJxELPauFmLyBqtX/doing-better-on-climate-change#Avoiding_airplane_travel\">my recent Forum post on climate change</a>.</p><p>At EAGxVirtual, the geographic diversity struck me as being very good and substantially better than what I recall from in-person EAG events. At one point, I had a great conversation with people from Moscow, Australia, India, Tanzania, &amp; a student in Costa Rica. It's hard to do that at an in-person conference.</p><p>Of note, that conversation was spontaneous, with people just walking up in the Gather. Maybe they thought to approach me because they knew I was speaking on Ukraine &amp; nuclear war. But this is why we have conferences - to bring people together with similar interests and give them a chance to interact.</p><p>I also had a few good one-on-ones, mostly facilitated by the SwapCard.</p>", "parentCommentId": null, "user": {"username": "SethBaum"}}, {"_id": "EjMB88td7CnAuMQHa", "postedAt": "2022-11-02T18:46:49.379Z", "postId": "LjAMCM34JmCzACEQq", "htmlBody": "<p>First time attending EAGx. Really glad I read the guidance before, mostly for the advice to focus on booking 121 meetings with other attendees. I was hoping to gain a bit more insight into what it's like working in operations within EA and was also looking to get some practical advice on making a career move.&nbsp;</p><p>I sent 121 invites to a number of people with operations roles and was amazed at how many responses I got back (I was unable to offer much value to any of the people I'd asked to meet). I'm not exaggerating when I say I got more value from each individual meeting than I had expected to get out of all the meetings put together.</p><p>Some of the tips I was given by people currently in ops roles at EA orgs:</p><ul><li>Sign up to Pineapple Operations (this is an online database where you can list yourself as interested in ops work) - I got an email a few days after signing up inviting me to apply for a closed recruitment round that I otherwise wouldn't have come across</li><li>Have public evidence of your engagement with EA - post on the forum, get involved in groups, don't just digest the content. See this article written as constructive criticism for EA, which I think can be used as advice when applying - <a href=\"https://forum.effectivealtruism.org/posts/4rBoime7bP9DNANyf/?commentId=NCPhunKcA4SeeRtS2\">https://forum.effectivealtruism.org/posts/4rBoime7bP9DNANyf/?commentId=NCPhunKcA4SeeRtS2</a></li><li>Apply for career coaching from EA Pathfinder - they provide career coaching to people with 5+ years experience working who want to switch to an EA career or want more advice on career capital etc. (these words represent my summary of EA Pathfinder. I have no affiliation with them and if anyone with connection to them would like this blurb updated, please contact me and I will be happy to edit this section to be more accurate)</li></ul><p>This list is by no means exhaustive of the advice and support I was given by a bunch of wonderful EAs over the conference, but it gives a few practical suggestions to others like me.</p><p>Thank you to the organisers and speakers, and thank you to all who agreed to meet with me!</p><p>I had a grEAt time!</p><p>&nbsp;</p><p>Ander Morgan</p>", "parentCommentId": null, "user": {"username": "AnderMorgan"}}, {"_id": "CgEmzPK4cd2yGyj8S", "postedAt": "2022-11-04T22:21:43.647Z", "postId": "LjAMCM34JmCzACEQq", "htmlBody": "<p>Update: all the talks from the conference are now available in <a href=\"https://www.youtube.com/playlist?list=PLwp9xeoX5p8NblAZ4PWO_rJyO3u6ZEfD_\"><strong>this playlist</strong></a>.</p>", "parentCommentId": "oWw2cf6fhp6WQyahc", "user": {"username": "Alex_Berezhnoy"}}, {"_id": "E8yimWfehfy2neR44", "postedAt": "2022-11-22T19:30:37.526Z", "postId": "LjAMCM34JmCzACEQq", "htmlBody": "<p>Super late to this, but still (probably) worth adding a few thoughts I think, as they don't seem to be present in the below.&nbsp;</p><ul><li>I was surprised at just how diverse the people I met were in their journeys with EA. I met one person who had <i><strong>learned</strong></i> about EA just earlier that month and hadn't engaged beyond reading a few articles, while also sitting down to talk to people experienced and incredibly active in the space like <a href=\"https://forum.effectivealtruism.org/users/michaela?from=community_members_tab\">Michael Aird</a>. &nbsp;While this created some problems (some of the talks seemed geared towards a much less familiar audience) it also was wonderful for helping encourage against siloing EA based on experience.</li><li>I would say that the biggest, most important message I took away from my conversations is that one shouldn't put as much pressure as a lot of young EA members do on getting it right from their first job. I heard from many people further along in their career that their first job was often unrelated and not an imperative part of finding their way to their later effective career, generally reminding me that like other important aspects of lives, figuring these things out takes time.</li><li>I changed a bit in terms of cause prioritization, as I had downranked the loose category of \"Mental Health\", but met two coaches who brought some novel arguments to light, like the idea that being a therapist specifically for EAs could be a particularly effective pathway forward if one feels they have a good personal fit for therapy (which I think I might), which made me relatively uprank mental health as a potential career pathway again. I'd like to dig further into this (i.e. do existing paradigms &amp; evidence indicate that having a therapist more similar to the patient in thoughts and convictions would be incredibly helpful in improving the patients welfare?) and hope to potentially eventually make a shortform.</li><li>By far my best moments came in office hours after talks and 1-on-1s, so I would highly recommend prioritizing those over talks, based on my experience and what seemed like an experience many others shared. (props specifically to those who organized the Mental Health Meetup, I thought that had a fantastic format and should be replicated in the future).</li></ul><p>All in all, it was a really cool experience, &nbsp;and I was really grateful for EA for putting this on, and creating the space to try to bring us more together. Just got into EAGx Berkely and am excited to see how an in person is relative to the virtual format, will possibly update this post with thoughts on that afterwards.</p>", "parentCommentId": null, "user": {"username": "tswizzle96"}}]