[{"_id": "MT9rWd6knfTw44wix", "postedAt": "2015-01-06T01:02:47.381Z", "postId": "LjeqMHkYavQsaveh3", "htmlBody": "<p>Great idea!</p>\n<p>Does the pamphleting have to be done on Fridays, or can it be done on pseudo-random days? (I'm thinking about distinguishing the signal from the pamphlets from e.g. people spending more time on the Internet during weekends. Pseudo-random spikes might require fancier math to pick out though, and of course you need to remember which days you handed out pamphlets!</p>\n<p>Can you ask people, when they take the pledge, how they found out about TLYCS? (This will provide an under-estimate, but it can be used to sanity-check other estimates). (Also it's a bit ambiguous if someone had e.g. vaguely heard of TLYCS or Singer before, but pamphleting prompted them to actually take the pledge)</p>\n<p>There's a typo in your text (&quot;require's&quot;) - make sure you get the pamphlets proof-read :)</p>\n<p>Do you know in advance what you expect, in terms of:</p>\n<ul>\n<li>How many pamphlets you will distribute</li>\n<li>What the effect will be?</li>\n</ul>\n<p>(Last I heard, EA was using predictionbazaar.com and predictionbook.com as its prediction markets)</p>\n", "parentCommentId": null, "user": {"username": "Giles"}}, {"_id": "PR8zPktwdXjNWCfKD", "postedAt": "2015-01-06T01:04:36.848Z", "postId": "LjeqMHkYavQsaveh3", "htmlBody": "<p>Also, have you got in touch with the good people at <a href=\"http://www.charityscience.com/our-team.html\">Charity Science</a>?</p>\n", "parentCommentId": null, "user": {"username": "Giles"}}, {"_id": "Ao5hdfPLn9xcYMZM5", "postedAt": "2015-01-06T02:05:07.863Z", "postId": "LjeqMHkYavQsaveh3", "htmlBody": "<p>Just took a look at their website, very cool stuff. You suggesting I email them and get their feedback on our plan?</p>\n", "parentCommentId": "PR8zPktwdXjNWCfKD", "user": {"username": "jonathonsmith"}}, {"_id": "xRghcL9ofyKvjbhdy", "postedAt": "2015-01-06T02:12:02.781Z", "postId": "LjeqMHkYavQsaveh3", "htmlBody": "<p>Some really good points here. I never considered that handing out the leaflets only on Fridays might skew the results (I just happen to have every other Friday off, thanks California), I'll have to think that through. And it would definitely be a good idea to have a &quot;Where did you hear about the pledge?&quot; question on the pledge site, I'll check into that as well.</p>\n<p>I'm not sure what our initial run on the pamphlets will be, but I'm thinking in the 5K-15K range. I haven't done any analysis to figure out how many we'd need to hand out to get good statistics; not even really sure how to go about doing that, to be honest. And absolutely no idea what to expect in terms of a response rate. Any thoughts on how to estimate that?</p>\n", "parentCommentId": "MT9rWd6knfTw44wix", "user": {"username": "jonathonsmith"}}, {"_id": "9n6vBvePGwQfi283e", "postedAt": "2015-01-06T03:38:39.135Z", "postId": "LjeqMHkYavQsaveh3", "htmlBody": "<blockquote>\n<p>I'm not sure what our initial run on the pamphlets will be, but I'm thinking in the 5K-15K range. I haven't done any analysis to figure out how many we'd need to hand out to get good statistics; not even really sure how to go about doing that, to be honest.</p>\n</blockquote>\n<p>Please talk to a real statistician if you're designing an experiment! Random Internet people picking your design apart is actually pretty good as far as review goes (if they're the right Internet people), but actual statisticians are orders of magnitude better. Experiment design is <em>very</em> tricky and good statisticians are aware of both lots of tools to make your job easier, and lots of pitfalls for you to avoid. To quote Ronald Fisher:</p>\n<blockquote>\n<p>To consult the statistician after an experiment is finished is often merely to ask him to conduct a post mortem examination. He can perhaps say what the experiment died of.</p>\n</blockquote>\n", "parentCommentId": "xRghcL9ofyKvjbhdy", "user": {"username": "Ben_Kuhn"}}, {"_id": "GoBSBga66B6N22hjE", "postedAt": "2015-01-06T11:07:30.780Z", "postId": "LjeqMHkYavQsaveh3", "htmlBody": "<p>Statistically, the situation you don't want to get into is leafleting every Friday so there's no Fridays left to provide your control condition.</p>\n", "parentCommentId": "MT9rWd6knfTw44wix", "user": {"username": "RyanCarey"}}, {"_id": "z6MdwQGy7S2fZm7sH", "postedAt": "2015-01-06T12:01:51.868Z", "postId": "LjeqMHkYavQsaveh3", "htmlBody": "<blockquote>\n<p>What is the right balance to strike between pitching a strong “hook” in our pamphlets versus keeping them “clean” so that only the appeal of the pamphlets as a medium is measured?</p>\n</blockquote>\n<p>What you want to assess is the marginal cost-effectiveness of pamphlets, so I think the right approach is to include the best hook that you can which scales up at zero marginal cost. This probably excludes an online giving game. It should allow an online video, but ideally one that can be reused if distributing these elsewhere rather than too personalised to the target audience.</p>\n", "parentCommentId": null, "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "FWi3C9rkqHWyoe88u", "postedAt": "2015-01-06T12:08:08.767Z", "postId": "LjeqMHkYavQsaveh3", "htmlBody": "<p>I figure most people don't know a statistician (I don't) but there are plenty of people in LessWrong discussion who know how to do a power calculation so it might be good to start there (or just to dig a bit deeper here).</p>\n", "parentCommentId": "9n6vBvePGwQfi283e", "user": {"username": "RyanCarey"}}, {"_id": "K5rpr5j5z4veiKxSe", "postedAt": "2015-01-06T14:58:09.902Z", "postId": "LjeqMHkYavQsaveh3", "htmlBody": "<p>Oh yeah, good point.</p>\n", "parentCommentId": "GoBSBga66B6N22hjE", "user": {"username": "Giles"}}, {"_id": "ebA4akvR7EMCi7RhR", "postedAt": "2015-01-06T15:07:40.651Z", "postId": "LjeqMHkYavQsaveh3", "htmlBody": "<p>Definitely. Some of the team at least are EA insiders and lurking on this very forum, and they'll already know about TLYCS for sure.</p>\n", "parentCommentId": "Ao5hdfPLn9xcYMZM5", "user": {"username": "Giles"}}, {"_id": "pjMyqpoTThqpKtRRc", "postedAt": "2015-01-06T15:36:56.280Z", "postId": "LjeqMHkYavQsaveh3", "htmlBody": "<p>We lurk amongggggg youuuuu.</p>\n", "parentCommentId": "ebA4akvR7EMCi7RhR", "user": {"username": "Peter_Hurford"}}, {"_id": "vBh8cscgSuKcja3DC", "postedAt": "2015-01-06T16:45:56.967Z", "postId": "LjeqMHkYavQsaveh3", "htmlBody": "<p>Really good point here; I was a fan myself of the online Giving Game, but that would be hard to scale with the program without securing a donor willing to finance it at a pretty large level. </p>\n", "parentCommentId": "z6MdwQGy7S2fZm7sH", "user": {"username": "jonathonsmith"}}, {"_id": "WZNT3DiTcADyGMXSR", "postedAt": "2015-01-06T21:24:20.430Z", "postId": "LjeqMHkYavQsaveh3", "htmlBody": "<p>Statistics Without Borders may be a good place to start.</p>\n", "parentCommentId": "9n6vBvePGwQfi283e", "user": {"username": "Austen_Forrester"}}, {"_id": "3AxXNEWciMLCfd3Jv", "postedAt": "2015-01-06T21:27:54.653Z", "postId": "LjeqMHkYavQsaveh3", "htmlBody": "<p>There was an &quot;Effective Altruism Brochure&quot; thread on Facebook's <em>Effective Altruists</em> group. Might be a good starting template to use for a handout: <a href=\"https://www.facebook.com/groups/effective.altruists/638689146187446/\">see here</a></p>\n", "parentCommentId": null, "user": {"username": "yboris"}}, {"_id": "N7Zcazj56QQ6QiTLS", "postedAt": "2015-01-07T02:05:53.069Z", "postId": "LjeqMHkYavQsaveh3", "htmlBody": "<p>It really won't help address the problem I'm talking about at all, which is <em>unknown</em> design flaws/statistical techniques/study design tools. Once you've figured out that you have a problem like &quot;how should I power my study?&quot;, smart people plus Internet is fine; I'm worried about the other 10 issues we haven't noticed yet. That's the kind of thing that statisticians are useful for.</p>\n<p>Fortunately, it turns out you can still talk to statisticians even if you don't know them personally. If you're spending money on your study, you could even go so far as to hire a consultant. I also know statisticians and would be happy to refer Jonathon.</p>\n", "parentCommentId": "FWi3C9rkqHWyoe88u", "user": {"username": "Ben_Kuhn"}}, {"_id": "grg66Pw7qEz7b4d7v", "postedAt": "2015-01-07T10:12:12.154Z", "postId": "LjeqMHkYavQsaveh3", "htmlBody": "<p>Makes sense.\nAlso, if the EA survey is redone, that might be an even more important place to have a statistician.</p>\n", "parentCommentId": "N7Zcazj56QQ6QiTLS", "user": {"username": "RyanCarey"}}, {"_id": "z7Y7B7RTR6NPiKkeD", "postedAt": "2015-01-07T16:01:17.043Z", "postId": "LjeqMHkYavQsaveh3", "htmlBody": "<p>If the hook is worth it, how expensive would it be to scale and hard would that be to finance?</p>\n<p>I suppose if the initial pamphlet run is worth it, you could then A-B test it with a Giving Games pamphlet.</p>\n", "parentCommentId": "vBh8cscgSuKcja3DC", "user": {"username": "Peter_Hurford"}}, {"_id": "2DKAzickPby94kRcW", "postedAt": "2015-01-07T16:16:53.037Z", "postId": "LjeqMHkYavQsaveh3", "htmlBody": "<p>I'm fairly surprised the EA movement doesn't have official statisticians.  The EAA movement has a lot of people claiming to be official statisticians.</p>\n", "parentCommentId": "FWi3C9rkqHWyoe88u", "user": {"username": "Peter_Hurford"}}, {"_id": "nKpezwfT2eSg2SS23", "postedAt": "2015-01-07T16:17:43.421Z", "postId": "LjeqMHkYavQsaveh3", "htmlBody": "<p>As someone who did a lot of study design in undergraduate, is currently a &quot;data scientist&quot;, and considers myself smart, I can confirm that I still make approximately 10 huge mistakes every time I run a study.</p>\n", "parentCommentId": "N7Zcazj56QQ6QiTLS", "user": {"username": "Peter_Hurford"}}, {"_id": "f3TwHK3QAamWfgHXp", "postedAt": "2015-01-07T18:59:03.574Z", "postId": "LjeqMHkYavQsaveh3", "htmlBody": "<p>Hey Jonathon, this is a really great initiative!  Giving What We Can is currently in the process of designing an experiment to test the effectiveness of our pamphlets.  We were hoping to run it in London some time late January, early February.  We should coordinate on our experiment design [I will post more details on the forum once we have firmed up details about the experiment design].</p>\n", "parentCommentId": null, "user": {"username": "jonathancourtney"}}, {"_id": "Hex4kLdby8DrAyk8w", "postedAt": "2015-01-07T21:33:23.747Z", "postId": "LjeqMHkYavQsaveh3", "htmlBody": "<p>Yeah, if you give me the contact info of a statistician that you recommend that would be great. I don't know if we have the budget for it, but I would definitely reach out. </p>\n", "parentCommentId": "N7Zcazj56QQ6QiTLS", "user": {"username": "jonathonsmith"}}, {"_id": "xu5EH3mthRQFyguDm", "postedAt": "2015-01-07T21:34:44.756Z", "postId": "LjeqMHkYavQsaveh3", "htmlBody": "<p>That would be great! I'll connect with you on Facebook and we can open up a line of communication there.</p>\n", "parentCommentId": "f3TwHK3QAamWfgHXp", "user": {"username": "jonathonsmith"}}, {"_id": "WRQuFcPDeCuRvi5K7", "postedAt": "2015-01-07T21:41:51.282Z", "postId": "LjeqMHkYavQsaveh3", "htmlBody": "<p>Pretty sharp! If I had seen this before, I definitely would have passed it along to our designer as something to work from.</p>\n", "parentCommentId": "3AxXNEWciMLCfd3Jv", "user": {"username": "jonathonsmith"}}, {"_id": "5uuFZnZGfSuAahZFe", "postedAt": "2015-01-08T01:49:45.257Z", "postId": "LjeqMHkYavQsaveh3", "htmlBody": "<p>I'd consider funding this if it's &quot;worth it&quot; and not too much money.  I'm sure others would as well.</p>\n", "parentCommentId": "Hex4kLdby8DrAyk8w", "user": {"username": "Peter_Hurford"}}, {"_id": "5MhrQP3wwh7JoSSx6", "postedAt": "2015-01-08T03:48:58.186Z", "postId": "LjeqMHkYavQsaveh3", "htmlBody": "<p>I'm checking for people who would be interested in doing it <em>pro bono</em>. If that doesn't work, I'm 99% sure you can find some people to fund a couple consultant-hours.</p>\n<blockquote>\n<p>I don't know if we have the budget for it</p>\n</blockquote>\n<p>Not to put too fine a point on it, but if the alternative is TLYCS designing the experiment themselves, this is pretty much like running a charity that spends nothing on overhead. It looks good on paper, but in reality, that last bit of money is a huge effectiveness multiplier.</p>\n", "parentCommentId": "Hex4kLdby8DrAyk8w", "user": {"username": "Ben_Kuhn"}}, {"_id": "NKw8ZrmZxMT2MAMMj", "postedAt": "2015-01-08T10:56:26.524Z", "postId": "LjeqMHkYavQsaveh3", "htmlBody": "<p>Cool, will the results be public?</p>\n", "parentCommentId": "f3TwHK3QAamWfgHXp", "user": {"username": "Tom_Ash"}}, {"_id": "dkJmRE5o7MnGM8YAC", "postedAt": "2015-01-08T10:56:58.561Z", "postId": "LjeqMHkYavQsaveh3", "htmlBody": "<p>Hi Jonathon, will the results be public?</p>\n", "parentCommentId": null, "user": {"username": "Tom_Ash"}}, {"_id": "nTGpr9azBzuScS2jP", "postedAt": "2015-01-08T12:51:57.557Z", "postId": "LjeqMHkYavQsaveh3", "htmlBody": "<blockquote>\n<p>Ultimately, we’d like to come out of the pilot program with a metric that falls somewhere close to “cost per TLYCS pledger via pamphlets”</p>\n</blockquote>\n<p>I noticed what might be a significant confounder in getting this estimate: you are likely to be particularly enthusiastic/eloquent about the whole thing, which is an extra input which will help the effectiveness of the pamphlets, but is very hard to budget properly on the 'costs' side.</p>\n<p>To account for this, you would probably be better hiring someone else to distribute the pamphlets; probably someone without a deep existing commitment to TLYCS (but some contact should be fine -- the question is whether you could get similarly good people when trying to scale it up).</p>\n", "parentCommentId": null, "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "DzbmvRYqqZQ2e7eFK", "postedAt": "2015-01-08T15:00:50.018Z", "postId": "LjeqMHkYavQsaveh3", "htmlBody": "<p>But if you're going to scale this, you'll probably get LYCS members or EAs to hand out the pamphlets anyway, right? I mean, we kind-of do need more concrete volunteery tasks that we can give to student groups anyway.</p>\n<p>So it's best to get random EAs or LYCS members to do it in the study, right?</p>\n<p>I agree that if the people running the study are also distributing the pamphlets then you end up with bias.</p>\n", "parentCommentId": "nTGpr9azBzuScS2jP", "user": {"username": "RyanCarey"}}, {"_id": "CvoF3cjZXCE5hotAn", "postedAt": "2015-01-08T15:43:09.920Z", "postId": "LjeqMHkYavQsaveh3", "htmlBody": "<p>I wasn't sure what the scaling model was, but if there are enough plausible volunteers then this sounds right.</p>\n<p>The general point is that you want to try and produce a typical case, not a special case.</p>\n", "parentCommentId": "DzbmvRYqqZQ2e7eFK", "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "8cPzXFQ9XaDW4WJYD", "postedAt": "2015-01-08T17:12:09.366Z", "postId": "LjeqMHkYavQsaveh3", "htmlBody": "<p>Hey Tom, not sure about TLYCS's study, but we plan to make ours public (and I imagine they will too!)</p>\n", "parentCommentId": "NKw8ZrmZxMT2MAMMj", "user": {"username": "jonathancourtney"}}, {"_id": "tfhEuFo8JjKaWm28m", "postedAt": "2015-01-09T17:38:43.266Z", "postId": "LjeqMHkYavQsaveh3", "htmlBody": "<p>That is definitely the intention. We are really hoping that the data we gather will be useful to other orgs considering a similar program, which was part of the motivation for posting up here ahead of time to get feedback.</p>\n", "parentCommentId": "dkJmRE5o7MnGM8YAC", "user": {"username": "jonathonsmith"}}, {"_id": "gabXhjpJcp4yFvhWZ", "postedAt": "2015-01-09T17:48:28.806Z", "postId": "LjeqMHkYavQsaveh3", "htmlBody": "<p>This is a really good point. Yeah, the scaling model is to have local TLYCS chapters organizing volunteers to do this as a regular, rolling semester activity. I hadn't really considered myself a confounding variable in this sense, because I'm definitely not a master pamphleteer. I'm an engineer by trade, and if this program takes off, I'll eventually just be another volunteer in the LA area that helps hand out leaflets occasionally. We're also thinking about splitting crews on Friday distribution days - so I would have a crew that hits up two universities, and there would be another volunteer crew hitting up two different campuses. Any thoughts on this?</p>\n", "parentCommentId": "CvoF3cjZXCE5hotAn", "user": {"username": "jonathonsmith"}}, {"_id": "rz3qj4ukaPgXEqqT5", "postedAt": "2015-01-23T11:17:12.395Z", "postId": "LjeqMHkYavQsaveh3", "htmlBody": "<p>After trailing and fiddling to see what works - how much would 20 million copies of a pamphlette aimed at a general audience cost? The post office gives a lot to charity and I can imagine that it wouldn't be impossible to persuade them to send this out as a one off free of charge - at least to the houses they're already posting mail to.. Perhaps different language for different postcodes? Chelsea does not equal Bradford in terms of how appeals might work (religious backgrounds, education levels, size of household, disposable income etc.)</p>\n", "parentCommentId": "f3TwHK3QAamWfgHXp", "user": {"username": "tomstocker"}}]