[{"_id": "nicassCakEk695qFH", "postedAt": "2021-12-02T06:09:25.519Z", "postId": "LKdtHdETxSYAXwoW6", "htmlBody": "<p>I find the lack of transparency that comes along with this problematic. Is there a place where I can read about the reasons for the chance or can you elaborate here so that I can understand the trade-off?</p>", "parentCommentId": null, "user": {"username": "DevonFritz"}}, {"_id": "jSohJLrzdpwmcbCuw", "postedAt": "2021-12-02T07:25:03.688Z", "postId": "LKdtHdETxSYAXwoW6", "htmlBody": "<p>+1. I always assumed that the 'Open' in 'Open Philanthropy' referred to an aspiration for a greater degree of transparency than is typically seen in philanthropy, and I generally support this aspiration being shared in the wider effective altruism philanthropic space. The EA Funds are an amazingly flexible way of funding extremely valuable work – but it seems to me that this flexibility would still benefit from the scrutiny and crowd-input that becomes possible through measures like public reports.</p>", "parentCommentId": "nicassCakEk695qFH", "user": {"username": "jtm"}}, {"_id": "eywEBmgotkNXJjjwJ", "postedAt": "2021-12-02T23:26:34.569Z", "postId": "LKdtHdETxSYAXwoW6", "htmlBody": "<p>We got feedback from several people that they weren't applying to the funds because they didn't want to have a public report.&nbsp; There are lots of reasons that I sympathize with for not wanting a public report, especially as an individual (e.g. you're worried about it affecting future job prospects, you're asking for money for mental health support and don't want that to be widely known, etc.). My vision (at least for the Long-Term Future Fund) is to become a good default funding source for individuals and new organizations, and I think that vision is compromised if some people don't want to apply for publicity reasons.<br><br>Broadly, I think the benefits to funding more people outweigh the costs to transparency.</p>", "parentCommentId": "nicassCakEk695qFH", "user": {"username": "abergal"}}, {"_id": "Q5CacKH3qiTDKSJGN", "postedAt": "2021-12-03T10:27:46.332Z", "postId": "LKdtHdETxSYAXwoW6", "htmlBody": "<p>Thanks for the response.</p><p>&nbsp;</p><p>Is there a way to make things pseudo-anonymous, revealing the type of grants being made privately but preserving the anonymity of the grant recipient? It seems like that preserves a lot of the value of what you want to protect without much downside.</p><p>For example, I'd be personally very skeptical that giving grants for personal mental support would be the best way to improve the long-term future and would make me less likely to support the LTFF and if all such grants weren't public, I wouldn't know that. There might also be people for whom the opposite is true and they wouldn't donate to LTFF because they didn't know such grants were being made. If you said e.g. \"$100K was given out last quarter to support the mental health of individuals\" we'd get what we want, but we'd still have no idea who the recipients are.</p>", "parentCommentId": "eywEBmgotkNXJjjwJ", "user": {"username": "DevonFritz"}}, {"_id": "4jeawqHcLE9P2mE5q", "postedAt": "2021-12-07T07:01:41.768Z", "postId": "LKdtHdETxSYAXwoW6", "htmlBody": "<p>I like this idea; I'll think about it and discuss with others. I think I want grantees to be able to preserve as much privacy as they want (including not being listed in even really broad pseudo-anonymous classifications), but I'm guessing most would be happy to opt-in to something like this.<br><br>(We've done <a href=\"https://forum.effectivealtruism.org/posts/Yosqvz6w9fuc3zjBS/long-term-future-fund-november-2020-grant-recommendations#Anonymous__up_to__40_000\">anonymous grant reports</a> before but I think they were still more detailed than people would like.)</p>", "parentCommentId": "Q5CacKH3qiTDKSJGN", "user": {"username": "abergal"}}, {"_id": "qbZMQJSwz8Lb8ZWtL", "postedAt": "2022-04-02T03:18:45.137Z", "postId": "LKdtHdETxSYAXwoW6", "htmlBody": "<p>Any updates here? I share Devon's concern: this news also makes me less likely to want to donate via EA Funds. &nbsp;At worst, the fear would be this: so much transparency is lost that donations go into mysterious black holes rather than funding effective organizations. What steps can be taken to convince donors that that's not what's happening?</p>", "parentCommentId": "4jeawqHcLE9P2mE5q", "user": {"username": "jayquigley"}}, {"_id": "Sg2cMcbLtFYbKRTd6", "postedAt": "2022-04-04T20:14:57.497Z", "postId": "LKdtHdETxSYAXwoW6", "htmlBody": "<p>(I am the new interim project lead for EA funds and will be running EA funds going forward.)</p><p>I completely understand that you want to know that your donations are used in a way that you think is good for the world. We refer private grants to private funders so that you know that your money is not being used for projects that you get little or no visibility on.</p><p>I think that EA Funds is mostly for donors that are happy to lean on the judgment of our fund managers. Sometimes our fund managers may well fund things like mental health support if they think is one of the best ways to improve the world. LTFF and EAIF in particular, fund a variety of projects that are often unusual. If you don't trust the judgment of our fund managers or don't agree with the <a href=\"https://funds.effectivealtruism.org/scope-and-limitations\">scope</a> of our funds there are probably donation opportunities that might be a better fit for you than EA Funds.&nbsp;</p><p>We try hard to optimise the service for the grantees and this means that we may fall short of building the best service for our donors. We are exploring more donor-focused products with GWWC, that we will hopefully be able to offer soon.&nbsp;</p>", "parentCommentId": "qbZMQJSwz8Lb8ZWtL", "user": {"username": "calebp"}}, {"_id": "YQEagvyHtkmMXkRci", "postedAt": "2022-08-16T22:02:31.508Z", "postId": "LKdtHdETxSYAXwoW6", "htmlBody": "<p>This is extremely troubling. Why in the world would I want to donate to some mystery fund? How can we ensure the money isn't going somewhere we find highly objectionable?</p>", "parentCommentId": null, "user": {"username": "some person"}}, {"_id": "2z6sGXQp2f5coiGHw", "postedAt": "2022-08-16T22:11:46.512Z", "postId": "LKdtHdETxSYAXwoW6", "htmlBody": "<p>See earlier discussion <a href=\"https://forum.effectivealtruism.org/posts/LKdtHdETxSYAXwoW6/public-reports-are-now-optional-for-ea-funds-grantees?commentId=nicassCakEk695qFH\">here</a>.&nbsp;<br><br>(My own takes, speaking only for myself)</p><p>Probably you shouldn't donate to us if you aren't comfortable with trusting our judgements (of which some of the reasoning won't necessarily be public)!&nbsp;<br><br>Other options include a) donating to fund projects within your network that you think are unusually good, b) donating to established organizations that you trust, and c) the newly set-up <a href=\"https://forum.effectivealtruism.org/posts/f7qAfcKArzYrBG7RB/announcing-the-longtermism-fund\">Longtermism Fund</a>.</p>", "parentCommentId": "YQEagvyHtkmMXkRci", "user": {"username": "Linch"}}, {"_id": "beP6DPwacTgk5qziN", "postedAt": "2022-08-17T14:41:34.020Z", "postId": "LKdtHdETxSYAXwoW6", "htmlBody": "<p>I'm fine with trusting your judgement if I can verify what you decided. This provides a mechanism for the donators to express displeasure with your financial decisions.</p><p>&nbsp;</p><p>But this has turned this entire fund into a black box. For all we know you could be giving money to charities run by your friends. Throwing money into a mystery black box is so far from the values of effective altruism.&nbsp;</p><p>How can you honestly tell people that the most effective way to donate their money is to give it to you and totally trust that you will do a good job with it.</p>", "parentCommentId": "2z6sGXQp2f5coiGHw", "user": {"username": "some person"}}, {"_id": "vH6QqL2b5WKsTPXjq", "postedAt": "2022-08-17T14:49:57.812Z", "postId": "LKdtHdETxSYAXwoW6", "htmlBody": "<p>Thanks for sharing your concern!<br><br>The vast majority of projects do not opt-out of public reporting and as a charity, our trustees do have oversight over large grants that we make.<br><br>As Linch said, I do think that this change to our requirements does require you to place some more trust in our grantmakers but I still think, due to the sensitive nature of some of our grants, this is the right call.</p>", "parentCommentId": "beP6DPwacTgk5qziN", "user": {"username": "calebp"}}, {"_id": "Eo6Lpd8Bm7wSyjtFF", "postedAt": "2022-08-17T14:59:03.376Z", "postId": "LKdtHdETxSYAXwoW6", "htmlBody": "<p>Why don't you just add an option for people to donate funds to public reporting only projects?&nbsp;</p><p>I apologize if I'm coming off rude, but I think the reason this has me particularly peeved is that this isn't just some normal charity, this is one of the major charities behind the movement.</p><p>If it turns out that you mismanaged this fund, you are going to tarnish the entire effective altruism movement. This is the type of thing that gets an episode on John Oliver if you mess up.</p>", "parentCommentId": "vH6QqL2b5WKsTPXjq", "user": {"username": "some person"}}, {"_id": "togJ7nyRAHoeZod9H", "postedAt": "2022-08-17T16:15:04.694Z", "postId": "LKdtHdETxSYAXwoW6", "htmlBody": "<p>I think that this would probably be fully funged by other donors as we have a very small number of grants that aren't publicly reported and a relatively small proportion of donors provide the majority of our funding.<br><br>That said <a href=\"https://forum.effectivealtruism.org/posts/3G9w9HfDusFw9LqxQ/ea-funds-donation-platform-is-moving-to-giving-what-we-can\">GWWC now manages the donations</a> side of funds and I can request they add this feature if I see more demand for it (it will create some operational overhead on our side).</p>", "parentCommentId": "Eo6Lpd8Bm7wSyjtFF", "user": {"username": "calebp"}}, {"_id": "EmqJx4hpWjXqumoiL", "postedAt": "2022-08-18T08:55:49.825Z", "postId": "LKdtHdETxSYAXwoW6", "htmlBody": "<p>I'm afraid I find this approach troubling. &nbsp;\"Don't you trust me?\" is the question of the conman. &nbsp;It's not necessary, or desirable, to publish your full reasoning, but it is necessary to properly account for funds which you are ultimately holding on trust. &nbsp;Apart from anything else, the reputational damage if someone were to misappropriate donors' money would be significant.</p>", "parentCommentId": "2z6sGXQp2f5coiGHw", "user": {"username": "RobertJones"}}, {"_id": "RNCBpbrpthcJbzH9d", "postedAt": "2022-08-18T10:32:41.061Z", "postId": "LKdtHdETxSYAXwoW6", "htmlBody": "<p>GWWC's effective charity recommendations page states, \"For most people, we recommend donating through a reputable fund that's focused on effectiveness.\" &nbsp;There follows a list of 8 funds, of which the first 4 are EA funds.</p><p>If your view as EA funds lead is that EA funds are only suitable for donors who personally trust the judgment of your fund managers, then something seems to have gone wrong with the messaging, because \"most people\" won't be in a position to form a view on that.</p><p>I also note that none of the funds list under \"Why you might choose not to donate to this Fund\" that the fund may not account for its donations, which I suspect (as your comment implies) would be a highly material factor to at least some donors. &nbsp;The EA Infrastructure Fund does indicate that a potential donor might not donate if they have concerns about grantmaker independence, but that's not quite the same point, and there's no similar warning for the other funds.</p><p>The difficulty here is that you understand EA Funds as existing for a narrow set of donors (those who are in a position to assess the trustworthiness of individual fund managers). &nbsp;That may well be a sensible thing to exist, but the funds are being marketed as suitable for a much wider class of donors (\"most people\").</p>", "parentCommentId": "Sg2cMcbLtFYbKRTd6", "user": {"username": "RobertJones"}}, {"_id": "Ah4pLtX5y7ioEXoQK", "postedAt": "2022-08-18T21:22:44.079Z", "postId": "LKdtHdETxSYAXwoW6", "htmlBody": "<p>Huh, there does seem to be a communication mismatch. Though I do think the Animal Welfare fund and the Global Health fund are more legible than LTFF.</p>", "parentCommentId": "RNCBpbrpthcJbzH9d", "user": {"username": "Linch"}}, {"_id": "E7h8EAkepRxBHRCb9", "postedAt": "2022-08-18T21:25:14.375Z", "postId": "LKdtHdETxSYAXwoW6", "htmlBody": "<p>I think there's an expectations mismatch here. I think the <a href=\"https://forum.effectivealtruism.org/posts/ddBLtdQjcjvZH5JvF/long-term-future-fund-december-2021-grant-recommendations\">latest public payout report</a> might be helpful for expectations setting.&nbsp;</p><blockquote><h2>Other updates</h2><p>Our grant volume and overall giving increased significantly in 2021 (and in 2022 –&nbsp;to be featured in a later payout report). In the second half of 2021, we applied for funding from larger institutional funders to make sure we could make all the grants that we thought were above the bar for longtermist spending. We received two large grants at the end of 2021:</p><ul><li>$1,417,000 from the <a href=\"https://survivalandflourishing.fund/sff-2021-h2-recommendations\"><u>Survival and Flourishing Fund’s 2021-H2 S-process round</u></a></li><li>$2,583,000 from Open Philanthropy</li></ul><p>Going forward, my guess is that donations from smaller funders will be insufficient to support our grantmaking, and we’ll mainly be relying on larger funders.</p><p>More grants and limited fund manager time mean that the write-ups in this report are shorter than our write-ups have been traditionally. I think communicating publicly about our decision-making process continues to be valuable for the overall ecosystem, so in future reports, we’re likely to continue writing short one-sentence summaries for most of our grants, and more for larger grants or grants that we think are particularly interesting.</p></blockquote>", "parentCommentId": "EmqJx4hpWjXqumoiL", "user": {"username": "Linch"}}, {"_id": "ajnsQB8ZNCvRSecvj", "postedAt": "2022-08-19T15:12:16.975Z", "postId": "LKdtHdETxSYAXwoW6", "htmlBody": "<p>Just FYI, I personally don't donate to LTFF, so while I have some general concern that charitable funds should be spent in an accountable way and that GWWC donors should feel comfortable with how their money is being spent, my personal concern is with GHDF. &nbsp;If the issue of public reports being optional applies only or mostly to LTFF and EAIF, perhaps that could be clarified?</p><p>Luke Freeman did recently email me offering to chat, so I guess I could ask him. &nbsp;I think I can personally solve the problem by redirecting my donations to GiveWell, but I can't be the only person who's troubled by this.</p>", "parentCommentId": "E7h8EAkepRxBHRCb9", "user": {"username": "RobertJones"}}, {"_id": "RpRWRsPL6voppTsFy", "postedAt": "2022-08-19T20:54:07.215Z", "postId": "LKdtHdETxSYAXwoW6", "htmlBody": "<p>I don't really know much about GHDF, sorry. As far as I can tell, it doesn't seem very active and probably not meaningfully different from donating to GiveWell (the fund managers are literally all Givewell staff!)</p>", "parentCommentId": "ajnsQB8ZNCvRSecvj", "user": {"username": "Linch"}}, {"_id": "PsGwS9kquaf44DjjE", "postedAt": "2022-08-19T23:15:24.261Z", "postId": "LKdtHdETxSYAXwoW6", "htmlBody": "<p>Well, I think in the past the managers might use it to fund things that they thought were good but didn't fit with the main GiveWell recommendations, but now that GiveWell have the \"All Funds\" option I'm not sure what would differentiate that from GHDF; it may be that it's just a presentational difference. &nbsp;I'm 85% sure that the GHDF grants are exactly those which are displayed in the GiveWell spreadsheet as having been made via GHDF, but I'm just slightly worried by the notice that payout reports are optional.</p>", "parentCommentId": "RpRWRsPL6voppTsFy", "user": {"username": "RobertJones"}}, {"_id": "2YRQ9S2WnsqnQ7aiq", "postedAt": "2022-08-20T18:40:27.253Z", "postId": "LKdtHdETxSYAXwoW6", "htmlBody": "<p>I totally agree this is really scary. I know you are getting bulk downvoted but I think the average person concerned about the future the planet would be worried that such a large organization is effectively siphoning money into mystery projects while claiming to be a charity.&nbsp;</p>", "parentCommentId": "EmqJx4hpWjXqumoiL", "user": {"username": "some person"}}, {"_id": "gceFoMSr2zuGudGJC", "postedAt": "2022-08-20T18:43:19.522Z", "postId": "LKdtHdETxSYAXwoW6", "htmlBody": "<p>I don't think that argument makes sense. The more money one donates, the more funds will likely be distributed to causes of all types, including private ones. &nbsp;While you can't be certain your specific donation caused an increase in funding to private causes, you can be relatively confident that on average such donations will do so.</p><p>This is just like how you can't guarantee buying meat will kill more animals, but you can be relatively confident it will do so on average.</p>", "parentCommentId": "togJ7nyRAHoeZod9H", "user": {"username": "some person"}}, {"_id": "52SKGt6zv9KE6an9p", "postedAt": "2022-08-21T07:16:07.035Z", "postId": "LKdtHdETxSYAXwoW6", "htmlBody": "<p>I didn't downvote, but I was rather hurt by the implication that my work was con artistry. I spent some time trying to defend myself against the accusation, but realized pretty quickly that it was in practice basically impossible without pretty sophisticated audits and also a bunch of information that I in no way had access to.</p>", "parentCommentId": "2YRQ9S2WnsqnQ7aiq", "user": {"username": "Linch"}}, {"_id": "5fowbdJwkNiB969sX", "postedAt": "2022-09-12T20:49:30.042Z", "postId": "LKdtHdETxSYAXwoW6", "htmlBody": "<p>Doesn't the fact that the information is not sufficiently available to prove that the organization is spending its money in legit ways disturbing to you?&nbsp;</p>", "parentCommentId": "52SKGt6zv9KE6an9p", "user": {"username": "some person"}}, {"_id": "idQ34hgfzuB3H8AHa", "postedAt": "2022-09-13T22:04:35.235Z", "postId": "LKdtHdETxSYAXwoW6", "htmlBody": "<p>No, I have many more important things to worry about, including but not limited to making good grants.&nbsp;</p><p>I assume but have not verified that Effective Ventures and our large funders have access to good auditors.&nbsp;</p><p>At the risk of saying the obvious, to be able to concretely demonstrate whether money is not \"effectively siphoned\", you need to de-anonymize not just the grantees but (much more importantly) all the donors. This is not something most charities do publicly, and AFAICT is typically handled the normal way through having good accountants, auditors, a legal system, etc.</p><p>We are already much more public than the vast majority of institutions (for-profit or non-profit). I don't think \"every person who works part-time in a foundation needs to be able to trace exactly where every dollar comes from or goes every time some person on the internet asks for this\" is a reasonable bar for \"lower than baseline probability of being a con artist.\"&nbsp;</p><p>Taking a step back, I think if this is something that you're very concerned about, it'd be interesting to plan out how to investigate EA charities for fraud. I'm not sure how valuable this work will be, but at least it's plausibly the type of thing that has a reasonably high EV. I assume a good first step is to talk to a representative sample of really good auditors.</p>", "parentCommentId": "5fowbdJwkNiB969sX", "user": {"username": "Linch"}}, {"_id": "toz9djbLzKSxyb5Jp", "postedAt": "2022-09-13T22:21:48.153Z", "postId": "LKdtHdETxSYAXwoW6", "htmlBody": "<p>Put another way, the thing that matters to me is that we actually do good in the world. This is where the bulk of where moral responsibilities lie. As I've said before (on a different topic in the grantmaking context):</p><blockquote><p>Ultimately, nobody said that (consequentialist) morality had to be easy, or fair. It’s the moral patients that ultimately matter, not the feelings of the grantseekers or grantmakers. And if I sacrifice foregone opportunities to make highly impactful grants for the sake of a vague sense of procedural justice, or fairness, then I would be acting wrongly.&nbsp;</p></blockquote>", "parentCommentId": "idQ34hgfzuB3H8AHa", "user": {"username": "Linch"}}, {"_id": "6DNC5agGGhpximxwy", "postedAt": "2022-09-18T21:20:27.921Z", "postId": "LKdtHdETxSYAXwoW6", "htmlBody": "<p>I don't for a moment think that you are a con artist. &nbsp;I suspect that (a) the amounts involved are all small, (b) you genuinely believe that all the grants are effective, (c) mostly you're right but (d) occasionally, in ordinary human frailty, your judgment errs. &nbsp;If that's right, then no real harm is done, but I have no way of verifying any of that, because you don't (as far as I can see) disclose any information at all about the unreported grants.</p><p>I have to say also that you <i>sound</i> &nbsp;like you're saying that you refuse to comply with the law, but as far as I can see, Effective Ventures does in fact comply with the law and publishes a list of its grantees (save for individuals and those receiving grants of less than £25k) within its <a href=\"https://register-of-charities.charitycommission.gov.uk/charity-search?p_p_id=uk_gov_ccew_onereg_charitydetails_web_portlet_CharityDetailsPortlet&amp;p_p_lifecycle=2&amp;p_p_state=maximized&amp;p_p_mode=view&amp;p_p_resource_id=%2Faccounts-resource&amp;p_p_cacheability=cacheLevelPage&amp;_uk_gov_ccew_onereg_charitydetails_web_portlet_CharityDetailsPortlet_objectiveId=A11736106&amp;_uk_gov_ccew_onereg_charitydetails_web_portlet_CharityDetailsPortlet_priv_r_p_mvcRenderCommandName=%2Faccounts-and-annual-returns&amp;_uk_gov_ccew_onereg_charitydetails_web_portlet_CharityDetailsPortlet_priv_r_p_organisationNumber=5026843\">Trustees' Report</a>. &nbsp;But that seems to create a different problem, because the post above ought to make clear that organisations seeking grants in excess of £25k will not be able to remain anonymous, because the grant will be dislosed in the annual accounts &nbsp;(although I believe there is a \"serious prejudice\" exception).</p>", "parentCommentId": "52SKGt6zv9KE6an9p", "user": {"username": "RobertJones"}}, {"_id": "PgY2KR38LZjzDGzWj", "postedAt": "2022-09-19T00:16:47.951Z", "postId": "LKdtHdETxSYAXwoW6", "htmlBody": "<p>I don't know about how this aspect of law works, but does the Trustees's report actually contain all the grants? Based on the <a href=\"https://forum.effectivealtruism.org/posts/diZWNmLRgcbuwmYn4/long-term-future-fund-may-2021-grant-recommendations#David_Krueger____200_000__with_an_expected_reimbursement_of_up_to__120_000\">May 2021 LTFF report</a>, I would expect to see a e.g. significant grant made to the Cambridge Computer Science Department (or similar), but unless I am misreading, or it is labelled counter-intuitively, I don't see it.</p><p>More importantly, I would expect almost-all of the secretive grants to be made to individuals, which sounds like they are excluded from the reporting anyway.</p><p>&nbsp;</p><figure class=\"image\"><img src=\"https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/7812e926f5c99a6416bda9c27b304923a3497a5dca164db2.png\" srcset=\"https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/7812e926f5c99a6416bda9c27b304923a3497a5dca164db2.png/w_110 110w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/7812e926f5c99a6416bda9c27b304923a3497a5dca164db2.png/w_220 220w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/7812e926f5c99a6416bda9c27b304923a3497a5dca164db2.png/w_330 330w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/7812e926f5c99a6416bda9c27b304923a3497a5dca164db2.png/w_440 440w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/7812e926f5c99a6416bda9c27b304923a3497a5dca164db2.png/w_550 550w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/7812e926f5c99a6416bda9c27b304923a3497a5dca164db2.png/w_660 660w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/7812e926f5c99a6416bda9c27b304923a3497a5dca164db2.png/w_770 770w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/7812e926f5c99a6416bda9c27b304923a3497a5dca164db2.png/w_880 880w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/7812e926f5c99a6416bda9c27b304923a3497a5dca164db2.png/w_990 990w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/7812e926f5c99a6416bda9c27b304923a3497a5dca164db2.png/w_1047 1047w\"></figure>", "parentCommentId": "6DNC5agGGhpximxwy", "user": {"username": "Larks"}}, {"_id": "vQRsaJ2qxqjEbegMw", "postedAt": "2022-09-19T04:04:11.443Z", "postId": "LKdtHdETxSYAXwoW6", "htmlBody": "<p>Thanks for the reply!</p><blockquote><p>I don't for a moment think that you are a con artist</p></blockquote><p>Thanks, but maybe you're being too generous here! :) I don't think you should have 0% probability on this; I just think you should basically be at around &nbsp;base rates.</p><blockquote><p>I suspect that (a) the amounts involved are all small, (b) you genuinely believe that all the grants are effective, (c) mostly you're right but (d) occasionally, in ordinary human frailty, your judgment errs. &nbsp;If that's right, then no real harm is done, but I have no way of verifying any of that, because you don't (as far as I can see) disclose any information at all about the unreported grants.</p></blockquote><p>Yep this sounds right. That's why in the parent thread, I was suggesting other more legible places to donate to, for people who care a lot about this.</p><blockquote><p>I have to say also that you <i>sound</i> &nbsp;like you're saying that you refuse to comply with the law</p></blockquote><p>I'm not sure what you're referring to. I apologize for any miscommunication. I don't really handle operational details and I could be wrong about a bunch of stuff.</p><blockquote><p>But that seems to create a different problem, because the post above ought to make clear that organisations seeking grants in excess of £25k will not be able to remain anonymous</p></blockquote><p>I think we typically refer those grants to private funders. This may entail more uncertainty and delays and I apologize as a result.</p><p>(all views my own, not my employers')</p>", "parentCommentId": "6DNC5agGGhpximxwy", "user": {"username": "Linch"}}, {"_id": "MtbynMxExRooyFRqw", "postedAt": "2022-11-15T13:14:09.008Z", "postId": "LKdtHdETxSYAXwoW6", "htmlBody": "<p>So after FTX, how do you all respond to this? Can you maybe see more why we are hesitant to donate to funds that don't say how they allocate the money?&nbsp;</p>", "parentCommentId": null, "user": {"username": "some person"}}, {"_id": "t67JjbPsWxSmShvCR", "postedAt": "2022-11-15T13:15:52.110Z", "postId": "LKdtHdETxSYAXwoW6", "htmlBody": "<p>Now that the whole FTX thing has happened, have you reconsidered your position about the trust the public should have in organizations that don't share the distribution of funds?</p>", "parentCommentId": "eywEBmgotkNXJjjwJ", "user": {"username": "some person"}}, {"_id": "3gKcQYHcKsYEesLyf", "postedAt": "2022-11-15T13:23:08.505Z", "postId": "LKdtHdETxSYAXwoW6", "htmlBody": "<p>I'm sure you really care a lot about this, and I'm sure a bunch of random people online implying you might be part of something shady is upsetting to you. I have no doubt you are doing your best to help the world, which is incredible.&nbsp;</p><p>But do you see how after things like FTX people might be hesitant to donate to funds that don't disclose where the money goes? I understand the motives to make this decision were probably good, but there has to be a better way.&nbsp;</p>", "parentCommentId": "idQ34hgfzuB3H8AHa", "user": {"username": "some person"}}]