[{"_id": "zYYyPYPKQcWKNCT25", "postedAt": "2022-12-16T02:13:10.715Z", "postId": "LmjsyFvQavLQnYSTp", "htmlBody": "<p>This is impressively thorough, thank you! Do any authors have a view on &nbsp;the pandemic prevention externalities of REDD+? The idea is that by reducing deforestation you also reduce the risk of zoonotic spillover. Would this consideration significantly increase broad cost-effectiveness? Should it alter our view of where in the world anti-deforestation efforts should be prioritised?<br>&nbsp;</p>", "parentCommentId": null, "user": {"username": "BenStewart"}}, {"_id": "L9R2hZy5pPqGHeXDf", "postedAt": "2022-12-16T11:24:11.170Z", "postId": "LmjsyFvQavLQnYSTp", "htmlBody": "<p>(Written on a plane to Christmas holidays, so apologies for lack of links, and further engagement being delayed to 2023). Thanks for writing this! I am looking forward to more work on this and to find the best thing in this space, but&nbsp;<strong>I am extremely skeptical of the claim that we do not know anything about how anti-deforestation compares to other things we can fund in climate.&nbsp;</strong><br>&nbsp;</p><p>As my team and I have spent thousands of hours at this point working on what gives rise to relative cost effectiveness in climate (which is what this claim is about) and I also conducted a 50h+ investigation on CfRN and REDD+ in 2020 when reevaluting (we were unable to publish this for organizational reasons, FWIW our estimates where in the upper end of the range cited here and I'd be happy to share in DM), I wanted to explain why (not sorted by importance, but by explanatory logic moving from more outside to more inside view):<br>&nbsp;</p><p><strong>1. First, in some trivial sense, it is of course true that we do not know with 100% certainty</strong>. But the claim that we know nothing about the relative cost effectiveness of anti-deforestation feels akin to the following statements: (a)&nbsp;<i>\"We do not know for certain that giving to the Center for Health Security (CHS) or donating PPE to your local hospital is more effective to reducing biorisk\"&nbsp;</i>, (b)&nbsp;<i>\"We do not know for certain that giving to the Good Food Institute is better to reduce animal suffering than giving to your cat shelter next door\".&nbsp;</i><strong>These statements are trivially true, but I assume almost everyone reading this would feel quite confident in CHS &gt; PPE for local hospitals and GFI &gt; local cat shelter</strong> and would not be distraught by the lack of RCT evidence or unified identical methodology across evaluators.&nbsp;<strong>My tldr point is we should feel the same about this case, because -- like in those cases -- we know a lot about the structure of the problem including philanthropic biases, but also about the effectiveness of different strategies.&nbsp;</strong></p><p>2. The reason for that, to me, seems a Bayesian mindset of&nbsp;<strong>\"what should we believe given the evidence?\"</strong>&nbsp; rather than what are we 100% certain of, a state we will<i> never</i> reach in an intervention space covering decades, uncertain futures, and global human and natural systems.&nbsp;<br><br>&nbsp;</p><p>3. So what is the evidence against ignorance on cost-effectiveness?&nbsp;<strong>At its most outside-view-y the fact that three evaluators that have looked at this independently (FP, SoGive, Giving Green) and none of them has anti-deforestation as their top recommendation is evidence against this</strong>. The fact that FP stopped recommending CfRN is additional evidence of this kind, as is SoGive's work that led EA away from early recs in this space and the recent work by Vasco et al on tree planting cost-effectiveness.&nbsp;</p><p><strong>4. This evidence is stronger when one takes into account significant donor pressures to find anti-deforestation good</strong>. I am sure we could all advise a lot more money if we had rainforest charities in our top recs, the opportunity cost of not recommending in this space is high in terms of advised money. (This is also the main reason I am writing this reply now despite heading out for holidays, I think such a claim of ignorance is quite negative for effective giving in climate because a lot of donors want to believe this as much as Mulder wants to believe in aliens).</p><p><br>&nbsp;</p><p>5. Going one step less meta,&nbsp;<strong>Vasco et al's recent piece</strong> has an appendix that discusses&nbsp;<strong>considerations on what a reasonable prior on this might be</strong>. I am certainly biased in that they rely on our report to form that prior, but I think it gives a good brief overview of the key considerations why one should approach cost-effectiveness of forest-related interventions with skepticism compared to alternatives.</p><p><strong>6. The most important reason against to me seems the utter non-neglectednees of anti-deforestation&nbsp;</strong>(even Republicans like planting trees!). I literally get emails from people I have not talked to in years who know I work in climate that ask me how to save the rainforest. Less anecdotally, natural solutions is one of the largest pots in climate philanthropy and the Bezos Earth Fund and several other for the other largest climate philanthropists have strongly increased giving in this space, so it is not only one of the largest spaces, it is also one of the fastest growing ones. What is more, philanthropy focused on conservation, also including interventions like this, is several X larger than climate philanthropy (last I checked at least 2-3).&nbsp;<strong>This should make one very sceptical to be able to find&nbsp;</strong>(under reasonable search cost, including opportunity cost)&nbsp; <strong>high quality room for funding that would not otherwise be quickly filled&nbsp;</strong><i><strong>unless&nbsp;</strong></i><strong>one has a systematic theory of why all large donors overlook this.&nbsp;</strong>(Maybe such an opportunity exists with small organizations that large donors consider peanuts, but for country level REDD+ this special consideration does not apply). Almost any charity will almost always offer room for funding and a good story so analysis of philanthropy data and donor behavior patterns is crucial to analyze in a space with as much money influx as climate when considering counterfactually adjusted cost-effectiveness which is what we are after.&nbsp;</p><p>7.&nbsp;<strong>More broadly, there has been a multi-decade global effort to find tractable cost effective interventions around avoiding deforestation</strong>. Given the salience of conservation before climate, I assume they preceed climate, but since I am more familiar with climate I will focus on this. Essentially ever since the birth of international climate policy in the early 1990s the international community has tried to solve the problem of rewarding poor countries for taking cheap abatement options, often in the context of forests and with REDD(+) since the early 2000s. Everyone wants this to work, whole governments (Norway in particular) spend enormous resources to make this work.&nbsp;<strong>Yet, as of mid-2020, when I last looked at the literature in depth, I think it was pretty clear this by and large did not work in a way that achieves additional and permanent anti-deforestation</strong>. It's of course possible something fundamentally changed since then but I haven't heard of it despite following climate news pretty closely.</p><p><strong>8. I think we have good reasons to expect this to remain intractable because the two biggest problems in the space are irresolvable.</strong><i><strong>&nbsp;</strong>Permanence</i> can never be guaranteed until we figure out how to construe contracts that bind future governments of sovereign countries.&nbsp;<i>Additionality</i> of avoided deforestation can never be guaranteed until we can run and compare multiple worlds. These are not techical or governance issues that can be solved with better satellites or slightly improved international frameworks, these are deep reasons to be skeptical on the tractability of avoided deforestation vs more tractable strategies.&nbsp;</p><p>9. More subtly but quite importantly<strong>, the effectiveness of investing in anti-deforestation is negatively correlated with its value</strong>, anti-deforestation is least effective in the futures where it would matter most. This is the opposite of what we want, we would want at least robustness (independence of effectiveness and value) and ideally, for lack of a better term, hedginess (positive correlation between effectiveness and value; I discuss this much more in my SERI talk on the structure or climate risk and its implications for high-impact climate philanthropy).</p><p>Much of the uncertainty on cost-effectiveness of anti-deforestation is driven by uncertainty about permanence and additionality, which is arguably related to international and national political conditions. Anti-deforestation via REDD+ will be most cost-effective in futures where international cooperation is good and we get a functioning and, crucially, lasting global anti-deforestation market. These are worlds where the social cost of carbon, the value of additional abatement, is likely quite low because these conditions correspond with good climate progress overall. Conversely, in worlds where additional abatement is particularly valuable, with poor international coordination and low climate policy and lots of energy-intensive growth, REDD+ is unlikely to work. This sounds like an absurdly technical point, but given the shape of climate damage it is actually quite important and it makes reduced emissions in expectation the wrong metric for evaluating climate impact as long as we know something about how different interventions correlate with warming trajectories (and thus marginal value of abatement).</p><p>Crucially, energy innovation as the generally considered most cost-effective intervention (at least naively, when not adjusting for recent crowding), does not have this weakness.&nbsp;<strong>Somewhat roughly, solar will still be relatively cheap when climate policy breaks down, the world forms blocs, and there's lots of energy-intensive growth in emerging economies, but REDD+ will likely fail.&nbsp;</strong><br>&nbsp;</p><p>10. I could go on but this comment is already too long.&nbsp;<strong>To summarize, it seems to me we have all kinds of relevant evidence that should make us quite skeptical of the claim that anti-deforestation is likely to be particularly cost-effective, in particular in relative terms</strong>. It looks bad on&nbsp; the outside view, on neglectedness, it looks bad on tractability and on many more inside-view considerations.&nbsp;<strong>Moreover we do have more evidence than the post grants on the&nbsp;</strong><i><strong>relative</strong></i><strong> cost-effectiveness of other interventions</strong>. Since I first made the argument for innovation advocacy for neglected technologies in EA in 2016/2017 this was vetted by Let's Fund, Founders Pledge (before I joined), SoGive, and Giving Green. The fact that this theory of change / intervention strategy has stood the test of time across evaluators does carry information. While I am not sure it's still the best thing to do on the margin (given how philanthropic additionality is changing, I think it's possible that interventions to avoid carbon lock-in might beat it), it seems very unlikely for all the reasons discussed above that we should be in a state of ignorance when we compare it to REDD+.</p><p>&nbsp;</p><p>I am still curious to see what you find and I think that when one is willing to incur a comparatively very large search cost there might be good things that can be found. But I don't think we are in a state of ignorance until then with regards to what we should expect on its relative cost-effectiveness, especially compared to interventions that have been investigated and found cost-effective by several evaluators.&nbsp;</p><p><br><br><br><br><br>&nbsp;</p>", "parentCommentId": null, "user": {"username": "jackva"}}, {"_id": "PxJYS5RBefYse2XCe", "postedAt": "2022-12-17T00:00:19.659Z", "postId": "LmjsyFvQavLQnYSTp", "htmlBody": "<p>I'm pleased to see more work on REDD+, so thank you for your efforts here. I'd agree that among the \"offset-esque\" options, REDD+ is relatively promising.</p><ul><li><strong>I think this report understates the risks of PES.</strong> I'm willing to believe that PES generated real deforestation benefits when it came to the Jayachandran et al study. However there are some questions about generalisability. Successful implementation of PES requires effective land rights, effective monitoring, reporting and validation, and can be stymied by corruption (several sources have made this point, see e.g. <a href=\"https://www.cifor.org/publications/pdf_files/Books/BAngelsen090210.pdf\">CIFOR</a>). Also I think that readers of this report may believe that all REDD+ interventions are PES, but that's not the case -- several other interventions are also used, including export taxes and regulation of land use. I.e. governments may well be using interventions which have an even weaker evidence base than PES (which might be sensible because of the concerns that I outlined about PES). I think this shows that it's really hard to implement REDD+ well -- some countries do appear to have achieved results, but continued success in this area is not guaranteed.</li><li><strong>Additionality/reference levels -- did you account for the return of Lula?</strong> I liked your observations about the reference levels -- we too share these concerns. I'm sorry if I missed it in your piece, but I would have liked more detail on why you concluded that a range as high as 60%-100% was additional, especially given that the return of Lula in Brazil would likely be good news for forests anyway (even without REDD+).</li><li><strong>You seem more confident than I am that leakage will be solved by jurisdictional REDD+. </strong>There are multiple ways that suppressing deforestation in one place can cause more deforestation to \"leak\"/displace to other areas. Even if some RCTs/studies do find that <i>within-community</i> leakage/displacement did not occur, leakage may still have happened. For example, when we looked into <a href=\"https://forum.effectivealtruism.org/posts/RnmZ62kuuC8XzeTBq/why-we-have-over-rated-cool-earth#Appendix_3__Displacement_risk____more_details\">Cool Earth</a>, we learned that the people who chop down trees often travel from some distance, e.g. in Peru they may have come from the Andean region, and elsewhere they tend to be large multinational companies. To the extent that deforestation is caused by a large multinational company, it seems that some sort of REDD+ would need to be implemented pretty much everywhere, which seems a tall order.</li><li><strong>Failing to continue PES payments is not the only threat to permanence.</strong> Risks include political risks, or risks to REDD+ itself. As we highlighted in our <a href=\"https://forum.effectivealtruism.org/posts/EAii5kf65cvywb2cF/why-we-think-the-founders-pledge-report-overrates-cfrn\">report on CfRN&nbsp;</a> (the organisation which administers REDD+), there are risks to the REDD+ scheme itself -- some countries have expressed concern that they have received only a fraction of the funds promised to them under REDD+. I'm unsure how much those concerns are reduced after Lula's win in Brazil.</li></ul><p>We haven't built a cost-effectiveness model for REDD+ yet (and it may be some time before we do), however I predict ours might end up with numbers that are somewhat less favourable than yours.</p><p>I should also add that it's easy in comments like the one I'm writing to focus on areas of disagreement; I'm sorry if it makes the tone of my comment sound negative! &nbsp;I do think there are lots of useful and valid contributions in this report. Also, although I read through most of this, I didn't carefully read all of it, so it's possible that I've missed some things.</p>", "parentCommentId": null, "user": {"username": "Sanjay"}}, {"_id": "ckf3WPQDxnHRNAm8T", "postedAt": "2022-12-24T11:38:07.802Z", "postId": "LmjsyFvQavLQnYSTp", "htmlBody": "<p>Thanks for this impressive investigation!\ndo you intend to publish it on RP's research page? I'd like to share it with or cite it to people working on deforestation and climate change, and I suspect it'd look more legit for non-EA people if it wasn't on the Forum.</p>\n", "parentCommentId": null, "user": {"username": "Ramiro"}}, {"_id": "iS6NxcAk2eQ3By8SW", "postedAt": "2023-01-04T06:01:50.077Z", "postId": "LmjsyFvQavLQnYSTp", "htmlBody": "<p>Thanks Ramiro! The research article is now up on our website; you can find it <a href=\"https://rethinkpriorities.org/publications/the-redd-framework-for-reducing-deforestation-and-mitigating-climate-change\">here</a>.</p>", "parentCommentId": "ckf3WPQDxnHRNAm8T", "user": {"username": "JamesYHu"}}, {"_id": "EoBdQP6bAWzuYzh6A", "postedAt": "2023-01-06T02:42:03.879Z", "postId": "LmjsyFvQavLQnYSTp", "htmlBody": "<p>Thanks for your engagement with our piece, Ben! We haven’t looked into the zoonotic spillover/pandemic prevention implications of REDD+. Our team’s report doesn’t consider the co-benefits of reducing deforestation that are not already encapsulated in one’s estimated/preferred social cost of carbon (SCC), given the attempt was to constrain the cost of abating a tCO2(e).</p><p>As for a&nbsp;<i>very&nbsp;</i>hasty first pass [not to be taken seriously]: I’m thinking that considering pandemic co-benefits is like saying the social cost of forest carbon (SCFC) &gt; SCC. Then there’s your second point, i.e., that SCFC<sub>region A</sub> &gt; SCFC<sub>region B</sub>. Unfortunately I don’t have a good intuitive sense of these inequalities, nor overall how significant considering the pandemic co-benefit would be for influencing REDD+ regional prioritization. My very rough guess is therefore that the significance – for philanthropists interested in tackling deforestation – would probably depend on (1) the magnitudes of the inequalities, including the frequency/severity of deforestation-induced pandemics, (2) the extent of overlap between forests most prone to pandemic-inducing zoonotic spillover and those with the highest deforestation reduction potential/cost-effectiveness via REDD+, (3) perhaps how promising alternative pandemic prevention strategies are, and (4) maybe even moral weights, risk preferences, and other things I haven’t considered.</p>", "parentCommentId": "zYYyPYPKQcWKNCT25", "user": {"username": "JamesYHu"}}, {"_id": "QQWiEpmntJk6NpKaK", "postedAt": "2023-01-06T16:45:40.025Z", "postId": "LmjsyFvQavLQnYSTp", "htmlBody": "<p>Thanks for your very thoughtful comments, Johannes.</p><p>Please note that we do not have the bandwidth to respond in detail here to each of the 10 points you lay out in your comment (nor to all Forum comments on our reports), but we will do our best to respond to those we find most critical to the conversation and would love to find a time to further discuss these and your remaining points over separate correspondence.</p><p>With regard to the Bayesian mindset to which you allude (“what should we believe, given the evidence?), we agree with this approach. Of course, the evidence in the space of climate economics and policy is vast, so we hope we can agree that this approach is a significant undertaking that would benefit from coordination and collaboration across relevant orgs in EA. Given the vastness and complexity of various climate-relevant literatures, we believe that there is a real risk of jumping to conclusions too hastily, hence our interest in introducing some form of time-efficient peer review process among the major EA climate research organizations.</p><p>Our aim in this project was to summarize and discuss the best evidence we could find on the (cost-)effectiveness of REDD+ over about 8 weeks of two full-time researchers’ time, and to draw reasonable conclusions about the interventions’ potential impact and CE. We do not claim that this research is fully comprehensive and we caveat that it was undertaken early in 2022 (e.g., before the&nbsp;<a href=\"https://time.com/6226932/lula-win-amazon-climate-change-brazil/\"><u>recent presidential election in Brazil</u></a> or the&nbsp;<a href=\"https://www.cfr.org/article/goal-conserve-30-percent-planet-2030-biodiversity-climate#:~:text=During%20the%202022%20UN%20biodiversity,land%20and%20water%20by%202030.\"><u>30x30 agreement</u></a>, the implications of which we have not researched in any depth).&nbsp;</p><p>That said, we do hope that the EA community can use the research as a starting point for coming to a consensus on the CE of REDD+ as a climate intervention. We aim to be quite clear about our main uncertainties in the report and provide some suggestions for how researchers could usefully spend more time. After finding little in the way of comparable estimates in the EA climate literature, we concluded that it would be quite difficult to confidently claim that REDD+ was a relatively cost-effective intervention relative to other climate interventions, and even more difficult when broadening the comparison to global health and development interventions.</p><p>It is very possible that there is more consensus (using a comparably rigorous research approach, with comparable outcome measures) than we are aware of regarding the cost-effectiveness and potential impact of the myriad climate interventions that could plausibly “pass” an ITN shallow review, and that this EA consensus would be compatible with broader climate expert consensus. However, many of the EA-recommended climate charities we came across were related to climate advocacy, where cost-effectiveness estimates are understandably difficult to pin down given extreme sensitivity to modeler assumptions and relatively short-term political contexts, making direct comparison or ranking quite difficult.&nbsp;</p><p>We hope to discuss how to improve intervention comparability with you and others in the EA climate space in the near future! If there is indeed such consensus and comparability, perhaps we could collaborate to compile this information for ease of comparison, and we will update our report accordingly.</p><p>On the subject of neglectedness, the Bezos Earth Fund is indeed focused on natural climate solutions, though they have committed (i) “only” $10B over 10 years (where we anticipate RFMF an order of magnitude larger — and&nbsp;<i>annually</i> — over the next ten years for REDD+), and (ii) not specifically to the REDD+ framework, to our knowledge.&nbsp;</p><p>Regarding your point about historic REDD+ not having achieved additionality and permanence, we refer you to the report, where we largely agree with this perspective and hence recommend a focus on&nbsp;<i>jurisdictional</i> REDD+ programs that are gaining significant momentum, as well as continuous results-based payments for the entire duration of the desired avoided emissions. We also touch on reasons we expect additionality and permanence concerns to diminish going forward.&nbsp;</p><p>Finally, we have recently begun to consider whether it may make sense to recommend various options for different “types” of potential donors in the climate space (also for risk diversification). As you suggest, it is possible that a whole lot of potential philanthropic dollars are not being allocated (or are being allocated to other causes) due to donors’ preferences for near-term / more certain vs. long-term / more risky solutions, or for carbon savings alone vs. perhaps lower carbon savings with significant (human, gender, biodiversity, other) co-benefits, etc. Unless those potential philanthropic funds otherwise get allocated toward other high-impact charities (i.e. not “the cat shelter next door”, which seems plausible for individuals desiring near-term, tangible impact), neglecting to provide donation recommendations that align with donor preferences represents a missed opportunity for impact.</p><p>We have written some additional (and generally more specific) responses to some of your points, which we look forward to discussing with you in separate correspondence. Thanks again, and looking forward to continuing the conversation!</p><p><br>&nbsp;</p>", "parentCommentId": "L9R2hZy5pPqGHeXDf", "user": {"username": "Greer Gosnell"}}, {"_id": "GiRegaDypRD9Sq5zC", "postedAt": "2023-01-06T16:46:41.414Z", "postId": "LmjsyFvQavLQnYSTp", "htmlBody": "<p>Thanks, Sanjay. Generalizability is indeed crucial, and we discuss the conditions for success of jurisdictional REDD+ (JR+ hereafter), including things like effective political incentives to avoid issues around property rights and corruption (see subsection “Political leaders need incentives to follow through”), as well as the need for effective MRV (see section “REDD+ measurement, reporting, and verification (MRV) standards are thorough but not yet sufficient to adequately account for forest degradation”), though we acknowledge that there is much additional research that could be done to understand these issues across various contexts. We (like the experts with whom we spoke) see reason for optimism in the recent advances toward JR+, technological advances in improving data collection and improving MRV, and improvements in certification in light of the very issues you mention. We also suggest that funding toward programs that aim to improve the likelihood of JR+ success along these dimensions could be worth researching, though we did not ourselves explore any such programs.</p><p>As mentioned in the response to Johannes, we conducted most of this research in the beginning of 2022 (i.e. many months before the Brazilian election). However, the lowest-cost opportunities according to the&nbsp;<a href=\"https://www.mckinsey.com/~/media/mckinsey/business%20functions/sustainability/our%20insights/why%20investing%20in%20nature%20is%20key%20to%20climate%20mitigation/nature-and-net-zero-vf.pdf\"><u>WEF and McKinsey (2021) report</u></a>, on which we rely heavily for our CE estimates, are not in Brazil, so we imagine the change in the political landscape would not substantively change our general stance that JR+ appears cost-effective and there is RFMF to get it off the ground. The return of Lula may actually improve the prospects for JR+, given the difficulty of achieving its ends without political buy-in.</p><p>Indeed, we also make the point that efforts to expand the coverage of JR+ are crucial for preventing leakage. And we did not come across much in the way of countries threatening to abandon REDD+ due to lack of prompt payment in our research, though we would definitely be interested to hear more about this if you have some sources you could share, and we agree that Lula’s recent election will likely change the political rhetoric in the Brazilian context.</p><p>Indeed, we were more pessimistic about REDD+ when we started the research for many of the reasons that you and others have expressed skepticism, and rightfully. We hope the report adequately justifies our own stance. And of course, we are very open to comparing CE models and outcomes - please reach out if you do build such a CEA!</p>", "parentCommentId": "PxJYS5RBefYse2XCe", "user": {"username": "Greer Gosnell"}}, {"_id": "zSyXo4Xrqk5t8RhkQ", "postedAt": "2023-01-18T12:08:08.445Z", "postId": "LmjsyFvQavLQnYSTp", "htmlBody": "<p>Sorry I don’t have the capacity to dig into all the sources but it would be helpful to understand:</p><ul><li><strong>Are your end results per year or forever?</strong> You say \"<i>we conclude with our best guess of cost-effectiveness, which ranges from $6 to $62 per tonne of CO2 (tCO2) abated with 80% confidence. </i>\" but is this $6-60 every year or is this a one off payment of $6-60 and then that land is never deforested? This makes a huge diffenrce to understanding so good to be explicit.</li><li><strong>Do you have an estimate for tCO2 per hectare?</strong> The costs per hectare (e.g. in the Ugandan study) seem similar than you costs per tCO2, but there are like 500 tCO2 per hectare so confused about how you are converting one to the other.</li></ul><p>Thank you so much for any clarity you can give.&nbsp;</p>", "parentCommentId": null, "user": {"username": "weeatquince"}}]