[{"_id": "A8wpaGqxH6xNreokq", "postedAt": "2023-05-23T11:31:10.273Z", "postId": "Lna7SayJkyrKczH4n", "htmlBody": "<p>Is this still an impacts market? Looks to me that this is primally just a fundraising platform. I'm not complaining. I think EA should have a fundraising platform! I'm just confused.</p>", "parentCommentId": null, "user": {"username": "Linda Linsefors"}}, {"_id": "Msp9AptJmTdf4qy4y", "postedAt": "2023-05-23T13:08:26.791Z", "postId": "Lna7SayJkyrKczH4n", "htmlBody": "<p>Hiii! Thanks! Yeah, what’s a market and what isn’t… I’m used to a rather wide definition from economics, but we did briefly consider whether we should use a different or sub-brand (like ranking.impactmarkets.io or so) for this project.</p><p>The idea is that, if all goes well, we roll out something like the carbon credit markets but for all positive impact via a three-phase process:</p><ol><li>In the first phase we want to work with just the donor impact score. Any prizes will be attached to such a score and basically take the shape of follow-on donations. This is probably a market to the extent that Metaculus is a market. They say <a href=\"https://www.metaculus.com/help/faq/#predmarket\">“sort of” and prefer the term “prediction aggregator.” </a>So maybe we’re currently an impact aggregator.</li><li>In the second phase, we want to introduce a play money currency that we might call “impact credit” or “impact mark.” The idea is to reward people with high scores with something that they can transfer within the platform so that incentives for donors will be controlled less and less by the people with the prize money and increasingly by the top donors who have proved their mettle and received impact credits as a result. We’ll start moving in that direction if we get something like 100+ monthly active users. Metaculus would probably consider this an “impact market” and Manifold Markets even has it in its name. But rebranding away from “market” and then maybe rebranding back towards “market” a year later seemed unwise to us.</li><li>Eventually, and this brings us to the third phase, we want to understand the legal landscape well enough to allow trade of impact credits against dollars or other currencies. We would like for impact credits to enjoy the same status that carbon credits already have. They should function like generalized carbon credits. I think at this point the resulting market will be widely considered a literal “market.” This is much more of a long-term vision though.</li></ol><figure class=\"image\"><img src=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/Msp9AptJmTdf4qy4y/mn8oo9p9hofjhe3yeor3\" alt=\"Phases\"></figure>", "parentCommentId": "A8wpaGqxH6xNreokq", "user": {"username": "Telofy"}}]