[{"_id": "fiCmXkup8CF3ibSRi", "postedAt": "2022-11-23T21:55:17.344Z", "postId": "LNbzDCgCH2py3cnJv", "htmlBody": "<p>I'm &nbsp;confused why almost all of the comments seem to be from people donating to many charities. For small amounts that an individual would donate, I don't imagine that diminishing marginal returns would kick in, so shouldn't one donate entirely to the charity that has the highest EV on the current margin? &nbsp;</p>", "parentCommentId": null, "user": {"username": "thomas-larsen"}}, {"_id": "7iNkJ4v9taPq7SRHo", "postedAt": "2022-11-23T22:20:23.907Z", "postId": "LNbzDCgCH2py3cnJv", "htmlBody": "<p>The&nbsp;<a href=\"/posts/F4DxPrfmnEtEwhPJu/levels-of-donation\">Levels of Donation</a>&nbsp;post contains lots of good advice on the same.</p>", "parentCommentId": "fiCmXkup8CF3ibSRi", "user": {"username": "satpathyakash"}}, {"_id": "ma6iZxKMdbgzSyM55", "postedAt": "2022-11-23T22:58:36.520Z", "postId": "LNbzDCgCH2py3cnJv", "htmlBody": "<p>I expect that figuring out the highest EV charity is very noisy, such that it doesn't make that big a difference. And that doing this makes giving more emotionally satisfying and fun, which is great! (At least for me personally, this is the case). It also makes the amount of good done lower variance, which seems emotionally good.</p>\n<p>I basically agree that on utilitarian grounds it's somewhere between totally irrelevant and slightly negative though, and definitely not a good use of effort.</p>\n", "parentCommentId": "fiCmXkup8CF3ibSRi", "user": {"username": "Neel Nanda"}}, {"_id": "feiRudaYqtBLLmD2w", "postedAt": "2022-11-24T06:02:22.274Z", "postId": "LNbzDCgCH2py3cnJv", "htmlBody": "<p>In practice, \"the charity that has the highest EV on the current margin\" is more complicated than you may realize; see e.g. <a href=\"https://forum.effectivealtruism.org/posts/CuuCGzuzwD6cdu9mo/methods-for-improving-uncertainty-analysis-in-ea-cost#1_3_Uncertainty\">Section 1.3</a> of froolow's post on incorporating uncertainty analysis in cost-effectiveness modeling, showing how any of GiveWell's (older list of) top charities could be highest EV given reasonable assumptions:</p><figure class=\"image\"><img src=\"https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/673ed0645ed9eeed480910a306ae4358879dec0d354dbec4.png\"></figure><p>and when:</p><figure class=\"image\"><img src=\"https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/df0a0f68035244efd956d9cfe1ae9eda69b64675b0f705ee.png\"></figure><p>I think it's also worth noting that GiveWell's CEAs don't actually calculate CE on the margin, and not the marginal impact of the donor's dollar but of all dollars generated by the donated dollar via leverage/funging (2nd bullet point in the <a href=\"https://forum.effectivealtruism.org/posts/6dtwkwBrHBGtc3xes/a-critical-review-of-givewell-s-2022-cost-effectiveness#4_2_Errors\">Errors section</a>); I was confused by this when I first tried to replicate (one column of) GW's AMF CEA.&nbsp;</p><p>Another reason is just bets-hedging. It's probably unwise to put all one's eggs in one basket, not just due to theoretical considerations like moral uncertainty but operational considerations as well, like whether the organization can deliver on the forecasted impact next year (as someone directly impacted by the recent fiasco this is front-of-mind).</p><p>I'm also personally torn between EV-maxing and risk aversion. The former suggests donating to longtermist charities and the latter to GiveDirectly; I care that I have some impact as much as(?) I care about the opportunity cost of missing out on more impact. This is a little like how I think about personal investing, although in the latter case risk aversion is greater.&nbsp;</p><p>Frankly this may just be me failing to find the right numbers or something, but I'd be curious to know if you yourself have identified any single charity you consider highest-EV on the margin (not historical EV), and what that EV number is (and preferably a link to how it's calculated).</p>", "parentCommentId": "fiCmXkup8CF3ibSRi", "user": {"username": "Mo Nastri"}}, {"_id": "BeygJF2AfsSRsT4Nb", "postedAt": "2022-11-24T16:27:30.241Z", "postId": "LNbzDCgCH2py3cnJv", "htmlBody": "<p>&nbsp;What would be a good place to donate to support organizations hurt by the FTX collapse? EA Funds?</p><p>Edit: More discussion here: <a href=\"https://forum.effectivealtruism.org/posts/xqfjevoDHvvRjPcPo/how-should-small-and-medium-sized-donors-step-in-to-fill\">https://forum.effectivealtruism.org/posts/xqfjevoDHvvRjPcPo/how-should-small-and-medium-sized-donors-step-in-to-fill</a></p><p>BTW I’m not necessarily endorsing donating to such a place, but if such a place existed and provided information about which organizations could benefit, it could affect donation decisions.</p>", "parentCommentId": null, "user": {"username": "thmt"}}, {"_id": "YFv8q4yqusPvfway3", "postedAt": "2022-11-26T10:44:23.595Z", "postId": "LNbzDCgCH2py3cnJv", "htmlBody": "<p>I don't now. This is worth a question on its own. <a href=\"https://forum.effectivealtruism.org/posts/L4S2NCysoJxgCBuB6/announcing-nonlinear-emergency-funding\">Nonlinear</a>  is providing emergency funding and mentions donation opportunities, and <a href=\"https://forum.effectivealtruism.org/posts/HPdWWetJbv4z8eJEe/open-phil-is-seeking-applications-from-grantees-impacted-by\">Open Philanthropy</a> is looking for applications for funding.<br>\nI don't know if the EA Funds are donig anything to support organizations or individuals who lost funding due to the FTX collapes. IIRC they haven't pubished anything about whether they do, and I would not assume they do.</p>\n", "parentCommentId": "BeygJF2AfsSRsT4Nb", "user": {"username": "Imma Six"}}]