[{"_id": "vxLdbY8pctySrGeHg", "postedAt": "2023-05-16T23:18:10.851Z", "postId": "LnDkYCHAh5Dw4uvny", "htmlBody": "<p>This seems awesome!</p><p>How does Probably Good differentiate itself from 80k hours? I'd love to know your competitive advantage :)</p><p>~ Saul</p>", "parentCommentId": null, "user": {"username": "Saul"}}, {"_id": "5nLHSshZLFeQRSyj2", "postedAt": "2023-05-17T11:32:17.933Z", "postId": "LnDkYCHAh5Dw4uvny", "htmlBody": "<p>Thanks for asking!</p><p>There are a few ways we distinguish ourselves, and hopefully complement 80K’s work.</p><ul><li>Though the cause areas we care about are not mutually exclusive, we often focus on different cause areas (e.g. we’ve done a lot of work in global health and development, and have a talk about this work at EAG London - you’re welcome to come to the talk to hear more).</li><li>We aim to cater to a broader audience in terms of worldviews, geographic diversity, and educational background.</li><li>There are many differences in how we approach career advice, the most significant is that we are a lot more uncertain about things (as indicated by the name Probably Good) - this influences how we make recommendations, how we engage with advisees, what career paths we're open to, and more.</li></ul><p>Finally, and most importantly, it’s worth noting that we believe that impact-focused career advice is an incredibly large and important field, so we think it's good to have multiple teams taking different approaches to it. Hence our primary drive for our work at Probably Good is not to be different from 80K (who are great and have been both an inspiration and a huge help in the creation of Probably Good), but rather to do more without necessarily trying to be similar.</p><p><br>&nbsp;</p>", "parentCommentId": "vxLdbY8pctySrGeHg", "user": {"username": "omernev@gmail.com"}}, {"_id": "tDANdFBbAnEfvSmba", "postedAt": "2023-05-17T13:35:07.141Z", "postId": "LnDkYCHAh5Dw4uvny", "htmlBody": "<p>Exciting!<br>When I'm pointing people to career advising, is your one-on-one advising aimed mostly at early career people? At this point do you expect to take advisees who are mid- or late-career?</p>", "parentCommentId": null, "user": {"username": "Julia_Wise"}}, {"_id": "J3M66L4HgG5SndH8C", "postedAt": "2023-05-17T18:04:20.739Z", "postId": "LnDkYCHAh5Dw4uvny", "htmlBody": "<p>Thanks for asking, Julia. Initially, we expect to accept a pretty wide range of people, across both age/experience levels and cause areas as we're exploring how these consultations can be as impactful as possible. Having said that, we intend to use information gathered during this process, along with insights from the community &amp; affiliate orgs around neglected segments/user groups, to inform if and how we ought to specialize.</p><p><br>&nbsp;</p>", "parentCommentId": "tDANdFBbAnEfvSmba", "user": {"username": "vaishnav"}}, {"_id": "vLWA2DEafKohNS4rz", "postedAt": "2023-05-18T03:41:14.575Z", "postId": "LnDkYCHAh5Dw4uvny", "htmlBody": "<p>Great answer! Thank you :)</p>", "parentCommentId": "5nLHSshZLFeQRSyj2", "user": {"username": "Saul"}}, {"_id": "vdWt3PG2YYX6CWTBm", "postedAt": "2023-05-22T15:18:48.449Z", "postId": "LnDkYCHAh5Dw4uvny", "htmlBody": "<p>Could you expand on your final bullet point please? What are the other significant differences and could you please be a bit more specific about how this changes your approach?</p>\n", "parentCommentId": "5nLHSshZLFeQRSyj2", "user": {"username": "jooke"}}]