[{"_id": "dpXWQBnxjzxmhzx6T", "postedAt": "2023-12-28T08:20:30.191Z", "postId": "LnsAhwr7TnYy5NeXH", "htmlBody": "<p>Thanks for sharing your reflections here!\nI was rather taken aback when reading the headline and remain so after reading your \"What I think\" section:</p>\n<p>You write that you're \"glad the BWC exists,\" but also that you're \"weakly against the BWC.\" Did I understand correctly that you mean that you're glad that the legal agreement exists but are weakly against supporting or engaging in work to uphold the convention (at least the kind of work that is currently undertaken with that aim)? If so, could you explain whether you think that the durability and strength of the agreement is largely unaffected by such work; or that such work has value but less value than alternative efforts; or that such work has value but should be left to \"others\" (maybe: \"non-EA-minded people\" who are less focused on reducing unconventional risks)?</p>\n<p>Whatever the answer to the above, I'm somewhat concerned by the normative effects of the phrasing you chose, and would be curious to hear your thoughts on those concerns. What I worry about is that your title and parts of the write-up suggest that the BWC and its surrounding structure is bad, is a waste of resources, and should thus be dismantled, or at least neglected even more than it already is. I share your sentiment that it's good to have the BWC as some backstop against state development of biological weapons programmes; and I believe that this backstop works mostly through normative means (rather than some material enforcement mechanism). I further believe that such normative measures consist of how the BWC is spoken about (whether it is taken seriously, appreciated as important, etc) and of dedicated events to bring together relevant stakeholders (i.e. those people who might contribute to upholding and further developing the convention). The concern is that articles like yours contribute to undermining both.</p>\n", "parentCommentId": null, "user": {"username": "Sarah Weiler"}}, {"_id": "Lg3FaCYofigmiYqjy", "postedAt": "2023-12-28T08:36:17.505Z", "postId": "LnsAhwr7TnYy5NeXH", "htmlBody": "<p>Thanks, useful thoughts, I think I roughly agree with you and will change this. I suppose the tradeoff I was facing with the title (not that I spent any time weighing up different options consciously) is between brevity, accurateness, and interestingness. I think the more complete title would be something like 'Updating weakly against the Biological Weapons Convention being as important to work on as I thought'. I think I will change the title to 'Reflections on the BWC' so that people who only see the title don't get a negative vibe (I agree we want people overall to think good thoughts about the BWC). And then if people are interested enough to read the post, they will see that I raise, quite sloppily/intuitively, some drawbacks. More than me arguing the BWC is -10 on some scale of goodness, what I was thinking is it moved from +20 to +10 or something.</p><p>I haven't thought about it lots but I think I would endorse something like 'the BWC should continue to exist, and should be larger and bigger and better, but it is less of a central priority than I thought, and so people who care about prioritisation and don't have individual reasons that the BWC is unusually good for them should strongly consider focusing more on something else'.</p>", "parentCommentId": "dpXWQBnxjzxmhzx6T", "user": {"username": "Oscar Delaney"}}, {"_id": "DhoGunSDyRbdW6N68", "postedAt": "2023-12-28T12:27:02.670Z", "postId": "LnsAhwr7TnYy5NeXH", "htmlBody": "<p>Thanks for writing this, I enjoyed reading your thoughts!</p>\n", "parentCommentId": null, "user": {"username": "Angelina Li"}}, {"_id": "pS9NJpZxuetYnaiJo", "postedAt": "2023-12-28T16:16:25.214Z", "postId": "LnsAhwr7TnYy5NeXH", "htmlBody": "<p>First, thanks for writing this up. I mostly agree with the points being made, but I disgree with some of the conclusions.<br><br>Yes, the BWC is dysfunctional, and yes, it's unlikely to materially reduce bioweapon risk below the (currently low) levels they are at today. But, as you say, it's better for it to exist than not. I think the counterfactual here is critical. If we look at the BWC compared to other weapon bans, it's somewhat weaker than the IAEA, though arguably stronger than the NPT, and it's weaker than the CWC, though chemical weapons are used more. On the other hand, it's far stronger than the ban on landmines, the ban on exploding / fragmenting bullets, etc. And one difference is obvious, and in my view central - having an annual meeting where states come to recommit and discuss progress on a ban.</p><p>I also think it's good to have junior people attend, to give them experience with international systems. It's a cheap convention compared to running something elsewhere focused on biorisks, and it serves that purpose well.<br><br>Additionally, the BWC is also a place (the only place?) for experts to inform State representatives and the international community of emerging risks - a function which I worry will be tested in coming years, and could be critical.&nbsp;<br><br>Lastly, it's very good for states and NGOs to continue to use as a Schelling point. It has become a key place for announcing efforts towards reducing risks, which are planned beforehand in order to announce them there, and which are motivated in part because there is a place to talk about them.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Davidmanheim"}}, {"_id": "FxtuSufxBmMvSmhLA", "postedAt": "2023-12-28T21:58:03.259Z", "postId": "LnsAhwr7TnYy5NeXH", "htmlBody": "<p>Thanks good points, I don't think we disagree directionally, perhaps just on how important some of these effects are. It feels like a very difficult epistemic problem to attribute how much the relative absence of bioweapons use is attributable to the BWC - I know roughly nothing about exploding bullets and the like, but maybe they are just more useful than bioweapons for most belligerants? And therefore are used more irrespective of how strong the relevant treaties are.\nBut yes, agree that these aspects still provide some value :)</p>\n", "parentCommentId": "pS9NJpZxuetYnaiJo", "user": {"username": "Oscar Delaney"}}, {"_id": "4oiu8Qo3n8i3YwDuy", "postedAt": "2023-12-31T08:33:32.604Z", "postId": "LnsAhwr7TnYy5NeXH", "htmlBody": "<p>Yeah, I don't think there's a ton of benefit it trading hypotheticals and counterfactuals here, especially because I don't think much of anyone's intutions will be conveyed clearly, but I do think it's worth noting that it's not obvious to me that the convention didn't have a large counterfactual impact over the past 50 years.</p>", "parentCommentId": "FxtuSufxBmMvSmhLA", "user": {"username": "Davidmanheim"}}, {"_id": "KXWS9KdADDb6PjLZf", "postedAt": "2024-01-27T03:04:19.425Z", "postId": "LnsAhwr7TnYy5NeXH", "htmlBody": "<p>I was part of a youth delegation to the BWC in 2017, and I think the greatest benefit I got was that it <a href=\"https://marginalrevolution.com/marginalrevolution/2018/10/high-return-activity-raising-others-aspirations.html\">raised my aspirations</a>. I'm not sure I'd previously conceived of myself as the sort of person who could speak at the UN. I also heard an expert bowing out of dinner early because they had to go finish their slides for the next day, and realized there isn't some upper echelon of governance and society where everyone is hypercompetent and on top of things; even at the friggin' <em>United Nations</em> people are making their slides the night before.</p>\n<p>I don't know how much of an effect this had on my decision to start a biosecurity meetup the next year and eventually transition to full-time biosecurity work, but I think it played a role. There are other benefits too; Schelling-point NGO networking, collecting lived-experience stories that make your understanding of diplomacy more vivid, and creating a pressure of prior consistency that increases the chance of that a delegate will continue to work on biosecurity (YMMV on whether the last item is a benefit).</p>\n", "parentCommentId": null, "user": {"username": "tessa"}}, {"_id": "cjBjCFCKHEvadreag", "postedAt": "2024-01-28T09:29:25.478Z", "postId": "LnsAhwr7TnYy5NeXH", "htmlBody": "<p>Thanks for sharing, yes motivational benefits do seem important too!</p>", "parentCommentId": "KXWS9KdADDb6PjLZf", "user": {"username": "Oscar Delaney"}}]