[{"_id": "h8mxKMqeGQirqs9fs", "postedAt": "2023-10-11T12:17:08.579Z", "postId": "LNwKNLsKQoFJikkpR", "htmlBody": "<p>Cool post; researching these issues seems like one of the most important things in AI governance to me!</p><p>Some questions I have (for future research) are:</p><ol><li>How hard is it to distinguish approved from unapproved training runs with these snapshots that the chips would provide? Is this just about establishing that the length of the training run is below a certain threshold, or does it assess whether the training run follows a previously submitted recipe that was approved to be safe by an authorizing body?&nbsp;</li><li>How long would it take to implement these mechanisms at the hardware level, and who would have to be on board to make this happen? (E.g., if the US govt simply passed legislation that prohibited future chip innovation unless these machanisms are installed, would that be enough to get it done?)</li></ol>", "parentCommentId": null, "user": {"username": "Lukas_Gloor"}}, {"_id": "sh4dvpgnvWtEoqdqN", "postedAt": "2023-10-11T13:18:58.253Z", "postId": "LNwKNLsKQoFJikkpR", "htmlBody": "<p>Thanks for your comment &amp; questions! These are great questions for further research. I don't know enough to comment on the first question. But as for the second, we're lucky that right now, the advanced chip supply chain has multiple tight bottlenecks, and is largely controlled by US-allied advanced democracies (Taiwan, Korea, Japan, Netherlands, UK, US, etc). This is part of why the US was able to effectively cut off China's access to obtaining the most advanced chips. So there is a window of opportunity, where the most important countries could agree to require their companies to implement this framework, and require certain buyers to comply with the framework as well. Countries generally can require their companies to manufacture a certain way, and can also set import/export restrictions on chips to ensure transactions are compliant.&nbsp;</p>", "parentCommentId": "h8mxKMqeGQirqs9fs", "user": {"username": "Damin Curtis"}}]