[{"_id": "AMyA6ZZwKk4tnTvPs", "postedAt": "2023-12-20T19:49:23.065Z", "postId": "LqMiyLTy7gZ6vbWoo", "htmlBody": "<blockquote><p>At best, low-responsibility, low-social-downside giving now feels not as effective as it could be. At worst, this giving behavior makes me feel like a self-inhibited, intentionless, incomplete person.</p><p>Concretely, I think I will halt recurring donations. I want to give in bulk, less frequently, more thoughtfully, and perhaps not to recognisable charities. If this feels like it goes against the spirit of the Giving What We Can Pledge, then I will exit the pledge.</p></blockquote><p>&nbsp;</p><p>Thanks for writing this bit; it mirrors my own thinking on my personal donation allocation as I've spent more time in the core EA ecosystem. While I was working at Google, sending a yearly donation to Givewell's top charities seemed reasonable; now I have a much better handle on what opportunities may be more effective.</p><p>In fact, your regranting process seems reminiscent of early EA. Pre-Givewell, Holden &amp; Elie spent a bunch of time investigating orgs themselves and made judgement calls about where to send their money. In contrast, EA donations today are characterized by a lot of deference to other experts and evaluators (Givewell, OpenPhil, ACE etc); I like the regranting captures some of the original spirit of the movement.</p>", "parentCommentId": null, "user": {"username": "akrolsmir"}}, {"_id": "2ivxyX8CCrwx5dLEb", "postedAt": "2023-12-20T19:57:46.716Z", "postId": "LqMiyLTy7gZ6vbWoo", "htmlBody": "<blockquote><p>I expect more quickly diminishing returns within the grantmaking of a given regrantor than I would for a more centralized operation. This is principally because independent regrantors have more limited deal flow, making their early grants look unusually strong.</p></blockquote><p>&nbsp;</p><p>I think this could become true eventually; but imo currently, most of our small ($50k) budget regrantors could effectively allocate $200-$500k/year budgets. Eg you mentioned earlier that many opportunities of the form \"start this great org\" require &gt;$50k; also, many regrants on Manifund include a statement like \"I would give more here if I could but my budget is limited\".</p><p>I also want to note that the overall regranting model can easily scale by adding additional regrantors; we've received a lot of inbound interest in becoming regrantors despite little outreach, and many highly-trusted EA folks (even some grantmakers!) appreciate the greater flexibility offered by the regranting model.</p>", "parentCommentId": null, "user": {"username": "akrolsmir"}}, {"_id": "zzWgbsipdNwkRybBq", "postedAt": "2023-12-20T20:02:19.461Z", "postId": "LqMiyLTy7gZ6vbWoo", "htmlBody": "<blockquote><p>It really was a time-suck, and I really have experienced the relating point in the past! But I loved putting time into Manifund instead of reading yet another decision-irrelevant post.</p></blockquote><p>&nbsp;</p><p>Happy to hear you enjoyed your time regranting! I'd love to get a quick estimate on how much time you spent as a regrantor, just for the purposes of our calibration. My napkin math: (8 grants made * 6h) + (16 grants investigated * 1h) = 64h?</p>", "parentCommentId": null, "user": {"username": "akrolsmir"}}, {"_id": "ePKYRbgAPhcvdNvbK", "postedAt": "2023-12-20T22:59:45.748Z", "postId": "LqMiyLTy7gZ6vbWoo", "htmlBody": "<p>I feel quite able to give &gt;$500k/year. I also think more money would make a lot more \"just completely fund the thing\" instead of people throwing $1000-2000 for \"signal boosting\" or hoping others come along to fund the thing.</p><p>I feel I could do similar and even larger amounts for the animal welfare space.</p>", "parentCommentId": "2ivxyX8CCrwx5dLEb", "user": {"username": "MarcusAbramovitch"}}, {"_id": "2wRh5achrcr3zxGSW", "postedAt": "2023-12-21T08:52:36.468Z", "postId": "LqMiyLTy7gZ6vbWoo", "htmlBody": "<p>Like <a href=\"https://forum.effectivealtruism.org/users/marcusabramovitch?mention=user\">@MarcusAbramovitch</a> , I'd feel pretty comfortable allocating ~$1m part-time. I mean just on my existing grants I would've been happy to donate another ~$150k without thinking more about it! Concrete &gt;$50k grants I had to pass up but would otherwise have wanted to fund total &gt;$200k (extremely rough). So I'm already at &gt;$400k (EDIT: per 5 months!) without even thinking about how my behavior or prospective grantee behavior might have changed if I had a larger pot.</p><p>That said, I think there's a sense in which I hit strongly diminishing returns at ~$10k, albeit still above-bar. The Robert Long grant was by far my best, and I knew from day 0 that I wanted to make it. After that, a bet on me became a bet on my taste, not a bet on my private information, which seems less exciting. (Again I'm optimistic that the past 5 months was an unusually low-private-information period for me, but you see my point.)</p><p>And I'm somewhat skeptical that others had $200k-$500k/year of productive grants to make. To me it's a bad sign that &gt;30% of Manifund funding went to 3 projects (MATS, Apollo, and LTFF) that I wouldn't think especially benefit from the regranting model.</p>", "parentCommentId": "2ivxyX8CCrwx5dLEb", "user": {"username": "joel_bkr"}}, {"_id": "owropxN5JtDR9NcZw", "postedAt": "2023-12-21T09:11:26.309Z", "postId": "LqMiyLTy7gZ6vbWoo", "htmlBody": "<p>I think my estimate isn't going to be very informative -- I intentionally spent more time than I might otherwise endorse working on Manifund stuff, because it was fun and seemed like good skills-building. My best guess as to how much time I would have spent on an otherwise similar process in the absence of this factor is (EDIT: there was a mistake in my BOTEC) <a href=\"https://www.squiggle-language.com/playground?v=0.8.6#code=eNqVUtFOwzAM%2FBWrT4MK2DrtBYknfqOSFVq3jZY6UepSJsS%2Fk3RrRSe2wWt8d7475zMpqVK9kVdbUvKcqG6PjqwzhJX16KmwbUtcKtGWO3iBLYiFzTpn%2BnDGekKlsWg0K%2BycKiggdhOipE7XjM7b2qsWBy1NEGTFAbSJoG3ODRmnuUbbC1ppKK4MaBbr47YswnY5t7orsJO%2BqlAaJVjqkgVri4oPQ2DRT2fB27syvRI6ORNl9gvr0%2FjN69HNtGYeBFlpoi8yXdReP46QLIqLbil05HH0iYPXgdC7EXVcEVHHYUuKg0zVG3PASb2M%2BceWst0sGBOG9xv9p3Ch9hQut53C1ZZTuNnu7PIUIXgJXlc5A6w28ATXwt7BPfx2j%2FT%2F7OO5JuIDrLJb7AV9cdSc4%2BwaeQ69vHP8lpe%2BwN8EJ4Hx5CmcF3t6Oduac%2FL1DVfmWyI%3D\">59 (42 to 85) hours</a>.</p>", "parentCommentId": "zzWgbsipdNwkRybBq", "user": {"username": "joel_bkr"}}, {"_id": "5ENoDviFuuPqEYtaM", "postedAt": "2023-12-26T12:09:58.771Z", "postId": "LqMiyLTy7gZ6vbWoo", "htmlBody": "<blockquote>\n<p>Manifund funding went to... LTFF</p>\n</blockquote>\n<p>This is explained by LTFF/Open Philanthropy doing the imho misguided matching. This has the effect of diverting funding from other places for no clear gain. A lump sum would have been a better option</p>\n", "parentCommentId": "2wRh5achrcr3zxGSW", "user": {"username": "NunoSempere"}}, {"_id": "iEMjmRXhycrtBJeNf", "postedAt": "2023-12-26T23:59:51.645Z", "postId": "LqMiyLTy7gZ6vbWoo", "htmlBody": "<p>Fair enough, I agree.</p>\n", "parentCommentId": "5ENoDviFuuPqEYtaM", "user": {"username": "joel_bkr"}}]