[{"_id": "Xbpf2nw3yr8tmsfLP", "postedAt": "2023-08-09T13:26:44.208Z", "postId": "LSzHmdCdsFieMXLcL", "htmlBody": "<p>Thanks for sharing this! Good points here too:</p><blockquote><p>I find it interesting how he says that there is no such thing as AGI, but acknowledges that machines will \"eventually surpass human intelligence in all domains where humans are intelligent\" as that would meet most people's definition of AGI.</p><p>I also observe that he has framed his responses to safety on \"How to solve the alignment problem?\". I think this is important. It suggests that even people who think aligning AGI will be easy have started to think a bit more about this problem and I see this as a victory in and of itself.</p></blockquote><p>I've been pretty confused by LeCun. I think he has seen AI do useful things to manage misinformation at Facebook so he's annoyed when people claim the risk model from AI is misinformation generation, which is fair. But then he suffers from a massive failure in imagination when it comes to every other risk model.&nbsp;<br><br>He seems to think: \"We don't have to worry about alignment, because we align humans to be nice moral people and governments to be good via laws!\" But this is just obviously silly: look at how many people hurt other people and how many governments have awful laws (that people break all the time anyway)! Not sure what's not clicking with him when his own analogies fall apart with 1 second of reflection.&nbsp;</p>", "parentCommentId": null, "user": {"username": "AbbyBabby"}}, {"_id": "EcKHCdwTsA72zcJoB", "postedAt": "2023-08-09T21:47:08.421Z", "postId": "LSzHmdCdsFieMXLcL", "htmlBody": "<p>I'm truly, deeply baffled by Yann LeCun's bizarre pronouncements about AI safety.&nbsp;</p><p>He talks about AI safety and alignment issues as if he's simply too stupid to understand the 'AI Doomer' concerns (including those shared by most EAs.) &nbsp;But he's clearly not stupid in terms of general intelligence -- his machine learning work has been cited over 300,000 times, with an h-index of 143 (which is very, very high).&nbsp;</p><p>So, is this just motivated reasoning by someone with very deep professional and financial incentives to promote AI capabilities research? His position as a Vice President, and Chief AI Scientist at Meta, suggests that he might have too much 'skin in the AI game' to be very critical. And yet, many other leading AI researchers and AI company CEOs have expressed serious concerns about AI extinction risk -- despite their skin in the game.</p><p>Anybody have any insights into why LeCun is so dismissive about AI X risk?</p>", "parentCommentId": null, "user": {"username": "geoffreymiller"}}, {"_id": "m5nrorvLyyHQ2bDFS", "postedAt": "2023-08-10T00:47:18.697Z", "postId": "LSzHmdCdsFieMXLcL", "htmlBody": "<p>Isn't it the case that lots (in raw numbers, not %) of smart people believe irrational things (e.g. religion, health, climate, politics) all the time? When you consider the size of the AI field, there was going to be at least one LeCun right?</p>", "parentCommentId": "EcKHCdwTsA72zcJoB", "user": {"username": "Yanni Kyriacos"}}, {"_id": "NwrDGfwwNbqkdjckp", "postedAt": "2023-08-10T15:31:14.600Z", "postId": "LSzHmdCdsFieMXLcL", "htmlBody": "<p>Yeah, fair point. But most such irrational beliefs tend to be somewhat outside smart people's fields of personal expertise. And smart people tend to update if they're exposed to a lot of skeptical feedback -- which LeCun has been, on Twitter. Yet he's dug in his heels, and become even more anti-safety in recent months.</p><p>Maybe in the grand scheme his personal views don't matter much. But to a psychologist like me, his behavior is both baffling and chilling.</p>", "parentCommentId": "m5nrorvLyyHQ2bDFS", "user": {"username": "geoffreymiller"}}]