[{"_id": "5f6E656NscWPgQFgX", "postedAt": "2014-09-26T12:41:10.231Z", "postId": "LwmEr3B9dpBrFq3du", "htmlBody": "<p>This is awesome! I'm going to try this out next time I get to explain effective altruism to someone.</p>\n<p>(I originally wrote &quot;have to explain,&quot; but in the spirit of this article I rewrote it as &quot;get to&quot; before posting.)</p>\n", "parentCommentId": null, "user": {"username": "Benquo"}}, {"_id": "oRyAXZyvr2ReFSX7A", "postedAt": "2014-09-26T13:26:01.101Z", "postId": "LwmEr3B9dpBrFq3du", "htmlBody": "<p>This is absolutely so important.  There is huge outreach potential for effective altruism into the mainstream.  Millions of people would love to make the world a better place, and backing a movement full of vibrant young people doing exactly that using evidence and reason - well that is simply brilliant.  Most older people will not want to get involved in the technical conversations - I have heard it distilled as &quot;Go-Compare for charities&quot; (and there involvement will therefore will not disrupt the heart of the EA community to respond to an oft quoted concern) but correctly positioned would be really interested in the sheer genuine, palpable, cut out the nonsense goodness of it - such a refreshing breath of fresh air in a cynical world.</p>\n<p>The conclusion of the Oxford Martin Commission having studied the big problems of the world for many years  were that at core of these  problems is not something out there beyond us, as most of the big problems they identify having fairly clear solutions.   The biggest problems are within us and systemic - short termism, selfishness and a narrow perspective.</p>\n<p>The long term, cosmopolitan, and altruistic perspective of Effective Altruism is the perfect antidote for these problems, it just needs to go viral!</p>\n<p>If EAs say deontological a bit less (particularly in talking to the mainstream) and be excited a bit more I believe that Effective Altruism can not only be one of the most exciting but one of the most important movements in the world. </p>\n", "parentCommentId": null, "user": {"username": "DavidRooke"}}, {"_id": "ibZ24G7WEm7Jq96qG", "postedAt": "2014-09-26T17:10:17.144Z", "postId": "LwmEr3B9dpBrFq3du", "htmlBody": "<p>Having grown up as one of those people who figured &quot;can't succeed, don't try&quot; with regards to large problems, I think this is really a fantastic point that I hadn't considered expressing this way. I think lots of people like who currently think like I did could be swayed if the message could get through to them that they can indeed change the world for the better.</p>\n", "parentCommentId": null, "user": {"username": "Marcus_A_Davis"}}, {"_id": "kB3g886vkKMTXr9dW", "postedAt": "2014-09-27T02:55:58.150Z", "postId": "LwmEr3B9dpBrFq3du", "htmlBody": "<p>Nothing seems as fulfilling in terms of meaning than participating in the narrative of those who truly did their best to make the world a better place by the most effective means possible, and helped others participate too! </p>\n", "parentCommentId": null, "user": {"username": "Diego_Caleiro"}}, {"_id": "H8W6vaYnKpEPX7iw5", "postedAt": "2014-09-27T14:00:34.019Z", "postId": "LwmEr3B9dpBrFq3du", "htmlBody": "<p>Great, very inspirational post! I'll direct people interested in the EA movement to this. </p>\n<p>I think we should write more articles like this (and/or encourage other media to do so - perhaps journalists should be invited to next year's EA retreat/summit). For instance, we could write articles on individuals and or/groups within the EA movement who personify the sentiments that you're expressing here. Concrete examples and personal, vivid stories that appeal to System 1 have a great persuasion power. </p>\n", "parentCommentId": null, "user": {"username": "Stefan_Schubert"}}, {"_id": "e5KceQbq9LPr48wSf", "postedAt": "2014-09-27T20:01:04.051Z", "postId": "LwmEr3B9dpBrFq3du", "htmlBody": "<p>Great article, thank you!   I have just recently in the last 6 months decided to focus on how to live with altruistic purpose.   I've decided that for myself, I can do the most good by developing a for profit business that has a meaningful social cause.    the cause I will focus on, that is most dear to me, is in sponsoring international orphans with disabilities to be adopted into loving homes here in the USA.    Specifically, we will sell retail product, but donate 50% of all profits to sponsoring children, one at  time.   We have already identified an international adoption agency to partner with and we are finalizing all other aspects of the business for a planned November 23rd launch.   I would be interested to know what other social mission businesses have been launched by contributors to this forum so I can learn from your success....and failures! 8-)  </p>\n", "parentCommentId": null, "user": {"username": "GRAFD"}}, {"_id": "Ehve8n8jitqdBBETa", "postedAt": "2014-09-28T17:17:11.433Z", "postId": "LwmEr3B9dpBrFq3du", "htmlBody": "<p>Great post, and definitely agree we should focus on this more.</p>\n<p>Another thing I personally find exciting about effective altruism is that the question &quot;How do I do the most good?&quot; (with my career, money etc.) is a really motivating, intellectually challenging question to spend my time thinking about. So for those who enjoy spending their time thinking about interesting questions, effective altruism offers an environment in which to discuss one of the most important and stimulating questions out there - that's pretty exciting to me. I would imagine at least some others feel similarly.</p>\n", "parentCommentId": null, "user": {"username": "Jess_Whittlestone"}}, {"_id": "ebe8WSJiHYSAHZvRu", "postedAt": "2014-10-03T00:19:48.402Z", "postId": "LwmEr3B9dpBrFq3du", "htmlBody": "<p>Hey, this is fantastic! But I did want to point to something that helped me a lot, which <a href=\"http://lesswrong.com/lw/6z/purchase_fuzzies_and_utilons_separately/\">purchase fuzzies and utilons separately</a>. Personally, I find the most emotionally compelling cause to be euthenasia rights. I'm horrified by the fact that we are literally torturing people with terminal diseases for no reason. Despite how strongly I feel about this, I realized that this wasn't where I was able to have the highest impact. It is hard to propagate the feelings I have about this cause towards causes I &quot;know&quot; are superior in impact, but it is something I strive to do on an ongoing basis.</p>\n<p>Don't let worry about this discourage you though. Doing something even with uncertainty is ALWAYS better than doing nothing just because of uncertainty.</p>\n", "parentCommentId": "e5KceQbq9LPr48wSf", "user": {"username": "RomeoStevens"}}, {"_id": "i4ZWrWn6CceRiP2ny", "postedAt": "2014-11-17T04:02:00.996Z", "postId": "LwmEr3B9dpBrFq3du", "htmlBody": "<p>Speaking of the possibility that individuals can have much bigger impact than is often considered and speaking of the fact that this is very exciting:</p>\n<p>Consider a story that very well might be true: &quot;Vlad the Astrophysicist&quot;: <a href=\"https://www.youtube.com/watch?v=l9bCFNN67wg\">https://www.youtube.com/watch?v=l9bCFNN67wg</a></p>\n<p>The thought that each of our actions now might be able to change whether our civilization is a common <em>psht!</em>[1] or a rare <em>psshht!!!</em>[2] or even conceivably a <em>psssssssssssssssssshhhh...</em>[3] is incredibly exciting. </p>\n<p>[1] <em>Psht!</em> = A civilization that quickly (say, in another 5,000, 50,000 or 5 million years after the level of development of our present civilization) causes itself to go extinct.</p>\n<p>[2] <em>Psshht!</em> = A civilization that continues to thrive for many million years, long enough to spread across an entire galaxy or even meet another civilization arising elsewhere in the universe).</p>\n<p>[3] <em>Psssssssssssssssssshhhh...</em> = A civilization that continues to thrive indefinitely, until the end of time if there is an end, or literally indefinitely if there is no end.</p>\n<p>And don't forget the possibility that our actions not only may be able to vastly increase the amount of time our civilization flourishes, but also may be able to vastly increase the <em>quality</em> of that flourishing. That's incredibly exciting too.</p>\n", "parentCommentId": null, "user": {"username": "WilliamKiely"}}, {"_id": "ZvXsAJi5MdtDNrDRg", "postedAt": "2023-12-12T23:14:26.232Z", "postId": "LwmEr3B9dpBrFq3du", "htmlBody": "<p>\"Growing up, it felt like the message I got from society was: one person just can't do much.\"</p><p>I relate and it's sad how often I hear people say that. I was reading Hari's \"Lost Connections\" when I had a Big aha moment; I thought I need to find my tribe, a community. That investigation led me to eventually find this community. I am floored by how many people are exploring ways to do good better.</p>", "parentCommentId": null, "user": {"username": "Richard_Leyba_Tejada"}}, {"_id": "QcYH4xtq3i98Qqjbx", "postedAt": "2024-01-04T07:30:43.053Z", "postId": "LwmEr3B9dpBrFq3du", "htmlBody": "<p>Hi Kaj, enjoyed the post!&nbsp;<br><br>I just wanted to ask if you might consider changing the \"his\" in \"by donating a measly 10% of his income\" to \"their\", noting that there are no other gendered references in the post. Maybe I'm being a little pedantic but I think I'm always quite eager to make sure women feel as at home in EA as I do!&nbsp;</p>", "parentCommentId": null, "user": {"username": "Mitchell Laughlin"}}, {"_id": "Yiy6oWekjGWHXHYaK", "postedAt": "2024-01-07T09:01:24.741Z", "postId": "LwmEr3B9dpBrFq3du", "htmlBody": "<p>Thanks for noticing that! These days I would always use \"their\" in this kind of context, but I guess I didn't yet have that habit back in 2014. Edited.</p>", "parentCommentId": "QcYH4xtq3i98Qqjbx", "user": {"username": "Kaj_Sotala"}}]