[{"_id": "H9jk4fdKoQntzKMbP", "postedAt": "2022-11-27T18:34:23.985Z", "postId": "LWN6qFhCtPDEJJpeG", "htmlBody": "<p>Hi Vasco,</p><p>Thanks so much for all the effort put into attempting to do this calculation. I really appreciate it!</p><p>I have one main question &nbsp;(+ a meta comment) around the calculation of the cost-effectiveness of OM:</p><p>In the <a href=\"https://docs.google.com/document/d/1eB2jzpeqlcQ2p-vgmJe1CJNi4-R6ODUEmosZaHbp9bM/edit?usp%3Dsharing#\">email </a>you sent you asked for <i>\"(I_OM / C_OM) / (I_A / C_A), where:</i></p><ul><li><i>I_OM is the expected loss of impact due to one randomly selected person in operations management working 1 hour less.</i></li><li><i>C_OM is the expected hourly rate of one randomly selected person in operations management.</i></li><li><i>I_A is the expected loss of impact due to one randomly selected person working 1 hour less.</i></li><li><i>C_A is the expected hourly rate of one randomly selected person.</i>\"</li></ul><p>What impact metric is meant by I? I read through your post, but maybe I missed something...</p><p>It would've helped a lot to see this information in the post itself to follow <a href=\"https://www.openphilanthropy.org/research/reasoning-transparency/\">reasoning transparency</a>.</p>", "parentCommentId": null, "user": {"username": "CristinaSchmidtIbáñez"}}, {"_id": "WKNykiodjZFFeJmbC", "postedAt": "2022-11-27T19:26:40.011Z", "postId": "LWN6qFhCtPDEJJpeG", "htmlBody": "<p>Hi Cristina,</p><p>Thanks for the kind words!</p><blockquote><p>What impact metric is meant by I?</p></blockquote><p>Good point. I have not mentioned what is meant by impact. Some thoughts:</p><ul><li>It depends on one's moral views, but I guess leaving it undefined was a fine way of accounting for <a href=\"https://forum.effectivealtruism.org/topics/moral-uncertainty\">moral uncertainty</a>. People presumably gave their estimates based on their moral views.</li><li>In practice, each organisation has its own heuristics for impact. For Against Malaria Foundation, it may be the number of distributed bednets. For a research organisation, it may include the quantity and quality of publications. More generally, success in the objectives and key results of the organisation would be an indication of producing impact.</li></ul><blockquote><p>In the <a href=\"https://docs.google.com/document/d/1eB2jzpeqlcQ2p-vgmJe1CJNi4-R6ODUEmosZaHbp9bM/edit?usp%3Dsharing#\">email </a>you sent you asked for <i>\"(I_OM / C_OM) / (I_A / C_A)</i></p></blockquote><p>I would say I did not exactly ask people to use that formula. I asked:</p><blockquote><p>For both [organisation] and the effective altruism community, I would be happy to know your best guesses for the ratio between the expected marginal cost-effectiveness of:</p><ul><li>Operations management positions.</li><li>All positions.</li></ul></blockquote><p>Then, I gave that formula as as example:</p><blockquote><p>One example way of estimating the ratio is from (I_OM / C_OM) / (I_A / C_A)</p></blockquote><p>Only 3 people explicitly used this formula (in agreement with the tables of <a href=\"https://forum.effectivealtruism.org/posts/LWN6qFhCtPDEJJpeG/cost-effectiveness-of-operations-management-in-high-impact#Multiplier_of_operations_management_in_high_impact_organisations\">this</a> section).</p><blockquote><p>It would've helped a lot to see this information in the post itself to follow <a href=\"https://www.openphilanthropy.org/research/reasoning-transparency/\">reasoning transparency</a>.</p></blockquote><p>Thanks for the feedback. I thought linking to it was fine, as the formula was just a suggestion intended to illustrate what I meant by ratio between the expected marginal cost-effectiveness of operations management and all positions.</p>", "parentCommentId": "H9jk4fdKoQntzKMbP", "user": {"username": "vascoamaralgrilo"}}, {"_id": "LzmZFtczefu5XsECt", "postedAt": "2022-11-27T23:57:29.293Z", "postId": "LWN6qFhCtPDEJJpeG", "htmlBody": "<p>Hey there! Really appreciate you doing work on this!&nbsp;</p><p>As someone who is not well-versed in cost-effectiveness analysis, but is very keen learning about this work - could you make the summary a bit more accessible? When reading it I was like: 1) what the hell is bp/g$&nbsp;</p><p>(I know there is a wiki page linked, but I think most people don't want to click on hyperlinks during the reading of a summary, they just want to decide whether to commit to reading the post.&nbsp;</p><p>After I checked the wiki link I realised bp means 0.0001 but after a quick glance I'm still unsure what giga is (note that I'm writing this comment at 1 am, so the fault can definitely be mine)</p>", "parentCommentId": null, "user": {"username": "CBConfessions"}}, {"_id": "kzCXFBuB6Etceaq7g", "postedAt": "2022-11-28T07:18:21.949Z", "postId": "LWN6qFhCtPDEJJpeG", "htmlBody": "<p>Hi CB,</p><p>Thanks for asking, and being keen to learn about this work!</p><p>I understand this notation may not be the most easily comprehensible at first sight. Using it more often will arguably make it more understandable in the long-run.</p><p>As you say, 1 bp = 0.01 % = 0.0001. 1 G = 10^9, so 1 G$ means 1 billion dollars.</p><p>I see this is your 1st comment. Welcome to the EA Forum!</p>", "parentCommentId": "LzmZFtczefu5XsECt", "user": {"username": "vascoamaralgrilo"}}, {"_id": "rvPYc4Zkyhm5eix7k", "postedAt": "2022-11-28T20:33:45.223Z", "postId": "LWN6qFhCtPDEJJpeG", "htmlBody": "<p>thanks!</p>", "parentCommentId": "kzCXFBuB6Etceaq7g", "user": {"username": "CBConfessions"}}, {"_id": "WcfeGLvoHGZhJzpkx", "postedAt": "2022-11-29T00:47:47.878Z", "postId": "LWN6qFhCtPDEJJpeG", "htmlBody": "<p>Really interesting post. Not to hijack it, but I didn't know about the EA Forecasting &amp; Epistemics Slack. Can you point me to info on it or how to join?</p>\n", "parentCommentId": null, "user": {"username": "MaxGhenis"}}, {"_id": "WygqL5skDtMzkNd9e", "postedAt": "2022-12-14T12:13:11.705Z", "postId": "LWN6qFhCtPDEJJpeG", "htmlBody": "<p>Out of curiosity, what programs did you use for your calculations? Squiggle, sheets, other?</p>", "parentCommentId": null, "user": {"username": "ChanaMessinger"}}, {"_id": "W8H5FDWCFygazPDTq", "postedAt": "2022-12-14T22:28:59.902Z", "postId": "LWN6qFhCtPDEJJpeG", "htmlBody": "<p>Hi Chana,</p><p>I used <a href=\"https://colab.research.google.com/drive/1CP51w0JvKW-0ZFHQQu65Pf4K2YIW1AkJ?usp=sharing\">this</a> Colab. The link was in the section Methods, but I have added a sentence to the Summary with it such that it is more visible now. Thanks.</p>", "parentCommentId": "WygqL5skDtMzkNd9e", "user": {"username": "vascoamaralgrilo"}}, {"_id": "mzdTpM9NrLJvMkL2H", "postedAt": "2022-12-14T22:30:42.359Z", "postId": "LWN6qFhCtPDEJJpeG", "htmlBody": "<p>Sorry, missed that! Thanks so much.</p>\n", "parentCommentId": "W8H5FDWCFygazPDTq", "user": {"username": "ChanaMessinger"}}, {"_id": "8746KbridfqGdeaDC", "postedAt": "2022-12-14T22:37:31.450Z", "postId": "LWN6qFhCtPDEJJpeG", "htmlBody": "<p>Thanks, Max!</p><p>Regarding the Slack, from <a href=\"https://forum.effectivealtruism.org/posts/TfPdb2aMKzgWXFvc3/announcing-squiggle-early-access#Is_there_an_online_Squiggle_community_\">here</a> (I appreciate it is not the most visible place; I do not know whether there is more information elsewhere):</p><blockquote><p>There's some public discussion on&nbsp;<a href=\"https://github.com/quantified-uncertainty/squiggle/discussions\">Github</a>. There's also a private EA/epistemics Slack with a few channels for Squiggle; message Ozzie to join.</p></blockquote><p>I guess you can reach to Ozzie <a href=\"https://forum.effectivealtruism.org/users/oagr\">here</a>.</p>", "parentCommentId": "WcfeGLvoHGZhJzpkx", "user": {"username": "vascoamaralgrilo"}}, {"_id": "fg6jTjvF6q2DBPhtx", "postedAt": "2023-02-13T12:03:31.538Z", "postId": "LWN6qFhCtPDEJJpeG", "htmlBody": "<p>So coming back and looking at this, one central mystery is: why is the multiplier so high? Some possible answers might be:</p><ul><li>Possible answer #1: Operations people are the engine of EA. They make shit happen, which is what ultimately results in impact. EA should raise operations salaries.</li><li>Possible answer #2: Operations *positions* are valuable, but operations people are easy to find and easily replaceable, which is why salaries are generally lower than for other positions. Thus, although creating organizations which can deploy operations people is very valuable, operations people themselves are not that valuable.</li><li>Possible answer #3: Something else.</li></ul><p>I'm also confused about whether operations roles are all similar enough that they can be modelled the same way.</p><p>So if I was working more on this, I'd probably:</p><ul><li>put some thought about what is happening here, qualitatively, before continuing with the quantitative estimates.</li><li>Also, because of simplicity, I'd probably stop at estimating the impact of ops as a multiplier, which could then be combined with specific estimates for specific &nbsp;organizations, rather than combining multipliers with broad cause area factors. That would be more work, though.</li><li>&nbsp;</li></ul>", "parentCommentId": null, "user": {"username": "NunoSempere"}}]