[{"_id": "FRojBknqxaQyDh8o7", "postedAt": "2022-11-24T05:03:49.346Z", "postId": "LwNtycdY6C6PzWybx", "htmlBody": "<p>I don't blame people for thinking this doesn't really fit on the forum, but I don't understand the downvotes for a heartfelt post from an EA who is facing a terrible situation.</p>\n<p>Best wishes. It's incredibly hard to do what you do, and I wouldn't blame you for giving up, so it's really admirable that you keep going.</p>\n", "parentCommentId": null, "user": {"username": "therealslimkt"}}, {"_id": "umn7izECSwZoCnFNM", "postedAt": "2022-11-24T09:44:36.069Z", "postId": "LwNtycdY6C6PzWybx", "htmlBody": "<p>Hi emmannaemeka, I don't know how best to respond to this, but please know that you have my sympathies for you in this situation. I often read news of terrorism and kidnapping in Nigeria, and it is a terrible thing to see. I admire that you resist against this and continue providing education!</p>", "parentCommentId": null, "user": {"username": "Matt g"}}, {"_id": "h5DKJpjnXFpF3qDYL", "postedAt": "2022-11-24T11:22:16.919Z", "postId": "LwNtycdY6C6PzWybx", "htmlBody": "<p>Thanks for your kind words. I really do need them. The state of things are not really looking good at the moment. Life of students are at risk. The university is shut down at a particular time. The students can’t get quality education. I am looking for ways to help my students not to miss out despite the insecurity. Thank you once again</p>\n", "parentCommentId": "umn7izECSwZoCnFNM", "user": {"username": "emmannaemeka"}}, {"_id": "w8S7M2znyCrzrSaZ7", "postedAt": "2022-11-24T11:26:33.165Z", "postId": "LwNtycdY6C6PzWybx", "htmlBody": "<p>Thanks for your kind words. For those that found this offensive, I am sorry. I felt overwhelmed by the current situation of things. The other day a student was killed on campus, another raped. Gory sights. What will you do when you see this  as passion I.e Impacting knowledge. Yet there is little or nothing to do to help this current situation. Hence the overwhelming feeling.  Maybe EA can consider taking the issue of education of students at risk as a cause.</p>\n", "parentCommentId": "FRojBknqxaQyDh8o7", "user": {"username": "emmannaemeka"}}]