[{"_id": "WpQEAYNi8MXHBMZX7", "postedAt": "2024-03-02T19:21:34.503Z", "postId": "LX9wGhZnCdLuXHPih", "htmlBody": "<blockquote><p>EA's culture of ideological purity and (seemingly <a href=\"https://forum.effectivealtruism.org/posts/LX9wGhZnCdLuXHPih/how-ea-can-be-better-at-communications\">intentional</a>) obfuscation from the public sets itself up for backlash.</p></blockquote><p>The link goes to this article itself. Curious what you were trying to link to.</p>", "parentCommentId": null, "user": {"username": "Habryka"}}, {"_id": "vFodDXCF9thA8cbnM", "postedAt": "2024-03-02T19:25:22.479Z", "postId": "LX9wGhZnCdLuXHPih", "htmlBody": "<p>fixed thanks</p>\n", "parentCommentId": "WpQEAYNi8MXHBMZX7", "user": {"username": "blehrer"}}, {"_id": "PLGryovpYT6rmDHLQ", "postedAt": "2024-03-03T03:00:18.636Z", "postId": "LX9wGhZnCdLuXHPih", "htmlBody": "<p>\"An OpenAI program director, who has very little to actually do with this larger public debate, is suddenly subpoenaed to testify in a congressional hearing where they are forced to answer an ill-tempered congress member's questions. It might go something like this\"</p>\n<p>This should be OP, not OpenAI, right?</p>\n", "parentCommentId": null, "user": {"username": "Moritz von Knebel"}}, {"_id": "XjDkDAeT2dY5BJ5NZ", "postedAt": "2024-03-03T13:29:35.075Z", "postId": "LX9wGhZnCdLuXHPih", "htmlBody": "<p>fixed thanks</p>\n", "parentCommentId": "PLGryovpYT6rmDHLQ", "user": {"username": "blehrer"}}, {"_id": "DMm65fY7HMD7DTDdj", "postedAt": "2024-03-03T19:51:22.026Z", "postId": "LX9wGhZnCdLuXHPih", "htmlBody": "<p>I thought the video was excellent, and the highlights of your article were the concrete ideas and examples of good communication.</p><p>More concrete ideas please! I don't think anyone will disagree that EA hasn't been the best at branding itself, but in my experience it's easier said than done!</p>", "parentCommentId": null, "user": {"username": "MathiasKirkBonde"}}, {"_id": "pZhBSSm7uLaTtsLzb", "postedAt": "2024-03-03T23:20:25.822Z", "postId": "LX9wGhZnCdLuXHPih", "htmlBody": "<p>If people want more concrete ideas they can hire me to communications work.</p>\n<p>I don't know how to be more concrete than I did in the article without working for free.</p>\n", "parentCommentId": "DMm65fY7HMD7DTDdj", "user": {"username": "blehrer"}}, {"_id": "tFW57Cwyaxmdgu8Fj", "postedAt": "2024-03-04T15:50:33.537Z", "postId": "LX9wGhZnCdLuXHPih", "htmlBody": "<p>Small feedback on your essay itself:&nbsp;<br><br>even as someone interested in hearing what you had to say, your writing could be formatted to let me skim it more efficiently. I'd have loved if you posted more visible TL;DRs at the start &amp; named the sections by their conclusions rather than their guiding questions.<br><br>The teaser video worked on me as you predicted though, props on that!&nbsp;<br><br>This also makes for a distinctive cover letter to the OP job, to be sure! Smart.</p>", "parentCommentId": null, "user": {"username": "Henry_Sleight"}}, {"_id": "NdcEzDgmfuAAMpoEw", "postedAt": "2024-03-05T09:52:53.897Z", "postId": "LX9wGhZnCdLuXHPih", "htmlBody": "<p>Re your final personal note - I feel a lot like you! Thanks for putting your thoughts out there.</p>", "parentCommentId": null, "user": {"username": "Ulrik Horn"}}, {"_id": "Aapnb5D4jxzCGcttC", "postedAt": "2024-03-05T13:03:39.056Z", "postId": "LX9wGhZnCdLuXHPih", "htmlBody": "<p>thanks ulrik 🤝</p>\n", "parentCommentId": "NdcEzDgmfuAAMpoEw", "user": {"username": "blehrer"}}, {"_id": "gj7EfEjFhTAd4bhiC", "postedAt": "2024-03-06T22:31:18.670Z", "postId": "LX9wGhZnCdLuXHPih", "htmlBody": "<p>This is great meta-feedback - I'll be sure to include more TL;DRs at the start of my articles too.&nbsp;</p>", "parentCommentId": "tFW57Cwyaxmdgu8Fj", "user": {"username": "TFWebber"}}, {"_id": "XSbBxzaeHWxq53jPP", "postedAt": "2024-03-06T22:35:34.960Z", "postId": "LX9wGhZnCdLuXHPih", "htmlBody": "<p>I don't know much about EA yet, so this was nice to hear your perspective about where things could improve. I can see both sides of the coin here; that being accessible helps with distribution of information, and how non-serious people aren't going to include the rigor that's required to understand some of these complex issues.&nbsp;<br><br>I wonder where the middle ground is? I also wonder what changes would bring the most relief to you. Shift in culture? Shift in sharable material?</p>", "parentCommentId": null, "user": {"username": "TFWebber"}}, {"_id": "J7ghdkryaq2uESDGk", "postedAt": "2024-03-07T11:50:47.923Z", "postId": "LX9wGhZnCdLuXHPih", "htmlBody": "<p>Very useful post, thanks. Improving our comms is one of our three priorities for EA Netherlands in 2024 and this will inform that work.&nbsp;</p>", "parentCommentId": null, "user": {"username": "James Herbert"}}, {"_id": "8y7D92LQxtMoFRDeS", "postedAt": "2024-03-07T15:47:23.355Z", "postId": "LX9wGhZnCdLuXHPih", "htmlBody": "<p>Thanks James, cool to hear.</p>\n", "parentCommentId": "J7ghdkryaq2uESDGk", "user": {"username": "blehrer"}}, {"_id": "cZpS9mWsH6zvQW7dz", "postedAt": "2024-03-07T15:58:40.446Z", "postId": "LX9wGhZnCdLuXHPih", "htmlBody": "<p>One of the broader points I'm advocating for is that the middle ground is far more stable and sizable than many in the community might think it is.</p><p>I think the 'non-serious' individual you speak of is somewhat of a straw man. If they are real, the risk of them polluting the quality of EA's work is quite small IMO. It's important to make a distinction between the archetype of a follower/fan (external comms) and a worker/creator (internal comms). A lot of EAs conflate internal and external communications.</p>", "parentCommentId": "XSbBxzaeHWxq53jPP", "user": {"username": "blehrer"}}, {"_id": "LRCK4hunCQYbkEy3e", "postedAt": "2024-03-07T19:24:21.782Z", "postId": "LX9wGhZnCdLuXHPih", "htmlBody": "<p>This is a really cool topic. I wonder why there is tension. I haven't been around long enough to see it in action, but I'm getting a better sense for it as I read similar posts. Do you think there's a key cultural shift that would address the underlying issue? Do you think there's any fear (or some other emotion/rationale) about avoiding this middle ground?</p>", "parentCommentId": "cZpS9mWsH6zvQW7dz", "user": {"username": "TFWebber"}}, {"_id": "qcKdoqy3dp3uWHY6B", "postedAt": "2024-03-07T20:15:48.424Z", "postId": "LX9wGhZnCdLuXHPih", "htmlBody": "<p>Yeah if you read the essay it spends a lot of time speaking to both of those questions</p>\n<p>tldr</p>\n<p>The fear is born from the very DNA of EA which has its roots in avoiding emotional irrationalities that lead to ineffective forms of altruism. The culture shift I want to see is a product of a) acknowledging and relinquishing this fear when it's not based on reality b) understanding the value proposition of good communications</p>\n", "parentCommentId": "LRCK4hunCQYbkEy3e", "user": {"username": "blehrer"}}, {"_id": "2Fmfu6yPuy9jnGRD2", "postedAt": "2024-03-07T20:28:23.545Z", "postId": "LX9wGhZnCdLuXHPih", "htmlBody": "<p>Out of interest:</p>\n<ol>\n<li>What are your other two priorities?</li>\n<li>How will you know if you've been successful in \"improving your comms\"? Curious to hear if you have a more specific okr here</li>\n</ol>\n", "parentCommentId": "J7ghdkryaq2uESDGk", "user": {"username": "cilliancrosson@gmail.com"}}, {"_id": "9dhq2E6jqwBNPGEWn", "postedAt": "2024-03-08T11:56:13.828Z", "postId": "LX9wGhZnCdLuXHPih", "htmlBody": "<p>Hey!&nbsp;<br><br>Our other priorities for 2024 are GCR field building and investing in our volunteering programme. We'll do this alongside maintaining our more established programmes e.g., our <a href=\"https://effectiefaltruisme.us14.list-manage.com/track/click?u=0d235948217a55858a0e810c4&amp;id=fa4ebc6612&amp;e=207a255e38\"><strong>national EA crash course</strong></a>, our support for <a href=\"https://effectiefaltruisme.us14.list-manage.com/track/click?u=0d235948217a55858a0e810c4&amp;id=bef768e895&amp;e=207a255e38\"><strong>organisers around the country</strong></a>, and our <a href=\"https://effectiefaltruisme.us14.list-manage.com/track/click?u=0d235948217a55858a0e810c4&amp;id=1b6a56af6b&amp;e=207a255e38\"><strong>co-working office</strong></a>.<br><br>In terms of measuring success, we still need to develop the strategy, so it is not currently possible to say in detail how we will evaluate it. Broadly speaking, we want to increase awareness of, and inclination towards, effective altruism amongst proto-EAs in the Netherlands. We also want to ensure inclination remains high amongst the general public once they become aware of us. Therefore, to evaluate the impact of this work, we will probably conduct surveys to measure awareness and inclination amongst proto-EAs and the general public before and after the interventions outlined in the strategy, whatever they may be, are implemented.&nbsp;<br><br>Of course we'll also keep an eye on basic comms metrics like newsletter subscribers, LinkedIn followers, etc. And downstream metrics like intro programme completions, etc.&nbsp;<br><br>For Q1 our comms OKR is as follows:<br><br>Objective: Comms - develop our strategy (ready to be handed to volunteer team)&nbsp;<br>&nbsp;<br>Key Results &nbsp;</p><ol><li>Get 100 survey responses for our Dutch proto-EA marketing survey by March 8th (this asks about media consumption habits, barriers faced, recommendations for media platforms/influencers, etc).</li><li>Internal publication of an analysis of the survey's results by March 15th (we're probably going to miss this deadline, in the end, we decided to rely on a volunteer for the analysis)</li><li>Internal publication of a communications strategy (in the style of Rumelt) consisting of a diagnosis, guiding policy, and a set of coherent actions by March 22nd (again, we're probably going to miss this target)</li><li>Recruit a team of 3+ volunteers by March 31st to help us implement the strategy (supplementing the marketing strategist and the google ads marketeer we've already got on the team)</li></ol>", "parentCommentId": "2Fmfu6yPuy9jnGRD2", "user": {"username": "James Herbert"}}]