[{"_id": "aTfL6HaokdLdMnp9m", "postedAt": "2022-12-16T13:45:29.886Z", "postId": "LXj4cs5dLqDHwJynp", "htmlBody": "<p>As someone who had previously made news for a&nbsp;<a href=\"https://www.aljazeera.com/news/2020/4/10/climate-change-activists-test-strict-singapore-protest-laws\"><u>\"radical climate protest\"</u></a> in my country back in 2020, I agree with this finding!</p><p>I’d like to share my own application of this phenomenon:</p><h1>Case study: Climate protesting in Singapore</h1><p>In 2019, the wave of global youth climate activism inspired by Greta Thunberg had spread to Singapore. Broadly speaking, Asian countries are generally underrepresented in climate activism, even in developed countries.&nbsp;<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefzqhvxrnumq\"><sup><a href=\"#fnzqhvxrnumq\">[1]</a></sup></span>Consequently, the inaugural <a href=\"https://mothership.sg/2019/10/sg-climate-rally-reactions/\">SG Climate Rally</a> was relatively small at ~2,000 participants. I helped organise this rally.</p><p>There's a few things to note here:</p><ol><li><strong>Singapore is known for very strict laws restricting protests.</strong> Under the Public Order Act introduced in 2008, any person assembling in a public place expressing support for or against a cause must register with the police for a permit. Long story short, even a solo protest must be pre-approved by the police. And the police don’t approve topics deemed controversial … yeah.</li><li><strong>Singaporeans have a very negative opinion of protesting.</strong> It’s a chicken-and-egg thing, but essentially in Singapore protesting carries a social taboo. Protests generally considered&nbsp;<i>“moderate”</i> in other countries would be considered&nbsp;<i>“radical”</i> in Singapore.</li><li><strong>Singaporean climate advocacy organisations were all “moderate”.</strong> There was no&nbsp;<i>“radical wing”</i> of climate activism in Singapore. In the Singaporean context, standing in the street alone for 15 minutes to protest for climate action would be&nbsp;<i>“radical”</i>. Our Overton Window is very different.</li><li><strong>Singapore had very insufficient climate commitments.</strong> In early 2020, after the SG Climate Rally, Singapore announced climate goals that included net zero timelines beyond 2050 <i>\"some time in the later half of this century\"</i> (i.e. no actual timeline), and a carbon tax of $5.</li></ol><h3><u>Decision Matrix</u></h3><ol><li>If I continued with&nbsp;<i>“Moderate Groups”</i>, it seemed high-probability that commitments would remain insufficient.</li><li>If I branched off into&nbsp;<i>“Radical Tactics”</i>, then policymakers have to deal with both&nbsp;<i>“Moderate Groups”</i> and&nbsp;<i>“Radical Tactics”</i>. Following the same logic as outlined in this post, this suggested a probability of improved climate commitments.</li></ol><p>From an x-risk prevention POV, the idea was to increase the probability of climate action by creating the threat of radical protests to&nbsp;<i>supplement/increase support for&nbsp;</i> moderate advocacy.<br>Basically, I did not think&nbsp;<strong>Radical &gt; Moderate</strong>, but rather&nbsp;<strong>Radical+Moderate &gt; Moderate Only.</strong></p><h1>EV calculations of \"Radical\" Climate Protests</h1><p>I calculated the rough Expected Value (EV) of my climate protest as follows:</p><ul><li>Assuming 1% chance of counterfactually affecting climate discourse (favourable due to lack of protests in SG increasing marginal benefit of 1 individual protest)</li><li>Excess deaths from 4.0C vs 1.5C: 4 million/year</li><li>Singapore's contribution to excess death: 1/1000 =&nbsp;<strong>4,000/year</strong></li><li>EV: 40 excess deaths/year &nbsp;=&nbsp;<strong>~1,000/25 yrs</strong></li><li>Risk: Major tail risk of 1-2 year's jail, criminal record, 5% chance of exile</li></ul><p>So, with about 2-3 orders of magnitude margin of error, I figured it was high-EV. After a big controversy and a year of organising, Singapore released climate goals that included a net zero goal by 2050, and a $80 carbon tax.</p><h1><u>Further thoughts</u></h1><p>I think a lot of people misinterpret advocacy, or at least climate advocacy.</p><ol><li><strong>In general, people don't like activism/protesting.</strong> More broadly, people are extra skeptical of ideas requiring high commitment that imply moral judgement. You can see this with EA, veganism, protesting, donating etc. People just don't respond well to the implicit premise that <i>\"Because I haven't been doing this, therefore I am immoral\"</i>, and instead it's more comfortable to go with <i>\"I really want to believe this person is wrong and misguided.\"</i>. This applies even between activities: for example, EAs feeling awkward discussing veganism/donations/protests with other EAs, regardless of the actual EV of the actions. There's a very valid discussion to be had with regards to the efficacy of advocacy/protest campaigns, but I'm usually wary of the extra skepticism I get just by virtue of being a climate activist and the negative connotations people have surrounding that.</li><li><strong>Critics often ignore “moderate” groundwork, and then criticise a lack of moderate groundwork.</strong> A common criticism I hear to this day is&nbsp;<i>“Why don’t you do [X] instead of [Y]”</i>. X is usually implied as something vaguely less radical. However, in my experience, people who do&nbsp;<i>“radical”</i> advocacy often have years of experience in&nbsp;<i>“moderate”</i> advocacy, even simultaneously doing both. I’d say 99% of my work involved normal stuff like outreach to policymakers, organising petitions and lobbying. I think people just assume&nbsp;<i>“radicals”</i> dismiss&nbsp;<i>“moderates”</i>, when in fact radicals often respect and work closely alongside the moderates who have always comprised 99% of the climate movement, but aren’t reported on.</li><li><strong>People just assume activists are attention-seeking.</strong> This one, I don’t fully get. Nowadays, there’s countless ways to optimise for attention that have no downside risk. In fact, I messaged the most attention-seeking people I knew and asked them to join, but none of them did. Instead, it was usually people who were extremely anxious about climate risk+had a very high justice sensitivity. Interestingly, all of them were either LGBTQ+ or were neurodivergent.</li></ol><p>Anyway, just sharing my (hopefully relevant) experience. I did do a lot of social movement research literature review while organising climate protests, so even this is a very small fraction of my thoughts on the topic. People seem to assume that activists are impulsive and have poorly-crafted theories of change, so it's hard to elaborate on reasoning when a critic just asserts that you're dumb.<br><br>Happy to engage with other discussions on this topic! Nowadays I work at Nonlinear mainly on AI Safety/meta stuff, so climate activism doesn't come up super often other than cross-applying x-risk theories of change.</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnzqhvxrnumq\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefzqhvxrnumq\">^</a></strong></sup></span><div class=\"footnote-content\"><p>The reason why is worthy of its own research/thread.</p></div></li></ol>", "parentCommentId": null, "user": {"username": "Minh Nguyen"}}, {"_id": "KYoKXRWcNTL6D2JZr", "postedAt": "2022-12-17T08:28:46.930Z", "postId": "LXj4cs5dLqDHwJynp", "htmlBody": "<p>Nice! Very cool research idea and very interesting findings. From a skim and without having thought too hard about it, the methodology and setup seems more careful and higher quality than what I remember of your previous survey too, so nice job on that!</p><p>This roughly fits with my somewhat indirect inferences from some of the <a href=\"https://forum.effectivealtruism.org/posts/re6FsKPgbFgZ5QeJj/effective-strategies-for-changing-public-opinion-a#The_media_s_agenda_setting_effects\">research</a> I did on how media coverage and public opinion influence each other and policy-making. (Other relevant points <a href=\"https://www.sentienceinstitute.org/foundational-questions-summaries#confrontation-vs.-nonconfrontation\">here</a>.) I'd expect more radical tactics to be good at forcing an issue onto the public and policy agenda, but not good (possibly counterproductive) at persuading unsupportive members of the public to change their mind. Your evidence on polarisation supports this, I think. And if it such protests do indeed increase support for more moderate groups, as your study suggests, then that gives them more influence to negotiate with policy-makers.&nbsp;</p><p>My inferences are getting even more indirect now, but an implication of this is that radical campaigns targeted towards issues that the public are already supportive of would be helpful for forcing change, but not so helpful and perhaps counterproductive on issues where there isn't already popular support. (This might be bad news for groups like Animal Rebellion.)</p>", "parentCommentId": null, "user": {"username": "Jamie_Harris"}}, {"_id": "XDZDNBA46JPBg2QLm", "postedAt": "2022-12-17T10:21:33.678Z", "postId": "LXj4cs5dLqDHwJynp", "htmlBody": "<p>For previous grant-making decisions, I have been interested in the question about the extent to which more radical tactics can move the Overton Window and make things easier for more moderate activists. Based on fairly quick Google Scholar searches, I haven't found anything, so I'm glad you've investigated this.</p><p>I haven't read your piece fully, so sorry if I'm asking things which are answered in your post.&nbsp;</p><ul><li>92% awareness rate seems awfully high. Did the survey include anything to test whether people &nbsp;who said that they had heard of Just Stop Oil really had? E.g. by testing whether they knew that JSO had performed radical tactics? Surveys have &nbsp;a strong tendency to elicit answers which agree with the question, so if the question were worded as \"Have you heard of ...\" people are more prone to say yes. They may also want to appear more knowledgeable and worldly aware. <strong>I'm worried that the survey might be finding \"willingness to appear aware of environmental topics leads to support for Friends of the Earth\" and not \"being aware of JSO leads to support for Friends of the Earth\".</strong></li><li>Did your work analyse the people who hadn't heard of JSO before the actions and then had heard of them after the actions? That might be interesting.</li><li>I appreciate this comment is difficult (impossible?) to overcome in a survey, but <strong>I'm worried that to the extent the effect is real, it might capture attitudes/appearances not actions.</strong> Let's assume that people who have heard about JSO decide they want to position themselves as more moderate than them but still climate-friendly. Are they positioning themselves this way <i>in how they want to come across</i>, or the <i>actual actions they take</i>? For some people (especially politicians/decision-makers) I could imagine that the performative nature of JSO-style protests might (sub-consciously?) underline to them that this is all about media theatre, and not about genuinely taking action or making change. Surveys are really good at capturing the \"how they want to come across\" perspective, and not the \"actual actions they take\" perspective.</li></ul>", "parentCommentId": null, "user": {"username": "Sanjay"}}, {"_id": "aR3ZScSPT3vGCr9GF", "postedAt": "2022-12-17T11:23:34.996Z", "postId": "LXj4cs5dLqDHwJynp", "htmlBody": "<p>I'm really uncomfortable with this post. It implicitly supports immoral ends justifying the means actions (trapping people in their cars) if the result is good.</p>\n", "parentCommentId": null, "user": {"username": "Shiney"}}, {"_id": "PXPK4ptb3tTf4iYnG", "postedAt": "2022-12-17T18:09:06.000Z", "postId": "LXj4cs5dLqDHwJynp", "htmlBody": "<p>Seems like you can treat it as two separate questions, this post only tackling the first:</p>\n<ol>\n<li>is radicalism effective at moving the Overton window?</li>\n<li>if yes, is it morally justifiable?</li>\n</ol>\n<p>I agree with you it's a hard \"no\" on the second question, but the first question is still interesting to explore.</p>\n", "parentCommentId": "aR3ZScSPT3vGCr9GF", "user": {"username": "Brian E Adams"}}, {"_id": "k8cJxgjAGwEt7nCNg", "postedAt": "2022-12-18T22:01:41.977Z", "postId": "LXj4cs5dLqDHwJynp", "htmlBody": "<p>I think this is interesting research but I would quibble with your interpretation of the top part of figure 4 as a causal effect. As far as I can tell, that part is a cross-sectional analysis that is only valid if individuals with greater knowledge of climate organisations are the same in all relevant ways as those with lower levels of knowledge that identify with Friends of the Earth to the same extent. This seems unlikely to be true and indeed does not have to hold for the fixed effect analyses that make up the majority of this piece to be unbiased. If I have not misinterpreted something here, I would recommend being much clearer in future about when switching between fixed and random effects models &nbsp;as they estimate very different parameters, with fixed effects usually being much more reliable at retrieving causal effects.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Joseph Richardson"}}, {"_id": "rYjNWCzCgqKyAsBdn", "postedAt": "2022-12-19T11:26:16.489Z", "postId": "LXj4cs5dLqDHwJynp", "htmlBody": "<p>Hi Sanjay, thanks for the good questions! Since you said you were looking, the most relevant bit of research to this topic is by <a href=\"https://academic.oup.com/pnasnexus/article/1/3/pgac110/6633666\">Simpson et al. (2022</a>) who did experimental research on the radical flank effect, both for radical tactics and a radical agenda. Interestingly, they find that a radical agenda had no effect, but radical tactics did. On your questions:</p><ul><li>On the 92% figure, we weren't explicit about this but yes, we also estimate that this is over-inflated vs reality for the reasons you said (people do weird things on surveys). In both this survey and a previous one for Animal Rebellion, we asked decoy questions about awareness of fictional organisations, and elicited awareness values of around 60% and 20% respectively, which is obviously very weird. We're not exactly sure how we're going to use this information to adjust our estimates, so feedback welcome. I wasn't too concerned about that particular result as I actually think that value is the least interesting of all of our findings, and don't think it's particularly informative for understanding the actual impact JSO had. I'll make an edit in the document though to be more explicit that this is likely overinflated so good point!&nbsp;</li><li>We hadn't done that particular analysis (for people who went from 0 awareness to &gt;0 awareness) but we can definitely do so! I'll put that on the list of additional analyses to do (or consider doing).</li><li>This is definitely a good point and like you say, a limitation of surveys as we can generally only gather people's stated intentions, rather than their actions. There seems to be a good amount of research that supports increased identification with a movement leads to increased <a href=\"https://www.researchgate.net/profile/Matthew-Feinberg-2/publication/338562538_The_activist's_dilemma_Extreme_protest_actions_reduce_popular_support_for_social_movements/links/5ea5eff892851c1a90728bd5/The-activists-dilemma-Extreme-protest-actions-reduce-popular-support-for-social-movements.pdf\">willingness to join</a> and support the movement (E.g. <a href=\"https://onlinelibrary.wiley.com/doi/10.1002/ejsp.473\">financially</a>) so I think the link isn't super tenuous.&nbsp;</li></ul>", "parentCommentId": "XDZDNBA46JPBg2QLm", "user": {"username": "JamesOz"}}, {"_id": "K6n4gGny5o632pNCo", "postedAt": "2022-12-19T12:45:57.013Z", "postId": "LXj4cs5dLqDHwJynp", "htmlBody": "<p>Hi Joseph, thanks for your comment! It might have been a misunderstanding but we're definitely not claiming the top panel of Figure 4 is causal. It might have been because I cut out parts of our result section from the <a href=\"https://www.socialchangelab.org/_files/ugd/503ba4_a184ae5bbce24c228d07eda25566dc13.pdf\">full report</a> to make the EA Forum post shorter, but we discuss that the top part is cross-sectional as you say, and the bottom panel of Figure 4 (with difference scores) is more causal evidence.</p>", "parentCommentId": "k8cJxgjAGwEt7nCNg", "user": {"username": "JamesOz"}}, {"_id": "fH636BfncHC4smZA6", "postedAt": "2022-12-19T17:51:27.215Z", "postId": "LXj4cs5dLqDHwJynp", "htmlBody": "<p>Thanks. I think the issue is the use of &nbsp;the word effect, which usually implies causality in my field (Economics), rather than association when referring to the cross-sectional analysis alongside the fact that context was lost when it was edited down for the forum.</p>", "parentCommentId": "K6n4gGny5o632pNCo", "user": {"username": "Joseph Richardson"}}, {"_id": "rKnymWpFsWbuDgF22", "postedAt": "2022-12-19T21:09:28.191Z", "postId": "LXj4cs5dLqDHwJynp", "htmlBody": "<p>Thanks for pointing me to Simpson et al 2022.</p><ul><li>Re the 92%, I agree that it is intrinsically not that interesting. I was flagging it because I was worried that some of the 92% (maybe lots? maybe most?) didn't really understand that JSO espoused radical tactics. So <strong>the survey might be finding \"willingness to appear aware of environmental topics leads to support for Friends of the Earth\" and not \"being aware of JSO leads to support for Friends of the Earth\". </strong>In terms of how to account for this, I would have suggested another question in the survey which asks people who said that they have heard of JSO to indicate what JSO is most associated with, and one of the answers is that they are associated with radical tactics, and others are plausible-sounding but false. I appreciate this might be difficult now -- the survey is already done. And you might want to draw a line under this and move on. But if you did want to get to the bottom of this concern, you could replicate the survey (probably a fair bit more cheaply than by using YouGov -- just code up the survey yourself, which is very easy with GuidedTrack, and then get sample with something like prolific.co)</li><li>people who went from 0 awareness to &gt;0 awareness: would be interesting to see if you get round to doing that</li><li>I know I raised the question about the distinction between stated intentions and actions, but I should acknowledge that it might not matter. Example: if the intended theory of change is protest --&gt; change in public attitudes --&gt; people change their energy provider; in this case actions are important. Another example: if the intended theory of change is protest --&gt; change in public attitudes --&gt; politicians believing that the public wants change, so the politicians make a change happen; in this case, it actually doesn't matter whether the public gains enough conviction to change their behaviour -- just enough conviction that they answer more positively in a survey is actually sufficient.</li></ul>", "parentCommentId": "rYjNWCzCgqKyAsBdn", "user": {"username": "Sanjay"}}, {"_id": "pfBLQyH8yvggekfng", "postedAt": "2022-12-20T12:05:54.074Z", "postId": "LXj4cs5dLqDHwJynp", "htmlBody": "<p>Ah I've understood you now! I don't see what you said being a problem as we explicitly put a sentence description in <a href=\"https://docs.google.com/document/d/1ZNDiOHnIwzLY5TqjIlE264gIk0Wt248qwPS3FFIm1p0/edit\">the survey </a>for both JSO and Friends of the Earth explaining a tiny bit about who they were (e.g. they use radical tactics) without anchoring respondents too much. So I'm quite confident that respondents would have known JSO was utilising more disruptive tactics relative to Friends of the Earth. In addition, given how much media coverage JSO got during this week (and for previous actions) I would be quite surprised if a good proportion of people in the UK (50%+?) hadn't already seen some reference to JSO in the context of arrest, police or disruptive protest.</p><p>Agreed about the stated intentions vs action point. I think increasing support for a policy can be a useful public opinion signal, but JSO probably also wants increased desire to take action on climate change (e.g. sign a petition, attend protest, etc), which we didn't find a change in.</p>", "parentCommentId": "rKnymWpFsWbuDgF22", "user": {"username": "JamesOz"}}, {"_id": "So5EEaeFxfHLLa6qi", "postedAt": "2022-12-22T12:12:05.993Z", "postId": "LXj4cs5dLqDHwJynp", "htmlBody": "<p>I find the discussion of these claims interesting. I would also warn about extrapolating this to any other issue. Climate issues are well supported over there. But this doesn't mean the same would be true for issues with minority support. Just in my field, I've seen a minority of animal advocates poison the word \"vegan\" in the United States, as I document in <a href=\"https://www.losingmyreligions.net/\"><i>Losing My Religions</i></a>.</p>", "parentCommentId": null, "user": {"username": "MattBall"}}, {"_id": "hjsdZGjwfDoTTF6qH", "postedAt": "2022-12-27T11:01:03.375Z", "postId": "LXj4cs5dLqDHwJynp", "htmlBody": "<p>This is a very interesting study and analysis!</p><p>I was wondering what its implication would be for an area like animal rights/welfare where the baseline support is likely to be considerably lower than that of climate change.&nbsp;</p><p>&nbsp;If we assume that the polarization effect of radical activism holds true across other issues as well, then the fraction of people who become <i>less supportive may be higher</i> than those who have been persuaded to become more concerned &nbsp;(for the simple reason that to start with the the odds of people supporting even the more moderate animal rights positions would be rather low) .</p><p>I reckon though that such simple extrapolation is fraught and there are other factors that will come into the picture when it comes to animal advocacy. &nbsp;</p>", "parentCommentId": null, "user": {"username": "Venky1024"}}, {"_id": "uDsMnJGLNqBEDors8", "postedAt": "2022-12-27T11:02:10.676Z", "postId": "LXj4cs5dLqDHwJynp", "htmlBody": "<p>This is a very interesting study and analysis.</p><p>I was wondering what its implication would be for an area like animal rights/welfare where the baseline support is likely to be considerably lower than that of climate change.&nbsp;</p><p>&nbsp;If we assume that the polarization effect of radical activism holds true across other issues as well, then the fraction of people who become <i>less supportive may be higher</i> than those who have been persuaded to become more concerned &nbsp;(for the simple reason that to start with the the odds of people supporting even the more moderate animal rights positions would be rather low) .</p><p>I reckon though that such simple extrapolation is fraught and there are other factors that will come into the picture when it comes to animal advocacy. &nbsp;</p>", "parentCommentId": null, "user": {"username": "Venky1024"}}, {"_id": "SSRQZ4bAW6Wse6Wz6", "postedAt": "2022-12-27T20:03:39.544Z", "postId": "LXj4cs5dLqDHwJynp", "htmlBody": "<p>Thanks for the kind words! Our new Director of Research did all the analysis for this (I still did the methodology) and he's quite a whiz at data analysis, so he can take all the credit for that side of things!</p><p>Good to know that it fits in well with your previous findings. I also think this supports a similar loose set of hypotheses I had going into this.</p><p>Re it being less good for issues with low levels of public support, I think what you say is broadly true, with a caveat. I think for issues with low public support, it's not often that there is a big base of people who oppose an issue and we slowly win people other; Instead, I think it's more like that most of the population don't really have a view, and using radical tactics, you're getting them to actually form a view on an issue. I think the best example for me of this is the chart below, which shows public support for BLM (the group, not the issue) post-George Floyd protests. I think Animal Rebellion does similar stuff - It will turn a bunch of people off, it will probably attract some people, but ultimately it's getting a lot more people to actually take a stance. Obviously the balance of this is important, and something that it doesn't feel like we have great evidence on.</p><figure class=\"image\"><img src=\"https://res.cloudinary.com/cea/image/upload/v1672171421/mirroredImages/SSRQZ4bAW6Wse6Wz6/q3q0c9ygkrp5sqtfgejf.jpg\"></figure>", "parentCommentId": "KYoKXRWcNTL6D2JZr", "user": {"username": "JamesOz"}}, {"_id": "uLcZuzmjQKdKXpbG9", "postedAt": "2022-12-27T21:25:00.916Z", "postId": "LXj4cs5dLqDHwJynp", "htmlBody": "<p>This is very cool, thanks for doing this research and sharing it.</p>", "parentCommentId": null, "user": {"username": "Ben_West"}}, {"_id": "NjZsWzqpM9EW87Tis", "postedAt": "2022-12-27T23:20:33.830Z", "postId": "LXj4cs5dLqDHwJynp", "htmlBody": "<p>Thanks for the comment Ben - that's very kind of you!&nbsp;</p>", "parentCommentId": "uLcZuzmjQKdKXpbG9", "user": {"username": "JamesOz"}}, {"_id": "JfzFEL7KbRgxYKcfQ", "postedAt": "2023-06-01T09:55:25.707Z", "postId": "LXj4cs5dLqDHwJynp", "htmlBody": "<p>Small relevant bump that if anyone is interested in hearing more about this work, we're actually organising a webinar about it! It'll be on Monday 5th of June, 6-7pm BST and you can sign up <a href=\"https://www.eventbrite.com/e/the-radical-flank-effect-of-just-stop-oil-tickets-637950255387\">here</a>.</p>", "parentCommentId": null, "user": {"username": "JamesOz"}}]