[{"_id": "2BaPjZrbtjwH2uhbi", "postedAt": "2024-02-12T17:45:25.989Z", "postId": "LXpj4A4gznXAQn8Zd", "htmlBody": "<p>A couple of resources. Any transplant center in the US who is a National Kidney Registry(NKR) donor hospital (<a href=\"https://www.kidneyregistry.org/about/map-of-member-centers/\">Map of National Kidney Registry Member Transplant Centers</a>) may be willing to work you up as a donor. This is typically done at no cost to you (you will want to verify by communicating with the transplant center first).&nbsp;</p><p>If you are found to be a suitable donor, they have a protection called Donor Shield (<a href=\"https://www.donor-shield.org/kidney-donors/\">Donor Shield | Protecting &amp; Supporting Living Kidney Donors (donor-shield.org)</a>) which theoretically covers you for complications related to the donation. Complications are rare, but it is still worth having. Again, you will want to confirm with NKR that this applies to a non-US citizen. They also give some financial assistance for lost wages, travel, etc.&nbsp;</p>", "parentCommentId": null, "user": null}, {"_id": "7SMnSJyT8DxHuw5a3", "postedAt": "2024-02-12T18:45:15.531Z", "postId": "LXpj4A4gznXAQn8Zd", "htmlBody": "<p>Dumb suggestion: is there any way you could find someone in Germany who needed one and then make a directed donation? Maybe there is a Facebook group or Reddit for such people.</p>\n", "parentCommentId": null, "user": {"username": "Larks"}}, {"_id": "sMdB7LpmJrxNzrnMh", "postedAt": "2024-02-14T11:52:22.854Z", "postId": "LXpj4A4gznXAQn8Zd", "htmlBody": "<p>That's not a bad idea. Though AFAIK clinics check your relationship with the recipient and aren't afraid to reject you if they don't deem you close enough. But I'll check the option out, thanks!</p>\n", "parentCommentId": "7SMnSJyT8DxHuw5a3", "user": {"username": "Scodischarge"}}, {"_id": "DoXNrvZaw3yPvamQC", "postedAt": "2024-02-14T11:54:31.318Z", "postId": "LXpj4A4gznXAQn8Zd", "htmlBody": "<p>Thank you! The States are a little further than I would prefer, but I'll keep it in mind in case other options fail.</p>\n", "parentCommentId": "2BaPjZrbtjwH2uhbi", "user": {"username": "Scodischarge"}}]