[{"_id": "EpYYyBGvLdjcxKEcA", "postedAt": "2022-12-19T01:21:30.716Z", "postId": "LyE4W6pRYcmoXDvHN", "htmlBody": "<blockquote>\n<p>Sentinel biosecurity program in Guatemala</p>\n</blockquote>\n<p>This sounds really cool, but I can't seem to find any details on it outside of this post. Could you point me to a resource (or should I just email Paulina)?</p>\n", "parentCommentId": null, "user": {"username": "Alex D"}}, {"_id": "NRFqgQaM2XECQft8S", "postedAt": "2022-12-19T18:13:17.710Z", "postId": "LyE4W6pRYcmoXDvHN", "htmlBody": "<p>Hi Alex! Thank you for your interest.&nbsp;<br>Our project is inspired by Sentinel, an ambitious and large-scale pandemic prevention effort in West Africa driven by Dr. Pardis Sabeti (co-founder of Sherlock Biosciences) and Jonathan Jackson (CEO of Dimagi).&nbsp;<br>Here is the paper about their work: &nbsp;<a href=\"https://pubmed.ncbi.nlm.nih.gov/34452470/\">https://pubmed.ncbi.nlm.nih.gov/34452470/</a>&nbsp;<br>and if you want our formal proposal for the LATAM &nbsp;project you can ask it by email to Paulina!&nbsp;<br>&nbsp;</p>", "parentCommentId": "EpYYyBGvLdjcxKEcA", "user": {"username": "Michelle Bruno Hz"}}, {"_id": "jynTpEznLEbgmSWRY", "postedAt": "2022-12-20T16:50:50.839Z", "postId": "LyE4W6pRYcmoXDvHN", "htmlBody": "<p>Amazing, yes I know of the West African initiative and wondered if they were related. Will reach out, thanks!</p>\n", "parentCommentId": "NRFqgQaM2XECQft8S", "user": {"username": "Alex D"}}, {"_id": "azmknjoqhQBZEupYH", "postedAt": "2023-01-20T08:33:40.160Z", "postId": "LyE4W6pRYcmoXDvHN", "htmlBody": "<p>As the proud son of Peruvian immigrants, I’m so happy to see EA getting involved in the Latin American community!</p>\n<p>I would recommend looking into Peru’s top universities such as  Pontificia Universidad Católica del Perú, Universidad Peruana Cayetano Heredia, and Universidad Nacional Mayor de San Marcos (UNMSM) to start EA college groups there or recruit professionals from there.</p>\n<p>From what I’ve been told by family and family friends (I grew up very involved in the North NJ Peruvian community and culture), Peru has a way better high school (secundaria) education system in mathematics than US public high schools. Some people told me they were required to take Calculus I and Calculus II to graduate high school.</p>\n<p>Also, Peruvian-Americans in the United States have a percentage of obtaining a bachelor's degree than the average American and Caucasian Americans. According to Wikipedia, “44% of Peruvians born in the United States over the age of 25 have college degrees,[8] exceeding the US national average of 24%.” Last year when I checked the US Census data website’s most recent data, it showed around 36%, if I remember correctly.</p>\n<p>Working with the Institute for Liberty and Democracy based in Lima can have a high impact too. The magazine “The Economist” once called it one of the two most important think tanks in the world and was founded by multi-award-winning economist Hernando de Soto.</p>\n<p>“ The Institute for Liberty and Democracy (ILD), led by Peruvian economist Hernando de Soto, works with developing countries to implement property and business rights reforms that provide the legal tools and institutions required for citizens to participate in the formal national and global economy. ILD works toward a world in which all people have equal access to secure rights to their real property and business assets to pull themselves—and their countries—out of poverty.” <a href=\"https://www.ild.org.pe/\">https://www.ild.org.pe/</a></p>\n", "parentCommentId": null, "user": {"username": "Jeffrey Arana"}}]