[{"_id": "kAourR9inDK5x8D6X", "postedAt": "2022-10-11T03:05:46.492Z", "postId": "LyTWpoQFozDfeQ9z8", "htmlBody": "<p>Love it.</p><p>Folks as fond of quotes as I am may also appreciate this (old?) <a href=\"https://docs.google.com/document/d/1ufAM4Bk2924IfTMFFGx-JJgTIUm74fhoyF9KwpatZE8/edit#heading=h.3h7jdz9ydt9o\">Compilation of EA relateable quotes.</a></p>", "parentCommentId": null, "user": {"username": "MJusten"}}, {"_id": "vd87EP9QhHcxHJxux", "postedAt": "2022-10-11T03:16:14.094Z", "postId": "LyTWpoQFozDfeQ9z8", "htmlBody": "<p>I agree that appealing to the inexplicable, extraordinary nature of existence is an underexplored introduction to longtermism. Sagan's status in popular science supports that there's clearly a draw to these ideas.&nbsp;</p><p>Would love to see a video or, perhaps even cooler, a VR animation, that connects EA to these grand themes. This <a href=\"https://twitter.com/foundersfund/status/1313151184287477767\">video from the funder's fund</a> (which ends with a Sagan quote!) is a beautiful prototype of what something like this could look like.&nbsp;</p>", "parentCommentId": null, "user": {"username": "MJusten"}}, {"_id": "dEuLjh7vjRFcAzAv8", "postedAt": "2022-10-11T05:42:04.217Z", "postId": "LyTWpoQFozDfeQ9z8", "htmlBody": "<p>\"<a href=\"https://youtu.be/zSgiXGELjbc&amp;t=40s\">If we do not destroy ourselves, we will one day venture to the stars.</a>\"</p>\n<p>This is perhaps the most memorable Carl Sagan quote for me thanks to melodysheep featuring it in 'A Glorious Dawn'.</p>\n", "parentCommentId": null, "user": {"username": "WilliamKiely"}}, {"_id": "vNGJbAbXdECTcqi4n", "postedAt": "2022-10-11T12:40:39.323Z", "postId": "LyTWpoQFozDfeQ9z8", "htmlBody": "<p>Fantastic list. Thank you for bringing it to my attention.</p>", "parentCommentId": "kAourR9inDK5x8D6X", "user": {"username": "Pablo_Stafforini"}}, {"_id": "kKXeJmkLkdybJzAaK", "postedAt": "2022-10-12T01:16:39.964Z", "postId": "LyTWpoQFozDfeQ9z8", "htmlBody": "<p>Here is Carl Sagan testifying to Congress about climate change on December 10, 1985 (see also: <a href=\" https://www.c-span.org/video/?125856-1/greenhouse-effect\">C-SPAN</a> source):</p><figure class=\"media\"><div data-oembed-url=\"https://www.youtube.com/watch?v=Wp-WiNXH6hI\"><div><iframe src=\"https://www.youtube.com/embed/Wp-WiNXH6hI\" allow=\"autoplay; encrypted-media\" allowfullscreen=\"\"></iframe></div></div></figure><p>Here are a few quotes (all transcription errors are mine):</p><blockquote><p>There are other gases that absorb in the infra-red, many of which have been mentioned already: nitrous oxide, methane, the &nbsp;halocarbons, and these are products, partly of agriculture, fertilizers, refrigeration, aerosol spray cans and so on, all products of our technology. We don't generate much water into the atmosphere, but we certainly do generate a great deal of carbon dioxide, through the burning of wood and fossil fuels, an apparently benign activity, who could object to humans burning oil, and coal, gas, and wood?&nbsp;</p><p>...</p><p>Now certainly not all aspects of how increased CO2 and other gases into the atmosphere are &nbsp;affecting the climate are known... though the overall picture is quite clear and quite widely understood and accepted... how much increase or decrease in cloudiness is there.. how does that change the albedo and reflectivity of the Earth... it is certainly worthwhile to spend some additional money on research..</p><p>[Venus] is an indication of what could happen in an extreme case.</p><p>...the best estimates are ... at the present rate of burning of fossil fuels, the present rate of increase of minor infra-red absorbing gases in the atmosphere, that there will be a several centigrade degree temperature increase on the Earth, global average, by the middle to the end of the next century, and that has a variety of consequences, including redistribution of local climates and through the melting of glaciers, an increase in sea levels...</p><p>So we have a kind of handwriting on the wall ... what can be done about it? The idea that we should immediately stop burning fossil fuel, has such severe economic consequences that no one will take it seriously, but there are many other things that can be done. One has to do with subsidies for fossil fuels, more efficient use could be encouraged by fewer government subsidies. Second, there are alternative energy sources, some of which are useful, at least locally. Solar power is certainly one that might be of more general use. Safe fission power plants, which are in principle possible. And then on a longer time scale, the prospect of fusion power. Fission and fusion power plants, in principle, vent no infra-red active gases, and therefore, whatever other problems they may provide, they do not provide a greenhouse problem.</p><p>...</p><p>Here is a problem which transcends our particular generation. ... If we don't do the right thing now, there are very serious problems that our children and grandchildren have to face.&nbsp;</p><p>Here is a sense in which the nations, to deal with this problem, have to make a change. ... There has to be a trading of benefits and suffering, and that requires &nbsp;a degree of international amity that doesn't exist today.</p><p>... We are all in this greenhouse together.</p></blockquote>", "parentCommentId": null, "user": {"username": "Noah Scales"}}, {"_id": "Ef9qZwAuBn54GhMGw", "postedAt": "2022-10-13T14:55:27.605Z", "postId": "LyTWpoQFozDfeQ9z8", "htmlBody": "<p>Thank you Noah, I added a part of this to the main post.</p>", "parentCommentId": "kKXeJmkLkdybJzAaK", "user": {"username": "finm"}}]