[{"_id": "LkR8JbwTAzAw96gk7", "postedAt": "2022-11-02T12:18:47.055Z", "postId": "LzCSzzZdYy5PZbFvo", "htmlBody": "<p>\"we can still aim for \"the greatest good for the greatest number\" - it's just that this number is no longer an integer.\"<br><br>Beautiful&nbsp;</p>", "parentCommentId": null, "user": {"username": "John Salter"}}, {"_id": "XWQ4Egv5cxJH7zYaZ", "postedAt": "2022-11-02T22:12:42.154Z", "postId": "LzCSzzZdYy5PZbFvo", "htmlBody": "<p>Thanks for posting this!</p><p>Brian Tomasik's <a href=\"https://reducing-suffering.org/fuzzy-nested-minds-problematize-utilitarian-aggregation/\">Fuzzy, Nested Minds Problematize Utilitarian Aggregation</a> also highlights different perspectives and implications of the fuzziness of \"minds\"</p>", "parentCommentId": null, "user": {"username": "Lorenzo Buonanno"}}, {"_id": "HHv2HC62JsGeTyymc", "postedAt": "2022-11-02T22:17:23.143Z", "postId": "LzCSzzZdYy5PZbFvo", "htmlBody": "<p>Isn't it possible that we already have 2 (or more) separate \"Qualias\", i.e the left and right brain? But, being highly integrated, don't result in any noticable experimental consequences in the way that Split brain patients do (it could also be that only one side is conscious, and the other side only seems)\nI'm thinking a bit in the way it's described in the short story \"Learning to be Me\" by Greg Egan.</p>\n<p>I also like the thought experiment in Shelly Kagans great YouTube lecture series (philosophy of death) - if we assumed the soul existed (and was \"you\" in the sense of conscious experience/qualia), you wouldn't  be able to tell if you are the same soul you were yesterday, or even 1 millisecond ago. Someone could in theory replace your \"soul\", while keeping all of the memories intact, and the result would be subjectively the same.</p>\n<p>To me this is a nice reminder that a single continuous self (or consciousness) in the way I like to think of it might not make much sense, or perhaps that other possibilities exist that fit the data.</p>\n<p>One could imagine me being the right brain for one moment, the left brain for another, or being both at the same time - eliminating the contradiction from the Split brain experiment.</p>\n", "parentCommentId": null, "user": {"username": "Ariel G."}}, {"_id": "KLcrDJcn8wJNEmz2b", "postedAt": "2022-11-04T14:27:19.754Z", "postId": "LzCSzzZdYy5PZbFvo", "htmlBody": "<p>I tend to think that qualia are bound together when they causally act as one. So if left and right are highly integrated (act as one), they aren't separate experiences. So here I agree with IIT.</p>\n<p>Ah, this story is great. In general Egan's stuff is awesome. If I remember correctly the story was more about personhood (the memories and dispositions etc.) rather than separate experiences (which would require some processes to run separately in parallel). I think it's an important distinction to make, as experience is fundamentally real, while personhood (or \"continuous self\") is more of a thing we <em>assign</em> to systems - a useful fiction (just like money, or democracy is a useful fiction).</p>\n<p>There is also a <em>feeling</em> of being yourself, but that's a different thing than pure experience, and different than assigned personhood. For example there are cases (meditation and psychedelic trips) when the feeling of being someone disappears, but experience remains.</p>\n<p>I like that soul swapping argument :D</p>\n<p>In the case of split brain, both of the experiences would <em>feel to be me</em>.</p>\n", "parentCommentId": "HHv2HC62JsGeTyymc", "user": {"username": "Filip Sondej"}}]