[{"_id": "DGsuefjBB56QSZRvR", "postedAt": "2023-12-28T22:31:33.899Z", "postId": "M3Yx7GzwykcLNzGbX", "htmlBody": "<p>Chris - this is all quite reasonable.</p><p>However, one could dispute '<strong>Premise 2</strong>: AGI has a reasonable chance of arriving in the next 30 or 40 years.'</p><p>Yes, without any organized resistance to the AI industry, the AI industry will develop AGI (if AGI is possible) -- probably fairly quickly.</p><p>But, if enough people accept Premise 5 (likely catastrophe) and Premise 6 (we can make a difference), then we can prevent AGI from arriving.&nbsp;</p><p>In other words, the best way to make 'AI go well' may be to prevent AGI (or ASI) from happening at all.&nbsp;</p>", "parentCommentId": null, "user": {"username": "geoffreymiller"}}, {"_id": "mxDdCcrBpFRPxST5F", "postedAt": "2023-12-28T23:06:27.156Z", "postId": "M3Yx7GzwykcLNzGbX", "htmlBody": "<p>Good point. I added in “by default”.</p>\n", "parentCommentId": "DGsuefjBB56QSZRvR", "user": {"username": "casebash"}}, {"_id": "ebcDiKRMAjQrdqJru", "postedAt": "2023-12-28T23:54:56.488Z", "postId": "M3Yx7GzwykcLNzGbX", "htmlBody": "<p>Great post Chris, very clear. I'd like to add something of a bummer reply, to anyone reading:</p><p>Please don't work on AI Safety unless what is motivating you is the genuine desire to have a positive impact.</p><p>I think there is already a real failure mode where status motivated people are joining the space because (1) of the attention it is getting among the general public. I.e. it is 'sexy' and (2) the people they respect are also in the space.</p><p>If this kind of person is put in the position of losing status for what one believes is good and true (e.g. Stanislov Petrov) then I don't trust them to make the right decisions.</p><p>Maybe I'll write a post about this...</p>", "parentCommentId": null, "user": {"username": "yanni"}}, {"_id": "ah7txfHCqtMe4j6ue", "postedAt": "2023-12-29T08:17:16.331Z", "postId": "M3Yx7GzwykcLNzGbX", "htmlBody": "<p>Also, would be keen to hear if you think I should have restructured this argument in any other way?</p>", "parentCommentId": "DGsuefjBB56QSZRvR", "user": {"username": "casebash"}}]