[{"_id": "iwAPi7MmDoWK6fmY8", "postedAt": "2023-08-12T21:14:38.322Z", "postId": "M3zJkqpruMWc4nFqj", "htmlBody": "<p>(Posting my LessWrong comment here)</p><p>&gt;If you're paying $8k per billion reads</p><p>&gt;This will likely go down: Illumina has recently released the more cost effective NovaSeq X, and as Illumina's patents expire there are various cheaper competitors.</p><p>Indeed it did go down. Recently I paid $13,000 for 10 billion reads (NovaSeq X, Broad Institute; this was for my meiosis project). So sequencing costs can be much lower than $8K/billion.</p><p>Illumina is planning to start offering a 25 billion read flowcell for the NovaSeq X in October; I don't know how much this will cost but I'd guess around $20,000.</p><p>ALSO: if you're trying to detect truly novel viruses, using a Kraken database made from existing viral sequences is not going to work! However, many important threats are variants of existing viruses, so those could be detected (although possibly with lower efficiency).</p>", "parentCommentId": null, "user": {"username": "Metacelsus"}}, {"_id": "r92rrH76dQptkEKgo", "postedAt": "2023-08-13T11:01:13.886Z", "postId": "M3zJkqpruMWc4nFqj", "htmlBody": "<p><em>&gt; Recently I paid $13,000 for 10 billion reads</em></p>\n<p>Thanks for sharing the pricing you've been getting!</p>\n<p>One thing that makes this a bit confusing is that in the context of paired end reads, \"read\" can either mean a single forward or reverse read, or it can mean a read pair (a gapped read). As we note under Table 3, we're using the latter: each read is (roughly) an independent observation from the sample. Illumina uses the former, though, and maybe you are as well? In which case instead of $1.3k per billion reads (6x cheaper) you paid $2.6k (3x cheaper)?</p>\n<p><em>&gt; if you're trying to detect truly novel viruses, using a Kraken database made from existing viral sequences is not going to work!</em></p>\n<p>Definitely! The work in this report wasn't to identify novel viruses, it was to understand how much sequencing we might need to do to get some number of reads of a novel virus. As a step toward that longer term goal.</p>\n", "parentCommentId": "iwAPi7MmDoWK6fmY8", "user": {"username": "Jeff_Kaufman"}}, {"_id": "GhEw9x8Lr8Ek3TRPp", "postedAt": "2023-08-16T14:03:49.116Z", "postId": "M3zJkqpruMWc4nFqj", "htmlBody": "<p>This was per 10 billion pairs (so 6x cheaper). The specifications are here: https://www.illumina.com/systems/sequencing-platforms/novaseq-x-plus/specifications.html</p>", "parentCommentId": "r92rrH76dQptkEKgo", "user": {"username": "Metacelsus"}}, {"_id": "HuAHLYZTL6EN3Xtxy", "postedAt": "2023-08-16T16:18:51.170Z", "postId": "M3zJkqpruMWc4nFqj", "htmlBody": "<p>Thanks!</p>\n", "parentCommentId": "GhEw9x8Lr8Ek3TRPp", "user": {"username": "Jeff_Kaufman"}}, {"_id": "iDGr5BB6AChePfCuQ", "postedAt": "2023-08-17T15:08:10.417Z", "postId": "M3zJkqpruMWc4nFqj", "htmlBody": "<p>Thanks for sharing!</p><blockquote><p>The NAO plans to use the estimates from this study as inputs into a modeling framework to assess the cost effectiveness of wastewater MGS detection under different pandemic scenarios, and we include an outline of such a framework with some rough estimates of the costs of different monitoring approaches.</p></blockquote><p>I am glad cost-effectiveness modelling is seemingly at the core of NAO's research.</p>", "parentCommentId": null, "user": {"username": "vascoamaralgrilo"}}]