[{"_id": "LZDv34qYdPLx9BGmE", "postedAt": "2022-12-02T14:39:25.014Z", "postId": "M5pgfDvDDt6aaLGxq", "htmlBody": "<p>Hi Nick-- thanks for the thoughtful post!&nbsp;</p><p>I think cash arms make a lot of intuitive sense, my main pushback would be a practical one: cash and intervention X will likely have different impact timelines (e.g. psychotherapy takes a few months to work but delivers sustained benefits, perhaps cash has massive welfare benefits immediately but they diminish quickly over time). This makes the timing of your endline study super important, to the point that <i>when </i>you run the endline is really what determines which intervention comes out on top, rather than the actual differences in the interventions. I have a post on this <a href=\"https://forum.effectivealtruism.org/posts/o6TbwLvywKDDxexyt/against-cash-benchmarking-for-global-development-rcts\">here</a> with a bit more detail.</p><p>&nbsp;</p><p>Your point on the ethics here is an interesting one, I agree that medical ethics might suggest \"control\" groups should still receive some kind of intervention. &nbsp;Part of the distinction could be that medical trials give sick patients placebos, which control patients accurately believe might be medicine, which feels perhaps deceptive, whereas control groups in development RCTs are well aware that they aren't receiving any intervention (i.e. they know they haven't received psychotherapy or cash), which feels more honest?</p><p>&nbsp;</p><p>The downside is this changes the research question from \"What is the impact of X?\" to \"How much better is X than cash\", and there are lots of cases were the counterfactual really would be inaction. A way around this might be to give control groups an intervention that we know to be \"good\" but that doesn't affect the specific outcome of interest. e.g. I've worked on an agriculture RCT that gave control groups &nbsp;water/sanitation products that had no plausible way to affect their maize yield but at least meant they weren't losing out. This might not apply to broad measures like WELBYs</p><p>I'm honestly not sure about the ethical side here though, interested to explore further.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Rory Fenton"}}, {"_id": "kWLpit53jRwQ8vBiP", "postedAt": "2022-12-02T19:49:18.957Z", "postId": "M5pgfDvDDt6aaLGxq", "htmlBody": "<p>Thanks so much Rory and for the links to your earlier post and the USAID stuff!<br><br>I think your criticism is a good criticism of RCTs in general, but it seems to me more a criticism comment about RCT design then being a clear argument against comparing with cash transfers. RCTs on development NEED longer term outcome measurement, and surely need at a minimum 2 data points at 2 different times after the study. And of course the most important data point is after many months or even many years as you talked about in your article.&nbsp;<br>&nbsp;</p><p>I'm not at all sure about the ethical side either . Medical RCTs &nbsp;compare a new trial treatment against the most up-to-date treatment - not so much because we worry about \"tricking\" a patient like you say (there are still plenty of RCTs with sugar placebo pills which is deemed ethically OK), we are &nbsp;still OK with a kind of 'deception'. What we AREN'T OK with is doing a trial where we give the control arm nothing at all, when we know there is a better option than nothing for the medical condition. And I'd argue that cash is usually a better option than nothing for many development conditions.<br><br>&nbsp;That's a great and sobering point about the counterfactual potentially being inaction if cash transfers won the day. Why should the counterfactual be inaction though? I would hope as development people we are good enough that if Cash was equivalent or better than intervention X, this wouldn't lead us not to inaction but instead to give more cash instead. Maybe I'm naive and idealistic though, and maybe you're right that there is actually a practical advantage in seeing a positive impact of intervention X, even if it is worse than a cash transfer. I don't think that <strong>should </strong>be the case though.<br><br>That's the whole question really - should we spend our millions on RCTs asking \"What is the impact of X\", or \"Is X better than cash\". What we really want to know, the practical question which underlies the research question is is <i><strong>\"Should we be implementing this intervention at scale\". </strong></i>I'd argue that to answer that, the question vs. Cash is the one that matters more.</p><p>Thanks so much for your reply, I can see you've thought about this far more than me and I loved your original post - weird that searches on the forum didn't bring it up, maybe they should employ google search on the site haha.</p>", "parentCommentId": "LZDv34qYdPLx9BGmE", "user": {"username": "NickLaing"}}]