[{"_id": "vCpY28KBKnMptovwN", "postedAt": "2014-09-20T20:09:57.472Z", "postId": "M6TpRMAbrL4zF7Nc7", "htmlBody": "<p>Thanks a bunch for this article. It has inspired some useful thoughts for me. I relate to some of your considerations regarding philosophy (although I personally don't consider my philosophical education to be a mistake), programming, medical school, and law.</p>\n<p>You wrote about doctors being &quot;to a large extent replaceable,&quot; and taking this consideration at face-value in the past has made me give less consideration to the possibility of becoming a doctor. However, if you were a doctor, presumably you could be an earning-to-give doctor?</p>\n<blockquote>\n<p>Also, just focus on what you're good at. Don't think so much in terms of what you want to do.</p>\n</blockquote>\n<p>I like this suggestion if it's construed abstractly (e.g., I've come to a point where I see thoughts of the form &quot;I am good at , so I could do &quot; as potentially better than &quot;I happen to be good at , so I should try to do &quot;). I think reading about effective altruism might also sometimes lend a sense of urgency to EAs that may hamper their long-term development. An example of this sense: &quot;So, a lot of bad things seem to be happening, and I need to employ my current skillset ASAP to help ameliorate them.&quot; This sort of thinking might constrain the possibilities that someone might think of.</p>\n<blockquote>\n<p>You also can't get too hung up on comparing yourselves to other people. When I was in high school, I was super good at math. I went to national-level math meets. But then I got to these meets and saw people who were even better than I was. Then I'm like, &quot;Oh, man!&quot; It's really discouraging.</p>\n</blockquote>\n<p>I have been discouraged at times as well and probably underestimated my abilities because I was often reading things from high-ability types. So, regarding writings, there was sort of a selection effect in that I was comparing myself to people who, by virtue of the process of seeking out their thoughts, were more developed than me in various ways. I raise this consideration so that others might recognize this component in their own self-assessments and persist in their development. </p>\n", "parentCommentId": null, "user": {"username": "dneylon"}}, {"_id": "ThcYcYz4bsbipKPcL", "postedAt": "2014-09-20T20:52:48.350Z", "postId": "M6TpRMAbrL4zF7Nc7", "htmlBody": "<p>A great talk! I've added it to <a href=\"http://www.stafforini.com/blog/writings-on-earning-to-give-an-annotated-bibliography/\">my annotated bibliography on earning to give</a>.</p>\n<p>As someone with a background in philosophy who is considering programming as an earning to give career, I would be interested in reading more about how you transitioned into software development after quitting your philosophical studies.</p>\n<p>It would also be useful to know if there are objective measures one can rely upon to determine if one is the kind of person that &quot;gets&quot; programming.</p>\n<p>On the question &quot;A lot of people follow the algorithm, hire everyone we possibly can&quot;, Ben Kuhn's remarks on &quot;threshold hiring&quot; in his <a href=\"http://www.benkuhn.net/no-replace\">post on replaceability</a> are relevant:</p>\n<blockquote>\n<p>Many firms, including e.g. earning-to-give darling Jane Street, do not hire to fill quotas. They hire as many qualified people as come their way. If you take a job at Jane Street, it won’t cause them to deny someone else a job—they’re expanding as fast as they find people who can do the work. </p>\n</blockquote>\n<p>(Minor: the 'Luke' link is broken; and Peter's last name is &quot;Hurford&quot;.)</p>\n", "parentCommentId": null, "user": {"username": "Pablo_Stafforini"}}, {"_id": "9DkYeZAXwRyabTrYY", "postedAt": "2014-09-20T21:16:45.356Z", "postId": "M6TpRMAbrL4zF7Nc7", "htmlBody": "<blockquote>\n<p>You wrote about doctors being &quot;to a large extent replaceable,&quot; and taking this consideration at face-value in the past has made me give less consideration to this possibility. However, if you were a doctor, presumably you could be an earning-to-give doctor?</p>\n</blockquote>\n<p>Yes. Greg Lewis, a British doctor, estimates that earning to give in medicine beats direct medical work by a considerable margin. As he put it in an interview I had with him recently, &quot;the chequebook can likely beat the stethoscope.&quot; He also believes medicine is a reasonably good earning to give career, though probably not as good as other lucrative careers prospective doctors can pursue instead.</p>\n", "parentCommentId": "vCpY28KBKnMptovwN", "user": {"username": "Pablo_Stafforini"}}, {"_id": "6LxtYvGARTXLYikxJ", "postedAt": "2014-09-20T22:35:14.744Z", "postId": "M6TpRMAbrL4zF7Nc7", "htmlBody": "<p>That's wonderful that you are doing talks/blog posts promoting earning to give. I wouldn't have the balls to do that. But no one wants to &quot;be the first&quot; to do something, so without seeing others do it, they wouldn't even consider it. </p>\n", "parentCommentId": null, "user": {"username": "Austen_Forrester"}}, {"_id": "fNTarqsTvcACXKeT3", "postedAt": "2014-09-21T01:50:14.696Z", "postId": "M6TpRMAbrL4zF7Nc7", "htmlBody": "<p>Yes, based on Greg's analyses, this seems pretty clearly true for most developed world medicine. </p>\n<p>However, it's worth noting that Greg's work is mostly about average marginal cases, and it's mostly about the developed world. Circumstances could conspire to make the direct impact win in a few cases. If your top priority cause is developing world health, and you are prepared to practice medicine in a developing nation, then I might lean toward direct action. If you're particularly talented in a highly leveraged area like public health medicine or cost-effectiveness research, then you could make a case either way. We might be able to have a better discussion about this after Greg publishes more on the topic.</p>\n", "parentCommentId": "9DkYeZAXwRyabTrYY", "user": {"username": "RyanCarey"}}]