[{"_id": "kH2DcEZaciJMiChuw", "postedAt": "2024-03-08T16:51:20.472Z", "postId": "M9bweyyMHheu5Thph", "htmlBody": "<p>Pseudonymity should work in most cases to address the risk of reputational damage, albeit at the cost of the potential reputational upsides for posting.</p>", "parentCommentId": null, "user": {"username": "Jason"}}, {"_id": "Jsh9ubMtgBwRp2rk5", "postedAt": "2024-03-08T19:17:52.186Z", "postId": "M9bweyyMHheu5Thph", "htmlBody": "<p>I'd be interested to see you weigh the pros and cons of making it easier to contribute - you don't explicitly say it in the post, but you imply that this would be a good thing by default. The forum is the way it is for a reason, and there are mechanisms put in place both by the forum team and by the community in order to try to keep the quality of the discussion high.&nbsp;</p><p>For example, I would argue that having a high bar for posting isn't a bad thing, and the sliding-scale karma system that helps regulate that is, in extension, valuable. If writing a full post of sufficient quality is time consuming, then there is the quick takes section.&nbsp;</p><p>The Alignment Forum has a significantly higher barrier to entry than this one does, but I think that is fairly universally regarded as an important factor in facilitating a certain kind of discussion either. I can see a lot of value in the EA forum trying to maintain it's current norms in order to mean it still has the potential for productive discussion between people who are sufficiently well-researched. I think meaningfully lowering the bar for participation would mean that the forum would lose some of its ability to generate anything especially novel or useful to the community and I think the quote you included:</p><blockquote><p>For an internet forum it's pretty good. But it's still an internet forum. Not many good discussions happen on the internet.</p></blockquote><p>Somewhat points to that too. I think there should be <i>other</i> forums for people less familiar with EA to participate in discussions, and I think whether or not those currently exist is an interesting discussion.</p><p>Having said all that, I do wonder if that leaves the current forum community particularly vulnerable to groupthink. I'm not really sure what the solution to that is though.</p>", "parentCommentId": null, "user": {"username": "Jonny Spicer"}}, {"_id": "2LYpcL5FFQKXpF8Y6", "postedAt": "2024-03-09T00:09:03.716Z", "postId": "M9bweyyMHheu5Thph", "htmlBody": "<blockquote><p>For an internet forum it's pretty good. But it's still an internet forum. Not many good discussions happen on the internet.&nbsp;</p></blockquote><p><br>This makes me sad because I think EAF in 2015 or 2016 had much better discussions, and shortform still does.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Elizabeth"}}, {"_id": "EmiMnr3CDtyKa6vHL", "postedAt": "2024-03-09T15:34:07.049Z", "postId": "M9bweyyMHheu5Thph", "htmlBody": "<p>If you or someone else wants to expand on this point, I'd be interested in understanding whether that's really the case or in which ways it got better or worse</p>\n", "parentCommentId": "2LYpcL5FFQKXpF8Y6", "user": {"username": "edoarad"}}]