[{"_id": "KoYX4QqzsKt6NWb5d", "postedAt": "2022-09-22T03:15:06.652Z", "postId": "MaN23i6XsSkkgoLY9", "htmlBody": "<p>You make good points here. EA can’t scale without hard conversations about resources - and we also can’t scale if every financial decision is also a cause prioritization decision AND an assessment of our own expected future contribution. That’s impossible and nuts.</p>\n<p>Let’s borrow from the private sector some good heuristics about money (transportation rules of thumb, ex: coach for flights under 5hrs and business class for 5hr+, or literally anything like that). Get smart finance people, have them set policies, and then let the rest of us stay accountable but otherwise not think about it.</p>\n", "parentCommentId": null, "user": {"username": "Emily Dardaman"}}, {"_id": "5HyQKBgG77K9cS45b", "postedAt": "2022-09-22T03:45:44.039Z", "postId": "MaN23i6XsSkkgoLY9", "htmlBody": "<p>Thanks for posting, I think you have some great thoughts! I generally agree with the spirit of this post.</p><p>I do think it's worth noting that what people view as \"excessive\" or \"not frugal\" is not always in line with reality. For instance, many people find it \"excessive\" to order a $10 uber to save 30 minutes, but don't find it excessive to wait until the very last minute to book a train ticket such that the price has increased from $20 to $120. &nbsp;In my view the latter is more excessive. This is just to say that the actual numbers matter, rather than purely the vibes of the spending. But as you say, the vibes matter too for community culture.</p><p>If you haven't already seen them, you might be interested in some other posts on similar issues:</p><ul><li><a href=\"https://forum.effectivealtruism.org/posts/HWaH8tNdsgEwNZu8B/free-spending-ea-might-be-a-big-problem-for-optics-and\">Free Spending EA Might Be A Problem For Optics and Epistemics</a></li><li><a href=\"https://forum.effectivealtruism.org/posts/cfdnJ3sDbCSkShiSZ/ea-and-the-current-funding-situation\">EA and the Current Funding Situation</a></li><li><a href=\"https://forum.effectivealtruism.org/posts/xomFCNXwNBeXtLq53/bad-omens-in-current-community-building\">Bad Omens in Current Community Building</a></li></ul>", "parentCommentId": null, "user": {"username": "ThomasWoodside"}}, {"_id": "dAbuWbA4nkQxEBLRJ", "postedAt": "2022-09-22T03:57:59.948Z", "postId": "MaN23i6XsSkkgoLY9", "htmlBody": "<p>Quick comment: Since there has been a project called EA Funds, up until recently when they merged with Giving What We Can, you might want to consider the phrasing in the headline to avoid confusion. :)\n\"...  EA Money...\"?</p>\n", "parentCommentId": null, "user": {"username": "henrith"}}, {"_id": "QHhzKKFjkGLXovutu", "postedAt": "2022-09-22T04:03:37.193Z", "postId": "MaN23i6XsSkkgoLY9", "htmlBody": "<p>Hm, yeah I thought about that but was thinking the way the grammar worked out it wouldn’t really make sense to interpret it as the EA Funds project. But after getting this feedback I think there is a low enough cost it makes sense to change the name, so I did!</p>\n", "parentCommentId": "dAbuWbA4nkQxEBLRJ", "user": {"username": "Jordan Arel"}}, {"_id": "iar9CCRaye5Znhfuk", "postedAt": "2022-09-22T04:07:19.655Z", "postId": "MaN23i6XsSkkgoLY9", "htmlBody": "<p>I like this! It’s a very clean solution that saves a lot of time and hassle. Maybe the downside is that it takes away some autonomy and feels a little paternalistic and onerous to have a list of rules, but I think it could be simple enough and is not an unreasonable ask such that the benefits may outweigh the downsides.</p>\n", "parentCommentId": "KoYX4QqzsKt6NWb5d", "user": {"username": "Jordan Arel"}}, {"_id": "BHDAH5nuCnyateWZz", "postedAt": "2022-09-22T04:11:14.338Z", "postId": "MaN23i6XsSkkgoLY9", "htmlBody": "<p>Great point, I thought I could go in more detail but I actually originally intended to make this post a fraction of the length it ended up being already. But that could be a great companion post, maybe a list of specific ways that we could be frugal and a detailed analysis of when it would make sense to spend money in order to save more valuable time and resources. And I appreciate those links will definitely check them out!</p>\n", "parentCommentId": "5HyQKBgG77K9cS45b", "user": {"username": "Jordan Arel"}}, {"_id": "SfzSBW4aumaT8rs5f", "postedAt": "2022-09-22T04:57:48.656Z", "postId": "MaN23i6XsSkkgoLY9", "htmlBody": "<p>I'm very sympathetic to some of the signalling benefits of being (or at least appearing to be) frugal.</p>\n<p>I just graduated from a uni with a large EA presence, and most of my very-motivated do-gooder friends were outside of EA (either affiliated with a homeless shelter I worked at, grad student union organizing, or various social justice causes on campus). Most of them were seemingly convinced that the EAs on campus weren't actually interested in doing good, because there was money being spent on sending students to fly abroad for conferences, hosting discussion groups, opening an office/hang out space in our insanely expensive city, etc. Which, to be fair, was a far cry from how the campus homeless shelter I worked at was spending money  — we cherished small donations from our fundraising drives, spending it almost exclusively on programs benefitting the guests we served, often just getting together basic bits of clothing and hygiene products.</p>\n<p>I tried to explain to my friends the EA argument for spendy-ness (I still believe it is the best way to do good, deep down) but I just couldn't seem to convince them that it wasn't a ruse of motivated reasoning.  Looking back on it, I'm bummed that some of my most passionate and talented friends, who were already choosing careers based on serving others, were turned off by this. I wish my friends' first image of EA had even more similar to mine — things like the GWWC pledge and Singer's famine affluence and morality — as I think that would have sold them on EA in the same way it first sold me on it. But they just saw social gatherings and professional development, and for students who were skipping out on studying and social events to do on-the-ground organizing and volunteering and public service, EA just didn't seem all that selfless to begin with. I couldn't really convince them otherwise, and I'm sad about that.</p>\n", "parentCommentId": null, "user": {"username": "Tyler Johnston"}}, {"_id": "ZQapxiyuEQ5FN4pJp", "postedAt": "2022-09-22T05:53:27.036Z", "postId": "MaN23i6XsSkkgoLY9", "htmlBody": "<p>Wow. This is a really great concrete story of the benefit of signaling. Yeah, I find it so fascinating how Effective Altruism has evolved, and I really love all parts of it and think it is a very natural progression which somewhat mirrors my own. It is really unfortunate that not everyone sees this whole context, and I agree worth putting some effort into managing impressions even if it is in a sense a sort of marketing “pacing” which gradually introduces more advanced concepts rather than throwing out some of the crazier sounding bits of EA right off the bat</p>\n", "parentCommentId": "SfzSBW4aumaT8rs5f", "user": {"username": "Jordan Arel"}}, {"_id": "77Ww7mEC82RQMjkKS", "postedAt": "2022-09-22T12:18:59.910Z", "postId": "MaN23i6XsSkkgoLY9", "htmlBody": "<p>For personal spending, it should just be guidelines / recommendations that people can follow at will. For EA orgs’ money, it can be more like “we usually don’t comp first class plane tickets, talk to us if your situation is different”</p>\n", "parentCommentId": "iar9CCRaye5Znhfuk", "user": {"username": "Emily Dardaman"}}, {"_id": "LQ5Fe8ieaa4F4xhTe", "postedAt": "2022-09-22T12:36:01.024Z", "postId": "MaN23i6XsSkkgoLY9", "htmlBody": "<p>I mostly agree with you, but wanted to give my opinion on a few points:</p>\n<ol>\n<li>This kind of Bostromian calculus is basically Pascal's mugging. We have such huge uncertainty about wether we'll spread to space, how many people there will be, when it will happen and what our personal part in it will be, that trying to reason about it is meaningless.</li>\n<li>Spending lots of money on EAs doesn't attract people who value effectiveness. It attracts people who like having money spent on them.</li>\n<li>But that doesn't mean it's negative to spend money like this - I don't necessarily think it is. We have to have a sustainanle core in order to help solve problems over a long time. I'm not really sure where the line passes.</li>\n</ol>\n<p>Edit: after reading the article you linked to, I feel obliged to say that I remember interacting with the author on the forum. I think there may be other contributing factors to his experience.</p>\n", "parentCommentId": null, "user": {"username": "Guy Raveh"}}, {"_id": "j7vtAGmhPHekFLaPy", "postedAt": "2022-09-22T14:31:49.090Z", "postId": "MaN23i6XsSkkgoLY9", "htmlBody": "<p>\"So if a $50 Uber ride saves me half an hour, my half an hour must be more valuable than a three months of someone else’s life. That’s a pretty big claim.\"<br><br>That line hit hard. Something about reducing it to such a small scale made it really hit home - I can actually <i>viscerally &nbsp;</i>understand why there are people who agonise over every purchase and struggle so much with guilt. I've always been able to emotionally remain distant - to donate my 10%, save lives each year, and yet somehow be okay with not donating more, even though I could. Thinking of it in terms of a single purchase and weeks/months of someone's life makes it feel so much more <i>real</i> all of a sudden, and my justifications of Schelling points and sustainable giving feel much more hollow.</p>", "parentCommentId": null, "user": {"username": "Jay Bailey"}}, {"_id": "Pk6ib5kEezZvdmSGG", "postedAt": "2022-09-23T03:41:16.947Z", "postId": "MaN23i6XsSkkgoLY9", "htmlBody": "<p>Damn. Yeah I guess I implicitly think like this a lot, I feel very torn between telling you it’s okay don’t worry about it each person has their own comfort level, versus yeah, it’s real and those are real people and we’re really sacrificing their lives for petty pleasures.</p>\n<p>I think a few things that help me:</p>\n<ol>\n<li>\n<p>Personally I feel I have much higher leverage with direct work rather than donations, so while money is a consideration it isn’t as important as time and focus on what’s highest leverage. Also, with direct work you can sometimes get sharply increasing returns, an effective entrepreneur or content creator may be many orders of magnitude better than an unsuccessful one. This may or may not apply to you.</p>\n</li>\n<li>\n<p>I don’t feel things I can spend money on is a primary determinant of my happiness . Most luxuries on the hedonic treadmill don’t actually significantly make me happier long-term, what makes me happy is doing healthy things like diet &amp; exercise (which also improve my productivity), spending time with people I love, and most of all, living by my values and knowing I am doing my best to help those in need (and so being able to help them a massive amount is a positive)</p>\n</li>\n<li>\n<p>I don’t believe other people are full separate or different than myself. In some profound and deep sense helping them feels like helping myself, firstly enlightened self-interest where it feels good and makes me happier to help others, but in another sense maybe we fundamentally are the same universal consciousness behind each mask of individuality, a position called “open individualism.” Basically my consciousness is literally the same consciousness in each conscious being. Sorry if it sounds a little new-agey, but it really does help me not feel like I’m sacrificing so much, even if there’s only a small chance it’s true, since I have such absurd leverage the selfish expected value that it might be true could still bex extremely high.</p>\n</li>\n</ol>\n<p>Hope this helps, let me know your thoughts!</p>\n", "parentCommentId": "j7vtAGmhPHekFLaPy", "user": {"username": "Jordan Arel"}}, {"_id": "kMdcP2nFRvhHrJgu9", "postedAt": "2022-09-23T09:37:39.340Z", "postId": "MaN23i6XsSkkgoLY9", "htmlBody": "<blockquote><p>But then that only makes sense if the work I’m doing is extremely extremely valuable, because I still have to compare it against the bar of $200 equals ~1 year of life saved.</p></blockquote><p>That seems at least an order of magnitude wrong. From <a href=\"https://www.givewell.org/cost-to-save-a-life\">GiveWell</a>:</p><blockquote><p>Because the initial outputs of these charities are so inexpensive (for example, it costs about $5 to purchase and deliver an insecticide-treated net), many people are surprised at how expensive it is to save a life—about $4,500 on average for funding we directed in 2020.<a href=\"https://www.givewell.org/cost-to-save-a-life#footnote1_et5f3mb\">1</a></p></blockquote><p>I also think that GiveWell numbers are rather on the optimistic end than the pessimistic end, so I would expect the true cost to be higher.&nbsp;</p>", "parentCommentId": null, "user": {"username": "ChristianKleineidam"}}, {"_id": "syKqcEuNFKruCsHL5", "postedAt": "2022-09-23T10:29:16.160Z", "postId": "MaN23i6XsSkkgoLY9", "htmlBody": "<p>It's hard to stop this argument from heading down the <a href=\"https://www.lesswrong.com/posts/6cRhG6PKeASdNHqxD/dead-child-currency\">Dead Children Currency</a> route. I think your heuristic that we should try to balance convenience with not being wasteful is right, and the optimizing heuristic that we should only spend on things that are more effective than giving that money away is wrong. It feels wrong in the same way that it would feel wrong to say \"we should only spend time doing (activity if that activity is highly effective/it would increase our productivity in EA work\". EA is a community, for better or worse, and I think it's bad for communities to create norms that are bad for community members well-being. I think a counterfactual norm of comparing all spending decisions to the potential impact of donating that money would be terrible for the well-being of EAs, especially very scrupulous EAs. <a href=\"https://forum.effectivealtruism.org/posts/AjxqsDmhGiW9g8ju6/effective-altruism-in-the-garden-of-ends\">Effective altruism in the garden of ends</a> talks beautifully about the dark side of bringing such a demanding framework into everyday decisions.</p>\n<p>That obviously does not mean all forms of EA spending are good, or even that most of them are. It's a false dichotomy to say the only options are to spend on useless luxuries or to obsess over dead children currency. But it does suggest that we should have a more heuristic approach to feeling out when spending is too much spending. Yes, we shouldn't spend on Ubers just because EA is footing the bill. Take the BART in most cases. But if it's late at night and you don't want to be on the BART then don't force yourself into a scary situation because you were scared of wasting money that could save lives.</p>\n", "parentCommentId": null, "user": {"username": "therealslimkt"}}, {"_id": "yecRwAkibZkyz3wqz", "postedAt": "2022-09-23T10:32:33.798Z", "postId": "MaN23i6XsSkkgoLY9", "htmlBody": "<p>$4,500 is the cost to save a life, whereas $200 is the quote for saving 1 year of life. Saving a life produces, IIRC, somewhere around 25-30 QALY's. So, $200/year would be correct, accounting for rounding, if GiveWell's estimates are trustworthy.</p>", "parentCommentId": "kMdcP2nFRvhHrJgu9", "user": {"username": "Jay Bailey"}}, {"_id": "qjTLiAuL7gkxWzK4h", "postedAt": "2022-09-23T12:51:30.147Z", "postId": "MaN23i6XsSkkgoLY9", "htmlBody": "<p>This is really sad to hear. Thank you for sharing.</p>", "parentCommentId": "SfzSBW4aumaT8rs5f", "user": {"username": "Michelle_Hutchinson"}}, {"_id": "JLCZgAs4fXmwqvbKr", "postedAt": "2022-09-23T20:28:17.894Z", "postId": "MaN23i6XsSkkgoLY9", "htmlBody": "<p><a href=\"\">In the GiveWell article I quoted </a>they estimate an uber-5-year-old life saved costs $7000, for 37 DALYs, &nbsp;which equals about $189 per life year saved. But if it was actually $4500 per life as you suggest, that would be closer to $121 per life year saved or about 5 months of life for $50 instead of 3 months as I said, but I would rather err on the conservative side.</p>", "parentCommentId": "kMdcP2nFRvhHrJgu9", "user": {"username": "Jordan Arel"}}, {"_id": "EedsdDWwF3ahABK4g", "postedAt": "2022-09-25T07:26:59.063Z", "postId": "MaN23i6XsSkkgoLY9", "htmlBody": "<p>I have largely similar thoughts, but one disagreement:</p>\n<p>“On the first level, you could say that money is really valuable…Against that you could argue that, well, we have an insane amount of money for the size of the movement” [cant see block quote option]</p>\n<p>Yes, and I’d argue this (I.e. the interaction between these two levels) is where marginal changes and critiques should be directed because it’s where in practice reasons-responsive decisions about gazzilions of dollars are made.</p>\n<p>That is, “EA” (really, a number of different people to different degrees, some of whom have &gt;$10^9) have decided not to fully fund [both of our top charities] this coming year for some set of reasons having to do with cause prioritization. At the top, “EA” can decide that the next marginal dollar should go to GiveWell instead of wherever it’s implicitly going now. Unless I’m missing something it really is a $1-$1 tradeoff</p>\n<p>But afaik saving $100 on total top-down EA Global-related spending doesn’t result in $100 going to GiveWell. I don’t understand the funding landscape/mechanisms well enough to know where it goes, but I’d guess it essentially winds up in slightly more slack in the system at the top, which might result in, i don’t know, $5 (?) going to GiveWell, and $95 (??) coming back down in the form of nicer food at some retreat in 2024 (or something, I really don’t know)</p>\n<p>If I have this mostly right, I think the main implication is that any argument against waste should mostly be an argument about where money gets directed some number of layers up.</p>\n<p>As with Jordan, correct me if/where I’m wrong!</p>\n", "parentCommentId": null, "user": {"username": "aaronb50"}}, {"_id": "YW8HPRjX7kmMvY8vr", "postedAt": "2022-09-25T18:07:04.961Z", "postId": "MaN23i6XsSkkgoLY9", "htmlBody": "<p>Yes, I think it is a very difficult and perhaps neccesarily uneasy balancing act, at least for those whose main or sole priority is to maximize impact. Minimum viable self-care is quite problematic, but it is not plausible we can maximize impact without any sacrifice whatsoever either</p>\n", "parentCommentId": "syKqcEuNFKruCsHL5", "user": {"username": "Jordan Arel"}}, {"_id": "ucFm76FHGRpjKHxRK", "postedAt": "2022-09-25T18:24:17.174Z", "postId": "MaN23i6XsSkkgoLY9", "htmlBody": "<p>Very good point. Considering last dollar spent or marginal dollar spent lowers these numbers by quite a lot - though I think even an order of magnitude still gives you quite high numbers</p>\n", "parentCommentId": "EedsdDWwF3ahABK4g", "user": {"username": "Jordan Arel"}}]