[{"_id": "pJa5feNekAyX9fPuc", "postedAt": "2024-01-12T08:45:44.309Z", "postId": "MayBxEme6mWn9fswG", "htmlBody": "<p>Thoughts about EGI vs policy advocacy, Joey? Odds of success will should be lower but expected impact higher than either DD/EGI. For learning value I imagine it's something in between - strong emphasis on communications, but you're also working in a local LMIC context, and forced to adapt, unlike EGI attempts based in your home country.</p>", "parentCommentId": null, "user": {"username": "Joel Tan"}}, {"_id": "9oinbsMvHakkoHSSY", "postedAt": "2024-01-12T11:10:27.083Z", "postId": "MayBxEme6mWn9fswG", "htmlBody": "<p>Only because you mentioned it Joey (or if anyone else knows!): Do you know if there is any advice lying around (e.g. in old Google Docs) on how to raise the most funds for one's birthday fundraisers? I am asking as you wrote:&nbsp;</p><blockquote><p>supporting people donating funds for their birthdays</p></blockquote><p>I am asking as I have thought about this on several occasions and want to try again this year running a more successful birthday fundraiser. I have asked a bit around and there seems to be some interest in this but absolutely no EA advice. Or perhaps the advice is the same for EA fundraisers as it is for non-EA fundraisers.</p>", "parentCommentId": null, "user": {"username": "Ulrik Horn"}}, {"_id": "rL9SN3CcSnTazmXfC", "postedAt": "2024-01-12T11:48:52.441Z", "postId": "MayBxEme6mWn9fswG", "htmlBody": "<p>Hey Ulrik!&nbsp;</p><p>GWWC has this advise about '<a href=\"https://www.givingwhatwecan.org/en-GB/get-involved/birthday-fundraisers\">why and how you should run a birthday fundraiser</a>'.</p><p>I hope that helps :)&nbsp;</p>", "parentCommentId": "9oinbsMvHakkoHSSY", "user": {"username": "Luke Moore"}}, {"_id": "fwoiptKHYroEFaEJw", "postedAt": "2024-01-12T12:01:03.171Z", "postId": "MayBxEme6mWn9fswG", "htmlBody": "<p>I do not know why I did not come across that excellent and comprehensive advice when I was previously searching around for such guidance. Thanks so much that is <i>exactly</i> what I was looking for.</p>", "parentCommentId": "rL9SN3CcSnTazmXfC", "user": {"username": "Ulrik Horn"}}, {"_id": "ZX7Kmu6eXiA8KEt6F", "postedAt": "2024-01-13T14:30:52.057Z", "postId": "MayBxEme6mWn9fswG", "htmlBody": "<p>thanks for posting your thoughts</p>", "parentCommentId": "9oinbsMvHakkoHSSY", "user": {"username": "olivia ali"}}, {"_id": "QqqYwB6sukJnqHzac", "postedAt": "2024-01-17T16:39:01.740Z", "postId": "MayBxEme6mWn9fswG", "htmlBody": "<p>Hello Joey\nI am Chukwubuikem from Nigeria.\nI must confess you are doing a good job.\nI get your emails and that of Kristina\nIt's enriching\nI find it disturbing that no African country is in your high-priority areas in 2024 despite the mirage of global issues weighing the continent down and which is deserving of help from its dwellers and international organizations to solve such issues.</p>\n", "parentCommentId": null, "user": {"username": "Chukwubuikem Daniel Oyiga"}}, {"_id": "mf7mrJpzFpGrygojf", "postedAt": "2024-01-17T17:38:23.513Z", "postId": "MayBxEme6mWn9fswG", "htmlBody": "<p>Hi Chukwubuikem!\nI might be misunderstanding your point but if you are referring to the Effective Giving charities, this is by design! We should expect most prospective donors to be in countries with high income levels, and so a charity whose main objective is to grow the pool of donors and the amount of funds committed to charitable causes should focus on countries like France, Australia, the UK, or Germany!</p>\n<p>If you look at the direct intervention charities that Joey is talking about here (and that have been incubated by CE so far), you can see that many of them operate in and focus on African countries! (e.g. LEEP or FEM)</p>\n", "parentCommentId": "QqqYwB6sukJnqHzac", "user": {"username": "Moritz von Knebel"}}, {"_id": "yp4c2kgNhL9QhNoEb", "postedAt": "2024-01-17T22:35:03.441Z", "postId": "MayBxEme6mWn9fswG", "htmlBody": "<p>I appreciate the insight Mvk\nI understand better now\nI applied for the incubation and I live in Lagos, Nigeria.\nI was confused when I saw the high-priority list on their website.</p>\n", "parentCommentId": "mf7mrJpzFpGrygojf", "user": {"username": "Chukwubuikem Daniel Oyiga"}}]