[{"_id": "4g97aopN6GpRT5kvt", "postedAt": "2015-01-08T18:08:31.588Z", "postId": "MbTxNy2CNPwdd67vu", "htmlBody": "<blockquote>\n<p>Meanwhile, there were doubts from others who didn’t feel this way. The “we need heroes, the world needs heroes” narrative is especially strong in the rationalist community.</p>\n</blockquote>\n<p>What are rationalist heroes supposed to do? And what can “sidekicks” do to help them? (I ask these questions as someone who’s not that familiar with the rationalist community.)</p>\n", "parentCommentId": null, "user": {"username": "Tom_Ash"}}, {"_id": "p53Dqk86G4K7CpihX", "postedAt": "2015-01-08T18:39:30.726Z", "postId": "MbTxNy2CNPwdd67vu", "htmlBody": "<p><a href=\"http://lesswrong.com/lw/lig/the_importance_of_sidekicks/\">This post has also been cross-posted on LessWrong.</a></p>\n", "parentCommentId": null, "user": {"username": "Peter_Hurford"}}, {"_id": "fnuoJJhxmesgT3rG4", "postedAt": "2015-01-08T19:06:07.716Z", "postId": "MbTxNy2CNPwdd67vu", "htmlBody": "<p>A hero means roughly what you'd expect - someone who takes personal responsibility for solving world problems. Kind of like an effective altruist. A sidekick doesn't have any specific jargon meaning.</p>\n<p>For a bit more flavour, here's a description from hpmor:</p>\n<blockquote>\n<p>You could call it heroic responsibility, maybe,” Harry Potter said. “Not like the usual sort. It means that whatever happens, no matter what, it’s always your fault. Even if you tell Professor McGonagall, she’s not responsible for what happens, you are. Following the school rules isn’t an excuse, someone else being in charge isn’t an excuse, even trying your best isn’t an excuse. There just aren’t any excuses, you’ve got to get the job done no matter what.” Harry’s face tightened. “That’s why I say you’re not thinking responsibly, Hermione. Thinking that your job is done when you tell Professor McGonagall—that isn’t heroine thinking. Like Hannah being beat up is okay then, because it isn’t your fault anymore. Being a heroine means your job isn’t finished until you’ve done whatever it takes to protect the other girls, permanently.” In Harry’s voice was a touch of the steel he had acquired since the day Fawkes had been on his shoulder. “You can’t think as if just following the rules means you’ve done your duty. –HPMOR, chapter 75.</p>\n</blockquote>\n", "parentCommentId": "4g97aopN6GpRT5kvt", "user": {"username": "RyanCarey"}}, {"_id": "yGB9xfjeydDWDCnQp", "postedAt": "2015-01-08T20:50:49.452Z", "postId": "MbTxNy2CNPwdd67vu", "htmlBody": "<p>Are there really that many opportunities to be a &quot;sidekick&quot; in EA?  The opening for Bostrom's assistant is the only one I can think of.  I know some EA orgs use virtual assistants, but my impression is that there's a large supply of these people outside EA, and they can be hired fairly cheaply.  </p>\n", "parentCommentId": null, "user": {"username": "Lila"}}, {"_id": "nArgEyPCSPovRLxWE", "postedAt": "2015-01-08T21:24:57.373Z", "postId": "MbTxNy2CNPwdd67vu", "htmlBody": "<p>What an amazing post! Really valuable point, so clearly made. Thanks very much Miranda, and Ryan for cross-posting.</p>\n", "parentCommentId": null, "user": {"username": "Michelle_Hutchinson"}}, {"_id": "phksDeyMdn9iK3Cxh", "postedAt": "2015-01-08T23:09:39.348Z", "postId": "MbTxNy2CNPwdd67vu", "htmlBody": "<p>We actually need more people with this mindset at the moment.</p>\n<p>It's true that we could hire general assistants, and now that we are more financially sustainable we will consider doing so in the future.</p>\n", "parentCommentId": "yGB9xfjeydDWDCnQp", "user": {"username": "Robert_Wiblin"}}, {"_id": "kPuzC7xP3X4eNWdTg", "postedAt": "2015-01-08T23:25:13.790Z", "postId": "MbTxNy2CNPwdd67vu", "htmlBody": "<p>&quot;We actually need more people with this mindset at the moment.&quot;</p>\n<p>What do you mean?  Can you give a specific example?</p>\n", "parentCommentId": "phksDeyMdn9iK3Cxh", "user": {"username": "Lila"}}, {"_id": "9dykJC8YSN68uR9tn", "postedAt": "2015-01-09T00:28:12.350Z", "postId": "MbTxNy2CNPwdd67vu", "htmlBody": "<p>Well a lot of people want to be leaders, perhaps more than is realistic within any one organisation (though we do our best to give everyone a lot of autonomy as individuals, and also run a range of projects which themselves have a lot of autonomy).</p>\n<p>We really need someone to handle office management, logistics and some PA work. We are likely to hire someone for this in the coming round, but it hasn't been easy to find anyone who will commit to that kind of work for a significant period of time.</p>\n", "parentCommentId": "kPuzC7xP3X4eNWdTg", "user": {"username": "Robert_Wiblin"}}, {"_id": "STLowZYYmZ4BfyxXb", "postedAt": "2015-01-09T03:01:23.887Z", "postId": "MbTxNy2CNPwdd67vu", "htmlBody": "<blockquote>\n<p>A hero means roughly what you'd expect - someone who takes personal responsibility for solving world problems. Kind of like an effective altruist.</p>\n</blockquote>\n<p>What I understand about rationality 'heroes' is limited to what I've gleaned from Miranda's post, but to me it seems like earning to give fits much more naturally into a sidekick category than into a hero category.</p>\n", "parentCommentId": "fnuoJJhxmesgT3rG4", "user": {"username": "pappubahry"}}, {"_id": "NQKaeWp4eZQoa5FCA", "postedAt": "2015-01-09T05:56:04.521Z", "postId": "MbTxNy2CNPwdd67vu", "htmlBody": "<p>I see the hero as the one pushing innovative new strategies for world-changing (eg. starting a business in that area, like Givewell - specifics subject to what changes the hero wants to make), while the sidekicks are the ones that help out by being employed in that business (in a non-directing role) or donating to it or providing moral support etc. - they help what's already been created do better, and thus have to choose from people/causes that already exist rather than creating their own.</p>\n", "parentCommentId": "4g97aopN6GpRT5kvt", "user": {"username": "GreyArea"}}, {"_id": "3s3erLuBBoCKNk96n", "postedAt": "2015-01-09T10:22:13.590Z", "postId": "MbTxNy2CNPwdd67vu", "htmlBody": "<blockquote>\n<p>A hero means roughly what you'd expect - someone who takes personal responsibility for solving world problems. Kind of like an effective altruist. </p>\n</blockquote>\n<p>In that case doesn't the sort of &quot;sidekick&quot; that Miranda describes count as a hero, because being a sidekick is plausibly one of the best ways that they can contribute to solving the world's problems?</p>\n<p>I was wondering what rationalist heroes are supposed to do more specifically - can you shed any light on that? :)</p>\n", "parentCommentId": "fnuoJJhxmesgT3rG4", "user": {"username": "Tom_Ash"}}, {"_id": "62bvfMpCkcH2EsZs6", "postedAt": "2015-01-09T10:22:34.541Z", "postId": "MbTxNy2CNPwdd67vu", "htmlBody": "<p>What would examples of new such strategies and businesses be?</p>\n", "parentCommentId": "NQKaeWp4eZQoa5FCA", "user": {"username": "Tom_Ash"}}, {"_id": "q6EK5mTaM9HhepwFB", "postedAt": "2015-01-09T11:04:05.474Z", "postId": "MbTxNy2CNPwdd67vu", "htmlBody": "<p>I think if you're having difficulty understanding what they mean by hero, it's because you're thinking too concretely, not because people are using the word in an atypical way. I can try to describe the tasks anyway - often they're someone who uses skills like bravery, leadership and insight to perform difficult and important tasks for society's benefit. But you can be a hero without meeting those specific criteria. It's more of an aesthetic.</p>\n", "parentCommentId": "3s3erLuBBoCKNk96n", "user": {"username": "RyanCarey"}}, {"_id": "viMXiuihuGTmtBK4J", "postedAt": "2015-01-09T15:59:13.225Z", "postId": "MbTxNy2CNPwdd67vu", "htmlBody": "<p>I've heard people who've worked at EA organisations say that the people doing that work struck them as some of the most altruistic, because it didn't have the rewards or glory or fun associated with more visible work.</p>\n", "parentCommentId": "9dykJC8YSN68uR9tn", "user": {"username": "Vincent_deB"}}, {"_id": "RAadjAcLR4M3x6KTb", "postedAt": "2015-01-10T00:52:37.515Z", "postId": "MbTxNy2CNPwdd67vu", "htmlBody": "<p>I recall Ruiari making an excellent sidekick to Brian Tomasik once.</p>\n", "parentCommentId": "yGB9xfjeydDWDCnQp", "user": {"username": "Peter_Hurford"}}, {"_id": "7vTpKwkL4swnmXyE3", "postedAt": "2015-01-10T01:50:19.057Z", "postId": "MbTxNy2CNPwdd67vu", "htmlBody": "<p>+1</p>\n", "parentCommentId": "RAadjAcLR4M3x6KTb", "user": {"username": "alexquest132"}}, {"_id": "woTyXx4fMNaubFxkd", "postedAt": "2015-01-12T02:50:26.739Z", "postId": "MbTxNy2CNPwdd67vu", "htmlBody": "<blockquote>\n<p>We really need someone to handle office management, logistics and some PA work.</p>\n</blockquote>\n<p>Does the person need to be an EA? It seems that Samwise could have been replaced with a Dwarven mercenary. Is the concern you would have to pay such a person more if they lacked inherent motivation?</p>\n", "parentCommentId": "9dykJC8YSN68uR9tn", "user": {"username": "Dale"}}]