[{"_id": "fcekeWmzfExn99qit", "postedAt": "2018-06-06T22:38:18.392Z", "postId": "MDxaD688pATMnjwmB", "htmlBody": "<p>I’m really curious which description of\nEA you used in your study, could you post that here? What kind of attitudes towards EA did you ask about?</p>\n<p>I can imagine there might be very different results depending on the framing. </p>\n<p>My take on this is that while many more people than now might agree with EA ideas, fewer of them will find the lived practice and community to be a good fit. I think that’s a pretty unfortunate historical lock in. </p>\n", "parentCommentId": null, "user": {"username": "Denise_Melchin"}}, {"_id": "YSM5pyhuhCHps9GEA", "postedAt": "2018-06-06T22:58:36.339Z", "postId": "MDxaD688pATMnjwmB", "htmlBody": "<p>This is so interesting! I'd love more details about your methods. For example, for the different identifiers (black/white, Christian/atheist), how many of each group were surveyed? How was the survey group recruited? How significant were the results and what was the effect size? Any extra details would be helpful so I know how much to update. </p>\n", "parentCommentId": null, "user": {"username": "Khorton"}}, {"_id": "EzA3NixNcE2WnztEs", "postedAt": "2018-06-06T23:38:58.393Z", "postId": "MDxaD688pATMnjwmB", "htmlBody": "<p>Thanks Ari for your post. \nThis is very interesting and an important research question. I also believe that EA ideas can be appealing to people far beyond the current demographic of EAs (which I think is strongly influenced by founders effects). </p>\n<p>Are you able to share the details of your SEGS scale? I think the details of the scale would be interesting. I can see that you have a high correlation between Empathy and SEGS. In particular I am wondering what the chances that generally altruistic people are choosing the high SEGS answers because they look like the most empathetic answers, even if the person isn't particularly effective in general with their altruism - you may have found a way to feather this out. </p>\n<p>And also I can't seem to click the links to the EQ and CRT scales etc in your pdf - that might just be me, but a list of links would be great!</p>\n", "parentCommentId": null, "user": {"username": "cafelow"}}, {"_id": "ZKdkrKqgqjkyzo3T5", "postedAt": "2018-06-06T23:41:17.004Z", "postId": "MDxaD688pATMnjwmB", "htmlBody": "<blockquote>\n<p>I’m really curious which description of EA you used in your study, could you post that here? What kind of attitudes towards EA did you ask about?</p>\n</blockquote>\n<p>+1. There's a big gap, I'd guess, between &quot;your dollar goes further overseas&quot; and &quot;we must reduce risk from runaway AI&quot;.</p>\n<blockquote>\n<p>while many more people than now might agree with EA ideas, fewer of them will find the lived practice and community to be a good fit. I think that’s a pretty unfortunate historical lock in</p>\n</blockquote>\n<p>Serious question: Could we start a new one?</p>\n", "parentCommentId": "fcekeWmzfExn99qit", "user": {"username": "Peter_Hurford"}}, {"_id": "PZtZnJL6hYphu8ghv", "postedAt": "2018-06-07T10:10:53.985Z", "postId": "MDxaD688pATMnjwmB", "htmlBody": "<p>I really admire that you did a study about this, but I think that this study shows much less than you claim to. First of all, you studied support for effective giving (EG), which is different from effective altruism as a whole. I would suspect at least the following three factors to really be different between EG and EA:</p>\n<ul>\n<li>Support for cause impartiality, both moral impartiality (measuring each being according to their innate characteristics like sentience or intelligence, rather than personal closeness) and means impartiality (being indifferent between different means to an end, e.g. donating money or choosing a career with direct impact</li>\n<li>Dedication. I believe that making career changes or pledging at least 10% of your income to donate is quite a high bar and much fewer people would be inclined to that.</li>\n<li>Involvement in the community. As you wrote the community is quite idiosyncratic. Openness to (some of) its ideas does not imply people will like the movement.</li>\n</ul>\n<p>Of course, not all of this implies that the study is worthless, that getting people to donate their 1 or 2% more effectively is useless, or that we shouldn't try to make the movement more diverse and welcoming (if this can be done without compromising core values such as epistemic rigor). I think there is a debate to be held how to differentiate effective giving from EA as a whole, so that we can decide whether or not to promote effective giving seperately and if so, how.</p>\n", "parentCommentId": null, "user": {"username": "SiebeRozendal"}}, {"_id": "NfQtEqD6CQSc2xGHN", "postedAt": "2018-06-07T11:14:36.335Z", "postId": "MDxaD688pATMnjwmB", "htmlBody": "<p>Thanks both, great point. We focused the description in this study on the effective giving and career choice aspects of EA, and the results may well be different depending on the framing -- it'd be worth replicating with something like x-risk. Here's the full description (built from ea.org): </p>\n<p>&quot;What is Effective Altruism? Thinking carefully about how to do good. Effective altruism is about answering one simple question: how can we use our resources to help others the most? Rather than just doing what feels right, we use evidence and careful analysis to find the very best causes to work on.</p>\n<p>Most of us want to make a difference. We see suffering, injustice and death, and are moved to do something about them. But working out what that ‘something’ is, let alone doing it, is a difficult problem.\nWhich cause should you support if you really want to make a difference? What career choices will help you make a significant contribution? Which charities will use your donation effectively? If you don’t choose well, you risk wasting your time and money. But if you choose wisely, you have a tremendous chance to improve the world.</p>\n<p>Effective altruism considers tradeoffs like the following: Suppose we want to fight blindness. For $40,000 we can provide guide dogs to blind people in the US. Or for $20 per patient, we can pay for surgery reversing the effects of trachoma in Africa (a disease which causes blindness). If people have equal moral value, then the second option is more than 2,000 times better than the first.&quot;</p>\n", "parentCommentId": "ZKdkrKqgqjkyzo3T5", "user": {"username": "NickFitz"}}, {"_id": "4AkeL5aNaW2C2XyWJ", "postedAt": "2018-06-07T11:39:06.092Z", "postId": "MDxaD688pATMnjwmB", "htmlBody": "<p>Thanks for this. The SEGS consisted of seven items on a 7-point Likert agree/disagree scale: (1) I am interested in Effective Altruism, (2) I would like to learn more about Effective Altruism, (3) I support the Effective Altruism movement, (4), I would share information about Effective Altruism with people in my network, (5) I identify as an &quot;effective altruist,&quot; (6) I would like to meet others who support Effective Altruism, and (7) I will donate my money based on Effective Altruism. We also measured a few more-behavioral outcomes e.g., a windfall donation task (in which participants allocated money between Deworm the World, Make a Wish, a local choir, and keeping it for themselves), and willingness to sign the GWWC pledge. For the SEGS x Empathy relationship, we controlled for past giving behavior to try to feather that out. </p>\n<p>Ah yes, the links to the scales don't appear to work in the PDF, here are open-access versions:</p>\n<p>EQ: <a href=\"http://docs.autismresearchcentre.com/papers/2004_Lawrence_etal_MeasuringEmpathy.pdf\">http://docs.autismresearchcentre.com/papers/2004_Lawrence_etal_MeasuringEmpathy.pdf</a></p>\n<p>IRI: <a href=\"http://fetzer.org/sites/default/files/images/stories/pdf/selfmeasures/EMPATHY-InterpersonalReactivityIndex.pdf\">http://fetzer.org/sites/default/files/images/stories/pdf/selfmeasures/EMPATHY-InterpersonalReactivityIndex.pdf</a></p>\n<p>MFQ-20: <a href=\"http://www.moralfoundations.org/questionnaires\">http://www.moralfoundations.org/questionnaires</a> </p>\n<p>TIPI: <a href=\"https://gosling.psy.utexas.edu/scales-weve-developed/ten-item-personality-measure-tipi/\">https://gosling.psy.utexas.edu/scales-weve-developed/ten-item-personality-measure-tipi/</a> </p>\n<p>MS-S: <a href=\"http://journal.sjdm.org/16/16129b/jdm16129b.pdf\">http://journal.sjdm.org/16/16129b/jdm16129b.pdf</a> </p>\n<p>CRT: <a href=\"http://journal.sjdm.org/15/151029/jdm151029.pdf\">http://journal.sjdm.org/15/151029/jdm151029.pdf</a></p>\n", "parentCommentId": "EzA3NixNcE2WnztEs", "user": {"username": "NickFitz"}}, {"_id": "cofcRGnHRfeE6YZTE", "postedAt": "2018-06-07T11:42:15.647Z", "postId": "MDxaD688pATMnjwmB", "htmlBody": "<p>Hi Siebe - it's definitely worth distinguishing effective giving, career choice, x-risk, etc. There's likely a whole host of factors that differ between them. To your point (and Peter's question above), it's worth sorting out how we handle this differentiation.</p>\n", "parentCommentId": "PZtZnJL6hYphu8ghv", "user": {"username": "NickFitz"}}, {"_id": "wP5TM7FSLsPEc6jvx", "postedAt": "2018-06-07T14:58:56.530Z", "postId": "MDxaD688pATMnjwmB", "htmlBody": "<p>Thanks Siebe - while I certainly agree that we don't take the most extreme form of effective altruism, I don't think it's actually as focused on narrow Effective Giving as you suggest. We used that language in the original write up because we wanted it to be accessible to a non EA audience. But if you look at the language of the actual description (Nick posted it above), we took that from effectivealtruism.org, and it actually focuses pretty broadly on trying to do good, not just on donating.</p>\n<p>But as we mention, I think this is just the tip of the iceberg, I don't think this research is at all the end of the story. We've been working on a follow-up study that includes cause neutrality, but it would be great to see people study similar questions on more extreme forms of effective altruism, and maybe even include an element of the community. </p>\n", "parentCommentId": "PZtZnJL6hYphu8ghv", "user": {"username": "arikagan"}}, {"_id": "Z9us86x8ponkc9f3D", "postedAt": "2018-06-07T15:14:04.785Z", "postId": "MDxaD688pATMnjwmB", "htmlBody": "<p>As Nick said, it would be wonderful to see follow-up studies here that try to flesh out these different aspects. We don't think we're covering everything in EA (although the description Nick posted below is from effectivealtruism.org, so it seemed like a decent first attempt). But that certainly seems correct, you could have very different answers to &quot;who likes extreme altruism&quot;, &quot;who likes AI safety&quot;, etc. </p>\n<p>The community question is particularly interesting one because it might be more of a historical artifact than a necessary trait of the movement. There could be people who would be a perfect fit for ideas of EA (however defined: x-risk, donating 50%, etc), but still might not like the current community. How to actually deal with that finding would be a different question, but it seems like that would be worth knowing. </p>\n", "parentCommentId": "ZKdkrKqgqjkyzo3T5", "user": {"username": "arikagan"}}, {"_id": "nt5cDTXYqNWZNTmnh", "postedAt": "2019-02-17T02:19:59.474Z", "postId": "MDxaD688pATMnjwmB", "htmlBody": "<p>Great article! Just wondering if this study was published/submitted for publishing?</p>", "parentCommentId": null, "user": {"username": "Emily Grundy"}}]