[{"_id": "Kv8AMpNDAxQ5SPHNM", "postedAt": "2023-12-05T17:19:22.590Z", "postId": "ME4ihqRojjuhprejm", "htmlBody": "<p>This is a really great new initiative! I have one question and one plug.<br><br><strong>Question:</strong> What does this mean for the animal charity meta-fundraising intervention (#5 on <a href=\"https://www.charityentrepreneurship.com/research\">this list</a>) that was supposed to be on the table for CE's flagship nonprofit incubation program?<br><br><strong>Plug</strong>: For folks that are already making grants (from their foundation/DAF/other), please check out CE's <a href=\"https://www.impactfulgrantmaking.com/grantmaking-program\">effective grantmaking program</a>. It is best suited for people who are newer to grantmaking and have a lot of initial applications to evaluate. If you don't have the time to apply and go through the program, just get a copy of their book, <a href=\"https://www.amazon.com/Launch-High-Impact-Foundation-Joey-Savoie-ebook/dp/B0CH8Z3K3H/?content-id=amzn1.sym.cf86ec3a-68a6-43e9-8115-04171136930a\"><i>How to Launch a High-Impact Foundation</i></a>.</p>", "parentCommentId": null, "user": {"username": "Constance Li"}}, {"_id": "j5pgqr9f4NzCokCNQ", "postedAt": "2023-12-05T17:54:07.819Z", "postId": "ME4ihqRojjuhprejm", "htmlBody": "<p>It does not change our plans to incubate this charity.&nbsp;</p>", "parentCommentId": "Kv8AMpNDAxQ5SPHNM", "user": {"username": "CE"}}, {"_id": "YRyKjHwyTvKs4fxmL", "postedAt": "2023-12-06T13:41:22.495Z", "postId": "ME4ihqRojjuhprejm", "htmlBody": "<p><strong>Executive summary</strong>: Charity Entrepreneurship and Giving What We Can are launching a program to incubate 4-6 new Effective Giving Initiatives in 2024 that are expected to raise millions for highly impactful charities.</p><p><strong>Key points</strong>:</p><ol><li>The program seeks founders to start new Effective Giving Initiatives (EGIs) in promising countries that can influence donors to give significantly more funding to highly impactful charities.</li><li>Successful EGIs like Doneer Effectief have raised over $1 million for effective charities, but more funding is still needed and EGIs have proven effective for raising these funds.</li><li>The 8-week online and in-person program provides training, resources, systems, and seed funding to launch successful EGIs faster by building on existing EGIs' knowledge and experience.</li><li>Recommended target countries are assessed based on donation potential and tractability. People from all countries are encouraged to apply.</li><li>The program teaches critical skills like strategic planning, decision-making, pitching, fundraising, and advising high-net-worth donors.</li><li>The application process is designed to help assess fit for high-impact nonprofit entrepreneurship and closes January 14, 2024.</li></ol><p>&nbsp;</p><p><i>This comment was auto-generated by the EA Forum Team. Feel free to point out issues with this summary by replying to the comment, and</i><a href=\"https://forum.effectivealtruism.org/contact\"><i>&nbsp;<u>contact us</u></i></a><i> if you have feedback.</i></p>", "parentCommentId": null, "user": {"username": "SummaryBot"}}, {"_id": "sDGutsf2pzJqE7m9x", "postedAt": "2023-12-09T11:50:14.205Z", "postId": "ME4ihqRojjuhprejm", "htmlBody": "<p>Great initiative!</p><p>&nbsp;</p><p>I have a specific question regarding the prioritization of top countries. I'm not sure how much weight was given to the 'wealth' metric in this analysis, but have you examined how sensitive Ireland's top-prioritized position is to the <a href=\"https://www.economist.com/the-economist-explains/2023/10/31/whats-weird-about-irelands-gdp\">oddities of this country's GDP</a>?</p>", "parentCommentId": null, "user": {"username": "bcbernardo"}}]