[{"_id": "rcCJjqYzqmwnQbGtj", "postedAt": "2023-06-08T18:31:15.943Z", "postId": "MFA9jC2daSMnhNryv", "htmlBody": "<p>I like the word \"leverage point\", or just \"opportunity\". I wish to elicit suggestions about what kind of leverage points I could exploit to improve at what I care about. Or, the inverse framing, what are some bottlenecks wrt what I care about that I'm failing to notice? Am I wasting time overoptimising some <a href=\"https://en.wikipedia.org/wiki/Critical_path_method\">non-critical path</a> (this is tbh one of my biggest bottlenecks)?</p><p>That said, if somebody's got a suggestion on their heart, I'd happier if they sent me a <a href=\"https://youtu.be/fBziSx7RtqY\">howler</a> compared to no feedback at all. I regularly (while trying to keep it from getting too annoying) elicit feedback from people who might have it, in case it's hard for them to bring it up.</p>", "parentCommentId": null, "user": {"username": "Elua"}}, {"_id": "fmEwSfufiaaSGfzTt", "postedAt": "2023-06-09T13:28:29.443Z", "postId": "MFA9jC2daSMnhNryv", "htmlBody": "<p>Thanks for sharing, I like how concrete all of this is and think it's generally a really important practice.</p><p>One \"hack\" that came to mind that I think helped me feeling more relaxed about the prospect of even pretty harsh criticism: Think of some worst cases already in advance. Like when you do a project/plan your life, consider the hypotheses that e.g.</p><ul><li>you should not do this in theory good project because you are the wrong person for it, e.g. due to you not being [insert relevant features/skills] enough (yet!)</li><li>the project you plan working on will actually make things worse for various potential reasons</li><li>the career you invested your energy into is far from the best you could be pursuing</li><li>and a catch-all \"there are possibly some unknown crucial considerations I'm neglecting\"</li></ul><p>Internally I expect even harsh criticism to then kinda feel like \"Yeah good point, but also haha, I already kinda considered that and you merely cause me to update!\" xD</p>", "parentCommentId": null, "user": {"username": "MaxRa"}}, {"_id": "YCDZnMvy7jsbYGjgd", "postedAt": "2023-06-10T15:46:53.207Z", "postId": "MFA9jC2daSMnhNryv", "htmlBody": "<p>One aspect of this I've been thinking about for a long time (partially for intensely personal and complicated reasons!) is honing my criticism/complaint razor. I think I set up the idea pretty well in <a href=\"https://forum.effectivealtruism.org/posts/Hb94qCjN6ugE357oT/the-strange-shortage-of-moral-optimizers?commentId=63TzchqJAtuKDX7Nt\">the last half of this comment</a>.&nbsp;</p><blockquote><p>The difficult thing about separating a <i>critic</i> (someone who helps you find a path through action space that deletes their complaint) from a <i>complainer</i> (someone who's the opposite of that) is that, while you have to protect your attention from complainers to a nontrivial degree, you may accidentally block a high quality adversary because what seems like a complaint is actually a criticism that's just really really hard to address, and you don't know the difference.</p></blockquote><p>So on the one hand the existence of serial complainers (people who are hostile to solving problems) implies that problem solvers should be wary of crab buckets (and may be drawn to them out of humility or interest in soliciting criticism or desire to be actually right), on the other why should you expect to hone a heuristic for sorting them out quickly? It's deeply tricky.&nbsp;</p>", "parentCommentId": null, "user": {"username": "quinn"}}]