[{"_id": "cuQ57ksGtE9XBbTeD", "postedAt": "2022-12-20T18:37:55.522Z", "postId": "MfPWk4ToW3p6utWpc", "htmlBody": "<p>Some researchers are working on making real world models more aligned, and they either work on the cutting edge (as you suggest here), or maybe on something smaller (if their research is easier to start on a smaller model, maybe).</p><p>Some researchers work on problems like Agent Foundations (~ what is the correct mathematical way to model agents, utility functions, and things like that), and I assume they don't use actual models to experiment with (yet).</p><p>Some researchers are trying to make tools that will help other researchers.</p><p>And there are other directions.</p><p>You can see many of the agendas here:</p><h1><a href=\"https://www.lesswrong.com/posts/QBAjndPuFbhEXKcCr/my-understanding-of-what-everyone-in-technical-alignment-is\">(My understanding of) What Everyone in Technical Alignment is Doing and Why</a></h1>", "parentCommentId": null, "user": {"username": "hibukki"}}, {"_id": "AAfBWa7Lnk6evxMfb", "postedAt": "2022-12-21T17:56:49.865Z", "postId": "MfPWk4ToW3p6utWpc", "htmlBody": "<p>I think this is one reasonable avenue to explore alignment, but I don't want everybody doing it.&nbsp;</p><p>My impression is that AI researchers exist on a spectrum from only doing empirical work (of the kind you describe) to only doing theoretical work (<a href=\"https://www.lesswrong.com/posts/FWvzwCDRgcjb9sigb/why-agent-foundations-an-overly-abstract-explanation\">like Agent Foundations</a>), and most fall in the middle, doing some theory to figure out what kind of experiment to run, and using empirical data to improve their theories (<a href=\"https://www.lesswrong.com/posts/eXNa8iLo2emzDtTu7/shuttling-between-science-and-invention\">a lot of science looks like this!</a>).</p><p>I think all (or even a majority of) AI safety researchers moving to doing empirical work on current AI systems is unwise, for two reasons:</p><ol><li><strong>Bigger models have bigger problems</strong>.&nbsp;<ol><li>Lessons learned from current misalignment may be necessary for aligning future models, but will certainly not be sufficient. For instance, GPT-3 will (we assume) never demonstrate <a href=\"https://www.lesswrong.com/tag/deceptive-alignment\">deceptive alignment</a>, because its model of the world is not broad enough to do so, but more complex AIs may do.&nbsp;</li><li>This is particularly worrying because we may only get <a href=\"https://www.lesswrong.com/posts/uMQ3cqWDPHhjtiesc/agi-ruin-a-list-of-lethalities\">one shot</a> at spotting deceptive alignment! Thinking about problems in this class <i>before we have direct access to models that could, even in theory, exhibit these problems </i>seems both mandatory and a key reason alignment seems hard to me.</li></ol></li><li><strong>AI researchers are sub-specialised.&nbsp;</strong><ol><li>Many current researchers working in non-technical alignment, while they presumably have a decent technical background, are not cutting-edge ML engineers. There's not a 1:1 skill translation from 'current alignment researcher' to 'GPT-3 alignment researcher'</li><li>There is maybe some claim here that you could save money on current alignment researchers and fund a whole bunch of GPT alignment researchers, but I expect the exchange rate is pretty poor, or it's just not possible in the medium term to find sufficient people with a deep understanding of both ML and alignment.</li></ol></li></ol><p>The first one is the biggy. I can imagine this approach working (perhaps inefficiently) in a world were (1) were false and (2) were true, but I can't imagine this approach working in any worlds where (1) holds.</p>", "parentCommentId": null, "user": {"username": "brook"}}, {"_id": "psmnBHMyRGnofii54", "postedAt": "2022-12-21T20:28:44.352Z", "postId": "MfPWk4ToW3p6utWpc", "htmlBody": "<p>Agree that some could. Since you brought it up, how would you align image generators? They're still dumb tools, do you mean align the users? Add safety features? Stable Diffusion had a few safeguards put in place, but users can easily disable them. Now it's generating typical porn and as well as more dangerous or harmful things, I suspect, but only because people are using it that way, not because it does that on its own. So yeah do you want Stable Diffusion source code to be removed from the web? I second the motion, lol.</p>\n", "parentCommentId": null, "user": {"username": "Noah Scales"}}]