[{"_id": "FKDXbyRmNzoHaWuN9", "postedAt": "2023-11-21T02:28:30.381Z", "postId": "MFRqdphhyddjgTwX4", "htmlBody": "<p>Thanks for the update, Joy and Anita. Great work! In terms of expansion into a new region, what factors would determine the optimal timeline on that? Is it some tradeoff between the fixed costs of starting a second project vs the marginal cost of outreach being lower in a new area (low-hanging fruit)? Or more to do with demonstrating the impact in different types of communities in order to attract investment from the national government? I suspect the marginal costs might actually stay lower in Quito for quite some time due to local word of mouth. Best wishes to you in 2024, I am excited to see how this develops.</p>", "parentCommentId": null, "user": {"username": "MikeMorell"}}, {"_id": "raCdCQjpLMvurX2iG", "postedAt": "2023-11-21T20:19:23.442Z", "postId": "MFRqdphhyddjgTwX4", "htmlBody": "<p>Inspiring work, the prospect of enhanced g-IPT is especially encouraging as that could further boost cost-effectiveness for mental health interventions generally. Looking forward to the next update - mucho suerte!</p>", "parentCommentId": null, "user": {"username": "Philippe Rivet"}}, {"_id": "4CYDW7NCuaariB5ZL", "postedAt": "2023-11-22T12:32:09.235Z", "postId": "MFRqdphhyddjgTwX4", "htmlBody": "<p>Thank you so much, Philippe! Yes, we are excited about the possibilities of combining insights from different fields and seeing what the date shows us.</p>", "parentCommentId": "raCdCQjpLMvurX2iG", "user": {"username": "Joy Bittner"}}, {"_id": "ck2CbqXf8kfNpTwFm", "postedAt": "2023-11-22T12:58:16.672Z", "postId": "MFRqdphhyddjgTwX4", "htmlBody": "<p>Hi Mike, thanks so much for all your support and these thoughtful points.&nbsp;<br><br>Yes, there are additional costs associated with geographic expansion, and we believe these costs are justified for several reasons:</p><p><strong>Testing Demand and Adaptation:</strong> By expanding to more rural locations, we aim to assess the demand for and adaptability of our services. Urban life in Quito is fast-paced, and we've noticed various factors competing for people's attention, making it challenging for group attendance. Most other g-IPT programs operate in rural settings, where individuals may have more time. This expansion allows us to explore whether there are better rates of treatment adherence, with participants completing all eight sessions.</p><p><strong>Building a Demonstration Case:</strong> As you suggested, this expansion helps us build a demonstration case, primarily for provincial and local governments. Regional government staff are generally more accessible than national government officials, and showcasing the value of providing mental health care can influence policies at these levels (hopefully leading to national government adoption)</p><p><strong>Higher Counterfactual Value:</strong> In general, the counterfactual value of providing mental health care is higher in third-tier cities and rural communities due to the concentration of government services in larger cities. If we can effectively manage costs and prevent an overall increase, we believe there is a moral imperative to extend support to those with fewer alternatives.<br><br>thank you so much again and welcome further questions and feedback!&nbsp;<br><br>&nbsp;</p>", "parentCommentId": "FKDXbyRmNzoHaWuN9", "user": {"username": "Joy Bittner"}}]