[{"_id": "NGB44DsyPwXxk27zu", "postedAt": "2014-11-27T21:41:32.238Z", "postId": "MH9suFZbxXCYsr5Z5", "htmlBody": "<p>I like this way of thinking about weirdness, Peter. I've been saying for a while that EA is associated with a lot of weird ideas that are sure to turn off many ordinary people.</p>\n<p>Another thing I'd recommend is remaining sympathetic to mildly and moderately important issues (e.g. fighting police brutality in the USA, supporting gay rights, containing ebola, the ALS ice bucket challenge) even when you see everybody around you overrating their importance relative to other issues that you consider far more important. Raining on everybody else's warm, fuzzy parade will make you &quot;weird,&quot; and people will be less willing to hear about your alternative causes. I think the general strategy should be to care about EA issues <em>in addition</em> to mainstream issues, rather than supporting them as <em>an alternative</em> to mainstream issues.</p>\n", "parentCommentId": null, "user": {"username": "Bitton"}}, {"_id": "SoFBp86wYA4wty6TY", "postedAt": "2014-11-27T21:43:08.297Z", "postId": "MH9suFZbxXCYsr5Z5", "htmlBody": "<p>I like your thoughts, however I think you oversee one important aspect: People who are more weird will take away weirdness points from less weird people. Meaning, one really radical advocate for an idea helps plenty more less radical advocates promote their position in society. People living vegan make vegetarians seem less weird than they would without vegans. People advocating total smoking bans everywhere make people asking for smoking bans indoors seem less weird, People demanding a universal basic income make people lobbying for minimum wages and social security less weird. And so on. So while a radical position might not come through, and while a person holding that position might not be successful from a superficial point of view, the position and the person will actually do good by taking away the weirdness of less radical activists. I argue that this is actually a strong multiplicator, much stronger than lowering ones own weirdness and advocating for the more socially acceptable positions and solutions. I also argue that this is the reason why policy develops through the aforementioned six stages. And I argue that the more maximum-weird people there are, the faster this development will be. In that sense I can only encourage anyone to be as radical and weird as possible when it comes to altruistic ideas and activism.</p>\n", "parentCommentId": null, "user": null}, {"_id": "GFT9evJT3sDcz4NsG", "postedAt": "2014-11-27T21:45:43.338Z", "postId": "MH9suFZbxXCYsr5Z5", "htmlBody": "<p>That's an important and really interesting point.  I don't know if the press coverage of EA eating other issues (&quot;yo, ALS is unimportant, focus on me instead&quot;) has been net negative, but it's worth reconsidering and looking into.</p>\n", "parentCommentId": "NGB44DsyPwXxk27zu", "user": {"username": "Peter_Hurford"}}, {"_id": "BhucM2Wv5urTznG8M", "postedAt": "2014-11-27T21:52:04.904Z", "postId": "MH9suFZbxXCYsr5Z5", "htmlBody": "<p>I think what's consistent with what both you and I are saying os to be a T-shaped radical advocate -- be really radical for one particular core idea (e.g., <a href=\"http://directactioneverywhere.com/daysofaction\">protest Chipotle for not being vegan</a>), but otherwise be a more &quot;normal&quot; advocate for other ideas (e.g., promote the earned income tax credit over universal basic income, even if you like UBI better).</p>\n", "parentCommentId": "SoFBp86wYA4wty6TY", "user": {"username": "Peter_Hurford"}}, {"_id": "BxiHxrdPzH4tdjk6a", "postedAt": "2014-11-27T21:56:57.366Z", "postId": "MH9suFZbxXCYsr5Z5", "htmlBody": "<p>I think there are people where you can earn points in their books for being weird and able to convince them of some of the weird things. &quot;This person gave me true beliefs that are otherwise hard to come by, I should listen to them more and see if I can find more rare true beliefs among the rare things they believe.&quot; I think these people are disproportionately able to become super-weird. And that super-weird EAs (including undercover super-weird EAs) provide most of the expected value of the EA movement (because of x-risk, donating large fractions of income, and earning to give in tech startups). It may be worth driving away quite a few people with low weirdness tolerance in order to attract more people with the potential to become super-weird.</p>\n", "parentCommentId": null, "user": {"username": "Jack_LaSota"}}, {"_id": "9NpZAxSNkiNYgwdgg", "postedAt": "2014-11-27T22:29:13.759Z", "postId": "MH9suFZbxXCYsr5Z5", "htmlBody": "<p>Thanks for the write-up. This gets the sense of weirdness points as I understand them pretty well.</p>\n<p>The one thing that you say that seems wrong to me is in the title: the idea that you have a set amount of weirdness points. Rather I think you can choose to spend more or less weirdness points, but the more you spend, the less people will pay attention to you.</p>\n<p>Of course it is a simplifying metaphor to say you have a set number (and you may often want to act this way, where that number is at the right trade-off between being weird and taking important positions). But as weirdness points are themselves a simplifying metaphor, this level may not be clear to readers meeting the idea for the first time.</p>\n<p>Why it matters: sometimes it's right to shift the number of weirdness points you're spending. You don't want to lead people into thinking that whenever they become weird on some axis they need to rein in on another axis. Rather the important takeaway message is: <strong>weirdness is a cost, so like any other cost we should be aware of it, and it sometimes won't be worth paying</strong>.</p>\n", "parentCommentId": null, "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "o752spz3CppYjHrHZ", "postedAt": "2014-11-27T22:36:34.127Z", "postId": "MH9suFZbxXCYsr5Z5", "htmlBody": "<p>This is a justification for why you might sometimes want to spend weirdness points. But it doesn't stand in conflict with the idea that spending weirdness points is a cost.</p>\n", "parentCommentId": "BxiHxrdPzH4tdjk6a", "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "PuyED2WHcm3CfpTYZ", "postedAt": "2014-11-27T22:36:39.918Z", "postId": "MH9suFZbxXCYsr5Z5", "htmlBody": "<p>This is something discussed a lot in the animal rights movement. Animal rights, perhaps even more so than EA, is a &quot;weird&quot; movement. And, unfortunately, the animal rights movement has been severely damaged by activists who sacrificed other issues for the sake of their own (e.g. PETA and sexist advertising). Recently, some members of the animal rights community have taken an <strong>intersectional</strong> approach and aligned themselves with those other issues (police brutality, gay rights, etc.). I think this is a very wise approach.</p>\n", "parentCommentId": "NGB44DsyPwXxk27zu", "user": null}, {"_id": "xeo5M2NErdAF6vTQm", "postedAt": "2014-11-28T01:05:51.601Z", "postId": "MH9suFZbxXCYsr5Z5", "htmlBody": "<p>Thanks for writing this up!  This is why I decided to stop with my <a href=\"http://www.jefftk.com/p/minimal-capitalization\">idiosyncratic  capitalization</a> and write normally.</p>\n", "parentCommentId": null, "user": {"username": "Jeff_Kaufman"}}, {"_id": "y4pF7AyLBWLaEfAQf", "postedAt": "2014-11-28T06:32:38.886Z", "postId": "MH9suFZbxXCYsr5Z5", "htmlBody": "<p>I also find that it's frequently the most helpful to be only a little weird in public, but once you have someone's confidence you can start being significantly more weird with them because they can't just write you off. Most of the best of both worlds.</p>\n", "parentCommentId": "BxiHxrdPzH4tdjk6a", "user": {"username": "cflexman"}}, {"_id": "KDHsiApSTvqej78e7", "postedAt": "2014-11-28T07:12:45.843Z", "postId": "MH9suFZbxXCYsr5Z5", "htmlBody": "<p>Yes, I think this is right!</p>\n", "parentCommentId": "9NpZAxSNkiNYgwdgg", "user": {"username": "John_Salvatier"}}, {"_id": "QQ9Xt5cFXEAfAMie9", "postedAt": "2014-11-28T07:32:41.705Z", "postId": "MH9suFZbxXCYsr5Z5", "htmlBody": "<blockquote>\n<p>Clean up and look good</p>\n</blockquote>\n<p>This is one of the big benefits I've found from learning to dress well. People generally seem much more positively disposed to the weird ideas I talk about now that I dress well and have good social skills. People interpret weird ideas from high status people much more favorably than they do from less high status people. </p>\n<p>I think the lesson here is that its useful to spend time learning to dress well, develop social skills and otherwise become high status. I have <a href=\"http://jsalvatier.wordpress.com/2014/07/14/introduction-to-style-for-effective-altruists/\">some advice on learning how to dress well</a> (mostly for men).</p>\n", "parentCommentId": null, "user": {"username": "John_Salvatier"}}, {"_id": "QiLJWqSbazRwbtobm", "postedAt": "2014-11-28T09:57:25.899Z", "postId": "MH9suFZbxXCYsr5Z5", "htmlBody": "<p>Hey Peter,</p>\n<p>I think it's important to highlight that this article is about weirdness in the context of advocacy. </p>\n<p>While I enjoyed the message, I'm concerned about the negative approach. People (especially weird ones) tend to be afraid of social rejection, and setting up a framework for failure (spending too many weirdness points) instead of a framework for success (winning familiarity points) can create a culture of fear/guilt around one's identity. I believe this is why some EAs had a cautious reaction to this article.</p>\n<p>I love connecting with people, and I've found the most effective way to do so is to be vulnerable, instead of conservative. This has psychological and philosophical underpinnings, which I don't have room to expound on here.</p>\n<p>So I propose a different metric: familiarity points. People want to affirm you, just as they want to be affirmed. We are all (including EAs, I've discovered) fundamentally human in how we've figured out how the world works. If you can tap into the basic emotions and thoughts that have brought you to your position, in a way that is familiar to others, then you can share your perspective and gain familiarity points at the same time.</p>\n<p>You can also gain easy familiarity points with something that a lot of people are comfortable with, like talking about sports or movies. These are cheap points and not very valuable, but you can leverage them if you dig a little deeper. If you've both seen Inception, great. But if you can both talk about idiosyncrasies in Christopher Nolan's directing over his past 5 movies, then you're getting more familiarity points. You've found something that you're both weird about, and this gains you FAR more traction than simply “not scaring them off”. </p>\n<p>Once you have gained enough familiarity points, you can start introducing unfamiliar ideas, but from a much better grounding. “You know, I was thinking about how Nolan portrays the world's collapse in Interstellar, and I was wondering what existential risks are really a problem, so I started reading material from FHI.” This is the foot-in-the-door technique, but since you already have familiarity points, you've got a warm lead, instead of a cold one (to continue the sales lingo). Or, you can use the door-in-face technique: “speaking of Interstellar, I have some crazy ideas about AI development.” Because you have familiarity points, your interlocutor wants to hear more – they consider you a kindred spirit, and thus might have some great new information (you are crazy like me, I want to hear your crazy ideas).</p>\n<p>Of course, it's also important to incorporate expectation-setting and have preexisting constructions for conversation entry and the “close”. But I'm getting too long-winded. Maybe I should write a post.</p>\n", "parentCommentId": null, "user": {"username": "kdbscott"}}, {"_id": "L94jfYSs5873eSFBo", "postedAt": "2014-11-28T10:22:56.517Z", "postId": "MH9suFZbxXCYsr5Z5", "htmlBody": "<p>I agree with the general gist of the post, but I would point out that different groups consider different things weird, and have differing opinions about what weirdness is a bad thing.</p>\n<p>To use your &quot;a guy wearing a dress in public&quot; example - I do this occasionally, and gauging from the reactions I've seen so far, it seems to earn me points among the liberal, socially progressive crowd. My general opinions and values are such that this is the group that would already be the most likely to listen to me, while the people who are turned off by such a thing would be disinclined to listen to me anyway.</p>\n<p>I would thus suggest, not trying to limit your weirdness, but rather choosing a target audience and only limiting the kind of weirdness that this group would consider freakish or negative, while being less concerned by the kind of weirdness that your target audience considers positive. Weirdness that's considered positive by your target audience may even help your case.</p>\n", "parentCommentId": null, "user": {"username": "Kaj_Sotala"}}, {"_id": "yEu2niMA3v5SNBiRN", "postedAt": "2014-11-28T11:36:26.557Z", "postId": "MH9suFZbxXCYsr5Z5", "htmlBody": "<p>Yes, it's true that weirdness is a cost, though it's also less interesting than Peter's analogy.</p>\n<p>If I try to run with a slightly more balanced version of Peter's line, I say that everyone has a weirdness budget.</p>\n<p>If you lead a major organisation, you want to keep that budget in surplus. </p>\n<p>If you're a non-public-facing researcher, then going over your weirdness budget is okay, if your allies can pay it off later by clarifying and softening your arguments. On a plausible narrative, Nick Bostrom and Martin Rees have similarly increased the appeal of Eliezer Yudkowsky's arguments by throwing the weight of their academic prestige behind them.</p>\n", "parentCommentId": "9NpZAxSNkiNYgwdgg", "user": {"username": "RyanCarey"}}, {"_id": "E9qMoEBfh9Epskprr", "postedAt": "2014-11-28T11:43:37.161Z", "postId": "MH9suFZbxXCYsr5Z5", "htmlBody": "<p>Good idea! I think you're right that whether or not they realise it, people are often moved to avoid weirdness because of their own insecurities, rather than because of impact. I think it would be great to write a post!</p>\n", "parentCommentId": "QiLJWqSbazRwbtobm", "user": {"username": "RyanCarey"}}, {"_id": "rGg4wSGeCsH4Ywnh6", "postedAt": "2014-11-28T12:40:40.969Z", "postId": "MH9suFZbxXCYsr5Z5", "htmlBody": "<p>I think this is a good post for starting conversation but it has also received a lot of substantial criticism here and on LessWrong. To sum up my favourites:</p>\n<ul>\n<li>Sharing an unorthodox belief with someone <a href=\"http://lesswrong.com/lw/lbn/you_have_a_set_amount_of_weirdness_points_spend/boc9\">makes them</a> much more likely to listen to you on other topics.</li>\n<li>Weirdness matters a lot <a href=\"http://lesswrong.com/lw/lbn/you_have_a_set_amount_of_weirdness_points_spend/boc9\">if you're an advocate</a>, but much less otherwise</li>\n<li>Being right is different from being normal. People who care a lot about being normal are rarely the best at judging what's true, or contributing to those [discussions] (<a href=\"http://lesswrong.com/lw/lbn/you_have_a_set_amount_of_weirdness_points_spend/bocl)\">http://lesswrong.com/lw/lbn/you_have_a_set_amount_of_weirdness_points_spend/bocl)</a>. And it's probably more important to figure out what's true than to persuade people.</li>\n<li>Talking about weirdness points is a very negative perspective that could play on people's fear of social rejection. <a href=\"http://effective-altruism.com/ea/bg/you_have_a_set_amount_of_weirdness_points_spend/1l5\">It's probably better to talk about familiarity points instead</a>.</li>\n<li>Weirdness points just alter how much attention people pay to you, and if you only want a subset of the population to pay attention to you, then you are likely to be prepared to spend more weirdness points. i.e. <a href=\"http://effective-altruism.com/ea/bg/you_have_a_set_amount_of_weirdness_points_spend/1kx\">there's not a fixed amount</a>.</li>\n</ul>\n<p>I think each of these is a substantial objection to the thesis of the article and taken together they are pretty damaging. </p>\n<p>I think that they can be tied together to be even stronger though. </p>\n<p>If you're trying to spread a radical intellectual idea, in the beginning, you mostly want to target early adopters who have a lot of pulling power. Think of the Einstein-Russell manifesto against nuclear proliferation, which preceded the antinuclear movement by a couple of decades, or of many other social movements whose intellectual forebears who preceded them. So far, the most valuable contributors to ideas relating to effective altruism are people like Martin Rees, Jaan Tallin, James Martin, Elon Musk. To a substantial extent, they appraise ideas based on their content, rather than on the basis of who is presenting them. As publisher <a href=\"http://edge.org\">John Brockman</a> puts it, &quot;I'm not interested in the average person. Most people have never had an idea and wouldn't recognize one if did.&quot; Or, as Peter Thiel says: &quot;What is something you believe that nearly no one agrees with you on?&quot; For these people, holding some unorthodox ideas is a prerequisite for them to listen to you. So for people who are promoting a radical idea to others who are themselves radical thinkers, trying to be normal is just not going to cut ice.</p>\n<p>Not everyone has to be Will MacAskill or Peter Singer. These two are writing popular books about effective altruism and do lots of TV interviews about these things. They practice talking to the masses so that others can focus on industrial and intellectual leaders, and yet others can focus on researching which charities are the most effective. The problem with this post is that it does not apply to others' roles the same as it applies to MacAskill's and Singer's. But rather, the whole spectrum of jobs are important. Arguably, MacAskill and Singer's roles are less important, because if we can't attract the general public, then we can go to high-net worth individuals. However, if we can't figure out which charities are the most effective, then recruiting is no use at all.</p>\n<p>So even if we convince ourselves that it's more important to do fundamental research and talking to intellectual leaders while avoiding public discourse, it's very hard to stave off our human need for social approval. The bottom line, though, is that people don't need a post to tell them to be more aware of social rejection. Most people couldn't forget about social rejection if they tried. In fact, some of the people who gain the most confidence and passion in making a big change to the world do so because they realise that society's big problems are not going to be fixed by themselves. Take <a href=\"http://mindingourway.com/on-saving-the-world/\">Nate Soares</a> for one reasonably articulate example. This can be because of a realisation that society is pretty selfish or crazy a lot of the time, and so some people are going to have to take on the responsibility of improving it. Instead, trying to get across the idea that society is weird might be a better approach to breeding people with a sense of heroic responsibility for fixing it.</p>\n<p>So altogether, although I agree with the post broadly - that it's valuable to be familiar and normal, I think people already behave as though it is. Instead, we should pay more attention to the fact that effective altruism is quite a radical idea, that it already has some people who are focussed on acting as its public face, and that it might be better for people to focus on feeling responsible for improving the world, or for figuring out how, before becoming so alert to social considerations.</p>\n", "parentCommentId": null, "user": {"username": "RyanCarey"}}, {"_id": "gP8fXKbmDrY4jZRCn", "postedAt": "2014-11-28T14:00:30.504Z", "postId": "MH9suFZbxXCYsr5Z5", "htmlBody": "<p>Nice summary Ryan.</p>\n<p>Indeed, I think the biggest challenge in terms of spreading EA is what I call &quot;extended responsibility.&quot; Many people have difficulty taking responsibility for their own lives, let alone their family or community. EA asks you to take responsibility for the whole world, and then carry that responsibility with you for your whole life. Holy crap.</p>\n<p>After that, the next big ask is for rational methodologies. Even if people take responsibility for their kids, they probably will rely on intuition and availability heuristics.</p>\n<p>So discussion around EA advocacy (which is what I believe to be the topic here) could be better focused around &quot;how to move people towards extended responsibility and rational methodologies&quot;.</p>\n<p>Of course, that could seem like a soft approach that doesn't immediately get donations to GiveDirectly. Some of the strategies I outlined in my other comment can be used in an instance where you'd like to hard sell. </p>\n", "parentCommentId": "rGg4wSGeCsH4Ywnh6", "user": {"username": "kdbscott"}}, {"_id": "yLFiG7562FvdE2Ew6", "postedAt": "2014-11-28T15:57:44.551Z", "postId": "MH9suFZbxXCYsr5Z5", "htmlBody": "<p>Perhaps I'm not thinking this through or I'm simply being unambitious but I don't view effective altruism as asking you to take responsibility for the whole world. I certainly don't feel an enormous weight on my shoulders. I view it more as taking responsibility for the difference between what you would ordinarily do and what you could do if you maximised your impact, which does admittedly require consideration of the whole world.</p>\n<p>If valid, maybe that can make effective altruism a little more palatable.</p>\n", "parentCommentId": "gP8fXKbmDrY4jZRCn", "user": {"username": "bshannon"}}, {"_id": "6ZP5T2gwviRDb6t4k", "postedAt": "2014-11-28T19:41:38.327Z", "postId": "MH9suFZbxXCYsr5Z5", "htmlBody": "<blockquote>\n<p>But <a href=\"http://www.vox.com/2014/7/29/5946395/eitc-poverty-supplemental-measure-official-threshold\">reforming the earned income tax credit</a> and relaxing zoning laws would also both do a lot to help the poor in the US.</p>\n</blockquote>\n<p>The link above didn't seem to have any proposals of how to reform the earned income tax credit. It argues for an alternative measure of poverty in the US.</p>\n", "parentCommentId": null, "user": {"username": "Patrick"}}, {"_id": "kpnpskMjFMpMLWaWK", "postedAt": "2014-11-28T23:34:59.604Z", "postId": "MH9suFZbxXCYsr5Z5", "htmlBody": "<p>If altruism is related to weirdness, then I must be a saint!</p>\n", "parentCommentId": null, "user": {"username": "Austen_Forrester"}}, {"_id": "zJFJqFAFALNyCAKyi", "postedAt": "2014-11-29T17:34:55.401Z", "postId": "MH9suFZbxXCYsr5Z5", "htmlBody": "<p>Yeah, I didn't have a better one on-hand and thought that article was more about EITC than it actually was.</p>\n", "parentCommentId": "6ZP5T2gwviRDb6t4k", "user": {"username": "Peter_Hurford"}}, {"_id": "vJMyTJwD23NEmdGjj", "postedAt": "2014-11-29T17:49:21.707Z", "postId": "MH9suFZbxXCYsr5Z5", "htmlBody": "<p>Thanks for the style guide!</p>\n", "parentCommentId": "QQ9Xt5cFXEAfAMie9", "user": {"username": "Peter_Hurford"}}, {"_id": "i3CdFNFxS5bH4ysmC", "postedAt": "2014-11-29T17:52:48.155Z", "postId": "MH9suFZbxXCYsr5Z5", "htmlBody": "<p>I think this is a great idea.  I'd love to see it expanded more in a post of it's own.</p>\n<p>X-risks via Interstellar is smart!  Someone with one of those fancy public outlets (Will Macaskill?  Hamilton Nolan?  Peter Singer?) should get on that. :)</p>\n", "parentCommentId": "QiLJWqSbazRwbtobm", "user": {"username": "Peter_Hurford"}}, {"_id": "ZH5NyG4NygXqQ6GuA", "postedAt": "2014-11-29T18:01:11.406Z", "postId": "MH9suFZbxXCYsr5Z5", "htmlBody": "<p>I think all those points are correct, but I view them more as expanding nuances rather than direct counterarguments.  That is, one can re-construct a version of my thesis that remains agreeable -- it would just be restricted to the domain of advocacy (which I did intend but failed to state) and would admit nuanced ways in which such points can be &quot;earned&quot; in addition to being spent.</p>\n<p>-</p>\n<blockquote>\n<p>So far, the most valuable contributors to ideas relating to effective altruism are people like Martin Rees, Jaan Tallin, James Martin, Elon Musk.</p>\n</blockquote>\n<p>I think of the use case of this essay as the typical EA person trying to hold conversations with their friends about EA / rationalist / etc. topics.  Presumably, this typical EA person does care to be an advocate, at least in part -- that is, all else being equal, this person would prefer their friends to adopt their EA / rationalist / etc. ideas.</p>\n<p>For us typical EA people, we're restrained by having a more constrained budget of points in a way that Rees, Tallin, etc. don't because they're already famous and have proven themselves for having immense accomplishments that are already verifiable and can then -- cue halo effect -- be openly weird and have people think &quot;hmm, maybe they're right&quot;.</p>\n<p>So I think the case where one wants to advocate comes up pretty often, and the advice here applies to that for non-famous people.</p>\n", "parentCommentId": "rGg4wSGeCsH4Ywnh6", "user": {"username": "Peter_Hurford"}}, {"_id": "FeyqwSMbXQgQehwe8", "postedAt": "2014-11-30T03:39:20.749Z", "postId": "MH9suFZbxXCYsr5Z5", "htmlBody": "<p>I think this is good advise, but advice that people will find hard to accept. Every piece of weird behavior comes packaged with object-level inside view considerations in favor of it, which generate convenient excuses for why we should exempt it from this general argument. </p>\n<blockquote>\n<p>&quot;Yes, of course I agree with this evidence in general, but it doesn't really apply to me. I don't need to [wear gender-appropriate clothing / have monogamous relationships / shave my beard / eat normal food / use normal pronouns], because I have really good inside-view reasons for why my weirdness is special.&quot;</p>\n</blockquote>\n<p>I'm as guilty of this as anyone.</p>\n<p>Worse, being asked to seem less weird feels like asking people to give up a part of their personality. Especially for the sort of person EA tends to attract, this can seem like a much higher costs than simply donating money. Plus, you don't get to signal your virtue!</p>\n", "parentCommentId": null, "user": {"username": "Dale"}}, {"_id": "qS2nQok2PqXkpi5fF", "postedAt": "2014-11-30T03:59:51.459Z", "postId": "MH9suFZbxXCYsr5Z5", "htmlBody": "<blockquote>\n<p>Weirdness is incredibly important.  If people weren't willing to deviate from society and hold weird beliefs, we wouldn't have had the important social movements that ended slavery and pushed back against racism, that created democracy, that expanded social roles for women, and that made the world a better place in numerous other ways.</p>\n</blockquote>\n<p>Also, I think you under-state your argument here. Yes, many good changes were once weird ideas. But that's also true for many bad ideas! All progress is change but not all change is progress.</p>\n", "parentCommentId": null, "user": {"username": "Dale"}}, {"_id": "k5rRX8GKNTx9aDBkT", "postedAt": "2014-11-30T16:44:26.285Z", "postId": "MH9suFZbxXCYsr5Z5", "htmlBody": "<p>Hey Peter. I think it's good to point out a main agreement that we have. I agree that changing the way you dress and look can be a low-cost and useful way to improve your ability to do advocacy. The area where I think you're missing the mark is with regard to changing your beliefs in order to advocate. If in the process of making your ideas more palatable to others, you lose track of what's true, then your advocacy might end up unhelpful or harmful.</p>\n<p>I think you're missing the point about why I mentioned VIPs. It was to argue that being direct and honestly truth-seeking might be a better way of attracting people who have a larger than average capacity to influence the world. I was arguing that attracting people who have a larger than average capacity to influence the world is likely to be more useful than trying to influence your friends. I'm not clear which, if either of these, you disagree with. I wasn't trying to say that we should be weird in order to copy VIPs, because I agree that they're in a different situation.</p>\n<p>For most people, looking good when they introduce their friends to effective altruism is not a neglected problem. Lots of effective altruists, like any other people, can improve their social skills and tact, but it's rare for people not to be thinking about social approval at all. Arguably, excessive conformity of opinion is one of the world's big problems - for instance, people can collectively numb themselves to big problems in the world like poverty and existential risk.</p>\n<p>I could duplicate arguments for wariness of social biases, but instead it seems better to just link Eliezer, who's been pretty lucid on this topic: <a href=\"http://lesswrong.com/lw/m9/aschs_conformity_experiment/\">Asch's Conformity Experiment</a>, <a href=\"http://lesswrong.com/lw/ma/on_expressing_your_concerns/\">On Expressing Your Concerns</a>.</p>\n", "parentCommentId": "ZH5NyG4NygXqQ6GuA", "user": {"username": "RyanCarey"}}, {"_id": "5HhbY9WyZf2T4ggZ9", "postedAt": "2014-11-30T16:46:21.406Z", "postId": "MH9suFZbxXCYsr5Z5", "htmlBody": "<p>Relevant:</p>\n<ul>\n<li><a href=\"http://lesswrong.com/lw/m9/aschs_conformity_experiment/\">Asch's Conformity Experiment</a> - Eliezer</li>\n<li><a href=\"http://lesswrong.com/lw/ma/on_expressing_your_concerns/\">On Expressing Your Concerns</a> - Eliezer</li>\n<li><a href=\"http://lesswrong.com/lw/kg/expecting_short_inferential_distances/\">Inferential Distances</a> - Eliezer</li>\n<li><a href=\"http://lesswrong.com/lw/i48/hear_me_out/\">Hear me out...</a> - me</li>\n</ul>\n", "parentCommentId": null, "user": {"username": "RyanCarey"}}, {"_id": "v94TShLymTPBcZb6j", "postedAt": "2014-11-30T18:27:52.722Z", "postId": "MH9suFZbxXCYsr5Z5", "htmlBody": "<p>Thanks, this is really insightful.</p>\n<p>I remember an anecdote from a vegan activist  -- I can't find the source -- that went something like the follows:</p>\n<blockquote>\n<p>Are you ready to protest for the movement?</p>\n</blockquote>\n<blockquote>\n<p><em>Crowd chears &quot;YEAH!&quot;</em></p>\n</blockquote>\n<blockquote>\n<p>Are you ready to get in people's faces for the movement?</p>\n</blockquote>\n<blockquote>\n<p><em>Crowd chears &quot;YEAH!&quot;</em></p>\n</blockquote>\n<blockquote>\n<p>Are you ready to face the police and go to jail for the movement?</p>\n</blockquote>\n<blockquote>\n<p><em>Crowd chears &quot;YEAH!&quot;</em></p>\n</blockquote>\n<blockquote>\n<p>Are you ready to put on a suit and look respectable for the movement?</p>\n</blockquote>\n<blockquote>\n<p><em>Crowd mills around, looking down or at each other, doesn't say anything.</em></p>\n</blockquote>\n", "parentCommentId": "FeyqwSMbXQgQehwe8", "user": {"username": "Peter_Hurford"}}, {"_id": "rmeFG5EfgejxQdMha", "postedAt": "2014-11-30T21:22:29.298Z", "postId": "MH9suFZbxXCYsr5Z5", "htmlBody": "<p>Yes! I actually spent a while looking for that quote while writing the comment, but couldn't find the source. I recalled the last line as being something like</p>\n<blockquote>\n<p>Are you ready to put on a suit and work a 9 to 5 job for the movement?</p>\n</blockquote>\n<p>but couldn't get it close enough for my google-fu to bridge the gap to the source.</p>\n", "parentCommentId": "v94TShLymTPBcZb6j", "user": {"username": "Dale"}}, {"_id": "y3kqKcmrJwzWiCB4d", "postedAt": "2014-12-01T17:08:30.865Z", "postId": "MH9suFZbxXCYsr5Z5", "htmlBody": "<p>More generally, writing well and in a familiar style, is the online equivalent of 'dressing well'.</p>\n", "parentCommentId": "xeo5M2NErdAF6vTQm", "user": {"username": "Robert_Wiblin"}}, {"_id": "6H8pQLv7veK84N7nD", "postedAt": "2014-12-02T01:25:54.058Z", "postId": "MH9suFZbxXCYsr5Z5", "htmlBody": "<p>I would observe that certain positions are going to be rather more or less weird depending upon the social context. An example from my personal experience would be that students are in general very pro-immigration, so talking about open borders doesn't cost me all that many weird points. On the other hand, many/most of the people I talk to on a regular basis are Christians, which means that talk of cryonics is right out and vegetarianism is often seen as contrary to certain (particularly New Testament) teachings. What this all means is that you can probably get away with a fair bit of what is commonly considered to be weirdness, providing you tailor it to the people most closely around you and their expectations of you.</p>\n<p>A second point I would make is that, if you have already advocated for a weird position, then even if it feels like this is costing you weirdness points which would be better spent elsewhere, it may well be a bad idea to abandon the positions you have previously advanced. If people see you as a person who advances silly ideas without much evidence and then later has to retract them, this will severely damage your credibility in holding any weird positions at all.</p>\n<p>Thank you writing this post. I could have done with reading it a couple of years back, and will aim to keep it in mind in the future.</p>\n", "parentCommentId": null, "user": {"username": "AndrewPearson"}}, {"_id": "y8ss3FRHtJ5kCGves", "postedAt": "2014-12-04T01:04:26.725Z", "postId": "MH9suFZbxXCYsr5Z5", "htmlBody": "<blockquote>\n<p>   If the real radical finds that having long hair sets up psychological barriers to communication and organization, he cuts his hair.</p>\n</blockquote>\n<p>Saul Alinsky, Rules for Radicals.</p>\n<p>ht: <a href=\"http://lesswrong.com/lw/lc3/rationality_quotes_december_2014/bor0\">27chaos</a></p>\n", "parentCommentId": null, "user": {"username": "Dale"}}, {"_id": "7is8u92jxSMLfE9SR", "postedAt": "2014-12-09T22:22:11.353Z", "postId": "MH9suFZbxXCYsr5Z5", "htmlBody": "<p>I heard this too. There is a similar thought expressed from p30-31 of <em>The Animal Activists' Handbook</em> by Matt Ball (<a href=\"http://animaladvocacybook.com/)\">http://animaladvocacybook.com/)</a>. Quotes from the two pages:</p>\n<blockquote>\n<p>&quot;After re-evaluating his priorities and choosing a more mainstream appearance, he noticed that the quality of his conversations improved, and the respect of his listeners increased. Consequently, he became more effective an influencer of change&quot; (p30).</p>\n</blockquote>\n<blockquote>\n<p>&quot;All of us who are working for things that might be seen as going against the status quo should make sure our appearance doesn't detract from our message. Our message is usually difficult enough for people to accept, without us putting up any additional barriers&quot; (p31).</p>\n</blockquote>\n", "parentCommentId": "rmeFG5EfgejxQdMha", "user": {"username": "yboris"}}, {"_id": "EEomN8ugboYvZsYHw", "postedAt": "2014-12-16T20:08:03.213Z", "postId": "MH9suFZbxXCYsr5Z5", "htmlBody": "<p>I found the reference! It might originally have come from another excellent book: <em>Change of Heart</em> by Nick Cooney, in the early part of the book where he talks about self identity (no page reference because I'm looking at an eBook version). This is entirely unimportant, but in this book the words are:</p>\n<blockquote>\n<p>&quot;Are you willing to cut your hair and put on a suit for the environment?&quot;\n:)</p>\n</blockquote>\n", "parentCommentId": "rmeFG5EfgejxQdMha", "user": {"username": "yboris"}}, {"_id": "FjWbNT6fEN4qwr9DJ", "postedAt": "2015-01-14T09:35:13.198Z", "postId": "MH9suFZbxXCYsr5Z5", "htmlBody": "<p>There are probably quite a few situations where weirdness can be a benefit: celebrities seem to be loved and listened to for their weirdness sometimes? giVes confidence to radically minded people or others sceptical of looking, gives a living example of bucking the social trend and that being ok, helps.people that might think you're doing looking to manipulate others (which is better than doing it to conform depending on the end goal but some people prefer the conform thing or the.weird thing-trustability) ? But on the whole, yes, wear chino's and a shirt and try to speak.with a deep.voice and control your facial.expressions if you're a man-it'll help, especially when talking to people in conventional roles of influence.</p>\n", "parentCommentId": "9NpZAxSNkiNYgwdgg", "user": {"username": "tomstocker"}}, {"_id": "7dChfTLY7Wd7ALYMB", "postedAt": "2015-01-20T23:13:41.449Z", "postId": "MH9suFZbxXCYsr5Z5", "htmlBody": "<p>An advantage of asking people to give 10% of their pre-tax income is that there is no coordination problem. Right now very few people give 10% but I do. And my money is doing good (with high probability). If I have a goal of helping people then it is highly rational for me to donate to certain charities. </p>\n<p>On the other hand, unless you are unusually wealthy or famous, personal efforts to change politics will probably have no effect. If I dress more normally and tone down my political views maybe I can convince a slightly higher percentage of my friends. But this is going to translate into changes in the law. If every &quot;weird&quot; person changed their behavior maybe more good laws could get passed. But given that I am a normal person why should I &quot;normalize&quot; myself if I am not going to get any tangible results. </p>\n<p>Given my analysis I do not suggest people try to act more normal. Unless you are in an unusual position trying to change politics is a waste of time of energy. Politics is much less useful than doing things like helping out other first world members. Be nicer to your friends and family. Don't spend energy or censor yourself in an attempt to change politics. </p>\n", "parentCommentId": null, "user": {"username": "stargirlprincess"}}, {"_id": "zYH2Hut2h6mzuoBDg", "postedAt": "2015-02-04T02:00:48.549Z", "postId": "MH9suFZbxXCYsr5Z5", "htmlBody": "<p>It is like being an author, one has to always ask who your audience is. There are lots of policies, for example, that would help people but seem to be bad for business. When talking to government folks or business folks, show how they are actually good for business and lead with that. So, random third world country suffering from horrible government corruption: normal approach is to denounce corruption and demand reforms. But corruption is bad for business, the GDP grows more slowly the more corruption one has. And it costs companies money directly in bribes. What actually fights corruption is more democracy, more transparency, and more freedom of speech and assembly. What creates those is broad support from the business community for more democracy, more transparency, and more freedom of speech and assembly. The people of England did not rise up and demand the Magna Carta, the Barons marched on London, took it by force of arms, and then demanded the Magna Carta. Power responds to power. Lead with what they want, follow with how they can get it, and no need to even mention what you want in this case. </p>\n", "parentCommentId": null, "user": null}, {"_id": "n4bMpuJLdEu4drr4A", "postedAt": "2015-02-04T02:44:54.590Z", "postId": "MH9suFZbxXCYsr5Z5", "htmlBody": "<p>Firstly, I think this is entirely contextual: certainly in academia, as in many other typically formal environments, one can only dress casually with a certain prior status. Those who dress-down are those who don't need to impress, and thus openly signal that fact. Secondly, in many dissenting subcultures, how one dresses is an important part of that identity, i.e. for an EA to dress and behave modestly is to advertise, and indeed, help enact, ones charitable duties. Thirdly, self-objectification is pretty inhuman to most peoples sensibilities, and especially in the case of women, a pretty negative social pressure. It's also, obviously, extremely conservative ('look and behave like everyone else!' - 'sexually instrumentalise yourself to get more money!').</p>\n<p>I'm certainly not saying one should flatly disregard their appearance, just that it contextually holds, often in dissenting subcultures, and can be rather problematic.</p>\n", "parentCommentId": "QQ9Xt5cFXEAfAMie9", "user": {"username": "Geuss"}}, {"_id": "ZYSFDdLFvMKTLpK9h", "postedAt": "2015-02-05T04:31:49.884Z", "postId": "MH9suFZbxXCYsr5Z5", "htmlBody": "<blockquote>\n<p>What actually fights corruption is more democracy ... assembly</p>\n</blockquote>\n<p>Do you have a citation for these two having a direct causal influence?</p>\n", "parentCommentId": "zYH2Hut2h6mzuoBDg", "user": {"username": "Larks"}}, {"_id": "7jwhdvbg3zRMzjg6S", "postedAt": "2016-07-05T18:54:05.301Z", "postId": "MH9suFZbxXCYsr5Z5", "htmlBody": "<p>Hey! Just happened upon this article while searching for something else. Hope the necro isn't minded. </p>\n<p>I wanted to point out that since this article was written--and especially in the last year--basic income at least has become a lot more mainstream. There's the (failed) Swiss referendum, and apparently Finland and YCombinator are both running basic income trials as well. (More locally, there's of course the GiveDirectly UBI trial as well.) </p>\n<p>Anecdotally, it seems like these events have also been accompanied by many more people (in my particular bubble) being familiar with the idea. Empirically, see below for a graph of [number of articles mentioning basic income] per year in the New York Times in the link below. EDIT:  in an April survey \"A majority of Europeans (58%) reported to have at least some familiarity with the concept of basic income, and 64% of Europeans said they would vote in favour of basic income.\" Not sure about the US at large, though. </p>\n<p>Obviously it's debatable how well we could have foreseen this, but it might be worth thinking about a) to what degree we can predict(/affect) which \"weird\" idea will gain traction and b) to what extent (the possibility of) this sort of rapid increase in acceptability allows for some relaxation of the \"weirdness points\" framework.</p>\n<p>NYT link. Note, too, the basic income \"bubble\" in the ~'70s.\n<a href=\"http://chronicle.nytlabs.com/?keyword=%22basic%20income%22&amp;format=count\">http://chronicle.nytlabs.com/?keyword=%22basic%20income%22&amp;format=count</a></p>\n<p>Results from that April EU survey summarized here: \n<a href=\"http://www.basicincome.org/wp-content/uploads/2016/05/EU_Basic-Income-Poll_Results.pdf\">http://www.basicincome.org/wp-content/uploads/2016/05/EU_Basic-Income-Poll_Results.pdf</a></p>\n", "parentCommentId": null, "user": {"username": "AshwinAcharya"}}, {"_id": "p9nygG6LEQiJbqdXf", "postedAt": "2021-01-21T00:22:01.706Z", "postId": "MH9suFZbxXCYsr5Z5", "htmlBody": "<p>Over time, I’ve become less convinced of the value of thinking explicitly about weirdness points for most individuals, and I’m concerned that for many people the concept can actually be pretty harmful. To a large extent, I’m referring less to this actual post, and more to weirdness points as a meme, which I think is somewhat less nuanced than the original post. So I might not be maximally charitable in my criticisms, since what I am criticising is the concept as it is often expressed, rather thanas&nbsp; it was originally expressed.</p><p>My concerns are a combination of:</p><ol><li>I think the model is somewhat flawed, especially in domains like hobbies and physical appearance, rather than things like policies and opinions, and that likeability is more messy and complicated</li><li>Even if that weren’t true, I worry that, in practice, people’s attempts to make themselves less weird may in fact make them more weird.</li><li>Finally, regardless of 1 or 2, I think that the psychological costs of worrying about weirdness points can be pretty high relative to the potential benefits, at least for a significant subset of EAs. Additionally, to the extent to which one puts credence in the model being correct, I think it can be hard to avoid these costs once one is familiar with the idea of weirdness points.</li></ol><p>I’m going to focus primarily on point 3, since I think other people have already made points 1 and 2.</p><p>I’m going to talk about my personal experience for a bit, because I think it’s illustrative of one of the ways this can go wrong.</p><p>I encountered the concept of weirdness points as a fairly new EA. To give some context, I have always been a fairly weird person, to some extent for reasons largely outside of my control. I’ve also, for a long time, been afraid of being disliked and ostracised for this, and to some extent internalised the notion of weirdness as Bad. At the point I joined EA, I still was pretty insecure about this, but derived reassurance from being able to say that my actual goals had nothing to do with being liked by people. Then suddenly BAM, this reassurance didn’t really work anymore. Me being weird and people disliking me no longer just affected me, but, to some extent, the EA community at large. So suddenly every weird thing I did actively made the world worse! I don’t really endorse this line of reasoning, and I’m certainly not trying to suggest other people endorse it. But I did find it pretty hard to shake because there might well be *some* grain of truth to it, and was in some sense supported by some interpretations of weirdness points. In any case, I don’t think me thinking along these lines was helpful to either myself or the world, since it mostly just worsened by confidence and wellbeing, and made me more afraid to do anything, which probably, if anything, made me less likeable.</p><p>While some aspects of this are likely particular to me, I do think the meme of weirdness points and related concepts may have similar detrimental effects for other EAs, especially those with a history of poor mental health and confidence issues, which seem to be disproportionately prevalent within the community. The idea that you have a *set* number of weirdness points also seems to me to be potentially particularly harmful (regardless of whether it is true), because this seems to imply that those who already have high baseline weirdness for factors entirely outside of their control, such as neurodivergence, or atypical appearance, have a lot fewer of their weirdness points left over before they do anything at all. I think this can lead to people feeling they have to put even more effort than other people into curating their image and have even less freedom to do weird things (when this curation may be more mentally taxing for this precise group of people). Or worse, that their very presence and visibility is *by itself* harming the EA community.</p><p>The concept of weirdness points clearly has some merit to it, especially for individuals going into policy or something very public-facing. The law of equal and opposite advice applies, and it probably is net helpful for a bunch of people. However, most people already worry about being perceived as weird for normal human reasons, and I think that adding the additional worry that being perceived as weird may cause actual moral harm can be psychologically damaging for a proportion of people, and hamper their efforts to do good.</p><p>On net, I’m not sure whether it is wise as a community to spread the meme of weirdness points to the extent that we have.</p>", "parentCommentId": null, "user": {"username": "MarkCooper"}}, {"_id": "t8e9MJXd64J3K7hzc", "postedAt": "2021-11-07T18:56:35.916Z", "postId": "MH9suFZbxXCYsr5Z5", "htmlBody": "<p>One thing I dislike about this model is that it seems to compress varying negative judgments into \"this person is weird\". A few examples from this post:</p>\n<ul>\n<li><strong>Unprofessional / unserious</strong> : If you're a punk rocker vegan advocate, people may judge you to be unserious, as you have not compromised your self-expression in order to appear professional.</li>\n<li><strong>Untrustworthy</strong>: If someone hears you advocating for [cryonics / open borders / other radical ideas], they may conclude that you are not forming your beliefs in a normal way, and then choose to generally trust you less. If you only advocate for one of those ideas, among a portfolio of relatively normal beliefs, the average person is probably correctly judging you to be more trustworthy, at least by their epistemic standards.</li>\n<li><strong>Unrealistic</strong>: If you are advocating for universal basic income instead of relaxed zoning laws, people may conclude that you are not a good political ally because you are making unrealistic demands.</li>\n</ul>\n<p>You can try to respond to all of those by \"don't be weird\", but it seems better to figure out whether you need to send signals of seriousness, trustworthiness, or pragmatism.</p>\n<p>What's more, as <a href=\"https://forum.effectivealtruism.org/posts/MH9suFZbxXCYsr5Z5/you-have-a-set-amount-of-weirdness-points-spend-them-wisely?commentId=p9nygG6LEQiJbqdXf\">EmeryCooper mentioned</a>, this doesn't apply nearly as well to domains like physical appearance as it does to policies and opinions. I've also seen this <a href=\"https://forum.effectivealtruism.org/posts/HfdeFgFnNtbnkWgqk/how-do-eas-deal-with-having-a-weird-appearance\">extended to types of weirdness</a> that seem more difficult to change, like being visibly LGBT+ or having a non-standard accent.</p>\n", "parentCommentId": null, "user": {"username": "tessa"}}, {"_id": "42W2YyNvGQMtywQDW", "postedAt": "2021-11-08T20:00:32.372Z", "postId": "MH9suFZbxXCYsr5Z5", "htmlBody": "<p>This sounds like a reasonable analysis that is worth replacing my analysis worth. Worth flagging that I wrote this ~7 years ago and my thinking has changed a lot on the issue.</p>\n", "parentCommentId": "t8e9MJXd64J3K7hzc", "user": {"username": "Peter_Hurford"}}, {"_id": "tTgHRnH9yBGzmpuYk", "postedAt": "2021-11-10T13:06:55.424Z", "postId": "MH9suFZbxXCYsr5Z5", "htmlBody": "<p>Fair, yeah― this piece is still getting referenced (a testament to its impact!) so I figured it's open for criticism,  but I wasn't imagining I was criticizing your current views.</p>\n", "parentCommentId": "42W2YyNvGQMtywQDW", "user": {"username": "tessa"}}, {"_id": "LiLFExFxbEWtzaYa3", "postedAt": "2021-11-11T15:08:43.973Z", "postId": "MH9suFZbxXCYsr5Z5", "htmlBody": "<p>Thanks! I definitely think it is open to criticism. I appreciate your more nuanced perspective.</p>\n", "parentCommentId": "tTgHRnH9yBGzmpuYk", "user": {"username": "Peter_Hurford"}}, {"_id": "S4vGwiyZvkJgJXPkG", "postedAt": "2022-01-15T19:42:44.703Z", "postId": "MH9suFZbxXCYsr5Z5", "htmlBody": "<p>When I wrote this post back in 2014, the effective altruism movement was very different than it is today and I think this post was taken more seriously than I wanted it to be. I think generally speaking at the time, the EA movement was not yet taken seriously and I think it needed to appear a bit more \"normal\" and appeal more to mainstream sensibilities and get credibility / traction. But now, in 2022, I think the EA movement unequivocally has credibility / traction and the times now call for \"keeping EA weird\" - the movement has enough sustaining power now that we can afford to be weird and that this weirdness is an asset as it is what puts important but otherwise completely disregarded concepts on the map, such as AI risk, longtermism, invertebrate sentience, and digital sentience. I'm unsure if this post was net positive as a result and I think the concept has been very well refined and improved over the years in the comments.</p>\n", "parentCommentId": null, "user": {"username": "Peter_Hurford"}}, {"_id": "XCDwKB3xEYbeAW9zx", "postedAt": "2022-06-10T20:49:11.481Z", "postId": "MH9suFZbxXCYsr5Z5", "htmlBody": "<p>Is anyone aware of a survey that shows the percentages of support within the EA community for the following policies and/or goals mentioned in the post? Thanks much!&nbsp;</p><p>&nbsp;</p><p>\" Others would suggest that <a href=\"http://lesswrong.com/lw/i3s/why_eat_less_meat/\">everyone become vegetarian</a>, advocating for <a href=\"http://www.openborders.info/\">open borders</a> and/or <a href=\"http://slatestarcodex.com/2013/12/08/a-something-sort-of-like-left-libertarianism-ist-manifesto/\">universal basic income</a>, the <a href=\"http://www.cs.virginia.edu/~evans/cs655/readings/purity.html\">abolishment of gendered language</a>, having more resources into <a href=\"http://www.nickbostrom.com/existential/risks.html\">mitigating existential risk</a>, <a href=\"http://intelligence.org/smarter-than-us/\">focusing on research into Friendly AI</a>, <a href=\"http://www.overcomingbias.com/2008/12/we-agree-get-froze.html\">cryonics</a> and <a href=\"http://www.calicolabs.com/\">curing death</a>, etc.\"</p>", "parentCommentId": null, "user": {"username": "Locke"}}, {"_id": "b6FiHSmfdhrxWFugJ", "postedAt": "2023-07-25T08:24:57.848Z", "postId": "MH9suFZbxXCYsr5Z5", "htmlBody": "<p>In hindsight, the number of weirdness points we have can be increased. This is especially true if some of the supporters of causes at one point considered weird later become very wealthy and patronize that niche, unusual cause to the tune of tens of millions of dollars.&nbsp;<br><br>On the other hand, as much as the size of the pool of weirdness points is theoretically unlimited, it's still hard to practically increase the number of available weirdness points at an arbitrary rate. It's still very possible to spend one's weirdness points too quickly, and hurt one's reputation in the process, so the reservoir of weirdness points should still be spent wisely.</p>", "parentCommentId": null, "user": {"username": "Evan_Gaensbauer"}}]