[{"_id": "q93GwbLw7Lt3a5PRy", "postedAt": "2023-11-15T16:29:18.732Z", "postId": "MLgheFnttLjJcG5hM", "htmlBody": "<p>I didn't read the article, only skimmed it, but couldn't find much that supports the headline claim of $1.5 trillion. I tried searching for \"$\", but all other dollar amounts are much smaller and don't add up to $1.5 trillion, so it is unclear what this money will be conretely spent on. Also I couldn't find a time frame over which this money would be spent.</p>\n<p>Maybe you can add a summary of the parts of the article that deal with the headline amount, or say which things make you believe that this much money will likely/maybe be spent on nuclear missiles in the near future?</p>\n", "parentCommentId": null, "user": {"username": "harfe"}}, {"_id": "ydEspnQAhFTosb2py", "postedAt": "2023-11-16T22:25:41.557Z", "postId": "MLgheFnttLjJcG5hM", "htmlBody": "<p>This is a fair push-back.&nbsp;<br><br>The article contains only the explanation of one immediate spend of $100 billion on a new Sentinel missile which was ordered in 2021.&nbsp;The precise details of the $1.5 trillion number are not outlined in the article itself, but are available at the following <a href=\"https://armscontrolcenter.org/fact-sheet-u-s-nuclear-weapons-modernization-costs-constraints/\">link</a>, which reference this <a href=\"https://www.armscontrol.org/issue-briefs/2017-08/trillion-half-dollar-triad\">original source</a>. The estimate is based on a 30 year time-frame, with a low-end estimate of $1.25 trillion. It is true that the original source comes from a group in favour of Arms Control.&nbsp;<br><br>That said, my point in writing this post was not to focus on the precise quantity (even if it's \"only\" $1.0 trillion, that doesn't make it OK). Rather to highlight that the US is spending huge amounts of money upgrading their nuclear weapons in a world which would be far better off without more nuclear weapons, and there has been (to my knowledge) almost no public debate or even political debate over whether upgrading nuclear missiles is the right thing to do. It just goes on behind the scenes.&nbsp;<br><br>To be clear, this is not about some utopian vision of a world without the need for nuclear deterrence. The US still has 900 submarine-based nuclear missiles. So there is no credible argument that the new and improved land-based missiles are needed for deterrence, since the submarine-based missiles would be impossible to destroy in a first-strike attack.&nbsp;<br><br>Somebody is peddling the notion that, with the right missiles, the US could win a nuclear war.&nbsp;<br><br>I would love to see more public debate about this, rather than these matters being decided in secret discussions between politicians (looking for campaign funds), armed forces personnel (looking for relevance and power) and arms producers (looking for profit). I'm not sure which of these actors actually represents the interests of the majority of citizens, of America or of the world.&nbsp;</p>", "parentCommentId": "q93GwbLw7Lt3a5PRy", "user": {"username": "Denis "}}, {"_id": "CzpBoswAbACkYusk2", "postedAt": "2023-11-17T03:59:50.007Z", "postId": "MLgheFnttLjJcG5hM", "htmlBody": "<blockquote><p>I am curious to know how many Americans were consulted about the decision to spend about $10,000 per tax-payer on upgrading nuclear weapons... surely this is a decision that American voters should have been deeply involved in, given that it impacts both their taxes and their chance of being obliterated in a nuclear apocalypse.&nbsp;</p></blockquote><p>I think there's a debate to be had about when it's best for political decisions be decided by what the public <i>directly</i> wants, vs when it's better for the public to elect representatives that make decisions based on a combination of their personal judgment and deferring to domain experts. I don't think this is obviously a case where the former makes more sense.&nbsp;</p><p>&nbsp;</p><blockquote><p>It feels like that much money could be much better spend in other areas.&nbsp;</p></blockquote><p>Sure, but the alternative isn't the money being spent half on AMF and half on the LTFF – it's instead some combination of other USG spending, lower US taxes, and lower US deficits. I suspect the more important factor in whether this is good or bad will instead be the direct effects of this on nuclear risk (I assume some parts of the upgrade will reduce nuclear risk – for instance, better sensors might reduce the chances of a <a href=\"https://en.wikipedia.org/wiki/1983_Soviet_nuclear_false_alarm_incident\">false positive</a> of incoming nuclear weapons – while other parts will increase the risk).</p><p>&nbsp;</p><blockquote><p>Isn't there a contradiction between the idea that nuclear weapons serve as a deterrent and the idea that we need to upgrade them? The implication would seem to be that the largest nuclear missile stockpile on the planet still isn't a sufficient deterrent, in which case what exactly would constitute a deterrent? &nbsp;</p></blockquote><p>Not necessarily – the upgrade likely includes many aspects for reducing the chances that a first-strike from adversaries could nullify the US stockpile (efforts towards this goal could include both hardening and redundancy), thus preserving US second-strike capabilities.</p><p>&nbsp;</p><blockquote><p>More to the point, is this decision being taken by people who see nuclear war as a zero-sum game - we win or we lose</p></blockquote><p>I'm sure ~everyone involved considers nuclear war a negative-sum game. (They likely still think it's preferable to win a nuclear war than to lose it, but they presumably think the \"winner\" doesn't gain as much as the \"loser\" loses.)</p><p>&nbsp;</p><blockquote><p>If the US truly needs to upgrade its nuclear arsenal, then surely the same is true of Russia</p></blockquote><p>Yeah, my sense is multiple countries will upgrade their arsenals soon. I'm legitimately uncertain whether this will on net increase or decrease nuclear risk (largely I'm just ignorant here – there may be an expert consensus that I'm unaware of, but I don't think the immediate reaction of \"spending further money on nukes increases nuclear risk\" is obviously necessarily correct). Even if it would be better for everyone to not, it may be hard to coordinate to avoid doing so (though may still be worth trying).</p><p>&nbsp;</p><blockquote><p>Given the success of <i>Oppenheimer</i> and the spectre of nuclear annihilation that has been raised by the war in Ukraine, this might be the moment to get the public behind such an initiative.&nbsp;</p></blockquote><p>I think it's not crazy to think there might be a relative policy window now to change course, given these reasons.</p>", "parentCommentId": null, "user": {"username": "Daniel_Eth"}}, {"_id": "knhYXeFAZryfXXcCv", "postedAt": "2023-11-17T08:19:09.668Z", "postId": "MLgheFnttLjJcG5hM", "htmlBody": "<p>Thanks Daniel,<br><br>This is all good perspective. Mostly I don't disagree with what you wrote, just a few comments:<br><br>In terms of decisions, I'm not necessarily saying that the public should decide, but that the public at least should be aware and involved.&nbsp;<br><br>Your comment about alternative uses for the money is correct - my original point was a bit simplistic!<br><br>My original post didn't talk enough about deterrence, but in a response to another comment I mentioned the key point I missed: the US will still have 900 submarine-based missiles as their deterrent. Much as I personally would love to be nuclear-weapon-free, I am not suggesting that the US could safely get rid of these, and I believe they provide an adequate deterrent.&nbsp;<br><br>Your insight that some of the upgrades may increase safety is a good one - I hadn't considered that.&nbsp;<br><br>Maybe I'm just idealistic, but I believe we need to see more efforts at more reduction of nuclear arsenals, and that this might be a time to try. I totally agree it won't be easy!&nbsp;</p><p><br>Overall, thanks for this. It is always appreciated when someone takes the time and effort to critique a post in some depth. Cheers!&nbsp;<br><br>&nbsp;</p>", "parentCommentId": "CzpBoswAbACkYusk2", "user": {"username": "Denis "}}, {"_id": "vCinBKsHBQieqXYhN", "postedAt": "2023-11-17T18:28:53.599Z", "postId": "MLgheFnttLjJcG5hM", "htmlBody": "<p>Probably a much better use of people's time than reading my post would be to listen to today's talk by Carl Robichaud about nuclear weapons from the EA Virtual conference today:<br><br><a href=\"https://app.swapcard.com/event/eagxvirtual-2023/planning/UGxhbm5pbmdfMTY4OTIwOQ==\">A Turning Point in the Story of Nuclear Weapons? (swapcard.com)</a></p>", "parentCommentId": null, "user": {"username": "Denis "}}, {"_id": "4ucNXXwo8zXQJXtQf", "postedAt": "2023-11-24T16:47:55.761Z", "postId": "MLgheFnttLjJcG5hM", "htmlBody": "<p>Highlighting a distinctive viewpoint: I believe there's room for discussion on when political decisions should reflect direct public preferences versus the election of representatives who blend personal judgment with input from domain experts. It's not immediately clear that the former approach is <a href=\"https://apkwa.net/\">more </a>fitting in this scenario.</p>", "parentCommentId": null, "user": {"username": "Cozy Nest"}}, {"_id": "ypHoSc7cmTtDkdbsD", "postedAt": "2023-11-26T19:18:05.361Z", "postId": "MLgheFnttLjJcG5hM", "htmlBody": "<p>Thanks for the comment!<br><br>I don't disagree with the point you're making at all.&nbsp;<br><br>My problem with the current situation is that there are probably not a broad range of domain experts being involved and receiving weight proportionate to their expertise. Specifically, I see two problems:<br><br>1. It feels like the armed forces and the weapons manufacturers, who are two of, but not the only domains in which expertise is relevant, have an overwhelming voice in these decisions. It's not clear to me that other voices are sufficiently heard, for example EA groups doing research looking at how to minimise the risk of nuclear war.&nbsp;</p><p>2. In addition to the limited range of expertise involved, there is a high risk of bias. Investing more money in nuclear weapons has different value for different people. Depending on your opinions, you may conclude that it is good or bad for a typical American citizen. However, there is a very small group of people for whom &nbsp;the expected value is extremely positive - arms manufacturers and the armed forces. So when the decision is being taken by people who stand to benefit from one choice and to be hurt by the other choice, that's not ideal.&nbsp;</p>", "parentCommentId": "4ucNXXwo8zXQJXtQf", "user": {"username": "Denis "}}, {"_id": "Wb5EQiQtnXesFyWhW", "postedAt": "2023-12-25T17:06:38.348Z", "postId": "MLgheFnttLjJcG5hM", "htmlBody": "<blockquote><p>I'm sure ~everyone involved considers nuclear war a negative-sum game. (They likely still think it's preferable to win a nuclear war than to lose it, but they presumably think the \"winner\" doesn't gain as much as the \"loser\" loses.)</p></blockquote><p>On top of this, I imagine most involved view not fighting a nuclear war as preferable to fighting and winning. (In other words, a nuclear war is not only negative on net, but negative for everyone.)<span class=\"footnote-reference\" data-footnote-reference=\"\" data-footnote-index=\"1\" data-footnote-id=\"jvxp71pna8\" role=\"doc-noteref\" id=\"fnrefjvxp71pna8\"><sup><a href=\"#fnjvxp71pna8\">[1]</a></sup></span></p><blockquote><p>Yeah, my sense is multiple countries will upgrade their arsenals soon. I'm legitimately uncertain whether this will on net increase or decrease nuclear risk (largely I'm just ignorant here – there may be an expert consensus that I'm unaware of, but I don't think the immediate reaction of \"spending further money on nukes increases nuclear risk\" is obviously necessarily correct).</p></blockquote><p>I previously did some work (with/under Michael Aird) on <a href=\"https://forum.effectivealtruism.org/posts/HuQtr7qfB2EfcGqTu/technological-developments-that-could-increase-risks-from-1\">the effects of nuclear weapons advances on nuclear risk</a>. There’s no expert consensus I’m aware of: for many advances there are a bunch of considerations going in both directions.</p><p>One example of an advance that I’m somewhat confident would&nbsp;<i>decrease</i> risk is <a href=\"https://docs.google.com/document/d/18nBfHOV-U_QDJ5K0GIAk6BYiNTKw673jJBb5aXFqk_8/edit#heading=h.c9dy7mnlya97\">more accurate nuclear weapons</a>. The main reason: nukes being more accurate means that fewer nukes, and/or nukes with lower explosive yields, are needed to hit the intended target. The effect of this is fewer direct casualties; also—and more importantly for x-risk—less soot generated, hence less of a nuclear winter effect.</p><hr><p>(Tagging the OP, <a href=\"https://forum.effectivealtruism.org/users/denis?mention=user\">@Denis</a>, in case my comment or the post I link to is of interest.)</p><ol class=\"footnote-section footnotes\" data-footnote-section=\"\" role=\"doc-endnotes\"><li class=\"footnote-item\" data-footnote-item=\"\" data-footnote-index=\"1\" data-footnote-id=\"jvxp71pna8\" role=\"doc-endnote\" id=\"fnjvxp71pna8\"><span class=\"footnote-back-link\" data-footnote-back-link=\"\" data-footnote-id=\"jvxp71pna8\"><sup><strong><a href=\"#fnrefjvxp71pna8\">^</a></strong></sup></span><div class=\"footnote-content\" data-footnote-content=\"\"><p>This raises the obvious question, “Why fight at all?” As best I’m aware, the answer to that lies with things like false information (e.g., false alarm triggering a second strike that’s actually a first strike), and also with some artefacts of game theory (e.g., brinkmanship-gone-wrong; bargaining breakdown due to misevaluating how the opponent sees things; etc.) as well as the reality that actors don’t always behave rationally.</p></div></li></ol>", "parentCommentId": "CzpBoswAbACkYusk2", "user": {"username": "Will Aldred"}}]