[{"_id": "BNgetfe92WxdmiumF", "postedAt": "2023-10-20T16:23:07.605Z", "postId": "MMh5Rz4FvddSuoBhS", "htmlBody": "<p>Thanks to Rob for taking on the role and thanks for your work in the interim Howie. I wish you well on your new role also.&nbsp;</p>", "parentCommentId": null, "user": {"username": "nathan"}}, {"_id": "QHXDKFXdT9CsPxonL", "postedAt": "2023-10-20T19:42:17.687Z", "postId": "MMh5Rz4FvddSuoBhS", "htmlBody": "<p>Welcome Rob, and thanks Howie for all your work over the past year!</p>", "parentCommentId": null, "user": {"username": "Ben_West"}}, {"_id": "fgonTossG4o3QjRot", "postedAt": "2023-10-20T20:22:57.024Z", "postId": "MMh5Rz4FvddSuoBhS", "htmlBody": "<p>Thanks for the announcement. I’m really glad to feel that EV is going to continue being in safe hands going forward (both given Rob’s extensive experience and knowing from personal experience how responsible he is).&nbsp;</p><p>Thank you so much for your work on EV. Taking on a hugely complex organisation at a time of such turmoil was always going to be extremely challenging. You really stepped up at a time when many of us were struggling just to continue our usual jobs. And then over the start of 2023 instead of getting a break it felt as if a series of separate things happened to keep making the role more challenging. As a staff member of one of the projects EV houses, it’s been really reassuring to know that someone with such great judgement and who is so ceaselessly dedicated was stewarding things, so that we could get on with our object level work without needing to worry much about the background entity.&nbsp;</p><p>From a personal standpoint, I’m even more grateful for the years we got to work together at 80,000 Hours. I’ve learned a huge amount from you in the various different roles we’ve each had. Most influentially, as my manager you did an really astounding job of helping me actually live up to my values and grow, while ensuring I always felt supported and was working sustainably. I’m very much going to miss being able to rely on your advice and support, and I hate that you’re moving to the other side of the world. I’m glad we’ll be continuing to work on the same mission, even if we won’t be next to each other to do it.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Michelle_Hutchinson"}}, {"_id": "DWWzi7LDdsJDdMCWP", "postedAt": "2023-10-21T00:41:38.106Z", "postId": "MMh5Rz4FvddSuoBhS", "htmlBody": "<p>Howie – I suspect you’d rather I don’t write anything, but it feels wrong not to thank you for everything you’ve given to this role and to the organisation over the past year. So I hope you’ll forgive a short (and perhaps biased) message of appreciation.&nbsp;</p><p>Over the past year, you have taken EV UK through one of the most challenging periods of its history with extraordinary dedication and leadership. I don’t think there are many people who would have taken on a role like yours in the days after FTX collapsed, and fewer still who could have done the job you did.&nbsp;</p><p>Throughout this time, I have continually been impressed with your intellect, inspired by your integrity, and in awe of your unceasing commitment to doing good. And I know for a fact that I’m not the only one.&nbsp;</p><p>It’s been a privilege to support you for the past year and I’m delighted that you’ll now have a chance to take a proper break, before throwing yourself into the next challenge.&nbsp;</p><p>Thank you for everything.&nbsp;</p>", "parentCommentId": null, "user": {"username": "George Rosenfeld"}}, {"_id": "YzGJwFEFkJbrw9nFE", "postedAt": "2023-10-21T00:44:01.127Z", "postId": "MMh5Rz4FvddSuoBhS", "htmlBody": "<p>Welcome to the team, Rob – we’re really excited to have you step into the role, and looking forward to getting started over the next few weeks!</p>", "parentCommentId": null, "user": {"username": "George Rosenfeld"}}, {"_id": "vzquXFcniRh42kujk", "postedAt": "2023-10-22T00:15:51.877Z", "postId": "MMh5Rz4FvddSuoBhS", "htmlBody": "<p>Thank you both for your past and future work on EV, and best wishes to both of you in your new roles. Really looking forward to seeing you more in the geographic vicinity of Open Phil!</p>\n", "parentCommentId": null, "user": {"username": "Katja_Grace"}}, {"_id": "ksoNzpmJHCFEhGES8", "postedAt": "2023-10-22T14:19:37.178Z", "postId": "MMh5Rz4FvddSuoBhS", "htmlBody": "<p>I've only worked with Rob Gledhill a small amount in the past, but the interactions I've had with him left me with positive impressions. He struck me as competent, professional, and caring.</p><p>I think quite a bit about talent, hiring, operations, how to make use of people, etc. I suspect that Rob at the head of Effective Ventures (UK) will be a net plus for the EA ecosystem. Opinions from random community members may not be particularly important for these kinds of decisions, but I at least want to voice that (to the extent it matters or that anyone cares), I'm happy to see this happening.</p>", "parentCommentId": null, "user": {"username": "jlemien"}}, {"_id": "FzRkwyApsDcyBWsKw", "postedAt": "2023-10-23T17:06:06.011Z", "postId": "MMh5Rz4FvddSuoBhS", "htmlBody": "<p>Thank you so much for your work with EV over the last year, Howie! It was enormously helpful to have someone so well-trusted, with such excellent judgment, in this position. I’m sure you’ll have an enormous positive impact at Open Phil.<br><br>And welcome, Rob - I think it’s fantastic news that you’ve taken the role!</p>", "parentCommentId": null, "user": {"username": "William_MacAskill"}}]