[{"_id": "vrf56Ekvjktt627Tx", "postedAt": "2023-11-15T18:21:03.743Z", "postId": "MmSZiKeQZ5FvCiZSB", "htmlBody": "<p>I want to highlight that I think MHI's explicit aim for this model to be adopted by the government is a great response to the criticisms of aid where there are concerns about dependency, and criticisms of the NGO sector where there are concerns about short-termism and displacing the government and public services.&nbsp;</p><p>I think other global health charities should consider a similar approach, where an intervention is demonstrated to be highly cost-effective, and this is used to encourage the government to scale this up and integrate it into public services, rather than having the charity scale it up independently.</p>", "parentCommentId": null, "user": {"username": "freedomandutility"}}, {"_id": "MxujLDaQNaWpJNbuZ", "postedAt": "2023-11-15T19:15:57.345Z", "postId": "MmSZiKeQZ5FvCiZSB", "htmlBody": "<p><strong>Executive summary</strong>: The Maternal Health Initiative trains healthcare providers in Ghana to integrate family planning counselling into routine postnatal care. In their first year, they reached 18 facilities and estimate averting disability-adjusted life years for $99 each. Their goal is government adoption of their model to reach 800,000 mothers annually at just $34 per DALY.</p><p><strong>Key points</strong>:</p><ol><li>MHI trains nurses and midwives to counsel new mothers on contraception during routine postnatal checkups. This addresses barriers to family planning access.</li><li>In 2022, MHI tested and refined their training program and materials through small pilots in Ghana. Preliminary data showed increased counseling and contraceptive uptake.</li><li>A larger 6-week pilot completed in October 2023 reached 50 providers and 20,000 clients across 6 hospitals. Results on contraceptive uptake are expected in December.</li><li>If pilot results are strong, MHI aims to scale up through partnership with the Ghana Health Service, working towards government adoption of their model.</li><li>MHI estimates averting disability-adjusted life years for under $100 each, competitive with top cost-effective charities. Government adoption could lower this to $34 per DALY.</li><li>As a post-seed organization, MHI faces funding challenges, but believes EA donations offer flexibility and trust compared to government grants. Different donation amounts could fund specific program components.</li></ol><p>&nbsp;</p><p><i>This comment was auto-generated by the EA Forum Team. Feel free to point out issues with this summary by replying to the comment, and</i><a href=\"https://forum.effectivealtruism.org/contact\"><i>&nbsp;<u>contact us</u></i></a><i> if you have feedback.</i></p>", "parentCommentId": null, "user": {"username": "SummaryBot"}}, {"_id": "zddfr8boGGWiyorRv", "postedAt": "2023-11-15T23:42:20.516Z", "postId": "MmSZiKeQZ5FvCiZSB", "htmlBody": "<p>The problem with \"get governments to scale up and integrate\" is that governments... suck. Corruption, incompetence, straight up theft, etc. mean that these interventions which were being provided, when taken over by the government just disappear in a few years.</p><p>Many people in the West feel that governments are maybe a bit wasteful and inefficient but on the whole good/okay. In developing countries, this is not always the case.</p>", "parentCommentId": "vrf56Ekvjktt627Tx", "user": {"username": "MarcusAbramovitch"}}, {"_id": "MdxofWP2m4yTQmfkB", "postedAt": "2023-11-16T18:48:52.788Z", "postId": "MmSZiKeQZ5FvCiZSB", "htmlBody": "<p>Also, as Karen Levy pointed out in her ep on the 80k podcast, adoption by LMIC governments effectively means the taxpayers of these countries are the ones to pay. Sustained service by an internationally funded charity represents a desirable wealth transfer to LMICs. Better than the charity graduating from being funded by EAs to being funded by LMIC governments would be for it to graduate to being funded by big funders with cheap counterfactuals like USAID.</p>\n<p>(To play devil’s advocate to myself: If government adoption means capacity building in LMIC healthcare systems then that’s great compared to dependence on sustained service from international NGOs. Maybe the best of both worlds is government adoption with ongoing technical assistance and international funding?)</p>\n", "parentCommentId": "zddfr8boGGWiyorRv", "user": {"username": "Aidan Alexander"}}, {"_id": "DGHDaBPF3cvSpncK8", "postedAt": "2023-11-20T16:03:49.922Z", "postId": "MmSZiKeQZ5FvCiZSB", "htmlBody": "<p>I definitely agree with and share the concerns over government adoption as a silver bullet of sorts on the charity's side. Outsourcing all the costs when the government's money and resources are more counterfactually precious than the charity's is not the way we want things to go!<br><br>Our aim is closer to your last sentence: government adoption to leverage the cost-savings from delivery through their existing systems of training/data collection/material distribution, with MHI continuing to pay for the costs involved that the government wouldn't incur anyway.</p>", "parentCommentId": "MdxofWP2m4yTQmfkB", "user": {"username": "ben3536"}}, {"_id": "jkGQMJNhLAr7kBDjz", "postedAt": "2023-12-30T13:17:53.776Z", "postId": "MmSZiKeQZ5FvCiZSB", "htmlBody": "<p>I don't think adoption by LMIC governments removes the desirable wealth transfer to LMICs. I think most of the wealth transfers to LMICs will continue via other NGOs.&nbsp;</p><p>CGD have some interesting work making the case that governments should focus on prioritising the most cost-effective health services, and donors, whose funding is less reliable should focus on additional, less cost-effective stuff - https://www.cgdev.org/blog/putting-aid-its-place-new-compact-financing-health-services</p>", "parentCommentId": "MdxofWP2m4yTQmfkB", "user": {"username": "freedomandutility"}}]