[{"_id": "M3iucE9EgLT7wrWPB", "postedAt": "2024-02-14T14:09:39.995Z", "postId": "MnecE9Y3SgMTfobCr", "htmlBody": "<p>Re fiscal sponsorship in the United States: I would definitely encourage small orgs in the U. S. to set up charitable corporations in the state they operate (relatively simple, quick step). From there, if your org anticipates getting 50k or less in funding, you can do an IRS 1023EZ form, which I will link below. It might require some back and forth with the IRS for a few months, but once you get the recognition letter, you can get donations and donors can deduct the amount, with no fees involved.</p>\n<p>I don't have experience with fiscal sponsorship, but there are probably some hoops to jump through with that as well.</p>\n<p><a href=\"https://www.irs.gov/forms-pubs/about-form-1023-ez\">https://www.irs.gov/forms-pubs/about-form-1023-ez</a></p>\n", "parentCommentId": null, "user": {"username": "Brad West"}}, {"_id": "4sjaizkfaajSfyBFB", "postedAt": "2024-02-14T14:34:53.732Z", "postId": "MnecE9Y3SgMTfobCr", "htmlBody": "<p>Also, as long as the application was  filed within 27 months of formation, the approval is retroactive to the charity's formation. If the charity follows a fairly \"standard\" model, the odds of a 1023-EZ being denied should be rather low.</p>\n<p><a href=\"https://www.irs.gov/charities-non-profits/charitable-organizations/exempt-organizations-general-issues-deductibility-of-contributions-while-application-pending\">https://www.irs.gov/charities-non-profits/charitable-organizations/exempt-organizations-general-issues-deductibility-of-contributions-while-application-pending</a></p>\n", "parentCommentId": "M3iucE9EgLT7wrWPB", "user": {"username": "Jason"}}, {"_id": "QtnmamGTCLBdQ5dAo", "postedAt": "2024-02-14T15:05:45.263Z", "postId": "MnecE9Y3SgMTfobCr", "htmlBody": "<p><strong>Executive summary</strong>: The post discusses how fiscal sponsorship and operations support can help new nonprofit organizations, especially in the EA community, quickly establish infrastructure and gain access to expertise.</p><p><strong>Key points</strong>:</p><ol><li>Fiscal sponsorship allows leveraging an existing organization's legal status and tax exemption to avoid creating a new entity. This enables faster startup and fundraising.</li><li>Operations support provides part-time access to specialists in areas like finance, HR, and legal. This is often cheaper and more flexible than hiring full-time staff.</li><li>New and small organizations tend to benefit most from fiscal sponsorship and operations support due to fast setup and variable capacity.</li><li>Drawbacks are potentially high fees and some loss of autonomy, especially with fiscal sponsorship.</li><li>Organizations may start with fiscal/operations support and later build internal capacity.</li></ol><p>&nbsp;</p><p>&nbsp;</p><p><i>This comment was auto-generated by the EA Forum Team. Feel free to point out issues with this summary by replying to the comment, and</i><a href=\"https://forum.effectivealtruism.org/contact\"><i>&nbsp;<u>contact us</u></i></a><i> if you have feedback.</i></p>", "parentCommentId": null, "user": {"username": "SummaryBot"}}, {"_id": "HxiFkNLT73Rfihw8N", "postedAt": "2024-02-15T11:16:58.256Z", "postId": "MnecE9Y3SgMTfobCr", "htmlBody": "<p>I can see a bunch of EA orgs (and others) have used these folks:</p>\n<p><a href=\"https://www.ppf.org/\">https://www.ppf.org/</a></p>\n", "parentCommentId": null, "user": {"username": "Rasool"}}, {"_id": "XmQutsD2sdoiBhB78", "postedAt": "2024-03-05T17:31:02.548Z", "postId": "MnecE9Y3SgMTfobCr", "htmlBody": "<p>Fiscal sponsorship and/or operations support go a really long way in bridging the gap between ideation and implementation, especially when the majority of executive directors don't have management experience. I highly support these types of services!</p>", "parentCommentId": null, "user": {"username": "Deena Englander"}}]