[{"_id": "7KnJ2k2u7jg3rjyEs", "postedAt": "2023-11-20T09:36:04.682Z", "postId": "Mo7qnNZA7j4xgyJXq", "htmlBody": "<p>From OpenPhil's $30m to firing Sam, EA helped to create and grow one of the most formidable AI research teams, then handed it over to Clippy!</p>\n", "parentCommentId": null, "user": null}, {"_id": "woMCyTkienJt4i2ir", "postedAt": "2023-11-20T10:14:27.342Z", "postId": "Mo7qnNZA7j4xgyJXq", "htmlBody": "<p>I think this is an overly reductive view of the situation to be honest</p>", "parentCommentId": "7KnJ2k2u7jg3rjyEs", "user": {"username": "JWS"}}, {"_id": "jP2PwuANdBFZYDFkw", "postedAt": "2023-11-20T10:41:45.072Z", "postId": "Mo7qnNZA7j4xgyJXq", "htmlBody": "<p>[Edit: I no longer feel confident about this comment; see thread right below]</p>\n<p>Hm, I don't think Altman looks good here either.</p>\n<p>We have to wait and see how public or the media will react, but to me, this looks like it casts doubts on some things he said previously about his specific motivations for building AGI. It's hard to square that working under Microsoft's leadership (and their need to compete with other companies like Alphabet) is a good environment for making AGI breakthroughs and thinking that it'll likely go really well.</p>\n<p>Although, maybe he's planning to only build specific apps for Microsoft rather than intends to build AGI there? That would seem like an atypical reduction of ambition/scope to me. Or maybe the plan is \"amass more money and talent and then go back to OpenAI if possible, or otherwise start a new AGI thing with more independence from profit-driven structure. That would be more more understandable, but also feels like he'd be being very agentic about this goal in a way that's scary and like I have to trust this one person's judgment about pulling the brakes when it becomes necessary, even though there's now evidence that many people think he's not been cautious enough already recently.</p>\n<p>I guess we have to wait and see.</p>\n", "parentCommentId": null, "user": {"username": "Lukas_Gloor"}}, {"_id": "iWCcveEA8bMvo29bj", "postedAt": "2023-11-20T10:59:23.541Z", "postId": "Mo7qnNZA7j4xgyJXq", "htmlBody": "<p>Perhaps some of his motivation was to keep OpenAI from imploding?</p>", "parentCommentId": "jP2PwuANdBFZYDFkw", "user": {"username": "MathiasKirkBonde"}}, {"_id": "WT5kvS5PESXBdATBd", "postedAt": "2023-11-20T11:09:12.059Z", "postId": "Mo7qnNZA7j4xgyJXq", "htmlBody": "<p>Hm, very good point! I now think that could be his most immediate motivation. Would feel sad to build something and then see it implode (and also the team to be left in limbo). On reflection, that makes me think maybe Sam doesn't necessarily look that bad here. I'm sure Microsoft tried to use their leverage to push for changes, and the OpenAI board stood its ground, so it couldn't have been easy to find a solution that isn't the company falling apart over disagreements and stuff.</p>\n", "parentCommentId": "iWCcveEA8bMvo29bj", "user": {"username": "Lukas_Gloor"}}, {"_id": "ESDPxQQ8kPbSGQmfj", "postedAt": "2023-11-20T15:06:10.305Z", "postId": "Mo7qnNZA7j4xgyJXq", "htmlBody": "<p>One thing I hadn't realised is that Ilya Sutskever signed this open letter as well (and he's on the board!).</p>\n", "parentCommentId": null, "user": {"username": "HenryStanley"}}, {"_id": "hs3gHbLmTSh9gM7WW", "postedAt": "2023-11-20T15:09:05.702Z", "postId": "Mo7qnNZA7j4xgyJXq", "htmlBody": "<p>Oh yes, that is weird. The impression I had was that Ilya might even have been behind Sam's ousting (based on rumours from the internet). I also understood that sacking Sam need 4 out of 6 board members, and since two of the board members were Sam A and Greg B, that meant everyone else had to have voted for him to leave, including Ilya. Most confusing.</p>", "parentCommentId": "ESDPxQQ8kPbSGQmfj", "user": {"username": "Sanjay"}}, {"_id": "5RLu2DGj6Bqprf8s6", "postedAt": "2023-11-20T15:12:24.935Z", "postId": "Mo7qnNZA7j4xgyJXq", "htmlBody": "<p>Sutskever appears to have regrets:</p><p><a href=\"https://twitter.com/ilyasut/status/1726590052392956028\">https://twitter.com/ilyasut/status/1726590052392956028</a></p>", "parentCommentId": "hs3gHbLmTSh9gM7WW", "user": {"username": "Sean_o_h"}}, {"_id": "J3AvBmBp9W3KwsktQ", "postedAt": "2023-11-20T15:24:19.328Z", "postId": "Mo7qnNZA7j4xgyJXq", "htmlBody": "<p>His <a href=\"https://twitter.com/ilyasut/status/1726590052392956028\">recent twitter post</a>:</p><blockquote><p>I deeply regret my participation in the board's actions. I never intended to harm OpenAI. I love everything we've built together and I will do everything I can to reunite the company.</p></blockquote><p>Either he wasn't behind the push, or he was but subsequently decided it was a huge mistake.&nbsp;</p>", "parentCommentId": "hs3gHbLmTSh9gM7WW", "user": {"username": "titotal"}}, {"_id": "hwdnaxJEdZa8AHhpR", "postedAt": "2023-11-20T15:59:44.824Z", "postId": "Mo7qnNZA7j4xgyJXq", "htmlBody": "<p>Is there still anything EA community can do regarding AGI safety if full scale armed race towards AGI is coming soon with OpenAI almost surely been absorbed by Microsoft?</p>\n", "parentCommentId": null, "user": {"username": "newptcai"}}, {"_id": "zKyEhPKFaJ8NYb96S", "postedAt": "2023-11-20T16:00:50.493Z", "postId": "Mo7qnNZA7j4xgyJXq", "htmlBody": "<p>How much credibility dose he still have left by backtracking?</p>\n", "parentCommentId": "5RLu2DGj6Bqprf8s6", "user": {"username": "newptcai"}}, {"_id": "GAojyR69brKdFx245", "postedAt": "2023-11-20T16:08:25.329Z", "postId": "Mo7qnNZA7j4xgyJXq", "htmlBody": "<p>It's bizarre isn't it</p>\n<p>Very much hoping the board makes public some of the reasons behind the decision.</p>\n", "parentCommentId": "hs3gHbLmTSh9gM7WW", "user": {"username": "HenryStanley"}}, {"_id": "L7gCwbDN6oSFtNJCZ", "postedAt": "2023-11-20T17:39:14.663Z", "postId": "Mo7qnNZA7j4xgyJXq", "htmlBody": "<p>Personally, I still think there is a lot of uncertainty around how governments will act. There are at least some promising signs (e.g., UK AI Safety Summit) that governments could intervene to end or substantially limit the race toward AGI. Relatedly, I think there's a lot to be done in terms of communicating AI risks to the public &amp; policymakers, drafting concrete policy proposals, and forming coalitions to get meaningful regulation through.&nbsp;</p><p>Some folks also have hope that internal governance (lab governance) could still be useful. I am not as optimistic here, but I don't want to rule it out entirely.&nbsp;</p><p>There's also some chance that we end up getting more concrete demonstrations of risks. I do not think we should wait for these, and I think there's a sizable chance we do not get them in time, but I think \"have good plans ready to go in case we get a sudden uptick in political will &amp; global understanding of AI risks\" is still important.&nbsp;</p>", "parentCommentId": "hwdnaxJEdZa8AHhpR", "user": {"username": "Akash"}}, {"_id": "4BNa4cDqEsDtkSAw6", "postedAt": "2023-11-20T20:29:48.630Z", "postId": "Mo7qnNZA7j4xgyJXq", "htmlBody": "<p>My guess is that the letter is largely a bluff. I don’t think these people want to work for Microsoft. I’m surprised Altman decided that was his best move vs starting his own company. Perhaps this implies that starting from scratch is not as easy as we think. Microsoft has the license to most (all?) of OpenAIs tech so they would be able to hit the ground running.</p>\n", "parentCommentId": null, "user": {"username": "andrewpei"}}, {"_id": "A7AMC3WwjLsvQ5Ag2", "postedAt": "2023-11-20T21:38:59.359Z", "postId": "Mo7qnNZA7j4xgyJXq", "htmlBody": "<p>I think that trying to get safe concrete demonstrations of risk by doing research seems well worth pursuing (I don't think you were saying it's not).</p>\n", "parentCommentId": "L7gCwbDN6oSFtNJCZ", "user": {"username": "Isaac_Dunn"}}, {"_id": "xgEpE3C8J7aHJ2dxi", "postedAt": "2023-11-20T22:25:30.960Z", "postId": "Mo7qnNZA7j4xgyJXq", "htmlBody": "<p>Too soon to tell I think. Probably better to wait for the dust to settle.&nbsp;</p>", "parentCommentId": "hwdnaxJEdZa8AHhpR", "user": {"username": "Linch"}}, {"_id": "LZK7hpJNB8J6ayvdB", "postedAt": "2023-11-20T22:44:46.312Z", "postId": "Mo7qnNZA7j4xgyJXq", "htmlBody": "<p>(Not that it matters much, but my own guess is that many of the us who are x-risk focused should a) be as cooperative and honest with the public about our concerns &nbsp;with superhuman AI systems as possible, and hope that there's enough time left for the balance of reason to win out, and b) focus on technical projects that don't involve much internal politics.</p><p>Working on cause areas that are less fraught than x-risk also seems like a comparatively good idea, now.</p><p>Organizational politics is both corrupting and not really our (or at least my) strong suit, so best to leave it to others).</p>", "parentCommentId": "xgEpE3C8J7aHJ2dxi", "user": {"username": "Linch"}}, {"_id": "KXWv2zafxRfYkA3Lu", "postedAt": "2023-11-21T02:01:25.845Z", "postId": "Mo7qnNZA7j4xgyJXq", "htmlBody": "<p>Bizarrely, the OpenAI board <a href=\"https://www.theinformation.com/articles/openai-approached-anthropic-about-merger\">proposed a merger</a> with Anthropic.</p>", "parentCommentId": null, "user": {"username": "Yarrow Bouchard"}}, {"_id": "3oKmdLoxXRjPrktxd", "postedAt": "2023-11-21T06:15:05.102Z", "postId": "Mo7qnNZA7j4xgyJXq", "htmlBody": "<p>Well, maybe. <a href=\"https://manifold.markets/DanielFilan/on-feb-1-2024-will-i-believe-that-o?r=RGFuaWVsRmlsYW4\">https://manifold.markets/DanielFilan/on-feb-1-2024-will-i-believe-that-o?r=RGFuaWVsRmlsYW4</a></p>\n", "parentCommentId": "KXWv2zafxRfYkA3Lu", "user": {"username": "DanielFilan"}}, {"_id": "HSMJfvTyTJnivExJr", "postedAt": "2023-11-21T23:15:07.978Z", "postId": "Mo7qnNZA7j4xgyJXq", "htmlBody": "<p>There's a decent history of the board changes in OpenAI here: <a href=\"https://loeber.substack.com/p/a-timeline-of-the-openai-board\">https://loeber.substack.com/p/a-timeline-of-the-openai-board</a></p>\n<p>I think the point that Toner &amp; McCauley are conflicted because of OpenPhil/Holden's connections to Anthropic is a pretty weak argument. But the facts are all verified &amp; pretty basic.</p>\n<p>A number of things stand out:</p>\n<ul>\n<li>lots of turnover</li>\n<li>some turnover for unclear reasons</li>\n<li>Adam D'Angelo has a clear conflict of interest</li>\n</ul>\n<p>I'm also very curious if anyone knows more how McCauley came on the board? And generally more information about her. I hadn't heard of her before and she's apparently an important player now (also in EA as EV UK board member).</p>\n", "parentCommentId": null, "user": {"username": "SiebeRozendal"}}, {"_id": "8oE3tf6aggDnoe8kR", "postedAt": "2023-12-02T21:11:06.122Z", "postId": "Mo7qnNZA7j4xgyJXq", "htmlBody": "<p>It seems that EA tried to \"play politics\" with Sam Altman and OpenAI, by doing things like backing him with EA money and credibility (in exchange for a board seat) without first having high justifiable trust in him, generally refraining from publicly (or even privately, from what I can gather) criticizing Sam and OpenAI, Helen Toner apologizing to Sam/OpenAI for expressing even mild criticism in an academic paper, springing a surprise attack or counterattack on Sam by firing him without giving any warning or chance to justify himself.</p>\n<p>I wonder how much of this course of action was intended / carefully considered, and whether/what parts people still endorse in retrospect. Or more generally, what lessons are people drawing from this whole episode?</p>\n<p>I'm personally unsure whether to update in the direction of \"play politics harder/better\" or \"play politics less and be principled more\" or maybe \"generally be more principled but play politics better when you have to\"? Or even \"EA had a pretty weak hand throughout and played it as well as can be reasonably expected\"? (It sucks that insiders who can best answer these questions are choosing or committed to not talking.)</p>\n", "parentCommentId": null, "user": {"username": "Wei_Dai"}}, {"_id": "CAfNAjLo6Fy3eDwH3", "postedAt": "2023-12-03T01:17:11.352Z", "postId": "Mo7qnNZA7j4xgyJXq", "htmlBody": "<p>EDIT: this is going a bit viral, and it seems like many of the readers have missed key parts of the reporting. I wrote this as a reply to Wei Dai and a high-level summary for people who were already familiar with the details; I didn't write this for people who were unfamiliar, and I'm not going to reference every single claim in it, as I have generally referenced them in my prior comments/tweets and explained the details &amp; inferences there. If you are unaware of aspects like 'Altman was trying to get Toner fired' or pushing out Hoffman or how Slack was involved in Sutskever's flip or why Sutskever flip-flopped back, still think Q* matters, haven't noticed the emphasis put on the promised independent report, haven't read the old <a href=\"https://www.newyorker.com/magazine/2016/10/10/sam-altmans-manifest-destiny\">NYer Altman profile</a> or Labenz's redteam experience etc., it may be helpful to catch up by looking at other sources; my comments have been primarily <a href=\"https://www.lesswrong.com/posts/KXHMCH7wCxrvKsJyn/openai-facts-from-a-weekend?commentId=toNjz7gy4rrCFd99A\">on LW</a> since I'm not a heavy EAF user, plus <a href=\"https://gwern.net/doc/reinforcement-learning/openai/index#links\">my usual excerpts</a>.</p>\n<blockquote>\n<p>Or even \"EA had a pretty weak hand throughout and played it as well as can be reasonably expected\"?</p>\n</blockquote>\n<p>It <em>was</em> a pretty weak hand. There is this pervasive attitude that Sam Altman could have been dispensed with easily by the OA Board if it had been more competent; this strange implicit assumption that Altman is some johnny-come-lately where the Board screwed up by hiring him. Commenters seem to ignore the long history here - if anything, it was he who screwed up by hiring the Board!</p>\n<p>Altman co-founded OA. He was the <a href=\"https://www.vanityfair.com/news/2015/12/sam-altman-elon-musk-openai\">face in initial coverage</a> and 1 of 2 board members (with Musk). He was a major funder of it. Even Elon Musk's main funding of OA was <em>through</em> an Altman vehicle. He kicked out Musk when Musk decided he needed to be in charge of OA. Open Philanthropy (OP) only had that board seat and made a donation because Altman invited them to, and he could personally have covered the $30m or whatever OP donated for the seat; and no one cared or noticed when OP let the arrange lapse after the initial 3 years. (I had to contact OP to confirm this when someone doubted that the seat was no longer controlled by OP.) He thought up, drafted, and oversaw the entire for-profit thing in the first place, including all provisions related to board control. He voted for all the board members, filling it back up from when it was just him (&amp; Greg Brockman at one point IIRC). He then oversaw and drafted all of the contracts with MS and others, while running the for-profit and eschewing equity in the for-profit. He designed the board to be able to fire the CEO because, to quote him, \"the board should be able to fire me\". He interviewed every person OA hired, and used his networks to recruit for OA. And so on and so forth</p>\n<p>Credit where credit is due - Altman may not have believed the scaling hypothesis like Dario Amodei, may not have invented PPO like John Schulman, may not have worked on DL from the start like Ilya Sutskever, may not have created GPT like Alec Radford, may not have written &amp; optimized any code like Brockman's - but the 2023 OA organization is fundamentally his work.</p>\n<p>The question isn't, \"how could EAers* have ever let Altman take over OA and possibly kick them out\", but entirely the opposite: \"how did EAers ever get any control of OA, such that they could even possibly kick out Altman?\" Why was this even a thing given that OA was, to such an extent, an Altman creation?</p>\n<p>The answer is: \"because he gave it to them.\" Altman freely and voluntarily handed it over to them.</p>\n<p>So you have an answer right there to why the Board was willing to assume Altman's good faith for so long, despite everyone clamoring to explain how (in hindsight) it was so obvious that the Board should always have been at war with Altman and regarding him as an evil schemer out to get them. But that's an insane way for them to think! Why would he undermine the Board or try to take it over, when he <em>was</em> the Board at one point, and when <em>he made and designed it in the first place</em>? Why would he be money-hungry when <em>he refused all the equity</em> that he could so easily have taken - and in fact, various partner organizations <em>wanted him to have</em> in order to ensure he had 'skin in the game'? Why would he go out of his way to make the double non-profit with <em>such</em> onerous &amp; unprecedented terms for any investors, which caused a lot of difficulties in getting investment and Microsoft had to think seriously about, if he just didn't genuinely care or believe any of that? Why any of this?</p>\n<p>(None of that was a requirement, or even that useful to OA for-profit. Other double systems like Mozilla or Hershey don't have such terms, they're just normal corporations with a lot of shares owned by a non-profit, is all. OA for-profit could've been the same way. Certainly, if all of this was for PR reasons or some insidious decade-long scheme of Altman to 'greenwash' OA, it was a spectacular failure - nothing has occasioned more confusion and bad PR for OA than the double structure or capped-profit. See, for example, my shortly-before-the-firing Twitter argument with well-known AI researcher Delip Rao who repeatedly stated &amp; doubled down on the claim that the OA non-profit legally owned the OA for-profit was not just factually wrong but <em>misinformation</em>. He helpfully linked to a page about political misinformation &amp; propaganda campaigns online in case I had any doubt about what the term 'misinformation' meant.)</p>\n<p>What happened is, broadly: 'Altman made the OA non/for-profits and gifted most of it to EA with the best of intentions, but then it went so well &amp; was going to make so much money that he had giver's remorse, changed his mind, and tried to quietly take it back; but he had to do it by hook or by crook, because the legal terms said clearly \"no takesie backsies\"'. Altman was all for EA and AI safety and an all-powerful nonprofit board being able to fire him, and was sincere about all that, until OA &amp; the scaling hypothesis succeeded beyond his wildest dreams†, and he discovered it was inconvenient for him and convinced himself that the noble mission now required him to be in absolute control, never mind what restraints on himself he set up years ago - he now understands how well-intentioned but misguided he was and how he should have trusted himself more. (Insert <em>Garfield</em> meme here.)</p>\n<p>No wonder the board found it hard to believe! No wonder it took so long to realize Altman had flipped on them, and it seemed Sutskever needed <a href=\"https://archive.is/B21BJ#selection-1017.0-1020.0\">Slack screenshots showing Altman blatantly lying </a> to them about Toner before he finally, reluctantly, flipped. The Altman you need to distrust &amp; assume bad faith of &amp; need to be paranoid about stealing your power is also usually an Altman who never gave you any power in the first place! I'm still kinda baffled by it, personally.</p>\n<p>He concealed this change of heart from everyone, including the board, gradually began trying to unwind it, overplayed his hand at one point - and here we are.</p>\n<p>So, what could the EA faction of the board have done? ...Not much, really. They only ever had the power that Altman gave them in the first place.</p>\n<p>* I don't really agree with this framing of Sutskever/Toner/McCauley/D'Angelo as \"EA\", but for the sake of argument, I'll go with this labeling.<br>\n† Please try to cast your mind back to when Altman et al would be planning all this in 2018-2019, with OA rapidly running out of cash after the <a href=\"https://gwern.net/note/musk\">mercurial</a> Musk's unexpected-but-inevitable betrayal, its DRL projects like OA5 remarkable research successes but commercially worthless, and just some interesting results like GPT-1 and then GPT-2-small coming out of their unsupervised learning backwater from Alec Radford tinkering around with RNNs and then these new 'Transformer' things. The idea that OA might somehow be worth <em>over ninety billion dollars, yes, that's 'billion' with a 'b'</em> in scarcely 3 years would have been insane, absolutely insane, not a single person in the AI world would have taken you seriously if you had suggested that and if you emailed any of them asking about how plausible that was, they would have added an email filter to send your future emails to the trash bin. It is very easy to be sincerely full of the best intentions and discuss how to structure your double corporation to deal with windfalls like growing to a $1000b market cap when no one really expects that to happen, certainly not in the immediate future... Thus, no one is also sitting around going, 'well wait, we required the board to not own equity, but if the company is worth even fraction of our long-term targets, and it's recruiting with stock options like usual, then each employee is going to have, like, $10m or even $100m of pseudo-equity in the OA for-profit. That seems... problematic. Do we need to do something about it?'</p>\n", "parentCommentId": "8oE3tf6aggDnoe8kR", "user": {"username": "gwern"}}, {"_id": "NsM5qHueBbS6xNHx9", "postedAt": "2023-12-03T16:54:38.936Z", "postId": "Mo7qnNZA7j4xgyJXq", "htmlBody": "<p>Thanks, I didn't know some of this history.</p>\n<blockquote>\n<p>The Altman you need to distrust &amp; assume bad faith of &amp; need to be paranoid about stealing your power is also usually an Altman who never gave you any power in the first place! I’m still kinda baffled by it, personally.</p>\n</blockquote>\n<p>Two explanations come to my mind:</p>\n<ol>\n<li>Past Sam Altman didn't trust his future self, and wanted to use the OpenAI governance structure to constrain himself.</li>\n<li><a href=\"https://forum.effectivealtruism.org/posts/YKidYukDhKLBtDqsh/doing-good-effectively-is-unusual?commentId=pSgt9prE95CaQrQCL\">His status game / reward gradient changed</a> (at least subjectively from his perspective). At the time it was higher status to give EA more power / appear more safety-conscious, and now it's higher status to take it back / race faster for AGI. (I note there was internal OpenAI discussion about wanting to disassociate with EA after the FTX debacle.)</li>\n</ol>\n<p>Both of reasons these probably played some causal role in what happened, but may well have been subconscious considerations. (Also entirely possible that he changed his mind in part for what we'd consider fair reasons.)</p>\n<blockquote>\n<p>So, what could the EA faction of the board have done? …Not much, really. They only ever had the power that Altman gave them in the first place.</p>\n</blockquote>\n<p>Some ideas for what they could have done:</p>\n<ol start=\"0\">\n<li>Reasoned about why Altman gave them power in the first place. Maybe come up with hypotheses 1 and 2 above (or others) earlier in the course of events. Try to test these hypotheses when possible and use them to inform decision making.</li>\n<li>If they thought 1 was likely, they could have talked to Sam about it explicitly at an early date, asked for more power or failsafes, got more/better experts (at corporate politics) to advise them, monitored Sam more closely, developed preparations/plans for the possible future fight. Asked Sam to publicly talk about how he didn't trust himself, so that the public would be more sympathetic to the board when the time comes.</li>\n<li>If 2 seemed likely, tried to manage Altman's status (or reward in general) gradient better. For example, gave prominent speeches / op-eds highlighting AI x-risk and OpenAI's commitment to safety. Asked/forced Sam to frequently do the same thing. Managed risk better so that FTX didn't happen.</li>\n<li>Not back Sam in the first place so they could criticize/constrain him from the outside (e.g. by painting him/OpenAI as insufficiently safety-focused and pushing harder for government regulations). Or made it an explicit and public condition of backing him that EA (including the board members) were allowed to criticize and try to constrain OpenAI, and frequently remind the public of this condition, in part by actually doing this.</li>\n<li>Made it OpenAI policy that past and present employees are allowed/encouraged to publicly criticize OpenAI, so that for example the public would be aware of why the previous employee exodus (to Anthropic) happened.</li>\n</ol>\n", "parentCommentId": "CAfNAjLo6Fy3eDwH3", "user": {"username": "Wei_Dai"}}, {"_id": "LwRRAdqZg3BufKonF", "postedAt": "2023-12-03T17:27:30.508Z", "postId": "Mo7qnNZA7j4xgyJXq", "htmlBody": "<p>Nitpicks:</p>\n<ol>\n<li>I think Dario and others would've also been involved in setting up the corporate structure</li>\n<li>Sam never gave the \"doomer\" faction a near majority. That only happened because 2-3 \"non-doomers\" left and Ilya flipped.</li>\n</ol>\n", "parentCommentId": "CAfNAjLo6Fy3eDwH3", "user": {"username": "RyanCarey"}}, {"_id": "L84zpc7dHzsmoWrbH", "postedAt": "2023-12-03T19:32:02.319Z", "postId": "Mo7qnNZA7j4xgyJXq", "htmlBody": "<blockquote><p>Two explanations come to my mind:</p><ol><li>Past Sam Altman didn't trust his future self, and wanted to use the OpenAI governance structure to constrain himself.</li><li><a href=\"https://forum.effectivealtruism.org/posts/YKidYukDhKLBtDqsh/doing-good-effectively-is-unusual?commentId=pSgt9prE95CaQrQCL\">His status game / reward gradient changed</a> (at least subjectively from his perspective). At the time it was higher status to give EA more power / appear more safety-conscious, and now it's higher status to take it back / race faster for AGI. (I note there was internal OpenAI discussion about wanting to disassociate with EA after the FTX debacle.)</li></ol></blockquote><ol><li>I think it's reasonable to think that \"Constraining Sam in the future\" was obviously a highly pareto-efficient deal. EA had every reason to want Sam constrained in the future. Sam had every reason to make that trade, gaining needed power in the short-term, in exchange for more accountability and oversight in the future.&nbsp;<br>This is clearly a sensible trade that actual good guys would make; not \"Sam didn't trust his future self\" but rather \"Sam had every reason to agree to sell off his future autonomy in exchange for cooperation and trust in the near term\".</li><li>I think \"the world changing around Sam and EA, rather than Sam or EA changing\" is worth more nuance. I think that, over the last 5 years, the world changed to make groups of humans vastly more vulnerable than before, due to <a href=\"https://www.lesswrong.com/posts/LdEwDn5veAckEemi4/we-are-already-in-a-persuasion-transformed-world-and-must\">new AI capabilities facilitating general-purpose human manipulation</a> and <a href=\"https://www.lesswrong.com/posts/jyAerr8txxhiKnxwA/5-reasons-why-governments-militaries-already-want-ai-for\">the world's power players investing in those capabilities</a>.&nbsp;<br>This dramatically increased the risk of outsider third parties creating or exploiting divisions in the AI safety community, to turn people against each other and use the chaos as a ladder. Given that this risk was escalating, then centralizing power was clearly the correct move in response.<br><a href=\"https://www.lesswrong.com/posts/aW288uWABwTruBmgF/ea-vegan-advocacy-is-not-truthseeking-and-it-s-everyone-s-1?commentId=HqCzEmw4hG8PEBSN4\">I've</a> <a href=\"https://www.lesswrong.com/posts/px76zCyJDidizxT5t/elon-musk-announces-xai?commentId=DJKzTM6rSSq4yis77\">been</a> <a href=\"https://www.lesswrong.com/posts/AggYFFvFHfh2WWZiv/?commentId=PJbhqwSGv7ZnCNDYY\">warning</a> <a href=\"https://www.lesswrong.com/posts/aW288uWABwTruBmgF/ea-vegan-advocacy-is-not-truthseeking-and-it-s-everyone-s-1?commentId=nogjhap9Bq6AnSwhX\">about</a> <a href=\"https://www.lesswrong.com/posts/AggYFFvFHfh2WWZiv/closing-notes-on-nonlinear-investigation?commentId=qw5LBiGyATThYuJsz\">this</a> <a href=\"https://www.lesswrong.com/posts/AggYFFvFHfh2WWZiv/closing-notes-on-nonlinear-investigation?commentId=qw5LBiGyATThYuJsz\">during</a> <a href=\"https://www.lesswrong.com/posts/AggYFFvFHfh2WWZiv/closing-notes-on-nonlinear-investigation?commentId=qw5LBiGyATThYuJsz\">the</a> <a href=\"https://www.lesswrong.com/posts/AggYFFvFHfh2WWZiv/closing-notes-on-nonlinear-investigation#e8PhzMxNJwHNNStRy:~:text=There%27s%20also%20issues,safety%20movement%20itself.\">months</a> before the OpenAI conflict started, in <a href=\"https://www.lesswrong.com/posts/mjSjPHCtbK6TA5tfW/?commentId=FEXukEhn6GhYvkHhN#:~:text=I%20don%27t%20have%20much,employment%2C%20with%20intelligence%20agencies\">the </a><a href=\"https://www.lesswrong.com/posts/jyAerr8txxhiKnxwA/5-reasons-why-governments-militaries-already-want-ai-for#:~:text=Furthermore%2C%20if%20you,hasn%27t%20held%20up\">preceeding</a> <a href=\"https://www.lesswrong.com/posts/mjSjPHCtbK6TA5tfW/ai-safety-is-dropping-the-ball-on-clown-attacks-and-mind#AI_pause_as_the_turning_point:~:text=the%20AI%20safety%20community%20must%20acknowledge%20the%20risk%20that%20the%202020s%20will%20be%20intensely%20dominated%20by%20actors%20capable%20of%20using%20modern%20technology%20to%20stealthily%20hack%20the%20human%20mind%20and%20eliminate%20inconvenient%20people%2C%20such%20as%20those%20try%20to%20pause%20AI%2C%20even%20though%20AI%20is%20basically%20the%20keys%20to%20their%20kingdom\">weeks</a> (including <a href=\"https://www.lesswrong.com/posts/LdEwDn5veAckEemi4/we-are-already-in-a-persuasion-transformed-world-and-must#:~:text=Thus%2C%20you%20should,something%20like%20zero\">the concept of an annual discount rate</a> for each person, based on the risk of that person becoming cognitively compromised and weaponized against the AI safety community), and I even described the risk of one of the big tech companies hijacking Anthropic <a href=\"https://www.lesswrong.com/posts/F7sp7rQg3zfD4totA/helpful-examples-to-get-a-sense-of-modern-automated#:~:text=Attackers%20trying%20to,AI%20safety%20community.\">5</a> <a href=\"https://www.lesswrong.com/posts/F7sp7rQg3zfD4totA/helpful-examples-to-get-a-sense-of-modern-automated#:~:text=Top%20Amazon%20engineers%20and%20executives,in%20the%20AI%20safety%20community\">days</a> before Sam Altman was dismissed. I think it's possible that Sam or people in EA also noticed the world rapidly becoming less safe for AI safety orgs, discovering the threat from a different angle than I did.</li></ol>", "parentCommentId": "NsM5qHueBbS6xNHx9", "user": {"username": "trevorw96"}}, {"_id": "9hxHhCmfuiDJwogfw", "postedAt": "2023-12-03T20:08:23.636Z", "postId": "Mo7qnNZA7j4xgyJXq", "htmlBody": "<p>Re 2: It's plausible, but I'm not sure that this is true. Points against:</p><ol><li><a href=\"https://en.wikipedia.org/wiki/Reid_Hoffman\">Reid Hoffman</a> was reported as being specifically pushed out by Altman: <a href=\"https://www.semafor.com/article/11/19/2023/reid-hoffman-was-privately-unhappy-about-leaving-openais-board\">https://www.semafor.com/article/11/19/2023/reid-hoffman-was-privately-unhappy-about-leaving-openais-board</a>&nbsp;</li><li><a href=\"https://en.wikipedia.org/wiki/Will_Hurd\">Will Hurd </a>is plausibly quite concerned about AI Risk<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefnzllngvliia\"><sup><a href=\"#fnnzllngvliia\">[1]</a></sup></span>. It's hard to know for sure because his campaign website is <a href=\"https://www.willbhurd.com/artificial-intelligence/\">framed in the language </a>of US-China competition (and has unfortunate-by-my-lights suggestions like \"Equip the Military and Intelligence Community with Advanced AI\"), but I think a lot of the proposed policies are relevant to AI risk.&nbsp;</li><li><a href=\"https://en.wikipedia.org/wiki/Shivon_Zilis\">Shivon Zilis</a> left OpenAI allegedly because she had Elon Musk's children and this was seen as a COI<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnref0gjb9sxgvsmm\"><sup><a href=\"#fn0gjb9sxgvsmm\">[2]</a></sup></span>. To the extent that there's bad blood still between Altman and Musk, if instead of framing the board's decisions are \"doomer\" vs \"non-doomer\", we frame it as as \"skeptical of giving Sam free rein\" and \"fine with letting Sam do whatever\", there's a reasonable case that Zilis agrees with Musk enough that she would not side with the pro-Sam faction.</li></ol><p>(EDIT 2023/12/04: Changed wording to be slightly more precise and slightly less strong) So there's at least some evidence that any or all of Hoffman/Hurd/Zilis (the 3 board members that left recently) would've opposed Sam trying to ouster Toner. Far from certain, but I'd currently say<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefms0w2kjot0a\"><sup><a href=\"#fnms0w2kjot0a\">[3]</a></sup></span>&nbsp;&gt;50% (EDIT: that at least one of them would be opposed). Especially if it turns out that one or all of them were themselves pushed out by Altman and they started sharing notes. Of course, ousting Altman in retaliation is a pretty big move, and the more politically savvy ones might've found a better compromise solution.</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnnzllngvliia\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefnzllngvliia\">^</a></strong></sup></span><div class=\"footnote-content\"><p>His wikipedia page says \"On September 20, 2023, Hurd unveiled a detailed plan for how he would regulate AI if elected President, comparing AI to nuclear fusion, and proposing creating a branch of the executive to deal solely and directly on the issue of AI, and proposing strict regulations on civilian AI usage.\" The last one in particular doesn't sound necessarily conducive to OpenAI/Microsoft's advanced AI ambitions.</p></div></li><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fn0gjb9sxgvsmm\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnref0gjb9sxgvsmm\">^</a></strong></sup></span><div class=\"footnote-content\"><p>Convoluted wording because of \"executives claimed that they were born via <a href=\"https://en.wikipedia.org/wiki/In_vitro_fertilization\">in vitro fertilization</a> (IVF).\"</p></div></li><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnms0w2kjot0a\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefms0w2kjot0a\">^</a></strong></sup></span><div class=\"footnote-content\"><p>Of course, this counterfactual is hard to verify. The Twitter backlash + OAI revolt probably means people would be hesitant to be publicly pro-Toner, now.</p></div></li></ol>", "parentCommentId": "LwRRAdqZg3BufKonF", "user": {"username": "Linch"}}, {"_id": "psjopyj7zHG8RB9XM", "postedAt": "2023-12-04T00:41:38.669Z", "postId": "Mo7qnNZA7j4xgyJXq", "htmlBody": "<ol>\n<li>\n<p>I haven't seen any coverage of the double structure or Anthropic exit which suggests that Amodei helped think up or write the double structure. Certainly, the language they use around the Anthropic public benefit corporation indicates they all think, at least post-exit, that the OA double structure was a terrible idea (eg. see the end <a href=\"https://www.wired.com/story/openai-bizarre-structure-4-people-the-power-to-fire-sam-altman/\">of this article</a>).</p>\n</li>\n<li>\n<p>You don't know that. They seem to have often had near majorities, rather than being a token 1 or 2 board members.</p>\n<p>By most standards, Karnofsky and Sutskever are 'doomers', and Zillis is likely a 'doomer' too as that is the whole premise of Neuralink and she was a Musk representative (which is why she was <a href=\"https://www.semafor.com/article/03/24/2023/the-secret-history-of-elon-musk-sam-altman-and-openai\">pushed out after Musk turned on OA publicly</a> and began active hostilities like breaking contracts with OA). Hoffman's views are hard to characterize, but he doesn't seem to clearly come down as an <em>anti</em>-doomer or to be an Altman loyalist. (Which would be a good enough reason for Altman to push him out; and for a charismatic leader, neutralizing a co-founder is always useful, for the same reason no one would sell life insurance to an Old Bolshevik in Stalinist Russia.)</p>\n<p>If I look at the <a href=\"https://loeber.substack.com/p/a-timeline-of-the-openai-board\">best timeline of the board composition</a> I've seen thus far, at a number of times post-2018, it looks like there was a 'near majority' or even outright majority. For example, 2020-12-31 has either a tie or an outright majority for either side depending on how you assume Sutskever &amp; Hoffman (Sutskever?/Zilis/Karnofsky/D'Angelo/McCauley vs Hoffman? vs Altman/Brockman), and with the 2021-12-31 list the Altman faction needs to pick up every possible vote to match the existing 5 'EA' faction (Zilis/Karnofsky/D'Angelo/McCauley/Toner vs Hurd?/Sutskever?/Hoffman? vs Brockman/Altman) although this has to be wrong because the board maxes out at 7 according to the bylaws so it's unclear how exactly the plausible majorities evolved over time.</p>\n</li>\n</ol>\n", "parentCommentId": "LwRRAdqZg3BufKonF", "user": {"username": "gwern"}}, {"_id": "gsyFKSW8ezLp9kJ7G", "postedAt": "2023-12-04T02:38:05.099Z", "postId": "Mo7qnNZA7j4xgyJXq", "htmlBody": "<ol start=\"2\">\n<li>The main thing that I doubt is that Sam knew at the time that he was gifting the board to doomers. Ilya was a loyalist and non-doomer when appointed. Elon was I guess some mix of doomer and loyalist at the start. Given how AIS worries generally increased in SV circles over time, more likely than not some of D'Angelo, Hoffman, and Hurd moved toward the \"doomer\" pole over time.</li>\n</ol>\n", "parentCommentId": "psjopyj7zHG8RB9XM", "user": {"username": "RyanCarey"}}, {"_id": "4Q9vEz3kvys6Zzgbb", "postedAt": "2023-12-04T04:59:13.366Z", "postId": "Mo7qnNZA7j4xgyJXq", "htmlBody": "<p>I am reasonably confident Helen replaced Holden as a board member, so I don't think your 2021-12-31 list is accurate. Maybe there was a very short period where they were both on the board, but I heard the intention was for Helen to replace Holden.</p>", "parentCommentId": "psjopyj7zHG8RB9XM", "user": {"username": "Habryka"}}, {"_id": "LqFwsqAS7hCXAyzdC", "postedAt": "2023-12-04T15:16:43.535Z", "postId": "Mo7qnNZA7j4xgyJXq", "htmlBody": "<p>Ilya has always been a doomer AFAICT, he was just loyal to Altman personally, who recruited him to OA. (I can tell you that when I spent a few hours chatting with him in... 2017 or something? a very long time ago, anyway - I don't remember him dismissing the dangers or being pollyannaish.) 'Superalignment' didn't come out of nowhere or surprise anyone about Ilya being in charge. Elon was... not loyal to Altman but appeared content to largely leave oversight of OA to Altman until he had one of his characteristic mood changes, got frustrated and tried to take over. In any case, he surely counts as a doomer by the time Zilis is being added to the board as his proxy. D'Angelo likewise seems to have consistently, in his few public quotes, been concerned about the danger.</p>\n<p>A lot of people have indeed moved towards the 'doomer' pole but much of that has been <em>timelines</em>: AI doom in 2060 looks and feels a lot different from AI doom in 2027.</p>\n", "parentCommentId": "gsyFKSW8ezLp9kJ7G", "user": {"username": "gwern"}}, {"_id": "ASqWPAFP7pA9Wj2eR", "postedAt": "2023-12-04T16:48:15.970Z", "postId": "Mo7qnNZA7j4xgyJXq", "htmlBody": "<p>Hmm, OK. Back when I met Ilya, about 2018, he was radiating excitement that his next idea would create AGI, and didn't seem sensitive to safety worries. I also thought it was \"common knowledge\" that his interest in safety increased substantially between 2018-22, and that's why I was unsurprised to see him in charge of superalignment.</p><p>Re Elon-Zillis, all I'm saying is that it looked to Sam like the seat would belong to someone loyal to him <i>at the time the seat was created</i>.</p><p>You may well be right about D'Angelo and the others.</p>", "parentCommentId": "LqFwsqAS7hCXAyzdC", "user": {"username": "RyanCarey"}}, {"_id": "QCsq8aLv8J3XiK7yJ", "postedAt": "2023-12-04T21:36:16.236Z", "postId": "Mo7qnNZA7j4xgyJXq", "htmlBody": "<p>Hm, maybe it was common knowledge in some areas? I just always took him for being concerned. There's not really any contradiction between being excited about your short-term work and worried about long-term risks. Fooling yourself about your current idea is an important skill for a researcher. (You ever hear the joke about Geoff Hinton? He suddenly solves how the brain works, at long last, and euphorically tells his daughter; she replies: \"Oh Dad - not again!\")</p>\n", "parentCommentId": "ASqWPAFP7pA9Wj2eR", "user": {"username": "gwern"}}, {"_id": "qBKhumFtxztBZtWWF", "postedAt": "2023-12-04T21:52:06.722Z", "postId": "Mo7qnNZA7j4xgyJXq", "htmlBody": "<p>Just judging from his Twitter feed, I got the weak impression D'Angelo is somewhat enthusiastic about AI and didn't catch any concerns about existential safety.</p>\n", "parentCommentId": "LqFwsqAS7hCXAyzdC", "user": {"username": "Nick K."}}, {"_id": "zmKC837bP2DFEvr6d", "postedAt": "2023-12-05T16:56:37.326Z", "postId": "Mo7qnNZA7j4xgyJXq", "htmlBody": "<blockquote><p>it seemed Sutskever needed <a href=\"https://archive.is/B21BJ#selection-1017.0-1020.0\">Slack screenshots showing Altman blatantly lying </a>to them about Toner</p></blockquote><p>I checked the WSJ article linked to in this excerpt and I checked your comments on LessWrong, but I couldn't find any mention of Ilya Sutskever seeing Slack screenshots that showed Sam Altman lying. Would you mind clarifying?&nbsp;</p><p>Please forgive me if you're already covered this elsewhere.</p>", "parentCommentId": "CAfNAjLo6Fy3eDwH3", "user": {"username": "Yarrow Bouchard"}}, {"_id": "5F2zEpXJ2wt7raa43", "postedAt": "2023-12-05T17:04:42.671Z", "postId": "Mo7qnNZA7j4xgyJXq", "htmlBody": "<p>That was covered in my <a href=\"https://www.lesswrong.com/posts/KXHMCH7wCxrvKsJyn/openai-facts-from-a-weekend?commentId=3cj6qhSRt4HoBLpC7\">2023-11-25 comment</a>.</p>\n", "parentCommentId": "zmKC837bP2DFEvr6d", "user": {"username": "gwern"}}, {"_id": "GnuhpfgSTzwYHLmcq", "postedAt": "2023-12-07T00:46:43.218Z", "postId": "Mo7qnNZA7j4xgyJXq", "htmlBody": "<p>Another possibility is that Sam came to see EA as an incredibly flawed movement, to the point where he wanted EAs like Toner off his board, and just hasn't elaborated the details of his view publicly.  See <a href=\"https://nitter.net/sama/status/1593046526284410880\">these tweets</a> from 2022 for example.</p>\n<p>I think Sam is corrupted by self-interest and that's the primary explanation here, but I actually agree that EA is pretty flawed.  (Better than the competition, but still pretty flawed.)  As a specific issue OpenAI might have with EA, I notice that EA seems significantly more interested in condemning OpenAI publicly than critiquing the technical details of their alignment plans.  It seems like EAs historically either want to suck up to OpenAI or condemn them, without a lot of detailed technical engagement in between.</p>\n", "parentCommentId": "CAfNAjLo6Fy3eDwH3", "user": {"username": "chinscratch"}}, {"_id": "BAv5T5npzaPwAqp2Z", "postedAt": "2023-12-05T19:20:27.255Z", "postId": "Mo7qnNZA7j4xgyJXq", "htmlBody": null, "parentCommentId": "CAfNAjLo6Fy3eDwH3", "user": null}]