[{"_id": "zFJrbxMtnmF9z84aC", "postedAt": "2023-12-01T14:17:49.314Z", "postId": "MoKKqzvjXfYYDmddg", "htmlBody": "<p>But what about the other way around? It is far better if jobs move from the rich to the poor world. Online Kenyan administratives for UK and US firms, Peruans for Spanish firms, etc...&nbsp;</p><p>The most consequential effect of the pandemics has been that it was a demo of how easily many service jobs can be performed online, and that allows for \"online migration\". Workers can stay at home enjoying their very cheap local cost of life while getting higher foreing wages.</p><p>&nbsp;Labour and goods and capital migrations have similar economics effects, but goods and capital movements do not create the same political resistance.</p>", "parentCommentId": null, "user": {"username": "Arturo Macias"}}, {"_id": "MBi23rysaYWN9gzpa", "postedAt": "2023-12-01T20:28:43.404Z", "postId": "MoKKqzvjXfYYDmddg", "htmlBody": "<ol><li>I think both of these trends can occur simultaneously</li><li>I'm not sure it's very helpful to think of this as \"jobs moving from one country to another\". It makes it seem zero-sum, whereas it is actually a positive-sum efficiency gain</li><li>Migrants to higher-income countries benefit from public goods like better services and public safety in addition to higher incomes</li><li>As Lant has pointed out, the higher income someone gains from moving from a low- to high-income country is enormous. IIRC it can be something like a 10x increase in consumption even if they're working the same job. So even if we imagine some fixed pool of jobs, I'm not sure it is \"far better\" for jobs to move from high- to low-income countries. Given the choice of working the same job in a high-income or a low-income country, I think many people would choose to move to the high-income country.</li></ol>", "parentCommentId": "zFJrbxMtnmF9z84aC", "user": {"username": "Stephen Clare"}}, {"_id": "KHDCK9gvE28dHMcsx", "postedAt": "2023-12-01T20:47:00.159Z", "postId": "MoKKqzvjXfYYDmddg", "htmlBody": "<p>As an example of how powerful these demographic shifts will be, <a href=\"https://www.sas.upenn.edu/~jesusfv/Wealth_Working_Nations.pdf\">this recent paper</a> claims that <i>~all</i> of Japan's poor economic performance relative to other developed nations since the '90s can be explained by its demographic shift (specifically the decline in the population share of working age adults). Think about how much consternation there has been about Japan's slow growth. We're all headed that way.</p><p>Interestingly, AFAIK Japan has not drastically liberalized its immigration much in response to its slow growth. The proportion of foreign-born residents has grown <a href=\"https://www.statista.com/statistics/882722/japan-foreign-residents-rate/\">a bit</a>, but not much. <a href=\"https://www.asiapacific.ca/publication/japan-needs-more-labour-immigration-answer\">Maybe this is changing</a>, but we'll see if anything actually happens, and Japan has been struggling to grow for decades.</p><figure class=\"image\"><img src=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/KHDCK9gvE28dHMcsx/z5lbyqkbjhk89fv2mtna\" srcset=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/KHDCK9gvE28dHMcsx/bomxy9tvkpq4dszeerbg 160w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/KHDCK9gvE28dHMcsx/xm5pj7kpfsxxiwmgoiy7 320w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/KHDCK9gvE28dHMcsx/kvbphmcc9wdl2rvs3jsq 480w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/KHDCK9gvE28dHMcsx/efs5gc95qsvdebhbnhyh 640w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/KHDCK9gvE28dHMcsx/hkw1farnuyfywqlf4bh6 800w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/KHDCK9gvE28dHMcsx/uptqmncueqhxmlwkaoyz 960w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/KHDCK9gvE28dHMcsx/wo5g43tgswxk2stfjuzp 1120w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/KHDCK9gvE28dHMcsx/m3so8d2besqtpryziwj8 1280w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/KHDCK9gvE28dHMcsx/wtn1ieytl0l7hvlsiumt 1440w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/KHDCK9gvE28dHMcsx/s7onczebilpc8jhkj1qs 1578w\"></figure>", "parentCommentId": null, "user": {"username": "Stephen Clare"}}, {"_id": "5tBcjD6N2Sx8yG78h", "postedAt": "2023-12-02T07:49:02.449Z", "postId": "MoKKqzvjXfYYDmddg", "htmlBody": "<p>A 10x increase in consumption doesn't pass the sniff test, and indeed migrants to the US earn on average 2x more than before they migrated, 3x if they come from very poorest countries. (<a href=\"https://drive.google.com/open?id=0B-K7aWdWI-57N1NYQWdTUTlhd3c\">source</a>, table 2)</p>\n", "parentCommentId": "MBi23rysaYWN9gzpa", "user": {"username": "therealslimkt"}}, {"_id": "RAjWycgeL6CMqqq44", "postedAt": "2023-12-02T09:22:21.894Z", "postId": "MoKKqzvjXfYYDmddg", "htmlBody": "<p>If we're talking about the need for more workers on timelines of <i>decades</i>, advancements in AI and automation will be relevant. Will immigrants be necessary in decades?</p><p>Also, <a href=\"https://ourworldindata.org/grapher/fertility-rate-with-projections\">fertility rates are falling pretty quickly globally</a>, so immigration might only help so much for so long on its own.</p>", "parentCommentId": null, "user": {"username": "MichaelStJules"}}, {"_id": "hHKTvCbo5dMofNspt", "postedAt": "2023-12-02T17:37:17.298Z", "postId": "MoKKqzvjXfYYDmddg", "htmlBody": "<p>Interesting, thanks for checking that!</p><p>What I had in mind were the data from <a href=\"https://www.cgdev.org/sites/default/files/alleviating-global-poverty-labor-mobility-direct-assistance-and-economic-growth.pdf\">this Pritchett paper</a>. He sets out a range of estimates depending on what exactly you measure. For example he shows that the US wage for construction work is 10x the median of the poorest 30 countries (p. 5). The income gains for a low skill worker moving to the US vary depending on where they're coming from, but range from 2.4x (Thailand) to 16x (Nigeria) (p. 4).</p><p>That's pretty different than the paper you cite. I'm not sure what accounts for that right now. Hopefully we see more work in this area!</p>", "parentCommentId": "5tBcjD6N2Sx8yG78h", "user": {"username": "Stephen Clare"}}, {"_id": "x4szPL6FYAkvYHkk2", "postedAt": "2023-12-02T17:47:05.151Z", "postId": "MoKKqzvjXfYYDmddg", "htmlBody": "<p>Yeah the discrepancy comes from assuming that immigrants in a category would earn the same as natives in that category. The first problem is that there's substantial occupational downgrading; immigrants almost always work in lower-paid occupations than their pre-migration occupation. The second problem is that even within the same occupation, immigrants tend to have lower wages than natives (although they also have faster wage growth).</p>\n<p>The Hendricks and Schoellman paper, in contrast, focuses on getting immigrants to the US to report their own wages before and after migration - so I think it's a better reference on the wage gains from migration than comparing average wages.</p>\n", "parentCommentId": "hHKTvCbo5dMofNspt", "user": {"username": "therealslimkt"}}, {"_id": "doZ5qnq2QgokNN3Nt", "postedAt": "2023-12-02T21:44:44.155Z", "postId": "MoKKqzvjXfYYDmddg", "htmlBody": "<p>But the pool of jobs is not fixed at all! Globalization show how easily is moving jobs to poor countries and how strong is resistance to immigration. Inmigrant communities often become traditionalists or end up in ghettoes in the receiving countries, while development in poor countries beguings a chain &nbsp;chain reaction of social emacipation.</p><p>What is the great welfare story of the late XXth century? Export oriented development. Mass inmigration is not so brigth... New technology allow for export oriented development in a substantial part of the services sector of the West.&nbsp;</p>", "parentCommentId": "MBi23rysaYWN9gzpa", "user": {"username": "Arturo Macias"}}]