[{"_id": "YH9kmTRK7kKtYu4g2", "postedAt": "2018-05-02T08:22:39.073Z", "postId": "MQWAsdm8MSzYNkD9X", "htmlBody": "<p>Awesome, thanks a lot for this work!</p>\n<p>From what I understood when talking to CEA staff, this is also thought to replace handing out copies of Doing Good Better, yes? If so, I would emphasise this more explicitly, too.</p>\n", "parentCommentId": null, "user": {"username": "konrad"}}, {"_id": "xHmpuhhs5KBpbG8uD", "postedAt": "2018-05-02T09:15:11.026Z", "postId": "MQWAsdm8MSzYNkD9X", "htmlBody": "<p>Thanks. How is it licensed? Under what conditions is it possible to share copies or translate (parts of) it?</p>\n", "parentCommentId": null, "user": {"username": "Jiri_Nadvornik"}}, {"_id": "LRhz9ZAPWySLXRHgw", "postedAt": "2018-05-02T12:33:27.713Z", "postId": "MQWAsdm8MSzYNkD9X", "htmlBody": "<p>If i could only recommend one book to someone should i recommend this or Doing Good Better? Not really sure about that. What do you think?</p>\n", "parentCommentId": null, "user": {"username": "Yannick_Muehlhaeuser"}}, {"_id": "erDxCubqQmT8Pyzsg", "postedAt": "2018-05-02T13:21:50.406Z", "postId": "MQWAsdm8MSzYNkD9X", "htmlBody": "<p>A few quick comments, have skimmed through rather than a read in depth (have read a number of the articles in the past):</p>\n<ol>\n<li>There's a format error on p.167- Under 1. Learn more, there is a spacing error in the paragraph, which bizarrely cuts the paragraph in two for no reason. [Edit: this is not a lone error, I've found another on p.142, there may well be others, I haven't gone through exhaustively]</li>\n<li>I'd be interested how the relevant cause areas were agreed upon? There's a heavy emphasis on Artificial Intelligence and the Long-Run Future (three articles on AI); and some areas of interest to EAers get very little or no mention at all (e.g. Mental Health and Happiness, re Michael Plant [EDIT: there is some mention of this, but there's still at least a good question here about how cause areas are decided]). Perhaps there's also a lack of concentration on cause areas versus career paths (and the Gov. article is great but extremely America heavy, which is not helpful for non-Americans). I suspect there is more to be said as to how this is decided, but it would be useful to understand this.</li>\n<li>The recommendation of different books at the end is interesting- given the heavy emphasis on the long term-future throughout, it seems to me that the recommended books diverge from that (Doing Good Better and the Most Good You Can Do aren't hugely about that from my memory?) Would it have been better to recommend SuperIntelligence; or the Global Catastrophic Risks volume which came out a while back; or something else, if the Long-Term Future dominates the attention elsewhere?</li>\n<li>One worry I have is that it does a lot to suggest possibel directions for EAers, and little to deal with objections EAers might face. The original handbook seems to have slightly more on that (e.g. the Estimation article from Katja; Holden's article on White's in shining armour); and there are other ones which regularly arise e.g. the collectivist/coordination ideas that Hilary Greaves has been talking about (no individual can ever make a difference); or objections which focus on the overriding significance of virtue/the total cluelessness of us all. It might be that these are dealt with in some other way (I'm not clear how) or that this is simply not that important (which I question, but am uncertain), and so would be appreciative for your thoughts.</li>\n</ol>\n<p>Mainly, though I liked it, so my critical points aren't to be understood as a total rejection of the piece! It was great in so many ways, and I'm sure required a fair amount of work! </p>\n", "parentCommentId": null, "user": {"username": "JoshP"}}, {"_id": "6NfgecQAMmrkf3CJG", "postedAt": "2018-05-02T15:59:23.307Z", "postId": "MQWAsdm8MSzYNkD9X", "htmlBody": "<p>As far as I can tell none of the links that look <a href=\"http://effective-altruism.com\">like this</a> instead of <a href=\"http://effective-altruism.com\">http://effective-altruism.com</a> work in the pdf version.</p>\n", "parentCommentId": null, "user": {"username": "Alex_Barry"}}, {"_id": "aJhyEP7df6ATXXzfv", "postedAt": "2018-05-02T17:17:53.074Z", "postId": "MQWAsdm8MSzYNkD9X", "htmlBody": "<p>I think there's a mix of working and non-working, having just checked myself. Some don't go through to anything when you click on them; some go through to a 404 error; and some go through to the correct website. </p>\n<p>Bizarrely, this will depend on the copy I have downloaded. I have downloaded it more than once, and it works differently each time. The first one I have downloaded (I downloaded more than once in different tabs) works in every link I check. The second one doesn't- and this remains true when comparing certain links like for like. I'm not really sure why. Bit bizarre.</p>\n", "parentCommentId": "6NfgecQAMmrkf3CJG", "user": {"username": "JoshP"}}, {"_id": "t8zuvmbmgvHQRmoSd", "postedAt": "2018-05-02T18:21:05.838Z", "postId": "MQWAsdm8MSzYNkD9X", "htmlBody": "<p>Edit, this should be fixed now, let me know if there are still problems.</p>\n<p>(Sorry, I don't have time to reply to all of the comments here today.)\nSorry about this! Not sure what's going on here, but does this version work better for you? </p>\n<p>[There was a link here]</p>\n<p>I'll try to get a full fix tomorrow.</p>\n", "parentCommentId": "aJhyEP7df6ATXXzfv", "user": {"username": "Maxdalton"}}, {"_id": "R5XdbG4Z5QW2wZxwb", "postedAt": "2018-05-02T19:14:08.872Z", "postId": "MQWAsdm8MSzYNkD9X", "htmlBody": "<p><em>Minor Critique</em></p>\n<p>On page 140 of the handbook, &quot;Does foreign aid really work?&quot; Moyo's <em>Dead Aid</em> is mentioned. Although, she is strictly speaking about gov't aid:\n<strong>&quot;But this books is not concerned with emergency and charity based aid.&quot;</strong> (End of page 7, <em>Dead Aid</em>.)</p>\n<p>(1) humanitarian or emergency ~ mobilized and dispensed in response to catastrophes and calamities</p>\n<p>(2) charity-based ~ disbursed by NGOs to institutions or <strong>people</strong></p>\n<p>(3) systematic: &quot;aid payments made directly to governments either though government-to-government transfers [bilateral aid] or transferred via institutions such as the World Bank (known as multilateral aid).&quot;</p>\n<p>Therefore, since EA is about charity-based aid, and Moyo is strictly discussing gov't aid, I do not think it is relevant to mention <em>Dead Aid</em>.</p>\n<hr />\n<p>Aside, total US gov't foreign aid is  4150G*.7% </p>\n<p>= almost 30 billion.</p>\n<p>Where 373.25 billion by foundations &amp; individuals (in the US), and</p>\n<p>of that 265 billion by <strong>individuals</strong> alone!</p>\n<p><a href=\"http://www.pbs.org/development/2016/06/14/giving-usa-2016-released-today\">http://www.pbs.org/development/2016/06/14/giving-usa-2016-released-today</a></p>\n", "parentCommentId": null, "user": {"username": "adamaero"}}, {"_id": "dB54aeqfzRdBtrDWJ", "postedAt": "2018-05-02T20:09:14.065Z", "postId": "MQWAsdm8MSzYNkD9X", "htmlBody": "<p>As mentioned by others, the formatting is poor. I most like page 166 where a choice between a short and long video is given. Although, the spacing for the descriptions is odd. The book list is exactly what I want to see, but there is a period floating for <em>80k Hours</em>, and no period for <em>The Most Good You Can Do</em>. Awesome content, but not something I would share with others. The formatting is just too inconsistent.</p>\n<hr />\n<ul>\n<li>I wish there were some profile descriptions of real-world effective altruists, even one or two people who are only partially on board. I consider myself all for lessening global poverty and animal suffering. Although, I'm generally against taking action against wild animal suffering or supporting CS grad students. </li>\n</ul>\n<ul>\n<li>I wish there were something about how absolute/extreme poverty is getting better fast, but there is still a lot of children and families suffering from the causes. Additionally, some mention of the significant decline:</li>\n</ul>\n<p>40% in 1990</p>\n<p>20% in 2010</p>\n<p><a href=\"https://en.wikipedia.org/wiki/Extreme_poverty#/media/File:USAID_Projections.png\">https://en.wikipedia.org/wiki/Extreme_poverty#/media/File:USAID_Projections.png</a></p>\n", "parentCommentId": null, "user": {"username": "adamaero"}}, {"_id": "Tg2CBsmjMJgE7WWpt", "postedAt": "2018-05-02T23:32:16.506Z", "postId": "MQWAsdm8MSzYNkD9X", "htmlBody": "<p>I think this has turned out really well Max. I like that this project looks set to aid with movement growth while improving the movement's intellectual quality, because the content is high-quality and representative of current EA priorities. Maybe the latter is the larger benefit, and probably it will help everyone to feel more confident in accelerating the movement growth over time, and so I hope we can find more ways to have a similar effect!</p>\n", "parentCommentId": null, "user": {"username": "RyanCarey"}}, {"_id": "QJwpT9Kmk7JpLoqw3", "postedAt": "2018-05-03T00:20:24.414Z", "postId": "MQWAsdm8MSzYNkD9X", "htmlBody": "<p><em>Doing Good Better</em></p>\n", "parentCommentId": "LRhz9ZAPWySLXRHgw", "user": {"username": "adamaero"}}, {"_id": "gpj49zpsXysQJ2fE9", "postedAt": "2018-05-03T01:53:50.315Z", "postId": "MQWAsdm8MSzYNkD9X", "htmlBody": "<p>Or Singer's <em>The Most Good You Can Do.</em></p>\n", "parentCommentId": "LRhz9ZAPWySLXRHgw", "user": {"username": "David_Moss"}}, {"_id": "Xjb6HqbZvzkB4M8W4", "postedAt": "2018-05-03T04:33:37.800Z", "postId": "MQWAsdm8MSzYNkD9X", "htmlBody": "<p>Doing Good Better is more accessible and spends a lot more time introducing and defending the basic idea of EA instead of branching out into more advanced ideas. It is also much more focused on global poverty. </p>\n", "parentCommentId": "LRhz9ZAPWySLXRHgw", "user": {"username": "JoshYou"}}, {"_id": "Lv7qvnnFM82AxaYtt", "postedAt": "2018-05-03T06:30:24.443Z", "postId": "MQWAsdm8MSzYNkD9X", "htmlBody": "<p>The shift from Doing Good Better to this handbook reinforces my sense that there are two types of EA:</p>\n<p>Type 1:</p>\n<ol>\n<li><p>Causes: global health, farm animal welfare</p>\n</li>\n<li><p>Moral patienthood is hard to seriously dispute</p>\n</li>\n<li><p>Evidence is more direct (RCTs, corporate pledges)</p>\n</li>\n<li><p>Charity evaluators exist (because evidence is more direct)</p>\n</li>\n<li><p>Earning to give is a way to contribute</p>\n</li>\n<li><p>Direct work can be done by people with general competence</p>\n</li>\n<li><p>Economic reasoning is more important (partly due to donations being more important)</p>\n</li>\n<li><p>More emotionally appealing (partly due to being more able to feel your impact)</p>\n</li>\n<li><p>Some public knowledge about the problem</p>\n</li>\n<li><p>More private funding and a larger preexisting community</p>\n</li>\n</ol>\n<p>Type 2:</p>\n<ol>\n<li><p>Causes: AI alignment, biosecurity</p>\n</li>\n<li><p>Moral patienthood can be plausibly disputed (if you're relying on the benefits to the long term future; however, these causes are arguably <a href=\"http://effective-altruism.com/ea/1n0/the_personaffecting_value_of_existential_risk/\">important even without considering the long term future</a>)</p>\n</li>\n<li><p>Evidence is more speculative (making prediction more important)</p>\n</li>\n<li><p>Charity evaluation is more difficult (because impact is harder to measure)</p>\n</li>\n<li><p>Direct work is the way to contribute</p>\n</li>\n<li><p>Direct work seems to benefit greatly from specific skills/graduate education</p>\n</li>\n<li><p>Game theory reasoning is more important (of course, game theory is technically part of economics)</p>\n</li>\n<li><p>Less emotionally appealing (partly due to being less able to feel your impact)</p>\n</li>\n<li><p>Little public knowledge about the problem</p>\n</li>\n<li><p>Less private funding and a smaller preexisting community</p>\n</li>\n</ol>\n", "parentCommentId": null, "user": {"username": "RandomEA"}}, {"_id": "nH4CjiyuFg69T6AWy", "postedAt": "2018-05-03T08:22:05.888Z", "postId": "MQWAsdm8MSzYNkD9X", "htmlBody": "<ol>\n<li>Thanks for pointing that out, we'll fix that. </li>\n<li><ul>\n<li>Cause areas:  Unfortunately we couldn't include everything. One of the core tenets of effective altruism is making difficult calls about cause prioritization, and these will always be contentious. We had to make those calls as we decided what to include. Our current best guess is that we should be focusing our efforts on a variety of different attempts to improve the long-term future, and this explains the calls that we made in the handbook. </li>\n<li>Career paths: You're right, I'll make some changes to make clear that this is cause focused, and point people to 80,000 Hours for career focused advice. </li>\n<li>Sorry that the article is not so helpful for non-Americans. Unfortunately this varies quite a bit between countries, and we couldn't cover them all. </li>\n</ul>\n</li>\n<li>That's a good point, I'll consider changing/adding those books. </li>\n<li>That's another good point. I might include another section at the end on criticisms. </li>\n</ol>\n", "parentCommentId": "erDxCubqQmT8Pyzsg", "user": {"username": "Maxdalton"}}, {"_id": "NrgoWxxQA4HDgyerR", "postedAt": "2018-05-03T08:26:12.515Z", "postId": "MQWAsdm8MSzYNkD9X", "htmlBody": "<p>I encourage you to share copies online. For reasons similar to those discussed above, we didn't get consent to make physical copies from all of the authors. I have not yet asked for permission on translation, but I will do so and reply in this thread. </p>\n<p>(This post may be interesting for you if you haven't already read it: <a href=\"http://effective-altruism.com/ea/1lh/why_not_to_rush_to_translate_effective_altruism/)\">http://effective-altruism.com/ea/1lh/why_not_to_rush_to_translate_effective_altruism/)</a>. </p>\n", "parentCommentId": "xHmpuhhs5KBpbG8uD", "user": {"username": "Maxdalton"}}, {"_id": "9wSfzBWQAfwwc6D2W", "postedAt": "2018-05-03T08:44:21.083Z", "postId": "MQWAsdm8MSzYNkD9X", "htmlBody": "<p>As Josh says, they're slightly different resources, and I think it will depend on the person. </p>\n<p>The EA Handbook was designed for people who have already showed some interest and inclination towards EA's core principles - maybe they've been pitched by a friend, or listened to a podcast. I think Doing Good Better is likely to be better as an introduction <em>to</em> those core principles, whilst the Handbook is an exploration of where the principles might lead. So in terms of level, Doing Good Better feels more introductory. </p>\n<p>In my view, the content of the EA Handbook better reflects our best current understanding of which causes to prioritize, and so I would prefer it in terms of content. </p>\n<p>Overall, my guess is that if you've had a chance to briefly explain some of EA's core principles and intuitions, it would be best to recommend the EA Handbook. </p>\n", "parentCommentId": "LRhz9ZAPWySLXRHgw", "user": {"username": "Maxdalton"}}, {"_id": "Y2vLm2gRPzBiQjLwQ", "postedAt": "2018-05-03T08:48:54.579Z", "postId": "MQWAsdm8MSzYNkD9X", "htmlBody": "<p>Thanks for your feedback. </p>\n<p>Thanks for catching that mistake, we'll fix that floating period, and the other errors that others have spotted. When you say &quot;as mentioned by others&quot;, are you only referring to the comments above, or is there some discussion of this that I'm missing? It would be good to catch all of the mistakes!</p>\n<p>Thanks for the suggestions on content. I'll have a think about whether it would be useful to include profiles somewhere. </p>\n", "parentCommentId": "dB54aeqfzRdBtrDWJ", "user": {"username": "Maxdalton"}}, {"_id": "wgBoMwbDw3mY6QeGw", "postedAt": "2018-05-03T08:55:24.733Z", "postId": "MQWAsdm8MSzYNkD9X", "htmlBody": "<p>Thank you for pointing this out! I'll remove that reference.</p>\n", "parentCommentId": "R5XdbG4Z5QW2wZxwb", "user": {"username": "Maxdalton"}}, {"_id": "Ev3By7aSTdrWsB6s6", "postedAt": "2018-05-03T09:41:42.157Z", "postId": "MQWAsdm8MSzYNkD9X", "htmlBody": "<p>Now that a new version of the handbook is out, could you update the '<a href=\"http://effective-altruism.com/ea/6x/introduction_to_effective_altruism/\">More on Effective Altruism</a>' link? It is quite prominent in the 'Getting Started' navigation panel on the right-hand side of the EA Forum.</p>\n", "parentCommentId": null, "user": {"username": "Darius_Meissner"}}, {"_id": "xB8MthJon8eifBAyX", "postedAt": "2018-05-03T09:59:02.714Z", "postId": "MQWAsdm8MSzYNkD9X", "htmlBody": "<p>I just spent a very exciting hour going through every link (yes, I clicked all of them) in the handbook, and I think I have a definitive list of mistakes in the links (if there are others, may they remain mistakes ever more :P ): \np.47, Engines of Creation\np.77 expected value link\np.77 Risk aversion and rationality , Use <a href=\"http://fitelson.org/seminar/buchak2.pdf\">http://fitelson.org/seminar/buchak2.pdf</a> instead\np.80 – scope insensitivity \np.80- Luke Muehlhauser has commented\np.127 “our profile on the long-run future”\nFootnote 43, p.137, link 2, related to diarrhoea\np.142, “animal welfare profile”\nP.144- systemic change profile link works, but looks slightly unprofessional\nYou could do with a link to the 80,000 Hours Podcast and the Doing Good Better podcast on p.166</p>\n", "parentCommentId": "t8zuvmbmgvHQRmoSd", "user": {"username": "JoshP"}}, {"_id": "vokhdXpdkrwDRf7Fw", "postedAt": "2018-05-03T12:41:30.866Z", "postId": "MQWAsdm8MSzYNkD9X", "htmlBody": "<p>Thanks so much for this!</p>\n", "parentCommentId": "xB8MthJon8eifBAyX", "user": {"username": "Maxdalton"}}, {"_id": "Ghjn8g5CqgyGrWi4y", "postedAt": "2018-05-03T14:17:17.646Z", "postId": "MQWAsdm8MSzYNkD9X", "htmlBody": "<p>Doing Good Better is still a useful introduction to EA, and it's possible to distribute physical copies of the book, so that will sometimes be more useful. The EA Handbook might work better as a more advanced introduction, or in online circumstances (see also some of the other comment threads).</p>\n", "parentCommentId": "YH9kmTRK7kKtYu4g2", "user": {"username": "Maxdalton"}}, {"_id": "mHvQ4R66EwoGMwHmn", "postedAt": "2018-05-03T14:35:28.872Z", "postId": "MQWAsdm8MSzYNkD9X", "htmlBody": "<p>JoshP's comment ~ which you took care of</p>\n", "parentCommentId": "Y2vLm2gRPzBiQjLwQ", "user": {"username": "adamaero"}}, {"_id": "wF7Jxt2HfBnWJX4Ea", "postedAt": "2018-05-03T15:52:01.432Z", "postId": "MQWAsdm8MSzYNkD9X", "htmlBody": "<p>I am somewhat confused by the framing of this comment, you start by saying &quot;there are two types of EA&quot; but the points seem to all be about the properties of different causes.</p>\n<p>I don't think there are 'two kinds' of EAs in the sense you could easily tell which group people were going to fall into in advance, but that all of your characteristics just follow as practical considerations resulting from how important people find the longtermist view. (But I do think &quot;A longtermist viewpoint leads to  very different approach&quot; is correct.)</p>\n<p>I'm also not sure how similar the global poverty and farm animal welfare groups actually are. There seem to be significant differences in terms of the quality of evidence used and how established they are as areas. Points 3, 4, 7, 9 and 10 seem to have pretty noticeable differences between global poverty and farm animal welfare.  </p>\n", "parentCommentId": "Lv7qvnnFM82AxaYtt", "user": {"username": "Alex_Barry"}}, {"_id": "pbaRd2HaRofoSLQ2P", "postedAt": "2018-05-03T18:34:33.229Z", "postId": "MQWAsdm8MSzYNkD9X", "htmlBody": "<p>I also believe there are two broad types of EAs today. So this is interesting. Although, I am a little confused on some of your meaning. Can you make some of those into complete sentences?</p>\n<p>2) How are these different between Type 1 and Type 2?</p>\n<p>4) &quot;Evidence is more direct&quot; in what regard or context??</p>\n<p>Lastly, the list seems skewed, favoring Type 2.</p>\n", "parentCommentId": "Lv7qvnnFM82AxaYtt", "user": {"username": "adamaero"}}, {"_id": "hSzRqt38Q8Kgt2Mmh", "postedAt": "2018-05-03T21:00:18.614Z", "postId": "MQWAsdm8MSzYNkD9X", "htmlBody": "<p>There's a valuable discussion of this on Facebook at <a href=\"https://www.facebook.com/groups/effective.altruists/permalink/1750780338311649/\">https://www.facebook.com/groups/effective.altruists/permalink/1750780338311649/</a></p>\n", "parentCommentId": null, "user": {"username": "impala"}}, {"_id": "cd7gwkN3MwYBRRGRc", "postedAt": "2018-05-04T01:40:32.795Z", "postId": "MQWAsdm8MSzYNkD9X", "htmlBody": "<p>I find it so interesting <a href=\"https://www.facebook.com/groups/effective.altruists/permalink/1750780338311649/\">that people on the EA Facebook page have been a lot more generally critical about the content</a> than people here on the EA Forum -- here it's all just typos and formatting issues.</p>\n<p>I'll admit that I was one of the people who saw this here on the EA Forum first and was disappointed, but chose not to say anything out of a desire to not rock the boat. But now that I see others are concerned, I will echo my concerns too and magnify them here -- I don't feel like this handbook represents EA as I understand it.</p>\n<p>By page count, AI is 45.7% of the entire causes sections. And as Catherine Low pointed out, in both the animal and the global poverty articles (which I didn't count toward the page count), more than half the article was dedicated to why we might not choose this cause area, with much of that space also focused on far-future of humanity. I'd find it hard for anyone to read this and not take away that the community consensus is that AI risk is clearly the most important thing to focus on.</p>\n<p>I feel like I get it. I recognize that CEA and 80K have a right to have strong opinions about cause prioritization. I also recognize that they've worked hard to become such a strong central pillar of EA as they have. I also recognize that a lot of people that CEA and 80K are familiar with agree with them. But now I can't personally help but feel like CEA is using their position of relative strength to essentially dominate the conversation and claim it is the community consensus.</p>\n<p>I agree the definition of &quot;EA&quot; here is itself the area of concern. It's very easy for any of us to call &quot;EA&quot; as we see it and naturally make claims about the preferences of the community. But this would be very clearly circular. I'd be tempted to defer to the EA Survey. \nAI was only the top cause of <a href=\"http://effective-altruism.com/ea/1e5/ea_survey_2017_series_cause_area_preferences/\">16% of the EA Survey</a>. Even among those employed full-time in a non-profit (maybe a proxy for full-time EAs), it was the top priority of 11.26%, compared to 44.22% for poverty and 6.46% for animal welfare.\n But naturally I'd be biased toward using these results, and I'm definitely sympathetic to the idea that EA should be considered more narrowly, or we should weight the opinions of people working on it full-time more heavily. So I'm unsure. Even my opinions here are circular, by my own admission.</p>\n<p>But I think if we're going to be claiming in a community space to talk about the community, we should be more thoughtful about who's opinions we're including and excluding. It seems pretty inexpensive to re-weigh the handbook to emphasize AI risk just as much without being as clearly jarring about it (e.g., dedicating three chapters instead of one or slanting so clearly toward AI risk throughout the &quot;reasons not to prioritize this cause&quot; sections).</p>\n<p>Based on this, and the general sentiment, I'd echo Scott Weather's comment on the Facebook group that it’s pretty disingenuous to represent CEA’s views as the views of the entire community writ large, however you want to define that. I agree I would have preferred it called “CEA’s Guide to Effective Altruism” or something similar.</p>\n", "parentCommentId": null, "user": {"username": "Peter_Hurford"}}, {"_id": "TPuZmmkq4dsNx3CdG", "postedAt": "2018-05-04T04:31:38.247Z", "postId": "MQWAsdm8MSzYNkD9X", "htmlBody": "<p>Just to clarify, when I say that my sense is that there are two types of EA, I mean that I sense that there are two types of effective altruism, not that I sense that there are two types of effective altruists.</p>\n<p>I agree that there are substantial differences between global poverty and farm animal welfare (with global poverty being more clearly Type 1). But it seems to me that those differences are more differences of degree, while the differences between global poverty/farm animal welfare and biosecurity/AI alignment are more differences of kind.</p>\n", "parentCommentId": "wF7Jxt2HfBnWJX4Ea", "user": {"username": "RandomEA"}}, {"_id": "AQDGRk5jedt2qtkem", "postedAt": "2018-05-04T04:44:18.221Z", "postId": "MQWAsdm8MSzYNkD9X", "htmlBody": "<blockquote>\n<p>2) How are these different between Type 1 and Type 2?</p>\n</blockquote>\n<p>To me, it cannot be seriously disputed that improving the lives of currently alive humans is good, that improving the welfare of current and future animals is good, and that preventing the existence of farm animals who would live overall negative lives is good.</p>\n<p>By contrast, I think that you can make a plausible argument that there is no moral value to ensuring that a person who would live a happy life comes into existence (though as noted above, you can make the case for reducing global catastrophic risks without relying on that benefit).</p>\n<blockquote>\n<p>4) &quot;Evidence is more direct&quot; in what regard or context??</p>\n</blockquote>\n<p>It's easier to measure the effectiveness of the program being implemented by a global health charity, the effectiveness of that charity at implementing the program, and the effectiveness of an animal charity at securing corporate pledges than it is to measure the impact of biosecurity and AI alignment organizations.</p>\n", "parentCommentId": "pbaRd2HaRofoSLQ2P", "user": {"username": "RandomEA"}}, {"_id": "QGxPyQ7WqWdbuhbSM", "postedAt": "2018-05-04T16:45:42.086Z", "postId": "MQWAsdm8MSzYNkD9X", "htmlBody": "<blockquote>\n<p>Just to clarify, when I say that my sense is that there are two types of EA, I mean that I sense that there are two types of effective altruism, not that I sense that there are two types of effective altruists.</p>\n</blockquote>\n<p>Ah I see. for some reason I got the other sense from reading your comment, but looking back at it I think that was just a failing of reading comprehension on my part.</p>\n<p>I agree that the differences between global poverty and animal welfare are more matters of degree, but I also think they are larger than people seem to expect.</p>\n", "parentCommentId": "TPuZmmkq4dsNx3CdG", "user": {"username": "Alex_Barry"}}, {"_id": "QctShAjzr5NRNvxhB", "postedAt": "2018-05-04T16:52:25.499Z", "postId": "MQWAsdm8MSzYNkD9X", "htmlBody": "<p>Thanks, that's a mistake which we'll fix. </p>\n", "parentCommentId": "8utLn6nhMeDPpPMYQ", "user": {"username": "Maxdalton"}}, {"_id": "N7qv5xD4JjvJXTEeL", "postedAt": "2018-05-04T17:02:53.222Z", "postId": "MQWAsdm8MSzYNkD9X", "htmlBody": "<p>(Copying across some comments I made on Facebook which are relevant to this.)</p>\n<p>Thanks for the passionate feedback everyone. Whilst I don’t agree with all of the comments, I’m sorry for the mistakes I made. Since some of the comments above make similar comments, I’ll try to give general replies in some main-thread comments. I’ll also be reaching out to some of the people in the thread above to try to work out the best way forward.</p>\n<p>My understanding is that the main worry that people have is about calling it the Effective Altruism Handbook vs. CEA’s Guide to Effective Altruism or similar. For the reasons given in my reply to Scott above, I think that calling it the EA Handbook is not a significant change from before: unless we ask Ryan to take down the old handbook, then whatever happens, there will be a CEA-selected resource called the EA Handbook. For reasons given above and below, I think that the new version of the Handbook is better than the old. I think that there is some value in explicitly replacing the old version for this reason, and since “EA Handbook” is a cleaner name. However, I do also get people’s worries about this being taken to represent the EA community as a whole. For that reason, I will make sure that the title page and introduction make clear that this is a project of CEA, and I will make clear in the introduction that others in the community would have selected different essays.</p>\n<p>My preferred approach would then be to engage with people who have expressed concern, and see if there are changes we can make that alleviate their concerns (such as those we already plan to make based on Scott’s comment). If it appears that we can alleviate most of those concerns whilst retaining the value of the Handbook from from CEA’s perspective, it might be best to call it the Centre for Effective Altruism’s EA Handbook. Otherwise, we would rebrand. I’d be interested to hear in comments whether there are specific changes (articles to add/take away/design things) that would reassure you about this being called the EA Handbook.</p>\n<p>In this comment I’ll reply to some of the more object-level criticisms. I want to apologize for how this seemed to others, but also give a clearer sense of our intentions. I think that it might seem that CEA has tried merely to push AI safety as the only thing to work on. We don’t think that, and that wasn’t our intention. Obviously, poorly realized intentions are still a problem, but I want to reassure people about CEA’s approach to these issues. </p>\n<p>First, re there not being enough discussion of portfolios/comparative advantage, this is mentioned in two of the articles (“Prospecting for Gold” and “What Does (and Doesn't) AI Mean for Effective Altruism?”). However, I think that we could have emphasised this more, and I will see if it’s possible to include a full article on coordination and comparative advantage.</p>\n<p>Second, I’d like to apologise for the way the animal and global health articles came across. Those articles were commissioned at the same time as the long-term future article, and they share a common structure: What’s the case for this cause? What are some common concerns about that cause? Why might you choose not to support this cause? The intention was to show how many assumptions underlie a decision to focus on any cause, and to map out some of the debate between the different cause areas, rather than to illicitly push the long-term future. It looks like this didn’t come across, sorry. We didn’t initially commission sub-cause profiles on government, AI and biosecurity, which explains why those more specific articles follow a different structure (mostly talks given at EA Global).</p>\n<p>Third, I want to explain some of the reasoning behind including several articles on AI. AI risk is a more unusual area, which is more susceptible to misinterpretation than global health or animal welfare. Partly for this reason, we thought that it was sensible to include several articles on this topic, with the intention that this would provide more needed background and convey more of the nuance of the idea. I will talk with some of the commenters above to discuss if it makes sense to do some sort of merge so that AI dominates the contents page less.</p>\n", "parentCommentId": "cd7gwkN3MwYBRRGRc", "user": {"username": "Maxdalton"}}, {"_id": "HT6JcEhoadDCmHS2f", "postedAt": "2018-05-04T18:00:51.883Z", "postId": "MQWAsdm8MSzYNkD9X", "htmlBody": "<p>I don't think my experience matches this split. For example, I don't think that it's obvious that the causes you specify match the attributes in points 2, 5, 6.</p>\n", "parentCommentId": "Lv7qvnnFM82AxaYtt", "user": {"username": "Buck"}}, {"_id": "d32qRrXm3aWqoYQPT", "postedAt": "2018-05-04T19:51:37.835Z", "postId": "MQWAsdm8MSzYNkD9X", "htmlBody": "<p>What about the possibility the Centre for Effective Altruism represents the community by editing the EA Handbook to reflect what the community values in spite of what the CEA concludes, the CEA excludes evaluations from the EA Handbook from which it currently diverges from the community, and it's still called the 'EA Handbook' instead of 'CEA's Guide to EA?' Obviously this wouldn't carry EA forward with what the CEA thinks is maximum fidelity, but it's clear many think the CEA is trying to spread the EA message with infidelity, while acting as though they're the only actor in the movement others can trust to carry that message. It looks not only hypocritical but undermines faith in the CEA.</p>\n<p>Altering the handbook so it's more of a compromise between multiple actors in EA will redeem the reputation of the CEA. Without that, the CEA can't carry EA forward with the fidelity at all, because the rest of the movement wouldn't cooperate with them. In the meantime, the CEA and everyone else can hammer out what we think is the most good here on the EA Forum. If broader conclusions are drawn which line up with the CEA's evaluation based on a consensus the CEA had behind their perspective the best arguments, that can be included in the next edition of the EA Handbook. Again, from the CEA's perspective, that might seem like deliberately compromising the fidelity of EA in the short-term to appease others. But again, from the perspective of the CEA's current critics, why they're criticizing the 2nd edition of the EA Handbook is because they perceive themselves as protecting the fidelity of EA <em>from the Centre for Effective Altruism</em>. This could solve other contentious issues in EA, such as consideration of both s-risks <em>and</em> x-risks from AI. The EA Handbook could be published as close to identically as possible in multiple languages, which would prevent the CEA from selling EA one way in English, the EAF selling it another way in German, and creating more trust issues which would down the road just become sources of conflict, not unlike the criticism the EA Handbook, 2nd edition, is receiving now.  Ultimately, this would be the CEA making a relatively short-term compromise to ensure the long-term fidelity of EA by demonstrating themselves as delegate and representative agency the EA community can still have confidence in.</p>\n", "parentCommentId": "N7qv5xD4JjvJXTEeL", "user": {"username": "Evan_Gaensbauer"}}, {"_id": "iwXKQpC4e85Pxbw4D", "postedAt": "2018-05-04T19:57:48.767Z", "postId": "MQWAsdm8MSzYNkD9X", "htmlBody": "<p>What current EA priorities are according to the CEA is at odds with what many others think EA's current priorities are. It appears the CEA, by putting more emphasis on x-risk reduction, is smuggling what they think EA's current (proportional distribution) of priorities <em>should be</em> into a message about what EA's current priorities <em>actually</em> are, in a way undermining the perspective of thousands of effective altruists. So the idea that this handbook will increase the movement's intellectual quality is based on definitions of quality and representation for EA many effective altruists don't share. I think this and future editions of the EA Handbook should be regarded as the community as drafts from the CEA until they carry out a project of getting as broad and substantial a swathe of feedback from important community actors as they can. This doesn't have to be a program of populist democracy where each self-identified effective altruist gets a vote. But the CEA could run the EA Handbook by EA organizations which are just as crucial to effective altruism as the CEA which don't have the phrase 'effective altruism' in their name, like ACE, Givewell, or any other organizations which are cause-specific but are community pillars nonetheless. </p>\n", "parentCommentId": "Tg2CBsmjMJgE7WWpt", "user": {"username": "Evan_Gaensbauer"}}, {"_id": "bhKSjv3NDTsTv9MhJ", "postedAt": "2018-05-04T21:19:57.066Z", "postId": "MQWAsdm8MSzYNkD9X", "htmlBody": "<p>Reading the book as Epub in iBooks, in enumerations there are often certain sentences that have a bigger font size than the normal text (for instance in the section &quot;A Proposed Adjustment to the Astronomical Waste Argument&quot;). I can't post a picture here but i don't think it was intendet to be that way. Hope that helps.</p>\n", "parentCommentId": null, "user": {"username": "Yannick_Muehlhaeuser"}}, {"_id": "BSzBCdYYfFcCKoP5P", "postedAt": "2018-05-05T01:06:42.068Z", "postId": "MQWAsdm8MSzYNkD9X", "htmlBody": "<blockquote>\n<p>It's very easy for any of us to call &quot;EA&quot; as we see it and naturally make claims about the preferences of the community. But this would be very clearly circular. I'd be tempted to defer to the EA Survey. AI was only the top cause of 16% of the EA Survey. Even among those employed full-time in a non-profit (maybe a proxy for full-time EAs), it was the top priority of 11.26%, compared to 44.22% for poverty and 6.46% for animal welfare. </p>\n</blockquote>\n<p>As noted in the fb discussion, it seems unlikely full-time non-profit employment is a good proxy for 'full-time EAs' (i.e. those working full time at an EA organisation - E2Gers would be one of a few groups who should also be considered 'full-time EAs' in the broader sense of the term).</p>\n<p>For this group, one could stipulate every group which posts updates to the EA newsletter (I looked at the last half-dozen or so, so any group which didn't have an update is excluded, but likely minor) is an EA group, and toting up a headcount of staff (I didn't correct for FTE, and excluded advisors/founders/volunteers/freelancers/interns - all of these decisions could be challenged) and recording the prevailing focus of the org gives something like this:</p>\n<ul>\n<li>80000 hours (7 people) - Far future</li>\n<li>ACE (17 people) - Animals</li>\n<li>CEA (15 people) - Far future</li>\n<li>CSER (11 people) - Far future</li>\n<li>CFI (10 people) - Far future (I only included their researchers) </li>\n<li>FHI (17 people) - Far future</li>\n<li>FRI (5 people) - Far future</li>\n<li>Givewell (20 people) - Global poverty</li>\n<li>Open Phil (21 people) - Far future (mostly)</li>\n<li>SI (3 people) - Animals</li>\n<li>CFAR (11 people) - Far future</li>\n<li>Rethink Charity (11 people) - Global poverty</li>\n<li>WASR (3 people) - Animals</li>\n<li>REG (4 people) - Far future [Edited after Jonas Vollmer kindly corrected me]</li>\n<li>FLI (6 people) - Far future</li>\n<li>MIRI (17 people) - Far future</li>\n<li>TYLCS (11 people) - Global poverty</li>\n</ul>\n<p><a href=\"https://docs.google.com/spreadsheets/d/19r_mqGN9pR5xoBNGT5NVPDKcAs58CP6OeO5PfZiRcIU/edit?usp=sharing\">Totting this up</a>, I get ~ two thirds of people work at orgs which focus on the far future (66%), 22% global poverty, and 12% animals. Although it is hard to work out the AI | far future proportion, I'm pretty sure it is the majority, so 45% AI wouldn't be wildly off-kilter if we thought the EA handbook should represent the balance of 'full time' attention.</p>\n<p>I doubt this should be the relevant metric of how to divvy-up space in the EA handbook. It also seems unclear how clear considerations of representation play in selecting content, or if so what is the key community to proportionately represent. </p>\n<p>Yet I think I'd be surprised if it wasn't the case that among those working 'in' EA, the majority work on the far future, and a plurality work on AI. It also agrees with my impression that the most involved in the EA community strongly skew towards the far future cause area in general and AI in particular. I think they do so, bluntly, because these people have better access to the balance of reason, which in fact favours these being the most important things to work on.</p>\n", "parentCommentId": "cd7gwkN3MwYBRRGRc", "user": {"username": "Gregory_Lewis"}}, {"_id": "XoJvrvyPD7AjkdzbK", "postedAt": "2018-05-05T07:04:30.468Z", "postId": "MQWAsdm8MSzYNkD9X", "htmlBody": "<p>I think while this headcount is not a good metric how to allocate space in the EA handbook, it is a quite valuable overview in itself!</p>\n<p>Just as a caveat, the numbers should not be directly compared to numbers from EA survey, as the later included also cause-prioritization, rationality, meta, politics &amp; more.</p>\n<p>(Using such cathegories, some organizations would end up in classified in different boxes) </p>\n", "parentCommentId": "BSzBCdYYfFcCKoP5P", "user": {"username": "Jan_Kulveit"}}, {"_id": "Z6S5pXESZDyFAawyS", "postedAt": "2018-05-05T12:15:07.874Z", "postId": "MQWAsdm8MSzYNkD9X", "htmlBody": "<p>I think your list undercounts the number of animal-focused EAs. For example, it excludes <a href=\"https://sentience-politics.org/de/about/team/\">Sentience Politics</a>, which provided updates through the EA newsletter in September 2016, January 2017, and July 2017. It also excludes the Good Food Institute, an organization <a href=\"https://www.gfi.org/lets-talk-effective-altruism\">which describes itself</a> as &quot;founded to apply the principles of effective altruism (EA) to change our food system.&quot; While GFI does not provide updates through the EA newsletter, its job openings are mentioned in the December 2017, January 2018, and March 2018 newsletters. Additionally, it excludes organizations like the Humane League, which while not explicitly EA, have been <a href=\"https://www.youtube.com/watch?v=G-t_wflnPiw&amp;t=29m58s\">described as</a> having a &quot;largely utilitarian worldview.&quot; Though the Humane League does not provide updates through the EA newsletter, its job openings are mentioned in the April 2017 newsletters, February 2018, and March 2018.</p>\n<p>Perhaps the argument for excluding GFI and the Humane League (while including direct work organizations in the long term future space) is that relatively few people in direct work animal organizations identify as EAs (while most people in direct work long term future organizations identify as EA). If this is the reason, I think it'd be good for someone to provide evidence for it. Also, if the idea behind this method of counting is to look at the revealed preference of EAs, then I think people earning to give have to be included, especially since earning to give appears to be more useful for farm animal welfare than for long term future causes.</p>\n<p>(Most of the above also applies to global health organizations.)</p>\n", "parentCommentId": "BSzBCdYYfFcCKoP5P", "user": {"username": "RandomEA"}}, {"_id": "KR2uKZqSmno7ANTQJ", "postedAt": "2018-05-05T13:01:23.450Z", "postId": "MQWAsdm8MSzYNkD9X", "htmlBody": "<blockquote>\n<p>'full-time EAs' (i.e. those working full time at an EA organisation - E2Gers would be one of a few groups who should also be considered 'full-time EAs' in the broader sense of the term).</p>\n</blockquote>\n<p>I think this methodology is pretty suspicious. There are more ways to be a full-time EA (FTEA) that working at an EA org, or even E2Ging. Suppose someone spends their time working on, say, poverty out of an desire to do the most good, and thus works at a development NGO or for a governent. Neither development NGOs nor governments will count as an 'EA org' on your definition because they won't being posting updates to the EA newsletter. Why would they? The EA community has very little comparative advantage in solving poverty, so what we be the point in say, Oxfam or DFID sending update reports to the EA newsletter? It would frankly be bizarre for a government department to update the EA community. We might say &quot;ah, put people who work on poverty aren't really EAs&quot; but that would just beg the question.</p>\n", "parentCommentId": "BSzBCdYYfFcCKoP5P", "user": {"username": "MichaelPlant"}}, {"_id": "grvJh89XLKhkewJsG", "postedAt": "2018-05-06T12:43:37.206Z", "postId": "MQWAsdm8MSzYNkD9X", "htmlBody": "<p>I picked the 'updates' purely in the interests of time (easier to skim), that it gives some sense of what orgs are considered 'EA orgs' rather than 'orgs doing EA work' (a distinction which I accept is imprecise: would a GW top charity 'count'?), and I (forlornly) hoped pointing to a method, however brief, would forestall suspicion about cherry-picking. </p>\n<p>I meant the quick-and-dirty data gathering to be more an indicative sample than a census. I'd therefore expect significant margin of error (but not so significant as to change the bottom line). Other relevant candidate groups are also left out: BERI, Charity Science, Founder's Pledge, ?ALLFED. I'd expect there are more. </p>\n", "parentCommentId": "Z6S5pXESZDyFAawyS", "user": {"username": "Gregory_Lewis"}}, {"_id": "k5aYj7TZThERc59cD", "postedAt": "2018-05-07T08:35:06.215Z", "postId": "MQWAsdm8MSzYNkD9X", "htmlBody": "<p>Good idea. I'll do this when and if there is more consensus that people want to promote this content over the old. </p>\n", "parentCommentId": "Ev3By7aSTdrWsB6s6", "user": {"username": "Maxdalton"}}, {"_id": "XeF9zvXjx9ziC2inP", "postedAt": "2018-05-07T13:27:56.682Z", "postId": "MQWAsdm8MSzYNkD9X", "htmlBody": "<p>Thanks Tom. I've discussed the reasoning for including three articles on AI a bit on Facebook. To quote from that:</p>\n<p>&quot;I want to explain some of the reasoning behind including several articles on AI. AI risk is a more unusual area, which is more susceptible to misinterpretation than global health or animal welfare [or, I think e.g. biosecurity and other long-term focused causes]. Partly for this reason, we thought that it was sensible to include several articles on this topic, with the intention that this would provide more needed background and convey more of the nuance of the idea. I will talk with some of the commenters above to discuss if it makes sense to do some sort of merge so that AI dominates the contents page less.&quot;</p>\n<p>Thanks for suggestions for alternatives to the global poverty and animal welfare articles. I think you may well be right that we should change those. This is another mistake that I made. The content for the EA Handbook grew out of a sequence of content on effectivealtruism.org. As a consequence, it included only content that we had produced (or that had been produced by others at our events). At the point when we shifted to a pdf/ebook format, I should have reconsidered the selection of articles, which would have given us the possibility of trying to include the excellent content that you mention. I hope that changing those articles will also reduce the impression that AI follows obviously from a long-term future focus. I'm sorry for making this mistake.</p>\n", "parentCommentId": "bLDQKd9QoBukj3M9A", "user": {"username": "Maxdalton"}}, {"_id": "Avcfjq6NqWy2pzwcA", "postedAt": "2018-05-07T13:39:06.330Z", "postId": "MQWAsdm8MSzYNkD9X", "htmlBody": "<p>Thanks for the comments Evan. First, I want to apologize for not seeking broader consultation earlier. This was clearly a mistake. </p>\n<p>My plan now is to do as you suggest: talk to other actors in EA and get their feedback on what to include etc. Obviously any compromise is going to leave some unhappy - different groups do just favour different presentations of EA, so it seems unlikely to me that we will get a fully independent presentation that will please everyone. I also worry that democracy is not well suited to editorial decisions, and that the &quot;electorate&quot; of EA is ill-defined. If the full compromise approach fails, I think it would be best to release a CEA-branded resource which incorporates most of the feedback above. This option also seems to me to be cooperative, and to avoid harm to the fidelity of EA's message, but I might be missing something.</p>\n", "parentCommentId": "d32qRrXm3aWqoYQPT", "user": {"username": "Maxdalton"}}, {"_id": "6anAmXZZ2pFhauaQD", "postedAt": "2018-05-07T13:45:27.962Z", "postId": "MQWAsdm8MSzYNkD9X", "htmlBody": "<p>Thanks for responding Max. I agree consulting some key actors but not going through a democratic makes sense. I appreciate you being able to respond to and incorporate all the feedback you're receiving so quickly.</p>\n", "parentCommentId": "Avcfjq6NqWy2pzwcA", "user": {"username": "Evan_Gaensbauer"}}, {"_id": "Pm48bkHw8kY9dKeit", "postedAt": "2018-05-08T11:22:43.465Z", "postId": "MQWAsdm8MSzYNkD9X", "htmlBody": "<p>Thanks, we'll look into that. </p>\n", "parentCommentId": "bhKSjv3NDTsTv9MhJ", "user": {"username": "Maxdalton"}}, {"_id": "G7eZYQgzsnANZwoGt", "postedAt": "2018-05-14T13:04:17.462Z", "postId": "MQWAsdm8MSzYNkD9X", "htmlBody": "<p>What on Earth do you mean by &quot;disputing moral patienthood&quot;? If there are no moral patients then there is basically no reason for altruism whatsoever.</p>\n", "parentCommentId": "Lv7qvnnFM82AxaYtt", "user": {"username": "kbog"}}, {"_id": "eCLJETKAGCYYjXLCJ", "postedAt": "2018-05-14T13:06:14.831Z", "postId": "MQWAsdm8MSzYNkD9X", "htmlBody": "<p>I haven't read the book, but a lot of government aid goes to very similar programs as private aid, however. It's not clear to me that none of the conclusions remain true. </p>\n<p>Charity is such a touchy moralistic subject in the US, and foreign aid such a juicy political target, that I wouldn't be surprised if the author walled off the topic in such a manner for editorial rather than rational reasons.</p>\n", "parentCommentId": "R5XdbG4Z5QW2wZxwb", "user": {"username": "kbog"}}, {"_id": "kaa34BraZ5o7EuKdj", "postedAt": "2018-05-23T13:20:28.851Z", "postId": "MQWAsdm8MSzYNkD9X", "htmlBody": "<p>Thanks so much for all of the feedback everyone, this was very helpful for me to work out the problems with the old version. I've been working on getting a version which everyone can agree will be an improvement.</p>\n<p>All of the more minor changes to the Handbook have now been completed, and are available at the links in the OP.</p>\n<p>In addition to the minor changes, I plan to add the following articles:</p>\n<ul>\n<li><p>80,000 Hours' Problem Framework (<a href=\"https://80000hours.org/articles/problem-framework/\">https://80000hours.org/articles/problem-framework/</a>)</p>\n</li>\n<li><p>A forthcoming piece from 80,000 Hours on coordination as a community (including the portfolio approach)</p>\n</li>\n<li><p>Sentience Institute's Foundational question summaries (possibly slightly shortened) (<a href=\"https://www.sentienceinstitute.org/foundational-questions-summaries\">https://www.sentienceinstitute.org/foundational-questions-summaries</a>)</p>\n</li>\n<li><p>David Roodman's research for GiveWell on the worm wars (<a href=\"https://blog.givewell.org/2016/12/06/why-i-mostly-believe-in-worms/\">https://blog.givewell.org/2016/12/06/why-i-mostly-believe-in-worms/</a>)</p>\n</li>\n</ul>\n<p>I may also make some edits to the three &quot;cause profile&quot; pieces, some for length, and adding some details to the long-term future piece. The more major edits might take a couple of months (for the 80,000 Hours piece to be ready, for redesign).</p>\n<p>I've reached out to some of the original commenters, and some of the main research/community building orgs in the space, asking for further comments. Thanks again to everyone who took the time to try to make this a better product. I for one am more excited about the version-to-come than the version-as-was. </p>\n", "parentCommentId": null, "user": {"username": "Maxdalton"}}, {"_id": "H5Ds5SXgXG6QzAeaM", "postedAt": "2018-05-30T12:16:26.773Z", "postId": "MQWAsdm8MSzYNkD9X", "htmlBody": "<p>I thank both editors and everybody who worked on this; I will learn a lot from it. (The Kindle version has weird layout and sectioning, but it seems readable.)</p>\n<p>By the way, someone kindly added <a href=\"https://www.goodreads.com/book/show/40106939-effective-altruism-handbook\">this new edition on <em>Goodreads</em></a>.</p>\n", "parentCommentId": null, "user": {"username": "antonio"}}, {"_id": "8E4NJKiQ2zh2uRuSD", "postedAt": "2018-08-13T08:39:30.106Z", "postId": "MQWAsdm8MSzYNkD9X", "htmlBody": "<p>If you would like to translate the Handbook, please email <a href=\"mailto:content@effectivealtruism.org\">content@effectivealtruism.org</a> for permission. </p>\n", "parentCommentId": "NrgoWxxQA4HDgyerR", "user": {"username": "Maxdalton"}}, {"_id": "Pw4Z6kS4JES5QTvYs", "postedAt": "2019-05-02T22:50:32.072Z", "postId": "MQWAsdm8MSzYNkD9X", "htmlBody": "<p><strong>Update:</strong> As a result of our <a href=\"https://www.centreforeffectivealtruism.org/blog/announcing-a-change-of-leadership-at-cea/\">leadership transition</a> and the launch of the new Forum, we deprioritized the third edition of the Handbook, and we can&#x27;t commit to a release date.  </p>", "parentCommentId": "kaa34BraZ5o7EuKdj", "user": {"username": "aarongertler"}}]