[{"_id": "vTcHzui4HjmaZneTr", "postedAt": "2017-10-10T02:18:07.139Z", "postId": "MrCjtdTxHvRzqu8fp", "htmlBody": "<p>Hey Zack,</p>\n<p>I agree that we lose a bunch by moving our movement's centre of gravity away from poverty and development econ. But if we do the move properly, we gain a lot on the basis of the new areas we settle in. What rigor we lost, we should be able to patch up with Bayesian rationalist thinking. What institutional capital we might have lost from World Bank / Gates, we might be able to pick up with RAND/IARPA/Google/etc, a rather more diverse yet impressive group of possible contributors. For organization, yes a lot of experience, like that of Evidence Action, will be lost, but also much will be gained, for example, by working instead at technology think tanks, and elsewhere.</p>\n<p>I don't think your conclusion that people should start in the arena of poverty is very well-supported either, if you're not comparing it to other arenas that people might be able to start out in. Do you think you might be <a href=\"http://lesswrong.com/lw/19m/privileging_the_hypothesis/\">privileging the hypothesis</a> that people should start in the management of poverty just because that's salient to you, possibly because it's the <a href=\"https://en.wikipedia.org/wiki/Status_quo_bias\">status quo</a>?</p>\n", "parentCommentId": null, "user": {"username": "RyanCarey"}}, {"_id": "TbZ4645kw2gNWM43w", "postedAt": "2017-10-10T06:42:05.930Z", "postId": "MrCjtdTxHvRzqu8fp", "htmlBody": "<p>I also worried about what the impact will be if too many people stop focusing on poverty despite agreeing that existential risk is much more important.</p>\n<ul>\n<li>Firstly, I think that successes in global poverty will help establish our credibility. Everyone cares about poverty and if we are having successes in this area, people will respect us more, even if they are skeptical of our other projects. Respect is important as it means that more people will want to join us and that people will provide us with more nuanced criticism.</li>\n<li>Secondly, some of the people who join the movement initially to have an impact in terms of global poverty will end up being interesting in other cause areas too. We don't want to lose this demographic even if we were to have existential risk as dominating our other priorities.</li>\n</ul>\n", "parentCommentId": null, "user": {"username": "casebash"}}, {"_id": "GuGbK2tC6GRv4Kr5x", "postedAt": "2017-10-10T17:02:03.453Z", "postId": "MrCjtdTxHvRzqu8fp", "htmlBody": "<blockquote>\n<p>What rigor we lost, we should be able to patch up with Bayesian rationalist thinking</p>\n</blockquote>\n<p>Can you elaborate more on this?</p>\n", "parentCommentId": "vTcHzui4HjmaZneTr", "user": {"username": "Peter_Hurford"}}, {"_id": "ZFpxu4P6SKDcyf7kc", "postedAt": "2017-10-10T17:23:14.598Z", "postId": "MrCjtdTxHvRzqu8fp", "htmlBody": "<p>There's definitely general intellectual rigor to be gained in the new areas the movement is drifting for, but it's not applied to doing good. That is, Google has great methods for maximizing efficiency, but thinking rigorously about doing good is different in significant ways, and the poverty world has been diligently working on that for a long time.</p>\n", "parentCommentId": "vTcHzui4HjmaZneTr", "user": {"username": "zdgroff"}}, {"_id": "ZaAsDsrD6vvaqo6ix", "postedAt": "2017-10-10T17:26:09.520Z", "postId": "MrCjtdTxHvRzqu8fp", "htmlBody": "<p>Additional data on EA shifts in cause area preference: <a href=\"http://effective-altruism.com/ea/1fi/have_ea_priorities_changed_over_time/\">http://effective-altruism.com/ea/1fi/have_ea_priorities_changed_over_time/</a></p>\n", "parentCommentId": null, "user": {"username": "Tee"}}]