[{"_id": "FYpXziYwfvTqmwXFW", "postedAt": "2023-03-18T07:44:45.798Z", "postId": "MrqM9XvJoKvyq6kxT", "htmlBody": "<p>Hi Henry,</p><p>A few notes:</p><ul><li>Even if hunter-gatherers globally were significantly less happy than current humans, we should expect some hunter-gatherer groups to be happier than the current mean human. The larger the number of hunter-gatherer groups we study, the higher the chance of getting unusually happy ones. I do not know whether the one you mention is an outlier or not.</li><li>I think wellbeing surveys which look into <a href=\"https://en.wikipedia.org/wiki/Affect_(psychology)\">affect</a> are more reliable than ones assessing <a href=\"https://en.wikipedia.org/wiki/Life_satisfaction\">life satisfaction</a>. In essence, because I am much more confindent on the ability of humans to assess their present state than the mean state over the past year (which is susceptible to lots of biases, like the <a href=\"https://en.wikipedia.org/wiki/Peak%E2%80%93end_rule\">peak-end rule</a>).</li><li>Even if wellbeing surveys are not great, increasing their adoption could be instrumentally valuable to increase the focus on wellbeing (i.e. conscious states, including non-hedonistic sounding ones like those related to relationships, freedom, and artistic expression), which is what ultimately matters.</li><li>I agree optimising for nearterm wellbeing may hinder logterm wellbeing. However, I believe measured related to existential risk are better proxies for longterm progress than health, wealth, and education. For example, for the risk of:<ul><li>Nuclear war, <a href=\"https://ourworldindata.org/grapher/nuclear-warhead-stockpiles\">number of nuclear warheads</a>.</li><li>Engineered pandemics, <a href=\"https://ourworldindata.org/grapher/cost-of-sequencing-a-full-human-genome\">cost of sequencing a full human genome</a>, and <a href=\"https://www.ecdc.europa.eu/en/immunisation-vaccines/vaccine-hesitancy\">vaccine hesitancy</a>.</li><li>Advanced AI, <a href=\"https://ourworldindata.org/ai-timelines\">AI timelines</a>.</li></ul></li><li>Assuming constant wellbeing per human per year, technogical progress could still be useful to increase the number of humans, and therefore increase the total wellbeing of all humans.</li></ul>", "parentCommentId": null, "user": {"username": "vascoamaralgrilo"}}, {"_id": "7oqzfAC39BzAtFx74", "postedAt": "2023-03-18T09:16:31.342Z", "postId": "MrqM9XvJoKvyq6kxT", "htmlBody": "<p>First I don't agree with your assumption that hunter gatherers might are likely their wellbeing the same as ours now. The best proxy we might have for \"hunter gatherers\" today is poorer, less developed countries. People in those &nbsp;countries have on average have <a href=\"https://www.researchgate.net/figure/Predicted-life-satisfaction-trends-across-the-lifespan-for-all-regions_fig1_337099595\">lower average wellbeing than richer countries</a>. My assumption would be in the other direction, that hunter gatherers would most likely rate their wellbeing lower than we would today.&nbsp;</p><p>I don't really understand your argument in this paragraph <i>\"Is the difference in WELLBYs significant enough to justify the hundreds of trillions of dollars and hours of effort and suffering (and negative WELLBYs) that have gone (and continue to go) into technological, economic and cultural development to give us our modern lives?&nbsp;</i></p><p>The answer surely is a resounding yes! If the hunter gatherers rated their wellbeing lower than us and our wellbeing has improved, then surely all that effort into \"technological economic and cultural development\" is completely worth it!</p>", "parentCommentId": null, "user": {"username": "NickLaing"}}, {"_id": "p4skYidv4zyAGc8im", "postedAt": "2023-03-18T15:47:16.754Z", "postId": "MrqM9XvJoKvyq6kxT", "htmlBody": "<p>I think the missing step here is that revealed preference suggest that most Sentinelese people would change their lives to become like us, but we wouldn't change to become like them. So the model doesn't predict what people actually <i>want</i>.</p>", "parentCommentId": null, "user": {"username": "nathan"}}, {"_id": "BEEGHc6zimywo9uza", "postedAt": "2023-03-18T17:53:14.088Z", "postId": "MrqM9XvJoKvyq6kxT", "htmlBody": "<p>I’m confused why you and everyone else in this thread are so quick to dismiss the idea that hunter gathers have more happiness/ life satisfaction/well being.</p>\n<p>This is not at all obvious to me.</p>\n", "parentCommentId": null, "user": {"username": "Charles_Guthmann"}}, {"_id": "GuJsc8LepuDtrj36f", "postedAt": "2023-03-18T17:54:54.400Z", "postId": "MrqM9XvJoKvyq6kxT", "htmlBody": "<p>Are you claiming that this would be a neccasary thing to prove or this is true but op didn’t include it. I would certainly consider becoming a hunter gatherer if I didn’t have an established life and friends and family</p>\n", "parentCommentId": "p4skYidv4zyAGc8im", "user": {"username": "Charles_Guthmann"}}, {"_id": "YFJRcpaow59De5pTM", "postedAt": "2023-03-18T20:53:05.088Z", "postId": "MrqM9XvJoKvyq6kxT", "htmlBody": "<p>I think that it may be helpful to unpack the nature of perceived happiness and wellbeing a little bit more than this post does. I think the idea of hedonic adaptation is pretty well known—most of us have probably heard of the hedonic treadmill (see Brickmann &amp; Campbell, 1971). The work on hedonic adaptation points to the fact that perceived happiness and wellbeing are relative constructs that largely depend on reference points which are invoked. To oversimplify things a little bit, if everyone around me is bad off, I may already be happy if I am only slightly better of than them. At the same time, I might be unhappy if I am pretty good off but everyone around me is much better off. As such, it is entirely reasonable to expect that hunter-gatherers &nbsp;when asked about their life feel quite good and happy about it as long as they don't feel like everyone else around them is much better off.&nbsp;</p><p>The conclusion of this post should not be that perceived happiness and wellbeing should not be used to compare the effects of interventions but that they simply measure something different than \"objective measures\". They aim to measure how people feel about their life in general as they compare it to others, not how they score on a particular metric in isolation. Whether you prefer one or the other approach largely depends on your perspective on what is valuable in life. Some people may find making progress on metrics that they find particularly valuable is the way to go and others prefer a more self-organizing perspective where the affected people themselves are more involved in determining what is valuable.</p><p>In sum, this post seems a little bit confused on what the WELLBY debate is about. I can recommend the cited article to get some idea on why something like a WELLBY approach may be interesting to consider even if one doesn't like it at first glance.</p><p>Brickman, P., &amp; Campbell, D. (1971). Hedonic relativism and planning the good society. In M. H. Appley (Ed.), <i>Adaptation-level theory: A symposium</i> (pp. 287–305). Academic Press. <a href=\"https://archive.org/details/adaptationlevelt0000unse_x7d9/page/287/mode/2up\">https://archive.org/details/adaptationlevelt0000unse_x7d9/page/287/mode/2up</a>&nbsp;</p>", "parentCommentId": null, "user": {"username": "alexherwix"}}, {"_id": "XqGBYcWAr4evbtueY", "postedAt": "2023-03-18T23:00:59.984Z", "postId": "MrqM9XvJoKvyq6kxT", "htmlBody": "<p>I agree that revealed preference and survey responses can differ.\nUnless WELLBYs take account of revealed preferences they'll fail to predict what people actually want</p>\n", "parentCommentId": "p4skYidv4zyAGc8im", "user": {"username": "Henry Howard"}}, {"_id": "W69DHAs6kvfpxpnrD", "postedAt": "2023-03-20T09:22:48.614Z", "postId": "MrqM9XvJoKvyq6kxT", "htmlBody": "<p>Just a short follow up: I just wrote a post on the hedonic treadmill and suggest that it is an interesting concept to reflect about in relation to life in general:&nbsp;</p><p><a href=\"https://forum.effectivealtruism.org/posts/WMaeBDPdSJLKDzk2d/the-hedonic-treadmill-dilemma-reflecting-on-the-stories-of-1\">https://forum.effectivealtruism.org/posts/WMaeBDPdSJLKDzk2d/the-hedonic-treadmill-dilemma-reflecting-on-the-stories-of-1</a>&nbsp;</p>", "parentCommentId": "YFJRcpaow59De5pTM", "user": {"username": "alexherwix"}}, {"_id": "JyCedZWuWzqRiGmtF", "postedAt": "2023-03-20T10:24:57.102Z", "postId": "MrqM9XvJoKvyq6kxT", "htmlBody": "<p><i>To caveat this:</i><br>If we have higher wellbeing, and they are trying to maximise wellbeing, then all these things align.<br>But people might not be maximising wellbeing or might not be good at it.&nbsp;</p>", "parentCommentId": "p4skYidv4zyAGc8im", "user": {"username": "Samuel Dupret"}}, {"_id": "Bz85Xup3ywMwCrrEP", "postedAt": "2023-03-20T11:09:25.214Z", "postId": "MrqM9XvJoKvyq6kxT", "htmlBody": "<p>Hello Henry,</p><p>Thank you for presenting this thought experiment.&nbsp;</p><p>The core here is about whether groups like the Sentinelese who do not have the same levels of development as others would give similar levels of SWB. I think the other comments here have done a great job at pointing out possible explanations.</p><ul><li>if Sentinelese have =&gt; wellbeing<ul><li>maybe their lifestyle works really well for their wellbeing (as <a href=\"https://forum.effectivealtruism.org/posts/MrqM9XvJoKvyq6kxT/why-i-m-suss-on-wellbeing-surveys?commentId=BEEGHc6zimywo9uza\">Charlie</a> mentions, we might not want to be too quick to dismiss this possibility). It would be a cool area to research.</li><li>maybe there are issues of interpersonal comparability in scale use, which is what we are exploring <a href=\"https://forum.effectivealtruism.org/posts/cpYR9TsG8BdtETo6u/can-we-trust-wellbeing-surveys-a-pilot-study-of\">with our pilot</a>.</li><li>maybe they have access to factors (e.g., social ties) that improve wellbeing without being affected as much by reference frames (e.g., the benefit I get from a higher income is relative to other people) &nbsp;or hedonic adaptation (as pointed out by <a href=\"https://forum.effectivealtruism.org/posts/MrqM9XvJoKvyq6kxT/why-i-m-suss-on-wellbeing-surveys?commentId=YFJRcpaow59De5pTM\">Alex</a>).</li></ul></li><li>if Sentinelese have &lt; wellbeing<ul><li>As <a href=\"https://forum.effectivealtruism.org/posts/MrqM9XvJoKvyq6kxT/why-i-m-suss-on-wellbeing-surveys?commentId=7oqzfAC39BzAtFx74\">Nick</a> pointed out, countries with lower levels of development tend to have lower levels of LS. [edit: adding this figure here because it represents this well and supports the validity of SWB scales]<img src=\"https://res.cloudinary.com/cea/image/upload/v1673956108/mirroredImages/dk48Sn6hpbMWeJo4G/cqrrjdxookmvwdtu6fsr.png\" alt=\"\"></li><li>It might be well worth the investment (especially as <a href=\"https://forum.effectivealtruism.org/posts/MrqM9XvJoKvyq6kxT/why-i-m-suss-on-wellbeing-surveys?commentId=FYpXziYwfvTqmwXFW\">Vasco</a> pointed out, it can increase the number of humans and life expectancy)</li><li>It is possible that whilst our development reached a point where we have higher wellbeing, it did so through inefficient periods and our task now is to think more carefully about how to do (and whether there are adverse consequences like climate change, x-risks, etc.)</li></ul></li></ul><p>&nbsp;</p><p>Some briefs answers / pointers. Many of these things have been discussed in more details elsewhere.</p><ul><li>The estimate for grief is shallow [edit: I want to make this point a bit stronger - this was a quick estimate and it is a tad unfair to compare it to the SM estimate which represents hundreds of hours of work and meta-analyses] but important in making the difficult work of live-saving vs life-improving accurate. You can see <a href=\"https://forum.effectivealtruism.org/posts/uY5SwjHTXgTaWC85f/don-t-just-give-well-give-wellbys-hli-s-2022-charity?commentId=M7WCzmt6vmwXaCuhA\">some discussion about it</a> from my colleague. I, personally, wouldn't be too surprised if we found a higher estimate in the future but there is some reasoning as to why this might not be as big.</li><li>I don't think there are 'objective' measures of health widely used. DALYs and QALYs are <i>not</i> objective, they rely on humans reports - and contrary to SWB, these are reports about things humans are know to struggle to report on. In DALYs it is people (who do not have the conditions!) making binary judgements about which conditions are more or less healthy. In QALYs it generally involves people forecasting how their life will be in the future. See <a href=\"https://forum.effectivealtruism.org/posts/dk48Sn6hpbMWeJo4G/to-wellby-or-not-to-wellby-measuring-non-health-non\">To WELLBY or not to WELLBY</a> where we discuss the strengths and weaknesses of SWB.&nbsp;</li><li>health, wealth, education, are all instrumental. Why do we want these? Because they contribute to what we believe is ultimately good for humans. <a href=\"https://forum.effectivealtruism.org/posts/8whqn2GrJfvTjhov6/measuring-good-better-1\">Most charity evaluators give there answer in some form of wellbeing / good</a>, either by measuring SWB as directly as possible (HLI) or converting lives and income into the moral weights of the evaluators (GW).</li><li>There is extensive debate about the relationship between SWB and growth through the lens of the <a href=\"https://forum.effectivealtruism.org/posts/coryFCkmcMKdJb7Pz/does-economic-growth-meaningfully-improve-well-being-an\">Easterlin Paradox</a></li></ul>", "parentCommentId": null, "user": {"username": "Samuel Dupret"}}, {"_id": "ZsyvNSsxDcX6aTx9Z", "postedAt": "2023-03-20T12:22:56.127Z", "postId": "MrqM9XvJoKvyq6kxT", "htmlBody": "<p>Well said. I share <a href=\"https://forum.effectivealtruism.org/users/henry-howard-1?mention=user\">@Henry Howard</a> 's reservations about WELLBYs, but I would argue that even if WELLBY comparisons are near-meaningless between New Yorkers and Sentinelese, they are probably much more meaningful when comparing one individual's wellbeing before and after treatment, or even comparing control and intervention groups drawn randomly from the same population.</p>", "parentCommentId": "YFJRcpaow59De5pTM", "user": {"username": "Stan Pinsent"}}, {"_id": "jAQyCA6bgXgxCAGKb", "postedAt": "2023-03-20T21:09:14.553Z", "postId": "MrqM9XvJoKvyq6kxT", "htmlBody": "<p>No it's not obvious, but the implications are absurd enough (agricultural revolution was a mistake, cities were a mistake) that I think it's reasonable to discard the idea</p>\n", "parentCommentId": "BEEGHc6zimywo9uza", "user": {"username": "Henry Howard"}}, {"_id": "ZkzQfeDmms9F5rL27", "postedAt": "2023-03-20T21:20:12.887Z", "postId": "MrqM9XvJoKvyq6kxT", "htmlBody": "<p>The way you describe WELLBYs - as being heavily influenced by the hedonic treadmill and so potentially unable to distinguish between the wellbeing of the Sentinelese and the modern Londoner - seems to highlight their problems.\nThere's a good chance a WELLBY analysis would have argued against the agricultural revolution, which doesn't seem like a useful opinion.</p>\n", "parentCommentId": "YFJRcpaow59De5pTM", "user": {"username": "Henry Howard"}}, {"_id": "2teXkB46ryw3wtau4", "postedAt": "2023-03-20T22:23:37.100Z", "postId": "MrqM9XvJoKvyq6kxT", "htmlBody": "<p>Depending on what you mean by mistake I don’t think those implications are absurd at all.</p>\n<p>The agricultural revolution wasn’t a decision humanity made, it’s game theory. More resources, more babies, and your ideas survive.</p>\n<p>I’m not even saying that modernization was a mistake, which btw we could be less happy and i would still not necessarily say it was a mistake (again, depending on what you mean by mistake). It’s just that I think you are anthropromorphizing  cultural natural selection as a  well thought out decision with the intention of maximizing current utility.</p>\n", "parentCommentId": "jAQyCA6bgXgxCAGKb", "user": {"username": "Charles_Guthmann"}}, {"_id": "Q3e7r4PYTenLqunKm", "postedAt": "2023-03-21T18:19:17.170Z", "postId": "MrqM9XvJoKvyq6kxT", "htmlBody": "<p>To me it seems like you have a wrong premise. A wellbeing focused perspective is explicitly highlighting the fact that Sentinelese and the modern Londoners may have similar levels of wellbeing. That's the point! This perspective aims to get you thinking about what is really valuable in life and what the grounds for your own beliefs about what is important are.&nbsp;</p><p>You seem to have a very strong opinion that something like technological progress is intrinsically valuable. Living in a more technically advanced society is \"inherently better\" and, thus, everyone who does not see this is \"objectively wrong\". That argument would seem strange to even the most orthodox utilitarian. &nbsp;Even if your argument is a little bit more nuanced in the sense that you are seeing technological progress only as instrumentally valuable to sustain larger population sizes at similar levels of wellbeing, this perspective is still somewhat naive because technological progress also has potentially devastating consequences such as climate change or AI risks. In that sense, one can actually make the case that the agricultural revolution was maybe the beginning of the end of the human race. So maybe if there would have been a way to grow our societies more deliberately and to optimize for wellbeing (rather than economic growth) from the beginning, it wouldn't have been such a bad idea? I just want to illustrate that the whole situation is not as clear cut as you make it out to be.</p><p>Altogether, I would encourage you to keep more of an open mind regarding other perspectives. The post but also this comment of yours make it seem like you might be very quick in dismissing perspectives and being vocal about it even if you have not really engaged with them deeply. This makes you come across as naive to a somewhat more knowledgeable person which could put you at a personal disadvantage in the future and, in addition, could also be contributing to bad epistemics in your community if the people you are talking to are less informed and, thus, not able to spot where you might be cutting corners. Hope you don't resent me for this personal side note, it's meant in a constructive spirit.</p>", "parentCommentId": "ZkzQfeDmms9F5rL27", "user": {"username": "alexherwix"}}]