[{"_id": "t8npgqirBxGwo5yeh", "postedAt": "2023-09-07T11:09:27.662Z", "postId": "Mt6eCHgDmfqJTfdht", "htmlBody": "<p>Is the goal to have an international focus? If so could you go more into detail about your vision and plans?</p>\n<p>If not then I'm a bit confused about how you're planning on distinguishing yourself from <a href=\"http://Giveffektivt.dk\">Giveffektivt.dk</a></p>\n", "parentCommentId": null, "user": {"username": "MathiasKirkBonde"}}, {"_id": "WKWcumPwhYPbr87qE", "postedAt": "2023-09-07T11:50:04.136Z", "postId": "Mt6eCHgDmfqJTfdht", "htmlBody": "<blockquote>\n<p>If not then I'm a bit confused about how you're planning on distinguishing yourself from <a href=\"http://Giveffektivt.dk\">Giveffektivt.dk</a></p>\n</blockquote>\n<p>Whilst I would agree that orgs, like businesses, should have a unique value proposition. I think there's a bias against competition between orgs in EA - which I think your comment is an expression of - and this bias is unhelpful. Competition seems to help all parties achieve a better product and a better service, and in think for this reason should be assumed to be a good as a default.</p>\n", "parentCommentId": "t8npgqirBxGwo5yeh", "user": {"username": "ElliotJDavies"}}, {"_id": "azKh3FeL3dDLtd3Cu", "postedAt": "2023-09-07T12:12:28.634Z", "postId": "Mt6eCHgDmfqJTfdht", "htmlBody": "<p>I'm am all for competition! If their answer is: \"We think giveffektivt.dk sucks and we can do way better\" and provide compelling reasons I am happy to support that effort.</p><p>But when someone wants me to invest in their startup, I want to understand what they will do and why there is a market for that.</p>", "parentCommentId": "WKWcumPwhYPbr87qE", "user": {"username": "MathiasKirkBonde"}}, {"_id": "gjr24WY5ryLH3wt4P", "postedAt": "2023-09-11T14:05:59.389Z", "postId": "Mt6eCHgDmfqJTfdht", "htmlBody": "<p>Our goal is to expand and have an international focus, not only focus on Denmark. We are also trying to get more people to give to effective charities but we recognize that some donors seek a donor experience where they get a deeper understanding of the impact they are providing, not just by knowing that \"this is the most effective impact I can create with my donations\".&nbsp;</p><p>We have teamed up with each charity individually and they will consistently create impact stories and updates for our community of donors. Also, they will take part in educational and awareness related activities and help provide engaging content for the donor community.</p><p>Lastly, we are working on new ideas of how to scale our donorbase. Typically, this has been done organically and through events, but we are working on integrating to salary platforms so that they can provide automated donations through payslips for their clients and the client's employees.</p><p>A note on giveffektivt.dk; since we have started working on DGM, we have been in contact with the team. They have helped us get off the ground from day 1 and we are continuously having dialogues on how we best can help each other.<br>Our common goal is simple; whether the donations to effective charities go through DGM or giveffektivt.dk is less important.</p>", "parentCommentId": null, "user": {"username": "Jacob Steinitz"}}]