[{"_id": "H9vedypd9aTwywMjv", "postedAt": "2022-10-10T18:00:20.207Z", "postId": "MtD5S58nyuZt4toCg", "htmlBody": "<p>Ada-Maaria -- this is generally good advice.</p><p>Some evolutionary psychologists such as <a href=\"https://www.amazon.com/Good-Reasons-Bad-Feelings-Evolutionary-ebook/dp/B078VXFZCX\">Randy Nesse</a> and <a href=\"https://www.amazon.com/Overcoming-Depression-Books-Prescription-Title-ebook/dp/B00OGV2PH0/\">Paul Gilbert</a> have offered some useful perspectives on depression, feelings of worthlessness, and suicidal impulses.</p><p>A common theme is that our brains evolved to process social cues of our net helpfulness versus burdensomeness towards close family, friends, and clan (NOT towards humanity as a whole, or towards all future sentient beings in the light cone). &nbsp;</p><p>If we feel like a net burden to the people closest to us, we often feel quite low; if we feel useful and like we're adding value to their lives, that's quite protective against depression.</p><p>So, it might be quite difficult to 'hack' our mood psychology just by trying to convince ourselves that we've saved X number of lives in the abstract, and that therefore this makes us worthy. Instead, it might be more effective to try to engage more with those closest and most salient to us -- housemates, workmates, siblings, parents, kids, old friends, etc. And often the most mood-lifting thing is not to ask these people for help, but rather to offer them help in whatever specific things they're trying to accomplish.</p>", "parentCommentId": null, "user": {"username": "geoffreymiller"}}, {"_id": "NJEnvLJW6ruDWSceW", "postedAt": "2022-10-11T00:27:22.040Z", "postId": "MtD5S58nyuZt4toCg", "htmlBody": "<p>Great tip, Geoffrey - hadn't heard this before, look forward to trying it.</p>", "parentCommentId": "H9vedypd9aTwywMjv", "user": {"username": "Emily Dardaman"}}, {"_id": "yKCjxfpzWjDyjcKSZ", "postedAt": "2022-10-11T00:32:42.378Z", "postId": "MtD5S58nyuZt4toCg", "htmlBody": "<p>Great post. EA is a mixed blessing for the many folks who tend toward anxiety. There's always something more to be thinking about, always a career plan to sharpen, always more to donate. Guideposts like this one can help folks manage the firehose and make EA &nbsp;healthier &amp; more sustainable than other social impact communities. I'm thinking of 2017ish Climate Twitter, which kept saying something like \"to exist as a person is a crime against the planet.\"</p><p>One question : \"a person’s right to be alive is not tied to their past or future altruistic impact.\" I agree with that statement but haven't heard much of a philosophical justification for it. Do you know where I could learn more about the idea of intrinsic worth and how it relates to consequentialist morality?</p>", "parentCommentId": null, "user": {"username": "Emily Dardaman"}}, {"_id": "TPGyDnkRFsZFGJa7q", "postedAt": "2022-10-11T21:22:43.410Z", "postId": "MtD5S58nyuZt4toCg", "htmlBody": "<p><a href=\"https://forum.effectivealtruism.org/posts/AjxqsDmhGiW9g8ju6/effective-altruism-in-the-garden-of-ends\">https://forum.effectivealtruism.org/posts/AjxqsDmhGiW9g8ju6/effective-altruism-in-the-garden-of-ends</a></p>\n<p>This post is a deep dive that explores this perspective.</p>\n<p>I feel very torn regarding these points because I believe they are fundamentally at odds with my beliefs as a utilitarian. I believe that the vast majority of most agent's value can be instrumental and we probably should primarily, on a bird's eye view, view our happiness as primarily useful toward serving to better the world.</p>\n<p>Of course, we are moral patients too, but our consideration is dwarfed by our power.</p>\n", "parentCommentId": null, "user": {"username": "Brad West"}}, {"_id": "KXWFvzMCC5Arrt3zt", "postedAt": "2022-10-12T05:36:17.539Z", "postId": "MtD5S58nyuZt4toCg", "htmlBody": "<p>Interesting perspective! I have definitely noticed how mood-lifting it can be to help others, especially if it is something I can do easily (such as translating a phrase to a coworker from a language they don't speak).<br><br>I also notice I am somewhat wary of using helping close ones as a form of emotional regulation because I've seen a fair share of co-dependency issues of different levels. Mostly in the form where someone gets closer to a person who is not doing that well, tries to take care of them and ends up in a space where their own mood is largely dictated by how the loved one feels. I'm wondering if that also has some roots in evolutionary psychology or if it is just \"overdoing\" the method you suggested.</p>", "parentCommentId": "H9vedypd9aTwywMjv", "user": {"username": "Ada-Maaria Hyvärinen"}}, {"_id": "xjE2jjHaZW9YfGDKS", "postedAt": "2022-10-12T12:25:09.998Z", "postId": "MtD5S58nyuZt4toCg", "htmlBody": "<p>Yeah. Though for a utilitarian it could still be instrumentally good to believe the points in this post, at least on an emotional level. But lying to yourself is plausibly a bad norm for other reasons, and in any case, this type of reasoning is the exact thing the post is arguing against.</p>", "parentCommentId": "TPGyDnkRFsZFGJa7q", "user": {"username": "Winston"}}, {"_id": "FAGndmoXRcevDDiMT", "postedAt": "2022-10-12T14:52:31.058Z", "postId": "MtD5S58nyuZt4toCg", "htmlBody": "<p>I am not the best person to recommend you readings in philosophy, but I can try to elaborate on how I understand this sentence to refer to some common consequentialist perspectives. I hope I'm not repeating something that is already obvious to you.</p><ul><li>as I understand it, from the point of utilitarianism this sentence is not true (since it describes a \"right\" to live and utilitarianism is not a rights-based ethical system)</li><li>but in (total hedonistic) utilitarianism, the net-positive experience of being alive and happy has value. In this sense, the person being alive and happy is intrinsically valuable, but not because it is their right to live. Seeing moral patients as \"containers\" of happiness is a common criticism of utilitarianism. (I have also had anxiety over \"but since I'm constantly sad does utilitarianism then tell me I should remove myself from the pool of sentient beings, what if the sum of total happiness is getting lower because of me\". But realistically my life experience has not been net negative so far.)</li><li>so I do not recommend basing your (sense of) a right to existence on utilitarianism (you cannot base your right to anything on utilitarianism)</li><li>but I feel like some people who are strongly drawn to utilitarianism can benefit from reconnecting to the sense of the intrinsic value of their own happiness, not just the instrumental value of it, and I think some people in EA are almost afraid to do so out of fear that this would make them (too) egoistic/partial</li></ul>", "parentCommentId": "yKCjxfpzWjDyjcKSZ", "user": {"username": "Ada-Maaria Hyvärinen"}}, {"_id": "9LizLDXsrHw8JNabW", "postedAt": "2022-10-12T16:22:33.554Z", "postId": "MtD5S58nyuZt4toCg", "htmlBody": "<p>Really thoughtful responses, thank you. I tend to think the idea of intrinsic worth popular in the West stems from Christian influence but haven't found defense for it outside Christian frameworks</p>", "parentCommentId": "FAGndmoXRcevDDiMT", "user": {"username": "Emily Dardaman"}}]