[{"_id": "b53hKTy9KB75BFMrF", "postedAt": "2023-01-04T20:40:25.938Z", "postId": "MummPEPqZuhmSeHSz", "htmlBody": "<p>I have a fidelity DAF linked to my fidelity brokerage account and my only complaint is that there is a small cost associated with it. I of course understand why that is, and the tax benefits outweigh the cost. But if there was a nonprofit EA aligned DAF that had lower or no cost that would be preferable obviously.&nbsp;<br><br>One other thought - and this isn't a complaint about a DAF exactly - is that it would be great to be able to set rules about when certain appreciated stocks would be donated to the DAF so I could totally \"set it and forget it\" -- I described this idea at the <a href=\"https://forum.effectivealtruism.org/posts/GYcD5AzKsJeyHL6c3/using-the-tax-system-and-stock-market-to-donate-more-a-few#Possible_project__EA_robo_adviser\">end of this post.</a></p>", "parentCommentId": null, "user": {"username": "BenSchifman"}}, {"_id": "abErxgzviEsXRpshy", "postedAt": "2023-01-04T21:09:06.848Z", "postId": "MummPEPqZuhmSeHSz", "htmlBody": "<p>I consistently recommend Fidelity to others when talking about DAFs. Here's <a href=\"https://www.aaronhamlin.com/articles/donor-advised-funds-awesome-giving-tools\">an article I did on DAFs</a>.<br><br>Why <a href=\"https://www.fidelitycharitable.org/\">Fidelity Charitable</a>?</p><ol><li>They're the largest DAF in the world and have efficient internal processes. They approve pretty much everything and if it's new or controversial to them, they get back to you quickly.&nbsp;</li><li>They make direct transfers to the charity's bank account. You don't want some check just flying around. Many banks send off paper checks. No need for that nonsense.</li><li>They also handle cryptocurrency, which is nice. There may be some extra paperwork, but it's largely quite useful.</li><li>Their fees are low. If you quickly donate from your account anyway, there's nothing to really get hit with. If you leave funds in there, minimal investments should cover any fee. Remember that the job of a DAF is not to have it sit around and make more money. You do that with investments before they go into the DAF.</li><li>They make it easy to transfer assets to the DAF from other banks. If you use Fidelity already, it's even easier. They even have a tool that lets you see the most tax-efficient stocks to give (It looks at the most appreciated stocks you've held over a year).</li></ol><p>Bonus tip:<br>Don't forget to set a charitable beneficiary for your DAF, just as you can do for any other financial account.</p>", "parentCommentId": null, "user": {"username": "aaronhamlin"}}]