[{"_id": "Dhth2GQ4RZkbkzMyM", "postedAt": "2023-09-08T17:15:56.280Z", "postId": "MvwctfyZ9NrhPzyPj", "htmlBody": "<p>I think I largely agree with this list, and want to make a related point, which is that I think it's better to start with an organizational culture that errs on the side of being too professional, since 1) I think it's easier to relax a professional culture over time than it is to go in the other direction and 2) the risks of being too professional generally seem smaller than the risks of being insufficiently professional.</p>", "parentCommentId": null, "user": {"username": "hobbes"}}, {"_id": "t9cMC6Rv8atAFPLBH", "postedAt": "2023-09-08T17:30:46.452Z", "postId": "MvwctfyZ9NrhPzyPj", "htmlBody": "<p>Thank you for sharing this. I think that this is a great way to encourage more conversation about these practices/behaviors.</p>", "parentCommentId": null, "user": {"username": "jlemien"}}, {"_id": "qphjJGvFAZPeDe96k", "postedAt": "2023-09-08T17:57:10.328Z", "postId": "MvwctfyZ9NrhPzyPj", "htmlBody": "<p>While I broadly agree with Rocky's list I want to push back a little vs. your points:</p>\n<p>Re your (2): I've found that small entities are in a constant struggle for survival, and must move fast and focus on the most important problems unique to their ability to make a difference in the world. Small-seeming requirements like \"new hires have to find their own housing\" can easily make the difference between being able to move quickly vs. slowly on some project that makes or breaks the company. I think for new entities the risks of incurring large costs before you have 'proven yourself' are quite high.</p>\n<p>My experience also disagrees with your (1): As my company has grown, we have had many forces naturally pushing in the direction of \"more professional\": new hires tend to be much more worried about blame about doing things too quick-and-dirty rather than incurring costs on the business in order to do things the buttoned-up way; I've stepped in more often to accept a risk rather than to prevent one although I certainly do both!</p>\n<p>(Side note: as a potential counterpoint to the above, I do note that Alameda/FTX was clearly well below professional standards at &gt;200 employees - my assumption is that Sam/execs were constantly stepping in to keep the culture the way they wanted it. If I learned that somehow most of the 200 employees were pushing in the direction of less professionalism on their own, I would update to agree with you on (1).)</p>\n", "parentCommentId": "Dhth2GQ4RZkbkzMyM", "user": {"username": "lincolnq"}}, {"_id": "nxLtifMvZWMRhJ65j", "postedAt": "2023-09-08T18:08:56.223Z", "postId": "MvwctfyZ9NrhPzyPj", "htmlBody": "<p>I think this pushes a set of norms as a fait accomplis when many seem murkier to me. In particular, among the things you think are clearly a risk are several situations that I do not think orgs should have on their risk list unless there are other external reasons.</p><ul><li>Live with coworkers if there is no reporting issue or power differentials</li><li>Date coworkers if there is no reporting issue or power differentials</li><li>Promote stimulant use can be fine in some cases - eg \"have you considered getting an ADHD diagnosis, maybe try mine for a day and see how you feel\"</li></ul><p>Can we wait a bit after the current complex discussion before pushing out lists of norms that are hard to disagree with publicly. &nbsp;</p><p><i>Edit </i>Thank you <a href=\"https://forum.effectivealtruism.org/users/rockwell?mention=user\">@Rockwell</a> for starting the discussion. Apologies for being a bit grumpy above.</p>", "parentCommentId": null, "user": {"username": "nathan"}}, {"_id": "QHxFvEkwerJgy4M4n", "postedAt": "2023-09-08T18:16:39.067Z", "postId": "MvwctfyZ9NrhPzyPj", "htmlBody": "<p>Thanks for your perspective on this!</p><blockquote><p>Small-seeming requirements like \"new hires have to find their own housing\" can easily make the difference between being able to move quickly vs. slowly on some project that makes or breaks the company.</p></blockquote><p>Do you have an example of this? It is surprising to me that maintaining reasonable/standard professional norms could actually sink a company. (Among other things because at a small company, you have limited manpower, and so personnel time devoted to helping someone find housing is presumably coming out of time spent somewhere else—i.e., working on the time-sensitive project.)</p><blockquote><p>1): As my company has grown, we have had many forces naturally pushing in the direction of \"more professional\": new hires tend to be much more worried about blame about doing things too quick-and-dirty rather than incurring costs on the business in order to do things the buttoned-up way; I've stepped in more often to accept a risk rather than to prevent one although I certainly do both!</p></blockquote><p>I suspect we're just defining \"professional\" differently here (or thinking about really different professional contexts), but my experience is pretty strongly informed by having worked in an office pre-COVID, and seeing how profoundly professional culture has eroded, and how hard it has been to build any of that back. I think grad students/academics who have taught undergrads post-COVID have also been struck by this: it seems like norms within education quickly (and understandably!) became quite lax during COVID, but it's been quite difficult to <i>reverse</i> those changes (i.e., get students to turn stuff in on time, respond to emails, show up to mandatory events, etc). That said, I know that older people have <i>always </i>tended to think that the youth are a bunch of degenerates, so plausibly that's coloring our perception here, too.</p>", "parentCommentId": "qphjJGvFAZPeDe96k", "user": {"username": "hobbes"}}, {"_id": "joqdi8FwZGEgExLcn", "postedAt": "2023-09-08T18:50:12.339Z", "postId": "MvwctfyZ9NrhPzyPj", "htmlBody": "<blockquote><blockquote><p>Small-seeming requirements like \"new hires have to find their own housing\" can easily make the difference between being able to move quickly vs. slowly on some project that makes or breaks the company.</p></blockquote><p>Do you have an example of this? It is surprising to me that maintaining reasonable/standard professional norms could actually sink a company. (Among other things because at a small company, you have limited manpower, and so personnel time devoted to helping someone find housing is presumably coming out of time spent somewhere else—i.e., working on the time-sensitive project.)</p></blockquote><p>I don't want to speak for Lincoln, but it straightforwardly seems obvious to me that if you need non-Senegalese employees to do a stint in Senegal (already a pretty high ask for some<a href=\"https://www.jefftk.com/p/whats-next\"> people</a>), providing housing (and other amenities you don't usually need to provide if your employees are working out of metropolitan areas in their home countries) is more likely to ease the transition. You might believe that the risks are so high that it's not worth the benefits, but the benefits are definitely real.</p>", "parentCommentId": "QHxFvEkwerJgy4M4n", "user": {"username": "Linch"}}, {"_id": "wL5cRSwFEdgiZzwyc", "postedAt": "2023-09-08T18:50:43.692Z", "postId": "MvwctfyZ9NrhPzyPj", "htmlBody": "<p>Some of these seem fine to me as norms, some of them seem bad. Some concrete cases:&nbsp;</p><blockquote><p>Live with coworkers, especially when there is a power differential and especially when there is a direct report relationship</p></blockquote><p>Many startups start from someone's living room. LessWrong was built in the Event Horizon living room. This was great, I don't think it hurt anyone, and it also helped the organization survive through the pandemic, which I think was quite good.</p><blockquote><p>Retain someone as a full-time contractor or grant recipient for the long term, especially when it might not adhere to legal guidelines</p></blockquote><p>I don't understand this. There exist many long-term contracting relationships that Lightcone engages in. Seems totally fine to me. Also, many people prefer to be grant recipients instead of employees, those come with totally different relationship dynamics.</p><blockquote><p>Offer employer-provided housing for more than a predefined and very short period of time, thereby making an employee’s housing dependent on their continued employment and allowing an employer access to an employee’s personal living space</p></blockquote><p>I also find this kind of dicey, though at least in Lightcone's case I think it's definitely worth it, and I know of many other cases where it seems likely worth it. We own a large event venue, and we are currently offering one employee free housing in exchange for being on-call for things that happen in the night. This seems like a fair trade to me and very standard (one of the sections of our hotel is indeed explicitly zoned as a \"care-taker unit\" for this exact purpose).&nbsp;</p><blockquote><p>Date the partner of their funder/grantee, especially when substantial conflict-of-interest mechanisms are not active</p></blockquote><p>This seems really quite a lot too micromanagey to me. I agree that there should be COI mechanisms in place, but this seems like it's really trying to enforce norms on parts of people's lives that really are their business.</p>", "parentCommentId": null, "user": {"username": "Habryka"}}, {"_id": "jaFpuXjyX7DxTXaik", "postedAt": "2023-09-08T18:53:49.571Z", "postId": "MvwctfyZ9NrhPzyPj", "htmlBody": "<blockquote><p>In particular, among the things you think are clearly a risk are several situations that I do not think orgs should have on their risk list unless there are other external reasons [...]</p><ul><li>Date coworkers if there is no reporting issue or power differentials</li></ul></blockquote><p>Hmm if you have a five-person org, I feel like it straightforwardly is a risk factor if one of the employees date each other. This is true even if both of them are individual contributors, there are no power differentials, etc.</p><p>It matters much less (arguably ~0) at say Google's scale if a random data analyst working on Google Ads is dating a random software engineer working on Google Cloud. I'm not sure where the cutoff is, anything from 20 to 200 seems defensible to me.&nbsp;</p><p>You might believe that the <i>ceteris paribus </i>risk is not worth correcting for due to other values or pragmatics (professionalism norms against intruding on employees' personal lives; thinking that the costs of breaking up a relationship is greater than the benefits you gain from the reduced organizational risk<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefisqjbw65dv\"><sup><a href=\"#fnisqjbw65dv\">[1]</a></sup></span>, etc). But it absolutely is a risk.</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnisqjbw65dv\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefisqjbw65dv\">^</a></strong></sup></span><div class=\"footnote-content\"><p>for starters, I expect a reasonable fraction of those conversations to end with one of the employees quitting the company.</p></div></li></ol>", "parentCommentId": "nxLtifMvZWMRhJ65j", "user": {"username": "Linch"}}, {"_id": "un3JZWQ5iXw6noHj9", "postedAt": "2023-09-08T19:54:13.057Z", "postId": "MvwctfyZ9NrhPzyPj", "htmlBody": "<p>Fair enough! I think this discussion is being harmed by ambiguity about the behaviors we're talking about (this is my fault; my posts have been unclear). I don't think I'd classify \"helping new hires find housing\" as violating \"standard/reasonable professional norms.\"&nbsp;</p><p>I'm mainly thinking about the kinds of behaviors EAs engage in that are described in the above post (and my general heuristics about the kinds of practices that are normalized in the EA community). I do think that if you're asking yourself something like \"Should I live with my employee who has less power than me?\" or \"Should I use drugs with these colleagues?\" it is better to err on the side of not doing this kind of stuff, at least at first. If after a year of working with people, you all decide to start smoking weed together, that strikes me as probably pretty innocuous (versus if you had established this kind of culture at the outset).&nbsp;</p>", "parentCommentId": "joqdi8FwZGEgExLcn", "user": {"username": "hobbes"}}, {"_id": "eD8sbnPyhvbeqTQMF", "postedAt": "2023-09-08T20:24:56.641Z", "postId": "MvwctfyZ9NrhPzyPj", "htmlBody": "<blockquote><p>I don't understand this. There exist many long-term contracting relationships that Lightcone engages in. Seems totally fine to me. Also, many people prefer to be grant recipients instead of employees, those come with totally different relationship dynamics.</p></blockquote><p>Just to hopefully quickly clarify this point in particular: There is a legal distinction between full-time employees and contractors that has <a href=\"https://www.irs.gov/affordable-care-act/employers/identifying-full-time-employees\">legal implications</a>, and I think EA orgs somewhat frequently misclassify. It's totally possible Lightcone has long-term contractor or grant recipient relationships that are fully above board and happy for all involved; however, I know some organizations do not. This can be a cost-saving mechanism for the organization that comes at the expense of not just their adherence to employment law, but also security for their team (e.g. everything from eligibility for benefits, to increased individual tax burden, to ineligibility for unemployment compensation).</p>", "parentCommentId": "wL5cRSwFEdgiZzwyc", "user": {"username": "Rockwell Schwartz"}}, {"_id": "6EYBoT2ZkuQsrQqHv", "postedAt": "2023-09-08T20:31:49.753Z", "postId": "MvwctfyZ9NrhPzyPj", "htmlBody": "<p>Rockwell - these norms might sound fair, reasonable, and helpful, at first glance.</p><p>But they show, IMHO, a strong latent sex-negativity, drug-negativity, and cohousing-negativity that is the diametrical opposite of EA's traditional subculture -- at least until recent years, when 'safetyism' seems to have become prioritized over fun, collegiality, and alternative lifestyles.</p><p>Take the issue of 'power differentials', for example. Some people are really attracted to people who are more powerful, higher status, higher prestige, more influential, more famous, wealthier, and/or older. (There is a LOT of psychological research on these kinds of status-seeking mate preferences, which are very common across cultures.) Such people might prefer to 'date coworkers', especially when there is a power differential. This is especially true for the significant proportion of people involved in 'power exchange' relationships (e.g. the BDSM subculture, including Dom/sub relationships). (This is salient to me because I teach Human Sexuality courses at college, and I do research on anti-BDSM and anti-polyamory stigma and prejudice).</p><p>So, prohibiting 'power-differential dating' sounds extra 'safe' at first glance. But it would marginalize and stigmatize everybody who's already in a 'power-differential' relationship, or who wants to be -- especially among people who take their EA identity seriously, and who would prefer to date other EAs. (Also, of course, stigmatizing 'power-differential dating' often boils down to ageism, and the stigmatization of relationships that involve 'age gaps'.)</p><p>Likewise with the notion that EAs should never promote drug use among coworkers, including legal drugs, and alcohol. Let's be honest here. The expansion of many of our 'moral circles' involved psychedelic experiences that allowed us to think about animal sentience, AI, long-termism, and future people in new ways. For those of us with Aspergers (like me) or other autism-spectrum traits, psychoactive drugs such as MDMA helped us develop empathy, compassion, and capacities for social perspective-taking and connection. For those of us with social awkwardness and introversion, light recreational drugs such as alcohol, cannabis, or modafinil can be crucial in loosening up enough to make friends and network at parties and social events. If EA strongly discourages substance use in all EA-adjacent social events, cohousing communities, and friendship circles, then we may be socially handicapping everyone who isn't neurotypical extrovert.... and we may be keeping our moral circles from growing.</p><p>So, in short, I think for any proposed changes to EA subculture norms, we should think very carefully about how these new norms might affect the full range and diversity of people involved in EA, given their actual preferences, experiences, and relationships.&nbsp;</p><p>And we should think about whether the new norms are contrary to the traditions of the EA subculture as it's developed over the last dozen years. In my view, EA is a wonderful subculture, full of fascinating and principled people, with unique perspectives and priorities, and I think this has been due, in no small measure, to the relatively sex-positive, drug-positive, and cohousing-positive features of 'Trad EA' culture.</p>", "parentCommentId": null, "user": {"username": "geoffreymiller"}}, {"_id": "NmYQavdvXjzvF8QRK", "postedAt": "2023-09-08T21:01:00.676Z", "postId": "MvwctfyZ9NrhPzyPj", "htmlBody": "<p>(Speaking for myself, in a personal capacity) When I see posts like this, I'm more than a bit confused about which funder/grantee relationships people are thinking about should be included.</p><blockquote><ul><li>Live with their funders/grantees, especially when substantial conflict-of-interest mechanisms are not active</li><li>Date their funders/grantees, especially when substantial conflict-of-interest mechanisms are not active</li><li>Date the partner of their funder/grantee, especially when substantial conflict-of-interest mechanisms are not active</li></ul></blockquote><p>Does it include:&nbsp;</p><ul><li>Actual active funder of an actual active grantee?&nbsp;<ul><li>eg Alice was the primary investigator of Bob's grant. Alice and Bob are housemates who share a two-person apartment. For some reason this was never flagged.</li></ul></li><li>A grantmaker in an organization which funded a grantee, but the grantmaker will never be involved in an actual grantmaking decision involving the grantee due to COI reasons?<ul><li>eg, Casey and Dylan are thinking of dating; Casey followed organizational protocol and marked themselves as abstaining from any grantmaking decisions involving Dylan's org.</li></ul></li><li>A grantmaker in an organization that funds the grantee, but the grantmaker will never be involved in an actual grantmaking decision involving the grantee due to specialization reasons?<ul><li>eg Elijah works as a grants associate for the animal welfare team at a foundation; he used to date Fiona, who leads an AI safety organization that has received funding from the foundation.&nbsp;</li></ul></li><li>Someone working in a funding organization, in a non grantmaking capacity?<ul><li>eg, Gabriela works as an accountant for a donor-advised fund that has given money to Hana's partner's partner's nonprofit. Gabriela and Hana are engaged.</li></ul></li><li>A private individual donating to a nonprofit?&nbsp;<ul><li>eg Isaac is housemates with Jamilah, who works at a biosecurity nonprofit. On Jamilah's birthday, Isaac donated to Jamilah's nonprofit.</li><li>I also want to flag that this is <i>extremely</i> normal in the nonprofit world outside of EA; within EA I think there's a (correct imo) expectation that donating to your roommate or spouse's organization potentially implies compromised judgment, but outside of EA I don't think the typical person will think poorly of you for doing so.</li></ul></li></ul><p>In my own opinion (note that there are some relevant and significant biases):</p><ul><li>Alice's case is rather sketchy; the potential compromise in judgment is pretty evident; safeguards should very much be in place.</li><li>Casey's case seems fine to me in well-run organizations but concerning in poorly set-up ones; this is one situation where \"substantial conflict-of-interest mechanisms\" seems relevant.</li><li>Elijah's case seems fine to me. Out of an abundance of caution maybe he should report the COI to his organization (in case either he or Fiona changes cause areas in the future), but it really doesn't seem like a big deal if he were to wait until a potential conflict arises to disclose.</li><li>Gabriela's case seems obviously fine to me.</li><li>Isaac's case broadly seems fine to me, but as an EA qua EA I think Isaac should be careful to be clear to himself when he's donating for altruistic reasons vs other reasons (like wanting to be nice to his housemate).</li></ul><p>Interested in other takes.</p>", "parentCommentId": null, "user": {"username": "Linch"}}, {"_id": "Y5Dm7e66jZmeAkkJe", "postedAt": "2023-09-08T21:05:53.780Z", "postId": "MvwctfyZ9NrhPzyPj", "htmlBody": "<blockquote>\n<p>Promote stimulant use can be fine in some cases - eg \"have you considered getting an ADHD diagnosis, maybe try mine for a day and see how you feel\"</p>\n</blockquote>\n<p>Wouldn't this be illegal? In which case, I think it's pretty clearly at least a risk.</p>\n", "parentCommentId": "nxLtifMvZWMRhJ65j", "user": {"username": "jooke"}}, {"_id": "YuveYCbD9i7WYJTEz", "postedAt": "2023-09-08T21:09:46.502Z", "postId": "MvwctfyZ9NrhPzyPj", "htmlBody": "<p>All the situations you describe seem probably ok, but it also seems like the relevant org recognised they were potentially bad and took appropriate action. The OP is perhaps a little strong, but their suggestion to conduct an ongoing risk analysis seems fine here.</p>\n", "parentCommentId": "wL5cRSwFEdgiZzwyc", "user": {"username": "jooke"}}, {"_id": "SDejgsNqvonuoYmTm", "postedAt": "2023-09-08T21:15:30.708Z", "postId": "MvwctfyZ9NrhPzyPj", "htmlBody": "<p>(own views only)</p><p>On a different tangent, I think you're treating \"X with funder/grantee\" relationships as symmetric. However, from my standpoint, the primary responsibility lies with the funder (and the organizations they represent) to manage their professional roles appropriately.</p><p>A grantmaker has a professional obligation to their employer and donors to avoid compromising their judgment and/or abusing their power; a grantee has no such professional obligations (Analogously, if Bob cheats on his wife with Candice, in Western liberal societies we generally understand that the bulk of the blame should fall on Bob, not Candice).&nbsp;</p><p>This is even more the case if you extend the professional limitations to partners-of-partners. Someone going on a date with me did not consent to have their future dating pool restricted by the community, especially if applied retroactively.</p>", "parentCommentId": null, "user": {"username": "Linch"}}, {"_id": "ivk34eMBhddjKpNCc", "postedAt": "2023-09-08T21:17:10.389Z", "postId": "MvwctfyZ9NrhPzyPj", "htmlBody": "<p>Perhaps we could change the wording from \"Date coworkers\" to something like \"Date people you work with.\" After all, the former phrasing allows dating a vendor or a contractor, while prohibiting a random data analyst working on Google Ads from dating a random software engineer working on Google Cloud.</p>", "parentCommentId": "jaFpuXjyX7DxTXaik", "user": {"username": "jlemien"}}, {"_id": "EH4qNdMkipGocFwtf", "postedAt": "2023-09-08T21:25:32.653Z", "postId": "MvwctfyZ9NrhPzyPj", "htmlBody": "<p>I agree with all of this and maybe should have written it as \"X with a grantee\" to reflect the power differential and consequent responsibility differential.</p>", "parentCommentId": "SDejgsNqvonuoYmTm", "user": {"username": "Rockwell Schwartz"}}, {"_id": "sqimNMGe2ECqLhyXE", "postedAt": "2023-09-08T21:32:54.571Z", "postId": "MvwctfyZ9NrhPzyPj", "htmlBody": "<p>Oof, there's a lot to unpack here, but I'll keep it short: All of these subculture norms are also present on university campuses. I would think—and hope—that that wouldn't lead you to endorsing professor-student relationships or psychedelic use during faculty meetings. You can have your BDSM and your LSD <i>and</i> your separate, professional workplace.</p>", "parentCommentId": "6EYBoT2ZkuQsrQqHv", "user": {"username": "Rockwell Schwartz"}}, {"_id": "WBJ39JbWfPdtEjM2f", "postedAt": "2023-09-08T21:33:10.913Z", "postId": "MvwctfyZ9NrhPzyPj", "htmlBody": "<p>The example you bring up of living with co-workers seems to be a case in which it turned out to be fine. I do think there are some scenarios where violating these \"norms\" is fine, but each of them is concerning to me. I think the low-quality model of an argument like this would be roughly \"I did this allegedly risky thing and it turned out fine. Therefore, the thing isn't risky.\"</p><p>I would interpret each of these not as <i>hard lines that shouldn't be crossed</i>, but as <i>areas/factors of increased risk</i>.</p><p>Rough analogies:<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefzy33iq8qtr\"><sup><a href=\"#fnzy33iq8qtr\">[1]</a></sup></span></p><ul><li>A husband and wife live together, and the wife is completely economically dependent on the husband. It is fine; they are happy together, and not planning to divorce. But because there is this \"bad practice\" (the practice of the wife not having access to money of her own), two things occur. First, her behavior is shaped by the perception of how easy/hard it is to separate. Second, if the wife wants to leave, it will be much harder to do so.</li><li>A much more crude analogy: Steve keeps a loaded gun at home in an unlocked cabinet, and claims that it is fine since none of his children have ever accidently shot themselves.</li></ul><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnzy33iq8qtr\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefzy33iq8qtr\">^</a></strong></sup></span><div class=\"footnote-content\"><p>I apologize for using an analogies rather than something more rigorous. I am vaguely gesturing toward an idea, but I haven't thought it through fully. Analogies are the written-down version of my vague gesturing.</p></div></li></ol>", "parentCommentId": "wL5cRSwFEdgiZzwyc", "user": {"username": "jlemien"}}, {"_id": "XboybRkHrAwwc6nXs", "postedAt": "2023-09-08T21:58:05.372Z", "postId": "MvwctfyZ9NrhPzyPj", "htmlBody": "<p>To respond to the other points:<br>&nbsp;</p><blockquote><p>Many startups start from someone's living room. LessWrong was built in the Event Horizon living room. This was great, I don't think it hurt anyone, and it also helped the organization survive through the pandemic, which I think was quite good.</p></blockquote><p>I'm glad this went well for LessWrong! Sometimes, however, people discover their beloved roommate is a very bad coworker and it leads to a major blowup. I think this should be treated similarly to family business ventures: you and your brother or you and your spouse might work phenomenally together professionally, or it might destroy your family and end your marriage.</p><p>Another important distinction here might be the difference between a stable living situation predating a new shared project vs. an existing organization's staff deciding to live together or pressuring new employees to live with other employees.</p><p>Either way, I think there is a risk that a discussion about an important campaign strategy turns into an argument about whose turn it is to wash the dishes.</p><blockquote><p>I also find this kind of dicey, though at least in Lightcone's case I think it's definitely worth it, and I know of many other cases where it seems likely worth it. We own a large event venue, and we are currently offering one employee free housing in exchange for being on-call for things that happen in the night. This seems like a fair trade to me and very standard (one of the sections of our hotel is indeed explicitly zoned as a \"care-taker unit\" for this exact purpose).&nbsp;</p></blockquote><p>I previously worked in a professional space where living onsite was an extremely common part of the job. Sometimes, it was great! Other times, it was horrible! Among the issues: hesitation to quit because it would mean lost housing, difficulty establishing work-life balance, invasion of privacy, decreased sense of agency and increased sense of reliance on and control by the employer, and <i>many</i> more.</p><blockquote><p>This seems really quite a lot too micromanagey to me. I agree that there should be COI mechanisms in place, but this seems like it's really trying to enforce norms on parts of people's lives that really are their business.</p></blockquote><p>I think this is a weird one for an employer/organization to try to enforce. But I think on an individual level thinking \"how important is it for me to date this person my partner directly funds?\" or \"maybe my coworker should review my metamour's grant application instead of me\" makes a lot of sense.</p>", "parentCommentId": "eD8sbnPyhvbeqTQMF", "user": {"username": "Rockwell Schwartz"}}, {"_id": "ZZRRaMQMnseqpuctJ", "postedAt": "2023-09-08T22:35:47.534Z", "postId": "MvwctfyZ9NrhPzyPj", "htmlBody": "<blockquote><p>Promote stimulant use can be fine in some cases - eg \"have you considered getting an ADHD diagnosis, maybe try mine for a day and see how you feel\"</p></blockquote><p><br>I think this is a bad idea. Suggesting someone 'get a diagnosis' is a terrible approach to health and medical advice. Giving someone your own prescribed medication is also a bad idea, and is exactly the kind of norm-crossing ickiness that should be reduced/eliminated. The version I would endorse is:</p><p>\"Have you considered whether you might have ADHD? It might be a good idea to talk to a doctor about these issues you're having, as medication can be helpful here.\"</p>", "parentCommentId": "nxLtifMvZWMRhJ65j", "user": {"username": "BenStewart"}}, {"_id": "AEGA2bnPuLkrRJzhr", "postedAt": "2023-09-08T22:49:28.743Z", "postId": "MvwctfyZ9NrhPzyPj", "htmlBody": "<p>This also brings to mind <i>time</i>, where it seems like projects and roles are uncorrelated enough right now that it's fine to date, but two years of unforeseen career developments between the two of you create something like a formal power asymmetry. Are you obligated to redteam dates with respect to where your respective careers might end up in the future?&nbsp;</p>", "parentCommentId": "jaFpuXjyX7DxTXaik", "user": {"username": "quinn"}}, {"_id": "5B4WrsN3etftrQdYR", "postedAt": "2023-09-08T23:14:57.594Z", "postId": "MvwctfyZ9NrhPzyPj", "htmlBody": "<p>I wonder if there should be some set of standards that orgs can opt into and know that they will be audited for compliance? I am very sensitive to the tradeoffs here with being a small org that can move quickly, so maybe pledging to not to do these things could be like a higher level of certification for orgs large and secure enough to handle the overhead?</p>\n", "parentCommentId": null, "user": {"username": "Holly_Elmore"}}, {"_id": "RzZ5rCjM8ZS4fSpZZ", "postedAt": "2023-09-08T23:19:44.522Z", "postId": "MvwctfyZ9NrhPzyPj", "htmlBody": "<p>I wouldn't support a ban on all these practices, but surely they are a \"risk\"?&nbsp;</p><p>What if you just broke up with a coworker in a small office? What if you live together, and they are the type of roommate who drives everyone up the wall by failing to do the dishes on time, etc.? What if the roommate/partner needs to be fired for non-performance, and now you have a tremendously awkward situation at home?&nbsp;</p><p>It's hard enough to execute at work on a high level, and see eye-to-eye with co-workers about strategy, workplace communication, and everything else. Add in romance and roommates (in a small office), and it obviously can lead to even more complicated and difficult scenarios.&nbsp;</p><p>Consider why it's the case that every few months there is a long article about some organization that, in the best case, looks like it was run with the professionalism and adult supervision of a frat house.&nbsp;</p>", "parentCommentId": "wL5cRSwFEdgiZzwyc", "user": {"username": "Stuart Buck"}}, {"_id": "XqNTj4MYG8SnnKueW", "postedAt": "2023-09-08T23:40:20.183Z", "postId": "MvwctfyZ9NrhPzyPj", "htmlBody": "<blockquote><p>I wouldn't support a ban on all these practices, but surely they are a \"risk\"?&nbsp;</p><p>What if you just broke up with a coworker in a small office? What if you live together, and they are the type of roommate who drives everyone up the wall by failing to do the dishes on time, etc.? What if the roommate/partner needs to be fired for non-performance, and now you have a tremendously awkward situation at home?&nbsp;</p></blockquote><p>Habryka didn't mention anything in this comment about dating coworkers. I'm sure he'd agree that there is a risk (regardless of whether he agrees with you, or me for that matter, about the level or justifiability of risk).</p>", "parentCommentId": "RzZ5rCjM8ZS4fSpZZ", "user": {"username": "Linch"}}, {"_id": "nCkbdnhPXhmHvAqub", "postedAt": "2023-09-09T00:09:30.352Z", "postId": "MvwctfyZ9NrhPzyPj", "htmlBody": "<p>With these norms, power differential relationships could still occur across organisations.</p><p>Also there's an important distinction between \"not actively promoting drug use amongst your employees\" vs \"strongly discouraging your employees from using drugs recreationally when they go to social events\".</p>", "parentCommentId": "6EYBoT2ZkuQsrQqHv", "user": {"username": "freedomandutility"}}, {"_id": "izeTGpRhgoT6gk5wA", "postedAt": "2023-09-09T00:10:58.741Z", "postId": "MvwctfyZ9NrhPzyPj", "htmlBody": "<p>I think these would be great norms to promote within EA. Although I think in a start-up scenario, living with / dating co-workers at the same organisational power level is pretty fine.</p>", "parentCommentId": null, "user": {"username": "freedomandutility"}}, {"_id": "EyQEof64pSM8RHyb2", "postedAt": "2023-09-09T01:01:57.273Z", "postId": "MvwctfyZ9NrhPzyPj", "htmlBody": "<p>Can we add \"ask their employees to break the law\" to this</p>", "parentCommentId": null, "user": {"username": "freedomandutility"}}, {"_id": "SpL8cDTByns2ZshrJ", "postedAt": "2023-09-09T01:37:21.595Z", "postId": "MvwctfyZ9NrhPzyPj", "htmlBody": "<p>Thanks for writing up your views here! I think it might be quite valuable to have more open conversations about what norms there's consensus on and which ones there aren't, which this helps spark.</p>", "parentCommentId": null, "user": {"username": "ChanaMessinger"}}, {"_id": "PocDkozM8Fc6GZg5K", "postedAt": "2023-09-09T02:28:13.721Z", "postId": "MvwctfyZ9NrhPzyPj", "htmlBody": "<p>Thanks for getting the ball rolling on this discussion! This can often be a thankless task as even if people agree with 70-80% of what you wrote, unfortunately, their comments will naturally focus on the parts where they disagree with you.<br><br>On the other hand, parts of this seems to go too far. For example, would organising an after-work drinks count as \"promoting drugs among coworkers, including alcohol\"?<br><br>This isn't the only example where I'd like to see a bit more nuance and thought.</p>", "parentCommentId": null, "user": {"username": "casebash"}}, {"_id": "iHNgkGdqGjxeY8zxu", "postedAt": "2023-09-09T02:51:41.703Z", "postId": "MvwctfyZ9NrhPzyPj", "htmlBody": "<p>I'm concerned about EA falling into the standard \"risk-averse bureaucracy\" failure mode.  Every time something visibly bad happens, the bureaucracy puts a bunch of safeguards in place.  Over time the drag created by the safeguards does a lot of harm, but because the harm isn't as visible, the bureaucracy doesn't work as effectively to reduce it.</p>\n<p>I would like to see Fermi estimates for some of these, including explicit estimates of less-visible downsides.  For example, consider EA co-living, including for co-workers.  If this was banned universally, my guess is that it would mean EAs paying many thousands of dollars extra in rent for housing and/or office space per month.  It would probably lead to reduced motivation, increased loneliness, and wasted commute time among EAs.  EA funding would become more scarce, likely triggering Goodharting for EAs who want to obtain funding, or people dying senselessly in the developing world.</p>\n<p>A ban on co-living doesn't seem very cost-effective to me.  It seems to me that expanding initiatives like <a href=\"https://forum.effectivealtruism.org/posts/4TJpwmGmdgv7R6nGZ/basefund-has-entered-its-trial-phase-1\">Basefund</a> would achieve something similar, but be far more cost-effective.</p>\n", "parentCommentId": null, "user": {"username": "chinscratch"}}, {"_id": "6d4LuMEqwWkFXxkWJ", "postedAt": "2023-09-09T05:05:22.698Z", "postId": "MvwctfyZ9NrhPzyPj", "htmlBody": "<p>The OP is not titled \"An incomplete list of activities that EA orgs should think about before doing\" it is \"An incomplete list of activites that EA orgs Probably Shouldn't Do\". I agree that most of the things listed in the OP seem reasonable to think about and take into account in a risk analysis, but I doubt the OP is actually contributing to people doing much more of that.&nbsp;</p><p>I would love a post that would go into more detail on \"when each of these seems appropriate to me\", which seems much more helpful to me.</p>", "parentCommentId": "YuveYCbD9i7WYJTEz", "user": {"username": "Habryka"}}, {"_id": "EZ45s8AuLbkpfAGt5", "postedAt": "2023-09-09T05:24:13.668Z", "postId": "MvwctfyZ9NrhPzyPj", "htmlBody": "<p>I'm glad you wrote this post. Mostly before reading this post, I wrote a draft for what I want <i>my</i> <i>personal</i> conflict of interest policy to be, especially with regard to personal and professional relationships. Changing community norms can be hard, but changing my norms might be as easy as leaving a persuasive comment! I'm open to feedback and suggestions <a href=\"https://docs.google.com/document/d/1ikQC_X18SgFvT5a_J8RUCoJ1Ss2F2rHpilcZrt1Nn7w/edit\">here</a> for anybody interested.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Aaron_Scher"}}, {"_id": "D2m5FGkELDdxwf8y6", "postedAt": "2023-09-09T06:23:48.195Z", "postId": "MvwctfyZ9NrhPzyPj", "htmlBody": "<blockquote>\n<p>EA™ Group Houses and the branding of private, personal spaces as “EA”</p>\n</blockquote>\n<p>What does this mean? Is this referring to people living with other EAs and referring to it as an EA group house?</p>\n", "parentCommentId": null, "user": {"username": "calebp"}}, {"_id": "FxiKntuaTZC23M7bB", "postedAt": "2023-09-09T06:57:44.342Z", "postId": "MvwctfyZ9NrhPzyPj", "htmlBody": "<p>I think \"probably shouldn't\" is fair. In most cases, these should be avoided. However, in scenarios with appropriate mitigations and/or thought given, they can be fine. You've given some examples of doing this.</p>\n<p>In terms of the post, it has generated lots of good discussion about which of these norms the community might want to adopt or how they should be modified. Therefore, the post is valuable in its current form. Its a discussion starter IMO, not a list of things that should be cited in future.</p>\n", "parentCommentId": "6d4LuMEqwWkFXxkWJ", "user": {"username": "jooke"}}, {"_id": "GBmrdYNNWMkg7Lqd6", "postedAt": "2023-09-09T08:10:55.965Z", "postId": "MvwctfyZ9NrhPzyPj", "htmlBody": "<p>I disagree. I think the the general poise of EAs I know is correct - <i>that stimulants are overregulated and that the people who need them most struggle to get them most.</i> I will not condemn those who try to help others short circuit this.&nbsp;</p><p>As someone with an ADHD diagnosis, I have not found it remotely trivial to engage with and I wouldn't have minded someone giving me a bit of a push.</p>", "parentCommentId": "ZZRRaMQMnseqpuctJ", "user": {"username": "nathan"}}, {"_id": "e5Zv58fPLppBHt5ov", "postedAt": "2023-09-09T08:12:09.513Z", "postId": "MvwctfyZ9NrhPzyPj", "htmlBody": "<p>Everything is a risk. The question is which things to track and how heavily to tax them.</p>", "parentCommentId": "RzZ5rCjM8ZS4fSpZZ", "user": {"username": "nathan"}}, {"_id": "bLxkatmQ94dbEjQDg", "postedAt": "2023-09-09T08:14:40.711Z", "postId": "MvwctfyZ9NrhPzyPj", "htmlBody": "<p>While I am all for anonymous voting, I am confused by -44. Feels like this is a reasonable take that many people disagree with, rather than an unacceptable/timewasting one that should be nuked into the ground.</p>", "parentCommentId": "6EYBoT2ZkuQsrQqHv", "user": {"username": "nathan"}}, {"_id": "prymA2psaGReFvp85", "postedAt": "2023-09-09T08:19:35.884Z", "postId": "MvwctfyZ9NrhPzyPj", "htmlBody": "<p>If someone has been struggling to get their prescription and someone else lends them some for a few days, that is illegal. And if I was their boss and I thought this might be about to take place, I would walk out of the room.</p><p>Generally I agree that following the law is good, but I think legal norms around medication are way too strict and I wouldn't want to be the reason someone gets theirs.&nbsp;</p><p>This article is both about risks and norms. And I don't want anyone who helps/lends their medication to be considered a norm-breaking EA. Notably because that's quite a lot people.</p>", "parentCommentId": "Y5Dm7e66jZmeAkkJe", "user": {"username": "nathan"}}, {"_id": "v8SYBXxGKMAjwWCFT", "postedAt": "2023-09-09T08:26:35.890Z", "postId": "MvwctfyZ9NrhPzyPj", "htmlBody": "<p>I made a poll. Now you can anonymously say which of these norms you agree and disagree with.&nbsp;</p><p><a href=\"https://viewpoints.xyz/polls/ea-norms\">https://viewpoints.xyz/polls/ea-norms</a></p>", "parentCommentId": null, "user": {"username": "nathan"}}, {"_id": "a4AuiipyWtBQkdFcQ", "postedAt": "2023-09-09T08:35:11.403Z", "postId": "MvwctfyZ9NrhPzyPj", "htmlBody": "<p>I'm not really a fan of this as I expect this would result in things getting a lot more political.</p>", "parentCommentId": "5B4WrsN3etftrQdYR", "user": {"username": "casebash"}}, {"_id": "LRvfs76EYFbgvzFrX", "postedAt": "2023-09-09T09:48:49.263Z", "postId": "MvwctfyZ9NrhPzyPj", "htmlBody": "<blockquote><p>For example, consider EA co-living, including for co-workers. If this was banned universally, my guess is that it would mean EAs paying many thousands of dollars extra in rent for housing and/or office space per month. It would probably lead to reduced motivation, increased loneliness, and wasted commute time among EAs</p></blockquote><p>I'm not for a blanket ban (and I doubt the OP is either), but this analysis seems like it only really applies to places like the bay area with ridiculously high rent and housing shortages.&nbsp;</p><p>I mean, I live in a place considered to have very high rent, and not being able to live with my co-workers wouldn't affect me in the slightest, I can bike to work, I houseshare with non-coworkers. Loneliness in a house share situation depends entirely on whether your housemates are good, and there is no guarantee that your co-workers are good housemates just because they are EA.&nbsp;</p><p>I wonder if there has been discussion about moving EA orgs towards cities with less housing problems in general?&nbsp;</p>", "parentCommentId": "iHNgkGdqGjxeY8zxu", "user": {"username": "titotal"}}, {"_id": "KmbHgetd49xsBPt8H", "postedAt": "2023-09-09T10:52:48.892Z", "postId": "MvwctfyZ9NrhPzyPj", "htmlBody": "<blockquote><p>Loneliness in a house share situation depends entirely on whether your housemates are good, and there is no guarantee that your co-workers are good housemates just because they are EA.</p></blockquote><p>The most plausible version of this argument is not that someone will be a good housemate just because they are EA. It is that banning or discouraging EA co-living makes it more difficult for people to find <i>any</i> co-living arrangement.</p>", "parentCommentId": "LRvfs76EYFbgvzFrX", "user": {"username": "Pablo_Stafforini"}}, {"_id": "dAMnuNneXHAL7ihzX", "postedAt": "2023-09-09T11:41:03.252Z", "postId": "MvwctfyZ9NrhPzyPj", "htmlBody": "<p>The results screen is not working, talking to devs, but as an illustrative point, note how much ambiguity there already is on many of these points. These are my own votes, selectively chosen so take with a large chunk of salt.</p><p>87% disagree with \"EAs should not date coworkers\"<br>62% think that not dating the partner of a funder/grantee is complicated.<br><br>I don't think the conversation is easy to have without a degree of anonymity. Few people are gonna publicly say they think that dating funders' partners is fine, but many people are at least unsure.&nbsp;</p><p>Note I'm not saying Rocky's list is wrong. I am saying we don't have a way for the less acceptable side to argue it.&nbsp;<br><br><img src=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/dAMnuNneXHAL7ihzX/psuh2ulbkovkeuaibxwq\" srcset=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/dAMnuNneXHAL7ihzX/ielodqbrh24fl2mywphk 110w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/dAMnuNneXHAL7ihzX/uuu0msstb4yo8bgiqlkx 220w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/dAMnuNneXHAL7ihzX/me9jkcxpuiu8psqawoty 330w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/dAMnuNneXHAL7ihzX/doukribfpmrxmlzgbjs3 440w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/dAMnuNneXHAL7ihzX/j2bfkbfniaam5ptuz35u 550w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/dAMnuNneXHAL7ihzX/zqev7ggcvagcpeeqyxc5 660w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/dAMnuNneXHAL7ihzX/c5to97ugig9koybv5cza 770w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/dAMnuNneXHAL7ihzX/vbnkntpvjaunfdgvvayy 880w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/dAMnuNneXHAL7ihzX/xadwsgevmksh50uhp9il 990w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/dAMnuNneXHAL7ihzX/uvgd4qyjxmdx3krf7mqr 1014w\"></p>", "parentCommentId": "v8SYBXxGKMAjwWCFT", "user": {"username": "nathan"}}, {"_id": "WRS5N7KmWoqabHA5Z", "postedAt": "2023-09-09T11:44:32.649Z", "postId": "MvwctfyZ9NrhPzyPj", "htmlBody": "<blockquote><p>I wonder if there has been discussion about moving EA orgs towards cities with less housing problems in general?&nbsp;</p></blockquote><p>I know people reap social benefits from good housing but that's not the only reason EAs live in London and SF. They are also the cities where the jobs, research and power are.&nbsp;</p><p>I think funders should take into account that remote orgs are ? cheaper, but I trust orgs to decide where they should locate.</p>", "parentCommentId": "LRvfs76EYFbgvzFrX", "user": {"username": "nathan"}}, {"_id": "qhLHabvAyagdApLkv", "postedAt": "2023-09-09T11:46:59.357Z", "postId": "MvwctfyZ9NrhPzyPj", "htmlBody": "<p>Yeah I think allowing people to sort into the kind of org they want to be a part of would be good.</p>", "parentCommentId": "5B4WrsN3etftrQdYR", "user": {"username": "nathan"}}, {"_id": "qfNxWyh8cxJqpWSGE", "postedAt": "2023-09-09T11:51:33.606Z", "postId": "MvwctfyZ9NrhPzyPj", "htmlBody": "<p>A question here is something like \"how do norms get removed?\" what process allows people more freedom if we have restricted too much.</p>", "parentCommentId": "iHNgkGdqGjxeY8zxu", "user": {"username": "nathan"}}, {"_id": "ssoCE9CbB2vrLxxPq", "postedAt": "2023-09-09T13:13:13.924Z", "postId": "MvwctfyZ9NrhPzyPj", "htmlBody": "<p>I agree that we should be wary of falling into the \"risk-averse bureaucracy\" failure mode, and I also think co-living for co-workers at a similar seniority level is fine (it is also normal outside EA). I also think there might be a good case for EA houses trying to have people from different orgs.</p><p>However, I'd like to point out that any Fermi estimates here would be fairly pointless. There are many different inputs you would need, and the reasonable range for each input is very wide, particularly with \"potential reputational harm to EA from bad thing happening\", which can range from nothing to FTX-level or far worse.</p>", "parentCommentId": "iHNgkGdqGjxeY8zxu", "user": {"username": "freedomandutility"}}, {"_id": "ee2uKMEkX3iLRKiBu", "postedAt": "2023-09-09T15:30:47.191Z", "postId": "MvwctfyZ9NrhPzyPj", "htmlBody": "<p>If it's pointless to do a Fermi estimate, that sounds a lot like saying it's pointless to try and figure out whether a ban is a good idea?</p>\n<p>If that's the case, I favor letting people decide for themselves -- individuals understand their particular context, and can make a guess that's customized for their particular situation.</p>\n", "parentCommentId": "ssoCE9CbB2vrLxxPq", "user": {"username": "chinscratch"}}, {"_id": "XnTjcHZLZ5JcqhDKv", "postedAt": "2023-09-09T15:43:49.425Z", "postId": "MvwctfyZ9NrhPzyPj", "htmlBody": "<p>It's time to create separate brands for the professional and the social/personal aspects of EA.</p>\n<p>The conflation of the two is at the source of a lot the issues, and folks should be able to opt into one and not the other.</p>\n", "parentCommentId": null, "user": {"username": "nevakanezzar"}}, {"_id": "Tc98oEXpLhstDXfSf", "postedAt": "2023-09-09T15:47:57.282Z", "postId": "MvwctfyZ9NrhPzyPj", "htmlBody": "<p>Great suggestions, genuinely.</p>\n<p>Now, let's count off those who are already in such situations, many of whom are at the highest levels of EA, some who have been successfully navigating all this complexity for a decade. What are their secrets? Can there, maybe, be some lessons from them that can mitigate some of the ill-effects for those who in the future are still going to inevitably find themselves there?</p>\n", "parentCommentId": null, "user": {"username": "nevakanezzar"}}, {"_id": "FwGDuuHfv3DTHc8yw", "postedAt": "2023-09-09T16:09:41.571Z", "postId": "MvwctfyZ9NrhPzyPj", "htmlBody": "<p>Do you have examples of laws EA orgs might ask their employees to break?</p>\n", "parentCommentId": "EyQEof64pSM8RHyb2", "user": {"username": "robirahman"}}, {"_id": "YsFKdhpxFJHjZkmor", "postedAt": "2023-09-09T17:48:26.867Z", "postId": "MvwctfyZ9NrhPzyPj", "htmlBody": "<p>I conditionally disagree with the \"Work trials\". I think EA companies doing work trials is a pretty positive innovation that EA in particular does that enables them to hire for a better fit than not doing work trials. This is good in the long run for potential employees and for the employer.</p><p>This is conditional on&nbsp;</p><ul><li>work trials being paid at a reasonable rate, where \"reasonable\" is probably within ~20% of the expected compensation paid out by the job, on a pro rata hourly rate.</li><li>Probably the trial being 40 hours or less</li></ul><p>I can anticipate some reasonable disagreement on this matter but it seems to me it's not so unreasonable to give these work trials even if they last long enough that it requires the candidate to take a few days of leave off work. Being paid for the trial itself should compensate for the inconvenience. More than a week of time seems like it should have even stronger justification and I wouldn't endorse that.</p><p>Although I understand this process would <i>still</i> require some inconvenience to the candidate and their current employer, on balance, if the candidate is well-paid, it seems like a reasonable trade-off to ask for, considering the benefit to the candidate and the employer for finding a good fit.</p>", "parentCommentId": null, "user": {"username": "ben.smith"}}, {"_id": "bd428B9pZReQDT6Y4", "postedAt": "2023-09-09T23:13:49.529Z", "postId": "MvwctfyZ9NrhPzyPj", "htmlBody": "<p>I think all of these have costs, and those costs should be recognized. But sometimes the benefits are worth it, banning the practice would make things worse, and the actually helpful thing is to come up with better solutions.</p><p>&nbsp;</p><p>E.g.&nbsp;<br>&gt; [don't have] \"Work trials\" that require interruption of regular employment to complete, such that those currently employed full-time must leave their existing job to be considered for a prospective job</p><p>The fact that people need to, at best, spend all their vacation days on work trials, and maybe take huge risks with their livelihood, is bad. A good friend of mine was badly burned on this, and I think less of the organization for it. OTOH, work trials are really informative. If we removed work trials I expect that: EA jobs become even more of a club (because they have references hirers personally know), jobs are performed worse (because the hiring decision was made with less information), many people get fired shortly after starting, and more emphasis on unpaid work (as an alternate source of information).&nbsp;</p><p>No one is doing disruptive work trials to be <i>mean</i>, they're a solution to the fact that interviews aren't very informative. Could they be better implemented? Probably. Are there much better solutions out there? I hope so. But if you just take this option away I suspect things get worse.</p>", "parentCommentId": null, "user": {"username": "Elizabeth"}}, {"_id": "2JrhoqzjuFMZmBs6F", "postedAt": "2023-09-10T01:59:21.950Z", "postId": "MvwctfyZ9NrhPzyPj", "htmlBody": "<p>Work trials (paid, obviously) are awesome for better hiring, especially if you're seeking to get good candidates that don't fulfill the traditional criteria (e.g. coming from an elite US/UK university). Many job seekers don't have a current employment.</p>\n<p>Living with other EAs or your coworkers is mostly fine too, especially if you're in a normal living situation, like most EA group houses are.</p>\n<p>These suggestions aren't great. I agree with the \"Don't date\" ones, but these were already argued for before.</p>\n", "parentCommentId": null, "user": {"username": "rhaps0dy"}}, {"_id": "yDc76nwvwsu6AsKRa", "postedAt": "2023-09-10T02:43:46.524Z", "postId": "MvwctfyZ9NrhPzyPj", "htmlBody": "<p>+1 for outside-of-the-box thinking.</p><p>I do wonder though what this would actually look like in practise?</p>", "parentCommentId": "XnTjcHZLZ5JcqhDKv", "user": {"username": "casebash"}}, {"_id": "KnpRmnEGL6buK3ebK", "postedAt": "2023-09-10T05:24:44.964Z", "postId": "MvwctfyZ9NrhPzyPj", "htmlBody": "<blockquote>\n<p>I believe there is a reasonable risk should EAs... [d]ate coworkers, especially when there is a power differential and especially when there is a direct report relationship</p>\n</blockquote>\n<p>I think you're right that there's some risk in these situations. But also: work is one of the main places where one is able to meet people, including potential romantic partners. Norms against dating co-workers therefore seem quite costly in lost romance, which I think is a big deal! I think it's probably worth having norms against the cases you single out as especially risky, but otherwise, I'd rather our norms be laissez-faire.</p>\n", "parentCommentId": null, "user": {"username": "DanielFilan"}}, {"_id": "xMo88Ga6cGvLeDeDn", "postedAt": "2023-09-10T08:41:36.251Z", "postId": "MvwctfyZ9NrhPzyPj", "htmlBody": "<p>People <em>will</em> decide for themselves. There's no government here to enforce a ban. But it would be frowned upon at the community level.</p>\n", "parentCommentId": "ee2uKMEkX3iLRKiBu", "user": {"username": "Guy Raveh"}}, {"_id": "RxmFeieYRDr8jY3DZ", "postedAt": "2023-09-10T09:00:03.226Z", "postId": "MvwctfyZ9NrhPzyPj", "htmlBody": "<p>Their secrets are just scandals that haven't come out yet.</p>\n<p>By which I don't mean that all EA leaders are doing scandalous things, but that you'd expect some percentage of them to do so in these conditions, and if the percentage you've heard of is lower, my guess is that the rest just hasn't been publicized.</p>\n<p>For example, look at the case of Owen Cotton-Barratt (which I wouldn't exactly describe as a scandal, but still). It took <em>years</em> between the events happening and being revealed.</p>\n", "parentCommentId": "Tc98oEXpLhstDXfSf", "user": {"username": "Guy Raveh"}}, {"_id": "tDxiYvEHDRnHP5KbB", "postedAt": "2023-09-10T09:03:36.940Z", "postId": "MvwctfyZ9NrhPzyPj", "htmlBody": "<p>This seems problematic, as small orgs that move fast are exactly a place where these things can cause problems.</p>\n", "parentCommentId": "5B4WrsN3etftrQdYR", "user": {"username": "Guy Raveh"}}, {"_id": "m5zpFu3yRMrmK7o4o", "postedAt": "2023-09-10T09:09:26.073Z", "postId": "MvwctfyZ9NrhPzyPj", "htmlBody": "<p>While I disagree with the ways you suggest to help people regarding this, I appreciate you sharing your personal experience and I hope we can help people with ADHD without offering them prescription drugs directly.</p>\n", "parentCommentId": "GBmrdYNNWMkg7Lqd6", "user": {"username": "Guy Raveh"}}, {"_id": "DNh6aNmgrxkZLtgux", "postedAt": "2023-09-10T09:11:09.189Z", "postId": "MvwctfyZ9NrhPzyPj", "htmlBody": "<blockquote>\n<p>If someone has been struggling to get their prescription and someone else lends them some for a few days</p>\n</blockquote>\n<p>I'll just flag that this is a different situation to the one in your other comment, and I don't think it raises any ethical difficulties.</p>\n", "parentCommentId": "prymA2psaGReFvp85", "user": {"username": "Guy Raveh"}}, {"_id": "er3JjiBXzjmWHcaKt", "postedAt": "2023-09-10T09:14:28.417Z", "postId": "MvwctfyZ9NrhPzyPj", "htmlBody": "<p>I don't see it as a reasonable take. I see it as a dangerous one.</p>\n", "parentCommentId": "bLxkatmQ94dbEjQDg", "user": {"username": "Guy Raveh"}}, {"_id": "fdWFjHdnSKDpkDfYn", "postedAt": "2023-09-10T11:44:10.726Z", "postId": "MvwctfyZ9NrhPzyPj", "htmlBody": "<p>I agree that for a lot of orgs, the benefits of being in the high-rent areas outweigh the costs. However I want to encourage orgs that don't fit this description to consider different locations, if only to give people different options.&nbsp;</p><p>For me personally, and probably a lot of other people, the idea of living with my boss and using our shared house as an office sounds like my own personal hell. If I got an offer with that arrangement I would refuse immediately. Whereas if the city was in Portugal or somewhere similar, where things are cheap and you can rent your own place for 500 bucks a month, I'd probably jump at the opportunity.&nbsp;</p><p>I think not having the option, and having everyone be concentrated in one or two high-rent areas, costs both money and the people you want to recruit.&nbsp;</p>", "parentCommentId": "WRS5N7KmWoqabHA5Z", "user": {"username": "titotal"}}, {"_id": "hEf3HnLgsYzmfn7nW", "postedAt": "2023-09-10T12:21:59.389Z", "postId": "MvwctfyZ9NrhPzyPj", "htmlBody": "<p>I consider power-dynamics safeguards that make sure, for example, that anyone can quit their job and still have a place to stay - to be deontological. You won't change my mind easily using a cost-benefit analysis, if the argument will be something like \"for the greater good, it's ok to make it very hard for some people to quit, because it will save EA money that can be used to save more lives\".</p><p>This is similar to how it would be hard to convince me that stealing is a good idea - even if we can use the money to buy bed nets.</p><p>I can elaborate if you don't agree. (or maybe you totally agree and then there's no need)</p><p>&nbsp;</p><p>Also, I wouldn't make one group out of all the \"risk-averse bureaucracy\". Preventing the abuse of power dynamics is a specific instance that should get special treatment imo</p>", "parentCommentId": "iHNgkGdqGjxeY8zxu", "user": {"username": "hibukki"}}, {"_id": "fbDjsivqzvSFRaFN5", "postedAt": "2023-09-10T12:26:05.974Z", "postId": "MvwctfyZ9NrhPzyPj", "htmlBody": "<p>I agree that work trials are a different category - and seem ok to me.</p><p>It's not an abuse of power dynamics or anything like that.</p><p>If you demand work trials (or various other things) - you will get less candidates, but it's ok, it's a tradeoff you as an employer can chose to do when nobody is dependent on you, people can just chose not to apply.</p><p>No?</p><p><a href=\"https://forum.effectivealtruism.org/users/rockwell?mention=user\">@Rockwell</a>&nbsp;</p><p>&nbsp;</p><p>P.S</p><p>I sometimes try helping orgs with hiring so I'm very interested in noticing if I'm wrong here</p>", "parentCommentId": "2JrhoqzjuFMZmBs6F", "user": {"username": "hibukki"}}, {"_id": "8wdmqayj46Yr9aSqH", "postedAt": "2023-09-10T13:02:22.306Z", "postId": "MvwctfyZ9NrhPzyPj", "htmlBody": "<p>There are millions of people around the world who live paycheck to paycheck, and run the risk of becoming homeless if they quit their jobs.  We don't have the resources to help all of those people, and I'm not immediately seeing how deontology helps us figure out how to allocate our limited resources between this and various other obligations we may have.  [Edit: maybe this section was obtuse on my part -- see Yonatan's reply below.]</p>\n<p>I think it is really valuable for people in EA to feel comfortable pushing back against their boss.  (I see strong consequentialist arguments for this.  Those arguments are why I will focus on people in EA, rather than non-EAs living paycheck to paycheck, for the rest of this comment.)  I think there are ways to achieve this cost-effectively.  For example:</p>\n<ul>\n<li>\n<p>When possible, have employee housing arrangements made directly with a landlord or similar person, rather than routing through someone they have a working relationship with.</p>\n</li>\n<li>\n<p>Agree in advance that any employee who lives for free in employer-provided housing gets to continue living there for, say, 3 months if they quit/get fired.</p>\n</li>\n<li>\n<p>Build things like Basefund to the point where no EA thinks it is very hard to quit their job.  (For example, a hypothetical Basefund+ could guarantee that EA employees who quit/get fired always receive a generous severance package.  This idea might seem costly at first, but because the money is going to an EA instead of a landlord, it is much more likely to e.g. be donated to an effective charity.)</p>\n</li>\n<li>\n<p>Encourage EAs to live with non-EAs when all else is equal.</p>\n</li>\n</ul>\n", "parentCommentId": "hEf3HnLgsYzmfn7nW", "user": {"username": "chinscratch"}}, {"_id": "hXk7X5qk3Ejij6z8k", "postedAt": "2023-09-10T13:44:16.400Z", "postId": "MvwctfyZ9NrhPzyPj", "htmlBody": "<p>(I mostly agree)</p><p>When I wrote about deontology, I didn't mean \"we must help all people who are stuck in their jobs\". I meant \"we must not hire people who will be stuck in their job while arguing that it's ok to do so for the greater good\"</p>", "parentCommentId": "8wdmqayj46Yr9aSqH", "user": {"username": "hibukki"}}, {"_id": "XEPoPMGThbRbzGkiW", "postedAt": "2023-09-10T14:05:00.637Z", "postId": "MvwctfyZ9NrhPzyPj", "htmlBody": "<p>In general, I think it is helpful in discussing work trials if people (including the OP) distinguished between three different things that are commonly called work trials:</p><ul><li>Take-home trial tasks / timed online tests, which typically take somewhere in the region of 2-8 hours and are designed to be doable on a weekend or otherwise without work disruption.</li><li>Short (usually 1-3-day) work trials prior to receiving a job offer. This is what I usually think of as being referred to by the term \"work trial\". While it's technically true that these \"interruption of regular employment to complete\" (quote from OP) I think it's generally pretty manageable to make this work by taking e.g. 1-2 days of vacation.</li><li>Long (often several months) \"work trials\" that essentially act as extended paid probation. I've seen these at a few EA orgs and sometimes feel iffy about them, but IMO they're not all that different from standard probation practices in the US. They definitely require \"those currently employed full-time [to] leave their existing job\", though.</li></ul><p>I'm not sure which of these the OP was including in her claim. Presumably not the first one?</p>", "parentCommentId": "2JrhoqzjuFMZmBs6F", "user": {"username": "willbradshaw"}}, {"_id": "4wTTB7EqNB5w3h9h6", "postedAt": "2023-09-10T14:15:56.495Z", "postId": "MvwctfyZ9NrhPzyPj", "htmlBody": "<p>I agree with your takes on these examples. I want to note that the conflict of interest of <em>other</em> team members should also be taken into account - if all grantmakers on a team are also close friends with eachother, the situation may look differently than if their ties are mostly professional.</p>\n", "parentCommentId": "NmYQavdvXjzvF8QRK", "user": {"username": "Guy Raveh"}}, {"_id": "CpBFcwFj8knpFhoCh", "postedAt": "2023-09-10T15:40:17.231Z", "postId": "MvwctfyZ9NrhPzyPj", "htmlBody": "<p>Thank you for listing these out; I think it's helpful to show that there are a range of work trial options with different levels of intensity and potential sacrifice on the part of the prospective employee.<br><br>I was thinking more in the category of #3. To be clear, I don't think probationary employment is necessarily a bad thing. What I have seen though is a growing norm of work trials of one to three months. This seems to hit a particularly problematic middle ground of requiring a candidate to leave other employment <i>and</i> failing to guarantee medium-term job security. I think this is bad for a number of reasons, including making it less likely that employed people will apply for positions and consequently limiting the skilled applicant pool. It also creates a culture of precarity that I don't think should be a requirement for someone securing their \"dream job\" in EA.</p>", "parentCommentId": "XEPoPMGThbRbzGkiW", "user": {"username": "Rockwell Schwartz"}}, {"_id": "F9nwC3dqMhdPrrko4", "postedAt": "2023-09-10T15:49:19.633Z", "postId": "MvwctfyZ9NrhPzyPj", "htmlBody": "<p>I think that distinguishing between 1-8 hours (preferably paid), up to 40 hours, and 1-6 months, is very important here. I am happiest about the shortest ones, particularly for people who have to leave a job (part of why I think that OP is talking about the latter sort).</p>", "parentCommentId": "YsFKdhpxFJHjZkmor", "user": {"username": "keller_scholl"}}, {"_id": "MR3KbW8q6swKa8WPw", "postedAt": "2023-09-10T16:23:06.054Z", "postId": "MvwctfyZ9NrhPzyPj", "htmlBody": "<p>Thanks for clarifying, I agree category #3 is the most dicey of the three.</p><p>How do you see these trials as differing from standard probation? Is it that the chance of a no-hire at the end is higher? Or the length? Or something else?</p>", "parentCommentId": "CpBFcwFj8knpFhoCh", "user": {"username": "willbradshaw"}}, {"_id": "TGujaZeoWLG7hDPaC", "postedAt": "2023-09-10T17:26:18.195Z", "postId": "MvwctfyZ9NrhPzyPj", "htmlBody": "<blockquote><p>For example, would organising an after-work drinks count as \"promoting drugs among coworkers, including alcohol\"?</p></blockquote><p>Employer-organized happy hours and other social events are often careful to have non-alcoholic options for this reason (among others like inclusivity).</p>", "parentCommentId": "PocDkozM8Fc6GZg5K", "user": {"username": "Muireall"}}, {"_id": "vezw2K7WjdD7xCgrg", "postedAt": "2023-09-10T19:05:12.415Z", "postId": "MvwctfyZ9NrhPzyPj", "htmlBody": "<blockquote><p>if all grantmakers on a team are also close friends with each other</p></blockquote><p>Can you elaborate on this? Do you believe this is net bad, or at least very concerning? If so, why?</p><p>In my mind, in most other contexts, coworkers being (close) friends with each other is good in many ways, despite real risks and costs (eg new colleagues might feel less included, firing people is harder). I can imagine whether the on net costs vs benefits being positive or negative going either way.&nbsp;</p><p>I can imagine two key ways in which grantmaking in different than other companies or organizations:</p><ul><li>The decisions grantmakers make might be unusually weighty</li><li>Grantmakers have a fair amount of power vested in them, most of which aren't <a href=\"https://en.wikipedia.org/wiki/Principal%E2%80%93agent_problem\"><i>naturally theirs</i></a><i> </i>but instead granted from others.<ul><li>This is different from, eg, Warren Buffet and Bill Gates being friends with each other on the Gates Foundation, since Buffet and Gates are spending their own money.</li></ul></li></ul><p>Are there other important ones I'm missing? If not, would you say the issue is similar to:</p><ul><li>Justices on the US Supreme Court and/or other courts being friends with each other</li><li>Congressional representatives being friends with each other, particularly on opposing parties?</li><li>The director and deputy director of the FBI being friends?</li><li>Executives at a large media company being friends?</li></ul>", "parentCommentId": "4wTTB7EqNB5w3h9h6", "user": {"username": "Linch"}}, {"_id": "Rnxiuc9SevYroP6Ge", "postedAt": "2023-09-10T19:11:58.756Z", "postId": "MvwctfyZ9NrhPzyPj", "htmlBody": "<p>What I meant is that if I'm a grantmaker with org X and all the others there are my close friends, it'll influence the treatment my partner or roommate gets in a way that's different than when the other grantmakers keep a professional distance. So in such a case, a CoI report from myself alone may not suffice.</p>\n", "parentCommentId": "vezw2K7WjdD7xCgrg", "user": {"username": "Guy Raveh"}}, {"_id": "WCQzMzG6sxnieCRQb", "postedAt": "2023-09-10T20:01:10.485Z", "postId": "MvwctfyZ9NrhPzyPj", "htmlBody": "<p>I see. Just to clarify, would you have the same concern about the other examples I gave? Eg Antonin Scalia and Ruth Bader Ginsburg were <a href=\"https://pacificlegal.org/antonin-scalia-and-ruth-bader-ginsburgs-friendship/\">good friends</a>, do you think RBG should have recused herself from any COIs Scalia where Scalia did as well, and vice versa?</p>", "parentCommentId": "Rnxiuc9SevYroP6Ge", "user": {"username": "Linch"}}, {"_id": "xwjyfiiGbcTEKRXoK", "postedAt": "2023-09-10T20:21:57.914Z", "postId": "MvwctfyZ9NrhPzyPj", "htmlBody": "<p>I think I trust the professionalism of supreme court judges quite a bit more than that of EA grantmakers. But it's hard for me to say conclusively. I'm not sure any such situation with the supreme court has ever arisen.</p>\n", "parentCommentId": "WCQzMzG6sxnieCRQb", "user": {"username": "Guy Raveh"}}, {"_id": "MBFJiFr7B9Kuh9YG5", "postedAt": "2023-09-10T20:24:12.073Z", "postId": "MvwctfyZ9NrhPzyPj", "htmlBody": "<blockquote><p>I'm not sure any such situation with the supreme court has ever arisen.</p></blockquote><p>See <a href=\"https://www.propublica.org/article/clarence-thomas-other-billionaires-sokol-huizenga-novelly-supreme-court\">here</a>, <a href=\"https://news.bloomberglaw.com/us-law-week/justice-disclosure-rules-are-a-good-start-but-its-a-low-bar\">here</a>, <a href=\"https://www.politico.com/news/2023/04/25/neil-gorsuch-colorado-property-sale-00093579\">here</a>,<a href=\"https://www.opensecrets.org/news/2019/06/scotus-justices-rack-up-trips/\"> here</a>, and <a href=\"https://ohiocapitaljournal.com/2023/04/26/u-s-supreme-court-justices-take-lavish-gifts-then-raise-the-bar-for-bribery-prosecutions/\">here</a>. The reported COIs are all financial rather than personal<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnref849nb76ixjk\"><sup><a href=\"#fn849nb76ixjk\">[1]</a></sup></span>, however the concern with billionaires giving gifts to supreme court justices is under most conditions more concerning than for grantmakers receiving gifts (from non-grantees). The primary worry for justices (at least in recent years) is with money buying influence, whereas the primary worry for grantmakers (iiuc) is with influence buying money.</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fn849nb76ixjk\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnref849nb76ixjk\">^</a></strong></sup></span><div class=\"footnote-content\"><p>Indeed, a common defense for non-disclosure appears to be \"X billionaire is a personal friend of mine offering personal gifts,\" to demonstrate/claim it's not a financial/corporate transaction.</p></div></li></ol>", "parentCommentId": "xwjyfiiGbcTEKRXoK", "user": {"username": "Linch"}}, {"_id": "Jjtw7TWL2wwskWXbE", "postedAt": "2023-09-10T21:28:16.772Z", "postId": "MvwctfyZ9NrhPzyPj", "htmlBody": "<p>Great comment, though I'm still more confident of supreme court justices' professionalism than that of grantmakers. I also think perhaps your will to vote in favour of whomever is giving your friend free luxury trips is different from that to vote for their partner. You did make me more concerned about it than before though.</p>\n<p>I <em>will</em> say that money can also probably buy influence with grantmakers. Exaggerating a bit, why donate $1M when you can give a $10K gift to Alice and just tell her how much you think Bob deserves a $1M grant from her budget?</p>\n", "parentCommentId": "MBFJiFr7B9Kuh9YG5", "user": {"username": "Guy Raveh"}}, {"_id": "7CeRKKKyaf3CwXBwg", "postedAt": "2023-09-11T02:07:29.249Z", "postId": "MvwctfyZ9NrhPzyPj", "htmlBody": "<p>TLDR: I think you are right, it is generally fine.</p><p>I do a lot of thinking about hiring, so I'll chime in here. I think that work trials (work sample tests that are used to evaluate a candidate's skills during a hiring process) have plenty of potential for abuse, but generally work fine the way that EA orgs tend to do them. Off the top of my head, the main aspects that I would look at to make a judgement if it is fine or not (setting aside fairness/justice/accessibility aspects, and just focusing on power/exploitation dynamics):</p><ul><li>Time required. A lot of useful skills don't need 4 or 5 hours to be evaluated. My hypothesis (currently untested) is that most work trials could be 45 minutes or less.</li><li>Payment given. This is pretty clear: giving someone money in exchange for work seems more reasonable and less exploitative than asking someone do do some work for free.</li><li>Whether it is piece of real work. The worst version would just be to find a discrete chunk of work and have a job applicant do that. When combined with not being paid, this is the most obviously exploitative thing, because a company can literally just use candidates as free labor for any discrete &nbsp;tasks.</li><li>Respect/communication. This is a bit more fuzzy, but the mental model I have of the bad version of this is a candidate submitting a piece of work into the void and never hearing anything back. The best version of this involves feedback on what the candidate did well and what went poorly.</li></ul>", "parentCommentId": "fbDjsivqzvSFRaFN5", "user": {"username": "jlemien"}}, {"_id": "aZzouc4YRFXbqnhBg", "postedAt": "2023-09-11T02:23:16.046Z", "postId": "MvwctfyZ9NrhPzyPj", "htmlBody": "<p>Aside from animal liberation-style direct action activities, the things that most readily comes to my mind are labor law/employment law.</p><p>Hypothetical example: An organization having a team retreat in Mexico, in which they (employees who are not citizens of Mexico and who do not have the legal right to work in Mexico) do some work on their laptops. This seems very minor to me, and the risk of local tax authorities coming after some people doing a few hours of work on laptops while hanging out in their Airbnb seems miniscule. But it is something that employees travelling internationally for a team retreat should probably be aware of.</p><p>Similar issues would arise with a nomadic team, that moves around from country to country.</p><p>However, I don't view this as a major concern within the EA community. I'm responding more so to the idea of \"are there any laws EA orgs might ask their employees to break,\" rather than the idea of \"which of these are concerns worth bothering about.\"</p>", "parentCommentId": "FwGDuuHfv3DTHc8yw", "user": {"username": "jlemien"}}, {"_id": "e8Xgf3t9jdsk2JeQc", "postedAt": "2023-09-11T02:32:19.551Z", "postId": "MvwctfyZ9NrhPzyPj", "htmlBody": "<p>My hypothesis: it is some combination of A) they made these mistakes and learned from them, or B) things worked out by luck/fluke. (but it would be great if we could get some actual accounts, rather than just having me hypothesize about it)</p><p>By \"made these mistakes and learned from them,\" I mean scenarios like Alice and Bob worked together on a small team and dated and broke up and it was really hard to work together. But it didn't get publicized. Or Carl and Dan (a manager and a direct report) lived together as roommates, but it turned out that they were a really bad match as roommates, which affected their working relationship. Now neither of them live with workmates.</p><p>Of course, \"things worked out\" also probably happened. I can imagine 10 colleagues putting on swimsuits and hanging out in a hot tub together and nobody felt pressured or uncomfortable. Sometimes you take risks and things work out.</p><p>I'm not aware of much risk management in the EA community (aside from thinking about risks of careers and publicity), but these seem like perfect scenarios to apply a risk management framework.</p>", "parentCommentId": "Tc98oEXpLhstDXfSf", "user": {"username": "jlemien"}}, {"_id": "fFWGWaecxg8YHP3gP", "postedAt": "2023-09-11T02:35:43.214Z", "postId": "MvwctfyZ9NrhPzyPj", "htmlBody": "<p>Agreed that this is a good practice.</p>\n", "parentCommentId": "TGujaZeoWLG7hDPaC", "user": {"username": "casebash"}}, {"_id": "wkxSnHnA8GRe9zNWv", "postedAt": "2023-09-11T02:45:10.871Z", "postId": "MvwctfyZ9NrhPzyPj", "htmlBody": "<p>I think that if I am the <i>generic able-bodied person with no other commitments</i> then after work drinks are no problem. But maybe I have a history of alcoholism, and I can't be around alcohol. Or maybe I have kids to pick up from daycare, so I can't join. Or maybe I have an extra long commute and need to start heading home as soon as work ends. Or maybe it is as simply as having a small amount of hearing loss, such that even though office conversations are fine I literally can't hear anything in a bar with loud music and a dozen background conversations.</p><p>If it were just some friends hanging out then I think it wouldn't be so troublesome, but work relationships are often formed at \"after work drinks,\" and as a result some people are systematically (although unintentionally) excluded from the very events that make them more likely to get promotions, etc.</p><p>I wouldn't go so far as to put some kind of a ban on \"getting drinks,\" but I think that there should be consideration to benefits, risks, who is being excluded (and if it is justified to exclude them), etc. A lot of it is context-dependent, so we can't really make rules that apply to different organizations (what works for Org A might not work for Org B), but in general I am very much in agreement with you that I'd also \"like to see a bit more nuance and thought.\"</p>", "parentCommentId": "PocDkozM8Fc6GZg5K", "user": {"username": "jlemien"}}, {"_id": "hCRPYxcd5vktWnQt4", "postedAt": "2023-09-11T08:55:45.927Z", "postId": "MvwctfyZ9NrhPzyPj", "htmlBody": "<p>I wouldn't be <i>that</i> much more confident in the Supreme Court justices <i>in the US</i>. In the US, constitutional law, and the federal judiciary are <i>highly</i> politicized. The most visible and attention-grabbing parts of the job involve figuring out how to use the constitution and legal precedent to advance the policy goals of the Democrat or Republican party (or maybe your own idiosyncratic moral and political goals), whilst pretending, to yourself and others, that you are a neutral arbiter who is just applying the law.* This is why who gets appointed to the Supreme Court in the US has been so politicized since the late 80s, at an absolute minimum. (It's not a case of nasty right-wing populists appointing hacks and liberals appointing neutral professionals either, as far as I can tell.)&nbsp;<br><br>More generally, it's always easy to look at big important institutions and conclude \"that's where the sensible, competent adults are\". But nearly everyone who sees these institutions close up, seems to end up <i>somewhat</i> disabused of that belief. An acquaintance of mine who is a top Scottish civil servant told me they once had major problems in her department because they simply could not find a key administrative document. I don't know if you consider this \"unprofessional\", but I also know of another UK civil servant who's held highly responsible positions, who could be pretty reckless with their recreational drug use at parties. The Tory politician Michael Gove who has held multiple cabinet posts since the Tories got in in 2010, once had to admit to taking coke as a young man, at exactly the same time period as he was writing tabloid newspaper articles demand harsh punishment for cocaine users.&nbsp;<br><br>*For boring historical reasons, the last thing is a bit more common on the Republican side, and liberal judges tend to hew to theories of legal interpretation that make it a bit clearer they are to some degree making stuff up.&nbsp;</p>", "parentCommentId": "Jjtw7TWL2wwskWXbE", "user": {"username": "Dr. David Mathers"}}, {"_id": "3WnjSfdzWkfdmA6Tv", "postedAt": "2023-09-11T11:20:50.737Z", "postId": "MvwctfyZ9NrhPzyPj", "htmlBody": "<p>I'm basing this view on two things:</p>\n<ol>\n<li>Supreme court judges in any country have vastly more experience in their profession than EA grantmakers.</li>\n<li>They have to do a much more thorough job of justifying their decisions and connecting them to constitutional law and case law, even if they have an agenda.</li>\n</ol>\n", "parentCommentId": "hCRPYxcd5vktWnQt4", "user": {"username": "Guy Raveh"}}, {"_id": "tGqHzvS6dARRxFepc", "postedAt": "2023-09-11T15:29:06.771Z", "postId": "MvwctfyZ9NrhPzyPj", "htmlBody": "<p>Thanks for re-emphasizing these norms.</p>\n<p>For those who disagree with these norms, these sources help explain why they are important:</p>\n<ul>\n<li><a href=\"https://forum.effectivealtruism.org/posts/fovDwkBQgTqRMoHZM/power-dynamics-between-people-in-ea\">Power dynamics between people in EA</a></li>\n<li><a href=\"https://www.youtube.com/watch?v=BxRS5HQZgEc\">Coercive Dynamics in EA Bay Area (response to Time Mag)</a></li>\n</ul>\n<p>The sub-population that disagrees with these norms has substantial overlap with the sub-population that would most benefit from them.</p>\n<p>I suspect that there is significant geographic concentration in the bay area as well, because of a culmination of factors including housing prices pushing people to group homes, gender ratios, tech/startup culture, and the co-existence of the rat community.</p>\n<p>I don't think the situation will get better, despite the attempt at norm setting, until the locus of EA money and power isn't as concentrated in the bay area.</p>\n", "parentCommentId": null, "user": {"username": "MatthewDahlhausen"}}, {"_id": "rqpe6bftRxTNwTyMv", "postedAt": "2023-09-11T18:10:30.165Z", "postId": "MvwctfyZ9NrhPzyPj", "htmlBody": "<p>What exactly is 'dangerous' about expressing concern that Rockwell's post comes across as sex-negative, drug-negative, and cohousing-negative?&nbsp;</p><p>Is open discussion of a community's social norms 'dangerous'?</p>", "parentCommentId": "er3JjiBXzjmWHcaKt", "user": {"username": "geoffreymiller"}}, {"_id": "aFng35bgz5nSJYSzM", "postedAt": "2023-09-11T18:20:21.436Z", "postId": "MvwctfyZ9NrhPzyPj", "htmlBody": "<p>Nathan - thanks for your support here.</p><p>I've noticed that every time I post something critical of coddling culture or runaway safetyism or the way that woke politics is undermining EA culture, I get seriously downvoted. &nbsp;I don't get downvoted like that when I post about AI safety, parenting as an EA, teaching EA classes, or any other topic.&nbsp;</p><p>So I suspect there are a lot of political biases at work here.</p>", "parentCommentId": "bLxkatmQ94dbEjQDg", "user": {"username": "geoffreymiller"}}, {"_id": "T345LKqAXCkbvgu5f", "postedAt": "2023-09-12T07:25:27.572Z", "postId": "MvwctfyZ9NrhPzyPj", "htmlBody": "<p>It seems a little weird to me that most of the replies to this post are jumping to the practicalities/logistics of how we should/shouldn't implement official, explicit, community-wide bans on these risky behaviours.<br><br>I totally agree with OP that all the things listsed above generally cause more harm than good. Most people in other cultures/communities would agree that they're the kind of thing which should be avoided, and most other people succeed in avoiding them without creatiing any explicit institution responsible for drawing a specific line between correct/incorrect behavior or implementing overt enforcment mechanisms.<br><br>If many in the community don't like these kind of behaviours, we can all contribute to preventing them by judging things on a case-by-case basis and gently but firmly letting our peers know when we dissaprove of their choices. If enough people softly disaprove of things like drug use, or messy webs of romantic entanglement - this can go a long way towards reducing their prevalance. No need to draw bright lines in the sand or enshrine these norms in writing as exact rules.</p>", "parentCommentId": null, "user": {"username": "Xavier_ORourke"}}, {"_id": "oHgxMMfHTR7DhTQvY", "postedAt": "2023-09-12T07:54:52.952Z", "postId": "MvwctfyZ9NrhPzyPj", "htmlBody": "<p>Yeah, I feel something like this, though I like that people feel happy to express it.&nbsp;</p><p>I guess I want to try and pull it out and actually have the discussion.</p>", "parentCommentId": "aFng35bgz5nSJYSzM", "user": {"username": "nathan"}}, {"_id": "Hbtkqgjhi8GmRiwq9", "postedAt": "2023-09-14T01:14:19.535Z", "postId": "MvwctfyZ9NrhPzyPj", "htmlBody": "<p>A gripe I have with EA is that it is not radical enough. The american civil rights movement of 1950-1960s was very effective and altruistic, even though it's members were arrested, and it's leaders were wiretapped by the FBI and assassinated in suspicious ways. Or consider the stonewall riots.<br>More contemporarily, I think Uber is good for the world counterfactually. It's good that Nakamoto made bitcoin. It's good that Snowden leaked the NSA stuff. (probably, I'm less sure about the impact of these examples.)<br><br>Most crime is bad, and most altruistic crime is ineffective or counterproductive. But not all.</p>", "parentCommentId": "EyQEof64pSM8RHyb2", "user": {"username": "Sinclair Chen"}}, {"_id": "z7ZRaeiJMo4rppf9R", "postedAt": "2023-09-14T01:50:44.943Z", "postId": "MvwctfyZ9NrhPzyPj", "htmlBody": "<p>- Voluntary human challenge trials<br>- Run a real money prediction market for US citizens<br>- Random compliance stuff that startups don't always bother with: GDPR, purchased mailing lists, D&amp;I training in california, ...<br><br>Here are some illegal (or gray-legal) things that I'd consider effectively altruistic though I predict no \"EA\" org will ever do:<br>- Produce medicine without a patent<br>- Pill-mill prescription-as-a-service for certain medications<br>- Embryo selection or human genome editing for intelligence<br>- Forge college degrees<br>- Sell organs<br>- Sex work earn-to-give<br>- Helping illegal immigration</p>", "parentCommentId": "FwGDuuHfv3DTHc8yw", "user": {"username": "Sinclair Chen"}}, {"_id": "dwBTEe26HtGorcuJf", "postedAt": "2023-09-14T14:19:41.271Z", "postId": "MvwctfyZ9NrhPzyPj", "htmlBody": "<p>A lot of these are phrased in ways that immediately sound like \"oh, well of course you wouldn't do <em>that</em>\", but the situations in which people end up doing them are generally much more ambiguous. When I think over my ~15y in the workplace I can find examples of essentially all of these, in my life or a close coworker, that I wouldn't classify as probably a bad idea:</p>\n<blockquote>\n<p>Live with coworkers, especially when there is a power differential and especially when there is a direct report relationship</p>\n</blockquote>\n<p>In ~2016 one of my housemates who I'd been friends with for 5+ years recruited another of my housemates (who I'd been friends with for 10+ years) to join an EA-aligned company. The next year they recruited me as well. None of us reported to each other, but both of them were tenants of mine (my wife and I owned the house) and we were something like three of five people working for the company in Boston at the time.</p>\n<p>I do think there was risk here, but I also think it was a pretty small one, and this would not have been a good reason for either me or my other housemate to say \"sorry, not going to consider this job\".</p>\n<blockquote>\n<p>Date coworkers, especially when there is a power differential and especially when there is a direct report relationship</p>\n</blockquote>\n<p>In ~2018 while I was working on a team of ~20 at a tech company, two of my coworkers (reporting peers of each other, but I think maybe one was the tech lead of the other) realized they liked each other.  They talked to our manager and HR, one of them moved to another team, and they started dating.  As of when I last caught up with them a few months ago they were still together.  There was definitely risk here, but from the outside it seems like the process for handling it was good, and it would be really sad for both of them if this relationship hadn't happened.</p>\n<p>In ~2008 my girlfriend (now wife) and I applied for a seasonal job where we'd both be working in the kitchen.  We disclosed this relationship to the hiring manager, and while I would normally have reported to the person in my girlfriend's role they set things up so I'd report to someone else.  This wasn't an issue, and I think refusing to hire us because we were dating would have been worse for both the employer and us. Some coworkers dated each other while we were there, and I think this was generally positive.</p>\n<p>On the other hand, cases where the organization does not adjust the org chart in response to relationships are <em>much</em> more risky and almost always a bad idea.  Managers shouldn't date their reports, and neither should anyone date someone where they have significant power over their career. This does mean sometimes choosing between exploring the possibility of a relationship and continuing specific career plans.</p>\n<blockquote>\n<p>Promote drug use among coworkers, including legal drugs, and including alcohol and stimulants</p>\n</blockquote>\n<p>Something like every place I've worked made alcohol available to employees in social situations, plus caffeine in ~all situations. If this had been cocaine I think we'd clearly see that as promoting cocaine consumption.</p>\n<p><em>Pressuring</em> people to consume drugs seems quite different, and that I'd agree is almost never a good idea.</p>\n<blockquote>\n<p>Live with their funders/grantees, especially when substantial conflict-of-interest mechanisms are not active ... Date their funders/grantees, especially when substantial conflict-of-interest mechanisms are not active</p>\n</blockquote>\n<p>In ~2015 when I was earning to give a large portion of my earnings went to CEA, which employed my wife (who I also lived with). When the EA Infra fund became available I started donating there instead, because a dynamic where I was donating to my wife's employer didn't seem ideal, but I don't think this was so risky that I should have refrained from donating to CEA until then.</p>\n<p>How risky this category is depends a lot on how large a portion of the relationship each party is. In ~2015 my donations to CEA were ~$85k, which (I think) was a single-digit portion of their fundraising and my wife was one of ~20 employees. There's also a sense in which this is different because once I earned the money it was legally joint property with my wife, though at the time our agreement was we each chose where our earnings went.</p>\n<p>I do agree that this category is generally pretty risky, though, and how you handle CoI matters a lot.</p>\n<blockquote>\n<p>Date the partner of their funder/grantee, especially when substantial conflict-of-interest mechanisms are not active</p>\n</blockquote>\n<p>No direct experience with this one (not polyamorous) thought it seems like a slightly weaker case of the previous one.</p>\n<blockquote>\n<p>Retain someone as a full-time contractor or grant recipient for the long term, especially when it might not adhere to legal guidelines</p>\n</blockquote>\n<p>I agree we should follow the law on contractors vs employees, but I don't actually understand what this is trying to get at beyond that?  What's the sort of situation it's trying to avoid?</p>\n<blockquote>\n<p>Offer employer-provided housing for more than a predefined and very short period of time, thereby making an employee’s housing dependent on their continued employment and allowing an employer access to an employee’s personal living space</p>\n</blockquote>\n<p>In ~2017 I was considering accepting an offer to work for a for-profit EA-adjacent startup in Africa, and the offer to provide housing was a strong positive. In moving to a very different environment, having the support of coworkers who've gone through something similar sounded really valuable.</p>\n<p>From ~2016-2020 my wife and I employed a series of au pairs to watch our kids, which included providing them a room in our house.</p>\n<p>In ~2008 my girlfriend (now wife) and I worked at a seasonal job in a rural area, which included on-site housing.  Not having to commute was a strong positive.</p>\n<p>...</p>\n<p>Now, for all of these I can also easily imagine cases where the risk was not worth it and it went poorly, but I think \"probably shouldn't do\" is too strong overall.</p>\n", "parentCommentId": null, "user": {"username": "Jeff_Kaufman"}}, {"_id": "reQKnehkZRApvYJ2m", "postedAt": "2023-09-14T17:48:39.267Z", "postId": "MvwctfyZ9NrhPzyPj", "htmlBody": "<p>These comments are helpful but I'm still having a difficult time zeroing in on a guiding heuristic here. And I feel mildly frustrated by the counterexamples in the same way I do reading \"well, they were always nice to me\" comments on a post about a bad actor who deeply harmed someone or hearing someone who routinely drives drunk say \"well, I've never caused an accident.\" I think most (but not all) of my list falls into a category something like \"fine or tolerable 9 times out of 10, but really bad, messy, or harmful that other 1 time such that it <i>may</i> make those other 9 times less/not worth it.\" I'm not sure of the actual probabilities and they definitely vary by bullet point.<br><br>In your case in particular, I'll note that a good chunk of your examples either directly involve Julia or involve you (the spouse of Julia, who I assume had Julia as a sounding board). This seems like a rare situation of being particularly well-positioned to deal with complicated situations. Arguably, if anyone can navigate complicated or risky situations well, it will be a community health professional. I'd assume something like 95% of people will be worse at handling a situation that goes south, and maybe &gt;25% of people will be distinctly bad at it. So what norms should be established that factor in this potential? And how do we universalize in a way that makes the risk clear, promotes open risk analysis, and prevents situations that will get <i>really</i> bad should they get bad?</p>", "parentCommentId": "dwBTEe26HtGorcuJf", "user": {"username": "Rockwell Schwartz"}}, {"_id": "cKHkcz8xrgvbHdhDo", "postedAt": "2023-09-14T19:55:16.678Z", "postId": "MvwctfyZ9NrhPzyPj", "htmlBody": "<p><i>Edited to clarify that my experiences were all with the same organization.</i><br><br>Some personal examples:<br><br>I worked for an EA-adjacent organization and was repeatedly asked, and witnessed co-workers being asked, to use campaign donation data to solicit people for political and charitable donations. This is illegal<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefw4yv7y5dckj\"><sup><a href=\"#fnw4yv7y5dckj\">[1]</a></sup></span>. My employer openly stated they knew it was illegal, but said that it was fine because \"everyone does it and we need the money\". I was also asked, and witnessed other people being told, to falsify financial reports to funders to make it look like we had spent grant money that, in various situations, we either: hadn't spent, didn't know whether we'd spent it or not, or may have spent on things that the grant hadn't been given for. Depending on how the specific sums of monies had actually been spent, that was anywhere from illegal to at least a massive breach of the contracts with our funders.</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnw4yv7y5dckj\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefw4yv7y5dckj\">^</a></strong></sup></span><div class=\"footnote-content\"><p>https://www.fec.gov/updates/sale-or-use-contributor-information/</p></div></li></ol>", "parentCommentId": "FwGDuuHfv3DTHc8yw", "user": {"username": "KyleGracey"}}, {"_id": "KnhgXNKk5XFoAbae2", "postedAt": "2023-09-15T17:58:34.277Z", "postId": "MvwctfyZ9NrhPzyPj", "htmlBody": "<p>to use a harder one: I agree co-workers dating has a lot of potential complications, and power differentials make it worse. But the counterfactual isn't necessarily \"everyone gets jobs as good or better, with no negative consequences.\". It's things like&nbsp;</p><p>I have a friend who has provided hundreds of hours of labor towards EA causes, unpaid. The lack of payment isn't due to lack of value- worse projects in her subfield get funded all the time. But her partner works at a major grantmaker, and she's not very assertive, and so it never happens.&nbsp;</p><p>You can blame this on her being unassertive, but protecting unassertive people is a major point of these rules.&nbsp;</p>", "parentCommentId": "bd428B9pZReQDT6Y4", "user": {"username": "Elizabeth"}}, {"_id": "jSCLXbEtRgcemfDjt", "postedAt": "2023-09-15T18:03:29.474Z", "postId": "MvwctfyZ9NrhPzyPj", "htmlBody": "<p>I fixed the results page of the poll and I think it's pretty interesting.&nbsp;<br><br>Poll: <a href=\"https://viewpoints.xyz/polls/ea-norms\">https://viewpoints.xyz/polls/ea-norms</a><br><br>Results:<i> </i><a href=\"https://viewpoints.xyz/polls/ea-norms/results\">https://viewpoints.xyz/polls/ea-norms/results</a></p><p>Most EAs seem to think some of these risk behaviours are fine.</p><figure class=\"image\"><img src=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/jSCLXbEtRgcemfDjt/fngrt2jfalmouyrg9fqi\" srcset=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/jSCLXbEtRgcemfDjt/rea4oz5ccc0nydfpot7p 144w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/jSCLXbEtRgcemfDjt/a37mcbcfrg9ut3g9fzy6 224w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/jSCLXbEtRgcemfDjt/ibgbmmzi4ykcvsudi3ut 304w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/jSCLXbEtRgcemfDjt/rpvii0syj2cn7ak1psas 384w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/jSCLXbEtRgcemfDjt/pxluuk9sesquvqwxgqko 464w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/jSCLXbEtRgcemfDjt/f8yxbrkqm8ev6xoewa8j 544w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/jSCLXbEtRgcemfDjt/cln8niyuamr0lws8qrky 624w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/jSCLXbEtRgcemfDjt/m7gy0apq2aliwjymfe6h 704w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/jSCLXbEtRgcemfDjt/cxjeytsb63fqrbrt8ck2 784w\"></figure><p>Likewise there is a lot of disagreement.</p><figure class=\"image\"><img src=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/jSCLXbEtRgcemfDjt/sdgt58zmegosytdtupcm\" srcset=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/jSCLXbEtRgcemfDjt/jikj0esysdqsnj2lgnok 109w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/jSCLXbEtRgcemfDjt/ybtrxoxbqbzugrymgplu 189w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/jSCLXbEtRgcemfDjt/dauc1wcrfeqrwbk6dy8s 269w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/jSCLXbEtRgcemfDjt/zmmtrsbtqopkaxtoo00w 349w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/jSCLXbEtRgcemfDjt/avcofzyzi1pvurvszdvn 429w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/jSCLXbEtRgcemfDjt/dextoao10pereanyheys 509w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/jSCLXbEtRgcemfDjt/es4r8c3wr2ehrkoophh5 589w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/jSCLXbEtRgcemfDjt/pcombyqilkm2eixrzxn7 669w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/jSCLXbEtRgcemfDjt/ieeoaai5bwlz8zqku6h1 749w\"></figure><p>And there was a lot of uncertainty (the question mark option)</p><figure class=\"image\"><img src=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/jSCLXbEtRgcemfDjt/ctwjuevgzfclmkg5srun\" srcset=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/jSCLXbEtRgcemfDjt/r3cmjcuhb0nmhwalvubj 92w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/jSCLXbEtRgcemfDjt/o2m5m5hhmgob4kta6sqh 172w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/jSCLXbEtRgcemfDjt/zsdblk8ahuvaiyhzb1ce 252w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/jSCLXbEtRgcemfDjt/sju5ssx0u8mwpro6hegv 332w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/jSCLXbEtRgcemfDjt/dzpmmqmfww67syp7nhg8 412w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/jSCLXbEtRgcemfDjt/ekds9x7reobtu2zznpth 492w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/jSCLXbEtRgcemfDjt/lnwee8akfes8ohl0vt6g 572w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/jSCLXbEtRgcemfDjt/xs6gafsjb1wctuap6jgu 652w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/jSCLXbEtRgcemfDjt/r4hm7xwlsaw0dqplnfcf 732w\"></figure>", "parentCommentId": null, "user": {"username": "nathan"}}, {"_id": "iQK9yLH89dodLZ9dB", "postedAt": "2023-09-16T11:20:35.012Z", "postId": "MvwctfyZ9NrhPzyPj", "htmlBody": "<blockquote><p>I worked for an EA-adjacent organization and was asked, and witnessed other people being told, to falsify financial reports to funders to make it look like we had spent grant money that, in various situations, we either: hadn't spent, didn't know whether we'd spent it or not, or may have spent on things that the grant hadn't been given for. Depending on how the specific sums of monies had actually been spent, that was anywhere from illegal to at least a massive breach of the contracts with our funders.</p></blockquote><p>Wtf?! &nbsp;This is extremely concerning.</p>", "parentCommentId": "cKHkcz8xrgvbHdhDo", "user": {"username": "Vivek Hebbar"}}, {"_id": "fgBpcJ4QssGNuKc9t", "postedAt": "2023-09-16T20:56:32.760Z", "postId": "MvwctfyZ9NrhPzyPj", "htmlBody": "<p>Typo?\n“I believe there is a reasonable risk should EAs:”</p>\n<p>Do you mean “a reasonable risk <em>if</em> EAs” or\n“a reasonable risk that EAs should <em>not</em>…”</p>\n<p>The wording is confusing to me</p>\n", "parentCommentId": null, "user": {"username": "nananana.nananana.heyhey.anon"}}, {"_id": "HxsRzRLMQwfvNuAJX", "postedAt": "2023-09-16T23:02:05.739Z", "postId": "MvwctfyZ9NrhPzyPj", "htmlBody": "<p><a href=\"https://en.wiktionary.org/wiki/should\">https://en.wiktionary.org/wiki/should</a></p>\n<p>Look at definition 3 and at the usage notes.</p>\n", "parentCommentId": "fgBpcJ4QssGNuKc9t", "user": {"username": "Guy Raveh"}}, {"_id": "3SzaqcjpPzNGXt3zR", "postedAt": "2023-09-17T00:21:05.284Z", "postId": "MvwctfyZ9NrhPzyPj", "htmlBody": "<p>I understand the usage of “should” in this context. I was noting that it reads oddly to me, like a possible typo, and could be written to read more clearly.</p>\n", "parentCommentId": "HxsRzRLMQwfvNuAJX", "user": {"username": "nananana.nananana.heyhey.anon"}}, {"_id": "AcubAE3zcfvgDrqfE", "postedAt": "2023-09-17T00:35:34.150Z", "postId": "MvwctfyZ9NrhPzyPj", "htmlBody": "<p>Just noting though that this would be a false dichotomy.</p>\n<p>I agree that we shouldn’t have a universal ban on co-living and that bureaucracy is bad all else equal. But this doesn’t seem like the only option available. As Xavier_ORourke said above:\n“we can all contribute to preventing [the bullet pointed actions] by judging things on a case-by-case basis and gently but firmly letting our peers know when we disapprove of their choices”</p>\n<p>I feel that our tendency as EAs to think of ourselves as analogous to one org where we can “ban” something is an issue within itself. Intuitively, there feels a lot of value gained by thinking of ourselves more like social a movement, where we are only ever in the business of making cultural norms instead of rules.</p>\n", "parentCommentId": "iHNgkGdqGjxeY8zxu", "user": {"username": "TomBill"}}, {"_id": "EdFuWw2SGuZo2bsak", "postedAt": "2023-09-17T08:52:22.159Z", "postId": "MvwctfyZ9NrhPzyPj", "htmlBody": "<p>Sorry for the assumption then (I'm not a native speaker myself). But it looks fine to me.</p>\n", "parentCommentId": "3SzaqcjpPzNGXt3zR", "user": {"username": "Guy Raveh"}}, {"_id": "7Ns2hwbAziLbQbJLe", "postedAt": "2023-09-18T00:56:54.708Z", "postId": "MvwctfyZ9NrhPzyPj", "htmlBody": "<p>No problem, thanks for the wiki link</p>\n", "parentCommentId": "EdFuWw2SGuZo2bsak", "user": {"username": "nananana.nananana.heyhey.anon"}}, {"_id": "kqqEse74Py4CJSC6G", "postedAt": "2023-09-18T19:05:48.514Z", "postId": "MvwctfyZ9NrhPzyPj", "htmlBody": "<p>Most of these \"date co-workers\" and \"live with co-workers\" examples seem to be where there is little power differential. For me the bigger the power differential, the bigger the risk, perhaps even growing exponentially (high uncertainty) the higher the differential.</p>", "parentCommentId": "dwBTEe26HtGorcuJf", "user": {"username": "NickLaing"}}, {"_id": "Fza7oKty6JKzX7jwr", "postedAt": "2023-09-25T15:11:54.442Z", "postId": "MvwctfyZ9NrhPzyPj", "htmlBody": "<p>Yea I am also confused about this. I know a bunch of ea-affiliated people in group houses and I've never heard any of them imply that the house is somehow endorsed/sponsored by cea or anything if the sort. If they ever do call it \"an ea house\" everyone is clear that they just mean it's a house with people who are interested in ea and I don't think there has been any misunderstanding around that. So what's the issue?</p>\n", "parentCommentId": "D2m5FGkELDdxwf8y6", "user": {"username": "justsaying"}}, {"_id": "jhQBhkjKbnuo2vrYc", "postedAt": "2023-09-25T15:25:38.672Z", "postId": "MvwctfyZ9NrhPzyPj", "htmlBody": "<p>I too get extremely annoyed by some anti-power-differential rhetoric that I see on the forum a lot and I think that any attempt to police that through norms or other means is an unacceptable violation of privacy. I agree this post has some elements of that or at least is not clear about the motivations.</p>\n<p>However, I think many of the specific things proposed here are on the basis of conflicts of interest rather than power differentials. I see no issue dating co-workers including ones more/less senior than you but I think there is a real problem dating someone in your chain of command because then there are conflicts of interest at play. For this reason I have no issue if one partner finds another with their own money but it seems unethical to dating grantees if you are awarding grants on behalf of another person/organization without disclosing the relationship.</p>\n<p>Would you agree that such conflict of interest is a legitimate concern rather than an element of safety culture?</p>\n", "parentCommentId": "6EYBoT2ZkuQsrQqHv", "user": {"username": "justsaying"}}, {"_id": "cQc7qFKeh4RMNGmaE", "postedAt": "2023-09-25T21:49:19.880Z", "postId": "MvwctfyZ9NrhPzyPj", "htmlBody": "<p>I generally agree that clear, specific conflicts of interest are a bigger problem for relationships that mix professional and sexual roles, than vague 'power differentials' (which could include virtually <i>any</i> differences between partners in their wealth, status, prestige, fame, age, influence, intelligence, citation count, job seniority, etc.)&nbsp;</p>", "parentCommentId": "jhQBhkjKbnuo2vrYc", "user": {"username": "geoffreymiller"}}]