[{"_id": "Xt3CTfjR6kYxc5Nza", "postedAt": "2023-07-10T15:20:44.629Z", "postId": "MWkG4F86p4pyE3Sx9", "htmlBody": "<p>Thanks for posting this, I have a few questions.&nbsp;</p><p>Do you have any other metrics besides visiting the website? Is there a link such as \"learn more about veganism\" that you can track?&nbsp;</p><p>Besides anecdotes, do you have evidence/data that the \"dog meat\" intervention works better than other interventions?</p><p>I do worry that while shock value may work for some people, it could push other people further away from veganism (especially if they felt deceived). But, I am unsure how serious (or important) this concern is.&nbsp;</p>", "parentCommentId": null, "user": {"username": "benleo"}}, {"_id": "ueqK6qpKpE2ZT7eeP", "postedAt": "2023-07-10T16:08:49.759Z", "postId": "MWkG4F86p4pyE3Sx9", "htmlBody": "<p>Great questions!<br><br>Allied Scholars doesn't run the dog meat website, that's <a href=\"https://mollyelwood.com/\">Molly Elwood</a>. I'm not sure what kinds of metrics she has for that.</p><p>We haven't collected rigorous data on engagement, but I'm very enthusiastic about people doing that kind of thing. There have been a few studies over the years suggesting that leafletting doesn't really work (see <a href=\"https://animalcharityevaluators.org/research/reports/leafleting/2014-march/2013-leafleting-study/\">ACE</a> and <a href=\"https://faunalytics.org/impact-leaflets-controlled-study/\">Faunalytics</a>), but I suspect there are lots of potential outreach tactics that work much better than leafletting. For example, Faunalytics found that showing people factory farming footage has a <a href=\"https://faunalytics.org/wp-content/uploads/2017/12/Animal-Equality-Report-Final.pdf\">meaningful impact on behavior and attitudes around pork</a>.</p><p>I'd love to see Faunalytics or other orgs study a broader variety of outreach tactics – I think there's a risk that people see a study saying \"leafletting doesn't work\" and conclude that vegan outreach in general is a lost cause. This is something I plan to write more about later this summer.</p><p>Anecdotally, when I've done standard vegan leafletting (with a sign that says \"Why Aren't You Vegan Yet?\") less than 1% of passerby engaged at all. With the dog meat stand, it felt more like 10%, though the number could easily be higher or lower and I'd have to actually keep track to know for sure.</p><p>There's always a risk of pushing people away, but IMO this can mostly be mitigated if the organizers are nice to people in conversation.</p>", "parentCommentId": "Xt3CTfjR6kYxc5Nza", "user": {"username": "Benny Smith"}}, {"_id": "oPuDxJPne3tgaCbGf", "postedAt": "2023-07-10T16:49:54.369Z", "postId": "MWkG4F86p4pyE3Sx9", "htmlBody": "<p>Do you think any people were really turned off by this? This would be my concern. That people would get really annoyed by this as an unfair mockery of the meat eating position. Do you think this happens?</p>", "parentCommentId": null, "user": {"username": "nathan"}}, {"_id": "vqfsrcTEsniRB9uuF", "postedAt": "2023-07-10T19:51:00.467Z", "postId": "MWkG4F86p4pyE3Sx9", "htmlBody": "<p>I don't think people who spoke to us were significantly turned off; the outreach volunteers weren't overly aggressive or pushy.<br><br>People who walked past without engaging may have thought it was weird, but it's hard to know what someone thinks if they don't stop to talk.</p><p>Unfortunately, the paucity of social science research on vegan outreach makes it hard to know what works and what doesn't. I imagine there's research on outreach for other causes that could be relevant, but I haven't looked into this.</p><p>By default I expect more engagement with pro-vegan arguments to be a good thing, and the dog meat stand got a lot more engagement than other outreach tactics I've tried.</p>", "parentCommentId": "oPuDxJPne3tgaCbGf", "user": {"username": "Benny Smith"}}, {"_id": "hC2BnuBTWFuBispCz", "postedAt": "2023-07-11T12:09:11.533Z", "postId": "MWkG4F86p4pyE3Sx9", "htmlBody": "<p>I'm all for experimenting with strategies for vegan outreach! Do you know of any RCTs that actually test the behavioral effects (i.e. eating meat or not) of interventions like this? I was thinking of doing a little lit review to show just how little we know about what moves the needle here</p>", "parentCommentId": null, "user": {"username": "setgree"}}, {"_id": "7mn3FszveKAyX3MzB", "postedAt": "2023-07-11T13:53:55.717Z", "postId": "MWkG4F86p4pyE3Sx9", "htmlBody": "<p>Yeah!&nbsp;</p><ul><li>Faunalytics did an RCT comparing showing <a href=\"https://faunalytics.org/wp-content/uploads/2017/12/Animal-Equality-Report-Final.pdf\">people 2D factory farming footage to 3D VR</a>. They found that both led to lower pork consumption than the control group, and that the VR was not a meaningful improvement over 2D screens.</li><li>Another Faunalytics study compared students' self-reported willingness to reduce consumption <a href=\"https://faunalytics.org/video-comparison-study-youth-response-to-four-vegetarianvegan-outreach-videos/\">after viewing different videos</a>.</li><li>The Humane League did RCTs on showing people a documentary on health, environment, &amp; animal welfare reasons for veganism and <a href=\"https://thehumaneleague.org/article/gfu-rcts\">did not find a significant effect on meat consumption</a>. Notably, in the conclusion the authors say that \"Novel intervention strategies may be needed to meaningfully shift dietary consumption away from meat and animal products.\"</li><li>On the other hand, THL also published a meta-analysis with encouraging implications for <a href=\"https://assets.ctfassets.net/ww1ie0z745y7/2C2MRhKXpVbIlg6w6TZAb6/dcea6f3714ab0218c473cb0fea4fa514/Reducing-meat-consumption-appealing-animal-welfare-meta-analysis.pdf\">interventions that focus on animal welfare-related messaging</a>.</li></ul><p>THL lists a few <a href=\"https://thehumaneleague.org/research-reports\">other relevant studies here</a> that I haven't looked at. There were also the leafletting studies by <a href=\"https://animalcharityevaluators.org/research/reports/leafleting/2014-march/2013-leafleting-study/\">ACE</a> and <a href=\"https://faunalytics.org/impact-leaflets-controlled-study/\">Faunalytics</a>, both of which found leafletting to be ineffective.&nbsp;</p><p>With a lot of these studies, reliance on self report means that there are problems like social desirability bias.</p><p>I've also been thinking of writing up some kind of review, feel free to DM me if you want to collaborate :)</p>", "parentCommentId": "hC2BnuBTWFuBispCz", "user": {"username": "Benny Smith"}}, {"_id": "gNsqd9QPyGinbLFxJ", "postedAt": "2023-07-11T17:38:48.400Z", "postId": "MWkG4F86p4pyE3Sx9", "htmlBody": "<p>Thank you! Self-reported is better than nothing but worse than, eg, collecting grocery bills or monitoring consumption in a common space like a dorm-specific cafeteria. Ideal implementation partner for this kind of study is meal kit or grocery delivery company.  Will take a closer look shortly</p>\n", "parentCommentId": "7mn3FszveKAyX3MzB", "user": {"username": "setgree"}}, {"_id": "DWJa3Mpfv9teD327k", "postedAt": "2023-07-15T07:03:46.957Z", "postId": "MWkG4F86p4pyE3Sx9", "htmlBody": "<p>I'm curious: How many people actually tried or wanted to try out the dog meat?</p>\n", "parentCommentId": null, "user": {"username": "Jeroen_W"}}, {"_id": "MgA4kxojCga4mNKsw", "postedAt": "2023-07-15T07:04:44.853Z", "postId": "MWkG4F86p4pyE3Sx9", "htmlBody": "<p>Also for passer-by's perhaps having large QR codes that lead to Elwood's website is handy.</p>\n", "parentCommentId": "DWJa3Mpfv9teD327k", "user": {"username": "Jeroen_W"}}, {"_id": "PMDWYpt6Wc4MZQPdC", "postedAt": "2023-07-16T02:31:18.367Z", "postId": "MWkG4F86p4pyE3Sx9", "htmlBody": "<p>Thanks, I like the QR code idea!</p><p>I'm not sure about exact numbers but I'd estimate ~30% seemed genuinely interested in trying dog meat</p>", "parentCommentId": "MgA4kxojCga4mNKsw", "user": {"username": "Benny Smith"}}, {"_id": "stYRNtDLkMm78Er82", "postedAt": "2023-07-17T08:36:24.893Z", "postId": "MWkG4F86p4pyE3Sx9", "htmlBody": "<p>Wow! Not sure what to conclude from that.</p>\n", "parentCommentId": "PMDWYpt6Wc4MZQPdC", "user": {"username": "Jeroen_W"}}]