[{"_id": "5kebaSHeWWf8GQzhe", "postedAt": "2023-11-13T10:30:55.719Z", "postId": "MwmdpSBMuzNDmvNHp", "htmlBody": "<p>I'd like to push back on this logically, with again the recognition that this is a very sensitive topic, and that emotional reactions are valid.&nbsp;</p><p>According to the <a href=\"https://en.wikipedia.org/wiki/Prenatal_development\">sources on wikipedia</a>, Brain synapses in foetuses do not form until week 17, and the first evidence of \"minimal consciousness and ability to feel pain\" does not occur until week 30.&nbsp;</p><p>Only <a href=\"https://www.kff.org/womens-health-policy/fact-sheet/abortions-later-in-pregnancy/\">1% of abortions</a> in the US occur after 21 weeks of pregnancy.</p><p>I think there's a bit of motte and bailey going on here, where you use <i>all abortions</i> in your statistics about why this is a significant issue, but only <i>late term abortions</i> in your defence of foetus moral relevance.&nbsp;</p><p>Even if we grant some moral weight to a 15 week old foetus (which I'm dubious of), it's hard to see a logical reason why it would approach the morally significance of an adult chicken. And tens of billions of those are killed every year, and many of them are tortured beforehand.&nbsp;</p><p>I see no way for abortion bans (ie: &nbsp;forcing women by threat of force to put their health and lives at risk to bear unwanted children) to compete morally or logically against animal welfare interventions.&nbsp;</p>", "parentCommentId": null, "user": {"username": "titotal"}}, {"_id": "jpHEqPLhDPoaXiiSB", "postedAt": "2023-11-13T13:54:56.531Z", "postId": "MwmdpSBMuzNDmvNHp", "htmlBody": "<p>Hi, thank you for your comment. To try and respond:</p><ol><li>I did try to be clear in distinguishing late abortions from all abortions - sorry if I did not explain myself very clearly! The large majority of the post - including all the arguments and references in the section on the ethics of abortion - refers to abortion in general, and is applicable to all abortions. So I do not think it is true that I used only late term abortions in my defence of fetal moral status. I only introduced late-term abortion in one short paragraph, where (I think) I made it clear that I was offering this as a separate argument even for those who were unpersuaded by the main post, and clarified the (reduced, but still large) scale of the problem for people who fall into that camp: \"<strong>Even if</strong> one has no problem with early abortion, 10% of abortions are after 13 weeks’ gestation, at which point fetuses are&nbsp;<a href=\"https://www.nhs.uk/pregnancy/week-by-week/1-to-12/12-weeks\">fully formed</a>, and likely conscious and&nbsp;<a href=\"https://jme.bmj.com/content/46/1/3\">able to feel pain</a>.<a href=\"https://forum.effectivealtruism.org/posts/MwmdpSBMuzNDmvNHp/the-effective-altruist-case-for-pro-life-anti-abortion?commentId=5kebaSHeWWf8GQzhe#_ftn9\">[9]</a> This would amount to at least 3 million relatively late abortions each year globally – and potentially many more if abortion were to become more normalised and permitted around the world.\"</li><li>I'm aware that Wikipedia has a certain perspective on fetal pain - as it does on many things! - but I think that the evidence shows that perspective to be false. I linked to a recent paper from the world's leading researcher on this topic (Stuart Derbyshire) who used to hold something like the Wikipedia view, but who has now changed his mind because of evidence of thalamo-cortical precursors developing much earlier in pregnancy - around 12 weeks - than previously thought. Derbyshire himself is pro-choice. In addition, the papers I linked to challenge the necessity of the cortex for pain experience.</li></ol><p>Thanks again for your comment. I hope this clarifies things!</p>", "parentCommentId": "5kebaSHeWWf8GQzhe", "user": {"username": "Calum Miller"}}, {"_id": "P5knBmCtsyHsp4aSg", "postedAt": "2023-11-13T15:08:51.822Z", "postId": "MwmdpSBMuzNDmvNHp", "htmlBody": "<blockquote><p>According to the <a href=\"https://en.wikipedia.org/wiki/Prenatal_development\">sources on wikipedia</a>, Brain synapses in foetuses do not form until week 17, and the first evidence of \"minimal consciousness and ability to feel pain\" does not occur until week 30.</p></blockquote><p>This <a href=\"https://forum.effectivealtruism.org/posts/6ma8rxrfYs3njyQZn/a-case-for-voluntary-abortion-reduction?commentId=Gy5Et5sJNCRMAByqT\">comment</a> from a pro-choice author on my post on abortion discusses lines of evidence for the different views on when fetal pain arises. It seems to corroborate Calum's perspective that Wikipedia editors are biased. From one of its linked studies (<a href=\"https://jme.bmj.com/content/46/1/3\">Derbyshire et al</a>): \"Overall, the evidence, and a balanced reading of that evidence, points towards an immediate and unreflective <strong>pain experience mediated by the developing function of the nervous system from as early as 12 weeks</strong>.\"</p><blockquote><p>Even if we grant some moral weight to a 15 week old foetus (which I'm dubious of), it's hard to see a logical reason why it would approach the morally significance of an adult chicken.</p></blockquote><p><strong>A 15-week fetus has an order of magnitude more neurons than an adult chicken</strong>. (Red junglefowl, the wild relative of chickens, have&nbsp;<a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4932926/\"><u>221 million</u></a> neurons, while 13-week fetuses have&nbsp;<a href=\"https://academic.oup.com/cercor/article/13/2/115/270764\"><u>3 billion</u></a> brain cells. Since humans have a&nbsp;<a href=\"https://blogs.scientificamerican.com/brainwaves/know-your-neurons-what-is-the-ratio-of-glia-to-neurons-in-the-brain/\"><u>near 1:1 neuron-glia ratio</u></a>, a 13-week fetus's neuron count should be an order of magnitude greater than a chicken's.) A chicken also has an&nbsp;<a href=\"https://pubmed.ncbi.nlm.nih.gov/17634059/\"><u>underdeveloped cortex</u></a> relative to mammals, which somewhat corresponds to the fetus's developing cortex.</p><p>If anything, I'd bet in favor of a 15 week fetus having <i>more</i> moral significance than an adult chicken rather than less.</p>", "parentCommentId": "5kebaSHeWWf8GQzhe", "user": {"username": "Ariel Simnegar"}}, {"_id": "LELKW6sSzwMQyFWvz", "postedAt": "2023-11-13T15:29:12.699Z", "postId": "MwmdpSBMuzNDmvNHp", "htmlBody": "<blockquote><p>Denial of fetal personhood typically leads to&nbsp;<a href=\"https://www.tandfonline.com/doi/full/10.1080/20502877.2018.1438771\">implausible conclusions</a> regarding how we may treat infants and severely disabled humans, and arguably to a&nbsp;<a href=\"https://jme.bmj.com/content/early/2022/11/15/jme-2022-108572\">denial of human equality</a> even among non-disabled adults. Even if these conclusions are accepted, most people would accept that these are appreciable bullets to bite – especially for those effective altruists who are invested in preventing infant mortality.</p></blockquote><p>Agreed. In fact, animal-inclusive altruists make very similar arguments for why animals merit moral consideration. As Dale points out in <a href=\"https://forum.effectivealtruism.org/posts/ADuroAEX5mJMxY5sG/blind-spots-compartmentalizing#Not_really_people\">\"Blind Spots: Compartmentalizing\"</a>, it's unclear why these arguments from marginal cases would apply for animals and not for fetuses.</p><blockquote><p>Arguments that abortion is permissible even if the child has full moral status typically rely on the claims that abortion is letting die, rather than killing, and that there is no duty to assist the child to rescue it from death.</p></blockquote><p>Not only is it killing--if the fetus is sentient, it's likely quite painful. Here are some descriptions of surgical abortion methods:</p><ul><li><a href=\"https://www.michigan.gov/mdhhs/adult-child-serv/informedconsent/michigans-informed-consent-for-abortion-law/procedures/second-trimester-labor-induction-abortion\">Labor Induction</a> (20+ weeks gestation): The fetus is administered a&nbsp;<strong>lethal injection with no anesthesia</strong>, often of&nbsp;potassium chloride, which causes cardiac arrest and death within a minute. Potassium chloride is also used (with anesthesia) for the death penalty. If the fetus is sentient, this is&nbsp;<a href=\"https://www.hrw.org/reports/2006/us0406/4.htm\"><strong>\"excruciatingly painful\"</strong></a> because potassium chloride&nbsp;<strong>\"inflames the potassium ions in the sensory nerve fibers, literally burning up the veins as it travels to the heart.\"</strong></li><li><a href=\"https://www.michigan.gov/mdhhs/adult-child-serv/informedconsent/michigans-informed-consent-for-abortion-law/procedures/dilation-and-evacuation-de\">Dilation &amp; Evacuation</a> (13-24 weeks): The fetus's&nbsp;<strong>arms and legs are torn off by forceps</strong> before the fetus's&nbsp;<strong>head is crushed</strong>.</li></ul><p>(As titotal points out, the vast majority of abortions occur before this. Still, hundreds of thousands of these surgical procedures occur each year.)</p><blockquote><p>Thomson's violinist</p></blockquote><p>A further objection to Thomson's violinist is that the person wakes up with the violinist attached through no action of their own. In cases of consensual sex, the risk that conception could occur is known. A more precise analogy would be rolling a die while <i>knowing</i> that if the die lands on 1, then the violinist will be attached to you. In that case, unplugging the violinist seems wrong.</p>", "parentCommentId": null, "user": {"username": "Ariel Simnegar"}}, {"_id": "B7gg2SG6MZfwHT9Wv", "postedAt": "2023-11-13T15:57:40.308Z", "postId": "MwmdpSBMuzNDmvNHp", "htmlBody": "<p>It is bad scientific practice to <a href=\"https://slatestarcodex.com/2014/12/12/beware-the-man-of-one-study/\">cite a single study</a>, rather than look for systematic reviews, because you can just cherry pick the one that matches your preferred outcome. It was relatively easy to find <a href=\"https://jamanetwork.com/journals/jama/article-abstract/201429\">this systematic review</a>, which sifts through hundreds of papers and concludes that:</p><blockquote><p>the capacity for conscious perception of pain can arise only after thalamocortical pathways begin to function, which may occur in the third trimester around 29 to 30 weeks’ gestational age, based on the limited data available</p></blockquote><p>Regardless, the relevant point is whether or not this pain, if it exists, is comparable in moral weight to the suffering of animals, which occur in greater numbers.&nbsp;</p><p>I could take issue with the 1:1 <a href=\"https://rethinkpriorities.org/publications/why-neuron-counts-shouldnt-be-used-as-proxies-for-moral-weight\">equating of neuron count with moral worth</a> (which would imply that <a href=\"https://en.wikipedia.org/wiki/List_of_animals_by_number_of_neurons\">elephants are more important than humans</a>), but it doesn't matter, because even if I accept your reasoning and say that fetuses are 10 times as important as chickens, the ~70 billion chickens killed each year would still outweigh the 10 million human fetuses by three orders of magnitude. I could then point out that cows have much more neurons than chickens, and are killed at numbers of 300 million per year.&nbsp;</p>", "parentCommentId": "P5knBmCtsyHsp4aSg", "user": {"username": "titotal"}}, {"_id": "xYsmAarcmSyfZKKf8", "postedAt": "2023-11-13T16:29:55.604Z", "postId": "MwmdpSBMuzNDmvNHp", "htmlBody": "<p>I didn't cite a single study--I cited a comment which referenced several studies, and quoted one of them.</p><p>I agree with your caveat about neuron counts, though I still think people should update upon an order of magnitude difference in neuron count. Do you have a better proposal for comparing the moral worth of a human fetus and an adult chicken?</p><p>I think the argument that abortion reduction doesn't measure up to animal welfare in importance is an <a href=\"https://slatestarcodex.com/2014/08/14/beware-isolated-demands-for-rigor/\">isolated demand for rigor</a>. I agree that the best animal welfare interventions are orders of magnitude more cost-effective than the best abortion reduction interventions. However, you could say the same for GiveWell top charities, Charity Entrepreneurship global health charities, or any other charity in global health.</p><p>A more precise reference class would be global health charities that reduce child mortality, like AMF.</p>", "parentCommentId": "B7gg2SG6MZfwHT9Wv", "user": {"username": "Ariel Simnegar"}}, {"_id": "Jivjgr67gxorFGDAh", "postedAt": "2023-11-13T17:55:19.280Z", "postId": "MwmdpSBMuzNDmvNHp", "htmlBody": "<p>When you are working with statistical trends, that can be true. But it is perfectly legitimate to highlight a single study with a very clear finding which is difficult to dispute - e.g. the existence of a certain kind of neuron. Moreover, the study we both cited was not a primary study, but was a review of sorts, from the world's leading expert in this area - in turn, he cited multiple studies to develop his arguments. The systematic review you mention is, at the very least, outdated, and doesn't really give any kind of convincing response to the arguments laid out in Derbyshire's paper.</p><p>Put another way, I would take one well-argued paper over a million poorly argued papers. If a paper is well argued and cites relevant and convincing arguments/data, it really doesn't matter if there are other papers which say the same thing or not. Unless another paper actually responds to those arguments and shows why they are bad - the conclusions remain perfectly valid. In short, I do not think there is any such general principle in science as 'it is bad practice to cite a single study' - that really depends on one's purposes and one's conclusions.</p>", "parentCommentId": "B7gg2SG6MZfwHT9Wv", "user": {"username": "Calum Miller"}}, {"_id": "6LYqnHqfYohu4YqkK", "postedAt": "2023-11-13T19:27:06.184Z", "postId": "MwmdpSBMuzNDmvNHp", "htmlBody": "<p>Have you explored how donating to Charity Entrepreneurship-incubated family planning charities might compare to anti-abortion advocacy?&nbsp;</p><p>I suspect it might be more effective at reducing the abortion rate whilst also not having the same downside of reducing women's control over their lives. There are also large additional benefits of avoiding negative health outcomes like obstetric fistulas and <i>increasing </i>women's control over their lives.</p>", "parentCommentId": null, "user": {"username": "freedomandutility"}}, {"_id": "Kp4bDYDyfEDAzgSuN", "postedAt": "2023-11-13T19:43:30.984Z", "postId": "MwmdpSBMuzNDmvNHp", "htmlBody": "<p>I haven't, but I would be interested to read more. Is there a reason to suppose it is more effective than standard contraception/sex ed-promoting interventions?</p>", "parentCommentId": "6LYqnHqfYohu4YqkK", "user": {"username": "Calum Miller"}}, {"_id": "hAa3FjMEnKcQhgF5J", "postedAt": "2023-11-13T20:07:44.200Z", "postId": "MwmdpSBMuzNDmvNHp", "htmlBody": "<p>I see a number of flaws with the reasoning here.&nbsp;<br>&nbsp;</p><ol><li>Even if embryos/fetuses have moral value, that does not by itself mean that preventing abortions is an important cause area. An adult person’s needs, desires, preferences, health, happiness, and well-being also have moral value. <i>More</i> moral value, I would argue.</li><li>It seems deeply implausible that a first trimester embryo — the relevant entity to consider when talking about the majority of abortions — has as much moral value as an adult cow or pig. Well over a billion cows and pigs are slaughtered each year. On a per entity basis and on a total deaths basis, animal welfare far surpasses abortion in importance.</li><li>Any argument to the effect that <i>not</i> having a baby is bad for reasons unrelated to the intrinsic, immediate moral value of an embryo/fetus — such as considerations of the counterfactual life-years added to humanity’s total if a person does have a baby — leads to the implausible conclusion that each person has the moral obligation to have as many babies as possible.</li><li>Pro-life activism is not plausibly a neglected cause area in any way. There is already massive attention and resources devoted to it. Even if I fully agreed with the cause, it would be bizarre to suggest the effective altruist movement should make it a priority. By analogy, if someone said gay marriage (which I support about as strongly as I could possibly support anything) should be an EA cause area, I would find that bizarre. What do EAs have to add to this already crowded arena of politics?&nbsp;</li></ol>", "parentCommentId": null, "user": {"username": "Yarrow Bouchard"}}, {"_id": "LuyQ6k4rQunkhCzrp", "postedAt": "2023-11-13T20:43:39.558Z", "postId": "MwmdpSBMuzNDmvNHp", "htmlBody": "<p>Thank you for your comments. To try and respond:</p><ol><li>Sure - but this is why I included the section on offsetting for women, wherein I noted that the empirical evidence just doesn't support the idea that reducing abortion causes comparable harm to adults.</li><li>Perhaps, but there are many ideas EAs believe in which come across as prima facie implausible to some people - this is why I gave arguments (with links for more detail) to suppose that human embryos have similar moral value to adult humans - so it is difficult to respond without knowing exactly where you think those arguments go wrong. Could you elaborate please?</li><li>Perhaps - though this is only a somewhat peripheral and unnecessary part of my argument - most of which depends on the idea that they do indeed have some value. There will be some EAs who do hold views with pronatalist implications - this argument should be quite powerful for them. Other EAs don't hold such views - that's fine.</li><li>As I noted in the post, it is not neglected in the USA, though it is neglected in certain sectors, and is extremely neglected outside the USA (and to an extent Latin America).</li></ol><p>Thanks again for your comments.</p>", "parentCommentId": "hAa3FjMEnKcQhgF5J", "user": {"username": "Calum Miller"}}, {"_id": "9XqvL5wzEjtudFW6J", "postedAt": "2023-11-13T20:49:07.018Z", "postId": "MwmdpSBMuzNDmvNHp", "htmlBody": "<p>Hey Calum - yes these CE charities (Layifa, FEM and perhaps others) have great evidence behind them to support that their methods are far more effective than standard contraception/sex ed-promoting mechanisms. Would recommend checking them out.</p>", "parentCommentId": "Kp4bDYDyfEDAzgSuN", "user": {"username": "NickLaing"}}, {"_id": "2kAkwgtgf8GC6niHK", "postedAt": "2023-11-13T21:14:26.383Z", "postId": "MwmdpSBMuzNDmvNHp", "htmlBody": "<p>Thanks for this. I have had an (admittedly short) scout around, and would be grateful for a bit more direction if possible. Both Lafiya and FEM seem to take women reached and contraceptive prevalence as their primary measured outcome - but this doesn't get us what we need, since contraceptive prevalence can have both positive and negative effects on the abortion rate (due to risk compensation). Do you know if either have an RCT where they measure pregnancies (or, even better, abortions) as an outcome? &nbsp;If so, do you know where I could find this?</p>", "parentCommentId": "9XqvL5wzEjtudFW6J", "user": {"username": "Calum Miller"}}, {"_id": "croyjPnbNBKFwZzsh", "postedAt": "2023-11-13T21:33:23.700Z", "postId": "MwmdpSBMuzNDmvNHp", "htmlBody": "<p>That's an interesting question. You are right that contraceptive prevalence can have both positive and negative effects on the abortion rate</p><p>https://www.guttmacher.org/journals/ipsrh/2003/03/relationships-between-contraception-and-abortion-review-evidence&nbsp;</p><p>But I hard to plausibly see how in developing countries contraceptive use could ever do anything other than reduce abortions, but I could be wrong.</p><p>In terms of reducing pregnancies.</p><p>Here's one RCT showing a 40% reduction in pregnancies after a family planning intervention in Malawi</p><p>https://pubmed.ncbi.nlm.nih.gov/35609202/#:~:text=Studies%20have%20suggested%20that%20improving,and%20birth%20spacing%20is%20lacking.</p><p>There's likely not going to be a RCT looking at abortions as an outcome, due to ethical reasons.</p>", "parentCommentId": "2kAkwgtgf8GC6niHK", "user": {"username": "NickLaing"}}, {"_id": "W68HawHBu4iBPmdry", "postedAt": "2023-11-13T21:58:38.366Z", "postId": "MwmdpSBMuzNDmvNHp", "htmlBody": "<blockquote><p>There's likely not going to be a RCT looking at abortions as an outcome, due to ethical reasons.</p></blockquote><p>Could you explain what those reasons are? It's fine to have death, cancer progression, miscarriage and other bad things as endpoints, so I don't see why abortion would not be an ethically permitted endpoint? In my experience most of the ethical concerns have been around the intervention you are permitted to vary, not the endpoint. Gathering data might be hard, but that seems like a practical limitation, not an ethical one.</p>", "parentCommentId": "croyjPnbNBKFwZzsh", "user": {"username": "Larks"}}, {"_id": "H9FngwuQd7sTd6fC7", "postedAt": "2023-11-13T22:23:13.508Z", "postId": "MwmdpSBMuzNDmvNHp", "htmlBody": "<p>FWIW I would have appreciated a BOTEC for the cost-effectiveness of various anti-abortion interventions (under the assumption of the wrongness of abortion). You gesture that it's possible to affect the number of abortions via policy, but this is obviously a pretty limited analysis. Absent this sort of BOTEC, this reads as a case for policy-makers to restrict abortion, rather than an effective altruist case for pro-life/anti-abortion advocacy, as your title promises.</p>\n", "parentCommentId": null, "user": {"username": "DanielFilan"}}, {"_id": "piemWfDFH3od8zfup", "postedAt": "2023-11-13T22:25:39.086Z", "postId": "MwmdpSBMuzNDmvNHp", "htmlBody": "<p>I believe the charities have been incubated based on health economic evidence showing that they reduce negative health outcomes associated from unplanned pregnancies, presumably by preventing them, which should also reduce abortions.</p>\n<p>Characteristics of the specific programs (setting, baseline effects, low-cost approaches etc) might make them more cost-effective than the average contraception / sex-ed program. Also, programs may be cost-effective despite small effects on abortion rates due to low costs.</p>\n", "parentCommentId": "Kp4bDYDyfEDAzgSuN", "user": {"username": "freedomandutility"}}, {"_id": "kgAwHCWJJgH96HqSe", "postedAt": "2023-11-13T22:30:22.766Z", "postId": "MwmdpSBMuzNDmvNHp", "htmlBody": "<p>I guess I should add why I'd like such a BOTEC: I'm broadly skeptical that anti-abortion interventions will turn out to be competitive with animal welfare interventions on a cost-effectiveness basis under the assumption of foetal moral patienthood, given that my impression is that animal welfare has a vastly wider scale (perhaps with exceptions like choosing to not have an abortion or voting for your polity to criminalize abortion).</p>\n", "parentCommentId": "H9FngwuQd7sTd6fC7", "user": {"username": "DanielFilan"}}, {"_id": "yuc7pe5HNJwZoGDfN", "postedAt": "2023-11-14T04:43:16.862Z", "postId": "MwmdpSBMuzNDmvNHp", "htmlBody": "<p>Thanks for your post. What would be the concrete causes an individual can support? Where can 1000 USD be applied in the most cost-effective way to save lives?</p>", "parentCommentId": null, "user": {"username": "Samuel Andermatt"}}, {"_id": "iMctpkoStcxwwwoBu", "postedAt": "2023-11-14T05:23:37.202Z", "postId": "MwmdpSBMuzNDmvNHp", "htmlBody": "<p>In most African countries at least, most forms of abortion are illegal and carry a lot of social stigma. It's not about the outcome just being bad life your other examples.</p>\n<p>The only way to gather this data would be to ask people in in a survey, which (I could be wrong) I doubt you would get through a local ethics board both because of the stigma and the illegality.</p>\n<p>And yes practicality would also be very difficult as people are very unlikely to admit to having had abortions anyway due to above reasons.</p>\n<p>I'm a little bit locally focused though, there may well be parts of the world where this is possible and has been done, but I'm sure it wouldn't be easy both ethically and practically anywhere in the world.</p>\n", "parentCommentId": "W68HawHBu4iBPmdry", "user": {"username": "NickLaing"}}, {"_id": "AzbR5dNaofQm4edx6", "postedAt": "2023-11-14T10:12:33.975Z", "postId": "MwmdpSBMuzNDmvNHp", "htmlBody": "<p>Yes, Marston and Cleland's paper is helpful, I think. But I think developing countries are generally <strong>most</strong> likely to have risk compensation, since they tend to be more conservative sexually and thus have more capacity for increased risky sex. The countries where abortion and contraception are inversely correlated tend to be those which have already been through a kind of sexual revolution, and were using abortion as birth control (i.e. generally the Soviet bloc in the latter 20th century). But neither of those are true in most developing countries today.</p>", "parentCommentId": "croyjPnbNBKFwZzsh", "user": {"username": "Calum Miller"}}, {"_id": "92ZReJBFGEHLGa3RY", "postedAt": "2023-11-14T10:15:50.399Z", "postId": "MwmdpSBMuzNDmvNHp", "htmlBody": "<p>There are lots of survey-based studies on abortion in countries where abortion is illegal - the problem is not so much getting it through an ethics board as the reliability of the results. You could alternatively measure using hospitalisations for incomplete abortion as a proxy - you won't be able to identify the exact magnitude of the problem or the change since an unknown proportion of these are from miscarriages (some have tried to estimate the 'natural' miscarriage presentation rate, but I think these estimates are obviously unreliable), but you could see if there is a change and whether it is a big or small change, since the miscarriage rate should remain relatively constant. It would need a big enough sample size though.</p>", "parentCommentId": "iMctpkoStcxwwwoBu", "user": {"username": "Calum Miller"}}, {"_id": "cgZXw3cmHDEhata9S", "postedAt": "2023-11-14T10:25:42.253Z", "postId": "MwmdpSBMuzNDmvNHp", "htmlBody": "<p>Here's one example - I suggest it only needs to be in somewhere near the right ballpark to have a significant impact.</p><p>&nbsp;</p><p>We don't know how many legal abortions there are in India each year, because they don't keep good statistics. But suppose the rate is similar to most other countries with legal abortion - this would be about 4 million abortions a year. If, as I suggest, prohibition of abortion prevents at least half of abortions, then for every year you delay the legalisation of abortion, that would be at least 2 million lives saved. Given how neglected the topic is politically in many countries like India (on the pro-life side, at least), I think you could have delayed the legalisation of abortion by at least a month with a team of 10 people working full time for, say, a year. That's perhaps £100,000 - and would have saved ~170k lives.</p><p>&nbsp;</p><p>Again, this is pretty speculative, but if it is anywhere near the right ballpark, then it looks pretty compelling in terms of cost-effectiveness.</p>", "parentCommentId": "H9FngwuQd7sTd6fC7", "user": {"username": "Calum Miller"}}, {"_id": "tZSk7qRCxYoSakwcJ", "postedAt": "2023-11-14T12:14:30.024Z", "postId": "MwmdpSBMuzNDmvNHp", "htmlBody": "<p>Hey Callum practically wise on the ground here I would be like 70 percent sure that it would be impossible to meaningfully assess abortion reduction and a study endpoint</p>\n<p>An anonymous survey based study is a lot easier ethics wise than a big RCT, I think it would be a struggle to get through ethics approval in Uganda here - again I have a bit of experience with ethics board but could be wrong. For better or worse (I think worse) ethics boards are understandably often tighter on RCTs than other study forms.</p>\n", "parentCommentId": "92ZReJBFGEHLGa3RY", "user": {"username": "NickLaing"}}, {"_id": "NJ5iqBYtWQ7CzgvtR", "postedAt": "2023-11-14T16:46:01.561Z", "postId": "MwmdpSBMuzNDmvNHp", "htmlBody": "<p>There are ways to survey about illegal/taboo topics. Researchers studying GiveDirectly use them when asking if people spent the money on drugs, for example.</p>\n<p>One common technique is list randomization, which allows surveyors to collect statistically meaningful results without respondents having to admit to anything in particular.</p>\n", "parentCommentId": "iMctpkoStcxwwwoBu", "user": {"username": "Ian Turner"}}, {"_id": "aREmotEYutpcvSmo4", "postedAt": "2023-11-15T23:14:17.747Z", "postId": "MwmdpSBMuzNDmvNHp", "htmlBody": "<p>Long science comment incoming: I’ve had some time to go over the literature, and I find the passage below (which is the main secular argument against abortion presented) to be highly misleading.&nbsp;</p><blockquote><p>Even if one has no problem with early abortion, 10% of abortions are after 13 weeks’ gestation, at which point fetuses are&nbsp;<a href=\"https://www.nhs.uk/pregnancy/week-by-week/1-to-12/12-weeks\">fully formed</a>, and likely conscious and&nbsp;<a href=\"https://jme.bmj.com/content/46/1/3\">able to feel pain</a>.<a href=\"https://forum.effectivealtruism.org/posts/MwmdpSBMuzNDmvNHp/the-effective-altruist-case-for-pro-life-anti-abortion#_ftn9\">[9]</a>&nbsp;This would amount to at least 3 million relatively late abortions each year globally – and potentially many more if abortion were to become more normalised and permitted around the world.</p></blockquote><p>When the source linked refers to fetuses as “fully formed”, they are referring to “organs, muscles, limbs and bones”. What is definitely <i>not</i> fully formed is the most important organ: The brain. <a href=\"https://www.sciencedirect.com/science/article/abs/pii/S1744165X19300319 \">This recent paper</a> (which is conspicuously absent from the OP), has a good diagram:&nbsp;</p><p><img src=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/aREmotEYutpcvSmo4/nvbkbp5rkmxtklecfnbt\" alt=\"A diagram of a graph\n\nDescription automatically generated with medium confidence\" srcset=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/aREmotEYutpcvSmo4/owefpnfnwyjx2tlhikae 90w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/aREmotEYutpcvSmo4/npc9eunzz31xfrhtlnsn 180w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/aREmotEYutpcvSmo4/sqsa1oeha3avnzrpbsel 270w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/aREmotEYutpcvSmo4/dmr8udkspiqvgkh1gkg1 360w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/aREmotEYutpcvSmo4/msqh0ivcvmy4w7bbn8if 450w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/aREmotEYutpcvSmo4/groudednpvtkaklwmyrg 540w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/aREmotEYutpcvSmo4/bvsgnkikkast9ny8irlu 630w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/aREmotEYutpcvSmo4/aa7uzqa3zjyceienhcua 720w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/aREmotEYutpcvSmo4/mamlbhg3xdzp7zdxhmtu 810w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/aREmotEYutpcvSmo4/iotuwejzgvdbapukptyx 867w\"></p><p>The mature brain cortex does not appear until week 24-ish, and according to <a href=\"https://jamanetwork.com/journals/jama/fullarticle/201429\">this review paper</a> , EEG results only produce reliable patterns synonymous with “wakefulness” at week 30, and at earlier dates the signal is often discontinuous. However, there is some research showing that cognition and experiences can occur without a fully formed cortex, so it should not be taken as the dividing line for certain.&nbsp;</p><p>(If you think I am cherry picking, these sources come from the first google scholar results for \"<a href=\"https://scholar.google.com.au/scholar?hl=en&amp;as_sdt=0%2C5&amp;q=fetal+pain+review&amp;oq=feta&amp;inst=11099861943932837285\">fetal pain review</a>\")</p><p>Does the cited paper claim that 12 week old fetuses are “likely conscious”? Not really. To <a href=\"https://jme.bmj.com/content/46/1/3\">quote it directly</a>:</p><blockquote><p>Pain often refers to a stimulus with degrees of threat (a thorn vs a spear or indigestion vs a heart attack), and pain conjures up an inner state of consciousness relating to fear, concern, regret, necessary action and so on.<a href=\"https://jme.bmj.com/content/46/1/3#ref-40\"><sup>40</sup></a>&nbsp;We do not propose that the fetus experiences&nbsp;<i>that</i>; such an all-encompassing conscious experience likely does depend on widespread cortical activity, as discussed elsewhere.</p></blockquote><p>So what are they claiming? Well, prior to forming a cerebral cortex, newly created neurons are stored on a “subplate”. Once the cerebral cortex is formed, the neurons on the subplate migrate there and the subplate goes away. The authors claim that at around 12 weeks, neural pathways <i>start</i> to form between the thalamus and the subplate. It's possible that the neurons on this subplate experience some form of sensory pain. How this pain would compare to that of comparable animals is not explored in the paper.&nbsp;</p><p>They repeatedly note that this is a continuous process over the 12-24 week period, and that 12 weeks is the <i>minimum</i> for possible pain perception. The idea is that with these connections in place, it’s possible that pain signals may enter the subplate and be experienced by the neurons there in a subconcious manner. Note that they never say this happens for sure, just that they “no longer view it as impossible”.&nbsp;</p><p>What the OP also didn’t mention was what the whole debate was mainly about: whether or not to use analgesia or anaesthesia when performing abortions. Even if an early fetus is capable of feeling pain, the use of these during the abortion may render the procedure painless.</p><p>These findings increase my support for the cautionary use of anaethsia in abortions after 12 weeks. Policy wise, to address this I would actually support <i>greater</i> abortion access, which would allow abortions to be performed earlier before significant brain pathways can be created, without the downside of limiting women's autonomy and subjecting them to the health risks of pregnancy and childbirth.&nbsp;</p>", "parentCommentId": null, "user": {"username": "titotal"}}, {"_id": "ZpcPso7z3Toc7JKSG", "postedAt": "2023-11-16T13:37:14.148Z", "postId": "MwmdpSBMuzNDmvNHp", "htmlBody": "<p>Straight to the point</p><ul><li>The framework is naïve and hypocritical. American terms with 'pro-life' and 'pro-choice' is already a political choice being made, and it sure doesn't give the same vibes if you use the term abortion.</li><li>The chicken comparison made in the comments effectively highlights how hypocritical this is. Will we stop killing chicken? I don't think so.</li><li>Maybe you should wonder in the first place why these women get there, and maybe we should tackle the cause of why they get there. Are abortions the issue, or the fact that men put women in these situations? And now men want to regulate what happens once other men have done the deed? That sounds harsh.</li><li>Have you thought about the consequences of advocating for this? How much this kind of post legitimate right-wing, conservative discourses while EA is supposed to be \"apolitical\" (I should know, it's what I get every time I talk about structural change)? does moral uncertainty makes up for that kind of bad consequences?</li><li>Appendix one is about religion. This has nothing to do here.</li></ul><p>This kind of topic deserves an awareness on all accounts--not just examining one aspect like does the foetus feel pain, but also are we ready to destroy a right that has been painfully gained and is under threat? This post comes as incredibly insensitive in a context of RoeVsWade, packed with misogyny as it doesn't give any credit to the argument that it is before all a choice that women should be able to make. One line is not enough, what honesty is to say 'I know it matters but here's how I'll demonstrate how it doesn't?</p>", "parentCommentId": null, "user": {"username": "Vaipan"}}, {"_id": "i2QnGPRbGpjTJj4fw", "postedAt": "2023-11-16T15:23:44.500Z", "postId": "MwmdpSBMuzNDmvNHp", "htmlBody": "<p>Not only is it killing--if the fetus is sentient, it's likely quite painful.</p><p>So what? Do we forbid abortion and condemn women to have these children? Or should we rather talk about policies to ensure that we don't need abortions anymore--that is, making contraceptives widely available and costless and educating men and women from the youngest age about the need of having efficient contraceptives?&nbsp;</p><p>You talk about the risk of conception being known--men know, but some pay very little attention to the consequences nevertheless. So, should we find binding ways to force men to care?&nbsp;</p><p>I hope this conversation sounds as interesting as regulating women's bodies in the first place, because it's a conversation we <i>must</i> have if we start talking about removing the ability of giving women a choice.&nbsp;</p>", "parentCommentId": "LELKW6sSzwMQyFWvz", "user": {"username": "Vaipan"}}, {"_id": "2ShKBxsscH76FYzLk", "postedAt": "2023-11-16T17:48:27.769Z", "postId": "MwmdpSBMuzNDmvNHp", "htmlBody": "<ol><li>These terms are pretty widely used and are the most widely accepted. Of course I don't think 'pro-choice' is a good, neutral term - but they are a reasonable compromise for the sake of clarity, since everyone understands what they mean.</li><li>I don't know what you mean here.</li><li>Yes, there is a lot we can do to tackle the root causes of abortion.</li><li>EA is supposed to consider how to improve the world as much as possible - that is what this post aims to do. The fact that it might lend credibility to a right-wing cause does not bother me, nor does the fact that the pro-animal posts here might lend credibility to a left-wing cause. I am struggling to understand what point you are trying to express, unless you are just assuming that anything that could benefit conservatives is evil. But that is just silly. Moreover, plenty of left-wing people (like myself) are opposed to abortion.</li><li>I explicitly stated at the start of that appendix that it was relevant for the 15% or so of EAs who are religious. It is relevant to them, and belongs there. If you don't like, scroll past it.</li><li>At this point I fear you are not really engaging with (or even reading) the post. If you have specific criticisms, I'm happy to address them. If not, then I probably cannot help very much.</li></ol>", "parentCommentId": "ZpcPso7z3Toc7JKSG", "user": {"username": "Calum Miller"}}, {"_id": "FyKGvoWzTuBjvoEz5", "postedAt": "2023-11-16T18:20:35.067Z", "postId": "MwmdpSBMuzNDmvNHp", "htmlBody": "<p>\"Long science comment incoming: I’ve had some time to go over the literature, and I find the passage below (which is the main secular argument against abortion presented) to be highly misleading.\"</p><p>As I already explained in my comments above, the paragraph to which you refer was <i>not</i> the main argument against abortion, it was an extra peripheral consideration for a certain subgroup of readers. I do not understand why you seek to misrepresent my post even after I made this clarification.</p><p>\"The mature brain cortex does not appear until week 24-ish, and according to <a href=\"https://jamanetwork.com/journals/jama/fullarticle/201429\">this review paper</a> , EEG results only produce reliable patterns synonymous with “wakefulness” at week 30, and at earlier dates the signal is often discontinuous. However, there is some research showing that cognition and experiences can occur without a fully formed cortex, so it should not be taken as the dividing line for certain.</p><p>(If you think I am cherry picking, these sources come from the first google scholar results for \"<a href=\"https://scholar.google.com.au/scholar?hl=en&amp;as_sdt=0%2C5&amp;q=fetal+pain+review&amp;oq=feta&amp;inst=11099861943932837285\">fetal pain review</a>\")\"</p><p>Yes, Lee's paper is well-known. But the wakefulness stuff is not really plausible - the RCOG dropped the argument completely from their recent review of the evidence, as Bellieni's recent response points out (https://onlinelibrary.wiley.com/doi/10.1002/ejp.2109) - as Derbyshire pointed out elsewhere, there are a number of problems with this argument, including the fact that we just don't really know much about the EEG sleep patterns even for newborns, let alone fetuses. We also have pretty clear ultrasonography from 23 weeks showing a fetus clearly crying in response to an anaesthetic injection - it is very implausible to me that this is done while asleep.</p><p>Regarding the rest: yes, the authors are somewhat cautious, though I'm pretty sure Bockmann now considers it likely the fetus can feel pain from 12 weeks, and I think is open to it being even earlier. The question is: is there any reason why the fetus wouldn't feel pain at that point? You might say 'because the cortex isn't fully developed'. But as the authors point out, there is reason to doubt the necessity of the cortex for pain perception. The wakefulness argument doesn't really work, for the reasons that Bellieni and Derbyshire describe.</p><p>\"What the OP also didn’t mention was what the whole debate was mainly about: whether or not to use analgesia or anaesthesia when performing abortions. Even if an early fetus is capable of feeling pain, the use of these during the abortion may render the procedure painless.\"</p><p>No, this isn't what the debate is mainly about. I have made very clear in my comments I am also talking about early embryos/fetuses before pain capability, and that the arguments I describe briefly (and link to for more detail) apply to these.</p>", "parentCommentId": "aREmotEYutpcvSmo4", "user": {"username": "Calum Miller"}}, {"_id": "P58NyuBM9pYW8yAAd", "postedAt": "2023-11-16T18:24:20.870Z", "postId": "MwmdpSBMuzNDmvNHp", "htmlBody": "<p>Thanks Nick. I have come across quite a lot of abortion surveys in countries with restrictive laws. Here is one from Uganda: <a href=\"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0002340#sec007\">https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0002340#sec007</a> I agree entirely that the results are likely not to be very reliable, but I think that is the bigger problem; less so the lack of ethics approval.</p>", "parentCommentId": "tZSk7qRCxYoSakwcJ", "user": {"username": "Calum Miller"}}, {"_id": "g3zuPvJAeki38McnW", "postedAt": "2023-11-17T18:15:57.988Z", "postId": "MwmdpSBMuzNDmvNHp", "htmlBody": "<p>I am highlighting the passage because I am not a fan of misleading representations of the scientific evidence, which is what you have done in the initial post.</p><p>It appears you <i>do</i> know the contents of the papers you have referred to, and knew it at the time of making the post as well. This makes it significantly <i>worse</i> that you misleadingly summarized it as saying that a 13 week old fetus is \"fully formed\", \"likely conscious\", and \"likely capable of feeling pain\", when the study you cited disagreed on first two points and expressed great uncertainty about the third. This gives the impression that the fetus at 13 weeks is <i>as</i> formed, <i>as</i> conscious, and <i>as</i> capable of pain as a typical full-grown baby, which from this analysis appears to false. &nbsp;</p><p>I focused on this passage, because as far as I can tell it's the main secular argument you made <i>for</i> abortion being bad. Otherwise you kind of just state that we should assume 4 week old fetuses have full human rights until proven otherwise, a position that seems unpopular even among the religious. If you had included the relevant disclaimers, or dropped the secular pretense entirely, I would not have been so harsh, and merely expressed my belief that forcing women to give birth when they don't want to is unacceptable and immoral.&nbsp;</p>", "parentCommentId": "FyKGvoWzTuBjvoEz5", "user": {"username": "titotal"}}, {"_id": "zaAtRy8rX7kYefmdb", "postedAt": "2023-11-19T20:31:54.702Z", "postId": "MwmdpSBMuzNDmvNHp", "htmlBody": "<p>Highlighting the passage is perfectly fine - I wrote it, and it is part of the post. What is not fine is continually suggesting that it is the primary argument I have given for abortion being wrong, when that is manifestly not the case, and I have made that explicit. I'm happy to respond to criticisms of that particular point - but not for people to misrepresent my post by pretending that it is the main argument given, especially when I have clarified that it is not.</p><p>Yes, I am familiar with the evidence. If I had deliberately misrepresented any of the papers I cited, then again, &nbsp;you would be right. But you have failed to show that. Bockmann does think the fetus is likely conscious and able to feel pain by that point, even if they phrased it more hesitantly in the paper, presumably because it is difficult to be certain. Of course, we can never be certain - but they have shown that the main arguments for placing fetal consciousness later in pregnancy fail. I see no good reason to suppose it is later than 12 weeks.</p><p>Again, no, I did not 'just state' that we should 'assume' 4 week old fetuses have full human rights. I said, for example, \"Denial of fetal personhood typically leads to&nbsp;<a href=\"https://www.tandfonline.com/doi/full/10.1080/20502877.2018.1438771\">implausible conclusions</a> regarding how we may treat infants and severely disabled humans, and arguably to a&nbsp;<a href=\"https://jme.bmj.com/content/early/2022/11/15/jme-2022-108572\">denial of human equality</a> even among non-disabled adults.\" These arguments apply to all embryos/fetuses, regardless of whether they can feel pain, and more detail is available in the references linked.</p>", "parentCommentId": "g3zuPvJAeki38McnW", "user": {"username": "Calum Miller"}}]