[{"_id": "gHPqeHBZFBKzacZKc", "postedAt": "2017-12-21T19:52:45.341Z", "postId": "MWquqEMMZ4WXCrsug", "htmlBody": "<blockquote>\n<p>By now it should be clear that simply following the expected value is not a sufficient response to concerns of cluelessness.</p>\n</blockquote>\n<p>I was pretty surprised by this sentence. Maybe you could say more precisely what you mean?</p>\n<p>I take the core concern of cluelessness to be that perhaps we have no information about what options are best. Expected value gives a theoretical out to that (with some unresolved issues around infinite expectations for actors with unbounded utility functions). Approximations to expected value that humans can implement are as you point out kind of messy and opaque, but that's a feature of human reasoning in general, and doesn't seem particularly tied to expected value. Is that what you're pointing at?</p>\n", "parentCommentId": null, "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "akwxWfGk9XH34Lwtp", "postedAt": "2017-12-22T17:20:48.164Z", "postId": "MWquqEMMZ4WXCrsug", "htmlBody": "<p>I can’t speak for the author, but I don’t think the problem is the difficulty of “approximating” expected value.  Indeed, in the context of subjective expected utility theory there is no “true” expected value that we are trying to approximate.  There is just whatever falls out of your subjective probabilities and utilities.  </p>\n<p>I think the worry comes more from wanting subjective probabilities to <em>come</em> from somewhere — for instance, models of the world that have a track-record of predictive success.  If your subjective probabilities are not grounded in such a model, as is arguably often the case with EAs trying to optimize complex systems or the long-run future, then it is reasonable to ask why they should carry much epistemic / decision-theoretic weight.     </p>\n<p>(People who hold this view might not find the usual Dutch book or representation theorem arguments compelling.)  </p>\n", "parentCommentId": "gHPqeHBZFBKzacZKc", "user": {"username": "JesseClifton"}}, {"_id": "hwiM8LBR8nFZRLfEj", "postedAt": "2017-12-24T07:48:19.143Z", "postId": "MWquqEMMZ4WXCrsug", "htmlBody": "<p>I'll second this. In double cruxing EV calcs with others it is clear that they are often quite parameter sensitive and that awareness of such parameter sensitivity is rare/does not come for free. Just the opposite, trying to do sensitivity analysis on what are already fuzzy qualitative-&gt;quantitative heuristics is quite stressful/frustrating. Results from sufficiently complex EV calcs usually fall prey to ontology failures, ie key assumptions turned out wrong 25% of the time in studies on analyst performance in the intelligence community, and most scenarios have more than 4 key assumptions.</p>\n", "parentCommentId": "akwxWfGk9XH34Lwtp", "user": {"username": "RomeoStevens"}}, {"_id": "6eFFHkvQN4keGsD8w", "postedAt": "2017-12-26T20:49:20.625Z", "postId": "MWquqEMMZ4WXCrsug", "htmlBody": "<blockquote>\n<p>We can make subjective probability estimates, but if a probability estimate does not flow out of a clearly articulated model of the world, its believability is suspect</p>\n</blockquote>\n<p>I don't see how this implies that the expected value isn't the right answer. Also, what exactly do you mean by &quot;believability&quot;? It's a subjective probability estimate.</p>\n<blockquote>\n<p>Greaves is saying that real-world agents don’t assign precise probabilities to outcomes, they instead consider multiple possible probabilities for each outcome (taken together, these probabilities sum to the agent’s “representor”). Because an agent holds multiple probabilities for each outcome, and has no way by which to arbitrate between its multiple probabilities, it cannot use a straightforward expected value calculation to determine the best outcome.</p>\n</blockquote>\n<p>I don't hold multiple probabilities in this way. Sure some agents do, but presumably those agents aren't doing things correctly. Maybe the right answer here is &quot;don't be confused about the nature of probability.&quot;</p>\n<blockquote>\n<p>The next time you encounter someone making a subjective probability estimate, ask “how did you arrive at that number?” The answer will frequently be along the lines of “it seems about right” or “I would be surprised if it were higher.” Answers like this indicate that the estimator doesn’t have visibility into the process by which they’re arriving at their estimate</p>\n</blockquote>\n<p>There are lots of claims we make on the basis of intuition. Do you believe that all such claims are poor, or is probability some kind of special case? It would help to be more clear about your point - what kind of visibility do we need and why is it important?</p>\n<blockquote>\n<p>Whenever we make a probability estimate that doesn’t flow from a clear world-model, the believability of that estimate is questionable</p>\n</blockquote>\n<p>This statement is kind of nonsensical with a subjective Bayesian model of probability; the estimate <em>is</em> your belief. If you don't have that model, then sure a probability estimate could be described as likely to be wrong, but it's still not clear why that would prevent us from saying that a probability estimate is the best we can do.</p>\n<blockquote>\n<p>And if we attempt to reconcile multiple probability estimates into a single best-guess, the believability of that best-guess is questionable because our method of reconciling multiple estimates into a single value is opaque.</p>\n</blockquote>\n<p>The way of reconciling multiple estimates is to treat them as evidence and update via Bayes' Theorem, or to weight them by their probability of being correct and average them using standard expected value calculation. If you simply take issue with the fact that real-world agents don't do this formally, I don't see what the argument is. We already have a philosophical answer, so naturally the right thing to do is for real-world agents to approximate it as well as they can.</p>\n", "parentCommentId": null, "user": {"username": "kbog"}}, {"_id": "f87Nuakk7K9xqfMGj", "postedAt": "2017-12-26T20:55:56.350Z", "postId": "MWquqEMMZ4WXCrsug", "htmlBody": "<blockquote>\n<p>I think the worry comes more from wanting subjective probabilities to come from somewhere — for instance, models of the world that have a track-record of predictive success. If your subjective probabilities are not grounded in such a model, as is arguably often the case with EAs trying to optimize complex systems or the long-run future, then it is reasonable to ask why they should carry much epistemic / decision-theoretic weight.</p>\n</blockquote>\n<p>But that just means that people are making estimates that are insufficiently robust to unknown information and are therefore vulnerable to the optimizer's curse. It doesn't imply that taking the expected value is not the right solution to the idea of cluelessness.</p>\n", "parentCommentId": "akwxWfGk9XH34Lwtp", "user": {"username": "kbog"}}, {"_id": "n83ZAQnPKmYrwiJFZ", "postedAt": "2017-12-27T07:46:00.190Z", "postId": "MWquqEMMZ4WXCrsug", "htmlBody": "<blockquote>\n<p>But that just means that people are making estimates that are insufficiently robust to unknown information and are therefore vulnerable to the optimizer's curse.</p>\n</blockquote>\n<p>I'm not sure what you mean.  There is nothing being estimated and no concept of robustness when it comes to the notion of subjective probability in question.  </p>\n", "parentCommentId": "f87Nuakk7K9xqfMGj", "user": {"username": "JesseClifton"}}, {"_id": "q8PQRzeysgHWdXntR", "postedAt": "2017-12-27T17:20:30.098Z", "postId": "MWquqEMMZ4WXCrsug", "htmlBody": "<p>The expected value of your actions is being estimated. Those estimates are based on subjective probabilities and can be well or poorly supported by evidence.</p>\n", "parentCommentId": "n83ZAQnPKmYrwiJFZ", "user": {"username": "kbog"}}, {"_id": "THBrHbdDiFsEmruLD", "postedAt": "2017-12-27T20:38:33.155Z", "postId": "MWquqEMMZ4WXCrsug", "htmlBody": "<p>For a Bayesian, there is no sense in which subjective probabilities are well or poorly supported by the evidence, unless you just mean that they result from calculating the Bayesian update correctly or incorrectly.</p>\n<p>Likewise there is no true expected utility to estimate.  It is a measure of an epistemic state, not a feature of the external world.  </p>\n<p>I am saying that I would like this epistemic state to be grounded in empirical reality via good models of the world.  This goes beyond subjective expected utility theory.  As does what you have said about robustness and being well or poorly supported by evidence.</p>\n", "parentCommentId": "q8PQRzeysgHWdXntR", "user": {"username": "JesseClifton"}}, {"_id": "BEhzE9uLmMZDT3im3", "postedAt": "2017-12-27T22:35:03.593Z", "postId": "MWquqEMMZ4WXCrsug", "htmlBody": "<blockquote>\n<p>The way of reconciling multiple estimates is to treat them as evidence and update via Bayes' Theorem, or to weight them by their probability of being correct and average them using standard expected value calculation. If you simply take issue with the fact that real-world agents don't do this formally, I don't see what the argument is. We already have a philosophical answer, so naturally the right thing to do is for real-world agents to approximate it as well as they can.</p>\n</blockquote>\n<p>&quot;Approximate it as well as they can&quot; implies a standard beyond the subjective Bayesian framework by which subjective estimates are compared. Outside of the subjective Bayesian framework seems to be where the difficulty lies.</p>\n<p>I agree with what Jesse stated above: &quot;I am saying that I would like this epistemic state to be grounded in empirical reality via good models of the world. This goes beyond subjective expected utility theory. As does what you have said about robustness and being well or poorly supported by evidence.&quot; </p>\n<p>A standard like &quot;how accurately does this estimate predict the future state of the world?&quot; is what we seem to use when comparing the quality (believability) of subjective estimates.</p>\n<p>I think the difficulty is that it is very hard to assess the accuracy of subjective estimates about complicated real-world events, where many of the causal inputs of the event are unknown &amp; the impacts of the event occur over a long time horizon. </p>\n", "parentCommentId": "6eFFHkvQN4keGsD8w", "user": {"username": "Milan_Griffes"}}, {"_id": "dirATydCT56bt5W2C", "postedAt": "2017-12-27T22:36:00.535Z", "postId": "MWquqEMMZ4WXCrsug", "htmlBody": "<p>I agree with Jesse's reply.</p>\n", "parentCommentId": "gHPqeHBZFBKzacZKc", "user": {"username": "Milan_Griffes"}}, {"_id": "SiWQx9RGH5cJ7pNJo", "postedAt": "2018-01-07T07:38:10.939Z", "postId": "MWquqEMMZ4WXCrsug", "htmlBody": "<blockquote>\n<p>For a Bayesian, there is no sense in which subjective probabilities are well or poorly supported by the evidence</p>\n</blockquote>\n<p>Yes, whether you are Bayesian or not, it means that the estimate is robust to unknown information.</p>\n<blockquote>\n<p>I am saying that I would like this epistemic state to be grounded in empirical reality via good models of the world. This goes beyond subjective expected utility theory. </p>\n</blockquote>\n<p>No, subjective expected utility theory is perfectly capable of encompassing whether your beliefs are grounded in good models. I don't see why you would think otherwise.</p>\n<blockquote>\n<p>As does what you have said about robustness and being well or poorly supported by evidence.</p>\n</blockquote>\n<p>No, everything that has been written on the optimizer's curse is perfectly compatible with subjective expected utility theory.</p>\n", "parentCommentId": "THBrHbdDiFsEmruLD", "user": {"username": "kbog"}}, {"_id": "Pz8DzTv3yypbAdNBJ", "postedAt": "2018-01-07T07:42:37.131Z", "postId": "MWquqEMMZ4WXCrsug", "htmlBody": "<blockquote>\n<p>&quot;Approximate it as well as they can&quot; implies a standard beyond the subjective Bayesian framework by which subjective estimates are compared. </p>\n</blockquote>\n<p>How does it imply that? A Bayesian agent makes updates to their beliefs to approximate the real world as well as it can. That's just regular Bayesian updating, whether you are subjective or not.</p>\n<blockquote>\n<p>I think the difficulty is that it is very hard to assess the accuracy of subjective estimates about complicated real-world events, where many of the causal inputs of the event are unknown &amp; the impacts of the event occur over a long time horizon.</p>\n</blockquote>\n<p>I don't see what this has to do with subjective estimates. If we talk about estimates in objective and/or frequentist terms, it's equally difficult to observe the long term unfolding of the scenario. Switching away from subjective estimates won't make you better at determining which estimates are correct or not.</p>\n", "parentCommentId": "BEhzE9uLmMZDT3im3", "user": {"username": "kbog"}}, {"_id": "sMfu7oc2of36dk2up", "postedAt": "2018-01-07T22:22:15.538Z", "postId": "MWquqEMMZ4WXCrsug", "htmlBody": "<blockquote>\n<p>whether you are Bayesian or not, it means that the estimate is robust to unknown information</p>\n</blockquote>\n<p>I’m having difficulty understanding what it means for a subjective probability to be robust to unknown information.  Could you clarify?  </p>\n<blockquote>\n<p>subjective expected utility theory is perfectly capable of encompassing whether your beliefs are grounded in good models. </p>\n</blockquote>\n<p>Could you give an example where two Bayesians have the same subjective probabilities, but SEUT tells us that one subjective probability is better than the other due to better robustness / resulting from a better model / etc.?    </p>\n", "parentCommentId": "SiWQx9RGH5cJ7pNJo", "user": {"username": "JesseClifton"}}, {"_id": "EESoKg6rk7fS2cXzg", "postedAt": "2018-01-08T17:57:15.361Z", "postId": "MWquqEMMZ4WXCrsug", "htmlBody": "<p>It means that your credence will change little (or a lot) depending on information which you don't have. </p>\n<p>For instance, if I know nothing about Pepsi then I may have a 50% credence that their stock is going to beat the market next month. However, if I talk to a company insider who tells me why their company is better than the market thinks, I may update to 55% credence.</p>\n<p>On the other hand, suppose I don't talk to that guy, but I did spend the last week talking to lots of people in the company and analyzing a lot of hidden information about them which is not available to the market. And I have found that there is no overall reason to expect them to beat the market or not - the info is good just as much as it is bad. So I again have a 50% credence. However, if I talk to that one guy who tells me why the company is great, I won't update to 55% credence, I'll update to 51% or not at all.</p>\n<p>Both people here are being perfect Bayesians. Before talking to the one guy, they both have 50% credence. But the latter person has more reason to be surprised if Pepsi diverges from the mean expectation.</p>\n", "parentCommentId": "sMfu7oc2of36dk2up", "user": {"username": "kbog"}}, {"_id": "WHbAmkQfTpRWpKpdp", "postedAt": "2018-01-08T22:21:40.799Z", "postId": "MWquqEMMZ4WXCrsug", "htmlBody": "<p>It sounds to me like this scenario is about a difference in the variances of the respective subjective probability distributions over future stock values.  The variance of a distribution of credences does not measure how “well or poorly supported by evidence” that distribution is.</p>\n<p>My worry about statements of the form “My credences over the total future utility given intervention A are characterized by distribution P” does not have to do with the variance of the distribution P.  It has to do with the fact that I do not know whether I should trust the procedures that generated P to track reality.    </p>\n", "parentCommentId": "EESoKg6rk7fS2cXzg", "user": {"username": "JesseClifton"}}, {"_id": "2t4jAE4r86MfxSxqu", "postedAt": "2018-01-09T20:17:20.092Z", "postId": "MWquqEMMZ4WXCrsug", "htmlBody": "<blockquote>\n<p>It sounds to me like this scenario is about a difference in the variances of the respective subjective probability distributions over future stock values. The variance of a distribution of credences does not measure how “well or poorly supported by evidence” that distribution is.</p>\n</blockquote>\n<p>Well in this case at least, it is apparent that the differences are caused by how well or poorly supported people's beliefs are. It doesn't say anything about variance in general.</p>\n<blockquote>\n<p>My worry about statements of the form “My credences over the total future utility given intervention A are characterized by distribution P” does not have to do with the variance of the distribution P. It has to do with the fact that I do not know whether I should trust the procedures that generated P to track reality.</p>\n</blockquote>\n<p>Distribution P <em>is</em> your credence. So you are saying &quot;I am worried that my credences don't have to do with my credence.&quot; That doesn't make sense. And sure we're uncertain of whether our beliefs are accurate, but I don't see what the problem with that is.</p>\n", "parentCommentId": "WHbAmkQfTpRWpKpdp", "user": {"username": "kbog"}}, {"_id": "qRbaX3tZznZE8cPPv", "postedAt": "2018-01-09T23:47:33.413Z", "postId": "MWquqEMMZ4WXCrsug", "htmlBody": "<blockquote>\n<p>Distribution P is your credence. So you are saying &quot;I am worried that my credences don't have to do with my credence.&quot; That doesn't make sense. And sure we're uncertain of whether our beliefs are accurate, but I don't see what the problem with that is.</p>\n</blockquote>\n<p>I’m having difficulty parsing the statement you’ve attributed to me, or mapping it what I’ve said.  In any case, I think many people share the intuition that “frequentist” properties of one’s credences matter.  People care about calibration training and Brier scores, for instance.  It’s not immediately clear to me why it’s nonsensical to say “P is my credence, but should I trust it?” </p>\n", "parentCommentId": "2t4jAE4r86MfxSxqu", "user": {"username": "JesseClifton"}}, {"_id": "ywQsydDxCZS4A4eQW", "postedAt": "2018-01-11T00:48:03.046Z", "postId": "MWquqEMMZ4WXCrsug", "htmlBody": "<blockquote>\n<p>If we talk about estimates in objective and/or frequentist terms, it's equally difficult to observe the long term unfolding of the scenario.</p>\n</blockquote>\n<p>Agreed. I think the difficulty applies to both types of estimates (sorry for being imprecise above).</p>\n", "parentCommentId": "Pz8DzTv3yypbAdNBJ", "user": {"username": "Milan_Griffes"}}, {"_id": "tAD5Qghy3nAtaf53F", "postedAt": "2018-01-11T00:51:06.329Z", "postId": "MWquqEMMZ4WXCrsug", "htmlBody": "<blockquote>\n<p>How does it imply that?</p>\n</blockquote>\n<p>I don't have a fully articulated view here, but I think the problem lies with how the agent assesses how its approximations are doing (i.e. the procedure an agent uses to assess when an update is modeling the world more accurately or less).</p>\n", "parentCommentId": "Pz8DzTv3yypbAdNBJ", "user": {"username": "Milan_Griffes"}}, {"_id": "wXDQeTzWF2bNJEc4p", "postedAt": "2018-01-20T01:02:44.307Z", "postId": "MWquqEMMZ4WXCrsug", "htmlBody": "<p>I’m late to the party, but I’ve really enjoyed this series of posts. Thanks for writing.</p>\n", "parentCommentId": null, "user": {"username": "MikeJohnson"}}, {"_id": "67WcFEwPaKxrRGH7v", "postedAt": "2019-03-12T16:10:33.271Z", "postId": "MWquqEMMZ4WXCrsug", "htmlBody": "<p>This business with multiple possible probabilities sounds like you are partway through reinventing Bayesian model uncertainty.  Seems like &quot;representor&quot; corresponds to &quot;posterior distribution over possible models&quot;.  From a Bayesian perspective, you can solve this problem by using the full posterior for inference, and summing out the model.</p><blockquote>Answers like this indicate that the estimator doesn’t have visibility into the process by which they’re arriving at their estimate.</blockquote><p>&quot;It is better to be approximately right than to be precisely wrong.&quot; - Warren Buffett</p><p>&quot;Anything you need to quantify can be measured in some way that is superior to not measuring it at all.&quot; - Gilb&#x27;s Law</p>", "parentCommentId": null, "user": {"username": "John_Maxwell_IV"}}, {"_id": "3KRwepH2sdi5FtHdE", "postedAt": "2019-03-12T16:11:53.290Z", "postId": "MWquqEMMZ4WXCrsug", "htmlBody": "<p>Good points, but this seems to point to a weakness in the way we do modeling, not a weakness in expected value.</p>", "parentCommentId": "hwiM8LBR8nFZRLfEj", "user": {"username": "John_Maxwell_IV"}}, {"_id": "swvCB7eHqdc3kbHwP", "postedAt": "2019-03-30T08:20:31.532Z", "postId": "MWquqEMMZ4WXCrsug", "htmlBody": "<blockquote>This business with multiple possible probabilities sounds like you are partway through reinventing Bayesian model uncertainty.</blockquote><p>For what it&#x27;s worth, this is <a href=\"https://flightfromperfection.com/files/post_attachments/cluelessness_greaves_2016.pdf\">Greaves&#x27; terminology</a>, not mine.</p>", "parentCommentId": "67WcFEwPaKxrRGH7v", "user": {"username": "Milan_Griffes"}}, {"_id": "WdXdSkL2DGLHyqCyG", "postedAt": "2019-03-30T08:21:37.708Z", "postId": "MWquqEMMZ4WXCrsug", "htmlBody": "<blockquote>From a Bayesian perspective, you can solve this problem by using the full posterior for inference, and summing out the model.</blockquote><p>I don&#x27;t follow. What does it mean to use &quot;the full posterior for inference,&quot; in this context? </p><p>A couple examples would help me.</p>", "parentCommentId": "67WcFEwPaKxrRGH7v", "user": {"username": "Milan_Griffes"}}, {"_id": "KAH4e22E3x9i7krTw", "postedAt": "2019-03-30T08:55:46.087Z", "postId": "MWquqEMMZ4WXCrsug", "htmlBody": "<p>Sorry, I&#x27;m not sure what the official jargon for the thing I&#x27;m trying to refer to is.  In the limit of trying to be more accessible, I&#x27;m basically teaching a class in Bayesian statistics, and that&#x27;s not something I&#x27;m qualified to do.  (I don&#x27;t even remember the jargon!)  But the point is there are theoretically well-developed methods for talking about these issues, and maybe you shouldn&#x27;t reinvent the wheel.  Also, I&#x27;m almost certain they work fine with expected value.</p>", "parentCommentId": "WdXdSkL2DGLHyqCyG", "user": {"username": "John_Maxwell_IV"}}, {"_id": "Pb9nXf859sEi5vDHj", "postedAt": "2019-03-30T09:16:25.428Z", "postId": "MWquqEMMZ4WXCrsug", "htmlBody": "<p>Hm, I feel sorta strange about this exchange. </p><p>Here&#x27;s a toy model of the story in my head:</p><blockquote><strong>Me:</strong> Hey, I think there&#x27;s this weird + important problem in practical ethics! Here&#x27;s a paper from academic philosophy about it.</blockquote><blockquote><strong>You:</strong> Oh, that&#x27;s already been sorted out by Bayesian statistics.</blockquote><blockquote><strong>Me:</strong> Great! I don&#x27;t really understand how Bayesian statistics applies to this problem about practical ethics. Could you show me?</blockquote><blockquote><strong>You:</strong> To do that, I&#x27;d have to teach you a class in Bayesian statistics, which I&#x27;m not qualified to do.</blockquote><blockquote><strong>Me:</strong> ...</blockquote><blockquote><strong>You:</strong> Also I don&#x27;t remember what the jargon for the Bayesian solution is.</blockquote><blockquote><strong>Me:</strong> [writes toy dialogue]</blockquote><p>Does that seem strange to you, too? I&#x27;m not trying to be unfair here.</p><p>Basically it seems strange that you know that Bayesian statistics addresses this issue, but it&#x27;s not easy to give examples of how. </p>", "parentCommentId": "KAH4e22E3x9i7krTw", "user": {"username": "Milan_Griffes"}}, {"_id": "rocjcT7eLsK7Pjuaf", "postedAt": "2019-03-31T20:42:14.699Z", "postId": "MWquqEMMZ4WXCrsug", "htmlBody": "<p>Do you think it&#x27;s an acceptable conversational move for me to give you pointers to a literature which I believe addresses issues you&#x27;re working on even if I don&#x27;t have a deep familiarity with that literature?</p>", "parentCommentId": "Pb9nXf859sEi5vDHj", "user": {"username": "John_Maxwell_IV"}}, {"_id": "FtRa9cFrrchDE4MrF", "postedAt": "2019-03-31T21:33:13.205Z", "postId": "MWquqEMMZ4WXCrsug", "htmlBody": "<p>I think it&#x27;s acceptable, but being &quot;acceptable&quot; feels like a pretty low bar.</p><p>Basically I don&#x27;t think it&#x27;s rude, or arguing in bad faith, or anything like that. But not being able to give a specific reference when we dig into one of your claims lowers my credence of that claim.</p>", "parentCommentId": "rocjcT7eLsK7Pjuaf", "user": {"username": "Milan_Griffes"}}, {"_id": "ym5u3NNLQsLZLrn85", "postedAt": "2019-07-30T06:54:42.513Z", "postId": "MWquqEMMZ4WXCrsug", "htmlBody": "<html><head></head><body><p>I think this is the jargon: <a href=\"https://en.wikipedia.org/wiki/Posterior_predictive_distribution\">https://en.wikipedia.org/wiki/Posterior_predictive_distribution</a></p>\n</body></html>", "parentCommentId": "WdXdSkL2DGLHyqCyG", "user": {"username": "John_Maxwell_IV"}}]