[{"_id": "BmynC2pBkvrmu6vMW", "postedAt": "2024-03-15T17:37:24.042Z", "postId": "MWSwSXNmsSBaEKtKw", "htmlBody": "<p>Thank you for trying &lt;3</p>", "parentCommentId": null, "user": {"username": "Tyner"}}, {"_id": "BrS4ciDgmznhBawnZ", "postedAt": "2024-03-15T22:13:25.309Z", "postId": "MWSwSXNmsSBaEKtKw", "htmlBody": "<p>Strongly upvoted. Posts like this are painful to write, but really valuable to read. Thanks for putting it together</p>\n", "parentCommentId": null, "user": {"username": "John Salter"}}, {"_id": "S6Dt5AgkJC6KfQFLF", "postedAt": "2024-03-16T00:45:16.965Z", "postId": "MWSwSXNmsSBaEKtKw", "htmlBody": "<p>I was surprised by the <a href=\"https://forum.effectivealtruism.org/posts/MWSwSXNmsSBaEKtKw/maternal-health-initiative-is-shutting-down#Concerns\">\"Concerns\" section</a> being so short, and noticed that the pdf on the website goes into <a href=\"https://maternalhealthinitiative.org/wp-content/uploads/2024/03/MHI-Shutdown-Report-1.pdf#page=25&amp;zoom=100,96,245\">much more detail</a>. I found the additional considerations there really interesting.</p><p>&nbsp;</p><p>I only briefly skimmed it, but the whole report seems really interesting.<span class=\"footnote-reference\" data-footnote-reference=\"\" data-footnote-index=\"1\" data-footnote-id=\"a76fptwm6a8\" role=\"doc-noteref\" id=\"fnrefa76fptwm6a8\"><sup><a href=\"#fna76fptwm6a8\">[1]</a></sup></span>&nbsp;Thank you so much for working on it and sharing this!</p><ol class=\"footnote-section footnotes\" data-footnote-section=\"\" role=\"doc-endnotes\"><li class=\"footnote-item\" data-footnote-item=\"\" data-footnote-index=\"1\" data-footnote-id=\"a76fptwm6a8\" role=\"doc-endnote\" id=\"fna76fptwm6a8\"><span class=\"footnote-back-link\" data-footnote-back-link=\"\" data-footnote-id=\"a76fptwm6a8\"><sup><strong><a href=\"#fnrefa76fptwm6a8\">^</a></strong></sup></span><div class=\"footnote-content\" data-footnote-content=\"\"><p>E.g. how <a href=\"https://maternalhealthinitiative.org/wp-content/uploads/2024/03/MHI-Shutdown-Report.pdf#page=23&amp;zoom=100,96,324\">\"unmet need\" is a misleading metric</a></p></div></li></ol>", "parentCommentId": null, "user": {"username": "Lorenzo Buonanno"}}, {"_id": "vJWuDGhGdmEeeGcpZ", "postedAt": "2024-03-16T03:13:52.301Z", "postId": "MWSwSXNmsSBaEKtKw", "htmlBody": "<p>Disclosure: Sarah and Ben are friends, and we came out of the same CE incubation batch, so I'm not unbiased here.</p>\n<p>I think it's speaks well of a person's integrity, objectivity, and concern for impact that they're able to make a clear eyed assessment that their own project isnt having the desired impact, and then going ahead to shut it down so as to not burn counterfactually valuable resources.</p>\n<p>It's something that's worth emulating, and I do try to apply this myself - via regular CEAs and qualitative evaluations of CEAECH's expected impact (especially as a meta org with a more indirect path to impact). We're only wasting our own time otherwise!</p>\n", "parentCommentId": null, "user": {"username": "Joel Tan"}}, {"_id": "WMxTK2jLZzftW8t5c", "postedAt": "2024-03-16T16:26:37.865Z", "postId": "MWSwSXNmsSBaEKtKw", "htmlBody": "<p>Thanks for this detailed report. It's likely to be helpful to other organizations to understand the reasoning and evidence base behind this in considering whether to start or fund adjacent projects. Il</p><p>Some things that woukd also be nice com apologise if you already did this.</p><p>Can you share your data and code or spread sheets in case other researchers or founders want to revisit this? potentially this is something students and academic researchers would want to help you with.</p><p>You often report pre-values and a “lack of significant difference\". Of course, this could be driven by lack of statistical power in small samples. it would be helpful if you could report, confidence intervals for these. if you have the bandwidth, it would be helpful if you could do some equivalent test or even Bayesian analysis in a decision framework.</p>", "parentCommentId": null, "user": {"username": "david_reinstein"}}, {"_id": "pjPganZjjgHGysTS9", "postedAt": "2024-03-16T17:10:23.134Z", "postId": "MWSwSXNmsSBaEKtKw", "htmlBody": "<p>Thanks for writing this! As others have said, thank you for trying to do this valuable work even if it didn't work out.&nbsp;<br><br>I haven't read everything so sorry if you mention this elsewhere but I'm confused about:<br><br>-'Of the three studies we found that measure the effects of facility-based postpartum family planning programming on pregnancy rates, two found no effect (Rohr et al.&nbsp;<a href=\"https://www.tandfonline.com/doi/full/10.1080/13625187.2023.2290985\"><u>2024</u></a>; Coulibaly et al.&nbsp;<a href=\"https://doi.org/10.1186/s12889-021-10964-w\"><u>2021</u></a>), and one found only a 0.7% decrease in short-spaced pregnancies (Guo et al.&nbsp;<a href=\"https://pubmed.ncbi.nlm.nih.gov/35727080/\"><u>2022</u></a>)<i>.</i><br>This suggests that facility-based programs may have limited to no effect on reducing unintended pregnancies despite increasing contraceptive uptake.'<br><br>Why might programs increase contraceptive uptake but not reduce unintended pregnancies? Is it mainly because many who take the contraceptives are in the postpartum insusceptibility period anyway?&nbsp;</p>", "parentCommentId": null, "user": {"username": "Amber"}}, {"_id": "LeD3gzyMQ5k4RALKj", "postedAt": "2024-03-16T18:25:29.668Z", "postId": "MWSwSXNmsSBaEKtKw", "htmlBody": "<p>Thanks for putting this post together. It takes fortitude to commit so much to an altruistic project, and it takes integrity to make this decision and write up this explanation.</p>", "parentCommentId": null, "user": {"username": "Ariel Simnegar"}}, {"_id": "rbdPBq9cXJA7byczo", "postedAt": "2024-03-16T22:23:20.596Z", "postId": "MWSwSXNmsSBaEKtKw", "htmlBody": "<p>Great effort on the project, and appreciate the open sharing which helps everyone out 👏&nbsp;</p>", "parentCommentId": null, "user": {"username": "Simon Newstead"}}, {"_id": "razp43s3AamBH8DjQ", "postedAt": "2024-03-17T22:12:06.628Z", "postId": "MWSwSXNmsSBaEKtKw", "htmlBody": "<p>We will be publishing a journal article with our pilot findings that goes into all of the data and has much more advanced statistical analysis -- we'll be sure to share that here as well! We're also planning to publish a commentary that focuses on our broader concerns on postpartum family planning and digs into that data. I totally agree that what we've shared here is just a small sliver of the data.</p>", "parentCommentId": "WMxTK2jLZzftW8t5c", "user": {"username": "Sarah H"}}, {"_id": "QhHbhsisdXD6ZyeFt", "postedAt": "2024-03-17T22:24:41.703Z", "postId": "MWSwSXNmsSBaEKtKw", "htmlBody": "<p>Thanks for the kind words! This is a great question. There's a lot of uncertainty here but here's a few thoughts:</p><ol><li>Postpartum insusceptibility is likely a decent chunk of it -- i.e. some women have \"redundant\" protection where they were already 100% protected from pregnancy, so the modern contraception does nothing in the short term, or they were mostly protected and the modern contraception only adds a small marginal benefit</li><li>For some of the studies, there was a higher contraceptive uptake at 12 months postpartum in the intervention group than the control but the contraceptive uptake in intervention and control groups was similar at 2 years postpartum -- it seems that some PPFP interventions are primarily shifting contraceptive uptake sooner, where postpartum insusceptibility is a particularly strong factor.</li><li>Behavior related to family planning is really complex and can be unpredictable/unexpected. For example, the women who&nbsp; start using contraception because of a program are likely not a representative sample of the population; in fact, they may be skewed towards people who are at a lower risk of getting pregnant, because they're more careful in other ways.&nbsp;</li></ol>", "parentCommentId": "pjPganZjjgHGysTS9", "user": {"username": "Sarah H"}}, {"_id": "geL5G4QBNKm8ZfPaE", "postedAt": "2024-03-18T04:48:29.715Z", "postId": "MWSwSXNmsSBaEKtKw", "htmlBody": "<p>Good on you for being courageous and scout-minded enough to shut this down (and to start it in the first place)! I hope you find great projects to move onto.</p>\n", "parentCommentId": null, "user": {"username": "Oscar Delaney"}}, {"_id": "72gPcgkmeani9i8Dv", "postedAt": "2024-03-18T18:35:39.257Z", "postId": "MWSwSXNmsSBaEKtKw", "htmlBody": "<p><strong>Executive summary:</strong> Maternal Health Initiative (MHI) is shutting down after concluding that postpartum family planning interventions are not as cost-effective as initially believed, based on pilot results in Ghana and further research into the impact of such programs.</p><p><strong>Key points:</strong></p><ol><li>MHI piloted two postpartum family planning interventions in Ghana, integrating contraceptive counseling into postnatal care (PNC) and child welfare clinic (CWC) appointments.</li><li>The PNC intervention showed a potential increase in contraceptive uptake, but the CWC intervention did not show significant effects.</li><li>Further research suggests that postpartum family planning programs may have limited impact on unintended pregnancies and short-spaced births due to factors like postpartum insusceptibility and cultural barriers.</li><li>MHI considered pivoting to other interventions or areas but concluded that shutting down and redirecting resources to more promising organizations would be more impactful.</li><li>Key lessons learned include the importance of focus, avoiding underconfidence, addressing data collection challenges, and being willing to spend for valuable information.</li></ol><p>&nbsp;</p><p>&nbsp;</p><p><i>This comment was auto-generated by the EA Forum Team. Feel free to point out issues with this summary by replying to the comment, and</i><a href=\"https://forum.effectivealtruism.org/contact\"><i>&nbsp;<u>contact us</u></i></a><i> if you have feedback.</i></p>", "parentCommentId": null, "user": {"username": "SummaryBot"}}, {"_id": "fQhtoh7s55gnRNmms", "postedAt": "2024-03-18T18:51:25.781Z", "postId": "MWSwSXNmsSBaEKtKw", "htmlBody": "<p>Thank you for your integrity, and congratulations on your <i>successful</i> <i>research</i> into the cost-effectiveness of this intervention!</p>", "parentCommentId": null, "user": {"username": "Spencer Ericson"}}, {"_id": "tB4wdfS9Kpz5bGwpD", "postedAt": "2024-03-21T20:45:49.118Z", "postId": "MWSwSXNmsSBaEKtKw", "htmlBody": "<p>Top notch work. My two favourite things about this community are 1) the willingness to take a serious crack at working on whatever project seems like it will help most people and 2) the integrity to shut down projects that do not meet expectations. Your work exemplifies both.</p>", "parentCommentId": null, "user": {"username": "Ren Springlea"}}, {"_id": "3hzdkHctPhArJX3om", "postedAt": "2024-03-23T11:02:41.898Z", "postId": "MWSwSXNmsSBaEKtKw", "htmlBody": "<p>FYI: The link to the summary (<a href=\"https://maternalhealthinitiative.org/final-summary-of-our-work/\">https://maternalhealthinitiative.org/final-summary-of-our-work/</a>) does not seem to work for me (404).</p>\n", "parentCommentId": null, "user": {"username": "Georg Wind"}}, {"_id": "S4xwBsmnrazZ3qXDT", "postedAt": "2024-03-24T02:56:40.572Z", "postId": "MWSwSXNmsSBaEKtKw", "htmlBody": "<p>I ran into the same issue. It looks like the report is still live at <a href=\"https://maternalhealthinitiative.org/wp-content/uploads/2024/03/MHI-Shutdown-Report-1.pdf\">this URL</a>, though! (And here's an <a href=\"https://perma.cc/V5NK-5T8U\">archived version</a>)</p>", "parentCommentId": "3hzdkHctPhArJX3om", "user": {"username": "ryanywho"}}, {"_id": "hJasqz7hoh5XNwz7P", "postedAt": "2024-03-25T10:10:01.912Z", "postId": "MWSwSXNmsSBaEKtKw", "htmlBody": "<p>This link should now be fixed!</p>", "parentCommentId": "S4xwBsmnrazZ3qXDT", "user": {"username": "ben3536"}}]