[{"_id": "2KeWJTkPXrsnmDRD7", "postedAt": "2018-05-13T14:48:20.338Z", "postId": "MYth4Ju4kbfHmJRbA", "htmlBody": "<blockquote>\n<p>The Humane League (THL) is an ACE-recommended charity. THL runs the Fast Action Network, an online group which sends out easy, one-minute actions two or three times per week, including signing petitions, posting on social media, or emailing decision makers, as part of campaigns to mitigate factory farming. You can sign up to join the Fast Action Network in the United States here, in the United Kingdom here and for a Spanish version of the Fast Action Network here.</p>\n</blockquote>\n<p>Mercy for Animals (which was ACE-recommended for <a href=\"https://animalcharityevaluators.org/blog/introducing-recommendations-december-2014/\">2014</a>, <a href=\"https://animalcharityevaluators.org/blog/updated-recommendations-december-2015/\">2015</a>, and <a href=\"https://animalcharityevaluators.org/blog/updated-recommendations-december-2016/\">2016</a>) runs a similar program called <a href=\"https://www.mercyforanimals.org/hen-heroes\">Hen Heroes</a>. </p>\n", "parentCommentId": null, "user": {"username": "RandomEA"}}, {"_id": "oXB8hYksZPt4jKyhi", "postedAt": "2018-05-13T18:42:10.730Z", "postId": "MYth4Ju4kbfHmJRbA", "htmlBody": "<p>This is somewhat off-topic but it's relevant enough that I thought I'd raise it here.</p>\n<p>What is the most impactful volunteering opportunity for a non-EA who prioritizes more conventional causes (including global poverty) and who lacks specialized skills? Basically, I'm seeking a general recommendation for non-EAs who <a href=\"https://www.facebook.com/groups/effective.altruists/permalink/1455920331130986/\">ask</a> how they can most effectively volunteer. I recognize that the recommended volunteering for a non-EA will be much less impactful than the recommended volunteering for an EA, but I think it can sometimes be worthwhile to spread a less impactful idea to a larger number of people (e.g. The Life You Can Save).</p>\n<p>The <a href=\"https://www.benkuhn.net/volunteering\">standard</a> <a href=\"https://80000hours.org/2012/10/how-to-be-a-high-impact-volunteer/\">view</a> seems to be that volunteering in a low-skill position produces as much value for an organization as donating the amount necessary for them to hire a minimum wage worker as a replacement. While this may be correct as a general matter, I think there are likely exceptions:</p>\n<ol>\n<li><p>An organization may feel that volunteer morale will greatly decrease if there are some people doing the same work as the volunteers for the same number of hours who are paid. </p>\n</li>\n<li><p>An organization may be unwilling to hire people to do the work for ideological reasons.</p>\n</li>\n<li><p>An organization may be unwilling to hire people to do the work because doing so would look bad to the public.</p>\n</li>\n<li><p>An organization may feel that passion about the cause is extremely important and that the best way to select for passion is to only accept people who will work for free.</p>\n</li>\n<li><p>An all-volunteer organization may lack the infrastructure to pay employees meaning that it would have to pay a high initial cost before hiring its first employee. </p>\n</li>\n</ol>\n<p>Thus, it seems plausible to me that there is some relatively high impact organization with appeal to non-EAs where a person without specialized skills can have a significant impact. Does anyone know of a volunteering opportunity like this?</p>\n", "parentCommentId": null, "user": {"username": "RandomEA"}}, {"_id": "kPMpszirNrtHfKHZb", "postedAt": "2018-05-13T20:56:25.122Z", "postId": "MYth4Ju4kbfHmJRbA", "htmlBody": "<p>Thank you, this was very helpful. I think to possibility to do volunteer work remotely is something that should be stressed more and also communicated in EA local groups more frequently.</p>\n", "parentCommentId": null, "user": {"username": "Yannick_Muehlhaeuser"}}, {"_id": "iA2BRf4xBpFL5PnQw", "postedAt": "2018-05-14T00:54:38.363Z", "postId": "MYth4Ju4kbfHmJRbA", "htmlBody": "<p>Thank you. I will add this to the list. </p>\n", "parentCommentId": "2KeWJTkPXrsnmDRD7", "user": {"username": "Evan_Gaensbauer"}}, {"_id": "SBMJ6nzi4KEfxfstu", "postedAt": "2018-05-17T00:25:46.090Z", "postId": "MYth4Ju4kbfHmJRbA", "htmlBody": "<p>These are good questions. I was surprised and disappointed I couldn't find more volunteer opportunities for more conventional causes like global poverty alleviation. I'm spitballing some ideas here.</p>\n<ul>\n<li><p>I made contact with a bunch of people running different mental health, well-being and happiness projects from within effective altruism. Some of them might have some kind of volunteer opportunities. I can find out.</p>\n</li>\n<li><p>The closest thing there currently is to organizations rated as effective by EA working in the developed world is some policy organizations. My friend Finan from Seattle had a meetup where a representative from an urban housing reform organization also in Seattle which had received a grant from the Open Philanthropy Project (Open Phil) came to talk about their work. If someone is in a city in or near the same place as where one of Open Phil's grantees throughout North America or the rest of the world, they could have an event, or visit the organization. There could be a 'What Can You Do?' section at the end of talks. Alternatively, you could just email such organizations and ask them if there is anything in addition to donating individuals can do to support the organization. Hosting an event with the organization and non-EAs looking for effective volunteer opportunities could help them build a personal connection to the cause.</p>\n</li>\n</ul>\n<p>That stated, among the options in the post, hosting a Giving Game through The Life You Can Save (TLYCS) is a well-structured volunteering opportunity. TLYCS has all of Givewell's standout and recommended charities, plus some charities well-rated by other charity evaluators. There is over 18 charities to fundraise for through Giving Games, all of them on conventional causes, mostly in the focus area of global development. Whoever runs a Giving Game can choose a few from any of those 18 causes for a Giving Game. After hosting a successful Giving Game, unskilled people can say they gained these skills by doing so, and put that on their resume:</p>\n<ul>\n<li>Social Media Engagement/Management</li>\n<li>Public Speaking &amp; Presentation</li>\n<li>Event Planning &amp; Organization</li>\n<li>Fundraising</li>\n</ul>\n<p>That's because that's all the stuff someone technically has to do to host a Giving Game. So after hosting a Giving Game, if someone didn't want to get involved with EA, they could go to an organization and say &quot;look at all this stuff I learned how to do!&quot;, which I think will look pretty good to a lot of different kinds of NPOs. Also, if someone wants to help with farm animal welfare/research, Faunalytics' online Library Assistant volunteer position is recommended as a good fit for high school or university students. </p>\n", "parentCommentId": "oXB8hYksZPt4jKyhi", "user": {"username": "Evan_Gaensbauer"}}, {"_id": "6bY8KKKFuuTagsauw", "postedAt": "2018-05-17T17:04:40.416Z", "postId": "MYth4Ju4kbfHmJRbA", "htmlBody": "<p>Anyone choosing between these alternatives may find our volunteering decision tool useful: <a href=\"http://effective-altruism.com/ea/1k0/effective_volunteering/\">http://effective-altruism.com/ea/1k0/effective_volunteering/</a></p>\n", "parentCommentId": null, "user": {"username": "Khorton"}}, {"_id": "v7GiZk7tY6xecsp9w", "postedAt": "2018-05-18T18:24:10.221Z", "postId": "MYth4Ju4kbfHmJRbA", "htmlBody": "<p>Wow, this is great! I wasn't aware remote internships were available at FRI. </p>\n", "parentCommentId": null, "user": {"username": "AnuragKashyap"}}, {"_id": "EnTDkk5tSxHtP8AJP", "postedAt": "2018-06-08T13:34:38.961Z", "postId": "MYth4Ju4kbfHmJRbA", "htmlBody": "<p>Thank you for the mention!</p>\n", "parentCommentId": null, "user": {"username": "toonalfrink"}}, {"_id": "TckhctWoD2tqjfJvg", "postedAt": "2018-06-09T06:54:59.490Z", "postId": "MYth4Ju4kbfHmJRbA", "htmlBody": "<p>No problem!</p>\n", "parentCommentId": "EnTDkk5tSxHtP8AJP", "user": {"username": "Evan_Gaensbauer"}}, {"_id": "rLNYy7ADAWdiWWqiK", "postedAt": "2018-06-18T09:14:20.946Z", "postId": "MYth4Ju4kbfHmJRbA", "htmlBody": "<p>One of my favourite on-line, easy, direct volunteering initiatives is <a href=\"http://www.missingmaps.org/\">http://www.missingmaps.org/</a> via <a href=\"https://hotosm.org/\">https://hotosm.org/</a>.  From an EA perspective the benefit may be hard to quantify - as it's 2nd / 3rd order.  Aim is to help a variety of local NGOs / charities become more effective through using donated satellite imagery to build open source maps.  The local teams can then immediately use these maps + local people can take them on and enhance.  Initiatives supported include disaster response as well as longer-term poverty / health / human rights interventions.  Ping me at @jamiewoodhouse if you want to know more.  Great post by the way - thanks.</p>\n", "parentCommentId": null, "user": {"username": "JamieWoodhouse"}}, {"_id": "yki6jppegyyQnwMNi", "postedAt": "2018-07-19T20:13:10.813Z", "postId": "MYth4Ju4kbfHmJRbA", "htmlBody": "<p>ALLFED.info spans across Poverty Alleviation, Health and GCR/X-rsik with GCR impact on food importing nations and developing countries as a priority.</p>\n<p>We need researchers, developers, financial, IT/web, country specialists, major languages and actually almost anyone can be found a role of some kind, so if you want to save the world (really!) contact <a href=\"mailto:David@ALLFED.info\">David@ALLFED.info</a> or Ray on +447765477305</p>\n", "parentCommentId": null, "user": {"username": "RayTaylor"}}, {"_id": "ciiaSbfaBgQiNKZgA", "postedAt": "2018-08-31T02:53:23.080Z", "postId": "MYth4Ju4kbfHmJRbA", "htmlBody": "<p>This is a very concrete action. Thank you.</p>\n", "parentCommentId": "rLNYy7ADAWdiWWqiK", "user": {"username": "adamaero"}}]