[{"_id": "HQbDEYyGAwxRCGjki", "postedAt": "2023-03-22T19:23:27.598Z", "postId": "N9xreY5eqmYJy3cpF", "htmlBody": "<p>One potential issue with loaning versus giving is that loaning confers upon the recipient the additional burden of seeking out the lendor for return of the item. Further, some may be concerned they'll misplace the item. Thus, some conscientious people may abstain from borrowing even if the message might resonate with them. Lending may make more sense if you're confident (and the prospective lendee is confident) that you'll see them again in the near future.</p>\n<p>It might make sense to minimize the concerns by just giving the book to someone who might be interested. You could request that they convey it to someone who might appreciate it after they've finished it.</p>\n", "parentCommentId": null, "user": {"username": "Brad West"}}, {"_id": "jcm3e39f4BMCtXrpa", "postedAt": "2023-03-22T19:53:17.956Z", "postId": "N9xreY5eqmYJy3cpF", "htmlBody": "<p>Alternate idea: \"loan\" the books by asking people to pass them on to someone else when they are done reading them (e.g. to a friend, to a Little Free Library, etc.)</p>", "parentCommentId": "HQbDEYyGAwxRCGjki", "user": {"username": "Erin"}}, {"_id": "cRsLRadNKdj9dvztc", "postedAt": "2023-03-22T20:39:25.765Z", "postId": "N9xreY5eqmYJy3cpF", "htmlBody": "<p>Also, lending is somewhat of a commitment mechanism: if someone gets or buys a book, they have forever which can easily mean it takes forever, but if they borrow it there's time pressure to give it back which means either read it soon or lose it.</p>", "parentCommentId": null, "user": {"username": "Tetraspace Grouping"}}, {"_id": "Yabk8HdSZqCgrFCJZ", "postedAt": "2023-03-22T20:49:30.154Z", "postId": "N9xreY5eqmYJy3cpF", "htmlBody": "<p>If someone gives me a book, I feel like I have no deadline for reading it. Which sometimes means I never read it. If it's a loan, it's more likely I'll read it at all.</p><p>The flipside of this dynamic is that I'm unlikely to accept a book if I don't think I'm likely to read it, or if I'm interested in reading it, but know that I won't have time for a while.</p>", "parentCommentId": null, "user": {"username": "Sanjay"}}, {"_id": "qo8XmoXDBen5bdKyw", "postedAt": "2023-03-22T22:02:19.328Z", "postId": "N9xreY5eqmYJy3cpF", "htmlBody": "<blockquote>\n<p>the additional burden of seeking out the lendor for return of the item</p>\n</blockquote>\n<p>That could be a plus. If you're running a local group, and lend books at some public event, (like <a href=\"https://forum.effectivealtruism.org/posts/ZSFWLn6ZKfy3rj8Kf/our-clubs-day-tabling-went-well-and-wasn-t-that-effective\">tabling</a>), then this will incentivise the takers to attend the next local EA event too, where they can bring the books back.</p>\n", "parentCommentId": "HQbDEYyGAwxRCGjki", "user": {"username": "CoafOS"}}, {"_id": "J2qw85xiME39Amnt3", "postedAt": "2023-03-23T02:23:09.290Z", "postId": "N9xreY5eqmYJy3cpF", "htmlBody": "<p>Despite being an example of \"giving is <a href=\"https://forum.effectivealtruism.org/posts/xomFCNXwNBeXtLq53/bad-omens-in-current-community-building?commentId=7ujozMgvCnXD4aZhw\">more</a> <a href=\"https://forum.effectivealtruism.org/posts/ZSFWLn6ZKfy3rj8Kf/our-clubs-day-tabling-went-well-and-wasn-t-that-effective\">common</a>\" I broadly agree with this post.</p><p>I'd conceptualize it as a spectrum, with \"Giving books - no strings attached\" at one end and \"Loaning with a register and stated return timeframe\" at the other end. As with most spectrums the healthy spot is likely the middle and context dependent.&nbsp;</p><p>For our <a href=\"https://forum.effectivealtruism.org/posts/ZSFWLn6ZKfy3rj8Kf/our-clubs-day-tabling-went-well-and-wasn-t-that-effective\">tabling</a> we ended up giving the books to people who had initiated a display of interest, with a conversation with the recipient about reading it and then passing it on to someone else who would read it. Which allows for sharing of the ideas, even if people weren't able to make it to our events in the future. For people who are already regular attendees, <a href=\"https://forum.effectivealtruism.org/posts/N9xreY5eqmYJy3cpF/books-lend-don-t-give?commentId=qo8XmoXDBen5bdKyw\">or are likely to become them</a>, I'd advocate for closer to the loan end of the spectrum.</p>", "parentCommentId": null, "user": {"username": "TJPHutton"}}, {"_id": "3SaXzRhghHrNLEp8m", "postedAt": "2023-03-23T05:49:34.298Z", "postId": "N9xreY5eqmYJy3cpF", "htmlBody": "<p>I like this idea. At our university clubs day tabling event, we gave quite a few books away and not a single person who took a book ended up coming to one of our meetings. I think lending would probably be a better practise since, as you say, it is an invitation to talk more about what the person thought of the book.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Lauren Maria"}}, {"_id": "pfNJbhfra4QkYJ6py", "postedAt": "2023-03-23T11:10:46.136Z", "postId": "N9xreY5eqmYJy3cpF", "htmlBody": "<p>I like the idea of thinking of this as a spectrum! When I've done tabling, however, (only a little, when I was at Google) I still found loaning worthwhile: since we're all regularly coming to the same campus returning things wasn't that hard. And if someone had acted like they didn't think they'd be able to return it I'd have told them not to stress about it and to pass it on to someone else when they were done.</p>\n<p>(Not trying to pick on you or your group! And you're better placed to figure out what's working for you.)</p>\n", "parentCommentId": "J2qw85xiME39Amnt3", "user": {"username": "Jeff_Kaufman"}}, {"_id": "hDRjWPykkbf59yKzw", "postedAt": "2023-03-23T22:26:59.763Z", "postId": "N9xreY5eqmYJy3cpF", "htmlBody": "<p>Thats the same pitch you would do with giving them for free.</p>\n", "parentCommentId": "jcm3e39f4BMCtXrpa", "user": {"username": "Felix Wolf"}}, {"_id": "cezQBhzm8bDcnq9Qy", "postedAt": "2023-03-25T00:42:53.484Z", "postId": "N9xreY5eqmYJy3cpF", "htmlBody": "<p>Given that Jeff posted this shortly after raising the possibility that he should write a book (of the sort that could easily make it onto many lending/giving tables) -- I admire the post against potential self-interest here.</p>", "parentCommentId": null, "user": {"username": "Jason"}}]