[{"_id": "jT6tsrXmpkaC8BgDB", "postedAt": "2022-11-17T09:54:09.073Z", "postId": "N9ZPvQMFnDRsrZhee", "htmlBody": "<p>Different people have different skills, and this isn't necessarily a \"problem\" to be solved. &nbsp;It sounds like the feedback you received suggests that you might find a different (less social) role to be a better personal fit. &nbsp;Why not look into that, rather than trying to \"prove\" the feedback wrong?</p><p>It might help to reconceptualize the situation. There's no such thing as being \"too confrontational\", period. &nbsp;But there is such a thing as being \"too confrontational\" <i>for a particular task or role</i>. &nbsp;That role might be better suited to someone with a different personality type. &nbsp;Again, that doesn't mean there's anything <i>wrong</i> with your personality. It may just be a poor <i>fit</i> for the role you're presently looking into. &nbsp;In the face of such mismatches, it's rarely worth trying to change your personality. Instead, I'd suggest looking for a role that's a better personal fit for you and your particular strengths.</p><p>(Not that I have any special insights here or anything. And I obviously don't know anything about your particular situation, besides what you've shared here. It's just a general thought, in case it might be helpful.)</p>", "parentCommentId": null, "user": {"username": "RYC"}}, {"_id": "YxRK5gem3fgjhg7e4", "postedAt": "2022-11-17T12:04:59.652Z", "postId": "N9ZPvQMFnDRsrZhee", "htmlBody": "<p>Sorry to hear that you've had this experience and thank you for writing such a non-confrontational(!) post. I imagine many people have similar stories.</p><blockquote><p>On the one hand, I want to be open to criticism and take seriously the possibility that I really am too confrontational. On the other hand, I strongly believe that radical honesty is a prerequisite for genuine cooperation, so I feel it would be disingenuous of me to simply ask what I can do to become less confrontational.</p></blockquote><p>I think the following things are plausibly both true:</p><ol><li>Grantmakers made a reasonable decision given the information available to them at the time and shouldn't spend any more time evaluating your grant proposals for a while.</li><li>You shouldn't update much on their claims that you're too confrontational.</li></ol><p>Grantmakers are <a href=\"https://80000hours.org/career-reviews/grantmaker/\">in demand</a>. The existing ones have <a href=\"https://forum.effectivealtruism.org/posts/vPMo5dRrgubTQGj9g/some-unfun-lessons-i-learned-as-a-junior-grantmaker#Important_lessons\">very little time</a> on their hands. They are generally making decisions on much less information than people are used to in the wider world in an effort to deploy funding quickly without <a href=\"https://forum.effectivealtruism.org/posts/LwRSnvnaFL9eE4yKz/invisible-impact-loss-and-why-we-can-be-too-error-averse\">too much fear of error</a> to <a href=\"https://forum.effectivealtruism.org/posts/vQpk3cxdAe5RX9xzo/we-are-in-triage-every-second-of-every-day\">address urgent problems</a>.</p><p>This can understandably be incredibly frustrating for unsuccessful grant applicants who have good reason to believe that the grantmakers made a mistake. I'm not sure if there's a good solution to this situation just yet (and I'm saddened by the recent loss of the expanded grantmaking capacity from the Future Fund's regranting system), but the one thing I can recommend is that you at least don't put too much weight on grantmakers having made a correct evaluation here.</p><p>I've only taken a cursory look at your work but I for one am glad to have you in our community :-)</p>", "parentCommentId": null, "user": null}, {"_id": "Qe4FQfWWkiDZGmWvb", "postedAt": "2022-11-17T12:29:52.744Z", "postId": "N9ZPvQMFnDRsrZhee", "htmlBody": "<p>Hi Richard, thanks for the input :) That's a fair point, and I have considered it. The problem is that, after meditating over this, talking to friends, etc, I just cannot bring myself to believe that I am more confrontational than average, or even than the average community organizer. I just don't see evidence of this beyond this incident. This is a difficult thing for me to say because I feel that I will be perceived as stubborn, as somebody who is engaged in motivated reasoning, etc. But if I said anything else I would be lying. I don't know if I'm the only one who feels this, but sometimes I fear that we are creating an environment in EA where people don't have the space to respond sincerely to criticism. I sometimes feel a bit like I'm forced to accept any criticism immediately without questioning it because that's what it means to have a scout mindset. This cannot be a good thing. There must be a balance between resisting criticism too much or too little.</p><p>Besides, even if I am a bit more confrontational that the average organizer, I'm not convinced that I should give up and choose something else that's a better fit for me. I'm not perfect at anything. no matter what path I choose, I will have to work on myself in someways to become better at that job. I would only give up on a path if I'm a <i>sufficiently</i> bad fit. And I don't think I'm bad <i>enough</i> at community building that I should just give up on it. &nbsp;Moreover, at this point I'm kinda in too deep into community organizing. If I stop now the community will die. I considered this possibility with people from the community and they encouraged me to continue. The community is growing, there are often new people who show up excited to the meetups, it feels unreasonable to disappoint everyone and stop everything just because 2 people who don't know me concluded that I am too confrontational after one isolated incident.</p><p>Also, I am a rather insecure and risk-averse person in general, so usually when I'm excited and confident about something it actually means I can do a good job at it. I guess I can accept that it's a bit useless to spend too much time trying to figure out &nbsp;whether I really am or not more confrontational than it's ideal for a community organizer, but I think the implication is that I should look for ways to be friendlier and more agreeable, after all it can't hurt to improve in those dimensions, no matter how unconfrontational I may already be.</p>", "parentCommentId": "jT6tsrXmpkaC8BgDB", "user": {"username": "arielpontes"}}, {"_id": "xG7HCYg5Fr7EqEBAK", "postedAt": "2022-11-17T14:34:36.652Z", "postId": "N9ZPvQMFnDRsrZhee", "htmlBody": "<p>Ariel, a lot of what you've said here shows that you have humility, a growth mindset, and a care for the greater good that outweighs your ego. Examples: being open about the incident with your members and asking for their feedback, same thing on this forum, being thoughtful about your approach and willing to work on yourself. Those traits make great community organizers.&nbsp;</p><p>You got a group that clearly relies on you. Community organization is an auction market (people step up and fill needs based on who's available at the time and has what skills and remaining gaps can be filled by others) as opposed to a winner takes all market (there a single metric and can only be one best eg. in many entertainment and sports professions.) Different aspects of community organization as a community grows require different skills. It sounds like you have the skills to maintain what you already have and you're running into challenges with something new, which is natural.<br><br>Grant seeking is a different skill set than community organizing, and you've only gotten feedback about being confrontational in a grant seeking context. Even there, that's not much feedback since it's from two people from one grant from one org. I'm not familiar with how the EA grant process works but most proposals for most grants (across the board, not just EA) get rejected. I'm not sure what kind of support you got for your second grant. I've worked with nonprofit leads who sought plenty of support for both grant writing and prepping for conversations with decision makers. It's up to you how much you want to develop vs delegate this skill.</p><p>Also, something that's not considered confrontational to people in one country might be in another. It could help to talk to people from the countries where the decision makers reside to learn about the local norms. You can also bring people along to your 1-1s to handle different kinds of topics. If people give you feedback that you're confrontational in the future, you can also ask them what about your behavior came off as confrontational.</p><p>It sounds like your question got Alice thinking. It's unfortunate that she didn't respond to your message. As you said, she might not have seen it. I usually try to get people's contact info on multiple platforms (and message them on multiple platforms if they don't respond on one) to make it easier to get their attention.</p><p>Once you hit a ball to someone else's court, it's out of your control whether it comes back in a way that helps you and your group, stays on their side of the court, or eventually comes back in a way that helps others rather than you and your group. Some people are good at driving these conversations in directions where they're more likely to benefit their groups and might be worth learning from. That said, there's a lot of manipulative advice out there and I admire your for taking a direct, curiosity based approach instead. At the end of the day, the progress we make in educating others and probing their critical thinking doesn't always benefit us directly but can still better the world.</p><p>It's smart that you're already focusing your attention on decision makers with aligned values eg. EA. It's hard when you have a hard time finding sponsors even within groups you see as your tribe. You mentioned being an EA newcomer. Things might get easier as you get more of a lay of the land. You might find people who hear your points more easily and connect you with other people and orgs who can help. It sounds like you've already found a good amount of support eg. for your second grant. People who make big wins happen for communities eg. grants get a lot of praise but it's the people who keep showing up for their communities in the meantime who hold them together.</p>", "parentCommentId": "Qe4FQfWWkiDZGmWvb", "user": {"username": "notabot"}}, {"_id": "JwTpFtsraoXFGXQiK", "postedAt": "2022-11-19T20:53:21.828Z", "postId": "N9ZPvQMFnDRsrZhee", "htmlBody": "<p>I have mixed feelings about this because I don't know enough about the situation.</p>\n<p>Conflicts:</p>\n<ol>\n<li>There are things that people are naturally better at and worse at, and the law of comparative advantage does make sense\nvs.\nThere are things that people could get good at but don't because they don't believe in themselves and don't try aka imposters syndrome.\n(I think this may result in some lack of diversity in tech, STEM, EA, etc.)</li>\n</ol>\n<p>I think the EA community might lean more towards trying really hard to match people with what they are good at / not bad at. I think the EA community may underestimate that when people try and <em>want to</em> get better at a skill (or that they aren't good at something because they don't believe in themselves and don't try to get better), they can get much better at it and surprise themselves and others by how much progress they've made.</p>\n<p>It seems to me that community building is what excites you a lot at the moment, which means that there is a lot of potential for improvement because you care about improving.</p>\n<p>Are there other things that also excite you as well? It could be good to enjoy community building and try other things too (though I realize that this may come with a lot of emotional baggage)! (As someone who's been rejected from community building grants, I still feel the emotional baggage and it still makes it hard to make clear-headed decisions)</p>\n<ol start=\"2\">\n<li>CEA has a different perspective than the community members who are seeing the community building happen on the ground. I think that getting feedback from the people who in your community is more accurate. I agree with notabot that grant-seeking and community building are different skills. I also agree with Dancer with it being very plausible that CEA made the right decision given the little information they had, but it doesn't mean that you did anything wrong with your community building.</li>\n</ol>\n", "parentCommentId": "xG7HCYg5Fr7EqEBAK", "user": {"username": "iamef"}}]