[{"_id": "WKoRmevShYQrT55hx", "postedAt": "2015-05-22T00:54:07.960Z", "postId": "Nb3xGPits57SfX5PY", "htmlBody": "<p>What would make you get more involved in the EA movement?  What approaches have you found particularly (in)effective in communicating EA ideas?  Which best describes your EA behavior: a big initial commitment or an incremental progression over time?</p>\n", "parentCommentId": null, "user": {"username": "Jon_Behar"}}, {"_id": "TKLxgN99agFPymuxj", "postedAt": "2015-05-22T01:19:23.710Z", "postId": "Nb3xGPits57SfX5PY", "htmlBody": "<p>Would The Life You Can Save use this data Jon? Are there particular things you might consider doing, or general ways you might tweak your strategy?</p>\n", "parentCommentId": "WKoRmevShYQrT55hx", "user": {"username": "Tom_Ash"}}, {"_id": "JwSXuKAuaHKGGnxMY", "postedAt": "2015-05-22T14:57:52.141Z", "postId": "Nb3xGPits57SfX5PY", "htmlBody": "<p>We'd use the first two questions I listed as a source of ideas.  The third would help inform our general strategy.  Our working assumption is that it's better to make <a href=\"http://www.thelifeyoucansave.org/Blog/ID/11/Personal-Best\">small, incremental asks</a> rather than one big ask (e.g. a significant pledge) at the outset. Would be nice to see if that's consistent with the experiences of the EA community.</p>\n", "parentCommentId": "TKLxgN99agFPymuxj", "user": {"username": "Jon_Behar"}}, {"_id": "uirhseuvo5ChMokNv", "postedAt": "2015-05-22T18:27:21.296Z", "postId": "Nb3xGPits57SfX5PY", "htmlBody": "<p>I got into a conversation with 'Telofy' about <a href=\"http://effective-altruism.com/ea/ip/dissociation_for_altruists/\">his post about dissociation being a necessary or helpful approach for some Effective Altruists</a>, and he suggested that it might be useful to use the survey find out how many people have the problem he described there or find his solution useful.</p>\n", "parentCommentId": null, "user": {"username": "Ervin"}}, {"_id": "sNZBQ4f6tMZyTCBZ8", "postedAt": "2015-05-24T15:36:29.625Z", "postId": "Nb3xGPits57SfX5PY", "htmlBody": "<p>I'm going to reproduce a comment I wrote at the time the 2014 results were released in order to have them on the agenda for the call later on. I remain convinced that each of these three practical suggestions is relatively low effort and will make the survey process easier, the data more reliable and any resulting conclusions more credible:</p>\n<p>Firstly, we should <strong>use commercial software</strong> to operate the survey rather than trying to build something ourselves. These are both less effort and more reliable. For example, <a href=\"https://www.surveymonkey.com/pricing/details/\">SurveyMonkey</a> could have done everything this survey does for about £300. I'm happy to pay that myself next year to avoid some of the data quality issues.</p>\n<p>Secondly, we should use <strong>live data validation</strong> to improve data collection, data integrity and ease of analysis. SurveyMonkey or other tools can help John to fill in his age in the right box. It could refuse to believe the 7 year old, and suggest that they have another go at entering their age. It could also be valuable to do some respondent validation by asking people to answer a question with a given answer, removing any random clickers or poor quality respondents who are speeding through (eg &quot;Please enter the number '2' in letters into the textbox to prove you are not a robot. For example, the number '1' in letters is 'one'&quot;)</p>\n<p>Thirdly, we should <strong>do more testing by trying out draft versions with respondents who have not written the survey</strong>. It is <em>very, very hard</em> to estimate how people are going to read a particular question, or which options should be included in multiple choice questions. Within my firm, it is typical for an entire project team to run through a survey several times before sending it out to the public. Part of the value here is that most team members were not closely involved in writing the survey, and so won't necessarily be reading it in the way the author expected them to read it. I would suggest you want to try any version of the survey out with a large group (at least twenty) of different people who might answer it, to catch the interpretations of questions which different groups might have. Does the EA affiliation filter work as hoped for? Are there important charities which we should include in the prompt list? It does not seem unreasonable to pilot and redraft a few times with a diverse group of willing volunteers before releasing generally.</p>\n", "parentCommentId": null, "user": {"username": "ChrisSmith"}}, {"_id": "QSjhXEC9htaRHcz8A", "postedAt": "2015-05-24T15:39:42.539Z", "postId": "Nb3xGPits57SfX5PY", "htmlBody": "<p>My main additional comment to the below is that we should be relatively unconcerned with people failing to finish a long survey - we are talking to individuals who are committed to doing a significant amount of good in the world. The relative cost of a few extra questions is low compared with the cost of missing out a question which allows us to better understand the movement and therefore change the world.</p>\n", "parentCommentId": null, "user": {"username": "ChrisSmith"}}, {"_id": "w2LbHcgptnvoJDeb6", "postedAt": "2015-05-24T15:52:51.625Z", "postId": "Nb3xGPits57SfX5PY", "htmlBody": "<blockquote>\n<p>Firstly, we should use commercial software to operate the survey rather than trying to build something ourselves. These are both less effort and more reliable. For example, SurveyMonkey could have done everything this survey does for about £300. I'm happy to pay that myself next year to avoid some of the data quality issues.</p>\n</blockquote>\n<p>It does seem clearly to be worth this expense. I'm concerned that .impact/the community team behind the survey are too reluctant to spend money and undervalue the time relative to it. I suppose that's the cost of not being a funded organization.</p>\n<blockquote>\n<p>asking people to answer a question with a given answer, removing any random clickers or poor quality respondents who are speeding through (eg &quot;Please enter the number '2' in letters into the textbox to prove you are not a robot. For example, the number '1' in letters is 'one'&quot;)</p>\n</blockquote>\n<p>Seconded - I'd urge the team to do this, even if it means ignoring some genuine answers (I would expect Effective Altruists to generally put enough effort into the survey to spot and complete this question, though I might be naïve).</p>\n<blockquote>\n<p>Thirdly, we should do more testing by trying out draft versions with respondents who have not written the survey.</p>\n</blockquote>\n<p>An excellent suggestion also. I'd be willing to do this - I imagine anyone else who'd volunteer can comment below and hopefully someone from the team will spot this and send messages.</p>\n", "parentCommentId": "sNZBQ4f6tMZyTCBZ8", "user": {"username": "Stens1991"}}, {"_id": "cgjjFRE98NkcWPrkp", "postedAt": "2015-05-24T16:01:34.544Z", "postId": "Nb3xGPits57SfX5PY", "htmlBody": "<p>Great suggestion Stens!</p>\n<p>I'm happy to trial draft versions of the survey</p>\n", "parentCommentId": "w2LbHcgptnvoJDeb6", "user": {"username": "ChrisSmith"}}, {"_id": "s94koYHcmKRi8xF6q", "postedAt": "2015-12-07T01:36:27.339Z", "postId": "Nb3xGPits57SfX5PY", "htmlBody": "<p>Hope this went well.</p>\n", "parentCommentId": null, "user": {"username": "josephkijewski1"}}]