[{"_id": "YXc9tJjYzWYMM8a7e", "postedAt": "2017-11-01T05:38:22.620Z", "postId": "NbWbeTN77dXStiXLf", "htmlBody": "<p>For my own benefit I thought I'd write down examples of markets that I can see are inadequate yet inexploitable. Not all of these I'm sure are actually true, some just fit the pattern.</p>\n<ul>\n<li>I notice that most charities aren’t cost effective, but if I decide to do better by making a super cost-effective charity I shouldn’t expect to be more successful than the other charities.</li>\n<li>I notice that most people at university aren’t trying to learn but get good signals for their career, I can’t easily do better in the job market by stopping trying to signal and just learn better</li>\n<li>I notice most parenting technique books aren't helpful (because genetics), but I probably can’t make money by selling a shorter book that tells you the only parenting techniques that do matter.</li>\n<li>If I notice that politicians aren’t trying to improve the country very much, I can’t get elected over them by just optimising for improving the country more (because they're optimising for being elected).</li>\n<li>If most classical musicians spend a lot of money on high-status instruments and spend time with high-status teachers that don’t correlate with quality, you can’t be more successful by just picking high quality instruments and teachers.</li>\n<li>If most rocket companies are optimising for getting the most money out of government, you probably can’t win government contracts by just making a better rocket company. (?)</li>\n<li>If I notice that nobody seems to be doing research on the survival of the human species, I probably can’t make it as an academic by making that my focus</li>\n<li>If I notice that most music recommendation sites are highly reviewing popular music (so that they get advance copies) I can’t have a more successful review site/magazine by just being honest about the music.</li>\n</ul>\n<p>Correspondingly, if these models are true, here are groups/individuals who it would be a mistake to infer strong information about if they're not doing well in these markets:</p>\n<ul>\n<li>Just because a charity has a funding gap doesn't mean it's not very cost-effective</li>\n<li>Just because someone has bad grades at university doesn't mean they are bad at learning their field</li>\n<li>Just because a parenting book isn't selling well doesn't mean it isn't more useful than others</li>\n<li>Just because a politician didn't get elected doesn't mean they wouldn't have made better decisions</li>\n<li>Just because a rocket company doesn't get a government contract doesn't mean it isn't better at building safe and cheap rockets than other companies\nJust because an academic is low status / outside academia doesn't mean they're views aren't true</li>\n<li>Just because a band isn't highly reviewed in major publications doesn't mean it isn't innovative/great</li>\n</ul>\n<p>Some of these seem stronger to me than others. I tend to think that academic fields are more adequate at finding truth and useful knowledge than music critics are adequate at figuring out which bands are good.</p>\n", "parentCommentId": null, "user": {"username": "Ben Pace"}}, {"_id": "E2KS6DKPn4rLqgNjq", "postedAt": "2017-11-03T17:34:47.665Z", "postId": "NbWbeTN77dXStiXLf", "htmlBody": "<p>For the $10/life, were you referring to <a href=\"http://effective-altruism.com/ea/14y/saving_expected_lives_at_10_apiece/\">this</a>? A solution to the low prestige, low citation, but important research is a doubly altruistic researcher who is willing to work for no money and few citations. By the way, I haven't been able to find data, but I think most research is unfunded. This is certainly true in the humanities, but even in STEM, my experience is that most grad students outside the top 50 U.S. universities are unfunded. And professors at colleges with no grad students are many times expected to produce research, typically unfunded.</p>\n", "parentCommentId": null, "user": {"username": "Denkenberger"}}, {"_id": "hnsxyKZKisgeordkx", "postedAt": "2017-11-03T17:39:46.501Z", "postId": "NbWbeTN77dXStiXLf", "htmlBody": "<p>As an academic in existential risk, I thought I would comment. In my experience, it is challenging getting interdisciplinary papers published, which is why I think it would be great if someone started an interdisciplinary existential/global catastrophic risk journal. But I would say that mentions of &quot;global catastrophic risk&quot; and &quot;existential risk&quot; appeared to be growing about 40% per year when I tried to analyze Google scholar. This growth is good for citations, and <a href=\"https://scholar.google.com/citations?user=BGy0ZrMAAAAJ&amp;hl=en\">my paper citations</a> have not been bad.</p>\n", "parentCommentId": "YXc9tJjYzWYMM8a7e", "user": {"username": "Denkenberger"}}, {"_id": "igdLZKadB8tbc2b8G", "postedAt": "2017-11-04T22:32:09.077Z", "postId": "NbWbeTN77dXStiXLf", "htmlBody": "<p>I'm a current PhD student in computational biology, so I can offer a perspective on academic research in biology. I agree that biologists aren't optimizing for benefiting humanity - instead, I think high-quality basic research gets the most respect and that academia can't be beat here in most cases. </p>\n<p>EAs attempting to do biology outside academia have two options. They can try to circumvent basic research and simply &quot;hack&quot; biology by experimenting with various interventions. However, given the complexity of biological systems, this seems unlikely to work unless you have access to tens of thousands of organic compounds and a way to screen them, for example. And this obviously puts you in competition with pharmaceutical companies. Or they can try to make novel biological discoveries. (I include &quot;translating&quot; basic research to applications here, given how easy it is to misinterpret findings.) Much of the life extension, genetic engineering, and transhumanism community relies on this. Even if you believe that a field is being ignored by academia for political reasons, you're still unlikely to advance knowledge outside academia. Academia teaches a framework for studying biology that's impossible to replicate independently:</p>\n<p>&quot;It’s not just that you have to read lots of books, although you do. It’s the experience of working with an advisor and other grad students, of coming up with theories and having them be shot down. Two stories I’ve heard from multiple grad student friends: “I spent two months working on something really cool, and in the first thirty seconds of presenting it to my advisor she came up with a simple proof it could never work” and “I spent two months working on something really cool, and in the first thirty seconds of presenting it to my advisor, she said ‘Oh yeah, that’s Smith’s Lemma, very exciting when it was published forty years ago.'” But eventually you come out of it not just with book learning, but with the thought-patterns and methods of a field baked into your brain, a strong sense of what is or isn’t interesting, can or can’t be done.&quot;</p>\n", "parentCommentId": null, "user": {"username": "Lila"}}, {"_id": "8N5DqWvCJWhfJR6Qo", "postedAt": "2017-11-05T18:39:37.742Z", "postId": "NbWbeTN77dXStiXLf", "htmlBody": "<p>Good list! Makes me wonder whether there's some way to model the expected level of adequacy in a field. Factors we'd have to consider:</p>\n<ul>\n<li>How much money is available within the field?</li>\n<li>How much prestige is available within the field?</li>\n<li>How many people are there in the field?</li>\n<li>How much do participants care about the field for non-monetary, non-prestige reasons? That is, how inherently fun is it to work within this field?</li>\n<li>How hard is it to work within the field? That is, to what extent do skills other than &quot;having good ideas&quot; matter? (Some scientific fields invest hundreds of hours of grunt work in every paper, while a philosophy paper requires little effort outside of writing.)</li>\n<li>How fast does new information enter the field, compared to the amount of information that exists within the field already?</li>\n<li>How many competing ideas/groups exist within the field, and how easy is it for a new idea/group to get started?</li>\n</ul>\n<p>As a toy example, you could look at the metagame for the Modern format of Magic: The Gathering, which consists of roughly one hundred thousand players (maybe ten thousand of whom are really serious about winning). Rewards for being in the top 1% of the serious group equate to a few thousand dollars in profit per year and a few dozen fans; for the top 0.1%, a few tens of thousands of dollars in profit per year and a few thousand fans, plus a solid chance at a steady job if you want it (producing Magic-related media, working as a designer, etc.). </p>\n<p>It's possible to generate a good burst of fame and profit by creating a new deck that matches up well against current popular decks (the &quot;metagame&quot;). </p>\n<p>Information enters the field rapidly, at a pace of a few hundred new cards (into a pool of 11,000) every three months. Building a new deck and thoroughly testing it against the metagame might take a few hundred dollars and a few dozen hours, but the cost is balanced by the fact that playing Magic: The Gathering is a lot of fun. The competitors you need to worry about are people who spend about 50 hours/week playing, and who are as skilled or a little more skilled than you are at the &quot;basics&quot; of the game. Maybe 5% of new decks that are tested this thoroughly turn out to generate any kind of positive return, relative to playing a deck someone else designed already. And so on.</p>\n<p>...at the end, we can observe that a new, good Modern deck (one capable of winning a 500-player, $5000 tournament) comes out once every couple of months, and that cards from sets that are more than one year old are almost never at the center of &quot;new, good decks&quot;, relative to newer sets. Magic: The Gathering seems to be an adequate market; any new ideas are absorbed quickly, and few people really get a chance to profit off of them. The evaluation system for cards and decks optimizes more slowly than the evaluation system for stocks, but more quickly than the evaluation system for Major League Baseball players circa 1990.</p>\n<p>I'd be interested in viewing examples for other fields, with better data collection, perhaps gathered into some kind of &quot;adequacy&quot; database.</p>\n", "parentCommentId": "YXc9tJjYzWYMM8a7e", "user": {"username": "aarongertler"}}, {"_id": "zskxWk7zmBRKrrHPW", "postedAt": "2017-11-06T02:06:07.705Z", "postId": "NbWbeTN77dXStiXLf", "htmlBody": "<p>John Ott, who popularized and maybe invented time lapse photography (<a href=\"https://www.youtube.com/watch?v=m3Foz1ZJGlU\">https://www.youtube.com/watch?v=m3Foz1ZJGlU</a> ), wrote a book called &quot;Health and Light&quot;. His observations of plant growth led him to an interest in the health effects of light. </p>\n<p><a href=\"https://www.amazon.com/Health-Light-extraordinary-Affects-emotional/dp/0898040981/ref=sr_1_1?ie=UTF8&amp;qid=1509933857&amp;sr=8-1&amp;keywords=health+and+light\">https://www.amazon.com/Health-Light-extraordinary-Affects-emotional/dp/0898040981/ref=sr_1_1?ie=UTF8&amp;qid=1509933857&amp;sr=8-1&amp;keywords=health+and+light</a></p>\n<p>He discusses many of the same issues in that book. His view was that while sunlight was much brighter than internal lights, you did not need very bright lights as long as they were full spectrum e.g. included soft UV light. I don't know if this is true or not.</p>\n<p>He ran into the meme of &quot;sunlight causes cancer&quot; among other things. Also he started attacking TV set manufacturers for the levels of x-rays they were emitting and thus made powerful enemies. Also of course he was an outsider.</p>\n<p>EY's comments on the limitations of market efficiency are worth drawing out. Highly liquid stocks in the short term are efficient relative to one another. Most stocks are illiquid, expensive to trade and hard to short so mispricings can persist. If the market as a whole, even just the large liquid stocks, are too cheap/expensive it is hard to arbitrage away this mispricing because as Keynes put it &quot;The market can remain irrational longer than you can remain solvent&quot;.</p>\n<p>Due to agency issues, fund managers are entirely focused on short term performance relative to the market. Any agent who tries to take the long term view, and who therefore suffers from &quot;tracking error&quot; will lose all or almost all his funds under management. This has happened to people with stellar multi-decade track records.</p>\n", "parentCommentId": null, "user": {"username": "surfergirl"}}, {"_id": "eHQiLnqS8GHRRAcEv", "postedAt": "2018-02-24T06:19:30.742Z", "postId": "NbWbeTN77dXStiXLf", "htmlBody": "<p>Well, US light bulbs are not so expensive, because most of the homeowners nowadays, prefer to install LED bulbs at their residence as it offer a significantly higher quality of light with more brightness and they also consume far less energy. I too had installed LED Light bulbs for upgrading my kitchen area by calling up <a href=\"https://www.dndenergy.com\">electricians Bryn Mawr PA</a> team where they also said that lights to LEDs is simply a wise choice for savings.</p>\n", "parentCommentId": null, "user": {"username": "BartCraft"}}]