[{"_id": "GpX9WKiGHDHyd8ZnS", "postedAt": "2023-04-28T07:48:50.999Z", "postId": "NBZr5rGp35YyjABhw", "htmlBody": "<p>20 minutes in and completely hooked, note for others - don't think you'll 'just briefly check it out to decide if its worth watching later' if you're planning on your next hour being productive :)</p>", "parentCommentId": null, "user": {"username": "MathiasKirkBonde"}}, {"_id": "6nbumkXe9kgyrjBfb", "postedAt": "2023-04-28T10:31:05.920Z", "postId": "NBZr5rGp35YyjABhw", "htmlBody": "<p>Thanks for sharing this! Really love hearing stories about personal reasons for connecting with EA</p>", "parentCommentId": null, "user": {"username": "Gemma Paterson"}}, {"_id": "84wsq55n6AQSYgBxq", "postedAt": "2023-04-28T10:41:03.963Z", "postId": "NBZr5rGp35YyjABhw", "htmlBody": "<p>I also wanted to quickly check it out while in the office. I played the first 1.5 minutes and it already moved me to tears. I'll have to wait until I get home to watch the whole movie. Thank you soo much Aaron for sharing it!&nbsp;</p>", "parentCommentId": "GpX9WKiGHDHyd8ZnS", "user": {"username": "KarolinaSarek"}}, {"_id": "5awRcaGey9vjnDy2w", "postedAt": "2023-04-28T13:33:13.888Z", "postId": "NBZr5rGp35YyjABhw", "htmlBody": "<p>If you like that documentary, you might like <a href=\"https://en.wikipedia.org/wiki/Up_(film_series)\">Up</a> as well. It's a documentary that follows 14 different kids in the UK, starting at the age of 7, then showing what their lives are like every 7 years.&nbsp;</p><p>They tried to make it representative, but based on what they thought was important in 1964 England, so mostly based on class.&nbsp;</p><p>It's really fascinating. One guy becomes homeless and ends up being a politician. Another is really successful but feels terrible because all of his friends are even more successful. There's a more or less happy family that seems content with a pretty average life. Etc.</p><p>Not even close to representative of the world's sentient beings, but nevertheless, way more representative than I ever get talking to my social circle. Also really cool to get a longitudenal sense of a person, as opposed to a snapshot.&nbsp;</p><p><a href=\"https://www.youtube.com/watch?v=dwfyPcnQvWA&amp;list=PLy_jRzSRPN107O77P5y1atZxXhjLRLWjY&amp;index=1&amp;ab_channel=Mart%C3%ADnAlca%C3%ADno\">Can watch it on youtube</a></p><p>You also might like:</p><ul><li><a href=\"https://www.youtube.com/watch?v=FPDSu9v3odM&amp;ab_channel=RottenTomatoesClassicTrailers\">Babies</a>. Similar documentary on Netflix, but focused on what being a baby is like in different countries.&nbsp;</li><li><a href=\"https://www.gapminder.org/dollar-street\">Dollar Street</a>. Website by Hans Rosling showing people's lives at different income levels and countries. People take photos of standardized things, like their beds, bathrooms, favorite items, etc. Really gives you a sense of how much of a difference it makes to go from $1 a day to $4.&nbsp;</li></ul><p>Also, thanks for sharing this! I love these sorts of documentaries and am so going to watch it.&nbsp;</p>", "parentCommentId": null, "user": {"username": "katherinesavoie"}}, {"_id": "Z7D5rdhnac8Z2Sbym", "postedAt": "2023-04-29T23:21:04.440Z", "postId": "NBZr5rGp35YyjABhw", "htmlBody": "<p>I love this.</p>\n", "parentCommentId": null, "user": {"username": "Bill!"}}, {"_id": "tZPaMPDheRW8oXXiw", "postedAt": "2023-05-03T11:57:56.896Z", "postId": "NBZr5rGp35YyjABhw", "htmlBody": "<p>This was a great pitch Aaron. I've started watching and really enjoying it.</p>", "parentCommentId": null, "user": {"username": "imben"}}, {"_id": "yjh5b27JToqy7J9fp", "postedAt": "2023-05-04T14:28:57.018Z", "postId": "NBZr5rGp35YyjABhw", "htmlBody": "<p>This is awesome. This is why I want to encourage more arts and humanities in EA. Not necessarily about EA but aligned, altruistic…in the same way people are moved by this film art moves people to do good…maybe through EA or maybe in some other channel…but the point to make to EA people is this: for as long as organized altruism has existed, back before EA made it more effective, art has always been a major force for impact. Many have been moved as this poster was via art to do good. EA was born of scientific ideas but all the greatest science voices use art to forward their good agendas. People who write books and make documentaries, who might have inspired you as a young student toward science or math or philosophy are actually artists and scientists. The reason Will MacAskill is more well known than others is that he speaks and writes more artfully…we need a lot more of that. It’s kind of normal.</p>\n", "parentCommentId": null, "user": {"username": "JeffreyK"}}, {"_id": "B2PRwbiAdtv83SSWC", "postedAt": "2023-05-05T21:45:37.446Z", "postId": "NBZr5rGp35YyjABhw", "htmlBody": "<p>The UP series really moved me. The guy who struggled throughout his adult life with unemployment, homelessness and mental health and finally his life came together more in his forties and he became a local politician was so incredible. He was one of the most charismatic and articulate little boys at age 7 and then you're just hoping against hope for him as he begins to stumble and struggle in his twenties...then he finally creates a life for himself and it's like every altruistic desire for humanity coming together in one person.&nbsp;</p>", "parentCommentId": "5awRcaGey9vjnDy2w", "user": {"username": "JeffreyK"}}, {"_id": "2pJwD2FhvkxbMRHM9", "postedAt": "2023-05-14T20:10:51.791Z", "postId": "NBZr5rGp35YyjABhw", "htmlBody": "<p>I would consider this to be a \"productive\" use of time!</p>", "parentCommentId": "GpX9WKiGHDHyd8ZnS", "user": {"username": "tigerdoes@outlook.com"}}]