[{"_id": "EdSQiLoZwLdRn8JtR", "postedAt": "2022-10-19T18:23:11.226Z", "postId": "Nc9fCzjBKYDaDJGiX", "htmlBody": "<p>First of all, this is dope, great job two years ago you.&nbsp;</p><p>I actually think you were probably originally pessimistic on the timescales. On your climate change update I haven't thought much about that stuff so can't comment.&nbsp;</p><p>The main crux for me is if the period of ravenous competition after the collapse (assuming billions survive) will kill people in correlated ways (i.e. most of the people who would want to read books and rebuild things are murdered or outcompeted).&nbsp;</p><p>The other main crux is if birth rates will actually go to back up from current. It seems possible to me that main reason we would go extinct is that people aren't even having replacement rate kids. This would definitely stop us from getting back to where we are as our global world requires a decent amount of people.&nbsp;</p><p>In general I'm not really sure that re-running history is all that apt of a baseline approach though I think it's somewhat relevant information and I'm glad you thought through it. It would be much, much, much easier a second time around. You seemed to acknowledge this but didn't give it the weight that I would. People didn't understand basic physics or germ theory until incredibly recently (and on and on). We have decentralized electricity generation lying around everywhere. Books aren't the best way to learn, but they aren't bad. And there are books explaining everything. We'd pick up the important stuff if we wanted to.&nbsp;</p><p>Technologically speaking, I'd assume we'd be well into the 20th century within 10 years of collapse (in the majority of different collapse situations), and in some ways we would have already returned to the 21st (e.g. we would probably be using computers again very quickly, though making them is a whole different story). I think looking at developing countries that leveraged catch up growth is a better baseline.&nbsp;</p><p>Political and social organization is where things could change a ton, but it's unclear if we even have good &nbsp;current versions of these things, so it might not be so hard to match or exceed current quality.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Charles_Guthmann"}}, {"_id": "fAZ5De4mHAJjzEHKH", "postedAt": "2022-10-19T20:56:20.515Z", "postId": "Nc9fCzjBKYDaDJGiX", "htmlBody": "<p>This is such a fantastic piece of research - changed views or no, I'm so glad you've finally published it :)</p>\n<p>A couple of follow-up questions:</p>\n<blockquote>\n<p>I think the probability of technological stagnation is somewhat higher than I did</p>\n</blockquote>\n<p>What do you mean exactly by 'technological stagnation'? Something like 'longer than your previous most pessimistic 33,000 years guess'?</p>\n<p>If the answer to the previous doesn't cover this: what time ranges would you now guess, if you had to? ('cause if not you, then who?)</p>\n", "parentCommentId": null, "user": {"username": "Arepo"}}, {"_id": "pyrhtxf8ee9Tpmx8g", "postedAt": "2022-10-19T21:07:10.968Z", "postId": "Nc9fCzjBKYDaDJGiX", "htmlBody": "<p>Karma upvoted, agreement downvoted.</p>\n<blockquote>\n<p>It seems possible to me that main reason we would go extinct is that people aren't even having replacement rate kids.</p>\n</blockquote>\n<p>I can't see how that could plausibly be a reason for extinction unless we were already <em>right</em> on the edge. The problem just solves itself rapidly as cultural and actual evolution select for the people who have the most children.</p>\n<blockquote>\n<p>Technologically speaking, I'd assume we'd be well into the 20th century within 10 years of collapse (in the majority of different collapse situations)</p>\n</blockquote>\n<p>This seems incredibly optimistic. To get that level of technology we'd already used an enormous amount of cheaply available resources that subsequent civilisation has made much less available. For example, fossil fuels would be mostly gone, and rock phosphorus would be much harder to access - some of the energy from the former is available in the form of things we use it to construct on the surface, but it seems likely 90%+ of it would be gone. Rock phosphorus I'm less clear on, but we've flushed the majority of what we've used of it into lakes and oceans, and while plenty remains which is accessible to modern society, we generally take the easiest-to-access deposits first, so a rebooting society would find it substantially more expensive to get in quantity.</p>\n", "parentCommentId": "EdSQiLoZwLdRn8JtR", "user": {"username": "Arepo"}}, {"_id": "2kHGYieYNwTZZYPpy", "postedAt": "2022-10-19T22:00:39.466Z", "postId": "Nc9fCzjBKYDaDJGiX", "htmlBody": "<blockquote><p>The problem just solves itself rapidly as cultural and actual evolution select for the people who have the most children.</p></blockquote><p>You are definitely right here. I take back what I said, or at most I append it to saying that the length it takes for this evolution to occur is a crux of how long recovery takes.&nbsp;</p><p>Re point 2: I think I might be a bit confused on what the end goal we are actually measuring is. Is the original post saying the amount of time it would take to push past our current level of technology, or until we have a stable society that is advancing technologically or until the world GDP per capita is approaching what it is today?</p><p>I'm not sure what I originally thought but now I'm having a tough time even understand what the time estimates are for. E.G. One might think Global supply chains could take decades - a couple hundred years to get back going as they once were but we might immediately be able to find new ways to gerry-rig much of the existing technology and upkeep it, even if we can't build more of it or permanently save it. We might even be able to incrementally improve some of it.&nbsp;</p>", "parentCommentId": "pyrhtxf8ee9Tpmx8g", "user": {"username": "Charles_Guthmann"}}, {"_id": "KdpHqgrcFfbo4xcqC", "postedAt": "2022-10-20T00:36:47.830Z", "postId": "Nc9fCzjBKYDaDJGiX", "htmlBody": "<blockquote>\n<p>Re point 2: I think I might be a bit confused on what the end goal we are actually measuring is. Is the original post saying the amount of time it would take to push past our current level of technology, or until we have a stable society that is advancing technologically or until the world GDP per capita is approaching what it is today?</p>\n</blockquote>\n<p>I'm not sure exactly what Luisa had in mind, but I think the vagueness about what 'recovery' looks like after a catastrophe is a real problem in the x-risk community. I've got a couple of posts on a related subject in the works, which will hopefully be ready in a week or so.</p>\n", "parentCommentId": "2kHGYieYNwTZZYPpy", "user": {"username": "Arepo"}}, {"_id": "phCZttenGbuc2ufXL", "postedAt": "2022-10-20T14:42:01.583Z", "postId": "Nc9fCzjBKYDaDJGiX", "htmlBody": "<p>Nice I’ll keep an eye out for the posts.</p>\n", "parentCommentId": "KdpHqgrcFfbo4xcqC", "user": {"username": "Charles_Guthmann"}}, {"_id": "m9xtvcNGZnduEcRvf", "postedAt": "2022-10-20T15:51:23.400Z", "postId": "Nc9fCzjBKYDaDJGiX", "htmlBody": "<p>Thanks this is great!<br><br>My intuition strongly suggests that it would take less than a thousand years to rebuild industrial society, even starting from hunter-gatherer levels.&nbsp;<br>Argument to articulate my intuition:<br>--It would take at most something like 100 years to get to something like ancient Athens, a primitive agrarian economy but rich enough that some people could afford to think and learn etc., <i>and with a strong culture of science/discovery/engineering. </i>The italicized part is the hard part, I think -- it happened in Athens and various other city-states but not in most of them. However, &nbsp;100 years after the collapse the cultural knowledge of the Before Times would still be present, so I think the average city-state 100 years after collapse would have levels of science/discovery/engineering culture that would be <i>at least </i>as high as Athens.<br>--Ancient Athens, if it had loads of artefacts from an industrial civilization and diagrams lying around for how to build them, probably could have figured out to get there in 100 years or so. The bottleneck historically was NOT the sheer clock time it takes to go through the various stages (iteratively improving a set of tools and processes and accumulating resources which you use to build the next tech level, which you then improve to build the tech level after that, etc.) but rather the clock time it took to invent the new technologies. (A major restriction was that people didn't generally think inventing things was a worthwhile pursuit; the governments of the time thought that building huge monuments was a better use of resources. Well, if they thought they could be FIRING CANNONS in 50 years and FLYING IN AIRPLANES BOMBING THEIR ENEMIES in 100 years, if only they put loads of money and effort into science and tech, they surely would!)<br>--Conclusion: Estimated ~200 year timeline to rebuild civilization starting from industrial era.<br><br>This estimate is way more optimistic than yours, I wonder why. Which of the premises above would you disagree with? I'm guessing the second one?</p>", "parentCommentId": null, "user": {"username": "kokotajlod"}}, {"_id": "uAbaFkGAdfiv4G5XR", "postedAt": "2022-10-24T18:09:40.279Z", "postId": "Nc9fCzjBKYDaDJGiX", "htmlBody": "<p>Since Luisa is only considering natural sources of extinction during recovery, I assume that recovery means until the new time of perils when we have anthropogenic existential risks, so something like 1945. Some of this content is in her 80K <a href=\"https://80000hours.org/podcast/episodes/luisa-rodriguez-why-global-catastrophes-seem-unlikely-to-kill-us-all/\">podcast</a>.</p>", "parentCommentId": "KdpHqgrcFfbo4xcqC", "user": {"username": "Denkenberger"}}, {"_id": "rFbAdcF4S46bsEJ7d", "postedAt": "2022-10-24T21:06:14.351Z", "postId": "Nc9fCzjBKYDaDJGiX", "htmlBody": "<p>It's great to see your reasoning. It seems reasonable for rerunning history. However, for something like fossil fuels and mineral resources being more expensive, it might not just be a delay in getting industry, but instead not having rapid enough economic growth to exceed population growth and therefore escape the Malthusian trap. Even worse would be potential permanent changes in humanity, such as a change in genetics due to radioactive damage (I don't think we have enough nuclear weapons to do that now, but in some future scenario, we might). Similarly, perhaps the massive mortality of the catastrophe could select for people with less desirable characteristics, such as lower trust. If the catastrophe involved the loss of the grass family, that would have excluded all agricultural civilizations except for the Andean one. There could also be an endemic disease that prevents high population density, which is basically required for civilization. You mentioned long-lasting anthropogenic climate change as being a significant risk, but naturally we could go back into an Ice Age or just have a generally less stable climate than the last 10,000 years.</p><p>I think the bigger picture is how much a catastrophe reduces our long-term potential of humanity. Though not the question you're asking here, I am concerned about even if we do recover technologically, that our values might be worse than now, and that could get locked into AI.</p><p>For all of these reasons, I think the reduction in long-term potential of these global catastrophes is more like order of magnitude 10%.</p>", "parentCommentId": null, "user": {"username": "Denkenberger"}}, {"_id": "ziBriQQirzJG7B8ke", "postedAt": "2022-10-28T08:46:51.533Z", "postId": "Nc9fCzjBKYDaDJGiX", "htmlBody": "<p>I listened to Luisa's podcast a while ago but don't really remember it so thank you for the clarification. I will go ahead and say that might be a bad definition to use. If anyone who had any knowledge about the nuclear protocol of any country with an arsenal survived, then plausibly we could launch dozens + nukes once we got a few basic functionalities up and running. Similar things could be said about AGI, if we imagine it has been invented before the collapse. I guess this does start to get really in the weeds of each countries nuclear protocall and how easy it would be to access them just based on the systematic defenses in place. I am completely out of my depth here. It's possible that without a bunch of passcodes or people who remember certain things and have access to certain doors it's all impossible. But on the other hand if most people are dead you can just start dynamiting parts of the pentagon until you find the right room...</p><p>( I think it's an open question if nukes actually pose an existential risk until you start launching absurd amounts of them, something Luisa herself has done research on IIRC. Still, i'm mainly going off of getting to the level of destruction we could have created in 1945)</p><p>It seems like it is the creation of new objects and technology that will take a lot of time. Weapons of mass destruction will still exist, and perhaps be even easier to access for pernicious uses (but like I said I don't have a clear idea of this).</p>", "parentCommentId": "uAbaFkGAdfiv4G5XR", "user": {"username": "Charles_Guthmann"}}, {"_id": "q2HFsoRfFrErdBrBQ", "postedAt": "2022-10-28T09:10:35.831Z", "postId": "Nc9fCzjBKYDaDJGiX", "htmlBody": "<blockquote><p>Well, if they thought they could be FIRING CANNONS in 50 years and FLYING IN AIRPLANES BOMBING THEIR ENEMIES in 100 years, if only they put loads of money and effort into science and tech, they surely would!)&nbsp;</p></blockquote><p>I feel like you really hit the nail on the head here of where I think the original post went off track.&nbsp;</p><p>My opinion is that the original post is significantly underrating the value of the current zeitgeist, which is <i>related</i> &nbsp;to cultural norms and values but not the same thing. There will be this sense in the air of what things can become/return to, and it won't be some vague notion of progress, it will be a very specific notion of planes, capitalism, computers, etc. It will be massively important that people understand that they can get to these things. I'd even go farther than you and say it's not inventing the technologies that takes so much time, but the combination of having to invent them and not knowing which technologies to invent in the first place. If we told the romans that they should invent electricity I feel like it's not that crazy to think they would have figured it out (depending on how much we specify what electricity is).</p><p>That's why I said in my other comment that it might make sense to look at developing countries that leveraged catchup growth rather then rerunning history as a baseline. These countries had a similar Zeitgeist (i'm sort of just using this as a placeholder word until I can specify what I mean more) in this dimension. (some) People in these countries went to developed nations and saw what things could become. Of course it is also important they have some idea how to get there, but I don't see that as much of a crux, since there should be books lying around everywhere.&nbsp;</p>", "parentCommentId": "m9xtvcNGZnduEcRvf", "user": {"username": "Charles_Guthmann"}}, {"_id": "iX5XuaCd4SsJSReGy", "postedAt": "2022-10-28T09:41:12.382Z", "postId": "Nc9fCzjBKYDaDJGiX", "htmlBody": "<p>Also I don't see why it would take even close to 100 years to get to ancient Athens. I see you said at most so possibly we are in agreement.</p><p>I feel pretty confident that my father, who is a city dweller like myself, but who loves gardening and is an avid reader, could produce 1000x-10000x his own needs in food within 5 years if he had access to nearby farmland, tractors/corn picking machines, gas, a well, and some relevant books. &nbsp;I don't even think he would need electricity(though I'm not sure ). We live in Chicago, which is only a few days walk or less from literal industrial scale cornfields with all the equipment you would need and also a wealth of libraries with any book he might need about how to farm at scale.&nbsp;</p><p>This is someone who has a pretty deep understanding of cellular biology and moderate understanding of botany as well as lots of experience gardening and reading tips that have taken 1000s of years to develop. He's somewhat unusual but It's not like he's an incredibly rare person. There are lots of people alive right now who understand plants wayyyyyy better than Mendel, let alone anyone in Athens. Moreover we have GMO'd plants and TRACTORS and drip irrigation, and we understand crop rotation, etc. etc. etc. These things won't disappear and neither will the infrastructure created by mega farms, which have automated the vast majority of what they do (depending on the plant, but in the case of corn for instance, there is nearly no labor involved).</p><p>I just don't see it. Either there is a 100 year period where going outside or establishing a colony will get you insta murdered or there will be lots of people who will quickly prosper to levels of wealth completely unseen by all but the wealthiest people ever alive during 300 BC. There needs to be some specific mechanistic explanation for why someone like my father would not be able to safely farm a cornfield.&nbsp;</p><p>I'm beating a dead horse here but based on an incredibly quick search 80% !! of ancient greece was engaged in agriculture. Currently in the US it's something like 1-2 %. Let's assume we lose an order of magnitude of our current agricultural productivity per capita. Then we are still producing 4-8x the food as them per person. And this seems like an incredibly conservative assumption. Because if civilization collapsed, we wouldn't be farming oranges and bananas and spinach and berries, etc. We'd be farming corn and potatoes, which are both more calorie dense and extremely automated/optimized and thus trending way above the general efficiency ratios noted above.</p><p>With this abundance of food we could immediately spend the majority of our time studying modern civilization and rebuilding. It's at this point where I feel much less clear of the timelines.</p>", "parentCommentId": "m9xtvcNGZnduEcRvf", "user": {"username": "Charles_Guthmann"}}, {"_id": "MfJeAGteMjvNYymLt", "postedAt": "2022-11-20T22:52:14.257Z", "postId": "Nc9fCzjBKYDaDJGiX", "htmlBody": "<p>I wonder why \"technological stagnation\" isn't a topic already. Is there a way to recommend it to moderators?</p>", "parentCommentId": null, "user": {"username": "fmoreno"}}]