[{"_id": "LLtmKzTnQJ8JDsKHa", "postedAt": "2018-08-07T16:03:47.006Z", "postId": "NceQ2JxaqusiCRJNq", "htmlBody": "<p>While it's hard to disagree with the math, would it not be fairly unlikely for the current allocation of resources to be close enough to the actual allocation of resources that this would realistically lead to allocating an agent's resources to more than one cause area? Like you mention, the allocation within the community-building cause area itself is one of the more likely candidates, as we have a large piece of the pie in our hands (if not all of it). However, the community is not one agent, so we would need to funnel the money through e.g. EA Funds, correct?</p>\n<p>Alternatively, there could be top-level analysis of what the distribution -ought- to be, and what it -currently is-, and suggest people donate to close that gap. But is this really different from arguments in terms of marginal impact and neglectedness? I agree your line of thinking ought to be followed in such analysis, but am not convinced that this isn't incorporated already.</p>\n<p>It also doesn't solve issues like Sam Bankman-Fried mentioned where according to some argument one cause area is 44 orders of magnitude more impactful, because even if the two causes are multiplicative, if I understand correctly this would imply a resource allocation of 1:10^44, which is effectively the same as going all in on the large cause area. I think that even in less extreme cases than this, we should actually be far more &quot;egalitarian&quot; in our distribution of resources than multiplicative causes (and especially additive causes) suggest, as statistically speaking, the higher the expected value of a cause area is, the more likely that it is overestimated.</p>\n<p>I do think this is a useful framework on a smaller scale. E.g. your example of focusing on new talent or improving existing talent within the EA community. For local communities where a small group of agents plays a determining role on where the focus lies, this can be applied much more easily than in global cause area resource allocations.</p>\n", "parentCommentId": null, "user": {"username": "MvdSteeg"}}, {"_id": "oSoCm39M275XSkhpA", "postedAt": "2018-08-07T21:31:59.296Z", "postId": "NceQ2JxaqusiCRJNq", "htmlBody": "<p>&quot;Note also that while we’re looking at such large pools of funding, the EA community will hardly be able to affect the funding ratio substantially. Therefore, this type of exercise will often just show us which single cause should be prioritised by the EA community and thereby act additive after all. This is different if we look at questions with multiplicative factors in which the decisions by the EA community can affect the input ratios like whether we should add more talent to the EA community or focus on improving existing talent.&quot;</p>\n<p>I agree that multiplicative factors are a big deal for areas where we collectively have strong control over key variables, rather than trying to move big global aggregates. But I think it's the latter that we have in mind when talking about 'causes' rather than interventions or inputs working in particular causes (e.g. investment in hiring vs activities of current employees). For example:</p>\n<p>&quot;Should the EA community focus to add its resources on the efforts to reduce GCRs or to add them to efforts to help humanity flourish?&quot;</p>\n<p>If you're looking at global variables like world poverty rates, or total risk of extinction it requires quite a lot of absolute impact before you make much of a proportional change.</p>\n<p>E.g. if you reduce the prospective risk of existential catastrophe from 10% to 9%, you might increase the benefits of saving lives through AMF by a fraction of a percent, as it would be more likely that civilization would survive to see benefits of the AMF donations. But a 1% change would be unlikely to drastically alter allocations between catastrophic risks and AMF. And a 1% change in existential risk is an enormous impact: even in terms of current humans (relevant for comparison to AMF) that could represent tens of millions of expected current lives (depending on the timeline of catastrophe), and immense considering other kinds of beings and generations. If one were having such amazing impact in a scalable fashion it would seem worth going further at that point.</p>\n<p>Diminishing returns of our interventions on each of these variables seems a much more important consideration that multiplicative effects between these variables: cost per percentage point of existential risk reduced is likely to grow many times as one moves along the diminishing returns curve.</p>\n<p>&quot;We could also think of the technical ideas to improve institutional decision making like improving forecasting abilities as multiplying with those institution’s willingness to implement those ideas.&quot;</p>\n<p>If we're thinking about institutions like national governments changing willingness to implement the ideas seems much less elastic than improving the methods. If we look at a much narrower space, e.g. the EA community or a few actors in some core areas, the multiplicative factors key fields and questions.</p>\n<p>If I was going to look for cross-cause multiplicative effects it would likely be for their effects on the EA community (e.g. people working on cause A generate some knowledge or reputation that helps improve the efficiency of work on cause B, which has more impact if cause B efforts are larger).</p>\n", "parentCommentId": null, "user": {"username": "CarlShulman"}}, {"_id": "x95GWBmk8zHT5P7ZD", "postedAt": "2018-08-08T15:20:15.411Z", "postId": "NceQ2JxaqusiCRJNq", "htmlBody": "<p>Great comment, thank you. I actually agree with you. Perhaps I should have focussed less on discussing the cause-level and more the interventions level, but I think it is still good to encourage more careful thinking on a cause-wide level even if it won't affect the actual outcome of the decision-making. I think people rarely think about e.g. reducing extinction risks benefiting AMF donations as you describe it.</p>\n<p>Let's hope people will be careful to consider multiplicative effects if we can affect the distribution between key variables.</p>\n", "parentCommentId": "oSoCm39M275XSkhpA", "user": {"username": "Denise_Melchin"}}, {"_id": "SHH2hkyYwjy8mMPMC", "postedAt": "2018-08-08T15:41:59.966Z", "postId": "NceQ2JxaqusiCRJNq", "htmlBody": "<p>I address the points you mention in my response to Carl.</p>\n<blockquote>\n<blockquote>\n<p>It also doesn't solve issues like Sam Bankman-Fried mentioned where according to some argument one cause area is 44 orders of magnitude more impactful, because even if the two causes are multiplicative, if I understand correctly this would imply a resource allocation of 1:10^44, which is effectively the same as going all in on the large cause area.</p>\n</blockquote>\n</blockquote>\n<p>I don't think this is understanding the issue correctly, but it's hard to say since I am a bit confused what you mean by 'more impactful' in the context of multiplying variables. Could you give an example?</p>\n", "parentCommentId": "LLtmKzTnQJ8JDsKHa", "user": {"username": "Denise_Melchin"}}, {"_id": "ACqEjcGFTb8uJGYvp", "postedAt": "2018-08-08T16:49:30.017Z", "postId": "NceQ2JxaqusiCRJNq", "htmlBody": "<p>I guess when I say &quot;more impactful&quot; I mean &quot;higher output elasticity&quot;.</p>\n<p>We can go with the example of x-risk vs poverty reduction (as mentioned by Carl as well). If we were to think that allocating resources to reduce x-risk has an output elasticity 100,000 higher than poverty reduction, but reducing poverty improves the future, and reducing x-risk makes reducing poverty more valuable, then you ought to handle them multiplicatively instead of additively, like you said.</p>\n<p>If you'd have 100,001 resources to spend, that'd mean 100,000 units against x-risk and 1 unit for poverty reduction, as opposed to the 100,001 for x-risk and 0 for poverty reduction when looking at them independently(/additively). Sam implies the additive reasoning in such situations is erroneous, after mentioning an example with such a massive discrepancy in elasticity. I'm pointing out that this does not seem to really make a difference in such cases, because even with proportional allocation it is effectively the same as going all in on (in this example) x-risk.</p>\n<p>Anyway, not claiming that this makes the multiplicative approach incorrect (or rather, less correct than additive), just saying that in this case which is mentioned as one of the motivations for this, it really doesn't make much of a difference (though things like diminishing returns would). Maybe this would have been more fitting as a reply to Sam than you, though!</p>\n", "parentCommentId": "SHH2hkyYwjy8mMPMC", "user": {"username": "MvdSteeg"}}, {"_id": "z6jNHYhQ7dvCia76T", "postedAt": "2018-08-10T13:21:15.718Z", "postId": "NceQ2JxaqusiCRJNq", "htmlBody": "<p>What you're saying is correct if you're assuming that so far zero resources have been spent on x-risk reduction and global poverty. (Though that isn't quite right either: You can't compute an output elasticity if you have to divide by 0.)</p>\n<p>But you are supposed to compare the ideal output elasticity ratio with how resources are being spent currently, those ratios are supposed to be equal locally. So using your example, if there were currently more than 1mil times as many resources spent on x-risk than global poverty, global poverty should be prioritised.</p>\n<p>When I was running the numbers, my impression was that global wellbeing increases had a much bigger output elasticity than x-risk reduction. I found it a bit tricky to find numbers for global (not just EA) x-risk reduction efforts, so I'm not confident and also not confident how large the gap in resource spending is. 80k quotes $500 billion per year for resources spent on global wellbeing increases.</p>\n", "parentCommentId": "ACqEjcGFTb8uJGYvp", "user": {"username": "Denise_Melchin"}}]