[{"_id": "9WSbDyRTqM93gCm4y", "postedAt": "2015-06-28T20:09:30.344Z", "postId": "NDhjoWvTA8z4pq8hD", "htmlBody": "<p>If 'veg*n' isn't a word that everyone uses yet, I think there should be a different one. It's hard to not read it as a misspelling of 'vegan.' </p>\n<p>It seems kind of weird that things recede after seven years. Like, if it were a willpower thing I'd expect it to be shorter. I'm not just going to decide after a few years that my eating habits are too hard to keep up.</p>\n<p>Did you see anything about people saying why they started eating animal stuff again?</p>\n", "parentCommentId": null, "user": {"username": "JMeans"}}, {"_id": "SZD3jSyFW32hD63jT", "postedAt": "2015-06-28T20:51:01.214Z", "postId": "NDhjoWvTA8z4pq8hD", "htmlBody": "<p>Seven years is an average; the distribution seems pretty skewed.</p>\n<blockquote>\n<p>Did you see anything about people saying why they started eating animal stuff again?</p>\n</blockquote>\n<p>Yes, see the text right under the &quot;Why is veg*n recidivism so high&quot; heading.</p>\n", "parentCommentId": "9WSbDyRTqM93gCm4y", "user": {"username": "xccf"}}, {"_id": "MmjgRW5Pvc4Qy7GSN", "postedAt": "2015-06-28T21:24:27.447Z", "postId": "NDhjoWvTA8z4pq8hD", "htmlBody": "<p>&quot;Like, if it were a willpower thing I'd expect it to be shorter. I'm not just going to decide after a few years that my eating habits are too hard to keep up.&quot;</p>\n<p>This seems reasonable, but the reasons given were health issues followed by hassles, and only then uncontrollable cravings. Health issues would probably take a while to develop and then a while more to respond to by switching back. </p>\n<p>Re. hassles, I can imagine someone switching to a vegan diet when it is relatively more convenient and then switching back when it stops being so because your environment changes, e.g you switch when you're near stores that stock a good selection of vegan products, and then stop when you move to a different area.</p>\n", "parentCommentId": "9WSbDyRTqM93gCm4y", "user": {"username": "AGB"}}, {"_id": "dvC2rCdi8aNZLhJBk", "postedAt": "2015-06-28T22:47:18.402Z", "postId": "NDhjoWvTA8z4pq8hD", "htmlBody": "<p>I'm not sure there is enough data here about veganism as opposed to vegetarianism to draw many conclusions. It would also be interesting to see how many vegans for ethical reasons have reverted back and compare the two growth rates of ethical vs dietary vegans. </p>\n<p>It may be better to look at the amount of meat being bought year to year per capita to see overall trends. 50 million people eating vegetarian for one day a week will have a much larger impact then 100,000 more vegans.</p>\n", "parentCommentId": null, "user": {"username": "DavidNash"}}, {"_id": "Z6WEoy9fnncGajAgQ", "postedAt": "2015-06-29T00:55:18.212Z", "postId": "NDhjoWvTA8z4pq8hD", "htmlBody": "<p>Two ideas:</p>\n<p>(1) Direct Action Everywhere (a group of which I am a part, full disclosure) promotes community building as a way to address this. It seems like social support can address many of the reasons for recidivism both by providing moral support and providing a group of friends who can help address issues you face. On the other hand, social ostracism for your diet seems likely to be a challenge to remaining veg*n. I'd like to see diet on this, though I suspect self-reports wouldn't be that trustworthy on this subject.</p>\n<p>What do you think of this as (part of) a solution?</p>\n<p>(2) I believe the Humane Research Council's study found that people who were vegan for animal-related reasons were less susceptible to recidivism. Perhaps keeping the focus on an animal-centered message would help? Again, I'm not an unbiased observer since this is the approach I take. Curious for others' thoughts.</p>\n", "parentCommentId": null, "user": {"username": "zdgroff"}}, {"_id": "ck2X5YrGaHQDWP5ey", "postedAt": "2015-06-29T01:46:39.135Z", "postId": "NDhjoWvTA8z4pq8hD", "htmlBody": "<p>Wouldn't veg*n recidivism specifically be more important for evaluating veg*n outreach programs like leafleting?</p>\n", "parentCommentId": "dvC2rCdi8aNZLhJBk", "user": {"username": "Tom_Ash"}}, {"_id": "kPPFWdYMQurxd8kcm", "postedAt": "2015-06-29T02:08:08.248Z", "postId": "NDhjoWvTA8z4pq8hD", "htmlBody": "<blockquote>\n<p>As you might have guessed, veg*nism advocacy isn't my current guess for the best cause and I don't restrict my diet.  (I won't get in to details on this because I'd prefer to keep the discussion focused.)  But I know I appreciate people providing informed, thoughtful outside criticism of the causes I support, and I guessed many veg*n Effective Altruists feel the same way, so that's what I tried to do for them. </p>\n</blockquote>\n<p>It's a useful contribution, thanks, we need more like it! (Though I'm more in your camp. In fact I think recidivism is a big concern across EA as a whole. I've struggled with it myself as a veg*n of varying varieties. However - I'd guess like you - I prefer to avoid public picking apart of my personal choices. When I tried <a href=\"https://docs.google.com/spreadsheets/d/12Y9ybW1tFcqiJp63reofC2LXanuzO4Xj8IPgKghfFng/edit#gid=0\">optimising my allocation of willpower</a> recently, veg*nism turned out on reflection to consume a lot of this, though my impression is that I find it unusually hard and unpleasant. :S )</p>\n", "parentCommentId": null, "user": {"username": "Tom_Ash"}}, {"_id": "qJvNq2MqjxtkQarMp", "postedAt": "2015-06-29T04:38:42.402Z", "postId": "NDhjoWvTA8z4pq8hD", "htmlBody": "<p>I don't think I have special insight in to either of those questions.  My purpose was to point out the likely existence of low-hanging fruit in spreading info on how to eat a healthy vegan diet.  (BTW, I didn't mention this in the post, but I suspect the experience of &quot;meat cravings&quot; may be your body telling you that you're not getting enough of particular vital nutrients.)</p>\n", "parentCommentId": "Z6WEoy9fnncGajAgQ", "user": {"username": "xccf"}}, {"_id": "x6i7kuNb3HKeQrwPS", "postedAt": "2015-06-29T10:30:11.762Z", "postId": "NDhjoWvTA8z4pq8hD", "htmlBody": "<p>Maybe, or we could compare areas with tv/radio/internet advertising/ leafletting and the resulting change in non vegan products bought in that area, which could take in a much larger data sample.</p>\n<p>Both would be important to see what works, and maybe reaching out to companies that sell vegan products to see if they have market data could help.</p>\n", "parentCommentId": "ck2X5YrGaHQDWP5ey", "user": {"username": "DavidNash"}}, {"_id": "BivFxZtSnfxmgJ4w8", "postedAt": "2015-06-29T10:33:06.080Z", "postId": "NDhjoWvTA8z4pq8hD", "htmlBody": "<p>I suspect that veganism is also done at the same time as organic/local/raw and other things that drain willpower and might be unhealthy and expensive and more socially awkward. You would need to tease out the different types of veganism to see the respective growth and recidivism rates.</p>\n", "parentCommentId": "9WSbDyRTqM93gCm4y", "user": {"username": "DavidNash"}}, {"_id": "WeowAGRsFoq4zfs5f", "postedAt": "2015-06-30T04:41:45.043Z", "postId": "NDhjoWvTA8z4pq8hD", "htmlBody": "<p>The difference between a dominant approach and a measurable approach could explain why ACE recommends vegan advocacy groups, since the impact of investigations that groups like DxE are harder to measure, even if they're more effective. There's also a lack of charities directly trying to reduce animal suffering in general. </p>\n", "parentCommentId": null, "user": {"username": "MarieLa"}}, {"_id": "PcT3DrYeSy2g8t3QF", "postedAt": "2015-06-30T10:18:48.762Z", "postId": "NDhjoWvTA8z4pq8hD", "htmlBody": "<p>I think a major part of why people lapse completely is that there exists a widespread belief that veg*nism is a hard and fast label, and falling off the wagon is irreversible. Many ex-vegans I know now eat completely omni diets that are simply at odds with their moral beliefs. I think that promoting the idea that 80/20 veganism is okay will result in a lot less animal product consumption overall. This <a href=\"http://www.vegsource.com/news/2012/06/the-rise-of-nonperfectionist-veganism.html\">article</a> explains the way this black-and-white thinking negatively affects peoples' beliefs around their diet and personal identity. </p>\n<p>Religious communities have a lot to teach us here. Picture the following recruitment strategy:</p>\n<ul>\n<li>target the majority of a population in a small, stable area (liberal upper-middle class suburbia seems like a good initial candidate)</li>\n<li>focus on recruiting the influencers and the household cooks</li>\n<li>hold weekly or monthly food-related events (communal meals) where people have an opportunity to learn more, question, make public commitments and be supported by their peers</li>\n<li>promote adherence to values rather than strict rules, and encourage people to honestly discuss their challenges and successes.</li>\n</ul>\n<p>Eventually, this kind of community could function like a local atheist spiritual community of some kind, and be a platform for spreading other effective altruism ideas.</p>\n<p>In most parts of the world, veganism is not the norm, which I believe is a big part of why people find it so challenging long-term. Focusing on universities strengthens the perception that veganism is merely part of a normal period of experimentation. Once there are people who live in communities where more than 50% of people are veg*n, I suspect it will be much easier to both retain those people and convert new people. </p>\n", "parentCommentId": null, "user": {"username": "JessicaWatsonMiller"}}, {"_id": "aXQZaY5jzM7pMpuvJ", "postedAt": "2015-06-30T10:25:53.180Z", "postId": "NDhjoWvTA8z4pq8hD", "htmlBody": "<p>I use a harm-minimisation strategy when I'm in food deserts or traveling, but I suspect I'm very rare. For many vegans I know, not eating any animal products at all is part of their identity, so being forced to consume them because of a lack of availability would be incredibly emotionally stressful for them and create a lot of cognitive dissonance.</p>\n", "parentCommentId": "MmjgRW5Pvc4Qy7GSN", "user": {"username": "JessicaWatsonMiller"}}, {"_id": "BxKi4GPiH6ZbYSynt", "postedAt": "2015-07-05T16:46:41.723Z", "postId": "NDhjoWvTA8z4pq8hD", "htmlBody": "<p>Thanks for the article. I'm surprised you didn't mention the Faunalytics (HRC) study that underpins the ACE analysis. Our analysis touches on many of the points you mention above. For you and your readers, here is a link to the full study: <a href=\"https://faunalytics.org/feature-article/study-of-current-and-former-vegetarians-and-vegans/\">https://faunalytics.org/feature-article/study-of-current-and-former-vegetarians-and-vegans/</a></p>\n<p>Additionally, we have more analysis coming from the results including length of adherence to veg*n diets as well as qualitative findings on motivations and barriers. </p>\n", "parentCommentId": null, "user": {"username": "chegreen"}}, {"_id": "Tz9B3F4i9XyiDJNbR", "postedAt": "2015-07-05T21:47:26.355Z", "postId": "NDhjoWvTA8z4pq8hD", "htmlBody": "<p>Thanks very much for commenting.  I'm having a bit of trouble accessing the attachments on the page you link to, e.g. my browser tells me <a href=\"https://faunalytics.org/wp-content/uploads/2015/06/Faunalytics_Current-Former-Vegetarians_Full-Report.pdf\">this page</a> has a redirect loop.</p>\n<p>If you want to highlight important things from the study that I got wrong or left out, I'd be happy to link to your comment in my post.</p>\n", "parentCommentId": "BxKi4GPiH6ZbYSynt", "user": {"username": "xccf"}}, {"_id": "d2ApeY6BdbzMo4bct", "postedAt": "2015-07-05T22:57:44.922Z", "postId": "NDhjoWvTA8z4pq8hD", "htmlBody": "<p>The attachment links for the Faunalytics study are now fixed. Thanks again for point out the issue.</p>\n<p>We cover a lot of ground in those reports, and much of it corroborates what you say in this post. I'm not sure where the assumption of exponential growth comes from, however. Our research has shown that the proportion of vegans/vegetarians has not increased substantially in the past decade. There may be exponential growth with Google searches of the term &quot;vegan,&quot; but that doesn't mean the vegan population is growing.</p>\n<p>Rather, the reduction in farmed animal slaughter and the rise of vegan food alternatives is being driven by &quot;part-time&quot; abstainers. That's where we see the exponential growth. With that said, I certainly agree the growth rate is more important than the absolute number of vegans. The challenge is that research on low-incidence populations like vegans/vegetarians is hard, especially when tracking changes over time.</p>\n<p>In addition to helping people maintain a nutritious and plentiful diet while being veg*n, animal advocate also need to work on making veganism less of a purist identity and to make it more inclusive. Following are the recommendations copied from our report:</p>\n<p>Improve Vegetarian/Vegan Retention</p>\n<ul>\n<li>Target Demographics – Target outreach activities toward those who are most likely to adhere to the diet. Current and lapsed vegetarians/\nvegans differ significantly when it comes to their age, political orientation, and religious beliefs. Current vegetarians/vegans are also more\nlikely to have adopted the diet at a younger age and to have transitioned more gradually.</li>\n<li>Increase the Focus on the “How” of Vegetarianism/Veganism – 1) Design outreach and supporting efforts to address the most common\ndifficulties faced by former vegetarians/vegans, including: cravings and boredom with food options; insufficient interaction with other\nvegetarians/vegans; not being actively involved in a vegetarian/vegan community; not seeing the diet as part of their identity; disliking that\ntheir diet made them “stick out from the crowd;” and feeling it was too difficult to be “pure” with their diet. Interestingly, health did not present\na noticeable difficulty for study participants, with the exception of vitamin B12 monitoring. 2) Consider increasing awareness about the\nimportance of B12: a far greater percentage of former (76%) than current (42%) vegetarians/vegans never had their B12 levels checked\nwhile they were adhering to the diet. 3) Think about barriers in the domestic sphere, including the fact that 33% of former vegetarians/\nvegans were living with a non-vegetarian/vegan significant other when they lapsed. With about a third (34%) of lapsed vegetarians/vegans\nreporting that they ate the diet for three months or less, the window for advocates to help individuals find ways to sustain their\nvegetarianism/veganism is small. While this window is still open, think of vegetarian/vegan advocacy as a longer-term relationship, not just\na single point of outreach.</li>\n<li>Diversify Messaging for the “Why” of Vegetarianism/Veganism – Current vegetarians/vegans report a broader range of motivations for\neating their diet than do former vegetarians/vegans. While the only motivation cited by a majority of former vegetarians/vegans (58%) was\nhealth, a number of motivations were identified by a majority of current vegetarians/vegans: health (69%), animal protection (68%), concern\nfor the environment (59%), feelings of disgust about meat/animal products (63%), and taste preferences (52%).</li>\n<li>Focus on Lapsed Vegetarians/Vegans – More than a third (37%) of former vegetarians/vegans are interested in re-adopting the diet, and a\nmajority of these individuals say they are likely or very likely to do so, with health being the primary motivator. If even half of the individuals\nwho express an interest were to resume the diet, that would double the number of current vegetarians/vegans in the U.S. Some thought will\nbe needed, however, to come up with an advocacy approach that works for these individuals.</li>\n</ul>\n", "parentCommentId": "Tz9B3F4i9XyiDJNbR", "user": {"username": "chegreen"}}, {"_id": "CXo5SrTXpB2XnKtgB", "postedAt": "2015-07-06T14:11:43.411Z", "postId": "NDhjoWvTA8z4pq8hD", "htmlBody": "<p>i agree with the 80/20 idea, and i wonder we apparently 98% of our movement keeps stuck in black and white thinking. for instance in this case, we are apparently thinking that the question to what level of consumption the vegans are sliding back is irrelevant, but it's not, of course. for one thing, moderate use still saves a lot of animals, for another, every reducer helps make full time veganism more easy, by increasing demand (and thus the supply), the social acceptability, the convenience with which to eat vegan etc... a society where 60% of people are 75% vegan is probably a lot better and closer to a vegan society than one where 10% of the people are full time vegan...</p>\n<p>also, something jonathan saffran foer told me: you know the example of the guy that eats meat again because once he was at an airport and it was the only thing he could it? he fell back entirely. i think that has to do with the fact that we see veganism too much as an identity, and as something binary. when we fail, we might as well give up</p>\n<p>i know the second point is perhaps in contradiction with the first, but maybe they both have some merit somewhere... </p>\n", "parentCommentId": "PcT3DrYeSy2g8t3QF", "user": {"username": "tobiasleenaert"}}, {"_id": "GTYb6xAxYWfPMcctc", "postedAt": "2015-07-06T21:46:21.125Z", "postId": "NDhjoWvTA8z4pq8hD", "htmlBody": "<p>Thank you!  I linked to your comment near the top of my post.</p>\n<blockquote>\n<p>While the only motivation cited by a majority of former vegetarians/vegans (58%) was health, a number of motivations were identified by a majority of current vegetarians/vegans: health (69%), animal protection (68%), concern for the environment (59%), feelings of disgust about meat/animal products (63%), and taste preferences (52%).</p>\n</blockquote>\n<p>So this data suggests the people who stick with veganism tend to be people motivated by multiple factors?</p>\n<p>A quick defense of my exponential growth model: Changes in the size of the vegan movement are a result of a tension between tendencies for it to grow and tendencies for it to shrink.  If you're correct that the size of the movement has been basically flat, that suggests those tendencies are currently canceling each other out.  But that doesn't mean this way of thinking is totally useless.  (It could be significantly misleading if there's a subset of the population that's naturally much more inclined to veganism though.)</p>\n", "parentCommentId": "d2ApeY6BdbzMo4bct", "user": {"username": "xccf"}}, {"_id": "GKWJ4a6scEcowQvbM", "postedAt": "2015-07-08T22:29:15.630Z", "postId": "NDhjoWvTA8z4pq8hD", "htmlBody": "<p>An average of seven years is consistent with the hypothesis that the problem is vitamin B12 deficiency. Our bodies store enough B12 that it takes anywhere from months to decades for symptoms of a severely deficient diet to become clear.</p>\n", "parentCommentId": "9WSbDyRTqM93gCm4y", "user": {"username": "PeterMcCluskey"}}, {"_id": "b3f84WazwgjCxtHMe", "postedAt": "2015-07-09T10:52:15.997Z", "postId": "NDhjoWvTA8z4pq8hD", "htmlBody": "<p>Agree with that. Far too many vegans ignore B12.</p>\n", "parentCommentId": "GKWJ4a6scEcowQvbM", "user": {"username": "RyanCarey"}}, {"_id": "Cx9w9armPzPGtCRMr", "postedAt": "2015-08-24T10:45:52.686Z", "postId": "NDhjoWvTA8z4pq8hD", "htmlBody": "<p>Interesting point. Should there be a greater focus on advertising and promoting how to eat a healthy vegan diet? While I'm not sure how effective this would be, I'd like to see more people pressuring government health departments to advertise the health benefits of being vegan, as my brief reading on the topic indicates that, for the government at least, it would save them money in the long run as the public health burden would be lower.</p>\n", "parentCommentId": "GKWJ4a6scEcowQvbM", "user": {"username": "MichaelDello"}}, {"_id": "W4NSSWT5GcqxhYKem", "postedAt": "2015-08-24T11:20:48.037Z", "postId": "NDhjoWvTA8z4pq8hD", "htmlBody": "<p>I think that would be a good idea. Would it make sense to have Facebook ads and Google Video ads to promote <a href=\"http://nutritionfacts.org/\">NutritionFacts.org</a>? We might want to link to a page that distills the information on the videos into a single video or webpage, as the site has a <strong>lot</strong> of videos!</p>\n<p>Another idea could be to translate the videos or make transcriptions and translate those.</p>\n", "parentCommentId": "Cx9w9armPzPGtCRMr", "user": {"username": "tjmather"}}, {"_id": "sLSPvdPkBxvcTiix3", "postedAt": "2015-10-12T04:49:58.181Z", "postId": "NDhjoWvTA8z4pq8hD", "htmlBody": "<p>This is a pretty poor explanation for people stopping eating vegan. You could apply the same argument if the average time someone remained vegan were anywhere from 2 months to an entire lifetime.</p>\n", "parentCommentId": "GKWJ4a6scEcowQvbM", "user": {"username": "freeze4576"}}]