[{"_id": "nvhzeGJAXpXBW5azD", "postedAt": "2023-09-25T16:47:35.606Z", "postId": "NfgMAS67nKTGzmQMB", "htmlBody": "<p>I agree with large chunks of this post, but I'm weakly confident (75ish%) that the claim about how newspapers work is wrong. Most newspapers that I am familiar with give their reporters specified beats (topics that they focus on), to at least some extent, although I think there are also reporters that don't have specific beats. So if there's an important tech story that needs covered, like AI x-risk, some of that is going to be as a replacement for other tech stories and some of that is going to be taken from people who write on pretty much anything. That still might mean more AI present-risk coverage, because it's hard to talk about one without talking about the other, and because there's a lot of other room in tech to take away stories from, but I don't think it's as simple as it appears.</p><p>However, I'm basing this mostly off info from newspapers that wouldn't write important AI x-risk stories. Maybe they behave differently? Some other people here probably know more than I do.</p>", "parentCommentId": null, "user": {"username": "Benjamin M."}}, {"_id": "Dwskh99AbyCzekKmb", "postedAt": "2023-09-25T17:09:07.943Z", "postId": "NfgMAS67nKTGzmQMB", "htmlBody": "<p>I think there are two meanings of \"distraction\" here. The first, more \"serious\" meaning that the media probably uses is in the more generic sense of \"something which distracts people.\" The second one, and one that a lot of people in the \"AI ethics\" community like to use, is a sense in which this was deliberately thought up as a diversion by tech companies to distract the public from their own misconduct.</p><p>A problem I see is people equivocating between these two meanings, and thus inadvertently arguing against the media's weird steel-man version of the AI ethicists' core arguments, instead of the real arguments they are making.</p>", "parentCommentId": null, "user": {"username": "Peter Berggren"}}, {"_id": "3BHRWiuouRsz8Ei4o", "postedAt": "2023-09-25T17:32:18.938Z", "postId": "NfgMAS67nKTGzmQMB", "htmlBody": "<p>I've seen a lot of claims that \"x distracts from y\" come up as a request to stay on topic. Sometimes a group of people will be having a conversation about something (let's say AI ethics) and someone else will show up and start talking about something different (let's say AI safety). If they make a habit of this, it can make it really difficult to make any progress in your conversation (about AI ethics), and you might reasonably ask peoples to stop changing the subject</p>\n", "parentCommentId": null, "user": {"username": "Khorton"}}, {"_id": "kczJQPhLBx8mmXyNB", "postedAt": "2023-09-25T17:33:53.994Z", "postId": "NfgMAS67nKTGzmQMB", "htmlBody": "<p>I see it most often in online spaces, like the  comments of a forum or Facebook post, but I've seen it happen irl as well (for example, some women are discussing negative experiences related to being a woman and a man starts discussing another related topic before they've finished)</p>\n", "parentCommentId": "3BHRWiuouRsz8Ei4o", "user": {"username": "Khorton"}}, {"_id": "L2sP3imwiRYg553h3", "postedAt": "2023-09-25T17:41:02.011Z", "postId": "NfgMAS67nKTGzmQMB", "htmlBody": "<p>I'm not a big fan of the distraction argument, and I encourage cooperation between ethicists and x-riskers. However, I don't think you fully inhabited the mind of the x-risk skeptic here.&nbsp;</p><p>From their perspective, AI x-risk is <i>absurd</i>. They think it's all based on shoddy thinking and speculation by wacky internet people who are wrong about everything.&nbsp;</p><p>From your perspective, it's a matter of police corruption vs police incompetence.&nbsp;</p><p>from their perspective, it's a matter of police corruption vs police <i>demonic possession</i>.&nbsp;</p><p>Imagine if you're a police reformer who wakes up one day to see article after article worried that the police are being possessed by demons into doing bad things, and seeing a huge movement out there worried about the demon cops. You are then interviewed about whether you are concerned by the demonic possession in the police force.&nbsp;</p><p>I think the distraction argument is a natural response to this kind of situation. You want to be clear that you don't believe in demons at all, and that demonic cop possession is not a real problem, but also that police corruption is a real issue. Hence: \"demonic cop possession is a distraction from police corruption\". I think this is a defensible statement! It's certainly true about the interview itself, in that you want to talk about issues that are real, not ones that aren't.&nbsp;</p>", "parentCommentId": null, "user": {"username": "titotal"}}, {"_id": "h7qg93TyNGEWGqtCy", "postedAt": "2023-09-25T20:46:41.177Z", "postId": "NfgMAS67nKTGzmQMB", "htmlBody": "<p>Thanks for the comment!</p><p>I think we should imagine two scenarios, one where I see the demonic possession people as being “on my team” and the other where I see them as being “against my team”.</p><p>To elaborate, here’s yet another example: Concerned Climate Scientist Alice responding to statements by environmentalists of the Gaia / naturalness / hippy-type tradition. Alice probably thinks that a lot of their beliefs are utterly nuts. But it’s pretty plausible that she sees them as kinda “on her side” from a vibes perspective. (Hmm, actually, also imagine this is 20 years ago; I think there’s been something of a tribal split between pro-tech environmentalists and anti-tech environmentalists since then.) So probably Alice would probably make somewhat diplomatic statements, emphasizing areas of agreement, etc. Maybe she would say <i>“I think they have the right idea about deforestation and many other things, although I come at it from a more scientific perspective. I don’t think we should take the Gaia idea too literally. But anyway, everyone agrees that there’s an environmental crisis here…”</i> or something like that.</p><p>In your demon example, imagine someone saying <i>“I think it’s really great to see so many people questioning the narrative that the police are always perfect. I don’t think demonic possession is the problem, but y’know why so many people keep talking about demonic possession? It’s because they can see there’s a problem, and they’re angry, and they have every right to be angry because there is in fact a problem. And that problem is police corruption…”</i>.</p><p>So finally back to the AI example, I claim there’s a strong undercurrent of “The people talking about AI x-risk, they <i>suck</i>, those people are not on my team.” And if there <i>wasn’t </i>that undercurrent, I think most of the x-risk-doesn’t-exist people would have at worst mixed feelings about the x-risk discourse. Maybe they be vaguely happy that there are all these new anti-AI vibes going around, and they would try to redirect those vibes in the directions that they believe to be actually productive, as in the above examples: <i>“I think it’s really great to see people across society questioning the narrative that AI is always a force for good and tech companies are always a force for good. They’re absolutely right to question that narrative; that narrative is wrong and dangerous! Now, on this specific question, I don’t think future AI x-risk is anything to worry about, but let’s talk about AI companies stomping on copyright law…”</i></p><p>Very different vibe, right? Much less aggressive trashing of AI x-risk than what we actually see from some people.</p><p>To be clear, in a perfect world, people would ignore vibes and stay on-topic and at the object level, and Alice would just straightforwardly say “My opinion is that Gaia is pseudoscientific nonsense” instead of sanewashing it and immediately changing the subject, and ditto with the demon person and the other imaginary people above. I’m just saying what often happens in practice.</p><p>Back to your example, I think it’s far from obvious IMO that the number of articles about police corruption are going to go down <i>in absolute numbers</i>, although it obviously goes down <i>as a fraction of police articles</i>. It’s also far from obvious IMO that this situation will make it harder rather than easier to get anti-corruption laws passed, or to fundraise.</p>", "parentCommentId": "L2sP3imwiRYg553h3", "user": {"username": "steve2152"}}, {"_id": "FxnHEhrngYHRtYqTn", "postedAt": "2023-09-25T20:51:13.542Z", "postId": "NfgMAS67nKTGzmQMB", "htmlBody": "<p>That might be true in the very short term but I don’t believe it in general. For example, how many reporters were on the Ukraine beat before Russia invaded in February 2022? And how many reporters were on the Ukraine beat <i>after</i> Russia invaded? Probably a lot more, right?</p>", "parentCommentId": "nvhzeGJAXpXBW5azD", "user": {"username": "steve2152"}}, {"_id": "q6XYw2axzEEHRsbD5", "postedAt": "2023-09-26T01:49:45.303Z", "postId": "NfgMAS67nKTGzmQMB", "htmlBody": "<p>I think this comment describes a really important crux here- the mentality of AI safety being like <i>demonic possession</i> is a mentality that's one of the core tools in the toolbox of anyone trying to criticize AI safety in bad faith.</p><p>This is a routinely recurring dynamic, in public statements by celebrities like Mitchell, in the news, etc, and ignoring it because it's stupid, is to ignore a key gear in any information warfare battlespace (a defensive one in this case). They might be afraid to mention it outright, but it can still be between the lines a majority of the time, a dog whistle, etc.</p>", "parentCommentId": "L2sP3imwiRYg553h3", "user": {"username": "trevorw96"}}, {"_id": "nMnrdcGNtffZG7hFN", "postedAt": "2023-09-26T11:19:19.720Z", "postId": "NfgMAS67nKTGzmQMB", "htmlBody": "<p>Great reply! In fact, I think that the speech you wrote for the police reformer is probably the best way to advance the police corruption cause in that situation, with one change: they should be very clear that they don't think that demons exist.&nbsp;</p><p>I think there is an aspect where the AI risk skeptics don't want to be too closely associated with ideas they think are wrong: because if the AI x-riskers are<i> proven</i> to be wrong, they don't want to go down with the ship. IE: if another AI winter hits, or an AGI is built that shows no sign of killing anyone, then everyone who jumped on the x-risk train might look like fools, and they don't want to look like fools (for both personal and cause related reasons).&nbsp;</p><p>I think there definitely is an aspect of \"<i>AI x-risk people suck</i>\", but I worry that casting it as a team sports thing makes it seem overly irrational. When Timnit Gebru says that AI x-risk people suck, she's saying they are <i>net negative</i>: they do far more harm in promoting the incorrect x-risk idea and the actions they take (for example, helping start openAI) than they do incidental good in raising AI ethics awareness. You might think this belief is wrong, but the resulting actions make perfect sense, given this belief.&nbsp;</p><p>To modify the Gaia example, it'd be like if the Gaia people were trying to block all renewable energy building because it interrupted the chakras of the earth, and also loudly announcing that an earth spirit will become visible to the whole planet in 5 years. Yes, they are objectively increasing attention to your actual cause, but debunking them is still the correct move here. They've moved from on your team to not on your team because of objective object level disagreements over what beliefs are true and what actions should be taken.&nbsp;</p>", "parentCommentId": "h7qg93TyNGEWGqtCy", "user": {"username": "titotal"}}]