[{"_id": "H4yfkKsRqkL37GvBm", "postedAt": "2022-12-15T19:49:05.946Z", "postId": "NFhELFno7ScuCxXMY", "htmlBody": "<p>Thanks so much for this - I'm not sure I've heard of another organisation paying people to criticise them in a constructive way. This kind of thing should be positive media for Effective altruism but of course it won't get out there ;).&nbsp;</p><p>And most wholesome of all giving 20,000 to one of your biggest criticisers and even competitors. Amazing!</p>", "parentCommentId": null, "user": {"username": "NickLaing"}}, {"_id": "raEn56EQvMoznbPzn", "postedAt": "2022-12-15T21:47:55.955Z", "postId": "NFhELFno7ScuCxXMY", "htmlBody": "<p>Very curious to learn if first prize winning Paul Romer is Nobel Prize winning economist <a href=\"https://en.wikipedia.org/wiki/Paul_Romer\">Paul Romer</a></p>", "parentCommentId": null, "user": {"username": "DMMF"}}, {"_id": "ZqFp3MZxuw3jKfvdv", "postedAt": "2022-12-15T21:49:49.816Z", "postId": "NFhELFno7ScuCxXMY", "htmlBody": "<p>I'm glad this contest happened, but I was hoping to see some deeper reflection. To me it seems like the most concerning criticisms of the GiveWell approach are criticisms along more fundamental lines. Such as -</p><ol><li>It's more effective to focus on economic growth than one-off improvements to public health. In the long run no country has improved public health problems via a charitable model, but many have done it through economic growth.&nbsp;</li><li>NGOs in unstable or war-torn countries are enabling bad political actors. By funding public health in a dictatorship you are indirectly funding the dictator, who can reduce their own public health spending to counteract any benefit of NGO spending.</li></ol><p>This might be too much to expect from any self-reflection exercise, though.</p>", "parentCommentId": null, "user": {"username": "Kevin Lacker"}}, {"_id": "Mms6ckFrcFGBkiGDu", "postedAt": "2022-12-15T22:28:51.834Z", "postId": "NFhELFno7ScuCxXMY", "htmlBody": "<p>You might be interested in the response to a similar comment <a href=\"https://forum.effectivealtruism.org/posts/6wwK6Qduxt7mMmj8k/announcing-the-change-our-mind-contest-for-critiques-of-our?commentId=Zh7uwpXyxyLGQLa65#Zh7uwpXyxyLGQLa65\">here</a></p>\n", "parentCommentId": "ZqFp3MZxuw3jKfvdv", "user": {"username": "Lorenzo Buonanno"}}, {"_id": "NsZjt8qisRHmTDnPS", "postedAt": "2022-12-15T23:01:20.140Z", "postId": "NFhELFno7ScuCxXMY", "htmlBody": "<p>No relation!</p>\n", "parentCommentId": "raEn56EQvMoznbPzn", "user": {"username": "MHR"}}, {"_id": "drmEsaJqNLLSbfSpK", "postedAt": "2022-12-15T23:26:47.737Z", "postId": "NFhELFno7ScuCxXMY", "htmlBody": "<p>#2 would have been largely in scope, I think. GiveWell's analyses usually include an adjustment for estimated crowding out of other public health expenditures.</p>\n<p>#1 is more a cause-prioritization argument in my book. The basic contours of that argument are fairly clear and well-known; the added value would be in identifying a specific program that can be implemented within the money available to EA orgs for global health/development and running a convincing cost-benefit analysis on it. That's a much harder thing to model than GiveWell-type interventions and would need a lot more incentive/resources than $20K.</p>\n", "parentCommentId": "ZqFp3MZxuw3jKfvdv", "user": {"username": "Jason"}}, {"_id": "i5czTGB7kTFbJTk9q", "postedAt": "2022-12-16T05:56:17.054Z", "postId": "NFhELFno7ScuCxXMY", "htmlBody": "<p>Hey Kevin I do like those points and I think especially number 2 is worth a lot f consideration - not only in unstable and war torn countries but also in stable, stagnant countries like Uganda where I work. Jason's answer is also excellent.</p><p>Agree that number 2 is a very awkward situation, and working in health in a low income country myself I ask myself this all the time. The worst case scenario in terms of propping up a dictator though I think is funding them directly - which a LOT of government to government aid does. Fortunately against malaria foundation don't give a high proportion of money to evil dictatorships but they do give some. Same goes for deworm the world. <i>I think there should be some kind of small negative adjustment (even if token) from GiveWell on this front.</i></p><p>I find the \"economic growth\" argument a tricky one as my big issue here is tractability\". I'm not sure we know well at all how to actually stimulate economic growth consistently and well. There are a whole lot of theories but the solid empirical research base is very poor. I'd be VERY happy to fund economic growth if I had a moderate degree of certainty that the intervention would work.</p>", "parentCommentId": "ZqFp3MZxuw3jKfvdv", "user": {"username": "NickLaing"}}, {"_id": "2PjbssDGbpECxBAfD", "postedAt": "2022-12-16T17:46:03.128Z", "postId": "NFhELFno7ScuCxXMY", "htmlBody": "<blockquote><p>against malaria foundation don't give a high proportion of money to evil dictatorships but they do give some. Same goes for deworm the world.</p></blockquote><p>&nbsp;</p><p>I was wondering about this, because I was reading a book about the DRC - Dancing in the Glory of Monsters - which was broadly opposed to NGO activity in the country as propping up the regime. And I was trying to figure out how to square this criticism with the messages from the NGOs themselves. I am not really sure, though, because the pro-NGO side of the debate (like EA) and the anti-NGO side of the debate (like that book) seem to mostly be ignoring each other.</p><blockquote><p><i>I think there should be some kind of small negative adjustment (even if token) from GiveWell on this front.</i></p></blockquote><p>Yeah, I don't even know if it's the sort of thing that you can adjust for. It's kind of unmeasurable, right? Or maybe you can measure something like, the net QALYs of a particular country being a dictatorship instead of a democracy, and make an argument that supporting a dictator is less bad than the particular public health intervention is good.</p><p>I would at least like to see people from the EA NGO world engage with this line of criticism, from people who are concerned that \"the NGO system in poor countries, overall, is doing more unmeasurable harm than measurable good\".</p>", "parentCommentId": "i5czTGB7kTFbJTk9q", "user": {"username": "Kevin Lacker"}}, {"_id": "X5uhaBNRwWgxSc6os", "postedAt": "2022-12-16T18:21:38.314Z", "postId": "NFhELFno7ScuCxXMY", "htmlBody": "<p>The argument I've found most persuasive is \"it's easier to fight back against an unjust government if you're healthy/have more money\".</p>\n", "parentCommentId": "2PjbssDGbpECxBAfD", "user": {"username": "Khorton"}}, {"_id": "btaKAYimoh4kAySou", "postedAt": "2022-12-17T12:49:47.096Z", "postId": "NFhELFno7ScuCxXMY", "htmlBody": "<p>I definitely don't think it's too much to expect from a self-reflection exercise, and I'm sure they've considered these issues.&nbsp;<br><br>For no. 1, I wouldn't actually credit growth so much. Most of the rapid increases in life expectancy in poor countries over the last century have come from factors not directly related to economic growth (edit: growth in the countries themselves), including state capacity, access to new technology (vaccines), and support from international orgs/ NGOs. China pre- and post- 1978 seems like one clear example here- the most significant health improvements came before economic growth. &nbsp;Can you identify the 'growth miracles' vs. countries that barely grew over the last 20 years in the below graph?&nbsp;</p><figure class=\"image\"><img src=\"https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/8f8b2fe399c3c4c3c5762f6b5f400fd979b0e892cc069508.png\" srcset=\"https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/8f8b2fe399c3c4c3c5762f6b5f400fd979b0e892cc069508.png/w_340 340w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/8f8b2fe399c3c4c3c5762f6b5f400fd979b0e892cc069508.png/w_680 680w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/8f8b2fe399c3c4c3c5762f6b5f400fd979b0e892cc069508.png/w_1020 1020w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/8f8b2fe399c3c4c3c5762f6b5f400fd979b0e892cc069508.png/w_1360 1360w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/8f8b2fe399c3c4c3c5762f6b5f400fd979b0e892cc069508.png/w_1700 1700w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/8f8b2fe399c3c4c3c5762f6b5f400fd979b0e892cc069508.png/w_2040 2040w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/8f8b2fe399c3c4c3c5762f6b5f400fd979b0e892cc069508.png/w_2380 2380w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/8f8b2fe399c3c4c3c5762f6b5f400fd979b0e892cc069508.png/w_2720 2720w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/8f8b2fe399c3c4c3c5762f6b5f400fd979b0e892cc069508.png/w_3060 3060w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/8f8b2fe399c3c4c3c5762f6b5f400fd979b0e892cc069508.png/w_3400 3400w\"></figure><p>I'd also say that reliably improving growth (or state capacity) is considerably more difficult than reliably providing a limited slice of healthcare. Even if GiveWell had a more reliable theory of change for charitably-funded growth interventions, they probably aren't going to attract donations- donating to lobbying African governments to remove tariffs doesn't sound like an easy sell, even for an EA-aligned donor.&nbsp;<br><br>For 2, I think you're making two points- supporting dictators and crowding out domestic spending.&nbsp;</p><p>On the dictator front, there is a trade-off, but there are a few factors:&nbsp;</p><ul><li>I'm very confident that countries with very weak state capacity (Eritrea?) would not be providing noticeably better health care if there were fewer NGOs.&nbsp;</li><li>NGOs probably provide some minor legitimacy to dictators, but I doubt any of these regimes would be threatened by their departure, even if all NGOs simultaneously left (which isn't going to happen). So the marginal negative impact of increased legitimacy from a single NGO must be very small.&nbsp;</li></ul><p>On the 'crowding out' front, I don't have a good sense of the data, but I'd suspect that the issue might be worse in non-dictatorships- countries/ regions that are easier/ more desirable for western NGOs to set up shop, but where local authorities might provide semi-decent care in the absence of NGOs. This article illustrates <a href=\"https://insight.kellogg.northwestern.edu/article/international-aid-development-ngos-crowding-out-government\">some of the problems in rural Kenya and Uganda</a> (where I think there's a particularly high NGO-to-local people ratio).&nbsp;</p><p>I suspect GiveWell's response to this is that the GiveWell-supported charities target a very specific health problem- they may sometimes try to work with local healthcare providers to make both actors more effective, but, if they don't, the interventions should be so much more effective per marginal dollar than domestic healthcare spending that any crowding effect is more than canceled out. Many crowding problems are more macro than micro (affecting national policy), so the marginal impact of a new effective NGO on, say, a decision whether or not to increase healthcare spending, is probably minimal. When you've got major donors (UN, Gates) spending billions in your country, AMF spending a few extra million is unlikely to have a major effect. But I'm open to arguments here.&nbsp;</p>", "parentCommentId": "ZqFp3MZxuw3jKfvdv", "user": {"username": "Jack_S"}}]