[{"_id": "WEHM2iFfFnD6DQ3Fe", "postedAt": "2024-02-29T15:24:24.359Z", "postId": "NGFkW4Qxww9jGESrk", "htmlBody": "<p>This was great! Interesting to see the inter-expert disagreements laid out too</p>", "parentCommentId": null, "user": {"username": "BenStewart"}}, {"_id": "xadoBhWLHjsjKaWN3", "postedAt": "2024-02-29T20:36:26.806Z", "postId": "NGFkW4Qxww9jGESrk", "htmlBody": "<p><strong>Executive summary</strong>: Biosecurity experts identify misconceptions in the field, including overconfidence about predicting and preventing threats, underestimating bioweapons capabilities, and failing to engage productively with related research communities.</p><p><strong>Key points</strong>:</p><ol><li>Experts warn against narrow thinking based on past experience that hinders imagination and preparedness.</li><li>Some critique Western-centric views that downplay biosecurity differences between rich and poor countries.</li><li>Writing reports without real-world engagement is seen as an ineffective approach.</li><li>Overconfidence in threat models and deference to authority figures are cited as issues.</li><li>Prioritizing small over catastrophic risks and incremental over high-impact interventions are seen as mistakes.</li><li>Optimism about biology's promise may blind some to its misuse potential.</li><li>Getting governments to adopt biosecurity policies is considered challenging. Antagonizing expert communities is counterproductive.</li><li>Preparing for a catastrophic pandemic resembles readying for smaller ones.</li><li>Claims that AI will easily enable bioweaponeering are dubbed unrealistic sci-fi.</li><li>Contrary views challenge if bioweapons barriers are as high as commonly portrayed.</li></ol><p>&nbsp;</p><p>&nbsp;</p><p><i>This comment was auto-generated by the EA Forum Team. Feel free to point out issues with this summary by replying to the comment, and</i><a href=\"https://forum.effectivealtruism.org/contact\"><i>&nbsp;<u>contact us</u></i></a><i> if you have feedback.</i></p>", "parentCommentId": null, "user": {"username": "SummaryBot"}}, {"_id": "nrKjRmdAgHb3BCcTj", "postedAt": "2024-03-02T04:58:45.935Z", "postId": "NGFkW4Qxww9jGESrk", "htmlBody": "<p>Thanks for sharing!</p><p>Somewhat relatedly, readers may want to check the thoughts of participants in the Existential Risk Persuasion Tournament (<a href=\"https://static1.squarespace.com/static/635693acf15a3e2a14a56a4a/t/64f0a7838ccbf43b6b5ee40c/1693493128111/XPT.pdf\">XPT</a>) on the global catastrophic risk from engineered pathogens<span class=\"footnote-reference\" data-footnote-reference=\"\" data-footnote-index=\"1\" data-footnote-id=\"klgwo9l6nfr\" role=\"doc-noteref\" id=\"fnrefklgwo9l6nfr\"><sup><a href=\"#fnklgwo9l6nfr\">[1]</a></sup></span>&nbsp;(pp. 241 to 251), including:</p><ul><li>\"Sources of agreement, disagreement and uncertainty\".</li><li>\"Arguments given for forecasts ≤ 6.3%\".</li><li>\"Arguments given for forecasts ≥ 7.69%\".</li></ul><p>It is just worth having in mind:</p><blockquote><p>The sample drew heavily from the Effective Altruism (EA) community: about 42% of experts and 9% of superforecasters reported that they had attended an EA meetup. In this report, we separately present forecasts from domain experts and non-domain experts on each question.</p></blockquote><ol class=\"footnote-section footnotes\" data-footnote-section=\"\" role=\"doc-endnotes\"><li class=\"footnote-item\" data-footnote-item=\"\" data-footnote-index=\"1\" data-footnote-id=\"klgwo9l6nfr\" role=\"doc-endnote\" id=\"fnklgwo9l6nfr\"><span class=\"footnote-back-link\" data-footnote-back-link=\"\" data-footnote-id=\"klgwo9l6nfr\"><sup><strong><a href=\"#fnrefklgwo9l6nfr\">^</a></strong></sup></span><div class=\"footnote-content\" data-footnote-content=\"\"><p>\"Probability that a genetically-engineered pathogen will be the cause of death, within<br>a 5-year period, for more than 1% of humans alive at the beginning of that period\".</p></div></li></ol>", "parentCommentId": null, "user": {"username": "vascoamaralgrilo"}}]