[{"_id": "XdTLYD6fJhLbsh2AS", "postedAt": "2015-04-24T20:17:03.633Z", "postId": "NJ5XvxeF5e8tAuzFi", "htmlBody": "<p>Unless I'm missing something, it seems like we all should be giving to EA advocacy groups until the amount of resources available to those groups reaches the threshold at which the donation is no longer leveraged. What's the counter-argument? Has there been any analysis on what that threshold level is? In other words, if we take the total resources currently available to groups like Giving What We Can and The Life You Can Save, how many times those resources must we have before I should start donating to the Against Malaria Foundation?</p>\n", "parentCommentId": null, "user": {"username": "mhpage"}}, {"_id": "Ej35AELAwQbCpCS6f", "postedAt": "2015-04-24T20:24:17.626Z", "postId": "NJ5XvxeF5e8tAuzFi", "htmlBody": "<p>Hi Michelle, I'm afraid I'm a bit confused about the 2015 budget on page 17 in the prospectus. Your projected budget (excluding the 10% contingency) looks like $203,420, but when I add up all the non-contingency numbers I only get $135,122 (a discrepancy of $68,298). Have I missed an item or something?</p>\n", "parentCommentId": null, "user": {"username": "Ben_Kuhn"}}, {"_id": "D9GhbN4sZGgYee45X", "postedAt": "2015-04-24T21:35:02.869Z", "postId": "NJ5XvxeF5e8tAuzFi", "htmlBody": "<ul>\n<li><p>The point at which you hit diminishing returns to funding an org may actually be pretty low. I'd be skeptical about the marginal value of budget increases of much more than a factor of 2 per year unless the org had demonstrated <em>really</em> impressive traction.</p>\n</li>\n<li><p>There are also signaling issues with only donating to metacharities, so if you're public about your giving it might not be a great idea (&quot;guys, look at how much I donate to these organizations that promote donating to themselves!&quot;).</p>\n</li>\n<li><p>The error bars around these estimates are <em>extremely</em> high. The confidence interval for GWWC's leverage ratio plausibly already includes numbers below 1 (in addition to numbers above 300). For instance, this is one reason GiveWell doesn't recommend any metacharities--which, IIRC, someone said at one point that they would if they could find one with a robust enough case for impact. Donors with preferences similar to GiveWell's may reject metacharities entirely for that reason.</p>\n</li>\n</ul>\n<p>(Disclosure: I donate mostly to metacharities...)</p>\n", "parentCommentId": "XdTLYD6fJhLbsh2AS", "user": {"username": "Ben_Kuhn"}}, {"_id": "NbQ6vcWRzEZDvARGn", "postedAt": "2015-04-25T02:04:42.326Z", "postId": "NJ5XvxeF5e8tAuzFi", "htmlBody": "<p>Hi Michelle, congrats on undertaking such an impact.  I always love it when people look critically at themselves.  I also have to say that I'm amazed at how beautiful a lot of the visuals are!  I love the graphic with the money ratio and I found the downloadable spreadsheet where I can put my own numbers in very useful and very well formatted.  Thanks for going above and beyond to provide that.  The Fundraising Prospectus also has a crisp layout, great pictures, and does a good job of going into more detail.</p>\n<p>One question I had, though, was it seemed like this current assessment focused a lot on what Giving What We Can has done throughout time to date to get members.  However, GWWC has expanded a lot in the past year, and the budget represents holding that expansion and continuing to expand.  Has GWWC done any sort of assessment to track the impact of the expansion funding <strong>on the margin</strong>?  I'd be concerned that it might be lower than the overall figure for all funding.</p>\n", "parentCommentId": null, "user": {"username": "Peter_Hurford"}}, {"_id": "E7yfRmg8uaPfz7u6J", "postedAt": "2015-04-25T13:00:33.592Z", "postId": "NJ5XvxeF5e8tAuzFi", "htmlBody": "<p>Thanks very much Peter! I'm really glad you've found it useful. Rob had just the same reaction, so he did a calculation on the margin - you can find it on p28 of the Fundraising Prospectus. Interestingly, the impact on the margin actually seemed higher than overall - it seems like there are some economies of scale now that we have enough people on the team to specialise, and we've been at it a bit longer so have more of an idea what we're doing. </p>\n", "parentCommentId": "NbQ6vcWRzEZDvARGn", "user": {"username": "Michelle_Hutchinson"}}, {"_id": "ayfzASBsLgShpPtyi", "postedAt": "2015-04-25T13:14:06.090Z", "postId": "NJ5XvxeF5e8tAuzFi", "htmlBody": "<p>You're quite right. I'm so sorry, I accidentally put in 6 months for half of it and then a year for the rest. We'll fix it. The correct figures are: Employees/interns £123,452; Communications and chapters £7,660; Administration £15,123; Research £3,200. I apologise, I don't know how I could have made such a blunder. By the way, the figures in the budget are all in £s. (Sorry about the difference with the impact evaluation, which is in $s.)</p>\n", "parentCommentId": "Ej35AELAwQbCpCS6f", "user": {"username": "Michelle_Hutchinson"}}, {"_id": "KirQLFvCo5TvLj7nS", "postedAt": "2015-04-26T10:04:27.913Z", "postId": "NJ5XvxeF5e8tAuzFi", "htmlBody": "<p>This looks brilliant Michelle!</p>\n<p>So pleased with the growth of the group and everything looks so professional.</p>\n<p>Just donated £100 (a decent chunk of my donations as a student)</p>\n", "parentCommentId": null, "user": {"username": "Amanda_Jane"}}, {"_id": "ABraqTqyzib4oQ9Et", "postedAt": "2015-04-26T17:41:31.886Z", "postId": "NJ5XvxeF5e8tAuzFi", "htmlBody": "<p>Thank you very much! I'm glad you're happy with how it's going, and the information we've provided.</p>\n", "parentCommentId": "KirQLFvCo5TvLj7nS", "user": {"username": "Michelle_Hutchinson"}}, {"_id": "x2YLewXZBoxmkm3ck", "postedAt": "2015-04-27T13:44:32.066Z", "postId": "NJ5XvxeF5e8tAuzFi", "htmlBody": "<p>Hi Ben - good pickup. I've uploaded the latest version of the prospectus with the amended numbers <a href=\"https://givingwhatwecan.org/fundraising-prospectus-2015\">here</a></p>\n", "parentCommentId": "Ej35AELAwQbCpCS6f", "user": {"username": "SamDeere"}}, {"_id": "srANojv7AEeXq9nvz", "postedAt": "2015-04-27T18:35:41.115Z", "postId": "NJ5XvxeF5e8tAuzFi", "htmlBody": "<blockquote>\n<p>The point at which you hit diminishing returns to funding an org may actually be pretty low. I'd be skeptical about the marginal value of budget increases of much more than a factor of 2 per year unless the org had demonstrated really impressive traction.</p>\n</blockquote>\n<p>This isn't incompatible with what you're saying, but they may diminish well before that also. Taking the present example of Giving What We Can, the people who worked there or are involved with it thought that applied to it. They thought most of the value came from the existence of the organisation and a pledge people could sign if they wanted to commit to giving 10%, and other things which were done even before they started paying staff. So that would be diminish returns right at the $ 0 mark!</p>\n<blockquote>\n<p>There are also signaling issues with only donating to metacharities, so if you're public about your giving it might not be a great idea (&quot;guys, look at how much I donate to these organizations that promote donating to themselves!&quot;).</p>\n</blockquote>\n<p>There are even less positive ways to frame that also, like giving to one another, and having organisations which heavily focus on promoting themselves (including by promoting the idea of metacharity, and making it a central concept in the movement). Even aside from signalling, we should see others' discomfort with that as a reason to be wary of it ourselves.</p>\n<blockquote>\n<p>The confidence interval for GWWC's leverage ratio plausibly already includes numbers below 1</p>\n</blockquote>\n<p>This is what those people I talked to from GWWC thought, due to their various experiences and observations. And GiveWell too as you say; they had had conversations with people at GiveWell who thought that GWWC's future fundraising ratio was below 1.</p>\n", "parentCommentId": "D9GhbN4sZGgYee45X", "user": {"username": "impala"}}, {"_id": "aKHmKmJS4JYzMSrem", "postedAt": "2015-04-27T19:09:14.172Z", "postId": "NJ5XvxeF5e8tAuzFi", "htmlBody": "<p>Doesn't every organization/social movement that efficiently allocates resources have diminishing returns beginning with the first dollar? One reason why this could theoretically not be true is if efficient use of capital requires upfront investment in infrastructure, but I don't know if that applies here. The concept of diminishing returns seems distinct from leverage (though obviously not unrelated).</p>\n<p>The signalling issue is complicated, and I'm open to suggestions. As I'm a consequentialist, I'm open simply to lying.</p>\n", "parentCommentId": "srANojv7AEeXq9nvz", "user": {"username": "mhpage"}}, {"_id": "eCXzKjjYRRhgW4jt9", "postedAt": "2015-04-27T19:58:22.711Z", "postId": "NJ5XvxeF5e8tAuzFi", "htmlBody": "<blockquote>\n<p>Doesn't every organization/social movement that efficiently allocates resources have diminishing returns beginning with the first dollar? </p>\n</blockquote>\n<p>That will be the case very often, except in cases like that which you have mentioned. In these comments Michelle Hutchinson came up with a few other possibilities, like economies of scale.</p>\n<blockquote>\n<p>The signalling issue is complicated, and I'm open to suggestions. As I'm a consequentialist, I'm open simply to lying.</p>\n</blockquote>\n<p>This wouldn't address the non-signalling concern that I raised though (as I'm sure you're aware of course).</p>\n", "parentCommentId": "aKHmKmJS4JYzMSrem", "user": {"username": "impala"}}, {"_id": "qdQTrT45tCu7efcmk", "postedAt": "2015-04-27T19:59:06.179Z", "postId": "NJ5XvxeF5e8tAuzFi", "htmlBody": "<p>duplicate comment</p>\n", "parentCommentId": "aKHmKmJS4JYzMSrem", "user": {"username": "impala"}}, {"_id": "mWoyWhWZmvuRpTTFQ", "postedAt": "2015-04-28T01:33:27.832Z", "postId": "NJ5XvxeF5e8tAuzFi", "htmlBody": "<p>Hey, thanks for putting this out! Very attractive prospectus. I like the clear presentation of all the data in the appendices. </p>\n<p>One question:</p>\n<p>Historically, one concern people have had with GWWC is that its finances are mixed up with CEA, which has many other projects. As such, it's hard to be sure that our donations would actually benefit GWWC, as opposed to funding other projects that CEA wishes to support. CEA could reduce the amount of unrestricted funding it gives GWWC, thereby in effect diverting the donations away from GWWC. This seems like it would be pretty easy to do - CEA could simply alter the allocation of shared costs, if nothing else, or borrow GWWC staff. What sort of guarantees can you offer donors that their funding will actually benefit GWWC, <em>even if CEA would prefer it to be allocated elsewhere?</em></p>\n", "parentCommentId": null, "user": {"username": "Larks"}}, {"_id": "Y7oEtWmvX353qAvnX", "postedAt": "2015-04-28T03:34:36.866Z", "postId": "NJ5XvxeF5e8tAuzFi", "htmlBody": "<p>&quot; hits diminishing returns&quot; is usually used as a shorthand for &quot;investment in  hits the point where returns have diminished enough that additional investment is no longer optimal.&quot;</p>\n", "parentCommentId": "aKHmKmJS4JYzMSrem", "user": {"username": "Ben_Kuhn"}}, {"_id": "7Qf3nxBq4DGrhmP3d", "postedAt": "2015-04-28T06:03:17.440Z", "postId": "NJ5XvxeF5e8tAuzFi", "htmlBody": "<p>Thanks for posting this here, and congrats on your great growth so far! I got a chance to read the prospectus more thoroughly and now I have some other questions about GWWC's activities:</p>\n<ul>\n<li><p>How was staff time allocated between projects over the past year? How do you anticipate allocating it next year? If you didn't raise as much funds as you wanted, which projects would get cut first?</p>\n</li>\n<li><p>Just to check that I understand the numbers properly, your actual cash spent in 2014 was £120,000 and your actual cash spent in 2015 is expected to be £220,000, correct? How was the budget divided up last year? What's the source of the increase? If it's more staff, what will they be doing? Your description of planned operations for 2015 only included one statement of intent to hire someone (and one recent hire who presumably will cost more next year as they're employed for the full year), so it's hard to figure out exactly where capacity/expenses are being added here.</p>\n</li>\n<li><p>Why does GWWC continue to do charity evaluation research? This seems to have very high overlap with GiveWell's operations, while GiveWell has a much larger staff, more organizational focus on it, and moves more money to their recommendations. Obviously GWWC and GiveWell's recommendations differ somewhat, but is it really worth maintaining a separate research team and splitting the focus of GWWC between outreach and research?</p>\n</li>\n<li><p>Which of the people on the &quot;our team&quot; page is paid by GWWC and how much time do the team members spend on it? Presumably Toby Ord and Andreas Morgensen do not work full time on GWWC if they're both professors, and Luke Ilott hasn't started yet; does that mean that GWWC is five full-time people right now?</p>\n</li>\n<li><p>I notice that you budgeted for volunteer interns as if you were paying them a standard hourly rate, which is great. However, I also notice that a lot of your growth strategy for next year involves <a href=\"http://effective-altruism.com/ea/h3/new_volunteerdriven_chapter_growth_strategy/\">leveraging local volunteers</a> who aren't employed by GWWC per se. What would your estimated budget be like if these people's time was also included? And what is the reasoning behind omitting it?</p>\n</li>\n<li><p>Out of curiosity, is there a timeline of how many full-time equivalent people were working at GWWC at any one time? It would be interesting to compare that to the growth data (which, by the way, it's super awesome that you make available!)</p>\n</li>\n</ul>\n<p>Thanks again for answering everyone's questions! I'm sure you're probably tired of fielding them by now, but I really appreciate that we get to have these conversations publicly when EA orgs fundraise!</p>\n", "parentCommentId": null, "user": {"username": "Ben_Kuhn"}}, {"_id": "y6K7pzfTCaLMEBaSA", "postedAt": "2015-04-28T12:15:01.655Z", "postId": "NJ5XvxeF5e8tAuzFi", "htmlBody": "<p>&quot;Why does GWWC continue to do charity evaluation research?&quot;</p>\n<p>I think it could be useful to have more than one organisation evaluating interventions, rather than having all our eggs in one basket. That doesn't mean it should be GWWC but I'm happy for there to be overlap, it will add verification to GiveWell's recommendations as well as potentially uncovering new ones.</p>\n", "parentCommentId": "7Qf3nxBq4DGrhmP3d", "user": {"username": "DavidNash"}}, {"_id": "tvnDKoBHYmaCMv9e3", "postedAt": "2015-04-28T15:00:15.842Z", "postId": "NJ5XvxeF5e8tAuzFi", "htmlBody": "<p>Hi Lark - until this year this hasn't been an issue. In the past unrestricted funds have been committed to projects ahead of time either as a fixed share of the total, or in proportion to restricted funding (which actually provides a sort of 'matching' of restricted donations).</p>\n<p>This year unrestricted funds are going into a 'Trustees' Discretionary Fund'. This fund:</p>\n<ol>\n<li>Can be used to ‘bail out’ projects in emergencies, though ideally it won’t be;</li>\n<li>To kickstart new experiments with e.g. a six month runway;</li>\n<li>To make grants to external and internal projects we think are awesome.</li>\n</ol>\n<p>So it is possible that giving to GWWC will make it less likely that GWWC will draw money out of this TDF. However, I think it's fairly unlikely that GWWC will be so starved for cash that we will take that option; it's more likely that we would have 1 or 2 fewer staff than pull money out of the TDF. I also think that making sure CEA has money for new projects and grants is quite valuable. However if you thought i) GWWC was the only useful thing we were doing and ii) you thought GWWC's fundraising was likely to go very badly, then the issue you describe would be a consideration against giving.</p>\n", "parentCommentId": "mWoyWhWZmvuRpTTFQ", "user": {"username": "Robert_Wiblin"}}, {"_id": "phgfKe4vYCjREKwer", "postedAt": "2015-04-28T15:03:48.174Z", "postId": "NJ5XvxeF5e8tAuzFi", "htmlBody": "<p>Hi Peter I would be interested to hear your reaction to my section on the value of marginal funding, and whether you can think of any other clever ways to infer it.</p>\n<p>The main uncertainty in my mind is figuring out how long people will continue to give. While we have five years of data - and three years of higher quality data since we stopped relying just on volunteers - that isn't enough to pin down the loss rate of members very well. We also only have one year of data since online-only sign-ups become easy, so we can't yet determine the impact that will have.</p>\n", "parentCommentId": "E7yfRmg8uaPfz7u6J", "user": {"username": "Robert_Wiblin"}}, {"_id": "x8fghfn85wdLjY3xy", "postedAt": "2015-04-30T06:28:56.008Z", "postId": "NJ5XvxeF5e8tAuzFi", "htmlBody": "<p>It is true that redundancy typically adds resilience to complex systems. But how much is this added resilience worth if you try to put a dollar amount on it? I think that what GWWC is doing overall is great, but I concur with Ben, it is a bit unclear at the moment what value GWWC adds <em>in this regard</em>.</p>\n", "parentCommentId": "y6K7pzfTCaLMEBaSA", "user": {"username": "GabrielEhrnstGrundin"}}, {"_id": "cjaG69kCbua9NDEd6", "postedAt": "2015-04-30T23:41:59.154Z", "postId": "NJ5XvxeF5e8tAuzFi", "htmlBody": "<p>Michelle or Hauke can add more, but part of the answer is that being across the best research out there is crucial to our outreach.</p>\n<p>People are willing to take our recommendations seriously because we show that we understand why these charities are excellent and are keeping tabs on them. We also need to be able to explain how these cost effectiveness estimates are arrived at, and generally say other smart things to be taken seriously. That isn't possible without someone working almost full time understanding the research that GiveWell and others are producing.</p>\n<p>As a result, even if the research had no value in discovering new knowledge (which isn't true of course) and we were only focussed on outreach, we would probably want to have a researcher on our team (especially as we now have six people working on GWWC so can afford some specialisation).</p>\n<p>Of course Hauke is actually turning up new points and looking into approaches for reducing poverty that we haven't looked at properly before and should be able to say something intelligent about.</p>\n", "parentCommentId": "x8fghfn85wdLjY3xy", "user": {"username": "Robert_Wiblin"}}, {"_id": "F3Qe299Ewe9GwZK4a", "postedAt": "2015-04-30T23:59:04.334Z", "postId": "NJ5XvxeF5e8tAuzFi", "htmlBody": "<p>Hi Ben, thanks for these questions. I'll just field those that I'm well placed to answer.</p>\n<p>&quot;Which of the people on the &quot;our team&quot; page is paid by GWWC and how much time do the team members spend on it? Presumably Toby Ord and Andreas Morgensen do not work full time on GWWC if they're both professors, and Luke Ilott hasn't started yet; does that mean that GWWC is five full-time people right now?&quot;</p>\n<p>Toby and Andreas don't receive any income from GWWC and indeed are more part-time advisors than staff, though very valuable ones. You are right that Luke hasn't started yet, so there are five staff: Michelle, Jon, Alison, and the recent recruits Hauke and Sam.</p>\n<p>&quot;Out of curiosity, is there a timeline of how many full-time equivalent people were working at GWWC at any one time? It would be interesting to compare that to the growth data (which, by the way, it's super awesome that you make available!)&quot;</p>\n<p>Hmmm, I don't think we have a close record easily accessible, but going from my memory and averaging over people coming and going month-to-month:</p>\n<p>Mid 2012- mid 2013 - 2 staff</p>\n<p>Mid 2013- mid 2014 - 3 staff</p>\n<p>Late 2014 - still 3 staff</p>\n<p>2015 - Have gone from 3 to 5 staff</p>\n<p>Late 2015 - 6 staff</p>\n<p>GWWC, being an outreach organisation, has historically had a lot of interns and volunteers staying for 1-10 months. However, it would take me some time to get averages for those (because the lengths of stay and amounts of work are so irregular)! If anything that has been stable or somewhat decreasing over the last 3 years.</p>\n<p>&quot;I notice that you budgeted for volunteer interns as if you were paying them a standard hourly rate, which is great. However, I also notice that a lot of your growth strategy for next year involves leveraging local volunteers who aren't employed by GWWC per se. What would your estimated budget be like if these people's time was also included? And what is the reasoning behind omitting it?&quot;</p>\n<p>We reimburse interns (some) of their living expenses when they are here if they need it. As a result it actually costs money. Volunteers or interns working in chapters around the world don't get paid anything by us (or if they are, only very rarely). So there is no direct financial cost. In most cases we don't think those volunteers would be doing something similar to Giving What We Can (like say, earning a lot of money to donate) if they weren't on campuses encouraging people to give to effective charities, so we haven't counted it as having a significant opportunity cost that would interest donors.</p>\n<p>&quot;Why does GWWC continue to do charity evaluation research? This seems to have very high overlap with GiveWell's operations, while GiveWell has a much larger staff, more organizational focus on it, and moves more money to their recommendations. Obviously GWWC and GiveWell's recommendations differ somewhat, but is it really worth maintaining a separate research team and splitting the focus of GWWC between outreach and research?&quot;</p>\n<p>I've given one possible answer to this in the thread below.</p>\n<p>&quot;Just to check that I understand the numbers properly, your actual cash spent in 2014 was £120,000 and your actual cash spent in 2015 is expected to be £220,000, correct? How was the budget divided up last year? &quot;</p>\n<p>That's roughly right, yes.</p>\n<p>&quot;How was the budget divided up last year?&quot;</p>\n<p>I haven't done that breakdown for 2014 yet, but it will be very similar to 2013, which was 80-85% salaries and intern expenses support, 10% office rent, and 5-10% materials.</p>\n<p>&quot;What's the source of the increase?&quot;</p>\n<p>It's overwhelmingly new staff. Salaries/office rent has also increased about 10% in the last year (reflecting inflation and older/more experienced hires).</p>\n<p>&quot;If it's more staff, what will they be doing?&quot;</p>\n<p>I'll leave this one for Michelle as she can give the clearest answer.</p>\n<p>&quot;If you didn't raise as much funds as you wanted, which projects would get cut first?&quot;</p>\n<p>We would have to have one less staff member, very likely cutting back our media, talk and support for chapters. Again I'll leave Michelle to give a more precise answer.</p>\n", "parentCommentId": "7Qf3nxBq4DGrhmP3d", "user": {"username": "Robert_Wiblin"}}, {"_id": "Sfp9YuwZL5SbXePyx", "postedAt": "2015-05-01T07:40:24.502Z", "postId": "NJ5XvxeF5e8tAuzFi", "htmlBody": "<p>Thanks Rob!</p>\n<blockquote>\n<p>Toby and Andreas don't receive any income from GWWC and indeed are more part-time advisors than staff, though very valuable ones.</p>\n</blockquote>\n<p>Cool. I think it would have been less confusing if the prospectus had explicitly noted this, since I only realized it because I read the bios closely and know some of what Toby has been up to.</p>\n<blockquote>\n<p>We would have to have one less staff member, very likely cutting back our media, talk and support for chapters. Again I'll leave Michelle to give a more precise answer.</p>\n</blockquote>\n<p>Can you give any more detail about what these operations looked like last year and what they accomplished? I can't find very much information about that in the prospectus.</p>\n", "parentCommentId": "F3Qe299Ewe9GwZK4a", "user": {"username": "Ben_Kuhn"}}, {"_id": "6A5dxB7vC8WCMCe8X", "postedAt": "2015-05-01T10:31:50.095Z", "postId": "NJ5XvxeF5e8tAuzFi", "htmlBody": "<p>Thanks everyone for your interesting in GWWC research.</p>\n<p>The purpose of GWWC doing research is fourfold:</p>\n<ol>\n<li>Find very effective charities/interventions and add to Givewell’s research. \nIn the past we might have influenced Givewell’s recommendations - see: <a href=\"https://drive.google.com/file/d/0B-ky1zIxhwx_aUZiY3ZfOWplTXd2ODF5aEt2aUJOU2dKWTFV/view?usp=sharing\">https://drive.google.com/file/d/0B-ky1zIxhwx_aUZiY3ZfOWplTXd2ODF5aEt2aUJOU2dKWTFV/view?usp=sharing</a>\nOur niche is to specialize on global poverty charities / interventions and we hope to continue to add to the knowledge base in this area. For instance, this means that we likely will not do much in-depth research on Marijuana legalization in Vermont. We also focus more on intervention effectiveness than operations and the financials of charities (even though we do shallow investigations on this). Givewell now has 18 Full-time staff (and is expanding), but many work on the Open Philanthropy project and not that many on their top charities. There are still relatively few independent evaluators in world working on the intersection of effectiveness under ideal trial conditions (efﬁcacy) and the effectiveness under large-scale programme conditions (effectiveness), and so I think it’s good to have more people working on this.</li>\n<li>It’s also good to have some independent evaluation and peer-review of Givewell's research, even in the case of highly transparent organisations such as Givewell</li>\n<li>Provide supervision for global poverty / effectiveness research projects to highly motivated students, in order to deeply involve them with EA.</li>\n<li>Finally, if we want to scale and grow roughly exponentially to eventually consistently move many millions to effective charities every year, it’s important to have in-house expertise to inform and fact-check our outreach and marketing, and make us credible when recommending charities to our members.</li>\n</ol>\n", "parentCommentId": "x8fghfn85wdLjY3xy", "user": {"username": "HaukeHillebrandt"}}, {"_id": "qLm76t7vr2pBsGTNA", "postedAt": "2015-05-01T10:33:31.812Z", "postId": "NJ5XvxeF5e8tAuzFi", "htmlBody": "<p>Thanks everyone for your interesting in GWWC research.</p>\n<p>The purpose of GWWC doing research is fourfold:</p>\n<ol>\n<li>Find very effective charities/interventions and add to Givewell’s research.\nIn the past we might have influenced Givewell’s recommendations - see: <a href=\"https://drive.google.com/file/d/0B-ky1zIxhwx_aUZiY3ZfOWplTXd2ODF5aEt2aUJOU2dKWTFV/view?usp=sharing\">https://drive.google.com/file/d/0B-ky1zIxhwx_aUZiY3ZfOWplTXd2ODF5aEt2aUJOU2dKWTFV/view?usp=sharing</a>\nOur niche is to specialize on global poverty charities / interventions and we hope to continue to add to the knowledge base in this area. For instance, this means that we likely will not do much in-depth research on Marijuana legalization in Vermont. We also focus more on intervention effectiveness than operations and the financials of charities (even though we do shallow investigations on this). Givewell now has 18 Full-time staff (and is expanding), but many work on the Open Philanthropy project and not that many on their top charities. There are still relatively few independent evaluators in world working on the intersection of effectiveness under ideal trial conditions (efﬁcacy) and the effectiveness under large-scale programme conditions (effectiveness), and so I think it’s good to have more people working on this.</li>\n<li>It’s also good to have some independent evaluation and peer-review of Givewell's research, even in the case of highly transparent organisations such as Givewell</li>\n<li>Provide supervision for global poverty / effectiveness research projects to highly motivated students, in order to deeply involve them with EA.</li>\n<li>Finally, if we want to scale and grow roughly exponentially to eventually consistently move many millions to effective charities every year, it’s important to have in-house expertise to inform and fact-check our outreach and marketing, and make us credible when recommending charities to our members.</li>\n</ol>\n", "parentCommentId": "7Qf3nxBq4DGrhmP3d", "user": {"username": "HaukeHillebrandt"}}, {"_id": "TSKzFtXG5PBZDpMFf", "postedAt": "2015-05-01T15:14:37.246Z", "postId": "NJ5XvxeF5e8tAuzFi", "htmlBody": "<p>Hi Hauke, thanks for answering! I'm going to split up sub-questions into multiple comments so the threads don't get too tangled.</p>\n<blockquote>\n<p>Our niche is to specialize on global poverty charities / interventions and we hope to continue to add to the knowledge base in this area. For instance, this means that we likely will not do much in-depth research on Marijuana legalization in Vermont. ... Givewell now has 18 Full-time staff (and is expanding), but many work on the Open Philanthropy project and not that many on their top charities.</p>\n</blockquote>\n<p>It sounds like you think GiveWell isn't very focused on global poverty charities, but that's not true. Compared to GWWC, they devote both a larger absolute number of staff, and a larger fraction of their staff, to researching global poverty charities (they attribute about half of their costs to their traditional work <a href=\"http://blog.givewell.org/2015/03/04/2014-progress-on-givewells-traditional-top-charities-work/\">here</a>, which implies ~9 full-time-equivalent people working on the traditional work.)</p>\n", "parentCommentId": "qLm76t7vr2pBsGTNA", "user": {"username": "Ben_Kuhn"}}, {"_id": "zT3CpvCppESp5j6NL", "postedAt": "2015-05-01T15:22:46.467Z", "postId": "NJ5XvxeF5e8tAuzFi", "htmlBody": "<blockquote>\n<p>It’s also good to have some independent evaluation and peer-review of Givewell's research, even in the case of highly transparent organisations such as Givewell</p>\n</blockquote>\n<p>In the past, where has this led? Has your peer review uncovered any errors GiveWell has made? Or has it been more conceptual disagreements like <a href=\"https://www.givingwhatwecan.org/blog/2012-11-30/givewell%E2%80%99s-recommendation-of-givedirectly\">the one over GiveDirectly</a>?</p>\n", "parentCommentId": "qLm76t7vr2pBsGTNA", "user": {"username": "Ben_Kuhn"}}, {"_id": "fBX7KJACrdCoCBXk2", "postedAt": "2015-05-01T15:25:35.667Z", "postId": "NJ5XvxeF5e8tAuzFi", "htmlBody": "<blockquote>\n<p>Provide supervision for global poverty / effectiveness research projects to highly motivated students, in order to deeply involve them with EA.</p>\n</blockquote>\n<p>Cool, I hadn't thought about this one. What's the scope of this? How many students do you typically have working on the research? What's a typical student project?</p>\n", "parentCommentId": "qLm76t7vr2pBsGTNA", "user": {"username": "Ben_Kuhn"}}, {"_id": "Y3eh5eedWpkCMaXq3", "postedAt": "2015-05-01T15:57:50.285Z", "postId": "NJ5XvxeF5e8tAuzFi", "htmlBody": "<p>This year we'll have 3 summer interns for GWWC coming for 2-3 months and potentially a bit longer. Two of them will likely be substantially involved in research. I think this is somewhat representative of a typical GWWC summer internship cohort (Michelle might be able to add to this?). \nWe also have students from the UK doing research projects with us part-time. Some are at Oxford and come in to talk in person and some we talk to over skype. I estimate that I have about 2-3 hours of meetings with them a week and then spend some time to give feedback on their research (or sometimes on their essays). We're currently trying to scale this up and get more volunteers. </p>\n<p>Here's a recent report from one of our student volunteers Max on TB (which is still in manuscript form and is not published yet):</p>\n<p><a href=\"https://docs.google.com/document/d/1lEy4PuJHWVD0JQufb8FPyYm1bN5JYAiA6Ivoko5ROGY/edit?usp=sharing\">https://docs.google.com/document/d/1lEy4PuJHWVD0JQufb8FPyYm1bN5JYAiA6Ivoko5ROGY/edit?usp=sharing</a></p>\n<p>you can find more of our students writing on our blog:</p>\n<p><a href=\"https://www.givingwhatwecan.org/blog\">https://www.givingwhatwecan.org/blog</a></p>\n", "parentCommentId": "fBX7KJACrdCoCBXk2", "user": {"username": "HaukeHillebrandt"}}, {"_id": "CgSsWb2qFh4N9NcS7", "postedAt": "2015-05-01T16:17:23.792Z", "postId": "NJ5XvxeF5e8tAuzFi", "htmlBody": "<p>When we report on our recommended charities such as the Against Malaria Foundation, we try to add to what Givewell has already researched and believe that they'll hopefully take this into account in their future reports. For instance, here's our new report on AMF:</p>\n<p><a href=\"https://drive.google.com/file/d/0B-ky1zIxhwx_QVBBb3ZuaVR5dEU/view?usp=sharing\">https://drive.google.com/file/d/0B-ky1zIxhwx_QVBBb3ZuaVR5dEU/view?usp=sharing</a></p>\n<p>a lot of the research cited in this report has not been taken into account by Givewell I believe.</p>\n<p>Also look at our recent report on SCI here:</p>\n<p><a href=\"https://www.givingwhatwecan.org/blog/2015-03-31/charity-update-ii-schistosomiasis-control-initiative-sci\">https://www.givingwhatwecan.org/blog/2015-03-31/charity-update-ii-schistosomiasis-control-initiative-sci</a></p>\n<p>where we cite research that hasn't been taken into account by Givewell as of yet.</p>\n<p>We're also in contact with Givewell about their reports when we uncover errors (conceptual and factual). So far I've only had one email conversation with Givewell's Jake Marcus about what I perceived as a misinterpretation about the decline in worm burden with age - but we ended up agreeing that we have different interpretation of the statistics. </p>\n", "parentCommentId": "zT3CpvCppESp5j6NL", "user": {"username": "HaukeHillebrandt"}}, {"_id": "ArBrNhs4KqLsHbLZE", "postedAt": "2015-05-01T16:26:12.021Z", "postId": "NJ5XvxeF5e8tAuzFi", "htmlBody": "<p>Oh sorry, I think I was not clear enough on this issue. I absolutely agree with you. Givewell is quite focused on global poverty issues. I do think that Givewell spends significantly more resources on research than we do. But as you said it's only ~9 full-time staff instead of 18 full time staff as one might think just looking at the staff page.</p>\n", "parentCommentId": "TSKzFtXG5PBZDpMFf", "user": {"username": "HaukeHillebrandt"}}, {"_id": "MmeYrXfuvTB47ostX", "postedAt": "2015-05-05T02:21:43.755Z", "postId": "NJ5XvxeF5e8tAuzFi", "htmlBody": "<p>Thanks for your questions – great to know what people would like to hear more about.\nHauke and Rob have very kindly already answered most of the questions – the main thing left as far as I can see is what our activities have been over 2014 and what they will be over 2015. I’ll give a very brief summary, mostly for others who were also wondering, since I sent you our reviews and plans which have more detail in. </p>\n<p>For most of 2014 we had one full-time person on Communications (Steph Crampin, who was staff) and one on Community (Ben Clifford (intern), followed by Lloyd Chapman (intern) and then Jon (staff)). Steph’s main focus for the first half of the year was a major overhaul of the website, aiming to update its look and feel, make it easier to navigate and use, cut down a bunch of our admin by automating a lot of the pledging process, and make individual dashboards for people to make it easier for members to let us know about their donations. In the second half of the year she was more focused on the September internship and running events. The idea behind the events strategy was to work out the best ways to run events, aiming to then scale those through our chapters. Ben and Jon worked on inducting new members and administration linked to that (more so early on in the year, before the website changes), ran our chapters and did individual outreach and follow-up – encouraging people who had had some contact with effective altruism to join GWWC. We planned to hire a staff member to be our community director over the year (hence Jon), because the turn-over of interns meant loss of information, and in particular of relationships with members and chapters (although each individually did a very good job!). Over this period, we didn’t have a full-time researcher – Rob, Andreas and Owen all pitched in to varying degrees. To a large extent we were drawing from the research we had previously done. The reason we didn’t hire a researcher was simply that we didn’t find someone we were happy with for the role. </p>\n<p>At the beginning of 2015, we had a bit of a change in strategy. Rather than focusing on running events ourselves, we shifted to focusing on chapters. Chapters have seemed to be most effective when carrying out their own initiatives, so we decided it would work best to play a mentoring role for chapter presidents, rather than taking a top down approach. Since chapters play a larger role in our new strategy, and since it involves conversation with each individual chapter, it made sense to have one person focusing solely on chapters, so Jon moved to doing that. We had also found that following up with people individually – offering to answer questions and address concerns about donating to effective charities, prompting them to start etc seemed pretty effective. So we planned for our communications person to do more of that (that will be a large part of what Luke focuses on). We finally found a great candidate for research – Hauke. Over 2014, our membership doubled. Yet if anything, we want to have more rather than less contact with our members than we have in the past – we want to get a good sense of the path people take to actually deciding to give away 10% of their income to the most effective charities, and support our members to reach out to others. Therefore, we decided to hire someone dedicated to our members – Alison. In terms of if we don’t find the funds we want - we will not be able to hire Sam Deere long-term. His role going forward is still flexible, but it would include maintaining the GWWC website, since he is great at webdevelopment, and PR (which he has experience in from working in politics). It will likely include public speaking, and connecting with people in CSR departments. I think it would be a very bad outcome if we aren’t able to employ Sam long-term. He has a wide variety of extremely useful experience (webdevelopment, PR, social media, graphic design, writing and public speaking), and fits very well into the team. He very much increases our capacity to experiment in terms of time, skills and ideas.</p>\n", "parentCommentId": "7Qf3nxBq4DGrhmP3d", "user": {"username": "Michelle_Hutchinson"}}, {"_id": "tsSkNHJw5SLNvZniv", "postedAt": "2015-05-05T02:24:36.213Z", "postId": "NJ5XvxeF5e8tAuzFi", "htmlBody": "<p>I don’t think there’s a clear cut-off between conceptual and empirical disagreements, and I think it’s really important for us to highlight agreement rather than disagreement. That’s partly because it’s easy to give yourself a pretext for not donating / not donating to charities you aren’t personally connected with, so we don’t want to give people the impression of argument where there isn’t any (think of people citing disagreements over vaccines causing autism, or over climate change, when really scientists all basically agree). And it’s partly because actually we do agree over all the fundamentals, and I’d really like to foster a friendly more collaborate atmosphere in effective altruism. For those reasons, while I’ll briefly mention a couple of examples where we’ve disagreed, please read them in the spirit of us being fundamentally very much on the same page and extremely grateful for the brilliant work GW do. These are simply my impression, and a reason we think our doing research is likely to have value despite GW’s excellent work. Times we’ve disagreed – GWWC didn’t recommend VillageReach (subsequently dropped by GW); GWWC continued recommending AMF over 2014 because we thought it was important AMF had continuity in donations in order to have leverage for making larger distribution agreements (GW has now stated they will recommend AMF for at least 2 years, for a similar reason); GWWC recommended both DWI and SCI earlier on than GW did.</p>\n", "parentCommentId": "zT3CpvCppESp5j6NL", "user": {"username": "Michelle_Hutchinson"}}, {"_id": "rwMvQbbBmxJwsaEoH", "postedAt": "2015-05-07T03:41:13.188Z", "postId": "NJ5XvxeF5e8tAuzFi", "htmlBody": "<p>Thanks for your response. I have two follow up questions if that's ok.</p>\n<ol>\n<li>Suppose GWWC successfully completes it's fundraiser, but then identifies some very attractive new projects, that the CEA Trustees agree are exceptionally high value. Would the Trustees be willing/able to use the discretionary fund to help support them?</li>\n<li>At the moment part of GWWC's budget goes towards shared CEA central expenses, like rent and HR. Is this likely to increase in future? (i.e. is CEA central likely to hire anyone else, or GWWC's share increase ? )</li>\n</ol>\n", "parentCommentId": "tvnDKoBHYmaCMv9e3", "user": {"username": "Larks"}}, {"_id": "YhRqnjmXypyhWxosv", "postedAt": "2015-05-07T06:02:57.456Z", "postId": "NJ5XvxeF5e8tAuzFi", "htmlBody": "<ol>\n<li>Yes - that would fall under 'grants to things we think are awesome'.</li>\n<li>The budget in the document includes our portion of hiring a new staff for central, because CEA has been expanding and we expect to need that capacity next year. The office is unlikely to get much more expensive - we're hoping to sign another contract for 3 years soon. GWWC's share of central is likely if anything to fall, because it's becoming a smaller proportion of CEA given other new projects (early in 2014 we were paying 50% of central, but now GPP and EAO each pay a share).\nWe're very happy to answer questions! </li>\n</ol>\n", "parentCommentId": "rwMvQbbBmxJwsaEoH", "user": {"username": "Michelle_Hutchinson"}}, {"_id": "DB2WpRkvekw3w3qzp", "postedAt": "2015-05-14T17:52:45.010Z", "postId": "NJ5XvxeF5e8tAuzFi", "htmlBody": "<p>I think you could strengthen your model for calculating your multiplier quite a bit by adjusting for the fact that people will earn, and give, more over time.  As you note in your writeup, assuming people will give an equal amount each year is an aggressive assumption, but I doubt people have good intuition for how much this matters (and its effects interact a great deal with assumptions about discount/attrition rates).</p>\n<p>If you'd like, you can borrow the calcs to model this dynamic simplistically from the spreadsheet found in <a href=\"http://www.thelifeyoucansave.org/Blog/ID/181/How-Sponsoring-Giving-Games-Can-Multiply-the-Impact-of-Your-Donations\">this blog post</a>.</p>\n<p>You'll probably find this cuts your realistic estimate by at least half, though of course that still leaves a substantial multiplier :)</p>\n", "parentCommentId": null, "user": {"username": "Jon_Behar"}}, {"_id": "GpntCY8bGSq3tajg5", "postedAt": "2015-05-14T18:35:32.322Z", "postId": "NJ5XvxeF5e8tAuzFi", "htmlBody": "<p>Deleted, responded to Jon's new comment above</p>\n", "parentCommentId": "kBFaA9m4iWDpzbuhi", "user": {"username": "SamDeere"}}, {"_id": "DKx3krwPzrnrTvXD9", "postedAt": "2015-05-14T18:36:26.314Z", "postId": "NJ5XvxeF5e8tAuzFi", "htmlBody": "<p>Thanks for the question Jon.</p>\n<p>With regard to the pledged amount, this comes from members' predictions of their future annual salary, which we think are likely to be underestimates. We also use median wage as a stand-in if we're missing future salary data, which (given our members are in general likely to earn more than median wage) we also think is conservative. Accordingly, it's likely that the amount donated will be higher in reality.</p>\n<p>We address this in more detail in our <a href=\"https://givingwhatwecan.org/fundraising-prospectus-2015\">fundraising prospectus</a> – see Appendix 2 for the full working.</p>\n<p>From page 23 of the prospectus:</p>\n<blockquote>\n<p>This methodology obviously relies on the accuracy of members’ predictions about their future income. In general we have found that these predictions seem conservative, as most people underestimate their future earning potential (1). If members do not estimate their future salary, we use the median salary for their country. We think that is a fairly pessimistic assumption, as our median member has an expected earning potential higher than the median wage (2).</p>\n</blockquote>\n<p>And the footnotes to the above:</p>\n<blockquote>\n<p>(1) For example, many members estimate their future income will be\nthe same as their current income, even though they are at the beginning of their careers - in reality, income typically increases throughout a person’s career\n(2) For example, many members attend prestigious universities and/or are pursuing careers that have an average salary much higher than the median wage</p>\n</blockquote>\n<p>The final $146m figure is arrived at by multiplying members' estimates of future salary by the number of years they have left in their careers. It therefore doesn't take into account any of this growth that you'd expect in reality. As such, it wouldn't make sense to go back and try to model growth based on the $146 million figure (say, $1.7 million in year one, growing to around $5.6 million/year by year 40, rather than a flat $3.7m per year)*.</p>\n<p>Instead, you'd need to apply your model (say, fast wage growth in the first 10-20 years of a career, then slower growth until retirement) to the member estimates <em>first</em> to derive the final figure, and use the yearly amounts in your calculation. Given our assumption that member estimates of future salary err on the low side, this means that both the final pledged amount, and the per-year amounts are likely to be higher, and therefore our effectiveness would in fact be higher, notwithstanding that the discounting/attrition rate would affect the final number more aggressively.</p>\n<hr />\n<p>*<em> I've tried this calculation, assuming a 4% growth rate for years 1-20 and a 2% growth rate in years 21-40. With a year one pledge of $1.7 million, this grows to $5.6 million by year 40, for a total of ~$147 million donated. This drops the effectiveness estimate down to 44-1 - a significant drop, but still excellent return for a donation to Giving What We Can. To reiterate, I think this would be a significant underestimate of peoples' future incomes.</em></p>\n", "parentCommentId": "DB2WpRkvekw3w3qzp", "user": {"username": "SamDeere"}}, {"_id": "B5pPYaspKSw6CqQZM", "postedAt": "2015-05-14T19:30:37.129Z", "postId": "NJ5XvxeF5e8tAuzFi", "htmlBody": "<p>Also, sorry if this reply doesn't exactly address your rephrased question – I wrote it in response to your first comment :)</p>\n<p>Here's a <a href=\"https://docs.google.com/spreadsheets/d/13ChV8Ks5U4ZOskpo6dpIUtSiTtHSnu03Fv7StBdyLAk/edit?usp=sharing\">copy of the spreadsheet with the calculations added in as above</a> if you want to play around with it.</p>\n<p>Thanks again for the question, let me know if there's anything else you want clarified.</p>\n", "parentCommentId": "DKx3krwPzrnrTvXD9", "user": {"username": "SamDeere"}}, {"_id": "8PqKa9nie3cCAwKhZ", "postedAt": "2015-05-14T20:16:29.410Z", "postId": "NJ5XvxeF5e8tAuzFi", "htmlBody": "<p>Thanks Sam!  Very helpful, I hadn't realized how much conservatism was built into the income estimates.</p>\n", "parentCommentId": "B5pPYaspKSw6CqQZM", "user": {"username": "Jon_Behar"}}, {"_id": "HhDMm2foWegnTww3g", "postedAt": "2015-05-31T23:07:20.340Z", "postId": "NJ5XvxeF5e8tAuzFi", "htmlBody": "<p>I think you may be being too pessimistic about the confidence intervals. I'd be very surprised if GWWC turned out to have a leverage ratio less than 1. In fact, I'd be less surprised than if someone handed me a report making a completely knock down case that AMF has no impact, or that GiveDirectly turned out to be harmful.</p>\n<p>To think the ratio is less than 1, you'd need basically <em>all</em> of GWWC's pledgers to drop out immediately (or for it to be true that all of them would have donated otherwise), <em>and</em> you'd need a reason why over 80% of historical attributed donations weren't in fact due to GWWC.</p>\n<p>And the leverage ratio is a conservative measure of GWWC's impact e.g. it doesn't include additional donations to non-recommended charities, or the value of GWWC's role growing the EA movement.</p>\n<p>Disclosure: I work at CEA, the parent organisation of GWWC.</p>\n", "parentCommentId": "D9GhbN4sZGgYee45X", "user": {"username": "Benjamin_Todd"}}, {"_id": "Rut9bGRNvnmH6TXnf", "postedAt": "2015-06-01T02:01:54.903Z", "postId": "NJ5XvxeF5e8tAuzFi", "htmlBody": "<p>I agree that GWWC's ratio is probably above 1 with a good deal of confidence (though I haven't done the formal math to evaluate how extreme that statement is).  But I think the more compelling argument is that expansion funding on the margin may not have a ratio above 1.</p>\n", "parentCommentId": "HhDMm2foWegnTww3g", "user": {"username": "Peter_Hurford"}}, {"_id": "iqKctBf6XxPnSkXoa", "postedAt": "2015-06-01T03:47:21.788Z", "postId": "NJ5XvxeF5e8tAuzFi", "htmlBody": "<p>Yes, there's a huge, huge difference between the impact of GWWC existing as a place where people who wanted to pledge 10% of their income to help those living in global poverty could join others in publicly doing so, and the impact of its marginal funded activities now. GWWC existed as that place before The Centre for Effective Altruism was founded around it as an organisation with donors and a budget supporting paid employees. If minimal resources were spent on creating the basic infrastructure, and I don't know if that's so, but if so, then it had a mega high impact ratio. But it seems wrong to use that to justify keeping on spending more money on more employees doing more marginal projects until the impact from the original resource gets &quot;used up.&quot;</p>\n", "parentCommentId": "Rut9bGRNvnmH6TXnf", "user": {"username": "jayd"}}, {"_id": "aRHnfqPHmsQC8S2fL", "postedAt": "2015-06-01T05:29:36.646Z", "postId": "NJ5XvxeF5e8tAuzFi", "htmlBody": "<p>Ok this is all fair. I think, however, that a big fraction of the historical impact is due to on-going activity, of the kind that could continue, rather than being all due to the 'set up' generating the stream. And that would mean the historical ratio is a reasonable guide to the future.</p>\n<p>This can be hard to see from the outside, but if you look at where new pledgers are coming from, it's often new press coverage or student group activity. Many also only take the pledge after being nudged by someone in person, even if they had heard about GWWC some time before, so there's an important role just talking to lots of people about the pledge. These kinds of activities can be scaled much further.</p>\n<p>Moreover, GWWC tries to monitor the number of new pledges generated by new activities and will quit on anything that's not generating enough. You can see some estimates by Rob of marginal returns above.</p>\n<p>Overall, you'd still have to be very pessimistic. Suppose GWWC's historical leverage ratio is 60. For the <em>future</em> leverage ratio to be less than one, you'd (roughly) need to think there was a 98% chance that marginal activities produced zero returns rather than historical rates of return.</p>\n<p>Finally, I think it's helpful to bear in mind how tiny GWWC is. Suppose taking the GWWC pledge is as ethically demanding as vegetarianism, then it could one day reach 1% of the developed world. Since GWWC only has 1000 members, it has only reached 0.01% of its addressable market. Given such limited penetration, I think it would be surprising if there were no further returns to be had. It's not as if students at Cambridge (where ~100 people have taken the pledge recently) are radically different from those at other prestigious universities, so we should expect similar efforts to work elsewhere, so GWWC could already be 10x bigger even if just expanded among prestigious universities. If anything you might expect marginal costs per pledge to be dropping at this stage in GWWC's growth as you benefit from economies of scale and critical mass effects (and there's some evidence this is happening). Finally, given the chance that 99.99% of the value still lies in the future, it seems well worth spending a sizeable amount of resources now figuring out whether further growth is possible and how best to do it. In some ways, GWWC's marginal leverage ratio is besides the point: it's like looking at Google in its early days and deciding whether to invest or not based on whether it's already profitable.</p>\n", "parentCommentId": "iqKctBf6XxPnSkXoa", "user": {"username": "Benjamin_Todd"}}]