[{"_id": "K7wLNvcujoYuPzR5A", "postedAt": "2022-12-29T11:55:54.125Z", "postId": "NjErqy9u5jLeWhvLo", "htmlBody": "<p>This text should be added into the EA forum wiki on forecasting, even though it is much longer/more detailed than current wiki norms.<br><br>Agree/disagree</p>", "parentCommentId": null, "user": {"username": "nathan"}}, {"_id": "qruWiDzLxMfjnK3on", "postedAt": "2022-12-29T16:30:38.104Z", "postId": "NjErqy9u5jLeWhvLo", "htmlBody": "<ol><li>I think the first paragraph is incorrect as a description of the EA Forum's \"Forecasting &amp; Estimation\" tag, which is pretty different from LessWrong's \"Forecasting &amp; Prediction\" tag. The Forum tag contains many subtags, including \"AI forecasting\"; the Forum doesn't have an analogue of LessWrong's \"Forecasts\" tag to separate out object-level forecasts from discussion of forecasting.</li><li>[More controversially] I'm not sure I like that this text strongly suggests that forecasting is about \"making statements about what will happen in the future (and in some cases, the past) and then scoring the predictions,\" and that forecasting is the kind of thing that you get better at by \"Keep[ing] track of [and assessing] your predictions.\" This excludes important forecasting topics/mindsets that lead you to ask questions like \"what will the world be like in 100 years?\"</li><li>In general I wouldn't worry about adding text to the wiki as long as the resulting page is under 2000 words. I agree-voted even though I'm not thrilled about this text because I think it's better than nothing. (<a href=\"https://forum.effectivealtruism.org/topics/reversal-test\">Reversal test</a>: would I want to delete this text if it was already part of the page? No.)</li></ol>", "parentCommentId": null, "user": {"username": "zsp"}}, {"_id": "pi7aKhbdXcPsxWrA6", "postedAt": "2023-01-06T15:47:44.538Z", "postId": "NjErqy9u5jLeWhvLo", "htmlBody": "<blockquote><p>This is enough of a departure from norms that I think I should get buy-in. To vote, agreevote on the comment below.</p></blockquote><p>&nbsp;</p><p>I disagree with this, I think you should just go ahead and do it.</p>", "parentCommentId": null, "user": {"username": "NunoSempere"}}, {"_id": "RbX2MGgZqAmayjhcb", "postedAt": "2023-01-06T15:54:05.583Z", "postId": "NjErqy9u5jLeWhvLo", "htmlBody": "<blockquote><p>This is enough of a departure from norms that I think I should get buy-in. To vote, agreevote on the comment below.</p></blockquote><p>&nbsp;</p><p>I disagree with this, I think you should just go ahead and do it.</p>", "parentCommentId": null, "user": {"username": "NunoSempere"}}]