[{"_id": "QES7EE3ZZGGjXS4ib", "postedAt": "2023-07-28T22:08:07.485Z", "postId": "NJGzmY5BNRw7fSg3z", "htmlBody": "<p>Fascinating work; thanks for sharing it. The graphs are clear and helpful, and the regression models seem quite informative. Bravo.</p>", "parentCommentId": null, "user": {"username": "geoffreymiller"}}, {"_id": "zgEAzhRggBdxptdin", "postedAt": "2023-07-31T03:18:07.317Z", "postId": "NJGzmY5BNRw7fSg3z", "htmlBody": "<p>Like this a lot, especially the plot designs.</p>\n<p>Surprised there’s not much in demographic differences even with all the caveats that go with interpreting disparities there. Not sure what to make of that yet but will be chewing on that for a while.</p>\n<p>Lastly, got a question. Do you have any sense of what a good baseline for the mental health section might be? The question of “has your mental health increased / decreased/ stayed the same since getting involved with X” is new to me</p>\n", "parentCommentId": null, "user": {"username": "geoffreyyip"}}, {"_id": "RnnrLqvhJKk63ztpY", "postedAt": "2023-07-31T16:26:59.497Z", "postId": "NJGzmY5BNRw7fSg3z", "htmlBody": "<p>I appreciate the work you put into this survey and report. I would like to see the breakdown of \"non-white\" racial identities – I would expect that answers would skew differently based on different racial identities.<br><br>I understand there might not be enough data points for each racial identity, but that might just be a sign that we need to work harder at retaining certain people (and encouraging them to fill out surveys!)</p>", "parentCommentId": null, "user": {"username": "Jessica Wen"}}, {"_id": "Ggi9BBegkoA2CBmaZ", "postedAt": "2023-08-01T10:01:00.271Z", "postId": "NJGzmY5BNRw7fSg3z", "htmlBody": "<p>Thanks Geoffrey!&nbsp;</p><p>I think the mental health increase/decrease question (which was an external request) is not best interpreted with reference to the idea of a 'good baseline', since (as you are perhaps suggesting), I don't think it's clear what a good reference class would be for this (e.g. movements vary a lot in their composition and other potentially relevant characteristics).&nbsp;</p><p>I think it's better interpreted by comparison to what your expectations would be for the absolute pattern of outcomes within the EA community (e.g. some people seem to believe that EA often has a negative impact on the mental health of those involved), and is also potentially informative in terms of group differences and, in the future, could be informative in terms of changes within the EA community over time.</p>", "parentCommentId": "zgEAzhRggBdxptdin", "user": {"username": "David_Moss"}}, {"_id": "HqctJNSGKJE2mCNE3", "postedAt": "2023-08-02T12:32:14.158Z", "postId": "NJGzmY5BNRw7fSg3z", "htmlBody": "<p>Thanks for your question Jessica.<br>&nbsp;</p><p>There are no significant differences between the racial categories (unsurprising given the small sample sizes).&nbsp;</p><p><img src=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/HqctJNSGKJE2mCNE3/o9whfiokerfwqpby4yqq\" srcset=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/HqctJNSGKJE2mCNE3/jyimc8czbxtlxlgdgwr5 200w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/HqctJNSGKJE2mCNE3/wovgazq0bpe5btfrqlqg 400w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/HqctJNSGKJE2mCNE3/cp5ww9qyxsptptymknfp 600w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/HqctJNSGKJE2mCNE3/uy5xutkcflrfbay8i6rj 800w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/HqctJNSGKJE2mCNE3/etjgtrgyyvlg7zdro7fr 1000w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/HqctJNSGKJE2mCNE3/amlnxwnwaxcgt1baktw1 1200w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/HqctJNSGKJE2mCNE3/djm3a7r0drn3y8mzvjoo 1400w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/HqctJNSGKJE2mCNE3/warm8gksmncpm73r4hkl 1600w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/HqctJNSGKJE2mCNE3/uy5diu7vkjziv8vjqfs8 1800w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/HqctJNSGKJE2mCNE3/b3dpxc6eiabsupwamlyw 1999w\">&nbsp;</p>", "parentCommentId": "RnnrLqvhJKk63ztpY", "user": {"username": "David_Moss"}}, {"_id": "sMump6pKLPgCDupr6", "postedAt": "2023-08-11T16:45:33.466Z", "postId": "NJGzmY5BNRw7fSg3z", "htmlBody": "<p>Thanks for sharing these data. The y-axes aren't shown so it's difficult to compare these plots, but I think it's interesting that the distribution of community satisfaction for Black or African American people in the EA community seems to stand out in comparison to other groups.</p><p>The small sample size definitely makes drawing conclusions difficult (maybe apart from showing that EA skews very white for a movement focused on big global issues!)</p>", "parentCommentId": "HqctJNSGKJE2mCNE3", "user": {"username": "Jessica Wen"}}, {"_id": "skTHf4fkfW525WE2h", "postedAt": "2023-08-17T09:58:14.267Z", "postId": "NJGzmY5BNRw7fSg3z", "htmlBody": "<p>Hi Jessica,</p><p>Just to clarify the plot a bit: The y-axis is the racial category and in addition to showing each category and their average + 95% CI, I also added histograms to show the underlying distribution of values. This is helpful for assessing whether the average is actually a good summary of the data (not to actually figure out the distribution in and of itself). In this case, it shows that the distribution of community satisfaction for Black or African American people in the EA community looks a bit unusual, with more observations on the lower and higher end. However, the total sample size for this category is only 34. This is quite low so I wouldn't be surprised if the distribution will end up looking differently if the sample size was greater.</p>", "parentCommentId": "sMump6pKLPgCDupr6", "user": {"username": "WillemSleegers"}}]