[{"_id": "6tJjgrDktCryH7sdy", "postedAt": "2023-03-26T06:44:31.621Z", "postId": "NkAPQnDuSMDLwziYY", "htmlBody": "<blockquote><p>Oh, I've heard all this crap before</p></blockquote><p>This is my first time.</p><blockquote><p>to develop expert-systems to identify the sequences of coding and non-coding DNA that would need to be changed to morally enhance humans</p></blockquote><p>Forgive my bluntness, but that doesn't sound practical. Since when can we identify \"morality nucleotides\"?</p><p>I suspect morality is more a matter of cultural learning than genetics. No genetic engineering was needed to change humans from slave-traders to people who find slavery abhorrent. Plus, whatever genetic bits <i>are</i> involved, changing them sounds like a huge political can of worms.</p>", "parentCommentId": null, "user": {"username": "dpiepgrass"}}, {"_id": "AeceXmFpLbkfctduy", "postedAt": "2023-04-01T23:48:32.811Z", "postId": "NkAPQnDuSMDLwziYY", "htmlBody": "<p>I agree that morals are not genetically inherited, and I did not mean to imply that. Morals are learned, because given the vicissitudes of human life, and the dynamism of what it takes to successfully cooperate in large groups, there never would have been stable selection to favor even general morals like, say, The Golden Rule. In human life, everyone must learn their in-groups moral's. They also have to learn the styles and parameters of moral deliberation processes that are acceptable within their group.</p><p>I do think that the cognitive capacity for moral deliberation, which will involve the collaboration of many parts of the brain, must have a heritable genetic foundation. How complex that foundation is remains an empirical question, but it is probably quite complex. In the coming years, however, I think it is reasonable to expect that domain-specific, expert-system AI will be able to help us identify key genes and their variants (alleles), as well as gene*gene interactions, that influence the development of a species,-typical, moral deliberation style, including the non-random ways, our moral deliberation system responds to various socioecological circumstances.</p><p>In the same way, such domain-specific AI will allow us to understand the complex genetic basis of many diseases and other traits we <i>more predictably</i> would want to modify, because they involve <i>fitness enhancement</i>, like health and longevity, beauty, intelligence, etc.</p><p>Moreover, such expert systems could help us devise moral enhancement strategies based on genetic engineering (and if we are lucky by less invasive epigenetic engineering) that are most likely to be effective and efficient, with minimal onerous side effects. We are not stuttering from Ground Zero! There is good evidence that certain psychedelic substances can result in chemically-induced moral enhancement. One good starting point would be to look at the mechanisms behind that.</p><p>Who knows? In the end it may only require fairly minor genetic modification to adequately increase human's capacity for, say, compassion, than we initially would've guessed. All in the name not only of reducing suffering, but of making us a sustainable species, which I would say now, we are not.&nbsp;</p><p>I also agree with you that this action plan is going to made into a nearly intractable moral can of worms, with much of the argumentation, perhaps somewhat cryptically, being about power. But consider that in this phase of our technological adolescence, <i>if the human species fails to take the ongoing evolution of our mind-brain out of the hands of natural selection</i>, we will remain sophisticated, great apes deeply and mostly unconsciously infected with a deep yearning for power. As well as a lust for engaging in high risk / high reward power projects largely at others' expense.</p><p>It is so difficult to agree on such things that I think the routine <i>extraterrestrial</i> failure to develop plans to take the evolution of mind out of the hands of natural selection during the fairly narrow time window in which that possibility exists for a species like ours, is the reason that we encounter radio silence as we seek signs of intelligent extraterrestrial life around us. As naturally selected power addicts, they couldn't figure out a workable plan either.</p><p>Finally, although people with a classical social science background typically disagree, we cannot rely on culture to produce sufficient moral enhancement to save our species, even though cultural evolution can occur very rapidly in the absence of any genetic change. Even though the above observation is true, it does not mean that cultural evolution occurs in a way that is free from our genetic heritage. Culture always strongly echoes our genetic heritage, the genetic basis for our intrapsychic design included.</p><p>I appreciate the comment! - Paul</p>", "parentCommentId": "6tJjgrDktCryH7sdy", "user": {"username": "Linyphia"}}]