[{"_id": "g9EjrEAa3HPHKWiaG", "postedAt": "2022-12-09T23:13:36.841Z", "postId": "NkPghabDd54nkG3kX", "htmlBody": "<p>I'm so <a href=\"https://twitter.com/jpaddison3/status/1532734127836995585\">excited</a> to see you posting here! &nbsp;I found this to be a really good read. I think the most interesting piece for me was* learning the extent to which your positive press was helpful.</p><p>The last four paragraphs are really moving to me. 🥲<br><br>* &nbsp;(potentially a bit sadly given my predispositions)&nbsp;</p>", "parentCommentId": null, "user": {"username": "jpaddison"}}, {"_id": "EYZQhFJJ3XXJvWkoB", "postedAt": "2022-12-10T03:42:25.323Z", "postId": "NkPghabDd54nkG3kX", "htmlBody": "<p>Thanks for this post. I am a software engineer recently trying to do specifically altruistic work. By nature, I am kind of disdainful of PR and of most existing bureaucracies and authorities, so your emphasis on how important interoperating with those systems was for your work is very useful input to help me switch into \"actually trying to be altruistic\" mode.</p>", "parentCommentId": null, "user": {"username": "cata"}}, {"_id": "JaKAkZm9vfuwTq3Kv", "postedAt": "2022-12-11T15:57:46.571Z", "postId": "NkPghabDd54nkG3kX", "htmlBody": "<p>Thanks Patrick - glad to see you on EA forum.</p>\n<p>Did you reach out to EA funders for VaccinateCA? From the linked article:</p>\n<blockquote>\n<p>I called in favors and pled our case up and down the tech industry, and scraped together about $1.2 million in funding.</p>\n</blockquote>\n<p>I have the sense that (at least today) a project with this level of prioritization, organizational competence and star power would be able to pull down 5x that amount with 1/10th the fundraising effort through the EA network. I think that was approximately still the case in early 2021.</p>\n<p>(FWIW I've been a fan of yours since you started posting on HN, well before this website or even Less Wrong existed, so that contributes to the 'star power'; but there is certainly a big tech/EA overlap and a lot of people who have heard of you so I don't think this is just me.)</p>\n", "parentCommentId": null, "user": {"username": "lincolnq"}}, {"_id": "pGATrvHfdfFRBcaQR", "postedAt": "2022-12-11T16:43:57.175Z", "postId": "NkPghabDd54nkG3kX", "htmlBody": "<p>This is a great post, thanks so much for sharing it!&nbsp;</p><p>I'm curating it.The specific takeaways listed are backed by experience running a very successful project and are usefully not obvious. Moreover, it seems that people interested in working on effective altruism should learn from projects like VaccinateCA.</p><p>And I really appreciate the spirit of the post — if anyone reading this comment didn't get to <a href=\"https://forum.effectivealtruism.org/posts/NkPghabDd54nkG3kX/some-observations-from-an-ea-adjacent-charitable-effort#Expression_of_thanks_for_extended_EA_community\">the last section of the post</a>, I encourage you to skim it.&nbsp;<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefbx307ctms9j\"><sup><a href=\"#fnbx307ctms9j\">[1]</a></sup></span></p><p>A very rough <strong>summary of the post's takeaways</strong> &nbsp;—please feel free to ask me to correct or change this:&nbsp;</p><ol><li>Enabling trade as a mechanism for impact is a leveraged opportunty</li><li>Engaging with the system<ol><li>501c3 status helped with getting funding and appearing legitimate</li><li>positive press was surprisingly helpful for opening doors and appearing legitimate — this was part of a coordinated comms strategy</li></ol></li><li>Professional backgrounds / career advice — what was useful?<ol><li>Having financial runway \"to commit early and boldly to the project even if it exposed me to temporary career risk\"</li><li>sufficient social capital to call in favors with various actors within the tech community and get commitments to resources or other things we needed<ol><li>And \"placement in a social graph with a sufficiently high density of high agency people\"</li></ol></li><li>good understanding of the \"general factor of infrastructure\"</li><li>capability to write good software quickly continues to be a superpower</li></ol></li><li>What <i>would</i> have been useful<ol><li>skilled, experienced people managers</li></ol></li></ol><p>For those interested in learning more, <a href=\"https://www.worksinprogress.co/issue/the-story-of-vaccinateca/\">the \"oral history\" of VaccinateCA</a> that was mentioned is fascinating (but I haven't read much of it and it is very long — if someone finds a summary, I'll be grateful).</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnbx307ctms9j\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefbx307ctms9j\">^</a></strong></sup></span><div class=\"footnote-content\"><p>Specific highlights: (1) the post's author doesn't identify as an EA but is engaging on the Forum anyway — which is awesome, (2) and the entirety of this part:&nbsp;</p><blockquote><p>I consider myself fairly well-educated and well-raised in a moral tradition that has spent a lot of brainsweat on questions like \"What is one's duty to society and to one's fellow man?\" In that moral tradition, presented with the narrow question of \"Given that one is in a position of authority and has a course of action available to save hundreds of lives, what is one's duty?\", the answer is so straightforward as to be uninteresting.</p><p>But nobody, not once in my life, drew out the implication regarding expected value math until you all did.</p><p>For this you have my eternal gratitude.</p><p>And, should circumstances ever find you or yours looking at an expected value calculation that rhymes with the above, know that you'd have my instant attention and (pending thinking through it, in the words of a well-known articulator of my moral tradition) you have my sword.</p></blockquote></div></li></ol>", "parentCommentId": null, "user": {"username": "Lizka"}}, {"_id": "z5iMGDZHuBddLtpGH", "postedAt": "2022-12-12T22:57:28.607Z", "postId": "NkPghabDd54nkG3kX", "htmlBody": "<p>I didn't reach out to any EA funders, for somewhat quirky and contingent reasons, and I'm unfortunately going to be slightly elliptical here rather than saying everything I know:</p><p>At various points when I was raising money, I had miscalibrated understanding of how much money was committed or on the cusp of being committed. Since I was optimizing for speed-to-commitment, at most points I favored either my own network or networks I had perceived-high-quality intros to rather than attempting to light up funding sources which I perceived would not have a high prior on our effectiveness. (FWIW, it was not obvious to me that VaccinateCA would be a slam dunk funding decision in our first twenty days unless one believed in me personally. After Day 20, for a long period, I believed we were adequately funded.)</p><p>There was a period of roughly a hundred days where I believed we were in sufficient conversations to secure sufficient funding (through end-of-mission) and/or had secured that funding.</p><p>When I came to believe that less, in May, the funding environment in tech had chilled to a degree where I thought that new de novo conversations were extremely likely to get bounced without effect, as people we were talking to (including ones with dedicated covid-allocated funds) perceived there as being no need to work on US supply issues in May and later. I/we argued this point strenuously and lost the argument, including with dedicated funds.</p><p>It was not my perception at that point that EA funders would have had a different POV. This may have been miscalibrated and was not something that I explicitly devoted more than a minute to thinking about vis EA funders.</p><p>Far after the events of last year I met some EA funders and heard variants of \"Ahhhhh this is painful to hear\" and in clarity of hindsight it rates as a Doh to me, as well. We were not in danger of collapsing as a mission due to funding issues but I did have to go to Plan B and then to one of my early-in-sequence In Case Of Emergency Break Glass options (injection of $100k from money which immediately prior to the injection probably believed it was a college fund).</p>", "parentCommentId": "JaKAkZm9vfuwTq3Kv", "user": {"username": "patio11"}}, {"_id": "Pgdf4uiQdLCwJrLBA", "postedAt": "2022-12-13T08:01:08.041Z", "postId": "NkPghabDd54nkG3kX", "htmlBody": "<p>I appreciate your posting. I recently tried to undertake especially charitable work as a software developer.</p>", "parentCommentId": null, "user": {"username": "AnnaCrain"}}, {"_id": "3YJo3k38w6cqqbhg2", "postedAt": "2022-12-16T17:41:22.303Z", "postId": "NkPghabDd54nkG3kX", "htmlBody": "<p>In case people are interested, Zvi shared a summary of the history (on LessWrong): &nbsp;<a href=\"https://www.lesswrong.com/posts/tTXfS3H3gNeBqCJk5/key-mostly-outward-facing-facts-from-the-story-of\">Key Mostly Outward-Facing Facts From the Story of VaccinateCA</a>.</p>", "parentCommentId": "pGATrvHfdfFRBcaQR", "user": {"username": "Lizka"}}, {"_id": "DGcuzymhfHNtY3Eat", "postedAt": "2022-12-20T19:24:51.993Z", "postId": "NkPghabDd54nkG3kX", "htmlBody": "<p>Hey Patrick, first of all thanks for the encouraging words - along with many others, I've been very critical of much of the movement recently, and it is nice to hear good things :)&nbsp;</p><p>I really liked your VaccinateCA concept, and ended up using it as a case study for a series of posts suggesting that we set up a donor funded tech agency to work on high social value projects that (initially) have no real stakeholder. The relevant sections discussing it are <a href=\"https://forum.effectivealtruism.org/posts/kQ2kwpSkTwekyypKu/part-1-ea-tech-work-is-inefficiently-allocated-and-bad-for#EA_tech_work_is_inefficiently_allocated\">here</a> and <a href=\"https://forum.effectivealtruism.org/s/fh4kiNZBkcrqKH4LE/p/4d7NsFjwn4Nf6XcC9#Inside_view_comparison\">here</a> - if you're so inclined, I would love to hear your reflection on how much value (if any) you think such an agency would have had, had it been available.</p>", "parentCommentId": null, "user": {"username": "Arepo"}}, {"_id": "dtc9gEp6JQCapi8yP", "postedAt": "2024-01-01T15:30:22.272Z", "postId": "NkPghabDd54nkG3kX", "htmlBody": "<p>Great initiative</p>", "parentCommentId": null, "user": {"username": "Richard Okoe"}}, {"_id": "PvHuhaigBorXLP9JW", "postedAt": "2022-12-13T08:00:49.939Z", "postId": "NkPghabDd54nkG3kX", "htmlBody": null, "parentCommentId": null, "user": null}]