[{"_id": "Jd3f7iFfB7eyj3sEd", "postedAt": "2024-02-13T19:14:44.562Z", "postId": "NLma2WuNPKvqBdDfH", "htmlBody": "<p><strong>Executive summary</strong>: Labor markets in developing countries fail to match productive workers to jobs, resulting in high unemployment and low wage growth that limit incomes and economic growth.</p><p><strong>Key points</strong>:</p><ol><li>Unemployment is much higher than official statistics when accounting for informal self-employment.</li><li>Wages seem too high to clear labor markets, plausibly due to social pressures.</li><li>Workers have far lower wage growth over life cycles compared to developed countries.</li><li>Rural labor markets are efficient in peak seasons but not in lean seasons, resulting in underemployment.</li><li>Solutions are less evident than problems, but private approaches to fixing failures could claim rewards.</li></ol><p>&nbsp;</p><p>&nbsp;</p><p><i>This comment was auto-generated by the EA Forum Team. Feel free to point out issues with this summary by replying to the comment, and</i><a href=\"https://forum.effectivealtruism.org/contact\"><i>&nbsp;<u>contact us</u></i></a><i> if you have feedback.</i></p>", "parentCommentId": null, "user": {"username": "SummaryBot"}}, {"_id": "GEXBSHiEy4CyKLT3q", "postedAt": "2024-02-17T12:09:58.213Z", "postId": "NLma2WuNPKvqBdDfH", "htmlBody": "<p>Thanks <a href=\"https://forum.effectivealtruism.org/users/karthik-tadepalli?mention=user\">@Karthik Tadepalli</a> , a fascinating article again!</p><p>All this rings true with my experience here in Uganda. Wage labourer rates in town at least are fairly close to fixed, whatever the season whatever the situation. This does make it harder sometimes for people to hire people.&nbsp;</p><p>Something missed here are is another force distorting the labour market and driving wages up. - ludicrously high NGO and <a href=\"https://www.imf.org/en/Publications/WP/Issues/2023/03/17/Public-Private-Wage-Differentials-and-Interactions-Across-Countries-and-Time-531080#:~:text=On%20average%2C%20public%2Dsector%20workers,workers%2C%20and%20in%20developing%20countries.\">public sector salaries</a>, much higher than the private sector. These make it harder for the private sector, as people often set their expectations at the high rates set. Here in Uganda, public sector salaries for teachers, nurses, midwives and lab technicians are <i><strong>more than double the market rate</strong></i> - absurd stuff.<br><br>The reasons NGOs set salaries way higher than the market are many and varied. The first is this comparing salaries with Western salaries which is understandable but unhelpful &nbsp;<a href=\"https://forum.effectivealtruism.org/posts/fcvR6kChY4RW723jX/why-value-based-salaries-might-help-african-effective.\">https://forum.effectivealtruism.org/posts/fcvR6kChY4RW723jX/why-value-based-salaries-might-help-african-effective.</a> Another is matching salaries with government salaries rather than the private sector. Have written <a href=\"https://ugandapanda.com/2017/04/17/ngos-part-1-pay-your-workers-less/\">more about it here</a> in a blog. I tell NGOs if they don't have at least a 10% staff turnover rate, their salaries are probably too high lol.</p>", "parentCommentId": null, "user": {"username": "NickLaing"}}]