[{"_id": "ybhk4PckYGMM7GnAg", "postedAt": "2023-01-12T22:01:14.414Z", "postId": "NniTsDNQQo58hnxkr", "htmlBody": "<p>Interesting! When I read <code>oldemail.pdf</code>, I thought he pretty loudly was damning with faint praise toward arguments against race/IQ correlation, which made me respect his epistemic integrity <i>less</i>. It just felt like a lotta kayfabe to me, even though I understand not wanting to write an in-depth viewpoint that's out of one's area of expertise. Hard problem: the epistemic integrity response to race/IQ discourse is to <i>believe true things</i>, to ignore people who think empirical facts are identities (and face the political consequences head on!) or who haven't internalized the is/ought distinction, but that means some serious engagement with what is in this case a thankless literature.</p><p>I know you didn't wanna make this about the object level race/IQ thing, so sorry if that's what I'm doing, I meant to write about our differing assessments of his epistemic integrity. There's a lot of understandable brain poison around this topic.&nbsp;</p>", "parentCommentId": null, "user": {"username": "quinn"}}, {"_id": "dnxJeTEkS8CtqiJda", "postedAt": "2023-01-12T22:07:35.859Z", "postId": "NniTsDNQQo58hnxkr", "htmlBody": "<p>Thank you Cinera.</p><p>I would like to address everyone here who shares this perspective.</p><p>&nbsp;I know and you know that you probably can't do this openly (at least not in your own name), but sending your support to Bostrom privately, and most critically, <strong>expressing it unambiguously in small groups</strong> where it is safe to do so --- that is your duty.&nbsp;</p><p>The inquisitors are out for blood and while they will dominate publicly, it is essential that we preserve a space where people understand that others are out there who are not a part of it.&nbsp;</p><p>Preserve the potential for honest discourse somewhere, or lose it, forever.&nbsp;</p>", "parentCommentId": null, "user": {"username": "lepidus"}}, {"_id": "SF2nHniaM5Tyks6Qf", "postedAt": "2023-01-12T22:16:04.106Z", "postId": "NniTsDNQQo58hnxkr", "htmlBody": "<p>Yeah, I can't particularly discuss this given my stated preferences to avoid race/IQ discussion.</p>\n", "parentCommentId": "ybhk4PckYGMM7GnAg", "user": {"username": "Dragon God"}}, {"_id": "exfN6vi4oPidzrPHq", "postedAt": "2023-01-12T22:16:06.589Z", "postId": "NniTsDNQQo58hnxkr", "htmlBody": "<p>I'm surprised you feel that \"the current zeitgeist on the forum underweights [the opinion 'I support Bostrom']\" - my sense is that most upvoted comments are supportive of his apology, and I haven't seen any advocating that he face professional censure.</p>", "parentCommentId": null, "user": {"username": "britomart"}}, {"_id": "uRkYSHunXZvMqoB7u", "postedAt": "2023-01-12T22:31:15.048Z", "postId": "NniTsDNQQo58hnxkr", "htmlBody": "<p>Hello lepidus, can I just check that I'm understanding you correctly - you believe that people within EA who support Bostrom are a persecuted minority, who must band together to discuss the topics that other people are not brave (or honest) enough to broach?</p>", "parentCommentId": "dnxJeTEkS8CtqiJda", "user": {"username": "britomart"}}, {"_id": "JHGGqp4n57eZ7GrtD", "postedAt": "2023-01-12T22:34:44.051Z", "postId": "NniTsDNQQo58hnxkr", "htmlBody": "<p>Most comments on the matter I've actually seen were critical/condemning. It sounds like several supporters were not vocally expressing their positions?</p>\n<p>The opinion itself may not be that controversial, but it's very much a minority in terms of actual comments on the matter?</p>\n", "parentCommentId": "exfN6vi4oPidzrPHq", "user": {"username": "Dragon God"}}, {"_id": "eEFMb9Ds9szdvtfh8", "postedAt": "2023-01-12T22:36:03.304Z", "postId": "NniTsDNQQo58hnxkr", "htmlBody": "<p>At the time Cinera's post was published, the most upvoted post on the EA forum about the controversy was <a href=\"https://forum.effectivealtruism.org/posts/8zLwD862MRGZTzs8k/a-personal-response-to-nick-bostrom-s-apology-for-an-old\">this post</a>, which explicitly said that Bostrom's apology was insufficient,</p><blockquote><p>His apology fails badly to fully take responsibility or display an understanding of the harm the views expressed represent.</p></blockquote>", "parentCommentId": "exfN6vi4oPidzrPHq", "user": {"username": "Matthew_Barnett"}}, {"_id": "7A6xDTuKz585L5mbb", "postedAt": "2023-01-12T22:39:26.560Z", "postId": "NniTsDNQQo58hnxkr", "htmlBody": "<p>The current top-voted comments on the original post are: 1) a moderator asking people to remember community norms, 2) a commenter asking people to be kind and charitable, and 3) someone who says \"The original email (written 26 years ago) was horrible, but Bostrom's apology seems reasonable\" and criticises the author of the post for attempting to stir up drama.</p>", "parentCommentId": "JHGGqp4n57eZ7GrtD", "user": {"username": "britomart"}}, {"_id": "3GtyoEdq7CFdCWJdy", "postedAt": "2023-01-12T22:59:32.965Z", "postId": "NniTsDNQQo58hnxkr", "htmlBody": "<p>Per Bostrom's note, this is \"very worst of the worst in [his] contribution file\" on the forum in question. That suggests there may be more of \"the worst\" to come in the expose some unnamed person is apparently compiling.</p>\n", "parentCommentId": null, "user": {"username": "Jason"}}, {"_id": "G4wueqDGD8jxkPTyd", "postedAt": "2023-01-13T04:50:05.904Z", "postId": "NniTsDNQQo58hnxkr", "htmlBody": "<p>Academics lean towards epistemic integrity</p>\n<p>Leadership/Influencers/Elites should learn towards epistemic responsibility at the cost of integrity due to network effects</p>\n<p>Bostrom has graduated from being just an academic to a thought leader and pretty influential figure in the movement, getting mainstream media attention. It makes sense for him, at this point in his career, to make the statement that he did regardless of his views on the topic.</p>\n", "parentCommentId": "ybhk4PckYGMM7GnAg", "user": {"username": "sak_sham"}}, {"_id": "ztPq27TXaWnS3ddCk", "postedAt": "2023-01-13T07:25:38.359Z", "postId": "NniTsDNQQo58hnxkr", "htmlBody": "<p>Thank you for posting this.</p>\n<p>I roughly share the views you expressed here.</p>\n<p>As you intended, the post is a valuable counterbalance to some of the other discussion.</p>\n", "parentCommentId": null, "user": {"username": "Peter_Hartree"}}, {"_id": "jCuf56aqaxEJp8xgf", "postedAt": "2023-01-13T09:42:49.038Z", "postId": "NniTsDNQQo58hnxkr", "htmlBody": "<p>Responding to one point only:\nI think more poorly of Bostrom being a “grand strategist for humanity” if he thinks the apology he wrote was the best one he honestly could have, given the large backlash and potential impact on his work and EA. Seems like quite a large mistake IMO (especially if the investigation now launched by Oxford leads to him losing his post)</p>\n<p>Link to article mentioning the investigation:\n<a href=\"https://www.thetimes.co.uk/article/blacks-more-stupid-than-whites-wrote-oxford-don-8gsj8l0wf\">https://www.thetimes.co.uk/article/blacks-more-stupid-than-whites-wrote-oxford-don-8gsj8l0wf</a></p>\n<p>edit: added the word honestly to be clearer</p>\n", "parentCommentId": null, "user": {"username": "JamesOz"}}, {"_id": "xsfucjSoDkJ9GD5tR", "postedAt": "2023-01-13T10:19:34.551Z", "postId": "NniTsDNQQo58hnxkr", "htmlBody": "<p>Bostrom could have written a better apology, but I think that may have required dishonesty about his beliefs, and I think such dishonesty would have been really bad.</p>\n", "parentCommentId": "jCuf56aqaxEJp8xgf", "user": {"username": "Dragon God"}}, {"_id": "td6rbbjduefbhqEvo", "postedAt": "2023-01-13T10:40:06.304Z", "postId": "NniTsDNQQo58hnxkr", "htmlBody": "<p>Leaving aside some object-level stuff about Bostrom's views, I still think the apology could be much better without any dishonesty on his part. This is somewhat subjective but things that I think could have been better:</p><ul><li>Don't frame the apology at the beginning as almost purely instrumental i.e. not like \"I will get smeared soon, so I want to get ahead of the game\". This makes everything come across as less genuine.&nbsp;</li><li>\"What about eugenics? Do I support eugenics? No, not as the term is commonly understood.\" - This is just not a useful thing to mention in an apology about racism, or at least, not in this way. Usually, if someone says \"<a href=\"https://commonslibrary.org/frame-the-debate-insights-from-dont-think-of-an-elephant/\">Don't think of an elephant</a>\" then you <strong>do</strong> think of an elephant. The consequence is now people are probably more likely to think there is a link between Bostrom and eugenics than if this was written differently.</li><li>And some other points that Habiba mentioned in <a href=\"https://forum.effectivealtruism.org/posts/8zLwD862MRGZTzs8k/a-personal-response-to-nick-bostrom-s-apology-for-an-old\">her post</a> e.g. \"I am deeply uncomfortable with a discussion of race and intelligence failing to acknowledge the historical context of the ideas’ origin and the harm they can and have caused.\"</li></ul><p>In my opinion it just highlights some basic misunderstandings about communication and our society today, which (I think) was proven by the fairly widespread negative backlash to this incident.</p>", "parentCommentId": "xsfucjSoDkJ9GD5tR", "user": {"username": "JamesOz"}}, {"_id": "eoNDdCqrXuDyrZbLH", "postedAt": "2023-01-13T11:38:04.525Z", "postId": "NniTsDNQQo58hnxkr", "htmlBody": "<p>I completely support Bostrom too. He is not only corageous, but also politically skilfull. Some conflicts are inevitable.</p><p><a href=\"https://forum.effectivealtruism.org/posts/r3f45au7ewEkypygf/wokism-rethinking-priorities-and-the-bostrom-case\">https://forum.effectivealtruism.org/posts/r3f45au7ewEkypygf/wokism-rethinking-priorities-and-the-bostrom-case</a></p>", "parentCommentId": null, "user": {"username": "Arturo Macias"}}, {"_id": "JD7guBf3aKFu42i62", "postedAt": "2023-01-13T14:07:15.869Z", "postId": "NniTsDNQQo58hnxkr", "htmlBody": "<blockquote><p>Don't frame the apology at the beginning as almost purely instrumental i.e. not like \"I will get smeared soon, so I want to get ahead of the game\". This makes everything come across as less genuine.&nbsp;</p></blockquote><p>What other reason is there to apologize?</p><p>This framing was obviously a bad idea instrumentally, but the fact that Bostrom chose this framing sends some signal that he has some standards of integrity that he's not willing to compromise for instrumental goals. I have previously criticized other thought leaders in EA for not having any such standards, and the fact that Bostrom does seem to have them is encouraging.</p><blockquote><p>And some other points that Habiba mentioned in <a href=\"https://forum.effectivealtruism.org/posts/8zLwD862MRGZTzs8k/a-personal-response-to-nick-bostrom-s-apology-for-an-old\">her post</a> e.g. \"I am deeply uncomfortable with a discussion of race and intelligence failing to acknowledge the historical context of the ideas’ origin and the harm they can and have caused.\"</p></blockquote><p>Is she also deeply uncomfortable with a discussion of, say, French people that fails to acknowledge the historical context of their origin and the harm they can and have caused? I'm guessing not.</p><p>Again, from a power-seeking perspective her point is correct, but I'm sure that's not the sense in which she meant it.</p><blockquote><p>In my opinion it just highlights some basic misunderstandings about communication and our society today, which (I think) was proven by the fairly widespread negative backlash to this incident.</p></blockquote><p>It's him maximizing some combination of honesty and instrumental value because he's not willing to completely lie about his views in order to improve his public image. That's a good trait and one you should be encouraging, not criticizing. EA has enough problems with people lying and deceiving to try to accumulate more power, more resources, and more influence. We don't need any more of this behavior.</p>", "parentCommentId": "td6rbbjduefbhqEvo", "user": {"username": "throwaway791"}}, {"_id": "4SiWjyq5ypBuu73zN", "postedAt": "2023-01-13T15:32:07.649Z", "postId": "NniTsDNQQo58hnxkr", "htmlBody": "<blockquote><p>What other reason is there to apologize?</p></blockquote><p>A desire to mitigate the harm that one's comments have caused.</p>", "parentCommentId": "JD7guBf3aKFu42i62", "user": {"username": "Jason"}}, {"_id": "8LyCqQbNxakogJYcN", "postedAt": "2023-01-13T15:34:18.598Z", "postId": "NniTsDNQQo58hnxkr", "htmlBody": "<p>Bostrom's email did not actually cause any harm (as far as we know) as at the time it was written.</p>\n", "parentCommentId": "4SiWjyq5ypBuu73zN", "user": {"username": "Dragon God"}}, {"_id": "7Tr7JGqHtZkXmHyqQ", "postedAt": "2023-01-13T16:17:57.116Z", "postId": "NniTsDNQQo58hnxkr", "htmlBody": "<p>This seems too simple. The email was going to be made public, which would (and did) cause harm to many people, so an apology could try to mitigate the harm of his words being shared in 2022. His apology largely failed on this point (in my opinion).</p>\n", "parentCommentId": "8LyCqQbNxakogJYcN", "user": {"username": "JamesOz"}}, {"_id": "uiHHk3MpAi9Ea82cF", "postedAt": "2023-01-13T16:24:18.091Z", "postId": "NniTsDNQQo58hnxkr", "htmlBody": "<p>I am not clear to the extent to which his email actually harmed people.</p>\n<p>I agree that he did not optimise for mitigating the harm caused, but I don't grant much weight to that because it's very ambiguous to me to what extent harm was caused.</p>\n", "parentCommentId": "7Tr7JGqHtZkXmHyqQ", "user": {"username": "Dragon God"}}, {"_id": "FuLrnmijnzWc45XtG", "postedAt": "2023-01-13T18:36:49.239Z", "postId": "NniTsDNQQo58hnxkr", "htmlBody": "<blockquote><p>\"What about eugenics? Do I support eugenics? No, not as the term is commonly understood.\" - This is just not a useful thing to mention in an apology about racism, or at least, not in this way</p></blockquote><p>I actually think this was quite reasonable. He's a bioethicist, after all – 'eugenics' has a bunch of different meanings in that field and it's important to distinguish between them</p>", "parentCommentId": "td6rbbjduefbhqEvo", "user": {"username": "HenryStanley"}}, {"_id": "rdfm9c4tkEfNYPjha", "postedAt": "2023-01-13T18:50:26.396Z", "postId": "NniTsDNQQo58hnxkr", "htmlBody": "<p>Downvoted because I'd prefer not to turn the situation into a one-dimensional tribal conflict of \"support or oppose Bostrom\", which this post feeds into. I support you expressing your opinions, though, so would encourage a more descriptive title.</p>", "parentCommentId": null, "user": {"username": "richard_ngo"}}, {"_id": "66v9gQhXx8Wsuss6W", "postedAt": "2023-01-13T18:56:01.310Z", "postId": "NniTsDNQQo58hnxkr", "htmlBody": "<p>This post was written in part because a tribal narrative of opposing Bostrom seemed to be dominating the forum zeitgeist.</p>\n", "parentCommentId": "rdfm9c4tkEfNYPjha", "user": {"username": "Dragon God"}}, {"_id": "jq8go3rAi6sSkioSQ", "postedAt": "2023-01-13T19:03:25.592Z", "postId": "NniTsDNQQo58hnxkr", "htmlBody": "<p>I've also downvoted other things that promote one-dimensional tribalist conflict on this issue. In general I don't support escalation to even-more-clearly-defined battle lines; this is precisely how conflicts become worse.</p>", "parentCommentId": "66v9gQhXx8Wsuss6W", "user": {"username": "richard_ngo"}}, {"_id": "rgCjmdzoEafG3aire", "postedAt": "2023-01-13T19:18:47.643Z", "postId": "NniTsDNQQo58hnxkr", "htmlBody": "<p>Fair enough. The damage has already been done, so I'll leave the title of the post as is.</p>\n", "parentCommentId": "jq8go3rAi6sSkioSQ", "user": {"username": "Dragon God"}}, {"_id": "DyjQu4G6QeMmfzdHg", "postedAt": "2023-01-13T21:05:59.035Z", "postId": "NniTsDNQQo58hnxkr", "htmlBody": "<p>Can you point to any specific physical harm that was caused by Bostrom's comments that goes beyond \"some people were upset\"?</p>", "parentCommentId": "4SiWjyq5ypBuu73zN", "user": {"username": "throwaway791"}}, {"_id": "gNy7EBhQhfoBiXnaZ", "postedAt": "2023-01-13T21:07:50.333Z", "postId": "NniTsDNQQo58hnxkr", "htmlBody": "<p>This is a universal argument that can be used to stop literally any action you don't like, or at least cause people to apologize for any such action, because any nontrivial action taken in the world is going to cause harm to at least some people, and probably many people. For this reason it should be rejected out of hand unless it is supported by context-specific details that make it more compelling in this case than it would be in the abstract.</p><p>No such details have been forthcoming from the proponents of this argument, most likely because they don't actually exist and therefore can't be supplied on demand.</p>", "parentCommentId": "7Tr7JGqHtZkXmHyqQ", "user": {"username": "throwaway791"}}, {"_id": "Nifw3E3AT2jgFfS66", "postedAt": "2023-01-14T04:08:50.295Z", "postId": "NniTsDNQQo58hnxkr", "htmlBody": "<p>Noting for the record that I read this post after these comments were written, and other people will as well.</p>", "parentCommentId": "rgCjmdzoEafG3aire", "user": {"username": "Lumpyproletariat"}}, {"_id": "zFKkX6a5TioaYjfRr", "postedAt": "2023-01-14T21:18:14.172Z", "postId": "NniTsDNQQo58hnxkr", "htmlBody": "<p>I've updated the title.</p>\n", "parentCommentId": "Nifw3E3AT2jgFfS66", "user": {"username": "Dragon God"}}, {"_id": "h44RwudFkpgrAc9Ap", "postedAt": "2023-01-14T21:27:15.373Z", "postId": "NniTsDNQQo58hnxkr", "htmlBody": "<p>Congrats on <a href=\"https://alexvermeer.com/the-twelve-virtues-of-rationality/\">updating</a>! (Your mind not the title.)&nbsp;</p>", "parentCommentId": "zFKkX6a5TioaYjfRr", "user": {"username": "jpaddison"}}, {"_id": "8Tr3mqujCjSHmbriq", "postedAt": "2023-01-17T09:38:37.490Z", "postId": "NniTsDNQQo58hnxkr", "htmlBody": "<p>Social taboos do not just exist arbitrarily but in collective response to the amount of harm certain words and ideas have historically caused.<br><br>It is socially taboo to deny the Holocaust. Do you think it would be acceptable if Bostrom had outed himself as a Holocaust denier? If that was the case, would anyone be talking about the virtues of his epistemic integrity? No!&nbsp;Because the \"counter-cultural belief\" he would be committing to and promoting in that case (as I believe is the situation here) is actively false and harmful.<br><br>Those defending him now are likely doing so because, on some level, they are at least willing to consider holding the same specific beliefs as him on race differences, are becoming increasingly aware that these beliefs are understood to be problematic and harmful but remain committed to those beliefs and to Bostrom regardless. Don't try to sugar coat things and please be honest, with yourselves and others. Appealing to some notion of \"epistemic integrity\" here just seems deeply disingenuous.&nbsp;<br><br>Also - to clarify for those that pull out this response as an example of \"look, a Black person supports Bostrom\", I am also Black and the vast majority of other Black people I engage with about this issue, especially those with no personal attachment or loyalty to EA or Bostrom, are deeply hurt and offended by the contents in Bostrom's non-apology. OP does not speak for all of us, or really *anyone* except for himself.</p>", "parentCommentId": null, "user": {"username": "not_applicable"}}, {"_id": "7MvSeA7Xvfbb6sw3T", "postedAt": "2023-01-17T18:50:04.163Z", "postId": "NniTsDNQQo58hnxkr", "htmlBody": "<blockquote>\n<p>OP does not speak for all of us, or really <em>anyone</em> except for himself.</p>\n</blockquote>\n<p>This is very true, thanks for speaking up.</p>\n<p>(I never intended to speak for all black EAs.)</p>\n", "parentCommentId": "8Tr3mqujCjSHmbriq", "user": {"username": "Dragon God"}}, {"_id": "twFeQftFMXvxvQAcZ", "postedAt": "2023-01-17T19:20:13.368Z", "postId": "NniTsDNQQo58hnxkr", "htmlBody": "<p>I do not follow the relevance of this critique. If Nick Bostrom, or anyone else, &nbsp;denied the Holocaust, and there was ample evidence to support the position, people <i>would</i> be talking about the virtues of his epistemic integrity. If he denied the Holocaust without ample evidence, people would be critiquing the virtues of his epistemic integrity. The crux of the matter of epistemic integrity is whether or not the evidence supports the position.</p><blockquote><p>Those defending him now are likely doing so because, on some level, they are at least willing to consider holding the same specific beliefs as him on race differences, are becoming increasingly aware that these beliefs are understood to be problematic and harmful but remain committed to those beliefs and to Bostrom regardless. Don't try to sugar coat things and please be honest, with yourselves and others. Appealing to some notion of \"epistemic integrity\" here just seems deeply disingenuous.</p></blockquote><p>This seems to rest on the false assumption that \"defenders\" do not hold these beliefs out of epistemic integrity, but out of some other sort of animus. I do not think that is true for most, and certainly not true for myself. I hold my understanding of Bostrom's statement (that black people are on average less intelligent than white people) to be true because that's what all available evidence suggests.<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefneq3fk3tuia\"><sup><a href=\"#fnneq3fk3tuia\">[1]</a></sup></span></p><p>Bostrom did not delve into the causal mechanism for this phenomenon, which is considerably murkier. His statement was a plain stating of observed facts. albeit in an insensitive manner. That is why people defend his epistemic integrity in this instance.</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnneq3fk3tuia\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefneq3fk3tuia\">^</a></strong></sup></span><div class=\"footnote-content\"><p>https://reasonwithoutrestraint.com/the-scope-of-racial-disparities-in-test-scores-in-the-united-states/</p></div></li></ol>", "parentCommentId": "8Tr3mqujCjSHmbriq", "user": {"username": "Anon Rationalist"}}, {"_id": "ZCKDHPNv7uBfkDzah", "postedAt": "2023-01-18T18:28:57.304Z", "postId": "NniTsDNQQo58hnxkr", "htmlBody": "<p>I don't agree, and here is why:</p><p>I never claimed animus had anything to do with this (1).&nbsp;</p><p>What I claim is that this belief is harmful and untrue, and celebrating \"epistemic integrity\" in such cases - as with Holocaust denial - doesn't make any sense.&nbsp;</p><p>Your claim that \"blacks are less intelligent..\" is pretty much as widely discredited as Holocaust denial (2), supported with as sparse evidence as the latter. &nbsp;So, why then are there so many eager to overwhelmingly consider the dubious evidence \"for\", rather than the mountain of mainstream evidence \"against\"? &nbsp;It's likely not because of any conscious animus (which I do not claim) but most likely because, as with much unknowing prejudice, it is simply personally convenient.&nbsp;</p><p>Many of those that tend to defend Bostrom's position happen to be white and/or highly committed to both EA and Bostrom - making the finding seem <i>personally</i> convenient in a way that biases them towards accepting &nbsp;scientifically discredited truths, even when that is socially unacceptable (this is the same case with holocaust deniers, who reject the event, despite the overwhelming evidence to the contrary, because it directly challenges their problematic personal world views). What this means is that some may be stubbornly committed to these beliefs because it reinforces problematic prejudices they already hold (ie. to be White and told on average you are more intelligent etc.), and sometimes it is just more convenient for other reasons (ie. to be a committed follower of Bostrom wishing to remain loyal). Whatever the case, there's definitely a lot more going on here than a stoic consideration of the evidence, because the mainstream, widely accepted consideration of the evidence does not support the claim. I'd encourage those on the fence to reflect more on where their biases lie in what kind of evidence they choose to accept rather than reject. There is nothing noble about doubling down on beliefs that are both actively harmful and disproven, in order to maintain a personally convenient worldview. &nbsp;&nbsp;</p><p>I suspect you are someone that will remain stubborn in your beliefs despite any contradicting evidence, so I won't engage further in this debate. Just know that at this point, ignoring the mountain of contrary evidence to this problematic belief reveals more about your prejudices that you may be comfortable to admit.</p><p>--</p><p>(1) The literal dictionary definition of racism is \"the belief that different races possess distinct characteristics, abilities, or qualities, especially so as to distinguish them as <u>inferior</u> or superior to one another.\" &nbsp;This is how it is widely understood and experienced - the definition of racism does not require animus, but just a stubborn belief in meaningful racial differences and hierarchy. Race scholars have written about this at length and I have personally experienced many pleasant people with objectively prejudiced and problematic beliefs. The belief that \"black people are on average less intelligent than white people\" is considered by many (including myself, and pretty much every race scholar) to be a racist belief. You are entitled to hold a racist belief, of course, but it doesn't make sense to deny it as such for personal comfort or whatever other arbritrary reasons, or to distort the definition of racism by falsely claiming that because you hold no personal animus to Black people, you cannot adhere to explicitly racist beliefs.&nbsp;</p><p>(2) The \"scientific evidence\" you link to has been widely discredited as pseudo-science, to the point where much of that work has been rescinded from publication (if it was even ever peer-reviewed in the first place). Many of those that work on race science were found to have had an explicit racist agenda, and manipulated findings for the purpose of promoting it. I won't do the work of repeating what many others have discussed - you can check out the appendix of this blog post for that research: <a href=\"https://ineffectivealtruismblog.com/2023/01/12/off-series-that-bostrom-email/\">https://ineffectivealtruismblog.com/2023/01/12/off-series-that-bostrom-email/</a></p>", "parentCommentId": "twFeQftFMXvxvQAcZ", "user": {"username": "not_applicable"}}, {"_id": "eWe2Enwyqt5f9Tz9Q", "postedAt": "2023-01-19T09:11:19.214Z", "postId": "NniTsDNQQo58hnxkr", "htmlBody": "<blockquote>\n<p>Your claim that \"blacks are less intelligent..\" is pretty much as widely discredited as Holocaust denial (2), supported with as sparse evidence as the latter.</p>\n</blockquote>\n<p>I think this is completely wrong as an empirical statement. The claim may very well be false, but the evidence supporting it isn't as tenuous as the evidence supporting Holocaust denial.</p>\n", "parentCommentId": "ZCKDHPNv7uBfkDzah", "user": {"username": "Dragon God"}}]