[{"_id": "CDtrBsBBomYMBjjZo", "postedAt": "2024-02-10T09:03:34.485Z", "postId": "Nodk69mPSEAW2y65L", "htmlBody": "<p>Nice analysis, Ricardo!</p><blockquote><p><strong>Global Health &amp; Development Fund</strong>: Despite the general uptick in 2022, the GH&amp;D Fund did not share in this surge and has yet to distribute any grants in 2023.</p></blockquote><p>I think some of the growth from 2020 to 2022 was due to the <a href=\"https://forum.effectivealtruism.org/topics/ftx-foundation\">FTX Foundation</a>. Since FTX increased overall funding, Open Phil could also grant more to EA Funds. However, there was no growth in the GH&amp;D fund because it has traditionally been majorly supported by direct donations. Open Phil still increased their funding of the area of GH&amp;D by increasing their grants to GiveWell. Open Phil <a href=\"https://www.openphilanthropy.org/research/2021-allocation-to-givewell-top-charities-why-were-giving-more-going-forward/\">said</a> the following in November 2021:</p><blockquote><p>Today we are excited to announce our largest-to-date support for GiveWell’s recommendations: $300 million for 2021, up from $100 million last year, with tentative plans[1] to donate an additional $500 million per year in 2022 and 2023.</p></blockquote><p>The growth plans did not materialise partly due to the collapse of FTX.</p>", "parentCommentId": null, "user": {"username": "vascoamaralgrilo"}}, {"_id": "ud4CjvbPueEJAADmM", "postedAt": "2024-02-10T12:41:01.051Z", "postId": "Nodk69mPSEAW2y65L", "htmlBody": "<p>Awesome work Ricardo! And take even more applause for making the code open source!!!</p><p>Minor correction, both on the website and on the Grant Database CSV they provide, the numbers I have don't quite match yours? It especially seems to undercount GH&amp;D, they seem to have made two funds in 2023 totalling £3.35m, and 8 in 2022 totalling £11.14m. Maybe they've updated this since you extracted your data, or perhaps there's some difference between the csv and the endpoint you requested data from? Or maybe you apply a filter in your code that removes them accidentally?</p><p>I think that's probably a point EA Funds could do, is say when the grant database is fully up-to-date historically with what has been granted.</p>", "parentCommentId": null, "user": {"username": "JWS"}}, {"_id": "twCJXgr6NC8g3pLp4", "postedAt": "2024-02-10T13:18:35.988Z", "postId": "Nodk69mPSEAW2y65L", "htmlBody": "<p>\"<strong>Consistent Growth in Donations:</strong> There has been a consistent increase in overall donations year over year, with the EA Infrastructure and Long-Term Future funds experiencing notable growth in 2021 and 2022.\"</p><p>This doesn't seem right to me. <a href=\"https://funds.effectivealtruism.org/stats/donations\">Data from EA Funds dashboard</a>:</p><figure class=\"image\"><img src=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/twCJXgr6NC8g3pLp4/m1b2kftk0vbm1qhhg0kc\" srcset=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/twCJXgr6NC8g3pLp4/oi2km0y1bliz1rxypvnb 160w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/twCJXgr6NC8g3pLp4/wecsavg4w9i9et7tusqv 320w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/twCJXgr6NC8g3pLp4/wad8oqt2thril9ywiprv 480w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/twCJXgr6NC8g3pLp4/krs4dypk0cbxxqapy7c5 640w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/twCJXgr6NC8g3pLp4/ifqxlctxrrrvgjmhx0xw 800w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/twCJXgr6NC8g3pLp4/o3rycacqqnjdaqnglebz 960w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/twCJXgr6NC8g3pLp4/dhsls3kvdbqs0lqn8ahf 1120w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/twCJXgr6NC8g3pLp4/lnvlftayrfjvb8pcvg4c 1280w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/twCJXgr6NC8g3pLp4/bal2gg0fem4ac8gxcd5g 1440w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/twCJXgr6NC8g3pLp4/b22flpgaluyztfdpsgbj 1600w\"></figure>", "parentCommentId": null, "user": {"username": "emre kaplan"}}, {"_id": "qnFN94cieFy8vt9bi", "postedAt": "2024-02-12T01:15:45.575Z", "postId": "Nodk69mPSEAW2y65L", "htmlBody": "<p>@emre that's a good point but I think there is a couple things to unpack here:</p>\n<p>1- In this particular section I am referring to the \"grants\" that EA Funds gives to beneficiaries and not \"donations\" they receive, which is what the graph you shared is referring to. If you look at the first graph, besides the drop in 2023 (data incomplete when I ran the analysis) the grants they gave followed an upward trajectory.This may be a language/semantic issue from my end as I use these interchangeably, but I'll look over the text and try to make sure this is clear.</p>\n<p>2- The graph you shared, I am assuming it corresponds only to individual donors donating to EA funds. This is one of my suggestions for EA funds, that they could be more explicit about this on the website so the information is easier to interpret. Either way, individual donations has clearly gone down, however overly grant giving has gone up. The two most obvious explanations for this are (1) they had built up a larger cash position that is being drawn down now and (2) they are receiving or have received more institutional funding that isn't represented in that graph.</p>\n", "parentCommentId": "twCJXgr6NC8g3pLp4", "user": {"username": "Ricardo Pimentel"}}, {"_id": "94yHJpGR5cJ8YvhgG", "postedAt": "2024-02-12T01:54:18.935Z", "postId": "Nodk69mPSEAW2y65L", "htmlBody": "<p>Thank you very much.</p>\n<p>They probably updated the information. I ran the original analysis in early December but delayed publishing due to a request from EA funds as they wanted to update the database.</p>\n<p>Agreed that knowing when the last update was made helps to understand what is being reflected on the websites.</p>\n", "parentCommentId": "ud4CjvbPueEJAADmM", "user": {"username": "Ricardo Pimentel"}}, {"_id": "7Fkcj8qsBL7tbxhbR", "postedAt": "2024-02-12T03:37:39.085Z", "postId": "Nodk69mPSEAW2y65L", "htmlBody": "<p>(I work for EA Funds)</p><p>Re 2: Yes this is correct. It does not include institutional funds. I'm also not sure if it includes non-cash donations from individuals either; I think the dashboard was created back when there was only one way to donate to EA Funds. I'll check.<br><br>(Thanks for your hard work on the post btw!)</p>", "parentCommentId": "qnFN94cieFy8vt9bi", "user": {"username": "Linch"}}, {"_id": "XuGDfFTeDedCnqh59", "postedAt": "2024-02-12T03:56:05.114Z", "postId": "Nodk69mPSEAW2y65L", "htmlBody": "<p>(My own guesses only)</p><p>For what it's worth my guess is that a key reason people aren't giving as much to our GH&amp;D fund is due to the influx of healthy competitors. Ie, it's not offering much of a differentiated product from what people could get elsewhere. I haven't interviewed our donors about this so I can't be sure, but my impression is that when the GH&amp;D fund first launched, there weren't any plausible competitors for donors for the niche of \"I want to figure out my own cause prioritization, but I want to defer to external experts to source and prioritize interventions and projects.\" But these days GiveWell manages a number of their own funds (as opposed to \"just\" writing up public recommendations for charities to suggest people give to), Giving What We Can has their own <a href=\"https://www.givingwhatwecan.org/en-US/best-charities-to-donate-to-2024#best-charities-for-global-health-and-wellbeing\">Global Health&amp;Wellbeing fund</a>, etc. &nbsp;</p><p>In contrast, EA Funds' other funds still retain an edge as arguably being the default place to donate to for those cause areas, for a reasonable subset of engaged donors.</p>", "parentCommentId": "CDtrBsBBomYMBjjZo", "user": {"username": "Linch"}}, {"_id": "7PTPyBh5FdxabhEF7", "postedAt": "2024-02-12T07:43:23.078Z", "postId": "Nodk69mPSEAW2y65L", "htmlBody": "<p>Nice point, Linch! I have a <a href=\"https://forum.effectivealtruism.org/posts/CDt5ShpdABZRn8Tvi/my-quick-thoughts-on-donating-to-ea-funds-global-health-and\">post</a> somewhat related to that:</p><blockquote><p>I think there is a strong case for donating to EA Funds’ <a href=\"https://funds.effectivealtruism.org/funds/global-development\"><u>Global Health and Development Fund</u></a>&nbsp;(GHDF) if one wants to support interventions in<a href=\"https://forum.effectivealtruism.org/topics/global-health-and-development\">&nbsp;<u>global health and development</u></a>&nbsp;without attending to their<a href=\"https://forum.effectivealtruism.org/posts/vBcT7i7AkNJ6u9BcQ/prioritising-animal-welfare-over-global-health-and%23Effects_of_global_health_and_development_interventions_on_animals_are_neglected_and_unclear\">&nbsp;<u>effects on animals</u></a>. On the other hand, given this goal, I believe one had better donate to GiveWell’s<a href=\"https://www.givewell.org/all-grants-fund\">&nbsp;<u>All Grants Fund</u></a>&nbsp;(AGF) or<a href=\"https://www.givewell.org/unrestricted-fund\">&nbsp;<u>unrestricted funds</u></a>&nbsp;(GWUF), or Giving What We Can’s&nbsp;(GWWC’s)<a href=\"https://www.givingwhatwecan.org/charities/global-health-and-wellbeing-fund\">&nbsp;<u>Global Health and Wellbeing Fund</u></a>&nbsp;(GHWF). In addition, I encourage GHDF to:</p><ul><li>Let its donors know that donating to GHDF in its current form has a similar effect to donating to AGF (if that is in fact the case).</li><li>Consider appointing additional fund managers independent from GiveWell.</li><li>Consider accepting applications.</li></ul><p>In any case, the goal of this post is mostly about starting a discussion about the future of GHDF rather than providing super informed takes about it. So feel free to share your thoughts or vision below!</p></blockquote><p>However, GiveWell’s<a href=\"https://www.givewell.org/all-grants-fund\">&nbsp;<u>All Grants Fund</u></a><u> was only launched in August 2022, GWWC's </u><a href=\"https://www.givingwhatwecan.org/en-US/charities/global-health-and-wellbeing-fund\"><u>Global Health and Wellbeing Fund</u></a> was only launched in late 2023, and there might be some lag between decreased donations and decreased grants, so I do not think new competitors alone could explain GHDF's 52 % (= 1 - 4.8/10) decrease in grants from 2021 to 2022 reported by Ricardo.</p><p>Importantly, GHDF has now updated the amounts they granted in 2022 and 2023. On December 20, in agreement with Ricardo's analysis, the amounts granted in 2022 and 2023 <a href=\"https://web.archive.org/web/20231220161356/https://funds.effectivealtruism.org/funds/global-development#payout-stats\">were</a> 4.8 and 0 M$, whereas now they <a href=\"https://funds.effectivealtruism.org/funds/global-development#payout-stats\">are</a> 11 and 3.4 M$. I wonder why the amount granted in 2022 took 1 year to be updated to the correct value.</p>", "parentCommentId": "XuGDfFTeDedCnqh59", "user": {"username": "vascoamaralgrilo"}}, {"_id": "nffwviHqXozqEwXMe", "postedAt": "2024-02-12T07:45:28.223Z", "postId": "Nodk69mPSEAW2y65L", "htmlBody": "<p>Hi Ricardo,</p><p>For reference, the GHDF has now updated the amounts they granted in 2022 and 2023. On December 20, in agreement with your analysis, the amounts granted in 2022 and 2023 <a href=\"https://web.archive.org/web/20231220161356/https://funds.effectivealtruism.org/funds/global-development#payout-stats\">were</a> 4.8 and 0 M$, whereas now they <a href=\"https://funds.effectivealtruism.org/funds/global-development#payout-stats\">are</a> 11 and 3.4 M$.</p><p><a href=\"https://forum.effectivealtruism.org/users/calebp?mention=user\">@calebp</a>, I wonder why the amount granted in 2022 took 1 year to be updated to the correct value. It is also the case that it was not flagged in the website that the amount for 2022 had yet to be updated.</p>", "parentCommentId": null, "user": {"username": "vascoamaralgrilo"}}, {"_id": "feNDAJZHvH7rBow5h", "postedAt": "2024-02-12T11:44:44.055Z", "postId": "Nodk69mPSEAW2y65L", "htmlBody": "<p>Thank you Ricardo, this is an insightful analysis.\nI'd like to see more EA Forum posts with this level of investigation invested into them.\nIn particular, the balance of more longtermist and less global health funding is in contrast with other analyses on the forum.</p>\n<p>I think your write-up could be improved more than the underlying analysis.\nTo make this more accessible to others, and your work higher impact, I'd recommend the following.</p>\n<ul>\n<li>Include your most important takeaways, and less information on your methods (eg the link to the notebook) in the tl;dr. Very few of your readers will have the time to dig into your code, and those who do are also likely to read the whole post. Almost all your readers want to know about your conclusions though.</li>\n<li>Relatedly, your conclusions are quite meta (eg the stats page could be clearer), but don't highlight your important findings (eg: 2023 had a lot less money distributed, GHD is declining and LTFF is increasing).</li>\n</ul>\n", "parentCommentId": null, "user": {"username": "jooke"}}, {"_id": "BcD8yFNopuP948gtp", "postedAt": "2024-02-13T22:41:07.458Z", "postId": "Nodk69mPSEAW2y65L", "htmlBody": "<p>Quick update:&nbsp;</p><ul><li>The dashboard includes all individual giving through Giving What We Can, which is a partner of EA Funds that offers the public frontend that most people who want to donate to EA Funds see.</li><li>Some of individual donors to the different funds, particularly the largest ones, choose to donate to various funds within EA Funds through other ways, eg <a href=\"https://every.org\">every.org</a> or more idiosyncratic ways (which we're more willing to work with for larger donors).&nbsp;</li><li>We don't currently have a public dashboard to expose all of our donations, unfortunately.</li></ul>", "parentCommentId": "7Fkcj8qsBL7tbxhbR", "user": {"username": "Linch"}}]