[{"_id": "Fwckjbv4WpsAfab65", "postedAt": "2024-01-31T20:19:53.253Z", "postId": "NqnNjefZDpd6MqbWw", "htmlBody": "<p><strong>Executive summary</strong>: Conducting prioritization research by systematically evaluating multiple ideas can help identify the most promising project or organization to pursue within a cause area.</p><p><strong>Key points</strong>:</p><ol><li>Prioritization research allows you to consider many options instead of just going with the first idea, increasing the chance of finding something more impactful.</li><li>Within a high-impact cause, there can be a huge difference between a good and a great intervention, so it's important to find one of the best options.</li><li>Going through the process builds useful skills and gets better feedback compared to just having an idea.</li><li>The process involves generating a long list of ideas, filtering to a top 10 using a weighted factor model, researching the top 10 more thoroughly to get to a top 3, and finally picking one after deeper investigation.</li><li>It's important to bound how much time you'll spend researching to avoid analysis paralysis, and get feedback from experts throughout.</li><li>Doing this process with others can help you stay accountable, motivated, and get additional perspectives.</li></ol><p>&nbsp;</p><p>&nbsp;</p><p><i>This comment was auto-generated by the EA Forum Team. Feel free to point out issues with this summary by replying to the comment, and</i><a href=\"https://forum.effectivealtruism.org/contact\"><i>&nbsp;<u>contact us</u></i></a><i> if you have feedback.</i></p>", "parentCommentId": null, "user": {"username": "SummaryBot"}}, {"_id": "DR5vjZocygKvFRa5y", "postedAt": "2024-02-03T04:35:41.759Z", "postId": "NqnNjefZDpd6MqbWw", "htmlBody": "<p>Big +1 to making weighted factor model spreadsheets for decisions! They're soooo good (for small decisions too). Plus, once you've made one, you can reuse the template :) All great advice Alexandra, thanks for writing this up!</p>\n", "parentCommentId": null, "user": {"username": "Damin Curtis"}}]