[{"_id": "muv2a2bdcBXduQC5K", "postedAt": "2022-10-28T12:07:43.752Z", "postId": "NRa7ndwZ6kmtJXKqx", "htmlBody": "<p>I agree that Protect Our Future should be a lot more explicit about its agenda. While the Valerie Foushee campaign was successful the Carrick Flynn campaign failed and likely failed for reasons like distrust of PAC money.&nbsp;</p><p>It's unclear to me why the strategic decision of Protect Our Future to be this untransparent was made. Given the amount of money they spend, it was likely that it will get some public attention and the transparency made it look a bit shady.</p><p>Clear public-facing criteria would likely be helpful. It makes it clear to the media how Protect Our Future chooses its candidates. It also makes it clear to other politicians what they would need to do to get support from Protect Our Future. Given that politicians do spend a lot of time on fundraising, making it more clear to them what they would need to do to get support from Protect Our Future would likely be good.&nbsp;</p><p>Having a blog that publishes posts about candidates they decided to support and also on legislative movements that they care about it would likely be a good move while costing very little compared to the amount of money that Protect Our Future spends.</p>", "parentCommentId": null, "user": {"username": "ChristianKleineidam"}}, {"_id": "CtSK4bNX2f7c7moMe", "postedAt": "2022-10-28T13:47:15.313Z", "postId": "NRa7ndwZ6kmtJXKqx", "htmlBody": "<p>A few quick points:</p><ul><li>My guess would be that PoF's limited commentary on candidates is because they don't have enough staff resources to give detailed commentary, and/or to talk to the media &nbsp;in every state race where they are involved.</li><li>I imagine they run ads on certain topics (i.e. not just pandemic prevention) because those are the ones that voters care about, i.e. just to help their candidate to win.&nbsp;</li><li>I expect they rarely go \"negative\" for the same reasons as most groups - because it's not effective enough to be worth making enemies of the other candidates.</li></ul><p>Now what about the main point of your post? I think we could divide the problems you identify into two buckets: (1) dem voters thinking PoF is bad, (2) folks reading thinking EA is bad. Regarding (1), I agree that these happen to some extent, given PoF's current strategy, but am less sure how to solve them. To some extent, it is easier to provide a rationale for each candidate once they have a track record, which will be true when more pandemic preparedness bills have been voted on. Re criteria for evaluating candidates, I think there are potential problems, in that the nature of pandemic preparedness legislation can change a lot over time, so it's hard to fit your desiderata on a checklist. And it's not clear that you would want to elevate their prominence in that kind of way, because it could turn it into a more partisan or factional issue, which is not currently desired. So this part might not be so easy. As for funding source, I thought it was known to be <a href=\"https://www.businessinsider.com/bankman-fried-brothers-protect-our-future-pandemic-prevention-pac-crypto-2022-8?r=US&amp;IR=T\">almost entirely</a> from SBF? Regarding (2), maybe this is counterbalanced a bit by the broader media about EA and longtermism in regard to Macaskill's latest book. I expect most will hear about EA in other ways!</p><p>Anyway, tough problems, but I think relatively unclear solutions. Still, nice post!</p>", "parentCommentId": null, "user": {"username": "RyanCarey"}}, {"_id": "xrmrKkF6RZRYZetxK", "postedAt": "2022-10-28T14:10:36.004Z", "postId": "NRa7ndwZ6kmtJXKqx", "htmlBody": "<p>Thanks for writing this! I'm quite sympathetic to the point that political spending is likely to have second-order political and reputational effects for EA that are complicated and not currently well-theorized (at least in any sort of public setting).&nbsp;</p><p><br>Something I'd be curious to learn more about as an outsider to NC politics is a brief summary of background on the different candidates in the race and why one candidate might be better/worse than another. Friends of mine in progressive politics have expressed frustration with Protect Our Future supporting candidates they think are substantively unqualified and unserious about pandemic preparedness. From my perspective, in understanding decision-making here, it'd be helpful to know context around whether there were (for example) (1) multiple basically similar candidates and one said the right thing about pandemic preparedness, (2) differently qualified candidates and POF supported the better/worse one, or (3) candidates that were more left/right and POF supported the left/right one.</p>", "parentCommentId": null, "user": {"username": "joshcmorrison"}}, {"_id": "XfHDu4DPrcc2WAdnD", "postedAt": "2022-10-28T14:32:55.039Z", "postId": "NRa7ndwZ6kmtJXKqx", "htmlBody": "<p>This comment seems to be generating substantial disagreement. I'd be curious to hear from those who disagree: which parts of this comment do you disagree with, and why?</p>", "parentCommentId": "muv2a2bdcBXduQC5K", "user": {"username": "Zachary Brown"}}, {"_id": "YHhvpFGjeZmeS5cz4", "postedAt": "2022-10-28T16:40:24.964Z", "postId": "NRa7ndwZ6kmtJXKqx", "htmlBody": "<p>Not sure but I think the Flynn campaign result was more likely an outcome of the fundamentals of the race: a popular, progressive, woman of color with local party support who already represented part of the district as a state rep and helped draw the new congressional district was way more likely to win over someone who hadn't lived there in years and had never run a political campaign before.&nbsp;</p>", "parentCommentId": "XfHDu4DPrcc2WAdnD", "user": {"username": "Peter Gebauer"}}, {"_id": "EaitAnwuPcnRdA26c", "postedAt": "2022-10-28T16:43:56.327Z", "postId": "NRa7ndwZ6kmtJXKqx", "htmlBody": "<p>I like the idea of Protect Our Future being more transparent about how and why they make endorsements. Giving a specific list of ways they evaluate candidates would be helpful for people to understand their actions. I also worry a little bit that this would make it easy to game their endorsement process or encourage political stunts that are more about drawing attention than doing something useful. But I'm not sure how big of a worry this should be.</p>", "parentCommentId": null, "user": {"username": "Peter Gebauer"}}, {"_id": "jFLdy3qHt2nxyrYkk", "postedAt": "2022-10-28T18:14:58.415Z", "postId": "NRa7ndwZ6kmtJXKqx", "htmlBody": "<p>Hi, I'm also a voter in the 4th district- I don't really consider myself a proper EA though but agree with some of the ideas. Foushee did not talk about pandemic preparedness much at all in her campaign. The understanding of me, and most other people in the district whom I have talked to, was that ulterior motives were behind the Foushee endorsement rather than any specific policy stance. Specifically I've heard a lot of people suspecting it was about crypto support (which seems odd, Foushee isn't particularly pro-crypto and if you wanted to turn a candidate pro-crypto, I don't see why you would start with her). I think it's more likely a bid for \"political influence\" more generally by copying endorsements by other groups currying favor with mainstream dems like AIPAC. From solely an EA lens, Foushee is a very odd endorsement. There were two candidates who split the climate vote/endorsements: Ashley Ward, a climate scientist running a single-issue campaign (whom I voted for), and Nida Allam, the most serious challenger, running a very progressive (Squad-esque) campaign with a big climate plank. I know climate change is not a major EA issue for most but I would have assumed that that would be a big determining factor, since it was the only issue I know of a strong EA stance on that really came up in the race. There were a few foreign policy considerations (Foushee has a mainstream Dem view of Israel like I think many EAs do, Allam tends to go further with her support of Palestine) &nbsp;but I don't really understand how those (and this supposed pandemic preparedness stance) &nbsp;are important enough to outweigh climate concerns. One additional piece of info on the race that might be useful: Ward's campaign got going pretty late, so I can't blame SBF too much if he wasn't expecting that she would get a decent amount of the vote. Clay Aiken was also in the running but he's despised among local Dems that I have talked to.</p><p>Summary: Foushee isn't particularly EA-aligned, the motives probably have more to do with strengthening Dem mainstream than any particular issue. Bad move by SBF, in my opinion.</p><p>Edit: I guess I should cover qualifications too. Foushee's part of a local political family, has been in the state gov a while, has name recognition. Allam is an elected official from Durham, the largest town in the district, with somewhat less experience. Ward, Aiken, and Crystal Cavalier all have never held office before.</p>", "parentCommentId": "xrmrKkF6RZRYZetxK", "user": {"username": "Anonymous (for now)"}}, {"_id": "B4HnPMbaaRk6RewFL", "postedAt": "2022-10-28T18:47:34.128Z", "postId": "NRa7ndwZ6kmtJXKqx", "htmlBody": "<p>I strongly agree. SBF and Future Fund don't seem to have any track record in party politics. Given the massive reputational risks to EA that might not be easily fixable, I think their political advocacy should be closely scrutinized and possibly slowed to build up more capacity before engaging.&nbsp;</p><p>My perception is informed by the Flynn campaign, which seemed to have important failures. Local political leaders <a href=\"https://forum.effectivealtruism.org/posts/FG9JJmAYDq9Ghuudg/some-potential-lessons-from-carrick-s-congressional-bid?commentId=iqz5mjaw5eB8MSzs4#comments\">criticized</a> the campaign for failing engage with local media and elected officials. They spent more an <a href=\"https://www.wweek.com/news/state/2022/05/14/crypto-billionaires-super-pac-goes-negative-in-final-days-of-oregon-congressional-primary/\">$800,000 on an attack ad</a> calling the eventual winner of the race a \"lobbyist for a corporation accused of driving up drug prices\", but many EAs now believe that claim was \"<a href=\"https://forum.effectivealtruism.org/posts/FG9JJmAYDq9Ghuudg/some-potential-lessons-from-carrick-s-congressional-bid?commentId=9fKLbufDuDnRhcbpf\">very misleading</a>\". They received plenty of negative <a href=\"https://www.wweek.com/news/2022/05/04/carrick-flynn-says-hes-no-instrument-of-crypto-cash/\">local</a> media <a href=\"https://www.opb.org/article/2022/04/25/what-does-a-crypto-tycoon-want-with-oregons-new-congressional-district/\">coverage</a>. They did manage to secure a $1M donation from a PAC aligned with Nancy Pelosi, and building relationships with mainstream Democrats seems to be part of the strategy in supporting Foushee. This could be a useful strategy, but also risks associating EA with corrupt big money party politics.&nbsp;</p><p>I've signed up for fundraising emails from the EA Donor Network organized following the Flynn campaign. They've recommended two candidates so far, Victoria Gu and Seth Magaziner in Rhode Island, both with single paragraph explanations of why the candidates are worth supporting. When I emailed back looking for more information about why we should donate to these candidates, I received a response to my first email but not a second. To be clear, I'm not really looking for an explanation via private emails -- I'd like EA political work to adopt the same standards of transparency and rigorous analysis that have powered EA success in other domains.&nbsp;</p>", "parentCommentId": "muv2a2bdcBXduQC5K", "user": {"username": "Aidan O'Gara"}}, {"_id": "43PfufsjGWYr8PAwL", "postedAt": "2022-10-28T20:47:12.737Z", "postId": "NRa7ndwZ6kmtJXKqx", "htmlBody": "<p>Thanks so much for providing this explanation of the candidates! As another comment pointed out, I probably should have put that in the original post, so I really appreciate you taking the time to provide that context.&nbsp;</p>", "parentCommentId": "jFLdy3qHt2nxyrYkk", "user": {"username": "NC_EA"}}, {"_id": "XqacXh5K3NLp4ahuC", "postedAt": "2022-10-28T20:58:26.789Z", "postId": "NRa7ndwZ6kmtJXKqx", "htmlBody": "<p>For onlookers, just to comment on one small piece of this,<strong> in early Oct 2022, SBF gave signals of updating/backed off on his spend (\"billion dollar donation figure\").&nbsp;</strong></p><ul><li><a href=\"https://www.politico.com/newsletters/morning-money/2022/10/14/billion-dollar-slip-up-why-bankman-fried-is-rethinking-election-spending-00061809\">https://www.politico.com/newsletters/morning-money/2022/10/14/billion-dollar-slip-up-why-bankman-fried-is-rethinking-election-spending-00061809</a></li><li><a href=\"https://www.cnbc.com/2022/10/14/sam-bankman-fried-backtracks-from-1-billion-political-donation.html\">https://www.cnbc.com/2022/10/14/sam-bankman-fried-backtracks-from-1-billion-political-donation.html</a></li><li><a href=\"https://www.theatlantic.com/technology/archive/2022/10/sam-bankman-fried-crypto-ftx-2022-midterms/671823/\">https://www.theatlantic.com/technology/archive/2022/10/sam-bankman-fried-crypto-ftx-2022-midterms/671823/</a></li></ul><p>This was picked up by 10-20 outlets, suggesting this was an active signal from SBF.</p><figure class=\"image\"><img src=\"https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/d7c184a1042c1a8eada13b622697a2888d7aadb9fa82a9fe.png\" srcset=\"https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/d7c184a1042c1a8eada13b622697a2888d7aadb9fa82a9fe.png/w_147 147w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/d7c184a1042c1a8eada13b622697a2888d7aadb9fa82a9fe.png/w_227 227w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/d7c184a1042c1a8eada13b622697a2888d7aadb9fa82a9fe.png/w_307 307w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/d7c184a1042c1a8eada13b622697a2888d7aadb9fa82a9fe.png/w_387 387w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/d7c184a1042c1a8eada13b622697a2888d7aadb9fa82a9fe.png/w_467 467w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/d7c184a1042c1a8eada13b622697a2888d7aadb9fa82a9fe.png/w_547 547w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/d7c184a1042c1a8eada13b622697a2888d7aadb9fa82a9fe.png/w_627 627w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/d7c184a1042c1a8eada13b622697a2888d7aadb9fa82a9fe.png/w_707 707w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/d7c184a1042c1a8eada13b622697a2888d7aadb9fa82a9fe.png/w_787 787w\"></figure>", "parentCommentId": "B4HnPMbaaRk6RewFL", "user": {"username": "Charles He"}}, {"_id": "jF6eGxJfhvGshWQbw", "postedAt": "2022-10-28T21:56:48.384Z", "postId": "NRa7ndwZ6kmtJXKqx", "htmlBody": "<p>Thanks for this thoughtful, constructive, and informative post, and for the very reasonable proposed changes.</p><p>I agree that it's very important for EA and EA-adjacent organizations not to become politically partisan, or to be perceived as partisan. This is much more difficult than ever before, given that almost every issue becomes polarized on social media -- even if the issue has no intrinsic political or moral connection to either party.</p><p>IMHO, if the ultimate goal of PoF is to get candidates elected who support constructive, rational, well-informed crypto regulation that helps the crypto industry grow and flourish, it's OK to be open and transparent about that, and to support candidates of any party who are aligned with that mission.</p><p>I think crypto should get more attention in EA, and should maybe be considered a moderately cause areas for EAs, given its potential to increase access to financial services, secure digital identities, property rights, etc -- especially among the billions of people with minimal access to banking or secure digital records. If we're serious about reducing global poverty and improving global public health, then crypto replacements for the current banking system and the current medical records system could be useful. Unfortunately, many folks, including many EAs, seem to think crypto is nothing more than Bitcoin as a 'digital store of value', plus a bunch of shady crypto scams and cute NFTs.&nbsp;</p><p>So, I would love to see more money spent on public education and legislator education about crypto (or pandemic preparedness, or AI X-risks, or whatever PoF or FTX or Future Fund &nbsp;wants to prioritize).</p>", "parentCommentId": null, "user": {"username": "geoffreymiller"}}, {"_id": "r8HiNPBgDbGShKWf4", "postedAt": "2022-10-29T02:27:40.338Z", "postId": "NRa7ndwZ6kmtJXKqx", "htmlBody": "<p>I realise this is counterintuitive, but they are not focussed on Israel, or on centrist dems vs progressive dems - they have supported dems from all (edit:almost all) over the spectrum (I believe related groups have donated in republican primaries as well). And you can see that the version of EA that they're interested in doesn't focus on <a href=\"https://ftxfuturefund.org/area-of-interest/\">climate</a> either. It seems to me that it's either pandemics, if you believe them, or general influence if you don't, I don't see how anything else really makes sense.</p>", "parentCommentId": "jFLdy3qHt2nxyrYkk", "user": {"username": "RyanCarey"}}, {"_id": "SckxMhfcx8dG2Dd3d", "postedAt": "2022-10-29T13:04:56.407Z", "postId": "NRa7ndwZ6kmtJXKqx", "htmlBody": "<p>What Squad-esque members did POF support?</p>", "parentCommentId": "r8HiNPBgDbGShKWf4", "user": {"username": "ChristianKleineidam"}}, {"_id": "4WGdGmFntiAH5exSc", "postedAt": "2022-10-29T13:13:29.175Z", "postId": "NRa7ndwZ6kmtJXKqx", "htmlBody": "<p>Andrea Salinas got 36% of the vote while Carrick Flynn got 18%. I think it's pretty clear, that Flynn would have gotten more votes if he wouldn't have been perceived by the press as being funded by ill-intentioned corporate money.&nbsp;</p><p>Whether that would have been enough to get double the amount of votes is unclear but I don't think the available data suggest that this isn't in the realm of what would have been possible.&nbsp;</p>", "parentCommentId": "YHhvpFGjeZmeS5cz4", "user": {"username": "ChristianKleineidam"}}, {"_id": "defE8Fzo3rKwMwkHF", "postedAt": "2022-10-29T13:41:29.280Z", "postId": "NRa7ndwZ6kmtJXKqx", "htmlBody": "<p>I'm not saying they supported any candidates from the leftmost 5% of the party - and I doubt those would accept the funds if offered. Just that they supported people who ran to the left of their primary opponents (like Jasmine Crockett), not just to the right. It's not a left/right thing.</p>", "parentCommentId": "SckxMhfcx8dG2Dd3d", "user": {"username": "RyanCarey"}}, {"_id": "cNkjhyQDDp2ujHiFv", "postedAt": "2022-10-30T03:16:00.767Z", "postId": "NRa7ndwZ6kmtJXKqx", "htmlBody": "<p>Well to be fair I didn't say it was impossible, just that the outcome probably had more to do with the fundamentals of the race. It may have had a negative effect yes, but plenty of candidates win in races despite being supported by all kinds of PACs and having negative press about it.&nbsp;<br><br>Having more connections within the state for support and donations and highlighting those would have helped blunt negative attacks about PAC funding, for example.&nbsp;</p>", "parentCommentId": "4WGdGmFntiAH5exSc", "user": {"username": "Peter Gebauer"}}, {"_id": "PkkJLKFdyFNCCiYz6", "postedAt": "2022-10-30T03:17:50.185Z", "postId": "NRa7ndwZ6kmtJXKqx", "htmlBody": "<p>Well squad-esque seems like an odd litmus test since there are many other progressive members of congress than them but POF did support Maxwell Frost who won.&nbsp;</p>", "parentCommentId": "SckxMhfcx8dG2Dd3d", "user": {"username": "Peter Gebauer"}}]