[{"_id": "bCpyYpwqtFTHnhXKM", "postedAt": "2014-12-01T17:18:38.786Z", "postId": "NrM5J7GwmELMH3iof", "htmlBody": "<p>Do GiveWell provide recordings of some interviews? I thought they just uploaded write-ups.</p>\n", "parentCommentId": null, "user": {"username": "RyanCarey"}}, {"_id": "oFRAc6WjoQ5K4vZLb", "postedAt": "2014-12-01T17:39:46.768Z", "postId": "NrM5J7GwmELMH3iof", "htmlBody": "<p>They used to do audio interviews (you can see a bunch from 2009 on that page), but now they now only put up written notes as far as I can see.</p>\n", "parentCommentId": "bCpyYpwqtFTHnhXKM", "user": {"username": "Robert_Wiblin"}}, {"_id": "GZ4p4m8uuv4WZED5Z", "postedAt": "2014-12-01T17:41:15.012Z", "postId": "NrM5J7GwmELMH3iof", "htmlBody": "<p>There are some audio recordings of interviews from 2009 <a href=\"http://www.givewell.org/international/technical/additional/conversations-with-experts\">here</a>.</p>\n", "parentCommentId": "bCpyYpwqtFTHnhXKM", "user": {"username": "Bitton"}}, {"_id": "68EB77E9DfEpe2pwf", "postedAt": "2014-12-01T18:20:30.677Z", "postId": "NrM5J7GwmELMH3iof", "htmlBody": "<p>I would listen to this podcast! I also think it would be helpful to other people and a good promotional tool for EA (podcasts are highly underrepresented compared to blogs in EA).</p>\n<p>I think you could easily avoid overlapping with GiveWell's conversations.</p>\n<p>You could probably arrange to meet someone who has radio/podcasting experience and would be interested in helping get things set up.</p>\n", "parentCommentId": null, "user": {"username": "Ben_Kuhn"}}, {"_id": "EkKSoDyYcnh5GNgbu", "postedAt": "2014-12-01T18:55:25.069Z", "postId": "NrM5J7GwmELMH3iof", "htmlBody": "<p>This sounds like a really neat project. A few questions: </p>\n<ul>\n<li>Would you want to include editing? Music?</li>\n<li>What length would you want to target? 1 hour? 20 minutes?</li>\n<li>Any idea of what line of questioning you might pursue? Impact metrics? Career plans? Hobbies? Personal philosophy? All of the above?</li>\n</ul>\n", "parentCommentId": null, "user": {"username": "kdbscott"}}, {"_id": "nQxCSwhFrDrNzZQXm", "postedAt": "2014-12-01T19:08:55.879Z", "postId": "NrM5J7GwmELMH3iof", "htmlBody": "<p>It seems like it would be easy to do a few, see how it goes, and then decide to drop it, continue it, or scale it.</p>\n<p>I think this is definitely worth someone's time to get running; less sure if it's worth your time in particular -- would need consideration of comparative advantage.</p>\n", "parentCommentId": null, "user": {"username": "Peter_Hurford"}}, {"_id": "ucEk3yMSmKbbmkRLM", "postedAt": "2014-12-01T19:34:23.526Z", "postId": "NrM5J7GwmELMH3iof", "htmlBody": "<p>I expect we would add an intro theme at some point - perhaps a song with relevant lyrics.</p>\n<p>I would let the length vary quite a bit from 15 to 60 minutes depending on the person.</p>\n<p>My guess is that I would mostly get people to describe what exactly they are doing and why they do it that way. Perhaps then a bit about what drives them personally. Here's an example: <a href=\"http://www.econtalk.org/archives/2011/08/odonohoe_on_pot.html\">http://www.econtalk.org/archives/2011/08/odonohoe_on_pot.html</a></p>\n<p>Another line of podcasts would speaking to people about their prioritisation research. But to begin with I would rather talk to people doing things directly rather than working in meta-charity.</p>\n", "parentCommentId": "EkKSoDyYcnh5GNgbu", "user": {"username": "Robert_Wiblin"}}, {"_id": "FTuC5uXt36cS3k6tL", "postedAt": "2014-12-01T22:02:25.222Z", "postId": "NrM5J7GwmELMH3iof", "htmlBody": "<p>You might consider having a look at <a href=\"http://www.flamingswordofjustice.com/\">http://www.flamingswordofjustice.com/</a> . It's a podcast of interviews with activists of various types (pretty left-wing). I've listened to a few episodes and found it interesting. It was the closest thing I could think of that already exists.</p>\n", "parentCommentId": null, "user": {"username": "Nick_Beckstead"}}, {"_id": "XDSJQbSzt5YwvKoZ5", "postedAt": "2014-12-01T23:45:28.208Z", "postId": "NrM5J7GwmELMH3iof", "htmlBody": "<p>1) I think this is a good use of time, because podcasts are an increasingly relevant medium and I don't know of any that fill the niche you are looking for.</p>\n<p>2) I have recently been planning a podcast of my own along almost exactly the same vein, taking inspiration from EconTalk as well as The Tim Ferriss Show (which involves interviews with &quot;peak performers&quot; and other highly successful people to see how they work). </p>\n<p>I do not have podcasting experience but I have listened to numerous podcasts for inspiration and in classic EA fashion I've been overthinking the heck out of it, so if you are interested I can share my thoughts with you directly. I have also invested in a microphone and basic editing software to record some initial conversations and test the waters. Very low profile and preliminary right now, you can probably find better, but I am here and willing to lend my manpower.</p>\n", "parentCommentId": null, "user": {"username": "AlexCuevas"}}, {"_id": "ufCvwc3p4N3xme9pC", "postedAt": "2014-12-02T00:57:35.160Z", "postId": "NrM5J7GwmELMH3iof", "htmlBody": "<p>I would listen to the podcast, and I also think it is worth spending some time on. The closest thing I listen to is Development Drums (<a href=\"http://developmentdrums.org/\">http://developmentdrums.org/</a>) which is excellent and technically fairly simple, following a very similar format to the one you have suggested. </p>\n<p>It's definitely worth thinking about how what you are doing would be different to what other EA groups are doing, and not just other podcasts but also other media through which various groups publish. My suggestion would be that it is something which is less explicitly EA than something like this forum, than Giving What We Can, than the facebook group - because there are already forums for the EA core to discuss issues and a podcast is unlikely to be the best environment for it in any case, and because I think we want to be reaching related groups rather than just ourselves (the sorts of movements that people who studied economics, philosophy or social science at university or who identify as generally progressive/left politically). I like the idea of a broader range of topics than current full time EA groups are investigating. Maybe (if you are doing it), it could overlap with OvercomingBias? </p>\n", "parentCommentId": null, "user": {"username": "ChrisSmith"}}, {"_id": "aGRKNG8mJfaxWpYhe", "postedAt": "2014-12-02T03:51:09.404Z", "postId": "NrM5J7GwmELMH3iof", "htmlBody": "<p>I like this idea! I predict I'd watch this significantly more often if it were a video series (say, on Youtube) rather than an audio podcast, though.</p>\n", "parentCommentId": null, "user": {"username": "RobBensinger"}}, {"_id": "zwY6Wuse9ZEDLYHfu", "postedAt": "2014-12-04T20:58:32.396Z", "postId": "NrM5J7GwmELMH3iof", "htmlBody": "<p>I can put you in contact with an EA who has experience with podcasts if you would like. </p>\n", "parentCommentId": null, "user": {"username": "Joey"}}, {"_id": "NvevJeL858SAjFScH", "postedAt": "2014-12-04T21:08:25.448Z", "postId": "NrM5J7GwmELMH3iof", "htmlBody": "<p>I think this is a great idea! I myself am a huge fan of podcasts, as I have relatively large amounts of ear time. My impression is that it might be true for a lot of EAs and, more importantly, the non-EA target audience.</p>\n<p>I was considering a podcast as a potential project for Harvard EA, but haven't found anyone suitable and don't think I would be a good fit.</p>\n<p>As for GiveWell's conversations page, I wouldn't think of it as a substitute. The interviews are great, but I rarely find time to read them.</p>\n<p>I second EconTalk as a good model. I would also recommend In Our Time (slightly different, multiple guests, but worth checking out). I also think the two rationalist podcasts - Rationally Speaking and Lukeprog's &quot;Conversations from the Pale Blue Dot&quot; do a pretty good job and might be closer to a realistically attainable level in the short term.</p>\n<p>Good luck!</p>\n", "parentCommentId": null, "user": {"username": "Ales_Flidr"}}, {"_id": "o4yFTS6KYcKnr8yZ7", "postedAt": "2014-12-04T23:25:42.288Z", "postId": "NrM5J7GwmELMH3iof", "htmlBody": "<p>If I made half a dozen and set up the infrastructure, do you think someone from EA Harvard could be interested to take it over?</p>\n", "parentCommentId": "NvevJeL858SAjFScH", "user": {"username": "Robert_Wiblin"}}]