[{"_id": "ZCugSMnbBLKbQFytp", "postedAt": "2023-09-10T18:10:22.329Z", "postId": "NsASybJ8rmsqsCSwm", "htmlBody": "<p>i’d recommend reading the following for people interested by this - <a href=\"https://www.foreignaffairs.com/china/illusion-chinas-ai-prowess-regulation\">https://www.foreignaffairs.com/china/illusion-chinas-ai-prowess-regulation</a></p>\n", "parentCommentId": null, "user": {"username": "AryanYadav"}}, {"_id": "bqGAJzMCbJgawFepE", "postedAt": "2023-09-10T18:20:25.083Z", "postId": "NsASybJ8rmsqsCSwm", "htmlBody": "<p>It might be helpful to also think of China's compute access in a world where they invade Taiwan. I don't think this should be weighed highly IMO but still seems personally useful to work through.&nbsp;</p>", "parentCommentId": null, "user": {"username": "AryanYadav"}}, {"_id": "aGWuBHH7TmorjFmPn", "postedAt": "2023-09-10T19:38:07.598Z", "postId": "NsASybJ8rmsqsCSwm", "htmlBody": "<p>I heard that chip fabs/factories are extremely soft targets and would be destroyed by the losing side either way. This is definitely the right kind of way to think about this though.</p>", "parentCommentId": "bqGAJzMCbJgawFepE", "user": {"username": "trevorw96"}}, {"_id": "3CZZFPgzrfNbXJh6Q", "postedAt": "2023-09-10T21:26:03.578Z", "postId": "NsASybJ8rmsqsCSwm", "htmlBody": "<p>Even if it's developed in the US, you should expect China to steal it.</p>\n<blockquote>\n<p>[FBI director Christopher Wray] said China deployed cyber espionage to \"cheat and steal on a massive scale\", with a hacking programme larger than that of every other major country combined.</p>\n</blockquote>\n<p><a href=\"https://www.bbc.com/news/world-asia-china-62064506\">https://www.bbc.com/news/world-asia-china-62064506</a></p>\n", "parentCommentId": null, "user": {"username": "chinscratch"}}, {"_id": "kbMZvFjqqYiXXbKyp", "postedAt": "2023-09-10T22:18:43.982Z", "postId": "NsASybJ8rmsqsCSwm", "htmlBody": "<p>And largely China doesn't even need to steal it—some labs publish their research and share their models! But yeah, this is a subquestion for the \"To what extent does US AI progress boost Chinese AI progress (via e.g. publishing research or leaking insights)\" crux.</p>", "parentCommentId": "3CZZFPgzrfNbXJh6Q", "user": {"username": "zsp"}}, {"_id": "YiPNRcxLbptfqwdYz", "postedAt": "2023-09-11T10:21:34.206Z", "postId": "NsASybJ8rmsqsCSwm", "htmlBody": "<blockquote><p>I suspect some people have a good sense of the extent to which AI regulation would be extraterritorialized and what that depends on, and some people have a good sense of the extent to which labs can effectively hop regulatory jurisdictions and what that depends on. If you know, please let me know!</p></blockquote><p>One thing it probably depends on is regulation around (mega-sized) data centers and where they are located. Konstantin Pilz wrote a report on data centers which points out some geographical and economical constraints on where it makes sense to build them at scale. For instance, outside the US, maybe Canada or Mexico would be good options (but other countries as well). (I'm not sure if it's necessary for much of lab infrastructure to be right next to a mega-sized data center, or if data can be handled remotely, but even if you're moving your lab to some other location, you need to figure out the compute availability <i>somewhere</i>.)<br><br>I'd imagine it to be somewhat likely for Canada to follow US legislation if it seems reasonably motivated and if the US puts in an effort to make it happen; I'm more uncertain about US influence on other jurisdictions.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Lukas_Gloor"}}]