[{"_id": "iZqkyLrjzrDEHFayw", "postedAt": "2023-01-13T19:22:43.387Z", "postId": "NspobEfHvzbHFufP8", "htmlBody": "<p>There's no slam-dunk either way  that I'm aware of. The closest example irl I've seen is the issue of cluster headaches - some people who have it question whether life is worth living with the condition.\n<a href=\"https://www.happierlivesinstitute.org/report/global-priority-pain/\">https://www.happierlivesinstitute.org/report/global-priority-pain/</a></p>\n<p>Given the differing intuitions, I think the approach that HLI has done with its recent charity evaluations is pretty useful: assuming that existence and non-existence are comparable (which is a significant assumption), how would the comparative effectiveness on wellbeing interventions differ based on where on a 0-10 scale would one place the neutral point?</p>\n<p><a href=\"https://www.happierlivesinstitute.org/2022/11/24/2022-charity-recommendation/\">https://www.happierlivesinstitute.org/2022/11/24/2022-charity-recommendation/</a></p>\n<p><a href=\"https://www.happierlivesinstitute.org/key-ideas/#5_Will_our_priorities_change\">https://www.happierlivesinstitute.org/key-ideas/#5_Will_our_priorities_change</a></p>\n", "parentCommentId": null, "user": {"username": "Dhruv Makwana"}}, {"_id": "nhePb94JqJaRaT9Kx", "postedAt": "2023-01-15T14:43:32.424Z", "postId": "NspobEfHvzbHFufP8", "htmlBody": "<p>Not a philosopher either, but this is the way I think about this issue intuitively, using personal experience:</p><ol><li>Think about the last properly negative experience you had. It could just be a couple of days with the flu or a bad headache or a horribly embarrassing social experience.&nbsp;</li><li>Imagine we have a technology that allows you to 'skip' specific experiences- your body 'experiences' it but your conscious self completely skips the experience, as if you were under general anaesthetic, and you wake up after it has passed. Given the choice of a) enduring the same experience from 1. again, or b) 'skipping' the experience- which would you choose?</li></ol><p>I think most people would 'skip' anything over a certain level. At the very least, you'd use it for extreme pain, like general anaesthesia for invasive operations. I see the 'non-experience' of a general anaesthetic as equivalent to death here (assuming that both are simply the absence of experience). So I'd take this choice to mean that we'd rather be dead than endure a &nbsp;sufficiently negative experience. I think this personal preference is pretty good evidence about a more general moral rule. &nbsp;It strikes me as incredibly unlikely that it's a morally correct action to not give someone anaesthetic in order to allow them to experience those hours of suffering, and we can extrapolate from this. &nbsp;&nbsp;</p><p>Now can we think about 'lives not worth living' in this way? The way I see it is that if I would just skip an experience, it is just below my neutral point (probably 5.5/10 ish on a happiness scale), therefore anyone who is likely to have an average experience below this probably has a net-negative life not worth living. There's no reason why it would make a difference whether this horrible experience would be the next or the last experience in my life, I'd choose to skip it either way, so I'm happy with euthanasia. I might even be willing to 'skip' days or weeks of average life around a horrible experience, just in order to avoid that experience, so a longer period of time can be net-negative, even if there are positive moments in there. This means that the life of someone near death whose last experiences would be agonising is definitely net-negative, and, in my view, not worth living.&nbsp;</p><p>The only rational counterargument seems to be that there's actually something really, really bad about non-experience, and/or our most agonising experiences are actually better than we think. This seems almost impossible to defend. I'd actually agree with <a href=\"https://en.wikipedia.org/wiki/David_Benatar\">David Benatar </a>and say that we're probably biased in favour of thinking many experiences are net-positive when they're not- therefore many fewer lives are worth living than we think.</p>", "parentCommentId": null, "user": {"username": "Dzoldzaya"}}]