[{"_id": "FkpfinkZgiJ5CTcpW", "postedAt": "2022-09-28T03:10:34.721Z", "postId": "NTuTSEEn2Ka54nwFC", "htmlBody": "<p>I forgot to mention in the body, but I should thank Yonatan for putting a draft of this together and encouraging me to post it. Thanks! I've been meaning to do this for a while.</p>", "parentCommentId": null, "user": {"username": "dan.pandori"}}, {"_id": "K6nQyYDL3pGHQQw68", "postedAt": "2022-09-28T17:54:18.362Z", "postId": "NTuTSEEn2Ka54nwFC", "htmlBody": "<p>If there's too much demand for this, I'd also be willing to do these.&nbsp;</p><p>When I was interviewing at big tech companies, it helped that I had 3 roommates who worked for Google. In general it seems like EAs who want to work for big tech but don't have existing connections to it are disadvantaged. That seems suboptimal. I'm glad you made this post.&nbsp;</p>", "parentCommentId": null, "user": {"username": "andrew_richardson"}}, {"_id": "nHWcght3p7EE8p8hj", "postedAt": "2022-09-28T17:55:12.134Z", "postId": "NTuTSEEn2Ka54nwFC", "htmlBody": "<p>Thanks! Current volume is reasonable but I will totally forward some your way if I get overwhelmed.</p>", "parentCommentId": "K6nQyYDL3pGHQQw68", "user": {"username": "dan.pandori"}}, {"_id": "B5XeHhRwRAqje4xfy", "postedAt": "2022-09-29T02:48:29.287Z", "postId": "NTuTSEEn2Ka54nwFC", "htmlBody": "<p><i>While not directly related, this post gives an opportunity to ask question that are interesting and might benefit others:</i></p><p><strong>How would an aligned EA working on something approximately EA, recruit and judge other SWE EAs for a software role?</strong></p><ul><li>Would you use leetcode or a similar puzzle style of coding, or pair programming or some kind of assignment based project?</li><li>What if I wanted to recruit someone better or more senior than me (by a moderate margin)? How would I go about this?&nbsp;</li></ul><p><strong>What have you found surprising about recruiting or building a team for a small project?&nbsp;</strong></p><ul><li>(I think this is hard or a big topic. For example, SWE is a lot about architecture/vision/design decisions that often take on a social/cultural aspect.)<br>&nbsp;</li></ul><p>One reason I'm asking is that I’m assuming the answers might be different than normal, because there might be differences/advantages in having an EA recruit an EA.&nbsp;</p><p>(On the other hand, there's probably reasons and examples that are evidence against this).&nbsp;<br>&nbsp;</p>", "parentCommentId": null, "user": {"username": "Charles He"}}, {"_id": "vByMGbavNZ5q3Lvc7", "postedAt": "2022-09-29T02:49:06.030Z", "postId": "NTuTSEEn2Ka54nwFC", "htmlBody": "<p>Interested in <a href=\"https://forum.effectivealtruism.org/posts/NTuTSEEn2Ka54nwFC/offering-faang-style-mock-interviews?commentId=B5XeHhRwRAqje4xfy\">answering these questions</a>?</p>", "parentCommentId": "K6nQyYDL3pGHQQw68", "user": {"username": "Charles He"}}, {"_id": "65xzrepCoc4bJXeMJ", "postedAt": "2022-09-29T02:54:56.758Z", "postId": "NTuTSEEn2Ka54nwFC", "htmlBody": "<p>My priors:</p><ol><li>It's mostly the same as a normal org hiring, besides things about value alignment (which are a whole other story)</li><li>If I'd have to hire someone more senior than me, I'd ask someone more senior than me to help interviewing. EA has some pretty senior people. (just referred one of them to this comment, maybe he'll reply)</li></ol>", "parentCommentId": "B5XeHhRwRAqje4xfy", "user": {"username": "hibukki"}}, {"_id": "D8ayZiWKkz8GrxBoK", "postedAt": "2022-09-29T05:51:48.963Z", "postId": "NTuTSEEn2Ka54nwFC", "htmlBody": "<ol><li>It depends a lot on what I'm hiring for and what the candidate's background is. If it's an ML job, I ask ML programming and design questions, but if I'm hiring someone to do networking, I'll ask a question about distributed algorithms or something. This is in contrast to how Google hires, because they're hiring generic SWEs so they don't care a lot about the particulars.&nbsp;</li><li>If I had to hire someone more senior, I would reach out to other more senior people who I trust to ask them for help.</li><li>For a small team, generalism can be more important than it seems.</li></ol>", "parentCommentId": "B5XeHhRwRAqje4xfy", "user": {"username": "andrew_richardson"}}, {"_id": "Z5mCCYfk8sTKoaade", "postedAt": "2022-09-29T06:05:08.567Z", "postId": "NTuTSEEn2Ka54nwFC", "htmlBody": "<p>Thanks for the answers, this makes a lot of sense.<br><br>Can you be specific about #1? For example, what format of programming tests would you prefer to give to a generalist engineer?&nbsp;<br><br>By the way, do you mean something special or \"hands on\" for ML programming or design questions?&nbsp;</p><p><i>For ML programming, it seems bad to rely on ML or design questions in the sense of &nbsp;a verbal question and answer? I think actually designing/choosing ML scientific knowledge is a tiny part of the job, so I think many ML knowledge questions would be unnatural (rewarding memorization of standard ML books/selecting for \"enthusiasts\" who read up on recent libraries, and blow out strong talent who solved a lot of hard real world problems).&nbsp;</i></p>", "parentCommentId": "D8ayZiWKkz8GrxBoK", "user": {"username": "Charles He"}}, {"_id": "vsTtojExzpYNWxZHA", "postedAt": "2022-09-29T17:30:55.417Z", "postId": "NTuTSEEn2Ka54nwFC", "htmlBody": "<p>As someone who has recently been in the AI Safety org interview circuit, about 50% of interviews were traditional Leetcode style algorithmic/coding puzzle and 50% were more practical. This seems pretty typical compared to industry.<br><br>The EA orgs I interviewed with were very candid about their approach, and I was much less surprised by the style of interview I got than I was surprised when interviewing in industry. Anthropic, Ought, and CEA all very explicitly lay out what their interviews look like publicly. My experience was that the interviews matched the public description very well.</p>", "parentCommentId": "B5XeHhRwRAqje4xfy", "user": {"username": "dan.pandori"}}, {"_id": "RfgjeRohm6myPaqCm", "postedAt": "2022-10-03T03:06:48.548Z", "postId": "NTuTSEEn2Ka54nwFC", "htmlBody": "<p>Yeah I personally find it very hard to do ML interviews for that reason. So far I'm doing a mix of theory/conceptual questions and practical ML coding questions. It helps if the conceptual questions include some unusual setups, or ask about unusal tweaks.&nbsp;</p>", "parentCommentId": "Z5mCCYfk8sTKoaade", "user": {"username": "andrew_richardson"}}]