[{"_id": "XswNHqx7mB6s6kjAs", "postedAt": "2024-02-21T19:48:28.768Z", "postId": "Nuo6t9x5Hxrr6KdGw", "htmlBody": "<p>This sounds interesting, Wes. Can you give any insight into the end-goal of the project? What would be the purpose of the database of APB from the internet? Does this tie in to a larger project?</p>", "parentCommentId": null, "user": {"username": "AI Law"}}, {"_id": "viFok7agwqoJ5pF2X", "postedAt": "2024-02-21T19:50:04.358Z", "postId": "Nuo6t9x5Hxrr6KdGw", "htmlBody": "<p>I'll respond in ∼30 mins</p>", "parentCommentId": "XswNHqx7mB6s6kjAs", "user": {"username": "wes R"}}, {"_id": "EagSy9iPDjA4dvmWM", "postedAt": "2024-02-21T20:08:51.653Z", "postId": "Nuo6t9x5Hxrr6KdGw", "htmlBody": "<ol><li>Since antibiotic resistance (the issue of disease-causing bacteria evolving resistance to antibiotics, one of the main defenses against disease-causing bacteria) is a big issue, work in that area (namely, making the process of finding new antibiotics that disease-causing bacteria is not resistant to) is therefore helpful.</li><li>The database would make it easier to identify APBs.</li><li>In a sense, this ties into the larger project because it largely <i>is</i> the larger project.</li></ol>", "parentCommentId": "viFok7agwqoJ5pF2X", "user": {"username": "wes R"}}, {"_id": "jyeGmuSgbCFqoGHvs", "postedAt": "2024-02-21T22:34:10.261Z", "postId": "Nuo6t9x5Hxrr6KdGw", "htmlBody": "<p>This sounds potentially valuable. However, it's important to establish what the added value of this project would be.&nbsp;</p><p>What current processes/systems/databases do scientists currently use to identify relevant research and bacteria? What about these existing processes/systems/databases is most in need of improving? Which scientists in the field have you spoken to about this in order to identify the main challenges they face when using existing systems?</p><p>Also...is there a reason for only focusing on antibiotic producing bacteria and not including fungi?</p>", "parentCommentId": null, "user": {"username": "Matt_Sharp"}}, {"_id": "ankyaF2iArSwh74rZ", "postedAt": "2024-02-21T23:05:05.199Z", "postId": "Nuo6t9x5Hxrr6KdGw", "htmlBody": "<ol><li>I agree,</li><li>None, I didn't even think to ask scientists what the process is like for them. That's on me.</li><li>I forgot to use a more general term that also includes non-bacterial antibiotic producers, my bad</li></ol>", "parentCommentId": "jyeGmuSgbCFqoGHvs", "user": {"username": "wes R"}}, {"_id": "dD5mFYqqwLghxv29p", "postedAt": "2024-02-22T00:18:02.848Z", "postId": "Nuo6t9x5Hxrr6KdGw", "htmlBody": "<p>Ah, okay. And scientists have no more of an efficient way to do this, currently? My field is law, but we have updates from government and from special interest bodies to keep us informed on new legislation and policy - do biology scientists not have something similar? Not dunking on or giving negative feedback on your idea, just trying to figure out what the USP is.<br><br>It may be worth reaching out to some researchers in this field and asking for feedback on the idea, and then adapting it to suit. Do you have a list of contacts, or know where to begin?&nbsp;<br><br>I have zero biosecurity experience but lots of general research experience. I'm happy to field questions via IM if you think that would be useful for you.&nbsp;</p>", "parentCommentId": "EagSy9iPDjA4dvmWM", "user": {"username": "AI Law"}}, {"_id": "xNajPsTJ933yZZsSy", "postedAt": "2024-02-22T00:19:20.367Z", "postId": "Nuo6t9x5Hxrr6KdGw", "htmlBody": "<p>People are hitting you with the negative karma BUT I think this is actually quite a valuable experience. Lots of research is trying, seeing what works or doesn't, adapting, then trying again. No shame in it at all. If you address Number 2, let us know how you get on :)</p>", "parentCommentId": "ankyaF2iArSwh74rZ", "user": {"username": "AI Law"}}, {"_id": "vNpg4YmkYsByfqiDk", "postedAt": "2024-02-22T00:30:04.799Z", "postId": "Nuo6t9x5Hxrr6KdGw", "htmlBody": "<p>I will if/when I do address it</p>", "parentCommentId": "xNajPsTJ933yZZsSy", "user": {"username": "wes R"}}]