[{"_id": "3pXBqzPTa2MaKf55g", "postedAt": "2023-08-07T13:09:54.880Z", "postId": "Nvw7dGi4kmuXCDDhH", "htmlBody": "<p>Love this - strong upvote.<br><br>Not a big thing, but I would be a bit careful with comments like this, could maybe be considered a tiny bit stereotyping or patronising - especially if you are going for a wider public audience.&nbsp;<br><br><i><strong>\"Maybe playing with other kids in their village. Maybe seeking shade with his or her siblings, trying to escape the sub-Saharan African heat. Maybe being held by their mother or grandmother, nurtured.\"</strong></i></p><p>Perhaps even a slight change to something like.<br><br><i><strong>\"Maybe they were playing with their friends at school. Maybe studying towards their dream of becoming a doctor. Maybe lounging on their grandma's lap, soaking up her love and wisdom.\"</strong></i></p><p>Or it might be completely fine, feel free to ignore.<br><br>Nice one again, love the simplicity and bluntness.</p>", "parentCommentId": null, "user": {"username": "NickLaing"}}, {"_id": "tKjXS5FxQWgHZXneH", "postedAt": "2023-08-07T20:48:37.639Z", "postId": "Nvw7dGi4kmuXCDDhH", "htmlBody": "<p>Nice! Thanks for sharing it :)</p>\n<p>I think I caught a typo:</p>\n<blockquote>\n<p>but I stayed quite because of worries…</p>\n</blockquote>\n<p>Shouldn’t it be “quiet”?</p>\n", "parentCommentId": null, "user": {"username": "JoanMM"}}, {"_id": "YxnrygQ5fw4JpRi8e", "postedAt": "2023-08-07T21:15:00.655Z", "postId": "Nvw7dGi4kmuXCDDhH", "htmlBody": "<p>It totally should be. Fixed, thanks :)&nbsp;</p>", "parentCommentId": "tKjXS5FxQWgHZXneH", "user": {"username": "MJusten"}}, {"_id": "mE8XeLxdfwoLHxmhX", "postedAt": "2023-08-07T21:26:47.444Z", "postId": "Nvw7dGi4kmuXCDDhH", "htmlBody": "<p>Thanks Nick! Really appreciate you flagging this. I didn't intend it that way and hope the edit helps:&nbsp;</p><blockquote><p>Maybe playing with their friends in the schoolyard, maybe spending time with their grandma, or maybe just kicking rocks, alone.</p></blockquote>", "parentCommentId": "3pXBqzPTa2MaKf55g", "user": {"username": "MJusten"}}, {"_id": "zeYokJhZXgaRBx6Ls", "postedAt": "2023-08-08T08:48:29.430Z", "postId": "Nvw7dGi4kmuXCDDhH", "htmlBody": "<p>Nice one yeah that's great - if it was me I would perhaps even change kicking rocks to kicking a football ;).</p>", "parentCommentId": "mE8XeLxdfwoLHxmhX", "user": {"username": "NickLaing"}}, {"_id": "Mm44miAjGG8Tk8a7G", "postedAt": "2023-08-08T21:06:09.635Z", "postId": "Nvw7dGi4kmuXCDDhH", "htmlBody": "<p>Thank you for this article, Michel!</p>", "parentCommentId": null, "user": {"username": "Igor Scaldini"}}, {"_id": "3H2nHZTEHSarwGLaH", "postedAt": "2023-08-10T07:54:02.940Z", "postId": "Nvw7dGi4kmuXCDDhH", "htmlBody": "<p>How can we get more posts like this on more people's social media feeds?&nbsp;<br><br>I just don't think people realise how much impact they can have with a donation. Or they don't make the connection that the kid whose life they save is just the same as their own kid, or the kid from down the road, for whom they probably wouldn't think twice before donating to save their life if they had that option.&nbsp;<br><br>Your post has a \"click-bait\" potential (in a positive sense) that a lot of EA posts lack for a general audience. You've written it very well, with a kind of \"teaser\" element to it which encourages further reading.&nbsp;<br><br>If we could get it out there, it feels like we might encourage a lot of people to consider a donation.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Denis "}}, {"_id": "8JAoetsewqwYwGCyw", "postedAt": "2023-08-10T14:05:06.203Z", "postId": "Nvw7dGi4kmuXCDDhH", "htmlBody": "<p>A lovely post Michel! Do you mind if we share it on the GWWC social media?</p>", "parentCommentId": null, "user": {"username": "GraceAdams"}}, {"_id": "2akhZDRAJ2SNNm4W2", "postedAt": "2023-08-15T04:23:06.883Z", "postId": "Nvw7dGi4kmuXCDDhH", "htmlBody": "<p>I'm increasingly convinced that EA needs to distance ourselves from this framing of \"saving lives=good\". And we need to avoid the satisfying illusion that giving to global health charities is saving a life \"just like our own\". (Particularly disagreeing with <a href=\"https://forum.effectivealtruism.org/users/nicklaing?mention=user\">@NickLaing</a>'s comments here). If you've decided to save the lives of the ultra-poor, you should be able to bite the bullet and admit you're doing that.&nbsp;<br><br>We all like the idea of saving a kid who's \"playing with their friends in the schoolyard, maybe spending time with their grandma, or maybe just kicking a football, alone\", and \" celebrating her birthday\" and the \"first kiss\".<br><br>But you don't need to be a negative utilitarian to recognise that the kid whose life you've saved probably isn't having a great life- mostly for the reasons you donated to that charity- it's shitty being a poor person in the poorest countries in the world.&nbsp;<br><br>Let's say you saved a life in Burkina Faso:<br><br>- If you saved a girl, she'll probably be a <a href=\"https://www.equalitynow.org/fgm_in_burkina_faso/#:~:text=How%20prevalent%20is%20FGM%20in,87%20percent%20depending%20on%20ethnicity.\">victim of FGM</a>, and get <a href=\"https://www.girlsnotbrides.org/learning-resources/child-marriage-atlas/regions-and-countries/burkina-faso/#:~:text=Burkina%20Faso%20ratified%20the%20Convention,and%20full%20consent%20to%20marriage.\">married as a child to an older man </a>- that \"first kiss\" you mention might be as a 15-year-old girl with her 30-year-old husband<br>- If they don't go to school, <a href=\"https://borgenproject.org/children-in-burkina-faso/\">they'll do hard and dangerous work in agriculture, fishing</a> or worse<a href=\"https://borgenproject.org/children-in-burkina-faso/\"> </a>as children.<br>- If they do go to school, they'll probably spend their days in extreme boredom, getting left behind, and end their school years <a href=\"https://teachingattherightlevel.org/blog/2023/03/08/adapting-a-new-educational-approach-to-francophone-west-africa/\">functionally illiterate and innumerate</a><br>- They're likely to spend a lot of their childhood hungry - they will get ill often, with malaria, diarrhea, or other communicable diseases<br>- They will be likely to <a href=\"https://2017-2020.usaid.gov/sites/default/files/documents/1864/Burkina-Faso-Nutrition-Profile-Mar2018-508.pdf\">grow up stunted or wasted</a>, and with diminished cognitive abilities<br>- All of the above tend not to be great for mental health, so they're fairly <a href=\"https://www.sciencedirect.com/science/article/abs/pii/S0277953618301898\">likely to become depressed</a>, anxious, or suffer from more serious mental issues<br>- When you ask them how happy they are on a <a href=\"https://ourworldindata.org/happiness-and-life-satisfaction\">life satisfaction/ happiness scale</a>,&nbsp;they'll give you around 4/10&nbsp;<br><br>Based on this reality, and your estimates about how the world is likely to improve in the coming few decades, you have to work out whether you think this life you've saved is more likely or not to be net positive.&nbsp;<br><br>I'm not saying that we shouldn't give more money to global health charities- they improve lives and stop people getting horrible diseases. All else equal, fewer communicable diseases are better. But I'm disagreeing strongly with the framing of this piece.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Dzoldzaya"}}, {"_id": "S66ey9PRxRQtySgLp", "postedAt": "2023-08-15T10:04:51.237Z", "postId": "Nvw7dGi4kmuXCDDhH", "htmlBody": "<p>I disagree with fairly high confidence with this comment. \"<i><strong>it's shitty being a poor person in the poorest countries in the world.\" &nbsp;</strong></i></p><p>For a start, your comment here is misleading \"<i>When you ask them how happy they are on a </i><a href=\"https://ourworldindata.org/happiness-and-life-satisfaction\"><i>life satisfaction/ happiness scale</i></a><i>,&nbsp;they'll give you around 4/10\"</i> - <strong>they were not asked how happy they are, what they were asked was this.&nbsp;</strong><br><br>“<i>Please imagine a ladder, with steps numbered from 0 at the bottom to 10 at the top. The top of the ladder represents the best possible life for you and the bottom of the ladder representsthe worst possible life for you. On which step of the ladder would you say you personally feelyou stand at this time?\" - </i>The answers they give make perfect sense - of course there are far better counterfactual lives for them, especially when they compare themselves with other people from higher income countries, <strong>but this doesn't mean they aren't happy.&nbsp;</strong></p><p><strong>In Burkina Faso </strong>the next graphic shows that <i><strong>80% of people from Burkina Faso said they were either very happy, or rather happy</strong></i> - which should answer the happiness question.&nbsp;</p><p><a href=\"https://ourworldindata.org/happiness-and-life-satisfaction\">https://ourworldindata.org/happiness-and-life-satisfaction</a></p><p>Besides that, the examples you gave that I agree are \"Likely\" in Burkina Faso are FGM and your school comment which I think is very accurate and actually underappreciated. All the others (child marriage, stunting, mental illness) I would not consider \"likely\", as their prevalence is well below 50%.&nbsp;<br><br>To answer your comment <strong>\"</strong><i><strong>you have to work out whether you think this life you've saved is more likely or not to be net positive. \"</strong></i><strong> - </strong>We have worked it out, and the answer<strong> YES, </strong>a resounding yes.</p><p>Yes your life might be worse than for people in richer countries, that's why us global health people do what we do, but that doesn't mean that people's lives are \"shitty\", nor that we should not talk with great care and dignity when we conside hypothetical people's in low income countries.</p>", "parentCommentId": "2akhZDRAJ2SNNm4W2", "user": {"username": "NickLaing"}}, {"_id": "8aQu2CiiAoGrdaiEP", "postedAt": "2023-08-15T12:34:26.174Z", "postId": "Nvw7dGi4kmuXCDDhH", "htmlBody": "<p>I would quickly add to what Nick said by saying that donating to charities that save kids' lives (e.g. AMF) likely improves all of your bullets.<br>- Families become happier if they receive the health interventions they need (and they almost certainly don't rate themselves 4/10 on the happiness scale, your quoting the wrong thing as Nick mentioned)<br>- I think it's also unfair to single out the Burkina Faso alone, when you donate to these effective charities they cover dozens of countries, most with far lower FGM rates<br>- You say they will spend their lives in 'extreme boredom', but your link doesn't really state any evidence for that<br>&nbsp;</p><p>It's true that the lives we can save might still be ones full of hardship, but the evidence suggests that they will be happier and healthier lives. The counterfactual is death, and even in your bullets (that seem a bunch of pick and choose to bolster your argument) I don't see strong evidence that suggests we shouldn't be funding these charities.&nbsp;</p>", "parentCommentId": "S66ey9PRxRQtySgLp", "user": {"username": "BOAS"}}, {"_id": "BYDijXDXu3hLF22Ns", "postedAt": "2023-08-16T06:41:07.369Z", "postId": "Nvw7dGi4kmuXCDDhH", "htmlBody": "<p>Thanks for responding.</p>\n<p>I accept your point about life satisfaction vs happiness measures not being equivalent. But if GiveWell recipients think that their life is significantly closer to the worst possible life than the best possible life, this still makes my point pretty well. Doesn't seem obvious to judge the net welfare of someone who is, say, 3/10 for life satisfaction and 'rather happy'. I haven't seen good studies on GiveWell recipients' happiness or moment-to-moment well being (using ESM etc.), or other ways of measuring what we care about, but I would appreciate better info on that.</p>\n<p>My (implicit) estimates for child marriage, stunting and mental illness should be adjusted for the fact that average GiveWell charity recipients in Burkina Faso have worse lives than the average citizen, but I acknowledge my language was imprecise. Stunting might plausibly cross the 50% threshold in that category, but might be under. The median marriage age for Burkinabe girls is 17, and is probably lower in the GiveWell pop. Some orgs define child marriage as &lt;18.</p>\n<p>Mental illness thresholds seem to vary a lot,  but this\n<a href=\"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0164790\">https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0164790</a> article is a good example of how bad mental health is for 'ultra-poor' kids in Burkina Faso. My thinking would be that 20-30% of the kids in this study have lives clearly on the net-negative side, which I think would be unlikely to be outweighed by the more neutral/ positive lives. Don't know exactly how this would match with a typical GiveWell population.</p>\n<p>\"To answer your comment \"you have to work out whether you think this life you've saved is more likely or not to be net positive. \" - We have worked it out, and the answer YES, a resounding yes\"</p>\n<p>I consider this just obviously false. I just don't believe that you/ global health people have disproven negative-leaning utilitarian or suffering-focused ethical stances. You might have come to a tentative conclusion based on a specific ethical framework, limited evidence and personal intuitions (as I have).</p>\n<p>I'd say that there's probably a fairly fundamental uncertainty about whether any lives are net positive. There's definitely not a consensus within the EA community or elsewhere. It depends on stuff like suffering happiness assymetry and the extent to which you think pain and pleasure are logarithmic (<a href=\"https://qri.org/blog/log-scales\">https://qri.org/blog/log-scales</a>).</p>\n<p>Most of us will acknowledge that at least some lives are net negative, some extremely so, and that these lives are far more likely to be saved by GiveWell charities. I suspect any attempt to model exactly where to draw the line will be very sensitive to subtle differences in assumptions, but my current model leans towards the average GiveWell life being net negative in the medium term, for the reasons I've mentioned.</p>\n<p>In terms of language, I think \"great care and dignity\" are suitable for most contexts, but I think that it's important that the EA forum is a safe space for blunt language on this topic.</p>\n", "parentCommentId": "S66ey9PRxRQtySgLp", "user": {"username": "Dzoldzaya"}}, {"_id": "N6aSd2KhT6nibEWDj", "postedAt": "2023-08-16T07:11:18.628Z", "postId": "Nvw7dGi4kmuXCDDhH", "htmlBody": "<p>As I said on my final para, I do see global health interventions as probably being net positive, despite potentially saving more net negative lives, so my argument definitely wasn't to \"defund GiveWell\". It was more that \"saving lives\" is a bad metric and bad thing to feel good about.</p>\n<p>My cherry picking of negative phenomena was in response to the cherry picking of the original post. I think boring/ useless school (I didn't quote anything but... most African rural schools are boring and useless...), unpleasant labour, hunger/ stunting and poor mental health are very relevant variables, as they define a lot of the waking hours of the poorest people in the world.</p>\n<p>FGM and child marriage are probably less representative of general welfare - I was responding to the \"first kiss\" idea in the post.</p>\n<p>I chose Burkina Faso at random. For central African countries I might have stressed sexual violence, which seems to be lower in Burkina Faso.</p>\n", "parentCommentId": "8aQu2CiiAoGrdaiEP", "user": {"username": "Dzoldzaya"}}, {"_id": "a2Z9ok4rpJJSG8C5D", "postedAt": "2023-08-16T09:53:13.445Z", "postId": "Nvw7dGi4kmuXCDDhH", "htmlBody": "<p>Would current use of QALYs factor in some of the features you mentioned? I suppose the focus on lives saved is a criticism of the post not of GiveWells method in general?</p>\n", "parentCommentId": "2akhZDRAJ2SNNm4W2", "user": {"username": "AdriansSkapars"}}, {"_id": "LpALFzwHpR9zgMbvB", "postedAt": "2023-08-17T21:11:28.182Z", "postId": "Nvw7dGi4kmuXCDDhH", "htmlBody": "<p>Thanks Grace! Feel free to share.</p>\n", "parentCommentId": "8JAoetsewqwYwGCyw", "user": {"username": "MJusten"}}, {"_id": "G4SEojR9Nopu9DL8H", "postedAt": "2023-08-17T21:42:10.851Z", "postId": "Nvw7dGi4kmuXCDDhH", "htmlBody": "<p>Thanks for engaging with this post! I appreciate the seriousness with which you engage with the question “is this actually good?” If it’s not, I don’t want to celebrate this donation or encourage others to do the same; the answer to that question matters.</p>\n<p>I think your arguments are plausible, and I agree with the comment you make elsewhere that the EA Forum should be a place for such (relatively) unfiltered push back.</p>\n<p>But in the absence of any inside view on this topic and the fair push back Nick made, I still feel solid about holding the outside view that donation to GiveWell top charity = good. Neither the specifics of GiveWell charities nor subjective well-being in LMICs are my areas of expertise, so I‘m mostly deferring to GiveWell. But I also think most lives are worth living, and I’m weary (although I could be wrong) about “lives not worth living” lines of reasoning in countries and cultures I don’t understand well.</p>\n", "parentCommentId": "2akhZDRAJ2SNNm4W2", "user": {"username": "MJusten"}}, {"_id": "KJkoMBDsiL88QZyv5", "postedAt": "2023-08-22T08:28:13.595Z", "postId": "Nvw7dGi4kmuXCDDhH", "htmlBody": "<p>My argument questions the ideas of lives saved, DALYs and QALYs as metrics - just like using lives saved as a metric, QALYs generally implicitly assume that death is worse than a very bad life, no matter the levels of mental suffering, pain, and physical debilitation.&nbsp;<br><br>I'm probably criticising GiveWell's methods as much as the post-<a href=\"https://docs.google.com/spreadsheets/d/1otZFJSMM8yH5R6DkBIYmlsWy5T7VHsX_E7wDF7HSLaM/edit#gid=1362437801\"> their methodology </a>assumes that the value of saving lives/ averting deaths is positive.<br><br>I generally agree more with <a href=\"https://www.happierlivesinstitute.org/report/response-to-givewells-assessment-of-strongminds/\">HLI's 'WELLBY' approach,</a> as long as negative WELLBYs are taken seriously.&nbsp;</p>", "parentCommentId": "a2Z9ok4rpJJSG8C5D", "user": {"username": "Dzoldzaya"}}]