[{"_id": "jKwYisYrb28YHcZDd", "postedAt": "2023-11-12T06:44:00.001Z", "postId": "NwzQoSxDueZns3WXc", "htmlBody": "<p>Honestly, I like that this essay tries to engage with and understand EA more than other critiques I've seen. Usually when I see an article about EA's association with billionaires/elites, it tends to be a lot less substantive.</p><p>I do agree that EA decision making generally biases towards privilege. EA orgs pretty openly bias towards recruiting and hiring from prestigious universities, which are significantly overrepresented in EA demographics. I also recall data from Spencer Greenberg that essentially placed EAs as ideologically centrist, as oppose to more left-leaning social movements popular with similar demographics.</p><p>I think her critique here is actually quite sound:</p><blockquote><p>Effective altruism, when it began, had ascetic norms designed to constrain power, but slowly and surely they have been eroded by arguments about ‘effectiveness’, and as they receded the absence of strong institutional constraints became apparent. This leaves effective altruism and longtermism exposed to what we may call ‘the despotism trap’.</p><p>It rejects constraints against these visionaries as the pettiness of small minds. They drape themselves in the regalia of liberty to challenge government, but their interest is in being able to exercise uncontrolled power. The excuse is that the ends will justify the means. We can see how these attitudes have influenced effective altruism when it overlaps with ‘philanthrocapitalism’, whereby people like Gates bring the mechanisms of the market into philanthropy on the grounds that is more effective.</p></blockquote><p>I think this is a pretty accurate description. EA and EA-adjacent orgs are <i>generally</i> funded by rich philanthropists, and receive less support and collaboration with governmental bodies. A lot of EA-adjacent or recommended orgs exist in the private sector. I think at the very least, we have to acknowledge that funding sources do affect culture. EA happens to be disproportionately funded by tech billionaires, so EA is more likely to be sympathetic to the views and ideologies of tech billionaires.</p><p>I think where outside critics get it wrong, is the interpretation that because EA is funded by social elites, it actively sides/colludes with social elites. I'm not sure how to convey it, but outside coverage seems to imply that EA is essentially a front for social elites to gain more power without actually doing any good, when my take is that EA began in elite college campuses, and so the most accessible sources of support and funding just happened to be social elites. Most notably, coverage of EA often focuses more on ties with social elites than the actual work done by EA orgs in various cause areas. The average article I read contains maybe 1-2 brief sentences about the fairly complex work/research done by EA orgs, and the rest of the article is just speculating about its ties w rich elites.</p>", "parentCommentId": null, "user": {"username": "Minh Nguyen"}}, {"_id": "WpcaAkHPNgx8tckg9", "postedAt": "2023-11-13T16:33:19.451Z", "postId": "NwzQoSxDueZns3WXc", "htmlBody": "<blockquote>\n<p>I think where outside critics get it wrong, is the interpretation that because EA is funded by social elites, it actively sides/colludes with social elites.</p>\n</blockquote>\n<p>In the reddit comment section they discuss this a little further. Specifically in <a href=\"https://reddit.com/comments/17o9fas/comment/k84qqdk\">this comment</a> the author says that it is less the closeness of EA with powerful people, but that the philosophy of EA itself fits powerful people. So they can still do \"dirty hand stuff\" but justify it with \"it is necessary for generating value to do good\".\nI agree with the author here, that the philosophy of EA can provide this cover. And combined with the closeness to the power centers in the US, can derail.</p>\n<p>SBF is a good example I think (please correct me if not. I am no EA follower and only here for the discussion). Crypto currency projects have currently very dubious value for humanity. To oversimplify a little: effectively consuming enormous amounts of energy <em>in times of an energy crisis</em>, while mostly being there so people can do financial speculations with the aim to become rich.\nHow does this fit with doing good?</p>\n", "parentCommentId": "jKwYisYrb28YHcZDd", "user": {"username": "WobblyPandaPanda"}}]