[{"_id": "yzDFcdkSqdA2mB2eG", "postedAt": "2023-10-16T18:11:00.596Z", "postId": "NxCeCpRqF4pkWQKkw", "htmlBody": "<p>I like GiveDirectly a lot, and I think you're doing great work! I'm glad to be able to point people to GiveDirectly who are skeptical of less clear cut interventions or who feel very strongly about letting recipients decide what's most important to them, and I think donations you receive go further than ones to the vast majority of charities.</p>\n<p>On the other hand, it doesn't seem like this post engages with reasons EAs might disagree with the claim that \"ending extreme poverty through cash transfers should be a central EA cause\"? For example, just within global health and development GiveWell estimates the opportunities they're able to identify are at least <a href=\"https://www.givewell.org/how-we-work/our-criteria/cost-effectiveness/cost-effectiveness-models\">10x more effective</a> than cash transfers. Do you think cash is undervalued by GiveWell and the EAs who defer to them by &gt;10x?</p>\n", "parentCommentId": null, "user": {"username": "Jeff_Kaufman"}}, {"_id": "LGcpupiFAbufWNBbr", "postedAt": "2023-10-16T19:08:42.865Z", "postId": "NxCeCpRqF4pkWQKkw", "htmlBody": "<p>I totally agree that cash transfers are an incredible way to transform people's lives! What kind of evidence do we have about cash transfers being able to \"end extreme poverty\"? I always thought they helped improve people's lives for a few years.</p>\n", "parentCommentId": null, "user": {"username": "Khorton"}}, {"_id": "2XErnp9BjM63m6Nqu", "postedAt": "2023-10-16T20:58:03.083Z", "postId": "NxCeCpRqF4pkWQKkw", "htmlBody": "<p>Wait, I'm a little confused a bit by the vote distribution and the comments - are cash transfers not considered a central EA cause? I thought GiveDirectly was absolutely a part of EA space?</p><p>Is the disagreement that:</p><ul><li>cash transfers/givedirectly isn't an EA cause area</li><li>it is, but it's not/shouldn't a central cause area</li><li>it is both of the above, but this wouldn't end extreme poverty<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefwo63ckymblg\"><sup><a href=\"#fnwo63ckymblg\">[1]</a></sup></span></li><li>the tone/vibe of the post</li><li>other</li></ul><p>I'm a bit confused tbh. I like GiveDirectly and Natalie's talk.</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnwo63ckymblg\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefwo63ckymblg\">^</a></strong></sup></span><div class=\"footnote-content\"><p>or perhaps the reason that it wouldn't is a reason why it shouldn't be a central cause area?</p></div></li></ol>", "parentCommentId": null, "user": {"username": "JWS"}}, {"_id": "XDGL85RE77bqubtsL", "postedAt": "2023-10-16T21:19:02.024Z", "postId": "NxCeCpRqF4pkWQKkw", "htmlBody": "<p>It was an active choice to not make this post a structured point-by-point debate with GiveWell's thinking as theirs is not the only guiding philosophy of how EAs think about issues of global health and development. With much of the $200B/year in Official Development Assistance going to <a href=\"https://www.devex.com/news/opinion-cash-transfers-should-be-the-default-not-just-the-benchmark-106220\">interventions of question effectiveness</a> and <a href=\"https://www.bostonglobe.com/2021/12/04/opinion/while-poverty-rises-charitable-donations-are-collecting-dust/#:~:text=This%20%E2%80%9Ccommit%20now,four%20years%20alone.\">over a trillion dollars</a> sitting in private foundations, the EA movement can and should open the aperture of how it thinks about what it recommends beyond the marginal donation.&nbsp;</p><p>We're optimistic the movement could influence existing pots of money orders of magnitude larger than what it does today, thus doing even more good in the world.&nbsp;This could perhaps have been more clearly argued in the post, open to your thoughts / feedback!&nbsp;</p><p>That said, we have engaged with the the question of GiveWell under-valuing cash both in this post and in previous posts (see below)</p><hr><blockquote><p>How you score ‘effectiveness’ is ultimately subjective (see&nbsp;<a href=\"https://www.givedirectly.org/giving-directly-still-means-giving-well/\"><u>our blog</u></a>), but it’s worth considering the vast range of benefits this single intervention can have</p></blockquote><p>As that previous blog points out, \"[GiveWell's moral weight approach] results in <a href=\"https://docs.google.com/spreadsheets/d/1tytvmV_32H8XGGRJlUzRDTKTHrdevPIYmb_uc6aLeas/edit#gid=1362437801\">a spreadsheet</a>. This framework combines the views of a relatively small number of stakeholders and then applies those outcomes to millions of people. GiveDirectly believes that the weights that should count the most are those of the specific people we’re trying to help. Each individual will have their own specific needs, preferences, and aspirations. We have yet to see a place we worked in (village, county, country) where everyone made the same investments, so why prescribe the same solution for everyone? Why not treat each individual person living in poverty as exactly that, respecting their individuality and allowing them the dignity of pursuing their own goals?\"<strong> &nbsp;</strong>This is to say, we don't subscribe to GiveWell's moral weights approach, but instead hold <a href=\"https://www.givedirectly.org/givedirectly-values/\">recipient's preference</a> as our north star.&nbsp;</p><blockquote><p>While addressing diseases like malaria or river-blindness would reduce suffering, they are only endemic in some but not all places with high extreme poverty&nbsp; – in 2021, malaria impacted only a third of the extreme poor.<a href=\"https://forum.effectivealtruism.org/posts/NxCeCpRqF4pkWQKkw/ending-extreme-poverty-through-cash-transfers-should-be-a#fnhymcjzcbq85\"><sup>[12]</sup></a>&nbsp;Giving cash is impactful nearly everywhere that extreme poverty persists.</p></blockquote><p>The global health and development issues GiveWell's list targets are relatively niche compared to the wide applicability of cash transfers. The funding gap opportunities they've identify are <a href=\"https://forum.effectivealtruism.org/posts/yaoT47sPaSwpkoraB/don-t-wait-there-s-plenty-more-need-and-opportunity-today#:~:text=of%20everyone%20else%E2%80%99s.-,There%20is%20still%20immense%20need%20and%20opportunity%20for%20impact%20now,-%E2%80%9CIn%202021%2C%20we\">more limited</a> still.</p><blockquote><p>[Footnote] It’s worth noting that the charity evaluator <a href=\"https://forum.effectivealtruism.org/posts/yaoT47sPaSwpkoraB/don-t-wait-there-s-plenty-more-need-and-opportunity-today#:~:text=down%20the%20road.-,Direct%20cash%20transfers%20can%20have%20much%20more%20impact%20than%20GiveWell%20assumes,-%E2%80%9CIn%20the%20meantime\">GiveWell does not currently factor</a> in these multiplier research results into their cost effectiveness analysis for GiveDirectly.&nbsp;</p></blockquote><p>GiveWell is likely undervaluing cash by their own moral weight terms based on the research they have right now. They've <a href=\"https://www.givewell.org/research/grants/UC-Berkeley-cash-transfers-follow-up-July-2022\">commissioned other research </a>that may further change their own ranking.</p>", "parentCommentId": "yzDFcdkSqdA2mB2eG", "user": {"username": "givedirectly"}}, {"_id": "aWhTuYhL6f4cozi5f", "postedAt": "2023-10-16T21:34:00.209Z", "postId": "NxCeCpRqF4pkWQKkw", "htmlBody": "<blockquote><p><a href=\"http://givedirectly.org/research\"><u>Research</u></a> finds people use these funds to improve their health, education, income, and self-reliance, ultimately reducing adult and child mortality. And these results can be sustained years into the future. <i>[Footnote: Source on&nbsp;</i><a href=\"https://voxdev.org/topic/health-education/cash-transfers-reduce-adult-and-child-mortality-rates-low-and-middle-income-countries\"><i><u>reducing adult &amp; child mortality</u></i></a><i>.&nbsp; Two examples of long-term cash impact:&nbsp;</i><a href=\"https://g2lm-lic.iza.org/wp-content/uploads/2021/08/GLMLIC-Policy-Brief_043.pdf\"><i><u>Uganda (12 years)</u></i></a><i>,&nbsp;</i><a href=\"https://www.povertyactionlab.org/sites/default/files/research-paper/Education_Income_Mobility_2021.pdf\"><i><u>Mexico (20 years)</u></i></a><i>.]</i></p></blockquote><p>GiveDirectly's baseline measures don't date back that far, but we do expect research on 5- and 9-year follow-up measures sometime in 2024.&nbsp;</p><p>Cash transfers alone won't eradicate extreme poverty globally, however they're an under-funded and under-utilized tool that would massively reduce extreme poverty and <a href=\"https://www.givedirectly.org/extreme-poverty-2023/#:~:text=A%20cash%20transfer%20is%20the%20boost%20many%20need%20to%20escape%20poverty\">work in compliment</a> with other efforts.&nbsp;</p>", "parentCommentId": "LGcpupiFAbufWNBbr", "user": {"username": "givedirectly"}}, {"_id": "arv3zh4DtkcAsdAM7", "postedAt": "2023-10-16T22:30:32.257Z", "postId": "NxCeCpRqF4pkWQKkw", "htmlBody": "<p>Can you explain this, I don't fully understand? Are you saying you prefer a subjective wellbeing approach, or that you don't think that we should be comparing outcomes of different interventions or something different?<br><br><i>\"GiveDirectly believes that the weights that should count the most are those of the specific people we’re trying to help.\"<strong> &nbsp;</strong>This is to say, we don't subscribe to GiveWell's moral weights approach.\"</i></p>", "parentCommentId": "XDGL85RE77bqubtsL", "user": {"username": "NickLaing"}}, {"_id": "psLMGEux8RrzinzRH", "postedAt": "2023-10-16T22:38:38.133Z", "postId": "NxCeCpRqF4pkWQKkw", "htmlBody": "<p>For a start, I really like givedirectly.<br><br>Personally I haven't found givedirectly the most straightforward sell, but its pretty close to anecdata as my sample size is small, &nbsp;n = 10ish. Sure the mechanics are easy to explain which is great, but I often get hit with more skepticism than for other charities. When I try to explain about cash, I often get some form of <i>\"<strong>teach a man to fish\"&nbsp;</strong></i> or<i> \"<strong>but it doesn't deal with the root causes of poverty\".</strong> </i>We then get into a great discussion and by the end people are often convinced about givedirectly but I wouldn't call it super straight forward.<br><br>I've probably found it easier explaining the merits of malaria nets, or deworming, or even my own charity providing healthcare in remote places, where follow-up questions are often less skeptical.&nbsp;<br><br><i>\"You may prefer to donate to other high-impact causes, but cash transfers are a uniquely shareable entry point for effective giving. If you are looking for an example of an effective charity to mention a tweet or a discussion with a colleague, GiveDirectly is a strong choice – the name says it all.</i></p><p><i>“It’s very simple and easy to explain,”&nbsp;</i><a href=\"https://blog.givewell.org/2022/12/19/staff-members-personal-donations-for-giving-season-2022/#Elie_Hassenfeld\"><i><u>says</u></i></a><i> GiveWell's CEO and co-founder Elie Hassenfeld. In their recent TED talk, Longview Philanthropy&nbsp;</i><a href=\"https://youtu.be/k7P9v9NB7fU?si=2IdAp7cFw2Vf29QR&amp;t=419\"><i><u>led</u></i></a><i> with cash transfers. Last December, EA critics and allies&nbsp;</i><a href=\"https://www.givingwhatwecan.org/fundraisers/emile-and-nathan-christmas-fundraiser\"><i><u>united</u></i></a><i> to raise funds for GiveDirectly.&nbsp;&nbsp;</i></p><p><strong>Do you have evidence that GivedDrectly is easier to convince people about than other causes? </strong>That might make an interesting wee study actually....</p>", "parentCommentId": null, "user": {"username": "NickLaing"}}, {"_id": "spK7LvsbDLBrDzEJE", "postedAt": "2023-10-17T00:40:27.247Z", "postId": "NxCeCpRqF4pkWQKkw", "htmlBody": "<p>First, some terminology: cash transfers are an intervention within the Cause Area of extreme poverty.</p>\n<p>Their effectiveness needs to be compared to other available interventions. GiveWell is an organization that does just that, and they found bednets much more effective than cash transfers. I suppose many EAs choose to follow GiveWell on these judgements.</p>\n<p>While Give Directly is definitely awesome and more effective than most charities, they don't really put together a convincing argument that they are more effective than bednets in this post.\nIn general, I do like their point that we should think beyond the marginal donation. However, this isn't a post about politics or how to influence large amounts of money. It's a post that wants to get you to donate to Give Directly.</p>\n", "parentCommentId": "2XErnp9BjM63m6Nqu", "user": {"username": "ludwigbald"}}, {"_id": "2WyCWrGsudjdnPryk", "postedAt": "2023-10-17T03:15:30.720Z", "postId": "NxCeCpRqF4pkWQKkw", "htmlBody": "<p>Sure. We expanded <a href=\"https://www.givedirectly.org/giving-directly-still-means-giving-well/#:~:text=Who%20should%20decide%20what%20people%20in%20extreme%20poverty%20most%20need%3F\">the excerpt from the blog</a> for clarity: \"[GiveWell's moral weight approach] results in <a href=\"https://docs.google.com/spreadsheets/d/1tytvmV_32H8XGGRJlUzRDTKTHrdevPIYmb_uc6aLeas/edit#gid=1362437801\">a spreadsheet</a>. This framework combines the views of a relatively small number of stakeholders and then applies those outcomes to millions of people. GiveDirectly believes that the weights that should count the most are those of the specific people we’re trying to help. Each individual will have their own specific needs, preferences, and aspirations. We have yet to see a place we worked in (village, county, country) where everyone made the same investments, so why prescribe the same solution for everyone? Why not treat each individual person living in poverty as exactly that, respecting their individuality and allowing them the dignity of pursuing their own goals?\"<strong> &nbsp;</strong>This is to say, we don't subscribe to GiveWell's moral weights approach, but instead hold <a href=\"https://www.givedirectly.org/givedirectly-values/\">recipient's preference</a> as our north star.&nbsp;</p>", "parentCommentId": "arv3zh4DtkcAsdAM7", "user": {"username": "givedirectly"}}, {"_id": "qC33jva3FmMfK2Hgw", "postedAt": "2023-10-17T04:07:17.603Z", "postId": "NxCeCpRqF4pkWQKkw", "htmlBody": "<p>I suppose we could straightforwardly just transfer enough cash to everyone below a certain poverty line until their annual income is above it. The Longview team has estimated this would cost about $258 billion [edit: <i>annually</i>] (pp. 8-10 <a href=\"https://www.longview.org/wp-content/uploads/2023/10/Longview-Report-What-if-1-gave-10.pdf\">here</a>).</p>", "parentCommentId": "LGcpupiFAbufWNBbr", "user": {"username": "Stephen Clare"}}, {"_id": "QghPYcnrtGtE4fh4y", "postedAt": "2023-10-17T04:13:52.298Z", "postId": "NxCeCpRqF4pkWQKkw", "htmlBody": "<p>I'm somewhat sympathetic to something like GiveDirectly's take. If bednets are something like 10x more valuable than the cash used to purchase them, I find it a bit weird that people don't usually buy them when given a cash transfer.&nbsp;</p><p><a href=\"https://forum.effectivealtruism.org/posts/pPAvWAaD9AnLnLgJX/stephen-clare-s-shortform?commentId=Mvmtrd5QbBrmhYjea\">I've previously written a short comment</a> about mechanisms that could explain this and do think there are important factors that can explain part of the gap (e.g. coordination problems). But I'm still a bit skeptical that the \"real\" value is 10x different.</p>", "parentCommentId": "yzDFcdkSqdA2mB2eG", "user": {"username": "Stephen Clare"}}, {"_id": "LXKGbJfraohRhg2NW", "postedAt": "2023-10-17T04:16:24.986Z", "postId": "NxCeCpRqF4pkWQKkw", "htmlBody": "<p>I am very skeptical of this calculation:</p><blockquote><p>As a percentage of population, Africa’s poverty rate has dropped; however, this tells a sunnier story than the reality that nearly twice as many Africans cannot afford their most basic needs today as 30 years ago (appox. 432M vs. 280M).</p></blockquote><p>Firstly and most obviously, 432/280-1 = a 54% increase, which is quite far from 'nearly twice as many'.&nbsp;</p><p>Secondly, this relies on comparing 1990 to 2023, even though these years are actually more than 30 years apart. If we instead use 1993, OWID suggests a denominator of 321m, and hence an increase of only 35%, which does not seem like 'nearly twice'. It is literally closer to 'no change' than 'twice'.</p><p>Thirdly, I am curious as to the source for this 2023 figure. Traditionally macroeconomic data is only published with a lag; the BEA doesn't produce even its initial estimate of GDP for almost a month after the quarter, and the final version is months later. Similarly US corporations with sophisticated accounting software and complete control of their activities won't release their figures for over a month after the quarter closes. Given the difficulties collecting data in Sub-Saharan Africa, it is very surprising to me that the 2023 figure is already available. <a href=\"https://public.flourish.studio/visualisation/15210375/\">Your source</a> in turn lists two sources.</p><p>One of these sources is <a href=\"https://openknowledge.worldbank.org/server/api/core/bitstreams/0a750f57-7b86-54ca-8fb0-180e8f6f6ecd/content\">this 2022 paper</a> about the covid impact, which does not contain 2023 data. It uses surveys done in 2020, though for Sub-Saharan Africa these phone surveys do not even directly ask about income or consumption, which had to be imputed:</p><blockquote><p>While the phone surveys provide information on whether households gained or lost income or consumption since the beginning of the pandemic, <strong>they do not contain information on households’ level of income or consumption</strong>, nor do they report the size of the change in income or consumption. [emphasis added]</p></blockquote><p>The second source is to the<a href=\"https://pip.worldbank.org/home\"> World Bank Poverty and Inequality platform</a>. There are a lot of datasets here, and I admit I haven't looked through them all. But the most prominently displayed chart is one showing the number of people living on under $2.15/day PPP, <i>and it only goes up to 2019</i>.</p><p>I think what the chart you are using is doing is relying on the approach described <a href=\"https://blogs.worldbank.org/opendata/poverty-back-pre-covid-levels-globally-not-low-income-countries\">in this paper</a>, which uses GDP growth to impute the numbers needed to apply the methodology described in the 2022 paper. Even though GDP/Capita has been growing for Sub-Saharan Africa, this still produces suggests a growing number of people in poverty, presumably because their population growth is so high.&nbsp;</p><p>But this approach seems... quite dubious to me. They are using 2023 (a year that is not yet over) GDP (a statistic which takes months to compile) figures for Sub-Saharan Africa (a region notorious for poor data quality) to extrapolate the values from an earlier paper (which was itself based on imputing the figures using phone surveys that did not ask the question directly).</p><p>In general I have a lot of faith in OWID. If they only report the data up to 2019, I strongly suspect this is for a good reason, and trying to work out how the 2023 sausage was made does not shift me from this prior.</p>", "parentCommentId": null, "user": {"username": "Larks"}}, {"_id": "CdtB48daJfMAoW5Je", "postedAt": "2023-10-17T09:14:33.495Z", "postId": "NxCeCpRqF4pkWQKkw", "htmlBody": "<p>I'm sympathetic to that take as well, but after reading psychology, RCT results and living in Uganda for 10 years it doesn't surprise me at all that the \"real\" value of a net could be 10x cash, yet people don't buy them.</p>\n<p>Yes your points about lack of information, lack of markets and externalities can explain the gap in part. Also short term thinking is a big problem.</p>\n<p>Even just prioritising urgent over important is a massive and understandable issue. For example sending kids to school in Uganda is so highly valued, yet most people can't send all their kids to school (especially once some reach high school age) so every shilling could be spent there alone. Then there are medical fees, cultural events like funerals and weddings which are highly prioritized, bride prices etc. In this context making the decision to spend 3 to 5 dollars on a mosquito net is no joke.</p>\n<p>There's also the issue now with nets specifically that they are seen as a \"free\" item,  because they normally are, given away every few years. This means people will often hold out and wait to receive them for free rather than buy them even if they do value them quite highly. Only my richest friends here would even think of buying a net almost based on this alone I think, even disregarding other reasons.</p>\n<p>There are some great examples in \"poor economics\" which talk about similar issues as well.</p>\n<p>Maybe sending 200 billion dollars a year or whatever of cash would fix all the problems and make these issues obsolete, but between now and 200 billion I'll probably lean towards nets and other effective interventions one the EA front while encouraging givedirectly to access as much funding they can through all other means possible.  I hope they are giving away billions a year within a few years.</p>\n", "parentCommentId": "QghPYcnrtGtE4fh4y", "user": {"username": "NickLaing"}}, {"_id": "DtqResu6jF7KAtawK", "postedAt": "2023-10-17T11:38:11.906Z", "postId": "NxCeCpRqF4pkWQKkw", "htmlBody": "<p>Thanks that makes sense. This reasoning seems at I risk of being motivated given what givedirectly does, but I get what you mean now.</p>\n", "parentCommentId": "2WyCWrGsudjdnPryk", "user": {"username": "NickLaing"}}, {"_id": "ENxxHfZDh5YTeYvqX", "postedAt": "2023-10-17T11:50:35.250Z", "postId": "NxCeCpRqF4pkWQKkw", "htmlBody": "<p>$258B for one year</p>\n", "parentCommentId": "qC33jva3FmMfK2Hgw", "user": {"username": "Jeff_Kaufman"}}, {"_id": "FiWwkjQFNGZy99cz9", "postedAt": "2023-10-17T13:46:53.181Z", "postId": "NxCeCpRqF4pkWQKkw", "htmlBody": "<p>As people escape extreme poverty, that total decreases year-over-year -- <a href=\"https://youtu.be/2DUlYQTrsOs?si=aggeyDFGaMReh91W&amp;t=647\">explained in detail here</a>.&nbsp;</p>", "parentCommentId": "ENxxHfZDh5YTeYvqX", "user": {"username": "givedirectly"}}, {"_id": "mHb8LRvjmAyhppHbb", "postedAt": "2023-10-17T14:28:45.726Z", "postId": "NxCeCpRqF4pkWQKkw", "htmlBody": "<p>Sorry, I was too terse! I agree that we should expect this amount to decline over time. I was trying to clarify that despite my parent saying \"until\" the $258B estimate was not a total cost.</p>\n<p>(I've edited my comment to change \"annually\" to \"for one year\".)</p>\n", "parentCommentId": "FiWwkjQFNGZy99cz9", "user": {"username": "Jeff_Kaufman"}}, {"_id": "o8EpuKiFfJSopRALX", "postedAt": "2023-10-17T14:37:58.459Z", "postId": "NxCeCpRqF4pkWQKkw", "htmlBody": "<p>That makes sense to me, and matches with what I see in the post. I find the title a little surprising/misleading compared to what you've said here</p>\n", "parentCommentId": "aWhTuYhL6f4cozi5f", "user": {"username": "Khorton"}}, {"_id": "xCGwcmpgqNxggr2ig", "postedAt": "2023-10-17T14:38:20.723Z", "postId": "NxCeCpRqF4pkWQKkw", "htmlBody": "<p>Number 3 for me, although I didn't vote</p>\n", "parentCommentId": "2XErnp9BjM63m6Nqu", "user": {"username": "Khorton"}}, {"_id": "L4HBdqJFMRhdDFLmA", "postedAt": "2023-10-17T14:53:02.760Z", "postId": "NxCeCpRqF4pkWQKkw", "htmlBody": "<blockquote><p><a href=\"https://forum.effectivealtruism.org/users/givedirectly?from=post_header\"><strong>GiveDirectly</strong></a><strong>, </strong><a href=\"https://forum.effectivealtruism.org/users/effective-altruism-australia?from=post_header\"><strong>Effective Altruism Australia</strong></a><strong>, </strong><a href=\"https://forum.effectivealtruism.org/users/ea-aotearoa-new-zealand?from=post_header\"><strong>EA Aotearoa New Zealand</strong></a><strong>, </strong><a href=\"https://forum.effectivealtruism.org/users/every-org?from=post_header\"><strong>Every.org</strong></a><strong>, </strong><a href=\"https://forum.effectivealtruism.org/users/the-life-you-can-save?from=post_header\"><strong>The Life You Can Save</strong></a></p></blockquote><p>What's going on with the coauthorship here - multiple organizations wrote this post together? Should this be read as endorsements, or something else?</p>", "parentCommentId": null, "user": {"username": "burner"}}, {"_id": "xzeFjktJzfNjAM3N2", "postedAt": "2023-10-17T15:07:33.900Z", "postId": "NxCeCpRqF4pkWQKkw", "htmlBody": "<p>Sorry, yep, I meant to add an \"annually\" there!</p>", "parentCommentId": "ENxxHfZDh5YTeYvqX", "user": {"username": "Stephen Clare"}}, {"_id": "eeRCEre2ipLywwrSH", "postedAt": "2023-10-17T15:15:25.878Z", "postId": "NxCeCpRqF4pkWQKkw", "htmlBody": "<p>Great comment, I appreciate this perspective and have definitely updated towards thinking the 10x gap is more explainable than I thought.</p><p>I do note that some of the examples you gave still leave me wondering if the families would rather just have the cash. Sure, perhaps it would be spent on high-priority and perhaps social signal-y things like weddings. But if they can't currently afford to send all their kids to school or other medical treatment, I wonder if they'd sensibly rather have the cash to spend on those things than a bednet.</p><p>(Also, my understanding from <a href=\"https://www.givedirectly.org/research-on-cash-transfers/\">surveys of cash recipients</a> is that most <i>do</i> spend their money on essentials or investments.)</p>", "parentCommentId": "CdtB48daJfMAoW5Je", "user": {"username": "Stephen Clare"}}, {"_id": "JgZfPPndXsSvn2x8R", "postedAt": "2023-10-17T15:17:27.823Z", "postId": "NxCeCpRqF4pkWQKkw", "htmlBody": "<p>I disagree with a lot of your arguments here.&nbsp;</p><ol><li>I disagree that anyone's primary goal should be to end extreme poverty, defined as living on less than $2.15 per day. The threshold is completely arbitrary. Nothing special happens at reaching $2.16 and we should not act as though it does. Even if we shifted everyone in Sub-Saharan Africa up to $2.16 per day, that would not be a satisfactory situation. Many people above the extreme poverty line are still in serious poverty. I think the goal should be to increase living standards across the board in poor countries, i.e. we need to increase economic growth in poor countries. Direct cash transfers are not plausibly among the top ways to increase economic growth in poor countries. The main predictor of extreme poverty rates in a country is the median income of that country. No country has ever eliminated extreme poverty through cash transfers. The main driver has always been broad-based economic growth, which is primarily driven by changes in economic policy, not by direct aid.&nbsp;</li><li>If we abandon the goal of minimising extreme poverty, then I think it becomes clear that direct cash transfers are not the best way to improve the living standards of people in developing countries. Around <a href=\"https://data.worldbank.org/indicator/DT.ODA.ALLD.CD\">$200 billion</a> is spent on international aid each year, about $550 million per day. Around 690 million people are in extreme poverty. If we assume that all of the people in extreme poverty are on $1 per day and we spent all international development aid on cash transfers to the extreme poor, then we could increase the income of all of the extreme poor by around $1.25 per day. This would eliminate extreme poverty. However, it would also increase the income of the extreme poor to $2.25 per day. I don't think this is an outcome we should be at all happy with, and I think it would be a misuse of resources.&nbsp;</li></ol>", "parentCommentId": null, "user": null}, {"_id": "Noys3Mbux7CWonM3j", "postedAt": "2023-10-17T15:55:45.803Z", "postId": "NxCeCpRqF4pkWQKkw", "htmlBody": "<p>Given that Open Philanthropy seems to believe that typical GiveWell recommendations are dominated by more leveraged ones (e.g.using advocacy, induced technological change) at least for risk-neutral donors, I am a bit confused by the anchoring on GiveWell charities.</p><p>Even if GD were closer to AMF than GiveWell thinks, this would not put GD close to the best thing one can do to improve human welfare unless one applies a very narrow frame (risk-aversion, highly scalable based on existing charities right now).</p><p>Or, put a bit differently:</p><ul><li>(1) We live in a world that has lots of mechanisms in it that make it quite unlikely that something like marginal consumption changes is close to the best use of money -- stuff like public good provision, negative and positive externalities, other market failures, policies, technologies etc. with global ramifications etc.</li><li>(2) Obviously, it is much harder and uncertain to positively shape the trajectory of, say, rapid malaria vaccines, or trade policy, or to positively influence development aid at large, which is why GD is a good fallback for risk-averse donors and a great baseline to exist.</li><li>(3) But it seems extremely unlikely that GiveDirectly is anywhere close to the best thing and it also seems far from clear that pushing the narrative more in the direction of \"let's do more cash transfers\" is good on net, unless one is quite sure that the benefits in explainability and scaleability outweigh the impact differential on a per dollar basis on finding and funding interventions with higher EV.<ul><li>E.g. I would not be surprised if we could find 100 GD interventions in the leveraged GHD space and it is not super clear that we could get less than 1/10th of the funding for them as for GD / a cash transfer centric approach.<br><br>&nbsp;</li></ul></li></ul>", "parentCommentId": "CdtB48daJfMAoW5Je", "user": {"username": "jackva"}}, {"_id": "DGdG5wopLFXYkgvv5", "postedAt": "2023-10-17T16:09:13.801Z", "postId": "NxCeCpRqF4pkWQKkw", "htmlBody": "<p>Oh I'm almost sure they would rather have the cash, I'm not arguing against that. And yes the evidence is clear that they mostly spend it on essentials - I would argue most of the items considered investments you see (iron roofs, motorbikes etc.) are borderline essentials anyway, or at least you could call them an investment in everyday welfare that will quickly pay dividends either in future wellbeing or financially.<br><br>Which one is more effective though depends on how much we weight preference. Give Directly (see their comment) weight the preferences of the recipients most heavily <i><strong>\"GiveDirectly believes that the weights that should count the most are those of the specific people we’re trying to help\" </strong></i>(Givedirectly's \"North star), while GiveWell (and myself) more heavily weight objective measures, like DALYs averted/QALYs gained and longer term financial benefits, which is where mosquito nets will dominate whatever people can spend the equivalent 5 dollars on.&nbsp;<br><br>For example that 5 dollars might pay for half a term's school fees at a crappy village school (which will bring some benefit), wheras sleeping under a net for 2 years might reduce time off school and improve iron levels which helps learning and brain development, while also reducing the chance of dying or serious disability. Not too hard to see the potential 10x benefit. Apologies if this is obvious and I'm sucking eggs here.<br><br>I do wonder though how much motivated reasoning comes into give directly's take on impact. Obviously if we weight pure preference most heavily, cash will dominate everything - perhaps even Strongminds measured by Wellbys ;). I know from experience how hard it is as someone running an NGO not to lean (or even swing) towards measures which will seem to favour your own intervention above others.</p>", "parentCommentId": "eeRCEre2ipLywwrSH", "user": {"username": "NickLaing"}}, {"_id": "iJkcrJscM9KeYtgtM", "postedAt": "2023-10-17T16:12:52.536Z", "postId": "NxCeCpRqF4pkWQKkw", "htmlBody": "<p>Love this and I mostly agree with your points. I do think though that GiveWell is the easiest thing to compare to in this case, and that's probably fair enough. Comparing to very different and harder-to-measure policy and tech work is less easy to understand and feels a bit disparate.<br><br>My only tiiiiiiny nicpick would be your point 2 - I don't think its that hard to positively shape the trajectory of malaria vaccines (although yes trade policy and influencing development aid is hard-ish). The uncertainties are high yes, but especially with malaria vaccines I would hazard a guess that even the lower end of the effect range might compete with GiveDirectly. Can't be bothered trying to calculate that right now though :D :D :D&nbsp;</p>", "parentCommentId": "Noys3Mbux7CWonM3j", "user": {"username": "NickLaing"}}, {"_id": "7okZRTEQKaumbo58j", "postedAt": "2023-10-17T16:59:47.426Z", "postId": "NxCeCpRqF4pkWQKkw", "htmlBody": "<p>Responding below, much of which are direct quotes from the original post.&nbsp;</p><p><strong>Eradicating extreme poverty is not a high bar, it's actually the lowest and one very much worth clearing.&nbsp;</strong></p><ul><li>The $2.15/day threshold is not \"completely arbitrary.\" It's set by the World Bank, is an estimate of what a person needs to afford a basic basket of goods including food, clothing, and shelter. It’s a rough measure of how many live in unacceptable deprivation in our wealthy world.</li><li>While this metric is limited, it’s also quite descriptive. The many symptoms of poverty – disease, starvation, education deprivation, psychological suffering – are improved when a family is less monetarily poor, and further still when their whole community is less poor.&nbsp;</li></ul><p><strong>Cash transfers have been shown to grow the wider economy</strong></p><ul><li>As cash transfers are spent by recipients, the cash multiplies. <a href=\"https://onlinelibrary.wiley.com/doi/full/10.3982/ECTA17945\">Research finds</a> that because people spend this money locally buying goods, starting businesses, visiting clinics, or going to school, the local economy can grow by as much as 2.5x what you give. In effect, the money you give grows the entire economy.&nbsp;</li><li>Researchers also found minimal inflationary effects: “Average price inflation is 0.1%, and even during periods with the largest transfers, estimated price effects are less than 1%.”</li></ul><p><strong>Many countries use cash transfers to eliminate extreme poverty, which economic growth alone will not solve.</strong> (<a href=\"https://www.givedirectly.org/extreme-poverty-2023/#:~:text=A%20cash%20transfer%20is%20the%20boost%20many%20need%20to%20escape%20poverty\">more here</a>)</p><ul><li>Cash transfers alone will not eradicate extreme poverty, as countries also need essential public goods like access to healthcare, well-maintained infrastructure, and dependable institutions to foster a thriving economy. However, cash transfers are still needed to help people take full advantage of these resources.&nbsp;</li><li>Take Rwanda as an example:&nbsp;<ul><li>Over the past three decades, Rwanda has maintained peace and security, with the GDP growing annually <a href=\"https://data.worldbank.org/country/rwanda\">by 5-10%</a>.</li><li>The government has <a href=\"https://borgenproject.org/healthcare-in-rwanda/\">invested</a> in education and healthcare, providing subsidies to make them widely accessible.</li><li>Despite these commendable strides, <a href=\"https://data.worldbank.org/country/rwanda\">over half</a> of Rwandans still live in extreme poverty.</li><li>This is why Rwanda is now <a href=\"https://www.newtimes.co.rw/article/5618/news/rwanda/rwanda-givedirectly-to-strengthen-partnership-in-poverty-reduction\">using cash transfers</a> as part of their social safety net to help their poorest citizens take full advantage of these other opportunities.&nbsp;</li></ul></li><li>Even China, widely recognized for its economic growth and poverty reduction efforts, is <a href=\"https://socialprotection.org/discover/publications/unconditional-cash-transfers-china-who-benefits-rural-minimum-living-standard#:~:text=China's%20rural%20dibao%20program%20aims,order%20to%20receive%20the%20transfer.\">using cash transfers</a> to lift the final ~1% of their population out of extreme poverty. For more on why we should not expect extreme poverty to “solve itself” overtime through economic growth alone,&nbsp;<a href=\"https://www.worldbank.org/en/news/press-release/2014/04/10/ending-poverty-requires-more-than-growth-says-wbg#:~:text=Growth%20alone%20is%20unlikely%20to,their%20lives%20is%20extremely%20difficult.\"><u>read here</u></a>.</li></ul>", "parentCommentId": "JgZfPPndXsSvn2x8R", "user": {"username": "givedirectly"}}, {"_id": "69gPBXmshiux9DXzX", "postedAt": "2023-10-17T17:06:16.009Z", "postId": "NxCeCpRqF4pkWQKkw", "htmlBody": "<p>Fair point re: \"nearly twice\" vs. \"over 50%.\" Edited original point to reflect this update.&nbsp;</p><p>To the second point, the differences in data sources seem moot to the overall argument. If we stick just to OWID's visual from 1990 to 2019 (<a href=\"https://blogs.worldbank.org/opendata/poverty-back-pre-covid-levels-globally-not-low-income-countries?CID=WBW_AL_BlogNotification_EN_EXT\">pre-COVID</a>), this is is still a 117 million person (43%) increase of the number people living in extreme poverty since 1990, which is certainly an undercount given the well-documented setbacks post 2019.&nbsp;</p>", "parentCommentId": "LXKGbJfraohRhg2NW", "user": {"username": "givedirectly"}}, {"_id": "tjgDJ55tC3eLjDsDn", "postedAt": "2023-10-17T18:41:28.132Z", "postId": "NxCeCpRqF4pkWQKkw", "htmlBody": "<p>Hello, thanks for the response.&nbsp;</p><ul><li>I don't agree that the threshold is not completely arbitrary. I agree that it is set by the World Bank, but I don't agree that means it is not arbitrary. If everyone in the world lived on $2.16 per day, I don't think we would have reduced what you call \"unacceptable deprivation\" to zero, I think the world would be in dire straits.&nbsp;</li><li>Pretty much all measures of wellbeing, subjective and objective, increase at <a href=\"https://ourworldindata.org/grapher/global-hunger-index-vs-gdp-per-capita\">exactly</a> <a href=\"https://ourworldindata.org/grapher/learning-outcomes-vs-gdp-per-capita\">the</a> <a href=\"https://ourworldindata.org/grapher/child-mortality-gdp-per-capita\">same</a> <a href=\"https://ourworldindata.org/grapher/gdp-vs-happiness\">rate</a> <a href=\"https://ourworldindata.org/grapher/life-expectancy-vs-gdp-per-capita\">throughout</a> the whole of the income distribution. Drawing an extremely low line and defining everything below that line as the problem is therefore a mistake. I agree that the symptoms of poverty decrease when people are less monetarily poor, but I don't think that counts in favour of using life below $2.15 per day as the measure of poverty.</li><li>It is not plausible that cash transfers are the top 100 (or 1,000) ways to reduce extreme poverty in poor countries. One piece of evidence for this is historical: for all countries that have ever eliminated extreme poverty, the things that caused that were never cash transfers. Rather, they were usually caused by changes in economic policy.&nbsp;<ul><li>On the example of Rwanda. GDP per capita in Rwanda is around <a href=\"https://thedocs.worldbank.org/en/doc/bae48ff2fefc5a869546775b3f010735-0500062021/related/mpo-rwa.pdf\">$960 per person</a>, or around $2.60 per day. You say that \"Despite these commendable strides, <a href=\"https://data.worldbank.org/country/rwanda\">over half</a> of Rwandans still live in extreme poverty.\" Since the average income is $2.60 per day, it is not surprising that more than half of the population lives on less than $2.15 per day. This is an argument for the necessity of economic growth, not an argument for cash transfers.&nbsp;</li><li>Taking your example of China. The thing that caused China to massively reduce extreme poverty was economic liberalisation under Deng, e.g. agricultural liberalisation, international trade etc. Even if they are now, as a middle income country, using cash transfers to reduce extreme poverty, that is not an argument for the claim that in poor countries cash transfers will be more effective than changes in economic policy in reducing extreme poverty, on the current margin. China is the most striking counterexample to that claim in history.&nbsp;</li></ul></li><li>\"Many countries use cash transfers to eliminate extreme poverty, which economic growth alone will not solve.\" \"we should not expect extreme poverty to “solve itself” overtime through economic growth\"<ul><li>Empirically, this is not correct. The median income in a country ~completely explains levels of extreme poverty in that country. Increasing median income is empirically necessary and sufficient for the elimination of extreme poverty. Very nearly all of the observed variation in extreme poverty rates, on any poverty line, is explained by median income - the R^2 is above 0.98 &nbsp;(<a href=\"https://lantpritchett.org/wp-content/uploads/2019/12/RCTs-and-the-big-questions_10000words_june30.pdf\">Pritchett 2019</a>)</li></ul></li></ul><p>&nbsp;<img src=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/tjgDJ55tC3eLjDsDn/qrffqenqgyjacnkdfs8q\" srcset=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/tjgDJ55tC3eLjDsDn/zccn9udmcczf8xxayupc 130w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/tjgDJ55tC3eLjDsDn/hdoavlwxnfcr4rghjuzc 260w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/tjgDJ55tC3eLjDsDn/yepyg5zk8kyzoshen7iy 390w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/tjgDJ55tC3eLjDsDn/telxr21qd2rgaza1qxwt 520w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/tjgDJ55tC3eLjDsDn/j7zio36wqd5pbkkclm15 650w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/tjgDJ55tC3eLjDsDn/zvlb0d6ybp2kvl9fjbhn 780w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/tjgDJ55tC3eLjDsDn/bwwn24lxzwqnm4qv0lur 910w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/tjgDJ55tC3eLjDsDn/ehla9gdjvszqxxvxo4vl 1040w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/tjgDJ55tC3eLjDsDn/uguw7kypzrfl0nxzteiq 1170w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/tjgDJ55tC3eLjDsDn/orxhgidzxcpucyq0gc64 1300w\"></p><figure class=\"image\"><img src=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/tjgDJ55tC3eLjDsDn/cha1lj1evpdd95dtawhi\" srcset=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/tjgDJ55tC3eLjDsDn/coahqvzkpjrgko74dki8 130w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/tjgDJ55tC3eLjDsDn/ozfrcdrewjjpko8fvwib 260w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/tjgDJ55tC3eLjDsDn/vrqfjiycnbiuflrjigta 390w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/tjgDJ55tC3eLjDsDn/wy2bxnjexqmfgjrnrzpu 520w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/tjgDJ55tC3eLjDsDn/crpwkswycrylutsbknrj 650w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/tjgDJ55tC3eLjDsDn/j1vau7rp4wbobfald9ct 780w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/tjgDJ55tC3eLjDsDn/hek6ylzhsbs5nm7ctiui 910w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/tjgDJ55tC3eLjDsDn/s0o9vdkcr6rgx6tarhur 1040w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/tjgDJ55tC3eLjDsDn/bhvrvll3rbicb4tozoti 1170w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/tjgDJ55tC3eLjDsDn/dpdhda7mpdpvgvmiga0b 1260w\"></figure><figure class=\"image\"><img src=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/tjgDJ55tC3eLjDsDn/fo7j71ynvw3ouonuc1cc\" srcset=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/tjgDJ55tC3eLjDsDn/mts6zha04rnvkzm2pmgd 140w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/tjgDJ55tC3eLjDsDn/n3brkgwzonq3zc1xecme 280w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/tjgDJ55tC3eLjDsDn/cgk5colg2tlajzpatmwf 420w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/tjgDJ55tC3eLjDsDn/jzq54vllyitkoowbhuh5 560w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/tjgDJ55tC3eLjDsDn/dgu2nyds8cpbir97z8mp 700w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/tjgDJ55tC3eLjDsDn/svti13oyfpdnwqo6wqw2 840w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/tjgDJ55tC3eLjDsDn/pftsbf7u7qj4awaiseem 980w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/tjgDJ55tC3eLjDsDn/uludo288ajesrj5jzmhq 1120w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/tjgDJ55tC3eLjDsDn/bsydionuvv1k1cmlcbyi 1260w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/tjgDJ55tC3eLjDsDn/lymmzyydxgfgows5iyrg 1332w\"></figure>", "parentCommentId": "7okZRTEQKaumbo58j", "user": null}, {"_id": "7FEFN6GjZ9Xvo5pMm", "postedAt": "2023-10-17T18:47:22.246Z", "postId": "NxCeCpRqF4pkWQKkw", "htmlBody": "<blockquote><p>With much of the $200B/year in Official Development Assistance going to <a href=\"https://www.devex.com/news/opinion-cash-transfers-should-be-the-default-not-just-the-benchmark-106220\">interventions of question effectiveness</a> and <a href=\"https://www.bostonglobe.com/2021/12/04/opinion/while-poverty-rises-charitable-donations-are-collecting-dust/#:~:text=This%20%E2%80%9Ccommit%20now,four%20years%20alone.\">over a trillion dollars</a> sitting in private foundations, the EA movement can and should open the aperture of how it thinks about what it recommends beyond the marginal donation.&nbsp;</p><p>We're optimistic the movement could influence existing pots of money orders of magnitude larger than what it does today, thus doing even more good in the world.&nbsp;This could perhaps have been more clearly argued in the post, open to your thoughts / feedback!&nbsp;</p></blockquote><p>FWIW I think this is quite interesting and worth putting in the original post. Fundamentally, EAs might (reasonably) disagree with the best use of $500M in the realm of global health but I think the argument that direct cash transfers could be a cost-effective use of $200B/year in Official Development Assistance, where other interventions we've found aren't maybe that scalable, is one worth talking about.&nbsp;</p><p>Similarly, I think the ambition to move past just influencing marginal EA dollars (very small relatively) to government aid funding is also exciting and gets around some of the critiques by folks on this post (e.g. it's much better than the counterfactual, more scalable than GiveWell interventions, governments can't/won't fund policy advocacy to improve their own aid, etc etc.)</p>", "parentCommentId": "XDGL85RE77bqubtsL", "user": {"username": "JamesOz"}}, {"_id": "KozZzfEbSCTXqM4yR", "postedAt": "2023-10-17T19:03:49.323Z", "postId": "NxCeCpRqF4pkWQKkw", "htmlBody": "<p>In theory people will always prefer cash because they can spend it on whatever they want (unless of course it is difficult to buy what they most want). This isn’t really up for debate.</p>\n<p>What is up for debate is if people actually spend money in a way that most effectively improves their welfare. It sounds paternalistic to say, but I suspect they don’t for the reasons Nick and others have given.</p>\n", "parentCommentId": "eeRCEre2ipLywwrSH", "user": {"username": "jackmalde"}}, {"_id": "8mAAo4HKrv5Fe2zsf", "postedAt": "2023-10-17T19:35:37.958Z", "postId": "NxCeCpRqF4pkWQKkw", "htmlBody": "<p>Thanks John for this insightful set of comments I have enjoyed them immensely.</p><p>The $2.15 per day threshold is arbitrary yes, and it also makes me angry sometimes. The idea that for $2.15 in Uganda, you can feed and clothe your family, send your kids to school, pay school fees, pay for healthcare and buy the technology and transport needed to do OK in the world for only $2.15 a day is borderline absurd. I'm thinking of writing a post about this threshold actually as I think it misleads a lot of people. Yes life is cheaper here, but nowhere near that much cheaper.</p><p>I might push back a bit on your comment <i><strong>\"For all countries that have ever eliminated extreme poverty, the things that caused that were never cash transfers. Rather, they were usually caused by changes in economic policy. </strong></i>I think this is an oversimplification. Many African countries have had very liberal economic policy for the last 20-40 years and they haven't seen the kind of growth China and Southeast Asia have seen. I'm not saying economic policy isn't important, but listing it as \"<strong>the cause\" </strong>of the development boom in China and many other countries seems oversimplified.<br><br><i><strong>\"The thing that caused China to massively reduce extreme poverty was economic liberalisation under Deng, e.g. agricultural liberalisation, international trade etc. \"</strong></i>For sure the liberalisation <i><strong>allowed </strong></i>the development to happen - it couldn't have happened without the policy changes, but many other factors were needed as well. I'm far from an expert but some of these might include a high quality education system, fortunate timing in becoming &nbsp;the industrial powerhouse of the world, massive investment into local infrastructure and the one child policy.</p><p>I would be interested as a side note though to hear your thoughts on why liberalising African economies seems to have achieved so little in many cases.</p>", "parentCommentId": "tjgDJ55tC3eLjDsDn", "user": {"username": "NickLaing"}}, {"_id": "nxPbjn2ncYcYD387h", "postedAt": "2023-10-17T19:37:01.434Z", "postId": "NxCeCpRqF4pkWQKkw", "htmlBody": "<p>I think even for something that seems quite certain on the intervention level (if you think that is true for malaria vaccine) then one needs to account for funding and activity additionality which make this more uncertain and, relatively speaking, lowers the estimate to GD where the large size of the funding gap ensures funding and activity additionality to be near 1 (i.e. no discount).</p>\n", "parentCommentId": "iJkcrJscM9KeYtgtM", "user": {"username": "jackva"}}, {"_id": "oHjMaMaFEcjiWHxZg", "postedAt": "2023-10-17T20:00:58.344Z", "postId": "NxCeCpRqF4pkWQKkw", "htmlBody": "<p>Hi Nick,&nbsp;</p><p>I agree with your first comment. The idea that living on &gt;$2.15 is in any sense an acceptable standard of living is clearly incorrect. A world in which everyone lives on $2.16 per day might be a decent enough outcome after a nuclear winter, but it definitely should not be a core global development goal.</p><p>I agree on your second comment.&nbsp;</p><p>I agree on the third comment, but not on some of the specifics. In any case, the changes were driven by national level systemic policy changes, not by direct targeted aid.&nbsp;</p><p>I'm not best placed to speculate on the last question. &nbsp;</p>", "parentCommentId": "8mAAo4HKrv5Fe2zsf", "user": null}, {"_id": "xiuiPprHaDmLFgwH3", "postedAt": "2023-10-17T22:21:59.171Z", "postId": "NxCeCpRqF4pkWQKkw", "htmlBody": "<p>Good call! Added</p>", "parentCommentId": "7FEFN6GjZ9Xvo5pMm", "user": {"username": "givedirectly"}}, {"_id": "9BLpKDeM2HXZZSAjx", "postedAt": "2023-10-17T23:09:00.602Z", "postId": "NxCeCpRqF4pkWQKkw", "htmlBody": "<p>Effective Altruism Australia is partnering with GiveDirectly to promote a matching opportunity for International Day for the Eradication of Poverty for Australian donors, amongst promoting our other partners which target extreme poverty and improving and saving the life of those living today.</p><p>From the post:</p><blockquote><p>If you have generous friends or family who could give more effectively, consider sending them to&nbsp;<a href=\"http://givedirectly.org/donate\"><u>GiveDirectly</u></a>, or maximize their impact this month by having donations matched via:</p><ul><li><a href=\"https://ayudaefectiva.org/dia-erradicacion-pobreza-2023\">Ayuda Efectiva</a></li><li><a href=\"https://www.charityvest.org/community-funds/2hixdm/match-cash-for-families-in-poverty\">Charityvest</a></li><li><a href=\"https://effectivealtruism.org.au/GD-match/\">EA Australia</a></li><li><a href=\"https://effectivealtruism.nz/poverty-eradication-day-2023\">EA New Zealand</a></li><li><a href=\"https://www.every.org/givedirectly/f/match-poverty-eradication\">Every.org</a></li></ul></blockquote>", "parentCommentId": "L4HBdqJFMRhdDFLmA", "user": {"username": "Effective Altruism Australia"}}, {"_id": "LRyWfk2hq3HLnWXTG", "postedAt": "2023-10-18T05:11:00.863Z", "postId": "NxCeCpRqF4pkWQKkw", "htmlBody": "<p>While I'm generally sympathetic to GiveDirectly's position (I really like their work on so many fronts and think that cash outperforms so many interventions), it seems intuitive to me that it often won't outperform the very best interventions until we have a lot more funding supply (and I applaud their ambition for increasing that funding supply).</p><p><strong>I often think of interventions like bednets as analogous to vaccines</strong> (something else that is often distributed for free when there's a widespread disease instead of sold for cash) for a few reasons:</p><ol><li><strong>Stopping the spread</strong>: Much like vaccines, bednets are not just about protecting an individual but also the wider community. They achieve this by disrupting the lifecycle of malaria parasites and thereby stopping their spread. This is somewhat similar to how vaccines work to achieve herd immunity, protecting even those who are not vaccinated.<br><img style=\"width:40.19%\" src=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/LRyWfk2hq3HLnWXTG/zkiygffp8mb0rmqqvzk1\" srcset=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/LRyWfk2hq3HLnWXTG/vbdwkgp57uh8paxymxfi 120w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/LRyWfk2hq3HLnWXTG/vxriqrnjzjzhugfeupqk 240w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/LRyWfk2hq3HLnWXTG/fv1akegckyubizutqvjd 360w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/LRyWfk2hq3HLnWXTG/cgctxqgnbv8emej1n67b 480w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/LRyWfk2hq3HLnWXTG/lieeqkhvd8hhvpg7f2q9 600w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/LRyWfk2hq3HLnWXTG/l2jpz6wbv5lbo4uzobob 720w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/LRyWfk2hq3HLnWXTG/rdcmu9wn5a1glwoqkhnk 840w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/LRyWfk2hq3HLnWXTG/hab4dvw81prt1bl40evc 960w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/LRyWfk2hq3HLnWXTG/sy0gxgryypgcder387k9 1080w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/LRyWfk2hq3HLnWXTG/h2trawqd4w4h92ytsvpo 1200w\"></li><li><strong>Undervalued goods</strong>: Both bednets and vaccines are often undervalued by the very people who would benefit from them. This behavioural quirk might explain why people don't always buy bednets even when given cash. Similarly, vaccines are often more likely to be used when provided for free, underscoring the importance of removing cost barriers to accelerate their uptake.</li><li><strong>Economies of scale &amp; availability</strong>: When bednets or vaccines are distributed en masse to an entire region, not only do economies of scale make each unit more cost-effective, but availability also increases. If the purchase of these products were to rely solely on individual decisions made by recipients of cash transfers, there might be insufficient demand to justify large-scale supply, potentially leading to lower availability and higher costs per unit. This contrasts with targeted interventions, where bulk purchasing and distribution can ensure both cost-effectiveness and widespread availability.</li></ol><p>For these reasons I'm very glad that COVID vaccines were provided for free in my country instead of charged for and people given the equivalent amount of cash.</p><p>Cash transfers are a fantastic tool with broad utility but lack the targeted impact that you can get with specific interventions like bednets or vaccines for the reasons above.</p><p>I deeply understand the appeal of cash transfers and the autonomy they offer to recipients and think that they are something that can truly scale but feel like there are compelling and reasonably intuitive reasons for why interventions like providing bednets might be more effective at saving and improving lives.</p>", "parentCommentId": "QghPYcnrtGtE4fh4y", "user": {"username": "Luke Freeman"}}, {"_id": "gNPecX2woT5CvfieD", "postedAt": "2023-10-18T19:11:08.976Z", "postId": "NxCeCpRqF4pkWQKkw", "htmlBody": "<p>Thanks, that's helpful context!&nbsp;</p><p>I find it a bit weird - possibly unhelpful - to blend a big picture cause prioritization argument and the promotion of a specific matching campaign. &nbsp;</p>", "parentCommentId": "9BLpKDeM2HXZZSAjx", "user": {"username": "burner"}}, {"_id": "AyaZpbwzNMnQkeyYx", "postedAt": "2023-10-18T20:17:24.985Z", "postId": "NxCeCpRqF4pkWQKkw", "htmlBody": "<blockquote><p>If the purchase of these products were to rely solely on individual decisions made by recipients of cash transfers, there might be insufficient demand to justify large-scale supply, potentially leading to lower availability and higher costs per unit.&nbsp;</p></blockquote><p>One might even say that providing complete autonomy of choice between bednets and cash to recipients is impossible at a constant funding level. If one could do a widespread distribution of bednets for $2 a person in an area, it should often be feasible to distribute $2 (less administrative costs) to each person instead. However, if bednets now cost $3 because the efficiencies of mass distribution have been lost, then \"receive a bednet for free\" is no longer something the beneficiary can actualize. In other words, without increasing the funding to allow for \"choose between $2 cash or a $3 bednet,\" replacing bednets with cash doesn't really give those who prefer bednets the freedom to choose bednets.</p>", "parentCommentId": "LRyWfk2hq3HLnWXTG", "user": {"username": "Jason"}}, {"_id": "8eBMvtc2XKCja76Mx", "postedAt": "2023-10-19T01:27:02.806Z", "postId": "NxCeCpRqF4pkWQKkw", "htmlBody": "<p>Thanks for posting this. As far as agency and dignity, I think there are two potential cruxes here:</p><ul><li>I'd submit that the predominant beneficiary of GiveWell-style programs (like bednet provision) is actually children under 5, not older family members. (At least this is what GiveWell's rationale for the programs would lead us to conclude.) Children under 5 lack agency in the sense that cash vs. bednets would make a difference in their agency. Either way, someone else -- either parents/caregivers or aid workers -- &nbsp;is making the choice of how they benefit from aid for them.&nbsp;<ul><li>There might be reasons to think one or the other substitute decisionmakers would make a better choice for the young child, but the young child's agency and dignity wouldn't seem to be major factors here. Thus, while I think it is right to say that unconditional cash transfers promote agency and dignity, I would not say that bednet provision reduces them.</li></ul></li><li>I can also see agency/dignity tradeoffs when comparing unconditional cash transfers to conditional cash transfers (e.g., cash for vaccinating your child) or what I'll call indirect cash transfers. The former is a strong test case for conditional cash transfers . . . but I think a fair one since it describes a GiveWell top charity. A toy example of the latter would be a program that provided glasses to improve worker productivity, and thus worker salaries.&nbsp;<ul><li>At least in the cash-for-child-vaccination scenario, I would concede that the strings attached slightly reduce parent/caregiver agency and dignity. However, I would suggest the resultant increase in vaccination rates <i>improves </i>young-child agency in two ways. If the child dies from malaria, he or she loses the potential to exercise agency in the future. The same is true to the extent a child has a non-fatal case of malaria that limits his or her future functioning.</li><li>In the eyeglasses toy model, I'm not sure if there is a clear difference between giving someone $5 and giving them a $5 set of eyeglasses that raises their income by $5. On the one hand, in the direct-cash scenario, the beneficiary can choose not to wear glasses and still receive a benefit. On the other hand, some people would experience earning $5 from their work as more dignified than being given $5 as an act of charity. Either way, the beneficiary got $5, whether it was in the form of a check or the form of eyeglasses.</li><li>That toy model is, of course, not very realistic. But it seems plausible that programs could have a public-health effect and a secondary cash effect. The example that comes to mind is <a href=\"https://forum.effectivealtruism.org/users/nicklaing?mention=user\">@NickLaing</a>'s work with OneDay Health [cost-effectiveness sketch <a href=\"https://forum.effectivealtruism.org/posts/XpeamS2yTNhagxAip/remote-health-centers-in-uganda-a-cost-effective\">here</a>, with the COI disclosure that I assisted with parts of it.] While the primary impact is modeled through saving lives of under-5s who would not have counterfactually been treated (or treated early enough), there's a secondary indirect cash effect for patients who would have counterfactually sought care several hours away. Their transportation costs and lost income are lower, which seems equivalent to giving those patients' families a small amount of cash.</li></ul></li><li>All that is to say that it may be possible to conceptualize some other programs as cash-transfer programs with some different positive spillover effects than unconditional cash-transfer programs. That perhaps isn't the fairest mode of analysis to the other programs, whose primary intended effects are being categorized as spillover effects.&nbsp;<ul><li>But it might facilitate comparisons that are <i>slightly </i>more apples-to-apples than merely transforming impact scores using a set of moral weights. Suppose a conditional cash-transfer program moved 65% as much money into recipients' hands than an unconditional one [number totally made up]. We can then think about whether the bundle of positive spillover effects of the conditional program is sufficiently greater than the bundle for the unconditional program to justify the loss in efficiency.</li></ul></li></ul>", "parentCommentId": null, "user": {"username": "Jason"}}, {"_id": "n9orqNjLSvE6NhfKF", "postedAt": "2023-10-19T07:43:27.717Z", "postId": "NxCeCpRqF4pkWQKkw", "htmlBody": "<p>Further to this, one way to visualise this is to look at this <a href=\"https://onehundredhomes.in/the-homes/house/37/category/exterior\">website</a>, which has photos of homes for people in India at different levels of income. If you go through the houses, it is clear that nothing special happens at $2.15 per day. The quality of house improves slowly across the distribution. Nothing notable happens at $2.15 per day. Most of the houses for people on above $2.15 per day are of extremely poor quality</p><p>Here is a house of someone on $1.70 per day&nbsp;</p><figure class=\"image\"><img src=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/n9orqNjLSvE6NhfKF/mkv6hjm4f1hymqfp6lst\" srcset=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/n9orqNjLSvE6NhfKF/h0lnun6glsqdd5q8zvzo 200w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/n9orqNjLSvE6NhfKF/w2eoitts7kwy8mjis9px 400w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/n9orqNjLSvE6NhfKF/oc1sqyyifxddkhijaf8j 600w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/n9orqNjLSvE6NhfKF/ykci7ntqdqzicl5wkodc 800w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/n9orqNjLSvE6NhfKF/x2hnyuieyk9oq2l7qhni 1000w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/n9orqNjLSvE6NhfKF/r7gtni2jcju1idjluojm 1200w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/n9orqNjLSvE6NhfKF/ksdhbritpyp2daii8ion 1400w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/n9orqNjLSvE6NhfKF/o2leqmlrqfldwty67fnq 1600w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/n9orqNjLSvE6NhfKF/ijmoavmnqhlvvxrstq1z 1800w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/n9orqNjLSvE6NhfKF/twyglx6rmuylcm32imvi 1928w\"></figure><p>Below is a house of someone on $3.31 per day and is therefore not in extreme poverty. The house has no windows.&nbsp;</p><figure class=\"image\"><img src=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/n9orqNjLSvE6NhfKF/xiaw3hm9yimxgd4lvnnv\" srcset=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/n9orqNjLSvE6NhfKF/vlwnmypa6zoi1qwpuy5l 200w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/n9orqNjLSvE6NhfKF/f8ivgjxg8oqyaomf8bdd 400w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/n9orqNjLSvE6NhfKF/i26xomk3ysjybny04gte 600w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/n9orqNjLSvE6NhfKF/gyj6rekywdhzphfnircl 800w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/n9orqNjLSvE6NhfKF/ljenigejmsfeiizard0t 1000w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/n9orqNjLSvE6NhfKF/xsrny6vsqq3itihfajo8 1200w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/n9orqNjLSvE6NhfKF/bicbrpc7e7vykahzmzc2 1400w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/n9orqNjLSvE6NhfKF/ldjcalgxvif3i2jac2ur 1600w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/n9orqNjLSvE6NhfKF/ihfcwus8qojsiaricrno 1800w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/n9orqNjLSvE6NhfKF/icwqptoui43acsjo0fjg 1926w\"></figure><p>Below is a house at $3 per day. The roof is held up by wooden sticks.&nbsp;</p><figure class=\"image\"><img src=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/n9orqNjLSvE6NhfKF/bixkzwk6lye5s0znzrwq\" srcset=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/n9orqNjLSvE6NhfKF/maxmcybrjp0n47ymwtb6 200w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/n9orqNjLSvE6NhfKF/qumj1scdvpfle7y4ptlk 400w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/n9orqNjLSvE6NhfKF/b4p41uyjrmf1uijisfkc 600w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/n9orqNjLSvE6NhfKF/rwzy3djbjilwxpjdclv5 800w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/n9orqNjLSvE6NhfKF/a7elb1r5n1firlq56yke 1000w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/n9orqNjLSvE6NhfKF/xo2gbt7tjmi9wuzggt6o 1200w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/n9orqNjLSvE6NhfKF/b18aaalfrwhxwtmvjjlv 1400w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/n9orqNjLSvE6NhfKF/zexkejwlajcin8aqobxt 1600w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/n9orqNjLSvE6NhfKF/phq8s3fsbcmitfeatirv 1800w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/n9orqNjLSvE6NhfKF/ve8acnguommr7a0qn8gt 1920w\"></figure><p>This is the kitchen:</p><figure class=\"image\"><img src=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/n9orqNjLSvE6NhfKF/qk4gjn2es0kniec0e5r8\" srcset=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/n9orqNjLSvE6NhfKF/av2y1n1gyajz2z5mahib 220w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/n9orqNjLSvE6NhfKF/madft91qq2snxx5dfiig 440w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/n9orqNjLSvE6NhfKF/l5vsacn257k63i2zxyv2 660w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/n9orqNjLSvE6NhfKF/ajeyy6htkyotsvzo9z44 880w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/n9orqNjLSvE6NhfKF/v303e0x1s3ipvwivpgb5 1100w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/n9orqNjLSvE6NhfKF/yezrouc1nok9dig8mw5h 1320w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/n9orqNjLSvE6NhfKF/tranljwqwqs2hgndrcol 1540w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/n9orqNjLSvE6NhfKF/ws92lrbn0fiwhnpdpzwy 1760w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/n9orqNjLSvE6NhfKF/pozsevftkvqbxzvxc0cb 1980w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/n9orqNjLSvE6NhfKF/vvak3x4gavreqrfntdtg 2144w\"></figure><p>Here's the interior of another house</p><figure class=\"image\"><img></figure>", "parentCommentId": "JgZfPPndXsSvn2x8R", "user": null}, {"_id": "6GDFbm7HgjaWP4bd3", "postedAt": "2023-10-22T09:14:11.241Z", "postId": "NxCeCpRqF4pkWQKkw", "htmlBody": "<p>Thanks for the comment ludwig :) So I do sympathise with what you say, though I think that differences between Givewell, GiveDirectly, and the Happier Lives Institute are perhaps better modelled as disagreements about what counts as value (lives saved/QALY vs autonomy vs happiness as a gross oversimplification) than how to count it.</p><p>I think another thing that I'm slightly suspicious of here is the rigorous demands for GiveDirectly to show their workings vs bednets in this thread, but very little of the same rigour seems to apply to work in AI Safety for example - can those organisations show that their work is more effective than closing AMF's funding gap, or massively scaling up cash transfers to end extreme poverty? If we instead are justifying AI Safety work from a more pluralistic 'basket of moral goods' perspective, then I think GiveDirectly does well under that framing too.</p>", "parentCommentId": "spK7LvsbDLBrDzEJE", "user": {"username": "JWS"}}, {"_id": "oyN5aAapgz5YZ2ZML", "postedAt": "2023-10-23T00:34:38.410Z", "postId": "NxCeCpRqF4pkWQKkw", "htmlBody": "<p>I've respected cash transfers as an anti-poverty intervention since I read about 10+ years ago, and was really excited to find an NGO using them that I could donate to. I was further impressed by GiveDirectly's almost annoying insistence on using representative data instead of cherry-picking, even for website blurbs.</p><p>That history of transparency makes this post extra disappointing to me. &nbsp;This reads like every other charity asking for money and attention. I understand GD is trying to engage with a mainstream audience, but if you're going to publish on the EAForum I think you owe readers a less slippery post.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Elizabeth"}}, {"_id": "DGnTEbwKfFc24PwXx", "postedAt": "2023-10-26T14:05:22.749Z", "postId": "NxCeCpRqF4pkWQKkw", "htmlBody": "<p>Ranil Dissanayake actually just published <a href=\"https://asteriskmag.com/issues/04/between-the-lines-a-history-of-the-most-important-concept-in-global-poverty\">an article in Asterisk</a> about the history of the poverty line concept. The dollar-a-day (now $1.25 a day or something) line was kind of arbitrary and kind of not:</p><blockquote><p>rather than make their own judgment on what constituted sufficient living, they could instead rely on the judgment of poor countries themselves. They would simply take an average of the poorest countries in the world and declare this to be the global minimum of human sufficiency</p></blockquote><p>noting further in a footnote that</p><blockquote><p>Of course, things are never quite so pure: The bank was closely involved in the development of national poverty lines around the world, so there was some element of circularity to the development of the global line.</p></blockquote><p>The whole article is very interesting, worth a read for people in this space.</p>", "parentCommentId": "tjgDJ55tC3eLjDsDn", "user": {"username": "Stephen Clare"}}, {"_id": "iwyMwDc8aAMhTJHRd", "postedAt": "2023-11-07T13:15:50.464Z", "postId": "NxCeCpRqF4pkWQKkw", "htmlBody": "<p>I'm a bit late, but hopefully you're still monitoring this. I've been donating to GiveDirectly for a number of years now, and support your work and mission.&nbsp;<br><br>I'd love to learn more about how Give Directly imagines these public goods will arise, however. To me, this limitation depending on public good provision is the core limitation of cash transfers. Yes, cash transfers can help people access public goods such as education and healthcare in places such as Rwanda where you mentioned (I don't know the detailed context of Rwanda but will suppose that education and healthcare are available and of sufficient quality for the sake of argument), but there are still many countries, particularly in remote settings, where such public goods - particularly of a high quality - are not available.&nbsp;<br><br>At Give Directly do you view your work as providing the cash transfers only, and see it as up to others to try to fix the adequate public good provision problem? Does giving cash transfers allow you to access and influence governments in the countries you operate? Do you have any theory of change of how EAs, development agencies etc can best advance adequate public good provision, particularly in areas prone to conflict (e.g. the Sahel), and/ or corruption?<br><br>Otherwise, it seems that cash transfers could certainty <i>reduce</i> extreme poverty, perhaps very well, but are unlikely to <i>end</i> poverty. This is particularly pertinent if you define poverty also in terms of access to adequate services (as implied by the Global Multidimensional Poverty Index, for instance), or in terms of assets (Reardon and Vosti, 1995) (e.g. due to agricultural land being divided up into smaller and smaller holdings when inherited due to population growth).&nbsp;</p>", "parentCommentId": "7okZRTEQKaumbo58j", "user": {"username": "Luke Spajic"}}]