[{"_id": "WaJ5SPt2YLz2tKvey", "postedAt": "2023-01-17T23:13:10.142Z", "postId": "Ny3v2Qe4LfaYJYKcq", "htmlBody": "<p>Thanks for the post, I found that interesting!&nbsp;<br><br>Sorry you felt like you'd make mistakes here. We all make mistakes, I make them constantly.&nbsp;<br><br>I look forward to your future posts.</p>", "parentCommentId": null, "user": {"username": "oagr"}}, {"_id": "3tknwuW75uC4dyefm", "postedAt": "2023-01-18T01:04:17.560Z", "postId": "Ny3v2Qe4LfaYJYKcq", "htmlBody": "<p>Hey Manuel,<br>thanks for pointing this out.&nbsp;<br><br>Your first post passed the scrutiny. Congratulations. ;-)<br><br>I suggest adding a link to the Amazon page with the book. Like this: <a href=\"https://www.amazon.com/-/en/dp/019765570X/\">https://www.amazon.com/-/en/dp/019765570X/</a> or better inside your text like <a href=\"https://www.amazon.com/-/en/dp/019765570X/\">this</a>.<br><br>You are welcome.</p>", "parentCommentId": null, "user": {"username": "Felix Wolf"}}, {"_id": "9inhhfn3sgEaM6zxW", "postedAt": "2023-01-18T02:01:32.283Z", "postId": "Ny3v2Qe4LfaYJYKcq", "htmlBody": "<p>Yeah, hopefully, someone writes a review of that book for the forum.</p>", "parentCommentId": null, "user": {"username": "casebash"}}, {"_id": "3jParR5NNnudwrZAZ", "postedAt": "2023-01-18T03:25:28.992Z", "postId": "Ny3v2Qe4LfaYJYKcq", "htmlBody": "<p>Thanks for sharing this! &nbsp;I'm not too optimistic, though, as the editors' introduction <a href=\"https://blog.oup.com/2022/12/the-predictably-grievous-harms-of-effective-altruism/\">on the OUP blog</a> doesn't inspire confidence. &nbsp;E.g. they write:</p><blockquote><p>To step inside the utilitarian frame is to accept that values that count as “good” can be abstractly quantified. Its methods leave it incapable of addressing historically sedimented structural injustices and intergenerational injuries, since these aren’t the sorts of things that can be quantified by EA-style metrics.</p></blockquote><p>This seems conceptually confused. Any kind of injustice or injury could, in principle, be associated with an estimated welfare cost. (Unless it was literally harmless, but that's surely not what they intend.)</p><p>I know there have been past methodological critiques of the particular vein of classic (GiveWell-style) EA that was addressed to aid skeptics and focused on just the most robustly-evidenced global health interventions. But obviously there's nothing in utilitarianism (or EA more broadly) that rules out making use of more speculative evidence and expected-value reasoning.</p><p>It sounds to me like their real complaint is something like: <i>How dare EA/utilitarianism prioritize other things over my pet causes, just because there's no reason to think that my pet causes are optimal?</i>&nbsp;</p><p>E.g.: \"To grasp how disastrously an apparently altruistic movement has run off course, consider that... covering the costs of caring for survivors of industrial animal farming in sanctuaries is seen as a bad use of funds.\"</p><p>Note that they don't even <i>attempt </i>to offer reasons for thinking that animal sanctuaries are a better use of funds than existing EA priorities. Indeed, they don't seem to acknowledge the reality of tradeoffs at all. &nbsp;It's just supposed to be obvious that refusing funding to them and their allies is \"grievous harm\".</p><p>Hopefully some of the papers in the volume will offer some actual arguments that are worth engaging with.</p>", "parentCommentId": null, "user": {"username": "RYC"}}, {"_id": "ahEEDAnXBDuJfw8eQ", "postedAt": "2023-01-18T06:29:43.943Z", "postId": "Ny3v2Qe4LfaYJYKcq", "htmlBody": "<p>This comment reads to me as unnecessarily adversarial and as a strawman of the authors' position.</p><blockquote><p>It sounds to me like their real complaint is something like: <i>How dare EA/utilitarianism prioritize other things over my pet causes, just because there's no reason to think that my pet causes are optimal?</i>&nbsp;</p></blockquote><p>I think a more likely explanation of the authors' position includes cruxes like:</p><ul><li>disagreeing with the assumption of maximization (and underlying assumptions about the aggregation of utility), such that arguments about optimality are not relevant</li><li>moral partiality, e.g. a view that people have special obligations towards those in their local community</li><li>weighting (in)justice much more strongly than the average EA, such that the correction of (certain) historical wrongs is a very high priority</li><li>disagreements about the (non-consequentialist) badness of e.g. foreign philanthropic interventions</li></ul><p>Your description of their position may very well be compatible with mine, they do write with a somewhat disparaging tone, and I expect to strongly disagree with many of the book's arguments (including for some of the reasons you point out). However, it doesn't feel like you're engaging with their position in good faith.</p><p>Additionally, EA comprises a lot of nuanced ideas (e.g. distinguishing \"classic (GiveWell-style) EA\" from other strains of EA) and there isn't a canonical description of those ideas (though the <a href=\"https://forum.effectivealtruism.org/handbook\">EA Handbook</a> does a decent job). While they might be obvious to community members, many of those nuances, counterarguments to naive objections, etc. aren't in easy-to-find descriptions of EA. While in an ideal world all critics would pass their subjects' ITT, I'm wary of creating too high of a bar for how much people need to understand EA ideas before they feel able to criticize them.</p>", "parentCommentId": "3jParR5NNnudwrZAZ", "user": {"username": "byunjae"}}, {"_id": "YxhzSMtfyJpD7Xv68", "postedAt": "2023-01-18T12:56:19.895Z", "postId": "Ny3v2Qe4LfaYJYKcq", "htmlBody": "<p>Thanks for the advice! I have also discovered the 'block quote' and inserted it too.</p>", "parentCommentId": "3tknwuW75uC4dyefm", "user": {"username": "Manuel Del Río Rodríguez"}}, {"_id": "odwgsDqRWMJZzYfkC", "postedAt": "2023-01-18T13:28:49.782Z", "postId": "Ny3v2Qe4LfaYJYKcq", "htmlBody": "<p>I'm thinking about it, even though I feel I'm predisposed to not like the arguments presented in the book.</p><p>If anyone reading was thinking about doing the same, do get in touch. Many hands etc.</p>", "parentCommentId": "9inhhfn3sgEaM6zxW", "user": {"username": "JWS"}}, {"_id": "XqAk7XEDKdrjijDbn", "postedAt": "2023-01-18T14:11:47.287Z", "postId": "Ny3v2Qe4LfaYJYKcq", "htmlBody": "<p>I'm responding to published academic work by (at least some) professional academics, published in the top academic press. &nbsp;The appropriate norms for professional academic criticism are not the same as for (say) making a newcomer feel welcome on the forum. &nbsp;It is (IMO) absolutely appropriate to clearly state one's opinion when <i>academic work</i> is of low quality, and explain why, as I did in my comment.</p><p>You're certainly welcome to form a different opinion of their work. But you shouldn't accuse me of \"bad faith\" just because I assessed their work more negatively than you do. &nbsp;It's my honest opinion, and I offered supporting reasons for it.</p><p>IMO, this would be a worse forum if people weren't allowed to clearly express their honest opinion of shoddy academic work, including (when textually supported) reasons for thinking that their targets were engaging in motivated reasoning.</p><p>Finally, I should clarify that I was not addressing the question of whether someone could construct a valuable steelman of the authors' positions. &nbsp;Many have offered critiques along the lines you suggest, and you could certainly attribute those to the authors to make them sound more reasonable. But in that case you might as well skip this text and go straight to the critiques that have been better expressed elsewhere. &nbsp;What I was assessing was the value of <i>this particular text</i>. &nbsp;And, as I said, what I've seen so far strikes me as low quality. &nbsp;Hopefully some of the included essays by other authors are better.</p>", "parentCommentId": "ahEEDAnXBDuJfw8eQ", "user": {"username": "RYC"}}, {"_id": "iL4agRnx9damospoA", "postedAt": "2023-01-18T15:41:21.865Z", "postId": "Ny3v2Qe4LfaYJYKcq", "htmlBody": "<p>Just to be clear, you are assessing the quality of the text based on the 1 page editor's introduction and what you believe the authors will write, and without having actually read it?&nbsp;</p>", "parentCommentId": "XqAk7XEDKdrjijDbn", "user": null}, {"_id": "jCjdKjMu6LukE7h9x", "postedAt": "2023-01-18T16:39:28.645Z", "postId": "Ny3v2Qe4LfaYJYKcq", "htmlBody": "<p>I'm assessing the text that's currently available, yes. I think my original comment was perfectly clear on that. &nbsp;I hope the book itself is better than the editors' introduction would indicate, but it's not unreasonable to assess what they've shared so far.</p>", "parentCommentId": "iL4agRnx9damospoA", "user": {"username": "RYC"}}, {"_id": "EfQeFinSfi6ehJLFB", "postedAt": "2023-01-18T22:13:29.698Z", "postId": "Ny3v2Qe4LfaYJYKcq", "htmlBody": "<blockquote><p><i>How dare EA/utilitarianism prioritize other things</i></p></blockquote><p>&nbsp;</p><blockquote><p>I think a more likely explanation of the authors' position includes cruxes like:<br>...</p></blockquote><p><br>Speaking generally, it does seem like EA critics often &nbsp;equivocate between these two positions. For example, saying EA is bad for diverting money from soup kitchens to bednets but not being willing to say money should be diverted the other way. IMO focus on philosophical issues like utilitarianism can have the effect of equivocating further by implying more specific disagreements without really defending them.<br><br>(I don't have any opinions about this book in particular).</p>", "parentCommentId": "ahEEDAnXBDuJfw8eQ", "user": {"username": "Ben Dean"}}, {"_id": "Ko4QCZ7CZk6WY3u6s", "postedAt": "2023-01-19T03:06:16.717Z", "postId": "Ny3v2Qe4LfaYJYKcq", "htmlBody": "<p>The comment I replied to sounds like you're critiquing the main academic work rather than a description of it, so I wanted to check if you had read an advance copy or something.&nbsp;</p>", "parentCommentId": "jCjdKjMu6LukE7h9x", "user": null}, {"_id": "ELvyq9pYcuTYbqT9n", "postedAt": "2023-01-19T09:51:57.471Z", "postId": "Ny3v2Qe4LfaYJYKcq", "htmlBody": "<p>I'm planning to write about this book for my blog when it is released. It is an important book which draws on valuable perspectives that are underrepresented in effective altruism.</p><p>It is possible (even healthy) to disagree with some aspects of the book while recognizing that all of the authors have valuable things to say, and have over their lifetimes built valuable stores of knowledge to share. This week, more than ever, I think we should recognize the importance of drawing on diverse sources of knowledge to inform altruistic decisionmaking.</p><p>On the tone of the book, I wonder what readers make of an article by the author of the introduction to the volume, Prof. Amia Srinivasan? (\"The aptness of anger\": <a href=\"https://users.ox.ac.uk/~corp1468/Research_files/jopp.12130.pdf\">https://users.ox.ac.uk/~corp1468/Research_files/jopp.12130.pdf</a>.)This article argues that anger can be an apt response to injustice. More generally, I hope that discussions of this book can move past questions of tone to examine the substance of arguments and the evidence brought forth to support them.</p><p>If I had to make one criticism of the book, it would be that the book focuses in many places on short-termist EA projects. It is very hard for critics of EA to keep up with the rapid pace at which the EA movement evolves, particularly given that academic research tends to move slowly. I hope that this feature of the book can be contextualized within an academic publishing system in which it can take many years to bring an edited volume to press, and that readers will do their best to consider how the views expressed in this book might apply to longtermist causes as well.</p>", "parentCommentId": null, "user": {"username": "David Thorstad"}}, {"_id": "vvjmmrTDKHv2NqrQ9", "postedAt": "2023-01-19T12:26:42.475Z", "postId": "Ny3v2Qe4LfaYJYKcq", "htmlBody": "<p>Thank you for this post I found it really interesting and helpful.&nbsp;</p><p>Will be looking forward for some new content that will help me in future.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Fatibutt23"}}, {"_id": "CfnboodAk93FgXth8", "postedAt": "2023-01-19T17:30:09.818Z", "postId": "Ny3v2Qe4LfaYJYKcq", "htmlBody": "<blockquote><p>I wonder what readers make of an article by the author of the introduction to the volume, Prof. Amia Srinivasan?</p></blockquote><p>I only read about half the article and skimmed the rest, but as far as I can see basically every example of anger she mentions is anger that is allied to a political cause she (and likely her readers) support. This seems like cherry picking to me. There are plenty of examples of morally wrong anger, from the petty - the violent drunkard - to the grand - a Hitler or Stalin inciting people to hatred based off perceived historical injustice. Any reasonable evaluation of anger has to take into account the pretty high <i>ex ante</i> probability that anger is clouding your judgement and your cause is unjust. On average I would guess that historically angry people have more typically been in the wrong morally, and the mere fact that someone is angry doesn't seem like it should be evidence to third parties that they are in the right.&nbsp;</p><p>Anger also seems generally harmful because it leads to nursing grievances. At a personal level these seem psychologically unhealthy - my understanding is the most scientifically supported form of therapy, CBT, in part encourages people to stop dwelling on issues, and at a civilization level, we have gained enormously from the triumph of <a href=\"https://www.amazon.com/Bourgeois-Virtues-Ethics-Age-Commerce/dp/0226556646\">Bourgeois Virtues</a> and productive collaboration over honour culture and endless cycles of vengeance.&nbsp;</p><p>All these arguments seem especially true when doing philosophy - maybe anger is appropriate when a burglar breaks into your house, but it is not at all helpful when trying to make a logical argument. Logical arguments are good because there is a strong reason they should tend to push us towards the truth; if we instead reward anger, we encourage an arms race of escalating rage with only negative consequences for the world.</p>", "parentCommentId": "ELvyq9pYcuTYbqT9n", "user": {"username": "Larks"}}, {"_id": "8YxxP2kZzSwAipexP", "postedAt": "2023-01-19T18:18:09.796Z", "postId": "Ny3v2Qe4LfaYJYKcq", "htmlBody": "<p>Srinivasan is not focused on the question of whether anger is counterproductive, harmful, or has bad consequences. Srinivasan is explicitly focused on cases where anger may be counterproductive, and asks whether it would be apt.</p>", "parentCommentId": "CfnboodAk93FgXth8", "user": {"username": "David Thorstad"}}, {"_id": "EXhHTcJAnLEunn5dD", "postedAt": "2023-02-08T14:46:49.009Z", "postId": "Ny3v2Qe4LfaYJYKcq", "htmlBody": "<p>I just downloaded the e-book. It's quite lengthy and consists of separate papers. Perhaps the people who are interested to review it are interested in collaborating on a google-doc where, according to some good epistemic norms, we identify the best critiques, correct or improve the worst ones and provide context and factual information where it is necessary? It seems unlikely that one person can do this all, since the book goes into GH&amp;D, Animal Welfare, Longtermism, Moral Philosophy etc. Perhaps someone can then write a good book review based on that Doc.<br><br>Big thumbs up to MichaelB for steelmanning. We should do as much as that as possible! Although it must be said, I just read some pages and I feel very frustrated now for constantly being called out for my whiteness, being called a supporter of fascist structures, being naïve, glorifying whiteness, disrespecting social movements in the past etc. It's going to take a lot of goodwill to review this pretty hostile book in the best way possible, but we should be able to conjure up that goodwill together :)<br><br><a href=\"https://docs.google.com/document/d/15NV1VA60Oa8J_uQj0i_gGMP7YzShvgMr0jUr8noQv9w/edit?usp=sharing\">Here you can access request access to</a> the Google Doc! You'll have to request access, because the book can be accessed through there (I bought it) and I don't want to be accused of piracy.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Martijn Klop"}}, {"_id": "ySdjdvwbPbN6ANS7v", "postedAt": "2023-02-08T20:29:15.602Z", "postId": "Ny3v2Qe4LfaYJYKcq", "htmlBody": "<p>Thanks, Martijn. I would like to give it a go, even if I am rather busy with work, reading and studying at the moment.</p>", "parentCommentId": "EXhHTcJAnLEunn5dD", "user": {"username": "Manuel Del Río Rodríguez"}}, {"_id": "pe6RFTtPRsLxs7QEm", "postedAt": "2023-02-09T04:30:52.826Z", "postId": "Ny3v2Qe4LfaYJYKcq", "htmlBody": "<p>Hi, David. Thanks for your thoughts here.\nI recently wrote a book post (here on the Forum) upon its release. I would really enjoy reading your reflections once you publish them!</p>\n", "parentCommentId": "ELvyq9pYcuTYbqT9n", "user": {"username": "Kyle Lucchese"}}, {"_id": "JrbEb5PghpZ6dxTEA", "postedAt": "2023-02-09T04:34:48.688Z", "postId": "Ny3v2Qe4LfaYJYKcq", "htmlBody": "<p>Depending on the timeline and the proposed structure, I might be amenable to collaborating or otherwise supporting a review. My own bias being that I am likely more sympathetic to the arguments presented than most EAs.</p>\n", "parentCommentId": "odwgsDqRWMJZzYfkC", "user": {"username": "Kyle Lucchese"}}, {"_id": "yaKzkpQZfQJd43K25", "postedAt": "2023-02-09T09:21:12.004Z", "postId": "Ny3v2Qe4LfaYJYKcq", "htmlBody": "<p>Nice! Feel free to share the request to collab on a review elsewhere around! Btw, thanks for contributing to the forum :)</p>", "parentCommentId": "ySdjdvwbPbN6ANS7v", "user": {"username": "Martijn Klop"}}, {"_id": "E3L9yz3EGG3dioii5", "postedAt": "2023-02-09T09:24:43.271Z", "postId": "Ny3v2Qe4LfaYJYKcq", "htmlBody": "<p>We can collaborate on a review <a href=\"https://docs.google.com/document/d/15NV1VA60Oa8J_uQj0i_gGMP7YzShvgMr0jUr8noQv9w/edit?usp=sharing\">here</a></p>", "parentCommentId": "odwgsDqRWMJZzYfkC", "user": {"username": "Martijn Klop"}}, {"_id": "3pshDQzk5NijFNkfR", "postedAt": "2023-02-09T09:26:20.287Z", "postId": "Ny3v2Qe4LfaYJYKcq", "htmlBody": "<p>If you want we can write it together <a href=\"https://docs.google.com/document/d/15NV1VA60Oa8J_uQj0i_gGMP7YzShvgMr0jUr8noQv9w/edit?usp=sharing\">here</a></p>", "parentCommentId": "ELvyq9pYcuTYbqT9n", "user": {"username": "Martijn Klop"}}, {"_id": "SmAeGv3mdZssvEkw7", "postedAt": "2023-02-09T09:28:49.169Z", "postId": "Ny3v2Qe4LfaYJYKcq", "htmlBody": "<p>Thanks! Do you mind if I PM some other interested EAs I know with the link and ask if they also want to collaborate?</p>", "parentCommentId": "E3L9yz3EGG3dioii5", "user": {"username": "JWS"}}, {"_id": "DGG779jaf9yR8p8h5", "postedAt": "2023-02-09T09:35:56.122Z", "postId": "Ny3v2Qe4LfaYJYKcq", "htmlBody": "<p>Go ahead!</p>", "parentCommentId": "SmAeGv3mdZssvEkw7", "user": {"username": "Martijn Klop"}}, {"_id": "KiKxodGBkc63WLXKa", "postedAt": "2023-02-09T14:25:36.618Z", "postId": "Ny3v2Qe4LfaYJYKcq", "htmlBody": "<p>Glad to hear it! Send me a link?</p>", "parentCommentId": "pe6RFTtPRsLxs7QEm", "user": {"username": "David Thorstad"}}, {"_id": "ADxvyo2psd5QnxxEs", "postedAt": "2023-02-09T14:26:47.997Z", "postId": "Ny3v2Qe4LfaYJYKcq", "htmlBody": "<p>Thanks Martijn - I <i>really</i> appreciate it! I almost never coauthor because I have discovered that I am a terrible coauthor (my coauthorships never go well and the common denominator is me). Very interested to keep tabs on what you're writing if you're willing to share and will try to say something useful.</p>", "parentCommentId": "3pshDQzk5NijFNkfR", "user": {"username": "David Thorstad"}}, {"_id": "9QetNZTR3NjjdQaF5", "postedAt": "2023-02-09T14:31:34.352Z", "postId": "Ny3v2Qe4LfaYJYKcq", "htmlBody": "<p><a href=\"https://forum.effectivealtruism.org/posts/YFGkyDjKvsr9tHzkS/book-post-the-good-it-promises-the-harm-it-does-critical\">Here it is</a>. I did not write a detailed reflection of my own (due to time constraints), but I did want to draw attention to the book so that others might also engage with it.&nbsp;</p>", "parentCommentId": "KiKxodGBkc63WLXKa", "user": {"username": "Kyle Lucchese"}}, {"_id": "6EEn65vFByiqrype4", "postedAt": "2023-01-18T18:21:27.853Z", "postId": "Ny3v2Qe4LfaYJYKcq", "htmlBody": null, "parentCommentId": "XqAk7XEDKdrjijDbn", "user": null}]