[{"_id": "hzxbN6f6xi2Z7EZRr", "postedAt": "2024-02-26T12:29:03.396Z", "postId": "NyNa4YYAm7zQuLLva", "htmlBody": "<blockquote><p>Obviously it isn't always perfect, and good posts with niche audiences aren't always given much karma.</p></blockquote><p><br>This was actually a surprisingly useful thing to hear, and I'm glad you included it. It can be quite disheartening (especially for first or second time posters) to spend weeks on a post for it to receive single digit karma after it goes live. I'd hate to think that ever puts anyone off. It's just something that happens. Things like amnesty are good for overcoming that (I assume), especially people who are afraid to make posts for fear of harsh criticism.<br><br>I may have a crack at taking part in the draft amnesty, if any '<i>would like to see</i>' suggestions match my research areas.<br><br>Looking forward to seeing what else this generates!</p>", "parentCommentId": null, "user": {"username": "AI Law"}}, {"_id": "8j5D2X6otcRxQyKrN", "postedAt": "2024-02-26T12:33:19.630Z", "postId": "NyNa4YYAm7zQuLLva", "htmlBody": "<p>I'm glad! Excited to see what you draft if you do.<br><br>This problem is part of the reason the Forum's tagging/topics/wiki system is so important. If your post is correctly tagged, then someone interested in the (potentially very niche) question you are answering will be able to find it, even years later.&nbsp;<br><br>I also try to use the Digest to highlight posts which were very good, but get low karma for whatever reason.&nbsp;</p>", "parentCommentId": "hzxbN6f6xi2Z7EZRr", "user": {"username": "tobytrem"}}, {"_id": "acSipoi7KJyfDYAo3", "postedAt": "2024-02-27T16:12:39.239Z", "postId": "NyNa4YYAm7zQuLLva", "htmlBody": "<p>Update: I've now spoken to 11 people who have drafts that they are hoping to post :)&nbsp;</p><p>Personally, I'm thinking of posting a journalistic piece about wild animal welfare which I wrote in late 2022. For various reasons (not quite finished, needs an edit, some people wanted me to check with them before I published it, etc...) I haven't published till now.&nbsp;<br><br>In draft amnesty week, I can overcome these issues, ignore that it isn't quite perfect, and just redact the names and identifying info of people who asked to see their interviews before the piece was published [pending checking with a journalist that is good journalistic ethics].&nbsp;<br><br>I might also bash out another few draft ideas which have been sitting in my google drive even longer...</p>", "parentCommentId": null, "user": {"username": "tobytrem"}}, {"_id": "WfzbudACHrsBkFtxb", "postedAt": "2024-02-29T11:53:43.067Z", "postId": "NyNa4YYAm7zQuLLva", "htmlBody": "<p>I'll commit to posting a couple of drafts. Y'all can look at me with disapproval (or downvote this comment) if I fail to share two posts during Draft Amnesty Week.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Lizka"}}, {"_id": "mLEKpZxXqiPZChGDS", "postedAt": "2024-02-29T12:56:28.997Z", "postId": "NyNa4YYAm7zQuLLva", "htmlBody": "<p>Amazing. Ready to strong downvote this comment at <i><strong>even the hint</strong></i> of only one draft by the 17th March. We'll see if a ulysses-stylye pact as weak as a few negative Karma on the EA will be enough motivation ;).</p>", "parentCommentId": "WfzbudACHrsBkFtxb", "user": {"username": "NickLaing"}}, {"_id": "b8dm8cHqqH55bpwkM", "postedAt": "2024-03-01T10:30:13.313Z", "postId": "NyNa4YYAm7zQuLLva", "htmlBody": "<p>I'll try to post two!&nbsp;</p>", "parentCommentId": null, "user": {"username": "MJusten"}}, {"_id": "B9JqmTuxTB9ZuLXCj", "postedAt": "2024-03-19T22:12:22.949Z", "postId": "NyNa4YYAm7zQuLLva", "htmlBody": "<p>As a quick update: I did not in fact share two posts during the week. I'll try to post another \"DAW post\" (i.e. something from my drafts, without spending too much time polishing it) sometime soon, but I don't endorse prioritizing this right now and didn't meet my commitment.&nbsp;</p>", "parentCommentId": "WfzbudACHrsBkFtxb", "user": {"username": "Lizka"}}]