[{"_id": "MxfEZuwqzhZzFudZT", "postedAt": "2023-09-12T17:59:06.148Z", "postId": "P56q5epKjyN3eRJHq", "htmlBody": "<p>This seems potentially pretty bad to me for <a href=\"https://forum.effectivealtruism.org/posts/QXpxioWSQcNuNnNTy/the-copenhagen-interpretation-of-ethics\">Copenhagen Interpretation of Ethics</a> reasons. Based on your description, it sounds like Danaher made a better product than anyone else and were already doing more (in this specific area) to help the global poor than anyone else. But rather than being praised them for this, they receive harsh criticism. Not only does this seem very unfair, I think it also contributes to the effect where people actively try to avoid dealing with poor people because they know doing so invites opprobrium, treatment they would avoid by making products exclusively for the well off.</p>", "parentCommentId": null, "user": {"username": "Larks"}}, {"_id": "6ktQKMpe2Xs5fjEYj", "postedAt": "2023-09-12T18:29:57.747Z", "postId": "P56q5epKjyN3eRJHq", "htmlBody": "<p>Potentially. However, Danaher's current market share in LMIC can be traced to public funding and buy-down agreement with WHO and Unitaid in 2012 on the basis of projected annual sales of 4.7 million tests (number that was quickly eclipsed). There are potential competitors but they won't LMIC market before 2024 and gaining market share will take years. Therefore, Cepheid will remain the dominant supplier of critical rapid molecular tests for LMICs for the next few years.</p><p><a href=\"https://msfaccess.org/time-5-campaign-questions-and-answers\">“Time for $5” Campaign: Questions and Answers | Médecins Sans Frontières Access Campaign (msfaccess.org)</a></p><p>The campaign is advocating that they reduce their profit margin which given the potential sales volumes will still likely make this a profitable outcome. I am pretty unconvinced that it would serious decision relevant factor.</p><p>If you have evidence or case studies beyond <a href=\"https://forum.effectivealtruism.org/posts/QXpxioWSQcNuNnNTy/the-copenhagen-interpretation-of-ethics\">this post</a> that this has seriously influenced a for profits decision to commercialise in LMIC then I'd love to read it.&nbsp;</p>", "parentCommentId": "MxfEZuwqzhZzFudZT", "user": {"username": "Gemma Paterson"}}, {"_id": "4tbcEGdHECfBCvFoG", "postedAt": "2023-09-12T19:34:52.824Z", "postId": "P56q5epKjyN3eRJHq", "htmlBody": "<p>When deciding whether to invest in something, there is always uncertainty about the outcome. If ex post successes will be met with demands for reduced prices, but ex post failures do not get compensation, the ex ante expected value is reduced and firms are less likely to invest, even if it's still worthwhile for firms that have already invested to continue operating.</p><p>Note that the tax system is better designed than this, because unsuccessful ventures generate tax loses which are (roughly) symmetrical with the taxes paid on successful ventures.</p><blockquote><p>The campaign is advocating that they reduce their profit margin which given the potential sales volumes will still likely make this a profitable outcome. I am pretty unconvinced that it would serious decision relevant factor.</p></blockquote><p>I think it's pretty clear that prices falling by 50% or 67%, and gross profits falling by 71-87%, is going to be an important decision factor for various things.</p>", "parentCommentId": "6ktQKMpe2Xs5fjEYj", "user": {"username": "Larks"}}, {"_id": "3dd6mEN6ARCWtpmAc", "postedAt": "2023-09-12T19:44:50.404Z", "postId": "P56q5epKjyN3eRJHq", "htmlBody": "<p>I like your reasoning, but in this case I lean towards Gemma's argument. I'm not sure how many millions of dollars were put in not only by WHO but by Gates foundation and others to ensure LMIC access, which they now have to the exclusion of any other product. The price has remained the same for years, which is unfair given the massive leg up and profits pumped into this company by the philanthopic sector.</p><p>This is a complex, not pure free market situation, and I think on balance it is more than &nbsp;fair that the company lowers its profit margins after making bank for years here.</p>", "parentCommentId": "4tbcEGdHECfBCvFoG", "user": {"username": "NickLaing"}}, {"_id": "oxHWgzDGkha2kLhEP", "postedAt": "2023-09-12T23:11:12.730Z", "postId": "P56q5epKjyN3eRJHq", "htmlBody": "<p>Yeah aligning incentives here seems hard and tbh I don't think it's a sustainable option to have advocacy campaigns targeting pharma companies for every global health issue.</p>\n<p>It was interesting to read about Advance Market Commitments from this piece (<a href=\"https://worksinprogress.co/issue/why-we-didnt-get-a-malaria-vaccine-sooner/#advance-market-commitments\">https://worksinprogress.co/issue/why-we-didnt-get-a-malaria-vaccine-sooner/#advance-market-commitments</a>)</p>\n<p>Quoting (on mobile so can't seem to do the formatting):</p>\n<p>A standard Advance Market Commitment (AMC) is a promise to subsidize the future purchase of a new vaccine in large quantities – if it’s invented – in return for the firm charging customers close to marginal cost (that is, with only a small mark-up).</p>\n<p>Letʼs break it down. The subsidy incentivizes research by compensating innovators for their fixed cost investments in R&amp;D and manufacturing capacity. The commitments to buy a certain quantity at a certain price ensure the vaccine is affordable and widely available. The subsidy is conditional on a co-payment (this is the part that is close to marginal cost) from governments in low and middle income countries – without it, the developer receives nothing. This incentivizes firms to develop vaccines countries will actually use, not just those that meet technical specifications.</p>\n<p>So while patents trade-off innovation incentives with affordable access, AMCs help us achieve both. And the price strategy means that AMCs encourage deployment at scale in a way that most prizes do not.\nAMCs are a kind of inversion to typical ‘push funding’ – they instead ‘pull’ innovation towards a goal by paying for outputs and outcomes. They don’t require funders to choose which research efforts to back in advance – they can just commit to rewarding the innovations that succeed. And they’ve been successful at doing so in the past.</p>\n", "parentCommentId": "4tbcEGdHECfBCvFoG", "user": {"username": "Gemma Paterson"}}, {"_id": "nHMRz6TvGeEjiJRD2", "postedAt": "2023-09-13T01:03:58.764Z", "postId": "P56q5epKjyN3eRJHq", "htmlBody": "<p>I agree that AMCs seem like a good idea!</p>", "parentCommentId": "oxHWgzDGkha2kLhEP", "user": {"username": "Larks"}}, {"_id": "nX8AtTiAkLQv2Fz87", "postedAt": "2023-09-13T07:40:29.677Z", "postId": "P56q5epKjyN3eRJHq", "htmlBody": "<p>I'm pretty hard-nosed on market stuff, but I was at least uncertain. I guess the question is how much of the research was subsidised.</p><p>It seemed after a cursory look that they had been given $10 - 500mn. I wonder how much research costs.</p>", "parentCommentId": "MxfEZuwqzhZzFudZT", "user": {"username": "nathan"}}, {"_id": "bXQR3DYWTLfSJQ9tj", "postedAt": "2023-09-13T16:20:19.191Z", "postId": "P56q5epKjyN3eRJHq", "htmlBody": "<p>The Problem isn't that they make money from their superior product. The problem, as I understand, is that they use an unethical business model to do so, heavily distorting the options available to doctors and locking them into using their product.</p>\n<p>At the very least, I think they should openly justify their pricing strategy. The public and Danaher's customers should know about their profits, per-machine and per-test, so they can negotiate fairer deals.</p>\n", "parentCommentId": null, "user": {"username": "ludwigbald"}}, {"_id": "zX3xpprCA5kuvg62C", "postedAt": "2023-09-13T19:18:30.168Z", "postId": "P56q5epKjyN3eRJHq", "htmlBody": "<blockquote><p>I guess the question is how much of the research was subsidised.<br>&nbsp;</p></blockquote><p>Isn't the question: \"How will this campaign effect the likeliness of future innovations\". I don't see an immediate connection between this question and how much the R&amp;D of the machine was subsidised.&nbsp;</p>", "parentCommentId": "nX8AtTiAkLQv2Fz87", "user": {"username": "ElliotJDavies"}}, {"_id": "RELodGwQ3aoeXncDc", "postedAt": "2023-09-13T19:22:32.686Z", "postId": "P56q5epKjyN3eRJHq", "htmlBody": "<p>We have strong evidence that this has played out in previous decisions to develop lifesaving products (see Advanced market commitments). At the very least there's a strong burden of proof on this campaign to prove they are not exacerbating this stressor.<br><br>Bill Gates has made this exact point on a previous debate with MSF in 2015: <i>This general thing where organisations come out and say, ‘hey, why don’t vaccines cost zero?’ – all that does is that you have some pharma companies that choose never to do medicines for poor countries because they know that this always just becomes a source of criticism. So they don’t do any R&amp;D [research and development] on any product that would help poor countries. Then they’re not criticised at all because they don’t have anything that these people are saying they should price at zero</i><span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnref6b3cdq7rdms\"><sup><a href=\"#fn6b3cdq7rdms\">[1]</a></sup></span><br><br>Edit: Added second paragraph</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fn6b3cdq7rdms\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnref6b3cdq7rdms\">^</a></strong></sup></span><div class=\"footnote-content\"><p>https://www.theguardian.com/global-development/2015/jan/27/bill-gates-dismisses-criticism-of-high-prices-for-vaccines</p></div></li></ol>", "parentCommentId": "MxfEZuwqzhZzFudZT", "user": {"username": "ElliotJDavies"}}, {"_id": "ndYzDvepBymi7vuhW", "postedAt": "2023-09-13T21:04:34.312Z", "postId": "P56q5epKjyN3eRJHq", "htmlBody": "<p>One consideration worth examining is the historically complex dynamic between MSF and organizations such as GAVI. A revealing example was when MSF launched an advocacy campaign that prompted a critical response from Bill Gates, who as a major GAVI funder voiced concerns about MSF’s approach:</p><blockquote><p><br>&gt; \"I think there is an organisation that's wonderful in every other respect, but every time we raise money to save poor children's lives, they put out a press release that says the price of these things should be zero\". He said that criticizing pharmaceutical company pricing deterred them from investing in medicines for the developing world, and said that instead, pharmaceutical companies should be praised for price descrimination: \"We get a great price for these things, which is tiered pricing... And that's how we manage to cut childhood death in half\". &nbsp;<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefozdv3yq3g0b\"><sup><a href=\"#fnozdv3yq3g0b\">[1]</a></sup></span><br>&nbsp;</p></blockquote><p>For anyone curious about this debate, I'd recommend reading <a href=\"https://www.theguardian.com/global-development/2015/jan/27/bill-gates-dismisses-criticism-of-high-prices-for-vaccines\">the full article</a>.&nbsp;</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnozdv3yq3g0b\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefozdv3yq3g0b\">^</a></strong></sup></span><div class=\"footnote-content\"><p>Citing from wiki: https://en.wikipedia.org/wiki/GAVI<br><br>Which cites from: https://www.theguardian.com/global-development/2015/jan/27/bill-gates-dismisses-criticism-of-high-prices-for-vaccines</p></div></li></ol>", "parentCommentId": null, "user": {"username": "ElliotJDavies"}}, {"_id": "7JFyhAzPHAuTWKEDC", "postedAt": "2023-09-13T21:40:05.611Z", "postId": "P56q5epKjyN3eRJHq", "htmlBody": "<p>I don't think Bill's statement there is particularly fair - MSF aren't pushing for the price to be \"zero\", they pushing for reduced profit margins since the tiered pricing doesn't go far enough.</p>\n<p>I'd like to see more evidence of this deterrence effect beyond statements by Bill Gates who has a history of controversy over his business practices.</p>\n", "parentCommentId": "ndYzDvepBymi7vuhW", "user": {"username": "Gemma Paterson"}}, {"_id": "qdiq9QwtjqZkQRSb7", "postedAt": "2023-09-13T21:42:50.649Z", "postId": "P56q5epKjyN3eRJHq", "htmlBody": "<p>Could you say more about the strong evidence beyond the statements by Bill Gates?</p>\n<p>See my other comment</p>\n", "parentCommentId": "RELodGwQ3aoeXncDc", "user": {"username": "Gemma Paterson"}}]