[{"_id": "PKymM3ruuGcDf9zLG", "postedAt": "2017-06-22T01:05:21.915Z", "postId": "P6ndNnsF9axjBgGXq", "htmlBody": "<p>I super highly recommend reading this report. In full, including many of the appendices (and footnotes :) )</p>\n<p>I thought it was really interesting, and helpful for thinking this question through and understanding the state of what evidence and arguments are out there (unfortunately there is much less to go on than I’d even expected, though).</p>\n<p>I was the most proximate audience for the report, so discount my recommendation as much as feels appropriate with that in mind.</p>\n", "parentCommentId": null, "user": {"username": "HoldenKarnofsky"}}, {"_id": "RzpPkh7cQmYwhdkrn", "postedAt": "2017-06-22T05:07:20.803Z", "postId": "P6ndNnsF9axjBgGXq", "htmlBody": "<p>This is a good start about some of the issues, but there is a need to bulk it up with information directly from neuroscientists.</p>\n<p>For instance, some very senior people in the Stanford neuroscience community think that an essential difference between animals and people may be that the astrocytes, &quot;helper cells,&quot; are so very different. Among many other things, astrocytes help to create and destroy synapses.</p>\n<p>Neuroscientists also routinely do mice experiments, and a few have very sophisticated answers to ethical questions about what they do.</p>\n<p>There are a lot of topics in EA ethics that benefit from a grounding in neuroscience and neuroethics.  Both of these fields also contain many EA opportunities themselves.  If money is being put down, then it's time to add some expert scientific opinion.</p>\n", "parentCommentId": null, "user": {"username": "SteveGreidinger"}}, {"_id": "K82PoYEZSjdPh6GF6", "postedAt": "2017-06-22T16:36:57.769Z", "postId": "P6ndNnsF9axjBgGXq", "htmlBody": "<p>Be the change you want to see in this world. You are clearly motivated and knowledgeable about the matter enough to try emailing some neuroscientists about the matter. :)</p>\n", "parentCommentId": "RzpPkh7cQmYwhdkrn", "user": {"username": "DonyChristie"}}, {"_id": "kWgJQpRKgco28hoGM", "postedAt": "2017-06-22T17:05:39.653Z", "postId": "P6ndNnsF9axjBgGXq", "htmlBody": "<p>Thanks, I've been talking with 'em every week  :) .</p>\n<p>What's quite clear to me, whether it's morally justifiable in terms some EAs will agree with, or not:</p>\n<p>If we do not let them do some unappealing things to mice, that will cost millions of human lives.</p>\n", "parentCommentId": "K82PoYEZSjdPh6GF6", "user": {"username": "SteveGreidinger"}}, {"_id": "pyjah2aESDYgdPjz4", "postedAt": "2017-06-22T17:37:21.703Z", "postId": "P6ndNnsF9axjBgGXq", "htmlBody": "<p>The question of animal experimentation bears directly on EA funding decisions.</p>\n<p>There is no &quot;vegan&quot; way out for some kinds of studies.  I personally would volunteer for some kinds of experiments, if I had just a short time to live.  Even that would not cover all of the necessary cases, and I might be prevented.</p>\n<p>For example, we urgently need to map fluid flows in the brain.  When we sleep, flows in the &quot;glymphatic system&quot; turn on and off.  We barely understand this phenomenon.</p>\n<p>If we knew more, we could try new treatments for Alzheimer's disease, stroke, sleep disorders and mental illness.  Medication dosing would become more accurate, and we might even know more about how cancers in the brain spread.</p>\n<p>Institutional Review Boards get confused about these issues, too.  Without clarity, both fighting disease and human enhancement (for good or bad) will be hampered.</p>\n<p>That's why we need clear vision in neuroethics.  Ethical theory very quickly feeds into research approval and funding determinations.</p>\n", "parentCommentId": "kWgJQpRKgco28hoGM", "user": {"username": "SteveGreidinger"}}, {"_id": "CNj6J4muB7nAngGpF", "postedAt": "2017-06-22T17:49:51.433Z", "postId": "P6ndNnsF9axjBgGXq", "htmlBody": "<p>I think that certain arguments from neuroscience were definitely considered, see the extended section on 'necessary and sufficient conditions' which looks at the cortex-required view, and the section right before that on 'potentially consciousness indicating factors' which looks at 'neuroanatomical similarity' and has a whole appendix associated. These two would both probably cover the types of argument that you're making, even if it doesn't address your specific mechanism, so pointing out what he missed in the relevant section would probably be helpful.</p>\n", "parentCommentId": "RzpPkh7cQmYwhdkrn", "user": {"username": "Ben Pace"}}, {"_id": "eDmKTtJeNMkrYJ7gG", "postedAt": "2017-06-22T17:52:53.338Z", "postId": "P6ndNnsF9axjBgGXq", "htmlBody": "<p>Has anyone ever suggested that astrocytes may be necessary for, or at least a strong indicator of, phenomenal consciousness? If so, could you point me to the claim? </p>\n", "parentCommentId": "RzpPkh7cQmYwhdkrn", "user": {"username": "lukeprog"}}, {"_id": "NQ3ji7xyoZDPmqZWd", "postedAt": "2017-06-22T20:01:39.982Z", "postId": "P6ndNnsF9axjBgGXq", "htmlBody": "<p>I don't think we don't know yet!</p>\n<p>But here is Ben Barres' related NIH Grant:  &quot;An Astrocytic Basis for Humanity&quot;</p>\n<p><a href=\"https://projectreporter.nih.gov/project_info_description.cfm?aid=9068256&amp;icde=34843317&amp;ddparam=&amp;ddvalue=&amp;ddsub=&amp;cr=2&amp;csb=default&amp;cs=ASC&amp;pball=\">https://projectreporter.nih.gov/project_info_description.cfm?aid=9068256&amp;icde=34843317&amp;ddparam=&amp;ddvalue=&amp;ddsub=&amp;cr=2&amp;csb=default&amp;cs=ASC&amp;pball=</a></p>\n<p>Sadly, Prof. Barres, one the most respected neuroscientists in the country, has terminal cancer.</p>\n<p>I don't know what will happen to this grant. Stanford's astrocyte research is at risk if they lose funding.  However, there are plenty of people at Stanford now who would continue the tradition if they could.</p>\n", "parentCommentId": "eDmKTtJeNMkrYJ7gG", "user": {"username": "SteveGreidinger"}}, {"_id": "6Dw3MnNwKsaw9wF6A", "postedAt": "2017-06-24T10:13:07.231Z", "postId": "P6ndNnsF9axjBgGXq", "htmlBody": "<p>May we submit questions here to be asked on our behalf if we don't think we'll be free on Wednesday to ask during the AMA live?</p>\n", "parentCommentId": null, "user": {"username": "Evan_Gaensbauer"}}, {"_id": "zEWcFsocqXprHK5xj", "postedAt": "2017-06-24T23:04:21.514Z", "postId": "P6ndNnsF9axjBgGXq", "htmlBody": "<p>Sure. In that case, I won't reply to them (if they aren't posted directly to the AMA) until the AMA is &quot;winding down,&quot; or something.</p>\n", "parentCommentId": "6Dw3MnNwKsaw9wF6A", "user": {"username": "lukeprog"}}, {"_id": "WS9L2qmJM5B9uA7ku", "postedAt": "2017-06-25T07:40:09.289Z", "postId": "P6ndNnsF9axjBgGXq", "htmlBody": "<p>Hey, that sounds great to me. Thanks. Here's my question.</p>\n<p>Do you think science or philosophy can meaningfully separate the capacity to experience suffering or pain from however else consciousness is posited to be distributed across species? What would be fruitful avenues of research for effective altruists to pursue if it's possible to solve the problem in the first question, without necessarily addressing whatever remains of consciousness?</p>\n", "parentCommentId": "zEWcFsocqXprHK5xj", "user": {"username": "Evan_Gaensbauer"}}, {"_id": "szrXJ8ueaZMdBZpDC", "postedAt": "2017-06-27T23:53:09.652Z", "postId": "P6ndNnsF9axjBgGXq", "htmlBody": "<p>Hi, Steve. I'm an EA and also a neuroscience PhD student who studies astrocytes. As you might imagine, I totally agree that neuroscience perspectives are valuable for EA decisions. It's dismaying to me that physical and computer scientists are so well-represented in EA, but there are so few life scientists. I'm trying to figure out why this might be. Any ideas?</p>\n<p>Regarding the ethics of animal experiments, I'm working on a project to create educational materials about the importance of environmental enrichment (IMHO the most important welfare issue for laboratory animals). I've actually applied to EA Grants for funding to create a website aimed at educating life scientists about this issue.</p>\n<p>On the topic of astrocytes, you'll be happy to know that I asked Adam Marblestone about glia after his talk at EA Global in Boston. :) <a href=\"https://youtu.be/0eX1UqMmaLM?t=21m27s\">https://youtu.be/0eX1UqMmaLM?t=21m27s</a></p>\n", "parentCommentId": "RzpPkh7cQmYwhdkrn", "user": {"username": "greg_fitzgerald"}}, {"_id": "SgguXMDceBiR9arDd", "postedAt": "2017-06-28T16:01:53.505Z", "postId": "P6ndNnsF9axjBgGXq", "htmlBody": "<p>Update: the AMA is now live, <a href=\"http://effective-altruism.com/ea/1c3/hi_im_luke_muehlhauser_ama_about_open/\">here</a>.</p>\n", "parentCommentId": null, "user": {"username": "lukeprog"}}, {"_id": "DFj5CA28SkTTfSxcs", "postedAt": "2017-06-28T23:41:54.475Z", "postId": "P6ndNnsF9axjBgGXq", "htmlBody": "<p>Hi Evan, your question has now been posted to the AMA <a href=\"http://effective-altruism.com/ea/1c3/hi_im_luke_muehlhauser_ama_about_open/b9r\">here</a>.</p>\n", "parentCommentId": "WS9L2qmJM5B9uA7ku", "user": {"username": "lukeprog"}}]