[{"_id": "axLtnudzzyfvisSJi", "postedAt": "2023-08-30T00:16:24.594Z", "postId": "PAco5oG579k2qzrh9", "htmlBody": "<p>Great thanks, I've set up a recurring donation!</p>\n<p>EDIT: apparently they're very time-constrained, so I'll give $13.3k as a lump sum instead.</p>\n", "parentCommentId": null, "user": {"username": "rhaps0dy"}}, {"_id": "tWnssWLDyMLtfbLeh", "postedAt": "2023-08-30T01:05:53.761Z", "postId": "PAco5oG579k2qzrh9", "htmlBody": "<p>Thanks for this very thorough write up. I appreciate this level of transparency on what's needed for two of our community's biggest grantmaking orgs!</p>", "parentCommentId": null, "user": {"username": "AbbyBabby"}}, {"_id": "tAWLbajndY3PbMnBt", "postedAt": "2023-08-30T02:34:24.412Z", "postId": "PAco5oG579k2qzrh9", "htmlBody": "<p>I’m strongly in favour of there being an AI safety specific fund whether that be LTFF or spearheaded by another group.</p>\n<p>Long-termism has taken a beating in the press recently, so it’s important to remove any unnecessary barriers that might turn-off donors.</p>\n", "parentCommentId": null, "user": {"username": "casebash"}}, {"_id": "HHGeCq3cq3PNoeD2R", "postedAt": "2023-08-30T03:12:16.349Z", "postId": "PAco5oG579k2qzrh9", "htmlBody": "<p>Thanks for sharing this! I'm especially excited about the retrospective evaluation.</p><p>I notice you mention there being five fund managers, but only name three. Are the other two secret? Also, this post lists Peter but not Asya as Manager, while <a href=\"https://funds.effectivealtruism.org/funds/far-future#fund-managers\">the website</a> lists Asya but not Peter.</p>", "parentCommentId": null, "user": {"username": "Larks"}}, {"_id": "zdBNga8td8tGBedDT", "postedAt": "2023-08-30T04:11:38.389Z", "postId": "PAco5oG579k2qzrh9", "htmlBody": "<p>Peter is a fund manager of the EAIF, not the LTFF. Current permanent LTFF fund managers are (I think) Caleb, Asya, Linch and me.</p>", "parentCommentId": "HHGeCq3cq3PNoeD2R", "user": {"username": "Habryka"}}, {"_id": "QGdTXaBnLwoPiDLGE", "postedAt": "2023-08-30T04:35:57.027Z", "postId": "PAco5oG579k2qzrh9", "htmlBody": "<p>[Speaking in my personal capacity, not on behalf of the LTFF] I am also strongly in favor of there being an AI safety specific fund, but this is mostly unrelated to recent negative press for longtermism. My reasons for support are (primarily): a) people who aren't EAs (and might not even know about longtermism) are starting to care a lot more about AI safety, and many of them might donate to such a fund; and b) EAs (who may or may not be longtermists) may prioritize AI safety over other longtermist causes (eg biosafety), so an AI safety specific fund may fit better with their preferences.</p>", "parentCommentId": "tAWLbajndY3PbMnBt", "user": {"username": "Daniel_Eth"}}, {"_id": "6bjCNpexL7jcYJcen", "postedAt": "2023-08-30T06:37:17.122Z", "postId": "PAco5oG579k2qzrh9", "htmlBody": "<p>This is my understanding as well. I didn't list Asya because she's planning to step down.&nbsp;</p>", "parentCommentId": "zdBNga8td8tGBedDT", "user": {"username": "Linch"}}, {"_id": "rfTh87AeYpZwiQze4", "postedAt": "2023-08-30T06:56:38.258Z", "postId": "PAco5oG579k2qzrh9", "htmlBody": "<p>it's true that the correlation between framings of the problem socially overlapping with longtermism and longtermism could be made spurious! there's a lot of bells and whistles on longtermism that don't need to be there, especially for the 99% of what needs to be done in which <a href=\"https://forum.effectivealtruism.org/posts/wkWG4tYEgF6Ko49bH/don-t-leave-your-fingerprints-on-the-future\">fingerprints</a> never come up.&nbsp;</p>", "parentCommentId": "QGdTXaBnLwoPiDLGE", "user": {"username": "quinn"}}, {"_id": "LaftfMEqkqRCKw9gf", "postedAt": "2023-08-30T10:19:18.918Z", "postId": "PAco5oG579k2qzrh9", "htmlBody": "<p>How right now is \"right now\"? Like would giving $100 literally this moment be worth $105 given in a week? A month?&nbsp;</p><p>Just looking for something super approximate, especially a rough time horizon where $1 now <strong>≈ </strong>$1 then</p>", "parentCommentId": null, "user": {"username": "aaronb50"}}, {"_id": "zeBCvm3wyyKGrrHBG", "postedAt": "2023-08-30T13:16:36.911Z", "postId": "PAco5oG579k2qzrh9", "htmlBody": "<p>Got it, thanks! Sorry for misunderstanding.</p>\n", "parentCommentId": "zdBNga8td8tGBedDT", "user": {"username": "Larks"}}, {"_id": "2BWyhT2WT8i6uica7", "postedAt": "2023-08-30T17:58:30.651Z", "postId": "PAco5oG579k2qzrh9", "htmlBody": "<p>I’m not confident and would encourage other fund managers to weigh in here.</p>\n<p>I’d guess that $100 now is similarly useful to us as $140 in 3 months and something like $350 in six months time after the OP matching runs out. These numbers aren’t very resilient and are mostly my gut impression.</p>\n", "parentCommentId": "LaftfMEqkqRCKw9gf", "user": {"username": "calebp"}}, {"_id": "jhyJsaZPjxv9kXcqF", "postedAt": "2023-08-30T20:01:01.497Z", "postId": "PAco5oG579k2qzrh9", "htmlBody": "<p>Shouldn't this depend on how OP will use its matching funds otherwise? Would they just sit on them longer, possibly waiting for better opportunities meeting a higher bar, or grant them to something else, and how good would that be?</p>\n", "parentCommentId": "2BWyhT2WT8i6uica7", "user": {"username": "MichaelStJules"}}, {"_id": "Dibb6dS3SDubaaLvt", "postedAt": "2023-08-30T20:20:05.776Z", "postId": "PAco5oG579k2qzrh9", "htmlBody": "<p>By \"useful to us\" I meant useful to the EAIF or LTFF (as opposed to make a comment on what the best thing to do is). I don't have a great sense of what the counterfactuals for the funding at Open Phil are. Some evidence that open Phil thinks that they are worse than donations to us is that Open Phil has historically given us large grants and has decided to offer donation matching to help incentivise donations from the public.</p>\n", "parentCommentId": "jhyJsaZPjxv9kXcqF", "user": {"username": "calebp"}}, {"_id": "sBTMNmgsXdXzdr9pM", "postedAt": "2023-08-30T22:28:25.198Z", "postId": "PAco5oG579k2qzrh9", "htmlBody": "<p>IDK 160% annualized sounds a bit implausible. Surely in that world someone would be acting differently (e.g. recurring donors would roll some budget forward or take out a loan)?</p><p>I would be curious to hear from someone on the recipient side who would genuinely prefer $10k in hand to $14k in three months' time.</p>", "parentCommentId": "2BWyhT2WT8i6uica7", "user": {"username": "tylermaule"}}, {"_id": "zpjxwzbxgFc8PpXa8", "postedAt": "2023-08-30T23:34:40.997Z", "postId": "PAco5oG579k2qzrh9", "htmlBody": "<p>Maybe it's a bit high but it doesn't seem crazy to me.</p>\n<p>We seem to have a lot of unusually good applications right now and unusually little funding. I also expect to hear back from some large donors later in the year and I expect our donations to increase around giving season (December).</p>\n", "parentCommentId": "sBTMNmgsXdXzdr9pM", "user": {"username": "calebp"}}, {"_id": "zBT2NYdSpgoNwcsAb", "postedAt": "2023-08-31T00:35:10.842Z", "postId": "PAco5oG579k2qzrh9", "htmlBody": "<p>several cruxes:</p><ul><li>how much should you value an OP longtermist $ vs an LTFF or EAIF $<ul><li>There's both a question of simple EV and how cooperative or epistemically deferential you should be.<ul><li>If Alice values her $s at 10x Bob's, and Bob values his dollars at 10x Alice's, but they know each other really well and cooperate in other settings, they should probably come to a better equilibria then the first-order calculation.&nbsp;</li></ul></li></ul></li><li>whether we're likely to get an inflow of institutional and large individual donations going forwards, now that we're \"actually trying\" to fundraise.<ul><li>The more optimistic you're about our future donations, the more it makes sense to donate know.</li></ul></li><li>whether we'll get some inflow soonish, given our pretty public and unambiguous ask.<ul><li>obviously there's some weird game theory thing going on here where <i>if </i>(say) other people are willing to cover half of our funding gap until if/when larger donors role in, the marginal value of you covering our funds is much lower. But the more other people are waiting, the more valuable it is for you to give now.</li></ul></li><li>whether it makes sense for LTFF to keep going if we don't raise much money.<ul><li>obviously most of us have fairly high-value counterfactuals, so working on LTFF when it's not doing much is pretty costly in terms of other work we could be doing.</li></ul></li><li>whether some other org will fill up the vacuum if we stop going.<ul><li>If it takes X months for a different org to fill up the vacuum while we plan out a graceful exit, funding us now rather than later is pretty valuable. If otoh we neither get more funding nor anybody else wants to step in to do this work, then the marginal value of donations to us would become a lot more flat.</li></ul></li><li>whether the projects we're currently excited about will get funding elsewhere if we don't fund them now (so us not funding them only incurs delay and switching costs from their end) vs just won't happen, or at least won't happen for X months.</li><li>whether money promised in the future is a very concrete and specific promise \"for tax law reasons I can either give you $28k in Janurary or $20k now; I'm very willing to publicly commit in writing to doing the former if y'all think it's a better idea\" vs a pretty wishy-washy \"Oh I might give $1.40x in around 3 months instead of $1x now.\" vs you mentally thinking of giving us money later but telling us anything about it<ul><li>If enough people are giving us very credible and concrete commitments, then it's at least possible for us (though a bit costly in terms of work, and probably money as well) to borrow against such commitments to fund projects today, at a much-lower-than-implied interest rate.</li><li>If we can't plan around a hypothetical future windfall, we should probably triage as if that windfall isn't there (though with some contingency plans to absorb that if necessary).</li></ul></li><li>whether the current funding landscape for smallish independent projects is a temporary lull vs \"new normal\"<ul><li>The more it's like a \"new normal\", the less critical funds are now as opposed to later.</li></ul></li></ul>", "parentCommentId": "2BWyhT2WT8i6uica7", "user": {"username": "Linch"}}, {"_id": "h53nATGdsf5qnmqb6", "postedAt": "2023-08-31T00:37:49.575Z", "postId": "PAco5oG579k2qzrh9", "htmlBody": "<blockquote><p>Some evidence that open Phil thinks that they are worse than donations to us is that Open Phil has historically given us large grants and has decided to offer donation matching to help incentivise donations from the public.</p></blockquote><p>Sure but the <i>difference</i> in value is key here right? If you value marginal OP longtermist $s at 90% those of LTFF $s, then 2:1 counteractual matching \"only\" 1.2x's your donations, whereas if you value OP longtermist $s at 10% those of LTFF $s, then the matching is equivalent to a 1.8x:1 match from an unaligned donor, or like a 2.8x donation to us overall.</p>", "parentCommentId": "Dibb6dS3SDubaaLvt", "user": {"username": "Linch"}}, {"_id": "a2ScvXaHRtHwpXt2v", "postedAt": "2023-08-31T00:41:40.642Z", "postId": "PAco5oG579k2qzrh9", "htmlBody": "<p>sapphire on LessWrong <a href=\"https://www.lesswrong.com/posts/gRfy2Q2Pg25a2cHyY/ltff-and-eaif-are-unusually-funding-constrained-right-now?commentId=aByuvaKoTGY4Tei2b\">raised this interesting objection</a>:</p><blockquote><p>I would wire you guys 300-400K today if I wasn't still worried about the theory that 'AI Safety is actually a front for funding advancement of AI capabilities'. It is a quixotic task to figure out how true that theory is or what actually happened in the past, neverminded why. But the theory seems at least kind of true to me and so I will not be donating.&nbsp;</p><p>Its unlikely to be worth your time to try to convince me to donate. But maybe other potential donors would appreciate a reassurance its not actively net-negative to donate. For example several people mentioned in the post have ties to dangerous organizations such as Anthropic.<br><br>Meta-honesty: There is not enough values alignment to trust me with sensitive information and I definitely do not endorse 'always keep secrets you agreed to keep'. I support leaking the pentagon papers, etc.&nbsp;</p></blockquote><p>Some fund managers (including myself) weighed in. For other readers similarly concerned, feel free to read the comments there.</p>", "parentCommentId": null, "user": {"username": "Linch"}}, {"_id": "faDiLjprDEd3YidFw", "postedAt": "2023-08-31T06:26:10.002Z", "postId": "PAco5oG579k2qzrh9", "htmlBody": "<blockquote><p>IDK 160% annualized sounds a bit implausible. Surely in that world someone would be acting differently (e.g. recurring donors would roll some budget forward or take out a loan)?</p></blockquote><p>Presumably the first step towards someone acting differently would be the LTFF/EAIF (perhaps somewhat desperately) alerting potential donors about the situation, which is exactly what's happening now, with this post and a few others that have recently been posted.</p><blockquote><p>I would be curious to hear from someone on the recipient side who would genuinely prefer $10k in hand to $14k in three months' time.</p></blockquote><p>FWIW, (with rare exceptions) it's not that more funding would allow us to give the same recipients larger grants, but instead that more funding would allow us to fund more grants, and marginal grants now are (according to Caleb's math) ~40% more valuable per dollar than what he expects from the marginal grant in a few months. In principle, grantees could be given the promise of (larger) delayed payment for grants instead of payment up front, but I think there are a whole host of problems with heading down that path.</p>", "parentCommentId": "sBTMNmgsXdXzdr9pM", "user": {"username": "Daniel_Eth"}}, {"_id": "wiYtRnueRxwnRmEjD", "postedAt": "2023-08-31T07:56:32.455Z", "postId": "PAco5oG579k2qzrh9", "htmlBody": "<p>A quick scan of the <a href=\"https://forum.effectivealtruism.org/posts/7RrjXQhGgAJiDLWYR/what-does-a-marginal-grant-at-ltff-look-like-funding\">marginal grants list</a> tells me that many (most?)<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnreftrznferwb1\"><sup><a href=\"#fntrznferwb1\">[1]</a></sup></span>&nbsp;of these take the form of a salary or stipend over the course of 6-12 months. I don't understand how the time-value of money could be so out of whack in this case—surely you could grant say half of the requested amount, then do another round in three months once the large donors come around?<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefnq0ax096u98\"><sup><a href=\"#fnnq0ax096u98\">[2]</a></sup></span></p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fntrznferwb1\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnreftrznferwb1\">^</a></strong></sup></span><div class=\"footnote-content\"><p>As for the rest, I don't see anything on the list that wouldn't exist in three months.</p></div></li><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnnq0ax096u98\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefnq0ax096u98\">^</a></strong></sup></span><div class=\"footnote-content\"><p>Daniel's comment says \"there are a whole host of issues\" with this approach. I'd be curious to know what those are, and how they aren't worth unlocking 40% additional value.</p></div></li></ol>", "parentCommentId": "zpjxwzbxgFc8PpXa8", "user": {"username": "tylermaule"}}, {"_id": "JLTLkk4kgn9XqGqtZ", "postedAt": "2023-08-31T09:06:49.216Z", "postId": "PAco5oG579k2qzrh9", "htmlBody": "<p>But also Open Phil wants to fund you less going forward and the matching is for this transition, right? Or was it primarily EA Funds pushing for that?</p>\n<p>Of course, the reason seems to be to reduce your reliance on Open Phil, but that should be weighed against the difference in value of grants you'd make with more of their funding instead of them. And they might want to reduce your reliance on them because they think they can do better themselves and/or because the need for extra grant advisor capacity in the space has been reduced with the reduction in funding after the collapse of FTX.</p>\n<p>One possible interpretation is that this matching and decreased future support is like them spinning off their criminal justice reform work with one last large exit grant, because they concluded it didn't meet the bar anymore. Furthermore, Open Phil has recently raised its bar for longtermist work, with about half of previous longtermist grants no longer meeting the bar.\n<a href=\"https://forum.effectivealtruism.org/posts/FHJMKSwrwdTogYLGF/we-re-no-longer-pausing-most-new-longtermist-funding\">https://forum.effectivealtruism.org/posts/FHJMKSwrwdTogYLGF/we-re-no-longer-pausing-most-new-longtermist-funding</a></p>\n<p>It's pretty plausible to me (with what limited knowledge I have of the specifics, and I would hope they'd let you know) that you no longer meet their new bar. And even if you would going forward, Open Phil might just prefer to make grants themselves, because they have the capacity and decide themselves what meets their own bar ex ante, whereas they'd have to trust you. Furthermore, by having the EA Fund managers who also work at Open Phil resign from EA Funds, they have more time to focus on Open Phil grantmaking, so they've effectively increased their capacity (maybe only marginally, I suppose, if EA Funds was only a small time commitment).</p>\n", "parentCommentId": "Dibb6dS3SDubaaLvt", "user": {"username": "MichaelStJules"}}, {"_id": "Nkf6LLLsyEMdiiuwT", "postedAt": "2023-08-31T13:30:04.923Z", "postId": "PAco5oG579k2qzrh9", "htmlBody": "<blockquote>\n<p>useful to us</p>\n</blockquote>\n<p>EA donors generally care about \"useful to the world\", but you mean the more narrow \"useful to LTFF and EAIF\", right?</p>\n", "parentCommentId": "2BWyhT2WT8i6uica7", "user": {"username": "Jeff_Kaufman"}}, {"_id": "RLuB4zp5ipfTd7vbC", "postedAt": "2023-09-01T05:58:51.650Z", "postId": "PAco5oG579k2qzrh9", "htmlBody": "<p>It's very hard/confusing for me to think of an exact number, in part because the very existence of this public announcement and public comments probably changes the relevant numbers.&nbsp;</p><p>Suppose the counterfactual for this post is that we wait for November to make a \"normal\" end-of-year fundraising post, and during that time we make do with an income stream similar to donations to us in the past few months (~100k/month). If we are honest about our funding needs in November (likely still very high), I expect say ~1-2m of donations to us from people's end-of-year donation budgets (3-5.5m including Open Phil matching). In that world, because of sharply diminishing returns, I'd likely prefer 10k additional now (30k including Open Phil matching), to 20k additional in December (60k including OP matching).&nbsp;</p><p>But the very existence of this post means we aren't living in that world, as (hopefully) donors with far lower opportunity cost of money will generously donate to us now to ameliorate such gaps. So the whole thing leaves me pretty confused.</p><p>Anyway, I will <strong>not </strong>encourage giving money to us now if the urgency imposes significant hardship on your end (beyond the level you reflectively endorse for donations in general).&nbsp;<br><br>If you are a large (&gt;50k?) donor faced very concretely with an option of giving us $X now vs $X * Y later (I <a href=\"https://forum.effectivealtruism.org/posts/PAco5oG579k2qzrh9/ltff-and-eaif-are-unusually-funding-constrained-right-now#:~:text=Linch-,1d,-7\">gave</a> the example of tax reasons below), feel free to ping Caleb or I. We can discuss together what makes the most sense, and also (if necessary, I also need to check with ops) EA Funds can borrow against such promises and/or make conditional grants to grantees.</p>", "parentCommentId": "LaftfMEqkqRCKw9gf", "user": {"username": "Linch"}}, {"_id": "dQZniajYCJQzPY3mu", "postedAt": "2023-09-01T06:12:32.655Z", "postId": "PAco5oG579k2qzrh9", "htmlBody": "<p>GPT-4 <a href=\"https://chat.openai.com/share/35c46850-e100-4482-93a8-bb36b53be2a5\">gave </a>some reasons here.&nbsp;</p><blockquote><p><i><strong>Cons:</strong></i></p><ol><li><strong>Short-Term Focus:</strong> Might inadvertently prioritize research with quick returns over longer, more comprehensive studies that require extensive time and resources.</li><li><strong>Administrative Overhead:</strong> More frequent grant cycles can increase administrative work in terms of processing, reviewing, and monitoring grants.</li><li><strong>Potential for Discontinuity:</strong> Some research projects cannot deliver meaningful results in such a short timeframe, leading to potential disruptions if they cannot secure continued funding.</li><li><strong>Researcher Uncertainty:</strong> Short-term funding might make it difficult for researchers to plan and commit to longer-term research goals.</li></ol></blockquote><p>In addition:&nbsp;</p><ul><li>Being an independent researcher on a 12-month grant is <a href=\"https://forum.effectivealtruism.org/posts/ZbdNFuEP2zWN5w2Yx/ryancarey-s-shortform?commentId=F9cXYxoY7ff2FiGZA\">already quite rough</a>, moving to a 3-month system is a pretty big ask and I expect us to lose some people to academia or corporate counterfactuals as a result</li><li>Most of the people we're funding have fairly valuable counterfactuals (especially monetarily); if we fund them with 3 months under high researcher uncertainty and potential for discontinuity, I just expect many of our grantees to spend a large fraction of the time job-searching.&nbsp;</li><li>For people who are not independent, a 3-months contract makes it very hard to navigate other explicit and implicit commitments (eg project leads will find it hard to find contractors/employees, I'm not sure it's even possible to fund a graduate student for a fraction of a semester)</li><li>Giving us $X now is guaranteed, and we can make grants or plan around them. Maybe giving us $1.4X in the future is more of a hypothetical, and not something that we can by default plan around.<ul><li>If a large donor is actually in this position, <i>please</i> talk to us so we can either discuss options together and/or secure an explicit commitment that is easier for us to work around.</li></ul></li></ul>", "parentCommentId": "wiYtRnueRxwnRmEjD", "user": {"username": "Linch"}}, {"_id": "eJDs7QMaTppN3AAyv", "postedAt": "2023-09-01T07:45:04.074Z", "postId": "PAco5oG579k2qzrh9", "htmlBody": "<p>So these are all reasons that funding upfront is strictly better than in chunks, and I certainly agree. I'm just saying that as a donor, I would have a strong preference for funding 14 researchers in this suboptimal manner vs 10 of similar value paid upfront, and I'm surprised that LTFF doesn't agree.</p><p>Perhaps there are some cases where funding in chunks would be untenable, but that doesn't seem to be true for most on the list. Again, I'm not saying there is no cost to doing this, but if the space is really funding-constrained as you say 40% of value is an awful lot to give up. Is there not every chance that your next batch of applicants will be just as good, and money will again be tight?</p>", "parentCommentId": "dQZniajYCJQzPY3mu", "user": {"username": "tylermaule"}}, {"_id": "RDqyko9sGxq6TZekS", "postedAt": "2023-09-01T08:41:08.596Z", "postId": "PAco5oG579k2qzrh9", "htmlBody": "<p>To be clear, I'm not sure I agree with the numbers Caleb gave, and I think they're somewhat less likely given that we live in a world <a href=\"https://forum.effectivealtruism.org/posts/PAco5oG579k2qzrh9/ltff-and-eaif-are-unusually-funding-constrained-right-now?commentId=RLuB4zp5ipfTd7vbC\">where we communicated our funding needs</a>. But I also want to emphasize that the comparison-in-practice I'm imagining is (say) $100k real dollars that we're aware of now vs $140k hypothetical dollars that a donor is thinking of giving to us later but not actually communicating to us; which means from our perspective we're planning as if that money isn't real. If people are actually faced with that choice I encourage actually communicating that to us; if nothing else we can probably borrow against that promise and/or make plans as if that money is real (at some discount).</p><blockquote><p>Is there not every chance that your next batch of applicants will be just as good, and money will again be tight?</p></blockquote><p>There's some chance, sure, but it's not every chance. Or at least that's my assumption. If I think averaging 100k/month (or less) is more likely than not to become the \"new normal\" of LTFF, I think we need to seriously think about scaling down our operations or shutting down.&nbsp;</p><p>I don't think this is very likely given my current understanding of donor preferences and the marginal value of LTFF grants vs other longtermist donation opportunities<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnref2yrvrlx2y5o\"><sup><a href=\"#fn2yrvrlx2y5o\">[1]</a></sup></span>, but of course it's possible.&nbsp;</p><p>I think there is a chicken-and-egg problem with the fund right now, where to do great we need<br>a) great applications<br>b) grant grantmakers/staff/organizational capacity (especially a fund chair) and<br>c) money</p><p>Hiring for good grantmakers has never been easy, but I expect it to to be much harder to find a fund chair to replace Asya if we can't promise them with moderately high probability that we are moving enough money to be worth their time working on the fund, compared to other very high value work that they could be doing (and more prosaically, many potential hires like having a guaranteed salary).</p><p>I also expect great applications to start drying up eventually if there continues to be so much funding uncertainty, though there's still some goodwill we have to burn down and I think problems like that are only going to be significant over the timescale of many months, rather than a few.&nbsp;</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fn2yrvrlx2y5o\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnref2yrvrlx2y5o\">^</a></strong></sup></span><div class=\"footnote-content\"><p>The main exception in my mind comes from some other grantmaker rising up in the space and being great, or an existing grantmaker expanding into the space that we currently work in.&nbsp;</p></div></li></ol>", "parentCommentId": "eJDs7QMaTppN3AAyv", "user": {"username": "Linch"}}, {"_id": "Kxij4rxd26765hbHB", "postedAt": "2023-09-01T11:02:35.608Z", "postId": "PAco5oG579k2qzrh9", "htmlBody": "<blockquote><p>the comparison-in-practice I'm imagining is (say) $100k real dollars that we're aware of now vs $140k hypothetical dollars</p></blockquote><p>That is very different from the question that Caleb was answering—I can totally understand your preference for real vs hypothetical dollars.</p>", "parentCommentId": "RDqyko9sGxq6TZekS", "user": {"username": "tylermaule"}}, {"_id": "rSmJ4pWXRYD7DyQbm", "postedAt": "2023-09-01T11:06:26.232Z", "postId": "PAco5oG579k2qzrh9", "htmlBody": "<p>If you expect to take in $3-6M by the end of this year, borrowing say $300k against that already seems totally reasonable.</p><p>Not sure if this is possible, but I for one would be happy to donate to LTFF today in exchange for a 120% regrant to the Animal Welfare Fund in December<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefa2vri7o1qh\"><sup><a href=\"#fna2vri7o1qh\">[1]</a></sup></span></p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fna2vri7o1qh\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefa2vri7o1qh\">^</a></strong></sup></span><div class=\"footnote-content\"><p>This would seem to be an abuse of the Open Phil matching, but perhaps that chunk can be exempt</p></div></li></ol>", "parentCommentId": "RLuB4zp5ipfTd7vbC", "user": {"username": "tylermaule"}}, {"_id": "Kqor5WyAy2Qwwrgan", "postedAt": "2023-09-01T23:38:36.151Z", "postId": "PAco5oG579k2qzrh9", "htmlBody": "<p>Thanks so much for your offer! That'd be a great option to have on the table! Hopefully enough donors will ameliorate our gaps in the next month, but I might check in with you against later this month if a) we have some more firm commitments for donations by end-of-year<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefiajlhq7i3aq\"><sup><a href=\"#fniajlhq7i3aq\">[1]</a></sup></span>, and b) we're still quite severely funding constrained as of Sept 20th, and c) we can't find lower bids.</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fniajlhq7i3aq\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefiajlhq7i3aq\">^</a></strong></sup></span><div class=\"footnote-content\"><p>One issue with the straightforward \"expect to get $3-6M by the end of this year\" logic is that a model that spits out that sentence would also predict that this fundraising post + associated public and private comms should also work as fundraising for us; if we turn out to receive neither donations in the near future nor promises after our posts now, I should also strongly update against my original estimate of getting 3-6M by EOY.</p></div></li></ol>", "parentCommentId": "rSmJ4pWXRYD7DyQbm", "user": {"username": "Linch"}}, {"_id": "KtpafhfpNLBHREG7a", "postedAt": "2023-09-13T22:53:11.788Z", "postId": "PAco5oG579k2qzrh9", "htmlBody": "<p>UPDATE 2023/09/13:&nbsp;</p><p>Including only money that has already landed in our bank account and extremely credible donor promises of funding, LTFF has raised ~1.1M and EAIF has raised ~500K. After Open Phil matching, this means LTFF now has ~3.3M additional funding and EAIF has ~1.5m in additional funding.<br><br>We are also aware that other large donors, including both individuals and non-OP institutional donors, are considering donating to us. In addition, while some recurring donors have likely moved up their donations to us because of our recent unusually urgent needs, it is likely that we will still accumulate some recurring donations in the coming months as well. Thus, I think at least <i>some</i> of the less-certain sources of funding will come through. However, I decided to conservatively not include them in the estimate above.&nbsp;</p><p><strong>From my (Linch)'s perspective, this means both LTFF nor EAIF are no longer </strong><i><strong>very</strong></i><strong> funding constrained for the time period we wanted to raise money for (the next ~6 months), however both funds are still funding constrained and can productively make good grants with additional funding.</strong></p><p>To be more precise, we estimated a good target spend rate for LTFF is as 1M/month, and a good target spend rate for EAIF as ~800k/month. The current funds will allow LTFF to spend ~550k/month and EAIF to spend ~250k/month, or roughly a gap of 450k/month and 550k/month, respectively. More funding is definitely helpful here, as more money will allow both funds to make productively make good grants<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefofesuci41gg\"><sup><a href=\"#fnofesuci41gg\">[1]</a></sup></span>.<br><br>Open Phil's matching is up to 3.5M from OP (or 1.75M from you) for each fund. This means LTFF would need ~650k more before maxing out on OP matching, and EAIF would need ~1.25M more. Given <a href=\"https://forum.effectivealtruism.org/posts/PAco5oG579k2qzrh9/ltff-and-eaif-are-unusually-funding-constrained-right-now#Our_Ask\">my rough estimate of funding needs</a> above, which is ~6.2M/6 months for LTFF and ~5M/6 months for EAIF, this means LTFF would ideally like to receive 1M above the OP matching.&nbsp;</p><p>I appreciate donors' generosity and commitment to improving the world. I hope the money will be used wisely and cost-effectively.</p><p>I plan to write a high-level update and reflections post<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnreftc0f9dly4qn\"><sup><a href=\"#fntc0f9dly4qn\">[2]</a></sup></span>&nbsp;on the EAForum (crossposted to LessWrong) after LTFF either a) reach our estimated funding target or b) decided to deprioritize fundraising, whichever one comes earlier.</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnofesuci41gg\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefofesuci41gg\">^</a></strong></sup></span><div class=\"footnote-content\"><p>For LTFF, the current level of funding is enough to fund all projects at the 1M tier, and ~50% of projects<a href=\"https://forum.effectivealtruism.org/posts/7RrjXQhGgAJiDLWYR/what-does-a-marginal-grant-at-ltff-look-like-funding#_5M\"> at the 5M tier</a>. We don't have very good public information out about marginal EAIF grants out just yet, but I hope to cowrite/copublish another post in the next few weeks about marginal EAIF grants. &nbsp;</p></div></li><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fntc0f9dly4qn\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnreftc0f9dly4qn\">^</a></strong></sup></span><div class=\"footnote-content\"><p>I'm a bit confused about the ideal frequency of high-level updates. On the one hand I think informing donors regularly is quite valuable, especially as our funding needs change. On the other hand I don't want the EA forum to be clogged with like 5 fundraising posts by the same org in a month.</p></div></li></ol>", "parentCommentId": null, "user": {"username": "Linch"}}, {"_id": "SiLAmDP6vntD6cbZG", "postedAt": "2023-12-21T20:39:28.928Z", "postId": "PAco5oG579k2qzrh9", "htmlBody": "<p>UPDATE 2023/12/21: <a href=\"https://forum.effectivealtruism.org/posts/zt6MsCCDStm74HFwo/ea-funds-organisational-update-open-philanthropy-matching\">Open Phil's $3.5M donation matching </a>for the Long-Term Future Fund<a href=\"https://dashboard.effectivealtruism.org/public/dashboard/d76c3f83-e183-49aa-ab37-dcfab89740a3\"> has now been filled</a><span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefucm85ftzo39\"><sup><a href=\"#fnucm85ftzo39\">[1]</a></sup></span>. So your donations to LTFF will no longer be matched. That said, this fundraising post was written 4 months ago, and we'd like to continue fundraising (especially given that December is an unusually good time to fundraise).</p><p>Open Phil's donation matching for the EA Infrastructure Fund <a href=\"https://dashboard.effectivealtruism.org/public/dashboard/d76c3f83-e183-49aa-ab37-dcfab89740a3\">has <strong>not</strong> been filled</a> (currently $1.3M/$3.5), and my current projection is that by default they <strong>won't be filled by the deadline</strong> (end of Jan 2024). So to the extent that you're fairly indifferent between LTFF and EAIF, and believe that either fund is a better use of marginal resources than OP's marginal dollar, it might make more sense to donate to EAIF than LTFF.<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnref0489pjwi7b4d\"><sup><a href=\"#fn0489pjwi7b4d\">[2]</a></sup></span></p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnucm85ftzo39\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefucm85ftzo39\">^</a></strong></sup></span><div class=\"footnote-content\"><p>The dashboard currently says $3.34M/$3.5M filled but my understanding is that a few donations that aren't up on the dashboard yet would be enough to cross over the line.&nbsp;</p></div></li><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fn0489pjwi7b4d\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnref0489pjwi7b4d\">^</a></strong></sup></span><div class=\"footnote-content\"><p>Of course, if you think one fund is much more impactful than another, you should donate to that fund instead.&nbsp;</p></div></li></ol>", "parentCommentId": null, "user": {"username": "Linch"}}]