[{"_id": "WKroe2h4cQexfT9iY", "postedAt": "2024-01-18T17:58:04.746Z", "postId": "PaGcxuiKYiyEGBvpK", "htmlBody": "<p>I love the clear way you write here, and the incredibly wide range of interventions you have considered. I think this is a really important summary you've put together, and I'm surprised it's not far more upvoted, maybe it will happen! This is a great place for those interested in cost effective mental health reduction to start, and a credit to CEARCH.</p>\n<p>I think alcohol reduction and pain relief are quite underexplored and have potential.</p>\n<p>I might comment more later, I had one query about this statement I didn't quite understand \"In theory, a well-conducted RCT would experience equal amounts of response bias in its control and intervention group\".</p>\n<p>Why would this be the case if the participants are not blinded, which they can't be here. If you know your are are not getting the intervention I would have thought you might be more inclined to respond with lower scores under all 3 bias types you discussed, and with the intervention give higher scores. I might be missing something but I'm not sure why we would expect the bias to move the control and intervention group in the same direction.</p>\n<p>Nice one!</p>\n", "parentCommentId": null, "user": {"username": "NickLaing"}}, {"_id": "jGBpK5ayTdKatLMph", "postedAt": "2024-01-19T16:55:10.472Z", "postId": "PaGcxuiKYiyEGBvpK", "htmlBody": "<p>Thank you for the kind words, Nick!</p><p>Completely agree that if the participants know they are receiving a special treatment they are likely to show more response bias. By \"well-conducted RCT\" I was thinking of studies with an active control like <a href=\"https://www.thelancet.com/journals/langlo/article/PIIS2214-109X(19)30548-0/fulltext#%20\">Nakimuli-Mpungu et al. (2020)</a> in which patients \"were randomly assigned to deliver either [group support psychotherapy] or group HIV education\". If done well, the participants won't know which treatment the scientists \"want\" to perform better and so response bias will be constant.</p>", "parentCommentId": "WKroe2h4cQexfT9iY", "user": {"username": "Stan Pinsent"}}, {"_id": "RtyAGchx3AADjLkpr", "postedAt": "2024-01-19T16:58:33.530Z", "postId": "PaGcxuiKYiyEGBvpK", "htmlBody": "<p>Gotcha makes sense. That's very true love the active control!</p>\n", "parentCommentId": "jGBpK5ayTdKatLMph", "user": {"username": "NickLaing"}}]