[{"_id": "anHYskyGftbzzFdNk", "postedAt": "2022-08-24T15:10:35.300Z", "postId": "PAxTSZPW7MBXKkvZg", "htmlBody": "<p>Aging sometimes assists in developing perspective. &nbsp; I was 45 years old before I touched a computer, or to my knowledge, much of anything with a computer chip in it. &nbsp; I never missed any of &nbsp;it until I &nbsp;had it.</p><p>So yes, if the chip industry were to collapse for whatever reason, we would surely miss &nbsp;the chips until supplies could be re-established. &nbsp;But life would go on. &nbsp;People would still fall in love, babies would still be born, lives could still be fulfilling. &nbsp;</p><p>The real danger may not be that chips vanish for a time, but rather how we reacted to that. &nbsp; If we get hysterical and start bombing each other over chips, then yes, it could get very weird very fast.</p>", "parentCommentId": null, "user": {"username": "Phil Tanny"}}, {"_id": "xY4gWN3awQT5NqNJY", "postedAt": "2022-08-25T06:45:40.375Z", "postId": "PAxTSZPW7MBXKkvZg", "htmlBody": "<p>This is interesting! &nbsp;I have a couple of questions to help me understand how TSMC might be relevant for AI concerns:</p><ul><li>\"TSMC is one of the two companies that can make 5nm transistors and will be, for some time, the only company to make 3nm chips.\" &nbsp;What time is that, exactly? &nbsp;Does TSMC generally have a 1-year lead on the second-most-advanced company? &nbsp;A 3-year lead? &nbsp;Just a few months? &nbsp;And what about the third and forth and fifth most-advanced companies?</li><li>Which are those other companies? &nbsp;(Samsung, Global Foundries, SMIC?)</li><li>How concentrated are TSMC's (and those other companies') factories? &nbsp;Are they spread in multiple locations around each company's home country, or does each company just have one gigantic factory that could be disabled by, say, a cruise missile attack? &nbsp;(Basically, I am imagining a scenario where some powerful nation freaks out about AI and decides to immediately and unilaterally press \"pause\" on all new semiconductor development. &nbsp;How many strikes, in how many countries, would it take to disable 90% or 99% of the world's manufacturing capability?)</li><li>If a nation decided to start the Butlerian Jihad by attacking semiconductor fabs in this way, would it make much of a difference to the world's existing stock of chips? &nbsp;How much computing power is produced each year by TSMC (and others), compared to the total amount of computing power from all prior years? &nbsp;I guess if Moore's law held perfectly, and computing power per-chip doubled every 18 months, we'd expect the fab companies' output over 18 months to match the entire existing world supply from all the doubling times before that period (100% = 50% + 25% + 12.5% + 6.25% + ...). &nbsp;But this seems too extreme to believe -- surely we're not literally doubling the entire world's stock of computing power every 18 months!</li><li>How easy is it for chip fabs to reconfigure their factories and start producing new kinds of chip? &nbsp;If the nations of the world came together to try and outlaw new GPU production but wanted to keep up production of other chips to as to avoid creating a huge global recession, how difficult would that be to enforce?</li></ul><p>Sorry that some of these questions are dark and warlike -- hopefully humanity will never get to the point where it's so desperate to delay AI that we start randomly destroying chip factories! &nbsp;But I want to understand if this is a viable strategy at all, or if there is so much compute already out in the world that shutting down fabs wouldn't make any difference.</p>", "parentCommentId": null, "user": {"username": "Jackson Wagner"}}, {"_id": "MyPCwwdDJNoFvBxji", "postedAt": "2022-08-25T15:20:48.404Z", "postId": "PAxTSZPW7MBXKkvZg", "htmlBody": "<p>Thanks for the comment! The TSMC bit at the beginning is more illustrative of how important Taiwan is than anything. Aside from the capacity and expertise that TSMC brings to the table, it's equally if not more the case that all the dependencies up and down the global semiconductor supply chain which run through Taiwan. Samsung and Intel fabs, for instance, would not be able to produce chips without Taiwanese inputs, and replacing those inputs in another geography would take years.&nbsp;</p><p>There is intense geographic concentration of fabs and factories that make inputs to fabrication around Hsinchu. If someone starting planting bombs or doing missile strikes in this neighborhood, it would be incredibly disruptive to the global economy.&nbsp;</p><p><i>How easy is it for chip fabs to reconfigure their factories and start producing new kinds of chip? </i>Not that easy, again you need specific machines to make different types of chips.</p>", "parentCommentId": "xY4gWN3awQT5NqNJY", "user": {"username": "Jordan_Schneider"}}]