[{"_id": "5Ko4Ns4ukfiinHN8h", "postedAt": "2023-03-29T09:07:29.542Z", "postId": "PcDW7LybkR468pb7N", "htmlBody": "<p>Some people have criticised the timing. I think there's some validity to this, but the trigger has been pulled and cannot be unpulled. You might say that we could try write another similar letter a bit further down the track, but it's hard to get people to do the same thing twice and even harder to get people to pay attention.</p><p>So I guess we really have the choice to get behind this or not. I think we should get behind this as I see this letter as really opening up the Overton Window. I think it would be a mistake to wait for a theoretical perfectly timed letter to sign, as opposed to signing what we have in front of us.</p>", "parentCommentId": null, "user": {"username": "casebash"}}, {"_id": "XbWpAmDRu8cRuuqGW", "postedAt": "2023-03-29T09:09:46.650Z", "postId": "PcDW7LybkR468pb7N", "htmlBody": "<p>I'll be interested to see how/if this gets picked up by mainstream media.</p>\n<p>For example, this sentence seems to be an exaggeration, particularly</p>\n<p>\"Unfortunately, this level of planning and management is not happening, even though recent months have seen AI labs locked in an out-of-control race to develop and deploy ever more powerful digital minds that no one – not even their creators – can understand, predict, or reliably control.\"</p>\n<p>I worry this letter might be passed off as \"crying wolf\", although I agree that 6 month pause would be amazing.</p>\n<p>Will be watching the news...</p>\n", "parentCommentId": null, "user": {"username": "TheOtherHannah"}}, {"_id": "iTyS7wv34PHBFaDjJ", "postedAt": "2023-03-29T09:38:49.788Z", "postId": "PcDW7LybkR468pb7N", "htmlBody": "<p>I expect there will be much more public discussion on regulating AI and much more political willingness to do ambitious things about AI in the coming years when economic and cultural impacts become more apparent, so I'm spontaneously wary of investing significant reputation on something (potentially) not sufficiently well thought through.&nbsp;</p><p>Also, it's not a binary of signing vs. not-signing. E.g. risk reducers can also enter the discussion caused by the letter and make constructive suggestions what will contribute more to longterm safety.</p>", "parentCommentId": "5Ko4Ns4ukfiinHN8h", "user": {"username": "MaxRa"}}, {"_id": "jLxDireLYPTEEYnjM", "postedAt": "2023-03-29T09:47:47.338Z", "postId": "PcDW7LybkR468pb7N", "htmlBody": "<p>Is there a rationale for a moratorium on large models at this moment instead of some time later? There is not a single mention of GPT-4's capabilities and why exactly it's a concern right now in the letter. Most of this article seems to talk about future possibilities for AI, and while I understand they are a concern, what exactly about GPT-4 makes them relevant right now?</p><p>The 6 months also seems entirely arbitrary. In any case, I feel like this letter could benefit from <i>some</i> rationale/explanation, maybe even a vague one for the choices of a 6 month moratorium and it happening now of all times.</p><p>Also, this article mentions GPT-4 and various AI safety risks, and seems to associate the two, but actually makes no explicit statement on what safety risks models larger than GPT-4 are likely to create. This kind of rhetoric rather disturbs me.</p>", "parentCommentId": null, "user": {"username": "aqwalnut"}}, {"_id": "wvpxbCnaj7AiJXbHG", "postedAt": "2023-03-29T09:55:56.039Z", "postId": "PcDW7LybkR468pb7N", "htmlBody": "<p>I think it's great timing. I've been increasingly thinking that now is the time for a global moratorium. In fact, I was up until the early hours drafting a post on why we need such a moratorium! Great to wake up and see this :)</p>", "parentCommentId": "5Ko4Ns4ukfiinHN8h", "user": {"username": "Greg_Colbourn"}}, {"_id": "rPKGZokJeCBtFm7Y9", "postedAt": "2023-03-29T09:58:01.794Z", "postId": "PcDW7LybkR468pb7N", "htmlBody": "<p>Notice the word \"all\" in \"all AI labs\", and the plural \"government<i>s</i>\". This shouldn't just be focused on the West. I hope the top signatories are reaching out to labs in China and other countries. And the UN for that matter. This needs to be global to be effective.</p>", "parentCommentId": null, "user": {"username": "Greg_Colbourn"}}, {"_id": "vXZABv4aFKuPoFucs", "postedAt": "2023-03-29T10:01:11.810Z", "postId": "PcDW7LybkR468pb7N", "htmlBody": "<p>I sympathise with others who have particular concerns about the details of this letter, and most especially the fact that <a href=\"https://twitter.com/ylecun/status/1640910484030255109\">signatures were unverified</a> (though the link now includes an email validation at the bottom). A good discussion from a sceptical perspective can be found in <a href=\"https://twitter.com/MatthewJBar/status/1640945233939795969\">this thread</a> by Matthew Barnett. However, I think on balance I support FLI releasing this letter, mostly for reasons that Nate states <a href=\"https://twitter.com/So8res/status/1640935903656022016?cxt=HHwWgMDQydSg48UtAAAA\">here</a>. I think that if you're pessimistic about the current direction of AI research, and the balance between capabilities/safety, then one of the major actors who would have the ability to step in and co-ordinate those in a race and buy more time would be the U.S. Government.&nbsp;</p><p>Again, I sympathise with scepticism about Government intentions/track record/capability to regulate but I think I'm a lot more sympathetic to it than the <a href=\"https://www.lesswrong.com/posts/6uKG2fjxApmdxeHNd/fli-open-letter-pause-giant-ai-experiments\">LessWrong commenters</a>. That might be a US/UK cultural difference, but I don't think the counterfactual of no public letter and no government action leads to anywhere good, and I simply don't share the same worldview of Neo-Realism in International Relations and Public Choice in Domestic Politics that makes any move in that direction appear to be net-negative ¯\\_(ツ)_/¯</p><p>Finally, I hope that this letter can serve as a push for AI Governance to be viewed as something that goes hand-in-hand with Technical AI Safety Research. I think that both are very important parts of making this century go well, and I think that the letter is a directional step that we can get behind and improve upon, rather than dismiss.</p>", "parentCommentId": null, "user": {"username": "JWS"}}, {"_id": "H86P7kuAofkuvndkQ", "postedAt": "2023-03-29T10:05:15.005Z", "postId": "PcDW7LybkR468pb7N", "htmlBody": "<p>Agreed. I find the implication that if the US slows down, China will inevitably race ahead far from inevitable. If China wants the 21st Century to be <a href=\"https://www.brookings.edu/essay/the-long-game-chinas-grand-strategy-to-displace-american-order/\">'The Chinese Century'</a>, then a misaligned AGI seems a pretty surefire way to remove that from the table. I don't have expertise into the state of Chinese AI Research (though I do know some Western AI experts are highly sceptical of their ability to catch up), but I'm not sure why arguments to slow down AI progress/focusing more on safety would be persuasive from one part of the world but not another.</p>", "parentCommentId": "rPKGZokJeCBtFm7Y9", "user": {"username": "JWS"}}, {"_id": "4MLAwvnyTunvEgW7h", "postedAt": "2023-03-29T10:47:01.552Z", "postId": "PcDW7LybkR468pb7N", "htmlBody": "<p>GPT-4 is being used to speed up development of GPT-5 <a href=\"https://openai.com/research/gpt-4#:~:text=We%E2%80%99ve%20also%20been%20using%20GPT%2D4%20internally%2C%20with%20great%20impact%20on%20functions%20like%20support%2C%20sales%2C%20content%20moderation%2C%20and%20programming.\">already</a>. If GPT-5 can make GPT-6 on it's own, it could then spiral to an unstoppable superintelligence. One with arbitrary goals that are incompatible with carbon-based life. How confident are we that this can't happen? You're right that they could do more to explain this in the letter. But I think broad appeal is what they were targeting (hence mention of other lesser concerns like job automation etc).</p>", "parentCommentId": "jLxDireLYPTEEYnjM", "user": {"username": "Greg_Colbourn"}}, {"_id": "xKSdSLkypbyGqTdZn", "postedAt": "2023-03-29T12:38:55.767Z", "postId": "PcDW7LybkR468pb7N", "htmlBody": "<p>(Trying to understand the space better, not being acusatory.)</p>\n<p>How is it that there is not a well-thought-out response right now?</p>\n<p>E.g. it seems that it has probably been clear to people in AI safety / governance for some time that there would be an increase in the Overton window in which placing some demands would be more feasilbe than at other times, so I am surprised there isn't a letter like this that is more thought through / endorsed by people that are not happy with the current letter.</p>\n", "parentCommentId": "iTyS7wv34PHBFaDjJ", "user": {"username": "jackva"}}, {"_id": "WviFu5xybQY2z7pD2", "postedAt": "2023-03-29T13:39:36.951Z", "postId": "PcDW7LybkR468pb7N", "htmlBody": "<p>Good question. I'm still relatively new to thinking about AI governance, but would guess that two puzzle pieces are&nbsp;</p><p>a) broader public advocacy has not been particularly prioritized so far</p><ul><li>there's uncertainty what concretely to advocate for and still a lot of (perceived) need for nuance for the more concrete ideas that do exist</li><li>there are other ways of more targeted advocacy, such as talking to policy makers directly, or talking to leaders in ML about risk concerns</li></ul><p>b) there are not enough people working on AI governance issues to be so prepared for things</p><ul><li>not sure what the numbers are, but e.g. it seems like at least a few key sub-topics in AI governance rely on the work of like 1-2 extremely busy people</li></ul><p>Also, the letter just came out. I'd not be very surprised if a few more experienced people would publish responses in which they lay out their thinking a bit, especially if the letter seems to gather a lot of attention.</p>", "parentCommentId": "xKSdSLkypbyGqTdZn", "user": {"username": "MaxRa"}}, {"_id": "NXybr5wGhW5imSjzP", "postedAt": "2023-03-29T15:19:40.922Z", "postId": "PcDW7LybkR468pb7N", "htmlBody": "<p>The point of the letter is to raise awareness for AI safety, not because they actually think a pause will be implemented. We should take the win.</p>\n", "parentCommentId": null, "user": {"username": "RedStateBlueState"}}, {"_id": "CpkPPAoSowKexmCG2", "postedAt": "2023-03-29T16:38:32.510Z", "postId": "PcDW7LybkR468pb7N", "htmlBody": "<p>The LessWrong comments here are generally (<a href=\"https://www.lesswrong.com/users/gerald-monroe\">quite</a>) (<a href=\"https://www.lesswrong.com/users/1a3orn\">brutal</a>), and I think I disagree, which I'll try to outline very briefly below. But I think it may be generally more fruitful here to ask some questions I had to break down the possible subpoints of disagreement as to the goodness of this letter.&nbsp;</p><p>I expected some negative reaction because I know that Elon is generally looked down upon by the EAs that I know, with some solid backing to those claims when it comes to AI given that he cofounded OpenAI, but with the (<a href=\"https://www.theverge.com/2023/3/29/23661374/elon-musk-ai-researchers-pause-research-open-letter\">immediate</a>) (<a href=\"https://www.reuters.com/technology/musk-experts-urge-pause-training-ai-systems-that-can-outperform-gpt-4-2023-03-29/\">press</a>) (<a href=\"https://www.bbc.com/news/technology-65110030\">attention</a>) it's getting in combination with some heavy hitting signatures (including Elon Musk, Stuart Russel, Steve Wozniak (Co-founder, Apple), Andrew Yang, Jaan Tallinn (Co-Founder, Skype, CSER, FLI), Max Tegmark (President, FLI), and Tristan Harris (from The Social Dilemma) among many others) I kind of can't really see the overall impact of this letter being net negative. At worst it seems mistimed and with technical issues, but at best it seems one of the better calls to action (or global moratoriums <a href=\"https://forum.effectivealtruism.org/posts/PcDW7LybkR468pb7N/fli-open-letter-pause-giant-ai-experiments?commentId=wvpxbCnaj7AiJXbHG\">as Greg Colbourn put it</a>) that could have happened, given AI's current presence in the news and much of the world's psyche. &nbsp;</p><p>But I'm not super certain in anything, and generally came away with a lot of questions, here's a few:</p><ol><li>How convergent is this specific call for pause on developing strong language models with how AI x-risk people would go about crafting a verifiable, tangible metric for AI labs to follow to reduce risk? Is this to be seen as a good first step? Or something that might actually be close enough to what we want that we could rally around this metric given its endorsement by this influential group?<ol><li>This helps clarify the \"<i>6 months isn't enough to develop the safety techniques they detail\" </i>objection which was fairly well addressed <a href=\"https://www.lesswrong.com/posts/6uKG2fjxApmdxeHNd/fli-open-letter-pause-giant-ai-experiments?commentId=MCzovnEjcTrTchyey\">here</a> as well as the \"<a href=\"https://www.lesswrong.com/posts/6uKG2fjxApmdxeHNd/fli-open-letter-pause-giant-ai-experiments?commentId=LvccYwTvTzHEEjCYR\"><i>Should Open AI be at the front</i></a>\" objection.</li></ol></li><li>How much should we view messages that are a bit more geared towards non x-risk AI worries than the community seems to be? They ask a lot of good questions here, but they are also still asking \"Should we let machines flood our information channels with propaganda and untruth?\" an important question, but one that to me seems to deviate away from AI x-risk concerns. &nbsp;<ol><li>This is at least tangential to the \"<i>This letter felt rushed\" </i>objection, because even if you accept it was rushed, the next question is \"Well, what's our bar for how good something has to be before it is put out into the world?\"&nbsp;</li></ol></li><li>Are open letters with influential signees impactful? This letter at the very least to me seems to be a neutral at worst, quite impactful at best sort of thing, but I have very little to back that, and honestly can't recall any specific time I know of where open letters cause significant change at the global/national level.&nbsp;</li><li>Given the recent desire to distance from potentially fraught figures, would that mean shying away from a group wide EA endorsement of such a letter because a wild card like Elon is a part of it? I personally don't think he's at that level, but I know other EAs who would be apt to characterize him that way.</li><li>Do I sign the post? What is the impact of adding signatures with significantly less professional or social clout to such an open letter? Does it promote the message of AI risk as something that matters to everyone? Or would someone look at \"Tristan Williams, Tea Brewer\" and think \"oh, what is he doing on this list?\"&nbsp;</li></ol>", "parentCommentId": null, "user": {"username": "tswizzle96"}}, {"_id": "WRkHFcvbhFNtyFkLC", "postedAt": "2023-03-29T16:51:25.498Z", "postId": "PcDW7LybkR468pb7N", "htmlBody": "<p>I signed and strongly support this open letter.</p><p>Let me add a little global perspective (as a US citizen who's lived in 4 countries outside the US for a total of 14 years, and who doesn't always see the US as the 'good guy' in geopolitics).</p><p>The US is 4% of the world's population. The American AI industry is (probably) years ahead of any other country, and is pushing ahead with the rationale that 'if we don't keep pushing ahead, a bad actor (which usually implies China) will catch up, and that would be bad'. Thus, we impose AI X-risk on the other 96% of humans without the informed consent, support, or oversight.&nbsp;</p><p>We used the same arms-race rationale in the 1940s to develop the atomic bomb ('if we don't do it, Germany will') and in the 1950s to develop the hydrogen bomb ('if we don't do it, the Soviet Union will'). In both cases, we were the bad actor. The other countries were nowhere close to us. We exaggerated the threat that they would catch up, and we got the American public to buy into that narrative. But we were really the ones pushing ahead into X-risk territory. Now we're promoting the same narrative for AI development. 'The AI arms race cannot be stopped', 'AGI is inevitable', 'the genie is out of the bottle', 'if not us, then China', etc, etc.</p><p>We Americans have a very hard time accepting that 'we might be the baddies'. We are uncomfortable acknowledging any moral obligations to the rest of humanity (if they conflict in any way with our geopolitical interests). We like to impose our values on the world, but we don't like to submit to any global oversight by others.&nbsp;</p><p>I hope that this public discussion about AI risks also includes some soul-searching by Americans -- not just the AI industry, but all of us, concerning the way that our country is, yet again, pushing ahead with developing extremely dangerous technology, without any sense of moral obligation to others.</p><p>Having taught online courses for CUHK-Shenzhen in China for a year, and discussed quite a bit about EA, AI, and X risk with the very bright young students there, I often imagine how they would view the recent developments in the American AI industry. I think they would be appalled by our American hubris. They know that the American political system is too partisan, fractured, slow, and dysfunctional to impose any effective regulation on Big Tech. They know that American tech companies are legally obligated (by 'fiduciary duty' to shareholders) to prioritize quarterly profits over long-term human survival. They know that many Bay Area tech bros supporting AI are transhumanists, extropians, or Singularity-welcomers who look forward to humanity being replaced by machines. They know that many Americans view China as a reckless, irresponsible, totalitarian state that isn't worth listening to about any AI safety concerns. So, I imagine, any young Chinese students who's paying attention would take an extremely negative view of the risks that the American AI industry is imposing on the other 7.7 billion people in the world.</p>", "parentCommentId": null, "user": {"username": "geoffreymiller"}}, {"_id": "sopzJaAKDzvR4iWnN", "postedAt": "2023-03-29T18:44:25.349Z", "postId": "PcDW7LybkR468pb7N", "htmlBody": "<blockquote><p>and most especially the fact that <a href=\"https://twitter.com/ylecun/status/1640910484030255109\">signatures were unverified</a> (though the link now includes an email validation at the bottom).</p></blockquote><p>I wonder if this is a consequence of the embargo being broken and hence their not being fully ready.</p>", "parentCommentId": "vXZABv4aFKuPoFucs", "user": {"username": "Larks"}}, {"_id": "eAvAzFkuD9Ha5BXMf", "postedAt": "2023-03-29T19:45:20.236Z", "postId": "PcDW7LybkR468pb7N", "htmlBody": "<p>6 months sounds like a guess as to how long the leading companies might be willing to comply.</p>\n<p>The timing of the letter could be a function of when they were able to get a few big names to sign.</p>\n<p>I don't think they got enough big names to have much effect. I hope to see a better version of this letter before too long.</p>\n", "parentCommentId": "jLxDireLYPTEEYnjM", "user": {"username": "PeterMcCluskey"}}, {"_id": "Q2krAEwABj5jbjKob", "postedAt": "2023-03-29T21:43:08.884Z", "postId": "PcDW7LybkR468pb7N", "htmlBody": "<p>I'll have a go at answering your questions:<br><br>1. This is a great first step. Really any kind of half-decent foot in the door is good at this stage, whilst the shock of GPT-4 is still fresh. A much better letter in even two months time would be worse I think.<br><br>2. Engendering broad support for a moratorium is good. We don't need everyone to be behind it for x-risk reasons, but we do need a global majority to be behind it. This is why I've said that it might be good if a taboo around AGI development can be inculcated in society - a taboo is stronger than regulation.<br><br>3. Would be interested to see data on this.<br><br>4. I don't think this is a significant concern. With broad enough support everyone can have at least a few people they greatly admire on the list.&nbsp;<br><br>5. Yes, I think the more signatures, the better. We need the whole world (or at least a large majority of it) to get behind a global moratorium on AGI development!</p>", "parentCommentId": "CpkPPAoSowKexmCG2", "user": {"username": "Greg_Colbourn"}}, {"_id": "HD5riJd2xb3ixnqzT", "postedAt": "2023-03-30T01:07:57.997Z", "postId": "PcDW7LybkR468pb7N", "htmlBody": "<p>To quote the linked text:</p><blockquote><p>We’ve also been using GPT-4 internally, with great impact on functions like support, sales, content moderation, and programming</p></blockquote><p>I don't think \"we used GPT to write a sales pitch\" is evidence of an impending intelligence explosion. And having used GPT for programming myself, it's mostly a speedup mechanism that still makes plenty of errors. It substitutes for the the tedious part of coding which is currently done by googling on stack exchange, not the high level designing tasks.</p><p>The chance of \"gpt-5 making gpt-6 on it's own\" is approximately 0%. GPT is trained to predict text, not to build chatbots.&nbsp;</p>", "parentCommentId": "4MLAwvnyTunvEgW7h", "user": {"username": "titotal"}}, {"_id": "5ZZWTNDPECsXDeejd", "postedAt": "2023-03-30T06:53:56.508Z", "postId": "PcDW7LybkR468pb7N", "htmlBody": "<blockquote><p>They know that American tech companies are legally obligated (by 'fiduciary duty' to shareholders) to prioritize quarterly profits over long-term human survival.</p></blockquote><p>Fwiw I read <a href=\"https://medium.com/bull-market/there-is-no-effective-fiduciary-duty-to-maximize-profits-939ae50d0572\">here</a> that there actually is not such a legal duty to prioritize profits.</p>", "parentCommentId": "WRkHFcvbhFNtyFkLC", "user": {"username": "MaxRa"}}, {"_id": "CESmRNS2vWtDaotzB", "postedAt": "2023-03-30T08:13:32.771Z", "postId": "PcDW7LybkR468pb7N", "htmlBody": "<blockquote><p>It substitutes for the the tedious part of coding which is currently done by googling on stack exchange, not the high level designing tasks.</p></blockquote><p>Right, I'm thinking the same. But that is still freeing up research engineer time, making the project go faster.</p><blockquote><p>The chance of \"gpt-5 making gpt-6 on it's own\" is approximately 0%. GPT is trained to predict text, not to build chatbots.&nbsp;</p></blockquote><p><a href=\"https://www.youtube.com/watch?v=bJLcIBixGj8&amp;ab_channel=RobertMiles\">Mesaoptimisation</a> and <a href=\"https://wiki.lesswrong.com/wiki/Basic_AI_drives#Instrumental_convergence_thesis\">Basic AI Drives</a> are dangers here. And GPT-4 isn't all that far off being capable of <a href=\"https://www.lesswrong.com/posts/4Gt42jX7RiaNaxCwP/more-information-about-the-dangerous-capability-evaluations#Our_Conclusions:~:text=However%2C%20the%20models,things%20for%20them.\">replicating itself autonomously</a> when instructed to do so.</p>", "parentCommentId": "HD5riJd2xb3ixnqzT", "user": {"username": "Greg_Colbourn"}}, {"_id": "S9wfsNfmCTDofEaaT", "postedAt": "2023-03-30T09:01:05.670Z", "postId": "PcDW7LybkR468pb7N", "htmlBody": "<p>It makes the project go somewhat faster, but from the software people I've talked to, not by <i>that</i> much. there are plenty of other bottlenecks in the development process. For example, the \"human reinforcement\" part of the process is necessarily on a human scale, even if AI can speed things up around the edges.&nbsp;</p><blockquote><p>And GPT-4 isn't all that far off being capable of <a href=\"https://www.lesswrong.com/posts/4Gt42jX7RiaNaxCwP/more-information-about-the-dangerous-capability-evaluations#Our_Conclusions:~:text=However%2C%20the%20models,things%20for%20them.\">replicating itself autonomously</a> when instructed to do so.</p></blockquote><p>Replicating something that already exists is easy. A <i>printer</i> can \"replicate\" gpt-4. &nbsp;What you were describing is a completely autonomous upgrade to something new and superior. That is what I ascribe a ~0% chance of gpt-5 achieving. &nbsp;</p>", "parentCommentId": "CESmRNS2vWtDaotzB", "user": {"username": "titotal"}}, {"_id": "Ag9vdzNEFuw8zHeix", "postedAt": "2023-03-30T09:39:02.578Z", "postId": "PcDW7LybkR468pb7N", "htmlBody": "<p>A printer can't run GPT-4. What about GPT-6 or GPT-7?</p>\n", "parentCommentId": "S9wfsNfmCTDofEaaT", "user": {"username": "Greg_Colbourn"}}, {"_id": "Lmn3px7ketsuv4gCr", "postedAt": "2023-03-30T12:11:17.135Z", "postId": "PcDW7LybkR468pb7N", "htmlBody": "<p>I don't know whether GPT-6 or GPT-7 will be able to design the next version. I could see it being possible if \"designing the next version\" just meant cranking up the compute knob and automating the data extraction and training process. But I suspect this would lead to diminishing returns and disappointing results. I find it unlikely that any of the next few versions would make algorithmic breakthroughs, unless it's structure and training was drastically changed.&nbsp;</p>", "parentCommentId": "Ag9vdzNEFuw8zHeix", "user": {"username": "titotal"}}, {"_id": "YzHwdhSLZuouNabfi", "postedAt": "2023-03-30T14:25:23.222Z", "postId": "PcDW7LybkR468pb7N", "htmlBody": "<p>You don't expect any qualitative leaps in intelligence from orders of magnitude larger models? Even GPT-3.5-&gt;GPT-4 was a big jump (much higher grades on university-level exams). Do you think humans are close to the limit in terms of physically possible intelligence?</p>", "parentCommentId": "Lmn3px7ketsuv4gCr", "user": {"username": "Greg_Colbourn"}}, {"_id": "88QdCyxECFzpAzvjq", "postedAt": "2023-03-30T14:35:42.135Z", "postId": "PcDW7LybkR468pb7N", "htmlBody": "<p>Scott Aaronson, a prominent quantum computing professor who's spent the last year working on alignment at OpenAI, has just written a response to this FLI open letter and to <a href=\"https://time.com/6266923/ai-eliezer-yudkowsky-open-letter-not-enough/\">Yudkowsky's TIME piece</a>: \"<a href=\"https://scottaaronson.blog/?p=7174\">If AI scaling is to be shut down, let it be for a coherent reason</a>\".</p><p>I don't agree with everything Scott has written here, but I found these parts interesting:</p><blockquote><p>People might be surprised about the diversity of opinion about these issues <i>within</i> OpenAI, by how many there have discussed or even forcefully advocated slowing down.</p><p>...</p><p>Why six months? Why not six weeks or six years? [...] With the “why six months?” question, I confess that I was deeply confused, until I heard a dear friend and colleague in academic AI, one who’s long been skeptical of AI-doom scenarios, explain why <i>he</i> signed the open letter. He said: look, we all started writing research papers about the safety issues with ChatGPT; then our work became obsolete when OpenAI released GPT-4 just a few months later. So now we’re writing papers about GPT-4. Will we <i>again</i> have to throw our work away when OpenAI releases GPT-5? I realized that, while six months might not suffice to save human civilization, it’s just enough for the more immediate concern of getting papers into academic AI conferences.</p><p>...</p><p>Look: while I’ve spent <a href=\"https://scottaaronson.blog/?p=6821\">multiple</a> <a href=\"https://scottaaronson.blog/?p=6823\">posts</a> explaining how I part ways from the Orthodox Yudkowskyan position, I do find that position intellectually consistent, with conclusions that follow neatly from premises. The Orthodox, in particular, can straightforwardly answer all four of my questions above [...]</p><p>On the other hand, I'm deeply confused by the people who signed the open letter, <i>even though they continue to downplay or even ridicule GPT’s abilities, as well as the “sensationalist” predictions of an AI apocalypse.</i> I’d feel less confused if such people came out and argued explicitly: “yes, we should also have paused the rapid improvement of printing presses to avert Europe’s religious wars. Yes, we should’ve paused the scaling of radio transmitters to prevent the rise of Hitler. Yes, we should’ve paused the race for ever-faster home Internet to prevent the election of Donald Trump. And yes, we should’ve trusted our governments to manage these pauses, to foresee brand-new technologies’ likely harms and take appropriate actions to mitigate them.”</p></blockquote>", "parentCommentId": null, "user": {"username": "Will Aldred"}}, {"_id": "Js47eHFMMZfPWaTMq", "postedAt": "2023-03-30T14:56:19.587Z", "postId": "PcDW7LybkR468pb7N", "htmlBody": "<p>There is a lot of discussion in connection to the alignment problem about what human values are and which are important for human competitive --&gt; superior AGI to align with. As an evolutionary behavioral biologist I would like to offer that we are like all other animals. That is, we have one fundamental value that all the complex and diverse secondary values constitute socioecologically optimized personal or subcultural means of achieving. Power. The fundamental naturally selected drive to gain, maintain, and increase access to resources and security.</p><p>I ask, why don't we choose to create many domain-specific expert systems to solve our diverse existing scientific and X-Risk problems instead of going for AGI? I suggest, it is due to natural selection's hand that has built us to readily pursue high-risk / high-reward strategies to gain power. Throughout our evolutionary history, even if such strategies, on average, lead to short periods in which some individuals achieve great power, it can lead to enough opportunities for stellar reproductive success that, again, on average, it becomes a favored strategy, helplessly adopted, say, by AGI creators and their enablers.</p><p>We choose AGI, and we are fixated on its capacities (power), because we are semi- or non-consciously in pursuit of our own power. Name your \"alternative\" set of human values. Without fail they all translate into the pursuit of power. This includes the AGI advocate excuse that we, the good actors, must win the inevitable AGI arms race against the bad actors out there in some well-appointed axis-of-evil cave. That too is all about maintaining and gaining power.</p><p>We should cancel AGI programs for a long time, perhaps forever, and devote our efforts to developing domain-specific non-X-Risk expert-systems that will solve difficult problems instead of creating them through guaranteed, it seems to me, non-alignment.</p><p>People worry about nonconsciously building biases into AGI. An explicit, behind the scenes (facade), or nonconscious lust for power is the most dangerous and likely bias or value to be programmed in.</p><p>It would be fun to have the various powerful LLP's react to the FLI Open Letter. Just in case they are at all sentient, maybe it should be asked to share it's opinion. An astute prompter already may be able to get responses that reveal that our own desire for superpowers (there is never enough power, because reproductive fitness is a <i>relative</i> measure of success; there is never enough fitness) has \"naturally\" begun to infect them, become their nascent fundamental value.</p><p>By the way, if it has not done so already, AGI will figure out very soon that every normal human being's fundamental value is power.</p>", "parentCommentId": null, "user": {"username": "Linyphia"}}, {"_id": "oifxCvuDt45sd7h58", "postedAt": "2023-03-30T15:57:26.671Z", "postId": "PcDW7LybkR468pb7N", "htmlBody": "<p>The Forbes article “<a href=\"https://www.forbes.com/sites/mattnovak/2023/03/29/the-real-reason-elon-musk-wants-to-pause-ai-development/?sh=717939b53924\"><u>Elon Musk's AI History May Be Behind His Call To Pause Development</u></a>” discusses some interesting OpenAI history and an explanation for how this FLI open letter may have come to be.</p><p>(Note: I don’t believe this is the only explanation, or even the most likely one; if pushed I’d assign it maybe 20%, though with <i>large</i> uncertainty bars, of the counterfactual force behind the FLI letter coming into existence. Note also: I’ve signed the letter, I think it’s net positive.)</p><p>Some excerpts:</p><blockquote><p>OpenAI was founded as a nonprofit in 2015, with Elon Musk as the public face of the organization. [...] OpenAI was co-founded by Sam Altman, who butted heads with Musk in 2018 when Musk decided he wasn’t happy with OpenAI’s progress. [...] Musk worried that OpenAI was running behind Google and reportedly told Altman he wanted to take over the company to accelerate development. But Altman and the board at OpenAI rejected the idea that Musk—already the head of Tesla, The Boring Company and SpaceX—would have control of yet another company.</p><p>“Musk, in turn, walked away from the company—and reneged on a massive planned donation.&nbsp;The fallout from that conflict, culminating in the announcement of Musk’s departure on Feb 20, 2018, [...],” Semafor reported&nbsp;<a href=\"https://www.semafor.com/article/03/24/2023/the-secret-history-of-elon-musk-sam-altman-and-openai\">last week</a>.</p><p>…</p><p>When Musk left his stated reason was that AI technology being developed at Tesla created a conflict of interest. [...] And while the real reason Musk left OpenAI likely had more to do with the power struggle reported by Semafor, there’s almost certainly some truth to the fact that Tesla is working on powerful AI tech.</p><p>…</p><p>The fact that Musk is so far behind in the AI race needs to be kept in mind when you see him warn that this technology is untested. Musk has had no problem with deploying beta software in Tesla cars that essentially make everyone on the road a beta tester, whether they’ve signed up for it or not.</p><p>…</p><p>Rather than issuing a statement solely under his own name, it seems like Musk has tried to launder his concern about OpenAI through a nonprofit called the Future of Life Institute. But as Reuters points out, the Future of Life Institute is&nbsp;<a href=\"https://www.reuters.com/technology/musk-experts-urge-pause-training-ai-systems-that-can-outperform-gpt-4-2023-03-29/\">primarily funded</a> by the Musk Foundation.</p><p>Of course, there’s also legitimate concern about these AI tools. [...]</p><p>…</p><p>Musk was perfectly happy with developing artificial intelligence tools at a breakneck speed when he was funding OpenAI. But now that he’s left OpenAI and has seen it become the frontrunner in a race for the most cutting edge tech to change the world, he wants everything to pause for six months.</p></blockquote>", "parentCommentId": null, "user": {"username": "Will Aldred"}}, {"_id": "WA38kyBbuahAjkhQ7", "postedAt": "2023-03-30T15:57:48.770Z", "postId": "PcDW7LybkR468pb7N", "htmlBody": "<p>MaxRa - I might have been wrong about this; I'm not at all an expert in corporate law. Thanks for the informative link.</p><p>A more accurate claim might be 'American tech companies tend to prioritize short-term profits over long-term human survival'.&nbsp;</p>", "parentCommentId": "5ZZWTNDPECsXDeejd", "user": {"username": "geoffreymiller"}}, {"_id": "jtwehBips3zZZEXsF", "postedAt": "2023-03-30T16:21:47.183Z", "postId": "PcDW7LybkR468pb7N", "htmlBody": "<p>Not an expert either, but safest to say the  corporate-law question is nuanced and not free from doubt. It's pretty clear there's no duty to maximize <em>short-term</em> profits, though.</p>\n<p>But we can surmise that most boards that allow the corporation to seriously curtail its profits -- at least its medium-term profits -- will get replaced by shareholders soon enough. So the end result is largely the same.</p>\n", "parentCommentId": "WA38kyBbuahAjkhQ7", "user": {"username": "Jason"}}, {"_id": "b2SCXQuNuCD3CzE8t", "postedAt": "2023-03-30T16:58:58.431Z", "postId": "PcDW7LybkR468pb7N", "htmlBody": "<p>What if we fundamentally value other things but instrumentally that translates to power?</p>", "parentCommentId": "Js47eHFMMZfPWaTMq", "user": {"username": "Patricio"}}, {"_id": "ac4ve9HafqkS8gXyz", "postedAt": "2023-03-30T17:00:04.364Z", "postId": "PcDW7LybkR468pb7N", "htmlBody": "<p>Why is it considered bad timing?</p>", "parentCommentId": "5Ko4Ns4ukfiinHN8h", "user": {"username": "Patricio"}}, {"_id": "DQpWACiKzed5qLSqo", "postedAt": "2023-03-30T17:07:03.311Z", "postId": "PcDW7LybkR468pb7N", "htmlBody": "<p>Some people are worried that this will come off as \"crying wolf\".</p>", "parentCommentId": "ac4ve9HafqkS8gXyz", "user": {"username": "casebash"}}, {"_id": "Ho3WgZz2bzxzFfsA2", "postedAt": "2023-04-01T14:34:45.732Z", "postId": "PcDW7LybkR468pb7N", "htmlBody": "<ol><li>I tend to agree at a first glance, but when you take into account this counternarrative that has cropped up of \"this is just a list of <a href=\"https://www.forbes.com/sites/mattnovak/2023/03/29/the-real-reason-elon-musk-wants-to-pause-ai-development/?sh=717939b53924\">losing AI developers </a>trying to retake control\" I wonder if this will trudge on proactively or become fuel to the \"the people worried about AI safety are just selfish elitists\" &nbsp;fire that <a href=\"https://twitter.com/timnitGebru/status/1641893027492020224\">Timnit Gebru is always stoking</a>.&nbsp;</li><li>I think I just flatly agree here.</li><li>Someone from lesswrong mentioned <a href=\"https://en.wikipedia.org/wiki/Letter_of_three_hundred\">the Letter of three hundred</a> which I'd like to check out in this context.</li><li>Mmm not so sure on this. I think there's a much stronger \"x, who I really don't like, is involved in this so I won't involve myself in it\" motivation now a days. Twitter is a relevant example here, where Musk joining was enough for many to leave, even if people they still admire and were interested in engaging with were still on the platform. I like the paradigm of \"everyone has someone to like so we can all like it\" but think today we've moved more towards a \"distancing from people you don't like\" in a way that makes me wonder if the former is still possible. What do you think about that though?</li><li>Cool, will maybe sign then!</li></ol><p>Thanks for responding too! Appreciate engagement, it makes thinking about these sorts of things much more worth it.&nbsp;</p>", "parentCommentId": "Q2krAEwABj5jbjKob", "user": {"username": "tswizzle96"}}, {"_id": "tjAtYQSf35fGQiBvC", "postedAt": "2023-04-01T14:48:16.258Z", "postId": "PcDW7LybkR468pb7N", "htmlBody": "<ol>\n<li>\n<p>Yudkowsky's TIME article is a good counter to this. The blunt, no holds-barred, version of what all the fuss is about.</p>\n</li>\n<li>\n<p>:)</p>\n</li>\n<li>\n<p>Thanks for the link, and good that there is precedence.</p>\n</li>\n<li>\n<p>How many big accounts that threatened to leave Twitter actually have? I've seen a lot just continue to threaten to but keep posting. As Elon says, at least it's not boring. I hope that we're at a high point of polarisation and things will get better. Maybe the Twitter algorithm being open sourced could be a first step to this (i.e. if social media becomes less polarised, due to anger being downweighted or something, as a result).</p>\n</li>\n<li>\n<p>Great :)</p>\n</li>\n</ol>\n", "parentCommentId": "Ho3WgZz2bzxzFfsA2", "user": {"username": "Greg_Colbourn"}}, {"_id": "y9uELKR5aMWzPiCSu", "postedAt": "2023-04-11T13:51:04.700Z", "postId": "PcDW7LybkR468pb7N", "htmlBody": "<p>Yoshua Bengio, a Turing Award winner, published a <a href=\"https://yoshuabengio.org/2023/04/05/slowing-down-development-of-ai-systems-passing-the-turing-test/\">response</a> to this open letter in the last week, in which he says:</p><blockquote><p>We must take the time to better understand these systems and develop the necessary frameworks at the national and international levels to increase public protection.</p><p>...</p><p>It is because there is an unexpected acceleration – I probably would not have signed such a letter a year ago – that we need to take a step back, and that my opinion on these topics has changed.</p><p>...</p><p>We succeeded in regulating nuclear weapons on a global scale after World War II, we can reach a similar agreement for AI.</p></blockquote><p>I think it's promising – though I still think there's a long way to go – that key names in the ML community, such as Bengio, may be starting to view AI risk as a legitimate and important problem that warrants immediate attention.</p>", "parentCommentId": null, "user": {"username": "Will Aldred"}}, {"_id": "s94FYeR9KTSop5QXp", "postedAt": "2023-04-16T19:49:22.968Z", "postId": "PcDW7LybkR468pb7N", "htmlBody": "<p>Update (April 14th; 23 days after the open letter was published): <a href=\"https://www.ft.com/content/2a96995b-c799-4281-8b60-b235e84aefe4\">Musk starts new AI company called X.AI</a>.</p><blockquote><p>Elon Musk is developing plans to launch a new artificial intelligence start-up to compete with ChatGPT-maker OpenAI.</p><p>...</p><p>Musk incorporated a company named X.AI on March 9, according to Nevada business records.</p><p>...</p><p>For the new project, Musk has secured thousands of high-powered GPU processors from Nvidia.</p><p>...</p><p>Musk is recruiting engineers from top AI labs including DeepMind, according to those with knowledge of his plans.</p></blockquote>", "parentCommentId": "oifxCvuDt45sd7h58", "user": {"username": "Will Aldred"}}, {"_id": "C96btcwsGhwk2nx3u", "postedAt": "2023-04-24T11:58:03.204Z", "postId": "PcDW7LybkR468pb7N", "htmlBody": "<p>Max Tegmark went on the Lex Fridman podcast to discuss this. I haven't seen/listened to it, but would be interested in what folks who did thought.&nbsp;</p><figure class=\"media\"><div data-oembed-url=\"https://www.youtube.com/watch?v=VcVfceTsD0A\"><div><iframe src=\"https://www.youtube.com/embed/VcVfceTsD0A\" allow=\"autoplay; encrypted-media\" allowfullscreen=\"\"></iframe></div></div></figure><p>Copying from the YouTube description:&nbsp;</p><ul><li><a href=\"https://www.youtube.com/watch?v=VcVfceTsD0A&amp;t=116s\">1:56</a> - Intelligent alien civilizations&nbsp;</li><li><a href=\"https://www.youtube.com/watch?v=VcVfceTsD0A&amp;t=860s\">14:20</a> - Life 3.0 and superintelligent AI&nbsp;</li><li><a href=\"https://www.youtube.com/watch?v=VcVfceTsD0A&amp;t=1547s\">25:47</a> - Open letter to pause Giant AI Experiments&nbsp;</li><li><a href=\"https://www.youtube.com/watch?v=VcVfceTsD0A&amp;t=3054s\">50:54</a> - Maintaining control&nbsp;</li><li><a href=\"https://www.youtube.com/watch?v=VcVfceTsD0A&amp;t=4784s\">1:19:44</a> - Regulation&nbsp;</li><li><a href=\"https://www.youtube.com/watch?v=VcVfceTsD0A&amp;t=5434s\">1:30:34</a> - Job automation&nbsp;</li><li><a href=\"https://www.youtube.com/watch?v=VcVfceTsD0A&amp;t=5988s\">1:39:48</a> - Elon Musk&nbsp;</li><li><a href=\"https://www.youtube.com/watch?v=VcVfceTsD0A&amp;t=7291s\">2:01:31</a> - Open source&nbsp;</li><li><a href=\"https://www.youtube.com/watch?v=VcVfceTsD0A&amp;t=7681s\">2:08:01</a> - How AI may kill all humans&nbsp;</li><li><a href=\"https://www.youtube.com/watch?v=VcVfceTsD0A&amp;t=8312s\">2:18:32</a> - Consciousness&nbsp;</li><li><a href=\"https://www.youtube.com/watch?v=VcVfceTsD0A&amp;t=8874s\">2:27:54</a> - Nuclear winter&nbsp;</li></ul><p><a href=\"https://www.youtube.com/watch?v=VcVfceTsD0A&amp;t=9501s\">2:38:21</a> - Questions for AGI</p>", "parentCommentId": null, "user": {"username": "Lizka"}}, {"_id": "mfpLEQF8nmZXztNqR", "postedAt": "2023-05-04T08:51:35.100Z", "postId": "PcDW7LybkR468pb7N", "htmlBody": "<p>Have important \"crying wolf\" cases have happen in real life? About societal issues? I mean, yeah, it is a possibility but the alternatives seem so much worse.</p><p>How do we know when we are close enough to the precipice for other people to be able to see it and to ask to stop the race to it? General audiences lately have been talking about how surprised they are about AI so it seems like perfect timing for me.</p><p>Also, if people get used to benefit and work in narrow and safe AIs they could put themselves against stopping/ slowing them down.</p><p>Even if more people could agree on decelerate in the future it would take more time to stop/ going really slow with more stakeholders going at a higher speed. And of course, after that we would be closer to the precipice that if we started the deceleration before.</p>", "parentCommentId": "DQpWACiKzed5qLSqo", "user": {"username": "Patricio"}}]