[{"_id": "kXhPwvbo2pHhsQGXT", "postedAt": "2023-02-27T12:12:42.850Z", "postId": "PCMpaakbat7FakGNQ", "htmlBody": "<p>Thanks for writing this! This is cool to see.<br><br>I may have missed this but do you have a sense of whether this marketing push is leading to more people working on pressing problems that 80k endorses? I am curious if there is a direct correlation between money spent on marketing and people working on these problems.&nbsp;</p>", "parentCommentId": null, "user": {"username": "AryanYadav"}}, {"_id": "6tx9zeLKruaFDFKkj", "postedAt": "2023-02-27T12:21:11.952Z", "postId": "PCMpaakbat7FakGNQ", "htmlBody": "<p>I'm surprised to see how the book giveaway is more expensive than the costs of actually placing the ads to get eyes on the sites! Why did you decide to give away a physical book? What do you think the cost-effectiveness of that is compared to ebooks or not having a giveaway?</p>", "parentCommentId": null, "user": {"username": "madhav-malhotra"}}, {"_id": "qwqcfKpqpsYkMhzqJ", "postedAt": "2023-02-27T12:43:56.014Z", "postId": "PCMpaakbat7FakGNQ", "htmlBody": "<p>Glad you liked the post!</p><p>I talk a bit about this in <a href=\"https://forum.effectivealtruism.org/posts/PCMpaakbat7FakGNQ/80-000-hours-has-been-putting-much-more-resources-into#What_did_we_do_to_invest_more_in_outreach_\">this section</a> – basically, we don't know for sure how much this is causing people to work on pressing problems <i>yet &nbsp;</i>(because people changing their careers like this takes something like 2 years on average, some much longer — and we just haven't been at it that long yet!)<br><br>That said, we do have some preliminary evidence (at the very least, some \"proofs of concept\") that it's working. We also did a small-scale experiment in 2017, where we ran some social media ads and found 70 people who told us they changed their career plans 18 months later.</p>", "parentCommentId": "kXhPwvbo2pHhsQGXT", "user": {"username": "Bella_Forristal"}}, {"_id": "crJXvcf5mNp8v8kFd", "postedAt": "2023-02-27T13:00:11.400Z", "postId": "PCMpaakbat7FakGNQ", "htmlBody": "<p>Nice, thanks for your question!</p><p>One relevant thing here is that I'm not thinking about the book giveaway as just (or even primarily) an incentive to get people to view our site — I think most of the value is probably in getting people in our target audience to read the books we give out, because I think the books contain a lot of important ideas. I think I'd be potentially excited about doing this without the connection to 80k at all (though the connection to 80k/incentive to engage with us seems like an added bonus).</p><p>Re: physical books versus ebook:</p><ul><li>We do offer the ebook for the 80,000 Hours book (which is the most popular book of the three by a long way, taking up over half the orders).</li><li>[A quick edit: also, sending ebooks other than the 80,000 Hours book isn't free — it'd cost something like half to a quarter of the cost of sending a physical book]</li><li>My guess is that people are just much more likely to read a physical book than an ebook — it's cool and exciting to receive a thing in the post, rather than an infinitely replicable digital artefact. Just from personal experience, I've had a lot of organisations send me digital books I've never read, but I think it'd be much more 'special' if I got something in the mail.<ul><li>This is also a bit more than a guess — I've looked at some (old, smaller scale) data from sites where you give out codes to redeem ebooks, and the vast majority of people never redeem them.<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnref9nak07l2lzi\"><sup><a href=\"#fn9nak07l2lzi\">[1]</a></sup></span></li><li>Whereas 89% of the people we surveyed who received the book from our book giveaway reported reading <i>at least some</i> of the book (and 38% reported reading the whole thing!)<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnref6dlnapcgt69\"><sup><a href=\"#fn6dlnapcgt69\">[2]</a></sup></span></li></ul></li></ul><p>Edited cos it occured to me that maybe I didn't really answer your core question here, about cost-effectiveness —&nbsp;</p><p>I currently reckon the book giveaway is comparably cost-effective with other things we've done, but that's based on some fairly rough estimates. I didn't feel very satisfied with them, which is why we did the in-depth survey that I mentioned above. I haven't finished analysing the results yet, as I said, so I can't say anything more useful about it for now :)</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fn9nak07l2lzi\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnref9nak07l2lzi\">^</a></strong></sup></span><div class=\"footnote-content\"><p>I couldn't quickly find this data to cite my sources so I can't be more precise — so don't put too much stock in my claim here!</p></div></li><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fn6dlnapcgt69\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnref6dlnapcgt69\">^</a></strong></sup></span><div class=\"footnote-content\"><p>You should of course adjust down for sampling bias and self-report bias. I haven't finished analysing our data from this survey yet — it's hot off the press — so I don't have a view on how much to adjust down.</p></div></li></ol>", "parentCommentId": "6tx9zeLKruaFDFKkj", "user": {"username": "Bella_Forristal"}}, {"_id": "QeEmLMktPLuxBs5b7", "postedAt": "2023-02-27T16:25:09.671Z", "postId": "PCMpaakbat7FakGNQ", "htmlBody": "<p>I like that you had the balls to scale 5-20x in a year, respect.</p>", "parentCommentId": null, "user": {"username": "NunoSempere"}}, {"_id": "T8zqW3uGYAiPkGkDc", "postedAt": "2023-02-27T19:07:18.389Z", "postId": "PCMpaakbat7FakGNQ", "htmlBody": "<p>I really appreciate how thoughtful you've been about this, including sensitivity to downside risks. Do you have any plans to monitor the downside risks? A lot of them seem quite verifiable/testable.</p>\n", "parentCommentId": null, "user": {"username": "Peter_Hurford"}}, {"_id": "hveBJNTAmbfMfBbNu", "postedAt": "2023-02-27T19:18:35.470Z", "postId": "PCMpaakbat7FakGNQ", "htmlBody": "<p>Thanks for sharing. &nbsp;Do you happen to have the number of books you sent out (as you've already given the cost). &nbsp;Just wondering if my current estimate of around 30000 is close.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Darren McKee"}}, {"_id": "KiMAgaFZKEbCqiah8", "postedAt": "2023-02-27T20:49:32.875Z", "postId": "PCMpaakbat7FakGNQ", "htmlBody": "<p>Edit: I'm sorry, I made a spreadsheet error in the place where I sourced the figure for my previous answer — the real answer is 46,000!&nbsp;</p><p><s>Sure thing! Yep your estimate is really good — it's about 36,000 :)</s></p>", "parentCommentId": "hveBJNTAmbfMfBbNu", "user": {"username": "Bella_Forristal"}}, {"_id": "SppHJwwGXsqxFdYat", "postedAt": "2023-02-27T21:12:26.209Z", "postId": "PCMpaakbat7FakGNQ", "htmlBody": "<p>Thanks Peter!</p><p>Yep; in the order I mentioned them in the post:</p><p>(Note: some of these are things I've done already, some are things I have vague plans to do at some point, and some are much firmer plans. You shouldn't take this as a commitment from me to take any of these particular actions, but more a sense of the kind of stuff I've thought about here. I'd greatly appreciate suggestions you or others have about how I could do better!)</p><ul><li>Community growth rate —&nbsp;<ul><li>Staying up-to-date on the views of others in community building;&nbsp;</li><li>Learning from data on the current growth rate of EA (much of which is gathered by Rethink, so thanks!);&nbsp;</li><li>User interviews.</li></ul></li><li>Annoying people —<ul><li>This one seems the hardest to learn about because if you annoy someone and cause them to bounce off your stuff, they don't want to talk to you and give you feedback on why! Aaargh.&nbsp;</li><li>I did do one survey (with the help of the Good Impressions team) to ask people if they got annoyed by some very high-frequency ads we ran, but I don't trust the results too much (small, biased sample).&nbsp;</li><li>I ran a message testing survey last year which had a free text response for one question, so we found some evidence of things that annoyed people.</li><li>We also monitor discussion about 80k on social media (Twitter, Facebook, LinkedIn, Reddit) as well as the comments on any ads we run.</li></ul></li><li>Idea inoculation —<ul><li>For this one I think I can mostly use our usual feedback mechanisms for 80k (experts/advisors who read our drafts, our annual user survey, user interviews, some feedback forms on our site, message testing, feedback we get opportunistically via email or at EAGs, etc.)</li></ul></li><li>Demographic diversity —<ul><li>We gather info on our audience's demographics in our annual user survey, so that's the most useful source here.&nbsp;</li><li>Also the EA Survey :D</li></ul></li></ul>", "parentCommentId": "T8zqW3uGYAiPkGkDc", "user": {"username": "Bella_Forristal"}}, {"_id": "Aj5AEiubY2zDhXBQZ", "postedAt": "2023-02-27T21:13:43.618Z", "postId": "PCMpaakbat7FakGNQ", "htmlBody": "<p>Pleased to hear this:</p><blockquote><p>This year I plan to investigate ways to increase demographic diversity among the people we reach, and indeed it’s possible that our work here could really do quite a lot to move the needle in a positive direction for the community as a whole.</p></blockquote>", "parentCommentId": null, "user": {"username": "David Mears"}}, {"_id": "4eCRqTFnoix7ow7hC", "postedAt": "2023-02-27T22:09:57.898Z", "postId": "PCMpaakbat7FakGNQ", "htmlBody": "<p>Interesting that the 80k book is so popular. Is this the book that came out in late 2016, or has the content been updated? If not, it may be worth doing a second edition, since I assume that 80k's thinking has evolved significantly since publication.</p>", "parentCommentId": "crJXvcf5mNp8v8kFd", "user": {"username": "DominikPeters"}}, {"_id": "H9QHG7yzaLAqDtAjG", "postedAt": "2023-02-27T22:38:03.250Z", "postId": "PCMpaakbat7FakGNQ", "htmlBody": "<p>I just want to second Peter's comments - your discussion of downside risks was really thoughtful and cogent.&nbsp;</p><p>Of the risks you identified, I'm personally most concerned about 80k contributing to a negative feedback loop on demographic diversity (public perception of EA becomes that it is demographically homogenous -&gt; people who don't match those demographic characteristics are rightfully more skeptical of EA -&gt; recruitment efforts target demographically skewed areas because engagement in them is higher -&gt; public perception of EA as demographically homogenous solidifies -&gt; ...). I look forward to seeing what you find in your investigation of methods of improving 80k's demographic reach!</p>", "parentCommentId": "SppHJwwGXsqxFdYat", "user": {"username": "MHR"}}, {"_id": "Cdx7rKG7bAuazui6Q", "postedAt": "2023-02-27T22:58:36.873Z", "postId": "PCMpaakbat7FakGNQ", "htmlBody": "<p>Do you have plans for increasing class diversity via 80k career advice / tailoring advice to those with less resources? If so, what are some strategies you have?<br><br>I've loved 80k career advice and have benefited a ton from it. But one frustration I've had (especially earlier in my career) is that it doesn't offer much advice for people starting with less resources. For example, non-profit jobs can be out-of-reach without relevant / outstanding credentials or money to do a Masters degree if moving into policy.<br><br>I also suspect there's working-class cultural factors some need to un-learn (this was true for me). Manual labor tends to reward putting your head down and doing the hard work. But professional + managerial jobs reward creativity, relationships, and questioning systems.</p>", "parentCommentId": null, "user": {"username": "geoffreyyip"}}, {"_id": "gzg2pdizaFM4XRsyu", "postedAt": "2023-02-28T09:43:28.825Z", "postId": "PCMpaakbat7FakGNQ", "htmlBody": "<p>It's the book that came out in late 2016.</p>\n<p>Yeah, I agree a second edition could be really valuable, and this might be something we end up doing (It's definitely high up on the list! There are some complications that make it not totally obvious that we'll be able to do it soon, though).</p>\n", "parentCommentId": "4eCRqTFnoix7ow7hC", "user": {"username": "Bella_Forristal"}}, {"_id": "rWGxfS5ka4DZqeiBq", "postedAt": "2023-02-28T17:23:08.960Z", "postId": "PCMpaakbat7FakGNQ", "htmlBody": "<p>Thanks for your question &amp; feedback about our advice!</p><p>Just to clarify, my responsibility is for outreach and promotion, and that’s all this post is intended to be about. The <i>content</i> of our advice/website/podcast is written &amp; handled by others at 80k.&nbsp;</p><p>I passed along your question, and Arden from the content team asked me to share this:&nbsp;</p><blockquote><p>We think a lot of our advice can be useful for people from a variety of backgrounds, but it’s true that most of our advice is geared toward people who have or are planning to get a college degree, because we think that’s our comparative advantage. There might also be cases where we’re unintentionally alienating people from working class backgrounds by not acknowledging the specific challenges they face — thanks for raising that.&nbsp;</p></blockquote><p>If you have concrete ideas about how we could do better at these kinds of issues, we’d be really excited to hear it!</p>", "parentCommentId": "Cdx7rKG7bAuazui6Q", "user": {"username": "Bella_Forristal"}}, {"_id": "vosaZn7vyHuncouzR", "postedAt": "2023-02-28T17:55:21.187Z", "postId": "PCMpaakbat7FakGNQ", "htmlBody": "<p>I'd look forward to seeing you post the results of the in-depth survey on the forum :-)&nbsp;</p>", "parentCommentId": "crJXvcf5mNp8v8kFd", "user": {"username": "madhav-malhotra"}}, {"_id": "BaxPofjpMQgbmbrkx", "postedAt": "2023-02-28T19:04:25.629Z", "postId": "PCMpaakbat7FakGNQ", "htmlBody": "<p>epistemic status: started reading the sequences while delivering food to people on a bike.</p><p>I never really felt excluded by problem profile pages. I felt like I could access the tone they take of \"here's some broken stuff why don't you go fix it\", I just had to discount or not read any sections that talked about status, top universities, etc., kind of assumed I'd have to write my own theory of change and have a thick skin about not always being taken seriously. (and then what happened was the actually-existing EA movement contained tons of more sr people doing actual work saying \"yeah here take a crack at it\", encouraging me to accept mentorship or jobs from them. If anyone's ever assumed I'm low potential it's been the more community builder types lol)&nbsp;</p><p>Age is a more likely vector of neglectedness for 80k than class. I'd be more excited about 80k targeting the frustration people older than 25 or 35 have with 80k, that seems more useful than thinking deeply about class. Related to both of these, we also have to talk about the risk intolerant: are people with obligations and responsibilities (family members with expensive diseases, childrearing projects) low EV? This again seems like a more potent surface for 80k criticism and improvement than class stuff. (But of course, both age and obligation load have some correlations with class!)&nbsp;</p>", "parentCommentId": "rWGxfS5ka4DZqeiBq", "user": {"username": "quinn"}}, {"_id": "LFBWmrp2ApeAg5WzK", "postedAt": "2023-02-28T21:42:12.043Z", "postId": "PCMpaakbat7FakGNQ", "htmlBody": "<p>I never felt excluded either. &nbsp;And 80k does a lot of things right on this front. The messages of ambition and \"here's some broken stuff why don't you go fix it\" are good and certainly have pushed me to do things I wouldn't have done otherwise. I genuinely feel people from underprivileged backgrounds need to hear more of it and I try to promote them as much as I can.<br><br>&gt;I just had to discount or not read any sections that talked about status, top universities, etc., kind of assumed I'd have to write my own theory of change and have a thick skin about not always being taken seriously.<br><br>I think this is where our experiences diverge. I also discounted these sections... by charging straight ahead into applying for my dream jobs and thinking I had the similar chances to Ivy League graduates. But (1) college brand name does matter if comparing two people with no experience, (2) the Ivy League graduate probably had more opportunities, networks and internships than me, and (3) many of my dream jobs were magnitudes more competitive than I initially thought.<br><br>Maybe 80k advice worked too well and I flew too close to the sun? I don't know. Messaging is tricky.<br><br>&gt;I'd be more excited about 80k targeting the frustration people older than 25 or 35 have with 80k, that seems more useful than thinking deeply about class.<br><br>Agreed. To be clear, I'm not endorsing thinking deeply about class. The \"business case\" for class diversity doesn't seem great to me. But I saw \"demographic diversity\" mentioned in the original post and I was wondering if class was included in that.</p>", "parentCommentId": "BaxPofjpMQgbmbrkx", "user": {"username": "geoffreyyip"}}, {"_id": "t8MtmdGhvJrPNpJx2", "postedAt": "2023-02-28T22:09:21.878Z", "postId": "PCMpaakbat7FakGNQ", "htmlBody": "<p>Noted! Sorry for the misinterpretation.<br><br>One concrete idea could be an article centered on \"class migrants\". Perhaps it could be similar to the format of the anonymous interview series, or it could be like the<a href=\"https://80000hours.org/2022/04/imposter-syndrome/\"> imposter syndrome</a> article where there's one personal profile and a few mini-profiles attached.<br><br>Partly, this is to help people feel less alone. But also, I think the strategy for developing your career differs based on where you're starting. Even between colleges, there's variation.<br><br>Beyond that, I'm not sure. I get that 80k's target audience is different from me and messaging is hard. So I'm hesitant to recommend huge strategic changes in content.</p>", "parentCommentId": "rWGxfS5ka4DZqeiBq", "user": {"username": "geoffreyyip"}}, {"_id": "cdBfg8j8KCdB8gqTJ", "postedAt": "2023-03-01T05:19:01.895Z", "postId": "PCMpaakbat7FakGNQ", "htmlBody": "<p>I am excited to hear this. Thanks for your work.</p>", "parentCommentId": null, "user": {"username": "Peterslattery"}}, {"_id": "pB7Hqw2S7wrXy33RP", "postedAt": "2023-03-03T05:12:16.635Z", "postId": "PCMpaakbat7FakGNQ", "htmlBody": "<blockquote><p>The empirical reason is that being a newsletter subscriber correlates with having spent about twice the recorded time on our website, compared to non-subscribers.</p></blockquote><p>I feel like the causality could be \"people spend a lot of time on the website\" --&gt; \"people subscribe to the newsletter\" rather than the other way?&nbsp;</p><p>And how does 80k record people's time spent on the website?</p>", "parentCommentId": null, "user": {"username": "jakubkraus07@gmail.com"}}, {"_id": "pR2HMz3bRzuBo2Dzn", "postedAt": "2023-03-03T10:45:25.457Z", "postId": "PCMpaakbat7FakGNQ", "htmlBody": "<p>I totally agree the causality could go that way.</p>\n<p>In fact, I think it'd be really weird if there wasn't at least some effect in that direction, because people have to go on our website at some point in order to sign up to the newsletter!</p>\n<p>I do think there is a significant effect in the direction 'people subscribe to the newsletter -&gt; people spend time on the website,' though.</p>\n<p>Why? Mostly cos of the big spikes in engagement we see on pages that we link to from the newsletter — it just does look like people click on and then sometimes read stuff on our site, if we put it in the newsletter.</p>\n<p>As for how we record people's time spent on the website: we use the web analytics tools Google Analytics and Mixpanel. There are various caveats and systematic measurement errors that apply to both of them that we try to account for in our reporting on web engagement statistics.</p>\n", "parentCommentId": "pB7Hqw2S7wrXy33RP", "user": {"username": "Bella_Forristal"}}, {"_id": "GPH5HeuEaH8ukA2cX", "postedAt": "2023-03-11T18:34:00.001Z", "postId": "PCMpaakbat7FakGNQ", "htmlBody": "<p>Any opinions about using this as a baseline to compare other EA outreach efforts?</p><p>I tend to be in favor, since this seems to be working, kind of tested, scalable, potentially high upside given some tweaks, and so on. I feel more reluctant to do my own outreach after reading this (but I'm saying this in a good way - as a compliment to you)</p>", "parentCommentId": null, "user": {"username": "hibukki"}}, {"_id": "tD85MJnkbZtGeAH7q", "postedAt": "2023-03-11T18:39:47.242Z", "postId": "PCMpaakbat7FakGNQ", "htmlBody": "<p>I'd like to hear more about why you think this causes people to take high impact jobs (what you're measuring, what you're observing) (or more cliche, \"what do you think you know and why do you think you know it?\").</p><p>I'm asking this in the spirit of \"trust but verify\": I do assume you did a good job here, and at the same time this seems to me like the main place a project like this might break, so it seems healthy to ask.</p><p>&nbsp;</p><p>For reference of others, here's what was said in the post:</p><blockquote><ul><li>We have various ways of measuring the inclinations of our new audience members, and almost all of them suggest that they are indeed significantly less inclined towards our advice, on average, than control groups of people that didn’t find us through our active outreach efforts.</li><li>However, so long as we are still getting a good proportion of high-inclination traffic too (which it looks like we are), these efforts probably still look worth it.&nbsp;</li><li>Our internal calculations of the value of this work take into account this expected decrease in inclination (and we think it looks good overall).</li><li>All that said, the inclination of the new users we get from our outreach is a top priority, which we will continue to monitor.</li></ul></blockquote><p>&nbsp;</p><p>Still, as I said <a href=\"https://forum.effectivealtruism.org/posts/PCMpaakbat7FakGNQ/80-000-hours-has-been-putting-much-more-resources-into?commentId=GPH5HeuEaH8ukA2cX\">elsewhere</a>, seems really promising</p>", "parentCommentId": null, "user": {"username": "hibukki"}}, {"_id": "nanYh8h8Qxs5GLnNh", "postedAt": "2023-03-13T14:45:39.382Z", "postId": "PCMpaakbat7FakGNQ", "htmlBody": "<p>I'm not sure I understand what you mean by 'using this as a baseline to compare other EA outreach efforts'? Is there some specific outcome metric you'd want to use as a baseline?</p>\n<p>In general, I think what works best in outreach can be pretty context-specific, and I wouldn't recommend everything I've done to people with different goals &amp; constraints.</p>\n<p>Being more reluctant to do your own outreach after learning about this makes sense if you think there’s some optimal growth rate in EA which we are at or nearly at. If you learn that I’m doing lots of outreach, then it decreases the value of additional outreach (unless we are not yet at or near the optimal rate of growth).</p>\n", "parentCommentId": "GPH5HeuEaH8ukA2cX", "user": {"username": "Bella_Forristal"}}, {"_id": "nzmHsFZjSPDv3P63i", "postedAt": "2023-03-13T16:20:07.879Z", "postId": "PCMpaakbat7FakGNQ", "htmlBody": "<p>As one example, I have a tiny project where I publicly measure the effectiveness of Israeli startups (in a Facebook group where people can comment and ask questions), and a big part of my goal is to explain the Israeli tech ecosystem how one even measures impact, and that not all med-tech startups are equal.</p><p>I might try to estimate how much it would \"cost\" me to get one person to a high impact job, and if that \"cost\" is way more than what you're doing with the 80k outreach, I should maybe just dump the project. Or in other words, for my project to be worth while, it must be at least POTENTIALLY more cost effective than the 80k outreach. Similar to how if I'd want to run an intervention for global health and wellbeing, I'd want it to at least POTENTIALLY be better than AMF. (in both these examples, 80k and AMF are also tested and scalable, which are two advantages that new projects might not always have)</p><p>(Did this make more sense?)</p>", "parentCommentId": "nanYh8h8Qxs5GLnNh", "user": {"username": "hibukki"}}, {"_id": "HFZ2kpz7xeyrbrkJc", "postedAt": "2023-03-13T16:44:22.541Z", "postId": "PCMpaakbat7FakGNQ", "htmlBody": "<p>This makes sense to me, but I don't think I provided anything in this post which you could easily use to compare to your project here.</p>\n<p>How would you go about guessing whether the cost of what you were doing was higher or lower than that of 80k's outreach?</p>\n", "parentCommentId": "nzmHsFZjSPDv3P63i", "user": {"username": "Bella_Forristal"}}, {"_id": "2tsQ8tsuzArqjAXgX", "postedAt": "2023-03-13T17:12:28.749Z", "postId": "PCMpaakbat7FakGNQ", "htmlBody": "<p>Hey Yonatan —I think the more relevant part of my post is the following, which hopefully answers your question? Let me know if it doesn't.&nbsp;</p><p>There are some details I can't give because (as I said in the post) I don't have permission from the relevant people to talk about it publicly.</p><blockquote><p>We can’t be sure how many additional people will change to a high-impact career as a result, in large part because&nbsp;<a href=\"https://80000hours.org/about/credibility/evaluations/\"><u>we have found that</u></a> “career plan changes” of this kind take, on average, about 2 years from first hearing about 80k.&nbsp;</p><p>Still, our current best guess is that these efforts will have been pretty effective at helping people switch careers to more impactful areas.</p><p>Partly this guess is based on the growth in new audience members that we’ve seen (plus 80k’s solid track record of getting new people to eventually switch to more impactful careers), and partly it’s based on a few “proof of concept” switches we’ve seen already.&nbsp;</p><p>For example, some small-scale social media ads which 80k ran in 2017 as an experiment led to at least one person switching to a career we’re especially excited about (and 70 people who reported changing their career plans due to 80k).<a href=\"https://forum.effectivealtruism.org/posts/PCMpaakbat7FakGNQ/80-000-hours-has-been-putting-much-more-resources-into#fnq2j0mledac\"><sup>[3]</sup></a>&nbsp;We’ve also already encountered<a href=\"https://forum.effectivealtruism.org/posts/PCMpaakbat7FakGNQ/80-000-hours-has-been-putting-much-more-resources-into#fn179bcaznkaw\"><sup>[4]</sup></a>&nbsp;several people who found us via our marketing who seem likely to switch to a more impactful career.<a href=\"https://forum.effectivealtruism.org/posts/PCMpaakbat7FakGNQ/80-000-hours-has-been-putting-much-more-resources-into#fnnuoajfgmf1j\"><sup>[5]</sup></a></p></blockquote>", "parentCommentId": "tD85MJnkbZtGeAH7q", "user": {"username": "Bella_Forristal"}}]