[{"_id": "S2oieorCKnvYJ4t2j", "postedAt": "2017-05-10T00:32:01.024Z", "postId": "PCQ4i5EK7vZ8pR2tF", "htmlBody": "<p>Thanks for linking my Murphyjitsu write-up!</p>\n<p>Slight correction to TAP's: They're typically referred to as &quot;Trigger Action Plans&quot; (and not 'potentials').</p>\n", "parentCommentId": null, "user": {"username": "lifelonglearner"}}, {"_id": "XgjKtuBCbhYYew4L8", "postedAt": "2017-05-10T09:08:55.430Z", "postId": "PCQ4i5EK7vZ8pR2tF", "htmlBody": "<p>Thanks for making the effort of writing it up, very much appreciated.</p>\n<p>Corrected TAPs, interesting mix-up, thanks for pointing it out!</p>\n", "parentCommentId": "S2oieorCKnvYJ4t2j", "user": {"username": "konrad"}}, {"_id": "vZhbLDwxH2bkmT4Wg", "postedAt": "2017-05-10T23:30:40.741Z", "postId": "PCQ4i5EK7vZ8pR2tF", "htmlBody": "<blockquote>\n<p>Everyone is warm (±37°C, ideally), open-minded, reasonable and curious.</p>\n</blockquote>\n<p>You sir, will be thoroughly quoted and requoted on this gem, lol. I commend this heartfelt post.</p>\n", "parentCommentId": null, "user": {"username": "Cornelius"}}, {"_id": "JspbueLjMxPQfiuLp", "postedAt": "2017-05-11T00:02:49.284Z", "postId": "PCQ4i5EK7vZ8pR2tF", "htmlBody": "<blockquote>\n<p>One, last thing that was emphasised multiple times, was the value of asking. Most of us still don’t do it enough. If one doesn’t understand something, if we don’t know where to start, if we want people to support us - there’s one simple trick: just ask. We tend to feel like there is some social cost to asking but simply asking can provide extremely valuable support and only has downsides if we do it too often. So far, most of us don’t do it enough.</p>\n</blockquote>\n<p>Great point! Relatedly, for next EAG I want to have a small set of questions to ask people (last time it was &quot;What do you think of insect suffering?&quot;). I would highly recommend others come in with thought-provoking questions they want answered. Brainstorming:</p>\n<ol>\n<li>What is one trait/idea/action/ you wished the EA community had/understood/took? (or insert &quot;people&quot; for &quot;EA community)</li>\n<li>What is one book you would recommend and why?</li>\n<li><em>Takes out $5</em> Where should I donate this?</li>\n<li>What do you need help with in your life?</li>\n<li>What are you most uncertain about?</li>\n<li>What would make you change your cause prioritization?</li>\n<li>Who do you most look up to?</li>\n</ol>\n<p>Warning: At EAG Berkeley at least, not <em>everyone</em> you meet will be able to answer all of these questions because they're newer to the movement - adapt accordingly.</p>\n<p>Perhaps print off some business cards (even crude, informal ones), with whatever information you wish to impart to people - contact or otherwise.</p>\n<p>Try to do a summary of the day before you go to sleep (or just the trip). I made a post on Facebook and tagged some of the people I met (you will have to friend them first for the tag).</p>\n<p>Any other ideas? :-)</p>\n", "parentCommentId": null, "user": {"username": "DonyChristie"}}, {"_id": "nXzNEwfiq9rbApB5F", "postedAt": "2017-05-17T07:00:50.385Z", "postId": "PCQ4i5EK7vZ8pR2tF", "htmlBody": "<p>Love your writing style!</p>\n", "parentCommentId": null, "user": {"username": "Telofy"}}]