[{"_id": "LdMzJqLvoLftMGxoT", "postedAt": "2023-12-19T23:16:39.958Z", "postId": "PdGZti3Aqd9ZD8jxt", "htmlBody": "<p>What is the case for new initiatives as opposed to expanding GWWC / OftW's operations to more countries? Or regional offices for these orgs?</p>", "parentCommentId": null, "user": {"username": "freedomandutility"}}, {"_id": "xWDrLh6EoCbifSHbm", "postedAt": "2023-12-20T20:52:19.340Z", "postId": "PdGZti3Aqd9ZD8jxt", "htmlBody": "<p>Love this initiative! I think the potential can be even greater, based on my experience of being Irish and long periods living in Italy and Belgium (and yes, I applied - but I'd also be happy to help out if someone else starts this kind of initiative).&nbsp;<br><br>Ireland and Italy both have very strong attitudes towards charitable donations and doing good, including donating for causes that are not local. It's no coincidence that Bono and Bob Geldof are Irish - whatever your opinion of them personally might be, the attitude they represent, that world problems like poverty and famine are our responsibility to solve is a very Irish one.&nbsp;<br><br>I would contrast this with the US, where people are also very generous (in my experience), but where it feels like most people prefer to donate to US-based charities or at least US-run charities, which often commit to using US-sourced materials and so on.&nbsp;<br><br>(obviously all these comments are gross generalisations based on limited and subjective data, although I think Ireland has repeatedly topped lists of charitable donations per capita).&nbsp;<br><br>&nbsp;</p>", "parentCommentId": null, "user": {"username": "Denis "}}, {"_id": "GFJqptwzHQ9TwGfrE", "postedAt": "2023-12-21T12:32:44.673Z", "postId": "PdGZti3Aqd9ZD8jxt", "htmlBody": "<p>Hey Denis! Really glad to hear you've applied - please also let people in your networks know about the program :) &nbsp;</p>", "parentCommentId": "xWDrLh6EoCbifSHbm", "user": {"username": "Luke Moore"}}, {"_id": "WiiFmLCwbfRJcEZbg", "postedAt": "2023-12-21T12:51:58.447Z", "postId": "PdGZti3Aqd9ZD8jxt", "htmlBody": "<p>Great question.</p><p>We think that both strategies have merits, however we also think that there is less to the distinction than meets the eye. Different locations have quite different audiences and so getting new projects started which can target them seems valuable. But, to expand into new legal justifications (and get tax deductible status) it's important to start a new legal entity so starting a new initiative in many of these new countries will need to happen anyway.</p><p>I also think that the expanding existing orgs vs starting new initiatives division is more of a spectrum. As mentioned in Appendix B, we think that it's possible that in some of these countries the new initiatives won't have to be completely independent. In many cases they can make use of tech infrastructure and branding from existing orgs like GWWC or Effektiv Spenden to cut down the set up work that they'd otherwise need to do.</p><p>Ultimately it will be for the cofounders of these new initiatives to decide how much they want to make use of the existing brands and/or tech infrastructures that have already been developed - and we will go into more detail on the pros and cons of adopting these existing resources during the program so that cofounders can make whatever choice that gives their initiative the best chance of success.</p><p>Having said all of that, many existing orgs are hiring country managers, e.g. we didn't include Austria as one of our target countries because Effektiv Spenden are likely to expand into that market. However, although GWWC, and other orgs, are expanding, we can only grow so fast and hire so many people in a year. As a result, getting new, more independent, projects started will accelerate the rate that we're able to bring effective giving to new markets.</p>", "parentCommentId": "LdMzJqLvoLftMGxoT", "user": {"username": "Luke Moore"}}]