[{"_id": "YwRaaQ4jBxeLs82a3", "postedAt": "2023-06-06T20:53:42.465Z", "postId": "Pfayu5Bf2apKreueD", "htmlBody": "<blockquote><p>A single really convincing demonstration of something like deceptive alignment could make a big difference to the case for standards and monitoring (next section).</p></blockquote><p>This struck me as a particularly good example of a small improvement having a meaningful impact. On a personal note, seeing the example of deceptive alignment you wrote would make me immediately move to the hit-the-emergency-brakes/burn-it-all-down camp. I imagine that many would react in a similar way, which might place a lot of pressure on AI labs to collectively start implementing some strict (not just for show) standards.&nbsp;</p>", "parentCommentId": null, "user": {"username": "blueberry"}}, {"_id": "deZvLm8Qm2sKowXP3", "postedAt": "2023-06-07T07:14:48.858Z", "postId": "Pfayu5Bf2apKreueD", "htmlBody": "<p><i>Conflict of interest disclosure: my wife is co-founder and President of </i><a href=\"https://www.anthropic.com/\"><i>Anthropic</i></a><i>. Please don’t assume things about my takes on specific AI labs due to this.</i><a href=\"https://forum.effectivealtruism.org/posts/Pfayu5Bf2apKreueD/a-playbook-for-ai-risk-reduction-focused-on-misaligned-ai#fn10\"><sup>10</sup></a></p><p><br>This is really amazing. How much of Anthropic does Daniela own? How much does your brother in law own? If my family was in line to become billionaires many times over due to a certain AI lab becoming successful, this would certainly affect my takes.</p>", "parentCommentId": null, "user": {"username": "Sol3:2"}}, {"_id": "ZkmdnxkarPH2D3XQ6", "postedAt": "2023-06-07T11:23:45.773Z", "postId": "Pfayu5Bf2apKreueD", "htmlBody": "<p>Disclosing a conflict of interest demonstrates explicit awareness of potential bias. It's often done to make sure the reader tries to weigh the merits of the content <i>by itself</i>. Your comment shows me that you have (perhaps) not done so, by ignoring the points the author argued. If you see any evidence of bias in the takes in the article/post, can you be more specific? That way, the author is given an honest chance to defend his viewpoint.</p>", "parentCommentId": "deZvLm8Qm2sKowXP3", "user": {"username": "blueberry"}}, {"_id": "MecaBb6Fe4HPc7a7N", "postedAt": "2023-06-07T11:27:17.869Z", "postId": "Pfayu5Bf2apKreueD", "htmlBody": "<p>Why is this getting downvoted? This comment seems plainly helpful; it's an important thing to highlight.</p>", "parentCommentId": "deZvLm8Qm2sKowXP3", "user": {"username": "finnhambly"}}, {"_id": "JaoEBifcwNGa4uCg7", "postedAt": "2023-06-07T11:30:44.753Z", "postId": "Pfayu5Bf2apKreueD", "htmlBody": "<p>I don't think this disclosure shows <i>that</i> much awareness, as the notes seem to dismiss it as a problem, unless I'm misunderstanding what Holden means by \"don’t assume things about my takes on specific AI labs due to this\". It sounds like he's claiming he's able to assess these things neutrally, which is quite a big claim!</p>", "parentCommentId": "ZkmdnxkarPH2D3XQ6", "user": {"username": "finnhambly"}}, {"_id": "pYWnAiF23CPxq3Lx5", "postedAt": "2023-06-07T11:37:40.800Z", "postId": "Pfayu5Bf2apKreueD", "htmlBody": "<p>But he did not, in fact, disclose the conflict of interest. \"My wife is President of Anthropic\" means nothing in and of itself without some good idea of what stake she actually owns.&nbsp;</p>", "parentCommentId": "ZkmdnxkarPH2D3XQ6", "user": {"username": "Sol3:2"}}, {"_id": "LwQnHDwobqPi2Mk24", "postedAt": "2023-06-09T11:31:33.712Z", "postId": "Pfayu5Bf2apKreueD", "htmlBody": "<p>Thanks for sharing this! I think it's great you made this public.</p>", "parentCommentId": null, "user": {"username": "MJusten"}}, {"_id": "tnbA95n4XuhkbcXHt", "postedAt": "2023-06-10T06:16:04.526Z", "postId": "Pfayu5Bf2apKreueD", "htmlBody": "<p>Sorry, I didn't mean to dismiss the importance of the conflict of interest or say it isn't affecting my views.</p>\n<p>I've sometimes seen people reason along the lines of \"Since Holden is married to Daniela, this must mean he agrees with Anthropic on specific issue X,\" or \"Since Holden is married to Daniela, this must mean that he endorses taking a job at Anthropic in specific case Y.\" I think this kind of reasoning is unreliable and has been incorrect in more than one specific case. That's what I intended to push back against.</p>\n", "parentCommentId": "JaoEBifcwNGa4uCg7", "user": {"username": "HoldenKarnofsky"}}, {"_id": "uNqtAgBqwoqXmBChN", "postedAt": "2023-06-10T06:21:53.719Z", "postId": "Pfayu5Bf2apKreueD", "htmlBody": "<p>I expected readers to assume that my wife owned significant equity in Anthropic; I've now edited the post to state this explicitly (and also added a mention of her OpenAI equity, which I should've included before and have included <a href=\"https://www.cold-takes.com/jobs-that-can-help-with-the-most-important-century/#fn2\">in the past</a>). I don't plan to disclose the exact amount and don't think this is needed for readers to have sufficient context on my statements here.</p>\n", "parentCommentId": "pYWnAiF23CPxq3Lx5", "user": {"username": "HoldenKarnofsky"}}, {"_id": "7cHvfzMLw2Jua9JPh", "postedAt": "2023-06-15T01:21:19.684Z", "postId": "Pfayu5Bf2apKreueD", "htmlBody": "<p>Hi Sol3:2. This comment raises an issue that appears to have struck a chord with many readers. However, we believe that it is unnecessarily sarcastic and breaks Forum norms. This is a warning, please do better in the future.</p>", "parentCommentId": "deZvLm8Qm2sKowXP3", "user": {"username": "jpaddison"}}, {"_id": "stu3oFFWopZKe9JQa", "postedAt": "2023-06-15T09:04:32.052Z", "postId": "Pfayu5Bf2apKreueD", "htmlBody": "<p>You must be joking. What on earth was sarcastic?</p><p>Let's go line by line.&nbsp;</p><p>\"This is really amazing\" (I was amazed).<br><br>\"How much of Anthropic does Daniela own? How much does your brother in law own?\" (both entirely sincere and legitimate questions - this is very material nonpublic knowledge)<br><br>\"If my family was in line to become billionaires many times over due to a certain AI lab becoming successful, this would certainly affect my takes.\" (this is literally true - I know myself quite well and am very confident that my reasoning would be incredibly motivated if I personally had billions, perhaps tens of billions on the line)</p>", "parentCommentId": "7cHvfzMLw2Jua9JPh", "user": {"username": "Sol3:2"}}, {"_id": "ZtqYD5NnszsDo9rnb", "postedAt": "2023-06-15T09:10:22.583Z", "postId": "Pfayu5Bf2apKreueD", "htmlBody": "<p>I very strongly disagree. There's a huge difference between $1 billion (Jaan Tallinn money) and many tens of billions (Dustin Moskowitz money or even Elon money). You know this better than anyone. Jaan is a smart guy and can spend his money carefully and well to achieve some cool things, but Dustin can quite literally single-handedly bankroll an entire elite movement across multiple countries. Money is power even if - especially if! - you plan to give it away. The exact amount that Dario and Daniela - and of course you by association - might wind up with here is extremely relevant. If it's just a billion or two even if Anthropic does very well, fair enough, I wouldn't expect that to influence your judgment much at all given that you already exercise substantial control over the dispersion of sums many times in excess of that. If it's tens of billions, this is a very different story and we might reasonable assume that this would in fact colour your opinions concerning Anthropic. Scale matters!</p>", "parentCommentId": "uNqtAgBqwoqXmBChN", "user": {"username": "Sol3:2"}}, {"_id": "rnEfZE6c3Ei6KTz27", "postedAt": "2023-06-15T15:08:55.263Z", "postId": "Pfayu5Bf2apKreueD", "htmlBody": "<p>I think you may have a model where you don't want to have comments above a given level of rudeness/sarcasm/impoliteness/political incorrectness, etc. However, I would prefer that you had a model where you give a warning or a ban if a comment or a user exceeds some rudeness - value threshold, as I think that would provide more value: I would want to have the rude comments if they produce enough value to be worth it.&nbsp;</p><p>And I think that you do want to have the disagreeable people push back, to discourage fake group consensus.</p>", "parentCommentId": "7cHvfzMLw2Jua9JPh", "user": {"username": "NunoSempere"}}, {"_id": "vkzFtXo4auYMnNHuM", "postedAt": "2023-06-15T15:56:27.740Z", "postId": "Pfayu5Bf2apKreueD", "htmlBody": "<p>I really don't even think my comment was rude. Absolutely massive \"<a href=\"https://youtu.be/2lDUSoR8ZK8?t=66\">not allowed to tackle Carter in this game\"</a> energy on the EA forum tbqh</p>", "parentCommentId": "rnEfZE6c3Ei6KTz27", "user": {"username": "Sol3:2"}}, {"_id": "5ZDfxDhjZrvKpbits", "postedAt": "2023-06-15T16:15:36.446Z", "postId": "Pfayu5Bf2apKreueD", "htmlBody": "<p>I mean, I think it exceeds some level of rudeness in that you consider the hypothesis that Karnofsky might not be an impeccable boy scout, which some people might consider to be rude. But I also think that it's fine to exceed that threshold, so ¯\\_(ツ)_/¯</p>", "parentCommentId": "vkzFtXo4auYMnNHuM", "user": {"username": "NunoSempere"}}, {"_id": "FiQr6w2AnbvT3w8kW", "postedAt": "2024-03-16T12:05:51.421Z", "postId": "Pfayu5Bf2apKreueD", "htmlBody": "<blockquote><p>It's often done to make sure the reader tries to weigh the merits of the content <i>by itself</i>.</p></blockquote><p>My understanding is that it's usually meant to serve the opposite purpose: to alert readers to the possibility of bias so they can evaluate the content with that in mind and decide for themselves whether they think bias has creeped in. The alternative is people being alerted to the CoI in the comments and being angry the quite relevant information being kept from them, <i>not</i> that they would otherwise still know about the bias and not be able to evaluate the article well because of it.</p>", "parentCommentId": "ZkmdnxkarPH2D3XQ6", "user": {"username": "bec_hawk"}}, {"_id": "jPkgDtyPc74vwEvwm", "postedAt": "2024-03-16T12:08:51.850Z", "postId": "Pfayu5Bf2apKreueD", "htmlBody": "<p>I think the assumption is that most people already knew about the facts disclosed</p>", "parentCommentId": "stu3oFFWopZKe9JQa", "user": {"username": "bec_hawk"}}]