[{"_id": "RAtfrqx6p9GLo9ZNF", "postedAt": "2024-03-04T19:56:55.187Z", "postId": "PFD8MJBEmpZLe54x9", "htmlBody": "<p>As I understand it, [part of] Anthropic's theory of change is to be a meaningful industry player so its safety agenda can become a potential standard to voluntarily emulate or adopt in policy. Being a meaningful industry player in 2024 means having desirable consumer products and advertising them as such.&nbsp;</p><p>It's also worth remembering that this <i>is</i> advertising. Claiming to be a little bit better on some cherry picked metrics a year after GPT-4 was released is hardly a major accelerant in the overall AI race.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Mjreard"}}, {"_id": "MQBYiSeDTjsrsvabH", "postedAt": "2024-03-04T20:18:03.637Z", "postId": "PFD8MJBEmpZLe54x9", "htmlBody": "<p>Yes, I think this is a reasonable response. However, it seems to rest on the assumption that just trying a bit harder at safety makes a meaningful difference. If Alignment is very hard then Anthropic's AIs are just as likely to kill everyone as other labs'. It seems very unclear whether having \"safety conscious\" people at the helm will make any difference to our chance of survival, especially when they are almost always forced to make the exact same decisions as people who are not safety conscious in order to stay at the helm.</p><p>Even if they are right that it is important to stay in the race, what Anthropic should be doing is</p><ul><li>Calling for governments to enforce a worldwide Pause such that they can stop racing towards Superintelligence without worry about other labs getting ahead.</li><li>Trying to agree with other labs to decelerate race dynamics.</li><li>Warning politicians and the public that automation of all office jobs may be just around the corner.</li><li>Setting out their views as to how politics works in a world with superintelligence.</li><li>Declaring in advance what would compel them to consider AIs as moral patients.</li></ul><p>All of which they could do while continuing to compete in the race. RSPs are nice, but not sufficient.</p>", "parentCommentId": "RAtfrqx6p9GLo9ZNF", "user": {"username": "Joseph Miller"}}, {"_id": "6KB3W4sn2D5vHu3Dd", "postedAt": "2024-03-04T20:21:05.493Z", "postId": "PFD8MJBEmpZLe54x9", "htmlBody": "<blockquote><p>It's also worth remembering that this <i>is</i> advertising. Claiming to be a little bit better on some cherry picked metrics a year after GPT-4 was released is hardly a major accelerant in the overall AI race.</p></blockquote><p>Fair point. On the other hand, the perception is in many ways more important than the actual capability in terms of incentivizing competitors to race faster.</p><p>Also based on early user reports it seems to actually be noticably better than GPT-4.</p>", "parentCommentId": "RAtfrqx6p9GLo9ZNF", "user": {"username": "Joseph Miller"}}, {"_id": "ux25AkxJkuohFLMi4", "postedAt": "2024-03-04T21:21:21.799Z", "postId": "PFD8MJBEmpZLe54x9", "htmlBody": "<p>I think this characterizes the disagreement between pause advocates and Anthropic as it stood before the Claude 3 release with some pause-advocacy-favorable assumptions about the politics of maintaining one's position in the industry. Full-throated, public pause advocacy doesn't seem like a good way to induce investment in your company, for example.&nbsp;</p><p>More broadly I think Anthropic, like many, hasn't come to final views on these topics and is working on developing views, probably with more information and talent than most alternatives by virtue of being a well-funded company. &nbsp;</p>", "parentCommentId": "MQBYiSeDTjsrsvabH", "user": {"username": "Mjreard"}}, {"_id": "3nTcFoZfrCozezkuL", "postedAt": "2024-03-04T22:22:49.471Z", "postId": "PFD8MJBEmpZLe54x9", "htmlBody": "<blockquote>\n<p>More broadly I think Anthropic, like many, hasn’t come to final views on these topics and is working on developing views, probably with more information and talent than most alternatives by virtue of being a well-funded company.</p>\n</blockquote>\n<p>It would be remiss to not also mention the large conflict of interest analysts at Anthropic have when developing these views.</p>\n", "parentCommentId": "ux25AkxJkuohFLMi4", "user": {"username": "D0TheMath"}}]