[{"_id": "YjZJvyeTLjjhY6tim", "postedAt": "2022-10-21T08:35:03.814Z", "postId": "PFFGfCYZmerznPjJL", "htmlBody": "<p>Definitely agree with this! I will also add that the standard Forum style is not only a barrier to non-EA readers - it can also be a barrier to writers, since people feel like they have to write in that style to be taken seriously on the Forum.&nbsp;<br><br>I will say that writing readable posts is <i>hard </i>and time-consuming,<i> </i>and a lot of people who post on the Forum are either not writers by specialism (they're e.g. researchers or other professionals who are just trying to get their ideas out there), or are very pressed for time. So I do kind of understand why this situation exists.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Amber"}}, {"_id": "RH3dkPGA7NmbgWN47", "postedAt": "2022-10-21T16:22:32.489Z", "postId": "PFFGfCYZmerznPjJL", "htmlBody": "<blockquote><p>Why is it not as inclusive as such a platform could be?</p></blockquote><p>Both exclusivity and inclusivity have advantages. In recent times, there are plenty of complaints that the quality of the EA forum went down.&nbsp;</p><p>When writing it's important to decide who you want to reach. The first decision you should make when writing a post is whether you would want to reach as many people as possible or whether you want to reach a more narrow audience.&nbsp;</p><p>When writing publically about topics that can easily be picked up out of context by the media, jargon can be protective. If you write about wild animal suffering maybe you don't want everyone to read your post and that's okay.&nbsp;</p>", "parentCommentId": null, "user": {"username": "ChristianKleineidam"}}, {"_id": "g7aWuTFZKWmmrJSj7", "postedAt": "2022-10-21T22:07:13.691Z", "postId": "PFFGfCYZmerznPjJL", "htmlBody": "<p>100% agree. Each author gives each post its own intended audience (broad, narrow, niche, etc). And sometimes it's important to make a deliberate choice to only want a select audience to read your post.</p>\n<p>Also I've never heard of jargon as a tool for protection. Very interesting.</p>\n<p>The curious thing to me is that the EA Forum is entirely public online, so in theory everyone <em>can</em> read your post, even if you don't want them to. So it seems if you have some need to protect either yourself or the post, then you'll need some other strategies. For example, you could write anonymously so that your identity can't be traced.</p>\n<p>But I really hope the vast majority of posts don't require any kind of \"protective\" measures.</p>\n", "parentCommentId": "RH3dkPGA7NmbgWN47", "user": {"username": "davidhartsough"}}, {"_id": "AqtqPw4KQXrNhvn36", "postedAt": "2022-10-22T14:34:35.630Z", "postId": "PFFGfCYZmerznPjJL", "htmlBody": "<p>I don't like the idea of using jargon to protect oneself. I worry that this protects the author not only from unfair 'out of context' critique, but also from critiques from <i>anyone</i> who can't already understand the jargon (or isn't able to invest the time in deciphering it). Why should you want such critiques? Because people who already know the niche jargon of your field are more likely to agree with you, or at least to agree with you on the big picture.&nbsp;</p>", "parentCommentId": "RH3dkPGA7NmbgWN47", "user": {"username": "Amber"}}, {"_id": "j8fFG5uoPi2QcxxDu", "postedAt": "2022-10-27T10:39:49.116Z", "postId": "PFFGfCYZmerznPjJL", "htmlBody": "<p>If you want to personally protect yourself, then writing anonymously is a way to go. If you care about protecting EA's PR it helps little.&nbsp;</p><blockquote><p>But I really hope the vast majority of posts don't require any kind of \"protective\" measures.</p></blockquote><p>Practically, that results in people not publically sharing certain information. I personally would like most of what people are willing to say privately at an event like an EA meetup they would also be willing to publically say on the EA forum.&nbsp;</p>", "parentCommentId": "g7aWuTFZKWmmrJSj7", "user": {"username": "ChristianKleineidam"}}, {"_id": "N6EKX4w7KDFqHqixw", "postedAt": "2022-10-27T10:55:10.967Z", "postId": "PFFGfCYZmerznPjJL", "htmlBody": "<p>If you are criticizing an EA organization because they did something wrong, a journalist who writes the next \"EA is bad\" article might quote you. They might add something to the critique, but it's likely not what you want.&nbsp;</p><p>Because people fear saying things that are bad for EA's PR they are engaging in less public criticism of the actions of EA organizations.</p><p>If you are talking about a topic that touches partisan politics but wants to discuss it from an EA perspective, you don't want your post to turn into a magnet for partisan political discussion. If there would be a lot of partisan political discussion that would be bad for the EA forum.&nbsp;</p><p>Criminal Justice Reform, Immigration Policy, Land Use Reform, and Macroeconomic Stabilization Policy are at the moment cause areas for OpenPhil. I see relatively little discussion on the EA forum about how those cause areas. I would expect that one of the major reasons for this is that people fear that those discussions would be too partisan politic.&nbsp;</p><p>I think it would be good if there would be more EA exchange over those cause areas given that EA money if flowing into them. At the same time I believe it's good to have those discussions in a way that doesn't make it easy for new users who browse the EA forum and who like partisan politic discussions to just jump in.&nbsp;</p>", "parentCommentId": "AqtqPw4KQXrNhvn36", "user": {"username": "ChristianKleineidam"}}]