[{"_id": "vMzcCsqHCAgf7cxMM", "postedAt": "2015-08-04T05:27:24.602Z", "postId": "PfkwPxymcEpkZjKRa", "htmlBody": "<p>Agree with the general advice, and I'm particularly intrigued by the idea of how EAs should be less risk-averse than the general population, or should otherwise adopt different strategies than other rational investors.</p>\n<p>You speak of how we can get very similar value by buying the Nth vaccine (versus the Nth car), which makes a lot of sense. Another approach would be to just save less, hold these minimal retirement assets in safe instruments, but give the remainder to an organization or your own charitable trust earlier in a very aggressive manner.</p>\n<p>I have this vague idea that it's probably best to save until an aggressive high-stock portfolio that performs particularly poorly could still cover expected lifetime living expenses, and then to give away any additional funds over and above this amount.</p>\n<p>Probably the biggest drawback to this approach is that it invites the temptation to consume excessively. It may be better to starve ourselves of this excess capital by signing it over to the organizations we most trust.</p>\n", "parentCommentId": null, "user": {"username": "lazyhappygood"}}, {"_id": "FjS3T6Nqbk6gETbMM", "postedAt": "2015-08-04T10:36:30.354Z", "postId": "PfkwPxymcEpkZjKRa", "htmlBody": "<p>This looks really interesting, thanks for sharing! Does anyone know anything about the UK equivalents? A quick search suggests they're not quite at the same level yet, but I'd be interested in people's views on them.</p>\n", "parentCommentId": null, "user": {"username": "aliwoodman"}}, {"_id": "9P7PrRSWnyJ6rKE4D", "postedAt": "2015-08-04T13:00:00.906Z", "postId": "PfkwPxymcEpkZjKRa", "htmlBody": "<p><a href=\"https://zenassets.com\">https://zenassets.com</a></p>\n", "parentCommentId": "FjS3T6Nqbk6gETbMM", "user": {"username": "HaukeHillebrandt"}}, {"_id": "K2iBH2inWZtaZJY6y", "postedAt": "2015-08-04T15:15:00.831Z", "postId": "PfkwPxymcEpkZjKRa", "htmlBody": "<p>Another argument for some readers investing aggressively in this particular case is that if you are young (which many of you are), you can afford to hold assets for a lot longer. Risky assets tend to be a lot less risky over long time periods. For example, on any given year, stocks have a fairly high chance of performing worse than bonds, but (IIRC) stocks have performed better than bonds over every 30-year period since the beginning of the 20th century--even if you bought stocks right at the peak in 1929. If you can afford to hold your assets for 30 years without selling, you can be more aggressive.</p>\n<p>Even the most aggressive allocations offered by Wealthfront and Betterment are still conservative enough that any young person with no large need or cash in the medium-term future should feel comfortable with them.</p>\n", "parentCommentId": "vMzcCsqHCAgf7cxMM", "user": {"username": "MichaelDickens"}}, {"_id": "Sgr7e8SxzpBy8ED3Q", "postedAt": "2015-08-04T17:15:31.877Z", "postId": "PfkwPxymcEpkZjKRa", "htmlBody": "<blockquote>\n<p> stocks have performed better than bonds over every 30-year period since the beginning of the 20th century</p>\n</blockquote>\n<p>Non-overlapping sample size = 3</p>\n<p>This is not just a nitpic. I do not think your central claim, that riskiness declines with time horizon, is true outside of some special cases. If you have other arguments for this I would be happy to discuss them.</p>\n<p>Otherwise, I recommend <a href=\"http://merage.uci.edu/~jorion/papers%5Crisk.pdf\">The long-term risks of global stock markets</a></p>\n", "parentCommentId": "K2iBH2inWZtaZJY6y", "user": {"username": "Larks"}}, {"_id": "GpYKJD5XCGvHDamj7", "postedAt": "2015-08-04T17:20:07.039Z", "postId": "PfkwPxymcEpkZjKRa", "htmlBody": "<p>I am not a financial adviser, this is not financial advice. This is not an invitation to buy or sell. I am not an employee of Wealthfront. I am a client of wealthfront.</p>\n<p>As no-one has posted one yet, <a href=\"http://wlth.fr/1qwhrqW\">here is my affiliate invite to wealthfront</a>. If you use it, both of us will get an extra $5k managed with no fees.</p>\n<p>However despite the fact that I use them, please do not take this as encouragement to sign up as well. You should do your own research, including but not limited to Betterment, and come to your own conclusions.</p>\n", "parentCommentId": null, "user": {"username": "Larks"}}, {"_id": "63duxn33G93mHAt3r", "postedAt": "2015-08-04T17:47:42.073Z", "postId": "PfkwPxymcEpkZjKRa", "htmlBody": "<p>It'd also be good if people would write to Wealthfront/Betterment/etc. asking for the ability to donate stock! I e-mailed both companies about it a year or so ago, and both responded that they may add it in the future but had no definite plans. There can be benefits to donating that way, which are explained in <a href=\"http://reducing-suffering.org/advanced-tips-on-personal-finance/#capital-gains\">this essay by Brian Tomasik</a>. And instructions on how to donate stock to GiveWell are <a href=\"http://www.givewell.org/about/donate/donor-advised-fund\">here</a>.</p>\n<p>Also, I've been using both Wealthfront and Betterment for a year with similar risk profiles, and Betterment has done <em>slightly</em> better. I know a year's comparison means next-to-nothing for deciding which will be better, but I'm curious to see if others agree with you that we should prefer Wealthfront.</p>\n", "parentCommentId": null, "user": {"username": "BlakeHilliard"}}, {"_id": "dr6nZ38qgSbDQJDi9", "postedAt": "2015-08-04T18:34:57.890Z", "postId": "PfkwPxymcEpkZjKRa", "htmlBody": "<p>I actually hadn't considered that, but that's really important. If you have most of your money in a robo-advisor and want to donate some of it, I believe the best solution would be to transfer your holdings to a different brokerage account that lets you donate stock, and then donate from there.</p>\n<p>It doesn't look like Wealthfront or Betterment offer donor-advised funds either, which would be a nice feature.</p>\n<p>About why I think Wealthfront will perform (slightly) better than Betterment: I may write about this in more depth in the future, but the main reason is that Betterment puts a lot of its holdings into Vanguard value ETFs and less in emerging markets. I do believe that value stocks outperform the market in the long run, but the methodology for Vanguard's value ETF (which is based on the CRSP US Value Index) is really weird and I couldn't find any evidence that it captures the value premium.</p>\n", "parentCommentId": "63duxn33G93mHAt3r", "user": {"username": "MichaelDickens"}}, {"_id": "menTCWcTNkzaXjpYc", "postedAt": "2015-08-04T18:41:48.716Z", "postId": "PfkwPxymcEpkZjKRa", "htmlBody": "<p>Really the sample size is closer to 4 ;)</p>\n<p>You may be right here--I haven't researched this claim much. It's also true that stocks performed unusually well during the 20th century and that this may not continue.</p>\n", "parentCommentId": "Sgr7e8SxzpBy8ED3Q", "user": {"username": "MichaelDickens"}}, {"_id": "Wa7vZCzwFKqKeYryX", "postedAt": "2015-08-04T19:42:23.321Z", "postId": "PfkwPxymcEpkZjKRa", "htmlBody": "<p>My recommendation to use the maximally aggressive allocation may not be reasonable for everyone, but my impression is that it's the best for most EAs. Do you disagree about this?</p>\n", "parentCommentId": "Sgr7e8SxzpBy8ED3Q", "user": {"username": "MichaelDickens"}}, {"_id": "xoyLGAfibZbAEDqrS", "postedAt": "2015-08-05T23:31:09.441Z", "postId": "PfkwPxymcEpkZjKRa", "htmlBody": "<p>How big of a deal is this when compared to a traditional index fund? The maximally risky portfolio that wealth front recommended to me underperformed the US stock index over the last 20 years, for example.</p>\n", "parentCommentId": null, "user": {"username": "Ben_West"}}, {"_id": "3NXE2cEcbNzhdCJGP", "postedAt": "2015-08-06T00:58:48.078Z", "postId": "PfkwPxymcEpkZjKRa", "htmlBody": "<p>A couple of points: </p>\n<ol>\n<li><p>Wealthfront holds indexes for both the US and foreign developed markets. These probably have about the same expected return going forward (we have no reason to believe that the US will have better economic growth than Europe or Japan), but holding both reduces risk. Even if you're close to risk-neutral, you should reduce risk if you can do it for free.</p>\n</li>\n<li><p>Wealthfront holds an emerging market index fund. Emerging markets will likely outperform the US in the long run, even if they haven't over the last 20 years. (Emerging markets are doing particularly badly right now and the US is doing particularly well so this may just be a short/medium-term trend.)</p>\n</li>\n</ol>\n<p>Emerging markets are riskier because they are more likely to collapse, so <em>a priori</em> we should expect them to have higher returns. It's commonly accepted that they do have higher returns, although a quick search couldn't find much (<a href=\"https://www.bogleheads.org/wiki/Emerging_market_stocks#Risk.2C_volatility.2C_correlation\">this source</a> claims they outperformed the US market by 2 percentage points from 1985-2005 but this isn't a very long period). Wealthfront <a href=\"https://research.wealthfront.com/whitepapers/investment-methodology/\">assumes</a> that emerging markets will have a 5.4% return versus 4.3% for the US market.</p>\n<p>Of course, if you wanted to invest on your own instead of using Wealthfront and buy something like 25% US / 25% developed markets / 50% emerging markets, that would have a higher expected return. It might not be a bad idea to do something like this if you're willing to put in the time.</p>\n", "parentCommentId": "xoyLGAfibZbAEDqrS", "user": {"username": "MichaelDickens"}}, {"_id": "SPhP4kNvtsBBaP95L", "postedAt": "2015-08-07T06:56:59.045Z", "postId": "PfkwPxymcEpkZjKRa", "htmlBody": "<blockquote>\n<p>These probably have about the same expected return going forward (we have no reason to believe that the US will have better economic growth than Europe or Japan)</p>\n</blockquote>\n<p>Any pointers to sources on this?</p>\n", "parentCommentId": "3NXE2cEcbNzhdCJGP", "user": {"username": "RomeoStevens"}}, {"_id": "328gKEc8G3jypxBXp", "postedAt": "2015-08-07T21:03:04.598Z", "postId": "PfkwPxymcEpkZjKRa", "htmlBody": "<p>I was largely going off the conventional wisdom and the <em>a priori</em> belief that we can't make good predictions about countries' future economic growth. There's more to it than that but I don't have any good sources off hand.</p>\n", "parentCommentId": "SPhP4kNvtsBBaP95L", "user": {"username": "MichaelDickens"}}, {"_id": "Guvw28JeoceF75vRs", "postedAt": "2015-08-08T10:15:55.815Z", "postId": "PfkwPxymcEpkZjKRa", "htmlBody": "<p>The maximally aggressive strategy is to lever up 10x and bet on momentum!</p>\n<p>I think there are credible arguments for this view, but these are mainly about EAs having low risk aversion, not the strategy being low risk.</p>\n", "parentCommentId": "Wa7vZCzwFKqKeYryX", "user": {"username": "Larks"}}, {"_id": "KLnYcNyT77aqKnxuX", "postedAt": "2015-08-08T22:34:24.117Z", "postId": "PfkwPxymcEpkZjKRa", "htmlBody": "<p>You could appeal to the efficient market hypothesis to justify yourself here i reckon.\n<a href=\"https://en.wikipedia.org/wiki/Efficient-market_hypothesis\">https://en.wikipedia.org/wiki/Efficient-market_hypothesis</a></p>\n", "parentCommentId": "328gKEc8G3jypxBXp", "user": {"username": "Andrew"}}, {"_id": "fyuNcXBdeTLStp2FD", "postedAt": "2015-08-09T20:22:20.577Z", "postId": "PfkwPxymcEpkZjKRa", "htmlBody": "<p>To be clear, the efficient-market hypothesis says nothing about economic growth: as I understand it the demographics of the US relative to Japan in particular are a good reason to expect higher growth in the US over the long term. What it says is that facts such as that (which are widely known and understood) should already be accounted for in stock prices, and so you shouldn't be able to get an 'easy win' by betting on such trends.</p>\n", "parentCommentId": "KLnYcNyT77aqKnxuX", "user": {"username": "AGB"}}, {"_id": "M4uAAu76DQbgjsPQ8", "postedAt": "2015-08-09T21:07:35.489Z", "postId": "PfkwPxymcEpkZjKRa", "htmlBody": "<p>Cool, I want to try this. Does anyone have recommendations among the ones I should use when I’m based in Germany? I’m wary of problems with double taxation.</p>\n<p>In <a href=\"http://boerse.ard.de/anlagestrategie/geldanlage/angriff-der-robo-advisors100.html\">this article</a> I’ve found:</p>\n<ol>\n<li><a href=\"https://www.cashboard.de/\">Cashboard</a></li>\n<li><a href=\"https://www.vaamo.de/\">Vaamo</a></li>\n<li><a href=\"https://www.easyfolio.de/\">Easyfolio</a></li>\n<li><a href=\"https://www.quirion.de/\">Quirion</a></li>\n<li>some product of <a href=\"https://www.comdirect.de/\">Comdirect</a></li>\n<li>some product of <a href=\"http://www.financescout24.de/\">FinanceScout24</a></li>\n</ol>\n", "parentCommentId": null, "user": {"username": "Telofy"}}, {"_id": "XbCjJ9XdKtoYYWmqG", "postedAt": "2015-08-10T05:19:41.228Z", "postId": "PfkwPxymcEpkZjKRa", "htmlBody": "<blockquote>\n<p>I do not think your central claim, that riskiness declines with time horizon, is true outside of some special cases. If you have other arguments for this I would be happy to discuss them.</p>\n</blockquote>\n<p>The obvious argument is the Central Limit Theorem. Unless you want to argue that the log-variance of stock movements is secretly infinite, which seems doubtful.</p>\n", "parentCommentId": "Sgr7e8SxzpBy8ED3Q", "user": {"username": "Ben_Kuhn"}}, {"_id": "XtBAwXcaN5BNxT2kY", "postedAt": "2015-08-10T17:54:11.917Z", "postId": "PfkwPxymcEpkZjKRa", "htmlBody": "<p>The efficient-market hypothesis should still predict that we will see equal risk-adjusted returns from any country. If the US and Japan have equal risk (which they probably don't but let's say they do), and most people expect the US to see more economic growth, then the US market should be more highly valued than Japan's to the point where the expected market returns from each are the same. Otherwise you could get an easy win by buying US stocks instead of Japanese stocks.</p>\n", "parentCommentId": "fyuNcXBdeTLStp2FD", "user": {"username": "MichaelDickens"}}, {"_id": "npbQrinojnyuyajcK", "postedAt": "2015-08-10T23:24:02.424Z", "postId": "PfkwPxymcEpkZjKRa", "htmlBody": "<p>Yes your average return will mean revert but I do not think there is any reason to think total wealth will revert to trend. e.g. if SPY falls by 10% this year, there is little to no catch up growth in future, though obviously future positive returns will dilute the 10% drop.</p>\n", "parentCommentId": "XbCjJ9XdKtoYYWmqG", "user": {"username": "Larks"}}, {"_id": "Q6fKCQatPf3r6zBKb", "postedAt": "2015-08-11T02:53:27.081Z", "postId": "PfkwPxymcEpkZjKRa", "htmlBody": "<p>Oh, huh, you're right--the relative <em>log</em>-variance of a product of iid lognormals shrinks, but the relative variance doesn't. TIL, thanks!</p>\n", "parentCommentId": "npbQrinojnyuyajcK", "user": {"username": "Ben_Kuhn"}}, {"_id": "b4r6snL4w5THYtq9s", "postedAt": "2015-08-13T01:41:55.488Z", "postId": "PfkwPxymcEpkZjKRa", "htmlBody": "<p>I can't read German, but I'd suggest you look for a robo-advisor with the following attributes:</p>\n<ul>\n<li>High allocation in foreign stocks, especially emerging markets. Allocation in small-capitalization stocks is nice too if you can get it.</li>\n<li>Tax-loss harvesting. (I don't know if there are differences in German tax law that make this less valuable than in the US, but I suspect not.)</li>\n<li>Low fees (should be 0.25% per year or less).</li>\n</ul>\n", "parentCommentId": "M4uAAu76DQbgjsPQ8", "user": {"username": "MichaelDickens"}}, {"_id": "wuR8xX6FB3BgSqok8", "postedAt": "2015-08-13T08:56:41.359Z", "postId": "PfkwPxymcEpkZjKRa", "htmlBody": "<p>The emerging markets share seems to be at 24% max with Vaamo as opposed to up to 28% with Wealthfront. But that difference doesn’t seem too great. Unfortunately I can’t see them using any tax-loss harvesting, and the fees are between .5% and 1% across the board. It seems the US providers are way ahead.</p>\n", "parentCommentId": "b4r6snL4w5THYtq9s", "user": {"username": "Telofy"}}, {"_id": "rgQuWBn9KG28KMWBX", "postedAt": "2015-08-16T13:08:28.353Z", "postId": "PfkwPxymcEpkZjKRa", "htmlBody": "<p>A few comments, somewhat biased towards people in the US:</p>\n<ol>\n<li><p>Is there a way to transfer out individual appreciated holdings for the purpose of donating those holdings? Does that cause problems with the remainder of your holdings? i.e. Does Wealthfront rebalance the remainder of your holdings, potentially selling holdings with capital gains and reducing future opportunities to donate appreciated holdings? For an effective altruist investor, this seems like a very important consideration in the long term.</p>\n</li>\n<li><p>Is a highly risky portfolio (100% stock, overweighting small cap value and emerging markets) necessarily appropriate for an effective altruist? Most people don't have the risk tolerance to endure huge losses or maintain a portfolio that underperforms more conventional asset allocations for decades at a time. Such a situation may result in selling near the bottom of a market and/or being scared off from risky investing for good. Maybe effective altruists are different, but I'd be cautious in making that assumption. It may be better to start with a more conservative asset allocation and then endure one or more downturns before deciding to substantially increase risk.</p>\n</li>\n<li><p>A simple allocation like a 100% allocation to Vanguard Total US Stock Market or Vanguard Total World Stock may outperform a highly aggressive robo-advisor portfolio after fees in the long term. Fees are guaranteed to reduce performance, while tilting towards small cap value and emerging markets are not guaranteed to increase performance. Since 100% stock may still be too aggressive though, it may be a good idea to dilute risk further with bonds or CD's.</p>\n</li>\n<li><p>Effective altruists who want more money in retirement than social security can provide (for consumption or donation) or who want to leave behind an estate should be making use of tax advantaged retirement accounts. That means a 401(k) in many cases. Similarly, effective altruists who want to pay for their childrens' college should be using tax advantaged college savings accounts, such as 529 accounts. That makes investing more complicated than simply signing up for a robo-advisor and forgetting about it.</p>\n</li>\n<li><p>An effective altruist or anyone else who wants free high quality investing advice should check out <a href=\"http://www.bogleheads.org\">www.bogleheads.org</a>. You can read the Wiki and/or post of the forum with your situation (including your effective altruist goals) and highly competent people will be more than happy to help.</p>\n</li>\n</ol>\n<p>Avi</p>\n", "parentCommentId": null, "user": {"username": "AviN"}}]