[{"_id": "Eg5YqGmq4ohXCmvAT", "postedAt": "2023-05-23T17:01:16.165Z", "postId": "PhL7LDuYHLzvihejX", "htmlBody": "<p>Please downvote this comment if you want to signal boost the OP but cancel out the karma-farming effect.</p>", "parentCommentId": null, "user": {"username": "Arepo"}}, {"_id": "rGKxFMj7LnLgyx8Hj", "postedAt": "2023-05-23T19:08:01.236Z", "postId": "PhL7LDuYHLzvihejX", "htmlBody": "<p>I appreciate this comment</p>\n", "parentCommentId": "Eg5YqGmq4ohXCmvAT", "user": {"username": "Grayden"}}, {"_id": "8MxMCJbtQ6ebKTAnw", "postedAt": "2023-05-24T11:24:47.138Z", "postId": "PhL7LDuYHLzvihejX", "htmlBody": "<p>Thoughts on including EA-oriented tools? I've added one at its creator's suggestion, though I'm not sure if there are so many such tools that a fair inclusion policy would be an enormous list (though if so, maybe tools would deserve their own advertising thread?). Should I add eg Squiggle/Guesstimate/others?</p>", "parentCommentId": null, "user": {"username": "Arepo"}}, {"_id": "dfwLnDqsndfzfoqZN", "postedAt": "2023-05-24T20:46:03.264Z", "postId": "PhL7LDuYHLzvihejX", "htmlBody": "<p>Im missing two of my personal top recommendations here:&nbsp;</p><ol><li>The EA Focusmate group. I have made some good connections there, somehow I feel it works better if I am matched with someone from this community.&nbsp;</li><li><a href=\"https://Confido.institute\">Confido.institute</a> . &nbsp;A forecasting tool for during meetings or for within organisation! Potentially makes meetings faster and it is a simple way to get some groups forecasts.&nbsp;</li></ol>", "parentCommentId": null, "user": {"username": "ThomasFowl"}}, {"_id": "kjqnrfQBqr6EKLRTY", "postedAt": "2023-05-26T08:51:04.490Z", "postId": "PhL7LDuYHLzvihejX", "htmlBody": "<p>Hey Sam, I've added Confido to the list, thanks :)</p><p>Re EA Focusmate, I've left it off because afaik it doesn't meet the 'putting ongoing work into' criterion, which is there partly to recognise and acclaim such efforts, partly to stop the list from getting swamped with 'someone set up something one time, seems like it could be useful idk' kind of efforts.</p><p>Also, I'm biased, but if you want to come and make connections with EAs, I would strongly recommend the Gather Town over it, which is there for exactly that purpose, less hassle to set up and (IMO) a generally warmer place.</p>", "parentCommentId": "dfwLnDqsndfzfoqZN", "user": {"username": "Arepo"}}, {"_id": "jDX9abD7tkAbNryFe", "postedAt": "2023-05-27T06:30:45.311Z", "postId": "PhL7LDuYHLzvihejX", "htmlBody": "<p>The point about ongoing work seems fair enough!&nbsp;</p><p>On Gather Town: My problem with it is that to me Gather Town is <strong>too much fun, </strong>you are right it is a warmer place and more fun place, but I want to spend my time on a service like this working, not having casual chats with EAs, racing on a racetrack or just exploring the space!&nbsp;</p>", "parentCommentId": "kjqnrfQBqr6EKLRTY", "user": {"username": "ThomasFowl"}}, {"_id": "KfKwxaK4pa9LGJbrf", "postedAt": "2023-05-27T09:59:36.488Z", "postId": "PhL7LDuYHLzvihejX", "htmlBody": "<p>How long ago did you use it? I'm not implying the problem is fixed, but we have tried a few things to give it an increased productivity value. Also if you have any thoughts on how to make it more reliably give you what you want I'd love to hear them - this is definitely an ongoing concern!</p>", "parentCommentId": "jDX9abD7tkAbNryFe", "user": {"username": "Arepo"}}]