[{"_id": "bEMJQqP74A9r3BnAC", "postedAt": "2023-04-26T15:07:28.629Z", "postId": "PhNfc9JRFc9CsDjvi", "htmlBody": "<p>Thanks for writing this, I've thought the same points several times, so glad it's summarized somewhere.</p>\n", "parentCommentId": null, "user": {"username": "vaidehi_agarwalla"}}, {"_id": "rbTMWGqFepr8aAXn2", "postedAt": "2023-04-26T15:35:45.504Z", "postId": "PhNfc9JRFc9CsDjvi", "htmlBody": "<p>Interesting note:&nbsp;<a href=\"https://forum.effectivealtruism.org/posts/GcvEdYJADH3vMqk3F/suggest-candidates-for-cea-s-next-executive-director\"><u>we're about to get a new ED</u></a>.<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnref0y8lclq3167d\"><sup><a href=\"#fn0y8lclq3167d\">[1]</a></sup></span>&nbsp;There’s a mandate for that new ED to come in with their own vision of what CEA should be. I have argued (weakly held) that CEA should either get a vision under the new ED of trying to do more coordination and leadership in the EA community, or should change its name.</p><blockquote><p>One of the things that I like about the EA community is that it is decentralized, meaning there is no single person or entity who sets the direction of, or represents, the community (It’s like Sunni Islam in that way, rather than being like the Catholic Church, which is centrally controlled by the Vatican and the Pope).</p></blockquote><p>Agreed.</p><p><i>Caveat: definitely not speaking for CEA.</i></p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fn0y8lclq3167d\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnref0y8lclq3167d\">^</a></strong></sup></span><div class=\"footnote-content\"><p>It looks like you’ve noticed. And I had forgotten that that post even references explicitly the possibility of changing CEA’s name.</p></div></li></ol>", "parentCommentId": null, "user": {"username": "jpaddison"}}, {"_id": "2m2aTcSuHuKf8gvMg", "postedAt": "2023-04-26T18:42:13.372Z", "postId": "PhNfc9JRFc9CsDjvi", "htmlBody": "<p>I wish all criticism on the EA Forum was like this.</p><p>Edit: To elaborate...</p><ol><li>Excellent structure<ol><li>Very concise summary</li><li>Concise summary</li><li>Epistemic status</li><li>The problem</li><li>Ideas for solutions</li><li>Genuine attempt to consider the costs and appropriate timing of proposed solutions and suggesting more practical medium-term fix</li><li>More details</li></ol></li><li>Charitable explanations for why things are as they are and why people want change, rather than assumptions of incompetence or selfishness<ol><li>\"Now that the EA ecosystem is much bigger and more complex, it's understandable that the community is somewhat confused about and distrustful of CEA\" rather than \"CEA is untrustworthy\" or \"No-one trusts each other any more\"</li><li>\"You've had a lot of challenges recently and it looks like this set-up is making your lives more difficult too\" rather than \"CEA is undemocratic and rationalizing its privilege\"</li></ol></li><li>But also direct about the problems and not assuming completely charitable explanations either</li><li>Genuine appreciation of good work</li><li>Discussing the post with the criticized party in advance</li></ol><p>Also I'm personally a huge fan of people a) recognizing hindsight bias and b) injecting a bit of personality into posts.</p>", "parentCommentId": null, "user": null}, {"_id": "idork7LaTNfnzYfsn", "postedAt": "2023-04-26T18:50:22.245Z", "postId": "PhNfc9JRFc9CsDjvi", "htmlBody": "<p>Thanks for writing this Kaleem! On the name change bit: I feel pretty hesitant to make this kind of change without having a&nbsp;<a href=\"https://forum.effectivealtruism.org/posts/GcvEdYJADH3vMqk3F/suggest-candidates-for-cea-s-next-executive-director\"><u>permanent ED</u></a>. I expect that a new ED would be fairly likely to have a vision for the organization which would influence what name we should have, so I (in my role as Interim Managing Director) don’t want to make a change only for it to have to be changed a few months later when we get an ED.</p><p>(I’m not sure you disagree with this prioritization, just stating for transparency why I don’t expect to prioritize this.)</p>", "parentCommentId": null, "user": {"username": "Ben_West"}}, {"_id": "qzT5L7pmsJdhF9ywm", "postedAt": "2023-04-26T20:44:19.947Z", "postId": "PhNfc9JRFc9CsDjvi", "htmlBody": "<p>Hi Kaleem! (For people who don't know, I'm the interim head of the Community Health team). Thanks for caring about and raising these issues.</p><p>I’ll give the short version here and aim to respond to myself with wider ranging, more in the weeds thinking another day. Basically, we have been independently thinking about whether to spin out or be more independent, and think this post is correctly pointing out a bunch of considerations that point to and away from that being the right call, with a lot of overlap in the things we’ve been tracking. At the moment the decision doesn’t feel obvious, for basically the reasons you list. I’ll add just a few things:</p><ul><li>[This one might be obvious, but just going to say] Spinning out of CEA or EV doesn’t by itself solve COI issues, since we’ll still have a board and an executive director, and require funding.</li><li>One thing I want to add to the coordination and knowledge sharing points: if it's low cost to pass on concerns we have means we can be more free with pointing to issues we see, even if there isn’t something concrete we can yet point to.&nbsp;</li><li>Lastly, there’s a lot of maybe implicit focus on casework in this post, and I want to reiterate that that is one part of what we do, but <a href=\"https://www.centreforeffectivealtruism.org/community-health\">not all of it</a>, and different aspects of what we do requires buy-in from different stakeholders.</li></ul>", "parentCommentId": null, "user": {"username": "ChanaMessinger"}}, {"_id": "qfrvu5jAb2qFGGGxT", "postedAt": "2023-04-26T21:32:24.245Z", "postId": "PhNfc9JRFc9CsDjvi", "htmlBody": "<p>I like both these suggestions a lot. I just wonder if anyone can chime in if the CH Team might struggle to get NGO status without being part of CEA. I wonder what their altruistic mission statement would be summarized as?</p>\n<p>Perhaps this is a silly question and NGO status is easier to get than I think.</p>\n", "parentCommentId": null, "user": {"username": "Ivy_Mazzola"}}, {"_id": "jzPjdY2jyw9ubXBgN", "postedAt": "2023-04-26T22:49:40.047Z", "postId": "PhNfc9JRFc9CsDjvi", "htmlBody": "<p>I really appreciate this article. I think it's good to continually evaluate the structure and flows of things. But here's my problem, and probably it's because I don't have enough of a sense of how things flow amongst CEA and EV and other entities, maybe you could write more of how you see the energy flowing overall in EA and where these entities exist in that. People more aware probably find this article more helpful than me.&nbsp;<br><br>From what I do know, here's how I see the flow; it appears that EA has a series of \"funnels\" or \"channels\" where people come in; the forum, university groups, virtual programs, EAG's, books, PR outreach, etc. and so these people flow in to EA through these various channels and then they decide to commit to giving money or to seek an EA job or 80K recommended job or charity job and become more an actual part of EA.&nbsp;<br><br>So it seems to me that all the expansion of EA goes on beyond the funnels...more org's start, more org's expand and create more jobs and research contributions, more charities start...that expansion can go on forever, that's where the growth is...but the funnel remains the same. I think CEA is the funnel, they organize all the local groups, the Virtual Programs, the regional gatherings, the forum...that funnel will slowly grow and expand and adjust itself while the bigger EA world beyond the funnel continues to expand even more wildly. I think the Centre for Effective Altruism is a great name for the funnel.&nbsp;<br><br>Of course the funnel doesn't control all the wild expansion of org's and charities, those each have their own visions and energies. The funnel just provides a stable front entrance anyone can easily find before they enter and go off in a million different directions. And for certain issues, like having a nurse station for EA's mind boo-boo's, or a principal's office to interdict bullies, it's good to have those by the front door, easy to find.</p>", "parentCommentId": null, "user": {"username": "JeffreyK"}}, {"_id": "NiiejwJ2tBYsK9pQ9", "postedAt": "2023-04-26T23:10:36.795Z", "postId": "PhNfc9JRFc9CsDjvi", "htmlBody": "<p>Also,</p><blockquote><p>From what I can tell, ‘CEA’ was never meant to be the name of anything substantial ( William MacAskill&nbsp;<a href=\"https://forum.effectivealtruism.org/posts/9a7xMXoSiQs3EYPA2/the-history-of-the-term-effective-altruism\"><u>reports that</u></a> it was just meant to be the unassuming name of the umbrella organization which 80k and GWWC wanted to form back in the day) - and I think it feels right (in a poetic/nostalgic way) that the community finally moves on from it to something better.</p></blockquote><p>Loving these '<a href=\"https://i.pinimg.com/originals/90/c4/62/90c46288278efa4b2a54907b73b6ad6b.jpg\">It is time</a>' vibes.</p><p>I feel it's becoming increasingly hard for EA orgs/leaders to feel good about learning, growing and adapting, because before they've had a chance to really process a problem, dozens of EAs have publicly and unforgivingly called them out on it. It's been looking less like a collaborative effort to make progress and more like a fight, where disagreement is 'unwillingness to be criticized' and agreement is surrender.</p><p>(I think I should basically just accept that this is what happens as communities become larger, but I'm very appreciative of attempts to hold on to the more collaborative spirit.)</p>", "parentCommentId": "2m2aTcSuHuKf8gvMg", "user": null}, {"_id": "QriguuSoeCQjtTLfA", "postedAt": "2023-04-27T01:18:17.567Z", "postId": "PhNfc9JRFc9CsDjvi", "htmlBody": "<p>The US at least is not too rigorous on the ends that a 501(c)(3) tax-exempt non-profit can pursue. To give you a sense of that: the <a href=\"https://www.cnbc.com/2014/09/12/tax-exempt-the-nfls-nonprofit-status-by-the-numbers.html\">National Football League</a> used to be a 501(c) tax-exempt non-profit, albeit under 501(c)(6), until there was enough public outcry.</p><p>EVF's existing charitable purpose would presumably work for community health, maybe with some mild tweaks. It's not always correct to assume that a non-profit that runs programs A, B, C, and D could spin any of them off into their own non-profits. But it's generally so -- if A, B, C, and D weren't being run for a permissible tax-exempt charitable purpose, then the existing nonprofit probably had no legal basis to run them.&nbsp;</p><p>I don't see any red flags for community health as a standalone entity. By red flags, I mean things that would be a problem if they constituted more than a minimal fraction of a non-profit's overall activities (like political lobbying), things that benefitted a very small number of people, or things that heavily benefitted corporate insiders, etc.&nbsp;</p>", "parentCommentId": "qfrvu5jAb2qFGGGxT", "user": {"username": "Jason"}}, {"_id": "grvkL6bpjXSzFgyDL", "postedAt": "2023-04-27T01:28:00.253Z", "postId": "PhNfc9JRFc9CsDjvi", "htmlBody": "<p>It's plausible to me that the cost/benefit analysis might be different for different workloads in community health. Of course, splitting off some but not all CH workloads into another organization would be operationally challenging.</p><p>In response to footnote 8, I don't see the upside to any therapists or counselors being part of CEA, EVF, or an independent community health team. As a lawyer, there are rules I have to follow about who the client is to whom I owe loyalty (and I'm required to clearly communicate that if a non-client might think I may be representing them). I'm sure the same applies to other professionals as well.</p><p>&nbsp;However, independent practice is common by therapists (i.e., the ops burden is not that high), it'd be inadvisible for the community health organization to bear malpractice risk that it could not effectively monitor, and community health / therapist entanglement could complicate some revenue streams (if the person receiving services has good insurance in the US, might as well bill that first).</p>", "parentCommentId": null, "user": {"username": "Jason"}}, {"_id": "KoPtSZSrZjqLPDYhF", "postedAt": "2023-04-27T14:03:46.823Z", "postId": "PhNfc9JRFc9CsDjvi", "htmlBody": "<p>The issue with CEA \"representing\" EA in some way goes far deeper than the name. They curate and run: a conference called EA Global (the only major EA conference), <a href=\"http://effectivealtruism.org\">effectivealtruism.org</a> (including this forum), and other projects branded as Effective Altruism (not as the Centre for Effective Altruism).</p>\n<p>In my opinion, this is fundamentally at tension with the stated position that \"CEA, however, doesn’t appear to think of itself as the leader of the EA community\". Unless they cede control of these major parts of EA infrastructure (which could include them continuing to own them but having some kind of democratic governance) then they will continue to be the de facto leaders of the movement.</p>\n", "parentCommentId": null, "user": {"username": "jooke"}}, {"_id": "x2khRCaWcYwFZKBa9", "postedAt": "2023-04-27T16:02:37.482Z", "postId": "PhNfc9JRFc9CsDjvi", "htmlBody": "<p>I think there are a couple of things you're pointing out which are different issues than the one I'm trying to suggest a resolution to, or I disagree with.</p><p>1)<strong> I</strong> don't think CEA *is* 'the de facto leader' of the EA movement. So I find it problematic that branding/communication issues are leading to people in the community thinking that it is the case.&nbsp;<br><br>2) I don't have an issue per se with CEA solely running EA Global or the forum, or doing other things - it's just that there needs to be a clearer understanding (through reiteration and visibility) within the community of what CEA is and is not. Sure, CEA may be <i>disproportionatel</i>y prominent (mostly through being <strong>visible</strong>) but at most that makes them <strong>one of</strong> leading organisations in the EA movement, not <strong>the</strong> leader. (also I assume when you mean the movement, you're talking about meta-EA or community building stuff, as I don't think you'd really endorse the idea that CEA is in charge of<strong> </strong><a href=\"https://forum.effectivealtruism.org/topics/organizations-and-projects-in-effective-altruism\"><strong>all</strong> of this</a>?)<br><br>3) I think&nbsp;</p><blockquote><p>\"Unless they cede control of these major parts of EA infrastructure then they will continue to be the de facto leaders of the movement\".&nbsp;</p></blockquote><p>raises an interesting question/points to a weird way you think about <strong>leadership</strong>? I wouldn't consider the richest Americans/the Americans who own the most stuff to be the leaders of America. Maybe you're suggesting they control the movement or dictate what EA does, but I would suggest EA's main/only substantive funder, and the 5-20 individuals who decide where its money goes, fills that role, not CEA.&nbsp;<br><br>I don't think I'm on board with all the 'democratise EA' cries which have been made over the past year, but I think I'm sentimentally in agreement with you about centralised control - and that it's not great that decision making, through funding, is currently monopolised. &nbsp;</p>", "parentCommentId": "KoPtSZSrZjqLPDYhF", "user": {"username": "Kaleem"}}, {"_id": "fgahyp8magQGyrzWz", "postedAt": "2023-04-27T16:12:00.468Z", "postId": "PhNfc9JRFc9CsDjvi", "htmlBody": "<blockquote><p>I wouldn't consider the richest Americans/the Americans who own the most stuff to be the leaders of America</p></blockquote><p>The US federal government controls most US infrastructure, either directly or indirectly through regulation, and is generally considered to be leading America.</p>", "parentCommentId": "x2khRCaWcYwFZKBa9", "user": {"username": "Larks"}}, {"_id": "pE4WejZdFhjf3chuD", "postedAt": "2023-04-27T16:46:51.276Z", "postId": "PhNfc9JRFc9CsDjvi", "htmlBody": "<blockquote><p>The US federal government controls most US infrastructure, either directly or indirectly through regulation, and is generally considered to be leading America.</p></blockquote><p>Okay yes that's true, the government owns a lot of stuff. But aren't they considered 'the leader' because they were/ it was democratically elected to lead?&nbsp;<br><br>I guess I should have more accurately said \"I wouldn't consider the richest Americans/the Americans who own the most stuff to be the leaders of America solely because they own the most stuff\".&nbsp;</p>", "parentCommentId": "fgahyp8magQGyrzWz", "user": {"username": "Kaleem"}}, {"_id": "6qj76Pk4soTqvo93t", "postedAt": "2023-04-27T17:30:30.863Z", "postId": "PhNfc9JRFc9CsDjvi", "htmlBody": "<blockquote><p>They curate and run a conference called EA Global, effectivealtruism.org (including this forum)... Unless they cede control of these major parts of EA infrastructure... then they will continue to be the de facto leaders of the movement.</p></blockquote><p>I don't think this is true, necessarily. They can run this infrastructure without leading the movement; for example, the website could be descriptive rather than prescriptive, and they could run the conferences just by renting event spaces and then inviting speakers from whichever orgs are the current thought leaders.</p>", "parentCommentId": "KoPtSZSrZjqLPDYhF", "user": {"username": "robirahman"}}, {"_id": "zsEX5DCmHLCKYJFG3", "postedAt": "2023-04-27T17:41:14.074Z", "postId": "PhNfc9JRFc9CsDjvi", "htmlBody": "<p>What I mean is that they have control over most of the things that get to define what EA means and what it contains. Eg: who attends and speaks at EAG, what content is on <a href=\"http://effectivealtruism.com\">effectivealtruism.com</a>, moderation policies on the forum.</p>\n<p>The problem isn't branding or communication, CEA objectively have a large amount of power over the movement. I accept that \"leader\" might not be the correct choice of words, and that they're not exclusive in this role (as you observe, Open Phil similarly have a lot of power).</p>\n<p>I'm also unconvinced that democratising is the way forward. But I think CEA either needs to take steps in this direction or stop making statements such as \"we do not think of ourselves as having or wanting control over the EA community\".</p>\n", "parentCommentId": "x2khRCaWcYwFZKBa9", "user": {"username": "jooke"}}, {"_id": "unhtmjoY8gv32sYkP", "postedAt": "2023-04-27T17:44:05.371Z", "postId": "PhNfc9JRFc9CsDjvi", "htmlBody": "<p>I agree in the abstract. However, I think in practice this is pretty hard to do, because there's a lot of subjective judgement in deciding how to describe a movement or who the current thought leaders are.</p>\n", "parentCommentId": "6qj76Pk4soTqvo93t", "user": {"username": "jooke"}}, {"_id": "eDEP3NQxmKHD3Zk2J", "postedAt": "2023-04-27T17:57:06.736Z", "postId": "PhNfc9JRFc9CsDjvi", "htmlBody": "<p>The Chinese government wasn't democratically elected, but they still are the leader of China, because they own/control most of the infrastructure. Elections are only important for becoming leader if they give you control over key infrastructure.</p><p>I agree that the richest individual Americans are not therefore the leaders of America, but that's because their power/control over key infrastructure is very small compared to the federal government.</p>", "parentCommentId": "pE4WejZdFhjf3chuD", "user": {"username": "Larks"}}, {"_id": "RaCHkeDg9H5bwHb57", "postedAt": "2023-04-28T01:40:05.096Z", "postId": "PhNfc9JRFc9CsDjvi", "htmlBody": "<p>I'd be curious to hear your impression on where the Forum team is on the scale of \"just running infrastructure\" or \"leading the movement.\"</p>", "parentCommentId": "unhtmjoY8gv32sYkP", "user": {"username": "jpaddison"}}, {"_id": "BHkTjjGL9JwLTrhqY", "postedAt": "2023-04-28T09:57:02.954Z", "postId": "PhNfc9JRFc9CsDjvi", "htmlBody": "<p>Hi Joshua, I think you're pointing at something important about CEA representing EA through programs like EAG and the Forum, and I want to acknowledge that that is something we do and that it's a responsibility we take seriously. (I work in the Exec Office at CEA.)</p><p>These two posts give more detail about our approach:</p><ol><li><a href=\"https://www.centreforeffectivealtruism.org/core-principles\">Core EA Principles</a></li><li><a href=\"https://www.centreforeffectivealtruism.org/moderation-and-content\">Moderation and Content Curation</a></li></ol><p>My view is that our approach is consistent with not having or wanting control over the community, or being its de facto leader. Quite possibly you already agree with this based on your most recent comment above, but I wanted to share these resources in case you or other readers were not aware of them.</p>", "parentCommentId": "zsEX5DCmHLCKYJFG3", "user": {"username": "Oscar Howie"}}, {"_id": "h6eWK4MeBJkFJJ4uS", "postedAt": "2023-04-28T16:27:27.130Z", "postId": "PhNfc9JRFc9CsDjvi", "htmlBody": "<p>Some more in-the-weeds thinking that also may be less precise.</p><h2>Trust</h2><p>It’s absolutely true that the trust we have with the community matters to doing parts of our work well (for other parts, it’s more dependent on trust with specific stakeholders), and the topic is definitely on my mind. I’ll say I don’t have any direct evidence that overall trust has gone down, though I see it as an extremely reasonable prior. I say this only because I think it’s the kind of thing that would be easy to have an information cascade about, where “everyone knows” that “everyone knows” that trust is being lost. Sometimes there’s&nbsp;<a href=\"https://forum.effectivealtruism.org/posts/3wBCKM3D2dXkXnpWY/announcing-cea-s-interim-managing-director\"><u>surprising results</u></a>, like that the “overall affect scores [to EA as a brand] haven't noticeably changed post FTX collapse.” There are some possibilities we’re considering about tracking this more directly.&nbsp;&nbsp;</p><p>For me, I’m trying to balance trust being important with knowing that it’s normal to get some amount of criticism and trying not to be overreactive to that. For instance, in preparation for a specific project we might run, we did some temperature checking and getting takes on how people felt about our plan.&nbsp;</p><p>I do want people to have a sense of what we actually do, what our work looks like, and how we think and approach things so that they can make informed decisions about how to update on what we say and do. We have some ideas for conveying those things, and are thinking about how to prioritize those ideas against putting our heads down and doing good work directly.<br>&nbsp;</p><h3>Thoughts on the suggestions for improving trust&nbsp;</h3><p>To say a bit about the ideas raised in light of things I’ve learned and thought about recently.<br>&nbsp;</p><p><strong>External people</strong></p><p>Conscientious EAs are often keen to get external reviews from consultants on various parts of EA, which I really get and I think comes from an important place about not reinventing the wheel or thinking we’re oh so special. There are many situations in which that makes sense and would be helpful; I recently recommended an HR consultant to a group thinking of doing something HR-related. But my experience has been that it’s surprisingly hard to find professionals who can give advice about the set of things we’re trying to do, since they’re often mostly optimizing for one thing (like minimizing legal risk to a company, etc.) or just don’t have experience with what we’re trying to do.&nbsp;</p><p>In the conversations I’ve had with HR consultants, ombudspeople, and an employment lawyer, I continually have it pointed out that what the Community Health team does doesn’t fall into any of those categories (because unlike HR, we work with organizations outside of CEA and also put more emphasis on protecting confidentiality, and unlike ombudspeople, we try more to act on the information we have).&nbsp;</p><p>When I explain the difference, the external people I talk to extremely frequently say “oh, that sounds complicated\" or \"wow, that sounds hard”. So I just want to flag that getting external perspectives (something I’ve been working a bunch on recently) is harder than it might seem. There just isn’t much in the way of direct analogues of our work where there are already known best practices. A good version according to me might look more like talking to different people and trying to apply their thinking to an out-of-distribution situation, as well as being able to admit that we might be doing an unusual thing and the outside perspectives aren’t as helpful as I’d hope.&nbsp;</p><p>If people have suggestions for external people it would be useful to talk to, feel free to let me know!</p><p><strong>More</strong><i><strong>&nbsp;</strong></i><strong>updates</strong></p><p>Appreciate the point about updating the community more often - this definitely seems really plausible. We were already planning some upcoming updates, so look out for those. Just to say something that it’s easy to lose track of, it’s often much easier to talk or answer questions 1:1 or in groups than publicly. Figuring out how to talk to many audiences at once takes a lot more thought and care. For example, readers of the Forum include established community members, new community members, journalists, and people who are none of the above. While conversations here can still be important, this isn’t the only venue for productive conversation, and it’s not always the best one. I want to empower people to feel free to chat with us about their questions, thoughts or perspectives on the team, for instance at conferences. This is part of why I set up two different office hours at the most recent EAG Bay Area.</p><p>It’s also worth saying that we have multiple stakeholders in addition to the community at large [for instance when we think about things like the AI space and whether there’s more we could be doing there, or epistemics work, or work with specific organizations and people where a community health lens is especially important], and a lot of important conversations happen with those stakeholders directly (or if not, that’s a different mistake we’re making), which won’t always be outwardly visible.</p><p><strong>The other suggestions</strong><br>Don’t have strong takes or thoughts to share right now, but thanks for the suggestions!</p><p>For what it’s worth, I’m interested in talking to community members about their perspective on the team [modulo time availability]. This already happens to some extent informally (and people are welcome to pass on feedback to me (directly or&nbsp;<a href=\"https://docs.google.com/forms/d/e/1FAIpQLSdLnp5LVp0WwCOVKDHEZwh-5NPHz-ZwJEqsMe_Z38MPO8tUEg/viewform\"><u>by form</u></a>) or to the team (including&nbsp;<a href=\"https://docs.google.com/forms/d/1HvXX7zFLBY0ligvCucfzDrtdUt4H9-YN6laFpIneGko/viewform?edit_requested=true\"><u>anonymously</u></a>)). When I went looking for people to talk to (somewhat casually/informally) to get feedback from people who had lost trust, I ended up getting relatively few responses, even anonymously. I don’t know if that’s because people felt uncomfortable or scared or upset, or just didn’t have the time or something else. So I want to reiterate that I’m interested in this.</p><h2>Privacy</h2><p>I wanted to say here that we’ve <a href=\"https://forum.effectivealtruism.org/posts/NbkxLDECvdGuB95gW/the-community-health-team-s-work-on-interpersonal-harm-in\">said for a while</a> that we share information (that we get consent to share) about people with other organizations and parts of CEA [not saying you disagree, just wanted to clarify]. While I agree one could have concerns, overall I think this is a huge upside to our work. If it was hard to act on the information we have, we would be much more like therapists or ombudspeople, and my guess is that would hugely curtail the impact we could have. [This may not engage with the specifics you brought up, but I thought it might be good to convey my model].</p><h2>Independence / spinning out</h2><p>Just to add to my point about there still being a board, a director and funders in a world where we spin out, I’ll note that there are other potential creative solutions to gaining independence e.g. getting diverse funding, getting funding promises for more time in advance (like an endowment), and clever legal approaches such as those an ombudsperson I interviewed said they had. We haven’t yet looked into any of those in depth.</p><p>For what it’s worth, I think on the whole we’ve been able to act quite independently of CEA, but I acknowledge that that wouldn’t be legible from the outside.&nbsp;</p>", "parentCommentId": "qzT5L7pmsJdhF9ywm", "user": {"username": "ChanaMessinger"}}, {"_id": "vJL7aeyQtxD7Jkx7N", "postedAt": "2023-04-29T01:14:48.646Z", "postId": "PhNfc9JRFc9CsDjvi", "htmlBody": "<blockquote><p>&nbsp;In the conversations I’ve had with HR consultants, ombudspeople, and an employment lawyer, I continually have it pointed out that what the Community Health team does doesn’t fall into any of those categories (because unlike HR, we work with organizations outside of CEA and also put more emphasis on protecting confidentiality, and unlike ombudspeople, we try more to act on the information we have).</p><p>When I explain the difference, the external people I talk to extremely frequently say “oh, that sounds complicated\" or \"wow, that sounds hard”</p></blockquote><p>I wonder if the external reaction suggests that CH may be asked to wear too many hats in a way that makes it more challenging to wear them with excellence. Learning that CH is <i>sui generis</i> --or at least very atypical when compared to other movements -- potentially suggests that other movements may have learned (through trial and error, most likely) that certain functions are better off separated than merged into one group of people.&nbsp;</p><p>For instance, in the discussion of privacy, you suggest that a role \"much more like therapists or ombudspeople\" would \"hugely curtail the impact we could have.\" I'm sure that is true for many aspects of CH's work, but it's not clear to me why it would be true for all aspects. As a society, we've decided that it is net positive for people to be able to receive certain kinds of help with <i>very </i>robust confidentiality protections -- hence we have priests, psychologists, and lawyers among others. With pretty limited exceptions, we have decided that when it comes to supporting people \"who are dealing with personal or interpersonal problems,\" those support providers should not be able to use the information obtained for any other purpose. (In many but not all circumstances, the person seeking support can consent to other uses of the information.)&nbsp;</p><p>As a practical matter, it's hard for people to fully \"unhear\" what they have heard. Whether in recognition of that practical reality, or to reassure people considering seeking help, we normally avoid putting people in both a role of help-provider and a role that would potentially require them to somehow evaluate the help-seeker, or put information they learned as a help-provider out of mind.</p><p>One usual approach for providing support in the broader community is to have an independent contractor providing Employee Assistance Program services, where nothing that the care-seeker said (or even their invocation of EAP assistance) can make its way back to the people who could even potentially take adverse action based on that information. I think that's probably the right track for <i>some</i> portion of CH's work -- it would be helpful to give people coming to CH for help with their own personal or interpersonal problems the option to receive support from someone who is strongly sealed off from any non-support-providing roles and functions.</p>", "parentCommentId": "h6eWK4MeBJkFJJ4uS", "user": {"username": "Jason"}}, {"_id": "dY3MnujBkJCbwhSJK", "postedAt": "2023-04-30T14:31:31.202Z", "postId": "PhNfc9JRFc9CsDjvi", "htmlBody": "<p>Thank you for those links. The decisions explained in the moderation and content curation policies are, in my view, extremely important and determine where a lot of EA discourse is. This happens either directly (eg: EAG speaking slots) or indirectly (eg: who gets filtered out when following EA intro materials). I do not think taking those decisions is compatiable with the idea that \"we [CEA] do not think of ourselves as having or wanting control over the EA community\".</p>\n<p>I appreciate the transparency of those policies being written down. However, they are still policies that are largely dictated to the community (eg: relying on experts determined by CEA more heavily than EA surveys).</p>\n", "parentCommentId": "BHkTjjGL9JwLTrhqY", "user": {"username": "jooke"}}, {"_id": "qoJiphLs9Fgehicmq", "postedAt": "2023-04-30T14:33:44.979Z", "postId": "PhNfc9JRFc9CsDjvi", "htmlBody": "<p>I'd say more towards the former (unless there's a lot of moderation going on that I'm unaware of). The forum is largely self-regulating by the use of up/downvoting, which isn't possible in other avenues. There are obviously, and necessarily, some exceptions to this (eg: seperating out the community tag, the digest has a lot more curation).</p>\n", "parentCommentId": "RaCHkeDg9H5bwHb57", "user": {"username": "jooke"}}]