[{"_id": "TiweQ9urEfhHpmMna", "postedAt": "2022-09-21T11:34:28.135Z", "postId": "PiFCF7dcAxBpc5dsN", "htmlBody": "<p>It's worth noting that ensuring recovery after a near-extinction event is less robust under moral uncertainty and less cooperative given disagreements on population-ethical views than just \"prevent our still-functioning civilization from going extinct.\" In particular, the latter scenario (preventing extinction for a still-functioning civilization) is really good not just on a totalist view of aggregative consequentialism, but also for all existing people who don't want to die, don't want their relatives or friends or loved ones to die, and want civilization to go on for their personal contributions to continue to matter. All of that gets disrupted in a near-extinction collapse.&nbsp;<br><br>(There's also an effect from considerations of \"<a href=\"https://forum.effectivealtruism.org/posts/cYf6Xx8w7bt9ivbon/which-world-gets-saved\">Which worlds get saved?</a>\" where, in a post-collapse scenario, you've updated that humans just aren't very good at getting their shit together. All else equal, you should be less optimistic about our ability to pull off good things in the long-run future compared to in a world where we didn't bring about a self-imposed civilizational collapse / near-extinction event.)<br><br>Therefore, one thing that makes the type of intervention you're proposing more robust would be to also focus on improving the quality of the future conditional on successful rebuilding. That is, if you have information or resources that would help a second stage civilization to do better than it otherwise would (at preventing particularly bad future outcomes), that would make the intervention more robustly positive.&nbsp;</p><p>There's an argument to be made that extinction is rather unlikely in general even with the massive population decreases you're describing, and that rebuilding from a \"higher base\" is likely to lead to a wiser or otherwise morally better civilization than rebuilding from a lower base. (For instance, perhaps because more structures from the previous civilization are preserved, which makes it easier to \"learn lessons\" and have an inspiring narrative about what mistakes to avoid). That said, these things are hard to predict.<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefzyv9uif3al\"><sup><a href=\"#fnzyv9uif3al\">[1]</a></sup></span></p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnzyv9uif3al\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefzyv9uif3al\">^</a></strong></sup></span><div class=\"footnote-content\"><p>Firstly, we can tell probable-sounding just-so stories where slower rebuilding leads to better outcomes. Secondly, there isn't necessarily even a straightforward relationship between things like \"civilizational wisdom\" or \"civilization's ability to coordinate\" to averting some of the worst possible outcomes with earth-originating space colonization (\"s-risks\"). In particular, sometimes it's better to fail at some high-risk endeavor in a very stupid way rather than in a way that is \"almost right.\" It's not obvious where on that spectrum a civilization would end up if you just make it a bit wiser and better-coordinated. You could argue that \"being wiser is always better\" because wisdom means people will want to pause, reflect, and make use of option value when they're faced with an invention that has some chance of turning out to be a Pandora's box. However, the ability to pause and reflect again requires being above a certain threshold on things like wisdom and ability to coordinate – otherwise there may be no \"option value\" in practice. (When it comes to evaluating whether a given intervention is robust, it concerns me that EAs have historically applied the \"option value argument\" without caveats to our present civilization, which seems quite distinctly <i>below</i> that threshold the way things are going – though one may hope that we'll somehow be able to change that trajectory, which gives the basis for a more nuanced option-value argument.)&nbsp;</p></div></li></ol>", "parentCommentId": null, "user": {"username": "Lukas_Gloor"}}, {"_id": "bvhPN5bePXkAgejrb", "postedAt": "2022-09-21T13:55:51.090Z", "postId": "PiFCF7dcAxBpc5dsN", "htmlBody": "<p>Paragraph 1:</p><p>Yeah, saving humanity from [near] extinction is my Plan A.</p><p>&nbsp;</p><p>Paragraph 2+3+4:</p><p>&nbsp;I don't know how to change humanity's direction.&nbsp;</p><p>Do you think this disqualifies the project?</p>", "parentCommentId": "TiweQ9urEfhHpmMna", "user": {"username": "Soof Golan"}}, {"_id": "tdzw8SpJuq4PyyESQ", "postedAt": "2022-09-21T14:42:28.948Z", "postId": "PiFCF7dcAxBpc5dsN", "htmlBody": "<blockquote><p>Do you think this disqualifies the project?</p></blockquote><p><br>Probably not, especially not in the sense that anyone wanting to implement a low-effort version of this project should feel discouraged. (\"Low-effort versions\" of this would mostly help make the lives for people in post-apocalyptic scenarios less scary and more easily survivable, which seems obviously valuable. Beyond that, insofar as you manage to preserve information, that seems likely positive despite the caveats I mentioned!)<br><br>Still, before people start high-effort versions of the idea that go more in the direction of \"civilization re-starter kits\" (like vast storages of items to build self-functioning communities) or super bunkers, I'd personally like to see a more in-depth evaluation of the concerns.&nbsp;<br><br>For what it's worth, improving the quality of a newly rebuilt civilization seems more important than making sure rebuilding happens at all even according to the total view on population ethics (that's my guess at least – though it depends on how totalists &nbsp;<a href=\"https://ai-alignment.com/sympathizing-with-ai-e11a4bf5ef6e\">would view</a> futures controlled by non-aligned AI), so investigating whether there are ways to focus especially on wisdom and coordination abilities of a new civilization seems important also from that perspective.</p>", "parentCommentId": "bvhPN5bePXkAgejrb", "user": {"username": "Lukas_Gloor"}}, {"_id": "wjLNozQho7C5GBfCT", "postedAt": "2022-09-21T16:18:16.285Z", "postId": "PiFCF7dcAxBpc5dsN", "htmlBody": "<p>I would include all US patent information. Possibly an AI could filter this to include only 'important patents' since it's a large archive but in any case it's vital information.</p><p>So far as the computers, digital content and software are concerned... this may not remain usable. One critical part of this effort could be designing and building perdurable computer hardware so that the archive could contain one or more computers built to last for a hundred years. But I don't know how feasible this is - swapping out a few things like fans, electrolytic capacitors, thermal paste etc. that have a known limited lifetime is not <i>too</i> difficult, but if you need to re-engineer an SSD from the ground up to increase MTBF to two centuries... that's hard. I guess if failures are purely stochastic you can just pump up the redundancy to a fantastic degree.<br><br>Broadly speaking I would favor print media for this reason. Worth keeping in mind is that advanced industries have their own complex ontogeny. If population is reduced to the extent you describe, knowledge of post-1950 technology could mostly be useless to them for many generations (except as a guide to using scavenged artifacts). Even building something like a functioning railroad requires an entire small civilization.&nbsp;</p>", "parentCommentId": null, "user": {"username": "bbartlog"}}, {"_id": "bp6mEq8heEt5ej8ia", "postedAt": "2022-09-21T19:09:28.521Z", "postId": "PiFCF7dcAxBpc5dsN", "htmlBody": "<blockquote><p>I would include all US patent information</p></blockquote><p>Nice! (fwiw I'd probably aim to keep all of them and not filter)</p><blockquote><p>So far as the computers, digital content and software are concerned... this may not remain usable</p></blockquote><p>We can discuss on better solutions here, though this will be a premature optimization. I'd be perfectly happy if figured we'd need to \"refresh digital hardware\" every 20 years or so. This seems cheaper and easier than improving SSD technology to reach an MTBF of a few centuries.</p><blockquote><p>Broadly speaking I would favor print media for this reason.</p></blockquote><p>The intention is to do both, and optimistically the digital media survives and the situation will be vastly more positive than print only.</p>", "parentCommentId": "wjLNozQho7C5GBfCT", "user": {"username": "Soof Golan"}}, {"_id": "uwegm4wwep88bSyua", "postedAt": "2022-09-22T08:57:17.521Z", "postId": "PiFCF7dcAxBpc5dsN", "htmlBody": "<p>ALLFED is currently putting together a disaster response guide and collecting a few existing compendiums of civilization starter libraries, very similar to this proposal.</p>\n", "parentCommentId": null, "user": {"username": "Morgan R"}}, {"_id": "kEfvKGnbuDgAymeAQ", "postedAt": "2022-09-22T12:45:30.993Z", "postId": "PiFCF7dcAxBpc5dsN", "htmlBody": "<p>I've seen this Civ Reboot/recovery stuff proposed a few times, and it's almost always engineers proposing it :p</p><p>Civ reboot is not an engineering problem. It is not a videogame tech-tree.</p><p>Knowledge without understanding is at best useless, at worst dangerous. Technology is one big infohazard that our current civilization is often incapable of utilising responsibly and/or without damaging consequences. The prime directive exists for a reason.</p><p>If you want to provide knowledge and resources that are valuable to survivors attempting to 'reboot' civilization - provide them with knowledge about healthcare, about agriculture, about education. These will be the only questions that matter for generations: Can you have kids, can you feed them, can you educate them, can you keep everyone alive.</p><p>...I could go on for quite some time but I want to keep this short. So I'll just reiterate the massive importance of education, the similarly massive challenges involved and then &nbsp;gesture meaningfully toward the link between education &gt; psychology, and the whole other bag of infohazards therein.</p><p>Another reply alluded to this also but I want to really really emphasize it: if you want to reboot civilization, you better have really good reasons for believing it's a civilization you'd approve of.</p><p>There be a lot of skulls on this here path. Like, a lot. Like... we're hip deep in skulls for as far as the eye can see - the history of civilization is largely, albeit not entirely, dystopian.</p><p>If your grand plan for saving the human race is A.) more likely to result in a 2nd Nazi Germany (sorry for the cliche) than it is any kind of society we'd want to live in and B.) very unlikely to succeed in the first place, how exactly does it fit under the umbrella of Effective Altruism? It seems to be neither.</p>", "parentCommentId": null, "user": {"username": "Stavros"}}, {"_id": "Bk6mPDuFkHsjkzALA", "postedAt": "2022-09-22T17:53:53.750Z", "postId": "PiFCF7dcAxBpc5dsN", "htmlBody": "<p>One avenue that might be helpful in assessing impact would be to see what plans already exist for knowledge preservation in the face of disaster and what kinds of information they don't include that you think might be of vital importance.</p><p>For instance, while \"a paper copy of wikipedia\" sounds cool, preserving paper over a long time span is actually quite difficult. Archivists have special trainings in how to preserve paper and other materials.<br><br>The good news is, a lot of archivists and librarians have already thought about this specific problem. Most archives that I am familiar with have what they call a Disaster Plan. These cover everything from a \"minor\" flood that could happen tomorrow, to larger scale disasters that could happen in the future. &nbsp;These plans are specifically built to be flexible to accommodate a wide range of possible disasters that could threaten knowledge preservation. Many archives are built to survive natural disasters and keep paper copies of their records in the event of power failure. An (incomplete) list of some of their plans can be found <a href=\"https://siarchives.si.edu/what-we-do/preservation/emergency-preparedness\">here</a>. &nbsp;Of course, not every archive or library has the money to have a super-robust plan, but groups like the Smithsonian, National Archives (including the patent office), British Library, etc., have a lot of info stored in vaults for exactly these kinds of scenarios.</p><p>It could be the case that the type of information you think is most vital to save civilization is not already stored in traditional archives and libraries. For instance, <a href=\"https://www.cjr.org/tow_center_reports/the-dire-state-of-news-archiving-in-the-digital-age.php\">CJR did a report in 2019</a> that found that many newspapers, especially digital publications, do not have a good disaster plan in place. (Many newspapers solve this, however, by partnering with libraries who do the preservation work for them). Perhaps one helpful brainstorm would be what kinds of information are not already in archives/libraries, or ways you think archives/libraries could make their material more accessible post-disaster?</p><p>It also sounds like you want these kits to include <i>tools</i>. That might be a higher impact way to focus, as I don't know of a worldwide network of accessible generators, etc. But that could be really cool!</p>", "parentCommentId": null, "user": {"username": "HannahGB"}}, {"_id": "mEfAGWZrfWKbRFCsm", "postedAt": "2022-10-31T11:30:12.783Z", "postId": "PiFCF7dcAxBpc5dsN", "htmlBody": "<p>Curious what you're referring to here and if there's any publicly available information about it? Couldn't find anything in ALLFEDs 2020 and 2021 updates. (I'm trying to estimate the cost-effectiveness of this kind of project as part of my work at Rethink Priorities)</p>", "parentCommentId": "uwegm4wwep88bSyua", "user": {"username": "Buhl"}}]