[{"_id": "kMDdmpiuhBNqpxxNu", "postedAt": "2022-11-13T03:33:41.332Z", "postId": "PkFenL3DcEJDjERwY", "htmlBody": "<p>I think the EA community should have an organization full of private investigators and forensic accountants tucked away somewhere, with a broad mandate to look for problems focused on EA-connected places.</p><p>But FTX is a for-profit corporation. The fact that they're making donations doesn't give anyone the power to impose accounting standards on them; that capability is only held by government institutions with power of subpoena.</p>", "parentCommentId": null, "user": {"username": "jimrandomh"}}, {"_id": "7ufpRjNwJEdcBjWTD", "postedAt": "2022-11-13T08:28:32.076Z", "postId": "PkFenL3DcEJDjERwY", "htmlBody": "<p>I love that you're bringing discussion of the specific proposals.</p><p>I don't know about the specific finances of FTX, but I do know about audits. Auditors work based on norms, and those norms get better at predicting new disasters by learning from previous disasters (such as Enron). The same is true of air travel, one of \"the safest ways of travel\".</p><p>My guess is that the only way in which alarms would've ringed for FTX investors was by realizing that there was a \"back door\" where somebody could just steal all the money. Would a financial auditor have looked into that, the <i>programming </i>aspect of the business? I doubt it, unless specific norms were in place to look for just that.</p><p>I think that there are two specific disasters here:&nbsp;</p><ul><li>SBF's fraud, and</li><li>SBF harming the EA \"brand\"?</li></ul><p>If what we want is to avoid <strong>future</strong> fraud in the <strong>Crypto </strong>community, then the goal <strong>of the Crypto community </strong>should be to replicate the air travel model for air safety<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnref5w33p5lvscp\"><sup><a href=\"#fn5w33p5lvscp\">[1]</a></sup></span>:</p><ul><li>Strong (and voluntary) inter-institutional cooperation, and</li><li>A post-mortem of <i>every single</i> disaster in order to incorporate not regulation but \"best practices\".</li></ul><p>However, if the goal is to avoid harming the EA \"brand\", then there's a profession for that. It's called \"Public Relations\".</p><p>PR it's also the reason why big companies have rules that prevent them from (publicly) doing business with people <i>suspected </i>of doing illegal activities. (\"<i>The wife of the Caesar must not only be pure, but also be free of any suspicios of impurity</i>\")&nbsp;</p><p>For example, EA institutions could from now on:</p><ul><li>Copy GiveDirectly's approach and avoid any single donor from representing more than 50% of their income.<ul><li>Perhaps increase or decrease that percentage, depending on the impact in SBF's supported charities.&nbsp;</li></ul></li><li>Reject money that comes from Tax Havens.<ul><li>FTX was a business based mainly in The Bahamas.</li><li>I don't know what is the quality of the Bahamas standard for financial audits. In fact, I don't even know if they demand financial audits <i>at all... </i>but I know that The Bahamas is sometimes classed as a Tax Haven, and is more likely that we find criminals and frads with money in Tax Haven than outside of them.</li></ul></li><li>Incentivize their own supported charities to reject dependence on a single donor, and to reject money that comes from Tax Havens.</li><li>Perhaps also...<ul><li>... Campaign against Tax Havens?<ul><li>Tax Havens crowd out against money given to tax-deductible charities, and therefore for <i>EA </i>Charities.</li><li>There is an economic benefit to <i>some </i>of the citizens of the Tax Haven countries, but when weighted against the criminal conduct that they enable... are they truly more good than bad?</li></ul></li><li>... Create a <i>certification </i>for NGOs to be considered \"EA\"?<ul><li>Most people know that some causes (Malaria treatments, Deworming...) are well-known EA causes.<ul><li>They are causes that attract million of dollars in funding.</li></ul></li><li>Since there is no certification for NGO0s to use the name \"EA\", a fraudster-in-waiting can just<ol><li>Start a new NGO tomorrow.</li><li>\"Brand\" itself as an EA charity</li><li>See the donations begin to pour-in, and</li><li>Commit fraud in a new manner that avoids existing regulation</li><li>Profit</li><li>Give the news cycle an exciting new story, and the EA community another sleepless night.</li></ol></li></ul></li></ul></li></ul><p>In fact, fraud in NGO's happens all the time. One of the reasons why Against Malaria Foundation had trouble implementing their first Give Well charity is that they were too stringent on the anti corruption requirements for governments.</p><p>It's in the direct interest of the EA community to minimize the amount of fraudulent NGO's, and to minimize the amount of <i>EA branded</i> fraudulent NGO's.</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fn5w33p5lvscp\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnref5w33p5lvscp\">^</a></strong></sup></span><div class=\"footnote-content\"><p>In fact, at the same time that we're discussing this, a tragic air travel accident happened on a Dallas Airshow. Our efforts might be more \"effective\" by not discussing SBF and instead discussing Airshow Security and their morality.</p></div></li></ol>", "parentCommentId": null, "user": {"username": "Jesus de Sivar"}}, {"_id": "EFyfBiLafLzhDpHj8", "postedAt": "2022-11-13T12:28:21.218Z", "postId": "PkFenL3DcEJDjERwY", "htmlBody": "<p>My proposition is for prevention of future fraud. There are internal audit reviews on policies and procedures for acquisition of grants / donations that I believe now will become a good safeguard if any EA org is assessing where the money is coming from. Requiring regular Audited Financial Statements from donors and be assessed by management doesn't seem illegal or needing government approval.</p><p>Investigations after issues have taken place seems like too much of a late reaction in my opinion. Prevention through regular checks and balance is still the best approach in my opinion.</p>", "parentCommentId": "kMDdmpiuhBNqpxxNu", "user": {"username": "Miguel"}}, {"_id": "XwpHvi5pANytAX6gj", "postedAt": "2022-11-13T12:41:01.910Z", "postId": "PkFenL3DcEJDjERwY", "htmlBody": "<p>Great points here.</p><p>My problem with post mortem or investigations is that it is late of a reaction, EA image has been tarnished and the total cost of a scandal could not be computed. I still believe that installing a dedicated governance team reviewing all of the major risks where inflows and outflows of money is involved is still a better approach.</p><p>Requiring and reviewing financial statements audited by a big 4 firm is still the best approach if a certain charity/Non profit org is receiving a donation - assuring that the donor is doing its best to comply with international or American accounting standards. Audited FS submissions also solves the tax haven comment you shared though I believe legitimate companies still do have accounting standards and audit standards especially as they still need to engage in the business world. It was described that SBF has a backdoor mechanism in their books that evaded executives, accountants and auditors - if this is true, the tax haven issue is not the culprit. Btw, I live in the nearby Cayman Islands and we still do accounting here following International Accounting Standards.</p><p>&nbsp;</p><p>I have no problems with strong inter institutional cooperation but it still needs some kind of system to work with like who plays the lead and the follower in certain scenarios</p>", "parentCommentId": "7ufpRjNwJEdcBjWTD", "user": {"username": "Miguel"}}, {"_id": "hHkmK7zpHtdcfyLHT", "postedAt": "2022-11-13T20:22:00.735Z", "postId": "PkFenL3DcEJDjERwY", "htmlBody": "<p>If a charity asks a donor for financial audits, the response is going to be: <i>We</i> don't do paperwork for <i>you</i>. <i>You</i> do paperwork for <i>us</i>. Followed by giving the donation to someone else.</p>", "parentCommentId": "EFyfBiLafLzhDpHj8", "user": {"username": "jimrandomh"}}, {"_id": "JRPqcc8t5ChDytjKw", "postedAt": "2022-11-14T02:22:51.670Z", "postId": "PkFenL3DcEJDjERwY", "htmlBody": "<p>No Jim, financial audits are done quarterly, semi-annual or annual. Non-profit orgs doesn't need to request financial audits for them - if the donor is complying with IFRS or American Standards, they just need to submit or share the most recent copy of the Audited Financial Statements. If they do not have it, that is a major red flag.</p>", "parentCommentId": "hHkmK7zpHtdcfyLHT", "user": {"username": "Miguel"}}]