[{"_id": "ZKbg87HL59bkNemfy", "postedAt": "2024-02-28T20:33:56.691Z", "postId": "PkvrJ7r5wyMGnuGrD", "htmlBody": "<h1>Examples of EA errors as failures of wholesomeness</h1><p>In this comment I’ll share a few examples of things I mean as failures of wholesomeness. I don’t really mean to over-index on these examples. I actually feel like a decent majority of what I wish that EA had been doing differently relates to this wholesomeness stuff. However, I’m choosing examples that are particularly easy to talk about — around FTX and around mistakes I've made — because I have good visibility of them, and in order not to put other people on the spot. Although I’m using these examples to illustrate my points, my beliefs don’t hinge too much on the particulars of these cases. (But the fact that the “failures of wholesomeness” frame can be used to provide insight on a variety of different types of error does increase the degree to which I think there’s a deep and helpful insight here.)</p><p><strong>Fraud at FTX</strong><br>To the extent that the key people at FTX were motivated by EA reasons, it looks like a catastrophic failure of wholesomeness — most likely supported by a strong desire for expedience and a distorted picture where people's gut sense of what was good was dominated by the terms where they had explicit models of impact on EA-relevant areas. It is uncomfortable to think that people could have caused this harm while believing they were doing good, but I find that it has some plausibility. It is hard to imagine that they would have made the same mistakes if they had explicitly held “be wholesome” as a major desideratum in their decision-making.</p><p><strong>EA relationship to FTX</strong><br>Assume that we don't get to intervene to change SBF’s behaviour. I still think that EA would have had a healthier relationship with FTX if it had held wholesomeness as a core virtue. I think many people had some feeling of unwholesomeness associated with FTX, even if they couldn't point to all of the issues. I think focusing on this might have helped EA to keep FTX at more distance, not to extol SBF so much just for doing a great job at making a core metric ($ to be donated) go up, etc. It could have gone a long way to reducing inappropriate trust, if people felt that their degree of trust in other individuals or organizations should vary not just with who espouses EA principles, but with how much people act wholesomely in general.</p><p><strong>My relationship to attraction</strong><br>I had an unhealthy relationship to attraction, and took actions which caused harm. (I might now say that I related to my attraction as unwholesome — arguably a mistake in itself, but compounded because I treated that unwholesomeness as toxic and refused to think about it. This blinded me to a lot of what was going on for other people, which led to unwholesome actions.)</p><p>Though I now think my actions were wrong, at some level I felt at the time like I was acting rightly. But (though I never explicitly thought in these terms), I do not think I would have felt like I was acting wholesomely. So if wholesomeness had been closer to a core part of my identity I might have avoided the harms — even without getting to magically intervene to fix my mistaken beliefs.</p><p>(Of course this isn’t precisely an EA error, as I wasn’t regarding these actions as in pursuit of EA — but it’s still very much an error where I’m interested in how I could have avoided it via a different high-level orientation.)</p><p><strong>Wytham Abbey</strong><br>Although I still think that the Wytham Abbey project was wholesome in its essence, in retrospect I think that I was prioritizing expedience over wholesomeness in choosing to move forward quickly and within the EV umbrella. I think that the more wholesome thing to do would have been, up front, to establish a new charity with appropriate governance structures. This would have been more inconvenient, and slowed things down — but everything would have been more solid, more auditable in its correctness. Given the scale of the project and its potential to attract public scrutiny, having a distinct brand that was completely separate from “the Centre for Effective Altruism” would have been a real benefit.</p><p>I knew at the time that that wasn’t entirely the wholesome way to proceed. I can remember feeling “you know, it would be good to sort out governance properly — but this isn’t urgent, so maybe let’s move on and revisit this later”. Of course there were real tradeoffs there, and I’m less certain than for the other points that there was a real error here; but I think I was a bit too far in the direction of wanting expedience, and expecting that we’d be able to iron out small unwholesomenesses later. Leaning further towards caring about wholesomeness might have led to more-correct actions.</p>", "parentCommentId": null, "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "5kfTw8Poe3riRdTCw", "postedAt": "2024-02-29T20:39:34.806Z", "postId": "PkvrJ7r5wyMGnuGrD", "htmlBody": "<p><strong>Executive summary</strong>: Acting wholesomely feels aligned with commonsense morality but has tensions with some EA principles like \"shut up and multiply\". However, a \"wholesome EA\" perspective can incorporate the value of EA while avoiding unwelcome implications.</p><p><strong>Key points:</strong></p><ol><li>Wholesome action considers the whole system rather than maximizing narrow metrics. This contrasts with a \"straw EA\" fixation on the most important things.</li><li>Wholesome EA subsumes EA priorities into a larger concern for constructive participation in communities. It avoids unwholesome implications like neglecting loved ones.</li><li>Central challenges are balancing wholesomeness and expedience, and allocating attention between global and local concerns.</li><li>Many EA mistakes reflect failures of wholesomeness like single-minded over-focus or refusal to consider certain effects. A wholesome EA could help avoid such errors.</li></ol><p>&nbsp;</p><p>&nbsp;</p><p><i>This comment was auto-generated by the EA Forum Team. Feel free to point out issues with this summary by replying to the comment, and</i><a href=\"https://forum.effectivealtruism.org/contact\"><i>&nbsp;<u>contact us</u></i></a><i> if you have feedback.</i></p>", "parentCommentId": null, "user": {"username": "SummaryBot"}}, {"_id": "xp2dNrMX9A8A36MJT", "postedAt": "2024-02-29T22:06:46.919Z", "postId": "PkvrJ7r5wyMGnuGrD", "htmlBody": "<p>Having complained about the summary on the last one, I thought I should say that this summary seems pretty decent :)</p>", "parentCommentId": "5kfTw8Poe3riRdTCw", "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "jszyappn85J49u5eG", "postedAt": "2024-02-29T23:08:25.570Z", "postId": "PkvrJ7r5wyMGnuGrD", "htmlBody": "<blockquote><p>Again, I don’t think my picture here is a stretch from the normal English sense of the word “wholesomely”.</p></blockquote><p>The more I read of these essays the less I agree with this. On my subjective authority as a native English speaker, your usage seems pretty far from the normal sense to me. I think what you're gesturing at is a reasonable concept but I think it's quite confusing to call it \"wholesome\".&nbsp;</p><p>As some evidence, I kept finding myself having to reinterpret sentences to use your meaning rather than what I would consider the more normal meaning. For example, \"What is wholesome depends on the&nbsp;<i>whole</i> system.\" This is IMO kind of nonsensical in normal English.</p>", "parentCommentId": null, "user": {"username": "Michael_PJ"}}, {"_id": "aSitHtBM8Ft6G6GHK", "postedAt": "2024-02-29T23:46:36.221Z", "postId": "PkvrJ7r5wyMGnuGrD", "htmlBody": "<p>I'm guessing that the word is just used differently in different contexts or circles? Your comment made me wonder how much I was just stuck in my own head about this. So I asked ChatGPT about the sentence you're labelling as nonsensical, and it said:</p><blockquote><p>Saying that what is considered \"wholesome\" depends on the whole system is not nonsensical at all; in fact, it's a quite nuanced and comprehensive way of understanding wholesomeness.&nbsp;<br><br>[...]<br><br>In summary, suggesting that the concept of wholesomeness is contingent upon the entire system in which it is considered encourages a thoughtful, comprehensive approach to ethics and morality. It's a recognition of complexity in determining what is good or beneficial, which is both rational and pragmatic.</p></blockquote><p>Of course I guess that ChatGPT is pretty good at picking up on meanings which are known <i>anywhere</i>, so this is evidence more that I'm aligning with <i>one</i> existing usage of the word, rather than that all native English speakers will understand it that way (and you're providing helpful evidence against the latter claim).</p>", "parentCommentId": "jszyappn85J49u5eG", "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "mo4RuCwnapxnXht2b", "postedAt": "2024-03-01T04:26:05.613Z", "postId": "PkvrJ7r5wyMGnuGrD", "htmlBody": "<p>The same could be said about e.g. many fake aphorisms people come up with. Something can function to make you pause for thought, but still be nonsensical.</p>\n<p>It’s also obvious that ChatGPT is bullshitting because such a short sentence is almost by definition not “comprehensive”</p>\n", "parentCommentId": "aSitHtBM8Ft6G6GHK", "user": {"username": "bec_hawk"}}, {"_id": "YzayaXsdvxqWnuEiC", "postedAt": "2024-03-01T09:20:13.493Z", "postId": "PkvrJ7r5wyMGnuGrD", "htmlBody": "<p>OK, fair complaint.</p><p>Another data point that this is how some other people understand the word is this <a href=\"https://www.lesswrong.com/posts/Cb7oajdrA5DsHCqKd/acting-wholesomely?commentId=BqT2nk362sBDNHbSM\">comment by Gordon S Worley</a> on LessWrong:</p><blockquote><p>I don't think it has to be hard to say what wholesomeness is. I don't know what you mean by the word, but to me it's simply acting in a way that has compassion and respect to everything, leaving nothing out. Very hard to do, but easy enough to state.</p></blockquote>", "parentCommentId": "mo4RuCwnapxnXht2b", "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "eBHvFbsEvFh25agdC", "postedAt": "2024-03-01T14:43:57.530Z", "postId": "PkvrJ7r5wyMGnuGrD", "htmlBody": "<p>I think that's just a minority of people retroactively imagining an additional meaning to the word. The 'whole' in wholesome is in contrast to being injured, not in contrast to something being partial. so you get: uninjured -&gt; healthy -&gt; beneficial -&gt; morally good. Nothing to do with examining parts vs wholes.</p>", "parentCommentId": "YzayaXsdvxqWnuEiC", "user": {"username": "bec_hawk"}}, {"_id": "XNJnavtgar62N2eGz", "postedAt": "2024-03-01T14:46:28.215Z", "postId": "PkvrJ7r5wyMGnuGrD", "htmlBody": "<p>('Wholesome' was a word ('hailasam') before English was even its own language, when whole/hail primarily meant being healthy. So it pretty much bypasses the idea of 'leaving nothing out'. It's like saying that a brainstorming session has to be some sort of violent, disturbing process because it contains the word 'storm' in it. Indeed there's a completely separate meaning for 'brainstorm' which is more like this - a moment of mental confusion essentially, which is basically the opposite of a brainstorming session.)</p>", "parentCommentId": "eBHvFbsEvFh25agdC", "user": {"username": "bec_hawk"}}, {"_id": "8zFEbeNRBroHqQqdA", "postedAt": "2024-03-01T15:20:06.357Z", "postId": "PkvrJ7r5wyMGnuGrD", "htmlBody": "<p>I appreciate the etymological details, and feel a bit embarrassed that I hadn't looked into that already.</p><p>I guess I'd describe what's going on as:</p><ul><li>The original word meant \"healthy\"</li><li>I'm largely using it to mean \"healthy\" in the sense of \"healthy for the systems we're embedded in\" (which I think is a pretty normal usage)</li><li>I'm adding a flavour of \"attending to the wholeness\" (inspired by Christopher Alexander), which includes both \"attending to all the parts\" (new) as well as \"attending to making things fit with existing parts\" (essentially an existing meaning, as this is part of healthy)</li><li>This is vibe-wise supported by the presence of the string \"whole\" as part of \"wholesome\"<ul><li>This makes it easier for me (and I guess others) to conceive of and remember this extra sense</li><li>However, it's etymologically just a coincidence</li></ul></li></ul><p>Does that seem fair?</p>", "parentCommentId": "XNJnavtgar62N2eGz", "user": {"username": "Owen_Cotton-Barratt"}}]