[{"_id": "zWNvPBES2mCZFjHcW", "postedAt": "2022-10-05T21:39:42.502Z", "postId": "PMcoYMtA5LiLXpzk2", "htmlBody": "<p>will add events to the opportunity to the <a href=\"https://ea-internships.pory.app/\">EA opportunity board</a>!</p>", "parentCommentId": null, "user": {"username": "Jessy W"}}, {"_id": "H7MpHJjwRQvCrjqkd", "postedAt": "2022-10-05T21:56:00.103Z", "postId": "PMcoYMtA5LiLXpzk2", "htmlBody": "<p>Excited about EA Global? The <a href=\"https://www.centreforeffectivealtruism.org/\">Centre for Effective Altruism</a>'s Events Team is <a href=\"https://efctv.org/jobs\">hiring for multiple roles</a>, including an <a href=\"https://efctv.org/3ymtW0h\">EA Global Events Associate</a>. The deadline for applying is next Tuesday, October 11!</p><p><i>This is a test by the EA Forum Team to gauge interest in job ads relevant to posts - &nbsp;</i><a href=\"https://docs.google.com/forms/d/e/1FAIpQLSez8LIh4zKj26Ok63mmvB2mueYFrvtCHvG5tVq3uPYHZO3Mgg/viewform?usp=pp_url&amp;entry.1792284488=CEA+Events+Team\"><i>give us feedback here</i></a><i>.</i></p>", "parentCommentId": null, "user": {"username": "syc"}}, {"_id": "nQroznXSvimYBz2Q7", "postedAt": "2022-10-06T17:35:30.291Z", "postId": "PMcoYMtA5LiLXpzk2", "htmlBody": "<p>I am so happy &nbsp;and excited that EAG London is scheduled around the Ascension weekend, this will make it significantly easier to attend (if I get accepted of course). &nbsp;</p>", "parentCommentId": null, "user": {"username": "ThomasFowl"}}, {"_id": "EN8fDZxumBW77NLuD", "postedAt": "2022-10-07T16:59:26.031Z", "postId": "PMcoYMtA5LiLXpzk2", "htmlBody": "<p>Thank you for all your amazing work in connecting people to make the world a better place. I have some feedback on the following:</p><p>\"We expect applications for the other conferences to open approximately 2 months before the event\"</p><p>After the pandemic, visa admissions have slowed down quite significantly. \"Priority Service\" option for UK visas wasn't available when I applied for a visa for the EAGx Oxford in 2021. A friend of mine has waited 6 weeks until he received his UK visa, which is not so uncommon. Similarly, earliest tourist visa appointment I can get from US embassy is for 2024. If applicants from countries with \"weaker\" passports were allowed to apply earlier, that would help with accessibility and inclusivity.</p>", "parentCommentId": null, "user": {"username": "emre kaplan"}}, {"_id": "wZJNMw37ntPguPw5A", "postedAt": "2022-10-10T20:12:00.193Z", "postId": "PMcoYMtA5LiLXpzk2", "htmlBody": "<p>Yeah, thanks for raising this!</p><p>The conferences you're referring to are all EAGx events which primarily serve the region the conference is based in. This means the organisers aren't expecting many applicants to require visas. Earlier this year, before we had confirmed more conferences around the world, serving more of the community, we accepted some people to events like EAGxOxford from further afield.</p><p>Applications for EA Global will open much earlier for this reason, though that won't solve the problem for the US.</p><p>We know that, even with long application timelines, visas are just very difficult for some people to get for some countries. Timelines aren't the only problem; we see lots of visa rejections too. We're hoping to run more events like EAGxVirtual and EAGxSingapore, which are more accessible to those people and we're improving our visa process to make applications stronger and ensure they're processed faster.</p><p>All to say, we're working on making these events more accessible, but we're not nailing it yet.</p>", "parentCommentId": "EN8fDZxumBW77NLuD", "user": {"username": "OllieBase"}}, {"_id": "8aHX93zYW5Z7d6jnF", "postedAt": "2022-10-10T20:27:00.113Z", "postId": "PMcoYMtA5LiLXpzk2", "htmlBody": "<p>I am glad to learn that applications for EAG London will open much earlier, that wasn't clear to me from the text. For me that solves much of the problem.</p><p>I understand that there must be operational costs of opening admissions much earlier and you have to balance many trade-offs. I just wanted to signal this issue so that it can be taken into account in your decision-making. I think you are doing a great job, thank you for everything!</p>", "parentCommentId": "wZJNMw37ntPguPw5A", "user": {"username": "emre kaplan"}}, {"_id": "b6eTE7esMzNzj9WQB", "postedAt": "2022-10-10T21:33:58.833Z", "postId": "PMcoYMtA5LiLXpzk2", "htmlBody": "<p>Thanks Emre!</p>", "parentCommentId": "8aHX93zYW5Z7d6jnF", "user": {"username": "OllieBase"}}, {"_id": "7sMGnN7LCYZ8mzRRT", "postedAt": "2022-10-21T05:53:08.724Z", "postId": "PMcoYMtA5LiLXpzk2", "htmlBody": "<p>Thank you for the preparations for these global events that are soon happening, this will help very many people in their well being in all conners of the world.\nFor the forthcoming EA Global, what are some of the best collifications for on to attend to people like me who are interested in serving people and willing to learn more? Thank you</p>\n", "parentCommentId": null, "user": {"username": "MUHINDO JOEL "}}]