[{"_id": "XboaE7aoswvuRXttP", "postedAt": "2023-03-20T19:04:24.588Z", "postId": "PMFoxr62AeLEwPAH9", "htmlBody": "<p>As an outsider to technical AI work, I find this piece really persuasive.</p><p>Looking at my own field of US politics and policymaking, there are a couple of potentially analogous situations that I think offer some additional indirect evidence in support of your argument. In both of these examples, the ideological preferences of employees and job candidates seem to impact the behavior of important political actors:</p><ul><li>The lefty views of software engineers and similar non-journalist employees at the <i>New York Times</i> <a href=\"https://nymag.com/intelligencer/2020/11/inside-the-new-york-times-heated-reckoning-with-itself.html#:~:text=Of%20all%20the%20fronts%20on%20which%20the%20Times%20was%20being%20pushed%20to%20change%2C%20the%20strongest%20insurrectionary%20energy%20was%20coming%20from%20legions%20of%20newsroom%2Dadjacent%20employees%20in%20digital%20jobs%20that%20didn%E2%80%99t%20exist%20a%20decade%20ago\">seem</a> to have strongly contributed to the outlet's shift toward more socially progressive reporting in recent years. This makes me more confident that candidates for roles in AI labs not explicitly related to safety can still exert meaningful influence on the safety-related actions of these labs (including by expressing safety-related preferences in the hiring process as you suggest - and potentially also through their actions during continued employment, akin to the NYT staffers' slacktivism? Though this strikes me as potentially riskier)</li><li>Some commentators <a href=\"https://www.politico.com/news/magazine/2021/10/09/david-shor-democrats-privileged-college-kid-problem-514992\">like David Shor</a> argue that the progressive rank-and-file staffers for Democratic politicians pull these politicians meaningfully to the left in their policies and messaging. I think this is probably because being very progressive correlates with one's willingness to jump through all the hoops needed to eventually land a Dem staffer role (e.g. getting a relevant degrees, working as an unpaid intern and/or campaign volunteer, and generally accepting lower pay and less job security than feasible alternative careers). I think it's plausible that analogous situations happen in the Republican party, too, swapping \"conservative rank-and-file\" staffers for progressive ones.</li></ul>", "parentCommentId": null, "user": {"username": "ryanywho"}}]