[{"_id": "CXiGoqBwajjwEetxy", "postedAt": "2024-03-15T12:39:21.985Z", "postId": "Pnv6PRyeCPZknsbEw", "htmlBody": "<p>Super interesting. Based on my understanding of CE's thinking, would not doing something 5x more cost effective than the second best, in a cause area that falls a bit below the cost-effectiveness that EA is interested in, still be EA-aligned? I mean the counterfactual impact can still be huge if you are affecting thousands or millions of lives and moving large amounts of money/resources and doing this much more cost effectively than the best, existing player. A proof point would be a CE-incubated charity that now is absorbing significant funding from either something like USAID, Bill and Melinda Gates Foundation or similar.</p>", "parentCommentId": null, "user": {"username": "Ulrik Horn"}}, {"_id": "yoALhocxEBx7Gm7DB", "postedAt": "2024-03-15T13:34:58.394Z", "postId": "Pnv6PRyeCPZknsbEw", "htmlBody": "<p>This is very interesting, I hadn't heard of TBP before, thanks for sharing.</p>\n", "parentCommentId": null, "user": {"username": "Larks"}}, {"_id": "NFEHDz5qfHT2RFCtN", "postedAt": "2024-03-15T15:03:53.284Z", "postId": "Pnv6PRyeCPZknsbEw", "htmlBody": "<p>I think this is key. I get the impression (and others do as well) that EA is all-or-nothing. Either you give 100% to AMF or you are not EA.&nbsp;</p><p>A private foundation that is focused on the state of New York can use EA principles in trying to identify the biggest impact they can have, <i>within their constraints</i>, and that is still EA. I think even the cause area constraints that are the least EA (say, the arts), can still find ways to improve their impact using EA principles. Though of course that would be more difficult.</p>", "parentCommentId": "CXiGoqBwajjwEetxy", "user": {"username": "Kyle Smith"}}, {"_id": "JuJpuHi4BEiccvpSo", "postedAt": "2024-03-15T15:35:59.779Z", "postId": "Pnv6PRyeCPZknsbEw", "htmlBody": "<p>Fwiw, I don't know anybody actively promoting 'EA has to be all-or-nothing.' Like, there's not an insider group of EA thought leaders who have decided that either you give \"100% to AMF or you're not an EA.\" I'm not denying that that vibe can be there though; I guess it may just be more of a cultural thing, or the product of a mostly maximizing philosophy.</p><p>Context: As part of CEA events team I help organize and attend a lot of events that draw EA thought-leaders.&nbsp;</p>", "parentCommentId": "NFEHDz5qfHT2RFCtN", "user": {"username": "MJusten"}}, {"_id": "BbKycNn25k7EaAE48", "postedAt": "2024-03-15T15:39:34.131Z", "postId": "Pnv6PRyeCPZknsbEw", "htmlBody": "<p>Interesting post!</p><blockquote><p>these PF basically think being EA-aligned means you have to be a major pain in the ass to your grantees.</p></blockquote><p>This surprised me. I wonder why this is the case? Maybe from early GiveWell charity investigations where they made the charities do a lot of reporting? My experience with EA grantmakers is that they're at least very aware of the costs of overhead and try hard to avoid red tape.</p>", "parentCommentId": null, "user": {"username": "MJusten"}}, {"_id": "mAgBaCLHgqqnBbLSo", "postedAt": "2024-03-15T15:49:06.531Z", "postId": "Pnv6PRyeCPZknsbEw", "htmlBody": "<p>Yeah I am really only referring to a <i>perception</i> of all-or-nothing. And like you say, I think it is a product of a maximizing philosophy.&nbsp;</p><p>At the end of the day, it really just seems to be an EA marketing/outreach problem, and I think it is entirely addressable by the community. I think the paper idea I mention (discussing the perceived incompatibility of TBP and EA) could be a step in the right direction.</p>", "parentCommentId": "JuJpuHi4BEiccvpSo", "user": {"username": "Kyle Smith"}}, {"_id": "nhuYQkmHCLCpCqCmv", "postedAt": "2024-03-15T15:49:53.062Z", "postId": "Pnv6PRyeCPZknsbEw", "htmlBody": "<p>Yes I think this is an area of misconception that could be explored more and ultimately addressed.</p>", "parentCommentId": "BbKycNn25k7EaAE48", "user": {"username": "Kyle Smith"}}, {"_id": "HE5mHWZPtGjwgkA7z", "postedAt": "2024-03-15T15:55:23.892Z", "postId": "Pnv6PRyeCPZknsbEw", "htmlBody": "<p>I think the key actual difference (vs perceived as you point out), is whether you think those constraints are good or not.</p>\n", "parentCommentId": "NFEHDz5qfHT2RFCtN", "user": {"username": "bec_hawk"}}, {"_id": "P74qu9qtCFWZvxe3p", "postedAt": "2024-03-15T16:23:16.283Z", "postId": "Pnv6PRyeCPZknsbEw", "htmlBody": "<p>My sense is that EA, and especially GiveWell, made some enemies in the early days by shining a light on how badly the philanthropic sector was performing. So you got stuff like Charity Navigator describing Effective Altruism as an “elitist philosophy”. Particularly early on, GiveWell was not shy about criticizing big incumbents like UNICEF or Kiva. This probably helped attract attention, but I doubt it helped make friends.</p>\n<p>Maybe this is inevitable — maybe only an outsider movement would be able to accomplish what GiveWell has — but it’s not so surprising that an industry being disrupted has negative feelings about the disrupters.</p>\n<p>Needless to say there is a sad truth here, that since most foundations are not accountable to effectiveness they can put their own feelings first.</p>\n", "parentCommentId": null, "user": {"username": "Ian Turner"}}, {"_id": "TBiJGjw69ccgRcfWR", "postedAt": "2024-03-15T16:33:22.558Z", "postId": "Pnv6PRyeCPZknsbEw", "htmlBody": "<p>It's pretty clear to me that these constraints are bad (and to me <i>core EA</i> is partially about breaking the self-imposed constraints of giving) but the simple reality is that private foundations are legally required to follow their charter. If the board wanted to radically change their charter, in most instances they could (my understanding), but boards tend to be extremely deferential to the founder's original intent. They begin with a fundamental assumption: \"We will focus our giving on X cause area or Y geographic area\" and then they have the power to make decisions beyond that.</p><p>The concern I have is that EA has basically written off all private foundations that are not already EA-aligned as a lost cause.</p>", "parentCommentId": "HE5mHWZPtGjwgkA7z", "user": {"username": "Kyle Smith"}}, {"_id": "5gsybjy6uAqsLmn7R", "postedAt": "2024-03-15T16:37:55.586Z", "postId": "Pnv6PRyeCPZknsbEw", "htmlBody": "<p>There certainly was a perception among who we spoke with that EA was very \"white/tech bro/elitist\", so I think you are correct in that assessment.</p><p>Your point about PF accountability is well-taken as well. There is functionally 0 accountability in regards to effectiveness.</p>", "parentCommentId": "P74qu9qtCFWZvxe3p", "user": {"username": "Kyle Smith"}}, {"_id": "wjH9BTSXyoDTsNa3q", "postedAt": "2024-03-15T16:48:02.101Z", "postId": "Pnv6PRyeCPZknsbEw", "htmlBody": "<p>Could the main difference be that TBP is a simple process change with reduced costs, while EA-style giving would fundamentally alter grant evaluation requiring more overhead from the funder.</p><p>I also think EA would involve extra costs to existing grantees, they will have to provide more evidence of their effectiveness or lose out to orgs that have those systems in place.</p><p>&nbsp;</p><p>Separately I think it will be very hard to get existing foundations to shift to use more EA frameworks unless their main donors become interested in it. There is probably more to be gained by finding and helping the UHNW people/orgs that are inclined towards EA already.</p>", "parentCommentId": null, "user": {"username": "DavidNash"}}, {"_id": "kabAtoj8f2MD5cDm3", "postedAt": "2024-03-15T18:22:59.369Z", "postId": "Pnv6PRyeCPZknsbEw", "htmlBody": "<p>If my goal is to help other people make their donations more effective, and I can either:</p>\n<ol>\n<li>move $1 million from a median charity to AMF</li>\n<li>move $10 million from a median art-focused charity to the most effective art-focused charity</li>\n</ol>\n<p>I would prefer to do #1 because AMF is &gt;10x better (maybe even &gt;1000x better) than the best art charity. So while in theory I would encourage an art-focused foundation to make more effective donations within their area, I don't think trying to do that would be a good use of my time.</p>\n", "parentCommentId": "NFEHDz5qfHT2RFCtN", "user": {"username": "MichaelDickens"}}, {"_id": "uKTXA3QJ3Njnnhr9D", "postedAt": "2024-03-15T20:43:36.170Z", "postId": "Pnv6PRyeCPZknsbEw", "htmlBody": "<p>I think this is a really important area, and one I've been doing some research / thinking about on my own as well. Two recommendations: CE/AIM has a <a href=\"https://www.impactfulgrantmaking.com/\">grantmaker training program</a> that does great work in this space. This also reminds me of a SSIR piece by Ian David Moss about expanding the remit of EA: <a href=\"https://ssir.org/articles/entry/in_defense_of_pet_causes.\">https://ssir.org/articles/entry/in_defense_of_pet_causes.</a>&nbsp;</p>", "parentCommentId": null, "user": {"username": "Sarah H"}}, {"_id": "EynP3x9dpdTKFvogd", "postedAt": "2024-03-15T21:45:38.325Z", "postId": "Pnv6PRyeCPZknsbEw", "htmlBody": "<p>That's fair. Though I would counter that GiveWell says that they have directed $2 billion over 10+ years to effective charities. Private Foundations in the US give collectively around $100 billion a year. So there is a lot of money out there with potential to be influenced.</p>", "parentCommentId": "kabAtoj8f2MD5cDm3", "user": {"username": "Kyle Smith"}}, {"_id": "azjbyGgaTGALfsSML", "postedAt": "2024-03-15T21:46:30.814Z", "postId": "Pnv6PRyeCPZknsbEw", "htmlBody": "<p>The grantmaker training program I think may be the best intervention in this space. Training grantmakers and getting them hired at major US private foundations, where they will ultimately have great influence on where funds are directed, has massive potential.</p>", "parentCommentId": "uKTXA3QJ3Njnnhr9D", "user": {"username": "Kyle Smith"}}, {"_id": "uoC5gnEEiYBSvknrP", "postedAt": "2024-03-15T22:47:20.305Z", "postId": "Pnv6PRyeCPZknsbEw", "htmlBody": "<p>Yes, although that's a relatively restricted (and often unusually low-impact) focus for a foundation. Even within often average-impact-per-$ remits like education, research, medical care, and geographic-area benefit, it is more plausible to envision grants with very good impact even if not full AMF level.</p>\n", "parentCommentId": "kabAtoj8f2MD5cDm3", "user": {"username": "Jason"}}, {"_id": "fgvCxJNMiga8ykJvE", "postedAt": "2024-03-16T16:57:02.859Z", "postId": "Pnv6PRyeCPZknsbEw", "htmlBody": "<p>It seems like both EA and non-EA private foundations' grantmaking is only really accountable to their funders, so I guess that also means the question has to be asked one level up: why haven't EAs convinced more major funders of the merits of their approach?</p><p>I suspect Ian is right that EA's approach hasn't always been geared towards making friends. And there's never going to be much common ground between EA and an arts endowment foundation. But I'd question whether <i>the foundations</i> in general felt they were being disrupted: it was mostly the major multinational charities being accused of wasting money and misleading with their marketing to the general public, whilst the grant-makers in foundations funding health/development overseas would typically be familiar with RCTs and cost benefit analysis, and possibly wishing they had the internal resource to be as thorough and as public in their evaluations as GiveWell...</p><p>(I'm also curious what sort of conversations might have taken place between the likes of GiveWell and Rethink Priorities and broadly aligned foundations at various times, if anyone can shed any light on that?)</p><p>I also suspect that (beyond direct differences with Charity Navigator) the perception of EA being more \"elitist philosophy\" than a rigorous approach has been shaped more by later developments: after being the disruptive upstarts that criticised incumbent orgs even in \"high impact\" fields for spending big on stuff unsupported by evidence like capacity building initiatives, EA orgs pivoted towards running capacity building initiatives of their own, only more internally-focused and sometimes more lavish, and the general advice for improving your chances of EA-funding became \"network\". Most of the more recent criticism of EA has been of the movement rather than the methods, and it certainly hasn't been based on the idea it's too rigorous...</p><p>I'd be certainly be interested in more posts on what methodology other foundations use(d). I suspect a lot of them use(d) something not dissimilar to the ITN framework and/or cost/benefit analysis without the EA gloss (and sometimes within different constraints). I think there's a lot of merit in assessing where there's common ground and points of difference. Would be interesting to hear what motivates the transition to TBP as well, especially if it's foundations taking a decision to reduce the amount of impact calculation they do themselves.</p>", "parentCommentId": "5gsybjy6uAqsLmn7R", "user": {"username": "David T"}}, {"_id": "Peb9CZY26rxM2Z28r", "postedAt": "2024-03-18T01:27:05.300Z", "postId": "Pnv6PRyeCPZknsbEw", "htmlBody": "<p>It seems great! Also their program trains grantmakers who are <i>currently</i> working at foundations (though not the absolute biggest ones, to my understanding) so that's even better</p>", "parentCommentId": "azjbyGgaTGALfsSML", "user": {"username": "Sarah H"}}, {"_id": "nvekgKmKwdTpQeuZ8", "postedAt": "2024-03-22T16:39:31.433Z", "postId": "Pnv6PRyeCPZknsbEw", "htmlBody": "<blockquote><p>I think a place where there is a disconnect is that these PF basically think being EA-aligned means you have to be a major pain in the ass to your grantees.</p></blockquote><p>The more I think about this, the more strange it seems to me. At least for the grant-making processes I'm familiar with, there is very little burden on the applicants/grantees. They will in a short (by the standards of grant applications) form that indicates what information is required, maybe answer a few follow-up questions (or maybe not) and then get the money with very few follow-ups. In contrast my understanding of government grantmakers is they require a lot more paperwork and are much more time consuming. PIs at major universities seem to spend a huge fraction of their time fundraising - that is not my impression of EA org leaders. If anything I think EA grantees would generally like more ongoing engagement and feedback from grantmakers.</p>", "parentCommentId": null, "user": {"username": "Larks"}}, {"_id": "PceqsdqumBbChi2pA", "postedAt": "2024-03-22T18:15:24.621Z", "postId": "Pnv6PRyeCPZknsbEw", "htmlBody": "<p>My sense is that there is a lot of impact to be made from just convincing US foundations to donate to charities abroad, which is probably more tractable than selling EA as an entire concept, and is still very compatible with TBP.</p><p>(In my opinion they are basically correct about TBP and EA being incompatible!)</p>", "parentCommentId": null, "user": {"username": "freedomandutility"}}, {"_id": "MsdfMm3f2j4Qi9KDt", "postedAt": "2024-03-24T16:25:47.474Z", "postId": "Pnv6PRyeCPZknsbEw", "htmlBody": "<p>Extremely interesting article -and I'd love to see other posts exploring your assumptions!<br><br>I had a chance to meet a private foundation's leader in Europe recently (raising and donating several millions / year). Interestingly, they also mentioned TBP and I'm now wondering whether it was to somehow position themselves as opposed to some sort of highly demanding grantmaking.</p><p>I do think TBP and EA are compatible, to some degree. We should not confuse (1) \"having a very high bar for anticipated effectiveness\" and (2) \"having a very high bar for evidence of impact\". It <i>is</i> quite simple to apply for a grant from most EA grantmakers. In my (certainly limited) experience, if you want your grant to be renewed (and, supposedly, increased), you'll probably have to provide significant evidence, and I think it's fair enough.</p><p>I suppose non-EA funders might:<br>- Have actually little knowledge of EA or the EA funding landscape<br>- Be discouraged by the depth of analysis that they can see from GiveWell<br>- Be annoyed or discouraged by EA's frequent, strong claim of \"making decisions based on evidence\" (btw, this claim is so often advertized that I'd assume that it can be conflated with a reliance on frequent reports from and control over grantees).</p><p>Also, maybe it's be worth distinguishing different cases, in particular:</p><ul><li>Funders of \"traditional\" animal welfare or GHD charities;</li><li>Funders of more \"exotic\" projects (global catastrophic risks, community-building, forecasting...), which usually cannot rely as much on historical data for evaluation.</li></ul>", "parentCommentId": null, "user": {"username": "GuillaumeVrx"}}]