[{"_id": "yafQASGv7xR7Rce3Q", "postedAt": "2023-10-09T21:01:30.993Z", "postId": "PsES3ffAyHGCDKP9e", "htmlBody": "<p>Thanks guys! I support what you were saying about application timeliness, expectation management, etc. This seems like a super reasonable set of norms.&nbsp;</p><p>I overall thought you crushed it, no notes, etc. My literal only grievance was that there were a bajillion forlorn nametags on the table of people I <i>specifically</i> had important world-saving business to check in with on, so the no-shows definitely lowered my productivity at the conf. I ended up being surprised by great discussions that popped up in spite of not having the ones I had hoped to, so I'm not complaining.&nbsp;</p><p>I was one of the \"not supposed to be on that coast that weekend\" people who had a bunch of stuff fall apart / come together at the last minute, it <i>literally</i> was the wednesday or thursday of the week itself that I was confident I would not be tied up in california---- so I'm wondering, should I have applied on time with an annotated application \"I'm 90% sure I can't make it, but it'll be easier for me to be in the system already if we end up in the 10% world\"? At this point, it becomes important for me to update the team so I don't impose the costs like the forlorn nametags or anything else discussed in post, but those updates themselves increase the overall volume of comms / things to keep track of for both me and the staff, which is also a cost.&nbsp;</p><p>Even if my particular case is too extreme and unusual to apply to others, I hope norms or habits get formed in the territory of \"trying to be thoughtful at all\" cuz it sounds like we're at the stage where we only have to be directionally correct.&nbsp;</p>", "parentCommentId": null, "user": {"username": "quinn"}}, {"_id": "QeuncCmzfiKj3tYmP", "postedAt": "2023-10-09T21:12:15.518Z", "postId": "PsES3ffAyHGCDKP9e", "htmlBody": "<p>I really appreciate and agree with \"trying to be thoughtful at all\" and \"directionally correct,\" as the target group to be nudged is those who see a deadline and wait until the end of the window (to look at it charitably, maybe they don't know that there's a difference in when they apply. So we're just bringing it to their attention.)</p>\n<p>We appreciate that there are genuine cases where people are unsure. I think in your case, the right move would've been to apply with that annotation; you likely would have been accepted and then been able to register as soon as you were sure.</p>\n", "parentCommentId": "yafQASGv7xR7Rce3Q", "user": {"username": "Arthur Malone"}}, {"_id": "ipECi8esWccJeTBWG", "postedAt": "2023-10-09T22:11:18.049Z", "postId": "PsES3ffAyHGCDKP9e", "htmlBody": "<p>That sounds great, kudos to the events team and the volunteers!</p><blockquote><p>Most respondents of the attendee survey indicated a high likelihood of recommending a similar event (8.94/10), and many complaints were for impossible-to-optimize variables (e.g. a roughly balanced number of respondents indicated that talks were “too general” vs “too niche”).</p></blockquote><p>This is a nitpick, but it's not clear to me that that example is impossible to optimize. For example, maybe you could increase the variance in how general/niche talks are. If 50% of talks are really general, and 50% of talks are super niche, maybe that would satisfy more people than the status quo!</p>", "parentCommentId": null, "user": {"username": "Erich_Grunewald"}}, {"_id": "MqscvckoXkrsBhNy6", "postedAt": "2023-10-10T03:59:41.071Z", "postId": "PsES3ffAyHGCDKP9e", "htmlBody": "<p>Thanks for the kind words!</p>\n<p>To address the nit: Before changing it to \"impossible-to-optimize variables,\" I had \"things where it is impossible to please everyone.\" I think that claim is straightforwardly true, and maybe I should have left it there, but it doesn't seem to communicate everything I was going for. It's not just that attendees come in with mutually exclusive preferences, but from the organizers perspective it is practically impossible to chase optimality. We don't have control over everything in presenters' talks, and don't have intimate knowledge of every attendees' preferences, so complaints are, IMHO, inevitable (and that's what I wanted to communicate to future organizers).</p>\n<p>That said, I think we could have done somewhat better with our content list, mostly via getting feedback from applicants earlier so we could try to match cause-area supply and demand. For content depth, we aimed for some spread but for the majority of talks to be clustered on the medium-to-high side of EA familiarity (i.e. if a \"1\" was \"accessible to anyone even if they've never heard of EA\" and \"10\" was \"only useful to a handful of professional EA domain experts,\" then we aimed for a distribution centered around 7. We only included talks at the low end if we considered them uniquely useful, like a \"How to avoid burnout\" talk that, while being geared towards EAs, did not require lots of EA context).</p>\n<p>I think, given that we selected for attendees with demonstrated EA activity, that this heuristic was pretty solid. Nothing in the feedback data would have me change it for the next go-around or advise other organizers to use a different protocol (unless, of course, they were aiming for a different sort of audience). But I'm happy for anyone to offer suggestions for improvement!</p>\n", "parentCommentId": "ipECi8esWccJeTBWG", "user": {"username": "Arthur Malone"}}, {"_id": "TtbGnpFqQ2d9JQdja", "postedAt": "2023-10-10T04:39:58.813Z", "postId": "PsES3ffAyHGCDKP9e", "htmlBody": "<p>Thanks for sharing!</p><p>I previously suggested the wait-list as a way to deal with the late applicant. Another strategy would be to accept late applications, and evaluate them normally, but let people know there is a $50/day (or whatever level) surcharge for late applicants, and no discounts available. This has a number of positive effects:</p><ul><li>It deters people from applying late.</li><li>No hard cutoff, so people who just missed the deadline are still incentivized to be as early as they can.</li><li>Late applicants compensate you for the costs they impose rather than free-riding.</li><li>Deter late applicants who don't value the conference that much.</li><li>It's credible you might actually enforce this, in contrast to the difficulty in actually rejecting a high-value late applicant when the time comes.</li></ul>", "parentCommentId": null, "user": {"username": "Larks"}}]