[{"_id": "zi45PLdJvb5u2JMHa", "postedAt": "2021-10-19T00:13:00.399Z", "postId": "PsiiMHvHoHqzGu6Qm", "htmlBody": "<blockquote><ul><li>We may try to create something similar to what <a href=\"https://www.givewell.org/how-we-work/our-criteria/cost-effectiveness/cost-effectiveness-models\">GiveWell uses for its cost-effectiveness analysis</a>: a spreadsheet where different people can fill in their values for key parameters (such as relative credence in different worldviews, and which ones they think should benefit from various fairness agreements), with explanations and links to writeups with more detail and argumentation for each parameter, and basic analytics on the distribution of inputs (for example, what the median allocation is to each worldview, across all staff members).</li></ul></blockquote><p>&nbsp;</p><p>This would be very helpful. I'm having trouble even finding a sheet that prioritizes causes using a static worldview, i.e. one that lists causes with scores for Importance, Neglectedness and Tractability/Solvability and has notes to explain.</p>", "parentCommentId": null, "user": {"username": "Evan R. Murphy"}}, {"_id": "Hk2GTYGPaDyZiiQHX", "postedAt": "2022-01-09T10:00:43.081Z", "postId": "PsiiMHvHoHqzGu6Qm", "htmlBody": "<p>[I'm doing a bunch of low-effort reviews of posts I read a while ago and think are important. Unfortunately, I don't have time to re-read them or say very nuanced things about them.]</p><p>I think that the core idea here (about a few different worldviews you could bet on) is frequently referenced and important. I'm not 100% sure I agree with this approach theoretically, but it seems to have happened practically and be working fine. The overall framing of the post is around OP's work, which maybe would make it seem a bit out-of-place in some sort of collection of articles.&nbsp;</p><p>I think I'd be pro including this if you could do an excerpt that cut out some of the OP-specific context.</p>", "parentCommentId": null, "user": {"username": "Maxdalton"}}]