[{"_id": "by2kLjaoeBbySQNeg", "postedAt": "2022-12-18T00:05:45.230Z", "postId": "PsztRbQnuMmpgSrRc", "htmlBody": "<p>The last four paragraphs  are well said👌</p>\n", "parentCommentId": null, "user": {"username": "Karla Still"}}, {"_id": "paJfHCTiNkMqhZ5Et", "postedAt": "2022-12-18T15:54:19.009Z", "postId": "PsztRbQnuMmpgSrRc", "htmlBody": "<p>I love this. I think the arguments by analogy to knowing “Almost you” are particularly helpful.</p>\n<p>However, I would love to see more on how you think EA could get social media right. Assuming it has a presence, should those accounts respond to criticism? Should they campaign for donations? Should they invite to EAGs? Should they distill core ideas?</p>\n", "parentCommentId": null, "user": {"username": "agucova"}}, {"_id": "5oaj87xFHZAq2u7bX", "postedAt": "2022-12-21T08:37:26.960Z", "postId": "PsztRbQnuMmpgSrRc", "htmlBody": "<p>Thank you! Very kind.</p>\n<p>I think, in an ideal world, what you end up with is an ecosystem of accounts that cover a lot of the niches you've raised.</p>\n<p>Some are compatible, so you could do more than one on one account. Example: You could have an account that produces and shares accessible content on effective giving research and seeks donations (if done tastefully), but that account shouldn't be getting into arguments.</p>\n<p>Responding to criticism is important and is often done better by individual user accounts vs central orgs. A good rule of thumb has always been: don't reply with anything that you wouldn't be happy being taken as a good representation of your views, that you don't think adds clarity or additional value, or that you wouldn’t want plastered above your name on a ballot paper (in the political context). It's hard to do well, but good-faith actors appreciate it and trust and respect you more for doing it.</p>\n<p>I think, purely from an outside perspective without having experimented, that a better route to respond to criticism more centrally would probably just be creating and sharing more accessible content that reaffirms where EA stands (where the criticism isn’t or isn’t entirely valid).</p>\n<p>EA as a community has a habit of referencing EA texts and principles in response to criticism, and while this is great for people already within the community or adjacent ones like the rationalists, it isn’t necessarily accessible (plain language, core ideas explained, typical blog or news story format) to the general public, while a lot of the critique pieces are.</p>\n", "parentCommentId": "paJfHCTiNkMqhZ5Et", "user": {"username": "Alisha Lewis"}}]