[{"_id": "SZgqEdytiHd9Htgan", "postedAt": "2023-02-21T20:27:22.537Z", "postId": "PTCw5CJT7cE6Kx9ZR", "htmlBody": "<p>If the alternative is being a disgenicist, a little knowledge of Greek looks quite definite to chose…\n:-)</p>\n", "parentCommentId": null, "user": {"username": "Arturo Macias"}}, {"_id": "oPTrNDzGtPNj343Cs", "postedAt": "2023-02-21T21:06:34.815Z", "postId": "PTCw5CJT7cE6Kx9ZR", "htmlBody": "<p>I'm surprised why this post is being downvoted. It takes a controversial topic but seems to talk reasonably through it?</p>\n<p>(For those downvoting, maybe mention your reasons?)</p>\n", "parentCommentId": null, "user": {"username": "aayush-kucheria"}}, {"_id": "gEQSthB8DJtcLht6g", "postedAt": "2023-02-21T21:08:40.139Z", "postId": "PTCw5CJT7cE6Kx9ZR", "htmlBody": "<p>This is not intended as a reply to the substance of your post but rather as a reply to your choice of vocabulary. I don't understand why it is helpful to use the word \"eugenics\" to refer to modern assistive reproductive technology and/or human genetic engineering. Eugenics commonly refers to a primarily 20th century movement which was a force for tremendous evil.</p><p>Why try to repurpose that word when you could just choose a new one?</p>", "parentCommentId": null, "user": {"username": "Erin"}}, {"_id": "8FHcaZxpEwuwHGiQu", "postedAt": "2023-02-21T21:17:15.292Z", "postId": "PTCw5CJT7cE6Kx9ZR", "htmlBody": "<p>I briefly deal with this issue above, essentially saying that the term needs to be rehabilitated because it is already applied to many different phenomena/interventions and all of these fit the literal definition of eugenics. And I think the benefits of discussing eugenics openly outweigh the risks. What I didn't get into is that terms like \"reprogenetics\" and \"liberal eugenics\" have really not been taken up.&nbsp;</p><p>Here is an <a href=\"https://quillette.com/2021/09/15/moral-panic-eugenics-abortion-rights/\">excerpt from another piece</a> I wrote on how common it is to label individual choices eugenics:</p><p><br>\"While progressives maintain that abortion on the basis of disability is not eugenics, they have criticized many other individual choices as eugenics. For example, in 2019 <a href=\"https://en.wikipedia.org/wiki/George_Church_(geneticist)\"><u>George Church</u></a> discussed his plans to make a genetic matchmaking app, digid8, which would prevent people with rare genetic diseases from meeting each other. This would diminish the risk of passing a disability onto their offspring (a similar approach to that used by <a href=\"https://en.wikipedia.org/wiki/Dor_Yeshorim\"><u>Dor Yeshorim</u></a>). This private company’s service—which people would have to opt into and pay for—<a href=\"https://www.technologyreview.com/2019/12/11/131611/actual-facts-about-george-church-dna-dating-company-digid8/\"><u>caused huge controversy</u></a> over its <a href=\"https://twitter.com/IBJIYONGI/status/1204153413715529728?s=20\"><u>eugenic implications</u></a>. Another individual choice, using genetic screening to choose an embryo to implant during invitro fertilization (IVF), is also <a href=\"https://www.technologyreview.com/2019/11/08/132018/polygenic-score-ivf-embryo-dna-tests-genomic-prediction-gattaca/\"><u>widely</u></a> <a href=\"https://liorpachter.wordpress.com/2021/04/12/the-amoral-nonsense-of-orchids-embryo-selection/\"><u>associated</u></a> <a href=\"https://www.nejm.org/doi/pdf/10.1056/NEJMsr2105065?listPDF=true\"><u>with</u></a> <a href=\"https://www.technologyreview.com/2017/11/01/105176/eugenics-20-were-at-the-dawn-of-choosing-embryos-by-health-height-and-more/\"><u>eugenics</u></a>, especially if <a href=\"https://www.geneticsandsociety.org/biopolitical-times/steinberg-still-starting-sell-eugenics-0\"><u>parents select for cosmetic features</u></a> like eye color. If the individual choice of using a dating app or engaging in embryo selection is eugenics, certainly the individual choice to terminate a pregnancy on the basis of disability also fits this definition.\"</p>", "parentCommentId": "gEQSthB8DJtcLht6g", "user": {"username": "Sentientist"}}, {"_id": "BQvn73GfLzBM5AawP", "postedAt": "2023-02-21T21:24:07.819Z", "postId": "PTCw5CJT7cE6Kx9ZR", "htmlBody": "<p>Very frustrating that an attempt to discuss the subject openly is getting so downvoted. I found it an interesting and well-researched read</p><blockquote><p>In the case of Patrick Stübing, the state could have just offered to pay him to get a vasectomy, a choice he ended up making anyway, instead of throwing him in prison.</p></blockquote><p>This is the only thing I'd disagree with - if he'd knowingly broken a law and in so doing caused predictable and serious harm, throwing him into prison seems like pretty reasonable behaviour.</p>", "parentCommentId": null, "user": {"username": "Arepo"}}, {"_id": "YDmApKhWZGAoXRSbA", "postedAt": "2023-02-21T21:36:49.841Z", "postId": "PTCw5CJT7cE6Kx9ZR", "htmlBody": "<p>I get that newer practices fall under the meaning of eugenics in Greek. But still, wouldn't it be better to use a word that isn't associated with the racist type of eugenics?</p><p>Is the idea to fully confront the arguments/controversies that come up over the \"eugenic implications\" of newer reproductive technologies?</p>", "parentCommentId": "8FHcaZxpEwuwHGiQu", "user": {"username": "Erin"}}, {"_id": "FnBFFAmGzR86A2LqH", "postedAt": "2023-02-21T21:39:38.547Z", "postId": "PTCw5CJT7cE6Kx9ZR", "htmlBody": "<p>I see no reason someone should suffer and their family should suffer if instead there is a mutually agreed upon intervention that keeps the suffering from happening. To be fair, I don't know if Patrick and Susan meant to have children (she's cognitively disabled). But many people share your view. Men can be put in prison for not paying court ordered child support and reduced sentences or other incentives for men to get vasectomies are not allowed because of accusations of eugenics.&nbsp;</p><p>To me, offering Patrick an incentive to get a vasectomy seems analogous to giving an opiate addict methadone so they don't steal money to buy opiates, rather than putting them in prison for stealing.&nbsp;</p>", "parentCommentId": "BQvn73GfLzBM5AawP", "user": {"username": "Sentientist"}}, {"_id": "48SaLoiotqJ46bMKn", "postedAt": "2023-02-21T21:43:27.137Z", "postId": "PTCw5CJT7cE6Kx9ZR", "htmlBody": "<p>I think it's a good thing that most people have a revulsion towards the Nazi version of eugenics. I think trying to rehabilitate the word &nbsp;\"eugenics\" &nbsp;could plausibly lead to a lessening of that revulsion and and increase in support for their version. Just use a different word for the thing that's okay, and that all goes away.&nbsp;</p><p>This feels a bit like a pro-taxation person hearing the argument that taxation is theft, and then going on to proudly declare that \"everyone is a thief\", &nbsp;that everybody should be pro-theft (but only good theft), and we should rehabilitate the word \"theft\". <i>Just use a different word</i>.&nbsp;</p>", "parentCommentId": null, "user": {"username": "titotal"}}, {"_id": "GEyXLHb9Xh7HSpJbp", "postedAt": "2023-02-21T21:52:28.575Z", "postId": "PTCw5CJT7cE6Kx9ZR", "htmlBody": "<p>I haven't downvoted or read the post, but one explanation is the title \"You're probably a eugenicist\" seems clickbaity and aimed at persuasion. It reads as ripe for plucking out of context by our critics. I immediately see it cited in the next major critique published in a major news org: \"<i>In upvoted posts on the EA forum, EAs argue they can have 'reasonable' conversations about eugenics.</i>\"&nbsp;</p><p>One idea for dealing with controversial ideas is to A. use a different word and or B. make it more boring. &nbsp;If the title read something like, \"Most people favor selecting for valuable hereditary traits.\" My pulse would quicken <i>less</i> upon reading.</p>", "parentCommentId": "oPTrNDzGtPNj343Cs", "user": {"username": "JoelMcGuire"}}, {"_id": "Q8FZq2s8MwDeT3yWY", "postedAt": "2023-02-21T21:59:04.355Z", "postId": "PTCw5CJT7cE6Kx9ZR", "htmlBody": "<p>First- I'm not trying to rehabilitate murder, forced sterilizations or nazis. \"Nazi eugenics\" still has the word \"Nazi\" in it, which so far as I'm aware, no one is trying to rehabilitate.</p><p>Second- there is a case study for rehabilitation of a word, euthanasia. <a href=\"https://encyclopedia.ushmm.org/content/en/gallery/euthanasia-program\">Euthanasia is associated with Nazis</a> but now the word euthanasia is used in bioethics and public conversations freely for the practice of allowing people to die who are experiencing tremendous suffering. So far as I'm aware the rehabilitation of the word euthanasia has not resulted in people being more inclined to recommend the murder of the ill or disabled. Rehabilitation of the word euthanasia has instead resulted in a better conversation and provisions around the fate of people who are suffering.&nbsp;</p><p>Edited to add: This comment fails to reckon with the possible benefits of rehabilitating the word eugenics. When the word is used against reproductive technologies, individual reproductive choices and behavioral genetics it stifles conversation, debate and progress.</p>", "parentCommentId": "48SaLoiotqJ46bMKn", "user": {"username": "Sentientist"}}, {"_id": "wkYCCXucWcXdRzhRv", "postedAt": "2023-02-21T22:37:37.013Z", "postId": "PTCw5CJT7cE6Kx9ZR", "htmlBody": "<p>\"euthanasia\" was a euphemism the nazi's used for their eugenics program. \"eugenics\" was a guiding principle of the Nazi ideology, as well as many other racist policies throughout the world, and continues to be used by neo-nazis to this day.&nbsp;</p><p>Trying to rehabilitate the word \"eugenics\" is like someone trying to rehabilitate the swastika symbol by waving a sanksrit version it around and insisting it means prosperity and good luck. It's not gonna work, it's going to offend and upset people, and people are gonna think you're a Nazi.&nbsp;</p>", "parentCommentId": "Q8FZq2s8MwDeT3yWY", "user": {"username": "titotal"}}, {"_id": "7ax83GZqaCGXxGto4", "postedAt": "2023-02-21T23:39:25.160Z", "postId": "PTCw5CJT7cE6Kx9ZR", "htmlBody": "<p>Maybe I misunderstood what happened. It sounds like they had 4 children, 3 of whom &nbsp;were disabled, and then the German state caught on and punished them? If so, this seems like callous enough behaviour to me that a strong form of retribution makes sense as a deterrent just as it would for crimes like manslaughter, even if we didn't have reason to think they'd be repeated by the individual.</p>", "parentCommentId": "FnBFFAmGzR86A2LqH", "user": {"username": "Arepo"}}, {"_id": "7qiwfKFbXyuWaGSZB", "postedAt": "2023-02-21T23:45:10.583Z", "postId": "PTCw5CJT7cE6Kx9ZR", "htmlBody": "<p>It's interesting that you say that anti-eugenicists are engaging in a motte and bailey argument, looking to tar less oppressive eugenicist practices with the brush of Nazi oppression. As I was reading through this, I worry that the attempted reclamation of the word 'eugenics' - as well as making \"eugenicists\" unpopular - might contribute to a motte and bailey in the other direction, where the motte is \"surely you think it's reasonable to prevent siblings from having kids\" and the bailey is more oppressive or coercie forms of reproductive control.&nbsp;<br><br>Like, you start the essay with an example of \"eugenics\" that most people would agree was reasonable -a German court's attempt to break up a couple of biological siblings. And then later, you talk about Nazi atrocities like murder and sterilization, which I agree that few modern eugenicists advocate for. But between those, you talk about people with mental illness: how bipolar, schizophrenia and substance abuse tendencies are genetic and often passed down to kids. You point out that people with these conditions often get together with others with the same condition, making their kids extra likely to have the disorder.<br><br>This perturbs me: is this, for you, in the reasonable 'siblings' camp or the unreasonable 'Nazi atrocities' camp? I can think of very mild interventions and very repressive ones, and I don't think you say what you'd actually recommend here. In general, I love and admire people with mental disorders like this (including bipolar and substance abuse), and I think that reproductive rights are extremely important. I would feel sad if a bipolar friend, e.g., was strongly discouraged or even forcibly prevented from having children due to their condition, or if they were encouraged to seek out non-bipolar partners. I'd be against even mild \"eugenicist\" interventions aimed at making mentally ill people have fewer children.&nbsp;<br><br>I think most EAs are either positive or neutral about existence per se, and I think most people who are alive are happy to be, even if they struggle with difficult or painful mental and physical health conditions.<br>&nbsp;</p>", "parentCommentId": null, "user": {"username": "Amber"}}, {"_id": "FfxPmFxJeWHYu3gAC", "postedAt": "2023-02-21T23:45:36.898Z", "postId": "PTCw5CJT7cE6Kx9ZR", "htmlBody": "<blockquote><p>When someone says that screening embryos for genetic diseases, giving educated women incentives to have children (like free child care for college educated women), or offering subsidized abortions for women addicted to drugs is \"eugenics\" they are absolutely using the term correctly.</p></blockquote><p>&nbsp;</p><p>The second example here seems wildly different from most of the rest of the examples in the article. A eugenic justification for free college child care involves people being rewarded monetarily by the government, not for their behaviour, but for their perceived genetic superiority.&nbsp;</p><p>I think this reveals a bit of my problem with the article: it gives the strawman impression that the <i>only reason</i> to be opposed to nazi eugenics was the coercion and murder. But there were other reasons too, like the state rewarding and punishing people based purely on their unchangeable genetics and not on their actions, the view of disabled people as burdens on society, the obsession with racial differences, etc. If a policy resembles these negative effects, I think a (calm, reasoned) comparison to historical negative eugenics is warranted in the discussion.&nbsp;</p>", "parentCommentId": null, "user": {"username": "titotal"}}, {"_id": "WPAuf49kkqbBcDAKZ", "postedAt": "2023-02-21T23:57:27.650Z", "postId": "PTCw5CJT7cE6Kx9ZR", "htmlBody": "<p>Mods: We should probably throw a Community tag on this.</p>\n", "parentCommentId": null, "user": {"username": "evelynciara"}}, {"_id": "FACryAeR6mGn8TMir", "postedAt": "2023-02-22T00:20:14.430Z", "postId": "PTCw5CJT7cE6Kx9ZR", "htmlBody": "<p>I suspect that the social cost of making \"I have [better/worse genetics] than this person\" a widespread, politically relevant, and socially permissible subject outweighs the potential benefits of policies like subsidized abortions for people addicted to drugs and special incentives for educated women to have kids.</p>\n<p>With regard to targeted abortion subsidies, what about the risk of reanimating the \"abortion is eugenics\" argument against its legality, particularly in the US, where abortion has been banned in many states? If you believe that abortion's legality has had very positive genetic effects, then shouldn't preserving that legality be an extremely high priority, and the political cost of proposing this policy prohibitive?</p>\n<p>If you want to make abortions more accessible, why not make them free for everyone, making it a better option for people who might not be able to face the short-term financial burden of its cost, reducing the odds of it being banned by reinforcing the idea that it is is a right, and avoiding the backlash that a targeted subsidy would unleash?</p>\n<p>It seems like ensuring that everyone gets to decide when they are best prepared to have and raise kids, if ever, has such incredibly high positive externalities that if anything there is a strong argument that abortion should be free already. The same goes for condoms, birth control pills, and IUDs.</p>\n<p>Why not advocate for new, universal public goods, rather than policies that unnecessarily risk negative social and political impacts?</p>\n", "parentCommentId": null, "user": {"username": "Sam Battis"}}, {"_id": "vJgWKriSgd3sMHqew", "postedAt": "2023-02-22T00:23:11.822Z", "postId": "PTCw5CJT7cE6Kx9ZR", "htmlBody": "<p>Let's apply the reversal test to your assertion that you'd be \"against even mild \"eugenicist\" interventions aimed at making mentally ill people have fewer children\". Would you be in favor of an organization that gave drugs to people with mental illness that made them <i>more fertile?</i></p><p>All I'm endorsing in this essay is that interventions should be discussed, not any particular intervention. Personally, I would also be against the government intervening in the reproduction of people who <i>want</i> to have children. At the moment, someone with serious mental illness can have multiple children in foster care, have no desire to have children and still, as an accident of sex, have children they cannot care for who, moreover, are more likely to have inherited their problems. This is the basic idea behind <a href=\"https://en.wikipedia.org/wiki/Project_Prevention\">Project Prevention</a>- $300 is likely enough of a nudge that it incentivizes someone to take contraception who already does not want children. $300 is unlikely to convince someone who wants to have a child not to. Moreover, most PP clients choose reversible contraception.</p><p>There are countries that subsidize IVF. In the near future it could be possible for the government to subsidize polygenic screening for people with heritable conditions who do not want to pass these conditions down to their children. As I know many people with mental illness who choose not to have children because they don't want their kids to share their misfortune, this could be an intervention that would help mentally ill people who want to have children have (more) children.&nbsp;</p>", "parentCommentId": "7qiwfKFbXyuWaGSZB", "user": {"username": "Sentientist"}}, {"_id": "H93sDDcrTvmdFLofD", "postedAt": "2023-02-22T00:34:29.137Z", "postId": "PTCw5CJT7cE6Kx9ZR", "htmlBody": "<p>Couldn’t agree more. I think clickbaity pulse-quickening titles are more forgivable for blog posts on a personal page (which this post originally was) than on the EA forum. I’d recommend that Sentientist modify the title they use for the crosspost to this forum.</p>\n", "parentCommentId": "GEyXLHb9Xh7HSpJbp", "user": {"username": "Ariel Simnegar"}}, {"_id": "8PoarbT6aHeEjwneh", "postedAt": "2023-02-22T00:36:25.833Z", "postId": "PTCw5CJT7cE6Kx9ZR", "htmlBody": "<p>I didn't advocate for any particular policy regarding abortion. And, I'm not reanimating the abortion is eugenics argument myself, Clarence Thomas and the prolife movement in America make this argument regularly. It's just that progressives rarely come across it.&nbsp;</p><p>I completely agree with free contraception and giving people inexpensive reproductive autonomy. I'm in favor of legal abortion. But I know enough people who think abortion is morally abhorrent and a crime that it's difficult for me to uncritically endorse legal abortion in places where pro life citizens are the majority.&nbsp;</p><p>&nbsp;I'm not sure I agree with free abortions for everyone. As I said in the piece, Israel subsidizes abortions for unmarried women and women whose children are likely to suffer disability. I don't know if this targeted subsidy \"implying it's better for some people to have kids than others\" has the kind of bad social effect that you are alluding to. &nbsp;From what I know of Israel, it seems not to.&nbsp;</p><p>The argument you are making is that abortion and free contraception will have eugenic effects anyway, so why not just give people full reproductive autonomy without nudging anyone in particular. I think this is a good argument.&nbsp;</p>", "parentCommentId": "FACryAeR6mGn8TMir", "user": {"username": "Sentientist"}}, {"_id": "vHjecMTj7aLXGcgdp", "postedAt": "2023-02-22T01:08:25.448Z", "postId": "PTCw5CJT7cE6Kx9ZR", "htmlBody": "<p>It's true that you didn't technically advocate for it, but in context it's implied that subsidies for abortion for people who are addicted to drug use would be a good policy to consider.</p>\n<p>\"We are not going to stop hearing about eugenics. Every time someone tries to call it something different, the “e” word and its association with historic injustice and abuse is invoked to end the discussion before it can begin.</p>\n<p>When someone says that screening embryos for genetic diseases, giving educated women incentives to have children (like free child care for college educated women), or offering subsidized abortions for women addicted to drugs is \"eugenics\" they are absolutely using the term correctly.\"</p>\n<p>I accept that the idea \"abortion is eugenics\" is already advanced by some conservatives. However, I think that the policy of targeted abortion subsidies would convince more people that \"abortion is eugenics,\" and I think that this would make it easier to ban abortion.</p>\n<p>I think the fact that Israel already has a very different cultural environment regarding genetic interventions means that those examples of targeted subsidies may well be much more controversial in other countries.</p>\n<p>I'm glad you agree on that last point.</p>\n<p>For me it's been good to make a habit of looking for the least controversial policy that achieves desired goals. I often discover reasons that the more controversial options were actually less desirable in some way than the less controversial ones. This isn't always the case, but in my experience it has been a definite pattern.</p>\n", "parentCommentId": "8PoarbT6aHeEjwneh", "user": {"username": "Sam Battis"}}, {"_id": "XzPERuaB4Zpm36L9b", "postedAt": "2023-02-22T01:17:20.469Z", "postId": "PTCw5CJT7cE6Kx9ZR", "htmlBody": "<p>I'm happy to modify the title to better fit the norms of EA forum. Can you (or anyone) suggest one here or in my messages?</p>", "parentCommentId": "H93sDDcrTvmdFLofD", "user": {"username": "Sentientist"}}, {"_id": "Qmspd5C4S583sEhZ4", "postedAt": "2023-02-22T04:51:44.173Z", "postId": "PTCw5CJT7cE6Kx9ZR", "htmlBody": "<p>Sure! I think \"Most people endorse some form of 'eugenics'\" would fit EA forum norms better.</p>", "parentCommentId": "XzPERuaB4Zpm36L9b", "user": {"username": "Ariel Simnegar"}}, {"_id": "2zECCNY654hFLe7mH", "postedAt": "2023-02-22T09:39:06.420Z", "postId": "PTCw5CJT7cE6Kx9ZR", "htmlBody": "<blockquote><p>I think most EAs are either positive or neutral about existence per se, and I think most people who are alive are happy to be, even if they struggle with difficult or painful mental and physical health conditions.</p></blockquote><p>One doesn't need to be a full Malthusian to think that adding severely impaired/relatively unproductive people to a population with a strong welfare state would counterfactually reduce the number of other people who would exist.</p><p>Also I basically &nbsp;don't believe your claim. I think it has huge selection bias behind it. In the highly developed world in which I live I've met many people who seemed unhappy with their lives, and it's hard to believe the less affluent world (the hypermajority) is better off. I might be wrong, but I don't think you should treat it as a given that adding a person is a positive even holding all else &nbsp;equal.</p>", "parentCommentId": "7qiwfKFbXyuWaGSZB", "user": {"username": "Arepo"}}, {"_id": "aSrsPGkYrmythKDaA", "postedAt": "2023-02-22T12:55:00.653Z", "postId": "PTCw5CJT7cE6Kx9ZR", "htmlBody": "<p>Done</p>", "parentCommentId": "Qmspd5C4S583sEhZ4", "user": {"username": "Sentientist"}}, {"_id": "vH5figRWFakiLRBZ4", "postedAt": "2023-02-22T13:17:17.750Z", "postId": "PTCw5CJT7cE6Kx9ZR", "htmlBody": "<p>Looking at the agree votes it seems that <s>most </s>many people think a different word should be substituted for eugenics. I pointed out the problems with this in the piece, that eugenics already has a definition that both encompasses Nazi atrocities and things that most people agree with. And other words, like reprogenetics, liberal eugenics and procreative beneficence haven't caught on. &nbsp;Let's &nbsp;say, for the sake of argument, &nbsp;that many reasonable people decide to phase out 'eugenic' and instead use a word like epilogenics (like <a href=\"https://forum.effectivealtruism.org/users/aella?mention=user\">@aella</a> suggests <a href=\"https://twitter.com/Aella_Girl/status/1600732740366000128?s=20\">here.)</a> How would that work rhetorically?</p><p>EA Bioethicist: Depression costs a huge number of QUALYs so I suggest the government subsidizes polygenic screening of embryos for depression for people who have suffered from depression and who are going through IVF.</p><p>Critic: That's eugenics.</p><p>EA Bioethicist: Yes, technically it is. But we don't use that word anymore. &nbsp;It's actually \"epilogenics\" because people have free choice.</p><p>Critic: The fact that it also qualifies as a word you just made up doesn't stop it from being eugenics.</p><p>This is a toy example but what if we freely used the word eugenics to describe all the things that it describes rather than putting a new label on just those things we agree with (without getting into the fact that it's difficult to draw a bright line between coercive and non coercive interventions)?</p><p>EA bioethicist says the same thing about depression screening as above</p><p>Critic: That's eugenics.</p><p>EA Bioethicist: Yes. But eugenics also encompasses many things you probably endorse, like genetic counseling for people with debilitating genetic diseases and laws against close relatives having children etc. So, \"that's eugenics\" isn't, by itself, an argument against my position.</p>", "parentCommentId": null, "user": {"username": "Sentientist"}}, {"_id": "FJHwackD2qyyCduKy", "postedAt": "2023-02-22T16:35:24.757Z", "postId": "PTCw5CJT7cE6Kx9ZR", "htmlBody": "<p>We've had several decades of research on subjective well-being around the world. The big takeaway is that most people are (surprisingly) happy, even in poor countries, and that almost everybody experiences net positive utility.&nbsp;</p><p>The real selection bias is that isolated, alienated, single, childless, careerist, consumerist Westerners imagine that everybody else shares their depression &amp; anxiety.</p>", "parentCommentId": "2zECCNY654hFLe7mH", "user": {"username": "geoffreymiller"}}, {"_id": "E569fJRmNH6WePoAJ", "postedAt": "2023-02-22T17:06:26.595Z", "postId": "PTCw5CJT7cE6Kx9ZR", "htmlBody": "<p>The research I've seen has done nothing convincing to control for a) selection people having to be in a sufficiently positive frame of mind to take surveys (what exactly is the inverse selection effect you imagine from Westerners?), b) social desirability bias (being happy is attractive - of course we want to announce it!), or c) the hopeless task of communicating positive valence in a standardised way to different global cultures.</p>", "parentCommentId": "FJHwackD2qyyCduKy", "user": {"username": "Arepo"}}, {"_id": "NBhDLTFKom8t5gqep", "postedAt": "2023-02-22T17:09:36.257Z", "postId": "PTCw5CJT7cE6Kx9ZR", "htmlBody": "<p>The difference between eugenics and transhumanism is consent. eugenics cannot be rehabilitated; The word is irrevocably bound to refer to incredible consent violation, to the point where even calling it merely a consent violation dishonors the people who died at the hands of the Nazis. heal genetic diseases, don't violate and murder people. do not commit eugenics.</p>\n", "parentCommentId": null, "user": {"username": "lauren"}}, {"_id": "Bqit7fH97LWEoBFWJ", "postedAt": "2023-02-22T17:19:35.547Z", "postId": "PTCw5CJT7cE6Kx9ZR", "htmlBody": "<p>Also in general I'm happy to treat humans as having substantially higher instrumental worth than animals for the increase to human capital, but the effect on net global utility of adding a seriously mentally ill probably omniverous person to the world seems likely to be quite negative even if you think that person's welfare is net positive.</p>", "parentCommentId": "2zECCNY654hFLe7mH", "user": {"username": "Arepo"}}, {"_id": "RiYs3eQHjxH6Fa4nB", "postedAt": "2023-02-22T17:55:02.669Z", "postId": "PTCw5CJT7cE6Kx9ZR", "htmlBody": "<blockquote><p>selection people having to be in a sufficiently positive frame of mind to take surveys (what exactly is the inverse selection effect you imagine from Westerners</p></blockquote><p>In the west I think being willing to spend time to fill in a survey in return for $1.00 is probably a negative selection effect. Happy people are too busy being awesome.</p>", "parentCommentId": "E569fJRmNH6WePoAJ", "user": {"username": "temp_"}}, {"_id": "g9GPHf49qxftLb4a3", "postedAt": "2023-02-22T19:36:45.739Z", "postId": "PTCw5CJT7cE6Kx9ZR", "htmlBody": "<p>A note on the \"positive utility\" bit. I am very uncertain about this. We don't really know where on subjective wellbeing scales people construe wellbeing to go from positive to negative. My best bet is around 2.5 on a 0 to 10 scale. This would indicate that ~<a href=\"https://docs.google.com/spreadsheets/d/1Sc26F7E_S4hBF79q_wCJCvHV4DOsxy4vAzqkAUpUBMw/edit?usp=sharing\">18% of people in SSA or South Asia</a> have lives with negative wellbeing if what we care about is life satisfaction (debatable). For the world, this means 11%, which is similar to McAskill's guess of 10% in WWOTF.&nbsp;</p><p>And insofar as happiness is separate from life satisfaction. It's very rare for a country, on average, to report being more unhappy than happy.&nbsp;</p><figure class=\"media\"><div data-oembed-url=\"https://ourworldindata.org/grapher/share-of-people-who-say-they-are-happy?tab=map\">\n\t\t\t\t\t<div data-owid-slug=\"share-of-people-who-say-they-are-happy\" class=\"owid-preview\">\n\t\t\t\t\t\t<iframe src=\"https://ourworldindata.org/grapher/share-of-people-who-say-they-are-happy?tab=map\">\n\t\t\t\t\t&lt;/div&gt;\n\t\t\t\t</iframe></div></div></figure>", "parentCommentId": "FJHwackD2qyyCduKy", "user": {"username": "JoelMcGuire"}}, {"_id": "J2qCLTjzpQouEoA8b", "postedAt": "2023-02-22T20:31:04.521Z", "postId": "PTCw5CJT7cE6Kx9ZR", "htmlBody": "<p>Trying to hold onto the word “eugenics” seems to indicate an unrealistically optimistic belief in people’s capacity to tolerate semantics. Letting go is a matter of will, not reason.&nbsp;</p><p>E.g., I pity the leftist who thinks they can, in every conversation with a non-comrade, explain the difference between the theory of a classless society, the history of ostensibly communist regimes committing omnicide, and the hitherto unrealised practice of “real communism” (outside of a few scores of 20th-century Israeli villages and towns). To avoid the reverse problem when discussing “communist” regimes, I refer to “authoritarian regimes with command economies”. And I’m convinced it’s almost always better to go with “Social Democracy”.&nbsp;</p><p>Who cares if no other word has caught on yet. Marketing is a great and powerful force (one EAs seem only dimly to understand). Use more words if you have to. The key point is that “<strong>it’s a good idea to avoid tying yourself to words where the most common use is associated with mass murder.</strong>”&nbsp;<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefgbh9d09svf\"><sup><a href=\"#fngbh9d09svf\">[1]</a></sup></span></p><p>Turning to the example. I’d pray to <a href=\"https://www.google.com/url?sa=t&amp;rct=j&amp;q=&amp;esrc=s&amp;source=web&amp;cd=&amp;cad=rja&amp;uact=8&amp;ved=2ahUKEwispYWK-Kn9AhXGCjQIHQj4BuoQFnoECA4QAQ&amp;url=https%3A%2F%2Fen.wikipedia.org%2Fwiki%2FHedone&amp;usg=AOvVaw1P5k54IX4EmggegPO_xrVj\">Hedone</a> that most EAs can read the room well enough to avoid making such arguments while we still have nuclear wars to stop, pandemics to prevent, diseases to cure, global poverty to stamp out, and many cheap and largely uncontroversial treatments for depression and everyday sadness we’ve yet to scale. But assuming they did make that argument, I think the response to “That’s eugenics” should be something like:&nbsp;</p><p>“No, eugenics is associated with stripping a group of people of their right to reproduce. I’m discussing supporting families to make choices about their children’s health. Screening is already supported for many debilitating health conditions because of the suffering they produce, I’m saying that we should provide that same support when the conditions that produce the suffering are mental rather than physical.”</p><p>But maybe a takeaway here is: “don’t feed the trolls”?</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fngbh9d09svf\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefgbh9d09svf\">^</a></strong></sup></span><div class=\"footnote-content\"><p>Note: One response is, “<i>we can’t give up on every word once it’s tainted by associated with some unseemly set of disreputes.</i>” And that’s fair. For instance, I’m fine being associated with “Happiness Science” because the most common use is associated with social science into self-reported wellbeing,<strong> </strong><a href=\"https://en.wikipedia.org/wiki/Happy_Science\"><strong>not a genocide-denying Japanese cult</strong></a>. <i>The point is that choice of association depends on what most people associate the word with</i>. Language will always be more bottom-up than top-down and seems much closer to a rowdy democracy than a sober technocracy.&nbsp;</p></div></li></ol>", "parentCommentId": "vH5figRWFakiLRBZ4", "user": {"username": "JoelMcGuire"}}, {"_id": "4rembMXfpdey4SsPo", "postedAt": "2023-02-22T21:37:12.787Z", "postId": "PTCw5CJT7cE6Kx9ZR", "htmlBody": "<p>Life satisfaction for people with disabilities has been well studied. &nbsp;It is lower than people without disabilities (in most cases), but is not zero.</p><p>(A handful of sources to start with: <a href=\"https://link.springer.com/article/10.1007/s10198-009-0184-z\">paper</a> on disabled people in Germany that shows happiness recovers after disability, <a href=\"https://www.sciencedirect.com/science/article/abs/pii/S0891422212000303\">paper</a> on Spanish people with intellectual disabilities shows they are largely satisfied with their lives, the average life satisfaction of people with disabilities in Northern Ireland is <a href=\"https://www.nisra.gov.uk/publications/pfg-2016-21-measurement-annex-average-life-satisfaction-score-people-disabilities\">7/10</a>, across EU member states it's between <a href=\"https://www.eurofound.europa.eu/data/life-satisfaction-among-people-with-and-without-disabilities\">6.2 and 7</a> out of ten.)</p>", "parentCommentId": "2zECCNY654hFLe7mH", "user": {"username": "Lauren Gilbert"}}, {"_id": "AgszxpgkZjzGTYwdw", "postedAt": "2023-02-22T22:05:26.869Z", "postId": "PTCw5CJT7cE6Kx9ZR", "htmlBody": "<p>Re the reversal test, I'd be in favour of organizations that generally helped people become more fertile, if they wanted to be? I don't want people with mental illness to have <i>more</i> children per se - I want them to have the amount of children they want to have.&nbsp;<br><br>I think in the case of Project Prevention, the question is muddied in several ways. If a person has lots of children but can't or doesn't take care of them, I agree that's a problem, but it's not really a eugenics issue (it would also be a problem if they had no mental illness and were just negligent). Conversely, if a drug addict had a lot of children but <i>did</i> take care of them, that's not obviously an issue to me. And based on the wikipedia page, Project Prevention seems like a good example for why people are concerned about the reclamation of \"eugenics\". The founder is quoted as saying \"We don’t allow dogs to breed. We spay them. We neuter them. We try to keep them from having unwanted puppies, and yet these women are literally having litters of children\". This is incredibly dehumanizing language and doesn't give me confidence that this person has drug addicts' interests at heart! Her reply to criticism about this was that she cared about the children. But to me, the fact that the children may not have a stable home or reliable parent figure seems more important than their genetics.&nbsp;<br><br>I'd be in favour of polygenic screening for people with heritable conditions, as this really does seem to enhance parental choice and it comes from a place of compassion rather than stigma.</p>", "parentCommentId": "vJgWKriSgd3sMHqew", "user": {"username": "Amber"}}, {"_id": "oSKAEidwS5JCBxDxJ", "postedAt": "2023-02-22T22:11:51.788Z", "postId": "PTCw5CJT7cE6Kx9ZR", "htmlBody": "<p>This is interesting! What is your guess of 2.5/10 based on? I guess this fuzziness makes me feel innately sceptical about such scales - I think one can <i>get</i> well-calibrated at tracking mood or wellbeing with numbers, but I think if you just ask a person who hasn't done this, I wouldn't expect Person A's 5 &nbsp;and Person B's 5 to be the same.&nbsp;</p>", "parentCommentId": "g9GPHf49qxftLb4a3", "user": {"username": "Amber"}}, {"_id": "HDSHiisLJ9McL9LKy", "postedAt": "2023-02-22T22:20:31.252Z", "postId": "PTCw5CJT7cE6Kx9ZR", "htmlBody": "<p>I'm not sure that adding impaired/unproductive people would counterfactually reduce others - if a person with a disability refrains from having a child, that doesn't mean that some healthy person elsewhere has an extra child.<br><br>Re being happy to be alive, I kind of want to distinguish 'being unhappy with one's life' and 'being happy <i>to be alive</i>'. I think you can have net-negative wellbeing and broadly think your life sucks, but still not sincerely want to die, or wish you'd never been born. This hunch is mainly based on my own experience: I've had times in my life where I think my wellbeing was net-negative, but I still didn't wish I hadn't been born. Basically I have a sense that there's a value to my life that's not straightforwardly related to my wellbeing.</p>", "parentCommentId": "2zECCNY654hFLe7mH", "user": {"username": "Amber"}}, {"_id": "q7t8MpeRnbGHSwQpp", "postedAt": "2023-02-23T00:31:31.989Z", "postId": "PTCw5CJT7cE6Kx9ZR", "htmlBody": "<p>The guess is based on a recent (unpublished and not sure I can cite) survey that I think did the best job yet at eliciting people's views on the neutral point in three countries (two LMICs).</p><p>I agree it's a big ask to get people to use the exact same scales. But I find it reassuring that populations who we wouldn't be surprised as having the best and worst lives tend to rate themselves as having about the best and worst lives that a 0 to 10 scale allows (Afghanis at ~2/10 and Finns at ~8/10.</p><p>That's not to dismiss the concern. I think it's plausible that there are systematic differences in scale use (non-systematic differences would wash out statistically). Still, I think people self-reporting about their wellbeing is informative enough to find and fix the issues rather than give up.&nbsp;</p><p>For those somehow interested in this nerdy aside, for further reading see Kaiser &amp; Oswald (<a href=\"https://www.google.com/url?q=https%3A%2F%2Fdoi.org%2F10.1073%2Fpnas.2210412119&amp;sa=D&amp;sntz=1&amp;usg=AOvVaw1YlsFgZi3s2GvFK_RQjcht\">2022</a>) on whether subjective scales behave how we'd expect (they do), &nbsp;Plant (<a href=\"https://www.happierlivesinstitute.org/report/the-comparability-of-subjective-scales/\">2020</a>) on the comparability of subjective scales, and Kaiser &amp; Vendrik (<a href=\"https://drive.google.com/file/d/1SE1OF2ztX1qHazO-XygCVFFgGvQtvcS9/view?usp=share_link\">2022</a>) on how threatened subjective scales are to divergences from the linearity assumption (not terribly).&nbsp;</p><p>Full disclosure: I'm a researcher at the Happier Lives Institute, which does cause prioritization research using subjective well-being data, so it's probably not surprising I'm defending the use of this type of data.&nbsp;</p><figure class=\"media\"><div data-oembed-url=\"https://ourworldindata.org/grapher/happiness-cantril-ladder\">\n\t\t\t\t\t<div data-owid-slug=\"happiness-cantril-ladder\" class=\"owid-preview\">\n\t\t\t\t\t\t<iframe src=\"https://ourworldindata.org/grapher/happiness-cantril-ladder\">\n\t\t\t\t\t&lt;/div&gt;\n\t\t\t\t</iframe></div></div></figure>", "parentCommentId": "oSKAEidwS5JCBxDxJ", "user": {"username": "JoelMcGuire"}}, {"_id": "CYybDAZFyLZkpDLBF", "postedAt": "2023-02-23T05:20:12.768Z", "postId": "PTCw5CJT7cE6Kx9ZR", "htmlBody": "<p>Thanks for this. I've been interested in this topic for a while as well.&nbsp;<br><br>As you mention China a bit in the article, I think it's worth mentioning how \"eugenics\" is viewed in China at the moment.&nbsp;</p><p>The term eugenics (优生 <i>yousheng</i> or 优生学 <i>youshengxue</i>) has never really been taboo in China. You see it all the time - in political slogans and everyday speech - with more connection with modern medicine than the Nazis. You‘ll see crudely scribbled messages using eugenic language all over the countryside (the most common, until recently, being 少生优生，幸福一生 <i>shaosheng yousheng, xingfu yisheng; </i>translated as \"Have few(er) and high(er)-quality (eugenic) children, and be happy your whole life!). You'll also hear TV hosts and politicians discussing <i>youshengxue</i> as if it were as anodyne a concept as entomology. This forum post would read as nonsense to many Chinese people (the title would read as something like: \"Most people endorse having healthy children\"). You do get some exceptions, especially among foreign-educated people (see this <a href=\"https://www.zhihu.com/question/22208730/answer/753573920\">Zhihu response</a> (Chinese)), and I'm also unsure what (more western-influenced) HK/ Taiwanese people think about it.</p><p>The <a href=\"https://baike.baidu.com/item/%E4%BC%98%E7%94%9F%E5%AD%A6/1172980\">Baidu Baike</a> (Chinese Wikipedia) first line is: \"优生/Eugenics is the most important issue concerning marriages and families, it is a science that uses the principles of genetics to guarantee the normal survival ability of the next generation.\" The 'dark history' of eugenics, particularly in Nazi Germany is mentioned briefly in one paragraph. See also the \"Chinese Healthy Birth Science Association\" <a href=\"http://www.chbsa.org/\"><u>http://www.chbsa.org/</u></a> (w/ google translate 中国优生科学协会 is \"Chinese Eugenics Science Association\") website, with articles on a range of topics, from genetic testing to child nutrition.</p><p>I guess you could argue either way here. You could say that in China it's good that you're actually allowed to talk about this sensitive topic openly and rationally, without having a ridiculous and illogical cached concept where 'wanting to have healthier children = nazi race science'. This is generally my experience and makes way more sense to me personally. If someone has distinctly dodgy views (spoiler alert: they do), you can argue with them without anyone using 'but that's eugenics' to end the argument without actually addressing the issues.&nbsp;</p><p>But, from a consequentialist perspective, you could also say: \"China doesn't have a \"eugenics taboo\" and look at the consequences\" (horrible one-child policy + forced sterilisations/ abortions + non-Han ethnic cleansing are seen as okay). You could also note that 'extreme' eugenic attitudes are incredibly common in China - people do care about the 'superiority of the Chinese race', and views regularly go way beyond those a more rational westerner would see as acceptable.</p>", "parentCommentId": null, "user": {"username": "Dzoldzaya"}}, {"_id": "A7kXLgmqG5F749hbe", "postedAt": "2023-02-23T06:10:24.476Z", "postId": "PTCw5CJT7cE6Kx9ZR", "htmlBody": "<p>\"I would feel sad if a bipolar friend, e.g., was strongly discouraged or even forcibly prevented from having children due to their condition, or if they were encouraged to seek out non-bipolar partners.\"<br><br>I would personally feel much more sad if a child was born with a horrible and debilitating disorder unnecessarily.&nbsp;</p><p>People with bipolar tend to have a very low quality of life, lower than most other disabilities, and experience lower functioning and well-being even in the stable phase of the disorder. I'm probably neutral/ lean-positive about existence in general, but I am fairly convinced that bringing someone into the world knowing that they have a very high chance of bipolar disorder is a major moral harm, especially when adoption/ surrogacy/ embryo selection present safer options.&nbsp;</p>", "parentCommentId": "7qiwfKFbXyuWaGSZB", "user": {"username": "Dzoldzaya"}}, {"_id": "WqyzxjX8QzjZdsGfc", "postedAt": "2023-02-23T10:18:53.908Z", "postId": "PTCw5CJT7cE6Kx9ZR", "htmlBody": "<blockquote><p>if a person with a disability refrains from having a child, that doesn't mean that some healthy person elsewhere has an extra child.</p></blockquote><p>It means there are fewer resources to go around, which fractionally disincentivises ~8 billion people from the expensive act of reproduction.</p><blockquote><p>I think you can have net-negative wellbeing and broadly think your life sucks, but still not sincerely want to die, or wish you'd never been born.</p></blockquote><p>This claim makes strong philosophical assumptions. One could question what it even means to either 'not wish you'd never been born' or to &nbsp;'not want to die when' when your wellbeing is negative.&nbsp;</p><p>One could also claim on a hedonic view that, whatever it means to want not to die, having net-negative wellbeing is the salient point and in an ideal world you would painlessly stop existing. This sounds controversial for humans, but we do it all the time with our pets: throughout their lives, they will fight for survival if put in a threatening state, but if we think they're suffering too much we will override their desires and take them for one last visit to the vet.</p>", "parentCommentId": "HDSHiisLJ9McL9LKy", "user": {"username": "Arepo"}}, {"_id": "2chJrnm6e85gGFnWz", "postedAt": "2023-02-23T10:20:42.770Z", "postId": "PTCw5CJT7cE6Kx9ZR", "htmlBody": "<p>This seems like a reiteration of Geoffrey Miller's <a href=\"https://forum.effectivealtruism.org/posts/PTCw5CJT7cE6Kx9ZR/most-people-endorse-some-form-of-eugenics?commentId=FJHwackD2qyyCduKy\">comment</a>, so all the discussion there applies.</p>", "parentCommentId": "4rembMXfpdey4SsPo", "user": {"username": "Arepo"}}, {"_id": "Zq5aQWPFNkmu6vhp3", "postedAt": "2023-02-23T10:29:43.195Z", "postId": "PTCw5CJT7cE6Kx9ZR", "htmlBody": "<blockquote>\n<p>One could question what it even means to either 'not wish you'd never been born' or to  'not want to die when' when your wellbeing is negative.</p>\n</blockquote>\n<blockquote>\n<p>One could also claim on a hedonic view that, whatever it means to want not to die, having net-negative wellbeing is the salient point and in an ideal world you would painlessly stop existing.</p>\n</blockquote>\n<p>Given that the lived experience of some (most?) of the people who live lives full of suffering is different from tha model, this suggests that the model is just wrong.</p>\n<p>The idea of modeling people as  having a single utility that can be negative and thus make their lives \"not worth living\" is <em>way</em> too simplistic.</p>\n<p>I don't want to give too much detail on a public forum, but I myself am also an example of how this model fails miserably.</p>\n", "parentCommentId": "WqyzxjX8QzjZdsGfc", "user": {"username": "Guy Raveh"}}, {"_id": "ieAyAAsyNwrwLTkjX", "postedAt": "2023-02-23T11:32:29.163Z", "postId": "PTCw5CJT7cE6Kx9ZR", "htmlBody": "<p>What do you mean 'the model is wrong'? You seem to be confusing functions (morality) with parameters (epistemics).</p><blockquote><p>The idea of modeling people as having a single utility that can be negative and thus make their lives \"not worth living\" is <i>way</i> too simplistic.</p></blockquote><p>It's also necessary if you want your functions to be quantitative. Maybe you don't, but then the whole edifice of EA becomes extremely hard to justify.</p>", "parentCommentId": "Zq5aQWPFNkmu6vhp3", "user": {"username": "Arepo"}}, {"_id": "YFhFirkfqg3QR5rPD", "postedAt": "2023-02-23T12:01:43.787Z", "postId": "PTCw5CJT7cE6Kx9ZR", "htmlBody": "<p>&gt;Most people endorse some form of 'eugenics'</p><p>No, they don't. It is akin to saying \"most people endorse some form of 'communism'.\" We can point to a lot of overlap between theoretical communism and values that most people endorse; this doesn't mean that people endorse communism. That's because communism covers a lot more stuff, including a lot of historical examples and some related atrocities. Eugenics similarly covers a lot of historical examples, including some atrocities (not only in fascist countries), and this is what the term means to most people - and hence, in practice, what the term means.</p><p>Many people endorse screening embryos for genetic abnormalities. The same people would respond angrily if you said they endorsed eugenics; the same way that people who endorse minimum wages would respond angrily if you said they endorsed communism. Eugenics is evil because it descriptively describes something evil; trying to force it into some other technical meaning is incorrect.</p>", "parentCommentId": null, "user": {"username": "Stuart Armstrong"}}, {"_id": "kiHsKCuigPQmtPDJF", "postedAt": "2023-02-23T12:03:07.738Z", "postId": "PTCw5CJT7cE6Kx9ZR", "htmlBody": "<p>Ah, you made the same point I did, but better :-)</p>", "parentCommentId": "J2qCLTjzpQouEoA8b", "user": {"username": "Stuart Armstrong"}}, {"_id": "HPxeL4uWZsY8cjLo7", "postedAt": "2023-02-23T14:41:34.946Z", "postId": "PTCw5CJT7cE6Kx9ZR", "htmlBody": "<p>In the current zeitgeist, and even for the past couple of decades, \"that's eugenics\" has shut down conversations among intelligent people about important topics like behavioral genetics, reproductive technology and subsidized contraception. \"Eugenicist\" has been leveled against everyone from Darwin to EO Wilson, to Margaret Sanger, to Bill Gates to Nick Bostrom as a way of signaling that we should ignore everything that person has to say and see everything they do or think as evil and illegitimate. Communist or communism isn't used in this way and communism doesn't have this sting. Maybe during the McCarthy era an essay like this could have also been necessary.&nbsp;</p><p>And of course people respond angrily if called a eugenicist- it's a term, as you said, that means \"evil\" in the current Western zeitgeist (but not in much of the rest of the world, as one commenter noted). This essay isn't meant to be dispassionate, it's meant to provoke the reader into rethinking how this term shuts down conversations about ideas and people.&nbsp;</p>", "parentCommentId": "YFhFirkfqg3QR5rPD", "user": {"username": "Sentientist"}}, {"_id": "mv6vxSeL6WKdk7kEC", "postedAt": "2023-02-23T15:03:25.274Z", "postId": "PTCw5CJT7cE6Kx9ZR", "htmlBody": "<p>That seems pretty dis-analogous to me - while exact definitions vary, communism does have a fairly precise thing its referring to - the state or collective worker ownership of the means of production, abolition of free markets etc. Supporting a minimum wage doesn't make someone a communist because 1) they probably don't support the nationalisation of all industry and 2) many communist countries didn't actually have a minimum wage. I think it's fair to say that, all else equal, a minimum wage supporter is probably closer to the communist side of the spectrum than someone who opposes them, but they're still a long way away.</p>", "parentCommentId": "YFhFirkfqg3QR5rPD", "user": {"username": "Larks"}}, {"_id": "w8utA3ypHLed8i7mw", "postedAt": "2023-02-23T15:33:37.054Z", "postId": "PTCw5CJT7cE6Kx9ZR", "htmlBody": "<p>IIRC, China didn't adopt the one-child policy based on traditional Chinese eugenics beliefs (优生 <i>yousheng</i> ). Rather, Deng Xiaoping's advisors in the 1970s over-reacted to Western antinatalist, degrowth, eco-alarmist propaganda as promoted by Paul Ehrlich, the Club of Rome, and others. Then in the late 1970s they hired physicists untrained in demography to do simplistic models of China's expected population growth, based on outdated, unreliable census data from the early 1960s. They panicked about Chinese 'over-population' because the West was panicking about 'over-population', and the one-child policy was the result. It was based only a little bit on Western or traditional Chinese eugenics; it was based mostly on eco-alarmism.</p><p>For more details on this strange story, see '<a href=\"https://www.amazon.com/Imperfect-Conceptions-Medical-Knowledge-Eugenics/dp/0231113706/\">Imperfect Conceptions</a>' by Frank Dikotter, and '<a href=\"https://www.amazon.com/Governing-Chinas-Population-Neoliberal-Biopolitics-ebook/dp/B001N2MEBM\">Governing China's population</a>' and '<a href=\"https://www.amazon.com/Just-One-Child-Science-Policy/dp/0520253396/\">Just one child</a>' by Susan Greenhalgh&nbsp;</p>", "parentCommentId": "CYybDAZFyLZkpDLBF", "user": {"username": "geoffreymiller"}}, {"_id": "BQGZHCgt6TNgR6yHd", "postedAt": "2023-02-23T16:19:45.000Z", "postId": "PTCw5CJT7cE6Kx9ZR", "htmlBody": "<p>I feel that saying \"subsidized contraception is not eugenics\" is rhetorically better and more accurate than this approach.</p>\n", "parentCommentId": "HPxeL4uWZsY8cjLo7", "user": {"username": "Stuart Armstrong"}}, {"_id": "CogRM7ygQerP4NYgt", "postedAt": "2023-02-23T16:24:09.151Z", "postId": "PTCw5CJT7cE6Kx9ZR", "htmlBody": "<p>Precisely. And supporting subsidized contraception is a long way away from both the formal definition of eugenics and its common understanding.</p>\n", "parentCommentId": "mv6vxSeL6WKdk7kEC", "user": {"username": "Stuart Armstrong"}}, {"_id": "4DdFSChNPZECaStAn", "postedAt": "2023-02-23T16:50:49.185Z", "postId": "PTCw5CJT7cE6Kx9ZR", "htmlBody": "<p>Saying \"subsidized contraception is not eugenics\" is a lie.&nbsp;</p>", "parentCommentId": "BQGZHCgt6TNgR6yHd", "user": {"username": "Sentientist"}}, {"_id": "gK5Rpg8pvTL4JEFeh", "postedAt": "2023-02-23T16:58:06.773Z", "postId": "PTCw5CJT7cE6Kx9ZR", "htmlBody": "<p>The first definition I get from google for 'eugenics' is</p><blockquote><p>the study of how to arrange reproduction within a human population to increase the occurrence of heritable characteristics regarded as desirable.</p></blockquote><p>which seems like it includes a lot of the things described in this post that normal people support like incest avoidance and your example of embryo screening?</p><p>In contrast the first definition I get for 'communism' is very narrow and makes it clear that necessary components include things most people don't believe (class war, public ownership):</p><blockquote><p>a political theory derived from Karl Marx, advocating class war and leading to a society in which all property is publicly owned and each person works and is paid according to their abilities and needs.</p></blockquote>", "parentCommentId": "CogRM7ygQerP4NYgt", "user": {"username": "Larks"}}, {"_id": "xuj3qGiyFeoztdJQT", "postedAt": "2023-02-24T03:07:51.923Z", "postId": "PTCw5CJT7cE6Kx9ZR", "htmlBody": "<p>Yep, agreed (I haven't read those books, but I broadly know the story). I wasn't trying to imply that eugenics was the main cause of the one-child policy, but the two are definitely connected. Post-1CP, the state took a really active role in controlling how and when kids were born, compulsory sterilisation (mostly of females, despite vasectomies being safer) became normalised for 'quality and quantity' etc.&nbsp;<br><br>A stronger \"eugenics taboo\" could plausibly have limited the scope of the policy.</p>", "parentCommentId": "w8utA3ypHLed8i7mw", "user": {"username": "Dzoldzaya"}}, {"_id": "kL8G4vLoQbhvtDPAH", "postedAt": "2023-02-24T03:10:19.444Z", "postId": "PTCw5CJT7cE6Kx9ZR", "htmlBody": "<p>\"Is the idea to fully confront the arguments/controversies that come up over the \"eugenic implications\" of newer reproductive technologies?\"</p><p>Yes, exactly. The advent of polygenic screening and the <a href=\"https://www.geneticsandsociety.org/biopolitical-times/hipster-eugenics-better-babies-billionaires\">first</a> <a href=\"https://www.geneticsandsociety.org/biopolitical-times/first-polygenic-risk-score-baby\">people</a> to use it to select embryos has brought this issue to the fore.&nbsp;</p>", "parentCommentId": "YDmApKhWZGAoXRSbA", "user": {"username": "Sentientist"}}, {"_id": "itsFBJ5GXWGd2YFtm", "postedAt": "2023-02-24T05:35:41.978Z", "postId": "PTCw5CJT7cE6Kx9ZR", "htmlBody": "<p>The major problem with your post (and with eugenics) is that you assume desirable genetics are good genetics. In reality, there is no such thing as \"good\" genetics. Either you survive or you don't, a person with many ailments can live longer and have more children than a conventionally fit person, because we live in a dynamic environment with volcanoes and staircases and murderers. The best genetics are a wide variety of genetics, because the environment is ever changing and what is good today may not be good in 10000 years, and if you breed out the \"bad\" genetics, you won't have the tools available to deal with the changed environment. &nbsp;</p><p>Any kind of selection of partners should happen as unconsciously as possible. This is partly why most people fall in love with strangers and don't select partners with the exact optimal genes. There is no dating app that matches you with your exactly optimal genetic partner (don't get any ideas if you live in silicon valley), people don't want that and it speaks to our innate desire to select a variety of genes rather than the \"best\" genes. Even though genes that happen to be good in the current environment tend to be more selected for, this happens naturally and unconsciously which is what separates it from eugenics. Eugenics always involves some authority deciding which genetics are good and bad and then organising social structures to enforce those categories. This is obviously wrong.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Apples to Apples"}}, {"_id": "D5wFdgMEW6HT9uQzv", "postedAt": "2023-02-24T12:02:04.598Z", "postId": "PTCw5CJT7cE6Kx9ZR", "htmlBody": "<p>I argue that it's entirely the truth, the way that the term is used and understood.</p>\n", "parentCommentId": "4DdFSChNPZECaStAn", "user": {"username": "Stuart Armstrong"}}, {"_id": "ZoCti22iQbWwCu3S7", "postedAt": "2023-02-25T20:23:38.867Z", "postId": "PTCw5CJT7cE6Kx9ZR", "htmlBody": "<p>Could someone please expand on the relevance of this post to EA? It is not clear to me how it contributes to the discussion around Bostrom nor what the \"important means of improving the world\" are.</p>\n", "parentCommentId": null, "user": {"username": "Ulrik Horn"}}, {"_id": "bsKefBFbKcGNn7hiR", "postedAt": "2023-02-25T20:54:00.056Z", "postId": "PTCw5CJT7cE6Kx9ZR", "htmlBody": "<p>Many EA ideas and proposals get called 'eugenic' by conservative commentators -- especially those concerning transhumanism, cognitive enhancement, moral enhancement, mind/machine interfaces, etc. EAs might not be very aware of these criticism, since they mostly come from outside EA, and from political and religious views that few EAs share.&nbsp;</p><p>But IMHO we need to be able to challenge the term 'eugenics' as an all-purpose slander that gets thrown around against any proposals that involve nudging the direction of future human development.</p>", "parentCommentId": "ZoCti22iQbWwCu3S7", "user": {"username": "geoffreymiller"}}, {"_id": "u6vy6DBSABG6pcAQc", "postedAt": "2023-03-11T01:39:39.186Z", "postId": "PTCw5CJT7cE6Kx9ZR", "htmlBody": "<p>What is \"net positive utility\"? What is the zero point?</p>\n", "parentCommentId": "FJHwackD2qyyCduKy", "user": {"username": "Pinecone"}}, {"_id": "aneKhLJY6jcdp5Qof", "postedAt": "2023-03-11T01:50:43.037Z", "postId": "PTCw5CJT7cE6Kx9ZR", "htmlBody": "<p>If the phrase \"Most people have net-positive utility\" is rephrased as \"most people don't actively want to not exist\" it sounds totally unsurprising, and not nearly as positive as the original sentence. Moreover,  it doesn't seem to be the definition  most utilitarians use: For example, \"It's okay to create people as long as they will have net positive utility\" would lose all intuitive support if transformed into \"It's okay to create people as long as they won't actively want to not exist, even if their lives are filled with suffering\".</p>\n", "parentCommentId": "WqyzxjX8QzjZdsGfc", "user": {"username": "Pinecone"}}, {"_id": "xHbreK7hJiCGXhYL4", "postedAt": "2023-03-17T13:03:44.075Z", "postId": "PTCw5CJT7cE6Kx9ZR", "htmlBody": "<p>I'm inclined to consider it <i>far</i> more counterintuitive to think 'if this person experiences overall slightly more negative than positive affect, but very much wants to live, and find their life meaningful, and I painlessly murder them in their sleep, then I have done them a favor', which is what a purely hedonist account of individual well-being implies. (Note that this is about what is good <i>for them</i>, not what you morally ought to do, so standard utilitarian stuff about why actually murdering people will nearly always decrease overall utility across all people is true but irrelevant.)&nbsp;</p>", "parentCommentId": "aneKhLJY6jcdp5Qof", "user": {"username": "Dr. David Mathers"}}, {"_id": "MgecsgZCjCg6eyn7t", "postedAt": "2024-02-22T11:08:54.652Z", "postId": "PTCw5CJT7cE6Kx9ZR", "htmlBody": "<p>Fact updated: In recent days, China is encouraging young people to have more children, in order to fight population aging. It is now allowed to have 3 children per family. Despite the recent propaganda of having more children, lots of young people in China are not willing to have even one child because the higher education and/or marriage cost, and the birth rate keeps dropping.</p>", "parentCommentId": "CYybDAZFyLZkpDLBF", "user": {"username": "Ligeia"}}]