[{"_id": "Mtjpeyunvwmz6gmqR", "postedAt": "2023-11-22T20:55:24.025Z", "postId": "PTHskHoNpcRDZtJoh", "htmlBody": "<p>For the other recommended funds on the GWWC website, will you be evaluating the EA Infrastructure Fund, Founders Pledge Climate Fund, and the Founders Pledge Patient Philanthropy Fund? What will happen to their current recommended status in the meantime?<br><br>Also, did you evaluate GW's Top Charity Fund of All Grants Fund?</p>", "parentCommentId": null, "user": {"username": "eleanor mcaree"}}, {"_id": "reByLjSZnrCuESxnH", "postedAt": "2023-11-22T21:53:11.455Z", "postId": "PTHskHoNpcRDZtJoh", "htmlBody": "<p>Great to read this. Did you evaluate The Life You Can Save org as part of this process? Can you share any feedback if so?</p>\n", "parentCommentId": null, "user": {"username": "Rebecca Herbst"}}, {"_id": "W8GvKYFAYPXweTt3z", "postedAt": "2023-11-23T07:07:20.443Z", "postId": "PTHskHoNpcRDZtJoh", "htmlBody": "<p>I really love this summary of GiveWell, it resonates with how I feel about their great work, and brings out a couple of nuances as well nice one!</p>", "parentCommentId": null, "user": {"username": "NickLaing"}}, {"_id": "DPdxMcfwnuFsToavt", "postedAt": "2023-11-23T08:36:40.720Z", "postId": "PTHskHoNpcRDZtJoh", "htmlBody": "<p>Re Top Charities vs All Grants, you can read it in the linked evaluation on GiveWell: <a href=\"https://docs.google.com/document/d/1rn1d69KR3zfVzZaRZvSZNp1vcDap1hudzxngNqeFHuc/edit.\">https://docs.google.com/document/d/1rn1d69KR3zfVzZaRZvSZNp1vcDap1hudzxngNqeFHuc/edit.</a> As I read it, it's both - and an evaluation of GiveWell as an advisor overall.<br><br>GWWC picked Deworming as a probe into the difference between All Grants and Top Charities, and came away with the expected conclusion. Paraphrased: \"AGF recommendations are highly impactful in expectation but with a wider outcome space (higher uncertainty either way)\".</p>", "parentCommentId": "Mtjpeyunvwmz6gmqR", "user": {"username": "Jonas Lindeløv"}}, {"_id": "PafR4pLRAAWqjtT9c", "postedAt": "2023-11-23T08:43:56.790Z", "postId": "PTHskHoNpcRDZtJoh", "htmlBody": "<p>At <a href=\"https://giveffektivt.dk/\">Giv Effektivt (Denmark)</a>, we're looking towards expanding from Global Health to multiple cause areas by next summer (2024), probably starting with a limited set of options. Your work here will play an important role in those decisions. Thanks!<br><br>A fun meta-reflection: where will this chain of evaluations stop? Will there be an evaluation of evaluator-evaluators? Evaluations all the way down? I guess whatever goes down in the comments here will be exactly that.</p>", "parentCommentId": null, "user": {"username": "Jonas Lindeløv"}}, {"_id": "WKxTASBWadH6d7Z7P", "postedAt": "2023-11-23T10:14:19.771Z", "postId": "PTHskHoNpcRDZtJoh", "htmlBody": "<p>What a great post, thank you so much for doing this important work.&nbsp;</p><p>I'm interested to know why you chose to \"still think ACE’s funds and recommendations are worth considering for impact-focused donors and we will continue to host them on the GWWC donation platform\" and later say \"ACE’s charity evaluation process does not currently measure marginal cost-effectiveness to a sufficient extent for us to rely directly on the resulting charity recommendations\". I understand that there may be hope for the future but right now if the role of EA is to nudge people to the opportunities that have the highest marginal impact per dollar, shouldn't GWWC focus exclusively on EAWF, or are you saying there is something lacking in the analysis here?<br><br>Would appreciate some clarification</p>", "parentCommentId": null, "user": {"username": "anon2021"}}, {"_id": "nhhg3D8g3TESvZ52G", "postedAt": "2023-11-23T12:47:16.958Z", "postId": "PTHskHoNpcRDZtJoh", "htmlBody": "<p><strong>Executive summary</strong>: Giving What We Can (GWWC) evaluated five organizations focused on charity evaluation and grantmaking, assessing their processes and making recommendations on which to rely on for donations.</p><p><strong>Key points</strong>:</p><ol><li>GWWC will continue relying on GiveWell for global health recommendations and ask them to advise a new GWWC fund. GiveWell's processes are strong, though judgement plays a role in comparisons and some analyses.</li><li>The evaluation of Happier Lives Institute was stopped as the costs were deemed to outweigh the benefits.</li><li>The EA Funds' Animal Welfare Fund is recommended as a top fund option based on grant quality and room for more funding.</li><li>Animal Charity Evaluators is not recommended for charity recommendations currently. One program by The Humane League is recommended based on multiple sources.</li><li>The EA Funds' Long-Term Future Fund and the Longview Philanthropy Longtermism Fund are both recommended top funds for reducing global catastrophic risks, with GWWC allocating to both. Each fund has some areas for improvement.</li></ol><p><br><i>This comment was auto-generated by the EA Forum Team. Feel free to point out issues with this summary by replying to the comment, and</i><a href=\"https://forum.effectivealtruism.org/contact\"><i>&nbsp;<u>contact us</u></i></a><i> if you have feedback.</i></p>", "parentCommentId": null, "user": {"username": "SummaryBot"}}, {"_id": "KTBTuwFr6nnQhKK9N", "postedAt": "2023-11-23T14:09:06.975Z", "postId": "PTHskHoNpcRDZtJoh", "htmlBody": "<p>Bumping that GWWC's research team is running an AMA <a href=\"https://forum.effectivealtruism.org/posts/xcDZccfWkA6a9Atuv/ama-gwwc-research-team\">here</a>. They will respond to questions there until Tuesday 28th 9pm UTC.&nbsp;</p>", "parentCommentId": null, "user": {"username": "tobytrem"}}, {"_id": "dzkEMmMYozwopWjs8", "postedAt": "2023-11-23T15:01:40.759Z", "postId": "PTHskHoNpcRDZtJoh", "htmlBody": "<p>Using an anonymous account because this is sensitive. The below is critical, but I love GWWC, and personally agree with your recommendation of the EA AWF as the best opportunity for most donors in the AW space.</p><p>I'm quite surprised you chose to include The Humane League specifically and not other ACE Top Charities, and based on the evaluation, it sounds like this is largely based on RP and Founders Pledge work from 2018/2019, and not more recent evaluations, as well as a referral from Open Phil.</p><p>A few comments on why this seems like a bad decision:</p><ul><li>My impression is that basically everyone within the animal space who has read them thinks those cost-effectiveness analyses are no longer accurate, and reflect an earlier period of success. Most people also seem to think corporate campaigns are no longer nearly as effective as they were historically (even staff within The Humane League).</li><li><a href=\"https://forum.effectivealtruism.org/posts/btTeBHKGkmRyD5sFK/open-phil-should-allocate-most-neartermist-funding-to-animal?commentId=3uBrznQWEqs83PAfh\">Open Phil said just last week</a> that they think marginal opportunities in the AW space right now are 1/5th as cost-effective as RP's estimate (a claim I don't buy fully, but seems like evidence against using this for your recommendation)</li><li>A cursory glance at the trackers for corporate commitments shows that:<ul><li><a href=\"https://chickenwatch.org/progress-tracker/?filterK=Cage-free\">Cage-free commitments secured annually</a> have been massively declining (from a peak of around 500 per year in 2018/2019 when the analyses you used are from, to under 150 in 2023 (so far, though seems on track to not get to 150).</li><li><a href=\"https://welfarecommitments.com/broiler/\">The vast majority of broiler commitments</a> were secured prior to 2020. In 2023 only 6 (!) have been secured, all from fairly tiny companies.</li><li>It looks like the majority of recent commitments are from smaller companies (e.g. looks like the majority of \"household names\" in many countries committed years ago or have never committed), so my using \"companies\" as a metric of success is likely distortingly positive, so things could be even worse.</li></ul></li><li>Most cage-free work now is focused on enforcement of past commitments, not new commitments.<ul><li>This likely means the situation is even worse, as while dollars spent today might increase the number of animals helped, it likely means the estimates you used are overly optimistic (if they didn't account for future spending needs to secure high levels of enforcement).</li></ul></li><li>People who work in the space generally seem to view the broiler ask as bad / unlikely to be realized at any scale.</li></ul><p>I haven't really looked at this in detail, but I'm just pretty surprised you decided to recommend THL (and that THL is still the default giving option still in the animal space) without even checking the status of those analyses today, where I think they pretty obviously fail a basic sense check as still being accurate.<br><br>Obviously the historic figures no longer being accurate doesn't necessarily mean THL isn't the best option today, but it seems strange to not even glance at the current state of evidence prior to singling out a single charity when rejecting ACE's evaluations. I personally suspect THL is no longer the best opportunity for marginal donations in the space by a somewhat wide margin, and would guess that most people who work in the space also don't think this.</p>", "parentCommentId": null, "user": {"username": "mildlyanonymous"}}, {"_id": "of7txjxyhRYtc9B28", "postedAt": "2023-11-23T18:50:40.915Z", "postId": "PTHskHoNpcRDZtJoh", "htmlBody": "<p>I'm very excited to see this. To be honest when I first heard of the \"evaluate the evaluators\" project I was very skeptical and thought it would just be a rubber stamp on the EA ecosystem in a way that would play well for social media and attract donations.</p>\n<p>I definitely was wrong!</p>\n<p>It's good to see that there actually was substantive meta-evaluation here and that the GWWC meta-evaluators did not pull punches!</p>\n", "parentCommentId": null, "user": {"username": "Peter_Hurford"}}, {"_id": "h3vrNMvyrmN42KRba", "postedAt": "2023-11-23T21:42:43.087Z", "postId": "PTHskHoNpcRDZtJoh", "htmlBody": "<p>Agree with lots of the above.&nbsp;</p><p>It also just seems very bizarre that the GWWC's animal fund pays out half to EA AWF and half to THL. Surely if you thought that EA AWF was a good evaluator or donation opportunity for donors, you would just let them manage the entirety of the fund? As then EA AWF would be able to distribute to THL if they actually thought THL was the most effective use of funds on the margin. And if not, even better, as they can give to more effective opportunities.</p><p>Also responding to the below points in your <a href=\"https://docs.google.com/document/d/10IBsoXr3_QRp9myG5Qn3gpPE9V_98zKyKbJOC6xIoqE/edit\">ACE evaluation report</a>:&nbsp;</p><blockquote><p>We also think that recommending at least one competitive alternative to the AWF in the animal welfare space — if we transparently and justifiably can — is valuable.&nbsp;</p></blockquote><p>I'm also curious why you felt the need to recommend at least one competitive alternative to the AWF, when the AWF itself is a fairly diversified fund? Arguably, you marked ACE down for similar reasoning in your evaluation of their Movement Grants (that they were spreading their grants across many groups rather than focusing mostly on the most effective groups)</p><blockquote><p>However, we still think funding them [THL] is likely highly cost-effective, and the most justifiable charity recommendation we can currently make, based on the available evidence and our limited time.</p><p>We decided not to make an explicit comparison between THL’s corporate campaign work and the AWF in terms of their marginal cost-effectiveness, as we thought we would be unlikely to find a justifiable difference between the two in the limited time we had available, including because the types of evidence we have for each are so different.</p></blockquote><p>Statements like this make me worry that this evaluation focused too much on the certainty of some positive impact, rather than maximising expected impact (i.e. measurability bias). As mentioned in the comment above, you would struggle to find many experienced animal advocates who would confidently recommend THL as the <strong>single best</strong> marginal giving opportunity. In reality, they would likely either advocate for a spread of groups using different approaches or just simply give to a fund (e.g. EA AWF or ACE).&nbsp;</p>", "parentCommentId": "dzkEMmMYozwopWjs8", "user": {"username": "JamesOz"}}, {"_id": "LsmuZNDShJ3LsAKf8", "postedAt": "2023-11-24T10:11:06.185Z", "postId": "PTHskHoNpcRDZtJoh", "htmlBody": "<p>First of all, thank you for the extensive comments!</p><p>I can give more context during <a href=\"https://forum.effectivealtruism.org/posts/xcDZccfWkA6a9Atuv/ama-gwwc-research-team\">our AMA</a> next week if helpful (I won't have much time to engage in the coming few days unfortunately), but wanted to just quickly react to avoid a misunderstanding about our views here. I've copy-pasted from <a href=\"https://docs.google.com/document/d/10IBsoXr3_QRp9myG5Qn3gpPE9V_98zKyKbJOC6xIoqE/edit#heading=h.noub0huthawm\">the relevant section from the report</a> below:</p><blockquote><p><i>To be clear, there are strong limitations to this recommendation:</i></p><ul><li><i>We didn’t ourselves evaluate THL’s work directly, nor did we compare it to other charities (e.g., ACE’s other recommendations).</i></li><li><i>The availability of evidence here may be high relative to other interventions in animal welfare, but is still low compared to interventions we recommend in global health and wellbeing. We haven’t directly evaluated Open Philanthropy, Rethink Priorities, or Founders Pledge as evaluators.&nbsp;</i></li><li><i>We have questions about the external validity of the evidence for corporate campaigns, i.e. whether they are as cost-effective when applied in new contexts (e.g. low- and middle-income countries in Africa) as they seem to have been where the initial evidence was collected (mainly in the US and Europe).&nbsp;</i></li><li><i>We also have questions about the extent to which the evidence for corporate campaigns is out of date, as the Founders Pledge and Rethink Priorities reports are from more than four years ago and we would expect there to be diminishing returns to corporate campaigns over time, as the “low-hanging fruits” in terms of cost-effectiveness are picked first.</i></li></ul><p><i>Taken together, all of this means we expect funding THL’s current global corporate campaigns to be (much) less cost-effective than the corporate campaigns in 2016-2017, which were evaluated in those reports.^1&nbsp;</i><br><br><i>^1 It is worth noting that Open Philanthropy confirmed to us that it thinks so as well: its referral is not a claim that funding THL’s corporate campaigns will be exactly as cost-effective as it probably was a couple of years ago, when THL achieved big wins on a small budget, but a claim that funding them is likely still among the most cost-effective options in the space, and that THL can productively use a lot of extra funding without strongly diminishing marginal returns to funding currently provided.</i></p></blockquote><p><strong>So in short, we share your impression that THL's work is (much) less cost-effective than it was a few years ago. We are aware of Open Phil's views on this, and their referral of THL's work to us took these diminished expected returns into account. The FP and RP reports weigh (much) less heavily in our recommendation of THL's current work than ACE's and OP's recommendations, but we think those reports still provide a useful (and publicly accessible) reference on corporate campaigns as an intervention more generally.</strong><br>&nbsp;</p>", "parentCommentId": "dzkEMmMYozwopWjs8", "user": {"username": "SjirH"}}, {"_id": "RKxJTK6zistF9coo3", "postedAt": "2023-11-26T15:24:19.707Z", "postId": "PTHskHoNpcRDZtJoh", "htmlBody": "<p>Hi Sjir, Alana and Michael,</p><p>Thanks for the update on this valuable project!</p><blockquote><p>Based on our evaluation, we’ve decided to continue to rely on GW’s charity recommendations and to ask GW to advise our new GWWC Global Health and Wellbeing Fund.</p></blockquote><p>It is understandable that you asked GW to advise your new GWWC Global Health and Wellbeing Fund instead of directing the donations it received to EA Funds' <a href=\"https://funds.effectivealtruism.org/funds/global-development\">Global Health and Development Fund</a>, as this is also advised by GW. However, this arguably means there will be a significant correlation between the grants made by 4 funds:</p><ul><li>GWWC Global Health and Wellbeing Fund.</li><li>EA Funds' Global Health and Development Fund.</li><li>GW's <a href=\"https://www.givewell.org/top-charities-fund\">Top Charities Fund</a>.</li><li>GW's <a href=\"https://www.givewell.org/all-grants-fund\">All Grants Fund</a>.</li></ul><p>Have you considered allocating the donations made to the GWWC Global Health and Wellbeing Fund to GW's funds? As an aside, it is also unclear to me what is the added value of EA Funds' Global Health and Development Fund.</p>", "parentCommentId": null, "user": {"username": "vascoamaralgrilo"}}, {"_id": "FfeeC52aDrBdzMbSj", "postedAt": "2023-11-27T08:02:15.168Z", "postId": "PTHskHoNpcRDZtJoh", "htmlBody": "<p>Thanks for your work on this!</p><p>I am interested in how you would prioritise between ACE's Movement Grants (MG) and their recommended charities. What would you recommend, if you had to recommend one of them, and why? From how I read your analysis, it seems that you think that MG are the better option. Do I read that correctly?</p>", "parentCommentId": null, "user": {"username": "moritz-stumpe"}}, {"_id": "i2bZDCfeog7B2sTJu", "postedAt": "2023-11-27T19:36:35.239Z", "postId": "PTHskHoNpcRDZtJoh", "htmlBody": "<p>Thanks for your comments and questions, James.</p>\n<blockquote>\n<p>Surely if you thought that EA AWF was a good evaluator or donation opportunity for donors, you would just let them manage the entirety of the fund? As then EA AWF would be able to distribute to THL if they actually thought THL was the most effective use of funds on the margin. And if not, even better, as they can give to more effective opportunities.</p>\n</blockquote>\n<p>The short answer is \"no\": we don't think we can currently justify the claim that giving to the AWF is better than giving to THL's corporate campaigns, or vice versa. We did indeed conclude from our evaluation that the AWF can likely use marginal funds cost-effectively, but that isn't the same as deferring to them on all fronts (including because we also found significant room for improvement, as explained in the <a href=\"https://docs.google.com/document/d/1hqYNZ9zJfe3D_nyJ4b21J0IJs210upAXTw8fPWnYJe8/edit#heading=h.kiw67f2s2v90\">AWF report</a>), nor does it imply the AWF is <em>better</em> at allocating extra capital than THL is.</p>\n<blockquote>\n<p>I'm also curious why you felt the need to recommend at least one competitive alternative to the AWF, when the AWF itself is a fairly diversified fund? Arguably, you marked ACE down for similar reasoning in your evaluation of their Movement Grants (that they were spreading their grants across many groups rather than focusing mostly on the most effective groups)</p>\n</blockquote>\n<p>Our goal is to provide recommendations to help donors maximise their impact from the perspective of a variety of worldviews, and it's in that light that we decided to also recommend THL's corporate campaigns: consider that someone else could have made an (I think justifiable) comment that is entirely the opposite of what you are saying, i.e. that we should <em>only</em> recommend THL because there we actually have some independent evidence of their intervention working and being highly cost-effective, which is lacking for many if not most of the projects the AWF funds (given the early stage of the AW charity evaluation space).</p>\n<p>We criticized ACE MG not for making grants to multiple groups but for doing so at the seeming expense of expected impact. As mentioned above, we don't think THL's corporate campaigns are a worse donation opportunity than the AWF, and we think there may be donors who think it's more cost-effective in expectation, for instance because they put less weight on the individual judgement of grantmakers (or on our judgement in evaluating AWF to be a good donation opportunity!) and think the publicly available evidence for THL is stronger.</p>\n<blockquote>\n<p>Statements like this make me worry that this evaluation focused too much on the certainty of some positive impact, rather than maximising expected impact (i.e. measurability bias).</p>\n</blockquote>\n<p>I think you're right to worry about this - I do as well! - as I would say there <em>is</em> some implicit measurability bias in our recommendations. Most notably, we ended up recommending THL's corporate campaigns over other ACE recommendations not because we have strong evidence that they are a <em>better</em> donation opportunity than any other <em>individual</em> ACE recommendation, but because they are the only one where we think we have sufficient evidence to justify recommending them.</p>\n<p>However, this is importantly different from us prioritising certainty of some positive impact over maximum expected impact: <strong>THL's corporate campaigns <em>is</em> our best guess donation opportunity to maximise expected impact</strong> (alongside the AWF). If we thought we could have easily justified any one of ACE's other recommendations was better - or even just as good - from that perspective, we would have recommended them, but we currently can't. And please note that \"justifying\" here isn't about finding \"certainty of positive impact\": we are looking for the expected value case (as we do for the AWF and our other recommendations as well).</p>\n<blockquote>\n<p>As mentioned in the comment above, you would struggle to find many experienced animal advocates who would confidently recommend THL as the single best marginal giving opportunity. In reality, they would likely either advocate for a spread of groups using different approaches or just simply give to a fund (e.g. EA AWF or ACE).</p>\n</blockquote>\n<p>This is a much stronger claim than we are making (THL's corporate campaigns being the \"single best marginal giving opportunity\"): we think it's one of the two best donation opportunities we can, from the information we have available, recommend to a broad set of donors to maximise their expected impact. We are not claiming that nobody could do better (certainly by their individual values/worldview!), and encourage donors to do their own (further) research if they have the time and expertise available. This is also why we host a broader selection of promising programs donors can look into and support on our <a href=\"https://www.givingwhatwecan.org/en-US/donate/organizations#animal-welfare\">donation platform</a>.</p>\n", "parentCommentId": "h3vrNMvyrmN42KRba", "user": {"username": "SjirH"}}, {"_id": "nSDLN8qdyLC6ADoQD", "postedAt": "2023-11-28T04:34:58.388Z", "postId": "PTHskHoNpcRDZtJoh", "htmlBody": "<blockquote><p><strong>THL's corporate campaigns </strong><i><strong>is</strong></i><strong> our best guess donation opportunity to maximise expected impact</strong> (alongside the AWF). If we thought we could have easily justified any one of ACE's other recommendations was better - or even just as good - from that perspective, we would have recommended them, but we currently can't. And please note that \"justifying\" here isn't about finding \"certainty of positive impact\": we are looking for the expected value case (as we do for the AWF and our other recommendations as well).</p></blockquote><p>Based on your paragraph below from the ACE Report, I'm inferring that you only looked at three (out of 11) ACE recommendations, which only included charities evaluated in 2023, rather than 2022? So by default, GFI, Sinergia, Fish Welfare Initiative, Kafessiz and DVF were all excluded from potentially being identified (which seems illogical, as there is no obvious reason to think that charities evaluated in 2022 would be less cost-effective).<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefj9bf0idvcci\"><sup><a href=\"#fnj9bf0idvcci\">[1]</a></sup></span></p><blockquote><p>ACE helpfully — and on very short notice — provided us with private documentation to elaborate on the cases for <strong>three of its 2023 charity recommendations [emphasis mine]</strong>. Unfortunately — potentially in part because of time constraints ACE had&nbsp; — we still didn’t find these cases to provide enough evidence on the marginal cost-effectiveness of the charities to justify relying on them for our recommendations.</p></blockquote><p>Given you only looked at three of the ACE 2023 recommendations (and you didn't say which ones), I'm wondering how you can make such a strong claim for all of ACE's recommended charities?</p><blockquote><p>If we thought we could have easily justified <i><strong>any one of ACE's other recommendations [emphasis mine]</strong></i> was better - or even just as good - from that perspective, we would have recommended them, but we currently can't.&nbsp;</p></blockquote><p>On a slightly unrelated point: For the referral from OP, I would be curious to hear if you asked them \"What is the most cost-effective marginal giving opportunity for farmed animal welfare\" (to which they replied THL's corporate campaigns) or something closer to \"Do you think THL is a cost-effective giving opportunity on the margin?\"</p><blockquote><p>This is a much stronger claim than we are making (THL's corporate campaigns being the \"single best marginal giving opportunity\"): we think it's one of the two best donation opportunities we can, from the information we have available, recommend to a broad set of donors to maximise their expected impact.</p></blockquote><p>Fair enough! I should have said \"One of the top 2 marginal giving opportunities\" but I still think I stand by my point that many experienced animal advocates would disagree with this claim, and it's not clear that your charity recommendation work has sufficient depth to challenge that (e.g. you didn't evaluate groups yourself), in which case it's not clear why folks should defer to you over subject-matter experts (e.g. AWF, OP or ACE).</p><p>&nbsp;</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnj9bf0idvcci\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefj9bf0idvcci\">^</a></strong></sup></span><div class=\"footnote-content\"><p>You might say there is weaker evidence of their cost-effectiveness as it's been a year since they were evaluated but since you said you focused on the expected value case rather than certainty of positive impact, I assume this wasn't your issue.</p></div></li></ol>", "parentCommentId": "i2bZDCfeog7B2sTJu", "user": {"username": "JamesOz"}}, {"_id": "2YdTi8L6PS4irnmrv", "postedAt": "2023-11-28T09:27:45.679Z", "postId": "PTHskHoNpcRDZtJoh", "htmlBody": "<p><strong>First, we want to sincerely thank Giving What We Can for running this “Evaluating the Evaluators” exercise.</strong> We recognize that ACE has set ourselves a difficult task, compounded by the fact that we’re the only organization doing what we do. Therefore, receiving this kind of feedback is both very rare and very welcome. There’s a great deal in GWWC’s report that will help us improve our processes for 2024, which ultimately means more animals will be helped and spared. While we were disappointed that GWWC has decided not to defer to our recommendations this year or recommend our Movement Grants program as a top-rated fund, we were heartened by the positive points in their report and their optimism about ACE’s future, and look forward to receiving further helpful feedback in a future evaluation from them. We were also delighted that GWWC recommended the EA Animal Welfare Fund as an effective giving opportunity.</p><p><strong>Second, as an organization that values transparency and seeks to be open about our own limitations, we appreciated GWWC’s same openness about the limitations to, and uncertainties around, their evaluation.</strong> As they noted, this included limitations to their animal welfare expertise, the early stage of the charity evaluation space in animal welfare, and the time constraints forcing them to take a minimum viable product approach to this evaluation. The bulk of this year’s process also coincided with the culmination of our charity recommendation decisions—which, combined with GWWC’s demanding deadlines, made some aspects of the process challenging for us. GWWC fully recognized this, and we are confident that any future evaluation exercise will be even more helpful than this year’s.&nbsp;&nbsp;</p><p><strong>Third, we were reassured that much of GWWC’s constructive feedback aligns with ACE’s own self-identified areas for improvement.</strong> For example, we agree that we need to continuously assess whether we want to give out fewer, larger Movement Grants than we do currently. We also agree that we should be more strategic in using the valuable feedback we get from our Movement Grants grantees to inform our own views on priority tactics and translate this into useful information for the broader animal advocacy movement.</p><p>We are also continuously working toward improvements to our charity evaluation methods, such as how to more sensitively capture differences in scope. As in previous years, we will be conducting a thorough review of the top-priority improvements to make to next year’s Movement Grants and Charity Evaluations programs. We will certainly draw on GWWC’s feedback for this while also acknowledging that capacity constraints will inevitably make it impossible to make all of the improvements we would like.&nbsp;</p><p><strong>Fourth, there are some elements of GWWC’s report that we did not fully agree with</strong>. For example, while we agree that there’s plenty of opportunity for improvements to our Cost Effectiveness model to ensure that it reflects the cost effectiveness of charities’ achievements as accurately as possible, we would like to highlight that this year’s model is the result of considerable research, external guidance, and exploration of alternatives. We built this year’s model systematically to try to capture the most important aspects of what makes achievements impactful, based on empirical evidence wherever possible, and the quantitative metric closest to impact on animals that we could access for all charities’ achievements (e.g., the number of people reached per dollar for an educational campaign). We consulted with several external experts on how to best combine these scores into a single score and went through several iterations to ensure that the scores held up in confidence checks. We also think it’s likely that GWWC is overestimating how easy it is to deliver on their recommendation of reliably estimating the “marginal cost effectiveness of a dollar spent on the charity, based on the charity’s specific context.”&nbsp;In some past rounds of our Charity Evaluations program, ACE carried out back-of-the-envelope-calculation (BOTEC)-type cost-effectiveness modeling using&nbsp;<a href=\"https://www.getguesstimate.com/\"><u>Guesstimate</u></a>, which aligns with GWWC’s recommendation. However, ACE then decided to change this approach for the reasons&nbsp;<a href=\"https://animalcharityevaluators.org/blog/some-updates-to-our-charity-evaluation-process-2019/#making-changes-to-our-cost-effectiveness-models\"><u>outlined here</u></a>. We continuously review this decision and are open to reintroducing elements of our past approach if we determine it would be valuable for more effectively advancing our theory of change.&nbsp;</p><p>As another example of disagreement, GWWC noted that they would prefer our Movement Grants program to focus exclusively on national or international projects rather than the types of regional projects we have sometimes funded. However, given that one of the aims of the Movement Grants program is to build up the movement in priority regions with a relatively small animal advocacy movement, and that for some regions, we receive significantly more applications for regional projects than for high-quality, tractable, national-level applications, we expect that we will continue funding some regional projects that we consider particularly promising. Relatedly, GWWC disagrees with our view that funding projects in countries with very little animal advocacy representation should be a key part of ensuring the animal advocacy movement’s long-term success, noting that others may reasonably be more sympathetic to this view.</p><p><strong>Fifth, we share GWWC’s commitment to prioritizing marginal funding to the projects where it will be the most cost effective.&nbsp;</strong>However, elements of ACE’s work—none of which are unique to us—make this particularly complex to achieve in practice. With our charity evaluations, for example, we only re-evaluate charities every two years, and we do not directly disburse most of the funding that we influence to our Recommended Charities. As such, ACE does not ​​regularly calculate cost effectiveness over a range of possible allocations and distributes funding only to those above a particular effectiveness bar; instead, we recommend a set of charities that we are confident will put additional funding toward effective use to help animals over a longer time horizon without our oversight. We make this decision based on all of our evaluation criteria, with a strong focus on Cost Effectiveness (which examines the effectiveness of past work) and Room For More Funding (which assesses whether a charity’s planned uses for funding over the next two years will be roughly similar to their past work).&nbsp;</p><p>It is also worth noting that because we have shifted to one recommendation level for our charities this year (as opposed to the previous Top Charities/Standout Charities distinction), we plan to develop a new decision-making process that better accounts for the marginal cost effectiveness of funding disbursed from ACE’s Recommended Charity Fund. This will better enable us to leverage our grantmaking role in addition to our recommendation role.&nbsp;&nbsp;</p><p>For our Movement Grants—especially smaller projects, projects benefiting species for whom few interventions have been tried, and projects in regions where the movement is particularly small, so there’s particularly little evidence—it is not currently possible to sufficiently investigate each project application to make meaningful cost-effectiveness estimates. We, therefore, rely on proxies such as the coherence of an applicant’s theory of change, the priority of their focus animal groups, and the neglectedness of the region in which they operate.</p><p>Additionally, because we believe that supporting a range of different approaches is essential for an effective animal advocacy ecosystem (and because our recommendations influence donor and public opinion), we want to feature a plurality of approaches with a strong potential for impact. Because of the high uncertainty about the most effective ways to help animals, and because the different interventions reinforce and facilitate each other, we think supporting a range of approaches is both necessary and beneficial for the animal advocacy ecosystem as a whole. We view this as preferable to diverting funding near-exclusively to charities and programs with the most convincing shorter-term theories of change, which runs the risk of dismissing potentially pivotal interventions due to measurability bias.</p><p><strong>Sixth, we are glad that GWWC chose to recommend The Humane League (THL) based in part on our evaluation</strong>. As we note in our 2023 review, we view giving to THL as an excellent opportunity to support initiatives that create the most positive change for animals. At the same time, we are disappointed that GWWC chose to only recommend one of our Recommended Charities and to restrict grants for their corporate campaign work. After months of evaluation, we are confident that all of our Recommended Charities represent highly promising giving opportunities. We are also convinced of the need for a pluralistic and resilient movement incorporating a range of effective tactics toward different outcomes to achieve wellbeing for as many animals as soon as possible globally.&nbsp;</p><p>We also want to make clear that while GWWC’s decision might imply that THL represents a superior giving opportunity compared to our other recommended charities, this is not a view that ACE shares. We view all of our recommended charities, including THL, as highly impactful giving opportunities. Following GWWC’s initial conclusion that they weren’t going to defer to our overall charity recommendations this year, we would have welcomed the opportunity to provide supporting materials for more than three of our Recommended Charities and to have had more time to do so.&nbsp;&nbsp;</p><p><strong>Lastly, and most importantly, we congratulate, once more, the latest additions to&nbsp;</strong><a href=\"https://animalcharityevaluators.org/donation-advice/recommended-charities/\"><strong><u>our list of Recommended Charities</u></strong></a><strong>.</strong> We will diligently continue working to ensure that our approach to evaluation and our methods capture the full extent of charities’ work as accurately as possible, and we expect these improvements to be an ongoing endeavor that will continue for as long as ACE exists. At the same time, following months of research, preparation, and evaluation, we are confident that Kafessiz Türkiye, Dansk Vegetarisk Forening, Faunalytics, Fish Welfare Initiative, Good Food Institute, Legal Impact for Chickens, New Roots Institute, Shrimp Welfare Project, Sinergia Animal, The Humane League, and Wild Animal Initiative all do incredible work and represent extremely promising giving opportunities. We are pleased that GWWC’s report recognizes this, both through their direct recommendation of our Recommended Charity The Humane League, and through their strong recommendation to impact-maximizing donors to give to ACE’s recommended charities over the average animal welfare charity.</p><p>-ACE Team</p>", "parentCommentId": null, "user": {"username": "AnimalCharityEvaluators"}}, {"_id": "Q28WivaLfDypFYDjB", "postedAt": "2023-11-28T15:17:36.256Z", "postId": "PTHskHoNpcRDZtJoh", "htmlBody": "<blockquote>\n<p>So by default, GFI, Sinergia, Fish Welfare Initiative, Kafessiz and DVF were all excluded from potentially being identified (which seems illogical, as there is no obvious reason to think that charities evaluated in 2022 would be less cost-effective)</p>\n</blockquote>\n<p>Yes they were, as were any other charities than the three charities we asked ACE to send us more information on (based on where they thought they could make the strongest case by our lights). Among those, we think ACE provided the strongest case for THL's corporate campaigns, and with the additional referral from Open Phil + the existing public reports by FP and RP on corporate campaigns, we think this is enough to justify a recommendation. This is what I meant by there indeed being a measurability bias in our recommendation (which we think is a bullet worth biting here!): we ended up recommending THL in large part because there was sufficient evidence of cost-effectiveness readily and publicly available. We don't have the same evidence for any of these other charities, so they could in principle be as or even more cost-effective than THL (but also much less!), and without the evidence to support their case we don't (yet) feel justified recommending them. We don't have capacity to directly evaluate individual charities ourselves (including THL!), but continue to host many promising charities on our donation platform, so donors who have time to look into them further can choose to support them.</p>\n<p>To put this differently, the choice for us wasn't between \"evaluating all of ACE's recommendations\" and \"evaluating only THL / three charities\" (as we didn't have capacity to do any individual charity evaluations). The choice for us was between \"only recommending the AWF\" and \"recommending both the AWF and THL's corporate campaigns\" <em>because there happened to already be sufficiently strong evidence/evaluations available for THL's corporate campaigns</em>. For reasons explained earlier, we stand by our decision to prefer the latter over the former, even though that means that many other promising charities don't have a chance to be recommended at this point (but note that this is the case in charity evaluation across cause areas!).</p>\n<blockquote>\n<p>Given you only looked at three of the ACE 2023 recommendations (and you didn't say which ones), I'm wondering how you can make such a strong claim for all of ACE's recommended charities?</p>\n</blockquote>\n<p>Could you clarify which \"strong claim for all of ACE's recommended charities\" you are referring to? From the executive summary of our report on ACE:</p>\n<p><em>We also expect the gain in impact from giving to any ACE-recommended charity over giving to a random animal welfare charity is much larger than any potential further gain from giving to the AWF or THL’s corporate campaigns over any (other) ACE-recommended charity, and note that we haven’t evaluated ACE’s recommended charities individually, but only ACE’s evaluation process.</em></p>\n<blockquote>\n<p>On a slightly unrelated point: For the referral from OP, I would be curious to hear if you asked them \"What is the most cost-effective marginal giving opportunity for farmed animal welfare\" (to which they replied THL's corporate campaigns) or something closer to \"Do you think THL is a cost-effective giving opportunity on the margin?\"</p>\n</blockquote>\n<p>The latter, because a referral by OP on its own wouldn't have been sufficient for us to make a recommendation (as we haven't evaluated OP): for recommending THL's corporate campaigns, we really relied on these four separate pieces of evidence being available.</p>\n<blockquote>\n<p>I should have said \"One of the top 2 marginal giving opportunities\" but I still think I stand by my point that many experienced animal advocates would disagree with this claim, and it's not clear that your charity recommendation work has sufficient depth to challenge that (e.g. you didn't evaluate groups yourself), in which case it's not clear why folks should defer to you over subject-matter experts (e.g. AWF, OP or ACE).</p>\n</blockquote>\n<p>We're not even claiming it is one of the top 2 marginal giving opportunities, just that it is the best recommendation we can make to donors based on the information available to us from evaluators. If you could point us to any alternative well-justified recommendations/evaluators for us to evaluate, we'd be all ears.</p>\n<p>And we don't claim people should defer to us directly on charity evaluations (again, we don't currently do these ourselves!). Ultimately, our recommendations (including THL!) are based on the recommendations of the subject-matter experts you reference. The purpose of our evaluations and reports is to help donors make better decisions based on the recommendations and information these experts provide.</p>\n", "parentCommentId": "nSDLN8qdyLC6ADoQD", "user": {"username": "SjirH"}}, {"_id": "F4fMGJddfSbDsLBTe", "postedAt": "2023-11-28T15:35:25.258Z", "postId": "PTHskHoNpcRDZtJoh", "htmlBody": "<p>Hi GWWC folks! Just wanted to extend a hearty thanks to you on behalf of the Happier Lives Institute. We appreciate that you looked into us and we respect your reasons for wanting to come back to us later.&nbsp;</p><p>Naturally, we're doing our best to make this work out-of-date, make your concerns obsolete, and give you reasons to review our output. We've just dropped our <a href=\"https://forum.effectivealtruism.org/posts/GJ4xjAnubWiBJDbE8/talking-through-depression-the-cost-effectiveness-of\">updated psychotherapy report</a> and <a href=\"https://forum.effectivealtruism.org/posts/fKjGmDL6bNTeg8Zrc/hli-s-giving-season-2023-research-overview\">2023 giving season recommendations</a> (which keeps StrongMinds and adds AMF!), and I hope you'll enjoy both.</p>", "parentCommentId": null, "user": {"username": "PeterBrietbart"}}, {"_id": "uJCKAABwTFnFWfgJR", "postedAt": "2023-11-28T15:51:11.801Z", "postId": "PTHskHoNpcRDZtJoh", "htmlBody": "<p>Thank you, Peter, we're obviously very happy to hear this!</p>\n", "parentCommentId": "of7txjxyhRYtc9B28", "user": {"username": "SjirH"}}, {"_id": "PA8mXcHLKTA2WbE6j", "postedAt": "2023-11-28T16:13:52.404Z", "postId": "PTHskHoNpcRDZtJoh", "htmlBody": "<p>Thanks for your question!</p>\n<p>The important nuance here is that while we did not think ACE's current charity evaluation process measures marginal cost-effectiveness to a sufficient extent to directly rely on ACE's recommendations, that <em>isn't</em> the same as the (stronger) claim that its recommendations are necessarily worse donation opportunities than the AWF or THL's corporate campaigns, and it also isn't the same as claiming that ACE's process doesn't track marginal cost-effectiveness at all.</p>\n<p>We can't say confidently how ACE's (other) recommendations compare to the AWF or THL's corporate campaigns, as we haven't individually evaluated and compared them. So we want to offer donors who have the time and expertise to look into these promising individual charities the opportunity to do so and potentially donate to them if they find them to be maximising impact by their worldview, as we do for many more charities and funds on our platform that we can't currently justify recommending (for instance because they haven't been evaluated (yet)).</p>\n<p>You may also be interested in our answer to <a href=\"https://forum.effectivealtruism.org/posts/xcDZccfWkA6a9Atuv/ama-gwwc-research-team?commentId=dBFAS6tqGMkXwyL7g\">this somewhat related question under the AMA post</a>.</p>\n", "parentCommentId": "WKxTASBWadH6d7Z7P", "user": {"username": "SjirH"}}, {"_id": "5ptfpabHDeJFrtr65", "postedAt": "2023-11-28T16:25:55.633Z", "postId": "PTHskHoNpcRDZtJoh", "htmlBody": "<p>Hi Moritz, yes if you ask me personally, I would currently lean towards recommending MG over a randomly picked ACE recommended charity, though I'm far from confident in this / it's not a claim I would be able to justify to the extent we usually want to justify our recommendations as GWWC. It's mainly based on my view that the difference between the AWF and MG is fairly small (both are broadly trying to make cost-effective grants and are getting promising applications on the margin), whereas our criticism of ACE's charity evaluations process a bit more fundamentally challenges it coming up with highly cost-effective donation opportunities on the margin (though I also don't want to overstate our conclusion there). I would furthermore guess that MG is/will be more funding-constrained relative to its aims/applications than most of ACE's individual charity recommendations. (but really, this is a guess: note that I haven't looked into the charity recommendations individually!)</p>\n", "parentCommentId": "FfeeC52aDrBdzMbSj", "user": {"username": "SjirH"}}, {"_id": "6Fth3vsjhDXvtntCF", "postedAt": "2023-11-28T16:39:46.222Z", "postId": "PTHskHoNpcRDZtJoh", "htmlBody": "<p>Thank you! As we mention in the report, we're grateful for how you've engaged with our evaluations process, and I think this comment is a good illustration of the open, constructive and collaborative attitude you've had throughout it. We look forward to re-evaluating ACE's work next year, and in the meantime remain excited to host many of ACE's funds and recommendations on our <a href=\"https://www.givingwhatwecan.org/donate/organizations#animal-welfare\">donation platform</a> as promising opportunities for donors to consider.</p>\n", "parentCommentId": "2YdTi8L6PS4irnmrv", "user": {"username": "SjirH"}}, {"_id": "XfPLSpqyB3W6tfZCZ", "postedAt": "2023-11-28T18:29:46.930Z", "postId": "PTHskHoNpcRDZtJoh", "htmlBody": "<p>That's great to hear Jonas, please let us know if we can do anything else to help! As mentioned in our reports and back when we <a href=\"https://forum.effectivealtruism.org/posts/pp2jmWHyDK9sfC4Rh/evaluating-the-evaluators-gwwc-s-research-direction\">announced</a> the project, part of the motivation for doing this work is to support other effective giving organisations like Giv Effektivt to be able to make more informed decisions on their recommendations.</p>\n<p>And yes, agree that these comments provide a bit of the next layer... let's see where it stops!</p>\n", "parentCommentId": "PafR4pLRAAWqjtT9c", "user": {"username": "SjirH"}}, {"_id": "FuMcXETHSm4gdni58", "postedAt": "2023-11-29T02:48:47.156Z", "postId": "PTHskHoNpcRDZtJoh", "htmlBody": "<p>Thanks Peter, and we'd of course like to extend the thanks back to HLI for being such an excellent collaborator here! Congratulations on publishing your new research. I'm eager to read more about it over the coming weeks and hopefully to dive into it in more detail next year in our next round of evaluations.&nbsp;</p>", "parentCommentId": "F4fMGJddfSbDsLBTe", "user": {"username": "Michael_Townsend"}}, {"_id": "tGYgc2GasHPhazxS5", "postedAt": "2023-11-29T02:58:59.684Z", "postId": "PTHskHoNpcRDZtJoh", "htmlBody": "<p>There is definitely substantial overlap between the four funds you listed; and especially on GWWC's fund and EA Funds'. In principle, it doesn't have to be this way:</p><ul><li>GWWC's Global Health and Wellbeing Fund could potentially grant based on evaluations other than GW (e.g., potentially from Founders Pledge, or Happier Lives Institute, etc., depending on how our subsequent evaluations go).</li><li>EA Funds' Global Health and Development Fund could similarly appoint new advisors, or change its scope. But I can't speak on behalf of EA Funds!</li><li>GW's Top Charities Fund and All Grants Fund do make different grants, with the latter having a wider scope, but there is overlap. &nbsp;</li></ul><blockquote><p>Have you considered allocating the donations made to the GWWC Global Health and Wellbeing Fund to GW's funds?</p></blockquote><p>We expect that in effect this will be what happens. That is, we expect GW to advise our fund as a proxy for the All Grants Fund. Operationally, it's better for us to directly grant to the organisations based on GW's advice (rather than, for example, sending the money to GW to regrant it) so that, among other reasons, charities can receive the money sooner. We already have this process setup for donations made to GW's funds on our platform. This means that, at least right now, giving to either the All Grants Fund, or our cause area fund, will have the same effect. But as above, this could change based on future evaluations of evaluators, which we see as a feature for donors who want to setup recurring donations to track our latest research.</p>", "parentCommentId": "RKxJTK6zistF9coo3", "user": {"username": "Michael_Townsend"}}, {"_id": "mADFawWoTfL6BYv2J", "postedAt": "2023-11-29T03:01:55.107Z", "postId": "PTHskHoNpcRDZtJoh", "htmlBody": "<p>In this round of evaluations, we only looked into Animal Charity Evaluators, GiveWell, Happier Lives Institute, EA Funds' Animal Welfare Fund and Long-Term Future Fund, and Longview's Emerging Challenges Fund. In future evaluations, we would like to look into Founders Pledge's work, climate change more generally, and other evaluators. It's too soon to commit to which, and in which order, just yet.</p><blockquote><p>Also, did you evaluate GW's Top Charity Fund of All Grants Fund?</p></blockquote><p>Jonas' reply is spot on here — we essentially looked into both and to GW more generally.</p>", "parentCommentId": "Mtjpeyunvwmz6gmqR", "user": {"username": "Michael_Townsend"}}, {"_id": "SvDnEdsgt75oRzh95", "postedAt": "2023-11-29T03:02:44.122Z", "postId": "PTHskHoNpcRDZtJoh", "htmlBody": "<p>Thanks Nick! It was really illuminating for me personally to look under the hood of GW, and I'm glad you appreciated our summary of the work.&nbsp;</p>", "parentCommentId": "W8GvKYFAYPXweTt3z", "user": {"username": "Michael_Townsend"}}, {"_id": "TBNHhjzzb8CKYfhFK", "postedAt": "2023-11-29T03:07:22.249Z", "postId": "PTHskHoNpcRDZtJoh", "htmlBody": "<p>Hi Rebecca — we did not look into The Life You Can Save for this round. As <a href=\"https://forum.effectivealtruism.org/posts/PTHskHoNpcRDZtJoh/gwwc-s-evaluations-of-evaluators?commentId=mADFawWoTfL6BYv2J\">shared here</a> we only looked into the six evaluators/funds listed in this post, and in our \"Why and how GWWC evaluates evaluators\" we shared <a href=\"https://www.givingwhatwecan.org/en-US/why-and-how-gwwc-evaluates-the-evaluators?slug=why-and-how-gwwc-evaluates-the-evaluators#how-we-chose-the-evaluators-we-looked-into\">how we decided which evaluators to prioritise</a>. It's too soon to say which evaluators we'll look into next, though we can share that our current inclination is that looking into Founders Pledge's research, and expanding the cause areas we include (like climate change, or \"meta\" work) is a particularly high priority.&nbsp;</p>", "parentCommentId": "reByLjSZnrCuESxnH", "user": {"username": "Michael_Townsend"}}, {"_id": "XLhTzyWTTmGjoazAm", "postedAt": "2023-11-29T10:14:20.645Z", "postId": "PTHskHoNpcRDZtJoh", "htmlBody": "<p>Thanks for clarifying, Michael! Your approach makes sense to me. On the other hand, the value of EA Funds' Global Health and Development Fund in its current form remains unclear to me.</p>", "parentCommentId": "tGYgc2GasHPhazxS5", "user": {"username": "vascoamaralgrilo"}}, {"_id": "w3nkvYDxxxwHJ7xWP", "postedAt": "2023-11-29T11:17:42.734Z", "postId": "PTHskHoNpcRDZtJoh", "htmlBody": "<p>Thanks for your perspective and transparency Sjir! That seems reasonable from my prior perspective and how I read your report.</p>", "parentCommentId": "5ptfpabHDeJFrtr65", "user": {"username": "moritz-stumpe"}}, {"_id": "XP5SJrT5LSAKGAYrt", "postedAt": "2023-11-29T14:21:45.339Z", "postId": "PTHskHoNpcRDZtJoh", "htmlBody": "<p>It's worth pointing out that ACE's estimates/models (mostly weighted factor models, including ACE's versions of Scale-Tractability-Neglectedness, or STN) are often already pretty close to being BOTECs, but aren't quite BOTECs. I'd guess the <i>smallest</i> fixes to make them more scope-sensitive are to just turn them into BOTECs, or whatever parts of them you can into BOTECs<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefojwl5i0vi0k\"><sup><a href=\"#fnojwl5i0vi0k\">[1]</a></sup></span>, whenever not too much extra work. BOTECs and other quantitative models force you to pick factors, and scale and combine them in ways that are more scope-sensitive.</p><p>&nbsp;</p><p><a href=\"https://animalcharityevaluators.org/charity-reviews/evaluating-charities/evaluation-criteria/#criterion-2\">For the cost-effective criterion</a>, ACE makes judgements about the <i>quality</i> of charities' achievements with Achievement Quality Scores. For corporate outreach and producer outreach, ACE <a href=\"https://docs.google.com/spreadsheets/d/1omtNhICe5opyTECPZ1jZ92no_pcwOxuRdR_aEAgP37U/edit#gid=109566111&amp;range=A17\">already scores factors</a> from which direct average impact BOTECs could pretty easily be done with some small changes, which I'd recommend:</p><ol><li>Score \"Scale (1-7)\" = \"How many locations and animals are estimated to be affected by the commitments/campaign, if successful?\" in terms of the number of animals (or animal life-years) per year of counterfactual impact instead of 1-7.</li><li>Ideally, \"Impact on animals (1-7)\" should be scored quantitatively using <a href=\"https://welfarefootprint.org/\">Welfare Footprint Project</a>'s approach (some rougher estimates <a href=\"https://forum.effectivealtruism.org/posts/CmAexqqvnRLcBojpB/electric-shrimp-stunning-a-potential-high-impact-donation\">here</a> and <a href=\"https://rpubs.com/hannah_/penaeidshrimpwelfareissues\">here</a>) instead of 1-7, but this is a lower priority than other changes. Welfare improvements per animal or per year of animal life can probably vary <i>much</i> more than 7 times, though, and can end up negative instead, so I'd probably at least adjust the range to be symmetric around 0 and let researchers select 0 or values very close to it.</li><li>The BOTEC is then just the product of \"Impact on animals (1-7)\" (the average<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefcbe113djofm\"><sup><a href=\"#fncbe113djofm\">[2]</a></sup></span>&nbsp;welfare improvement with successful implementation), \"Scale\", \"Likelihood of implementation (%)\", expected welfare range and the number of years of counterfactual impact (until similar welfare improvements for the animals would have happened anyway and made these redundant). Similar BOTECs could be done for the direct impacts of other interventions.</li></ol><p>For groups aiming to impact decision-making or funding in the near term with research like Faunalytics, ACE could also highlight some of the most important decisions that have been (or are not too unlikely to be) informed by their research so that <i>we</i> can independently judge how they compare to corporate outreach or other interventions. ACE could also use <a href=\"https://rethinkpriorities.org/news/a-model-estimating-the-value-of-research-influencing-funders\">RP's model or something similar to get impact BOTECs</a> to make comparisons with more direct work.</p><p>For other charities, ACE could also think about how to turn the models into BOTECs or quantitative models of important outcomes. These can be intermediate outcomes or outputs that aren't necessarily comparable across all interventions, if impact for animals is too speculative, but the potential upside is high enough and the potential downside small enough.<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefojwl5i0vi0k\"><sup><a href=\"#fnojwl5i0vi0k\">[1]</a></sup></span></p><p>&nbsp;</p><p>For the <a href=\"https://animalcharityevaluators.org/charity-reviews/evaluating-charities/evaluation-criteria/#criterion-1\">Impact Potential criterion</a>, ACE uses STN a lot and cites the <a href=\"https://80000hours.org/articles/problem-framework/\">80,000 Hours' article</a> where 80,000 Hours explains how to get a BOTEC by interpreting and scoring the factors in specific ways. ACE could just follow that procedure and then the STN estimates would be BOTECs.</p><p>That being said, STN is really easy to misapply generally (e.g. various critiques <a href=\"https://forum.effectivealtruism.org/topics/itn-framework\">here</a>), and I'd be careful about relying on it even if you were to follow 80,000 Hours' procedure to get BOTECs. For example, only a tiny share of a huge but relatively intractable problem, like wild animal welfare/suffering, may be at all tractable, so it's easy to overestimate the combination of Scale and Tractability in those cases. See also Joey's <a href=\"https://forum.effectivealtruism.org/posts/W2YChXz4f4nGzZMaE/why-we-look-at-the-limiting-factor-instead-of-the-problem\">Why we look at the limiting factor instead of the problem scale</a> and Saulius's <a href=\"https://forum.effectivealtruism.org/posts/saEQXBgzmDbob9GdH/why-i-no-longer-prioritize-wild-animal-welfare\">Why I No Longer Prioritize Wild Animal Welfare</a>. STN can be useful for guiding what to investigate further and filtering charities for review, but I'd probably go for BOTECs done other ways, like above to replace Achievement Quality Scores, and with more detailed theories of change.</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnojwl5i0vi0k\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefojwl5i0vi0k\">^</a></strong></sup></span><div class=\"footnote-content\"><p>For example, you could do a BOTEC of the number of additional engagement-weighted animal advocates, which could be part of a BOTEC for impact on animals, but going from engagement-weighted animal advocates to animals could be too speculative, so you stop at engagement-weighted animal advocates. This could be refined further, weighing by country scores.</p></div></li><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fncbe113djofm\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefcbe113djofm\">^</a></strong></sup></span><div class=\"footnote-content\"><p>Per animal or per animal life-year, to match Scale.</p></div></li><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fntl0kprhm2e\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnreftl0kprhm2e\">^</a></strong></sup></span><div class=\"footnote-content\"><p>It seems <a href=\"https://docs.google.com/spreadsheets/d/19wAdJ-ttqFrgTQHwYBBm-sDNTKf3NwPmut0SDZ3ySuM/edit#gid=625430727&amp;range=L3:L4\">ACE did so for the Scale factor</a>, but no specific quantitative interpretation for the others.</p></div></li></ol>", "parentCommentId": "2YdTi8L6PS4irnmrv", "user": {"username": "MichaelStJules"}}, {"_id": "DaabMpbvxob6Kfc5A", "postedAt": "2023-12-04T10:16:52.679Z", "postId": "PTHskHoNpcRDZtJoh", "htmlBody": "<p>Hi Michael, thanks a lot for the helpful comments, and for taking the time to be so thorough in your feedback. We've been thinking a lot about how to produce proxies for impact that can be meaningfully compared with one another, with BOTECs being one possible way to help achieve that, so it's really useful to get your views. We'll talk these through as a team as we consider improvements to our process for the coming years.</p><p>- Max</p>", "parentCommentId": "XP5SJrT5LSAKGAYrt", "user": {"username": "AnimalCharityEvaluators"}}, {"_id": "rj7y7rjo7Fr7w2S2m", "postedAt": "2023-12-04T17:28:08.485Z", "postId": "PTHskHoNpcRDZtJoh", "htmlBody": "<p>I’ve decided to curate this post. An evaluation of the evaluators, written up by an independent organisation, is a valuable resource for donors and the evaluators themselves. Even though EA charity evaluators are often pretty good at marking their own homework, I’d be happy to see it no longer being a necessity. This project gets up a step closer.<br><br>Additionally, I think the response from the evaluated organisations is wonderful. I’d like to highlight <a href=\"https://forum.effectivealtruism.org/posts/PTHskHoNpcRDZtJoh/gwwc-s-evaluations-of-evaluators?commentId=2YdTi8L6PS4irnmrv\">ACE’s response</a> which exemplifies truth seeking and collaboration, while pushing back on some of the substance of the report, and making their reasoning clear in doing so.</p>", "parentCommentId": null, "user": {"username": "tobytrem"}}, {"_id": "xrMLWLDmFXDjFdcun", "postedAt": "2023-12-05T10:21:13.945Z", "postId": "PTHskHoNpcRDZtJoh", "htmlBody": "<p>Thank you, Toby! We appreciate the positive feedback and definitely share your thoughts about the value of this exercise.</p><p>- Max</p>", "parentCommentId": "rj7y7rjo7Fr7w2S2m", "user": {"username": "AnimalCharityEvaluators"}}, {"_id": "wv5yB92qRL8XX2DjP", "postedAt": "2023-12-06T23:29:01.777Z", "postId": "PTHskHoNpcRDZtJoh", "htmlBody": "<p>If I remember correctly, GHDF predated GW's creation of the Top Charities Fund and the All Grants Fund. In addition, I think GiveWell UK is of fairly recent origin, so EA Funds would have offered UK tax advantages that were not then (at least readily) available through GiveWell. So I think at least some of the original advantages of GHDF may have become much less significant with subsequent developments at GiveWell?</p>\n", "parentCommentId": "XLhTzyWTTmGjoazAm", "user": {"username": "Jason"}}, {"_id": "zdtTFb8fKrJ8jLD4p", "postedAt": "2023-12-07T09:13:15.768Z", "postId": "PTHskHoNpcRDZtJoh", "htmlBody": "<p>Hi Jason,</p><blockquote><p>If I remember correctly, GHDF predated GW's creation of the Top Charities Fund and the All Grants Fund.</p></blockquote><p><u>The All Grants Fund was </u><a href=\"https://forum.effectivealtruism.org/posts/H6D6QYRLaaZikcGaN/changes-to-our-top-charity-criteria-and-a-new-giving-option-3\"><u>launched</u></a> in August 2022, and GW's Maximum Impact Fund was <a href=\"https://blog.givewell.org/2022/09/08/renaming-top-charities-fund/\">renamed</a> to <u>Top Charities Fund one month later. </u>GHDF made its 1st <a href=\"https://funds.effectivealtruism.org/grants?fund=Global%2520Health%2520and%2520Development%2520Fund&amp;sort=round\">grant</a> in 2017. The Maximum Impact Fund had been making <a href=\"https://www.givewell.org/top-charities-fund\">grants</a> since 2014.</p><blockquote><p>In addition, I think GiveWell UK is of fairly recent origin, so EA Funds would have offered UK tax advantages that were not then (at least readily) available through GiveWell.</p></blockquote><p>Good point! GiveWell UK was <a href=\"https://blog.givewell.org/2022/08/24/introducing-givewell-uk/\">launched</a> in August 2022.</p><blockquote><p>So I think at least some of the original advantages of GHDF may have become much less significant with subsequent developments at GiveWell?</p></blockquote><p>I think so.</p>", "parentCommentId": "wv5yB92qRL8XX2DjP", "user": {"username": "vascoamaralgrilo"}}, {"_id": "6haj2swhK8oEKpMGJ", "postedAt": "2024-01-06T02:49:13.131Z", "postId": "PTHskHoNpcRDZtJoh", "htmlBody": "<p>I'm sympathetic to the problem of measuring \"marginal cost effectiveness\" for ACE's movement grants, that does seem difficult and at risk of measurement bias. But let's change the topic for now:&nbsp;</p><p>I'm curious how much thought has gone into considering the dilemmas here as<i> </i><strong>\"spread movement infrastructure broadly everywhere vs concentrate it in particular social groups/geographies/municipalities/political levers/corporate targets\"</strong>?</p><p>There's an extent to where establishing footholds widely is important, maintaining the universality of the movement and maybe benefiting from a wide diffusion of tractable goals.</p><p>But on the other hand, it seems to me that concentration of funds may benefit from possible social tipping points?&nbsp;</p><ul><li>Protests and leafleting both seem to more likely to happen with, say 20 individuals, 5 of whom show up on a given day.&nbsp;</li><li>Likewise, the salience of such acts seems somewhat predictable - 5 fill a sidewalk, 20 might be enough to pressure a particular target, 100 enough for a march/parade.</li><li>\"Friend group\", \"social scene\", \"group identity\", all seem dependent on different scales.</li><li>&nbsp;Social media effectiveness might require 10,000 viewers.</li><li>Major (positive) media attention might require 250 moderately dedicated individuals.&nbsp;</li><li>Signature collecting clearly benefits from concentration, as do \"letters to your representatives\"</li><li>More abstractly, there are possible tipping points for achieving clear social consensus on topics, what ideas are conformed too rather than against<i>, </i>how many are needed to veto dinner party decisions, and so on</li></ul><p>Obviously this isn't remotely an empirical matter, there are <a href=\"https://open.substack.com/pub/jamesozden/p/social-tipping-points-are-probably?r=rj6jj&amp;utm_campaign=post&amp;utm_medium=web\">no objective numbers</a> to refer to, I made these up. And I'm of course equivocating between $$$ and social network building, there's plenty of room for particularly capable organizations and individuals to dominate.&nbsp;</p><p>But what if we concentrated millions in groups in<a href=\"https://vegnews.com/2021/7/berkeley-first-city-vegan-meals\"> Berkeley, California</a>? What if hundreds of thousands go to fueling activism against one single provision in a particular bill? What about 10-timing the funding of a single university group?&nbsp;</p><p>I may not be \"on the ground\" enough to get a good sense of actual movement dynamics, so feel free to discount what I've said on that basis. And maybe I'm just naive as to the amount of funds that can actually be productively used by a given group?</p><p>But it seems like one essential problem of the movement is that it is <i>drowning</i> in just causes. Random barn fire happens, 10k cows burn alive - what now?&nbsp;</p><p>I agree with GWWC's case that AWF may be overestimating the value of addressing geographic neglectedness. But I'm wondering if the problem is wider? Could animal movement-building giving in general do with a bit more concentration? EA has been great at pioneering new, neglected frontiers in animal welfare; but perhaps there's a point where we should shy away from novelty and bet everything on a few choice picks?<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnreflw71ivzfud\"><sup><a href=\"#fnlw71ivzfud\">[1]</a></sup></span></p><p>&nbsp;</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnlw71ivzfud\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnreflw71ivzfud\">^</a></strong></sup></span><div class=\"footnote-content\"><p>I realize that the emphasis on the humane league could be construed as doing just this, but I vague notion that \"corporate campaigning\" isn't exactly a movement-builder tactic and so may have more of ceiling on possible benefits? Very uncertain on this.</p></div></li></ol>", "parentCommentId": null, "user": {"username": "Dylan Richardson"}}, {"_id": "2aztibJbhBxxcx4eB", "postedAt": "2024-02-07T13:32:37.884Z", "postId": "PTHskHoNpcRDZtJoh", "htmlBody": "<p>Hello,</p><blockquote><p>We conducted a survey of 16 fundraising organisations to help us decide which evaluators to prioritise investigating.</p></blockquote><p>Would it be possible to share more details about this survey (e.g. identifying the 16 organisations involved)?</p>", "parentCommentId": null, "user": {"username": "vascoamaralgrilo"}}, {"_id": "EFdjvn2fSLamMLkJ6", "postedAt": "2024-02-12T20:26:36.416Z", "postId": "PTHskHoNpcRDZtJoh", "htmlBody": "<p>Hi Vasco — not all organisations shared permission to have their name shared, but it includes many of <a href=\"https://givingwhatwecan.notion.site/fb3752a779ac4e779015db6a8a2e0cc4?v=d93c0365c3e14753877ff0da08a11a69\">the fundraising organisations on this list</a>.</p>", "parentCommentId": "2aztibJbhBxxcx4eB", "user": {"username": "Michael_Townsend"}}, {"_id": "zZm6dLXrxfqmLKcMS", "postedAt": "2024-02-24T19:55:09.401Z", "postId": "PTHskHoNpcRDZtJoh", "htmlBody": "<p>Hi,</p><p>Do you have any thoughts on whether AWF, LTFF and Longview’s Emerging Challenges Fund (ECF) should publish more information about the rationale behind their grants?</p><p>With respect to AWF, you <a href=\"https://docs.google.com/document/d/1hqYNZ9zJfe3D_nyJ4b21J0IJs210upAXTw8fPWnYJe8/edit#heading=h.4b07t553tk4\">say</a>:</p><blockquote><p>The AWF has a section on&nbsp;<a href=\"https://funds.effectivealtruism.org/funds/animal-welfare#grantmakingAndImpact\"><u>Grantmaking and Impact</u></a> on its website in which it lists several past grantees and their type of work, but it doesn’t go into detail on what these organisations achieved or what they achieved with the grants they received from the AWF in particular. We don’t think it would be worth it for the AWF to do a follow-up impact evaluation on each grant it makes, but we think it could at least provide a few more detailed examples of successful past grants, to illustrate to donors what their donations may lead to.</p></blockquote><p>I agree doing follow-up impact evaluations of all grants is not needed, but I also think it would be useful to know about the cases for the grants at the time they were made. You <a href=\"https://docs.google.com/document/d/1VORv9BwjByRgP-1d3ZbaEmYvWuDz5XDd_94kTNs_TCk/edit#heading=h.iest9wuu8s1d\">note</a> LTFF shares such cases, but only for a tiny minority of the grants, and follow-up impact evaluations are essentially absent too.</p><p>ECF <a href=\"https://www.longview.org/fund/emerging-challenges-fund-december-2023-grants-report/\">has</a> grant write-ups of a few paragraphs, but you <a href=\"https://docs.google.com/document/d/174TYUGyGFSZhagIfc7m_Z3l_s_7mpgC7Itchx6Z7InU/edit#heading=h.4z08g1nopao1\">note</a> \"Longview has solid grantmaking processes in place to find highly cost-effective funding opportunities\", so maybe it could share more without much more additional work?</p>", "parentCommentId": null, "user": {"username": "vascoamaralgrilo"}}, {"_id": "gW4g5ApD8N7hZtTzM", "postedAt": "2023-11-24T21:01:18.120Z", "postId": "PTHskHoNpcRDZtJoh", "htmlBody": null, "parentCommentId": null, "user": null}, {"_id": "GYHFA3Dqb8g5wFpw8", "postedAt": "2023-12-01T17:21:59.348Z", "postId": "PTHskHoNpcRDZtJoh", "htmlBody": null, "parentCommentId": "2YdTi8L6PS4irnmrv", "user": null}]