[{"_id": "9PoWLQ492xhXAYqii", "postedAt": "2022-11-19T12:10:38.698Z", "postId": "PtnGywLuk3Keo642c", "htmlBody": "<p>In case the results end up getting used to argue \"EA thinks X\", I want to add a couple of caveats regarding \"our opinions\":</p><p>1. This note from <a href=\"https://forum.effectivealtruism.org/posts/7ZjJ9w2xf7Mkdofk8/does-sam-make-me-want-to-renounce-the-actions-of-the-ea?commentId=TeLAXwxFowGMGGFEk\">Linch</a> on another post:</p><blockquote><p>Keep in mind that the people who are commenting, writing call-out posts, etc., online are both a) only a small fraction of EAs, and b) a particularly skewed sample in the current moment.<br><br>Some of us either chose or were asked to be quiet for now, or are still reeling from our losses and not sure what to say.</p></blockquote><p>2. I think it will be much more useful to focus on <a href=\"https://forum.effectivealtruism.org/posts/qFEwQbetaaSpvHm9e/my-takes-on-the-ftx-situation-will-mostly-be-cold-not-hot\">cold takes</a>, when people are ready to share them over the coming weeks/months.</p>", "parentCommentId": null, "user": null}, {"_id": "EwiZsZfPreCaMNajY", "postedAt": "2022-11-19T12:25:39.437Z", "postId": "PtnGywLuk3Keo642c", "htmlBody": "<p>Polis is a better tool for understanding opinions than most other discussions we've had here.</p><p>Polis isn't about size of opinions, but breadth and correlation. You don't need respondents to be representative to get a sense of what different parts of the community thinks here.</p><p>I agree with the cold takes point, there is a comment like that in the poll.</p>", "parentCommentId": "9PoWLQ492xhXAYqii", "user": {"username": "nathan"}}, {"_id": "3NyyAQHrLM2kuh372", "postedAt": "2022-11-19T12:27:03.022Z", "postId": "PtnGywLuk3Keo642c", "htmlBody": "<p>Oh interesting, nice. Thanks for adding the 'Longer intro' section.</p>", "parentCommentId": "EwiZsZfPreCaMNajY", "user": null}, {"_id": "XyemJkfuQLAjnNFgi", "postedAt": "2022-11-19T12:32:05.279Z", "postId": "PtnGywLuk3Keo642c", "htmlBody": "<p>I added that while you were commenting, but have updated it since your comments. Great minds think alike etc etc.</p>", "parentCommentId": "3NyyAQHrLM2kuh372", "user": {"username": "nathan"}}, {"_id": "HaoPkS4scrJXJ2vof", "postedAt": "2022-11-19T12:32:21.907Z", "postId": "PtnGywLuk3Keo642c", "htmlBody": "<p>I ended up answering \"pass/unsure\" to almost everything.</p><p>Lots of the time, it was because I thought the statement was ambiguous.</p><p>There was a space at the bottom where I could add a comment, but I wasn't clear on whether the comment I would add would be attached to the statement I was voting on, or whether it would create a new standalone statement</p>", "parentCommentId": null, "user": {"username": "Sanjay"}}, {"_id": "2gp43jJEpjzuucniH", "postedAt": "2022-11-19T12:33:05.491Z", "postId": "PtnGywLuk3Keo642c", "htmlBody": "<p>It would create a new standalone statement.</p>", "parentCommentId": "HaoPkS4scrJXJ2vof", "user": {"username": "nathan"}}, {"_id": "xSLKiBEenPKxxpiYF", "postedAt": "2022-11-19T12:56:12.776Z", "postId": "PtnGywLuk3Keo642c", "htmlBody": "<p>Also expressing uncertainty is good. That’s a feature here.</p>\n", "parentCommentId": "HaoPkS4scrJXJ2vof", "user": {"username": "nathan"}}, {"_id": "rSTsCE4NDgHzzp5nE", "postedAt": "2022-11-19T14:35:58.413Z", "postId": "PtnGywLuk3Keo642c", "htmlBody": "<p>It felt frustrating to me (and will likely complicate the findings) that \"pass\" had about five meanings (e.g., no opinion, too early to commit to an opinion, not applicable to me, too ambiguous, feelings too mixed for a response) and my pass response could be misinterpreted as having a meaning I didn't intend. That's just an inherent downside to the tool design, though.</p>\n", "parentCommentId": "xSLKiBEenPKxxpiYF", "user": {"username": "Jason"}}, {"_id": "gAZsE3kuiDefuAaoa", "postedAt": "2022-11-19T14:48:43.124Z", "postId": "PtnGywLuk3Keo642c", "htmlBody": "<p>I’m not convinced that the opinions that will be aggregated by this poll will constitute a representative sample of the EA movement.</p>\n", "parentCommentId": null, "user": {"username": "AllAmericanBreakfast"}}, {"_id": "ndLBoSdKdzkm3WNbk", "postedAt": "2022-11-19T14:52:51.732Z", "postId": "PtnGywLuk3Keo642c", "htmlBody": "<p>Thanks Nathan, this is an excellent initiative.&nbsp;</p>", "parentCommentId": null, "user": {"username": "David Varga"}}, {"_id": "7PBdRL6GdPhhvonM2", "postedAt": "2022-11-19T15:19:45.192Z", "postId": "PtnGywLuk3Keo642c", "htmlBody": "<blockquote><p>It shouldn't be used to say &nbsp;X% of EAs think this. That's not what this tool is for. Instead, it should suggest interesting questions to ask in future.</p></blockquote><p>I am confident they won't, nor is that what this is.&nbsp;</p>", "parentCommentId": "gAZsE3kuiDefuAaoa", "user": {"username": "nathan"}}, {"_id": "bXHaNtBvAt4hG9CGy", "postedAt": "2022-11-19T15:58:20.153Z", "postId": "PtnGywLuk3Keo642c", "htmlBody": "<p>Would like to see more of this!</p>\n", "parentCommentId": null, "user": {"username": "joel_bkr"}}, {"_id": "94nnApzje9KKGC3zu", "postedAt": "2022-11-19T18:15:14.746Z", "postId": "PtnGywLuk3Keo642c", "htmlBody": "<p>There are many statements there not particularly related to FTX (some of which I added myself). Even if the sample is not representative, this grouping does feel like a real division that I also see in EA circles in real life.</p>\n<p>[Edit: when this was written there were two groups, now there are three. Still, I maintain that there is some meaningful division here.]</p>\n", "parentCommentId": null, "user": {"username": "Guy Raveh"}}, {"_id": "LnmpJpm6m9mEYapaj", "postedAt": "2022-11-19T18:41:38.108Z", "postId": "PtnGywLuk3Keo642c", "htmlBody": "<p>Fair enough :) I still think it's worth amplifying this point.</p>", "parentCommentId": "7PBdRL6GdPhhvonM2", "user": {"username": "AllAmericanBreakfast"}}, {"_id": "pBvPwmsqFpugk7dtL", "postedAt": "2022-11-19T18:47:24.614Z", "postId": "PtnGywLuk3Keo642c", "htmlBody": "<p>(on phone) Thanks so much for doing this!I was going to post to request a survey today so really glad to this post. Polis seems cool and I have enjoyed using it.</p>\n<p>I'll take this as an opportunity to mention that I think we should normalise using consensus assessments (like something like polis or a more conventional survey) for nearly all community disagreements.</p>\n<p>At the moment it's usually impossible to determine what the EA community thinks on many issues. The lack of synthesis and consensus across complex debates makes it hard to update accurately.</p>\n<p>I do also see some downside risks for example with the media so we should be careful when we do this, with the questions asked, and with how results are publicised.</p>\n", "parentCommentId": null, "user": {"username": "Peterslattery"}}, {"_id": "9FAkJmcEzqNKhmkZP", "postedAt": "2022-11-19T18:50:12.432Z", "postId": "PtnGywLuk3Keo642c", "htmlBody": "<p>I added some statements intended to identify, in a general manner, the  respondent's role and level of engagement. I think it would be helpful to know if certain clusters were associated with focus on meta level work vs. being in a role like AI research vs. those of us who work in non-EA roles.</p>\n", "parentCommentId": null, "user": {"username": "Jason"}}, {"_id": "8KEkRXqivozQjiEus", "postedAt": "2022-11-19T18:51:30.815Z", "postId": "PtnGywLuk3Keo642c", "htmlBody": "<p>Relatedly, I would like EA to have a participant panel of EA community members who can be hired for a representative sample.we would survey this group when we want to know what the community thinks and not just rely on assessing those who have the time and confidence to visit/comment/vote on the forum etc. I'd love to see that happen asap because it would be very useful at a time like now.</p>\n", "parentCommentId": "pBvPwmsqFpugk7dtL", "user": {"username": "Peterslattery"}}, {"_id": "m9AL6DH25TWXvnQaT", "postedAt": "2022-11-19T18:54:00.715Z", "postId": "PtnGywLuk3Keo642c", "htmlBody": "<p>This is a good point. I am interested to hear what you think of the idea of having an EA research participant panel that we can recruit from to understand consensus within community debates?</p>\n", "parentCommentId": "9PoWLQ492xhXAYqii", "user": {"username": "Peterslattery"}}, {"_id": "DdXE4oP7Wv4JWbxqj", "postedAt": "2022-11-19T19:52:53.985Z", "postId": "PtnGywLuk3Keo642c", "htmlBody": "<p>Thanks. I'm not entirely sure what you're proposing but my guess is that we have better things to do with our time. Sorry for the unsophisticated answer!</p>", "parentCommentId": "m9AL6DH25TWXvnQaT", "user": null}, {"_id": "CrS5Z3uL5iPJ36Ykv", "postedAt": "2022-11-19T21:36:29.143Z", "postId": "PtnGywLuk3Keo642c", "htmlBody": "<p>Thanks for saying it.&nbsp;</p>", "parentCommentId": "LnmpJpm6m9mEYapaj", "user": {"username": "nathan"}}, {"_id": "pQDPCQjK7h5DCvEnh", "postedAt": "2022-11-19T21:39:06.265Z", "postId": "PtnGywLuk3Keo642c", "htmlBody": "<p>This is the largest polis poll by response I've ever done. I think I might start deleting boring answers to make it easier to navigate:</p><ul><li>Answers with consensus that seem unsurprising</li><li>Answers where everyone was uncertain</li><li>Answers which a similar answer is more approved</li></ul>", "parentCommentId": null, "user": {"username": "nathan"}}, {"_id": "pD4cjdMvxyLphe6cq", "postedAt": "2022-11-19T22:29:37.787Z", "postId": "PtnGywLuk3Keo642c", "htmlBody": "<p>Please don't delete answers. This is a fascinating snapshot of what people are thinking and I think there is merit for the poll to remain open and be reviewed in detail.&nbsp;</p><p>I wonder if there is any narrative coming out of the clusters/most agreed/disagreed/abstained questions/statements?&nbsp;</p>", "parentCommentId": "pQDPCQjK7h5DCvEnh", "user": {"username": "David Varga"}}, {"_id": "xqhn48HQdCp23epRC", "postedAt": "2022-11-19T22:35:18.677Z", "postId": "PtnGywLuk3Keo642c", "htmlBody": "<p>When I sort all statements by ranking, %agree and %disagree seem to rank as expedted - by % descending, but %passed seems to jump all over the place. Is there a reason for this or is this a bug?</p>", "parentCommentId": "pQDPCQjK7h5DCvEnh", "user": {"username": "David Varga"}}, {"_id": "BHjd7AT9inimD2zDJ", "postedAt": "2022-11-19T22:39:33.834Z", "postId": "PtnGywLuk3Keo642c", "htmlBody": "<p>I don't know. I don't really have a gears level understanding of polis.</p>", "parentCommentId": "xqhn48HQdCp23epRC", "user": {"username": "nathan"}}, {"_id": "ygWqGSqrGeuxf5wpY", "postedAt": "2022-11-19T22:40:08.439Z", "postId": "PtnGywLuk3Keo642c", "htmlBody": "<p>Well there are just too many answers now.&nbsp;</p>", "parentCommentId": "pD4cjdMvxyLphe6cq", "user": {"username": "nathan"}}, {"_id": "58Ci5aF527aF4krA3", "postedAt": "2022-11-19T23:19:41.028Z", "postId": "PtnGywLuk3Keo642c", "htmlBody": "<p>There are already 165 statements, more and more of them meta statements about the poll. Nathan, you created a monster.</p>\n<p>(Please don't take this as serious criticism)</p>\n", "parentCommentId": null, "user": {"username": "Guy Raveh"}}, {"_id": "W5KiWd8FFmmkWnoN2", "postedAt": "2022-11-19T23:21:31.557Z", "postId": "PtnGywLuk3Keo642c", "htmlBody": "<p>When you say \"delete answers\", do you mean statements or votes?</p>\n", "parentCommentId": "ygWqGSqrGeuxf5wpY", "user": {"username": "Guy Raveh"}}, {"_id": "CykmiiDmhP4N7ovYS", "postedAt": "2022-11-20T09:50:20.120Z", "postId": "PtnGywLuk3Keo642c", "htmlBody": "<p>On the object level, there now seem to be two roughly equal clusters. &nbsp;Cluster A are long-termist, consider EA epistemically humble,<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefp25au32br6l\"><sup><a href=\"#fnp25au32br6l\">[1]</a></sup></span>&nbsp;don't think we should blame ourselves for the FTX farrago and are unenthusiastic about democratisation. &nbsp;Cluster B take the opposite positions.</p><p>On the meta level:</p><ul><li>It seems a bit concerning that the OP stresses the poll shouldn't be used to say X% of EAs think Y, but the first item of the report is a list of statements where 60% of respondents either agreed or disagreed.<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefy63k80hd02n\"><sup><a href=\"#fny63k80hd02n\">[2]</a></sup></span>&nbsp; It seems that it would be easy to take these as consensus positions, when (a) the views of the 220 respondents may not be representative and (b) 60% isn't much of a consensus. &nbsp;It will be interesting to see, for example, whether people assert that that this poll shows wide support for \"EA leaders should be transparent about what they knew about SBF and when\".</li><li>Many of the \"majority\" statements seem anodyne. &nbsp;For example, it's not particularly interesting to highlight (as the report does) that most people agree the top team at FTX made poor decisions.</li><li>The report doesn't do a particularly good job at identifying \"statements which make this group unique\". &nbsp;It includes statements which majorities in both groups agree. &nbsp;It highlights the statement, \"I don't believe in longtermism and I don't feel like I can mention that to other EAs\" rather than the more basic, \"I think longtermism is true\". &nbsp;It doesn't clearly identify the difference in views on democratisation: e.g. the disagreement on the statements \"There should be a community-elected board in EA\", \"'EA should democratise', without any detail on how this could happen, or would have prevented FTX, is just an applause light\"<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefgat0y4oo58n\"><sup><a href=\"#fngat0y4oo58n\">[3]</a></sup></span>&nbsp;or \"Democratic and transparent processes of decision making are better for both quality and oversight.\"</li><li>The \"areas of uncertainty\" mostly identifies statements which in retrospect are unclear or inapplicable to most respondents, rather than any fundamental uncertainty. &nbsp;Possibly it would help to distuinguish \"pass\" from \"unsure\", with a \"pass\" not being counted as an answer at all.</li><li>I can't understand the graph at all. &nbsp;What are the axes? &nbsp;What are the rings? &nbsp;The graph doesn't show two clusters. &nbsp;If anything, there's one cluster in the centre, although that could conceivably be an artifact of the inner circle having a smaller area. &nbsp;How can participants be positioned \"close\" to statements they agreed, when agreement is 0/1?</li><li>OP says in a comment here that there are now too many statements, but the setup encourages respondents to submit statements. &nbsp;If anything, it seems surprising that 220 respondents only submitted 185 statements. &nbsp;Ideally, the poll would have many more respondents, so this seems to highlight a problem with the system.</li></ul><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnp25au32br6l\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefp25au32br6l\">^</a></strong></sup></span><div class=\"footnote-content\"><p>The most relevant statement here reads, \"I think EA is epistemically humble but external people don't seem to think so.\" &nbsp;It seems likely to me, based on other responses, that the disagreement stems from the first part, but of course a person who believed EA to be universally acknowledged as epistemically humble would also disagree. &nbsp;In retrospect, it would have been better to have \"EA is epistemically humble\" and \"External people don't consider EA to be epistemically humble\" as separate statements.</p></div></li><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fny63k80hd02n\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefy63k80hd02n\">^</a></strong></sup></span><div class=\"footnote-content\"><p>For some reason \"EA should not aim to be a community\" is also appearing here although only 55% of respondents disagree.</p></div></li><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fngat0y4oo58n\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefgat0y4oo58n\">^</a></strong></sup></span><div class=\"footnote-content\"><p>Of course cluster B does have at least one concrete proposal, namely a community-elected board. &nbsp;It's just that cluster A thinks that would be bad.</p></div></li></ol>", "parentCommentId": null, "user": {"username": "RobertJones"}}, {"_id": "GswQuLoS2TGyYMzJb", "postedAt": "2022-11-20T11:11:40.683Z", "postId": "PtnGywLuk3Keo642c", "htmlBody": "<p>It looks to me like the clustering is basically ok, but the presentation breaks down when there are so many statements. Better to just look at the full list.</p>\n", "parentCommentId": "CykmiiDmhP4N7ovYS", "user": {"username": "Guy Raveh"}}, {"_id": "PkJ2Xvjyi5ActECEC", "postedAt": "2022-11-20T15:24:42.328Z", "postId": "PtnGywLuk3Keo642c", "htmlBody": "<p>Thanks for running this, Nathan!</p>\n<p>A few general comments for future runs:</p>\n<p>People might benefit from more clarity around what makes a good statement to submit: e.g., respondents are expected to have different opinions/responses and those differences might be expected to cluster with existing statements in ways that would be helpful to understand.</p>\n<p>Although I know Polis isnt intended as a crowdsourced poll per se, I wonder if there is value to running an \"open\" polis every quarter for that purpose. I got the sense that some community members  saw a chance to anonymously get a sense of community sentiment on unrelated topics that were of concern to them (e.g., flirting at EAG). Obviously, there would have to be some norms and limits around this.</p>\n<p>I think having a quick way for people to anonymously raise issues and get a measure of possible community sentiment is a good thing. Even understanding the sample bias problems, I think getting shallow feedback still often has enough value to justify five to seven minutes of the community's collective time. The result could be helpful in informing someone that the topic is worth devoting several hours to a detailed forum post, or inclusion in a more formal / widespread poll.</p>\n", "parentCommentId": null, "user": {"username": "Jason"}}, {"_id": "sPmSa2P4YH9PJHase", "postedAt": "2022-11-21T04:34:13.373Z", "postId": "PtnGywLuk3Keo642c", "htmlBody": "<p>I'm excited by the prospect of Polis, but it's frustratingly limited. The system has no notion of whether people are agreeing with a statement because it's convincing or bridging the gap, or because it's banal.</p><p>In this case... I don't think we're really undergoing any factionalization about this? In that case, should we not just try <i>talking more</i>... that usually works pretty well with us.</p>", "parentCommentId": null, "user": {"username": "MakoYass"}}, {"_id": "LZcocJR3NKPFm86Pz", "postedAt": "2022-11-21T04:54:39.747Z", "postId": "PtnGywLuk3Keo642c", "htmlBody": "<p>Thanks for this interesting tool. &nbsp;I'd suggest that you suggest to submitters not to send compound statements in the section \"What makes a good statement.\" &nbsp;E.g., \"It's really bad that EAs don't feel comfortable questioning longtermism. This points to deeper groupthink inside EA.\" If it's a premise-conclusion statement, you could also make clear that voters should pass unless they accept the premise.</p>", "parentCommentId": null, "user": {"username": "Vivian.Lwd"}}, {"_id": "9mAvejj5NA4GTRJbc", "postedAt": "2022-11-21T20:15:15.037Z", "postId": "PtnGywLuk3Keo642c", "htmlBody": "<p>Talking is a great idea in general, but it seems there are some opinions in this survey suggesting that there are barriers to talking openly?</p>", "parentCommentId": "sPmSa2P4YH9PJHase", "user": {"username": "Achim"}}, {"_id": "obeeBwiKWAYdyHYLv", "postedAt": "2022-11-21T20:49:46.775Z", "postId": "PtnGywLuk3Keo642c", "htmlBody": "<p>I believe the forum allows commenting anonymously, though I wouldn't know how to access that feature.</p><p>Psuedonyms would be a bit better, but it'll do.</p>", "parentCommentId": "9mAvejj5NA4GTRJbc", "user": {"username": "MakoYass"}}, {"_id": "f6WyEaYtuNpdtHFRs", "postedAt": "2022-11-21T21:36:49.556Z", "postId": "PtnGywLuk3Keo642c", "htmlBody": "<p>As far as I know, the supported way to comment anonymously is to make an anonymous account</p>", "parentCommentId": "obeeBwiKWAYdyHYLv", "user": {"username": "Lorenzo Buonanno"}}]