[{"_id": "FGqPToDQL97LHEA3G", "postedAt": "2023-08-31T09:43:32.019Z", "postId": "PTtZWBAKgrrnZj73n", "htmlBody": "<p>Thanks for the write-up. Just adding a note on how this distinction has practical implications for how to design databases containing hazardous sequences that are required for <a href=\"https://www.nti.org/about/programs-projects/project/preventing-the-misuse-of-dna-synthesis-technology/\">gene synthesis screening</a> systems.</p><p>With gene synthesis screening, companies want to stop bad actors from getting access to the physical DNA or RNA of potential pandemic pathogens. Now, let's say researchers find the sequence of a novel pathogen that would likely spark a pandemic if released. Most would want this sequence to be added to synthesis screening databases. But <a href=\"https://www.frontiersin.org/articles/10.3389/fbioe.2019.00086/full\">some</a> also want this database to be <i>public. </i>The information hazards involved in making such information publicly available could be large, especially if there is attached discussion of how <i>exactly</i> these sequences are dangerous.</p>", "parentCommentId": null, "user": {"username": "Simon_Grimm"}}, {"_id": "LpEkfrHgmw6GZXMNJ", "postedAt": "2023-08-31T11:00:36.378Z", "postId": "PTtZWBAKgrrnZj73n", "htmlBody": "<p>Yup!</p>\n<p>(I expected to see your comment link to <a href=\"https://securedna.org/\">SecureDNA</a>, which has a cryptographic solution to screening synthesis without either (a) sending hazards to synthesizers or (b) sending reconstructible synthesis orders to others.)</p>\n", "parentCommentId": "FGqPToDQL97LHEA3G", "user": {"username": "Jeff_Kaufman"}}, {"_id": "iZei2adtdtnawBpya", "postedAt": "2023-08-31T19:48:37.445Z", "postId": "PTtZWBAKgrrnZj73n", "htmlBody": "<p><strong>Executive summary</strong>: The cultures of biosecurity and computer security differ in important ways due to the differences in constraints and capabilities surrounding biological vs. computer vulnerabilities.<br><br><strong>Key points</strong>:</p><ol><li>Computer security culture values openness, breaking things to understand them, and satisfying curiosity. This culture developed in a context where vulnerabilities could be fixed by vendors, avoided in future software, and mitigated by users.</li><li>Biosecurity culture is much more cautious about disclosing and exploring vulnerabilities. This is because biology lacks easy fixes, mitigations are expensive, and a vulnerability could enable serious harm if exploited by malicious actors.</li><li>The norms of computer security culture would be risky and irresponsible if applied directly to biosecurity. The constraints are different enough that different norms have developed.</li><li>There are good reasons for biosecurity culture being more closed and cautious than typical computer security culture given the lack of mechanisms for mitigating biological risks.</li><li>Understanding these different constraints helps explain the different norms despite both fields dealing with vulnerabilities and risks.</li></ol><p>&nbsp;</p><p><i>This comment was auto-generated by the EA Forum Team. Feel free to point out issues with this summary by replying to the comment, and</i><a href=\"https://forum.effectivealtruism.org/contact\"><i>&nbsp;<u>contact us</u></i></a><i> if you have feedback.</i></p>", "parentCommentId": null, "user": {"username": "SummaryBot"}}, {"_id": "5BcTKDmFAsM6uNTB2", "postedAt": "2023-08-31T22:44:49.156Z", "postId": "PTtZWBAKgrrnZj73n", "htmlBody": "<p>Hi slg — great point about synthesis screening being a very concrete example where approaches to security can make a big difference.</p>\n<p>One quibble I have: Your hyperlink seems to suggest that Diggans and Leproust advocate for a fully “public” database of annotated hazard sequences. But I think it’s worth noting that although they do use the phrase “publicly available” a couple of times, they also pretty explicitly discuss the idea of having such a database be accessible to synthesis providers only, which is a much smaller set and seems to carry significantly lower risks for misuse than truly public access. Relevant quote:</p>\n<p>“Sustained funding and commitment will be required to build and maintain a database of risk-associated sequences, their known mechanisms of pathogenicity and the biological contexts in which these mechanisms can cause harm. This database (or at a minimum a screening capability making use of this database), to have maximum impact on global DNA synthesis screening, must be available to both domestic and international providers.”</p>\n<p>Also worth noting the parenthetical about having providers use a screening mechanism with access to the database without having such direct access themselves, which seems like a nod to some of the features in, eg, SecureDNA’s approach.</p>\n", "parentCommentId": "FGqPToDQL97LHEA3G", "user": {"username": "jtm"}}, {"_id": "dvydiMvjqrtHGspA9", "postedAt": "2023-09-01T02:45:52.071Z", "postId": "PTtZWBAKgrrnZj73n", "htmlBody": "<p>I think benchtop synthesizers would change this quite a bit? Because then you need one of:</p>\n<ul>\n<li>\n<p>Ship the database on every benchtop, where it is at much higher risk of compromise.</p>\n</li>\n<li>\n<p>Have benchtops send each synthesis request out for screening.</p>\n</li>\n<li>\n<p>Something like Secure DNA's approach, where the benchtop sends the order out for screening in a format that does not disclose it's contents.</p>\n</li>\n</ul>\n", "parentCommentId": "5BcTKDmFAsM6uNTB2", "user": {"username": "Jeff_Kaufman"}}, {"_id": "aRw9PgMSbNmg7axux", "postedAt": "2023-09-01T09:00:39.474Z", "postId": "PTtZWBAKgrrnZj73n", "htmlBody": "<p>Yes, benchtop devices have significant ramifications!&nbsp;</p><ul><li>Agreed, storing the database on-device does sound much harder to secure than some kind of distributed storage. Though, I can imagine that some customers will demand airgapped on-device solutions, where this challenge could present itself anyway.</li><li>Agreed, sending exact synthesis orders from devices to screeners seems undesirable/unviable, for a host of reasons.&nbsp;</li></ul><p>But that's consistent with my comment, which just meant to emphasise that I don't read Diggans and Leproust as advocating for a fully <i>\"public</i>\" hazard database, as slg's comment could be read to imply.</p>", "parentCommentId": "dvydiMvjqrtHGspA9", "user": {"username": "jtm"}}, {"_id": "HL3rochrtpF8k6JHT", "postedAt": "2023-09-01T10:06:20.186Z", "postId": "PTtZWBAKgrrnZj73n", "htmlBody": "<p>That's a good pointer, thanks! I'll drop the reference to Diggans and Leproust for now.</p>", "parentCommentId": "5BcTKDmFAsM6uNTB2", "user": {"username": "Simon_Grimm"}}, {"_id": "tPmmKLbn54oiLsbKz", "postedAt": "2023-09-01T11:01:05.055Z", "postId": "PTtZWBAKgrrnZj73n", "htmlBody": "<p>To be clear, I definitely think there's a spectrum of attitudes towards security, centralisation, and other features of hazard databases, so I think you're pointing to an important area of meaningful substantive disagreement!</p>", "parentCommentId": "HL3rochrtpF8k6JHT", "user": {"username": "jtm"}}, {"_id": "bA89qbDiy4ibMrpbA", "postedAt": "2023-09-10T02:07:26.978Z", "postId": "PTtZWBAKgrrnZj73n", "htmlBody": "<p>If your benchtop device user can modify the hardware to attempt to defeat the screening mechanism, the problem becomes orders of magnitude harder. I imagine that making a DNA sequence generating device that can't be modified to make smallpox <em>even if it's in the middle of Pyongyang and the malicious user is the North Korean government</em> is an essentially unsolvable problem - if nothing else, they can try to reverse engineer the device and build a similar one without any screening mechanism at all.</p>\n", "parentCommentId": "aRw9PgMSbNmg7axux", "user": {"username": "CronoDAS"}}, {"_id": "w8gCc5dbgojDqvTWY", "postedAt": "2023-09-10T12:43:06.506Z", "postId": "PTtZWBAKgrrnZj73n", "htmlBody": "<p>A bit tangential, but this raises an important point: in general, you're looking for things that raise the bar for causing harm. If you can take smallpox synthesis from something where anyone who works in a lab with a benchtop can synthesize it without even opening in the machine to one where they would have to disassemble it, but that already increases the chance that someone else in the lab would notice.</p>\n<p>It would be great to get to a place where we have systems that will provide reliable protection even from well-funded state actors, but (a) a lot of the risk comes from much easier cases like it becoming easier for an individual to cause harm and (b) we are so far from having that kind of protection that efforts to improve the situation there should be much lower priority than ones that handle the easier cases.</p>\n", "parentCommentId": "bA89qbDiy4ibMrpbA", "user": {"username": "Jeff_Kaufman"}}, {"_id": "KpDo59ic98eSRz8Yw", "postedAt": "2023-09-10T01:46:10.517Z", "postId": "PTtZWBAKgrrnZj73n", "htmlBody": null, "parentCommentId": "LpEkfrHgmw6GZXMNJ", "user": null}]