[{"_id": "B8HSZrrz4tHbAQ9GB", "postedAt": "2023-09-04T18:24:16.002Z", "postId": "PubK8PnrLgFet92rx", "htmlBody": "<p>Given the abundance of climate philanthropy which often follows similar albeit not identical goals, is it really true that addressing air pollution is neglected? What is the strongest case for air pollution philanthropy addressing a significantly different problem?</p>\n", "parentCommentId": null, "user": {"username": "jackva"}}, {"_id": "WhcA5qzcQ4YWWeNJu", "postedAt": "2023-09-05T17:53:11.238Z", "postId": "PubK8PnrLgFet92rx", "htmlBody": "<p>How would he respond to Shruti Rajagopalan's core argument against EA solutions being effective in the case of India (specifically Delhi's) air pollution causes - <a href=\"https://srajagopalan.substack.com/p/altruism-and-development-its-complicated\">https://srajagopalan.substack.com/p/altruism-and-development-its-complicated</a></p>\n", "parentCommentId": null, "user": {"username": "Akash Kulgod"}}, {"_id": "xjcrJG7rvwgKDJvED", "postedAt": "2023-09-06T05:05:27.385Z", "postId": "PubK8PnrLgFet92rx", "htmlBody": "<p>Two questions:<br><br>1. What do you think of the Coasian solution to Punjab/Haryana's paddy burning where Delhi (mostly) pays for the machines &nbsp;required to prevent the burning? Per the estimates Shruti cites <a href=\"https://www.livemint.com/opinion/columns/ronald-coase-has-a-solution-for-delhi-s-air-pollution-11573491626858.html#\">here</a>, the benefits would be more than 10x the cost. Are the main barriers to this political (it would be a bad look for the Delhi govt to pay Punjabi farmers), or something else?<br><br>2. The Delhi metro with an average daily ridership of over <strong>5.5 million trips </strong>likely prevents a massive amount of tailpipe pollution. A larger, better run bus fleet would likely have a similar effect. Even if this is <i><strong>distinctly not &nbsp;</strong></i>a neglected area, influencing city-wide policy has potentially massive scale. Are there any cost-effective opportunities for philanthropists speed to speed up the development/improve the efficacy of public transport systems? Maybe in smaller cities with less expertise?</p>", "parentCommentId": null, "user": {"username": "km"}}, {"_id": "ZqezzJgAnAkBk4r8v", "postedAt": "2023-09-07T18:35:45.364Z", "postId": "PubK8PnrLgFet92rx", "htmlBody": "<p>Sorry in what sense does Shruti say that EA solutions aren't effective in the case of air pollution? Do you mean that the highest 'EV' interventions are likely to be ones with high uncertainty about whether they work or not?</p>\n<p>(I don't think of EA as being about achieving high confidence in impact, if anything I'd associate EA with high-risk hits based giving.)</p>\n", "parentCommentId": "WhcA5qzcQ4YWWeNJu", "user": {"username": "Robert_Wiblin"}}, {"_id": "DFhpDBixcrbtavNpf", "postedAt": "2023-09-07T19:04:59.619Z", "postId": "PubK8PnrLgFet92rx", "htmlBody": "<p>[disclaimer that I'm not Shruti so can only offer my interpretation of the argument she makes]</p><p>I think this paragraph from her piece does a good job of distilling the challenge of air pollution -</p><p>\"It takes decades, maybe centuries to develop high state capacity that can tackle commons problems, mitigate pollution and create a world-class clean public transportation system. And this requires increases in economic growth and government revenue as well as well aligned political incentives. The problem is there is no simple solution that can be easily implemented. Unlike malaria, the impact of air pollution cannot be avoided by handing out air purifiers. They they don’t even make a dent in lowering the hazardous AQI in Delhi. The problem can only be solved though better governance mechanisms and innovation. Innovation can take the form of better construction technology that doesn’t contribute as much to particulate matter pollution. Or by developing cleaner fuel for vehicles. Or through better carbon capture and particulate matter capture technology. But none of this is legible or predictable.\"</p><p>I think the last sentence is the crux, solutions to air pollution are neither legible or predictable. I'd claim that legibility and predictability are pretty central to EA based giving, at least GiveWell flavour EA, because they bear on how measures of tractability and impact are calculated.</p><p>On predictability, I'd be interested to know why you'd associate EA with high-risk hits based giving. From reading GiveWell cost-effectiveness reports (on say Iron Fortification for instance), I recall there being discounts based on how uncertain members evaluating the grant thought the evidence was. I thought this was fairly standard practice across such grants.</p><p>On legibility, I think Shruti is making the point that it would be really difficult to know the precise interventions needed to make sure Delhi's air pollution problem never got as bad as it did and it still isn't totally clear what the best ones are. What we do seem to know is that improving state capacity (strongly linked to economic growth), and driving technological innovation (funding carbon capture startups for instance) are likely the best approaches to tackling air pollution in India. And neither of those two options seem particularly EA-aligned.</p><p><br>&nbsp;</p>", "parentCommentId": "ZqezzJgAnAkBk4r8v", "user": {"username": "Akash Kulgod"}}, {"_id": "QjeTFzmaRz7JNH8d5", "postedAt": "2023-09-08T11:20:32.263Z", "postId": "PubK8PnrLgFet92rx", "htmlBody": "<p>Ah OK, I agree it's not that consistent with GiveWell's traditional approach.</p>\n<p>I think of high-confidence GiveWell-style giving as just one possible approach one might take in the pursuit of 'effective altruism', and it's one that I personally think is misguided for the sorts of reasons Shruti is pointing to.</p>\n<p>High-confidence (e.g. GiveWell) and hits-based giving (e.g. Open Phil, all longtermism) are both large fractions of the EA-inspired portfolio of giving and careers.</p>\n<p>So really I should just say that there's nothing like a consensus around whether EA implies going for high-confidence or low-confidence strategies (or something in the middle I guess).</p>\n<p>(Incidentally from <a href=\"https://80000hours.org/podcast/episodes/elie-hassenfeld-givewell-critiques-and-lessons/\">my interview</a> with Elie I'd say GiveWell is actually now doing some hits-based giving of its own.)</p>\n", "parentCommentId": "DFhpDBixcrbtavNpf", "user": {"username": "Robert_Wiblin"}}, {"_id": "foNvT5TWt7sNdTcqq", "postedAt": "2023-09-09T18:08:19.216Z", "postId": "PubK8PnrLgFet92rx", "htmlBody": "<p>Thanks for this Robert, gives me more context on some of the EA flavours. I have a sense that even OP hits-based giving isn't fully aligned with the point Shruti is making (after all EA is not EV - Emergent Ventures) but I wouldn't be sure how to articulate the difference. Think it could be a great conversation for your podcast to host :))</p>\n", "parentCommentId": "QjeTFzmaRz7JNH8d5", "user": {"username": "Akash Kulgod"}}]