[{"_id": "CCgjYDAfbLC7Dh6bM", "postedAt": "2024-03-13T08:34:51.791Z", "postId": "PvzdP6T5KQDSXWiSm", "htmlBody": "<p>Thanks for publishing this take, it was interesting to read!<br>What do you think are the main differences from the EA community to your work environment in Bristol? Can't be the level of education, EA rates pretty high on that.&nbsp;<br>And do you have any ideas what single groups could do to tackle this issue? So not necessarily \"the community\" at large, but a group that wants to change the way they act?</p>", "parentCommentId": null, "user": {"username": "Milena Canzler"}}, {"_id": "qajCpwG97dpPa4ZL6", "postedAt": "2024-03-13T09:29:29.588Z", "postId": "PvzdP6T5KQDSXWiSm", "htmlBody": "<p>Thanks Milena! I am not sure what aspects of either environment might drive this difference. I am not sure what other PoC or women had in terms of experience at the company in Bristol. What I do know is that they did not really do anything on the DEI front. So maybe it was some sort of selection effect that hiring managers implicitly applied in their hiring?<br><br>I think in terms of EA, maybe I will walk a bit back on my suggestion to look at Deloitte or others - maybe we are unique enough in terms of not being a company, being pretty unusual overall etc. that the easiest way forward is just to try something that seems like it could be effective, checking in with the people we want to try to make EA more welcoming for, and seeing if we can learn from that? But I might also be a bit biased towards the move-fast-and-break things mentality, perhaps we should deliberate more before doing something. I don't know, sorry! I am looking at doing something small here in Sweden and hopefully we can learn something from it that is of use to others. If it works out well I am sure it will be communicated (might be more than a year though!). I guess I would generally encourage people to step up and collaborate on trying to do <i>something</i>.&nbsp;</p>", "parentCommentId": "CCgjYDAfbLC7Dh6bM", "user": {"username": "Ulrik Horn"}}, {"_id": "7p5uJEvWridxphxKk", "postedAt": "2024-03-13T10:38:19.087Z", "postId": "PvzdP6T5KQDSXWiSm", "htmlBody": "<p><strong>If you downvote</strong> (no offense taken!) can you please <strong>indicate why by voting in my sub comments to this comment</strong>? I am asking as I know there is cancel culture and I can definitely understand if people do not want to be publicly saying something strongly negative about this post. I think having a general idea why people react negatively is helpful for the larger community.</p>", "parentCommentId": null, "user": {"username": "Ulrik Horn"}}, {"_id": "4qpcQRyRuw9SbYkmf", "postedAt": "2024-03-13T10:39:12.622Z", "postId": "PvzdP6T5KQDSXWiSm", "htmlBody": "<p>I am reacting to the emotional appeal/lack of rationality/lack of data or something like this.</p>", "parentCommentId": "7p5uJEvWridxphxKk", "user": {"username": "Ulrik Horn"}}, {"_id": "2rZFFY3a5zEtTGWGJ", "postedAt": "2024-03-13T10:39:54.210Z", "postId": "PvzdP6T5KQDSXWiSm", "htmlBody": "<p>I want solutions and optimism/no need to bash EA more/etc.</p>", "parentCommentId": "7p5uJEvWridxphxKk", "user": {"username": "Ulrik Horn"}}, {"_id": "sGok6yn3ffMuf9uZq", "postedAt": "2024-03-13T10:40:20.999Z", "postId": "PvzdP6T5KQDSXWiSm", "htmlBody": "<p>I do not think we have any issues that need resolving/the worries about DEI are exaggerated/etc.</p>", "parentCommentId": "7p5uJEvWridxphxKk", "user": {"username": "Ulrik Horn"}}, {"_id": "sTGGbfFBxiFss6RkJ", "postedAt": "2024-03-13T10:41:22.112Z", "postId": "PvzdP6T5KQDSXWiSm", "htmlBody": "<p>Something else but please stop making all these comments</p>", "parentCommentId": "7p5uJEvWridxphxKk", "user": {"username": "Ulrik Horn"}}, {"_id": "GutsAukwu2utuKStM", "postedAt": "2024-03-13T10:41:49.442Z", "postId": "PvzdP6T5KQDSXWiSm", "htmlBody": "<p>Something else, think harder and propose other reactions and I might vote on them if you identify the right one</p>", "parentCommentId": "7p5uJEvWridxphxKk", "user": {"username": "Ulrik Horn"}}, {"_id": "Ezpc8fyCbx8hKNbWt", "postedAt": "2024-03-13T10:43:14.653Z", "postId": "PvzdP6T5KQDSXWiSm", "htmlBody": "<p>I'm a PoC/other marginalized group and I find this wrong/offensive</p>", "parentCommentId": "7p5uJEvWridxphxKk", "user": {"username": "Ulrik Horn"}}, {"_id": "q3MgEAss4v5krJbj4", "postedAt": "2024-03-13T10:44:18.422Z", "postId": "PvzdP6T5KQDSXWiSm", "htmlBody": "<p>I'm in one of the \"marginalized\" groups the post highlights but my experience with EA is good/you do not really represent how I feel</p>", "parentCommentId": "7p5uJEvWridxphxKk", "user": {"username": "Ulrik Horn"}}, {"_id": "JCoaB9LJoJuakhtk6", "postedAt": "2024-03-13T11:35:24.009Z", "postId": "PvzdP6T5KQDSXWiSm", "htmlBody": "<p>I tick 2.5 of the DEI boxes you’ve identified, and I found this post quite off-putting. It’s hard for me to evaluate the examples as the box you’ve reasonably chosen to focus on I don’t tick, but the anecdote about your experience on the plane I found quite alarming. You say “I get it”, but <em>I</em> don’t get it. Airport security is overly stringent, and I’d be very surprised if I’d react that way in similar circumstances. Should I be offended that you think it’s representative of the average white person’s feelings? So I wonder if you might be projecting your own biases onto other white people/men/etc.</p>\n", "parentCommentId": null, "user": {"username": "bec_hawk"}}, {"_id": "KnxkomwtDMQH72Gm7", "postedAt": "2024-03-13T11:35:53.433Z", "postId": "PvzdP6T5KQDSXWiSm", "htmlBody": "<p>Thanks for the post, I definitely agree with the importance of DEI.&nbsp;</p><p>I wonder to what extent the issue comes from individual ignorance (asking \"where are you from\" once is fine, but do not reject an answer and ask again), and to what extent it comes from ideology. There are a sizeable contingent of people with anti-social justice beliefs, who have a natural inclination to be dismissive of sexism and racism concerns. And as you noted, it only takes 1 or 2 bad experiences for someone to feel unwelcome in a place and leave, so even if 90% of the people are committed to DEI, will it have that much of an impact if the others are anti-woke crusaders?&nbsp;</p>", "parentCommentId": null, "user": {"username": "titotal"}}, {"_id": "vDFzLfTQF6x6KLFqt", "postedAt": "2024-03-13T12:56:32.795Z", "postId": "PvzdP6T5KQDSXWiSm", "htmlBody": "<p>Didn't vote, but I can imagine that some people see \"DEI\" and reflexively downvote (or upvote!) the post without actually reading any significant portion thereof</p>\n", "parentCommentId": "7p5uJEvWridxphxKk", "user": {"username": "Jason"}}, {"_id": "kYSwkN4NMK3fzGubu", "postedAt": "2024-03-13T13:17:26.301Z", "postId": "PvzdP6T5KQDSXWiSm", "htmlBody": "<p>Thanks, I do not know what to think of that. I guess I am updating ever so slightly to treading more and more carefully as at least some people are indicating that my experiences might just be bad luck/me being a bit too sensitive around this topic.<br><br>And I am not sure what to make of the two agree votes on your comment - does it mean that other people also suspect others of knee-jerk downvoting or are the votes from people who admit to such knee-jerk downvoting. I am guessing the former as if they don't read much they probably do not dig into comment fields.</p>", "parentCommentId": "vDFzLfTQF6x6KLFqt", "user": {"username": "Ulrik Horn"}}, {"_id": "z2MpstNw8CbtPpts5", "postedAt": "2024-03-13T14:20:22.728Z", "postId": "PvzdP6T5KQDSXWiSm", "htmlBody": "<p>Thanks for writing this, Ulrik. I also want to see better inclusiveness within EA, so we have something in common. 😂</p><p>My general way of learning about an area involves a lot of exploratory learning, so I've been <a href=\"https://www.notion.so/Joseph-s-resources-on-DEI-4a6a455dec2e42dd8a31506f78df21d2?pvs=4\">doing some reading</a> and having conversations with EAs about inclusion/feeling welcome in the EA community during the past year or so. I don't have any particularly amazing discoveries yet, but I'll keep my eyes open. I'm glad to see that some other people are also paying attention to these kinds of issues.</p>", "parentCommentId": null, "user": {"username": "jlemien"}}, {"_id": "5k3DqcAmihJYdGeL4", "postedAt": "2024-03-13T14:28:00.051Z", "postId": "PvzdP6T5KQDSXWiSm", "htmlBody": "<p>I wouldn't update toward \"some people are indicating that my experiences might just be bad luck/me being a bit too sensitive around this topic\" based on a few unexplained downvotes.</p><p>As I write this, your post is sitting on +19 with 15 votes; the number of downvotes is unknown but 4-7 might be a reasonable estimate. Based on past comments and voting patterns, there are way more than 4-7 \"anti-woke\" people (to quote <a href=\"https://forum.effectivealtruism.org/users/titotal?mention=user\">@titotal</a>) on the Forum, and some of them have a decent chunk of karma.&nbsp;</p><p>There are also other plausible reasons to downvote the post, so it's quite possible that some downvotes are related to that. I find the post a bit aimless at points, and to me a lot of the examples boil down to verbose expositions of \"Don't be a jerk (or worse) to people. Do better, y'all.\" I do not mean that as a criticism. It's draft amnesty week, and you were specifically invited by others to post your draft. Anyone who chose to read was on notice that it was draft-y. I <i>don't </i>think a downvote is warranted by those weaknesses in the post. But I have a fairly high threshold for downvoting posts in the first place, and others might not not apply special hesitancy to downvote draft amnesty week posts. Also, to the extent you are considering an update on upvote/downvote ratio, these post-specific characteristics may explain why you aren't seeing as many upvotes from people who are generally supportive of your viewpoint.</p><p>In sum, I think updating on the downvotes here is just too speculative.</p>", "parentCommentId": "kYSwkN4NMK3fzGubu", "user": {"username": "Jason"}}, {"_id": "jzkcbfDiWmMFwrT2P", "postedAt": "2024-03-13T14:30:05.436Z", "postId": "PvzdP6T5KQDSXWiSm", "htmlBody": "<blockquote><p>even if 90% of the people are committed to DEI, will it have that much of an impact if the others are anti-woke crusaders?&nbsp;</p></blockquote><p>Not if the 90% don't call out bad behavior when they see it.</p>", "parentCommentId": "KnxkomwtDMQH72Gm7", "user": {"username": "Jason"}}, {"_id": "NxE3D3nMjv9YRiMJb", "postedAt": "2024-03-13T15:10:30.751Z", "postId": "PvzdP6T5KQDSXWiSm", "htmlBody": "<p>Nice post and I agree that we should avoid saying things that might make people feel unwelcome or uncomfortable based on characteristics.</p><p>One thing that I bristle at a bit is that I think the exclusion that offhand comments or controversial posts cause is probably dwarfed by orders of magnitude by the exclusion caused by material considerations that prevent minorities (as well as the vast majorities of whites) from being able to contribute to the same degree in EA. If you look around at people at an EAG, you can pretty safely bet that they are not only in college/college educated, but that their parents were as well. They probably have savings, either personally, or through family that they can rely on, to be able to take risks for their personal ambitions, which in the case of EAS, are often choices that enable them to better the world. It kills me when I listen to podcasts and audiobooks that note that mornings are often the most important parts of the day, yet I, and the vast majority of people must direct most of our most productive time in a day to a job that is not impactful rather than the projects that we think can profoundly better the world.&nbsp;</p><p>I realize that maybe this is a &nbsp;less tractable issue than make EAs do less microaggressions/controversial and offensive posts. But I think the EA community is grossly negligent with regard to what may be its most valuable resource... EAs. Maybe another amnesty post will be about considering people as agents and people as patients... I think the people I'm talking about - low and middle income people in rich and middle income countries, a lot in lower income countries - basically everyone not in the top global 0.5% , are mostly not good targets as moral patients. The very poorest people, farmed animals, and future people are probably much more fruitful targets for direct utility increases. But if these people are committed to using their minds and effort as EAs do, many of them may be excellent targets as <i>agents</i>. This point probably applies with even greater force to people in middle and low-income countries who are disproportionately likely to be POC.</p><p>Anyways, apologies for the digressive response. I should probably just write the full amnesty post on the subject with the time I do not have because I have a full-time non-EA job and run a nonprofit.</p>", "parentCommentId": null, "user": {"username": "Brad West"}}, {"_id": "v7xDJbyZfe3hD8w2p", "postedAt": "2024-03-13T15:25:20.675Z", "postId": "PvzdP6T5KQDSXWiSm", "htmlBody": "<p>Hi Rebecca, I am realizing after posting and after your insightful comment that <i>perhaps</i> my feelings about DEI maybe is at least to some degree some sort of male/white guilt and that I am overcompensating. And it is a good point that I might be projecting my biases too strongly onto others who share my privileges - I did spend the first 18 years of my life in a very white environment, for example, so am probably wired quite differently from someone that grew up somewhere more diverse. Your comment is definitely well taken and makes me update towards being even more careful about <i>doing </i>something about DEI.&nbsp;<br><br>I guess what I tried to say by that example and \"I get it\" was more addressing the people who have engaged in \"poor DEI behavior\" like asking where someone is from - I did not want to come across as too unsympathetic to <i>those </i>individuals. I think I did not mean to say that most white people would have reacted like me - that I have no idea about and really hope is not the case.</p>", "parentCommentId": "JCoaB9LJoJuakhtk6", "user": {"username": "Ulrik Horn"}}, {"_id": "pZpXWc3LQAbrxEPjT", "postedAt": "2024-03-13T16:47:33.287Z", "postId": "PvzdP6T5KQDSXWiSm", "htmlBody": "<p><strong>Executive summary:</strong> The author is passionate about promoting diversity, equity, and inclusion (DEI) in the effective altruism (EA) community due to personal experiences and a conviction that marginalized groups should feel welcome and included in the movement.</p><p><strong>Key points</strong>:</p><ol><li>The author provides personal anecdotes highlighting their lived experiences and exposure to marginalized groups, shaping their high expectations for inclusive behavior.</li><li>The author expresses embarrassment and fear of bringing close friends and family from diverse backgrounds to EA events due to observed insensitive and discriminatory behavior from some community members.</li><li>The author aims to work towards improving DEI in EA to create a sense of belonging for themselves and those they care about, even if it means overstepping boundaries or ruffling feathers.</li><li>While acknowledging personal biases and potential lack of statistical significance, the author emphasizes that DEI is a personal and emotional issue, not just a political campaign.</li><li>The author suggests potentially great value in making EA more welcoming to underrepresented groups for tapping into a larger global talent pool.</li><li>The author recommends properly compensating marginalized groups taking the lead on DEI work in EA to avoid unfair burden on them.</li></ol><p>&nbsp;</p><p>&nbsp;</p><p><i>This comment was auto-generated by the EA Forum Team. Feel free to point out issues with this summary by replying to the comment, and</i><a href=\"https://forum.effectivealtruism.org/contact\"><i>&nbsp;<u>contact us</u></i></a><i> if you have feedback.</i></p>", "parentCommentId": null, "user": {"username": "SummaryBot"}}, {"_id": "hf7HNeKZLorfXwQeQ", "postedAt": "2024-03-14T09:12:11.462Z", "postId": "PvzdP6T5KQDSXWiSm", "htmlBody": "<p>Maybe some of it comes down to differences in the broader environment. The UK has larger (visible) proportion of People of Colour compared to, I guess, Sweden and in my case, Germany. So while that doesnt mean that all people in the UK are anti-racist or so, having more interactions with a diverse range of people might make it more likely that you'll learn a thing about not offending. Plus, it might not be that interesting for someone to ask the \"Where do you come from?\"-question if they've heard the same answer a hundred times: \"From Bristol\".&nbsp;<br><br>I think it's good idea not to move fast and break more things with this stuff. I've made that experience, and will likely make that experience a few times more. But trying small, collaborative experiments sounds good!</p>", "parentCommentId": "qajCpwG97dpPa4ZL6", "user": {"username": "Milena Canzler"}}, {"_id": "4gutH7ZK2YKLaaAAb", "postedAt": "2024-03-14T10:07:27.532Z", "postId": "PvzdP6T5KQDSXWiSm", "htmlBody": "<p>Good comment, and good point on how in general \"one bad apple can spoil the barrel\". I am really not sure how much that is at play, or if it is just lack of awareness. I hope the latter! In fact, in one of my examples I know it was the latter but it still leaves a bitter taste in my mouth.</p><blockquote><p>will it have that much of an impact</p></blockquote><p>You mean if <i>any</i> DEI initiative will have that much impact? Just a bit unsure what you are referring to with \"that\". Once clarified I will try to respond.&nbsp;</p>", "parentCommentId": "KnxkomwtDMQH72Gm7", "user": {"username": "Ulrik Horn"}}, {"_id": "8ea8bnfmnLHmf8wiy", "postedAt": "2024-03-14T17:25:43.187Z", "postId": "PvzdP6T5KQDSXWiSm", "htmlBody": "<p>I think that would be an interesting post, although I think the tractability part is going to be more difficult. The best idea I've come up with is some sort of salary supplement and/or financial backstop program for early-stage EAs from low/middle income backgrounds. That may mitigate the risk of losing excellent candidates who come to EA through the existing recruitment channels but lack the personal / family wealth to take risks that higher-income people in high-wealth countries can somewhat comfortably take. This seems moderately tractable to me.</p><p>Radically expanding the universe of people who people who might be invested enough in EA to apply for jobs or funding may be a much costlier and time-intensive task. To the extent EA is now funding-constrained, the \"carrying capacity\" of the EA ecosystem may be about the number of FTEs currently employed, except to the extent there are new EtG or other donors. So broadening the pool might allow for selection of more qualified people for existing FTEs, and might allow for somewhat more capacity by driving wages down, but I would expect it to have mostly incremental effects.</p><p>Although it's uncomfortable to say, many current approaches to talent recruitment also double to some extent as fundraising development. Although earning-to-give / entrepreneurship-to-give may have become less prominent in the years leading up to the FTX collapse, outreach at elite universities tends to reach more potential startup founders, Biglaw partners, and neurosurgeons who could contribute large sums than would outreach in LMIC countries or in more solidly middle-class institutions. So in a sense, outreach to the soon-to-be-rich may \"pay for itself\" in a sense.</p><p>If your target population is graduates of elite colleges, you can potentially support ~50% of them in direct work if the other 50% get high-paying jobs and donate a significant fraction of their income. That's perhaps an order of magnitude better than many social movements / recruitment strategies. E.g., even religious movements with relatively high commitment levels would have a hard time supporting more than 3-4% of supporters in direct / full-time ministry positions.</p>", "parentCommentId": "NxE3D3nMjv9YRiMJb", "user": {"username": "Jason"}}, {"_id": "4AF4famvokdTwNEyN", "postedAt": "2024-03-14T20:14:47.309Z", "postId": "PvzdP6T5KQDSXWiSm", "htmlBody": "<p>Definitely agree that ETG is very much underrated. I think if you are looking to maximize your impact, you should be looking at how you can bring something to the table in terms of skills/knowledge/insight/etc that money cannot buy or is very difficult/costly for money to buy. Something like this might be building of specialized research skills/knowledge, connections, influence, idea development/cultivation. I am a bit skeptical that generally working for a high impact org in positions with skills that are available in the general employment market is, in expectation, high impact. I may, however, be underestimating the importance of securing alignment in such roles with job. If I could not see the opportunity in my career to build something money cannot buy, I would probably look at earning to give.&nbsp;</p><p>I agree that <i>outreach</i> is well-directed to elite colleges. Students of these institutions are, all else being equal, more capable, better-connected, and generally have more resources to deploy to EA because they tend to come from wealthier backgrounds. I think these audience might not be the best target for <i>material support</i> because they may well have the resources to make choices with their lives that can better help the world. The most promising EAs <i>outside of the elite</i> are probably the best targets for material support because their impact is quite likely to be severely curtailed by their own economic/social circumstances. Rereading your third paragraph, I think we are largely in agreement.</p>", "parentCommentId": "8ea8bnfmnLHmf8wiy", "user": {"username": "Brad West"}}, {"_id": "Kjyg73FjFLeJbfKTi", "postedAt": "2024-03-14T20:29:07.856Z", "postId": "PvzdP6T5KQDSXWiSm", "htmlBody": "<p>I'm going to respond to the individual incidents you describe, because I think some interesting patterns will emergy here.</p>\n<blockquote>\n<pre><code>I brought my significant other (SO) to an EA party and another guest kept on commenting awkwardly and rudely on the height difference between my SO and I\n</code></pre>\n</blockquote>\n<p>That sounds mildly annoying. I'm sorry it happened. A reasonable response would be to move to a different group of people. An unreasonable overreaction would be to read it as indicating something sinister about EA, and describe it in a DEI discussion with the implication that this person engaged in some kind of terrible ism. Is Heightism even a thing?</p>\n<blockquote>\n<p>In another of my encounters with EA, another EA asked where a non-EA PoC (also present) was from. When the EA was told “Sweden” (which was true, birth, citizenship and fluency in Swedish) the EA pressed on wanting to know where the PoC was really from</p>\n</blockquote>\n<p>Again, this sounds annoying and I'm sorry it happened. I can imagine a curious person with low social skills (know any of those in EA?) thinking this was an interesting point to press on, but I can also understand why the PoC would be unhappy about this line of questioning, and I would not blame the PoC at all for disengaging and thinking less of the questioner. But I have trouble seeing it as indicative of a big dramatic problem of racism in EA.</p>\n<blockquote>\n<p>At the only EAG I attended, and to almost the first PoC I talked to there, I was told this EA PoC was during one of the first EA events they attended asked by another EA where they came from and this EA PoC subsequently had a very rough \"onboarding\" into EA in large parts due to this incident</p>\n</blockquote>\n<p>I'm getting this after 3 links in a game of telephone, so there is a lot of uncertainty about what happened here, but, um, asking someone where they are from seems like a normal way to try to get to know a new person. I'm not seeing the problem here. Is that a question we are only allowed to ask white people now?</p>\n<blockquote>\n<p>EAF posts on eugenics (e.g. posts like this by white people on eugenics in poor, non-white countries)</p>\n</blockquote>\n<p>Your link leads to a discussion of modern technologies very different from traditional eugenics, and the connections between genes and intelligence and what that implies for doing good, which seems like a reasonable topic to discuss in EA. And your suggestion that the author's race (and I'm not sure how you even know the author's race) is relevant seems pretty racist to me.</p>\n<blockquote>\n<p>Of course all the Bostrom emails, inappropriate sexual behavior and what not</p>\n</blockquote>\n<p>One bad email 25 years ago, before there even was EA, and for which he appologized, should be a non-story.</p>\n<p>In terms of your introductory story of your presumably non-white friend being threatened with a shotgun on a stranger's private property, you stopped right before the most important part. Did you in fact go ask this person for water as your friend suggested? If so, how did this person respond? Did they threaten you with the shotgun, or give you water, or what? Just from what you've said, the suggestion that race was a factor seems unwarranted. Lots of people, particularly the sort who live in the middle of nowhere, love their property and their guns and will point their guns at any strangers on their property regardless of race, and view it as their right to do so. I believe you and your friend were in a difficult situation and that your friend was reasonably very scared from the encounter, and I am sorry about that. But your friend's apparent belief that race was a factor is not evidence that race actually was a factor. You have presented no other evidence that race was a factor. And telling stories like this, without evidence, just perpetuates unjustified racial fears of exactly the kind your friend experienced.</p>\n<p>In terms of your own story of your experience sitting next to an arab man on a plane, I don't particularly blame you for having those thoughts, we all have irrational thoughts sometimes, though I hope some of your language (\"flod of adrenaline\", \"grips of panic\", etc) was an exageration for dramatic effect. I see that you noticed that you were having an emotional reaction, you took a step back and asked whether the objective facts justified your fear, you rightly concluded that they did not, and therefor you rightly chose to take no action. Congratulations, this is how a mature adult handles a random irrational thought and corresponding emotion. What baffles me is that you found this experience significant enough to remember and retell. You never quite articulate why, or what you think it says, but I take your retelling as implying that you see yourself as somehow racist for having the thought and the emotion, and to me that just does not follow at all. Nothing seems to have actually happened, so this should not be a big deal. Viewing it in the context of what else I know about you, which is thatt you see basically all social interactions in terms of the races of the people involved, that you see your own whiteness as important to how you interact in the world, I have to wonder if you would have had a strong reaction here if you stopped looking at the world in terms of race, if you stopped thinking of your whiteness as important. I suspect it is your own habbit of thinking about race that made race so salient to you in that moment.</p>\n<p>So after going through 7 stories that you present, the only clear racism that I can find is in your description of another writer here on the forum. What I see is a lot of things that are either everyday annoyances of someone being a jerk, or not actually connected with race in any apparent way, or both. It seems that you have chosen to view these events through a DEI lens and place a sinister interpretation on them, when there was no need to do so. And this is at least consistent with the DEI trainings that I have seen in a corporate setting. Those trainings were composed primarily of stories of someone being a jerk to a person who happened to be a woman or a PoC, and then telling us that what we saw was sexism or racism. And that is actually a terrible way to interpret the world! People are actually jerks to each other in minor ways all the time! With people of every race and every gender on every side of that jerkiness! And in most cases, it is both more accurate and more useful to interpret it as a random jerk, and not as being related to race or sex.</p>\n<p>The other thing that baffles me is your claim that in other environments you inhabit, your job and non-EA social circles, you don't see these things. Has nobody every been annoyed by anybody else being insensitive at your job or in your other social circles? If so, that is absolutely amazing and we should send in a team of social scientists to try to discover what is going on and see if we can replicate it. What I suspect is actually happening is that you haven't been given a narrative, an expectation, that people will be racist or sexist in those environments, and so when you do see someone  being a jerk, you correctly interpret it as just someone being a jerk, you do not interpret it through a DEI lense. By contrast, you have been hearing stories of terrible racism and sexism in EA for years, and so when you see someone being a jerk in an EA space, you do interpret it through a DEI lense. I think the difference you see between the different spaces you inhabit is a difference in what lenses you choose to interpret what you see though, and not a difference in the world. I suggest you consider making different choices about lenses.</p>\n", "parentCommentId": null, "user": {"username": "TJ"}}, {"_id": "GtyisKERHfDTp8Nsk", "postedAt": "2024-03-14T21:55:21.666Z", "postId": "PvzdP6T5KQDSXWiSm", "htmlBody": "<p>CE/AIM just launched something like a founding-to-give incubation program, will be interesting to see how that goes, who their participants end up being etc</p>", "parentCommentId": "4AF4famvokdTwNEyN", "user": {"username": "bec_hawk"}}, {"_id": "54RJmk9RyFLmBWJxt", "postedAt": "2024-03-15T18:35:18.592Z", "postId": "PvzdP6T5KQDSXWiSm", "htmlBody": "<p>You call \"whiteness in EA\" an \"issue.\" You say that being asked to get to the EA part of your point \"by men and white folks is widespread in EA. And it makes [your] blood boil.\" You consider my post on the EA forum to be a bad experience, saying you are disappointed in \"posts like&nbsp;<a href=\"https://forum.effectivealtruism.org/users/ives-parr?from=post_header\"><u>this&nbsp;</u></a>by white people on eugenics in poor, non-white countries.\"&nbsp;</p><p>The entire purpose of my post was to provide a plan to uplift the poor of the world, something every EA advocates for. I did so in a respectful manner, and I did not attack any race or say anything hateful whatsoever. Did you read it? I tried to argue my case in an extremely non-inflammatory manner citing a huge number of studies. Now it's at -26 karma. You criticize me explicitly for my race. You make it a salient aspect of my argument when it is not relevant whatsoever and I'm being penalized for it. You also just assumed I'm white. Based on what? My picture? My name? Would you find me more reasonable or moral if I was a different race? If not, then why does it matter. If so, then how is this not racist/biased?</p><p>You on the other hand are especially <s>disgusted</s> bothered by things that white people do by your own admission. You are especially concerned when white folks do something or post something. Also, you consider whiteness a problem.&nbsp;</p><p>This is a disappointing trend in EA that will drive out interesting thinking. Do you want more data analysis or anecdotes and appeals to emotion? Do we want to be trying to find the most effective ways to maximize human welfare (for all races) or do we want to be engaging in identity politics where non-white opinions and welfare are less important?</p>", "parentCommentId": null, "user": {"username": "Parrhesia"}}, {"_id": "8w9K7pc7NhZpHsGtu", "postedAt": "2024-03-16T05:37:20.930Z", "postId": "PvzdP6T5KQDSXWiSm", "htmlBody": "<p>I appreciate your comment, you are right. I should have dropped the \"white\" word in the example of your post. I think you are correct, it does not matter, I would have been upset regardless. And I do apologize if you are not in fact white - like I said I make mistakes on a daily basis. I know this is perhaps a cop-out but... I seek draft amnesty? Still, I feel worse if such posts are made by white people. Like I said I am explaining how I feel, and this cannot be argued about. I made this post due to popular demand and I meant it mostly so that people interested in why some people disengage, or perhaps never engage, with EA knows at least one mechanism through which alienation from EA works.<br><br>That said, your post contributes quite a lot to me feeling embarrassed to be an EA, and of my feeling of not being at home here. I think more so because it is tolerated and implicitly endorsed by CEA by virtue of not being removed or something like that.&nbsp;<br><br>And some of the language in your comment is unnecessarily inflammatory, like the use of \"identity politics\" as if there is some sort of politics that does not pertain to people's identity. White, het cis or abelist politics is still identity politics. And the upvotes on your comment does not help either.&nbsp;<br><br>Note that I am only engaging with your comment in terms of how I feel, that is all I am interested in talking about here. The sole goal of my post was to let people know the mechanism by which someone <i>could</i> get alienated from the EA movement. I (and I think others too) thought this was important to get out there as I felt, and I think people who wanted me to write this post felt that too, that we might not understand well what drives PoC, or even white people away from the movement. I am sure there are many other ways people can feel alienated too, so this is just an anecdote but I hope it is helpful for those that might want to increase diversity and grow the movement. In my case it is one of the strongest aversions I have to EA.</p>", "parentCommentId": "54RJmk9RyFLmBWJxt", "user": {"username": "Ulrik Horn"}}, {"_id": "dn3zssjT6Scw6EXEi", "postedAt": "2024-03-17T05:13:55.361Z", "postId": "PvzdP6T5KQDSXWiSm", "htmlBody": "<p>I think it’s reasonable to focus on expressing an experienced sentiment, but I think it’s also fair for people to push back on the sentiment. There are after all people who have felt alienated from and pushed out of EA as a result of the active shaping of forum content to be more agreeable.</p>\n<blockquote>\n<p>implicitly endorsed by CEA by virtue of not being removed or something like that</p>\n</blockquote>\n<p>I think it would be quite bad if forum mods began to remove posts on the basis that something existing on the forum constitutes an endorsement by CEA. I’m not even sure it’s a coherent implication - there are many topics on which posts have been written that disagree with each other, including where someone says a stance is actively harmful. Which position should CEA be taken to endorse?</p>\n<blockquote>\n<p>the use of \"identity politics\" as if there is some sort of politics that does not pertain to people's identity</p>\n</blockquote>\n<p>This seems straightforwardly false. Maybe you have are using a very specific definition of politics, but surely many areas cut across most identity categories? For instance it seems quite coherent to possess a stance on climate, and coordinate a movement around it, in a way that is agnostic to identity.</p>\n<blockquote>\n<p>White, het cis or abelist politics is still identity politics</p>\n</blockquote>\n<p>I’m not sure what this means, could you give an example of an area of white, het cis or abelist politics?</p>\n", "parentCommentId": "8w9K7pc7NhZpHsGtu", "user": {"username": "bec_hawk"}}, {"_id": "4cFoaNJXMAXnTkFD8", "postedAt": "2024-03-17T06:48:18.595Z", "postId": "PvzdP6T5KQDSXWiSm", "htmlBody": "<p>Hi Rebecca and thanks for taking the time to patiently engage with this topic - I think that is important.<br><br>I agree 100% that people should push back if they feel like it. And I absolutely see the perspective of those that feel like they have to censor themselves in EA settings and that this also causes alienation. I kind of feel EA has 3 choices here:</p><ol><li>Continue trying to find a middle ground, alienating people on \"both sides\", leadership/prominent figures awkwardly silent on the topics</li><li>Embrace the \"all discussion is good\" and do little in the way of DEI, alienating people who feels discomfort from certain topics like eugenics</li><li>Go all in on \"Deloitte NYC\" and strongly discourage certain discussions, do lots of DEI interventions, have leadership speak loudly about DEI</li></ol><p>I am, as is probably obvious from now, pushing hard for option number 3 and also think this is more likely to lead to us achieving our goals. I kind of feel like the frist, currently pursued option is the worst - there is a reason few organizations/companies do this. Take Nike, X, Deloitte etc. they all have taken a strong stance.<br><br>I apologize for going part way down the rabbit hole of identity politics. I only meant to say how I <i>feel</i> about the term, to emphasize the points made in the OP. I respectfully decline to go further down that rabbit hole. And I know this can come off as a bit arrogant but I am sure others have written on this topic.&nbsp;</p>", "parentCommentId": "dn3zssjT6Scw6EXEi", "user": {"username": "Ulrik Horn"}}, {"_id": "n4ibcdTTtBCdu6va8", "postedAt": "2024-03-19T08:00:49.709Z", "postId": "PvzdP6T5KQDSXWiSm", "htmlBody": "<p>Thanks for spending time to respond. Currently I will respectfully decline to engage further and I think I can sum it up briefly:</p><p>You offer alternative framings but unfortunately it does not sway how I feel. Not sure I can control my emotions although I wish I sometimes could. And there is the more complicated issue that people close to me also get hurt by EAs - I definitely think it would be a long shot to make <i>them </i>see EA differently. In fact, and unfortunately I think what I feel to be a slightly infantilizing vibe in your reply just make me feel more awkward about associating with EA.</p><p>If others think the commenter here makes valid points, I commit to answering if the posts gets 10 positive Karma (no matter if it is offset by negative votes). Just want to be careful where I spend my time for the most impact.</p>", "parentCommentId": "Kjyg73FjFLeJbfKTi", "user": {"username": "Ulrik Horn"}}, {"_id": "mYKnf4nFsJ5AnD7BD", "postedAt": "2024-03-20T09:41:30.976Z", "postId": "PvzdP6T5KQDSXWiSm", "htmlBody": "<p>I will answer as briefly as I can so please double click on anything you would like me to respond to in more detail. And I think the value of me responding here is to let others know better how I feel and the mechanisms at work in making me feel alienated from EA.</p><blockquote><p>Is Heightism even a thing?</p></blockquote><p>2 responses:</p><ol><li>One can assume that a person of shorter stature has heard comments on their height many times before. And I think few such people find it flattering. I am interested here in describing my emotions and how EA differs from other spaces I am used to navigate, thus leading to my feeling of not belonging.</li><li>Height does correlate with race, so in that sense, it can cause emotional \"spillover\" or something like that.</li></ol><blockquote><p>Did you in fact go ask this person for water as your friend suggested? If so, how did this person respond? Did they threaten you with the shotgun, or give you water, or what?</p></blockquote><p>Yes I went, as I judged that my friend was likely to be correct and I did not want to sleep in the bush (we did not have money to be towed). Nope, it went just fine when I went there. In fact, they were super friendly. Again, I do not trust my memory here 100% but if this is a crux for people in understanding my general feeling of being alienated from EA (which I do not suspect) I can see if I can confirm the story with my friends. And on the larger point about whether such fears are justified - I do not think that matters much for actions EAs can take. This is because we have 2 choices:</p><ol><li>Work to convince all potential POC/women candidates for EA that their concerns about racism/sexism/etc. are unjustified. After we have convinced them they are not, they will naturally help increase diversity in EA.</li><li>Assume that their feelings are true and tell them this, maybe even believing it ourselves. Then act accordingly to make them feel at home in EA.</li></ol><p>I have never seen option 1 successfully implemented, I think for obvious reasons. The reason to not go with either option would be because one does not think we need more diversity. That said, having too much complaints about diversity likely works against any work to increase diversity, see my other comment here on 3 options for EA \"leadership\".</p><p>On the \"airplane incident\": You might be right. But I both think \"whiteness is true\" and am embedded in a social circle that is super diverse. So if I have to choose between stopping to see the world through a racial/gender/LGBTQ+/etc. lens or stop being an EA, I will always, always chose the latter. Seeing the world through such a lens, or seeing it as much as I can from the vantage point of the people I love, is critical to my closeness to them. I really like who I am and the people I love. I would like to be an EA too, but that comes second.</p><p>Your second last paragraph: I think I answered this already. If I were to do this, which I also think is a less true view of the world, I would not be close to my loved ones, potentially even losing them. Not an option. And I do apologize for the unpolished/offensive nature of the post - I think I could have re-worded it much better but was encouraged to publish it unpolished. I really do not want people to feel like I am ascribing agendas to people - that was the whole point of the airplane incident - I know one can be totally \"woke\" and still have feelings that can result in behavior that other perceive to be racist/sexist etc. And I am largely uninterested in people's intentions. The sole point of this post was to give an anecdote/some more detail on why a person might feel alienated in EA - the idea was that this might be helpful for EAs to take action and to bridge understanding. But it is a minefield because we so quickly start playing \"the victim\" instead of engaging in solving the issue. And my wording and tone might have contributed to this victim competition and that is not my intention. I would rather like to see EA being the victim if I left - I am very happy with my non-EA life. I guess if it is down to wording, tone and so on in my post I just cowardly seek draft amnesty!<br><br>Actually there were some instances of jerkiness/conflict at that workplace too. Actually someone there did comment on someone's height difference. And another incident I remember is one where someone was allergic to perfume and someone wore thick perfume in the office. So not utopia but the feeling I got was in general one of belonging <i>a lot</i> more. And I think other EAs who feel alienated in the same way I do also have been in other spaces where they felt much more at home. And I am sure this is studied well - there is a large body of research and lots of work on implementing best practices in DEI. But this is easy to find by asking GPT/Googling.<br><br>Just let me know if I missed anything. Just keep in mind that I am really not interested in talking about politics. This for me is deeply personal and I only mean to describe why I care and I think attempts at convincing me, or the people close to me to feel differently is just likely to increase the feeling of not belonging. The best first step if one is trying to convince someone of something after they are hurt, is to acknowledge their feelings, maybe with a scout mindset. Of course you could play that ball back to me, saying it is my who do not understand and we can play ball like that and that is likely why maybe the best option is just for \"leadership\" to take a stance so that at least <i>someone</i> feel like they belong. But I do not want to advocate too hard for this - I am largely a lay person in these matters. And I would ideally like women/POC EAs to guide any actions I take and to let me know what I should endorse or not.</p>", "parentCommentId": "Kjyg73FjFLeJbfKTi", "user": {"username": "Ulrik Horn"}}, {"_id": "FKeXQMWewEu3ezPgS", "postedAt": "2024-03-23T19:41:09.382Z", "postId": "PvzdP6T5KQDSXWiSm", "htmlBody": "<p>(I am the same TJ that wrote the original comment. I wasn't able to log back into the original account so I created a new one.)</p>\n<p>I'm not sure what you mean when you say \"whiteness is true\". I feel like you just told me \"happiness is true\". It just doesn't parse. Happiness and whiteness are adjectives, they don't have truth values on their own. If you tell me that a particular person is happy or white, then it becomes a claim about the world that is true or false.</p>\n<p>That said, we probably do have some kind of genuine disagreement about how common racism/sexism is in EA or the world or something, and that is maybe cruxy? But you don't seem to want to talk about that. You seem to want to talk only about your feelings, and that comes off as very not helpful. EA isn't about making EAs feel good. Traditional approaches to charity before EA were about making donors feel good. EA's big innovation was to focus on the effects on non-EA beneficiaries, not the feelings of its own members.</p>\n<p>You seem to think there is a trilema where we either (1) want more diversity, and try to convince minorities that we are not racist/sexist, (2) want more diversity, and try to convince minorities that we are working to fix our racism/sexism, or (3) want fewer minorities. You further seem to think that 1 vs 2 should be evaluated as a choice based on what will actually cause more diversity. I think this is incorrect. How much racism/sexism there is in EA is a factual question, and nobody chooses their beliefs about factual questions. As I said, I think we may genuinely disagree about this one. But a person who believes there is not much racism/sexism yet chooses option 2 is being dishonest, they are trying to deceive minorities, and that does not seem like a good way to treat anyone. Similarly for a person who believes there is a lot of racism/sexism and chooses option 1. So if it is down to 1 vs 2, then that must be evaluated based on what is actually true about EA, not based on what we expect the effects to be.</p>\n<p>As for 3, I don't think anyone actively wants fewer minorities or women in EA. I have never once heard anyone say \"there are too many PoCs in EA\" or \"there are too many women in EA\" or anything remotely like that. That is just not part of the discourse. Nobody is complaining about diversity. Instead, I think what you are mistaking for that, is an option 4, which is to not concern ourselves too much with the racial or gender makeup of EA, and instead concern ourselves with the actual purpose of EA, to do the most good with the hours and dollars that we set aside for charity, and to work with the people who can best help us do that, whatever their races or genders, and whatever racial or gender makeup comes about as a result. In my view, this option 4 is obviously the correct course. Human history is littered with examples of people overly concerned with the races and sexes of those around them, pretty much always with unpleasant results. We should learn from that history and not repeat it.</p>\n<p>I'm certainly not trying to separate you from your loved ones. EA isn't a cult. Loving someone doesn't always mean indulging their feelings or agreeing with their beliefs or trying to fix what they think is a problem. Sometimes it does, but not always. Loving someone means making a point of interacting with them in a way that makes them stronger. What makes them stronger may be highy personal and highly context dependent. But acting with the purpose of making someone else stronger is the essence of love. If a person incorrectly believes that they are being mistreated on account of their race or sex, then indulging that belief will generally make them weaker. That kind of belief both feels unpleasant and creates a self-fulfilling narative where the person has less control and agency. That is costly! And it is a much more costly error than incorrectly believing that they are not being mistreated on account of their race or sex, so where there is ambiguity, it is best to assume we are not being mistreated on account of race or sex.</p>\n<p>You seem to believe that all of your PoC/women friends feel unwelcome in EA because of their race or sex, feel that they are discriminated against or something. I don't know your friends, so I don't know if this is true of them or not. I do remember a time in my life when I assumed that all my women and racial minority friends saw the world and their social interactions in terms of race and sex, and I was wrong about that. There are lots of minorities out there who don't feel like the world is against them because of their minority status, who just try to get on with whatever it is they do with their lives, and they are generally better off for it.</p>\n", "parentCommentId": "mYKnf4nFsJ5AnD7BD", "user": {"username": "TJ2"}}, {"_id": "ow2EDvdTwzmGMgg4k", "postedAt": "2024-03-25T17:29:55.958Z", "postId": "PvzdP6T5KQDSXWiSm", "htmlBody": "<p>I was wondering if our continued conversation would be better as a new post using the conversation format if that's still in use? That said,I only want to do that if people find it helpful - I got pretty down voted including by people of the marginalized groups that I feel \"bad because of\".</p>\n", "parentCommentId": "FKeXQMWewEu3ezPgS", "user": {"username": "Ulrik Horn"}}]