[{"_id": "ybcPFf7K2kxkbkBbR", "postedAt": "2023-05-24T21:30:36.298Z", "postId": "PwdjcsoeuH9E9hB8g", "htmlBody": "<p>Excited and grateful for your work!!!!</p>", "parentCommentId": null, "user": {"username": "alene"}}, {"_id": "D8jjZb9ua5BibP3TN", "postedAt": "2023-05-26T13:54:21.383Z", "postId": "PwdjcsoeuH9E9hB8g", "htmlBody": "<p>Massive applause for kickstarting Allied Scholars for Animals! You're making waves in an area that, honestly, has been overlooked for quite some time.</p><p>In my college years, student groups and support for college activists were everywhere! I was so supported and motivated by THL's involvement in my college club and <a href=\"https://www.nj.com/news/2013/08/rutgers_university_makes_switch_to_cage-free_eggs_after_three-year_student_campaign.html\">cage-free egg campaign</a>. Over the years, it feels like we've strayed from that path. (THL discontinued their campus outreach program in 2020).</p><p>Universities are crammed full of motivated, bright minds ready to make a change, so it's a missed opportunity not to tap into that resource. It's refreshing to see you recognizing this and taking charge to mobilize these potential change-makers.</p><p>Thanks for stepping up and best of luck with this endeavor. I'm sure we're going to see some incredible work coming from this initiative!</p>", "parentCommentId": null, "user": {"username": "Constance Li"}}, {"_id": "v3iTEgdXGsxowEGut", "postedAt": "2023-05-28T08:31:56.345Z", "postId": "PwdjcsoeuH9E9hB8g", "htmlBody": "<p>Thanks Alene! I'm honored that you're a part of our team!&nbsp;</p>", "parentCommentId": "ybcPFf7K2kxkbkBbR", "user": {"username": "Dr Faraz Harsini"}}, {"_id": "MSPPhzMbkj3A77h2H", "postedAt": "2023-05-28T08:37:20.481Z", "postId": "PwdjcsoeuH9E9hB8g", "htmlBody": "<p>Thank you very much Constance! I was a PETA camp rep and I had my friend to apply for THL student rep program. But even those programs where not focused on building a sustainable community and were mostly focused on training individuals or supporting certain campaigns!&nbsp;<br><br>We want to not only support individuals, but also build a sustainable community and infrastructure! This current trend, where student orgs come and go every 2-3 years, and each student org is doing a different thing, is not effective and doesn't work, yet as you mentioned, there's tremendous potential in universities. People whom if we invest on, can change the system!&nbsp;<br><br>Thanks again for the kind words!&nbsp;</p>", "parentCommentId": "D8jjZb9ua5BibP3TN", "user": {"username": "Dr Faraz Harsini"}}, {"_id": "xk6rdfSpGGpnJwsar", "postedAt": "2023-05-31T22:28:14.199Z", "postId": "PwdjcsoeuH9E9hB8g", "htmlBody": "<p>Cool initiative!&nbsp;<br>In the Netherlands, there is an umbrella organization for vegan student associations: <a href=\"https://www.vsanetherlands.nl/\">https://www.vsanetherlands.nl/</a> Perhaps, it could be interesting to exchange experience?</p>", "parentCommentId": null, "user": {"username": "Felix_Werdermann"}}, {"_id": "pLGsbpLAvfcWvuJBe", "postedAt": "2023-06-01T23:06:49.173Z", "postId": "PwdjcsoeuH9E9hB8g", "htmlBody": "<p>Thanks for mentioning this! Looks like a great organization with a very similar mission to ours. Will keep them in mind and potentially reach out.</p>", "parentCommentId": "xk6rdfSpGGpnJwsar", "user": {"username": "Benny Smith"}}]