[{"_id": "9DTkvH9beCEeqEXLz", "postedAt": "2023-11-16T10:31:20.081Z", "postId": "PwnRriopRSptjNvw5", "htmlBody": "<p>Thanks for sharing this! I would love to see similar transparency on pay decisions from other orgs, even if they don't have such a formalised system.</p>", "parentCommentId": null, "user": {"username": "Stan Pinsent"}}, {"_id": "cskE8vwvEpfG8Rx2n", "postedAt": "2023-11-16T13:53:37.401Z", "postId": "PwnRriopRSptjNvw5", "htmlBody": "<p><strong>Executive summary</strong>: Giving What We Can's approach to staff pay and benefits aims to balance fairness, cost-effectiveness, talent attraction and retention, and alignment with their mission.</p><p><strong>Key points</strong>:</p><ol><li>GWWC aims for salaries that enable comfortable tithing while avoiding undue sacrifice or being overly motivated by pay.</li><li>Their pay calculator uses salary bands pegged to local averages, with adjustments for experience and skills that are highly valued.</li><li>Benefits aim to be balanced across locations.</li><li>Offer letters share salary calculations and get agreement on assumptions.</li><li>GWWC welcomes feedback to improve their approach to fair and effective compensation.</li></ol><p>&nbsp;</p><p><i>This comment was auto-generated by the EA Forum Team. Feel free to point out issues with this summary by replying to the comment, and</i><a href=\"https://forum.effectivealtruism.org/contact\"><i>&nbsp;<u>contact us</u></i></a><i> if you have feedback.</i></p>", "parentCommentId": null, "user": {"username": "SummaryBot"}}, {"_id": "4Jwe8ptKkKWWpKbCj", "postedAt": "2023-11-16T15:53:13.490Z", "postId": "PwnRriopRSptjNvw5", "htmlBody": "<blockquote><p>Depending on the person's location, we adjust 50% of the base salary by relative cost-of-living as a starting point, and make ~annual adjustments to account for factors like inflation and location-based cost-of-living changes.</p></blockquote><p>I've seen this elsewhere and I'm not convinced. It subsidizes people living to areas with higher cost of living, which doesn't seem like an unalloyed good. Theoretically, it seems like it would be more parsimonious to give people a salary and let people spend it as they choose, which could include luxury goods like rent in expensive places but wouldn't be limited to it.</p>", "parentCommentId": null, "user": {"username": "NunoSempere"}}, {"_id": "B4zE2LZTE9YkNSjDf", "postedAt": "2023-11-16T17:34:00.656Z", "postId": "PwnRriopRSptjNvw5", "htmlBody": "<p>This seems like it might be a good price discrimination strategy though I'm not sure if that's the intent.</p>\n", "parentCommentId": "4Jwe8ptKkKWWpKbCj", "user": {"username": "Ryan Greenblatt"}}, {"_id": "iNEvAoyDmNxjmArvC", "postedAt": "2023-11-16T17:34:19.940Z", "postId": "PwnRriopRSptjNvw5", "htmlBody": "<p>I'd tend to agree with that if potential employees came with no / limited location history. For instance, I would be more open to this system for hiring new graduates than for hiring mid-career professionals.&nbsp;</p><p>While the availability of true 100% remote, location-flexible jobs has blossomed in the last few years, those jobs still are very much in the minority and were particularly non-existent for those of us who started our careers 10-15 years ago. We acted in reliance on the then-dominant nature of work, in which more desirable careers with greater salaries were available in major cities than in rural Kansas. As a result of that reliance, we created financial and non-financial ties that would be costly to break. We might have -- for instance -- bought a condo (which would take 10% of its value to sell), married someone whose career is dependent on being in a one of a few high-COL cities, and raised children who do not want to leave their friends and schools.&nbsp;</p><p>These realities do not reflect a \"luxury good[] like rent in expensive places\"; they reflect the consequences of living life after making a sensible location decision under the then-prevailing circumstances. Avoiding the transaction costs of having to sell a condo, having one's spouse continue in their established field successfully, and having stability for one's kids are not forms of consumption that people in major cities somehow get while people who live in lower-COL places do not.&nbsp;</p><p>On the other hand, you're right in that there is a consumption effect of chosing to live in a higher-COL city; I would enjoy being in (say) Dallas more than I would enjoy being in Peoria. So if the point is to equalize consumption, the right adjustment percentage is going to be less than 100%.</p><p>I think adjusting 50% (rather than 0% or 100%) of the salary for COL for most hires may be close to the least wrong approach here. The best individualized approach will depend on the individual's prior life circumstances, but 50% is at least not more than 50% off from the best approach in any individual case.</p>", "parentCommentId": "4Jwe8ptKkKWWpKbCj", "user": {"username": "Jason"}}, {"_id": "jeDxyhaGxd6772QLC", "postedAt": "2023-11-16T17:59:30.553Z", "postId": "PwnRriopRSptjNvw5", "htmlBody": "<p>Thanks for the transparency! I noticed two issues, which may be edge cases or non-issues for GWWC, but could be relevant elsewhere:</p><p>(1) One of my bright-line rules for nonprofit compensation is that an employee should not earn <strong>more </strong>compensation than the private sector would award for comparable work. In my view as a donor, breaking this rule makes the employee a beneficiary of the charity, which is both inconsistent with donor intent and risks the usual problems when a charity is run partially in the interests of its employees. The lowest pay band is close to the average salary in Oxford even at zero experience,<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefia9vue7okwm\"><sup><a href=\"#fnia9vue7okwm\">[1]</a></sup></span>&nbsp;the average worker in Oxford might be more educated than the UK average, and at least the US benefit package looks fairly generous for median-wage work. That means that, for my proposed bright-line test to be satisfied, the lowest-paid GWWC employee needs to be performing work that the market would compensate at least at the median pay/benefits level in Oxford. That may well be the case at GWWC, but I submit that making sure the formula doesn't produce above-market compensation with any inputs might be a worthwhile bounds-checking exercise.</p><p>(2) I'd consider a further case-by-case adjustment for graduate-school debt where the employee incurred debt for a graduate degree that is substantially related to their duties.&nbsp;<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefz82nf6qbv9\"><sup><a href=\"#fnz82nf6qbv9\">[2]</a></sup></span>From a US perspective where debt can be catastrophic, the competitive skills bonus doesn't really address this. GWWC probably isn't hiring (e.g.) lawyers or physicians to practice their professions, so this is probably not needed at present. That really would be case-by-case, as some people get help from public-interest programs at their law schools, and others would get significant help from government programs.<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefvvs98jr6i8r\"><sup><a href=\"#fnvvs98jr6i8r\">[3]</a></sup></span>&nbsp;But it might be worth a sentence in the plan so that, in the event such an adjustment needed to be made, it wouldn't look arbitrary.</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnia9vue7okwm\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefia9vue7okwm\">^</a></strong></sup></span><div class=\"footnote-content\"><p>I'm confused insofar as the text says that the median is used to define pay grade 2B, but the spreadsheet identifies a median salary in Oxford of £34K, while band 1 is listed at £33,598 and band 2 ranges from £36,958 to £40,654. (Maybe these actual salaries instead of defining the bands?)</p></div></li><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnz82nf6qbv9\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefz82nf6qbv9\">^</a></strong></sup></span><div class=\"footnote-content\"><p>I am assuming that the bulk of employees have undergraduate degrees, and so the cost of undergraduate education is baked in to the standard salaries in a sense.</p></div></li><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnvvs98jr6i8r\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefvvs98jr6i8r\">^</a></strong></sup></span><div class=\"footnote-content\"><p>My recollection is that having a higher-earning spouse can spoil both of these sources of assistance, but things may have changed since the mid-2000s when I graduated from law school.</p></div></li></ol>", "parentCommentId": null, "user": {"username": "Jason"}}, {"_id": "r6HrfEzgiyTRaee6r", "postedAt": "2023-11-16T20:07:33.348Z", "postId": "PwnRriopRSptjNvw5", "htmlBody": "<p>Can you say more about why it’s bad for employees to benefit from the charity? Does this philosophy apply to other procurement, or only labor?</p>\n<p>As a donor myself, I care about results and I’m completely fine with a charity paying obscene bonuses if that’s what it takes to get results.</p>\n<p>As Dan Pallotta noted in his TED talk, I think there’s a weird double standard in social recognition for charity work, where the person giving 10% of their income gets more accolades than someone making a 20% pay cut to do charitable work, if the resulting pay is still considered “high” by nonprofit sector standards.</p>\n", "parentCommentId": "jeDxyhaGxd6772QLC", "user": {"username": "Ian Turner"}}, {"_id": "vGDp2GyuXSPc7epHL", "postedAt": "2023-11-17T09:51:31.251Z", "postId": "PwnRriopRSptjNvw5", "htmlBody": "<blockquote><p>...if the point is to equalize consumption</p></blockquote><p>There isn't any one point, I'm rather pointing out that if you make these adjustments, you create a bunch of incentives:</p><ul><li>Working at EA organizations which offer cost of living adjustments becomes more attractive to people who need them, and less attractive to nomads or internationals</li><li>It perpetuates the impetus behind living in extremely high cost of living places, rather than coordinating the community to, gradually, move somewhere cheaper</li><li>I in fact don't think that equalizing consumption is a good move, given that consumption has different costs in different places.</li><li>By taking into account previous history considerations, you are incentivizing people to create those considerations so that they will be taken into account in the future.&nbsp;</li><li>(not that I know that the OP is doing this, but) If you decide on who to hire by: 1) finding the best candidate, and then 2) offering them a location-adjusted package, you are a) leaving money on the table by not considering whether there is someone almost as good who works somewhere cheaper, and b) reducing the bargaining power of internationals for ~no reason.</li></ul><p>Edit: removed paragraph.</p>", "parentCommentId": "iNEvAoyDmNxjmArvC", "user": {"username": "NunoSempere"}}, {"_id": "jRSw2bEAQ9o7j6ToR", "postedAt": "2023-11-17T10:17:17.374Z", "postId": "PwnRriopRSptjNvw5", "htmlBody": "<p>EA tries taking rational though and ethics as the ideological basis for a community. Mankind need this, ASAP. On the other hand, details are messy, and from this idea you can end up devoting your life to the welfare of Shrimp.</p><p>The movement will split, stabilize and go from platonism to aristotelism. Meanwhile, it is important to be informed, promote good ideas and don't put too much skin in the game.</p>", "parentCommentId": "vGDp2GyuXSPc7epHL", "user": {"username": "Arturo Macias"}}, {"_id": "aJcjfLij2HATLYr2C", "postedAt": "2023-11-17T15:33:56.864Z", "postId": "PwnRriopRSptjNvw5", "htmlBody": "<p>I don't think what I said was inconsistent with Pallotta's insight. I think what I actually proposed was rather narrow, and I'm having a difficult time applying most of your questions to it.</p><p>On procurement, same standard as for employees: If market rate for widgets is $20, it's not effective (or even generally appropriate) for a charity to pay $25 for widgets. Paying $20 is consistent with my bright-line rule. One would not speak of the widget-seller who sells to a charity at market rate as a <i>beneficiary</i> of the charity; nor would an employee who makes no more than market rate be such.</p><p>In contrast, there are organizations that employ individuals (e.g., individuals with disabilities) at more than the market rate for their services for the purpose of benefitting those individuals. Those employees are properly considered beneficiaries of the program. If you're running a vocational rehabilitation charity, that's fine -- because the very purpose of your charity is to benefit your employees. But that model is not appropriate for most charities. While vendors and employees may <i>incidentally</i> benefit from the charity (by receiving fair compensation for their wares and labors), they should be giving something of at least equal value (their wares and labors) as determined by the market.</p><p>What I said would be perfectly consistent with someone taking a 20% pay cut from market rate to do charitable work, or even that person being paid full market rate. I would generally oppose someone being paid <strong>more </strong>than market rate to do the same work. And that can be a problem with lower grades in standardized pay scales, especially those in which compensation for the top grades is only 2-3 times higher than that for the lowest grades. Looking at the payroll of many government organizations reveals this potential issue with those kinds of pay algorithms.</p><p>If the market is paying \"obscene bonuses,\" then the charity paying similar bonuses to similarly-situated employees with similar levels of performance is acting consistently with a cap of market-rate compensation.<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefs6907o3mv4j\"><sup><a href=\"#fns6907o3mv4j\">[1]</a></sup></span></p><p>I do think that too many nonprofits -- not speaking of EA, just in general -- are run too much in the interests of employees and not enough in the interests of the claimed beneficiaries. To pick two examples from different sides of the social spectrum, I specifically think this about many churches and universities. In contrast, in a medium+ sized for-profit, executives usually have strong financial incentivizes to not authorize salaries that do not further the corporation's profit objectives. In smaller ones, the owner usually is involved enough that the principal-agent problem is mitigated.&nbsp;</p><p>There isn't any similar mechanism available for most non-profits. Boards, donors, and other potential checks often aren't that effective. Thus, I think a norm that non-profits shouldn't pay more for the same work than for-profits would pay for that work makes sense. Given generally prevailing patterns of non-profit compensation, that boundary check will rarely be an issue . . . but I think it is an important check to have in place.</p><p>&nbsp;</p><p>&nbsp;</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fns6907o3mv4j\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefs6907o3mv4j\">^</a></strong></sup></span><div class=\"footnote-content\"><p>Moreover, this is neither the rationale that GWWC gave for its pay scale nor one that would make much sense for a grade-based pay scale such as the one under discussion. If a charity is handing out \"obscene\" salaries and bonuses, it should be done on employee-specific evaluative criteria linked to the employee's specific contribution to meeting business objectives, not to an algorithm.</p></div></li></ol>", "parentCommentId": "r6HrfEzgiyTRaee6r", "user": {"username": "Jason"}}, {"_id": "7iEYmqDA65GP2D6Ns", "postedAt": "2023-11-17T16:06:51.462Z", "postId": "PwnRriopRSptjNvw5", "htmlBody": "<p>I think many of those points have force, which is part of why I generally favor only partial COL adjustment. I tentatively agree with you that orgs should generally consider the actual cost of employing each individual when making a hiring decision, such that the candidate in a lower-COL location will usually have an advantage.<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefusyua61v0i\"><sup><a href=\"#fnusyua61v0i\">[1]</a></sup></span></p><blockquote><p>Working at EA organizations which offer cost of living adjustments becomes more attractive to people who need them, and less attractive to nomads or internationals</p></blockquote><p>The implied model is my head is that the prospective employee will accept a certain amount of sacrifice, but not more than that. A fully unadjusted salary expects candidates with sticky ties to a higher-COL location to sacrifice more, either by breaking those ties or by accepting a much deeper drop in standard of living / consumption than candidates in other locations. It will lead to many of those candidates opting out.</p><p>Given the current distribution of EAs, unadjusted salaries would take many candidates off the table, and in many cases that would be pretty problematic. I'm thinking of an analogy to non-EA nonprofit salaries. As people have pointed out elsewhere, often these are set at a level where only those who rely on a wealthier partner or parent to provide the financial support are able to stay in those positions long-term. That's a shrewd strategy for non-EA nonprofits if their applicant pool is deep, and having the third-best rather than the best candidate in a position doesn't make a huge difference. I'm not convinced that is presently the situation in most EA orgs.</p><p>The org could, of course, pay salaries high enough to keep SF-based candidates in the pool no matter where the employee was located. But its ROI for doing so does not seem high.</p><blockquote><p>By taking into account previous history considerations, you are incentivizing people to create those considerations so that they will be taken into account in the future.&nbsp;</p></blockquote><p>I think many of those considerations are created by an individual's pre/non-EA life. My sense of where feels like \"home\" is influenced by where I grew up. If one of my goals is for my son to have a deep relationship with his grandparents, the grandparents are located where they are and the costs of semi-frequent travel are what they are. These considerations are not \"create[d]\" by the candidate in a way that is responsive to incentives. Moreover, unless someone immediately lands an EA job, their location incentives are more likely shaped by the general employment market in their field -- not by EA employers.</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnusyua61v0i\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefusyua61v0i\">^</a></strong></sup></span><div class=\"footnote-content\"><p>I do have some concerns that this could create bidding dynamics that could be unhealthy. Does the org go back to the # 1 candidate and say that the calculator gives $100K for the low-COL candidate, we like you 10% better, can you work for $109K even though the calculator says $130K for your location? Would it then go to the # 2 candidate and give them a chance to undercut the # 1 candidate by working for less?</p></div></li></ol>", "parentCommentId": "vGDp2GyuXSPc7epHL", "user": {"username": "Jason"}}, {"_id": "Hd3yz9wrngMZk2wZx", "postedAt": "2023-11-17T19:49:57.040Z", "postId": "PwnRriopRSptjNvw5", "htmlBody": "<p>If you think people in high cost of living areas are more productive on average (agglomeration effects, and their presence their is a signal that they were productive enough at their prior employment to justify the location) and their BATNA is higher (because there are many local good employers competing for them) then CoL adjustments in function as a noisy proxy for justified supply/demand curve shifts.</p>", "parentCommentId": "vGDp2GyuXSPc7epHL", "user": {"username": "Larks"}}, {"_id": "vjhCxH2iChNQeex5K", "postedAt": "2023-11-17T23:18:06.031Z", "postId": "PwnRriopRSptjNvw5", "htmlBody": "<p>FWIW Regarding your “bright-line” rule: For ~all our current roles/hires (even the most junior ones) their earning potential in the private sector is higher than the output of the calculator. We’re not typically hiring people who could attract &lt;average wages as the counterfactual because we have been hiring exceptional people for specialist roles. As we grow we might hire for different roles where this isn’t the case and may at that point reconsider. I certainly don’t expect our current calculator/settings to last more than 1 year (at the very least we’re updating for things like inflation and currency shifts, we will also use these comments in the review process too).</p>\n<p>(Typing on my phone, excuse the brevity)</p>\n", "parentCommentId": "jeDxyhaGxd6772QLC", "user": {"username": "Luke Freeman"}}, {"_id": "ZvhuTdRGnD7HCfqfw", "postedAt": "2023-11-17T23:25:45.347Z", "postId": "PwnRriopRSptjNvw5", "htmlBody": "<p>FWIW: The CoL adjustment is the thing with the widest spread of views within the pay survey that we did. I think that we’ve arrived at near the least bad option for our team at the moment. An employee location does factor into some roles more than others, for example if someone is likely to be donor facing it is much more valuable to the organisation (and worth paying more) for them to be located in places like SF, NYC, London, Sydney etc where we have a high number of (potentially larger) donors.</p>\n", "parentCommentId": "7iEYmqDA65GP2D6Ns", "user": {"username": "Luke Freeman"}}, {"_id": "2XrmWbNmGo6diQRyS", "postedAt": "2023-11-17T23:29:03.689Z", "postId": "PwnRriopRSptjNvw5", "htmlBody": "<p>Re: Last point. The hiring manager can/would/does take into account the cost/benefit of the location/specific candidate when deciding which offers to make. It’s an all things considered decision.</p>\n", "parentCommentId": "vGDp2GyuXSPc7epHL", "user": {"username": "Luke Freeman"}}, {"_id": "dXuatxH4pF5DXJy7D", "postedAt": "2023-11-17T23:48:24.371Z", "postId": "PwnRriopRSptjNvw5", "htmlBody": "<p>Thanks -- that makes a lot of sense. One of the things I'm thinking about in the back of my head is the possibility that other orgs may adapt the algorithm for broader use. So I think it's helpful to document considerations like this. Doing so mitigates the risk of others applying the algorithm without first considering whether important assumptions upon which the originator org relied also hold true for their org.</p>\n", "parentCommentId": "vjhCxH2iChNQeex5K", "user": {"username": "Jason"}}, {"_id": "cFiyxfKAobgqkHWLq", "postedAt": "2023-11-17T23:55:28.231Z", "postId": "PwnRriopRSptjNvw5", "htmlBody": "<p>That's a great point. I would think that a position that required the employee work in a certain location should have a 100 percent locality adjustment, as the employee's location is determined by employer needs rather than employee choice.</p>\n<p>It gets more interesting where there is some benefit to the employer, but not enough to strongly prefer or require a location or locations. E.g., does an employee being located in the Bay serve an AI safety org's interest to some extent, due to easier ability to collaborate with others doing similar work in and out of work hours?</p>\n", "parentCommentId": "ZvhuTdRGnD7HCfqfw", "user": {"username": "Jason"}}, {"_id": "QHSXP9unH3zyxgtKv", "postedAt": "2023-11-18T00:12:27.280Z", "postId": "PwnRriopRSptjNvw5", "htmlBody": "<p>Yep. It’s complicated and needs to be tailored to the organisation and it’s needs at the time. So far all our roles have been remote but we have seen an employees location as something that might have some cost/benefit to consider but not a requirement.</p>\n", "parentCommentId": "cFiyxfKAobgqkHWLq", "user": {"username": "Luke Freeman"}}, {"_id": "xZcWKJ3EXM6vtZnEq", "postedAt": "2023-11-18T00:12:55.836Z", "postId": "PwnRriopRSptjNvw5", "htmlBody": "<p>Agreed!</p>\n", "parentCommentId": "dXuatxH4pF5DXJy7D", "user": {"username": "Luke Freeman"}}, {"_id": "MuenkZGmuRyrscmP4", "postedAt": "2023-11-23T10:35:01.329Z", "postId": "PwnRriopRSptjNvw5", "htmlBody": "<p>Hi Arturo Macias,<br>This is a reminder that there is a Forum norm to <a href=\"https://forum.effectivealtruism.org/posts/yND9aGJgobm5dEXqF/guide-to-norms-on-the-forum#The_essentials_of_Forum_discussion\">stay on topic</a>. Your comment here does not respond directly to NunoSempere. If you respond more directly to a point that’s been made, then you are more likely to receive positive engagement on the Forum. You can consider this a warning from the moderation team: a comment of this type alone wouldn't normally warrant a warning, but you appear to have commented in a similar manner multiple times in the past, for instance, <a href=\"https://forum.effectivealtruism.org/posts/qF4yhMMuavCFrLqfz/ea-vegan-advocacy-is-not-truthseeking-and-it-s-everyone-s?commentId=EuRtaTsmJrLWZGNfy\">here</a>, <a href=\"https://forum.effectivealtruism.org/posts/c9vt7SPeCCiC76cMC/from-passion-to-depression-and-pessimism-my-journey-with?commentId=5ctkJxPFXjXhW3YzK\">here</a> and <a href=\"https://forum.effectivealtruism.org/posts/oWLT2L2ToxsNtKKnC/influences-on-individuals-adopting-vegetarian-and-vegan?commentId=DjsHzKpibHAn5oBsR\">here</a>.<br>Best, Toby (from the Forum moderation team)</p>", "parentCommentId": "jRSw2bEAQ9o7j6ToR", "user": {"username": "tobytrem"}}]