[{"_id": "LXRenCSGKRwfLNFRo", "postedAt": "2022-12-27T09:36:50.501Z", "postId": "PwvErqANss27av6wi", "htmlBody": "<p>You could study subjects, read books, watch movies and play video games, provided that these things are available. But I personally think that Buddhism is particularly optimized for solitary life, so I'd meditate, observe my mind and try to develop it and read Buddhist teachings. Other religions could also work, at least Christianity has had hermits.</p>\n", "parentCommentId": null, "user": {"username": "LoveAndPeaceAlways"}}, {"_id": "XFtmWMb3Z2nHbgKbH", "postedAt": "2022-12-27T11:57:56.707Z", "postId": "PwvErqANss27av6wi", "htmlBody": "<p>Are there other <i>sentient</i> beings in the universe in this scenario? Should I take into account the fact that in this scenario something virtually impossible appears to have happened, so I live in a reality where virtually impossible things happen, meaning something is clearly wrong about my ordinary picture of the world?</p><p>&nbsp;</p><p>I think I sort of get what you're trying to do, but it's surprisingly difficult to make the thought experiment do that (at least for me)! What happens in my case is that I get caught up in stuff that the scenario would seem to imply -- e.g. that virtually impossible things happen so trying to sort out the expected outcomes of decisions is difficult -- then sort of remind myself that that's not the point (this is not some subtle decision theoretic thought experiment!) but then become annoyed because it seems I'd need to just sort of directly work out \"what I value about my existence\" and transfer that into the hypothetical situation. But then, what do I need the hypothetical situation for in the first place?</p><p>&nbsp;</p><p>Depending on how valence turns out to work, and if there really are no other sentient beings in all of reality, suicide (at least of the evolutionary illusion of a unitary self persisting over time) sounds like a good option: completely untroubled lights-out state for the entirety of the field of consciousness.&nbsp;</p><p>&nbsp;</p><p>But perhaps it would be a good idea to explore the (positive or at least neutral valence regions of the) state space of consciousness (using whatever high-tech equivalents of psychedelia and the consciousness technologies of the contemplative traditions the spaceship has to offer) and see what emerges, provided the technology available on the spaceship allows for this to be done safely. Here the idea is to allow \"different states of consciousness\" a say in the decision, so we don't just e.g. end all sentience because we're in a dark mood (perhaps scared shitless finding ourselves in what seems to be an impossible situation, so we might be pretty paranoid about trusting our epistemology), creating a sort of small community of \"different beings\" -- the dynamics within and among the different states of consciousness --collectively figuring out what to do. I would not be at all surprised if peaceful cessation of all sentience was ultimately the decision, but if there are no other sentient beings, and I'm not myself suffering particularly intensely, making sure this is the right thing to do would also seem prudent.</p><p>&nbsp;</p><p>But again, a reality where an apparently evolved world simulation pops into existence with no past causal history would seem to be radically different from the one we appear to live in, so again, it's difficult to say!</p>", "parentCommentId": null, "user": {"username": "Aatu Koskensilta"}}]