[{"_id": "3Frcn5hxJBNkxSuL3", "postedAt": "2022-09-27T00:30:59.801Z", "postId": "PxwdLvYA8HvRkWXnH", "htmlBody": "<p>Thank you for doing this!</p>\n<p>My questions:</p>\n<ol>\n<li>\n<p>Where did the time come from? What activities did you have to give up? How did that feel, emotionally?</p>\n</li>\n<li>\n<p>How did this change in going from one kid to two?</p>\n</li>\n</ol>\n<p>(I say this as someone who:</p>\n<ul>\n<li>Can't really imagine working less and still being reasonably successful in my current line of work</li>\n<li>needs a certain amount of sleep to be productive and happy</li>\n<li>has a life full of other things that bring me joy and feel important to me</li>\n</ul>\n<p>At the same time, I have a strong felt sense that I would like to have a child. So I am currently betting that I will find the time mainly by cutting out most of my time with friends / other leisure activities, and that the meaning and joy of raising a child will make this worthwhile. But I worry that I will feel resentful / inclined to prioritize my needs over my child's fullest flourishing.)</p>\n", "parentCommentId": null, "user": {"username": "sjsjsj"}}, {"_id": "tfF2EDbneDMtycg83", "postedAt": "2022-09-27T00:33:29.885Z", "postId": "PxwdLvYA8HvRkWXnH", "htmlBody": "<p>While raising young children, how much of the time did you feel happy vs. frustrated? Did you feel able to think clearly?</p>\n<p>(I don’t think these are the most important considerations about having kids, but I’m curious.)</p>\n", "parentCommentId": null, "user": {"username": "Emily Dardaman"}}, {"_id": "4bnt2tNvWMpEDPx5w", "postedAt": "2022-09-27T01:00:30.813Z", "postId": "PxwdLvYA8HvRkWXnH", "htmlBody": "<p>Good questions. In reply:</p><ol><li>The time for parenting, in my experience, comes mostly from spending less time watching less TV, playing computer games, and reading; doing less traveling and socializing with friends; and working in a different way -- cutting out wasted time on low-priority things, learning to say no to irrelevant distractions, and learning how to collaborate, outsource, and delegate more efficiently. It's very important to have a partner/spouse/co-parent who's smart, efficient, and pragmatic at organizing life, and figuring out good, sustainable, divisions of labor.</li><li>My older daughter (age 26) was fully grown when I had my younger daughter (age 6 months), so I haven't had the experience of raising two young kids at the same time. However, I was raising older daughter at the same time as I was helping to care for my teenage step-son, and task-switching between them could be challenging (i.e. not treating a toddler as if they're a teen, or vice-versa).&nbsp;</li></ol><p>Regarding sleep: it's absolutely crucial to sleep-train a baby starting around 3-4 months old, using behaviorist learning principles that can be emotionally challenging to implement at first (e.g. ignoring baby crying for certain lengths of time), but that are hugely beneficial in the long run (e.g. having to wake up with them only twice a night, rather than six times a night.) &nbsp;Once a kid is about 2-3 years old, they'll typically sleep through the night. And remember, young kids sleep MUCH more than adults -- our baby typically goes to sleep around 6:30 pm and wakes around 6:30 am -- plus has four 40-minute naps during the day. So there's quite a bit of time when they're just sleeping in their crib.</p><p>Regarding the dangers of working less: I was very worried about this as a post-doc (age 30) having a kid, and being concerned about getting an academic job and tenure. However, I found that having a baby was enormously motivating. The book I'd been procrastinating about writing for 3 years suddenly got written within a fairly short period, because I really needed the advance money to buy a bigger house for the family. My career strategizing, which had been rather self-indulgent and haphazard, got laser-focused on getting a good stable tenure-track job with decent pay and good colleagues -- and it worked. All because being a parent forces one to get very realistic about money, time, job stability, and career goals, very quickly.&nbsp;</p><p>Regarding job and fulfillment: every parent I know says there's a qualitatively new kind of fulfillment that comes from having kids. When my first daughter was born, I immediately thought, 'Why did I waste so much of my life before this, in things that now seem meaningless?' &nbsp;This might be a trick that evolution plays on our brains, but it works! Also, competent and effective parents can still find plenty of time to socialize, enjoy Game of Thrones, read, relax, etc. It's not nearly as easy to travel or go to Burning Man, but it's possible, especially with older kids.</p>", "parentCommentId": "3Frcn5hxJBNkxSuL3", "user": {"username": "geoffreymiller"}}, {"_id": "wDyYJteunWfn2bhje", "postedAt": "2022-09-27T01:01:12.047Z", "postId": "PxwdLvYA8HvRkWXnH", "htmlBody": "<p>Hi Prof. Miller,</p><p>Do you think I should spend effort and research and care about the particulars of having kids ahead of time even though I largely perceive myself as possibly/probably never wanting to have kids? &nbsp;It certainly seems reasonable to strongly expect I might eventually fully change my mind about having kids just because having kids is - well - genetically mandated and such. Preparing and planning now seems like a wise hedge against my lack of desire to have kids right now?</p><p>I am a 30 year old male now and am still sorta mostly leaning towards not having kids. Is that normally a sign that this is how I should expect my psychology to be throughout my thirties and forties? And I should just not sweat it and continue to focus on studying AI Alignment?</p><p>Secondly, do you think there is a &nbsp;good pronatalist argument to be made that an EA that doesn't feel like they want kids <i>should </i>still regardless have kids? I've heard the \"in expectation if EAs all have kids we'll get more geniuses - low prob. in each case, but such high potential impact that we ought to have kids\" argument. I take this line of thinking seriously, but I still find it hard to think that this argument could ever be strong enough to - on consequentialist grounds - mean someone who doesn't want kids should have kids regardless.</p><p>Thirdly, I find the idea of adopting pulls at my heartstrings, but have lost track of how many times I've heard the argument that I should have my own kids to pass on my genes. Naturally sperm bank donations are always an option if I am rationally committed to the latter. But the question still remains which is, as an EA and a psychology professor, how do you think about adoption vs having your own kids?</p>", "parentCommentId": null, "user": {"username": "Cornelis Dirk Haupt"}}, {"_id": "LmNKmYWKddDdb4zDG", "postedAt": "2022-09-27T01:05:58.834Z", "postId": "PxwdLvYA8HvRkWXnH", "htmlBody": "<p>Pete -- I'd say with babies, most of the frustration comes from trying to multitask when it's not feasible, being anxious about why baby's crying (which gets reduced a lot with subsequent babies), and feeling like one 'should' be doing work stuff when it's not possible. If you don't sleep train a baby, you also end up sleep deprived, which makes you irritable and frustrated. On the other hand, the happiness is very frequent and strong (assuming baby is healthy and well). I'm naturally quite introverted, dysthymic, and irritable, but being around a happy baby makes me playful, delighted, and grounded; often I've been smiling so much at the end of the day that my face muscles hurt (which rarely happens around adults.)</p><p>Regarding thinking clearly, the only real cognitive deficits from parenting come from sleep deprivation (which is mostly avoidable), and from having a bit less time for self-care in terms of exercise, nutrition, nootropics, and cognitively stimulating socializing.</p>", "parentCommentId": "tfF2EDbneDMtycg83", "user": {"username": "geoffreymiller"}}, {"_id": "75damcQndoexBCphC", "postedAt": "2022-09-27T01:21:26.216Z", "postId": "PxwdLvYA8HvRkWXnH", "htmlBody": "<p>Cornelis - very thoughtful questions.&nbsp;</p><p>I would strongly recommend doing some serious research and thinking about this issue now, while you're 30. Partly to plan ahead and prioritize, partly to get clarity before getting seriously involved with a partner (who will probably want that clarity up front!), partly to be able to empathize more effectively with both parents and non-parents, in terms of the tradeoffs they've faced. Being male does buy you a bit more elbow room in terms of reproductive timing; you could potentially wait until your 50s. Mutation load in sperm does slightly increase with age, but it's not a very big effect. Energy for parenting does slightly decrease with age, but not that quickly if you stay in shape.</p><p>In my experience, and among male friends and colleagues, it's fairly rare for guys to have a strong, specific desire to have kids, at least until they meet a woman who seems exciting to have kids with. Evolution seems to have figured that if we have a sex drive and good mate choice, we don't need a specific desire for kids. Contraception makes that heuristic less effective now.</p><p>Regarding sperm donation, I think it's a very sensible thing to do, if you qualify; I think it's ethical to allow any resulting kids to contact you when they're a teen if they want to. I think raising one's own kids is often significantly more rewarding than raising adopted kids, just because one's own kids will share so much more of one's cognitive traits, personality traits, quirks, etc, that you can empathize better with them.</p><p>The pronatalism argument is something I should write about in more detail later. I don't think that reproducing oneself just in order to maximize total number of geniuses is that compelling an argument -- one could 'offset' genius-reproduction by encouraging other smart people to have kids, promoting pronatalism, etc.&nbsp;</p><p>However, I do think there are some specific benefits of becoming a parent, especially for someone working on AI alignment: (1) you get a LOT of insights into how learning works, if you view babies and kids as little 'machine learning systems', and if you read some developmental psychology, (2) you become much more longtermist and future-oriented, personally concerned about the fate of your kids and future grandkids, and more strongly motivated to minimize X risks, (3) you get a lot more credibility with parents when discussing X risks, longtermism, alignment, etc -- they don't want to be reassured that 'AGI will be safe, trust us!' or 'AGI is a big danger that deserves more attention, trust us!' by childless people with no skin in the game.</p>", "parentCommentId": "wDyYJteunWfn2bhje", "user": {"username": "geoffreymiller"}}, {"_id": "ukmxjQktomW8qeroe", "postedAt": "2022-09-27T01:28:29.213Z", "postId": "PxwdLvYA8HvRkWXnH", "htmlBody": "<p>PS for EAs considering having kids, I would strongly recommend two books by economist Bryan Caplan:&nbsp;</p><ol><li>'<a href=\"https://www.amazon.com/Selfish-Reasons-Have-More-Kids/dp/0465028616/\">Selfish reasons to have more kids</a>' (2012), which explains that the high heritability of most psychological traits means you can relax and 'trust your genes' as a parent, without trying to hothouse and overschedule and push your kids the way that most American parents do</li><li>'<a href=\"https://www.amazon.com/Case-against-Education-System-Waste-ebook/dp/B07T3QRNLC/\">The case against education</a>' (2019), which explains why the exact types of schooling your kids get don't actually have much long-term impact on how they turn out, once you control for their cognitive and emotional traits -- e.g. it won't matter that much whether you do public school, private school, home school, or unschooling</li></ol><p>Also, for people curious about nature vs. nurture issues in how kids turn out, I'd recommend popular behavior genetics books such as '<a href=\"https://www.amazon.com/Blueprint-new-afterword-How-Makes-ebook/dp/B08BT69SZK/\">Blueprint</a>' (2019) by Robert Plomin, or the classic '<a href=\"https://www.amazon.com/Blank-Slate-Modern-Denial-Nature-ebook/dp/B000QCTNIM/\">The blank slate</a>' (2001) by Steven Pinker.</p>", "parentCommentId": null, "user": {"username": "geoffreymiller"}}, {"_id": "CTM4Q42aZxZyCbfux", "postedAt": "2022-09-27T02:02:04.471Z", "postId": "PxwdLvYA8HvRkWXnH", "htmlBody": "<p>I would love to hear any elaboration on how sleep deprivation is mostly avoidable.</p>\n", "parentCommentId": "LmNKmYWKddDdb4zDG", "user": null}, {"_id": "RBSZJPSoMTniR2Qzd", "postedAt": "2022-09-27T02:22:00.901Z", "postId": "PxwdLvYA8HvRkWXnH", "htmlBody": "<p>Thank you very much for this offer - I have many questions, but I don't want to eat away too much of your time, so feel free to answer as few or as many of my questions as you choose. One criterion might be only answering those questions that you believe I would have the longest or most difficult time answering myself. I believe &nbsp;that many of my questions could have fairly complex answers; as such, it might be more efficient to simply point me to the appropriate resources via links. While this may increase your work load, I think that if you crossposted this on <a href=\"https://www.lesswrong.com/\">LessWrong</a>, its members would also find this post valuable.&nbsp;</p><p><strong>Background&nbsp;</strong></p><p>My partner and I are both in our early-mid 20's (we are only 2 months apart in our ages) and are interested in having children. More specifically, we currently believe that our first child, should we have any children together, will likely be born 6.5 to 9.5 years from now. We are thinking about having 2-4 children, but the final number depends on my partner's experiences with childbirth and on our collective experience of raising the first, second, etc... child. Some members of my partner's family experience depression and my partner has a mild connective tissue disorder. Members of my family deal with some depression as well. My partner and I are thinking about using embryo selection to address for these things and to potentially optimize the IQ of our children, among other features that might have polygenic scores. We might also consider using gene-editing if it is available, but we definitely have to think more about this. The current health risks to both the host and embryo involved with IVF and egg extraction make my partner nervous, but she thinks she is more likely than not to follow through with the procedure. As for temperament, my partner and I are both relatively calm and inquisitive people and broadly share the same parenting values, though we haven't, of course, fully scoped these values out. I suspect that I might be more conservative or rigid than her with my future parenting practices, but much of this comes from me having not yet formed beliefs about what works and what doesn't with parenting and instead making precaution my default mode of operation. Now, onto the questions.&nbsp;</p><p><strong>Optimal Timing</strong></p><p>How much do my partner and I stand to lose in terms of our children's health and psychological development if we were to have our first child at age ~28 versus at age ~32. We might have up to 4 children, so assuming each child is 2 years apart in age: &nbsp;\"first child at 28\" scenario ==&gt; new child at ages 28, 30, 32, and 34; \"first child at 33\" scenario ==&gt; new child at ages 33, 35, 37, and 39. While I am unfamiliar with the details of the research, my current belief are \"risk of child having health defects due to older father only really begin to increase, on average, when fathers reach around the age of 40\" and \"risk of child having health defects due to older mother increase, on average, in early 30s\". I think it is important to consider how old my partner and I will when our youngest child is 10 in each scenario: 44 for the first scenario and 49 for the second scenario. I am unaware of how large the difference in physical ability / stamina is for the ages 20 vs. 30, 30 vs. 40, 40 vs. 50, etc... but I feel that 44 vs. 49 constitutes a large difference in stamina.&nbsp;</p><p><strong>Embryo Selection and IVF</strong></p><p>Do you have any forecasts concerning embryo selection and IVF? Some example questions: How much do you think IVF will cost in 2027? in 2032? How do you think the risks associated with IVF and egg extraction with change in the next 6 years? In what ways do you think polygenic screening will improve in the next 6 years? What are you thoughts on the safety, morality, and practicality of embryo selection today, and how do you think this will change in the next 6 years?&nbsp;</p><p><strong>Nature vs. Nurture</strong>&nbsp;</p><p>Can you provide a concise reflection of the current consensus of the genetics / biology community on this question? Your answer might contribute marginally to my parenting attitudes and behavior.</p><p><strong>Naming</strong></p><p>There are two primary questions I have on this. (1) In your experience, how much do you believe a person's name affects their life outcomes? My current belief is for the overwhelming majority of people the effect is marginal. (2) What do you think are the effects of having your children call you by your first name instead of by something like \"Mommy\" or \"Daddy\"? My partner and I intend to have our children call us by our first names.&nbsp;</p><p><strong>Holidays</strong></p><p>Assuming that my partner and I raise our children in a sparsely populated suburb or rural region in the Eastern USA, do you think never celebrating holidays such as Christmas or birthdays would have a strong effect on the psychological development of our children? My partner and I intend to avoid celebrating any conventional holidays, except for Halloween, and to celebrate the Solstices and Equinoxes instead.&nbsp;</p><p><strong>Twins&nbsp;</strong></p><p>If we had the option to do this, do you think it would be a good idea to have 2 pairs of twins instead of 4 children, i.e. generally speaking, do people who have a twin sibling experience higher levels of well-being, and if so, would recommend this option?&nbsp;</p><p><strong>Birth Order</strong></p><p>From what I've read, it appears that, at least among many current indigenous societies, the demographic that predominantly plays with and cares for children beyond the mother and father are adolescent females. With this in mind, might it make more sense to have the first child be a female? Additionally, I've come across the idea that the last child of families with more than 2 children typically has more estrogen than other the children, on average. What are some of the consequences of birth order by sex, assuming that my partner and I have 4 children and that each of these children are born 2 years apart? For example, would you suspect that the well-being of the following group, in order of birth from 1st born to last born, (F, M, M, F) experiences higher well-being than (M, F, F, M), all other things controlled for, hypothetically?</p><p><strong>Geographical location</strong></p><p>My partner and I are considering forming some establishment in a region with forests, some terrain, a low population density, and low air pollution* that is at most 3 hours away from an urban area. Some regions in the Eastern US comes to mind here. The air pollution part has an asterisk next to it since I highly value this consideration for where to raise children. Generally speaking, what might be some disadvantages to raising children in such an area? I suspect that a potential lack of immediate access to healthcare services might be one.&nbsp;</p><p><strong>Education and technology</strong></p><p>My partner and I plan to home-school our children until they are college age. We suspect that socialization might be a large issue if we follow through with this plan. I intend to instruct my children in many subjects and would very much like for them to develop strong critical thinking skills, a curiosity and wonder with the universe, and a general mental framework for how the world works. This is all standard though; do you have any recommendations for inculcating these things across the various developmental milestones? For example, it might be the case that I should primarily talk to an X year old in such a way because they have not developed Y capacity yet. Also, I am quite keen on limiting the access of my children when they are young (0-10, but this upper bound is something that I need to think about) to most of YouTube (except for educational channels), most of the Internet (except for educational websites or resources), and all of television. I intend to teach my children at least the basics of electronics and programming, so their engagement with the technology involved with these things would be openly encouraged. What would might be some consequences on the mental development of my children of me taking these actions? Of course, your answer is not the sole consideration for my decision.</p><p><strong>Emotions and Discipline</strong></p><p>My partner and I are both highly conflict avoidant. We are both quite calm most of the time and are not too affected by anger or frustration, though we do feel such things occasionally. We intend to not display frustration, anger, or intense exasperation in front of our children, but don't know if this a good idea. Are there some emotions or reactions that should not be shown to children as they may lead to a weakened ability to deal with / tolerate certain aspects of human interaction / the world? Also, my partner and I are both unaware of what the most developmentally beneficial forms of discipline are for children. For one heuristic, we are considering making an effort to enforce disciplinary action <i>immediately</i> in response to some undesirable action, and to always follow throw with what we promise and warn about.&nbsp;</p><p>This is a long list of questions, but thank you for reading it if you've gotten to the end. It has actually been helpful in eliciting some of the ideas I've had about parenting that I've not explicitly written out.&nbsp;</p><p>Have a nice day!</p>", "parentCommentId": null, "user": {"username": "rodeo_flagellum"}}, {"_id": "Y8giM5utnQFXsZNJZ", "postedAt": "2022-09-27T02:24:48.237Z", "postId": "PxwdLvYA8HvRkWXnH", "htmlBody": "<p>What precautions did you take or would you recommend, as far as preventing the (related) problems of falling in with the wrong crowd and getting infected with the wrong memes?</p>\n<p>What morality and metaethics did you try to teach your kids, and how did that work out?</p>\n<p>(Some of my posts that may help explain my main worries about raising a kid in the current environment: <a href=\"https://www.greaterwrong.com/posts/vA2Gd2PQjNk68ngFu/what-determines-the-balance-between-intelligence-signaling\">1</a> <a href=\"https://www.greaterwrong.com/posts/PjfsbKrK5MnJDDoFr/have-epistemic-conditions-always-been-this-bad\">2</a> <a href=\"https://www.greaterwrong.com/posts/y5jAuKqkShdjMNZab/morality-is-scary\">3</a>. Would be interested in any comments you have on them, whether from a parent's perspective or not.)</p>\n", "parentCommentId": null, "user": {"username": "Wei_Dai"}}, {"_id": "HoRd4KTa2fQJjbC6P", "postedAt": "2022-09-27T04:28:27.603Z", "postId": "PxwdLvYA8HvRkWXnH", "htmlBody": "<p>I am a woman in early/mid twenties. I am confident that I want kids, I also hold pronatalist views generally speaking. As a woman, three of my greatest concerns are timing (the whole biological clock thing), paternal investment, and social environment for child rearing. Big shocker I know :)</p><ol><li>Someone else already asked about timing, but I think my question is slightly different. Regarding timing, I am keenly aware of the trade-offs between a) being younger and having more physical energy and strength but fewer financial resources accumulated and b) being older and having less physical strength but having greater financial resources. I’ve pretty much accepted the fact that at some point I will have to take a physical hit and a career hit if I want to procreate, but I feel conflicted about when the best time for this is. Physically, earlier seems better. Financially, later seems better. Mentally, I’m not sure. Obviously the prospective partner and his resources play a key role, <i><strong>but assuming full paternal investment in the mother and progeny, when do you think is the best time for a woman to have children in terms of her mental and physical health and in terms of psychological development of the child?</strong></i> &nbsp;The average age of first time mothers (26 y) and fathers (31 y) in the United States seems to continue creeping upwards</li><li>As for paternal investment, I’m not sure where to start, this topic feels like a minefield to me, partially considering that mostly men make up this forum and EA. I sometimes get the sinking feeling that even the most invested male partner I could ever find would not be able to deliver the kind of childcare or domestic skills that women are capable of delivering, which feel essential to the entire enterprise of procreating. The caretaking of both men, children, and the elderly seems to fall on women’s shoulders disproportionately, which is frustrating for any woman who wants to do or be anything other than a caretaker, especially in countries with less governmental support. I’m writing these things based on the structure and gender roles of our society, statistics on gender and families for which I would be happy to make a link post if anyone wants it, and in spite of men’s best efforts (which in turn make me think that successful child rearing is not so much about selecting an invested mate as it is about finding a community of women to help with kids). Not trying to say that men aren’t capable of being great parents or having good domestic skills (a lot of both great and inept dads out there), just sometimes that it feels this way from my perspective. <i><strong>My questions are, what do you think optimal paternal investment looks like or what do you think it should look like? From an anthropological or evolutionary point of view, how much direct involvement in children’s lives should women realistically expect from men? How do you think optimal paternal investment changes in the context of modern times?&nbsp;</strong></i></li><li>It is clear to me that the nuclear family is not a good structure for child rearing, maternal health, or children’s psychological development. It takes a village as they say. <i><strong>What do you think is the best living arrangement or social environment for families? How valuable do you think intergenerational living is? Have you heard of cohousing and if so, what do you think of it?&nbsp;</strong></i></li></ol>", "parentCommentId": null, "user": {"username": "emmakat1998 "}}, {"_id": "vX8YaS9CtMrYBgr6r", "postedAt": "2022-09-27T04:29:59.243Z", "postId": "PxwdLvYA8HvRkWXnH", "htmlBody": "<p>Also, not a question, but a book recommendation for <i>Expecting Better </i>by Emily Oster&nbsp;</p>", "parentCommentId": "HoRd4KTa2fQJjbC6P", "user": {"username": "emmakat1998 "}}, {"_id": "ychHYoZCtGcs6baS6", "postedAt": "2022-09-27T04:34:42.138Z", "postId": "PxwdLvYA8HvRkWXnH", "htmlBody": "<blockquote><p>I think raising one's own kids is often significantly more rewarding than raising adopted kids, just because one's own kids will share so much more of one's cognitive traits, personality traits, quirks, etc, that you can empathize better with them.</p></blockquote><p>I'm extremely<i> </i>skeptical of this claim. Many parents I know with multiple biological children report that they have immensely different personalities, and it seems intuitively obvious that any statistical correlations of such traits between child and parent that are driven by genes will be overwhelmed by statistical noise in a family with an n of, say, 3 or fewer children. As someone with two biological children, IMHO almost all of the rewarding aspects of being a parent come from the experience of watching them grow up on a daily basis and directly contributing to that growth, not from picking out physical or other characteristics that happen to remind me of myself.</p>", "parentCommentId": "75damcQndoexBCphC", "user": {"username": "IanDavidMoss"}}, {"_id": "oxEbzwMB99JEGyfxK", "postedAt": "2022-09-27T08:24:21.802Z", "postId": "PxwdLvYA8HvRkWXnH", "htmlBody": "<p>One worry I have about Caplan's data is that it merely shows that <i>within the normal range</i> (99% or whatever) parental/educational choices don't make a noticeable difference. &nbsp;But EAs aren't exactly representative, so it could be a mistake to infer from this that <i>your</i> parental choices won't make a big difference. &nbsp;(In our case, our 5 y/o is being homeschooled by two Princeton philosophy PhDs. How many families relevantly like ours would've been included in the studies Caplan cites?)</p><p>Conversely, we know from historical examples (e.g. J.S. Mill) that unusual upbringings can have striking results (not that I'd necessarily recommend James Mills' approach!) &nbsp;As EA matures, I'd really like to see more experimentation in parenting and educational approaches, with an eye to learning more about how best to nurture exceptional talent. (Obviously plenty depends on genetics, but I'd say that's more of a necessary than a sufficient condition. &nbsp;It beggars belief to suggest that we can't seriously improve upon typical educational approaches.)</p>", "parentCommentId": "ukmxjQktomW8qeroe", "user": {"username": "RYC"}}, {"_id": "63hiopWt4dqWhbdmk", "postedAt": "2022-09-27T09:37:53.890Z", "postId": "PxwdLvYA8HvRkWXnH", "htmlBody": "<p>I want to add that sleep training is a hot-button issue among parents. There is some evidence that starting to sleep-train your baby too early can be traumatic. My advice is simply to gather evidence from different sources before making a choice.</p><p>Otherwise, I agree with Geoffrey Millers reply. Your working hours as a parent are usually shorter, but you learn how to set priorities and work more effectively. &nbsp;</p>", "parentCommentId": "3Frcn5hxJBNkxSuL3", "user": {"username": "Frank_R"}}, {"_id": "Z7owQeYXMvXL2zgBi", "postedAt": "2022-09-27T15:05:33.683Z", "postId": "PxwdLvYA8HvRkWXnH", "htmlBody": "<blockquote>\n<p>even the most invested male partner I could ever find would not be able to deliver the kind of childcare or domestic skills that women are capable of delivering</p>\n</blockquote>\n<p>As a pro-natalist myself, I'm really curious about this remark. What aspect of childcare are men not capable of delivering? Is it just that they generally don't know domestic skills or is there something you think we can't learn as well as women?</p>\n", "parentCommentId": "HoRd4KTa2fQJjbC6P", "user": {"username": "robirahman"}}, {"_id": "rzYELwAhbhGYrD3fc", "postedAt": "2022-09-27T15:58:28.588Z", "postId": "PxwdLvYA8HvRkWXnH", "htmlBody": "<p>N of 1 here, but FWIW this has very much not been my experience (gestating and breastfeeding aside).</p>", "parentCommentId": "Z7owQeYXMvXL2zgBi", "user": null}, {"_id": "9nh4Lhv7oXgrKA2MJ", "postedAt": "2022-09-27T16:52:08.210Z", "postId": "PxwdLvYA8HvRkWXnH", "htmlBody": "<p>In my experience as someone belonging to the <a href=\"https://pubmed.ncbi.nlm.nih.gov/32437234/\">WEIRD</a> demographic, males in heterosexual relationships provide less domestic or child support, on average, than their spouse, where by \"less\" I mean both lower frequency and lower quality in terms of attention and emotional support provided. Males seem entirely capable of learning such skills, but there does seem to some discrepancy in the amount of support actually provided. I would be convinced otherwise were someone to show me a meta-analysis or two of parental care behaviors in heterosexual relationships that found, generally speaking, males and females provide analogous levels of care. In my demographic though, this does not seem to be the case.&nbsp;</p>", "parentCommentId": "Z7owQeYXMvXL2zgBi", "user": {"username": "rodeo_flagellum"}}, {"_id": "XPTX5SiqqTTXgLk5h", "postedAt": "2022-09-27T17:03:57.611Z", "postId": "PxwdLvYA8HvRkWXnH", "htmlBody": "<p>This is a fair point. My older daughter (now 26) was very smart, and easily bored in normal public school. &nbsp;We worked very hard to be able to send her to the best private schools we could find, from age 8 onwards (she ended up at Westminster School in London, then Oxford). She might have also flourished if homeschooled, if we'd had the time to do that.</p><p>So, Caplan's data might not apply so clearly if you and your partner are above about IQ 130 or 140, which means your kids are likely to be close to that (there is regression to the mean, but it's fairly limited for IQ, which has a heritability in adults of about 70-80%). &nbsp;However, Caplan does address this point in the education book.</p><p>I would argue that if you have smart kids, try to find the most selective schools you can that embrace standardized testing and streaming, and that have gifted programs, honors classes, etc. Smart kids love having peers who are smart -- and even if it doesn't make all that much different to their eventual career success, it can be a huge benefit to their day-to-day life quality and sentient experience.&nbsp;</p><p>I agree that EAs should support a lot more experimentation in parenting and education, especially in nurturing exceptional talent! I think we are nowhere near optimal in our current educational approaches.</p>", "parentCommentId": "oxEbzwMB99JEGyfxK", "user": {"username": "geoffreymiller"}}, {"_id": "tuNzpx4cGcjbZmekb", "postedAt": "2022-09-27T17:15:32.476Z", "postId": "PxwdLvYA8HvRkWXnH", "htmlBody": "<p>Frank -- thanks for your reply.&nbsp;</p><p>It's true that sleep training is quite controversial. If you look at Reddit parenting forums, it's one of the most viciously debated topics.&nbsp;</p><p>There's a strong taboo against explicitly training humans of any age using behaviorist reinforcement methods (which my wife Diana Fleischman is writing about in her forthcoming book). And there's a naturalistic bias in favor of kids co-sleeping with parents, frequent night-time nursing, etc. -- some of which may have an evolutionary rationale, but some of which may be parents virtue-signaling their dedication, empathy, etc.&nbsp;</p><p>Maybe sleep training too early can be traumatic, but it's not clear what 'too early' means, and I haven't seen good data either way. I'm open to updating on this issue -- with the caveat that a lot of parents throw around the term 'traumatic' in a rather alarmist way, without a very clear idea of what that actually means, or how it could be measured in a randomized controlled trial.</p><p>(There's an analogy to dog training here -- a lot of dog owners do very little training, very badly, on the view that training is manipulative, oppressive, and mean, and doesn't allow their dogs to 'be themselves'. Whereas owners of well-trained dogs understand that the short-term frustrations of training can have big long-term benefits.)</p><p>Regarding what prehistoric, hunter-gatherer, and traditional humans do in terms of parenting, it's useful and fascinating to look at the book '<a href=\"https://www.amazon.com/Mothers-Others-Sarah-Blaffer-Hrdy-ebook/dp/B010NF1636/\">Mothers and others</a>' (2011) by anthropologist Sarah Blaffer Hrdy.&nbsp;</p>", "parentCommentId": "63hiopWt4dqWhbdmk", "user": {"username": "geoffreymiller"}}, {"_id": "L84JaNsFTiqMmjBJy", "postedAt": "2022-09-27T18:41:20.681Z", "postId": "PxwdLvYA8HvRkWXnH", "htmlBody": "<p>I know men are very capable, I just sometimes get the feeling that they aren’t… &nbsp;</p><blockquote><p><strong>I sometimes get the sinking feeling that</strong> even the most invested male partner…&nbsp;</p></blockquote><p>I think there are two separate things to parse out here. One is domestic work, and another is child care.&nbsp;</p><p>I think I largely feel this way because I see that men generally don’t have as strong domestic skills, and are not socialized in a way that they either have or highly value these skills. Laundry, cooking, cleaning, stuff like that. I get the sense that most men pick up these skills later in life, whereas a lot of women seem to have (more of) them to begin with (I know that there are plenty of counter examples for this and that it is a generalization). I think men are less likely to care about maintaining a clean household, or “running a household,” or engaging in domestic work largely for the sake of others. In some cultures, it even seems like children themselves contribute more domestic work (and/or childcare) than men do. Maybe domestic work isn’t all that important to creating a good family environment. Maybe it is.&nbsp;</p><p>In terms of childcare, I think men can be great, imaginative caretakers, but that on average first time fathers have much less experience with babies and children than first time mothers (again, I’m sure there are many counter examples out there, but I am talking about averages). I also believe that men tend to be more risk taking than women, and that this can manifest in their child care. In some cases, letting children take more risks might be good developmentally speaking. In other cases, not so much. If women perceive men as both a) less skilled or experienced caretakers and/or b) more risk taking, then they may be disinclined to hand the babies over. (Again, speaking in generalizations, I know there are dads out there who are very nervous / careful / risk averse / protective.)</p><p>Some larger things underlying sex differences in domestic skills and/or caretaking skills might be developmental differences or cognitive differences (chemical changes caused by gestation?) or differences in empathy. There seems to be a question of nature and nurture here that is very controversial and hard to address. Are males or females innately better caregivers or domestic workers? Or are socialization and culture fully responsible for any of these differences?</p>", "parentCommentId": "Z7owQeYXMvXL2zgBi", "user": {"username": "emmakat1998 "}}, {"_id": "FN9seYYFWF3mYpBRH", "postedAt": "2022-09-27T20:52:49.568Z", "postId": "PxwdLvYA8HvRkWXnH", "htmlBody": "<p>For men reading this and thinking \"I want to be an equal partner in raising kids, but I know a lot of men who intellectually want this don't end up doing their share; what should I do\", you might be interested in my <a href=\"https://www.jefftk.com/p/equal-parenting-advice-for-dads\">Equal Parenting Advice for Dads</a></p>\n", "parentCommentId": "9nh4Lhv7oXgrKA2MJ", "user": {"username": "Jeff_Kaufman"}}, {"_id": "NQmjumKJrX3DchzXv", "postedAt": "2022-09-27T21:01:12.840Z", "postId": "PxwdLvYA8HvRkWXnH", "htmlBody": "<blockquote>\n<p>Do you think never celebrating holidays such as Christmas or birthdays would have a strong effect on the psychological development of our children? My partner and I intend to avoid celebrating any conventional holidays, except for Halloween, and to celebrate the Solstices and Equinoxes instead.</p>\n</blockquote>\n<p>Would you be up for saying more about why you don't want to celebrate the conventional holidays? Your kids are likely going to want to celebrate the things their friends and extended family are celebrating, and unless you have a strong reason not to, might as well make them happy?</p>\n<p>For example, despite being atheists we celebrate Christmas, Easter, Hanukkah, and Passover. Not in an especially religious way, just things like dying eggs and looking for them are fun.</p>\n", "parentCommentId": "RBSZJPSoMTniR2Qzd", "user": {"username": "Jeff_Kaufman"}}, {"_id": "DiXeBbfuNxZPbgMtS", "postedAt": "2022-09-27T22:06:49.205Z", "postId": "PxwdLvYA8HvRkWXnH", "htmlBody": "<p>Yes. I also strongly recommend the book <a href=\"https://www.amazon.com/Expecting-Better-Conventional-Pregnancy-Wrong/dp/0143125702/\">Expecting Better</a>; Emily Oster is an economist who takes an unusually skeptical, evidence-based approach to parenting research and advice.</p>", "parentCommentId": "vX8YaS9CtMrYBgr6r", "user": {"username": "geoffreymiller"}}, {"_id": "srFGgpoqmPiA3mLSs", "postedAt": "2022-09-27T23:46:26.541Z", "postId": "PxwdLvYA8HvRkWXnH", "htmlBody": "<p>Thanks for writing this!\nI appreciate this conversation.\nI think if I had been aware of your assertion that dads are typically more on the fence about having kids but still happy to have them, I would have been more excited to have kids with my partner earlier, so I especially valued that point.\nI want to reinforce your message that it’s important to think about this and maybe weight the “have kids” option more heavily than the average EA might do by default.</p>\n<p>Anecdata:\nI am a woman who planned not to have kids. I allowed for the possibility I’d change my mind, but I wanted to prioritize my career. Around 35 or 36 I started to want kids. I found that health issues meant that having kids is not an option now. I did test my fertility in my early 30s and it was normal, but things changed rapidly. I am quite heart-broken about it and expect this to be one of my greatest life regrets.</p>\n<p>If it helps anyone else, here were my reasons for changing my mind. (It wasn’t just my biological clock, though of course that was part of it):</p>\n<ul>\n<li>\n<p>I didn’t want kids because I expected to put ongoing, lifelong energy into my romantic relationship(s), career, and hobbies. I’ve always had some health issues so I didn’t expect to have surplus energy for kids. But in fact, I reached relative career stability and relationship stability by 35 and knew how to manage my health. I strongly desire personal growth. While I expect to continue to find that at work sometimes, the rate has slowed down more than I expected.  I felt a growing interest in adding another lifelong endeavor to my portfolio of projects, outside of work. I love contributing to others’ development and my hobbies are compatible with kids. Kids started looking like a great addition to life that I would have energy for. Planning for kids actually made my work and hobbies feel more fun because I was excited to teach my kids about them at home and to discover their own related or differing interests.</p>\n</li>\n<li>\n<p>The responsibility of parenthood seemed overwhelming to me. As I aged, I noticed that new responsibilities always feel overwhelming at first but that is something that can be overcome. This no longer seemed like a good reason not to parent.</p>\n</li>\n<li>\n<p>I previously worried that parenting would reduce my impact. I now think that having a large impact is uncertain anyway due to my health issues and the kind of work I do. With less certainty about my impact at scale, I actually felt more motivated to keep pushing in my job because I thought I would be working toward supporting a family.</p>\n</li>\n<li>\n<p>I previously thought kids might be boring or I might not be a very interesting or engaged parent. Seeing my nieces and nephews change over time has been really rewarding for me though and has brought a lot of happiness and engagement with my extended family. I noticed I found it really rewarding to contribute to the kids’ learning, they inspire me to create more in order to share new experiences with them, and they make familiar experiences more engaging because they interpret the world in unexpected ways. I find myself very engaged in supporting and discovering who these people will become as they grow up!</p>\n</li>\n<li>\n<p>I worried I’d lose my individual agency and identity to motherhood.  It is definitely true that I’m less focused on my own needs and wants when I’m around kids, so this is a real risk. However, my attitude changed about motherhood: having kids means creating new agents, and then (ideally) supporting them in becoming independent. I felt excited about taking on the goal of being a role model of agency to my kid(s).</p>\n</li>\n<li>\n<p>As I age, I value stability more than I used to.  I saw that my social life and community would be more stable if I had kids. When I was planning to be child-free, I planned to build a community of close friends instead of a nuclear family. My partner and I both thought we’d pursue a variety of potentially high-risk work projects as well. A lot of EAs probably want the same in their twenties and some do pull it off! I’ve become less extroverted, less social, and more risk averse with age, however, which makes pulling that off less likely.</p>\n</li>\n<li>\n<p>I underestimated how hard stable community is to maintain in the US. I underestimated just how much of US culture pushes against non-nuclear family structures and how much that’s still  true even in an unconventional community like EA. I’m the US, so much of society is organized around the atomized nuclear family that it is really much harder than I expected to buck the trend. In my circles, parents+kids create the bulk of social connections outside of work and generate a lot of common experiences, especially in secular communities. Even among my poly+EA+queer friends (where innovating around family is expected), it’s most common for people to make long-term plans that default to a nesting partner and/or kids, rather than making long-term plans with multiple partners or friends.  My EA friends are also globalists who move to different states or countries fairly frequently. Those with kids tend to stay in one place more often.</p>\n</li>\n<li>\n<p>I also overestimated how much I would <em>personally</em> feel motivated to buck nuclear family norms. I’m not as interested in that as I expected to be! In my 20s, I was happy with innovating on various family and friend living arrangements. In my mid-30s, I find I’d prefer to be able to focus on work, health, and home a lot of the time, but I’d like to do that without being (a) lonely or (b) needing to deal with a lot of roommate turnover. While I have a fairly stable, small peer group of late 20-40yos who I care about a lot, we don’t want to live together and we have ended up living in different neighborhoods or cities for a variety of reasons. Everyone is busy and we don’t see each other as much as we did pre-COVID.</p>\n</li>\n</ul>\n<p><em>COVID and working from home has made the world even more atomized! It’s extra valuable to live with loved ones now.</em></p>\n<ul>\n<li>I currently prefer to spend most of my downtime with a small, consistent, core set of people. My 20s were focused on meeting new people. Now, I’d like to go through the daily ups and downs of life with an established core set of people, and keep doing that for a couple decades+. Raising kids through various life stages with my partner and extended family would have produced that dynamic, and likely attracted friends who valued stability as well.</li>\n</ul>\n<p>-In sum: US EAs who are pinning their hopes on stable, non-nuclear family structures maybe should expect it to be harder to coordinate that than you think. (This may also apply in most western countries; I just know the US context best).</p>\n<ul>\n<li>\n<p>I know there are EA group houses in a few cities now, and that’s great! In my 20s, I predicted that I’d love that. I don’t want to have very many roommates anymore though. I value privacy and, again, stability more than I used to. I also want more separation between my home life and work life than I can get when I’m living with past/present/future EA colleagues. I think EA neighbors in a cohousing community where couples/families each have their own house, would be great. I was excited about raising my kid(s) near EA neighbors.</p>\n</li>\n<li>\n<p>All that said, if you’re positive you don’t want kids, that’s great! There are some good reasons not to have kids and people obviously create great lives without having kids. I personally expect I’d have had more long-term happiness and actually plausibly more impact as a mom. Other men and women may find they have similar thoughts to mine in their 30s, even if they don’t lean toward having kids now.</p>\n</li>\n</ul>\n", "parentCommentId": null, "user": {"username": "nananana.nananana.heyhey.anon"}}, {"_id": "wwwzsP6PJCB8LMfaF", "postedAt": "2022-09-28T00:14:36.074Z", "postId": "PxwdLvYA8HvRkWXnH", "htmlBody": "<p>On (1), another consideration you don't mention is that having kids earlier means more years of overlap with your kids and, potentially, grandkids: you'd get to see more of their lives, which is something people usually find pretty rewarding.</p>\n", "parentCommentId": "HoRd4KTa2fQJjbC6P", "user": {"username": "Jeff_Kaufman"}}, {"_id": "jKGiMCdZ74jgReswv", "postedAt": "2022-09-28T00:30:48.706Z", "postId": "PxwdLvYA8HvRkWXnH", "htmlBody": "<p>One confounding factor here is that the children that you might potentially adopt are pretty different from the children you might have biologically. Most adoptees have gone through some form of trauma, they are rarely newborns, they often had worse prenatal environments, their biological parents probably wouldn't enjoy the forum, etc.</p>\n<p>I think if somehow one of my children had been swapped at birth with a child from similar parents it probably wouldn't have much of an impact on what raising them would be like, but that's not really what we're talking about?</p>\n<p>(I do also think it's cute the various more specific ways our kids resemble us, but I agree this is not a major contribution to the experience of parenting.)</p>\n", "parentCommentId": "ychHYoZCtGcs6baS6", "user": {"username": "Jeff_Kaufman"}}, {"_id": "Tii4MeskcqQuWJXAv", "postedAt": "2022-09-28T00:31:32.983Z", "postId": "PxwdLvYA8HvRkWXnH", "htmlBody": "<p>Looks like your last sentence got cut off. I mentioned it briefly in my first comment, but cohousing seems to be growing in popularity as an antidote for the lack of systemic support in the nuclear family and also for people who are just generally interested in living in a more connected and cooperative environment with a chosen family. Here are some interesting links including Atlantic articles (paywalled after reading two for free) and the website for the Foundation for Intentional Community:&nbsp;</p><p><a href=\"https://www.ic.org\">https://www.ic.org</a>&nbsp;</p><p><a href=\"https://www.theatlantic.com/magazine/archive/2020/03/the-nuclear-family-was-a-mistake/605536/\">https://www.theatlantic.com/magazine/archive/2020/03/the-nuclear-family-was-a-mistake/605536/</a>&nbsp;</p><p><a href=\"https://www.theatlantic.com/family/archive/2020/01/generation-x-women-are-facing-caregiving-crisis/604510/\">https://www.theatlantic.com/family/archive/2020/01/generation-x-women-are-facing-caregiving-crisis/604510/</a>&nbsp;</p><p><a href=\"https://www.theatlantic.com/business/archive/2016/09/millennial-housing-communal-living-middle-ages/501467/\">https://www.theatlantic.com/business/archive/2016/09/millennial-housing-communal-living-middle-ages/501467/</a></p>", "parentCommentId": "srFGgpoqmPiA3mLSs", "user": {"username": "emmakat1998 "}}, {"_id": "GP5SDuLedxWHgiGG9", "postedAt": "2022-09-28T00:33:44.584Z", "postId": "PxwdLvYA8HvRkWXnH", "htmlBody": "<blockquote>\n<p>do you think there is a  good pronatalist argument to be made that an EA that doesn't feel like they want kids should still regardless have kids?</p>\n</blockquote>\n<p>I don't think anyone who doesn't want to have kids should have them. It's a huge amount of work, and if you're not excited about it it seems likely to make you miserable.</p>\n", "parentCommentId": "wDyYJteunWfn2bhje", "user": {"username": "Jeff_Kaufman"}}, {"_id": "eJyezgeBqiXx2pB6t", "postedAt": "2022-09-28T01:55:18.968Z", "postId": "PxwdLvYA8HvRkWXnH", "htmlBody": "<blockquote><p>they are rarely newborns</p></blockquote><p>I think this is slightly overstating things - I'm not sure of the numbers as the statistics I've found online seem inconsistant, but it looks like the majority of private adoptions, and &gt;10% of all adoptions, are newborns.</p>", "parentCommentId": "jKGiMCdZ74jgReswv", "user": {"username": "Larks"}}, {"_id": "4SSrjN5D6QQ3ntLA4", "postedAt": "2022-09-28T02:14:39.936Z", "postId": "PxwdLvYA8HvRkWXnH", "htmlBody": "<blockquote><p>if you're not excited about it it seems likely to make you miserable.</p></blockquote><p>I'm not sure the data really supports this view. People are pretty good at adapting, and a lot of men in particular seem to become far more excited about their kids after they are born than they expected to be ahead of time.&nbsp;</p><p>As an extreme example, <a href=\"https://pubmed.ncbi.nlm.nih.gov/33309441/\">the recent Turnaround study</a> investigated the impact of abortion denial on expectant mothers. While there were other negative consequences, involuntary motherhood does not appear to have made women miserable:</p><blockquote><p>However, women did not suffer lasting mental health consequences, prompting questions about the effects of denial on women's emotions. ... Subsequent positive life events and bonding with the child also led to positive retrospective evaluations of the denial.</p></blockquote><p>If even people in such an extreme situation can adjust then I suspect people who are merely 'not excited' can also.</p>", "parentCommentId": "GP5SDuLedxWHgiGG9", "user": {"username": "Larks"}}, {"_id": "YhzvXETtXqzRi8zqP", "postedAt": "2022-09-28T02:29:01.643Z", "postId": "PxwdLvYA8HvRkWXnH", "htmlBody": "<p>My two cents on a couple of these from the perspective of a father of two girls (4 years old and 2 years old, I'm 30). Just my perspective, feel free to disregard if not helpful!</p><p>On emotions and discipline, I'm also a very calm person and rarely show anger and frustration. But kids are really good at finding was to frustrate you. I almost never yell at them, but I do get frustrated or exasperated and raise my voice, and it's genuinely unclear to me how anyone could parent a child without doing that.</p><p>In general I think the military wisdom \"no plan survives first contact with the enemy\" is a good rule of thumb for parenting, except substitute \"the enemy\" with \"these small lunatics I never imagined I could love so much.\" My wife and I had bold plans for how we would parent, how we would minimize screen time, how our children would eat healthy foods all the time, and so on. But a lot of that goes out the window when you're tired and have chores to do and the kids won't give you an inch of personal space or you need to make a quick dinner or one kid is potty training and needs near constant attention but your other kid is bored and also wants attention or whatever. We also know other parents who had big plans about how they would parent, and in the end made many compromises.</p><p>All that is to say that I think it's good that you're thinking about how you want to parent. Maybe you'll have more luck than I did sticking to your original plans. And maybe it's good to start with ambitious initial plans, that way if you deviate from them you're still mostly on track, I'm not sure. But I would just advise that I think a key part of parenting is flexibility and prioritizing which values you care about. If you let your three year old watch a TV show a few times a week so you can have some time to get the dishes done or get dinner made, how harmful is that really? If that helps you de-stress a little and leads to less exasperation it may be beneficial on net. Kids differ a lot in personalities and attitudes (it was surprising to me how different my kids can be), so the compromises you need to make may vary depending on what your kid is like, and I think it can help to be mindful of that going in.</p><p>On developing curiosity and wonder I think just sharing fascinating things with your kids whenever possible seems to work well. Sometimes I share something and I can tell my four year old isn't really interested or maybe doesn't understand, and that's fine. But other times I'll show her something cool I can tell she's echoing my excitement and interest in it and asking surprisingly thoughtful questions. I think the big thing is just sharing your excitement about it and trying to include your kid in it. In general making time to share your interests seems to work well, recently I've been watching football with my oldest and explaining the rules and how it works, and even though I don't think she fully understands it she seems to be really enjoying it and picking up a lot of stuff, and I think that's mainly just because she knows I'm trying to include her in it. The same thing happens when I show her pictures from the James Webb space telescope or show her videos of rocket launches or SpaceX landing their boosters or whatever and make the time to explain why I think it's so awesome.</p>", "parentCommentId": "RBSZJPSoMTniR2Qzd", "user": {"username": "Ryan Beck"}}, {"_id": "u67pKyzwxzkTpbmNS", "postedAt": "2022-09-28T03:48:41.532Z", "postId": "PxwdLvYA8HvRkWXnH", "htmlBody": "<p>Another thing is just I wonder: if a strong enough pronatalist argument was presented to me maybe that in itself would make me excited enough to have kids. I do adapt enthusiastically to EA arguments telling me to donate here vs there, to change my career etc. Though naturally, sometimes I adapt with resistance and begrudgingly. I wonder if there is some pronatalist argument I haven't heard that will firmly slot me into the former group where I adapt enthusiastically.</p><p>But as you point out, maybe I don't even need to stress too much about merely being 'not excited' if a good enough pronatalist argument convinces me I should have kids. This is something I'd love to get feedback on from EAs who have kids (and I can think of zero EAs in my social circle that have kids). Jeff Kaufman, do you have kids of your own that makes you more confident in your statement?<br><br>(meta-note: I don't know if it is possible to tag someone in a comment to notify them they have been mentioned)</p>", "parentCommentId": "4SSrjN5D6QQ3ntLA4", "user": {"username": "Cornelis Dirk Haupt"}}, {"_id": "4fwuRAXaXsrDZSjrj", "postedAt": "2022-09-28T06:15:37.520Z", "postId": "PxwdLvYA8HvRkWXnH", "htmlBody": "<p>Thanks! I’ve edited my comment substantially. I’ll have a look at these resources.</p>\n", "parentCommentId": "Tii4MeskcqQuWJXAv", "user": {"username": "nananana.nananana.heyhey.anon"}}, {"_id": "7WSwxyWv3yitQAEmZ", "postedAt": "2022-09-28T18:47:31.341Z", "postId": "PxwdLvYA8HvRkWXnH", "htmlBody": "<p>Wei_Dai: I worried somewhat about how to influence my kids' peer group and exposure to ideas.&nbsp;</p><p>But I was reassured by a lot of behavior genetics research that parents and peers don't matter nearly as much as we think they do, in the long run. Kids' personality traits, cognitive traits, values, and interests often drive their choices of friends, peer groups, books, and media.</p><p>For example, independent of my influence, my older daughter when she was 14 was curious about global poverty, started reading Peter Singer books, learned about animal ethics, and spontaneously turned vegan, and has stayed vegan in the decade since then. If I'd tried to nudge her into veganism, she might have rebelled.&nbsp;</p><p>Having said that, I do think choice of school can be important for a kids' peer group -- the better and more selective the school, the more likely a smart, curious kid will find like-minded kids, and feel happy and socially fulfilled. This can be extremely important in avoiding teenage depression and alienation.</p><p>I'll try to read your posts soon; thanks for the links!</p>", "parentCommentId": "Y8giM5utnQFXsZNJZ", "user": {"username": "geoffreymiller"}}, {"_id": "6aLncXzseucxW7kdM", "postedAt": "2022-09-28T18:51:34.495Z", "postId": "PxwdLvYA8HvRkWXnH", "htmlBody": "<p>Jeff -- yes! I think that effect is actually more important than the concerns that people often have about whether they'll be too tired to be good parents in their 40s or 50s. &nbsp;If people stay in good physical shape, it's honestly not that hard to have the energy for parenting in middle age (speaking as a 57-year-old with a baby).&nbsp;</p><p>However, I'll be 75 when my baby graduates high school, and maybe 83 by the time she has kids of her own.</p><p>Hopefully longevity interventions and regenerative medicine will help us all live long enough to meet our great-great-great-grandkids. But until then, having kids younger means you'll get to spend a much higher proportion of life enjoying their company, and being around for future grandkids.</p>", "parentCommentId": "wwwzsP6PJCB8LMfaF", "user": {"username": "geoffreymiller"}}, {"_id": "Jp4Rw4WbvGDMmBT7d", "postedAt": "2022-09-28T18:55:59.005Z", "postId": "PxwdLvYA8HvRkWXnH", "htmlBody": "<p>Jeff -- I agree. I think there are lots of design features of these traditional holidays that look irrational, outdated, and silly from an adult's point of view, but that suddenly make sense when you have kids enjoying them.&nbsp;</p><p>Kids seem to have a deep hunger for 'special times', holidays, and celebrations, when the normal routines are set aside, and parents make special efforts to interact with extended family, neighbors, and friends, and when there are special foods, feasts, activities, and gift-giving. My speculation is that in hunter-gatherer times, collective feasts and holidays sent kids reliable cues that 'things are going well with our tribe', and kids like that. If kids are deprived of these special times, they might implicitly get cues that 'our tribe is poor, failing, under threat, and not likely to last very long', which could make them anxious and sad.</p>", "parentCommentId": "NQmjumKJrX3DchzXv", "user": {"username": "geoffreymiller"}}, {"_id": "DBFA2FfAC4vR4QbcC", "postedAt": "2022-09-28T19:03:29.951Z", "postId": "PxwdLvYA8HvRkWXnH", "htmlBody": "<p>Cornelis -- from my evolutionary psychologist perspective, a big difference between becoming a parent and becoming a super-generous donor, is that we've evolved for 70 million years to be good mammalian mothers, and for about 3 million years to be good, high-investing, hominid fathers. So there are many evolved adaptations for parenting just waiting to get switched on after kids arrive, that make parenting feel generally rewarding. (Likewise, kids evolved to be cute, charming, and interesting to their parents, so it's a coevolutionary interaction.)</p><p>The basic problem is that with contraception, we're not in a situation where kids just start popping out after we start falling in love and having sex, so many young people don't have the experience of feeling their parental adaptations get activated automatically by kids arriving. So there were quite limited selection pressures to 'want kids' before kids arrived.</p>", "parentCommentId": "u67pKyzwxzkTpbmNS", "user": {"username": "geoffreymiller"}}, {"_id": "z6tL7YrJBJjuPceHQ", "postedAt": "2022-09-28T19:40:04.791Z", "postId": "PxwdLvYA8HvRkWXnH", "htmlBody": "<blockquote>\n<p>Jeff Kaufman, do you have kids of your own that makes you more confident in your statement?</p>\n</blockquote>\n<p>Three kids: 8y, 6y, and 15m</p>\n<blockquote>\n<p>I don't know if it is possible to tag someone in a comment to notify them they have been mentioned</p>\n</blockquote>\n<p>Happened to see it ;)</p>\n", "parentCommentId": "u67pKyzwxzkTpbmNS", "user": {"username": "Jeff_Kaufman"}}, {"_id": "GFeWjZESLJaKJ9MG6", "postedAt": "2022-09-28T20:12:07.092Z", "postId": "PxwdLvYA8HvRkWXnH", "htmlBody": "<p>purplefern -- I'll write separate replies for each of your questions, so any further comments by others on my comments can be fairly well-focused.</p><p>Regarding optimal age and timing, and career/health tradeoffs:</p><p>For a woman, the main age concerns regarding health, I think, are (1) likelihood of being able to get pregnant declines fairly strongly during the 30s (but there are very big individual differences in this rate), (2) likelihood of baby having genetic defects (eg Down syndrome) increases fairly quickly in the late 30s and 40s (but implications of this depend heavily on whether a woman is willing to use genetic screening and abortion as quality control.)</p><p>For issue (1), I think it makes sense for women to get their <a href=\"https://my.clevelandclinic.org/health/diagnostics/22681-anti-mullerian-hormone-test\">AMH </a>(anti-Mullerian hormone) levels checked regularly from their late 20s onwards. This is absolutely crucial in predicting how much longer one's likely to remain fertile -- it's a test of 'ovarian reserve'. AMH seems to be a stronger predictor of a woman's remaining fertility than her chronological age is. &nbsp;(In many countries, you can get an over-the-counter on in-lab <a href=\"https://www.findlabtest.com/lab-test/fertility-test/anti-m%C3%BCllerian-hormone-amh-endocrine-sciences-labcorp-500183\">AMH test</a> for about $100-200 that just requires a finger prick or blood draw.) &nbsp;It's also very helpful to know when one's mother, older sisters, or female relatives reached menopause. To risk-hedge, it can be helpful for women to freeze some eggs and/or embryos by age 30-35, which could use later by the woman herself or by a surrogate.</p><p>Likewise, for men, I think it can make sense to get sperm &nbsp;checked with a lab semen analysis (typically less than $200), to assess semen volume, and sperm count, &nbsp;vitality, motility, and morphology.&nbsp;</p><p>It baffles me that many smart young men and women who invest hundreds of hours into planning their work career won't spend a few hours getting the crucial tests that would allow much more accurate planning of their reproductive career.</p><p>Overall, I think the optimal time to start having kids depends much more on one's romantic partnership situation than on one's education/career. If you've found an excellent mate who's compatible, committed, reliable, pro-child, and likely to be at last moderately successful and financially stable, then the best time might be right after marriage, whenever that is. (Having a kid with someone, without the many legal protections of formal marriage -- protections which seem silly and outdated until the point when you really, really need them -- is &nbsp;foolish and often regretted, IMHO.)&nbsp;</p><p>I'm most familiar with the academic situation when smart young women are trying to decide whether to have kids in grad school, or after they get tenure -- they assume that the 6 years of intense tenure-track work as an assistant professor will make pregnancy impossible then. I think that is a very misguided way to think about it, for a few reasons (1) most universities are actually very generous with parental leave for faculty, and you can pause the 'tenure clock' multiple times before going up for tenure, (2) professors aren't actually that much less busy after tenure than before, (3) realistically, in the current job market, most people who get PhDs in most fields will never get a tenure-track job, so there's a huge danger that women get stuck in 'post-doc limbo' for several years in their late 20s and early 30s, then don't get a tenure-track job until their early/mid 30s, then don't get tenure until their early 40s... and then it might be too late to have kids. There might be analogous issues in other fields such as medicine, law, finance, etc.</p>", "parentCommentId": "HoRd4KTa2fQJjbC6P", "user": {"username": "geoffreymiller"}}, {"_id": "GcEEJf7ydhFQnAuu3", "postedAt": "2022-09-28T20:24:54.784Z", "postId": "PxwdLvYA8HvRkWXnH", "htmlBody": "<p>Thanks for a very valuable, thoughtful, and insightful comment. I agree with almost all of it, and I appreciate your effort in turning a painful personal disappointment into some specific and useful advice for others.</p><p>I especially appreciated your points about the strong cultural forces (e.g. in US, UK, etc) that make the single-house nuclear family arrangement very hard to escape over the long term -- no matter how expert one is at living in EA group houses, polycules, or other coliving arrangements.&nbsp;</p><p>Ideally, it would be possible for EAs (or people in any like-minded subculture) to set up their own neighborhoods or streets, with a dozen or so houses, restricted to people who share their values and life-goals. But that kind of 'freedom of association' is not actually legal in most countries (it would violate &nbsp;various anti-discrimination laws). And trying to do coliving on a smaller scale within a single property raises very thorny problems in terms of the home ownership, shared equity, and what happens if couples get divorced or inhabitants get into too much conflict.&nbsp;</p><p>Like it or not, the single-family nuclear house seems a pretty strong 'focal point' in the space of possible living arrangements, especially for parents with kids (and maybe elderly parents), and especially given the current economic, legal, and cultural context.</p>", "parentCommentId": "srFGgpoqmPiA3mLSs", "user": {"username": "geoffreymiller"}}, {"_id": "eoXaxqBeAsnenY9Wi", "postedAt": "2022-09-28T20:42:53.139Z", "postId": "PxwdLvYA8HvRkWXnH", "htmlBody": "<p>purplefern -- regarding your question (2) about parental investment, and your follow-up comment above:</p><p>As an evolutionary psychologist, I tend to take a rather biological view of sex differences, and I think this can be quite helpful in thinking about sexual divisions of labor in parenting. This is not to say that people should pursue a 1950s-style male breadwinner/female housewife model in the 2020s.</p><p>Rather, it's to say that people should learn about the deep evolutionary history of sexual selection and parental investment, the sexual divisions of labor typically found in hunter-gatherer, pastoralist, and agricultural societies, the recent historical changes in parental care patterns, etc. This helps put any negotiations between modern moms and dads in a much more realistic, grounded context.</p><p>One key insight I got from evolutionary biology is that female mammals have evolved for about 70 million years to be very high-investing parents, in terms of gestation (pregnancy), lactation (breast-feeding), foraging (finding and preparing food for offspring), and general maternal care. Whereas, male mammals are typically focused on mating rather than parenting, and typically do either zero parental care, or very minimal protection against infanticide by other males. Human males are extremely unusual in having evolved much more intensive parental care, but this happened only in the last 2-3 million years or so, and it mostly involved increased effort in hunting, protecting the kids and family from rivals within the tribe, protecting the tribe from other tribes, and doing some care-taking and teaching of kids, especially in middle childhood (ages 6-12, roughly) and adolescence (ages 12-18).&nbsp;</p><p>So, from the viewpoint of a modern woman who doesn't appreciate the evolutionary history, it might be frustrating that a man is doing only 40% of the child care instead of 50%. Whereas any other female mammal might feel incredibly envious that a human male is doing 40% rather than 0% as in her own species. This is not to say that a mom shouldn't try to negotiate with the dad to do 50%. It's just to offer some context for why these imbalances often emerge.</p><p>In general, a frequent failure mode for busy couples with kids is that the mom and dad each feel like they're doing much more than their partner, because their own contributions are more salient to them. &nbsp;I think it's important for couples to switch duties and roles enough that they can cover for each other in emergencies, and so they have a full and salient appreciation of what each of them are doing day-to-day for their kids.</p>", "parentCommentId": "L84JaNsFTiqMmjBJy", "user": {"username": "geoffreymiller"}}, {"_id": "gEd5oE6tsShYAhoMd", "postedAt": "2022-09-29T10:34:56.530Z", "postId": "PxwdLvYA8HvRkWXnH", "htmlBody": "<p>It's not a question but just thought it'd be nice to share the perspective of somebody who decided not to have children. &nbsp;Always nice to showcase a wide range of views and decisions. Here's an excerpt from my interview with Julia Wise about it. Can read the whole thing <a href=\"https://juliawise.net/interview-with-kat-woods-decision-making-about-having-kids/\">here</a>.</p><p>\"I super, super wanted kids. I didn’t want kids when I was younger, and then when I was about 20 I was in the park, minding my own business and a little toddler toddled up to me and he gave me this bent daisy. And my brain exploded! I was like, “Oh my God, I need babies now.”</p><p>I just became absolutely obsessed. EA was my number one priority, and the next one was kids. I actually had a blog about parenting. I was reading all these books about it, reading studies and figuring out exactly how to deal with pregnancy and everything. I’d sit out outside of playgrounds and do my homework next to the playground so I could watch the kids play, just be around them.&nbsp;</p><p>Then I was like: impact. I decided that I wasn’t going to have kids because of impact. And that was the worst. For the longest time, this was the closest I ever felt to giving up because I just felt so resentful.</p><p>Every time I saw a kid, I just felt so horrible. I was like, why the fuck am I doing this? I don’t even know if anything’s working. And this is so important to me.<br><br><i>Julia: What kind of effects were you thinking about on your impact?</i></p><p>Kat: The main thing is just time and energy. Basically every spare amount of energy I had was going towards impact. So there was no room for kids. Any extra thing that I took on as a responsibility, it was definitely just going to have to come from the “helping the world” budget.&nbsp;</p><p>Then I just felt bad all the time. The thing that made me realize that I would actually have kids was realizing: I just have to have one willpower break. I just have to have a willpower break long enough to have a kid, and then it’s over. Then I was like, well, I’m probably going to have the willpower break anyway, so might as well just plan accordingly.</p><h2><strong>Goal factoring and practical experience</strong></h2><p>Kat: So then me and my husband at the time were planning on having kids. But it was never the right time. I thought, maybe I’ll do the <a href=\"https://www.lesswrong.com/tag/goal-factoring\">goal factoring</a>. I came up with this spreadsheet. I came up with a whole bunch of different options that you could do. I basically broke down, what are the things I want about children and what are the things that [my partner] wants about children? Because those are different. And then I came up with a whole bunch of like alternatives. Like what about a dog? What about fostering? Volunteering a lot with kids? All sorts of stuff. And that was to tide me over until we could have kids, and maybe find something that didn’t require as much time investment.&nbsp;</p><p>Then we stumbled on babysitting. Oh man, I get to spend time with the kids and develop this relationship with them. But also I get paid for it. Amazing!</p><p>I babysat three separate sets of kids, and they were all perfectly ordinary kids. They were not kids with behavior problems or anything like that. But that was enough for me to realize: oh, I do <i>not</i> want to be a parent. I do not want children at all.&nbsp;</p><p>I’d had experience with kids before. I’d been a summer camp leader. I’d worked with 30 plus kids at a time for a whole summer, that sort of stuff. And I loved it, but what I realized when I babysat was that I was just the fun summer camp leader. I went and played games with them, and it’s fun to play with kids. Playing with kids is the best.&nbsp;</p><p>But putting them to bed? Holy shit. Why is it so hard!? I’d read all the books and I was like, oh, I’ll appeal to intrinsic motivation and reason. Nope, does not work. Very quickly I ended up bribing them. I was like, I will give you candy if you go to bed, please.</p><p>Two things that happened:</p><p>The kid who I babysat the most, the first day I came, he was like, let’s make potions. I was like, yeah, let’s make potions! It’s really fun. The next time I came, he’s like, let’s make potions. I was like, oh, we made potions last time. How about we do something different? He’s like “POTIONS!” Okay, fine. And then it was potions again. And potions again. And I was like, wow, this was fun the first time. And now this is really irritating. I just can’t convince him to do anything else.&nbsp;</p><p>The other thing was one time I was there when his mom was still there and he was eating some cereal at the table. He’s five, right? and he had said something that was kind of racist or sexist, I forget what it was.&nbsp;</p><p>And the mom was just perfect. She had clearly read all the parenting books, and she just responded in the most perfect way. She gave this great speech about how to think about it.</p><p>And I was like, wow, you gave a really good metaphor there, this is so inspiring, you’re such a good mom!&nbsp;</p><p>And the kid just looked up and was like, “Mom, I want more sugar.” He didn’t care at all. He was not listening. He just wanted more dopamine.&nbsp;</p><p>I was like, ah, it’s just so destroying.</p><p>I want to be that sort of mom. I want to impart important wisdom and stuff. Obviously I’m sure eventually he’s going to grow up to not be bad or anything. He’s just five and it takes time. But argh!</p><p>So then I ended up not wanting kids at all — I totally switched. It went from my system one was like, “I want kids,” but my system two was like, “I don’t want them,” to now both of them are in complete agreement.&nbsp;</p><p>I still like playing with kids. Occasionally I’ll get this little twinge, like, aw, they’re so cute. But just give it five minutes. Almost always within five minutes, they’ll do something really annoying. And I’ll be like: ah yes, this is why I don’t want them.&nbsp;</p><p>I think the lesson from this that I took away is that before you have kids, it’s really good to get some babysitting experience. It’s a really good way to cheaply test being as close to being a parent as you can be without actually being a parent, that’s pretty available to most people. Once you have them, you can’t go back, there’s no “I’ve changed my mind.”\"</p><p>Full post <a href=\"https://juliawise.net/interview-with-kat-woods-decision-making-about-having-kids/\">here</a>. Also Jeff wrote about why he disagrees with my conclusions <a href=\"https://www.jefftk.com/p/babysitting-as-parenting-trial?fbclid=IwAR3XmBCp8_WokN46Sc2T8EH0ZkSIBMkOlsa0x2fntycdihHovOkqedfSFpw\">here.</a></p><p>And thanks for posting this AMA! Such a useful thing for the community.&nbsp;</p>", "parentCommentId": null, "user": {"username": "katherinesavoie"}}, {"_id": "QLiYsJcjiGT5pWh2m", "postedAt": "2022-09-29T11:49:54.556Z", "postId": "PxwdLvYA8HvRkWXnH", "htmlBody": "<p>I think it's \"mostly avoidable\" in the sense that you can avoid the majority of it, but for most parents and kids not in the sense that you can get it down to nothing?</p>\n<p>If you are not thoughtful about it you can end up in a place where both parents have sleep that is massively disrupted, at which point it becomes pretty hard to actually address the problem because you're so tired and thinking so poorly.</p>\n<p>Important components in avoiding sleep deprivation:</p>\n<ul>\n<li>\n<p>As Geoffrey says above, sleep training once they're old enough</p>\n</li>\n<li>\n<p>Automate baby soothing with a Snoo: <a href=\"https://www.jefftk.com/p/to-the-robobassinet-and-progress\">https://www.jefftk.com/p/to-the-robobassinet-and-progress</a> (possibly knock offs are good and cheap now, haven't checked in a year and a half)</p>\n</li>\n<li>\n<p>Set things up so that only one parent at a time is going to be woken up by baby cries: <a href=\"https://www.jefftk.com/p/baby-sleep-multiple-rooms\">https://www.jefftk.com/p/baby-sleep-multiple-rooms</a></p>\n</li>\n</ul>\n", "parentCommentId": "CTM4Q42aZxZyCbfux", "user": {"username": "Jeff_Kaufman"}}, {"_id": "ErdX25LDEP5Q68nyo", "postedAt": "2022-09-29T16:11:28.262Z", "postId": "PxwdLvYA8HvRkWXnH", "htmlBody": "<p>Kat - thanks very much for this detailed and helpful comment.</p><p>I think you exemplify the kind of decision strategy I'm urging EAs to use in figuring out whether to have kids: treat it as a serious, high-stakes research project, gather a lot of diverse data, insights, and experiences, consider the fit to one's own life-goals and personality traits, consult with others who have done it (and not done it), consider best-case, worst-case, and likely median outcomes, etc.&nbsp;</p><p>Often, the answer will be 'I should have kids', but often the answer will be 'nope'.&nbsp;</p><p>Also thanks for linking to your full post, and to Jeff Kaufman's reply, which I largely agree with his comments, which I'll expand upon here. IMHO, three big ways that 'babysitting as a parenting trial' doesn't quite work are that</p><p>(1) it feels qualitatively different to care for one's own biological children than other people's kids, partly because your own kids will be more genetically and phenotypically similar to you (not just in appearance, but in personality and cognitive traits, quirks, preferences, values, etc) than unrelated kids are, partly because your kids will also resemble whatever lover/spouse/partner you scrambled your genes with, and partly because the process of becoming a parent (being pregnant, giving birth, bonding with baby) activates a whole suite of evolved adaptations for parenting that depend on complex hormonal, epigenetic, and maturation pathways that basically rewire one's brain from non-parent mode into parent mode.</p><p>(2) babysitters don't have nearly as much authority and autonomy as parents in determining a kid's daily routine, schedule, feeding, clothing, discipline strategies, training strategies, household setup, etc., so parenting offers much broader scope for deciding over the longer term how to arrange one's life to optimize child care</p><p>(3) child care has a difficult and frustrating learning curve, so the first few hours (of first few hundreds of hours) of child care as a beginner aren't representative of how one can do child care as an expert (which most parents become by the time their kids are toddlers). Think of all the things you hated at first as a newbie, but learned to love. For example, the first two days of learning to ski or snowboard absolutely suck. You fall over a lot, it's awkward and scary, your muscles get exhausted, you get cold and wet, you can't pay attention to anything fun or scenic about the experience. But then skiing gets awesome from about days three onwards, and you suddenly understand why so many people enjoy it. Same with the first few experiences of public speaking, or the first few dates, or dances, or posts on EA Forum. It can be quite hard to predict how expert-level performance will feel from a few hours of beginner-level experience. (Not that this applies to Kat, who has a lot of babysitting experience; it's more of a cautionary point for EAs who think 'I'll just try babysitting my niece for a couple of hours are use that experience to update my probability of having kids.')</p><p>Another factor I haven't mentioned elsewhere is the issue of giving one's parents grandkids. I grew up in a very pronatalist family; my grandparents had 12 kids, and I have 30 cousins. I always felt a very strong traditionalist, almost deontological imperative to give my own parents grand-kids that they could enjoy, and not to let their bloodline die out with me. I figured, they'd made huge sacrifices to raise me, and I had a moral duty to them to have some kids of my own.&nbsp;</p><p>That might sound weird to some EAs, but think of it an analogous to an AI alignment problem. My parents invested a lot in creating and training me as a little AGI, partly (from an evolutionary perspective) so that I could create and train my own little AGIs in turn. They tried to train me as a good future parent, who had pronatalist values. If I'd decided not to have kids, that would represent a catastrophic alignment failure, from their point of view. And I felt, as a good AGI who felt some moral obligation to my creators, that I shouldn't just drift away from their values -- including the crucial value of becoming grandparents. Of course, in modern societies there's often a strong taboo against parents of adult kids putting much pressure on their kids to produce grandkids. But very few parents of adult kids will be delighted if their kids say 'Sorry, mom and dad, maximizing total future sentient utility in the cosmic light-cone is more important to me than continuing your bloodlines or letting you ever enjoy playing with grandkids'.&nbsp;</p><p>This doesn't mean that one's parents reproductive priorities should always over-ride one's own rational goals. But it does suggest that talking with one's parents (and siblings, and other family stakeholders) might be wise in deciding about the issue of having kids. Some parents might truly not care about grandkids (although this is probably quite rare); some might care a lot, and might suffer bitter, permanent disappointment if they don't get grandkids. This is just something that's worth weighing, in terms of aggregate family utility rather than one's individual utility.</p>", "parentCommentId": "gEd5oE6tsShYAhoMd", "user": {"username": "geoffreymiller"}}, {"_id": "XdT5hPu4Kme9iesiJ", "postedAt": "2022-09-29T16:26:24.095Z", "postId": "PxwdLvYA8HvRkWXnH", "htmlBody": "<p>Jeff -- I strongly endorse these suggestions.&nbsp;</p><p>The 'sleeping in separate rooms' can be extremely useful. My wife and I have very different circadian rhythms, so we find it really helpful to sleep in different bedrooms (in the context of an otherwise happy, loving, and delightful marriage.) &nbsp;We put our baby's basinet in a separate walk-in closet near one of our bedrooms, which can be made nice, dark, and cozy for daytime naps and nighttime sleep even when it's not yet dark outside. So, baby being awake for short periods in the night doesn't need to disrupt our adult sleep, and baby can get scheduled breastfeeding a couple of times a night.</p><p>By contrast, many parents of babies try to co-sleep all together in the same bedroom and even in the same bed -- I did this with my first baby long ago, and it was extremely disruptive to sleep.&nbsp;</p><p>I understand the evolutionary background that co-sleeping with babies was pretty typical for hunter-gatherers, and might be more 'natural' in some ways, but I think this might be one of those cases where the original reasons for co-sleeping -- protection from predators and parasites and infanticide, keeping baby warm enough during cold nights, etc -- might not be as relevant in modern life.</p>", "parentCommentId": "QLiYsJcjiGT5pWh2m", "user": {"username": "geoffreymiller"}}, {"_id": "xp4awMjwn9GEf9H8k", "postedAt": "2022-09-30T02:10:57.334Z", "postId": "PxwdLvYA8HvRkWXnH", "htmlBody": "<p>Expanded on this: <a href=\"https://www.jefftk.com/p/prioritizing-parental-sleep\">https://www.jefftk.com/p/prioritizing-parental-sleep</a></p>\n", "parentCommentId": "QLiYsJcjiGT5pWh2m", "user": {"username": "Jeff_Kaufman"}}, {"_id": "GSo2a9C4Ap2CHzYk5", "postedAt": "2022-10-03T09:41:36.141Z", "postId": "PxwdLvYA8HvRkWXnH", "htmlBody": "<p>I generally agree and think that babysitting shouldn't be your only source of evidence, for reasons like what you describe. Ideally, you should use a bunch of different threads of evidence, including babysitting, getting a pet, talking to parents, research, etc.&nbsp;</p><p>Unfortunately, the only way to really tell is to actually do it, but that is too costly because then there's no turning back.&nbsp;</p><p>Two things to keep in mind though:</p><p><strong>1 . Taking a pill to enjoy drudgery</strong></p><p>On the \"you'll feel differently when it's your own child\" argument. This argument feels strange to me. Imagine some sort of drudgery you hate (e.g. filing taxes or cleaning the toilet). Imagine there's a pill that makes it feel like that's the most meaningful and enjoyable thing ever, and it will make you prioritize it over your existing values and spend millions of dollars on it and tens of thousands of hours on it for the rest of your life. People who take the pill say they love it and would never go back.&nbsp;</p><p>Would you take the pill?&nbsp;</p><p>Some people might because hey, what matters is things <i>feeling</i> meaningful. I wouldn't, because I don't want to add a competing goal thread in mind to compete with my current existing values, no matter how much I'd enjoy it later. (This of course doesn't address things like the learning curve you mentioned)</p><p><strong>2. Parents give biased answers</strong></p><p>Asking parents gives you a biased view because it's hard for parents to psychologically admit that they made a mistake, let alone tell somebody about it. It would just cause too much suffering on their part and would also make them a worse parent.</p><p>And it's more common than you think. I can't find it now, but I remember a survey I read saying that ~10% of parents regretted having children, and that's definitely an understimate, because there's such social desirability bias and most people can't even admit it to themselves.</p><p>To help counter that, I recommend checking out <a href=\"https://www.reddit.com/r/regretfulparents/\">https://www.reddit.com/r/regretfulparents/</a> and watching The Letdown (a funny and as far as I can tell, decently accurate view of the downsides of being a parent).&nbsp;</p><p>Of course, look at both sides. You can also read Selfish Reasons to Have Kids and talk to parents.</p>", "parentCommentId": "ErdX25LDEP5Q68nyo", "user": {"username": "katherinesavoie"}}, {"_id": "yshF8o3oknvmXhN4P", "postedAt": "2022-10-03T10:27:45.566Z", "postId": "PxwdLvYA8HvRkWXnH", "htmlBody": "<p>Also, when it comes to having more control over the raising of the child, you need to take into account that there's a decently high probability you'll get divorced from your current partner, at which point you'll only have semi-control and have to share that with somebody who might be quite hostile to you.&nbsp;</p>", "parentCommentId": "ErdX25LDEP5Q68nyo", "user": {"username": "katherinesavoie"}}, {"_id": "SCGJPKsnpDjBNkrvL", "postedAt": "2022-10-03T15:12:46.206Z", "postId": "PxwdLvYA8HvRkWXnH", "htmlBody": "<p>There's a standard saying that 'half of all marriages end in divorce'. That's an outdated overestimate, and the divorce rate is much, much higher for people who don't graduate college, and who are pregnant/have a kid before getting married.</p><p>Among women with a college education, at least <a href=\"https://www.pewresearch.org/fact-tank/2015/12/04/education-and-marriage/\">78% of marriage last at least 20 years</a>.</p><p>This number is probably even higher if they wait til after college graduation to get married, if they aren't pregnant/have a kid before marriage, if they don't cohabit for a long time before marriage, and if they're reasonably high in agreeableness, and low in neuroticism</p>", "parentCommentId": "yshF8o3oknvmXhN4P", "user": {"username": "geoffreymiller"}}, {"_id": "hNNXG5EFoQEiZNXfv", "postedAt": "2022-10-03T15:23:22.981Z", "postId": "PxwdLvYA8HvRkWXnH", "htmlBody": "<p>Kat - these are both fair points. But they do cut both ways....</p><p>Taking a pill to avoid being miserable while doing drudgery sounds quite self-manipulative and self-deceptive. But the epigenetic, hormonal, and neural maturation that happens with having kids is <i>somewhat</i> analogous to the changes that happen with puberty.&nbsp;</p><p>Imagine going through puberty was not the default, but was voluntary and based on taking a pill. If a 12-year-old is offered a pill that makes them gradually become sexually mature, so they'll spend huge amount of time, energy, and money for the next 60 years chasing sexual relationships, and thinking that was super meaningful and rewarding, rather than doing cool stuff that kids enjoy, how many would take the puberty-pill? They might think that sexual maturation, which makes all this tedious mating effort, dating, and relationship-investment <i>seem</i> rewarding, is really just self-deceptive nonsense. They might just decide that staying asexual is so much more efficient....</p><p>Giving biased answers based on self-deception is a valid concern. However, it cuts both ways. It's also an issue with people who say they're perfectly happy not having kids, that they regret nothing, that they were right in prioritizing their careers and having fun, etc. It's very hard to run the counterfactual across completely different, irreversible life-trajectories.</p><p>I agree with your point that it's important for EAs to gather converging evidence from multiple kinds of sources, from talking with one's own parents to reading books to diving into the stats about life-satisfaction.</p>", "parentCommentId": "GSo2a9C4Ap2CHzYk5", "user": {"username": "geoffreymiller"}}, {"_id": "BgHhfokzcDkihevpL", "postedAt": "2022-10-06T17:42:27.656Z", "postId": "PxwdLvYA8HvRkWXnH", "htmlBody": "<p>With your puberty example, I expect I would have passed up the pill at the time and remained asexual.  Whether that would have been the right choice is a lot harder to figure out...</p>\n", "parentCommentId": "hNNXG5EFoQEiZNXfv", "user": {"username": "Jeff_Kaufman"}}, {"_id": "4zaFgQhZBhEdRrRiC", "postedAt": "2022-10-06T17:58:11.169Z", "postId": "PxwdLvYA8HvRkWXnH", "htmlBody": "<p>Jeff -- these examples, of whether to pass through puberty, and whether to become a parent, raise some profound issues (a la Derek Parfit) about the continuity of personal identity. They're basically about decisions about whether to become a new person, and they're basically irreversible. So, yes, it's very hard to know whether such a profound change is 'the right choice'... because it's a choice that basically extinguishes the person making the choice, and creates a new person who's stuck with the choice.</p><p>Which can sound very scary, or very liberating and transformative, depending on one's risk tolerance.</p>", "parentCommentId": "BgHhfokzcDkihevpL", "user": {"username": "geoffreymiller"}}, {"_id": "7SepvdzwAN4H4mupd", "postedAt": "2022-10-10T23:50:08.349Z", "postId": "PxwdLvYA8HvRkWXnH", "htmlBody": "<p>I have returned to this post after reading the entirety of <i>Mothers and Others</i>.</p><p>Depending on someone’s interpersonal situation, I now believe that parental contributions ideally comprise the following:</p><ul><li>Maternal care ~ 30-50%</li><li>Paternal care ~ 30-50%</li><li>Other care (mostly grandmothers/aunts/child’s siblings/mother’s friends) ~ 30-50%&nbsp;</li></ul><p>It seems that “other caretakers” (most desirable being maternal grandmothers) are an absolutely essential requirement for children to thrive, even for those who have highly invested fathers and especially for those who have absent fathers.&nbsp;</p><p>My attitude towards absent or apathetic fathers is slightly less negative than it was before reading the book, and subsequently, my belief that successful child rearing requires a strong community of women is slightly up-weighted.</p><p>Based on the theory presented in <i>Mothers and Others</i>, I would update my earlier comment…</p><blockquote><p>I know men are very capable, but sometimes get the feeling that they aren’t</p></blockquote><p>…to instead say that men are completely capable as caretakers, but have a bit more of a choice in the matter as to how they contribute their childcare, given societal pressures and competing priorities including mating, hunting, and impressing or protecting others.&nbsp;</p><p>I would still be really interested to read others’ thoughts on how paternal priorities change in modern contexts (i.e. what is the modern equivalent of hunting / is hunting obsolete), or the benefits of patriarchal versus matriarchal societies!</p><p>Thank you so much Dr. Miller for all of your responses&nbsp;</p>", "parentCommentId": "eoXaxqBeAsnenY9Wi", "user": {"username": "emmakat1998 "}}, {"_id": "YECi8dSbFSJ3WjRDQ", "postedAt": "2022-10-11T00:39:43.445Z", "postId": "PxwdLvYA8HvRkWXnH", "htmlBody": "<p>purplefern - glad you enjoyed the 'Mothers and Others' book by Sarah Blaffer Hrdy!</p><p>I agree that we see a fair amount of variety in child rearing practices across cultures and time, with varying weights on maternal care, paternal care, and 'alloparental care' by other people, which can include close relatives, friends, or neighbors -- often female, but of either sex. &nbsp;Modern life does make it difficult to organize informal alloparenting networks, but I guess paid child care and school try to fill the gaps.</p>", "parentCommentId": "7SepvdzwAN4H4mupd", "user": {"username": "geoffreymiller"}}, {"_id": "n9qSqG2S3ZT4bnatQ", "postedAt": "2023-01-28T14:59:43.814Z", "postId": "PxwdLvYA8HvRkWXnH", "htmlBody": "<p>Which global, technological, political etc developments do you currently find most relevant with regards to parenting choices?</p>\n", "parentCommentId": null, "user": {"username": "Achim"}}, {"_id": "gdXRvfBwrHS9kBDbZ", "postedAt": "2022-09-29T16:25:50.494Z", "postId": "PxwdLvYA8HvRkWXnH", "htmlBody": null, "parentCommentId": "QLiYsJcjiGT5pWh2m", "user": null}]