[{"_id": "Cyt5nAQ3AHz2d6D37", "postedAt": "2022-11-04T11:13:44.105Z", "postId": "PyZCqLrDTJrQofEf7", "htmlBody": "<blockquote>\n<p>Again there doesn’t seem to be a strong reason to think there’s an upper bound to the amount of people that could be killed in a war featuring widespread deployment of AI commanders or lethal autonomous weapons systems.[17]</p>\n</blockquote>\n<blockquote>\n<p>So on technological grounds, at least, there seem to be no strong reasons to think that the distribution of war outcomes continues all the way to the level of human extinction.</p>\n</blockquote>\n<p>Sounds right!</p>\n<p>This made me realise that my post is confusing/miseadling in a particular way -- because of the context of the 80,000 Hours problem profiles page, I was thinking of the question like \"what's the leftover x-risk from conflict once you aren't considering AI, bio, or nukes (since those have their own problem profiles)\"? But that context is much stronger in my head than in the readers', and should be made explicit.</p>\n<p>I guess also AI-as-a-weapon should perhaps fall into the great power conflict bucket, as it's not discussed that much in the AI profile.</p>\n", "parentCommentId": null, "user": {"username": "Ardenlk"}}, {"_id": "JjdSqLWCLgbBWzygS", "postedAt": "2022-11-07T22:54:00.886Z", "postId": "PyZCqLrDTJrQofEf7", "htmlBody": "<p>Dear friends,&nbsp;<br><br>This is a fascinating read, however I tend to agree mostly with the end and the conclusions rather than the approach. I think that the question posed somehow cannot be answered by a natural-science based approach, that it's one to be approached best by the tools of history or maybe IR rather than power distributions, as a eras change, even between WWI, WWII and 2022, and big wars are quite sui generis events. A parameter that I would like to see in such an analysis would be how much more interconnected our world is at present and that it may get in the future. Here's two examples from the present: a) the energy situation affecting Europe, and the economic effects of the Ukraine war, and b) internet use - imagine if a rogue country had in its tactics to cut internet supply or attack nuclear facilities or hospitals through cyberwarfare. Or, imagine worse, if the AI you mentioned is linked to the internet and some state hackers decide to hack them, without knowing for example how crazy the AI would go if hacked (ok, i'm stretching it a bit here).&nbsp;<br><br><br>I think more useful a more useful lead from your article is the mention of the democratization and the turning of the tide with citizens not willing to fight in really big and protracted wars (i guess the extinction war would have to escalate a bit before it reaches doomsday point, even though I wouldn't rule out the accidental escalation that would lead to the nuclear winter in like a week or so - I can even see a quick escalation over Taiwan or sth, i hope i'm just naive).&nbsp;<br><br>Anyway, this was just a ramble, I apologise for this, the key takeaway from the above that I'd love to discuss with you is that I don't think that power-laws can say much about a war leading to human extinction.&nbsp;On the contrary, history and perhaps psychology (the decisions of those a) deciding politics b) creating weapons and c) using weapons) could be more useful guides.<br><br>Best Wishes,<br>Haris</p>", "parentCommentId": null, "user": {"username": "Haris Shekeris"}}, {"_id": "tRh2SJcorMgXCuS6f", "postedAt": "2022-11-08T10:29:14.728Z", "postId": "PyZCqLrDTJrQofEf7", "htmlBody": "<p>Hi Haris, thanks for this. I agree that it's useful to tackle such complicated questions from a variety of approaches.</p><p>I've written a little bit about interconnectedness and democratization <a href=\"https://forum.effectivealtruism.org/posts/aSzxoj7irC5jNHceB/how-likely-is-world-war-iii\">here</a>. I agree they exert some influence on the likelihood of conflict. I do think that the pacifying effects of interconnectedness are <i>somewhat </i>overrated. The economic costs of going to war against any given trade partner are usually small relative to a country's total GDP and the potential gains, material and symbolic, from fighting.</p><p>And while I find the evidence for a democratic peace surprisingly strong, it has limited bearing on the possibility of a major war this century because China and Russia are not likely to democratize.</p>", "parentCommentId": "JjdSqLWCLgbBWzygS", "user": {"username": "Stephen Clare"}}, {"_id": "6Fybx5yDWKgj6vDLD", "postedAt": "2022-11-08T10:30:59.114Z", "postId": "PyZCqLrDTJrQofEf7", "htmlBody": "<p>Thanks Arden, that makes sense. I think it will be hard to separate \"x-risk from conventional war\" from \"x-risk from war fought with WMDs and autonomous weapons\" because pacifying interventions like improving US-China relations would seem to reduce both those risks simultaneously.</p>", "parentCommentId": "Cyt5nAQ3AHz2d6D37", "user": {"username": "Stephen Clare"}}, {"_id": "DCg6nPpW97c7dSk3b", "postedAt": "2022-11-08T22:02:20.534Z", "postId": "PyZCqLrDTJrQofEf7", "htmlBody": "<p>Dear Stephen,&nbsp;<br><br>Maybe I didn't explain myself well regarding the interconnectedness, I don't mean bilateral trade (which is what you mention in your linked article) but just the fact that the world we live in is much more brittle in the sense that a black swan event such as a rogue state attacking the internet may have potentially extinction-scale consequences. &nbsp;In other words, before say WWII any war simply couldn't spread to the level of threatening world extinction as there weren't enough nuclear weapons or there were enough third parties either too far away for the conflict or otherwise uninterested to commit their populations to the death. Whereas now, with cyberwarfare, biological warfare and nuclear, it is envisageable that at least one of the Great Powers will regard the whole of the Earth as the War theatre. I hope this explains my idea a bit better.<br><br>As democratization, again, I guess as callous as it sounds, the situations currently in Iran and Russia may prove to be good case studies.&nbsp;<br><br>Best Wishes,&nbsp;<br>Haris</p>", "parentCommentId": "tRh2SJcorMgXCuS6f", "user": {"username": "Haris Shekeris"}}, {"_id": "ebAfChxBzpqtYkn3g", "postedAt": "2022-11-10T14:52:58.076Z", "postId": "PyZCqLrDTJrQofEf7", "htmlBody": "<p>I really appreciate this post (and am curating it). It's a follow-up to previous work that targets important uncertainties; following up on discussion of an initial piece of work (especially when the discussion is critical) is great — and a focus on the relevant uncertainties or disagreements is really important.&nbsp;</p><p>Here's a quote (I added a link to the original post):&nbsp;</p><blockquote><p>...in this post we interrogate two of the assumptions made in “<a href=\"https://forum.effectivealtruism.org/posts/aSzxoj7irC5jNHceB/how-likely-is-world-war-iii\">How Likely is World War III?</a>”:</p><ol><li>Does the distribution of battle deaths follow a power law?</li><li>What do we know about the extreme tails of this distribution?</li></ol></blockquote><p>As always, I really appreciate the summary:&nbsp;</p><blockquote><p>Our findings are:</p><ul><li>That battle deaths per war are&nbsp;<i>plausibly&nbsp;</i>distributed according to a power law, but few analyses have compared the power law fit to the fit of other distributions. Plus, it’s hard to say what the tails of the distribution look like beyond the wars we’ve experienced so far.</li><li>To become more confident in the power law fit, and learn more about the tails, we have to consider theory: what drives war, and how might these factors change as wars get bigger?</li><li>Perhaps some factors limit the size of war, such as increasing logistical complexity. One candidate for such a factor is technology. But while it seems plausible that in the past, humanity’s war-making capacity was not sufficient to threaten extinction, this is no longer the case.</li><li>This suggests that wars could get very, very bad: we shouldn’t rule out the possibility that war could cause human extinction.</li></ul></blockquote><p>I also like the uncertainties and ways the tentative conclusions could be incorrect are outlined &nbsp;(e.g. in <a href=\"https://forum.effectivealtruism.org/posts/PyZCqLrDTJrQofEf7/how-bad-could-a-war-get#Breaking_the_law\">this section</a>, but also even in the summary). And the <a href=\"https://forum.effectivealtruism.org/posts/PyZCqLrDTJrQofEf7/how-bad-could-a-war-get#Conclusion\">conclusion</a> provides suggestions for future research based on those uncertainties.&nbsp;</p><p><strong>Somewhat related</strong> (discussions of the likelihood of war, not how bad it could get):&nbsp;</p><ul><li>80,000 Hours recently released a podcast with Bear Braumoeller on <a href=\"https://80000hours.org/podcast/episodes/bear-braumoeller-decline-of-war/\">the case that war isn't on the decline</a>.&nbsp;</li><li>Stephen shared a related links-post: <a href=\"https://forum.effectivealtruism.org/posts/AiSAAkvZzWKkt4uBB/links-post-economists-chris-blattman-and-noah-smith-on-china\">Economists Chris Blattman and Noah Smith on China, Taiwan, and the likelihood of war</a></li><li>A database: <a href=\"http://www.crisisevents.org/browse.html\">http://www.crisisevents.org/browse.html</a>&nbsp;</li><li>And a related chart from Our World in Data (that I discovered via the podcast summary linked above — <a href=\"https://ourworldindata.org/counting-conflict-deaths\">more on counting conflict deaths</a>):</li></ul><figure class=\"media\"><div data-oembed-url=\"https://ourworldindata.org/grapher/world-conflict-deaths-various-sources?time=1815..latest&amp;country=~death+rate+%28per+100%2C000%29\">\n\t\t\t\t\t<div data-owid-slug=\"world-conflict-deaths-various-sources\" class=\"owid-preview\">\n\t\t\t\t\t\t<iframe src=\"https://ourworldindata.org/grapher/world-conflict-deaths-various-sources?time=1815..latest&amp;country=~death+rate+%28per+100%2C000%29\">\n\t\t\t\t\t</iframe></div>\n\t\t\t\t</div></figure>", "parentCommentId": null, "user": {"username": "Lizka"}}, {"_id": "cjzsi2Evy3EpSquxu", "postedAt": "2022-11-11T10:37:58.286Z", "postId": "PyZCqLrDTJrQofEf7", "htmlBody": "<p>Thanks for the post!</p><blockquote><p>First, and most importantly,&nbsp;<strong>only two papers in the review also check whether other distributions might fit the same data.</strong></p></blockquote><p>I agree this is crucial. Ultimately, lognormal, power law, power law with exponential cutoff, exponential, and stretched exponential distributions cannot be correct. They do not have an upper bound, whereas:</p><blockquote><p>the range of the battle death distribution can’t stretch to infinity</p></blockquote><p>I think it would be worth fitting the data about the number of deaths as a fraction of the total population to truncated versions of the above distributions to the interval between 0 and 1.</p>", "parentCommentId": null, "user": {"username": "vascoamaralgrilo"}}, {"_id": "eETFRRxC4zRrK8vx9", "postedAt": "2022-11-15T15:04:06.703Z", "postId": "PyZCqLrDTJrQofEf7", "htmlBody": "<p>Another rich source of data to consider is here <a href=\"https://ourworldindata.org/war-and-peace\">https://ourworldindata.org/war-and-peace</a></p><p>I would argue that technology is changing wars such that the models of the past are irrelevant. We are entering the age of ultra-precision where making a weapon twice as accurate only requires 1/8 the destructive force to maintain the same lethality. &nbsp;</p><p>In the future, the expanded use of things like drones coupled with facial recognition and other advanced sensors, will make war more personal but overall, less destructive. The goals of modern warfare are more about capitulation than killing. Killing is the result of forcing your will upon an adversary but it isn't the end goal and neither is the total destruction of an adversaries country.&nbsp;</p><p>Nukes have never been used because there has never been a compelling use case while the reasons not to use them exist in abundance. For over 70 years, nukes as a deterrence has prevented another world scale war.<img src=\"https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/7e543e94b20d2dfe3d2bcb7dc73f377f680d4c7152c19366.png\" srcset=\"https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/7e543e94b20d2dfe3d2bcb7dc73f377f680d4c7152c19366.png/w_120 120w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/7e543e94b20d2dfe3d2bcb7dc73f377f680d4c7152c19366.png/w_240 240w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/7e543e94b20d2dfe3d2bcb7dc73f377f680d4c7152c19366.png/w_360 360w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/7e543e94b20d2dfe3d2bcb7dc73f377f680d4c7152c19366.png/w_480 480w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/7e543e94b20d2dfe3d2bcb7dc73f377f680d4c7152c19366.png/w_600 600w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/7e543e94b20d2dfe3d2bcb7dc73f377f680d4c7152c19366.png/w_720 720w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/7e543e94b20d2dfe3d2bcb7dc73f377f680d4c7152c19366.png/w_840 840w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/7e543e94b20d2dfe3d2bcb7dc73f377f680d4c7152c19366.png/w_960 960w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/7e543e94b20d2dfe3d2bcb7dc73f377f680d4c7152c19366.png/w_1080 1080w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/7e543e94b20d2dfe3d2bcb7dc73f377f680d4c7152c19366.png/w_1134 1134w\"></p><p>What this chart suggests is that currently, the world overall, is in the most peaceful extended period seen in over 600 years. Global warfare changed forever in 1945.</p><p>The pre nuclear modern warfare trend line is an expression of the industrialization of killing. In a nuclear free world, we would have made killing more and more efficient making the horrors of the battlefield truly unbelievable.</p><p>Yet that is not quite as chilling as the prospect of nuclear war. Conventional wars would have likely occurred on the global scale at least once since the end of WW2. The use of chemical weapons and bio weapons would have likely been in the mix. The use of such weapons is muted today as such large-scale use would warrant a nuclear response. Without nukes there is no such direct threat discouraging their use.</p>", "parentCommentId": null, "user": {"username": "Allen Hall"}}, {"_id": "CeZ6sNzRaaajK2xHe", "postedAt": "2022-11-17T05:03:53.120Z", "postId": "PyZCqLrDTJrQofEf7", "htmlBody": "<p>&gt;So on technological grounds, at least, there seem to be no strong reasons to think that the distribution of war outcomes continues all the way to the level of human extinction.<br><br>Is this possibly missing a 'not' in there? It seems like you just concluded that there was no reason to think there was a cap on how many deaths could come from advanced military AI systems, then conclude there's no strong reason to think the distribution continues all the way to extinction?</p>", "parentCommentId": null, "user": {"username": "SolenoidEntity"}}, {"_id": "YvdanW8JnkCTsZH2w", "postedAt": "2022-11-17T10:07:52.606Z", "postId": "PyZCqLrDTJrQofEf7", "htmlBody": "<p>Great catch, you're exactly right. Thanks for pointing this &nbsp;out!</p>", "parentCommentId": "CeZ6sNzRaaajK2xHe", "user": {"username": "Stephen Clare"}}, {"_id": "dgNaMF5JSWFFopbw3", "postedAt": "2024-03-06T19:31:43.300Z", "postId": "PyZCqLrDTJrQofEf7", "htmlBody": "<p>Hi Stephen and Rani,</p><blockquote><p>She found six papers and one book in which a power law distribution is fitted to data on battle deaths per war. In each case, a power law was found to be a plausible fit for the conflict data. Estimates for the &nbsp;of conflict death data range from&nbsp;<strong>1.35 to 1.74</strong>, with a mean of 1.60. Anything in this range would be considered a relatively low value of &nbsp;(most empirical power laws have &nbsp;values between 2 and 3). In other words, if these estimates are accurate, the tail of the battle death distributions is scarily long.</p></blockquote><p>Nitpick. I think \"tail index\" is missing before \" of conflict death data range\".</p>", "parentCommentId": null, "user": {"username": "vascoamaralgrilo"}}]