[{"_id": "YNmpTnyB6xfJGXTE6", "postedAt": "2023-11-27T23:28:51.790Z", "postId": "PzudRLNHqSGDw8rZk", "htmlBody": "<p>These are useful, thanks. I would suggest we also enable/permit a lower-quality recording to be posted or shared of the other talks. It should be fairly costless to have a few people record and post these with camera phones, etc., and I believe it would add substantial value.</p>\n", "parentCommentId": null, "user": {"username": "david_reinstein"}}, {"_id": "Mbiieyj7XT3oNCxX4", "postedAt": "2023-11-28T13:29:24.074Z", "postId": "PzudRLNHqSGDw8rZk", "htmlBody": "<p>Thanks for the suggestion David — we've thought about this and might consider it for the future, but I worry it would be a fair amount of work for a low-quality product (that I expect wouldn't get many views). However for our recent Boston event we did take audio recordings of most talks and are planning to have many of them written up as Forum posts soon.</p>", "parentCommentId": "YNmpTnyB6xfJGXTE6", "user": {"username": "Eli_Nathan"}}, {"_id": "3MKGKZigQjtzj46Jx", "postedAt": "2023-11-28T18:42:07.863Z", "postId": "PzudRLNHqSGDw8rZk", "htmlBody": "<p>Audio recordings would be good, thanks.</p>\n<p>Not sure about the benefit/cost. Am I naive to think something like:</p>\n<ul>\n<li>Tripod (or a small stabilizer on a desk)</li>\n<li>Volunteer (or paid person) in each room, sits at front or operates tripod</li>\n<li>Uses own camera phone</li>\n<li>Uploads to YouTube directly from phone</li>\n</ul>\n<p>Time cost: Maybe 1-2 hours of 'equivalent extra person work' per 1-hour session (say 90 minutes).</p>\n<p>Benefit: If even 5-10 people watch the videos, I suspect the value outweighs the cost.</p>\n<ul>\n<li>\n<p>Enabling them to shift time; e.g.,  do 1-on-1's if attending ...</p>\n</li>\n<li>\n<p>Encouraging some people to not come in person (saving tremendous expense obviously)</p>\n</li>\n<li>\n<p>Presenter and their team can re-watch the video to improve their own presentation, as well as using it for onboarding etc.</p>\n</li>\n</ul>\n<p>My guess (very rough) is the value 'per watcher who spends at least 20 minutes viewing on the talk' has about 20% of the value of the 90 minutes spent by the person filming and uploading on average.</p>\n<p>(Obviously more so if it's a highly productive person doing the watching, or if the speaker themselves watches it to improve their presentation.)</p>\n<p>So I guess if at least 5 people watch the average video for 20 minutes or more, this would be worth doing.  Not sure how that compares to the statistics you've seen on usage.</p>\n<p>Could it be enabled on a 'strictly voluntary basis', i.e., give permission for people to record certain sessions, announce this, and upload it to an (unofficial?) channel?</p>\n", "parentCommentId": "Mbiieyj7XT3oNCxX4", "user": {"username": "david_reinstein"}}, {"_id": "opks3RX9ennHxktkS", "postedAt": "2023-11-29T17:23:50.373Z", "postId": "PzudRLNHqSGDw8rZk", "htmlBody": "<p>Are there plans to release the videos from EAGx Virtual?</p>", "parentCommentId": null, "user": {"username": "colin"}}, {"_id": "r7ivcSczj8kLBLGbq", "postedAt": "2023-11-30T10:21:38.239Z", "postId": "PzudRLNHqSGDw8rZk", "htmlBody": "<p>Yes! We'll need to review footage and confirm with speakers, but they should be up soon :)&nbsp;</p>", "parentCommentId": "opks3RX9ennHxktkS", "user": {"username": "OllieBase"}}]