[{"_id": "g2n3LsGSQEkirQfM8", "postedAt": "2023-01-15T11:08:18.923Z", "postId": "PzxKQCWuaknbGF7qW", "htmlBody": "<p>Tokvill &gt; Tocqueville</p>", "parentCommentId": null, "user": {"username": "5566hh"}}, {"_id": "4HRXiDHD8Xw2K7KPs", "postedAt": "2023-01-20T12:12:26.022Z", "postId": "PzxKQCWuaknbGF7qW", "htmlBody": "<p>I don't want to throw cold water on your enthusiasm. But I think you are underestimating the difficulty of getting anything potentially politically controversial published in China in the current climate and the potential downside risks of coming to the attention of the Chinese government in such an area.&nbsp;</p><p>Given the recent crackdowns on NGOs and civil society in China this would entail a very genuine risk of the related organisations being banned from operating in China, and make the government more likely to suppress EA idea in general. Which is a very high risk for the low odds of a single book meaningfully changing public opinion, and which is very unlikely to be published.&nbsp;</p>", "parentCommentId": null, "user": {"username": "projectionconfusion"}}, {"_id": "Ct37jcPmirvtaNGm9", "postedAt": "2023-01-21T10:06:54.105Z", "postId": "PzxKQCWuaknbGF7qW", "htmlBody": "<p>Good idea. Are you planning to make this happen? What steps will you take next?</p>\n<p>My quick thought is:</p>\n<ol>\n<li>\n<p>Email Tyler. List a few people you think are worth reaching out to.</p>\n</li>\n<li>\n<p>If Tyler is keen, help him do the work.</p>\n</li>\n</ol>\n<p>It'd probably be worth releasing it in English as well, for an Anglosphere audience.</p>\n<p>Tyler released <em>Stubborn Attachments</em> on Medium a year or two before it was published by Stripe Press. He could do the same for this book, with some big caveats at the start, along the lines that he made in the podcast.</p>\n<p>If you don't plan to do something like (1) and (2) please DM me on Twitter. I'd probably be up for it, but I'm not sure I'd have time to product manage / significantly help Tyler after the initial setup.</p>\n<p>I could fairly easily create an audiobook version. The <a href=\"https://type3.audio\">TYPE III AUDIO</a> AI narration pipeline is coming together nicely.</p>\n", "parentCommentId": null, "user": {"username": "Peter_Hartree"}}, {"_id": "65igxah3MwACioATk", "postedAt": "2023-01-21T13:45:49.838Z", "postId": "PzxKQCWuaknbGF7qW", "htmlBody": "<p>From the way Tyler was talking about the book and topics, it did not seem to me like a politically controversial book \"it was a book designed to explain America to the Chinese, and make it more explicable, more understandable\".&nbsp;<br><br>Or at least the controversial parts could be taken out if required and a lot of the value could remain.&nbsp;</p><blockquote><p>Though I covered a lot of basic differences across the economies, the policies, why are the economies different?</p><p>Why is there so little state ownership in America?</p><p>Why are so many parts of America so bad at infrastructure?</p><p>Why do Americans save less?</p><p>How is religion different in America?</p></blockquote>", "parentCommentId": "4HRXiDHD8Xw2K7KPs", "user": {"username": "Matt Brooks"}}, {"_id": "nfRJ8a65ox6twbw3H", "postedAt": "2023-01-21T13:58:13.326Z", "postId": "PzxKQCWuaknbGF7qW", "htmlBody": "<p>I don't really have the time, skills, or contacts to make this happen, if you want to pick up the torch I would gladly pass it to you.</p>\n<p>Tyler seems keen although worried about censors: <a href=\"https://twitter.com/tylercowen/status/1614402492518785025\">https://twitter.com/tylercowen/status/1614402492518785025</a></p>\n<p>It seems from the podcast he wanted to only release the book in Chinese (maybe especially at this point due to the decline in willingness for the west to work with China) but I'm not sure, maybe the book would help westerns understand China's culture as much as Chinese to understand the west. A lot of great power war-concerned EAs would probably buy the book to get a better insight.</p>\n<p>If I had to guess, I don't think he needs help finding a translator or transcribing the book to an audiobook or any other particular singular task, I think it's bigger than that.</p>\n<p>If we could get someone with contacts and backing like OpenPhil to say to Tyler \"We will pay all costs to publish the book and assign a project manager to do all of the annoying bits for you\" it seems harder for Tyler to turn down, but I'm just guessing.</p>\n<p>Happy to chat more, if you'd like</p>\n", "parentCommentId": "Ct37jcPmirvtaNGm9", "user": {"username": "Matt Brooks"}}, {"_id": "9wBo6evcJ5DGTN8tC", "postedAt": "2023-01-22T22:10:58.427Z", "postId": "PzxKQCWuaknbGF7qW", "htmlBody": "<p>Jordan here--happy to facilitate! i'm at jordan@chinatalk.media</p>", "parentCommentId": null, "user": {"username": "Jordan_Schneider"}}, {"_id": "Zj379fztovuYtNPKm", "postedAt": "2023-01-22T22:12:59.654Z", "postId": "PzxKQCWuaknbGF7qW", "htmlBody": "<p>they have scihub and random pdfs in china just like we do...yes getting officially censored is annoying but I'd guess 90% of what he publishes get through</p>", "parentCommentId": "nfRJ8a65ox6twbw3H", "user": {"username": "Jordan_Schneider"}}, {"_id": "wD6yHh5MF4zbZF4Gd", "postedAt": "2023-01-22T22:53:28.197Z", "postId": "PzxKQCWuaknbGF7qW", "htmlBody": "<p>(Don't have a lot of time, quickly typing and very quickly skimming this post and comments, might have missed things.)</p><blockquote><p>getting officially censored is annoying&nbsp;</p></blockquote><p>The <a href=\"https://forum.effectivealtruism.org/posts/PzxKQCWuaknbGF7qW/ea-should-help-tyler-cowen-publish-his-drafted-book-in-china?commentId=4HRXiDHD8Xw2K7KPs\">concerns in this comment</a> are true. This can be overcome, but this requires a lot capability in many ways and is currently extremely hard.</p><p>\"Getting censored\" is much more than just annoying and could affect a lot of other people and projects.&nbsp;</p><p>&nbsp;</p><p>There is a lot of context here and it's not easy to explain this. The comments and post, in some ways, show the limits of projects/activity from online discourse and social media.</p>", "parentCommentId": "Zj379fztovuYtNPKm", "user": {"username": "Un Wobbly Panda"}}]