[{"_id": "GnnWjEiNZ9Ttq8NAM", "postedAt": "2022-12-14T17:22:29.297Z", "postId": "Q3idCSxivkKbDeyCw", "htmlBody": "<p>If innovation really has stalled (which I’m skeptical of in the first place) it’s not because the space race is (mostly) over. There are deeply important issues on Earth for us to solve, and millions of people are innovating towards solutions to them every day. Sure, designing a tele-health or mobile banking system for people living in extreme poverty isn’t as sexy as landing on the moon, but it’s surely innovation. These types of projects may not dominate the news cycle but they represent the beginning of an alignment of research and development with the flourishing of all humans (and animals). Space exploration does not.</p>\n<p>You say that we should aim higher than our current massive endeavors (eliminating diseases, expanding clean energy, protecting animal rights and natural habitats). But decades of work has proven that these endeavors are extremely difficult. Every marginal dollar and hour spent on these projects counts. And space exploration distracts from urgent need for innovation in these areas.</p>\n", "parentCommentId": null, "user": {"username": "Jasper Meyer"}}, {"_id": "4y5c8KnDLgqANXNGz", "postedAt": "2022-12-14T19:26:35.747Z", "postId": "Q3idCSxivkKbDeyCw", "htmlBody": "<p>Beautiful writing (which I really appreciate, and think we should be more explicit about promoting). I see that AI risk isn't mentioned here and am curious how that factors into your general sense of the promising future.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Emily Dardaman"}}, {"_id": "ujkMtcra4ihtyCxuq", "postedAt": "2022-12-14T21:30:24.309Z", "postId": "Q3idCSxivkKbDeyCw", "htmlBody": "<p>The claim wasn't that the space race caused a stall in innovation - it was that humanity stopped pursuing <i>ambitious</i> new goals. And that doesn't mean there isn't any innovation, but surely you see a difference between implementing telehealth in a new region and going to the moon? And ambitious projects don't seem to get started nearly as often anymore. Smallpox eradication was mostly done by the time we retreated from space, and Polio elimination was started soon after.</p><p>The only more recent example I can think of is the human genome project, and while impressive, it was much smaller - it cost only a couple of percent as much as the Apollo program.<br><br>But your last comment completely misses the point I made. Humanity has trillions of dollars to spend, and it goes big on video games, consumer electronics, and fast food. You're claiming that humanity isn't capable of doing more than a couple things at once, but the world around us seems to make it clear you're wrong. I'm not saying to spend less on any of the things you're pointing to as priorities - and I said as much in the post.&nbsp;</p>", "parentCommentId": "GnnWjEiNZ9Ttq8NAM", "user": {"username": "Davidmanheim"}}, {"_id": "7yXTYnh7C93NFk7Bj", "postedAt": "2022-12-15T00:43:53.814Z", "postId": "Q3idCSxivkKbDeyCw", "htmlBody": "<p>Hi David, thanks for the reply. I think I just totally disagree that humanity stopped pursuing ambitious goals. Just yesterday, we generated energy with nuclear fusion. We've reduced the price of solar cells by over 100x in a few decades. Hundreds of millions of people in China/India/Africa, etc. have been lifted out of extreme poverty. There are thousands of scientists pursuing cures for cancer and dementia. I could go on...</p><blockquote><p>Humanity has trillions of dollars to spend, and it goes big on video games, consumer electronics, and fast food.</p></blockquote><p>But our government doesn't have trillions of dollars and we have a ton of really important stuff to spend it on. I just think that improving education, closing the racial wealth gap, offering food stamps - heck, even building infrastructure here on earth are far more important. We can do multiple things at once, but we can't do everything. Every additional spend means something else has to be cut. Space exploration is near the bottom of <i>my</i> list of things I think our govt should spend on.</p>", "parentCommentId": "ujkMtcra4ihtyCxuq", "user": {"username": "Jasper Meyer"}}, {"_id": "AWjPTQeF2FWMNehrC", "postedAt": "2022-12-15T09:49:34.864Z", "postId": "Q3idCSxivkKbDeyCw", "htmlBody": "<blockquote><p>Just yesterday, we generated energy with nuclear fusion.</p></blockquote><p>&nbsp;</p><p>We've gotten under $10b in funding for fusion. We spend closer to $300b in adjusted dollars to land on the moon.</p><blockquote><p>We've reduced the price of solar cells by over 100x in a few decades.</p></blockquote><p>Despite sparse funding, markets work. I definitely agree - but again, this isn't an ambitious vision, it's very late incrementalism, for something we should have pushed hard on pursuing when Jimmy Carter put solar panels on the White House roof.</p><blockquote><p>There are thousands of scientists pursuing cures for cancer and dementia.&nbsp;</p></blockquote><p>NIH funding as a share of GDP in 2019 is still 12 percent below 2003 levels. That's not ambition, it's plodding along slowly when we have tons of scientists and researchers being turned away from academia for lack of funding.</p><blockquote><p>But our government doesn't have trillions of dollars and we have a ton of really important stuff to spend it on.</p></blockquote><p>The US government spends multiple trillions of dollars each year. Much of that is on nondiscretionary spending, but we could afford to spend more on ambitious projects. We did in the past.&nbsp;</p><blockquote><p>Every additional spend means something else has to be cut.</p></blockquote><p>That's not how government spending works - it does not need to be zero-sum, as our actual spending shows. But even if it was, we have cut taxes repeatedly, instead of doing more.</p><p>And if you're hoping that it spurred more growth, private industry is pushing short term revenue increases, in most domains lowering investment in R&amp;D.</p><p>We simply aren't as ambitious as we were in the past. But we should be.</p>", "parentCommentId": "7yXTYnh7C93NFk7Bj", "user": {"username": "Davidmanheim"}}, {"_id": "58qYZvF3SohjKutfD", "postedAt": "2023-02-02T15:39:50.037Z", "postId": "Q3idCSxivkKbDeyCw", "htmlBody": "<p>Dear David,</p><p>Your post has inspired this one on my side:</p><p>https://forum.effectivealtruism.org/posts/QianitTHjKBSH2sXC/space-colonization-and-the-closed-material-economy</p>", "parentCommentId": null, "user": {"username": "Arturo Macias"}}]