[{"_id": "XEPfTfWi8P3eaRfEm", "postedAt": "2019-03-12T16:46:58.040Z", "postId": "Q8isNAMsFxny5N37Y", "htmlBody": "<p>Bostrom defines a &quot;crucial consideration&quot; as one that would overturn a conclusion or reveal the need for a major change of direction.  By this definition, something may or may not be a &quot;crucial consideration&quot; depending on our current set of conclusions and our current direction.  The definition <a href=\"https://www.lesswrong.com/posts/yuKaWPRTxZoov4z8K/sneaking-in-connotations\">sneaks in a connotation</a> that important new insights will tend to reveal the need for a major change of direction.  But it&#x27;s also possible that important new insights will reaffirm our current direction.  See <a href=\"https://wiki.lesswrong.com/wiki/Conservation_of_expected_evidence\">conservation of expected evidence</a>.</p><p>Regarding the precautionary principle, consider a reversibility test: Suppose there is some parameter of the world <em>p</em> which is gradually increasing, and you have the opportunity to interfere and stop this increase for no cost.  By the precautionary principle, you should not interfere.  Now suppose <em>p</em> is currently static, and you have the opportunity to interfere and trigger a gradual increase for no cost.  Again, by the precautionary principle, you should not interfere.</p><p>For someone like me, who does not believe in the act/omission distinction and believes in fighting <a href=\"https://en.wikipedia.org/wiki/Status_quo_bias\">status quo bias</a>, this seems a little silly.  I think the best arguments for a policy of non-interference in both scenarios are:</p><ul><li>In the real world, actions typically have costs.</li><li>It&#x27;s possible that our interference isn&#x27;t reversible, and by thinking more, we can better determine whether interference is the correct course of action.  In other words, <a href=\"https://www.lesswrong.com/posts/vADtvr9iDeYsCDfxd/value-of-information-four-examples\">value of information</a> is high.  But this argument depends on cluelessness being tractable!  If our current guess is as good as our guess will ever be, we might as well act on it.</li></ul><p>I&#x27;m sympathetic to the idea that value of information is high, and I think cluelessness is tractable.  I support EA groups like the Future of Humanity Institute which are trying to work out the best course of action.  But at a certain point, the low-hanging information fruit will get picked, and then it&#x27;s likely time to act.  If we aren&#x27;t going to take action under any circumstances, gathering information is a waste of time.</p>", "parentCommentId": null, "user": {"username": "John_Maxwell_IV"}}, {"_id": "PAQvwZMDdTeE6329h", "postedAt": "2019-06-02T19:13:07.701Z", "postId": "Q8isNAMsFxny5N37Y", "htmlBody": "<p>Thank you for this series — I this is is an enormously important consideration when trying to do good, and I wish it were talked about more.</p><p>I am rereading this, and find myself nodding along vigorously to this paragraph:</p><blockquote>I think this implies operating under an <em>ethical precautionary principle:</em> acting as if there were always an unknown crucial consideration that would strongly affect our decision-making, if only we knew it (i.e. always acting as if we are in the “no we can’t become clueful enough” category).</blockquote><p>But not the following one:</p><blockquote>Does always following this precautionary principle imply <a href=\"https://en.wikipedia.org/wiki/Analysis_paralysis\">analysis paralysis</a>, such that we never take any action at all? I don’t think so. We find ourselves in the middle of a process that’s underway, and devoting all of our resources to analysis &amp; contemplation is itself a decision (“<a href=\"https://genius.com/Rush-freewill-lyrics\">If you choose not to decide, you still have made a choice</a>”).</blockquote><p>Perhaps we indeed should move towards &quot;analysis paralysis&quot;, and reject actions that we do not have a very high level of certainty in the long-term effects of. Given the maxim that we should always act as if we are in the &quot;no we can&#x27;t become clueful enough&quot; category, this approach would reject actions that we anticipate to have large long-term effects (e.g. radically changing government policy, founding a company that becomes very large). But it&#x27;s not clear to me that it would reject all actions. Intuitively, P(cooking myself this fried egg will have large long-term effects) is low.</p><p>We can ask ourselves whether we are always in the position of the physician treating baby Hitler: every day when we go into work, we face many seemingly inconsequential decisions that are actually very consequential. i.e. P(cooking myself this fried egg will have large long-term effects) is actually high. But this doesn&#x27;t seem self-evident.</p><p>In other words, it might be tractable to minimize the number of very consequential decisions that the world makes, and this might be a way out of extreme consequentialist cluelessness. For example, imagine a world made up of many populated islands, where overseas travel is impossible and so the islands are causally separated. In such a world, the possible effects of any one action end at the island it started at, so therefore the consequences of any one action are capped in a way they are not in this world.</p><p>It seems to me that this approach would imply an EA that looks very different than the current one (and recommendations that look different than the ones you make in the next post). But it may also be a sub-consideration of the general considerations you lay out in your next post. What do you think?</p>", "parentCommentId": null, "user": {"username": "reallyeli"}}]