[{"_id": "uKTFH9yESAeKkEr2w", "postedAt": "2022-12-05T23:03:50.249Z", "postId": "QbLKFRhbQN8JvtWkM", "htmlBody": "<p>Post summary (feel free to suggest edits!):<br>The&nbsp;<a href=\"https://founderspledge.com/funds/climate-change-fund\"><u>Founders Pledge Climate Fund</u></a> has run for 2 years and distributed over $10M USD.&nbsp;<br><br>Because the climate-space has ~$1T per year committed globally, the team believes the best use of marginal donations is to correct existing biases of overall climate philanthropy, fill blindspots and leverage existing attention on climate. The Fund can achieve this more effectively than individual donations because it can make large grants to allow grantees to start new programs, quickly respond to time-sensitive opportunities, and make catalytic grants to early-stage organizations who don’t yet have track records.</p><p>Examples include substantial increase in growth of grantee Clean Air Task Force, and significant investments into emerging economies that get less from other funders.</p><p>Future work will look at where best to focus policy efforts, and the impact of the Russo-Ukrainian war on possible policy windows.</p><p>(If you'd like to see more summaries of top EA and LW forum posts, check out the <a href=\"https://forum.effectivealtruism.org/s/W4fhpuN26naxGCBbN\">Weekly Summaries</a> series.)</p>", "parentCommentId": null, "user": {"username": "GreyArea"}}, {"_id": "tPiFJjiCxdBE2DrMq", "postedAt": "2022-12-06T09:45:46.832Z", "postId": "QbLKFRhbQN8JvtWkM", "htmlBody": "<p>Thanks for doing this!<br><br>I think this is mostly right, three suggestions for minor edits:<br>1. The CATF example is more of an example of this mechanism (shifting the trajectory of organizations), not itself the major result of the Climate Fund (as the trajectory of CATF was shifted before, in 2018, through FP highlighting before the Fund existed). The primary organizations we are replicating this with the fund so far are TerraPraxis and Future Cleantech Architects, both of which we were the initial philanthropic investors and that have since gone on to grow quite significantly.<br><br>2. \"Future work will look at where best to focus policy efforts, and the impact of the Russo-Ukrainian war on possible policy windows.\" &gt; \"...advocacy efforts given major changes in policy windows in the US and globally as well as profound changes in energy through the Russo-Ukrainian war\" -- or similar, I think mostly avoiding a formulation that suggests we are just opportunistically exploiting policy windows from the war, it is more about updating the landscaping analysis given massive changes.<br><br>This is all quite in the weeds, so if those edits don't make sense, feel free to ignore them! Thanks again for including the post.<br><br>&nbsp;</p>", "parentCommentId": "uKTFH9yESAeKkEr2w", "user": {"username": "jackva"}}, {"_id": "5qNfaoXQkzMtDmx3y", "postedAt": "2022-12-06T10:30:51.291Z", "postId": "QbLKFRhbQN8JvtWkM", "htmlBody": "<p>Thanks for this update, it's been great to follow the progress on climate research from the FP team!</p><p>I want to highlight and give props for your strategic decisionmaking around Biden's victory:</p><blockquote><p>Shortly after the Climate Fund's inception, we <a href=\"https://founderspledge.com/stories/the-implications-of-bidens-victory-for-impact-focused-climate-philanthropy\">estimated</a> there was a unique window of policy opportunity after Biden's victory in the US and, putting our money where our mouth was, made large grants from the Climate Fund in response (see discussion above). With major climate policy having been passed in the form of the Bipartisan Infrastructure Bill, the CHIPS and Science Act, and the Inflation Reduction Act, and the midterms having ended the Democratic trifecta, it is now time for an updated analysis on future innovation advocacy priorities.</p></blockquote><p>I think the \"window of opportunity\" prediction you made has proved prescient, and is a great example of what thoughtful, strategic, high-context grantmaking looks like. It should give people even more confidence in the team going forward!</p><p>Looking forward to seeing what your review of the new landscape turns up. And hoping to see the globalized grantmaking continue!</p><p>(Minor note: your visualizations aren't showing up, at least not on my screen.)</p><p>(Also, for me, the fact that an EA team is doing what is likely the best climate grantmaking around makes recent criticisms about the community's approach to climate change particularly foolish.)</p>", "parentCommentId": null, "user": {"username": "Stephen Clare"}}, {"_id": "rXbrEaQGniNDAvAyF", "postedAt": "2022-12-06T14:19:04.575Z", "postId": "QbLKFRhbQN8JvtWkM", "htmlBody": "<p>Thanks for the kind words, Stephen, this is certainly what we are aiming for!<br><br>Yes, we will very likely continue strongly globalized grantmaking given the Biden opportunity window closing and the innovation space becoming more crowded.<br><br>We'd be happy to help re public perception of EA on climate (and do so where it clearly makes sense), but also keen to hear if you think there are other opportunities we should engage on.&nbsp;<br>My perception is that most of this criticism is not very thoughtful, using the non-prioritization of climate as a clear flag that EA cannot be possibly serious rather than engaging with what is a much more nuanced position about the best use of marginal resources.<br><br>(Graphics work for me on laptop &amp; mobile, unsure what is going on there).</p>", "parentCommentId": "5qNfaoXQkzMtDmx3y", "user": {"username": "jackva"}}]