[{"_id": "DDJcJBkLfwa7orP39", "postedAt": "2023-12-29T20:36:37.073Z", "postId": "QDjioHPcExzbuXjsj", "htmlBody": "<p>[Not answering on behalf of HLI, but I am an HLI employee]</p><p>Hi Michal,&nbsp;</p><p>We are interested in exploring more systematic solutions to aligning institutions with wellbeing. This topic regularly arises during strategic conversations.&nbsp;</p><p>Our aim is to eventually influence policy, for many of the reasons you mention. But we’re currently focusing on research and philanthropy. This is because there’s still a lot we need to learn about how to measure and best improve wellbeing. But before we attempt to influence how large amounts of resources are spent, I think we should be confident that our advice is sound.&nbsp;</p><p>The institution that I’m most interested in changing is academia. I think:&nbsp;</p><ul><li>Wellbeing science should be a field.&nbsp;</li><li>There should be academic incentives to publish papers about wellbeing priorities and cost-effectiveness analyses.&nbsp;<ul><li>The reasoning is that: if academia produced more high quality cost-effectiveness analyses of interventions and charities, HLI would be able to spend less time doing that research, and more time figuring out what that research implies about our priorities.&nbsp;</li><li>This also strikes me as likely more valuable than the average project of those who tend to work on wellbeing related topics.&nbsp;</li></ul></li><li>It doesn’t seem implausible that we need to wait (or accelerate) research towards favoring best practices before we make strong, high stakes recommendations. &nbsp;</li></ul><p>Following up on that last point, Folk and Dunn (<a href=\"https://www.nature.com/articles/s41562-023-01651-4\">2023</a>) reviewed the power and pre-registration status of research on the 5 most popular recommendations in media for individuals to increase their happiness. The, results, captured in the figure below, are humbling.</p><p><img src=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/DDJcJBkLfwa7orP39/mlyxxqhvswyk4irkwhry\" alt=\"Pasted Graphic.png\" srcset=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/DDJcJBkLfwa7orP39/xh22grdywolfauepyztb 120w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/DDJcJBkLfwa7orP39/p9a5uuxqcbdm158ac7e4 240w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/DDJcJBkLfwa7orP39/chowjxiaukz3ao47qtia 360w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/DDJcJBkLfwa7orP39/tgztqa4pljdu0ivnesuw 480w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/DDJcJBkLfwa7orP39/ngamgyfh9rafkjaf9nne 600w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/DDJcJBkLfwa7orP39/rqc1ohdtahmq4omyqwfg 720w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/DDJcJBkLfwa7orP39/hsxpp6rzmvtixfcwtlo6 840w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/DDJcJBkLfwa7orP39/yv5azwfjolyw9angtcw1 960w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/DDJcJBkLfwa7orP39/iz2fvwjaegkiibplwdfd 1080w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/DDJcJBkLfwa7orP39/fhij7nsvgyf0qqbg3rsl 1112w\"></p><p>That said, there is an organization that attempts to popularize and disseminate finding from wellbeing literature: <a href=\"https://actionforhappiness.org\">https://actionforhappiness.org</a>. We haven’t evaluated them yet, but they’re on our long list. I expect they’ll be challenging to evaluate.&nbsp;</p>", "parentCommentId": null, "user": {"username": "JoelMcGuire"}}, {"_id": "gMTNFgqbJmvzpLheZ", "postedAt": "2023-12-29T23:17:46.651Z", "postId": "QDjioHPcExzbuXjsj", "htmlBody": "<p>I think you're right about the implicit claim that people could be doing much more to directly improve their own wellbeing, and that it would be generally good if they did so.</p><p>However, it seems like you're assuming that when people aren't optimizing their happiness they're making a mistake. While I'm sure that's true a good proportion of the time, there are also surely lots of cases where people make choices which are worse for their own wellbeing in service of something else they value, e.g.:</p><ul><li>An immigrant to a rich country sending money back to their family overseas rather than paying someone to deal with the damp issues in their accommodation.</li><li>Someone going to visit a not-particularly-liked aunt in a care home, because she has nobody else in the world.</li><li>Someone's religious devotion leaving them with less time for their family than would ideally like.</li></ul><p>In each case the person would plausibly be happier if they gave up on valuing the thing they are making sacrifices for. It doesn't seem like we would generally think that they should. But it's not obvious to me how to draw a line which suggests that people valuing fame in its own right are mistaken, but people who are valuing these things in their own right are not mistake. (Perhaps there is a way of drawing such a line -- they do feel different -- but it's clear that it's not a case of straightforwardly \"it would be good if people optimized much harder for their own happiness\".)</p><p>This is also relevant for considering a longtermist perspective on optimizing for happiness. Many things that people might value for their effects on the long-term won't necessarily have big short-term benefits to happiness -- at least directly. If thinking through long-term impacts of any attempt to get people to optimize further for their happiness, it would be important to consider how this could lead to them discarding values that aren't so helpful.</p><p>Again, I think you're right that a lot (probably most) of what blocks people doesn't have this character. But I think it's an important category, and deserves some calling out explicitly if you're thinking about policy interventions.</p>", "parentCommentId": null, "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "dmub7ay8kbbE68RfW", "postedAt": "2023-12-31T13:42:27.184Z", "postId": "QDjioHPcExzbuXjsj", "htmlBody": "<p>This comment helps to highlight the importance of language when discussing this topic. Happiness and wellbeing are not the same thing and it can lead to confusion when the two terms are used interchangeably.</p><p><a href=\"https://forum.effectivealtruism.org/posts/tZ9DkhNiDduSBqshZ/introduction-to-the-philosophy-of-well-being\">This post </a>explains the three main theories of wellbeing: hedonism, desire-based views, and objective list views. If you're a hedonist, then failing to optimise for happiness would be a mistake. However, as Owen points out, people often trade off happiness for other things they value which is more consistent with the objective list theory.</p><p>Over recent decades, the field of wellbeing science has settled on 'life satisfaction' as the primary metric for subjective wellbeing. It's still important to track other measures too (e.g., positive/negative affect, sense of meaning/purpose), but I share the view that life satisfaction <i>should</i> be the goal of society.&nbsp;</p><p>That's because life satisfaction is the common unit that people use when they make trade-offs between happiness, purpose, duty etc. It's the 'all things considered' assessment of a person's life, according to what they value. Many attempts to measure wellbeing rely on a dashboard of indicators, but in all those cases, the relative weightings of the indicators are decided by the researchers rather than the subjects of the research and, in my view, that misses the whole point. Having said that, I've read some compelling arguments against the life satisfaction approach from Plant (<a href=\"https://wellbeing.hmc.ox.ac.uk/papers/2306-can-i-get-a-little-less-life-satisfaction-please/\">2023</a>) and Thoma (<a href=\"https://ppr.lse.ac.uk/articles/10.31389/lseppr.47?_gl=1*1uv4iak*_ga*MTUzODMyODEzOS4xNzA0MDI5NDU2*_ga_BP3F43VPVK*MTcwNDAyOTQ1NS4xLjAuMTcwNDAyOTQ2NC41MS4wLjA.\">2021</a>) which readers may find insightful.</p>", "parentCommentId": "gMTNFgqbJmvzpLheZ", "user": {"username": "BarryGrimes"}}, {"_id": "63g3uR7z9fiTX34Bv", "postedAt": "2024-01-12T10:08:43.946Z", "postId": "QDjioHPcExzbuXjsj", "htmlBody": "<p>Hi Joel,&nbsp;</p><p>Thank you for your response. I definitely agree about the need and usefulness of more high-quality research in the field of well-being, including&nbsp;wellbeing priorities and cost-effectiveness analyses.&nbsp;Has HLI considered taking actions to promote such research, beyond conducting research on your own?</p><p>On a related note, I recently came across the Global Flourishing Study (GFS), a $43.4 million initiative which can be found here:&nbsp;<a href=\"https://hfh.fas.harvard.edu/global-flourishing-study\">https://hfh.fas.harvard.edu/global-flourishing-study</a>. While I haven't delved into the details of this study, its existence underscores the growing interest in well-being research. Influencing the direction and quality of such research could be incredibly impactful.</p>", "parentCommentId": "DDJcJBkLfwa7orP39", "user": {"username": "Michal Porwisz"}}]