[{"_id": "wuco7exHdKiDRXZQY", "postedAt": "2023-11-26T14:03:55.701Z", "postId": "QDtro7aEqeusrwD4r", "htmlBody": "<p>Bravo! This really sets a bar for the quality of inquiry we should strive for in this community.</p>", "parentCommentId": null, "user": {"username": "MathiasKirkBonde"}}, {"_id": "sbJBnDYmRh5JS6Dez", "postedAt": "2023-11-26T17:16:17.746Z", "postId": "QDtro7aEqeusrwD4r", "htmlBody": "<p>Strongly upvoted. I'd love to see more work like this: well-powered, preregistered, and directly answering an important question.</p>\n", "parentCommentId": null, "user": {"username": "John Salter"}}, {"_id": "woaPwxSvAhRkoZxop", "postedAt": "2023-11-26T17:19:04.210Z", "postId": "QDtro7aEqeusrwD4r", "htmlBody": "<p>My understanding of the results: for the preregistered tasks you measured effects of 1 IQ point (for RAPM) and 2.5 IQ points (for BDS), with a standard error of ~2 IQ points. This gives weak evidence in favor of a small effect, and strong evidence against a large effect.</p><p>You weren't able to measure a difference between vegetarians and omnivores. For the exploratory cognitive tasks you found no effect. (I don't know if you'd expect those tests to be sensitive enough to notice such a small effect.)</p><p>At this point it seems a bit unlikely to me that there is a clinically significant effect, maybe I'd bet at 4:1 against the effect being &gt;0.05 SD. That said I still think it would be worthwhile for someone to do a larger study that could detect a 0.1 SD effect, since that would be clinically significant and is very weakly suggested by this data (and would make supplementation worthwhile given how cheap it is).</p><p>(See also <a href=\"https://gwern.net/creatine\">gwern's meta-analysis</a>.)</p>", "parentCommentId": null, "user": {"username": "Paul_Christiano"}}, {"_id": "NgaLHPy7TJYNXYnp3", "postedAt": "2023-11-26T19:36:23.426Z", "postId": "QDtro7aEqeusrwD4r", "htmlBody": "<p>Thanks for comparing vegetarian and omnivore diets. I'd be interested to see vegan diet results as well since vegan diets restrict even more sources of dietary creatine than vegetarian diets</p>", "parentCommentId": null, "user": {"username": "Pat Myron"}}, {"_id": "ad9CPhN3Jw8J4SLLE", "postedAt": "2023-11-26T20:19:56.626Z", "postId": "QDtro7aEqeusrwD4r", "htmlBody": "<blockquote><p>It seems quite likely to me that all the results on creatine and cognition are bogus, maybe I'd bet at 4:1 against there being a real effect &gt;0.05 SD.</p></blockquote><p>Unless I'm misunderstanding, does this mean you'd bet that the effects are even smaller than what this study found on its preregistered tasks? If so, do you mind sharing why?</p>", "parentCommentId": "woaPwxSvAhRkoZxop", "user": {"username": "MichaelStJules"}}, {"_id": "AKT3eRPiW76eWS4zr", "postedAt": "2023-11-26T22:00:49.823Z", "postId": "QDtro7aEqeusrwD4r", "htmlBody": "<p>Great that you did this, really appreciate it.&nbsp;</p><p>I'm no expert on the biology, but my intuition would in any case have been that the effect size would be tiny/negligible for 6 weeks of supplementation, and that for non-trivial effects, you would need sustained supplementation over a longer time period.&nbsp;</p><p>Is there any reason to doubt my intuition on this?</p>", "parentCommentId": null, "user": {"username": "Sanjay"}}, {"_id": "MruqXN3ZHhBdRCgfo", "postedAt": "2023-11-27T02:30:18.706Z", "postId": "QDtro7aEqeusrwD4r", "htmlBody": "<p>Yes, I'd bet the effects are even smaller than what this study found. This study gives a small amount of evidence of an effect &gt; 0.05 SD. But without a clear mechanism I think an effect of &lt; 0.05 SD is significantly more likely. One of the main reasons we were expecting an effect here was a prior literature that is now looking pretty bad.</p><p>That said, this was definitely some evidence for a positive effect, and the prior literature is still some evidence for a positive effect even if it's not looking good. And the upside is pretty large here since creatine supplementation is cheap. So I think this is good enough grounds for me to be willing to fund a larger study.</p>", "parentCommentId": "ad9CPhN3Jw8J4SLLE", "user": {"username": "Paul_Christiano"}}, {"_id": "ptrL3wLWGsfgoERhy", "postedAt": "2023-11-28T03:52:41.877Z", "postId": "QDtro7aEqeusrwD4r", "htmlBody": "<p>I believe prior work showed large effects from short periods of supplementation. (Edit: Note that this work seems to debunk prior work, but this should explain the study design)</p>", "parentCommentId": "AKT3eRPiW76eWS4zr", "user": {"username": "Ryan Greenblatt"}}, {"_id": "pS8pvgkEz9EzqCvoY", "postedAt": "2023-11-28T22:55:14.308Z", "postId": "QDtro7aEqeusrwD4r", "htmlBody": "<p>We also see moderate to large effects from short periods of supplementation for the non-cognitive effects, so we might expect similar saturation for the cognitive effects.</p>", "parentCommentId": "ptrL3wLWGsfgoERhy", "user": {"username": "Linch"}}, {"_id": "k7j2htNmMneiAACji", "postedAt": "2023-12-01T18:31:06.506Z", "postId": "QDtro7aEqeusrwD4r", "htmlBody": "<p>Would be interesting to see a SEM analysis of this looking at the impact on a latent IQ measure behind these test results that each try to get at it separately. This model should have much better power to find an effect and not suffer from multiple hypothesis testing issues looking at the different tests separately. Model would be of the form</p><p>Latent variable definition</p><p>IQ =~ RAPM+BDS+Other tests</p><p>Regression</p><p>IQ ~ Creatine+Other explanatory variables(Age,vegetarian etc.)</p>", "parentCommentId": null, "user": {"username": "Burner1989"}}]