[{"_id": "nQYspnYjrN6rXyjFv", "postedAt": "2023-05-22T14:05:11.846Z", "postId": "QFPihrs6yzcaLsgSZ", "htmlBody": "<p>Botswana isn't <i>that</i> low income: slightly above the world average by PPP apparently: https://en.wikipedia.org/wiki/Economy_of_Botswana<br><br>Not that I think this necessarily makes applying your idea there bad, just important not to fall into stereotypes about Africa, when Botswana is a famous success story. (Yes, it's still poor, but far less than it was at independence.)&nbsp;</p>", "parentCommentId": null, "user": {"username": "Dr. David Mathers"}}, {"_id": "Q2v52CN3Qxvye4qv8", "postedAt": "2023-05-22T15:02:44.437Z", "postId": "QFPihrs6yzcaLsgSZ", "htmlBody": "<p>Oops - corrected, sorry!</p>", "parentCommentId": "nQYspnYjrN6rXyjFv", "user": {"username": "freedomandutility"}}, {"_id": "pzy2MBqToavkfvsMu", "postedAt": "2023-05-24T02:51:21.278Z", "postId": "QFPihrs6yzcaLsgSZ", "htmlBody": "<p>tl;dr it'd take more digging to identify which charities would be the best candidates for donation to execute this kind of effort, though it seems likely the right charities for this effort can be identified among those already in the orbit of the global health &amp; development arm of EA.&nbsp;</p><p>I'm not aware of which organizations there may be that have launched in the last few years independent of the pandemic that have already received major funding from EA-affiliated donors and would be ready to receive more of the same funding to rapidly roll out a project like this. (\"Major funding from EA-affiliated donors\" here means grants worth at least five figures from EA-aligned foundations with an endowment worth at least a few million dollars, like Open Philanthropy.)&nbsp;</p><p>I'm aware there of at least some organizations that have received major funding from EA-affiliated donors that have either launched in the last few years as a response to the pandemic, or have pivoted or launched a new project, in response to the pandemic, as an extension of their previous and ongoing efforts. I'm not aware whether there are any EA-affiliated non-governmental organizations that have launched after the pandemic began to specifically address this issue. It'd take more research to figure out which organizations there might be ready to do this and that EA-aligned funders are ready to back, though it definitely seems feasible with existing and available infrastructure.</p>", "parentCommentId": null, "user": {"username": "Evan_Gaensbauer"}}]