[{"_id": "iRCcYytathj3jjBMA", "postedAt": "2023-09-30T01:28:01.630Z", "postId": "QGtYFLBtSuegHz5tP", "htmlBody": "<p>Thank you for making this deck! I'm an avid Anki user and will start on this today.</p>\n<p>I'm curious about how useful decks like these would be for people. I'm going through AGISF right now and making a bunch of cards for studying and the thought of publishing them for others came up, but wasn't sure if it was worth the effort (to polish them for public use).</p>\n<p>@Bryce Robertson, any thoughts on this? Were you approached to do this or did you come up with your own reasons as to why you started this project? If this is something that would be valuable for other resources I'd be quite excited to work on this.</p>\n", "parentCommentId": null, "user": {"username": "squanchBrigade"}}, {"_id": "obWb2XdksEMLCjzma", "postedAt": "2023-09-30T15:19:14.809Z", "postId": "QGtYFLBtSuegHz5tP", "htmlBody": "<p>The idea came about because I was looking for ways I could use Anki beyond language learning and figured this could be useful, then decided that if it seems useful for me then presumably for others too.</p><p>When I told a few people I was working on this, I generally didn’t get particularly excited feedback. It seemed like this may at least to some degree be because people are sceptical as to the quality of shared decks, which is partly why I put a lot of time into making this one as well-designed as possible.</p><p>That’s also the reason I would personally be keen to try out someone else's deck on core concepts from an AISF course or similar, but with the caveat that if it didn’t meet a pretty high quality standard then I’d likely not use it and make one myself instead. FWIW, I used the <a href=\"https://ankiweb.net/shared/info/2109889812\">Ultimate Geography</a> shared deck as inspiration for a very well-made deck.</p><p>Hope that’s useful!</p>", "parentCommentId": "iRCcYytathj3jjBMA", "user": {"username": "Bryce Robertson"}}, {"_id": "kwEeagPWJHqMQrbHK", "postedAt": "2023-10-01T05:28:39.384Z", "postId": "QGtYFLBtSuegHz5tP", "htmlBody": "<p>Interesting, I'd be happy to give you feedback on how I like the cards (I have a reminder for ~2 months from now). For transparency, my initial goal is to have a better sense of all orgs out in the ecosystem and have it in a form that I can slow-feed to myself, not necessarily memorize these for the rest of my life.</p>\n<p>Maybe the people you talked to didn't think having these memorized would provide benefit? Not sure if they were already fans of SRS before. I'd argue that having even a \"Fermi estimate\" equivalent of what people are doing and what options are out there have benefits for knowing what to apply to, what to suggest to others, etc.</p>\n<p>I can't promise that my cards are that high quality! I almost only use cloze deletions and that may not be preferable. I do source all of my links and the source text that I'm roughly basing my card on. If you're open to taking a look at them it'd be great to get quick feedback on whether they're helpful or not, and especially whether it'd be useful to put more work into for a deck of the entire project.</p>\n", "parentCommentId": "obWb2XdksEMLCjzma", "user": {"username": "squanchBrigade"}}, {"_id": "FDrFXrtBon6W87dgu", "postedAt": "2023-10-05T11:41:06.224Z", "postId": "QGtYFLBtSuegHz5tP", "htmlBody": "<p>Feedback would be great, thanks!</p><p>I completely agree that having a broad overview of what's going on in the ecosystem can be useful in many ways, and that a deck like this should be able to help with that – hopefully!</p><p>I'd be more than happy to check out your deck – feel free to send me a DM. I've never used cloze deletions on Anki so I'd be especially intrigued to see how that works.</p>", "parentCommentId": "kwEeagPWJHqMQrbHK", "user": {"username": "Bryce Robertson"}}, {"_id": "sMyTArExvLsfuNvqb", "postedAt": "2024-02-26T13:32:30.222Z", "postId": "QGtYFLBtSuegHz5tP", "htmlBody": "<p>Great stuff! Strongly upvoted.&nbsp;</p><p>I just had an idea. It could be a valuable thing to have a monthly / bi-monthly newsletter for people wanting to stay up to date with new developments in the AIS ecosystem, but that don't find the time to scroll through EAF, LW, etc, on a regular basis with the goal to keep themself updated.&nbsp;</p>", "parentCommentId": null, "user": {"username": "バルス"}}]