[{"_id": "n97rmorsnnqomq9Qc", "postedAt": "2023-10-04T11:50:39.471Z", "postId": "QH2sECmmbLWbMXLhJ", "htmlBody": "<p>The links to the spreadsheets don't work (maybe it isn't publicly shared?)</p>", "parentCommentId": null, "user": {"username": "edoarad"}}, {"_id": "NytHfLKZiujPA9nqv", "postedAt": "2023-10-04T14:38:53.557Z", "postId": "QH2sECmmbLWbMXLhJ", "htmlBody": "<p>Yeah I've realised my old google account where that was kept has been deleted. I'll figure out whether I can get it back somehow</p>", "parentCommentId": "n97rmorsnnqomq9Qc", "user": null}, {"_id": "FDBMgske4EBMPSmm3", "postedAt": "2023-10-06T11:09:33.577Z", "postId": "QH2sECmmbLWbMXLhJ", "htmlBody": "<p>This report seems commendably thorough and thoughtful. Could you possibly spell out its implications for effect altruists though? I take it the conclusion is that humanity was most violent in the subsistence farming period, rather than before or after, but I'm not sure what to make of that. Presumably, it shows how violent people are changes quite radically in different contexts, so should I be reassured if, as seems likely, modern-type societies will continue? Returns to hunter-gathering and subsistence farming do not seem on the cards.</p>\n<p>Sorry if I've missed something. But I reckoned that, if it was obvious to me, some others would missed it too.</p>\n", "parentCommentId": null, "user": {"username": "MichaelPlant"}}, {"_id": "GGMetwPa8DNXJkymu", "postedAt": "2023-10-06T11:52:37.626Z", "postId": "QH2sECmmbLWbMXLhJ", "htmlBody": "<p>I think it's mainly relevant for the part of EA that is interested in long-run history and its implications for the long-term. There's also some stuff in the discussion about how the drivers of conflict are a small subset of sociopaths/malevolent people; &nbsp;humanity is not innately violent even though we have high rates of violence relative to other primates. I think is relevant for the future of violence.</p>", "parentCommentId": "FDBMgske4EBMPSmm3", "user": null}, {"_id": "MK3qBYpg6zvZPjcBA", "postedAt": "2023-10-09T12:51:16.526Z", "postId": "QH2sECmmbLWbMXLhJ", "htmlBody": "<p>I have a copy of it here: <a href=\"https://docs.google.com/spreadsheets/d/1nlBKzkTHzDDqHka-CvWybF8rqXivEA3_FrwhtTosDCA/edit?usp=sharing\">https://docs.google.com/spreadsheets/d/1nlBKzkTHzDDqHka-CvWybF8rqXivEA3_FrwhtTosDCA/edit?usp=sharing</a><br>(you'll probably want to make your own copy of this, as I might add stuff to this spreadsheet one day)</p>", "parentCommentId": "NytHfLKZiujPA9nqv", "user": {"username": "Joao Fabiano"}}, {"_id": "nKajJeJJtEE2hviWc", "postedAt": "2023-10-09T13:20:22.483Z", "postId": "QH2sECmmbLWbMXLhJ", "htmlBody": "<p>joao you're my hero. the prospect of redoing the spreadsheet fillled me with dread</p>", "parentCommentId": "MK3qBYpg6zvZPjcBA", "user": null}, {"_id": "nyvBtregA7XC5sJn7", "postedAt": "2023-10-09T16:34:55.978Z", "postId": "QH2sECmmbLWbMXLhJ", "htmlBody": "<p>I've now updated the link for the spreadsheet which should work</p>", "parentCommentId": "NytHfLKZiujPA9nqv", "user": null}]