[{"_id": "FvXP5HjsDn2kfP4Pi", "postedAt": "2023-01-12T15:30:21.269Z", "postId": "QKa5PGiasWqeL75A7", "htmlBody": "<p>This is a very useful overview, it's easy to lose track of what has been done.</p><p>The crucial part is that for decades animal activists failed to obtain a lot of stuff - so it's really impressive that this much could be achieved so quickly.&nbsp;</p><p>Thanks for the post, really ! It brought me some joy to read it :)</p>", "parentCommentId": null, "user": {"username": "Corentin Fressoz"}}, {"_id": "NpKW7RFrwm3PuqSeb", "postedAt": "2023-01-12T21:56:26.210Z", "postId": "QKa5PGiasWqeL75A7", "htmlBody": "<p>\"None of this progress was inevitable. It was mostly the result of sustained and focused advocacy, much of it done and funded by all of you.\"</p><p>This is so important to remember. Unlike progress in tech, economic growth, etc, which often feel like the inevitable trends of progress (sometimes our efforts even focus on figuring out ways <i>to slow</i> progress, like in AI), animal welfare runs the risk of falling by the wayside. &nbsp;It's very important for us to be <i>proactive </i>and not take any change for granted. Most (all?) of these corporate pledges were due to hard-fought, strategic pressure from effective animal advocacy groups.</p>", "parentCommentId": null, "user": {"username": "Damin Curtis"}}, {"_id": "cmgX5CwtnkfpboQnK", "postedAt": "2023-01-13T21:36:24.267Z", "postId": "QKa5PGiasWqeL75A7", "htmlBody": "<p>Inspiring progress! This post is a positive update for me.</p>", "parentCommentId": null, "user": {"username": "Stephen McAleese"}}, {"_id": "YzkANquE2Ak6HcobL", "postedAt": "2023-01-17T16:55:28.178Z", "postId": "QKa5PGiasWqeL75A7", "htmlBody": "<p>Thanks for sharing, James!</p><p>I would be interested to know the effect on wild animal welfare of the interventions which improved the welfare of farmed animals. Terrestrial and marine arthropods <a href=\"https://forum.effectivealtruism.org/posts/rdLMTsSZ2oqoFAeTg/is-improving-the-welfare-of-arthropods-and-nematodes-1\">have</a> 15.8 k and 1.58 M times as many neurons as farmed animals excluding arthropods, so the effects on wild animals plausibly dominate.</p>", "parentCommentId": null, "user": {"username": "vascoamaralgrilo"}}]