[{"_id": "kc3iMfoc4RDosBekN", "postedAt": "2023-12-29T11:09:43.872Z", "postId": "QkAw8EC4yHHECxrYh", "htmlBody": "<p>Pardon me if I'm missing it, but I can't see a lot about your experience of working 4 hours a day. Like how is that for you? Have you tried working 6 or 2?</p>", "parentCommentId": null, "user": {"username": "nathan"}}, {"_id": "FCaFrwd4roP8PtwS2", "postedAt": "2023-12-29T11:37:31.355Z", "postId": "QkAw8EC4yHHECxrYh", "htmlBody": "<p>I tried avoiding including too much of my own experiences to avoid making the post too idiosyncratic, but I'm happy to elaborate on it!</p><p>I haven't had a period of working only 2h consistently, so I don't know how I would feel about that. However, during busy periods (e.g. if I have both teaching and service obligations) I think my main option to this would be to do nothing and then binge work during vacations, which I have done before and I would expect to be more common.</p><p>I have had periods of working 6 hours a day pretty consistently. What distinguished these periods I think was that I was very intrinsically motivated about the research and had minimal other obligations to navigate at the same time, so I naturally ended up just thinking about my work most of the time.&nbsp;</p><p>Today when I'm in a position with more regular events during my week, I find this harder. If I schedule 6 hours of work a day (which I did for a large part of last year), I often end up with the feeling that I don't have enough time to navigate other things. I have done this for a few weeks for particular projects, but find it difficult to have as a default working aim. I personally found 4h/day somewhat of a sweet spot, and have been doing that consistently for the last few weeks.</p><p>With that said, I have pretty low confidence that effective 6h/day cannot be achieved by others. My main aim with this post was to illustrate some ways in which a lower number achieves many of the benefits I was aspiring to with working more, and might at least for some have a substantial marginal impact on the costs of work. More generally, my experiences are obviously personal, and not something I would want people to put too much weight on.</p>", "parentCommentId": "kc3iMfoc4RDosBekN", "user": {"username": "paul_dfr"}}, {"_id": "aivQc54NmHomu66Ms", "postedAt": "2023-12-30T03:36:50.427Z", "postId": "QkAw8EC4yHHECxrYh", "htmlBody": "<p>A very interesting post that came just in time for my resolution in 2024, which will be my first year in college. My main worry has been how much I'll have to read, going into the \"Great Books\" cirriculum; but knowing this post, as well as what a <a href=\"https://en.wikipedia.org/wiki/Pomodoro_Technique\">pomodoro timer</a> is, gives me reason to be confident I may well remember years from now. Thank you much for writing this, and Dark Lady watch over you! 😁</p>", "parentCommentId": null, "user": {"username": "K.F. Martin"}}, {"_id": "rALtsudSDwdmP2Ezd", "postedAt": "2023-12-30T08:34:55.892Z", "postId": "QkAw8EC4yHHECxrYh", "htmlBody": "<p>Thank you, and good luck with your first year!</p>", "parentCommentId": "aivQc54NmHomu66Ms", "user": {"username": "paul_dfr"}}, {"_id": "vYGLPrGewQ5i7BKdt", "postedAt": "2024-01-02T15:04:01.621Z", "postId": "QkAw8EC4yHHECxrYh", "htmlBody": "<p><strong>Executive summary</strong>: Working consistently for 4 hours per day yields significant output over 16 weeks, comparable to high-impact academic work. Variations like working more provide diminishing returns and increase burnout risk.</p><p><strong>Key points:</strong></p><ol><li>Working 4 hours per day, 5 days per week for 16 weeks yields 320 total hours. This is enough for 1-2 top academic publications or a Coursera ML course.</li><li>Working more increases total hours but has diminishing returns and higher risks. Taking breaks reduces total hours but prevents burnout.</li><li>Social media and gaming take hundreds of hours over 16 weeks. Reading books takes less time for more hours of enjoyment.</li><li>Consistently working a moderate amount maximizes output for independent work while allowing work-life balance.</li><li>Personal factors like focus needs and constraints affect optimal work time.</li></ol><p>&nbsp;</p><p><i>This comment was auto-generated by the EA Forum Team. Feel free to point out issues with this summary by replying to the comment, and</i><a href=\"https://forum.effectivealtruism.org/contact\"><i>&nbsp;<u>contact us</u></i></a><i> if you have feedback.</i></p>", "parentCommentId": null, "user": {"username": "SummaryBot"}}]