[{"_id": "nX4PyFeb96HaukyGD", "postedAt": "2014-12-12T05:45:16.140Z", "postId": "QMpfPCwojoQ24WHkh", "htmlBody": "<p>My values align fairly closely with GiveWell's.  If they continue to ask for donations then probably about 20% of my giving next year will go to them (as in the past two years).  Apart from that:</p>\n<p>GiveWell's preferred split across their recommended charities AMF/SCI/GD/EvAc (Evidence Action, which includes Deworm the World) is 67/13/13/7.  Since most of the reasoning behind that split is how much money each charity could reasonably use, and I agree with GiveWell that bednets are really cost-effective, I won't be deviating much from GiveWell's recommendation.</p>\n<p>Probably I will reduce GiveDirectly's prominence down to 5% or so (with increases for SCI and EvAc) -- I haven't studied GiveWell's latest numbers for the cost-effectiveness calculation closely, but their headline result has their effectiveness far lower than either deworming or bednets.  So I'll continue donating a relatively small amount to GD in recognition of them being methodologically really great.</p>\n<p>I haven't yet given much thought to GiveWell's other 'standout' charities, and whether it's correct to donate to them or not. </p>\n", "parentCommentId": null, "user": {"username": "pappubahry"}}, {"_id": "SxaoQqJap8SbcGjik", "postedAt": "2014-12-12T13:57:03.995Z", "postId": "QMpfPCwojoQ24WHkh", "htmlBody": "<p>Worth noting that it can still be worth posting to your personal blog if only to increase how many people see it.</p>\n", "parentCommentId": null, "user": {"username": "Jess_Riedel"}}, {"_id": "BKB3poav5kjnQRmn8", "postedAt": "2014-12-12T15:15:47.685Z", "postId": "QMpfPCwojoQ24WHkh", "htmlBody": "<p>Great idea for a thread Ben!</p>\n<p>The end charity I'd favour is AMF, for the reasons I <a href=\"http://effective-altruism.com/ea/5o/where_im_giving_and_why_tom_ash/\">outlined</a> in my contribution to the &quot;Where I'm Giving And Why&quot; series: it had robust evidence and also came out top in cost-effectiveness estimates. The only issue is that its room for more funding situation still seems complicated. However I'll use some of my donations as matching funds for fundraising that Charity Science does, because this provides leverage and supports experiments to find scalable ways to fundraise for effective charities, which I think are very valuable.</p>\n<p>The meta charity that I see as having a proven case for impact (besides Charity Science!) is GiveWell, which has plausibly moved tens of millions of counterfactual dollars. I discussed donating to them a year ago, but I'm not currently clear on whether they'll be short of funds.</p>\n", "parentCommentId": null, "user": {"username": "Tom_Ash"}}, {"_id": "ZFhALS7dhAZYa45mk", "postedAt": "2014-12-12T16:44:33.660Z", "postId": "QMpfPCwojoQ24WHkh", "htmlBody": "<p>I'm still thinking on this, and I hope to write up my thoughts in more detail sometime soon.  Broadly, <a href=\"http://effective-altruism.com/ea/5k/where_im_giving_and_why_peter_hurford/\">my thoughts last year</a> still hold.</p>\n<p>I intend to fulfill <a href=\"https://www.givingwhatwecan.org/pledge\">my Giving What We Can pledge of 10%</a>, of which I have currently fulfilled 9.2% mainly by helping supply matching funds for <a href=\"http://www.charityscience.com\">Charity Science</a>'s <a href=\"http://birthday.causevox.com/\">birthday</a> and <a href=\"http://christmas.causevox.com/\">Christmas fundraisers</a>.  I'm not sure what I'll do with the remaining 0.8%.  I'll probably donate it to <a href=\"http://www.givewell.org/charities/top-charities\">GiveWell top charities</a>.  (EDIT: I've now given away 10% of my income as matching funds, so that settles my giving for this year.)</p>\n<p>I keep a <a href=\"http://peterhurford.com/other/donations.html\">pretty detailed donation log</a>, and I just updated it to make it current.  A lot of the stuff is still ongoing, though, so you'll have to check back later.</p>\n<p>I intend to donate a lot more in 2015, because that will be the year I intend to itemize, and I can take advantage of <a href=\"http://www.benkuhn.net/bunch-psa\">some bunching</a>.  I'm also considering getting money together to provide seed money for various new EA projects that I like.</p>\n<p>What about you, Ben?  I'd be keen to hear your thoughts.</p>\n", "parentCommentId": null, "user": {"username": "Peter_Hurford"}}, {"_id": "uxbubKnHRJuRxNWuz", "postedAt": "2014-12-13T01:54:53.237Z", "postId": "QMpfPCwojoQ24WHkh", "htmlBody": "<p>This year, I'm <a href=\"https://intelligence.org/donate/\">donating to MIRI</a>, essentially because of the classic argument for MIRI. Here is a very short summary:</p>\n<ul>\n<li>Artificial General Intelligence is possible and <a href=\"http://lesswrong.com/r/discussion/lw/l0o/superintelligence_reading_group_2_forecasting_ai/\">reasonably probable in the medium-term.</a></li>\n<li><a href=\"http://lesswrong.com/lw/l4i/superintelligence_7_decisive_strategic_advantage/\">Such AI would be very powerful.</a></li>\n<li>Without careful steps to avoid it, <a href=\"http://lesswrong.com/r/discussion/lw/l4g/superintelligence_9_the_orthogonality_of/\">this AI is likely to be unfriendly</a>. <a href=\"http://lesswrong.com/r/discussion/lw/l9u/superintelligence_11_the_treacherous_turn/\">This would be very bad.</a> <a href=\"http://yudkowsky.net/singularity/ai-risk\">Unfriendly AIs do not hate us, but we are made of atoms they can use for purposes not our own.</a></li>\n<li>A <a href=\"http://friendly-ai.com/index.php\">freindly AI</a> dedicated to <a href=\"http://intelligence.org/ie-faq/#FriendlyAI\">promoting our values would be a very good thing.</a></li>\n<li><a href=\"https://intelligence.org/donate/\">Donating to MIRI</a> is one of the best ways of doing this, as they are the only organisation fully focused on this one issue.</li>\n</ul>\n<p>Even ignoring the risk of UFAI, I think that FAI may be one best ways of preventing <a href=\"http://lesswrong.com/lw/2zj/value_deathism/\">run-away value drift from destroying all value in the future.</a></p>\n<p><em><a href=\"https://effectivereaction.wordpress.com/2014/12/13/2014-charity-choice-the-machine-intelligence-research-institute/\">cross-posted on my blog</a></em></p>\n<p><em>edit: minor formatting</em></p>\n", "parentCommentId": null, "user": {"username": "Dale"}}, {"_id": "EC7XwMdLEMtSFxuq2", "postedAt": "2014-12-13T07:46:46.056Z", "postId": "QMpfPCwojoQ24WHkh", "htmlBody": "<p>In 2015 I'll be donating 10% of my salary to the <a href=\"http://cser.org/\">Centre for the Study of Existential Risk</a>. CSER is a particularly good giving opportunity right now: with such superb academic bona fides, it has the potential to hugely raise the profile of the study of existential risk and boost the whole field of future-oriented work, so if you are at all moved by the idea of the <a href=\"http://lesswrong.com/lw/htn/nick_beckstead_on_the_overwhelming_importance_of/\">overwhelming importance of shaping the far future</a> then CSER is well worth considering as a recipient. It's a particularly good cause for me to give to because I'm in the UK, so there are substantial tax advantages.</p>\n<p><a href=\"http://www.fhi.ox.ac.uk/\">FHI</a> are also a very appealing cause for UK taxpayers; I've been a donor to them in the past and may shift back to them in the future depending on how each is looking in room for more funding.</p>\n", "parentCommentId": null, "user": {"username": "Paul_Crowley"}}, {"_id": "PsnRTNzaK6YJEZ3sa", "postedAt": "2014-12-13T10:42:42.661Z", "postId": "QMpfPCwojoQ24WHkh", "htmlBody": "<blockquote>\n<p>The only issue is that its room for more funding situation still seems complicated.</p>\n</blockquote>\n<p>Does anyone have a summary of this which they can share? GiveWell's leave me confused, and I switched to SCI from AMF this year based on GiveWell's de-recommendation of AMF, and am unsure whether room for more funding provides some reason to stick with SCI.</p>\n", "parentCommentId": "BKB3poav5kjnQRmn8", "user": {"username": "jayd"}}, {"_id": "pBsAGgA8fMxpEhCcJ", "postedAt": "2014-12-14T14:35:04.750Z", "postId": "QMpfPCwojoQ24WHkh", "htmlBody": "<p>Here's some thoughts from me on this:</p>\n<p>Effective Altruism Outreach has room for more funding and an excellent plan, so that's what I would give to personally at the moment: <a href=\"http://effective-altruism.com/ea/c5/effective_altruism_outreach_needs_your_donations/\">http://effective-altruism.com/ea/c5/effective_altruism_outreach_needs_your_donations/</a></p>\n<p>I think with some confidence Giving What We Can, Charity Science and GiveWell all dominate giving to, e.g. AMF, because of the fundraising and movement-building multiplier they provide. I would expect them to be at least twice as good, and potentially more than 5 times as good.</p>\n<p>Last I checked MIRI had a lot of reserves, so I think there's a case for holding onto your money and waiting to read the details of their scale-up plans. CSER could definitely use extra money, so if I were going to give to existential risk charity specifically that is where I would probably donate.</p>\n<p>CFAR could be a good movement building approach, but I would want to see what evidence they've collected on their impact on their alumni before donating.</p>\n<p>(N.B. I am personally involved with EAO and GWWC).</p>\n", "parentCommentId": null, "user": {"username": "Robert_Wiblin"}}, {"_id": "nkFJwznhmRndecFnd", "postedAt": "2014-12-14T16:13:43.218Z", "postId": "QMpfPCwojoQ24WHkh", "htmlBody": "<blockquote>\n<p>I think with some confidence Giving What We Can, Charity Science and GiveWell all dominate giving to, e.g. AMF</p>\n</blockquote>\n<p>What would Giving What We Can do with more funds?</p>\n", "parentCommentId": "pBsAGgA8fMxpEhCcJ", "user": {"username": "Peter_Hurford"}}, {"_id": "YnWqHzso8WBLti5WP", "postedAt": "2014-12-14T16:54:29.012Z", "postId": "QMpfPCwojoQ24WHkh", "htmlBody": "<p>Michelle can give a more detailed answer, but some combination of:</p>\n<ul>\n<li>More contact with existing members (now 700 of them) to i) keep them giving for many years ii) encourage them to give more than 10% where practical iii) move more of their donations to our recommended charities.</li>\n<li>Hire a Research Director who would spend most of their time absorbing and communicating the evidence for our and GiveWell's recommended charities in order to i) drive up membership through talks, media, etc ii) drive more of our members' donations to our top recommended charities.</li>\n</ul>\n<p>I describe some of this here: <a href=\"http://effective-altruism.com/r/main/ea/bq/ideas_for_new_experimental_ea_projects_you_could/\">http://effective-altruism.com/r/main/ea/bq/ideas_for_new_experimental_ea_projects_you_could/</a></p>\n<p>We are currently recruiting new members for under £500 each on average. The marginal cost is going to be higher, but my qualitative impression given the methods we are using is that it won't be that much higher.</p>\n", "parentCommentId": "nkFJwznhmRndecFnd", "user": {"username": "Robert_Wiblin"}}, {"_id": "dEcpMs4TPS3sBAqvn", "postedAt": "2014-12-14T19:14:59.713Z", "postId": "QMpfPCwojoQ24WHkh", "htmlBody": "<p>I am donating donating 60% to SCI, 20% to AMF and 20% to GiveDirectly. I reviewed this at my last pay rise, and would expect to do the same at my next one (all being well, April). Research suggests these are all good groups which address global poverty. When I review my donations in April, I will consider expanding into supporting EA groups or other more meta opportunities where good options exist.</p>\n<p>After the GiveWell hesitation around AMF earlier in the year, I decided that I wanted to give my money to more than one charity. Previously, AMF had been the main organisation I gave to. There are two mean reasons I decided to diversify my giving.</p>\n<p>Firstly, doing so acts as a sort of personal emotional hedge. Let's say that a new study comes out and finds that deworming treatments have some awful long term consequences. I would feel awful about the literally thousands of pounds I have given SCI. This wouldn't be 'rational' - I gave SCI this money because they had a high expected value at the time. I acted on the best available information. But I would feel terrible and guilty, and it would put me off trying to do good through personal donations in the future.</p>\n<p>Secondly, a diverse giving portfolio means (I hope) that I can encourage other people to give more. Giving to a variety of organisations means I can have interesting discussions about who I give to. Unconditional cash transfers are an exciting new area, and I'm keen to see them supported. A few of my (non-EA) friends and relatives can be very sceptical of charities, associating them with street fundraisers and high salaries for senior figures (I think high salaries are perfectly justified - but there is general resistance to them among the general public in the UK). GiveDirectly gives me a group I can talk about which gets around a lot of those issues. I'm less sure on this second argument, but for me the first is sufficient in any case.</p>\n<p>One thing which surprised me this year was how much money I managed to raise beyond my own donations. I will have donated around £5,500 this year, but could fairly attribute another £4,000 from fundraising. With a colleague, I managed to get SCI chosen as a recipient organisation for a work charity auction, which raised just over £6,000 for SCI (I have attributed half of this to me)  And by taking part in Live Below the Line I received just over £1,000 - mostly from colleagues. I am surprised that the proportion of money I have moved to effective charities this year through my own personal donations is so small.</p>\n", "parentCommentId": null, "user": {"username": "ChrisSmith"}}, {"_id": "77pdXbgu9yjx3nHBL", "postedAt": "2014-12-14T19:18:07.483Z", "postId": "QMpfPCwojoQ24WHkh", "htmlBody": "<p>What happens to marginal unrestricted funding for CEA? If it gets distributed to projects like GWWC and EAO, it seems better to give directly to CEA, who will know where the money can be used better (assuming values align). </p>\n", "parentCommentId": "pBsAGgA8fMxpEhCcJ", "user": {"username": "Josh_Goldenberg"}}, {"_id": "HF3n4nmy3R2D95CGd", "postedAt": "2014-12-15T04:07:43.427Z", "postId": "QMpfPCwojoQ24WHkh", "htmlBody": "<p>I'm too lazy to write down the reasons, but I just wrote <a href=\"http://www.stafforini.com/blog/my-donations-for-2013-2014/\">a post</a> listing my recent donations.</p>\n<p>(With thanks to Peter Hurford for <a href=\"http://peterhurford.com/other/donations.html\">inspiration</a>.)</p>\n", "parentCommentId": null, "user": {"username": "Pablo_Stafforini"}}, {"_id": "BJyDCcRxBjjquP5YN", "postedAt": "2014-12-15T20:15:14.468Z", "postId": "QMpfPCwojoQ24WHkh", "htmlBody": "<blockquote>\n<p>After the GiveWell hesitation around AMF earlier in the year, I decided that I wanted to give my money to more than one charity.</p>\n</blockquote>\n<p>It's worth noting that GiveWell is actively encouraging people to split their donations, as well.</p>\n<p>&quot;Based on this allocation, for any donors looking to give as we would, we recommend an allocation of $5 to AMF (67%), $1 to SCI (13%), $1 to GiveDirectly (13%) and $.50 to DtWI (7%) for every $7.50 given.&quot; (<a href=\"http://blog.givewell.org/2014/12/01/our-updated-top-charities/\">Source</a>)</p>\n", "parentCommentId": "dEcpMs4TPS3sBAqvn", "user": {"username": "Peter_Hurford"}}, {"_id": "DwnrM4PBHgxRMsWjM", "postedAt": "2014-12-18T16:21:14.591Z", "postId": "QMpfPCwojoQ24WHkh", "htmlBody": "<p>Normally I think it's better to donate later rather than now.  (Partly because of potential returns to investing in stocks, but mostly because of the value of gaining new information.)  However, this year I'll be donating a significant chunk to Effective Altruism Outreach.  I was convinced by their arguments that we're on the cusp of a great opportunity to push EA, so there really is value to donating now.  </p>\n", "parentCommentId": null, "user": {"username": "Lila"}}, {"_id": "DBZNCedxwEbMX6ykc", "postedAt": "2014-12-18T21:55:37.859Z", "postId": "QMpfPCwojoQ24WHkh", "htmlBody": "<p>This is about to change significantly, so I'll get back to you. If the decision is urgent drop me an email an I'll explain the situation!</p>\n", "parentCommentId": "77pdXbgu9yjx3nHBL", "user": {"username": "Robert_Wiblin"}}, {"_id": "Y9MYjch9GXeqoDmjv", "postedAt": "2014-12-18T22:01:22.201Z", "postId": "QMpfPCwojoQ24WHkh", "htmlBody": "<p>Hey Peter what are your reasons for giving to GW's recommended charities rather than a meta-charity of some form? I imagine this is a considered decision. In particular as Charity Science seems to be moving a multiple of its spending, why not put it into CS?</p>\n", "parentCommentId": "ZFhALS7dhAZYa45mk", "user": {"username": "Robert_Wiblin"}}, {"_id": "gAm8yYowwRvcCbCFw", "postedAt": "2014-12-18T22:56:38.563Z", "postId": "QMpfPCwojoQ24WHkh", "htmlBody": "<p>I guess I wasn't clear.  My <a href=\"http://peterhurford.com/other/donations.html\">donation log</a> should make it pretty clear that I've been putting money into CS instead of GW's recommended charities directly.</p>\n<p>The remainder is a question of what to do when CS has run out of room for more funding, and I still want to fulfill my 10% pledge.  I don't have a good answer for this at the moment.  Luckily, this year it didn't happen, and I'll be giving more than 10%.</p>\n", "parentCommentId": "Y9MYjch9GXeqoDmjv", "user": {"username": "Peter_Hurford"}}, {"_id": "C692Fitjx6vZ7KkL5", "postedAt": "2014-12-19T00:09:49.142Z", "postId": "QMpfPCwojoQ24WHkh", "htmlBody": "<p>Hey Peter, thanks for clarifying that. So you thought providing matching funding was the best way to put money into CS? Has CS considered raising some serious money and trying to make a hire or two? You've done fairly well this year, so it seems worth contemplating.</p>\n", "parentCommentId": "gAm8yYowwRvcCbCFw", "user": {"username": "Robert_Wiblin"}}, {"_id": "mJvyR2XMFEqYT2Pq2", "postedAt": "2014-12-19T00:28:12.723Z", "postId": "QMpfPCwojoQ24WHkh", "htmlBody": "<p>Thanks for the compliments, Rob.  I do think expanding our matching and trying out peer-to-peer fundraising has been a good strategic choice.  I personally do agree it's worth considering funding for another hire and it's something we might talk about at the next board meeting.</p>\n", "parentCommentId": "C692Fitjx6vZ7KkL5", "user": {"username": "Peter_Hurford"}}, {"_id": "ogSrTd42jx5W7eMNo", "postedAt": "2014-12-19T19:39:05.864Z", "postId": "QMpfPCwojoQ24WHkh", "htmlBody": "<blockquote>\n<p>Hire a Research Director who would spend most of their time absorbing and communicating the evidence for our and GiveWell's recommended charities in order to i) drive up membership through talks, media, etc ii) drive more of our members' donations to our top recommended charities.</p>\n</blockquote>\n<p>The research director would not actually be directing research into which charity was best?</p>\n", "parentCommentId": "YnWqHzso8WBLti5WP", "user": {"username": "Larks"}}, {"_id": "K5jicyworSbHxFyGu", "postedAt": "2014-12-21T22:03:27.279Z", "postId": "QMpfPCwojoQ24WHkh", "htmlBody": "<p>I'm donating to <a href=\"http://intelligence.org/\">CFAR</a>.</p>\n", "parentCommentId": null, "user": {"username": "Larks"}}, {"_id": "fSPZRjbfJuRjLzfMk", "postedAt": "2014-12-22T16:56:41.536Z", "postId": "QMpfPCwojoQ24WHkh", "htmlBody": "<p>I'd be interested to hear your reasons if you would be happy to share them.</p>\n", "parentCommentId": "K5jicyworSbHxFyGu", "user": {"username": "jayd"}}, {"_id": "hmFTmCb5HStWKpoN9", "postedAt": "2014-12-22T23:33:33.190Z", "postId": "QMpfPCwojoQ24WHkh", "htmlBody": "<p>Denise and I are looking at AMF and the CEA-nexus of charities (Effective Altruism Outreach, Giving What We Can, 80000 hours) primarily. I actually think EAO is the most promising of these on what it wants to do with it's planned funding (<a href=\"http://eao.causevox.com/)\">http://eao.causevox.com/)</a>, but I also fully expect it to meet its target.</p>\n", "parentCommentId": null, "user": {"username": "AGB"}}, {"_id": "McQWjBst5EKkmk7wu", "postedAt": "2014-12-23T15:22:59.235Z", "postId": "QMpfPCwojoQ24WHkh", "htmlBody": "<p>They would be making these decisions but would mostly be relying on primary data collected by others. GiveWell is producing so much information these days that this seems a better way to contribute.</p>\n<p>This could be different if we hired someone who was better suited to doing charity evaluations from scratch themselves.</p>\n", "parentCommentId": "ogSrTd42jx5W7eMNo", "user": {"username": "Robert_Wiblin"}}]