[{"_id": "aQimwFCBsE85aKah7", "postedAt": "2023-09-25T23:09:42.830Z", "postId": "Qo3559TqP5BzoQyWX", "htmlBody": "<p>This is fantastic! Thanks for publishing this update, as well as for all the work you've done over the past two years. I've been very impressed at how well SWP has done at securing commitments and creating partnerships within the industry. It seems like you all have a very strong and potentially very cost-effective plan for next steps, and I'm excited to dig further into the latest research updates.&nbsp;</p><p>A few questions:&nbsp;</p><ol><li>The <a href=\"https://docs.google.com/spreadsheets/d/1Z0M_ytkYwzvwXxHaBalJ6PaiBALBFPtXma-TwDUaYUE/edit#gid=0\">BOTEC</a> you published a few months ago estimated a cost-effectiveness of about 4000 shrimp stunned per dollar per year. Can you talk about some of the factors that led to the updated estimate being 1500? Is the 1500 shrimp/$/year number accounting for more of the overhead costs associated with the stunners program?&nbsp;</li><li>The ASC consultation document uses the acronym UoC a bunch. Can you explain what that means?&nbsp;</li><li>Is there a video of the panel discussion from the Global Shrimp Forum?&nbsp;</li></ol><p>I also continue to be surprised that there hasn't been more effort within the alt protein space on cultivated or plant-based shrimp paste. As you noted in the alternative shrimp report, shrimp paste seems like not only a huge market, but also one of the easier animal products to replicate from a taste and texture perspective. That might be a really promising area for other orgs to focus on.</p>", "parentCommentId": null, "user": {"username": "MHR"}}, {"_id": "rqecybnwMiTcbz8tq", "postedAt": "2023-09-26T10:29:28.679Z", "postId": "Qo3559TqP5BzoQyWX", "htmlBody": "<p>Thank you for the post, and congratulations on the good work you are doing. I am excited to see your influence grow globally!</p>", "parentCommentId": null, "user": {"username": "tseyipfai@gmail.com"}}, {"_id": "JZobXjpdkbqs457JF", "postedAt": "2023-09-26T11:36:46.266Z", "postId": "Qo3559TqP5BzoQyWX", "htmlBody": "<p>Hi MHR! Thanks for your kind words, we're really excited about entering this next phase :)</p><p>Regarding your questions:</p><ol><li>The calculation is the same, but the number we're reporting is different, this is due to a few factors:<ol><li>~4,000/$/year is the <i>actual</i> cost-effectiveness of our stunners program <i>to date</i>, not including overheads other than the cost of the stunners themselves (1B / $247.5K)</li><li>~1,500/$/year in contrast, is the <i>minimum</i> cost-effectiveness of our stunners program <i>going forward</i>, which we commit to purchasing if the producer commits to stunning a minimum of 100M shrimps per year (100M / $65,000 = ~1,500).<ol><li>Historically producers have committed to more than that, so we tend to say 1,500+ /$/year, because the actual number can fluctuate depending on the producer commitment</li></ol></li><li>And just for further clarity, SWP's overall cost-effectiveness (~1,300/$/year) is the cost-effectiveness of our stunners program to date while also factoring in SWP's overheads to date (1B / ($525K+$247.5K))<ol><li>It's worth noting that in future our stunners program will likely become the majority of our budget (rather than overheads), so it's likely SWP's overall cost-effectiveness will increase as a result</li></ol></li><li>Most of these numbers can also be seen in the <a href=\"https://www.getguesstimate.com/models/22982\">Guesstimate model</a> (except how we arrived at the ~1,500, which is instead in the <a href=\"https://www.canva.com/design/DAFmipds-i4/CfV3em4SXjCGnN2F2DJ1gg/view?utm_content=DAFmipds-i4&amp;utm_campaign=designshare&amp;utm_medium=link&amp;utm_source=publishsharelink\">stunners funding proposal</a>)<ol><li>By the way, the Guesstimate model builds on our original <a href=\"https://docs.google.com/spreadsheets/d/1Z0M_ytkYwzvwXxHaBalJ6PaiBALBFPtXma-TwDUaYUE/\">BOTEC spreadsheet</a>, so the 4,000 number can also be seen in Guesstimate, as well as how that changes to 1,300 once the overheads are factored in</li></ol></li></ol></li><li>UoC stands for \"Unit of Certification\", basically just whatever is being certified by ASC, typically the farm itself (I've updated the linked doc now to clarify that - thanks for spotting our jargon!)</li><li><a href=\"https://www.shrimp-forum.com/presentation/panel-discussion-humane-slaughter-and-shrimp-welfare\">There is</a>, but unfortunately it's only available to users with a login (i.e. those who bought a ticket) - we'll email to ask if we're allowed to download and share it</li></ol><p>Regarding shrimp paste - this is definitely something I'd be most excited for someone to work on, but as I understand it there currently are quite a number of shrimp paste alternatives on the market - both in terms of just <a href=\"https://veganpunks.com/shrimp-paste-substitutes/\">general vegan substitutes</a>, but also explicitly <a href=\"https://asianpantry.com.au/products/vvf-vegan-shrimp-paste-200g\">vegan shrimp paste</a><br>I don't know how widely available those alternatives are where shrimp paste is consumed the most, but my current sense is that the solution is likely more along the lines of cultural change, rather than technical innovation (though I'm sure a mix of the two would help)<br>Though I'm not super confident in this, and hopefully we'll be able to share more insights once our volunteer has finished the report :)</p>", "parentCommentId": "aQimwFCBsE85aKah7", "user": {"username": "AaronBoddy"}}, {"_id": "u3hQAounTY3w4YGTe", "postedAt": "2023-09-26T12:26:24.193Z", "postId": "Qo3559TqP5BzoQyWX", "htmlBody": "<p>Thanks for the information! That makes sense regarding the 1500/$/year number.&nbsp;</p><p>On shrimp paste, it's hard for me to know what the landscape looks like without more firsthand cultural experience/context. There are lots of vegan alternatives to other animal products, but improved cultivated or plant-based meat is still generally recognized as an important part of reducing e.g. hamburger consumption.&nbsp;</p>", "parentCommentId": "JZobXjpdkbqs457JF", "user": {"username": "MHR"}}, {"_id": "CptudmMEd8z9aDxw6", "postedAt": "2023-09-26T13:55:03.889Z", "postId": "Qo3559TqP5BzoQyWX", "htmlBody": "<p>Agreed - for me the biggest piece of the puzzle I don't currently understand is the cultural experience... Our volunteer writing the report is from the Philippines, so although we want the report to be global, we're hoping to have a sort of case study (maybe conduct a few interviews or something) on the Philippines to add some on-the-ground context that would be difficult to get from desk-based research alone.</p><p>Also, someone from EA Philippines also once told me that shrimp paste is often fed to whale sharks, in order to keep them present in the waters year-round to support the <a href=\"https://www.nationalgeographic.com/animals/article/whale-sharks-tourism-philippines-benefit-harm-news\">whale shark tourism industry</a>, and I'm not sure how many similar examples of complicating factors like this there are...</p>", "parentCommentId": "u3hQAounTY3w4YGTe", "user": {"username": "AaronBoddy"}}, {"_id": "3Jk8XgKRZkZuyKSEJ", "postedAt": "2023-09-26T18:55:25.189Z", "postId": "Qo3559TqP5BzoQyWX", "htmlBody": "<p>Congrats on what looks like a really successful first 2 years! I'm a big fan :)</p><p>I said this elsewhere, but the collaboration of many folks in the effective animal advocacy space that has led to work like this makes me really happy. (I think of the RP / CE / SWP collaboration here as an awesome success story for EA!)</p><p><strong>Some questions on your electric stunning </strong><a href=\"https://www.getguesstimate.com/models/22982\"><strong>guesstimate</strong></a><strong>:</strong></p><ul><li>The shrimp weights you're using (14g) seems kind of low compared to the <a href=\"https://www.getguesstimate.com/models/21679\">estimated mean weights</a> RP published recently (which have central estimates of 17g for L. vannamei and 36 for p. monodon). What are these based on? I think these could have a somewhat significant effect on your bottom line # of shrimp stunned</li><li>Looks like you're directly using the agreed upon % of shrimp to be stunned, when going from [population of shrimp in each region] -&gt; [number of shrimp you think SWP will affect].<ul><li>I'm wondering if you want to adjust this for the predicted follow through rate, which I think is a bit more similar to how folks have <a href=\"https://forum.effectivealtruism.org/posts/L5EZjjXKdNgcm253H/corporate-campaigns-affect-9-to-120-years-of-chicken-life\">done</a> corporate campaign evaluations in the past? (I'm not very familiar with the current literature / best practices here though!)</li><li>Do you have any tentative evidence on what the follow through / adherence rate is for stunning compared to the agreements made?</li></ul></li></ul>", "parentCommentId": null, "user": {"username": "Angelina Li"}}, {"_id": "vCDqPWdvdYHTQ4pX3", "postedAt": "2023-09-26T18:56:37.327Z", "postId": "Qo3559TqP5BzoQyWX", "htmlBody": "<p>I'd also be curious for your reasoning on why you aren't working on shrimp paste, if you have time!</p>", "parentCommentId": null, "user": {"username": "Angelina Li"}}, {"_id": "fY4eN5F33zPdHzKRA", "postedAt": "2023-09-27T16:50:09.682Z", "postId": "Qo3559TqP5BzoQyWX", "htmlBody": "<p>Hey Angelina - thank you so much for your kind words! It’s really heartwarming to see your enthusiasm and interest in our work :)</p><p><strong>Shrimp Size</strong><br>The corporate producers we're working with supply \"headless peeled shrimps\" (mainly to Northern Europe) which tend to be smaller on average for this market</p><p>This is different for example to \"head on, shell on shrimps\", which are typically larger (and are mainly supplied to Asia and Southern Europe)</p><p>As we sign more commitments globally, we'll likely want to supply ranges per producer depending on the market they supply</p><p><strong>Adjusting for predicted follow-through</strong><br>We decided not to discount our estimates in this first model because we're not sure how different this will look in practice between other types of corporate commitments and ours (i.e. comparing \"hens &amp; cage-free\", to \"shrimps &amp; stunners\")</p><p>The contexts seem different enough (producers, working in aquaculture, who are being bought equipment) that we don't think we can reasonably predict how this will translate&nbsp;</p><p>Our plan is that hopefully in a ~year's time we will have had some stunners in operation for long enough that we can accurately report on adherence rates, and update our numbers</p>", "parentCommentId": "3Jk8XgKRZkZuyKSEJ", "user": {"username": "AaronBoddy"}}, {"_id": "sd7wtvtsnypjCM2vN", "postedAt": "2023-09-27T16:56:20.092Z", "postId": "Qo3559TqP5BzoQyWX", "htmlBody": "<p>Absolutely - as I've hopefully made clear above, shrimp paste is one of the biggest areas in the shrimp welfare space that we think another project could have an impact!</p><p>There are a couple of reasons why SWP is not working on it:</p><ul><li>The contexts are very different<ul><li>Our current focus projects all operate within the context of: whiteleg shrimps, in aquaculture, being globally exported/imported.&nbsp;</li><li>Shrimp paste on the other hand, is likely to be different on all counts: Japonicus shrimps, Wild-capture fisheries, domestic Southeast Asia/Southern China markets</li><li>We essentially see this as requiring a different organisation with specialised knowledge</li></ul></li><li>We decided not to abandon whiteleg shrimps altogether to instead set up a \"Shrimp Paste Project\"<ul><li>We felt much more sure that whiteleg shrimps would be tractable, and tractability was very important early on, as there were a lot of unknowns</li><li>We think the world needs both a Shrimp Welfare Project and a Shrimp Paste Project (and likely more!), so fully pivoting from one to form the other we didn't think would make sense</li><li>We think our focus plays well to the co-founder's (and now the wider teams) strengths - whereas a shrimp paste org would likely benefit from co-founders with different skills and deeper cultural insights</li></ul></li></ul><p>As a final note, I think it's worth mentioning that Rethink Priorities' initial research on shrimp welfare informed the Charity Entrepreneurship team and led to our creation. We're super thankful to both and I'm really hopeful that RP's <a href=\"https://forum.effectivealtruism.org/posts/Fhoq7tP9LYPqaJDxx/shrimp-the-animals-most-commonly-used-and-killed-for-food\">latest work</a> leads to similar outcomes :)</p>", "parentCommentId": "vCDqPWdvdYHTQ4pX3", "user": {"username": "AaronBoddy"}}, {"_id": "ETFSsWwTpQg77PArp", "postedAt": "2023-10-01T19:39:06.296Z", "postId": "Qo3559TqP5BzoQyWX", "htmlBody": "<p>Got it, thanks for the response!! Really appreciate it :)</p>\n<p>On shrimp sizes:</p>\n<p>Ah, I missed that you were inferring number of individuals affected based on production tonnage. It sounds like 14g is your estimate for the size of an individual 'headless peeled shrimp's?</p>\n<p>If so: I can't quite tell whether all electrically stunned shrimp end up being counted as \"production\", or if e.g. some are not in good enough condition to be used in production. If the latter is true (if a big portion of electrically stunned shrimp do not end up in production), could you be undercounting the number of individuals actually affected here?</p>\n<p>This does seem like a nitpick though, and perhaps getting better evidence on how efficacious electric stunning is at improving shrimp welfare is the most relevant thing!</p>\n<p>On adherence:</p>\n<p>That makes sense! If you had the time, I'd be curious to know what your plan for monitoring adherence levels in the farms you partner with? No worries if you don't have the capacity to respond!</p>\n", "parentCommentId": "fY4eN5F33zPdHzKRA", "user": {"username": "Angelina Li"}}, {"_id": "mhvdfjRWDQPP2zHeD", "postedAt": "2023-10-02T23:01:38.374Z", "postId": "Qo3559TqP5BzoQyWX", "htmlBody": "<p>That is a very good point and one we hadn't really thought of.</p><p>The agreements don't specify whether the tonnage commitment refers to live weight equivalent (i.e. whole shrimp) or headless peeled weight. My sense is that, from context, producers are interpreting it as the former. We will think about whether to clarify this going forward in the agreements or whether we prefer the ambiguity as it might work in our favour.&nbsp;</p><p>Regarding monitoring adherence, as of right now, we feel our most sensible approach is to base it on the representations that the producers will be making to their buyers. Defaulting obligations to SWP seems pretty innocuous for producers but defaulting or misleading their buyers is a whole different ballgame and one that could cost them their business. This is the reason why we always try to have the buyers being party to the agreements stating that they will prioritise stunned shrimp.</p><p>Thanks for your interest in shrimp welfare and I hope this addresses your questions.&nbsp;</p>", "parentCommentId": "ETFSsWwTpQg77PArp", "user": {"username": "Andres Jimenez"}}, {"_id": "3j2cmEHHkFsH3EjdD", "postedAt": "2023-10-03T23:26:15.684Z", "postId": "Qo3559TqP5BzoQyWX", "htmlBody": "<blockquote><p>The agreements don't specify whether the tonnage commitment refers to live weight equivalent (i.e. whole shrimp) or headless peeled weight. My sense is that, from context, producers are interpreting it as the former.</p></blockquote><p>Gotcha — if this is true, then 14g again seems kind of low for the average shrimp weights to use here! I expect using the 14g estimate will cause you to overestimate how many individuals you are affecting. Anyway I think you are already tracking this now, so I will stop belaboring the point :) Glad you are following up on this!</p><p>(No longer stand by this sentence) <s>I'm a bit confused why the ambiguity would work in your favor: if producers are assuming the stunning requirements are based on live weight tonnage, doesn't this mean they have to stun fewer shrimp in order to meet your requirements?</s></p><blockquote><p>This is the reason why we always try to have the buyers being party to the agreements stating that they will prioritise stunned shrimp.</p></blockquote><p>Interesting! I wasn't aware there was such appetite amongst consumers to prioritise this issue — that's pretty encouraging, thanks for sharing!</p><p>Thank you both for all the work you do. Hope to see you around!</p>", "parentCommentId": "mhvdfjRWDQPP2zHeD", "user": {"username": "Angelina Li"}}, {"_id": "hwcrStjmceLyJHRPi", "postedAt": "2023-10-04T16:59:05.139Z", "postId": "Qo3559TqP5BzoQyWX", "htmlBody": "<p>I actually don't think that we would be overestimating. Your original intuition was correct.&nbsp;</p><p>The way it works in practice is that buyers ask for a certain size of shrimp (e.g. 14g). This is <u>always</u> quoted in live weight equivalent. Then comes the second criterion of being peeled, etc. This normally means that somewhere between 35-50% of the weight is lost. If we just use 50% for simplicity purposes, there are two possible scenarios:</p><ol><li>The producer assumes the agreement was for live weight equivalent and there is no change to our numbers, OR</li><li>The producer assumes that it refers to the volume actually sold. Because each shrimp weighs 50% less, we need to gross up our numbers by that factor, i.e. the number of individual shrimps would be 2x our estimate</li></ol><p>Hope this clarifies the issue.&nbsp;</p>", "parentCommentId": "3j2cmEHHkFsH3EjdD", "user": {"username": "Andres Jimenez"}}]