[{"_id": "6XFxbttNY8AaxeceC", "postedAt": "2024-03-20T05:44:37.750Z", "postId": "QptTu7QnF4S69opjB", "htmlBody": "<blockquote><p>Volunteer led programs are often run by <a href=\"https://www.youtube.com/watch?v=rCTJXFbieLw\">former clients&nbsp;turned group facilitators</a>, and these can often be much more cost-effective than staff led programs.</p></blockquote><p>Are these cost-savings due to not paying for labour, or because the staff are cheaper to train due to personal experience, or something else?</p>", "parentCommentId": null, "user": {"username": "huw"}}, {"_id": "EJCHrALC5HrmwBtdL", "postedAt": "2024-03-20T15:09:35.378Z", "postId": "QptTu7QnF4S69opjB", "htmlBody": "<p><strong>Executive summary:</strong> SoGive estimates that StrongMinds, a charity providing group psychotherapy in Africa, treats depression for $72.94 per person, after making subjective adjustments for partner contributions and expansion costs. Restricted funding focused on low-income countries may increase cost-effectiveness.</p><p><strong>Key points:</strong></p><ol><li>StrongMinds has an unusually strong monitoring and evaluation program for a mental health NGO, tracking before-and-after results and cost-effectiveness.</li><li>SoGive attributes 17% of impact to StrongMinds' partners, adjusting the cost per person treated from $64 to $72.94. This estimate involves many subjective judgment calls.</li><li>Restricting funding to low-income countries like Uganda and Zambia may increase cost-effectiveness to $62.56 per person, but this is uncertain.</li><li>StrongMinds' internal M&amp;E data is likely biased and inflated compared to the true effect, but is still useful for basic monitoring. Effect sizes should be estimated from academic studies.</li><li>StrongMinds has a good track record of increasing cost-effectiveness over time. Costs may continue to decline by around 14% per year.</li><li>SoGive favors relying on broad, high-quality meta-analyses rather than individual studies to estimate the true effect size of StrongMinds' intervention.</li></ol><p>&nbsp;</p><p>&nbsp;</p><p><i>This comment was auto-generated by the EA Forum Team. Feel free to point out issues with this summary by replying to the comment, and</i><a href=\"https://forum.effectivealtruism.org/contact\"><i>&nbsp;<u>contact us</u></i></a><i> if you have feedback.</i></p>", "parentCommentId": null, "user": {"username": "SummaryBot"}}, {"_id": "hTufgtZEjBhnzPnKy", "postedAt": "2024-03-21T00:05:05.380Z", "postId": "QptTu7QnF4S69opjB", "htmlBody": "<p>That's an interesting question and i don't know! I had myself implicitly been assuming it was from volunteer labor being unpaid for. But now that you put the question to me explicitly I realize that it could easily be due other factors (such as fewer expenses in some other category such as infrastructure, or salaries per staff, hypothetically). I don't think the answer to this question would change anything about our calculations, but if we happen to find out I'll let you know.<br><br>In an earlier draft I was considering counting the volunteer labor as a cost equal to the size of the benefits from the cash that the volunteer might have earned otherwise, but I left it off because it would have been too small of an effect to make a notable difference.</p>", "parentCommentId": "6XFxbttNY8AaxeceC", "user": {"username": "ishaan"}}, {"_id": "drJFfZ6GvLFkQTSD9", "postedAt": "2024-03-21T23:17:44.870Z", "postId": "QptTu7QnF4S69opjB", "htmlBody": "<p>Yeah, I was asking w/r/t that counterfactual cost of labour. Perhaps this is a dumb question, but if that cost would've been negligible, as you say, then what explains the gap? Is the counterfactual cost of volunteer labour really that much smaller than staff labour?</p>", "parentCommentId": "hTufgtZEjBhnzPnKy", "user": {"username": "huw"}}, {"_id": "CLg9PyRYvGsnPfZjj", "postedAt": "2024-03-23T22:57:49.130Z", "postId": "QptTu7QnF4S69opjB", "htmlBody": "<p>To clarify, when i said it \"would have been negligible\" what I meant more precisely is that \"doing voluntary unpaid labor does negligible harm (and probably actually confers benefits) to the volunteer, so I didn't factor it into the cost estimate\". &nbsp;This is very different from the question of \"how much would the cost change if the volunteers were to be paid\" - which is a question that I do not know the answer to.</p>", "parentCommentId": "drJFfZ6GvLFkQTSD9", "user": {"username": "ishaan"}}, {"_id": "nKbj8LSKwi9bkT7TX", "postedAt": "2024-03-23T22:58:36.121Z", "postId": "QptTu7QnF4S69opjB", "htmlBody": "<p>If you're interested in the question of why I figure that doing voluntary unpaid labor for most people involves negligible harm or opportunity cost of the type that ought to change our effectiveness estimate, my napkin calculation goes something like: suppose I personally were to replace half my compensated work hours with volunteering. That would be several tens of thousands of dollars of value to me and would half my income, which would be a hardship to me. But it should only take <a href=\"https://docs.google.com/spreadsheets/d/18ROI6dRdKsNfXg5gIyBa1_7eYOjowfbw5n65zkrLnvc/edit#gid=1680005064&amp;range=B19\">~$285.92</a> to \"offset\" that harm to me personally, by doubling someone else's income - theoretically the harm i experience for losing one day's labor can be fully offset by giving a givedirectly recipient <a href=\"https://docs.google.com/spreadsheets/d/1sNB40ot0sfa4v3OdF0Pv9F99hSKImbrjyTVfnISJeFU/edit#gid=1326347579&amp;range=B213\">0.78</a> cents. Obviously my own labor is <i>worth </i>more than 0.78 cents a day on the market, but matters being how they are, 0.78 cents seems to be around what it takes to \"offset\" the humanitarian cost to me personally (and the same to any volunteer, with respect to them-personally) of losing a day's labor.</p><p>Having established that, how much unpaid labor are we talking about?</p><blockquote><p>5-12 people who meet for 90 minutes a week, over six sessions.</p></blockquote><p>Assuming 8 hours of capacity-to-work per day, a volunteer does 5.6-13.5 days of labor per client treated. 1.5 hours × 6 sessions × (5 to 12 people) / 8 hour workday = 5.6-13.5 days of labor per client treated&nbsp;<br><br>So if we imagine that volunteers are actually missing work opportunities and sacrificing income in order to do this, $4.37-$10.53 donation to GiveDirectly per client treated might represent the cost to \"offset\" these potential \"harms\". But hopefully volunteers <i>aren't</i> actually choosing to forgo vital economic opportunities and taking on hardship in order to take on volunteer labor, and are doing it because they like it and want to and get something out of it, so maybe the true opportunity cost/disvalue to them is &lt;20% of the equivalent labor-hours, if not zero?<br><br>anyway, this all seems kind of esoteric and theoretical - just something i had considered adding to the analysis (because at first I had an intuition, perhaps one which you had as well to motivate your question, that volunteer labor isn't <i>really</i> free, just because it is unpaid), and then discarded because it seemed like the effect would be too negligible to be worth the complications it added. Like i said in the other comment, all of that is quite different from the other matter of what it might cost to <i>pay </i>a staff member or volunteer - staff and volunteers presumably have more earning potential as givedirectly recipients who are selected to be low income, and might be able command salaries much higher than that. And I don't, actually, know the answer with respect to what the program might cost if all volunteers were instead paid, or exactly to what extent main costs are actually about the labor of people directly playing therapist roles (total staff salaries vs other costs might be easier to grab, but that's answering a different quesiton than you asked, staff infrastructure won't be all about leading &nbsp;therapy sessions).&nbsp;</p>", "parentCommentId": "drJFfZ6GvLFkQTSD9", "user": {"username": "ishaan"}}]