[{"_id": "bTrZRdrmcGAGXjmNy", "postedAt": "2023-07-07T18:47:47.524Z", "postId": "QQFzQKoQdpd58wa6K", "htmlBody": "<p>In the 80k article, I noticed the claim that the Ukraine war had killed 'hundreds of thousands'.&nbsp;</p><p>Looking over various estimates collected on Wikipedia, as far as I can tell, it is around ~100,000. Is there a reason to believe it is much higher than this?</p><p>I felt uncertain whether to write this comment as it feels very pedantic, but I think making sure we get small details right is important to be credible about the speculative risk estimates that can't be easily looked up.</p>", "parentCommentId": null, "user": {"username": "MathiasKirkBonde"}}, {"_id": "xDdunmK9wm7S5Mxao", "postedAt": "2023-07-08T11:57:24.432Z", "postId": "QQFzQKoQdpd58wa6K", "htmlBody": "<p>Thanks for catching that, you're absolutely right. That should either read about 100,000 deaths or hundreds of thousands of casualties. I'll get that fixed.</p>", "parentCommentId": "bTrZRdrmcGAGXjmNy", "user": {"username": "Stephen Clare"}}, {"_id": "mRdbb82kXYTahPsqJ", "postedAt": "2023-07-10T12:47:04.582Z", "postId": "QQFzQKoQdpd58wa6K", "htmlBody": "<p>Thank you Stephen for your long engagement with this topic, because I do think it is a very real risk that Effective Altruists should pay more attention to.</p><p>In addition to the actions you proposed, I also wanted to suggest there might be promising actions in reducing conflicts of interests that incentivise conflict and escalate tensions. The high amounts of political lobbying, sponsoring of think tanks and universities, by weapons companies creates perverse inventives.&nbsp;</p><p>I have been very impressed by the work of the <a href=\"https://quincyinst.org/\">Quincy Institute</a> to bring attention to this issue, and to explore diplomatic options as alternatives to conflict. I would love to see 80000 Hours promote them on their job board or interviewed.</p><p>I've written to my local MPs about banning contributions from weapons makers (Lockheed Martin, Boeing etc...) to the Australian Gov't military think tank <a href=\"https://www.aspi.org.au/corporate-partners\">ASPI</a>. Here in Australia the recent AUKUS security pact has seen an enormous increase in planned military spending and sparked some discussion on the <a href=\"https://forum.effectivealtruism.org/posts/63ikKrPXCCx7Dhc3M/ea-views-on-the-aukus-security-pact\">forum</a>. I am trying to raise this as an issue/cause area to explore amongst Aussie EAs.</p>", "parentCommentId": null, "user": {"username": "Mohammad Ismam Huda"}}, {"_id": "5Eu4da956fJQiy7Kr", "postedAt": "2023-07-10T22:47:36.025Z", "postId": "QQFzQKoQdpd58wa6K", "htmlBody": "<p>Thanks for this post. Reducing risks <i>of</i> great power war is important, but also consider reducing risks <i>from</i> great power war. In particular working on how non-combatant nations can ensure their societies survive the potentially catastrophic ensuing effects on trade/food/fuel etc. Disadvantages of this approach are that it does not prevent the massive global harms in the first place, advantages are that building resilience of eg relatively self-sufficient island refuges may also reduce existential risk from other causes (bio-threats, nuclear war/winter, catastrophic solar storm, etc).&nbsp;<br><br>One approach is our ongoing project the <a href=\"https://adaptresearchwriting.com/2022/09/13/introducing-the-aotearoa-nz-catastrophe-resilience-project/\">Aotearoa New Zealand Catastrophe Resilience Project</a>.<br><br>Also, 100,000 deaths sounds about right for the current conflict in Ukraine, given that <a href=\"https://www.aljazeera.com/news/2023/7/10/new-data-uncovers-50000-russian-deaths-during-the-ukraine-war#:~:text=Independent%20Russian%20media%20shed%20light,of%20Moscow's%20closest%2Dheld%20secrets.&amp;text=Nearly%2050%2C000%20Russian%20men%20have,analysis%20of%20Russia's%20war%20dead.\">recent excess mortality analysis</a> puts Russian deaths at about 50,000.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Matt Boyd"}}, {"_id": "LxspzRhk6CqAaHziE", "postedAt": "2023-07-11T18:35:34.224Z", "postId": "QQFzQKoQdpd58wa6K", "htmlBody": "<p>Thanks for this! I agree interventions in this direction would be worth looking into more, though I'd also say that tractability remains a major concern. I'm also just really uncertain about the long-term effects.</p><p>I think the Quincy Institute is interesting but want to note that it's also <a href=\"https://www.tabletmag.com/sections/news/articles/quincy-trita-parsi-soros-koch-armin-rosen\">very</a> <a href=\"https://www.motherjones.com/politics/2022/07/quincy-institute-cirincione-eaton-resignations-nato-ukraine/\">controversial</a>. Seems like they can be inflammatory and dogmatic about restraint policies. From an outside perspective I found it hard to evaluate the sign of their impact, much less its magnitude. I don't think I'd recommend 80K put them on the job board right now.</p>", "parentCommentId": "mRdbb82kXYTahPsqJ", "user": {"username": "Stephen Clare"}}, {"_id": "4TBXPk5Kd9pknyQYW", "postedAt": "2023-07-12T09:35:10.805Z", "postId": "QQFzQKoQdpd58wa6K", "htmlBody": "<p>I largely agree with your assessment that Quincy is controversial and dogmatic about restraint/ non-intervention.</p>\n<p>That being said, they are a valuable source of disagreement in the wider foreign policy community, and doing something very neglected (researching &amp; advocating for restraint/non-intervention).</p>\n<p>I know Quincy staff disagree with each other, coming from libertarian, leftist, realist perspectives. So it is troubling that Cirincione departed because that difference in perspective is needed. Although I do suspect Parsi is describing things accurately when he says Cirincione left because he wanted the Institute to adopt his position in the Russian-initiated war on Ukraine.</p>\n<p>Quincy are exploring a controversial analysis in this current conflict in Russia-Ukraine, to identify if Russia's invasion could have been avoided in the 1st place (e.g. by bringing Russia into NATO way back when they were wanting to join), and advocating Ukraine and Russia compromise to reduce casualties (to be fair, it's reported the White House has also urged Ukraine to make compromises at times). Whilst controversial, I do think this is worthwhile, and I myself might disagree (and I believe they all disagree amongst themselves), I want to see this research/advocacy explored and debated. I had been nervous when the invasion started that Quincy's work could dip into Kremlin-apologetics, but they have seemed to steer away from that, and have nuanced perspectives.</p>\n<p>Their work on the Iran Nuclear Deal, the conflict in Yemen, is far less controversial, and promising.</p>\n<p>I find value in them being a counterbalance to the more hawkish think tanks which are much better resourced.</p>\n<p>On the 80K job board, you have a few institutions (well respected and worthwhile no doubt) like CSIS &amp; RAND, which are more interventionist and/or funded by arms manufacturers (even RAND is indirectly funded by the grants it receives from AEI), so I do worry that there is a systemic bias for interventionist views.</p>\n<p>I hope people don't write-off Quincy's work or other anti-interventionist/restraint-focused work entirely, but certainly agree, take it with a grain of salt. I certainly do.</p>\n", "parentCommentId": "LxspzRhk6CqAaHziE", "user": {"username": "Mohammad Ismam Huda"}}]