[{"_id": "u8bwuHzC2d7infPCf", "postedAt": "2014-09-28T18:53:31.277Z", "postId": "QrKzfKZWsgihQJpoj", "htmlBody": "<p>Thanks for writing this!  I'm interested in how you think one should prepare for interviews like these.  Did you write out your thoughts and what messages you wanted to communicate beforehand then try to work them into the conversation?  Do you meditate or exercise etc. to calm yourself down before the interview takes place? </p>\n", "parentCommentId": null, "user": {"username": "ClaireZabel"}}, {"_id": "g4ejGWEmYfpJkK8iK", "postedAt": "2014-09-29T03:17:00.955Z", "postId": "QrKzfKZWsgihQJpoj", "htmlBody": "<p>Doing any form of exercise that activates the parasympathetic nervous system, instead of the more anxious sympathetic is a good idea. I usually just try to sit laying back and not clench fists or contract the peripheral musculature to be more at ease. \nAbout preparing for an interview, you should have a mindset in which you can say what you want to say while also saying what they want you to say in one breadth, since then it's less likely to be cutoff. </p>\n", "parentCommentId": "u8bwuHzC2d7infPCf", "user": {"username": "Diego_Caleiro"}}, {"_id": "LhAHFufYQJjoLKLWq", "postedAt": "2014-09-30T14:13:26.450Z", "postId": "QrKzfKZWsgihQJpoj", "htmlBody": "<p>While I agree with a lot of what you wrote, I disagree about the 'all publicity is good if large enough' idea. </p>\n<p>You are entirely correct that you can get some good help from people at one end of the curve,  and at the start, this often feels like all that matters. For example, a company might think that if no-one currently knows about them, then all publicity is good as people can't reduce their purchasing from zero, but others might increase it. However if something is going to become reasonably big regardless of the coverage, then it can have bad effects. This is true even if one's own organisation is small, but the coverage can reflect badly on related organisations with similar goals (such as the rest of the EA movement). </p>\n<p>Bad publicity and bad first impressions can last a long time, and people looking for sensation can quite easily trawl through past coverage looking for the one bad sensational thing. If something inadvertently damaged the reputation of effective altruism, that would be a bad effect. If the damage was very high, that would be a really terrible effect. <em>Taking risks with this public good of the movement's reputation is something we should really discourage.</em></p>\n<p>All of this means that as an organisation or movement starts to get bigger, it should become much more conservative about reputational issues like this, though exactly where to draw the line is unclear. For what its worth, your example of the Rhys Southan article seemed to me to be on the right side of the line, and the transhumanist one seemed to me to be roughly neutral.</p>\n", "parentCommentId": null, "user": {"username": "Toby_Ord"}}, {"_id": "Ss3YHxcimuqd87nfQ", "postedAt": "2014-10-01T17:22:13.455Z", "postId": "QrKzfKZWsgihQJpoj", "htmlBody": "<p>I suppose there are some very different kinds of reputational costs, which backtracking will reach differently. So paying a reputational cost for the movement of appearing associated with a behavior that is considered morally incorrect in some cultures (for instance, being associated with substance abuse, or with unusual marital practices) might have significant social costs in the future, for the individual and the movement alike. </p>\n<p>However, thinking of how people feel embarrassed that they may say a sentence wrong, blush at the wrong time, slip on some statement, I tend to think people are over-calibrated about these minor, non-moral types of embarrassment. This sort of embarrassment grows frequently out of status anxiety, and this kind does not feel particularly costly. </p>\n<p>So I fully agree that as it grows larger, reputation should matter more, specially when it comes to reputation that mirrors our moral instincts.  </p>\n", "parentCommentId": "LhAHFufYQJjoLKLWq", "user": {"username": "Diego_Caleiro"}}, {"_id": "YCNMk79QprCeyeade", "postedAt": "2014-10-03T13:23:39.472Z", "postId": "QrKzfKZWsgihQJpoj", "htmlBody": "<p>I agree with this. I should clarify that the types of thing I am generally concerned about is coming off as too abrasive, too negative, too amateurish, or too associated with legal but disliked ideas that aren't part of our core considerations.</p>\n", "parentCommentId": "Ss3YHxcimuqd87nfQ", "user": {"username": "Toby_Ord"}}]