[{"_id": "JF7kfNzTcymYEjupq", "postedAt": "2014-09-28T19:21:45.135Z", "postId": "QRQkj2bXDL4JBbKE3", "htmlBody": "<p>FQXi has had some success with <a href=\"http://www.fqxi.org/community/contest\">essay contests</a> in the past. The most recent one appears to have had a prize pool of $20,000 and generated 155 submissions. If you have some unsolved EA-related questions, this might be a good way to buy progress on them.</p>\n<p>I think Max Tegmark was involved in the FQXi contests, so you could probably ask him how they went and if he had any advice for similar EA-related ones.</p>\n", "parentCommentId": null, "user": {"username": "Ben_Kuhn"}}, {"_id": "yDJonenGKe4awJbtX", "postedAt": "2014-09-28T19:26:00.830Z", "postId": "QRQkj2bXDL4JBbKE3", "htmlBody": "<p>You could offer scholarships! As Jess Whittlestone <a href=\"http://effective-altruism.com/ea/7x/supportive_scepticism/\">remarked</a>, as a community we're quite good at recognizing and putting down ineffective altruism, and not so good at recognizing when our own community members do awesome stuff. Awards or scholarships to EA community members could be a great way to balance that out.</p>\n", "parentCommentId": null, "user": {"username": "Ben_Kuhn"}}, {"_id": "Z9wq2wLMwGHB96Rnn", "postedAt": "2014-09-28T19:46:15.724Z", "postId": "QRQkj2bXDL4JBbKE3", "htmlBody": "<p>Fund a post for an EA to offer charity consultancy to charities to become more efficient in their particular mission.</p>\n<p>The EA approach is quite transportable, and in demonstrating its effectiveness in tackling a wide variety of charity problems it allows real engagement with a broad mainstream charity population - charities are very set in their ways and new thinking is exactly what many charities need, as well as it would provide a receptive forum to the EA concepts and top charities - very powerful communication via tell, show and do </p>\n", "parentCommentId": null, "user": {"username": "DavidRooke"}}, {"_id": "j4F5dxeGuLbXteCoy", "postedAt": "2014-09-28T19:46:20.040Z", "postId": "QRQkj2bXDL4JBbKE3", "htmlBody": "<p>Personally I'd give it to the best GiveWell-recommended charity that had room for more funding. You could make a pretty huge difference that way!</p>\n", "parentCommentId": null, "user": {"username": "Tom_Ash"}}, {"_id": "gS7buRHqLoRfTNdga", "postedAt": "2014-09-28T19:48:08.871Z", "postId": "QRQkj2bXDL4JBbKE3", "htmlBody": "<p>NB: There's some discussion of this at the EA Facebook group at <a href=\"https://www.facebook.com/groups/effective.altruists/permalink/749760868413606/\">https://www.facebook.com/groups/effective.altruists/permalink/749760868413606/</a></p>\n", "parentCommentId": null, "user": {"username": "Tom_Ash"}}, {"_id": "ocGqtgoWb9pyi5WSJ", "postedAt": "2014-09-28T20:10:13.207Z", "postId": "QRQkj2bXDL4JBbKE3", "htmlBody": "<p>My suggestion is that you use the money for influence matching. Influence matching (A term I am borrowing from give well) is where you use the large amount of money you have as an opportunity to combine the boring option with some a donation matching scheme specifically targeted at a group of people who are not currently within the Effective Altruism community - attempting to draw them in and use the matching as a &quot;hook&quot; to educate and bring new people into the community - over time having a multiplying  donation effect. </p>\n<p>I would imagine a good group to do this with is an online or offline community with some commitment to charity - but not one where EA is well known (For example a University Club, a Church or local humanist group, a non-EA blog readership or message board) . A recent good example is that Bill Gates partnered with a prominent youtuber (John Green) to produce an educational video on African nutrition and then offered a $100,000 donation matching scheme for the community of that vlogger - drawing them into the ongoing work of his foundation in that area through an email newsletter.</p>\n<p>Careful design would maximise the impact, and would require some thought but I suggest this as  it is boring+++ - it will do at least as much good as the &quot;boring&quot; option as well as having a significant additional impact potential (though I don't like the name - the opportunity to donate a large amount to an EA cause would be pretty exciting to me). For other options you need a very compelling case as to how it does does actually beat the boring option, and for $20,000 to $200,000 it seems unlikely that you would have the time or the resources to actually show that case beyond a somewhat fuzzy argument. </p>\n", "parentCommentId": null, "user": {"username": "AlasdairGives"}}, {"_id": "nyrnGeEuNEASgvqdN", "postedAt": "2014-09-28T20:29:27.857Z", "postId": "QRQkj2bXDL4JBbKE3", "htmlBody": "<p>This is a great idea, I heard that the dollar-per-dollar match offered in the <a href=\"http://www.charityscience.com/events1.html\">Charity Science walk</a> caused a big increase in the amount which people donated.</p>\n", "parentCommentId": "ocGqtgoWb9pyi5WSJ", "user": {"username": "toron"}}, {"_id": "HLjNw2a6Gi8CfBwSH", "postedAt": "2014-09-28T20:53:11.912Z", "postId": "QRQkj2bXDL4JBbKE3", "htmlBody": "<p>I assume its not something you'd want to devote much of a sum that large to, but small sums could support EA actions and projects via the <a href=\"https://impact.hackpad.com/EA-Funding-Network-on-Gittip-Oy8CJBZfrGl\">EA funding network</a> that Ozzie Gooen and Diego Caleiro and Bob Cordwell have started.</p>\n", "parentCommentId": null, "user": {"username": "toron"}}, {"_id": "djd2vvASz9AHGPG6X", "postedAt": "2014-09-28T21:09:26.476Z", "postId": "QRQkj2bXDL4JBbKE3", "htmlBody": "<p>If you have a proposal to fund a new type of project, or research, donate it to an (effective altruist) organization for a specific purpose you want to bring about. So, you have somebody with prior relevant work experience trying out your proposal, for possibly less money, and is recording the results. You, meanwhile keep more of the resource of your own time.</p>\n", "parentCommentId": null, "user": {"username": "Evan_Gaensbauer"}}, {"_id": "N5ef6mAKatCnwKx3H", "postedAt": "2014-09-28T21:12:08.215Z", "postId": "QRQkj2bXDL4JBbKE3", "htmlBody": "<p>Collect perspectives on wild-animal suffering.</p>\n", "parentCommentId": null, "user": {"username": "Evan_Gaensbauer"}}, {"_id": "qaKKtDqpdXRtThsjw", "postedAt": "2014-09-28T21:13:55.108Z", "postId": "QRQkj2bXDL4JBbKE3", "htmlBody": "<p>Thanks Alasdair; for what it's worth I consider this very close to many variants on the 'giving games' idea, in terms of using the money to draw people in while still making sure it goes to a good cause. One plausible issue with donation matching instead here is that it seems fake if the money is going to be donated anyway (giving games of pretty much any variant give a genuine, if perhaps constrained, choice); do you have a sense of how people react to that?</p>\n<p>Also, at some point in drafting this the word 'boring' was in inverted commas, as it is in your post. Not sure what happened to that...</p>\n", "parentCommentId": "ocGqtgoWb9pyi5WSJ", "user": {"username": "AGB"}}, {"_id": "X5rZ39b68ZB7zZzC2", "postedAt": "2014-09-28T21:19:15.779Z", "postId": "QRQkj2bXDL4JBbKE3", "htmlBody": "<p>Just so everyone knows, I thought about this same idea before, and I asked Holden Karnofsky at the 2014 effective altruism summit if he thought Givewell would ever go into consultancy. HIs opinion was that it's not something they would try for a long time, and which isn't part of their core mission as an evaluator.</p>\n", "parentCommentId": "Z9wq2wLMwGHB96Rnn", "user": {"username": "Evan_Gaensbauer"}}, {"_id": "zoHByyJ59e8iXwaDs", "postedAt": "2014-09-28T21:20:25.771Z", "postId": "QRQkj2bXDL4JBbKE3", "htmlBody": "<p>This is something I want to try when I can afford it in the future.</p>\n", "parentCommentId": "JF7kfNzTcymYEjupq", "user": {"username": "Evan_Gaensbauer"}}, {"_id": "otAaNTWzQYfvTBXcC", "postedAt": "2014-09-28T21:21:15.133Z", "postId": "QRQkj2bXDL4JBbKE3", "htmlBody": "<p>Ben Kuhn is on fire! Again, yes, I'd fund this in a couple years when I can donate more flexibly.</p>\n", "parentCommentId": "yDJonenGKe4awJbtX", "user": {"username": "Evan_Gaensbauer"}}, {"_id": "3KsT9y2ryHZAJTzeD", "postedAt": "2014-09-28T21:43:24.027Z", "postId": "QRQkj2bXDL4JBbKE3", "htmlBody": "<p>Well, donation matching schemes are very well known and accepted in the wider charity world. \n I agree with you there is some tension there - but it is a pretty relaxed one, I think people see it more as making a communal shared commitment than as being fake.</p>\n<p>With the Bill Gates example I mentioned, they reached their $100,000 donation in 2 days and currently are around $260,000 - obviously $100,00 is a trivial amount of money for Bill Gates, no-one looking at that video can have been like &quot;well if we don't reach the target maybe Bill Gates is going to not donate money to charity and spend it on hookers and blow&quot; - But they donated, in part i guess because they wanted to be part of their community and to show this was something they were thinking about and in alignment with this issue and donation event. </p>\n<p>But yes, the framing and structure -  how to make it seem genuine (the ultimate way of course would be a precommitment that any unmatched funds be used for some silly or negative purpose - but that seems even more icky), of how to engage that group event feeling and finally of how to make it a sticky thing beyond a one off event people get involved with and forget about - all would require some careful thought and planning. </p>\n", "parentCommentId": "qaKKtDqpdXRtThsjw", "user": {"username": "AlasdairGives"}}, {"_id": "aGAtmPbKaGfnu7Hpo", "postedAt": "2014-09-28T21:50:50.095Z", "postId": "QRQkj2bXDL4JBbKE3", "htmlBody": "<p>I quoted your post verbatim from FB, and it wasn't in quotes there. I can add them back if you want.</p>\n", "parentCommentId": "qaKKtDqpdXRtThsjw", "user": {"username": "Ben_Kuhn"}}, {"_id": "ajSBFPycdgLKYn98j", "postedAt": "2014-09-28T21:57:38.560Z", "postId": "QRQkj2bXDL4JBbKE3", "htmlBody": "<p>This isn't a concrete idea per se, but if you have a large enough income that the deduction cap on donations to registered charities might become an issue, you should consider &quot;trading donations&quot; with other folks to maximize tax deductibility.</p>\n<p>For instance, if you want to donate 60% of your income to tax-deductible charities, and someone else wants to donate less than 40% deductibly and 20% non-deductibly, you should instead both donate 50% deductibly and 10% non-deductibly.</p>\n", "parentCommentId": null, "user": {"username": "Ben_Kuhn"}}, {"_id": "8uDgDauvMuAzKTDaX", "postedAt": "2014-09-28T21:59:21.424Z", "postId": "QRQkj2bXDL4JBbKE3", "htmlBody": "<p>You could fund people to go to the EA retreat/summit, Good Done Right, CEA's Weekend Away, etc. who wouldn't otherwise go. I know someone who did this and it seems to have turned out fairly well so far. I don't know if they want to be named publicly but I can probably refer people who are interested.</p>\n", "parentCommentId": null, "user": {"username": "Ben_Kuhn"}}, {"_id": "sWfhZ7RvLWwwvfn2c", "postedAt": "2014-09-28T22:05:20.726Z", "postId": "QRQkj2bXDL4JBbKE3", "htmlBody": "<p>Promote the perspectives of prominent essayists on effective altruism such as <a href=\"http://www.utilitarian-essays.com/\">Brian Tomasik</a>, and <a href=\"http://www.rationalaltruist.com\">Paul Christiano</a>.</p>\n", "parentCommentId": null, "user": {"username": "Evan_Gaensbauer"}}, {"_id": "rgLo5eyPfX2hj4zdD", "postedAt": "2014-09-28T22:06:09.323Z", "postId": "QRQkj2bXDL4JBbKE3", "htmlBody": "<p>I've got empathy for having experienced a bit of a crunch like this last time. I would, or will, do this in the future.</p>\n", "parentCommentId": "8uDgDauvMuAzKTDaX", "user": {"username": "Evan_Gaensbauer"}}, {"_id": "S6usAqvBxnNYpKzXb", "postedAt": "2014-09-28T22:11:05.475Z", "postId": "QRQkj2bXDL4JBbKE3", "htmlBody": "<p>Taking people who are thinking about going into programming and funding their way through a coding bootcamp (or making it possible in other ways, like paying their rent for two months) would be one possible scholarship.</p>\n", "parentCommentId": "yDJonenGKe4awJbtX", "user": {"username": "Julia_Wise"}}, {"_id": "XMPy8CNR59Fj9y9Sf", "postedAt": "2014-09-28T22:12:56.235Z", "postId": "QRQkj2bXDL4JBbKE3", "htmlBody": "<p>This isn't necessarily for large funders, and wasn't my idea (if I remember correctly it's Leah Price's.) If you know young people who are thinking of pledging 10%, but are scared about the first few years  out of school when they will be harder up for money, sponsor their donations for the first year or two. It's unclear how this would work with actually taking something like the GWWC pledge, since it isn't exactly their money. And it would probably need to be someone you knew personally to know whether they actually intended to follow through with pledging after you helped them start.</p>\n", "parentCommentId": null, "user": {"username": "Julia_Wise"}}, {"_id": "rRgJC6ndWhyk9ywBw", "postedAt": "2014-09-28T22:37:30.235Z", "postId": "QRQkj2bXDL4JBbKE3", "htmlBody": "<p>The problem with most of these ideas is that they seem to require plenty of competent management, and until you can find the people to run them, they're going to be hard to pull off.</p>\n<p>If we're going to be spending far more money in the next few years, we're going to need to significantly increase the number of capable EA entrepreneurs.</p>\n<p>One way to spend a lot of money that would also help to develop more EA entrepreneurs would be to set up a fund to provide seed funding to new EA projects (plus connections, prestige etc.). A couple of hundred thousand dollars allocated with the promise of more to come, and with clear criteria for awards, sends a clear message: (i) there's money in this for competent entrepreneurs (ii) you can safely build your career here and commit to it for the long-term. This would help to attract talent to the community, which will allow us to spend much more in the coming years.</p>\n", "parentCommentId": null, "user": {"username": "Benjamin_Todd"}}, {"_id": "SBBS7knJkdhWfyo2v", "postedAt": "2014-09-28T22:45:17.054Z", "postId": "QRQkj2bXDL4JBbKE3", "htmlBody": "<p>I'm not sure I fully see the upsides of this idea. What are the reasons you'd expect it to be able to absorb a large amount of money at a high return? Having some token awards as a way to give recognition to people seems useful, but after that you're basically just transferring money between EAs. What are the advantages of that as opposed to trying to fund specific projects or giving it to GiveWell?</p>\n", "parentCommentId": "yDJonenGKe4awJbtX", "user": {"username": "Benjamin_Todd"}}, {"_id": "LiSXWM8L8pzDoLTnP", "postedAt": "2014-09-28T22:45:25.052Z", "postId": "QRQkj2bXDL4JBbKE3", "htmlBody": "<p>To expand on that a little, the EA summit was expensive enough that I expect the price to turn away most people not already fairly involved in the movement, and that seems like a lost opportunity.  </p>\n<p>On the other hand, you can start to do this with an order of magnitude less money.</p>\n", "parentCommentId": "8uDgDauvMuAzKTDaX", "user": {"username": "ruthie"}}, {"_id": "8tJnjFwGkngB7Mbti", "postedAt": "2014-09-28T22:46:23.966Z", "postId": "QRQkj2bXDL4JBbKE3", "htmlBody": "<p>I would probably suggest it ran out of Oxford as a separate project, as you can pick up the Halo effect.   It wouldn't sit well in a charity evaluator.   Sits better alongside 80,000 hours - how do I make the most difference with my life - how do we make the most difference with our charity? </p>\n", "parentCommentId": "X5rZ39b68ZB7zZzC2", "user": {"username": "DavidRooke"}}, {"_id": "kEGS7WWG8aQe94FzT", "postedAt": "2014-09-28T23:12:31.174Z", "postId": "QRQkj2bXDL4JBbKE3", "htmlBody": "<ol>\n<li><p>Even if it's only a small amount of funding, small funders probably won't want to do it (because it would take their entire budget and it's high-variance).</p>\n</li>\n<li><p>I think you can give away an awful lot of money before hitting diminishing returns, either by providing more scholarships or by increasing the amount. The ultimate win condition for a scholarship might look something like the Thiel Fellowship, for instance, which can absorb a ton of money.</p>\n</li>\n<li><p>If you give people non-token sums of money it can also change their behavior. Again, the Thiel Fellowship is a good example of this. If someone had awarded me $100k over two years during college, I would probably be doing something pretty different (and maybe more awesome, though of course that's hard to tell) right now.</p>\n</li>\n</ol>\n<p>EDIT: Downvoter, care to explain?</p>\n", "parentCommentId": "SBBS7knJkdhWfyo2v", "user": {"username": "Ben_Kuhn"}}, {"_id": "QQechZtGNvvNSyetc", "postedAt": "2014-09-28T23:18:54.031Z", "postId": "QRQkj2bXDL4JBbKE3", "htmlBody": "<p>I agree that having a better affordance for this seems important. That said:</p>\n<ol>\n<li><p>I don't think the management problem is <em>that</em> large: for instance, I have a full-time job and also a number of EA side projects.</p>\n</li>\n<li><p>There are principal-agent problems involved with having someone else manage your funds, so you might lose some effectiveness going from managing the projects you want to fund yourself to having someone else do it.</p>\n</li>\n</ol>\n<p>Another random note: It might be hard to convince people that this is viable long-term without some kind of endowment (although I'm not sure).</p>\n", "parentCommentId": "rRgJC6ndWhyk9ywBw", "user": {"username": "Ben_Kuhn"}}, {"_id": "FRh8jLgpA7EG7xkM4", "postedAt": "2014-09-29T01:19:08.935Z", "postId": "QRQkj2bXDL4JBbKE3", "htmlBody": "<p>(derail on voting)</p>\n", "parentCommentId": "j4F5dxeGuLbXteCoy", "user": {"username": "arrowind"}}, {"_id": "hvyWEGSAWqL2NHMm5", "postedAt": "2014-09-29T02:57:54.356Z", "postId": "QRQkj2bXDL4JBbKE3", "htmlBody": "<p>As a general warning, Toby Ord has said in the past that it's very easy to mess this up by making it disreputable.  I don't recall where the discussion took place or what his reasoning was, though.  I don't know the ins-and-outs of essay contests, but I want to heed his warning.</p>\n", "parentCommentId": "zoHByyJ59e8iXwaDs", "user": {"username": "Peter_Hurford"}}, {"_id": "sMfpXMEBGwxQQRbXT", "postedAt": "2014-09-29T02:59:40.251Z", "postId": "QRQkj2bXDL4JBbKE3", "htmlBody": "<p>Sorry you're getting downvoted for being too normal.</p>\n", "parentCommentId": "j4F5dxeGuLbXteCoy", "user": {"username": "Peter_Hurford"}}, {"_id": "hDeoPxSLz7SaZJ276", "postedAt": "2014-09-29T03:31:19.388Z", "postId": "QRQkj2bXDL4JBbKE3", "htmlBody": "<p>As someone who received a Large Sum of Money (as defined in this post) last year, here's what I actually did with it: </p>\n<ul>\n<li>spent some of it on my living expenses while I acquired skills to get a new job, then looked for a job</li>\n<li>invested it in Vanguard index funds</li>\n<li>donated a small portion of it</li>\n<li>spent more of it on living expenses when I decided to quit my job and look for a new one</li>\n<li>and most recently did a calculation regarding what I thought I could afford to lose, and invested that much money in individual stocks plus some in a startup founded by member of the rationalist community.</li>\n</ul>\n<p>I want to emphasize that the last step here is <em>something I cannot recommend anyone do with money they can't afford to lose.</em> But if your reason for saving/investing is to give later, being willing to make riskier investments makes sense, <a href=\"https://80000hours.org/2012/01/salary-or-startup-how-do-gooders-can-gain-more-from-risky-careers/\">just as riskier careers do</a>.</p>\n<p><strong>P.S.</strong> Perhaps I should be explicit that I find this post a bit odd, because the definition of Large Sum of Money used in this post doesn't seem all that large to me. For Bay Area techies, it could easily mean &quot;I am a Google employee and my RSUs just vested.&quot;</p>\n", "parentCommentId": null, "user": {"username": "TopherHallquist"}}, {"_id": "KaCcEAougMzsfWstT", "postedAt": "2014-09-29T04:05:13.312Z", "postId": "QRQkj2bXDL4JBbKE3", "htmlBody": "<p>Why did you invest in individual stocks? Did you have insider information about them?</p>\n", "parentCommentId": "hDeoPxSLz7SaZJ276", "user": {"username": "Ben_Kuhn"}}, {"_id": "hJgmDbGdJAqSDBxvx", "postedAt": "2014-09-29T04:43:30.263Z", "postId": "QRQkj2bXDL4JBbKE3", "htmlBody": "<p>As Carl points out <a href=\"http://reflectivedisequilibrium.blogspot.com/2014/01/if-big-donors-have-much-better.html\">here</a>, if big donors have better opportunities than small donors, the small donors can just purchase lotteries. In fact I think that you can get more than a 50% chance of doubling your money using typical risky investments, though this gets into <a href=\"http://rationalaltruist.com/2013/02/28/risk-aversion-and-investment-for-altruists/\">a more complicated discussion</a> about risk. $200,000 is small enough that you probably have access to the typical EA opportunities, so I suspect you shouldn't do anything differently than smaller EA donors.</p>\n<p>That said, I suspect that smaller EA donors should behave quite differently than they currently do, and thinking about what you might do with more money can serve to make this more clear.</p>\n<p>edited to add: I also think it's plausible that at the $100k level a donor should still be saving / trying to pool their money / being risk-loving / just giving it to existing EA orgs, because the amounts of time required to make a good decision even at the meta level--unless you've already found someone you trust who you can just hand the money to.</p>\n", "parentCommentId": null, "user": {"username": "Paul_Christiano"}}, {"_id": "gtyj26Xgs5W7cYy39", "postedAt": "2014-09-29T04:51:40.099Z", "postId": "QRQkj2bXDL4JBbKE3", "htmlBody": "<p>I suspect that funders in general, but especially altruists, and double-especially effective altruists, should be investing in prizes more on the margin. Briefly, some arguments in favor:</p>\n<ul>\n<li>It is much easier to evaluate interventions after the fact. In fact, that is what most EA donors are already doing, but in a way that forces an intervention to be very similar to something else that has already happened if it wants to be funded.</li>\n<li>The incentives created by prize funding tend to be much better.</li>\n<li>Standard mechanisms can overcome many of the costs of prizes (esp. the inability of prospective grantees / prize-recipients to fund their projects if they don't win a prize), and the development of such institutions would be a huge public good.</li>\n<li>The evaluation process for prizes tends to substantially reinforce EA values, as compared to the more typical grant-making process.</li>\n</ul>\n<p>There are a number of ways in which an economically sound EA prize would differ from usual philanthropic prizes (which are typically engineered with the PR impact in mind, rather than as a sustainable funding source). I hope to write a post about this eventually (both w.r.t. the economic arguments, and particularly promising opportunities at the moment). But I'm always interested in thoughts.</p>\n", "parentCommentId": null, "user": {"username": "Paul_Christiano"}}, {"_id": "3tZdd6WY84dSseqMB", "postedAt": "2014-09-29T04:55:20.147Z", "postId": "QRQkj2bXDL4JBbKE3", "htmlBody": "<p>I basically believe the efficient market hypothesis, but the inference/implication here doesn't seem right to me.</p>\n<p>The risk from investing in individual stocks rather than broad indices is pretty minor (and for philanthropic capital I think it is completely negligible), and if you accept the EMH the returns are the same. There are a number of other considerations (tax issues, small amounts of domain expertise or insight, hedging) that might lead one to purchase individual stocks instead. The amounts of money involved don't have to be too large before it starts to look worthwhile to be thinking about these issues.</p>\n", "parentCommentId": "KaCcEAougMzsfWstT", "user": {"username": "Paul_Christiano"}}, {"_id": "FLAGtFXpXn4yQB4D9", "postedAt": "2014-09-29T04:59:52.773Z", "postId": "QRQkj2bXDL4JBbKE3", "htmlBody": "<p>Are the considerations you mention written up in more depth anywhere? I'm not that familiar with some of them. Pointers?</p>\n", "parentCommentId": "3tZdd6WY84dSseqMB", "user": {"username": "Ben_Kuhn"}}, {"_id": "2ekSRciyyD7ZofoBn", "postedAt": "2014-09-29T13:27:06.682Z", "postId": "QRQkj2bXDL4JBbKE3", "htmlBody": "<p>I didn't downvote it, but I had a temptation to. I think that temptation came from tone rather than content -- as the original post talked about giving to charity as default option, and asked if you could do better, it felt like this post was ignoring the premise of the question (as opposed to saying something like &quot;I don't think the scale lets you beat giving to the best charities&quot;).</p>\n", "parentCommentId": "FRh8jLgpA7EG7xkM4", "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "BMr6hmrDK9gYPEAFP", "postedAt": "2014-09-29T13:28:40.882Z", "postId": "QRQkj2bXDL4JBbKE3", "htmlBody": "<p>I've been thinking along similar lines. I at least think this ought to be investigated further.</p>\n", "parentCommentId": "gtyj26Xgs5W7cYy39", "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "xXRs7FCKaQskEMJ6B", "postedAt": "2014-09-29T13:34:51.012Z", "postId": "QRQkj2bXDL4JBbKE3", "htmlBody": "<p>If some of the ideas generated here seem robustly better than the normal opportunities available to small donors, then the small donors should also consider grouping together to fund them.</p>\n", "parentCommentId": "hJgmDbGdJAqSDBxvx", "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "irsc7vpRyZSFhh47r", "postedAt": "2014-09-29T14:01:40.100Z", "postId": "QRQkj2bXDL4JBbKE3", "htmlBody": "<p>Nope. I bought Google, IBM, Microsoft, and a South American agribusiness company, all in an attempt to bet on guesses about long-term trends (information technology and maybe natural resources being really important). I'm unsure if this is a good idea—arguably I should focus on maximizing near-term expected returns—but it's something I'm doing now. For reasons Paul gave, it's at least no <em>worse</em> than investing in an index, but maybe I should have used the money for a larger Angel investment, I don't know.</p>\n", "parentCommentId": "KaCcEAougMzsfWstT", "user": {"username": "TopherHallquist"}}, {"_id": "N52fAraWY7A8hfzRc", "postedAt": "2014-09-29T14:07:23.096Z", "postId": "QRQkj2bXDL4JBbKE3", "htmlBody": "<blockquote>\n<p>if you accept the EMH the returns are the same.</p>\n</blockquote>\n<p>How come?</p>\n", "parentCommentId": "3tZdd6WY84dSseqMB", "user": {"username": "toron"}}, {"_id": "AL5MPnLDeA9T46dGL", "postedAt": "2014-09-29T14:25:27.144Z", "postId": "QRQkj2bXDL4JBbKE3", "htmlBody": "<p>If the returns were worse, the price would drop.</p>\n", "parentCommentId": "N52fAraWY7A8hfzRc", "user": {"username": "Paul_Christiano"}}, {"_id": "Zb7mfdHXmQdHTCJu2", "postedAt": "2014-09-29T14:26:36.011Z", "postId": "QRQkj2bXDL4JBbKE3", "htmlBody": "<p>It could be worse, mostly by correlating your investment returns with the general success of the tech sector (with which your ordinary income is tightly linked, and moreover which drives much effective altruist philanthropy).</p>\n", "parentCommentId": "irsc7vpRyZSFhh47r", "user": {"username": "Paul_Christiano"}}, {"_id": "v3cnGdBroSFh3hJhK", "postedAt": "2014-09-29T14:39:07.062Z", "postId": "QRQkj2bXDL4JBbKE3", "htmlBody": "<p>Interesting - is there empirical evidence that this in fact happens? </p>\n", "parentCommentId": "AL5MPnLDeA9T46dGL", "user": {"username": "toron"}}, {"_id": "65vb64rwddkLkeP9K", "postedAt": "2014-09-29T14:46:17.290Z", "postId": "QRQkj2bXDL4JBbKE3", "htmlBody": "<p>What would that look like? Ex post the returns of different stocks are very different. Ex ante, if you think some stock is going to have low returns, sell it short.</p>\n", "parentCommentId": "v3cnGdBroSFh3hJhK", "user": {"username": "Paul_Christiano"}}, {"_id": "wyGDY4Qbx2GmFNw76", "postedAt": "2014-09-29T15:17:12.636Z", "postId": "QRQkj2bXDL4JBbKE3", "htmlBody": "<p>Hey Owen, it'd be helpful to know for the future how I could improve the tone. I didn't take myself as ignoring the premise of the question; it asked &quot;If you acquired a large sum of money**, what would you do with it?&quot; and mentioned donating it as one possible (boring) option. So I was saying that this option would be my answer (and thereby providing a comment which could be upvoted by people who agreed). Implicit in this is that I do indeed think that an increase in donation size of this order doesn't let you beat the best charities - my understanding is that giving between $20,000 and $200,000 wouldn't exhaust their room for more funding?</p>\n<p>Thanks for the feedback,</p>\n<p>Tom</p>\n", "parentCommentId": "2ekSRciyyD7ZofoBn", "user": {"username": "Tom_Ash"}}, {"_id": "YbmnRe2ZDYz32YHCi", "postedAt": "2014-09-29T15:40:56.927Z", "postId": "QRQkj2bXDL4JBbKE3", "htmlBody": "<p>Yeah I thought about the implicit content and didn't think there was any problem (which is why I didn't downvote).</p>\n<p>It's always a little hard to pin down what rubs the wrong way about tone. But if I have a go, I guess I pick out two things:</p>\n<ul>\n<li>not referring back to the fact that the suggestion you were making was kind of in the original post;</li>\n<li>the second sentence sounds slightly patronising, <em>in the context of a thread where all the suggestions are meant to be things the posters think could make a big difference</em>.</li>\n</ul>\n<p>Either of those on its own seems fine (if not ideal), but in combination it felt a bit patronising.</p>\n", "parentCommentId": "wyGDY4Qbx2GmFNw76", "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "hi4dXHy9chWq7rQHe", "postedAt": "2014-09-29T15:58:49.065Z", "postId": "QRQkj2bXDL4JBbKE3", "htmlBody": "<p>OK thanks, that's helpful to know :)</p>\n", "parentCommentId": "YbmnRe2ZDYz32YHCi", "user": {"username": "Tom_Ash"}}, {"_id": "S9J4rqRumRo3PPny6", "postedAt": "2014-09-29T17:16:18.091Z", "postId": "QRQkj2bXDL4JBbKE3", "htmlBody": "<p>What do people think of: buying a property that you will live in?</p>\n<p>It has the advantages of giving later - as you can always sell the property - but has other advantages like significantly reducing living costs so that you could concentrate on entrepreneurial endeavours or EA entrepreneurial endeavours with a degree of financial stability and without eating through your savings etc.</p>\n", "parentCommentId": null, "user": {"username": "weeatquince"}}, {"_id": "rZnENhJcwYfnz9B48", "postedAt": "2014-09-29T18:22:57.169Z", "postId": "QRQkj2bXDL4JBbKE3", "htmlBody": "<p>Is the idea that buying is significantly more cost-effective than renting, so this'll let you donate more in the future? I believe whether thats true depends on which property market you're in.</p>\n", "parentCommentId": "S9J4rqRumRo3PPny6", "user": {"username": "arrowind"}}, {"_id": "HAtpj9Lq5hCGLZF54", "postedAt": "2014-09-29T18:25:06.399Z", "postId": "QRQkj2bXDL4JBbKE3", "htmlBody": "<p>i understand you finding the premise odd. However, it became apparent to me in the course of casual conversations that many people do indeed have an intuition that you should be able to do something 'clever' with sums on this level. Evidence for that Is provided by most of the rest of the comments. </p>\n", "parentCommentId": "hDeoPxSLz7SaZJ276", "user": {"username": "AGB"}}, {"_id": "T2Rer9LWQiJKZyF7S", "postedAt": "2014-09-29T18:52:54.920Z", "postId": "QRQkj2bXDL4JBbKE3", "htmlBody": "<p>To expand your reach, sponsor a contest in The MIT Climate CoLab contests for 2015 and you will get about 60 or 70 proposals that you can then sift through to find the ones you like the best, and fund that one.  By the way, the eighteen 2014 contests are about to close, so now would be a great time to look at the system and while there you can vote now and help us all to make progress in this important field.  And while you are there please do vote on our proposal among the others, at <a href=\"http://bit.ly/WINWGm\">http://bit.ly/WINWGm</a> </p>\n", "parentCommentId": null, "user": {"username": "davefinnigan"}}, {"_id": "wpy3vZqfhN6GnWf7L", "postedAt": "2014-09-29T20:07:38.252Z", "postId": "QRQkj2bXDL4JBbKE3", "htmlBody": "<p>(I didn't downvote!)</p>\n<p>I agree it has large room for more funding, but I'm still not sure why you'd expect the average returns to be that high. Why do you expect individual EAs to be a highly capital constrained in a way that can't be addressed by (i) founding a new organisation (ii) other existing mechanisms (student loans, friends + family, app academy's learn now pay later model, doing a part-time job on the side)? </p>\n<p>It seems like there could be a few good cases e.g. you know an EA who you think is really awesome, they want to do something that doesn't fit into an org (e.g. teach themselves marketing) and they're having to waste a lot of time earning money, and you can free them up by giving them 10-20k. But after that, the benefits seem modest. (though perhaps still worth doing).</p>\n<p>$10-$100k is a lot. For context, 80k's cost per historical significant plan change is a couple of thousand dollars.</p>\n<p>Perhaps you could tilt it more towards being a high-prestige fellowship style thing, and then hopefully (i) alter incentives (ii) give career capital to the most promising young EAs. This will require good branding though, and more effort selecting applications.</p>\n", "parentCommentId": "kEGS7WWG8aQe94FzT", "user": {"username": "Benjamin_Todd"}}, {"_id": "L2XbZiqtsxb2Bmhcf", "postedAt": "2014-09-29T21:13:37.404Z", "postId": "QRQkj2bXDL4JBbKE3", "htmlBody": "<p>I suspect you are not &quot;really trying&quot; / putting in an exceptional effort into your side projects. Nascent EA projects seem like entrepreneurship in that the low hanging fruit tends to be picked, so they consistently require an exceptional, devoted effort in order to actually make the desired impact. If the person who's working on an EA project is not devoting their life to it, I would generally expect the project to deliver average or below-average returns.</p>\n<p>Basically, I think Ben Todd is right in that EA projects need devoted, exceptional management.</p>\n<p>Further, I suspect some of these EA projects could be funded in a way which would generate a return for the fund. Many EA projects could be for-profit -- maybe you would require the project to demonstrate a plausible opportunity for profit, at least in the early stages of the fund?</p>\n", "parentCommentId": "QQechZtGNvvNSyetc", "user": {"username": "lincolnq"}}, {"_id": "qbmKkJju66CkXRASP", "postedAt": "2014-09-29T22:06:58.907Z", "postId": "QRQkj2bXDL4JBbKE3", "htmlBody": "<blockquote>\n<p>Nascent EA projects seem like entrepreneurship in that the low hanging fruit tends to be picked, so they consistently require an exceptional, devoted effort in order to actually make the desired impact. If the person who's working on an EA project is not devoting their life to it, I would generally expect the project to deliver average or below-average returns.</p>\n</blockquote>\n<p>I don't think your analogy holds up, and I don't think your conclusion is correct.</p>\n<p>Five years ago the EA movement didn't exist. Entrepreneruship has been around for centuries. This year, more businesses will be started than there are effective altruists in the world, probably by a factor of at least 100. I would be incredibly surprised if the low-hanging fruit depletion in EA projects were anywhere near comparable to that in entrepreneurship.</p>\n<p>Furthermore, there's plenty of evidence that non-full-time EA projects can have good returns. Harvard Effective Altruism has produced exceptionally good returns on an investment of less than 10% of its organizers' productive time (on average) in college. Max Tegmark founded FLI and FQXI with much less than full-time effort (I don't know precisely how much). I don't think anyone at CSER is working on it full-time.</p>\n<p>Some projects are good ideas and just aren't big enough to need full-time management.</p>\n<blockquote>\n<p>I suspect you are not &quot;really trying&quot; / putting in an exceptional effort into your side projects.</p>\n</blockquote>\n<p>Obviously I can't actually defend myself from this accusation until the results are in, but I think it's pretty uncharitable based on my track record.</p>\n", "parentCommentId": "L2XbZiqtsxb2Bmhcf", "user": {"username": "Ben_Kuhn"}}, {"_id": "2uLFaQWQHhrNFrhkh", "postedAt": "2014-09-29T23:34:26.263Z", "postId": "QRQkj2bXDL4JBbKE3", "htmlBody": "<p>What do you think is the relevant disanalogy between a hypothetical EA fellowship and the Thiel Fellowship? Most Thiel Fellows have access to the same funding sources as EAs (perhaps more, because VC funding is so abundant). But it seems pretty clear to me that the Thiel Fellowship has accomplished things that Thiel couldn't have done without spending as much money.</p>\n<p>Has 80k convinced anyone to try high-variance things using these other sources you listed as financing, other than starting a startup (which is easier to get funding for than lots of other good EA ideas)? If not, it seems like 80k plan changes aren't a good benchmark here, since they accomplish different things.</p>\n", "parentCommentId": "wpy3vZqfhN6GnWf7L", "user": {"username": "Ben_Kuhn"}}, {"_id": "ynLL9QFnThThwtC7t", "postedAt": "2014-09-30T05:07:00.102Z", "postId": "QRQkj2bXDL4JBbKE3", "htmlBody": "<p>Ok, fair enough.</p>\n<p>Edit: I changed my mind. I think Harvard EA is probably a great example of low hanging fruit. I don't know for sure whether someone else would have started it if you hadn't, certainly not anytime soon, and it probably does make an impact (by increasing the &quot;surface area&quot; of EA). </p>\n<p>(old comment which I no longer believe: &quot;My tone came off wrong, didn't mean to accuse you personally of ineffectiveness in side projects. Maybe you're an exception -- I haven't been following your projects closely -- but in general, I tend to think that it's really really hard to do a really good job, the kind where one could hope to move the needle on a global scale, unless one is constantly obsessing over the problems.&quot;)</p>\n", "parentCommentId": "qbmKkJju66CkXRASP", "user": {"username": "lincolnq"}}, {"_id": "ESPxWiBsRwTrptWgg", "postedAt": "2014-09-30T13:08:24.976Z", "postId": "QRQkj2bXDL4JBbKE3", "htmlBody": "<p>I'd be very interested in seeing a post from you on this. I don't think it is obvious that:</p>\n<blockquote>\n<p>double especially effective altruists should be investing in prizes more on the margin</p>\n</blockquote>\n<p>as it might be that the ideal investment in them at this stage is still zero, even if that would change later. The counterfactuals with prizes are actually quite hard to evaluate -- you could easily have no effect if the work was going to be done anyway (I think this bites harder here than in more typical granting). I'd love to see a well considered article on prizes, taking concerns like this into account.</p>\n", "parentCommentId": "gtyj26Xgs5W7cYy39", "user": {"username": "Toby_Ord"}}, {"_id": "uCbeCwBM9uZnfD4ei", "postedAt": "2014-09-30T15:09:46.111Z", "postId": "QRQkj2bXDL4JBbKE3", "htmlBody": "<p>(Historical note: I didn't actually start HEA, merely took it over after a complete leadership turnover. I do think that without my and John Sturm's intervention it would have gone defunct though.)</p>\n", "parentCommentId": "ynLL9QFnThThwtC7t", "user": {"username": "Ben_Kuhn"}}, {"_id": "HpuJqP32wstvCyiyu", "postedAt": "2014-09-30T17:29:13.580Z", "postId": "QRQkj2bXDL4JBbKE3", "htmlBody": "<p>I'm not particularly familiar with the positive impact of the Thiel Fellowship. If your argument is &quot;the Thiel Fellowship was very effective, therefore, setting up an EA equivalent could be a good idea&quot; that makes sense, though I wouldn't be able to personally get behind it without more detail on the results of the Thiel Fellowship and/or theoretical reasons to expect it to yield good returns. </p>\n<p>It also seems like there's more track record for a fund tilted more towards being a seed accelerator / angel investor for new projects, so we should do that first.</p>\n", "parentCommentId": "2uLFaQWQHhrNFrhkh", "user": {"username": "Benjamin_Todd"}}, {"_id": "Pu7gZaLnP5fAFYreg", "postedAt": "2014-09-30T18:51:53.211Z", "postId": "QRQkj2bXDL4JBbKE3", "htmlBody": "<p>I would weaken &quot;effective&quot; to &quot;had impacts that we might want to replicate&quot;, but yes. I actually think it operates quite similarly to an angel investor for projects (applicants are generally expected to come with an idea for what they'd work on), so we may be thinking of mostly the same thing!</p>\n", "parentCommentId": "HpuJqP32wstvCyiyu", "user": {"username": "Ben_Kuhn"}}, {"_id": "yQN9BjE5ke7sXAzd3", "postedAt": "2014-10-01T00:01:17.068Z", "postId": "QRQkj2bXDL4JBbKE3", "htmlBody": "<p>I was taking the difference to be that scholarships are more about funding individuals rather than organisations, and perhaps even individuals without a project in mind.</p>\n<p>I agree that a decent-sized fund that awards seed grants + expansion grants to EA projects is a good idea, as per my comment.</p>\n<p>I'm less sure about funding individuals, though I could see myself being persuaded. Funding individuals might be better for high-variance long-shots e.g. see this for a little evidence: \n<a href=\"http://pazoulay.scripts.mit.edu/docs/hhmi.pdf\">http://pazoulay.scripts.mit.edu/docs/hhmi.pdf</a>\nAlso it's plausible there's people out there who we trust due to their participation in the community, but who can't get funded by existing mechanisms (because those existing mechanisms don't trust them), so are funding-constrained. e.g. paying for someone in the community to do some valuable self-development or training.\nFinally, if made high-prestige enough, it could be a good way to generate career capital for people we want to back.\nThough, for all of this, you'd need a good mechanism for selecting the right people!</p>\n", "parentCommentId": "Pu7gZaLnP5fAFYreg", "user": {"username": "Benjamin_Todd"}}, {"_id": "z3PE6hnbE2ewtrs4n", "postedAt": "2014-10-02T04:21:20.192Z", "postId": "QRQkj2bXDL4JBbKE3", "htmlBody": "<blockquote>\n<p>The risk from investing in individual stocks rather than broad indices is pretty minor</p>\n</blockquote>\n<p>This depends a lot on how many stocks you're buying, right? Or would you still make this claim if someone were buying &lt; 10 stocks? &lt; 5?</p>\n", "parentCommentId": "3tZdd6WY84dSseqMB", "user": {"username": "ESRogs"}}, {"_id": "inGZq9wsFKWwosYj9", "postedAt": "2015-05-16T17:21:52.894Z", "postId": "QRQkj2bXDL4JBbKE3", "htmlBody": "<p>A tardy reply. But I presume there could be some evidence? If you try to think of any, can you? If not how could anyone have much confidence in this whatsoever?</p>\n", "parentCommentId": "65vb64rwddkLkeP9K", "user": {"username": "toron"}}, {"_id": "MoNYz6NrSpYhjNJF5", "postedAt": "2015-05-16T22:26:19.661Z", "postId": "QRQkj2bXDL4JBbKE3", "htmlBody": "<p>I don't quite understand what you are asking for here / what you are potentially disagreeing with. What kind of evidence do you expect? </p>\n<p>The average stock has the same returns as the index, that's the definition of the index (for some notion of average and some universe of stocks). If you are a good enough predictor, then from your perspective some stocks might have predictably low returns. And in that case you can trivially beat the market.</p>\n<p>There is a huge amount of evidence that when there is bad news about an asset's expected future returns, the price of that asset generally drops, raising the expected future returns. But I assume that's not what you are wondering about.</p>\n", "parentCommentId": "inGZq9wsFKWwosYj9", "user": {"username": "Paul_Christiano"}}]