[{"_id": "JwvtuREDktyMGA9hD", "postedAt": "2022-11-04T20:00:45.312Z", "postId": "QtrjaTpfj3agvF3iW", "htmlBody": "<p>Thanks for the write up :)\nQuick question, when would the charities prefer getting money through you rather than directly?</p>\n", "parentCommentId": null, "user": {"username": "edoarad"}}, {"_id": "f6rnDC3hXgaEZPWnr", "postedAt": "2022-11-04T20:35:39.464Z", "postId": "QtrjaTpfj3agvF3iW", "htmlBody": "<p>Specifically, it seems like any time a charity would prefer this approach, they would already be investing their own donations (and many organizations, like Wikipedia and universities, do).</p><p>The only thing I can think of is that maybe there are charities who would do this but don't want to because they think it will make them look bad on Charity Navigator.</p>", "parentCommentId": "JwvtuREDktyMGA9hD", "user": {"username": "relevantfiction"}}, {"_id": "zLCW8taaT9dhzACJh", "postedAt": "2022-11-04T20:44:03.804Z", "postId": "QtrjaTpfj3agvF3iW", "htmlBody": "<p>I can't find the article but I read something (an economics paper) suggesting that charitable trusts should invest in the companies most opposed to their mission (e.g. oil and gas for a climate change charity) to:</p><p>a) try to sabotage the companies via voting</p><p>b) hedge against the success of the companies (e.g. if oil and gas is still making a ton of money in 10 years, the climate change charity would than have likely outperformed the market and would have more money to fight back - and if the oil and gas companies go out of business, the climate change charity would not need the money because they would have already won the fight).</p><p>You should look into that.&nbsp;</p>", "parentCommentId": null, "user": {"username": "relevantfiction"}}, {"_id": "FcPK3jvMw7WGtd2dE", "postedAt": "2022-12-24T14:47:43.024Z", "postId": "QtrjaTpfj3agvF3iW", "htmlBody": "<p>Dear EdoArad,&nbsp;</p><p>apologies for the late reply! Someone had a similar question in <a href=\"https://forum.effectivealtruism.org/posts/n75rs7xu6zJMCMxpc/end-of-year-donations-give-for-good\">this forum post</a>. The answer is: many charities enthusiastically embrace Give For Good as a concept for two reasons: &nbsp;</p><ol><li>Many charities currently see their stable, periodic donations trending downwards. The reason for this is that there is an ongoing switch in how people donate. It used to be very normal to transfer a fixed amount periodically to your favorite charities. However, this is changing nowadays more towards one-time gifts based on campaigns (think ice bucket challenge) and tips from influencers and blogs/vlogs/podcasts. As a result, many charities can no count less and less on a stable, annual income. This is a challenge that Give For Good helps to solve.&nbsp;</li><li>We were told by several of the larger charities that their research has shown that the more 'methods' of giving there are, the more the overall income is. There is some degree of cannibalization between the different donation methods, but overall the income is more. So we understood from them that this is an extra method of income for them, which they expect will increase their overall income (especially long-term, given our model). Also, they expect that because of our model, we may be able to attract donors from sectors that are normally hard to reach for them (e.g. the financial sector).&nbsp;</li></ol><p>Hope that clarifies things! Let me know if you have any additional question, happy to answer them.</p><p>Rik</p>", "parentCommentId": "JwvtuREDktyMGA9hD", "user": {"username": "Rik"}}, {"_id": "fzZQCdvSBsBBDm2RY", "postedAt": "2022-12-24T14:51:22.979Z", "postId": "QtrjaTpfj3agvF3iW", "htmlBody": "<p>Dear Relevantfiction,</p><p>you are right, there are some organizations that do and Wikipedia and universities are good examples. But in our experience, many of the mainstream charities do not. This is partly for PR reasons as you indicate, because donors appreciate to see the direct action that was taken using their donated money. Another reason is that it can be illegal for charities to do so, because of legislation saying that charities can only hold money or investments as a reserve, not as a source of income.&nbsp;</p><p>We aim to change this, by explaining to donors why this is such a great system and how it can multiply the impact of each of your donations many times over! And we make it easy for people to support charities this way if they want: at the majority of charities, for regular-sized donations you cannot indicate currently that you want the donation to be invested, with the interest going to the charity.&nbsp;</p><p>best regards and a merry Christmas,&nbsp;</p><p>Rik</p>", "parentCommentId": "f6rnDC3hXgaEZPWnr", "user": {"username": "Rik"}}, {"_id": "buPyzSTBmmMbSfi2W", "postedAt": "2022-12-24T14:53:33.529Z", "postId": "QtrjaTpfj3agvF3iW", "htmlBody": "<p>thanks for this! Yes, this is a common discussion in sustainable finance at the moment, whether it is better to divest from such companies or to invest in them and influence their decision making via voting.&nbsp;</p><p>We have opted for ESG and SRI investment funds that exclude these companies because the two groups involved in our donation system, donors and the charities, often desire this.&nbsp;</p><p>best regards,<br>Rik</p>", "parentCommentId": "zLCW8taaT9dhzACJh", "user": {"username": "Rik"}}]