[{"_id": "CGwBfHfRpJQRmwTaR", "postedAt": "2024-01-18T14:47:44.099Z", "postId": "Qw5kwJhgbr6HSWHsJ", "htmlBody": "<p><strong>Executive summary</strong>: The author describes several heuristics for evaluating the trustworthiness of scientific results, focusing on the strength of evidence, scrutiny from practitioners, consensus in the literature, social biases, and tests for publication bias.</p><p><strong>Key points</strong>:</p><ol><li>Results based on experimental evidence are more trustworthy than those relying solely on observational data and causal inference.</li><li>Results used extensively by practitioners under high scrutiny warrant more trust.</li><li>A large, diverse academic literature supporting a finding instills confidence.</li><li>Consider the study's external validity and statistical power.</li><li>Account for potential social desirability biases.</li><li>Formal tests showing no publication bias increase trustworthiness.</li></ol><p>&nbsp;</p><p>&nbsp;</p><p><i>This comment was auto-generated by the EA Forum Team. Feel free to point out issues with this summary by replying to the comment, and</i><a href=\"https://forum.effectivealtruism.org/contact\"><i>&nbsp;<u>contact us</u></i></a><i> if you have feedback.</i></p>", "parentCommentId": null, "user": {"username": "SummaryBot"}}, {"_id": "rrnSXnqjXthAMisei", "postedAt": "2024-01-18T17:47:45.894Z", "postId": "Qw5kwJhgbr6HSWHsJ", "htmlBody": "<p>Thanks for this, a really nice write up. I like these heuristics, and will try to apply them.</p><p>On the intuition behind how to interpret statistical power, doesn't a bayesian perspective help here?</p><p>If someone was conducting a statistical test to decide between two possibilities, and you knew nothing about their results except: (i) their calculated statistical power was B (ii) the statistical significance threshold they adopted was p and (iii) that they ultimately reported a positive result using that threshold, then how should you update on that, without knowing any more details about their data?</p><p>I think not having access to the data or reported effect sizes actually simplifies things a lot, and the Bayes factor you should update your priors by is just B/p (prob of observing this outcome if an effect / prob of observing this outcome if no effect). So if the test had half the power, the update to your prior odds of an effect should be half as big?</p>", "parentCommentId": null, "user": {"username": "tobycrisford"}}, {"_id": "nNZbKqAFWb9qwmdzy", "postedAt": "2024-01-18T18:36:25.136Z", "postId": "Qw5kwJhgbr6HSWHsJ", "htmlBody": "<p>Yeah, I think a Bayesian perspective is really helpful here and this reply seems right. &nbsp;</p>", "parentCommentId": "rrnSXnqjXthAMisei", "user": {"username": "Nathan_Barnard"}}, {"_id": "dnMe823wJqkJHkyd6", "postedAt": "2024-01-19T12:31:14.888Z", "postId": "Qw5kwJhgbr6HSWHsJ", "htmlBody": "<blockquote>\n<p>What’s more, in areas that use primarily observational data there’s a really big gap between fields in how often papers even try to use causal inference methods and how hard they work to show that their identifying assumptions hold.</p>\n</blockquote>\n<p>Just highlighting this paragraph because I think it's extremely important. As a policymaker, the vast majority of research I see from think tanks etc include poorly justified assumptions. It's become one of the first things I look for now, in part because it's an easy prompt for me to spot a wide range of issues.</p>\n", "parentCommentId": null, "user": {"username": "Khorton"}}, {"_id": "iin6emAFDg7rChMZR", "postedAt": "2024-01-19T22:12:36.030Z", "postId": "Qw5kwJhgbr6HSWHsJ", "htmlBody": "<p>For an interesting take on the (important) argument around statistical power:<br>Gelman's The “What does not kill my statistical significance makes it stronger” fallacy:<br>https://statmodeling.stat.columbia.edu/2017/02/06/not-kill-statistical-significance-makes-stronger-fallacy/</p>", "parentCommentId": null, "user": {"username": "simon"}}, {"_id": "KLHsDEMRfBGQmSzpN", "postedAt": "2024-01-24T14:53:01.422Z", "postId": "Qw5kwJhgbr6HSWHsJ", "htmlBody": "<p>Nice post, Nathan! Relatedly, I recommend <a href=\"https://ourworldindata.org/randomized-controlled-trials\">Why randomized controlled trials matter and the procedures that strengthen them</a> by Our World in Data.</p>", "parentCommentId": null, "user": {"username": "vascoamaralgrilo"}}]