[{"_id": "NnMNTbNYmvu99SWmD", "postedAt": "2015-01-10T19:25:57.175Z", "postId": "QWBkjXAweqpQ5fCFN", "htmlBody": "<p>It's definitely an interesting idea.</p>\n<p>It may be more natural to compare to the situation where you have the same tax level but it's going to the government, rather than the case where the you have less tax. That way we don't have to consider the welfare or incentive effects of changing the tax rate.</p>\n<p>Advantages compared to general taxation:</p>\n<ul>\n<li>May be easier to build support for</li>\n<li>Allows targeting of very high-value opportunities</li>\n</ul>\n<p>Disadvantages compared to general taxation:</p>\n<ul>\n<li>Money gets distributed according to what sounds good</li>\n<li>Encourages people to give to charities that benefit them</li>\n</ul>\n<p>I think this last could be a big one. If this tax were in place I'd expect to see a lot more money going to services (art galleries etc.) providing public goods in rich neighbourhoods.</p>\n<p>The penultimate one could also be a problem. At least in the UK, government spending is meant to go past cost-benefit analysis. This keeps it doing a reasonable job of funding effective things and skipping ineffective things. This tax looks better the worse-run government spending is.</p>\n<p>Even with good government spending it could end up having a beneficial effect if it increased the proportion of money spent on international aid. I'm not sure whether we should expect that.</p>\n", "parentCommentId": null, "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "NwKeQTbuzX7oqpJhk", "postedAt": "2015-01-11T23:53:30.228Z", "postId": "QWBkjXAweqpQ5fCFN", "htmlBody": "<p>This would create an additional (and large) incentive for people to funnel their money through faux-charities, and to create faux-charities that'll circuitously direct it back into the pockets of the donors, either fraudulently or legally, like Owen_Cotton-Barratt said.</p>\n<p>There are responses you could make to this (watchdog organizations that monitor the effectiveness of various charities and governmental authority, tighter laws regarding charitable incorporation) but so far as I can see they're all subject to the principal-agent problem.</p>\n<p>Other than that I like the idea.</p>\n", "parentCommentId": null, "user": {"username": "SASS"}}, {"_id": "kcWPzypuh6K9CRvYK", "postedAt": "2015-01-12T01:22:42.010Z", "postId": "QWBkjXAweqpQ5fCFN", "htmlBody": "<p>This sounds pretty similar to what we already have for tax deductions in the United States.  Or did I misunderstand you?</p>\n", "parentCommentId": null, "user": {"username": "Peter_Hurford"}}, {"_id": "A37RLiPFZFHPMtStE", "postedAt": "2015-01-12T02:01:00.716Z", "postId": "QWBkjXAweqpQ5fCFN", "htmlBody": "<p>From what I understand, donations usually result in tax deductions equal to a portion of the donation (I think 15-30% in Canada) but the article suggests basically making them 100% tax deductible.</p>\n", "parentCommentId": "kcWPzypuh6K9CRvYK", "user": {"username": "Bitton"}}, {"_id": "XRoccEtRP8r4WBef6", "postedAt": "2015-01-12T02:18:17.752Z", "postId": "QWBkjXAweqpQ5fCFN", "htmlBody": "<p>Reading the original article, it seems his argument is basically</p>\n<blockquote>\n<p>If the government raises taxes by $1000, I only pay an extra $1000\nBut everyone else is forced to pay too, so the total raised is $300,000,000,000 - administration costs - <a href=\"https://www.khanacademy.org/economics-finance-domain/microeconomics/consumer-producer-surplus/deadweight-loss-tutorial/v/taxation-and-dead-weight-loss\">deadweight loss</a>\nSo it's as if my donation was matched 300,000,000 times!</p>\n</blockquote>\n<p>But this is an obviously fraudulent argument - it only works if you don't care about the huge costs being imposed on everyone else. That $299,999,999,000 has to come from other people, and all the additional associated costs. Once you take into account the cost to them, there is no matching, only value destruction.</p>\n<p>Owen points out that you could instead hold tax levels constant and think of it as an alternative to government-directed tax spending, which seems like the more interesting half of the idea.</p>\n", "parentCommentId": null, "user": {"username": "Dale"}}, {"_id": "NCxJQngXKKenMmJv9", "postedAt": "2015-01-12T02:32:40.209Z", "postId": "QWBkjXAweqpQ5fCFN", "htmlBody": "<blockquote>\n<p>Money gets distributed according to what sounds good</p>\n</blockquote>\n<p>Isn't that largely the case with government spending anyway? We have many government programs that merely sound good to voters/politicians without actually having much economic justification - from the ethanol mandate to the minimum wage to corporate welfare to the war on drugs to <a href=\"http://effectivereaction.wordpress.com/2014/08/23/rct-as-i-say-not-as-i-do/\">healthcare that fails RCTs</a> to state funded art. My impression is the UK is in many regards similar to this. Whether replacing this with charity allocation would lead to more or less 'stuff that sounds good but is actually useless' seems like an open question rather than a clear mark against the policy. </p>\n", "parentCommentId": "NnMNTbNYmvu99SWmD", "user": {"username": "Dale"}}, {"_id": "FXicutFdqg7YowwnW", "postedAt": "2015-01-12T14:18:12.191Z", "postId": "QWBkjXAweqpQ5fCFN", "htmlBody": "<p>I think how it works in the US is that you subtract the amount you donated (up to 50% of your income) from your income, and then the tax you pay is some percentage of that lowered income.</p>\n<p>Example (over-simplified):</p>\n<p>Income: $80,000 --&gt; Taxes (15%): $12,000</p>\n<p>Income: $80,000, Donations: $15,000 --&gt; Taxable income: $65,000</p>\n<pre><code>--&gt; Taxes (15% (or maybe you'd fall into a lower tax bracket)): $9,750\n</code></pre><p>So in this example, even though you donated $15k, your taxes only went down by $2,250.</p>\n", "parentCommentId": "kcWPzypuh6K9CRvYK", "user": {"username": "Gina_Stuessy"}}, {"_id": "FnoXdLmDRxhQhfTZF", "postedAt": "2015-01-12T14:39:44.975Z", "postId": "QWBkjXAweqpQ5fCFN", "htmlBody": "<p>Yeah, as Gina points out, tax deductions are different, they let you reclaim a fraction of what you donate. e.g. if you're getting taxed at a plausible marginal rate of like 40%, then, assuming you don't drop into a lower tax bracket, you effectively get 40% of the amount you donated back.</p>\n<p>In the link, the proposal is that if everyone's getting taxed 40%, you instead tax everyone at 41%, and they choose where to send that extra 1%.</p>\n", "parentCommentId": "FXicutFdqg7YowwnW", "user": {"username": "RyanCarey"}}, {"_id": "tMi7xcu5vvuBGhFgJ", "postedAt": "2015-01-18T19:16:07.259Z", "postId": "QWBkjXAweqpQ5fCFN", "htmlBody": "<p>During the policy comment project by the UMD effective altruism group, we found that in some government agencies there actually is a degree of cost effectiveness analysis and meritocracy. This leads me to expect that the government will do slightly better than the population at deciding where to give in a more direct manner. The government is less likely to actually go through with something like the ALS ice bucket challenge, but when you have this sort of tax system it seems to me that such things might get economically damaging levels of funding, and that this will discourage future donations and charity in general.</p>\n<p>Effective altruism needs to be much more popular for this tax idea to have a chance of being a good thing. </p>\n", "parentCommentId": "NCxJQngXKKenMmJv9", "user": {"username": "Gentzel"}}, {"_id": "ga5XQDFMEZehFxZGS", "postedAt": "2015-01-18T19:28:58.851Z", "postId": "QWBkjXAweqpQ5fCFN", "htmlBody": "<p>If people select efficient enough charities, the benefits might outweigh the damage of deadweight loss, and value destruction via higher taxes. The thing is, this charity tax doesn't seem to guarantee donation matching, it just increases the likelihood hat people will donate to something.</p>\n<p>Maybe I am being confused by ambiguity, but the situation I imagined was that the government increases income tax between 1% and 10% and that the pool of money generated by this is given back to people who donate as a tax credit. If I donate $1,000 to AMF, I get $1,000 back from the government: but no guarantee that others will donate to AMF.</p>\n", "parentCommentId": "XRoccEtRP8r4WBef6", "user": {"username": "Gentzel"}}]