[{"_id": "B9nhKzpDo9Xej7wfW", "postedAt": "2022-01-09T09:36:17.187Z", "postId": "QXpxioWSQcNuNnNTy", "htmlBody": "<p>[I'm doing a bunch of low-effort reviews of posts I read a while ago and think are important. Unfortunately, I don't have time to re-read them or say very nuanced things about them.]</p><p>This is a concept that's relatively frequently referred back to, I think? Which seems like a reason to include it.</p><p>I think it's pointing to a generally important dynamic in moral debates, though I have some worry that it's a bit in \"soldier\" mindset, and might be stronger if it also tried to think through the possible strengths of this sort of interpretation. I'm also not sure quite how critical this dynamic is to EA causes, as opposed to some more general consequentialist vs. deontology debate.</p><p>I'm not sure whether we should include this, but I think its current karma is too low.</p>", "parentCommentId": null, "user": {"username": "Maxdalton"}}, {"_id": "zYzkhR56oYzgCxCdo", "postedAt": "2023-05-09T15:39:49.333Z", "postId": "QXpxioWSQcNuNnNTy", "htmlBody": "<p>Replying a year later - I think you have a point about the soldier mindset. The reason I wrote it this way originally was because I was writing it for myself first. I felt afraid to involve myself in things for fear I would feel responsible ever after, I was often afraid of doing a little because I could not commit myself to doing a lot, and I felt an aversion to a lot of positive-sum interactions. I've gotten better at those things, but it's still hard.<br><br>I think a lot has been written to this effect since by other people, but if I were to write a follow-up it would be focusing on the alternative rather than attacking what I called \"The Copenhagen Interpretation\" here. It's okay to help a little. If something helps you a lot and someone else a little and no one gets hurt or is worse off, then the world is better off. Be wary of the temptations to overlook harms - but always remember that the true goal is to help, and sacrifice is only a means. If you can help without sacrifice, so much the better.</p>", "parentCommentId": "B9nhKzpDo9Xej7wfW", "user": {"username": "jai"}}]