[{"_id": "TGEsWPRvQzWSp7DKH", "postedAt": "2024-01-11T21:42:31.897Z", "postId": "QyXcTAhzcQeLDckGL", "htmlBody": "<p>I love that you are doing this!</p>\n<p>I think a broader title might be more helpful, though -- many of the questions you list are not really social science questions, but, for example, about consumer psychology (a behavioral science) or techno-economics (e.g. the alt protein R&amp;D return questions).</p>\n<p>I.e. there is a broader set of people who might help answer these questions, many of which would not understand themselves as social scientists.</p>\n", "parentCommentId": null, "user": {"username": "jackva"}}, {"_id": "GmfmvrRff2oC6aKBE", "postedAt": "2024-01-11T23:00:30.242Z", "postId": "QyXcTAhzcQeLDckGL", "htmlBody": "<p>Very nice! Apropos of:</p><blockquote><p>Which settings are most conducive to running rigorous experiments on dietary change interventions, and how can these settings be accessed/used? (For example, college cafeterias allow data on purchases to be used, so that researchers don’t have to rely on self-reports.)</p></blockquote><p>I'd suggest retirement communities. We have a fair bit of data on changing the eating habits of college students (I review the most rigorous studies in that literature in<a href=\"https://forum.effectivealtruism.org/posts/k9qqGZtmWz3x4yaaA/environmental-and-health-appeals-are-the-most-effective\"> this meta-analysis</a>), but much less on adults, and essentially nothing on older people. Like college cafeterias, retirement communities offer a lot of opportunities for oblique monitoring, as well as a bevy of potential qualitative outcomes (e.g. staff members who know that 'Daisy always orders the chicken' might observe that she finishes less of her meat after watching the movie 'Babe'). My <a href=\"http://www.donaldgreen.com/\">advisor</a> suggested this empirical strategy a few weeks ago and I think it's on the money.</p><p>As it happens, my coauthor and I suggest some studies we'd like to see in <a href=\"https://forum.effectivealtruism.org/posts/k9qqGZtmWz3x4yaaA/environmental-and-health-appeals-are-the-most-effective#6_4_Next_steps_for_researchers__five_promising_theories_of_change_that_call_for_rigorous__large_scale_testing\">section 6.4 of that meta-analysis</a>, and I'm working now and getting some of these off the ground. I'd be glad to hear any feedback you might have.&nbsp;</p>", "parentCommentId": null, "user": {"username": "setgree"}}, {"_id": "jzGhdtc7dTvAQyTCk", "postedAt": "2024-01-12T03:01:02.574Z", "postId": "QyXcTAhzcQeLDckGL", "htmlBody": "<p>I'd consider psychology and economics in general to be social sciences, and that would include consumer psychology and at least parts of techno-economics.</p><p>However, almost all of the questions in <a href=\"https://forum.effectivealtruism.org/posts/QyXcTAhzcQeLDckGL/social-science-research-on-animal-welfare-we-d-like-to-see#Other_questions_\">Other questions</a> are definitely not social science questions, and instead animal behaviour/ethology, animal cognition, zoology more generally, ecology and philosophy, although some approaches in common with social sciences might be useful.</p><p>Also \"What are the most tractable and cost-effective interventions to improve wild animal welfare?\" seems more like a generalist and/or interdisciplinary research question, although it could involve some social science.</p>", "parentCommentId": "TGEsWPRvQzWSp7DKH", "user": {"username": "MichaelStJules"}}, {"_id": "CFZvoJ4anQgCpnn86", "postedAt": "2024-01-12T09:47:43.568Z", "postId": "QyXcTAhzcQeLDckGL", "htmlBody": "<p>We agree on economics, it's more that techno-economic analysis is quite different (just had someone on my team do techno-economic work that would be relevant to this list, but she is maximally far from a social scientist in skillset and self-identification).</p>\n<p>I think for some parts of social psychology it might be considered a social science, though in general most social scientists would say the definition of social science is something like \"the dependent variable are societal-level phenomena\" by which economics, political science, sociology etc. are social sciences, but psychology is clearly not (and in most universities, psychology would not be in the social sciences department).</p>\n<p>But I think we agree on the broader point that the current title is a bit of a misnomer.</p>\n", "parentCommentId": "jzGhdtc7dTvAQyTCk", "user": {"username": "jackva"}}, {"_id": "xtoAQbAKjj9ijg6pT", "postedAt": "2024-01-12T15:47:09.257Z", "postId": "QyXcTAhzcQeLDckGL", "htmlBody": "<p>Social sciences are concerned with much more than societal level phenomena. Relationships and interactions between people count, too.</p>\n<p>FWIW, my experience in Canada has been that psychology is typically part of the faculty of social sciences (or a combined one with humanities and/or arts).</p>\n", "parentCommentId": "CFZvoJ4anQgCpnn86", "user": {"username": "MichaelStJules"}}, {"_id": "3wLjnphfgX9b6CGZ7", "postedAt": "2024-01-13T20:21:30.318Z", "postId": "QyXcTAhzcQeLDckGL", "htmlBody": "<p>Thanks for sharing, Martin and Emma! I think posts like yours are great because they help people get a better sense of which questions are decision-relevant for funders. I would very much welcome similar posts from Open Phil highlighting questions in other areas.</p>", "parentCommentId": null, "user": {"username": "vascoamaralgrilo"}}, {"_id": "timbLpfgbMjQJd9WX", "postedAt": "2024-01-14T18:45:30.993Z", "postId": "QyXcTAhzcQeLDckGL", "htmlBody": "<p>Thanks for putting together this excellent list, Martin and Emma. This is just in time for my lab's upcoming brainstorming session on future research priorities.</p>", "parentCommentId": null, "user": {"username": "Maya Mathur"}}, {"_id": "hy9ccdrdQHAxq6RQq", "postedAt": "2024-01-21T02:07:11.599Z", "postId": "QyXcTAhzcQeLDckGL", "htmlBody": "<p>Thanks, this is relevant for researchers and people funding research and prioritizing/evaluating it. This includes <a href=\"http://Unjournal.org\">Unjournal.org</a>; we are looking to prioritize the evaluation of research relevant to animal welfare, and we have built/are building a 'field specialist' team focusing on this.&nbsp;<br><br>&nbsp;Some expansion on the theory of change/paths to impact/logic model for some of the leading cases could be particularly helpful. (You mention we should reach out to Martin Gould on this -- I plan to do so.)</p><p>While some of these might be amenable to simpler 'desk research' (literature reviews, simple BOTECs, coalescing information), I think many of the more interesting ones could require some heavier lifting in terms of research depth and methodological expertise. I'm not saying the '80% of the 80/20 research' would not necessarily have value here, but it is my sense is that more in=depth rigorous work may be warranted, and potentially worth funding.</p><p>For example:<br>&nbsp;</p><blockquote><p>&nbsp;By how many years do animal welfare corporate commitmets speed up reforms that might eventually happen anyway due to factors like government policy, individual consumer choices, or broad moral change?</p></blockquote><p>This is a challenging causal inference question; while case studies and 'plausible inference' from qualitative approaches could have value. It could also potentially be addressed quantitatively with methods like difference-in-differences, synthetic panels, and natural experiments. This might also require some expertise in dynamic/time-series models. It seems high-value, given that funding corporate campaigns have been claimed to be among the highest-impact animal welfare opportunities.</p><blockquote><p>What percentage of people will be veg*n in 20, 50, or 100 years?</p></blockquote><p>I guess the ToC here is that this informs the priority one should give to interventions to improve farmed-animal welfare conditions ... because 'if most people are vegan anyways, it matters less. Or perhaps this is about the cost side of increasing global prosperity (meat-eaters dilemma) or supporting pro vs anti-natal policies?<br><br>I suspect predicting this out 100 years will be extremely difficult, in the sense that quantitative models and expertise might have little value. But for 10 or 20 years out, I think social science modeling expertise could be meaningful.&nbsp;</p><p>But some of the other questions seem more straightforwardly amenable to quantitative social science work, including careful and feasible RCTs, and sometimes non-RCT causal inference methods, and Bayesian statistical inference and presentation. E.g., &nbsp;</p><blockquote><p>How impactful would it be to get already sympathetic celebrities to speak up more on animal welfare?</p></blockquote><p>Looking at simple before/after comparisons, or aggregating casual media reporting on this could be misleading. An RCT here seems feasible.</p><blockquote><p>...What is the impact on sales of labeling laws that restrict the terms that can be used to describe/sell PBMAs and other plant-based products? &nbsp;&nbsp;</p></blockquote><p>This seems like something mainstream academic/professional economists might consider or already be considering, perhaps in conjunction with legislative testimony or court cases. It seems amenable to formal empirical analysis, perhaps in the 'empirical industrial organization/quantitative marketing' literatures. But it is by no means simple... to estimate impact on quantities sold, considering competitive price responses, responses of substitute products, time trends and seasonality, etc.&nbsp;</p>", "parentCommentId": null, "user": {"username": "david_reinstein"}}]