[{"_id": "PX2eYHKiw9HsLZLv3", "postedAt": "2023-12-04T09:36:25.129Z", "postId": "QYz2Ek5tQ6Cr2oRfg", "htmlBody": "<p>You should talk to <a href=\"https://forum.effectivealtruism.org/users/brad-west?mention=user\">@Brad West</a>&nbsp;</p>", "parentCommentId": null, "user": {"username": "John Salter"}}, {"_id": "PQ3WPgqmQ85QfiZB8", "postedAt": "2023-12-04T09:58:12.445Z", "postId": "QYz2Ek5tQ6Cr2oRfg", "htmlBody": "<p>I think <a href=\"https://forum.effectivealtruism.org/users/daniel_wyrzykowski?mention=user\">@Daniel_Wyrzykowski</a> is working on something in this area</p>", "parentCommentId": null, "user": {"username": "Amber"}}, {"_id": "s6sH9JsKThWtPuPMt", "postedAt": "2023-12-04T16:23:00.961Z", "postId": "QYz2Ek5tQ6Cr2oRfg", "htmlBody": "<p>I like the idea.</p>\n<p>Have you tried talking to those brands and see if they would be open to moving the donations to effective causes, instead of starting a new company from scratch?</p>\n", "parentCommentId": null, "user": {"username": "JoanMM"}}, {"_id": "KZGdaJdLZ3MkAd7LL", "postedAt": "2023-12-04T16:46:53.117Z", "postId": "QYz2Ek5tQ6Cr2oRfg", "htmlBody": "<p>What's even more... With a business like Thankyou (or Newman's Own, Patagonia) where a charitable foundation is in the shareholder position there isn't really necessarily a reason that prices would be higher. Basically, all the businesses have shareholders, this business form just capitalizes on the identity of a potentially popular shareholder. The main disadvantage is that it is difficult to raise capital for these businesses, but I think this problem could be overcome if strong evidence can be established for a competitive advantage for Profit for Good businesses.</p>\n<p>The below essay conveys more of my thoughts. If you are interested in trying to fund effective charities through the consumer economy, I've set up a nonprofit for that purpose and would definitely be interested in talking to you. My email: <a href=\"mailto:brad@consumerpoweriniative.org\">brad@consumerpoweriniative.org</a></p>\n<p><a href=\"https://forum.effectivealtruism.org/posts/WMiGwDoqEyswaE6hN/making-trillions-for-effective-charities-through-the\">https://forum.effectivealtruism.org/posts/WMiGwDoqEyswaE6hN/making-trillions-for-effective-charities-through-the</a></p>\n", "parentCommentId": null, "user": {"username": "Brad West"}}, {"_id": "nAbuPzR9sPoCDAGPN", "postedAt": "2023-12-07T01:46:52.323Z", "postId": "QYz2Ek5tQ6Cr2oRfg", "htmlBody": "<p>Thanks for the vote of confidence. My third last paragraph on the secondary path to impact begins talking to this.</p>\n<p>I think further investigation is required to inform whether to ask, or to pursue other tactics to shape the behaviour of the existing market.</p>\n<p>It's not one or the other - the existing market can be shaped as well as a competitor product introduced.</p>\n<p>Some of the value of introducing a competitor over only shaping the behaviour of the existing market is:</p>\n<ul>\n<li>that we exert continuous pressure on the current market to give effectively</li>\n<li>we can be assured that donations will be directed to effective causes - we are not be beholden to the whims and changing pressures on those businesses</li>\n<li>we are insulated from non-EA  reputation risks and the reputations of effective charities are safeguarded by participants in the effective altruism movement more directly.</li>\n</ul>\n", "parentCommentId": "s6sH9JsKThWtPuPMt", "user": {"username": "dEAsign"}}, {"_id": "9EcCDHQeLia4nt34F", "postedAt": "2023-12-07T02:16:46.190Z", "postId": "QYz2Ek5tQ6Cr2oRfg", "htmlBody": "<p>Pinging @Daniel_Wyrzykowski for comment</p>\n", "parentCommentId": "PQ3WPgqmQ85QfiZB8", "user": {"username": "dEAsign"}}, {"_id": "ezkBSktM7mufFE59T", "postedAt": "2023-12-07T02:43:09.300Z", "postId": "QYz2Ek5tQ6Cr2oRfg", "htmlBody": "<p>Thanks for commenting. I have just taken a look at your essay and associated entities as well as the unfairly condescending but informative comments it received.</p>\n<p>It looks like our ideas are aligned. Some initial thoughts from me:</p>\n<p>To make an scalable impact and safeguard or contribute favourably to the reputation of effective charities, I think our product offering should be at least as good as the current market. Drawing on success stories like Patagonia, and the rationale that consumers of premium products are more interested in brand differentiation - I think we should focus on offering premium products only, whatever the category of good.</p>\n<p>From the sample I saw, the problem I see with CPI associated entities is they look frankly like white labelled low cost products sold online on less than slick websites - that likely will not be found unless people are really looking for them in order to donate - and those people likely already donate to effective charities - so contractually it might be marginally harmful but would be very skeptical about dollars moved to date.</p>\n<p>I think there's a point to be made that the comparative advantage of people in our movement is effective charity rather than effective business, so I see the case for CPI. Perhaps a good change in strategy for CPI is to focus on partnering with existing companies in need of differentiation, rather than spawning businesses from within the EA ecosystem?</p>\n<p>That being said, our movement doesn't necessarily lack the capacity for or to develop in house profit for good entrepreneurship - just as charity entrepreneurship capabilities have been built. However, from the lack of hands up to cofound in this comments section, it looks like further 'field building' is required to construct a coherent direction with this strategy. Otherwise, I expect my idea here will languish the way the other entities in your ecosystem appear to. Please do correct me if I'm mistaken - if funding has been forthcoming, committed volunteers coming forward or revenues healthy for instance</p>\n", "parentCommentId": "KZGdaJdLZ3MkAd7LL", "user": {"username": "dEAsign"}}]