[{"_id": "jimcSpCMLSPHxMkbD", "postedAt": "2023-10-08T16:34:54.421Z", "postId": "R9GbQQksznh2SwS4y", "htmlBody": "<p>This post is incredibly eloquent, well-written, and disturbing.</p>\n<p>I will need several days, minimum, to fully process the implications of people who have committed felonies being active in Silicon Valley AI, and good actors getting systemically driven out.</p>\n<p>I sense the second and third order effects are much greater and more disturbing than anyone realizes.</p>\n<p>Thank you for writing this post.</p>\n", "parentCommentId": null, "user": {"username": "MP"}}, {"_id": "ttYmzbNuB8ijp9ySa", "postedAt": "2023-10-08T16:51:34.900Z", "postId": "R9GbQQksznh2SwS4y", "htmlBody": "<p>I might have more to say later. All I can say right now is that I am familiar with these stories.</p>\n", "parentCommentId": null, "user": {"username": "J"}}, {"_id": "Jj6voY5ipJaufnS34", "postedAt": "2023-10-08T17:16:29.312Z", "postId": "R9GbQQksznh2SwS4y", "htmlBody": "<p>Thank you for this absolutely brilliant expose. I know too many people who have stories like these ones.</p>\n<p>I worry about the broader effects on AI alignment,  given that Silicon Valley AI is somewhat selecting for bad actors.</p>\n<p>I have a lot more to stay but will take some time to process everything here first.</p>\n", "parentCommentId": null, "user": {"username": "Lucretia"}}, {"_id": "AtKbQqCFoYwnaDhmb", "postedAt": "2023-10-08T19:11:37.285Z", "postId": "R9GbQQksznh2SwS4y", "htmlBody": "<p>For some of these acts of ostracization, silencing, and harm, would it be possible to name which organizations/individuals did these<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefq8n5fjwz6zc\"><sup><a href=\"#fnq8n5fjwz6zc\">[1]</a></sup></span>? I'd like to lessen/avoid contact with them.</p><p>I understand that concerns about libel probably exist for some, and concerns about the victim's privacy probably exist for some of the scenarios. No need to respond if you prefer to not share any additional information.</p><p>&nbsp;</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnq8n5fjwz6zc\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefq8n5fjwz6zc\">^</a></strong></sup></span><div class=\"footnote-content\"><p>Something like:</p><p>• <i>[ORG_A] revoked a job offer from someone after she was raped.</i></p><p><i>• [NAME_1] was the administrator of a group chat that removed a member after she spoke up about sexually assaulted.</i></p><p><i>• [NAME_2] shared a home address with encouragement for harassment.</i>&nbsp;</p><p><i>• I was uninvited from [CONFERENCE_X]</i>.</p></div></li></ol>", "parentCommentId": null, "user": {"username": "jlemien"}}, {"_id": "PCYcxogw6YFJEZEv5", "postedAt": "2023-10-08T19:13:30.765Z", "postId": "R9GbQQksznh2SwS4y", "htmlBody": "<p>Thanks for posting and drawing more attention to this. I can only imagine that it takes <strong>a lot</strong> of courage to write about this in such a public manner. I hope you and your friends have all the support the you need.</p><p>Reading this makes me feel really angry and sad, both that an initial violation occurs, and also that later harm occurs.</p>", "parentCommentId": null, "user": {"username": "jlemien"}}, {"_id": "WedpKBmkuFvq6n5n3", "postedAt": "2023-10-08T19:48:16.534Z", "postId": "R9GbQQksznh2SwS4y", "htmlBody": "<p>I've been thinking about this, too. What are recommended practices for naming bad actors? I'm tempted to name some right here in the comments, but I'm concerned that few others might notice or care since it's in a sub-comment, making the risk alerting them into action not worth it.</p><p>Some might identify themselves by attacking this post, downvoting, or jumping into action against women who might report them. We might spot them in the shadows by paying attention.</p>", "parentCommentId": "AtKbQqCFoYwnaDhmb", "user": {"username": "Mandelbrot"}}, {"_id": "vHJWj6mfctQbkNyAv", "postedAt": "2023-10-08T21:01:07.526Z", "postId": "R9GbQQksznh2SwS4y", "htmlBody": "<p>'A wealthy social class of a particular type of neurodivergence dominates the culture. Many people formally or informally identify on the autism spectrum. Openness to new experiences is high, and mind-altering drugs are common and popular. Akin to royal courts of the past, exclusive events are where deals are made and new companies are founded. It creates an environment that can be extremely fun and stimulating, but also dangerous and unaccountable. With drugs, parties, overflowing testosterone, a lack of communication skills, and blindness to social cues, consent violations happen easily and frequently.'<br><br>As a man with an Asperger's Diagnosis from childhood, who is quite visibly autistic*, and not in tech, I feel kind of in two minds about whether I object to this passage.&nbsp;<br><br>On the one hand, sadly, I do suspect that it is in fact true that men with autism are more likely to commit sexual assault**. And I generally lean on the side of people saying stuff that is true and relevant, even if it is a bit non-PC, so it'd be kind of hypocritical for me to condemn the authors outright.&nbsp;<br><br>On the other hand, this is, effectively, an attack on a minority that already (in most contexts) faces a lot of bullying ( <a href=\"https://www.tandfonline.com/doi/full/10.1080/13603116.2014.981602)\">https://www.tandfonline.com/doi/full/10.1080/13603116.2014.981602)</a> and hostility. (I suspect some of the hostility may in some sense be a reasonable response to how we behave but I doubt <i>all</i> of it is.) I also <i>suspect</i> we face higher rates of workplace discrimination, though from quick googling I wasn't able to find a high-quality looking study measuring this directly, as opposed to a lot of poor-quality looking papers asserting this was a known fact and then measuring a different but related thing. (Again, I admit that the line between \"discrimination\" and \"people reasonably reacting to autistic behaving badly\" can get blurry, but I doubt this accounts for all discrimination.) And it's an attack being presented in passing without any supporting statistical evidence being cited whatsoever. Imagine if you experienced things like articles coming out in scientific journals about how everyone instantly dislikes you and there's nothing you can do about it (https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5286449/), or read things that made you realize you (probably) weren't &nbsp;just being paranoid when you thought people automatically narrowed circles you were standing in to exclude you at social and professional events <a href=\"https://leiterreports.typepad.com/blog/2020/10/on-being-a-philosopher-with-autism.html.\">https://leiterreports.typepad.com/blog/2020/10/on-being-a-philosopher-with-autism.html.</a> And then suddenly you had people planting the idea you were more likely to be rapists on the public forum of the social movement you are involved in. It is quite distressing.&nbsp;<br><br>I don't know if I think the authors should have left it out. But I'd at least like people to discuss this sensitively, and remember that for me, the quoted passage is not just a bit of sociological scene-setting before we move on to the important stuff. It's more like a reminder of the reasons why in grad school I told one of the people writing a reference for me \"no, don't say that my stimming doesn't get in the way of my teaching, because I'm scared that if people hear I'm on the spectrum, they'll assume I'm a high sexual harassment risk\".&nbsp;<br><br><br><br>*I.e. I stim (https://www.autism.org.uk/advice-and-guidance/topics/behaviour/stimming) visibly enough that drunks in bars have assumed I'm learning disabled and in need of a minder, I've been verbally mocked in the street for my body language, and also in one case a bunch of German lads on a night out in a bar in Kreuzberg came over to mock me for rocking back and forth and got really quite menacing.&nbsp;<br><br>**I'm less confident this extends to the kind of deliberate, planned predation this post discusses elsewhere, as opposed to simply ignoring boundaries in the moment.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Dr. David Mathers"}}, {"_id": "8bs8tvHxv5aFu5iuH", "postedAt": "2023-10-08T21:01:18.199Z", "postId": "R9GbQQksznh2SwS4y", "htmlBody": "<blockquote>\n<p>L was abused several times. She went on to study misogyny and reported about it to the Effective Altruism community. Her work was dismissed. She named her abusers in an elaborate post, then took her own life. Her accusations were dismissed.</p>\n</blockquote>\n<p>I could be missing reasons not to do this, but would you be able to link to the post that you mention? I think that could give me a lot of context and it seems especially relevant to this community.</p>\n", "parentCommentId": null, "user": {"username": "calebp"}}, {"_id": "HhoPWtexFp7zTmFpN", "postedAt": "2023-10-08T21:03:10.423Z", "postId": "R9GbQQksznh2SwS4y", "htmlBody": "<p>The primary requirement would be getting the permission of the victims, as naming the perpetrators could expose the victims to retaliation by the bad actors.</p>", "parentCommentId": "WedpKBmkuFvq6n5n3", "user": {"username": "titotal"}}, {"_id": "5mbHFb6iRCBjH3big", "postedAt": "2023-10-08T21:09:37.432Z", "postId": "R9GbQQksznh2SwS4y", "htmlBody": "<p>Good idea. Here it is: <a href=\"https://medium.com/@itai.ilyich/if-i-cant-have-me-no-one-can-kathleen-rebecca-forth-born-april-11-1980-31c49ed15121\">If I Can’t Have Me, No One Can (Kathleen Rebecca Forth — Born April 11, 1980) | by Itai Emberwell | Medium</a></p>", "parentCommentId": "8bs8tvHxv5aFu5iuH", "user": {"username": "Mandelbrot"}}, {"_id": "pSLuigumwjenoF2Zz", "postedAt": "2023-10-08T21:38:54.164Z", "postId": "R9GbQQksznh2SwS4y", "htmlBody": "<p>I believe that these accusations are false. See <a href=\"https://forum.effectivealtruism.org/posts/t5vFLabB2mQz2tgDr/i-m-a-22-year-old-woman-involved-in-effective-altruism-i-m?commentId=R7uP533Xr7sL75Yqx\">here</a> for previous discussion.</p>", "parentCommentId": "5mbHFb6iRCBjH3big", "user": {"username": "Buck"}}, {"_id": "39hfHFtF759eeEpqK", "postedAt": "2023-10-08T21:40:06.677Z", "postId": "R9GbQQksznh2SwS4y", "htmlBody": "<p>Note that L was the only example in your list which was specifically related to EA. I believe that that accusation was false. See <a href=\"https://forum.effectivealtruism.org/posts/t5vFLabB2mQz2tgDr/i-m-a-22-year-old-woman-involved-in-effective-altruism-i-m?commentId=R7uP533Xr7sL75Yqx\">here</a> for previous discussion.</p>", "parentCommentId": null, "user": {"username": "Buck"}}, {"_id": "mfHuTfmy4TWwqwaSa", "postedAt": "2023-10-08T21:59:11.648Z", "postId": "R9GbQQksznh2SwS4y", "htmlBody": "<blockquote>\n<p>I suspect some of the hostility may in some sense be a reasonable response to how we behave but I doubt all of it is.</p>\n</blockquote>\n<p>You say \"we\", but from my personal acquaintance with you I would definitely not put you in one group with the attackers this post is about, and I'll emphasise that you don't deserve <em>any</em> hostility.</p>\n<p>I have not been to the Bay Area as an adult, so I can only guess about what's going on there. But trying to extrapolate my experiences in, say, Sci-Fi conventions, I think the (relevant aspect of the) problem is people who use autism - many times without an actual diagnosis - as an excuse to dismiss their actions' effects on others.</p>\n", "parentCommentId": "vHJWj6mfctQbkNyAv", "user": {"username": "Guy Raveh"}}, {"_id": "aGTsDCx5jAhvtWXFq", "postedAt": "2023-10-08T22:29:45.377Z", "postId": "R9GbQQksznh2SwS4y", "htmlBody": "<p>I am not referring to the attackers mentioned in the post when I say \"we\" there, but to people with autism as a whole, when speculating about why we might receive a higher rate of bullying and hostility across society as a whole.</p>\n", "parentCommentId": "mfHuTfmy4TWwqwaSa", "user": {"username": "Dr. David Mathers"}}, {"_id": "cWEPnNiZuNfigstHm", "postedAt": "2023-10-09T01:28:16.648Z", "postId": "R9GbQQksznh2SwS4y", "htmlBody": "<p>OP stated that L’s accusations were dismissed by the EA community.</p>\n", "parentCommentId": "39hfHFtF759eeEpqK", "user": {"username": "J"}}, {"_id": "warwjNKLjaEQLfiBJ", "postedAt": "2023-10-09T02:05:01.282Z", "postId": "R9GbQQksznh2SwS4y", "htmlBody": "<p>OP stated that L’s accusations were dismissed by the EA community. Your link doesn’t provide any proof that they’re false. So it seems like you’re proving OP right.</p>\n", "parentCommentId": "pSLuigumwjenoF2Zz", "user": {"username": "J"}}, {"_id": "Av9XuMG55zdhXwaGF", "postedAt": "2023-10-09T02:54:06.171Z", "postId": "R9GbQQksznh2SwS4y", "htmlBody": "<p>We have found it relevant to describe the population characteristics. Reportedly nine out of ten autistic women have been victims of sexual violence. If you haven't been raped, haven't raped anyone, don't know anyone who was raped, and don't have empathy for victims (autistic or not), then this post probably isn't for you and it isn't about you.</p><p><a href=\"https://www.frontiersin.org/articles/10.3389/fnbeh.2022.852203/full\">Frontiers | Evidence That Nine Autistic Women Out of Ten Have Been Victims of Sexual Violence (frontiersin.org)</a></p>", "parentCommentId": "vHJWj6mfctQbkNyAv", "user": {"username": "Mandelbrot"}}, {"_id": "LJHFb6dvfSaxi9kbD", "postedAt": "2023-10-09T02:57:44.886Z", "postId": "R9GbQQksznh2SwS4y", "htmlBody": "<p>This is correct, thank you for bringing it up. One woman reported that even a person in CEA leadership made excuses for sexual transgressors on the basis of their neurodivergence.</p>", "parentCommentId": "mfHuTfmy4TWwqwaSa", "user": {"username": "Mandelbrot"}}, {"_id": "ktgQEAZacPTWhZBju", "postedAt": "2023-10-09T03:18:29.256Z", "postId": "R9GbQQksznh2SwS4y", "htmlBody": "<p>I would also be interested in more clarification about how EA relevant the case studies provided might be, to whatever extent this is possible without breaking confidentiality. For example:</p><blockquote><p><i>We were pressured to sign non-disclosure agreements or “consent statements” in a manipulative “community process”.</i></p></blockquote><p>this does not sound like the work of CEA Community health team, but it would be an important update if it was, and it would be useful to clarify if it wasn't so people don't jump to the wrong conclusions.<br><br>That being said, I think the AI community in the Bay Area is probably sufficiently small such that these cases may be personally relevant to individual EAs even if it's not institutionally relevant-it seems plausible that a potential victim who gets into AI work via EA might meet alleged abusers in cases A to K, even if no EA organizations or self-identified EAs are involved.</p>", "parentCommentId": "39hfHFtF759eeEpqK", "user": {"username": "pseudonym"}}, {"_id": "SZEqwsxZX9BoaGugN", "postedAt": "2023-10-09T03:27:15.510Z", "postId": "R9GbQQksznh2SwS4y", "htmlBody": "<p>There's <a href=\"https://forum.effectivealtruism.org/posts/t5vFLabB2mQz2tgDr/i-m-a-22-year-old-woman-involved-in-effective-altruism-i-m?commentId=QfmwLS3ukA7FmKBtQ\">some evidence</a> in that thread they weren't dismissed by the EA community given the claim that multiple people were banned from EA events as a result. Perhaps not all accusations lead to an action, and you/OP mean dismissed as in \"not entirely accept all claims\", but it does seem like that's a pretty high, and likely unreasonable bar.</p>", "parentCommentId": "warwjNKLjaEQLfiBJ", "user": {"username": "pseudonym"}}, {"_id": "dFgDnQD9HgTGGn8fE", "postedAt": "2023-10-09T04:23:15.161Z", "postId": "R9GbQQksznh2SwS4y", "htmlBody": "<p>It is pretty notable how frequently bad actors / bystanders out themselves on this forum if you watch for red flags.</p>\n", "parentCommentId": "WedpKBmkuFvq6n5n3", "user": {"username": "Lucretia"}}, {"_id": "pBE7hHP3LYLBgEGqL", "postedAt": "2023-10-09T04:29:46.460Z", "postId": "R9GbQQksznh2SwS4y", "htmlBody": "<p>Thank you for your comment. I understand promoting narratives that autistic men may be more likely to be sexual predators is deeply unfair and encourages neurotype discrimination (and tracks alongside some racism narratives).</p>\n<p>That said, I don’t think this post is saying that, nor is that the point of the post. I think it’s pointing that this has historically correlated with risk factors for all genders. I have also seen (usually wealthy, high status) men use autism as an excuse for boundary violating behavior (they may not even be autistic in the first place, lol).</p>\n<p>I would love to find a way to talk about this that does not unfairly condemn non-predatory autistic men.</p>\n", "parentCommentId": "vHJWj6mfctQbkNyAv", "user": {"username": "Lucretia"}}, {"_id": "y5d9ExPHFxPyesbJs", "postedAt": "2023-10-09T04:37:14.708Z", "postId": "R9GbQQksznh2SwS4y", "htmlBody": "<p>I can’t comment on whether these cases were EA involved because I don’t know.</p>\n<p>As you said, the Silicon Valley AI community is extremely small, which makes this relevant to the EA AI sphere, and AI safety more broadly.</p>\n", "parentCommentId": "ktgQEAZacPTWhZBju", "user": {"username": "Lucretia"}}, {"_id": "A2gvP9sSgZgXTzFra", "postedAt": "2023-10-09T04:38:43.003Z", "postId": "R9GbQQksznh2SwS4y", "htmlBody": "<p>I don’t see anything on the linked post in this comment that L’s report was false from legitimate sources.</p>\n", "parentCommentId": "39hfHFtF759eeEpqK", "user": {"username": "Lucretia"}}, {"_id": "bvLarR5pDR4aviyCn", "postedAt": "2023-10-09T04:47:08.385Z", "postId": "R9GbQQksznh2SwS4y", "htmlBody": "<p>I do not see valid claims that L’s report was false on the post you link, and to be totally honest, this comment is a bit of a red flag.</p>\n", "parentCommentId": "pSLuigumwjenoF2Zz", "user": {"username": "Lucretia"}}, {"_id": "uwhsX7XkFhZcAoPzN", "postedAt": "2023-10-09T04:53:53.208Z", "postId": "R9GbQQksznh2SwS4y", "htmlBody": "<p>Thank you a lot for this comment. I am honestly surprised and saddened by the number of downvotes on Mandelbrot’s post and think it’s ironically reflective of the issue she is drawing attention to.</p>\n", "parentCommentId": "PCYcxogw6YFJEZEv5", "user": {"username": "Lucretia"}}, {"_id": "N8JBGceGZg4DffF7t", "postedAt": "2023-10-09T08:57:36.403Z", "postId": "R9GbQQksznh2SwS4y", "htmlBody": "<p>Thanks for being kind. I regret commenting at all to be honest.&nbsp;<br><br>EDIT: That is, I regret commenting because I actually agree that it is more important people attend to the issues raised by the post than that they worry about the one paragraph that was bothering me.&nbsp;</p>", "parentCommentId": "pBE7hHP3LYLBgEGqL", "user": {"username": "Dr. David Mathers"}}, {"_id": "44LDjGpw2RYjqvRqF", "postedAt": "2023-10-09T09:42:55.412Z", "postId": "R9GbQQksznh2SwS4y", "htmlBody": "<p>Hi Lucretia,</p>\n<p>I'm really sorry about your experiences, and I think it is noble of you to try and fix this problem.</p>\n<hr>\n<p>It kind of seems like Buck is being placed into a double bind here.  The OP denounces \"acts of ostracization\" and \"opportunistic harm\":</p>\n<blockquote>\n<p>Elaborate documents were circulated in group chats in our absence on the topic of our character and mental health.</p>\n</blockquote>\n<blockquote>\n<p>Cherry-picked screenshots were circulated in group chats, along with elaborate discussion for character assassination.</p>\n</blockquote>\n<blockquote>\n<p>...</p>\n</blockquote>\n<blockquote>\n<p>Humiliating websites were put up about us with cherry-picked screenshots and non-consensual recordings.</p>\n</blockquote>\n<p>Buck seems to be a in something of a damned-if-you-do, damned-if-you-don't situation.  If he provides proof, he's liable to be accused of ostracization, opportunistic harm, or slander.  If he doesn't, that could be a bit of a red flag, that proves how EA dismisses women.</p>\n<p>Note Scott Alexander's <a href=\"https://forum.effectivealtruism.org/posts/t5vFLabB2mQz2tgDr/i-m-a-22-year-old-woman-involved-in-effective-altruism-i-m?commentId=R7uP533Xr7sL75Yqx\">reasoning</a> for not sharing proof publicly:</p>\n<blockquote>\n<p>I'm extremely prepared to defend my actions here, but prefer not to do it in public in order to not further harm anyone else's reputation (including Kathy's).</p>\n</blockquote>\n<p>Do you disagree with Scott's reasoning?  If so, why?</p>\n<p>It seems like you've arrived at a similar place Scott has, with regard to your own case -- you don't mention your name, or the name of the person who hurt you, and you're not sharing much proof.</p>\n<p>If we're going to avoid public discussion, is it OK to e.g. <a href=\"https://forum.effectivealtruism.org/posts/t5vFLabB2mQz2tgDr/i-m-a-22-year-old-woman-involved-in-effective-altruism-i-m?commentId=pfGG7wGjokvg5Pywm\">share evidence with Maya privately</a>?</p>\n<p>What do you think the \"rules of engagement\" should be here?  I'd like to see a set of agreed-upon guidelines, such that a person who follows those guidelines can be confident that they won't later be accused of ostracization, harm, slander, dismissiveness, or anything like that.</p>\n<hr>\n<p>Again -- I don't feel knowledgeable about the details of what happened to you, but <strong>I'm sorry it happened</strong>, it's clear to me that it hurt you a lot, and I think you deserve an apology, at the very very least, from the person who hurt you.</p>\n<p>Sending compassion and support your way!</p>\n", "parentCommentId": "bvLarR5pDR4aviyCn", "user": {"username": "chinscratch"}}, {"_id": "pctyrtBsJ7aWfzu6M", "postedAt": "2023-10-09T09:59:37.382Z", "postId": "R9GbQQksznh2SwS4y", "htmlBody": "<p>Even if most examples are unrelated to EA, if it's true that the Silicon Valley AI community has zero accountability for bad behavior, that seems like it should concern us?</p>\n<p><strong>EDIT</strong>: I discuss a [high uncertainty] alternative hypothesis in <a href=\"https://forum.effectivealtruism.org/posts/R9GbQQksznh2SwS4y/silicon-valley-s-rabbit-hole-problem?commentId=m89TyPbBfCfGqNm5y\">this comment</a>.</p>\n", "parentCommentId": "39hfHFtF759eeEpqK", "user": {"username": "chinscratch"}}, {"_id": "g35Ft9t7qawqGa2Qz", "postedAt": "2023-10-09T10:53:39.561Z", "postId": "R9GbQQksznh2SwS4y", "htmlBody": "<p>I am glad you raised this point. I am not a neuropsychologist so please treat this comment with a low level of confidence. Anecdotally, I have heard multiple times of psychologists wrongly diagnosing people as being on the Autism spectrum when really those patients were narcissists. For instance, someone with Asperger may violate social conventions because they don't understand them. Someone with narcissism may violate social conventions because although they understand them, they don't care or they actually enjoy the transgression. Someone with Asperger will have affective empathy but lower cognitive empathy so it may look like they don't care about others suffering. A narcissist may truly not care about someone else's suffering. I think it tends to especially the case for covert narcissism (also called vulnerable narcissism) because some of the behaviors are very similar. I may be wrong but I doubt that Asperger people are more prone to being sexual assailants. However, I believe narcissists certainly are more prone to it, and they would be the type to pretend to be neuro-atypical in order to justify their behaviors. I think this is terrible because it probably has the adverse effect of creating fear of people with Aspergers, who in my opinion don't deserve this reputation.&nbsp;</p>", "parentCommentId": "vHJWj6mfctQbkNyAv", "user": {"username": "ClaireB"}}, {"_id": "AcGzkEqWyAZhwxH4G", "postedAt": "2023-10-09T10:57:33.200Z", "postId": "R9GbQQksznh2SwS4y", "htmlBody": "<p>Also, I should add that some people can have both!</p>", "parentCommentId": "g35Ft9t7qawqGa2Qz", "user": {"username": "ClaireB"}}, {"_id": "m89TyPbBfCfGqNm5y", "postedAt": "2023-10-09T13:45:31.655Z", "postId": "R9GbQQksznh2SwS4y", "htmlBody": "<p>Speaking of autism, <a href=\"https://www.psychologytoday.com/ca/blog/women-autism-spectrum-disorder/202104/10-key-signs-autism-in-women\">this article</a> mentions some characteristics of autistic women that seem potentially relevant:</p>\n<blockquote>\n<p>Sensory sensitivity. People with autism experience the world in a different way than neurotypical people, and many women with autism experience intense sensory sensitivity. They may have a heightened sense of awareness when it comes to smells, light, sounds, and touch.</p>\n</blockquote>\n<blockquote>\n<p>For someone with autism, it’s not just a matter of “not liking” certain things; it’s a sense of being unable to tolerate them.</p>\n</blockquote>\n<blockquote>\n<p>...</p>\n</blockquote>\n<blockquote>\n<p>Emotional regulation issues and meltdowns. Women with autism often have problems with emotional regulation. Research has shown that there is a poor connection between the frontal cortex and the amygdala in people with autism.4 Put simply, the amygdala can be thought of as an “emotion centre” in our brain, as it's part of our limbic system and our mammalian brain. The frontal cortex can be thought of as our “thinking brain,” the more rational part of our brain which makes judgments.</p>\n</blockquote>\n<blockquote>\n<p>Because of the poor connection between the two areas, women with autism may find it hard to rationalise situations and stay in control. Many describe having meltdowns: extreme emotional reactions to situations that might result in losing their temper, crying, or going into shutdown mode.</p>\n</blockquote>\n<blockquote>\n<p>...</p>\n</blockquote>\n<blockquote>\n<p>Anxiety and depression. Anxiety and depression are not universal symptoms of autism. But because life is difficult for many women with autism, it is common for them to experience mental health issues like anxiety, depression, or problems with addiction. There is also a far higher than average rate of suicidality in women with autism, which appears to be related to the degree of camouflaging they engage in.5 Though their autism goes undiagnosed, it is more likely that they will receive a formal diagnosis for anxiety, depression or another mental health issue.</p>\n</blockquote>\n<p>I think autistic men and women have a lot to contribute to the EA movement.</p>\n<p>It seems to me that we should be especially protective towards autistic women, as they're a potentially vulnerable population.  In particular, I hypothesize that autistic women might experience e.g. sensory overload from unpleasant social interactions that neurotypical women would evade or brush off.</p>\n<p>OP mentions that 90% of autistic women report being sexually assaulted.  A quick Google suggests the number for neurotypical women is substantially lower.  There is a lot of uncertainty in my mind regarding the cause of this disparity.  It could be that autistic women are targeted by predators; it could be that autistic women experience a \"sexual assault\" level of trauma from a broader set of interactions; it could be some combination.</p>\n<p>In any case, I like almost all the autistic women I've met, and it upsets me that they're disproportionately suffering.  I think it would be good if EAs took a protective attitude towards a vulnerable population which, IMO, has a lot to contribute.</p>\n", "parentCommentId": "vHJWj6mfctQbkNyAv", "user": {"username": "chinscratch"}}, {"_id": "YkNxn74SW53ExMYF3", "postedAt": "2023-10-09T14:05:30.092Z", "postId": "R9GbQQksznh2SwS4y", "htmlBody": "<p>Hi Mandelbrot,&nbsp;</p><p>Thanks for sharing. The stories of individual women from Silicon Valley are very harrowing.&nbsp;</p><p>This point in struck me:</p><p>&gt; The men who victimized us are shaping the world.&nbsp;<strong>We are canaries for their disregard for human dignity.</strong></p><p>It is a deeply sad thing about the world that those who wield power are often unethical or ignorant of the plight of those who they affect. With the improvement in AI technology, I’m expecting rapid changes in who (or what) wields power, so I’m feeling very anxious about this getting worse.&nbsp;</p><p>&nbsp;</p><p>I encourage victims of sexual misconduct to reach out to others for support, and to seriously consider reporting the incident.</p><p>People you can report to or seek support from:&nbsp;</p><ul><li>If the incident relates to someone involved in the EA community in some way, you can&nbsp;<a href=\"https://www.centreforeffectivealtruism.org/community-health/contact-us\"><u>contact the Community Liaisons</u></a> (Julia Wise, Charlotte Darnell and me), anonymously if you wish.&nbsp;</li><li>University authorities if the misconduct involved university staff or students, or a university affiliated group</li><li>Police</li><li>Human resources staff or managers, if the misconduct was associated with a workplace</li><li>The organiser of the event, if the incident happened at an event.</li><li>A lawyer - one option with an advice line is&nbsp;<a href=\"https://baylegal.org/what-we-do/safety/\"><u>Bay Area Legal Aid</u></a>, or this&nbsp;<a href=\"https://www.womenslaw.org/find-help/ca/finding-lawyer\"><u>guidance from Women’s Law on finding a lawyer</u></a></li><li>And friends and family</li></ul><p><br>Many countries have free sexual misconduct advice available. Some people find it helpful to talk to one of these support services to learn more about what is likely to happen if you report to the police. Here are some resources that may be useful for the US, UK and Australia. We don’t have experience working with these organisations.&nbsp;</p><ul><li><a href=\"https://leanin.org/sexual-harassment/individuals\"><u>Information and Support for Sexual Harassment Survivors</u></a>&nbsp; - mostly US</li><li><a href=\"https://www.rainn.org/\"><u>RAINN</u></a> - US&nbsp;</li><li><a href=\"https://takebackthenight.org/legal-assistance/\"><u>Free legal advice on sexual assault or sexual harassment</u></a> (US only)</li><li><a href=\"https://247sexualabusesupport.org.uk/\"><u>24/7 Rape and Sexual Abuse Support Line</u></a> - UK</li><li><a href=\"https://www.healthdirect.gov.au/sexual-assault-and-rape#helplines\"><u>List of sexual assault services</u></a> - Australia</li><li><a href=\"https://www.respectatwork.gov.au/\"><u>Respect@Work</u></a> - Australia (workplace)</li></ul><p><br>We also encourage victims to seek mental health support.&nbsp;<a href=\"https://www.mentalhealthnavigator.co.uk/\"><u>EA Mental Health Navigator</u></a> can help people in our community access support.</p>", "parentCommentId": null, "user": {"username": "cafelow"}}, {"_id": "bT3u4Y9D3iRKzaDv6", "postedAt": "2023-10-09T14:09:18.359Z", "postId": "R9GbQQksznh2SwS4y", "htmlBody": "<p>The situation with person L was deeply tragic. <a href=\"https://forum.effectivealtruism.org/posts/t5vFLabB2mQz2tgDr/i-m-a-22-year-old-woman-involved-in-effective-altruism-i-m?commentId=bq2rLfiXtuoMnagSt\"><u>This comment</u></a> explains some of the actions taken by CEA’s Community Health team as a result of their reports.</p>", "parentCommentId": "39hfHFtF759eeEpqK", "user": {"username": "cafelow"}}, {"_id": "NsbtKLMTxHguvWARa", "postedAt": "2023-10-09T14:10:13.320Z", "postId": "R9GbQQksznh2SwS4y", "htmlBody": "<p>The situation with person L was deeply tragic. <a href=\"https://forum.effectivealtruism.org/posts/t5vFLabB2mQz2tgDr/i-m-a-22-year-old-woman-involved-in-effective-altruism-i-m?commentId=bq2rLfiXtuoMnagSt\"><u>This comment</u></a> explains some of the actions taken by CEA’s Community Health team as a result of their reports.</p>", "parentCommentId": "8bs8tvHxv5aFu5iuH", "user": {"username": "cafelow"}}, {"_id": "Zu7eQxGpXnDJKhb9N", "postedAt": "2023-10-09T16:45:40.251Z", "postId": "R9GbQQksznh2SwS4y", "htmlBody": "<p>Are there other considerations, too?</p>", "parentCommentId": "HhoPWtexFp7zTmFpN", "user": {"username": "Mandelbrot"}}, {"_id": "urqzTYvDRd6jSvdJK", "postedAt": "2023-10-09T16:58:59.527Z", "postId": "R9GbQQksznh2SwS4y", "htmlBody": "<p>I think where it relates to EA is our worry about the future of complex life. If transformative superintelligence is developed in a morally bankrupt environment, will that create value-aligned AI?</p>", "parentCommentId": "pctyrtBsJ7aWfzu6M", "user": {"username": "Mandelbrot"}}, {"_id": "iYAcdkEaLjPw9G9GE", "postedAt": "2023-10-09T17:09:03.688Z", "postId": "R9GbQQksznh2SwS4y", "htmlBody": "<p>Thank you for this clarification. I'm not saying that people on the autism spectrum are more prone to being sexual assailants (I don't know of any statistics on this), but they experience sexual victimhood more often (<a href=\"https://www.frontiersin.org/articles/10.3389/fnbeh.2022.852203/full?fbclid=IwAR0v8Dq1zuA_6Cc67sQD21wynsUfcqt4P2p_trhulFYxJLV1JQKuIyADkmg\">https://www.frontiersin.org/articles/10.3389/fnbeh.2022.852203/full</a><u>).</u> From the comments I understand that it comes across that way, and I will think about how to rephrase it - open to suggestions.</p>", "parentCommentId": "g35Ft9t7qawqGa2Qz", "user": {"username": "Mandelbrot"}}, {"_id": "gATCehZ5ZsL5fAqJZ", "postedAt": "2023-10-09T17:10:27.140Z", "postId": "R9GbQQksznh2SwS4y", "htmlBody": "<p>I want to make clear that I'm not saying that people on the autism spectrum are more prone to being sexual assailants (I don't know of any statistics on this), but they experience sexual victimhood more often (<a href=\"https://www.frontiersin.org/articles/10.3389/fnbeh.2022.852203/full?fbclid=IwAR0v8Dq1zuA_6Cc67sQD21wynsUfcqt4P2p_trhulFYxJLV1JQKuIyADkmg\">https://www.frontiersin.org/articles/10.3389/fnbeh.2022.852203/full</a><u>).</u> From the comments I understand that it comes across that way, and I will think about how to rephrase it - open to suggestions.</p>", "parentCommentId": "N8JBGceGZg4DffF7t", "user": {"username": "Mandelbrot"}}, {"_id": "zcAaXWJeHPMhaSRqb", "postedAt": "2023-10-09T17:50:06.467Z", "postId": "R9GbQQksznh2SwS4y", "htmlBody": "<p>This is very insightful. I can think of a few reasons why autistic women may be more vulnerable to sexual abuse:</p><ol><li>Autistic women may be more isolated from protective informal networks with other women that could warn them or help them make sense of their relational experiences.</li><li>In general, they may be less communicative about \"touchy-feely\" things like intimate interactions, making it more difficult to analyze them.</li><li>They may gravitate towards fields and environments that are male-dominated and contain strong power gradients (in finance, engineering, AI, etc).</li><li>They may be less alert to people's hidden motives.&nbsp;</li><li>Due to their neurological wiring, the intensity of the experience may cause them to \"leave their bodies\", making it impossible to react quickly or fight back. This can mistakenly cause the man to allege consent, especially if he's used to passive intimate partners.&nbsp;</li><li>The overload of the experience may make it more difficult to process it afterward, too. Women have reported prolonged periods of confusion, dissociation from their bodies, and a sense of horror without being able to clearly articulate the crime.</li><li>Many people on the autism spectrum have experienced punishments and shaming for violating social norms from early childhood, leading to insecurity about expressing themselves. This makes it harder to confidently express their preferences in intimidating or manipulative situations.</li><li>The same threat about violating social norms keeps them quiet afterwards, too. One woman reported that after she disclosed her spectrum identity, she was told by a rationalist \"community council\" member that she would violate a social norm if she named her abuser.</li></ol>", "parentCommentId": "m89TyPbBfCfGqNm5y", "user": {"username": "Mandelbrot"}}, {"_id": "kFNWtfwDbFcg5zLgT", "postedAt": "2023-10-09T18:27:10.307Z", "postId": "R9GbQQksznh2SwS4y", "htmlBody": "<p>Those who are familiar with Scott Alexander's stories about Kathy Forth said that he slandered her on the basis of her mental health, without ever having met her. I find this unethical and stigmatizing to people who are getting treatment for mental health conditions.&nbsp;</p><p>Scott said: \"She had a paranoia for being targeted for rape\" - It is easy to guess where that paranoia comes from. People whose houses burned down panic at the smell of smoke. If anything at all, this indicates that she has indeed experienced rape.</p><p>\"Investigations had found it to be false\" - The conviction rate for sexual assault is abysmally low. Just because an incident couldn't be proven doesn't mean it didn't happen. Scott is epistemologically incorrect here.</p><p>He then reported a widely shared \"warning\" that Kathy makes false accusations, which could have just as easily been put out by a rapist or two and their friends. If you put yourself in the shoes of a woman who has been sexually assaulted, this is an absolute horror. She can never feel safe in the community again because no matter what happens to her, she won't be believed. When rapists hear a \"warning\" like this, they have found their next convenient victim because the discrediting work has already been done for them. Imagine being a woman who has a target on her back like this and the most essentially layer of recourse, her word, stripped away.</p><p>The presence of \"warnings\", the fear about sexual assault, the body of work on misogyny, and ultimately the suicide and her suicide note all together are strong evidence for me that Kathy has been falsely discredited after sexual assault.</p>", "parentCommentId": "44LDjGpw2RYjqvRqF", "user": {"username": "Mandelbrot"}}, {"_id": "jp3NzKHkam5uF8fbB", "postedAt": "2023-10-09T18:41:30.420Z", "postId": "R9GbQQksznh2SwS4y", "htmlBody": "<p>Thanks for clarifying.</p>\n", "parentCommentId": "gATCehZ5ZsL5fAqJZ", "user": {"username": "Dr. David Mathers"}}, {"_id": "ujvAQnjjZKck7jaq7", "postedAt": "2023-10-09T19:35:32.847Z", "postId": "R9GbQQksznh2SwS4y", "htmlBody": "<p>Can you name some of the red flags to watch for? I'd also be interested in hearing who some of the bad actors are (perhaps in a DM if you don't want them to know they've been spotted).</p>", "parentCommentId": "dFgDnQD9HgTGGn8fE", "user": {"username": "robirahman"}}, {"_id": "fkcWnjHYWXZSh6BKe", "postedAt": "2023-10-10T05:34:02.668Z", "postId": "R9GbQQksznh2SwS4y", "htmlBody": "<blockquote>\n<p>Those who are familiar with Scott Alexander's stories about Kathy Forth said that he slandered her on the basis of her mental health, without ever having met her.</p>\n</blockquote>\n<p><a href=\"https://forum.effectivealtruism.org/posts/t5vFLabB2mQz2tgDr/i-m-a-22-year-old-woman-involved-in-effective-altruism-i-m?commentId=pfGG7wGjokvg5Pywm\">That's not what Maya said</a>.</p>\n<blockquote>\n<p>Scott said: \"She had a paranoia for being targeted for rape\"</p>\n</blockquote>\n<p>Sorry, where did Scott say that?</p>\n<blockquote>\n<p>It is easy to guess where that paranoia comes from. People whose houses burned down panic at the smell of smoke. If anything at all, this indicates that she has indeed experienced rape.</p>\n</blockquote>\n<p>She could've experienced rape many years before becoming involved in EA.  Perhaps that created a paranoia that lead to her making false accusations once she became involved in EA.</p>\n<blockquote>\n<p>\"Investigations had found it to be false\" - The conviction rate for sexual assault is abysmally low.</p>\n</blockquote>\n<p>\"The conviction rate for sexual assault is abysmally low\" doesn't help us figure out whether a given person is guilty or innocent.  We <em>want</em> the conviction rate for innocent people to be low.  (Could you confirm that you're on board with that, at least?)</p>\n<blockquote>\n<p>Just because an incident couldn't be proven doesn't mean it didn't happen. Scott is epistemologically incorrect here.</p>\n</blockquote>\n<p>This sounds like a fully general way to excuse any false accusation.</p>\n<p>Suppose I say: \"Mandelbrot is a thief.\"  You say: \"Where's the proof?\"  I say: \"Just because an incident couldn't be proven doesn't mean it didn't happen.  You're epistemologically incorrect here.\"  How does that make you feel?</p>\n<p>In any case... I think the most productive discussion here is about the rules of engagement.  What is the right way to discuss the possibility of a false accusation, without being accused of ostracization, harm, slander, dismissiveness, etc.?</p>\n<p>If there's no right way to discuss the possibility of a false accusation, we can't trust the community to come to accurate conclusions, which leaves us in the dark.</p>\n<p>I think if you believe that false accusations are rare, the thing to do is work to create a widely trusted investigative process.  If there's an investigative process which is widely trusted, and it finds that most accusations are true, people will see the pattern.</p>\n", "parentCommentId": "kFNWtfwDbFcg5zLgT", "user": {"username": "chinscratch"}}]