[{"_id": "cKZs6KwkXSg2qDNWZ", "postedAt": "2022-12-21T16:40:21.633Z", "postId": "RAoonyKjurXMA73gq", "htmlBody": "<p>Hi Vaipan, thanks for writing this. As someone who's applied for (many) dozens of EA and non-EA jobs over the past 2 years, I can identify and empathise with your story here.</p><p>From my experience, I think EA orgs do use 'work tests' way more often than non-EA orgs (I very rarely had to do a work test for non-EA job hiring, only interviews). There are obviously pros and cons to using work tests, and in my short time at a couple of different EA orgs, I've been part of pretty frequent discussion about how/when/why we should use work tests in hiring rounds (to their credit, I think).</p><p>The main thing that I'm surprised by in your post is the high frequency that you report to have done unpaid work tests. In recent times I've been really happy to see most EA orgs offering compensation for work tests, and I think the vast majority of work tests that I did were compensated.&nbsp;</p><blockquote><p>\"but it feels that organizations use my work without them having the intention to hire me. \"&nbsp;</p></blockquote><p>^This quote is pretty concerning .In general, I don't think I've seen anyone use the product of work tests for anything other than assessing them for hiring purposes. &nbsp;Are you saying that orgs have used the product of your work tests for other purposes? In that case, it does seem especially bad for that work test to have been uncompensated, and I'd assume (and hope) that most other EA's would agree with me.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Kaleem"}}, {"_id": "5Pm42u549JH8Cwj9G", "postedAt": "2022-12-21T17:04:25.004Z", "postId": "RAoonyKjurXMA73gq", "htmlBody": "<p>I personally only offer paid work trials, and this is the norm in the orgs I've seen (e.g. OpenPhil). I hope the answer is that the ones you experienced actually can't afford to do this (but I'm sure some could).</p>", "parentCommentId": null, "user": {"username": "technicalities"}}, {"_id": "iDZ5LgLD6h3nCcHsG", "postedAt": "2022-12-21T17:20:21.974Z", "postId": "RAoonyKjurXMA73gq", "htmlBody": "<p>Following other commenters here, I'm heavily pro work tests, but always advocate strongly for (what I believe to be) fair compensation. If organisations are having you do major unpaid (or e.g. minimum-wage) work trials, that seems like a serious problem.</p><p>There are also two broad categories of paid work tests I've seen, and I think the distinction between them is important:</p><ol><li>The first is standardised \"trial tasks\", in which every candidate is given an identical task that functions like an exam. These are typically purely for assessment and have little to no practical benefit to the organisation; they also typically come earlier in the process.</li><li>The second is an on-the-ground \"work trial\" in which the candidate works closely with members of the hiring org over one to a few days. These trials more commonly involve work that's useful to the organisation, since the goal is to see how the candidate works in a more realistic setting with their potential new teammates. These typically come later in the process.</li></ol><p>In my opinion, both of these should be paid, with the importance of providing payment increasing with the length and arduousness of the trial. I also think (2) should only be used with a small number of finalist candidates the org is genuinely excited about. If an org is instead giving these kinds of trials to significant numbers of candidates with lower probability of hiring, then I agree that seems quite problematic, especially if the trials aren't fairly compensated (the need for fair compensation also creates an incentive to be selective with the candidates that get asked to take a trial, which I think is helpful for reducing the concerns raised here).</p>", "parentCommentId": null, "user": {"username": "willbradshaw"}}, {"_id": "NkZq3aM7tEFmKEKav", "postedAt": "2022-12-21T17:50:18.890Z", "postId": "RAoonyKjurXMA73gq", "htmlBody": "<p>I think work tests are a great way to hire people (because they are less biased than the alternatives) but I agree they should be paid for. I didn't know unpaid work tests were a thing. Which orgs had extensive unpaid work tests?</p>", "parentCommentId": null, "user": {"username": "kokotajlod"}}, {"_id": "tANNX5vMhAXx8j9mQ", "postedAt": "2022-12-21T18:15:49.223Z", "postId": "RAoonyKjurXMA73gq", "htmlBody": "<p>I'm really sorry you had such negative experiences with your applications.</p>\n<p>I'd like to state for the record that Rethink Priorities makes heavy use of work tests because we find they best correlate with on-the-job performance.</p>\n<p>However, we:</p>\n<p>(1) always ensure generous and competitive compensation for work tests done regardless of whether the applicant moves on in the process</p>\n<p>and (2) never make actual use of work test output other than to assess the applicant (e.g., we only ask questions that we've already researched internally)</p>\n<p>While I'm sympathetic to organizations who may not have the funding, I think it would make sense in the future for candidates to refuse to engage with multi-hour work trials without fair compensation.</p>\n", "parentCommentId": null, "user": {"username": "Peter_Hurford"}}, {"_id": "efAemuWxLjgcq9vvh", "postedAt": "2022-12-21T18:56:49.934Z", "postId": "RAoonyKjurXMA73gq", "htmlBody": "<p>Ideally there'd be a supervisor-org where you could tell them about this, nothing bad would happen to you, and they'd check with the hiring-org what's going on.</p><p>With all the discussion on EA governance lately, this is something that seems relevant to me</p>", "parentCommentId": null, "user": {"username": "hibukki"}}, {"_id": "cs9x3hhKM7JNXXrXN", "postedAt": "2022-12-21T19:27:08.315Z", "postId": "RAoonyKjurXMA73gq", "htmlBody": "<p>I’m sorry to hear you’ve had these negative experiences.</p><p>At CEA, trial tasks (minutes or hours) and work trials (days) are key components of our typical hiring rounds because we believe them to be better predictors of performance in the role than other assessments such as resumes or interviews. We do, however, always offer to compensate candidates for their time for any longer trial tasks and work trials if it's legally possible. (Visa rules mean this is sometimes not possible for candidates who travel, e.g. to the UK, for a trial without a work visa.)</p><p><br>&nbsp;</p>", "parentCommentId": null, "user": {"username": "Oscar Howie"}}, {"_id": "3wfjBjMr4o9ZMabmv", "postedAt": "2022-12-21T20:15:28.079Z", "postId": "RAoonyKjurXMA73gq", "htmlBody": "<blockquote><p>The success rate being 5% (a number I heard during a 'celebrate our failure' gig), I am not surprised to struggle.</p></blockquote><p>FWIW, I found this surprisingly <i>high</i>, assuming that the denominator is something like: \"all candidates applying to all jobs on 80k board,\" which excludes internal hiring/closed hiring/etc.</p>", "parentCommentId": null, "user": {"username": "joel_bkr"}}, {"_id": "vdcEgzuWTHQh9HXFL", "postedAt": "2022-12-21T20:15:34.520Z", "postId": "RAoonyKjurXMA73gq", "htmlBody": "<p>Same for the organization I run.</p>", "parentCommentId": "tANNX5vMhAXx8j9mQ", "user": {"username": "Jonas Vollmer"}}, {"_id": "zsfqyDAj7C8kAvmeE", "postedAt": "2022-12-21T20:31:53.255Z", "postId": "RAoonyKjurXMA73gq", "htmlBody": "<p>Why an org and not a public platform?</p>\n", "parentCommentId": "efAemuWxLjgcq9vvh", "user": {"username": "Guy Raveh"}}, {"_id": "qiq8zDxKnb2n7F9ZD", "postedAt": "2022-12-21T22:05:43.331Z", "postId": "RAoonyKjurXMA73gq", "htmlBody": "<p>(Speaking in a personal capacity of course) I like the idea of using interviews and work tasks to help the organisation and help EA priorities etc. Consulting a variety of perspectives and backgrounds can be very useful, and otherwise we can end up wasting a lot of time, effort and insight in the job seeking and hiring process.</p>\n<p>As as an interviewee I was sometimes frustrated when I put in a lot of work into a task I ~knew was not actually used/useful.</p>\n<p><em>BUT</em> I think these must be compensated and perhaps even  generously compensated.  Generously: to avoid the impression of being exploitative, and the temptation to do so without considering the value of the interviewee’s time.</p>\n", "parentCommentId": null, "user": {"username": "david_reinstein"}}, {"_id": "hzFBQyhfr59jrrJ88", "postedAt": "2022-12-21T22:16:01.030Z", "postId": "RAoonyKjurXMA73gq", "htmlBody": "<p>I'm not against</p><p>I don't really know how to set up a structure like this, I assume some people thought a lot about such topics</p>", "parentCommentId": "zsfqyDAj7C8kAvmeE", "user": {"username": "hibukki"}}, {"_id": "fgb33LT6G9gf92bih", "postedAt": "2022-12-21T22:40:08.644Z", "postId": "RAoonyKjurXMA73gq", "htmlBody": "<p>On (1), the organization needs to clearly <i>explain</i> that this is a task that is used for assessment and that the organization will not benefit from the task. Otherwise, the candidate will likely walk away feeling used, and may share information about the trial task with others (why wouldn't they if they were not aware it was a standardized instrument that will be reused?)</p><p>I have mixed feelings about being \"selective with the candidates that get asked to take a trial\" -- if you weight performance on the trial very highly, then trimming the number of candidates able to take a trial denies people who may have scored very well (but whose resume is middle-of-the-road) a chance to prove themselves. Obviously, one should be more selective with invitations to more time-consuming and arduous trials.</p>", "parentCommentId": "iDZ5LgLD6h3nCcHsG", "user": {"username": "Jason"}}, {"_id": "EZzhXaZEy39BHok3E", "postedAt": "2022-12-21T23:14:19.127Z", "postId": "RAoonyKjurXMA73gq", "htmlBody": "<blockquote><p>Otherwise, the candidate will likely walk away feeling used, and may share information about the trial task with others</p></blockquote><p>We generally try to be pretty clear that this is a standardised test, yeah. Including asking people not to share it with others.</p><blockquote><p>I have mixed feelings about being \"selective with the candidates that get asked to take a trial\" -- if you weight performance on the trial very highly, then trimming the number of candidates able to take a trial denies people who may have scored very well (but whose resume is middle-of-the-road) a chance to prove themselves.</p></blockquote><p>I agree that this is a tradeoff -- one that is made sharper by the expense of paying fairly for trial tasks (if we didn't pay, we could have a lower bar for sending out trial tasks). I think it's fairly common to try to address this by having multiple trial tasks / work trials of increasing length &amp; selectivity. (Though this has its own cost, namely an unusually lengthy and gruelling application process.)</p>", "parentCommentId": "fgb33LT6G9gf92bih", "user": {"username": "willbradshaw"}}, {"_id": "aAvXaFtLD8MGCoBy7", "postedAt": "2022-12-21T23:28:46.259Z", "postId": "RAoonyKjurXMA73gq", "htmlBody": "<p>Do all candidates necessarily start at the same stage of trial tasks in most organizations? I could imagine a very short \"stage 0\" trial task requested only from candidates who would be on the bubble of moving on to the first, moderately time-consuming task if there were no \"stage 0\" task to evaluate. The \"stage 0\" task would only need enough power to tip someone on the bubble over into either the \"it's respectful to ask them to do a more demanding task\" or \"respect their time and move on\" buckets. Of course, you'd need to find a quick \"stage 0\" task that correlates well enough with either job performance or later-stage test performance.</p>", "parentCommentId": "EZzhXaZEy39BHok3E", "user": {"username": "Jason"}}, {"_id": "TkrktBBjr6fgCqGiA", "postedAt": "2022-12-22T02:52:18.136Z", "postId": "RAoonyKjurXMA73gq", "htmlBody": "<p>This could be something to bring to the <a href=\"https://forum.effectivealtruism.org/posts/hYh6jKBsKXH8mWwtc/contact-people-for-the-ea-community\">CEA community health team</a>? It's not a central example of the kind of case I think they normally handle, but it does seem like a kind of \"EAs treating each other badly\".</p>\n<p>(Disclosure: I'm married to Julia Wise, but that doesn't mean I know whether the team would consider this within their scope)</p>\n", "parentCommentId": "efAemuWxLjgcq9vvh", "user": {"username": "Jeff_Kaufman"}}, {"_id": "QP239cerHAPtx6jx4", "postedAt": "2022-12-22T03:54:03.508Z", "postId": "RAoonyKjurXMA73gq", "htmlBody": "<p>I've come across the same thing in both EA and non-EA orgs  (notably including some higher level poisitons at the UN that had a multiple hour long work test as part od second and third rounds of the hiring process), although for the most part the EA ones have been compensated, and compensated fairly  generously. I personally consider any uncompensated work test that takes more than about an hour to be a serious red flag for how I expect the org to treat overtime, work life balance and compensation.</p>\n<p>I know that these positions are very competitive and that not engaging with them is not a choice for most people looking for a job, but I think that that might be the best way to disincentivize these practices- a drop in the quality and quantity of applicants while letting them know the reason why will probably be the most effective way to discourage this practice.  I'm also generally a fan of naming and shaming for exploitative practices but that unfortunately tends to have an outsized negative effect on job seekers.</p>\n", "parentCommentId": null, "user": {"username": "tugbazsen"}}, {"_id": "5pawHyfs68LdyPLML", "postedAt": "2022-12-22T06:16:42.544Z", "postId": "RAoonyKjurXMA73gq", "htmlBody": "<p>If you don't feel comfortable sharing which orgs they were publicly, I'd strongly recommend speaking to the <a href=\"https://www.centreforeffectivealtruism.org/community-health\\\">community health team</a> at CEA about this.&nbsp;</p>", "parentCommentId": "cKZs6KwkXSg2qDNWZ", "user": {"username": "vaidehi_agarwalla"}}, {"_id": "Rp2EhijgmfMT96CxH", "postedAt": "2022-12-22T06:40:41.805Z", "postId": "RAoonyKjurXMA73gq", "htmlBody": "<p>Some anecdata:</p>\n<ol>\n<li>I’ve done (or asked to do and then subsequently refused) several extensive  work tests in job applications prior to working with the EA ecosystem. None of these were paid.</li>\n<li>I’ve almost always had candidates do <em>paid</em> work tests for the final round (before interview and reference checks) of roles I’ve hired for within my role as ED of GWWC and on the board at EA Australia.</li>\n<li>I’ve not used the work generated from work tests as free labour (on a couple of instances I asked candidates who did exceptionally in the work test but didn’t get the role if they wanted their work to be used and paid them to complete it as a contractor and in both those cases I was a reference for them for other roles they ended up getting).</li>\n</ol>\n<p>I’ve found work tests to be very worthwhile in hiring (often the single most predictive) . In return (as well as paying) I’ve offered feedback to all candidates who’ve done the work test.</p>\n<p>I’m glad you raised this and while I’m not sure of the prevalence of the problem within the EA ecosystem I think it’s important we have norms around paying people for their work (unless it is explicitly charitable volunteering which is something that I think is good to provide opportunities for people to do and has been valuable in my own impact journey).</p>\n", "parentCommentId": null, "user": {"username": "Luke Freeman"}}, {"_id": "pH6pdkrDwanhyogyD", "postedAt": "2022-12-22T09:39:39.454Z", "postId": "RAoonyKjurXMA73gq", "htmlBody": "<p>Hi Kaleem!</p><p>I hope you have found your fit by now! No, I don't have any evidence that my work has been used, but the assignments were so specific that it gave me this impression. However, it is only an impression!&nbsp;</p>", "parentCommentId": "cKZs6KwkXSg2qDNWZ", "user": {"username": "Vaipan"}}, {"_id": "vvTcbQjgQ7ZAmEwFm", "postedAt": "2022-12-22T09:41:13.098Z", "postId": "RAoonyKjurXMA73gq", "htmlBody": "<p>Hi Luke,</p><p>I'm happy to know that your org has better practices. It's also the feedback part that sucks: despite succeeding at many rounds, I never gotten any feedback!&nbsp;</p>", "parentCommentId": "Rp2EhijgmfMT96CxH", "user": {"username": "Vaipan"}}, {"_id": "CJuQRh2nfo6jZwqEQ", "postedAt": "2022-12-22T10:20:16.155Z", "postId": "RAoonyKjurXMA73gq", "htmlBody": "<p>I think work tests depend on the industry. For example when I was working as a teacher, my interview usually included teaching a real class of students, but in the Civil Service I've never been asked to do anything more than prepare a presentation.</p>\n", "parentCommentId": null, "user": {"username": "Khorton"}}, {"_id": "bCqdyy66JfsqmxruS", "postedAt": "2022-12-22T11:20:23.086Z", "postId": "RAoonyKjurXMA73gq", "htmlBody": "<p>Thanks! I'll refer this comment to relevant people</p>", "parentCommentId": "TkrktBBjr6fgCqGiA", "user": {"username": "hibukki"}}]