[{"_id": "AoGTSsv4yvyokhtEe", "postedAt": "2023-03-06T17:19:01.209Z", "postId": "RarQnPKCx4KkhoLEx", "htmlBody": "<p>To expound on point 1, maintaining corporate protections is not a one-time deal. You also need to follow the required corporate formalities on an ongoing basis.&nbsp;</p><p>For point 3, it <i>could </i>be rational to go without general liability insurance in some cases -- e.g., where the risk is low, the organization has little in the way of assets, and any person with potential personal liability has few assets without a substantial income. Being \"judgment-proof\" is a viable defense strategy, or at least \"judgment-proof\" enough that litigation would cost the plaintiff more than they could reasonably hope to collect. Whether having adequate insurance to cover risks borne by third parties is a moral obligation is an exercise left to the reader.</p><p>Other insurance considerations: if you regularly use your personally-owned automobile for business purposes, you should probably discuss that with an insurance agent in addition to discussing a general liability insurance policy. Also -- I think most EAs are in pretty low-risk lines of work for worker's compensation, but it is available (and sometimes required) for organizations with a single employee.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Jason"}}, {"_id": "RGFbnFkuHdnAfBZMY", "postedAt": "2023-03-06T21:08:04.924Z", "postId": "RarQnPKCx4KkhoLEx", "htmlBody": "<p>Out of curiosity, have any of the major EA orgs been involved in any lawsuits to date? I've never heard of any, but even if there have been none, we can't assume there never will be.</p>\n", "parentCommentId": null, "user": {"username": "robirahman"}}, {"_id": "sLSjXGGrosPc8GaEY", "postedAt": "2023-03-06T22:47:41.333Z", "postId": "RarQnPKCx4KkhoLEx", "htmlBody": "<p>D&amp;O insurance should be a consideration as well.</p>\n", "parentCommentId": null, "user": {"username": "joshjacobson"}}, {"_id": "JmM3wCKxRKWMJFjAy", "postedAt": "2023-03-07T01:15:30.417Z", "postId": "RarQnPKCx4KkhoLEx", "htmlBody": "<p>It is common for lawsuits [edit: or legal threats] to end in settlements which include everyone involved agreeing not to talk about it.  I can think of several involving orgs within the EA community.</p>\n", "parentCommentId": "RGFbnFkuHdnAfBZMY", "user": {"username": "Jeff_Kaufman"}}, {"_id": "PEbcp6nPLXXP4Jcsr", "postedAt": "2023-03-08T10:49:28.473Z", "postId": "RarQnPKCx4KkhoLEx", "htmlBody": "<p>Same general principles apply in the UK - a simple guide is here: https://forum.effectivealtruism.org/posts/ZwTrykpvztrF5FQQL/how-to-set-up-a-uk-organisation-limited-company-version</p>", "parentCommentId": null, "user": {"username": "Rasool"}}, {"_id": "yEcGEpKPW2i8GnZ3m", "postedAt": "2023-03-08T19:08:38.116Z", "postId": "RarQnPKCx4KkhoLEx", "htmlBody": "<blockquote>\n<p>I know most are hesitant to start an actual non-profit since that is more expensive and time-consuming, but at the least, you can form an LLC.</p>\n</blockquote>\n<p>It may be better to seek fiscal sponsorship from a relevant existing non-profit org.</p>\n", "parentCommentId": null, "user": {"username": "ofer"}}, {"_id": "QGYaipDkzkPuBpnPT", "postedAt": "2023-03-09T03:26:49.412Z", "postId": "RarQnPKCx4KkhoLEx", "htmlBody": "<p>Setting up a microsized non-profit -- less than $50K expected revenue in first three years -- in the US could be made rather easy and not expensive. The 1023-EZ is surprisingly not misnamed.</p>\n", "parentCommentId": "yEcGEpKPW2i8GnZ3m", "user": {"username": "Jason"}}, {"_id": "gSuTQCK5pnfGS6Rnd", "postedAt": "2023-08-30T02:28:13.752Z", "postId": "RarQnPKCx4KkhoLEx", "htmlBody": "<p>Very late to this, but just adding that incorporating in Australia is relatively easy and inexpensive too (~$500 AUD, 15-20 hours). Ongoing compliance burden is low, and incorporating as a 'not-for-profit limited liability company' provides good legal protections.</p><p>The biggest downside is the limitations on the activities able to be undertaken by any charity, and if your charity is tax-deductible - the range of activities you can undertake is very much constrained.</p>", "parentCommentId": null, "user": {"username": "rass"}}, {"_id": "Lyi3pTr85PfGewqox", "postedAt": "2023-10-20T16:42:18.075Z", "postId": "RarQnPKCx4KkhoLEx", "htmlBody": "<p>We have similar restrictions on non-profits in the US. (Under US regulations not all non-profits are charities, but most are.)<br>One option is to just do the same thing as a for profit entity, however, shareholders can sue if you aren't making decisions based on making profits.</p>", "parentCommentId": "gSuTQCK5pnfGS6Rnd", "user": {"username": "Jeff Martin"}}, {"_id": "mxGgPbqFeuteRTzgw", "postedAt": "2023-10-20T16:45:16.136Z", "postId": "RarQnPKCx4KkhoLEx", "htmlBody": "<p>In the arts in the US it's common for a grant or donations to be given to a non-profit who takes 6-10% and then the rest is given to the artist, filmmaker, or for profit production company.</p>", "parentCommentId": "yEcGEpKPW2i8GnZ3m", "user": {"username": "Jeff Martin"}}, {"_id": "urdqLTwqXLbZQpwkX", "postedAt": "2023-10-20T16:51:31.723Z", "postId": "RarQnPKCx4KkhoLEx", "htmlBody": "<p>Note: Liability insurance works differently in different countries. For example in the US if I work as a doctor for three years and pay premiums for liability insurance during those three years, then any liability for any actions during that time are covered forever. If someone sues me for something that happened during that time period after I've retired I'm covered because I paid premiums during the time of the incident.<br>In other countries you are only covered if you have paid for insurance during the time period that you are sued. (They have additional policies to cover you after you leave a job or profession.)</p>", "parentCommentId": null, "user": {"username": "Jeff Martin"}}, {"_id": "PAGJzEucytdaJ9Dvh", "postedAt": "2023-10-20T17:14:04.937Z", "postId": "RarQnPKCx4KkhoLEx", "htmlBody": "<p>This is not quite correct on the specifics. In the US, insurers write both claims-made and occurence policies. Your description of US med mal policies is an occurence policy, but I believe most med mal / professional liability coverage is claims made. In contrast, US car insurance is at least generally occurence. One needs to consult the specific insurance contract in question.</p>\n<p>See generally <a href=\"https://www.thehartford.com/business-insurance/claims-made-vs-occurrence\">https://www.thehartford.com/business-insurance/claims-made-vs-occurrence</a>, a large US insurer who writes both kinds</p>\n", "parentCommentId": "urdqLTwqXLbZQpwkX", "user": {"username": "Jason"}}]