[{"_id": "duLt4ZwvaN4RLHD92", "postedAt": "2024-03-16T21:10:18.254Z", "postId": "Rbk8ky4LQschdHdby", "htmlBody": "<p>I think this is my favorite so far. There's a certain hope and cozyness radiating from it. Great introduction to the hopeful let's-save-the-world! side of EA that I will send to all my non-EA friends.</p>\n<p>Your videos are extremely practical for that purpose. In my experience there's a certain \"legitness\" that comes with a nicely animated video on YouTube with more than 100k views, that a blog post doesn't have. So thanks! :)</p>\n", "parentCommentId": null, "user": {"username": "Neil Warren"}}, {"_id": "LCA6YnKqmWsqmiNcX", "postedAt": "2024-03-18T19:06:42.888Z", "postId": "Rbk8ky4LQschdHdby", "htmlBody": "<p><strong>Executive summary:</strong> Some individuals have had an outsized positive impact on the world through their careers, suggesting that carefully choosing how to help others can lead to doing far more good than typical paths.</p><p><strong>Key points:</strong></p><ol><li>Doctors save fewer lives than commonly assumed, around 3 lives per career on average. Some doctors, like Dr. David Nalin who pioneered oral rehydration therapy for cholera, have saved orders of magnitude more.</li><li>Karl Landsteiner's discovery of blood types enabled safe blood transfusions, saving tens of millions of lives, though this estimate is highly uncertain.</li><li>Stanislav Petrov, a Soviet officer, may have prevented nuclear war by correctly identifying a false alarm, saving billions of lives and protecting humanity's future.</li><li>Luck plays a role in having an outsized impact, but Nalin, Landsteiner and Petrov made choices that put them in high-leverage positions.</li><li>Rather than just trying to \"make a difference\", we should carefully consider the highest-impact ways to help others through our career choices.</li><li>The 80,000 Hours Career Guide provides a framework for identifying the most pressing problems and developing expertise to address them.</li></ol><p>&nbsp;</p><p>&nbsp;</p><p><i>This comment was auto-generated by the EA Forum Team. Feel free to point out issues with this summary by replying to the comment, and</i><a href=\"https://forum.effectivealtruism.org/contact\"><i>&nbsp;<u>contact us</u></i></a><i> if you have feedback.</i></p>", "parentCommentId": null, "user": {"username": "SummaryBot"}}]