[{"_id": "TQc6mdFkfRdxDo4G3", "postedAt": "2017-12-29T12:16:17.502Z", "postId": "RBTWyi5MW3LyeX23L", "htmlBody": "<p>Thanks for this Ben. Two comments.</p>\n<ol>\n<li><p>Could you explain your Impact-Adjusted Significant Plan Changes to those of us who don't understand the system? E.g What does an &quot;rated-1000&quot; plan change look like and how does that compare to a &quot;rated-1&quot;? I imagine the former is something like a top maths bod going from working on nothing to working on AI safety but that's just my assumption. I really don't know what these mean in practice, so some illustrative examples would be nice.</p>\n</li>\n<li><p>Following comments made by others about CEA's somewhat self-flagellatory review, it seems a bit odd and unnecessarily self-critical to describe something as a challenge if you've conscious chosen to de-prioritise it. In this case:</p>\n</li>\n</ol>\n<blockquote>\n<p>(iii) we had to abandon our target to triple IASPC (iv) rated-1 plan changes from introductory content didn’t grow as we stopped focusing on them.</p>\n</blockquote>\n<p>By analogy, it's curious if tell you 1) a challenge for me this year was that I didn't run a marathon this year and 2) I decided running marathons wasn't that important to me (full disclosure humblebrag: I did run(/walk) a marathon this year).</p>\n", "parentCommentId": null, "user": {"username": "MichaelPlant"}}, {"_id": "uamc5rQFzaspbkHoA", "postedAt": "2017-12-30T12:00:19.639Z", "postId": "RBTWyi5MW3LyeX23L", "htmlBody": "<p>Hey Michael,</p>\n<p>A typical rated-1 is someone saying they took the GWWC pledge due to us, and are at the median in terms of how much we expect them to donate.</p>\n<p>Rated-10 means we'd trade that plan change for 10 rated-1s.</p>\n<p>You can see more explanation of typical rated 10 and higher plan changes from 2017 here:\n<a href=\"https://80000hours.org/2017/12/annual-review/#what-did-the-plan-changes-consist-of\">https://80000hours.org/2017/12/annual-review/#what-did-the-plan-changes-consist-of</a></p>\n<p>Some case studies of top plan changes here:\n<a href=\"https://80000hours.org/2017/12/annual-review/#value-of-top-plan-changes\">https://80000hours.org/2017/12/annual-review/#value-of-top-plan-changes</a></p>\n<p>Unfortunately, many of the details are sensitive, so we don't publicly release most of our case studies.</p>\n<p>We also intend for our ratings to roughly line up with how many &quot;donor dollars&quot; each plan change is worth. Our latest estimates were that a rated-1 plan change is worth $7000 donor dollars on average; whereas a rated-100 is over $1m i.e. it's equal in value to an additional $1m donated to where our donors would have given otherwise.</p>\n<p>With the IASPC target, I listed it as a mistake rather than merely a reprioritisation because:</p>\n<blockquote>\n<p>We could have anticipated some of these problems earlier if we had spent more time thinking about our plans and metrics, which would have made us more effective for several months.</p>\n</blockquote>\n", "parentCommentId": "TQc6mdFkfRdxDo4G3", "user": {"username": "Benjamin_Todd"}}, {"_id": "xMaaW44GRjkDZFy9H", "postedAt": "2018-01-01T22:43:37.630Z", "postId": "RBTWyi5MW3LyeX23L", "htmlBody": "<p>After thinking about it for a while I'm still a bit puzzled by the rated-100 or rated-1000 plan changes, and their expressed value in donor dollars. What exactly is here the counterfactual? As I read it, it seems based just on comparing &quot;the person not changing their career path&quot;. However, with some of the examples of the most valued changes, leading to people landing in EA organizations it seems the counterfactual state &quot;of the world&quot; would be &quot;someone else doing a similar work in a central EA organization&quot;. As AFAIK recruitment process for positions at places like central EA organizations is competitive, why don't count as the real impact just the marginal improvement of the 80k hours influenced candidate over the next best candidate?</p>\n<p>Another question is how do you estimate your uncertainty in valuing something rate-n?</p>\n", "parentCommentId": null, "user": {"username": "Jan_Kulveit"}}, {"_id": "3cGCD92DJurGcMb2B", "postedAt": "2018-01-03T03:17:15.171Z", "postId": "RBTWyi5MW3LyeX23L", "htmlBody": "<p>Here is 80k's <a href=\"https://80000hours.org/2015/07/replaceability-isnt-as-important-as-you-might-think-or-weve-suggested/\">mea culpa</a> on replaceability.</p>\n", "parentCommentId": "xMaaW44GRjkDZFy9H", "user": {"username": "CarlShulman"}}, {"_id": "rBCe2n8Gyw9XTcaD3", "postedAt": "2018-01-03T09:54:41.973Z", "postId": "RBTWyi5MW3LyeX23L", "htmlBody": "<p>Sure, first 80k thought your counterfactual impact is &quot;often negligible&quot; due to replaceability, then they changed position toward replaceability being &quot;very uncertain&quot; in general. I don't think you can just remove it from the model completely.</p>\n<p>I also don't think in the particular case of central EA organizations hiring the uncertainty is as big as in general / I'm uncertain about this, but my vague impression was there is a usually a selection of good candidates to choose from when they are hiring. </p>\n", "parentCommentId": "3cGCD92DJurGcMb2B", "user": {"username": "Jan_Kulveit"}}, {"_id": "aWisMG5xCc5o7RPBC", "postedAt": "2018-01-07T12:47:37.025Z", "postId": "RBTWyi5MW3LyeX23L", "htmlBody": "<p>Hi Jan,</p>\n<p>We basically just do our best to think about what the counterfactual would have been without 80k, and then subtract that from our impact. We tend to break this into two components: (i) the value of the new option compared to what they would have done otherwise (ii) the influence of others in the community, who might have brought about similar changes soon afterwards.</p>\n<p>The value of their next best alternative matters a little less than it might first seem because we think the impact of different options is fat-tailed i.e. someone switching to a higher-impact option might well 2x or even 10x their impact, which means you only need to reduce the estimate by 10-50%, which is a comparatively small adjustment given other huge uncertainties.</p>\n<p>With the value of working at EA organisations, because they're talent constrained additional staff can have a big impact, even taking account of the fact that someone else could have been hired anyway. For more on this, see our recent talent survey: <a href=\"https://80000hours.org/2017/11/talent-gaps-survey-2017/\">https://80000hours.org/2017/11/talent-gaps-survey-2017/</a>\nThis showed that EA orgs highly value marginal staff, even taking account of replaceability.</p>\n", "parentCommentId": "xMaaW44GRjkDZFy9H", "user": {"username": "Benjamin_Todd"}}]