[{"_id": "YR7qoKWTK2osSfLuo", "postedAt": "2024-03-11T05:42:14.890Z", "postId": "RcaQmqjRmie53stwH", "htmlBody": "<p>Sorry to hear this. Unfortunately, AI Safety opportunities are very competitive.</p><p>You may want to develop your skills outside of the AI safety community and apply to AI Safety opportunities again further down the track when you're more competitive.</p>", "parentCommentId": null, "user": {"username": "casebash"}}, {"_id": "RBfDfhfq2cyBW8cJa", "postedAt": "2024-03-11T07:07:57.057Z", "postId": "RcaQmqjRmie53stwH", "htmlBody": "<p>I wouldn't be disheartened. I have considerable experience in AI safety and my current role has me advising decision-makers in the topic in major tech organisations. I've had my work cited by politicians in parliament twice last year.<br><br><strong>I've also been rejected for every single AI Safety fellowship or scholarship that I've ever applied for.</strong> That's every advertised one, every single year, for at least 5 years. My last rejection, actually, was on March 4th (so a week ago!). A 0% success rate, baby!<br><br>Rejected doesn't mean you're bad. It's just that there's maybe a dozen places for well over a thousand people, and remember these places have a certain goal in mind so you could be the perfect candidate but at the wrong career stage, or location, or suchlike.</p><p>I'd say keep applying, but also<strong> apply outside the EA sphere</strong>. Don't pigeonhole yourself. As others mentioned, keep developing skills but I'd also add that <strong>you may never get accepted and that's okay</strong>. It's <strong>not a linear progression</strong> where you have to get one of these opportunities before you make impact. Check out other branches.<br><br>Inbox me if you feel you need more personal direction, happy to help :)<br>&nbsp;</p>", "parentCommentId": null, "user": {"username": "AI Law"}}, {"_id": "rh227BC2jKFKCDNAQ", "postedAt": "2024-03-11T12:03:07.628Z", "postId": "RcaQmqjRmie53stwH", "htmlBody": "<p>Consider joining hackathons such as the ones organized by <a href=\"https://www.apartresearch.com/sprints\">Apart Research.</a> Anyone can join and get to work on problems directly related to AI Safety.</p><p>If you do a good project, you can put that on your resume and have something to speak about at your next interview.</p>", "parentCommentId": null, "user": {"username": "MathiasKirkBonde"}}, {"_id": "LtAfvs7SWBk9sAuzC", "postedAt": "2024-03-11T19:06:49.330Z", "postId": "RcaQmqjRmie53stwH", "htmlBody": "<p>You'd likely get much more helpful responses if you state what exactly you applied for, what stage you reached, and (if rejected at screening phase) your CV</p>\n", "parentCommentId": null, "user": {"username": "John Salter"}}, {"_id": "5oLfuBFCCqYqjQsG5", "postedAt": "2024-03-11T22:32:08.581Z", "postId": "RcaQmqjRmie53stwH", "htmlBody": "<p>Good on you for being so helpful ❤️</p>", "parentCommentId": "RBfDfhfq2cyBW8cJa", "user": {"username": "Yanni Kyriacos"}}, {"_id": "WrXE49AZ32ok4oR4C", "postedAt": "2024-03-11T22:33:03.889Z", "postId": "RcaQmqjRmie53stwH", "htmlBody": "<p>Have you considered reaching out to 80,000 hours for career coaching?&nbsp;</p>", "parentCommentId": null, "user": {"username": "Yanni Kyriacos"}}]