[{"_id": "mcenmMgXjviPDeFGu", "postedAt": "2024-01-04T01:05:22.623Z", "postId": "RdiQ3n8cFJBxHRnwu", "htmlBody": "<p>I thought this was a very useful review and would strongly encourage others to read it, if they’ve engaged with the previous posts on this subject. I wouldn't have seen it without your post, so thanks! I think publishing on the forum in full (or relevant sections) would be great - though I'll leave it to the author/others to decide.&nbsp;</p>", "parentCommentId": null, "user": {"username": "BenStewart"}}, {"_id": "uuo9jK8KnKFYLk9k9", "postedAt": "2024-01-04T12:17:01.241Z", "postId": "RdiQ3n8cFJBxHRnwu", "htmlBody": "<p>I agree that it would be cool if the whole text was on the forum, it’s an extremely good analysis of the object level situation</p>\n", "parentCommentId": "mcenmMgXjviPDeFGu", "user": {"username": "bec_hawk"}}, {"_id": "F8GaGXKtJnQBFEoNs", "postedAt": "2024-01-04T15:42:34.745Z", "postId": "RdiQ3n8cFJBxHRnwu", "htmlBody": "<p>I agree, and I got permission from Ozy to include the full text, so now it's here.</p>", "parentCommentId": "mcenmMgXjviPDeFGu", "user": {"username": "Rafael Harth"}}, {"_id": "eBinkwTR3iBZcG2yt", "postedAt": "2024-01-04T18:26:28.936Z", "postId": "RdiQ3n8cFJBxHRnwu", "htmlBody": "<p>Putting this here since this is the active thread on the NL situation. Here's where I currently am:</p><ul><li>I think NL pretty clearly acted poorly towards Alice and Chloe. In addition to what Ozy has in this post, the employment situation is really pretty bad. &nbsp;I don't know how this worked in the other jurisdictions, but Puerto Rico is part of the US and paying someone as an independent contractor when they were really functioning as an employee means you had an <a href=\"https://www.dol.gov/agencies/whd/flsa/misclassification\">employee that you misclassified</a>. And then $1k/mo in PR is well below minimum wage. They may be owed back pay, and consulting an employment lawyer could make sense, though since we're coming up on the two year mark it would be good to <a href=\"https://www.dol.gov/general/topic/wages/backpay\">move quickly</a>.<ul><li>I think some people are sufficiently mature and sophisticated that if they and their employer choose to arrange compensation primarily in kind that's illegal more like jaywalking is illegal than like shoplifting is illegal. But I don't think Alice and Chloe fall into this category.</li><li>Many of the other issues are downstream from the low compensation. For example, if they had wanted to live separately on their own dime to have clearer live/work boundaries that would have eaten up ~all of the $1k.</li></ul></li><li>I agree with Ozy that NL's misjudgements here show a really bad fit for their chosen role in connecting and mentoring people.</li><li>While I'm overall very glad that LC put the time into collecting this information and writing it up, I think the rushed and chaotic approach to fact checking in the <a href=\"https://forum.effectivealtruism.org/posts/H4DYehKLxZ5NpQdBC/nonlinear-s-evidence-debunking-false-and-misleading-claims?commentId=8DGWvtFjvtDCMQmQh\">days and hours before publication</a> was <a href=\"https://forum.effectivealtruism.org/posts/bwtpBFQXKaGxuic6Q/effective-aspersions-how-the-nonlinear-investigation-went?commentId=zQEdnqePvK6D5DQag\">unfair to NL</a>, massively increased the noise around this, and may have been enough to make their whole efforts net-negative through a combination of worse outcomes in this case and bad precedent. &nbsp;I think in future cases fact checking without giving the accused an incentive to retaliate against sources to prevent publication is practical <a href=\"https://www.lesswrong.com/posts/YSHPDCRggYoXNciFZ/fact-checking-and-retaliation-against-sources\">with precommitments</a>.<ul><li>I'm frustrated with myself that in <a href=\"https://forum.effectivealtruism.org/posts/f77iuXmgiiFgurnBu\">Run Posts By Orgs</a> I didn't get more into the fact checking benefits, and may have led the LC team to think that the adversarial fact checking stage here was supererogatory.<ul><li>In general, I think sharing false information is fundamentally unfair to the accused, but if you draft a callout post you'll almost always have some of this: it's very difficult to get everything correct when you have only your own perspective and records. Pre-publication fact checking with the accused can mostly fix this, but someone writing about their own experience would then need to be working closely with someone that had hurt them. &nbsp;Since I think that's too much to ask, we need to be flexible in that case. But when the person writing the post doesn't have that relationship with the accused, interaction during fact checking doesn't have the same harms.</li></ul></li></ul></li><li>Despite my process objections, I don't think <a href=\"https://forum.effectivealtruism.org/users/tracingwoodgrains?mention=user\">@TracingWoodgrains</a> call to <a href=\"https://www.lesswrong.com/posts/2vNHiaTb4rcA8PgXQ/effective-aspersions-how-the-nonlinear-investigation-went\">consider this a mistrial</a> can work, and would actually be harmful. &nbsp;We need to do the best we have with the information we have, put things together, gather more information as needed, and make a coherent picture.</li></ul>", "parentCommentId": null, "user": {"username": "Jeff_Kaufman"}}, {"_id": "TiQhmWDwNaGh5qnxH", "postedAt": "2024-01-04T21:18:20.477Z", "postId": "RdiQ3n8cFJBxHRnwu", "htmlBody": "<p>I broadly endorse your judgment on this topic inasmuch as I've observed it, for whatever that is worth. I do want to add the specific note that one of the most serious problems with the process issues is that they led to such an adversarial launching point to the topic that the response was in an unreasonably difficult position from the beginning. Ozy's article (while being on the whole a defensible view) criticizes the approach of the response quite harshly, but speaking with precision and grace in high-pressure, intensely adversarial situations with an audience primed to distrust you is a specific, rare skill with only limited bearing on someone's approach in regular times.</p>\n<p>You are likely right that a mistrial is unrealistic at this point, but inasmuch as people take the approach you advocate, it's worth emphasizing the reasons process concerns make putting things together so complicated.</p>\n", "parentCommentId": "eBinkwTR3iBZcG2yt", "user": {"username": "TracingWoodgrains"}}, {"_id": "gjXTKvRyZPh3dmtex", "postedAt": "2024-01-05T00:07:32.804Z", "postId": "RdiQ3n8cFJBxHRnwu", "htmlBody": "<p>I’m a bit confused about the “illegal more like speeding is illegal than like shoplifting is illegal” analogy - speeding seems clearly worse given how many people die in road accidents; large chains just price in a baseline level of theft.</p>\n", "parentCommentId": "eBinkwTR3iBZcG2yt", "user": {"username": "bec_hawk"}}, {"_id": "pPMMyLeZ9TZt9qczw", "postedAt": "2024-01-05T00:12:42.186Z", "postId": "RdiQ3n8cFJBxHRnwu", "htmlBody": "<p>\"How many people die in road accidents\" doesn't tell you much about the badness of speeding without the denominator - which in the US is approximately everybody approximately all the time.</p>\n", "parentCommentId": "gjXTKvRyZPh3dmtex", "user": {"username": "willbradshaw"}}, {"_id": "MASMtZwTnFLu6YcTy", "postedAt": "2024-01-05T00:23:44.766Z", "postId": "RdiQ3n8cFJBxHRnwu", "htmlBody": "<p>I think even this under-plays the fact-checking point. It’s very difficult for external observers to evaluate these sorts of situations, particularly when there’s fierce pushback from the accused party. The level of rigour in fact-checking even secondary details is one heuristic people can use to evaluate the journalist’s case. If the accused can point out a litany of errors in the post it makes it much harder to trust the bigger claims. It also makes it immensely harder to persuade those sympathetic to the accused.</p>\n<p>Habryka’s suggestion in comments elsewhere that this level of fact-checking is basically too much to ask for seems to miss this.</p>\n<p>In that spirit, I feel I should point out that for Alice and/or Chloe the compensation was eventually switched to cash on their request.  I don’t think this at all undermines your points - it’s clear that Kat thinks the in-kind compensation structure was an amazing offer that Alice and Chloe should have felt lucky to receive, and that her agreeing to the switch to cash was going above and beyond as an employer. But it seems important to make sure people don’t get an inaccurate impression, or at least don’t think you have one.</p>\n", "parentCommentId": "eBinkwTR3iBZcG2yt", "user": {"username": "bec_hawk"}}, {"_id": "fWBdAFvXfLnR98ekZ", "postedAt": "2024-01-05T00:26:00.082Z", "postId": "RdiQ3n8cFJBxHRnwu", "htmlBody": "<p>I would still think the ‘micromurder’ of speeding is higher than that of shoplifting? I still think I’m missing something in understanding the analogy</p>\n", "parentCommentId": "pPMMyLeZ9TZt9qczw", "user": {"username": "bec_hawk"}}, {"_id": "Nx3RQ6qeM943fj36u", "postedAt": "2024-01-05T00:39:01.901Z", "postId": "RdiQ3n8cFJBxHRnwu", "htmlBody": "<blockquote><p>I think in future cases fact checking without giving the accused an incentive to retaliate against sources to prevent publication is practical <a href=\"https://www.lesswrong.com/posts/YSHPDCRggYoXNciFZ/fact-checking-and-retaliation-against-sources\">with precommitments</a>.</p></blockquote><p>There may be some tricky interactions with US defamation law here. One the one hand, there's the likelihood that fact checking will reduce the risk of error, and there is no defamation without falsity.</p><p>On the other hand, getting a source to retract during the pre-publication review process could add heft to a threat (real or feigned) to sue for defamation. In the US, the constitutional minimum for defamation liability is negligence for ordinary figures; \"actual malice\" (knowledge or reckless disregard of falsity) for public figures. If the would-be author knows prior to publication that the sources have retracted, that could significantly increase the defamation-liability risk under either standard. Thus, the target may have an incentive to pressure the sources into retracting to bolster the target's defamation-suit threat against the would-be publisher.&nbsp;</p><p>Every situation is different, and would-be publishers should seek legal advice as appropriate. But my guess is that where the target is a public figure, following certain types of precommitment procedure might well cause a net increase in the risk borne by the publisher.&nbsp;</p>", "parentCommentId": "eBinkwTR3iBZcG2yt", "user": {"username": "Jason"}}, {"_id": "TPqcH2h3zF5HjKstC", "postedAt": "2024-01-05T01:13:16.251Z", "postId": "RdiQ3n8cFJBxHRnwu", "htmlBody": "<p>Society defines operating an automobile over a certain rate of speed (\"speeding\") as illegal. We've decided there need to be some fairly bright-line rules, and so we've made speeding illegal in some circumstances where it is a fairly rational, victimless thing to do. Indeed, we don't want a ton of litigation about whether someone was driving unreasonably fast for the circumstances, so we've defined driving over X mph/kph as illegal (absent special circumstances like a true emergency).&nbsp;</p><p>Another offense like this: letting your dog out in public without a leash. It's often a reasonable enough thing to do, but (at least where I live) the effect of the law is that the police officer gets to decide whether you should be ticketed, and the police officer's exercise of discretion is essentially unreviewable. The law's authors perfectly well knew that lots of people would let their dogs off leash, and the cops would generally do nothing or issue a verbal admonition.</p><p>In contrast, most people see shoplifting as inherently wrong (lawyers would say: malum in se, rather than malum prohibitium). Although there can be defenses, we do not expect people to regularly break anti-shoplifting laws, or for the police to decide which shoplifters were acting unreasonably.</p>", "parentCommentId": "gjXTKvRyZPh3dmtex", "user": {"username": "Jason"}}, {"_id": "cAcv2xeaPaK5qPazF", "postedAt": "2024-01-05T01:14:08.481Z", "postId": "RdiQ3n8cFJBxHRnwu", "htmlBody": "<p>At least in the US there are some illegal activities that are very common and socially accepted. Learning that someone made a habit of going a small amount over the speed limit, jaywalking, or consuming marijuana at home probably wouldn't make most people think poorly of them. Other things, even ones with arguably low social cost, are seen as pretty unacceptable: shoplifting, insurance fraud, going through red lights when you can see no one is coming.</p>\n<p>I don't want to get into whether speeding or shoplifting is actually worse (though you and Will are welcome to keep exploring that!) since what I'm gesturing at is only about how people generally think of the offense; I've edited the comment to change \"speeding\" to \"jaywalking\".</p>\n", "parentCommentId": "gjXTKvRyZPh3dmtex", "user": {"username": "Jeff_Kaufman"}}, {"_id": "fDsd7Tpg9Xs7hjdct", "postedAt": "2024-01-05T03:08:29.414Z", "postId": "RdiQ3n8cFJBxHRnwu", "htmlBody": "<p>Insurance fraud has low social cost? Explain?</p>\n", "parentCommentId": "cAcv2xeaPaK5qPazF", "user": {"username": "robirahman"}}, {"_id": "ua7JozWm73xj44bht", "postedAt": "2024-01-05T03:12:35.638Z", "postId": "RdiQ3n8cFJBxHRnwu", "htmlBody": "<p>I don't think this is empirically true. US speed limits are typically set lower than the safest driving speeds for the roads, so micromurders from speeding are often negative in areas without pedestrians.</p>\n", "parentCommentId": "fWBdAFvXfLnR98ekZ", "user": {"username": "robirahman"}}, {"_id": "E4WC74wrEQk7Pka2g", "postedAt": "2024-01-05T12:23:56.556Z", "postId": "RdiQ3n8cFJBxHRnwu", "htmlBody": "<p>Ozy is consistently both underread and incredibly insightful, I wish these kinds of posts got crossposted to the forum more often. &nbsp;</p>", "parentCommentId": null, "user": {"username": "EffectiveAdvocate"}}, {"_id": "XZ7SiB67BzfyT4pBA", "postedAt": "2024-01-05T12:26:21.424Z", "postId": "RdiQ3n8cFJBxHRnwu", "htmlBody": "<p>I'm not convinced the social cost is low, and I'm not convinced for shoplifting either; hence the 'arguably'. I think insurance fraud, though, is often quite a lot like shoplifting? You're getting something for free from a large company, they have budgeted based on a non-zero amount of it, the costs are spread across all their customers, risk of death to anyone is very low, etc.</p>\n", "parentCommentId": "fDsd7Tpg9Xs7hjdct", "user": {"username": "Jeff_Kaufman"}}, {"_id": "jL5wRSJaDAPQ5HA8e", "postedAt": "2024-01-05T13:54:54.311Z", "postId": "RdiQ3n8cFJBxHRnwu", "htmlBody": "<p>I'm not going to lie, I disagreed with a lot of this, especially the conclusion. I don't quite have the time to respond to all of it, but I'll address Adorian Deck.</p><blockquote><p>Deck sued for more money. Emerson knew that Deck’s dream was to become a YouTuber, so he threatened to get two top YouTubers to create videos slamming Deck. In response, Deck settled in what Emerson characterizes as “a deal he was satisfied with that gave him significant financial freedom.”</p></blockquote><p>Here's the timeline as I understand it (it's been a while):<br>1. Deck builds a big social media account.</p><p>2. Emerson approaches Deck, offering to buy the brand and profit-share, under certain stipulations, including that he continue actively posting.</p><p>3. Deck no longer actively posts, essentially ending the contract terms and releasing Emerson's obligation to pay him.</p><p>To me, this seems pretty fair and standard? It doesn't seem particularly different from a brand acquisition or an influencer marketing program. Lots of founders get acquired and compensated with the stipulation that they keep performing their work under the new entity. Emerson is paying Deck to make posts in his own style. The alternative is to hire someone else to do it, and that's not ideal if you want to preserve the appeal of the original.&nbsp;</p><blockquote><p>But the OMGFacts brand <i>itself </i>was valuable: that’s why Emerson bought it instead of starting a competing YayFacts Twitter account. Emerson probably paid more to the lawyer who negotiated the contract than he did to Deck—the person who created the brand in the first place.</p></blockquote><p>Social media brands that don't post have no value.</p><p>And, in my experience managing platforms and accounts much bigger than Deck's, brands are a multiplier, but have very little value on their own. The average person follows hundreds of accounts on multiple platforms. If a Fun Facts account isn't posting for a year, no one's gonna notice, and their posts won't show up because their followers' feed will be occupied by accounts that do post regularly.</p><blockquote><p>A California law invalidates any contract with a minor that isn’t overseen by a judge—a crucial protection for child actors, who are often exploited by their parents. Emerson characterizes this law as a “bizarre loophole,” which strikes me as a very cavalier attitude towards children’s labor protections.</p></blockquote><p>I mean, sorta? But of the entire influencer ecosystem, many are teenagers and very few have had their brand deals overseen by a judge. I doubt Mr Beast's first sponsor check was overseen by a judge. You're technically correct, but in practice it would be quite the demanding ask to have a judge oversee every contract with a minor influencer.</p>", "parentCommentId": null, "user": {"username": "Minh Nguyen"}}, {"_id": "fTzPGiyQ72SFMqp2X", "postedAt": "2024-01-05T16:29:58.910Z", "postId": "RdiQ3n8cFJBxHRnwu", "htmlBody": "<p>The EA community commenting on this issue is becoming absurd. Rafael Harth appears to be reposting comments by Ozy Brenan. Any review that starts with ‘ Much of this post is speculative. I am sure I got things wrong.’ should have people scratching their head. Isn’t that how this started? With Ben writing a post that was undocumented, unverified and a result of paying two people to air their grievances?</p>\n<p>By supporting Ozy’s post, Rafael agrees that anyone who reads all the words previously written on the issue belongs to an elite group. The definition of ‘elite’ is ‘a select group that is superior in terms of ability or qualities to the rest of a group or society’.</p>\n<p>Is the act of posting ‘speculations’ and telling everyone that they are superior people effective? Making the world a better place? I think not.</p>\n", "parentCommentId": null, "user": {"username": "lake.apted@gmail.com"}}, {"_id": "tPK2w2EvPZGQkpcfv", "postedAt": "2024-01-05T17:10:23.147Z", "postId": "RdiQ3n8cFJBxHRnwu", "htmlBody": "<blockquote><p>By supporting Ozy’s post, Rafael agrees that anyone who reads all the words previously written on the issue belongs to an elite group. The definition of ‘elite’ is ‘a select group that is superior in terms of ability or qualities to the rest of a group or society’.</p></blockquote><p>I think it's fairly clear that the use of \"elite\" in that paragraph was a joke.</p>", "parentCommentId": "fTzPGiyQ72SFMqp2X", "user": {"username": "willbradshaw"}}, {"_id": "3cLYC25vrn4e4H2pW", "postedAt": "2024-01-05T21:40:50.351Z", "postId": "RdiQ3n8cFJBxHRnwu", "htmlBody": "<p>Thanks for this, I appreciate that someone read everything in depth and responded.&nbsp;<br><br>I feel I should say something because I defended Nonlinear (NL) in previous comments, and it feels like I am ignoring the updated evidence/debate if I don't.</p><p>I also really don’t want to get sucked in, so I will try to keep it short:<br><br><strong>How I feel</strong><br>I previously said that I was very concerned after Ben's post, then persuaded by the response from NL that they are not net negative.&nbsp;</p><p>Since then, I realized that there have been more negative views expressed towards NL than I realized. I have been somewhat influenced by the credibility of some of the people who disagree with me.<br><br>Having said that, the current evidence is still not enough to persuade me that NL will be net-negative if involved in EA in the future. They may have made some misjudgments, but they have paid a very high price, and it seems relatively easy to avoid similar mistakes in the future.</p><p>(I also feel frustrated that I have put so much time into this and wish it was not a public trial of sorts)</p><p><strong>I agree with this point:</strong><br><br>\"An effective altruist organization needs to <i>be actively good</i>.\"<br><br>BUT I am not sure if you can reasonably conclude that NL is not actively good from the current balance of evidence because it is fuzzy and incomplete. Little effort has been invested in figuring out their positive impacts and weighing them against their negative impacts.<br><br><strong>Contrary to the post, I expect that Kat and Emerson probably do agree with this now (as general principles) after their failed experiment here:</strong><br><br><i>People should be paid for their work in money and not in ziplining trips.</i></p><p><i>A person should not simultaneously be your friend, your housemate, your mentee, an employee of the charity you founded, and the person you pay to clean your house.</i><br><i>Nonprofits should follow generally accepted accounting principles and file legally required paperwork.</i><br><i>Employers should not ask their employees to commit felonies unrelated to the job they were hired for.[16]</i><br><br><strong>I disagree somewhat with Ozy/Jeff on this:</strong><br>\"Much of Kat and Emerson’s effective altruist work focuses on mentoring young effective altruists and incubating organizations. I believe the balance of the evidence—much of it from their own defense of their actions—shows that they are hilariously ill-suited for that job. Grants to Nonlinear to do mentoring or incubation are likely to backfire. Grantmakers should also consider the risk of subsidizing Nonlinear’s mentoring and incubation programs when they give grants to Nonlinear for other programs (e.g. its podcast).\"<br><br>NL's misjudgements here show a really bad fit for their chosen role in connecting and mentoring people.\"&nbsp;<br><br>- again, we are just hearing about the bad stuff here from a small minority of people involved in a program. What about the various people who had good experiences? We might be considering less than a percent of the available feedback, etc.<br><br>I think it is fairer to say that they made a mistake here that reflects badly and raised concern etc. That we should investigate more and be concerned maybe, but not that we should have strong confidence etc.<br><br><strong>I think I agree with Jeff on this:</strong><br>\"We need to do the best we have with the information we have, put things together, gather more information as needed, and make a coherent picture.\"<br><br><strong>What I therefore think should happen next:</strong><br>NL should acknowledge any mistakes, say what they will do differently in the future, and be able to continue being part of the community while continuing to be scrutinized accordingly (however that proceeds).<br><br>I'd like people to be more cautious than previously in their engagements with them, but not to write them off completely or assume they are bad actors. &nbsp;(EA) organizations/people can and do make mistakes and then improve and avoid those mistakes in the future.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Peterslattery"}}, {"_id": "WTMY5xwke2ftDfp8T", "postedAt": "2024-01-06T19:29:28.346Z", "postId": "RdiQ3n8cFJBxHRnwu", "htmlBody": "<p>Do you have a source for the contract terms?</p>", "parentCommentId": "jL5wRSJaDAPQ5HA8e", "user": {"username": "Elizabeth"}}, {"_id": "eNCATerspJaM9zZJp", "postedAt": "2024-01-06T23:19:44.671Z", "postId": "RdiQ3n8cFJBxHRnwu", "htmlBody": "<blockquote><p>When I asked him about [why Nonlinear did not legally employ Chloe], Ben told me that the problem was related to difficulties sorting out visas: in particular, Chloe would be paid once she got an H-1B visa, which she was expected to do all the application for, both employer-side and employee-side. I believe this to be extremely abnormal. The H-1B process is immensely complicated, and it’s never certain that even the most qualified person will be able to get an H-1B. Even setting aside whether it’s legal to do so, you shouldn’t hire someone assuming that they’ll be able to get an H-1B soon and straighten out the legalities—it’s all too likely they won’t be able to. It’s very strange to hire a person to do both the employer and the employee side of the petition for a visa that she can’t be hired without. However, Ben spoke to me shortly before publishing and I didn’t have time to check with Nonlinear, so take this with a grain of salt. It does provide an alternate explanation for why Chloe at least was employed under the table.</p></blockquote><p>If true, this is very concerning and demonstrates astounding naivety about immigration law. Hiring an unauthorized worker in the United States can be a criminal violation, and visas such as H-1B do not grant retrospective authorization for work done before the visa was approved.&nbsp;</p><p>Also, an H-1B visa would not have permitted Chloe to perform household chores, such as cleaning and doing the groceries. There are very stringent rules about what an H-1B worker is allowed to do. H-1B is a visa for specialty occupations that typically require a bachelor's degree or equivalent experience and does not allow workers to perform duties outside of their specialty occupation.</p><p>Also, H-1B workers typically need to receive high wages. According to the Department of Labor, they cannot be paid less than the \"local prevailing wage for the occupation in the area of intended employment.\" I think Chloe's work arrangement would likely fail to meet this rule too.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Fermi–Dirac Distribution"}}, {"_id": "xKNtATg3cahgXxEqK", "postedAt": "2024-01-07T16:10:04.729Z", "postId": "RdiQ3n8cFJBxHRnwu", "htmlBody": "<p>Re <s>Rafaels' conclusion</s> the takeaways:&nbsp;</p><p>\"Much of Kat and Emerson’s effective altruist work focuses on mentoring young effective altruists and incubating organizations. I believe the balance of the evidence—much of it from their own defense of their actions—shows that they are hilariously ill-suited for that job.\"</p><p>I don't think that the recent posts give a balanced view of their work (e.g. I haven't seen any section anywhere titled 'Positive things Nonlinear did/achieved'). I don't think there is enough information to judge to what extent they are suitable for their mentoring/incubating job.&nbsp;</p><p>In an attempt to bring in some balancing anecdote, I personally have had positive experiences doing regular coaching calls with Kat over the past year and feel that her input has been very helpful.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Alexandra Bos"}}, {"_id": "vrKw64eofJr8vTQ2r", "postedAt": "2024-01-07T23:41:46.704Z", "postId": "RdiQ3n8cFJBxHRnwu", "htmlBody": "<p>Not my conclusion! I only linked to the post/copied and reformatted the text -- the author is <a href=\"https://substack.com/@thingofthings\">Ozy Brennan</a>.</p>", "parentCommentId": "xKNtATg3cahgXxEqK", "user": {"username": "Rafael Harth"}}, {"_id": "kPnL8JpbomdxksE6o", "postedAt": "2024-01-09T13:38:13.250Z", "postId": "RdiQ3n8cFJBxHRnwu", "htmlBody": "<p>Ah I'm sorry, I only scanned the post and missed your sentence at the top. Thanks!</p>", "parentCommentId": "vrKw64eofJr8vTQ2r", "user": {"username": "Alexandra Bos"}}, {"_id": "5W7B6yqsoMygpCyiP", "postedAt": "2024-01-09T23:39:53.050Z", "postId": "RdiQ3n8cFJBxHRnwu", "htmlBody": "<p><a href=\"https://forum.effectivealtruism.org/users/minh-nguyen-1?mention=user\">@Minh Nguyen</a> you seem very confident about the contract terms. I agree with you that if Deck violated a contractual agreement, that puts Spartz's actions in a very different light. I have looked and not been able to find the exact contract or settlement terms. If you have them, I think it would b every useful to share them.&nbsp;</p>", "parentCommentId": "WTMY5xwke2ftDfp8T", "user": {"username": "Elizabeth"}}, {"_id": "L7jzBAAoqHDykAQWG", "postedAt": "2024-01-11T04:20:28.737Z", "postId": "RdiQ3n8cFJBxHRnwu", "htmlBody": "<p>Hi! Sorry for the late response, I was actually handling my own contract for a partnership with a Generative AI startup to co-develop and deploy AI character voice chat onto our platforms w ~ 1 million users. Hopefully, history does not repeat itself.<br><br>There are the exact terms I'd found here (<a href=\"https://forum.effectivealtruism.org/posts/32LMQsjEMm6NK2GTH/sharing-information-about-nonlinear#Severe_downsides_threatened_if_the_working_relationship_didn_t_work_out\">Sharing Information About Nonlinear</a>) via <a href=\"https://web.archive.org/web/20110824205315/http://www.omgfactslawsuit.com.s3.amazonaws.com/CONTRACT.pdf\">Wayback Machine (archive.org)</a>.<br><br>The relevant parts:<br><br>The very first line under \"Responsibilities of contractor\":<br>&gt; The Contractor shall render internet related services as requested by the Company from time to time<br><br>&gt; The Contractor agrees not to engage in any behavior that would cause hardship to the Company, such as instances of sabotage. The Contractor agrees not to change any passwords for any Company-related projects without the consent of the Company. Should the Contractor breach this Agreement, the Contractor will, at the Company's edict, be required to rectify the breach, including but not limited to forfeiture of revenues and a requirement to reveal to the Company the current password of the OMG Facts Twitter account<br><br>&gt; This Agreement shall commence on the “Effective Date” defined above and shall terminate one year thereafter, provided, however, that the Company may extend this Agreement for ten additional periods of one year each upon notice to Contractor given at least thirty days prior to the expiration initial expiration date or extended term. However, either party may terminate this contract in writing in the following instances:<br>(1) If either party is convicted of a criminal offense.<br>(2) Failure by the Contractor to meet deadlines for performance of<br>services or failing to meet the standards required by the Company in the<br>performing of services<br><br>Obviously, I am not a lawyer, but there's indeed several key clauses in there mentioning an obligation to actively perform services, which in the case of OMGFacts would essentially mean making Twitter posts. I don't think there's anything there that's particularly \"predatory\"?.<br><br>Regarding whether Deck performed this responsibility:<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefqjpxxn7lsdh\"><sup><a href=\"#fnqjpxxn7lsdh\">[1]</a></sup></span><br>&gt; Here is the untold side of the story: The @OMGFacts Twitter (and Website/YouTube) is produced by us, not him. Adorian has done almost nothing for the past 15 months. &nbsp;Almost every fact you have read from OMG Facts was researched, written, and edited by us.</p><p>I will note that I couldn't find any examples of Deck disputing that he was inactive. Deck's lawyer instead argued that contracts signed by Deck himself were invalid even if co-signed by his guardians.</p><p>Again, I'm not a lawyer, but if Emerson's main argument was that Deck didn't uphold his responsibility, you'd think the easiest rebuttal would be that ... he did things as per the contract. Instead of arguing that Deck signed the contract without knowing what he was doing:<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefd56062i2e4a\"><sup><a href=\"#fnd56062i2e4a\">[2]</a></sup></span></p><blockquote><p>Deck's complaint contends that the contract he signed with Spartz was predatory and designed to dupe the teen into turning over his rights to the OMG Facts trademark without realizing what he was doing. Deck's attorney, Glenn Peterson of Roseville, argues that the intellectual property issues are moot in any case because California law allows individuals to disavow any contracts signed when they were minors.<br>Spartz counters that Deck's mother co-signed the contract as his legal guardian, and that Deck is simply hoping to exploit Spartz Inc.'s hard work for a quick gain.</p></blockquote><p>So even just using public sources, we can establish that there were multiple clauses referencing an obligation to actively post, that Emerson claims Deck did not fulfil this, and Deck never even attempts to deny this, instead trying to invalidate the contract altogether. I don't see a particularly strong reason to <i>\"side with Deck\"</i> on this one, unless there's any claims/evidence that he did perform his responsibility that he hasn't publicly disclosed for 15 years.</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnqjpxxn7lsdh\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefqjpxxn7lsdh\">^</a></strong></sup></span><div class=\"footnote-content\"><p><a href=\"https://web.archive.org/web/20110513103830/https://emersonspartz.tumblr.com/post/5150292566\">Emerson Spartz, OMG Fact: There are two sides to every story. (archive.org)</a></p></div></li><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnd56062i2e4a\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefd56062i2e4a\">^</a></strong></sup></span><div class=\"footnote-content\"><p><a href=\"https://www.jacksonville.com/story/business/2011/05/16/california-teens-lawsuit-over-twitter-feed-underscores-power-tweet/15903568007/\">California teen's lawsuit over Twitter feed underscores power of a tweet (jacksonville.com)</a></p></div></li></ol>", "parentCommentId": "5W7B6yqsoMygpCyiP", "user": {"username": "Minh Nguyen"}}, {"_id": "AKJQYursXHDFMDxk8", "postedAt": "2024-01-11T21:56:14.621Z", "postId": "RdiQ3n8cFJBxHRnwu", "htmlBody": "<p>&nbsp;I'm confused. \"render internet related services as requested by the Company from time to time\" is not at all a contractual obligation to produce content on an ongoing basis. If there were a contractual obligation to produce content on an ongoing basis, I'd expect the contract to specify how much content, for how long. I'd understand 'internet related services' to mean help with access to the account, authentication, etc. as relevant, not as an ongoing job as a content creator.&nbsp;<br><br>I agree that Emerson argues that Emerson alone created content for the site, and that Deck doesn't dispute this, but neither of them seem to actually argue Deck had a contractual obligation to create such content (and reading the contract, I think he clearly did not). Instead, I parse Emerson making this claim as a sort of moral claim to the high ground (\"I'm the one doing the hard work here\"), not a claim that Deck failed to fulfill contractual responsibilities. I don't see anywhere where Emerson actually alleges breach of terms by Deck, as opposed to alleging that Deck is trying to take advantage of Emerson's hard work by backing out of the contract.</p>", "parentCommentId": "L7jzBAAoqHDykAQWG", "user": {"username": "Kelsey Piper"}}, {"_id": "z8a9cdGGEQ6CRCBrZ", "postedAt": "2024-01-12T03:17:17.222Z", "postId": "RdiQ3n8cFJBxHRnwu", "htmlBody": "<p>Again, not a lawyer so I'm willing to accept I'm wrong.<br><br>I think this very much depends on how \"services requested by the company\" is interpreted.</p><blockquote><p>\"render internet related services as requested by the Company from time to time</p><p>Failure by the Contractor to meet deadlines for performance of<br>services or failing to meet the standards required by the Company in the<br>performing of services</p></blockquote><p>You could argue that access is what's requested, yes. Personally, I don't, because access by default is already assumed under a later clause that uses a different wording: <i>\"The Contractor agrees not to change any passwords for any Company-related projects without the consent of the Company\"</i></p><p>Or you could argue that if Emerson reasonably demands active posting, he is entitled to it under the terms of the contract, and entitled to terminate the contract if this is not fulfilled. We could argue over what constitutes reasonable demands, but I would think it's more than <i>\"almost nothing\".</i></p><p>Not specifying the <i>exact</i> timings didn't stand out to me. In my experience, it's not very common to specify <i>exact</i> posting schedules for a long-term brand partnership with a teenager. There's a certain expectation that teenage influencers are <i>a little bit inconsistent.</i></p><p>In any case, my point with this whole thread is that ... the whole Deck thing is really not that much of a red flag? A fairly standard contract was signed with a minor and his parent, who tried to sue by invalidating the entire validity of a contract with a minor+guardian, and it seems Deck wasn't actively involved the whole time.&nbsp;</p><p>I'm not seeing <i>obvious</i> predatory behaviour here. <i>Maybe</i> poorly defined contract terms, but I really don't see why people keep bringing this up a decade later as evidence against Emerson's character. Keep in mind, we haven't seen how many such contracts Spartz Inc signed without any incident.</p><p>If this is the absolute <i>worst</i> example an investigation could dig up from Emerson's 2-decade-long career, it just doesn't seem very convincing, ya know?</p>", "parentCommentId": "AKJQYursXHDFMDxk8", "user": {"username": "Minh Nguyen"}}, {"_id": "j4QvgGN5XMWFurPQj", "postedAt": "2024-01-12T06:47:42.303Z", "postId": "RdiQ3n8cFJBxHRnwu", "htmlBody": "<blockquote>\n<p>Again, I'm not a lawyer, but if Emerson's main argument was that Deck didn't uphold his responsibility, you'd think the easiest rebuttal would be that ... he did things as per the contract. Instead of arguing that Deck signed the contract without knowing what he was doing</p>\n</blockquote>\n<p>INAL also, but my intuition runs in the opposite direction  - it seems much easier to argue that the contract is invalid and you don’t even need to litigate the terms of it, than to litigate those terms. E.g. similar to how in a defamation case lawyers might argue that even if the statements were false, no harm was caused, as has been mentioned by a lawyer somewhere else on the forum.</p>\n", "parentCommentId": "L7jzBAAoqHDykAQWG", "user": {"username": "bec_hawk"}}, {"_id": "ArvxpRQHgtBCgvzWd", "postedAt": "2024-01-15T02:17:35.027Z", "postId": "RdiQ3n8cFJBxHRnwu", "htmlBody": "<blockquote><p>[...] &nbsp;was actually handling my own contract for a partnership with a Generative AI startup to co-develop and deploy AI character voice chat onto our platforms w ~ 1 million users</p></blockquote><p>&nbsp;</p><p>I'm sorry, what's the relevance here? I can imagine wanting to explain the delay, although I don't think that was necessary. But the details of the work and the size of the platform?&nbsp;</p>", "parentCommentId": "L7jzBAAoqHDykAQWG", "user": {"username": "Elizabeth"}}, {"_id": "Jmhw8QdRGd6yjX5to", "postedAt": "2024-01-15T05:28:22.561Z", "postId": "RdiQ3n8cFJBxHRnwu", "htmlBody": "<p>I mean, the fact that I've dealt with a few similar agreements with similar/bigger platforms, and I myself manage a bigger platform than Deck's, and am managing my own partnership deal, similar to Deck's.</p><p>From my perspective, the events described really aren't that weird. Like, at all. It's very strange to me that the Deck story keeps coming up like some sort of smoking gun, when there seems to be nothing unusual about it in the social media marketing space.</p><p>The deal itself is normal.</p><p>The fact that Deck became inactive afterwards is unfortunate, but normal.</p><p>The fact that Deck and his parent sued doesn't really imply anything about Emerson's character. A teenager lost interest in an online venture, comes back to demand money when the venture made money. It happens all the time.</p><p>At least to me, it's really weird that everyone keeps talking about it like some strong red flag.</p>", "parentCommentId": "ArvxpRQHgtBCgvzWd", "user": {"username": "Minh Nguyen"}}, {"_id": "8RTWedp2dqPcomKd6", "postedAt": "2024-01-15T19:28:37.215Z", "postId": "RdiQ3n8cFJBxHRnwu", "htmlBody": "<blockquote><p>The fact that Deck and his parent sued doesn't really imply anything about Emerson's character</p></blockquote><p>&nbsp;</p><p>It may not <i>prove</i> anything about Emerson's character, but that's not the same as providing no evidence. Especially since your assertion that Deck was obligated to continue posting remains unsubstantiated.&nbsp;</p>", "parentCommentId": "Jmhw8QdRGd6yjX5to", "user": {"username": "Elizabeth"}}, {"_id": "9KrRyEjkBq2YL3ght", "postedAt": "2024-01-05T01:17:58.541Z", "postId": "RdiQ3n8cFJBxHRnwu", "htmlBody": null, "parentCommentId": "gjXTKvRyZPh3dmtex", "user": null}]