[{"_id": "xvFfT6p2kRmXikSui", "postedAt": "2015-08-11T06:47:14.612Z", "postId": "ReJT7ck9Em2xQANSz", "htmlBody": "<p>Nice ideas! I like #5, since donating for &quot;fuzzies&quot; reasons is often looked down upon. I discussed my grappling with fuzzies vs. utilons <a href=\"http://reducing-suffering.org/altruists-focus-reducing-short-term-far-future-suffering/#My_compromise_position\">here</a>.</p>\n", "parentCommentId": null, "user": {"username": "Brian_Tomasik"}}, {"_id": "ukffnuDupLKrRcFi7", "postedAt": "2015-08-11T09:29:07.750Z", "postId": "ReJT7ck9Em2xQANSz", "htmlBody": "<p>Thank you, great tips! In response, I just sent a donation of $20 to MIRI. :‑)</p>\n", "parentCommentId": null, "user": {"username": "Telofy"}}, {"_id": "gwgDT94KQDx7WFs7L", "postedAt": "2015-08-11T14:38:18.788Z", "postId": "ReJT7ck9Em2xQANSz", "htmlBody": "<p>Perhaps the most important way to improve cause re-prioritization is for more people to write publicly about why they donate to the causes they do. I don't see many people doing this, and the ones who do don't usually offer much detail. I'd like it to become normal and even expected for EAs to give public justifications to wherever they donate.</p>\n<p>One possible concern with this is it may pressure people to donate to popular causes. Hopefully people who write up their reasoning like this can get sufficiently rational feedback that they won't feel this pressure. I expect that even with this pressure, people will end up making better decisions than if they didn't talk publicly about their donation choices.</p>\n<p>Of course, I don't <em>really</em> know if this would help. What we need to do is run an RCT where people try different cause re-prioritization strategies and see which ones work best.</p>\n", "parentCommentId": null, "user": {"username": "MichaelDickens"}}, {"_id": "MvYMrHy2Cax3qtT7Q", "postedAt": "2015-08-11T18:31:54.829Z", "postId": "ReJT7ck9Em2xQANSz", "htmlBody": "<p>The biggest issue vis-a-vis changing one's mind about cause areas seems to me likely to be the routine epistemic difficulty of properly (deeply, charitably and effectively) considering opposing points of view (motivated reasoning, confirmation bias etc.). (Closest but not identical to 5).</p>\n<p>So conducting Ideological Turing Tests on yourself seems to be the best solution to me. 3 seems a good idea too: you'd really need to work with someone with the other point of view for the ITT to be fruitful, I'm guessing. 1 seems much less useful. For me, giving a nominal sum to causes B and C, where I support cause A, would be about as fruitful as sending a nominal donation to a couple of conservative organisations (which I expect would not shift my views one whit).</p>\n<p>The only thing I worry about with the ITT and deep investigation of alternative causes' arguments is that while these policies are very epistemically and morally virtuous, they seem extremely demanding. I don't go in for moral over-demandingness arguments, but I worry that becoming decently conversant with the arguments for a cause you don't yet agree with and thinking about it could require enormous amounts of time <em>and</em> that with anything less than enormous amounts of time and sincere effort invested, a person might do better to just defer to some authority. Alternatively, if you are really worried by apparent peer disagreement/lack of information, you could just split your donations between plausible-looking causes and exhort others to do the same. (This might be especially worthwhile if you think that people are unlikely to switch causes to the most rational, wholesale).</p>\n", "parentCommentId": null, "user": {"username": "David_Moss"}}, {"_id": "Ydzt2BdJS59gGN5kY", "postedAt": "2015-08-13T01:46:21.037Z", "postId": "ReJT7ck9Em2xQANSz", "htmlBody": "<p>Another, selfish reason to donate to a broad variety of causes is to claim moral authority over people who don't donate at all.  Say you donate mainly to a &quot;fringe&quot; cause area, and some non-EA is hard on you for this.  Then you can respond by saying &quot;well I also donate small amounts to a variety of other causes too, including some you would agree with, to avoid getting attached to a particular cause; what are you doing?&quot;  At which point the person you're talking to gets embarrassed if they don't donate at all.</p>\n", "parentCommentId": null, "user": {"username": "Germantia"}}, {"_id": "M4Gapino9tcB4Po7T", "postedAt": "2015-08-13T01:51:34.241Z", "postId": "ReJT7ck9Em2xQANSz", "htmlBody": "<p>The risk of having people write about their donation choices online is that discussion devolves in to a flame war.  Any such discussions should be conducted with the highest levels of collegiality, to prevent slipping in to the &quot;my cause is better than your cause&quot; degenerate case.</p>\n", "parentCommentId": "gwgDT94KQDx7WFs7L", "user": {"username": "Germantia"}}, {"_id": "zAc2v5NHKThfYGY4Q", "postedAt": "2015-08-13T22:18:57.833Z", "postId": "ReJT7ck9Em2xQANSz", "htmlBody": "<blockquote>\n<p>3) If you feel comfortable, make a habit of asking other EAs to explain how they picked their cause area, and invite them to try to convince you to change your mind, so they don't have to worry about being inappropriately aggressive towards people who don't want it.</p>\n</blockquote>\n<p>I think I'm a bit averse to pushing this responsibility onto others (&quot;convince me!&quot;) rather than putting in the effort myself to research/understand. But there is a lot of material out there related to each cause.</p>\n<p>Rather than many-to-many requests (each person asking multiple others for their reasons), or as an adjunct to doing that, is there a consolidated guide to the key reasons for or against each of the main areas? I haven't come across one, but may have missed it. I've seen intros/summaries from different EA orgs, but they're generally not steelmanned / responding to the objections of the other cause-foci.</p>\n<p>If this doesn't exist, it might be a good project in terms of time-saving and mind-change facilitation and feeling like one community whose members understand one other (a sort of &quot;Ideological Turing Test Prep&quot;).</p>\n<p>I don't like proposing projects without volunteering to help them, which is probably a fault of mine, but that said I'd be willing to help with this if people think it's a good idea. Asking individuals for their reasons, as Claire proposed, and then collecting/aggregating/summarizing responses might be a good place to start with such a thing, since few of us (none of us?) are expert in the various areas.</p>\n", "parentCommentId": null, "user": {"username": "Jeff"}}, {"_id": "JYM98y4iL9KRREfc7", "postedAt": "2015-08-14T00:59:36.848Z", "postId": "ReJT7ck9Em2xQANSz", "htmlBody": "<p>Issa Rice has the <a href=\"http://causeprioritization.org/\">Cause Prioritization Wiki</a>, but most of the pages are pretty empty.</p>\n<p>I imagine it could be highly valuable for many EAs to write up their reasoning about why they donate to the cause they do, and then publish these at some central location. I'm considering setting up a website to do this but I don't know if there would be sufficient interest.</p>\n", "parentCommentId": "zAc2v5NHKThfYGY4Q", "user": {"username": "MichaelDickens"}}, {"_id": "2Lv6DcLSeWYwcSkR9", "postedAt": "2015-08-14T01:08:53.147Z", "postId": "ReJT7ck9Em2xQANSz", "htmlBody": "<p>I also think it would be great to have a centralized location, probably with both some general arguments about different cause areas and charities, and write-ups of individual decisions about donation and other forms of support.  Unfortunately I just don't have time, but if you guys wanted to work on this some people in the Cause Prioritization Facebook group might help (perhaps Issa). </p>\n", "parentCommentId": "JYM98y4iL9KRREfc7", "user": {"username": "ClaireZabel"}}, {"_id": "PYgi9Ze9mGGHr4PQr", "postedAt": "2015-08-14T11:06:02.463Z", "postId": "ReJT7ck9Em2xQANSz", "htmlBody": "<p>Relevant to the issue of identity: I think it's telling that the empathetic advice here is described as &quot;try ideological Turing tests&quot; rather than &quot;try to argue the other side convincingly,&quot; which is a much older principle and much more generally understandable.</p>\n<p>Should making EA legible to the majority of the worlds' citizens, who are not and will never be computer scientists, be a goal? If so, we need to work on the language we use to discuss these issues.</p>\n", "parentCommentId": null, "user": {"username": "jonathanstray"}}, {"_id": "pFxpj5ojLmbpkZRra", "postedAt": "2015-08-24T20:12:16.046Z", "postId": "ReJT7ck9Em2xQANSz", "htmlBody": "<p>In response to this article, I followed the advice in 1) and thought about where I'd donate in the animal  suffering cause area, ending up donating $20 to New Harvest.</p>\n", "parentCommentId": null, "user": {"username": "William_S"}}, {"_id": "iiFjoXTeWZsJDx3As", "postedAt": "2015-09-13T21:15:45.864Z", "postId": "ReJT7ck9Em2xQANSz", "htmlBody": "<p>Perhaps the most important factor for helping me change my mind (about many things): exposure to conversation with someone much brighter than me who understands everything about my position, and still has different conclusions than me. It decreases overconfidence.</p>\n<p>I recommend exposure to at least one such person every week.</p>\n", "parentCommentId": null, "user": null}, {"_id": "yf7Si8W4Fp4yQ3wFf", "postedAt": "2015-10-19T07:02:23.563Z", "postId": "ReJT7ck9Em2xQANSz", "htmlBody": "<p>I like your idea of donating $20 in a number of different causes, and I think I'll follow through on that. For example I'm not opposed to the idea of working on existential risk but have spent relatively little time looking into X-risk charities and donating to them ($0 so far) compared to my primary areas of focus, poverty and animal rights.</p>\n", "parentCommentId": null, "user": {"username": "MichaelDello"}}, {"_id": "JZspqJA8cMNvTn33E", "postedAt": "2017-01-08T07:21:50.436Z", "postId": "ReJT7ck9Em2xQANSz", "htmlBody": "<p>It worked! I’m excited about MIRI now!</p>\n", "parentCommentId": "ukffnuDupLKrRcFi7", "user": {"username": "Telofy"}}, {"_id": "7gwAaX75B9T3ARSci", "postedAt": "2018-06-06T18:31:20.451Z", "postId": "ReJT7ck9Em2xQANSz", "htmlBody": "<p>I really like the approach behind this post - too often EAs are hesitant to think about ways we can make use of our own psychology for pursuing altruism. It appears to some EAs that tricks like donating to a cause area (to avoid identifying too strongly in opposition to it) should not be part of a rationalist's toolkit. But accepting that we are all biased, and doing what we can to overcome those biases in favor of what we would rationally, reflectively endorse as the unbiased viewpoint, can only help us increase our effectiveness in pursuing our altruistic goals.</p>\n", "parentCommentId": null, "user": {"username": "arikagan"}}, {"_id": "3PAbvdnp4qqS6te7F", "postedAt": "2020-10-10T21:22:06.705Z", "postId": "ReJT7ck9Em2xQANSz", "htmlBody": "<p>I've found the advice of this post useful.<br><br>In particular, the suggestion to \"1) Give a small donation ($20) to a charity in each major cause area, <i>especially</i> &nbsp;the ones you've never donated to before.\"<br><br>I just acted on this advice by giving $20 to a group of Democrat senate campaigns which David Shor <a href=\"https://www.facebook.com/david.shor/posts/10106076522412358\">considers</a> \"<a href=\"https://secure.actblue.com/donate/senate_impact?fbclid=IwAR0lP30MGjKS1-FCEKxiS2xrYoAEtPRA0dTTiEp1G2cXhh0H4tuIXzqEGts\">the races where I think the marginal *small dollar donation* will go the furthest.</a>\" This was my first political donation (besides a $1 donation in February to Yang's campaign that allegedly helped bring him to the debates.)<br><br>Previously, I followed the advice by donating small dollar amounts to a couple other organizations working to help animals (the Good Food Institute and&nbsp;the Wild Animal Initiative). While these acts haven't (yet) caused me to change which cause area I make the bulk of my donations to, I've noticed that they &nbsp;seem to have had some effect on me psychologically, making me more open to seriously considering making substantial donations to these organizations/cause areas.</p>", "parentCommentId": null, "user": {"username": "WilliamKiely"}}]