[{"_id": "9SWH8eYBYsM7Fp2KE", "postedAt": "2023-03-07T17:26:34.615Z", "postId": "RiCueLbjrpsotmqku", "htmlBody": "<p>Hi, I’m an AGI safety researcher <a href=\"https://www.lesswrong.com/s/HzcM2dkCq7fwXBej8\">who studies and talks about neuroscience a whole lot</a>. I don’t have a neuroscience degree—I’m self-taught in neuroscience, and my actual background is physics. So I can’t really speak to what happens in neuroscience PhD programs. Nevertheless, my vague impression is that the kinds of things that people learn and do and talk about in neuroscience PhD programs has very little overlap with the kinds of things that would be relevant to AI safety. Not zero, but probably very little. But I dunno, I guess it depends on what classes you take and what research group you join. ¯\\_(ツ)_/¯</p>", "parentCommentId": null, "user": {"username": "steve2152"}}, {"_id": "2qg5ssYsDrQ3w53W3", "postedAt": "2023-03-07T17:42:53.708Z", "postId": "RiCueLbjrpsotmqku", "htmlBody": "<p>Computer science is probably the most relevant degree for AI safety, but there are already lots of computer scientists working on it, and as far as I know very few neuroscientists. So it's possible that adding one additional neuroscientist could be more valuable than adding one additional CSE person. Especially if we factor in that OP may be better at/ more motivated to do neuroscience than CSE.&nbsp;</p><p>I could see paths of AI development where neuroscience becomes much more important than it is presently: for example, if we go the \"brain emulation\" route.&nbsp;</p><p>I think my advice for the OP would be that if they like/ are better at neuroscience more than CSE, they should go for it.&nbsp;</p>", "parentCommentId": "9SWH8eYBYsM7Fp2KE", "user": {"username": "titotal"}}, {"_id": "WyRA6ybGFb774Kpmu", "postedAt": "2023-03-07T21:01:48.410Z", "postId": "RiCueLbjrpsotmqku", "htmlBody": "<p>I think your reply is pretty heavily based on deciding between neuroscience PhD and CS PhD, but my guess is &gt;80% likely the best move is to not get a PhD at all.</p>\n", "parentCommentId": "2qg5ssYsDrQ3w53W3", "user": {"username": "Peter_Hurford"}}, {"_id": "bZjBdkghWW4ySxouB", "postedAt": "2023-03-07T23:53:22.515Z", "postId": "RiCueLbjrpsotmqku", "htmlBody": "<p>True! As someone with a PhD, I would probably advise against doing a PhD unless you want to go into academia, you really enjoy research for it's own sake, or you have a insatiable desire to put \"doctor\" in front of your name. I don't know anyone who has completed a PhD without having at least one mental breakdown.&nbsp;</p><p>I don't regret my PhD, but it's not something to jump into lightly.&nbsp;</p>", "parentCommentId": "WyRA6ybGFb774Kpmu", "user": {"username": "titotal"}}, {"_id": "hBgppokwHBWJcCTCx", "postedAt": "2023-03-08T02:52:30.098Z", "postId": "RiCueLbjrpsotmqku", "htmlBody": "<p>One thing to bear in mind is that PhDs can often be completed a bit faster in the UK (sometimes as little as 3 years) than in the US (typically 5 years). The US PhDs often include a couple of years of coursework, whereas UK programs often involve just jumping straight into research, on the assumption that you learned about the field as an undergrad.</p>", "parentCommentId": "bZjBdkghWW4ySxouB", "user": {"username": "geoffreymiller"}}, {"_id": "AF5nbjjEcpyhfNkjk", "postedAt": "2023-03-08T11:26:34.695Z", "postId": "RiCueLbjrpsotmqku", "htmlBody": "<p>I did mine in Australia, which follows the UK model. Finishing in 3 years is possible, but very rare, most people took &nbsp;4 years. The US model seems entirely too long, but you do end up with more paper publications in the end. (note that paper publications are important for academia and pretty much nowhere else).&nbsp;</p>", "parentCommentId": "hBgppokwHBWJcCTCx", "user": {"username": "titotal"}}]