[{"_id": "kWbuhNbgSww2pHpDr", "postedAt": "2023-03-04T15:40:32.911Z", "postId": "Riqg9zDhnsxnFrdXH", "htmlBody": "<p>This post lines up with my outsider perspective on FHI, and it seems to be quite measured.  I encourage anyone who thinks that Bostrom is really the best leader for FHI to defend that view here (anonymously, if necessary).</p>\n", "parentCommentId": null, "user": {"username": "ThomasWoodside"}}, {"_id": "tMzhoDakvvkYzot7C", "postedAt": "2023-03-04T16:30:11.986Z", "postId": "Riqg9zDhnsxnFrdXH", "htmlBody": "<p>I'm not taking a position on the question of whether Nick should stay on as Director, and as noted in the post I'm on record as having been unhappy with his apology (which remains my position)*, &nbsp;but for balance and completeness I'd like to provide a perspective on the importance of Nick's leadership, at least in the past.<br><br>I worked closely with Nick at FHI from 2011 to 2015. While I've not been at FHI much in recent years (due to busyness elsewhere) I remember the FHI of that time being a truly unique-in-academia place; devoted to letting and helping brilliant people think about important challenges in unusual ways. That was in very large part down to Nick - he is visionary, and remarkably stubborn and difficult - with the benefits and drawbacks this comes with. It is difficult to understate the degree of pressure in academia to pull you away from doing something unique and visionary and to instead do more generic things, put time into impressing committees, keeping everyone happy etc**. - It's that stubbornness (combined with the vision) in my view that allowed FHI to come into being and thrive (at least for a time). It is (in my view) the same stubbornness and difficultness that contributes to other issues noted in in the post.&nbsp;<br><br>Whether Nick was the right leader at that time isn't a question to me - FHI couldn't have happened under anyone else. And the great work done by multiple people there (not just Nick), and a fairly remarkable range of fhi alumni post-fhi, must stand to that vision. Whether a different leader would be able to keep the positive aspects of the vision - and fight for them - while also being able to address the problems - maybe, I don't know.&nbsp;<br><br>One model FHI might consider is a meaningful, and properly empowered, co-directorship model. I felt I had a good relationship with Nick at the time, and was able to regularly shut down ideas I thought foolish or unnecessarily annoying to the university (although it was stressful). I was also able to put time into maintaining university relationships for FHI, which seemed to keep things on the rails. But that required me being pretty stubborn too, and it seems like others may have had less success in this regard later on (although I know little of the details). &nbsp;It may be possible to make such a model work, with a properly empowered fellow director (e.g. an exec director / research director model).<br><br>* I am not taking a position on issues raised in the post such as whether Nick's brand is too damaged, etc. This may be the case. For whatever it's worth I never saw/heard racist views during my time at FHI (if I had, I would have left). I do recall initiatives, enthusiastically initiated by Nick, to engage and support scholars from under-represented regions like South America, and to encourage intellectual hubs outside of Europe/North America.<br>** &nbsp;I've spent a lot of time trying to navigate these things in academia, and have the scar tissue to show for it.</p>", "parentCommentId": "kWbuhNbgSww2pHpDr", "user": {"username": "Sean_o_h"}}, {"_id": "JjpKSbqrQGZoQaETW", "postedAt": "2023-03-04T16:38:25.898Z", "postId": "Riqg9zDhnsxnFrdXH", "htmlBody": "<p>Thanks for sharing your perspective, it's useful to hear!</p>", "parentCommentId": "tMzhoDakvvkYzot7C", "user": {"username": "ThomasWoodside"}}, {"_id": "mLfRDG8bqQaytXKeP", "postedAt": "2023-03-04T17:51:16.071Z", "postId": "Riqg9zDhnsxnFrdXH", "htmlBody": "<p>This post argues that:</p><ul><li>Bostrom's micromanagement has led to FHI having staff retention problems.</li><li>Under his leadership, there have been considerable tensions with Oxford University and a hiring freeze.</li><li>In his racist apology, Bostrom failed to display tact, wisdom and awareness.</li><li>Furthermore, this apology has created a breach between FHI and its closest collaborators and funders.</li><li>Both the mismanagement of staff and the tactless apology caused <a href=\"https://twitter.com/JonasSandbrink/status/1631677090591375364\">researchers to renounce</a>.&nbsp;</li></ul><p>While I'd love for FHI staff to comment and add more context, all of this matches my impressions.&nbsp;</p><p>Given this, <strong>I stand with the message of the post</strong>. Bostrom has been a better researcher than administrator, and it would make sense for him to focus on what he does best. I'd recommend Bostrom and FHI consider having Bostrom step down as director.</p><p>Edit: Sean adds <a href=\"https://forum.effectivealtruism.org/posts/Riqg9zDhnsxnFrdXH/nick-bostrom-should-step-down-as-director-of-fhi?commentId=tMzhoDakvvkYzot7C\">a valuable perspective</a> that I highly recommend reading, highlighting Bostrom's contributions to creating a unique research environment. He suggests co-directorship as an alternative to consider to Bostrom stepping down.</p>", "parentCommentId": null, "user": {"username": "Jsevillamol"}}, {"_id": "9KyaccMEJtiFPkvuz", "postedAt": "2023-03-04T19:06:09.128Z", "postId": "Riqg9zDhnsxnFrdXH", "htmlBody": "<blockquote>\n<p>But the Apology […] reused the original racial slur[…]</p>\n</blockquote>\n<p>Where? You mean in the 26-year-old email that he <strong>quoted</strong> in the apology? If so, the above claim seems unfair and deceptive.</p>\n", "parentCommentId": null, "user": {"username": "ofer"}}, {"_id": "t99CfxyGd4oqz82dd", "postedAt": "2023-03-04T19:23:28.957Z", "postId": "Riqg9zDhnsxnFrdXH", "htmlBody": "<p>I agreed with you a few months ago; it does seem like FHI has suffered significant mismanagement, though as Sean suggests maybe a strong co-director would work also.</p><p>However, after recent events I think the case for him staying on is actually stronger, because it is important to set a precedent that we support people genuinely thinking for themselves and do not give in to bullying. I don't see how we can hope to build an inclusive community of original thinkers if everyone has a Sword of Damocles hanging over their head, knowing they might be denounced and fired if that became politically expedient. For more details on this I recommend Cinera's excellent <a href=\"https://forum.effectivealtruism.org/posts/NniTsDNQQo58hnxkr/my-thoughts-on-bostrom-s-apology-for-an-old-email\">post</a>.</p><p>I also think you have significantly overstated your case in various places. For example, while CEA did condemn him, their statement was widely criticized and they ended up issuing a partial <a href=\"https://forum.effectivealtruism.org/posts/ALzE9JixLLEexTKSq/cea-statement-on-nick-bostrom-s-email?commentId=Sjycz3RPbiuYWXKyE\">apology </a>for it. You mention funding, but don't provide any evidence this will prevent FHI from fundraising; any funder that wants to promote a diverse and inclusive group of intellectuals producing novel work will have to accept that they will sometimes strongly disagree with grantees. Similarly, freedom of speech is a major concern for the english government right now, and it is currently passing a <a href=\"https://en.wikipedia.org/wiki/Higher_Education_(Freedom_of_Speech)_Bill\">law </a>to help combat cancel culture and defend academic freedom against pressure from university administrators.&nbsp;</p><p>Finally, I'm not sure what you're referring to by 'discredited race science'. As I discussed with Habiba, Bostrom's views are not very different from those of scientifically informed leading <a href=\"https://forum.effectivealtruism.org/posts/8zLwD862MRGZTzs8k/a-personal-response-to-nick-bostrom-s-apology-for-an-old?commentId=7APNarGbWZuozkpNA\">anti-racism campaigners</a>. They simply use slightly different wording.</p><p>Combining these two views, I think the best approach might be for him to step down or take on a strong co-director after a sufficiently long period has passed to make it clear he wasn't just giving in to pressure.</p>", "parentCommentId": null, "user": {"username": "temp_"}}, {"_id": "84pbzLLgecbqWA8gt", "postedAt": "2023-03-04T19:24:50.098Z", "postId": "Riqg9zDhnsxnFrdXH", "htmlBody": "<p>I think it's beneficial for the community if someone presented a very different view (publicly):</p><p>While I don't know enough to comment on the 'pre-existing issues' section of your post, my view is that Bostrom's apology was sufficient.</p><p>I think a lot of people might be reacting excessively to mistakes that he made more than two decades ago.</p><p>Some words may be considered particularly inappropriate in certain socioeconomic and cultural contexts. However, it's important to recognize that others may be acting and speaking from a different background with different norms and values that one isn't familiar with. Bostrom isn't from the Anglosphere, probably isn't very neurotypical, and grew up as part of another generation.</p><p>Furthermore, I'm concerned about contemporary authoritarian trends encouraged by some individuals who identify as social justice activists. While these trends may make the immediate environments of some individuals more pleasant, they can also have consequences (political or otherwise) that could place the world on a riskier trajectory. I think EAs need to reflect on these risks and avoid contributing to them.</p>", "parentCommentId": null, "user": {"username": "Timothy Chan"}}, {"_id": "gdGpc6syDRCGLnkCD", "postedAt": "2023-03-04T19:43:07.139Z", "postId": "Riqg9zDhnsxnFrdXH", "htmlBody": "<p>I repeat here my previous post supporting Bostrom, and his apology:</p>\n<p><a href=\"https://forum.effectivealtruism.org/posts/r3f45au7ewEkypygf/wokism-rethinking-priorities-and-the-bostrom-case\">https://forum.effectivealtruism.org/posts/r3f45au7ewEkypygf/wokism-rethinking-priorities-and-the-bostrom-case</a></p>\n<p>He is a simply one of the best philosophers of our time, and the main founder or longtermism. The comment in the original mail list was a modest misstep by a person without special responsibilities at the time, and his apology in 2023 has been entirely appropriate.</p>\n<p>The racial IQ gap is an observational fact, and he is not an expert on its determinants, so he shall not take a position on a scientific issue that lays beyond his academic authority.</p>\n", "parentCommentId": null, "user": {"username": "Arturo Macias"}}, {"_id": "k5NqEzZu67aGoLhHt", "postedAt": "2023-03-04T22:46:08.462Z", "postId": "Riqg9zDhnsxnFrdXH", "htmlBody": "<p>Judging by Bostrom's body of work so far, if him stepping down from being the sole director of FHI is very high EV, it's probably because it will free more of his time for thinking and writing (rather than due to someone else making FHI have higher EV.) So the more relevant question here, I think, is whether being the sole director of FHI is really the best use of Bostrom's time. It <s>could</s> may be, especially if it will cause him to have more influence in the future. Though when considering that question, he should be mindful about the strong bias humans have towards decisions that cause the decision maker to have higher status (like a decision to be the leader of a prestigious organization).</p>\n<p>(Whatever the answer to that question is, it's probably also the right answer in a world where the 26-year-old-email trainwreck did not occur.)</p>\n", "parentCommentId": "kWbuhNbgSww2pHpDr", "user": {"username": "ofer"}}, {"_id": "YDiZwRFdovMCEnn9F", "postedAt": "2023-03-04T23:26:10.673Z", "postId": "Riqg9zDhnsxnFrdXH", "htmlBody": "<p>The endless nothingburger scandals in EA are driving me out of my mind. Please just do effective interventions instead of community debating.</p>\n<p>I'm this close to never using the term \"EA\" to refer to myself again despite the fact that I'm going to be shooting for the goal \"Do the most good per resource unit\" because of this.</p>\n", "parentCommentId": null, "user": {"username": "tomcatfish"}}, {"_id": "h9gdA4snagQf7bPDv", "postedAt": "2023-03-05T00:42:53.482Z", "postId": "Riqg9zDhnsxnFrdXH", "htmlBody": "<p>I disagree. Or at least I think the reasons in this post are not very good reasons for Bostrom to step down (it is plausible to me he could pursue more impactful plans somewhere else, potentially by starting a new research institution with less institutional baggage and less interference by the University of Oxford).</p><p>Bostrom is as far as I can tell the primary reason why FHI is a successful and truth-oriented research organization. Making a trustworthy research institution is exceptionally difficult, and its success is not primarily measured in the operational quality of its organization, but in the degree to which it produces important, trustworthy and insightful research. Bostrom has succeeded at this, and the group of people (especially the early FHI cast including Anders Sandberg, Eric Drexler, Andrew Snyder Beattie, Owain Evans, and Stuart Armstrong) he has assembled under the core FHI research team have made great contributions to many really important questions that I care about, and I cannot think of any other individual who would have been able to do the same (Sean gives a similar perspective in <a href=\"https://forum.effectivealtruism.org/posts/Riqg9zDhnsxnFrdXH/nick-bostrom-should-step-down-as-director-of-fhi?commentId=tMzhoDakvvkYzot7C\">his comment</a>).</p><p>I think Bostrom overstretched himself when he let FHI grow to dozens and hundreds of people, and this seems to me like it was a mistake, and leaned too hard on skills that are hard to combine with intellectual integrity and vision, and skills that Bostrom otherwise does not seem exceptionally strong at (like navigating university politics and facilitating operational scaling). I do think that aspect of FHI has recently run into a bunch of problems, but at what I think of FHI's core responsibility he has done very exceptional work and I see no suitable replacement for Bostrom at this point.</p><p>When I think of the value that FHI has produced for the world it has been in the unabashed exploration of ideas, with great willingness to explore wherever they go, even if this might involve engaging with ideas that are scary, sound crazy and speculative, or are societally taboo. To me, the core value add of FHI has always seemed to me to be one of providing a beacon, and one of the world's best places to work at, for people who want to take ideas seriously and think rigorously about the future. The cultural components to create this kind of environment are very rare, and do not exist almost anywhere else in the world (and for example, IMO very clearly do not exist at GCRI or CSER or CSET or OpenAI or Anthropic or Longview or CLTR).&nbsp;</p><p>I think these are the things to pay attention when evaluating the historical performance of Bostrom's FHI. Not on the basis of the organizations ability to write PR-statements, or scale a large research lab while navigating politically difficult relationships with a 1000 year old university. &nbsp;Most well-run large research labs with squeaky-clean public image do not answer interesting questions that are crucial to humanity's future, in a way that a a reader can trust is actually driven by the desire to get the right answer, as opposed to pushing some kind of political or intellectual agenda. Indeed, I personally trust people more who don't spend a huge chunk of their energy trying to maintain a completely clean public image.&nbsp;</p><p>For basically any other organization that is not FHI that pursues similar questions, when I read their takes on the macrohistory, or the future of humanity, I usually primarily see attempts to spread some ideology, to gain resources for some interest group, or attempts to build some sphere of influence by telling the right kind of macrohistory. For core FHI work, like \"Eternity in Six Hours\" (one of the papers that's been most influential on my world view) I see what seems to me genuine interest in figuring out the truth and to answer the big questions, instead of secretly trying to trick me into supporting them, or get me to buy into their ideology, or support their favorite political cause or social movement, or to suspiciously shy away from a conclusion whenever that conclusion would be too hard to defend publicly to people who only want to spend 5 minutes on this question.</p><p>It is possible, and would be very sad, that FHI sadly cannot continue being this beacon, both because it scaled too quickly and its cultural magic is therefore no longer there, and because it is too deeply entwined with the University of Oxford, which will smother both its operational capacity and intellectual exploration.&nbsp;</p><p>In that case, I think the right choice is not for Bostrom to leave FHI, but for FHI to shut down. FHI is responsible for many of the best intellectual contributions for exploring the future of humanity, and I think before we do something that would substantially sabotage that legacy, it would be better to close down in a structured manner. I think it would be bad to let it fall in the hands of someone interested in making FHI into just another talent funnel, or another machine for producing prestige for Effective Altruism or AI Alignment or the people running FHI, while using up the credibility and intellectual integrity of Bostrom and many other core researchers who have created one of the highest integrity research institutions in the world.&nbsp;</p><p>I don't know enough details about the FHI situation to have a strong judgement on whether Bostrom should stay and try to right the ship, or shut FHI down, but I think asking Bostrom to step down because of controversies belies the value that FHI most provides for the world.&nbsp;</p><p>I do think it is plausible that we should consider FHI a lesson on why getting too involved with risk-averse institutions will ultimately bite us, and we should be more hesitant to embed ourselves deeply into institutions like Oxford university. If indeed FHI is irrevocably tied to Oxford, and Oxford is unlikely to give FHI the operational and intellectual independence it needs, then I strongly encourage Bostrom to close down FHI, and to start something new with more independence, less need for both difficult PR work, and less need for navigating messy university politics.&nbsp;</p><p>It's also possible to me that <a href=\"https://forum.effectivealtruism.org/posts/Riqg9zDhnsxnFrdXH/nick-bostrom-should-step-down-as-director-of-fhi?commentId=tMzhoDakvvkYzot7C\">Sean's proposal</a> of finding a co-director to run FHI with might be the best choice, and might allow Bostrom to focus more on producing great research, and run a somewhat larger organization at the same time, though of course and finding such a co-director is also very difficult (though does seem easier than finding someone to lead the institution fully on their own).</p>", "parentCommentId": null, "user": {"username": "Habryka"}}, {"_id": "xortAY97HemcLE2kx", "postedAt": "2023-03-05T01:04:22.800Z", "postId": "Riqg9zDhnsxnFrdXH", "htmlBody": "<p>Edit: I want to make it clear that I am talking about “genetic” differences not “environmental” differences in this comment. Thanks to titotal for pointing out I wasn’t clear enough. The survey of experts finds that far more experts believe both genetic factors and environmental factors play a role than just environmental factors. I spend the rest of my comment arguing that even if genetic factors play a role, genetic factors are so heavily influenced by environmental factors that we shouldn’t view them as evidence of innate differences in intelligence between races.&nbsp;</p><p><br>I find the repeated use of the term \"discredited\" to refer to studies on race and IQ on the forum deeply troubling. Yes, some studies will have flaws, but that means you have conversations about the significance of these flaws and respect that reasonable people can disagree about how best to measure complicated issues. It doesn't mean &nbsp;you dismiss everyone who agrees with the standard perspectives of experts in an academic field as racist. My favorite thing about this community is the epistemic humility. &nbsp;We are supposed to be the people who judge studies on their merits, no matter how uncomfortable they make us feel. The more we stray from this value, the less we are able to discover effective solutions to the catastrophic problems facing the world.</p><p>&nbsp;Scott Alexander (a psychiatrist and leading thinker in the rationalist community) tried his best to find surveys of experts in the field that would make the term \"discredited\" fair, and despite how uncomfortable it made him, he <a href=\"https://astralcodexten.substack.com/p/book-review-the-cult-of-smart\">could not</a>. In the best study he found, about four times as many experts agreed with the belief that the OP believes &nbsp;is discredited than disagreed. There is <a href=\"https://ourworldindata.org/reducing-lead-poisoning#:~:text=The%20cost%20of%20the%20problem,third%20child%20in%20the%20world.\">abundant data</a> that lead poisoning impairs cognition, and that a third of children are victims of lead poisoning. Roughly a third of GiveWell's <a href=\"https://www.givewell.org/how-we-work/our-criteria/cost-effectiveness/cost-effectiveness-models\">estimate</a> of the value of preventing malaria comes from long term income gains, implying that malaria often impairs the cognitive development of its victims in both direct and indirect ways. Economic changes have produced the <a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4152423/\">Flynn Effect</a> of IQs typically increasing as countries get richer. People's protection from the economic and medical harms that these studies observe vary widely depending on what country they are born into. Countries happen to have different racial makeups from each other. Family differences in IQ perpetuate themselves because people tend to marry other &nbsp;people with similar IQs. If there are genetic differences in average IQ between races, &nbsp;there is no reason to think they wouldn’t go away if unequal access to resources did. I don't view this data as evidence of innate intelligence differences between races, but as a call to arms to work till every child has equal opportunities to live up to their full potential no matter how poor their parents are.&nbsp;</p><p>In his apology statement, Bostrom refused to state an opinion about whether environmental factors influence cognitive development, &nbsp;whether some races have less access to protection from harmful environmental factors on average, and whether people are more likely to marry people that are more economically similar to themselves. If we think that is grounds for disqualification from a job, how can we use studies to find solutions to these problems?&nbsp;</p><p>I don't know enough about the rest of the problems the author described to have an opinion. I'm just objecting to this specific part.</p>", "parentCommentId": null, "user": {"username": "SoniaAlbrecht"}}, {"_id": "vJwjx7xg4m4So5raY", "postedAt": "2023-03-05T01:11:07.899Z", "postId": "Riqg9zDhnsxnFrdXH", "htmlBody": "<p>If Bostrom did step down as FHI director, who is likely to replace him? How confident are you that &nbsp;a new director will succeed in resolving conflicts with the broader philosophy department?<br><br>I have very little direct experience with FHI (just a very brief internship) but from the outside it looks like FHI has produced some <i>really</i> amazing research while Bostrom has directed it.<br><br>Perhaps a good way to appraise whether FHI has been performing above/below par during Bostrom's directorship is to compare its output to a similar organisation such as Global Priorities Institute. How would you compare the value of work done by FHI versus GPI? I don't know enough to be confident in this, but to me it seems like FHI has generated <i>far </i>more value (not that Bostrom is the only person to thank for this, but it seems like an important piece of evidence).<br><br>In any case - the views and oppinions of random users of this forum like me who aren't directly involved with FHI don't mean much, and I don't really see the benefits of raising this question in public on the EA forum.</p>", "parentCommentId": null, "user": {"username": "Xavier_ORourke"}}, {"_id": "cjSLjgoEWHATADdNc", "postedAt": "2023-03-05T05:55:47.245Z", "postId": "Riqg9zDhnsxnFrdXH", "htmlBody": "<p>Im happy Oxford might be taking this seriously. The EA community needs to take a way stronger stance against racism.</p>", "parentCommentId": null, "user": {"username": "deluks917"}}, {"_id": "kG3iasQEuCujhZpxK", "postedAt": "2023-03-05T06:04:10.163Z", "postId": "Riqg9zDhnsxnFrdXH", "htmlBody": "<p>(context: worked at FHI for 2 years, no longer affiliated with it but still in touch with some people who are)<br><br>I'd probably frame/emphasize things a bit differently myself but agree with the general thrust of this, and think it'd be both overdue and in everyone's interest.<br><br>The obvious lack of vetting of the apology was pretty disqualifying w.r.t. judgment for someone in such a prominent institutional and community position, even before getting to the content (on which I've commented &nbsp;elsewhere).&nbsp;<br><br>I'd add, re: pre-existing issues, that FHI as an institution has failed at doing super basic things like at least semi-regularly updating key components of their website*; the org's shortcomings re: diversity have been obvious from the beginning and the apology was the last nail in the coffin re: chances for improving on that front as long as he's in charge; and I don't think I know anyone who thinks he adds net positive value as a manager** (vs. as a researcher, &nbsp;where I agree he has made important contributions, but that could continue without him wasting a critical leadership position, and as a founder, where his work is done).&nbsp;<br><br>*e.g. the news banner thing displays 6 year old news; no publications at all were added to the publication page in all of last year, despite there definitely being several publications; etc.<br><br>**Edit: Sean's comment above suggests he maybe thinks Nick added value as a manager during a period that didn't overlap with mine, and I know Sean, so maybe I spoke too strongly here :) unclear if he meant as manager, or founder, or research visionary, or what, though. In any case, I think it is fair to say, from what I know, that many people who have been at FHI don't think he's a super active or effective manager.</p>", "parentCommentId": null, "user": {"username": "Miles_Brundage"}}, {"_id": "LKJrjLnqkaffRwdyS", "postedAt": "2023-03-05T06:17:43.605Z", "postId": "Riqg9zDhnsxnFrdXH", "htmlBody": "<p>Meta-note re: my commenting non-anonymously:&nbsp;<br><br>To be clear, I 'd say the same thing to Nick if asked, and mean what I said re: \"in everyone's interest\" - I assume he wants FHI to succeed. I suspect/hope Nick would wants friends/colleagues \"to disagree with [him] both publicly and privately; ... who will admonish [him], gently but firmly, with whatever grain of truth there is in any accusations against me.\" (from this article &nbsp;<a href=\"https://www.nytimes.com/2022/06/21/opinion/cancel-culture-friendship.html\">https://www.nytimes.com/2022/06/21/opinion/cancel-culture-friendship.html</a> &nbsp;- while I don't like the term cancel culture and, like OP here, don't think it's an apt description of this situation, some of the points are relevant here).<br><br>Also, I felt very conflicted about posting this, both because I've benefited in the past from both Nick's work and him hiring me, and because posting here stress me a lot (I expect lots of downvotes in absolute terms, though unsure how things will net out). This all stresses me out a lot. But I went ahead because I want FHI to be able to move on and thrive.<br><br>Edit: note I tweaked this comment a fair bit after reflecting on it some more, especially the last part, and I also wanted to signal-boost one of the comments in the thread from Jonas referenced above, here: <a href=\"https://twitter.com/JonasSandbrink/status/1631677091996393472?s=20\">https://twitter.com/JonasSandbrink/status/1631677091996393472?s=20</a> The point about mentorship is a big part of what I was gesturing at re: management effectiveness.</p>", "parentCommentId": "kG3iasQEuCujhZpxK", "user": {"username": "Miles_Brundage"}}, {"_id": "Xrfis9yJe5cRwCGsD", "postedAt": "2023-03-05T07:59:26.294Z", "postId": "Riqg9zDhnsxnFrdXH", "htmlBody": "<p>I agree that this is an unfair claim but the post wouldn't lose much force without it</p>\n", "parentCommentId": "9KyaccMEJtiFPkvuz", "user": {"username": "jooke"}}, {"_id": "BuTcwoziMe3papwjK", "postedAt": "2023-03-05T11:22:14.494Z", "postId": "Riqg9zDhnsxnFrdXH", "htmlBody": "<p>So I don't have any extra knowledge to add to FHI, but I think this quote hits on something key:</p><blockquote><p>and I don't think I know anyone who thinks he adds net positive value as a manager** (vs. as a researcher, &nbsp;where I agree he has made important contributions, but that could continue without him wasting a critical leadership position, and as a founder, where his work is done).&nbsp;</p></blockquote><p>There are a few cases like this where excellent EA researchers end up as org leaders, but this is not the thing that they're best at. From other people's reports in this thread Bostrom seems to be a textbook example here. I'd also say MacAskill and Backstead come to my mind here given that they are board members of EVF, but their background/experience/expertise is mostly in academic philosophy as far as my outside view can tell.<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnref6zspw1bsp2k\"><sup><a href=\"#fn6zspw1bsp2k\">[1]</a></sup></span>&nbsp;</p><p>I can see the argument that you'd want someone with this background who has deep knowledge of the movement's philosophical tradition and arguments to be on a board, but I'd be surprised if the very best people in EA at research/idea generation would also be the very best we have at organisational strategy, community leadership, and people management - which are the qualities I'd want to be at the heads of EA organisations. The suggestion by <a href=\"https://forum.effectivealtruism.org/posts/Riqg9zDhnsxnFrdXH/nick-bostrom-should-step-down-as-director-of-fhi?commentId=tMzhoDakvvkYzot7C\">Sean</a> about a co-directorship might be a good one for many EA orgs perhaps? I sense that we're probably very over-indexed in excellent reseachers and under-indexed in organisational experts, so this might be a way of not letting the former crowd out the latter for these leadership roles.</p><p>Final quick points for clarification:</p><ol><li>I've never run or been part of leading a significant organisation myself, so these thoughts can definitely be wrong! And I'd appreciate explanations as to why</li><li>My <i>apriori </i>view that Will and Nick might not be the best org leaders in EA doesn't mean I don't like them as people, or I don't like their work</li><li>I'm open to the point of view that these EA thought leaders end up leading orgs because there are few others putting themselves forward. I assume those running EA orgs have the evidence for this one way or the other, and if true it'd be a good thing to look at rectifying.</li></ol><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fn6zspw1bsp2k\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnref6zspw1bsp2k\">^</a></strong></sup></span><div class=\"footnote-content\"><p>I'm sure this pattern holds for other orgs as well, EVF is just what came to mind</p></div></li></ol>", "parentCommentId": "kG3iasQEuCujhZpxK", "user": {"username": "JWS"}}, {"_id": "TkjJpdYYFwda8LiYw", "postedAt": "2023-03-05T15:34:26.456Z", "postId": "Riqg9zDhnsxnFrdXH", "htmlBody": "<ol>\n<li>\n<p>FHI is dying under Nick Bostrom. It doesn't matter if you think he's done good work as director before. The dispute with the faculty means that either he goes or FHI goes, for all intents and purposes. FHI is down to a handful of people and the university makes it hard for them to hire or renew contracts, de facto sunsetting the organization.</p>\n</li>\n<li>\n<p>That said, this post is sadly perhaps counterproductive, because according to several people Nick might otherwise consider stepping down but in the wake of the apology this has become less likely.</p>\n</li>\n</ol>\n<p>It frustrates me that a lot of the comments appear to be based on \"vibes\". This is not a referendum on the apology nor about whether you generally like the work FHI has produced.</p>\n<p>No matter whether he was the only person who could have led FHI so well before, at this point he should step down before FHI goes completely defunct. I don't think it would make him look bad to step down. I think it looks bad for him to stay at the expense of FHI. There is not another place like FHI in the world, and it would be really bad for it to shut down, or even for it to hobble along as a shell of its former self.</p>\n", "parentCommentId": null, "user": {"username": "Mervin"}}, {"_id": "rw29rEvviF84mSjvL", "postedAt": "2023-03-05T15:49:27.383Z", "postId": "Riqg9zDhnsxnFrdXH", "htmlBody": "<p>FHI and GPI have different aims. I think the better comparison would be FHI today vs. what FHI could be. Or FHI today vs. FHI before things went to pot.</p>\n<p>All the people I know who have recently worked at/work at FHI want him to step down, they just are uncomfortable saying so directly. I agree that this is not a good place to raise the issue, but I'm not sure where is, given that. I hope this thread emboldens others to have a frank conversation, and it's possibly helpful to have information out there. I would really like FHI to survive, and it sounds like it could if he stepped down.</p>\n", "parentCommentId": "vJwjx7xg4m4So5raY", "user": {"username": "Mervin"}}, {"_id": "R4mo7C4MR98w3p5kG", "postedAt": "2023-03-05T16:39:54.697Z", "postId": "Riqg9zDhnsxnFrdXH", "htmlBody": "<p>I don't really like discussing race and IQ stuff (and if you don't like it either, I think it's completely fine to stay away). Unfortunately, I have to step in and point out that this comment is inaccurate/misleading when it comes to the science and the descriptions of peoples beliefs.&nbsp;</p><p>Lead poisoning, the flynn effect, and malaria are all <i>environmental</i> factors, not genetic ones. nobody who has read up on the issue denies that average IQ test scores are different for different races, the argument is about how much of the difference is attributable to environmental factors. &nbsp;(I'm pretty sure that Bostrom did claim an opinion about whether \"environmental factors influence cognitive development\", because the answer is an uncontroversial yes.&nbsp;</p><p>If the differences were near-entirely genetic in nature, then eliminating unequal access to resources, lead poisoning, different cultures, etc, &nbsp;wouldn't have any effect on IQ differences, because it wouldn't affect genes. Holding this position requires thinking that there aren't any significant differences in environment between the races that could affect IQ significantly. I think this view is fairly extreme and unlikely, and I think it would be fair to call this position \"discredited\". &nbsp;The IQ gap between black people and white people in america is only in the range of 9-15 points, and environmental factors can affect IQ test scores on that magnitude: one study found that adopting a poor kid could jump their <a href=\"https://www.vox.com/the-big-idea/2017/6/15/15797120/race-black-white-iq-response-critics\">IQ test scores by 12-18 points</a>. &nbsp;</p><p>Bostrom didn't take this position, he just said it is unknown how much the gap is genetic vs environmental, which is true. Social science is very difficult, the only way to truly know the answer is to end all environmental differences and to see what happens, which is impossible given that this includes things like cultural differences, or to find a measurable thing in biology that corresponds to IQ test scores (which I've seen biologists express skepticism about).&nbsp;</p><p>The real problem with these discussions is that full on KKK style racist people exist, have a loud voice on the internet, and are extremely keen to use the uncertainty above as a bludgeon against minorities. It's a classic motte and bailey: you go from \"the causes of the racial IQ test score gap are unknown\" to \"it's mostly genetic\", to \"black people are dumber than white people and you should discriminate against them\". &nbsp;I think one of the key mistakes Bostrom made was not being 100%, explicitly, forcefully anti-racist in his apology, because they absolutely have used it and the subsequent controversy as a recruiting ground for their ideas.&nbsp;</p>", "parentCommentId": "xortAY97HemcLE2kx", "user": {"username": "titotal"}}, {"_id": "hifQWqRHPif3pSRXW", "postedAt": "2023-03-05T20:42:26.586Z", "postId": "Riqg9zDhnsxnFrdXH", "htmlBody": "<p>I realize I wasn’t clear enough that I was talking about genetic stuff the whole time in my comment. Sorry about that! I will edit my comment for clarity.</p>\n<p>The first study I referenced was specifically referring to whether IQ differences between races have a genetic element. It found that far more experts in the field believe it has both a genetic element and a environmental element than just an environmental element.</p>\n<p>I believe that environmental factors influence genetics enough that you don’t need to interpret genetic differences as innate racial differences. I explained my reasons for that the end of my middle paragraph , but spent so much time  talking about the environmental factors that I believe contribute to genetic factors that your  impression may have been reasonable.</p>\n<p>The very racist people you've described will certainly try take these studies the wrong way, but they are very rare in the upper class western places EAs typically inhabit. I’ve found that a bigger risk in our communities is relatively left wing people trying to pursue professional retaliation against centrist people for believing things that make them uncomfortable, no matter how common the belief is among experts in the field or how much we oppose the extremists they associate us with.</p>\n", "parentCommentId": "R4mo7C4MR98w3p5kG", "user": {"username": "SoniaAlbrecht"}}, {"_id": "itTisLCnPPyDiBAAd", "postedAt": "2023-03-05T21:06:05.184Z", "postId": "Riqg9zDhnsxnFrdXH", "htmlBody": "<p>3 notes on the discussion in the comments.<br><br>1. OP is clearly talking about the last 4 or so years, not FHI in eg 2010 to 2014. So quality of FHI or Bostrom as a manager in that period is not super relevant to the discussion. The skills needed to run a small, new, scrappy, blue-sky-thinking, obscure group are different from a large, prominent, policy-influencing organisation in the media spotlight.<br><br>2. The OP is not relitigating the debate over the Apology (which I, like Miles, have discussed elsewhere) but instead is pointing out the practical difficulties of Bostrom staying. Commenters may have different views from the University, some FHI staff, FHI funders and FHI collaborators - that doesn't mean FHI wouldn't struggle to engage these key stakeholders.<br><br>3. In the last few weeks the heads of Open Phil and CEA have stepped aside. Before that, the leadership of CSER and 80,000 Hours has changed. There are lots of other examples in EA and beyond. Leadership change is normal and good. While there aren't a huge number of senior staff left at FHI, presumably either Ord or Sandberg could step up (and do fine given administrative help and willingness to delegate) - or someone from outside like Greaves plausibly could be Director.</p>", "parentCommentId": null, "user": {"username": "HaydnBelfield"}}, {"_id": "XBWHyd2wCN2AxhzoK", "postedAt": "2023-03-05T21:22:18.001Z", "postId": "Riqg9zDhnsxnFrdXH", "htmlBody": "<p>\"This post is anonymised because I don't want to have to deal with the interpersonal consequences of the beliefs I hold; I don't want people knowing that I hold my beliefs, and would rather trick people into associating with me in ways they might not if they actually knew my true stance.\"</p>", "parentCommentId": null, "user": {"username": "Duncan Sabien"}}, {"_id": "najCjJmqTWCw8y3qN", "postedAt": "2023-03-05T21:55:22.000Z", "postId": "Riqg9zDhnsxnFrdXH", "htmlBody": "<p>In my experience, there's a pattern, in social attacks like this, where critics are persistently, consistently unwilling to restrain themselves to only making criticisms that are true, regardless of whether the true criticisms would have been enough. This is a big deal and should not be tolerated.</p>", "parentCommentId": "Xrfis9yJe5cRwCGsD", "user": {"username": "jimrandomh"}}, {"_id": "Ju8qko9u37gt8GzSW", "postedAt": "2023-03-05T22:14:12.916Z", "postId": "Riqg9zDhnsxnFrdXH", "htmlBody": "<blockquote><p>Peter Wildeford wrote a personal&nbsp;<a href=\"/posts/ALzE9JixLLEexTKSq/cea-statement-on-nick-bostrom-s-email\"><u>post</u></a> criticizing the Apology</p></blockquote><p>I want to flat that this link goes to a post written by Shakeel Hashim in his role managing communications for CEA, not a personal post by Peter Wildeford. Could you please either update this link or change the wording?</p>", "parentCommentId": null, "user": {"username": "jlemien"}}, {"_id": "YB7rfZ4bbMrDKLHaX", "postedAt": "2023-03-05T22:37:56.552Z", "postId": "Riqg9zDhnsxnFrdXH", "htmlBody": "<p>There have been so many posts on this already - and, oh, here's another one - seeing the Apology part makes up most of the post. Here's an opinion from outside: the Apology is not anywhere close to being this serious of an issue it is presented. I'll say more: many people would even argue the original post Bostrom issued the apology for wasn't particularly bad. Because many people worldwide may well hold views that here are seen as abhorrent. I'm not sure this holier than thou attitude on the forum is all that beneficial.</p>\n", "parentCommentId": null, "user": {"username": "Michał Zabłocki"}}, {"_id": "agCBmAfwtYKBtSd4k", "postedAt": "2023-03-06T00:04:37.629Z", "postId": "Riqg9zDhnsxnFrdXH", "htmlBody": "<blockquote><p>I think asking Bostrom to step down because of controversies belies the value that FHI most provides for the world.&nbsp;</p></blockquote><p>Is there any controversy that you'd consider bad enough for you to support Bostrom stepping down from FHI? Because this sounds like no?<br>&nbsp;</p>", "parentCommentId": "h9gdA4snagQf7bPDv", "user": {"username": "pseudonym"}}, {"_id": "hoHSfHC5oznMJF3D5", "postedAt": "2023-03-06T00:54:28.408Z", "postId": "Riqg9zDhnsxnFrdXH", "htmlBody": "<p>I think that he generally means something that can be described as a controversy but <em>not</em> much else in addition to that. A \"simple\" controversy you might say. For example, I assume that controversies which are also crimes, and controversies which are also signs of poor mental health which could impact the job, would not be included here.</p>\n<p>Just my guess</p>\n", "parentCommentId": "agCBmAfwtYKBtSd4k", "user": {"username": "Ivy_Mazzola"}}, {"_id": "dkXBWJ5zwHEZsJxaZ", "postedAt": "2023-03-06T01:15:31.664Z", "postId": "Riqg9zDhnsxnFrdXH", "htmlBody": "<p>Mervin makes a great point that it is hard to compare GPI to FHI in general. But I also think comparing <em>past</em> FHI and <em>past</em> GPI is not the right way of thinking about it - instead we want to compare <em>current/expected future</em> FHI to <em>current/expected future</em> GPI. And the fact of the matter is quite clear that <em>current/expected future</em> GPI still can actually hire people, engage in productive research work, and maintain a relationship with the university whereas <em>current/expected future</em> FHI I think can best be described as \"basically dead\".</p>\n", "parentCommentId": "vJwjx7xg4m4So5raY", "user": {"username": "Peter_Hurford"}}, {"_id": "RGewuFYSuTQ6LjCuC", "postedAt": "2023-03-06T01:16:42.160Z", "postId": "Riqg9zDhnsxnFrdXH", "htmlBody": "<p>I think it was meant to link to my piece: <a href=\"https://www.pasteurscube.com/why-im-personally-upset-with-nick-bostrom-right-now/\">\"Why I'm personally upset with Nick Bostrom right now\"</a>.</p>\n", "parentCommentId": "Ju8qko9u37gt8GzSW", "user": {"username": "Peter_Hurford"}}, {"_id": "rKhG6DcWzoLB2oqk9", "postedAt": "2023-03-06T01:18:20.256Z", "postId": "Riqg9zDhnsxnFrdXH", "htmlBody": "<p>I strongly disagree with you but yeah I really don't think we need to re-litigate the apology. There are lots of other threads for that.</p>\n", "parentCommentId": "YB7rfZ4bbMrDKLHaX", "user": {"username": "Peter_Hurford"}}, {"_id": "pqPL7DxJFvZBvdek9", "postedAt": "2023-03-06T01:19:50.364Z", "postId": "Riqg9zDhnsxnFrdXH", "htmlBody": "<p>Does being the best philosopher of our time and the main founder or longtermism mean that he is the best person to run FHI as a Director? I don't really see the relevance.</p>\n", "parentCommentId": "gdGpc6syDRCGLnkCD", "user": {"username": "Peter_Hurford"}}, {"_id": "MgjtXkQXLengFFfFC", "postedAt": "2023-03-06T01:20:48.801Z", "postId": "Riqg9zDhnsxnFrdXH", "htmlBody": "<p>1 and 2 are very good points, thanks.</p>\n<p>re 3: It's also not out of the question that they could just aim to have an open (or private) hiring round for a new Director, perhaps with Ord or Sandberg as Interim/Acting Director in the meantime.</p>\n", "parentCommentId": "itTisLCnPPyDiBAAd", "user": {"username": "Peter_Hurford"}}, {"_id": "8jMLwmcjt8phTsZeB", "postedAt": "2023-03-06T01:32:31.729Z", "postId": "Riqg9zDhnsxnFrdXH", "htmlBody": "<p>Sounds like a reasonable assumption, but I just thought it'd would be worth clarifying because Habryka is someone who cares a lot about the actual literal meaning of words, so I should err on the side of taking what he says literally.</p>", "parentCommentId": "hoHSfHC5oznMJF3D5", "user": {"username": "pseudonym"}}, {"_id": "gjc5FswcAwTQpsPfs", "postedAt": "2023-03-06T01:38:00.456Z", "postId": "Riqg9zDhnsxnFrdXH", "htmlBody": "<p>I hesitate to weigh in here but I really don't think this is a good way of thinking about it.</p>\n<p>I'm certainly not trying to \"bully\" Bostrom and I don't view the author of this post as trying to \"bully\" Bostrom either. If Bostrom were to step down as Director, I don't see that as somehow a \"win\" for \"bullying\", whatever that means.</p>\n<p>I do agree that being able to come up with important and useful ideas requires feelings of safety and for this reason and others I always want to give people the benefit of the doubt when they express themselves. Moreover, I understand that in a social movement made up of thousands of people, you are not going to be able to find common agreement on every issue and in order to make progress we need to find some way to deal with that. So I am pretty sympathetic to the view that Bostrom deserves some form of generalized protection even if he's said colossally stupid things.</p>\n<p>But - to be clear - no one I know is trying to get Bostrom fired or expelled or cancelled or jailed or anything. He still could have a very cushy, high status, independent non-cancelled life as a \"FHI senior researcher\", even if he weren't Director. The question is - should he be Director?</p>\n<p>My understanding of the view of the author of this post is that:</p>\n<p>(1) FHI is probably useful and important and does good things for the world,</p>\n<p>(2) FHI would probably be more useful and more important and do more good things for the world if it had a really great Director,</p>\n<p>and (3) Bostrom is not a really great Director (at least going forward in expectation).</p>\n<p>The alleged \"significant mismanagement\" seems like great evidence for (3). This is just basic consequentialist reasoning that I think all orgs - especially those that claim to be affiliated with effective altruism - engage in. I'd happily welcome people write \"Peter Wildeford should step down as Co-CEO of Rethink Priorities\" if there indeed were good reasons for me to do so.</p>\n<p>So I certainly find it overdramatic at best to take \"here are a few reasons why Bostrom would not be the ideal leader of FHI going forward\" and convert it to \"all original thinkers have a Sword of Damocles hanging over their head, knowing they might be denounced and fired if that became politically expedient\". Being a good leader means things like being able to communicate well and understand when your actions will have predictably bad consequences, avoid making everyone really uncomfortable about working with you, and avoid getting your organization to the point where you can't hire anyone and your operations staff and other key leadership quit. To be frank - a lot of Bostrom's research is great and I'm very grateful to him for a lot of it, but this benchmark is just something Bostrom isn't accomplishing and I think independent researcher life would suit him better and be a win-win for everyone.</p>\n", "parentCommentId": "t99CfxyGd4oqz82dd", "user": {"username": "Peter_Hurford"}}, {"_id": "ELrvECfpc4BmE5YGP", "postedAt": "2023-03-06T01:52:43.420Z", "postId": "Riqg9zDhnsxnFrdXH", "htmlBody": "<p>Do you think there is a way we could score FHI in a way that would be comparable in the worlds with and without Bostrom?</p><p>If so, this really does seem like a place for prediction markets.</p>", "parentCommentId": "gjc5FswcAwTQpsPfs", "user": {"username": "nathan"}}, {"_id": "mobz6x57K8bEhC2aZ", "postedAt": "2023-03-06T01:59:24.861Z", "postId": "Riqg9zDhnsxnFrdXH", "htmlBody": "<p>From where I sit -It's really hard to guess at all the details and relevant context of what's going on (which is why I feel a bit stupid commenting on it... but I guess I can't resist lol).<br><br>Is FHI the only org being subject to a hiring freeze? Or is the university/philosophy department cutting costs in many places? Are conflicts with the philosophy department basically FHI's fault? Or is the bureaucracy dysfunctional/unfriendly to FHI in ways which made it impossible to keep them happy without making other costly tradeoffs? If Nick steps down as director, is there somebody else waiting in the wings who is likely to do a better job and successfully resolve the issue?<br><br>The only thing I know <i>for sure</i> looking in from the outside is that FHI has been doing really really great work <a href=\"https://emojipedia.org/person-shrugging/\">🤷</a></p>", "parentCommentId": "dkXBWJ5zwHEZsJxaZ", "user": {"username": "Xavier_ORourke"}}, {"_id": "rynrxJe5z2dyvgkDg", "postedAt": "2023-03-06T02:01:00.202Z", "postId": "Riqg9zDhnsxnFrdXH", "htmlBody": "<p>My understanding is that this is indeed unique to FHI, unfortunately. This is maybe why FHI and GPI make for a compelling comparison - both are EA-affiliated, both are in the University of Oxford. While working with a University is never easy, GPI seems totally fine and indeed does continue to hire, run events, etc. FHI does not.</p>\n<p>I don't know about the alternatives to Bostrom or how likely they would be to change the situation. Nathan makes a good point that perhaps prediction markets could play a role here. I generally think that, given I run an EA research org that could be construed as competing with FHI for funding/talent/influence/etc. I shouldn't really engage in explicitly calling for Bostrom to step down or help analyze the alternatives. But hopefully I can more generally help people think through the situation more clearly as a whole. I mainly wrote what I wrote because the comment made me angry enough that I felt like I had to.</p>\n", "parentCommentId": "mobz6x57K8bEhC2aZ", "user": {"username": "Peter_Hurford"}}, {"_id": "8BH7vXkkvMmLYkzRr", "postedAt": "2023-03-06T02:17:30.151Z", "postId": "Riqg9zDhnsxnFrdXH", "htmlBody": "<p>Totally! There are lots of controversies that I think would be quite bad. If Bostrom had stolen money, or falsified data, or shared a bunch of AI capability research ideas irresponsibly, or had committed sexual assault, or had badly mismanaged some conflict of interest, or had displayed some other deceptive attitude.&nbsp;</p><p>I am not sure what you mean by \"controversy bad enough\". A lot of people seem angry at Bostrom, but that surely isn't a good measure of \"how bad\" something that someone did was.</p>", "parentCommentId": "agCBmAfwtYKBtSd4k", "user": {"username": "Habryka"}}, {"_id": "GqiJo5Cge3aynGjee", "postedAt": "2023-03-06T02:34:41.681Z", "postId": "Riqg9zDhnsxnFrdXH", "htmlBody": "<p>Thanks for clarifying!</p><p>On \"controversy bad enough\", I asked that because your statement was \"I think asking Bostrom to step down because of controversies belies the value that FHI most provides for the world\", and I didn't know whether you were referring to these recent controversies specifically (the bad effects of the recent controversies isn't bad enough to override the good that Bostrom is expected to provide in the future over the counterfactual), or about controversies generally (asking Bostrom to step down because of controversies in general misses the value of what Bostrom brings; we should not do this).</p><blockquote><p>A lot of people seem angry at Bostrom, but that surely isn't a good measure of \"how bad\" something that someone did was.</p></blockquote><p>Yeah, I agree that in many cases it isn't a good measure, but I think saying it \"surely isn't a good measure\" probably goes too far. There probably are nonzero contexts where it is a good measure, even if this isn't one of them. For example, if someone's work and role was highly dependent &nbsp;on or affected by popular opinion or buy-in, then something can be bad just because of a lot of people being angry at it.</p>", "parentCommentId": "8BH7vXkkvMmLYkzRr", "user": {"username": "pseudonym"}}, {"_id": "yHbXyfCxKf9yuZ6Bi", "postedAt": "2023-03-06T02:41:07.472Z", "postId": "Riqg9zDhnsxnFrdXH", "htmlBody": "<p>Ah, yeah, sorry, that was indeed unclear of me. I think saying \"because of recent controversies\" would have been more accurate. I wasn't trying to make a statement about all types of controversies (people totally get angry and cause controversies for good reasons as well as bad reasons).</p>", "parentCommentId": "GqiJo5Cge3aynGjee", "user": {"username": "Habryka"}}, {"_id": "tdMkAybwi3FvFXFuX", "postedAt": "2023-03-06T03:36:31.676Z", "postId": "Riqg9zDhnsxnFrdXH", "htmlBody": "<p>Relevant context is that FHI had a hiring freeze and was dying before the apology. And yes, it's only FHI. There was some kind of cutting corners to avoid bureaucracy and the department got mad. It's possible that with another leader FHI would be able to be rehabilitated in the department. Nobody can say for sure, but their best bet would be to go with someone willing to play by the book, and it would be odd for the department to have a grudge against new leadership.</p>\n", "parentCommentId": "mobz6x57K8bEhC2aZ", "user": {"username": "Mervin"}}, {"_id": "8an6BSnCF9A2pepiz", "postedAt": "2023-03-06T06:28:55.898Z", "postId": "Riqg9zDhnsxnFrdXH", "htmlBody": "<p>Given how the Oxford group has become the most relevant internationally in the academic research of X-risk is hard to argue against his tenure.</p>\n<p>Beyond that, my main claim is about the mail incident. I claim: i) the original mail was a minor misstep by a young person without special responsibilities and, ii)  not taking a position on the issue of the racial IQ gap is not only acceptable but morally mandatory.</p>\n", "parentCommentId": "pqPL7DxJFvZBvdek9", "user": {"username": "Arturo Macias"}}, {"_id": "bTGoHT2imizLf5beA", "postedAt": "2023-03-06T07:09:53.175Z", "postId": "Riqg9zDhnsxnFrdXH", "htmlBody": "<p>Bostrom did <strong>not</strong> say it was unknown how much the gap is genetic vs environmental. He said <strong>he </strong>didn't know. This apparently made some people mad, but I think what made people <strong>more </strong>mad was that they read things into the apology that Bostrom didn't say, then got mad about it. (That's why most people criticizing the apology avoid quoting the apology.)</p><p>There is a <a href=\"https://en.wikipedia.org/wiki/Race_and_intelligence#Research_into_possible_genetic_influences_on_test_score_differences\">Wikipedia page</a> that says</p><blockquote><p>The scientific consensus is that there is no evidence for a genetic component behind IQ differences between racial groups.[<i>9 citations</i>]</p></blockquote><p>I've also glanced at a couple of scientific papers that seem to imply otherwise (<a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4804158/\">this one</a> and <a href=\"https://lepo.it.da.ut.ee/~spihlap/snyderman@rothman.pdf\">this one</a>). These papers basically say that most experts think the role of genetics is greater than zero. I don't care to investigate with a ten-foot pole why Wikipedia is in tension with these papers, and I don't blame Bostrom for feeling the same way.</p><p>I think this issue is a lot like the lab-leak hypothesis of Covid: it doesn't really matter whether Covid escaped from a lab, because gain-of-function research is dangerous either way, so our policy will be the same either way (oppose GoF research). In the same way, it doesn't seem very useful to study racial IQ differences; our policy decision should be the same regardless (reduce poverty in Africa—poverty is bad; prosperity and education both increase IQ). &nbsp;And I have no doubt Bostrom would agree.</p>", "parentCommentId": "R4mo7C4MR98w3p5kG", "user": {"username": "dpiepgrass"}}, {"_id": "KsqYv9ECZySs4ccuS", "postedAt": "2023-03-06T07:39:42.722Z", "postId": "Riqg9zDhnsxnFrdXH", "htmlBody": "<p>We <strong>are</strong> strongly against racism. It's just that Nick Bostrom is not racist (even though I find that his comment 26 years ago was extremely cringe and his apology wasn't done particularly well.)</p><p>Perhaps you have some insight about what was meant by \"the views this particular academic expressed in his communications\"? The criticisms of Bostrom I've seen have consistently declined to say what \"views\" they are referring to. One exception to this is that I heard one person say that <i>almost everyone thinks</i> it is racist to say that a racial IQ gap exists. To anyone who thinks this, I suggest searching for the word \"gap\" in this <a href=\"https://en.wikipedia.org/wiki/Race_and_intelligence\">Wikipedia article</a>. And by the way, the main thread for discussing the apology is <a href=\"https://forum.effectivealtruism.org/posts/kuqgJDPF6nfscSZsZ/thread-for-discussing-bostrom-s-email-and-apology\">here</a>.</p>", "parentCommentId": "cjSLjgoEWHATADdNc", "user": {"username": "dpiepgrass"}}, {"_id": "Kimn2GMgYeDwWahXK", "postedAt": "2023-03-06T07:43:56.966Z", "postId": "Riqg9zDhnsxnFrdXH", "htmlBody": "<blockquote><p>The survey of experts finds that far more experts believe both genetic factors and environmental factors play a role than just environmental factors.</p></blockquote><p>Are you referring to <a href=\"https://www.frontiersin.org/articles/10.3389/fpsyg.2016.00399/full\">Rindermann et al. 2016</a>? The core table is this,</p><figure class=\"image\"><img src=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/Kimn2GMgYeDwWahXK/vudhuzocj7fnptfajq31\" srcset=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/Kimn2GMgYeDwWahXK/gv36nwuecprcy7qls89q 120w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/Kimn2GMgYeDwWahXK/pwihm1pd6in4b1iyaupv 240w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/Kimn2GMgYeDwWahXK/ox8ftwfnobuaxs0bfbu2 360w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/Kimn2GMgYeDwWahXK/dhaglxghn0fvk6v7ikma 480w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/Kimn2GMgYeDwWahXK/ls3dtbxvhqj25fbkn7hk 600w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/Kimn2GMgYeDwWahXK/tqeblzchbvymvt7z3uso 720w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/Kimn2GMgYeDwWahXK/wa63rmasrsqdcqvmkl2b 840w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/Kimn2GMgYeDwWahXK/qal6b0tdifsg8utfamvx 960w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/Kimn2GMgYeDwWahXK/ebxdj2dce6wasdqzxliy 1080w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/Kimn2GMgYeDwWahXK/lego60b12kitsotn1nhy 1141w\"></figure><p>It is concerning to see 'discredited' used so easily &nbsp;when it is far from clear that it is an accurate label. This is not my specialty so I'm not qualified to have an opinion, but it seems more like rejecting some hypotheses a priori, without consideration. I'd like to see further discussion which qualifies such claims.&nbsp;</p>", "parentCommentId": "xortAY97HemcLE2kx", "user": {"username": "dumont"}}, {"_id": "z9aHwaSbyN45fbwep", "postedAt": "2023-03-06T07:43:59.988Z", "postId": "Riqg9zDhnsxnFrdXH", "htmlBody": "<p>Are you claiming that there are other deceptive statements in this post?</p>\n", "parentCommentId": "najCjJmqTWCw8y3qN", "user": {"username": "jooke"}}, {"_id": "esSPijwhwhXnkSqTD", "postedAt": "2023-03-06T07:50:08.841Z", "postId": "Riqg9zDhnsxnFrdXH", "htmlBody": "<blockquote><p>one study found that adopting a poor kid could jump their <a href=\"https://www.vox.com/the-big-idea/2017/6/15/15797120/race-black-white-iq-response-critics\">IQ test scores by 12-18 points</a>. &nbsp;</p></blockquote><p>I expected this to link to the study, but it doesn't?</p>", "parentCommentId": "R4mo7C4MR98w3p5kG", "user": {"username": "dumont"}}, {"_id": "i4cx6ECTXrHB7cSCT", "postedAt": "2023-03-06T08:09:11.358Z", "postId": "Riqg9zDhnsxnFrdXH", "htmlBody": "<blockquote>\n<p>Given how the Oxford group has become the most relevant internationally in the academic research of X-risk is hard to argue against his tenure.</p>\n</blockquote>\n<p>Disagree. The relevance here is what FHI will accomplish in the future, not what it has accomplished in the past. And it seems clear that it is not hard to argue against his tenure as people are clearly doing just that.</p>\n<blockquote>\n<p>Beyond that, my main claim is about the mail incident.</p>\n</blockquote>\n<p>Disagree with you as well, but I am going to stand by my desire to not relitigate the apology here and instead defer that conversation to other threads.</p>\n", "parentCommentId": "8an6BSnCF9A2pepiz", "user": {"username": "Peter_Hurford"}}, {"_id": "jcaMAyWTmcYYMitAy", "postedAt": "2023-03-06T10:34:35.954Z", "postId": "Riqg9zDhnsxnFrdXH", "htmlBody": "<p>I didn't make that claim in the grandparent comment, and I don't know of any specific other deceptive statements in it. But, on consideration... yeah, there probably are. Most of the post is about internal details of FHI operations which I know little about and have no easy way to verify. The claim about the Apology is different in that it's easy to check; it seems reasonable to expect that if the most-verifiable part contains an overreach, then the less-verifiable parts probably do too.</p>", "parentCommentId": "z9aHwaSbyN45fbwep", "user": {"username": "jimrandomh"}}, {"_id": "ngctwY7ZMYqoaaFSu", "postedAt": "2023-03-06T11:16:54.984Z", "postId": "Riqg9zDhnsxnFrdXH", "htmlBody": "<p>If you previously thought he should step down, and then we received no positive news about his suitability for the role, I think it's indefensible to keep him on just to prove a point. It's an important job! We really need to ensure that the person in the role is capable of it! To say that you think that Bostrom is not fit for it and yet should stay in it IMO shows a lack of respect for the actual research work that FHI does.</p>\n", "parentCommentId": "t99CfxyGd4oqz82dd", "user": {"username": "BenMillwood"}}, {"_id": "2KmMT7t2bfNFwL72b", "postedAt": "2023-03-06T12:06:41.016Z", "postId": "Riqg9zDhnsxnFrdXH", "htmlBody": "<blockquote>\n<p>Are conflicts with the philosophy department basically FHI's fault?</p>\n</blockquote>\n<p>I think this is a relevant question, but I don't think it's the whole question (not that you were claiming it was). As an outsider who has heard some stories and has some guesses, I would conjecture that the University is (at least sometimes) unreasonable and bureaucratic, but nevertheless, if you want to be a director of a university-affiliated research group, \"managing the relationship with the university, even when they are being unreasonable\" is absolutely a core competency of the job, and it's not one that Nick has had much luck with.</p>\n", "parentCommentId": "mobz6x57K8bEhC2aZ", "user": {"username": "BenMillwood"}}, {"_id": "ZbGzcSx2rKSv5BNur", "postedAt": "2023-03-06T12:13:07.915Z", "postId": "Riqg9zDhnsxnFrdXH", "htmlBody": "<blockquote>\n<p>the Apology part makes up most of the post</p>\n</blockquote>\n<p>If you set aside the apology part of the post, and just focus on e.g. the fact that FHI has lost many of their staff and has been unable to hire for two years, how do you feel about Nick as director considering only those facts?</p>\n", "parentCommentId": "YB7rfZ4bbMrDKLHaX", "user": {"username": "BenMillwood"}}, {"_id": "Sut5Wsww69n7yppBq", "postedAt": "2023-03-06T12:18:00.802Z", "postId": "Riqg9zDhnsxnFrdXH", "htmlBody": "<p>I think we should link to a discussion of this elsewhere, and not revisit it here, because it seems like a really big topic that could easily take over the entire comment thread and in my view doesn't change the conclusion of the post much (since I think the case for Nick stepping down was already good enough before the apology).</p>\n", "parentCommentId": "xortAY97HemcLE2kx", "user": {"username": "BenMillwood"}}, {"_id": "dH4C2s7gZ95FzHFEJ", "postedAt": "2023-03-06T12:21:35.908Z", "postId": "Riqg9zDhnsxnFrdXH", "htmlBody": "<p>The point is that he reused the term, and didn't redact it by e.g. saying \"n------!!!!” or \"the n-word\".</p>", "parentCommentId": "9KyaccMEJtiFPkvuz", "user": {"username": "HaydnBelfield"}}, {"_id": "txN4AutyFoyxkzwTr", "postedAt": "2023-03-06T13:01:15.986Z", "postId": "Riqg9zDhnsxnFrdXH", "htmlBody": "<p>Given the problems that FHI has run into here, do you think it's likely to continue to do good work? My guess is that being able to hire is crucial to that work. Given that, we have to ask ourselves: how long should we wait for Nick to find a resolution to these problems before we conclude that he's unable to solve them? My guess is that two years into a hiring freeze is long enough.</p>\n<p>I agree with you that we should update somewhat in the direction of cooperating with universities being difficult and costly. But we should also entertain the hypothesis that it's good to collaborate with universities, but it's not good to ask Nick to be the one who does it.</p>\n", "parentCommentId": "h9gdA4snagQf7bPDv", "user": {"username": "BenMillwood"}}, {"_id": "ZwQH4eHqRwvhpA4YY", "postedAt": "2023-03-06T14:13:40.083Z", "postId": "Riqg9zDhnsxnFrdXH", "htmlBody": "<p>I honestly don't feel I'm anywhere near competent to evaluate how good anyone is as a director of some institute.</p>", "parentCommentId": "ZbGzcSx2rKSv5BNur", "user": {"username": "Michał Zabłocki"}}, {"_id": "BEotaaPe8BfKbQWjS", "postedAt": "2023-03-06T14:41:51.769Z", "postId": "Riqg9zDhnsxnFrdXH", "htmlBody": "<p>That's a very unusual use of the word \"reused\" that would predictably mislead readers of the OP who have not read Bostrom's apology. Bostrom quoted the entire 26-year-old email as is (excluding the first and last lines with the name of the person he was replying to and his own name and email address).</p>\n", "parentCommentId": "dH4C2s7gZ95FzHFEJ", "user": {"username": "ofer"}}, {"_id": "4BfhPFsBiBc8ubaxL", "postedAt": "2023-03-06T16:29:19.821Z", "postId": "Riqg9zDhnsxnFrdXH", "htmlBody": "<p>It seems that your comment is mainly about successes &nbsp;by Bostrom in the (medium to more distant) past, while the post is about experience in the more recent past and expectations for the future. I would say that the expectations for the future are what is relevant to evaluate whether it's a good thing or not for Bostrom to step down as Director (?)</p><p>Just mentioning some examples:</p><blockquote><p>Bostrom has succeeded at this, and the group of people (especially the early FHI cast including Anders Sandberg, Eric Drexler, Andrew Snyder Beattie, Owain Evans, and Stuart Armstrong) he has assembled under the core FHI research team have made great contributions to many really important questions that I care about, and I cannot think of any other individual who would have been able to do the same</p></blockquote><p>All of the people mentioned joined a long time ago and all but Sandberg have left FHI. Is there anyone of a comparable quality that joined in the last 5 years?</p><blockquote><p>For core FHI work, like \"Eternity in Six Hours\" (one of the papers that's been most influential on my world view) I see what seems to me genuine interest in figuring out the truth and to answer the big questions, instead of secretly trying to trick me into supporting them, or get me to buy into their ideology, or support their favorite political cause or social movement, or to suspiciously shy away from a conclusion whenever that conclusion would be too hard to defend publicly to people who only want to spend 5 minutes on this question.</p></blockquote><p>The paper you mentioned was written 10 years ago. Are there any comparable more recent examples?</p><blockquote><p>I think it would be bad to let it fall in the hands of someone interested in making FHI into just another talent funnel, or another machine for producing prestige for Effective Altruism or AI Alignment or the people running FHI, while using up the credibility and intellectual integrity of Bostrom and many other core researchers who have created one of the highest integrity research institutions in the world.&nbsp;</p></blockquote><p>It's not clear to me why this is a point in favour of Bostrom rather than against: In &nbsp;the last five years (until the hiring freeze started) it seems that is roughly what FHI (minus the macro strategy group) started to become under his leadership.</p><p>&nbsp;</p><p>Overall, it looks to me that even if one agrees with all your statements about past successes and value of Bostrom as a leader of FHI, it doesn't really make a case for Bostrom staying on as FHI Director <i>now</i> . (Though I guess it still makes the case for shutting down FHI rather than having it continue under new leadership.)</p><p>EDIT: Corrected a GPI/FHI typo.</p>", "parentCommentId": "h9gdA4snagQf7bPDv", "user": {"username": "Aleks_K"}}, {"_id": "pzuboDkf5pY3rCB2S", "postedAt": "2023-03-06T17:09:22.404Z", "postId": "Riqg9zDhnsxnFrdXH", "htmlBody": "<p>Ben I don’t want to discuss this any more than you do. I’d prefer to never have to discuss it like they apparently get to do on LessWrong. However, people who think this research is discredited keep bringing it up, which repeatedly damages the epistemics of the community.</p>\n<p>Edit: I feel that my writing was very poor quality here, and apologize for that. Thanks to others for pointing out how different writing needs to be on the forum from other writing. This phrasing I used later in the discussion is a better worded version of what I was trying to say in the next paragraph: The case for how much the fallout from the apology should influence our decisions rests on the case for how justified the fallout is. If it is not justified, many of us feel  that we should find another solution instead of compromising our integrity by giving into political pressure. If the fallout is not justified, many of us believe that most of the content of this post is not very important.</p>\n<p>Original Paragraph: The author chose to devote a large majority of his post to this topic. As others have pointed out, he  overstated his case for how Bostrom’s apology negatively influences his ability cooperate with EA. I believe this could be an example of how the weakening of empistemics because people are starting to work so hard to ignore research that makes them uncomfortable  could spread to other topics.  The inaccuracy of the author's statement also makes the preserving epistemic integrity case for standing up for Bostrom (possibly via Habryka's suggestion for example) much stronger. Therefore this is highly relevant to the post.</p>\n", "parentCommentId": "Sut5Wsww69n7yppBq", "user": {"username": "SoniaAlbrecht"}}, {"_id": "Ds5qGetFS6GBPag6q", "postedAt": "2023-03-06T17:26:52.602Z", "postId": "Riqg9zDhnsxnFrdXH", "htmlBody": "<p>Rereading it, I feel like almost none of the discussion of the apology in the OP is contingent on whether the research is discredited or not. If you persuade the OP or other people on the forum that the research is not discredited, it will not solve the problems Nick faces as director.</p>\n", "parentCommentId": "pzuboDkf5pY3rCB2S", "user": {"username": "BenMillwood"}}, {"_id": "rNiDn9qYBfeAW79tw", "postedAt": "2023-03-06T17:35:41.066Z", "postId": "Riqg9zDhnsxnFrdXH", "htmlBody": "<p>GPI is a pretty clear existence proof that while collaborating with universities is difficult and costly, it can be done.</p>\n", "parentCommentId": "txN4AutyFoyxkzwTr", "user": {"username": "Peter_Hurford"}}, {"_id": "rBDcSvmPmnb2xj7g3", "postedAt": "2023-03-06T17:37:16.616Z", "postId": "Riqg9zDhnsxnFrdXH", "htmlBody": "<p>Great points.</p>\n<p>~</p>\n<blockquote>\n<p>All of the people mentioned joined a long time ago and all but Sandberg have left GPI. Is there anyone of a comparable quality that joined in the last 5 years?</p>\n</blockquote>\n<p>Just two quick nitpicks: I think you mean \"FHI\" not \"GPI\". And I think Drexler is still at FHI in addition to Sandberg. But you're right that ASB, Owain, and Stuart Armstrong have left FHI.</p>\n", "parentCommentId": "4BfhPFsBiBc8ubaxL", "user": {"username": "Peter_Hurford"}}, {"_id": "tbByEpf8GyMny2LPs", "postedAt": "2023-03-06T17:53:09.434Z", "postId": "Riqg9zDhnsxnFrdXH", "htmlBody": "<p>I think you're probably right, but that \"proof\" is too strong? FHI's research agenda seems more \"out there\", and more potentially controversial, than GPI's, in a way that could plausibly make collaboration with the current department leadership impossible for FHI even with excellent leadership, or at least impossible without making self-defeating concessions. (To be clear, I don't think this is likely to be the case.)</p>\n", "parentCommentId": "rNiDn9qYBfeAW79tw", "user": {"username": "Erich_Grunewald"}}, {"_id": "Kik9ZYLEgy8dtdXsP", "postedAt": "2023-03-06T18:02:05.226Z", "postId": "Riqg9zDhnsxnFrdXH", "htmlBody": "<p>Thanks for pointing out the FHI/GPI mistake, I've corrected that.</p><p>I also thought Drexler was still at FHI, but I checked and this doesn't seem to be the case: He's not mentioned &nbsp;on the <a href=\"https://www.fhi.ox.ac.uk/the-team/\">team page</a> and <a href=\"https://www.fhi.ox.ac.uk/team/eric-drexler/\">his website at FHI has been taken down</a>.</p>", "parentCommentId": "rBDcSvmPmnb2xj7g3", "user": {"username": "Aleks_K"}}, {"_id": "buGNmraPrpgn3haLc", "postedAt": "2023-03-06T18:03:04.253Z", "postId": "Riqg9zDhnsxnFrdXH", "htmlBody": "<p>I believe the value EA contributes relative to other social justice movements is our ability to judge research on its merits no matter how uncomfortable it makes us feel. I've never seen anything like it in the others I've been a part of. This is how we discovered that donating abroad is better at preventing death than donating locally, that AI and biosecurity were bigger risks before our views became mainstream, and a host of other topics. &nbsp;I believe losing this value would be worse than losing a relationship with Oxford University or losing funding from one donor. As the response on the forum and the author of the CEA <a href=\"https://forum.effectivealtruism.org/posts/ALzE9JixLLEexTKSq/cea-statement-on-nick-bostrom-s-email\">statement's</a> correction of their statement shows, the case for it damaging our ability to find new collaborators and funders is weak. The essential role epistemic integrity plays in our movement is the biggest reason that to me and many others the merits of the case for/against the apology email raised in this post are more important that some logistical problems it created.</p>", "parentCommentId": "Ds5qGetFS6GBPag6q", "user": {"username": "SoniaAlbrecht"}}, {"_id": "dGpWsdJay3RJMNwoD", "postedAt": "2023-03-06T18:13:41.611Z", "postId": "Riqg9zDhnsxnFrdXH", "htmlBody": "<p>He's at <a href=\"https://www.governance.ai/people\">GovAI</a>.</p>", "parentCommentId": "Kik9ZYLEgy8dtdXsP", "user": {"username": "HaydnBelfield"}}, {"_id": "C5BqjkpK5PMvbHmmt", "postedAt": "2023-03-06T18:15:32.995Z", "postId": "Riqg9zDhnsxnFrdXH", "htmlBody": "<p>While this is a data point that shows that in principle it's currently possible to currently work with the University, GPI has quite a different strategy compared to FHI that aligns significantly more with traditional academia, so it doesn't necessarily prove that it would be currently possible for FHI.&nbsp;</p><p>However, I think a stronger existence proof for it being possible to work with the University is that FHI managed to do that in some way reasonably for at least 10+ years. (They were established in 2005) - for comparison, GPI is only 5 years old.&nbsp;</p>", "parentCommentId": "rNiDn9qYBfeAW79tw", "user": {"username": "Aleks_K"}}, {"_id": "dw5TCh7HcDdcL8pdq", "postedAt": "2023-03-06T18:15:44.415Z", "postId": "Riqg9zDhnsxnFrdXH", "htmlBody": "<p>Yeah I was definitely using the word \"proof\" colloquially and not literally. My understanding from inside info though is that FHI's issues with Oxford have very little to do with their choice of research agenda. I think this is also clear from outside info (FHI had a similar research agenda for a long time and had university support).</p>\n", "parentCommentId": "tbByEpf8GyMny2LPs", "user": {"username": "Peter_Hurford"}}, {"_id": "2AfhqZZQpSDFMFK6v", "postedAt": "2023-03-06T18:16:17.513Z", "postId": "Riqg9zDhnsxnFrdXH", "htmlBody": "<p>Thanks - that's a good point.</p>\n", "parentCommentId": "C5BqjkpK5PMvbHmmt", "user": {"username": "Peter_Hurford"}}, {"_id": "nsaFxFabBbGjnv5k4", "postedAt": "2023-03-06T18:17:58.125Z", "postId": "Riqg9zDhnsxnFrdXH", "htmlBody": "<p>As an affiliate, though, not as an employee. (And they seem to have <i>lots of </i>affiliates, so not clear what this actually means.)</p>", "parentCommentId": "dGpWsdJay3RJMNwoD", "user": {"username": "Aleks_K"}}, {"_id": "6gcqRjCdK3znZDLzK", "postedAt": "2023-03-06T18:23:58.559Z", "postId": "Riqg9zDhnsxnFrdXH", "htmlBody": "<p>He listed GovAI on this (very good!) post too: <a href=\"https://www.lesswrong.com/posts/5hApNw5f7uG8RXxGS/the-open-agency-model\">https://www.lesswrong.com/posts/5hApNw5f7uG8RXxGS/the-open-agency-model</a></p><p>Yeah dunno exactly what the nature of his relationship/link</p>", "parentCommentId": "nsaFxFabBbGjnv5k4", "user": {"username": "HaydnBelfield"}}, {"_id": "tEAN2oRoFpFbytDmb", "postedAt": "2023-03-06T18:42:54.738Z", "postId": "Riqg9zDhnsxnFrdXH", "htmlBody": "<p>As I mentioned earlier, I don't have an opinion on whether Bostrom should step down or not, only that the apology is not a good reason to step down. If you are right that the reasons outside the apology are good enough, I would support that. However, at this point I would also need a statement from an EA organization that he would not be stepping down because of the apology.&nbsp;</p>", "parentCommentId": "Sut5Wsww69n7yppBq", "user": {"username": "SoniaAlbrecht"}}, {"_id": "6JkDmNfExrHyQWays", "postedAt": "2023-03-06T20:22:19.341Z", "postId": "Riqg9zDhnsxnFrdXH", "htmlBody": "<p>FWIW, this sounds pretty wrongheaded to me: anonymization protects OP from more distant (mis)judgment while their entourage is aware of them having posted this. That seems like fair game to me and not at all as you're implying.&nbsp;</p><p>We didn't evolve to operate at these scales, so this appears like a good solution.</p>", "parentCommentId": "XBWHyd2wCN2AxhzoK", "user": {"username": "konrad"}}, {"_id": "TRnu5wMyqCMRbY49B", "postedAt": "2023-03-06T20:52:48.542Z", "postId": "Riqg9zDhnsxnFrdXH", "htmlBody": "<p>I feel like you and Ben are talking past each other; you claim that, like Ben, you don't want to discuss this. Yet you don't respond to Bill's comment about how the problems Nick faces are not contingent on whether the research is discredited. Your point about the value EA contributes is also irrelevant, unless you're making a claim here that Bostrom is providing this value and that this value is stronger than the value of his counterfactual replacement.</p>", "parentCommentId": "buGNmraPrpgn3haLc", "user": {"username": "pseudonym"}}, {"_id": "tZ7cBKiNtWrdBJH4h", "postedAt": "2023-03-06T20:54:46.834Z", "postId": "Riqg9zDhnsxnFrdXH", "htmlBody": "<p>That's a fair point. The meta-analysis study is <a href=\"https://www.researchgate.net/publication/289963618_Adoption_and_Cognitive_Development_A_Meta-Analytic_Comparison_of_Adopted_and_Nonadopted_Children%27s_IQ_and_School_Performance\">here</a>. It find difference in d of 1.17 between IQ scores of &nbsp;adopted and non-adopted children. d means standard deviations, corresponding to 15 IQ points, giving a total of 18 IQ point change in the traditional sense. It was linked in the <a href=\"https://www.vox.com/the-big-idea/2017/5/18/15655638/charles-murray-race-iq-sam-harris-science-free-speech\">original article</a>, the one i linked is a follow-up which I thought was pretty good.&nbsp;</p>", "parentCommentId": "esSPijwhwhXnkSqTD", "user": {"username": "titotal"}}, {"_id": "DYkHgnzehmBFuvzCt", "postedAt": "2023-03-06T20:59:19.672Z", "postId": "Riqg9zDhnsxnFrdXH", "htmlBody": "<p>That's mentioning the term, not <a href=\"https://en.wikipedia.org/wiki/Use%E2%80%93mention_distinction\">using </a>it.</p>", "parentCommentId": "dH4C2s7gZ95FzHFEJ", "user": {"username": "temp_"}}, {"_id": "kveHPDX3ZsYFwtsGv", "postedAt": "2023-03-06T21:06:22.562Z", "postId": "Riqg9zDhnsxnFrdXH", "htmlBody": "<p>I think it's pretty outrageous to suggest that the OP is allowed to make this argument in the post, by calling it 'discredited' and a 'disqualifying views', but commenters are not allowed to object. If you want to criticize someone for bringing an irrelevant issue into it, you should direct your ire at the OP.</p>", "parentCommentId": "Sut5Wsww69n7yppBq", "user": {"username": "temp_"}}, {"_id": "Pi5mpiokBS6fdRF7h", "postedAt": "2023-03-06T21:11:54.725Z", "postId": "Riqg9zDhnsxnFrdXH", "htmlBody": "<p>No, saying that we should do X rather than Y does not mean you disrespect Y. It could just be you respect X even more, or disagree \"respect\" is the right framing, or think that X is required for Y.</p><p>In any case I think Cinera's <a href=\"https://forum.effectivealtruism.org/posts/NniTsDNQQo58hnxkr/my-thoughts-on-bostrom-s-apology-for-an-old-email\">argument </a>that Bostrom's behavior was actually a positive update is somewhat credible.</p>", "parentCommentId": "ngctwY7ZMYqoaaFSu", "user": {"username": "temp_"}}, {"_id": "7BTJPMSkYFu6rdm5h", "postedAt": "2023-03-06T22:59:51.166Z", "postId": "Riqg9zDhnsxnFrdXH", "htmlBody": "<p>Yes I agree we are talking past each other, and tried to clarify that in a comment that seems to have gotten overlooked because it wasn't upvoted. I am not arguing with people like Ben who believe he should go regardless of the apology and the logistical challenges it may have caused. Bostrom may deserve to go for all I know. As I mentioned in my original comment, I have no opinion about it overall. I am only arguing that the apology and fallout from it are not a good reason to think he should go. I am not trying to distract from the non-apology discourse. I intended my original comment to be a small addition to much more important points others are making.</p><p>&nbsp;Many people (such as the author) feel the apology and fallout are a good reason or even the best reason for him to go , so my point is worth making. The author himself said he believed the views expressed in the apology such as the one I am addressing are \"disqualifying views for someone in his position as Director.\" (regardless of the fallout) .</p><p>Even if someone were just as suited as Bostrom, the act of dismissing him based on the fallout from the apology would be a violation of our epistemic standards. Therefore he is better than a hypothetical identical counterfactual on this issue.</p><p>If Bostrom stepped down for unrelated reasons, I am arguing that people should expect a statement from officials in the community that it wasn't because of pressure due to the apology.&nbsp;</p><p>I'm not sure who Bill is, but my entire intention with the comment you are responding to was to address the argument you mention him making. I believe the case that the fallout &nbsp;should influence our decisions rests on the case that the fallout is justified. If it is not, we should find another solution instead of compromising our integrity.</p>", "parentCommentId": "TRnu5wMyqCMRbY49B", "user": {"username": "SoniaAlbrecht"}}, {"_id": "kP9b4qqXazjjhzgoA", "postedAt": "2023-03-06T23:28:14.962Z", "postId": "Riqg9zDhnsxnFrdXH", "htmlBody": "<p>The OP's post includes the statement \"But the Apology had a glib tone, reused the original racial slur, seemed to indicate he was still open to discredited ‘race science’ hypotheses, and had an irrelevant digression on eugenics. I personally think these are disqualifying views for someone in his position as Director. \" The other points he raised are more important, but he stated he believes that the apology is grounds for dismissal in and of itself regardless of the rest of the points he makes.&nbsp;</p>", "parentCommentId": "itTisLCnPPyDiBAAd", "user": {"username": "SoniaAlbrecht"}}, {"_id": "fmuSLYmkFcftg4k9d", "postedAt": "2023-03-07T00:29:00.958Z", "postId": "Riqg9zDhnsxnFrdXH", "htmlBody": "<p>The other sense in which the OP is relitigating the apology is that for many of us (likely including the OP), the case for how much the fallout from the apology should influence our decisions rests on the case for how justified the fallout is. If it is not justified, many of us feel &nbsp;that we should find another solution instead of compromising our integrity by giving into political pressure. If the fallout is not justified, many of us believe that most of the content of this post is not very important.</p>", "parentCommentId": "itTisLCnPPyDiBAAd", "user": {"username": "SoniaAlbrecht"}}, {"_id": "ndEFidDc9dkfMzYow", "postedAt": "2023-03-07T03:22:20.184Z", "postId": "Riqg9zDhnsxnFrdXH", "htmlBody": "<blockquote><p><i>This post is anonymised to avoid interpersonal drama, not because I’m worried about any career blowback.</i></p></blockquote><p>&nbsp;</p><p>Can you clarify what you mean by \"interpersonal drama\" here?&nbsp;</p>", "parentCommentId": null, "user": {"username": "Elizabeth"}}, {"_id": "FRKwZeRaCFsYniDBu", "postedAt": "2023-03-07T19:40:20.957Z", "postId": "Riqg9zDhnsxnFrdXH", "htmlBody": "<p>I worked at FHI as a research scholar from 2018-2020. At that time I didn't hear anyone saying that Bostrom should step down (and I definitely didn't think he should).&nbsp;<br><br>To be clear, it has been obvious to everyone that FHI has had severe operations/logistical issues. However, it's much less clear if or how FHI would function without Nick Bostrom.&nbsp;<br><br>I'm pretty nervous about rumors in situations like this.<br><br>If I were in charge of making any decision here, I'd send out surveys and have a bunch of conversations.&nbsp;</p>", "parentCommentId": "rw29rEvviF84mSjvL", "user": {"username": "oagr"}}, {"_id": "wNQhT92DX8eqJzySs", "postedAt": "2023-03-08T17:40:01.600Z", "postId": "Riqg9zDhnsxnFrdXH", "htmlBody": "<p>Commenters are fine to object, but to the extent they rely on the question of whether the science is actually discredited or not, I think they should link to an existing discussion of it rather than duplicating it here. The duplication just damages all of:</p>\n<ul>\n<li>the discussion of the issue here, to the extent it misses things that previous discussions have covered,</li>\n<li>the discussions that we'd otherwise have linked to, to the extent that people spend effort improving this one rather than that one,</li>\n<li>any <em>other</em> discussion here, which becomes more difficult to navigate for being mixed in with it.</li>\n</ul>\n<p>I'm not trying to prevent discussion, I'm just trying to move and consolidate it.</p>\n<p>(But in practice it hasn't been as dominating here as I'd feared, so I'm not going to bang too hard on this drum.)</p>\n", "parentCommentId": "kveHPDX3ZsYFwtsGv", "user": {"username": "BenMillwood"}}, {"_id": "oaz5dhctGiPYkMnRx", "postedAt": "2023-03-08T22:07:11.719Z", "postId": "Riqg9zDhnsxnFrdXH", "htmlBody": "<p>I would also prefer a world that adds to &nbsp;the previous discussion instead of reinventing the wheel here, but in practice I don't think people would pay as much attention if we merely linked to that thread. To me the &nbsp;case for how much the fallout from the apology matters rests on how justified the fallout is, so I believe the merits of the case against the apology deserve the space they are getting in this thread. Thanks for clarifying more what you meant.&nbsp;</p>", "parentCommentId": "wNQhT92DX8eqJzySs", "user": {"username": "SoniaAlbrecht"}}, {"_id": "ijqiLyS324Xdp3fc3", "postedAt": "2023-03-09T21:02:10.114Z", "postId": "Riqg9zDhnsxnFrdXH", "htmlBody": "<p>I don't want to yell at someone for something they didn't mean, but this question hasn't been answered and I can't come up with an explanation for \"avoiding personal drama\" that feels noble. &nbsp;I guess it's good OP was truthful that it was drama aka people reacting to their opinions, rather than unfair retribution.&nbsp;</p>", "parentCommentId": "ndEFidDc9dkfMzYow", "user": {"username": "Elizabeth"}}, {"_id": "Z6peA82HkZi8RaY4C", "postedAt": "2023-03-09T21:05:07.576Z", "postId": "Riqg9zDhnsxnFrdXH", "htmlBody": "<p>I don't see anything to suggest OP has told people they know personally this opinion, can you share what you're basing that on?</p>", "parentCommentId": "6JkDmNfExrHyQWays", "user": {"username": "Elizabeth"}}, {"_id": "7h7EY9SKohRJCDukj", "postedAt": "2023-03-09T22:35:47.722Z", "postId": "Riqg9zDhnsxnFrdXH", "htmlBody": "<p>If Bostrom is not entitled to protection from random people on the forum making judgments about him, why should it be any different for OP?</p>", "parentCommentId": "6JkDmNfExrHyQWays", "user": {"username": "Xavier_ORourke"}}, {"_id": "7FwvYXhpZ8Jy3rBaZ", "postedAt": "2023-03-11T10:49:50.778Z", "postId": "Riqg9zDhnsxnFrdXH", "htmlBody": "<p>I didn't say Duncan can't judge OP. I'm questioning the judgment.</p>\n", "parentCommentId": "7h7EY9SKohRJCDukj", "user": {"username": "konrad"}}, {"_id": "Ps66GpTrNr9tEqMGs", "postedAt": "2023-03-11T11:13:25.020Z", "postId": "Riqg9zDhnsxnFrdXH", "htmlBody": "<p>Sorry I might not have made my point clearly enough. By remaining anonymous, the OP <em>has</em> shielded themselves from any public judgement or reputational damage. Seems hypocritical to me given the post they wrote is deliberately designed to bring about public judgement and affect the reputation of Nick Bostrom.</p>\n<p>So I'm saying \"if OP thinks it's okay to make a post which names Nick and invites us all to make judgements about him, they should also have the guts to name themselves\"</p>\n", "parentCommentId": "7FwvYXhpZ8Jy3rBaZ", "user": {"username": "Xavier_ORourke"}}, {"_id": "Hfc8yGrrSYrYztmnL", "postedAt": "2023-05-31T12:33:21.628Z", "postId": "Riqg9zDhnsxnFrdXH", "htmlBody": "<p>In the very useful and interesting comments before this one, there is much discussion of administrative issues and other specific matters which relate to the success or otherwise of the FHI. I offer no view on any of that. Instead, I wish to say that Bostrom, and by extension the FHI, has been far more seriously damaged by both his 1996 comments and his 2023 apology than some of the comments here disagreeing with the view of the OP recognise. As an adult and a scholar well into his 20s, Bostrum \"liked\" and thought true the sentence; \"blacks are more stupid than whites\". It is not possible to deconstruct these words in a way which makes them publicly benign. His apology this year contains disastrous caveats which reflect ambiguity on his part on matters of race and IQ, and even eugenics. The fact that some commenters here have sought (genuinely benignly) to contextualise his ambiguity by referring to authors such as Rindermann and Snyderman illustrates the thin-ness of the ice around the hole Bostrom has fallen (or hurled himself) into. Like some other commenters, I dislike the seemingly ubiquitous \"discredited\" epithet often used to refer to science which is potentially unpalatable to the wider public. It is also true that geneticists, for example, invariably finesse the word \"eugenics\" to refer only to pre-war atrocities in order to protect their present work from harm; it is of course perfectly legitimate to consider some lines of contemporary genetics research as essentially eugenic in nature (see Agar, for example). I imagine this is Bostrum's view, too. But the simple fact is that all serious scientists understand the need to be extraordinarily careful around issues of race and biology; those who chose to focus on or even be ambiguous about that area, like Rindermann and Snyderman, and indeed their associate Richard Lynn, are usually very open about the highly controversial nature of their personal opinions and choose a marginalised academic life. Bostrum's foray into these areas in his apology, along with the absurdly ill-advised opening sentences, conveyed the strong impression both that he did not feel the need to make a heartfelt apology and that he thought he could deal with the story by making a reluctant sort-of-apology. These would be serious offences for any senior scholar, but Bostrom trades in large part on his understanding of the future needs of humanity. If his understanding of humanity is suspected by people to contain a hint of what most people would consider racism, then his thinking cannot be applied to anything. Since he regards himself as an applied thinker, his work is therefore potentially over. I appreciate that some commenters here might consider that an overstatement, and of course it may turn out to be. But a glance at the US context will reveal, I think, that no-one beyond over enthusiastic tech titans will touch Bostrom with a bargepole now. There can be no doubt that he will have to step down as FHI leader, and he will continue to harm FHI if he remains there at all. He will, indeed, continue to harm Oxford if he remains a tenured professor; and so I think he will likely have to resign from that too. He might have recourse to a new appointment elsewhere in a few years, but that would require a great deal of work on his part which I am far from convinced he is psychologically capable of. The OP is therefore, &nbsp;in my opinion, absolutely right. The FHI is in trouble and Bostrom's association with it now could feasibly sink it in its current form.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Richard Braden"}}, {"_id": "cDEkc83BtCtZTAKRY", "postedAt": "2023-06-07T20:35:55.948Z", "postId": "Riqg9zDhnsxnFrdXH", "htmlBody": "<p>The more important metric to me will be if it is possible to do highly (preferably positively) impactful work while collaborating with universities, which I've seen positive evidence from individual professors/labs but not for larger groups.&nbsp;</p>", "parentCommentId": "rNiDn9qYBfeAW79tw", "user": {"username": "Linch"}}, {"_id": "uzxiuA7fvNbuat4ES", "postedAt": "2023-03-07T03:25:44.920Z", "postId": "Riqg9zDhnsxnFrdXH", "htmlBody": null, "parentCommentId": null, "user": null}]