[{"_id": "MoGfDguQm5pqt2zmC", "postedAt": "2023-10-20T09:13:43.609Z", "postId": "Rj7rhrFQL7opwug2g", "htmlBody": "<p>I am extremely pro alternative proteins (see e.g.&nbsp;<a href=\"https://forum.effectivealtruism.org/posts/iukeBPYNhKcddfFki/price-taste-and-convenience-competitive-plant-based-meat?commentId=FZfpbs3YfdFYmaRaq\"><u>here</u></a>) but I think we still need to be more honest about the climate impacts of agriculture, both in terms of epistemic hygiene but also in terms of argumentative strategy (I don’t think we need to exaggerate the case for APs – the case is good already! – and by exaggerating some claims we are making the whole thing less believable).</p><p>In the beginning of the interview it is discussed as a huge, huge contributor to climate change, a major driver, without presenting any numbers.</p><p>The exact numbers would depend on the choice of global warming potential (essentially: what timeframe of warming impact to care about?), I discuss this in a bit more detail&nbsp;<a href=\"https://www.youtube.com/watch?v=SM75PMFReTo&amp;t=801s\"><u>here</u></a>, but on typical metrics the impact of animal agriculture would be something like ~15%, see e.g. here&nbsp;<a href=\"https://ourworldindata.org/ghg-emissions-by-sector\"><u>from OWID</u></a>; there’s arguments for both more&nbsp;<a href=\"https://www.nature.com/articles/s41893-020-00603-4\"><u>optimistic</u></a> and more pessimistic (caring less about short-term warming than the underlying OWID data) numbers, but I think 15% seems pretty okay as a prior before weighing them all in detail:<br><br><img src=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/MoGfDguQm5pqt2zmC/lgwd4zj9bmacddqhgwpa\"></p><p>This is quite significant but if I listen to the interview and to similar messaging I would be surprised it is “only” 15%. I think it would be more honest and more robust if we said something like “alternative proteins are a promising strategy for an otherwise hard-to-decarbonize sector” (which is very exciting, few hard-to-decarbonize sectors have such promising technological solutions!) but not to suggest that it is anywhere close to the importance of transforming our energy system (~75/15 - a 5x difference).&nbsp;</p>", "parentCommentId": null, "user": {"username": "jackva"}}]