[{"_id": "YzcJsaLLdKEDzkCLn", "postedAt": "2023-11-03T10:22:56.542Z", "postId": "RJgGP6tEeuvtbapjP", "htmlBody": "<p>I don’t have such a great sense of what actually goes on at an EAGx Virtual. Can you describe what the experience of an attendee is?</p>\n", "parentCommentId": null, "user": {"username": "Saul"}}, {"_id": "EzGBzDtJTeW8jDhih", "postedAt": "2023-11-03T10:43:27.709Z", "postId": "RJgGP6tEeuvtbapjP", "htmlBody": "<p>Hey Saul!&nbsp;<br><br>I'll do my best, but there's a lot of variation in how people spend their time.<br><br>I think the main activities are:</p><ul><li>Watching a talk live on Swapcard (some will be interactive workshops, so perhaps engaging with those)</li><li>Going to a 1–1 meeting with someone you can get advice from or who you can give advice to (or even just catching up with a friend). You can book these via Swapcard too.</li><li>Wandering around Gathertown and joining casual group conversations (a great way to meet new people you otherwise wouldn't).</li><li>Attending a meet-up or social event (some will be in the schedule, some might be spontaneous, in Gathertown).</li></ul><p>How you split your time is up to you, but I'd recommend trying all of them if you're new! I also recommend taking breaks away from the screen too :)</p><p>Sasha and Dion, feel free to add your own takes!&nbsp;</p>", "parentCommentId": "YzcJsaLLdKEDzkCLn", "user": {"username": "OllieBase"}}, {"_id": "abbXj8gLgnu7t8C3w", "postedAt": "2023-11-04T14:16:21.223Z", "postId": "RJgGP6tEeuvtbapjP", "htmlBody": "<p>As someone who is trying to organize a local EAGx Virtual \"co-attending\" session, I would be curious to hear any tips on how to emulate the in-person conference experience as much as possible.&nbsp;</p><p>Currently, we have two rooms booked at my university, with the idea of one being used for livestreaming events/group activities and the other for 1:1's / individual reflection etc. Having a shared time for lunch and some preplanned group activities seems important, as well as helping keep track of what events are happening, and allowing for in-person 1:1's.&nbsp;</p><p>With that in mind, what things would you prioritize in making the experience as close to an in-person conference?</p>", "parentCommentId": null, "user": {"username": "MichaelRipa"}}, {"_id": "AAsQw6ak7MjeFdhyD", "postedAt": "2023-11-06T03:11:35.447Z", "postId": "RJgGP6tEeuvtbapjP", "htmlBody": "<p>Hi Michael,</p><p>Here are some quick thoughts:</p><ul><li>Make sure to block some time for attendees to reflect on their conference goals &amp; planning. We are hosting a workshop on Friday to encourage this type of reflection (\"First-timers at EAGx\", at 3 pm UTC). You can also use <a href=\"https://docs.google.com/document/d/1ZU0wZG9yGe5Wr3BEfoJpsvTUaJ_Xjr8fmKPBw5e8tOE/edit\">our planning worksheet</a>.</li><li>Group activities like watching talks together, in-person 1-1s, and shared lunch seem like good ideas!</li><li>It is better if space for 1-1s isn't packed very tight. It can be distracting when lots of people speaking around. And if two people are attending the same meetup or office hours they will hear each other speaking both in their headphones and in the room.</li></ul><p>We've already heard about multiple groups from different countries planning such co-attending sessions, it's exciting! I think it's especially valuable in regions with a lack of reliable infrastructure (e.g. where home internet is not reliable but it's possible to book a room at a local university or coworking with fiber internet).</p>", "parentCommentId": "abbXj8gLgnu7t8C3w", "user": {"username": "Alex_Berezhnoy"}}]