[{"_id": "f75zDngiuSLbCYDrM", "postedAt": "2024-02-15T06:03:00.173Z", "postId": "RjPGfb2Sg5MeDxvfA", "htmlBody": "<p>Not sure where it's best to leave this comment, but<strong> I might want to caution a bit against leaning too heavily on \"what do you like best in high school\" as a guide to what to study/work on</strong>. I read your excellent engineering profile on your website and recognized myself having used my passion and abilities in high school physics to guide me to mechanical engineering. However, I really enjoy both software engineering as well as data analysis, and have some evidence I do well in these, if not better than in mechanical engineering.</p><p>The problem was that I was never exposed to software engineering or data analysis/science in high school so I did not know my passion or skill level in these disciplines. I do not know how to solve this problem of not getting exposed to all fields in high school, or even university. I love the <a href=\"https://en.wikipedia.org/wiki/Liberal_arts_college\">US liberal arts</a> education where you are forced to try other disciplines and worry that students in Europe/non-liberal-arts-institutions might only at a very late stage in their life, or not at all, realize there was something they love even more and do better in, but that they were never exposed to. I did see that you mentioned in your profile that certain universities have \"discipline agnostic\" first years in engineering - but I think perhaps there is a case to be made that those that do not naturally get exposed to all fields, have a hard think about whether they might actually be a better fit for something they have not yet tried.</p>", "parentCommentId": null, "user": {"username": "Ulrik Horn"}}, {"_id": "ffPz2xWHn5fzn26po", "postedAt": "2024-02-15T12:21:43.971Z", "postId": "RjPGfb2Sg5MeDxvfA", "htmlBody": "<p>Totally agree! Indeed, there's a <a href=\"https://80000hours.org/articles/dont-follow-your-passion/\">classic 80k article </a>about this.<br><br>When working out your next steps, we tend to recommend working forwards from what you know, and working backwards from where you might want to end up (see our <a href=\"https://80000hours.org/career-planning/process/determine-next-steps/\">article on finding your next career steps</a>). We also think people should explore more with their careers (see our <a href=\"https://80000hours.org/articles/career-exploration/\">article on career exploration</a>).</p><p>If there are areas where we're giving the opposite message, I'd love to know – shoot me an email or DM?</p>", "parentCommentId": "f75zDngiuSLbCYDrM", "user": {"username": "Benjamin Hilton"}}]