[{"_id": "vYmSa53J89dNJd467", "postedAt": "2018-02-02T22:33:14.889Z", "postId": "RM77XJj3xGLXZk2es", "htmlBody": "<p>&quot;What is the best way to get more people to act upon the principles of effective altruism?&quot; - I'd suggest looking at what the bottleneck is. Are you getting lots of people coming to your meetups and then not coming back or is it mostly just the regular with very few new members? Importantly, if a group has a low retention rate, they probably don't want to scale reach as they'd just burning through people who might have become members if they'd been better placed to capture them. Anyway, from what I've heard mass media outreach doesn't really seem to have been effective for EA groups and that matches what I've seen in Australia too where I haven't heard of a single person who first heard of Effective Altruism through mass media, while in contrast, I've met several who heard of us through more niche channels like podcasts.</p>\n<p>Anyway, I'm hugely in favour of EA Sweden exploring politics as it really does seem to be a comparative advantage for the reasons given. EA is much more likely to be able to influence politics in smaller countries where you have more chance of getting a meeting with important people and there are a lot of advantages of exploring working in politics when any fallout might be contained.</p>\n", "parentCommentId": null, "user": {"username": "casebash"}}, {"_id": "uJADKtj3BobfmQshd", "postedAt": "2018-02-05T13:35:37.250Z", "postId": "RM77XJj3xGLXZk2es", "htmlBody": "<p>Thanks for the input!</p>\n<p>Yeah, looking at where the drop-off is seems like a very good idea. Unfortunately, we haven't had data on this historically and can only go off anecdotal data. Given those anecdotes we've reached the conclusion that more effort should be put on the latter parts of the sales funnel. </p>\n<p>Regarding mass media my impression is the same. However, I think that it is likely useful to put some effort into it, e.g. since it adds credibility to the organisation. </p>\n<p>Going forward, we'll have data on who comes to what events, data from membership forms and will hopefully be able to connect that to end-line results, e.g. career changes and donations. </p>\n", "parentCommentId": "vYmSa53J89dNJd467", "user": {"username": "MarkusAnderljung"}}, {"_id": "pfdfu9i9soNm8veqA", "postedAt": "2018-02-05T14:41:17.765Z", "postId": "RM77XJj3xGLXZk2es", "htmlBody": "<p>I think you might've meant Olle Häggström as opposed to Göran Hägglund ;)</p>\n", "parentCommentId": null, "user": {"username": "JonathanSalter"}}, {"_id": "wSXua645oQduG7v7w", "postedAt": "2018-02-06T12:50:18.635Z", "postId": "RM77XJj3xGLXZk2es", "htmlBody": "<p>Thanks for the keen eye, Jonathan! Corrected now.</p>\n", "parentCommentId": "pfdfu9i9soNm8veqA", "user": {"username": "MarkusAnderljung"}}, {"_id": "dMkRRomH78pAwSbqq", "postedAt": "2018-02-10T13:07:51.810Z", "postId": "RM77XJj3xGLXZk2es", "htmlBody": "<p>Thanks for the post!\nI’ve two questions:</p>\n<ol>\n<li><p>Have you been concerned with how having one paid member of your Org could affect the volunteerism of the rest of the members? E.g. that there will arise a hierarchy which will keep “regular” members from taking on certain type of projects or feel as if they have less of a say in various decisions.</p>\n</li>\n<li><p>Could you elaborate on the metrics you intend to use? E.g. by “the funnel of 80k” do you then mean their significant plan changes or how many of your members receive personal coaching from them? Also, how do you track the donations made to GWWC/EA Funds?</p>\n</li>\n</ol>\n", "parentCommentId": null, "user": {"username": "SebastianSchmidt"}}, {"_id": "Fu7Tcg6mAyCmmiPzS", "postedAt": "2018-02-12T10:16:05.339Z", "postId": "RM77XJj3xGLXZk2es", "htmlBody": "<p>Thanks, Sebastian!</p>\n<ol>\n<li><p>I think this might be a risk. Especially in a Scandinavian context where consensus decisions are really important. It also seems really important to me to avoid risks of feelings of resentment. My hunch is that this is mainly avoided by transparency and honesty, regarding e.g. where the money is coming from and what it's for. However, I think that effect is outweighed by other effects. I’ve seen people’s engagement in doing stuff for EAS go up since I started working full-time, partly since that means I can spend more time and energy into being a leader,  encouraging and helping people to become usefully involved. However, with all of these things, people who have done this sort of thing for longer will likely know better. </p>\n</li>\n<li><p>We intend to use IASPC, but also figures regarding number of coachings, referrals etc. Regarding donations, the idea is to get data on how many swedish donations go through EA Funds. In addition to this, we will likely collect our own data on impact as well through a survey. </p>\n</li>\n</ol>\n", "parentCommentId": "dMkRRomH78pAwSbqq", "user": {"username": "MarkusAnderljung"}}, {"_id": "CA8suiNo55oAYRimP", "postedAt": "2019-12-13T09:54:52.845Z", "postId": "RM77XJj3xGLXZk2es", "htmlBody": "<html><head></head><body><p>Hey! Curious if you know if there is anyone actively working on EA Fact Check or something like it</p>\n</body></html>", "parentCommentId": null, "user": {"username": "edoarad"}}]