[{"_id": "xfGX9fZa5i4Ka2xy6", "postedAt": "2017-11-18T12:13:35.448Z", "postId": "RmM54frMt9SGuvgwc", "htmlBody": "<p>I am excited about this! I have some technical questions, but I'll save them until I've read part II.</p>\n", "parentCommentId": null, "user": {"username": "Michael_PJ"}}, {"_id": "E43eZnH6HSunudtun", "postedAt": "2018-01-02T15:59:10.072Z", "postId": "RmM54frMt9SGuvgwc", "htmlBody": "<p>This is an interesting project! I am wondering how valuable you have found it, and whether there are any plans for further development. I can imagine that it would be valuable to</p>\n<ul>\n<li>Increase complexity to increase robustness of the model, but then find some balance between robustness and user-friendliness, perhaps by allowing users to view the model on different 'levels' of complexity.</li>\n<li>Use some form of crowd-sourcing to get much more reliable estimates, ideally weighted by expertise or forecasting ability.</li>\n<li>Incorporate some insights from the moral uncertainty literature, so that low probability of something being very bad (e.g. wild animal suffering, or insect suffering) are given appropriate weight.</li>\n</ul>\n<p>However, I have no idea how feasible this is, and imagine it would require many and valuable resources (lots of time, money, and capable researchers). Do you already have thoughts on this?</p>\n<p>P.S. The link is missing for part IV</p>\n", "parentCommentId": null, "user": {"username": "SiebeRozendal"}}, {"_id": "W6MH5MZZZrsPyMW89", "postedAt": "2018-02-09T00:55:44.810Z", "postId": "RmM54frMt9SGuvgwc", "htmlBody": "<p>Thank you for your comment. I agree our model is only a very basic version and it would be interesting to see it developed further. (Though there are currently no further plans for development that I know of.)</p>\n<p>This model was created in about 14 wks of FTEs. I expect a project like you're proposing to take much longer.</p>\n", "parentCommentId": "E43eZnH6HSunudtun", "user": {"username": "Denise_Melchin"}}]