[{"_id": "eNmqPQ8yDa4csJDtx", "postedAt": "2023-11-29T12:24:02.676Z", "postId": "Rp3XxPKKG9PKsgyCm", "htmlBody": "<p>Plugging this into EAometer....</p><p>We can propose a project to \"direct charitable donations to popular but low-impact causes to the charities with the highest impact within each low-impact cause\"</p><p>We can score this project on importance, tractability, and neglectdness to help decide if it's worth working on.</p><p>Importance: Probably a 3/10 as this project is directed at low-impact causes. But the causes may be fairly important as lots of people care about them/are impacted by them enough to donate.&nbsp;</p><p>Tractability: I think 5/10. Charities like Cancer Research and WWF have monopolies over giving to these causes, and dominate advertising. So I'm not sure how we could peel people away from that. But the fact that lots of people donate to these causes would probably make it easier to get donations to grant funds on these cause areas - but maybe they wont attract the type of people who give through GWWC/EA.</p><p>Neglectedness: Not sure, I'd have to do some research. But I would guess it's low because these are popular causes, so they would be very busy with researchers to trying to increase impact.&nbsp;</p><p>So to conclude, I would say it would be hard to implement this project and compete in such busy and giant cause areas that invest a lot of money in advertising. The change in impact is most likely not as great as just directing people to more effective cause areas. Popular cause areas are so over crowded that probably everything gets funded anyway.&nbsp;</p>", "parentCommentId": null, "user": {"username": "JordanStone"}}, {"_id": "vbrf5BLzcGfbJbCve", "postedAt": "2023-11-29T19:11:37.181Z", "postId": "Rp3XxPKKG9PKsgyCm", "htmlBody": "<p>I agree - though not so much on everything gets funded anyway point.</p><p>I think there is also a wider meta question which is what is the best use of EA's marginal time/energy/money. My (highly unjustified) judgement would be that people donating for such causes aren't motivated by effectiveness, or at least are motivated much more by emotion. So the likelihood of changing their donation based on an argument around effectiveness may be quite hard to achieve.</p><p>I'm also not sure on the scale of difference between the worst and best charities for such causes (i.e. is the best cancer charity 100x better than the worst)? It'd be great to know, but assuming not, this would also reduce the benefit of any success.</p><p>A more effective solution achieve the same goal by proxy <i>would seem to be</i> just influencing the existing major funds or initiatives to focus more on the marginal impact of every £ they receive.</p>", "parentCommentId": "eNmqPQ8yDa4csJDtx", "user": {"username": "JamesN"}}, {"_id": "967LrZdSdJ3Z9dquJ", "postedAt": "2023-11-30T10:40:55.990Z", "postId": "Rp3XxPKKG9PKsgyCm", "htmlBody": "<p>I think it's a minority opinion in EA but I also think it would be worth it for EAs to produce lists of the cost-effective charities/interventions within causes that EAs don't prioritize overall, recognizing that some people may care about effectiveness but will be emotionally attached to certain cause areas, or (as you say) will be motivated more by selfish reasons or by a narrower altruistic concern for their loved ones. This might be an especially good idea for people who have expertize in that area.<br><br>When <a href=\"https://forum.effectivealtruism.org/posts/JiEyCNoGD3WwTgDkG/eas-should-recommend-cost-effective-interventions-in-more\">I posted about this</a>, people pointed out that <a href=\"https://sogive.org/#home\">SoGive</a> does a bit of this (for misc causes, maybe not for things like cancer specifically).&nbsp;</p>", "parentCommentId": null, "user": {"username": "Amber"}}]