[{"_id": "yw2kHvgdznEZoMJ9B", "postedAt": "2015-01-26T18:12:05.383Z", "postId": "RPJhCLWEizLYXzyGd", "htmlBody": "<p>I've long admired Charity Science's dedication.  Not only have they moved enough money to GiveWell to get a 900% return on investment, but they've learned a lot that will move the whole EA community forward.  I can't wait to see what they come up with in 2015!</p>\n", "parentCommentId": null, "user": {"username": "Peter_Hurford"}}, {"_id": "4ETQyzCT2w5Sj7tj3", "postedAt": "2015-01-26T19:11:03.643Z", "postId": "RPJhCLWEizLYXzyGd", "htmlBody": "<p>Thanks Tom, you guys have done a lot on a very low budget and I'm keen to hear about what you do next. I think the value of information about different approaches makes the project very worthwhile.</p>\n<p>One issue which I have with your $9-to-$1 figure is that your costs seem artificially low: you are not paying market rates for your employees' labour. I think this is true either in the sense of how much you would have to pay to replace them or in the sense of how much they might earn (and perhaps donate) elsewhere. It might be better to budget as paying a more normal wage to your employees with them donating the difference back to Charity Science.</p>\n<p>Note that I actually think this is a budgeting issue for most EA orgs, which somewhat obscures counterfactual impact. I brought it up here not to pick on Charity Science but just because you guys are so amazingly frugal that it makes even more of a difference than normal!</p>\n", "parentCommentId": null, "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "zWabeRkE4CRjy7KpR", "postedAt": "2015-01-26T19:52:31.831Z", "postId": "RPJhCLWEizLYXzyGd", "htmlBody": "<p>I've been following the reports you and Xio and Joey have been writing on all the different fundraising methods you've explored, and will consider a substantial donation (since I'd want to keep you running and pay for a sizeable chunk of time experimenting). It would be a shame for effective altruism if you guys had to shut down abruptly given your demonstrated commitment to measure results and shut projects down if they don't raise money. I assume it would be a waste of knowledge and expertise and contacts you've built up too. It'd be helpful if you could comment on that. In particular is there a way to invest to create potential for more money raised in the future, or build up resources of any sort that can be used for whatever seems highest impact?</p>\n", "parentCommentId": null, "user": {"username": "Ervin"}}, {"_id": "ymZXCktisSjtDDspb", "postedAt": "2015-01-26T20:01:46.038Z", "postId": "RPJhCLWEizLYXzyGd", "htmlBody": "<p>Thanks Ervin for the kind words. You're right that if we shut down there would be a loss of contacts / knowledge. We have gotten a lot better at fundraising overall and expect if other people were to do other fundraising projects there would be a similar learning curve. We have also built up some contacts through networking that would be useful for later projects (e.g. legacy fundraising).</p>\n", "parentCommentId": "zWabeRkE4CRjy7KpR", "user": {"username": "Joey"}}, {"_id": "Q8bQ7paEEcNduMqB4", "postedAt": "2015-01-26T22:48:46.075Z", "postId": "RPJhCLWEizLYXzyGd", "htmlBody": "<p>I’d also add that we’ve always bought the standard fundraising advice that it’s worth investing in small first-time donors because (especially with some further best practice work, which we plan to do) they’ll on average donate more in future years. So some of our work is an upfront investment that should continue to pay off with relatively smaller amounts of future work. Internal estimates we made had this leading to quite a lot of money in future years.</p>\n", "parentCommentId": "ymZXCktisSjtDDspb", "user": {"username": "Tom_Ash"}}, {"_id": "omLQDPjXDQaSbomqL", "postedAt": "2015-01-27T08:37:20.820Z", "postId": "RPJhCLWEizLYXzyGd", "htmlBody": "<p>Could you say more about particular plans, like the &quot;large sponsored fundraiser which will be run simultaneously by local EA groups around the world&quot;?</p>\n", "parentCommentId": null, "user": {"username": "Ervin"}}, {"_id": "7QgH8mnC3QshgKM7b", "postedAt": "2015-01-27T09:48:04.843Z", "postId": "RPJhCLWEizLYXzyGd", "htmlBody": "<p>Sure, I'll start with that one. I think it will in expectation raise quite a lot of money, significantly increasing our money moved this year. I base this on:</p>\n<p>1) The fact that specific types of fundraiser run by similar local groups have raised tens of thousands in the past, and that we're considering following their proven model as closely as possible as the plan to beat - we'll do so unless we can work out one with better prospects.</p>\n<p>2) The fact that we have a large number of local EA groups signed up already and several interested without having approached most of them.</p>\n<p>3) The fact that we'll likely be applying the 'raise money by emailing your friends and family' approach which worked in all three types of peer-to-peer fundraiser we ran. In these, people who followed our full package of suggestions including emailing large numbers raised thousands, though I don't expect most people to do that. Additional evidence for the prospects of this peer-to-peer approach come from the fact that it is widely used in the charity world, and charities who apply it find it raises significant amounts.</p>\n<p>A large number of groups running this simultaneously should make a bigger splash and potentially get attention in local/student media, which we'd work towards. </p>\n<p>Besides money moved, an additional benefit of this fundraiser will be to spread the word about evidence-based charity. Naturally this would result if we succeeding in getting media coverage. It also happens each time someone emails a friend or family member about the fundraiser - people often don't talk about evidence-based charity with people they know, and a peer-to-peer fundraiser like this provides an excuse for doing so.</p>\n", "parentCommentId": "omLQDPjXDQaSbomqL", "user": {"username": "Tom_Ash"}}, {"_id": "dkzneaBkzv4CvmajZ", "postedAt": "2015-01-27T10:02:17.762Z", "postId": "RPJhCLWEizLYXzyGd", "htmlBody": "<p>Have you considered doing something that could go viral like the Ice Bucket Challenge? The potential upside from that would make it worth a shot for the effective altruist community.</p>\n", "parentCommentId": "7QgH8mnC3QshgKM7b", "user": {"username": "Ervin"}}, {"_id": "pzknLoJLHEWMCCJaf", "postedAt": "2015-01-27T11:29:13.024Z", "postId": "RPJhCLWEizLYXzyGd", "htmlBody": "<p>Not yet, but we are currently considering that for the local groups fundraiser specifically, because some of them are quite keen on it. The viral potential is another argument for running this fundraiser, though in fairness I should say that I'm considerably more sceptical  about whether this is worth pursuing than those groups. However I generally find myself assigning lower chances to these large upside possibilities than most EAs, so I suspect this may be a mistake on my part.</p>\n<p>I'd actually find others' takes on all this valuable - does anyone have any?</p>\n", "parentCommentId": "dkzneaBkzv4CvmajZ", "user": {"username": "Tom_Ash"}}, {"_id": "uEWrtjFpHpYP6N8nS", "postedAt": "2015-01-27T16:16:13.780Z", "postId": "RPJhCLWEizLYXzyGd", "htmlBody": "<p>This is a really interesting point, which I'd like to see more explored in EA transparency efforts.</p>\n", "parentCommentId": "4ETQyzCT2w5Sj7tj3", "user": {"username": "Raemon"}}, {"_id": "Ww4sG6KxpC6eGr475", "postedAt": "2015-01-27T18:09:42.186Z", "postId": "RPJhCLWEizLYXzyGd", "htmlBody": "<p>Thanks for the suggestion, Ervin. We have thought about this idea before. It is worth noting that The Life You Can Save tried this <a href=\"http://www.thelifeyoucansave.org/Blog/ID/138/Worm-vs-Worms-a-social-media-stunt-that-saves-lives\">http://www.thelifeyoucansave.org/Blog/ID/138/Worm-vs-Worms-a-social-media-stunt-that-saves-lives</a> and vegans also tried it via <a href=\"http://www.vegan.com/videos/hydrate-donate/\">http://www.vegan.com/videos/hydrate-donate/</a></p>\n<p>I think that after a very successful fundraiser happens, it's tempting to try out the same thing for your cause/charity. But it's really important to consider how many viral challenges were attempted before (and since) one worked effectively. There were a lot of charities who worked on viral videos after Kony 2012 but none got even close to as big. I would expect the same to be true of the ice bucket challenge.</p>\n<p>All that being said, if it's easy to add a viral element that does not take away from the fundraiser in other ways we would definitely integrate it.</p>\n", "parentCommentId": "dkzneaBkzv4CvmajZ", "user": {"username": "Joey"}}, {"_id": "6E5m8M2CBJxiBiWcu", "postedAt": "2015-01-27T20:39:03.800Z", "postId": "RPJhCLWEizLYXzyGd", "htmlBody": "<p>Note that this argument is very similar to the reasons why GiveWell includes a number of costs in its per-bednet costs for AMF that AMF excludes because they are provided 'for free', including CEO salary. This is a point disputed between GiveWell and AMF (<a href=\"http://www.givewell.org/international/top-charities/AMF\">http://www.givewell.org/international/top-charities/AMF</a>; search for 'what do you get for your dollar'), but I think GiveWell have basically got it right here.</p>\n", "parentCommentId": "4ETQyzCT2w5Sj7tj3", "user": {"username": "AGB"}}, {"_id": "PoGADwLrDMccCm6pw", "postedAt": "2015-01-27T21:01:04.047Z", "postId": "RPJhCLWEizLYXzyGd", "htmlBody": "<p>Good point, I didn't notice this. It would be interesting to know how effectively funds are being raised if the hours of any full-time staff and volunteers are budgeted at Canada's average wage of $50k per year. </p>\n<p>Of course, there are other considerations, like if these people were earning to give, they couldn't give 100%, and the per dollar impact might increase over the lifetime of an EA organisation, but it would be good to know.</p>\n", "parentCommentId": "4ETQyzCT2w5Sj7tj3", "user": {"username": "RyanCarey"}}, {"_id": "5vnskjSNX8idmPw5A", "postedAt": "2015-01-28T02:26:21.700Z", "postId": "RPJhCLWEizLYXzyGd", "htmlBody": "<blockquote>\n<p>being raised if the hours of any full-time staff and volunteers are budgeted at Canada's average wage of $50k per year</p>\n</blockquote>\n<p>Well wages now are less than $10k per person, so, that would move from 9:1 to less than 2:1, which is a lot lower than other organizations that evaluate themselves in terms of money moved to effective charities. But I think that would be misleadingly low in a different way, since they improved their fundraising techniques over time (e.g. much of their fundraising came in these birthday/Christmas fundraisers that came late). So I'd project higher efficacy going forward, and hopefully new innovations. I'd also include value of information produced during the process for other groups.</p>\n<p>Basically, I would view funding now more in terms of R&amp;D to find new fundraising methods than in terms of money moved thus far.</p>\n", "parentCommentId": "PoGADwLrDMccCm6pw", "user": {"username": "CarlShulman"}}, {"_id": "ML8v7Esm2j7gmuBD5", "postedAt": "2015-01-28T23:17:22.842Z", "postId": "RPJhCLWEizLYXzyGd", "htmlBody": "<p>80,000 Hours includes total time estimates and our own very rough estimates of the opportunity costs of this time in our evaluation documents.</p>\n<p><a href=\"https://80000hours.org/2014/05/plan-change-analysis-and-cost-effectiveness/\">https://80000hours.org/2014/05/plan-change-analysis-and-cost-effectiveness/</a></p>\n", "parentCommentId": "uEWrtjFpHpYP6N8nS", "user": {"username": "Benjamin_Todd"}}, {"_id": "GSMoDS5EGuE3y7orn", "postedAt": "2015-01-28T23:18:44.774Z", "postId": "RPJhCLWEizLYXzyGd", "htmlBody": "<p>@Ryan - I think Joey and Xio made an estimate in one of their previous review documents.</p>\n<p>@Carl - I agree with this. It seems a bit misleading to advertise CS as already cost-effective in terms of money moved, but worthwhile to fund for other reasons.</p>\n", "parentCommentId": "5vnskjSNX8idmPw5A", "user": {"username": "Benjamin_Todd"}}, {"_id": "Thax4oEmSvLyGmPd4", "postedAt": "2015-01-29T13:15:43.337Z", "postId": "RPJhCLWEizLYXzyGd", "htmlBody": "<p>We tried this - a selfie on facebook with malaria nets on our heads. We asked for £3 to cover a net (a bit of a lie as nets cost less I think). We got 6 other people to do it then it fizzled out. This was something tried in the context of the ALS challenge as a counter-cultural thing.</p>\n<p>What I think would help if this was going to be attempted again (but I think people are over it now to some extent, unless a new social norm is being seen as being challenged / it feels qualitatively different):</p>\n<p>-A much easier way of paying</p>\n<p>-A more dramatic request</p>\n<p>-People with more friends on facebook</p>\n<p>-People with friends that are more likely to do it starting it</p>\n", "parentCommentId": "dkzneaBkzv4CvmajZ", "user": {"username": "tomstocker"}}, {"_id": "CEp3gCbdBc2KvFY6x", "postedAt": "2015-01-29T13:21:56.176Z", "postId": "RPJhCLWEizLYXzyGd", "htmlBody": "<p>This is so obvious I'm sure you've already been through it, so comment if this is the case and I'll delete:</p>\n<p>How constraining would it be to try to fundraise for CS outside the EA community? Presumably money you get donated from here will be coming from other EA causes or the charities you're trying to fundraise for. Could you try and tap into fundraising orgs <a href=\"http://www.institute-of-fundraising.org.uk/home/\">http://www.institute-of-fundraising.org.uk/home/</a> or get them to commission experiments (the hard to quantify downside is you'll be crowding your own market with people that don't have effectiveness as an objective)</p>\n", "parentCommentId": null, "user": {"username": "tomstocker"}}, {"_id": "iiEqN5zTcrQ82wkjt", "postedAt": "2015-01-29T20:05:44.495Z", "postId": "RPJhCLWEizLYXzyGd", "htmlBody": "<p>I think there are a lot of different ways to calculate impact. We generally try to follow GiveWell’s model as closely as possible as we have found them to be consistently stronger at truthful impact reporting. If we had used other meta-charities’ ways of calculating our impact, it would have been far higher (e.g. if we had included projections of future donations, or did not exclude counterfactuals as harshly as we did).</p>\n<p>As for calculating our opportunity costs, I think this is an interesting question and a good thing to take into account. In our next impact report we will be sure to include these figures. For the time being we will put the calculations in this comment. </p>\n<p>We based our calculations on what would happen if we did earning to give instead of running Charity Science. We took into account an estimate of earning based on each of our ages, time worked on CS, degree level, rate of taxes we would have to pay, cost of living, and the percentage each individual would donate, etc. We think we would have donated $45,500 in the first year. This may be substantially lower though, as Joey and I may have had to do some capacity-building to enter the for-profit sector, which would have cost time and money. It also assumes we find jobs immediately and have no extra job expenses such as clothing or travel. This gives a ratio of about 1:3 over the year, or 1:6 over the last 6 months. </p>\n<p>In terms of replacements, I currently expect to hire minimum wage non-EA workers to do a large amount of the future fundraising (with either one ED staying as ED, or just having an EA heavy board). That is also worth keeping in mind if someone wants to calculate it from that perspective.</p>\n<p>I really like people asking these sorts of questions. I hope to see this sort of rigour and these sorts of strong questions applied to all meta-charities consistently.</p>\n<p>-Xio</p>\n", "parentCommentId": "4ETQyzCT2w5Sj7tj3", "user": {"username": "katherinesavoie"}}, {"_id": "M9WBwRbyQrqLrascr", "postedAt": "2015-01-29T20:16:16.064Z", "postId": "RPJhCLWEizLYXzyGd", "htmlBody": "<p>I think it would be very hard to raise money for something that is 100% fundraising overhead outside of EA or EA minded people. We did consider it and have applied for some other non-EA funding with no success.</p>\n", "parentCommentId": "CEp3gCbdBc2KvFY6x", "user": {"username": "Joey"}}, {"_id": "eJEgacETjH8cHXijn", "postedAt": "2015-01-29T21:06:04.082Z", "postId": "RPJhCLWEizLYXzyGd", "htmlBody": "<p>For the record, I think the $45,500 donations figure is a significant overestimate, even just considering the donations I'd have counterfactually made given the limited amount of time I spent on fundraising this year - indeed based on those I know that it is. (I'd ask people to just trust that I'm most aware of the factors behind my estimates for my donations.)</p>\n<p>One thing which I guess we can spell out since people are wondering how much we'd donate is that this figure has Joey and Xio donating everything above $6,000 (£3,157) a year each, post-tax. And it has me donating much more than I actually would, as my earnings in this limited time wouldn't push me over my theshold for donating everything as opposed to giving 10%. As it happens we think Charity Science is the best donation opportunity that we know of, so we'd donate to it.</p>\n<p>I also think that a 1:6 ratio, let alone a 1:3 one, is misleadingly low.</p>\n", "parentCommentId": "iiEqN5zTcrQ82wkjt", "user": {"username": "Tom_Ash"}}, {"_id": "GCZ23hsGD4HSsjChs", "postedAt": "2015-01-30T00:22:40.142Z", "postId": "RPJhCLWEizLYXzyGd", "htmlBody": "<p>Don't forget the staff are partly being paid in exciting work, the respect of their EA peers, a sense of purposefulness, and so on. As a result compensating differentials lowers the market price for their labour, and they are more well compensated holistically than they appear to be.</p>\n<p>Conversely, bankers do work most people find boring and difficult, face hostility from much of the population, frequently think their work is pointless, and so on. As such compensating differentials increases the market price for their labour, and they are less well compensated holistically than they appear to be.</p>\n", "parentCommentId": "4ETQyzCT2w5Sj7tj3", "user": {"username": "Larks"}}, {"_id": "zFof9wCSMx2WPNpBL", "postedAt": "2015-02-01T17:16:01.694Z", "postId": "RPJhCLWEizLYXzyGd", "htmlBody": "<p>I'd be keen to see you include projections of future donations and other potentially important factors <em>as well</em>. I think it's fine to do both so long as you make it clear. It seems silly to judge all EA orgs just by &quot;money moved over the last year&quot; (e.g. if we all did that, no-one would have given to GiveWell in their first couple of years, which would have been bad).</p>\n", "parentCommentId": "iiEqN5zTcrQ82wkjt", "user": {"username": "Benjamin_Todd"}}]