[{"_id": "FsbF4kQ4jcTAxMxxi", "postedAt": "2023-10-13T09:54:16.987Z", "postId": "Rq5yvqzawgnGphvzM", "htmlBody": "<p>Thanks to Seb and others for putting in the effort to get clarity in this area for the community.&nbsp;<br><br>Very briefly before I circle back for a more substantive round of commenting – noting that I haven't dug into all of the studies that these quantitative estimates are predicated upon, I wasn't able to find mention of staff <strong>\"turnover / churn \"</strong> or anything of the sort in this report.&nbsp;<br><br>If it's the case that estimates within this report, and/or quantitative estimates within studies that this report draws from, do not include an approximation of costs from staff turnover / churn, <i>I'd be very surprised if they didn't have at least a noticeable effect on estimates like those found in this report.&nbsp;</i><br><br>I'd imagine HR professionals would care a lot about costs associated with turnover / churn. Anyone who has needed to replace someone understands firsthand how much of a heavy lift that can be, including the shared bandwidth burden of needing to cover duties that trickle onto everyone else. (This often strains multiple people)<br><br>My eye test from coaching EAs struggling with various aspects of their job is that a nontrivial proportion of them are often considering leaving entirely. And in fact, some number of former clients of mine have left organizations after protracted periods of comparatively low productivity and comparatively low overall wellness.&nbsp;<br><br>To spell out the implications of what I'm saying a bit more, should staff turnover have any kind of meaningful effect on organizational costs, the value of implementing various staff wellness interventions should go up if it improves retention&nbsp;<br><br>Seb had a preference for me to include as a comment here. Curious for thoughts!</p>", "parentCommentId": null, "user": {"username": "Tee"}}, {"_id": "XHpQznkbdMpjvBFMK", "postedAt": "2023-10-13T19:52:03.516Z", "postId": "Rq5yvqzawgnGphvzM", "htmlBody": "<p>Thanks for the comment Tee!<br>As mentioned in the post, this approach had many flaws. This is partly because we wanted to rely on published studies on the association between various conditions (e.g., stress) and productivity loss. Most of the studies we looked at relied on self-reported absenteeism and presenteeism (loss of productivity while at work due to lower performance). This means that these estimates don't include turnover which can indeed cause decreased organizational productivity, emotional challenges, and other costs. Overall, this might mean that this is an underestimate though there are other ways in which the estimates above might be an overestimate. Do you have a sense of how many people this might involve - e.g., is it 0.1% of staff, 1% of staff, or something else?</p>", "parentCommentId": "FsbF4kQ4jcTAxMxxi", "user": {"username": "SebastianSchmidt"}}, {"_id": "v6qyoouE3BrrswkCe", "postedAt": "2023-10-25T21:58:38.327Z", "postId": "Rq5yvqzawgnGphvzM", "htmlBody": "<p>Thanks for putting this together <a href=\"https://forum.effectivealtruism.org/users/sebastianschmidt?mention=user\">@SebastianSchmidt</a> and <a href=\"https://forum.effectivealtruism.org/users/amine?mention=user\">@Amine</a>. I appreciate you being conservative with your conclusions. However, my takeaway is that—<strong>even at their lowest ROI, it is still worthwhile for orgs to invest in the mental health and productivity of their staff, </strong>at least on a trial basis so they can determine through their own research how impactful the program is.</p><p>A couple of more considerations:</p><ol><li>It may be more worthwhile for investment from EA umbrella funders that don't care if the person moves to a different org but stays within EA.</li><li>I personally believe that these sorts of investments early in someone's career (the first 5–10 years) have compounding returns as that person grows their scope and impact.</li></ol><p>Certainly, there’s much worth additional follow-up, but overall this is a great result that will hopefully encourage HR and managers to feel more comfortable making investments here. If anyone wants to have a conversation around what that might look like, please do reach out to <a href=\"https://forum.effectivealtruism.org/users/sebastianschmidt?mention=user\">@SebastianSchmidt</a>, <a href=\"https://forum.effectivealtruism.org/users/inga?mention=user\">@Inga</a>, or myself (<a href=\"https://forum.effectivealtruism.org/users/davec?mention=user\">@Dave Cortright</a>) who are passionate about making this happen.&nbsp;</p>", "parentCommentId": null, "user": {"username": "DaveC"}}, {"_id": "mH4daNEnW8iPxEELz", "postedAt": "2023-10-26T22:25:56.661Z", "postId": "Rq5yvqzawgnGphvzM", "htmlBody": "<p>Thanks, Dave! Yes, we found that even the conservative estimate indicates that this can be a worthwhile investment and I feel more robustly good about folks investing in experimenting with high-quality services. That said, some initiatives have significantly higher ROI than 3.7 (our upper bound) so people will have to make individual judgment calls.</p>\n<p>In terms of your considerations:</p>\n<ol>\n<li>This seems right to me. I also want to stress that I think it's likely that some of the people who could benefit the most from these services aren't currently working at organizations. E.g., individual researchers who don't have anything that resembles management and other beneficial structures typically found within organizations.</li>\n<li>Seems true to me! However, even very senior people may benefit a lot from this. For example, many of the big tech CEOs (e.g., Eric Schmidt, Tim Cook, and Sundar Pichai) were coached by Bill Campbell and <a href=\"https://www.amazon.co.uk/Trillion-Dollar-Coach-Leadership-Handbook/dp/1473675960\">attributed significant value to that coaching</a>.</li>\n</ol>\n<p>Yes, we're happy to support follow-ups!</p>\n", "parentCommentId": "v6qyoouE3BrrswkCe", "user": {"username": "SebastianSchmidt"}}]