[{"_id": "yYKdiFyJ2ogEumPqG", "postedAt": "2023-09-29T13:15:26.116Z", "postId": "RQzieJvu6Ecmgagbp", "htmlBody": "<p><strong>Executive summary</strong>: A model is presented for estimating the value of research aimed at influencing funders' allocations. Key inputs include chance of influencing funder decisions, amounts donated, cost-effectiveness of current vs. potential funding, and research costs.</p><p><strong>Key points</strong>:</p><ol><li>The model estimates the impact of research by assessing the likelihood of influencing a funder and the resulting change in funding cost-effectiveness.</li><li>It accounts for research costs, donation amounts, years of influence, and uncertainty. Monte Carlo simulations are used.</li><li>Examples suggest research can often compare favorably to direct funding even with limited years of influence.</li><li>Shifting funders from low to moderate cost-effectiveness can be highly cost-effective.</li><li>Limitations include estimating influence, transition costs, alternate uses of money, declining returns, and uncertainty.</li><li>The model currently uses an expected value framework and doesn't account for risk aversion or moral uncertainty.</li></ol><p>&nbsp;</p><p><i>This comment was auto-generated by the EA Forum Team. Feel free to point out issues with this summary by replying to the comment, and</i><a href=\"https://forum.effectivealtruism.org/contact\"><i>&nbsp;<u>contact us</u></i></a><i> if you have feedback.</i></p>", "parentCommentId": null, "user": {"username": "SummaryBot"}}, {"_id": "i6sJd6zbEQLisEyXK", "postedAt": "2023-09-29T21:31:08.152Z", "postId": "RQzieJvu6Ecmgagbp", "htmlBody": "<p>This looks like a really cool framework! Hoping to experiment with the inputs sometime to inform my future career decisions / my thoughts on funding desk research versus original research / value of replications.</p>\n<blockquote>\n<p>Moving some funders from an overall lower cost effectiveness to a still relatively low or middling level of cost effectiveness can be highly competitive with, and, in some cases,  more effective than working with highly cost-effective funders.</p>\n</blockquote>\n<p>I’ve suspected this but never had the framework to formalize it. Or what parameters my claim was sensitive to. Mostly I had a toy metaphor in my head of “small nudge on giant slow rock” &gt; “big nudge on tiny speeding rock” (the former being a bureaucrat nudging an agency budget and the latter being a CEO pivoting an EA-style non-profit). So having more of these cruxes and levers listed out here is very helpful</p>\n<p>One concrete case I feel is a sort of “constrained optimization” where a funder has a specific theme they want to stick to. With governments, this might be a legal requirement.</p>\n", "parentCommentId": null, "user": {"username": "geoffreyyip"}}, {"_id": "S6CSdMrekhoP8Tsxv", "postedAt": "2023-10-01T07:32:36.823Z", "postId": "RQzieJvu6Ecmgagbp", "htmlBody": "<p>That's really exciting! Do you plan on open-sourcing the project?</p>", "parentCommentId": null, "user": {"username": "edoarad"}}, {"_id": "hjLRYch8Mydow8n2D", "postedAt": "2023-10-02T13:53:16.958Z", "postId": "RQzieJvu6Ecmgagbp", "htmlBody": "<p>Maybe. We're a little unsure about this right now. The code base for this is part of the bigger Cross-Cause Cost-Effectiveness Model which we haven't made a final determination on whether we will release it.</p>\n", "parentCommentId": "S6CSdMrekhoP8Tsxv", "user": {"username": "Marcus_A_Davis"}}, {"_id": "8PmBbMjcoPhX65fNj", "postedAt": "2023-10-03T16:23:43.700Z", "postId": "RQzieJvu6Ecmgagbp", "htmlBody": "<p>This is great! I just wanted to specifically call out that I liked the footnote on the use of DALYs. That's exactly the kind of thing I was hoping to see more of when I wrote the improving EA communication surrounding disability post.&nbsp;</p>", "parentCommentId": null, "user": {"username": "MHR"}}, {"_id": "2sorN7DYpmNcnH7Rc", "postedAt": "2023-10-04T11:44:20.995Z", "postId": "RQzieJvu6Ecmgagbp", "htmlBody": "<p>Do you mind sharing your main consideration against releasing it? Not trying to push back, but rather to understand this as I'm considering working on related topics&nbsp;</p>", "parentCommentId": "hjLRYch8Mydow8n2D", "user": {"username": "edoarad"}}]