[{"_id": "SBrWkpE67AwDa7kbJ", "postedAt": "2023-03-14T10:05:42.095Z", "postId": "RqzSQwGEPmvbemgkH", "htmlBody": "<p>Sorry in advance for the long comment, I am attempting to explain statistics concepts in a helpful/accessible way to a broad audience, because I think it's really important to consider uncertainty well when we make important decisions.&nbsp;</p><p>While I love the idea of a BOTEC model for comparing impact of community building interventions, this seems like a formula that is likely susceptible to the flaw of averages. The flaw of averages is the idea that systematic errors &nbsp;occur when we base calculations on the average (expected value) of uncertain inputs, rather than the entire distribution of possible inputs.&nbsp;</p><p>So when in your formula you use <strong>i (average impact potential of participants)</strong>, that seems like a potentially major oversimplification of the reality that you might see a wide range of impact potentials within a certain intervention. Relying on averages in this way is known to actually mislead decision making (fields like risk management need to pay attention to this, a specific example is <a href=\"https://www.probabilitymanagement.org/climate-change\">flood damage</a> modeling, but it crops up all over the place).</p><p>For a simple example: say you are doing a fundraiser targeting students and parents (I'm using $ because it's easy to quantify and understand). You expect to reach 90 students and only 10 parents. You expect the likelihood increase for making a donation for students is 0.8, and the likelihood increase for donations from parents is 0.4.</p><p>The vast majority of participants are students, so you &nbsp;decide to classify your \"average giver\" as a student (since student vs parent are discrete categories). Having decided that the \"average\" target of the fundraiser is other students, you predict that the average participant who makes a donation will give $10. So if you convince 100 people to donate, by the formula, your expected value is $10*100*0.8=$800. Your predicted average donation is $8.</p><p>However, the reality is a bit different, because maybe your fundraiser reaches 90 students and 10 parents. Parents in this scenario have much greater disposable income, such that the parents who donate will &nbsp;each give $100. So now, &nbsp;your expected value is &nbsp;$10*90*0.8+$100*10*0.4=$1,120. Your actual average donation is now $11.2 per person, which is a 40% increase over your predicted average donation.</p><p>This is a simplified/exaggerated example of how heavy tailed distributions (which can be thought of as the technical term for black swan events) can distort statistics. Quantities like income and wealth are heavy tailed in reality. I think you could make the case that actual impact as an outcome (vs impact potential) is heavy tailed as well. Open Philanthropy seems to agree with this based on their <a href=\"https://www.openphilanthropy.org/research/hits-based-giving/\">Hits-based Giving</a> approach. &nbsp;And you actually mention that &nbsp;the\"Open Phil Survey uses an impact scale of four orders of magnitude between people working on longtermist causes\".&nbsp;</p><p>\"The problem with observations or events from a heavy tail is that even though they are frequent enough to make a difference, they are rare enough to make us underestimate them in our experience and intuitions.\" This article \"<a href=\"https://michelfeit.medium.com/heavy-tails-and-altruism-when-your-intuition-fails-you-15a8b2b7299c\">Heavy Tails and Altruism: When Your Intuition Fails You</a>\" has more detail on the topic.&nbsp;</p><p><strong>Maybe your formula could allow for summation of different projected classes of participants? This could help it account for lower-likelihood/lower frequency, but higher-impact-potential participants. Since interventions could vary significantly in terms of relevance of these \"black swans,\" accounting for them seems important to me. You may be hinting at this approach in your explanation of example 2.</strong></p><p>Given that we care more about actual impact than impact potential, I personally feel pretty cautious about promoting a movement-wide approach to community building that might limit creativity/innovation/experimentation, and that potentially favors narrowing down over broadening outward.</p><p>P.S. - I want to acknowledge that it's much easier to critique other people's work than to attempt something from scratch. So I also wanted to thank you for writing this up and sharing it! I like the overall idea, enjoyed learning about the existing approaches thanks to your research, and appreciate you working on community building so thoughtfully. Thank you!</p>", "parentCommentId": null, "user": {"username": "Tess Hegarty"}}, {"_id": "WmmdvgzDv6BjFPA3b", "postedAt": "2023-03-14T22:01:31.341Z", "postId": "RqzSQwGEPmvbemgkH", "htmlBody": "<p>Strongly agree with your comment. I noticed the same thing while reading the post. The factor i for average impact per participant is really handwavy; I think impact per person varies widely (even within preselected groups, e.g. 80k's target audiences such as Numberphile youtube viewers) and this makes the model less useful at this level of simplification.</p>", "parentCommentId": "SBrWkpE67AwDa7kbJ", "user": {"username": "robirahman"}}, {"_id": "aouc6ZFkESBiTnFjS", "postedAt": "2023-03-15T21:38:34.207Z", "postId": "RqzSQwGEPmvbemgkH", "htmlBody": "<p>Thanks for writing up your thinking on this, and also more in general for doing the hard work of community building. 🙌</p>\n<p>I think Tess makes good points in their comment about the huge amounts of uncertainty contained in that impact potential factor, and I would go a step further and say:</p>\n<h2>The factor <strong>i</strong> is a red herring, and it is harmful for community building to try and predict it.</h2>\n<ul>\n<li>\"intuitively\" predicting this is extremely succeptible to bias and rationalizations</li>\n<li>overconfident community builders using this to justify their decisions will come off as arrogant and elitist</li>\n<li>it will increase impostor syndrome (\"my local group doesn't have a high enough impact potential\")</li>\n<li>it's dependent on which ethical frameworks are correct</li>\n<li>core EA orgs weren't able to predict the hugely negative impact of SBF</li>\n</ul>\n<p>Using it to decide who is \"most worthy of outreach\" is in direct conflict with core strenghts of the EA community: cause-neutrality and openness to neglected approaches to making the world a better place.</p>\n<h2>What should be done instead?</h2>\n<p>Aim to build a broad, diverse community that is welcoming and non-judgemental and accurately communicates EA ideas to a large audience. Build a community that you would want to be part of. Does this mean abandoning  quantitative measures? No, we can still measure if we achieve our goals:</p>\n<ul>\n<li>measure participant's understanding of core EA ideas</li>\n<li>measure diversity</li>\n<li>measure people reached</li>\n<li>measure giving pledges</li>\n<li>measure money donated</li>\n</ul>\n<p>The high impact potential people (those mythical creatures) will find their way once they have come in contact with an accurate representation of EA ideas. It's not the job of community builders to identify and guide them (because they can't), their job is to build an awesome community that communicates EA ideas with high fidelity so that many people come in contact with good first hand accounts of these ideas instead of simplified straw-man versions of EA in take-down articles about scandals in the EA community.</p>\n", "parentCommentId": null, "user": {"username": "florian-z"}}, {"_id": "BYgua3QYkLG6q2wiw", "postedAt": "2023-03-16T13:33:31.004Z", "postId": "RqzSQwGEPmvbemgkH", "htmlBody": "<p>As a community member, reading this kind of marketing language being applied to me is kind of uncomfortable. I want to be enabled, not persuaded.</p>\n<p>This general approach still makes sense, so I think it should still be applied when doing outreach or planning events. But please don't forget there are people on the other side.</p>\n<p>It's important that community members feel valued even if they don't seem likely to have massive impact!</p>\n", "parentCommentId": null, "user": {"username": "ludwigbald"}}, {"_id": "M8jdZFKymJTBWbXQv", "postedAt": "2023-03-16T16:26:12.137Z", "postId": "RqzSQwGEPmvbemgkH", "htmlBody": "<p>I agree that community members should feel valued. At the same time, I don't think this model changes much in that services for community members have always been discriminatory. Not everyone is accepted for 80k calls, EAG(x) conferences or retreats. While it's important to have open local groups, I think having clearer priorities on national or international services seems less exclusive.</p>", "parentCommentId": "BYgua3QYkLG6q2wiw", "user": {"username": "gruban"}}, {"_id": "itW77Ygotq2QN435J", "postedAt": "2023-03-16T18:24:40.287Z", "postId": "RqzSQwGEPmvbemgkH", "htmlBody": "<p>I agree that persuasion frames are often a bad way to think about community building.</p>\n<p>I also agree that community members should feel valuable, much in the way that I want everybody in the world to feel valued/loved.</p>\n<p>I probably disagree about the implications, as they are affected by some other factors. One intuition that helps me is to think about the donors who donate toward community building efforts. I expect that these donors are mostly people who care about preventing kids from dying of malaria, and many donors also donate lots of money towards charities that can save a kid’s like for $5000. They are, I assume, donating toward community building efforts because they think these efforts are on average a better deal, costing less than $5000 for a live saved in expectation.</p>\n<p>For mental health reasons, I don’t think people should generally hold themselves to this bar and be like “is my expected impact higher than where money spent on me would go otherwise?” But I think when you’re using other peoples altruistic money to community build, you should definitely be making trade offs, crunching numbers, and otherwise be aiming to maximize the impact from those dollars.</p>\n<p>Furthermore, I would be extremely worried if I learned that community builders aren’t attempting to quantify their impact or think about these things carefully (noting that I have found it very difficult to quantify impact here). Community building is often indistinguishable (at least from the outside) from “spending money on ourselves” and I think it’s reasonable to have a super high bar for doing this in the name of altruism.</p>\n<p>Noting again that I think it’s hard to balance mental health with the whacky terrible state of the world where a few thousand dollars can save a life. Making a distinction between personal dollars and altruistic dollars can perhaps help folks preserve their mental health while thinking rigorously about how to help others the most. Interesting related ideas:</p>\n<p><a href=\"https://www.lesswrong.com/posts/3p3CYauiX8oLjmwRF/purchase-fuzzies-and-utilons-separately\">https://www.lesswrong.com/posts/3p3CYauiX8oLjmwRF/purchase-fuzzies-and-utilons-separately</a>\n<a href=\"https://forum.effectivealtruism.org/posts/zu28unKfTHoxRWpGn/you-have-more-than-one-goal-and-that-s-fine\">https://forum.effectivealtruism.org/posts/zu28unKfTHoxRWpGn/you-have-more-than-one-goal-and-that-s-fine</a></p>\n", "parentCommentId": "BYgua3QYkLG6q2wiw", "user": {"username": "Aaron_Scher"}}, {"_id": "4v87KTzfToa2NiisF", "postedAt": "2023-03-17T18:08:54.005Z", "postId": "RqzSQwGEPmvbemgkH", "htmlBody": "<p>Here is a squiggle model which addresses some of these concerns</p><pre><code>p_student_donates = beta(2.355081, 49.726) // 0.01 to 0.1, i.e., 1% to 10%, from &lt;https://nunosempere.com/blog/2023/03/15/fit-beta/&gt;\namount_student_donates = 5 to 20 // dollars\n\np_parent_donates = beta(3.287, 17.7577) // 0.05 to 0.3, i.e., 5% to 30%\namount_parent_donates = 50 to 500 // dollars\n\nnum_parents = 5 to 20\nnum_students = 15 to 90\n\nexpected_impact = num_students * p_student_donates * amount_student_donates + num_parents * p_parent_donates * amount_parent_donates</code></pre><p>To execute it, you can paste it here: &lt;https://www.squiggle-language.com/playground&gt;.&nbsp;</p>", "parentCommentId": "SBrWkpE67AwDa7kbJ", "user": {"username": "NunoSempere"}}]