[{"_id": "W4hvGG4CBrmE97eEk", "postedAt": "2024-02-07T16:53:10.946Z", "postId": "RRDAzpi6vS8ARvsDF", "htmlBody": "<p>Is the issue highly polarized/politicized in Germany? Say, do you expect some people to engage less with your work as a result of \"choosing sides\"?</p><p>In EA Israel we tend to take more politically neutral approaches when engaging publicly, including in relation to the current war or to the large \"pro-democratic\" public protests (<a href=\"https://en.wikipedia.org/wiki/2023_Israeli_judicial_reform_protests\">wiki</a>). I'm curious about your attitude to reputational risks and the potential problem of \"painting EA with leftist colors\".</p>", "parentCommentId": null, "user": {"username": "edoarad"}}, {"_id": "q9yYy9zEh8ZEhyaaz", "postedAt": "2024-02-07T18:29:15.543Z", "postId": "RRDAzpi6vS8ARvsDF", "htmlBody": "<p><a href=\"https://forum.effectivealtruism.org/posts/5Yk6MczhaeWiDCcv6/the-top-x-factor-ea-neglects-destabilization-of-the-united\">Here is another EA Forum post</a> that talks at length about democracy defense in the US context.</p>", "parentCommentId": null, "user": {"username": "Yelnats T.J."}}, {"_id": "dxk99SCunZHtfkFbR", "postedAt": "2024-02-07T18:59:24.732Z", "postId": "RRDAzpi6vS8ARvsDF", "htmlBody": "<p>Two considerations:<br>1. does protecting democracy have to be \"painting with leftist colors\"?<br>2. even if it was, does the ROI justify it?<br><br><strong>On the first, </strong>as noted in this <a href=\"https://www.youtube.com/watch?t=1870&amp;v=0OOwdUtNMGw&amp;feature=youtu.be\">EAGxVirtual lightning talk</a> I gave on the US context, the design of the political system is a big <a href=\"https://forum.effectivealtruism.org/posts/5Yk6MczhaeWiDCcv6/the-top-x-factor-ea-neglects-destabilization-of-the-united\">upstream cause</a> of authoritarian voter bases and to a larger extent authoritarian politicians. Many of the reforms to the US political system that would in the short to long term reduce the antidemocratic threat are \"bi-populist,\" as I like to call it.<br><br>Left- and Right-wing populists are generally for campaign finance reform, preventing politicians from becoming lobbyists, having a districting and voting system that enables third parties, etc. There are some notable ver partisan exceptions like moving from the electoral college to national popular vote and making the Senate less minoritarian.<br><br>In the US context, I think disciplined and skilled advocates can keep political system reform as populist/anti-establishment issue and avoid culture war framing. I'm not sure how this generalizes to Europe or Germany. While I don't think it generalizes 100%, I suspect it generalizes at least a little.<br><br><strong>On the second,</strong> I think the ROI from this issue is uniquely higher than other political issues. small-L liberal democracies (e.g. Germany, United States, Italy, etc) falling into something other than liberal democracies (Hungary is a good example of this) strikes me as patently super bad for suffering of humans/animals, the longterm future, EA agenda, and any other issues that we might care about. I think this is uniquely true of the United States because it is the world superpower and leading place for emerging technologies. However, the stakes are high even in places like Germany. How much would be lost alone by an authoritarian nativist government coming to power and eliminating all German foreign aid?<br><br>In short, if the Great Powers stop being liberal democracies, a lot of our agenda becomes moot because we will now have bigger problems. Instead of working to make German aid more effective, we will be working to get the govt to give any aid at all and ensure an authoritarian govt doesn't manipulate the political process to never relinquish power. Instead of working to get the United States Government to approach international AI coordination in a way that doesn't lead to an international arms race in capabilities, we will be fighting to keep a strongman from disrupting the global world order that that coordination is underpinned by.<br>&nbsp;</p>", "parentCommentId": "W4hvGG4CBrmE97eEk", "user": {"username": "Yelnats T.J."}}, {"_id": "GreEfDiYtFHKqkxnx", "postedAt": "2024-02-07T22:05:52.225Z", "postId": "RRDAzpi6vS8ARvsDF", "htmlBody": "<p>Germany so far is probably less polarized than other countries (e.g. the US). Currently there is only one far right party with significant reach (<a href=\"https://en.wikipedia.org/wiki/Alternative_for_Germany\"><u>AFD</u></a>) currently&nbsp;<a href=\"https://www.wahlrecht.de/umfragen/\"><u>polling around 19%</u></a> nationally.</p><p>The main conservative party (<a href=\"https://en.wikipedia.org/wiki/Christian_Democratic_Union_of_Germany\"><u>CDU</u></a>) and the conservative leaning economically liberal party (<a href=\"https://en.wikipedia.org/wiki/Free_Democratic_Party_(Germany)\"><u>FDP</u></a>) are currently clearly and credibly distancing themselves from the AFD. We even embedded an interview from one of the most prominent FDP members (Gerhart Baum) in one of our&nbsp;<a href=\"https://effektiv-spenden.org/blog/unsere-demokratie-wirksam-verteidigen/\"><u>blog posts</u></a> about how we think about defending democracy.</p><p>So while we still might risk our reputation with up to 20% of the electorate I assume that it’s far less than 20% of the people we might ever reach with the idea of effective giving anyway (especially in cause areas other than global health and development).</p><p>On the other side I hope this endeavor will help us introduce many new people to effective giving who would not otherwise have heard about it (because we will show up on the radar of additional journalists, some donors will more actively share our website etc.).</p><p><br>&nbsp;</p>", "parentCommentId": "W4hvGG4CBrmE97eEk", "user": {"username": "EA-Basti"}}, {"_id": "mQRHx8RbqLFgcFPed", "postedAt": "2024-02-08T07:00:08.011Z", "postId": "RRDAzpi6vS8ARvsDF", "htmlBody": "<p>Thanks a lot for pointing this one out!</p>", "parentCommentId": "q9yYy9zEh8ZEhyaaz", "user": {"username": "Stephan Schwahlen"}}, {"_id": "6b8nH2euwQGM3WhBi", "postedAt": "2024-02-08T10:18:00.223Z", "postId": "RRDAzpi6vS8ARvsDF", "htmlBody": "<p>Awesome, very exciting!</p>", "parentCommentId": null, "user": {"username": "mhendric"}}, {"_id": "izm4bGuo7N2SgwEMv", "postedAt": "2024-02-08T13:04:22.718Z", "postId": "RRDAzpi6vS8ARvsDF", "htmlBody": "<p>The focus on a particular country would make sense in the context of career or voting advice but seems very strange in the context of donations since money is mostly internationally fungible (and it's unlikely that Germany is currently the place where money goes furthest towards the goal of defending democracy). The limited focus might make strategic sense if you thought of this as something like an advertising campaign trying to capitalize on current media attention and then eventually divert the additional donors to less arbitrarily circumscribed cause areas (as suggested by your third bullet point), but I think that sort of relating to donors as customers to advertise to rather than fellow participants in collaborative truth-seeking risks undermining confidence in Effektiv Spenden and the principles that make EA work.</p><p>How would you handle it if your analysis reached the conclusion that the most effective pro-democracy intervention were donating to a particular political party or other not-fully-tax-deductible group? I'm not familiar with the details of German charity law but I would worry that recommending such donations might jeopardize Effektiv Spenden's own tax-deductible status, while excluding such groups (which seem more likely to be relevant here than for other cause areas) from consideration would further undermine the principle of transparently giving donors the advice that most effectively furthers their goals.</p>", "parentCommentId": null, "user": {"username": "lexande"}}, {"_id": "dv7XzDrEDpeiszMvb", "postedAt": "2024-02-08T14:36:45.594Z", "postId": "RRDAzpi6vS8ARvsDF", "htmlBody": "<p>Seems like we didn't articulate clearly enough why we exclusively focus on Germany at the moment.</p><p>I totally agree that it's very unlikely \"<i>that Germany is currently the place where money goes furthest towards the goal of defending democracy</i>\". Indeed we expect that <a href=\"https://powerfordemocracies.org/\"><u>Power for Democracies</u></a><u> will mostly (or exclusively) recommend charities not working in Germany in the future. Unfortunately Power for Democracies is currently still in its initial hiring round and probably won't produce any robust recommendation till 2025. The research that has been done in the last 2 years (and which let to the foundation of Power for Democracies) was mainly based on Germany though. Therefore we currently feel more comfortable recommending giving opportunities in Germany with regards to defending democracy but we try to make it clear that this is temporarily. Also we try to emphasize &nbsp;that the research our democracy donation fund is based on is not as good as the research other cause areas (that's also the reason we added a \"Beta\" label to the fund in our donation form).</u><br><br><u>With regards to your other point we expect to continue to limit ourselves to recommend giving opportunities that are tax exempt in the countries we are working in. E.g. we are also not recommending investment opportunities etc. even if that would potentially be more effective to reach our goals (like investing in AI companies etc.).</u><br><br>&nbsp;</p>", "parentCommentId": "izm4bGuo7N2SgwEMv", "user": {"username": "EA-Basti"}}, {"_id": "PtNAFWDQSgFjTAvEa", "postedAt": "2024-02-08T15:19:38.663Z", "postId": "RRDAzpi6vS8ARvsDF", "htmlBody": "<p>Just to add: the current momentum in Germany is driven by a desire to act and defend democracy <i>in Germany. (</i>Many of our donors are not part of the EA community and are not necessarily seeking the highest global impact in this context at the moment.)<br><br>So in the absence of robust analysis on where else donations would go furthest and which organizations promise the highest expected impact globally, providing some tentative guidance to donors now on how to increase the impact of their donations within Germany seems plausible to me in the current context, particularly given the emphasis we place on the differences in the robustness of the underlying research between the <i>Defending Democracy Fund</i> and our other cause areas. (In addition, Germany seems sufficiently relevant to me globally as a liberal democracy that a <i>temporary</i> focus in the current situation is justifiable.)<br><br>So hopefully, the current focus provides a good entry point for donors who are new to effective giving whom we can then guide to the place where money goes furthest towards the goal of defending democracy, once such recommendations are available, as well as to other cause areas.&nbsp;</p>", "parentCommentId": "dv7XzDrEDpeiszMvb", "user": {"username": "Sebastian Schienle"}}, {"_id": "q5cQBuyN2HgsJXM7v", "postedAt": "2024-02-09T19:19:17.897Z", "postId": "RRDAzpi6vS8ARvsDF", "htmlBody": "<p>I think it's important for EA to avoid partisan political fights like this - they're not neglected cause areas, and they're often not tractable.</p><p>It's easy for the Left to portray the 'far right' as a 'threat to democracy, in the form of 'fascist authoritarians'.&nbsp;</p><p>It's also easy for the Right to portray the 'far left' as a 'threat to democracy' in the form of 'socialist authoritarians'.</p><p>The issue of immigration (e.g. as considered by AfD) is especially tricky and controversial, in terms of whether increased immigration into Western democracies of people with anti-democratic values (e.g. fundamentalist religious values) would be a good or a bad thing.</p><p>So many political groups are already fighting over these issues. It would dilute EA's focus, and undermine our non-partisan credibility, to get involved in these things.</p>", "parentCommentId": null, "user": {"username": "geoffreymiller"}}, {"_id": "pG8PZyzCivWCrWDhv", "postedAt": "2024-02-10T11:09:34.772Z", "postId": "RRDAzpi6vS8ARvsDF", "htmlBody": "<p>Agreed. Being able to identify effective interventions that support or protect democracy in certain contexts doesn't necessarily seem like a bad idea.&nbsp;<br><br>The challenge with the AfD is that they seem to be the victims of behaviour that could be considered antidemocratic: lawmakers are <a href=\"https://www.reuters.com/world/europe/ban-afd-or-fight-it-germany-grapples-over-how-counter-far-right-2024-01-31/\">considering banning the party</a>, and the state has <a href=\"https://www.dw.com/en/germanys-far-right-afd-can-be-put-under-surveillance/a-61058359#:~:text=The%20far%2Dright%20populist%20Alternative,categorized%20as%20%22suspicious%20entity.%22\">put the party under surveillance</a>. This would be unconstitutional in many countries. I think there could be legitimate arguments that \"protecting democracy\" could sometimes involve defending groups like the AfD, as well as defending democracy from them.<br><br>I'd prefer for a politically neutral pro-democracy organisation to have the courage to defend a party like the AfD when their democratic freedoms are under threat, while also ensuring that they are stopped from damaging the democratic system. But, because this could be very messy, and have significant PR risks, I think EA-aligned groups just shouldn't be taking that risk either way.</p>", "parentCommentId": "q5cQBuyN2HgsJXM7v", "user": {"username": "Dzoldzaya"}}, {"_id": "hwDGBno2WxPd6mYeN", "postedAt": "2024-02-10T11:45:49.395Z", "postId": "RRDAzpi6vS8ARvsDF", "htmlBody": "<p>I think it's important that EA analysis not start with its bottom line already written. In some situations the most effective altruistic interventions (with a given set of resources) <i>will</i> have partisan political valence and we need to remain open to those possibilities; they're usually not particularly neglected or tractable but occasional high-leverage opportunities can arise. I'm very skeptical of Effektiv-Spenden's new fund because it arbitrarily limits its possible conclusions to such a narrow space, but limiting one's conclusions to exclude that space would be the same sort of mistake.</p>", "parentCommentId": "q5cQBuyN2HgsJXM7v", "user": {"username": "lexande"}}, {"_id": "Chys4TLnQi7iS4QQb", "postedAt": "2024-02-10T11:46:27.113Z", "postId": "RRDAzpi6vS8ARvsDF", "htmlBody": "<p>As I noted in my first comment, I think this sort of \"bait and switch\"-like advertising approach risks undermining the key strengths of EA and should generally be avoided. EA's comparative advantage is in being analytically correct and so we should tell people what we believe and why, not flatter their prejudices in the hopes that \"we can then guide to the place where money goes furthest\". I can see other potential benefits to Effektiv-Spenden or other EAs researching the effectiveness of pro-democracy interventions in Germany, but optimizing for that sort \"gateway drug\" effect seems likely to be net harmful.</p>", "parentCommentId": "PtNAFWDQSgFjTAvEa", "user": {"username": "lexande"}}, {"_id": "ZNmDh4f5BGzesvwFX", "postedAt": "2024-02-10T13:31:39.274Z", "postId": "RRDAzpi6vS8ARvsDF", "htmlBody": "<p>I strongly agree with <a href=\"https://forum.effectivealtruism.org/users/lexande?mention=user\">@lexande</a>'s critical <a href=\"https://forum.effectivealtruism.org/posts/RRDAzpi6vS8ARvsDF/introducing-the-effektiv-spenden-defending-democracy-fund?commentId=izm4bGuo7N2SgwEMv\">comments</a> about the general strategy behind this fund.</p><p>A further point I am rather confused about concerns the following paragraph:</p><blockquote><p>To respond to the current surge of interest and momentum among both the general public in Germany and our donors, we feel a responsibility to share our initial findings - with all their limitations - in order to guide donors interested in supporting promising interventions that can make a difference in the short term in the specific German context. Therefore, we have launched a new fund called&nbsp;<a href=\"https://effektiv-spenden.org/demokratie-verteidigen\"><i><u>\"Defending Democracy\"</u></i></a> on <a href=\"https://effektiv-spenden.org/\">effektiv-spenden.org</a>.</p></blockquote><p>I'm not sure I can follow the logic here: Feeling a \"(...) responsibility to share (...) initial findings - with all their limitations - in order to guide donors (...)\" is an argument for publishing those findings, and it's hard for me to see how this necessitates the launch of the fund itself. Could maybe one of the authors give some context on the reasons behind going for a fund instead of solely publishing (preliminary) findings?&nbsp;</p>", "parentCommentId": null, "user": {"username": "MRo"}}, {"_id": "hLZFYTufZcACGeyET", "postedAt": "2024-02-10T15:06:00.145Z", "postId": "RRDAzpi6vS8ARvsDF", "htmlBody": "<p>I would be interested in something like this existing for Israel</p>\n", "parentCommentId": null, "user": {"username": "hibukki"}}, {"_id": "xFq2wNrDRgPQTFtjm", "postedAt": "2024-02-12T17:43:38.804Z", "postId": "RRDAzpi6vS8ARvsDF", "htmlBody": "<p>Thanks for clarifying, Sebastian.</p><blockquote><p>Indeed <strong>we expect that </strong><a href=\"https://powerfordemocracies.org/\"><strong><u>Power for Democracies</u></strong></a><strong><u> will mostly (or exclusively) recommend charities not working in Germany in the future</u></strong><u>. Unfortunately Power for Democracies is currently still in its initial hiring round and probably won't produce any robust recommendation till 2025. </u><strong><u>The research that has been done in the last 2 years (and which let to the foundation of Power for Democracies) was mainly based on Germany though</u></strong><u>. Therefore we currently feel more comfortable recommending giving opportunities in Germany with regards to defending democracy but we try to make it clear that this is temporarily.</u></p></blockquote><p><u>I am a little confused by what I highlighted above. I would have expected your research to focus on charities working outside of Germany given you expect to mostly recommend such charities.</u></p>", "parentCommentId": "dv7XzDrEDpeiszMvb", "user": {"username": "vascoamaralgrilo"}}, {"_id": "iEhCahGeDx4zoBguR", "postedAt": "2024-02-12T21:11:25.241Z", "postId": "RRDAzpi6vS8ARvsDF", "htmlBody": "<p>I didn't do the research and I don't want to speculate to much, but I think most if not all charity evaluators initially had some kind of bias towards organizations based in the same country as their research staff. One obvious reason is that it's just easier because you don't have to start completely from scratch (especially relevant if resources are very limited).</p>\n<p>Future research of Power for Democracies will be less funding restrained and can therefore be more ambitious.</p>\n", "parentCommentId": "xFq2wNrDRgPQTFtjm", "user": {"username": "EA-Basti"}}, {"_id": "7YaoNJipWvykhqYET", "postedAt": "2024-02-12T21:28:51.864Z", "postId": "RRDAzpi6vS8ARvsDF", "htmlBody": "<p>Might not convince you but afaik the effective giving space (GWWC, TLYCS, Effektiv Spenden and others ) has experienced basically zero or even negative growth in the last 2 years.<br><br>AMF is even <a href=\"https://www.againstmalaria.com/FinancialInformation.aspx\">down more than 50% year over year</a> and in general there are probably few if any markets where effective giving has reached even 0.1% of all donations.<br><br>I consider this extremely disappointing and that's why I'm open to experiments on how to reach (much) more people.<br><br>Besides there are many people in EA who believe that money directed at avoiding x-risks will go &gt; 10x further than trying to fight extreme poverty. Might be true but I still don't think we should get rid of all the GiveWell recommended charities on Effektiv Spenden (probably even for their instrumental value alone).</p>", "parentCommentId": "Chys4TLnQi7iS4QQb", "user": {"username": "EA-Basti"}}, {"_id": "xvfYRMDeitjFA8w6Q", "postedAt": "2024-02-12T21:32:56.040Z", "postId": "RRDAzpi6vS8ARvsDF", "htmlBody": "<p>I'm not in the lead with regard to the research but one advantage of the fund is that we can take room for more funding into account. E.g. we think very highly of <a href=\"https://correctiv.org/\">CORRECTIV</a> but since they recently got a lot of (well deserved) attention their room to use additional funds might be limited very soon (might already be the case).</p>", "parentCommentId": "ZNmDh4f5BGzesvwFX", "user": {"username": "EA-Basti"}}, {"_id": "burXiQCDYhjYL7p2p", "postedAt": "2024-02-12T21:38:43.442Z", "postId": "RRDAzpi6vS8ARvsDF", "htmlBody": "<p>I agree that there are some interventions like calling for the banning of a certain party might be net negative, even if they seem appealing at first sight. I also think that it can be possible and laudable to defend the rights of people you strongly disagree with like <a href=\"https://www.aclu.org/wp-content/uploads/legal-documents/4156_ri_1978.pdf\">the ACLU does </a>(or used to do -&gt; haven't really followed them lately)</p>", "parentCommentId": "pG8PZyzCivWCrWDhv", "user": {"username": "EA-Basti"}}, {"_id": "ffmXnJgwLTwSJpxzT", "postedAt": "2024-02-12T21:45:33.238Z", "postId": "RRDAzpi6vS8ARvsDF", "htmlBody": "<p>Just to make sure I understand you correctly: Where or how exactly do you think we \"arbitrarily limit\" ourselves or our fund (besides planning to continue to comply with the applicable non-profit laws in the countries we are working in)?</p>", "parentCommentId": "hwDGBno2WxPd6mYeN", "user": {"username": "EA-Basti"}}, {"_id": "JYEFzPHwbi9odEEbB", "postedAt": "2024-02-13T10:54:09.924Z", "postId": "RRDAzpi6vS8ARvsDF", "htmlBody": "<p>Hi, I am Director of Technology at Effektiv Spenden. Thanks for your comments, we appreciate having a discussion on this!<br><br>I wanted to point out that describing our approach as \"bait and switch\" is not correct IMO, nor that we somehow do not tell people \"what we believe and why\". Here is what we currently write on <a href=\"https://effektiv-spenden.org/demokratie-verteidigen/\">our website</a>:</p><blockquote><p>As external analyses and evaluations of the same quality and depth are not yet available in the area of democracy as in our other areas, the effectiveness of the measures we recommend and promote is subject to greater uncertainty than our other recommendations. Nevertheless, the urgency demands that we act now - and not later. We have therefore decided to mark the qualitative difference between the Defending Democracy Donation Fund and our other funds with a \"beta\" status.<br>...<br>In the medium term, we plan to expand our donation fund in close coordination with Power for Democracies to include particularly promising initiatives to protect and strengthen democracy worldwide. This year, however, the focus remains on defending and strengthening democracy in Germany.</p></blockquote><p>Similarly in a newsletter we wrote: \"We do not expect truly robust donation recommendations before 2025\".<br><br>So we make clear that (i) this recommendation isn't as robust as others and that (ii) the scope is limited to Germany, but that this is a temporary limitation.&nbsp;</p>", "parentCommentId": "Chys4TLnQi7iS4QQb", "user": {"username": "Sebastian"}}, {"_id": "g5F4TNAWvRGxwqeL8", "postedAt": "2024-02-13T13:11:50.582Z", "postId": "RRDAzpi6vS8ARvsDF", "htmlBody": "<blockquote><p>lawmakers are <a href=\"https://www.reuters.com/world/europe/ban-afd-or-fight-it-germany-grapples-over-how-counter-far-right-2024-01-31/\">considering banning the party</a>, and the state has <a href=\"https://www.dw.com/en/germanys-far-right-afd-can-be-put-under-surveillance/a-61058359#:~:text=The%20far%2Dright%20populist%20Alternative,categorized%20as%20%22suspicious%20entity.%22\">put the party under surveillance</a>. This would be unconstitutional in many countries.&nbsp;</p></blockquote><p>It might be worth pointing out to others reading this who aren't aware that the banning of parties constituting a threat to the constitution is constitutional &nbsp;in Germany. It was enshrined in the German Basic Law to prevent repeating the mistakes of the Weimar Republic.&nbsp;<br><br>(This is not to say that banning the AfD is a good idea, I am personally sceptical about this.)</p>", "parentCommentId": "pG8PZyzCivWCrWDhv", "user": {"username": "Sebastian"}}, {"_id": "JHysz4QgnZnCJMme7", "postedAt": "2024-02-13T15:24:21.025Z", "postId": "RRDAzpi6vS8ARvsDF", "htmlBody": "<p>EDIT: Retracted, see point below (misunderstood the linked data). Thanks for pointing this out!</p>\n<p>I’m not sure I completely understand the full accounting shown in your link to the AMF page, but from what I get the example you gave looks misplaced:\nIndeed, 2023 seemed to have marked a reduction by more than 50% of the incoming funds, but the two years prior to that show substantial increases (and before that another drop; maybe CoViD-related?); moreover, 2024 seems to become again a year of strong increase (already at 50% of 2023 funds in YTD). Maybe I’m misunderstanding something here, but at least this example seems to be in contradiction to the general pessimistic outlook in the first two paragraphs of your answer.</p>\n", "parentCommentId": "7YaoNJipWvykhqYET", "user": {"username": "MRo"}}, {"_id": "BS9jy4NebH9ruamoi", "postedAt": "2024-02-13T17:50:54.762Z", "postId": "RRDAzpi6vS8ARvsDF", "htmlBody": "<p>My objection is not primarily to what Effektiv-Spenden itself published but to the motivation that Sebastian Schienle articulated in the comment I was replying to. As I said there are potentially good reasons to publish such research, I just think \"trying to appeal to people who don't currently care about global effectiveness and hoping to redirect them later\" is not one of them.</p><p>(I think ideally Effektiv-Spenden would do more to distinguish this from other cause areas, \"beta\" seems like an understatement, but I wouldn't ordinarily criticize such web design decisions if there weren't people here in the comments explicitly saying they were motivated by manipulative marketing considerations.)</p>", "parentCommentId": "JYEFzPHwbi9odEEbB", "user": {"username": "lexande"}}, {"_id": "tYYzL6tFGvrnGrgD2", "postedAt": "2024-02-13T18:01:52.576Z", "postId": "RRDAzpi6vS8ARvsDF", "htmlBody": "<p>I mostly meant the fact that it's currently restricted to Germany, though also to some extent the focus on interventions that fit into currently-popular anti-AfD narratives over other sorts of governance-improvement or policy-advocacy interventions (without clear justification as to why you believe the former will be more effective).</p>", "parentCommentId": "ffmXnJgwLTwSJpxzT", "user": {"username": "lexande"}}, {"_id": "3FQq3TF9bywPYowTe", "postedAt": "2024-02-13T19:05:20.936Z", "postId": "RRDAzpi6vS8ARvsDF", "htmlBody": "<p>Note that the page says<br>&gt; Our financial year runs from 1st July to 30th June, i.e. FY 2024 is 1st July 2023 to 30th June 2024.<br>so the \"YTD 2024\" numbers are for almost eight months, not two, and accordingly it looks like FY 2024 will have similar total revenue to FY 2023 (and substantially less than FY 2021 and FY 2022).</p>", "parentCommentId": "JHysz4QgnZnCJMme7", "user": {"username": "lexande"}}, {"_id": "jhq6zGYBM3kyPJK39", "postedAt": "2024-02-13T20:14:54.978Z", "postId": "RRDAzpi6vS8ARvsDF", "htmlBody": "<p>Fair point, thanks!</p>\n", "parentCommentId": "3FQq3TF9bywPYowTe", "user": {"username": "MRo"}}, {"_id": "zpycfDzKn8hr3vcd4", "postedAt": "2024-02-13T21:06:57.604Z", "postId": "RRDAzpi6vS8ARvsDF", "htmlBody": "<p>In the short run it's possible that posting recommendations about whatever causes are currently getting mainstream media attention might attract more donations. But in the long run it's important that donors be able to trust that EA evaltuators will make their donation recommendations honestly and transparently, even when that trades off with marketing to new donors. Prioritizing transparent analysis (even when it leads to conclusions that some donors might find offputting) over advertising &amp; broad donor appeal is a big part of the difference between EA and traditional charities like Oxfam.</p>", "parentCommentId": "7YaoNJipWvykhqYET", "user": {"username": "lexande"}}, {"_id": "cvsiwWkBLth2psmqP", "postedAt": "2024-02-14T09:39:48.579Z", "postId": "RRDAzpi6vS8ARvsDF", "htmlBody": "<p>I think it's useful to add some quantitative intuitions here:</p><p><strong>Quick BOTEC:</strong></p><ul><li>In the US there's a 50% chance a candidate not committed to democracy will become President, in Germany a party not being committed to democracy is part of the next government is very low, certainly not more than 0.5% (<strong>&gt;=100x</strong> difference). There are certainly other ways to think about this, but I think the basic captured intuition - despite all the turmoil the threat to German democracy is low, in absolute terms and comparatively - seems correct (and, indeed, the recent protests seem a vindication of that; there is now a strong pro-democracy response even absent EA funding)</li><li>US democracy is obviously much more important than German, by population this would be <strong>4x</strong>, if we think about other ways this matters (global signaling and erosion of norms etc) the difference would probably be somewhat larger still.&nbsp;</li><li>Much more money in US philanthropy so maybe funding additionality in US would be somewhat lower (<strong>/2x</strong>?)</li><li>Much more money in US philanthropy so maybe a <strong>/10x</strong> additional discount for lower neglectedness (less low hanging fruit left etc.)<br>&nbsp;</li><li>100*4/2*10 = <strong>20x differential in favor of US &gt; Germany</strong> even on assumptions that seem biased towards Germany</li><li>It seems likely one will get to <strong>similar differentials from non-Germany &gt; Germany</strong> in countries that are smaller but where democracy is threatened more than in the US and funding additionality and neglectedness are higher than in Germany.<br>&nbsp;</li></ul><p>Some implications of this:</p><ul><li>(1) It seems <strong>quite important</strong> to avoid lock-in to Germany. I know you talk about this, but initial grants (and then reporting on those grants) do set up expectations.</li><li>(2) <strong>Even with minimal or no research one could probably already make grants that would dominate a German portfolio of well-known German orgs</strong> (which the current recs are), e.g. picking the cursory best orgs one can support philanthropically as a foreigner in, say, US, Hungary, Turkey, etc.</li></ul>", "parentCommentId": null, "user": {"username": "jackva"}}, {"_id": "qi3kbXBJuCvbzmeye", "postedAt": "2024-02-14T10:17:02.307Z", "postId": "RRDAzpi6vS8ARvsDF", "htmlBody": "<p>\"Manipulative\" does not seem an apt description to me. Sebastian Schienle wrote:&nbsp;</p><blockquote><p>So hopefully, the current focus provides a good entry point for donors who are new to effective giving whom we can then guide to the place where money goes furthest towards the goal of defending democracy, once such recommendations are available, as well as to other cause areas.</p></blockquote><p>We are up front on our website about in the future probably giving money to organisations outside of Germany from this fund. With regard to other cause areas, I don't see anything dishonest about hoping that donors will look at other cause areas after entering through a specific one.&nbsp;</p>", "parentCommentId": "BS9jy4NebH9ruamoi", "user": {"username": "Sebastian"}}, {"_id": "yGL2EnNEh4KL5oDZq", "postedAt": "2024-03-08T15:34:00.534Z", "postId": "RRDAzpi6vS8ARvsDF", "htmlBody": "<p>I want to share a concern that hasn't been raised yet: this seems like a huge conflict of interest.</p>\n<p>From the Power for Democracies <a href=\"https://powerfordemocracies.org/\">website</a>:</p>\n<blockquote>\n<p>Power for Democracies was founded in 2023 by Markus N. Beeko (the former Secretary General of Amnesty International in Germany) together with <strong>Stefan Shaw and Stephan Schwahlen, the founders of the philanthropy advisory legacies.now and co-founders of <a href=\"http://effektiv-spenden.org\">effektiv-spenden.org</a>.</strong> Power for Democracies is funded by small family foundations and individuals from Germany and Switzerland who wish to make an effective contribution in support of liberal democracies worldwide.</p>\n</blockquote>\n<p>And then, the Protect Democracy fund is listed simply with the other charity options at the Spenden (Giving) <a href=\"https://effektiv-spenden.org/spenden-deutschland/\">page</a>, with only the small Beta label and this explanation under 'more info':</p>\n<blockquote>\n<p>With our donation fund \"Defend Democracy,\" we support organizations that we consider particularly suitable to bolster the resilience of democracy. In doing so, we are initially focusing exclusively on Germany. Due to the less robust research in this area, the measures funded here are still associated with more uncertainty.</p>\n</blockquote>\n<p>I understand why you want to start a democracy charity evaluator. I think it's an interesting experiment in trying to create more leverage in other movements and create a large impact. I also understand the desire to use your platform to support this project.</p>\n<p>However, I find the current situation inappropriate. Your role is to recommend independently-vetted highly effective projects. This is a large responsibility and requires outstanding integrity. You cannot use this reputation to support your own spin-off in this way without making a much clearer distinction between it and the other options.</p>\n<p>I can see another situation working, where the Project Democracy fund is <strong>clearly separated</strong> from the other options (i.e. not in the same list) and where your conflicts of interest are clearly stated (e.g. in a disclaimer at the top).</p>\n<p>I also wonder whether you have a conflict of interest policy. If not, I recommend developing one.</p>\n", "parentCommentId": null, "user": {"username": "SiebeRozendal"}}]