[{"_id": "Hyy6yuajn6CsH2ybt", "postedAt": "2023-05-31T22:19:48.244Z", "postId": "RRm8vnmwjWK24ung2", "htmlBody": "<p>It might seem daunting for Global Health people to confront a big lobby while there are seemingly easier interventions with less resistance around.</p>\n<p>From the vantage point of an animal activists it's not that daunting though. I am relatively certain that it's easier than e.g. to go against the factory farming lobby. At least it's so much common sense that it should be possible to convince the rational parts of government - increasing both public health and tax returns. Concerns arise around corruption but if you encounter too much of that you could simply switch intervention countries.</p>\n<p>Looking at scale and neglectedness, tobacco taxation seems just too important to shy away from the challenge.</p>\n", "parentCommentId": null, "user": {"username": "Jonas Becker"}}, {"_id": "jMReHmdtbsZgjn2Ta", "postedAt": "2023-06-01T17:22:35.954Z", "postId": "RRm8vnmwjWK24ung2", "htmlBody": "<p>It seems unlikely that the decrease in tobacco-related harm is strongly proportional to the reduction in tobacco consumption. I base this on an <a href=\"https://www.ahajournals.org/doi/10.1161/CIRCULATIONAHA.109.904235?url_ver=Z39.88-2003&amp;rfr_id=ori:rid:crossref.org&amp;rfr_dat=cr_pub%20%200pubmed\">article in Circulation</a> about the adverse health effects of light or intermittent smoking. In particular:</p><blockquote><p>Light and intermittent smoking carry nearly the same risk for cardiovascular disease as daily smoking. The dose-response relationship between tobacco exposure and cardiovascular mortality is highly nonlinear. . . . [L]ow levels of tobacco exposure as seen in light smoking (4 to 7 cigarettes per day) has ≈70% of the effect of heavy smoking (≥23 cigarettes per day).</p></blockquote><p>(footnotes omitted).</p>", "parentCommentId": null, "user": {"username": "Jason"}}, {"_id": "CaEdn9AYHhZSiziKP", "postedAt": "2023-06-01T18:59:27.860Z", "postId": "RRm8vnmwjWK24ung2", "htmlBody": "<p>Reduction in consumption can be both an individual and societal measure and measured via both outright quitting and reduction of cigarettes consumed per day (to a non-zero number). My focus here is on quitting at the societal level and I have been basing it on using price elasticity to measure taxation’s effects on population prevalence of smoking, which would be unaffected by your concerns.</p><p>However, I dug deeper into the mechanics of these price elasticities numbers, and it appears some can be measures of cigarette sales (i.e. general reduction of consumption) and others measures of smoking prevalence in the population (i.e. quitting or not initiating).</p><p>I am still working my way through this information, so I don’t have a full informed view yet, but here (at the bottom of this comment) are some things that caught my eye in the NIH’s Tobacco Control Monograph’s section on “Using Price Elasticity Estimates to Project the Future Impact of Tobacco Tax Increases.”</p><p>This has important implications because:</p><ul><li>Charity Entrepreneurship’s model (which mine and Moritz’s is based off of) translates price elasticity into a reduction of consumption which is then translated 1:1 for reduction in prevalence.</li><li>Open Philanthropy’s model (which also uses hinges on price elasticity) assumes the reduction in consumption has 1:1 effect with reduction in DALYs.</li></ul><p>So the CE model is solid so long as the median price elasticity used (for LMICs) reflects the average of price elasticities calculated on prevalence.</p><p>Both models are vulnerable regardless to overestimating the DALYs averted from prevalence change if the people that go onto quit/not initiate were disproportionately less of the DALY burden. A reason to believe that was the case is that <a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4601132/#:~:text=Discussion,benefits%20both%20reduction%20and%20cessation\">smokers that smoke less cigarettes are more likely to quit</a>. (This though is also reason to be less concerned with your original point about the nonlinear association between harm and consumption i.e. even if they don’t quit, taxes put them in a closer position to quitting in the future)</p><p>However, buffering the above for the CE model is that it’s not capturing DALYs averted for reduced consumption that is short of quitting—a source of underestimating the impact.</p><p>The Open Phil model has issues regardless because it applies reduction in consumption to 1:1 reduction in DALYs without mapping out quit/prevalence rates, which as you rightly point out are likely not interchangeable with just reducing the non-zero amount you smoke each day.</p><p>And both models might have significant overestimation if their price elasticity numbers are reflections of cigarette sales instead smoking prevalence.<br><br><br><strong><u>Quotes of interest from the monograph</u></strong><br><br>These and other projections generally start with the overall price elasticity of cigarette demand<strong>, typically obtained from econometric estimates based on tax-paid cigarette sales data</strong>, and assume that the tax increase being modeled will be fully passed on to consumers in the price paid for cigarettes.</p><p>It is also important to <strong>use both adult and youth prevalence elasticities</strong> in projecting the public health impact of a cigarette tax increase because youth and adults are not equally price sensitive.</p><p>Similarly, <strong>adult and youth prevalence elasticities are used</strong> in projecting the public health impact of a cigarette tax increase. Given the available estimates, many of these projections assume that the impact on adult prevalence is half of the overall elasticity and that youth uptake of tobacco use is two to three times as responsive to price. When projecting the impact on youth, these projection models often assume that young people will take up smoking at the same rate as adults or young adults have. Continuing the example above, if the state has one million adults and adult smoking prevalence is 20% (200,000 adult smokers), the US$ 1.00 tax increase <strong>will reduce the prevalence of adult smoking by 4%, or induce 8,000 adult smokers to quit smoking.</strong> If there are 500,000 young people in the state, and it is assumed that they will take up smoking at the same rate as adults have and youth smoking is twice as sensitive to price, then the US$ 1.00 tax increase maintained over time in real terms <strong>will prevent 8,000 young people from taking up smoking.</strong><br><br><strong>Econometric studies of the impact of tax and price on tobacco use employ two primary measures of tobacco use: (1) macro-level aggregate measures of consumption, such as country-level data on tobacco sales&nbsp;</strong>(this literature developed earlier, growing rapidly before the 1990s); <strong>and (2) household or individual-level data taken from surveys, such as national surveys of drug use or health risk behavior.</strong></p><p>Additionally, studies have assessed the impact of tax and price on specific outcomes, such as prevalence of tobacco use, smoking cessation, initiation of smoking by youth, cross-price elasticity, and <strong>health outcomes.</strong></p>", "parentCommentId": "jMReHmdtbsZgjn2Ta", "user": {"username": "Yelnats T.J."}}, {"_id": "gHrtGevruRFFjr24L", "postedAt": "2023-06-02T06:31:00.944Z", "postId": "RRm8vnmwjWK24ung2", "htmlBody": "<p>I'm very excited about this intervention! Look forward to the discussion.</p>", "parentCommentId": null, "user": {"username": "Mandy Carter"}}, {"_id": "jjAnRt3pYPFM3brAJ", "postedAt": "2023-06-02T22:25:00.715Z", "postId": "RRm8vnmwjWK24ung2", "htmlBody": "<p>Great post J.T.! A few things I would like addressed for me to buy this more.</p><ol><li>Effect on the healthcare system. Tobacco smoking probably saves a lot of healthcare dollars... by killing the person a bit earlier and thus they consume less healthcare over their life (particularly when they are no longer contributing to the tax base. <a href=\"https://www.kff.org/report-section/the-rising-cost-of-living-longer-introduction/).\">https://www.kff.org/report-section/the-rising-cost-of-living-longer-introduction/).</a> This isn't super well accounted for in many sources</li><li>If they aren't included in CEAs, I'd like to see some analysis done on the increase in black market tobacco sales that are likely. If you increase taxes enough, this often results in black market increase which I expect to be more prevalent in LMICs.</li><li>I would like to see an account of deaths that are caused by smoking vs. a contributing cause. The WHO and CDC will often fudge/juice numbers to advocate for certain outcomes. I expect this to be difficult to do.</li><li>Factor in that a death from smoking will be from someone who is older than someone who died of malaria (this is factored into DALYs but not the GWWC report for \"lives saved\")</li><li>This will probably be minor but factor in the poorer economics of the country from the higher taxation.</li></ol>", "parentCommentId": null, "user": {"username": "MarcusAbramovitch"}}, {"_id": "PMk9R6hoZcWsHZMwg", "postedAt": "2023-06-03T01:26:28.422Z", "postId": "RRm8vnmwjWK24ung2", "htmlBody": "<p>There is a net financial effect on public expenditures due to premature death from smoking, but it's overwhelmingly to the old-age pension system, not to the healthcare system. It's possible this is different in LMICs, though.</p><p>https://bmjopen.bmj.com/content/2/6/e001678</p>", "parentCommentId": "jjAnRt3pYPFM3brAJ", "user": {"username": "Jason"}}, {"_id": "axRswiY9xDjmfu865", "postedAt": "2023-06-03T03:36:56.735Z", "postId": "RRm8vnmwjWK24ung2", "htmlBody": "<p>Here are some quick things and not a full response:</p><p>&nbsp;</p><ol><li>That's what you would think but I was actually reading today (<a href=\"https://www.theguardian.com/news/2016/aug/01/the-doctor-who-beat-big-tobacco\">link</a>) that it has gotten more costly which has changed the calculus for some insurance companies and made them willing to divest from tobacco. Here is the trend: lung cancer used to be a quick death, but medical advances in palliative care now give patients the opportunity to live much longer whilst regularly undergoing intensive medical procedures (e.g radiation treatment)</li><li>So I think it’s an okay question on if black market effects have a significant enough effect that it should be modeled into the CEA. However, this is a different question than if there is reason to believe that black market effects would knock the intervention’s cost-effectiveness down a whole tier, which I believe the answer is no. The experts have been clear that no black-market effects come close to offsetting the benefits of reduced consumption from taxation. Also, taxes/price are not the primary determinant of black market (<a href=\"https://www.cgdev.org/sites/default/files/CGD-Policy-Paper-62-Savedoff-Alwang-Best-Health-Policy-Tobacco-Tax.pdf\">Savedoff citing others, 2015</a>).<ol><li>We could imagine a situation where the effects of the black market would not conform to those studies e.g. 300% price hike in a state with no import controls. However, I don’t think an EA tobacco taxation, or any other serious tobacco control org, would put itself in that position.</li><li>I think the concerns about black market effects are gonna be consequential, not in the worthiness of the intervention, but in which state to pursue. For example, we know that two variables that affect the prevalence of black market is the price differential between bordering states and how effective a state’s import controls.</li><li>If I had more time, I’d write about the value of getting these laws on the books in countries in SSA that are weaker states (but will hopefully develop state capacity over time) whilst tobacco companies aren’t as focused there and before these get a new generation hooked like they have in other emerging markets e.g. SE Asia</li></ol></li><li>So if I understand you right, disentangle tobacco deaths from things that can be double counted like a smoker that died from COVID, which might get marked in both camps?</li><li>Yah I hear you on this. The GWWC number is exciting, but the intervention should be proven on a DALY standard, which I think it has notwithstanding someone finding a big hole in it.</li><li>I am not sure what you mean by this one. If you mean concern about it being a regressive tax, then I’d agree (more so than the black market concern) that this should be in a CEA. However, I again don’t expect it to drastically change the cost-effectiveness. Poorer people are more price sensitive and disproportionately reap more benefits from reduced consumption due to taxation than wealthier classes. I think the <a href=\"https://pubmed.ncbi.nlm.nih.gov/16959391/\">Liu 2006 study</a> observes what is intuitive to us all—tobacco consumption increases poverty across a society.<ol><li>If you are talking about the economy in general, then you’d need to elaborate more. Aside from tobacco being a substantial strain on the economy, the taxes on it generate great revenue for poorer governments.</li><li>Case study: Columbia tripled their tobacco tax from 2016 to 2018 and over that time consumption of tobacco fell by a third and their national health service doubled its funding with that tax.</li></ol></li></ol><p>&nbsp;</p><p>I realize these thoughts were not as quick as I planned. But I hope that’s useful for a first pass. Thanks for bringing those points up</p>", "parentCommentId": "jjAnRt3pYPFM3brAJ", "user": {"username": "Yelnats T.J."}}, {"_id": "2gmTrKBwEiMMnJpk2", "postedAt": "2023-06-03T17:12:14.379Z", "postId": "RRm8vnmwjWK24ung2", "htmlBody": "<p>Great response J.T. This was me saying \"I want these things thought about in a CEA that I suspect might not have been.\" I actually think this is quite promising.</p><p>For 1, divestment in this case means nothing IMO. Divestment is mainly a signalling thing. It doesn't really do anything to reduce stock price for example. <a href=\"https://forum.effectivealtruism.org/topics/divestment\">https://forum.effectivealtruism.org/topics/divestment</a><br><br>For 2, I don't think this is something to just dismiss without calculations</p><p>For 3, yes. If someone died of coronary heart disease, there was a decent chance that they would get it without smoking. Or they had lung cancer and diabetes, there needs to be some factor you attribute to each, not just \"they died of lung cancer from smoking\" which is what happens in these organizations.&nbsp;</p><p>For 5, I'm concerned generally that LMIC have corrupt governments who, when they get more money, is actually net negative. I'm concerned about this as well in developed countries if they use it to start wars, etc. as well.</p><p>On the whole, I think this is still likely to come out as a strong intervention. I'm still more skeptical of policy changes and I think we likely over-estimate their odds of success but this still seems well worth trying.</p>", "parentCommentId": "axRswiY9xDjmfu865", "user": {"username": "MarcusAbramovitch"}}, {"_id": "wT2d3RZ6wDfPhZk2M", "postedAt": "2023-06-05T19:06:06.034Z", "postId": "RRm8vnmwjWK24ung2", "htmlBody": "<p>Hi, J.T.,</p><p>As shown by the research conversation notes you link to, GiveWell lightly explored funding tobacco control policy advocacy in the past. Ultimately we decided to focus on other policy areas (alcohol policy, lead exposure, and self-harm from pesticide ingestion) that appeared more neglected. You can read more about our public health regulation research on <a href=\"https://www.givewell.org/research/public-health-regulation-update-August-2021\">this page</a>—see \"Cause areas we investigated at a shallow level and deprioritized,\" and <a href=\"https://docs.google.com/spreadsheets/d/1x3bW8NbGtpyYUidJ09m5W1KzoqoJHQWScuPd_bpFSmw/edit#gid=1982193194&amp;range=A6:I6\">this spreadsheet</a>, linked from footnote 24, which gives our estimates of how much is spent on tobacco policy (and other causes we looked into) per unit of burden. &nbsp;</p><p>Thank you for the thought-provoking post!</p><p>Best,</p><p>Miranda Kaplan<br>GiveWell Communications Associate</p>", "parentCommentId": null, "user": {"username": "GiveWell"}}, {"_id": "ZLQRMszsf8Ha6XLcQ", "postedAt": "2023-06-06T05:48:22.628Z", "postId": "RRm8vnmwjWK24ung2", "htmlBody": "<p>Thanks for those links; very interesting.</p><p>Is there a reason financial burden was only calculated for lead? This seems very applicable to alcohol and tobacco (as well as others on the list) which have studies (like ones I mentioned) that quantify things like lost productivity, income displacement, individual and societal healthcare costs, etc?</p><p>(not saying it would have changed GiveWell's prioritization, but it seems like relevant info)</p>", "parentCommentId": "wT2d3RZ6wDfPhZk2M", "user": {"username": "Yelnats T.J."}}, {"_id": "vKhbdvmdrfqrnYQxG", "postedAt": "2023-06-22T10:54:39.120Z", "postId": "RRm8vnmwjWK24ung2", "htmlBody": "<p>Hi, J.T.,</p><p>Sorry for the delay in getting back to you!&nbsp;</p><p>In an ideal world, we would have included financial burden for tobacco in these rough calculations (which were mostly intended to narrow down what we'd focus on in our initial foray into public health regulation grants). But essentially, the last line of your response is the answer: because <a href=\"https://docs.google.com/document/d/1hOQf6Ug1WpoicMyFDGoqH7tmf3Njjc15Z1DGERaTbnI/edit\"><u>we value children's lives so highly</u></a>, we expected that incorporating the financial burden of tobacco use would not be enough for us to prioritize it over lead. Lead specifically affects young children, and the gap in estimated spend per unit of burden ($0.07 for lead versus $0.24 for tobacco) is large. If we were doing a deeper investigation of tobacco policy as a possible funding area, we would aim to more thoroughly account for its harms.&nbsp;</p><p>Best,</p><p>Miranda</p><p><br>&nbsp;</p>", "parentCommentId": "ZLQRMszsf8Ha6XLcQ", "user": {"username": "GiveWell"}}, {"_id": "dTvDaCnvdAov4bhx8", "postedAt": "2023-06-22T23:02:36.354Z", "postId": "RRm8vnmwjWK24ung2", "htmlBody": "<p>HI!</p><p>I have doubts about the following two points, I would love to hear your point of view.<br>1. Tobacco taxation leads to the diversion of significant sums of money to the State budget. We have no control over how these resources will be used, whether they will produce more good or evil.<br>2. For poorer households, tobacco taxes may not be significant enough to give up smoking, and the only thing they will lead to is a reduction in the budget for other more important areas (healthy eating, spots, drugs, etc.)</p>", "parentCommentId": null, "user": {"username": "Michał Rościszewski"}}]