[{"_id": "L5K6RGDDSkfcktsGN", "postedAt": "2022-10-11T00:24:40.165Z", "postId": "RScaAGSG3M3c8vgir", "htmlBody": "<p>Sent this to a friend building a career plan immediately. Fantastic post.</p><p>Update: Friend said \"Wow, awesome article. That really was comforting.\"</p>", "parentCommentId": null, "user": {"username": "Emily Dardaman"}}, {"_id": "kFNeyJv4TchQdFYxn", "postedAt": "2022-10-11T02:15:36.676Z", "postId": "RScaAGSG3M3c8vgir", "htmlBody": "<blockquote><p>I am as absurd a character as those in story books. My struggles are grandiose, my errors obvious to the reader and my victories are significant. If I really manage a fraction of what I set out to do, I should celebrate with my friends. This is my character arc.</p></blockquote><p>I want to emphasize this particular part, because I want to reduce the risk that at least one person will leave before they see it.</p>", "parentCommentId": null, "user": {"username": "trevorw96"}}, {"_id": "WeYD8z8otvrksoGac", "postedAt": "2022-10-11T07:05:15.296Z", "postId": "RScaAGSG3M3c8vgir", "htmlBody": "<p>I like this a lot, the world is an absurd place, and consciously realizing this once in a while can&nbsp;be very soothing, freeing, and strangely motivating!<br>I've found the books by Kurt Vonnegut, especially Breakfast of Champions and Cat's Cradle supremely effective at reminding me of the glorious absurdity of civilization and the human experience and I try to re-read them semi-regularly for this reason. Big recommendation to anyone who wants to try a taste of realizing absurdity as it is described in this post but doesn't find it natural/easy to really viscerally see the world like that.</p>", "parentCommentId": null, "user": {"username": "timfarkas"}}, {"_id": "HDcfK7HXpBqN8gJvx", "postedAt": "2022-10-11T14:25:44.253Z", "postId": "RScaAGSG3M3c8vgir", "htmlBody": "<p>I think it's <em>completely absurd</em> that I started out going 'how can I do the most good' and ended up going 'I'm going to buy a bunch of ads on social media platforms' .... <strong>How</strong> did we get in this situation where that's a plausible, earnest answer to the question of how to do the most good??</p>\n", "parentCommentId": null, "user": {"username": "Bella_Forristal"}}, {"_id": "iT6NeC5DDKmfthKbp", "postedAt": "2022-10-11T20:21:34.041Z", "postId": "RScaAGSG3M3c8vgir", "htmlBody": "<p>This reminded me of this quote from Victor Frankl, \"The attempt to develop a sense of humor and to see things in a humorous light is some kind of a trick learned while mastering the art of living.\"</p>\n<p>When looking it up <a href=\"https://www.goodreads.com/quotes/1510460-the-attempt-to-develop-a-sense-of-humor-and-to\">here</a>, the tags made me laugh; \"tags: holocaust, humor, suffering\"</p>\n", "parentCommentId": null, "user": {"username": "squanchBrigade"}}, {"_id": "jja2hFeeBaeHsoJk3", "postedAt": "2022-10-11T22:01:14.579Z", "postId": "RScaAGSG3M3c8vgir", "htmlBody": "<p>Confronting <a href=\"https://forum.effectivealtruism.org/topics/cluelessness\">cluelessness</a> often reminds me of the <a href=\"https://bremeracosta.medium.com/parable-of-the-chinese-farmer-f012db83694d\">parable of the Chinese farmer</a>. I always imagine him breaking the fourth wall with a chuckle every time his neighbours say anything.</p><p>(Great post - first time I've bookmarked something on this forum.)</p>", "parentCommentId": null, "user": {"username": "Holly"}}, {"_id": "FPBBTy3v2mvsAJHbT", "postedAt": "2022-10-11T22:05:25.203Z", "postId": "RScaAGSG3M3c8vgir", "htmlBody": "<p>Reminds me of a line from my favourite movie scene:</p><blockquote><p>For life is quite absurd and death's the final word - you must always face the curtain with a bow.</p></blockquote>", "parentCommentId": "kFNeyJv4TchQdFYxn", "user": {"username": "Holly"}}, {"_id": "pXPcgdCsCpEigQkyp", "postedAt": "2022-10-12T08:58:51.862Z", "postId": "RScaAGSG3M3c8vgir", "htmlBody": "<p>For those who are curious on the parable of the Chinese farmer (text from link)</p><blockquote><p><i>Once upon a time there was a Chinese farmer whose horse ran away. That evening, all of his neighbors came around to commiserate. They said, “We are so sorry to hear your horse has run away. This is most unfortunate.” The farmer said, “Maybe.” The next day the horse came back bringing seven wild horses with it, and in the evening everybody came back and said, “Oh, isn’t that lucky. What a great turn of events. You now have eight horses!” The farmer again said, “Maybe.”</i></p><p><i>The following day his son tried to break one of the horses, and while riding it, he was thrown and broke his leg. The neighbors then said, “Oh dear, that’s too bad,” and the farmer responded, “Maybe.” The next day the conscription officers came around to conscript people into the army, and they rejected his son because he had a broken leg. Again all the neighbors came around and said, “Isn’t that great!” Again, he said, “Maybe.”</i></p><p><i>The whole process of nature is an integrated process of immense complexity, and it’s really impossible to tell whether anything that happens in it is good or bad — because you never know what will be the consequence of the misfortune; or, you never know what will be the consequences of good fortune.</i></p></blockquote><p>— Alan Watts retelling the parable</p>", "parentCommentId": "jja2hFeeBaeHsoJk3", "user": {"username": "nathan"}}, {"_id": "sk3J3btxJ9r5Rnchb", "postedAt": "2022-10-13T01:50:15.802Z", "postId": "RScaAGSG3M3c8vgir", "htmlBody": "<p>What is more absurd is we have very little time in this world and 99.99% of us waste it.</p>\n", "parentCommentId": null, "user": {"username": "Miguel"}}, {"_id": "CS8FjrXPr6sdy5nu8", "postedAt": "2022-10-13T12:36:35.446Z", "postId": "RScaAGSG3M3c8vgir", "htmlBody": "<p>Thank you Ollie for writing this post. It can be hard to find comfort when working on \"absurd\" projects, so your post helps.:)</p>", "parentCommentId": null, "user": {"username": "Theo K"}}, {"_id": "MtrW37cMijdgnK6Z5", "postedAt": "2022-10-13T13:34:54.661Z", "postId": "RScaAGSG3M3c8vgir", "htmlBody": "<p>I'm in the same situation, having finally gotten to &nbsp;One Step for Animals.&nbsp;</p>", "parentCommentId": "HDcfK7HXpBqN8gJvx", "user": {"username": "MattBall"}}, {"_id": "ezJKZGbK6FCypo77B", "postedAt": "2022-10-13T13:45:45.037Z", "postId": "RScaAGSG3M3c8vgir", "htmlBody": "<p>Happy with every effort to help &nbsp;reduce burnout. We would all do well to take ourselves a little less seriously. (I wish I had understood that decades ago.)</p>", "parentCommentId": null, "user": {"username": "MattBall"}}, {"_id": "hb6cmJ7oD4w2gx4oe", "postedAt": "2022-10-17T10:45:22.197Z", "postId": "RScaAGSG3M3c8vgir", "htmlBody": "<p>Thank you! For commenting and sharing :)&nbsp;</p>", "parentCommentId": "L5K6RGDDSkfcktsGN", "user": {"username": "OllieBase"}}]