[{"_id": "AXiyv3zdEGZrFJWok", "postedAt": "2023-10-02T14:04:14.421Z", "postId": "RueHqBuBKQBtSYkzp", "htmlBody": "<p>Thanks for this! I would like someone to be funded to regularly report on the funding landscape. Ideally, I'd like periodic reports providing simple graphics like those in <a href=\"https://forum.effectivealtruism.org/posts/vqPy7TkBbzrAkxCf7/updates-to-the-flow-of-funding-in-ea-movement-building-post\">here</a>. Data could be easily visualised and updated for free on Google Data Studio.<br><br><strong>Meta point:</strong><br>I think EA has a big blind spot about how information quality mediates the behavioural outcomes we want. As an example, we presumably want more people to set up EA organisations and apply to EA jobs etc. These people will care about the funding landscape when making decisions between career options. They will dislike uncertainty and be time poor. If we want to maximise the number who plan/execute career transitions we should therefore be thinking about maximising the quality of available information. However, we rarely seem to think about, or properly fund, these sorts of systems level improvements.</p>", "parentCommentId": null, "user": {"username": "Peterslattery"}}, {"_id": "MzL6FjnrhiedkBpGv", "postedAt": "2023-10-02T18:09:58.155Z", "postId": "RueHqBuBKQBtSYkzp", "htmlBody": "<p>Thank you Peter!<br><br>I agree, some kind of regular report would be useful. And definitely think they should include more graphics (erred on the side of getting this out there).<br><br>On your meta point, I would be curious to hear if you know of communities or similar that have better information quality, more effectively mediating sought-after behavioral outcomes? My feeling is that this indeed is very important, but rarely is invested in and/or done very well. It would be very interesting with some kind of survey mapping what (easy) system-level improvements/public goods the community would be most excited about (e.g. regular funding updates). &nbsp;</p>", "parentCommentId": "AXiyv3zdEGZrFJWok", "user": {"username": "Vilhelm Skoglund"}}, {"_id": "zwk9spapYxhiYYTBe", "postedAt": "2023-10-02T18:14:42.369Z", "postId": "RueHqBuBKQBtSYkzp", "htmlBody": "<p>Thanks for the post! This seems a useful summary, and I didn't spot anything that contradicted existing information I have (I didn't check very hard, so this isn't strong data)</p>\n", "parentCommentId": null, "user": {"username": "Neel Nanda"}}, {"_id": "c8avpzubms2YRPAHY", "postedAt": "2023-10-03T09:53:00.925Z", "postId": "RueHqBuBKQBtSYkzp", "htmlBody": "<p>Nice summarization post!<br><br>On the point of non-EA funders coming into the space, it's important to consider messaging -we don't want to come off as being alarmist, overly patronizing or too sure certain of ourselves, but rather as a constructive dialogue that builds some shared understanding of the stakes involved.&nbsp;<br><br>There also needs to be incentive alignment, which in the short-term might also mean collaborating with people on things that aren't directly X-risk related, like promoting ethical AI, enhancing transparency in AI development, etc.</p>", "parentCommentId": null, "user": {"username": "Heramb Podar"}}, {"_id": "ZHCjdCPL98dom9J6q", "postedAt": "2023-10-03T15:09:50.559Z", "postId": "RueHqBuBKQBtSYkzp", "htmlBody": "<p>Thank you!</p>", "parentCommentId": "zwk9spapYxhiYYTBe", "user": {"username": "Vilhelm Skoglund"}}, {"_id": "hdfJzCRBiceezErL7", "postedAt": "2023-10-03T15:14:17.255Z", "postId": "RueHqBuBKQBtSYkzp", "htmlBody": "<p>+1 on not being alarmist, overly patronizing, or too certain of ourselves.&nbsp;And to be clear I think this is about more than messaging! Also, agree that we need to be able to collaborate with people who have different prioritise, but think it is important with integrity, prioritising and not giving up too much.</p>", "parentCommentId": "c8avpzubms2YRPAHY", "user": {"username": "Vilhelm Skoglund"}}, {"_id": "Mk5v6jnr7qFa2wnfD", "postedAt": "2023-10-04T19:48:10.131Z", "postId": "RueHqBuBKQBtSYkzp", "htmlBody": "<p><a href=\"https://forum.effectivealtruism.org/users/vilhelm-skoglund-1?mention=user\">@Vilhelm Skoglund</a> Would you be able to share how much time it took to put together this report at this level of quality. Curious as to its \"costs\" should it be a regularly updated public good.</p>", "parentCommentId": "AXiyv3zdEGZrFJWok", "user": {"username": "raymundbermejo@gmail.com"}}, {"_id": "J7Cs5vdABFGgzbG2w", "postedAt": "2023-10-11T16:56:10.100Z", "postId": "RueHqBuBKQBtSYkzp", "htmlBody": "<p>I'm curating this post. I know you don't intend for it to be exhaustive, but it is nevertheless very thorough. I agree with <a href=\"https://forum.effectivealtruism.org/users/peterslattery?mention=user\">@PeterSlattery</a> that people considering founding/running orgs in these spaces would benefit from seeing this information, and I think you do a good job of presenting it.</p>", "parentCommentId": null, "user": {"username": "jpaddison"}}, {"_id": "kYfPdBf6udWkjfmoc", "postedAt": "2023-10-14T09:22:51.110Z", "postId": "RueHqBuBKQBtSYkzp", "htmlBody": "<p>Thank you for the encouraging words! Will consider doing this again in the future.</p>\n", "parentCommentId": "J7Cs5vdABFGgzbG2w", "user": {"username": "Vilhelm Skoglund"}}, {"_id": "sSQ7nGeAcwtJt3uRA", "postedAt": "2023-10-14T09:43:27.781Z", "postId": "RueHqBuBKQBtSYkzp", "htmlBody": "<p>Unfortunately I don't think anything I can say will be meaningful. Jona and I have spent alot of time (above 40 hours in total) trying understand funding flows and thinking about what might be particular needs atm. Also we had great help from Amber. Obviously you could do it with less effort than this. Best guess if I tried to 80/20 doing something similar in the future with some collection of feedback is 10-15 hours from me and 2 hours from feedback givers. But this is very crude.</p>\n", "parentCommentId": "Mk5v6jnr7qFa2wnfD", "user": {"username": "Vilhelm Skoglund"}}, {"_id": "hc4hChX4adGDHXgFC", "postedAt": "2023-10-14T21:37:50.732Z", "postId": "RueHqBuBKQBtSYkzp", "htmlBody": "<p>FWIW, I also think one key consideration is the likelihood of organizations providing updates and making sure the data means the same thing across organizations (see caveats in the report for more)</p>", "parentCommentId": "sSQ7nGeAcwtJt3uRA", "user": {"username": "Jona"}}]