[{"_id": "tXdjbzdswcHsLSAeJ", "postedAt": "2024-03-12T01:47:37.122Z", "postId": "RWxG3jGbkZzeHQsen", "htmlBody": "<blockquote><p>Katja and I date, so yes, I am biased, but I really think that’s a pretty unimportant fact about her</p></blockquote><p>Congrats to both of you on your great catches! Say hi to her for me - it's been a while :)</p>", "parentCommentId": null, "user": {"username": "Arepo"}}, {"_id": "pPen9fjnztQnw3fvX", "postedAt": "2024-03-12T12:17:04.364Z", "postId": "RWxG3jGbkZzeHQsen", "htmlBody": "<p>I had a mix of desires to up-vote and down-vote (I have done neither), which might possibly be helpful to express:</p><ul><li>Positive affect:<ul><li>I like Katja and appreciate her virtues</li><li>I think this is a good articulation of some under-appreciated things</li></ul></li><li>Negative affect:<ul><li>I have some generic distaste for public celebration of individuals; I think it's weaker for Katja than this would be for perhaps almost anyone (who's meaningfully \"still around\"), but it's still there</li><li>I might be miscalibrated, but I imagine this could be a bit hard to follow for people who don't know Katja, and I worry about it contributing to a feeling of the community being insular (especially if it's highly upvoted)&nbsp;</li></ul></li></ul>", "parentCommentId": null, "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "yLPGn6o3hzxEAK7Co", "postedAt": "2024-03-12T18:06:21.184Z", "postId": "RWxG3jGbkZzeHQsen", "htmlBody": "<p>I guess it helps balance out the denouncement posts.</p>", "parentCommentId": "pPen9fjnztQnw3fvX", "user": {"username": "Larks"}}, {"_id": "4H8DwbaSGRHjgBydr", "postedAt": "2024-03-12T19:53:34.100Z", "postId": "RWxG3jGbkZzeHQsen", "htmlBody": "<p>I quite liked it, but I'd happily give up praise posts if it meant not having the denouncement posts.&nbsp;</p>", "parentCommentId": "yLPGn6o3hzxEAK7Co", "user": {"username": "Sean_o_h"}}, {"_id": "i83bpFqzvhEhjJazG", "postedAt": "2024-03-12T21:42:29.382Z", "postId": "RWxG3jGbkZzeHQsen", "htmlBody": "<p>What are the advantages of fatebook.io over Metaculus / Manifold?</p>", "parentCommentId": null, "user": {"username": "pronotre"}}, {"_id": "DnANG9ctLkm9kb2GS", "postedAt": "2024-03-13T13:40:58.964Z", "postId": "RWxG3jGbkZzeHQsen", "htmlBody": "<p>I think in general people find it easier to notice criticisms of things than appreciate positives. But I think having more 'picking out surprising positives' is a useful way of learning, and in addition leads to a much more appreciative environment than picking out negatives.&nbsp;<br><br>I worry that we currently have overly high standards for writing about positives because in addition to it being kind of tricky to notice them, there are other difficulties around things like dislike of glorifying people. My guess is that we could create a happier, more collaborative community if we had slightly lower standards for appreciation / noticing the positives type discussions.</p>", "parentCommentId": "pPen9fjnztQnw3fvX", "user": {"username": "Michelle_Hutchinson"}}, {"_id": "DKTzNhwSKjHWR55GW", "postedAt": "2024-03-13T16:40:27.156Z", "postId": "RWxG3jGbkZzeHQsen", "htmlBody": "<p>The reason that I think some memetic immune response is appropriate to things of this shape is something like: if they became (semi-)normalized, it could become strategically correct for people trying to play social games to write puff pieces, and to get others to write puff pieces about them. I think it's better to live in a world where that isn't incentivized. So even though that isn't what I think is happening here, I don't think that will be reliably transparent to all readers, so I think it's maybe good for precedent-setting if the post gets some pushback on these grounds?</p>\n<p>That said, I do feel good about more appreciating-positive type discussions (and think my above comment may sound too negative on anything about celebrating good things). I just want people to find ways that don't also create the bad incentives. Things I think might be helpful for this: primarily celebrating virtues, but also naming multiple people who do a job embodying the virtue; marrying discussion of positives with negatives (something which this post did some, which helps); creating canonical times for low-key sharing of positives (so that there's less information carried in the speech act of sharing, and more in the content of what's shared).</p>\n", "parentCommentId": "DnANG9ctLkm9kb2GS", "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "6ZFDH8K4NaDkjfHsa", "postedAt": "2024-03-13T19:05:02.342Z", "postId": "RWxG3jGbkZzeHQsen", "htmlBody": "<p>Good point, I hadn't appreciated that. Thanks!&nbsp;</p><p>Those do seem like good compromises.</p>", "parentCommentId": "DKTzNhwSKjHWR55GW", "user": {"username": "Michelle_Hutchinson"}}, {"_id": "XxZF38qffLGJBRxzb", "postedAt": "2024-03-14T10:18:22.069Z", "postId": "RWxG3jGbkZzeHQsen", "htmlBody": "<p>I liked this post because I think it is helpful to especially give newcomers and outsiders a feeling that women, PoC, etc. also belong in EA and can reach positions of influence. I do also at the same time agree with other commenters about not focusing too much on people but rather ideas. Still I think Peter, Will, Toby, Nick etc. still get quite a lot of attention (even though I know at least some of them are trying to step away from the limelight!) and therefore that until that stops, it is net good to also highlight other people than white, male presenting people.<br><br>I should add that I would not have liked the post if I did not think Katja sounds like a fantastic person - it is not some pure \"affirmative action\"!</p>", "parentCommentId": null, "user": {"username": "Ulrik Horn"}}, {"_id": "dFTaxMwDAGuL7pn9b", "postedAt": "2024-03-14T16:07:45.249Z", "postId": "RWxG3jGbkZzeHQsen", "htmlBody": "<p>It's very easy to use for personal forecasts.</p>\n", "parentCommentId": "i83bpFqzvhEhjJazG", "user": {"username": "nathan"}}, {"_id": "bxbxL2GBfKgoSaKrS", "postedAt": "2024-03-14T21:47:07.147Z", "postId": "RWxG3jGbkZzeHQsen", "htmlBody": "<p>I agree it's sort of a red flag, but it seems relevant whether this <i>is</i> a puff piece, right?&nbsp;</p>", "parentCommentId": "DKTzNhwSKjHWR55GW", "user": {"username": "nathan"}}, {"_id": "gcwx9q2ZPk6ptoLio", "postedAt": "2024-03-14T21:48:09.124Z", "postId": "RWxG3jGbkZzeHQsen", "htmlBody": "<p>Though sometimes denouncement posts are net positive right? Like probably not the nonlinear one, but I guess more denouncement of SBF prior would have been good.&nbsp;</p>", "parentCommentId": "4H8DwbaSGRHjgBydr", "user": {"username": "nathan"}}, {"_id": "gARGzzCNXR2J9bRGQ", "postedAt": "2024-03-14T22:32:50.066Z", "postId": "RWxG3jGbkZzeHQsen", "htmlBody": "<p>Extremely relevant for my personal assessment!</p>\n<p>For the social fabric stuff it seems more important whether it's legibly not a puff piece. Had I downvoted (and honestly I was closer to upvoting), the intended signal would have been something like \"small ding for failing to adequately signal that it's not a puff piece\" (such signalling is cheaper for things that actually aren't puff pieces, so asking for it is relatively cheap and does some work to maintain a boundary against actual puff pieces). It would have warranted a bigger ding if I'd thought it was a puff piece.</p>\n<p>It's still possible I'm miscalibrated and this is transparently not a puff piece to ~everyone. (Although the voting pattern on my comment suggests that my feeling was not an outlier ... I guess this is unsurprising to me as one of the reasons I wrote the comment was seeing that your post had some downvotes and thinking it might be helpful to voice my guess about why.)</p>\n", "parentCommentId": "bxbxL2GBfKgoSaKrS", "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "BsL6P2R4npmwDg3pv", "postedAt": "2024-03-14T22:45:57.555Z", "postId": "RWxG3jGbkZzeHQsen", "htmlBody": "<ul><li>How could it have better signalled it wasn't a puff piece?</li><li>It sort of <i>is</i> a bit of a puff piece. I tried to talk about some negatives but I don't know that it's particularly even handed.</li><li>I tend to get quite a lot of downvotes in general, so some is probably that.</li><li>Beyond that, the title is quite provocative - I just used the title on my blog, but I guess I could have chosen something more neutral&nbsp;</li></ul>", "parentCommentId": "gARGzzCNXR2J9bRGQ", "user": {"username": "nathan"}}, {"_id": "LcSKPjnf5qkJyjmzR", "postedAt": "2024-03-14T22:57:58.699Z", "postId": "RWxG3jGbkZzeHQsen", "htmlBody": "<p>Yeah the tone makes sense for a personal blog (and in general the piece makes more sense for an audience who can mostly be expected to know Katja already).</p><p>I think it could have signalled more not-being-a-puff-piece by making the frame less centrally about Katja and more about the virtues you wanted to draw attention to. It's something like: those, rather than the person, are the proper object-of-consideration for these large internet audiences. Then you could also mention that the source of inspiration was the person.</p>", "parentCommentId": "BsL6P2R4npmwDg3pv", "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "FhvW2anpdZJD5GvpQ", "postedAt": "2024-03-14T23:06:49.214Z", "postId": "RWxG3jGbkZzeHQsen", "htmlBody": "<p>Yeah that seems right. Not sure what options one can click on crossposting to point that out. (I think the forum has a personal blog option, but I'm not sure that's so appropriate on LessWrong)</p>", "parentCommentId": "LcSKPjnf5qkJyjmzR", "user": {"username": "nathan"}}, {"_id": "mcsmKeBaNEH9xukNx", "postedAt": "2024-03-16T18:36:26.227Z", "postId": "RWxG3jGbkZzeHQsen", "htmlBody": "<p>Your post is tagged personal blog on LessWrong, idk if you tagged it that way explicitly or if it was done by mods.</p><p>For cross-posts to the EA forum, I think you might have an option in the ... menu at the top, or you can ask mods to move it to personal blog</p>", "parentCommentId": "FhvW2anpdZJD5GvpQ", "user": {"username": "Lorenzo Buonanno"}}, {"_id": "2vfqo6jRb9vesWBAB", "postedAt": "2024-03-17T18:22:07.034Z", "postId": "RWxG3jGbkZzeHQsen", "htmlBody": "<p>Okay, this should be a personal blog then I think</p>", "parentCommentId": "mcsmKeBaNEH9xukNx", "user": {"username": "nathan"}}]