[{"_id": "dZsjABsKscru4Dm4k", "postedAt": "2017-10-22T17:16:14.758Z", "postId": "RXCcAqzjBgYWavjMM", "htmlBody": "<p>It's obviously the case that &quot;do the most good&quot; is equivalent to &quot;optimize the Earth&quot;. HPMOR readers will remember: &quot;World domination is such an ugly phrase. I prefer to call it world optimisation.&quot;</p>\n<p>But given that they're equivalent, I don't see that changing the label offers any benefits. For example, the theoretical framework linked to &quot;do the most good&quot; already gives us a way to think about how to choose causes while taking into account inter-cause spillovers (corresponding to 1(iv)).</p>\n", "parentCommentId": null, "user": {"username": "Michael_Wiebe"}}, {"_id": "QRxpmJS5visrNFH73", "postedAt": "2017-10-23T11:02:55.788Z", "postId": "RXCcAqzjBgYWavjMM", "htmlBody": "<blockquote>\n<p>the theoretical framework linked to &quot;do the most good&quot; already gives us a way to think about how to choose causes while taking into account inter-cause spillovers </p>\n</blockquote>\n<p>I think impact 'spill-overs' between causes is a good representation of how most EAs mentally think about the relationship between causes and impact. However, I see this as an inaccurate representation of what's actually going on, and I suspect this leads to a substantial mis-allocation of resources.</p>\n<p>I suspect that long term flow-through effects typically outweigh the immediate observable impact of working on any given cause (because flow-through effects accumulate indefinitely over time). 'Spill-over' suggests that impact can be neatly attributed to one cause or another, but in the context of complex systems (i.e. the world we live in), impact is often more accurately understood as resulting from many factors, including the interplay of a messy web of causes pursued over many decades.</p>\n<p>I see 'Earth optimization', as a useful concept to help us develop our cause prioritisation methodology to better account for the inherent complexity of the world we aim to improve, better account for long run flow-through effects, and thus help us to allocate our resources more effectively as individuals and as a movement.</p>\n", "parentCommentId": "dZsjABsKscru4Dm4k", "user": {"username": "oliverbramford"}}, {"_id": "vH9vJ3fDjzcHFAM68", "postedAt": "2017-10-23T16:21:18.308Z", "postId": "RXCcAqzjBgYWavjMM", "htmlBody": "<p>'Spillover' is a common term in economics, and I'm using it interchangeably with externalities/'how causes affect other causes'.</p>\n<blockquote>\n<p>'Spill-over' suggests that impact can be neatly attributed to one cause or another, but in the context of complex systems (i.e. the world we live in), impact is often more accurately understood as resulting from many factors, including the interplay of a messy web of causes pursued over many decades.</p>\n</blockquote>\n<p>Spillovers can be simple or complex; nothing in the definition says they have to be &quot;neatly attributed&quot;. But you're right, long-term flow-through effects can be massive. They're also <a href=\"https://www.eaglobal.org/talks/flowthrough-effects/\">incredibly difficult</a> to estimate. If you're able to improve on our ability to estimate them, using complexity theory, then more power to you.</p>\n", "parentCommentId": "QRxpmJS5visrNFH73", "user": {"username": "Michael_Wiebe"}}, {"_id": "DmLmyNSB8YLFRh7nA", "postedAt": "2017-10-25T22:20:13.473Z", "postId": "RXCcAqzjBgYWavjMM", "htmlBody": "<p>I like this phrasing, but maybe not for the reason you propose it.</p>\n<p>&quot;Doing the most good&quot; leaves implicit what is good, but still uses a referent (&quot;good&quot;) that everyone thinks they know what it means. I think this issue is made even clearer if we talk about &quot;optimizing Earth&quot; instead since optimization must always be optimizing for something. That is, optimization is inherently measured and is about maximization/minimization of some measure. Even when we try to have a generic notion of optimal we still really mean something like effective or efficient as in optimizing for effectiveness or optimizing for efficiency.</p>\n<p>But if EA is about optimizing Earth or doing the most good, we must still tackle the problem of what is worth optimizing for and what is good. You mention impact, which also sounds a lot to me like some combination of effectiveness and productivity multiplied by effect size, yet when we are this vague that makes EA more of a productivity movement and less of a good doing movement, whatever we may think good is. The trouble is that, exposing the hollowness of ethical content in the message, it makes it unclear what things would not benefit from being part of EA.</p>\n<p>To take a repugnant example, if I thought maximizing suffering were good, would I still be part of EA since I want to optimize the Earth (for suffering)?</p>\n<p>The best attempt at dealing with this issue has, for me, been Brian Tomasik's looks at <a href=\"https://foundational-research.org/dealing-with-moral-multiplicity/\">dealing with moral multiplicity</a> and <a href=\"https://foundational-research.org/gains-from-trade-through-compromise/\">compromise</a>.</p>\n", "parentCommentId": null, "user": {"username": "gworley3"}}, {"_id": "LNAEbKvpKFw7LReGH", "postedAt": "2017-10-26T05:28:58.345Z", "postId": "RXCcAqzjBgYWavjMM", "htmlBody": "<p>It could be a useful framing. &quot;Optimize&quot; to some people may imply making something already good great, such as making the countries with the highest HDI even better, or helping emerging economies to become high income, rather than helping the more suffering countries to catch up to the happier ones. It could be viewed as helping a happy person become super happy and not a sad person to become happy. I know this narrow form of altruism isn't your intention, I'm just saying that &quot;optimize&quot; does have this connotation. I personally prefer &quot;maximally benefit/improve the world.&quot; It's almost the same as your expression but without the make-good-even-better connotation.</p>\n<p>I think EA's have always thought about impact of collective action but it's just really hard, or even impossible to estimate how your personal efforts will further collective action and compare that to more predictable forms of altruism.</p>\n", "parentCommentId": null, "user": {"username": "Austen_Forrester"}}]