[{"_id": "NdWHRgJtQqm44kHJN", "postedAt": "2024-02-13T03:53:33.192Z", "postId": "RXFcmrf7E5fLhb43e", "htmlBody": "<p>Strong +1 to all of the above - I've observed this a lot especially with ops roles.</p>\n", "parentCommentId": null, "user": {"username": "vaidehi_agarwalla"}}, {"_id": "YLsFXobfPhfQJvgjE", "postedAt": "2024-02-13T05:41:07.815Z", "postId": "RXFcmrf7E5fLhb43e", "htmlBody": "<p>These are great things to check! It's especially important to do this kind of due diligence if you're leaving your support network behind (e.g. moving country). Thanks for spelling things out for people new to the job market ❤️</p>", "parentCommentId": null, "user": {"username": "AbbyBabby"}}, {"_id": "Zs8rm7zfjDAmj8Dy9", "postedAt": "2024-02-13T19:10:46.396Z", "postId": "RXFcmrf7E5fLhb43e", "htmlBody": "<p><strong>Executive summary</strong>: When considering an informal job or internship opportunity, especially early in your career, carefully evaluate details like pay, structure, interpersonal fit, and exit options to avoid unpleasant surprises.</p><p><strong>Key points</strong>:</p><ol><li>Assess if the pay and benefits will realistically cover your needs, including backups for uncertainty.</li><li>Consider the organization's stage, turnover, accountability, and policies around issues like parental leave.</li><li>For on-site roles, evaluate lodging, time off-site, and work-life separation.</li><li>Request a written work agreement covering details like pay, hours, time off, and raising concerns.</li><li>Evaluate the people, communication norms, and processes for addressing interpersonal conflicts.</li><li>For unpaid or alternative arrangements, ensure you're gaining commensurate value and have financial backups.</li></ol><p>&nbsp;</p><p>&nbsp;</p><p><i>This comment was auto-generated by the EA Forum Team. Feel free to point out issues with this summary by replying to the comment, and</i><a href=\"https://forum.effectivealtruism.org/contact\"><i>&nbsp;<u>contact us</u></i></a><i> if you have feedback.</i></p>", "parentCommentId": null, "user": {"username": "SummaryBot"}}, {"_id": "wgDppfcbALDaoj7Sv", "postedAt": "2024-02-13T22:04:44.455Z", "postId": "RXFcmrf7E5fLhb43e", "htmlBody": "<p>I would note a consideration in terms of impact. Orgs that are larger, have more resources for better perks, can offer higher pay, and are more prestigious are going to be able to attract stronger applicants, all else being equal. Consequently, your impact is going to be the delta between the world with you in that position in the org and that of the person who would occupy that position. Consequently, your expected impact might be small or negative (or it could be high if you are exceptional at it relative to the second best option). I think EAs in general tend to conflate the value that is actualized by an org's operation with their counterfactual impact by taking a job at such an org.&nbsp;</p><p>I understand the concerns with small, new, organizations with less funding. Surely in some circumstances this can be a reflection of the merits of the organization, but in some circumstances, there is a promising project that needs help getting off the ground. The counterfactual &nbsp;person who might occupy the position in question for that org might not exist at all or could be much less competent. If you have reason to believe an org is significantly underrated in terms of funding access, prestige, etc., helping in early stages might be the highest EV choice.</p><p>This also is probably more of a hits-based approach than joining an established, funded, prestigious org. If you join that org, you will have a high probably of seeing legible impact and feel good about being a part of it, although it is hard to surmise what difference you made versus the other person they would have counterfactually hired. On the other hand, joining a new organization that you think has a promising theory of change is much less likely to yield a legibly impactful outcome. Even if there is a sound theory, there are just a lot of variables that could prevent a new org from being impactful. On the other hand, if such an org does<i> </i>succeed and scales, your dedicated and competent support of the org may actually have been the but-for cause of its success, implying high utility gains. If you are talented, hardworking, bright, good at networking, organized, etc. and are good at assessing areas that might be undervalued, I think the highest impact work would be at such underrated orgs. I definitely think this approach is less likely to lead to more happy or secure lives, however.</p>", "parentCommentId": null, "user": {"username": "Brad West"}}, {"_id": "diNcmpLfyTi2CLo8v", "postedAt": "2024-02-14T16:19:22.352Z", "postId": "RXFcmrf7E5fLhb43e", "htmlBody": "<p>Fully agree. And a flip side of this: reading this list also seems very valuable for people looking to recruit for early-stage projects. Putting yourself on the more reassuring side of as many of these points as is achievable is likely to aid recruitment, and reduce risks around staff retention, satisfaction and public image.&nbsp;<br><br>Some of the points won't be possible in every situation (e.g. things that cost a lot when you're tight on funding); but others are likely achievable for everyone, e.g. clarifying expectations around the items on this list, having a written agreement (even if informal) detailing what each side is committing to.</p>", "parentCommentId": null, "user": {"username": "AmritSidhu-Brar"}}, {"_id": "qk8fiopqERfqNtEv6", "postedAt": "2024-02-14T16:30:34.565Z", "postId": "RXFcmrf7E5fLhb43e", "htmlBody": "<p>Agreed; but I'd also add that I think in any role, the default assumption is that if you're selected for the job, you're likely to be at least somewhat better than the next best candidate. Applying for the job is a great way to find this out, and if you're uncertain about the counterfactual, you can also be open with the team about this and ask them how much they prefer you to the next best candidate – I've done this before and got replies that I think are honest and open.&nbsp;(Though some care is needed with this reasoning: if everyone did this, they'd just end up down at the best candidate who doesn't think to ask this.)<br><br>But yeah agree that the gap between you and the next best candidate is likely to be bigger for a less conventionally-appealing project.</p><p>(Additional musing this made me think of: there's also the consideration that the next-best candidate also has a counterfactual, and if they're aligned will probably themselves end up doing something else impactful if they don't take this job. A bit of a rabbit hole, but I think can still be useful: e.g. you could consider whether you seem more or less dedicated to a high-impact career than the typical applicant for the job. Or could ask the hiring manager whether they had promising community-external candidates, and whether they think you being aligned adds a lot to how well you'll do in the role.)</p>", "parentCommentId": "wgDppfcbALDaoj7Sv", "user": {"username": "AmritSidhu-Brar"}}, {"_id": "mH5koCJjMiqX57vtP", "postedAt": "2024-02-15T12:05:20.139Z", "postId": "RXFcmrf7E5fLhb43e", "htmlBody": "<p>I'm curating this post.&nbsp;<br><br>Partly this is because there is great advice in here, which I expect will be useful to early career EAs, and I'd love more of them to see it.&nbsp;<br><br>But I'm also curating this because good career advice is valuable, and It'd be great to see more of it posted on the Forum. If you have given a piece of career-related advice to several people, consider writing it up for the Forum. If it is small, or you aren't sure whether it is valuable, post it as a scrappy quick take.&nbsp;</p>", "parentCommentId": null, "user": {"username": "tobytrem"}}, {"_id": "Ra4fCbMu2kZwKwJsf", "postedAt": "2024-02-16T00:46:39.003Z", "postId": "RXFcmrf7E5fLhb43e", "htmlBody": "<blockquote><p>Additional musing this made me think of: there's also the consideration that the next-best candidate also has a counterfactual, and if they're aligned will probably themselves end up doing something else impactful if they don't take this job</p></blockquote><p>Agreed, if you or other people want to read about issues with naive counterfactuals, I briefly discuss it <a href=\"https://forum.effectivealtruism.org/posts/myp9Y9qJnpEEWhJF9/linch-s-shortform?commentId=tXautB29NTGKnAqTe\">here</a>.&nbsp;</p>", "parentCommentId": "qk8fiopqERfqNtEv6", "user": {"username": "Linch"}}, {"_id": "EJs5foyuphK6gsfJ2", "postedAt": "2024-02-16T03:22:18.972Z", "postId": "RXFcmrf7E5fLhb43e", "htmlBody": "<p>I was literally starting to compile a list like this for myself personally. Thank you!</p>", "parentCommentId": null, "user": {"username": "Gavin Bishop"}}, {"_id": "ytvor83BNpFik8j6J", "postedAt": "2024-02-16T09:13:29.348Z", "postId": "RXFcmrf7E5fLhb43e", "htmlBody": "<p>Probably lots of motivated reasoning here as I am doing something quite entrepreneurial myself: A positive about doing something in the early stages is that if we get lots of additional EA funding in a few years (there are indications chances of this are significant), we will likely again be scrambling for people to start new projects, just like in the \"FTX days\". It would be good both for:</p><ul><li>Candidates to build career capital, knowledge and skills in starting something new, and</li><li>For these candidates to have a track record from doing so to demonstrate to grantmakers</li></ul><p>I think these skills are somewhat uniquely built in doing something as close as possible to EA entrepreneurship.</p>", "parentCommentId": "wgDppfcbALDaoj7Sv", "user": {"username": "Ulrik Horn"}}, {"_id": "nGxmZsnraGZcnKdya", "postedAt": "2024-02-19T14:45:57.682Z", "postId": "RXFcmrf7E5fLhb43e", "htmlBody": "<p>I hadn't read this at the time I wrote the post, but an excerpt from Ricki Heicklen's <a href=\"https://asteriskmag.com/issues/05/michael-lewis-s-blind-side\">piece</a> in the \"Mistakes\" issue of Asterisk Magazine:<br>&nbsp;</p><blockquote><p>In January 2022, I decided to leave my job at Jane Street Capital to move to the Bahamas and take a job as a generalist at a new crypto firm funded by Sam Bankman-Fried. In the weeks that followed, I had three strokes of good luck:</p><p>a) I talked to a family friend, a lawyer familiar with financial fraud, who expressed alarm about various details of my new job. From our conversations, I made a list of a few dozen questions to investigate before committing.</p><p>b) I shared those questions with my new employers, believing they would be appreciated as valuable for our firm.</p><p>c) A few hours after sharing the questions, I was told not to come into work the next day</p></blockquote>", "parentCommentId": null, "user": {"username": "Julia_Wise"}}, {"_id": "wAS9WeWeyArzcmFEf", "postedAt": "2024-02-29T01:38:13.603Z", "postId": "RXFcmrf7E5fLhb43e", "htmlBody": "<p>This is mentioned here, but I want to double down on the value of \"asking around about the organization and what the experiences of others were\".&nbsp;</p><p>I talked to someone recently in tech about whether there were good ways to find out if working at any given tech organization was right for you, and he said basically no, that it was hard to get an accurate picture, that the resources that had tried to do this in the field (like <a href=\"https://www.teamblind.com/\">Blind</a>) added some information but gave warped impressions from who posted there. (That said, from a quick skim, it seems a lot better than nothing to me! I'm glad it exists)</p><p>So basically my current view is it's hard, and you might need to get information from a bunch of different sources.</p>", "parentCommentId": null, "user": {"username": "ChanaMessinger"}}]