[{"_id": "xHTfwnjtPLMXKjNPW", "postedAt": "2023-10-30T00:08:12.297Z", "postId": "Ryf83BHjCn5SN3zur", "htmlBody": "<p>Thanks for sharing, Mathias! Posts like this motivate me to keep trying to contribute to a better world. On the other hand, and I hope this is not too harsh, I do not think donating one of my kidneys now is a cost-effective way of doing so:</p><ul><li>From Scott's post, \"the average donation buys the recipient about <a href=\"https://sci-hub.st/10.1111/ajt.13490\">5 - 7 extra years of life</a> (beyond the counterfactual of dialysis)\". So I will assume here donating a kindey leads to an additional goodness of 6 (= (5 + 7)/2) human-years.</li><li>I <a href=\"https://forum.effectivealtruism.org/posts/vBcT7i7AkNJ6u9BcQ/prioritising-animal-welfare-over-global-health-and#Corporate_campaigns_for_chicken_welfare_increase_nearterm_wellbeing_way_more_cost_effectively_than_GiveWell_s_top_charities\">estimated</a> corporate campaigns for chicken welfare reduce suffering at a cost-effectiveness equivalent to creating 30.1 human-year per $.</li><li>So I should only donate a kidney if the monetary plus non-monetary (time) costs are less than 0.199 $ (= 6/30.1).&nbsp;</li><li>The above may be an underestimate, but I also expect the cost to be much higher. From <a href=\"https://www.valueinhealthjournal.com/article/S1098-3015(20)34448-X/fulltext?_returnURL=https%3A%2F%2Flinkinghub.elsevier.com%2Fretrieve%2Fpii%2FS109830152034448X%3Fshowall%3Dtrue\">Sekercioglu 2020</a>, \"the average donation-related costs range from $900 to $19 900 over the period of predonation evaluation to the end of the first postoperative year\".</li><li>I am also not confident extending human life is good due to the <a href=\"https://forum.effectivealtruism.org/posts/T3P4oX6F8tMh4h55s/the-meat-eater-problem\">meat eater problem</a>. I <a href=\"https://forum.effectivealtruism.org/posts/ayxasxhHWTvf6r5BF/scale-of-the-welfare-of-various-animal-populations\">estimated</a> the scale of the suffering of all factory-farmed animals is 12.1 times the scale of the happiness of all humans. Net global welfare <a href=\"https://forum.effectivealtruism.org/posts/HDFxQwMwPp275J87r/net-global-welfare-may-be-negative-and-declining-1\">may</a> be negative and declining. Conclusions like these are not <a href=\"https://forum.effectivealtruism.org/topics/resilient-food\">resilient</a>, but imply caution around considering life extension as robustly good. I think interventions focussing on improving quality of life (e.g. human mental health or corporate campaings for chicken welfare) are more robustly positive.</li></ul><p><a href=\"https://80000hours.org/\">80,000 hours</a> for an hourly rate of 24 $/h would be 1.92 M$ (= 8*10^4*24). Scott talks about a risk of dying from surgery of 0.01 %, which would mean an expected cost of 192 $ (= 1.92*10^6*10^-4). This is 3 orders of magnitude (192/0.199 = 965) more costly than what I should be willing to pay based on the 1st 3 bullets above, even neglecting the moneraty costs of the 4th bullet, and harmful effects of the 5th bullet.</p><p>That being said, I think there would be a strong case for donating a kidney if the following is successful:</p><blockquote><p>My [Scott's] kidney donation “mentor”<a href=\"https://www.astralcodexten.com/p/my-left-kidney#footnote-8-136660465\"><sup>8</sup></a> Ned Brooks is starting a new push - <a href=\"https://www.modifynota.org/\">the <strong>Coalition To Modify NOTA</strong></a> - which proposes a $100,000 refundable tax credit - $10,000 per year for 10 years - for kidney donors.</p></blockquote><p>100 k$ would be enough to outweight the monetary and non-monetary costs of the kidney donations in many circumstances (namely my own). In addition, donating 100 k$ to corporate campaigns for chicken welfare would easily outweight any negative effects on animals from the additional human life linked to the kidney donation. I wonder how much one has to earn in the US to fully benefit from a refundable tax credit of 10 k$/year. If I managed to get 100 k$ for a kidney donation (I am currently in Portugal), I would hopefully convince myself to do it (and donate roughly all gains, but this feels like the easy part).</p>", "parentCommentId": null, "user": {"username": "vascoamaralgrilo"}}, {"_id": "dq7WCmg6GjnnJhSMT", "postedAt": "2023-10-30T14:57:59.157Z", "postId": "Ryf83BHjCn5SN3zur", "htmlBody": "<p>The 1/660 was for the standard CT screening exam; Scott says he was able to get a non-radioactive (MRI) alternative, so presumably that risk of death is ~irrelevant for people that ask the question.<br><br>Also, while I have no particular opinion on your monetary analysis, it seems orthogonal to the reasons Scott mentioned donating the kidney (&amp; the reason I think it's tempting for a lot of EAs).</p><p>Scott himself calculates that \"...it only costs about $5,000 - $10,000 to produce this many QALYs through bog-standard effective altruist interventions, like buying mosquito nets for malarial regions in Africa. In a Philosophy 101 Thought Experiment sense, if you’re going to miss a lot of work recovering from your surgery, you might as well skip the surgery, do the work, and donate the extra money to Against Malaria Foundation instead.\"</p><p>The reasons for a kidney donation are because it feels good to know you're directly helping a specific person in a legible way/amount, significantly more effectively than a lot of charities people donate to [though less effective than The Best EA Charities] while being <i>legibly good</i> to even non-EA people.</p><p>A lot of non-EA people have strong negative bias toward the \"you could work extra hours and donate the money to slightly decrease factory farming\" thinking, but pretty much everyone is in favor of donating organs. And sometimes it's really nice to do good in a way that makes people like you <i>more</i>, not less.</p><p>Sorry if I misunderstood the criticism you were making above. Obviously I can't speak for Scott, but I am very sympathetic to the choice to donate a kidney even if it's not maximally cost-effective.</p>", "parentCommentId": "xHTfwnjtPLMXKjNPW", "user": {"username": "MintSnap"}}, {"_id": "sHgz4MDcTCymj5Fsc", "postedAt": "2023-10-30T16:19:19.198Z", "postId": "Ryf83BHjCn5SN3zur", "htmlBody": "<p>Thanks for clarifying Scott's position!</p><blockquote><p>The 1/660 was for the standard CT screening exam; Scott says he was able to get a non-radioactive (MRI) alternative, so presumably that risk of death is ~irrelevant for people that ask the question.</p></blockquote><p>I have modified the above calculations using a risk of death from surgery of 0.01 %, although I do not know how costly (in terms of time and money) it would be for me to get one of those exams in Portugal. Having to spend much more than 0.2 $ would make the kidney donation not worth it for me, assuming no monetary benefit from donating a kidney (which I could then donate to effective charities).</p><blockquote><p>The reasons for a kidney donation are because it feels good to know you're directly helping a specific person in a legible way/amount, significantly more effectively than a lot of charities people donate to [though less effective than The Best EA Charities] while being <i>legibly good</i> to even non-EA people.</p></blockquote><p>I am not saying the following applies to Scott's donation, but, accounting for the more direct effects, I think I would be counterfactually causing harm if I donated one of my kidneys now:</p><ul><li>With the time and money spent on donating a kidney, I could improve the world much more by donating to the best animal welfare charities (or, in my view, to the best opportunities to decrease AI risk).</li><li>I would be helping a person by donating a kidney, but increasing the suffering of factory farmed animals in the process, and I just do not know what would be the net effect. In other words, even neglecting the opportunity cost I discuss just above, it is unclear to me whether donating a kidney is harmful/beneficial.</li></ul><p>One could argue I should still donate a kidney because people will hold me more highly for doing so, e.g. letting me decide on the recipients of their donations, such that indirectly I end up having greater impact. However, I am wary of pursuing actions which have harmful direct effects on the grounds of beneficial indirect effects outweighting them. A priori, we should arguably expect the indirect effects to correlate with the direct effects.</p><blockquote><p>A lot of non-EA people have strong negative bias toward the \"you could work extra hours and donate the money to slightly decrease factory farming\" thinking, but pretty much everyone is in favor of donating organs.</p></blockquote><p>Alas, pretty much everyone eats factory-farmed animals, and I think that is quite bad. On the other hand, I would guess the current level of donations in the EA community is below optimal.</p><blockquote><p>Sorry if I misunderstood the criticism you were making above. Obviously I can't speak for Scott, but I am very sympathetic to the choice to donate a kidney even if it's not maximally cost-effective.</p></blockquote><p>I thought Scott's post inspiring too! Yet, I still want to be as alstruistic as possible.</p>", "parentCommentId": "dq7WCmg6GjnnJhSMT", "user": {"username": "vascoamaralgrilo"}}, {"_id": "v4JZRE3Puayq8xmHD", "postedAt": "2023-10-31T12:21:30.575Z", "postId": "Ryf83BHjCn5SN3zur", "htmlBody": "<p>On your first bullet point, I think everyone agrees kidney donation is not maximally cost effective<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefxbx04ik7he\"><sup><a href=\"#fnxbx04ik7he\">[1]</a></sup></span>. It is far more effective than most mainstream charity, so it still seems to be under the EA larger umbrella, but the associated cost would probably come at least partially out of the \"warm fuzzy\" bucket and not the \"max utility\" bucket.</p><p>On your second point, I think that argument is internally consistent but most people will be repelled by it. I am vegan and donate to animal charities, and I think it's definitely nonoptimal that people continue creating demand for factory farming. However, I am still extremely opposed to humans dying against their will if we have a (reasonable-cost) solution.</p><p>Scott's post above is specifically aimed at helping people who are <i>already</i> interested in donating a kidney (the majority, at least according to surveys) have an easier time donating. I don't think it is primarily focused on convincing EAs in unrelated cause areas to donate a kidney, so you're likely not the target audience.</p><p>If you oppose <i>other</i> people donating kidneys on the grounds that it will probably increase meat consumption:</p><ul><li><a href=\"https://longtermrisk.org/reasons-to-be-nice-to-other-value-systems/\">Being nice to other value systems</a> is a very important heuristic, even if those value systems are slightly net negative to you. Debating the effectiveness of kidney donations on the EA forum is obviously fair game, but in general, refusing to play nice with e.g. organ donation is considered a large defection in &gt;=95% of people's value systems, and I think you stand to lose a lot more than you gain if you pick that battle.</li><li>If following a value system to its logical extremes requires supporting outcomes that feel deeply morally wrong, probably something is wrong either with the value system or how it's being applied<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefke3h53gmj6c\"><sup><a href=\"#fnke3h53gmj6c\">[2]</a></sup></span>. To me, opposing healthcare to reduce the poor meat-eater problem feels sufficiently morally wrong that if I reached the same conclusion, I would rather change my moral system than bite the relevant bullets.</li></ul><p>I hope this doesn't come off as adversarial; I think we're from closely-adjacent moral systems, and I disagree with you but am also very happy to talk to someone that cares a lot about animal suffering.</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnxbx04ik7he\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefxbx04ik7he\">^</a></strong></sup></span><div class=\"footnote-content\"><p>At least for people making incomes I associate with EAs. For people making less than median income who have less chance to work and donate, it may be a relatively more effective option?</p></div></li><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnke3h53gmj6c\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefke3h53gmj6c\">^</a></strong></sup></span><div class=\"footnote-content\"><p>My hand-wavey version of this argument would be that I think we have a lot of (biologically &amp; culturally) hard-coded immunities to ideological extremes. Unfortunately the immunity is stupid &amp; inarticulate, but it is often legitimately useful and I don't want to discard it unless I'm <i>really really</i> sure.</p><p>My other version of this argument would be that I have a sense of \"right\" and \"wrong\" that my moral system is built on top of. I'm not convinced that \"right\" and \"wrong\" are features of the universe that it is even coherent for me to imagine <i>without</i> the internal sense bit. There is nothing about either the suffering of a chicken or a kidney dialysis patient that is bad unless I have an internal sense that suffering itself is bad. So debating mortality past the point where the outcomes achieved seems wrong feels pointless. Most arguments in favor of a moral system make the outcome feel <i>more right </i>upon reflection, which is why I like to read arguments in favor of specific moral systems.</p></div></li></ol>", "parentCommentId": "sHgz4MDcTCymj5Fsc", "user": {"username": "MintSnap"}}, {"_id": "kaAAQzqc4HLyJnRS7", "postedAt": "2023-11-05T06:12:41.193Z", "postId": "Ryf83BHjCn5SN3zur", "htmlBody": "<blockquote><p>One could argue I should still donate a kidney because people will hold me more highly for doing so, e.g. letting me decide on the recipients of their donations, such that indirectly I end up having greater impact.</p></blockquote><p>&nbsp;</p><p>Would you let someone else decide the recipients of your donations because they had donated a kidney? Or would you think that your donations should go to whatever you had previously judged to have the greatest possible impact, and that the fact that a person has donated a kidney doesn't by itself tell you they're good at math, statistics, and sociological research? Obviously an EA should ignore kidney donations and focus on the numbers. So this only makes sense as a way to con irrational people into ultimately giving more money to EA causes. Which would be wrong.</p><p>Also, recall the psychological screening that Scott describes in his article. How do you think the hospital panel would/should respond if you told them you were donating a kidney in order to gain social capital in philanthropic circles with the ultimate goal of gaining more control over the disbursement of charitable funds? I think they would deny you, and be correct to do so. You could lie to them, but I'm going to assume you wouldn't.</p><p>Moreover, any sort of implication that a person <i>should</i> donate a kidney is extremely fraught. Like, what would you think of somebody who went around pressuring other people to donate their kidneys? Personally, I'd think they were somebody whose jaw needed multiple fractures. Given that Scott's hospital panel explicitly screened for this, I'd say the medical profession cautiously agrees with me. I think the community should be extremely careful not to suggest that there is any kind of moral imperative to donate kidneys in order to fit in with the group.</p><p>Scott explicitly suggests that in terms of raw EA calculus, donating kidneys is not great. He didn't do it for maximal EV, he did it to feel good about himself. To that end, it might be desirable to have the norm that if you do donate a kidney, you don't tell people about it (except maybe family and very close friends). If it only makes sense in terms of feeling good about yourself, then being public about it isn't necessary (I appreciate that this doesn't necessarily apply to the goals of Scott's post though).</p>", "parentCommentId": "sHgz4MDcTCymj5Fsc", "user": {"username": "denyeverywhere"}}, {"_id": "eKEfwcWzEAfJ4BJoD", "postedAt": "2023-11-08T20:14:09.056Z", "postId": "Ryf83BHjCn5SN3zur", "htmlBody": "<p>Thanks for elaborating,&nbsp;<a href=\"https://forum.effectivealtruism.org/users/mintsnap?mention=user\">@MintSnap</a><span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnref1ra48u6lbnw\"><sup><a href=\"#fn1ra48u6lbnw\">[1]</a></sup></span>!</p><blockquote><p>If you oppose <i>other</i> people donating kidneys on the grounds that it will probably increase meat consumption</p></blockquote><p>I do not oppose neither support people donating kidneys, as I do not know whether is good/bad.</p><blockquote><p><a href=\"https://longtermrisk.org/reasons-to-be-nice-to-other-value-systems/\">Being nice to other value systems</a> is a very important heuristic, even if those value systems are slightly net negative to you. Debating the effectiveness of kidney donations on the EA forum is obviously fair game, but in general, refusing to play nice with e.g. organ donation is considered a large defection in &gt;=95% of people's value systems, and I think you stand to lose a lot more than you gain if you pick that battle.</p></blockquote><p>I like the post you linked! I do not think this criticism applies so much because I am not refusing to play nice with organ donation. I am just arguing that it is not a robustly good way to increase welfare once one accounts for effects on animals. Note I am also moderating the conclusions of my quantitative analyses based on considerations like the ones you are pointing out. I estimated a random human causes <a href=\"https://forum.effectivealtruism.org/posts/ayxasxhHWTvf6r5BF/scale-of-the-welfare-of-various-animal-populations\">12.1</a> times as much suffering to factory-farmed animals as the happiness of human life. A naive interpretation of this would imply more human deaths being good, but that is not my takeaway. I just conclude saving lives may be beneficial/harmful.</p><blockquote><p>If following a value system to its logical extremes requires supporting outcomes that feel deeply morally wrong, probably something is wrong either with the value system or how it's being applied<a href=\"https://forum.effectivealtruism.org/posts/Ryf83BHjCn5SN3zur/my-left-kidney#fnke3h53gmj6c\"><sup>[2]</sup></a>. To me, opposing healthcare to reduce the poor meat-eater problem feels sufficiently morally wrong that if I reached the same conclusion, I would rather change my moral system than bite the relevant bullets.</p></blockquote><p>That is another great heuristic! However, I would say most people do not have strong intuitions in favour of saving random human lives, otherwise GiveWell's top charities (which save a life for 5 k$) would receive way more money. Accordingly, I do not view not supporting/opposing donating organs as being against common intuitions. If I strongly opposed organ donations, I would be going against common sense, but as I said I do not oppose neither support organ donations.</p><p>On the other hand, I do think most people (and I am no exception) have strong intuitions about saving a person (spatially or relationally) close to us being clearly good, and I support this position too, even if the saved person ends up eating lots of animals. Similarly, I strongly oppose killing people<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefi43al3ajwj\"><sup><a href=\"#fni43al3ajwj\">[2]</a></sup></span>, regardless of how much animals they are consuming.</p><blockquote><p>I hope this doesn't come off as adversarial; I think we're from closely-adjacent moral systems, and I disagree with you but am also very happy to talk to someone that cares a lot about animal suffering.</p></blockquote><p>Thanks for the thoughtful comments!</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fn1ra48u6lbnw\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnref1ra48u6lbnw\">^</a></strong></sup></span><div class=\"footnote-content\"><p>I am tagging you to let you know of my reply, as I originally only replied \"Thanks for elaborating!\".</p></div></li><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fni43al3ajwj\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefi43al3ajwj\">^</a></strong></sup></span><div class=\"footnote-content\"><p>Interestingly, people often kind of support killing people by being in favour of wars. I generally do not.</p></div></li></ol>", "parentCommentId": "v4JZRE3Puayq8xmHD", "user": {"username": "vascoamaralgrilo"}}, {"_id": "D7cr5EbspjsenrBgJ", "postedAt": "2023-11-08T22:33:50.445Z", "postId": "Ryf83BHjCn5SN3zur", "htmlBody": "<p>Thanks for the comment!</p><blockquote><p>Would you let someone else decide the recipients of your donations because they had donated a kidney? Or would you think that your donations should go to whatever you had previously judged to have the greatest possible impact, and that the fact that a person has donated a kidney doesn't by itself tell you they're good at math, statistics, and sociological research?</p></blockquote><p>The latter.</p><blockquote><p>Obviously an EA should ignore kidney donations and focus on the numbers. So this only makes sense as a way to con irrational people into ultimately giving more money to EA causes. Which would be wrong.</p></blockquote><p>I think one should not ignore kidney donations, but at the same time I would say one should ideally only do them if they contribute to a better world. I believe it would make sense for me to donate a kidney if it caused lots of donations to effective organisations, but I am not convinced this would happen. Kidney donations would also be more likely to increase donations to live-saving interventions than animal welfare or AI safety interventions, which are the ones I find most effective. Since I do not know whether saving lives is good/bad, I would not see increased donations to e.g. GiveWell's top charities as a good/bad outcome of my kidney donation.</p><blockquote><p>Also, recall the psychological screening that Scott describes in his article. How do you think the hospital panel would/should respond if you told them you were donating a kidney in order to gain social capital in philanthropic circles with the ultimate goal of gaining more control over the disbursement of charitable funds? I think they would deny you, and be correct to do so. You could lie to them, but I'm going to assume you wouldn't.</p></blockquote><p>Good point! I had not thought about that. I think one should not lie, but that most people would be happy with me doing it if it was in that context, so I would not worry so much about that. However, most people would not view such instrumental motives for donating a kidney with good eyes, so I would have to lie to many more people besides the ones in the panel! This would definitely worry me, as I think one should only do so blatantly if there is a very strong reason.</p><blockquote><p>Personally, I'd think they were somebody whose jaw needed multiple fractures.</p></blockquote><p>I think this violent tone is very inappropriate.</p><blockquote><p>Scott explicitly suggests that in terms of raw EA calculus, donating kidneys is not great. He didn't do it for maximal EV, he did it to feel good about himself. To that end, it might be desirable to have the norm that if you do donate a kidney, you don't tell people about it (except maybe family and very close friends). If it only makes sense in terms of feeling good about yourself, then being public about it isn't necessary (I appreciate that this doesn't necessarily apply to the goals of Scott's post though).</p></blockquote><p>The issue is that part of makes one feel good due to donating a kidney is that other people will know about it.</p>", "parentCommentId": "kaAAQzqc4HLyJnRS7", "user": {"username": "vascoamaralgrilo"}}, {"_id": "FeqAEjaouggEGDLTR", "postedAt": "2023-11-10T03:53:56.047Z", "postId": "Ryf83BHjCn5SN3zur", "htmlBody": "<blockquote>\n<p>I think one should not ignore kidney donations</p>\n</blockquote>\n<p>In the statement you're replying to, I meant \"ignore whether someone has donated a kidney when evaluating how strongly to weight that person's opinion of which charities one should support [and focus on the numbers].\"</p>\n<blockquote>\n<p>Kidney donations would also be more likely to increase donations to live-saving interventions than animal welfare or AI safety interventions</p>\n</blockquote>\n<p>I don't know why you would think this. It seems silly to me to think about donating a kidney in terms of what kind of aggregate charitable response it would provoke. It just seems really unlikely that anyone has any good reason to think it would do anything one way or the other.</p>\n<p>Or put it this way: the amount of extra charity you should expect is the amount one randomly selected human would perform over the course of 5 years. This is because what you've actually done is bought some person 5 extra years of life, and maybe they'll give to charity in that period, but also maybe not. Basically, if you think donating kidneys is +EV for charity, you really need to look into having children. You could easily generate hundreds of life-years that way. Plus instead of having a risky surgical procedure, you have sex with someone. It's clearly a dominant strategy.</p>\n<blockquote>\n<p>I think one should not lie, but that most people would be happy with me doing it if it was in that context</p>\n</blockquote>\n<p>I disagree. I think people would think you were crazy. Like the whole idea is crazy, so people who knew that was your plan wouldn't ask your opinion about which charities are good.</p>\n<blockquote>\n<p>I think this violent tone is very inappropriate.</p>\n</blockquote>\n<p>It's my honest reaction, so I think it's a bad policy to go around concealing it. I would regard pressuring people to donate organs as among the most objectionable sort of abuse &amp; exploitation you could possibly do to another person. I would feel very angry at someone who I knew was doing it. I would feel the urge to use violence against them. I might or might not actually do it, but the urge would be there. If someone else used violence against that person, I'd feel like it was deserved and wouldn't judge the violence-user very harshly (all else being equal).</p>\n<p>The fact that you consider my tone inappropriate suggests that you don't instinctively condemn the idea as strongly as I do. Like, I feel like if I were to say that I would have the urge to use violence against a rapist, fewer people would regard that as inappropriate. I'm not saying this to condemn you. I'm saying that if some action which you hypothetically might do would make other people angry enough to use violence against you, that's generally something you want to know. You shouldn't be critical of someone for telling you ahead of time what to expect. That person is providing something of value to you.</p>\n<p>Keep in mind what I said about the screening. The hospital panel asks people whether anyone is pressuring them to donate. Obviously, the panel does this because if someone were pressuring  the donor, that would be grounds to reject the donation. The medical profession views pressuring donors as unacceptable. This is probably a sign that as individuals, they view it as something deeply wrong and which makes them angry. It is also a sign that it is something that <em>actually happens</em> and that they need to actively guard against it.</p>\n<p>To be clear, I'm not threatening to punch anyone over the internet. But I think that if some conduct would make us angry enough to potentially use violence, there has to be some responsible way to let other people know this fact. Especially when (as seems to be the case here) it's not transparently obvious that those other people already know.</p>\n", "parentCommentId": "D7cr5EbspjsenrBgJ", "user": {"username": "denyeverywhere"}}, {"_id": "E2f3b5s7xae9M8ZCq", "postedAt": "2023-11-10T08:24:28.661Z", "postId": "Ryf83BHjCn5SN3zur", "htmlBody": "<blockquote><p>In the statement you're replying to, I meant \"ignore whether someone has donated a kidney when evaluating how strongly to weight that person's opinion of which charities one should support [and focus on the numbers].\"</p></blockquote><p>That makes sense. Sorry for misinterpreting.</p><blockquote><p>I don't know why you would think this. It seems silly to me to think about donating a kidney in terms of what kind of aggregate charitable response it would provoke. It just seems really unlikely that anyone has any good reason to think it would do anything one way or the other.</p></blockquote><p>I broadly agree. I just asked my mother and brother whether they or other family members would donate more to my preferred effective charities if I donated a kidney:</p><ul><li>My mother: displaying an appaled face, \"of course not\".</li><li>My brother: after laughing for a while, \"I do not think that would matter\".</li></ul><p>Maybe their views would change with time, but I agree a priori we should not expect a meaninful increase in effective donations. Accounting for just family members, I certainly do not expect such eventual increase to be worth the money and time cost of the procedure. In hindsight, I also regret having bought books related to veganism and effective altruism to my family, which as far as I know no one read. I still endorse having conversations about these topics, though.</p><p>In my previous comment, I mostly meant that, conditional on the kidney donation affecting donations of other people, it would be more likely to increase their donations to global health and development than animal welfare and AI safety.</p><blockquote><p>I disagree. I think people would think you were crazy. Like the whole idea is crazy, so people who knew that was your plan wouldn't ask your opinion about which charities are good.</p></blockquote><p>Fair. However, after the initial reaction of thinking I am crazy (which also happened when I started a &nbsp;plant-based diet), people may come to understand my position (as also happened with my plant-based diet).</p><blockquote><p>I think this violent tone is very inappropriate.</p></blockquote><p>Thanks for your reply to this! Your initial comment looked bad without the context you provided in your reply just above, so I encourage you to give more context next time such that you are not misinterpreted.</p>", "parentCommentId": "FeqAEjaouggEGDLTR", "user": {"username": "vascoamaralgrilo"}}]