[{"_id": "pwpRtenPMfhZbHpmq", "postedAt": "2024-03-15T13:37:37.092Z", "postId": "RytwXqF6NkkMQn7J4", "htmlBody": "<p><strong>Executive summary:</strong> Our existence as roughly the 120 billionth human should inform our prior expectations about how many total humans will ever exist, making us skeptical of claims that humanity will end soon or that vastly more humans will exist in the future.</p><p><strong>Key points:</strong></p><ol><li>The post presents five thought experiments exploring how our position in humanity's timeline could provide evidence about the total number of humans who will ever exist.</li><li>In the \"Universe Before Box\" experiment, waking up in box 3 out of 10 or 10 trillion total boxes provides strong evidence that there are only 10 total boxes.</li><li>In the \"Smiteful God 2.0\" experiment, surviving to day 9 when boxes are destroyed daily provides evidence that there are likely only 10 total boxes, not 10 trillion.</li><li>The \"Smiteful God 3.0\" experiment suggests that even without knowing the maximum possible number of boxes/humans, each day of survival should slightly increase our expectation of the total.</li><li>Assuming complete uncertainty, the hypothesis that minimizes surprise about our position as the 120 billionth human is that there will be roughly 240 billion humans total.</li><li>This anthropic reasoning is not conclusive but should inform our priors about humanity's future, making us more skeptical of extinction soon or a vast future population.</li></ol><p>&nbsp;</p><p>&nbsp;</p><p><i>This comment was auto-generated by the EA Forum Team. Feel free to point out issues with this summary by replying to the comment, and</i><a href=\"https://forum.effectivealtruism.org/contact\"><i>&nbsp;<u>contact us</u></i></a><i> if you have feedback.</i></p>", "parentCommentId": null, "user": {"username": "SummaryBot"}}, {"_id": "HES9DSX2n4vmqgtFt", "postedAt": "2024-03-19T17:52:21.679Z", "postId": "RytwXqF6NkkMQn7J4", "htmlBody": "<p>Thanks for this write up!</p><p>You might already be aware of these, but I think there are some strong objections to the doomsday argument that you didn't touch on in your post.</p><p>One is the <a href=\"https://anthropic-principle.com/q=book/chapter_9/#9a\">Adam &amp; Eve paradox</a>, which seems to follow from the same logic as the Doomsday argument, but also seems completely absurd.</p><p>Another is reference class dependence. You say it is reasonable for me to conclude I am in the middle of 'humanity', but what is humanity? Why should I consider myself a sample from all homo sapiens, and not say, apes, or mammals? or earth-originating life? What even is a 'human'?</p>", "parentCommentId": null, "user": {"username": "tobycrisford"}}]