[{"_id": "x2tpcMPpLbNqAfTzv", "postedAt": "2017-06-14T07:24:44.994Z", "postId": "RzpnxTkbetWaNX7Aw", "htmlBody": "<p>Sounds like a really interesting and worthwhile topic to discuss. But it's quite hard to be sure I'm on the same page as you without a few examples. Even hypothetical ones would do. &quot;For reasons that should not need to be said&quot; - unfortunately I don't understand the reasons; am I missing something?</p>\n<p>Anyway, speaking in generalities, I believe it's extremely tempting to assume an adversarial dynamic exists. 9 times out of 10, it's probably a misunderstanding. For example, if a condition is given that isn't palatable, it's worth finding out the underlying reasons for the condition being given, and trying to satisfy them in other ways. Since humans have a tendency towards &quot;us vs them&quot; tribal thinking, there's considerable value in making effort to find common ground, establish mutual understanding, and reframe the interaction as a collegiate rather than adversarial one.</p>\n<p>This isn't meant as an argument against what you've said.</p>\n", "parentCommentId": null, "user": {"username": "Michael_Wulfsohn"}}, {"_id": "tjB6zzfGher6numyD", "postedAt": "2017-06-14T10:16:36.285Z", "postId": "RzpnxTkbetWaNX7Aw", "htmlBody": "<blockquote>\n<p>This is a purposefully vague warning for reasons that should not need to be said. Unfortunately, this forces this post to discuss these issues at a higher level of generality than might be ideal, and so there is definitely merit to the claim that this post only deals in generalisations. For this reason, this post should be understood more as an outline of an argument than as an actual crystalized argument</p>\n</blockquote>\n<p>I found this post unhelpful and this part of it particularly so. Your overall point - &quot;don't concede too much on important topics&quot; - seems reasonable, but as I don't know what topics you're referring to, or what would count as 'too much' on those, I can't learn anything.</p>\n<p>More generally, I find EAs who post things of the flavour &quot;we shouldn't do X, but I can't tell you what I mean by X for secret reasons&quot; annoying, alienating and culty and wish people wouldn't do it. </p>\n", "parentCommentId": null, "user": {"username": "MichaelPlant"}}, {"_id": "gTFeS8HfdhuPXWoKQ", "postedAt": "2017-06-14T10:40:26.229Z", "postId": "RzpnxTkbetWaNX7Aw", "htmlBody": "<p>&quot;Annoying, alienating and culty and wish people wouldn't do it&quot; - I would like to suggest that this is a bit of an overreaction given that this is just one post and almost no other posts on this forum are like this. It hardly seems like this forum is at risk of being overrun.</p>\n", "parentCommentId": "tjB6zzfGher6numyD", "user": {"username": "casebash"}}, {"_id": "C3HPprq9qR2bNxYey", "postedAt": "2017-06-15T07:15:37.774Z", "postId": "RzpnxTkbetWaNX7Aw", "htmlBody": "<p>There are ongoing controversies in EA, even if they're not obvious. That is, there are lots of ongoing debates EA that flare up occasionally, but are unresolved in terms of what concessions different effective altruists think our community ought be willing to make. I might cover some of those in the near future, and I'll cite this blog post. This is valuable in that I'd be covering object-level controversies, and having the outline of an argument established on the forum here in a neutral fashion beforehand will be helpful. Thanks for writing this.</p>\n", "parentCommentId": null, "user": {"username": "Evan_Gaensbauer"}}, {"_id": "RxdEgXh83kAKsED4Q", "postedAt": "2017-06-15T13:57:41.580Z", "postId": "RzpnxTkbetWaNX7Aw", "htmlBody": "<p>I've expanded the first paragraph and added a hypothetical example. Let me know if this clarifies the situation.</p>\n<p>EDIT: Oh, I also added in a direct response to your comment.</p>\n", "parentCommentId": "x2tpcMPpLbNqAfTzv", "user": {"username": "casebash"}}, {"_id": "R5MKesftSwjPNewua", "postedAt": "2017-06-15T13:59:40.736Z", "postId": "RzpnxTkbetWaNX7Aw", "htmlBody": "<p>Happy to hear that this post has been of use to at least one person. Anyway, I added an additional example (Andrew and Bob) to further clarify the situation as my post was too general for some people.</p>\n", "parentCommentId": "C3HPprq9qR2bNxYey", "user": {"username": "casebash"}}, {"_id": "tZSZxCvyKWQPzwoLg", "postedAt": "2017-06-15T14:04:09.510Z", "postId": "RzpnxTkbetWaNX7Aw", "htmlBody": "<p>Anyway, I tried providing an example, though I still kept it away from directly discussing any concrete issues. Hopefully this makes the principle clearer, even if I haven't directly explained how EA should apply this principle.</p>\n", "parentCommentId": "tjB6zzfGher6numyD", "user": {"username": "casebash"}}, {"_id": "Q2onCGuyRxc7hab8P", "postedAt": "2017-06-16T12:42:56.334Z", "postId": "RzpnxTkbetWaNX7Aw", "htmlBody": "<p>Thanks, it does a bit.</p>\n<p>What I was saying is that if I were Andrew, I'd make it crystal clear that I'm happy to make the cup of tea, but don't want to be shouted at; there are better ways to handle disagreements, and demands should be framed as requests. Chances are that Bob doesn't enjoy shouting, so working out a way of making requests and settling disagreements without the shouting would benefit both. </p>\n<p>More generally, I'd try to develop the relationship to be less &quot;transactional&quot;, where you act as partners willing to advance each other's interests and where there is more trust, rather than only doing things in expectation of reward.</p>\n", "parentCommentId": "RxdEgXh83kAKsED4Q", "user": {"username": "Michael_Wulfsohn"}}, {"_id": "ByqBjAe6BwH4F2DMp", "postedAt": "2017-06-17T06:13:36.822Z", "postId": "RzpnxTkbetWaNX7Aw", "htmlBody": "<p>One issue is that the party demanding the concessions usually attemtos to frame the issue in such a way as to obscure the fact that they are concessions.</p>\n", "parentCommentId": null, "user": {"username": "Larks"}}]