[{"_id": "BdAoaCNFGH7yvLkhH", "postedAt": "2022-12-20T16:30:34.234Z", "postId": "S2X7smXyjgf3MsNzi", "htmlBody": "<p>This is very cool! One thing that was particularly notable for me:</p>\n<p>“In 2023, we aim to recruit c50-100 new volunteers”</p>\n<p>This is a crazy high number! How many do you guys have currently? And do you do much active recruitment or do volunteers tend to find SoGive organically?</p>\n", "parentCommentId": null, "user": {"username": "JamesOz"}}, {"_id": "SBtqEwyuBX3BFdcvc", "postedAt": "2022-12-20T21:54:44.416Z", "postId": "S2X7smXyjgf3MsNzi", "htmlBody": "<p>Thanks :-)</p><p>We will run several cohorts/intakes over the year, receiving maybe c10-30 each time, depending on time of year and other factors.</p><p>However not all of them will stay. Although we encourage all volunteers to stay for an extended period of time, in practice a substantial number (often around a half) will drop out within a few months. Hence we don't expect to have more than 50 volunteers at any one time.</p><p>The tasks which we give volunteers at the outset are very structured, which means that we can cost efficiently manage volunteers at the outset by getting volunteers to support other volunteers. After the initial phase, they will need more staff support as they do more in-depth research, but we also know that they are able to maintain a steady 1 day per week of volunteering because they have done it for a while, which means it's worth our while to get them to initiate a long-term project that might take some time to complete.</p><p>Our volunteer numbers are fairly low at the moment, because we had a pause on volunteer recruitment. Probably around 10 volunteers (depending on how you count them). However we also have 41 volunteers on the waiting list.</p>", "parentCommentId": "BdAoaCNFGH7yvLkhH", "user": {"username": "Sanjay"}}, {"_id": "z2dz4KCGNooP7S3nX", "postedAt": "2023-03-19T20:14:37.979Z", "postId": "S2X7smXyjgf3MsNzi", "htmlBody": "<p>I really appreciated this report - especially the attempt to map out the impact of volunteering on the talent pipeline. From the report:&nbsp;</p><blockquote><p>List of possible impact pathways:</p><ul><li><strong>Better at EA research</strong>: Volunteers may become more capable at performing EA research because of their experience performing research, and the support and mentorship they get from the SoGive team.</li><li><strong>Excited about EA</strong>: Volunteers may feel more enthusiasm about EA through their work or the sense of community which develops within SoGive</li><li><strong>Community</strong>: Building network and sense of community – building networks enables people to achieve more.</li><li><strong>Pathfinding</strong>: Volunteers may become more confident about which type of EA career they want (generalist research? Ops? AI alignment?)&nbsp;</li><li><strong>Introductions:&nbsp;</strong>Facilitate recruiters reaching out to people to encourage them to apply for EA roles sooner<ul><li>This is a new impact pathway; we have not connected directly with EA employers before</li></ul></li><li><strong>Credentialising</strong> people makes it easier for employers to make a lower-risk hiring decision. It could happen through enabling a candidate to produce a piece of research an employer can see as evidence of their research capabilities.<ul><li>There is a risk that this could be counterproductive. For example, credentialising a candidate could mean that they displace an equally good or somewhat better candidate; this would be exacerbated if the SoGive-related article has been produced with the support of the SoGive team.</li><li>Having discussed this with potential EA employers, we see the counterarguments, including the view that seeing high quality work having already been produced is valuable because it significantly derisks an otherwise difficult hiring decision.&nbsp;</li></ul></li></ul></blockquote><p>I also appreciated the attempt to actually estimate how much a sample of volunteers was affected by volunteering. I'm more skeptical of some of these estimates than perhaps SoGive is, but I appreciate that the specificity because it gives a concrete place to have a discussion. &nbsp;</p><figure class=\"image\"><img src=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/z2dz4KCGNooP7S3nX/unx8n10aac9j8heltzm4\" srcset=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/z2dz4KCGNooP7S3nX/kd2qfrnoiztk2lcjy0pg 110w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/z2dz4KCGNooP7S3nX/cakwpm7o8y7xdld8pvw6 220w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/z2dz4KCGNooP7S3nX/ybeg0l1i3u3urvqswvlm 330w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/z2dz4KCGNooP7S3nX/fcfnweafk77ie8tx8pmw 440w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/z2dz4KCGNooP7S3nX/ut9ytiuc7pvfjvkp9sx5 550w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/z2dz4KCGNooP7S3nX/vjphv3k7xbvkajlnyir9 660w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/z2dz4KCGNooP7S3nX/rrlrrqyo8masfmjnukbj 770w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/z2dz4KCGNooP7S3nX/mpxn8gzfwzgmofksvf6u 880w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/z2dz4KCGNooP7S3nX/dwmyltr3i3m2gwtze3gu 990w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/z2dz4KCGNooP7S3nX/o96liwxxyws26ugcunlq 1057w\"></figure><p>Some thoughts on these estimates :&nbsp;</p><ul><li>They have \"not run these assessments past the relevant people\" (in their words) but are partly based on the relevant people's assesments.&nbsp;<ul><li>It seems in this early stage of evaluating the impact SoGive volunteering, it would be especially important to run this both by the volunteers themselves (especially for 2,3,4) and the orgs (especially for 5)</li></ul></li><li>I'm pretty uncertain on the value volunteering has, as someone who's both volunteered and worked with many volunteers over the years. At least 3 people who've volunteered on projects I've run now work at 80,000 Hours and CEA. I have not asked any of these orgs whether them volunteering played a role, but I think this would have been a small part of the reason. The main reason was that these folks were just really competent and aligned. I am uncertain what effect volunteering had on retention rates (Excited re EA), it's possible that it did help them.&nbsp;</li></ul><p>&nbsp;</p><p>Meta: In general, I'd encourage orgs to share more of their novel / new theory of change thinking on the Forum for others to see - not many folks pour through the reports unfortunately, so a lot of good content is missed.&nbsp;</p>", "parentCommentId": null, "user": {"username": "vaidehi_agarwalla"}}]