[{"_id": "a8WyMDrCPn3qX9AQ5", "postedAt": "2014-09-30T15:52:26.275Z", "postId": "S5eQJ4Rg3xxPNAnFN", "htmlBody": "<p>The Birthday for Charity project started by <a href=\"http://www.charityscience.com\">Charity Science</a> (Joesph Savoie, Xio Kikauka, Tom Ash, and me) has already raised over $16K for top charities and it's not stopping yet!</p>\n<p>It's not too late for you to <a href=\"http://www.charityscience.com/birthday-fundraisers.html\">help make this number higher</a>.  Also, with the holiday season coming up in a few months, you could consider a <a href=\"http://www.charityscience.com/christmas-fundraisers.html\">holiday fundraiser</a>!</p>\n", "parentCommentId": null, "user": {"username": "Peter_Hurford"}}, {"_id": "8iXNzTide6tv5h28M", "postedAt": "2014-09-30T20:53:54.393Z", "postId": "S5eQJ4Rg3xxPNAnFN", "htmlBody": "<p>The lack of responses in this thread is sad. My best guess is people are scared of responding because it sounds like quite an intimidating topic. But I don't want this site to fall prey to Yudkowsky syndrome - where everyone is afraid to post incase they are not the most intelligent, erudite &amp; awesome person on the site.</p>\n<p> So I guess I will be as &quot;normal&quot; as I can by saying the most the most awesome altruistic thing I've done this year is reporting my income and donations for last year to GWWC. That was not that easy, because I was first a student and then unemployed/had no income for most of last year - so those numbers were not world changing big deals or what I had necessarily hoped they would be. But, I think my commitment to sticking with the GWWC system and reporting my income will pay dividends in the long run because it is instilling EA as a habit, even when it is not that easy or I am not that amazing.</p>\n", "parentCommentId": null, "user": {"username": "AlasdairGives"}}, {"_id": "2kjKfZdpemieYCGxN", "postedAt": "2014-10-01T00:00:15.590Z", "postId": "S5eQJ4Rg3xxPNAnFN", "htmlBody": "<p>If people are intimidated about posting here, remember that <a href=\"http://everydayutilitarian.com/essays/effective-altruism-is-not-a-competition/\">effective altruism is not a competition</a> and we're only looking for your personal best.</p>\n<p>...Otherwise we'd all be upstaged by Bill Gates.</p>\n", "parentCommentId": null, "user": {"username": "Peter_Hurford"}}, {"_id": "r5D53PykPzphdGKSF", "postedAt": "2014-10-01T00:47:05.096Z", "postId": "S5eQJ4Rg3xxPNAnFN", "htmlBody": "<p>Last May, my local <a href=\"http://www.thehighimpactnetwork.org/\">THINK</a> chapter raised $5000 to give to <a href=\"http://www.thehumaneleague.com/\">The Humane League</a>, of which I contributed $500. I'm currently a student and saving most of my money, so it's not much, but it's my biggest donation ever and I'm proud of it. I was also the first to propose that we give to The Humane League, so I can take some of the credit for the money going there instead of somewhere less effective.</p>\n", "parentCommentId": null, "user": {"username": "MichaelDickens"}}, {"_id": "hakiueTyPvybFHFiS", "postedAt": "2014-10-01T04:58:28.574Z", "postId": "S5eQJ4Rg3xxPNAnFN", "htmlBody": "<p>Here are two small things I'm proud of, that I've been sustaining for a while now.</p>\n<p>-I took on an extra job so that I can donate more, even though doing it requires me to face my most severe phobia, and stuck with it even when it was more difficult than I thought it would be.\n-I stopped purchasing milk, eggs, and butter.  </p>\n", "parentCommentId": null, "user": {"username": "ClaireZabel"}}, {"_id": "tDzZzAQsXoxCX4esR", "postedAt": "2014-10-01T06:51:36.866Z", "postId": "S5eQJ4Rg3xxPNAnFN", "htmlBody": "<p>I've convinced my spouse to give a significant fraction of our income to effective charities and to increase this percentage every year. </p>\n", "parentCommentId": null, "user": {"username": "David_Kreppel"}}, {"_id": "pS67qgvmsupYEtDSM", "postedAt": "2014-10-01T14:58:45.905Z", "postId": "S5eQJ4Rg3xxPNAnFN", "htmlBody": "<p>Wow, congratulations!  What is the job?</p>\n", "parentCommentId": "hakiueTyPvybFHFiS", "user": {"username": "Peter_Hurford"}}, {"_id": "cHh8LAa3kucizKvyo", "postedAt": "2014-10-01T21:51:49.977Z", "postId": "S5eQJ4Rg3xxPNAnFN", "htmlBody": "<p>I donated a couple hundred dollars to GiveDirectly myself, my brother donated another $75 for my birthday, and have taken up the idea of a charity jar from LessWrong a month or so ago (putting money in it every time I need an emotional boost or turn down donating to collectors on the street/donating to projects like HabitRPG) - at the end of the year it's all going to an as-yet-undecided effective charity.</p>\n<p>I also wrote my final psyc assignment (where we can research anything related to judgement and decision-making and do a write-up or pilot study) on the charitable giving process, how people choose charities, and how we can make it more effective. Probably not new ground covered for EAs but I might post it. I discussed this a lot with friends and tutors, so hopefully that'll make some of them interested in EA too - I've had at least a few ask more about Givewell and look it up.</p>\n", "parentCommentId": null, "user": {"username": "GreyArea"}}, {"_id": "jdkeZtyvS735mNHCQ", "postedAt": "2014-10-02T15:49:39.624Z", "postId": "S5eQJ4Rg3xxPNAnFN", "htmlBody": "<p>Impressive, how did you raise that sort of sum?</p>\n", "parentCommentId": "r5D53PykPzphdGKSF", "user": {"username": "arrowind"}}, {"_id": "i7EwTkBSFf9pJZwj5", "postedAt": "2014-10-05T10:32:10.147Z", "postId": "S5eQJ4Rg3xxPNAnFN", "htmlBody": "<p>So far I've converted 2 other people to give 10% of their incomes to effective charities.  Also founded an organisation to evaluate and recommend Australian-based charities (for those that insist on tax-deductibility and/or not donating overseas).</p>\n<p>Also, I became a vegetarian last year and I'd love to post that here, where hopefully you will all pat me on the back for what was a difficult change to begin with! Usually I just cop a lot of crap for it :(</p>\n", "parentCommentId": null, "user": {"username": "Amanda_Jane"}}, {"_id": "tYsQSWfWfpEqp4Nfd", "postedAt": "2014-10-06T15:12:21.438Z", "postId": "S5eQJ4Rg3xxPNAnFN", "htmlBody": "<p>If your aim is tax-deductibility, and there are charities that you can't current get tax-deductibility to, then why not setup a charity that simply makes grants to overseas charities?  This is what we have done in the UK with the Giving What We Can Trust, which has had hundreds of thousands of pounds donated through it to non-UK charities.  This means that you can donate to any charity in the world rather than limiting yourself to Australian charities.  </p>\n", "parentCommentId": "i7EwTkBSFf9pJZwj5", "user": {"username": "Niel_Bowerman"}}, {"_id": "AohpDZJ9APDy38LAW", "postedAt": "2014-10-06T17:32:48.981Z", "postId": "S5eQJ4Rg3xxPNAnFN", "htmlBody": "<p>I asked my grandparents to donate to ACE on my behalf for my birthday.  I just saw that the $500 donation went through :)</p>\n", "parentCommentId": null, "user": {"username": "ClaireZabel"}}, {"_id": "6DJdJqp8kAPcWJkTK", "postedAt": "2014-10-07T04:47:38.507Z", "postId": "S5eQJ4Rg3xxPNAnFN", "htmlBody": "<p>Sorry for the late response! IIRC, five members each donated $500 and one member offered to match everyone else's donation.</p>\n<p>We received a $2000 matching from <a href=\"http://laaf.org/\">Giving 2.0</a>, so we effectively moved $7000 to The Humane League.</p>\n", "parentCommentId": "jdkeZtyvS735mNHCQ", "user": {"username": "MichaelDickens"}}, {"_id": "2B2cgGJLxDyNoW2ea", "postedAt": "2014-10-07T04:50:13.685Z", "postId": "S5eQJ4Rg3xxPNAnFN", "htmlBody": "<p>Awesome job on becoming vegetarian! Sometimes the hardest part can be the lack of social acceptance. Maybe find some veg friends or join a vegetarian club/group? It can be helpful to surround yourself with people who have similar goals.</p>\n", "parentCommentId": "i7EwTkBSFf9pJZwj5", "user": {"username": "MichaelDickens"}}, {"_id": "j9HTh4xFitvg8sXZn", "postedAt": "2014-10-07T09:27:39.956Z", "postId": "S5eQJ4Rg3xxPNAnFN", "htmlBody": "<blockquote>\n<p>So far I've converted 2 other people to give 10% of their incomes to effective charities.</p>\n</blockquote>\n<p>This is really big -- fantastic work, congratulations!</p>\n", "parentCommentId": "i7EwTkBSFf9pJZwj5", "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "EWCtQn6CA7ruxhnbc", "postedAt": "2014-10-11T00:03:53.155Z", "postId": "S5eQJ4Rg3xxPNAnFN", "htmlBody": "<p>Congratulations!  How did you get the matching donation?</p>\n", "parentCommentId": "6DJdJqp8kAPcWJkTK", "user": {"username": "Peter_Hurford"}}, {"_id": "fhAnmaNSD6y7iFPJc", "postedAt": "2014-10-11T06:27:09.590Z", "postId": "S5eQJ4Rg3xxPNAnFN", "htmlBody": "<p>Hi Niel - there are other people doing the trust idea :)</p>\n<p>The aim of my group is mostly outreach - there are heaps of people interested in charity who want to give to effective Australian groups who aren't EAs as such. (This is not something I personally agree with, but a large number of people do) so there's a real need for some local guidelines.</p>\n", "parentCommentId": "tYsQSWfWfpEqp4Nfd", "user": {"username": "Amanda_Jane"}}, {"_id": "KgaKYgK8aThuFMsdX", "postedAt": "2014-10-11T06:29:20.085Z", "postId": "S5eQJ4Rg3xxPNAnFN", "htmlBody": "<p>Haha thanks Michael - I have rural Australia problems :( There is actually an &quot;ethical food&quot; cafe that opened this year that has some delicious vege lunch items. A lot of beef is raised locally here so not supporting the local industry is pretty unpopular :/</p>\n", "parentCommentId": "2B2cgGJLxDyNoW2ea", "user": {"username": "Amanda_Jane"}}, {"_id": "NEusQhktm9fFtmouM", "postedAt": "2014-10-14T06:00:05.347Z", "postId": "S5eQJ4Rg3xxPNAnFN", "htmlBody": "<p>Turns out tax deductibility is much more complicated in Australia than elsewhere, and is made even worse by the fact that a couple of legal challenges are currently underway, so the case law is in flux.</p>\n<p>There are a couple of people in Melbourne (not me!) who know their way around the tax system very well and are planning to write up the parts that would be relevant to setting up a re-routing fund. I think they're not prioritising it because setting up such a fund looks like it would be at least 1 full time job, plus a decent amount of accounting/legal/senior-community-figure support.</p>\n", "parentCommentId": "tYsQSWfWfpEqp4Nfd", "user": {"username": "HelenToner"}}]