[{"_id": "YA3rGvEfoyPHsREA6", "postedAt": "2017-09-19T23:58:27.584Z", "postId": "S7EPTq2J5tvHkSFca", "htmlBody": "<p>It seems like there's very little work being done by EAs in this area. Is that your impression as someone who has spent a good amount of time talking to the relevant people? Do you think it would be good for more EAs to go into this area relative to the current numbers working on different causes?</p>\n", "parentCommentId": null, "user": {"username": "zdgroff"}}, {"_id": "PAax7wY75fTEfsW6A", "postedAt": "2017-09-20T05:44:02.283Z", "postId": "S7EPTq2J5tvHkSFca", "htmlBody": "<p>I am not sure we should focus more into this area, I just want to make sure that in general, people who go into policy or advocacy don't propagate bad ideas, or discredit EA with important people who would otherwise be aligned with our goals in the future. </p>\n<p>I do think that knowing the history of transformative technologies (and policies that effected how they were deployed) will have a lot of instrumental value for EAs trying to make good decisions about things like gene editing and AI.</p>\n", "parentCommentId": "YA3rGvEfoyPHsREA6", "user": {"username": "Gentzel"}}, {"_id": "MNoty7B9N2TtBCHEZ", "postedAt": "2017-09-20T07:12:52.517Z", "postId": "S7EPTq2J5tvHkSFca", "htmlBody": "<p>This post was very useful. I'm moderately familiar with this topic but I learnt a number of new important facts. Keep it coming!</p>\n", "parentCommentId": null, "user": {"username": "Robert_Wiblin"}}, {"_id": "RJ87uuWmqye4czeK6", "postedAt": "2017-09-26T14:12:10.208Z", "postId": "S7EPTq2J5tvHkSFca", "htmlBody": "<p> &quot;Making blunt pushes for different policies are likely to be unimpactful on policy or harmful if impactful.&quot; I think that this is true in many cases, but is often not considered by activists lobbying for change. It's very easy to protest in favor of an ideal, but asking for an extreme alternative immediately seems naive to people in positions to cause direct change. In my opinion, activists are most effective when they consider the pressures that are preventing change from the current state, and ask for alternatives that are mindful of these pressures. </p>\n<p>Great example that we need to take the time to educate ourselves and assume that most of the people making decisions are smart, capable people.</p>\n", "parentCommentId": null, "user": {"username": "aspencer"}}]