[{"_id": "xLuzQR4MBEdynQE74", "postedAt": "2022-09-05T18:28:22.748Z", "postId": "S9JeqH4qYvoLZqq9c", "htmlBody": "<p>I think this is a great post and I’m glad you took the time to summarize your longer post!</p>\n<p>In my experience, the longtermist/ x-risk community has an implicit attitude of “we can do it better.” “We’re the only ones really thinking about this and we’ll forge our own institutions and interventions.” I respect this attitude a great deal, but I think it causes us to underestimate how powerful the political and economic currents around us are (and how reliant we are on their stability).</p>\n<p>It just doesn’t seem that unlikely to me that we come up with some hard-won biosecurity policy or AI governance intervention, and then geopolitical turmoil negates all the intervention’s impact. Technical interventions are a bit more robust, but I’d claim a solid subset of those also require a type of coordination and trust that systemic cascading risks threaten.</p>\n", "parentCommentId": null, "user": {"username": "MJusten"}}, {"_id": "53tFB9WqhzRXrQWxc", "postedAt": "2022-09-05T19:08:56.523Z", "postId": "S9JeqH4qYvoLZqq9c", "htmlBody": "<p>I love your thoughts on this.</p><p>Need to do more thinking on whether this point is correct, but a lot of what you're saying about <i>forging our own institutions</i> reminds me of <a href=\"https://forum.effectivealtruism.org/posts/n3WwTz4dbktYwNQ2j/critiques-of-ea-that-i-want-to-read\">Abraham Rowe's</a> forum post on EA critiques:</p><blockquote><p><strong>EA is neglecting trying to influence non-EA organizations, and this is becoming more detrimental to impact over time.</strong></p><p>I’m assuming that EA is generally not missing huge opportunities for impact. As time goes on, theoretically many grants / decisions in the EA space ought to be becoming more effective, and closer to what the peak level of impact possible might be.</p><p>Despite this, it seems like relatively little effort is put into changing the minds of non-EA funders, and pushing them toward EA donation opportunities, and a lot more effort is put into shaping the prioritization work of a small number of EA thinkers.</p></blockquote>", "parentCommentId": "xLuzQR4MBEdynQE74", "user": {"username": "Richard Ren"}}, {"_id": "HkoziAaWDyx8FfuYK", "postedAt": "2022-09-06T18:18:12.728Z", "postId": "S9JeqH4qYvoLZqq9c", "htmlBody": "<figure class=\"table\"><table style=\"background-color:rgb(255, 255, 255)\"><tbody><tr><td style=\"background-color:rgb(255, 255, 255);border:0px solid rgb(204, 204, 204);padding:10px 5px;vertical-align:top\"><p>It seems like the TLDR of your post is that short term risks are important because they impact the way long term risks are solved.</p><p>&nbsp;</p><p>Although people in EA are more concerned about AI and bioextinction (perhaps disproportionately so), I feel like your argument can extend for any argument — any progress one makes, for instance, on disease prevention/malaria nets impacts the same outcome of economic wellbeing &amp; thus transition + resilience against climate change.</p></td></tr></tbody></table></figure><p><br>&nbsp;</p>", "parentCommentId": null, "user": {"username": "a1yssan13"}}, {"_id": "Q2X9P2d65AFamDELx", "postedAt": "2022-09-06T19:20:48.743Z", "postId": "S9JeqH4qYvoLZqq9c", "htmlBody": "<p>Thanks a ton for your critique!</p><blockquote><p>your argument can extend for any argument — any progress one makes, for instance, on disease prevention/malaria nets impacts the same outcome of economic wellbeing &amp; thus transition + resilience against climate change.</p></blockquote><p>I think a lot of these arguments remind me of the <strong>narrow vs broad</strong> intervention framework, where <strong>narrow</strong> interventions are targeted interventions meant at mitigating a specific type of risk while <strong>broad</strong> interventions include generally positive interventions like economic wellbeing, malaria nets, etc. that have ripple effects.&nbsp;</p><p>Your point would be that the systemic cascading lens enables us to justify any broad intervention through its nth order impacts.</p><p><strong>But my response would be that I'm not necessarily advocating for broad interventions</strong>, especially ones that might be perceived as taking time, having unpredictable effects, and often working with very general concepts like \"peace\" or \"education.\" While I still use n-th order effects to articulate my argument (and express the importance of economic &amp; political systems in longterm risk), I’m arguing for a very narrowly focused intervention – meant to mitigate very specific political risks through securing stable supplies of commodities necessary to live during times of general political crisis &amp; elucidated through the systemic cascading risk framework.</p><p>I'd further that systemic cascading risks aren't just defined by ripple effects that go through systems (then, everything would definitionally be a systemic cascading risk or benefit), but rather ripples that <i>increase in magnitude due to system vulnerabilities</i>, helping to further confine the definition to a narrow subset of risks.</p><p>Although my critique at large is that EA has failed to connect complexity with longtermism, I'm arguing that the systemic cascading lens fills that gap – enabling specific, tractable, and targeted interventions.</p>", "parentCommentId": "HkoziAaWDyx8FfuYK", "user": {"username": "Richard Ren"}}, {"_id": "saXrwXLLfGDMbJcAa", "postedAt": "2022-09-07T07:24:05.800Z", "postId": "S9JeqH4qYvoLZqq9c", "htmlBody": "<p>I like the claims and the epistemic bridge, great post.</p><p>The \"global wheat and barley export reduction\" AFAIK was closer to 4% and inflated because of some statistical misrepresentations in the media. Price hikes are accurate though and that only adds to your argument. 4% reduction is big in a system that needs robustness of 97%+.<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefqclm3ru7ovr\"><sup><a href=\"#fnqclm3ru7ovr\">[1]</a></sup></span></p><figure class=\"image\"><img src=\"https://cdn.discordapp.com/attachments/966440328691318829/1016969542880206848/unknown.png\"></figure><figure class=\"image\"><img src=\"https://cdn.discordapp.com/attachments/966440328691318829/1016969543144460308/unknown.png\"></figure><p>As a tractable problem, there's more criticism, i.e. it's hard to see exactly what I could do except a drought monitoring system. 5% of global climate investments is still much more than EA funding combined. Other potential solutions seem to be about assisting governments (which governments do pretty well) and creating new infrastructure in underserved areas. However, if we do it at the wrong spot, that long-tail catastrophe will not be alleviated by our solution. However, there are more tractable and neglected ideas in this vein, e.g. quick brainstorm:</p><ul><li>Increasing global coordination and \"friendship\", i.e. a political mediation cause area</li><li>Reducing centralization of core infrastructural planning, e.g. ensuring national independence from EU (see Switzerland's intranational governance design)</li><li>Creating more institutions like Our World in Data that can inference, monitor, and assist in situations like Covid-19, climate change, drought prediction, etc. (which they are doing an excellent job of with only 25 people)</li><li>Creating complex systems models of critical infrastructure in the world. The OECD, UN, WHO already does a bit of this but they're not very good. Creating more and better of these might assist in predicting long-tail risks.</li></ul><p>And the reason for linear effects focus is that nonlinear dynamical systems are rapt with long-tail, low-probability, catastrophic events which are hard to predict, i.e. nth order effects end up being hard to act on compared to linear effect, hence GiveWell et al. I still think it's highly relevant to include in our work but it's definitely harder to act on.</p><p>I like the epistemic bridge - I agree that longtermism is too segregated from the existing ML networks and not embedded in society for reasons that MichelJusten also mentions.</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnqclm3ru7ovr\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefqclm3ru7ovr\">^</a></strong></sup></span><div class=\"footnote-content\"><p>It might be different from 4% but it is lower than a third of global exports, depending on what \"disrupted\" means.</p></div></li></ol>", "parentCommentId": null, "user": {"username": "esben-kran"}}]