[{"_id": "3ZZrph62bYxRLfEia", "postedAt": "2023-01-19T03:40:49.178Z", "postId": "SaRFsRDrneDgxNBbh", "htmlBody": "<p>Thanks for this post. I’ll make a short comment here (noting that there’s more comments in the other forum) from the perspective of someone who has spent 10+ years in middle management positions in large (1000+ person) organisations.</p><p>I’ve seen things like many of the above anecdotes play out, so I mostly agree that these things are all possible, a problem, and worth mitigating. But I’d make two defences of middle management:</p><ol><li>There’s also a failure mode where senior managers think they can do both senior management and middle management. In a large organisation, the CEO investing time in understanding the widget manufacturing processes is a poor investment of their time. Lots of senior managers are drawn into that trap. (Particularly if they started out as a widget maker and therefore have specific views. Often views that are now outdated for reasons they’ve missed since they were last widget-making.) So I wouldn’t want any current or prospective senior manager to read this post and imagine they can somehow lead a large organisation without middle managers.&nbsp;</li><li>Middle managers do necessary work. The example company that makes widget-1 in small quantities in a single location likely doesn’t need middle management. But once the company is making widgets 1 to 100, there are all kinds of failure modes that develop at that working level. The people making widget-1 will come up with what they see as an efficiency, but actually it’s a problem for the integration of widget-1 with widget-68 in a way that the widget-1 makers don’t understand.<br><br>The people that make widget-5 want to make it blue because it’s easier to make. But the marketing people want widget-5 to be red because it will increase sales. And the logistics people think the key change to widget-5 would be making it smaller so it stacks better. Settling that dispute can’t be done by any of those working-level teams (the person running the widget machine shouldn’t be spending time synthesising logistics reports), and it’s below the pay grade of the CEO (their job is to say ‘balance those three factors in the best way’). So you need a process where teams of middle managers can sit down and compare those things. And the outcome of that process is very likely two working-level teams thinking ‘these middle managers have no clue what they’re talking about’. That’s just how the world goes.&nbsp;</li></ol><p>It’s no accident that there have been middle managers since the dawn of civilisation. It’s worth thinking about how the CEO can keep a good understanding of their organisation with sensible time investment. And it’s worth thinking about how to ensure widget makers can see the overall strategic vision with sensible time investment. It’s worth thinking about how to ensure middle managers resolve disputes with evidence and reason rather than internal game-playing. I don’t think it’s worth thinking about how to get rid of middle management. I think it would be harmful for a CEO to hold off on hiring managers when their organisation starts to need them.&nbsp;<br><br>&nbsp;</p>", "parentCommentId": null, "user": {"username": "Greg S"}}, {"_id": "rgKJDcc9AjutXyJmT", "postedAt": "2023-01-21T05:00:26.387Z", "postId": "SaRFsRDrneDgxNBbh", "htmlBody": "<p>It would be interesting to investigate the alternative ways of doing things, not only as possible solutions to the maze problem, but also for understanding where those alternative solutions do not work well and therefore, what the actual benefit from the maze-style organizations may be.</p><p>1. Open source movement. Here we have tried to not create the mazes in the first place. The work was done in bottom-up manner, the programmer was at charge. The biggest problem in this model is financing. Basically, it's a trade of: You trade not having mazes for not having money. Also, when project grows big, there's some need for management (a.k.a. herding cats). Here we've seen the BDFL model, Debian model etc. The best resource on open-source movement that I am aware of it this one: https://www.fordfoundation.org/media/2976/roads-and-bridges-the-unseen-labor-behind-our-digital-infrastructure.pdf</p><p>2. Non-governmental model. The idea here is to work in parallel, even to cooperate with a mazed organization (say a part of government) while staying simple and non-mazed yourself. Example: https://www.worksinprogress.co/issue/the-story-of-vaccinateca/ Another example: https://www.lesswrong.com/posts/5b6YcFbEBCZbX6YSK/jean-monnet-the-guerilla-bureaucrat I not sure what the biggest problem is here, may as well be financing, same as in pt.1. Actually, I think we need more case studies to understand how this works better. I am trying to cook something in this direction myself. If you've done something interesting in this \"parallel\" modus operandi, do contact me, I may be willing to fund a case study.</p>", "parentCommentId": null, "user": {"username": "MartinSustrik"}}]