[{"_id": "47j3EGx8ZQBiBdgoA", "postedAt": "2021-11-04T17:32:36.877Z", "postId": "Saza3y7tEdgCZ47kK", "htmlBody": "<p>Thank you Micheal -- Great Post! I love this part:</p><blockquote><p>Design systems that scale from a small base. If you have a grand plan that requires a complete system to function, but no way of getting there, you do not have a plan.</p></blockquote><p>At the EAG Virtual Entrepreneurs Gatheround event, the discussion of going from 0-&gt;1 came up over and over. One trap I see in EA is the hesitancy to act under uncertainty. Yonatan Cale's recent post <a href=\"https://forum.effectivealtruism.org/posts/FkWHn6WaFGzrzqb9P/i-m-offering-free-coaching-for-software-developers-in-the-ea\">I’m Offering Free Coaching for Software Developers in the EA community</a> demonstrates an approach to break out of this trap: start small, launch fast, stay open to feedback.</p><p>One perspective on the Play Pumps story is that the founder failed to pay attention to feedback: what was the experience of the first kid who used the first Play Pump?&nbsp;</p><p>I'm glad you wrote this, let's explore Systems and Complexity further -- one great venue is <a href=\"https://www.complexityweekend.com/\">Complexity Weekend</a> -- can we borrow some of their tools/processes for an EA Systems and Complexity Event?</p>", "parentCommentId": null, "user": {"username": "--alex--"}}, {"_id": "X8mChiJfFKDuaS2HH", "postedAt": "2021-11-06T01:23:29.658Z", "postId": "Saza3y7tEdgCZ47kK", "htmlBody": "<blockquote><p><i>“Economics can be harder than rocket science: the Soviet Union was great at rocket science”</i></p></blockquote><p>This is a good quote, but it seems a little unfair. The Soviet's rocket scientists were brilliant scientific thinkers, while their economic planners really <a href=\"https://en.wikipedia.org/wiki/Lysenkoism\">were not</a>. I don't think we have clear evidence one way or the other regarding how well central planning would work if the central planners were particularly smart people with good epistemic hygiene.</p>", "parentCommentId": null, "user": {"username": "Daniel_Eth"}}, {"_id": "wFoqxDdjnaFkoQc2j", "postedAt": "2021-11-06T22:16:39.951Z", "postId": "Saza3y7tEdgCZ47kK", "htmlBody": "<p>The link in this comment confuses me. Lysenko was not an economist and Lysenkoism was not primarily a matter of economic planning. Rather it was state-enforced pseudoscience, which seems like a pretty different dynamic.</p>\n<p>Also, IIRC the peak of Lysenkoism was at a time when the Soviet economy was developing quite quickly; the serious stagnation came later, after Lysenkoism had fallen from prominence. So this doesn't really seem like evidence in favour of your claim re economic planning.</p>\n", "parentCommentId": "X8mChiJfFKDuaS2HH", "user": {"username": "willbradshaw"}}, {"_id": "BJaiLFSpBpx5nzk7w", "postedAt": "2021-11-07T06:57:45.023Z", "postId": "Saza3y7tEdgCZ47kK", "htmlBody": "<p>Lysenkoism was <a href=\"https://www.theatlantic.com/science/archive/2017/12/trofim-lysenko-soviet-union-russia/548786/\">used by central planners</a> to attempt to improve Soviet agricultural output, and, unsurprisingly, exacerbated famines. This is just one example of how dumb Soviet central planners were on critical issues. I doubt the Soviet space program would have worked as well as it did if the thinking of their rocket scientists was at a similar level to that of those running their economy.</p>", "parentCommentId": "wFoqxDdjnaFkoQc2j", "user": {"username": "Daniel_Eth"}}, {"_id": "guNStkD2uuRPnEEL2", "postedAt": "2021-11-10T09:22:37.246Z", "postId": "Saza3y7tEdgCZ47kK", "htmlBody": "<p>Hi Daniel,</p><p>Sorry, I only just saw your comment!</p><p>I think Lysenko and Lysenkoism is completely fascinating, but kind of proves the quote above.&nbsp;</p><p>Lysenko was a biologist of sorts whose falsified, confused and just invented results on plants supported Stalinist and Marxist thinking on how people are not innate but created by environments, and then got brought into GOSPLAN to bring these insights to the economy. This is not because there was a lack of brilliant economists initially, just that those Stalin had were either cringing on his party lines, hidden in side posts for their own good, or <a href=\"https://en.wikipedia.org/wiki/Nikolai_Kondratiev\">dead</a>.&nbsp;</p><p>The problem was both to solve a complex problem (economics) and do it in a way that was acceptable to your masters and Marxist thinking of the time, which made the problem more complex than rocket science.</p><p>Once we move past Stalin (<a href=\"https://slatestarcodex.com/2014/09/24/book-review-red-plenty/\">Red Plenty is very readable on this</a>!) we get people like Kantorovich stepping out of the shadows. They were really smart, inventing new tools we use today and were really brilliant thinkers, but still had to solve not only the problem of the maths, but also the difficulty in understanding the people who they were supposedly commanding and their complexity and agency. On top of this, some tools and analysis are still forbidden to you.</p><p>Compare this with the rocket programme. Brilliant scientists again, solving really difficult problems, but orbital mechanics does not shift its behaviour to ruin your plan based on complicated politics (you may have missed an interaction, but they're a property of your materials and physical forces), and solving physics equations does not contradict Marxist thought (mostly, <a href=\"https://en.wikipedia.org/wiki/Suppressed_research_in_the_Soviet_Union#Physics\">E=MC2 was banned for a period </a>as it apparently contradicted Marx).</p><p>The point of the Soviet Union's failure, or that quote, was not that if it had a few more smart economists or thinkers they would have succeeded, or that economists are somehow better than physicists. The point was that they were trying to do something that could not be done with their or our technology: fully tame and control complexity like it was a space rocket.</p>", "parentCommentId": "X8mChiJfFKDuaS2HH", "user": {"username": "Michael Hinge"}}]