[{"_id": "4btuo9TzDnkhuNdmd", "postedAt": "2022-11-30T19:12:28.293Z", "postId": "Sc8XLTPaNiKFJcvsg", "htmlBody": "<p>Nice post. I am currently asking a lot why my comments are being downvoted recently. I would appreciate more information on them so I can be better at sharing information.</p>\n<p>I'm curious as to why my reductionist approach is also being disliked as in real world scenarios it is very productive. Yeah just hope people explain further to what extent they do not like but yeah I also understand the difficulty of explaining.</p>\n", "parentCommentId": null, "user": {"username": "Miguel"}}, {"_id": "NLEbCzYfbm4SpAatL", "postedAt": "2022-11-30T21:26:35.270Z", "postId": "Sc8XLTPaNiKFJcvsg", "htmlBody": "<p>Hmm, I posted stuff that got downvotes, and the few comments I received were along the lines of \"provide examples\" or \"what are you talking about?\"</p>\n<p>You can hover over the listing of your vote number and see how many votes your post received. In some cases, that will clarify whether there was a mix of upvotes and downvotes.</p>\n", "parentCommentId": null, "user": {"username": "Noah Scales"}}, {"_id": "oeuqMbTCpeHApmfKv", "postedAt": "2022-11-30T21:46:41.331Z", "postId": "Sc8XLTPaNiKFJcvsg", "htmlBody": "<p>I didn't downvote either of your articles on misquoting. Skimming over the first article now, it seems reasonably well argued.</p><p>However, I agree with the following points made on <a href=\"https://forum.effectivealtruism.org/posts/gL7y22tFLKaTKaZt5/debate-about-biased-methodology-or-corentin-biteau-and?commentId=apfB38KGGmH85v44a\">this comment </a>(which you also referred to in your second article):</p><blockquote><ul><li>There's <a href=\"https://www.cold-takes.com/honesty-about-reading/\">too much to read</a>, so people don't have extensive time to engage with everything. <strong>Try to be succint.</strong><ul><li>One of your post spent 22 minutes to say that people shouldn't misquote. It's a rather obvious conclusion that can be exposed in 3 minutes top. I think some people read that as a rant.</li></ul></li><li>Use <strong>examples </strong>showing why the topic is important (or even stories). It allows to link your arguments to something that exists.<ul><li>You can think with purely abstract stuff - but most people are not like that. A useful point to keep in mind is <i><strong>you are not your audience</strong></i>. What works for you doesn't work for most other people. So adapting to other reasoning types is useful.</li></ul></li></ul></blockquote><p>From skimming your first misquoting article, I don't think you've made the case that misquoting is a particular problem within EA. I don't think there are any examples? In which case, some people might read it, get to the end and think \"well that was a waste of 22 minutes and hardly seems relevant to EA, so I'll downvote it to deter others from spending time reading it\".</p>", "parentCommentId": null, "user": {"username": "Matt_Sharp"}}, {"_id": "27LRsmWbjoWkWtyLd", "postedAt": "2022-12-01T00:29:00.008Z", "postId": "Sc8XLTPaNiKFJcvsg", "htmlBody": "<p>What sort of examples do you want? Do you want me to call out specific individuals who misquoted and say that's bad? You could look through my comment history and find some examples if you want to, but I thought drawing attention to and shaming those people would be bad.</p>\n<p>It's easier to discuss whether misquoting is very bad for truth seeking, and mistreats a victim, <em>without</em> simultaneously making it a discussion about whether particular individuals in the community are bad.</p>\n<p>The deadnaming article has a one paragraph summary near the start. It also has the text:</p>\n<blockquote>\n<p>I think this norm [against deadnaming] is good. I think the same norm should be applied to misquoting for the same reasons. It currently <a href=\"https://forum.effectivealtruism.org/posts/GHFY6SpLkjML2Ld62/ask-everyone-anything-ea-101-1?commentId=rGybCq7pbkCpoj7D8\">isn’t</a> (<a href=\"https://forum.effectivealtruism.org/posts/GHFY6SpLkjML2Ld62/ask-everyone-anything-ea-101-1?commentId=mMKrnG3LqdfGZzyPd\">context</a>).</p>\n</blockquote>\n<p>The links clarify that EA does not have a strong norm against misquoting. What's the problem? Maybe you missed that part when skimming? It's in the introduction immediately before the article summary. The rest of the article does not attempt to argue this point; it's talking about something else which builds on this premise.</p>\n<p>Why is this even controversial? If I tell you a misquote or poor cite in the sequences or some other literature you like, you aren't going to care much or start taking actions regarding the problem (such as checking whether the same author made more errors of a similar nature), right? You don't believe that misquoting is like deadnaming someone and should have a similar norm against it because it's hurtful to the victim in addition to being poor scholarship, do you? Don't you disagree with me and know that you disagree with me? The norm I'm advocating is not normal nor popular with any large group. So, fine, disagree with me – but I find it a really bizarre reaction for people who disagree with me to dismiss my arguments on the basis that I'm obviously right and this is a waste of time due to being uncontroversial common knowledge. Most people think stuff like \"People are sloppy sometimes, which isn't a big deal.\" instead of thinking, \"Being sloppy with quotes in particular isn't acceptable. Use copy/paste. If you must type something in, triple check it. There's no real excuse for quotes to be inaccurate in tiny ways; that's really bad even if the wording changes do not substantively change the meaning.\"</p>\n<p>I'd like to first establish that this issue matters, and only second, potentially point out some specific examples. As long as I don't think anyone considers misquoting to actually be very bad, I don't think it's a good idea to bring up examples of people doing it. Also I don't think the problem is a few individuals behaving badly; it's a widespread problem of community attitudes and norms. The community simply doesn't value this kind of accuracy and is OK with misquotes; in that context, it's unfair to be very hard on individuals who get caught misquoting, so that's another reason not to name and shame anyone. If i give examples people will just tell me that the misquote didn't change the conclusion in that case and therefore doesn't really matter (rather than agreeing with me), which <em>is not the point</em>. Misquotes mistreat the person quoted like deadnaming, and also like other inaccuracies they're bad for truth seeking whether or not they change the conclusion. These are not popular claims, but I think they're important, so I tried to argue and explain them, and neither of these claims would be served well by examples because they're both about concepts not concretes. And if people don't like conceptual articles, or struggle to understand them, or don't like long articles ... fine whatever, but saying that people <em>agree</em> with me, when they don't, is really weird.</p>\n", "parentCommentId": "oeuqMbTCpeHApmfKv", "user": {"username": "Elliot Temple"}}, {"_id": "MnkfzTYFiBjqKScec", "postedAt": "2022-12-01T12:22:59.233Z", "postId": "Sc8XLTPaNiKFJcvsg", "htmlBody": "<blockquote><p>What sort of examples do you want? Do you want me to call out specific individuals who misquoted and say that's bad? You could look through my comment history and find some examples if you want to, but I thought drawing attention to and shaming those people would be bad.</p></blockquote><p><br>It's generally a good sentiment to not want to call out specific individuals, particularly if they are not repeat offenders. However, if this is a widespread issue that is worth the attention of the community, then providing lots of examples will help demonstrate the scale of the problem without it seeming like you're picking on one or two people.&nbsp;</p><p>If it is only one or two people who are repeat offenders, and these are senior members of EA orgs (and/or regular posters on the EA Forum), then it may be justified in shaming them.</p><blockquote><p>It's easier to discuss whether misquoting is very bad for truth seeking, and mistreats a victim, <i>without</i> simultaneously making it a discussion about whether particular individuals in the community are bad.</p></blockquote><p>Without examples to demonstrate that it's a common issue in the EA community, you may find that the discussion is very short, as I suspect most people will just think \"yeah, misquoting is indeed bad for truth seeking, which is why I don't do it\".&nbsp;</p>", "parentCommentId": "27LRsmWbjoWkWtyLd", "user": {"username": "Matt_Sharp"}}, {"_id": "wq2EpHS28zATfq6PZ", "postedAt": "2022-12-01T15:33:41.303Z", "postId": "Sc8XLTPaNiKFJcvsg", "htmlBody": "<p>Do you believe misquoting violates consent similarly to deadnaming, and should have a similar norm against it? Yes or no?</p>\n", "parentCommentId": "MnkfzTYFiBjqKScec", "user": {"username": "Elliot Temple"}}, {"_id": "9bmjgpS37eBa62JgC", "postedAt": "2022-12-01T16:05:18.259Z", "postId": "Sc8XLTPaNiKFJcvsg", "htmlBody": "<p>I don't think I know enough about either to make that judgement.&nbsp;</p><p>Also tbh right now I don't have the time or interest to debate this topic. I provided the above comments as possible reasons you received a few downvotes, rather than to indicate a desire to debate the topic itself.</p>", "parentCommentId": "wq2EpHS28zATfq6PZ", "user": {"username": "Matt_Sharp"}}]