[{"_id": "upXxMoybuQ2zfaGQ3", "postedAt": "2023-10-13T08:49:53.682Z", "postId": "SCiAvwbczwag8on6S", "htmlBody": "<p>I’m providing a comment as opposed an answer due to my high level of uncertainty on my “answer”.</p>\n<p>My experience is mainly in U.K. policy/Government, though I have experience working with the US internationally so have seen how their internal general decision-making systems work. I also think this post (if not already seen) is a good initial filter on fit for policy vs politician: <a href=\"https://forum.effectivealtruism.org/posts/BjgE7EpCKodQ3nAyp/two-cheap-ways-to-test-your-fit-for-policy-work\">https://forum.effectivealtruism.org/posts/BjgE7EpCKodQ3nAyp/two-cheap-ways-to-test-your-fit-for-policy-work</a></p>\n<p>Answer:\nMy prior is that role in a politicians team or powerful lobby groups is best in the US. Given practically all the very senior jobs in the US civil service are political appointments, there are big risks of a lower ceiling long-term if you aren’t within a political machine. Equally, with the system of government the US has (presidential and federalised), there is more opportunity in congressional and even lower political appointments (e.g. state governor) to influence policy. Due to this increased political surface area, lobbying also seems pretty influential.</p>\n<p>The counter to my argument would be if the person is less clear on their policy area of interest, or had limited understanding of how to get things done in Government (the machine is still very important even if you have a powerful politician behind you). Given their an undergrad then that could very well be the case, which may mean a civil service or even think tank role may be preferable to gain said knowledge.</p>\n<p>I think aiming to be a politician straight out of an undergrad is highly unlikely to be successful and potentially a negative move. They could limit their flexibility that early career gives them. Equally with limited experience of how it works, they may not fully appreciate the skills the traits needed to actually deliver change and turn policy ideas into legislation etc. I’m fully behind the ambition, but I think it’s far more valuable to spend a few years building the knowledge and contacts before diving into a political career. Esp. if they are quite heavily interested/focused on a single issue (bio + AI).</p>\n<p>Note: I’ve assumed this is a US based ask. If it was U.K. based I’d have very different views (and much more certain ones) given different power dynamics between politicians, civil service, and lobby/think tanks etc.</p>\n<p>I hope that somewhat helps!</p>\n", "parentCommentId": null, "user": {"username": "JamesN"}}]