[{"_id": "ATtLxAwxfZPgjqAGn", "postedAt": "2023-08-08T13:46:54.277Z", "postId": "SCKg5N9oHdBDxHvEM", "htmlBody": "<p>Patrick, thanks for sharing your story! Seeing all these high school students get involved in EA and starting high impact research projects before they even go to university can feel overwhelming; how could a mid-career professional compete with that???<br><br>Actually, mid-career professionals are <i>awesome</i>. They know how the real world works, and they know how to get stuff done. People who have only been students don't know how to navigate government bureaucracies, bring a product from conception to market, or manage large teams. Indeed, many of our most impressive community members spent their first 10+ years doing non-EA work in the \"real world\". Of course whiz kids are also fantastic! But they need mentorship!&nbsp;<br><br>So I'm really happy to see you found a place in the EA community, and I hope many more follow your path &lt;3 &nbsp;</p>", "parentCommentId": null, "user": {"username": "AbbyBabby"}}, {"_id": "g7DCfxpwaYvAnB6gY", "postedAt": "2023-08-09T09:25:17.459Z", "postId": "SCKg5N9oHdBDxHvEM", "htmlBody": "<p>Thank you very much for sharing your insightful and motivating story.</p><p>But I'd like to advise to always be wary of survivorship bias. People who burned out are much less likely to write about it than someone who made it.</p><blockquote><p>Parallel to this, I gained the confidence to decline job offers from EA-aligned organisations that I perceived as having less impact, despite their appeal. Some opportunities involved leading teams at EA-aligned startups. However, accepting them would have meant deviating from the top causes on my list. Instead of settling for the next available option, I <a href=\"https://80000hours.org/articles/be-more-ambitious/\"><u>aimed high</u></a>, seeking roles that matched exceptionally well with my skills and the cause areas I had on the top of my list.</p></blockquote>", "parentCommentId": null, "user": {"username": "Milli"}}, {"_id": "GCnhc3c9nDiGPJbEw", "postedAt": "2023-08-10T18:16:00.725Z", "postId": "SCKg5N9oHdBDxHvEM", "htmlBody": "<p>This in many ways, is really affirming. Thanks for writing!</p>", "parentCommentId": null, "user": {"username": "Masha Winchell"}}, {"_id": "KtDGsjzF6RkKoCEz2", "postedAt": "2023-08-15T14:04:03.414Z", "postId": "SCKg5N9oHdBDxHvEM", "htmlBody": "<p>Thank you for writing this article Patrick.</p><p>As someone with a similar-ish background of discovering EA in mid-career, many of the things you mentioned resonate with my experience. I might write a post about my own experience.</p>", "parentCommentId": null, "user": {"username": "Eli Kaufman"}}, {"_id": "y5mbjWKrSmCRdscCL", "postedAt": "2023-08-23T06:49:34.599Z", "postId": "SCKg5N9oHdBDxHvEM", "htmlBody": "<p>Thank you Patrick for sharing your story. I am going through a similar journey myself as a mid-career professional. Such stories keep me motivated when it is unclear what the next steps are.</p>\n<p>I am in a good position because I am not under the short term time pressure to figure this out. As Milli | Martin wrote I wonder how many people are burnt out in the process.</p>\n<p>I think there would be merits to understanding how long does it take for mid-career people to find a good placement, what are the dropout rates and what could be done to shorten this timeframe possibly.</p>\n<p>Typically at this point in life, there is more pressure both from the financial and family side to figure this out if the person is the primary earner in the given family.</p>\n", "parentCommentId": null, "user": {"username": "GaborSzorad"}}]