[{"_id": "jgojEAk6pA4m5kbGc", "postedAt": "2018-01-25T01:28:09.267Z", "postId": "ScLHyCY6JCr5FtuiY", "htmlBody": "<p>Sadly, EA negatively selects against do-ers, because do-ers need opportunities to make a direct difference. There are plenty of opportunities to do things within meta-EA, but people need to buy into EA before they want to work on meta-EA, so we need some more immediate volunteering opportunities to bridge the gap. I do like the Self-Care, Direct Impact, Career Capital and Personal Fit breakdown, although I'd probably split motivation off into a seperate category, as some volunteering opportunities can motivate you more to give to charity or to work to make a difference in the world.</p>\n", "parentCommentId": null, "user": {"username": "casebash"}}, {"_id": "PXDneBxm7PWw4qiJ2", "postedAt": "2018-01-25T19:13:09.482Z", "postId": "ScLHyCY6JCr5FtuiY", "htmlBody": "<p>There are a few things I did not see on the list that I learned in a volunteer management class. </p>\n<ol>\n<li><p>It is important to understand what stage of life you are at and what your nature is. ie you might normally really love to work alone in a high powered way but you recently lost your husband and suddenly team work would be much more helpful in getting you back on your feet faster.  </p>\n</li>\n<li><p>Sometimes highly professional people want to volunteer in an area outside of their area of expertise. Not only for their CV but to allow a part of them they  never had time to cultivate a chance to flourish. Although this might not look like the most &quot;effective&quot; choice  it might unleash a lot of passionate new inspiration and turn into something productive indeed. </p>\n</li>\n<li><p>The last point you made is so important It takes valuable staff time to orient a volunteer and manage them so you need to be really certain that your contribution warrants it. I find that even if I want to help an organization more directly as a volunteer, if they do not have a dedicated staff person that integrates volunteers then it can be quite frustrating for both sides. It is interesting to me that many orgs hire fundraisers. I would think it might be really useful to train fundraisers to be friend raisers for the organization as well and have them help integrate people into gratifying and meaningful volunteer positions. </p>\n</li>\n</ol>\n", "parentCommentId": null, "user": {"username": "tamama"}}, {"_id": "bQkptH6tpZSfoxxGy", "postedAt": "2018-01-25T22:35:10.014Z", "postId": "ScLHyCY6JCr5FtuiY", "htmlBody": "<p>Here in Wisconsin, unless you're living in Milwaukee or Madison, there are few genuine volunteer opportunities. Sure, one can mow the lawn of a church or dust shelves at the local library--but non-altruistic activities usually outweigh the free grunt labor. </p>\n<p>I used to volunteer for Habitat for Humanity. I considered each time there genuine. I helped with three houses over three summers (age 15 16 17--before they had an age requirement). Hammering nails, putting up siding, painting, etc. At age 22, after taking the student GWWC pledge and becoming vegetarian, I decided I could still volunteer locally for Habitat. EAs can still volunteer locally. Even if, I believe, the greater more important struggle is lessening absolute poverty. And so I volunteered, twice for a fourth summer. For the experience (or the misnomer &quot;self care&quot;).</p>\n<p>Although, in my hometown, Habitat changed. They now get the workers of large companies (and the company pays for their time). I still pounded some nails, moving though the rafters like a monkey; a few other odd jobs too--but I really wasn't needed anymore. </p>\n<p>Even before, not every weekend was there a bunch of work to do, and one could always clean up the site and do prep work for the next phase. But today (for the Habitat in my hometown) it's different. They have a large pool of workers. I was &quot;extra.&quot; And everyone else was getting paid! </p>\n<p>In the end, the picture isn't that bleak. There is always an opportunity to do good. It just won't be formally defined or published. Informally, one can post on Craigslist to shovel snow for elderly or disabled people. Or ask a librarian to put up EA posters. And that's where I'm at right now. I'm looking for EA posters specifically for university students (to put up in academic buildings). Audience targeting is crucial. </p>\n<blockquote>\n<p>This is good for freshman or sophomores, but not upperclassmen:\n<a href=\"https://drive.google.com/file/d/0BwwvTgW1FiT_a3BaakZhQ19Yb3VpLVpLUUxuU3F1U2tRZk5B/view\">https://drive.google.com/file/d/0BwwvTgW1FiT_a3BaakZhQ19Yb3VpLVpLUUxuU3F1U2tRZk5B/view</a>\nBut no pictures!</p>\n</blockquote>\n<blockquote>\n<p>Banners here don't give enough information, no web links:\n<a href=\"https://drive.google.com/drive/u/0/folders/0B23EuZlq6yJ1UkY4NEdxRDl6X2c\">https://drive.google.com/drive/u/0/folders/0B23EuZlq6yJ1UkY4NEdxRDl6X2c</a></p>\n</blockquote>\n<blockquote>\n<p>All the rest are brochures, having too much information for a large poster:\n<a href=\"https://drive.google.com/drive/u/0/folders/0B6GSBBEzLsorR2E4elVPa2p6VkU\">https://drive.google.com/drive/u/0/folders/0B6GSBBEzLsorR2E4elVPa2p6VkU</a></p>\n</blockquote>\n", "parentCommentId": null, "user": {"username": "adamaero"}}, {"_id": "htqEM2naw6EkabA7w", "postedAt": "2018-01-25T22:51:11.097Z", "postId": "ScLHyCY6JCr5FtuiY", "htmlBody": "<p>I think volunteering opportunities that aren't formally defined are often the highest impact available. Well done for finding an opportunity to do good in your town. </p>\n", "parentCommentId": "bQkptH6tpZSfoxxGy", "user": {"username": "Khorton"}}, {"_id": "T35wpk3Fm5qL8SywJ", "postedAt": "2018-01-25T22:52:38.386Z", "postId": "ScLHyCY6JCr5FtuiY", "htmlBody": "<p>&quot;the misnomer self-care&quot;\nI'm also not about the name for this category of motivation. Can you think of a better name for it? </p>\n", "parentCommentId": "bQkptH6tpZSfoxxGy", "user": {"username": "Khorton"}}, {"_id": "2bRPkocKtHnsZRYZF", "postedAt": "2018-01-26T17:13:05.710Z", "postId": "ScLHyCY6JCr5FtuiY", "htmlBody": "<p>Awesome job! :-)\nIs it possible to see the list of the volunteering opportunities you found and considered?</p>\n", "parentCommentId": null, "user": {"username": "weeatquince"}}, {"_id": "aiKRPrfMHAdzSFanE", "postedAt": "2018-01-26T22:50:29.395Z", "postId": "ScLHyCY6JCr5FtuiY", "htmlBody": "<p>These are the opportunities we originally found and compared using the spreadsheet. We added the AI group in later:</p>\n<p>Effective Altruism London-Volunteer Coordinator</p>\n<p>SoGive-Charity Researcher</p>\n<p>Against Malaria Foundation-General Volunteer</p>\n<p>Against Malaria Foundation-Video Editor</p>\n<p>Results London UK-Lobbyist</p>\n<p>No Means No International-Fundraiser</p>\n<p>Light Up a Life-Packing Mini Hygeine Kits</p>\n<p>Samaritans-Listener</p>\n<p>Effective Altruism London-Pledge Drive Coordinator</p>\n<p>Robes-Administrative Assistant</p>\n<p>The Access Project-Tutor</p>\n<p>Effective Altruism London - Diversity and Inclusion</p>\n<p>HIPE-Research on how to have an impact in the Civil Service</p>\n<p>All Fed    ?</p>\n<p>Ecology of Systems Thinking    ?</p>\n<p>Effective Altruism London-Welcoming New People</p>\n<p>Effective Altruism London-Career Advisor</p>\n<p>I tried to include a picture in the original article, but encountered technical problems. ;) </p>\n", "parentCommentId": "2bRPkocKtHnsZRYZF", "user": {"username": "Khorton"}}, {"_id": "pjCRdCvibuQqfoczC", "postedAt": "2018-01-27T21:16:10.548Z", "postId": "ScLHyCY6JCr5FtuiY", "htmlBody": "<p>I don't think it's something that can be defined. An experience is unique. The outcome is unknown. Sure, you could come up with some general ideas: </p>\n<ul>\n<li>activist networking (potential EAs ~ i.e., guiding an altruistic person into being effective--or at least pondering the core question: How to do the most good?) opposed to getting someone who hasn't volunteered a day in their life</li>\n<li>the power of a positive role models</li>\n<li>general methods or how to approach new things or refining work ethic, such as always finding work to do--even if it's cleaning, preparing or planning the next task</li>\n<li>unknown &quot;career capital&quot; (e.g., learning how to use power tools which will greatly improve my chance of gaining an electrical engineering internship at a power tool company years later)</li>\n<li>unknown unknown</li>\n</ul>\n<p>That is why, I simply like to use Experience. It's multidimensional--not fit for a spreadsheet. \nAlthough, there are different types of volunteer positions too. I'm really only discussing unskilled volunteer opportunities. They're usually not a formal &quot;position&quot; per se. </p>\n<p>On the other hand, skilled volunteer opportunities require more time. And that's where I lose the scent of the trail. I'm just a college student. </p>\n<p>I personally believe that just making money &quot;paid work or skill-building&quot; would outweigh local volunteering here in the States (unless living in a major city). But I'm not acknowledging the fact that just convincing one person (such during a local volunteering opportunity) to become an EA would make much more of an impact. But then again that's <strong>unknown</strong>--a second unknown. Not only is the Experience itself unknown; it's unknown who I can convince (what I like to think of as &quot;convert&quot; ~ a lifestyle change in my mind).</p>\n<p>I've never been able to convince a friend, family or classmate about EA. That's why all I really think these days is about informing people about the suffering of chickens within our borders and of absolute poverty abroad. Marginal efforts, yet worthy of mention. Something worth the breath rather than complaining about professors ;)</p>\n<p>And putting up posters! around campus specifically geared towards university students. Seems to me, page 67, that Solomon makes a good point about using more pathos than logos: <a href=\"https://www.goodreads.com/review/show/2227114171?book_show_action=false&amp;from_review_page=1\">Singer And His Critics (1999)</a>.</p>\n", "parentCommentId": "T35wpk3Fm5qL8SywJ", "user": {"username": "adamaero"}}, {"_id": "Ld7oySpNTCWNWFWiL", "postedAt": "2018-01-28T01:56:23.496Z", "postId": "ScLHyCY6JCr5FtuiY", "htmlBody": "<p>Thanks for mentioning <a href=\"http://allfed.info\">ALLFED</a>! We are indeed interested in volunteers. I agree that for many things, having a steady commitment is best. But sometimes there are self-contained volunteer activities, like <a href=\"http://www.x-risk.net/about/\">classifying whether papers are relevant to X risks</a> for CSER.</p>\n", "parentCommentId": "aiKRPrfMHAdzSFanE", "user": {"username": "Denkenberger"}}, {"_id": "sW5vjL7wzAsdn8A7w", "postedAt": "2021-09-22T08:31:02.647Z", "postId": "ScLHyCY6JCr5FtuiY", "htmlBody": "<p>Could someone provide more evidence/guide me to find more evidence regarding the claim that a good deal of volunteering is useless or even harmful? I'm curious about this but can't seem to find much when I google online. Thank you!</p>", "parentCommentId": null, "user": {"username": "pean01"}}, {"_id": "tZhnjvDTD4oqeL6GE", "postedAt": "2021-09-22T11:21:32.453Z", "postId": "ScLHyCY6JCr5FtuiY", "htmlBody": "<p>A starting point for this view is that volunteering isn't free for the charity you want to help: <a href=\"https://forum.effectivealtruism.org/posts/6uXZc2QqHXsHKaLy9/volunteering-isn-t-free\">https://forum.effectivealtruism.org/posts/6uXZc2QqHXsHKaLy9/volunteering-isn-t-free</a></p>\n<p>This Guardian article gives an overview of the most common criticisms of volunteering overseas, including links to articles that go into more depth: <a href=\"https://www.theguardian.com/news/2018/sep/13/the-business-of-voluntourism-do-western-do-gooders-actually-do-harm\">https://www.theguardian.com/news/2018/sep/13/the-business-of-voluntourism-do-western-do-gooders-actually-do-harm</a></p>\n", "parentCommentId": "sW5vjL7wzAsdn8A7w", "user": {"username": "Khorton"}}]