[{"_id": "zgFk3jE7MzMEQ3vFW", "postedAt": "2023-09-20T21:29:17.999Z", "postId": "SDyik6eNm53yBGeEe", "htmlBody": "<p><strong>Executive summary</strong>: The post highlights the growth, achievements, and vibrant diversity of the Effective Altruism (EA) community in New York City, emphasizing its thriving initiatives, active participation, and welcoming culture.</p><p><strong>Key points</strong>:</p><ol><li>NYC has one of the largest EA communities in the world, with around 600 active members in 2022. EA NYC events draw hundreds of attendees.</li><li>The community is active, hosting many events like speaker presentations, coworking sessions, reading groups, and social gatherings. 11 subgroups cater to specific causes and interests.</li><li>The NYC EA community is diverse and transient. It lacks a single dominant cause, leading to interdisciplinary thinking. The culture is fun and welcoming.</li><li>Many EA organizations have team members located in NYC. The community features cross-cause projects in AI, policy, psychology, animal welfare, and more.</li><li>Notable qualities of the NYC EA community highlighted include its warmth, down-to-earth nature, focus on well-being, and vibrant volunteer community.</li></ol><p>&nbsp;</p><p><br><i>This comment was auto-generated by the EA Forum Team. Feel free to point out issues with this summary by replying to the comment, and</i><a href=\"https://forum.effectivealtruism.org/contact\"><i>&nbsp;<u>contact us</u></i></a><i> if you have feedback.</i></p>", "parentCommentId": null, "user": {"username": "SummaryBot"}}, {"_id": "XSYKoencyp8vCueiK", "postedAt": "2023-09-21T17:21:34.157Z", "postId": "SDyik6eNm53yBGeEe", "htmlBody": "<p>What object-level achievements has EA NYC had, in terms of money moved, talent found and placed in organizations, policy and technical achievements by those organizations, etc.? To be a bit blunt, the EA community and community members are not the point of EA, impact is the point.</p>", "parentCommentId": null, "user": {"username": "tkwa"}}, {"_id": "qaHzoogNZFKC7WsfB", "postedAt": "2023-09-21T21:56:36.073Z", "postId": "SDyik6eNm53yBGeEe", "htmlBody": "<p>Thanks for raising this, Thomas! I agree impact is the goal, rather than community for community's sake. This particular Forum post was intended to focus on the community as a whole and its size, activity, and vibe, rather than on EA NYC as an organization. We plan to discuss EA NYC's mission, strategy, and (object-level) achievements more in a future post. There's a lot to say on that front and I don't think I'll do it justice here in a comment. If there are certain details you'd find especially interesting or useful to see in a future post about EA NYC, we'd love to know!</p>", "parentCommentId": "XSYKoencyp8vCueiK", "user": {"username": "Rockwell Schwartz"}}, {"_id": "Ju2pQYJmHa7BEPadu", "postedAt": "2023-09-22T10:38:05.195Z", "postId": "SDyik6eNm53yBGeEe", "htmlBody": "<p>This is a reasonable question to ask, but it felt a bit unkind so I downvoted. I think it's okay to post things that are clearly framed as \"here's the vibe of our community\" and not \"here's why we're impactful\" and I wish you'd at least acknowledged that was the aim of the post before requesting more info.&nbsp;</p>", "parentCommentId": "XSYKoencyp8vCueiK", "user": {"username": "OllieBase"}}, {"_id": "C7o9Ri3QLJ3qM9Sbi", "postedAt": "2023-09-22T12:01:56.812Z", "postId": "SDyik6eNm53yBGeEe", "htmlBody": "<p>When I wrote the comment, it wasn't clear to me what the aim of the post was, and I thought Rockwell's reply clarified this. I just misinterpreted \"accomplishments\" at the top as being about impact rather than community. So I'm now glad this post exists, though citing metrics still bothers me a bit.</p>", "parentCommentId": "Ju2pQYJmHa7BEPadu", "user": {"username": "tkwa"}}, {"_id": "FsrLd8Cmo7KrREBan", "postedAt": "2023-09-22T12:30:14.355Z", "postId": "SDyik6eNm53yBGeEe", "htmlBody": "<p>That's fair. I agree accomplishments probably wasn't the right word for this kind of post.</p>", "parentCommentId": "C7o9Ri3QLJ3qM9Sbi", "user": {"username": "OllieBase"}}]