[{"_id": "ZLDqjewHXosmdNmTw", "postedAt": "2022-10-24T16:51:53.033Z", "postId": "SemaeDLxJe9Bsttaj", "htmlBody": "<p>While I'm revisiting this post for cosmetic changes, here is a short list of topics I don't cover in this FAQ that I think would be worth one or more points in a more finalized version: community centralization, community diversity, climate change, Emile Torres, transhumanism, nonhuman animals, and conservative criticisms. Please feel free to suggest specific questions related to these topics for a more finalized draft, or other topics that you think are similarly worthwhile (no guarantee either type of suggestion will make it into a finalized draft, or even that I'll necessarily get around to a finalized draft).</p>\n", "parentCommentId": null, "user": {"username": "Devin Kalish"}}, {"_id": "BPwrZNQ8WkvwT4afx", "postedAt": "2022-10-25T16:01:49.475Z", "postId": "SemaeDLxJe9Bsttaj", "htmlBody": "<p>&nbsp;I appreciate this style of post! I'll also flag that the <a href=\"https://globalprioritiesinstitute.org/what-is-longtermism/\">Global Priorities Insitute has an FAQ-style list of responses</a> to questions about longtermism, some of which link to research papers and further reading for those interested.</p>", "parentCommentId": null, "user": {"username": "2ndRichter"}}, {"_id": "WrgwebKBeCttpyFzM", "postedAt": "2022-10-25T18:44:50.290Z", "postId": "SemaeDLxJe9Bsttaj", "htmlBody": "<p>Thank you! And thanks for pointing me to the other FAQ, I think it is doing a slightly different thing from what I’m trying to, but I’m glad to see someone put together something like this.</p>\n", "parentCommentId": "BPwrZNQ8WkvwT4afx", "user": {"username": "Devin Kalish"}}, {"_id": "3QtEWWZxkTc6QmCTv", "postedAt": "2022-10-27T20:19:31.206Z", "postId": "SemaeDLxJe9Bsttaj", "htmlBody": "<p>Thanks for this. Could I please translate and publish it on &lt;https://80000horas.com.br/blog&gt;?</p>", "parentCommentId": null, "user": {"username": "Ramiro"}}, {"_id": "GuMegKw4bpAFZHYRA", "postedAt": "2022-10-28T01:27:37.640Z", "postId": "SemaeDLxJe9Bsttaj", "htmlBody": "<p>Oh wow, yeah definitely, thanks! I think the forum defaults to this type of copyright anyway, but feel free to do whatever you want with my writing here as long as you properly source and credit it.</p>\n", "parentCommentId": "3QtEWWZxkTc6QmCTv", "user": {"username": "Devin Kalish"}}, {"_id": "xrFGPYRGeytbmMtHr", "postedAt": "2022-11-11T18:30:12.360Z", "postId": "SemaeDLxJe9Bsttaj", "htmlBody": "<p>In the wake of the recent FTX downfall, I want to add that I would also add a section on Sam Bankman Fried. It also means there are several existing answers than will need to be updated, either in fairly minor ways (Q4, Q11), or more substantially in a way that tracks updates in my own views rather than just updates on the current state of affairs (Q1, Q13).</p>\n", "parentCommentId": "ZLDqjewHXosmdNmTw", "user": {"username": "Devin Kalish"}}]