[{"_id": "ArykzmQqTsC3aAiC4", "postedAt": "2024-01-04T13:35:19.031Z", "postId": "SfCFwKACAgWowgke4", "htmlBody": "<p>Whatever happened to AppliedDivinityStudies, anyway? Seemed to be a promising blog adjacent to the community but I just checked back to see what the more recent posts were and it looks to have stopped posting about a year ago?</p>", "parentCommentId": null, "user": {"username": "Davis_Kingsley"}}, {"_id": "CP8isFjeJhDcPjSyf", "postedAt": "2024-01-10T16:41:05.130Z", "postId": "SfCFwKACAgWowgke4", "htmlBody": "<p>Hello, very new here. I work in public health tech and have a personal goal/value to work on Africa-based projects and endeavors - my home is in East Africa - with positive impact on health outcomes. Currently based in the DC area for a bit and looking forward to contributing more in terms of time and financial resources as I learn from the community. I also absurdly love tennis and creative writing.</p>", "parentCommentId": null, "user": {"username": "Mercy Simiyu"}}, {"_id": "Tq8AayJcp8DociSj4", "postedAt": "2024-01-11T12:11:01.203Z", "postId": "SfCFwKACAgWowgke4", "htmlBody": "<p>Welcome to the Forum!&nbsp;<br>You might be interested in some of the <a href=\"https://forum.effectivealtruism.org/topics/africa-ea-forum-competition\">posts from the Africa EA Forum competition</a> last year, and, more generally, our <a href=\"https://forum.effectivealtruism.org/topics/global-health-and-development?tab=wiki\">Global Health content</a> (if you want to see more global health content, you can click subscribe on that page).&nbsp;<br>PS- I'm Toby, the Content Manager for the Forum. Let me know if you have any questions :)</p>", "parentCommentId": "CP8isFjeJhDcPjSyf", "user": {"username": "tobytrem"}}, {"_id": "bCe2uWes2RgnmJegp", "postedAt": "2024-01-31T17:57:37.142Z", "postId": "SfCFwKACAgWowgke4", "htmlBody": "<p>Hi, just joined yesterday! I have a career in founding AI startups, doing evaluation on big ($100m/year) innovation programs, and generally trying to use numbers to make things better.&nbsp;</p><p>For years though, I've been trying to figure out what \"better\" really means, because if we don't have that, then everything else is guesswork. That led me to my most recent research, and this <a href=\"https://forum.effectivealtruism.org/posts/ggzGwXLzc8MBfERTC/critical-failures-in-the-accepted-model-of-national\">post</a>, which found that the current world standard model for life satisfaction appears fatally flawed. This is especially shocking because the current paradigm has been published in the same form since 2012.</p><p>&nbsp;I'm currently in the DC area but have lived around the country, and spent teenage years in France and China. It's great to be here!</p>", "parentCommentId": null, "user": {"username": "Alexander Loewi"}}, {"_id": "R74LsBoLNrABZgzT3", "postedAt": "2024-01-31T18:36:41.260Z", "postId": "SfCFwKACAgWowgke4", "htmlBody": "<p>I am around!<br>https://twitter.com/alexeyguzey/status/1668834171945635840</p>", "parentCommentId": "ArykzmQqTsC3aAiC4", "user": {"username": "AppliedDivinityStudies"}}, {"_id": "JHGKHdPmiaJgj4pkB", "postedAt": "2024-01-31T21:53:04.647Z", "postId": "SfCFwKACAgWowgke4", "htmlBody": "<p>Someone reminded me that I have an admonymous. If some of y'all feel like leaving some anonymous feedback, I'd love to get it and you can do so here: <a href=\"https://admonymous.co/loki\">https://admonymous.co/loki</a></p>\n", "parentCommentId": null, "user": {"username": "NunoSempere"}}, {"_id": "9xk6GjS8f8eWAeLaH", "postedAt": "2024-02-01T00:10:48.359Z", "postId": "SfCFwKACAgWowgke4", "htmlBody": "<p>Good luck!</p>", "parentCommentId": "R74LsBoLNrABZgzT3", "user": {"username": "Linch"}}, {"_id": "xiH7dM3SQNpj6tBbo", "postedAt": "2024-02-01T10:30:00.604Z", "postId": "SfCFwKACAgWowgke4", "htmlBody": "<p>Welcome Alexander! And thanks for such an interesting first post. I'm excited to see how you will contribute to the Forum :)</p>", "parentCommentId": "bCe2uWes2RgnmJegp", "user": {"username": "tobytrem"}}, {"_id": "pKKHzqgsGuLYiLF2k", "postedAt": "2024-02-08T09:13:46.257Z", "postId": "SfCFwKACAgWowgke4", "htmlBody": "<p>Hey everyone,</p><p>Just wanted to drop in and introduce myself! I'm new to the forum and super excited to be here. I come from a background in social work and community development, and I'm currently diving deeper into Development Studies. I'm really passionate about making a positive impact in my community and beyond, and I'm eager to learn how I can contribute to positive change initiatives.</p><p>So far, I've enjoyed volunteering with an organization that focuses on empowering women. We teach them about running a business, culinary arts, and provide mental support through counseling sessions.</p><p>I'm based in East Africa, specifically Kenya, and I'm on the lookout for projects and opportunities where I can lend a hand. If anyone has any leads or guidance on how I can use my career for the greater good, I'd love to hear from you.</p><p>Let's work together to make the world a better place through effective altruism initiatives!....CHEERS!!</p>", "parentCommentId": null, "user": {"username": "VirginiaCares"}}, {"_id": "hma3gBnDPFXJGq66G", "postedAt": "2024-02-13T11:07:52.655Z", "postId": "SfCFwKACAgWowgke4", "htmlBody": "<p>Hello! My name is Dermot and I’m from Ireland. Pandemics (and how to stop them) have brought me to the EA Forums.</p><p>My professional background is in the financial markets – I am an investment risk manager by trade – so I have none of the skills or training one would normally associate with infectious disease and outbreak control. But, like a lot of people, I started to take an interest in Covid-19 during the first lockdown (what else was there to do?). My initial reaction was that we had screwed this one up, but the long-term question remained: how do we make sure a catastrophe like this never happens again?</p><p>Over the following weeks and months (and years, now), I tracked the Covid-19 outbreak through the datasets and the research papers. I reached out to journalists, politicians, and Covid activists to discuss policy reform. I wrote articles for the news media. For a few months, I found myself working on a policy proposal with a group of prominent Irish academics. As an outsider on the inside of academia, it was an enlightening experience.</p><p>Over the course of my journey, I became increasingly confident that pandemics were the kind of problem that could be solved – completely and permanently. Unfortunately, that solution would require perspectives and skillsets which seemed to be rare among the prevailing pandemic policy-making establishment…&nbsp;which brought me to EA. Within EA there is a focus on long-term thinking and existential risk management, and these are exactly the kinds of perspectives we will need to solve a problem of this nature.</p><p>So, I am here to share my experiences and analysis, but I’m also here to learn from domain experts, to give and receive feedback on key ideas, and to discuss pandemic prevention and preparedness with people who have also spent a lot of time thinking about it. There aren’t many platforms where it is possible to have a rational, informed conversation about the Covid-19 pandemic, pandemic-potential pathogens, and global pandemic policy these days. I’m hoping that I can find that here.</p><p>Pandemic prevention is entirely achievable, and within our lifetimes (I’m a Millennial). We can permanently end the threat that PPPs pose to humanity, and I think there’s a lot of potential for the EA community to play a major role in that solution.</p><p>Dermot</p>", "parentCommentId": null, "user": {"username": "PandemicRiskMan"}}, {"_id": "DSpcRbtDHftej9ikW", "postedAt": "2024-02-13T20:26:01.411Z", "postId": "SfCFwKACAgWowgke4", "htmlBody": "<p>Hi! My name's Adin (pronounced \"ahdeen\", yes it should be spelled differently haha). I first came across EA stuff maybe like 7 years ago through GiveWell. More recently I've been perusing 80k site &amp; pod to try to figure out my career. Heard an interview with Lucia from LEEP and starting checking out some of what Charity Entrepreneurship (or I guess AIM now) gets up to. Overall I find their work, and much of the work done by the EA community, pretty impressive.</p>\n<p>I recently came off a relatively brief stint working at a homeless services organization where I live in Denver, CO with a lot of questions about \"doing good\". On the one hand I felt that the hands on case management I was doing with clients wasn't accomplishing much, partly due to the rigourlessness and ineffectiveness of the organization I worked for. But shifting focus overseas because that's where it appears to be cheapest to achieve measurable outcomes doesn't seem quite right to me either.</p>\n<p>I'm not yet convinced that my inclination to give some level of priority to people living in my physical community is a psychological bias to be overcome with logical thought. In the terminology of the Giving Multiplier folks, but not fully accepting their premise or approach, I don't think the \"head\" and \"heart\" are necessarily so at odds as they might appear. So I'm trying to read and listen to more on this topic and engage in conversation with people who might be interested in the same set of questions, which is why I'm excited to be here!</p>\n", "parentCommentId": null, "user": {"username": "Adin Warner-Rosen"}}, {"_id": "nRbppo2iLBRqyJmLT", "postedAt": "2024-02-15T10:20:14.270Z", "postId": "SfCFwKACAgWowgke4", "htmlBody": "<p>Hey Adin, thanks for joining!<br><br>It's really cool that you seem to be taking the project of doing good so seriously. I hope the Forum is a useful place to explore the questions you're interested in.&nbsp;<br><br>Let me know if there is anything you need to know or feedback about the Forum (here or in dm).&nbsp;</p>", "parentCommentId": "DSpcRbtDHftej9ikW", "user": {"username": "tobytrem"}}, {"_id": "4DGPaKg8rxg5znpcn", "postedAt": "2024-02-20T05:51:38.400Z", "postId": "SfCFwKACAgWowgke4", "htmlBody": "<p>Hi Everyone,</p><p>My name is Hani. I am very excited to be a part of this forum!&nbsp;<br><br>I am new to AI in general. Trying to find my way to contribute towards AI Alignment &amp; Safety or AI in general.</p><p>I have been part of an EA project where I am planning to write a few blog posts about the current AI situation in leading countries like the USA and other countries like China or India.</p><p>Please pass on any suggestions you may have regarding this topic. Like as a reader, what would you like to read? How to effectively write a post that can be published on a forum like this one? Or anything in general. Thank you for reading this!</p>", "parentCommentId": null, "user": {"username": "Hani Patel"}}, {"_id": "QGubCfPZ6fqPdNTru", "postedAt": "2024-02-20T09:40:33.755Z", "postId": "SfCFwKACAgWowgke4", "htmlBody": "<p>Hi Hani!&nbsp;<br>Welcome to the Forum!<br>\"as a reader, what would you like to read?\"<br>Next week I'll post a \"What posts would you like someone to write?\" thread. I'll link it here when it is out. It should help answer at least one of your questions.&nbsp;<br>\"How to effectively write a post that can be published on a forum like this one?\"<br>As long as your writing follows our <a href=\"https://forum.effectivealtruism.org/posts/yND9aGJgobm5dEXqF/guide-to-norms-on-the-forum\">norms,</a> and is relevant to the project of doing good better, we'd love to see it. If you want examples of posts that we particularly liked, read <a href=\"https://effectivealtruism.us8.list-manage.com/subscribe?u=52b028e7f799cca137ef74763&amp;id=7457c7ff3e\">the Forum Digest</a>, or look at our <a href=\"https://forum.effectivealtruism.org/recommendations\">curated posts</a>.&nbsp;<br>Cheers,<br>Toby (Content Manager for the EA Forum)</p>", "parentCommentId": "4DGPaKg8rxg5znpcn", "user": {"username": "tobytrem"}}, {"_id": "53EQeYfgirRgfiqzz", "postedAt": "2024-02-20T21:57:21.802Z", "postId": "SfCFwKACAgWowgke4", "htmlBody": "<p>Hello there, my name is Martina! I joined the forum yesterday.</p><p>I have a physics background and I currently work as a scientific illustrator and high school textbook editor, but I'm here to explore how I can pivot my career to have a bigger impact and also feel more fulfilled. The path I'm most drawn to at the moment is AI safety, although I still have a lot of research to do, and because I've only been working for two years I'm very open to exploring different things.</p><p>I first came across longtermism and 80,000 hours through Ali Abdaal's YouTube channel. Lately I've been reading many articles on 80,000 hours (I also applied for coaching), and from the links to this forum it looks like you have lots of great food for thought over here. I'm very excited to learn more about EA and eventually, when I feel more confident, join the discussion.</p>", "parentCommentId": null, "user": {"username": "Martina Pepiciello"}}, {"_id": "S8p6xHtLh5iyDppho", "postedAt": "2024-02-21T09:37:18.690Z", "postId": "SfCFwKACAgWowgke4", "htmlBody": "<p>Hi Martina! Welcome :)</p><p>No pressure, but if you'd like to share a scientific illustration you've done, I'd love to see it (you can post in a comment below this).&nbsp;</p><p>Have you subscribed to the <a href=\"https://effectivealtruism.us8.list-manage.com/subscribe?u=52b028e7f799cca137ef74763&amp;id=7457c7ff3e\">Forum Digest?</a> If you can stomach another newsletter, it's a pretty good way to read the best of the Forum every week. I've heard that people find reading a couple posts from it a week to be a good way to get into EA ways of writing and thinking. (I'll be sending one out later today)</p><p>Cheers,<br><br>Toby (Content Manager for the EA Forum)<br>&nbsp;</p>", "parentCommentId": "53EQeYfgirRgfiqzz", "user": {"username": "tobytrem"}}, {"_id": "zjKFLh9qsvrhsiJW8", "postedAt": "2024-02-22T09:02:19.150Z", "postId": "SfCFwKACAgWowgke4", "htmlBody": "<p>Hi Toby, thank you so much for your message!</p><p>Sure,<a href=\"https://www.martinapepiciello.com/\"> here is a link</a> to my scientific illustration portfolio.</p><p>Yes, I have subscribed to the Forum Digest and got yesterday's email. I plan to dive into the posts very soon :)</p>", "parentCommentId": "S8p6xHtLh5iyDppho", "user": {"username": "Martina Pepiciello"}}, {"_id": "M36w7rYM8gDxcXygN", "postedAt": "2024-02-22T09:15:39.305Z", "postId": "SfCFwKACAgWowgke4", "htmlBody": "<p>Thanks for sharing Martina! I love the faults, errors, failures illustration with the bugs!</p>", "parentCommentId": "zjKFLh9qsvrhsiJW8", "user": {"username": "tobytrem"}}, {"_id": "vhtGRXiFedXiys2xq", "postedAt": "2024-02-26T14:38:52.571Z", "postId": "SfCFwKACAgWowgke4", "htmlBody": "<p>Hello, EAs</p><p><strong>Quick info</strong><br>Colombian.<br>Economist, <a href=\"https://nicolasforero.substack.com\">writer</a>, eclectic visionary, old soul, beatnik (apparently)<br>Came across EA during a career transition period</p><p><strong>💼 Work/Vocation</strong></p><p><strong>Present (what I'm doing now)</strong><br>To reduce global wealth inequalities through education interventions, I'm (in order):</p><p>1. Pursuing a communications role at a non-profit focused on this role by capitalizing on my experience directing 50~marketing and content projects for $1M-$350M/year for-profit companies</p><p>2. Applying to fellowships and grants to launch the only platform extending premier literacy to underrepresented groups, amplifying ideas that can reshape our world from the ground up and withstand scrutiny.</p><p>3. Pivoting my freelance business into the non-profit space to fund my cost of living as I find the \"right\" role.</p><p><strong>Past: Why I am doing what I am doing</strong><br>In my 6th semester of Economics, I studied with graduate students in leadership positions at regional banks, multinationals, and non-profits. None had the time or income to help as many people as they wanted, maintain a work-life balance, and pursue meaningful side projects.</p><p>The idea of that being the best future even the 1% in Colombia could aspire for haunted me. Would I forever eat protein-less breakfasts, not afford healthcare, or work on Saturdays? My grandpa went to the Korean War in 1951 to escape the poverty he and his eight siblings were born into. My dad had to sell books, empanadas, and newspapers to pay for public university. Wasn't the financial burden of a private university supposed to be offset by the promise of a better future?</p><p>What about others? What about those who didn't have a mother who nurtured their love of reading or a father who instilled the value of self-education? Or those who grew up with abusive or absent parents who didn't trust and invest in their potential, even when they failed or when they had \"better\" siblings? Or those whom the gene pool and social environment didn't bless with the same non-cognitive and cognitive skills I have?</p><p>I'm devoted to helping individuals in the Global South realize their full potential, even if they weren't born into wealthy, stable, and supportive families.</p><p>I've experienced the benefits of above-average literacy and education. My skills have brought millions of eyes to overlooked problems and generated millions in profit for purpose-driven brands. At 23, against all odds, I became part of the&nbsp;<a href=\"https://www.vox.com/future-perfect/2023/9/15/23874111/charity-philanthropy-americans-global-rich\">richest 1% in the world</a>. This allowed me to enroll in a graduate program in Liberal Arts in the United States, afford healthcare, and ensure that my mother had everything she needed to pass away in the least painful way possible.</p><p><strong>❤️‍🔥 Non-work passions to connect on</strong><br>1. Salsa (on1, Cuban, Colombian, in that order).<br>2. <a href=\"https://nicolasforero.substack.com\">Writing</a> (social commentary, personal essays)<br>3. Reading; currently going through a Master's in Liberal Arts; Spring focus on literature<br>4. Art, photography, museums<br>5. Humaning</p>", "parentCommentId": null, "user": {"username": "Nicolas Forero"}}, {"_id": "La4DE9KDnqFQJ7Enq", "postedAt": "2024-02-26T14:50:44.738Z", "postId": "SfCFwKACAgWowgke4", "htmlBody": "<p>Welcome Nicolas!&nbsp;<br>Is there anything about EA or the Forum that you'd like to know more about? I'm the Content Manager, so I might be able to recommend some posts to check out.&nbsp;<br>Cheers,&nbsp;<br>Toby</p>", "parentCommentId": "vhtGRXiFedXiys2xq", "user": {"username": "tobytrem"}}, {"_id": "t9SDARHnuLDg5wPmp", "postedAt": "2024-02-27T00:34:06.357Z", "postId": "SfCFwKACAgWowgke4", "htmlBody": "<h2>Maximally Effective Altruism</h2><p>Imagine that two people are lost at sea, with only enough food for one. One is the world’s most promising cancer researcher while the other, to be polite, has far less potential to improve humankind. Most people would wisely choose the cancer researcher.</p><p><strong>Yet the fashionable </strong><i><strong>Effective Altruism</strong></i><strong> movement focuses on lower-potential people—typically, people who are struggling in poor countries. That implies the belief that all lives have roughly equal value. Of course, our hearts go out to “the least among us,” but they face so many barriers. If we care to maximally benefit humankind, we’re wiser to invest in people with great potential for </strong><i><strong>ripple effect</strong></i><strong> who, importantly, would not otherwise get fully funded.</strong></p><p>For example, leading lights in the Effective Altruism movement are far from downtrodden, for example, William McCaskill, Holden Karnofsky, Peter Singer, and Zvi Moshowitz. Effective altruism might fund such people to develop ever more “ripply” altruism.</p><p>Some other possibilities for more ripply and thus more effective altruism:</p><p>— SuperCourses: online versions of standard school courses taught by dream teams of transformational instructors, augmented by vivid demonstrations and gamification. Of course, instruction would be individualized, not just in pace but in teaching approach. Machine learning would make that individualization ever better, and automatic translation would make SuperCourses available in many languages. The development of SuperCourses would enable every student, rich and poor, kindergarten through college, Alabama to Zululand, to get a world-class education. The private and government sectors haven’t funded this—I have proposed SuperCourses to top U.S. and California education officials and gotten nowhere. One reason is the fear that the teacher’s union would use its might to try to stop it to preserve teacher jobs. But if developed and disseminated worldwide, SuperCourses could be very effective altruism indeed.</p><p>— Independent researchers studying solutions that are promising but have a poor chance of success. Governmental and corporate funding sources tend to invest in institution-based researchers whose projects have higher probability of near-term success. But if the focus is on long-term risk-reward, effective altruism would include independent, unaffiliated researchers working in their home-office or garage who are exploring novel ways to, for example, lower the cost of nuclear fusion energy, develop better AI-driven models for predicting and foiling terrorism and even for assessing a war’s worthiness, e.g., the U.S. entering World War II versus the war in Vietnam or Afghanistan.</p><p>— People developing ever better mental health apps, for example, using ChatGPT. Such apps could be distributed worldwide to countries rich and poor—Cell phones are ubiquitous even in poor nations. Private sources are funding development of such apps, but such development deserves greater funding given the apps’ potentially great ripple effect.</p><p>— Researchers studying the enhancement of reasoning ability, impulse control, and altruism. For largely political reasons, those research areas are underfunded by government and corporations but, with sufficient ethical guardrails, such research has great ripple potential to provide major benefit to humankind.</p><p>— People developing software that matches mentors with <i>protégés,</i> available worldwide. It would be like match.com but for mentor/<i>protégé,</i> relationships—Many <i>protégés&nbsp;</i>and mentors say that mentorship has been among their life’s greatest learning experiences. Such software would facilitate that. Alas, the matching industry, despite having been around for decades, has remained focused on romantic relationships. That makes mentor-matching apps a good candidate for effective altruism.</p><p>Again, it’s understandably tempting to want to help “the least among us,” those with the greatest deficits. After all, we feel good in helping them and it’s a fashionable form of virtue signaling. But if we truly care about humankind and are willing to focus on the greatest ultimate benefit, ripple should be the core criterion for determining what is maximally effective altruism.</p>", "parentCommentId": null, "user": {"username": "Marty Nemko"}}, {"_id": "xADQbXpiiREqEbWCQ", "postedAt": "2024-02-28T15:01:41.684Z", "postId": "SfCFwKACAgWowgke4", "htmlBody": "<p>Hello! I'm thrilled to be joining this community. My name is Eric, and I recently discovered effective altruism through various online channels. My background is in quantum gastronomy, and I currently work as a Flavor Fusion Specialist at Quantum Flavor Dynamics Corp.</p><p>In my role, I experiment with merging taste profiles from parallel universes to create mind-bending culinary experiences. While it's a fascinating field, I've been feeling a calling to use my skills for a broader impact, which led me to the world of effective altruism.</p><p>I've always been passionate about exploring the intersection of flavor and philanthropy, and after learning about effective altruism, I'm eager to understand how I can contribute to making a positive impact in the world. The idea of maximizing the good I can do with my unique background really resonates with me.</p><p>I came across effective altruism through an obscure culinary blog post that surprisingly delved into ethical considerations in flavor creation. Currently, I'm particularly drawn to sustainable food systems and the intersection of gastronomy with social and environmental issues.</p>", "parentCommentId": null, "user": {"username": "SilverSwan"}}, {"_id": "dMvRSyQsCkxajNZvv", "postedAt": "2024-02-28T16:06:33.713Z", "postId": "SfCFwKACAgWowgke4", "htmlBody": "<p>Hello all!</p><p>My name is Craig and I am an EU policy consultant and writer on the politics of biotech. I edit the <a href=\"https://www.geneticchoiceproject.com/\">Genetic Choice Project</a>, which reports on debates and developments on natalism and reprogenetic technologies, including IVF, embryo selection, and genetic enhancement. Reprotech will likely increasingly influence reproductive patterns and therefore the evolution of human species in the years and decades to come.</p><p>I also have a personal blog on <a href=\"https://cwilly.substack.com/\">bio/politics</a> where I look at the impact of biotechnology on international relations, notably national security and U.S.-China relations.</p><p>I look forward to discovering the Forum and exchanging with you all!</p>", "parentCommentId": null, "user": {"username": "CWilly"}}, {"_id": "keFYLNjJZLd9m77pf", "postedAt": "2024-03-01T22:11:07.704Z", "postId": "SfCFwKACAgWowgke4", "htmlBody": "<p>Request for advice from animal suffering EAs (and, to a lesser extent, climate EAs?): is there an easy win over getting turkeys from <a href=\"https://www.marysturkeys.com/\">Mary's Turkeys</a>? (Also, how much should I care about getting the heritage variety?)</p><p>Background: I routinely cook for myself and my housemates (all of whom are omnivores), and am on a diet that requires animal products for health reasons. Nevertheless, I'd rather impose fewer costs than more costs on others; I stopped eating chicken and chicken eggs in response to <a href=\"https://slatestarcodex.com/2019/12/11/acc-is-eating-meat-a-net-harm/\">this post</a> and recently switched from consuming lots of grass-finished beef to consuming lots of <a href=\"https://wildideabuffalo.com/\">bison</a>.</p><p>I have a general sense that \"bigger animals have better lives\", and so it's better to roast turkeys than roast ducks, for example, but am 1) not clear on the relative impacts of birds and mammals and 2) not clear on turkeys specifically. My sense is that even relatively well-treated chickens have been bred in a way that's pretty welfare-destroying, but that this hasn't yet happened to ducks; turkeys are subject to Thanksgiving pressure in the US, tho, which I'm sure has had <i>some</i> effect. The various food impact things that I've seen (like <a href=\"https://foodimpacts.org/\">foodimpacts.org</a>) don't seem to address turkeys (or use estimates from 'similar' creatures, which feels like too much of a stretch).</p><p>I think the counterfactual to roasting a turkey is either smoking the same weight of bison brisket or my housemates cooking themselves the same weight of chicken.</p>", "parentCommentId": null, "user": {"username": "vaniver"}}, {"_id": "XHMdqzadYKCmHkF2F", "postedAt": "2024-03-07T14:52:11.464Z", "postId": "SfCFwKACAgWowgke4", "htmlBody": "<p>Hi. I've been reading about EA ideas, giving effectively and listening to 80,000 hours podcast etc for a couple of years now, but have only recently started to interact with the community. At the end of 2023 I participated in the EA UK Career Planning programme, and listened in on EAGx Virtual.</p><p>Recently discovered this forum and greatly enjoying both the content and the spirit of discussions! Especially the Biosecurity, movement-building and Philosophy areas. Honestly, I'm a bit daunted by the knowledge and insight of posters here, but might push myself to put out a quick-take in Draft Amnesty Week, as I'd like to develop my writing abilities.</p><p>I work as a Physiotherapist, but am now on a maternity career break, and in this time, am trying to develop my knowledge and skills for a career transition to a more effective path. The cause area I'm most interested in is Biosecurity but I am pretty open-minded to anything high impact that is also a good personal fit. Working on mini-projects to test my abilities in advocacy and policy.</p>", "parentCommentId": null, "user": {"username": "MarinaKissin"}}, {"_id": "ATBdohp5HfthP4mwD", "postedAt": "2024-03-08T17:03:55.909Z", "postId": "SfCFwKACAgWowgke4", "htmlBody": "<p>Hi Dermot, I'm Oisín. Are you aware of Ireland's EA chapter, EA Éire? I'm part of it myself, so if you'd like and if you are not already part of it, I can get you added to the EA Éire WhatsApp groupchat. Also we have some meetups in Dublin (some in Cork too I think for those down south) so you'd be welcome to join us. One of the organisers has actually written a syllabus for and run a proto-biosecurity fellowship in the past, so you could probably talk to him about that a bit more about pandemic prevention stuff I'd say. Anyways, welcome to the EA community!</p>", "parentCommentId": "hma3gBnDPFXJGq66G", "user": {"username": "Oisín Considine"}}, {"_id": "7PncZS3mzqkkRFFKq", "postedAt": "2024-03-12T18:11:33.443Z", "postId": "SfCFwKACAgWowgke4", "htmlBody": "<p>Hi Oisín, thanks for getting in contact. Yeah, I’d definitely be interested in joining the chat. Were you guys ever based in Dogpatch? I remember seeing some EA Ireland stuff in there a while ago.</p>", "parentCommentId": "ATBdohp5HfthP4mwD", "user": {"username": "PandemicRiskMan"}}, {"_id": "SJuLmuExiottauhtg", "postedAt": "2024-03-13T21:53:27.392Z", "postId": "SfCFwKACAgWowgke4", "htmlBody": "<p>Hello, Toby. So far, it seems like whatever it is that I don't know or can't see about it will reveal itself through interactions with the community. Given that I'm transitioning into the non-profit/more impactful industries, I'd love to know if there's anything else I could do to increase my odds of joining an EA company through the forum.</p>", "parentCommentId": "La4DE9KDnqFQJ7Enq", "user": {"username": "Nicolas Forero"}}, {"_id": "LtF3GF7HLDCDovMPy", "postedAt": "2024-03-17T14:00:05.864Z", "postId": "SfCFwKACAgWowgke4", "htmlBody": "<p>Hello, I was introduced to EA through Dr. Lucia Coulter on a podcast and reading Will Macaskill's books What We Owe the Future and Doing Good Better. Both were fantastic, seriously mind-expanding books. I'm a Primary school teacher working at an International school in Monaco. I started a 'Superhero Global Citizens' club last week and keen to share these ideas with the children and the wider community which offers fantastic potential for leverage and impact. I'm surprised how little is known of EA from my initial conversations with others. I'd be grateful for any support anyone is able to offer to help me get this started or gain traction. Perhaps there are already members working with other International School Communities, Monaco or with other philanthropy networks?</p>", "parentCommentId": null, "user": {"username": "Matthew Athauda"}}, {"_id": "j3b6u4qNZNmYTDnFL", "postedAt": "2024-03-19T20:13:40.551Z", "postId": "SfCFwKACAgWowgke4", "htmlBody": "<p>Hi! I've been following EA for more than six years now. I am not sure how it started, but I think the first contact was a TED talk from Peter Singer. I joined some local and online events, I took the founders' pledge, and I follow it—though I never accepted Give Well's monopoly on deciding where to donate. I love the conceptual frameworks of EA - such as the importance, traceability, and neglectedness framework, or the idea of guiding young people on what impact their job might have before they make the choice. I hope this forum to be a still open space for a discussion on where we go forward with those ideas!</p>", "parentCommentId": null, "user": {"username": "Szewek"}}, {"_id": "ZxJaSiM5mW4CnHQWA", "postedAt": "2024-03-26T08:54:25.569Z", "postId": "SfCFwKACAgWowgke4", "htmlBody": "<p>Basically a bug report: The popup \"Sign up for the weekly EA Forum Digest\" appears on every new page, even when I've already clicked \"No thanks\" on other pages. I highly dislike this.</p>\n", "parentCommentId": null, "user": {"username": "niplav"}}, {"_id": "2PxoSgD7ZfNHmjsu8", "postedAt": "2024-03-26T15:08:23.584Z", "postId": "SfCFwKACAgWowgke4", "htmlBody": "<p>My apologies for the inconvenience, and thanks for flagging this! Unfortunately I'm unable to reproduce the issue. Could you provide some more details, such as what browsers/devices you see this on? Does it persist when you refresh? Are you only seeing this when logged in, or have you encountered this while logged out?</p>", "parentCommentId": "ZxJaSiM5mW4CnHQWA", "user": {"username": "syc"}}, {"_id": "3fMcNZ4AuyQnFRmGD", "postedAt": "2024-03-26T15:23:41.198Z", "postId": "SfCFwKACAgWowgke4", "htmlBody": "<p>Encountered while logged in. Now it doesn't happen anymore. Maybe it was because I'd opened a bunch of tabs <em>before</em> dismissing the notification, which had still pre-loaded on other pages? Anyway, now it's fixed, at least for me.</p>\n", "parentCommentId": "2PxoSgD7ZfNHmjsu8", "user": {"username": "niplav"}}, {"_id": "SZZcqxxsFFojhsFbb", "postedAt": "2024-03-26T15:30:44.456Z", "postId": "SfCFwKACAgWowgke4", "htmlBody": "<p>Ah I see, glad to hear it! Yeah dismissing the popup in one tab doesn't cause the others to refresh or pull the updated data.</p>", "parentCommentId": "3fMcNZ4AuyQnFRmGD", "user": {"username": "syc"}}, {"_id": "847SxzM4qc4gh4uGH", "postedAt": "2024-03-28T13:12:32.008Z", "postId": "SfCFwKACAgWowgke4", "htmlBody": "<p>Hello everyone, my name is Manik. I joined the forum a month ago and am very excited to be here.</p><p>I am a business and technology consultant in the UK, collaborating with clients on business problems across multiple industries and domains. I have 3 years of software development experience after Engineering Bachelor's and 6 years of business and technology consulting experience after MBA. I am exploring ways to utilize my skill set to transition into a career which can create a bigger impact.&nbsp;</p><p>Over the last few years, I developed ideas about how I want to design my life and arrived at something very similar to longtermism. This led me to do some research and I was absolutely delighted to know that there is a term for this and that a wider community is working with a similar mindset. The idea of “prioritization” and “effective” altruism resonated with me; I have always believed in an intellectual response to emotional motivations/challenges in life (personal, professional, or global).&nbsp;</p><p>I have been exploring articles on this forum and on 80,000 hours, pursuing a course on AI safety fundamentals, reading Nick Bostrom’s work, listening to EA podcasts and looking for projects/jobs where I can contribute.&nbsp;</p><p>I am at present interested in AI Safety, but keeping my mind open to exploring other areas if I find I can create a bigger impact.</p>", "parentCommentId": null, "user": {"username": "ManikSharma"}}, {"_id": "BYuzkD4r63yCHkkwk", "postedAt": "2024-03-28T21:21:57.548Z", "postId": "SfCFwKACAgWowgke4", "htmlBody": "<p>Hi Everyone!<br>I'm excited about joining the forum and I'm grateful for having the time to navigate and read this storehouse of reflection. I'm enjoying the EA handbook and have listened to many podcasts.</p><p>I'm an Argentinian psychologist with over eight years of experience working with civil society organizations (from grassroots groups, national CSOs, and regional networks).</p><p>I've worked in research, program management, and mental health support. In research, I’m stronger in qualitative methodologies and have had fantastic experiences with participatory and peer-to-peer methodologies. &nbsp;I’ve worked in mental health as a clinician and supporting/accompanying activists and victims of human rights violations.</p><p>I've devoted most of my time to advancing deinstitutionalization: changing systems that rely on large institutions (orphanages, &nbsp;asylums, etc.) for '''''care''''' provision.</p><p>I've practiced vipassana meditation since 2016, and I lack the words (although if you ask I might go on speaking for hours :P) to state how much I've learned and continue to learn from my practice and service.</p><p>I've experienced many significant changes to my thinking, worldviews, and even ways of experiencing life. I embrace the idea of the 'middle point' as not losing the possibility to grasp any of the extremes.</p><p>I've suffered a lot -from physical and 'moral' pain- (I'm interested in the difference between pain and suffering), and I found a path to live a happy life when it all seemed dark.</p><p>I'm interested in consciousness studies and individual suffering as well as its social determinants and social change.</p><p>I love moving and enjoy standing in different places to experience diverse worldviews and thinking. Coming from a poor background in the global south, I find EA developments thought-provoking.</p><p>Looking forward to engaging with this community!<br>&nbsp;</p>", "parentCommentId": null, "user": {"username": "Laila Fiszer"}}]