[{"_id": "tCRtAmacgcgFYuL4W", "postedAt": "2023-07-09T23:22:28.295Z", "postId": "SFyCrtdfuYjtPq6xs", "htmlBody": "<p>Great to see attempts to measure impact in such difficult areas. I'm wondering if there's a problem of attribution that looks like this (I'm not up to date on this discussion):</p>\n<ol>\n<li>An organisation like the Future Academy or 80,000 hours or someone says \"look, we probably got this person into a career in AI safety, which has a higher impact, and cost us $x, so our impact per dollar is $x per probable career spent on AI safety\".</li>\n<li>The person goes to do a training program, and they say \"we trained this person to do good work in AI safety, which allows them to have an impact, and it only cost us $y to run the program, so our impact is $y per impactful career in AI safety\"</li>\n<li>The person then goes on to work at a research organisation, who says \"we spent $z including salary and overheads on this researcher, and they produced a crucial seeming alignment paper, so our impact is $z per crucial seeming alignment paper\".</li>\n</ol>\n<p>When you account for this properly, it's clear that each of these estimates is too high, because part of the impact and cost has to be attributed elsewhere.</p>\n<p>A few off the cuff thoughts:</p>\n<p>It seems there should be a more complicated discounted measure of impact here for each organisation, that takes into account additional costs.</p>\n<p>It certainly could be the case that at each stage the impact is high enough to justify the program at the discounted rate.</p>\n<p>This might be a misunderstanding of what you're actually doing, in which case I would be excited to learn that you (and similar organisations) already accounted for this!</p>\n<p>I don't mean to pick on any organisation in particular if no one is doing this, it's just a thought about how these measures could be improved in general.</p>\n", "parentCommentId": null, "user": {"username": "rileyharris"}}, {"_id": "NtexXC6KqvAxtf9fk", "postedAt": "2023-07-12T09:27:47.189Z", "postId": "SFyCrtdfuYjtPq6xs", "htmlBody": "<p>Hi Riley,<br>Thanks a lot for your comment. I'll mainly speak to our (Impact Academy) approach to impact evaluation but I'll also share my impressions with the general landscape.<br><br>Our primary metric (*counter-factual* expected career contributions) explicitly attempts to take this into account. To give an example of how we roughly evaluate the impact:&nbsp;<br><br>Take an imaginary fellow, Alice. Before the intervention, based on our surveys and initial interactions, we expected that she may have an impactful career, but that she is unlikely to pursue a priority path based on IA principles. We rate her Expected Career Contribution (ECC) to be 2. After the program, based on surveys and interactions, we rate her as 10 (ECC) because we have seen that she’s now applying for a full-time junior role in a priority path guided by impartial altruism. We also asked her (and ourselves) to what extent that change was due to IA and estimate that to be 10%. To get our final Counterfactual Expected Career Contribution (CECC) for Alice, we subtract her initial ECC score of 2 from her final score of 10 to get 8, then multiply that score by 0.1 to get the portion of the expected career contribution which we believe we are responsible for. The final score is 0.8 CECC. As an formula: 10 (ECC after the program) - 2 (ECC before the program) * 0.1 (our counterfactual influence) = 0.8 CECC.<br><br>You can read more here: https://docs.google.com/document/d/1Pb1HeD362xX8UtInJtl7gaKNKYCDsfCybcoAdrWijWM/edit#heading=h.vqlyvfwc0v22<br><br>I have the sense that other orgs are quite careful about this too. E.g., 80,000hours seems to think that they only caused a relatively modest amount of significant career changes because they discovered that the people had updated significantly due to reasons not related to 80,000hours.<br><br>&nbsp;</p>", "parentCommentId": "tCRtAmacgcgFYuL4W", "user": {"username": "SebastianSchmidt"}}]