[{"_id": "fZwa84qYjwTjdqLGN", "postedAt": "2023-09-26T20:59:27.779Z", "postId": "SGZrrxThGrvn3Da5u", "htmlBody": "<p>Nice work Johannes!</p><p>Out of interested I Googled 'Founders Pledge Terrapraxis' and found <a href=\"https://www.founderspledge.com/research/terrapraxis\">this link</a> to a page saying 'We view the $250,000 as a seed grant through which to test whether we should recommend additional funding in 2021.' So I'm curious how that panned out, and also whether there's a more up-to-date version of that page (and if so whether you should delete that one).</p>", "parentCommentId": null, "user": {"username": "Arepo"}}, {"_id": "hECiFLd4FF7YiHsWb", "postedAt": "2023-09-27T10:27:13.662Z", "postId": "SGZrrxThGrvn3Da5u", "htmlBody": "<p>Hi Arepo, thanks!</p><p>There's been a bunch of occasions where I wrote or spoke about how Terra Praxis has developed, including the <a href=\"https://founderspledge.com/landscape\">Changing Landscape </a>report and the <a href=\"https://80000hours.org/podcast/episodes/johannes-ackva-unfashionable-climate-interventions/\">80k podcast</a>, but I agree it would be good to have an updated website post.</p><p>The TLDR right now would be:</p><ul><li>TP has grown significantly and we've made several grants following the initial grant.</li><li>Their work has been quite impactful, in particular they are leading a consortium on repowering coal with advanced heat sources as a high-impact <i>bet </i>I am excited about being made and that would probably not have happened without the incubation of TerraPraxis.</li><li>I am not sure this bet will succeed, but it addresses a key decarbonization challenge (emission from new/young coal plants unlikely to be prematurely retired) and the approach had very little attention before the work of TerraPraxis and some other FP grantees (in particular, Staffan Qvist, who wrote the first technical paper on the idea (before he was a grantee)).<br>&nbsp;</li></ul>", "parentCommentId": "fZwa84qYjwTjdqLGN", "user": {"username": "jackva"}}]