[{"_id": "BXkurHfWawP5yQzPw", "postedAt": "2022-10-11T05:52:53.834Z", "postId": "Shyfng2xGBHvG5qAK", "htmlBody": "<p>Thank you for sharing this Gilad, I'll get back to you with some links and suggestions tomorrow.</p>\n", "parentCommentId": null, "user": {"username": "Peterslattery"}}, {"_id": "g4rmhkAjSgqv5cwCw", "postedAt": "2022-10-11T23:44:57.635Z", "postId": "Shyfng2xGBHvG5qAK", "htmlBody": "<p>Hey Gilad, I had a very quick look at what you shared. These all seem like good courses with good teaching materials and projects. The student chapters seemed interesting from a quick scan, but I don't have time for feedback.<br><br>&nbsp;My only quick feedback is that I wonder if it would be good to make explicit that the student groups could post their chapters on the EA forum? Some could like that people will engage with the material and some of the materials could be of interest to the wider community and attract some comments.<br><br>I imagine that you already know about the <a href=\"https://preview.mailerlite.com/b1x9y6r5a9/2029723386967497346/d7x2/\">EA Behavioural Science Newsletter</a> and see that you are in the public directory (I didn't initially realise you were in the directory, hence the comment above).</p>", "parentCommentId": "BXkurHfWawP5yQzPw", "user": {"username": "Peterslattery"}}, {"_id": "wNxwpdyJWsGZkhbKJ", "postedAt": "2022-10-12T02:10:18.943Z", "postId": "Shyfng2xGBHvG5qAK", "htmlBody": "<p>Hi Gilad, looks like a fascinating course; &nbsp;thanks very much for sharing your teaching materials so generously.</p><p>I may borrow some of your ideas next time I teach my 'Psychology of Effective Altruism' course. (Syllabus <a href=\"https://www.primalpoly.com/s/syllabus-EA-2020-spring-final.docx\">here</a>).&nbsp;</p><p>I'll be very curious to hear how your U. Hong Kong students react to the EA material. I taught an online 'Decision Making' course last year for Chinese U. Hong Kong - Shenzhen (CUHK-SZ), which included a fair amount of EA material on X risks and longtermism, and was very impressed with the students' open-mindedness and interest in these issues.&nbsp;</p><p>I wondered if Chinese culture tends to instill more of a longtermist, multi-generational perspective. Or maybe students had just seen lots of science fiction movies depicting X risks, such as <a href=\"https://www.imdb.com/title/tt6628322/\">Shanghai Fortress</a> (2019) or <a href=\"https://www.imdb.com/title/tt7605074/\">The Wandering Earth</a> (2019).</p>", "parentCommentId": null, "user": {"username": "geoffreymiller"}}, {"_id": "43ydyjxjvku3GdwdP", "postedAt": "2022-10-12T06:24:53.303Z", "postId": "Shyfng2xGBHvG5qAK", "htmlBody": "<p>Thanks, Geoffrey, I actually saw your syllabus on the EA forums and &nbsp;used some of that, thanks for sharing that with the community, it helped me think more about what I wanted to do with our course and inspired some of the directions. Please do feel free to build on that. Would be happy to see what you come up with, if you're willing to share back.<br><br>Actually, all of the lectures are recorded (<a href=\"https://www.youtube.com/playlist?list=PLRAF6P3W1K4ffIvyrnVn4fuov5gf0Nd4c\">link</a>), though most times you can't really hear the students very well because they don't have a mic so I sometimes cut that out, but you can definitely hear my questions and reactions to what they're saying. It can give you an indication of the kind of interaction we have in the classroom.&nbsp;<br>Doing classroom engagement and discussion is a bit tricky in our cultural context, it has been easier in other places I've been to. It takes &nbsp;a while for the students to feel comfortable with the possibility of making a mistake or questioning the professor, but usually somewhere mid-semester some key students overcome that and then class engagement become a bit easier.&nbsp;<br><br>I don't know about other cultural influences, but what I can say for sure is that in term of ability and execution the students I've taught at HKU are some of the most remarkable students I've encountered. What we've achieved together in the last 4 years is nothing short of remarkable, they have exceeded my expectations in every step of the way (example of us completing 120 replications and extensions of classic findings in JDM: <a href=\"https://mgto.org/core-team/)\">https://mgto.org/core-team/)</a>. &nbsp;I am hoping that we'd be able to do similar things with the EA directions, we'll know by the end of the semester if this realigned paid off and what students felt about it. Change and uncertainty are always a bit difficult with students who sometimes want a clear idea of how to get a high grade and the investment involved, so I'm hoping there are enough side-benefits to what we're doing here to compensate for having less of that with me this semester as we figure things out together.</p>", "parentCommentId": "wNxwpdyJWsGZkhbKJ", "user": {"username": "Gilad Feldman"}}, {"_id": "uPuR2prMjGEYZynge", "postedAt": "2022-10-12T06:28:15.767Z", "postId": "Shyfng2xGBHvG5qAK", "htmlBody": "<p>Thank you for taking the time to have a look and go through things. No need for in-depth feedback, the two books are over 400 pages long :)&nbsp;</p><p>Yes, I've been trying to catch up with the behavioral science/JDM/Social psychology folks who do EA, and have signed up to almost everything I saw on the topic. I am learning a lot from that.<br><br>We will definitely make an official preprint and share everything with the community. I would rather invite other to comment on the Google Docs than post permanent copies on the EA forums, because this is all work in process and we are figuring things out throughout the semester. Once they submit their final copies, I'll try and make that a bit more official with a new post, and will then aim to make this into more of a community effort inviting the EA members to become our collaborators/coauthors, which is our usual way of doing things.</p>", "parentCommentId": "g4rmhkAjSgqv5cwCw", "user": {"username": "Gilad Feldman"}}, {"_id": "CFXoyqukTPPGGPnnR", "postedAt": "2022-10-12T16:16:01.908Z", "postId": "Shyfng2xGBHvG5qAK", "htmlBody": "<p>Hi Gilad,</p><p>Thanks for your detailed reply. The CORE Team project looks fascinating; I'll email to follow up about it.</p><p>Your impressions of Chinese students match mine. My students never spoke up much in class, but they were avid contributors to my weekly online discussion forums, where they seemed to feel freer to connect the course material to their other courses, their own lives, current events, and Chinese pop culture (which was very educational for me!). (It helped that contributions to the discussion forum determined 30% of their course grade.)</p>", "parentCommentId": "43ydyjxjvku3GdwdP", "user": {"username": "geoffreymiller"}}]