[{"_id": "nSFfRhHTirPHDEhNx", "postedAt": "2015-01-11T18:20:32.329Z", "postId": "Si9r4zbXCXzoGCAQy", "htmlBody": "<p>Record <a href=\"http://www.lightsfilmschool.com/articles/room_tone/index.html\">room tone</a> so that you don't get that choppy sound every time you cut to a new clip!</p>\n<p>Room tone = Before (or during or after) you start shooting, record about a minute of silence in that location. When you lay that audio track underneath the rest of your audio, you'll have a consistent ambient hum instead of one that changes each time you cut.</p>\n<p>In terms of content, I thought there was <em>a lot</em> of material in here for this type of video. It was basically 20-30 bullet points in very quick succession, some of them with numbers and details that I, as a viewer, don't have enough time to process. I felt like there was so much information in such rapid fire fashion that I wasn't able to focus on what was being said. I'd recommend keeping the material simple and speaking more slowly.</p>\n", "parentCommentId": null, "user": {"username": "Bitton"}}, {"_id": "BAH6JWJuFXMd4sT3X", "postedAt": "2015-01-11T19:09:58.630Z", "postId": "Si9r4zbXCXzoGCAQy", "htmlBody": "<p>I agree with Bitton, and think he has more experience on this than almost any of the rest of us. </p>\n<p>That said, great job with the effort and I'm looking forward to seeing where you go from here.</p>\n", "parentCommentId": "nSFfRhHTirPHDEhNx", "user": {"username": "oagr"}}, {"_id": "G5ce6SvYjGeLvFmiE", "postedAt": "2015-01-11T19:42:47.827Z", "postId": "Si9r4zbXCXzoGCAQy", "htmlBody": "<p>Thanks for the feedback- I will be sure to simplify the script and use room tone in the next video!</p>\n<p>Do you have any suggestions for blogs/guides I can read up on for other tips?</p>\n<p>Cheers! </p>\n", "parentCommentId": "nSFfRhHTirPHDEhNx", "user": {"username": "jonathancourtney"}}, {"_id": "Cuxsh26qSpmk3QevT", "postedAt": "2015-01-11T22:11:45.181Z", "postId": "Si9r4zbXCXzoGCAQy", "htmlBody": "<p>There's a guy on a movie message board I used to read that did a series of &quot;30 Minute Film Schools&quot; a while ago. Here's the one on <a href=\"https://mubi.com/topics/30-minute-film-school-v-the-good-the-bad-and-the-audio\">audio</a> and here's one on <a href=\"https://mubi.com/topics/30-minute-film-school-ii-how-to-operate-a-prosumer-video-camera\">prosumer cameras</a>.\nI think he has an especially fun way of teaching - his writing style reminds me of Slate Star Codex.</p>\n", "parentCommentId": "G5ce6SvYjGeLvFmiE", "user": {"username": "Bitton"}}, {"_id": "PELgBCrusgCi5XQhL", "postedAt": "2015-01-23T11:30:35.576Z", "postId": "Si9r4zbXCXzoGCAQy", "htmlBody": "<p>Gates foundation seem quite good at video content aimed at communicating similar types of things to popular audiences?</p>\n", "parentCommentId": "G5ce6SvYjGeLvFmiE", "user": {"username": "tomstocker"}}]