[{"_id": "oWvANJafgmJMzuPrx", "postedAt": "2022-09-12T00:29:06.319Z", "postId": "SiD2mwCP86uXaGkEd", "htmlBody": "<p>What are the best strategies for political movements that claim to advocate for a voiceless group to take? (longtermism for future generations, animal rights for animals, pro-lifers for fetuses...)</p><p>Should groups with very niche, technocratic issues try to join a party or try to stay non-partisan? Implications for AI, biorisk, and so on.</p><p>Can Americanists come up with a measure of democratic decline that's actually decent and not just a reskinned Polity/FreedomHouse metric?</p><p>EAs love economists. Can political scientists develop concepts that get them the same affection in EA circles?</p><p>In retrospect, the early 00's feminist blogosphere seems like it was hugely impactful. Is that true and if so what can other movements (like EA) learn from them?</p><p>Can someone in American Political Development tell us whether successful movements in American politics were ever longtermist in motivation?</p><p>Thanks for putting the panel together!!!</p>", "parentCommentId": null, "user": {"username": "ColdButtonIssues"}}, {"_id": "tgFGwWH7kzTqDxRPB", "postedAt": "2022-09-12T00:53:15.182Z", "postId": "SiD2mwCP86uXaGkEd", "htmlBody": "<p>I'd suggest that the ultimate objective for a lot of American-origin political theory and the ultimate objective for a lot of altruistic behavior theories (economics, psychology, etc.) &nbsp;is self-determination. That's where everyone wants to get. Its easy for political theorists, especially American theorists to grasp because individual liberty and anti-authoritarianism are such pervasive themes in the US poli sci academy. Its probably harder for EA folks to see specifically because of the entrenchment EA has with material definitions of good and wellbeing &nbsp;and the focus EA has on defining those concepts for others, but I think its still there if you asked an EA to define what a person who no longer needs help looks like.&nbsp;</p><p>The big question is, how do we get to self-determination and leading into that, how do altruists and political scientists define self-determination? I think that'd be an interesting parallel or juxtaposition.&nbsp;</p><p>I'd be really curious to hear about the value or importance Peter Singer places on self-determination, currently, and if he sees any parallels between this pretty clear objective of American political theory and the objectives of EA. Especially in the context of the sort of global battle (literal and figurative) for self-determination we currently find ourselves within.&nbsp;</p><p>You should post a link to the roundtable if there ends up being one - live or post. Sounds very interesting given the theme and thinkers.&nbsp;</p>", "parentCommentId": null, "user": null}, {"_id": "QdEzEZ4A7XrZay8Kd", "postedAt": "2022-09-12T08:59:31.446Z", "postId": "SiD2mwCP86uXaGkEd", "htmlBody": "<p>What strategies do you see as most promising in reducing the risk of destructive conflict?</p><p>Do you think greater global equality would reduce existential risk?</p><p>Do you think sufficient research work is being done on the political status of digital minds?</p>", "parentCommentId": null, "user": {"username": "5566hh"}}, {"_id": "QqeCEGzfgStPk7Xnp", "postedAt": "2022-09-12T15:16:39.972Z", "postId": "SiD2mwCP86uXaGkEd", "htmlBody": "<p>I'd be curious to hear the panel's opinions on how new movements can position itself in a political climate characterized by polarized social issues. What are effective targets to influence - from the general public to established bureaucrats? How are today's answers different from 20 or 50 years ago?</p>\n", "parentCommentId": null, "user": {"username": "Sharang Phadke"}}, {"_id": "WwWZANLwysCAZRi6w", "postedAt": "2022-09-12T18:13:40.418Z", "postId": "SiD2mwCP86uXaGkEd", "htmlBody": "<p>Hi Mahendra, sounds like a great event, and glad that EA will get some attention at APSA. I have two suggested topic:</p><p>(A) Partisan polarization is a big issue in the US (and many other countries), with suggested responses ranging from (1) reducing algorithmic polarization on social media, to (2) promoting alternative voting systems (e.g. ranked-choice voting &amp; open primaries, as advocated by the Forward Party) to break the two-party duopology, to (3) an 'amicable divorce' between red states and blue states, to reduce chances the current 'soft civil war' (at the cultural level) turns into a shooting war. (One difficulty is that this issue has large scope (and applies in many countries), but it doesn't seem particularly tractable or neglected. On the other hand, most of the discussion around it is notably irrational, non-consequentialist, and political biased.) I'd be curious to hear what the speakers think about partisan polarization as a 'cause area' for EA.&nbsp;</p><p>(B) EA itself has some strong political biases towards a sort of vaguely Lefty, socially progressive libertarianism, and this can smuggle in a lot of implicit political biases into our analysis. Can and should EA try to consciously &amp; deliberately cultivate a wider range of political views among its researchers and advocates -- possibly even beyond the current US/UK Overton window? (For example, a lot of EA panic about a possible 'permanent global totalitarian state' sounds like a not-very-subtle caricature of the Chinese CCP, and that kind of rhetoric may be alienating to &nbsp;a lot of smart Chinese people who might otherwise be interested in EA and longtermism.)</p>", "parentCommentId": null, "user": {"username": "geoffreymiller"}}, {"_id": "oXYE9MoFKAZ7b3NWg", "postedAt": "2022-09-12T20:52:11.184Z", "postId": "SiD2mwCP86uXaGkEd", "htmlBody": "<p>This sounds like a very interesting event! I'd be curious to hear this group's perspective on the growing influence of business in American politics:</p><ul><li>Do they worry about the consequences of Citizens United, SuperPACs, etc with regards to EA cause areas? &nbsp;</li><li>What could be the most productive ways for public bodies, EA orgs, and individuals to engage with corporations as increasingly important political actors?&nbsp;</li><li>Do they see promising opportunities for public-private collaboration on reducing long-term risks in AI, biosecurity, or other areas?&nbsp;</li></ul>", "parentCommentId": null, "user": {"username": "nikhilmulani"}}, {"_id": "ezTuRByaHkfNGHPXY", "postedAt": "2022-09-13T15:43:26.145Z", "postId": "SiD2mwCP86uXaGkEd", "htmlBody": "<p>I'm not very involved with EA/politics but I'd be interested in hearing discussion about how to improve decision making and institution design. For example - a fundamental problem with government bodies is they seem to function well early on, when they are made up of people who believe in the goal and there is a strong unified culture. But suffer from malaise as years pass and both people and systems get entrenched to the point that the goal is secondary. Incentive alignment decays and becomes virtually nonexistent in many governmental bodies.<br><br>Of course I also have a special interest in how the government can address wrong incentives caused by externalities.<br><br>What about more political experiments - stronger states rights, charter cities, special economic zones, as a way to move forward, and demonstrate effectiveness/ineffectiveness without trying to go through the disfunction we currently see in federal government?<br><br>And solving vetocracy at local levels through things like quadratic voting, systems that prevent gerrymandering, street votes, etc.<br><br>Anything else I haven't heard of that seems a promising way to improve political outcomes!</p>", "parentCommentId": null, "user": {"username": "EcologyInterventions"}}]