[{"_id": "2BKEeH4RX9j3So5Pu", "postedAt": "2023-05-27T09:28:16.955Z", "postId": "SmKLaLPsogwtFs6WT", "htmlBody": "<p>This could align well with Charity Entrepreneurship's <a href=\"https://www.charityentrepreneurship.com/post/the-charity-entrepreneurship-top-ideas-new-charity-prediction-market\">current consideration</a> of ideas in preventive animal welfare, specifically 'Limiting the intensification of factory farming in LMICs'. Let me know if you'd like help reaching out! (I'm not sure who the lead researcher is for that idea, but know CE well)</p>", "parentCommentId": null, "user": {"username": "BenStewart"}}, {"_id": "eesX9WhZS3fgHEwxX", "postedAt": "2023-05-27T10:21:32.495Z", "postId": "SmKLaLPsogwtFs6WT", "htmlBody": "<p>Hi Ben, I will be open to talking to CE's researcher on this. Appreciate the introductions.</p>", "parentCommentId": "2BKEeH4RX9j3So5Pu", "user": {"username": "abilibadanielbaba11@gmail.com"}}, {"_id": "DtwugfiTuh7JRioxc", "postedAt": "2023-05-27T10:59:14.388Z", "postId": "SmKLaLPsogwtFs6WT", "htmlBody": "<p>I'll get in touch and DM you.</p>", "parentCommentId": "eesX9WhZS3fgHEwxX", "user": {"username": "BenStewart"}}, {"_id": "Pxb8Ge6L2pEKEt2vz", "postedAt": "2023-05-27T11:22:40.790Z", "postId": "SmKLaLPsogwtFs6WT", "htmlBody": "<p>This is a fantastic post. I strongly believe a model farm would be great for the cage-free movement in Africa. Nice one!</p>\n", "parentCommentId": null, "user": {"username": "EMMANUEL D. PIIRU"}}, {"_id": "8PgQf75EbfcLiMLcR", "postedAt": "2023-05-27T19:44:23.076Z", "postId": "SmKLaLPsogwtFs6WT", "htmlBody": "<p>Thank you for addressing the urgent need to improve animal welfare in Africa's egg industry!<br><br>Creating a cage-free producer's directory seems like a low-hanging fruit that could have a significant impact in streamlining cage-free commitments in the region.</p><p>The rapid growth of commercial interest in Africa's poultry industry is concerning, and it presents a crucial moment for effective action. Just like the early stages of factory farming in the US, this is an opportune time to prioritize resources and make a lasting difference. Treating it as a second chance to reverse the momentum of industrialized animal agriculture is of utmost importance. Thank you for highlighting this issue!</p><p>Do you know if any specific organizations or individuals who are trying to create this model farm and/or directory?</p>", "parentCommentId": null, "user": {"username": "Constance Li"}}, {"_id": "jhweqqPW4KCZ9ZyYh", "postedAt": "2023-05-28T00:27:23.656Z", "postId": "SmKLaLPsogwtFs6WT", "htmlBody": "<p>Hi Constance, I totally agree with you that the time to act is now and with regards to specific organizations,&nbsp;<a href=\"https://www.animalwelfareleague.org\"><u>Animal Welfare League</u></a> has started working on this in Ghana. We have created a cage-free farmers directory that consists of farmers who adhere to cage-free minimum welfare standards and pledged to ensure the welfare of their birds are met at all times.&nbsp;</p><p>We have also been up-skilling some staff in cage-free productions virtually with the <a href=\"https://globalfoodpartners.com/\">Global Food Partners</a> and hope to secure funding to take them through the physical training at the Global Food Partners Cage-free facility.</p><p>We particularly view a producer’s directory pertinent to an improved chicken welfare across Africa and with experiences from leading Open Wing Alliance’s (OWA) Africa outreach to global companies in Africa, we firmly believe that a producer’s directory with a corresponding cage-free model farm will serve as a practical demonstration farm for training producers especially transitioning cage farmers. This model farm will also be a research station that will provide context relevant layer hen welfare improvement data points to enrich the cage-free campaign in Africa</p><p><br>&nbsp;</p>", "parentCommentId": "8PgQf75EbfcLiMLcR", "user": {"username": "ayangjacob1"}}, {"_id": "jZzxt6Pb7TSTxGgDo", "postedAt": "2023-05-29T10:35:51.140Z", "postId": "SmKLaLPsogwtFs6WT", "htmlBody": "<p>Hi Constance, I think is only Animal Welfare League in Ghana currently doing this in Africa. More details about the work in Jacob’s reply above 👆🏾</p>\n", "parentCommentId": "8PgQf75EbfcLiMLcR", "user": {"username": "abilibadanielbaba11@gmail.com"}}, {"_id": "si3KZ9pi8yYwDc2kS", "postedAt": "2023-05-29T13:15:40.432Z", "postId": "SmKLaLPsogwtFs6WT", "htmlBody": "<p>Thanks for your thorough response, Jacob! I don't see the cage-free directory published on the website. Is it just not ready or is it just complete and private or am I just not looking in the right place? I'm also curious to know what the biggest bottlenecks for your projects are.</p>", "parentCommentId": "jhweqqPW4KCZ9ZyYh", "user": {"username": "Constance Li"}}, {"_id": "pujYjHai9kujj9NQw", "postedAt": "2023-05-31T15:19:34.857Z", "postId": "SmKLaLPsogwtFs6WT", "htmlBody": "<p>Woa this is cool.</p>\n<p>Global Food Partners created a producers directory called <a href=\"http://cagefreehub.globalfoodpartners.com\">cagefreehub.globalfoodpartners.com</a> for Asia sellers. GFP has done a lot of work to reach out to sellers for it, maybe useful to chat with gfp more about what it is and if it could be useful for Africa.\n(note: I am the web developer of cagefreehub)</p>\n", "parentCommentId": null, "user": {"username": "Daryl D'Souza"}}]