[{"_id": "gjXmzaBDRg6wW5e69", "postedAt": "2017-05-11T00:43:46.767Z", "postId": "SMRHnGXirRNpvB8LJ", "htmlBody": "<p>This is a great post and I thank you for taking the time to write it up.</p>\n<p>I ran an EA club at my university and ran a workshop where we covered <a href=\"http://philosophicaldisquisitions.blogspot.ca/2016/01/effective-altruism-taxonomy-of.html\">all</a> <a href=\"https://meteuphoric.wordpress.com/2017/02/03/effective-diversity/\">the</a> <a href=\"http://effective-altruism.com/ea/18m/effective_altruism_an_elucidation_and_a_defence/\">philosophical</a> objections to Effective Altruism. All objections were fairly straightforward to address except for one which - in addressing it - seemed to upend how many participants viewed EA, given what image they thus far had of EA. That objection is: <strong>Effective Altruism is not that effective.</strong></p>\n<p>There is a lot to be said for this objection and I highly highly recommend anyone who calls themselves an EA to read up on it <a href=\"http://benjaminrosshoffman.com/effective-altruism-not-no-brainer/\">here</a> and <a href=\"http://philosophicaldisquisitions.blogspot.ca/2016/05/is-effective-altruism-actually-effective.html\">here</a>. None of <a href=\"https://www.effectivealtruism.org/faqs-criticism-objections/#objections-to-effective-altruism\">the other objections</a> to EA seem to me to have nearly as much moral urgency as this one. If we call this thing we do EA and it is not E I see a moral problem. If you donate to deworming charities and have never heard of wormwars I also recommend taking a look at <a href=\"https://storify.com/viewfromthecave/tracking-the-wormwars\">this</a> which is an attempt to track the entire debacle of &quot;deworming-isn't-that-effective&quot; controversy in good faith.</p>\n<p><strong>Disclaimer:</strong> I donate to SCI and rank it near the top of my priorities, just below AMF currently. I even donate to less certain charities like <a href=\"https://animalcharityevaluators.org/\">ACE's recommendations</a>. So I certainly don't mean to dissuade anyone from donating in this comment. Reasoning under uncertainty is a thing and you can see <a href=\"https://danwahl.github.io/stochastic-altruism-2016\">these</a> <a href=\"http://effective-altruism.com/ea/193/how_do_ea_orgs_account_for_uncertainty_in_their/\">two</a> recent posts if you desire insight into how an EA might try to go about it effectively.</p>\n<p>The take home of this though is the same as the three main points raised by OP. If it had been made clear to us from the get-go what mechanisms are at play that determine how much impact an individual has with their donation to an EA recommended charity, then this <strong>EA is not E</strong> objection would have been as innocuous as <a href=\"https://www.effectivealtruism.org/faqs-criticism-objections/#objections-to-effective-altruism\">the rest</a>. Instead, after addressing this concern and setting straight how things actually work (I still don't completely understand it, it's complicated) participants felt their initial exposure to EA (such as through the guide dog example and other over-simplified EA infographics that strongly imply it's as simple and obvious as: &quot;donation = lives saved&quot;) contained false advertising. The words <em>slight disillusionment</em> comes to mind, given these were all dedicated EAs going into the workshop.</p>\n<p>So yes, I bow down to the almighty points bestowed by OP:</p>\n<ul>\n<li><p>many of us were overstating the point that money goes further in poor countries</p>\n</li>\n<li><p>many of us don’t do enough fact checking, especially before making public claims</p>\n</li>\n<li><p>many of us should communicate uncertainty better</p>\n</li>\n</ul>\n<p>Btw, <em>Scope insensitive</em> link does not seem to work I'm afraid (Update: Thanx for fixing!)</p>\n", "parentCommentId": null, "user": {"username": "Cornelius"}}, {"_id": "Rja5xGxo3Y2r8CW3b", "postedAt": "2017-05-11T07:37:31.670Z", "postId": "SMRHnGXirRNpvB8LJ", "htmlBody": "<p>This feels like nitpicking that gives the impression of undermining Singer's original claim when in reality the figures support them.  I have no reason to believe Singer was claiming that of all possible charitable donations trauchoma is the most effective, merely to give the most stunningly large difference in cost effectiveness between charitable donations used for comparable ends (both about blindness so no hard comparisons across kinds of suffering/disability).  </p>\n<p>I agree that within the EA community and when presenting EA analysis of cost-effectiveness it is important to be upfront with the full complexity of the figures.  However, <b>Singer's purpose at TED isn't to carefully pick the most cost effective donations but to force people to confront the fact that cost effectiveness matters.</b>.  While those of us already in EA might find a statement like &quot;We prevent 1 year of blindness for every 3 surgeries done which on average cost...&quot; perfectly compelling the audience members who aren't yet persuaded simply tune out.  After all it's just more math talk and they are interested in emotional impact.  The only way to convince them is to ignore getting the numbers perfectly right and focus on the emotional impact of choosing to help a blind person in the US get a dog rather than many people in poor countries avoid blindness.</p>\n<p>Now it's important that we don't simplify in misleading ways but even with the qualifications here it is obvious that it still costs orders of magnitude more to train a dog than prevent blindness via this surgery.   Moreover, once one factors in considerations like pain, the imperfect replacement for eyes provided by a dog, etc.. the original numbers are probably too favorable to dog training as far as relative cost effectiveness goes.</p>\n<p>This isn't to say that your point here isn't important regarding people inside EA making estimates or givewell analysis or the like.  I'm just pointing out that it's important to distinguish the kind of thing being done at a TED talk like this from that being done by givewell.  So long as when people leave the TED talk their research leaves the big picture in place (dogs &gt;&gt;&gt;&gt; trauchoma surgery) it's a victory.</p>\n", "parentCommentId": null, "user": {"username": "TruePath"}}, {"_id": "6xDMq7fTW9ocHEBnE", "postedAt": "2017-05-11T08:44:16.871Z", "postId": "SMRHnGXirRNpvB8LJ", "htmlBody": "<p>I think there is truth in what you said. But I also have disagreements:</p>\n<blockquote>\n<p>&quot;The only way to convince them is to ignore getting the numbers perfectly right and focus on the emotional impact&quot;</p>\n</blockquote>\n<p>That's a dangerous line of reasoning. If we can't make a point with honest numbers, we shouldn't make the point at all. We might fail to notice when we are wrong when we use bogus numbers to prove whatever opinion we already hold. </p>\n<p>What is more, many people who become EAs after hearing such TED talks already think in numbers. They continue in believing the same numbers afterwards and are more likely to dismiss other cause areas because of it. I myself once mocked a co-worker for taking an effort to recycle when the same effort could do so much more impact for people in Africa. That's wrong in any case, but I was probably wrong in my reasoning too because of numbers.</p>\n<p>Also, I'm afraid that some doctor will stand up during an EA presentation and say</p>\n<blockquote>\n<p>You kids pretend to be visionaries, but in reality you don't have the slightest idea what you are talking about. Firstly, it's impossible to cure trachoma induced blindness. Secondly [...] You should go back to play in your sandboxes instead of preaching adults how to solve real world problems</p>\n</blockquote>\n<p>Also, I'm afraid that the doctor might be partially right</p>\n", "parentCommentId": "Rja5xGxo3Y2r8CW3b", "user": {"username": "saulius"}}, {"_id": "AdXTcvJvDcp6ES57L", "postedAt": "2017-05-11T14:44:34.500Z", "postId": "SMRHnGXirRNpvB8LJ", "htmlBody": "<p>Overstatement seems to be selected for when 1) evaluators like Givewell are deferred-to rather than questioned, 2) you want to market that Faithful Deferrence to others. </p>\n", "parentCommentId": "gjXmzaBDRg6wW5e69", "user": {"username": "DonyChristie"}}, {"_id": "G2ix9ZcbAiXwSKLme", "postedAt": "2017-05-11T19:30:20.972Z", "postId": "SMRHnGXirRNpvB8LJ", "htmlBody": "<p>I agree with those concerns.</p>\n<p>In addition, some people might perceive the &quot;guide dogs vs. trachoma surgeries&quot; example as ableist, or might think that EAs are suggesting that governments spend less on handicapped people and more on foreign aid. (This is a particularly significant issue in Germany, where there have been lots of protests by disability rights advocates against Singer, also more recently when he gave talks about EA.)</p>\n<p>In fact, one of the top google hits for &quot;guide dog vs trachoma surgery&quot; is <a href=\"http://www.dogster.com/the-scoop/controversial-philosopher-peter-singer-thinks-guide-dogs-are-waste-of-money\">this</a>:</p>\n<blockquote>\n<p>The philosopher says funding should go toward prevention instead of guide-dog training. Activists for the blind, of course, disagree.</p>\n</blockquote>\n<p>For these reasons, I suggest not using the guide dog example at all anymore.</p>\n<p>The above article also makes the following, interesting point:</p>\n<blockquote>\n<p>Many people are able to function in society at a much higher level than ever before because of service dogs and therapy dogs. You would think that’s a level of utility that would appeal to Singer, but he seems to have a blind spot of his own in that respect.</p>\n</blockquote>\n<p>This suggests that both guide dogs and trachoma surgeries cause significant flow-through effects. All of these points combined might decrease the effectiveness difference from 1000x to something around 5x-50x (see also <a href=\"http://reducing-suffering.org/why-charities-dont-differ-astronomically-in-cost-effectiveness/\">Why Charities Don't Differ Astronomically in Cost-Effectiveness</a>).</p>\n", "parentCommentId": null, "user": {"username": "Jonas Vollmer"}}, {"_id": "6tgFqN9oseWWY4mGf", "postedAt": "2017-05-11T22:11:58.225Z", "postId": "SMRHnGXirRNpvB8LJ", "htmlBody": "<p>If we're ignoring getting the numbers right and instead focusing on the emotional impact, we have no claim to the term &quot;effective&quot;. This sort of reasoning is why epistemics around dogooding are so bad in the first place. </p>\n", "parentCommentId": "Rja5xGxo3Y2r8CW3b", "user": {"username": "ozymandias"}}, {"_id": "QsY4cZEpW2PRwsxCd", "postedAt": "2017-05-12T07:16:37.868Z", "postId": "SMRHnGXirRNpvB8LJ", "htmlBody": "<blockquote>\n<p>significant flow-through effects.</p>\n</blockquote>\n<p>And those flow-through effects may often be bigger per person when helping people in richer countries, since people in richer countries tend to have more impact on economic growth, technological and memetic developments, etc. than those in poorer countries. (Of course, whether these flow-through effects are net good or net bad is not clear.)</p>\n", "parentCommentId": "G2ix9ZcbAiXwSKLme", "user": {"username": "Brian_Tomasik"}}, {"_id": "M6EeCaXFYPG46ZFRz", "postedAt": "2017-05-12T23:23:20.733Z", "postId": "SMRHnGXirRNpvB8LJ", "htmlBody": "<p>Regrettably, I misspoke in my TED talk when I referred to &quot;curing&quot; blindness from trachoma.  I should have said &quot;preventing.&quot;  (I used to talk about curing blindness by performing cataract surgery, and that may be the cause of the slip.)  But there is a source for the figure I cited, and it is not GiveWell.  I give the details in The Most Good You Can Do&quot;, in an endnote on p. 194, but to save you all looking it up, here it is:</p>\n<p>&quot;I owe this comparison to Toby Ord, “The moral imperative towards cost-effectiveness,” <a href=\"http://www.givingwhatwecan.org/sites/givingwhatwecan.org/files/attachments/moral_imperative.pdf\">http://www.givingwhatwecan.org/sites/givingwhatwecan.org/files/attachments/moral_imperative.pdf</a>. Ord suggests a figure of $20 for preventing blindness; I have been more conservative. Ord explains his estimate of the cost of providing a guide dog as follows: “Guide Dogs of America estimate $19,000 for the training of the dog. When the cost of training the recipient to use the dog is included, the cost doubles to $38,000. Other guide dog providers give similar estimates, for example Seeing Eye estimates a total of $50,000 per person/dog partnership, while Guiding Eyes for the Blind estimates a total of $40,000.”  His figure for the cost of preventing blindness by treating trachoma comes from Joseph Cook et al., “Loss of vision and hearing,” in Dean Jamison et al., eds., Disease Control Priorities in Developing Countries, 2d ed. (Oxford: Oxford University Press, 2006), 954. The figure Cook et al. give is $7.14 per surgery, with a 77 percent cure rate. I thank Brian Doolan of the Fred Hollows Foundation for discussion of his organization’s claim that it can restore sight for $25. GiveWell suggests a figure of $100 for surgeries that prevent one to thirty years of blindness and another one to thirty years of low vision but cautions that the sources of these figures are not clear enough to justify a high level of confidence.&quot;</p>\n<p>Now, maybe there is some more recent research casting doubt on this figure, but note that the numbers I use allow that the figure may be $100 (typically, when I speak on this, I give a range, saying that for the cost of training one guide dog, we may be able to prevent somewhere between 400 - 1600 cases of blindness.  Probably it isn't necessary even to do that.  The point would be just as strong if it were 400, or even 40.</p>\n", "parentCommentId": null, "user": {"username": "PeterSinger"}}, {"_id": "XNZX7gLAE6yNjgr5P", "postedAt": "2017-05-12T23:31:18.285Z", "postId": "SMRHnGXirRNpvB8LJ", "htmlBody": "<p>I don't understand the objection about it being &quot;ableist&quot; to say funding should go towards preventing people becoming blind rather than training guide dogs</p>\n<p>If &quot;ableism&quot; is really supposed to be like racism or sexism, then we should not regard it as better to be able to see than to have the disability of not being able to see.  But if people who cannot see are no worse off than people who can see, why should we even provide guide dogs for them?  On the other hand, if -- more sensibly -- disability  activists think that people who are unable to see are at a disadvantage and need our help, wouldn't they agree that it is better to prevent many people -- say, 400 -- experiencing this disadvantage than to help one person cope a little better with the disadvantage?  Especially if the 400 are living in a developing country and have far less social support than the one person who lives in a developed country?</p>\n<p>Can someone explain to me what is wrong with this argument?   If not, I plan to keep using the example. </p>\n", "parentCommentId": "G2ix9ZcbAiXwSKLme", "user": {"username": "PeterSinger"}}, {"_id": "LYoGLn4Q27hioN4mY", "postedAt": "2017-05-13T02:18:48.371Z", "postId": "SMRHnGXirRNpvB8LJ", "htmlBody": "<p>If I try to steelman the argument, it comes out something like:</p>\n<p>Some people, when they hear about the guide dog - tracheoma surgery contrast, will take the point to be that ameliorating a disability is intrinsically less valuable than preventing or curing an impairment. (In other words, that helping people live fulfilling lives while blind is necessarily a less worthy cause than &quot;fixing&quot; them.) Since this is not in fact the intended point, a comparison of more directly comparable interventions would be preferable, if available.</p>\n", "parentCommentId": "XNZX7gLAE6yNjgr5P", "user": {"username": "BenHoffman"}}, {"_id": "iz3zwsdNQzAondo5Y", "postedAt": "2017-05-13T02:22:40.563Z", "postId": "SMRHnGXirRNpvB8LJ", "htmlBody": "<p>On the ableism point, my best guess is that the right response is to figure out the substance of the criticism. If we disagree, we should admit that openly, and forgo the support of people who do not in fact agree with us. If we agree, then we should account for the criticism and adjust both our beliefs and statements. Directly optimizing on avoiding adverse perceptions seems like it would lead to a distorted picture of what we are about.</p>\n", "parentCommentId": "G2ix9ZcbAiXwSKLme", "user": {"username": "BenHoffman"}}, {"_id": "WiYqJQZJbkxGLnxMz", "postedAt": "2017-05-13T10:31:53.548Z", "postId": "SMRHnGXirRNpvB8LJ", "htmlBody": "<p><a href=\"http://www.dogster.com/the-scoop/controversial-philosopher-peter-singer-thinks-guide-dogs-are-waste-of-money\">The article Vollmer</a> cites says:</p>\n<blockquote>\n<p>Singer’s idea about the relative value of guide dogs sets up a false dichotomy, assuming that you can fund guide dogs or fund medical prevention. In fact, you can do both.</p>\n</blockquote>\n<p>In this case that seems to be the substance of the criticism. You can't anticipate every counter-argument one could make when talking to bigger audiences, but this one is pretty common. It might be necessary to say </p>\n<blockquote>\n<p>if I have to decide where to donate <strong>my</strong> $ 100...</p>\n</blockquote>\n<p>Not sure it would help, it could be that such arguments trigger bad emotions for other reasons and the counter-arguments we hear are just rationalizations of those emotions. It does feel like a minefield.</p>\n<p>Therefore, when comparing any 2 charities while introducing someone (especially an audience) to EA, we must phrase it carefully and sensitively. BTW, I think there is something to learn from way Singer phrased it in the TED talk:</p>\n<blockquote>\n<p>Take, for example, providing a guide dog for a blind person. That's a good thing to do, right? Well, right, it is a good thing to do, but you have to think what else you could do with the resources. It costs about 40,000 dollars...</p>\n</blockquote>\n", "parentCommentId": "iz3zwsdNQzAondo5Y", "user": {"username": "saulius"}}, {"_id": "FmxdW66EmRMWgJwWb", "postedAt": "2017-05-13T14:01:41.004Z", "postId": "SMRHnGXirRNpvB8LJ", "htmlBody": "<p>EDIT: this comment contains some <a href=\"http://effective-altruism.com/ea/19w/we_are_often_giving_wrong_facts_about_trachoma/ay8\">mistakes</a></p>\n<p>To begin with, I want to say that my goal is not to put blame on anyone but to change how we speak and act in the future. </p>\n<blockquote>\n<p>His figure for the cost of preventing blindness by treating trachoma comes from Joseph Cook et al., “Loss of vision and hearing,” in Dean Jamison et al., eds., Disease Control Priorities in Developing Countries, 2d ed. (Oxford: Oxford University Press, 2006), 954. The figure Cook et al. give is <strong>$7.14 per surgery, with a 77 percent cure rate</strong>.</p>\n</blockquote>\n<p>I am looking at this <a href=\"https://www.ncbi.nlm.nih.gov/books/NBK11759/table/A7534/?report=objectonly\">table</a> from the cited source (<a href=\"https://www.ncbi.nlm.nih.gov/books/NBK11759/\">Loss of Vision and Hearing, DCP2</a>). It’s 77% cure rate for trachoma that sometimes develops into blindness. Not 77% cure rate for blindness. At least that’s how I interpret it, I can’t be sure because the cited source of the figure in the DCP2’s table doesn’t even mention trachoma! From what I’ve read, sometimes recurrences happen so 77% cure rate from trachoma is much much more plausible. I'm afraid Toby Ord <a href=\"https://www.givingwhatwecan.org/sites/givingwhatwecan.org/files/attachments/moral_imperative.pdf\">made the mistake</a> of implying that curing trachoma = preventing blindness.</p>\n<p>What is more, Toby Ord used the same DCP2 report that GiveWell used and GiveWell found <a href=\"http://blog.givewell.org/2011/09/29/errors-in-dcp2-cost-effectiveness-estimate-for-deworming/\">major errors</a> in it. To sum up very briefly:</p>\n<blockquote>\n<p>Eventually, we were able to obtain the spreadsheet that was used to generate the $3.41/DALY estimate. That spreadsheet contains five separate errors that, when corrected, shift the estimated cost effectiveness of deworming from $3.41 to $326.43.\n[...]\nThe estimates on deworming are the only DCP2 figures we’ve gotten enough information on to examine in-depth. </p>\n</blockquote>\n<p>Regarding Fred Hollows Foundation, please see <a href=\"http://www.givewell.org/international/charities/Fred-Hollows-Foundation\">GiveWell’s page</a> about them and <a href=\"http://blog.givewell.org/2008/07/21/preventing-blindness/\">this blog post</a>. In my eyes these discredit organization’s claim that it restores sight for $25. </p>\n<p>In conclusion, without further research we have no basis for the claim that trachoma surgeries can prevent 400, or even 40 cases of blindness for $40,000. We simply don't know. I wish we did, I want to help those people in the video.</p>\n<p>I think one thing that is happening is that we <a href=\"https://en.wikipedia.org/wiki/Selective_exposure_theory\">are too eager to believe any figures we find if they support an opinion we already hold</a>. That severely worsens already existing problem of <a href=\"http://lesswrong.com/lw/76k/the_optimizers_curse_and_how_to_beat_it/\">optimizer’s curse</a>.</p>\n<hr />\n<p>I also want to add that preventing 400 blindness cases for $40,000 (i.e. one case for $100) to me sounds much more effective than top GiveWell's charities. GiveWell seem to agree, see citations from <a href=\"http://www.givewell.org/international/technical/programs/cataract-surgery#ourCEA\">this page</a></p>\n<blockquote>\n<p>Based on very rough guesses at major inputs, we estimate that cataract programs may cost $112-$1,250 per severe visual impairment reversed\n[...]\nBased on prior experience with cost-effectiveness analyses, we expect our estimate of cost per severe visual impairment reversed to increase with further evaluation.\n[...]\nOur rough estimate of the cost-effectiveness of cataract surgery suggests that it may be competitive with our priority programs; however, we retain a high degree of uncertainty.</p>\n</blockquote>\n<p>We tell the trachoma example and then advertise GiveWell, showing that GiveWell’s top and standout charities are not even related to blindness and no one in EA ever talks about blindness. So people probably assume that GiveWell’s recommended charities are much more effective than surgery that cures blindness for $100 but they are not.</p>\n<p>Because GiveWell’s estimates for cataract surgeries are based on guesses, I think we shouldn’t use those figures in introductory EA talks as well. We can tell the disclaimers but the person who hears the example might skip them when retelling the thought experiment (out of desire to sound more convincing). And then the same will happen.</p>\n", "parentCommentId": "M6EeCaXFYPG46ZFRz", "user": {"username": "saulius"}}, {"_id": "Jcd9miHWHm7C22J3b", "postedAt": "2017-05-13T21:21:08.783Z", "postId": "SMRHnGXirRNpvB8LJ", "htmlBody": "<p>It's pretty much like you said in <a href=\"http://effective-altruism.com/ea/19w/we_are_often_giving_wrong_facts_about_trachoma/axf\">this</a> comment and I completely agree with you and am putting it here because of how well I think you've driven home the point:</p>\n<blockquote>\n<p>...I myself once mocked a co-worker for taking an effort to recycle when the same effort could do so much more impact for people in Africa. That's wrong in any case, but I was probably wrong in my reasoning too because of numbers.</p>\n</blockquote>\n<blockquote>\n<p>Also, I'm afraid that some doctor will stand up during an EA presentation and say</p>\n</blockquote>\n<blockquote>\n<blockquote>\n<p>You kids pretend to be visionaries, but in reality you don't have the slightest idea what you are talking about. Firstly, it's impossible to cure trachoma induced blindness. Secondly [...] You should go back to play in your sandboxes instead of preaching adults how to solve real world problems</p>\n</blockquote>\n</blockquote>\n<blockquote>\n<p>Also, I'm afraid that the doctor might be partially right</p>\n</blockquote>\n<p>Also, my experience has persistently been that the blindness vs trachoma example is quite off-putting in an &quot;now this person who might have gotten into EA is going to avoid it&quot; kind of way. So if we want more EAs, this example seems miserably inept at getting people into EA. I myself have stopped using the example in introductory EA talks altogether. I might be an outlier though and will start using it again if provided a good argument that it works well, but I suspect I'm not the only one that has seen better results introducing EAs by not bringing up this example at all. Now with all the uncertainty around it, it would seem that both emotions and numbers argue against the EA community using this example in introductory talks? Save it for the in-depth discussions that happen after an intro instead?</p>\n", "parentCommentId": "FmxdW66EmRMWgJwWb", "user": {"username": "Cornelius"}}, {"_id": "egfcfch46tCmWf22L", "postedAt": "2017-05-13T23:47:33.787Z", "postId": "SMRHnGXirRNpvB8LJ", "htmlBody": "<p>These are good points and I'm suitably chastened for not being sufficiently thorough in checking Toby Ord's claims,<br />I'm pleased to see that GiveWell is again investigating treating blindness: <a href=\"http://blog.givewell.org/2017/05/11/update-on-our-views-on-cataract-surgery/\">http://blog.givewell.org/2017/05/11/update-on-our-views-on-cataract-surgery/</a>. In this very recent post, they say:\n&quot;We believe there is evidence that cataract surgeries substantially improve vision. Very roughly, we estimate that the cost-effectiveness of cataract surgery is ~$1,000 per severe visual impairment reversed.[1]&quot;<br />The footnote reads:\n&quot;This estimate is on the higher end of the range we calculated, because it assumes additional costs due to demand generation activities, or identifying patients who would not otherwise have known about surgery. We use this figure because we expect that GiveWell is more likely to recommend an organization that can demonstrate, through its demand generation activities, that it is causing additional surgeries to happen. The $1,000 figure also reflects our sense that cost-effectiveness in general tends to worsen (become more expensive) as we spend more time building our model of any intervention. Finally, it is a round figure that communicates our uncertainty about this estimate overall.\nBut it's reasonable to say that until they complete this investigation, which will be years rather than months, it may be better to avoid using the example of preventing or curing blindness.&quot;\nSo the options seem to be either not using the example of blindness at all, or using this rough figure of $1000, with suitable disclaimers.  It still leads to 40 cases of severe visual impairment reversed v. 1 case of providing a blind person with a guide dog.</p>\n", "parentCommentId": "FmxdW66EmRMWgJwWb", "user": {"username": "PeterSinger"}}, {"_id": "d2cynysKyWAvLDo5v", "postedAt": "2017-05-13T23:53:35.285Z", "postId": "SMRHnGXirRNpvB8LJ", "htmlBody": "<p>Why is the choice not directly comparable?  If it were possible to offer a blind person a choice between being able to see, or having a guide dog, would it be so difficult for the blind person to choose? </p>\n<p>Still, if you can suggest better comparisons that make the same point, I'll be happy to use them.</p>\n", "parentCommentId": "LYoGLn4Q27hioN4mY", "user": {"username": "PeterSinger"}}, {"_id": "YM2LEQAkhfL7WhoHW", "postedAt": "2017-05-14T00:53:51.761Z", "postId": "SMRHnGXirRNpvB8LJ", "htmlBody": "<p>The objection about it being ableist to promote funding for trachoma surgeries rather than guide dogs doesn't have to do with how many QALYs we'd save from providing someone with a guide dog or a trachoma surgery. Roughly, this objection is about how much respect we're showing to disabled people. I'm not sure how many of the people who have said that this example is ableist are utilitarians, but we can actually make a good case that using the example causes negative consequences for the reason that it's ableist. (It's also possible that using the example as it's typically used causes negative consequences by affecting how intellectually rigorous EA is, but that's another topic). A few different points that might be used to support this argument would be:</p>\n<ul>\n<li>On average, people get a lot of value out of having self-esteem; often, having more self-esteem on the margins enables them to do value-producing things they wouldn't have done otherwise (flow-through effects!). Sometimes, it just makes them a bit happier (probably a much smaller effect in utilitarian terms).</li>\n<li>Roughly, raising or lowering the group-wise esteem of a group has an effect on the self-esteem of some of the group's members.</li>\n<li>Keeping from lowering a group's esteem isn't very costly, if doing so involves nothing more than using a different tone. (There are of course situations where making a certain claim will raise or lower a group's esteem a large amount if a certain tone is used, and a lesser amount if a different tone is used, even though the group's esteem is nevertheless changed in the same direction in either case).</li>\n<li>Decreases in a group's ability to do value-producing things or be happy because their esteem has been lowered by someone acting in an ablelist manner, do not cause others to experience a similarly sized boost to their ability to be happy or do value-producing things. (I.e. the truth value of claims that &quot;status games are zero sum&quot; has little effect on the extent to which it's true that decreasing a group's esteem by e.g. ableist remarks has negative utilitarian consequences).</li>\n</ul>\n<p>I've generally found it hard to make this sort of observation publicly in EA-inhabited spaces, since I typically get interpreted as primarily trying to say something political, rather than primarily trying to point out that certain actions have certain consequences. It's legitimately hard to figure out what the ideal utilitarian combination of tone and example would be for this case, but it's possible to iterate towards better combinations of the two as you have time to try different things according to your own best judgement, or just ask a critic what the most hurtful parts of an example are.</p>\n", "parentCommentId": "XNZX7gLAE6yNjgr5P", "user": {"username": "Fluttershy"}}, {"_id": "AWGdTczx6RW6Nrtge", "postedAt": "2017-05-14T01:26:15.387Z", "postId": "SMRHnGXirRNpvB8LJ", "htmlBody": "<p>I strongly agree with both of the comments you've written in this thread so far, but the last paragraph here seems especially important. Regarding this bit, though:</p>\n<blockquote>\n<p>I might be a bit of an outlier</p>\n</blockquote>\n<p>This factor may push in the opposite way than you'd think, given the context. Specifically, if people who might have gotten into EA in the past ended up avoiding it because they were exposed to this example, then you'd expect the example to be more popular than it would be if everyone who once stood a reasonable chance of becoming an EA (or even a hardcore EA) had stuck around to give you their opinion on whether you should use that example. So, keep doing what you're doing! I like your approach.</p>\n", "parentCommentId": "Jcd9miHWHm7C22J3b", "user": {"username": "Fluttershy"}}, {"_id": "kJBggbM2HxdAymydf", "postedAt": "2017-05-14T10:57:35.563Z", "postId": "SMRHnGXirRNpvB8LJ", "htmlBody": "<p>agree :)</p>\n", "parentCommentId": "egfcfch46tCmWf22L", "user": {"username": "saulius"}}, {"_id": "W8qa334ZSN48c2bEP", "postedAt": "2017-05-15T00:17:09.163Z", "postId": "SMRHnGXirRNpvB8LJ", "htmlBody": "<p>A reading I found laid things out clearly: <a href=\"http://www.rationalreflection.net/utilitarians-and-disability-activists-what-are-the-genuine-disagreements/\">Utilitarians and disability activists: what are the genuine disagreements?</a></p>\n", "parentCommentId": "iz3zwsdNQzAondo5Y", "user": {"username": "Julia_Wise"}}, {"_id": "piMvaApCD8ekNBTR5", "postedAt": "2017-05-15T04:13:51.866Z", "postId": "SMRHnGXirRNpvB8LJ", "htmlBody": "<p>Hi Peter,</p>\n<p>Some examples that might be useful:</p>\n<p>1) Differences in income</p>\n<p>A US college graduate earns about 100x more than GiveDirectly recipients, suggesting money can go far further with GiveDirectly. (100x further if utility ~log-income.)\n<a href=\"https://80000hours.org/career-guide/anyone-make-a-difference/\">https://80000hours.org/career-guide/anyone-make-a-difference/</a></p>\n<p>2) The cost to save a life</p>\n<p>GiveWell now says $7500 for a death prevented by malaria nets (plus many other benefits)\nRich country governments, however, are often willing to pay over $1m to save a life of one of their citizens, a factor of 130+ difference.\n<a href=\"https://80000hours.org/career-guide/world-problems/#global-health-a-problem-where-you-could-really-make-progress\">https://80000hours.org/career-guide/world-problems/#global-health-a-problem-where-you-could-really-make-progress</a></p>\n<p>3) Cost per QALY</p>\n<p>It still seems possible to save QALYs for a few hundred dollars in the developing world, whereas the UK's NHS is willing to fund most things that save a QALY for under £20,000, and some that are over £30,000, which is again a factor of 100 difference.</p>\n<p>So I still think a factor of 100x difference is defensible, though if you also take into account Brian's point below, then it might be reduced to, say, a factor of 30, though that's basically just a guess, and it could go the other way too.\nMore on this:\n<a href=\"http://reflectivedisequilibrium.blogspot.com/2014/01/what-portion-of-boost-to-global-gdp.html\">http://reflectivedisequilibrium.blogspot.com/2014/01/what-portion-of-boost-to-global-gdp.html</a></p>\n", "parentCommentId": "d2cynysKyWAvLDo5v", "user": {"username": "Benjamin_Todd"}}, {"_id": "YHpJeo4fiGDpHp2AS", "postedAt": "2017-05-15T14:31:36.447Z", "postId": "SMRHnGXirRNpvB8LJ", "htmlBody": "<p>Thanks for researching and writing this up! We've been discussing the topic a lot at CEA/Giving What We Can over the last few days. I think this points to the importance of flagging publication dates (as GiveWell does, indicating that the research on a certain page was current as of a given date but isn't necessarily accurate anymore). Fact-checking, updating, or just information flagging as older and possibly inaccurate was on our to-do list for materials on the Giving What We Can site, which go back as much as 10 years and sometimes no longer represent our best understanding. I now think it needs to be higher priority than I did.</p>\n<p>For individuals rather than organizations, I'm unsure about the best way to handle things like this, which will surely come up again. If someone publishes a paper or blog post, how often are they obliged to update it with corrected figures? I'm thinking of  a popular <a href=\"https://80000hours.org/2012/06/dead-children-currency-51/\">post</a> which used PSI's figure of around $800 to save a child's life. In 2010 when it was written that seemed like a reasonable estimate, but it doesn't now. Is the author responsible for updating the figure everywhere the post was published and re-published? (That's a strong disincentive for ever writing anything that includes a cost-effectiveness estimate, since they're always changing.) Does everyone who quoted it or referred to it need to go back each year and include a new estimate? My guess is it's good practice, particularly when we notice people creating new material that cites old figures, to give them a friendly note with a link to newer sources, with the understanding that this stuff is genuinely confusing and hard to stay on top of.</p>\n", "parentCommentId": null, "user": {"username": "Julia_Wise"}}, {"_id": "WrMmdG2Hrzgwhgpen", "postedAt": "2017-05-15T15:15:16.078Z", "postId": "SMRHnGXirRNpvB8LJ", "htmlBody": "<p>It's obviously impossible to enforce everyone to update figures all the time. If there is an old publication date, everyone probably understands that it could be outdated. I just think that the date should be always featured prominently. E.g. in <a href=\"https://www.givingwhatwecan.org/research/other-causes/hivaids/\">this page</a> it could be better. I think that flagging pages the way GiveWell does is a great idea. But featured pages that have no date should probably be checked or updated quite often. I mean pages like &quot;top charities&quot;, &quot;what we can achieve&quot; and &quot;myths about aid&quot; in GWWC's case. </p>\n", "parentCommentId": "YHpJeo4fiGDpHp2AS", "user": {"username": "saulius"}}, {"_id": "JDLFi6d4ngTXmAfaM", "postedAt": "2017-05-15T21:03:15.870Z", "postId": "SMRHnGXirRNpvB8LJ", "htmlBody": "<p>The mention of the specific errors found in DCP2 estimates of de-worming efficacy, seem to be functioning here as guilt by association. I can't see any reason they should be extrapolated to all other calculations in different chapters of  a &gt;1000 page document. The figure from DCP2 for trachoma treatment directly references the primary source, so it's highly unlikely to be vulnerable to any spreadsheet errors.</p>\n<p>The table Toby cites and you reference here (Table 50.1 from DCP2) says &quot;trichiasis surgery&quot;. This means surgical treatment for a late stage of trachoma.  Trichiasis is not synonymous with trachoma, but a late and severe complication of trachoma infection, by which stage eyelashes are causing corneal friction. It doesn't 'sometimes' lead to blindness, though that is true of trachoma infections when the whole spectrum is considered. Trichiasis frequently causes corneal damage leading to visual impairment and blindness. You are right to point out that not every person with trichiasis will develop blindness, and a &quot;Number Needed to Treat&quot; is needed to correct the estimate from $20 per case of blindness prevented. However we don't have good epidemiological data to say whether that number is 1, 2, 10 or more. Looking at the literature it's likely to be closer to 2 than 10. The uncertainty factor encoded in Peter Singer's use of $100 per person would allow for a number needed to treat of 5. </p>\n<p>In this case the term &quot;cure&quot; is appropriate - as trichiasis is the condition being treated by surgery. At one point Toby's essay talks about curing blindness as well as curing trachoma. Strictly speaking trichiasis surgery is tertiary prevention (treatment of a condition which has already caused damage to prevent further damage.), but the error is not so egregious as to elicit the scorn of the hypothetical doctor you quote below. (Source: I am a medical doctor specialising in infectious diseases, I think the WHO fact sheet you link to is overly simplifying matters when it states &quot;blindness caused by trachoma is irreversible&quot;).</p>\n<p>[Edited to add DOI: I'm married to Toby Ord]</p>\n", "parentCommentId": "FmxdW66EmRMWgJwWb", "user": {"username": "Bernadette_Young"}}, {"_id": "8K6Qypmd7MYsmovuZ", "postedAt": "2017-05-15T23:58:21.060Z", "postId": "SMRHnGXirRNpvB8LJ", "htmlBody": "<p>Thank you very much for writing this. Ironically, I did not do enough fact-checking before making public claims. Now I am not even sure I was right to say that everyone should frequently check facts in this manner because it takes a lot of time and it's easy to make mistakes, especially when it's not the field of expertise for most of us.</p>\n<p>Trichiasis surgery then does seem to be absurdly effective in preventing blindness and pain. I am puzzled why GiveWell hasn't looked into it more. Well, they explain it <a href=\"http://blog.givewell.org/2017/05/11/update-on-our-views-on-cataract-surgery/\">here</a>. The same uncertainty about &quot;Number Needed to Treat&quot;.</p>\n<p>I want to ask if you don't mind:</p>\n<ul>\n<li>When literature says that surgery costs ~$20-60 or $7.14, is that for both eyes?</li>\n<li>Do you think that it's fair to say that it costs say $100 to prevent trachoma-induced blindness? Or is there too much uncertainty to use such number when introducing EA?</li>\n</ul>\n", "parentCommentId": "JDLFi6d4ngTXmAfaM", "user": {"username": "saulius"}}, {"_id": "kknGKP3cRiAYCZy4z", "postedAt": "2017-05-16T09:22:18.959Z", "postId": "SMRHnGXirRNpvB8LJ", "htmlBody": "<p>Thanks for responding!</p>\n<p>I think it's laudable to investigate the basis for claims as you've done. It's fair to say evidence appraisal and communication really is a specialist area in its own right, and outside our ares of expertise it's common to make errors in doing so. And while we all like evidence confirms what we think, other biases may be at play. I think some people in effective altruism also put a high value on identifying and admitting mistakes, so we might also be quick to jump on a contrary assessment even if it has some errors of its own. </p>\n<p>I think your broader point about communicating the areas and extent of uncertainty is important, but the solution to how we do that when communicating in different domains is not simple. For example, you can look at how NICE investigates the efficacy of clinical interventions. They have to distill 1000's of pages of evidence into a decision, and even the 'summary' of that can be 100s of pages long. At the front of that will be an 'executive summary' which can't possibly capture all the ares of uncertainty and imperfect evidence, but usually represents their best assessment because ultimately they have to make concrete recommendations. </p>\n<p>Another approach is that seen in the Cochrane Systematic Reviews. These take a very careful approach to criticising the methodology of all studies included in their analysis. A running joke though its that every Cochrane review reaches the same conclusion: &quot;More Evidence is Needed&quot;. This is precise and careful, but often lacks any practical conclusion. </p>\n<p>Re your 2 questions:</p>\n<p>It's $7.14 for 1 eye (in 2001) with 77% success, according to this source:\n<a href=\"https://www.ncbi.nlm.nih.gov/pubmed/11471088\">https://www.ncbi.nlm.nih.gov/pubmed/11471088</a>\nIn Toby Ord's essay he uses this to derive the &quot;less than $20 per person&quot; figure (7.14 *2 /(0.77) = $18.5 )\n<a href=\"https://www.givingwhatwecan.org/sites/givingwhatwecan.org/files/attachments/moral_imperative.pdf\">https://www.givingwhatwecan.org/sites/givingwhatwecan.org/files/attachments/moral_imperative.pdf</a>\nSo that's both eyes (in 2001 terms). </p>\n<p>My main area of uncertainty on that figure is around number needed to treat. I've spoken to a colleague who is an ophthalmologist and has treated trichiasis in Ghana. Her response was &quot;trachoma with trichiasis always causes blindness&quot;. But in the absence of solid epidemiology to back it up, I think it's wise to allow for NNT being higher than 1. I would be comfortable with saying that for about $100 we can prevent trachoma-induced blindness, in order to contrast that with things that we consider a reasonable buy in other contexts. (I haven't assessed any orgs to know if there are orgs who do it for that little: they may for instance do surgeries on a wider range of conditions with varying DALYs gained per dollar spent).  </p>\n", "parentCommentId": "8K6Qypmd7MYsmovuZ", "user": {"username": "Bernadette_Young"}}, {"_id": "7jQ9XJHzRhgBCSm6E", "postedAt": "2017-05-17T14:26:43.711Z", "postId": "SMRHnGXirRNpvB8LJ", "htmlBody": "<p>Here’s what I usually found most unfortunate about the comparison, but I don’t mean to compete with anyone who thinks that the math is more unfortunate or anything else.</p>\n<ol>\n<li>The decision to sacrifice the well-being of one person for that of others (even many others) should be hard. If we want to be trusted (and the whole point of GiveWell is that people don’t have the time to double-check all research no matter how accessible it is – plus, even just following a link to GiveWell after watching a TED Talk requires that someone trusts us with their time), we need to signal clearly that we don’t make such decisions lightly. It is honest signaling too, since the whole point of EA is to put a whole lot more effort into the decision than usual. Many people I talk to are so “conscientious” about such decisions that they shy away from them completely (implicitly making very bad decisions). It’s probably impossible to show just how much effort and diligence has gone into such a difficult decision in just a short talk, so I rather focus on cases where I am, or each listener is, the one at whose detriment we make the prioritization decision, just like in the Child in the Pond case. Few people would no-platform me because they think it’s evil of me to ruin my own suit.</li>\n<li>Sacrificing oneself, or rather some trivial luxury of oneself, also avoids the common objection why a discriminated against minority should have to pay when there are [insert all the commonly cited bad things like tax cuts for the most wealthy, military spending, inefficient health system, etc.]. It streamlines the communication a lot more.</li>\n<li>The group at whose detriment we need to decide should never be a known, discriminated against minority in such examples, because these people are used to being discriminated against and their allies are used to seeing them being discriminated against, so when someone seems to be saying that they shouldn’t receive some form of assistance, they have just a huge prior for assuming that it’s just another discriminatory attack. I think their heuristic more or less fails in this case, but that is not to say that it’s not a very valid heuristic. I’ve been abroad in a country where pedestrian crosswalks are generally ignored by car drivers. I’m not going to just blinding walk onto the street there even if the driver of the only car coming toward me is actually one who would’ve stopped for me if I did. My heuristic fails in that case, but it generally keeps me safe.</li>\n<li>Discriminated minority groups are super few, especially the ones the audience will be aware of. Some people may be able to come up with a dozen or so, some with several dozens. But in my actual prioritization decisions for the Your Siblings charity, I had to decide between groups of so fuzzy reference classes that there must be basically arbitrarily many of such groups. Street children vs. people at risk of malaria vs. farmed animals? Or street children in Kampala vs. people at risk of malaria in the southern DRC vs. chickens farmed for eggs in Spain? Or street children of the lost generation in the suburb’s of Kampala who were abducted for child sacrifice but freed by the police and delivered to the orphanage we’re cooperating with vs. …. You get the idea. If we’re unbiased, then what are the odds that we’ll draw a discriminated against group from the countless potential examples in this urn? This should heavily update a listener toward thinking that there’s some bias against the minority group at work here. Surely, the real explanation is something about salience on our minds or ease of communication and not about discrimination, but they’d have to know us very well to have so much trust in our intentions.</li>\n<li>People with disability probably have distance “bias” at the same rates as anyone else, so they’ll perceive the blind person with the guide dog as in-group, the blind people suffering from cataracts in developing countries as completely neutral foreign group, and us as attacking them, making us the out-group. Such controversy is completely avoidable and highly dangerous, as Owen Cotton-Barratt describes in more detail in his <a href=\"http://globalprioritiesproject.org/wp-content/uploads/2015/05/MovementGrowth.pdf\">paper on movement growth</a>. Controversy breeds an opposition (and one that is not willing to engage in moral trade with us) that destroys option value particularly by depriving us of the highly promising option to draw on the democratic process to push for the most uncontroversial implications of effective altruism that we can find. Scott Alexander has written about it under the title “Toxoplasma of Rage.” I don’t think publicity is worth sacrificing the political power of EA for it, but that is just a great simplification of Owen Cotton-Barratt’s differentiated points on the topic.</li>\n<li>Communication is by necessity cooperative. If we say something, however true it may be, and important members of the audience understand it as something false or something else entirely (that may not have propositional nature), then we failed to communicate. When this happens, we can’t just stamp our collective foot on the ground and be like, “But it’s true! Look at the numbers!” or “It’s your fault you didn’t understand me because you don’t know where I’m coming from!” That’s not the point of communication. We need to adapt our messaging or make sure that people at least don’t misunderstand us in dangerous ways.</li>\n</ol>\n<p>(I feel like you may disagree on some of these points for similar reasons that <em>The Point of View of the Universe</em> seemed to me to argue for a non-naturalist type of moral realism while I “only” try to assume some form of non-cognitivist moral antirealism, maybe emotivism, which seems more parsimonious to me. Maybe you feel like or have good reasons to think that there is a true language (albeit in a non-naturalist sense) so that it makes sense to say “Yes, you misunderstood me, but what I said is true, because …,” while I’m unsure. I might say, “Yes, you misunderstood me, but what I meant was something you’d probably agree with. Let me try again.”)</p>\n", "parentCommentId": "XNZX7gLAE6yNjgr5P", "user": {"username": "Telofy"}}, {"_id": "o5rrgBRq7xmH7xndm", "postedAt": "2017-06-06T22:10:58.608Z", "postId": "SMRHnGXirRNpvB8LJ", "htmlBody": "<p>Peter, even if a trachoma operation cost the same as training a guide dog, and didn't always prevent blindness, it would still be an excellent cost comparison because vision correction is vastly superior to having a dog.</p>\n", "parentCommentId": "XNZX7gLAE6yNjgr5P", "user": {"username": "Austen_Forrester"}}, {"_id": "A5D2Dt9vXCWR47Bf7", "postedAt": "2017-06-06T23:08:45.258Z", "postId": "SMRHnGXirRNpvB8LJ", "htmlBody": "<p>Blind people are not a discriminated group, at least not in the first world. The extreme poor, on the other hand, often face severe discrimination -- they are mistreated and have their rights violated by those with power, especially if they are Indians of low caste.</p>\n<p>Comparative intervention effectiveness is a pillar of EA, distinct from personal sacrifice, so they are not interchangeable. I reject that there is some sort of prejudice for choosing to help one group over another, whether the groups are defined by physical condition, location, etc. One always has to choose. No one can help every group. Taking the example of preventing blindness vs assisting the blind, clearly the former is the wildly superior intervention for blindness so it is absurd to call it prejudiced against the blind.</p>\n", "parentCommentId": "7jQ9XJHzRhgBCSm6E", "user": {"username": "Austen_Forrester"}}, {"_id": "zqFdNHopdrDcpoBZN", "postedAt": "2017-06-08T11:14:49.899Z", "postId": "SMRHnGXirRNpvB8LJ", "htmlBody": "<p>Thanks! In response to which point is that? I think points 5 and 6 should answer your objection, but tell me if they don’t. Truth is not at issue here (if we ignore the parenthetical at the very end that isn’t mean to be part of my argument). I’d even say that Peter Singer deals in concepts of unusual importance and predictive power. But I think it’s important to make sure that we’re not being misunderstood in dangerous ways by valuable potential allies.</p>\n", "parentCommentId": "A5D2Dt9vXCWR47Bf7", "user": {"username": "Telofy"}}, {"_id": "NEDJtfgDK8mFuvMCs", "postedAt": "2018-08-20T12:58:04.561Z", "postId": "SMRHnGXirRNpvB8LJ", "htmlBody": "<p>It looks like GiveWell put that project on hold in January 2018: <a href=\"https://www.givewell.org/charities/IDinsight/partnership-with-idinsight/cataract-surgery-project\">https://www.givewell.org/charities/IDinsight/partnership-with-idinsight/cataract-surgery-project</a></p>\n", "parentCommentId": "egfcfch46tCmWf22L", "user": {"username": "Jeff_Kaufman"}}, {"_id": "GCYEifZsWkmYsHjkT", "postedAt": "2018-11-19T16:08:18.364Z", "postId": "SMRHnGXirRNpvB8LJ", "htmlBody": "<p>And moreover it doesn&#x27;t just improve vision, it removes a source of intense pain.</p>", "parentCommentId": "o5rrgBRq7xmH7xndm", "user": {"username": "drbrake"}}, {"_id": "aNAoXcMk4eLMmsqPi", "postedAt": "2020-11-29T00:24:02.252Z", "postId": "SMRHnGXirRNpvB8LJ", "htmlBody": "<p>I hate to admit it, but I think there does exist a utilitarian trade-off between marketability and accuracy. Although I'm thrilled that the EA movement prides itself on being as factually accurate as possible and I believe the core EA movement <u>absolutely</u> needs to stick with that, there is a case to be made that an exaggerated truth may be an important teaching tool in helping non-EAs understand why EAs do what they do.</p><p>It seems likely that Peter Singer's example has &nbsp;had a net-positive impact, despite the inaccuracies. Even I was originally drawn to EA by this example, among a few of his others. I've since been donating at least 10% and been active in EA projects. I'm sure I'm not the only one.</p><p>We just have to be careful that the integrity of the EA movement isn't compromised due to inaccurate examples like this. But I think anyone who goes far enough with EA to learn that this example is inaccurate, or even cares to do so, will most likely already have converted into an EA mindset, which is Mr. Singer's end-goal.</p>", "parentCommentId": "6tgFqN9oseWWY4mGf", "user": {"username": "dlipsitz@gmail.com"}}, {"_id": "8ocDyPRGFCL9Mkycm", "postedAt": "2021-05-19T23:13:28.074Z", "postId": "SMRHnGXirRNpvB8LJ", "htmlBody": "<p>I like these examples but they do have some limitations.</p>\n<p>I'm still searching for some better examples that are empirically robust as well as intuitively powerful.</p>\n<p>(I'm looking for the strongest references to give to my claim <a href=\"https://daaronr.github.io/ea_giving_barriers/present-puzzle.html\">here</a> that \"there  is a strong case that most donations go to charities that improve well-being far less per-dollar than others.\"  (of course I'm willing to admit there's some possibility that we don't have strong evidence for this)</p>\n<p><em>1) Differences in income:</em> This will not be terribly convincing to anyone who doesn't already accept the idea of vastly diminishing marginal utility, and there is the standard (inadequate but hard to easily rebut) objection that \"things are  much cheaper in developing countries\".</p>\n<p><em>2) The cost to save a life:</em>  Yes, rich country governments factor this into their calculations, but is this indeed the calculation that is relevant when considering \"typical charities operating in rich countries?\" It also does not identify a particular intervention that is \"much less efficient\".</p>\n<p><em>3) Cost per QALY/ UK NHS:</em> Similar limitations as in case 2.</p>\n<p>What is the strongest statistic or comparison  for making this point? Perhaps Sanjay Joshi of SoGive has some suggestions?</p>\n<p>Perhaps  making a comparison based on the tables near the end of <a href=\"https://researchonline.lshtm.ac.uk/id/eprint/13092/1/Disease%20Control%20Priorities%20in_GOLD%20VoR.pdf\">Jamison, D. T. et al  (2006). Disease control priorities in developing countries</a>?  2006 was a long time ago, however.</p>\n", "parentCommentId": "piMvaApCD8ekNBTR5", "user": {"username": "david_reinstein"}}]