[{"_id": "9nNxwPRbngePk4F6Q", "postedAt": "2024-01-31T05:49:19.698Z", "postId": "SnGqab3noXLmJzQCs", "htmlBody": "<p>Thank you so much for this!</p>\n", "parentCommentId": null, "user": {"username": "ChanaMessinger"}}, {"_id": "NMr7jXZAWmd65t3Km", "postedAt": "2024-01-31T14:13:56.327Z", "postId": "SnGqab3noXLmJzQCs", "htmlBody": "<p>I'm french so I have nothing to say directly about your question, but I would like to emphasize that most types of eggs are almost certainly way worse than beef and pig when considering animal suffering.<br>Using <a href=\"https://osf.io/akz4r\">Faunalytics estimates</a>, eating these different dishes creates this quantity of suffering :&nbsp;<br>&nbsp;</p><ul><li>chicken : 0,1 animal live et 5,2 days in farm</li><li>pork : 0,002 animal life and 0,33 days in farm</li><li>beef : 0,0004 animal life and 0,33 days in farm</li><li>egg (omelette) : 0,01 animal life and 4,9 days in farm<strong>&nbsp;</strong></li></ul><p>And it doesn't account for the relative badness of being a broiler vs a laying hen vs a pig vs a beef.&nbsp;<br><br><a href=\"https://welfarefootprint.org/research-projects/laying-hens/\">Also, the Welfare Footprint project estimates that cage-free hens live better lifes than caged hens, but still painful lifes.</a><br><br>&nbsp;</p>", "parentCommentId": null, "user": {"username": "Keyvan Mostafavi"}}, {"_id": "b2FKihSzvnyj52mmw", "postedAt": "2024-01-31T14:45:00.031Z", "postId": "SnGqab3noXLmJzQCs", "htmlBody": "<p>This is really helpful, thank you!</p>", "parentCommentId": null, "user": {"username": "jpaddison"}}, {"_id": "8tRz6bhTgof8jRFvL", "postedAt": "2024-01-31T20:13:17.752Z", "postId": "SnGqab3noXLmJzQCs", "htmlBody": "<p><strong>Executive summary</strong>: The author researches egg brands available in the San Francisco Bay Area that treat chickens more humanely based on criteria such as no beak trimming, outdoor access, and small flock sizes. The author recommends Fifth Crow Farm, Alexandre Kids, Burroughs Family Farms, Stueve Organic, and St. John Family Farms as more humane options.</p><p><strong>Key points</strong>:</p><ol><li>The author evaluates egg brands based on criteria drawn from the Animal Welfare Approved certification standards, including no physical mutilation of chickens, no forced molting, outdoor access and foraging, early outdoor access for young chickens, adequate indoor space, and small flock sizes.</li><li>Recommended humane egg brands available in the Bay Area are Fifth Crow Farm (most recommended but limited availability), Alexandre Kids (most widely available), Burroughs Family Farms, Stueve Organic, and St. John Family Farms.</li><li>Dis-recommended brands that market themselves as humane but likely involve high chicken suffering include Vital Farms, Happy Egg, Judy's Family Farm, Uncle Eddie's Wild Hens, Rock Island, Petaluma Farms, and Organic Valley.</li><li>The author draws information about different farms' practices from third-party certifications like Animal Welfare Approved and the Cornucopia Institute's egg scorecards.</li><li>If not based in the Bay Area, the author recommends using Cornucopia's egg scorecard tool or Animal Welfare Approved's store locator to find humane eggs.</li></ol><p>&nbsp;</p><p>&nbsp;</p><p><i>This comment was auto-generated by the EA Forum Team. Feel free to point out issues with this summary by replying to the comment, and</i><a href=\"https://forum.effectivealtruism.org/contact\"><i>&nbsp;<u>contact us</u></i></a><i> if you have feedback.</i></p>", "parentCommentId": null, "user": {"username": "SummaryBot"}}, {"_id": "BskRRmrQczpq9c93g", "postedAt": "2024-01-31T20:51:14.921Z", "postId": "SnGqab3noXLmJzQCs", "htmlBody": "<p>Thanks so much for this post - I'm going to adjust my buying habits from now on!&nbsp;</p><p>My impression is that e.g. Vital Farms is still substantially better than conventional egg brands, and if I need to buy eggs in a store that doesn't offer these improved options it still probably cuts suffering per egg in half or more relative to a cheaper alternative. Does that seem right to you?</p>", "parentCommentId": null, "user": {"username": "RavenclawPrefect"}}, {"_id": "bAhzDkS3NmDHh6raw", "postedAt": "2024-01-31T20:57:48.455Z", "postId": "SnGqab3noXLmJzQCs", "htmlBody": "<p><br>Thank you for looking into this!</p><p>Did you happen to find out if any egg producers did in ovo sexing, or if they were close to adopting it? If Fifth Crown Farm raised all their own hens from hatchlings, what do they do with the male chicks? I‘m a lot less opposed to macerators than the typical person (who is opposed to them), but traditional chick culling alone is enough to dissuade me from egg consumption, independent of direct effects on hens. When I’d last looked into it for the S Bay I couldn’t find any place that did it (and all the producers using it were from outside the US).</p><p>On a related note, did you happen to turn up anything on what the hens were fed? I vaguely remember seeing something about fancier places feeding their hens grubs or insect meal, which is a whole separate can of worms.</p><p>More broadly, does anyone know of any chick suppliers who perform in ovo sexing? I’ve been tempted to raise some egg-laying hens as pets with more tightly regulated welfare standards, but have been limited by space and time constraints (Bay Area, amirite). Would be nice to reintroduce eggs into my diet after a decade+ without! When I was a lad I ate one, sometimes two dozen eggs every evening to help me bulk, but now that I’m grown I’ve abstained from all but the most incidental egg consumption.</p>", "parentCommentId": null, "user": {"username": "nikvetr"}}, {"_id": "3uKcs7hfn8HnJtSsC", "postedAt": "2024-01-31T22:16:12.214Z", "postId": "SnGqab3noXLmJzQCs", "htmlBody": "<p>This is very valuable to me! Thank you!</p>\n", "parentCommentId": null, "user": {"username": "Erica_Edelman"}}, {"_id": "AqbRBndnFZtA3uEJ2", "postedAt": "2024-02-01T01:06:28.019Z", "postId": "SnGqab3noXLmJzQCs", "htmlBody": "<p>Ya, I'd be concerned about keel bone fractures in egg-laying hens, which generally seem pretty bad, and seem more common in (indoor) cage-free systems than cage ones. Welfare Footprint Project assumed multiple fracture events per hen who has any fracture across (mostly indoor, high production) systems they analyzed.&nbsp;</p><p>Rufener and Makagon (<a href=\"https://doi.org/10.1093/jas/skaa145\">2020</a>) looked at prevalences across (mostly indoor?) systems:</p><figure class=\"image image_resized\" style=\"width:77.25%\"><img src=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/AqbRBndnFZtA3uEJ2/lxo1ugbc3txwczecinvt\" alt=\"Keel bone fracture prevalence (%) in hens older than 49 wk of age across housing system types used during lay. Colors indicate the assessment method used. Boxplots show medians and interquartile and absolute ranges of raw data plus outliers. The cross and numbers indicate mean prevalence. n indicates the number of entries within one category.\"></figure><figure class=\"image image_resized\" style=\"width:77.25%\"><img src=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/AqbRBndnFZtA3uEJ2/v3k7xwmn4dbewgry6qop\" alt=\"Keel bone fracture prevalence (%) in hens older than 49 wk of age across adult housing system types depending on primary purpose of the facilities (commercial vs. experimental). Boxplots show medians and interquartile and absolute ranges of raw data plus outliers. The cross and numbers indicate mean prevalence. n indicates the number of entries within one category.\"></figure><p>I'd guess fracture rates are lower for hens with lower egg production per hen, all else equal.</p>", "parentCommentId": "NMr7jXZAWmd65t3Km", "user": {"username": "MichaelStJules"}}, {"_id": "Sv7EmJGxKknLKmfQ2", "postedAt": "2024-02-01T23:21:52.026Z", "postId": "SnGqab3noXLmJzQCs", "htmlBody": "<p>I totally agree that the average cage-free hen lives a very painful life; I'm trying to figure out if there are <i>any</i> farms that I can buy from where this isn't true. My best guess is that the chickens in some smaller family farms aren't in a lot of pain -- Fifth Crow Farm, which I mention above, raises heritage breed chickens in small flocks and keeps them outside except to lay and sleep. I also currently believe that the other brands I recommend have significantly lower-suffering chickens than the average cage-free organic farm chicken.</p><p>I do think that my analysis doesn't take into account all of the things I'd like to, including whether the farm uses heritage breeds (with healthier genetics / less prone to chronic pain), whether the male chicks are killed (I'm pretty sure they always are) and if so how quickly and humanely are they killed, how well the farm cares for the health of its hens in general (I couldn't find any data on this in the evaluation tools I used, and I don't have the expertise to evaluate it myself), and what happens to the hens after they're too old to lay (some of these farms let their hens live out their natural lifespan on the farm; in others the spent hens are \"sold live\" and I don't know what happens to them next).<br>&nbsp;</p><p>Based on this comment, I'll add these limitations to the \"is this enough\" section of the post.<br>&nbsp;</p>", "parentCommentId": "NMr7jXZAWmd65t3Km", "user": {"username": "Samira"}}, {"_id": "rka9koHgG4WwAjegR", "postedAt": "2024-02-01T23:25:16.094Z", "postId": "SnGqab3noXLmJzQCs", "htmlBody": "<p>Yeah, keel bone fractures -- and bone issues in general -- is something I'd love to get more data on. I couldn't find any publicly-available information about this for most of the farms I evaluated, but I know that Fifth Crow Farm uses heritage breeds and specifically calls out that they have healthier genetics because they lay fewer eggs (which means less calcium is spent on eggshells compared to bone growth).&nbsp;</p><p>I couldn't find any information on whether other farms use heritage breeds, and I don't know how much you can minimize the risk of fractures in other ways (providing calcium supplementation, not using e.g. forced-molting to induce extra laying cycles, giving hens plenty of outdoor space so they don't injure themselves in stress). Have you heard anything about ways to mitigate fracture risk?</p>", "parentCommentId": "AqbRBndnFZtA3uEJ2", "user": {"username": "Samira"}}, {"_id": "L3M3wXDiFqNydYqhQ", "postedAt": "2024-02-01T23:33:17.514Z", "postId": "SnGqab3noXLmJzQCs", "htmlBody": "<p>Unfortunately, I think that there are no US farms yet that use in-ovo sexing (though I'd love to hear about it if I'm wrong about that!) I know it's been implemented in Germany and I think is being adopted more widely in Europe, but I don't think the US has followed suit yet. Even the Animal Welfare Approved certification doesn't have any requirements about what do with male chicks, it simply states that they can be \"removed\" from the AWA system (meaning, I think, transferred off-farm and then no certification-related requirements apply to them anymore, so they're probably just macerated as usual. :( )<br><br>Re: hen feed and insects, I think that the \"natural forage\" that these farms refers to means that chickens forage for bugs in the ground. I'm not sure to what extent these are wild insects vs grubs raised for chicken feed, but either way, if you're worried about insect suffering, it seems possible that pasture-raised foraging chickens contribute more to that than a corn-fed chicken would (though given the pesticides used to grow the corn, I'm not actually sure).</p>", "parentCommentId": "bAhzDkS3NmDHh6raw", "user": {"username": "Samira"}}, {"_id": "Lt6v8sYGr2AqsL6eR", "postedAt": "2024-02-02T00:11:50.104Z", "postId": "SnGqab3noXLmJzQCs", "htmlBody": "<p>I do expect Vital Farms to be a lot better than an average cheap egg brand with no certifications. I'm not sure how they compare to the average brand that's Certified Humane and USDA Certified Organic (a combination that requires outdoor access*, no debeaking, and no forced-molting), but my guess would be that they're better than that too. Most of my uncertainty comes from lack of knowledge of chicken psychology (is being outdoors but in a large flock of 20k birds a lot less stressful than being indoors in a large dense flock, or about the same? Does beak trimming cause chronic pain or frustration as the hens can't forage as well?)</p><p>One specific consideration with Vital Farms is that their practices vary by farm: they're a collective of small farms nationwide, and it seems that they have different subgroups of farms that adhere to different standards. Here are the Cornucopia institute's egg scorecards for both their standard and \"regenerative organic\" lines: <a href=\"https://www.cornucopia.org/scorecard/eggs/vital-farms-organic/\">standard</a>, <a href=\"https://www.cornucopia.org/scorecard/eggs/vital-farms-restorative-organic-eggs/\">regenerative organic</a>. Based on Cornucopia, I think both lines still look pretty good, even compared to other organic farms.</p><p>*asterisk on \"outdoor access\" since apparently USDA Organic counts caged-in porches as outdoor access, which seems bad to me</p>", "parentCommentId": "BskRRmrQczpq9c93g", "user": {"username": "Samira"}}, {"_id": "cAtvHaut92wwcvEv5", "postedAt": "2024-02-05T22:12:34.458Z", "postId": "SnGqab3noXLmJzQCs", "htmlBody": "<p>I think that my message was poorly written. I'm really not a specialist on this question so I don't know if there exists an egg brand that doesn't produce net suffering.&nbsp;<br>I just wanted to say that the beginning of your post (<i>\"I'm not a vegan, but I've long felt troubled by the fact that eggs have such a high suffering-to-calorie ratio — <strong>higher, by some calculations, than beef</strong>\") </i>seemed inaccurate.&nbsp;</p>", "parentCommentId": "rka9koHgG4WwAjegR", "user": {"username": "Keyvan Mostafavi"}}, {"_id": "ggrHxb2qTQLGAPhY5", "postedAt": "2024-02-05T22:27:43.750Z", "postId": "SnGqab3noXLmJzQCs", "htmlBody": "<p>Wait, I'm confused now. I said in my post that eggs are higher-suffering than beef according to some calculations, and you presented another calculation indicating that eggs are higher-suffering than beef, so I think we just agree?</p>\n", "parentCommentId": "cAtvHaut92wwcvEv5", "user": {"username": "Samira"}}, {"_id": "9ps8mhtcJyYaDv77B", "postedAt": "2024-02-07T18:03:43.264Z", "postId": "SnGqab3noXLmJzQCs", "htmlBody": "<p>Don't live in the bay area, but still found this super useful. Thanks!</p>", "parentCommentId": null, "user": {"username": "Tyler Whitmer"}}, {"_id": "fxKTsxfLmD9uzNops", "postedAt": "2024-02-19T12:42:28.231Z", "postId": "SnGqab3noXLmJzQCs", "htmlBody": "<p>Yep, we agree. I meant that the degree of certainty of \"an egg meal produces more suffering than one beef meal\" is much bigger than your formulation implied. ie : \"higher, by some calculations\"</p>", "parentCommentId": "ggrHxb2qTQLGAPhY5", "user": {"username": "Keyvan Mostafavi"}}]