[{"_id": "xLQePPCnkCh6v4MEn", "postedAt": "2022-11-24T15:50:52.413Z", "postId": "SnS4kjt7ijPvXdhQA", "htmlBody": "<p>Just dropping a note to say:<br>1. Ed Yong's 'An Immense World' is indeed wonderful! :)<br>2. The links in the post need fixing<br>&nbsp;</p>", "parentCommentId": null, "user": {"username": "LaraL"}}, {"_id": "wMb53tdyvBxrFQxfK", "postedAt": "2022-11-24T17:57:20.425Z", "postId": "SnS4kjt7ijPvXdhQA", "htmlBody": "<p>Why doesn't the robot argument also similarly count against conscious suffering in birds and nonhuman mammals?</p>\n", "parentCommentId": null, "user": {"username": "MichaelStJules"}}, {"_id": "uA773oe9BPBEzmACA", "postedAt": "2022-11-24T18:06:48.307Z", "postId": "SnS4kjt7ijPvXdhQA", "htmlBody": "<p>I don't have a lot of context on insects' apparent ignoring extreme injuries, but it's worth noting that they may lack nociceptors in certain parts of their bodies, even if they have them elsewhere or can experience other negative states (e.g. fear). Or certain things may have strong analgesic effects, or they just don't experience pain very intensely relative to other drives. There are alternative possible explanations besides insects being incapable of suffering.</p>\n<p>Also, I wouldn't be surprised if those examples aren't very representative.</p>\n<p>OTOH, they found no evidence for flexible self-protection in most insects here: <a href=\"https://forum.effectivealtruism.org/posts/yPDXXxdeK9cgCfLwj/short-research-summary-can-insects-feel-pain-a-review-of-the\">https://forum.effectivealtruism.org/posts/yPDXXxdeK9cgCfLwj/short-research-summary-can-insects-feel-pain-a-review-of-the</a></p>\n", "parentCommentId": null, "user": {"username": "MichaelStJules"}}, {"_id": "wqLQ8xTbjXXGKomTq", "postedAt": "2022-11-24T18:29:06.553Z", "postId": "SnS4kjt7ijPvXdhQA", "htmlBody": "<p>For those of us worried about insect suffering, I don’t think it’s so much that we confuse pain and suffering (and there’s some even worse problems that come from ambiguities in what people mean by pain as opposed to suffering. Some use pain to refer to a process for aversively responding to stimulus, but not necessarily conscious the way suffering is, others use it to refer to a conscious experience that is often associated with negative valence, but which doesn’t necessarily rise to “suffering” without this valence), as that the question is just actually really hard. Insects might well not be conscious, the evidence here is quite mixed, some of it depends on interpretation of different phenomena, some of it which types of evidence one prioritizes. I think it is very plausible that no insects suffer, that all species suffer, or that some suffer and some don’t. The philosophers also seem <a href=\"https://survey2020.philpeople.org/survey/results/5106?aos=16\">very mixed</a> on this one.</p>\n<p>I don’t think this presents a strong counterpoint to your belief that they don’t suffer, but I think it does to your apparent extrapolation from this that the reason EAs and vegans care about insects is because of EV one-up-man-ship. If you shoot up a house for fun but say it’s alright because you think there’s a 60% chance it’s empty, I think any reasonable, non-EV-obsessed person would want a word with you. If I was a bullet biting EV maximizer, I would be worried about electrons or bacteria, not insects.</p>\n<p>Of course the real situation is very different in ways other than odds from shooting up a possibly occupied house, it is possible a different concern is with pure aggregation rather than EV fanaticism. Yes perhaps the odds of doing wrong by harming insects are high enough to normally rise to morally meaningful non-fanatical levels, but the amount of harm that would be involved if so is so small per individual, that the only reason to care about insects is how overwhelmingly many of them they are. A comparison to this kind of worry might be if EAs and vegans were obsessing over a pollutant that had a 30% chance of making a billion people have slightly itchier scalps.</p>\n<p>I am more sympathetic to this than EV worries, because if it isn’t even clear if something can suffer, then perhaps we should also assume that if it can suffer, that form of suffering is somewhere just over the line into suffering, including the morally meaningful dimensions of it. My concern with this is that I think the morally meaningful aspects of suffering are actually extremely simple as a rule. I can undergo exquisite opera-worthy intellectual angsts, or I can experience brute torture. The latter seems like it usually matters more than the former, despite being much much much simpler, and presumably accessible to much simpler conscious organisms.</p>\n<p>So ultimately, I don’t think concerns about insect suffering are comparable to the itchy pollution case. I think it involves some genuinely difficult and important research programs that could easily show us that insect suffering has radical implications (for instance that insect factory farming is morally on par with more familiar forms of factory farming), or that it is completely irrelevant.</p>\n", "parentCommentId": null, "user": {"username": "Devin Kalish"}}]