[{"_id": "PnYFPWgy2pKoKuvKj", "postedAt": "2022-10-12T19:32:08.820Z", "postId": "SnSAJpPZjLj2JWC56", "htmlBody": "<p>People interested in global health &amp; development and this post might be interested in applying to&nbsp;the <a href=\"https://efctv.org/3EK7guK\">Senior Researcher</a> role at <a href=\"https://www.givewell.org/\">GiveWell</a>, a non-profit focused on helping people do as much good as possible with their donations.</p><p><i>This is a test by the EA Forum Team to gauge interest in job ads relevant to posts -&nbsp; </i><a href=\"https://docs.google.com/forms/d/e/1FAIpQLSez8LIh4zKj26Ok63mmvB2mueYFrvtCHvG5tVq3uPYHZO3Mgg/viewform?usp=pp_url&amp;entry.1792284488=GiveWell\"><i>give us feedback here</i></a><i>.</i></p>", "parentCommentId": null, "user": {"username": "syc"}}, {"_id": "82A5seRQ95EiaxsTq", "postedAt": "2022-10-13T03:26:30.392Z", "postId": "SnSAJpPZjLj2JWC56", "htmlBody": "<p>I weakly think a dedicated thread to job offers would be better - active jobseekers can more easily go through a thread, and this keeps the noise : signal ratio in comment sections lower.<br><br>It also means orgs wanting to hire will have a go-to place, instead of trying to advertise on every relevant post, which would make the comment section a less enjoyable place for me personally if everyone were to do this.<br><br>(I think if this is a test for job ads that are put out ONLY by the EA Forum team, that'd be better, but still probably worse than a dedicated thread)</p>", "parentCommentId": "PnYFPWgy2pKoKuvKj", "user": {"username": "bruce"}}, {"_id": "X5CcDZZ5vNjou6qoH", "postedAt": "2022-10-13T12:52:10.835Z", "postId": "SnSAJpPZjLj2JWC56", "htmlBody": "<p>I disagree, at least in the case of \"job posts only by the EA Forum Team, only for particularly impactful positions\".<br>The noise is small, the potential impact is high.<br>I also don't think people that might be a good fit for these highly competitive particularly impactful roles would necessarily be \"job seekers\" that are actively looking for a job.</p><p>It will make the forum very slightly less enjoyable indeed, but I think it's net positive in terms of counterfactual impact.</p>", "parentCommentId": "82A5seRQ95EiaxsTq", "user": {"username": "Lorenzo Buonanno"}}, {"_id": "mairpMPsgTmbPwjov", "postedAt": "2022-10-13T19:39:59.010Z", "postId": "SnSAJpPZjLj2JWC56", "htmlBody": "<p>Thank you for providing such an in-depth response to my posts Brendan. I really appreciate the sentiment and tone, constructive dialogue like this is what drew me towards EA and motivates me (and other folks I bet) to write on the forum.</p>\n<p>Just about to start the Annapurna Circuit so it'll be a few weeks before I can continue the conversation. I look forward to the unfolding of a spontaneous adversarial collaboration and the advancement of interventions that raise the physical and cognitive floor potential of the people of India. Do hope more voices join and flesh out the many threads at play already.</p>\n", "parentCommentId": null, "user": {"username": "Akash Kulgod"}}, {"_id": "TcaGHHsrrStEQ2AnD", "postedAt": "2022-10-13T20:18:01.861Z", "postId": "SnSAJpPZjLj2JWC56", "htmlBody": "<p>Thanks for the feedback! This is one of multiple job-related tests we're running on the forum, to see if we can find something impactful to build. We did try out your suggestion in the form of the <a href=\"https://forum.effectivealtruism.org/posts/DXcg6N6CGvRA2vrCk/who-s-hiring-may-september-2022\">Who's hiring? (May-September 2022)</a> thread, and we're still analyzing the results. The difference here, as Lorenzo pointed out, is that we could potentially capture people who are not actively looking for a job but would consider applying if they were made aware of relevant opportunities.</p><p>We're testing this via comments because it's a cheap MVP - no coding necessary! :) But if we were to build out a feature it would likely be separate from the comments section, and come with an option to hide it.</p>", "parentCommentId": "82A5seRQ95EiaxsTq", "user": {"username": "syc"}}, {"_id": "Y6yBjh6cTsQu6ctFT", "postedAt": "2022-10-14T21:10:35.220Z", "postId": "SnSAJpPZjLj2JWC56", "htmlBody": "<p>Gladly. I'm &nbsp;also looking forward to learning from others on the forum, and I'm happy to speak 1:1 if you'd like!</p>", "parentCommentId": "mairpMPsgTmbPwjov", "user": {"username": "e19brendan"}}]