[{"_id": "dyyEsSGuvbrAQFbZe", "postedAt": "2022-10-31T16:00:02.030Z", "postId": "SqCDoL9cHa7bnEWyb", "htmlBody": "<p>Yay! Glad you're doing this.</p>\n<p>Whenish might the results be available? (e.g. by the new year, or considerably after?)</p>\n", "parentCommentId": null, "user": {"username": "Ardenlk"}}, {"_id": "6xCzfYiejewxNz8Re", "postedAt": "2022-10-31T16:28:04.678Z", "postId": "SqCDoL9cHa7bnEWyb", "htmlBody": "<p>Thanks!<br><br>I'd say it's pretty uncertain when we'll start publishing the main series of posts. For example, we might work on completing a large part of the series, before we start releasing individual posts, and we may use a format this year where we put more results on a general dashboard, and then include a smaller set of analyses in the main series of posts. But best guess is early in the new year.</p><p><i>That said, we'll be able to provide results/analyses for specific questions you might want to ask about essentially immediately after the survey closes.</i>&nbsp;</p>", "parentCommentId": "dyyEsSGuvbrAQFbZe", "user": {"username": "David_Moss"}}, {"_id": "pmdFcpCbmLqHPY6er", "postedAt": "2022-10-31T18:16:24.783Z", "postId": "SqCDoL9cHa7bnEWyb", "htmlBody": "<p>cool, thank you!</p>\n", "parentCommentId": "6xCzfYiejewxNz8Re", "user": {"username": "Ardenlk"}}, {"_id": "EggbrNDTFidJLzFWJ", "postedAt": "2022-10-31T20:25:58.330Z", "postId": "SqCDoL9cHa7bnEWyb", "htmlBody": "<p>Thanks for sharing!</p><p>Regarding the question:</p><blockquote><p>Which of the following have, within the last 12 months, had the largest influence on your personal ability to have a positive impact? (Choose up to three options.)</p></blockquote><p>Would video calls count as \"Personal contact with EAs\", or is this option reserved for non-virtual contact?</p>", "parentCommentId": null, "user": {"username": "vascoamaralgrilo"}}, {"_id": "u8Ermi57DWeJX3Kkg", "postedAt": "2022-10-31T23:30:01.443Z", "postId": "SqCDoL9cHa7bnEWyb", "htmlBody": "<p>WAY too many of the questions only allow checking a single box, or a limited number of boxes. I'm not sure why you've done this? From my perspective it almost never seems like the right thing, and it's going to significantly reduce the accuracy of the measurements you get, at least from me.</p><p>An example would be, there's a question, \"what is the main type of impact you expect to have\" or something, and I expect to do things that are <i>entrepreneurial</i>, which involve or largely consist of <i>communitybuilding, communication</i> and <i>research.</i> I don't know which of those for impact types are going to be the largest (it's not even possible to assess that, and I'm not sure it's a meaningful question considering that the impacts are often dependent on more than one of those factors at the same time: We can't blame any one factor), but even if I did know how to assess that, the second place category might have similar amounts of impact as first, meaning that by only asking for the peak, you're losing most of the distribution.</p><p>Other examples, which are especially galling, are the question about religious or political identity. The notion that people can only adhere to one religion is actually an invention of monotheist abrahamic traditions, arguably a highly spiritually corrosive assumption, I'm not positioned to argue that, but the survey shouldn't be imposing monotheistic assumptions.<br>The idea that most EAs would have a simple political identity or political theory is outright strange to me. Have you never actually seen EAs discussing politics? Do you think people <i>should</i> have discrete political identities? I think having a discrete, easily classifiable political identity is pretty socially corrosive as well and shouldn't be imposed by the survey! (although maybe an 'other' or 'misc' category is enough here. People with mixed political identities tend not to be big fans of political identity in general.)</p>", "parentCommentId": null, "user": {"username": "MakoYass"}}, {"_id": "PgyYyx85BprGWrLmH", "postedAt": "2022-10-31T23:38:21.759Z", "postId": "SqCDoL9cHa7bnEWyb", "htmlBody": "<p>I think one consideration is that they want to make the surveys comparable year to year, and if people can select many categories, that would be make it difficult.</p><p>For adding multiple options, I think there's another sense of challenge, where if someone could select different political identities or religions, that would make the result difficult to interpret. It seems sort of \"mainstream\" for better or worse, that there is one category for some of the things you mentioned.</p><p>Zooming out, it seems that instead of seeing things like single/multiple as sort of a didactic/right or wrong choice or trying to impose a viewpoint, &nbsp;these seem to be design decisions, that is sort of inherently imperfect in some sense, and part of some bigger vision or something.</p>", "parentCommentId": "u8Ermi57DWeJX3Kkg", "user": {"username": "Charles He"}}, {"_id": "wGb3LSBohZwWmdM6m", "postedAt": "2022-10-31T23:48:49.378Z", "postId": "SqCDoL9cHa7bnEWyb", "htmlBody": "<blockquote><p>I think one consideration is that they want to make the surveys comparable year to year</p></blockquote><p>Makes sense. But I guess if it's only been one year, there wouldn't have been much of a cost to changing it this year, or, the cost would have been smaller than the cost of not having it right in future years.</p><blockquote><p>if someone could select different political identities or religions, that would make the result difficult to interpret</p></blockquote><p>Could you explain why? I don't see why it should, really.</p>", "parentCommentId": "PgyYyx85BprGWrLmH", "user": {"username": "MakoYass"}}, {"_id": "wwnSScmxMLkXLxsmE", "postedAt": "2022-11-01T00:09:22.341Z", "postId": "SqCDoL9cHa7bnEWyb", "htmlBody": "<blockquote><p>Could you explain why? I don't see why it should, really.</p></blockquote><p>Well, in one sense that is shallow, what would an agnostic person + (some other religion mean)?&nbsp;</p><p>Maybe more deeper (?): it seems like some religions like Buddhism, which accepts other practices, would be understood to accept other practices. So it's not clear if a Buddhist who selected multiple options had different beliefs, or was just very being very comprehensive and communicative like a good EA.</p>", "parentCommentId": "wGb3LSBohZwWmdM6m", "user": {"username": "Charles He"}}, {"_id": "sCv83vZqwaGZf4F6K", "postedAt": "2022-11-01T00:21:34.848Z", "postId": "SqCDoL9cHa7bnEWyb", "htmlBody": "<blockquote><p>Well, in one sense that is shallow, what would an agnostic person + (some other religion mean)?&nbsp;</p></blockquote><p>Uh that specifically? Engaging in practices and being open to the existence of the divine but ultimately not being convinced. This is not actually a strange or uncommon position. (What if there are a lot of statisticians who are trying to make their work easier by asking questions that make the world seem simpler than it is.)</p><blockquote><p>it seems like some religions like Buddhism, which accepts other practices, would be understood to accept other practices [but not believe in them or practice them?]</p></blockquote><p>That just sounds like a totally bizarre way to answer the question as I understood it (and possibly as it was stated, I don't remember the details). I wouldn't expect a buddhist with no other affiliations to answer that way. I don't believe the ambiguity is there.</p>", "parentCommentId": "wwnSScmxMLkXLxsmE", "user": {"username": "MakoYass"}}, {"_id": "Ek9ZnBrvNB95dTiRB", "postedAt": "2022-11-01T10:58:00.423Z", "postId": "SqCDoL9cHa7bnEWyb", "htmlBody": "<p>This is not a criticism (think that it's sick you do this survey, and grateful for your work), but I'm curious whether Rethink (or anyone else) has had a go at adjusting for a non-random sample of the total EA community (however that is defined) being made aware of the survey and choosing to participate.<br><br>Probably out of scope for this project - and maybe not even that useful - but I wonder whether it could be useful to survey a sample from an actually random frame to just get some approximate idea of the size and demographics of the EA community. That might help inform EA orgs in working out how much to update based on the survey responses.<br><br><i>credence: not a stats guy, maybe this has been done already, maybe it doesn't matter very much, open to being told why this doesn't matter actually.</i></p>", "parentCommentId": null, "user": {"username": "Tyrone Barugh"}}, {"_id": "TmKEkmXtwyhWiB8HK", "postedAt": "2022-11-01T11:32:01.301Z", "postId": "SqCDoL9cHa7bnEWyb", "htmlBody": "<p>Thanks! We think about this a lot. We have previously discussed this and conducted some sensitivity testing in this <a href=\"https://rethinkpriorities.github.io/ea_data_public/sensitivity.html\">dynamic document</a>.</p><blockquote><p>I wonder whether it could be useful to survey a sample from an actually random frame to just get some approximate idea of the size and demographics of the EA community.</p></blockquote><p>The difficulty here is that it doesn't seem to be possible to actually randomly sample from the EA population. At best, we could randomly sample from some narrower frame (e.g. people on main newsletter mailing list, EA Forum users), but these groups are not likely to be representative of the broader community. In the earliest surveys, we actually did also report results from a random sample drawn from the main EA Facebook group. However, these days the population of the EA Facebook group seems quite clearly not representative of the broader community, so the value of replicating this seems lower.</p><p>The more general challenge is that no-one knows what a representative sample of the EA community should look like (i.e. what is the true composition of the EA population). This is in contrast to general population samples where we can weight results relative to the composition found in the US census. I think the EA Survey itself represents the closest we have to such a source of information.</p><p>That said, I don't think we are simply completely in the dark when it comes to assessing representativeness. We can test some particular concerns about potential sources of unrepresentativeness in the sample (and have done this since the first EA Survey). For example, if one is concerned that the survey samples a disproportionate number of respondents from particular sources (e.g. LessWrong), then we can assess how the samples drawn from those sources differ and how the results for the respondents drawn from those sources differ. Last year, for example, we examined how the reported importance of 80,000 Hours differed if we excluded all respondents referred to the survey from 80,000 Hours, and still found it to be very high. We can do more complex/sophisticated robustness/sensitivity checks on request. I'd encourage people to reach out if they have an interest in particular results, to see what we can do on a case by case basis.</p>", "parentCommentId": "Ek9ZnBrvNB95dTiRB", "user": {"username": "David_Moss"}}, {"_id": "2qzHEtZPKCdfKHxKq", "postedAt": "2022-11-01T12:35:21.806Z", "postId": "SqCDoL9cHa7bnEWyb", "htmlBody": "<blockquote><p>WAY too many of the questions only allow checking a single box, or a limited number of boxes. I'm not sure why you've done this? From my perspective it almost never seems like the right thing, and it's going to significantly reduce the accuracy of the measurements you get, at least from me.</p></blockquote><p>Thanks for your comment. A lot of the questions are verbatim requests from other orgs, so I can't speak to exactly what the reasons for different designs are. Another commenter is also correct to mention the rationale of keeping the questions the same across years (some of these date back to 2014), even if the phrasing isn't what we would use now. There are also some other practical considerations, like wanting to compare results to surveys that other orgs have already used themselves.</p><p>That said, I'm happy to defend the claim that allowing respondents to select only a single option is <i>often</i> better than allowing people to select any number of boxes. People (i.e. research users) are often primarily interested in the _most_ important or _primary_ factors for respondents, for a given question, rather than in all factors. With a 'select all' format, one loses the information about which are the most important. Of course, ideally, one could use a format which captures information about the relative importance of each selected factor, as well as which factors are selected. For example, <a href=\"https://forum.effectivealtruism.org/posts/Dhxg9BfBQEYvZETAD/ea-survey-2020-community-information#Effect_of_different_factors_on_likelihood_of_staying_engaged_with_EA_\">in previous surveys</a> we've asked respondents to rate the degree of importance of each factor , as well as which factors they did not have a significant interaction with. But the costs here are very high, as answering one of these questions takes longer and is more cognitively demanding than answering multiple simpler questions. So, given significant practical constraints (to keep the survey short, while including as many requests as possible), we often have to use simpler, quicker question formats.</p><p>Regarding politics specifically, I would note that asking about politics on a single scale is exceptionally common (I'd also add that single-select format for religion is very standard e.g. in the CES). I don't see this as implying a belief that individuals believe in a single \"simple political identity or political theory.\" The one wrinkle in our measure is that 'libertarian' is also included a distinct category (which dates back to requests in 2014-2015 and, as mentioned above, the considerations in favour of keeping questions consistent across years are quite strong). Ideally we could definitely split this out so we have (at least) one scale, plus a distinct question which captures libertarian alignment or more fine-grained positions. But there are innumerable other questions which we'd prioritise over getting more nuanced political alignment data.</p>", "parentCommentId": "u8Ermi57DWeJX3Kkg", "user": {"username": "David_Moss"}}, {"_id": "qnFSBJEnGTEhebJQk", "postedAt": "2022-11-01T12:46:34.516Z", "postId": "SqCDoL9cHa7bnEWyb", "htmlBody": "<p>How far and wide should people (and especially community builders) spread this and encourage others to fill it in? For example, I could ask people from my local group to fill in the survey, but I don't want to skew the results.</p>", "parentCommentId": null, "user": {"username": "jelle-donders"}}, {"_id": "Lf2eqefRC6JKLgaDb", "postedAt": "2022-11-01T12:46:36.817Z", "postId": "SqCDoL9cHa7bnEWyb", "htmlBody": "<p>Thanks for asking! This is a question requested by another org (in 2019), so I can't give you the definitive authorial intent. But we would interpret this as including virtual personal contact too (not just in-person contact).</p>", "parentCommentId": "EggbrNDTFidJLzFWJ", "user": {"username": "David_Moss"}}, {"_id": "3QvZNSde9MeHieqJD", "postedAt": "2022-11-01T13:05:25.336Z", "postId": "SqCDoL9cHa7bnEWyb", "htmlBody": "<p>Thanks for asking! We would definitely encourage community builders to share it with their groups. Indeed, in previous years, CEA has contacted group organizers directly about this. We would also encourage EAs to share it with others EAs (e.g. on their Facebook page) using the sharing link. I would not be concerned about you 'skewing the results' by sharing and encouraging people to take the survey in this way, in general, so long as you don't go to unusual lengths to encourage people (e.g. multiple reminders, offering additional incentives to complete it etc.).&nbsp;</p>", "parentCommentId": "qnFSBJEnGTEhebJQk", "user": {"username": "David_Moss"}}, {"_id": "6MiuRyeBrZ3LGpN9q", "postedAt": "2022-11-01T13:40:33.143Z", "postId": "SqCDoL9cHa7bnEWyb", "htmlBody": "<p>I think there should be more questions under the 'extra credit' section. I was willing to spend more time on this, and I think there are other views I would be interested in understanding from the average EA.</p>\n<p>A low effort attempt of listing a few things which come to mind:</p>\n<ul>\n<li>moral views</li>\n<li>biggest current uncertainties with EA</li>\n<li>community building preferences</li>\n<li>identification with EA label</li>\n<li>best and worst interactions with EA</li>\n</ul>\n", "parentCommentId": null, "user": {"username": "trait-feign"}}, {"_id": "JkPB83MKvFMvM79a4", "postedAt": "2022-11-01T14:05:30.770Z", "postId": "SqCDoL9cHa7bnEWyb", "htmlBody": "<p>Thanks! I also interpreted it that way.</p>", "parentCommentId": "Lf2eqefRC6JKLgaDb", "user": {"username": "vascoamaralgrilo"}}, {"_id": "yLExi8k2WQbaemaZu", "postedAt": "2022-11-01T14:43:32.323Z", "postId": "SqCDoL9cHa7bnEWyb", "htmlBody": "<p>Edit:&nbsp;</p><p>sorry, I see now that you've discussed the point in my comment below (which I've now put in italics) in the linked document. I'm grateful for, but not surprised at, the care and thought that's gone into this.<br><br>If it's not too much of your time, I just am curious about one more thing. Is the paragraph below saying that surveying the general population would not &nbsp;provide useful information, or is it saying something like 'this would help, but would not totally address the issue'. Like, is there any information value in doing this - or would it basically be pointless/pseudoscientific?</p><blockquote><p>Surveying the general (non-EA) population as part of larger representative surveys to get a sense of the overall composition of EAs (e.g., the gender ratio). However, differential non-response, to these larger surveys would again throw this in doubt. Standard corrections may not be easy: and relative non-response among EAs (e.g., male versus female EAs) may differ from the relative non-response to such surveys in other populations.</p></blockquote><p>***</p><p>Original comment:</p><p><br><i>Thanks for the in depth response, David.</i></p><blockquote><p><i>The difficulty here is that it doesn't seem to be possible to actually randomly sample from the EA population</i></p></blockquote><p><i>Sorry, I explained poorly what I meant. What I meant to ask was whether you could randomly sample from a non-EA frame, identify EAs based on their responses (presumably a self identification question), and then use that to get some sense of the attributes of EAs.</i><br><br><i>One problem might be that the prevalence of EAs in that non-EA population might be so minuscule that you'd need to survey an impractical number of people to know much about EAs.</i></p><p><i>Another response is that it just wouldn't be that useful to know, &nbsp;although the cost involved in hiring polling companies in a few places to do this maybe is not that much when weighed against the time cost of lots of EAs doing the survey at 10min/response.&nbsp;</i><br><br><i>I was a pretty motivated EA (donated, sometimes read EA literature) who did consider myself an EA but was entirely disengaged from the community from 2013-2017, and then barely engaged from 2017-2020. Additionally, when I speak with other lawyers it's not uncommon to hear that someone is either interested in EA or has begun donating to an EA charity, but that they haven't gotten involved with the community because they don't see how that would help them or anyone else do more good.</i></p><p><i>I don't know how useful you think it would be to know more about the makeup and size of that population of unengaged EAs (or EA-adjacent folk, or whatever the label). Maybe it just wouldn't be very decision-relevant for the orgs who have expressed interest in using the data. My initial sense is that it would be useful, but I don't really know.</i></p>", "parentCommentId": "TmKEkmXtwyhWiB8HK", "user": {"username": "Tyrone Barugh"}}, {"_id": "hdmDqaoxMnXPN8gLW", "postedAt": "2022-11-01T16:57:43.812Z", "postId": "SqCDoL9cHa7bnEWyb", "htmlBody": "<p>Thanks for the comments!</p><blockquote><p>Is the paragraph below saying that surveying the general population would not &nbsp;provide useful information, or is it saying something like 'this would help, but would not totally address the issue'.</p></blockquote><p>It's just describing limitations. In principle, you could definitely update based on representative samples of the general population, but there would still be challenges.</p><p>Notably, we have already run <a href=\"https://forum.effectivealtruism.org/posts/qQMLGqe4z95i6kJPE/how-many-people-have-heard-of-effective-altruism\">a large representative survey</a> (within the US), looking at how many people have heard of EA (for unrelated reasons). It illustrates one of the simple practical limitations of using this approach to estimate the composition of the EA community, rather than just to estimate how many people in the public have heard of EA.&nbsp;</p><p>Even with a sample of n=6000, we still only found around 150 people who plausibly even <i>knew what effective altruism was</i> (and we think this might still have been an over-estimate). Of those, I'd say no more than 1-3 seemed like they might have any real engagement with EA at all. (Incidentally, this is roughly a ratio that seems plausible to me for how many people who <i>hear</i> of EA actually then engaged with EA at all, i.e. 150-50:1 or less.) Note that we weren't <i>trying</i> to see whether people were members of the EA community in this survey, so the above estimate is just based on those who happened to mention enough specifics- like knowing about 80,000 Hours- that it seemed like they might have been at all engaged with EA). So, given that, we'd need truly enormous survey samples to sample a decent number of 'EAs' via this method, and the results would still be limited by the difficulties mentioned above.</p>", "parentCommentId": "yLExi8k2WQbaemaZu", "user": {"username": "David_Moss"}}, {"_id": "AGHrjzCTqcoXgd9un", "postedAt": "2022-11-01T20:24:00.914Z", "postId": "SqCDoL9cHa7bnEWyb", "htmlBody": "<blockquote><p>With a 'select all' format, one loses the information about which are the most important</p></blockquote><p>Have you found that people answer that way? I'll only tend to answer with more than one option if they're all about equally important.</p><p>You might expect that it's uncommon for multiple factors to be equally important, I think one of the reasons it is common, in the messy reality that we have (which is not the reality that most statisticians want): multiple factors are often crucial dependencies.<br>Example: A person who spends a lot of their political energy advocating for Quadratic Funding (a democratic way of deciding how public funding is allocated) cannot be said to be more statist than they are libertarian, or vice versa, because the concept of QF just wouldn't exist and cannot be advocated without both schools of thought, there may be ways of quantifying the role of each school in its invention, but they're arbitrary (you <i>probably don't want</i> to end up just measuring which arbitrary quantifications of qualitative dependencies respondants might have in mind today) The concept rests on principles from both schools, to ask which is more important to them is like asking whether having skin is more important to an animal than having blood.</p>", "parentCommentId": "2qzHEtZPKCdfKHxKq", "user": {"username": "MakoYass"}}, {"_id": "ekgGAoLFkFHiCFbmt", "postedAt": "2022-11-02T09:29:42.170Z", "postId": "SqCDoL9cHa7bnEWyb", "htmlBody": "<p>Thanks for taking the time to explain, David!</p>", "parentCommentId": "hdmDqaoxMnXPN8gLW", "user": {"username": "Tyrone Barugh"}}, {"_id": "5qfur78526tt4ctbk", "postedAt": "2022-11-02T11:01:01.551Z", "postId": "SqCDoL9cHa7bnEWyb", "htmlBody": "<p>Small suggestion - could you include some text on the front page about who you think the survey is for (e.g. is it everyone who self-identifies with the term effective altruist? anyone who considers themselves part of the EA community? someone who has read a book / listened to a podcast about effective giving / longtermism / farmed or wild animal welfare?).&nbsp;</p><p>I appreciate that the sampling frame here is extremely difficult and I'm supportive of trying to survey ~everyone of relevance, but the way it's set up now it's not clear to me who you're trying to reach. I can imagine people who you might want to reach and fill the survey out not doing so because of how the landing page is set up. I'd push for an inclusive framing of who you're trying to include. The current page assumes that the reader knows what the \"EA survey\" is - which is pretty ingroup / assumes a lot.</p>", "parentCommentId": null, "user": {"username": "ChrisSmith"}}, {"_id": "X4CmFtrpggSRo4W9S", "postedAt": "2022-11-02T11:30:17.861Z", "postId": "SqCDoL9cHa7bnEWyb", "htmlBody": "<p>Thanks! This is useful feedback.</p><p>We'd like to include more questions in the extra credit section, and I agree it would be useful to ask more about the topics you suggest.&nbsp;</p><p>Unfortunately, we don't find that adding more questions to the extra credit section is completely 'free'. Even though it's explicitly optional, we still find people sometimes complain about the length <i>including the optional extra credit section</i>. And there's still a tradeoff in terms of how many people complete all or part of the extra credit section. We'll continue to keep track of how many people complete the survey (and different sections of it) over time to try to optimise the number of extra questions we can include. For example, last year about 50% of respondents started the extra credit section and about 25% finished it.</p><p>Notably we do have an opt-in extra survey, sent out some time after the main EA Survey. Previously we've used this to include questions requested by EA (usually academic) researchers, whose questions we couldn't prioritise including in the main survey (even in extra credit). Because this is completely opt-in and separate from the EA Survey, we're more liberal about including more questions, though there are still length constraints. Last year about 60% (900) people opted in to receive this, though a smaller number actually completed the survey when it was sent out.&nbsp;</p><p>We've previously included questions on some of the topics which you mention, though of course not all of them are exact matches:</p><ul><li>Moral views: We previously asked about normative moral philosophy, metaethics, and population ethics</li><li>Identification with EA label: up until 2018, we had distinct questions asking whether people could be \"described as \"an effective altruist\"\" and whether they \"subscribe to the basic ideas behind effective altruism\". Now we just have the self-report engagement scale. I agree that more about self-identification with the EA label could be interesting.</li><li>Best and worst interactions with EA: we've definitely asked about <i>negative</i> interactions or experiences in a number of different questions over the years. We've not asked about best interactions, but we have asked people to name which individuals (if any) have been most helpful to them on their EA journey.</li><li>Community building preferences: we've asked a few different open-ended questions about ways in which people would like to see the community improve or suggestions for how it could be improved. I agree there's more that would be interesting to do about this.</li></ul>", "parentCommentId": "6MiuRyeBrZ3LGpN9q", "user": {"username": "David_Moss"}}, {"_id": "MHRzhcaKdNwGiYNuX", "postedAt": "2022-11-02T11:40:22.288Z", "postId": "SqCDoL9cHa7bnEWyb", "htmlBody": "<p>Thanks for the suggestion! We can certainly add something about this to the landing page. [And have now done so]</p><p>I would also note that this text is usually also already included <i>where the survey is distributed</i>. i.e. when the survey is distributed through the EA Newsletter or CEA social media, it will go out with a message like \"If you think of yourself, however loosely, as an “effective altruist,”&nbsp;please consider taking the survey — even if you’re very new to EA! Every response helps us get a clearer picture\" before people see the survey. &nbsp;That kind of message didn't seem so necessary on the EA Forum announcement, since this is already a relatively highly engaged audience.</p>", "parentCommentId": "5qfur78526tt4ctbk", "user": {"username": "David_Moss"}}, {"_id": "tcrdKcWxEhZuh9RRH", "postedAt": "2022-11-02T14:44:32.645Z", "postId": "SqCDoL9cHa7bnEWyb", "htmlBody": "<p>Thanks for the detailed response. It's great hearing about the care and consideration when forming these surveys!</p>\n<p>Given \"last year about 50% of respondents started the extra credit section and about 25% finished it\", this still feels like free info even if people don't finish. But I guess there are also reputation risks in becoming The Survey That None Can Finish.</p>\n<p>I note that previous surveys had some of information I suggested as useful listed, and I think that's why I'd be so excited to see it carried over across the years. Especially with rapid growth of EAs.</p>\n<p>I don't feel like any substantial change should be made off my views expressed here, but I did want to iron out a few points to make my feedback clearer. Your point about follow-up surveys probably catches most of my worries about sufficient information being collected.\nThanks again David and team :)</p>\n", "parentCommentId": "X4CmFtrpggSRo4W9S", "user": {"username": "trait-feign"}}, {"_id": "coyjdmDAthrLiQsTR", "postedAt": "2022-11-04T20:32:05.311Z", "postId": "SqCDoL9cHa7bnEWyb", "htmlBody": "<p>Great survey design, and very short! I liked that you kept the Extra Credit section short because I was able to easily quickly fill it out.</p>", "parentCommentId": null, "user": {"username": "WilliamKiely"}}, {"_id": "GSqEHbD7ESKJBwtiy", "postedAt": "2022-11-05T18:01:55.754Z", "postId": "SqCDoL9cHa7bnEWyb", "htmlBody": "<p>Thanks so much for doing this! I'm really excited to see the results of the survey and expect it'll be really useful :)</p><p>Some nits:</p><ul><li>I noticed at some points that some questions which asked about the impact of programs had a \"None of the above\" response, whereas others didn't (My understanding is it's best practice to include a \"None\" question for all of these? e.g. I noticed the absence of this for the \"Which of these had the largest influence on your impact?\" question.</li><li>I found these options confusingly ordered based on the grid multi-select (e.g. for the year when you joined EA, took me a sec to find the right option, and it feels more natural in a grid to read left to right than top to bottom) — did you consider just leaving this as a list?</li><li>I don't think it's common phrasing to talk about \"increasing / decreasing\" mental health, maybe I would have phrased it as \"had a positive or negative impact on\" mental health</li><li>On \"Do you have any suggestions as to how EA could be improved or developed?\", I don't have a strong sense of what's being asked here, or what \"EA\" refers to in this context? Is this about the community at large, specific people within the community, is this still including \"adjacent ideas\", etc.</li></ul>", "parentCommentId": null, "user": {"username": "Angelina Li"}}, {"_id": "hvDseWJpjm2gsn5Dj", "postedAt": "2022-11-05T18:47:29.502Z", "postId": "SqCDoL9cHa7bnEWyb", "htmlBody": "<p>Thanks for taking the time to comment!</p><p>All of the questions you had substantive comments about the wording of were external requests which we included verbatim.</p><p>Re. the order of the dates: when testing, we found some people thought this was more intuitive left to right and some top to bottom (for context, it's not specifically designed as 'grid', it just happens that the columns are similar lengths to the rows). It could be put in a single column, though not without requiring people to scroll to see the full questions, or changing the style so that it doesn't match other questions. Exactly how you see the questions will vary depending on whether you're viewing on PC, phone or tablet though.</p>", "parentCommentId": "GSqEHbD7ESKJBwtiy", "user": {"username": "David_Moss"}}, {"_id": "3kmojove3nHtCMxkt", "postedAt": "2022-12-01T00:38:38.324Z", "postId": "SqCDoL9cHa7bnEWyb", "htmlBody": "<p>Hi, I hope you do leave this up a week longer at least!</p>\n<p>The FTX fiasco meant a lot of people were overwhelmed and are just now getting spoons back for tasks like this. I will be repromoting this survey to the EA Austin community tonight as I think hardly anyone here will have filled it out. Hoping the link is not dead when people click it 😅🙏</p>\n", "parentCommentId": null, "user": {"username": "Ivy_Mazzola"}}, {"_id": "KWjmmXfDshqBfKBEM", "postedAt": "2022-12-02T17:22:03.990Z", "postId": "SqCDoL9cHa7bnEWyb", "htmlBody": "<p>Many thanks for checking in and sharing the survey! I can confirm that we're leaving the survey open until the end of the year now, like last year. Please also view <a href=\"https://forum.effectivealtruism.org/posts/wph9LGoT8dGpzjuZa/announcing-ftx-community-response-survey\">this post</a> about the extra questions about FTX that have been added now, and the separate survey people can take with questions about FTX, if they have already completed the survey.</p>", "parentCommentId": "3kmojove3nHtCMxkt", "user": {"username": "David_Moss"}}, {"_id": "2qPprRFokqmi789fh", "postedAt": "2022-12-02T17:48:10.437Z", "postId": "SqCDoL9cHa7bnEWyb", "htmlBody": "<p>Awesome, thanks!</p>\n", "parentCommentId": "KWjmmXfDshqBfKBEM", "user": {"username": "Ivy_Mazzola"}}, {"_id": "tvoZP2dpEDXWEor8x", "postedAt": "2022-12-07T20:13:46.611Z", "postId": "SqCDoL9cHa7bnEWyb", "htmlBody": "<p>Will all the results of the survey be shared publicly on EA Forum? I couldn't find mention about this in the couple announcements I've seen for this survey.</p><p>It looks like at least some of the 2020 survey results were shared publicly. [<a href=\"https://forum.effectivealtruism.org/posts/zMKxgK4wbSywnkFrn/ea-survey-2020-geography\">1</a>, <a href=\"https://forum.effectivealtruism.org/posts/83tEL2sHDTiWR6nwo/ea-survey-2020-cause-prioritization\">2</a>, <a href=\"https://forum.effectivealtruism.org/posts/tzFcqGmCA6ePeD5wm/ea-survey-2020-how-people-get-involved-in-ea\">3</a>] But I can't find 2021 survey results. (Maybe there was no 2021 EA Survey?)</p>", "parentCommentId": null, "user": {"username": "Evan R. Murphy"}}, {"_id": "rbyEEqKsMR7t3x5Fv", "postedAt": "2022-12-08T11:17:31.872Z", "postId": "SqCDoL9cHa7bnEWyb", "htmlBody": "<p>I can confirm that we'll be releasing the results publicly and that there wasn't a 2021 EA Survey. And you can view all the EAS 2020 posts in this <a href=\"https://forum.effectivealtruism.org/s/YLudF7wvkjALvAgni\">sequence.</a></p>", "parentCommentId": "tvoZP2dpEDXWEor8x", "user": {"username": "David_Moss"}}, {"_id": "paMgsA3sSk9EjHQum", "postedAt": "2022-12-20T20:39:31.024Z", "postId": "SqCDoL9cHa7bnEWyb", "htmlBody": "<p>\"What actions would you like to see from EA organizations or EA leadership in the next few months?\"&nbsp;</p><ul><li>Pausing new grant investigations&nbsp;</li><li>Pausing public outreach and other attempts to grow the movement&nbsp;</li><li>Something approximating a formal truth &amp; reconciliation process&nbsp;</li><li>More inner work (therapy, meditation, movement practices, self-directed reflection, time in nature, pursuit of Aristotelian leisure especially by working with one's hands)&nbsp;</li></ul>", "parentCommentId": null, "user": {"username": "Milan_Griffes"}}, {"_id": "WKYgBcjs2bmwGDBSb", "postedAt": "2022-12-22T17:34:40.032Z", "postId": "SqCDoL9cHa7bnEWyb", "htmlBody": "<p>I'm curious to read some of the reasoning of those who disagreed with this, as I'm currently high-conviction on these recommendations but feel open to updating substantially (strong beliefs weakly held).&nbsp;</p>", "parentCommentId": "paMgsA3sSk9EjHQum", "user": {"username": "Milan_Griffes"}}, {"_id": "tujKQqnb2XHMMaAzh", "postedAt": "2023-03-04T20:17:55.939Z", "postId": "SqCDoL9cHa7bnEWyb", "htmlBody": "<p>@David_Moss</p>\n<p>Any updates on when you're able to share results?</p>\n", "parentCommentId": "6xCzfYiejewxNz8Re", "user": {"username": "Manuel_Allgaier"}}, {"_id": "BzwfxSSjupSS3gPHW", "postedAt": "2023-03-06T12:06:05.748Z", "postId": "SqCDoL9cHa7bnEWyb", "htmlBody": "<p>Thanks for asking. I'm hoping to begin publishing the series this week. We've been working on the <a href=\"https://forum.effectivealtruism.org/posts/wph9LGoT8dGpzjuZa/announcing-ftx-community-response-survey\">FTX analyses</a> first, since this seemed more time-sensitive.</p>", "parentCommentId": "tujKQqnb2XHMMaAzh", "user": {"username": "David_Moss"}}, {"_id": "Y4HgExcb5LyYyWYEj", "postedAt": "2023-05-12T15:54:19.769Z", "postId": "SqCDoL9cHa7bnEWyb", "htmlBody": "<p>Another nudge here about the rest of the data :) Thanks for the FTX analyses, those were really interesting and I'm glad you prioritised sharing those.</p>", "parentCommentId": "BzwfxSSjupSS3gPHW", "user": {"username": "OllieBase"}}, {"_id": "5xkf9rf2h8vrt73QG", "postedAt": "2023-05-12T16:12:22.644Z", "postId": "SqCDoL9cHa7bnEWyb", "htmlBody": "<p>Thanks for following up! The first EAS post is due out on Monday actually. We've been providing lots of custom analyses to different orgs and movement builders on request though, so feel free to reach out if there are any specific results you need.</p>", "parentCommentId": "Y4HgExcb5LyYyWYEj", "user": {"username": "David_Moss"}}, {"_id": "cpXcrshH9LeFoeJzp", "postedAt": "2023-05-12T16:38:11.091Z", "postId": "SqCDoL9cHa7bnEWyb", "htmlBody": "<p>That's great, thanks! Excited to read.</p>", "parentCommentId": "5xkf9rf2h8vrt73QG", "user": {"username": "OllieBase"}}, {"_id": "Sd4tzHpRcZWkrDNKv", "postedAt": "2022-11-10T10:54:17.551Z", "postId": "SqCDoL9cHa7bnEWyb", "htmlBody": null, "parentCommentId": null, "user": null}]