[{"_id": "PySaaexQX6ReDWT6N", "postedAt": "2023-10-19T22:40:20.437Z", "postId": "SQSXfiByKat2YzpWu", "htmlBody": "<p>Was there some blocker that caused this to happen now, rather than 6 months / 1 year ago?</p>", "parentCommentId": null, "user": {"username": "Joseph Miller"}}, {"_id": "g8vbA6w8meDDJpWio", "postedAt": "2023-10-20T12:01:06.796Z", "postId": "SQSXfiByKat2YzpWu", "htmlBody": "<p>Excited to see this team expand! A few [optional] questions:</p><ol><li>What do you think were some of your best and worst grants in the last 6 months?</li><li>What are your views on the value of \"prosaic alignment\" relative to \"non-prosaic alignment?\" To what extent do you think the most valuable technical research will look fairly similar to \"standard ML research\", \"pure theory research\", or other kinds of research?</li><li>What kinds of technical research proposals do you think are most difficult to evaluate, and why?</li><li>What are your favorite examples of technical alignment research from the past 6-12 months?</li><li>What, if anything, do you think you've learned in the last year? What advice would you have for a Young Ajeya who was about to start in your role?</li></ol>", "parentCommentId": null, "user": {"username": "Akash"}}, {"_id": "YhMmsHPvNcq8MjxP3", "postedAt": "2023-10-21T18:37:20.695Z", "postId": "SQSXfiByKat2YzpWu", "htmlBody": "<p>I only got into grantmaking less than a year ago (in November 2022), and shortly after I unburied myself from <a href=\"https://forum.effectivealtruism.org/posts/HPdWWetJbv4z8eJEe/open-phil-is-seeking-applications-from-grantees-impacted-by\">FTXFF-collapse-related grants</a> around January, I started hiring in a private round which led to Max joining (a private round is generally much less of a logistical lift than a big public round). I'm now joining this big public round along with other OP GCR teams because combining hiring rounds makes it easier on the back-end. See Luke's AMA answers <a href=\"https://forum.effectivealtruism.org/posts/peLstYwka2EzxiNG7/ama-six-open-philanthropy-staffers-discuss-op-s-new-gcr?commentId=HTaXicEEo5SSw7F5y\">here</a> and <a href=\"https://forum.effectivealtruism.org/posts/peLstYwka2EzxiNG7/ama-six-open-philanthropy-staffers-discuss-op-s-new-gcr?commentId=TKFF3nPnLdpcf5gdM\">here</a> for more detail on the \"Why are you hiring now rather than previously?\" question, and my comment <a href=\"https://forum.effectivealtruism.org/posts/dua879FhtLf9jqyJo/there-should-be-more-ai-safety-orgs?commentId=dQL4yD7HzdfgqBKKs\">here</a> for more color on my personal working situation over the last ten months or so.</p>", "parentCommentId": "PySaaexQX6ReDWT6N", "user": {"username": "Ajeya"}}]