[{"_id": "h2qPTBui9WZ8PRwCM", "postedAt": "2017-06-21T16:44:48.463Z", "postId": "SrnWxsApLoNTGnc5P", "htmlBody": "<p>To keep it short: your articles on community-building (especially the social dynamics that come into play) have been highly valuable for me. </p>\n", "parentCommentId": null, "user": {"username": "remmelt"}}, {"_id": "7v9SfyyuefCqz2Aoc", "postedAt": "2017-06-27T15:50:24.721Z", "postId": "SrnWxsApLoNTGnc5P", "htmlBody": "<p>Are there any upcoming career profiles to be excited about?</p>\n", "parentCommentId": null, "user": {"username": "LaurenMcG"}}, {"_id": "fsfN7oFCrxzxja6qg", "postedAt": "2017-08-16T22:25:58.015Z", "postId": "SrnWxsApLoNTGnc5P", "htmlBody": "<p>I would love to see some '40,000 hours' materials for mid-career people pivoting into EA work. </p>\n<p>Our skills, needs, constraints, and opportunities are quite different from 20-somethings. For example, if one has financial commitments (child support, mortgage, debts, alimony), it's not realistic to go back to grad school or an unpaid internship to re-train. We also have geographical constraints -- partners, kids in school, dependent parents, established friendships, community commitments. And in mid-life, our 'crystallized intelligence' (stock of knowledge) is much higher than a 20-something's, but our 'fluid intelligence' (ability to solve abstract new problems quickly) is somewhat lower -- so it's easier to learn things that relate to our existing expertise, but harder to learn coding, data science, or finance from scratch.</p>\n<p>On the upside, a '40k project' would allow EA to bring in a huge amount of talent -- people with credentials, domain knowledge, social experience, leadership skills, professional networks, prestige, and name recognition. Plus, incomes that would allow substantially larger donations than 20-something can manage.</p>\n", "parentCommentId": null, "user": {"username": "geoffreymiller"}}, {"_id": "B2nYwC9aubF9c3cDc", "postedAt": "2017-09-07T02:13:33.236Z", "postId": "SrnWxsApLoNTGnc5P", "htmlBody": "<p>Hi Geoffrey, we agree this would be very valuable. Our materials are already heading in that direction, but I think it will be at least a year or two before we do a major research push to produce that guide due to other competing priorities.</p>\n", "parentCommentId": "fsfN7oFCrxzxja6qg", "user": {"username": "80000_Hours"}}]