[{"_id": "GCjHLfpLAa46dB2Dj", "postedAt": "2022-12-02T23:04:42.836Z", "postId": "SsMKju3H3xmbMkRMD", "htmlBody": "<p>Interesting, my takeaway from FTX was exactly the opposite. That we should focus on getting away from venture capitalists/acquiring as much money as possible/other mindsets that got us into this mess, and instead cultivate talent that are so dedicated to EA that they're willing to do altruistic work for very little money.</p>", "parentCommentId": null, "user": {"username": "bmjacobs@telenet.be"}}, {"_id": "NDkbGaLL4fDiDZpDx", "postedAt": "2022-12-02T23:25:01.979Z", "postId": "SsMKju3H3xmbMkRMD", "htmlBody": "<p>&nbsp;My update from a case of fraud isn't that money can't be made ethically. This isn't to dismiss the possibility of value drift etc, which we should take even more seriously than we have been.</p><p>Having said that , a few things:&nbsp;</p><ol><li>I &nbsp;generally am in favor of moving away from a vibes/patronage based community to a more meritocratic professional-ish group. And the approach you suggested &nbsp;(ie not paying people well) doesn't make it easy to hire people from the \"outside world\" whom we have a lot to learn from (like hmm corporate governance maybe? or accounting?)I think it'll also make the diversity problem significantly worse - and continue selecting for privileged folks who can afford to actually do the work \"purely altruistically\"</li><li>Also, there are a bunch of ways in which labor can't substitute for capital. I work in biosecurity and it seems like we can do significantly fewer things now , especially magaporjects that involve significant brick and mortar infrastructure. I wouldn't be surprised if at some point down the road, AI Safety also requires significant spend on compute/data., not to say anything of the myriad neartermist stuff that's almost infinitely scalable.</li></ol><p>In general, my update is from the situation is more : we need money but we also need better ops , more interfacing with the real world, better corporate governance and generally fewer incentuousy lookign orgs.&nbsp;</p>", "parentCommentId": "GCjHLfpLAa46dB2Dj", "user": {"username": "vaishnav"}}, {"_id": "yJz9qxzrwwepGCrZ5", "postedAt": "2022-12-03T00:52:28.107Z", "postId": "SsMKju3H3xmbMkRMD", "htmlBody": "<p>What percent of expenses in various cause areas are for professional staff in high-income countries?</p>\n", "parentCommentId": "GCjHLfpLAa46dB2Dj", "user": {"username": "Jason"}}, {"_id": "qeHjN56B4L4ob5eC8", "postedAt": "2022-12-03T10:02:25.894Z", "postId": "SsMKju3H3xmbMkRMD", "htmlBody": "<p>Posted this early, so excuse any notifications.</p><blockquote><p>instead cultivate talent that are so dedicated to EA that they're willing to do altruistic work for very little money.</p></blockquote><p>As someone who is working at an EA org for free, &nbsp;I don't agree with this.</p><p>I come from a background of non-EA youth advocacy for multiple cause areas, including education, climate change and animal rights. I have had so many good co-founders go into non impact-focused, high paying roles like consulting because they don't get paid anywhere near the value they provide.</p><p>If you want good talent that knows how to plan, takes initiative and knows how to execute, that kind of talent knows enough to apply to dozens of other better-paying roles, and probably enough to secure very high paying roles.</p><p>I work for free now because I'm in uni and it's socially acceptable to not make full-time pay. If you underpay a competent person, they will not only face financial pressure, but also see it as a reflection of how they are valued. I don't think this leads to healthy movement growth in the long run.</p>", "parentCommentId": "GCjHLfpLAa46dB2Dj", "user": {"username": "Minh Nguyen"}}]