[{"_id": "649PhqyRmSjHYmKTa", "postedAt": "2023-05-01T13:53:55.904Z", "postId": "SSWmnGb5tvAuLcZoA", "htmlBody": "<p>Military guy here. Things that we always consider are the most likely course of action and the most deadly course of action that the adversary can take.</p><p>Since this is a trench warfare with the added emphasis of drones, the most likely course of action is that things won't change much and that battle lines will remain stagnant. This is with the additional point of contention that Ukraine right now is going through the most incredible logistical supply chain process that has ever happened, and Russia kinda keeps losing generals due to stupid OPSEC losses. Of course there will be a spring offensive and counter offensive, and I would favor Ukraine in this manner because it's their territory, etc, and a point of national pride.</p><p>The other problem is the enemys most deadly course of action which is to launch CBRN type weapons back at the Ukrainians. Russians have been entrenched in Crimea for years so getting them out of that position is going to be difficult. They have time to mine and booby trap everything. However... the dark horse that is nuclear usage really needs to be understood from the lens that (A) someone has to accurately tell Putin what is going on (B) he has to respond requesting this to happen (C) someone has to launch a nuke (and the doctrine is that nukes are kept at the Battalion level in the Russian Army) (D) all of this has to not be stopped somehow by an intelligence leak or an insider who doesn't want a nuclear war.</p>", "parentCommentId": null, "user": {"username": "Weaver"}}, {"_id": "CqdfDbHD8sKn5dMez", "postedAt": "2023-05-01T19:32:48.995Z", "postId": "SSWmnGb5tvAuLcZoA", "htmlBody": "<p>Yeah, it seems like even if it's possible to take back Crimea with conventional weapons, there's an extremely high chance of a Russian retaliation or denial strategy that features tactical nukes or something else. We can hope that there's a Stanislav Petrov 2.0 in the ranks somewhere I guess...</p><p>Do you have a strong sense of which weapons systems, drones, etc. would be most decisive on the conventional front? Other than the few that I've mentioned in the post, I'm still pretty naive to what's important here.</p>", "parentCommentId": "649PhqyRmSjHYmKTa", "user": {"username": "mhint199"}}, {"_id": "aKYmX5qqX7pEwM6jR", "postedAt": "2023-05-05T13:57:57.043Z", "postId": "SSWmnGb5tvAuLcZoA", "htmlBody": "<p>Artillery is the biggest conventional threat. Indirect fire, combined with drones or better spotting would lead to the largest amount of casualties.&nbsp;</p><p>This is unconventional(Information Operations), but I would expect that the better question is what are the fighters willing to accept? If they're getting shelled everyday with more and more accurate artillery rounds that is going to eat away at whatever morale they have left. It's far easier to walk away from a war in which you're guaranteed certain death and go AWOL than to stick around as people around you are whittled down. Ukrainian fighters seem to be all in regarding this, as they have stood against Russian artillery the whole time. Russian fighters? I get the sense that they're not as well informed as they should be. Information seems to be siloed off differently(and this is just from following the news), as I wouldn't -if I were a dictator- want the real truth of the matter to reach a demoralized front line, months after they were supposed to be in a short decision mission.</p>", "parentCommentId": "CqdfDbHD8sKn5dMez", "user": {"username": "Weaver"}}]