[{"_id": "fwmZQfohjxfELy9Fz", "postedAt": "2017-11-26T18:04:40.159Z", "postId": "St8LAzYigo7Cc7ZCn", "htmlBody": "<p>I've been thinking of similar things as I co-founded a crypto startup that just got into an incubator. Our original idea was a personal finance app for cryptocurrency, but we started building it and realized it might be too early to make money because there wasn’t a market for it yet -- very few people use cryptocurrency as an actual currency! We have sort of the reverse problem most people have where they have a great idea and just need someone to back it: we have the backing now but with no good idea. We’ll probably build some moderately useful cryptocurrency financial tools and use them to get users while we explore the space more and potentially pivot. We're very interested in EA and life extension but don't seem to have any domain expertise that would allow us to work directly in that space without making money first and having more flexibility like the serial entrepreneur you mention.</p>\n<p>The coming up with better ideas to work on problem seems like a difficult one. Having a master doc of world problems separated by domain as you describe would be really useful. For example, I could see my team going through it and seeing if blockchain tech could contribute anything. This doc from a comment in the plant-based startup post seems like a great representation: <a href=\"https://docs.google.com/document/d/1zCwLkwqwYzfzxwIm1-iHrvheRhMhbLYBxqEiz_7bHdE/edit\">https://docs.google.com/document/d/1zCwLkwqwYzfzxwIm1-iHrvheRhMhbLYBxqEiz_7bHdE/edit</a> That said, it almost seems if people could formulate the problems that well then they very well might already be working on it.</p>\n<p>Thank you for taking the time to write this up! </p>\n", "parentCommentId": null, "user": {"username": "JohnGreer"}}, {"_id": "NchLbknqfoSAJiDR5", "postedAt": "2017-11-27T02:20:17.836Z", "postId": "St8LAzYigo7Cc7ZCn", "htmlBody": "<p>Thanks for taking the time to write this up, and especially for being so honest about it. Almost all new experiments are going to be failures, but the vast majority kinda get disguised as possible successes or totally swept under the rug. I would imagine that one of the most important things this point is that neither one of you get demotivated.</p>\n", "parentCommentId": null, "user": {"username": "oagr"}}, {"_id": "uwuNyNuAYhayb5vSK", "postedAt": "2017-11-27T14:18:29.289Z", "postId": "St8LAzYigo7Cc7ZCn", "htmlBody": "<blockquote>\n<p>This points to another feature of the landscape model: entrepreneurs are locally situated by their existing background knowledge, and this is part of what lets them do what they do. Attempts to “move” them are likely to both meet with resistance and be ultimately counterproductive.... So what we need is much more granular cause prioritization, ideally right down to the size of a problem that can be worked on by an individual or team.</p>\n</blockquote>\n<p>Or maybe we just need to work with people who are actually cause neutral?</p>\n", "parentCommentId": null, "user": {"username": "RyanCarey"}}, {"_id": "dNnEtRaK4W9Hoeohv", "postedAt": "2017-11-27T19:38:53.114Z", "postId": "St8LAzYigo7Cc7ZCn", "htmlBody": "<p>It's true that often entrepreneurs aren't cause-neutral. They're may be working in an area because it interests them, or they care about it.</p>\n<p>But often they're more constrained by what they <em>can</em> do. Typically that's where they start from, and then they look for things that they can fix in that area. </p>\n<p>The second problem is, I think, more fundamental. We can try and convince people to be more cause-neutral (although the fewer population-level changes we need to make, the better!), but it's just hard, per-individual work to move expertise and knowledge.</p>\n", "parentCommentId": "uwuNyNuAYhayb5vSK", "user": {"username": "Michael_PJ"}}, {"_id": "x8Drt9qtYfdTQNAeJ", "postedAt": "2017-11-27T19:43:29.382Z", "postId": "St8LAzYigo7Cc7ZCn", "htmlBody": "<p>I'm pretty interested in blockchain-based tools as platforms for improved institutions. For example, I'd love to see a well-thought-out implementation of <a href=\"https://rationalaltruist.com/2014/11/15/certificates-of-impact/\">certificates of impact</a>.</p>\n<p>I think that there is an important distinction between problems and solutions, so I'm optimistic that it could be possible to make a useful breakdown of problems without having to (or being able to) say much about solutions. However, I'm largely speculating.</p>\n", "parentCommentId": "fwmZQfohjxfELy9Fz", "user": {"username": "Michael_PJ"}}, {"_id": "hjGa7u2n3MqNqdhyW", "postedAt": "2017-12-01T16:10:34.610Z", "postId": "St8LAzYigo7Cc7ZCn", "htmlBody": "<p>I agree that that's a possibility regarding problems and solutions but wish I would see it more in practice.</p>\n<p>Re: certificates of impact. I talked to my team about this. One of my cofounders said:</p>\n<p>“That's an interesting idea. It'd be really cool to create a currency that incentivized people to do good things and pay for good things! But it seems like coordinating that would be extremely difficult unless you had a central institution that was doling these things out. Otherwise how could anyone agree on the utility of anything? Like, I ate lunch, and therefore reduced my suffering from hunger, so do I get certificate for that? Maybe you can make a certificate for anything, but it depends on who's willing to buy it. Say I cure cancer, and I make myself a certificate. “I cured cancer!” Someone buys it from me for $100. But then someone else wants to buy it for $1 million. So I end up with less money than the middle man who did nothing but bet on which certificates were worth something. And I don't know why people would want these certificates in the first place if they're so divorced from the actual deed on them that they have no value but bragging rights. I know people collect high-status bragging type things all the time, but it seems kind of a stretch to say, “Hey, here's this new virtual thing! Want it!””</p>\n<p>Do you have thoughts on this? We're seriously considering trying to implement something provided it would be useful.</p>\n", "parentCommentId": "x8Drt9qtYfdTQNAeJ", "user": {"username": "JohnGreer"}}, {"_id": "6cqDGddLMhrckjpkN", "postedAt": "2017-12-01T22:36:45.093Z", "postId": "St8LAzYigo7Cc7ZCn", "htmlBody": "<p>I think the easiest way to understand is by analogy to carbon offsets, which are a kind of limited form of CoI that currently exist.</p>\n<p>Carbon offsets are generally certified by an organization to say that they actually correspond to what happened, and that they are not producing too many. I don't think there's a fundamental problem with allowing un-audited certificates in the market, but they'd probably be worth a lot less!</p>\n<p>I think the middle man making money is <em>exactly</em> what you want to happen. The argument is much the same as for investment and speculation in the for-profit world: people who're willing to take on risk by investing in uncertain things can profit from it, thus increasing the supply of money to people doing risky things.</p>\n<p>Here's a concrete example: suppose I want to start a new bednet -distributing charity. I think I can get them out for half the price of AMF. Currently, there is little incentive for me to do this, and I have to go and persuade grantmakers to give me money.</p>\n<p>In the CoI world, I can go to a normal investor, and point out that AMF sells (audited) bednet CoIs for $X, and that I can produce them at half the cost, allowing us to undercut AMF. I get investment and off we go. So things behave just like they do in the for-profit world (which you may or may not think is good).</p>\n<p>What you <em>do</em> need is for people to want to buy these and &quot;consume&quot; them. I think that's the really hard problem, getting people to treat them like &quot;real&quot; certificates.</p>\n<p>Happy to talk about this more - PM me if you'd like to have a chat.</p>\n", "parentCommentId": "hjGa7u2n3MqNqdhyW", "user": {"username": "Michael_PJ"}}, {"_id": "Q5YTSmeizxuYor3Eg", "postedAt": "2018-04-12T13:45:05.785Z", "postId": "St8LAzYigo7Cc7ZCn", "htmlBody": "<p>High Michael_PJ.  </p>\n<p>I am interested in working on the social benefit entrepreneurship problem.  I drafted a white paper on the design of an organization to conduct socially beneficial entrepreneurship.  I am a bit over excited about it and I am most likely blind to its flaws. I also have limited knowledge of the work done by others in this area.  I am looking for reviewers to identify its flaws so I can bullet proof it prior to seeking funding.  It seems like you have very good qualifications to review the paper.  Would you be willing to look it over?  If so what is the best way to get it to you?</p>\n", "parentCommentId": null, "user": {"username": "JohnGalt"}}, {"_id": "5mhyckMWoXkoEYH34", "postedAt": "2018-04-12T20:42:00.939Z", "postId": "St8LAzYigo7Cc7ZCn", "htmlBody": "<p>I've DM'd you.</p>\n", "parentCommentId": "Q5YTSmeizxuYor3Eg", "user": {"username": "Michael_PJ"}}]