[{"_id": "F4b2g55mX8FhkqQeF", "postedAt": "2023-12-13T04:08:20.494Z", "postId": "StDKoRhfjG4stXNia", "htmlBody": "<p>My heart bleeds for Kate Cox as I truly know what she is going through. Everyone is using the medical term Trisomy 18 but I know it as Edwards’ Syndrome.</p><p>&nbsp;</p><p>I had a perfectly healthy 18 month old boy and was so thrilled to find out I was expecting again but, as time went on, something just wasn’t right. If I was lying in bed at night and tried to turn over, I would have to lift my stomach/baby to turn with me as it was like a ‘dead weight’ (please excuse the term there as it really is the only way I can describe it).</p><p>&nbsp;</p><p>For whatever reason, I elected to schedule an early appointment for a scan (I think I was 12 weeks at the time) with Professor Kypros Nicolaides in Harley Street, London.</p><p>&nbsp;</p><p>He referred me straight to King’s College Hospital in London for tests – I consented to pass all the findings to medical research foe this terrible syndrome. My little girl (who I dreamt about for years) and I know she was a girl as (a) most babies with Edwards are girls but (b) with further tests, she had XXX syndrome.</p><p>&nbsp;</p><p>From the ultrasounds, we also uncovered she had no nose at all and a massive hole in her heart.</p><p>&nbsp;</p><p>I underwent test after test after test in the hope there was hope – ultimately Professor Nicolaides took me to one side and just said – this is Edwards, nothing more or less and one of the most horrific situations for a mother to be in. I had a son and husband that needed me to be whole and I needed to let go. If I didn’t take action, I would have been forced to go through a normal delivery knowing my soo much wanted daughter would be born dead.</p><p>&nbsp;</p><p>I visited a priest and asked for forgiveness in advance but made to pray to stop the devil in my soul, I crossed a line of picketers to do the last thing in the world I wanted to do only to be faced with having to go through a pregnancy test before I said goodbye to the daughter I wanted more than anything in the world to make sure there was something to abort.</p><p>&nbsp;</p><p>Everything about that experience went against everything I believed in. I did fall pregnant once again but my second son was born premature at 22 weeks and the hospital did nothing to help him and I failed to conceive again. I have 1 boy and he is the center of my world and I wouldn’t change anything but to see legislatures make decisions that can break families beyond belief – trust me, I was an emotional disaster for many years (and still am – you never, ever forget this) and cannot believe my husband stayed with me through it all as I seriously did not deserve him.</p><p>&nbsp;</p><p>Abortion should not exist for convenience but there are exceptional times when the welfare of the mother and the family needs to be placed first and, if the right for abortion is to be removed, then these types of exceptional circumstances must be understood, discussed and allowed.</p><p>&nbsp;</p><p>‘Trisomy 18’ sounds like another inconvenient illness that could be embarrassing but IT IS NOT. Edwards’ Syndrome is horrific and very few, if any, babies survive the womb and a mere handful go beyond.&nbsp;</p><p>Please, please America – do you have any inkling of the damage this does to Mothers and families.</p><p>&nbsp;</p><p>There MUST be some level of compromise to help and support families caught in this most awful situation.</p>", "parentCommentId": null, "user": {"username": "JAM12345"}}]