[{"_id": "9nC2p5mdEu75SdtnQ", "postedAt": "2014-09-13T14:17:26.947Z", "postId": "SwG8Tj9RkG8DzpM4f", "htmlBody": "<p>Gwern has an <a href=\"http://www.gwern.net/The%20Narrowing%20Circle\">excelent article arguing against this thesis</a>, which you should read in full. He argues that Singer ignores numerous cases in which our circle of concern seems to have shrunk. From the standpoint of our current ethics, it is hard to see these past concerns as bearing any moral significance, but this is always true of someone in a narrower circle judging someone in a wider one.</p>\n<p>For example, our circle has narrowed with respect to gods:</p>\n<blockquote>\n<p>When one doesn’t believe religion deals with real things at all, it’s hard to take religion seriously - much less recall any instances of its sway in the West increasing or decreasing.</p>\n</blockquote>\n<blockquote>\n<p>But nevertheless, when one compares modern with ancient society, the religious differences are striking: almost every single supernatural entity (place, personage, or force) has been excluded from the circle of moral concern, where they used to be huge parts of the circle and one could almost say the entire circle.</p>\n</blockquote>\n<blockquote>\n<p>...</p>\n</blockquote>\n<blockquote>\n<p>Iceland is mocked when construction is held up to expel elves - but the construction goes forward. Japan keeps its temples on sacred places - when they earn their keep and do not block housing projects, of course. Lip service is paid, at most. </p>\n</blockquote>\n<blockquote>\n<p>...</p>\n</blockquote>\n<blockquote>\n<p> Peter Singer focuses on animals; religion gives us a perspective on them - what have they lost by none of them being connected to divinities and by becoming subject to modern factory farming and agriculture? If you could ask snakes, one of the most common sacred animals, what they made of the world over the last millennia, would they regard themselves as better or worse off for becoming merely animals in the expanded circle? If India abandoned Hinduism, what would happen to the cows? We may be proud of our legal protections for endangered or threatened species, but the medievals protected &amp; acquitted ordinary bugs &amp; rats in trials. </p>\n</blockquote>\n<p>The circle has at best oscillated with regards abortion and infanticide:</p>\n<blockquote>\n<p>Continuing the religious vein, many modern practices reflect a narrowing circle from some points of view: abortion and contraception come to mind. Abortion could be a good example for cyclical or random walk theses, as in many areas the moral status of abortion or infanticide has varied widely over recorded history, from normal to religiously mandated to banned to permitted again.</p>\n</blockquote>\n<p>The use of torture comes and goes:</p>\n<blockquote>\n<p>State use of torture can be cyclical - some northern European countries going from minimal torture under their indigenous governments to extensive torture under Roman dominion back to juries &amp; financial punishments after Rome to torture again with the revival of Roman law by rising modern centralized states and then torture’s abandonment when those states modernized and liberalized even further. China has gone through even more cycles of judicial torture, with its dynastic cycle.</p>\n</blockquote>\n<p>As well as other parts of the judicial system:</p>\n<blockquote>\n<p>Some areas have changed far less than one might hope; arbitrary property confiscations that would make a medieval England freeman scarlet with anger are alive and well under the aegis of the War on Drugs, under the anodyne term “asset forfeiture” as a random form of taxation. (And what are we to make of the disappearance of jury trials in favor of plea bargaining?)</p>\n</blockquote>\n<p>Our ancestors no longer command the respect they once did:</p>\n<blockquote>\n<p>Another possible oversight is the way in which the dead and past are no longer taken into consideration. This is due in part to the expanding circle itself: if moral progress is indeed being made, and the weight of one’s voice is related to how moral one was, then it follows past people (by being immoral) may be ignored. We pay attention to Jefferson in part because he was partially moral, and we pay no attention to a Southern planter who was not even partially moral by our modern lights.</p>\n</blockquote>\n<blockquote>\n<p>More dramatically, we dishonor our ancestors by neglecting their graves, by not offering any sacrifices or even performing any rituals, by forgetting their names (can you name your great-grandparents?), by selling off the family estate when we think the market has hit the peak, and so on.</p>\n</blockquote>\n<blockquote>\n<p>Given these shrinking circles, should we call it an expanding circle or a shifting circle?</p>\n</blockquote>\n", "parentCommentId": null, "user": {"username": "Dale"}}, {"_id": "MmvKtyj47jF2DimB2", "postedAt": "2014-09-28T16:09:42.260Z", "postId": "SwG8Tj9RkG8DzpM4f", "htmlBody": "<blockquote>\n<p>At this point the students raise various practical difficulties. Can we be sure that our donation will really get to the people who need it? Doesn’t most aid get swallowed up in administrative costs, or waste, or downright corruption? Isn’t the real problem the growing world population, and is there any point in saving lives until the problem has been solved? These questions can all be answered: but I also point out that even if a substantial proportion of our donations were wasted, the cost to us of making the donation is so small, compared to the benefits that it provides when it, or some of it, does get through to those who need our help, that we would still be saving lives at a small cost to ourselves – even if aid organizations were much less efficient than they actually are.</p>\n</blockquote>\n<p>This article was written before the explicit advent of effective altruism, and, as a movement, I believe it can motivate people to meet the moral imperative Peter Singer is concerned about while also taking care of the concerns raised in the above paragraph. Contra Dr. Singer's assuage of concerns above, they are a legitimate reason to perhaps not donate on a knee-jerk imperative. Effective altruism seeks to solve such concerns by doing good better, and doing stringent research about donations in terms of cost-effectiveness, cross-charity comparisons, cause selection, and counterfactual reasoning. I believe effective altruism is broader than what's put forth in Dr. Singer's above article, and necessarily so.</p>\n<p>I also agree with the comments Dale made. Although there are other articles on this site that may cover for the holes in this one, I don't believe this is a fit introduction to effective altruism, especially if Peter Singer has a better essay written. I'd much prefer people just watch his TED talk.</p>\n", "parentCommentId": null, "user": {"username": "Evan_Gaensbauer"}}, {"_id": "AY5cYZY2bs2BmdTxa", "postedAt": "2015-06-21T17:46:38.190Z", "postId": "SwG8Tj9RkG8DzpM4f", "htmlBody": "<p> I find it difficult to shift from a life based on consumption, but not impossible. \n It's difficult, because our society doesn't think nor feel deeply. The lack of time for thinking carefully of the way we are living is the trap. It seems as if all the things we do every day had to be done fast and easily, without questionnig anything. Each question about our way of life can be considered inappropiate.\nIn addition to this, the pursuit of self-interest, has been installed in our lives as the greatest pourpose of them. We have developed an alarming capacity of postponing others needs while our self-interest is focused on money and property. </p>\n<p>In spite of the content of these previous lines, it's a fact that many people collaborate with NGOs which make donation to provide benefits to those who need our help, even if the charities' management is often questioned. We could consider that this generosity isn't enough to reverse our society's attitude so far, but it means that there is a little hope to get it</p>\n<p>I agree with the idea of expanding the circle of ethics and spreading a higher ethical consciousness to get better our society. In my view, all of us should learn and feel moral values that we need like justice, dignity and equality. Obviously, education is envolved in it and has a complicated but fascinating challenge nowadays.</p>\n", "parentCommentId": null, "user": {"username": "mjpicot"}}, {"_id": "u7DcocTfincqLFA8m", "postedAt": "2016-02-01T11:48:32.948Z", "postId": "SwG8Tj9RkG8DzpM4f", "htmlBody": "<p>The expanding circle refers to the range of sentient beings that humans include in their scope of concern. The fact that we have recognized the non-existence of gods or the non-sentience of a fetus is not the same as shrinking or the circle. The fact that we no longer have concern for the dead is, again, not relevant. Our consideration for property is equally rejected by this simple consideration. You could certainly argue that from the perspective of a past human, the circle would seem to shift, but that does not change the fact that using our reasonable modern understanding of the world, the scope of human concern for sentient beings has consistently expanded, rather than shifted.</p>\n", "parentCommentId": "9nC2p5mdEu75SdtnQ", "user": {"username": "iwillnotgetaddicted"}}, {"_id": "rLotpBs7TSDj9Te4F", "postedAt": "2016-02-01T11:59:08.161Z", "postId": "SwG8Tj9RkG8DzpM4f", "htmlBody": "<p>I deeply and truly want to believe this, but I wonder what empirical evidence Singer has that materialistically driven individuals are less happy than altruistically drive individuals. I agree that inwardly-focused or possession-focused individuals are less happy, but I don't believe that altruists are any more happy or satisfied with their lives. Having read several books on the science of happiness, but also having a small and forgetful mind, I am left only with a basic impression of our state of understanding. I also wonder how many of the results we do have are simply correlations based on a simpler underlying factor. As an examples, it has become widely reported and known recently that those who spend money on experiences, rather than things, tend to be happier people. But could it be that the relevant factors is an inclination towards greater social engagement, which leads to both happiness and spending on experiences? And again, we are told that practicing forgiveness leads to happiness-- but those who prefer isolation don't need to forgive, those driven towards social engagement would be driven to forgive and resume the relationship.</p>\n<p>I seem to have gotten off track, but here is my observation: I know many people who are altruistic, and I know many people who are consumeristic. I see no pattern in how satisfied they are with their lives that arises from these characteristics. Rather, I find that my wealthy relatives who spend ever more money on wine and food are very happy-- and they tend to eat that food with friends. I find that my wealthy relatives who spend their money on wine and beer are unhappy-- and they tend to eat it alone. I find that my altruistic friends who own a business and give generously to charity are unhappy, but my altruistic friends who participate in church drives or international aid work are happy. </p>\n<p>As someone who is not socially engaged, who is highly altruistic and deeply unhappy, I find little encouragement in the idea that an ethical life leads to happiness. </p>\n", "parentCommentId": null, "user": {"username": "iwillnotgetaddicted"}}, {"_id": "n7ZN2YCamvzP8Lp8P", "postedAt": "2016-02-03T14:15:54.311Z", "postId": "SwG8Tj9RkG8DzpM4f", "htmlBody": "<p>I have found that a healthy diet makes a difference in my own happiness. As a vegan, I have to pay a bit more attention to getting a well balanced diet, including b12 and vitamin d supplements. For breakfast I make a smoothie made with dates, bananas, berries, flax seeds, cacao nibs, walnuts, cinnamon, orange zest, and kale. I also drink green tea and try to avoid refined sugar/carbs/oils and alcohol.</p>\n<p>If anyone is interested, <a href=\"http://nutritionfacts.org/\">http://nutritionfacts.org/</a> has a lot of evidence based nutritional advice.</p>\n", "parentCommentId": "rLotpBs7TSDj9Te4F", "user": {"username": "tjmather"}}, {"_id": "iR7zfHQfF9btYarGM", "postedAt": "2016-07-01T15:22:23.725Z", "postId": "SwG8Tj9RkG8DzpM4f", "htmlBody": "<p>Excellent introduction! I am so glad I found this course. I think the article is extremely intelligent and insightful. </p>\n<p>Recently, I have been trying to launch a wildlife campaign on Twitter. I am finding it a challenge to get people to care. Often when I tweet posts about the environment or endangered species, followers drop off.  I am asking myself - is it possible to change how somebody feels? Can you change somebody's internal thought process and desires? Unfortunately, I think the answer might be no. I think you can move people to act, but you can not change somebody's internal values and ethics. I also believe everybody has a different purpose, fate and destiny, and that good and evil are inherent. </p>\n<p>For example, does a poacher care that Kenya lights a fire and burns ivory? I think the answer is no. Would he care if he got thrown in jail? I think the answer is yes. If you were trying to support your family, would you shoot the last elephant ?  I wouldn't. I would look for another alternative. But I think many would. </p>\n<p>Maybe the solution is to gather the people who do care and that can make a difference - private investors, companies, etc. </p>\n", "parentCommentId": null, "user": {"username": "Christy77"}}, {"_id": "AosBtHrBiq3wwKDXp", "postedAt": "2016-11-02T06:58:39.244Z", "postId": "SwG8Tj9RkG8DzpM4f", "htmlBody": "<p>Interesting post without any doubt. Are you sure that consumeristic people are actually satisfied of their style of life and the altruistic ones not? What is happiness and what it is authenticity? Is happiness only immediate pleasure? Is there any difference between esthetic pleasure and authentic self-realization? Which are our existential needs? No one can ignore such deep question. If we do not ask ourselves we risk to live without any sense or significance. So I think that it doesn't matter if a lot of people are not altruistic but it matters if they have or not to be.</p>\n", "parentCommentId": "rLotpBs7TSDj9Te4F", "user": {"username": "Patrizia"}}, {"_id": "37JPm9nCiy3W78tvP", "postedAt": "2018-11-26T17:25:02.334Z", "postId": "SwG8Tj9RkG8DzpM4f", "htmlBody": "<p>Good point, but then I would ask you: if being happy is part of the equation, and if you can be equally happy both by hedonistic satisfaction or by altruistic enterprise, then which one would you choose? Having no impact on the world or working to make the world a better place?</p>", "parentCommentId": "rLotpBs7TSDj9Te4F", "user": {"username": "dennymarc"}}, {"_id": "J7poM3feHLoFP4koE", "postedAt": "2019-07-19T17:51:41.216Z", "postId": "SwG8Tj9RkG8DzpM4f", "htmlBody": "<p>An excellent essay that covers off the main points very well, and the necessity of expanding our circle of concern.</p><p>But now for the problems:  People respond most effectively to concrete problems that are close and immediate.  People also respond to the individual more effectively than to a group, which means that appeals are best focused when showing the predicament of an individual.</p><p>Climate change is a particularly vexing problem because it is abstract, and not perceived as an immediate threat, and participating in reducing the risk of climate change does not produce immediately visible changes.  (However, if things are done which reduce an immediate problem such as particulate in the atmosphere that are affecting people&#x27;s health near the source of emissions can show the positive affect of change.)  It is also problematic because it has been politicized and made a wedge issue in many countries and states.  It also makes us have to extend our circle of concern out to ecologies and not just a single species.  In many ways it is the worst type of existential crisis because it requires us to what we are worst at - responding to something abstract, distant and difficult to grasp in the way we can grasp a drowning child in front of us.</p><br/>", "parentCommentId": null, "user": {"username": "iso-nfulford"}}, {"_id": "zaiMzh2BPkQfAhtcz", "postedAt": "2020-03-03T19:14:14.330Z", "postId": "SwG8Tj9RkG8DzpM4f", "htmlBody": "<p>I agree with the concept of the expanding circle of ethics, especially when it comes to considering other elements that feed it and from which the reflection of it cannot be detached, I refer to the ad intra and ad extra elements of the circle, that is, it influences both the piscology of the individual and the cultural substrate in which it is found. For example, I want to confine the viewer&apos;s interference. The idea is that if there are 40 of us who can help then it is not so urgent that I do so; The responsibility of doing something is dispersed among all these people. Then you can tell yourself: &quot;Maybe I should help, but they should do it too.&quot; And if they are not helping, then I may not have the responsibility to help. It is a kind of conformity, there is a conformity effect there, and a distribution of responsibility that makes your part seem smaller, because there is likely to be someone with greater or better ability to respond, hence the sense of altruism is it dissipates by the number and the distance that is conserved between the other, which makes per se that interfere the cultural elements like subcultural, prejudices or stereotypes are determinants at the moment of infecting the social emotions and the actur with responsibility between them. For this reason, I considered that companies such as multinationals, see each other with such distance that they no longer force them to act in favor or for happiness, but against it. Although the institutions are privileged by the deontological normativity and are governed by the principle of social responsibility, nothing guarantees that the actions are altruistic since the ethical circle has been broken in the normative process creating paradoxes of the Human Resource.</p>", "parentCommentId": null, "user": {"username": "Jorge Ivan"}}, {"_id": "5vMgWtraFYcCz3weg", "postedAt": "2020-03-18T23:39:37.507Z", "postId": "SwG8Tj9RkG8DzpM4f", "htmlBody": "<p>Un ensayo que hace de abre bocas para un aprendizaje prometedor, donde la empat&#xED;a viaja m&#xE1;s all&#xE1; de las barreras del ego y los intereses propios. Hablando adem&#xE1;s del replanteamiento del t&#xE9;rmino &#xE9;xito se podr&#xED;a decir que, acumular riquezas se hace demasiado f&#xE1;cil si lo que concibo como &#xE9;xito es la preponderaci&#xF3;n del bien com&#xFA;n sobre mis deseos individuales.</p>", "parentCommentId": null, "user": {"username": "sosamariana0832"}}, {"_id": "qmJidSeKdtSJRKaTT", "postedAt": "2020-03-19T20:08:07.602Z", "postId": "SwG8Tj9RkG8DzpM4f", "htmlBody": "<p>This may be a chicken and egg conundrum. Are they happy because they socialize; or do they socialize because they are happy? </p><p>The same goes for altruism. Is one altruistic because they are happy; or are they happy because they are altruistic? </p><p>Off the top of my head (with no deep thought to this) I suspect that if one is unhappy with their life, altruism will not make them happy with their life. They may still get the &quot;warm glow&quot;, but not the deeper happiness. </p>", "parentCommentId": "rLotpBs7TSDj9Te4F", "user": {"username": "MW"}}, {"_id": "9GJbJ7yWrWhPjTAAG", "postedAt": "2020-03-19T21:45:40.388Z", "postId": "SwG8Tj9RkG8DzpM4f", "htmlBody": "<p>In my case, an existential crisis drove me to altruism. I felt like my life had no purpose, my goals until then didn&apos;t matter and that it would be shameful to pursue whatever I felt like, ignoring the suffering of others. EA brought purpose to my life, and I&apos;m happier for it.</p>", "parentCommentId": "qmJidSeKdtSJRKaTT", "user": {"username": "MichaelStJules"}}, {"_id": "FbCb9aCkFk5T7hTRh", "postedAt": "2020-03-24T19:49:20.022Z", "postId": "SwG8Tj9RkG8DzpM4f", "htmlBody": "<p>In the face of the global coronavirus calamity, where rich and poor counties were affected in dramatic way,  probably is a good time to re-think new concepts of humanitarian aid, leaving the question of donating something or product and moving on to a greater sharing of wealth, scientific knowledge.</p>", "parentCommentId": null, "user": {"username": "thisisbrazil"}}, {"_id": "5syKJqdSe5BxMkEAF", "postedAt": "2020-03-31T05:06:33.819Z", "postId": "SwG8Tj9RkG8DzpM4f", "htmlBody": "<p>In my case, I try to focus only on those people who need my help, not on judging those people who seem seduced by consumption. I am not interested in questioning your happiness or fulfillment. To the extent that I can establish a genuine bond with the other, with the person I intend to help, I think I will be happy. That&apos;s why I was so interested in the idea of &#x200B;&#x200B;Lecky&apos;s expansive circle.  (Sorry if there are a lot of mistakes, but I don&apos;t speak English).</p>", "parentCommentId": null, "user": {"username": "Pedro Maino"}}, {"_id": "M7FHu3w3fGoBcyHsm", "postedAt": "2020-03-31T15:38:55.503Z", "postId": "SwG8Tj9RkG8DzpM4f", "htmlBody": "<p>I loved the article. It focuses on several aspects that I think are very important in modern times and it gives us thought.<br>Although, I think it is more urgent to make the world population more aware of the most precarious and disadvantaged realities. This, perhaps, is the first step for more people to live a more ethical life and be more supportive. Leaving your comfort zone, traveling, getting to know other cultures, other ways of life, refusing tourist attractions for the protection of animal life, exchanging the couch for a trip to the elderly home closer to home, making erasmus, knowing other religions, make an interrail, make an intrarail for your own country, etc., make use of our ambulatory freedom, cultural freedom, religious freedom, freedom of thought, and especially our rationality and independence.<br>When the human being leaves his comfort zone, he tests his ability to unravel, his ability to establish interpersonal relationships between help and empathy to survive in an environment that is not his own. Therefore, this being lives experiences and adventures that will help him to shape his personality and affective, social and cognitive capacities that will be important for the experience based on this proposed ethics.<br>In addition, when human beings embark on this type of (self) discovery and entrepreneurship spirit, they will realize the basic needs of their experience and the importance of safeguarding their rights. In this way, you will realize that although it is not a global reality, ALL human beings should have access to health, education, food, housing and sanitary conditions, freedom of choice, freedom, equality and fraternity. As a result of this awareness through personal experience, the human being will more quickly take solidarity initiatives as with those who are most in need and live without conditions.<br>For example, I volunteered at an orphanage in southern India, where there was a shortage of water, toilet paper, above other things; education was not well transmitted, silence was instilled as a superior value to freedom of expression, among other aspects. This experience made me look at my educational options, at the 12 bottles of drinking water I have in my pantry, at ways in my country that my rights, freedoms and guarantees are defended, with different eyes. And each passing day, the desire to help people who do not live in a reality as pleasant and comfortable as mine do, grows.</p><p>This solidary ethics is acquired and lived due to our knowledge and personal experiences, in my humble opinion.</p>", "parentCommentId": null, "user": {"username": "mary_tdc"}}, {"_id": "duFYobMu4PmbDn67C", "postedAt": "2020-04-06T06:46:08.772Z", "postId": "SwG8Tj9RkG8DzpM4f", "htmlBody": "<p>Thank you for your article. I am writing just now 5Th april, at 3.10 p.m.  from Florence, Italy. </p><p>Today, Sunday, is a sunny day, but we cannot go out, and I&apos;m following this interesting lesson.</p><p>Every day we have to face with our new life, in which the virus seems to give the rules.</p><p>So, as you say in the article,  I believe the most important sentence is: &quot;An ethical approach to life does not forbid having fun or enjoying food and wine; but it changes our sense of priorities. &quot;</p><p>We all, now, we are rethinking our priorities, and I believe people is  making an effort to live more ethical relationship  and to define the basically needs; now all we pay more attention to our older neighbour. The main priority now is not to be happy, but to give assistance and to help people  first here in our hospitals, town, village, country, nation,  and than in the continent and all the  world. </p><p>We are not heroes, we are frail people, but our fragility give us the strength  to continue our everyday life and job  and we discovered  that we have Effective Altruism  already inside us. Maybe we never used it before, and we were looking where and how to use it. But now is coming out powerfully and naturally. Now the lives we can save are here, at home. How can we gather tese two needs? Have we to stop thinking to people, or to children drowing in other rivers?</p><p>Sorry, my english is not so well as I would like.</p>", "parentCommentId": null, "user": {"username": "banfi-banfi"}}, {"_id": "csN2P7dqm4F5jTGDu", "postedAt": "2020-04-06T06:46:19.540Z", "postId": "SwG8Tj9RkG8DzpM4f", "htmlBody": "<p>Excellent article. I consider that the problem of neoliberalism (the ideology of the free market whose only message is: consume and work hard so that you can earn money to consume more) is a global one, which goes against the environment, since global overpopulation demands more needs from the world. We live in times of pandemic, which can change that idealism is more fashionable than cynicism, for the simple concept of subsistence. It is our responsibility to take care of our planet, from an altruistic point of view, we realize that health is a human right and not a consumption; that generalized education contributes indirectly so that the planet does not suffer from overpopulation, since women and men with average intellectual levels think about having children. The environment needs a balance of the human being, both in quantity, and in that these are more equitable in the resources obtained from it. </p>", "parentCommentId": null, "user": {"username": "Livan Parra"}}, {"_id": "oP2JSyCH83JWvJ4to", "postedAt": "2020-04-07T19:02:58.810Z", "postId": "SwG8Tj9RkG8DzpM4f", "htmlBody": "<p>Simple words that explain how society could benefit from a new perspective to improve life around us, not only humanitarian but also nature. The balance of money and power is not corruptible and delicate, from my perspective many can be done, if we invest money in charitable goals. And not becoming an activist for the public eye. </p><p>During this pandemic of COVID-19, I saw people helping others who need more and even adopting dogs and cats as pets without shelter. The ethics in these actions are inherent. That is what a positive sign has been disclosed from us. And I consider the paradox of hedonism necessarily to rediscover what as humans need to do for ourselves and the planet.</p><p>Maybe one day we will save the last child drowning from pollution.</p>", "parentCommentId": null, "user": {"username": "Felipe"}}, {"_id": "7E7TEyJSKJM8owjE9", "postedAt": "2020-04-09T09:08:00.096Z", "postId": "SwG8Tj9RkG8DzpM4f", "htmlBody": "<p>The expanding circle of ethics is a a good way to portray our ethics hierarchy that I had not come across before. I see this circle as moving, since some people include all animals, most people would include slaves now. But we do start with those closest to us and move into a wider circle. It is easier for us to help our self, family, community than the wider population, as the latter is more abstract and complicated. Furthermore, by reading this article and comments, it makes me think of part of a Terry Pratchett book where the main character talks of there being a noise in the street; by the fact that it is public, it is everyone&#x2019;s problem, and therefore nobody&#x2019;s problem. We think we have some responsibility to help more globally, but there are so many other people who we think will be or could be. Arguably it is also in our human nature to be self-interested, so unless we can see the harm to ourselves, we will in general be less likely to take positive action to help.</p>", "parentCommentId": null, "user": {"username": "Nic Tea"}}, {"_id": "QMz4K9wsF5QwtDJED", "postedAt": "2020-04-09T21:14:39.655Z", "postId": "SwG8Tj9RkG8DzpM4f", "htmlBody": "<p>I totally agree with you about the issue of abstract problems. Many issues are so nebulous and far-reaching that it is so difficult to give a clear overview of the issue, the implications etc. By the time climate change is a concrete threat to the majority of people, it will be too late. There is a lot of focus on short-term rewards, particularly in government but also with human&apos;s desires, that make dealing with these problems in an effective way very difficult. I spent a few years in China, and although it is very economically capitalist, the society has a communist mindset still and the government also has a lot of power to enact laws that the public don&apos;t like. Now I am not saying this is always a good thing, but idealistically speaking, when you have a good leader, who can think more long-term because they do not rely on the whims of people and being popular to those who are not looking at the bigger picture, this can be a good thing. It can help get helpful policies and initiatives through to tackle more abstract problems!</p>", "parentCommentId": "J7poM3feHLoFP4koE", "user": {"username": "Nic Tea"}}, {"_id": "fzpuXJRT34K763Q6v", "postedAt": "2020-04-15T08:08:39.612Z", "postId": "SwG8Tj9RkG8DzpM4f", "htmlBody": "<p>It&apos;s interesting - my first reaction to the question about the drowning child was &quot;NO&quot;, not because I wouldn&apos;t save them but because I wouldn&apos;t see it as an obligation. I wouldn&apos;t think about it at all, I would just do it as an instant reaction by following my human(e) instinct. It just seems that the word &quot;obligation&quot; would mean someone is telling me to do it (maybe our conscience or the society we live in and the influence it brings to our life and everyday choices).</p>", "parentCommentId": null, "user": {"username": "manonbertrand16"}}, {"_id": "QCJvE9qLGxj649yig", "postedAt": "2020-04-22T22:24:34.244Z", "postId": "SwG8Tj9RkG8DzpM4f", "htmlBody": "<html><head></head><body><p>There is a principle of economic sciences which explains that the needs are bigger than the resources, and the distribution of that resources on an effective way, its called economy per se. Based on that priciple or concept. I think is the root of this situation, because individually we don´t have a peak basically on what can fulfill our happiness, and persons like Mr. Boesky, unfortunately didn´t realize that and most of his life was focused on wanting more money to satisfy his external needs, but not the intangible ones, the ones with the highest value, like having more time to spend with his family, an activity that has no monetary value that he can buy.</p>\n</body></html>", "parentCommentId": null, "user": {"username": "Dromana1"}}, {"_id": "e4AM9yBzEvpDYYHz5", "postedAt": "2020-05-13T05:04:57.181Z", "postId": "SwG8Tj9RkG8DzpM4f", "htmlBody": "<p>I think it&apos;s important to refer back to text and philosophy in the strive towards altruism, but there is something to be said about the knowledge we gain from experience; life itself. I&apos;ve lived in Costa Rica for the past year, and I think altruism is what leads the locals in their daily lives, and life here is very simple, no frills, back to basics. </p><p>I&apos;ve had to forego the simple luxuries of the first world - fancy cheese, starbucks, vineyards, strip malls, being able to flush toiler paper(!), the list goes on. And farmer&apos;s markets here are the norm, and the most economically beneficial(for the buyer and seller) - not some sort of gentrified weekend exhibit to splurge on fancy jam, which is usually the case in a first-world, metropolitan area.</p><p>The adjustment, personally, was painful and it still is. I envy the locals for their ability to be so happy, so generous and so open, all of this held up without the backbone of consumerism. In my experience, people who are altruistic by nature - whether that be a derivative of their culture or upbringing, free of the usual burdens of consumerism and wealth-driven objectives, are much happier than those who are part of the contrary. </p>", "parentCommentId": null, "user": {"username": "bandy101"}}, {"_id": "Huj46d2o8RYFP3dBL", "postedAt": "2020-05-24T15:03:57.658Z", "postId": "SwG8Tj9RkG8DzpM4f", "htmlBody": "<p>It is an old article, so maybe a lot has already been said in other places, but at least not here in the comments. </p><p>I think the analogy with the child in the pond is good to show people that it doesn&apos;t matter whether the child is here in front of us or somewhere across the globe, but it doesn&apos;t really help with the situation we are in. Because in reality there are an almost limitless number of children in huge swamps every day on our way to university and if we were to try to save only a few of them every day we would never ever get to university or be able do anything else at all and we would quickly drown ourselves (at least that&apos;s what it feels like for many people).  So what do we do, we chose the different route to university not the one that goes trough the swamps but the one that goes trough lovely green meadows. Maybe some days we get up a bit earlier go trough the swamps save a child, maybe even two or three if we are effective... </p><p>But we feel no matter what we do, we are not doing much to solve the problem but because we are still involved we can&apos;t really forget what is happening and can&apos;t help to feel a sense of desperation which I think is obviously not making anyone happy. </p><p>But of course in reality it&apos;s not just you and all those drowning children, it&apos;s you and many many others that could help as well and it would motivate a lot if we could see each other. So maybe we just need to add a &quot;social&quot; in front of altruism. Of course it is easier said than done, but there are examples (teamtrees.org) comes to mind. And of course it also needs to be effective.</p>", "parentCommentId": null, "user": {"username": "simonstucki"}}, {"_id": "pECGpqkfxYr2Sps8C", "postedAt": "2020-06-17T19:35:08.620Z", "postId": "SwG8Tj9RkG8DzpM4f", "htmlBody": "<p>  Ssposso</p><p>I believe that being altruistic can be self-rewarding. But in the society in which I have  grown, studied and I&apos;m living, to renounce  the option  of ascending on the corporate scale or of succeeding if you own  a business, would indicate that you are bringing  and using effectively  all your capabilities , strength and knowledge to overcome in the endeavor .</p><p>This feeling of intrinsic vital failure, at least in my case, would be independent of the opinion of others. That is why I am firmly convinced  that it is  quite possible that our lifestyle  based on consumption, it doesn&apos;t entail  happiness but if we do not  use as much as feasible your abilities you will not be happy either.</p><p>That is why, in my opinion, altruistic activity and professionalism consumerism are not antagonists, they are different.</p><p>An altruist needs to be approved/admired by  his or her surroundings , or receiving the thanks of the beneficiary or being paid by  his her  own self-esteem.</p>", "parentCommentId": null, "user": {"username": "ssposso"}}, {"_id": "3Gvu8kGWrgpqDB5JJ", "postedAt": "2020-07-09T02:42:56.585Z", "postId": "SwG8Tj9RkG8DzpM4f", "htmlBody": "<p>thank you for such an interesting article. it made me think of some aspects I have considered from  the viewpoint of a guy who lives in a Central American country. The world has changed so much since the first and Second World Wars. After such turbulent first half of the XX century the world now looks suspiciously at any attempt to carry out any significant change; any change that may directly affect the established order. After all, the revolutionary movements of the  first half brought nothing but pain and suffering. So now it all goes down to deconstruct as much as you want but leave the structure untouched. </p><p>There is an image in the writing about people pulling out their credit card and sending money via organizations to help others somewhere else. Do not get me wrong, if there is a margin to help someone it should be done. My question is: Are we to be satified with simply pulling out our credit cards? Would that mean you still need to participate in the very same system that causes such damage and pain so that you can have the money to palliate its negative effects? Do we need to go through this phase first so that later we get to recognize the need to confront the very structure  that affects so many lives?  Are we trapped in a vicious cycle here? </p><p>Many activists in Latin America have been assassinated by hitmen paid by big corporations that only care for their benefits at the expense of nature and wild life, rivers, forests and the like. The system is not ethical. By sorting ourselves out through donations can we be sure we are having an impact not only on those people who would appreciate the helping hand but also on the system that brings so much suffering. Could we do more or not? If not, Are we in the need to leave behind all theories of conflict and face a world in which we tolerate the system? </p>", "parentCommentId": null, "user": {"username": "jano"}}, {"_id": "ZhrPP7qXwGrtRCmdi", "postedAt": "2020-10-30T10:51:14.920Z", "postId": "SwG8Tj9RkG8DzpM4f", "htmlBody": "<p>Greetings One and All\nNice just to see evidence of people taking the time to think about such things, as someone in mid 50s and having burned out several times from attempts to raise awareness and take non violent positive action at a local level on a wide range of ethical and environmental issues and having spent most of my adult life studying and exploring world religions, sociology and the human psyche in an attempt to understand the world and it's inhabitants, and despite having no children of my own being utterly dedicated to improving the possibilities for future generations, I am fast becoming utterly disillusioned to the point where I am starting to believe earth would be better off without human beings as they presently predominantly manifest. If change in the present predominant human psyche is even possible my overwhelming feeling is that is going to be too late for for the very things that gave this place/planet it's value and beauty. A shame and shameful. Especially the feind ignorance and apathy of  folks of my generation with children...\nBut here I am on Coursera, a wonderful gift to humanity, exploring ethical altruism with you all, testament to the spirit being a hard thing to kill...\nAs for the subject matter Mr Singer and co merit a jolly large pat on the back for engaging and getting us thinking, re the person who mentioned young folks now opting out of consumerism to experience, despite this still being a kind of consumerism for the haves, I can only suggest that, that the happiness and fulfilment spoken of only really comes from direct positive action. Actualising...</p>\n", "parentCommentId": null, "user": {"username": "wilcoxism"}}, {"_id": "6aehjz427uT7gjy9c", "postedAt": "2022-01-10T01:14:07.920Z", "postId": "SwG8Tj9RkG8DzpM4f", "htmlBody": "<p>As the <a href=\"https://forum.effectivealtruism.org/posts/JFiHewypFB2niuy2G/ea-forum-creative-writing-contest-usd22-000-in-prizes-for\">Creative Writing Contest</a> noted, Singer's drowing-child thought experiment \"probably did more to launch the EA movement than any other piece of writing\". &nbsp; The key elements of the story have spread far and wide -- when I was in high school in 2009, an English teacher of mine related the story to my class as part of a group discussion, years before I had ever heard of Effective Altruism or anything related to it. &nbsp;<br><br>Should this post be included in the decadal review? &nbsp;Certainly, its importance is undisputed. &nbsp;If anything, Singer's essay might be <i>too</i> well-known to merit inclusion in a decadal review, since its basic logic (that suffering far away still matters, and that suffering far away can sometimes be averted very cheaply) is essentially the starting-point through which almost all new EAs are introduced to the movement. &nbsp;It also might fail due to the technicality that the story was originally written in 1997, despite being reposted on our dear Forum in 2014.<br><br>Certainly there have been criticisms of the story, such as <a href=\"https://www.lesswrong.com/posts/cujpciCqNbawBihhQ/self-integrity-and-the-drowning-child\">Yudkowsky's here</a>. &nbsp;It seems a bit of a bait and switch to have the story be about diving into a pool (which only takes a few minutes and at most ruins a nice set of clothes), and then Singer says that we are all in the situation described due to the existence of charities like Against Malaria Foundation who can save a life for several thousand dollars (which even for most rich-world citizens is more like the hard-earned savings from several months' labor). &nbsp;But that is just nitpicking plot details -- the fundamentals of the story are sound.</p>", "parentCommentId": null, "user": {"username": "Jackson Wagner"}}, {"_id": "qAXsnM8AiJCE59kX5", "postedAt": "2022-01-19T22:07:05.544Z", "postId": "SwG8Tj9RkG8DzpM4f", "htmlBody": "<p>This framing of the “drowning child” experiment can best appeal to philosophy professors (as if hearing from a friend), so can be shared with this niche audience. Some popular versions include <a href=\"https://www.youtube.com/watch?v=onsIdBanynY\"><u>this video</u></a> (more neutral, appropriate to diverse age audiences) and <a href=\"https://www.youtube.com/watch?v=9EHnUsV1J2M\"><u>this video</u></a> (using younger audience marketing). This experiment should be used together with some more <a href=\"https://forum.effectivealtruism.org/posts/6dsrwxHtCgYfJNptp/the-world-is-much-better-the-world-is-awful-the-world-can-be\"><u>rational writing on high-impact opportunities</u></a> and <a href=\"https://forum.effectivealtruism.org/posts/EP6X362Q3ziibA99e/show-a-framework-for-shaping-your-talent-for-direct-work\"><u>engagement specifics</u></a> in order to motivate people to enjoy high-impact involvement.</p>", "parentCommentId": null, "user": {"username": "brb243"}}, {"_id": "kGLNse98LpB5vxJGg", "postedAt": "2022-03-29T05:02:44.891Z", "postId": "SwG8Tj9RkG8DzpM4f", "htmlBody": "<p>You really have to convince people that the need is there for that sense of fulfillment based on embracing altruism rather than taking the path of hedonism. You got so many people struggling these days being in the lower class, that they themselves want a taste of that luxury they could only dream about. Yet they have first-hand knowledge of what destitution is all about. It really does boil down to \"do you want to give up your toys so you can feed somebody you'll never meet in a region of the world you'll never visit?\" I know that seems cold and detached but it's the stark reality of life in a first world nation, a lot of people don't give two hoots about phantoms that nip at their conscience only when people bring it up as if the idea of helping people, rather than the self, should result in a big guilt trip. Yet we know collectively the middle and upper class make the biggest impact monetarily but its the top 5% of the world that own most of it. Your solution either lays in trying to convince a multitude to make a small effort, or several giants to finally buy into making the world a better place. To think that there are multiple billionaires in the world, yet it would only take a few of them to change the face of the planet.</p><p>This really boils down to, can you sell 'selflessness' as something worthy to strive for, over 'selfishness'.</p>", "parentCommentId": null, "user": {"username": "Henry Hamilton"}}, {"_id": "ySxbjm2EFdWYh6w65", "postedAt": "2022-05-18T04:35:17.013Z", "postId": "SwG8Tj9RkG8DzpM4f", "htmlBody": "<p>Singer makes a whole lot of sense in his argument. &nbsp;I enjoyed this reading and will certainly revisit it as I share the essence of a magnificent message that needs to be spread from one wing of the earth to the other wing in supporting those who are poor and in need.</p><p>Byron Brown</p>", "parentCommentId": null, "user": {"username": "mrbyronbrown@gmail.com"}}, {"_id": "o3vqyQzz9iDL2akqm", "postedAt": "2022-09-13T01:49:59.043Z", "postId": "SwG8Tj9RkG8DzpM4f", "htmlBody": "<p>The War in Ukraine has lead me to believe that certain countries such as Russia has no ethical boundaries. By willing to destroy and kill children and adults over territory while the world watches on TV is horrible.  This is an example of Putins self interest and there’s no power to help stop this war.</p>\n", "parentCommentId": null, "user": {"username": "Jbascome "}}, {"_id": "wq8Noyx73iBQBBCq6", "postedAt": "2020-10-31T19:46:21.443Z", "postId": "SwG8Tj9RkG8DzpM4f", "htmlBody": null, "parentCommentId": "u7DcocTfincqLFA8m", "user": null}]