[{"_id": "dviR3hjHH6HjgFbgM", "postedAt": "2015-05-14T15:39:45.024Z", "postId": "SwSH25XmigRSxHBvf", "htmlBody": "<p>It may be useful to find out how many people have this problem or find this solution useful. Does anyone share or not share it?</p>\n", "parentCommentId": null, "user": {"username": "Ervin"}}, {"_id": "iMyvzz8QbcjznGLDd", "postedAt": "2015-05-14T15:55:47.122Z", "postId": "SwSH25XmigRSxHBvf", "htmlBody": "<p>I don't.</p>\n", "parentCommentId": "dviR3hjHH6HjgFbgM", "user": {"username": "Vincent_deB"}}, {"_id": "tmE6cwn9EbTJsm3ht", "postedAt": "2015-05-14T18:42:35.471Z", "postId": "SwSH25XmigRSxHBvf", "htmlBody": "<p>I don't. There are people out there who do feel cripplingly emotionally burdened by the problems in the world, but they seem far outnumbered by those who don't.</p>\n", "parentCommentId": "dviR3hjHH6HjgFbgM", "user": {"username": "RyanCarey"}}, {"_id": "ftqLRgy5Dtmr68cgf", "postedAt": "2015-05-14T20:56:53.957Z", "postId": "SwSH25XmigRSxHBvf", "htmlBody": "<p>If this doesn't work: In my own experience and that of a few others these feelings disappear all by themselves over time.</p>\n", "parentCommentId": null, "user": null}, {"_id": "HT9k7n2nTwu43gQxD", "postedAt": "2015-05-15T04:27:18.389Z", "postId": "SwSH25XmigRSxHBvf", "htmlBody": "<p>Maybe something for the EA survey.</p>\n", "parentCommentId": "dviR3hjHH6HjgFbgM", "user": {"username": "Telofy"}}, {"_id": "bBRvsJrEwymPF2ZdZ", "postedAt": "2015-05-15T18:47:49.764Z", "postId": "SwSH25XmigRSxHBvf", "htmlBody": "<p>What ended up happening to me is similar to what's described in <a href=\"http://lesswrong.com/lw/1r9/shut_up_and_divide/\">this article</a>.  When a homeless person asks me for money, I immediately feel dismissive because I know others have it far worse than they do, and we have longer-term global problems that dwarf their suffering.</p>\n", "parentCommentId": null, "user": {"username": "xccf"}}, {"_id": "n3SF9S9HxZdsEnu2q", "postedAt": "2015-05-16T21:52:27.021Z", "postId": "SwSH25XmigRSxHBvf", "htmlBody": "<p>Nice piece! I have used techniques similar to this but personally haven't used them for a while.</p>\n<p>Also, the use of these techniques may contribute to a view that EA's are &quot;cold and clinical.&quot; This <a href=\"https://www.facebook.com/groups/effective.altruists/permalink/865509750172050/\">FB thread</a> on that accusation is relevant.   </p>\n", "parentCommentId": null, "user": {"username": "kierangreig"}}, {"_id": "johJDdaeHxJaPBTJB", "postedAt": "2015-05-17T09:59:31.884Z", "postId": "SwSH25XmigRSxHBvf", "htmlBody": "<p>These points seem very dangerous to me: </p>\n<blockquote>\n<p>Avoid images and videos unless you’re sure you can dissociate sufficiently. Academic prose is safer.\nDon’t visit the countries where you’re helping. There is great value in understanding the local conditions better to run better interventions, but the top charities and GiveWell are doing that already so you don’t have to.\nRelated to that, try not to get to know anyone you might be helping. The decision to donate someplace and not someplace else may consign some to death so others (and hopefully more) can live. It helps to not know either to make better decisions.</p>\n</blockquote>\n<p>As someone who's been on academia for 10 years, and intends to be for 10 more. It seems clear to me that academia fosters working on the wrong problems, and that academic prose, besides awfully written - see Pinker's Sense of Style on that - is unlikely to lead someone into fruitful EA behavior.</p>\n<p>Not visiting countries sounds equally dangerous to me. People with first world problems, and in my experience, especially Americans who didn't have luck in their parent's school choice, have an incredibly distorted sense of what day to day life is in the world. I'm not particularly talking about the suffering from which you are trying to get people to dissociate, but particularly about the scarcity of money. In NY, SF, Sweden etc... I've seen people considering the prices of some things &quot;reasonable&quot; that are unfathomable in a small city in the Brazilian jungle, the Syrian desert or the Bolivian mountains. The important thing for EAs in this case of course is not to feel bad for buying a book or a Chai, but to understand how tremendously valuable their money and money acquiring capacity is. </p>\n<p>Finally, not getting to know - at least a bit - who you are helping is a great way of being scammed, or, much worse, feeling paranoid of being scammed, or paralyzed into inaction by abstraction. </p>\n", "parentCommentId": null, "user": {"username": "Diego_Caleiro"}}, {"_id": "Q9mooFFpEntrPok9G", "postedAt": "2015-05-17T15:47:54.116Z", "postId": "SwSH25XmigRSxHBvf", "htmlBody": "<blockquote>\n<p>academic prose... is unlikely to lead someone into fruitful EA behavior.</p>\n</blockquote>\n<p>I think the strategy for motivating new people to join the EA movement should be different from the strategy for getting existing EAs to be more productive.</p>\n<blockquote>\n<p>The important thing for EAs in this case of course is not to feel bad for buying a book or a Chai, but to understand how tremendously valuable their money and money acquiring capacity is.</p>\n</blockquote>\n<p>This can be motivating.  But I think it can also prompt a &quot;penny wise, pound foolish&quot; attitude where you spend your finite attention optimizing small purchases rather than large career decisions.</p>\n<p>Your last paragraph presents a better case.  I'm not especially worried about Givewell scamming people, but I do remember seeing research suggesting that volunteers tend to donate more after they finish volunteering, and reading about the progress my favorite charities are making does seem to motivate me in my earning to give.</p>\n", "parentCommentId": "johJDdaeHxJaPBTJB", "user": {"username": "xccf"}}, {"_id": "JsSYEhjmAWdr27pMr", "postedAt": "2015-05-17T20:45:22.438Z", "postId": "SwSH25XmigRSxHBvf", "htmlBody": "<p>Thanks for your input. Please note that I’ve written this article for a specific kind of very emotionally empathetic person of which I’ve met maybe five or so (when I count myself). It’s terrible advice for all the people <em>The Life You Can Save</em> is written for. A bit in the spirit of <a href=\"http://slatestarcodex.com/2013/06/09/all-debates-are-bravery-debates/\">All Debates are Bravery Debates</a>, there are very different sorts of people out there, and some have to correct in the opposite direction as others.</p>\n<p>These people don’t have a terribly distorted view of their locational privilege, but still of course they will typically know little about the countries where they’re helping people. In order not to be scammed, they can rely on GiveWell, ACE, or invest into movement building.</p>\n", "parentCommentId": "johJDdaeHxJaPBTJB", "user": {"username": "Telofy"}}]