[{"_id": "L3vXihwCHFYqxCeSD", "postedAt": "2023-11-15T22:48:50.907Z", "postId": "SXEEDvqZwxaRGCmhj", "htmlBody": "<p>I suspect there would be less potential discouragement effect if you listed some grants that were just over the bar?</p>\n", "parentCommentId": null, "user": {"username": "casebash"}}, {"_id": "MKqkekHomSvLdXgbx", "postedAt": "2023-11-15T23:07:05.916Z", "postId": "SXEEDvqZwxaRGCmhj", "htmlBody": "<p>Does the LTFF ever counter-offer with an amount that would move the grant past the funding bar for cost-effectiveness? I would guess that some of these hypothetical applicants would accept a salary at 80% of what they applied for, and if the grants are already marginal then a 25% increase in cost-effectiveness could push them over the bar.</p>", "parentCommentId": null, "user": {"username": "Rubi"}}, {"_id": "3d7b5mKp6eriJhAgj", "postedAt": "2023-11-15T23:27:35.603Z", "postId": "SXEEDvqZwxaRGCmhj", "htmlBody": "<p>Grants that are just over the bar look pretty similar to these. I don't think there's a sharp drop-off in quality around the funding bar (though there has been in the past).</p>\n", "parentCommentId": "L3vXihwCHFYqxCeSD", "user": {"username": "calebp"}}, {"_id": "f3J7sdDP5vQKWMqxy", "postedAt": "2023-11-15T23:29:03.492Z", "postId": "SXEEDvqZwxaRGCmhj", "htmlBody": "<p>Yes, we do that fairly regularly. We haven't discussed people's counterfactual options above, but this often makes a 20% reduction in grant size unattractive.</p>\n", "parentCommentId": "MKqkekHomSvLdXgbx", "user": {"username": "calebp"}}, {"_id": "JDsuyGDT5DzemCJNo", "postedAt": "2023-11-15T23:42:33.250Z", "postId": "SXEEDvqZwxaRGCmhj", "htmlBody": "<p>That makes sense. However, I do think that showing that would be less discouraging for anyone around the bar, which are probably the people most important not to discourage (people significantly below would be wasting their time, people significantly above are more likely to be confident enough to apply).</p>", "parentCommentId": "3d7b5mKp6eriJhAgj", "user": {"username": "casebash"}}, {"_id": "j4LDvHgCpfrCGpzXZ", "postedAt": "2023-11-16T13:39:38.321Z", "postId": "SXEEDvqZwxaRGCmhj", "htmlBody": "<p><strong>Executive summary</strong>: The Long-Term Future Fund details fictional grants that provide insight into promising projects they would fund with additional donations.</p><p><strong>Key points</strong>:</p><ol><li>The fictional grants represent promising applications the LTFF regrettably turned down recently due to insufficient funding.</li><li>The grants cover areas like AI safety research, career transitions into AI safety, and influencing investors and policymakers on AI governance.</li><li>Additional donations to the LTFF would likely fund projects similar to these fictional grants.</li><li>The post invites discussion on these grants and encourages those who find them promising to consider donating.</li><li>Open Philanthropy is matching donations to the LTFF 2:1 up to $1.75 million from donors.</li><li>The LTFF welcomes questions from potential applicants and donors.</li></ol><p>&nbsp;</p><p><i>This comment was auto-generated by the EA Forum Team. Feel free to point out issues with this summary by replying to the comment, and</i><a href=\"https://forum.effectivealtruism.org/contact\"><i>&nbsp;<u>contact us</u></i></a><i> if you have feedback.</i></p>", "parentCommentId": null, "user": {"username": "SummaryBot"}}, {"_id": "8Dw86EgWyHcGZnWFr", "postedAt": "2023-11-16T13:50:21.167Z", "postId": "SXEEDvqZwxaRGCmhj", "htmlBody": "<p>I guess the framing of the post is pretty relevant: these projects <i>would</i> be over the bar if the LTFF got more donations. (Although I appreciate it being important to avoid discouraging people.)&nbsp;</p><p>I might also flag that I don't <i>think</i> getting rejected generally has costs besides the time you put in and your motivation (someone from LTFF could correct me if I'm wrong). So <a href=\"https://forum.effectivealtruism.org/posts/4tsWDEXkhincu7HLb/things-i-often-tell-people-about-applying-to-ea-funds#Apply_\">applying</a> is often worth it even if you think it's pretty likely that you'll get rejected. This isn't to say that rejection is hard; <a href=\"https://forum.effectivealtruism.org/posts/AXCnNJTQXeAY4jnsw/rejection-thread-stories-and-tips\">here's a thread</a> with tips and others' experiences. But it seems that \"<a href=\"https://forum.effectivealtruism.org/posts/Fahv9knHhPi6pWPEB/don-t-think-just-apply-usually\">Don't think, just apply (usually)!</a>\" is pretty good advice.&nbsp;</p>", "parentCommentId": "JDsuyGDT5DzemCJNo", "user": {"username": "Lizka"}}, {"_id": "yehwzDQqQPLDM2Kfk", "postedAt": "2023-11-16T23:42:49.404Z", "postId": "SXEEDvqZwxaRGCmhj", "htmlBody": "<p>I think the intent was primarily to speak to potential donors, for whom \"these are sample grants like those that would be filled with your marginal donation dollar this giving season\" is probably more actionable/motivating.</p>\n", "parentCommentId": "JDsuyGDT5DzemCJNo", "user": {"username": "Jason"}}, {"_id": "D4AfnNQeakyJaFnhS", "postedAt": "2023-11-16T23:49:39.651Z", "postId": "SXEEDvqZwxaRGCmhj", "htmlBody": "<blockquote><p>people significantly above are more likely to be confident enough to apply</p></blockquote><p>I think this is directionally true but overstated; my impression is that most people are just pretty uncalibrated about this sort of thing.</p>", "parentCommentId": "JDsuyGDT5DzemCJNo", "user": {"username": "Linch"}}, {"_id": "6f2qJgXB6vrncGc6d", "postedAt": "2023-11-16T23:51:38.376Z", "postId": "SXEEDvqZwxaRGCmhj", "htmlBody": "<p>I mean, obviously it has non-zero costs from our end for us to evaluate applications. But I think applicants should basically not take that into account when applying; it's very easy for people to be overly scrupulous when deciding whether to apply. I almost always appreciate more applications for helping us make better informed decisions, and for improving the mean quality of grants that we do fund.</p>", "parentCommentId": "8Dw86EgWyHcGZnWFr", "user": {"username": "Linch"}}, {"_id": "jxmz9eyu3rfsjEB9u", "postedAt": "2023-12-30T03:13:07.777Z", "postId": "SXEEDvqZwxaRGCmhj", "htmlBody": "<p>I wonder if LTFF has tried running a Kaggle competition for grant success vs grant rejection? I think this would be quite interesting for people looking to apply for grants as we could gain some idea of the likelihood of success or failure of applications before submitting and it would allow applicants to modify the grant until it looks promising</p>", "parentCommentId": null, "user": {"username": "Darkness8i8"}}, {"_id": "6MzSqeu4uisoorKer", "postedAt": "2023-12-30T03:50:43.491Z", "postId": "SXEEDvqZwxaRGCmhj", "htmlBody": "<p>Hmm, we've accepted less than a thousand applications in our entire history, so I think a data science competition is massively overkill.&nbsp;</p><p>Also there's the Goodharting worries.</p>", "parentCommentId": "jxmz9eyu3rfsjEB9u", "user": {"username": "Linch"}}]