[{"_id": "TNmCtNyYSccYw2cyQ", "postedAt": "2018-05-26T10:32:11.401Z", "postId": "SYymYwgT89wcZBPYr", "htmlBody": "<p>Thanks for this detailed analysis. I think that the main difference in our estimations is the number of adopters, which is 1.3 percent in your average case. In my estimation, it was almost a half of the world population. </p>\n<p>This difference highlights the important problem: how to make really good life-extending intervention widely adopted. This question is related not only to metformin, but for any other interventions, including now known interventions such as sport, healthy diet and quitting smoking, which all depends on a person's will. </p>\n<p>Taking a pill will require fewer efforts than quitting smoking, and around 70 percent of US adult population is taking some form of supplements. <a href=\"https://www.nutraceuticalsworld.com/contents/view_online-exclusives/2016-10-31/over-170-million-americans-take-dietary-supplements/\">https://www.nutraceuticalsworld.com/contents/view_online-exclusives/2016-10-31/over-170-million-americans-take-dietary-supplements/</a></p>\n<p>However, supplements market depends on expensive advertising, not on real benefits of the supplements.</p>\n", "parentCommentId": null, "user": {"username": "turchin"}}, {"_id": "ednqH6fCKkaLiEAXQ", "postedAt": "2018-05-27T00:01:16.311Z", "postId": "SYymYwgT89wcZBPYr", "htmlBody": "<p>Metformin isn't a supplement though. It's unlikely it would ever get approved as a supplement or OTC, especially given that it has serious side effects. </p>\n", "parentCommentId": "TNmCtNyYSccYw2cyQ", "user": {"username": "Lila"}}, {"_id": "HbEcgS7MtTggqRpsT", "postedAt": "2018-05-27T10:08:03.876Z", "postId": "SYymYwgT89wcZBPYr", "htmlBody": "<p>That is why I think that we should divide discussion in two lines: One is the potential impact of simple interventions in life extension, which are many, and another is, is it possible that metformin will be such simple intervention.</p>\n<p>In case of metformin, there is a tendency to prescribe it to the larger share of the population, as a first line drug of diabetes 2, but I think that its safety should be personalized by some genetic tests and bloodwork for vitamin deficiency.</p>\n<p>Around 30 mln people in US or 10 per cent of the population already have diabetes 2 (<a href=\"https://www.healthline.com/health/type-2-diabetes/statistics\">https://www.healthline.com/health/type-2-diabetes/statistics</a>) and this population share is eligible for metformin prescriptions. </p>\n<p>This means that we could get large life expecting benefits replacing prescription drugs not associated with longevity - with longevity associated drugs for the same condition, like metformin for diabetes, lazortan for hypertension, aspirin for blood thining etc.</p>\n", "parentCommentId": "ednqH6fCKkaLiEAXQ", "user": {"username": "turchin"}}, {"_id": "Bw5s49uqrWoadMqBm", "postedAt": "2018-05-28T09:06:17.650Z", "postId": "SYymYwgT89wcZBPYr", "htmlBody": "<p>Interesting Analysis! \nSince you already have confidence intervals for a lot of your models factors, using the guesstimate web tool to get a more detailed idea of the uncertainty in the final estimate might be helpful, since some bayesian discounting based on estimate's uncertainty might be a sensible thing to do. (<a href=\"https://www.lesswrong.com/posts/5gQLrJr2yhPzMCcni/the-optimizer-s-curse-and-how-to-beat-it\">https://www.lesswrong.com/posts/5gQLrJr2yhPzMCcni/the-optimizer-s-curse-and-how-to-beat-it</a>)</p>\n<p>It might also make sense to make your ethical assumptions more explicit in the beginning (<a href=\"https://www.givewell.org/how-we-work/our-criteria/cost-effectiveness/comparing-moral-weights)\">https://www.givewell.org/how-we-work/our-criteria/cost-effectiveness/comparing-moral-weights)</a>, especially since the case against aging seems to be less intuitive than most of givewells interventions.</p>\n", "parentCommentId": null, "user": {"username": "Flodorner"}}, {"_id": "HwKaawyaRHPsxMdLW", "postedAt": "2018-05-28T22:03:05.502Z", "postId": "SYymYwgT89wcZBPYr", "htmlBody": "<p>Thank you for the feedback! </p>\n<p>I'm still learning and comments really help me to be more accurate and they steepen my learning curve. I set up a Guesstimate model (<a href=\"https://www.getguesstimate.com/models/10848)\">https://www.getguesstimate.com/models/10848)</a>. I didn't know about this tool, it is really helpful! </p>\n<p>Tomorrow I will improve the guesstimate and get back to you with another comment regarding the bayesian discounting you proposed and the moral weights. I also might make other changes to the evaluation together with the ones you suggested, especially considering that Guesstimate lets me toy with probability distributions. </p>\n", "parentCommentId": "Bw5s49uqrWoadMqBm", "user": {"username": "Emanuele_Ascani"}}, {"_id": "dpcAnxSdxGCnCPAii", "postedAt": "2018-05-29T11:13:54.177Z", "postId": "SYymYwgT89wcZBPYr", "htmlBody": "<p>Here how I would reason about moral weights in this case:</p>\n<p>In this case the definition of a &quot;life saved&quot; is pretty different than what normally means. Normally a life saved means 30 to 80 DALYs averted, depending if the intervention is on adults or children. In this case we are talking about potentially thousands of DALYs averted, so a life saved should count more. On the other hand there's also to take into consideration that when saving, for example, children who would have died of malaria, you are also giving them a chance of reaching LEV. It's not a full chance as in the present evaluation, but something probably ranging from 30% to 70%.</p>\n<p>Additional consideration: some people may want to consider children more important to save than adults. Introducing age weighting and time discounting could seem reasonable in this case, since even if you save 5000 DALYs you are only saving one person, so you might want to discount DALYs saved later in life. On the other hand there are reasons to disagree with this approach: Saving an old person and guaranteeing him/her to reach LEV means also &quot;saving a library&quot;. A vast amount of knowledge and experience, especially future experience would have been otherwise completely destroyed. In fact I am not so sure I would apply time discounting myself for this reason. </p>\n<p>Regarding bayesian discounting:</p>\n<p>I just read how GiveWell would go about this (<a href=\"https://blog.givewell.org/2011/08/18/why-we-cant-take-expected-value-estimates-literally-even-when-theyre-unbiased/)\">https://blog.givewell.org/2011/08/18/why-we-cant-take-expected-value-estimates-literally-even-when-theyre-unbiased/)</a>. To account for it I would need a prior distribution (or more than one?). I also have difficulty making the calculation, since Guesstimate doesn't let me calculate the variance of the random variables. I will try with other means... maybe with smaller data sets and proceeding by hand or using online calculators.</p>\n<p>I would also like to introduce probability distributions in the whole analysis and turn some arguments made in the explanations of some variables in variables in their own right, and I would like to add some more informations (for example the safety profile and history of metformin and the value of information of the trial) based on feedback I'm receiving. This would mean rewriting many sections though, and this will require time.</p>\n<p>For now I put an &quot;Edit&quot; at the beginning in order to warn readers not to take the numbers reached too seriously, but I invited them to delve in some more broadly applicable ideas I presented in the analysis that could be useful for evaluating many interventions in the cause area of aging.</p>\n", "parentCommentId": "Bw5s49uqrWoadMqBm", "user": {"username": "Emanuele_Ascani"}}, {"_id": "JTD7wEeLWKuBrqFML", "postedAt": "2018-05-29T12:52:26.586Z", "postId": "SYymYwgT89wcZBPYr", "htmlBody": "<p>I think, it might be best to just report confidence intervals for your final estimates (guesstimate should give you those). Then everyone can combine your estimates with their own priors on general intervention's effectiveness and thereby potentially correct for the high levels of uncertainty (at least in a crude way by estimating the variance from the confidence intervals). </p>\n<p>The variance of X can be defined as E[X^2]-E[X]^2, which should not be hard to implement in Guesstimate. However, i am not sure, whether or not having the variance yields to more accurate updating, than having a confidence interval. Optimally you'd have the full distribution, but i am not sure, whether anyone will actually do the maths to update from there. (But they could get it roughly from your guesstimate model).</p>\n<p>I might comment more on some details and the moral assumptions, if i find the time for it soon.</p>\n", "parentCommentId": "dpcAnxSdxGCnCPAii", "user": {"username": "Flodorner"}}, {"_id": "mGHKoTbhuNKihds83", "postedAt": "2018-05-29T16:09:31.824Z", "postId": "SYymYwgT89wcZBPYr", "htmlBody": "<p>Thank you, I applied your suggestion by modifying the text. I just noticed that Guesstimate gives you the standard deviation. I guess I had to familiarise with the tool.</p>\n", "parentCommentId": "JTD7wEeLWKuBrqFML", "user": {"username": "Emanuele_Ascani"}}, {"_id": "9Y9RNieStq6KYM3fQ", "postedAt": "2019-01-29T23:47:14.071Z", "postId": "SYymYwgT89wcZBPYr", "htmlBody": "<p>Hi Emanuele,</p><p>I saw your request for commentary on Facebook, so here are some off-the-cuff comments (about 1 hour&#x27;s worth so take with appropriate grains of salt, but summarizing prior thinking):</p><p></p><ul><li>My prior take on metformin was that it seems promising for its space (albeit with mixed evidence, and prior longevity drug development efforts haven&#x27;t panned out, but the returns would be very high for medical research if true), although overall the space looks less promising than x-risk reduction to me; the following comments will be about details of the analysis where I would currently differ</li><li>The suggestion of this trial moving forward LEV by 3+ years through an icebreaker effect boosting research looks wildly implausible to me</li><ul><li>LEV is not mainly bottlenecked on &#x27;research on aging,&#x27; e.g. de Grey&#x27;s proposals require radical advances in generally medically applicable stem cell and genetic engineering technologies that already receive massive funding and are quite challenging; the ability to replace diseased cells with genetically engineered stem cell derived tissues is already a major priority, and curing cancer is a small subset of SENS</li><li>Much of the expected gain in biomedical technology is not driven by shifts within biology, and advances within a particular medical field are heavily driven by broader improvements (e.g. computers, CRISPR, genome sequencing, PCR, etc); if LEV is far off and heavily dependent on other areas, then developments in other fields will make it comparatively easy for aging research to benefit from &#x27;catch up growth&#x27; reducing the expected value of immediate speedup (almost all of which would have washed away if LEV happens in the latter half of the century)</li><li>In particular, if automating R&amp;D with AI is easier than LEV, and would moot prior biomedical research, then that adds an additional discount factor; I would bet that this happens before LEV through biomedical research</li><li>Getting approval to treat &#x27;aging&#x27; isn&#x27;t actually particularly helpful relative to approval for &#x27;diseases of aging&#x27; since all-cause mortality requires larger trials and we don&#x27;t have great aging biomarkers; and the NIH has taken steps in that direction regardless</li><li>Similar stories have been told about other developments and experiments, which haven&#x27;t had massive icebreaker effects</li><li>Combined, these effects look like they cost a couple orders of magnitude </li></ul><li>From my current epistemic state the expected # of years added by metformin looks too high</li><li>Re  the Guesstimate model the statistical power of the trial is tightly tied to effect size; the larger the effect size the fewer people you need to show results; that raises the returns of small trials, but means you have diminishing returns for larger ones (you are spending more money to detect smaller effects so marginal cost-effectiveness goes a lot lower than average cost-effectiveness, reflecting high VOI of testing the more extravagant possibility)</li><li>Likewise the proportion using metformin conditional on a positive result is also correlated with effect size (which raises average EV, but shifts marginal EV lower proportionate to average EV); also the proportion of users seems too low to me conditional on success</li></ul><p></p>", "parentCommentId": null, "user": {"username": "CarlShulman"}}, {"_id": "thCHvyoBXARQzQujr", "postedAt": "2019-02-01T22:09:37.420Z", "postId": "SYymYwgT89wcZBPYr", "htmlBody": "<p>Hey! Thanks for the comment! I really appreciate it. For some reason I&#x27;m only seeing it now and by chance. I don&#x27;t know if I didn&#x27;t get the notification or if I missed it.</p><p>I&#x27;m not sure if this is the post I was asking feedback for though. This analysis is from nine months ago, and my views on it changed. On Facebook I was probably referring to this other post I made recently: <a href=\"https://forum.effectivealtruism.org/posts/jYMdWskbrTWFXG6dH/a-general-framework-for-evaluating-aging-research-part-1\">A general framework for evaluating aging research. Part 1: reasoning with Longevity Escape Velocity</a>. [EDIT: I just saw you made a comment under that post too, so never mind].</p><p>Regarding the content of your comment: I agree with most of it. In fact 3.6 years is probably a big overestimation. However, I still think, in general, that bringing LEV forward could be a big contributor to the cost-effectiveness of aging research in general. In my newer post I lay your same arguments about improving technology that may subsume the effect of today&#x27;s research, making it less cost-effective. This factor also influences variable E in the TAME analysis, which I also probably vastly overestimated. For the very specific case of AI potentially automating R&amp;D I think the timeline is longer than for LEV achieved through biomedical research (I&#x27;m taking the view that arises from the probability distribution given by AI researchers), but, as you said, it&#x27;s not the only technology that would make some of the efforts made now less useful.</p><p>Maybe I&#x27;m still less &quot;pessimistic&quot; than you in the sense that I think that an ice-breaking effect could enable more research on what are neglected facets of aging for which treatments could be devised much more quickly. The foundational research is not very neglected, while there are wide areas of translational research that could use much more funding and that are necessary to reach the final goal. From the lifespan.io&#x27;s <a href=\"https://www.lifespan.io/the-rejuvenation-roadmap/\">Rejuvenation Roadmap</a> you should get a preliminary idea.</p><p>Your example using the SENS approach is correct: areas like stem cell research and cancer research don&#x27;t seem to be underfunded. But they are only two pieces of the puzzle. Some others are being much more neglected. That&#x27;s why SENS itself gives higher priority to the most neglected areas, like mitochondrial dysfunction and crosslinks, which should be also more tractable (an interesting fact is that Aubrey de Grey often emphasises neglectedness, tractability and scope in his conferences, but I haven&#x27;t heard anyone within EA pointing this out). If stem cells research, cancer and other difficult and highly funded areas were all there is to aging research, it wouldn&#x27;t look like a very good candidate EA cause. In fact, not only de Grey but many researchers in the area are pursuing projects they believe are very much funding constrained (example: <a href=\"https://www.leafscience.org/steve-horvath-interview/\">Steve Horvath</a>).</p><p>About the comparison with x-risk reduction: Yes, I broadly agree that x-risk reduction looks overall more promising as a cause area. However I think that many x-risk focused interventions have a higher level of uncertainty. It also seems that within Effective Altruism little to no effort has been made to evaluate aging research, while, to me, it looks highly competitive with many of the other focuses of EAs (some specific interventions inside aging research should be very recognisably better). So it should be analysed further, especially because we may be missing out on especially important opportunities.</p><p>Regarding the expected number of years added by metformin: I think &quot;one year&quot; is a very conservative number given the evidence I&#x27;ve presented, and you&#x27;ll often hear researchers estimating more. </p><p></p>", "parentCommentId": "9Y9RNieStq6KYM3fQ", "user": {"username": "Emanuele_Ascani"}}, {"_id": "d4CoMC4j6bCJNG3PF", "postedAt": "2019-09-16T11:22:15.659Z", "postId": "SYymYwgT89wcZBPYr", "htmlBody": "<p>TAME study got needed funding from a private donor:</p><p>&quot;After closing the final $40m of its required $75m budget with a donation from a private source, the first drug trial directly targeting aging is set to begin at the end of this year, lead researcher <strong><a href=\"http://www.einstein.yu.edu/faculty/484/nir-barzilai/\">Dr Nir Barzilai</a> </strong>has revealed.&quot;</p><p><a href=\"https://www.fightaging.org/archives/2019/09/tame-trial-for-the-effects-of-metformin-in-humans-to-proceed-this-year/\">https://www.fightaging.org/archives/2019/09/tame-trial-for-the-effects-of-metformin-in-humans-to-proceed-this-year/</a></p>", "parentCommentId": null, "user": {"username": "avturchin"}}, {"_id": "pmHbQyPeXLDHxdga6", "postedAt": "2019-09-16T12:48:00.473Z", "postId": "SYymYwgT89wcZBPYr", "htmlBody": "<p>Thanks, great info. This post is officially outdated :)</p>", "parentCommentId": "d4CoMC4j6bCJNG3PF", "user": {"username": "Emanuele_Ascani"}}, {"_id": "3E2b6Fw5TufBymyFA", "postedAt": "2019-09-16T13:07:47.956Z", "postId": "SYymYwgT89wcZBPYr", "htmlBody": "<p>I think that there are other cost-effective interventions in life extension, including research in geroprotectors combinations and brain plastination.</p>", "parentCommentId": "pmHbQyPeXLDHxdga6", "user": {"username": "avturchin"}}]