[{"_id": "FJ3SMW7AnvLmTK3Kj", "postedAt": "2023-07-31T16:05:36.142Z", "postId": "SZ6reaQ2HkABAcY2N", "htmlBody": "<p>&lt;&lt;Founder salaries of CE charities are very modest compared to other parts of the EA ecosystem and the first-year salary is lean.&gt;&gt;</p>\n<p>Is there a reason not to put an estimated range on this? I'm guessing it would be funding-dependent, and maybe to an extent candidate-dependent. But if you know it's almost certainly not going to be higher than X, probably better to say that upfront.</p>\n", "parentCommentId": null, "user": {"username": "Jason"}}, {"_id": "AX2aXpKWnWDAoEd7w", "postedAt": "2023-07-31T18:42:15.167Z", "postId": "SZ6reaQ2HkABAcY2N", "htmlBody": "<p>Nice stuff! In particular I think “Finalists will also get to talk to other incubatees from that cohort about what it was like to work with your future co-founder” is an excellent feature.</p>\n", "parentCommentId": null, "user": {"username": "Aidan Alexander"}}, {"_id": "viDL6KjDq9DkrX2GX", "postedAt": "2023-07-31T18:50:42.589Z", "postId": "SZ6reaQ2HkABAcY2N", "htmlBody": "<p>To my knowledge the highest co-founder salary that has been asked of the seed funders was 54k, but even then I don't what they did in practice. Most asks that I've seen are 25k - 45k. Again, what co-founders actually ended up doing in practice after the figured out the amount of seed funding received is a different Q.&nbsp;</p><p>&nbsp;</p><p>Revised to say 54k (previously said 51k)</p><p>&nbsp;</p><p>Also want to flag for people skimming this quickly that this is just 1st year salary. The one example I know off the top of my head was a founder bumping their salary up 20k for the second year&nbsp;</p><p>&nbsp;</p><p>Revised to say that these are the asks that \"I've seen\" that way people don't take what i'm saying as definitive/exhaustive. Joey has more exposure than me and he says \"40-60k\" although unclear if this is seed funding salary asks or current founder salaries.</p>", "parentCommentId": "FJ3SMW7AnvLmTK3Kj", "user": {"username": "Yelnats T.J."}}, {"_id": "vfkMEypLkSu6DrowC", "postedAt": "2023-07-31T19:20:06.304Z", "postId": "SZ6reaQ2HkABAcY2N", "htmlBody": "<p>Is that GBP or USD?</p>\n", "parentCommentId": "viDL6KjDq9DkrX2GX", "user": {"username": "Sam Glover"}}, {"_id": "hxFuWpb38mEbkATnY", "postedAt": "2023-07-31T19:44:46.991Z", "postId": "SZ6reaQ2HkABAcY2N", "htmlBody": "<p>USD</p>\n", "parentCommentId": "vfkMEypLkSu6DrowC", "user": {"username": "Yelnats T.J."}}, {"_id": "SAFCGZSdukF3DFnTq", "postedAt": "2023-07-31T21:00:30.782Z", "postId": "SZ6reaQ2HkABAcY2N", "htmlBody": "<p>Thanks!</p><p>(As an aside, I wonder if the existence of low-salary-for-role positions like this one creates an opportunity in some cases for a donor with interests in diversifying EA. Totally not CE's fault, but that salary range is more likely to be a hinderance for a candidate who comes from a less socioeconomically advantaged background, who has financial responsibility for dependents, etc. So I could see a potential angle here for a donor interested in diversifying EA -- achieving both that meta impact as well as generating some object-level impact by offering a supplement for certain early stage EAs in low-salary / high-upside positions.)</p>", "parentCommentId": "viDL6KjDq9DkrX2GX", "user": {"username": "Jason"}}, {"_id": "ZFvM7fYwvJnRWwweb", "postedAt": "2023-07-31T22:43:16.245Z", "postId": "SZ6reaQ2HkABAcY2N", "htmlBody": "<p>Even separately from equity concerns, an optimal funding structure would pay higher salaries to more impactful roles, and CE incubatee is one of the most impactful roles, so a salary range like this just can't be optimal.</p>\n", "parentCommentId": "SAFCGZSdukF3DFnTq", "user": {"username": "therealslimkt"}}, {"_id": "Pe36JLSqBE42dxmvN", "postedAt": "2023-07-31T23:37:01.399Z", "postId": "SZ6reaQ2HkABAcY2N", "htmlBody": "<p>As a principle I'd like to see impactful roles be more compensated than non-impactful roles e.g. a marketing position figuring out how to sell more sugary beverages to kids shouldn't be more rewarded than someone trying to solve a problem.<br>&nbsp;</p><p>Re: \"a salary range like this just can't be optimal\"<br>Joey (co-founder of CE) had this to say about it in CE's AMA:<br><a href=\"https://forum.effectivealtruism.org/posts/xnHnsrFEMEMPXBWqR/ask-charity-entrepreneurship-anything?commentId=w93Smttpwa8eKboT7\">https://forum.effectivealtruism.org/posts/xnHnsrFEMEMPXBWqR/ask-charity-entrepreneurship-anything?commentId=w93Smttpwa8eKboT7</a><br><br>My two cents:<br>As I mentioned in the post, a co-founding and an intervention are an experimental product. Only about a 1/3 of CE charities will go onto be stellar. So the ETG seed funders don't want spend 80k on a nice salary for a founder that isn't fully proven yet and org that might go bust in a year.</p><p>You can also launch more charities (i.e. experiments) per year the more people can take a lower salary (and co-founder salaries are the biggest line item of seed budgets).</p><p>That being said my personal opinion is there can be too much of a race to the bottom dynamic with salaries that leaves some founders in their first year might feel financial stress or save money by not spending on convivences and things that have an ROI for annual productivity. (but to be fair I haven't founded a charity yet, maybe some other alums will disagree).</p><p><br>It should be noted that some CE founders did a significant bump in their salaries in their second year following a successful fundraising round.</p>", "parentCommentId": "ZFvM7fYwvJnRWwweb", "user": {"username": "Yelnats T.J."}}, {"_id": "LayGjzMSbgQahFKgj", "postedAt": "2023-07-31T23:56:47.211Z", "postId": "SZ6reaQ2HkABAcY2N", "htmlBody": "<p>It's a good point that low salaries are temporary, but people have liquidity needs that can definitely <a href=\"https://academic.oup.com/qje/article/134/4/2203/5522614\">affect job choice</a>. And maybe CE has private information on the talent pool, but I suspect that selection bias is a bit harder to overcome than just surveying people, and lots of people wouldn't give the program a second look, let alone communicating their salary dissatisfaction to CE.</p>\n<p>Even if only 1/3 of founders go on to be stellar, the quoted range seems like less than 1/3 of the social optimum for a stellar founder!</p>\n", "parentCommentId": "Pe36JLSqBE42dxmvN", "user": {"username": "therealslimkt"}}, {"_id": "AqGfEcPLr5dumDAkf", "postedAt": "2023-08-01T00:58:48.886Z", "postId": "SZ6reaQ2HkABAcY2N", "htmlBody": "<p>Joey's comment was in respect to a $40K-$60K range, which is considerably different than $25K-$45K.</p><p>I totally get the economic realities of the situation, but I think it's unavoidable that low salaries are going to be a dealbreaker for <i>some </i>highly-qualified candidates. For example, where I live, childcare for one young child is ~ $25K, so this would be a non-starter for many people with a young child (unless, e.g., a co-parent/partner made enough money to largely support the household solo).</p>", "parentCommentId": "Pe36JLSqBE42dxmvN", "user": {"username": "Jason"}}, {"_id": "fRiaeWgwZLB6XgmsW", "postedAt": "2023-08-01T01:16:21.021Z", "postId": "SZ6reaQ2HkABAcY2N", "htmlBody": "<p>I was referencing the comment for this:\n\"We are a bit skeptical about the perception that talent increases from offering higher salaries (instead of attracting new talent, we typically see the same EA people getting job roles but just for a higher cost). \"</p>\n<p>My understanding is that the 40-60k figure is for CE itself not the founders of CE charities.</p>\n<p>Yah I'm not opposed to better compensation for founders. Note: founders with more needs have asked for more before. How the seed funders have considered that is opaque though.</p>\n", "parentCommentId": "AqGfEcPLr5dumDAkf", "user": {"username": "Yelnats T.J."}}, {"_id": "CZFdWtiuEYpzpwPPy", "postedAt": "2023-08-01T01:25:42.926Z", "postId": "SZ6reaQ2HkABAcY2N", "htmlBody": "<p>Yah I think these are reasonable points</p>\n", "parentCommentId": "LayGjzMSbgQahFKgj", "user": {"username": "Yelnats T.J."}}, {"_id": "Q6ArBdNuYkjuBGs2i", "postedAt": "2023-08-01T01:48:07.000Z", "postId": "SZ6reaQ2HkABAcY2N", "htmlBody": "<p>Agree that the comment was in response to a question about salaries at CE itself. However, I think the reference to \"offering higher salaries\" most naturally points back to the 40K-60K range identified in a preceding sentence. I wouldn't read it as necessarily applicable to a lower range.</p>\n<p>The opacity about funding for people with higher needs is unfortunate. It's understandable that people would be hesitant to invest all that time -- especially if going through the incubation program -- without first getting some more clarity on that point. It also would suck for CE and other members of the cohort for someone in the incubation program to have to drop over this issue rather than drop much earlier.</p>\n", "parentCommentId": "fRiaeWgwZLB6XgmsW", "user": {"username": "Jason"}}, {"_id": "96Zx7pGz66HLiJkyd", "postedAt": "2023-08-01T01:56:20.314Z", "postId": "SZ6reaQ2HkABAcY2N", "htmlBody": "<p>I don't know what the right salary for founders is. But I feel like your statement has a missing mood. From your tone I expected a salary range similar to <a href=\"https://www.lesswrong.com/posts/eR7Su77N2nK3e5YRZ/the-lesswrong-team-is-now-lightcone-infrastructure-come-work-3#:~:text=about%20working%20here.-,Our%20current%20salary%20policy%20is%20to%20pay%20rates%20competitive%20with%20industry%20salary%20minus%2030%25.,-Given%20prevailing%20salary\">lightcone</a>- a substantial haircut from free market wages, but not a dramatic shift in the kind of life you're able to have. But $25k-$45k is a major sacrifice, prohibitively so for many very reasonable circumstances.</p><p>&nbsp;Maybe you're okay with losing those founders and the benefits make up for it, but I think the appropriate mood is \"it's sad funders won't cover more, and we accept that this will lose us a lot of people\". And in practice it seems like you're not getting enough applicants&nbsp;</p><p>And I suspect it is costing you a lot of people, who either you're not sampling or aren't accurately reporting their preferences. I personally wouldn't rule out working at those wages in absolutely every circumstance (and I'm currently working at 1/10th of my normal fee, because I care about the project), but my default interpretation is someone doesn't value the role or my work very much. And the potential of earning up to $80k, with no compensation for the risk, doesn't change that.&nbsp;</p><p>I still don't know what the right salary is. I suspect there are a lot of other factors that haven't been brought up yet that make the salary more reasonable, like an expectation founders will live in very low COL areas. But I would like the sacrifice level of the salary to be explicit common knowledge.&nbsp;<br><br>&nbsp;</p>", "parentCommentId": "Pe36JLSqBE42dxmvN", "user": {"username": "Elizabeth"}}, {"_id": "2KtkmdSiytkLLmK5N", "postedAt": "2023-08-01T02:33:09.209Z", "postId": "SZ6reaQ2HkABAcY2N", "htmlBody": "<p>To be clear I am not CE staff or a seed funder. I don't make decisions regarding how much is doled out or the culture upstream of those decisions. I'm an incubatee focused on the co-founder search here. Yes, I'd like to see more funding, but I'm not gonna benefit by railing here against a group of people who I don't know and don't know their circumstances or reasoning in their decision making.</p>\n<p>Also worth noting most CE charity founders are not American. The range is much more manageable for other people around the globe. But people with more needs have asked for more. E.g. A line item for American health insurance.</p>\n", "parentCommentId": "96Zx7pGz66HLiJkyd", "user": {"username": "Yelnats T.J."}}, {"_id": "CaS3kuRfmrmCq5wxW", "postedAt": "2023-08-01T02:52:42.005Z", "postId": "SZ6reaQ2HkABAcY2N", "htmlBody": "<p>Best of luck, J.T.<br><br>On the salary issue, I'm in a position to comment:<br><br>(1) I agree that it's unfortunate, because practically speaking this will deter some talented people from participating in founding charities. On the flipside, lower salaries do mean self-selecting into more intrinsically motivated/altruistic individuals, but I'm not sure if it outweighs the former effect.<br><br>(2) My own view is that the salary structure doesn't disadvantage less affluent individuals per se - at least not on a global scale. Think of it more as a U-shape curve, whereby a potential cofounder from a low or middle income country is able and willing to tolerate a much lower salary; while a rich world individual on the upper end of the income spectrum (e.g. inherited family wealth or savings from their previous banking/tech/consulting job) can afford a low or zero salary; it's more those on the lower and middle part of the income spectrum in developed countries that are unable to cope (relative to the standard of living they are accustomed to).<br><br>(3) Older individuals, with family or children commitments are the hardest hit. That said, students/fresh grads will probably be able to manage the matter.<br><br>(4) But at the end of the day, if we're serious about doing good, and saving/improving people's lives, we really should make a conscious choice to make the sacrifice.</p>", "parentCommentId": null, "user": {"username": "Joel Tan"}}, {"_id": "p3ngs9tcd9Trahcev", "postedAt": "2023-08-01T04:00:38.799Z", "postId": "SZ6reaQ2HkABAcY2N", "htmlBody": "<p>It's not just \"standard of living\" but also <i>security </i>-- if you have advantages like a savings cushion, a supportive and well-resourced family, etc. you can tolerate certain risks on a near-minimum wage salary<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefix7brid65jp\"><sup><a href=\"#fnix7brid65jp\">[1]</a></sup></span>&nbsp;better than someone without those things. Those risks include major medical expenses, short/medium term disability, the need for major car repairs, the project not working out and being unemployed until you can find your next job, etc., etc. As you implied, there are also various factors that make you more prone to risks or less able to weather them -- like having moral responsibility for the well-being of one's child(ren), being older (and thus relatively more exposed to medical expenses and disability risks), and so on.</p><p>I think some of the disconnect here is between the sacrifice we're implicitly asking of would-be CE incubatees in developed countries in comparison to what other orgs are paying for fairly entry-level work. To the extent your point (4) is valid, it suggests to me that some orgs are significantly overpaying for those positions.</p><p>&nbsp;</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnix7brid65jp\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefix7brid65jp\">^</a></strong></sup></span><div class=\"footnote-content\"><p>Where I live, minimum wage is $15 per hour, so slightly more than $30K/year.</p></div></li></ol>", "parentCommentId": "CaS3kuRfmrmCq5wxW", "user": {"username": "Jason"}}, {"_id": "k9pDksRtmySAmAtFD", "postedAt": "2023-08-01T05:19:30.423Z", "postId": "SZ6reaQ2HkABAcY2N", "htmlBody": "<p>It is a fairly reasonable case to make, that some organizations are overpaying, at least from the standpoint of maximizing welfare per dollar.<br><br>On the medical expenses issue - that's a legitimate concern, but to be fair, I find it's a US-centric worry insofar as other EAs from high income countries are protected by more robust public healthcare systems. And it was even worse pre-ACA, of course!</p>", "parentCommentId": "p3ngs9tcd9Trahcev", "user": {"username": "Joel Tan"}}, {"_id": "DtFNbWSDReE87zZLR", "postedAt": "2023-08-01T07:20:50.978Z", "postId": "SZ6reaQ2HkABAcY2N", "htmlBody": "<p>I do not think it reasonable to expect a Lightcone-like salary (150k+) from a co-founder position of an experimental new organisation aiming for high cost-effectiveness in the current EA non-longtermist funding structure.</p>\n<p>The article mentions that a typical CE charities seed funding budget is between 110-190k and that is the reality high impact cofounders have to deal with, and looking at the track record of CE-incubated charities, quite successfully.</p>\n<p>However, I agree that its prohibitive for some demographics, especially the US and UK. And of course it would be great if we could change that!\nIf Readers think this to be a big enough problem, I suggest them to earn-to-give and join the CE funding circles - and consider this a cost-effective alternative to taking a potentially overpaying EA job with a less clear roadmap to impact.</p>\n", "parentCommentId": "96Zx7pGz66HLiJkyd", "user": {"username": "Jonas Becker"}}, {"_id": "6ZjyZs8sdY8Rzkp2T", "postedAt": "2023-08-01T13:28:41.004Z", "postId": "SZ6reaQ2HkABAcY2N", "htmlBody": "<p>While I agree that Lightcone-level salaries would be wildly inappropriate here (and don't think the EA salary scale should generally give very much weight to Bay Area tech salaries as a general rule), I don't think that is what Elizabeth was trying to say. I took her comment more as \"if you're only able to offer what is roughly minimum-wage salary for a significant portion of the readership base, you need to be explicit about that, recognize that this is unfortunate, and recognize that it is a dealstopper for a lot of people.\"&nbsp;</p>", "parentCommentId": "DtFNbWSDReE87zZLR", "user": {"username": "Jason"}}, {"_id": "F3nqFZRnx52w6fYGg", "postedAt": "2023-08-01T14:11:30.479Z", "postId": "SZ6reaQ2HkABAcY2N", "htmlBody": "<p>Thanks for spelling that out, makes it clearer to me. I am ambivalent here because that might scare off many people that could actually afford going lower for 1-3 years but are just very anchored on their market rate.</p>\n<p>I feel many people have never questioned how much they would compromise their salary for the chance of 10-100x their impact in the world - until they get a real opportunity to do so. I feel assumptions like \"I'm OK with my market rate-30 to 50%\" are quite common even though the threshold for living a comfortable life for them might be much lower.</p>\n<p>I only found out how much salary I was willing to sacrifice after engaging more deeply with the idea of founding. Thus, based on my experience I find it fair to discuss salary expectations as a part of the co-founder matching process, not upfront. On a sidenote, I see an important psychological difference to make an active founder choice of setting your own starting salary low, in contrast to \"being offered only minimum wage\".</p>\n<p>All in all, maybe I am a bit disappointed that 90% of the discussion here so far has focused on salary, while impact potential and cost-effectiveness are more important matters to cover.</p>\n", "parentCommentId": "6ZjyZs8sdY8Rzkp2T", "user": {"username": "Jonas Becker"}}, {"_id": "2MnL4gRGSeKkXesNx", "postedAt": "2023-08-01T15:15:57.362Z", "postId": "SZ6reaQ2HkABAcY2N", "htmlBody": "<p>My own concerns on this thread have been centered around the offered salary not being enough for a fairly basic standard of living in some people's life circumstances (e.g., people with financial responsibility for dependents, people in the US with significant medical issues), rather than viewing it as a discount from \"market rate.\" For instance,my initial suggestion in response to the salary range was that \"covering special financial needs of people so they can take high impact / low salary roles\" could be a mixed meta/object-level funder purpose to promote diversity and inclusion within EA.</p><p>Unlike the class of people who are being asked to consider a heavy discount from \"market rate,\" people in this category are drawing dead at the outset -- no amount of engagement with the pre-founding process will change (e.g.) how much childcare costs. So it's hard to justify asking them to go through a process that would be known as a dead end for them if salary info were disclosed upfront. Unfortunately, neither childcare nor medical providers can be paid in impact. So one concern with a delayed-disclosure approach is that I don't think it is particularly respectful of the time, energy, and emotions of people in those situations.&nbsp;</p>", "parentCommentId": "F3nqFZRnx52w6fYGg", "user": {"username": "Jason"}}, {"_id": "y4h3MpyuFfzcABHcP", "postedAt": "2023-08-01T16:45:53.815Z", "postId": "SZ6reaQ2HkABAcY2N", "htmlBody": "<p>Apologies, I did think you were speaking for CE in an official capacity.</p>\n", "parentCommentId": "2KtkmdSiytkLLmK5N", "user": {"username": "Elizabeth"}}, {"_id": "C9axZdFNcp4zqm9Fg", "postedAt": "2023-08-02T10:54:03.587Z", "postId": "SZ6reaQ2HkABAcY2N", "htmlBody": "<p>I am pretty skeptical that this would be the best way to increase diversity in EA per dollar. I talk to quite a number of incubation programs, both inside and outside of EA, and for most forms of diversity, I do not think that a low salary is the top barrier. I think that for age diversity, there is a case for this, but for country-level diversity, it might pull in the opposite direction. My soft sense is that both CE staff and the CE cohort are unusually diverse relative to the EA movement as a whole and similar EA incubation programs, despite having low salaries.</p><p>Also, a factual update: I think most numbers right now for founders are more in the 40-60k range.</p>", "parentCommentId": "SAFCGZSdukF3DFnTq", "user": {"username": "Joey"}}, {"_id": "ndBjjyyeMfTYu9EJm", "postedAt": "2023-08-02T10:54:41.260Z", "postId": "SZ6reaQ2HkABAcY2N", "htmlBody": "<p>I think this is a pretty simple and incorrect model. Job desirability is considered based on many traits (salary being one, but far from the only one), with different individuals weighing those traits at different levels of importance. If salary is the most important factor for a job, CE will basically never compete given the talent requirements; if autonomy or impact is the most important trait, it will compete even at very low levels of salary.</p>", "parentCommentId": "ZFvM7fYwvJnRWwweb", "user": {"username": "Joey"}}, {"_id": "DhNp23yBqR6yvJwfh", "postedAt": "2023-08-02T10:55:13.603Z", "postId": "SZ6reaQ2HkABAcY2N", "htmlBody": "<p>Salary questions and discussions always happen well before someone goes through the program (typically during the interviews or soon after an invitation is offered). Ultimately, the co-founders select how much they ask for, and many have asked for considerably higher amounts.</p>", "parentCommentId": "Q6ArBdNuYkjuBGs2i", "user": {"username": "Joey"}}, {"_id": "42pCBtrEFftSdZuzR", "postedAt": "2023-08-02T10:56:01.154Z", "postId": "SZ6reaQ2HkABAcY2N", "htmlBody": "<p>\"My default interpretation is that someone doesn't value the role or my work very much.\"&nbsp;<br><br>I think this is a pretty unfortunate norm that some EAs have. In practice, it results in EAs by far prioritizing the best-funded areas instead of the most impactful ones. I think the reality is that offered salaries have far more to do with funding availability and perceived counterfactuals of funding. At the end of the day, AMF can absorb more money, and thus there is a higher bar for spending in global health than there is in areas without clear benchmarks.</p>", "parentCommentId": "96Zx7pGz66HLiJkyd", "user": {"username": "Joey"}}, {"_id": "96JF24PZjB7wZkQCj", "postedAt": "2023-08-02T11:04:56.410Z", "postId": "SZ6reaQ2HkABAcY2N", "htmlBody": "<p>It might be helpful to add some useful reference classes here as I think it's often forgotten how unusual EA salaries are relative to other fields.&nbsp;<br><br><a href=\"https://www.visualcapitalist.com/worlds-richest-countries-2023-gdp-per-capita/#:~:text=This%20article%20sorts%20countries%20according,figures%2C%20not%20accounting%20for%20inflation.\"><u>Average GDP of the world</u></a>: £11,000<a href=\"https://www.livingwage.org.uk/what-real-living-wage\"><u>&nbsp;</u></a><br><a href=\"https://www.livingwage.org.uk/what-real-living-wage\"><u>London's living wage</u></a>: £21,800<br><a href=\"https://www.ons.gov.uk/employmentandlabourmarket/peopleinwork/earningsandworkinghours/bulletins/annualsurveyofhoursandearnings/2022\"><u>Median full-time UK employees</u></a>: £26,800<br><a href=\"https://www.totaljobs.com/salary-checker/average-not-for-profit-salary\"><u>Average salary nonprofit jobs</u></a>: £31,700<br>The average&nbsp;<a href=\"https://www.glassdoor.co.uk/Salaries/london-london-salary-SRCH_IL.0,6_IM1035_KO7,13.htm\"><u>annual salary in London</u></a>: £39,000<br><a href=\"https://www.averagesalarysurvey.com/non-profit-organization/london-united-kingdom\"><u>Average salary nonprofit London</u></a>: £39,600<br>Average CE employee salary: £39,300<br>Entry-level EA job: £48,000<br>Average EA job: £80,000</p>", "parentCommentId": "2MnL4gRGSeKkXesNx", "user": {"username": "Joey"}}, {"_id": "qCW4qLkTfnFX9WoNt", "postedAt": "2023-08-02T11:55:43.382Z", "postId": "SZ6reaQ2HkABAcY2N", "htmlBody": "<p>Thank you for posting this, Joey. I think people too often talk about things like this in the abstract, not knowing the realities of the market. Two considerations I have when considering salary:</p><ol><li>Counterfactuals: Money, at the end of the day, is a limited resource. When considering the counterfactuals, I personally would feel unethical accepting a super high salary from CE, as I think the counterfactual of this money would be, e.g., one less high-impact organization being founded. In the early days, some of our charities started with just $25K-$50K grants; I can't imagine myself using this money for my salary. Some people say, \"Give founders more money for their salaries,\" but what if this money means one less highly-impactful organization (like LEEP, FEM, FWI) not being started? As the donor would choose to make sure a person has an EA-standard salary and not put the money into starting another organization? There is significant flexibility in terms of what the salary will be in different countries and circumstances (e.g., one of the co-founders having dependents), but if this is secured (the needs of the founder are secured), then every additional dollar needs to be thought of in counterfactuals. And this is how most of the CE community thinks.</li><li>What It Takes to Live a Good Life Money-wise: People think CE staff are paid small salaries, while I, as CE Staff, am paid a London market-rate salary + I receive benefits like a small donation bonus, equipment allowance, and training allowance. I feel overall very happy. I mean, with an average market salary, you can live a super good life in London: rent a room, save for retirement, help your mom in Poland, and go to theatres and Billie Eilish concerts :). So this is a very lavish lifestyle compared to the people and animals we're helping.</li></ol>", "parentCommentId": "96JF24PZjB7wZkQCj", "user": {"username": "Ula"}}, {"_id": "kqn4n4rvfq6oCHYrw", "postedAt": "2023-08-02T12:49:49.741Z", "postId": "SZ6reaQ2HkABAcY2N", "htmlBody": "<p>Another alternative is for people to stay in their well-paying EA job but just donate more to the leaner EA orgs.</p>\n<p>Example: someone earning 100k (which is close to the starting salaries I see posted for OP and CEA jobs) that already donates 10% of their income could donate another 5% to a CE charity to increase a founder salary. That 5% sacrifice would represent a salary increase of 10-20% for the founder.</p>\n<p>It seems to me that you'd have to think that that marginal difference from 90k to 85k had a very outsized impact on your productivity/well-being AND that your work is as important or more important than the work of the new org for you to hold on to that 5k rather than donate it to the increase the salary of the founder of that new org.</p>\n", "parentCommentId": "DtFNbWSDReE87zZLR", "user": {"username": "Yelnats T.J."}}, {"_id": "Ay8SSLcbospFTauzz", "postedAt": "2023-08-02T13:28:27.683Z", "postId": "SZ6reaQ2HkABAcY2N", "htmlBody": "<p>Those need to be adjusted for COL though (including that someone in the UK benefits from a modern social welfare state in the way that someone in the US does not). That is not saying that the US candidate should expect a better standard of living, only that the UK standard of living simply costs more in the US.</p>\n<p>I don't think the US is an edge case given that IIRC 30 to 35 percent of EAs on the survey live here. I'm OK with the possibility that being a CE incubatee may not be realistic for certain people in the US, but that would still be sad and should be openly discussed.</p>\n<p>For a candidate based in the US, its not clear why mostly UK based reference classes are the best choice. On mobile right now, but a quick look suggests the median salary in the US is about 55K USD and 80K in Washington DC (somewhat analogous to London). I do not think US candidates need as much of an uplift from UK as those numbers might suggest, but they are a sanity check for my view that UK reference ranges don't apply well to US candidates.</p>\n<p>I agree that EA jobs aren't really an appropriate reference class for my concern.</p>\n<p>The reference class I had in the back of my head for my comment was the minimum wage for the non-Bay city in which I live, augmented for the near-universal understanding that the legal minimum wage isn't a livable wage. That put me at 30K legal minimum plus 10K uplift = 40K livable wage for most, with recognition for special needs. It will also need an uplift for health insurance for many candidates. So I would judge a range of 40-60K generally viable for basic living expenses for a candidate where I live. Not so much 25-45K.</p>\n", "parentCommentId": "96JF24PZjB7wZkQCj", "user": {"username": "Jason"}}, {"_id": "r2gPXDXJNiEsZNxEK", "postedAt": "2023-08-02T16:29:58.613Z", "postId": "SZ6reaQ2HkABAcY2N", "htmlBody": "<p>How reliably are those asks met? If someone needs (e.g.) a 25K uplift for childcare costs, when do they learn if that's actually in the cards?</p>\n<p>My understanding was that funding allocations were locked in fairly late in the program, but I could be mistaken. Even if the candidate exits prior to starting the program, they may have invested significant time, energy, and emotion into the process.</p>\n<p>I definitely understand the realities of reliance on seed funding, and the fact that some uncertainty and opacity is unavoidable as a result. It remains unfortunate in my view.</p>\n<p>[For reference, 25K is about what full-time childcare costs for a young child where I live. Some people are single parents, and many have more than one child, so I didn't think it an unreasonable test case.]</p>\n", "parentCommentId": "DhNp23yBqR6yvJwfh", "user": {"username": "Jason"}}, {"_id": "fz32r7nMJvks3ortP", "postedAt": "2023-08-02T16:44:38.995Z", "postId": "SZ6reaQ2HkABAcY2N", "htmlBody": "<p>About 75% of seed project proposals get funded at the amount they ask for. That part is not known until after the incubation process. The typical seed grants are between $100k-$200k. I do not expect a great proposal to be stopped by a $25k higher budget. I think entrepreneurship is a higher-risk career path, one that is probably not suited for the majority of people. CE is already extremely de-risked relative to equivalents in the for-profit and incubated nonprofit space, to the point where I think the founding step is not the highest-risk part of founding a charity (having an impact 3 years down the line is).</p>", "parentCommentId": "r2gPXDXJNiEsZNxEK", "user": {"username": "Joey"}}, {"_id": "3neTbxLxbG7xaqxzq", "postedAt": "2023-08-02T17:34:21.755Z", "postId": "SZ6reaQ2HkABAcY2N", "htmlBody": "<p>Can I ask how you settled on the salary range you did? I realize that applicants have some choice in the matter, but CE clearly has a lot of power with norm-setting such that I think it's appropriate to ask.&nbsp;</p><p>Because I agree that it's bad to overweight funders' opinions (which is why I self-fund projects I care about), or to punish work with more measurable results. But CE has an opportunity, perhaps unique within EA, to set norms that value this work. Especially when highly-vetted people are using interventions you also vetted, which removes a lot of reasons to expect people to self-fund an experimental stage.</p>", "parentCommentId": "42pCBtrEFftSdZuzR", "user": {"username": "Elizabeth"}}, {"_id": "YvkBXCxaugdZ2svEg", "postedAt": "2023-08-02T19:09:05.055Z", "postId": "SZ6reaQ2HkABAcY2N", "htmlBody": "<p>To be fair to CE, their salary scale appears generally consistent with the non-US, non-EA nonprofit sector as a whole. \"Norms that value this work\" feels a bit strong where it is the rest of EA, rather than CE, that has chosen not to follow the norms of the broader non-profit world. (There could of course be good reasons -- or not -- for EA's divergence.)</p>\n<p>Joey had written recently about challenges in finding funding for new orgs in years 2-4ish, so my guess is that CE has higher priorities in the funding realm than higher salary norms.</p>\n", "parentCommentId": "3neTbxLxbG7xaqxzq", "user": {"username": "Jason"}}, {"_id": "WthEmTevPsYtikHXe", "postedAt": "2023-08-02T20:16:46.829Z", "postId": "SZ6reaQ2HkABAcY2N", "htmlBody": "<p>\"Norms that value this work\" feels a bit strong where it is the rest of EA, rather than CE, that has chosen not to follow the norms of the broader non-profit world. \"</p>\n<p>This is a strong point, be which I think should be given more weight in the \"EA salary debate\"</p>\n", "parentCommentId": "YvkBXCxaugdZ2svEg", "user": {"username": "NickLaing"}}, {"_id": "disPzwepP2FDL5pgc", "postedAt": "2023-08-02T22:37:03.956Z", "postId": "SZ6reaQ2HkABAcY2N", "htmlBody": "<p>I think \"aimed at people with low COL, and we accept that this is prohibitive for many people, including most Americans living in cities and people with dependents\" is a pretty reasonable policy. I don't know if it's optimal, but CE has much more information and I defer to them on the trade-offs. I do wish that was said explicitly instead of obfuscated, given that ~1/3 of EAF is in the US, presumably more in other HCOL countries, and having kids is not that weird.</p><p>(I do think something is off about norming founder salaries against general-non-profit salaries, since founding is so much harder, but someone did say salaries often went up after the first year so that may not matter much).&nbsp;</p>", "parentCommentId": "YvkBXCxaugdZ2svEg", "user": {"username": "Elizabeth"}}, {"_id": "8NXLYJFuyznq9rkHv", "postedAt": "2023-08-04T10:00:04.461Z", "postId": "SZ6reaQ2HkABAcY2N", "htmlBody": "<p>Hi Everyone,&nbsp;<br>As Charity Entrepreneurship we just want to make sure people understand how our Incubation Program works in terms of setting up co-founder salaries after the program.</p><ol><li>Most importantly, CE does not determine, dictate, grant, or pay out salaries. We pay a stipend to cover costs of living during the Program (and for up to two months after in case an incubatee does not end up founding for whatever reason). Once graduated, our alumni set their own salaries.</li><li>In week 5 of our program, we suggest co-founder and idea pairings to the participants that most (not all) decide to accept and move forward with for the last 3 weeks of the Program.</li><li>Our incubatees graduate our Program at the end of the 2-month Incubation Program by submitting their own project proposals to&nbsp;<a href=\"https://www.seednetworkfunders.com/\"><u>the Seed Network</u></a>. We give them feedback on their proposals to help make them as good as possible, but all decisions including their budget, salaries, and fundraising asks are their own. They are now independent co-founders and executive directors of their own charity.</li><li>To set their salaries the incubatees work out their needs, the budget of their fledgling organizations, and how much they think they can and should raise in the space they are fundraising in, as well as how this affects their cost-effectiveness and chances of success going forward. E.g., potential future funders outside the Seed Network will look at the budget and cost-effectiveness of a charity’s first year. All funders want the most bang for their buck, and if there are benchmarks like AMF, donating instead to a 2nd year organization can look very different levels of impactful depending on how much it cost.</li><li>CE does not decide who gets funding and how much. The Seed Network consists of about 30 individual grantmakers who make up their own minds. They sometimes decide to interview co-founders and/or ask CE for our impressions of the strengths and weaknesses of different teams, but how to use their funds is entirely their own choice.</li><li>After the Seed Network has announced their decisions, they transfer the money straight to the founders. The founders then set and draw their own salaries from the funds that they managed to raise. We have no control over the money.</li><li>We have had charities that launched with seed grants of as little as $25,000, $30,000 or $50,000. Their founders were confident they would fundraise more money after the launch outside of the CE Seed Network (i.e., from sources with better counterfactuals). We have had charities that sought seed funding for their entire first year and raised as much as $240,000 for two-person co-founder teams. Some of our founders have kids, cars, mortgages, and travel costs to consider. Others don’t and can target smaller seed grants.</li><li>At CE, frugality is one of the things we encourage because one of our core values is looking at money and other resources in counterfactuals. This is because in a space like Global Health &amp; Development, we are very aware of what the counterfactuals of money are - all money that we use could instead have gone to AMF or other GiveWell top charities to counterfactually save more lives; similarly for the animal space. We think the most impactful thing to do in setting salaries is to cover people’s needs in order for them to live a good life, generously construed, but not much more. That is not what we work for.</li><li>Finally, there are differences about what exactly the right range of salaries is in our community, and salaries vary. This is natural and healthy. However, most people lean frugal compared to the current standard in EA.</li></ol>", "parentCommentId": null, "user": {"username": "CE"}}, {"_id": "mBqN9ZDGLjuQughH4", "postedAt": "2023-08-07T04:31:55.082Z", "postId": "SZ6reaQ2HkABAcY2N", "htmlBody": "<p>FWIW, I think telling people \"This salary was below what I originally would have considered, but as I learned and engaged with it more I decided the impact was worth it. I urge potential co-founders to reach out even if the salary seems prohibitive, you might change your mind.\" is a perfectly reasonable and informative thing to say. &nbsp;Maybe even beautiful. It's only surprising people I object to.&nbsp;</p>", "parentCommentId": "F3nqFZRnx52w6fYGg", "user": {"username": "Elizabeth"}}, {"_id": "4YJSkspzNtisR8n4d", "postedAt": "2023-08-07T14:15:56.156Z", "postId": "SZ6reaQ2HkABAcY2N", "htmlBody": "<p>Yeah, I think it depends on what aspect(s) of diversity you're looking to target. My theory of change was based on the view that within-country diversity of EA is rather important, especially in the US and UK which are likely to remain important hubs for intellectual leadership and financing for at least the medium run.</p>\n", "parentCommentId": "C9axZdFNcp4zqm9Fg", "user": {"username": "Jason"}}, {"_id": "KPuLpttyDAfDfS8yz", "postedAt": "2023-08-23T21:41:10.889Z", "postId": "SZ6reaQ2HkABAcY2N", "htmlBody": "<p>Hey, just a quick idea on this intervention: increase the minimum number of cigarettes that can be sold in a pack. This stops new people from starting smoking (because they wont want to by 50 or 100) but keeps them affordable for those that are addicted, so the policy might be more likely to be put through. (I'm sure you've already considered and ruled this out, or that it isn't as effective as taxation, but it might be more tractable, so I thought I'd chuck it your way just in case). Good luck with it :D</p>\n", "parentCommentId": null, "user": {"username": "Alex Vellins"}}, {"_id": "W6yX22MWPFYhFpEsx", "postedAt": "2023-10-06T09:01:04.610Z", "postId": "SZ6reaQ2HkABAcY2N", "htmlBody": "<p>Your <a href=\"https://www.ons.gov.uk/employmentandlabourmarket/peopleinwork/earningsandworkinghours/bulletins/annualsurveyofhoursandearnings/2022\">source </a>on median UK salary says \"median annual pay for full-time employees was<strong> £33,000 </strong>for the tax year ending on 5 April 2022\".</p><p>Since then we've seen record wage increases. In the 18 months since April 2022 annual wage growth has been <a href=\"https://www.ons.gov.uk/employmentandlabourmarket/peopleinwork/earningsandworkinghours/timeseries/kac3/lms\">between 5% and 8.5%</a>. I'm not sure if we can simply apply average wage growth to the national median wage, but it seems likely that the UK median full-time wage is now in the mid-30,000s.</p><p>This still admits the broader point about EA salaries inhabiting a different world.</p>", "parentCommentId": "96JF24PZjB7wZkQCj", "user": {"username": "Stan Pinsent"}}]