[{"_id": "gmKuQTXnt7mzRWRsu", "postedAt": "2023-01-02T19:32:49.623Z", "postId": "SzNpP3zPWz5aA98YH", "htmlBody": "<p>I think ever since EA has become more of an “expected value maximisation” movement rather than a “doing good based on high quality evidence” movement, it has been quite plausible for EA activity overall, or community building specifically, to turn out to be net-negative in retrospect, but I think the <em>expected value</em> of community building remains extremely high.</p>\n<p>I support more emphasis on thin EA and the development of a sort of rule of thumb for what a good ratio of meta spending vs object level impact spending would be.</p>\n<p>Strongly agree that it is surprising that some of Carla Zoe Kremer’s reforms haven’t been implemented. Frankly, I would guess the reason is that too many leadership EAs are overconfident in their decision making and are much too focused on “rowing” instead of “steering” in Holden Karnofsky’s terms.</p>\n<p>“ Social movements are likely to overvalue efforts to increase the power of their movement and undervalue their goals actually being accomplished, and EA is not immune to this failure mode.” Why do you think this, it is mostly intuition?</p>\n<p>My view of other social movements is that they undervalue efforts to increase power which is why most are unsuccessful. I credit a lot of EA’s success in terms of object level impact to a healthy degree of focus on increasing power as a means to increasing impact.</p>\n", "parentCommentId": null, "user": {"username": "freedomandutility"}}, {"_id": "cNLZhv5gyrfss7WGW", "postedAt": "2023-01-02T20:47:00.746Z", "postId": "SzNpP3zPWz5aA98YH", "htmlBody": "<p>Thank you for this post. The framing of your points as conditional is especially helpful.</p><p>I strongly agree with lots here. As someone who has worked on community building-ish projects that are very far from or very close to frontline/object-level work, this part rang especially true:</p><blockquote><p>Insofar as it makes sense to have less of a default presumption towards the value of community building, a way of de-risking community building activities is to link them more closely to activities where the case for direct impact is stronger.</p></blockquote><p>People interested in the claim might be interested in <a href=\"https://forum.effectivealtruism.org/posts/fCN7w6HBMdaBZCbmX/let-s-not-have-a-separate-community-building-camp\">this related post and discussion</a>.</p>", "parentCommentId": null, "user": {"username": "joel_bkr"}}, {"_id": "HcbLNArxqkoJQTCQ4", "postedAt": "2023-01-03T00:26:02.392Z", "postId": "SzNpP3zPWz5aA98YH", "htmlBody": "<p>Could you say more about the possibility of \"external\" funders for EA community building? It's probably not realistic to get major funding from a Big-Name Generalist Foundation, given that many of EA's core ideas inevitably constitute a severe criticism of how Big Philantrophy works. And it would be otherwise hard to decide who an \"external\" funder was -- in my book, \"gives lots of money to EA community building\" is pretty diagnostic for being an EA and thus not external.</p><p>One possibility might be that major funders would only pick up (say) 50% of the tab for most projects/organizations, and that would be conditioned as a match on what the project/organization could attract from small/medium donors (SMDs). I suggest that rank-and-file EAs may be collectively more able to discern whether it is worth pulling money away from direct work to fund meta work because they are closer to the outputs. I suspect that significant SMD buy-in would also practically enforce some of what you're describing -- it gives more people a practical \"vote\" and the ability to throw a flag if things are starting to go off the rails.</p><p>Of course, requiring meta organizations/projects to significantly rely on SMDs has its costs too. But raising money from SMDs is less efficient for <i>any</i> organization than getting the bulk of funding needs from a few big fish. So the question is which organizations should get a greater percentage of their funding from big donors. In contrast to meta organizations, I don't think there is any significant benefit from having most direct-work organizations more reliant on SMD funding.</p>", "parentCommentId": null, "user": {"username": "Jason"}}, {"_id": "SMSC9hwSDbkBP74Hn", "postedAt": "2023-01-03T09:42:33.384Z", "postId": "SzNpP3zPWz5aA98YH", "htmlBody": "<p>Just wanted to flag that I personally believe<br>- most of Cremer's proposed institutional reforms are either bad or zero impact, this was the case when proposed, and is still true after updates from FTX<br>- it seems clear proposed reforms would not have prevented or influenced the FTX fiasco&nbsp;<br>- I think part of Cremer's reaction after FTX is not epistemically virtuous; \"I was a vocal critic of EA\" - \"there is an EA-related scandal\" - \"I claim to be vindicated in my criticism\" is not sound reasoning, when the criticisms are mostly tangentially related to the scandal. It will get you a lot of media attention, in particular if you <s>present yourself as</s> <i>are willing to cooperate in being presented</i> as some sort of <i>virtuous insider who &nbsp;was critical of the leaders and saw this coming</i>, &nbsp;but I hope upon closer scrutiny people are actually able to see through this.<br>&nbsp;<br>edit: <s>present yourself as</s> &nbsp;replaced with <i>are willing to cooperate in being presented</i>&nbsp;</p>", "parentCommentId": null, "user": {"username": "Jan_Kulveit"}}, {"_id": "egJNYP48dEt3EXAZ9", "postedAt": "2023-01-03T10:19:47.341Z", "postId": "SzNpP3zPWz5aA98YH", "htmlBody": "<p>I think I'm not following the first stage of your argument. Why would the FTX fiasco imply that community building specifically (rather than EA generally) might be net-negative? &nbsp;</p>", "parentCommentId": null, "user": {"username": "Jack_S"}}, {"_id": "EF8yXg4DQNx7Kn4qu", "postedAt": "2023-01-03T10:31:26.564Z", "postId": "SzNpP3zPWz5aA98YH", "htmlBody": "<p>I think the idea is that EA <em>institutions</em> look much worse after FTX but EA <em>causes</em> do not. SBF being a fraud may cause you to update about whether (e.g.) CEA is a good organization but should not cause you to update on bednets/AI.</p>\n", "parentCommentId": "egJNYP48dEt3EXAZ9", "user": {"username": "therealslimkt"}}, {"_id": "eBR3w3zHJ32YgcpLP", "postedAt": "2023-01-03T11:31:51.277Z", "postId": "SzNpP3zPWz5aA98YH", "htmlBody": "<p>Thanks Jan! Could you elaborate on the first point specifically? Just from a cursory look at the linked doc, the first three suggestions seem to have few drawbacks to me, and seem to constitute good practice for a charitable movement.</p><blockquote><ul><li>Set up&nbsp;<strong>whistleblower protection</strong> schemes for members of EA organisations&nbsp;</li><li>Transparent listing of funding sources on each website of each institution</li><li>Detailed and comprehensive conflict of interest reporting in grant giving</li></ul></blockquote>", "parentCommentId": "SMSC9hwSDbkBP74Hn", "user": {"username": "mhendric"}}, {"_id": "SNfDjrEfwtAoovSz6", "postedAt": "2023-01-03T14:13:23.949Z", "postId": "SzNpP3zPWz5aA98YH", "htmlBody": "<p>Reading the first paragraph of the OP, here's me trying to excavate the argument:&nbsp;</p><ul><li>Just like positive impact is likely \"heavy-tailed,\" so is <i>negative</i> impact (see also <a href=\"https://onlinelibrary.wiley.com/doi/abs/10.1111/phpe.12133\">this paper</a>)</li><li>Introducing people to EA ideas increases their agentiness and \"attempts to optimize\"</li><li>Sometimes when people try to optimize something, things go badly wrong (e.g., FTX)</li><li>It's <i>conceivable,</i> therefore<i>, </i>that EA community building has net negative impact</li></ul><p>I think the argument is incomplete. Other things to think about:&nbsp;</p><ul><li>Are there any reasons why it might be systematically easier to destroy value than to create it?<ul><li>Seems plausible.</li></ul></li><li>But: What's the alternative, what's the default trajectory without an EA \"movement\" of some sort?<ul><li>Doesn't seem like much value?</li></ul></li><li>Beware of false dichotomies: Instead of movement building vs. no movement building, are there ways to increase the robustness of movement building?&nbsp;<ul><li>E.g., not promoting individuals with a <a href=\"https://forum.effectivealtruism.org/posts/LpkXtFXdsRd4rG8Kb/reducing-long-term-risks-from-malevolent-actors\">particular psychology</a> who may be disproportionally likely to end up with outsized negative impact?</li><li>Edit: worth saying that the OP does provide constructive suggestions!</li></ul></li></ul>", "parentCommentId": "egJNYP48dEt3EXAZ9", "user": {"username": "Lukas_Gloor"}}, {"_id": "ZaB42Ztcf4TMpaM3e", "postedAt": "2023-01-03T14:21:43.254Z", "postId": "SzNpP3zPWz5aA98YH", "htmlBody": "<p>I'll note that many EA orgs already have whistleblower protection policies in place and that there are also various whistleblowing protection laws in many jurisdictions (including the US and the UK) which I assume any EA affiliated organization or employee would have to follow.</p>", "parentCommentId": "eBR3w3zHJ32YgcpLP", "user": {"username": "Eli_Nathan"}}, {"_id": "xmGLgmmniyG4Kanfa", "postedAt": "2023-01-03T14:33:14.690Z", "postId": "SzNpP3zPWz5aA98YH", "htmlBody": "<p>I don't think this is a fair comment, and aspects of it reads more of a personal attack rather than an attack of ideas. This feels especially the case given the above post has significantly more substance and recommendations to it, but this one comment just focuses in on Zoe Cremer. It worries me a bit that it was upvoted as much as it was.&nbsp;<br><br>For the record, I think some of Zoe's recommendations could plausibly be net negative and some are good ideas; as with everything, it requires further thinking through and then skillful implementation. But I think the amount of flack she's taken for this has been disproportionate and sends the wrong signal to others about dissenting.<br><br>I think this aspect of the comment is particularly harsh, which is in and of itself likely counterproductive. But on top of that, it's not the type that should be made lightly or without a lot of evidence that that is the person's agenda (bold for emphasis):</p><blockquote><p>- I think part of Cremer's reaction after FTX is not epistemically virtuous; \"I was a vocal critic of EA\" - \"there is an EA-related scandal\" - \"I claim to be vindicated in my criticism\" is not sound reasoning, when the criticisms are mostly tangentially related to the scandal. <strong>It will get you a lot of media attention, in particular if you present yourself as some sort of </strong><i><strong>virtuous insider who &nbsp;was critical of the leaders and saw this coming</strong></i><strong>, &nbsp;</strong>but I hope upon closer scrutiny people are actually able to see through this.</p></blockquote>", "parentCommentId": "SMSC9hwSDbkBP74Hn", "user": {"username": "howdoyousay?"}}, {"_id": "QmxmwPunHNH4oTvtK", "postedAt": "2023-01-03T14:51:26.229Z", "postId": "SzNpP3zPWz5aA98YH", "htmlBody": "<blockquote><p>“ Social movements are likely to overvalue efforts to increase the power of their movement and undervalue their goals actually being accomplished, and EA is not immune to this failure mode.”</p></blockquote><p>While I am unaware of any actual studies supporting it (indeed, the nature of the problem makes it rather resistant to study), that statement sounds like a rephrasing or redevelopment of what's sometimes known as <a href=\"https://jerrypournelle.com/archives2/archives2mail/mail408.html#Iron\">Pournelle's Iron Law of Bureaucracy</a>:</p><blockquote><p>Pournelle's Iron Law of Bureaucracy states that in any bureaucratic organization there will be two kinds of people: those who work to further the actual goals of the organization, and those who work for the organization itself. Examples in education would be teachers who work and sacrifice to teach children, vs. union representative who work to protect any teacher including the most incompetent. The Iron Law states that in all cases, the second type of person will always gain control of the organization, and will always write the rules under which the organization functions.</p></blockquote><p>Your last line, if I'm understanding you correctly, is to suggest that this is a good thing because of the nature of those in the second category in EA. One can imagine situations where this would be the case, such as Plato's philosopher-kings worthy of trust.&nbsp;</p>", "parentCommentId": "gmKuQTXnt7mzRWRsu", "user": {"username": "RobertJMoore"}}, {"_id": "kvRsRZBesGErGPeoc", "postedAt": "2023-01-03T14:56:50.792Z", "postId": "SzNpP3zPWz5aA98YH", "htmlBody": "<p>I strongly downvoted this for not making any of the reasoning transparent and thus contributing little to the discussion beyond stating that \"Jan believes this\".&nbsp;</p><p>This could sometimes be reasonable for the purpose of deferring to authority, but that is riskier in this case because Jan has severe conflicts of interest due to being employed by a core EA organisation and being a stakeholder in for example a <a href=\"https://forum.effectivealtruism.org/posts/xof7iFB3uh8Kc53bG/why-did-cea-buy-wytham-abbey?commentId=KWnqd6Hw5BdEbeKD3\">~$4.7 million grant to buy a chateau</a>.&nbsp;</p>", "parentCommentId": "SMSC9hwSDbkBP74Hn", "user": {"username": "linnea"}}, {"_id": "XjwiSDNSn4NvEJore", "postedAt": "2023-01-03T14:58:28.258Z", "postId": "SzNpP3zPWz5aA98YH", "htmlBody": "<p>I can't speak to orgs, but the scope of legal protection for whistleblowing protection for US private employees is quite narrow -- I think people are calling for something much more robust. Also, I believe those protections often only cover an organization's actions against current employees -- not non-employer actions like blacklisting the whistleblower against receiving grants or trashing them to potential future employers.</p>\n", "parentCommentId": "ZaB42Ztcf4TMpaM3e", "user": {"username": "Jason"}}, {"_id": "EvGs6Swvtbdmd4EzG", "postedAt": "2023-01-03T15:13:59.550Z", "postId": "SzNpP3zPWz5aA98YH", "htmlBody": "<p>\"It seems clear proposed reforms would not have prevented or influenced the FTX fiasco\" doesn't really engage with the original poster's argument (at least as I understand it). The argument, I think, is that FTX revealed the possibility that serious undiscovered negatives exist, and that some of Cremer's proposed reforms and/or other reforms would reduce those risks. Given that they involve greater accountability, transparency, and deconcentration of power, this seems plausible.</p>\n<p>Maybe <em>Cremer</em> is arguing that her reforms would have likely prevented FTX, but that's not really relevant to the discussion of the original post.</p>\n", "parentCommentId": "SMSC9hwSDbkBP74Hn", "user": {"username": "Jason"}}, {"_id": "nq7nbrZbQednXuDc4", "postedAt": "2023-01-03T15:25:58.187Z", "postId": "SzNpP3zPWz5aA98YH", "htmlBody": "<p>After reading also the other parts of the post, I think the OP makes further claims about how the best way to counteract the risks of unintended negative impact is via \"institutional reforms\" and \"democratization.\"<br><br>I'm not convinced that this is the best response. I think overdoing it with institutional reforms would add a bunch of governance overhead that unnecessarily* slows down good actors and can easily be exploited/weaponized (or even just sidestepped) by bad actors. Also, \"democratization\" sounds virtuous in theory, but large groups of people collectively tend to have messed up epistemics, since the discourse amplifies applause lights or even quickly becomes toxic because of dynamics where we mostly hear from the most vocal skeptics (who often have a personal grudge or some other problem) &nbsp;and all the armchair quarterbacks who don't have a clue of what they're missing. There comes a point where you'll get scrutinized a lot more for bad actions than for bad omissions (or for other things that somewhat randomly and unjustifiably evoke moral outrage in specific people – see <a href=\"https://forum.effectivealtruism.org/posts/EFpKcbaZNyZNk4qWD/jonas-vollmer-s-shortform?commentId=crYnzRh6zamAsst5X\">this comment</a> by Jonas Vollmer).</p><p>Maybe I'm strawmanning the calls for reform and people who want governance safeguards mostly mean things that I would also agree with. I want to make clear that there are probably quite a few suggestions in the spirit of \"institutional reforms\" where I'd be in favor. It's not that I think all governance overhead is bad – e.g., I think boards are quite essential if the board members are &nbsp;actually engaged and committed to an org's mission. Also, I think EA orgs should give regular updates where the leadership communicates transparently the reasons why they did what they did, speaking real talk instead of putting up a PR front. (I think there's a lot of room for improvement here!)</p><p>*It's not like governance safeguards will magically change people who don't have the required qualities into competent good actors. I concede that there's a lot of truth to \"power (without accountability) corrupts.\" So, one might argue \"even good leaders may turn bad if they aren't accountable to anyone.\" However, that seems like a definitional dispute. As a \"good leader,\" you'd be terribly scared of mission-drift and becoming corrupted, so you'd seek out a way to stay accountable to people whose judgment you respect. If you're not terribly scared of these things, or if you're the only person in the world whose judgment you respect, then you're not a good leader in the first place. Processes work well when they're designed by a founder (or CEO) who's highly committed to the org's mission and who has a vision. Stuff that's externally imposed on people rarely has its desired effects. If we want to reap the fruits of highly impactful organizations or institutions, we have to be prepared to give some founders or CEOs (the right ones!) a cushion of initial trust. (And then continue to watch them carefully so they don't use it all up and go negative.)&nbsp;</p>", "parentCommentId": "SNfDjrEfwtAoovSz6", "user": {"username": "Lukas_Gloor"}}, {"_id": "M55XhpbkjEvFwLwsP", "postedAt": "2023-01-03T15:50:22.020Z", "postId": "SzNpP3zPWz5aA98YH", "htmlBody": "<p>Unfortunately not in detail &nbsp;- it's a lot of work to go through the whole list and comment on every proposal. My claim is not 'every item on the list is wrong', but 'the list is wrong on average' so commenting on three items does not solve possible disagreement.&nbsp;<br><br>To discuss something object-level, let's look at the first one<br><br>'Whistleblower protection schemes' sound like a good proposal on paper, but the devil is in detail:<br><br>1. Actually, at least in the EU and UK, whistleblowers pointing out things like fraud or illegal stuff are protected by the law. The protection offered by law is probably stronger than an internal org policy for some cases, and does not apply in other cases. Also, in some countries there are regulations what whistleblower protections you should have in place - I assume orgs do follow it where it applies.&nbsp;<br>2. Many orgs where it makes sense have some policies/systems in this direction, but not necessarily under the name of 'whistleblower protection'. &nbsp;<br>3. Majority of EA orgs are orgs which are quite small. I don't think if you have a team of e.g. four people, having<i> a whistleblower protection scheme &nbsp;</i>works the same way as in org with four hundred people. In my view, what actually often makes more sense, is having external contacts for all sort of issues - e.g. the community health team. &nbsp;<br>4. Overall, I think often the worst situation is when you have a system which <i>seemingly &nbsp;</i>does something, but actually does not. For example: a campus <i>mental health support system</i> which is actually not qualified to help with mental health problems, but keeps track who reached out to them, is probably worse than nothing.<br><br>My bottom line is something like &nbsp;... <i>'whistleblower protection scheme' &nbsp;</i>may be good to implement in some cases, and some orgs have them. But it is too bureaucratic in other cases. &nbsp;Blanket policy requiring every org to have a formal scheme, no matter what the size or circumstances, seems bad.&nbsp;</p>", "parentCommentId": "eBR3w3zHJ32YgcpLP", "user": {"username": "Jan_Kulveit"}}, {"_id": "RjRGMRkx3KatmADgj", "postedAt": "2023-01-03T16:56:28.269Z", "postId": "SzNpP3zPWz5aA98YH", "htmlBody": "<p>The Cremer document mixes two different types of whistleblower policies: protection and incentives. Protection is about trying to ensure that organisations do not disincentivize employees or other insiders from trying to address illegal/undesired activities of the organisation through for example threats or punishments. Whistleblower incentives are about incentivizing insiders to address illegal/undesired activities.&nbsp;<br><br><a href=\"https://eur-lex.europa.eu/legal-content/EN/TXT/PDF/?uri=CELEX:32019L1937&amp;from=EN\">The recent EU whistleblowing directive</a> for example is a rather complex piece of legislation that aims to <i>protect </i>whistleblowers from e.g. being fired by their employers in some situations.</p><p><a href=\"https://www.sec.gov/whistleblower\">The US SEC whistleblowing</a> program on the other hand <i>incentivizes </i>whistleblowing by providing financial awards, some 10-30% of sanctions collected, for information that leads to significant findings. &nbsp;This policy, for the US, has a quickly estimated return of 5-10x through first order effects, and possibly many times that in second order effects through stopping fraud and reducing the expected value of fraud in general. The SEC gives several awards <a href=\"https://www.sec.gov/whistleblower/pressreleases\">each month</a>. A report about the program is <a href=\"https://www.sec.gov/files/owb-2021-annual-report.pdf\">available here</a> for those interested.</p><p>Whistleblower protections tend to be more bureaucratic and are already covered by US and EU legislation to such an extent that improving them seems difficult. Whistleblower incentive mechanisms meanwhile seem much more worthwhile to investigate, because such a mechanism could be operated by a small centralized function without adding any new bureaucracy to existing organisations. I suspect that even a minimal whistleblower incentive* mechanism would reduce risks and increase trust within the EA diaspora by increasing the probability that we become aware of risky situations before they snowball into larger crises.&nbsp;<br><br><br>(*incentives here might not mean financial awards like in the SEC program, but something like helping the whistleblower find a new job, or taking the responsibility for investigating the information further instead of expecting the whistleblower to do it. I'd guess that most whistleblowing reports in EA, if any, would involve junior workers who are afraid of losing their income or status in the community, or simply do not have the energy, network, or skills to address the issue directly themselves.)<br><br>&nbsp;</p>", "parentCommentId": "M55XhpbkjEvFwLwsP", "user": {"username": "mikko"}}, {"_id": "5rTc9XCjWgwfqP2wG", "postedAt": "2023-01-03T17:14:45.126Z", "postId": "SzNpP3zPWz5aA98YH", "htmlBody": "<p>Yeah, makes sense. I just don't know why it's not just: \"It's <i>conceivable,</i> therefore<i>, </i>that EA <s>community building </s>has net negative impact.\"&nbsp;<br><br>If you think that EA is/ EAs are net-negative value, then surely the more important point is that we should disband EA totally / collectively rid ourselves of the foolish notion that we should ever try to optimise anything/ commit seppuku for the greater good, rather than ease up on the community building.&nbsp;</p>", "parentCommentId": "SNfDjrEfwtAoovSz6", "user": {"username": "Jack_S"}}, {"_id": "3AtxbQcaQLGMPDwEF", "postedAt": "2023-01-03T17:15:46.926Z", "postId": "SzNpP3zPWz5aA98YH", "htmlBody": "<p>I'm not confident what the whole argument is.&nbsp;<br><br>In my reading, the OP updated toward the position &nbsp;\"it’s plausible that effective altruist community-building activities could be net-negative in impact, and I wanted to explore some conjectures about what that plausibility would entail\" based on FTX causing large economic damage. &nbsp;One of the conjectures based on this is \"Implement Carla Zoe Cremer’s Recommendations\".<br><br>I'm mostly arguing against the position that <i>'the update of probability mass on EA community building being negative due to FTX evidence is a strong reason to implement Carla Zoe Cremer’s Recommendations'&nbsp;</i><br><br>For comparison: I held the position that<i> effective altruist community-building activities could be net-negative in impact &nbsp;</i>before FTX and did not update much on the FTX evidence. In my view, the main reason for plausible negativity is EA seems much better at \"finding places of high leverage\" where you can influence the trajectory of the world a lot, than in figuring out what to actually do in those places. In my view, interventions against the risk include emphasis on epistemics, pushing against local consequentialist reasoning, and pushing against free-floating \"community building\" where people not working on the object level try mostly to bring in a lot of new people.<br><br>Personally, I think &nbsp;implementing <i>Zoe Cremer’s Recommendations </i>as a whole<i> </i>either does not impact the largest real risks, or<i> </i>would make the negative outcomes more likely. Repeated themes in the recommendations are 'introduce bureaucracy' and 'decide democratically'. I don't think bureaucracies are wise, and in 'democratizing' things the big &nbsp;question is 'who is the demos?'.&nbsp;</p>", "parentCommentId": "EvGs6Swvtbdmd4EzG", "user": {"username": "Jan_Kulveit"}}, {"_id": "SiWMAZq8G4DZfx3fk", "postedAt": "2023-01-03T17:58:19.028Z", "postId": "SzNpP3zPWz5aA98YH", "htmlBody": "<p>This discussion here made me curious, so I went to Zoe's twitter to check out what she's posted recently. (Maybe she also said things in other places, in which case I lack info.) The main thing I see her taking credit for (by retweeting other people's retweets saying Zoe \"called it\") is this tweet from last August:</p><blockquote><p>EA is to me to be unwilling to implement institutional safeguards against fuck-ups. They mostly happily rely on a self-image of being particularly well-intentioned, intelligent, precautious. That’s not good enough for an institution that prizes itself in understanding tail-risk.</p></blockquote><p>That seems legitimate to me. (We can debate whether <i>institutional</i> safeguards would have been the best action against FTX in particular, but the more general point of \"EAs have a blind spot around tail risks due to an elated self-image of the movement\" seems to have gotten a \"+1\" score with the FTX collapse (and EAs not having seen it coming despite some concerning signs).<br><br>There's also a tweet by a journalist that she retweeted:&nbsp;</p><blockquote><p>3) Critics (eg <a href=\"https://twitter.com/CarlaZoeC\">@CarlaZoeC</a> <a href=\"https://twitter.com/LukaKemp\">@LukaKemp</a>) warned that EA should decentralize funding so it doesn’t become a closed validation loop where the people in SBF’s inner circle get millions to promote his &amp; their vision for EA while others don’t. But EA funding remained overcentralized.</p></blockquote><p>That particular wording sounds suspiciously like it was tailored to the events with hindsight, in which case retweeting without caveats is potentially slightly suboptimal. But knowing what we know now, I'd indeed be worried about a hypothetical world where FTX hadn't collapsed! Where Sam's vision of things and his attitude to risks gets to have such a huge degree of influence within EA. (That said, it's not like we can just wish money into existence from diversified sources of funding – in Zoe's document, I saw very little discussion of the <i>costs</i> of cutting down on \"centralized\" funding.)</p><p>In any case, I agree with Jan's point that it would be a massive overreaction to now consider all of Zoe's criticisms vindicated. In fact, without a more detailed analysis, I think it would even be premature to say that she got some important details <i>exactly</i> right (especially when it comes to suggestions for change).</p><p>Even so, I think it's important to concede that Zoe gets significant credit here at least directionally, and that's an argument for people to (re-)engage with her suggestions if they haven't already done so or if there's a chance they may have been a bit closed off to them the last time.</p><p>(My own view remains skeptical, though, as I explained <a href=\"https://forum.effectivealtruism.org/posts/SzNpP3zPWz5aA98YH/if-ea-community-building-could-be-net-negative-what-follows?commentId=nq7nbrZbQednXuDc4\">here</a>.)</p>", "parentCommentId": "xmGLgmmniyG4Kanfa", "user": {"username": "Lukas_Gloor"}}, {"_id": "ETEQHjWLGLTGrjA5F", "postedAt": "2023-01-03T18:29:58.966Z", "postId": "SzNpP3zPWz5aA98YH", "htmlBody": "<blockquote><p>3) Critics (eg <a href=\"https://twitter.com/CarlaZoeC\">@CarlaZoeC</a> <a href=\"https://twitter.com/LukaKemp\">@LukaKemp</a>) warned that EA should decentralize funding so it doesn’t become a closed validation loop where the people in SBF’s inner circle get millions to promote his &amp; their vision for EA while others don’t. But EA funding remained overcentralized</p></blockquote><p>&nbsp;</p><p>I think the FTX regranting program was the single biggest push to decentralize funding EA has ever seen, and it's crazy to me that anyone could look at what FTX Foundation was doing and say that the key problem is that the funding decisions were getting more, rather than less, centralized. (I would be interested in hearing from those who had some insight into the program whether this seems incorrect or overstated.)</p><p>That said, first, I was a regrantor, so I am biased, and even aside from the tremendous damage caused by the foundation needing to back out and the possibility of clawbacks, the fact that at least some of the money which was being regranted was stolen makes the whole thing completely unacceptable. However, it was unacceptable in ways that have nothing to do with being overly centralized.</p>", "parentCommentId": "SiWMAZq8G4DZfx3fk", "user": {"username": "Davidmanheim"}}, {"_id": "zRpLXjkA7TpABdXcL", "postedAt": "2023-01-03T18:34:09.573Z", "postId": "SzNpP3zPWz5aA98YH", "htmlBody": "<p>To answer this, from my perspective, I'll quote from <a href=\"https://forum.effectivealtruism.org/posts/56CHyqoZskFejWgae/ea-is-a-global-community-but-should-it-be\">my post</a> a few months back:</p><blockquote><p>First, I think that we should expect communities to be self-supporting, outside of donor dollars. Having work spaces and similar is great, but it’s not an impartially altruistic act to give yourself a community. It’s much too easy to view self-interested “community building” as actually altruistic work, and a firewall would be helpful.</p><p>Given that, I strongly think that most EAs would be better off giving their 10% to effective charities focused on the actual issues, and then paying dues or voluntarily contributing other, non-EA-designated funds for community building. That seems healthier for the community, and as a side-benefit, removes the current centralized “control” of EA communities, which are dependent on CEA or other groups.&nbsp;</p></blockquote>", "parentCommentId": "HcbLNArxqkoJQTCQ4", "user": {"username": "Davidmanheim"}}, {"_id": "kcoGw4WjAcZrpAw5W", "postedAt": "2023-01-03T18:36:30.829Z", "postId": "SzNpP3zPWz5aA98YH", "htmlBody": "<p>...because we have object level data on the impact on many things, but very little on the net impact of community building on object level outcomes we care about. And community building is a very indirect impact, so on priors we should be less certain of how useful it is.</p>", "parentCommentId": "5rTc9XCjWgwfqP2wG", "user": {"username": "Davidmanheim"}}, {"_id": "YQSTzJiQAZzEAWBgv", "postedAt": "2023-01-03T19:23:07.203Z", "postId": "SzNpP3zPWz5aA98YH", "htmlBody": "<p>I think I did a poor job of distinguishing what I call \"institutional EA\" (or \"EA community building\") from EA (or \"EA as an idea\"). But basically, there's a difference between the idea of attempting to do good using evidence (or whatever your definition of EA might be) and particular efforts to expand the circle of people who identify as/affiliate with effective altruists. The former is what I'm calling EA/idea of EA and the latter is community building.&nbsp;</p><p>As might be obvious from this description, there are many possible ways to do EA community building, which might have better or worse effects (and one could think that community building efforts on average will have positive or negative effects). My claim is that it is plausible that the set of EA community building efforts conducted to date plausibly may have had net negative effects.</p>", "parentCommentId": "5rTc9XCjWgwfqP2wG", "user": {"username": "joshcmorrison"}}, {"_id": "hALX9LbhezBZb6bka", "postedAt": "2023-01-03T19:32:06.917Z", "postId": "SzNpP3zPWz5aA98YH", "htmlBody": "<p>A milder statement of this is almost certainly already accepted by EA leadership and we should see the impact when the EA brownout ends.<br><br>A year ago, generating more SBFs was the brief argument for the high EV of community building. A common refrain: \"SBF is contributing so much to EA causes, if what we're spending on community building generates even just one more SBF it will be worth it.\"&nbsp;<br><br>Now turn SBF to a negative value in that equation, or even merely a zero. The end result may be non-negative, but the EV of community building is greatly reduced.<br><br>Many in EA positions who have funded community-building orgs are probably now smarting at having mis-invested based on a false perception of SBF's value.<br><br>If there is a hard part, it will be convincing ourselves that although SBF was not high value, it will be hard to resist including hypothetical non-fraudulent &nbsp;SBFs in our EV calculations, as we have habituated to that way of thinking.</p>", "parentCommentId": null, "user": {"username": "justanusername"}}, {"_id": "iNGfhChLHgGHjLAns", "postedAt": "2023-01-03T19:45:17.372Z", "postId": "SzNpP3zPWz5aA98YH", "htmlBody": "<p>Thanks, David. I think the best approach is probably more complicated than my 10,000 foot comment -- \"work spaces and similar\" are in a different category to me than EAGs, which are in turn in a different category than funding early EA community-building work in middle-income countries. The appropriate \"coinsurance\" will vary depending on the specific project, but I think you're right that it may be 100 percent for some of them.</p>\n", "parentCommentId": "zRpLXjkA7TpABdXcL", "user": {"username": "Jason"}}, {"_id": "cXKoiTgYmtmWZ5iAJ", "postedAt": "2023-01-03T20:11:49.569Z", "postId": "SzNpP3zPWz5aA98YH", "htmlBody": "<p>I think you lack part of the context where Zoe seems to claim to media the suggested reforms would help<br><br>-<a href=\"https://www.economist.com/1843/2022/11/15/the-good-delusion-has-effective-altruism-broken-bad\"> this Economist piece, mentioning Zoe about 19 times</a><br>- <a href=\"https://web.archive.org/web/20221123010431/https://www.washingtonpost.com/technology/2022/11/17/effective-altruism-sam-bankman-fried-ftx-crypto/\">WP</a><br>- this <a href=\"https://www.newyorker.com/news/annals-of-inquiry/sam-bankman-fried-effective-altruism-and-the-question-of-complicity\">New Yorker piece</a>, with Zoe explaining <i>\"My recommendations were not intended to catch a specific risk, precisely because specific risks are hard to predict”&nbsp;</i> but still saying ... <i>“But, yes, would we have been less likely to see this crash if we had incentivized whistle-blowers or diversified the portfolio to be less reliant on a few central donors? I believe so.”</i><br>-<a href=\"https://twitter.com/CarlaZoeC/status/1591333694132097024\">this twitter thread</a><br>&nbsp;</p>", "parentCommentId": "SiWMAZq8G4DZfx3fk", "user": {"username": "Jan_Kulveit"}}, {"_id": "zravWWtDENvrgxKNa", "postedAt": "2023-01-03T22:18:02.297Z", "postId": "SzNpP3zPWz5aA98YH", "htmlBody": "<blockquote><p>- this <a href=\"https://www.newyorker.com/news/annals-of-inquiry/sam-bankman-fried-effective-altruism-and-the-question-of-complicity\">New Yorker piece</a>, with Zoe explaining <i>\"My recommendations were not intended to catch a specific risk, precisely because specific risks are hard to predict”&nbsp;</i> but still saying ... <i>“But, yes, would we have been less likely to see this crash if we had incentivized whistle-blowers or diversified the portfolio to be less reliant on a few central donors? I believe so.”\"My recommendations were not intended to catch a specific risk, precisely because specific risks are hard to predict”&nbsp;</i> but still saying ... <i>“But, yes, would we have been less likely to see this crash if we had incentivized whistle-blowers or diversified the portfolio to be less reliant on a few central donors? I believe so.”</i></p></blockquote><p>To be fair, this seems like a reasonable statement on Zoe's part:</p><ul><li>If we had incentivised whistle-blowers to come forward around shady things happening at FTX, would we have known about FTX fraud sooner and been less reliant on FTX funding? Very plausibly yes. She says \"likely\" which is obviously not particularly specific, but this would fit my definition of likely.</li><li>If EA had diversified our portfolio to be less reliant on a few central donors, this would have also (quite obviously) mean the crash had less impact on EA overall, so this also seems true.</li></ul><p>Basically, as <a href=\"https://forum.effectivealtruism.org/posts/SzNpP3zPWz5aA98YH/if-ea-community-building-could-be-net-negative-what-follows?commentId=xmGLgmmniyG4Kanfa\">other</a> <a href=\"https://forum.effectivealtruism.org/posts/SzNpP3zPWz5aA98YH/if-ea-community-building-could-be-net-negative-what-follows?commentId=kvRsRZBesGErGPeoc\">comments</a> have stated, you do <a href=\"https://forum.effectivealtruism.org/posts/SzNpP3zPWz5aA98YH/if-ea-community-building-could-be-net-negative-what-follows?commentId=M55XhpbkjEvFwLwsP\">little</a> to actually say why these proposed reforms are, as you initially said, bad or would have no impact. I think if you're going to make a statement like:</p><blockquote><p>\"it seems clear proposed reforms would not have prevented or influenced the FTX fiasco\"&nbsp;</p></blockquote><p>You need to actually provide some evidence or reasoning for this, as clearly lots of people don't believe it's clear. Additionally, if it feels unfair to call Zoe \"not epistemically virtuous\" when you're making quite bold claims, without any reasoning laid out, then saying it would be too time-intensive to explain your thinking.</p><p>For example, &nbsp;you say <a href=\"https://forum.effectivealtruism.org/posts/SzNpP3zPWz5aA98YH/if-ea-community-building-could-be-net-negative-what-follows?commentId=3AtxbQcaQLGMPDwEF\">here </a>that you're concerned about what democratisation actually looks like, which is a fair point and useful object-level argument, but this seems more like a question of implementation rather than the actual idea is necessarily bad.</p>", "parentCommentId": "cXKoiTgYmtmWZ5iAJ", "user": {"username": "JamesOz"}}, {"_id": "DMsbFeKgPN4kCtWWg", "postedAt": "2023-01-03T23:29:54.686Z", "postId": "SzNpP3zPWz5aA98YH", "htmlBody": "<p>I was reacting mostly &nbsp;to this part of the post</p><blockquote><p>I’ve honestly been pretty surprised there has not been more public EA discussion post-FTX of adopting a number of Cremer's <a href=\"https://t.co/fKzB6YzpIc\">proposed institutional reforms</a>, many of which seem to me obviously worth doing&nbsp;<br>...<br>Also, insofar as she'd be willing (and some form of significant compensation is clearly merited), integrally engaging Cremer in whatever post-FTX EA institutional reform process emerges would be both directly helpful and a public show of good faith efforts at rectification.</p></blockquote><p>I think it's fine for a comment to engage with just a part of the original post. Also, if a posts advocates for giving someone some substantial power, it seems fair to comment on media presence of the person.<br><br>Overall, to me, it seem you advocate for double-standard / <a href=\"https://slatestarcodex.com/2014/08/14/beware-isolated-demands-for-rigor/\">selective demand for rigour</a>.<br><br>Post-FTX discussion of Zoe's proposals seems mostly on the level 'Implement Carla Zoe Cremer’s Recommendations' or '<a href=\"https://twitter.com/CarlaZoeC/status/1591333694132097024\">very annoyed this all had to happen before a rethink, given that 10 months earlier, I sat in his office proposing whistleblower protections, transparency over funding sources, bottom-up control over risky donations</a>' or similar high level <i>supportive</i> comments, never going into details of the proposals, and without any realistic analysis of what would have happened. I expressed the opposite sentiment, clearly marking it as my belief.<br><br>Have you seen any actual in detail analysis how would the proposal influenced FTX? I did not. I'm sceptical of the helpfulness - for example, with whistleblower protections...<br>- Many EA orgs have whistleblower protection. Empirically, it seems it had zero impact on FTX, and the damage to the orgs seems independent of this.&nbsp;<br>- There are already laws and incentives for reporting wire fraud. If there was someone in the know from within FTX considering whistleblowing, if I understand SEC and CFTC comments, they would have been eligible for both protection and bounty in millions of dollars- and possibly avoided other bad things happening them, such as going to jail. Why would some EA bounty create stronger incentive?<br>- My impression is the original whistleblowing protection proposal was implicitly directed toward \"EA charities\", not \"companies of EA funders\".</p><blockquote><p>But I think the amount of flack she's taken for this has been disproportionate and sends the wrong signal to others about dissenting.</p></blockquote><p>Can you link to something specific? I haven't found any specific critical post or comment mentioning her on the forum since Nov.&nbsp;<br><br>In contrast, after a Google News search, I think the opposite is closer to reality: media coverage of Zoe's criticism is uncritically positive, and who is taking flack is MacAskill. While I'm sometimes critical of Will, the narrative that he is at fault for not implementing Zoe's proposals seems completely unfair to me.&nbsp;</p>", "parentCommentId": "xmGLgmmniyG4Kanfa", "user": {"username": "Jan_Kulveit"}}, {"_id": "CTJ2DfYhfoCERdkjC", "postedAt": "2023-01-03T23:46:40.488Z", "postId": "SzNpP3zPWz5aA98YH", "htmlBody": "<blockquote>\n<p>If we had incentivised whistle-blowers to come forward around shady things happening at FTX, would we have known about FTX fraud sooner and been less reliant on FTX funding? Very plausibly yes. She says \"likely\" which is obviously not particularly specific, but this would fit my definition of likely.</p>\n</blockquote>\n<p>Why do you believe this? To me, FTX fits more in the reference class of financial firms than EA orgs, and I don't see how EA whistleblower protections would have helped FTX employees whistleblow (I believe that most FTX employees were not EAs, for example). And it seems much more likely to me that an FTX employee would be able to whistle-blow than an EA at a non-FTX org.</p>\n<p>Also, my current best guess is that only the top 4 at FTX/Alameda knew about the fraud, and I have not come across anyone who seems like they might have been a whistleblower (I'd love to be corrected on this though!)</p>\n", "parentCommentId": "zravWWtDENvrgxKNa", "user": {"username": "Neel Nanda"}}, {"_id": "8BqCgz7LLRvL7wdNR", "postedAt": "2023-01-04T00:18:31.672Z", "postId": "SzNpP3zPWz5aA98YH", "htmlBody": "<blockquote><ul><li>If we had incentivised whistle-blowers to come forward around shady things happening at FTX, would we have known about FTX fraud sooner and been less reliant on FTX funding? Very plausibly yes. She says \"likely\" which is obviously not particularly specific, but this would fit my definition of likely.</li></ul></blockquote><p>&nbsp;</p><p>Why do you think so? Whistleblowers inside of FTX would have been protected under US law, and US institution like SEC offer them multi-million dollar bounties. Why would EA scheme create stronger incentive?<br><br>Also: even if the possible whistleblowers inside of FTX were EAs, &nbsp;whistleblowing about fraud at FTX not directed toward authorities like SEC, but toward some EA org scheme, would have been particularly bad idea. The EA scheme would not be equipped to deal with this and would need to basically immediately forward it to authorities, leading to immediate FTX collapse. Main difference would be putting EAs in the centre of the happenings?<br>&nbsp;</p><blockquote><p>If EA had diversified our portfolio to be less reliant on a few central donors, this would have also (quite obviously) mean the crash had less impact on EA overall, so this also seems true.</p></blockquote><p>I think the 'diversified our portfolio' frame is subtly misleading, because it's usually associated with investments or holdings, but here it is applied to 'donors'. You can't diversify donations the same way. Also: assume you recruit donors uniformly, no matter how wealthy they are. Most of the wealth will be with the wealthiest minority , basically because how the wealth distribution looks like. &nbsp;Attempt to diversify donation portfolio toward smaller donors ... would look like GWWC?<br><br>Only real option how to have much less FTX money in EA was to not accept that much FTX funding. Which was a tough call <i>at the time</i>, in part because FTX FF seemed like the biggest step toward decentralized distribution of funding, and a big step toward diversifying from OP.</p>", "parentCommentId": "zravWWtDENvrgxKNa", "user": {"username": "Jan_Kulveit"}}, {"_id": "NJjN4FsWSHkGFampT", "postedAt": "2023-01-04T01:34:03.352Z", "postId": "SzNpP3zPWz5aA98YH", "htmlBody": "<p>I don’t see how this statement can be justified:</p>\n<blockquote>\n<p>$8B in economic damage due to FTX’s fraud</p>\n</blockquote>\n<p>8 billion in <em>value</em> was not destroyed. The net effect is mainly distributional. Financial markets are largely zero sum.  Some investors lost a lot, others gained. If it hurt the price of crypto assets this means that overall, those who have assets other than crypto are marginally better off.</p>\n<p>Of course the chaos causes some value to be lost, but not 8 billion.</p>\n", "parentCommentId": null, "user": {"username": "david_reinstein"}}, {"_id": "Yb9SQx9DyDjMgPgjB", "postedAt": "2023-01-04T01:51:05.645Z", "postId": "SzNpP3zPWz5aA98YH", "htmlBody": "<p>The problem is that most calls for reform lack specifics, and it is very difficult to meaningfully assess most reform proposals without them.&nbsp;</p><p>However, that is not necessarily the reformers' fault. In my view, it's not generally appropriate to deduct points for not offering more specific proposals if the would-be reformer has good reason to believe that reasonable proposals would be summarily sent to the refuse bin.&nbsp;</p><p>If Cremer's proposals in particular are getting a lot of glowing media attention, it seems like it would be worthwhile to do a clearer job as a community explaining why her specific proposals lack enough promise in their &nbsp;summary form to warrant further investigation, and to make an attempt to operationalize ideas that might be warranted and feasible. Even if the ideas were ultimately rejected, \"the community discussed the ideas, fleshed some of them out, and decided that the benefits did not exceed the costs\" is a much more convincing response from an optics perspective than blanket dismissals.&nbsp;</p><p>My own tentative view is that her specific ideas range from the fanciful (and thus unworthy of further investigation/elaboration) to the definitely-plausible-if-fleshed-out, so I think it's important to take each on its own merits. That is, of course, not a suggestion that any individual poster here has an obligation to do that, only that it would be a good thing if done in some manner. On the average, the ideas I've seen described on the forum are better because they are less grand / more targeted + specific.&nbsp;</p>", "parentCommentId": "nq7nbrZbQednXuDc4", "user": {"username": "Jason"}}, {"_id": "9sF5sottsLdHYLHKZ", "postedAt": "2023-01-04T02:23:42.116Z", "postId": "SzNpP3zPWz5aA98YH", "htmlBody": "<p>If someone steals my car, is there is no \"economic damage\" because the thief is now better off to the extent of my loss? I would say I suffered economic damage and someone else got a benefit; the existence of that benefit does not negate the damage I incurred.</p>", "parentCommentId": "NJjN4FsWSHkGFampT", "user": {"username": "Jason"}}, {"_id": "QHqAeiyXvkqMACa5n", "postedAt": "2023-01-04T03:06:19.946Z", "postId": "SzNpP3zPWz5aA98YH", "htmlBody": "<p>There is economic damage, but not necessarily equal to the headline number. It is reduced by netting against the gains to the thief, but increased by things like stress, required investments in security, disruption to plans, degraded incentives, and so on. In this case I would guess the economic damage is very large but still less than $8bn. In the case of a personal mugging I would guess the economic damage far exceeds the value of the contents of your wallet.</p><p>You might also reasonably object that the gains to the thief shouldn't count because they are illegitimate. However, in the FTX case many of the gains seem to have gone to other traders who profited without being guilty.</p>", "parentCommentId": "9sF5sottsLdHYLHKZ", "user": {"username": "Larks"}}, {"_id": "gGQnzkskhTzrwggAE", "postedAt": "2023-01-04T03:35:14.861Z", "postId": "SzNpP3zPWz5aA98YH", "htmlBody": "<p>This seems right within longtermism, but, AFAIK, the vast majority of FTX's grantmaking was longtermist. This decision to focus on longtermism seemed very centralized and might otherwise have shaped the direction and composition of EA disproportionately towards longtermism.</p>\n", "parentCommentId": "ETEQHjWLGLTGrjA5F", "user": {"username": "MichaelStJules"}}, {"_id": "Lw3bx58wDCwGFwfKt", "postedAt": "2023-01-04T04:07:49.061Z", "postId": "SzNpP3zPWz5aA98YH", "htmlBody": "<blockquote><p>Only real option how to have much less FTX money in EA was to not accept that much FTX funding. Which was a tough call at the time, in part because FTX FF seemed like the biggest step toward decentralized distribution of funding, and a big step toward diversifying from OP.</p></blockquote><p>&nbsp;</p><p>And even then, decisions about accepting funding are made by individuals and individual organizations. Would there be someone to kick you out of EA if you accept \"unapproved\" funding? The existing system is, in a sense, fairly democratic in that everyone gets to decide whether they want to take the money or not. I don't see how Cremer's proposal could be effective without a blacklist to enforce community will against anyone who chose to take the money anyway, and that gives whoever maintains the blacklist great power (which is contrary to Cremer's stated aims).</p><p>The reality, perhaps unfortunate, is that charities need donors more than donors need specific charities or movements.</p>", "parentCommentId": "8BqCgz7LLRvL7wdNR", "user": {"username": "Jason"}}, {"_id": "qniCZqnpFcxosLhn3", "postedAt": "2023-01-04T04:08:51.600Z", "postId": "SzNpP3zPWz5aA98YH", "htmlBody": "<p>[Giving myself 5 minutes to reply with a quick point - and failing!] Thank you for writing this. Here are some quick low confidence thoughts on the main argument you made.</p><p>I don't think I understand why you attribute any issues from FTX to community building specifically. &nbsp;The FTX outcome was a convergence of many factors, and movement building doesn't obviously seem to be the most important. So many other EA adjunct practices like philosophising, overconfidence, prioritisation or promoting earning to give could be similarly implicated etc.&nbsp;</p><p>I agree that community building can be net negative in some cases, but I think it is &lt;1% likely it has been negative overall. &nbsp;I personally worry that posts like this could push us in the wrong direction. &nbsp;From my perspective, we have never sufficiently prioritised doing and testing our community building.&nbsp;</p><p>Without past EA movement building, most bad things that involved EA in this timeline would mostly still have happened in different timelines. There would very likely still have been cryptocurrency related frauds and failures and charismatic and smart people like SBF who surprised everyone who trusted them. However, many good things would not have happened, e.g., refer to posts/content about what EA has achieved. There would be ~&lt;1% as many people working on or with EA concepts/ideas and that seems like a very bad thing.</p><p>So in general, I think the solution to what happened with FTX is about getting better processes for dealing with people when in the EA community, more so than trying to slow/change community building in any significant way. &nbsp;I appreciate your suggestions and agree with some, but not all. Unfortunately, I don't have time to engage.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Peterslattery"}}, {"_id": "truiQTuxPZhLQ8HSk", "postedAt": "2023-01-04T10:39:19.169Z", "postId": "SzNpP3zPWz5aA98YH", "htmlBody": "<p>When the discussion is roughly at the level &nbsp;<i>'seem to me obviously worth doing '</i> it seem to me fine to state dissent of the form <i>'often seems bad or not working to me'.</i><br><br>Stating an opinion is not <i>'appeal to authority'</i>. I think in many cases it's useful to know what people believe, and if I have to choose between a forum where people state their beliefs openly and more often, and a forum, where people state beliefs only when they are willing to write a long and detailed justification, I prefer the first.<br><br>I'm curious in which direction you think the supposed <i>'conflict of interests'</i> point:<br><br>I'm employed at the same institution (FHI) as Zoe works, and we were part of the same RSP program (although in different cohorts). &nbsp;This mostly creates some incentive to not criticize Zoe's ideas publicly and would preclude me from e.g. reviewing Zoe's papers, because of favourable bias.<br><br>Also ... I think while being a stakeholder in a grant to buy a cheap and cost-saving events venue has not much to do with the topics in question, it mostly creates some incentive to<i> be silent, </i>because by engaging critically with the topic, you increase the risk someone will summon an angry twitter mob to attack you.<br><br>Overall ... &nbsp;it's probably worth noticing people like you <i>strong downvoting&nbsp;</i> my comment (now at karma 5, yours at 12) are the side actually trying to <i>silence the critic </i>here<i>, </i>while agreement with &nbsp;\"it is surprising that some of Carla Zoe Kremer’s reforms haven’t been implemented\"or vague criticisms of \"EA leadership\" are what's in vogue on EA forum now. &nbsp;&nbsp;</p>", "parentCommentId": "kvRsRZBesGErGPeoc", "user": {"username": "Jan_Kulveit"}}, {"_id": "erGyE63FmcPT54HPB", "postedAt": "2023-01-04T11:13:58.922Z", "postId": "SzNpP3zPWz5aA98YH", "htmlBody": "<p>Yes, that seems correct.</p>", "parentCommentId": "gGQnzkskhTzrwggAE", "user": {"username": "Davidmanheim"}}, {"_id": "jW5zRiypFSMJFpy4Y", "postedAt": "2023-01-04T11:18:16.931Z", "postId": "SzNpP3zPWz5aA98YH", "htmlBody": "<p>Strongly agree - and if Dustin Moskowitz or Jann Tallinn wants to fund early groups in universities or in developing countries, that seems like a great place to give part of the far-more-than-10%. (But I'd still like it more if that giving wasn't called or considered EA donations.)</p>", "parentCommentId": "iNGfhChLHgGHjLAns", "user": {"username": "Davidmanheim"}}, {"_id": "vaqc72vzTg3meX3ez", "postedAt": "2023-01-04T13:13:23.555Z", "postId": "SzNpP3zPWz5aA98YH", "htmlBody": "<p>As usual, the best definition depends of the term on the use you want to make of it.</p>\n<p>From a social welfare standpoint, if the thief values the car as much as you did, and he doesn’t spend resources covering up his crime, and you don’t incur an expense in filing police reports etc.,  there is no social loss.</p>\n<p>I wouldn’t want to, e.g., count the FTX blowup as an 8 billion dollar loss in making cost effectiveness analysis comparisons to something like GiveDirectly.</p>\n", "parentCommentId": "9sF5sottsLdHYLHKZ", "user": {"username": "david_reinstein"}}, {"_id": "JCqaBZeQ3j7RGJb2x", "postedAt": "2023-01-04T15:30:15.077Z", "postId": "SzNpP3zPWz5aA98YH", "htmlBody": "<p>I don't think (almost) anyone is trying to silence you here; the agreevotes on your top comment are pretty high and I'd expect a silencing campaign to target both. That suggests to me that the votes are likely due to what some perceive as an uncharitable tone toward Zoe, or possibly a belief that having the then-top comment be one that focuses heavily on Zoe's self-portrayal in the media risks derailing discussion of the original poster's main points (Zoe's potential involvement being a subpoint to a subpoint).</p>\n", "parentCommentId": "truiQTuxPZhLQ8HSk", "user": {"username": "Jason"}}, {"_id": "EJkuTyiwFAz3C8vye", "postedAt": "2023-01-04T15:32:01.546Z", "postId": "SzNpP3zPWz5aA98YH", "htmlBody": "<p>ok, an incomplete and quick response &nbsp;to the comments below (sry for typos). thanks to the kind person who alerted me to this discussion going on (still don't spend my time on your forum, so please do just pm me if you think I should respond to something)</p><p>1.</p><p>- regarding blaming Will or benefitting from the media attention</p><p>- i don't think Will is at fault alone, that would be ridiculous, I do think it would have been easy for him to make sure something is done, if only because he can delegate more easily than others (see below)</p><p>- my tweets are reaction to his tweets where he says he believes he was wrong to deprioritise measures</p><p>- given that he only says this after FTX collapsed, I'm saying, it's annoying that this had to happen before people think that institutional incentive setting needs to be further prioritised</p><p>- journalists keep wanting me to say this and I have had several interviews in which I argue against this simplifying position</p><p>2.<br>- i'm rather sick of hearing from EAs that i'm arguing in bad faith</p><p>- if I wanted to play nasty it wouldn't be hard (for anyone) to find attack lines, e.g. i have not spoken about my experience of sexual misconduct in EA and i continue to refuse to name names in respect to specific actions I criticise or continue to get passed information about, because I want to make sure the debate is not about individuals but about incentives/structures</p><p>- a note on me exploiting the moment of FTX to get media attention</p><p>- really?</p><p>- please join me in speaking with the public or with journalists, you'll see it's no fun at all doing it. i have a lot of things i'd rather be doing. many people will be able to confirm that i've tried to convince them to speak out too but i failed, likely because</p><p>- it's pretty risky because you end up having rather little control over how your quotes will be used, so you just hope to work with someone who cares, but every journalist has a pre-conception of course. it's also pretty time consuming with very little impact and then you have to deal with forum debates like this one. but hey if anyone want to join me, I encourage anyone who want to speak to the press to message me and I'll put you in touch.</p><p>- the reason I do it is because I think EA will 'work' just not in the way that many good people in it intend it to work</p><p>3.&nbsp;</p><p>- I indeed agree that these measures are not 'proven' to be good because of FTX</p><p>- i think they were a good idea before FTX and they continue to be good ideas</p><p>- they are not 'my' ideas, they are absolutely standard measures against big bureaucracy misconduct</p><p>- i don't want anyone to 'implement my recommentions' just because they're apparently mine (they are not), they are a far bigger project than a single person should handle and my hope was that the EA community would be full of people who'd maybe take it as inpiration and do something with it in their local context - it would then be their implmentation. &nbsp;</p><p>- i like the responses I had on twitter that were saying that FTX was in fact the first to do re-granting</p><p>- I agree and I thought that was great!</p><p>- in fact they were interested in funding a bunch of projects I care a lot about, including a whole section on 'epistemics'! I'm not sure it was done for the right reasons (maybe the incentive to spend money fast was also at play), and the re-granting was done without any academic rigor, data collection or metrics about how well it works (as far as I know), but I was still happy to see it</p><p>- I don't see how this invalidates the claim that re-granting is a good idea though</p><p>4.&nbsp;</p><p>- those who only want to know if my recommendations would have prevented this specific debacle are missing the point. someone may have blown the whistle, some transparency may have helped raise alarms, fewer people may have accepted the money, distributed funding may have meant more risk averse people would have had a say about whether to accept the money - or not. risk reduction is about reduction, not bringing it down to 0. so, do those measures, depending on how they're set up, reduce risk? yes I can see how they would, e.g. is it true that there were slack messages on some slack for leaders which warned against SBF, or is it true that several orgisations decided (but don't disclose why) against taking FTX funding https://www.newyorker.com/news/annals-of-inquiry/sam-bankman-fried-effective-altruism-and-the-question-of-complicity? I don't know enough about the people involved to say what each would have needed to be incentivised to be more public about their concerns. but do you not think it would have been useful knowledge to have available, e. g. for those EA members who got indiv grants and made plans with those grants?</p><p>even if institutional measures would not have prevented the FTX case, they are likely to catch a whole host of other risks in the future.</p><p>5.&nbsp;</p><p>-The big mistake that I am making is to not be an EA but to comment on EA. It makes me vulnerable to the attack of \"your propositions are not concrete enough to fix our problems, so you must be doing it to get attention?\" I am not here trying to fix your problems.</p><p>- I actually do think that outsiders are permitted to ask you to fix problems because your stated ambition is to do risk analysis for all of us, not just for effective altruism, but for, depending on what kind of EA you are, a whole category of sentient beings, including catagories as large as 'humanity' or 'future beings'. That means that even if I don't want to wear your brand, I can demand that you answer the questions of who gets to be in the positions to influence funding and why? And if it's not transparent, why is it not transparent? Is there a good reason for why it is not transparent? If I am your moral patient, you should tell me why your current organizational structures are more solid, more epistemically trustworthy than an alterntive ones.</p><p>6.&nbsp;</p><p>- i don't say anywhere that 'every procedure ought to be fully democratised' or 'every organisation has to have its own whistleblower protection scheme' - do i?</p><p>- <i>*clearly*</i> these are broad arguments, geered towards starting a discussion across EA, within EA institutions that need to be translated into concrete proposals and adjustments and assessments that meet each contextual need</p><p>- there's no need to dismiss the question of what procedures actually lead to the best epistemic outcomes by arguing that 'democratising everything' would bring bureaucracy (of course it would and no one is arguing for that anyway)</p><p>- for all the analyses of my tweets, please also look at the top page of the list of recommendations for reforms , it says something like \"clearly this needs to be more detailed to be relevant but I'll only put in my free time if I have reason to believe it will be worth my time\". There was no interest by Will and his team to follow up with any of it, so I left it at that (i had sent another email after the meeting with some more concrete steps necessary to at least get data, do some prototyping and reserach to test some of my claims about decentralised funding, and in which I offered I could provide advice and help out but that they should employ someone else to actually lead the project). Will said he was busy and would forward it to his team. I said 'please reach out if you have any more questions' and never heard from anyone again. It won't be hard to come up with concrete experiments/ideas for a specific context/organisation/task/team but I'm not sure why it would be productive for me to do that publically rather than at the request of a specific organisation/team. If you're an EA who cares about EA having those measures in place, please come up with those implemenation details for your community yourself.</p><p>7.&nbsp;</p><p>- I'd be very happy to discuss details of actually implementing some of these proposals for some particular contexts in which I believe it makes sense to try them. I'd be very happy to consult organizations that are trying to make steps in those directions. I'd be very happy to engage with and see a theoretical discussion about the actual state of the reserach.</p><p>But none of the discussions that I've seen so far are actually on the level of detail that would match the forefront of the experimental data and scholarly work that I've seen so far. Do you think scholars of democratic theory have not yet thought about a response to the typical 'but most people are stupid'? Everyone who dismisses decentralised reasoning as a viable and epistemically valuable approach, should at least engage with the arguments by political scientists (I've cited a bunch in previous publications/twitter, here again, e.g. Landemore, Hong&amp;Page are a good start) who spent years on these questions (ie not me) and then argue on their level to bring the debate forward if they then still think they can.</p><p>8.&nbsp;</p><p>Jan, you seem particularly unhappy with me, reach out if you like, &nbsp;I'm happy to have a chat or answer some more questions.&nbsp;<br><br><br><br><br>&nbsp;</p><p><br>&nbsp;</p>", "parentCommentId": null, "user": {"username": "CarlaZoeC"}}, {"_id": "T3FyW5ivifwdA6AvF", "postedAt": "2023-01-04T16:57:42.327Z", "postId": "SzNpP3zPWz5aA98YH", "htmlBody": "<p>It would be a bit rude to focus on a minor part of your comment after you posted such a comprehensive reply, so I first want to say that I agreed with some of the points.<br><br>With that out of the way, I even more want to say that the following perspective strikes me as immoral, in that it creates terrible, unfair incentives:</p><blockquote><p>- I actually do think that outsiders are permitted to ask you to fix problems because your stated ambition is to do risk analysis for all of us, not just for effective altruism, but for, depending on what kind of EA you are, a whole category of sentient beings, including catagories as large as 'humanity' or 'future beings'. That means that even if I don't want to wear your brand, I can demand that you answer the questions of who gets to be in the positions to influence funding and why? And if it's not transparent, why is it not transparent? Is there a good reason for why it is not transparent? If I am your moral patient, you should tell me why your current organizational structures are more solid, more epistemically trustworthy than an alterntive ones.</p></blockquote><p>The problem I have with this framing is that it \"punishes\" EA (by applying isolated demands of \"justify yourselves\") for its ambitious attempts to improve the world, while other groups of people (or other ideologies) (presumably?) don't have to justify their <i>in</i>action. And these demands come at a time when EA doesn't even have <i>that much</i> power/influence. (If EA were about to work out the constitution of a world government about to be installed, then yeah, it would very much be warranted – both for EA outsiders and insiders – to see \"let's scrutinize EA and EAs\" as a main priority!) &nbsp;<br><br>The longtermist EA worldview explicitly says that the world is broken and on a bad trajectory, so that we're pretty doomed if nothing changes soon. (Or, at least it says that we're running an unjustified level of unnecessary risks if we don't change anything soon – not all EAs are of the view that existential risks are &gt;10%.)&nbsp;<br><br>&nbsp;If this worldview is correct, then what you're demanding is a bit like going up to Frodo and his companions and stalling them to ask a long list of questions about their decision procedures and how much they've really thought through about what they're going to do once they have achieved more of their aims, and if they'd not rather consult with the populations of the Shire or other lands in Middle earth to decide what they should do. All of that at a time when the companionship is still mostly just in Rivendell planning for future moves (and while Sauron is getting ready to kill lots of humans, elves, and dwarves).<br><br>Of course, the communists <i>also </i>claimed that the world is broken when they tried to convince more people to join them and seek influence to make the world better. So, I concede that it's not <i>a priori</i> unreasonable to consider it urgent and morally pressing, when you come across a group of self-proclaimed world-improvers on an upwards trajectory (in terms of real-world influence), to scrutinize if they have their head together and have the integrity needed to in expectation change things for the better rather than for the worse.</p><p>The world is complicated; it matters to <i>get things right</i>. Sometimes self-proclaimed world improvers are the biggest danger, but sometimes the biggest danger is the reason why self-proclaimed world improvers are hurrying around doing stuff and appear kind of desperate. You can be wrong in both directions:</p><ul><li>slow down* Frodo at a point where it's (a) anyway unlikely that he'll succeed and (b) totally a dumb use of time <strong>(edit)</strong> to focus on things that <i>only ever become a priority if Middle earth survives Sauron</i>, <strong>(edit_end)</strong> given the imminent threat of Sauron</li><li>fail to apply scrutiny to the early Marxists despite (a) there were already signs of them becoming uncannily memetically successful with a lot of resentfulness in the societal undercurrent (which is hard to control) and (b) the \"big threat\" was 'just' Capitalism and not Sauron. (One thing to say about Capitalism is \"it works,\" and it seems potentially very risky to mess with systems that work.)</li></ul><p>*Not all types of criticism / suggestions for improvement are an instance of \"slowing down.\" What I'm criticizing here is the attitude of \"you owe us answers\" rather than \"here's some criticism, would be curious for replies, especially if more people agree with my criticism (in which case the voices calling replies will automatically grow/become louder).\"</p><p>Journalists will often jump towards the perspective** that's negative and dismissive of EA concerns because that fits into existing narratives and because journalist haven't thought about the EA worldview in detail (and their primary reaction to things like AI risk is often driven by absurdity heuristics rather than careful engagement). You, by contrast, have thought through these things. So, I'd say it's on you to make an attempt to at least present EA in a fair light – though I of course understand that, as a <i>critic</i> of EA, it's reasonable that this isn't your main priority. (And maybe you've tried this – I understand it's hard to get points across with some journalists.)<br><br>**One unfortunate thing about some of the reporting on EA is also that journalists sometimes equate EA with \"Silicon valley tech culture,\" even though the latter is arguably what EAs are to some degree in tension with (AI capabilities research and \"tech progress too fast before wisdom/foresight can catch up.\") That makes EA seem powerful so you can punch upwards at it, when it fact EA is still comparatively small. (And smaller now after recent events.)&nbsp;</p>", "parentCommentId": "EJkuTyiwFAz3C8vye", "user": {"username": "Lukas_Gloor"}}, {"_id": "CuACCS3z5LtMoqsvC", "postedAt": "2023-01-04T17:59:35.617Z", "postId": "SzNpP3zPWz5aA98YH", "htmlBody": "<p>Indeed Lukas, I guess what I'm saying is: given what I know about EA, I would not entrust it with <i>the ring </i>.&nbsp;</p>", "parentCommentId": "T3FyW5ivifwdA6AvF", "user": {"username": "CarlaZoeC"}}, {"_id": "7nc3eJ8BCchaLjokK", "postedAt": "2023-01-04T18:06:29.097Z", "postId": "SzNpP3zPWz5aA98YH", "htmlBody": "<blockquote><p>With that out of the way, I even more want to say that the following perspective strikes me as immoral, in that it creates terrible, unfair incentives:</p><blockquote><p>\"- I actually do think that outsiders are permitted to ask you to fix problems because your stated ambition is to do risk analysis for all of us, not just for effective altruism, but for, depending on what kind of EA you are, a whole category of sentient beings, including catagories as large as 'humanity' or 'future beings'. That means that even if I don't want to wear your brand, I can demand that you answer the questions of who gets to be in the positions to influence funding and why? And if it's not transparent, why is it not transparent? Is there a good reason for why it is not transparent? If I am your moral patient, you should tell me why your current organizational structures are more solid, more epistemically trustworthy than an alterntive ones.\"</p></blockquote><p>The problem I have with this framing is that it \"punishes\" EA (by applying isolated demands of \"justify yourselves\") for its ambitious attempts to improve the world, while other groups of people (or other ideologies) (presumably?) don't have to justify their <i>in</i>action. And these demands come at a time when EA doesn't even have <i>that much</i> power/influence. (If EA were about to work out the constitution of a world government about to be installed, then yeah, it would very much be warranted – both for EA outsiders and insiders – to see \"let's scrutinize EA and EAs\" as a main priority!) &nbsp;</p></blockquote><p><i><strong>Immoral?</strong></i><strong> </strong>This is a surprising descriptor to see used here.<br>The standard of \"justify yourselves\" to a community soup kitchen, or some other group / ideology is very different to the standard of \"justify yourselves\" to a movement apparently dedicated to doing the most good it can for those who need it most / all humans / all sentient beings / all sentience that may exist in the far future. The decision relevant point shouldn't be \"well, does [some other group] justify themselves and have transparency and have good institutions and have epistemically trustworthy systems? If not, asking EA to reach it is an isolated demand for rigour, and creates terrible incentives.\" Like - what follows? Are you suggesting we should then ignore this because other groups don't do this? Or because critics of EA don't symmetrically apply these criticisms to all groups around the world?</p><p>The questions (imo) should be something like - are these actions beneficial in helping EA be more impactful?<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefv5sf11g09ap\"><sup><a href=\"#fnv5sf11g09ap\">[1]</a></sup></span>&nbsp;Are there other ways of achieving the same goals better than what's proposed? Are any of these options worth the costs? I don't see why other groups' inaction justifies EA's, if it's the case that these actions are in fact beneficial.</p><p>&nbsp;</p><blockquote><p>And these demands come at a time when EA doesn't even have <i>that much</i> power/influence. (If EA were about to work out the constitution of a world government about to be installed, then yeah, it would very much be warranted – both for EA outsiders and insiders – to see \"let's scrutinize EA and EAs\" as a main priority!) &nbsp;</p></blockquote><p>If EA wants to be in a position to work out the constitution of a world government about to be installed, it needs to first show outsiders that it's more than a place of interesting intellectual ideas, but a place that can be trusted to come up with interventions and solutions that will actually work in practice. If the standard for \"scrutinising EA\" is when EA is about to work out the constitution of a world government about to be installed, it is probably already too late.</p><p>&nbsp;</p><blockquote><p>What I'm criticizing here is the attitude of \"you owe us answers\" rather than \"here's some criticism, would be curious for replies, especially if more people agree with my criticism (in which case the voices calling replies will automatically grow/become louder).\"</p></blockquote><p>I don't want to engage in a discussion about the pros and cons of the Democratising Risk paper, but from an outsider's perspective it seems pretty clear to me that Carla did engage in a good faith \"EA-insider\" way, even if you don't think she's expressing criticism in a way you like now. But again - if you think EA is actually analogous to Frodo and responsible for saving the world, of course it would be reasonable for outsiders to take strong interest in what your plan is, and where it might go wrong, or be concerned about any unilateral actions you might take - they are directly impacted by what you choose to do with the ring, they might be in a position to greatly help or hinder you. For example, they might want someone more capable to deliver the ring, and not just the person who happened to inherit it from his cousin.</p><p>More generally, EA should remain open to criticism that isn't delivered at your communication norms, and risks leaving value on the table if it ignores criticism solely because it isn't expressed in an attitude that you prefer.</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnv5sf11g09ap\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefv5sf11g09ap\">^</a></strong></sup></span><div class=\"footnote-content\"><p>e.g. via more trust within the community at those who are steering it, more trust from external donors, more trust from stakeholders who are affected by EA's goals, or some other way?</p></div></li></ol>", "parentCommentId": "T3FyW5ivifwdA6AvF", "user": {"username": "bruce"}}, {"_id": "o2ZpNnp8pDtF2ekEA", "postedAt": "2023-01-04T19:16:28.375Z", "postId": "SzNpP3zPWz5aA98YH", "htmlBody": "<p>I disagree with Jan here entirely, but also with you.</p>\n<p>First of all, I don't see what the problem is with commenting one's opinion; \"Reasoning transparency\" is a thing that's only sometimes appropriate.</p>\n<p>Second, I wouldn't call FHI a \"core EA organisation\" and I frankly don't see the conflict of interest at all.</p>\n", "parentCommentId": "kvRsRZBesGErGPeoc", "user": {"username": "Guy Raveh"}}, {"_id": "c8YhrNEHC9Jt8u49N", "postedAt": "2023-01-04T19:52:46.759Z", "postId": "SzNpP3zPWz5aA98YH", "htmlBody": "<blockquote><p><i><strong>Immoral? </strong></i>This is a really surprising descriptor to see used here.</p></blockquote><p>Yeah. I have strong feelings that social norms &nbsp;or norms of discourse should never disincentivize trying to do more than the very minimum one can get away with as an apathetic person or as a jerk. For example, I'm annoyed when people punish others for honesty in cases where it would have been easy to tell a lie and look better. Likewise, I find it unfair if having the stated goal to make the future better for all sentient beings is somehow taken to imply \"Oh, you care for the future of <i>all </i>humans, and even animals? That's suspicious – we're definitely going to apply extra scrutiny towards you.\" Meanwhile, AI capabilities companies continue to scale up compute and most of the world is busy discussing soccer or what not. Yet somehow,\"Are EAs following democratic processes and why does their funding come from very few sources?\" is made into the bigger issue than widespread apathy or the extent to which civilization might be acutely at risk.</p><blockquote><p>The question shouldn't be \"well, does [some other group] justify themselves and have transparency and have good institutions and have epistemically trustworthy systems? If not, asking EA to reach it is an isolated demand for rigour, and creates terrible incentives.\" Like - what follows?</p></blockquote><p>EAs who are serious about their stated goals have the most incentive of anyone to help the EA movement get its act together. The idea that \"it's important to have good institutions\" is something EA owes <i>to outsiders</i> is what seems weird to me. Doesn't this framing kind of suggest that EAs couldn't motivate themselves to try their best if it weren't for \"institutional safeguards.\" What a depressing view of humans, that they can only act according to their stated ideals if they're watched at every step and have to justify themselves to critics!<br><br>EAs have discussions about governance issues EA-internally, too. It's possible (in theory) that EA has as many blindspots as Zoe thinks, but it's also possible that Zoe is wrong (or maybe it's something in between). Either way, I don't think &nbsp;anyone in EA, nor \"EA\" as a movement, has any obligation to engage in great detail with Zoe's criticisms if they don't think that's useful.* (Not to say that they don't consider the criticism useful – my impression is that there are EAs on both sides, and that's fine!)</p><p>If a lot of people agree with Zoe's criticism, that creates more social pressure to answer to her points. That's probably a decent mechanism to determine what an \"appropriate\" level of minimally-mandatory engagement should be – though it depends a bit whether the social pressure comes from well-intentioned people who reasonably informed about the issues or whether some kind of \"let's all pile on these stupid EAs\" dynamics emerge. (So far, the dynamics seem healthy to me, but if EA keeps getting trashed in the media, then this could change.)</p><p>*(I guess if someone's impression of EA was \"group of people who want to turn all available resources into happiness simulations regardless of what existing people want for their future,\" then it would be reasonable for them to go like, \"wtf, if that's your movement's plan, I'm concerned!\" However, that would be a strawman impression of EA. Most EAs endorse moral views according to which individual preferences matter and \"eudaimonia\" is basically \"everyone gets what they most want.\" Besides, even the few hedonist utilitarians [or negative utilitarians] within EA think preferences matter and argue for being nice to others with different views.)</p><blockquote><p>The questions should just be - are these actions beneficial in helping EA be more impactful?&nbsp;<a href=\"https://forum.effectivealtruism.org/posts/SzNpP3zPWz5aA98YH/if-ea-community-building-could-be-net-negative-what-follows?commentId=7nc3eJ8BCchaLjokK#fnv5sf11g09ap\"><sup>[1]</sup></a>&nbsp;Are there other ways of achieving the same goals better than what's proposed? Are any of these options worth the costs? I don't see why other groups' inaction justifies EA's, if it's the case that these actions are in fact beneficial.</p></blockquote><p>I don't disagree with this part. I definitely think it's wise for EAs to engage with critics, especially thoughtful critics, which I consider Zoe to be one of the best examples of, despite disagreeing with probably at least 50% of her specific suggestions.</p><blockquote><p>I don't want to engage in a discussion about the pros and cons of the Democratising Risk paper, but from an outsider's perspective it seems pretty clear to me that Carla did engage in a good faith \"EA-insider\" way, even if you don't think she's expressing criticism in a way you like now.</p></blockquote><p>While I did use the word \"immoral,\" I was only commenting on the framing Zoe/Carla used in that one particular paragraph I quoted. I definitely wasn't describing her overall behavior!<br><br>In case you want my opinion, I am a bit concerned that her rhetoric is often a bit \"sensationalist\" in a nuance-lacking way, and this makes EA look bad to journalists in a way I consider uncalled for. But I wouldn't label that \"acting in bad-faith;\" far from it!</p><blockquote><p>But again - if you think EA is actually analogous to Frodo and responsible for saving the world, of course it would be reasonable for outsiders to take interest in what your plan is, and where it might go wrong - they are directly impacted by what you choose to do with the ring, they might be in a position to greatly help or hinder you. For example, they might want someone more capable to deliver the ring, and not just the person who happened to inherit it from his cousin.</p></blockquote><p>Yeah, I agree with all of that. Still, in the end, it's up to EAs themselves to decide which criticisms to engage with at length and where it maybe isn't so productive.</p><blockquote><p>For example, they might want someone more capable to deliver the ring, and not just the person who happened to inherit it from his cousin.</p></blockquote><p>In the books (or the movies), this part is made easy by having a kind and wise old wizard – who wouldn't consider going with Gandalf's advice a defensible decision-procedure!&nbsp;<br><br>In reality, \"who gets to wield power\" is more complicated. But one important point in my original comment was that EA doesn't even have that much power, and <i>no ring </i>(nor anything analogous to it – that's a place where the analogy breaks). So, it's a bit weird to subject EA to as much scrutiny as would be warranted if they were about to enshrine their views into the constitution of a world government. All longtermist EA is really trying to do right now is trying to ensure that people won't be dead soon so that there'll be <i>the option</i> to talk governance and so on <i>later on</i>. (BTW, I do expect EAs to write up proposals for visions of AI-aided ideal governance at some point. I think that's good to have and good to discuss. I don't see it as the main priority right now because EAs haven't yet made any massive bids for power in the world. Besides, it's not like whatever the default would otherwise be has much justification. And you could even argue that EAs have done the most so far out of any group promoting discourse about important issues related to fair governance of the future.) &nbsp;</p>", "parentCommentId": "7nc3eJ8BCchaLjokK", "user": {"username": "Lukas_Gloor"}}, {"_id": "L8yKoTa6tbiYhWuQz", "postedAt": "2023-01-04T19:56:03.332Z", "postId": "SzNpP3zPWz5aA98YH", "htmlBody": "<p>I feel pretty confused by this and would love better estimates of the actual amount of money that was \"lost\" in the FTX situation. It seems plausible to me (though not likely) that it's above $8B, since a lot of people made plans conditional on FTX being legitimate in a way that now wiped out a lot of economic gains, and the long-term trust that was lost in the markets was worth more than $8B.&nbsp;</p><p>My best guess number for this is something in the $3-4B range, but that's really very much an ass-number.</p>", "parentCommentId": "QHqAeiyXvkqMACa5n", "user": {"username": "Habryka"}}, {"_id": "kwia478L99ydJvsxk", "postedAt": "2023-01-04T19:56:19.948Z", "postId": "SzNpP3zPWz5aA98YH", "htmlBody": "<p>I agree insofar as status as an intended EA beneficiary does not presumptively provide someone with standing demand answers from EA about risk management. However, non-EA persons are also potentially subject to the risk of harms generated by EA, and that status gives them at least some degree of standing.&nbsp;</p><p>I think the LOTR analogy is inapt. Taking Zoe's comment here at face value, she is not suggesting that everyone put Project Mount Doom on hold until the Council of Elrond runs some public-opinion surveys. She is suggesting that reform ideas warrant further development and discussion. That's closer to asking for some time of a mid-level bureaucrat at Rivendell and a package of lembas than diverting Frodo. Yes, it may be necessary to bring Frodo in at some point, but only if preliminary work suggests it would be worthwhile to do so. &nbsp;</p><p>I recognize that there could be some scenarios in which the utmost single-mindedness is essential: the Nagzul have been sighted near the Ringbearer. But other EA decisions don't suggest that funders and leaders are at Alert Condition Nagzul. For example, while I don't have a clear opinion on the Wytham purchase, it seems to have required a short-term expenditure of time and lock-up of funds for an expected medium-to-long-run payoff.</p>", "parentCommentId": "T3FyW5ivifwdA6AvF", "user": {"username": "Jason"}}, {"_id": "A4MdoYCiNrQMQL8Wd", "postedAt": "2023-01-04T20:15:10.195Z", "postId": "SzNpP3zPWz5aA98YH", "htmlBody": "<p>For what it’s worth, I think that you are a well-liked and respected critic not just outside of EA, but also within it. <a href=\"https://forum.effectivealtruism.org/users/carlazoec\">You have</a> three posts and 28 comments but a total karma of 1203! Compare this to <a href=\"https://forum.effectivealtruism.org/users/philosophytorres\">Emile Torres</a> or <a href=\"https://forum.effectivealtruism.org/users/erikhoel\">Eric Hoel</a> or basically any other external critic with a forum account. I’m not saying this to deny that you have been treated unfairly by EAs, I remember one memorable event when someone else was accused by a <a href=\"https://forum.effectivealtruism.org/posts/BvNxD66sLeAT8u9Lv/?commentId=ZfZgXaKSFkYR3YpYC#GTXHKoztsC5Td4vvJ\">prominent EA</a> of being your sock-puppet on basically no evidence. This just to say, I hope you don’t get too discouraged by this, overall I think there’s good reason to believe that you are having some impact, slowly but persistently, and many of us would welcome you continuing to push, even if we have various specific disagreements with you (as I do). This comment reads to me as very exhausted, and I understand if you feel you don’t have the energy to keep it up, but I also don’t think it’s a wasted effort.</p>\n", "parentCommentId": "EJkuTyiwFAz3C8vye", "user": {"username": "Devin Kalish"}}, {"_id": "SED5CdhBiAdsh34gN", "postedAt": "2023-01-04T20:47:12.371Z", "postId": "SzNpP3zPWz5aA98YH", "htmlBody": "<blockquote>\n<p>Yeah. I have strong feelings that social norms  or norms of discourse should never disincentivize trying to do more than the very minimum one can get away with as an apathetic person or as a jerk. For example, I'm annoyed when people punish others for honesty in cases where it would have been easy to tell a lie and look better. Likewise, I find it unfair if having the stated goal to make the future better for all sentient beings is somehow taken to imply \"Oh, you care for the future of all humans, and even animals? That's suspicious – we're definitely going to apply extra scrutiny towards you.\" Meanwhile, AI capabilities companies continue to scale up compute and most of the world is busy discussing soccer or what not. Yet somehow,\"Are EAs following democratic processes and why does their funding come from very few sources?\" is made into the bigger issue than widespread apathy or the extent to which civilization might be acutely at risk.</p>\n</blockquote>\n<p>I think this is an undervalued idea. But I also think that there's a distinct but closely related idea, which is valuable, which is that for any Group X with Goal Y, it is nearly always instrumentally valuable for Group X to hear about suggestions about how it can better advance Goal Y, especially from those who believe that Goal Y is valuable. Sometimes this will read as (or have the effect of) disincentivizing adopting Goal Y (because it leads to criticism), but in fact it's often much easier to marginally improve the odds of Goal Y being achieved by attempting to persuade Group X to do better at Y than to persuade Group ~X who believes ~Y.  I take Carla Zoe to be doing this good sort of criticism, or at least that's the most valuable way to read her work.</p>\n", "parentCommentId": "c8YhrNEHC9Jt8u49N", "user": {"username": "Cullen_OKeefe"}}, {"_id": "FxK9CLEuGGn6vfdYG", "postedAt": "2023-01-04T20:48:16.060Z", "postId": "SzNpP3zPWz5aA98YH", "htmlBody": "<blockquote><p>However, non-EA persons are also potentially subject to the risk of harms generated by EA, and that status gives them at least some degree of standing.</p></blockquote><p>Yeah, I agree that if we have reason to assume that there might be significant <i>expected harms caused by EA</i>, then EAs owe us answers. But I think it's a leap of logic to go from \"because your stated ambition is to do risk analysis for all of us\" to \"That means that even if I don't want to wear your brand, I can demand that you answer the questions of [...]\" – even if we add the hidden premise \"this is about expected harms caused by EA.\" Just because EA does \"risk analysis for all sentient beings\" doesn't mean that EA puts sentient beings <i>at risk</i>. Having suboptimal institutions is bad, but I think it's far-fetched to say that it would put non-EAs at risk. At least, it would take more to spell out the argument (and might depend on specifics – perhaps the point goes through in very specific instances, but not so much if e.g., an EA org buys a fancy house).&nbsp;<br><br>There are some potentially dangerous memes in the EA memesphere around optimizing for the greater good (<a href=\"https://forum.effectivealtruism.org/posts/T975ydo3mx8onH3iS/ea-is-about-maximization-and-maximization-is-perilous\">discussed here</a>, recently), which is the main concern I actually see and share. But if that was the only concern, it should be highlighted as such (and it would be confusing why many arguments then seem to be about seemingly unrelated things). (I think risks from act consequentialism was <i>one point</i> out of many in the Democratizing risk paper – I remember I <a href=\"https://forum.effectivealtruism.org/posts/gx7BEkoRbctjkyTme/democratising-risk-or-how-ea-deals-with-critics-1?commentId=XW9Gjww7rJsHjo4eD\">criticized</a> the paper for not mentioning any of the ways EAs themselves have engaged with this concern.)&nbsp;<br><br>By contrast, if the criticism of EA is more about \"you fail at your aims\" rather than \"you pose a risk to all of us,\" then my initial point still applies, that EA doesn't have to justify itself more so than any other similarly-sized, similarly powerful movement/group/ideology. Of course, it seems very much worth listening if a reasonable-seeming and informed person tells you \"you fail at your aims.\"&nbsp;</p>", "parentCommentId": "kwia478L99ydJvsxk", "user": {"username": "Lukas_Gloor"}}, {"_id": "aMbQzvvmwmxRRZDdT", "postedAt": "2023-01-04T21:05:36.411Z", "postId": "SzNpP3zPWz5aA98YH", "htmlBody": "<p>Thank you for taking the time to write this up, it is encouraging - I also had never thought to check my karma ...</p>", "parentCommentId": "A4MdoYCiNrQMQL8Wd", "user": {"username": "CarlaZoeC"}}, {"_id": "eGBPNcey3H3NqmFpy", "postedAt": "2023-01-04T21:20:03.036Z", "postId": "SzNpP3zPWz5aA98YH", "htmlBody": "<p>I would also point out that I think the proposition that \" that social norms or norms of discourse should <strong>never</strong> disincentivize trying to do more than the very minimum one can get away with as an apathetic person or as a jerk\" is both:</p>\n<ol>\n<li>Probably undesirable to implement in practice because any criticism will have some disincentivizing effect.</li>\n<li>Probably violated by your comment itself, since I'd guess that any normal person would be disincentivized to some extent by engaging in constructive criticism (above the baseline of apathy or jerkiness) that is likely to be labeled as immoral.</li>\n</ol>\n<p>This is just to say that I value the general maxim you're trying to advance here, but \"never\" is way too strong. Then it's just a boring balancing question.</p>\n", "parentCommentId": "SED5CdhBiAdsh34gN", "user": {"username": "Cullen_OKeefe"}}, {"_id": "McTcYmnQceWeiHrXM", "postedAt": "2023-01-04T21:49:48.148Z", "postId": "SzNpP3zPWz5aA98YH", "htmlBody": "<p>\"Never\" is too strong, okay. But I disagree with your second point. I feel like I was only speaking out against the framing that critics of EA are entitled to a lengthy reply because of EA being ambitious in its scope of caring. (This framing was explicit at least in the quoted paragraph, not necessarily in her post as a whole or her previous work.) I don't feel like I was discouraging criticism. Basically, my point wasn't about the act of criticizing at all, it was only about an added expectation that went with it, which I'd paraphrase as \"EAs are doing something wrong unless they answer to my concerns point by point.\"</p>", "parentCommentId": "eGBPNcey3H3NqmFpy", "user": {"username": "Lukas_Gloor"}}, {"_id": "yvRmvN5wGqbJ3uTm8", "postedAt": "2023-01-04T22:00:20.524Z", "postId": "SzNpP3zPWz5aA98YH", "htmlBody": "<blockquote>\n<p>I feel like I was only speaking out against the framing that critics of EA are entitled to a lengthy reply because of EA being ambitious in its scope of caring. (This framing was explicit at least in the quoted paragraph, not necessarily in her post as a whole or her previous work.)</p>\n</blockquote>\n<p>Ah, okay. That seems more reasonable. Sorry for misunderstanding.</p>\n", "parentCommentId": "McTcYmnQceWeiHrXM", "user": {"username": "Cullen_OKeefe"}}, {"_id": "LwGwS6RaCvh95sLQd", "postedAt": "2023-01-04T22:58:05.890Z", "postId": "SzNpP3zPWz5aA98YH", "htmlBody": "<p>Thanks for sharing! &nbsp;We have some differing views on this which I will focus on - but I agree with much of what you say and do appreciate your thoughts + engagement here.</p><blockquote><p>Likewise, I find it unfair if having the stated goal to make the future better for all sentient beings is somehow taken to imply \"Oh, you care for the future of <i>all </i>humans, and even animals? That's suspicious – we're definitely going to apply extra scrutiny towards you.\" Meanwhile, AI capabilities companies continue to scale up compute and most of the world is busy discussing soccer or what not. Yet somehow,\"Are EAs following democratic processes and why does their funding come from very few sources?\" is made into the bigger issue than widespread apathy or the extent to which civilization might be acutely at risk.</p></blockquote><p>It sounds like you are getting the impression that criticism directed at EA indicates that people criticising EA think this is a larger issue than AI capabilities or widespread apathy etc, if they aren't spending their time lobbying against those larger issues. But there might be other explanations for their focus - any given individual's sphere of influence, tractability, personal identity, and others can all be factors that contribute here.</p><p>&nbsp;</p><blockquote><p>EAs who are serious about their stated goals have the most incentive of anyone to help the EA movement get its act together. The idea that \"it's important to have good institutions\" is something EA owes <i>to outsiders</i> is what seems weird to me. Doesn't this framing kind of suggest that EAs couldn't motivate themselves to try their best if it weren't for \"institutional safeguards.\"&nbsp;</p></blockquote><p>\"It's important to have good institutions\" is clearly something that \"serious EAs\" are strongly incentivised to do. But people who have a lot of power and influence and funding also face incentives to maintain a status quo that they benefit from. EA is no different, and people seeking to do good are not exempt from these kinds of incentives. And EAs who are serious about things should acknowledge that they are subject to these incentives, as well as the possibility that one reason outsiders might be speaking up about this is because they think EAs aren't taking the problem seriously enough. The benefit of the outside critic is NOT that EAs have some special obligation towards them (though, in this case, if your actions directly impact them, then they are a relevant stakeholder that is worth considering), but because they are somewhat removed and may be able to provide some insight into an issue that is harder for you to see when you are deeply surrounded by other EAs and people who are directly mission / value-aligned.<br>&nbsp;</p><blockquote><p>What a depressing view of humans, that they can only act according to their stated ideals if they're watched at every step and have to justify themselves to critics!</p></blockquote><p>I think this goes too far, I don't think this is the claim being made. The standard is just \"would better systems and institutional safeguards better align EA's stated ideals and what happens in practice? If so, what would this look like, and how would EA organisations implement these?\". My guess is you probably agree with this though?<br>&nbsp;</p><blockquote><p>Either way, I don't think &nbsp;anyone in EA, nor \"EA\" as a movement, has any obligation to engage in great detail</p><p>I guess if someone's impression of EA was \"group of people who want to turn all available resources into happiness simulations regardless of what existing people want for their future\"</p></blockquote><p>Nitpick: while I agree that it would be a strawman, it isn't the only scenario for outsiders to be concerned. There are also people who disagree with some longtermists vision of the future, there are people who think EA's general approach is bad, and it could follow that those people will think $$ on EA causes are poorly spent and should be spent in [some different way]. There are also people who think EA is a talent drain away from important issues. Of course, this doesn't interact with the extent to which EA is \"obligated\" to respond, especially because many of these takes aren't great. I agree that there's no obligation, per se. But the claim is \"outsiders are permitted to ASK you to fix your problems\", not that you are <strong>obligated </strong>to respond (though subsequent sentences RE: \"I can demand\" or \"you should\" might be a source of miscommunication).</p><p>I guess the way I see it is something like - EA isn't obligated to respond to any outsider criticism, but if you want to be taken seriously by these outsiders who have these concerns, if you want buy-in from people who you claim to be working with and working for, if you don't want people at social entrepreneurship symposiums seriously considering questions like \"<a href=\"https://www.townandcountrymag.com/society/money-and-power/a42330166/effective-altruism-sam-bankman-fried-ftx-fallout/#:~:text=Is%20the%20way%20to%20do%20the%20most%20good%20to%20destroy%20effective%20altruism%3F\">Is the way to do the most good to destroy effective altruism?</a>\", then it could be in your best interest to take good-faith criticisms and concerns seriously, even if the attitude comes across poor, because it likely reflects some barrier in you achieving your goals. But I think there probably isn't much disagreement between us here.</p>", "parentCommentId": "c8YhrNEHC9Jt8u49N", "user": {"username": "bruce"}}, {"_id": "QWGE8tTeW4Rictfyc", "postedAt": "2023-01-05T00:47:17.700Z", "postId": "SzNpP3zPWz5aA98YH", "htmlBody": "<p>I would have agreed pre-FTX. In my view, EA actors meaningfully contributed -- in a causal sense -- to the rise of SBF, which generated significant widespread harm. Given the size and lifespan of EA, that is enough for a presumption of sufficient risk of future external harm for standing. There were just too many linkages and influences, several of them but-for causes.</p>\n<p>EA has a considerable appetite for risk and little of what some commenter are dismissing as \"bureaucracy,\" which increases the odds of other harms felt externally. So the presumption is not rebutted in my book.</p>\n", "parentCommentId": "FxK9CLEuGGn6vfdYG", "user": {"username": "Jason"}}, {"_id": "NmsnJNFCkFssaWnWH", "postedAt": "2023-01-05T03:17:19.129Z", "postId": "SzNpP3zPWz5aA98YH", "htmlBody": "<p>I can understand why you mightn't trust us, but I would encourage EA's to consider that we need to back ourselves, even though I've certainly been shaken by the whole FTX fiasco. Unfortunately, there's an adverse selection effect where the least trustworthy actors are unlikely to recurse themselves in terms of influence, so if the more trustworthy actors recurse themselves, we will end up with the least responsible actors in control.</p><p>So despite the flaws I see with EA, I don't really see any choice apart from striving as hard as we can to play our part in building a stronger future. After all, the perfect is the enemy of the good. And if the situation changes such that there are others better equipped than us to handle these issues and who would not benefit from our assistance, we should of course recurse ourselves, but sadly I believe this is unlikely to happen.</p>", "parentCommentId": "CuACCS3z5LtMoqsvC", "user": {"username": "casebash"}}, {"_id": "AEttruNKHFGxbXsby", "postedAt": "2023-01-05T03:26:24.440Z", "postId": "SzNpP3zPWz5aA98YH", "htmlBody": "<p>If FTX's decentralised model had been proven successful for long-termism, I suspect it would have influenced the way funding was handled for other cause areas as well.</p>", "parentCommentId": "gGQnzkskhTzrwggAE", "user": {"username": "casebash"}}, {"_id": "RbFfasY43xfGLHwbH", "postedAt": "2023-01-05T08:12:13.408Z", "postId": "SzNpP3zPWz5aA98YH", "htmlBody": "<p>In case my wording was confusing, I meant that a community shift towards longtermism seems to have been decided by a small number of individuals (FTX founders). I'm not talking about centralization within causes, but centralization in deciding prioritization between causes.</p>\n<p>Also, I'm skeptical that global health and poverty or animal welfare would shift towards very decentralized regranting without a massive increase in available funding first, because</p>\n<ol>\n<li>some of the large cost-effective charities that get funded are still funding-constrained, and so the bars to beat seem better defined, and</li>\n<li>there already are similar experiments on a smaller scale through the EA Funds.</li>\n</ol>\n", "parentCommentId": "AEttruNKHFGxbXsby", "user": {"username": "MichaelStJules"}}, {"_id": "oicqq6cDhA8TxwQPZ", "postedAt": "2023-01-05T08:29:47.285Z", "postId": "SzNpP3zPWz5aA98YH", "htmlBody": "<p>Yeah, I got that, I was just mentioning an effect that might have partially offset it.</p>\n<p>I agree that a small number of individuals decided that the funds should focus on long-terminal, although this is partially offset by how the EA movement was shifting that direction anyway.</p>\n", "parentCommentId": "RbFfasY43xfGLHwbH", "user": {"username": "casebash"}}, {"_id": "SQhXmnkpyEZGATzSz", "postedAt": "2023-01-05T16:08:18.462Z", "postId": "SzNpP3zPWz5aA98YH", "htmlBody": "<p>Thanks for this comment! My argument about community building's particular role &nbsp;is that I think there were certain \"community building\" efforts specifically that caused the existence of FTX. The founder was urged to work in finance rather than on animal welfare, and then worked at CEA prior to launching Alameda. Alameda/FTX were seen as strategies to expand the amount of funding available to effective altruist causes and were founded and run by a leadership team that identified as effective altruist (including the former CEO of the Center for Effective Altruism). The initial funding was from major EA donors. &nbsp;To me the weight of public evidence really points to Alameda as having been incubated by Center for Effective Altruism in a fairly clear way.&nbsp;</p><p>It's possible that in the absence of Alameda/FTX's existence its niche would have been filled by another entity that would have done similarly bad things, but it seems hard for me to imagine that without institutional EA's backing FTX would have existed.</p>", "parentCommentId": "qniCZqnpFcxosLhn3", "user": {"username": "joshcmorrison"}}, {"_id": "igLyxCvG2LoN23huu", "postedAt": "2023-01-05T17:34:42.782Z", "postId": "SzNpP3zPWz5aA98YH", "htmlBody": "<p>I think the global argument is that power in EA should be deconcentrated/diffused across the board, and subjected to more oversight across the board, to reduce risk from its potential misuse. I dont think Zoe is suggesting that any actor should get a choice on how much power to lose or oversight to have. Could you say more about how adverse selection interacts with that approach?</p>\n", "parentCommentId": "NmsnJNFCkFssaWnWH", "user": {"username": "Jason"}}, {"_id": "HfmgYXGke8EK3Pmfp", "postedAt": "2023-01-05T20:46:50.322Z", "postId": "SzNpP3zPWz5aA98YH", "htmlBody": "<p>Even if every actor in EA agreed to limit its power, we wouldn’t be able to limit the power of actors outside of EA. This is the adverse selection effect.</p>\n<p>This means that we need to carefully consider the cost-benefit trade off in proposals to limit the power of groups. In some cases, ie. seeing  how the FTX fiasco was a larger systematic risk, it’s clear that there’s a need for more oversight. In other cases, it’s more like the analogy of putting Frodo’s quest on hold until we’ve conducted an opinion survey of Middle Earth.</p>\n<p>(Update: Upon reflection, this comment makes me sound like I’m more towards ‘just do stuff’ then I am. I think we need to recognise that we can’t assume someone is perfectly virtuous just because they’re an EA, but I also want us to retain the characteristics of a high trust community (and we have to check up on every little decision is a characteristic of a low trust community).</p>\n", "parentCommentId": "igLyxCvG2LoN23huu", "user": {"username": "casebash"}}, {"_id": "pfyiXH3sDfJgJ7vhQ", "postedAt": "2023-01-05T22:30:55.205Z", "postId": "SzNpP3zPWz5aA98YH", "htmlBody": "<p>Thanks. That argument makes sense on the assumption that a given reform would reduce EA's collective power as opposed to merely redistributing it within EA.</p>\n", "parentCommentId": "HfmgYXGke8EK3Pmfp", "user": {"username": "Jason"}}, {"_id": "LqCLKDcDCcPpKQrja", "postedAt": "2023-01-06T03:30:02.921Z", "postId": "SzNpP3zPWz5aA98YH", "htmlBody": "<p>Thanks for explaining, Josh! I understand your position a little better, but I still don't agree that it makes sense to \\weight the impact of movement building on this outcome more heavily than all the other EA related (and unrelated) inputs involved, and accordingly, I am still relatively unconvinced that we need to react to the event by significantly changing our perspective on the value of movement building.<br><br>Having said that, I still agree with you that we should be careful with movement building, expect and mitigate downside risks, and keeping evaluating it and trying to do it better.&nbsp;<br><br>Just as an FYI - I probably won't respond to any more comments because of time constraints.&nbsp;</p>", "parentCommentId": "SQhXmnkpyEZGATzSz", "user": {"username": "Peterslattery"}}, {"_id": "99opFXhcs9RdEoZnk", "postedAt": "2023-01-06T10:19:13.431Z", "postId": "SzNpP3zPWz5aA98YH", "htmlBody": "<p>I have read the Democratizing Risk paper that got EA criticism and think it was spot on. Not having ever been very popular anywhere (I get by on being \"helpful\" or \"ignorable\"), I use my time here to develop knowledge.</p>\n<p>Your work and contributions could have  good timing right now.  You also have credentials and academic papers, all useful to establish your legitimacy for this audience.  It might be useful to check to what extent TUA had to do with the FTX crisis, and whether a partitioning of EA ideologies combines or separates the two.</p>\n<p>I believe that appetite for risk and attraction to betting is part and parcel of EA, as is a view informed more by wealth than by poverty.  This speaks to appetite for financial risk and dissonance about charitable funding.</p>\n<p>Critiques of EA bureaucracy could have more impact than critiques of EA ideology. Certainly your work with Luke Kemp on TUA seems like a hard sell for this audience, but I would welcome another round, there's a silent group of forum readers who could take notice of your effort.</p>\n<p>Arguments against TUA visions of AGI just get an ignoring shrug here. Climate change is about as interesting to these folks as the threat of super-fungi. Not very interesting. Maybe a few 100 points on one post, if the author speaks \"EA\" or is popular. I do think the reasons are ideological rather than epistemic, though ideologies do act as an epistemic filter (as in soldier mindset).</p>\n", "parentCommentId": "aMbQzvvmwmxRRZDdT", "user": {"username": "Noah Scales"}}, {"_id": "ftaZEQMMaryFgicq4", "postedAt": "2023-01-06T22:56:53.631Z", "postId": "SzNpP3zPWz5aA98YH", "htmlBody": "<blockquote><p>Also: assume you recruit donors uniformly, no matter how wealthy they are. Most of the wealth will be with the wealthiest minority , basically because how the wealth distribution looks like. &nbsp;Attempt to diversify donation portfolio toward smaller donors ... would look like GWWC?</p></blockquote><p>It depends on how you define wealthiest minority, but if you mean billionaires, the majority of philanthropy is not from billionaires. EA has been unusually successful with billionaires. That means if EA mean reverts, perhaps by going mainstream, the majority of EA funding will not be from billionaires. CEA deprioritized GWWC for several years-I think if they had continued to prioritize it, funding would have gotten at least somewhat more diversified. Also, I find that talking with midcareer professionals it's much easier to mention donations rather than switching their career. So I think that more emphasis on donations from people of modest means could help EA diversify with respect to age.</p>", "parentCommentId": "8BqCgz7LLRvL7wdNR", "user": {"username": "Denkenberger"}}, {"_id": "oHxAjCWqcmqG2sjkz", "postedAt": "2023-01-07T18:38:06.303Z", "postId": "SzNpP3zPWz5aA98YH", "htmlBody": "<p>I find it implausible that EA movement building is net-negative (&lt;10%). However, I do appreciate the importance of not being unconditionally enthusiastic about movement-building as some specific forms may very well be net-negative. Some things I'd like to be aware of going forward:<br>1. &nbsp;Attempt to do things that reasonable non-EA entities will find valuable (e.g., by not being dependent on EA funders and collaborating more with non-EA actors).<br>2. Be very aware of who we put on a pedestal as promoters and social role models. E.g., I appreciate Macaskill in many ways and have been inspired by him but I think he's too emphasized as the EA leader/role model and would like to hear other voices better represented.</p>", "parentCommentId": null, "user": {"username": "SebastianSchmidt"}}, {"_id": "P2ps9fS3hJ7Km3Xs5", "postedAt": "2023-01-07T18:47:58.196Z", "postId": "SzNpP3zPWz5aA98YH", "htmlBody": "<p>If you think that movement building is effective in supporting the EA movement, you need to think that the EA movement is negative. I honestly can't see how you can be very confident in the latter. Skrewing things up is easy; unintentionally messing up AI/LTF stuff seems easy and given high-stakes causing massive amounts of harm is an option (it's not an uncommon belief that FLI's Puerto Rico conferences turned out negatively, for example).</p>\n", "parentCommentId": "oHxAjCWqcmqG2sjkz", "user": {"username": "Misha_Yagudin"}}, {"_id": "pijR7YHkosAiKYPgL", "postedAt": "2023-01-07T19:10:34.375Z", "postId": "SzNpP3zPWz5aA98YH", "htmlBody": "<p><span><span class=\"mjpage\"><span class=\"mjx-chtml\"><span class=\"mjx-math\" aria-label=\"\"><span class=\"mjx-mrow\" aria-hidden=\"true\"></span></span><style>.mjx-chtml {display: inline-block; line-height: 0; text-indent: 0; text-align: left; text-transform: none; font-style: normal; font-weight: normal; font-size: 100%; font-size-adjust: none; letter-spacing: normal; word-wrap: normal; word-spacing: normal; white-space: nowrap; float: none; direction: ltr; max-width: none; max-height: none; min-width: 0; min-height: 0; border: 0; margin: 0; padding: 1px 0}\n.MJXc-display {display: block; text-align: center; margin: 1em 0; padding: 0}\n.mjx-chtml[tabindex]:focus, body :focus .mjx-chtml[tabindex] {display: inline-table}\n.mjx-full-width {text-align: center; display: table-cell!important; width: 10000em}\n.mjx-math {display: inline-block; border-collapse: separate; border-spacing: 0}\n.mjx-math * {display: inline-block; -webkit-box-sizing: content-box!important; -moz-box-sizing: content-box!important; box-sizing: content-box!important; text-align: left}\n.mjx-numerator {display: block; text-align: center}\n.mjx-denominator {display: block; text-align: center}\n.MJXc-stacked {height: 0; position: relative}\n.MJXc-stacked > * {position: absolute}\n.MJXc-bevelled > * {display: inline-block}\n.mjx-stack {display: inline-block}\n.mjx-op {display: block}\n.mjx-under {display: table-cell}\n.mjx-over {display: block}\n.mjx-over > * {padding-left: 0px!important; padding-right: 0px!important}\n.mjx-under > * {padding-left: 0px!important; padding-right: 0px!important}\n.mjx-stack > .mjx-sup {display: block}\n.mjx-stack > .mjx-sub {display: block}\n.mjx-prestack > .mjx-presup {display: block}\n.mjx-prestack > .mjx-presub {display: block}\n.mjx-delim-h > .mjx-char {display: inline-block}\n.mjx-surd {vertical-align: top}\n.mjx-surd + .mjx-box {display: inline-flex}\n.mjx-mphantom * {visibility: hidden}\n.mjx-merror {background-color: #FFFF88; color: #CC0000; border: 1px solid #CC0000; padding: 2px 3px; font-style: normal; font-size: 90%}\n.mjx-annotation-xml {line-height: normal}\n.mjx-menclose > svg {fill: none; stroke: currentColor; overflow: visible}\n.mjx-mtr {display: table-row}\n.mjx-mlabeledtr {display: table-row}\n.mjx-mtd {display: table-cell; text-align: center}\n.mjx-label {display: table-row}\n.mjx-box {display: inline-block}\n.mjx-block {display: block}\n.mjx-span {display: inline}\n.mjx-char {display: block; white-space: pre}\n.mjx-itable {display: inline-table; width: auto}\n.mjx-row {display: table-row}\n.mjx-cell {display: table-cell}\n.mjx-table {display: table; width: 100%}\n.mjx-line {display: block; height: 0}\n.mjx-strut {width: 0; padding-top: 1em}\n.mjx-vsize {width: 0}\n.MJXc-space1 {margin-left: .167em}\n.MJXc-space2 {margin-left: .222em}\n.MJXc-space3 {margin-left: .278em}\n.mjx-test.mjx-test-display {display: table!important}\n.mjx-test.mjx-test-inline {display: inline!important; margin-right: -1px}\n.mjx-test.mjx-test-default {display: block!important; clear: both}\n.mjx-ex-box {display: inline-block!important; position: absolute; overflow: hidden; min-height: 0; max-height: none; padding: 0; border: 0; margin: 0; width: 1px; height: 60ex}\n.mjx-test-inline .mjx-left-box {display: inline-block; width: 0; float: left}\n.mjx-test-inline .mjx-right-box {display: inline-block; width: 0; float: right}\n.mjx-test-display .mjx-right-box {display: table-cell!important; width: 10000em!important; min-width: 0; max-width: none; padding: 0; border: 0; margin: 0}\n.MJXc-TeX-unknown-R {font-family: monospace; font-style: normal; font-weight: normal}\n.MJXc-TeX-unknown-I {font-family: monospace; font-style: italic; font-weight: normal}\n.MJXc-TeX-unknown-B {font-family: monospace; font-style: normal; font-weight: bold}\n.MJXc-TeX-unknown-BI {font-family: monospace; font-style: italic; font-weight: bold}\n.MJXc-TeX-ams-R {font-family: MJXc-TeX-ams-R,MJXc-TeX-ams-Rw}\n.MJXc-TeX-cal-B {font-family: MJXc-TeX-cal-B,MJXc-TeX-cal-Bx,MJXc-TeX-cal-Bw}\n.MJXc-TeX-frak-R {font-family: MJXc-TeX-frak-R,MJXc-TeX-frak-Rw}\n.MJXc-TeX-frak-B {font-family: MJXc-TeX-frak-B,MJXc-TeX-frak-Bx,MJXc-TeX-frak-Bw}\n.MJXc-TeX-math-BI {font-family: MJXc-TeX-math-BI,MJXc-TeX-math-BIx,MJXc-TeX-math-BIw}\n.MJXc-TeX-sans-R {font-family: MJXc-TeX-sans-R,MJXc-TeX-sans-Rw}\n.MJXc-TeX-sans-B {font-family: MJXc-TeX-sans-B,MJXc-TeX-sans-Bx,MJXc-TeX-sans-Bw}\n.MJXc-TeX-sans-I {font-family: MJXc-TeX-sans-I,MJXc-TeX-sans-Ix,MJXc-TeX-sans-Iw}\n.MJXc-TeX-script-R {font-family: MJXc-TeX-script-R,MJXc-TeX-script-Rw}\n.MJXc-TeX-type-R {font-family: MJXc-TeX-type-R,MJXc-TeX-type-Rw}\n.MJXc-TeX-cal-R {font-family: MJXc-TeX-cal-R,MJXc-TeX-cal-Rw}\n.MJXc-TeX-main-B {font-family: MJXc-TeX-main-B,MJXc-TeX-main-Bx,MJXc-TeX-main-Bw}\n.MJXc-TeX-main-I {font-family: MJXc-TeX-main-I,MJXc-TeX-main-Ix,MJXc-TeX-main-Iw}\n.MJXc-TeX-main-R {font-family: MJXc-TeX-main-R,MJXc-TeX-main-Rw}\n.MJXc-TeX-math-I {font-family: MJXc-TeX-math-I,MJXc-TeX-math-Ix,MJXc-TeX-math-Iw}\n.MJXc-TeX-size1-R {font-family: MJXc-TeX-size1-R,MJXc-TeX-size1-Rw}\n.MJXc-TeX-size2-R {font-family: MJXc-TeX-size2-R,MJXc-TeX-size2-Rw}\n.MJXc-TeX-size3-R {font-family: MJXc-TeX-size3-R,MJXc-TeX-size3-Rw}\n.MJXc-TeX-size4-R {font-family: MJXc-TeX-size4-R,MJXc-TeX-size4-Rw}\n.MJXc-TeX-vec-R {font-family: MJXc-TeX-vec-R,MJXc-TeX-vec-Rw}\n.MJXc-TeX-vec-B {font-family: MJXc-TeX-vec-B,MJXc-TeX-vec-Bx,MJXc-TeX-vec-Bw}\n@font-face {font-family: MJXc-TeX-ams-R; src: local('MathJax_AMS'), local('MathJax_AMS-Regular')}\n@font-face {font-family: MJXc-TeX-ams-Rw; src /*1*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/eot/MathJax_AMS-Regular.eot'); src /*2*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/woff/MathJax_AMS-Regular.woff') format('woff'), url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/otf/MathJax_AMS-Regular.otf') format('opentype')}\n@font-face {font-family: MJXc-TeX-cal-B; src: local('MathJax_Caligraphic Bold'), local('MathJax_Caligraphic-Bold')}\n@font-face {font-family: MJXc-TeX-cal-Bx; src: local('MathJax_Caligraphic'); font-weight: bold}\n@font-face {font-family: MJXc-TeX-cal-Bw; src /*1*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/eot/MathJax_Caligraphic-Bold.eot'); src /*2*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/woff/MathJax_Caligraphic-Bold.woff') format('woff'), url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/otf/MathJax_Caligraphic-Bold.otf') format('opentype')}\n@font-face {font-family: MJXc-TeX-frak-R; src: local('MathJax_Fraktur'), local('MathJax_Fraktur-Regular')}\n@font-face {font-family: MJXc-TeX-frak-Rw; src /*1*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/eot/MathJax_Fraktur-Regular.eot'); src /*2*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/woff/MathJax_Fraktur-Regular.woff') format('woff'), url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/otf/MathJax_Fraktur-Regular.otf') format('opentype')}\n@font-face {font-family: MJXc-TeX-frak-B; src: local('MathJax_Fraktur Bold'), local('MathJax_Fraktur-Bold')}\n@font-face {font-family: MJXc-TeX-frak-Bx; src: local('MathJax_Fraktur'); font-weight: bold}\n@font-face {font-family: MJXc-TeX-frak-Bw; src /*1*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/eot/MathJax_Fraktur-Bold.eot'); src /*2*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/woff/MathJax_Fraktur-Bold.woff') format('woff'), url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/otf/MathJax_Fraktur-Bold.otf') format('opentype')}\n@font-face {font-family: MJXc-TeX-math-BI; src: local('MathJax_Math BoldItalic'), local('MathJax_Math-BoldItalic')}\n@font-face {font-family: MJXc-TeX-math-BIx; src: local('MathJax_Math'); font-weight: bold; font-style: italic}\n@font-face {font-family: MJXc-TeX-math-BIw; src /*1*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/eot/MathJax_Math-BoldItalic.eot'); src /*2*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/woff/MathJax_Math-BoldItalic.woff') format('woff'), url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/otf/MathJax_Math-BoldItalic.otf') format('opentype')}\n@font-face {font-family: MJXc-TeX-sans-R; src: local('MathJax_SansSerif'), local('MathJax_SansSerif-Regular')}\n@font-face {font-family: MJXc-TeX-sans-Rw; src /*1*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/eot/MathJax_SansSerif-Regular.eot'); src /*2*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/woff/MathJax_SansSerif-Regular.woff') format('woff'), url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/otf/MathJax_SansSerif-Regular.otf') format('opentype')}\n@font-face {font-family: MJXc-TeX-sans-B; src: local('MathJax_SansSerif Bold'), local('MathJax_SansSerif-Bold')}\n@font-face {font-family: MJXc-TeX-sans-Bx; src: local('MathJax_SansSerif'); font-weight: bold}\n@font-face {font-family: MJXc-TeX-sans-Bw; src /*1*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/eot/MathJax_SansSerif-Bold.eot'); src /*2*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/woff/MathJax_SansSerif-Bold.woff') format('woff'), url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/otf/MathJax_SansSerif-Bold.otf') format('opentype')}\n@font-face {font-family: MJXc-TeX-sans-I; src: local('MathJax_SansSerif Italic'), local('MathJax_SansSerif-Italic')}\n@font-face {font-family: MJXc-TeX-sans-Ix; src: local('MathJax_SansSerif'); font-style: italic}\n@font-face {font-family: MJXc-TeX-sans-Iw; src /*1*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/eot/MathJax_SansSerif-Italic.eot'); src /*2*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/woff/MathJax_SansSerif-Italic.woff') format('woff'), url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/otf/MathJax_SansSerif-Italic.otf') format('opentype')}\n@font-face {font-family: MJXc-TeX-script-R; src: local('MathJax_Script'), local('MathJax_Script-Regular')}\n@font-face {font-family: MJXc-TeX-script-Rw; src /*1*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/eot/MathJax_Script-Regular.eot'); src /*2*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/woff/MathJax_Script-Regular.woff') format('woff'), url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/otf/MathJax_Script-Regular.otf') format('opentype')}\n@font-face {font-family: MJXc-TeX-type-R; src: local('MathJax_Typewriter'), local('MathJax_Typewriter-Regular')}\n@font-face {font-family: MJXc-TeX-type-Rw; src /*1*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/eot/MathJax_Typewriter-Regular.eot'); src /*2*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/woff/MathJax_Typewriter-Regular.woff') format('woff'), url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/otf/MathJax_Typewriter-Regular.otf') format('opentype')}\n@font-face {font-family: MJXc-TeX-cal-R; src: local('MathJax_Caligraphic'), local('MathJax_Caligraphic-Regular')}\n@font-face {font-family: MJXc-TeX-cal-Rw; src /*1*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/eot/MathJax_Caligraphic-Regular.eot'); src /*2*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/woff/MathJax_Caligraphic-Regular.woff') format('woff'), url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/otf/MathJax_Caligraphic-Regular.otf') format('opentype')}\n@font-face {font-family: MJXc-TeX-main-B; src: local('MathJax_Main Bold'), local('MathJax_Main-Bold')}\n@font-face {font-family: MJXc-TeX-main-Bx; src: local('MathJax_Main'); font-weight: bold}\n@font-face {font-family: MJXc-TeX-main-Bw; src /*1*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/eot/MathJax_Main-Bold.eot'); src /*2*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/woff/MathJax_Main-Bold.woff') format('woff'), url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/otf/MathJax_Main-Bold.otf') format('opentype')}\n@font-face {font-family: MJXc-TeX-main-I; src: local('MathJax_Main Italic'), local('MathJax_Main-Italic')}\n@font-face {font-family: MJXc-TeX-main-Ix; src: local('MathJax_Main'); font-style: italic}\n@font-face {font-family: MJXc-TeX-main-Iw; src /*1*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/eot/MathJax_Main-Italic.eot'); src /*2*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/woff/MathJax_Main-Italic.woff') format('woff'), url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/otf/MathJax_Main-Italic.otf') format('opentype')}\n@font-face {font-family: MJXc-TeX-main-R; src: local('MathJax_Main'), local('MathJax_Main-Regular')}\n@font-face {font-family: MJXc-TeX-main-Rw; src /*1*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/eot/MathJax_Main-Regular.eot'); src /*2*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/woff/MathJax_Main-Regular.woff') format('woff'), url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/otf/MathJax_Main-Regular.otf') format('opentype')}\n@font-face {font-family: MJXc-TeX-math-I; src: local('MathJax_Math Italic'), local('MathJax_Math-Italic')}\n@font-face {font-family: MJXc-TeX-math-Ix; src: local('MathJax_Math'); font-style: italic}\n@font-face {font-family: MJXc-TeX-math-Iw; src /*1*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/eot/MathJax_Math-Italic.eot'); src /*2*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/woff/MathJax_Math-Italic.woff') format('woff'), url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/otf/MathJax_Math-Italic.otf') format('opentype')}\n@font-face {font-family: MJXc-TeX-size1-R; src: local('MathJax_Size1'), local('MathJax_Size1-Regular')}\n@font-face {font-family: MJXc-TeX-size1-Rw; src /*1*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/eot/MathJax_Size1-Regular.eot'); src /*2*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/woff/MathJax_Size1-Regular.woff') format('woff'), url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/otf/MathJax_Size1-Regular.otf') format('opentype')}\n@font-face {font-family: MJXc-TeX-size2-R; src: local('MathJax_Size2'), local('MathJax_Size2-Regular')}\n@font-face {font-family: MJXc-TeX-size2-Rw; src /*1*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/eot/MathJax_Size2-Regular.eot'); src /*2*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/woff/MathJax_Size2-Regular.woff') format('woff'), url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/otf/MathJax_Size2-Regular.otf') format('opentype')}\n@font-face {font-family: MJXc-TeX-size3-R; src: local('MathJax_Size3'), local('MathJax_Size3-Regular')}\n@font-face {font-family: MJXc-TeX-size3-Rw; src /*1*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/eot/MathJax_Size3-Regular.eot'); src /*2*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/woff/MathJax_Size3-Regular.woff') format('woff'), url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/otf/MathJax_Size3-Regular.otf') format('opentype')}\n@font-face {font-family: MJXc-TeX-size4-R; src: local('MathJax_Size4'), local('MathJax_Size4-Regular')}\n@font-face {font-family: MJXc-TeX-size4-Rw; src /*1*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/eot/MathJax_Size4-Regular.eot'); src /*2*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/woff/MathJax_Size4-Regular.woff') format('woff'), url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/otf/MathJax_Size4-Regular.otf') format('opentype')}\n@font-face {font-family: MJXc-TeX-vec-R; src: local('MathJax_Vector'), local('MathJax_Vector-Regular')}\n@font-face {font-family: MJXc-TeX-vec-Rw; src /*1*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/eot/MathJax_Vector-Regular.eot'); src /*2*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/woff/MathJax_Vector-Regular.woff') format('woff'), url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/otf/MathJax_Vector-Regular.otf') format('opentype')}\n@font-face {font-family: MJXc-TeX-vec-B; src: local('MathJax_Vector Bold'), local('MathJax_Vector-Bold')}\n@font-face {font-family: MJXc-TeX-vec-Bx; src: local('MathJax_Vector'); font-weight: bold}\n@font-face {font-family: MJXc-TeX-vec-Bw; src /*1*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/eot/MathJax_Vector-Bold.eot'); src /*2*/: url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/woff/MathJax_Vector-Bold.woff') format('woff'), url('https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/fonts/HTML-CSS/TeX/otf/MathJax_Vector-Bold.otf') format('opentype')}\n</style></span></span></span>\"If you think that movement building is effective in supporting the EA movement, you need to think that the EA movement is negative.\"I think you might mean something like \"If you think that movement building is effective in supporting the EA movement, you need to think that the EA movement is <i>definitely not</i> negative.\"?.<br>I think it depends on how we operationalize community-building. I can definitely see how some forms of community-building is probably negative and I'd want for it to be high quality and relatively targetted.<br>What are some of the reasons why people think the Puerto Rico conference is negative?</p>", "parentCommentId": "P2ps9fS3hJ7Km3Xs5", "user": {"username": "SebastianSchmidt"}}, {"_id": "Ccc9hD2QtkmWYjkw5", "postedAt": "2023-01-08T00:44:24.560Z", "postId": "SzNpP3zPWz5aA98YH", "htmlBody": "<blockquote>\n<p>Indeed Lukas, I guess what I'm saying is: given what I know about EA, I would not entrust it with the ring</p>\n</blockquote>\n<p>I don't understand what this means, exactly.</p>\n<p>If you're talking about the literal one ring from LOTR, then yeah EA not being trustworthy is vacuously true, since no human without mental immunity feats can avoid being corrupted.</p>\n", "parentCommentId": "CuACCS3z5LtMoqsvC", "user": {"username": "Sharmake"}}, {"_id": "PLt5Sn2YW76ZR8uDb", "postedAt": "2023-01-08T12:18:12.060Z", "postId": "SzNpP3zPWz5aA98YH", "htmlBody": "<p>The point was that there is a non-negligible probability that EA will end up negative.</p>\n", "parentCommentId": "pijR7YHkosAiKYPgL", "user": {"username": "Misha_Yagudin"}}, {"_id": "Qcfniahmjk7p7xzvr", "postedAt": "2023-01-10T08:32:37.169Z", "postId": "SzNpP3zPWz5aA98YH", "htmlBody": "<p>In general, I thought economic studies say the damage of fraud is much bigger than the distributional effect due to loss of trust, etc. I can try to find sources if anyone is interested.</p>\n", "parentCommentId": "NJjN4FsWSHkGFampT", "user": {"username": "Dean Abele"}}, {"_id": "kZcHJ3J4fHTTFD3qZ", "postedAt": "2023-01-11T07:53:59.057Z", "postId": "SzNpP3zPWz5aA98YH", "htmlBody": "<p>Yes, I agree that there's a non-negligible P that this will happen and that some events will be very harmful (heavy-tailed). Currently, however, saying that it's &gt;10% seems too high but I could definitely change my mind. But I'm sufficiently worried about this to be skeptical of broad and low-fidelity outreach and I solicit advice from people who are generally skeptical of all forms of movement-building to be sure that we're sufficiently circumspect in what we do.</p>", "parentCommentId": "PLt5Sn2YW76ZR8uDb", "user": {"username": "SebastianSchmidt"}}]