[{"_id": "RXNct5LsL39XKCs5Y", "postedAt": "2023-03-28T11:49:41.632Z", "postId": "SZZdYwYvkJjus2vGp", "htmlBody": "<p>My attempt to summarize why the model predicts that preventing famine in China and other countries will have a negative effect on the future:</p><ul><li>Much of the value of the future hinges on whether values become predominantly democratic or antidemocratic</li><li>The more prevalent antidemocratic values (or populations) are after a global disaster, the likelier it is that such values will become predominant</li><li>Hence preventing deaths in antidemocratic countries can have a negative effect on the future.</li></ul><p>Or as the author puts it in a <a href=\"https://forum.effectivealtruism.org/posts/jBEyb8akFGzbADokR/future-benefits-of-mitigating-food-shocks-caused-by-abrupt%23Local_mitigation1\">discussion </a>linked above:</p><blockquote><p>To be blunt for the sake of transparency, in this model, the future would improve if the real GDP of China, Egypt, India, Iran, and Russia dropped to 0, as long as that did not significantly affect the level of democracy and real GDP of democratic countries. However, null real GDP would imply widespread starvation, which is obviously pretty bad! I am confused about this, because I also believe worse values are associated with a worse future. For example, they arguably lead to higher chances of global totalitarianism or great power war.</p></blockquote><p>I agree with the author that the conclusion is confusing. Even concerning.</p><p>I'd suggest that the conclusion is out-of-sync with how most people feel about saving lives in poor, undemocratic countries. We typically don't hesitate to tackle neglected tropical diseases on the basis that doing so boosts the populations of dictatorships.</p>", "parentCommentId": null, "user": {"username": "Stan Pinsent"}}, {"_id": "n2hhv2Ju2u8EF4qwJ", "postedAt": "2023-03-28T14:16:29.291Z", "postId": "SZZdYwYvkJjus2vGp", "htmlBody": "<p>Thanks for the great summary, Stan!</p><blockquote><p>I'd suggest that the conclusion is out-of-sync with how most people feel about saving lives in poor, undemocratic countries. We typically don't hesitate to tackle neglected tropical diseases on the basis that doing so boosts the populations of dictatorships.</p></blockquote><p>I agree. At the same time, I do not think we can take the status quo for granted, because reality is often quite complex. For example, most people do not hesitate to eat factory-farmed animals, but the scale of their (negative) welfare may well outweight that of humans (see <a href=\"https://forum.effectivealtruism.org/posts/ayxasxhHWTvf6r5BF/scale-of-the-welfare-of-various-animal-populations\">here</a>).</p><p>This is not to say I am confident socioeconomic indices weighted by real GDP are a better proxy for longterm value than population:</p><blockquote><p>Is it possible that nationally mitigating food shocks robustly increases real GDP in the nearterm, but accidentally leads to a worse future if it decreases global socioeconomic indices weighted by influence? Is this even a real trade-off? Would it be better to use socioeconomic indices multiplied, instead of weighted, by real GDP as a proxy for future potential, such that greater real GDP would always be good? I am uncertain about the answers.</p></blockquote><p>However, do you think halving the population of the United States while doubling that of China would be good in the longterm (assuming constant socioeconomic indices)? I think it would be bad in expectation (although with high uncertainty) because the world would then have a major undemocratic superpower with 4 times as much GDP as the wealthiest democratic country.</p><p>I think saving lives would be more important in terms of longterm value if the population loss was higher, because then it would be reducing the chance of extinction. I think it is quite hard for a nuclear war to lead to extinction, so I preferred using socioeconomic indices to estimate future value.</p><p>We should also consider saving lives in low-income countries can affect their socioeconomic indices, which seems to be a neglected topic. From <a href=\"https://www.journals.uchicago.edu/doi/pdf/10.1017/S0022381609090550\">Kono 2009</a> (emphasis mine):</p><blockquote><p>Although many people have argued that foreign aid props up dictators, few have claimed that it props up democrats, and <strong>no one has systematically examined whether either assertion is empirically true</strong>. We argue, and find, that aid has both effects. Over the long run, sustained aid flows promote autocratic survival because autocrats can stockpile this aid for use in times of crisis. Each disbursement of aid, however, has a larger impact on democratic survival because democrats have fewer alternative resources to fall back on.</p></blockquote><p>In <a href=\"https://forum.effectivealtruism.org/posts/jBEyb8akFGzbADokR/future-benefits-of-mitigating-food-shocks-caused-by-abrupt\">my model</a>, mitigating the food shock of any given country counterfactually increases its real GDP per capita, and therefore socioeconomic indices.</p>", "parentCommentId": "RXNct5LsL39XKCs5Y", "user": {"username": "vascoamaralgrilo"}}]