[{"_id": "AZhgyyhwZHAKAXt2d", "postedAt": "2015-06-27T00:27:04.750Z", "postId": "T8JqFbGoFSfET39CW", "htmlBody": "<p>How would one tell the difference between extra members which came for &quot;capitalising on the media attention around Effective Altruism over the summer&quot;, and 10% donors who simply got rustled up by this attention? Has GWWC publicly advertised conditions in which the money spent on this wouldn't have been worthwhile and shouldn't have been diverted to it?</p>\n", "parentCommentId": null, "user": {"username": "impala"}}, {"_id": "4mDJ9kDySx3owgi3z", "postedAt": "2015-06-27T00:39:34.249Z", "postId": "T8JqFbGoFSfET39CW", "htmlBody": "<p>It's worth reassuring people that even if the full goal isn't met it isn't a disaster - there isn't a funding gap for keeping GWWC itself going, which could presumably be done quite cheaply. I know there's a perception that this fundraising round has been a struggle, and there's been a lot of scepticism about it (e.g. (here)[<a href=\"https://www.facebook.com/groups/effective.altruists/permalink/882996591756699/])\">https://www.facebook.com/groups/effective.altruists/permalink/882996591756699/])</a>. But that isn't that damning: it was bound to happen at some point at which GWWC asked for more money to fund more paid employees, rather than keeping going until GWWC got as much money as the people who've signed it's pledge are giving.</p>\n", "parentCommentId": null, "user": {"username": "Ervin"}}, {"_id": "bwZ6yaQt2KnRpK6of", "postedAt": "2015-06-27T16:26:08.149Z", "postId": "T8JqFbGoFSfET39CW", "htmlBody": "<p>Hey Michelle, did you release the <a href=\"http://effective-altruism.com/ea/hr/the_importance_of_gwwc_cohort_data/\">cohort data</a> I suggested donors might require to evaluate GWWC? </p>\n", "parentCommentId": null, "user": {"username": "Dale"}}, {"_id": "iacuHTBw6J7DpjZpi", "postedAt": "2015-06-27T20:07:37.245Z", "postId": "T8JqFbGoFSfET39CW", "htmlBody": "<p>As far as I know, not all of that data you were asking about has been released, but some of it has and is in the impact assessment (notably 1.7% is a figure which is something like an average annual rate for members leaving, and 4.7% the equivalent for members losing touch with GWWC).</p>\n", "parentCommentId": "bwZ6yaQt2KnRpK6of", "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "RP73YnKskdim2vHiq", "postedAt": "2015-06-27T20:12:24.684Z", "postId": "T8JqFbGoFSfET39CW", "htmlBody": "<blockquote>\n<p>How would one tell the difference between extra members which came for &quot;capitalising on the media attention around Effective Altruism over the summer&quot;, and 10% donors who simply got rustled up by this attention?</p>\n</blockquote>\n<p>Joining members are asked what they likely would have given if not joining. This is quite a noisy process since people's estimates of what they would have given will often be inaccurate, but I think it works as a first-order correction (and it's hard to see how to do better). This is factored into the impact assessment.</p>\n", "parentCommentId": "AZhgyyhwZHAKAXt2d", "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "QvmMZMatBLQHfPhYD", "postedAt": "2015-06-27T20:33:36.202Z", "postId": "T8JqFbGoFSfET39CW", "htmlBody": "<blockquote>\n<p>It's worth reassuring people that even if the full goal isn't met it isn't a disaster - there isn't a funding gap for keeping GWWC itself going, which could presumably be done quite cheaply.</p>\n</blockquote>\n<p>I agree that it's important to understand that not reaching the goal doesn't mean collapse. I do think opportunity cost on growth opportunities could be quite high, though -- it's not clear that there will be any marginal opportunities for movement growth this effective in a few years' time (my thinking on this is <a href=\"https://80000hours.org/2015/02/should-i-help-now-or-later/\">here on general timing of giving</a> and <a href=\"http://globalprioritiesproject.org/wp-content/uploads/2015/05/MovementGrowth.pdf\">here on how to think about the value of marginal movement growth</a>).</p>\n<blockquote>\n<p>... it was bound to happen at some point at which GWWC asked for more money to fund more paid employees, rather than keeping going until GWWC got as much money as the people who've signed it's pledge are giving.</p>\n</blockquote>\n<p>Interestingly it sounds like you're thinking of GWWC expanding in terms of the slice of pledged donations it's consuming. It could be nice to work out the numbers on this, but using remembered figures I think it's approximately constant (i.e. GWWC operations are expanding proportionally with members), and order of 10% of current donation flows / &lt;1% of (flow of increase of pledges).</p>\n", "parentCommentId": "4mDJ9kDySx3owgi3z", "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "ZsrFZgSBMWCvWyr25", "postedAt": "2015-06-28T02:18:01.552Z", "postId": "T8JqFbGoFSfET39CW", "htmlBody": "<p>Thanks for the response. You're right, the relevant question isn't keeping GWWC going but is if there are promising new growth opportunities that the extra funding will pay for, which you say there are this year. There's also some neatness to GWWC being able to support/grow its staff with 10% of the total yearly donations of the people who pledge 10% via it. I haven't thought whether that's the appropriate model, but it provides a way to pace growth rather than keeping going until you've matched their total donations.</p>\n", "parentCommentId": "QvmMZMatBLQHfPhYD", "user": {"username": "Ervin"}}, {"_id": "JCCCLbHumuSEKoCMn", "postedAt": "2015-06-28T03:33:01.848Z", "postId": "T8JqFbGoFSfET39CW", "htmlBody": "<p>Oh I meant how you distinguished between people who signed up to the pledge after seeing GWWC mentioned in the media attention or book (or elsewhere), and people who were a result of the efforts capitalising on this that EA donors are funding. For the question you answered I agree, I can't think of any better (or other) data to get about individual pledgers and the only thing to compare it to is an overall estimate of the extra donations a pledge could lead to.</p>\n", "parentCommentId": "RP73YnKskdim2vHiq", "user": {"username": "impala"}}, {"_id": "BCWAyaHxuqSpGoq29", "postedAt": "2015-06-28T16:09:02.589Z", "postId": "T8JqFbGoFSfET39CW", "htmlBody": "<p>Thanks Owen. </p>\n<p>My understanding was GWWC said that 1.7% was the average annual rate for members who <em>admitted</em> they were leaving, with an additional 4.7% of members not responding for two years. Unfortunately, these are not quite the numbers we want, and are likely to be too optimistic for a few reasons:</p>\n<ul>\n<li>These numbers don't include people who claim to be donating but are not. (Does GWWC attempt to verify donations? )</li>\n<li>They also don't include any sense of cohort differentiation - how do the early members compare to the later members? Is this number skewed by all of Dr Ord's friends who joined early on? </li>\n<li>Nor did they break down students donating 1% vs real people donating 10%. The latter are much more valuable, but I would also expect a significant number of people to drop-out when they switch from the relatively undemanding student pledge to the full 10% pledge. As such, if the current mass of members is very student-heavy, high historical retention rates may not generalize to when they leave and become full members.</li>\n<li>How does the dropout curve change for an individual cohort. Do most of the people leaving leave in the early years of the pledge (good) or does the rate of drop-out increase over time (bad)?</li>\n</ul>\n<p>Aside from this optimistic bias, there are a few other reasons to want cohort data</p>\n<ul>\n<li>It would be nice to be able to reconcile that very low drop-out rates with the very high ones GWWC published a few years ago <a href=\"https://www.givingwhatwecan.org/sites/givingwhatwecan.org/files/Steph%20Crampin/gwwc_2013_quantitative_performance_review_beckstead.pdf\">here</a>, which showed only 65-70% claimed retention after 0-2 years. Right now it seems hard to understand how these are consistent. </li>\n<li>2-year grace period is <em>very</em> long. In finance we call a loan non-performing if they are 90-days behind! Worse, GWWC is young and has seen exponential growth, so a 2-year wait period means no data on anyone who joined since June 2013.</li>\n<li>A few people have expressed concerns to me, both publicly and privately, that GWWC has discovered some very negative facts about their membership. Standardized disclosure, in a form chosen by a third party, can go a long way towards dispelling these fears. This is why public companies have to report in accordance with US GAAP, rather than getting to choose their own metrics.</li>\n<li>Finally, it would be nice to have some of the mundane, technical details as well. How was this average calculated? etc. With cohort data we don't need to speculate and argue about the virtues of different ways of computing hazard rates, we can just do our own calculations.</li>\n</ul>\n", "parentCommentId": "iacuHTBw6J7DpjZpi", "user": {"username": "Dale"}}, {"_id": "9dZe5Jm7H2vMYMpsz", "postedAt": "2015-06-28T17:57:58.985Z", "postId": "T8JqFbGoFSfET39CW", "htmlBody": "<p>Sorry for the misunderstanding! Yeah, it looks kind of hard to distinguish. Maybe someone has a clever method. The only thing I can immediately think of is an RCT on follow-up to different bits of media coverage, but I expect this would be super-messy to run and might not produce great data.</p>\n", "parentCommentId": "JCCCLbHumuSEKoCMn", "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "NXLgzm828cWpfiahX", "postedAt": "2015-06-28T18:22:27.687Z", "postId": "T8JqFbGoFSfET39CW", "htmlBody": "<p>Agree that the cohort data looks helpful for the reasons you mention (presuming a careful look at any privacy issues with releasing it checked out). I'll respond to a couple of the points:</p>\n<blockquote>\n<p>(Does GWWC attempt to verify donations? )</p>\n</blockquote>\n<p>I don't think so, and guess this is probably the right move despite the costs of lacking verification (aside from the obvious costs of data gathering, I'm worried about the subtle costs of making giving for the pledge feel more like an obligation than an opportunity, and this turning people off and leading to fewer donations, and fewer people encouraging others to join).</p>\n<blockquote>\n<p>It would be nice to be able to reconcile that very low drop-out rates with the very high ones GWWC published a few years ago here, which showed only 65-70% claimed retention after 0-2 years. Right now it seems hard to understand how these are consistent. </p>\n</blockquote>\n<p>I think what's going on here is that the 65-70% figures were mostly response rates on a survey of members. More recently GWWC has gone to rather more trouble to follow up with members who don't initially answer the survey, in order to get better data (as it was unclear how many of the 30-35% non-respondents were still donating).</p>\n<blockquote>\n<p>2-year grace period is very long. In finance we call a loan non-performing if they are 90-days behind! Worse, GWWC is young and has seen exponential growth, so a 2-year wait period means no data on anyone who joined since June 2013.</p>\n</blockquote>\n<p>I see the sense in which it feels long. On the other hand, as the frequency of asking for responses from members is annual, this amounts to &quot;missed two cycles&quot;. Counting it as dropping out with one missed cycle seems like it might catch too many people. This one seems pretty thorny to me, since more frequent data would be quite useful for analytics, but on the other hand impose rather larger burdens on both GWWC staff and members. And to the extent that what we care about is long-term donation behaviour, we may just need to wait for data.</p>\n<p>Disclaimers: I work for the Global Priorities Project, part of the same umbrella organisation (CEA) as GWWC, and I was acting director of research at GWWC during 2014. I don't know all the operational details, though.</p>\n", "parentCommentId": "BCWAyaHxuqSpGoq29", "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "PnY5u8hTCZt8EP9wa", "postedAt": "2015-06-29T11:34:53.033Z", "postId": "T8JqFbGoFSfET39CW", "htmlBody": "<p>Thanks for your interest, Dale, and Owen for responding so thoroughly.\nI overall agree that there is a lot of information it would be nice to get at, although the numbers are somewhat small if we're trying to work out the difference between, say, the 2009 cohort and the others (since there were only around 30 members in 2009). Now that I can spend less time on fundraising, I'll try to put together a post about this. \nJust to add a couple of points to what Owen has said: On the question of students to earning - that was definitely a time we were worried people would drop out. The data doesn't seem to suggest that's the case though - so far it seems that people do tend to actually start giving 10% when they start earning. \nOn the verifying donations - we have in the past compared AMF's data on donors with member self-reporting. While the self-reporting was far from perfect, people were at least as often under-reporting as over-reporting. (And most often discrepancies simply turned out to be mistakes about <em>when</em> the person had donated.) For the reasons Owen mentions, we did this once (to get a sense of whether reporting was approx accurate) but we aren't planning to do it again. </p>\n", "parentCommentId": "NXLgzm828cWpfiahX", "user": {"username": "Michelle_Hutchinson"}}, {"_id": "iyA5PP5AKc4JDBYjt", "postedAt": "2015-06-29T11:50:11.566Z", "postId": "T8JqFbGoFSfET39CW", "htmlBody": "<p>On the 2009 cohort -- would it make sense to bucket this with the 2010 cohort? (So treating the first 14 months of GWWC as one cohort, and in years thereafter)</p>\n", "parentCommentId": "PnY5u8hTCZt8EP9wa", "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "KppSXP6H5jyQPtu69", "postedAt": "2015-07-01T18:53:31.811Z", "postId": "T8JqFbGoFSfET39CW", "htmlBody": "<p>Congrats on using up the matching funding!</p>\n", "parentCommentId": null, "user": {"username": "AlexVermeer"}}, {"_id": "GAPBRPNwSbLwtQGuK", "postedAt": "2015-07-02T12:33:52.120Z", "postId": "T8JqFbGoFSfET39CW", "htmlBody": "<p>Thank you!</p>\n", "parentCommentId": "KppSXP6H5jyQPtu69", "user": {"username": "Michelle_Hutchinson"}}]