[{"_id": "rkqHgzLyqupbp3dqZ", "postedAt": "2022-12-07T00:40:17.929Z", "postId": "T8XjJiMWrf4Sy6T6m", "htmlBody": "<p>How does Workstream Services differ from Anti-Entropy?</p>", "parentCommentId": null, "user": {"username": "vaidehi_agarwalla"}}, {"_id": "bWHLwMgEAqBYg83t8", "postedAt": "2022-12-07T01:05:50.824Z", "postId": "T8XjJiMWrf4Sy6T6m", "htmlBody": "<p>Anti Entropy focuses on providing short-term operational resources to supplement an organization and get them past specific obstacles. They provide \"things\" to support orgs, which is extremely valuable. WorkStream provides talent and personnel development and ongoing coaching. We focus on upskilling people and guiding them through growing their organizations.&nbsp;</p>", "parentCommentId": "rkqHgzLyqupbp3dqZ", "user": {"username": "Deena Englander"}}, {"_id": "gN6zLqKR2AqRoWcn9", "postedAt": "2022-12-07T03:44:37.473Z", "postId": "T8XjJiMWrf4Sy6T6m", "htmlBody": "<p>Thanks for the clarification. I actually thought Anti Entropy was also working on this, at least last time I checked (but perhaps Jeffrey would be better placed to answer this)&nbsp;</p>", "parentCommentId": "bWHLwMgEAqBYg83t8", "user": {"username": "vaidehi_agarwalla"}}, {"_id": "GQRbAQsgyyfzstqXT", "postedAt": "2022-12-07T14:54:05.923Z", "postId": "T8XjJiMWrf4Sy6T6m", "htmlBody": "<p>I've been working with Deena for a little over a year now and I can personally attest to her being fantastic to work with. During that time I experimented with four other coaches/consultants, and she's the only one I've stuck with.&nbsp;</p><p>Main benefits of working with her:</p><ul><li><strong>Practical intelligence </strong>and experience that's sorely lacking in EA. While most EAs are talented at abstract ideas, we tend to be less experienced at hand-on implementation. Deena excels at this</li><li><strong>Inspiring and confidence-giving.</strong> If you suffer from impostor syndrome or anxiety, Deena is great to work with. I feel like whenever I'm facing a complex ball of ambiguity, a conversation with her will leave me feeling confident and knowing what to do next.</li></ul>", "parentCommentId": null, "user": {"username": "katherinesavoie"}}]