[{"_id": "kyoSHoY9Hn6by9zRq", "postedAt": "2023-10-03T22:29:44.885Z", "postId": "T9tEbjyDBmLHL5Dd6", "htmlBody": "<p>At the time of me posting this there are 3 duplicate posts on this:<br><a href=\"https://forum.effectivealtruism.org/posts/ycCXDofXr89DyxKqm/wealth-redistribution-are-we-on-the-same-page-1\">https://forum.effectivealtruism.org/posts/ycCXDofXr89DyxKqm/wealth-redistribution-are-we-on-the-same-page-1</a><br><br><a href=\"https://forum.effectivealtruism.org/posts/3Gp3mKF4mg3aXqEKC/wealth-redistribution-are-we-on-the-same-page-5\">https://forum.effectivealtruism.org/posts/3Gp3mKF4mg3aXqEKC/wealth-redistribution-are-we-on-the-same-page-5</a><br><br><a href=\"https://forum.effectivealtruism.org/posts/7iAkFkaj7cHJbMZWd/wealth-redistribution-are-we-on-the-same-page-6\">https://forum.effectivealtruism.org/posts/7iAkFkaj7cHJbMZWd/wealth-redistribution-are-we-on-the-same-page-6</a><br><br>While this is in some ways poetic about a post asking whether or not we are all on the same page, I'm guessing you want to delete the duplicates.</p>", "parentCommentId": null, "user": {"username": "dan.pandori"}}, {"_id": "sLbAhkRanjnxYB8wq", "postedAt": "2023-10-04T00:13:09.059Z", "postId": "T9tEbjyDBmLHL5Dd6", "htmlBody": "<p>Related: <a href=\"https://forum.effectivealtruism.org/posts/tqJG3omjWrdaLcSHk/effective-altruism-s-billionaires-aren-t-taxed-enough-but\">Effective altruism's billionaires aren't taxed enough. But they're trying.</a>&nbsp;</p>", "parentCommentId": null, "user": {"username": "AnonymousAccount"}}, {"_id": "aoqeSk8wyRdeg8uEm", "postedAt": "2023-10-04T00:52:58.335Z", "postId": "T9tEbjyDBmLHL5Dd6", "htmlBody": "<p>I think before we can get on the same page, a few questions need to be answered first:</p><ul><li>How are we redistributing wealth? Are you proposing a wealth tax? If so, why is that better than a progressive income tax, a value-added tax, or a land value tax etc.? These details matter quite a lot since some taxes produce inefficient side effects in the form of lost production and consumption. For example, a wealth tax would likely directly shrink the capital stock, reducing wages for workers and slowing economic growth, a point that is <a href=\"https://www.brookings.edu/wp-content/uploads/2020/10/Saez-Zuchman-final-draft.pdf\">conceded by smart advocates of wealth taxes</a>. Over sufficiently long periods of time, in theory, this effect can outweigh the distributional effects in a utilitarian framework. On the other hand, <a href=\"https://en.wikipedia.org/wiki/Land_value_tax\">land value taxes</a> seem promising because, in simple models, they yield no <a href=\"https://en.wikipedia.org/wiki/Deadweight_loss\">deadweight loss</a>.</li><li>Where is the wealth being distributed? Almost all tax revenue in the United States is currently redirected to poor and middle class Americans rather than to poor people around the world. This is far from an optimal redistibution scheme given that the <a href=\"https://en.wikipedia.org/wiki/Land_value_tax\">20th percentile American household is rich</a> by international standards when measured by economic consumption rather than wealth or income. Achieving a policy that provides substantial amounts of effective foreign aid to the poor is currently politically non-viable.</li><li>What is the marginal value of advocacy? It's not enough that wealth redistribution is good in theory. We need to know how much of a difference individual advocacy makes, and compare that to other EA causes. This is hard to know for sure, but we can make guesses.</li></ul>", "parentCommentId": null, "user": {"username": "Matthew_Barnett"}}, {"_id": "TQcdXbnGxn7WTqsrT", "postedAt": "2023-10-04T02:19:16.499Z", "postId": "T9tEbjyDBmLHL5Dd6", "htmlBody": "<p>Thanks, the replicated posts is a mistake and I don't know why that happened. I think they're deleted now.</p>", "parentCommentId": "kyoSHoY9Hn6by9zRq", "user": {"username": "dEAsign"}}, {"_id": "JeJikBCyAKhJgyMaB", "postedAt": "2023-10-04T05:21:07.284Z", "postId": "T9tEbjyDBmLHL5Dd6", "htmlBody": "<p>I agree with you while heartedly in in principle, but wealth taxes seem to have failed to achieve their goal. Rich people rub to other places and dodge it. In Europe far more countries are ditching them than implementing it.</p>\n<p><a href=\"https://www.npr.org/sections/money/2019/02/26/698057356/if-a-wealth-tax-is-such-a-good-idea-why-did-europe-kill-theirs\">https://www.npr.org/sections/money/2019/02/26/698057356/if-a-wealth-tax-is-such-a-good-idea-why-did-europe-kill-theirs</a></p>\n<p>As Matthew Barnett said, most economists seem to agree that land value taxes are a far more efficient way of redistributing wealth. Unfortunately they are so unpopular they are hard to implement, which is part of why politicians keep trying to drum up support for the mostly failed policy of wealth taxes.</p>\n<p>Personally I would love to redistribute wealth more even within rich countries, because like you say there's no evidence it would reduce giving outside countries. It just ain't easy to do.</p>\n", "parentCommentId": null, "user": {"username": "NickLaing"}}]