[{"_id": "GnKEttDc87ek4c8gh", "postedAt": "2023-07-26T16:00:05.535Z", "postId": "TCHNn4t9xL6pzSuZX", "htmlBody": "<p>This seems overall very good at first glance, and then seems much better once I realized that Meta is not on the list. There's nothing here that I'd call substantial capabilities acceleration (i.e. attempts to collaborate on building larger and larger foundation models, though some of this could be construed as making foundation models more useful for specific tasks). Sharing <a href=\"https://www.lesswrong.com/posts/EjgfreeibTXRx9Ham/ten-levels-of-ai-alignment-difficulty#Alignment_vs__Capabilities\">safety-capabilities research like better oversight or CAI techniques </a>is plausibly strongly net positive even if the techniques don't scale indefinitely. By the same logic, while this by itself is nowhere near sufficient to get us AI existential safety if alignment is very hard (and could increase complacency), it's still a big step in the right direction.</p><blockquote><p>adversarial robustness, mechanistic interpretability, scalable oversight, independent research access, emergent behaviors and anomaly detection. There will be a strong focus initially on developing and sharing a public library of technical evaluations and benchmarks for frontier AI models.</p></blockquote><p>The mention of combating cyber threats is also a step towards <a href=\"https://www.lesswrong.com/posts/EjgfreeibTXRx9Ham/ten-levels-of-ai-alignment-difficulty#Techniques_which_produce_positively_transformative_AI\">explicit pTAI</a>.&nbsp;</p><p>BUT, crucially, because Meta is frozen out we can know both that this partnership isn't toothless, represents a commitment to not do the most risky and antisocial things Meta presumably doesn't want to give up, and the fact that they're the only major AI company in the US to not join will be horrible PR for them as well.&nbsp;</p>", "parentCommentId": null, "user": {"username": "SammyDMartin"}}, {"_id": "RBzYcnts5domqEdMv", "postedAt": "2023-07-26T16:07:05.692Z", "postId": "TCHNn4t9xL6pzSuZX", "htmlBody": "<p>(Briefly-- I of course agree that Meta AI is currently bad at safety, but I think a more constructive and less adversarial approach to them is optimal. And it doesn't seem that they're \"frozen out\"; I hope they improve their safety and join the FMF in the future.)</p>", "parentCommentId": "GnKEttDc87ek4c8gh", "user": {"username": "zsp"}}, {"_id": "Wk3xiCYT6hgwCjnfc", "postedAt": "2023-07-26T16:17:21.598Z", "postId": "TCHNn4t9xL6pzSuZX", "htmlBody": "<p>Yeah I didn't mean to imply that it's a good idea to keep them out permanently, but the fact that they're not in right now is a good sign that this is for real. If they'd just joined and not changed anything about their current approach I'd suspect the whole thing was for show</p>", "parentCommentId": "RBzYcnts5domqEdMv", "user": {"username": "SammyDMartin"}}, {"_id": "6S4y8zQQP4sq5HDqn", "postedAt": "2023-07-27T03:33:02.276Z", "postId": "TCHNn4t9xL6pzSuZX", "htmlBody": "<p>For someone new to looking at AI concerns, can either of you briefly explain why Meta is worse than the others? The biggest difference I'm aware of is that Meta is open source vs the others that are not</p>", "parentCommentId": "Wk3xiCYT6hgwCjnfc", "user": {"username": "Andreas P"}}, {"_id": "mFdYKN9B2GPWqBguD", "postedAt": "2023-07-27T06:44:08.112Z", "postId": "TCHNn4t9xL6pzSuZX", "htmlBody": "<p>Good question. Yeah, Meta AI tends to share their research and model weights while OpenAI, Google DeepMind, and Anthropic seem to be becoming more closed. But more generally, those three labs seem to be concerned about catastrophic risk from AI while Meta does not. Those three labs have alignment plans (more or less), they do alignment research, they are working toward good red-teaming and <a href=\"https://www.deepmind.com/blog/an-early-warning-system-for-novel-ai-risks\">model</a> <a href=\"https://evals.alignment.org\">evals</a>, they tend to support strong regulation that might be able to prevent dangerous AI from being trained or deployed, their leadership talks about catastrophic risks, and a decent chunk of their staff is concerned about catastrophic risks.</p><p>Sorry I don't have time to provide sources for all these claims.</p>", "parentCommentId": "6S4y8zQQP4sq5HDqn", "user": {"username": "zsp"}}, {"_id": "6EBTCCDXjF6QJHo6p", "postedAt": "2023-07-28T23:19:59.954Z", "postId": "TCHNn4t9xL6pzSuZX", "htmlBody": "<p>Separately from the other thread-- the little evidence I'm aware of (bing chat, <a href=\"https://arxiv.org/abs/2303.12712\">sparks of AGI</a>, absence of evidence on safety) suggests that Microsoft is bad on safety. I'm surprised they were included.</p><p>Edit: and I weakly think their capabilities aren't near the frontier, except for their access to OpenAI's stuff.</p>", "parentCommentId": "GnKEttDc87ek4c8gh", "user": {"username": "zsp"}}, {"_id": "ex2nk3X5GfCLiMmiZ", "postedAt": "2023-07-29T08:09:49.563Z", "postId": "TCHNn4t9xL6pzSuZX", "htmlBody": "<p>Not a problem, that's a good starting point for me to effectively jump into the different reasons and find sources. I appreciate it!</p>", "parentCommentId": "mFdYKN9B2GPWqBguD", "user": {"username": "Andreas P"}}]