[{"_id": "CL3o47sCZb4PkWr2k", "postedAt": "2014-12-10T00:53:46.523Z", "postId": "TCr8gEfeFyZQcEHFR", "htmlBody": "<p>Re: <strong>Step Two: Track Your Time!</strong></p>\n<p>If you spend a lot of time on the computer, the best software I have found is <a href=\"http://www.manictime.com/\">ManicTime</a> which <em>automatically</em> tracks all your tasks, allows you to tag the time you've spent, and shows you fine statistics about what you spent your time on (which pages, which document, how long/each, per day, per any time period).</p>\n", "parentCommentId": null, "user": {"username": "yboris"}}, {"_id": "knREcRJLBMcHfQBPh", "postedAt": "2014-12-23T20:05:48.123Z", "postId": "TCr8gEfeFyZQcEHFR", "htmlBody": "<p>I read through all the steps but haven't actually done more than step 1 yet (will do step 2 after Christmas when I'm back to a more normal week). I foresee getting stuck on Step 3, though. One of my goals was to do more activism things. This could involve tabling at festivals, leafleting, whatever else. It's not something that I would do on a regular basis on a free hour each day. If I find a free hour, I could possibly use that time to <em>plan</em> the activism things I'll do, but I imagine it'll be hard to not do that in the mix of the activism-related emailing and planning that I'm currently doing, and to set that aside to a specific time.</p>\n<p>Maybe my mistake was that my goal isn't something I'm not doing currently, since it's an &quot;I want to do more of this&quot; type thing.</p>\n<p>Suggestions?</p>\n", "parentCommentId": null, "user": {"username": "Gina_Stuessy"}}, {"_id": "HNsTJCLMHbgR3K4Bo", "postedAt": "2014-12-23T23:23:22.460Z", "postId": "TCr8gEfeFyZQcEHFR", "htmlBody": "<blockquote>\n<p>One of my goals was to do more activism things. This could involve tabling at festivals, leafleting, whatever else. It's not something that I would do on a regular basis on a free hour each day.  If I find a free hour, I could possibly use that time to plan the activism things I'll do</p>\n</blockquote>\n<p>That's fair.  There's no requirement that your goal take the form of something done daily or weekly.  You might make a commitment to X actions per month, or something.  Or you can get more elaborate -- Y instances of this action, Z instances of that action, etc.</p>\n<p>You can still timebox, it just looks more like &quot;I'm going to devote this time on Saturdays to activism&quot; than &quot;I'm using this free hour for activism&quot;.</p>\n", "parentCommentId": "knREcRJLBMcHfQBPh", "user": {"username": "Peter_Hurford"}}]