[{"_id": "k5SHhnuvWniTwJaEK", "postedAt": "2018-06-05T02:24:09.566Z", "postId": "TcS6squwsJSg2kdQm", "htmlBody": "<p>Thanks for the model! I found it useful for framing many community building plans. I am a community builder for EA Toronto, a local community group as opposed to a university/college group (though we will hopefully be collaborating with more schools and students soon).</p>\n<p>For community group contexts, I think most of the elements in the model above fit in well, especially 1 on 1s. One element that I think might not cross-over so easily is the EA Seminar. People coming into an EA community of varying backgrounds, ages, and professional statuses might not get excited about or feel the benefit of an EA Seminar in the way that students would. There seems to be some interest in this kind of core ideas event, yet it feels like this event could/should take a different shape in the local group context, though I am not sure what yet. \nI think there is also a worry about teaching EA as opposed to encouraging more grassroots and self-learning of EA ideas, though much of this can be handled by good planning and facilitation, as opposed to lecturing and other limited group formats. \nI would be happy to hear if other people are having similar concerns about what seem to be core EA event types when there are applied in different contexts. </p>\n", "parentCommentId": null, "user": {"username": "ColinBested"}}, {"_id": "2tCnk2WZKiSXaFpqR", "postedAt": "2018-06-05T10:01:20.326Z", "postId": "TcS6squwsJSg2kdQm", "htmlBody": "<p>This could be another post for the list of links at the bottom:</p>\n<p><a href=\"https://www.benkuhn.net/studentgroup\">https://www.benkuhn.net/studentgroup</a></p>\n<p><a href=\"http://effective-altruism.com/ea/a6/outreaching_effective_altruism_locally_resources/\">See also</a></p>\n", "parentCommentId": null, "user": {"username": "John_Maxwell_IV"}}, {"_id": "MJ7RkQ3kmNXtXXukW", "postedAt": "2019-01-27T09:20:46.309Z", "postId": "TcS6squwsJSg2kdQm", "htmlBody": "<p><a href=\"https://forum.effectivealtruism.org/posts/suGcEobbHZZ4Gspeh/a-guide-to-effective-altruism-fellowships\">Here&#x27;s another</a></p>", "parentCommentId": "2tCnk2WZKiSXaFpqR", "user": {"username": "John_Maxwell_IV"}}]