[{"_id": "xWHG59yk2LtBEhBKu", "postedAt": "2024-03-11T21:06:04.849Z", "postId": "TDfC3JdCPzCeE5P8B", "htmlBody": "<p>This is an interesting paper Arturo. I particularly like the way that I'm thinking <i>needs to be a Vickrey auction to have any chance of being fair </i>and then I get to page two of the paper and you've considered this option and are formally modelling it as a variant!</p><p>But from what I can see this has the same vulnerability as other stored vote systems in that it's relatively easy to manipulate the outcome of a vote if you can influence other votes that are held [first], with the Vickrey auction significantly reducing but not entirely eliminating the effect.</p><p>Say, for example, a farming lobby are worried that animal-rights activists might use their extra votes to vote against a subsidy for the farming industry, which the animal rights activists feel quite strongly will have a bad impact on animal welfare.</p><p>A simple way to manipulate the outcome is to ensure that there are also one or more proposals to allow things animal-rights activists feel <i>even more</i> strongly are bad for animal welfare to be voted on, like repealing existing animal protection legislation. Animal rights activists use their extra votes on this proposal (and the farmers don't), so the farmers have a big vote advantage when it comes to the subsidy bill even if they were originally outnumbered (for simplicity, I assume everybody else doesn't care to vote on either of those issues)</p><p>The intensity of animal rights activists' preferences about the farming bill haven't changed at all (and nor has the farmers' or average person's) but the fact that some stuff they intensely dislike was put on the agenda means a completely different outcome.&nbsp;</p><p>This might never happen within a high trust organization or where rules limit what can be voted on, but in real world contested political environments it's often very different</p><p>In fact, this system might be a little <i>more</i> vulnerable to this behaviour than the original Stored Vote variant. In the original Stored Vote animal rights activists might (correctly) predict that farmers won't want to waste their votes on proposals about hunting or pet mistreatment, and save most of their votes to vote against the farmers on the subsidy. But under this system, farmers can credibly commit to using some of their vote budget on anti-animal spoiler bills, knowing that they'll get votes back (provided they lose, as expected) and the animal rights activists won't.&nbsp;</p><p>The Vickrey auction system reduces that impact because animal rights activists can afford to use <i>all</i> their votes defending against stupid spoiler proposals and get most of them back when hardly anybody votes the other side, but anyone with the ability to influence what votes are held when can still ensure a particular voting bloc eventually runs out of the ability to defend against future proposals. &nbsp; &nbsp;</p>", "parentCommentId": null, "user": {"username": "David T"}}, {"_id": "GJcg8g76api8N5Kim", "postedAt": "2024-03-11T21:18:24.399Z", "postId": "TDfC3JdCPzCeE5P8B", "htmlBody": "<p>The agenda setting problem in my view is imposible to solve. Read the second paper (the ssrn pre print “the ideal political workflow”.</p>\n<p>As long as voting in arbitrary “words” spaces is allowed, all our mathematical models are simply treading water.</p>\n<p>My opinion on SV-PAYW, is that as a voting system is more or less as good as anything can be. But the structuring of voting spaces is more important than the voting system.</p>\n", "parentCommentId": "xWHG59yk2LtBEhBKu", "user": {"username": "Arturo Macias"}}, {"_id": "AQKKo76whyCxkBiSo", "postedAt": "2024-03-12T07:10:52.166Z", "postId": "TDfC3JdCPzCeE5P8B", "htmlBody": "<p>This post has been more commented in Less Wrong:</p><p><a href=\"https://www.lesswrong.com/posts/5wqFoHBBgpdHeCLS6/storable-votes-with-a-pay-as-you-win-mechanism-a\">https://www.lesswrong.com/posts/5wqFoHBBgpdHeCLS6/storable-votes-with-a-pay-as-you-win-mechanism-a</a></p>", "parentCommentId": null, "user": {"username": "Arturo Macias"}}]