[{"_id": "DyoZ4jBs3wMXp4QPS", "postedAt": "2014-09-16T14:12:49.525Z", "postId": "TeAfotdH5GoAKDRuw", "htmlBody": "<p>This a great post. After 6 months being involved with effective altruism and discussing it with many people I feel  confident that there is enormous potential for outreach and growth for the EA movement in the mainstream once it's understood that altruism isn't at the outset a strong motivator for most people when it comes to turning fine words into meaningful action.  As the marketing industry understands parting people from their cash is most effectively achieved by focussing on subtle messaging around fear, status and happiness dependent on the particular target market.    It is likely that people can be moved to a genuinely more alruistic mindset through time, but leading with this with ever increased persistence is akin to shouting at a Frenchman in English because he didn't understand you the first time around.</p>\n<p>From conversations with my peer group I think the  mainstream will be most attracted by charities around existential risk (broadening this out into sustainability related issues), playing on well placed worries about the future, and extreme poverty alleviation given a rarely voiced unease that extreme global inequality is creating fertile ground for extremism, as well as getting involved in a strong community full of inspirational people where greater giving leads to higher status.  The interest around a vegetarian lifestyle is probably most easily generated from the unsustainability of our current meat eating habits.  My peer group seem to easily understand and be attracted to Givewell etc,, as &quot;Gocompare for charities&quot; as a way of ensuring their money goes the farthest  but will not be so interested in getting into a highly academic debate around it - being more interested in more general discussions around a happier lifestyle.  These initial thoughts (and others from whoever else is interested) requires a proper piece of market research to a properly representative group to validate and prioritise them - outreach can be conducted with as much evidence and reason as cause selection - which can be used to define market segmentation and definition of the marketing mix to the respective segments.   As I have some knowledge in this area I am keen to create a project team on this and would love to hear from anybody who is interested in being  involved.</p>\n", "parentCommentId": null, "user": {"username": "DavidRooke"}}, {"_id": "ix3tDszXGvGd6CDWJ", "postedAt": "2014-09-16T17:38:39.664Z", "postId": "TeAfotdH5GoAKDRuw", "htmlBody": "<p>Thanks for the response!</p>\n<blockquote>\n<p>As I have some knowledge in this area I am keen to create a project team on this and would love to hear from anybody who is interested in being involved.</p>\n</blockquote>\n<p>This could potentially make a good <a href=\"http://www.dotimpact.im\">.impact project</a>.  Also, you should talk to <a href=\"http://www.charityscience.com/\">Charity Science</a>, which is an EA organization working full-time to fundraise for GiveWell top charities.  They just recently had <a href=\"http://donate.charityscience.com/\">an event</a> that raised $11.6K for Deworm the World.</p>\n", "parentCommentId": "DyoZ4jBs3wMXp4QPS", "user": {"username": "Peter_Hurford"}}, {"_id": "nsKmnqHoLM7z8m8ji", "postedAt": "2014-09-27T23:04:17.253Z", "postId": "TeAfotdH5GoAKDRuw", "htmlBody": "<p>David, I'm just curious, but who exactly is in your peer group?</p>\n", "parentCommentId": "DyoZ4jBs3wMXp4QPS", "user": {"username": "Evan_Gaensbauer"}}]