[{"_id": "QtrLtgjoXg37gkteq", "postedAt": "2023-11-28T00:18:02.780Z", "postId": "TeknjqDR7EM7keN3G", "htmlBody": "<p>Very exciting to see this rolled out! I love the new recommendations page, and I’m thrilled that GWWC is taking the “evaluate the evaluators” mission seriously. The one thing I’m kind of confused by is the new GWWC funds. Don’t EA funds already serve as the natural choice for donors who want high impact giving opportunities within a particular cause area and don’t want to worry about having to manually update their selections as recommendations change? Having a duplicate set of funds within Effective Ventures seems like it will add overhead and confusion without necessarily providing a clear benefit. In trying to think through the potential benefits, I do see how having the GWWC funds would make it possible to not recommend certain EA funds in future years if you were to find issues with their grantmaking. However, it seems like those kinds of issues could also be addressed via the EA funds making changes in response to the GWWC research team’s findings. Having two sets of competing funds trying to do the same thing within EV just appears to me to be a potentially poor use of resources unless there’s a clear justification for keeping them separate.&nbsp;</p><p>&nbsp;</p><p>My apologies if this question has already been addressed elsewhere, I tried to look back through the previous announcement and AMA but may have missed some discussions.&nbsp;</p>", "parentCommentId": null, "user": {"username": "MHR"}}, {"_id": "NyuuesrCTdqCG69cC", "postedAt": "2023-11-28T08:27:41.059Z", "postId": "TeknjqDR7EM7keN3G", "htmlBody": "<p>I’m also confused about this.</p>\n<p>As I understand things there are now two different global health funds under the Effective Ventures umbrella, both of which currently amount to deferring to GiveWell (which, to be clear, I think makes a lot of sense!) with extra steps.</p>\n<p>First there’s the EA Funds Global Health and Development Fund, which really seems to be equivalent to the GiveWell All Grants fund but with EA Funds branding. The fund managers are <a href=\"https://funds.effectivealtruism.org/funds/global-development#fund-managers\">listed</a> as Elie Hassenfeld (co-founder and CEO of GiveWell) and GiveWell Staff, and the <a href=\"https://www.givewell.org/gwuk/about/faq\">GiveWell UK FAQ</a> says:</p>\n<blockquote>\n<p>GiveWell acts as the manager of the Fund and directs EA Funds on where to grant it. Giving to the GH&amp;D Fund is analogous to giving to GiveWell's <a href=\"https://www.givewell.org/research/all-grants\">All Grants Fund</a> in that we may allocate the Fund to less certain but still high-expected-value opportunities outside of our top charities. You might choose to give to the GH&amp;D Fund instead of our All Grants Fund via GiveWell UK if you would also like to support other cause areas through EA Funds (such as its <a href=\"https://funds.effectivealtruism.org/funds/animal-welfare\">Animal Welfare Fund</a>, <a href=\"https://funds.effectivealtruism.org/funds/far-future\">Long-Term Future Fund</a>, or <a href=\"https://funds.effectivealtruism.org/funds/ea-community\">EA Infrastructure Fund</a>).</p>\n</blockquote>\n<p>That last sentence is the only publicly stated justification I’ve found for why the EA Funds GH&amp;D Fund exists. It doesn’t seem very compelling to me. I guess it would have been awkward to create EA Funds for the other cause areas but not for global health?</p>\n<p>And now there’s the GWWC Global Health and Wellbeing Fund, whose <a href=\"https://www.givingwhatwecan.org/en-GB/charities/global-health-and-wellbeing-fund\">webpage</a> says:</p>\n<blockquote>\n<p>[Grants from the fund] may include allocations to:</p>\n<ul>\n<li>Charities or projects recommended by an evaluator/grantmaker the research team has evaluated (such as a grant to <a href=\"https://www.givingwhatwecan.org/en-GB/charities/against-malaria-foundation\">Against Malaria Foundation</a>, which is recommended by <a href=\"http://www.givewell.com/\">GiveWell</a>).</li>\n<li>A fund run by an evaluator the research team has evaluated (such as a grant to whichever GiveWell funds can best use it).</li>\n<li>Charities or projects the research team has reason to believe are highly impactful, including cases where this reasoning isn’t the result of deferring to a vetted evaluator (though we expect this to be rare, as the research team generally evaluates evaluators rather than individual charities or projects).</li>\n</ul>\n<p>…</p>\n<p>For this first round, we expect to allocate donations to this fund in consultation with GiveWell, based on our recent <a href=\"https://docs.google.com/document/d/1rn1d69KR3zfVzZaRZvSZNp1vcDap1hudzxngNqeFHuc/edit#heading=h.e3jonqb3x294\">evaluation of its work</a>. In practice, this will likely closely resemble the grantmaking of GiveWell’s All Grants Fund… Our research team may identify new funding opportunities (outside of those recommended by GiveWell) in future grantmaking rounds.</p>\n</blockquote>\n<p>Here there’s potential at least for future divergence from GiveWell’s recommendations. But it seems this will really only come into its own if GWWC finds another global health evaluator it endorses, or develops substantial global health expertise of its own.</p>\n<p>More broadly, now that GWWC has launched its own funds, how does Effective Ventures expect the relationship between GWWC and other grantmakers under the <a href=\"https://forum.effectivealtruism.org/posts/GRYFJGnye2gCxCTG4/ea-orgs-legal-structure-inhibits-risk-taking-and-information\">EV fiscal sponsorship umbrella</a> to evolve? What would the internal governance and external communications look like if, hypothetically, the GWWC research team concluded that one of the other EV-sponsored grantmakers was allocating funds poorly?</p>\n", "parentCommentId": "QtrLtgjoXg37gkteq", "user": {"username": "Andrew Gimber"}}, {"_id": "cvaXw6ZuBQGyTgacj", "postedAt": "2023-11-28T17:27:11.720Z", "postId": "TeknjqDR7EM7keN3G", "htmlBody": "<p>Thank you! Great question. I can't speak on behalf of EA Funds and their plans going forward, but I can say our new GWWC cause area funds are meaningfully different from their funds (at least as they've been operating so far).</p>\n<p>The biggest differences IMO are</p>\n<ul>\n<li>The EA Funds generally (with the exception of the GHD Fund) only make grants to organisations that apply for funding with them.</li>\n<li>The EA Funds are managed by a limited set of expert grantmakers.</li>\n</ul>\n<p>Our GWWC cause area funds, on the other hand, ultimately aim to cover recommendations and grantmaking by nearly all impact-focused evaluators and grantmakers, based on our <a href=\"https://forum.effectivealtruism.org/posts/PTHskHoNpcRDZtJoh/gwwc-s-evaluations-of-evaluators\">evaluations of these evaluators</a>, but we don't accept any grant applications ourselves.</p>\n<p>For instance, EA Funds currently doesn't consider any of Founders Pledge's or Longview's evaluations or active search for high-impact opportunities to inform their grantmaking, whereas our GWWC Funds do (or will do in the case of Founders Pledge) and <em>additionally</em> consider EA Funds as a grantmaker/evaluator.</p>\n<p>For the EA GHD Fund and the GWWC GH&amp;W Fund in particular, the difference is currently less pronounced. This is because we ended up working with GiveWell based on our initial evaluations, and EA Funds has historically asked them to advise their fund as well. However, this could easily change in the short- to medium-term, e.g. we hope to evaluate both Happier Lives Institute and Founders Pledge next year as candidates for evaluators informing our GH&amp;W Fund grantmaking in addition to GiveWell.</p>\n<p>Hope that clarifies a bit! Happy to elaborate further on the differences if helpful.</p>\n", "parentCommentId": "QtrLtgjoXg37gkteq", "user": {"username": "SjirH"}}, {"_id": "yyQtvkzcqrgysy4aH", "postedAt": "2023-11-28T17:48:03.499Z", "postId": "TeknjqDR7EM7keN3G", "htmlBody": "<p>Thanks Andrew. I hope I answered most of your question by my response to MHR above, but on the EV part: (caveating that I am not speaking on behalf of EV here nor have legal expertise on the governance question, but giving my personal understanding of the situation here)</p>\n<p>GWWC and EA Funds are separate projects within EV; are managed separately; and communicate separately. I would be surprised if we were to discontinue supporting the EA Funds on our <a href=\"https://www.givingwhatwecan.org/donate/organizations\">donation platform</a>, given they clearly meet our <a href=\"https://www.givingwhatwecan.org/en-US/inclusion-criteria\">inclusion criteria</a>, but there is no need/pressure for us to recommend EA Funds (e.g. we currently don't recommend the EA GHD Fund nor the EA Infrastructure Fund, as we haven't looked into them yet). We acknowledge the conflict of interest, but I hope our reports on the <a href=\"https://docs.google.com/document/d/1hqYNZ9zJfe3D_nyJ4b21J0IJs210upAXTw8fPWnYJe8/edit#heading=h.kiw67f2s2v90\">EA AWF</a> and <a href=\"https://docs.google.com/document/d/1VORv9BwjByRgP-1d3ZbaEmYvWuDz5XDd_94kTNs_TCk/edit#heading=h.kiw67f2s2v90\">EA LTFF</a> show we are not holding back on pointing out where we think EA Funds can improve.</p>\n<p>As I understand it, there are legal restrictions EV (including GWWC and EA Funds) has to obey, and if EA Funds would ever allocate funding in ways that aren't in accordance with EV's stated purpose that would obviously have consequences, but I'd expect those types of situations won't have much to do with GWWC in particular.</p>\n<p>That's about as much as I know to say on this; hope it answers your question!</p>\n", "parentCommentId": "NyuuesrCTdqCG69cC", "user": {"username": "SjirH"}}, {"_id": "vFStzdjeWYAAFf2fE", "postedAt": "2023-12-02T02:36:01.450Z", "postId": "TeknjqDR7EM7keN3G", "htmlBody": "<p>Thanks Sjir! That helps me understand the circumstances better, and I do see why the GWWC funds might serve a useful role in today's funding ecosystem. If I could wave a magic wand and reorganize EV, I might still be tempted to think that the best course of action would be to change the EA funds' processes rather than adding new funds entirely (e.g. having AWF/LTFF make unsolicited grants in addition to the application process), but what you're saying makes a fair amount sense given how EV is structured.&nbsp;</p>", "parentCommentId": "cvaXw6ZuBQGyTgacj", "user": {"username": "MHR"}}]