[{"_id": "uQCjbfK32pDyDcNXL", "postedAt": "2015-02-27T20:39:46.413Z", "postId": "TFDTKfemMnGbKp3YG", "htmlBody": "<p>Congrats on launching! This is super interesting so I have a bunch of questions. I've split them up into multiple comments for ease of threading.</p>\n<p>First, from your website:</p>\n<blockquote>\n<p>We merge expert judgment with statistical models of project success. We used our expertise and the expertise of our advisers to determine a set of variables that is likely to be positively correlated with project success. We then utilize a multi-criteria decision analysis framework which provides context-sensitive weightings to several predictive variables. Our framework adjusts the weighting of variables to fit the context of the projects and adjusts the importance of feedback from different evaluators to fit their expertise.</p>\n</blockquote>\n<p>How are the weights actually computed? How was the model fit? On what dataset? How does the score influence your recommendations?</p>\n", "parentCommentId": null, "user": {"username": "Ben_Kuhn"}}, {"_id": "5tguggKWxcN26eckJ", "postedAt": "2015-02-27T20:41:28.551Z", "postId": "TFDTKfemMnGbKp3YG", "htmlBody": "<blockquote>\n<p>GiveWell has argued in multiple blog posts that interesting projects often do not appear until a major funder signals an interest in funding a project. This aligns with my experience running the Technology and Innovation department at the Laura and John Arnold Foundation and with YCombinator’s recently announced Requests for Startups. We designed Effective Altruism Ventures to provide this signal for EA-aligned projects.</p>\n<p>...</p>\n<p>Entrepreneurs without their own project, but who are interested in working on one of the projects we recommend.</p>\n</blockquote>\n<p>Where are these recommendations? Do you have YC-style Request For Startups somewhere or something? I can't find them. &quot;EA-aligned projects&quot; doesn't seem like a very concrete signal (the suggestion &quot;start an EA-aligned project&quot; is a lot less actionable than e.g. &quot;replace email&quot; or whatever the new RFSs are).</p>\n", "parentCommentId": null, "user": {"username": "Ben_Kuhn"}}, {"_id": "HzGDrLbzmceyBdewG", "postedAt": "2015-02-27T20:41:35.431Z", "postId": "TFDTKfemMnGbKp3YG", "htmlBody": "<p>From the site:</p>\n<blockquote>\n<p>We collaborate with value-aligned networks and funding bodies to source and syndicate proposals</p>\n</blockquote>\n<p>What's the nature of your collaboration with YC and Full Circle?</p>\n", "parentCommentId": null, "user": {"username": "Ben_Kuhn"}}, {"_id": "w7B7FuXKDAq3k5vAh", "postedAt": "2015-02-27T20:49:55.366Z", "postId": "TFDTKfemMnGbKp3YG", "htmlBody": "<blockquote>\n<p>The results of our evaluation indicate that there is insufficient evidence to recommend making donations directly to Effective Altruism Ventures at this time. This is consistent with our current plan of running the project on a volunteer basis for 3-6 months before fundraising to support operational costs.</p>\n</blockquote>\n<p>It seems to me that for many of the organizations you fund, if they wouldn't otherwise be funded by other people, a verdict of &quot;wait for more evidence&quot; will have approximately the same impact as a verdict of &quot;do not fund.&quot; EAV seems somewhat special in that its founders' funders are aligned with their goals enough to be fine with them spending substantial time on the project. I hope you take this into account when making recommendations for other organizations.</p>\n", "parentCommentId": null, "user": {"username": "Ben_Kuhn"}}, {"_id": "Rd3fbDcK3gK9veEZZ", "postedAt": "2015-02-27T21:36:48.500Z", "postId": "TFDTKfemMnGbKp3YG", "htmlBody": "<p>I'm going to be posting the full equation on the website in the near future. It'll be easier to answer in-depth questions about the process after that has been posted. </p>\n<p>The evaluation process includes an assessment of the importance of each characteristic to the project at hand which determines the weightings. So, if our raters assess persuasion as being particularly important to the project at hand, the weighting of persuasion in the overall score will be greater. This allows our weightings to be adaptable to the details of the project at hand. We also weight the assessment of the importance of a variable to the project by the expertise of the evaluater.</p>\n<p>Right now, a good score in the evaluation process is necessary but not sufficient for a project to be funded. This is because I expect to significantly update the details of the evaluation process as we review our inaugural round of applicants. </p>\n", "parentCommentId": "uQCjbfK32pDyDcNXL", "user": {"username": "Kerry_Vaughan"}}, {"_id": "teuxt3FG5jKm8aZJk", "postedAt": "2015-02-27T21:40:25.719Z", "postId": "TFDTKfemMnGbKp3YG", "htmlBody": "<p>We have a list of these projects that we've been circulating to interested people privately. After we've had a chance to add any additional funders on the basis of this blog post, we'll add the list projects we think are interesting and the list of projects funders think are interesting to the website.</p>\n", "parentCommentId": "5tguggKWxcN26eckJ", "user": {"username": "Kerry_Vaughan"}}, {"_id": "MhnMm7649JhbpYzBj", "postedAt": "2015-02-27T21:44:28.695Z", "postId": "TFDTKfemMnGbKp3YG", "htmlBody": "<p>In both cases we expect project sourcing to be the primary benefit of the collaboration. We plan to pass interesting projects along to YC and FC and vice-versa.</p>\n", "parentCommentId": "HzGDrLbzmceyBdewG", "user": {"username": "Kerry_Vaughan"}}, {"_id": "7q7ddpzZ8tRWGkHWL", "postedAt": "2015-02-27T21:48:27.439Z", "postId": "TFDTKfemMnGbKp3YG", "htmlBody": "<p>I agree. </p>\n<p>In cases where a project is promising but not yet ready to receive funding, we can define the conditions under which we might fund the project. For example, if a project lacks the necessary technical talent, but is otherwise promising we might provide this feedback in the evaluation. I think this kind of conditional feedback might make it significantly easier for the project to acquire the necessary talent because it comes with a strong likelihood of funding associated with it.</p>\n<p>Over time we can also gain the necessary expertise to positively impact the plans of the entrepreneurs. In the way that 80K measures career plan changes, we might measure venture plan changes as an additional success metric.</p>\n", "parentCommentId": "w7B7FuXKDAq3k5vAh", "user": {"username": "Kerry_Vaughan"}}, {"_id": "3u8XNeeozwCysw2cm", "postedAt": "2015-02-27T22:34:03.857Z", "postId": "TFDTKfemMnGbKp3YG", "htmlBody": "<p>You need to specify how and when you're going to get the evidence. It's like if a doctor said &quot;Wait for evidence of diabetes&quot; and just left it at that. Instead, they specify whether they're going to a) do a test b) watch and wait, with scheduled follow-up c) do nothing. And that seems right for EA Ventures too. For startups, you can't really not reject them, not do a test and not follow-up. </p>\n", "parentCommentId": "7q7ddpzZ8tRWGkHWL", "user": {"username": "RyanCarey"}}, {"_id": "wCaP68k3YaXPYB7St", "postedAt": "2015-02-27T22:35:49.535Z", "postId": "TFDTKfemMnGbKp3YG", "htmlBody": "<p>I think you're selling yourself short by saying that EA Ventures is in a crowded area, and by saying that it does not deserve funding - to me, given the kinds of funds you could expect to move, it seems non-crazy to spend funds on EAV directly. And presumably this is already happening, with people like yourself and Tyler working for CEA while spending time on this project - something that should be supported and perhaps upscaled.</p>\n", "parentCommentId": null, "user": {"username": "RyanCarey"}}, {"_id": "8ec8khoo2MSXDvXDo", "postedAt": "2015-02-27T23:07:00.946Z", "postId": "TFDTKfemMnGbKp3YG", "htmlBody": "<p>I think there is an important (and contrary to your evaluation, not so crowded) opportunity here, and I'm glad EA Ventures is getting going.</p>\n<p>Here's something which confuses me about your model. Perhaps you can clarify.</p>\n<p>Your evaluation procedure seems to estimate how good projects are, and then reduce this to a binary fund / don't fund. How do you decide where this threshold is? For VC recommendations there's a natural threshold at things with expected returns better than market returns. Are you picking a baseline, so that you suggest funding precisely the things that you think are better uses of funds (in expectation) than common donation targets such as e.g. AMF? Or are you making a guess about the amount of funding you will attract, and choosing a threshold based on that? If the latter, wouldn't it be more helpful to just provide a ranked list?</p>\n", "parentCommentId": null, "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "SgT8DvS6C9bHgCC3b", "postedAt": "2015-02-27T23:10:08.431Z", "postId": "TFDTKfemMnGbKp3YG", "htmlBody": "<p>A related question:</p>\n<p>When you recommend funding a project, will you recommend a funding level? Presumably many projects will at many points have diminishing expected returns on extra funding. Will EA Ventures be aiming to make judgements about this curve in its recommendations?</p>\n", "parentCommentId": "8ec8khoo2MSXDvXDo", "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "3S64pkDjwtwPs8kxf", "postedAt": "2015-02-27T23:23:19.393Z", "postId": "TFDTKfemMnGbKp3YG", "htmlBody": "<p>I completely agree and this is basically our plan with respect to feedback for entrepreneurs.</p>\n", "parentCommentId": "3u8XNeeozwCysw2cm", "user": {"username": "Kerry_Vaughan"}}, {"_id": "vhRkqB9HT7bJ58CKa", "postedAt": "2015-02-27T23:26:21.707Z", "postId": "TFDTKfemMnGbKp3YG", "htmlBody": "<p>Our threshold for funding is set at GiveWell-recommended charities. Namely, if we don't think a project is plausibly better than e.g. AMF we plan to not recommend the project. </p>\n<p>This is because a pernicious failure mode for the project is that we move money away from good proven projects and towards bad, unproved projects. By only recommending projects that could (in expectation) be better than AMF, we can mitigate the pernicious failure mode.</p>\n<p>In terms of funding level, we ask how much money the projects need and what they plan to do with it in the application. We also plan to ask about this in the future. The goal is to ensure that the projects have room for more funding. We don't plan to recommend specific funding levels, but I can see us doing this if donors would find it valuable.</p>\n<p>Also, to clarify on the crowdedness of the project, I could see our uncrowdedness ranking improving as we learn more about the funding space. It's certainly plausible that the project will turn out to be uncrowded.</p>\n", "parentCommentId": "SgT8DvS6C9bHgCC3b", "user": {"username": "Kerry_Vaughan"}}, {"_id": "kmNfm2xossuaZrt4D", "postedAt": "2015-02-27T23:30:43.735Z", "postId": "TFDTKfemMnGbKp3YG", "htmlBody": "<p>Thanks for the vote of confidence :-)</p>\n<p>To be clear, I think it's entirely possible that it will make sense to ask for funds for EAV in the future. Right now, I think a) the evidence isn't strong enough and b) we can gain the evidence we need without spending donor money.</p>\n", "parentCommentId": "wCaP68k3YaXPYB7St", "user": {"username": "Kerry_Vaughan"}}, {"_id": "a8LLhj785QsckoF6Y", "postedAt": "2015-02-27T23:55:29.707Z", "postId": "TFDTKfemMnGbKp3YG", "htmlBody": "<p>Still, I wonder if funds could speed up EAV's growth and learning.</p>\n", "parentCommentId": "kmNfm2xossuaZrt4D", "user": {"username": "RyanCarey"}}, {"_id": "2ocTPB4S4r4M5FycA", "postedAt": "2015-02-28T00:00:43.264Z", "postId": "TFDTKfemMnGbKp3YG", "htmlBody": "<p>Does this mean that you wouldn't recommend funding another project at a similar stage to EA Ventures, with a similarly robust case? It seems to me that it would be appropriate to fund it a small amount, in a similar way that you are in effect funding EA Ventures a small amount (with your time) to learn more. Are you planning to avoid funding at that scale? </p>\n", "parentCommentId": "kmNfm2xossuaZrt4D", "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "337iigDDzu9YQv4Lc", "postedAt": "2015-02-28T00:12:37.747Z", "postId": "TFDTKfemMnGbKp3YG", "htmlBody": "<p>I imagine Ben would give robust criticism for this before or after it is posted. Presumably it's better for that to happen before?</p>\n<p>I'm picturing a simple linear model that is based on arbitrary weights. I've not read the literature here but if this can improve decision-making (like fitted models, which certainly can) then it would be an impressive fact.</p>\n", "parentCommentId": "Rd3fbDcK3gK9veEZZ", "user": {"username": "RyanCarey"}}, {"_id": "8GSs8cL8Hns5aaeX4", "postedAt": "2015-02-28T00:16:52.300Z", "postId": "TFDTKfemMnGbKp3YG", "htmlBody": "<p>Thanks. To be sure I'm reading that right: you mean projects that you think are better in expectation than AMF, or that you think someone might reasonably think is better in expectation than AMF? </p>\n<p>I expect that if most/all of your recommendations get funded, it would be useful to have recommendations for the amount of funding until they are in expectation worse than AMF at the margin. If not all your recommendations get funded, it would be useful to have extra ranking between them. It may be that donors are happy making these judgements, but just as you are likely to have comparative advantage identifying the projects, you'll probably also be well placed to identify funding requirements or trade-offs between your recommendations. </p>\n", "parentCommentId": "vhRkqB9HT7bJ58CKa", "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "teXgFvkyrEbRtYSKQ", "postedAt": "2015-02-28T00:20:42.305Z", "postId": "TFDTKfemMnGbKp3YG", "htmlBody": "<p>I'd love to be a part of the discussion of this equation. I was just going to wait patiently but am speaking up in case it's taken to email. :) </p>\n", "parentCommentId": "337iigDDzu9YQv4Lc", "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "zgv8WvXXRJvakJ7e6", "postedAt": "2015-02-28T00:25:12.680Z", "postId": "TFDTKfemMnGbKp3YG", "htmlBody": "<p>The book linked to in the evaluation process page on the website suggests that a linear model where the sign is determined and the weights are <em>random</em> beats expert judgment.</p>\n", "parentCommentId": "337iigDDzu9YQv4Lc", "user": {"username": "Kerry_Vaughan"}}, {"_id": "reRBX4M78reGzMTnK", "postedAt": "2015-02-28T00:26:08.631Z", "postId": "TFDTKfemMnGbKp3YG", "htmlBody": "<p>If it's taken to email I'll include you on the list :-)</p>\n", "parentCommentId": "teXgFvkyrEbRtYSKQ", "user": {"username": "Kerry_Vaughan"}}, {"_id": "6zHAZf92bDXMEk4g3", "postedAt": "2015-02-28T00:30:08.424Z", "postId": "TFDTKfemMnGbKp3YG", "htmlBody": "<p>Projects that the EAV team and expert evaluators think might be better in expectation than AMF. I used the other phrasing because we do two stages of evaluation. At the first, we discard projects that &quot;are not plausible better in expectation than AMF&quot; where that means that it is not plausible that further evidence will show the project to be more worth funding.</p>\n<p>We should talk on Skype about how to accurately model the crossover point between when a project is better than AMF and worse than AMF given certain amounts of funding. I agree that this would be valuable, but I don't yet know how to determine this.</p>\n", "parentCommentId": "8GSs8cL8Hns5aaeX4", "user": {"username": "Kerry_Vaughan"}}, {"_id": "qnLbGpRj6p3yoeX2B", "postedAt": "2015-02-28T00:31:32.719Z", "postId": "TFDTKfemMnGbKp3YG", "htmlBody": "<p>I agree. If it didn't seem that EA Ventures could gather the evidence it needed absent money then I would probably be in favor of a small amount of funding to launch the project and gather data. Since the members of the founding team have funding elsewhere this wasn't necessary and no further funding seemed necessary.</p>\n", "parentCommentId": "2ocTPB4S4r4M5FycA", "user": {"username": "Kerry_Vaughan"}}, {"_id": "o4EQHkejbhjfoExZg", "postedAt": "2015-02-28T00:32:55.556Z", "postId": "TFDTKfemMnGbKp3YG", "htmlBody": "<p>This may be the case if the number of applications we get exceeds our expectation and we need to pay people to help us evaluate them.</p>\n", "parentCommentId": "a8LLhj785QsckoF6Y", "user": {"username": "Kerry_Vaughan"}}, {"_id": "68WB2iw8xpoXYGMPC", "postedAt": "2015-02-28T00:33:33.045Z", "postId": "TFDTKfemMnGbKp3YG", "htmlBody": "<p>I can't get to the book. Is there any more information about the experiment?</p>\n", "parentCommentId": "zgv8WvXXRJvakJ7e6", "user": {"username": "RyanCarey"}}, {"_id": "wcfrLJiSuKgqrHhmY", "postedAt": "2015-02-28T00:39:00.958Z", "postId": "TFDTKfemMnGbKp3YG", "htmlBody": "<p>You can read it <a href=\"http://books.google.com/books?id=rcU1BsfrM2kC&amp;pg=PA73&amp;source=gbs_toc_r&amp;cad=4#v=onepage&amp;q&amp;f=false\">here</a>. The money pages are 63-64.</p>\n", "parentCommentId": "68WB2iw8xpoXYGMPC", "user": {"username": "Kerry_Vaughan"}}, {"_id": "vMgQEZYg7NnEh5Ary", "postedAt": "2015-02-28T00:44:08.395Z", "postId": "TFDTKfemMnGbKp3YG", "htmlBody": "<p>We use simple linear models all the time in investment; they are actually quite good. Best of all they are robust. Like Owen I would love to discuss this.</p>\n", "parentCommentId": "337iigDDzu9YQv4Lc", "user": {"username": "Larks"}}, {"_id": "KooiLzgBLppTchaDF", "postedAt": "2015-02-28T01:12:37.062Z", "postId": "TFDTKfemMnGbKp3YG", "htmlBody": "<p>Thanks. Looks like the original experiment is <a href=\"http://heatherlench.com/wp-content/uploads/2008/07/dawes2.pdf\">here</a>.</p>\n<p>Just looking at the abstract, it seems like the article is describing a situation where you have numerical inputs, which doesn't map perfectly to EA Ventures: &quot;This article presents evidence that even such improper linear models are superior to clinical intuition when predicting a numerical criterion from numerical predictors.&quot;</p>\n", "parentCommentId": "wcfrLJiSuKgqrHhmY", "user": {"username": "RyanCarey"}}, {"_id": "6XZgJE7FqtrXNudNo", "postedAt": "2015-02-28T02:59:48.539Z", "postId": "TFDTKfemMnGbKp3YG", "htmlBody": "<p>What does it mean for YC to pass &quot;interesting&quot; projects on to you? Like, you guys are a row in their database of funders that they give to their portfolio companies? They refer nonprofits to you if they don't think they're a good fit for YC? Something in-between?</p>\n", "parentCommentId": "MhnMm7649JhbpYzBj", "user": {"username": "Ben_Kuhn"}}, {"_id": "WB36xTBMe7GCcYieC", "postedAt": "2015-02-28T03:00:10.398Z", "postId": "TFDTKfemMnGbKp3YG", "htmlBody": "<p>Cool, I look forward to seeing it.</p>\n", "parentCommentId": "teuxt3FG5jKm8aZJk", "user": {"username": "Ben_Kuhn"}}, {"_id": "S2tn7bahDskB3DpXc", "postedAt": "2015-02-28T03:12:59.435Z", "postId": "TFDTKfemMnGbKp3YG", "htmlBody": "<p>I think it would be great to discuss it on the EA forum, both from the point of view of transparency, and because it's a much better medium for multi-threaded discussion. (But I understand if you'd rather keep it private if it's not very refined right now.)</p>\n", "parentCommentId": "reRBX4M78reGzMTnK", "user": {"username": "Ben_Kuhn"}}, {"_id": "YY3hzFsBFh4aCcjuM", "postedAt": "2015-02-28T08:05:29.063Z", "postId": "TFDTKfemMnGbKp3YG", "htmlBody": "<p>As someone who hasn't even yet completed an undergraduate degree, and hasn't been superb at networking opportunities, I'm not confident my network is great. Still, though, from getting involved in effective altruism and other intellectual circles, I've met an eclectic bunch of people. I'll suggest contacting EA Ventures, or submitting an application, to those running projects, and others I know. I intend to make suggestions at my own discretion of who I believe <em>might</em> be effective. I've read in full both the evaluation process EA Ventures will be using, and also it's own self-evaluation. So, I think I have a mental grasp on what heuristic criteria you're using, and I'll try thinking along those lines when pondering the potential of others I know. Honestly, I think I'll screen off most people in my network by the time I'm finished. Beyond that, I'm assuming EA Ventures will itself be able to determine whether someone I put in touch with it is a good fit for working with the organization in some capacity.</p>\n<p><strong><em>Questions</em></strong></p>\n<p>What would you qualify as expertise? And, what are your &quot;fields of interest?&quot;</p>\n<p>Are you interested in existing projects which could produce value for a flourishing world, and do a lot more of it if they received funding from EA Ventures?</p>\n<p>In finding entrepreneurs to work with, is EA Ventures looking for any particular qualities, interests, or aptitudes?</p>\n<p>Are there any geographical limitations for whom EA Ventures can fund at this point? </p>\n", "parentCommentId": null, "user": {"username": "Evan_Gaensbauer"}}, {"_id": "fa7vwGqq8Tzo2DDCJ", "postedAt": "2015-03-01T21:48:08.590Z", "postId": "TFDTKfemMnGbKp3YG", "htmlBody": "<blockquote>\n<p>What would you qualify as expertise? And, what are your &quot;fields of interest?&quot;</p>\n</blockquote>\n<p>I don't know how to qualify experience. I think I'll know it when I see it. Fields of interest are anything important, uncrowded and tractable. Areas that we find particularly promising are animal rights, far future/existential risk projects and global poverty.</p>\n<blockquote>\n<p>Are you interested in existing projects which could produce value for a flourishing world, and do a lot more of it if they received funding from EA Ventures?</p>\n</blockquote>\n<p>Yes, but we focus on new projects or projects with only a little bit of traction. Established projects have their own funding mechanisms and networks, so we don't have as much value to add there.</p>\n<blockquote>\n<p>In finding entrepreneurs to work with, is EA Ventures looking for any particular qualities, interests, or aptitudes?</p>\n</blockquote>\n<p>We're looking for people who have outstanding skills along the attributes we mention in our team composition model. I would guess that the EA community is most scarce on persuasion but that's just a guess.</p>\n<blockquote>\n<p>Are there any geographical limitations for whom EA Ventures can fund at this point?</p>\n</blockquote>\n<p>No as such. Some funders may only be able to fund certain projects for tax reasons, but I think our network is vast enough to transcendent nationality.</p>\n", "parentCommentId": "YY3hzFsBFh4aCcjuM", "user": {"username": "Kerry_Vaughan"}}, {"_id": "eDDFMfnjyavgsuirs", "postedAt": "2015-03-05T15:03:39.824Z", "postId": "TFDTKfemMnGbKp3YG", "htmlBody": "<p>This is a great initiative, and a helpful write - up. Thanks Kerry.</p>\n<p>So you want to find ventures that are expected to be better than the most effective charity (or thereabouts) in the world?</p>\n<p>I'm a bit worried that you will rule out many fantastically valuable ventures that may be discouraged or not stimulated from happening otherwise.</p>\n<p>If these ventures were to use only EA funds or mainly EA funds, then that would be right.</p>\n<p>However, if the ventures have a (lets say 10% chance) of growing out of the EA world and getting funding that wouldn't otherwise be attracted, and are only 1/5 as effective as AMF, but when they do they last for 40 years and wouldn't be done otherwise, then it could still be worth giving them?</p>\n<p>Further, the learning from the process might be worth something significant if its a necessary barrier to becoming an uber-effectiveness incubator?</p>\n<p>Obviously you want to take the highest expected value anyway so this might be an academic discussion.</p>\n", "parentCommentId": "6zHAZf92bDXMEk4g3", "user": {"username": "tomstocker"}}, {"_id": "QazGp9HuRYkwTjAcc", "postedAt": "2015-03-07T04:23:38.509Z", "postId": "TFDTKfemMnGbKp3YG", "htmlBody": "<p>For example, today I was trying to predict some property of companies. I came up with 5 signals I can easily calculate which all capture some information about the underlying property, turned them into 5 binary indicators, and just added them together for a composite signal. No attempt at producing weights, but for various reasons I'm pretty happy with this approach, and I'm confident my boss would endorse it too if we went into details.</p>\n", "parentCommentId": "vMgQEZYg7NnEh5Ary", "user": {"username": "Larks"}}, {"_id": "hCLEher2XZ2SwRxsM", "postedAt": "2015-03-07T10:31:02.428Z", "postId": "TFDTKfemMnGbKp3YG", "htmlBody": "<p>It looks like there's evidence for using them to predict continuous variables using continuous inputs, which might be your case. Also, if you're using it to supplement your personal decision-making, then on the face of it, that's more likely to work well than using it as a substitute.</p>\n<p><a href=\"http://effective-altruism.com/ea/fo/announcing_effective_altruism_ventures/2te\">http://effective-altruism.com/ea/fo/announcing_effective_altruism_ventures/2te</a></p>\n", "parentCommentId": "QazGp9HuRYkwTjAcc", "user": {"username": "RyanCarey"}}, {"_id": "S5wRCzZbDoMth9Byx", "postedAt": "2015-03-11T13:09:47.108Z", "postId": "TFDTKfemMnGbKp3YG", "htmlBody": "<p>Haha, had a look at the people behind this - forget what I said - I'm sure that between all the funders/backers you've got more than enough learning to identify projects that are better than AMF. Good luck!</p>\n", "parentCommentId": "eDDFMfnjyavgsuirs", "user": {"username": "tomstocker"}}, {"_id": "KM6jp6kWKuMrtRTBS", "postedAt": "2020-06-23T10:30:12.153Z", "postId": "TFDTKfemMnGbKp3YG", "htmlBody": "<p>Possibly unimportant, but what happened to EA Ventures? I stumbled across this because a <a href=\"https://arxiv.org/ftp/arxiv/papers/1712/1712.04020.pdf\">paper</a> by Roman V. Yampolskiy\r notes: &quot;The author is grateful to Elon Musk and the Future of Life Institute and to Jaan Tallinn and Effective Altruism Ventures for partially funding his work on AI Safety.&quot; The  EA Ventures site now just redirects to CEA. There&apos;s also a subsequent thread about &quot;<a href=\"https://forum.effectivealtruism.org/posts/eQpAPSbfejeud8fkj/ea-ventures-request-for-projects-update\">EA Ventures Request for Projects + Update</a>.&quot; Did it cease to exist after that? Why?</p>", "parentCommentId": null, "user": {"username": "Jamie_Harris"}}, {"_id": "AK7oDpD9S3zJE2AZt", "postedAt": "2020-06-23T13:05:14.552Z", "postId": "TFDTKfemMnGbKp3YG", "htmlBody": "<p>Some info here: <a href=\"https://youtu.be/Y4YrmltF2I0?t=157\">https://youtu.be/Y4YrmltF2I0?t=157</a></p>", "parentCommentId": "KM6jp6kWKuMrtRTBS", "user": {"username": "Jonas Vollmer"}}, {"_id": "gtHRtzgJvLDrY35XL", "postedAt": "2020-06-24T15:07:42.008Z", "postId": "TFDTKfemMnGbKp3YG", "htmlBody": "<p>Thanks! &quot;Celebrating Failed Projects&quot; also nicely characterises my motivation for actually making this comment, rather than letting it slide.</p>", "parentCommentId": "AK7oDpD9S3zJE2AZt", "user": {"username": "Jamie_Harris"}}, {"_id": "HycNbhftfoSTv4r9m", "postedAt": "2020-07-06T16:38:24.387Z", "postId": "TFDTKfemMnGbKp3YG", "htmlBody": "<p>I&#x2019;m glad someone is asking what happened with EA Ventures (EAV): it&#x2019;s an important question that hasn&#x2019;t yet received a satisfactory answer.</p><p>When EAV was discontinued, numerous people asked for a post-mortem of some type (e.g. <a href=\"http://effective-altruism.com/ea/1b5/announcing_effective_altruism_grants/b70\">here</a>, <a href=\"http://effective-altruism.com/ea/18p/concrete_project_lists/akv\">here</a>, and <a href=\"http://effective-altruism.com/ea/zn/some_organisational_changes_at_the_centre_for/7v7\">here</a>) to help capture learning opportunities. But nothing formal was ever published. The &#x201C;<a href=\"https://www.youtube.com/watch?v=Y4YrmltF2I0\">Celebrating Failed Projects</a>&#x201D; panel eventually shared a few lessons, but someone would need to watch an almost hour-long video (much of which does not relate to EAV) to see them all. And the lessons seem trivial (&#x201C;if you&#x2019;re doing a project which gives money to people, you need to have that money in your bank account first&#x201D;) about as often as they seem insightful (&#x201C;Finding excellent entrepreneurs is much, much harder than I thought it was going to be&#x201D;). </p><p>If a proper post-mortem with community input had been conducted, I&#x2019;m confident many other lessons would emerge*, including one prominent one: &#x201C;Don&#x2019;t over-promise and under-deliver.&#x201D; This has obvious relevance to a grantmaking project that launched before it had lined up funds to grant (as far as I know EAV only made two grants- the <a href=\"https://forum.effectivealtruism.org/posts/TFDTKfemMnGbKp3YG/announcing-effective-altruism-ventures?commentId=KM6jp6kWKuMrtRTBS\">one Jamie mentioned</a> and a <a href=\"https://forum.effectivealtruism.org/posts/eQpAPSbfejeud8fkj/ea-ventures-request-for-projects-update\">$19k grant to EA Policy Analytics</a>). But it also relates to more mundane aspects of EAV: my understanding is that applicants were routinely given overly optimistic expectations about how quickly the process would move.</p><p>The missed opportunity to learn these lessons went on to impact other projects. As just one example, EA Grants was <a href=\"https://www.youtube.com/watch?v=Y4YrmltF2I0\">described</a> as &#x201C;the spiritual successor to EA Ventures&#x201D;. And it did reflect the narrow lesson from that project, as it lined up money before soliciting grant applications. However, the big lesson wasn&#x2019;t learned and EA Grants consistently overpromised and under-delivered throughout its entire history. EA Grants <a href=\"https://forum.effectivealtruism.org/posts/BwzKCiw3rn6tx3Lrw/update-on-cea-s-ea-grants-program?commentId=LjANvwJSrgfZ8YrCw\">announced plans to distribute millions of dollars more money than it actually granted, repeatedly announced unrealistic and unmet plans to accept open applications</a>, <a href=\"https://forum.effectivealtruism.org/posts/org8QYG3gqgDK7St6/effective-altruism-grants-project-update#We_can_t_fund_educational_expenses_\">explicitly described educational grants as eligible when they were not</a>, <a href=\"https://forum.effectivealtruism.org/posts/3fdmHnLiQ3bm3J6Mc/which-community-building-projects-get-funded#Grant_outcomes1\">granted money to a very narrow set of projects</a>, and (despite its public portrayal as a project capable of distributing millions of dollars annually) <a href=\"https://www.centreforeffectivealtruism.org/our-mistakes/#ea-grants-2017-2019\">did not maintain</a> an &#x201C;appropriate operational infrastructure and processes [resulting] in some grant payments taking longer than expected [which in some cases] contributed to difficult financial or career situations for recipients.&#x201D; </p><p>EAV and EA Grants have both been shuttered, and there&#x2019;s a new management team in place at CEA. So if I had a sense that the new management had internalized the lessons from these projects, I wouldn&#x2019;t bring any of this up. But CEA&#x2019;s recently updated &#x201C;<a href=\"https://www.centreforeffectivealtruism.org/our-mistakes/\">Mistakes</a>&#x201D; page doesn&#x2019;t mention over-promising/under-delivering, which makes me worry that&#x2019;s not the case. That&#x2019;s especially troubling because the community has repeatedly highlighted this issue: when CEA <a href=\"https://forum.effectivealtruism.org/posts/wL6nzXsHQEAZ2WJcR/summary-of-core-feedback-collected-by-cea-in-spring-summer#Things_Which_Could_Be_Improved\">synthesized community feedback</a> it had received, the top problem reported was &#x201C;respondents mentioned several times that CEA &#x2018;overpromised and under delivered&#x2019;&#x201D;. The <a href=\"https://forum.effectivealtruism.org/posts/wL6nzXsHQEAZ2WJcR/summary-of-core-feedback-collected-by-cea-in-spring-summer?commentId=hBLLQE9RRHBQnrPLd\">most upvoted comment</a> on that post? It was Peter Hurford describing that specific dynamic as &#x201C;my key frustration with CEA over the past many years.&#x201D;</p><p>To be fair, the &#x201C;Mistakes&#x201D; page discusses problems that are <em>related</em> to over-promising/under-delivering, such as acknowledging that &#x201C;running too many projects from 2016-present&#x201D; has been an &#x201C;underlying problem.&#x201D; But it&#x2019;s possible to run too many projects without overpromising, and it&#x2019;s possible to be narrowly focused on one or a few projects while still overpromising and under-delivering. &#x201C;Running too many projects&#x201D; explains why EA Grants had little or no dedicated staff in early 2018; it doesn&#x2019;t explain why CEA <a href=\"https://forum.effectivealtruism.org/posts/BwzKCiw3rn6tx3Lrw/update-on-cea-s-ea-grants-program?commentId=LjANvwJSrgfZ8YrCw\">repeatedly committed</a> to scaling the project during that period despite not having the staff in place to execute. I agree CEA has had a problem of running too many projects, but I see the consistent over-promising/under-delivering dynamic as far more problematic. I hope that CEA will increasingly recognize and incorporate this recurring feedback from the EA community. And I hope that going forward, CEA will prioritize thorough post-mortems (that include stakeholder input) on completed projects, so that the entire community can learn as much as possible from them. </p><p>* Simple example: with the benefit of hindsight, it seems likely that EAV significantly overinvested in developing a complex evaluation model before the project launched, and that EAV&#x2019;s staff may have had an inflated sense of their own expertise. From the <a href=\"https://forum.effectivealtruism.org/posts/TFDTKfemMnGbKp3YG/announcing-effective-altruism-ventures?commentId=uQCjbfK32pDyDcNXL\">EAV website at its launch</a>:</p><blockquote>&#x201C;We merge expert judgment with statistical models of project success. We used our expertise and the expertise of our advisers to determine a set of variables that is likely to be positively correlated with project success. We then utilize a multi-criteria decision analysis framework which provides context-sensitive weightings to several predictive variables. Our framework adjusts the weighting of variables to fit the context of the projects and adjusts the importance of feedback from different evaluators to fit their expertise.&#x201D;</blockquote>", "parentCommentId": "KM6jp6kWKuMrtRTBS", "user": {"username": "AnonymousEAForumAccount"}}]