[{"_id": "jh2CtiwwzGGhKCGgv", "postedAt": "2024-02-12T12:52:15.963Z", "postId": "Tfu7qFxuZaP8uM4ef", "htmlBody": "<p><strong>Executive summary</strong>: Older Republican voters' anti-immigration stance conflicts with economic theories predicting self-interested voting, since they tend to benefit from immigration. This \"rational irrationality\" stems from the tiny impact an individual vote has on election outcomes.</p><p><strong>Key points</strong>:</p><ol><li>Older Republicans vote against immigration despite personal economic gains from immigrants, contradicting self-interested voting theories.</li><li>Their individual votes have negligible impact on election outcomes and policies, so self-interest is outweighed by emotional rewards.</li><li>Voters indulge biases despite ignorance of harms since individual votes rarely directly affect personal well-being.</li><li>Anti-immigration stance persists as a collective action problem - as a group they influence policy, but as individuals they defect.</li><li>Voter turnout and irrationally biased choices stem from non-policy factors like civic duty, cheerleading, and xenophobia.</li><li>Rational ignorance disincentivizes voters from researching platform differences that barely influence personal outcomes.</li></ol><p>&nbsp;</p><p>&nbsp;</p><p><i>This comment was auto-generated by the EA Forum Team. Feel free to point out issues with this summary by replying to the comment, and</i><a href=\"https://forum.effectivealtruism.org/contact\"><i>&nbsp;<u>contact us</u></i></a><i> if you have feedback.</i></p>", "parentCommentId": null, "user": {"username": "SummaryBot"}}, {"_id": "tsnG3hcjbM93ZLJPL", "postedAt": "2024-02-12T18:01:44.376Z", "postId": "Tfu7qFxuZaP8uM4ef", "htmlBody": "<p>You've made some interesting points here, but I don't think you ever discussed the possibility that someone is actually voting altruistically, for the benefit of some group or cause they care about (either helping people in their local area, people in the rest of the country, everyone in the world, future generations, etc).</p><p>Is it really true that most voters' behavior can be explained by either (i) self-interest, or (ii) an 'emotionally rewarding cheer for their team'..? I find that a depressing thought. Is no one sincerely trying to do the right thing?<br><br>If you <i>are</i> voting altruistically, then the number of people affected by the outcome of an election is big enough to start outweighing the tiny chance that your vote will change the result, in expected value terms.</p>", "parentCommentId": null, "user": {"username": "tobycrisford"}}]