[{"_id": "b4q2oj6HdehxBzzqv", "postedAt": "2014-09-12T09:04:43.782Z", "postId": "TgdXtRvnQH85mswZQ", "htmlBody": "<blockquote>\n<p>But hold on: how did they turn a large number of responses where people said one disability was more or less healthy than another into weightings on a 0-1 scale where 0 is full health and 1 is death? It turns out that a quarter (n=4000) of the people who took the survey on the internet were also asked the &quot;person tradeoff&quot; style questions used in the 1990 version, which they called &quot;population health equivalence questions&quot;. So they first determined an ordering from most to least healthy using their large quantity of comparison data, and then used the tradeoff data to map this ordering onto the &quot;0=healthy 1=death&quot; line.</p>\n</blockquote>\n<p>My understanding is that the large set of comparison data was used to construct a cardinal ordering (via some statistical technique based on the idea that if A is very often preferred to B then B must be substantially worse). The extra data from the population health equivalence questions was purely to work out how to scale this with respect to the 0=full health, 1=death.</p>\n", "parentCommentId": null, "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "EgKpaN8ijKijoKuHg", "postedAt": "2014-09-12T10:42:52.532Z", "postId": "TgdXtRvnQH85mswZQ", "htmlBody": "<blockquote>\n<p>the large set of comparison data was used to construct a cardinal ordering</p>\n</blockquote>\n<p>I really should know this, but is a cardinal ordering one where you can say &quot;A is twice as bad as B&quot; or not?  My understanding of their process is they used their stats to put everything in order from least-harmful to most-harmful, but this didn't get them more than just an ordering.  The equivalence questions added not only the information necessary to put this on the 0-1 scale, but also what was needed to say &quot;A costs 3x less than B to treat, but we should still treat B because it's 5x worse&quot;.  An ordering by itself doesn't get us very far.</p>\n", "parentCommentId": "b4q2oj6HdehxBzzqv", "user": {"username": "Jeff_Kaufman"}}, {"_id": "bPJqRmZKtHXxWS3PB", "postedAt": "2014-09-12T11:26:20.714Z", "postId": "TgdXtRvnQH85mswZQ", "htmlBody": "<p>A cardinal ordering, strictly speaking, is one where you can say &quot;the difference between A and B is twice as large as the difference between A and C&quot;. I'd assumed that if you had &quot;perfect health&quot; on your scale, you could use distance from this to express &quot;twice as bad as&quot;.</p>\n<p>From section 2A of the appendix you linked to:</p>\n<blockquote>\n<p>The implication of this is that the probit regression yields estimates of values for each health state that capture the relative differences in health levels between states, consistent with the paired comparison responses, but that these health-state values are on an arbitrary scale rather than on a unique disability weight scale that ranges between 0 and 1. </p>\n</blockquote>\n<p>However from looking at the rest of section 2 it seems that they didn't (as I had thought) just take this cardinal scale at face value, using the population health equivalence questions to anchor the endpoints. Rather they made some assumptions about the shape of transformation required, and then used the extra data to fill in some of the parameter choices. So &quot;twice as far from perfect health&quot; doesn't necessarily translate to &quot;twice as bad&quot; -- but it does translate to a precise statement about how much worse.</p>\n", "parentCommentId": "EgKpaN8ijKijoKuHg", "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "znBmpPZnqydEvtMXv", "postedAt": "2014-09-12T11:30:05.735Z", "postId": "TgdXtRvnQH85mswZQ", "htmlBody": "<p>Yes, I thought this too. Something like ELO scores used to generate cardinal rankings for chess players from the ordinal data of their previous match results.</p>\n", "parentCommentId": "b4q2oj6HdehxBzzqv", "user": {"username": "Toby_Ord"}}, {"_id": "QF4L2JRmJ4dvsBoh2", "postedAt": "2014-09-12T11:46:48.406Z", "postId": "TgdXtRvnQH85mswZQ", "htmlBody": "<p>Thanks for this great summary Jeff!</p>\n<p>Here are a couple of comments:</p>\n<p>1) I happen to know quite a bit about the rationale behind the GBD 2010 method as I was involved near the end of the process. It is designed to avoid talking about evaluative questions of the quality or value of life and to only talk about the descriptive question of the level of health -- something that doctors are meant to plausibly have more expertise on. This change avoids certain critiques of the method, but I and many other philosophers and economists think that it is quite a bit worse overall and possibly incoherent. At least for effective altruism, we only care about health states in terms of answering normative questions of which option to choose and here we care about the evaluative measures of quality. Notably these come apart from the descriptive ones in cases like intellectual disability and infertility. People don't rate people with these conditions as much less healthy, but they do agree that their lives are made quite a bit worse. When things come apart like this, it is the badness in their lives that should matter. I was more sanguine about this before I read your article as I'd heard there was at least a strong correlation between these new numbers and the old ones, but your quantitative correlation chart shows that it is not that strong. I'd thus use one of the earlier approaches, or one of the many QALY type approaches that have been done in parallel with these DALY ones.</p>\n<p>2) Regarding scepticism about the weightings, it is not like there is any other sensible option but to use them (well, one version or another of them). Using one's own intuition about how bad two health states are is obviously worse than at least one of the current aggregate measures, as is considering all ill-health to be equally bad. Rejecting these aggregate health quality weights means using some other form of health quality weight which will be worse. It is OK to think that these quality weight numbers introduce another level of noise into cost-effectiveness -- they do! -- and we don't have any better options but to use them. Also, the noise introduced is not all that much compared to the signal (I'd say it introduces less than a factor of 2, when the data shows many things separated by factors of 100 or more), so the results can still be used for many purposes.</p>\n", "parentCommentId": null, "user": {"username": "Toby_Ord"}}, {"_id": "rk8cZjNWsxAZjsiZb", "postedAt": "2014-09-12T11:54:31.719Z", "postId": "TgdXtRvnQH85mswZQ", "htmlBody": "<p>If you can turn a bunch of &quot;A is worse than B&quot; statements into a cardinal ordering, then why do you need the population equivalence questions at all?  Why not just include &quot;perfect health&quot; and &quot;death&quot; among your disabilities?  Then we can eventually say &quot;the difference between perfect health and A is X% of the difference between perfect health and death.&quot;</p>\n<p>I guess part of my confusion is I don't really see how you can get this cardinal ordering from the data.  So let's say we find that condition A is universally considered worse than all other conditions.  Perhaps it's &quot;death&quot;, perhaps it's just clearly the worst of the conditions we're looking at.  How can statistics give us a ratio by which it's worse?  If somehow it were twice as bad we would still see it be considered as &quot;worst&quot; in all it's comparisons.</p>\n", "parentCommentId": "bPJqRmZKtHXxWS3PB", "user": {"username": "Jeff_Kaufman"}}, {"_id": "m9HfcaybaHsutFzYj", "postedAt": "2014-09-12T12:25:24.830Z", "postId": "TgdXtRvnQH85mswZQ", "htmlBody": "<p>You are correct. You can't <em>really</em> turn the ordinal stuff into a cardinal ordering, just into a kind of proxy ordering that has some cardinal structure, but it might not correspond to the cardinal structure we care about. For example if 'perfect health' was added and 100% of people ranked this above the other choice, then it would end up very far (possibly infinitely far) from the nearest option on the cardinal scale. What it is really measuring is the amount of disagreement about things at this part of the ordering, which is a proxy for closeness of the health levels, but there are cases like 'perfect health' vs slightly worse than that where they are close but there is no disagreement.</p>\n", "parentCommentId": "rk8cZjNWsxAZjsiZb", "user": {"username": "Toby_Ord"}}, {"_id": "jDGx4AiM5m8P6aKw2", "postedAt": "2014-09-12T15:03:21.000Z", "postId": "TgdXtRvnQH85mswZQ", "htmlBody": "<p>Really interesting post!</p>\n<p>Regarding the non-correlation between the different methodologies: isn't it the case that the two methods are not even trying to measure different things. There was a bit of talk of this at the Good Done Right conference, where it seemed like the consensus was that e.g. person tradeoffs try to measure something like the wellbeing associated with health-states, while the newer method simply measures a more removed concept of healthiness. These two may come apart especially in cases of really unhealthy states that do not change your wellbeing significantly such as becoming paraplegic. </p>\n", "parentCommentId": null, "user": {"username": "MarkusAnderljung"}}, {"_id": "TzedXmfu4rJv3qZXY", "postedAt": "2014-09-12T15:51:04.722Z", "postId": "TgdXtRvnQH85mswZQ", "htmlBody": "<p>Elo scores are based on trying to model the probability the A will beat B.  They assume every player has some ability, their performance in a game is normally distributed, the player with the higher performance in that game will win, and all players have the same standard deviation.  So each player can be represented by a single number, the mean of their normal distribution.  If we see A beat B 75% of the time and A beat C 95% of the time, then we could construct normal distributions that would lead to this outcome and predict what fraction of the time B would beat C.</p>\n<p>Trying to apply this to disease weightings is modeling there as being some underlying true badness of a disease that each person has noisy access to.  This means that if A and B are close in badness we will sometimes see people rank A worse and other times rank B worse, while if A and B are far apart we won't see this overlap.  The key idea is that the closer together A and B are in badness, the less consistent people's judgements of them will be.  But look at this case:</p>\n<ul>\n<li>Condition A is having moderate back pain, and otherwise perfect health.</li>\n<li>Condition B is having moderate back pain, one toe amputated, and otherwise perfect health.</li>\n</ul>\n<p>Almost everyone is going to say B is worse than A, and the people who rank A worse probably misunderstood the question.  But this doesn't mean B is much worse than A; it just means it's an easy comparison for people to make, x vs x+y instead of x vs z.</p>\n<p>Do we just assume this is rare with disability comparisons?  That consistency is only common when things are far apart?  Is there a way to test this?</p>\n", "parentCommentId": "znBmpPZnqydEvtMXv", "user": {"username": "Jeff_Kaufman"}}, {"_id": "qCi7q9CTwtopf6jum", "postedAt": "2014-09-12T17:03:23.117Z", "postId": "TgdXtRvnQH85mswZQ", "htmlBody": "<p>I agree that this is not terribly well-founded.</p>\n<p>I asked one of the architects behind the method about this issue. The answer boiled down to an agreement that this could cause problems in principle, but that in practice the overall badness of a condition was based on many comparisons, some of which might be easy but some of which will be hard, so it comes out okay on average.</p>\n", "parentCommentId": "TzedXmfu4rJv3qZXY", "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "sEpaM7D3nL9ada5au", "postedAt": "2014-09-12T17:05:06.335Z", "postId": "TgdXtRvnQH85mswZQ", "htmlBody": "<blockquote>\n<p>I'd thus use one of the earlier approaches, or one of the many QALY type approaches that have been done in parallel with these DALY ones.</p>\n</blockquote>\n<p>I agree with this and think it's important enough to highlight.</p>\n", "parentCommentId": "QF4L2JRmJ4dvsBoh2", "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "79d3BfZvDirHA9goC", "postedAt": "2014-09-12T18:32:08.415Z", "postId": "TgdXtRvnQH85mswZQ", "htmlBody": "<p>I'm extremely pleased to see mental illness and addiction considered.</p>\n", "parentCommentId": null, "user": {"username": "MasonHartman"}}, {"_id": "ZmeytLYbC46ZNtr7n", "postedAt": "2014-09-13T04:05:02.883Z", "postId": "TgdXtRvnQH85mswZQ", "htmlBody": "<p>I think it's possible to accomplish the desired goals.  To do so, we'd need to include information about co-morbidity, secondary conditions, related life problems and general life problems in the data.  Here, I explain why including all of this data can help serve goals better.</p>\n<p><strong>Consider Including Co-morbidity, Secondary Conditions and Related Life Problems:</strong></p>\n<p>  Co-morbidity:  It's not uncommon for people with a serious illness to have one or more additional illnesses.  People can even get two disabling conditions at once.  For an example of a disabling disease that tends to co-occur with other diseases: depression, one of the most deadly and disabling diseases for the younger age range, tends to co-occur with anxiety.</p>\n<p>  Related Life Problems: One serious problem can cause a snowball effect of other problems.  In the case of disability, you're likely to experience joblessness, poverty and social issues (like exhausting your social safety net, being treated differently, being seen as unattractive by a partner or potential partners).  These can result in worsening the original problem by reducing the finances and social support available.  </p>\n<p>  Secondary Conditions: Being disabled, poor, and having social issues, one might find that they also develop depression and/or anxiety.  A stressful life may result in additional health risks on top of that, accelerating the pace at which one's health breaks down as they age.  </p>\n<p>  Why include additional problems?</p>\n<ul>\n<li><p>Some people would not be disabled if they had only one condition, but ended up disabled because they have three or four conditions.  These people might be low-hanging apples (easier to get above the disability line) but they could be missed if you don't design a method that's intended to capture their data.</p>\n</li>\n<li><p>If you want to have data that tells you how bad each person's situation is, we can't use a method that assumes the person has only one serious problem.  We need this information for that purpose.  We cannot assume that most people in a bad situation have only one disadvantage.  Some of them have five or ten.</p>\n</li>\n<li><p>If what you want was an idea of how disabilities impact people, using a method that assumes only one disability won't give you an accurate picture of the reality of disability.</p>\n</li>\n<li><p>When people have multiple problems, they may answer questions like the trade-off questions differently.  Miserable people may have a difficult time figuring out exactly which of their three problems caused the misery they're experiencing and may attribute some misery to a specific disability when it is actually coming from somewhere else.  </p>\n</li>\n</ul>\n<p><strong>Idea: Give them a survey of life problems in general.</strong></p>\n<p>  I think one of the main reasons altruistic programs designed to help disadvantaged people aren't more successful is because they don't account for the fact that a lot of people who are disadvantaged deal with multiple disadvantages at once.  A situation of multiple disadvantages can result in a very tangled web of problems that isn't solved with just one form of assistance.  Sometimes one form of assistance might fix a person's whole life because all of their problems were caused by the one disadvantage.  Sometimes, things are so brutally tangled that you'd really need to tackle three or four things to get the person out and start seeing real results in terms of happiness and productivity increases.</p>\n<p>  Why I suggest this survey:</p>\n<ul>\n<li><p>You can look for patterns in this data and create theories like &quot;Such and such disability usually causes poverty, the combination of poverty and disability usually causes depression.&quot; and, after investigating this to test your ideas, realize that there are certain things you could target that could solve multiple problems at once.  This data could turn up super effective ways of helping. </p>\n</li>\n<li><p>This data could allow you to get closer to showing your true effectiveness.  This is because it's a starting point for quantifying the benefits of solving other problems that were caused by the disability you were treating.</p>\n</li>\n<li><p>You'd have additional information that will help you work out which people's situations have the most room for improvement.  There may be patterns correlated with certain diseases where some diseases tend to cause five additional problems while others cause only one.  If your terminal goal is to improve people's lives as much as possible, you'd of course want to consider targeting these.</p>\n</li>\n<li><p>You'd be able to start looking for multiplier effects between specific problems where one problem causes the other problem to be more difficult to solve.  Then we might be able to detect those &quot;tangled webs&quot; that are tough to solve with only one form of assistance.  Knowing about some of the &quot;tangled webs&quot; might provide a sort of low-hanging apple to increase effectiveness.  For example, say that someone has both a disability and depression.  The treatment for the disability takes time and energy.  Maybe the person doesn't have enough time and energy to do their part of the treatment because they're depressed.  Ensuring that they have an effective depression treatment first could boost effectiveness of the program to treat the disability.  </p>\n</li>\n<li><p>Those lucky enough to have an opportunity to help others sometimes haven't been through anything remotely similar to what the most disadvantaged 10% of the population experiences.  Therefore, they may not have a very good idea of what that's actually like and how life for those people actually works.  If altruists had a chart showing the distribution of problems across the population, they'd have a clearer picture of the world they're working with and the problems they're trying to solve.  If they had notions about &quot;tangled webs&quot; and specific ideas about common webs, and how the most common webs work, they'd be getting closer to an accurate map of the problems they're trying to solve.  This information will help altruists avoid a &quot;let them eat cake&quot; situation where they're creating programs that are ineffective because they're assuming the person has other resources available (like a social safety net, adequate funds for treatment supplies, a suitable home in which to do treatments, sufficient energy, etc.) when they actually don't.</p>\n<p>Note: There are probably difficulties involved with providing multiple forms of assistance at once which one would need to be aware of before beginning.  For instance, some disadvantaged people may not have enough time and energy to solve multiple life problems at one time, so some of those additional forms of assistance may need to be geared for people who are taking on a difficult recovery process already.  Some people with disabilities will find some programs difficult to stick to.  There's a question of &quot;Which form of assistance should be done first?&quot;  By this I mean that you might need to recommend whichever one is more feasible for the person to accomplish given their current time and energy resources, or whichever one will make other forms of assistance easier for them to handle.</p>\n</li>\n</ul>\n<p><strong>A New Quantification System:</strong></p>\n<p>  If we do enough research to discover which additional problems are caused by disabilities, we can use this as a way of quantifying the level of difficulty the disability causes.  Using this, we could create a more objective survey to quantify disabilities that asks them about whether they have certain life problems, secondary conditions, etc.  Many of those problems and conditions can be quantified in some way that is far less subjective than &quot;Would you take a 20% risk of death?&quot;.  Poverty can be quantified as a number of dollars, time poverty as a number of hours, social support as a number of people willing to help (at how many hours per week), and secondary conditions can often be quantified in fairly objective terms as well.  By tracking as many problems caused by the disability as possible, I think we can get reasonably close to a clear picture of how bad a disability is.</p>\n<p>It seems to me that this might make a good article.  I don't have sufficient karma to post it.  What do you think, readers?</p>\n", "parentCommentId": null, "user": {"username": "Kathy"}}, {"_id": "taZetyFJhE6ToQC9t", "postedAt": "2014-09-13T05:31:20.054Z", "postId": "TgdXtRvnQH85mswZQ", "htmlBody": "<p>This proposal seems similar to Bhutan's use of Gross National Happiness. I agree that it's good for governments to use statistical analysis to figure out what is making their citizens (or ideally, the world's citizens, of course!) better off. Governments already have data on how many citizens are using the disability support pension and have lots of lifestyle data from the census. Anyway, the proposal sounds interesting. Feel free to send me a Google doc with this kind of article to recieve detailed feedback so that we can aim to post it over the coming weeks.</p>\n", "parentCommentId": "ZmeytLYbC46ZNtr7n", "user": {"username": "RyanCarey"}}, {"_id": "xMtB7zkxQK2mdMv5Y", "postedAt": "2014-09-13T08:51:29.113Z", "postId": "TgdXtRvnQH85mswZQ", "htmlBody": "<p>&quot;it just means it's an easy comparison for people to make&quot; </p>\n<p>Yes, I completely agree and would have spelled it out just like you did in my comment further down if I'd had the time.</p>\n", "parentCommentId": "TzedXmfu4rJv3qZXY", "user": {"username": "Toby_Ord"}}, {"_id": "GwFTx3Ks35H2YX9Ec", "postedAt": "2014-09-14T02:32:56.987Z", "postId": "TgdXtRvnQH85mswZQ", "htmlBody": "<p>Wow.  When I first came across the Gross National Happiness Index concept, I thought it was a bit fluffy.  I had no idea that it was anything more than a simple survey.  Now that I have checked out &quot;A Short Guide to Gross National Happiness Index&quot; [1], I see that there's something to learn about here.</p>\n<p>Now, I desperately want to get my hands on the raw GNHI data.  I can code.  Read: I am able to quickly process the data to answer our questions about it.  Do we have any connections through which this data can be obtained?  I can try emailing them if not, but email addresses on contact pages can be hit or miss.</p>\n<ol>\n<li><a href=\"http://www.grossnationalhappiness.com/wp-content/uploads/2012/04/Short-GNH-Index-edited.pdf\">http://www.grossnationalhappiness.com/wp-content/uploads/2012/04/Short-GNH-Index-edited.pdf</a></li>\n</ol>\n", "parentCommentId": "taZetyFJhE6ToQC9t", "user": {"username": "Kathy"}}, {"_id": "domJPwmNeF4ekRngw", "postedAt": "2014-09-19T01:28:54.624Z", "postId": "TgdXtRvnQH85mswZQ", "htmlBody": "<blockquote>\n<p>0.011     Infertility: primary</p>\n</blockquote>\n<p>I notice I am confused. My mental model of the average person would definitely choose a 99% chance of life over a 100% chance of life with infertility. </p>\n", "parentCommentId": null, "user": {"username": "Dale"}}, {"_id": "gA6LxLbMhXqfSgnyR", "postedAt": "2014-09-19T04:36:56.772Z", "postId": "TgdXtRvnQH85mswZQ", "htmlBody": "<p>True, that is confusing. One potential explanation is that they're probably talking about infertility for one year, rather than permanent infertility. </p>\n<p>Whether or not this is the true reason why infertility has such a low disability ranking, this uncovers an interesting point - the basic DALY model assumes that the burden of having a disability in year 1 is independent of whether you also have that disability in year 2, which is clearly not true for infertility. One person having lifelong infertility is much more than 50 people having infertility for one year - the latter may actually benefit them!</p>\n", "parentCommentId": "domJPwmNeF4ekRngw", "user": {"username": "RyanCarey"}}, {"_id": "zTmBEort9Xmuc5BQ2", "postedAt": "2014-09-19T10:09:58.424Z", "postId": "TgdXtRvnQH85mswZQ", "htmlBody": "<p>This is for the reason I outlined in another comment. This revised ranking uses people's judgments of which state is more 'healthy', rather than how <em>good</em> they are. People don't think that being infertile makes people much less 'healthy' even though they think it is bad. The same goes for reductions in intelligence such as via lead poisoning.</p>\n", "parentCommentId": "domJPwmNeF4ekRngw", "user": {"username": "Toby_Ord"}}, {"_id": "J5r2CtjnwKSK6dh76", "postedAt": "2014-09-19T13:28:55.377Z", "postId": "TgdXtRvnQH85mswZQ", "htmlBody": "<p>First, the claim is that infertility is 98.9% as healthy as full health; this part isn't much based on tradeoffs.  Which is frustrating, since tradeoffs are more useful for the kind of questions we care about.</p>\n<p>But even then, I'm not sure most infertile people would take a 1% chance of death to restore their fertility.  Another way of putting it: if the maternal death rate in the US jumped from 28/100,000 to 1,000/100,000 (a level only Sierra Leone hits) how many people would decide not to have kids?</p>\n", "parentCommentId": "domJPwmNeF4ekRngw", "user": {"username": "Jeff_Kaufman"}}, {"_id": "kjEprtTt8RuD3nBcL", "postedAt": "2014-09-28T13:11:08.202Z", "postId": "TgdXtRvnQH85mswZQ", "htmlBody": "<p>I think this comment is one of the best I've read on this forum thus far, and I wish more had read it to upvote it. I want it to become an article, so please email Ryan to make that happen!</p>\n", "parentCommentId": "ZmeytLYbC46ZNtr7n", "user": {"username": "Evan_Gaensbauer"}}, {"_id": "98Jdg3tvWp9jNXXfz", "postedAt": "2014-09-28T14:01:40.265Z", "postId": "TgdXtRvnQH85mswZQ", "htmlBody": "<p>I've given Kathy a couple of comments. Feel free to contact Kathy to offer help.</p>\n", "parentCommentId": "kjEprtTt8RuD3nBcL", "user": {"username": "RyanCarey"}}, {"_id": "p7CYMRDPzaqucn3Fh", "postedAt": "2015-04-24T01:52:12.432Z", "postId": "TgdXtRvnQH85mswZQ", "htmlBody": "<p>Any data on the QALY loss of the typical person in a nursing home? I was thinking one way to address the criticism that euthanasia is sometimes done to an unwilling person would be to have a system where some of the saved money is donated to effective causes. But maybe effective altruists don't want to go there?</p>\n", "parentCommentId": null, "user": {"username": "Denkenberger"}}, {"_id": "sCFAdRJCF7dPvFyKu", "postedAt": "2022-09-01T12:04:24.115Z", "postId": "TgdXtRvnQH85mswZQ", "htmlBody": null, "parentCommentId": null, "user": null}]