[{"_id": "kpFz2cvBYkw8gmKF4", "postedAt": "2022-09-22T13:50:00.249Z", "postId": "TGFWNKTRkDE6BJ73n", "htmlBody": "<p>The discussion on Erik Hoel's piece is here:</p><p>https://forum.effectivealtruism.org/posts/PZ6pEaNkzAg62ze69/ea-criticism-contest-why-i-am-not-an-effective-altruist</p>", "parentCommentId": null, "user": {"username": "Tyner"}}, {"_id": "8Ezwsi4vBs5QPuMXc", "postedAt": "2022-09-22T14:52:53.517Z", "postId": "TGFWNKTRkDE6BJ73n", "htmlBody": "<p>This is sort of unavoidably going to get into culture war/political territory... but if Nathan J Robinson is the kind of public enemy that EA has, we're doing very well. &nbsp;NJR is a terrible hack who has little of substance to say and whose place in The Discourse is usually as a laughingstock, even among those who are ideologically close to him.</p><p>&nbsp;</p><p>I'm of the opinion that EAs should <a href=\"https://forum.effectivealtruism.org/posts/Geh9DFZQnj9s5HjoW/the-hundred-billion-dollar-opportunity-that-eas-mostly\">pick more public fights</a> anyways, so I see this is as a positive development.</p>", "parentCommentId": null, "user": {"username": "JeremiahJohnson"}}, {"_id": "FMpJEgaeb3iCHowsX", "postedAt": "2022-09-22T14:54:29.859Z", "postId": "TGFWNKTRkDE6BJ73n", "htmlBody": "<p>also - the clever sounding title was taken from an obscure academic screed 9 years ago - https://ssir.org/articles/entry/the_elitist_philanthropy_of_so_called_effective_altruism</p>", "parentCommentId": "8Ezwsi4vBs5QPuMXc", "user": {"username": "JeremiahJohnson"}}, {"_id": "j2aZxjk4ffPzhngY7", "postedAt": "2022-09-22T15:47:39.342Z", "postId": "TGFWNKTRkDE6BJ73n", "htmlBody": "<p>This is nitpicky, but I wouldn't call that \"an obscure academic screed\":</p>\n<ul>\n<li>It was written by Charity Navigator leadership, who presumably felt threatened or something by GiveWell. So I think it was more like a non-profit turf war thing than an academic debate.</li>\n<li>I wasn't around at the time, but I have the impression that it was pretty (in)famous in EA circles at the time. Among other things it prompted a <a href=\"https://ssir.org/articles/entry/what_charity_navigator_gets_wrong_about_effective_altruism\">response</a> by Will MacAskill. So it also feels wrong to call it obscure.</li>\n</ul>\n", "parentCommentId": "FMpJEgaeb3iCHowsX", "user": {"username": "Erich_Grunewald"}}, {"_id": "5gR9tEt2TievAJ36J", "postedAt": "2022-09-22T16:39:23.710Z", "postId": "TGFWNKTRkDE6BJ73n", "htmlBody": "<p>(Note that this comment is quick and not super well thought out. I hope to research and think about it more deeply at some point in the future, and maybe write it up in a better form).&nbsp;</p><p>As with many articles critical of EA, this article spends a while arguing against the early EA focus on earning to give:</p><blockquote><p>To that end, I heard an EA-sympathetic graduate student explaining to a law student that she shouldn’t be a public defender, because it would be morally more beneficial for her to work at a large corporate law firm and donate most of her salary to an anti-malaria charity. The argument he made was that if she didn’t become a public defender, someone else would fill the post, but if she didn’t take the position as a Wall Street lawyer, the person who <i>did </i>take it probably wouldn’t donate their income to charity, <i>thus </i>by taking the public defender job instead of the Wall Street job she was essentially <i>murdering </i>the people whose lives she could have saved by donating a Wall Street income to charity.<a href=\"https://www.currentaffairs.org/2022/09/defective-altruism#fn1-23807\"><sup>1</sup></a></p><p><sup>...</sup></p><p>MacAskill wrote a <a href=\"https://www.academia.edu/1557895/Replaceability_Career_Choice_and_Making_a_Difference\">moral philosophy paper</a> arguing that even if we “suppose that the typical petrochemical company harms others by adding to the overall production of CO2 and thereby speeding up anthropogenic climate change” (a thing we do not need to “suppose”), if working for one would be “more lucrative” than any other career, “thereby enabling [a person] to donate more” then “the fact that she would be working for a company that harms others through producing CO2” wouldn’t be “a reason against her pursuing that career” since it “only makes others worse off if more CO2 is produced as a result of her working in that job than as a result of her replacement working in that job.” (You can of course see here the basic outlines of an EA argument in favor of becoming a concentration camp guard, if doing so was lucrative and someone else would take the job if you didn’t. But MacAskill says that concentration camp guards are “reprehensible” while it is merely “morally controversial” to take jobs like working for the fossil fuel industry, the arms industry, or making money “speculating on wheat, thereby increasing price volatility and disrupting the livelihoods of the global poor.” It remains unclear how one draws the line between “reprehensibly” causing other people’s deaths and merely “controversially” causing them.)<a href=\"https://www.currentaffairs.org/2022/09/defective-altruism#fn4-23807\"><sup>4</sup></a>&nbsp;</p></blockquote><p>It's a little frustrating to me that EA orgs and public figures have basically conceded this argument and tend to shy away from actively defending earning to give as a standard EA path. I think the utilitarian argument that the quoted graduate student was making is basically correct (with the need to properly account for one's career decision marginally impacting salaries in your given field, and whether one is likely to be a more effective worker than the person one is displacing). &nbsp;On the flip side, I think the deontological argument that NJR is making doesn't really hold up that well under scrutiny? Current Affairs is a print magazine, printing and mailing thousands of copies of it every month contributes to resource usage and climate change. NJR presumably is okay with this because he thinks that the benefits of educating and informing his readership exceed the harms of his resource usage. In the same way, I think working in a job that produces some negative harms can be okay if the net benefits of donating one's income substantially outweigh those harms. I think this gets even more stark when you try and actually think through the human scale of it all. Imagine having to tell ten thousand parents that the reason their kids won't get anti-malaria pills this year is that you working as a stock trader violates the categorical imperative. It sounds absurd, but that's the kind of thing we're talking about here.&nbsp;</p><p>Something that I do think I and NJR would agree on is that it's really screwed up that the world is in this situation to start with. There's something deeply unjust about a random American lawyer getting to decide whether people die from malaria based on their career and donation decisions. But we can't wave a magic wand and change that at the drop of a hat. And choosing to focus only on efforts to create systemic change means not getting lifesaving medicine to a ton of people who need it right now. I wish critics engaged more deeply with those really hard tradeoffs, and that EAs did a better job of articulating them. Just trying to sidestep the conversation about earning to give really undersells the moral challenge and stakes we're dealing with.</p>", "parentCommentId": null, "user": {"username": "MHR"}}, {"_id": "NGcHsK8aDup8EdPc6", "postedAt": "2022-09-22T23:47:15.492Z", "postId": "TGFWNKTRkDE6BJ73n", "htmlBody": "<p>One thing that's &nbsp;sad and perhaps not obvious to people is that, as I understand it, Nathan Robinson was initially sympathetic to EA (and this played a role in at-times vocal advocacy for animals). I don't know that there's much to be done about this. I think the course of events was perhaps inevitable, but that's relevant context for other Forum readers who see this.</p>", "parentCommentId": null, "user": {"username": "zdgroff"}}, {"_id": "zBtAym7wYBbLfSbML", "postedAt": "2023-02-06T06:33:46.548Z", "postId": "TGFWNKTRkDE6BJ73n", "htmlBody": "<p>This is somewhat reassuring, considering that I've been really concerned about the influence that Torres et al. have on public discourse about EA. Torres-style anti-EA backlash is mainly among extremely online leftists. (Though, to be fair, as the old saying goes, they've won the English department but lost the Supreme Court.) I still find that a lot of my IRL friends don't know or care about EA.</p>", "parentCommentId": "8Ezwsi4vBs5QPuMXc", "user": {"username": "evelynciara"}}]