[{"_id": "PFtCmXK8fckXF3XmD", "postedAt": "2017-03-15T04:28:33.899Z", "postId": "THXP2gy5TqxF8nJkd", "htmlBody": "<p>I am wondering if anyone has suggestions on where to volunteer one's time (not money)</p>\n<p>Has this been discussed much by EA people? </p>\n", "parentCommentId": null, "user": {"username": "Alexander"}}, {"_id": "MLpnbTtPuRcA9kxj4", "postedAt": "2017-03-15T04:33:49.754Z", "postId": "THXP2gy5TqxF8nJkd", "htmlBody": "<p>My personal opinion is that individuals should save enough to mitigate emergencies, job transitions, etc. (<a href=\"https://80000hours.org/2015/11/why-everyone-even-our-readers-should-save-enough-to-live-for-6-24-months/)\">https://80000hours.org/2015/11/why-everyone-even-our-readers-should-save-enough-to-live-for-6-24-months/)</a>, but no more. </p>\n<p>It just seems rather implausible, to me, that retirement money is anywhere close to being a cost-effective intervention, relative to other likely EA options.</p>\n", "parentCommentId": null, "user": {"username": "Linch"}}, {"_id": "MTZDP7hfXGE2N6cFp", "postedAt": "2017-03-15T09:05:27.722Z", "postId": "THXP2gy5TqxF8nJkd", "htmlBody": "<p>Here is an overall summary for any cause area.</p>\n<p><a href=\"https://80000hours.org/2012/10/how-to-be-a-high-impact-volunteer/\">https://80000hours.org/2012/10/how-to-be-a-high-impact-volunteer/</a></p>\n<p>I think this is a good summary for people who care about animal suffering.</p>\n<p><a href=\"https://animalcharityevaluators.org/ways-to-help/volunteer-effectively/\">https://animalcharityevaluators.org/ways-to-help/volunteer-effectively/</a></p>\n<p>There is also <a href=\"http://dotimpact.im/\">http://dotimpact.im/</a> for people that want to work on EA projects.</p>\n", "parentCommentId": "PFtCmXK8fckXF3XmD", "user": {"username": "DavidNash"}}, {"_id": "CGLLoqRs2RY36esMZ", "postedAt": "2017-03-15T09:33:17.905Z", "postId": "THXP2gy5TqxF8nJkd", "htmlBody": "<p>I think there is a goldmine of advice and practical tips on this website.</p>\n<p><a href=\"http://www.mrmoneymustache.com/\">http://www.mrmoneymustache.com/</a></p>\n<p>But instead of aiming to retire at 30, you'll be able to donate more and still have a healthy retirement fund by not spending all your money, and investing sensibly. The site below is useful with step by step guides.</p>\n<p><a href=\"http://monevator.com/how-to-retirement-plan/\">http://monevator.com/how-to-retirement-plan/</a> </p>\n<p>At the moment I give 10% and invest any other savings over that but I probably wont be going into a high paying job and have the benefit of free healthcare.</p>\n<p>I may slightly disagree with Linch about retirement money. I think it gives people a lot of power in their careers and job choices if they are able to tell their manager what they actually think and if they aren't desperate to succeed in a job interview.  Being financially independent can make it a lot easier to take ethical decisions and make a stand against a bad policy, without having to worry about losing your job. </p>\n<p>That depends on how much you think you need to feel secure. </p>\n", "parentCommentId": null, "user": {"username": "DavidNash"}}, {"_id": "ytkLc9Q8DBgWhFB2c", "postedAt": "2017-03-15T14:27:59.711Z", "postId": "THXP2gy5TqxF8nJkd", "htmlBody": "<p>| It just seems rather implausible, to me, that retirement money is anywhere close to being a cost-effective intervention, relative to other likely EA options.</p>\n<p>I don't think that &quot;Give 70-year-old Zach a passive income stream&quot; is an effective cause area. It is a selfish maneuver. But the majority of EAs seem to form some sort of boundary, where they only feel obligated to donate up to a certain point (whether that is due to partially selfish &quot;utility functions&quot; or a calculated move to prevent burnout). I've considered choosing some arbitrary method of dividing income between short term expenses, retirement and donations, but I am searching for a method that someone considers non-arbitrary, because I might feel better about it.</p>\n", "parentCommentId": "MLpnbTtPuRcA9kxj4", "user": {"username": "ZachWeems"}}, {"_id": "D98imzDDoteqJz4KY", "postedAt": "2017-03-15T22:10:36.539Z", "postId": "THXP2gy5TqxF8nJkd", "htmlBody": "<p>I am new to EA, but it seems that a true effective altruist would not be interested in retiring.  When just a $1000 can avert decades of disability-adjusted life years (years of suffering), I do not think it is fair to sit back and relax (even in your 70's) when you could still be earning to give.</p>\n", "parentCommentId": null, "user": {"username": "EvanWard97"}}, {"_id": "HrYZJ6ZkC6riMYdNM", "postedAt": "2017-03-15T23:00:20.702Z", "postId": "THXP2gy5TqxF8nJkd", "htmlBody": "<p>I've noticed a sizeable minority of posts in this forum have a font that is difficult for me to read. It's the second most-used font after the font in the OP. Does anyone know what it is?</p>\n<p>I would recommend not using that font, personally.</p>\n", "parentCommentId": null, "user": {"username": "DonyChristie"}}, {"_id": "eZP2h3gaSyvFR5nkh", "postedAt": "2017-03-16T05:56:38.993Z", "postId": "THXP2gy5TqxF8nJkd", "htmlBody": "<p>Apologies, rereading it again, I think my first comment was rude. :/ </p>\n<p>I do a lot of selfish and suboptimal things as well, and it will be inefficient/stressful if each of us have to always defend any deviation from universal impartiality in all conversations.  </p>\n<p>I think on the strategic level, some &quot;arbitrariness&quot; is fine, and perhaps even better than mostly illusory non-arbitrariness. We're all human, and I'm not certain it's even possible to really cleanly delineate how much you value different satisfying different urges for a meaningful and productive life. </p>\n<p>On the tactical level, I think general advice on frugality, increasing your income, and maximizing investment returns is applicable. Off the top of my head, I can't think of any special information specifically to the retirement/EA charity dichotomy. (Maybe the other commentators can think of useful resources?) </p>\n<p>(Well, one thing that you might already be aware of is that retirement funds and charity donations on two categories that are often tax-exempt, at least in the US. Also, many companies &quot;match&quot; your investment into retirement accounts up to a certain %, and some match your donations. Optimizing either of those categories can probably save you (tens of) thousands of dollars a year)</p>\n<p>Sorry I can't be more helpful!</p>\n", "parentCommentId": "ytkLc9Q8DBgWhFB2c", "user": {"username": "Linch"}}, {"_id": "59TnvhdiJ43KXhike", "postedAt": "2017-03-16T13:55:19.495Z", "postId": "THXP2gy5TqxF8nJkd", "htmlBody": "<p>One argument for saving more is that it could allow you to have a higher risk tolerance, since you could afford to lose some of the money. If you planned to donate any excess savings after some time, this could increase the expected value of your donations. I wrote about this here: <a href=\"http://effective-altruism.com/ea/rz/increasing_risk_tolerance_by_growing_your/\">http://effective-altruism.com/ea/rz/increasing_risk_tolerance_by_growing_your/</a></p>\n<p>Let me know if you have any questions about this.</p>\n", "parentCommentId": null, "user": {"username": "Andy_Schultz"}}, {"_id": "uw9WF6Z8FjsmRgFsR", "postedAt": "2017-03-16T14:57:54.796Z", "postId": "THXP2gy5TqxF8nJkd", "htmlBody": "<p>Right, I'm accounting for my own selfish desires here. An optimally moral me-like person would only save enough to maximize his career potential.</p>\n", "parentCommentId": "D98imzDDoteqJz4KY", "user": {"username": "ZachWeems"}}, {"_id": "D6fzo2LRGJhmy2XXa", "postedAt": "2017-03-16T14:58:50.074Z", "postId": "THXP2gy5TqxF8nJkd", "htmlBody": "<p>The 'Stache is great! He's actually how I heard about Effective Altruism.</p>\n", "parentCommentId": "CGLLoqRs2RY36esMZ", "user": {"username": "ZachWeems"}}, {"_id": "oXKWW8FobmNnqdZqx", "postedAt": "2017-03-16T15:44:10.201Z", "postId": "THXP2gy5TqxF8nJkd", "htmlBody": "<p>Welcome! :)</p>\n<p>I think your argument totally makes sense, and you're obviously free to use your best judgement to figure out how to do as much good as possible. However, a couple of other considerations seem important, especially for things like what a &quot;true effective altruist&quot; would do.</p>\n<p>1) One factor of your impact is your ability to stick with your giving; this could give you a reason to adopt something less scary and demanding. By analogy, it might seem best for fitness to commit to intense workouts 5 days a week, strict diet changes, and no alcohol, but in practice trying to do this may result in burning out and not doing anything for your fitness, while a less-demanding plan might be easier to stick with and result in better fitness over the length of your life.</p>\n<p>Personally, the prospect of giving up retirement doesn't seem too demanding; I like working, and retirement is so far away that it's hard to take seriously. However, I'd understand if others didn't feel this way, and I wouldn't want to push them into a commitment they won't be able to keep.</p>\n<p>2) Another factor of your impact is the other people you influence who may start giving, and would not have done so without your example -- in fact, it doesn't seem implausible that this could make up the majority of your impact over your life. To the extent that giving is a really significant cost for people, it's harder to spread the idea (e.g. many more people are vegetarian than vegan [citation needed]), and asking people to give up major parts of their life story like retirement (or a wedding, or occasional luxuries, or christmas gifts for their families, etc.) comes with real costs that could be measured in dollars (with lots of uncertainty). More broadly, the norms that we establish as a community affect the growth of the community, which directly affects total giving -- if people see us as a super-hardcore group that requires great sacrifice, I just expect less money to be given.</p>\n<p>For these reasons, I prefer to follow and encourage norms that say something like &quot;Hey, guess what -- you can help other people a huge amount without sacrificing anything huge! Your life can be just as you thought it would be, and also help other people a lot!&quot; I actually anticipate these norms to have better consequences in terms of helping people than more strict norms (like &quot;don't retire&quot;) do, mostly for reasons 1 and 2.</p>\n<p>There's still a lot of discussion on these topics, and I could imagine finding out that I'm wrong -- for example, I've heard that there's evidence of more demanding religions being more successful at creating a sense of community and therefore being more satisfying and attractive. However, my best guess is that &quot;don't retire&quot; is too demanding.</p>\n<p>(I looked for an article saying something like this but better to link to, but I didn't quickly find one -- if anyone knows where one is, feel free to link!)</p>\n", "parentCommentId": "D98imzDDoteqJz4KY", "user": {"username": "Daniel_Dewey"}}, {"_id": "RrcbSXzo8ZQWA5uib", "postedAt": "2017-03-17T03:26:28.490Z", "postId": "THXP2gy5TqxF8nJkd", "htmlBody": "<p>As people age their lives become more difficult. Physically and mentally, they just aren't where they previously were. Most effective altruists are younger people, and they may not take into consideration how risky it can be to not have any savings cushion in the case things change. We can't necessarily count on pension plans to cover us in our old age. We can't assume our health will always be what it is now. A lot of people will face harder times in the future, and being put in the mindset of assuming one won't face personal hardship, so one need not save money, is reckless.</p>\n<p> It's one thing if someone aspires to be wealthy, retire at age 30 like Mr. Money Mustache, or live a luxurious retirement. But it's dangerous to create a culture in EA where people might be accused of hypocrisy to even save enough for retirement to cover their own basic living expenses. It's also dangerous for us to presume that each of our lives will go so easily we can work until we die, or we won't get sick. While talking about these things in the abstract may be well and fine, I want to register my conviction using social influence, i.e., peer pressure, alone to normalize &quot;don't/no need to save for retirement&quot; as practical advice among effective altruists is potentially dangerous.</p>\n", "parentCommentId": null, "user": {"username": "Evan_Gaensbauer"}}, {"_id": "PW3bLm33LH8QXcmWo", "postedAt": "2017-03-17T07:41:29.097Z", "postId": "THXP2gy5TqxF8nJkd", "htmlBody": "<p>In addition to retirement planning, if you're down with transhumanism, consider attempting to maximize your lifespan so you can personally enjoy the fruits of x-risk reduction (and get your selfish &amp; altruistic selves on the same page).  <a href=\"http://lesswrong.com/lw/jrt/lifestyle_interventions_to_increase_longevity/\">Here's a list of tips</a>.</p>\n<p>With regard to early retirement, an important question is how you'd spend your time if you were to retire early.  I recently <a href=\"http://effective-altruism.com/ea/17s/what_should_the_average_ea_do_about_ai_alignment/abf?context=1#abf\">argued</a> that more EAs should be working at relaxed jobs or saving up funds in order to work on &quot;projects&quot;, to solve problems that are neither dollar-shaped nor career-shaped (note: this may be a self-serving argument since this is an idea that appeals to me personally).</p>\n<p>I can't speak for other people, but I've been philosophically EA for something like 10 years now.  I started from a position of extreme self-sacrifice and have basically been updating continuously away from that for the past 10 years.  A handwavey argument for this: If we expect impact to have a Pareto distribution, a big concern should be maximizing the probability that you're able to have a 100x or more impact relative to baseline.  In order to have that kind of impact, you will want to learn a way to operate at peak performance, probably for extended periods of time.  Peak performance looks different for different people, but I'm skeptical of any lifestyle that feels like it's grinding you down rather than building you up.  (<a href=\"https://smile.amazon.com/Power-Full-Engagement-Managing-Performance/dp/0743226755/\">This book</a> has some interesting ideas.)</p>\n<p>In principle, I don't think there needs to be a big tradeoff between selfish and altruistic motives.  Selfishly, it's nice to have a purpose that gives your life meaning, and EA does that much better than anything else I've found.  Altruistically, being miserable is not great for productivity.</p>\n<p>One form of self-sacrifice I do endorse is severely limiting &quot;superstimuli&quot; like video games, dessert, etc.  I find that after allowing my &quot;hedonic treadmill&quot; to adjust for a few weeks, this doesn't actually represent much of a sacrifice.  <a href=\"http://lesswrong.com/lw/flr/thoughts_on_designing_policies_for_oneself/\">Here are some thoughts on getting this to work</a>.</p>\n", "parentCommentId": null, "user": {"username": "John_Maxwell_IV"}}, {"_id": "pKLa4dH6DNkEmQCBe", "postedAt": "2017-03-17T15:04:41.577Z", "postId": "THXP2gy5TqxF8nJkd", "htmlBody": "<p>Very much agreed. I was pretty worried to see the initial responses saying 'saving for retirement isn't EA'. </p>\n", "parentCommentId": "RrcbSXzo8ZQWA5uib", "user": {"username": "Raemon"}}, {"_id": "59EdqNB8QBoPXRjz2", "postedAt": "2017-03-17T21:54:31.529Z", "postId": "THXP2gy5TqxF8nJkd", "htmlBody": "<p>It seems like the primary factor driving retirement planning for us is uncertainty over the course of civilization. We don't know when or if a longevity horizon will arise, what kinds of work we'll be able to do in our old age in the future, whether serious tech progress or a singularity will occur, whether humanity will survive, or what kinds of welfare policies we can expect. Generally speaking, welfare and safety nets are progressing in the West, and the economies of the US and other countries are expected to double within half a century IIRC. Personally, I think that if you have a few decades left before retirement would be necessary, then it's reasonable to donate all income, and if there still seems to be a need to save for retirement in the future then you can forego donations entirely and save a solid 30% or so of your income, just like you used to spend on donations.</p>\n", "parentCommentId": null, "user": {"username": "kbog"}}, {"_id": "qqrjGXkyMQdg3GcfH", "postedAt": "2017-03-18T01:08:42.420Z", "postId": "THXP2gy5TqxF8nJkd", "htmlBody": "<p>I don't plan to retire, but I've been thinking recently about a related topic: what to do in very advanced age, when my health and abilities have deteriorated such that I am unable to cover cost of living.</p>\n<p>My current plan is to donate and gift my remaining assets and take a one-way trip on Mac's Morphine Express if I find that I've outlived my usefulness.  But I'm not sure, and it's easier said than done.</p>\n", "parentCommentId": "D98imzDDoteqJz4KY", "user": null}, {"_id": "PTH4t5d6bnH3ZNwbW", "postedAt": "2017-03-20T01:26:46.877Z", "postId": "THXP2gy5TqxF8nJkd", "htmlBody": "<p>I would like to organize a topfreedom event in Vancouver on Gotopless Day, Aug 26.</p>\n<p><a href=\"http://gotopless.org/gotopless-day\">http://gotopless.org/gotopless-day</a></p>\n<p>If anyone is interested, they can email me at <a href=\"mailto:jefferywinkler@mail.com\">jefferywinkler@mail.com</a></p>\n", "parentCommentId": "PFtCmXK8fckXF3XmD", "user": {"username": "jefferywinkler"}}, {"_id": "546n4knpXCMu2qotN", "postedAt": "2017-03-20T02:21:42.715Z", "postId": "THXP2gy5TqxF8nJkd", "htmlBody": "<p>Meta: If you want to make an open-thread and seed it with topics, you should make a top-level comment about that topic to collect the discussion. Otherwise the discussion ends up scattered over many top-level comments, which makes it hard to discuss <em>other</em> topics - even though that is surely the point of an open thread!</p>\n", "parentCommentId": null, "user": {"username": "Larks"}}, {"_id": "9XBx5ZNim6oKqLXQC", "postedAt": "2017-03-20T13:24:56.667Z", "postId": "THXP2gy5TqxF8nJkd", "htmlBody": "<p>Does EA need [a] reputation system[s]?</p>\n<p><a href=\"https://en.wikipedia.org/wiki/Reputation_system\">Reputation systems</a> are typically used by on-line platforms to help enable higher levels of trust between users. </p>\n<p>1) My sense is that within EA there is a norm that we Do Favors For Each Other; ie, EAs often seem to have the subgoal 'try to help other EAs, within reason'. This is both correct and lovely. </p>\n<p>2) This norm may come under significant pressure as the community continues to scale. Will it be sustainable when the community has grown 10x? 100x? 1000x? </p>\n<p>If both of these propositions are correct, then an EA reputation system may be worth thinking about. EA presents some interesting challenges as a big-tent social movement, spread across many different on- and off-line platforms. Some initial ideas of what a reputational system could look like:</p>\n<ul>\n<li><p>Yet Another Webpage: eahub.org already supports profiles pages for EAs, with links to FB, this forum, lesswrong, etc. If most EAs have a page on eahub, with up-to-date links to their other on-line personas, maybe that's enough?</p>\n</li>\n<li><p>A Score: something like karma or the rep systems reddit/stack-exchange use, but able to deal with the multi-platform nature of EA. There are significant technical and social challenges with scoring systems even when they are only on a single platform.</p>\n</li>\n<li><p>A web of trust: something like the PGP <a href=\"https://en.wikipedia.org/wiki/Web_of_trust\">web-of-trust</a>, where EAs could essentially vouch for each other.</p>\n</li>\n</ul>\n", "parentCommentId": null, "user": {"username": "LKor"}}, {"_id": "nZ4BmGw7hhZq5XHEC", "postedAt": "2017-03-22T18:46:07.760Z", "postId": "THXP2gy5TqxF8nJkd", "htmlBody": "<p>After recently joining an Amnesty subgroup involved with corporate social responsibility, motivated because spreading EA through already existing structures is presumably the most impactful option in my power, I wonder as to how current sub-optimal efforts (e.g. arranging a geust speaker for the entire student group, creating flyers for consumer awareness on fair trade) can best be altered to allign with EA and thereby further the Amnesty agenda. </p>\n<p>I've already planned to meet with a CSR professor at my university in hopes of finding possible projects to involve ourselves with, but if someone here has any ideas for low-effort, high-impact projects we could be doing, as well as ideas about how to best integrate EA into existing structures in general, please let me know. </p>\n<p>Rough outline of a variant of a potential plan:  </p>\n<p>1.1. identify other (student) groups, perhaps non-Amnesty ones/ other organizations, to cooperate on certain projects with.</p>\n<p>1.2. limited to corporations with a public image to protect, identify practices that score highest on: structurality, abhorrence, and impact.</p>\n<p>1.3. use said cooperation to put pressure (how???) on those responsible for said practices such that it changes. (It might be worthwhile to speak with someone from Wakker Dier, an organization that to a highly successful extent used, among other things, shaming to get massive corporations to only sell animal products stemming from animal friendly farms.)</p>\n<p>In order to establish a positive feedback loop and maintain commitment, it's imperative that whatever project is decided upon is either somewhat fun or has a high likelihood of succeeding.  </p>\n<p>Either way, after lurking here for a while, it feels good to have finally become active, and I look forward to spending more of my online-time with you folk. </p>\n", "parentCommentId": null, "user": null}, {"_id": "KGpksGsWvbyR8BjKT", "postedAt": "2017-03-28T02:01:17.613Z", "postId": "THXP2gy5TqxF8nJkd", "htmlBody": "<p>Has anyone thought about retiring in a foreign country where the cost of living is low? That seems like a great idea to me - all the benefits of saving money, without worrying about work opportunities.</p>\n", "parentCommentId": null, "user": {"username": "Zeke_Sherman"}}, {"_id": "HBwz7cADYsdTYQimp", "postedAt": "2017-03-28T02:38:43.365Z", "postId": "THXP2gy5TqxF8nJkd", "htmlBody": "<p>We all know how many problems there are with reputation and status seeking. You would lower epistemic standards, cement power users, and make it harder for outsiders and newcomers to get any traction for their ideas.</p>\n<p>If we do something like this it should be for very specific capabilities, like reliability, skill or knowledge in a particular domain, rather than generic reputation. That would make it more useful and avoid some of the problems.</p>\n", "parentCommentId": "9XBx5ZNim6oKqLXQC", "user": {"username": "Zeke_Sherman"}}, {"_id": "gRwsXSBPSDbMPYSSc", "postedAt": "2017-04-25T04:04:22.806Z", "postId": "THXP2gy5TqxF8nJkd", "htmlBody": "<p>Do you live in the South Bay (south of San Francisco?). </p>\n<p>Did you recently move here and want to be plugged in to what EAs around here are doing and thinking? Did you recently learn about effective altruism and want to know what the heck it's about? Well, join South Bay Effective Altruism's first fully newbie-friendly meetup! </p>\n<p>We'll discuss cause prioritization, what causes areas YOU are interested in, and how we can help each other do the most good!</p>\n<p><a href=\"https://www.facebook.com/events/305401856547678/?active_tab=discussion\">https://www.facebook.com/events/305401856547678/?active_tab=discussion</a>\n<a href=\"https://www.meetup.com/South-Bay-Effective-Altruism/events/239444560/\">https://www.meetup.com/South-Bay-Effective-Altruism/events/239444560/</a></p>\n<p>The actual meetup will be this Friday at 7pm, but you can also comment here or message me at email[dot]Linch[at]gmail[dot]com to be in the loop for future events. </p>\n", "parentCommentId": null, "user": {"username": "Linch"}}, {"_id": "QTg7BSFAkQYkjdbDM", "postedAt": "2017-05-19T21:10:29.006Z", "postId": "THXP2gy5TqxF8nJkd", "htmlBody": "<p>This isn't very effective altruism related, but I do shop on Amazon smile, and occasionally give via GiveWell. On a lark, I made a pledge to make a personal (and self-indulgent) donation to some wargaming webcomic, but as part of the deal, I'm getting access to advertisement space at below market rates. For me, as a part of principles / stupidity, I'm not willing to revoke my pledge to donate, but at the same time, I want to make the most of my mistake.</p>\n<p>What should I advertise to minimize the net cost of my foolishness? I already contacted the Centre for Effective Altruism for permission to advertise for them, but I wouldn't advertise them without permission. The wargaming comic is Erfworld, which was featured in Time about a decade back, and has a generally-intelligent userbase. What selection would be most altruistic and efficient, beyond simply going back on my pledge and donating to GiveDirectly instead?</p>\n", "parentCommentId": null, "user": {"username": "Inst"}}, {"_id": "zegfaJ4qD7LXg8Gdh", "postedAt": "2017-05-19T21:44:48.093Z", "postId": "THXP2gy5TqxF8nJkd", "htmlBody": "<p>Also, a more general question. Why brand it effective altruism instead of efficient altruism? Remember the old story about the starfish drying up on a beach, and a man throwing them back into the ocean? A passerby comments: &quot;You can't get them all before they're gone, you won't make a difference&quot;. The altruist throws yet another one back into the ocean, and retorts &quot;I did for that starfish&quot;. The altruism seen there is probably not efficient; with a standard wage he could have made a greater difference for 6-sensed humans instead of 2-sensed starfish, but it is definitely effective.</p>\n<p>I always have to catch myself when I want to say efficient altruism instead of effective altruism, because old-fashioned &quot;buying food for starving neighbors&quot; is definitely effective, but it's not as efficient as donating to third-worlders.</p>\n", "parentCommentId": null, "user": {"username": "Inst"}}, {"_id": "6NBvLvy7bQKAvexQv", "postedAt": "2017-05-20T07:37:46.525Z", "postId": "THXP2gy5TqxF8nJkd", "htmlBody": "<p>Effective and efficient have a quite different nuance. See, <a href=\"http://learnersdictionary.com/qa/How-to-Use-Effective-and-Efficient\">e.g.</a>. In short, effectiveness implies the desirability of the goal that is aimed or achieved, while something that is harmful or bad can be efficient. The term 'efficient' is value-neutral in a way 'effective' is not. For example, there are efficient ways to slaughter animals, but that is not what people who are opposed to the killing of animals (especially for food, etc.) call 'effective'.</p>\n", "parentCommentId": "zegfaJ4qD7LXg8Gdh", "user": null}, {"_id": "fKw2k9HpYjiqqTELN", "postedAt": "2017-05-20T10:58:22.109Z", "postId": "THXP2gy5TqxF8nJkd", "htmlBody": "<p>Effective altruism, by its terminology, arouses what I see as unnecessary contention. By calling EA effective altruism, by implication, it implies that altruism outside the EA framework is not effective. By calling it efficient, it accepts that most altruism is effective, but privileges EA as efficient. In contrast, by claiming efficiency, it intrinsically appeals to some of the best-heeled philanthropists in the business field.</p>\n", "parentCommentId": "6NBvLvy7bQKAvexQv", "user": {"username": "Inst"}}, {"_id": "zGLsP4LaACp5GHhJ3", "postedAt": "2017-05-20T18:15:26.965Z", "postId": "THXP2gy5TqxF8nJkd", "htmlBody": "<p>Not sure what a DAF stands for. On retirement, buying an inflation-adjusted annuity could be a good of assuring you can donate a particular amount in your will while ensuring a steady income until you die.</p>\n", "parentCommentId": null, "user": {"username": "david_reinstein"}}, {"_id": "QzPik4jyhK9axvmdo", "postedAt": "2017-05-20T18:17:00.202Z", "postId": "THXP2gy5TqxF8nJkd", "htmlBody": "<p>Moving to a low-income foreign country could indirectly help the people in that country, if you buy goods and pay taxes there, create jobs, etc.</p>\n", "parentCommentId": "KGpksGsWvbyR8BjKT", "user": {"username": "david_reinstein"}}, {"_id": "ZpgboWXB4mhBEHnGP", "postedAt": "2017-08-04T05:18:39.820Z", "postId": "THXP2gy5TqxF8nJkd", "htmlBody": "<p>This is a topic I've thought about and just searched to see if anyone had posted on it. I've also written a moderately in-depth article on it here: <a href=\"https://medium.com/@aaronhamlin/practical-philanthropic-giving-using-effective-altruism-cd9636a6b014\">https://medium.com/@aaronhamlin/practical-philanthropic-giving-using-effective-altruism-cd9636a6b014</a></p>\n<p>My personal background is that I run two nonprofits and am a licensed attorney. I think about charitable giving a lot. I also put money into retirement while balancing giving.</p>\n<p>P.S. That you think about donor advised funds is a good sign! Those are so awesome that I dedicated an entire article to them: <a href=\"https://medium.com/@aaronhamlin/10-reasons-2-donor-advised-funds-are-awesome-giving-tools-7b9f2f743570\">https://medium.com/@aaronhamlin/10-reasons-2-donor-advised-funds-are-awesome-giving-tools-7b9f2f743570</a></p>\n", "parentCommentId": null, "user": {"username": "aaronhamlin"}}, {"_id": "38BJLx4naSGXByCG3", "postedAt": "2022-07-03T01:28:00.893Z", "postId": "THXP2gy5TqxF8nJkd", "htmlBody": "<p>That was probably the most load-bearing thought in <a href=\"https://makopool.com/better_space_with_wots.html\">my web-of-trust-based social network project</a>. The lack of specificity about what endorsements mean is the reason twitter doesn't work (but would if it allowed and encouraged having a lot more alts), and I believe that once you've distinguished the kinds of trust, you'll have a very different, much more useful kind of thing.</p>", "parentCommentId": "HBwz7cADYsdTYQimp", "user": {"username": "MakoYass"}}]