[{"_id": "ZWN5ovPSyR7tCGeon", "postedAt": "2023-03-14T07:07:29.138Z", "postId": "TiRPgfG4L8X2jt99g", "htmlBody": "<p>I've finally properly read the linked piece, and it is in fact excellent. I'm curating this post; thanks for link-posting the article.&nbsp;</p><p>Among other things, I really appreciated the descriptions of moments when cures were almost discovered. A number of such moments happened with ORS/ORT, but a brief outline of this happening with vitamin C and scurvy (which is used as an illustration of a broader point in the piece) is easier to share here to give a sense for the article:</p><blockquote><p>Today we know that scurvy is caused by a lack of vitamin C — a nutrient found in fresh food, like lemons and oranges. Medics in the Royal Navy during the 19th century had never heard of vitamin C, but they did know that sailors who drank a regular ration of lemon juice never seemed to fall ill with the disease, so that’s exactly what they supplied on long voyages. In 1860 the Royal Navy switched from lemons and Mediterranean sweet limes to the West Indian sour lime, not realizing that the West Indian limes contained a fraction of the vitamin C. For a while, the error went undiscovered because the advent of steamships meant that sailors were no longer going months without access to fresh food. But in the late 19th century, polar explorers on longer voyages started to fall ill with scurvy — a disease that they thought they’d seen the back of decades earlier. Without a knowledge of the underlying biology behind scurvy, a cure had been discovered and then promptly forgotten.</p></blockquote><p>I also really appreciated the description of how this treatment went from carefully monitored hospital settings to treatment centers and field hospitals in a crisis, and even to household cures (a feat that involved comics, advocacy by a famous actress, and door-to-door education).&nbsp;</p><p>Here's another excellent passage from near the end of the article, which is related to Kelsey's second point:&nbsp;</p><blockquote><p>Despite saving so many lives, the impact of ORT is easily overlooked. Ask someone what the biggest health innovations were in the 20th&nbsp; century and they’re likely to think of insulin, or the discovery of penicillin. Why hasn’t the development of ORT been elevated to a similar place in the history books?</p><p>One reason might be the sheer simplicity of the treatment. But the simplicity wasn’t an accident — it was the whole point of ORS. Scientists like Nalin and Cash were searching for a treatment that could scale to be used anywhere on the planet, even in the most rudimentary settings. “Once the physiology was worked out and once the clinical trials were carried out, you then had to market it and get it out to where the doctors and nurses and people were going to use it,” says Cash. Simplicity meant scalability.</p></blockquote>", "parentCommentId": null, "user": {"username": "Lizka"}}]