[{"_id": "2nt4rkFsT52MWmZ8d", "postedAt": "2024-03-12T21:04:47.874Z", "postId": "TjTasqnEzmsTKyjhh", "htmlBody": "<p>Thanks — this was helpfully accessible to my not-very-mathsy brain!</p>\n", "parentCommentId": null, "user": {"username": "Bella_Forristal"}}, {"_id": "wifhGw4y6NXk9uCY2", "postedAt": "2024-03-15T04:22:38.109Z", "postId": "TjTasqnEzmsTKyjhh", "htmlBody": "<p><s>(Without going through part 2 and the mathematics)</s></p><p>After going through part 2: Good job! I hope to see this model in use sooner or later!<br><br>Thanks for writing such a useful post!</p><p>Upon observing the pattern, I can see why you stated in the conclusion that the graph would be mostly quite obvious. The high-intensity pain with maximum time reduction would always move to the Pareto frontier. This would be directly responsible for the pain of Disabling variety—the motive of most factory farming practices, for reduced manufacturing costs and efficient storage.</p><p>I think the mentioned Multi-Objective model can be quite handy. We can incorporate it for cost-effective intervention analyses. But I think we can also use it to achieve the prerequisites required for estimating better Pareto frontier data.</p><p>Of course, <i>Behaviour is probably a good indicator of pain, as the evolutionary point of pain is to change behaviour. </i>One <i>caveat </i>though is change in behavioral patterns after long periodical treatments. For example: the case of cattle would be different from hens and chickens. That data can be obtained from authentic monitoring and testing (a fundamental bottleneck).</p><p>&nbsp;</p><p>P.S. I think this is an important consideration.</p><blockquote><p>so far this has had limited success due to the scarcity of relevant studies on humans, not to mention species of farmed animals.</p></blockquote>", "parentCommentId": null, "user": {"username": "Mayank Modi"}}, {"_id": "u3jGsRXxsNDHm7wfa", "postedAt": "2024-03-18T19:54:32.623Z", "postId": "TjTasqnEzmsTKyjhh", "htmlBody": "<p>Thanks a lot for your thoughts!</p>\n<p>I like your first point, that the intervention with the greatest reduction in highest intensity pain will always be in the Pareto frontier (as the 6th image shows, any point to the left of another will either be \"unclear\" or \"strictly worse\", but never \"strictly better\"). I hadn't considered that before!</p>\n<p>I don't think I understand your second or third points though.</p>\n<p>Namely this line:</p>\n<blockquote>\n<p>But I think we can also use it to achieve the prerequisites required for estimating better Pareto frontier data.</p>\n</blockquote>\n<p>And this line:</p>\n<blockquote>\n<p>One caveat though is change in behavioral patterns after long periodical treatments. For example: the case of cattle would be different from hens and chickens</p>\n</blockquote>\n<p>I don't understand the distinction you're making between cows and chickens.</p>\n<p>Thanks again for your comment!</p>\n", "parentCommentId": "wifhGw4y6NXk9uCY2", "user": {"username": "Hamilton"}}]