[{"_id": "TuGpgi5JWBkn9paFR", "postedAt": "2015-06-07T20:21:49.413Z", "postId": "ToTpmYyhcLXzYFDXN", "htmlBody": "<p>A sustainable flourishing world!</p>\n", "parentCommentId": null, "user": {"username": "RyanCarey"}}, {"_id": "oAyKw4zTngvuXiL6J", "postedAt": "2015-06-08T00:58:43.999Z", "postId": "ToTpmYyhcLXzYFDXN", "htmlBody": "<p>Some possible criteria:</p>\n<ul>\n<li>Number of GWWC members</li>\n<li>Number of GWWC pledge signers</li>\n<li>Number of EA facebook group members</li>\n<li>Amount of traffic on this website</li>\n<li>Amount of money moved by GiveWell</li>\n<li>Amount of 80k Hours career advice requests</li>\n<li>Number of applications</li>\n<li>Amount of media coverage</li>\n<li>Amount of positive media coverage</li>\n<li>Number of EA organizations and projects</li>\n<li>Size and scale of EA organizations and projects</li>\n<li>Number of job applications at EA organizations</li>\n<li>Number of applications for EA funds, contests, and projects</li>\n<li>Amount of money donated by EAs</li>\n<li>Level of credibility EA holds in academia</li>\n</ul>\n", "parentCommentId": null, "user": {"username": "Bitton"}}, {"_id": "QJSghgaPzfHsEYTp2", "postedAt": "2015-06-08T02:28:05.218Z", "postId": "ToTpmYyhcLXzYFDXN", "htmlBody": "<p>I was reading <em>Lifeblood</em> by Alex Perry (it details the story of malaria bed nets). The book initially criticizes a lot of aid organizations because Perry claims that the aim of aid should be &quot;for the day it's no longer needed&quot;. E.g., the goal of the Canadian Cancer Society should be to aim for the day when cancer research is unnecessary because <em>we've already figured out how to beat it</em>. However, what aid organizations actually do is expand to fill a whole range of other needs, which is somewhat suboptimal. </p>\n<p>In this case, EA is really no exception. Suppose that in the future, we've tackled global poverty, animal welfare, and climate change/AI risk/etc. We would just move on to the next most important thing in EA. Of course, EA is separate from classical aid organizations, because it's closer to a movement/philosophy than a single aid effort. Nevertheless, I still think it might be useful to define &quot;winning&quot; as &quot;alleviating a need for something&quot;. This could be something like &quot;to reach a day when we no longer need to support GiveDirectly [because we've already eliminated poverty/destitution/because we've reached a quality of wealth redistribution such that nobody is living below X dollars a year].&quot; </p>\n", "parentCommentId": null, "user": {"username": "Anj"}}, {"_id": "BTSL546dfovvEcrnA", "postedAt": "2015-06-08T03:17:16.977Z", "postId": "ToTpmYyhcLXzYFDXN", "htmlBody": "<p>On that note, for Effective Altruist organizations, I imagine that 'not being needed' means 'not continuing to be the best use of our resources', or, 'have faced significant diminishing marginal returns to additional work'.  That said, the condition for an organization to rationally end is different than their success condition.</p>\n<p>On obvious point: Most organizations/causes have multiple increasingly-large success conditions.  There's not one 'success condition', but a progressive set of improvements.  We won't 'win' as an abstract term.  I mean, I don't think Martin Luther King would say that he 'won', he accomplished a lot, but things got complicated at the end and there was still a lot to be done; needless to say though, he did quite well.</p>\n<p>A better set of questions may be 'what are some reasonable goals to aim for?'  Then, 'how can we measure how far we are from those specific goals?'</p>\n<p>In completely pragmatic matters, I think that the best goals for us is not legislation, but monetary donations to EA-related causes.</p>\n<p>Goal 1: 100m/year</p>\n<p>3: 1b/year</p>\n<p>4: 10b/year</p>\n<p>etc</p>\n<p>The ultimate goal for all of us may be a positive-singularity, though that is separate from effective altruism itself and harder to measure.  Also, of course the money above would have to be adjusted for quality of the EA org relative to the best.</p>\n<p>There is of course, still the question of how good the interventions are and how good the intervention-deciding mechanisms are.  However, I feel like measuring / estimating those are quite a bit more challenging and also present a very orthogonal and distinct challenge from raising money.  For instance, growing a movement and convincing people in the large would be an 'EA popularity goal', which would be measured in money, while finding new research to understand effectiveness would be more of a 'EA Research Goal'.  Two very different things.</p>\n", "parentCommentId": "QJSghgaPzfHsEYTp2", "user": {"username": "oagr"}}, {"_id": "Wo87pipCkLHR5eoyi", "postedAt": "2015-06-08T04:41:31.499Z", "postId": "ToTpmYyhcLXzYFDXN", "htmlBody": "<p>Hitting sharply diminishing returns on QALYs/$</p>\n<p>Currently you can buy decades and decades of QALYs for a year's salary or less. And that's just straight forward, low variance, uncontroversial purchases. If you cast your net wider (far future concerns) you could potentially be purchasing trillions of QALYs on expectation. I'll consider EA to have won once those numbers drop to something reasonable.</p>\n", "parentCommentId": null, "user": {"username": "RomeoStevens"}}, {"_id": "yzKqkHeJPhxT8LLKZ", "postedAt": "2015-06-08T13:13:59.667Z", "postId": "ToTpmYyhcLXzYFDXN", "htmlBody": "<p>Clippy wants to point out that this goal could easily be achieved through a deadly virus that wipes out the human race, planetwide nuclear winter, etc. :P</p>\n", "parentCommentId": "Wo87pipCkLHR5eoyi", "user": {"username": "John_Maxwell_IV"}}, {"_id": "75MJe6zNSbMf5ynCP", "postedAt": "2015-06-08T13:38:19.760Z", "postId": "ToTpmYyhcLXzYFDXN", "htmlBody": "<p>I'm skeptical of explicit metrics like &quot;number of GWWC pledge signers&quot;, &quot;money moved&quot;, etc.  Any metrics that get proposed will be imperfect and may fall prey to <a href=\"http://lesswrong.com/lw/1ws/the_importance_of_goodharts_law/\">Goodhart's law</a>.</p>\n<p>To me, careful analysis and thoughtful discussion are the most important aspects of EA.  <a href=\"http://www.spiegel.de/international/spiegel/spiegel-interview-with-african-economics-expert-for-god-s-sake-please-stop-the-aid-a-363663.html\">Good intentions are not enough</a>.  (After you read the previous article, imagine if an earlier EA movement had focused on &quot;money moved to Africa&quot; as its success metric.)</p>\n<p>The default case is for humans to act altruistically in order to look good, not do good.  It's very important for us to resist the pull of this attractor for as long as possible.</p>\n", "parentCommentId": null, "user": {"username": "John_Maxwell_IV"}}, {"_id": "LG888DLgmFMzbgxJL", "postedAt": "2015-06-08T16:38:51.096Z", "postId": "ToTpmYyhcLXzYFDXN", "htmlBody": "<p>Yep, that's fundamental. Also, we don't want to give the impression that our obligations are limited to opportunities that land in our lap. If we seem to be hitting diminishing returns, it's time to try looking for awesome opportunities in different domains.</p>\n", "parentCommentId": "yzKqkHeJPhxT8LLKZ", "user": {"username": "RyanCarey"}}, {"_id": "2bSm8jK3TreKe7C6X", "postedAt": "2015-06-09T17:32:18.979Z", "postId": "ToTpmYyhcLXzYFDXN", "htmlBody": "<p>I would think winning is likely to depend sharply on cause area, or at least on particular assumptions that are not agreed upon in the EA community, at least if it is to be sufficiently concrete. Most EAs could probably agree that a world where utility is maximized (or some fairly similar metric, or optimization function) is a win. What world will realize this depends on views about the value of nonhuman animals, the value of good vs. bad experiences, and other issues where I've seen quite a bit of disagreement in the EA community.</p>\n", "parentCommentId": null, "user": {"username": "zdgroff"}}, {"_id": "wk4R8S7SahuFzn2D5", "postedAt": "2015-06-10T00:26:36.361Z", "postId": "ToTpmYyhcLXzYFDXN", "htmlBody": "<p>Turning the current negative feedback loop (donors give based on &quot;warm glow&quot;, not impact-&gt; charities dis-incentivized to gather/provide meaningful impact info-&gt;donors who want impact info can't find it and give based on warm glow) into a positive feedback loop (donors give based on impact-&gt; charities incentivized to achieve/measure/report impact-&gt;easier for donors to conduct better analysis).</p>\n<p>More generally, drastically shifting incentives people face re: EA behavior (giving effectively, impact-based career decisions, keeping robots from killing us, etc.) </p>\n", "parentCommentId": null, "user": {"username": "Jon_Behar"}}, {"_id": "pgqf586sgMKuCjnxE", "postedAt": "2015-06-15T05:33:49.156Z", "postId": "ToTpmYyhcLXzYFDXN", "htmlBody": "<p>I like this list. We could improve on it by establishing a hierarchy of metrics.</p>\n<p><strong>1st Tier</strong>: more quantifiable and objective metrics which are also most strongly tied or correlated with direct impact.</p>\n<ul>\n<li>Amount of money moved by Givewell and/or other effective altruist organizations.</li>\n<li>Amount of money donated by effective altruists</li>\n</ul>\n<p><strong>2nd Tier</strong>: quantifiable metrics which aren't directly tied to increased impact, but are strongly expected to lead to increased impact. In this tier I include memberships which are expected to lead to more donations, and to overcome constraints on talent and human capital.</p>\n<ul>\n<li>Number of GWWC members</li>\n<li>Number of GWWC pledge signers</li>\n<li>Amount of 80,000 Hours career advice requests</li>\n<li>Number of effective altruism organizations and projects</li>\n<li>Number of job applications at effective altruism organizations</li>\n<li>Number of applications for effective altruism funds, contests and projects</li>\n<li>Scale and scope of effective altruism organizations and projects</li>\n</ul>\n<p><strong>3rd Tier</strong>: metrics which are less direct, more subjective, less quantifiable, and are more about awareness than exactly expected impact.</p>\n<ul>\n<li>Amount of traffic on this website</li>\n<li>Amount of media coverage</li>\n<li>Amount of positive media coverage</li>\n<li>Level of credibility effective altruism holds in academia</li>\n</ul>\n<p>I think it's possible for one metric to jump from one tier to the next in terms of how much confidence we put on it. This can happen under dramatic circumstances. For example, &quot;media coverage&quot; or &quot;positive media coverage&quot; would be something we would have much confidence in as impactful if effective altruism gets a cover story on, e.g., TIME magazine.</p>\n", "parentCommentId": "oAyKw4zTngvuXiL6J", "user": {"username": "Evan_Gaensbauer"}}]