[{"_id": "tMpXgZbhqt2sMcyHs", "postedAt": "2023-09-11T17:49:46.185Z", "postId": "TqAxoYPSYhpv7FP6c", "htmlBody": "<p>Thanks for the linkpost! Could you please add a summary of the article for those of us who can't access it? Also, you can <a href=\"https://forum.effectivealtruism.org/posts/Y8gkABpa9R6ktkhYt/forum-user-manual#Cross__and_link_posts\">convert this post into a linkpost</a> by clicking on the link icon in the editor window.</p>", "parentCommentId": null, "user": {"username": "evelynciara"}}, {"_id": "YabDCcHkHPRSumRxz", "postedAt": "2023-09-11T19:21:27.842Z", "postId": "TqAxoYPSYhpv7FP6c", "htmlBody": "<p>Accessible without subscription here: <a href=\"https://archive.ph/jqAjV\">https://archive.ph/jqAjV</a></p>\n", "parentCommentId": null, "user": {"username": "MichaelStJules"}}, {"_id": "uJg3WSCBZCjZqZp6T", "postedAt": "2023-09-12T18:34:23.611Z", "postId": "TqAxoYPSYhpv7FP6c", "htmlBody": "<p>Sure. I've written a short summary and my reaction to it, and made it a linkpost</p>", "parentCommentId": "tMpXgZbhqt2sMcyHs", "user": {"username": "Matt g"}}, {"_id": "nz5dAADcpbKAXDghP", "postedAt": "2023-09-13T10:54:07.630Z", "postId": "TqAxoYPSYhpv7FP6c", "htmlBody": "<p>Based on the choice of words from the EU Commission President in her \"state of the union\" speech today, it seems as though the EU is indeed shelving the planned transition to cage-free hens supposed to be proposed this month, as part of a general change in strategic direction from it's top-down \"Farm-to-Fork\" strategy to some more bottom-up \"strategic dialogue\" approach.</p><p>If true, pretty big defeat for the EU animal movement.&nbsp;<br><br>Probably a lot to do with current food inflation, prices, Ukraine war etc and pressure from industry and farmers</p><p>There's still some chance that they pick up some AW revisions as stand-alone items, set apart from the broader \"Green Deal\", or somehow civil society create enough pressure to rescue the Green Deal/Farm-to-Fork package as a whole. The President simply failed to mention animal welfare reform and instead focused on entering \"the next phase of the European Green Deal\" and in a<a href=\"chrome-extension://efaidnbmnnnibpcajpcglclefindmkaj/https://state-of-the-union.ec.europa.eu/system/files/2023-09/SOTEU_2023_Letter_of_Intent_EN_0.pdf\"> letter of intent</a> referring to launching \"a strategic dialogue with the farming community\". \"While there'll be something on animal welfare (the Commission is obliged to reply to an ECI on it)\" (<a href=\"https://twitter.com/gerardofortuna/status/1701878244394295334\">Gerardo Fortuna, Agrifood Editor at EURACTIV</a>) and Members of the European Parliament are directly asking her about why AW wasn't mentioned and that she should prioritise that. But there had been a lot of activity in the past week to pressure the President to include animal welfare revision in the State of the Union (suggesting they thought it was important) and part of the Theory of Victory/Change of the EU animal movement had been to tie animal welfare to the Green Deal &amp; \"Farm-to-Fork\" and hope it got carried along the way.&nbsp;<br><br>Here's some good coverage of the state of the union and what it might mean</p><p>https://twitter.com/gerardofortuna/status/1701878230448263251<br><a href=\"https://www.ciwf.eu/news/eu-shelves-promised-ban-on-caged-farming/\">https://www.ciwf.eu/news/eu-shelves-promised-ban-on-caged-farming/</a></p>", "parentCommentId": null, "user": {"username": "Incogneilo18"}}]