[{"_id": "zBfWAy8gspYswCEE5", "postedAt": "2022-11-30T14:29:14.784Z", "postId": "TQsTahJWj2S5QD86t", "htmlBody": "<p>Thanks for your efforts here. &nbsp;How likely do you think it is that the farm will succeed in creating a commercially viable product, apart from public pressure? &nbsp;Sounds like there are significant biological and ecological barriers.</p><p>Also, unrelatedly, seems to me like octopus and squid would be relatively easier to create vegan alternatives to. &nbsp;People mostly likely them for the texture, there isn't really a flavor. &nbsp;But I know nothing about the science of alt protein.</p>", "parentCommentId": null, "user": {"username": "Vivian.Lwd"}}, {"_id": "QXuPuEnWbFGEtvbWd", "postedAt": "2022-11-30T15:51:00.214Z", "postId": "TQsTahJWj2S5QD86t", "htmlBody": "<p>Octopi are some of the most intelligent creatures, with a fascinatingly alien path to getting there and unrecognizable brain structure. I encourage anyone who doesn't know about octopi intelligence to look into it - they aren't social, don't teach each other skills, don't live long, and don't have centralized processing but they rank among the highest intelligence we are aware of.</p>\n<p>Something I felt was missing from the post was a mention of how intelligent the octopi and cephalopods are which are likely to be farmed. I thought only a few species of octopi were intelligent, and assume many are average or low levels of cognition for the animal world. I might prefer it to chickens and cows depending on the species...</p>\n<p>Your other points about why it would be a terrible  subject for farming are compelling, and I appreciate you spelling them out so concisely. Even if they are species average in perceptiveness they might be far worse to farm than other species.</p>\n<p>In any case, I'm really glad you brought my attention to this and that you care about this subject!!</p>\n", "parentCommentId": null, "user": {"username": "EcologyInterventions"}}, {"_id": "puBiRjZZuMYFS2wau", "postedAt": "2022-11-30T18:12:07.818Z", "postId": "TQsTahJWj2S5QD86t", "htmlBody": "<p>To me, the scariest implication of octopus farming is that it updates me downward, maybe significantly, the probability that factory farming will be eliminated/replaced entirely. If humans are so eager to develop a type of factory farming that is so difficult and inefficient, I am afraid I just can't see how we can guarantee that factory farming won't continue into the far future. (yes, I am talking about the type of \"far\" that the average longtermists speak of)</p>", "parentCommentId": null, "user": {"username": "tseyipfai@gmail.com"}}, {"_id": "oKP7Nj4cwSsGea74h", "postedAt": "2022-12-01T11:53:56.617Z", "postId": "TQsTahJWj2S5QD86t", "htmlBody": "<h2>Summary</h2><h2><img src=\"https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/b418080db88f5e879170578e8ff745000bb7e091348ed478.png\" srcset=\"https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/b418080db88f5e879170578e8ff745000bb7e091348ed478.png/w_140 140w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/b418080db88f5e879170578e8ff745000bb7e091348ed478.png/w_280 280w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/b418080db88f5e879170578e8ff745000bb7e091348ed478.png/w_420 420w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/b418080db88f5e879170578e8ff745000bb7e091348ed478.png/w_560 560w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/b418080db88f5e879170578e8ff745000bb7e091348ed478.png/w_700 700w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/b418080db88f5e879170578e8ff745000bb7e091348ed478.png/w_840 840w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/b418080db88f5e879170578e8ff745000bb7e091348ed478.png/w_980 980w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/b418080db88f5e879170578e8ff745000bb7e091348ed478.png/w_1120 1120w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/b418080db88f5e879170578e8ff745000bb7e091348ed478.png/w_1260 1260w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/b418080db88f5e879170578e8ff745000bb7e091348ed478.png/w_1382 1382w\"></h2><ul><li>Demand for octopus and squid is growing</li><li>Wild populations of octopus and squid are unstable</li><li>So octopus and squid are likely to be factory farmed in the future</li><li>Octopuses are really smart. It would be an animal welfare disaster for them to be factory farmed.<ul><li>There would also be \"environmental, social, public health\" concerns</li></ul></li><li><a href=\"https://ali.fish/\"><u>The Aquatic Life Institute (ALI)</u></a> is a non-profit trying to prevent this future</li><li>ALI is campaigning to ban octopus farming in countries/regions where this is being considered (i.e Spain, , Mexico, the EU)</li><li>ALI \"will work with corporations on procurement policies banning the purchase of farmed octopus\"</li><li>ALI \"supports research to compare potential welfare interventions\"</li><li>So far, ALI has sent some letters to government officials, organised a tweet campign, planned a couple of protests, and run some online events.</li><li>They started a coalition with of 110 animal protection organizations (so like SPCA and stuff), called the Aquatic Animal Alliance (AAA)</li><li>ALI has five welfare concerns for farmed octopuses:<ol><li>Environmental Enrichment (octopuses could get bored)</li><li>Feed Composition (only feeding octopuses fishmeal/fish is unsustainable)&nbsp;</li><li>Stocking Density &amp; Space Requirements (octopus are solitary by nature, and high density stocking \"could result in cannibalism\")</li><li>Water Quality</li><li>Stunning &amp; Slaughter (\"slaughter methods have been studied, however, none have been scientifically approved as humane\")</li></ol></li></ul><p>\"Approximately 500 billion aquatic animals are farmed annually in high-suffering conditions and, to date, there is negligible advocacy aimed at improving welfare conditions for these remarkable beings.\"</p><p>[Suggestions for how to improve this summary are welcome]</p>", "parentCommentId": null, "user": {"username": "Hamish Doodles"}}, {"_id": "PK4xRF2JCddxZNuwe", "postedAt": "2022-12-05T12:29:27.183Z", "postId": "TQsTahJWj2S5QD86t", "htmlBody": "<p>Thanks so much for your comment, Hamish. This is a great summary (and a lovely introduction doodle)!</p>", "parentCommentId": "oKP7Nj4cwSsGea74h", "user": {"username": "Tessa @ ALI"}}, {"_id": "bRMmK6RAPWtxjQt2E", "postedAt": "2022-12-05T12:39:29.561Z", "postId": "TQsTahJWj2S5QD86t", "htmlBody": "<p>Thank you for your comment, Fai. Yes, it is an unfortunate reality that we are currently faced with regarding the prominence, interest, and advancement of factory farms. Altering this reality will require significant changes in many areas (policy, science, economics). It will also require individuals in each area to \"band\" together and work towards a better future. I do think it is important to keep that longtermist perspective in mind that you mentioned during these pursuits to try and spark institutional transformations wherever possible. &nbsp;</p>", "parentCommentId": "puBiRjZZuMYFS2wau", "user": {"username": "Tessa @ ALI"}}, {"_id": "JBs9Sku6qqjqa9u9D", "postedAt": "2022-12-05T12:58:30.471Z", "postId": "TQsTahJWj2S5QD86t", "htmlBody": "<p>Hi there, Hadrian. Thanks for your support and comment. Unfortunately, it appears as though the environmental permitting regarding this specific farm is being allowed to proceed. And if everything else is successful (building, funding, etc.) we expect operations to fully commence. However, our efforts will be directed towards a variety of stakeholders in order to try and approach this problem from several different angles.&nbsp;</p><p>Our friends at the <a href=\"https://gfi.org/resource/expanding-access-to-cell-lines/\">Good Food Institute</a> are spearheading the alternative protein space with their Sustainable Seafood Initiative to address critical challenges facing the plant-based and cultivated seafood sector if you'd like to take a look at their <a href=\"https://gfi.org/wp-content/uploads/2021/01/SCI-Seafood-Cell-Line-Proposal2-2019-0425.pdf\">cell line repository proposal</a>. This area of work is fascinating to me and certainly something we should keep in mind when advocating for alternatives.&nbsp;</p>", "parentCommentId": "zBfWAy8gspYswCEE5", "user": {"username": "Tessa @ ALI"}}, {"_id": "dNZHWRZmbfisBzEyg", "postedAt": "2022-12-05T13:05:00.555Z", "postId": "TQsTahJWj2S5QD86t", "htmlBody": "<p>Thanks so much for your support! Yes, they are miraculous creatures and fiercely intelligent. I appreciate your feedback and will certainly keep that in mind for future communications regarding this initiative.&nbsp;</p><p>My colleague suggested the book \"<a href=\"https://books.google.com/books/about/The_Soul_of_an_Octopus.html?id=lCTrAwAAQBAJ&amp;source=kp_book_description\">The Soul of an Octopus</a>\" as a great resource for this subject matter for those who are interested. This is on my reading list for the holiday break coming up, but any additional recommendations are much appreciated!&nbsp;</p>", "parentCommentId": "QXuPuEnWbFGEtvbWd", "user": {"username": "Tessa @ ALI"}}, {"_id": "HCk2aMpWkJRmZBdRy", "postedAt": "2022-12-07T18:18:41.249Z", "postId": "TQsTahJWj2S5QD86t", "htmlBody": "<p>Thanks for your work on this, Tessa! I have some similar follow-up questions:<br><br>\"Thanks for your support and comment. Unfortunately, it appears as though the environmental permitting regarding this specific farm is being allowed to proceed.\"</p><p>To clarify, do you mean that Nueva Pescanova has in fact received &nbsp;its environmental permit?<br><br>\"How likely do you think it is that the farm will succeed in creating a commercially viable product, apart from public pressure? &nbsp;Sounds like there are significant biological and ecological barriers.\"<br><br>I am also interested in ALI's take on this. <a href=\"https://www.bbc.com/news/science-environment-59667645\">Nueva Pescanova claims</a> it will be able to raise 3k tonnes of farmed octopus starting in 2023. Has ALI been able to verify that this scale is actually feasible right now?<br><br>Finally, is an outright, blanket ban on octopus legally possible in Spain or the EU (or even narrowly within the Canary Islands)? Or is a \"ban\" shorthand for \"convince legislators that, in practice, octopus farming won't meet existing minimal environmental and animal welfare standards\"? And what existing farmed animal welfare standards could be invoked, given that octopuses are invertebrates, not vertebrates?</p>", "parentCommentId": "JBs9Sku6qqjqa9u9D", "user": {"username": "Will M"}}, {"_id": "qzaQLGWNCcpXkih77", "postedAt": "2022-12-19T21:53:47.019Z", "postId": "TQsTahJWj2S5QD86t", "htmlBody": "<p>I love this campaign--it is so tragic to see octopi eaten :' (</p><p>I know I've asked this, but I'm struggling to get a sense of scale of the problem. How many octopi are killed for food...and do we have a sense of how that number could grow? How many octopi is the Canary Islands facility projected to produce? Especially when compared to the gajillions of marine animals killed for food. From the INT framework, I see a potential gap in the \"Importance\" variable. This campaign is certainly Neglected and Tractable, but so is stealing candy from children : P&nbsp;</p><p>One factor in favor of this campaign is the idea that bad practices are a lot easier to prevent than to stop. If we can halt this practice now, it is a lot easier than fighting an entrenched and politically connected industry.&nbsp;</p>", "parentCommentId": null, "user": {"username": "minthin"}}, {"_id": "4wMpEDFpssHnKN2hB", "postedAt": "2023-01-06T11:23:59.925Z", "postId": "TQsTahJWj2S5QD86t", "htmlBody": "<p>I tried to donate but ran into problems because the online form only recognised US phone numbers and required my \"state\" from a list of... Only US states. Do you only accept donations from the US?</p>\n", "parentCommentId": null, "user": {"username": "Guy Raveh"}}, {"_id": "92RmnZBazAdSobnit", "postedAt": "2023-02-08T15:07:24.382Z", "postId": "TQsTahJWj2S5QD86t", "htmlBody": "<p>Hi Guy! Apologies for the late reply, but I have just sent you a direct message about this :) thanks for your interest and support. Cheers!</p>", "parentCommentId": "4wMpEDFpssHnKN2hB", "user": {"username": "Tessa @ ALI"}}]