[{"_id": "HLbyH6gi8McZetgp6", "postedAt": "2015-01-25T21:35:41.295Z", "postId": "TsbLgD4HHpT5vrFQC", "htmlBody": "<p>It's nice to see us touching on literature and the importance of diversity. Thanks for writing this, Bernadette!</p>\n", "parentCommentId": null, "user": {"username": "RyanCarey"}}, {"_id": "PcHAHoaGK4Gvmuveq", "postedAt": "2015-01-26T04:24:48.460Z", "postId": "TsbLgD4HHpT5vrFQC", "htmlBody": "<p>This was a really beautiful piece.  Thank you.</p>\n", "parentCommentId": null, "user": {"username": "Peter_Hurford"}}, {"_id": "SPrzPgDbiXnwn4yYc", "postedAt": "2015-01-26T05:13:22.163Z", "postId": "TsbLgD4HHpT5vrFQC", "htmlBody": "<p>I liked this post.  Does anyone have ideas on how to reach out to modern-day Dorotheas?</p>\n", "parentCommentId": null, "user": {"username": "John_Maxwell_IV"}}, {"_id": "cb7jABBtrXTXwhqLj", "postedAt": "2015-01-26T19:49:57.482Z", "postId": "TsbLgD4HHpT5vrFQC", "htmlBody": "<p>Thanks Ryan (It's good to get some practical use from that BA!). Actually the year I studied Middlemarch was the same year I read Peter Singer's One World and started giving at least 1% - that arts degree had several good points!</p>\n", "parentCommentId": "HLbyH6gi8McZetgp6", "user": {"username": "Bernadette_Young"}}, {"_id": "NaeSPmtGQMhyv27L2", "postedAt": "2015-01-26T19:50:15.394Z", "postId": "TsbLgD4HHpT5vrFQC", "htmlBody": "<p>That's really kind, thanks Peter. </p>\n", "parentCommentId": "PcHAHoaGK4Gvmuveq", "user": {"username": "Bernadette_Young"}}, {"_id": "Wh6yon689SwznnLhv", "postedAt": "2015-01-26T19:52:42.008Z", "postId": "TsbLgD4HHpT5vrFQC", "htmlBody": "<p>Interesting question. I think in outreach we have some big advantages over the Victorian era. A modern day Dorothea would be able to google her questions! I think having a welcoming accessible site and community are a good first step, but maybe we also need to work harder at capturing people's imaginations. </p>\n", "parentCommentId": "SPrzPgDbiXnwn4yYc", "user": {"username": "Bernadette_Young"}}, {"_id": "FQT36ghNKdd727aL7", "postedAt": "2015-01-27T16:53:42.213Z", "postId": "TsbLgD4HHpT5vrFQC", "htmlBody": "<p>I loved this piece. Between this and Jeff Kaufman's discussion of John Wesley, founder of the Methodist movement, it makes me wonder how many other effective altruists there are in history. </p>\n", "parentCommentId": null, "user": {"username": "William_MacAskill"}}, {"_id": "BQtmRbQ3oueyyQ7AM", "postedAt": "2015-01-28T01:33:07.669Z", "postId": "TsbLgD4HHpT5vrFQC", "htmlBody": "<p>That Dorothea so closely resembles an effective altruist is not all that surprising, historically. George Eliot edited and wrote for the Westminster Review, a progressive journal established by Jeremy Bentham, and circulated in a milieu of Victorian high culture counting J.S. Mill and Herbert Spencer among its members. As did her husband, George Henry Lewes - a philosopher. I should also perhaps clarify that insofar Eliot spoke of utilitarianism herself, it was mostly negatively.</p>\n<p>In any case, that a notional effective altruist is the moral core in one of the putatively greatest texts of the nineteenth century is to be celebrated, and of great affective potential.</p>\n", "parentCommentId": null, "user": {"username": "Geuss"}}, {"_id": "EhA54rq9RsvjafQZE", "postedAt": "2015-01-28T04:37:31.312Z", "postId": "TsbLgD4HHpT5vrFQC", "htmlBody": "<blockquote>\n<p>A modern day Dorothea would be able to google her questions!</p>\n</blockquote>\n<p>Good point.  I wonder if any of the major EA outreach orgs are doing SEO (essentially finding common search queries that indicate someone is looking for what you have, then generating content for your site so Google will likely present it in response to their searches.  For example, right now when I google for &quot;how to save lives most efficiently&quot;, I don't see any results that seem good.  Creating a web page with &quot;how to save lives most efficiently&quot; as the title might be able to change that.)</p>\n", "parentCommentId": "Wh6yon689SwznnLhv", "user": {"username": "John_Maxwell_IV"}}, {"_id": "jnkj6RcBbtvRt32JQ", "postedAt": "2015-01-28T13:23:29.712Z", "postId": "TsbLgD4HHpT5vrFQC", "htmlBody": "<p>Thanks Will! I'm interested to hear Jeff's take on the methodists - do you know if he's written it down anywhere?</p>\n", "parentCommentId": "FQT36ghNKdd727aL7", "user": {"username": "Bernadette_Young"}}, {"_id": "hwhSaKSojqn9ivWmd", "postedAt": "2015-01-29T01:18:04.186Z", "postId": "TsbLgD4HHpT5vrFQC", "htmlBody": "<p>Here is Jeff's post about John Wesley: <a href=\"http://www.jefftk.com/p/history-of-earning-to-give-iii-john-wesley\">http://www.jefftk.com/p/history-of-earning-to-give-iii-john-wesley</a></p>\n<p>If you have any questions about the Methodist church, feel free to ask - I am a United Methodist.</p>\n", "parentCommentId": "jnkj6RcBbtvRt32JQ", "user": {"username": "Andy_Schultz"}}, {"_id": "iQBHBwhuX4rHFnAKX", "postedAt": "2015-01-29T03:06:43.073Z", "postId": "TsbLgD4HHpT5vrFQC", "htmlBody": "<p>&quot;some people have argued that the relatively small number of women in EA arise from women being innately or culturally less likely to hold these views.&quot;</p>\n<p>On this I was interested to find out that there is no gender difference in responses to the original trolly problem (would you divert the trolley from a track with five people on it to a track with one person). There was however a gender difference in enthusiasm for a different question which involved more conspicuously doing harm (would you push a fat man off a bridge to stop the train). Whether this is picking up differences in utilitarian attitudes as suggested in the paper, or rather just that men are actually less morally concerned, or physically stronger - and so have fewer reservations about the idea of pushing someone off a bridge - is an open question. There was a recent paper finding that both utilitarians and people with generally low moral concern gave superficially 'utilitarian' answers to trolley problems, but only the former would go on to accept personal sacrifices to help others.</p>\n<p>In any case, as the vast majority of things effective altruists do only require the attitude in the first question - willingness to prioritise benefits, rather than willingness to harm a specific person - this seems like a point in favour of the idea we could get close to an even gender balance without softening the core idea of prioritisation.</p>\n<p>It is weak evidence that men might be more willing to do things they regard as directly harmful (for example, some people view working in finance as immoral in itself) for a greater good. But that only covers a small fraction of all the paths we suggest.</p>\n<p>Source: <a href=\"http://www.researchgate.net/publication/26787145_Gender-related_differences_in_moral_judgments\">http://www.researchgate.net/publication/26787145_Gender-related_differences_in_moral_judgments</a></p>\n", "parentCommentId": null, "user": {"username": "Robert_Wiblin"}}, {"_id": "pZPMrNL9AnHspXgKW", "postedAt": "2015-01-29T11:38:32.016Z", "postId": "TsbLgD4HHpT5vrFQC", "htmlBody": "<p>Idea: \nSet up a new EA group with a specifically christian / muslim / whatever (but I think we have enough christians to start a christian one) morality/theological grounding and reach out to churches through talks (v easy to do, and marginal returns to sunday mornings are usually pretty low)\nSame might be able to be done with a womens branding: then you could get on to women's hour etc.? </p>\n", "parentCommentId": "SPrzPgDbiXnwn4yYc", "user": {"username": "tomstocker"}}, {"_id": "cmBydrdS9pDeGbgmm", "postedAt": "2015-01-29T11:39:54.280Z", "postId": "TsbLgD4HHpT5vrFQC", "htmlBody": "<p>Absolutely loved reading this. Thank you.</p>\n<p>Does anyone else feel like EA thinking /personality takes them in this direction:\n&quot;Dorothea finds no 'epic life' and is eulogised as a 'foundress of nothing' whose efforts 'are dispersed among hindrances, instead of centring in some long-recognisable deed.'&quot;</p>\n<p>when perhaps modern society and the structure of fame in such a big world works in favour of those with an 'epic' narrative that is easily accessible?</p>\n", "parentCommentId": null, "user": {"username": "tomstocker"}}, {"_id": "yPXTerS9zg5gsXdkY", "postedAt": "2015-01-29T11:55:24.781Z", "postId": "TsbLgD4HHpT5vrFQC", "htmlBody": "<p>What about other seminal Christians?\n-Frys, Rowntrees?</p>\n<p>The fabled buddhist monk that apparently persuaded King Ashoka to do what he could for his population?</p>\n<p>Then, there are loads of politicians, scientists and doctors that have applied themselves and DONE a great deal of good, or thought about ways to improve the practice of medicine. The aim to help the most patients seems to have driven many of them, but its hard to tell whether they're EAs or whether that matters?</p>\n", "parentCommentId": "FQT36ghNKdd727aL7", "user": {"username": "tomstocker"}}, {"_id": "qZ49zSLgkfb27fowt", "postedAt": "2015-01-30T20:56:19.959Z", "postId": "TsbLgD4HHpT5vrFQC", "htmlBody": "<p>It is indeed interesting that George Eliot had such an intersection with Mill, but as you say she is emphatically not utilitarian. </p>\n<p>Yes, while there is much new (and exciting) in effective altruism, I thinks it's useful to understand how we might link to the past</p>\n", "parentCommentId": "BQtmRbQ3oueyyQ7AM", "user": {"username": "Bernadette_Young"}}, {"_id": "zmob4NMA2eHgcCW6E", "postedAt": "2015-01-30T21:05:00.107Z", "postId": "TsbLgD4HHpT5vrFQC", "htmlBody": "<p>I think that western society in general privileges narratives about individual achievement, as well as it being a prominent feature of celebrity culture etc.  I suspect that this is such a difference to the norm that we do better to embrace as a difference, if that makes sense. for myself, I'm heartened by an idea that says 'nope, it's not about the giver, it's about the beneficiaries.'  </p>\n<p>Then again sometimes I crunch the numbers (like the fact I've personally funded the deworming of over 100,000 children. Then I feel like a goddamm superhero :)</p>\n", "parentCommentId": "cmBydrdS9pDeGbgmm", "user": {"username": "Bernadette_Young"}}, {"_id": "6GGiymD3dGRJZRKam", "postedAt": "2015-02-01T17:31:57.106Z", "postId": "TsbLgD4HHpT5vrFQC", "htmlBody": "<p>We're doing that for career related questions at least, and 'what are the biggest problems in the world'. There's still a lot more work to be done. We've focused on those with the most traffic first, rather than stuff like 'how to save lives most efficiently', though you might get some interesting people in those even if there's only like 5 per month!</p>\n", "parentCommentId": "EhA54rq9RsvjafQZE", "user": {"username": "Benjamin_Todd"}}, {"_id": "RGP5wZqw6xWKuRJFS", "postedAt": "2015-02-04T20:06:10.005Z", "postId": "TsbLgD4HHpT5vrFQC", "htmlBody": "<p>Yes. Absolutely. And you are obviously a goddamm superhero :) </p>\n<p>The implicit question was whether we could be more effective with a public profile, usually these are built around one narrative and changed maybe once or twice. I think Toby, WIll, Peter have this and as a result seem to have better opportunities to serve / focus on the beneficiaries?</p>\n<p>I'm thinking that this is particularly important for people trying to solve big tractable problems with multiple interested parties hardly interested in EA?</p>\n", "parentCommentId": "zmob4NMA2eHgcCW6E", "user": {"username": "tomstocker"}}, {"_id": "oAzyJ5Ce3SBTCzhrd", "postedAt": "2022-10-05T23:08:11.106Z", "postId": "TsbLgD4HHpT5vrFQC", "htmlBody": "<p>This is wonderfwl. Thank you for writing this.</p>", "parentCommentId": null, "user": {"username": "Emrik"}}]