[{"_id": "tciquwQhGn3wkTEFf", "postedAt": "2022-10-19T06:41:07.221Z", "postId": "TufFm4P4kkxFBFf7s", "htmlBody": "<p>I really like the reframing as \"karma farming\". It is its own messaging niche that will appeal to a different set of people compared to more traditional EA messaging styles, and I'd optimistic about it for that reason.<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefu2j1f7ze53f\"><sup><a href=\"#fnu2j1f7ze53f\">[1]</a></sup></span></p><p>I also just personally like your aesthetic of trying not to appear so professional and serious that you can't use gummy-bear metaphors. Appealing to an intersection of niches makes sure that it appeals very strongly <i>to someone</i>, and that's what's required to get them over the threshold to read more or take actions.</p><p>Another reason I like is it that... personally, I've been trying to become a person who doesn't care about \"being\" a good person, and who purely cares about producing good consequences regardless of what kind of aesthetic or moral character that makes me. I'm not <i>fundamentally </i>trying to optimise myself, only the world. But this mindset is also really hard, because it makes it hard for me to feel good about myself when I do good.</p><p>The \"only care about consequences\" mindset has its advantages, such as it being harder to <a href=\"https://www.lesswrong.com/posts/EbFABnst8LsidYs5Y/goodhart-taxonomy\">goodhart </a>on, but if it doesn't provide the sustainable motivation I need to do good longterm, then it's not good enough. \"Karma farming\" mindset seems more sustainable, as long as one frequently checks to make sure that one perception of what \"karma\" means doesn't diverge from doing what actually makes the world better (e.g. because it ends up attaching to a proxy like 'maximise this QALY metric').</p><blockquote><p>\"If someone could name one influencer group living an EA lifestyle that would be amazing because I would like to follow them.\"</p></blockquote><p>What is an \"influencer group\"? Idk if I don't know the answer to this question.</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnu2j1f7ze53f\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefu2j1f7ze53f\">^</a></strong></sup></span><div class=\"footnote-content\"><p>Btw! Are you the person I spoke to in Gather Town a ~month ago? I spoke to someone talking about karma farming back then at least :D<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnref5cs2b0r7ymt\"><sup><a href=\"#fn5cs2b0r7ymt\">[2]</a></sup></span></p></div></li><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fn5cs2b0r7ymt\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnref5cs2b0r7ymt\">^</a></strong></sup></span><div class=\"footnote-content\"><p>Oh, and there seems to be broken images in the forum post that you might wish to edit in. They work on the website.</p></div></li></ol>", "parentCommentId": null, "user": {"username": "Emrik"}}]