[{"_id": "YMoD6Qgpiqx2Mgr7g", "postedAt": "2023-10-03T09:01:02.420Z", "postId": "TukSsn2Aur6RcLHyt", "htmlBody": "<blockquote>\n<p>My views are that (a)the current approach to EA community building strategy is not in tandem with exogenous realities. 99 percent of the prospective community members who would have a significant impact in their lives are in low and middle income countries. (b) Attending EA Global conferences from low and middle income countries might not be the best use of money. (c)There is a need to encourage local cause prioritization in low income countries in order to have effective impacts. (d) Funding restrictions are also a great obstacle to EA community growth in Africa. (e)Moreover decolonizing the minds of African EAs is an important step in encouraging divergent ideological and philosophical perspectives. Scholarship and wisdom exist everywhere</p>\n</blockquote>\n<p>I suspect it would be better to separate these points into different posts, or put them under different headings. This is quite a large scope to cover, and it left me not necessarily able to identify key points, cruxes and supporting evidence.</p>\n", "parentCommentId": null, "user": {"username": "ElliotJDavies"}}, {"_id": "KhCB9vkWAgYnHdocD", "postedAt": "2023-10-03T09:24:00.300Z", "postId": "TukSsn2Aur6RcLHyt", "htmlBody": "<p>Thanks Alimi you make a lot of interesting points, and thanks for venting your frustration,.</p><p>One point you make that I agree on, is that I think locally driven cause identification can be really valuable and is heavily underrated by the EA community. People who have lived in a place a long time have the ability to see problems and ideas that can't be easily identified on the internet from afar, and I think EA could generate a lot of value by asking practitioners from low income countries about what causes/interventions might be cost effective.</p><p>Where we might disagree though, in that I think that 95%+ of these causes will fail to meet the EA bar for action, but some of them at least will be causes that the EA community could get stuck into funding and working on.</p><p>I also agree that dealing with root causes of problems is theoretically better, but there has been a long history of aid and development initiatives which have tried and failed to address many of these causes. I think EAs are very open to \"root cause\" fixing, but the problem is it is often unclear how to implement tractable change in many of these issues. Maybe you could suggest some possible fixes for root causes for discussion? One interesting solution of fixing a root cause problem for example is <a href=\"https://copenhagenconsensus.com/halftime-sustainable-development-goals-2016-2030/e-government-procurement\">e-procurement</a> to reduce corruption, which some African countries are already doing and I think has a lot of potential.</p><p>A small question - becoming a lawyer must be cheaper in Nigeria than in Uganda. Travel to Boston from Nigeria + accommodation (cost maybe $2000) would only pay for 1 year of law school here in Uganda, how much is it in Nigeria?</p>", "parentCommentId": null, "user": {"username": "NickLaing"}}, {"_id": "4xDvPg2Yz3zwLNkER", "postedAt": "2023-10-03T13:46:48.873Z", "postId": "TukSsn2Aur6RcLHyt", "htmlBody": "<blockquote>\n<p>99 percent of the prospective community members who would have a significant impact in their lives are in low and middle income countries.</p>\n</blockquote>\n<p>I think this is false. According to <a href=\"https://www.gapminder.org/ignorance/ignorance-test/results/question-2/\">gapminder</a> (first google hit for the question), 16% of world population lives in high income countries (USA alone has &gt;4%). I do not think that these countries only have 1% of the people who would have a significant impact in their lives.</p>\n", "parentCommentId": null, "user": {"username": "harfe"}}, {"_id": "gmrQFHAv99mk35oko", "postedAt": "2023-10-03T14:19:46.430Z", "postId": "TukSsn2Aur6RcLHyt", "htmlBody": "<blockquote>\n<p>How many of us in this community will support a military takeover in a poorly governed African country? Of course, democracy has become the only yardstick with which we categorize legitimate governments and regular elections have become the vital signs of good democracies. But how much is looted and wasted in our cyclical and farcical elections every four years? I think the time has come to calculate the cost of holding regular elections in Africa and compare it with the cost of running a country under a military regime.</p>\n</blockquote>\n<p>Am I understanding correctly that you wish more EAs would support a military takeover of a poorly governed African country?</p>\n<p>If so, I would like to state that EAs putting significant resources into a military takeover of an African country is a bad idea. I might be biased here due to my pro-democracy views, but I would expect that life is on average more unpleasant in a military regime around the globe, not just in the west. You would need to be quite lucky that the military leaders care enough about the country and are competent in running it.</p>\n<p>It is fine to do a cost comparison of holding elections and running a military regime, but I have high priors for this case and would prefer that cost effectiveness analyses are run for less obvious questions.</p>\n", "parentCommentId": null, "user": {"username": "harfe"}}, {"_id": "q7FopByoFKZbxDENf", "postedAt": "2023-10-03T14:57:22.998Z", "postId": "TukSsn2Aur6RcLHyt", "htmlBody": "<p>Thanks you <a href=\"https://forum.effectivealtruism.org/users/harfe?mention=user\">@harfe</a> &nbsp;for refuting my claim. I think what I meant &nbsp;is quite ambiguous and debatable. The point is: given the number of people available in those countries willing to dedicate their time and energy to doing the most good and the number of people who would ultimately benefit from such community members, the percentage is higher than the number of people available( in the developed countries) &nbsp;willing to dedicate the same amount of time and energy and the number of beneficiaries.&nbsp;</p>", "parentCommentId": "4xDvPg2Yz3zwLNkER", "user": {"username": "Alimi"}}, {"_id": "FLEgdFd8kY3AdyBzq", "postedAt": "2023-10-03T14:57:51.047Z", "postId": "TukSsn2Aur6RcLHyt", "htmlBody": "<p>Thanks <a href=\"https://forum.effectivealtruism.org/users/nicklaing?mention=user\">@NickLaing</a> &nbsp;for sharing your perspectives. I agree with you all on counts.&nbsp;</p><p>However, I see &nbsp;we are missing the point where the \"EA Bar for action\" fail to rake in some highly neglected and promising causes but with low scale or scope. Also, aid and development initiatives &nbsp;seem to have failed because of the top down approaches employed. For instance, when I was a translator and interpreter working on a <a href=\"https://www.jica.go.jp/english/\">JICA</a> sponsored project for the construction and equipment of primary schools in the Republic of Benin, I noticed an innovation in Japanese approach to <a href=\"https://www.oecd.org/dac/financing-sustainable-development/development-finance-standards/official-development-assistance.htm\">ODA </a>. It consisted of assisting local people &nbsp;based on what the communities needed and allowing them to take ownership of the project/assistance. It has a really worked then. Prior to this new approach, schools were built and equiped in remote place without consulting the beneficiaries or engaging local authorities</p><p>On possible fixes for root causes discussion, I would welcome the opportunity to have a chat with you some day and even make it a recurring activities if all interested parties find it worthwhile.</p><p>About the cost of law school in Nigeria, it depends on where one is running the program( I am having mine in Lagos) and some other factors such as being a special student or regular student. I am a special student given my civil law family background ( having studied law in a Francophone country: Republic of Benin) . And, most importantly to be a high impact lawyer, it is a huge investment.</p>", "parentCommentId": "KhCB9vkWAgYnHdocD", "user": {"username": "Alimi"}}, {"_id": "cHCWM44kWdyGJMRfp", "postedAt": "2023-10-03T15:03:32.525Z", "postId": "TukSsn2Aur6RcLHyt", "htmlBody": "<p>Thank you <a href=\"https://forum.effectivealtruism.org/users/elliotjdavies?mention=user\">@ElliotJDavies</a> for the suggestion. I agree with you and I hope to figure it out.</p>", "parentCommentId": "YMoD6Qgpiqx2Mgr7g", "user": {"username": "Alimi"}}, {"_id": "mfKap5rodqkRTBnjZ", "postedAt": "2023-10-03T15:54:43.986Z", "postId": "TukSsn2Aur6RcLHyt", "htmlBody": "<p>Hi again <a href=\"https://forum.effectivealtruism.org/users/harfe?mention=user\">@harfe</a> thanks for your engaging and stimulating comments. I am by all means not supporting military take over because of the frailty of human nature and its tendency to abuse power absolutely. I believe in the rule of law and I still have some hope in democracy. But the main point here is the word \"demo\" in democracy is merely a smokescreen meant to hide the real few power holding people in any given country against the interests of the majority. Categorically, EAs putting resources in military takeover is suicidal. I just want to point out that we are currently experiencing democratic backsliding in the whole of Africa not because of military take over but because of some undue influence in our democratic processes. &nbsp;The current bad democratic lock- I mean where the Executive &nbsp;arm of the government is overbearingly wielding unrestrained power over other arms of government is worse than a military regime.</p><p>&nbsp;On the other hand, we have seen military regimes in Africa under <a href=\"https://en.wikipedia.org/wiki/Thomas_Sankara\">Thomas Sankara</a> of Burkina Faso and &nbsp;<a href=\"https://en.wikipedia.org/wiki/Jerry_Rawlings\">Jerry Rawlings</a> of Ghana who cared enough about their countries and the people gave hope to their countrymen. &nbsp;Finally, I would like to quote <a href=\"https://www.eui.eu/Documents/DepartmentsCentres/SPS/ResearchAndTeaching/How-Democracies-Die.pdf\">STEVEN LEVITSKY &amp; DANIEL ZIBLATT</a> :</p><blockquote><p>Democraices may die at the hands not of generals but of elected leaders - presidents or prime ministers who subvert the very process that brought them to power. Some of the leaders dismantle democracy quickly, as Hitler did in the wake of the 1933 <a href=\"https://en.wikipedia.org/wiki/Reichstag_fire\">Reichstag fire</a> in Germany.</p></blockquote><p>The above quote captures what I call \"bad democratic lock-in\" and it takes local military takeover in African context to restore decent democratic processes for the benefits of the people not the elites and their cronies within and without.&nbsp;</p><p>&nbsp;Support here means not distancing ourselves from discussing the merit or demerits of an usual phenomenon.&nbsp;</p>", "parentCommentId": "gmrQFHAv99mk35oko", "user": {"username": "Alimi"}}, {"_id": "j2C7JpPdfusSD6eSX", "postedAt": "2023-10-03T15:55:17.944Z", "postId": "TukSsn2Aur6RcLHyt", "htmlBody": "<p>Thanks for sharing your thoughts and frustrations - I'm very curious to learn more about LMIC perspectives! I have the following reflections that agree with some aspects of your points while potentially disagreeing with others:</p><ul><li>It's important to consider how to adapt cause prioritization to the local context. E.g., there may be something to prioritizing basic infrastructure, and the urgency of problems can be very significant. However, some issues seem to be particularly big and of a global scale in a way that are surprisingly weird and hard to fully grasp (certainly took me a long time and I still have a lot to learn). These include existential risks from AI and pandemics that could affect <strong>all</strong> of us and future generations.</li><li>Using contextualized sources that communicate the core ideas and claims to a broader audience makes sense. I'm reminded of <a href=\"https://forum.effectivealtruism.org/posts/NYxaxLZS5tiiyiHnG/a-full-syllabus-on-longtermism\">this curricula</a>. That said, I think ideas should come first. While diversity is important, it shouldn't be prioritized over the core ideas.<br>&nbsp;</li></ul>", "parentCommentId": null, "user": {"username": "SebastianSchmidt"}}, {"_id": "v244GuNAvKKZQQoqp", "postedAt": "2023-10-03T16:43:45.337Z", "postId": "TukSsn2Aur6RcLHyt", "htmlBody": "<p>Thank you <a href=\"https://forum.effectivealtruism.org/users/sebastianschmidt?mention=user\">@SebastianSchmidt</a> for your reflections. Definitely there are some real big issues that can only be tackled on a global scale while adapting others to local context may significantly make a big difference. As to the primacy of core ideas over diversity , I find it as chicken or the egg dilemma. &nbsp;Thanks for sharing the curricula. I would be glad to take a virtual coffee with you and chat about my panoramic views on LMIC.</p>", "parentCommentId": "j2C7JpPdfusSD6eSX", "user": {"username": "Alimi"}}, {"_id": "4vw4xysaEds8NcJjE", "postedAt": "2023-10-03T17:11:26.132Z", "postId": "TukSsn2Aur6RcLHyt", "htmlBody": "<p>My understanding of history says that usually letting militaries have such power, or initiating violent overthrow via any other means to launch an internal rebellion leads to bad results. Examples include the French, Russian, and English revolutions. Counterexamples possibly include the American Revolution, though notably I struggle to point to anything concrete that would have been different about the world had America had a peaceful break off like Canada later on did.</p>\n<p>Do you know of counter-examples, maybe relating to poor developing nations which after the rebellion became rich developed nations?</p>\n", "parentCommentId": "mfKap5rodqkRTBnjZ", "user": {"username": "D0TheMath"}}, {"_id": "LJaX85yEx7EgGCKv9", "postedAt": "2023-10-05T09:16:51.381Z", "postId": "TukSsn2Aur6RcLHyt", "htmlBody": "<p>Thanks @ DOTheMath  for sharing your understanding of the history of revolutions and military coups. You mentioned \"revolution\" which is categorically different from \" military coups\". Since revolutions usually had  the support of both the middle class and the lower class including some portions of the elites, definitely they produced systemic changes and improved governance. Remember, most of the revolutions you mentioned succeeded because they were no or little vested interested to thwart the outcome of such revolutions as we see with the subversive meddling of an international syndicates in African contexts. Burkina Faso under Sankara was on it way to development, but he was coldly assassinated because it would be a bad precedent and insult for pro-democrats in the West to have a military regime offer better alternative for development. In the history of coups in Africa, 60 % of them had been orchestrated by foreign powers ( France in Central African Republic, Chad, Togo, DRC , Gabon while the US seems to be discreet and diplomatic in its support for military takeover see the recent coup in Never Republic). The point about this failure is due to the fact that vested interests would start threatening to sanctions such regimes, thus not allowing them achieve their mission: offer viable alternative. Conclusion , military takeovers are not intrinsically bad as evidenced in the support their received in some cases where what is now called a palace coup is orchestrated to remove a democratically elected president by the support and approval of Western governments. What do you say of the ousting of Muhammad Morsi of Egypt?\nOverall, the last time I checked,  I saw no real democracy anywhere in the world. Let's take the United States of America for instance. How many political parties exist there? How many of them determine the federal policies? How many democracies embrace multiparty system? Majorly, we are having weak coalitions hiding behind single party system draining democracy of its substance.</p>\n<p>Finally, I would rather we have revolution in Africa, where African peoples rise up against bad governance and foreign interferences in the domestic affairs of various African countries. Recently, we saw how the United States institutions reacted to Russian meddling in their electoral process under Trump. This same scenario has not allowed development under military takeover or democratic governments in Africa. A question I would love to ask: do you objectively believe that democracy is a gateway to development, of course development is such a vague term with varying definitions? If yes, show me a developed and independent country practicing democracy in developing countries that attained such level as seen in the Global North.</p>\n", "parentCommentId": "4vw4xysaEds8NcJjE", "user": {"username": "Alimi"}}]