[{"_id": "NjgDbEfcm6HWkCZoB", "postedAt": "2017-08-29T21:41:28.604Z", "postId": "TuzkYANf7tmQDF2Hk", "htmlBody": "<p>Thanks for doing this! It's very difficult to figure out what the right way of sampling EAs is since it's unclear how you define an EA. Is it someone who acts as an EA or identifies as one? How much altruism (donations, volunteering) etc. is required and how much effectiveness (e.g. being cause-neutral versus just seeking to be effective within a cause) is required?</p>\n<p>Just by skimming this, it strikes me that SSC is overrepresented, I'm guessing because of the share of the survey being more salient there and having an overall large readership base. Facebook seems overrepresented too, although I think that's less of an issue since the SSC audience has its own culture in the way that EAs on Facebook probably do not. I do wonder if there would be a way to get better participation from EA organizations' audiences, as I think that's probably the best way to get a picture of things, and I imagine the mailing lists are not very salient. (I don't remember the survey link and am on several of those mailing lists.)</p>\n", "parentCommentId": null, "user": {"username": "zdgroff"}}, {"_id": "r5b3EKYBmpmPTY2Ju", "postedAt": "2017-08-29T23:34:23.420Z", "postId": "TuzkYANf7tmQDF2Hk", "htmlBody": "<p>You make some really good points about how tricky it is to sample EA, not the least because defining &quot;EA&quot; is so hard. We don't have any good information to reweigh the population of the survey, so it's hard to say if our populations are over- or underrepresented, though I would agree with your intuitions.</p>\n<blockquote>\n<p>I don't remember the survey link and am on several of those mailing lists.</p>\n</blockquote>\n<p>For one example, <a href=\"http://i.imgur.com/FhGBhBL.gif\">we did have an entire EA Newsletter dedicated solely to the EA Survey</a> -- I'm not sure how to make it more apparent without being obnoxious. I am a bit surprised by how few sign-ups we got through the EA Newsletter. I do agree that the inclusion in some of the other newsletters was more subtle.</p>\n", "parentCommentId": "NjgDbEfcm6HWkCZoB", "user": {"username": "Peter_Hurford"}}, {"_id": "zPf8wZ4n7nqWLLpws", "postedAt": "2017-08-30T02:59:04.192Z", "postId": "TuzkYANf7tmQDF2Hk", "htmlBody": "<p>For reference, the question we used for people to self-identify as an EA (and be included in the analysis) was:</p>\n<p>Could you, however loosely, be described as &quot;an Effective Altruist&quot;? Please answer “Yes” if you are broadly in agreement with the core ideas associated with Effective Altruism, even if you don’t like applying the term to yourself (e.g. because it sounds presumptuous or you are an “aspiring Effective Altruist”).</p>\n", "parentCommentId": "NjgDbEfcm6HWkCZoB", "user": {"username": "Ellen"}}, {"_id": "PPgacgXdoNAzsKtvw", "postedAt": "2017-08-30T06:23:25.297Z", "postId": "TuzkYANf7tmQDF2Hk", "htmlBody": "<blockquote>\n<p>This year, a “Donations Only” version of the survey was created for respondents who had filled out the survey in prior years. This version was shorter and could be linked to responses from prior years if the respondent provided the same email address each year.  </p>\n</blockquote>\n<p>Are these data from prior surveys included in the raw data file, for people who did the Donations Only version this year? At the bottom of the raw data file I see a bunch of entries which appear not to have any data besides income &amp; donations - my guess is that those are either all the people who took the Donations Only version, or maybe just the ones who didn't provide an email address that could link their responses.</p>\n", "parentCommentId": null, "user": {"username": "Dan_Keys"}}, {"_id": "RQjuXzd7BLxXRPtjd", "postedAt": "2017-08-30T12:55:35.184Z", "postId": "TuzkYANf7tmQDF2Hk", "htmlBody": "<blockquote>\n<p>Are these data from prior surveys included in the raw data file, for people who did the Donations Only version this year?</p>\n</blockquote>\n<p>All the raw data for all the surveys for all the years are here: <a href=\"https://github.com/peterhurford/ea-data/tree/master/data\">https://github.com/peterhurford/ea-data/tree/master/data</a>. We have not yet published a longitudinal linked dataset for 2017, but will publish that soon.</p>\n<blockquote>\n<p>At the bottom of the raw data file I see a bunch of entries which appear not to have any data besides income &amp; donations - my guess is that those are either all the people who took the Donations Only version</p>\n</blockquote>\n<p>Those are the people who took the Donations Only version.</p>\n", "parentCommentId": "PPgacgXdoNAzsKtvw", "user": {"username": "Peter_Hurford"}}, {"_id": "gmEEYSbeYDcCr68qy", "postedAt": "2017-08-30T15:42:24.235Z", "postId": "TuzkYANf7tmQDF2Hk", "htmlBody": "<blockquote>\n<p>Those are the people who took the Donations Only version.</p>\n</blockquote>\n<p>We thought this would streamline things, but it's not entirely clear that it's worth doing for 2018</p>\n", "parentCommentId": "RQjuXzd7BLxXRPtjd", "user": {"username": "Tee"}}, {"_id": "rfkSKQcBMsRDgcKuy", "postedAt": "2017-08-30T16:56:25.057Z", "postId": "TuzkYANf7tmQDF2Hk", "htmlBody": "<p>Yeah, upon reflection I don't think the problem is how the survey is presented in a newsletter but whether people read the newsletter at all. Most newsletters end up in the promotions folder on Gmail and I imagine a similar folder elsewhere. What I've found in the past is you have to find a way to make it appear as a personal email (not have images or formatting, for example, and use people's names), and that can get around it sometimes.</p>\n", "parentCommentId": "r5b3EKYBmpmPTY2Ju", "user": {"username": "zdgroff"}}, {"_id": "bad7H7yh3zqhNL7SZ", "postedAt": "2017-08-30T17:03:05.031Z", "postId": "TuzkYANf7tmQDF2Hk", "htmlBody": "<blockquote>\n<p>What I've found in the past is you have to find a way to make it appear as a personal email (not have images or formatting, for example, and use people's names), and that can get around it sometimes.</p>\n</blockquote>\n<p>We did also send 1-1 personal emails to everyone who gave an email address for past surveys, though we only got three survey completions from this. Maybe we did something wrong here?</p>\n", "parentCommentId": "rfkSKQcBMsRDgcKuy", "user": {"username": "Peter_Hurford"}}, {"_id": "4jHF6B582o8zwDbFa", "postedAt": "2017-08-30T18:38:24.754Z", "postId": "TuzkYANf7tmQDF2Hk", "htmlBody": "<p>I believe the 1-1 personal emails were still sent through a mail service. In my experience (from being the sender for similar emails) those still get caught in promotions or spam a lot of the time.</p>\n<p>A solution for this would be to send &quot;normal&quot; emails (not bulk, no images) from a &quot;normal&quot; email address (like Gmail). I'll definitely consider this for the 2018 survey.</p>\n", "parentCommentId": "bad7H7yh3zqhNL7SZ", "user": {"username": "Ellen"}}]