[{"_id": "4nDGk288fjj3hMruB", "postedAt": "2022-10-29T03:49:43.837Z", "postId": "TXKnkxXdYHaH6jBDq", "htmlBody": "<p>Hi Blaine. Interesting idea, but it is still basically asking permission to exist in ‘their’ world. You don’t seem taken with crypto technology, but it is here, spreading faster than a fungus and enabling real world experiments in friction free and completely malleable value exchange. It’s pretty exciting.<br><br>To me, the ability to be verifiably unique changes the equation Completely. It is within grasp for us to create a mechanism that ensures complete and total human sovereignty - as the basic framework. From that moment forward, the systems more or less build themselves and everything can grow.<br><br>From governance and democratization, to market forces and invasive data harvesting, the landscape shifts 180º when everything is responding to ‘user needs’ directly. &nbsp;It is also the most efficient way to provide ‘aid’ of any kind and to self organize in any situation with 100% regionally appropriate responses.<br><br>A ‘parallel universe’ becomes instantly available that can interact everywhere but under the sole control of you, on ‘your’ chain.<br><br>There is no other way, and everything else can’t be fixed. But it’s definitely not a matter of permission anymore.<br><br>&nbsp;</p>", "parentCommentId": null, "user": {"username": "omdesign"}}, {"_id": "6sAQ3QB2cEyjTiw76", "postedAt": "2022-10-29T09:08:54.969Z", "postId": "TXKnkxXdYHaH6jBDq", "htmlBody": "<p>Anecdote regarding news media: I donate monthly to the national newspaper Shakuf, run by a non-profit and funded exclusively by small donors like me, nicknamed \"publishers\" (and is ad-free). It's not a cooperative per se, but big decisions are decided by majority vote among those publishers; Decisions like \"should we merge with this other news org\" or \"Which area should the new reporter cover\". It works pretty well and I think publishers are happy! As an example, we <em>did</em> merge with that other org, which required recruiting thousands more publishers in order for it to transition to the same model - and those indeed came.</p>\n", "parentCommentId": null, "user": {"username": "Guy Raveh"}}]