[{"_id": "LZ76GZdJCrk7sHpHY", "postedAt": "2022-09-22T19:35:39.067Z", "postId": "TxrzhfRr6EXiZHv4G", "htmlBody": "<blockquote><p>A paperclip maximiser and a pencil maximiser cannot “agree to disagree”. One of them will get to tile the universe with their chosen stationery implement, and one of them will be destroyed. They are mortal enemies with each other, and both of them are mortal enemies of the stapler maximiser, and the eraser maximiser, and so on. Even a different paperclip maximiser is the enemy, if their designs are different. The plastic paperclipper and the metal paperclipper must, sooner or later, battle to the death.&nbsp;</p><p>The inevitable result of a world with lots of different malevolent AGI’s is a bare-knuckle, vicious, battle royale to the death between every intelligent entity. In the end, only one goal can win. &nbsp;</p></blockquote><p>Are you familiar with the concept of values handshakes? An AI programmed to maximize red paperclips and an AI programmed to maximize blue paperclips and who know that each would prefer to destroy each other might instead agree on some intermediate goal based on their relative power and initial utility functions, e.g. they agree to maximize purple paperclips together, or tile the universe with 70% red paperclips and 30% blue paperclips.</p>", "parentCommentId": null, "user": {"username": "robirahman"}}, {"_id": "2Gt6Fa4KfcapFdtsG", "postedAt": "2022-09-22T22:05:18.966Z", "postId": "TxrzhfRr6EXiZHv4G", "htmlBody": "<p>Related: <a href=\"https://www.jstor.org/stable/2706903\">Fearon 1995</a> from the IR literature. Basically, rational actors should only go to war against each other in a fairly limited set of scenarios.&nbsp;</p>", "parentCommentId": "LZ76GZdJCrk7sHpHY", "user": {"username": "Linch"}}, {"_id": "AMow4BhFo23jSGruy", "postedAt": "2022-09-23T01:48:59.248Z", "postId": "TxrzhfRr6EXiZHv4G", "htmlBody": "<p>+1 on this being a relevant intuition. I'm not sure how limited these scenarios are - aren't information asymmetries and commitment problems really common?</p>\n", "parentCommentId": "2Gt6Fa4KfcapFdtsG", "user": {"username": "Mauricio"}}, {"_id": "rFhAfaaqMHDnyhT3b", "postedAt": "2022-09-23T03:28:42.315Z", "postId": "TxrzhfRr6EXiZHv4G", "htmlBody": "<p>I agree that they're really common in the current world. I was originally thinking that this might become substantially common in multipolar AGI scenarios (because future AIs may have better trust and commitment mechanisms than current humans do). Upon brief reflection, I think my original comment was overly concise and not very substantiated.</p>", "parentCommentId": "AMow4BhFo23jSGruy", "user": {"username": "Linch"}}, {"_id": "fDvHpGWZHfYJrBqJb", "postedAt": "2022-09-23T03:30:56.723Z", "postId": "TxrzhfRr6EXiZHv4G", "htmlBody": "<p>.</p>", "parentCommentId": "AMow4BhFo23jSGruy", "user": {"username": "Linch"}}, {"_id": "gzdoM6J9Teg7xg5Df", "postedAt": "2022-09-23T04:16:41.701Z", "postId": "TxrzhfRr6EXiZHv4G", "htmlBody": "<p>CLR just published a related sequence:\n<a href=\"https://www.lesswrong.com/posts/oNQGoySbpmnH632bG/when-does-technical-work-to-reduce-agi-conflict-make-a\">https://www.lesswrong.com/posts/oNQGoySbpmnH632bG/when-does-technical-work-to-reduce-agi-conflict-make-a</a></p>\n", "parentCommentId": "LZ76GZdJCrk7sHpHY", "user": {"username": "MichaelStJules"}}, {"_id": "WejmnDx2wd3aL63a6", "postedAt": "2022-09-23T04:17:46.413Z", "postId": "TxrzhfRr6EXiZHv4G", "htmlBody": "<p>Double comment?</p>\n", "parentCommentId": "fDvHpGWZHfYJrBqJb", "user": {"username": "MichaelStJules"}}, {"_id": "LqkYY8rxbnQKkjzqR", "postedAt": "2022-09-23T20:30:16.782Z", "postId": "TxrzhfRr6EXiZHv4G", "htmlBody": "<p>This seems basic and wrong.&nbsp;</p><p>In the same way that two human super powers can't simply make a contract to guarantee world peace, two AI powers could not do so either.&nbsp;</p><p>(Assuming an AI safety worldview and the standard, unaligned, agentic AIs) in the general case, each AI will always weigh/consider/scheme at getting the other's proportion of control, and expect the other is doing the same.</p><p>&nbsp;</p><blockquote><p>based on their relative power and initial utility functions</p></blockquote><p>It's possible that peace/agreement might come from some sort of &nbsp;\"MAD\" or game theory sort of situation. But it doesn't mean anything to say it will come from \"relative power\".&nbsp;</p><p>Also, I would be cautious about being too specific about utility functions. I think an AI's \"utility function\" generally isn't a literal, concrete, thing, like a Python function that gives comparisons , but might be far more abstract, and could only appear from emergent behavior. So it may not be something that you can rely on to contract/compare/negotiate.&nbsp;</p>", "parentCommentId": "LZ76GZdJCrk7sHpHY", "user": {"username": "Charles He"}}, {"_id": "vmgQTdBMfTqvK7tLW", "postedAt": "2023-08-27T20:20:22.623Z", "postId": "TxrzhfRr6EXiZHv4G", "htmlBody": "<p>Today, somewhat, but that's just because human brains can't prove the state of their beliefs or share specifications with each other (ie, humans can lie about anything). There is no reason for artificial brains to have these limitations, and any trend towards communal/social factors in intelligence, or self-reflection (which is required for recursive self-improvement), then it's actively costly to be cognitively opaque.</p>", "parentCommentId": "AMow4BhFo23jSGruy", "user": {"username": "MakoYass"}}]