[{"_id": "Q3QJNa9evnnpb6FCf", "postedAt": "2015-07-21T20:39:27.761Z", "postId": "TXSe2Zqft8238EuA5", "htmlBody": "<blockquote>\n<p>The early morning schedule feels the most virtuous to me and syncs better with the people I care about (and work), but -- as much as I hate to say it -- the late schedule is overall more productive for me and feels better. I’m not really sure why that is.</p>\n</blockquote>\n<p>Have you (or other readers) looked into the research on natural differences on this? Have you ever used a <a href=\"https://en.wikipedia.org/wiki/Zeo,_Inc.\">Zeo</a> when sleeping? (Hmm, I guess that's the sort of question I can only really ask you in written form :S )</p>\n", "parentCommentId": null, "user": {"username": "Tom_Ash"}}, {"_id": "y2SmH7ZQ7zsXNsHRs", "postedAt": "2015-07-21T21:24:29.831Z", "postId": "TXSe2Zqft8238EuA5", "htmlBody": "<p>I haven't really been able to get good research and I think Zeo went out of business (or changed it's name).</p>\n", "parentCommentId": "Q3QJNa9evnnpb6FCf", "user": {"username": "Peter_Hurford"}}, {"_id": "ccJgSBjXormj8fbHv", "postedAt": "2015-07-23T23:17:16.169Z", "postId": "TXSe2Zqft8238EuA5", "htmlBody": "<blockquote>\n<p>My goal for Q2 was to not get too involved in Charity Science or .impact so I could keep my focus. I succeeded in that goal and both organizations ended up doing very well anyway!</p>\n</blockquote>\n<p>That does appear plausible AFAICT, and focus is good. But they might have done even better with more involvement from you! Perhaps it's predictable that when posting to an EA forum you'd get advice to focus more on EA projects (inevitably at the expense of others). Hacker News would doubtless tell you to drop anything EA in favour of laser-like focus on your top secret startup. (Very tantalising! Can you give any hints?)</p>\n<p>AFAICT the Charity Science fundraising experiments have a few full-time people working on them, so maybe there's little you could add as a part-timer, but I don't know how many people would do your .impact work if you didn't? It's great that you've managed volunteers coding some fixes and features for this very forum, but you can only get so much out of volunteers in general.</p>\n", "parentCommentId": null, "user": {"username": "Nekoinentr"}}]