[{"_id": "TD6rRJMLaMR9SaqZa", "postedAt": "2014-09-17T15:50:47.814Z", "postId": "TYEt3ZN8KwcAqQ8Nf", "htmlBody": "<p>Hi everyone! I'm a student at Stanford studying math and computer science. I got into utilitarianism a few years ago, and started thinking about how to apply utilitarian philosophy to life. This led me to the effective altruist community.</p>\n<p>I currently plan on doing earning to give, either by programming, working in finance, or starting a startup. I typically donate to <a href=\"http://www.animalcharityevaluators.org/\">ACE</a>-recommended charities--helping non-human animals is a hugely neglected area and I think that's where we can have the biggest impact.</p>\n", "parentCommentId": null, "user": {"username": "MichaelDickens"}}, {"_id": "miKKFniEHcPd2fMdX", "postedAt": "2014-09-17T17:20:37.810Z", "postId": "TYEt3ZN8KwcAqQ8Nf", "htmlBody": "<p>I'm Peter.  I work as a data scientist at Avant Credit, a non-profit providing online loans to people with near-prime credit ratings.  This job helps me earn-to-give, but more valuably it provides a lot of opportunity for learning, to enhance my career prospects later.</p>\n<p>When not doing my day job, I work on <a href=\"http://www.dotimpact.im\">.impact</a>, a distributed volunteer force of effective altruists working on really useful projects.  Recently, this has lead me to collaborate a lot with <a href=\"http://www.animalcharityevaluators.org\">ACE</a>, where <a href=\"https://impact.hackpad.com/Studying-Vegetarian-Advocacy-m11aW51ENVW\">I'm researching the impact of Facebook ads on diet change</a>, and <a href=\"http://www.charityscience.com\">Charity Science</a>, where I'm helping scale up the <a href=\"http://www.charityscience.com/birthday-fundraisers.html\">Birthday Charity fundraisers</a> you guys may have been seeing around a lot  (p.s. <a href=\"http://www.charityscience.com/birthday-fundraisers.html\">you should do one</a>).</p>\n", "parentCommentId": null, "user": {"username": "Peter_Hurford"}}, {"_id": "gK7K5Sk68C3wECLC9", "postedAt": "2014-09-17T17:21:38.959Z", "postId": "TYEt3ZN8KwcAqQ8Nf", "htmlBody": "<p>Howdy! I'm a senior in college studying neuroscience. Right now, I'm in the midst of management consulting interviews and might also go to law school or graduate school (likely in neuroscience or economics). I'm mainly interested in building career capital right now, but would guess that most of my life's impact will come from building high-impact communities and public influence.</p>\n<p>I decided I wanted to &quot;do the most good&quot; when I was about 13, and happened to Google &quot;greatest happiness rule&quot; one day, which led me to utilitarianism, which led me to Felicifia.org. The rest is history!</p>\n<p>I also agree with <a href=\"http://effective-altruism.com/ea/7r/introduce_yourself/it\">Michael Dickens</a> that helping nonhuman animals seems like the area where most of us can have the most impact.</p>\n", "parentCommentId": null, "user": null}, {"_id": "mwXxgBHXts9zyfZAC", "postedAt": "2014-09-17T17:52:47.893Z", "postId": "TYEt3ZN8KwcAqQ8Nf", "htmlBody": "<p>Hi, I'm a CS student who is planning on earning to give. John Maxwell and I recently started a business (<a href=\"http://www.mealsquares.com\">http://www.mealsquares.com</a>) in order to try to improve on the default situation of software developer salaries. We figure we can accomplish several things with the entrepreneur route:</p>\n<ol>\n<li><p>Give pretax dollars instead of post-tax salary dollars. (and hopefully more of them of course)</p>\n</li>\n<li><p>Spend more spare time working on effective things, for example helping out other EAs lower frictional costs that prevent them from being maximally effective.</p>\n</li>\n<li><p>Encourage the creation of other EA startups. We think there is some low hanging fruit in this space. (post on this forthcoming)</p>\n</li>\n</ol>\n<p>John and I are both highly interested in X-risk mitigation, which seems to suffer from a tragedy of the commons coordination problem.</p>\n", "parentCommentId": null, "user": {"username": "RomeoStevens"}}, {"_id": "SwqtCCb2jR9PzTHfn", "postedAt": "2014-09-17T19:10:30.501Z", "postId": "TYEt3ZN8KwcAqQ8Nf", "htmlBody": "<p>Hi! I'm a postdoc in philosophy at London School of Economics, mainly specializing in epistemology, broadly construed. I'm particularly interested in how we can use social media, online rating systems, internet tests, and various other internet applications to further efficiency, rationality and altruism. <a href=\"http://stefanschubert.wordpress.com/\">Here's my blog</a>, where I'm discussing these matters.</p>\n", "parentCommentId": null, "user": {"username": "Stefan_Schubert"}}, {"_id": "kE9Dodv3uZbA3sBfd", "postedAt": "2014-09-17T20:32:21.442Z", "postId": "TYEt3ZN8KwcAqQ8Nf", "htmlBody": "<p>Hi all</p>\n<p>This is a copy paste of my <a href=\"https://gratipay.com/for/effective-altruists/\">Gratipay</a> account. I suggest others look into creating Gratipay accounts of their own, both for donating to other EAs and to receive donations as EAs. </p>\n<p>I am making the world better by dedicating 70% of my time to EA.\nMy History *</p>\n<p>I gave <a href=\"https://www.youtube.com/watch?v=GRQJinlkHkc\">the first TED talk about Effective Altruism</a> </p>\n<p>Directed in the last two years a NGO that promotes Effective Altruism and Transhumanism in Brazil: <a href=\"http://www.IERFH.org\">www.IERFH.org</a> </p>\n<p>Wrote <a href=\"http://goo.gl/ROxT7E\">a book</a> on how to think about impatcful philosophy of mind, as Dennett does<br />I've written <a href=\"http://goo.gl/ssVFTW\">articles</a>, and <a href=\"http://goo.gl/R7sKTr\">blog posts</a> on topics ranging from philosophy of mind to artificial intelligence and motivation, seeking to find the best alternatives to create a better world.\nI've been a visiting fellow at Oxford, MIRI, Leverage Research, FHI and currently am at Berkeley University as a non-paid scholar. </p>\n<p>My projects *\nI continue to direct IERFH, which translates, broadcasts and researches information about EA in the far future. I am working on bridging current academic thinking about the mathematics of the emergence of altruism in biology, and inter-agent human cooperation and altruism, on the one hand, and institutional and individual cooperation on another. I'm working on setting up this very EA funding network to facilitate donations between EAs. I've given presentations at the World Social Forum and TED on AI and EA, and will continue to do so given opportunities.</p>\n", "parentCommentId": null, "user": {"username": "Diego_Caleiro"}}, {"_id": "gERDbtXMmNk4rGdgw", "postedAt": "2014-09-17T21:39:12.618Z", "postId": "TYEt3ZN8KwcAqQ8Nf", "htmlBody": "<p>Hello! I'm David, the Executive Director of The Humane League. We're an ACE recommended charity with a focus on factory farming. Most of our staff have the EA mindset, and we are all focused on reducing as much suffering as possible.</p>\n", "parentCommentId": null, "user": {"username": "davidcomanhidy"}}, {"_id": "ZGt4jXzaiissNjoX4", "postedAt": "2014-09-17T21:59:36.441Z", "postId": "TYEt3ZN8KwcAqQ8Nf", "htmlBody": "<p>Hi all. I'm a sophomore mechanical engineering student, planning on earning to give in either energy (nuclear or petroleum) or aerospace, depending on how the job market looks when I finish my master's/PHD. I've always considered myself a utilitarian, so it was really a relief when I found EA and realized that I could actually do as much good as possible, rather than constantly coming up with justifications as to why it couldn't work since no one else was doing it. </p>\n<p>Right now I'm focused on getting through college, though I have been donating a percentage of my summer income for signaling and habit forming reasons. I haven't had a chance to do the deep research necessary to figure out where I stand on animal and far future considerations (philosophy isn't exactly my strong suit), so I'm currently giving to 80,000 Hours as a compromise, since it acts as a donation multiplier toward pretty much every field. </p>\n<p>I'm pretty new to EA (about a year now), and I'm still trying to figure out what I can do besides earning to give. </p>\n<p>In my spare time I enjoy outdoor activities like climbing and backpacking for cheap and healthy recreation.</p>\n", "parentCommentId": null, "user": {"username": "JacobLBryan"}}, {"_id": "RqQz4dttxm8uBXDhM", "postedAt": "2014-09-17T22:22:45.383Z", "postId": "TYEt3ZN8KwcAqQ8Nf", "htmlBody": "<p>I'm Kerry. I'm currently in the last year of a PhD program in philosophy, specializing in ethics and I work for the Centre for Effective Altruism on effective altruism outreach.</p>\n<p>Previously I spent 3 years at the Laura and John Arnold Foundation where I ran the technology and innovation department. I've spent a lot of time thinking about how to influence foundations to give more effectively and how to improve the functioning of the nonprofit marketplace. I'm currently thinking about a number of hard problems in how to ensure that the EA movement is the last social movement the world ever needs.</p>\n", "parentCommentId": null, "user": {"username": "Kerry_Vaughan"}}, {"_id": "Rza4mDzcfvBD2grwo", "postedAt": "2014-09-17T22:31:19.481Z", "postId": "TYEt3ZN8KwcAqQ8Nf", "htmlBody": "<p>Hi all!  I'm David Perry, living in Durham NC.  I just recently began the <a href=\"https://groups.google.com/forum/#!forum/nc-effective-altruists\">NC Effective Altruists meetup</a>.</p>\n<p>Also, this week I started an intensive code school for Ruby on Rails.  I hope to eventually either work directly on software needed for EA-related causes, or Earn to Give more than I was in my previous job.</p>\n", "parentCommentId": null, "user": {"username": "curiousepic"}}, {"_id": "mnKiq4JKkHgWw6Q5A", "postedAt": "2014-09-17T23:37:12.141Z", "postId": "TYEt3ZN8KwcAqQ8Nf", "htmlBody": "<p>Good to see you here, David! :) I'd love to read more of your thoughts on effective altruism.</p>\n", "parentCommentId": "gERDbtXMmNk4rGdgw", "user": null}, {"_id": "R3znMzW3u2k6cwTeH", "postedAt": "2014-09-17T23:47:19.669Z", "postId": "TYEt3ZN8KwcAqQ8Nf", "htmlBody": "<p>Me too!</p>\n", "parentCommentId": "mnKiq4JKkHgWw6Q5A", "user": {"username": "Peter_Hurford"}}, {"_id": "CEEM8ZoQ5LqRNEJdg", "postedAt": "2014-09-18T05:30:31.648Z", "postId": "TYEt3ZN8KwcAqQ8Nf", "htmlBody": "<p>Hola everyone. I'm Marcus. I'm an audio engineer but I really got into philosophy during college. Eventually that led me to ethics and effective altruism.</p>\n<p>I'm currently learning a more financially beneficial skill so I can earn to give. In the meantime, I intend to do everything I can outside of that to contribute and help spread the word of EA.</p>\n", "parentCommentId": null, "user": {"username": "Marcus_A_Davis"}}, {"_id": "ASS4GiJJ4FxaB2LyN", "postedAt": "2014-09-18T07:41:43.673Z", "postId": "TYEt3ZN8KwcAqQ8Nf", "htmlBody": "<p>Hi all, I wasn't sure whether to use my real name here, but paranoia and probably having a bigger online presence with this one anyway won over. Anyway, I'm Sasha Cooper, currently self-studying programming after recently having completed a UK bootcamp, looking for an E2G coding role.</p>\n<p>I'm an unrepentant scalar totalising hedonistic utilitarian, formerly an admin on Felicifia. Focus-wise, I lean towards movement building at the moment, then developing-world health. I'm an AI-risk and cause-prioritisation sceptic, though I take the possibility that either could be the best approach seriously.</p>\n", "parentCommentId": null, "user": {"username": "Arepo"}}, {"_id": "9p2RAQGcReF9QXhZM", "postedAt": "2014-09-18T10:54:22.936Z", "postId": "TYEt3ZN8KwcAqQ8Nf", "htmlBody": "<p>I'm a programmer at Google, and I've been earning to give since 2009.  I write about EA <a href=\"http://www.jefftk.com/news/giving\">sometimes</a>; some favorite posts:</p>\n<ul>\n<li><a href=\"http://www.jefftk.com/p/keeping-choices-donation-neutral\">Keeping Choices Donation-Neutral</a></li>\n<li><a href=\"http://www.jefftk.com/p/haiti-and-disaster-relief\">Haiti and DIsaster Relief</a></li>\n<li><a href=\"http://www.jefftk.com/p/personal-consumption-changes-as-charity\">Personal Consumption Changes as Charity</a></li>\n</ul>\n<p>I also help organize EA meetups, so let me know if you're going to be in Boston!</p>\n", "parentCommentId": null, "user": {"username": "Jeff_Kaufman"}}, {"_id": "fsqmAmdDZAYvejBKD", "postedAt": "2014-09-18T11:55:32.844Z", "postId": "TYEt3ZN8KwcAqQ8Nf", "htmlBody": "<p>Hi, I'm Jess. I'm currently living in Oxford and doing a PhD in Behavioural Science - I'm looking at ways of making people more willing to consider evidence that conflicts with their existing views, and more likely to change their minds about important topics. I want to figure out how people can be more open-minded and truth-seeking, basically :)</p>\n<p>I got involved in effective altruism after I finished my degree at Oxford, and came across 80,000 Hours. I'd always wanted to make a difference in the world, but was feeling a bit disillusioned about how to do it and unsure how this really fitted with my skills and interests. I ended up spending a year working for 80k - mostly designing and running the careers advising process - whilst learning more about effective altruism and thinking about what to do with my life. I'm still figuring a lot of this out!</p>\n<p>I blog at <a href=\"http://jesswhittlestone.com/\">www.jesswhittlestone.com</a> and have written a number of EA-related posts for the <a href=\"https://80000hours.org/blog/\">80,000 Hours blog</a>.</p>\n", "parentCommentId": null, "user": {"username": "Jess_Whittlestone"}}, {"_id": "4PpsALKxhTDc5C39p", "postedAt": "2014-09-18T14:36:26.702Z", "postId": "TYEt3ZN8KwcAqQ8Nf", "htmlBody": "<p>I'm Bernadette. Originally from Australia, I'm a medical doctor, training in Infectious Diseases. I'm currently on a break from clinical work to if a research fellowship and DPhil in the genetics of bloodstream infections with Staphylococcus aureus (a worldwide disease). I'm also currently on a break from my research fellowship to care for my baby daughter. I now live in Oxford with my husband Toby. </p>\n<p>My interest in doing more good by giving, and the role we could all play in ending global poverty was kindled after reading One World by Peter Singer in 2002. Since I graduated in 2005 I've been giving at least 10% of my income and in 2009 I made the GWWC pledge.</p>\n", "parentCommentId": null, "user": {"username": "Bernadette_Young"}}, {"_id": "xHqtaTEbodQXfxkpi", "postedAt": "2014-09-18T15:58:32.099Z", "postId": "TYEt3ZN8KwcAqQ8Nf", "htmlBody": "<blockquote>\n<p>Encourage the creation of other EA startups. We think there is some low hanging fruit in this space. (post on this forthcoming)</p>\n</blockquote>\n<p>I'd be very interested to hear about this. As far as I know, MealSquares is the most successful startup by EAs at this point. A lot of people talk about it (including me) but most people don't do it (including me), so it's great to see some EAs putting their career where their mouth is.</p>\n", "parentCommentId": "mwXxgBHXts9zyfZAC", "user": {"username": "MichaelDickens"}}, {"_id": "s4uLRgtaYzpwY3zRC", "postedAt": "2014-09-18T16:35:55.714Z", "postId": "TYEt3ZN8KwcAqQ8Nf", "htmlBody": "<p>Hi, I'm Erica. I'm a New York nanny (so obviously not EtG :P), and I lean towards poverty reduction and animal activism. I got into EA through the LW/CFAR route, and am relatively active in those communities. </p>\n<p>Other interests include: many various styles of dance, self-improvent, community organizing, board games,  and trying new things. I recently joined the choir for the local Sunday Assembly, which is an organization that I highly recommend as a welcoming community of people who are into applying reasoning to things, AND doing good.</p>\n", "parentCommentId": null, "user": {"username": "Erica_Edelman"}}, {"_id": "7v9TkXoS7QjddYBaj", "postedAt": "2014-09-18T18:41:12.125Z", "postId": "TYEt3ZN8KwcAqQ8Nf", "htmlBody": "<p>Hi, I'm Josh. I'm a sophomore in college and I'm tentatively planning on EtG through programming. I have been donating to CEA for movement-building purposes, but may switch to ACE and/or ACE-recommended charities in the near future. I became an EA after being heavily exposed to moral philosophy (esp. utilitarianism) through doing debate in high school.</p>\n<p>When I'm not doing school work I enjoy playing video games, reading philosophy, working out, and programming.</p>\n", "parentCommentId": null, "user": {"username": "JoshYou"}}, {"_id": "sv37hypoGmefiZCG8", "postedAt": "2014-09-18T20:30:50.771Z", "postId": "TYEt3ZN8KwcAqQ8Nf", "htmlBody": "<p>I'm Ryan. I'm currently a Grounds Maintenance worker in Albany, NY. I've recently been motivated to Earn to Give and am using 80,000 Hours' resources for ideas on a career switch.</p>\n<p>I'm a former Philosophy student dropout and I was introduced to Effective Altruism through Peter Singer's Life You Can Save last year. Since then I've been donating what I can to effective charities and eating  Veganaise.</p>\n<p>Other interests: hiking, kayaking, sound design, podcasts, comedy, climate change and green wizardry.</p>\n", "parentCommentId": null, "user": {"username": "RyanLaRocque"}}, {"_id": "5hsizwzvHtnHbXvTB", "postedAt": "2014-09-18T22:12:06.263Z", "postId": "TYEt3ZN8KwcAqQ8Nf", "htmlBody": "<p>Good to see you here, Marcus!</p>\n", "parentCommentId": "CEEM8ZoQ5LqRNEJdg", "user": {"username": "Peter_Hurford"}}, {"_id": "WNLgbKfJqRDMJ4KFg", "postedAt": "2014-09-18T23:10:45.658Z", "postId": "TYEt3ZN8KwcAqQ8Nf", "htmlBody": "<p>Hi, I'm Claire.  I'm a master's student at Stanford, and I also work at Harvard's Kennedy School of Government.  I research climate engineering (manipulating the world's climate to reduce the effects of climate change and otherwise make Earth more habitable).  I'd really like to go into government work and this year I'll be thinking and possibly blogging about what EA policy-making might look like.  </p>\n<p>I used to write a lot, and I'm interested in how fiction can be used to spur activism and reshape ethical frameworks, especially in young people.  I'm also curious about how the relationship between EA and transhumanism, and EA and animal right activism, might evolve in the coming years.  I'm interested in how evolution shaped human intuitions about altruism and utilitarianism, and how the EA movement can use or respond to these instincts.  </p>\n<p>I also do some earning to give on the side, and plan to do much more in the coming years.  My not-so-EA activities are hiking (who doesn't like hiking?), cave-diving and other unusual types of scuba diving, reading (mostly speculative fiction and classics), and painting with watercolors.</p>\n", "parentCommentId": null, "user": {"username": "ClaireZabel"}}, {"_id": "7o3t6PbzpXCg7KuqL", "postedAt": "2014-09-19T11:16:09.965Z", "postId": "TYEt3ZN8KwcAqQ8Nf", "htmlBody": "<p>Hi, I'm Owen. I work for the Centre for Effective Altruism, planning and doing research for the <a href=\"http://www.fhi.ox.ac.uk/research/global-priorities-project/\">Global Priorities Project</a> into how we should choose between diverse options.</p>\n<p>I joined Giving What We Can in 2009 while I was doing a PhD in pure mathematics. Later as a postdoc I thought more seriously about whether that was the area where the world most needed more research, and concluded that it wasn't. I still teach at the university.</p>\n", "parentCommentId": null, "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "hffwEhtqqmFSibGTi", "postedAt": "2014-09-19T20:25:37.136Z", "postId": "TYEt3ZN8KwcAqQ8Nf", "htmlBody": "<p>I'm Daniel. I'm a first-year student who is studying economics and planning on earning to give through a career in finance. While at college, I will hopefully set up an EA group.</p>\n<p>I got into EA through Peter Singer and 80000hours. I've considered utilitarianism correct for a long time, but I've only found about EA recently.</p>\n<p>I'm mainly concerned about existential risk; recently I've been thinking about Pascal's Mugging and the prospect of displacing humanity with an utilitronium-like AGI.</p>\n", "parentCommentId": null, "user": {"username": "DanielHendrycks"}}, {"_id": "JQv5eMSoRtucdtJ7e", "postedAt": "2014-09-20T01:00:39.999Z", "postId": "TYEt3ZN8KwcAqQ8Nf", "htmlBody": "<p>I'm Alex, a math student at UC Berkeley. My primary EA focus area is existential risk reduction, and I plan on either doing AI risk-reducing research or earning to give or both.</p>\n", "parentCommentId": null, "user": {"username": "AlexMennen"}}, {"_id": "igm8DAkm294HxbD7q", "postedAt": "2014-09-20T03:35:46.304Z", "postId": "TYEt3ZN8KwcAqQ8Nf", "htmlBody": "<p>I'm a physics PhD student working in quantum computing. My introduction to EA has been through Lesswrong, where I'm reasonably active (under a different name). </p>\n<p>When I first heard about EA, it immediately struck a chord with me, as it did two things: (1) it pinpointed exactly what it was about your average charity that annoyed me so much; and (2) proposed a way to fix it. </p>\n<p>I very recently started donating a small amount, $50, monthly to GiveDirectly. </p>\n<p>While I support giving from what you earn, I'm still quite on the fence about earning to give. That is, I'm not sure that it is a good idea to consciously optimize your career around earning more simply so that you can donate more. I haven't, yet, clearly formulated my intuitive discomfort with this concept into arguments. </p>\n", "parentCommentId": null, "user": {"username": "godshatter"}}, {"_id": "pwANNCAoTjZ7ssg8F", "postedAt": "2014-09-20T03:50:10.703Z", "postId": "TYEt3ZN8KwcAqQ8Nf", "htmlBody": "<p>Great to have you on board!</p>\n", "parentCommentId": "igm8DAkm294HxbD7q", "user": {"username": "RyanCarey"}}, {"_id": "rayQie4CaNBMqSvma", "postedAt": "2014-09-20T04:17:32.282Z", "postId": "TYEt3ZN8KwcAqQ8Nf", "htmlBody": "<p>Hey, I'm a postdoc in q. info (although more on the decoherence and q. foundations side of things).  I'm interested to know more about where you're at and how you found out about LessWrong.  Shoot me an email if you want.  My address is my username without the underscore @gmail.com .</p>\n", "parentCommentId": "igm8DAkm294HxbD7q", "user": {"username": "Jess_Riedel"}}, {"_id": "HyeQQTSGtjKWZkPm6", "postedAt": "2014-09-20T12:20:32.678Z", "postId": "TYEt3ZN8KwcAqQ8Nf", "htmlBody": "<p>Hi all! I’m Michelle. Usually I run Giving What We Can. Right now I’m on sabbatical to finish my PhD. It’s on how to extend QALYs/DALYs to questions involving creating lives as well as extending/improving them, and it has to be finished in two weeks time!</p>\n<p>When I was at school I wanted to help charities, but never really got committed to one because I just didn’t know which it would be best to support. I was lucky enough to come across Will and Toby as they were setting up Giving What We Can, and through them the idea that you could do research to find which charities were the most effective. I was so excited to finally feel like I whole heartedly supported particular charities, knowing the good they did, and I was fascinated by all the information available on different charitable interventions. </p>\n<p>My favourite part of working for Giving What We Can is how many lovely people I get to meet, chat to and work with. I’m ceaselessly impressed by how many people there are who care so much about others, and act on that in such a considered way. Being part of this community gives me the tools, support and inspiration to help others way more than I ever thought I could.</p>\n", "parentCommentId": null, "user": {"username": "Michelle_Hutchinson"}}, {"_id": "rBFizoKypExY5jPWi", "postedAt": "2014-09-20T13:21:47.245Z", "postId": "TYEt3ZN8KwcAqQ8Nf", "htmlBody": "<blockquote>\n<p>my PhD. It’s on how to extend QALYs/DALYs to questions involving creating lives as well as extending/improving them, and it has to be finished in two weeks time!</p>\n</blockquote>\n<p>Ooo, sounds interesting! Could you post it when you're done? (Does Oxford allow that?)</p>\n", "parentCommentId": "HyeQQTSGtjKWZkPm6", "user": {"username": "Dale"}}, {"_id": "2AwA9TQPx3EJmpcDa", "postedAt": "2014-09-20T20:11:21.742Z", "postId": "TYEt3ZN8KwcAqQ8Nf", "htmlBody": "<p>Hey,</p>\n<p>I recently reading mathematics and philosophy at Oxford, and now work in Finance. I've been interested since before it had a name, and am mainly interested in Existential Risks. I mainly donate to MIRI. I use the same username on LW.</p>\n", "parentCommentId": null, "user": {"username": "Larks"}}, {"_id": "bdZ9jWqHaymMeWRvx", "postedAt": "2014-09-21T09:58:57.738Z", "postId": "TYEt3ZN8KwcAqQ8Nf", "htmlBody": "<p>Hi! I'm Jørgen (or George for English speakers who find the <em>ø</em> difficult) and I study industrial engineering at the Norwegian University for Technology and Natural Sciences (NTNU) in Trondheim, Norway. </p>\n<p>About 9 months ago I gathered a few classmates and we founded [Effektiv Altruisme NTNU] (<a href=\"http://www.facebook.no/ea.ntnu\">www.facebook.no/ea.ntnu</a>) as the first EA organisation in Norway. In just these few months we have had great success in building the organisation, networking and planning our [launch event] (<a href=\"http://www.facebook.com/events/1464757957116665\">www.facebook.com/events/1464757957116665</a>) this Thursday. We have already third most likes on Facebook of the international focused idealistic student groups in Trondheim and we are expecting 150 people at the event next week.</p>\n<p>We have a lot of plans and good ideas for events and projects in Trondheim and Norway, including a talk from Hans Rosling, lobbying towards Norwegian politicians and people and organisations with influence and a university wide charity survey to map knowledge and attitudes towards giving effecivly. The last one is essential to measure our own influence on students over time.</p>\n<p>Besides EA and ethics, I consider my self a part of the skeptic movement (witch we already are finding supporters from) and I just love bordgames!</p>\n", "parentCommentId": null, "user": {"username": "Jorgen_Ljones"}}, {"_id": "qZqwS6RrHHyjYMRCj", "postedAt": "2014-09-21T13:11:07.895Z", "postId": "TYEt3ZN8KwcAqQ8Nf", "htmlBody": "<p>Yes, I think they do. Glad to hear it's of interest! It will be a while though, because it'll be a month before I defend/viva, and then there'll likely be a couple of months of doing corrections. </p>\n", "parentCommentId": "rBFizoKypExY5jPWi", "user": {"username": "Michelle_Hutchinson"}}, {"_id": "H7dxh7mPbSrNgzPRK", "postedAt": "2014-09-21T14:12:04.526Z", "postId": "TYEt3ZN8KwcAqQ8Nf", "htmlBody": "<p>Thanks for visiting the EA forum, Jorgen - great to have you here.\nHans does a lot of great work and is excellent to have as a contact!</p>\n", "parentCommentId": "bdZ9jWqHaymMeWRvx", "user": {"username": "RyanCarey"}}, {"_id": "Gs96HvmGbFiAfEatd", "postedAt": "2014-09-21T14:53:13.988Z", "postId": "TYEt3ZN8KwcAqQ8Nf", "htmlBody": "<p>You're having Hans Rosling come speak? Jealous!</p>\n", "parentCommentId": "bdZ9jWqHaymMeWRvx", "user": {"username": "Michelle_Hutchinson"}}, {"_id": "vbkSzCHrMMMeMkkgT", "postedAt": "2014-09-21T15:42:52.751Z", "postId": "TYEt3ZN8KwcAqQ8Nf", "htmlBody": "<p>I'm Kaj. I'm currently doing my Computer Science MSc at the University of Helsinki. Currently I'm focusing on my thesis, which is on the topic of educational games and involves me trying to develop a game to teach Bayesian reasoning. I'm also helping get EA Finland on its feet.</p>\n<p>I've previously dabbled in a bunch of things that were broadly EA in spirit. I was one of the co-founders of the Finnish <a href=\"http://en.wikipedia.org/wiki/Pirate_Party\">Pirate Party</a> at a time when it looked like it could improve the state of the country's legislation with relative little effort, and later on spent a year working for the <a href=\"http://intelligence.org/\">Machine Intelligence Research Institute</a>. I've also posted a lot on LessWrong.</p>\n", "parentCommentId": null, "user": {"username": "Kaj_Sotala"}}, {"_id": "2M8CGRdYp2P2pwzRq", "postedAt": "2014-09-22T13:31:13.467Z", "postId": "TYEt3ZN8KwcAqQ8Nf", "htmlBody": "<p>Hi! I'm James. I'm a software engineer living in London. I first got into EA via Givewell and Peter Singer. I am looking for ways to tailor my own giving towards the most effective means. I also am constantly trying to think of new ways to effect large-scale change, through technology and awareness. I currently work for a payments company and am trying to formulate ways to seamlessly build charity into commerce on a massive scale.</p>\n", "parentCommentId": null, "user": {"username": "padolsey"}}, {"_id": "eAyidRdT2ZHEWfriZ", "postedAt": "2014-09-23T15:14:49.993Z", "postId": "TYEt3ZN8KwcAqQ8Nf", "htmlBody": "<p>Hello, I'm Toby. I've been involved with effective altruism since 2005 when I started putting together the ideas behind Giving What We Can. I co-founded Giving What We Can in 2009 and the Centre for Effective Altruism in 2011. I'm currently the president of the former and a trustee of the latter. I am a Research Fellow at the Future of Humanity Institute at Oxford University. I work on global poverty, global health, global priority setting, and existential risk. This involves academic research as well as policy work with governments, NGOs, and foundations. I am just about to begin a grant on population ethics, so I'll be spending more of my academic time on understanding the theoretical and practical issues surrounding how we should value future generations.</p>\n", "parentCommentId": null, "user": {"username": "Toby_Ord"}}, {"_id": "RbRhyiu6W39gdZ9Hg", "postedAt": "2014-09-24T00:31:49.742Z", "postId": "TYEt3ZN8KwcAqQ8Nf", "htmlBody": "<p>Hello, I'm Evan. </p>\n<ul>\n<li>I'm a member of 80,000 Hours, and a CFAR alumnus.</li>\n<li>Historically, I've donated token sums to the Against Malaria Foundation, and the Schistoscomiasis Control Initiative. I've donated $1000 USD in unrestricted funds to Givewell.</li>\n</ul>\n<p><strong>What I'm concerned about</strong></p>\n<ul>\n<li><p>Global health and poverty reduction are important causes. I believe the accessible example they provide as a staple of effective altruism makes the case for it to continue being a concern for this movement. Additionally, I'm sympathetic to it because it offers a more solid, more risk-averse way of doing good, despite the fact that some may claim that it doesn't bear out as high a value from expected value calculations to other causes.</p>\n</li>\n<li><p>For developing countries to gain greater sovereignty/agency, to grow more economically, and to become self-sustaining seems very important. The charities that effective altruists have endorsed thus far have been doing a good job of that, but I believe even more could be done. I hope effective altruism has a future in creating such organizations, or aiding them towards greater effectiveness.</p>\n</li>\n<li><p>I currently believe there is some natural basis to consciousness, that it exists on a gradient, and that the sentience and capacity to feel pain and pleasure of non-human animals matters. I believe this is true for most species of vertebrates, and a few species of invertebrates. I contend it's possible that perhaps most species of invertebrates are sentient enough to warrant human concern, but I believe the jury is still out on this. To this end, I believe concern for wild-animal suffering, factory farming, and other exploitation by humans of other species is warranted.</p>\n</li>\n<li><p>There is a dearth of worthy research for effectiveness and impact evaluations into animal advocacy, but I would like to see this happen. To this end, I endorse the work of organizations such as Animal Charity Evaluators, Charity Science, and Farm Sanctuary.</p>\n</li>\n<li><p>As of this comment, I am not a vegetarian of any sort, but I do avoid eating eggs, and I heavily reduce my intake of meat. The &quot;Logic of the Larder&quot; argument seems plausible to me, but not sound given the current treatment of most non-human animals by us. In addition to the suffering it causes, I believe factory farming also poses risks to human public health, and to the environment. To these ends, phasing out factory farming among human civilizations is worthwhile goal.</p>\n</li>\n<li><p>I'm concerned for future generations, but I'm concerned because mitigating existential risk seems intractable, or at least it seems too difficult to tell (currently) about how much of an impact we would be making. Nonetheless, I believe future generations do matter, and investigations into mitigating existential risk should continue. I don't currently have a framework for discounting lives at one point in time to another.</p>\n</li>\n<li><p>I would like to observe among think tanks dedicated towards mitigating global catastrophic risk, e.g., the MIRI, the FHI, and the GCRI, more research dedicated to risks other than those posed by unsafe machine intelligence, in particular engineered pandemics, and other threats to global civilization. I'm aware that the capacity of these organizations to focus more effort on these other causes is contingent upon them receiving more, and greater, funding in the future, and I hope they receive it.</p>\n</li>\n<li><p>I believe cause prioritization may be among the most important causes to be focusing upon right now, and to this end I endorse the following projects: The Global Priorities Project (jointly operated by the Future of Humanity Institute, and the Centre for Effective Altruism), and the Open Philanthropy Project (jointly run by Givewell and Good Ventures). </p>\n</li>\n<li><p>At the 2014 Effective Altruism Summit, during his keynote address, Holden Karnofsky, executive director of Givewell, mentioned how he believes effective altruism has too early and broadly narrowed to a only a few cause areas. I concur effective altruism should attempt to evaluate the impact, and potential for doing good, in a wider array of cause areas. This is one of my primary concerns for cause prioritization. I believe labor mobility, open science, global catastrophic risk reduction, and other policy advocacy hold lots of promise.</p>\n</li>\n<li><p>Outside of earning to give, and careers typical of non-profit work, I believe more effective altruists should take it upon themselves to find more unconventionally impactful jobs and projects to work on.</p>\n</li>\n</ul>\n", "parentCommentId": null, "user": {"username": "Evan_Gaensbauer"}}, {"_id": "ApBbsKrXPkoxqQBPA", "postedAt": "2014-09-24T10:38:38.601Z", "postId": "TYEt3ZN8KwcAqQ8Nf", "htmlBody": "<p>Thanks for the detailed introduction Evan. Any of those bullet points would make interesting openings for discussion on an open thread (or could be elaborated into a post).</p>\n", "parentCommentId": "RbRhyiu6W39gdZ9Hg", "user": {"username": "Toby_Ord"}}, {"_id": "QqpbG7en3BGB6zAax", "postedAt": "2014-09-26T12:58:07.002Z", "postId": "TYEt3ZN8KwcAqQ8Nf", "htmlBody": "<p>Hello, I'm David and I'm from Munich, Germany. I reveived a Diploma (German old-school master equivalent) in mathematics and finance. After that I worked a couple of years as a research and teaching associate in finance at university. I've done research on the intersection of decision theory (exotic preferences under ambiguity aversion) and financial equilibrium theory (heterogeneous agents in financial markets) Unfortunately, it turned out very recently that the core of my Ph.D thesis, a theoretical model, is not solvable in closed-form. Since my contract has expired, I decided to quit my thesis.  So I am in  the job market since three weeks, searching for an opportunity in asset management, risk management or corporate finance.</p>\n<p>I learned about the movement as I began to wonder where to give. I didn't find any reliable and impact-focused German charity evaluators, so I naturally expand my search for international evaluators. Then I came across GiveWell and was fascinated by their rigorous and analytical approach.</p>\n<p>I really care about poverty, health, and environmental issues (and I also care quite a bit about farm animals since my spouse is vegan). I care less about AI since I have the impression that there might be some degree of science fiction at work that seems to have very ambiguous outcomes. While I generally agree that we should behave as if we are risk neutral when deciding about EA causes, I strongly disagree that we also should be neutral towards ambiguity (or Knightian uncertainty).</p>\n<p>My spouse and I will increase the portion of our income that goes to charity annually, so I expect to take the GWWC pledge in a few years.</p>\n", "parentCommentId": null, "user": {"username": "David_Kreppel"}}, {"_id": "3bsNBwMLrqneCot5M", "postedAt": "2014-09-28T02:34:12.955Z", "postId": "TYEt3ZN8KwcAqQ8Nf", "htmlBody": "<p>I'm Dale. Originally from western Pennsylvania, I studied at a small liberal arts college before going to work in New York. I became interested in effective altruism largely from ready Toby Ord's writings: he has <a href=\"http://www.amirrorclear.net/academic/papers/\">some really interesting papers</a>. I've also read a lot of <a href=\"http://www.lesswrong.com\">lesswrong</a>.</p>\n<p>I've recently started <a href=\"https://effectivereaction.wordpress.com/\">a blog</a> where I write about a mixture of economics and effective altruism.</p>\n<p>People here seem nice so I look forward to discussing altruism with you all!</p>\n", "parentCommentId": null, "user": {"username": "Dale"}}, {"_id": "mPsPBjmCNfWw95aE9", "postedAt": "2014-09-28T02:38:21.283Z", "postId": "TYEt3ZN8KwcAqQ8Nf", "htmlBody": "<p>Fantastic, glad to hear it. I hope your defense goes well.</p>\n", "parentCommentId": "qZqwS6RrHHyjYMRCj", "user": {"username": "Dale"}}, {"_id": "nRjwsjNzdLoAp9A5N", "postedAt": "2014-09-28T12:47:27.400Z", "postId": "TYEt3ZN8KwcAqQ8Nf", "htmlBody": "<p>I'm Alasdair, I work as a paralegal/legal trainee in London in public interest law and I am a Giving What We Can member. </p>\n<p>My interest in EA stemmed from two things. First re-reading much of the less wrong archives and being interested but sceptical about a lot of the things discussed on that site. Second, a growing recognition in my study of human rights law of how little a lot of &quot;activism&quot; actually helps people. </p>\n<p>My other interests include getting slightly less terrible at Go (15kyu), and trying to become a more well rounded person. I'm particularly interested in the science of mental health, motivation and instrumental rationality and how it relates to things like akrasia, fitness, anxiety and so on.</p>\n<p>My favourite radio station is FIPRadio which broadcasts from Paris and has relieved me of the burden of having any knowledge of music since they have better taste and refinement than I ever did.</p>\n", "parentCommentId": null, "user": {"username": "AlasdairGives"}}, {"_id": "ceoZBnZvucrwadyjQ", "postedAt": "2014-09-28T16:15:23.408Z", "postId": "TYEt3ZN8KwcAqQ8Nf", "htmlBody": "<p>Hi Dale, it's nice to make your acquaintance. I'm always interested in how people get into effective altruism through the writings of a single individual, rather than it being brought to one's attention by their friends, or a news article. How did you originally come across Dr. Ord's writings? </p>\n", "parentCommentId": "3bsNBwMLrqneCot5M", "user": {"username": "Evan_Gaensbauer"}}, {"_id": "fbDfWaxAtn8f6xBDW", "postedAt": "2014-09-28T16:23:09.786Z", "postId": "TYEt3ZN8KwcAqQ8Nf", "htmlBody": "<p>Hi David,</p>\n<p><a href=\"https://80000hours.org/\">80000 Hours</a> is an effective altruist organization that does ethical careers advising. That is, it was founded as a natural extension of Giving What We Can for its members to figure out how they could do the most good with their pledges over their careers. Now 80k has hundreds of members, does research, and advising, for what jobs can have the highest altruistic impact, and aims to become the best ethical careers adviser anywhere.</p>\n<p>They've helped some effective altruists in astounding ways, so seek their help if you're looking for a fit between your desire to good, and your phenomenal skills as an analyst. You don't need to become a member of 80k to peruse their research for insight, or send them an email. Also, there is an Effective Altruists Facebook group. There are lots of effective altruists working in finance and consulting, living in Germany, and joining the Facebook group would likely be the fastest way to get to know them. </p>\n<p>Anyway, welcome to the forum. As someone behind you in their career, but with similar inclinations towards my personal effective altruism, I greatly commend your promising commitment to doing good!</p>\n", "parentCommentId": "QqpbG7en3BGB6zAax", "user": {"username": "Evan_Gaensbauer"}}, {"_id": "R2umo4QotXXDW3Hhq", "postedAt": "2014-09-28T19:56:04.915Z", "postId": "TYEt3ZN8KwcAqQ8Nf", "htmlBody": "<p>Hi all, I'm Alex Gordon-Brown. I'm from the UK, and currently live and work in London. I started work at Jane Street Capital in September 2013.</p>\n<p>The focus of my career is Earning To Give, and as a result I spend a lot of my free time thinking about questions of where and how to donate. I'm always happy to chat to others undertaking or considering EtG, especially those looking at finance.</p>\n", "parentCommentId": null, "user": {"username": "AGB"}}, {"_id": "pKb9NnpepGCLWyuLf", "postedAt": "2014-09-28T20:20:38.161Z", "postId": "TYEt3ZN8KwcAqQ8Nf", "htmlBody": "<p>User <a href=\"http://effective-altruism.com/user/David_Kreppel/\">David_Kreppel</a> just introduced himself before you a couple of days ago, and he lives in Munich, and has an advanced degree in finance and economics from Germany. He's left his Ph.D. program, so he's looking for new work. I'm not sure if he plans on earning to give, but some job in finance might suit him anyway.</p>\n<p>Consider contacting him if you the knowledge you can provide would apply to his situation.</p>\n", "parentCommentId": "R2umo4QotXXDW3Hhq", "user": {"username": "Evan_Gaensbauer"}}, {"_id": "kBJn7GowRaWMFM67c", "postedAt": "2014-09-28T20:23:13.340Z", "postId": "TYEt3ZN8KwcAqQ8Nf", "htmlBody": "<p>That's great, Alasdair. I like how your experience is eclectic based on your interests mentioned, but most of it seems applicable to practicing effective altruism.</p>\n", "parentCommentId": "nRjwsjNzdLoAp9A5N", "user": {"username": "Evan_Gaensbauer"}}, {"_id": "iFZwezTx7BARC6aAK", "postedAt": "2014-09-28T20:31:21.178Z", "postId": "TYEt3ZN8KwcAqQ8Nf", "htmlBody": "<p>Hi James. It's a pleasure to meet you. One thing I'm interested in right now is asking others about what they would like to see in effective altruism that isn't being tried right now. So, I'm wondering what use of technology, and awareness, or both, you suspect right now could be very high-impact, but other effective altruists haven't thought about yet?</p>\n<p>Also, do you mean you currently work for a payments company <em>where</em> you build charity into commerce on a massive scale? Because that would be amazing! Anyway, if that's your weekday job, or your side project, I'd love to learn about it.</p>\n", "parentCommentId": "2M8CGRdYp2P2pwzRq", "user": {"username": "Evan_Gaensbauer"}}, {"_id": "fcca2P2jtHNaTMteX", "postedAt": "2014-09-28T23:53:13.535Z", "postId": "TYEt3ZN8KwcAqQ8Nf", "htmlBody": "<p>I'm Julia. I live in Boston with my husband, Jeff Kaufman, and our daughter. I'm a social worker doing mental health work for prisoners.</p>\n<p>Since childhood, I've been interested in richer people's obligations to poorer people. I took the Giving What We Can pledge in 2012. I'm thrilled that the EA movement is a thing, both because I'm no longer the only person I know talking about this stuff, and because other people have helped me think more clearly about it. \nI write the blog <a href=\"http://www.givinggladly.com/\">Giving Gladly</a>.</p>\n", "parentCommentId": null, "user": {"username": "Julia_Wise"}}, {"_id": "En9amTEbuKTDNDkmw", "postedAt": "2014-10-01T02:03:42.679Z", "postId": "TYEt3ZN8KwcAqQ8Nf", "htmlBody": "<p>I'm Jon. Working on a degree in computer science, and trying to figure out what I can do besides earning to give. Basically just spending my time/energy figuring out how to study harder/better so I can get a better-paying job when the time comes. </p>\n<p>I'm considering using National Novel Writing Month to try fundraising for SCI, but I'm not sure how well I'd be able to pull it off without having any friends. </p>\n", "parentCommentId": null, "user": {"username": "JMeans"}}, {"_id": "PccLYRnYfd9TSLddg", "postedAt": "2014-10-02T22:22:33.828Z", "postId": "TYEt3ZN8KwcAqQ8Nf", "htmlBody": "<p>Hello, I'm Andrew. I'm currently a third year PPE student at the University of Manchester in the UK. I was introduced to EA through Less Wrong, and became actively involved a bit less than a year ago when a friend in Manchester started up a local chapter. I have taken the GWWC pledge and am currently torn between going into academic philosophy (which I would probably enjoy a lot, but may not be terribly effective due to the number of EAs already involved in academia), learning to program and getting a job in software, or getting involved in a think tank in order to advocate for open borders.</p>\n<p>In my spare time I enjoy playing the piano, reading, and running while listening to podcasts.</p>\n", "parentCommentId": null, "user": {"username": "AndrewPearson"}}, {"_id": "fBC45doN3P2DrE8iJ", "postedAt": "2014-10-11T12:35:16.258Z", "postId": "TYEt3ZN8KwcAqQ8Nf", "htmlBody": "<p>I'm Gina, I'm a volunteer &amp; board member for an animal rights &amp; environmental protection organization in Madison, WI (Alliance for Animals and the Environment). I think promoting vegetarian/veganism is one of the best ways to reduce suffering in the world, since animal lives can be saved <em>much</em> more cheaply than human lives (and I don't think that they're worth hundreds of times less).</p>\n<p>I work as a software &amp; applications engineer for a small company that does hyperspectral imaging.</p>\n", "parentCommentId": null, "user": null}, {"_id": "8p9HQ5DrjfC3LeGjY", "postedAt": "2014-10-11T18:15:42.752Z", "postId": "TYEt3ZN8KwcAqQ8Nf", "htmlBody": "<p>I'm Max and I'm from Vancouver, Canada. I am interested in far future causes and animal causes. I think that in terms of improving near term well being, animal causes dominate in expectation, but I am still unsure whether they have strong enough long run effects or if more specifically far future causes would be better.</p>\n<p>I'm finishing up a philosophy BA right now and I am still trying to decide what to do after. It seems like my comparative advantage is definitely in philosophy or something else that uses verbal reasoning, but I'm not sure if the options are good enough in those areas. I am also interning at ACE and I may end up continuing to do direct work for EA charities if it seems like I would be good enough at it.</p>\n<p>I'm looking to skype with people about productivity, career choice, cause selection and for expanding my comfort zone, so contact me if you'd be interested in skyping as well. </p>\n", "parentCommentId": null, "user": {"username": "Max_Carpendale"}}, {"_id": "nsa9jCXRcykGbtJqe", "postedAt": "2014-10-20T21:48:47.595Z", "postId": "TYEt3ZN8KwcAqQ8Nf", "htmlBody": "<p>Hello everyone,</p>\n<p>I'm Joey I have worked and volunteered for a ton of different EA organizations (80k, ACE, GWWC, THINK, Leverage) and now have founded one (Charity Science) that works on moving money to the most effective and evidence based charities (GiveWell recommendations).</p>\n<p><a href=\"http://www.charityscience.com/\">http://www.charityscience.com/</a></p>\n", "parentCommentId": null, "user": {"username": "Joey"}}, {"_id": "dB2ZczDGxN2tS3iF4", "postedAt": "2014-11-10T10:52:14.622Z", "postId": "TYEt3ZN8KwcAqQ8Nf", "htmlBody": "<p>Yes, are hoping to have him over spring of 2015. The plan is to book the student hall (about 800 seats) at the weekly mass meetings. His excellent videos online is quite known at the university, so I think we will have good chances of a high turn up!</p>\n", "parentCommentId": "Gs96HvmGbFiAfEatd", "user": {"username": "Jorgen_Ljones"}}, {"_id": "rNQ8KAcNHaLgF5H4M", "postedAt": "2014-11-17T02:17:56.676Z", "postId": "TYEt3ZN8KwcAqQ8Nf", "htmlBody": "<p>I'm a physics undergrad who is very interested in quantum computing. Interested to hear thoughts on it from someone who is a rationalist; if you would email me at Connor_Flexman AT brown DOT edu, it would be wildly helpful.</p>\n", "parentCommentId": "igm8DAkm294HxbD7q", "user": {"username": "cflexman"}}, {"_id": "2ahYM7F2udQjrKr5e", "postedAt": "2014-12-12T01:47:39.997Z", "postId": "TYEt3ZN8KwcAqQ8Nf", "htmlBody": "<p>Hi! I'm John. I am co-president of Harvard's effective altruism student group for undergrads. I currently study physics and math, and I do research in economic theory; I'm planning to transition to economics after I graduate in May, eventually going to grad. school and likely doing research long-term.</p>\n<p>In the past, I've spent a lot of time thinking about meta-ethics and movement building. I have two years of experience running Harvard's group, and am super happy to talk to other students / movement-builders. Currently, I'm most excited about rethinking some of the decision theoretic and behavioral assumptions at the root of economics and the societies we've built on top of it (I'm still a young idealist...). </p>\n<p>I love playing ultimate frisbee and jazz piano, biking, and backpacking.</p>\n", "parentCommentId": null, "user": {"username": "John_Sturm"}}, {"_id": "XCGZtKW5BAjJbLZP7", "postedAt": "2015-12-10T02:54:43.535Z", "postId": "TYEt3ZN8KwcAqQ8Nf", "htmlBody": "<p>Hey Michelle, I want to read this. Will you share the link?</p>\n", "parentCommentId": "qZqwS6RrHHyjYMRCj", "user": {"username": "joshjacobson"}}, {"_id": "wLNFmaKrefvMkFJRg", "postedAt": "2015-12-10T09:40:09.836Z", "postId": "TYEt3ZN8KwcAqQ8Nf", "htmlBody": "<p>Emailed you</p>\n", "parentCommentId": "XCGZtKW5BAjJbLZP7", "user": {"username": "Michelle_Hutchinson"}}, {"_id": "dNd4Tjx6c6rPBGsfr", "postedAt": "2015-12-10T09:41:21.646Z", "postId": "TYEt3ZN8KwcAqQ8Nf", "htmlBody": "<p>Sorry, forgot about this Dale. If you give me your email address I'd be happy to send it to you. </p>\n", "parentCommentId": "rBFizoKypExY5jPWi", "user": {"username": "Michelle_Hutchinson"}}, {"_id": "8wT9LbvZuz4RMyu7L", "postedAt": "2016-01-14T08:40:09.920Z", "postId": "TYEt3ZN8KwcAqQ8Nf", "htmlBody": "<p>I'm a London based IT Consultant and Software Developer, having read Doing Good Better over the summer I realise that I've been roughly Earning to Give for a number of years.  I'm here to soak up other people's ideas and float some of my own.</p>\n<p>My one-man consultancy company Do Right Digital has been running for almost 3 years, we've always given 10% of turnover to charity.  From May we're considering &quot;giving Wednesdays to charity&quot; - any money made on a Wednesday is ring fenced for charity.  This would help to communicate the Earning to Give model as well as bridging the gap between the average working week and our (mainly) annual giving.</p>\n", "parentCommentId": null, "user": {"username": "matcarey"}}, {"_id": "qTK5YEPBLCTCDHgxH", "postedAt": "2017-02-20T12:36:14.402Z", "postId": "TYEt3ZN8KwcAqQ8Nf", "htmlBody": "<p>I'm Kiran, I am doing a philosophy degree in Warwick University in the UK. \nI'm really interested in ethics, logic, and philosophy of science.\nI am concerned about existential risk and have very utilitarian intuitions, so this seems the right place to be!</p>\n", "parentCommentId": null, "user": {"username": "klloyd"}}, {"_id": "opxjCv9a3JRF6Zk3z", "postedAt": "2020-01-22T09:32:43.599Z", "postId": "TYEt3ZN8KwcAqQ8Nf", "htmlBody": "<html><head></head><body><p>I am DIFFO Frédéric, ph.D student on comparative littérature in université d'Artois. I am in the fourth year research. My topic base on immigration and representation of alterity in some selected subsaharian and maghrebian novels. My supervisor is Anne Gaelle Weber. My research laboratry is \"texte et culture\"</p>\n</body></html>", "parentCommentId": null, "user": {"username": "diffo-frederic87"}}, {"_id": "Pivkhwztr8HvRESpk", "postedAt": "2020-01-24T20:14:45.554Z", "postId": "TYEt3ZN8KwcAqQ8Nf", "htmlBody": "<html><head></head><body><p>am DIFFO Frédéric, Ph.D student in université d'Artois. I am doing francophone comparative literature and my supervisor is professor Anne Gaelle Weber. My research topic is based in immigration and representation of alterity in some selected subsaharian and maghrebian</p>\n</body></html>", "parentCommentId": null, "user": {"username": "diffo-frederic87"}}, {"_id": "DnrciHoESRgv74p7s", "postedAt": "2020-01-24T20:38:12.279Z", "postId": "TYEt3ZN8KwcAqQ8Nf", "htmlBody": "<html><head></head><body><p>am DIFFO Frédéric, Ph.D student in université d'Artois. I am doing francophone comparative literature and my supervisor is professor Anne Gaelle Weber. My research topic is based in immigration and representation of alterity in some selected subsaharian and maghrebian</p>\n</body></html>", "parentCommentId": null, "user": {"username": "diffo-frederic87"}}, {"_id": "moittkMJMZTZJEzgZ", "postedAt": "2020-01-27T13:59:57.150Z", "postId": "TYEt3ZN8KwcAqQ8Nf", "htmlBody": "<html><head></head><body><p>I am Fréderic DIFFO, Ph.D student in the université d'Artois. I am doing francophone comparative literature and my supervisor is professor Anne Gaelle Weber and my research laboratry is name \" texte et culture\". My research topic is based on immigration and representation of alterity in some selected subsaharian and maghrebian novels. The aim of my thesis is to show that the way that characters representing otherness through immigration in francophone novels depends on their fondamental cultural et ideological memory. I working on six novels and the authors are Tahar Ben jelloun, faizia zouari, chimamanda ngozi adichie, Fatou Diome and Leonora Miano. At last, I am in fourth year already so that, I would defend by the end of the year.</p>\n<p>Répondre</p>\n</body></html>", "parentCommentId": null, "user": {"username": "diffo-frederic87"}}, {"_id": "8xRSZg288uQneWoZn", "postedAt": "2023-01-19T10:39:05.411Z", "postId": "TYEt3ZN8KwcAqQ8Nf", "htmlBody": "<p>Hello dear all,</p><p>&nbsp;</p><p>I am Jean-Baptiste, a doctoral student in modern history, in Lille University, France. I have a commitment from 20 years in several networks for popular education and public instruction. Thus, I am working with young people, teenagers.</p><p>&nbsp;</p><p>JB</p>", "parentCommentId": null, "user": {"username": "JB Histo"}}]