[{"_id": "P8kg9ojhzeSAW6Lvj", "postedAt": "2023-05-04T21:22:32.771Z", "postId": "TyWj8ak5spu5XgHM8", "htmlBody": "<p>Great post, Jessica and Sean! To be honest, if I had read through this post around the time I graduated from my engineering degree, I would have thought harder before going into consulting (although I did not plan to stay in consulting for long, and ended up leaving after a year or so).</p><blockquote><p>All else being equal, when prioritising between defence layers, prevention is most important (before loss of life), followed by response (to contain the catastrophe), and then finally resilience (the last resort to make sure humanity and civilisation survive). However, the resilience defence layer is often the most <a href=\"https://80000hours.org/2014/01/neglectedness-and-impact/\">neglected</a> of these, which may mean that working in this area could enable you to have an outsized impact.</p></blockquote><p>To me it is unclear which layer is the most important or neglected.</p><p>I would say the most important layer is the one which is harder to break. For example, if p(\"civilisation collapse\"|\"global catastrophe\") is lower than both p(\"catastrophe\") and p(\"global catastrophe\"|\"catastrophe\"), I suppose it is reasonable to say that resilience is the most important.</p><p>In terms of neglectedness, I think we should also take into account the resources that would be invested in the event of a catastrophe. Ignoring these will tend to overestimate the neglectedness of resilience. After the catastrophe happens, lots of resources can be directed towards response and resilience, but not to prevention. So we have something like, \"resources going to resilience/response\" = \"resources going to resilience/response now\" + p(\"catastrophe\")*\"resources which would go to resilience/response in the event of a catastrophe\". I tried to make a similar point <a href=\"https://forum.effectivealtruism.org/posts/fpudvy4KB6np324Fx/philanthropy-to-the-right-of-boom-founders-pledge?commentId=EwnAg4jkuuSHogqtt\">here</a>.</p>", "parentCommentId": null, "user": {"username": "vascoamaralgrilo"}}, {"_id": "gEDueAA5zJ9KGHGLH", "postedAt": "2023-05-05T12:49:19.412Z", "postId": "TyWj8ak5spu5XgHM8", "htmlBody": "<p>Thanks for your comment Vasco! There are definitely lots of factors at play here, and the \"all else being equal\" bit in the part you quoted is doing a lot of heavy lifting and masking multiple assumptions that we could perhaps have laid out more clearly, including the assumption that p(\"civilisation collapse\") &lt;&lt; p(\"global catastrophe\") &lt;&lt; p(\"catastrophe\"), and that equal amounts of resources are going into prevention, response, and resilience.&nbsp;<br><br>This is of course not the case, but analysis of this landscape is out of scope for this iteration of the Resources Portal. This page was designed as an introduction for engineers looking into high-impact areas to do work in/start projects in, and hopefully future iterations of our Resources Portal will be able to deep dive these intricacies. Thank you for bringing this to our attention, as it's something we will look into in the future!</p>", "parentCommentId": "P8kg9ojhzeSAW6Lvj", "user": {"username": "Jessica Wen"}}, {"_id": "46Ja4F2fjSuZxufoL", "postedAt": "2023-05-23T12:45:33.573Z", "postId": "TyWj8ak5spu5XgHM8", "htmlBody": "<p>Thanks Jessica and Sean for this powerful and inspiring post.&nbsp;<br><br>I would add one more, perhaps even more important, way in which engineers can contribute here - which is more or less what you have just done!&nbsp;<br><br>As engineers, you probably don't even consciously realise this anymore, but the type of analysis you've shared here is pure engineering, it's a way of thinking that we get so drilled into us that we don't realise we didn't always think that way.&nbsp;<br><br>For example, the three layer model (prevention, response, resilience) is almost perfectly analogous to how chemical engineers study explosion safety when handling solvents. First, you ask how to prevent an explosion (safe procedures, no ignition sources, nitrogen-blanketing, ...). Second, you ask how to minimise the risk of harm if there is an explosion (safe enclosures, PPE, minimum people present, etc. ...), and third, you study how to minimise the extent of harm (fire-evacuation procedures, emergency-help, first-aid training, ...).&nbsp;<br><br>From this perspective, I'd also add one comment, which is that the assumption that each reduction of 50% in one means to total reduction of 50% is only true if they are independent. One of the most difficult challenges in a safety analysis is to identify cases where one accident can break two barriers at once. The stereotypical example of this (from my youth) was the nuclear war scenario in which the electromagnetic wave from the explosion destroyed the communication structure and so a lot of the response capability. We know about that now and can design around it, but there are probably other factors, like the viral infection that makes it impossible for the vaccine designers to do their work.&nbsp;</p><p>I look forward to seeing more and more engineers working on civilisation resilience! Thanks for getting the ball rolling with Hi-Eng!&nbsp;</p>", "parentCommentId": null, "user": {"username": "Denis "}}]