[{"_id": "rJ9SPqE9iApyC7Mou", "postedAt": "2023-03-28T19:39:41.089Z", "postId": "TYyHpiAQ3TetwRMHC", "htmlBody": "<p>I appreciate this initiative, <a href=\"https://forum.effectivealtruism.org/users/buhl?mention=user\">@Buhl</a> . &nbsp;I went to the google form and noticed it requires permissions to update. There are a lot of entries on it, and it looks like the last update was January 2022, pre FTX crash. Not sure if others felt this way, but personally this made me question whether reading through the existing ideas /coming up with new ones would be a good use of time versus parasocial.</p><p>Is your goal to find out which ideas have the greatest support on the forum, to generate more ideas, to find people interested in working on particular ideas, or something different?&nbsp;</p><p>Are you hoping people will compile and upvote/ downvote ideas here in the comments?&nbsp;</p>", "parentCommentId": null, "user": {"username": "more better "}}, {"_id": "WRkpBjMaxFGdCCtvu", "postedAt": "2023-03-29T10:24:50.892Z", "postId": "TYyHpiAQ3TetwRMHC", "htmlBody": "<p>Wonderful work! I’ve commented directly on the spreadsheet, but for the benefit of anyone who won’t check it:</p><p>Several of these ideas can be rolled into one:</p><ol><li>A remote research institute for independent researchers</li><li>Infrastructure to support independent researchers</li><li>Building vibrant EA academic communities in Africa, Asia, and Latin America</li><li>AI alignment prizes, advance market commitments, and other forms of proto–impact markets</li></ol><p>The scheme that I imagine could have all of these benefits:</p><ol><li>Find and recruit more independent researchers for high-impact research</li><li>Tap into talent pools in countries that don’t have a lot of EA presence</li><li>Circumvent restrictions on foreign donations/grants to researchers in some countries</li><li>Support independent researchers monetarily</li><li>Kickstart academic careers</li><li>Support many small research projects efficiently (low due diligence overhead)</li><li>Recruit for-profit investors such as business angels and impact investors to derisk research for researchers</li><li>Derisk research for potential risk-averse non-EA funders</li><li>Help researchers network, find potential advisors or collaborators</li><li>Provide researchers with infrastructure (servers, labs, etc.) efficiently</li><li>Monitor and improve the counterfactual impact of prize contests</li><li>Tap into corporate funding for prize contests (in high-growth industries)&nbsp;</li></ol><p>The best thing is that to my knowledge it should be fully legal to do this.</p><p>We (GoodX) are working on infrastructure to support independent researchers with funding and simplify grant applications. We’re not currently implementing this particular scheme, but that could change given the right team (experts in US securities law and startup fundraising).</p><p>The approach:</p><ol><li>Build a network:<ol><li>Set up a nonprofit think tank with some form of limited liability and a suitable purpose so that it is exempt from the requirement to register any publicly traded securities with the SEC.</li><li>Network among business angels, HNWI (including non-altruists), possibly VCs. Even $100k go a long way in low-income countries, so “high net worth” can be a low bar depending on the country.</li><li>Watch out for prize contests, AMCs, governmental and private outcome payers, etc.</li></ol></li><li>Let the investors scout out great researchers:<ol><li>An investor could be an Indian economics professor – smaller high-context investors can lead; larger low-context investors can follow.</li><li>Possibly help with the match-making, especially once we have a mature network ourselves.</li></ol></li><li>Match-make between investor + researcher and prize contest/AMC/outcome payer:<ol><li>Make contracts with large funders such as Open Phil, Gates Foundation, USAID, etc. over outcome purchases, AMCs, etc. that match the areas of expertise of the researchers.</li><li>This could even work for risk-averse funders who could not otherwise support scientific research.</li><li>Or enter the research into existing prize contests.</li></ol></li><li>Take the investment from the investor, pay the researcher a monthly contractor salary, hold some money back to cover costs.</li><li>If the researcher is successful and the outcome payment is disbursed, it goes to the investors.</li></ol><p>Meanwhile nothing keeps that think tank from also seeking grant funding and using its network to pay contract researchers from that. Especially researchers who have proven themselves in a prize contest but can’t currently find any new suitable outcome payor, could be kept under contract from grant money.</p><p>We’re always happy <a href=\"https://cal.com/goodx\">to have calls on such topics</a>!</p>", "parentCommentId": null, "user": {"username": "Telofy"}}]