[{"_id": "6ujnHgJAM7swKkgLM", "postedAt": "2022-10-13T19:16:42.044Z", "postId": "W2w7xA9AtDnjcK6DP", "htmlBody": "<p>I live in Berkeley and the amount that I learnt from this is incredible. Great guide!</p>\n", "parentCommentId": null, "user": {"username": "therealslimkt"}}, {"_id": "wNTCv7CCBRGAasd6h", "postedAt": "2022-10-13T20:11:25.380Z", "postId": "W2w7xA9AtDnjcK6DP", "htmlBody": "<p>I'm glad it was helpful! :)</p>", "parentCommentId": "6ujnHgJAM7swKkgLM", "user": {"username": "vaidehi_agarwalla"}}, {"_id": "ft3wLbxyhyXzW4rMu", "postedAt": "2022-10-14T10:55:07.874Z", "postId": "W2w7xA9AtDnjcK6DP", "htmlBody": "<p>A few other recommended attractions, from someone who lived in Oakland and Berkeley for a few years:</p>\n<ul>\n<li>Indian Rock Park (Berkeley): an incredible sunset point, one of my all-time favourite parks, great for a rock scramble or a picnic or serious bouldering if you're into that</li>\n<li>The Pacific Pinball Museum (Alameda): If you like pinball at all you should go there. You pay entry and then their like 100 pinball machines are free to play.</li>\n<li>The Exploratorium (SF): Highly interactive science museum. If you go on Thursday night, you won't have to elbow children out of the way of the exhibits. The tactile dome is a very unusual experience</li>\n<li>The Chapel of the Chimes (Oakland): Sombre and moving crematorium in Oakland. One of the most beautiful (in a sublime / sad way) places I've ever been.</li>\n<li>Berkeley Path Wanderers Association <a href=\"https://www.berkeleypaths.org/self-guidedwalks\">Resources for self-guided walks</a></li>\n</ul>\n<p>(ETA: some of these were already in the <a href=\"https://docs.google.com/spreadsheets/d/1Bl_0kXwD4rJ6DlwdIiZKfG3Y1yCDyR2aolWXY51OaCg/edit#gid=0\">Bay Area Attractions</a> spreadsheet you linked)</p>\n", "parentCommentId": null, "user": {"username": "tessa"}}, {"_id": "ewvdcCE6pH6pqLvBN", "postedAt": "2022-10-14T11:16:56.295Z", "postId": "W2w7xA9AtDnjcK6DP", "htmlBody": "<p>Good post! A nit:</p>\n<blockquote>\n<p>The Bay is a major hub because of the founders' effects - several historically important founding communities and organisations of the EA movement were founded and continue to be based here. This includes rationalist organisations like LessWrong, CFAR and MIRI in Berkeley, and separately GiveWell in San Francisco.</p>\n</blockquote>\n<p>I think of these only CFAR was founded in the Bay? GiveWell was founded in NYC, MIRI (then SIAI) in (I think) Georgia, and LW as a remote collaboration.</p>\n<p>Since GiveWell and MIRI moved to be closer to their funders we could call this \"funders' effects\" ;)</p>\n", "parentCommentId": null, "user": {"username": "Jeff_Kaufman"}}, {"_id": "dskkMHmPkRgXbQqHQ", "postedAt": "2022-10-14T12:55:48.988Z", "postId": "W2w7xA9AtDnjcK6DP", "htmlBody": "<p>Thank you!!</p>", "parentCommentId": "ft3wLbxyhyXzW4rMu", "user": {"username": "ElikaSomani"}}, {"_id": "MgwdwnNRKJbynJsxN", "postedAt": "2022-10-14T12:56:52.871Z", "postId": "W2w7xA9AtDnjcK6DP", "htmlBody": "<p>Ooh a fun history less! Thanks! I'll edit it :)&nbsp;</p>", "parentCommentId": "ewvdcCE6pH6pqLvBN", "user": {"username": "ElikaSomani"}}, {"_id": "BWRjXiraEcDcxaA5P", "postedAt": "2022-10-14T13:54:17.824Z", "postId": "W2w7xA9AtDnjcK6DP", "htmlBody": "<p>Also, the Bay Area is probably the top metro area in the world for AI capabilities R&amp;D (because of Google, OpenAI, Meta, various ex-Brain startups, Stanford, Berkeley). So if starting from scratch, there'd be a good reason to put AI Safety orgs there.&nbsp;</p>", "parentCommentId": "ewvdcCE6pH6pqLvBN", "user": {"username": "Owain_Evans"}}, {"_id": "zk9iAhNzHT39FypxF", "postedAt": "2022-10-14T14:39:36.554Z", "postId": "W2w7xA9AtDnjcK6DP", "htmlBody": "<p>Thanks for that context Jeff!</p>\n", "parentCommentId": "ewvdcCE6pH6pqLvBN", "user": {"username": "vaidehi_agarwalla"}}, {"_id": "nwxZed4gFsQ48j36s", "postedAt": "2022-10-14T18:11:11.337Z", "postId": "W2w7xA9AtDnjcK6DP", "htmlBody": "<p>Good point!  I expect it would have ended up as the main AI hub even if MIRI hadn't moved there.</p>\n", "parentCommentId": "BWRjXiraEcDcxaA5P", "user": {"username": "Jeff_Kaufman"}}, {"_id": "R2D7rvipEedSpKptm", "postedAt": "2022-10-14T19:19:05.090Z", "postId": "W2w7xA9AtDnjcK6DP", "htmlBody": "<p>Streets in small parts of San Francisco, near the downtown, are very, dirty and occupied by unsheltered people. The environment is very surprising to some people who have not been to North America before.</p><p>In these neighborhoods, there are nice hotels/hostels that are cheaply priced and near BART or public transportation.&nbsp;</p><p>In the past, some EAs, not from North America, have not been aware of the above. Because SF is very expensive, and they wanted to be frugal, some have booked cheaper accommodations and then felt very uncomfortable, especially single people or women at night. This probably affected their experience of SF and the events they were going to.</p><p>Suggestions:</p><ul><li>Check out reviews for the accommodations on line. If people mention \"The hotel is nice but is in [<strong>neighborhood X]</strong>\", it's worth Googling the mentioned neighborhood to see what is going on.</li><li>Ask friends who live in SF.</li></ul><p>&nbsp;</p><p>Note:</p><ul><li>Note many Americans/locals don't like to draw attention to the situation, because it's chronic and ongoing, it's intractable and complicated, the discussion involves cultural viewpoints many disagree on, and Americans often feel guilty/conflicted by inequality. As a result, many Americans or locals won't talk about the issues much and when they do, they will talk about it indirectly.</li><li>Homelessness is very visible, but the causal relationship between the wealth in SF and homelessness is unclear. San Francisco literally <a href=\"https://www.hoover.org/research/despite-spending-11-billion-san-francisco-sees-its-homelessness-problems-spiral-out#:~:text=San%20Francisco%20is%20slightly%20smaller,of%20Jacksonville's%20entire%20city%20budget.\">spends over $50,000 per homeless person</a>.&nbsp;</li><li>Homelessness is visible but touches on a much deeper problem of land constraints. These constraints of land (or housing laws/NIMBY) is a historically bizarre situation, I think there's a small subfield in economics which argues tech's establishment in the Bay Area, is limiting GDP/innovation by many billions of dollars. X-risk people have said this is harming X-risk.</li></ul>", "parentCommentId": null, "user": {"username": "Charles He"}}]