[{"_id": "pr2zYyKSx7N7PmFau", "postedAt": "2023-02-24T22:26:18.211Z", "postId": "W4JksntnuFABZCkCw", "htmlBody": "<blockquote><p><strong>Relative cost </strong>-- The primary downside of RBF is that it <a href=\"https://www.semanticscholar.org/paper/The-costs-of-performance-based-financing.-Kalk/b91bb14137f2109813101e25e32516dc3b41132c\"><u>costs more</u></a> (at least in the short-run) than standard grant funding and fee-for-service. This is because RBF strategies require that the Goal Funder pays evaluators to measure the outputs or outcomes.&nbsp;</p></blockquote><p>&nbsp;</p><p>Great article! Thank you!</p><p>The quoted section surprised me a bit because (and perhaps this is only true in EAish circles, including the “randomista” movement) a lot of prospective funding is based on expensive evaluations: more leveraged priories research and RCTs but also less leveraged due diligence of particular implementing organizations. When you factor this in, retrospective evaluations can even be cheaper, depending on the field: If most projects fail in obvious ways, they don’t need to be evaluated in the first place, and if the projects produce artifacts such as research reports, it’s also very cheap to evaluate those (as opposed to, e.g., malaria incidence measures that you’d have to collect from hundreds of badly run hospitals).</p><p>FYI: I’m cofounder of GoodX (<a href=\"https://impactmarkets.io\">impactmarkets.io</a>). We started out with a system that is perhaps best described as social impact bonds for high-impact research (e.g., on AI safety) and have since updated toward <a href=\"https://impactmarkets.substack.com/i/103917160/what-problems-does-it-solve\">a system that is closer to voluntary carbon credit markets in structure but still for positive impact in general rather than just carbon removal</a>.</p><p>Other groups in the space include Protocol Labs with their new <a href=\"https://hypercerts.org/\">Hypercerts Foundation</a> and <a href=\"https://manifund.org/\">Manifund</a>. There is also <a href=\"https://www.ixo.world/\">Ixo</a>, but I don’t know them personally.</p>", "parentCommentId": null, "user": {"username": "Telofy"}}]