[{"_id": "rnwBB4hT2Xn5ukdFG", "postedAt": "2022-11-16T14:19:02.240Z", "postId": "W5bT8mxvXzkrKifTE", "htmlBody": "<p>Congratulations Eirik!</p>", "parentCommentId": null, "user": {"username": "Ada-Maaria Hyvärinen"}}, {"_id": "rHqkLfnhrvasEKyAs", "postedAt": "2022-11-16T14:36:35.856Z", "postId": "W5bT8mxvXzkrKifTE", "htmlBody": "<p>This is so amazing to read! I first met Eirik in 2015 when he was studying abroad in Munich—he also helped get EA Munich off the ground together with me and others! He continues to be one of the nicest and kindest people I know, and his enthusiasm is contagious. Very well deserved!</p>", "parentCommentId": null, "user": {"username": "alfredoparra"}}, {"_id": "JdRXv9stqJegzz4E2", "postedAt": "2022-11-16T14:59:30.213Z", "postId": "W5bT8mxvXzkrKifTE", "htmlBody": "<p>Absolutely well-deserved, well done Eirik and the rest of the Norwegian community.</p>", "parentCommentId": null, "user": {"username": "HaydnBelfield"}}, {"_id": "jfwhxdti5XD7tkbhF", "postedAt": "2022-11-16T16:19:02.115Z", "postId": "W5bT8mxvXzkrKifTE", "htmlBody": "<p>Congrats Eirik!</p>\n", "parentCommentId": null, "user": {"username": "Ben_West"}}, {"_id": "8PeivfyYaJS9rZykD", "postedAt": "2022-11-16T17:32:01.573Z", "postId": "W5bT8mxvXzkrKifTE", "htmlBody": "<p>Congratulations!</p><p>I hope this isn't inappropriate given the celebratory context, but I want to push back against the idea that the EA movement, or any of its local versions, has a \"founder\". Just as I think it is incorrect to call Will MacAskill (or anyone else) the \"founder of the EA movement\", I think it is incorrect to call Eirik Mofoss the \"founder of the Norwegian EA movement\". &nbsp;Our movement may have leaders, but it has no founders.</p>", "parentCommentId": null, "user": {"username": "Pablo_Stafforini"}}, {"_id": "RyNwFzcQvkLdiwXFX", "postedAt": "2022-11-17T10:26:41.234Z", "postId": "W5bT8mxvXzkrKifTE", "htmlBody": "<p>why?</p>", "parentCommentId": "8PeivfyYaJS9rZykD", "user": {"username": "Hamish Doodles"}}, {"_id": "KJSJyvRA4FCq4wFkR", "postedAt": "2022-11-17T11:17:34.170Z", "postId": "W5bT8mxvXzkrKifTE", "htmlBody": "<p>This is wonderful to hear! Every time I've talked with the Norwegian EA community, there has been a strong sense of integrity, ethics, and a will to do good along with tangible results. I'm consistently impressed and it's wonderful to see that effort get rewarded and for that impact to get a public voice.&nbsp;</p><p>Congratulations!</p>", "parentCommentId": null, "user": {"username": "esben-kran"}}, {"_id": "fJDgrrEwHvTSiMSxL", "postedAt": "2022-11-17T15:48:34.651Z", "postId": "W5bT8mxvXzkrKifTE", "htmlBody": "<p>It just seems to me that EA is not the sort of thing that can be \"founded\" by a couple of people. It's like claiming that someone \"founded\" science or the enlightenment. By extension, it strikes me as inappropriate to credit someone as the \"founder\" of a local branch of EA, just as it would be inappropriate to credit someone for \"founding\" the French scientific movement or the German enlightenment movement.</p>", "parentCommentId": "RyNwFzcQvkLdiwXFX", "user": {"username": "Pablo_Stafforini"}}, {"_id": "ag97SJeh8P4E9m9nu", "postedAt": "2022-11-18T10:41:24.909Z", "postId": "W5bT8mxvXzkrKifTE", "htmlBody": "<p>Interesting, I have the exact opposite intuition! I think calling Eirik a co-founder of EA in Norway is simply a descriptive factually correct statement. He was one of two people that started the first EA group in Norway that subsequently grew into the community it is today.<br><br>On the other hand, I don't like to think that the movement has any leaders. It's a community of widely varying views and approaches, united by common values. Actually, EA Norway, which is &nbsp;the closest you'll find to a formal organisation for EA in Norway, is a democratic membership organisation where the members stake out the priorities and goals of the org every year. The board is elected by the members with a given mandate, and the board are ultimately accountable to the members. I believe there were roughly 400 members last time I checked.<br><br>This might be unusual by international EA standards, I've never really reflected on it! It is however normal in scandinavian countries, many organisations and all political parties are run in a similar manner.</p>", "parentCommentId": "8PeivfyYaJS9rZykD", "user": {"username": "HakonHarnes"}}, {"_id": "c6nhhGd9DCq6DWTev", "postedAt": "2022-11-18T13:47:02.531Z", "postId": "W5bT8mxvXzkrKifTE", "htmlBody": "<p>I think it's perfectly fine to call someone the founder of EA Norway—an organization—but I continue to believe it is inappropriate to call them the founder \"of the Norwegian EA movement\". I don't share your intuition that starting the first EA group in a region makes you the founder of the EA movement in that region. For example, I started the first LW group in the Spanish-speaking world but it would be bizarre to call me the \"founder of the Spanish-speaking rationalist movement\". &nbsp;Expressions that seem more appropriate to me to convey what I take \"founder\" to be trying to communicate are \"a key figure in the Norwegian EA movement\" and \"an early figure in the Norwegian EA movement\". Or you could just say \"started the first Norwegian EA chapter\" or \"co-founded EA Norway\".</p><p>I'm happy to continue this discussion, but I also feel uneasy about diverting attention away from Eirik's impressive accomplishment. The karma system and filtering algorithms have made my original comment more visible than I intended it to be.</p>", "parentCommentId": "ag97SJeh8P4E9m9nu", "user": {"username": "Pablo_Stafforini"}}, {"_id": "da5nGNjLJmoCnTu8C", "postedAt": "2022-11-18T17:35:36.051Z", "postId": "W5bT8mxvXzkrKifTE", "htmlBody": "<p>The examples you provided are fine alternatives :+1:</p>", "parentCommentId": "c6nhhGd9DCq6DWTev", "user": {"username": "HakonHarnes"}}]