[{"_id": "RbnvMCEd7CTEpGfpd", "postedAt": "2022-11-04T22:59:29.503Z", "postId": "W5taETbarXR9CQnEQ", "htmlBody": "<p>To reiterate my views from previous discussions: while it does seem impossible (or not worth it) to give everyone individualized feedback, this is not really the point. The point is the ability of the community to understand CEA policies and to oversee them, point out problems when those occur, and \"express [our] criticisms, observations, and advice\" as you wrote. In this case, that means having info about the admissions criteria that you've so far declined to give, for fear of people gaming the system.</p>\n<p>So this post seems to signal a transition from \"we will not tell you what our policies are, but we'll at least publicly engage with your criticism\" to the even less transparent \"we will just not tell you what our policies are\". I strongly think this is the wrong direction to move in.</p>\n", "parentCommentId": null, "user": {"username": "Guy Raveh"}}, {"_id": "wF4963wSRGECtNasf", "postedAt": "2022-11-09T19:29:54.337Z", "postId": "W5taETbarXR9CQnEQ", "htmlBody": "<p>If CEA do not want to be driven by the community, I think they should consider whether they should present themselves as representatives of the community. For instance, their ownership of <a href=\"http://effectivealtruism.org\">effectivealtruism.org</a> and branding their events as Effective Altruism Global (as opposed to say, adding \"Centre for\" to each of these).</p>\n", "parentCommentId": null, "user": {"username": "jooke"}}, {"_id": "CaKqHFk9oAYJCMftc", "postedAt": "2022-11-11T15:28:45.443Z", "postId": "W5taETbarXR9CQnEQ", "htmlBody": "<p>There’s&nbsp;<strong>an underlying tension</strong> where CEA struggles to be both “top down” and “bottom up” at the same time:</p><blockquote><p><i>Apply now, and&nbsp;</i><a href=\"https://www.eaglobal.org/faqs/\"><i><u>please err on the side of applying</u></i></a><i>!</i></p><p><i>But we get thousands of submissions so “it’s not the best use of our time to give feedback [on rejections]…these things are subjective.”</i></p></blockquote><p>(When I say “you” further in this comment, I am referring to CEA generally and not the author specifically.)&nbsp;<strong>Tl;dr see four recommendations below</strong>.</p><p><strong>From the “bottom up”</strong> vantage point, CEA&nbsp;<a href=\"https://forum.effectivealtruism.org/posts/cvzEpGgmQ8BefiwGt/making-effective-altruism-enormous\"><u>wants to grow the community</u></a>. You want more people working for and funding EA interventions. You appreciate that diverse worldviews bring to light overlooked areas, and you can’t predict where breakthroughs come from. You recognize the benefits of broadening the EA tent to match talent including management and line workers.</p><p><strong>From the “top down”&nbsp;</strong>vantage point, CEA wants high quality programs and events: a position of thought leadership, a high epistemic standard, optimal 1-1 networking, and influence over policy, talent and funding to do the most good. Therefore, you reasonably choose to gate conferences, classes and programs. You don’t want to dilute the core principles or attract bad actors.</p><p>It feels to me like CEA chooses to apply the “top down” or “bottom up” lens&nbsp;<strong>as appropriate for itself&nbsp;</strong>in most situations. However, this can be confusing or misleading to the bulk of the EA community who works alongside CEA but is unaffiliated with it.&nbsp;</p><p>As I’ve previously commented in&nbsp;<a href=\"https://forum.effectivealtruism.org/posts/dsCTSCbfHWxmAr2ZT/open-ea-global?commentId=67YisJEPomHmHSvFH#67YisJEPomHmHSvFH\"><u>Open EA Global</u></a>,&nbsp;<strong>EA is a personal choice/identity</strong>. It’s not a job title earned or a license you receive through a license board. So when people are turned away from events or courses - that they are excited to attend or pay for - with unsigned form letters and vague calls-to-action - it feels like a value-based judgment even when it is not.</p><p>I pursued four unrelated programs<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefcb98l45oblv\"><sup><a href=\"#fncb98l45oblv\">[1]</a></sup></span>&nbsp;and all of these applications were lengthy and personal. I felt like&nbsp;<strong>CEA took my trust and willingness to provide detailed personal information for granted</strong>. I’ve encountered only a few organizations (graduate degree programs come to mind) that came close to asking for that level of qualitative detail - and in those cases I found more clarity on what the bar was and what the upside could be. So I can see where feelings of frustration or dissatisfaction are compounded when folks don’t receive commensurate feedback.</p><p>Slight aside, based on my professional expertise in branding and customer service, it’s&nbsp;<strong>not obvious that the risks of “bad actors” attending events/programs outweighs the risks of “disgruntled ex-EAs” diluting the EA brand in other venues</strong>. It’s been suggested that more public criteria for applications might allow people to “game the system,” but you can also motivate good actors to do what’s necessary to qualify next time. I’m not sure if the visible cost of bad seeds at an event is higher than the invisible cost of&nbsp;<a href=\"https://forum.effectivealtruism.org/posts/hur3ejqvA2QmYEfZa/case-study-of-ea-global-rejection-criticisms-solutions\"><u>people being turned away</u></a> who might sour on EA altogether. If not handled with care, rejected applicants become vectors of negative publicity throughout the nonprofit landscape and beyond. Measuring and understanding this could be a useful research project.</p><p>Here are four actionable recommendations to improve this process (in no particular order):</p><ul><li><strong>Don’t call everything an “application.”</strong> As silly as it sounds, just calling something an application sets expectations that the process will be painful and there will be a harsh judgment of “accept/reject.” EAs could, for instance, more softly “request an EAG slot,” “petition to join a seminar,” etc.</li><li><strong>Don’t encourage all folks to apply to high-bar programs. </strong>If you already have high rejection rates, casting a wider net alienates more people. You can still use targeted outbound communications to nudge relevant folks.</li><li><strong>Allow EAs to vouch for other EAs. </strong>By the author’s admission, the staff often makes mistakes - there’s just too much information and too few resources (time, staff) to process it. Rely on the trust of others in the community to make the process smoother. If someone is motivated enough to get several references, we probably want them involved.</li><li><strong>Make CEA assets (EAG keynotes, Virtual Program syllabi) more discoverable. </strong>E.g. dozens of EAs present&nbsp;<a href=\"https://www.youtube.com/channel/UCEfASxwPxzsHlG5Rf1-4K9w\"><u>hour-long keynotes&nbsp;</u></a>at EAG conferences, but for most of these folks, only a few thousand people will ever see them! If CEA cultivates this content and makes it more prominent across owned assets and communications, there’s an alternate path for EAs to engage without needing to apply to constrained programs.</li></ul><p>Thanks for listening. I acknowledge that&nbsp;<strong>gatekeeping EA programs is a thankless job</strong>. I’m interested in making the process better both as a marketing leader with relevant experience and as a community member who sees opportunities for CEA to overcome its own hurdles to doing more good! Feel free to take or leave any of my suggestions and DM me if you want to dig deeper on anything.</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fncb98l45oblv\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefcb98l45oblv\">^</a></strong></sup></span><div class=\"footnote-content\"><p><i>Intro EA Virtual Program and 80k Hours Advising (accepted), EAG DC and EAGx Berlin (rejected).</i></p></div></li></ol>", "parentCommentId": null, "user": {"username": "Steven Dupree"}}]