[{"_id": "DhLuyd7pjLnNvvjw7", "postedAt": "2022-09-21T12:48:01.273Z", "postId": "W6gGKCm6yEXRW5nJu", "htmlBody": "<p>This is awesome, I am glad that someone built this!</p>", "parentCommentId": null, "user": {"username": "emre kaplan"}}, {"_id": "tWCaM8uDACwFQog5F", "postedAt": "2022-09-21T13:59:52.089Z", "postId": "W6gGKCm6yEXRW5nJu", "htmlBody": "<p>Thanks for this! I am excited to try it!</p>\n", "parentCommentId": null, "user": {"username": "Peterslattery"}}, {"_id": "3ToZNof8TkgrJAbMa", "postedAt": "2022-09-22T00:08:39.011Z", "postId": "W6gGKCm6yEXRW5nJu", "htmlBody": "<blockquote><p>But anecdotally, many EAs still feel uncomfortable quantifying their intuitions and continue to prefer using words like “likely” and “plausible” which could be interpreted in many ways.</p><p>This issue is <strong>likely</strong> to get worse as the EA movement attempts to grow quickly, with many new members joining who are coming in with various backgrounds and perspectives on the value of subjective credences</p></blockquote><p>&nbsp;</p><p>Don't take this as a serious criticism; I just found it funny.</p>", "parentCommentId": null, "user": {"username": "Isaac King"}}, {"_id": "qZsHhLmihu39r6M7n", "postedAt": "2022-09-22T05:18:54.936Z", "postId": "W6gGKCm6yEXRW5nJu", "htmlBody": "<p>Yeah I realized this when proofreading and left it as I thought it drove home my point well :p</p>\n", "parentCommentId": "3ToZNof8TkgrJAbMa", "user": {"username": "elifland"}}, {"_id": "JKSctdJeWNR4pmvvX", "postedAt": "2022-10-02T14:09:36.310Z", "postId": "W6gGKCm6yEXRW5nJu", "htmlBody": "<p>This seems cool!</p>\n<p>When I saw the word \"app\" I assumed 'oh cool I can download this on my phone and maybe I'll be tempted to fiddle with it in spare moments similarly to how I get tempted to scroll social media.' Seems it's just on a website for now? I'm less optimistic that I'll remember / get tempted to use it in this format.</p>\n<p>(Not a criticism, just a reflection.)</p>\n", "parentCommentId": null, "user": {"username": "Jamie_Harris"}}, {"_id": "zrXTrsXjD3w5DM6q7", "postedAt": "2022-10-03T11:07:14.831Z", "postId": "W6gGKCm6yEXRW5nJu", "htmlBody": "<p>I might be biased because I had an idea for something very similar, but I think this is amazing and I think hit on something very, very interesting. I found the calibration training game very addictive (in a good way) &nbsp;and actually played it for for a few hours. &nbsp;</p><p>I think it might be because I play it in particular way though:</p><ul><li>I always set it to 90%.</li><li>Then, I only put in orders of magnitudes, even when the prompt and mask doesn't force the user to do this. &nbsp;So for instance, 'What percent of the world's population was killed by the 1918 flu pandemic?' I put in: 90% Confidence Interval, Lower Bound: 1%, Upper Bound: 10%. This has two advantages:&nbsp;</li></ul><ol><li>I can play the game very quickly - I &nbsp;can do a rough BOTEC in my head.&nbsp;</li><li>I'm almost always accurate but not very precise but when I'm not, I'm literally orders of magnitude off and I get this huge prediction error signal - and that is very memorable (and I feel a bit dumb! :D). This might also guide people towards those parts of my model of the world, where I have biggest gaps in my knowledge (certain scientific subjects). 'It's better to be roughly right than precisely wrong'. I think you could implement a spaced repetition feature based on how many orders of magnitude you’re off, where the more OOMs you're off, the earlier it prompts you with the same question again (so if you're say &gt;3 orders of magnitude off it prompts you within the same session, if you're 2 orders of magnitude of within 24 hours, 1 within in 3 days (from Remnote)). You could preferentially prioritize displaying questions that people often get wrong, perhaps even personalize it using ML.</li></ol><p>With that in mind, here are some feature suggestions:</p><ol><li>You're already pretty good at getting people to make rough orders of magnitude estimations, by often using scientific notation, but you could zero in on this aspect of the game.</li></ol><ul><li>Add even higher confidence setting like 95% and 99%, and perhaps make that the default. This will get users to answer questions faster.</li><li>Restrict the input to orders of magnitude or make that the default. It might also be good to select million, 10 million, 100M from a drop down menu, so that people gets faster and is more reinforcing.</li><li>While I appreciate that I got more of an intuitive grasp of scientific notation playing the game (how many 0s does a trillion have again?), have the word 'billion' displayed when putting in the 10^12.&nbsp;</li><li>When possible, try to contextualize where possible (I do this in this <a href=\"https://forum.effectivealtruism.org/posts/8rpBtdw35YzSdx4pP/dataset-of-trillion-dollar-figures \">post on trillion dollar figures</a>: 'So how can you conceptualize $1 trillion? 1 trillion is 1,000 billion. 1 billion is 1,000 million. Houses often costs ~1 million. So 1 trillion ≈ 1 million houses—a whole city.')</li><li>I like the timer feature, but perhaps consider either reducing the time per question even further or give more point if one answers faster.</li></ul><p>If you gamify this properly, I think this could be the next Sporcle (but much more useful better).</p>", "parentCommentId": null, "user": {"username": "HaukeHillebrandt"}}, {"_id": "2ocbAXWeTcMmpMdtG", "postedAt": "2023-03-21T22:03:26.495Z", "postId": "W6gGKCm6yEXRW5nJu", "htmlBody": "<blockquote><p>I think you could implement a spaced repetition feature based on how many orders of magnitude you’re off, where the more OOMs you're off, the earlier it prompts you with the same question again</p></blockquote><p>&nbsp;</p><p>This is a great idea, so we made <a href=\"https://www.quantifiedintuitions.org/anki-with-uncertainty\">Anki with Uncertainty</a> to do exactly this!</p><p>Thank you Hauke for the suggestion :D</p><p>I think we'll keep the calibration app as a pure calibration training game, where you see each question only once. Anki is already the king of spaced repetition, so adding calibration features to it seemed like a natural fit.</p>", "parentCommentId": "zrXTrsXjD3w5DM6q7", "user": {"username": "Adam Binks"}}, {"_id": "cGmvTrs7qBcJWve3n", "postedAt": "2023-08-16T15:23:44.293Z", "postId": "W6gGKCm6yEXRW5nJu", "htmlBody": "<p>We've added a new deck of questions to the calibration training app - <a href=\"https://www.quantifiedintuitions.org/calibration?deck=owid\"><strong>The World, then and now</strong></a>.</p><p>What was the world like 200 years ago, and how has it changed? Featuring charts from Our World in Data.</p><p>Thanks to Johanna Einsiedler and Jakob Graabak for helping build this deck!</p><p>We've also split the existing questions into decks, so you can focus on the topics you're most interested in:</p><figure class=\"image image_resized\" style=\"width:55.32%\"><img src=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/cGmvTrs7qBcJWve3n/mbm6ft507bajdffkmna9\" srcset=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/cGmvTrs7qBcJWve3n/nwezfepf7w9kabhn1jva 100w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/cGmvTrs7qBcJWve3n/xxfoobxzakly4ej0n3zv 200w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/cGmvTrs7qBcJWve3n/vkfotnb7nd48yum2ynnd 300w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/cGmvTrs7qBcJWve3n/ewzpmshd4kwlnapjhpgi 400w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/cGmvTrs7qBcJWve3n/a6krdijt5wq2grnqfoqr 500w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/cGmvTrs7qBcJWve3n/hpvjfcjllftpqauym7fd 600w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/cGmvTrs7qBcJWve3n/hboijtjcmzja4bd1eudg 700w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/cGmvTrs7qBcJWve3n/f15zorchf5mo1hfq8ekj 800w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/cGmvTrs7qBcJWve3n/n4nqy9jndxpsdzf6mgvk 900w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/cGmvTrs7qBcJWve3n/lu8vlh1mhtxkywl38epq 990w\"></figure>", "parentCommentId": null, "user": {"username": "Adam Binks"}}]