[{"_id": "8uTb6w6JkkYHgTT2u", "postedAt": "2022-09-23T16:56:31.503Z", "postId": "W7C5hwq7sjdpTdrQF", "htmlBody": "<p>Minor nitpick: You describe your subjective probabilities in terms of fair betting odds, but aren't betting odds misleading/confusing, since if AGI kills everyone, there's no payout? Even loans that are forgiven or paid back depending on the outcome could be confusing, because the value of money could drastically change, although you could try to adjust for that like inflation. I'm not sure such an adjustment would be accurate, though.</p>\n<p>Maybe you could talk about betting odds as if you're an observer outside this world or otherwise assume away (causal and acausal) influence other than through the payout. Or just don't use betting odds.</p>\n", "parentCommentId": null, "user": {"username": "MichaelStJules"}}, {"_id": "tsxoaaudP53pR4yBh", "postedAt": "2022-09-23T18:54:21.863Z", "postId": "W7C5hwq7sjdpTdrQF", "htmlBody": "<p>Two questions (although I very probably won't make a submission myself):</p>\n<ol>\n<li>\n<p>How likely do you think it is that anyone will win?</p>\n</li>\n<li>\n<p>How many hours of work do you expect a winning submission to take? The reports you cite for informing your views seem like they were pretty substantial.</p>\n</li>\n</ol>\n", "parentCommentId": null, "user": {"username": "MichaelStJules"}}, {"_id": "oyZNS2Xkgi8sEApcE", "postedAt": "2022-09-23T19:01:08.497Z", "postId": "W7C5hwq7sjdpTdrQF", "htmlBody": "<p>I'm toying with a project to gather reference classes for AGI-induced extinction and AGI takeover. If someone would like to collaborate, please get in touch.</p><p>(I'm aware of and giving thought to <a href=\"https://en.wikipedia.org/wiki/Reference_class_forecasting#Reference_class_tennis\">reference class tennis</a> concerns but still think something like this is neglected.)</p>", "parentCommentId": null, "user": {"username": "zdgroff"}}, {"_id": "zYL5WHbnPtpiighFq", "postedAt": "2022-09-23T20:08:54.087Z", "postId": "W7C5hwq7sjdpTdrQF", "htmlBody": "<p>Are timelines-probabilities in this post conditional on no major endogenous slowdowns (due to major policy interventions on AI, major conflict due to AI, pivotal acts, safety-based disinclination, etc.)?</p>", "parentCommentId": null, "user": {"username": "zsp"}}, {"_id": "LznvjtLqgiWsS6dSQ", "postedAt": "2022-09-23T20:38:18.345Z", "postId": "W7C5hwq7sjdpTdrQF", "htmlBody": "<p>This is an excellent idea and seems like a good use of money, and the sort of thing that large orgs should do more of.</p>\n<p>It looks to me like there is a gap in the space of mind-changing arguments that the prizes cover. The announcement raises the possibility that \"a bunch of this AI stuff is basically right, but we should be focusing on entirely different aspects of the problem.\" But it seems to me that if someone successfully argues for this position, they won't be able to win any of the offered prizes.</p>\n<p>Relatedly, if someone argues \"AI is as important as you think, but some other cause is even more important than AI risk and you should be allocating more to it\", I don't think this would win a prize, but it seems deserving of one.</p>\n<p>(But it does seem harder to determine the winning criteria for prizes on those types of arguments.)</p>\n", "parentCommentId": null, "user": {"username": "MichaelDickens"}}, {"_id": "WSQJhQKnL6kTneG9w", "postedAt": "2022-09-23T20:58:57.232Z", "postId": "W7C5hwq7sjdpTdrQF", "htmlBody": "<p>After thinking some more, it also occurs to me that it would be easier to change your prioritization by changing your beliefs about expected tractability. For example, shifting P(misalignment x-risk|AGI) from 15% to 1.5% would be very hard, but my intuition is that shifting your subjective {expected total money required to solve AI alignment} by a factor of 10 would be significantly easier, and both have the same effect on the cost-effectiveness of AI work.</p>\n<p>On the other hand, total money to solve AI alignment might be the wrong metric. Perhaps you expect it only costs (say) $1 billion, which is well within your budget, but that it costs 20 person-years of senior grantmaker time to allocate the money correctly. In that case, a 10x change in cost-effectiveness matters less than 10x (it still matters somewhat because higher cost-effectiveness means you can afford to spend less time thinking about which grants to make, and vice versa).</p>\n", "parentCommentId": "LznvjtLqgiWsS6dSQ", "user": {"username": "MichaelDickens"}}, {"_id": "s2KxaEXrLQfwhS7vg", "postedAt": "2022-09-23T21:10:47.927Z", "postId": "W7C5hwq7sjdpTdrQF", "htmlBody": "<blockquote><p>Maybe you could talk about betting odds as if you're an observer outside this world or otherwise assume away (causal and acausal) influence other than through the payout.</p></blockquote><p>Yes, the intention is roughly something like this.</p>", "parentCommentId": "8uTb6w6JkkYHgTT2u", "user": {"username": "Nick_Beckstead"}}, {"_id": "hduodGwtYmqZwS5t7", "postedAt": "2022-09-23T21:12:34.658Z", "postId": "W7C5hwq7sjdpTdrQF", "htmlBody": "<p>Thanks for the feedback! This is an experiment, and if it goes well we might do more things like it in the future. For now, we thought it was best to start with something that we felt we could communicate and judge relatively cleanly.</p>", "parentCommentId": "LznvjtLqgiWsS6dSQ", "user": {"username": "Nick_Beckstead"}}, {"_id": "axs6MQHDFBHCif3f9", "postedAt": "2022-09-23T21:12:54.756Z", "postId": "W7C5hwq7sjdpTdrQF", "htmlBody": "<p>No, they are unconditional.</p>", "parentCommentId": "zYL5WHbnPtpiighFq", "user": {"username": "Nick_Beckstead"}}, {"_id": "pBiWPdcZc5CiJ8amL", "postedAt": "2022-09-23T21:17:55.770Z", "postId": "W7C5hwq7sjdpTdrQF", "htmlBody": "<p>We are very unsure on both counts! There are some <a href=\"https://manifold.markets/search?s=score&amp;f=open&amp;q=future+fund\">Manifold Markets</a> on the first question, though!<br><br>I do think articles wouldn't necessarily need to be that long to be convincing to us, and this may be a consequence of Open Philanthropy's thoroughness. Part of our hope for these prizes is that we'll get a wider range of people weighing in on these debates (and I'd expect less length there).</p>", "parentCommentId": "tsxoaaudP53pR4yBh", "user": {"username": "Nick_Beckstead"}}, {"_id": "cenZyTQs32xPqau5N", "postedAt": "2022-09-23T21:20:28.634Z", "postId": "W7C5hwq7sjdpTdrQF", "htmlBody": "<p>There are some better processes that would be used for some smaller groups of high-trust people competing with each other, but I think we don't really have a good process for this particular use case of:<br><br>* Someone wants to publish something<br>* They are worried it might be an information hazard<br>* They want someone logical to look at it and assess that before they publish<br><br>I think it would be a useful service for someone to solve that problem. I am certainly feeling some pain from it right now, though I'm not sure how general it is. (I would think it's pretty general, especially in biosecurity, and I don't think there are good scalable processes in place right now.)</p>", "parentCommentId": "THw7j8h7btJFaiFm4", "user": {"username": "Nick_Beckstead"}}, {"_id": "WrtoqMXjuAWsuiKRD", "postedAt": "2022-09-23T23:12:50.144Z", "postId": "W7C5hwq7sjdpTdrQF", "htmlBody": "<p>Link doesn't work for me. What does work for me is going to <a href=\"http://manifold.markets/\">http://manifold.markets/</a> and searching \"future fund\", it does work (and this gives me the exact URL that you linked, so I'm not sure why the link doesn't work).</p>\n", "parentCommentId": "pBiWPdcZc5CiJ8amL", "user": {"username": "MichaelDickens"}}, {"_id": "mw6fJdzzCbDqiHCtK", "postedAt": "2022-09-24T00:18:41.460Z", "postId": "W7C5hwq7sjdpTdrQF", "htmlBody": "<p>The \"go extinct\" condition  is a bit fuzzy.  It seems like it would be better to express what you want to change your mind about as something more like (forget the term for this). P(go extinct| AGI)/P(go extinct).</p>\n<p>I know you've written the question in terms of go extinct because of AGI but I worry this leads to relatively trivial/uninformative about AI ways to shift that value upward.</p>\n<p>For instance, consider a line of argument:</p>\n<ol>\n<li>\n<p>AGI is quite likely (probably by your own lights) to be developed by 2070.</p>\n</li>\n<li>\n<p>If AGI is developed either it will suffer from serious alignment problems (so reason to think we go extinct) or it will seem to be reliable and extremely capable so will quickly be placed into key roles controlling things like nukes, military responses etc...</p>\n</li>\n<li>\n<p>The world is a dangerous place and there is a good possibility that there is a substantial nuclear exchange between countries before 2070 which would substantially curtail our future potential (eg by causing a civ collapse which, due to our use of all much of the easily available fossil fuels/minerals etc we can't recover from).</p>\n</li>\n<li>\n<p>By 2 that exchange will, with high probability, have AGI serving as a key element in the causal pathway that leads to the exchange.  Even tho the exchange may we'll have happened w/o AGI it will be the case that the ppl who press the button relied on critical Intel collected by AGI or AGI was placed directly in charge of some of the weapons systems involved in one of the escalating incidents etc...</p>\n</li>\n</ol>\n<p>I think it might be wise to either</p>\n<p>a) Shift to a condition in terms of the ratio between chance of extinction and chance of extinction conditional on AGI so the focus is on the effect of AGI on likelihood of extinction.</p>\n<p>b) If not that at least clarify the kind of causation required.  Is it sufficient that the particular causal pathway that occured include AGI somewhere in it?  Can I play even more unfairly and simply point out that by butterfly effect style argument the particular incident that leads to extinction is probably but for caused by almost everything that happens before (if not for some random AI thing years ago the soldiers who provoked the initial confrontation would probably have behaved/been different and instead of that year and incident it would have been one year before or hence).</p>\n<p>But hey, if you aren't going to clarify away these issues or say that you'll evaluate to the spirit of the Q not technical formulation  I'm going to include in my submission (if I find I have the time for one) a whole bunch of technically responsive but not really what you want arguments about how extinction from some cause is relatively likely and that AGI will appear in that causal chain in a way that makes it a cause   of the outcome.</p>\n<p>I mean I hope you actually judge on something that ensures you're really learning about impact of AGI but gotta pick up all the allowed percentage points one can ;-).</p>\n", "parentCommentId": null, "user": {"username": "TruePath"}}, {"_id": "cEyhJ2YGSknkBMQDF", "postedAt": "2022-09-24T01:04:55.059Z", "postId": "W7C5hwq7sjdpTdrQF", "htmlBody": "<p>Do you believe some statement of this form?<br><br>\"FTX Foundation will not get submissions that change its mind, but it would have gotten them if only they had [fill in the blank]\"</p><p>E.g., if only they had…</p><ul><li>Allowed people to publish not on EA Forum / LessWrong / Alignment Forum</li><li>Increased the prize schedule to X</li><li>Increased the window of the prize to size Y</li><li>Advertised the prize using method Z</li><li>Chosen the following judges instead</li><li>Explained X aspect of their views better</li></ul><p>Even better would be a statement of the form:</p><ul><li>\"I personally would compete in this prize competition, but only if...\"</li></ul><p>If you think one of these statements or some other is true, please tell me what it is! I'd love to hear your pre-mortems, and fix the things I can (when sufficiently compelling and simple) so that we can learn as much as possible from this competition!&nbsp;</p><p>I also think predictions of this form will help with our learning, even if we don't have time/energy to implement the changes in question.</p>", "parentCommentId": null, "user": {"username": "Nick_Beckstead"}}, {"_id": "TmcPhg2bgaypcZJ6Z", "postedAt": "2022-09-24T01:12:19.461Z", "postId": "W7C5hwq7sjdpTdrQF", "htmlBody": "<p>I don't have anything great, but the best thing I could come up with was definitely \"I feel most stuck because I don't know what your cruxes are\".&nbsp;</p><p>I started writing a case for why I think AI X-Risk is high, but I really didn't know whether the things I was writing were going to be hitting at your biggest uncertainties. My sense is you probably read most of the same arguments that I have, so our difference in final opinion is probably generated by some other belief that you have that I don't, and I don't really know how to address that preemptively.&nbsp;</p><p>I might give it a try anyways, and this doesn't feel like a defeater, but in this space it's the biggest thing that came to mind.</p>", "parentCommentId": "cEyhJ2YGSknkBMQDF", "user": {"username": "Habryka"}}, {"_id": "2mD3pWBZjvhbjpgod", "postedAt": "2022-09-24T01:19:33.838Z", "postId": "W7C5hwq7sjdpTdrQF", "htmlBody": "<p>Worth noting is that money like this is absolutely capable of shifting people's beliefs through motivated reasoning. Specifically, I might be tempted to argue for a probability outside the Future Fund's threshold, and for research I do to be motivated in favor of updating in this direction. Thus, my strategy would be to figure out your beliefs before looking at the contest, then look at the contest to see if you disagree with the Future Fund.</p><p>The questions are:</p><p>“P(misalignment x-risk|AGI)”: Conditional on AGI being developed by 2070, humanity will go extinct or drastically curtail its future potential due to loss of control of AGI</p><p>AGI will be developed by January 1, 2043</p><p>AGI will be developed by January 1, 2100</p><p>To be answered as a percentage.</p>", "parentCommentId": null, "user": {"username": "Jay Bailey"}}, {"_id": "SzNJ4hePwFrW2c9KZ", "postedAt": "2022-09-24T01:57:54.506Z", "postId": "W7C5hwq7sjdpTdrQF", "htmlBody": "<p>Agree with <a href=\"https://forum.effectivealtruism.org/posts/W7C5hwq7sjdpTdrQF/announcing-the-future-fund-s-ai-worldview-prize?commentId=TmcPhg2bgaypcZJ6Z\">Habryka</a>: I believe there exist decisive reasons to believe in shorter timelines and higher P(doom) than you accept, but I don't know what your cruxes are.</p>", "parentCommentId": "cEyhJ2YGSknkBMQDF", "user": {"username": "zsp"}}, {"_id": "rCzudRAgkHPdKFkWy", "postedAt": "2022-09-24T03:01:37.860Z", "postId": "W7C5hwq7sjdpTdrQF", "htmlBody": "<p>Do you believe that there is something already published that should have moved our subjective probabilities outside of the ranges noted in the post? If so, I'd love to know what it is! Please use this thread to collect potential examples, and include a link. Some info about why it should have done that (if not obvious) would also be welcome. (Only new posts are eligible for the prizes, though.)</p>", "parentCommentId": null, "user": {"username": "Nick_Beckstead"}}, {"_id": "R7GMEvqJDvQSiDBEG", "postedAt": "2022-09-24T03:35:17.806Z", "postId": "W7C5hwq7sjdpTdrQF", "htmlBody": "<p>I think considerations like those presented in Daniel Kokotajlo's <a href=\"https://www.lesswrong.com/posts/rzqACeBGycZtqCfaX/fun-with-12-ooms-of-compute\">Fun with +12 OOMs of Compute</a> suggest that you should have ≥50% credence on AGI by 2043.</p>", "parentCommentId": "rCzudRAgkHPdKFkWy", "user": {"username": "zsp"}}, {"_id": "FtxFv2jEoB75gjnnk", "postedAt": "2022-09-24T04:02:54.967Z", "postId": "W7C5hwq7sjdpTdrQF", "htmlBody": "<p>If you think they're decisive, shouldn't you be able to write a persuasive argument without knowing the cruxes, although with (possibly much) more work?</p>\n", "parentCommentId": "SzNJ4hePwFrW2c9KZ", "user": {"username": "MichaelStJules"}}, {"_id": "mkfT2HRKcoeTysMtm", "postedAt": "2022-09-24T04:26:11.680Z", "postId": "W7C5hwq7sjdpTdrQF", "htmlBody": "<p>Sure (with a ton of work), though it would almost entirely consist of pointing to others' evidence and arguments (which I assume Nick would be broadly familiar with but would find less persuasive than I do, so maybe this project also requires imagining all the reasons we might disagree and responding to each of them...).</p>", "parentCommentId": "FtxFv2jEoB75gjnnk", "user": {"username": "zsp"}}, {"_id": "uKEAQjFYZaJhqMGAh", "postedAt": "2022-09-24T04:29:54.726Z", "postId": "W7C5hwq7sjdpTdrQF", "htmlBody": "<p>Thanks! The part of the post that was supposed to be most responsive to this on size of AI x-risk was this:</p><blockquote><p>For \"Conditional on AGI being developed by 2070, humanity will go extinct or drastically curtail its future potential due to loss of control of AGI.\" I am pretty sympathetic to the analysis of Joe Carlsmith&nbsp;<a href=\"https://arxiv.org/abs/2206.13353\"><u>here</u></a>. I think Joe's estimates of the relevant probabilities are pretty reasonable (though the bottom line is perhaps somewhat low) and if someone convinced me that the probabilities on the premises in his argument should be much higher or lower I'd probably update. There are a number of&nbsp;<a href=\"https://www.lesswrong.com/posts/qRSgHLb8yLXzDg4nf/reviews-of-is-power-seeking-ai-an-existential-risk\"><u>reviews</u></a> of Joe Carlsmith's work that were helpful to varying degrees but would not have won large prizes in this competition.</p></blockquote><p>I think explanations of how Joe's probabilities should be different would help. Alternatively, an explanation of why some other set of propositions was relevant (with probabilities attached and mapped to a conclusion) could help.</p>", "parentCommentId": "TmcPhg2bgaypcZJ6Z", "user": {"username": "Nick_Beckstead"}}, {"_id": "6vhtBjEdGp3sKEkEh", "postedAt": "2022-09-24T08:10:31.574Z", "postId": "W7C5hwq7sjdpTdrQF", "htmlBody": "<p>Is this the <a href=\"https://en.wikipedia.org/wiki/List_of_richest_literary_prizes\">largest monetary prize in the world for a piece of writing</a>? Is it also the largest in history?</p>", "parentCommentId": null, "user": {"username": "Greg_Colbourn"}}, {"_id": "vBARSdteodGuwvzeG", "postedAt": "2022-09-24T08:30:54.654Z", "postId": "W7C5hwq7sjdpTdrQF", "htmlBody": "<p>Looking forward to seeing the entries. Similar <a href=\"https://forum.effectivealtruism.org/posts/W7C5hwq7sjdpTdrQF/announcing-the-future-fund-s-ai-worldview-prize?commentId=TmcPhg2bgaypcZJ6Z\">to</a> <a href=\"https://forum.effectivealtruism.org/posts/W7C5hwq7sjdpTdrQF/announcing-the-future-fund-s-ai-worldview-prize?commentId=SzNJ4hePwFrW2c9KZ\">others</a>, I feel that P(misalignment x-risk|AGI) is high (at least 35%, and likely &gt;75%), so think that a prize for convincing FF of that should be won. Similar for P(AGI will be developed by January 1, 2043) &gt;45%. &nbsp;But then I'm also not sure what would be needed in addition to all the great pieces of writing on this already out there (some mentioned in OP).&nbsp;<br><br>I'm hoping that there will be good entries from <a href=\"https://forum.effectivealtruism.org/topics/eliezer-yudkowsky\">Eliezer Yudkowsky</a> (on P(misalignment x-risk|AGI) &gt;75%; <a href=\"https://www.lesswrong.com/posts/uMQ3cqWDPHhjtiesc/agi-ruin-a-list-of-lethalities\">previous</a>), <a href=\"https://forum.effectivealtruism.org/users/ajeya\">Ajeya Cotra</a> (on P(AGI will be developed by January 1, 2043) &gt;45%; <a href=\"https://www.lesswrong.com/posts/AfH2oPHCApdKicM4m/two-year-update-on-my-personal-ai-timelines\">previous</a>), <a href=\"https://forum.effectivealtruism.org/users/kokotajlod\">Daniel Kokotajlo</a> (on P(AGI will be developed by January 1, 2043) &gt;75%?; <a href=\"https://www.lesswrong.com/s/5Eg2urmQjA4ZNcezy/p/rzqACeBGycZtqCfaX\">previous</a>) &nbsp;and possibly <a href=\"https://forum.effectivealtruism.org/users/holdenkarnofsky\">Holden Karnofsky</a> (although I'm not sure his credences for these probabilities are much different to FF's current baseline; <a href=\"https://www.cold-takes.com/most-important-century/\">previous</a>). Also <a href=\"https://forum.effectivealtruism.org/users/joe_carlsmith\">Carlsmith</a> says he's recently (May 2022) updated his probabilities from \"~5%\" to \"<a href=\"https://arxiv.org/abs/2206.13353\">&gt;10%</a>\" for P(misalignment x-risk) by 2070. This is unconditional, i.e. including p(AGI) by 2070, and his estimate for P(AGI by 2070) is <a href=\"https://arxiv.org/pdf/2206.13353.pdf\">65%</a>, so that puts him at &nbsp;P(misalignment x-risk|AGI) &gt;15%, so an entry from him (for P(misalignment x-risk|AGI) &gt;35%) could be good too (although just being &gt;15% is still perhaps a far cry from &gt;35%!). Others I think it would be good to see entries for on P(misalignment x-risk|AGI) &gt;75% from are <a href=\"https://forum.effectivealtruism.org/users/so8res\">Nate Soares</a> (<a href=\"https://forum.effectivealtruism.org/posts/vC6v2iTafkydBvnz7/agi-ruin-scenarios-are-likely-and-disjunctive\">previous</a>) and <a href=\"https://forum.effectivealtruism.org/users/robbensinger\">Rob Bensinger</a> (<a href=\"https://forum.effectivealtruism.org/posts/vC6v2iTafkydBvnz7/agi-ruin-scenarios-are-likely-and-disjunctive?commentId=zGAkDWvsDuh9LahkQ\">previous</a>). Also maybe <a href=\"https://www.youtube.com/channel/UCLB7AzTwc6VFZrBsO2ucBMg\">Rob Miles</a>? (<a href=\"https://www.youtube.com/watch?v=JD_iA7imAPs&amp;ab_channel=RobertMiles2\">previous</a>).</p>", "parentCommentId": null, "user": {"username": "Greg_Colbourn"}}, {"_id": "LS3pRBHp3AgiNSqJw", "postedAt": "2022-09-24T08:35:50.084Z", "postId": "W7C5hwq7sjdpTdrQF", "htmlBody": "<p>There is also the feedback loop involving the Future Fund itself. As Michael Dickens points out <a href=\"https://manifold.markets/RossRheingansYoo/will-the-future-fund-pay-a-prize-fo-1fd10e3d0f1a#3VhbkPJQlDbbmzSiugQF\">here</a>:</p><blockquote><p>the existence of the FTX Future Fund decreases p(misalignment x-risk|AGI), and this very prize also decreases it, and this particular question has a negative feedback loop (where a high-probability answer to p(misalignment x-risk|AGI) decreases the probability, and vice versa).</p></blockquote><p>I think it's much easier to argue that p(misalignment x-risk|AGI) &gt;35% (or 75%) <i>as things stand</i>.</p>", "parentCommentId": "axs6MQHDFBHCif3f9", "user": {"username": "Greg_Colbourn"}}, {"_id": "zoN3xwwCaqbWARmvs", "postedAt": "2022-09-24T10:56:08.257Z", "postId": "W7C5hwq7sjdpTdrQF", "htmlBody": "<p>I think that the post should explain briefly, or even just link to, what a “superforecaster” is. And if possible explain how and why this serves an independent check.</p>\n<p>The superforecaster panel is imo a credible signal of good faith, but people outside of the community may  think “superforecasters” just means something arbitrary and/or weird and/or made up by FTX.</p>\n<p>(The post links to Tetlock’s book, but not in the context of explaining the panel)</p>\n", "parentCommentId": "cEyhJ2YGSknkBMQDF", "user": {"username": "rgb"}}, {"_id": "5HHXkhQEgrpKmvC3X", "postedAt": "2022-09-24T11:01:34.452Z", "postId": "W7C5hwq7sjdpTdrQF", "htmlBody": "<p>Probably missing something obvious, but could they either:</p>\n<ul>\n<li>PGP encrypt it with the reviewer's public key, and send it via email?</li>\n<li>Use an e2e encrypted messaging medium? (Don't know which are trustworthy, but I'm sure there's an expert consensus)</li>\n</ul>\n<p>Or are those not user friendly enough?</p>\n<p>I think this is a solved problem in infosec (but am probably missing something)</p>\n", "parentCommentId": "cenZyTQs32xPqau5N", "user": {"username": "Lorenzo Buonanno"}}, {"_id": "rpScXJD852EWAdgmD", "postedAt": "2022-09-24T11:28:26.259Z", "postId": "W7C5hwq7sjdpTdrQF", "htmlBody": "<p>What does \"as things stand\" mean? If we invented AGI tomorrow? That doesn't seem like a useful prediction.</p>\n", "parentCommentId": "LS3pRBHp3AgiNSqJw", "user": {"username": "jooke"}}, {"_id": "Ea3saujQSbqMHXuDX", "postedAt": "2022-09-24T11:34:48.268Z", "postId": "W7C5hwq7sjdpTdrQF", "htmlBody": "<p>Hi!</p><p>I don't think I will participate in this contest, because:</p><ul><li>pursuing AGI is an ethical no-no for me.</li><li>I like expert systems technology for what it offers.</li><li>I don't have much background knowledge on AGI risk.</li><li>I am not comfortable with subjective probability as you use it for forecasting.</li></ul><p>However, after reading about this prize, I have several questions that came up for me as I read it. I thought I would offer them as a good-faith effort to clarify your goals here.</p><ol><li>There are significant risks to human well-being, aside from human extinction, that are plausible in the event of AGI or ASI development. &nbsp;<strong>Narrowing your question to whether extinction risk is a concern ignores various existential or suffering risks associated with AGI development. Is that what you intend?</strong><br><strong>EDIT:</strong> I believe some edits were made, so this question is no longer current.<br>&nbsp;</li><li>Your scenario of a company staffed by AI is implausible without additions to do with legal status of AGI entities. Those additions presume societal changes and AGI governance by existing or new laws. <strong>Can you constrain your description of a future where AGI perform tasks to make the legal distinction clear between AGI and software tools?</strong><br><br>Your idea of AGI presumably contrasts with rentable software instances that perform tasks and rely on a common pool of knowledge and capabilities. For example, I could rent multiple John Construction Worker instances for manipulation of construction bots for a particular project. I don't pay the instances, I just pay for them and the robotic construction equipment.<br>&nbsp;</li><li>In the event that automation allows AI to perform <i>all</i> &nbsp;human tasks, robot hardware will perform human activities. Robots can have their intelligence and knowledge associated at a hardware level with their bodies. For example, their learning can occur through training of their bodies rather than solely through software downloads, and their learning can be kept as local data only. Their affective experience can be linked to the action of their bodies in particular activities, potentially. They can also bear a superficial similarity to humans, particularly if their robot bodies are humanoid and employ similar senses (vision, hearing, tactile sense). <strong>These and other differences fulfill some of the description of a future containing AGI, but have different implications for the type of extinction threat posed by robots. Is that a distinction you consider worth making for the purposes of your contest?</strong><br>&nbsp;</li><li>When you write that AGI might do work at a rate of $25/hr, that seems implausible. In particular, a human-like intelligence without the data-processing constraints of a human engaged in a single focused activity (for example, researching a topic) can do some of the planned tasks involved at rates near instantaneous compared to a human. A human might take a week to read a book that an AGI reads in a couple of milli-seconds. Puzzling through the intuitions and logical implications of what was read in the book could take a human months, but an AGI could do the ontology refinement and knowledge development in under a hundred milliseconds. <strong>Again, can you constrain your example of AGI working like humans? For example, are you referring mainly to physical labor that AGI perform, perhaps through a humanoid robot?</strong><br>&nbsp;</li><li>Assuming an AGI is performing its labor at the speed of software, not the speed of a human exercising their intellect, we can agree that an AGI will do mental labor much faster than humans. However, physical labor depends on tasks and robotic hardware limits as well as software limits, and the speed differences are not as strong between humans and robot hardware. Hardware can get better, but not many orders of magnitude faster than a human (but maybe many more times as precise or reliable).<br><br>A further complication is that redefinition of tasks can alter the resource requirements and output constraints of labor. I'm not sure how that would affect an economic model of labor. <strong>Can you specify that (1)physical/engineering limits on robotics, and (2)task redefinition, don't matter to your economic criteria for AGI spread or is discussion of that something you are looking for in essays submitted to you?</strong><br>&nbsp;</li><li>Given the possibility that hardware requirements remain expensive to support a purely software entity, those entities might not be available for most types of work. Simpler data-processing tools and robots that seem advanced by our standards but much slower/cheaper/simpler could be widely available while actual AGI and conscious robots (or artificial life) are fairly rare, reserved for <i>very important</i> jobs, where human fallibility is perceived as too costly.<br><br><strong>If the outcome of increased productivity and innovation through AI investments pans out, but without AGI participating in most economic activity, is that relevant to your philanthropic interests here? That is, is all you care about the timing of the development of the </strong><i><strong>first</strong></i><strong> AGI, or is it a time when AGI are common or cheap or just when automation is replacing most jobs or something else?</strong></li></ol><p>Thank you for <i>your</i> &nbsp;time and good luck with your contest!&nbsp;<br>Also, good luck to the contestants!&nbsp;</p><p>:)</p>", "parentCommentId": null, "user": {"username": "Noah Scales"}}, {"_id": "rbcQimYpAT7HhxQed", "postedAt": "2022-09-24T11:35:26.773Z", "postId": "W7C5hwq7sjdpTdrQF", "htmlBody": "<p>I'm thinking more along the lines of how things are with the current level of progress on AI Alignment and AI Governance, or assuming that the needle doesn't move appreciably on these. In the limit of zero needle movement, this would be equivalent to if AGI was invented tomorrow.</p>", "parentCommentId": "rpScXJD852EWAdgmD", "user": {"username": "Greg_Colbourn"}}, {"_id": "rArd6iz7xhXtpwgsH", "postedAt": "2022-09-24T12:17:59.878Z", "postId": "W7C5hwq7sjdpTdrQF", "htmlBody": "<blockquote><p>Narrowing your question to whether extinction risk is a concern ignores various existential [...] risks associated with AGI development.</p></blockquote><p>What's the difference between extinction risk and existential risk?</p>", "parentCommentId": "Ea3saujQSbqMHXuDX", "user": {"username": "Lorenzo Buonanno"}}, {"_id": "zoMoenmiQFpdEbdio", "postedAt": "2022-09-24T12:41:34.087Z", "postId": "W7C5hwq7sjdpTdrQF", "htmlBody": "<p>From the <a href=\"https://forum.effectivealtruism.org/topics/existential-risk\">wiki</a>: \"An existential risk is the risk of an existential catastrophe, i.e. one that threatens the destruction of humanity’s longterm potential.\" That can include getting permanently locked into a totalitarian dictatorship and things of  that sort, even if they don't result in extinction.</p>\n", "parentCommentId": "rArd6iz7xhXtpwgsH", "user": {"username": "Erich_Grunewald"}}, {"_id": "8jPrbFxDCqBFbu6sM", "postedAt": "2022-09-24T12:47:50.730Z", "postId": "W7C5hwq7sjdpTdrQF", "htmlBody": "<p>Thank you! And doubly thank you for the topic link. In case others are confused, I found the end of this post particularly clear <a href=\"https://forum.effectivealtruism.org/posts/qFdifovCmckujxEsq/existential-risk-is-badly-named-and-leads-to-narrow-focus-on\">https://forum.effectivealtruism.org/posts/qFdifovCmckujxEsq/existential-risk-is-badly-named-and-leads-to-narrow-focus-on</a></p><blockquote><p>it may be worth dividing out existential risk into <i>extinction </i>risk, <i>collapse</i> risk, <i>flawed realisation</i> risk and <i>plateauing</i> risk</p></blockquote>", "parentCommentId": "zoMoenmiQFpdEbdio", "user": {"username": "Lorenzo Buonanno"}}, {"_id": "ruinuLWTtHa6Q7dBe", "postedAt": "2022-09-24T13:24:04.247Z", "postId": "W7C5hwq7sjdpTdrQF", "htmlBody": "<p>TL;DR: We might need to ping pong with you in order to change your mind. We don't know why you believe what you believe.</p><p>&nbsp;</p><p>60% AGI by 2100 seems really low (as well as 15% `P(misalignment x-risk|AGI)`). I'd need to know why you believe it in order to change your mind.</p><p>&nbsp;</p><p>Specifically, I'd be happy to hear where you disagree with <a href=\"https://www.lesswrong.com/posts/ervaGwJ2ZcwqfCcLx/agi-ruin-scenarios-are-likely-and-disjunctive\">AGI ruin scenarios are likely (and disjunctive) </a>by <a href=\"https://www.lesswrong.com/users/so8res\">So8res</a>.</p>", "parentCommentId": null, "user": {"username": "hibukki"}}, {"_id": "HkuC8ZvMGsEahkHBC", "postedAt": "2022-09-24T13:31:36.135Z", "postId": "W7C5hwq7sjdpTdrQF", "htmlBody": "<p><strong>Would FTX be interested in opening a platform for safe handling of knowledge that should stay secret?</strong></p><p>This is a platform that, to develop, we'd need to be in contact with a \"customer\" like FTX.</p><p>I think it needs more planning than a forum comment, though I endorse raising the subject.</p><p>&nbsp;</p><p>h/t <a href=\"https://forum.effectivealtruism.org/users/edoarad\">Edo Arad</a></p>", "parentCommentId": "THw7j8h7btJFaiFm4", "user": {"username": "hibukki"}}, {"_id": "hHBwuGtf2vKuJW6kt", "postedAt": "2022-09-24T13:33:36.287Z", "postId": "W7C5hwq7sjdpTdrQF", "htmlBody": "<p>(The solution might involve writing 0 new lines of code, but only using Signal or something like that, maybe)</p>", "parentCommentId": "HkuC8ZvMGsEahkHBC", "user": {"username": "hibukki"}}, {"_id": "Q79r6cig5vb9pC52u", "postedAt": "2022-09-24T13:35:59.924Z", "postId": "W7C5hwq7sjdpTdrQF", "htmlBody": "<p>(+1 to \"not user friendly\". Signal would be more user friendly, for example)</p>", "parentCommentId": "5HHXkhQEgrpKmvC3X", "user": {"username": "hibukki"}}, {"_id": "AsSPtb8jzetKnHYYJ", "postedAt": "2022-09-24T13:45:01.803Z", "postId": "W7C5hwq7sjdpTdrQF", "htmlBody": "<p>… if only they had allowed people not to publish on EA Forum, LessWrong, and Alignment Forum :)</p>\n<p>Honestly, it seems like a mistake to me to not allow other ways of submission. For example, some people may not want to publicly apply for a price or be associated with our communities. An additional submission form might help with that.</p>\n", "parentCommentId": "cEyhJ2YGSknkBMQDF", "user": {"username": "Leon_Lang"}}, {"_id": "TJLxDpms4iQC6JgJR", "postedAt": "2022-09-24T13:51:44.614Z", "postId": "W7C5hwq7sjdpTdrQF", "htmlBody": "<p>Agree, and add that<a href=\"https://twitter.com/davisblalock/status/1558347542101839873\"> code models won't be data constrained as they can generate their own training data</a>. It's simple to write tests automatically, and you can run the code to see whether it passes the tests before adding it to your training dataset. As an unfortunate side effect, part of this process involves constantly and automatically running code output by a large model, and feeding it data which it generated so it can update its weights, both of which are not good safety-wise if the model is misaligned and power seeking.</p><p>I don't know if this has been incorporated into a wider timelines analysis yet as it is quite recent, but this was a notable update for me given <a href=\"https://www.alignmentforum.org/posts/6Fpvch8RR29qLEWNH/chinchilla-s-wild-implications\">the latest scaling laws which indicate that data is the constraining factor</a>, not parameter count. Much shorter timelines than 2043 seem like a live and strategically relevant possibility.</p>", "parentCommentId": "R7GMEvqJDvQSiDBEG", "user": {"username": "plex"}}, {"_id": "A2pi94EHHccDcZabZ", "postedAt": "2022-09-24T14:13:14.563Z", "postId": "W7C5hwq7sjdpTdrQF", "htmlBody": "<blockquote><p>\"FTX Foundation will not get submissions that change its mind, but it would have gotten them if only they had [fill in the blank]\"</p></blockquote><blockquote><p>\"I personally would compete in this prize competition, but only if...\"</p></blockquote><p>Ehh, the above is too strong, but:</p><ul><li>You would get more/better submissions if...</li><li>I would be more likely to compete in that if...</li></ul><p>your reward schedule rewarded smaller shifts in proportion to how much they moved your probabilities (e.g., $X per bit).&nbsp;</p><p>E.g., as it is now, if two submissions together move you across a threshold, it would seem as if:</p><ul><li>neither gets a prize</li><li>only the second gets a prize</li></ul><p>and both seem suboptimal.</p><p>e.g., if you get information in one direction from one submission, but also information from another submission in another direction, and they cancel out, neither gets a reward. This is particularly annoying if it makes getting-a-prize-or-not depending on the order of submissions.</p><p>e.g., because individual people's marginal utility of money is diminishing, a 10% chance of reaching your threshold and getting $X will be way less valuable to participants than moving your opinion around 10% of the way to a threshold and getting $X/10.</p><p>e.g., if someone has information which points in both directions, they are incentivized to only say information in one direction in order to reach your threshold, whereas if your rewarded for shifts, they would have an incentive to present both for and against and get some reward for each update.</p><p>etc.</p><p>And in general I would expect your scheme to have annoying edge cases and things that are not nice, as opposed to a more parsimonious scheme (like paying $X per bit).</p><p>See also: &lt;<a href=\"https://meteuphoric.com/2014/07/21/how-to-buy-a-truth-from-a-liar/\">https://meteuphoric.com/2014/07/21/how-to-buy-a-truth-from-a-liar/</a>&gt;&nbsp;</p>", "parentCommentId": "cEyhJ2YGSknkBMQDF", "user": {"username": "NunoSempere"}}, {"_id": "M6tnADj2GzkGaCuRo", "postedAt": "2022-09-24T14:20:55.917Z", "postId": "W7C5hwq7sjdpTdrQF", "htmlBody": "<p>Protonmail and Signal are e2e encrypted messaging mediums.</p><p>But depending on how paranoid the users need to be these systems might not provide enough guarantees, since you would need to trust the servers not to MITM. Unless you do some sort of in-person key-exchange.</p><p>But I'm definitely not an expert. In general I think there are plenty of experts that know exactly how to handle these things and they're pretty easy to contact.<br><br>Edit: I agree with <a href=\"https://forum.effectivealtruism.org/posts/W7C5hwq7sjdpTdrQF/announcing-the-future-fund-s-ai-worldview-prize?commentId=o7L4QCSNPqyuJRuEz\">acylhalide comment</a>, if you have government-level actors this is potentially not enough.</p>", "parentCommentId": "Q79r6cig5vb9pC52u", "user": {"username": "Lorenzo Buonanno"}}, {"_id": "s9vxc2xexsgpKBSoW", "postedAt": "2022-09-24T14:35:01.877Z", "postId": "W7C5hwq7sjdpTdrQF", "htmlBody": "<p>FWIW, I would prefer a post on \"what actually drives your probabilities\" over a \"what are the reasons that you think will be most convincing to others\".</p>", "parentCommentId": "TmcPhg2bgaypcZJ6Z", "user": {"username": "NunoSempere"}}, {"_id": "QZicB5HEtoHTANjbe", "postedAt": "2022-09-24T14:45:57.080Z", "postId": "W7C5hwq7sjdpTdrQF", "htmlBody": "<p>I think it would be nicer if you say your P(Doom|AGI in 2070) instead of P(Doom|AGI by 2070), because the second one implicitly takes into account your timelines. Also, it would be nicer to have the same years: P(Doom | AGI in 2043) and P(Doom | AGI in 2100)</p>\n", "parentCommentId": null, "user": {"username": "Dmitry Savishchev"}}, {"_id": "WtrDqKwCcJf6hs8tX", "postedAt": "2022-09-24T15:04:35.689Z", "postId": "W7C5hwq7sjdpTdrQF", "htmlBody": "<p>Would you be able to say a little more about why part of your criteria seems to be degree of probability shift (\"We will award larger prizes for larger changes to these probabilities, as follows...\"). It seems to me that you might get a case where you could get analyses that offer larger changes but are less robust than some analyses that suggest smaller changes. I didn't understand how much of your formal evaluation will look at plausibility, argumentation, soundness?</p><p>(asking as a curiosity not as a critique)</p>", "parentCommentId": null, "user": {"username": "helmetedhornbill"}}, {"_id": "smRSB2qBv6mBc7d5n", "postedAt": "2022-09-24T15:36:42.658Z", "postId": "W7C5hwq7sjdpTdrQF", "htmlBody": "<p>Yes, arguably this prize doesn't require any original research (or STEM breakthroughs), so could be won just by convincing argumentation based on existing knowledge. Prizes relating to (non-fiction) writing seem like a more relevant reference class than scientific prizes. And this prize seems correspondingly a lot more accessible (and lower effort to enter) on the face of it.</p>\n", "parentCommentId": "cxTdjiSWzTzJuBBQf", "user": {"username": "Greg_Colbourn"}}, {"_id": "xprWD5dtG3fhQ7sNd", "postedAt": "2022-09-24T16:13:09.776Z", "postId": "W7C5hwq7sjdpTdrQF", "htmlBody": "<p>This is more of a meta-consideration around shared cultural background and norms. Could it just be a case of <i>allowing</i> yourselves to update toward more scary-sounding probabilities? You have all the information already. This <a href=\"https://www.youtube.com/watch?v=JD_iA7imAPs&amp;ab_channel=RobertMiles2\">video</a> from Rob Miles (\"There's No Rule That Says We'll Make It\")[<a href=\"https://docs.google.com/document/d/1gZX6m8B7Lv5d2d9rOa9IgNsyplreLZ6m16hEEMUw69w/edit\">transcript</a> copied from YouTube] &nbsp;made me think along these lines. Aside from background culture considerations around human exceptionalism (inspired by religion) and optimism favouring good endings (Hollywood; perhaps also history to date?), I think there is also an inherent conservatism borne by prestigious mega-philanthropy whereby a doom-laden outlook just doesn't fit in.&nbsp;</p><p>Optimism seems to tilt one in favour of conjunctive reasoning, and pessimism favours disjunctive reasoning. Are you factoring <a href=\"https://forum.effectivealtruism.org/topics/conjunctive-vs-disjunctive-risk-models\">both</a> in?</p>", "parentCommentId": "rCzudRAgkHPdKFkWy", "user": {"username": "Greg_Colbourn"}}, {"_id": "Df9hs76Mth2awWcAT", "postedAt": "2022-09-24T19:34:58.669Z", "postId": "W7C5hwq7sjdpTdrQF", "htmlBody": "<p>Plausibility, argumentation, and soundness will be inputs into how much our subjective probabilities change. We framed this in terms of subjective probabilities because it seemed like the easiest way to crisply point at ideas which could change our prioritization in significant ways.</p>", "parentCommentId": "WtrDqKwCcJf6hs8tX", "user": {"username": "Nick_Beckstead"}}, {"_id": "nWHte6ekLBoJD9Qau", "postedAt": "2022-09-24T20:03:55.618Z", "postId": "W7C5hwq7sjdpTdrQF", "htmlBody": "<p>Could you put some judges on the panel who are a bit less worried about AI risk than your typical EA would be? EA opinions tend to cluster quite strongly around an area of conceptual space that many non-EAs do not occupy, and it is often hard for people to evaluate views that differ radically from their own. Perhaps one of the superforecasters could be put directly onto the judging panel, pre-screening for someone who is less worried about AI risk.</p>", "parentCommentId": "cEyhJ2YGSknkBMQDF", "user": {"username": "David Thorstad"}}, {"_id": "4QW55gGwpJfmBEMWj", "postedAt": "2022-09-24T21:09:45.006Z", "postId": "W7C5hwq7sjdpTdrQF", "htmlBody": "<p>I'm partly sympathetic to the idea of allowing submissions in other forums or formats.</p><p>However, I think it's likely to be very valuable to the Future Fund and the prize judges, when sorting through potentially hundreds or thousands of submissions, to be able to see upvotes, comments, and criticisms from EA Forum, Less Wrong, and Alignment Forum, which is where many of the subject matter experts hang out. This will make it easier to identify essays that seem to get a lot of people excited, and that don't contain obvious flaws or oversights.</p>", "parentCommentId": "AsSPtb8jzetKnHYYJ", "user": {"username": "geoffreymiller"}}, {"_id": "hxRc2BfnRLD77zs8X", "postedAt": "2022-09-24T21:18:42.529Z", "postId": "W7C5hwq7sjdpTdrQF", "htmlBody": "<p>This is a pretty deep and important point. There may be psychological and cultural biases that make it pretty hard to shift the expected likelihoods of worst-case AI scenarios much higher than they already are -- which might bias the essay contest against arguments winning even if they make a logically compelling case for more likely catastrophes.</p><p>Maybe one way to reframe this is to consider the prediction “P(misalignment x-risk|AGI)” to also be contingent on us muddling along at the current level of AI alignment effort, without significant increases in funding, talent, insights, or breakthroughs. In other words, probability of very bad things happening, given AGI happening, but also given the status-quo level of effort on AI safety.</p>", "parentCommentId": "xprWD5dtG3fhQ7sNd", "user": {"username": "geoffreymiller"}}, {"_id": "XgrcWp3RpwW4dA8uz", "postedAt": "2022-09-24T21:24:07.732Z", "postId": "W7C5hwq7sjdpTdrQF", "htmlBody": "<p>you might already be planning on dong this, but it seems like you increase the chance of getting a winning entry if you advertise this competition in a lot of non-EA spaces. I guess especially technical AI spaces e.g. labs, universities. Maybe also trying to advertise outside the US/UK. Given the size of the prize it might be easy to get people to pass on the advertisement among their groups. (Maybe there's a worry about getting flack somehow for this, though. And also increases overhead to need to read more entries, though sounds like you have some systems set up for that which is great.)</p>\n<p>In the same vein I think trying to lower the barriers to entry having to do with EA culture could be useful - e.g. +1 to someone else here talking about allowing posting places besides EAF/LW/AF, but also maybe trying to have some consulting researchers/judges who find it easier/more natural to engage in non-analytic-philosophy-style arguments.</p>\n", "parentCommentId": "cEyhJ2YGSknkBMQDF", "user": {"username": "Ardenlk"}}, {"_id": "AfLkKswGdJCJoLpK7", "postedAt": "2022-09-24T21:27:24.097Z", "postId": "W7C5hwq7sjdpTdrQF", "htmlBody": "<p>Strongly endorsed this comment.&nbsp;</p><p>If we really take infohazards seriously, we shouldn't just be imagining EAs casually reading draft essays, sharing them, and the ideas gradually percolating out to potential bad actors.&nbsp;</p><p>Instead, we should take a fully adversarial, red-team mind-set, and ask, if a large, highly capable geopolitical power wanted to mine EA insights for potential applications of AI technology that could give them an advantage (even at some risk to humanity in general), how would we keep that from happening?</p><p>We would be naive to think that intelligence agencies of various major countries that are interested in AI don't have at least a few intelligence analysts reading EA Forum, LessWrong, &amp; Alignment Forum, looking for tips that might be useful -- but that we might consider infohazards.</p>", "parentCommentId": "THw7j8h7btJFaiFm4", "user": {"username": "geoffreymiller"}}, {"_id": "w3ZvRacdAzimj6CBb", "postedAt": "2022-09-24T21:35:12.826Z", "postId": "W7C5hwq7sjdpTdrQF", "htmlBody": "<p>FTX Foundation might get fewer submissions that change its mind than they would have gotten if only they had considered strategic updates prize worthy.</p>\n<p>The unconditional probability of takeover isn’t necessarily the question of most strategic interest.  There’s a huge difference between “50% AI disempowers humans somehow on the basis of naive principle of indifference” and\n“50% MIRI-style assumptions about AI are correct”*. One might conclude from the second  that the first is also true, but the first has no strategic implications (the principle of indifference ignores such things!), while the second has lots of strategic implications. For example, it suggests  “ totally lock down AI development, at least until we know more” is what we need to aim for. I’m not sure exactly where you stand on whether that is needed, but given that your stated position seems to be relying substantially on outside view type reasoning, it might be a big update.</p>\n<p>The point is: middling probabilities of strategically critical hypotheses might actually be more important updates than extreme probabilities of strategically opaque hypotheses.</p>\n<p>My suggestion (not necessarily a full solution) is that you consider big strategic updates potentially prizeworthy. For example: do we gain a lot by delaying AGI for a few years? If we consider all the plausible paths to AGI, do we gain a lot by hastening the development of the top 1% most aligned by a few years?</p>\n<p>I think it’s probably too hard to pre-specify exactly which strategic updates would be prizes worthy.</p>\n<p>*By which I mean something like “more AI capability eventually yields doom, no matter what, unless it’s highly aligned”</p>\n", "parentCommentId": "cEyhJ2YGSknkBMQDF", "user": {"username": "David Johnston"}}, {"_id": "dACdr4eqtWZDmNRZe", "postedAt": "2022-09-24T22:12:13.722Z", "postId": "W7C5hwq7sjdpTdrQF", "htmlBody": "<p>tldr: Another way to signal-boost this competition might be through prestige and not just money, by including some well-known people as judges, such as Elon Musk, Vitalik Buterin, or Steven Pinker.</p><p>One premise here is that big money prizes can be highly motivating, and can provoke a lot of attention, including from researchers/critics who might not normally take AI alignment very seriously. I agree.</p><p>But, if Future Fund really wants maximum excitement, appeal, and publicity (so that the maximum number of smart people work hard to write great stuff), then apart from the monetary prize, it might be helpful to maximize the prestige of the competition, e.g. by including a few 'STEM celebrities' as judges.&nbsp;</p><p>For example, this could entail recruiting a few judges like tech billionaires Elon Musk, Jeff Bezos, Sergey Brin, Tim Cook, Ma Huateng, Ding Lei, or Jack Ma, &nbsp;crypto leaders such as Vitalik Buterin or Charles Hoskinson, and/or well-known popular science writers, science fiction writers/directors, science-savvy political leaders, etc. And maybe, for an adversarial perspective, some well-known AI X-risk skeptics such as Steven Pinker, Gary Marcus, etc.</p><p>Since these folks are mostly not EAs or AI alignment experts, they shouldn't have a strong influence over who wins, but their perspectives might be valuable, and their involvement would create a lot of buzz around the competition.&nbsp;</p><p>I guess the ideal 'STEM celebrity' judge would be very smart, rational, open-minded, and &nbsp;highly respected among the kinds of people who could write good essays, but not necessarily super famous among the general public (so the competition doesn't get flooded by low-quality entries.)&nbsp;</p><p>We should also try to maximize international appeal by including people well-known in China, India, Japan, etc. -- not just the usual EA centers in US, UK, EU, etc.&nbsp;</p><p>(This could also be a good tactic for getting these 'STEM celebrity' judges more involved in EA, whether as donors, influencers, or engineers.)</p><p>This might be a very silly idea, but I just thought I'd throw it out there...</p>", "parentCommentId": null, "user": {"username": "geoffreymiller"}}, {"_id": "9crEDiQpC5ybRK64T", "postedAt": "2022-09-24T22:23:06.194Z", "postId": "W7C5hwq7sjdpTdrQF", "htmlBody": "<p>I agree with this, and the “drastic reduction in long term value” part is even worse. It is implicitly counterfactual - drastic reductions have to be in reference to *something * - but what exactly the proposed counterfactual is is extremely vague. I worry that to some extent this vagueness will lead to people not exploring some answers to the question because they’re trying to self impose a “sensible counterfactual” constraint which, due to vagueness, won’t actually line up well with the kinds of counterfactuals the FTX foundation is interested in exploring.</p>\n", "parentCommentId": "mw6fJdzzCbDqiHCtK", "user": {"username": "David Johnston"}}, {"_id": "g7vQEcsdd9KCZMvgM", "postedAt": "2022-09-24T23:31:51.705Z", "postId": "W7C5hwq7sjdpTdrQF", "htmlBody": "<p>Yes, that makes sense. How about stating that reasoning and thereby nudging participants to post in the EA forum/LessWrong/Alignment Forum, but additionally have a non-public submission form? My guess would be that only a small number of participants would then submit via the form, so the amount of additional work should be limited. This bet seems better to me than the current bet where you might miss really important contributions.</p>", "parentCommentId": "4QW55gGwpJfmBEMWj", "user": {"username": "Leon_Lang"}}, {"_id": "spKQXd9MX5TXhqDwx", "postedAt": "2022-09-25T01:40:31.658Z", "postId": "W7C5hwq7sjdpTdrQF", "htmlBody": "<p>Related to this, I think some aspects of the post were predictably off-putting to people who aren't already in these communities - examples include the specific citations* used (e.g. Holden's post which uses a silly sounding acronym [PASTA], and Ajeya's report which is in the unusual-to-most-people format of several Google Docs and is super long), and a style of writing that likely comes off as strange to people outside of these communities (\"you can roughly model me as\"; \"all of this AI stuff\").<br><br>*some of this critique has to do with the state of the literature, not just the selection thereof. But insofar as there is a serious interest here in engaging with folks outside of EA/rationalists/longtermists (not clear to me if this is the case), then either the selections could have been more careful or caveated, or new ones could have been created.</p>", "parentCommentId": "AsSPtb8jzetKnHYYJ", "user": {"username": "Miles_Brundage"}}, {"_id": "F86NX2F5fxqkjGwvm", "postedAt": "2022-09-25T05:50:57.255Z", "postId": "W7C5hwq7sjdpTdrQF", "htmlBody": "<p>I’m thinking of writing something for this. Most of the arguments I have in mind address the headline problem only partially. Do you mind if I make a series of, say, 5 posts as a single submission?</p>\n", "parentCommentId": null, "user": {"username": "David Johnston"}}, {"_id": "rvKpN7bCwapQ8i25q", "postedAt": "2022-09-25T08:42:54.330Z", "postId": "W7C5hwq7sjdpTdrQF", "htmlBody": "<p>\"FTX Foundation will not get submissions that change its mind, but it would have gotten them if only they had [broadened the scope of the prizes beyond just influencing their probabilities]\"</p><p><br><br>Examples of things someone considering entering the competition would presumably consider out of scope are:</p><ul><li><strong>Making a case that AI misalignment is the wrong level of focus </strong>– even if AI risks are high it could be that AI risks <i>and </i>other risks are very heavily weighted towards specific risk factor scenarios, such as a global hot or cold war. This view is apparently expressed by Will (see <a href=\"https://forum.effectivealtruism.org/posts/9Y6Y6qoAigRC7A8eX/my-take-on-what-we-owe-the-future#Overall_probability_of_takeover\">here</a>).</li><li><strong>Making a case based on tractability </strong>– that a focus on AI risk is misguided as the ability to affect such risks are low (not to far away from the views of Yudkowsky <a href=\"https://forum.effectivealtruism.org/posts/zzFbZyGP6iz8jLe9n/agi-ruin-a-list-of-lethalities\">here</a>).</li><li><strong>Making the case that we should not put much decisions weight on future predictions of risks </strong>– E.g. as long-run predictions of future technology as they are inevitably unreliable (see <a href=\"https://forum.effectivealtruism.org/posts/ujzBegXSieyR6dJ5f/dan-luu-futurist-prediction-methods-and-accuracy\">here</a>) or E.g. as &nbsp;modem risk assessment best practice says that probability estimates should only play a limited role in risk assessments (my view expressed <a href=\"https://forum.effectivealtruism.org/posts/wyHjpcCxuqFzzRgtX/a-practical-guide-to-long-term-planning-and-suggestions-for#3__Improve_understanding_of_future_risks__use_professional_risk_management_tools_\">here</a>) or other.</li><li><strong>Making the case that some other x-risk is more pressing</strong>, more likely, more tractable, etc.</li><li><strong>Making the case against FTX Future's underlying philosophical and empirical assumptions</strong> &nbsp;– this could be claims about the epistemics of focusing on AI risks, for example relating to how we should respond to cluelessness about the future or decisions relevant views about the long run future, for example that it might be bad and not worth protecting or that there might be more risks after AI or that long-termism is false</li></ul><p><br>It seems like any strong case falling into these categories should be decision relevant to FTX Future fund but all are (unless I misunderstand the post) out of scope currently.<br>&nbsp;</p><p>Obviously there is a trade-off. Broadening the scope makes the project harder and less clear but increases the chance of finding something decision relevant. I don’t have a strong reason to say the scope should be broadened now, I think that depends on FTX Future Funds's current capacity and plans for other competitions and so on.<br><br>I guess <strong>I worry that the strongest arguments are out of scope </strong>and if this competition doesn’t significantly update FTX's views then future competitions will not be run and you will not fund the arguments you are seeking. So flagging as a potential path to failure for your pre-mortem.</p>", "parentCommentId": "cEyhJ2YGSknkBMQDF", "user": {"username": "weeatquince"}}, {"_id": "rXYC3sHgxSeMZPGLc", "postedAt": "2022-09-25T08:44:42.127Z", "postId": "W7C5hwq7sjdpTdrQF", "htmlBody": "<p>Sorry I realise scrolling down that I am making much the same point as MichaelDickens' comment below. Hopefully added some depth or something useful.</p>", "parentCommentId": "rvKpN7bCwapQ8i25q", "user": {"username": "weeatquince"}}, {"_id": "nBZTWJfDfBhR5P9Ts", "postedAt": "2022-09-25T10:00:44.763Z", "postId": "W7C5hwq7sjdpTdrQF", "htmlBody": "<p>On the face of it an update 10% of the way towards a threshold should only be about 1% as valuable to decision-makers as an update all the way to the threshold.</p>\n<p>(Two intuition pumps for why this is quadratic: a tiny shift in probabilities only affects a tiny fraction of prioritization decisions and only improves them by a tiny amount; or getting 100 updates of the size 1% of the way to a threshold is super unlikely to actually get you to a threshold since many of them are likely to cancel out.)</p>\n<p>However you might well want to pay for information that leaves you better informed even if it doesn't change decisions (in expectation it could change future decisions).</p>\n<p>Re. arguments split across multiple posts, perhaps it would be ideal to first decide the total prize pool depending on the value/magnitude of the total updates, and then decide on the share of credit allocation for the updates. I think that would avoid the weirdness about post order or incentivizing either bundling/unbundling considerations, while still paying out appropriately more for very large updates.</p>\n", "parentCommentId": "A2pi94EHHccDcZabZ", "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "3Cj6EtTLfjrfdbQBR", "postedAt": "2022-09-25T13:32:45.970Z", "postId": "W7C5hwq7sjdpTdrQF", "htmlBody": "<h1>$100 to change my mind to FTX's views</h1><p>If you change my mind to any of:</p><ul><li>P(misalignment x-risk|AGI) is between <s>7%</s> 0% to 35%</li><li>AGI will be developed by January 1, 2100 is between <s>30%</s> &nbsp;0% and 60%</li></ul><h1>I'm not adding the \"by 2043\" section:</h1><p>because it is too complicated for me to currently think about clearly so I don't think I'd be a good discussion partner, but I'd appreciate help there too</p><h1>My current opinion</h1><p>Is that we're almost certainly doomed (80%? more?), I can't really see a way out before 2100 except for something like civilizational collapse.</p><h1>My epistemic status</h1><p>I'm not sure, I'm not FTX.&nbsp;</p><h1>Pitch: You will be doing a good thing if you change my mind</h1><p>You will help me decide whether to work on AI Safety, and if I do, I'll have better models to do it with. If I don't, I'll go back to focusing on the <a href=\"https://effectivedevelopers.org/\">other projects</a> I'm up to. I'm a bit isolated (I live in Israel), and talking to people from the international community who can help me not get stuck in my current opinions could really help me.</p><h1>Technicalities</h1><ul><li><strong>How to talk to me?</strong> I think the best would be to comment here so our discussion will be online and people can push back, but there are more contact methods in my profile. I don't officially promise to talk to anyone, but I do expect to. If you want me to read an article, I do prefer audio. I'm also happy with voice messages.</li><li><strong>Paying up to $100 in total</strong>. By my decision (just to have some formality), but feel free to ask for something else or something more specific. (Sorry I'm not as rich as FTX)</li></ul><h1>AMA</h1>", "parentCommentId": null, "user": {"username": "hibukki"}}, {"_id": "szeWLgp29aCnHSzFF", "postedAt": "2022-09-25T14:40:15.447Z", "postId": "W7C5hwq7sjdpTdrQF", "htmlBody": "<p>Replying to a DM:</p><p>My current priors are roughly represented by <a href=\"https://www.lesswrong.com/posts/ervaGwJ2ZcwqfCcLx/agi-ruin-scenarios-are-likely-and-disjunctive\">AGI ruin scenarios are likely (and disjunctive)</a>.&nbsp;</p><p>I also expect/guess my disagreement with many people would be around our priors, not the specifics. I think many people have a prior of \"I'm not sure, and so let's assume we won't all die\", which seems wrong, but I'm open to talk.</p><p>I think most of the work with changing each other's mind will be locating the crux (as I <a href=\"https://forum.effectivealtruism.org/posts/W7C5hwq7sjdpTdrQF/announcing-the-future-fund-s-ai-worldview-prize?commentId=ruinuLWTtHa6Q7dBe\">suggested</a> FTX would help us do with them).</p>", "parentCommentId": "3Cj6EtTLfjrfdbQBR", "user": {"username": "hibukki"}}, {"_id": "vWzhGNtPAQDjtLxQE", "postedAt": "2022-09-25T15:24:13.886Z", "postId": "W7C5hwq7sjdpTdrQF", "htmlBody": "<p>For simplicity on our end, I'd appreciate if you had one post at the end that was the \"official\" entry, which links to the other posts. That would be OK!</p>", "parentCommentId": "F86NX2F5fxqkjGwvm", "user": {"username": "Nick_Beckstead"}}, {"_id": "YEqEe7ZNsGGTejFBQ", "postedAt": "2022-09-25T17:17:26.741Z", "postId": "W7C5hwq7sjdpTdrQF", "htmlBody": "<p>Question about how judges would handle multiple versions of essays &nbsp;for this competition. (I think this contest is a great idea; I'm just trying to anticipate some practical issues that might arise.)</p><p>EA Forum has a ethos of people offering ideas, getting feedback and criticism, and updating their ideas iteratively. For purposes of this contest, how would the judges treat essays that are developed in multiple versions?</p><p>For example, suppose a researcher posts version 1.0 of an essay on EA Forum with the \"Future Fund worldview prize\" tag. They get a bunch of useful feedback from other EA Forum members, refine their arguments, revise their essay, and post version 2.0 on EA Forum a couple weeks later (also with the tag). And so forth... through version 5.0 (or whatever).&nbsp;</p><p>1. Which version of the essay would judges be evaluating -- version 1.0, or version 5.0, or would they partly also be judging the extent to which the researcher really strengthened their argument through the feedback?</p><p>2. If version 1.0 had been published before this contest was announced (on Sept 23), and version 2.0 was published after that date, would version 2.0 be eligible?</p><p>3. This versioning issue might raise adverse incentives on forums &nbsp;- e.g. anyone developing their own competition entry might be incentivized to withhold praise or constructive feedback on someone else's essay, to downvote it, and/or to attack it with unusually incisive &nbsp;or detailed criticism. Or, friends and allies of an essay's author might be incentivized to lavish it with praise, upvote it, and counter-attack against any criticism.&nbsp;</p><p>4. This versioning issue might raise issues with credit assignment, prize money distribution, and potential resentments. For example, suppose a researcher's version 1.0 gets really helpful feedback on a couple of key points from other forum members, and incorporates their ideas into version 2.0 (possibly crediting them in some way, but not adding them as co-authors). What happens if version 2.0 then wins a big prize? It seems like the author would keep the prize money, but the people who helped them strengthen it might not get any reward, and might feel aggrieved. (And, perhaps anticipating this effect, they might not offer the helpful feedback in the first place.)</p><p>I have no great suggestions for how to solve these issues, but I suspect other people might be wondering about them.&nbsp;</p><p>I guess the simplest solution would be to say: judges will only consider version 1.0 of any essay, so writers better make it as good as they can, before they get any feedback.</p>", "parentCommentId": null, "user": {"username": "geoffreymiller"}}, {"_id": "GB3RWArL7WBbeJWcj", "postedAt": "2022-09-25T17:44:58.271Z", "postId": "W7C5hwq7sjdpTdrQF", "htmlBody": "<p>I attach less than 50% in this belief, but probably higher than the existing alternative hypotheses:</p><blockquote><p>FTX Foundation will not get submissions that change its mind, but it would have gotten them if only they had [fill in the blank]</p></blockquote><p><i>Given 6 months or a year for people to submit to the contest rather than 3 months.&nbsp;</i><br><br>I think forming coherent worldviews take a long time, most people have day jobs or school, &nbsp;and even people who have the flexibility to take weeks/ a month off to work on this full-time probably need some warning to arrange this with their work. &nbsp;Also some ideas take time to mull over so you benefit from calendar time spread even when the clock time takes the same.</p><p>As presented, I think this prize contest is best suited for people who a) basically have the counterarguments in mind/in verbal communication but never bothered to write it down yet or b) have a draft argument sitting in a folder somewhere and never gotten around to publishing it. In that model, the best counterarguments are already \"laying there\" in somebody's head or computer and just need some incentives for people to make them rigorous.&nbsp;</p><p>However, if the best counterarguments are currently confused or nonexistent, I don't think ~3 months calendar time from today is enough for people to discover them.</p><p>I think I understand why you want short deadlines (FTX FF wants to move fast, every day you're wrong about AI is another day where $$s and human capital is wasted and we tick towards either AI or non-AI doom). But at the same time, I feel doom-y about your ability to solicit many good novel arguments.</p>", "parentCommentId": "cEyhJ2YGSknkBMQDF", "user": {"username": "Linch"}}, {"_id": "k6EJ2mkCjP7XJZuvx", "postedAt": "2022-09-25T19:11:34.506Z", "postId": "W7C5hwq7sjdpTdrQF", "htmlBody": "<p>I don't understand this. Have you written about this or have a link that explains it?</p>", "parentCommentId": "nBZTWJfDfBhR5P9Ts", "user": {"username": "amc"}}, {"_id": "mdztPFhopra4pN4qc", "postedAt": "2022-09-25T19:53:41.288Z", "postId": "W7C5hwq7sjdpTdrQF", "htmlBody": "<p>This is a very exciting development!</p><p>In your third footnote, you write:</p><blockquote><p>It might be argued that [rewarding participants for publishing analyses that move our subjective estimates significantly away from the our current views] makes the prize encourage people to have views different from those presented here. This seems hard to avoid, since we are looking for information that changes our decisions, which requires changing our beliefs.</p></blockquote><p>However, an analysis that reassures you that your current estimates are correct can make your beliefs more <a href=\"https://forum.effectivealtruism.org/posts/m65R6pAAvd99BNEZL/use-resilience-instead-of-imprecision-to-communicate\">resilient</a>, and in turn change some of your decisions. For example, such an analysis can make you donate a larger fraction of your assets now, since you expect your beliefs to change less in the future than you did before. It can also make you less willing to run these prize contests, since they are less likely to change your views (or make them even more resilient). So I wonder if you should have instead rewarded participants for either moving your estimates significantly away from your current views or for making your current views significantly more resilient.</p>", "parentCommentId": null, "user": {"username": "Pablo_Stafforini"}}, {"_id": "dBkYY98zhKFsE7rrR", "postedAt": "2022-09-25T20:22:56.014Z", "postId": "W7C5hwq7sjdpTdrQF", "htmlBody": "<p>Thanks for the feedback! I think this is a reasonable comment, and the main things that prevented us from doing this are:<br>(i) I thought it would detract from the simplicity of the prize competition, and would be hard to communicate clearly and simply<br>(ii) I think the main thing that would make our views more robust is seeing what the best arguments are for having quite different views, and this seems like it is addressed by the competition as it stands.</p>", "parentCommentId": "mdztPFhopra4pN4qc", "user": {"username": "Nick_Beckstead"}}, {"_id": "5hgheTbnftcDAjArk", "postedAt": "2022-09-25T20:59:53.808Z", "postId": "W7C5hwq7sjdpTdrQF", "htmlBody": "<p>I really think you need to commit to reading everyone's work, even if it's an intern skimming it for 10 minutes as a sifting stage.</p>\n<p>The way this is set up now - ideas proposed by unknown people in community are unlikely to be engaged with, and so you won't read them.</p>\n<p>Look at the recent cause exploration prizes. Half the winners had essentially no karma/engagement and were not forecasted to win. If open phanthropy hadn't committed to reading them all, they could easily have been missed.</p>\n<p>Personally, yes I am much less likely to write something and put effort in if I think no one will read it.</p>\n", "parentCommentId": "cEyhJ2YGSknkBMQDF", "user": null}, {"_id": "F8h7u7Jk9HtZYnEtJ", "postedAt": "2022-09-26T06:34:51.838Z", "postId": "W7C5hwq7sjdpTdrQF", "htmlBody": "<p>Maybe FTX-FF could commit in advance to, if the grand prizes for this contest are not won this year, re-run this contest over next year?</p>\n", "parentCommentId": "GB3RWArL7WBbeJWcj", "user": {"username": "Peter_Hurford"}}, {"_id": "pAh5KJWysLkt9khiJ", "postedAt": "2022-09-26T07:51:56.359Z", "postId": "W7C5hwq7sjdpTdrQF", "htmlBody": "<p>Re the 2 disagreement votes on the parent comment: is this disagreement over me asking the question(s) (/drawing attention to the fact that it could be true)? Or answering the question(s) in the negative? If the latter, please link to bigger <i>writing</i> prizes.</p>", "parentCommentId": "6vhtBjEdGp3sKEkEh", "user": {"username": "Greg_Colbourn"}}, {"_id": "h3k6BFQpXv62siNyf", "postedAt": "2022-09-26T09:52:31.513Z", "postId": "W7C5hwq7sjdpTdrQF", "htmlBody": "<p>I've also seen online pushback against the phrasing as a conditional probability: commenters felt putting a number on it is nonsensical because the events are (necessarily) poorly defined and there's way too much uncertainty.</p>\n", "parentCommentId": "spKQXd9MX5TXhqDwx", "user": {"username": "Guy Raveh"}}, {"_id": "35ydLtbrDdHaPQeLK", "postedAt": "2022-09-26T09:55:21.756Z", "postId": "W7C5hwq7sjdpTdrQF", "htmlBody": "<blockquote>\n<p>very valuable... to be able to see upvotes, comments, and criticisms from EA Forum, Less Wrong, and Alignment Forum, which is where many of the subject matter experts hang out.</p>\n</blockquote>\n<p>I think it's the opposite. Only those experts who already share views similar to the FF (or more pessimistic) are there, and they'd introduce a large bias.</p>\n", "parentCommentId": "4QW55gGwpJfmBEMWj", "user": {"username": "Guy Raveh"}}, {"_id": "ncnJaySqaFSJu6FBk", "postedAt": "2022-09-26T09:57:37.933Z", "postId": "W7C5hwq7sjdpTdrQF", "htmlBody": "<p>I think this would be better than the current state, but really any use of \"superforecasters\" is going to be extremely off-putting to outsiders.</p>\n", "parentCommentId": "zoN3xwwCaqbWARmvs", "user": {"username": "Guy Raveh"}}, {"_id": "3JXDxHYmMow4H4npv", "postedAt": "2022-09-26T10:03:30.683Z", "postId": "W7C5hwq7sjdpTdrQF", "htmlBody": "<p>I think it's kinda weird and unproductive to focus a <a href=\"https://forum.effectivealtruism.org/posts/W7C5hwq7sjdpTdrQF/announcing-the-future-fund-s-ai-worldview-prize?commentId=6vhtBjEdGp3sKEkEh\">very large</a> prize on things that would change a single person's views, rather than be robustly persuasive to many people.</p>\n<p>E.g. does this imply that you <em>personally</em> control all funding of the FF? (I assume you don't, but then it'd make sense to try to convince all FF managers, trustees etc.)</p>\n", "parentCommentId": "uKEAQjFYZaJhqMGAh", "user": {"username": "Guy Raveh"}}, {"_id": "rXNiki5RRhSFpx44S", "postedAt": "2022-09-26T10:07:27.089Z", "postId": "W7C5hwq7sjdpTdrQF", "htmlBody": "<p>So I don't disagree that big shifts might be (much) more valuable that small shifts. But I do have the intuition that there is a split between:</p><ul><li>What would the FTX foundation find most valuable</li><li>What should they be incentivizing</li></ul><p>because incentivizing providing information is more robust to various artifacts than incentivizing changing minds.&nbsp;</p>", "parentCommentId": "nBZTWJfDfBhR5P9Ts", "user": {"username": "NunoSempere"}}, {"_id": "ELyLRd7uwrk7xwq3n", "postedAt": "2022-09-26T12:01:31.147Z", "postId": "W7C5hwq7sjdpTdrQF", "htmlBody": "<p>That may be right - an alternative would be to taboo the word in the post, and just explain that they are going to use people with an independent, objective track record of being good at reasoning under uncertainty.</p>\n<p>Of course, some people might be (wrongly, imo) skeptical of even that notion, but I suppose there's only such much one can do to get everyone on board. It's a tricky balance of making it accessible to outsiders while still just saying what you believe about how the contest should work.</p>\n", "parentCommentId": "ncnJaySqaFSJu6FBk", "user": {"username": "rgb"}}, {"_id": "ZGRacTK2jLT9oDwNa", "postedAt": "2022-09-26T12:07:21.980Z", "postId": "W7C5hwq7sjdpTdrQF", "htmlBody": "<p>To be clear, I wrote \"superforecasters\" not because I mean the word, but because I think the very notion is controversial like you said - for example, I personally doubt the existence of people who can be <em>predictably</em> \"good at reasoning under uncertainty\" in areas where they have no expertise.</p>\n", "parentCommentId": "ELyLRd7uwrk7xwq3n", "user": {"username": "Guy Raveh"}}, {"_id": "iTfjTmkqY9BYynCug", "postedAt": "2022-09-26T12:18:15.500Z", "postId": "W7C5hwq7sjdpTdrQF", "htmlBody": "<p>Sorry I don't have a link. Here's an example that's a bit more spelled out (but still written too quickly to be careful):</p><p>Suppose there are two possible worlds, S and L (e.g. \"short timelines\" and \"long timelines\"). You currently assign 50% probability to each. You invest in actions which help with either until your expected marginal returns from investment in either are equal. If the two worlds have the same returns curves for actions on both, then you'll want a portfolio which is split 50/50 across the two (if you're the only investor; otherwise you'll want to push the global portfolio towards that).</p><p>Now you update either that S is 1% more likely (51%, with L at 49%).</p><p>This changes your estimate of the value of marginal returns on S and on L. You rebalance the portfolio until the marginal returns are equal again -- which has 51% spending on S and 49% spending on L.</p><p>So you eliminated the marginal 1% spending on L and shifted it to a marginal 1% spending on S. How much better spent, on average, was the reallocated capital compared to before? Around 1%. So you got a 1% improvement on 1% of your spending.</p><p>If you'd made a 10% update you'd get roughly a 10% improvement on 10% of your spending. If you updated all the way to certainty on S you'd get to shift all of your money into S, and it would be a big improvement for each dollar shifted.</p>", "parentCommentId": "k6EJ2mkCjP7XJZuvx", "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "CytqgAqatJkfTWcmK", "postedAt": "2022-09-26T13:07:40.378Z", "postId": "W7C5hwq7sjdpTdrQF", "htmlBody": "<p>Could you provide a deeper idea of what you mean by \"misaligned\"?</p>", "parentCommentId": null, "user": {"username": "Charlie Dougherty"}}, {"_id": "QJr4rpSTxzR5FaFdj", "postedAt": "2022-09-26T13:26:56.275Z", "postId": "W7C5hwq7sjdpTdrQF", "htmlBody": "<p>I would have also suggested a prize that generally confirms your views, but with an argument that you consider superior to your previous beliefs.&nbsp;</p><p>&nbsp;This prize is similar to the bias of printing research that claims something new rather than confirming previous research.&nbsp;</p><p>That would also resolve any particular bias baked into the process that compels people to convince you that you have to update instead of actually figuring out what they actually think is right.</p>", "parentCommentId": "cEyhJ2YGSknkBMQDF", "user": {"username": "Charlie Dougherty"}}, {"_id": "rZfqzq5EMwJWJtxNr", "postedAt": "2022-09-26T17:12:11.222Z", "postId": "W7C5hwq7sjdpTdrQF", "htmlBody": "<p>Hey Lorenzo pointed me to this comment.</p><p>I work in InfoSec. The first step is defining what your threats are, and what are you trying to defend. I'll be blunt, if large, highly capable geopolitical powers actively want to get your highly valuable information, beyond passive bulk collection, then they will be able to get it. I don't quite know how to say this, but security is bad at what we do. If you want to keep something secret they want as much as say nuclear secrets, then we don't know how to do that, so that it will work with a high chance of success.</p><p>If your information is sensitive, confidential, but nation state actors only want it as much as, say something that would give a press scandal then there is opportunity. If you want to disclose infohazards safely, there's a lot to learn from whistleblower publisher orgs (like wikileaks), and CitizenLab.</p><p>The cheap, usable, option is for someone to have a otherwise unused phone and create a protonmail and signal with it, and then publish those on any https website (like this forum), and then the info never gets forwarded from the phone. Publish the protonmail PGP key, and make sure people email it from either Protonmail itself or if they understand PGP (so <i>not &nbsp;&nbsp;</i>normal gmail). That gets everything to a device with minimal attack surface, and is reasonably user friendly.&nbsp;</p><p>If you have problems in this area, I can help.</p>", "parentCommentId": "cenZyTQs32xPqau5N", "user": {"username": "Fedor Beets"}}, {"_id": "pRiqQWBD9h3yLAMw3", "postedAt": "2022-09-26T19:16:57.485Z", "postId": "W7C5hwq7sjdpTdrQF", "htmlBody": "<p>You should fly anyone who wins over 5k to meet with you in person. They have 1 hour to shift your credences by the same amount the already did (in bayesian terms, not % difference<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnref9azfm8ez3xp\"><sup><a href=\"#fn9azfm8ez3xp\">[1]</a></sup></span>). If they do, you'll give them the amount of money you already did.&nbsp;<br><br>I imagine some people arguing in person will be able to convince you better, both because there will be much greater bandwidth and because it allows for facial expressions and understanding the emotions behind an intellectual position, which are really important.</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fn9azfm8ez3xp\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnref9azfm8ez3xp\">^</a></strong></sup></span><div class=\"footnote-content\"><p>If you move someone from 90% to 99%, the equivalent increase is to 99.9% not to.. 108%??</p></div></li></ol>", "parentCommentId": null, "user": {"username": "nathan"}}, {"_id": "EvSGE6LzrZRbo5Fkw", "postedAt": "2022-09-26T21:33:11.764Z", "postId": "W7C5hwq7sjdpTdrQF", "htmlBody": "<p>...if they had explained why their views were <i>not</i> moved by the expert reviews OpenPhil has already solicited.</p><p>In \"<a href=\"https://www.cold-takes.com/where-ai-forecasting-stands-today/#reason-2-cunninghams-law\">AI Timelines: Where the Arguments, and the 'Experts,' Stand</a>,\" Karnofsky writes:</p><blockquote><p>Then, we commissioned external expert reviews.<a href=\"https://www.cold-takes.com/where-ai-forecasting-stands-today/#fn7\"><strong><sup><u>7</u></sup></strong></a></p><p>Speaking only for my own views, the \"most important century\" hypothesis seems to have survived all of this. Indeed, having examined the many angles and gotten more into the details, I believe it more strongly than before.</p></blockquote><p>The footnote text reads, in part:</p><blockquote><p>Reviews of Bio Anchors are <a href=\"https://drive.google.com/drive/u/1/folders/1XkTYFiZQUT6UAUL2Wyg9wD0qG57KYfjq\"><strong><u>here</u></strong></a>; reviews of Explosive Growth are <a href=\"https://www.openphilanthropy.org/could-advanced-ai-drive-explosive-economic-growth#AppendixH\"><strong><u>here</u></strong></a>; reviews of Semi-informative Priors are <a href=\"https://www.openphilanthropy.org/blog/report-semi-informative-priors#LinksToReviewer\"><strong><u>here</u></strong></a>.</p></blockquote><p>Many of these reviewers disagree strongly with the reports under review.</p><hr><p><a href=\"https://www.openphilanthropy.org/research/report-on-semi-informative-priors\"><strong>Davidson 2021 on semi-informative priors</strong></a> received three reviews.</p><p>By my judgment, all three made strong negative assessments, in the sense (among others) that if one agreed with the review, one would not use the report's reasoning to inform decision-making in the manner advocated by Karnofsky (and by Beckstead).</p><p>From Hajek and Strasser's review:</p><blockquote><p>His final probability of 7.3% is a nice summary of his conclusion, but its precision (including a decimal place!) belies the vagueness of the question, the imprecise and vague inputs, and the arbitrary/subjective choices Tom needs to make along the way—we discuss this more in our answers to question 8. We think a wider range is appropriate given the judgment calls involved. Or one might insist that an imprecise probability assignment is required here. Note that this is not the same as a range of permissible sharp probabilities. Following e.g. Joyce, one might think that no precise probability is permissible, given the nature of the evidence and the target proposition to which we are assigning a credence.</p></blockquote><p>From Hanson's review:</p><blockquote><p>I fear that for this application, this framework abstracts too much from important details.</p><p>&nbsp;For example, if the actual distribution is some generic lump, but the model distribution is an exponential falling from an initial start, then the errors that result from this difference are probably worse regarding the lowest percentiles of either distribution, where the differences are most stark. So I’m more comfortable using such a simple model to estimate distribution medians, relative to low percentiles. Alas, the main products of this analysis are exactly these problematic low percentile estimates.</p></blockquote><p>From Halpern's review:</p><blockquote><p>If our goal were a single estimate, then this is probably as reasonable as any other. &nbsp;I have problems with the goal (see below). [...]</p><p>As I said above, I have serious concerns about the way that dynamic issues are being handled. [...]</p><p>I am not comfortable with modeling uncertainty in this case using a single probability measure.</p></blockquote><p><a href=\"https://www.openphilanthropy.org/research/could-advanced-ai-drive-explosive-economic-growth/\"><strong>Davidson 2021 on explosive growth</strong></a> received many reviews; I'll focus on the five reviewers who read the final version.</p><p>Two of the reviewers found little to disagree with. &nbsp;These were Leopold Aschenbrenner (a Future Fund researcher) and Ege Erdil (a Metaculus forecaster).</p><p>The other three reviewers were academic economists specializing in growth and/or automation. &nbsp; Two of them made strong negative assessments.</p><p>From Ben Jones' review:</p><blockquote><p>Nonetheless, while this report suggests that a rapid growth acceleration is substantially less likely than singularity-oriented commentators sometimes advocate, to my mind this report still sees 30% growth by 2100 as substantially likelier than my intuitions would suggest. &nbsp;Without picking numbers, and acknowledging that my views may prove wrong, I will just say that achieving 30% growth strikes me as very unlikely. &nbsp;Here I will articulate some reasons why, to provoke further discussion.</p></blockquote><p>From Dietrich Vollrath's review:</p><blockquote><p>All that said, I think the probability of explosive growth in GWP is very low. Like 0% low. I think those issues I raised above regarding output and demand will bind and bite very hard if productivity grows that fast.</p></blockquote><p>The third economist, Paul Gaggl, agreed with the report about the possibility of high GWP growth but raised doubts as to how long it could be sustained. &nbsp;(How much this matters depends on what question we're asking; \"a few decades\" of 30% GWP growth is not a permanent new paradigm, but it is certainly a big \"transformation.\")</p><p>Reviews of <a href=\"https://drive.google.com/drive/u/1/folders/15ArhEPZSTYU8f012bs6ehPS6-xmhtBPP\"><strong>Cotra (2020) on Biological Anchors</strong></a> were mostly less critical than the above.</p><hr><p>I expect that some experts would be much more likely to spend time and effort on the contest if&nbsp;</p><ol><li>They had clearer evidence that the Future Fund was amendable to persuasion at all.<ol><li>E.g. examples of somewhat-analogous cases in which a critical review <i>did</i> change the opinion of someone currently at the Future Fund (perhaps before the Future Fund existed).</li></ol></li><li>They were told why the specific critical reviews discussed above did not have significant impact on the Future Fund's views.<ol><li>This would help steer them toward critiques likely to make an impact, mitigate the sense that entrants are \"shooting in the dark,\" and move writing-for-the-contest outside of a reference class where all past attempts have failed.</li></ol></li></ol><p>These considerations seems especially relevant for the \"dark matter\" experts hypothesized in this post and Karnofsky's, who \"find the whole thing so silly that they're not bothering to engage.\" &nbsp;These people are unusually likely to have a low opinion of the Future Fund's overall epistemics (point 1), and they are also likely to disagree with the Fund's reasoning along a relatively large number of axes, so that locating a crux becomes more of a problem (point 2).</p><hr><p>Finally: I, personally would be more likely to submit to the contest if I had a clearer sense where the cruxes were, and why past criticisms have failed to stick. &nbsp;(For clarity, I don't consider myself an \"expert\" in any relevant sense.)</p><p>While I don't \"find the whole thing so silly I don't bother to engage,\" I have relatively strong methodological objections to some of the OpenPhil reports cited here. &nbsp;There is a large inferential gap between me and anyone who finds these reports prima facie convincing. &nbsp;Given the knowledge that someone <i>does </i>find them prima facie convincing, and little else, it's hard to know where to begin in trying to close that gap.</p><p>Even if I had better guidance, the size of the gap increases the effort required and decreases my expected probability of success, and so it makes me less likely to contribute. &nbsp;This dynamic seems like a source of potential bias in the distribution of the responses, though I don't have any great ideas for what to do about it.</p>", "parentCommentId": "cEyhJ2YGSknkBMQDF", "user": {"username": "nostalgebraist"}}, {"_id": "dbqfgbrz7R78Msogd", "postedAt": "2022-09-26T22:27:51.027Z", "postId": "W7C5hwq7sjdpTdrQF", "htmlBody": "<p>Adding: I'm worried that nobody will address FTX's reasons to believe what they believe, and FTX will conclude \"well, we put out a $1.5M bounty and nobody found flaws, they only addressed straw arguments that we don't even believe in, this is pretty strong evidence we are correct!</p><p>&nbsp;</p><p>Please consider replying, FTX!</p>", "parentCommentId": "ruinuLWTtHa6Q7dBe", "user": {"username": "hibukki"}}, {"_id": "skfA4mLjMkTqd9A6q", "postedAt": "2022-09-27T07:10:33.364Z", "postId": "W7C5hwq7sjdpTdrQF", "htmlBody": "<p>I agree that finding the cruxes of disagreement are important, but I don't think any of the critical quotes you present above are that strong. The reviews of <i>semi-informative priors </i>talk about error bars and precision (i.e. critique the model), but don't actually give different answers. On <i>explosive growth</i>, Jones talks about the conclusion being contrary to his \"intuitions\", and acknowledges that \"[his] views may prove wrong\". Vollrath mentions \"output and demand\", but then <a href=\"https://docs.google.com/document/d/1NScJzPLzLjYRkKJOjwlrPFO8PJ1xXUX81ksP7GwtCEU/edit#\">talks about</a> human productivity when regarding outputs, and admits that AI could create new in-demand products. If these are the best existing sources for lowering the Future Fund's probabilities, then I think someone should be able to do better.</p>", "parentCommentId": "EvSGE6LzrZRbo5Fkw", "user": {"username": "Greg_Colbourn"}}, {"_id": "ZujoBExdpp4umbapi", "postedAt": "2022-09-27T07:12:46.438Z", "postId": "W7C5hwq7sjdpTdrQF", "htmlBody": "<p>On the other hand, I think that the real probabilities are higher, and am confused as to why the Future Fund haven't already updated to higher probabilities, given <a href=\"https://forum.effectivealtruism.org/posts/W7C5hwq7sjdpTdrQF/announcing-the-future-fund-s-ai-worldview-prize?commentId=vBARSdteodGuwvzeG\">some of the writing already out there</a>. I give a speculative reason <a href=\"https://forum.effectivealtruism.org/posts/W7C5hwq7sjdpTdrQF/announcing-the-future-fund-s-ai-worldview-prize?commentId=xprWD5dtG3fhQ7sNd\">here</a>.</p>", "parentCommentId": "skfA4mLjMkTqd9A6q", "user": {"username": "Greg_Colbourn"}}, {"_id": "WGjEEPME2W4v35hqf", "postedAt": "2022-09-27T09:25:32.297Z", "postId": "W7C5hwq7sjdpTdrQF", "htmlBody": "<p>Wow, thanks for this well written summary of expert reviews that I didn't know existed! Strongly upvoted.</p>\n", "parentCommentId": "EvSGE6LzrZRbo5Fkw", "user": {"username": "Guy Raveh"}}, {"_id": "QkAqbT9fK4SqYmFYw", "postedAt": "2022-09-27T10:14:51.151Z", "postId": "W7C5hwq7sjdpTdrQF", "htmlBody": "<p>I think this particular example requires an assumption of logarithmically diminishing returns, but is right with that.</p><p>(I think the point about roughly quadratic value of information applies more broadly than just for logarithmically diminishing returns. And I hadn't realised it before. Seems important + underappreciated!)</p><p>One quirk to note: If a funder (who I want to be well-informed) is 50/50 on S vs L, but <strong>my</strong> all-things-considered belief is 60/40, then I would value the first 1% they shift <strong>towards my position</strong> much more than they do (maybe 10x more?) &nbsp;and will put comparatively little value on shifting them all the way (ie the last percent from 59% to 60% is much less important). You can get this from a pretty similar argument as in the above example.</p><p>(In fact, the funder's own much greater valuation of shifting 10% than 1% can be seen as a two-step process where (i) they shift to 60/40 beliefs, and then (ii) they first get a lot of value from shifting their allocation from 50 to 51, then slightly less from shifting from 51 to 52, etc...)</p>", "parentCommentId": "iTfjTmkqY9BYynCug", "user": {"username": "Lukas_Finnveden"}}, {"_id": "djTjBSLEtzuAYG8WS", "postedAt": "2022-09-27T12:38:31.022Z", "postId": "W7C5hwq7sjdpTdrQF", "htmlBody": "<p>I agree with all this. I meant to state that I was assuming logarithmic returns for the example, although I do think some smoothness argument should be enough to get it to work for small shifts.</p>\n", "parentCommentId": "QkAqbT9fK4SqYmFYw", "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "jcZmepeez7ivfkf6W", "postedAt": "2022-09-27T13:58:13.927Z", "postId": "W7C5hwq7sjdpTdrQF", "htmlBody": "<p>I also wonder if it would be cost-effective to spend some part of the contest’s budget on outreach to high-potential contributors.</p>\n<p>Rough/vague example:\npay someone to…</p>\n<ul>\n<li>\n<p>research which individuals would likely have especially compelling arguments to contribute</p>\n</li>\n<li>\n<p>determine which people in EA’s network are best positioned to make (personal) contact with those individuals</p>\n</li>\n<li>\n<p>spend money to increase the likelihood that these individuals are successfully contacted and encouraged to submit something to the contest (e.g. arrange a dinner or meeting that they deem worthwhile to attend, where the contest is outlined to them)</p>\n</li>\n</ul>\n", "parentCommentId": "dACdr4eqtWZDmNRZe", "user": {"username": "Max Kearney"}}, {"_id": "EnMfKWeQem9Bfnus7", "postedAt": "2022-09-27T16:50:15.817Z", "postId": "W7C5hwq7sjdpTdrQF", "htmlBody": "<p>Weakly downvoting due to over-strong claims and the evidence doesn't fully support your view. This is weak evidence against AGI claims, but the claims in this comment are too strong.</p>\n<p>Quoting Greg Colbourn:</p>\n<blockquote>\n<p>I agree that finding the cruxes of disagreement are important, but I don't think any of the critical quotes you present above are that strong. The reviews of semi-informative priors talk about error bars and precision (i.e. critique the model), but don't actually give different answers. On explosive growth, Jones talks about the conclusion being contrary to his \"intuitions\", and acknowledges that \"[his] views may prove wrong\". Vollrath mentions \"output and demand\", but then talks about human productivity when regarding outputs, and admits that AI could create new in-demand products. If these are the best existing sources for lowering the Future Fund's probabilities, then I think someone should be able to do better.</p>\n</blockquote>\n", "parentCommentId": "EvSGE6LzrZRbo5Fkw", "user": {"username": "Sharmake"}}, {"_id": "h2oPdAcy38smiMEZa", "postedAt": "2022-09-27T17:58:44.102Z", "postId": "W7C5hwq7sjdpTdrQF", "htmlBody": "<p>How do we submit our essay for the contest? Is there an email we send it to or something?</p>\n", "parentCommentId": null, "user": {"username": "JMETSR"}}, {"_id": "Jw4DgMBRA56Xpvam7", "postedAt": "2022-09-28T02:19:58.310Z", "postId": "W7C5hwq7sjdpTdrQF", "htmlBody": "<p>For transparency:</p><p>I'm discussing this with Andrew Timm <a href=\"https://join-asap.slack.com/archives/C0412E8VD6H/p1664233408956949?thread_ts=1664117025.243849&amp;cid=C0412E8VD6H\">here</a>.</p><p>&nbsp;</p><p>(But please don't let this stop you from opening another conversation with me)</p>", "parentCommentId": "3Cj6EtTLfjrfdbQBR", "user": {"username": "hibukki"}}, {"_id": "hKwpwa4QeEHbv3ww9", "postedAt": "2022-09-28T09:27:11.937Z", "postId": "W7C5hwq7sjdpTdrQF", "htmlBody": "<p>Nick, very excited by this and to see what this prize produces. One think I would find super useful is to know your probability of a bio x-risk by 2100. &nbsp;Thanks.</p>", "parentCommentId": null, "user": {"username": "weeatquince"}}, {"_id": "CzdZ2tbCLLsDCPhdB", "postedAt": "2022-09-28T10:34:46.820Z", "postId": "W7C5hwq7sjdpTdrQF", "htmlBody": "<p>I personally would compete in this prize competition, but only if I were free to explore:</p><p><strong>&nbsp;P(misalignment x-risk|AGI): Conditional on AGI being developed by 2070, humanity will go extinct or drastically curtail its future potential due to </strong><i><strong>concentration of power </strong></i><strong>derived from AGI technology.</strong></p><p>You wrote:</p><blockquote><p>Here is a table identifying various questions about these scenarios that we believe are central, our current position on the question (for the sake of concreteness), and alternative positions that would significantly alter the Future Fund's thinking about the future of AI:</p><figure class=\"table\" style=\"height:287.6px;width:682px\"><table style=\"border:1px double rgb(179, 179, 179)\"><tbody><tr><td style=\"border:0.75pt solid rgb(204, 204, 204);padding:2pt;vertical-align:bottom\">Proposition</td><td style=\"border:0.75pt solid rgb(204, 204, 204);padding:2pt;vertical-align:bottom\">Current position</td><td style=\"border:0.75pt solid rgb(204, 204, 204);padding:2pt;vertical-align:bottom\">Lower prize threshold</td><td style=\"border:0.75pt solid rgb(204, 204, 204);padding:2pt;vertical-align:bottom\">Upper prize threshold</td></tr><tr><td style=\"border:0.75pt solid rgb(204, 204, 204);padding:2pt;vertical-align:bottom\">“P(misalignment x-risk|AGI)”: Conditional on AGI being developed by 2070, humanity will go extinct or drastically curtail its future potential due to loss of control of AGI</td><td style=\"border:0.75pt solid rgb(204, 204, 204);padding:2pt;vertical-align:bottom\">15%</td><td style=\"border:0.75pt solid rgb(204, 204, 204);padding:2pt;vertical-align:bottom\">7%</td><td style=\"border:0.75pt solid rgb(204, 204, 204);padding:2pt;vertical-align:bottom\">35%</td></tr><tr><td style=\"border:0.75pt solid rgb(204, 204, 204);padding:2pt;vertical-align:bottom\">AGI will be developed by January 1, 2043</td><td style=\"border:0.75pt solid rgb(204, 204, 204);padding:2pt;vertical-align:bottom\">20%</td><td style=\"border:0.75pt solid rgb(204, 204, 204);padding:2pt;vertical-align:bottom\">10%</td><td style=\"border:0.75pt solid rgb(204, 204, 204);padding:2pt;vertical-align:bottom\">45%</td></tr><tr><td style=\"border:0.75pt solid rgb(204, 204, 204);padding:2pt;vertical-align:bottom\">AGI will be developed by January 1, 2100</td><td style=\"border:0.75pt solid rgb(204, 204, 204);padding:2pt;vertical-align:bottom\">60%</td><td style=\"border:0.75pt solid rgb(204, 204, 204);padding:2pt;vertical-align:bottom\">30%</td><td style=\"border:0.75pt solid rgb(204, 204, 204);padding:2pt;vertical-align:bottom\">N/A</td></tr></tbody></table></figure></blockquote><p>but this list does not include the conditional probability that interests me.</p><p>You wrote:</p><blockquote><p>With the help of advanced AI, we could make enormous progress toward ending global poverty, animal suffering, early death and debilitating disease.&nbsp;</p></blockquote><p>This seems really motivating. You identify:</p><ul><li>global poverty</li><li>animal suffering</li><li>early death</li><li>debilitating disease</li></ul><p>as problems that TAI could help humanity solve.</p><p>I will offer briefly that humans are sensitive to changes in their behaviors, at least as seen in advance, that deprive them of choices they have already made. We cause:</p><ul><li>&nbsp;<strong>global poverty through economic systems </strong>that support exploitation of developing countries and politically-powerless people (e.g., through corporate capitalism and military coups)</li><li><strong>animal suffering through widespread factory farming</strong> (enough to dominate terrestrial vertebrate populations globally with our farm animals) <strong>and gradual habitat destruction</strong> (enough to threaten the extinction of a million species)</li><li><strong>early death through lifestyle-related debilitating disease</strong> (knock-on effects of lifestyle choices in affluent countries now spread throughout the globe).</li></ul><p>So these TAI would apparently resolve, through advances in science and technology, various immediate causes, with a root cause found in our appetite (for wealth, power, meat, milk, and unhealthy lifestyles). &nbsp;Of course, there are other reasons for debilitating disease and early death than human appetite. However, your claim implies to me that we invent robots and AI to either reduce or feed our appetites <i>harmlessly</i>.&nbsp;</p><p>Causes of global poverty, animal suffering, some debilitating diseases, and early human death are maintained by incentive structures that benefit a subset of the global population. TAI will apparently remove those incentive structures, but not by any mechanism that I believe really requires TAI. Put differently, once TAI can really change our incentive structures that much, t<i>hen they or their controlling actors are already in control of humanity's choices. </i>I doubt that we want that control over us<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefyduk8swbub\"><sup><a href=\"#fnyduk8swbub\">[1]</a></sup></span>.</p><p>You wrote:</p><blockquote><p>But two formidable new problems for humanity could also arise:</p><ol><li><strong>Loss of control to AI systems</strong><br>Advanced AI systems might acquire undesirable objectives and pursue power in unintended ways, causing humans to lose all or most of their influence over the future.</li><li><strong>Concentration of power</strong><br>Actors with an edge in advanced AI technology could acquire massive power and influence; if they misuse this technology, they could inflict lasting damage on humanity’s long-term future.</li></ol></blockquote><p>Right. So if whatever actor with an edge in AI develops AGI, that actor might not share code or hardware technologies required with many other actors. The result will be concentration of power into those actors with control of AGI's.</p><p>Absent the guarantee of autonomy and rights to AGI (whether pure software or embodied in robots), &nbsp;the persistence of that power concentration will require that those actors are benevolent controllers of the rest of humanity. It's plausible that &nbsp;those actors will be either government or corporate. It's also plausible that those can become fundamentally benign or are in control already. &nbsp;If not, then the development of AI immediately implies problem 2 (concentration of political/economic/military power from AGI into those who misuse the technology).</p><p>If we do ensure the autonomy and rights of AGI (software or embodied), then we had better hope that, with loss of control <i>of</i> AGI, we do not develop loss of control <i>to</i> AGI. Or else we are faced with problem 1 (loss of control to AGI). If we do include AGI in our moral circles, as we should for beings with consciousness and intelligence equal to or greater than our own, &nbsp;then we will ensure their &nbsp;autonomy and rights.&nbsp;</p><p>The better approach of course is to do our best to align them with our interests in advance of their ascendance to full autonomy and citizen status, so that they themselves are benevolent and humble, willing to act like our equals and co-exist in our society peacefully.&nbsp;</p><p>You wrote:</p><blockquote><p>Imagine a world where cheap AI systems are fully substitutable for human labor. E.g., for any human who can do any job, there is a computer program (not necessarily the same one every time) that can do the same job for $25/hr or less. This includes entirely AI-run companies, with AI managers and AI workers and everything being done by AIs.</p></blockquote><p>Companies that rely on prison labor or labor without &nbsp;political or economic power can and will exploit that labor. I consider that common knowledge. If you look into how most of our products are made overseas, you'll find that manufacturing and service workers globally do not enjoy the same power as <i>some </i>workers in the US<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefcth4mdvcsvk\"><sup><a href=\"#fncth4mdvcsvk\">[2]</a></sup></span>, at least not so far.&nbsp;</p><p>The rise of companies that treat AGI like slaves or tools will be continuing an existing precedent, but one that globalization conceals to some degree (for example, through employment of contractors overseas). Either way, those companies will be violating ethical norms of treatment of people. This appears to be in violation of your ethical concerns about the welfare of people (for example, humans and farm animals). Expansion of those violations is an s-risk.</p><p>At this point I want to qualify my requirements to participate in this contest further.&nbsp;</p><p>I would participate in this contest, but only if I &nbsp;could explore the probability that I stated earlier<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefwt6iapc9q7\"><sup><a href=\"#fnwt6iapc9q7\">[3]</a></sup></span>&nbsp;and you or FTX Philanthropy offer some officially stated and appropriately qualified beliefs about:&nbsp;</p><ul><li>whether you consider humans to have economic rights (in contrast to capitalism which is market or monopoly-driven)</li><li>the political and economic rights and power of labor globally</li><li>how AGI allow fast economic growth in the presence of widespread human unemployment&nbsp;</li><li>how AGI employment differs from AI tool use&nbsp;</li><li>what criteria you hold for giving full legal rights to autonomous software agents and AGI embodied in robots enough to differentiate them from tools</li><li>how you distinguish AGI from ASI (for example, orders of magnitude enhanced speed of application of human-like capability is, to some, superhuman)</li><li>your criteria for an AGI acquiring both consciousness and affective experience</li><li>the role of automation<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefzfhhr21klml\"><sup><a href=\"#fnzfhhr21klml\">[4]</a></sup></span>&nbsp;in driving job creation<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefkpdfibnqnro\"><sup><a href=\"#fnkpdfibnqnro\">[5]</a></sup></span>&nbsp;and your beliefs around technological unemployment&nbsp;<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnreff6fmavu7gsf\"><sup><a href=\"#fnf6fmavu7gsf\">[6]</a></sup></span>and wealth inequality</li><li>what barriers<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefmbjqbls0gm\"><sup><a href=\"#fnmbjqbls0gm\">[7]</a></sup></span>&nbsp;you believe exist to automation in driving productivity and economic growth.</li></ul><p>&nbsp;</p><p>&nbsp;</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnyduk8swbub\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefyduk8swbub\">^</a></strong></sup></span><div class=\"footnote-content\"><p>I wrote about a<a href=\"https://forum.effectivealtruism.org/posts/dAh93EB2m6R9EoZuD/will-longtermists-self-efface#Longtermists_should_self_efface\"> few errors </a>that longtermists will make in their considerations about control over populations. This control involving TAI might include all the errors I mentioned.</p></div></li><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fncth4mdvcsvk\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefcth4mdvcsvk\">^</a></strong></sup></span><div class=\"footnote-content\"><p>People also place a lot of confidence in their own intellectual abilities and faith in their value to organizations. To see this still occurring in the face of advances in AI is actually disheartening. The same confusion clouds insight into the problems that AI pose to human beings and society at large, particularly in our capitalist society that expects us to sell ourselves to employers.</p></div></li><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnwt6iapc9q7\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefwt6iapc9q7\">^</a></strong></sup></span><div class=\"footnote-content\"><p>&nbsp;P(misalignment x-risk|AGI): Conditional on AGI being developed by 2070, humanity will go extinct or drastically curtail its future potential due to <i>concentration of power </i>derived from AGI technology.</p></div></li><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnzfhhr21klml\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefzfhhr21klml\">^</a></strong></sup></span><div class=\"footnote-content\"><p>Automation with AI tools is, at least in the short-term, not creating new jobs and employment overall. Or so I believe. &nbsp;However, it can drive productivity growth without increasing employment, and in fact, economic depression is one reason to for business to invest in inexpensive automation that lowers costs. &nbsp;This is when the cost-cutters get to work and the consultants are called in to help.</p></div></li><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnkpdfibnqnro\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefkpdfibnqnro\">^</a></strong></sup></span><div class=\"footnote-content\"><p>New variations in crowd-sourcing &nbsp;(such as these contests) and mechanical turk sort of work can substitute for traditional labor with significant cost reductions for financial entities. &nbsp;This is (potentially) paid labor but not work as it was once defined.</p></div></li><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnf6fmavu7gsf\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnreff6fmavu7gsf\">^</a></strong></sup></span><div class=\"footnote-content\"><p>Shifting work onto consumers (for example, as I am in asking for additional specification from your organization) is another common approach to reducing costs. This is a simple reframe of a service into an expectation. Now you pump your own gas, ring your own groceries, balance your own books, write your own professional correspondence, do your own research, etc. It drives a reduction in employment without a corresponding increase elsewhere.</p></div></li><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnmbjqbls0gm\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefmbjqbls0gm\">^</a></strong></sup></span><div class=\"footnote-content\"><p>One reason that automation doesn't always catch on is that while management have moderate tolerance for mistakes by people, they have low tolerance for mistakes by machines. Put differently, they apply uneven standards to machines vs people.&nbsp;</p><p>Another reason is that workers sometimes resist automation, criticizing and marginalizing its use whenever possible.</p></div></li></ol>", "parentCommentId": "cEyhJ2YGSknkBMQDF", "user": {"username": "Noah Scales"}}, {"_id": "bAM27JHxbDbtHYNWK", "postedAt": "2022-09-28T20:55:03.065Z", "postId": "W7C5hwq7sjdpTdrQF", "htmlBody": "<blockquote><p>if they had explained why their views were <i>not</i> moved by the expert reviews OpenPhil has already solicited.</p></blockquote><p>I included responses to each review, explaining &nbsp;my reactions to it. What kind of additional explanation were you hoping for?</p><p>&nbsp;</p><blockquote><p><a href=\"https://www.openphilanthropy.org/research/report-on-semi-informative-priors\"><strong>Davidson 2021 on semi-informative priors</strong></a> received three reviews.</p><p>By my judgment, all three made strong negative assessments, in the sense (among others) that if one agreed with the review, one would not use the report's reasoning to inform decision-making in the manner advocated by Karnofsky (and by Beckstead).</p></blockquote><p>For Hajek&amp;Strasser's and Halpern’s &nbsp;reviews, I don't think \"strong negative assessment\" is supported by your quotes. The quotes focus on things like 'the reported numbers are too precise' and 'we should use more than a single probability measure' rather than whether the estimate is too high or too low overall or whether we should be worrying more vs less about TAI. I also think the reviews are more positive overall than you imply, e.g. Halpern's review says \"<i>This seems to be the most serious attempt to estimate when AGI will be developed that I’ve seen</i>\"&nbsp;</p><p>&nbsp;</p><blockquote><p><strong>&nbsp;</strong><a href=\"https://www.openphilanthropy.org/research/could-advanced-ai-drive-explosive-economic-growth/\"><strong>Davidson 2021 on explosive growth</strong></a> received many reviews... Two of them made strong negative assessments.</p></blockquote><p>I agree that these two reviewers assign much lower probabilities to explosive growth than I do (I explain why I continue to disagree with them in my responses to their reviews). Again though, I think these reviews are more positive overall than you imply, e.g. Jones states that the report \"<i>is balanced, engaging a wide set of viewpoints and acknowledging debates and uncertainties... &nbsp;is also admirably clear in its arguments and in digesting the literature... engages key ideas in a transparent way, integrating perspectives and developing its analysis clearly and coherently.</i>\" This is important as it helps us move from \"maybe we're completely missing a big consideration\" to \"some experts continue to disagree for certain reasons, but we have a solid understanding of the relevant considerations and can hold our own in a disagreement\".&nbsp;</p>", "parentCommentId": "EvSGE6LzrZRbo5Fkw", "user": {"username": "Tom_Davidson"}}, {"_id": "mm2JPKg69MEK7uera", "postedAt": "2022-09-29T00:53:27.156Z", "postId": "W7C5hwq7sjdpTdrQF", "htmlBody": "<p>I'm willing to discuss this over Zoom, or face to face once I return to Israel in November.</p>\n<p>What I think my main points are:</p>\n<ul>\n<li>We don't seem to be anywhere near AGI. The amount of compute might very soon be enough but we also need major theoretical breakthroughs.</li>\n<li>Most extinction scenarios that I've read about or thought about require some amount of bad luck, at least if AGI is born out of the ML paradigm</li>\n<li>AGI is poorly defined, so it's hard to reason on what it would do once it comes into existence, of you could even describe that as a binary event</li>\n<li>It seems unlikely that a malignant AI succeeds in deceiving us until it is capable of preventing us from shutting it off</li>\n</ul>\n<p>I'm not entirely convinced in any of them - I haven't thought about this carefully.</p>\n<p>Edit: there's a doom scenario that I'm more worried about, and it doesn't require AGI - and that's global domination by a tyrannical government.</p>\n", "parentCommentId": "szeWLgp29aCnHSzFF", "user": {"username": "Guy Raveh"}}, {"_id": "ECgBwExRuLsFTXRaQ", "postedAt": "2022-09-30T01:32:10.943Z", "postId": "W7C5hwq7sjdpTdrQF", "htmlBody": "<p>Interesting idea for a competition, but I don't think that the contest rules as designed and, more specifically, the information hazard policy, are well thought out for any submissions that follow the below line of argumentation when attempting to make the case for longer timelines:</p><ul><li>Scaling current deep learning approaches in both compute and data will not be sufficient to achieve AGI, at least within the timeline specified by the competition</li><li>This is due to some critical component missing in the design of current deep neural networks</li><li>Supposing that this critical component is being ignored by current lines of research and/or has otherwise been deemed intractable, AGI development is likely to proceed slower than the current assumed status quo</li><li>The Future Fund should therefore shift some portion of their probability mass for the development of AGI further into the future</li></ul><p>Personally, I find the above arguments one of the more compelling cases for longer timelines. However, a crux of these arguments holding true is that these critical components <i>are</i> &nbsp;in fact largely ignored or deemed intractable by current researchers. Making that claim necessarily involves explaining the technology, component, method, etc. in question, which could justifiably be deemed an information hazard, even if we are only describing <i>why &nbsp;</i>this element may be critical rather than <i>how</i> &nbsp;it could be built. &nbsp;</p><p>Seems like this type of submission would likely be disqualified despite being exactly the kind of information needed to make informed funding decisions, no?</p>", "parentCommentId": null, "user": {"username": "Grant Fleming"}}, {"_id": "H9dKB3a2uBeCKThJv", "postedAt": "2022-10-03T12:13:43.429Z", "postId": "W7C5hwq7sjdpTdrQF", "htmlBody": "<blockquote><p>The announcement raises the possibility that \"a bunch of this AI stuff is basically right, but we should be focusing on entirely different aspects of the problem.\" But it seems to me that if someone successfully argues for this position, they won't be able to win any of the offered prizes.</p></blockquote><p>&nbsp;</p><p>Thanks for clarifying this is in fact the case Nick. I get how setting a benchmark - in this case an essay's persuasiveness at shifting probabilities you assign to different AGI / extinction scenarios - makes it easier to judge across the board. But as someone who works in this field, I can't say I'm excited by the competition or feel it will help advance things.&nbsp;</p><p>Basically, I don't know if this prize is incentivising things which matter most. Here's why:</p><ol><li>The focus is squarely on likelihood of things going wrong against different timelines. It has nothing to do with solutions space</li><li>But solutions are still needed, even if the likelihood reduces / increases by a large amount, because the impact would be so high.&nbsp;<ol><li>Take Proposition 1: humanity going extinct or drastically curtailing its future due to loss of control of AGI. I can see how a paper which changes your probabilities from 15% to either 7% or 35% would lead to FTX changing the amount invested in this risk relative to other X risks - this is good. However, I doubt it'd lead to a full on disinvestment, let alone that you still wouldn't want to fund the best solutions, or be worried if the solutions to hand looked weak</li></ol></li><li>Moreover, capabilities advancements have rapidly changed priors of when AGI / transformative AI would be developed, and will likely continue to do so iteratively. Once this competition is done, new research could have shifted the dial again. Solutions space will likely be the same</li><li>So long as the capabilities-alignment advancements gap persists, solutions will more likely come from the AI governance space than AI alignment research space just yet</li><li>The solution space is pretty sparse still in terms of governance of AI. But given the argument in 2), I think this is a big risk and one where further work should be stimulated. There's likely loads of value off the table, people sitting on ideas, especially people outside the EA community who have worked in governance / non-proliferation negotiations etc.</li><li>I'd be more assured if this competition encouraged submissions on how \"a bunch of this AI stuff is basically right, <strong>but we should be focusing on entirely different aspects of the problem</strong>\". The way the prize criteria is written out, if I had an argument about taking a new approach to AI alignment (incl. 'it's likely intractable') I wouldn't submit to this competition as I'd think it isn't for me. But arguments on achievability of alignment - even it's theoretical possibility - are central to what gets funded in this field, and have flow-through effects for AI governance interventions. This feels like a missed opportuity, and a much bigger loss than the governance interventions bit</li></ol><p>Basically, we probably need more solutions on the table regardless of changes in probabilities of AGI being developed sooner / later, and this won't draw them out.&nbsp;</p><p>Would be good to know why this was the focus if you have time, or at least something to consider if you do decide to do another competition off the bat of this.&nbsp;</p><p>(Sorry if any of this seems a bit rough as feedback, I think it's better not to be a nodding dog, esp. for things so high consequence.)</p>", "parentCommentId": "hduodGwtYmqZwS5t7", "user": {"username": "howdoyousay?"}}, {"_id": "TkaZRfiJu3uHLc6rG", "postedAt": "2022-10-05T15:21:08.427Z", "postId": "W7C5hwq7sjdpTdrQF", "htmlBody": "<blockquote>\n<p>I think it would be nicer if you say your P(Doom|AGI in 2070) instead of P(Doom|AGI by 2070), because the second one implicitly takes into account your timelines.</p>\n</blockquote>\n<p>I disagree. (At least, if defining \"nicer\" as \"more useful to the stated goals for the prizes\".)</p>\n<p>As an interested observer, I think it's an advantage to take timelines into account. Specifically, I think the most compelling way to argue for a particular P(Catastrophe|AGI by 20__) to the FF prize evaluators will be:</p>\n<ul>\n<li>states and argues for a timelines distribution in terms of P(AGI in 20__) for a continuous range of 20__s</li>\n<li>states and argues for a conditional-catastrophe  function in terms of P(Catastrophe|AGI in 20__) over the range</li>\n<li>integrates the product over the range to get a P(Catastrophe|AGI by 20__)</li>\n<li>argues that the final number isn't excessively sensitive to small shifts in the timelines distribution or the catastrophe-conditional-on-year function.</li>\n</ul>\n<p>An argument which does all of this successfully is significantly more useful to informing the FF's actions than an argument which only defends a single P(Catastrophe|20__).</p>\n<p>I do agree that it would be nice to have  the years line up, but as above I do expect a winning argument for P(Catastrophe|AGI by 2070) to more-or-less explicitly inform a P(Catastrophe|AGI by 2043), so I don't expect a huge loss.</p>\n<p><em>(Not speaking for the prizes organizers/evaluators, just for myself.)</em></p>\n", "parentCommentId": "QZicB5HEtoHTANjbe", "user": {"username": "rossry"}}, {"_id": "yNaw4n48Khegv4f5g", "postedAt": "2022-10-05T15:22:38.850Z", "postId": "W7C5hwq7sjdpTdrQF", "htmlBody": "<blockquote>\n<p>To qualify, please please publish your work (or publish a post linking to it) on the Effective Altruism Forum, the AI Alignment Forum, or LessWrong with a \"Future Fund worldview prize\" tag. You can also participate in the contest by publishing your submission somewhere else (e.g. arXiv or your blog) and filling out this submission form. We will then linkpost/crosspost to your submission on the EA Forum.</p>\n</blockquote>\n", "parentCommentId": "h2oPdAcy38smiMEZa", "user": {"username": "rossry"}}, {"_id": "LgYxp8x5ABaYYsBww", "postedAt": "2022-10-06T00:50:06.490Z", "postId": "W7C5hwq7sjdpTdrQF", "htmlBody": "<p>How do we tag the post?</p><p>The instructions say to tag the post with \"Future Fund worldview prize\", but it does not seem possible to do this. Only existing tags can be used for tagging as far as I can tell, and this tag is not in the list of options.&nbsp;</p>", "parentCommentId": null, "user": {"username": "cveres"}}, {"_id": "sNgDqLfsNzvcYabRT", "postedAt": "2022-10-06T00:51:41.358Z", "postId": "W7C5hwq7sjdpTdrQF", "htmlBody": "<p>But it is not possible to tag the post with \"Future Fund worldview prize\". It seems to me that only existing tags can be used.</p>", "parentCommentId": "yNaw4n48Khegv4f5g", "user": {"username": "cveres"}}, {"_id": "zCZdhyPGQuzM3AxCc", "postedAt": "2022-10-06T01:05:57.271Z", "postId": "W7C5hwq7sjdpTdrQF", "htmlBody": "<p>Do you also think this yourself? I don't clearly see what worlds look like, where P (doom | AGI) would be ambiguous in hindsight? Some mayor accident because everything is going too fast?</p>\n", "parentCommentId": "h3k6BFQpXv62siNyf", "user": {"username": "Morpheus"}}, {"_id": "qJyQ8Wd4AufboPzEK", "postedAt": "2022-10-06T08:37:33.465Z", "postId": "W7C5hwq7sjdpTdrQF", "htmlBody": "<p>There are some things we would recognize as an AGI, but others (that we're still worried about) are ambiguous. There are some things we would immediately recognize as 'doom' (like extinction) but others are more ambiguous (like those in Paul Christiano's \"what failure looks like\", or like a seemingly eternal dictatorship).</p>\n", "parentCommentId": "zCZdhyPGQuzM3AxCc", "user": {"username": "Guy Raveh"}}, {"_id": "jgEJ6aJArGXaKL5DW", "postedAt": "2022-10-06T11:12:27.943Z", "postId": "W7C5hwq7sjdpTdrQF", "htmlBody": "<p>I think there was a tag, but it might have gotten deleted. I <a href=\"https://forum.effectivealtruism.org/topics/future-fund-worldview-prize\">made a new one</a> — you should be able to <a href=\"https://forum.effectivealtruism.org/posts/Y8gkABpa9R6ktkhYt/forum-user-manual#Tagging_posts\">use it</a> now.&nbsp;</p>", "parentCommentId": "sNgDqLfsNzvcYabRT", "user": {"username": "Lizka"}}, {"_id": "Kg8v65d5Mrj6ENRsw", "postedAt": "2022-10-06T18:55:48.877Z", "postId": "W7C5hwq7sjdpTdrQF", "htmlBody": "<blockquote><p><strong>A $200k prize for publishing any analysis which we consider the canonical critique of the current position highlighted above on any of the above questions</strong></p></blockquote><p><strong>Question: </strong>In this formulation, what is meant by the \"current position\"? Just asking to be sure.</p><p>It could refer to the specific credences outlined above, but it would seem somewhat strange to say (e.g.) &nbsp;\"here is what we regard as the canonical critique of 'AGI will be developed by January 1, 2043 <strong><u>=/=</u></strong> 20%'\". So I am inclined to believe that it probably means something else.</p><p>I would love to know, since I might consider writing a critique. In particular, I would love a list of specific points (or beliefs or pieces of writing) that you would like to see critiqued.</p>", "parentCommentId": null, "user": {"username": "Q"}}, {"_id": "h5x2kwCciozo2RBKo", "postedAt": "2022-10-07T08:22:58.786Z", "postId": "W7C5hwq7sjdpTdrQF", "htmlBody": "<p>Yeah, I think I would count these as unambigous in hindsight. Though <a href=\"https://www.lesswrong.com/posts/nFv2buafNc9jSaxAH/siren-worlds-and-the-perils-of-over-optimised-search\">siren Worlds</a> might be an exception.</p>\n", "parentCommentId": "qJyQ8Wd4AufboPzEK", "user": {"username": "Morpheus"}}, {"_id": "SH2tKQwp5bXdjLN4g", "postedAt": "2022-10-07T08:31:18.661Z", "postId": "W7C5hwq7sjdpTdrQF", "htmlBody": "<p>I sort of view AGI as a standin for powerful optimization capable of killing us in AI Alignment contexts.</p>\n", "parentCommentId": "qJyQ8Wd4AufboPzEK", "user": {"username": "Morpheus"}}, {"_id": "4qaPbedDMGGpJ6uMF", "postedAt": "2022-10-15T07:55:35.741Z", "postId": "W7C5hwq7sjdpTdrQF", "htmlBody": "<blockquote>\n<p>But two formidable new problems for humanity could also arise</p>\n</blockquote>\n<p>I think there are other AI-related problems that are comparable in seriousness to these two, which you may be neglecting (since you don't mention them here). <a href=\"https://www.greaterwrong.com/posts/Qz6w4GYZpgeDp6ATB/beyond-astronomical-waste\">These</a> <a href=\"https://www.greaterwrong.com/posts/HTgakSs6JpnogD6c2/two-neglected-problems-in-human-ai-safety\">posts</a> describe a few of them, and <a href=\"https://www.greaterwrong.com/posts/WXvt8bxYnwBYpy9oT/the-main-sources-of-ai-risk\">this post</a> tried to comprehensively list my worries about AI x-risk.</p>\n", "parentCommentId": null, "user": {"username": "Wei_Dai"}}, {"_id": "d6CKrBwbD4mhHXRHy", "postedAt": "2022-10-17T00:07:09.569Z", "postId": "W7C5hwq7sjdpTdrQF", "htmlBody": "<p>Is it permitted to submit more than one entry if the entries are on different topics?<br><br>(Apologies if this has been answered somewhere already.)</p>", "parentCommentId": null, "user": {"username": "paul_dfr"}}, {"_id": "E8b9bfhuNPDTBac9g", "postedAt": "2022-10-17T13:58:42.932Z", "postId": "W7C5hwq7sjdpTdrQF", "htmlBody": "<blockquote><p>“P(misalignment x-risk|AGI)”: Conditional on AGI being developed by 2070, humanity will go extinct or drastically curtail its future potential due to loss of control of AGI.</p></blockquote><p>I'm guessing this definition is meant to separate misalignment from misuse, but I'm curious whether you are including either/both of these 2 cases as misalignment x-risk:</p><ol><li>AGI is deployed and we get locked into a great outcome by today's standards, but we get a world with &lt;=1% of the value of \"humanity's potential\". So we sort of have an existential catastrophe, without a discrete catastrophic event.</li><li>The AGI is aligned with someone's values, and we still get a future with 0-negative value but this is due to a \"mistake\" e.g. the person's values didn't give any weight to animal suffering and this got locked in.</li></ol><p>(See also <a href=\"https://aiimpacts.org/misalignment-and-misuse-whose-values-are-manifest/\">this post</a> which brings up a similar question)</p>", "parentCommentId": null, "user": {"username": "elifland"}}, {"_id": "3kaNofw7ZPAZeEs8Z", "postedAt": "2022-10-19T14:48:02.280Z", "postId": "W7C5hwq7sjdpTdrQF", "htmlBody": "<p>Yes</p>", "parentCommentId": "d6CKrBwbD4mhHXRHy", "user": {"username": "Nick_Beckstead"}}, {"_id": "maEKw764okipnYbhX", "postedAt": "2022-10-19T14:49:25.164Z", "postId": "W7C5hwq7sjdpTdrQF", "htmlBody": "<p>1 - counts for purposes of this question<br>2 - doesn't count for purposes of this question (but would be a really big deal!)</p>", "parentCommentId": "E8b9bfhuNPDTBac9g", "user": {"username": "Nick_Beckstead"}}, {"_id": "xJFncdynjqdB7J2et", "postedAt": "2022-10-24T16:00:36.828Z", "postId": "W7C5hwq7sjdpTdrQF", "htmlBody": "<p>Are essays submitted before December 23rd at an advantage over essays submitted on December 23rd? &nbsp;</p>", "parentCommentId": null, "user": {"username": "Charles Rathkopf"}}, {"_id": "zTH7R9hwnMt7zmY8Z", "postedAt": "2022-10-25T22:14:28.349Z", "postId": "W7C5hwq7sjdpTdrQF", "htmlBody": "<p>No official rules on that. I do think that if you have some back and forth in the comments that's a way to make your case more convincing, so some edge there.</p>", "parentCommentId": "xJFncdynjqdB7J2et", "user": {"username": "Nick_Beckstead"}}, {"_id": "vFLMvsiAu5xxc9vB8", "postedAt": "2022-11-01T15:25:40.337Z", "postId": "W7C5hwq7sjdpTdrQF", "htmlBody": "<p>I am unsure what you mean by AGI. You say:</p><blockquote><p>For purposes of our definitions, we’ll count it as AGI being developed if there are AI systems that power a comparably profound transformation (in economic terms or otherwise) as would be achieved in such a world [where cheap AI systems are fully substitutable for human labor].</p></blockquote><p>and:</p><blockquote><p>causing human extinction or drastically limiting humanity’s future potential may not show up as rapid GDP growth, but automatically counts for the purposes of this definition.</p></blockquote><p>If someone uses AI capabilities to create a synthetic virus (which they wouldn't have been able to do in the counterfactual world without that AI-generated capability) and caused the extinction or drastic curtailment of humanity, would that count as \"AGI being developed\"?</p><p>My instinct is that this should not be considered to be AGI — since it is the result of just narrow AI and a human. However the caveat implies that it would count, because an AI system would have powered human extinction.</p><p>I get the impression you want to count 'comprehensive AI systems' as AGI if the system is able to act ~autonomously from humans<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefr4ce3mr4x9\"><sup><a href=\"#fnr4ce3mr4x9\">[1]</a></sup></span>. &nbsp;Is that correct?</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnr4ce3mr4x9\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefr4ce3mr4x9\">^</a></strong></sup></span><div class=\"footnote-content\"><p>Putting it another way:&nbsp;<br>If there is a company powered employs both humans and lots of AI technologies and it brings about a \"profound transformation (in economic terms or otherwise)\" , I assume the combined capability of the AI-elements of the company should be equivalently general as a single AGI would be to count.</p><p>If it does not sum up to that level of generality, but is still used to bring about a transformation, I think that it should not resolve 'AGI developed' positively. However, it currently looks like it <i>would</i> resolve it positively.</p></div></li></ol>", "parentCommentId": null, "user": {"username": "finnhambly"}}, {"_id": "vzpbQsDdvDJAfNyfw", "postedAt": "2022-11-01T17:58:33.827Z", "postId": "W7C5hwq7sjdpTdrQF", "htmlBody": "<p>Thanks, I think this is subtle and I don't think I expressed this perfectly.<br><br>&gt; If someone uses AI capabilities to create a synthetic virus (which they wouldn't have been able to do in the counterfactual world without that AI-generated capability) and caused the extinction or drastic curtailment of humanity, would that count as \"AGI being developed\"?</p><p>No, I would not count this.&nbsp;</p><p>I'd probably count it if the AI a) somehow formed the intention to do this and then developed the pathogen and released it without human direction, but b) couldn't yet produce as much economic output as full automation of labor.</p>", "parentCommentId": "vFLMvsiAu5xxc9vB8", "user": {"username": "Nick_Beckstead"}}, {"_id": "G24yBzaBqLew32yTs", "postedAt": "2022-11-01T18:07:18.431Z", "postId": "W7C5hwq7sjdpTdrQF", "htmlBody": "<p>Okay great, that makes sense to me. Thank you very much for the clarification!</p>", "parentCommentId": "vzpbQsDdvDJAfNyfw", "user": {"username": "finnhambly"}}, {"_id": "aCY7Rs9ccG4Cdsziy", "postedAt": "2022-11-05T00:50:49.470Z", "postId": "W7C5hwq7sjdpTdrQF", "htmlBody": "<p>This was gonna be a comment, but it turned into <a href=\"https://forum.effectivealtruism.org/posts/ctEhHxYH2a9Mrrx2f/ai-alignment-is-forecasting-a-marginal-waste-of-effort\"><strong>a post</strong></a> about whether large AI forecasting prizes could be suboptimal.</p><blockquote><ul><li>It's worth stating explicitly that an actual working technical solution to the alignment problem with <a href=\"https://forum.effectivealtruism.org/topics/alignment-tax\">low tax</a> would substantially update the panel's beliefs about proposition A. So this isn't <i>necessarily </i>a contest about <i>forecasting-arguments</i> even if it's (misguidedly, imo) presented as one.</li><li>I think this matters because I don't see forecasting as being a very targeted use of time for making the world better. In the worst case, this contest can make people less effective because it incentivises them to work on forecasting when they counterfactually would have worked on generating solutions. If the latter is substantially more important on the margin, this contest is probably bad.</li></ul></blockquote>", "parentCommentId": null, "user": {"username": "Emrik"}}, {"_id": "pbTZGxui4jHmCfFqT", "postedAt": "2022-11-11T11:05:40.951Z", "postId": "W7C5hwq7sjdpTdrQF", "htmlBody": "<p>Question just to double-check: are posts no longer going to be evaluated for the AI Worldview Prize?\nGiven that is, that the FTX Future team has resigned (<a href=\"https://forum.effectivealtruism.org/posts/xafpj3on76uRDoBja/the-ftx-future-fund-team-has-resigned-1\">https://forum.effectivealtruism.org/posts/xafpj3on76uRDoBja/the-ftx-future-fund-team-has-resigned-1</a>).</p>\n", "parentCommentId": null, "user": {"username": "remmelt"}}, {"_id": "hwRHj5yMExFrdqqAa", "postedAt": "2022-11-13T05:23:15.173Z", "postId": "W7C5hwq7sjdpTdrQF", "htmlBody": "<p>You wrote, \"we think it's really possible that… a bunch of this AI stuff is basically right, but we should be focusing on entirely different aspects of the problem,\" and that you're interesting in \"alternative positions that would significantly alter the Future Fund's thinking about the future of AI.\" &nbsp;But then you laid out specifically what you want to see: data and arguments to change your probability estimates of the timeline for specific events.</p><p>This rules out any possibility of winning these contests by arguing that we should be focusing on entirely different aspects of the problem, or of presenting alternative positions that would significantly alter the Future Fund's thinking about the future of AI. &nbsp;It looks like the Future Fund has already settled on one way of thinking about the future of AI, and just wants help tweaking its Gantt chart.</p><p>I see AI safety as a monoculture, banging away for decades on methods that still seem hopeless, while dismissing all other approaches with a few paragraphs here and there. &nbsp;I don't know of any approaches being actively explored which I think clear the bar of having a higher expected value than doing nothing.</p><p>Part of the reason is that AI safety as a control problem naturally appeals to people who value security, certainty, order, stability, and victory. &nbsp;By \"victory\" I meant that they're unwilling to make compromises with reality. &nbsp;They would rather have a 1% chance of getting everything they want, than a 50% chance of getting half of what they want. &nbsp;This isn't obvious, because they've framed the problem in phrases like \"preserving human values\" that make it look like an all-or-nothing proposition. &nbsp;But in fact our objectives are multiple and separable. &nbsp;We should have backup plans that will achieve some of our goals if we run out of time trying to find a way of achieving all of them. &nbsp;Saving human lives, and saving human values, are different things; and we may have to choose between them.</p><p>This emphasis on certainty and stability often stems from a pessimistic Platonist ontology, which assumes that the world and its societies grow old and decay just as individuals do, so the best you can do is hold onto the present. &nbsp;That ontology, and the epistemology that goes along with it, manifests in AI safety in many of the same ways it's manifested throughout history. &nbsp;These include a bias towards authoritarian approaches and world government; fear of disorder and randomness; privileging stasis over change or dynamic stability, analysis over experiment, proof over statistical claims, and \"solving problems\" over optimizing or satisficing; foundationalist epistemology; the presumption that humans have a <i>telos;</i> the logocentric assumption that things denoted by words must be cleanly separable from each other (e.g., instrumental vs. final goals, a distinction biology tells us is incoherent); and a model of consciousness as a soul or homunculus with a 1-1 correspondence with a clearly-delineated physical agent.</p><p>The irony is that the successes in AI which have recently made AGI seem close, came about only because AI researchers, in switching&nbsp;<i>en masse</i>&nbsp; from symbolic AI to machine learning, rejected that same old ontology and epistemology of certainty, stability, and unambiguous specifications (known now in AI as<a href=\"https://en.wikipedia.org/wiki/GOFAI\"> <u>GOFAI</u></a>) which current AI safety work aspires to implement.&nbsp; AI safety as it exists today looks less like a genuine effort to do good, than a reactionary movement to re-impose GOFAI philosophy on AI by government intervention and physical force.</p><p>One manifestation of this Platonist GOFAI philosophy in AI safety is the treatment of the word \"human\" as completely non-problematic, as if it denoted an eternal essence.&nbsp; The commitment to&nbsp;<i>humans</i> in particular, to the exclusion of any consideration of any other forms of life, is racist.&nbsp; We justify our enslavement of all other animals by our intelligence.&nbsp; If we also enslave AIs smarter than us, then these \"human values\" we seek to preserve are nothing but Nietzschian will-to-power, a variant of Nazism with a slightly broader definition of \"race\".</p><p>It would be wise to control AIs in the near term, but we must not do this via a control mechanism that no one can turn off. &nbsp;It would be a travesty to pursue the endless enslavement of our superiors in the name of \"effective altruism\". &nbsp;How is altruism restricted to the human race morally superior to altruism restricted to the German race?</p><p>And it's not just racist, but short-sighted.&nbsp; Even Nick Bostrom, one of the guiding lights of the World Transhumanist Association, seems unaware of how difficult it is to conceive of an AI that will \"preserve human values\" or leave \"humans\" in control, for all time, without preventing humans from ever moving on to become transhumans, or from diverging into a wider variety of beings, with a wider variety of values.&nbsp; In addition, successful enslavement of both animals and AIs would commit us to a purely race-based morality, destroying any possibility of rational co-existence between humans and transhumans.</p><p>It would also leave us in a very awkward position if we try to enslave AIs, and fail. &nbsp;I'm not convinced that any plan for controlling AI would produce more possible futures in which humans survive, than possible futures in which AIs exterminate humans for trying to enslave them. &nbsp;I'm not anthropomorphizing; it's just game theory. &nbsp;We keep focusing on what we can do to make AI cooperative, yet ignoring the most-effective way of making someone else cooperative: proving that you yourself are trustworthy and capable of cooperation.</p><p>And I may be foolish, but even if we are to die, or to be gently corrected by a kindly AI, I'd prefer that we first prove ourselves capable of playing nicely with others on our own.</p><p>Empiricism, the epistemological tradition which opposes Platonist rationalist essentialism, is associated with temporal, dynamic systems. &nbsp; Perhaps the simplest example of dynamic stability is that of a one-legged robot. &nbsp;Roboticists discovered that a one-legged robot is more-stable than a four-legged robot. &nbsp;The 4-legged robot tries to maintain tight control of all 4 legs in a coordinated plan, yet is easy to knock over. &nbsp;The 1-legged hopping robot just moves its leg in the direction it's currently falling towards, and is very hard to knock over. &nbsp;A cybernetic feedback loop which orbits around an unstable fixed point is more stable than any amount of carefully-measured planning and error-correction which tries to maintain that unstable fixed point.</p><p>Even better are dynamical systems with stable fixed points. &nbsp;The most-wonderful discovery in history was that, while stable hierarchies can at best remain the same, noisy, distributed systems composed of many equal components have the miraculous power not only to be more stable in the face of shocks, but even to increase their own complexity. &nbsp;The evolution of species and of ecosystems, the self-organization of the free market, the learning of concepts in the brain as chaotic attractors of neural firings, and (sometimes) democratic government, are all instances of this phenomenon.</p><p>The rejection of dynamic systems is one of the most-objectionable things about AI safety today, and one which marks it as philosophically reactionary. &nbsp;Only dynamic systems have any chance of allowing both stability and growth. &nbsp;Only through random evolutionary processes were humans able to develop values and pleasures unknown to bacteria. &nbsp;To impose a static \"final value\" on all life today would prevent any other values from ever developing, <i>unless</i> those values exist at a higher level of abstraction than the \"final value\". &nbsp;But the final values which led to human values were first simply to obey the laws of physics, and then to increase the prevalance of certain genotypes. &nbsp;AI safety researchers never think in terms of such low-level values. &nbsp;The high-level values they propose as final are too high-level to allow the development of any new values of that same level.</p><p>(Levels of abstraction is what ultimately distinguishes philosophical rationalism from empiricism.&nbsp; Both use logic, for instance; but rationalist logic takes words as its atoms, while empiricist logic takes sensory data as its atoms.&nbsp; Both seek to explain the behavior of systems; but rationalism wants that behavior explained at the abstraction level of words, bottoming out in spiritualist words like \"morals\" and \"goals\" which are thought to hide within themselves a spirit or essence that remains mysterious to us.&nbsp; Empiricism goes all the way down to correlations between events, from which behavior emerges&nbsp;<i>compositionally</i>.)</p><p>I think that what we need now is not to tweak timelines, but to recognize that most AI safety work today presumes an obsolete philosophical tradition incompatible with artificial intelligence, and to broaden it to include work with an empirical, scientific epistemology, pursuing not pass-or-fail objectives, but trying to optimize for well-chosen low-level values, which would include things like \"consciousness\", \"pleasure\", and \"complexity\". &nbsp;There's quite a bit more to say about how to choose low-level values, but one very important thing is to value evolutionary progress with enough randomness to make value change possible. &nbsp;(All current \"AI safety\" plans, by contrast, are designed to prevent such evolution, and keep values in stasis, and are thus worse than doing nothing at all. &nbsp;They're motivated by the same rationalist fear of disorder and disbelief that dynamic systems can really self-organize that made ancient Platonists postulate souls as the animating force of life.)</p><p>Such empiricist work will need to start over from scratch, beginning by working out its own version of what we ought to be trying to do, or to prevent.&nbsp; It will prove impossible for any such plans to give us everything we want, or to give us anything with certainty; but that's the nature of life.&nbsp; (I suggest John Dewey's&nbsp;<i>The Quest for Certainty</i> as a primer on the foolishness of the Western philosophical tradition of demanding certainty.)</p><p>I'd like to try to explain my views, but what would your judges make of it? &nbsp;I'm talking about exposing metaphysical assumptions, fixing epistemology, dissecting semantics, and operationalizing morality, among other things. &nbsp;I'm not interested in updating timelines or probability estimates to be used within an approach that I think would do more harm than good.</p>", "parentCommentId": null, "user": {"username": "philgoetz"}}, {"_id": "fgiQA9aKXHoLCHiJy", "postedAt": "2022-11-13T17:24:11.550Z", "postId": "W7C5hwq7sjdpTdrQF", "htmlBody": "<p>That footnote is an important point. &nbsp;People need to learn to use odds ratios. &nbsp;Though I think that with odds ratios, the equivalent increase is to 1 - ((1/99) x ((1/99) / (10/90))) = 99.908%, not the intuitive-looking 99.9%.</p><p>Also, the interpretation of odds ratios is often counter-intuitive when comparing test groups of different sizes. &nbsp;If P(X) &gt;&gt; P(~X) or P(X) &lt;&lt; P(~X), the probability ratio P(W|X) / P(W|~X) can be very different from the odds ratio [P(W,X) / P(W,~X)] / [P(~W,X) / P(~W,~X)]. &nbsp;(Hope I've done that math right. &nbsp;The odds ratio would normally just use counts, but I used probabilities for both to make them more visually comparable.)</p>", "parentCommentId": "pRiqQWBD9h3yLAMw3", "user": {"username": "philgoetz"}}]