[{"_id": "WHmFGgXQDAx2wehyN", "postedAt": "2014-08-16T03:27:00.000Z", "postId": "W7Ms6fvE2ZzoqcEPH", "htmlBody": "<p>&quot;The standard response to the views of Singer and Unger, in the \nphilosophical literature, is that giving such extortionate sums is just too demanding for it to be plausible as a moral requirement.&quot;</p><p>Those &quot;philosophers&quot; wouldn't find it too demanding if they were the ones who were had to endure the suffering of the Third World. It's so wrong that people only put themselves in the shoes of the haves, rather than the have-nots when formulating their &quot;morals&quot;. Although, I think that framing cannot be underestimated here. Framing serious philanthropy as a moral necessity has a negative effect because no one wants to be told what to do -- all that will happen is people will pull away and actually strengthen their selfish justifications. Framing serious philanthropy as an ideal, however, should have a positive effect, as people love nothing more than to strive for ideals THAT THEY FEEL THEY HAVE CHOSEN! Even the word &quot;ethics&quot; implies requirements that make you a &quot;bad person&quot; if unmet. I think that replacing the word &quot;ethics&quot; with &quot;values&quot; would have the effect I'm talking about -- making hardcore philanthropy appear as aspirational and self-esteem-building rather than an attempt at convincing yourself you're &quot;not a bad person.&quot;</p>", "parentCommentId": null, "user": {"username": "Austen_Forrester"}}, {"_id": "k2d3jPf7ewCnEyZXL", "postedAt": "2014-08-16T03:36:00.000Z", "postId": "W7Ms6fvE2ZzoqcEPH", "htmlBody": "<p>Hi Austen. You write:</p><p><blockquote>Those &quot;philosophers&quot; wouldn't find it too demanding if they were the ones who were had to endure the suffering of the Third World. It's so wrong that people only put themselves in the shoes of the haves, rather than the have-nots when formulating their &quot;morals&quot;.</blockquote></p><p>\nYes, Singer makes this same point in a reply to criticism from Colin McGinn (from Dale Jamieson (ed.), Singer and His Critics, Oxford: Blackwell, 1999, p. 304):</p><p><blockquote>I disagree […] with the conclusion McGinn draws from his\nimaginary world in which a Charity Channel, plugged into our brain and\ntherefore compulsory viewing, floods us with information about people in urgent\nneed of our aid, which we have the means to provide effectively. McGinn says\nthat he finds this a dystopian prospect. No doubt he is thinking of himself as\na potential donor rather than as a person in urgent need of aid. From that\nperspective, the thought of being bombarded with images of people suffering is\nindeed dystopian. But if I imagine myself as a victim of a natural disaster,\nand think of my life and the lives of my family as being saved by the existence\nof the Charity Channel, I have a very different view.</blockquote></p>", "parentCommentId": "WHmFGgXQDAx2wehyN", "user": {"username": "Pablo_Stafforini2"}}, {"_id": "Y4poRKrqNnCkYHd8A", "postedAt": "2022-04-24T13:44:36.782Z", "postId": "W7Ms6fvE2ZzoqcEPH", "htmlBody": "<p>Strong upvoting in 2022, I think it's a useful reminder for the current discussions about free spending and not being funding constrained.</p>", "parentCommentId": null, "user": {"username": "Lorenzo Buonanno"}}]