[{"_id": "pBZ5YAaBnryxbfjku", "postedAt": "2023-06-06T09:55:21.094Z", "postId": "W93Pt7xch7eyrkZ7f", "htmlBody": "<p>Is there a risk that cycles of discovering new antibiotics and resistance emerging to these new antibiotics, eventually leads to us “running out” of therapeutic targets, causing AMR to pose an x-risk?</p>\n", "parentCommentId": null, "user": {"username": "freedomandutility"}}, {"_id": "mC88xfCFq36MCH2Nf", "postedAt": "2023-06-06T09:58:29.405Z", "postId": "W93Pt7xch7eyrkZ7f", "htmlBody": "<p>Also, have you explored R&amp;D around adjuvants targeting mechanisms associated with resistance, eg - plasmid inhibitors (<a href=\"https://www.frontiersin.org/articles/10.3389/fmicb.2017.02329/full\">https://www.frontiersin.org/articles/10.3389/fmicb.2017.02329/full</a>)</p>\n", "parentCommentId": null, "user": {"username": "freedomandutility"}}, {"_id": "GCsfaDvNmNThSM7M5", "postedAt": "2023-06-06T10:20:46.178Z", "postId": "W93Pt7xch7eyrkZ7f", "htmlBody": "<p>This is a terrific distillation Akhil- very readable and it's updated me strongly on the scale and neglectedness of the problem. Is there any source you're aware of that explains the relative import of human, animal, and environmental overuse? I'd be interested to know the rough orders of magnitude of how much resistance they each contribute.</p>", "parentCommentId": null, "user": {"username": "Joe Pusey"}}, {"_id": "o3goKMHD8pHoCpjgs", "postedAt": "2023-06-06T11:16:59.046Z", "postId": "W93Pt7xch7eyrkZ7f", "htmlBody": "<p>Any thoughts on the effectiveness of reducing antimicrobial use in factory farming? Say, GFI gave this some attention recently (<a href=\"https://gfi.org/blog/cultivating-a-future-where-antibiotics-still-work/\">GFI blog post</a>, and a corresponding <a href=\"https://gfi.org/blog/cultivating-a-future-where-antibiotics-still-work/\">commentary piece on Nature Foods</a>), and made the argument that similar problems can (and should) be solved in the cultivated meat industry</p><p>.&nbsp;</p>", "parentCommentId": null, "user": {"username": "edoarad"}}, {"_id": "EkPkGxJaph3GF8cgJ", "postedAt": "2023-06-06T18:19:47.681Z", "postId": "W93Pt7xch7eyrkZ7f", "htmlBody": "<p>Thanks for sharing this! I might try to write a longer comment later, but for now just a quick note that I'm curating this post. I should note that I haven't followed any of the links yet.</p>", "parentCommentId": null, "user": {"username": "Lizka"}}, {"_id": "cyFoahMLbKrEN6qD5", "postedAt": "2023-06-07T11:25:36.747Z", "postId": "W93Pt7xch7eyrkZ7f", "htmlBody": "<p>What would a clear criterion of us running out of effective microbials look like?&nbsp;<br><br>I want to write a prediction market here. What would be an unambiguous world state where it has happened?</p><p>Eg</p><ul><li>The WHO releases some kind of statement</li><li>The US stops using XYZ drugs and no equivalent is found</li><li>Deaths from microbial resistance go above L</li></ul>", "parentCommentId": null, "user": {"username": "nathan"}}, {"_id": "ncBG3aNdszwdQFFd9", "postedAt": "2023-06-07T12:36:10.738Z", "postId": "W93Pt7xch7eyrkZ7f", "htmlBody": "<p>Discovering new antibiotics takes a long time and requires huge investment. That is why the interest in<a href=\"https://www.vibiosphen.com/success-story-phage-therapy\"> phage therapy is growing.</a>&nbsp;</p>", "parentCommentId": "pBZ5YAaBnryxbfjku", "user": {"username": "emmannaemeka"}}, {"_id": "bi9aAnEhJtCGPcLrA", "postedAt": "2023-06-08T07:22:30.481Z", "postId": "W93Pt7xch7eyrkZ7f", "htmlBody": "<p>Great post! Do you have any (even rough) cost effectiveness estimates to share?</p>\n", "parentCommentId": null, "user": {"username": "jooke"}}, {"_id": "P7y8nbpwZo5M7oZt2", "postedAt": "2023-06-08T10:37:27.652Z", "postId": "W93Pt7xch7eyrkZ7f", "htmlBody": "<p>For the scale of the problem, counting only deaths leads to an underestimate, as bacterial infections also cause long-term disability. E.g. post-sepsis syndrome, Long Lyme</p>\n", "parentCommentId": null, "user": {"username": "SiebeRozendal"}}, {"_id": "8MjFeiSCAK4n6xYns", "postedAt": "2023-06-10T10:30:56.885Z", "postId": "W93Pt7xch7eyrkZ7f", "htmlBody": "<p>Thank you for this post! Very excited to have this report on hand! I plan to go through it in more depth and leave some more nuanced feedback. I want to add a note that I would also be interested in seeing the rough cost-effectiveness estimates as <a href=\"https://forum.effectivealtruism.org/users/joshuablake?mention=user\">@JoshuaBlake</a> &nbsp;has mentioned.&nbsp;</p>", "parentCommentId": null, "user": {"username": "sonya.lebedeva@berkeley.edu"}}, {"_id": "Dud6Fbcd5FwPwHMv6", "postedAt": "2023-06-10T10:34:10.726Z", "postId": "W93Pt7xch7eyrkZ7f", "htmlBody": "<p>Could you link the prediction markets for this if you create them? Thanks in advance!</p>", "parentCommentId": "cyFoahMLbKrEN6qD5", "user": {"username": "sonya.lebedeva@berkeley.edu"}}, {"_id": "G7LeXoCFwocF95L6b", "postedAt": "2023-06-10T11:43:46.333Z", "postId": "W93Pt7xch7eyrkZ7f", "htmlBody": "<p>I'd be interested by an answer too !<br><br>The GFI link says :&nbsp;</p><blockquote><p>With 70% of medically-important antibiotics used for animal agriculture, conventional meat is <a href=\"http://dx.doi.org/10.3390/antibiotics9120918\">a major contributor</a> to the risk of antimicrobial resistance.</p></blockquote><p>This sounds really like a major element, which sounds like it could prove to be more promising than interventions on humans.</p>", "parentCommentId": "o3goKMHD8pHoCpjgs", "user": {"username": "Corentin Fressoz"}}, {"_id": "G8foPaFbCaggQSaeW", "postedAt": "2023-06-10T12:58:38.189Z", "postId": "W93Pt7xch7eyrkZ7f", "htmlBody": "<p>This is well done for a high-level report. Skimming through the report it looks like misuse and overuse of antibiotics by humans and animals is the main cause of AMR as we understand it right now. In addition, some of the less well-developed areas of understanding relate to these.<br><br>The two recommendations directly related to these from your post are innovating on policy and developing diagnostic tests. I'm wondering, as others are, if directly tackling AMR use in factory farming might be as important or more important than these.</p>", "parentCommentId": null, "user": {"username": "Sporkredfox"}}, {"_id": "upjjuA3Mso5T8NRnu", "postedAt": "2023-06-10T21:41:37.660Z", "postId": "W93Pt7xch7eyrkZ7f", "htmlBody": "<p>Depending on the threshold, I see that this could qualify as a global catastrophic risk, but how could it constitute an existential risk?</p>", "parentCommentId": "pBZ5YAaBnryxbfjku", "user": {"username": "Denkenberger"}}, {"_id": "zh9ZSvvFYAF9wfeMA", "postedAt": "2023-06-11T09:53:39.861Z", "postId": "W93Pt7xch7eyrkZ7f", "htmlBody": "<p>From my understanding, bacteria are very unlikely to cause a pandemic, mainly because we have many effective broad-spectrum antibiotics. If we no longer have these, we’re susceptible to bioengineered pandemics from bacteria.</p>\n", "parentCommentId": "upjjuA3Mso5T8NRnu", "user": {"username": "freedomandutility"}}, {"_id": "4ZCSvPtepczYktQbL", "postedAt": "2023-06-11T09:58:05.265Z", "postId": "W93Pt7xch7eyrkZ7f", "htmlBody": "<p>Another promising policy intervention which probably requires more research first would be delayed antibiotic prescriptions - <a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7694150/\">https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7694150/</a></p>\n<p>Would be extremely scalable and simple to implement.</p>\n", "parentCommentId": null, "user": {"username": "freedomandutility"}}, {"_id": "MXFoG99RqMZQkpdB4", "postedAt": "2023-06-12T00:42:51.298Z", "postId": "W93Pt7xch7eyrkZ7f", "htmlBody": "<p>Hey I have a couple of cost-effectiveness analyses that I can point you to:</p><ul><li>The Center for Global Development has released a report on the ROI of the PASTEUR Act, a proposed pull incentive for new antimicrobials. Their calculations are well done: <a href=\"https://www.cgdev.org/blog/world-needs-new-antibiotics-proposed-us-program-develop-them-would-pay-281\">https://www.cgdev.org/blog/world-needs-new-antibiotics-proposed-us-program-develop-them-would-pay-281</a></li><li>I wrote a report for CE on an AMR idea; the cost-effectiveness analyses of which will be released soon and I will post here when they are!</li></ul>", "parentCommentId": "bi9aAnEhJtCGPcLrA", "user": {"username": "Akhil Bansal"}}, {"_id": "9MAwLsbiugzozm2Kj", "postedAt": "2023-06-12T00:47:48.028Z", "postId": "W93Pt7xch7eyrkZ7f", "htmlBody": "<p>Great question. It is true that a lot of antibiotics that are used globally are used in factory farming. What is less clear, however, is how much this contributes to AMR (i.e. just because 70% of antibiotics are used for animals does not mean that 70% of AMR or AMR-attributable mortality is a result of use in animal agriculture). Because the science is unclear on exactly how much factory farming contributes (although it undoubtedly plays some role), this is a tricky question to answer</p><p>However, regardless, in expectation and even with conservative estimates of the above, advocacy to limit the use of antibiotics as a growth stimulation or prophylactically in factory farming is a promising thing to do.</p><p>There have been successful corporate campaigns and certification standards in this space (e.g. <a href=\"https://agfundernews.com/investor-network-fairr-calls-on-fast-food-restaurants-to-do-more-about-amr-in-their-supply-chains\">here</a> and <a href=\"https://www.ft.com/content/b8f67acb-e38e-46e4-9dba-9022caa00763\">here</a> amongst many other examples). From my conversations with folk in the space, there would be a role and scope for new actors in this area.</p>", "parentCommentId": "o3goKMHD8pHoCpjgs", "user": {"username": "Akhil Bansal"}}, {"_id": "KCarAA5zM5p7zmwYg", "postedAt": "2023-06-12T00:50:48.997Z", "postId": "W93Pt7xch7eyrkZ7f", "htmlBody": "<p>Really excellent question, and unfortunately we don't have a good answer here. We know all the factors that contribute to AMR, but we haven't as yet been able to quantify their relative contribution. This really constrains impact and investment within the space as it makes impact evaluation difficult, and makes it difficult for governments and other funders to justify the value of AMR interventions and policies that they may be considering. As I mention in the report, this is probably amongst the highest, if not highest, area of need within the space. Part of the difficulty with developing good quantified models of the drivers of AMR is a balance between making sure it is scientifically rigorous enough (which would likely require longitudinal metagenomic data), but also getting answers relatively quickly (and inexpensively).</p><p>Any projects or groups working on this idea should be in touch!</p>", "parentCommentId": "GCsfaDvNmNThSM7M5", "user": {"username": "Akhil Bansal"}}, {"_id": "Jt2HcsRXfHgTAzQjx", "postedAt": "2023-06-12T00:51:35.085Z", "postId": "W93Pt7xch7eyrkZ7f", "htmlBody": "<p>I am planning to write a shorter, more speculative examination of AMR as a GCBR/X-risk in the coming weeks :) I will try and address this there, thanks for the great question</p>", "parentCommentId": "pBZ5YAaBnryxbfjku", "user": {"username": "Akhil Bansal"}}, {"_id": "wvFb9DFuREpqCQCrB", "postedAt": "2023-06-13T18:52:41.319Z", "postId": "W93Pt7xch7eyrkZ7f", "htmlBody": "<p>Thanks for the great analysis - one clear disagreement</p><p><i><strong>\"Although there has been some global response to AMR\"</strong></i> seems like a huge underplaying of the global response over the last 20 years. Hundreds of millions (if not billions) of dollars have been poured into research into both identifying resistance patterns and new antibiotics. Powerful AI is <a href=\"https://www.theguardian.com/technology/2023/may/25/artificial-intelligence-antibiotic-deadly-superbug-hospital#:~:text=Thursday's%20study%20revealed%20that%20researchers,compound%20which%20they%20named%20abaucin.\">already successfully inventing new medications</a> Many countries (like England, Australia, New Zealand) have successfully embarked on campaigns to reduce unnecessary prescription which have massively decreased use. Donor funded public health campaigns have (largely unsuccessfully) tried to reduce prescription in places like my home here in Uganda.</p><p>Every doctor I know considers AMR almost every day in their daily practise.</p><p>AMR is extremely important, but I think its a big call to consider the issue neglected. That's not saying though that their aren't sub-areas within AMR research or action which are somewhat neglected that we might be able to cost-effectively intervene in.</p>", "parentCommentId": null, "user": {"username": "NickLaing"}}, {"_id": "BxRoyfqZu7ZREFrvu", "postedAt": "2023-06-14T08:11:37.579Z", "postId": "W93Pt7xch7eyrkZ7f", "htmlBody": "<p>I worked on the topic of AMR and animal agriculture for a few years at an ESG org, and my impression is that animal agriculture plays a fairly small role in human AMR, maybe 1-10%. The evidence is pretty unclear, but when I pinned down experts their best guess was that it was a low factor, both based on the understanding of how AMR spreads from animals to humans, and also empirically (variance in human AMR based on variance in how many antibotics are given to farmed animals in that area).&nbsp;</p><p>My sense is tha a lot of animal advocacy organisations play up the role of factory farming in causing AMR to try and get other stakeholders to care. The argument goes that animals can be in much worse conditions if they are given antibiotics routinely, and so if we ban antibiotics the animals need more space and other better conditions. Unfortunately, I think this is both disingenuous (although I think many of the people promoting the topic don't realise this), and I've heard from some animal advocates that when the routine use of antibiotics are banned in one region, conditions didn't get better, mortality rates just went up. &nbsp;</p><p>I would appreciate if anyone with expertise on this topic would weigh in as I expect some of this to be wrong.&nbsp;</p>", "parentCommentId": "o3goKMHD8pHoCpjgs", "user": {"username": "ElliotT"}}, {"_id": "tP3hLechpYu9C9FdJ", "postedAt": "2023-06-15T17:13:55.202Z", "postId": "W93Pt7xch7eyrkZ7f", "htmlBody": "<p>The existing and current efforts are substantial, no doubt, but in a relative sense, AMR is neglected. Relative to the global burden of disease and expenditure on R&amp;D, or relative to the projected costs of mitigation.</p>", "parentCommentId": "wvFb9DFuREpqCQCrB", "user": {"username": "Ming Ong"}}, {"_id": "2AJdsR22zoHqGKkJv", "postedAt": "2023-06-19T14:56:24.159Z", "postId": "W93Pt7xch7eyrkZ7f", "htmlBody": "<p>This I think fits into your bucked \"translating evidence into policy\" - but the Behavioral Insights Team (full disclosure - where I work) did some work several years ago <a href=\"https://www.thelancet.com/journals/lancet/article/PIIS0140-6736(16)00215-4/fulltext\">published in the Lancet</a>, where sending a single letter to doctors that reduced antibiotic prescribing &nbsp;by 3.3% among the highest prescribing 20% of doctors. This translated into around 75,000 fewer doses nationwide in the study period. While we've replicated this in a few places successfully, I don't think this idea is in use globally and would be quite cost effective in the near-term.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Carolina F Toth"}}, {"_id": "YoGWaSDkCtsBegrt2", "postedAt": "2023-06-22T23:06:59.786Z", "postId": "W93Pt7xch7eyrkZ7f", "htmlBody": "<p>This might be already on your radar but WHO just released its AMR research agenda. This might update the neglectedness of this issue.</p>\n<p><a href=\"https://cdn.who.int/media/docs/default-source/antimicrobial-resistance/amr-spc-npm/who-global-research-agenda-for-amr-in-human-health---policy-brief.pdf\">https://cdn.who.int/media/docs/default-source/antimicrobial-resistance/amr-spc-npm/who-global-research-agenda-for-amr-in-human-health---policy-brief.pdf</a></p>\n", "parentCommentId": null, "user": {"username": "Msaksena"}}, {"_id": "BtznW8GYCBa4NFarL", "postedAt": "2023-06-23T14:12:11.143Z", "postId": "W93Pt7xch7eyrkZ7f", "htmlBody": "<p>Great spotlight Akhil! Do you think improving existing AMR diagnostics would also have synergies with improving the early detection of pandemic pathogens?</p>", "parentCommentId": null, "user": {"username": "JamesChe"}}, {"_id": "beHPX4ZKeWheEu5FH", "postedAt": "2023-06-28T15:07:42.671Z", "postId": "W93Pt7xch7eyrkZ7f", "htmlBody": "<p>Pan-Canadian action plan on antimicrobial resistance<br><br><a href=\"https://www.canada.ca/en/public-health/services/publications/drugs-health-products/pan-canadian-action-plan-antimicrobial-resistance.html\">https://www.canada.ca/en/public-health/services/publications/drugs-health-products/pan-canadian-action-plan-antimicrobial-resistance.html</a></p>", "parentCommentId": "YoGWaSDkCtsBegrt2", "user": {"username": "Msaksena"}}, {"_id": "2fymXwxHBvQ4boLEF", "postedAt": "2023-07-06T16:27:39.972Z", "postId": "W93Pt7xch7eyrkZ7f", "htmlBody": "<p>Antimicrobials are already <i>less </i>useful than they were a few years back and they will become less useful as time goes by, but it's very unlikely that we'd ever actually go back to the pre-antibiotic era.</p><p>I work on antimicrobial resistance as part of my day job and the reality is bad enough without having to overly-catastrophize. If ~10 million people die every year of antibiotic resistant infections, this is both (1) awful and (2) much better than the pre-antibiotic era.</p><p>\"<i>Deaths from antimicrobial resistance go above L</i>\" is a good one, although it is not trivial to measure (deaths are often multi-causal).</p><p><br>A related open question is to what extent a global moratorium on the use of a specific class of antibiotics could reset resistance. If there is a cost to the bug of being resistant, once the selection pressure of antibiotics is gone, it should revert to being sensitive. Some researchers say that now that the cat is out of the bag, it is too late, the reset would take too long (if it happened at all); others disagree and expect that within a few years, resistance would have gone down sufficiently to be meaningful. I have an opinion, but nobody actually has data on this.</p>", "parentCommentId": "cyFoahMLbKrEN6qD5", "user": {"username": "Luis Pedro Coelho"}}, {"_id": "CejBZhuDpFh5dtBja", "postedAt": "2023-07-07T10:11:01.980Z", "postId": "W93Pt7xch7eyrkZ7f", "htmlBody": "<p>The EU has banned antibiotics for growth-promotion and the effects on human health were too small to measure. Some of it may be compliance-issues (<i>e.g.</i>, farmers claiming their herds are sick as a justification to give antibiotics), but it is unlikely to explain all of the effect.</p>", "parentCommentId": "o3goKMHD8pHoCpjgs", "user": {"username": "Luis Pedro Coelho"}}, {"_id": "hq5DeYknc5zMNTDWY", "postedAt": "2023-07-09T13:15:41.226Z", "postId": "W93Pt7xch7eyrkZ7f", "htmlBody": "<p>So \"10 million people die in 2025 due to antibiotic resistant infectnions, worldwide\" is that a good crux?</p>", "parentCommentId": "2fymXwxHBvQ4boLEF", "user": {"username": "nathan"}}, {"_id": "QgcALJeTamJw7Zqi8", "postedAt": "2023-07-12T08:55:36.270Z", "postId": "W93Pt7xch7eyrkZ7f", "htmlBody": "<p>Yes, that is a good crux. Maybe add an answer to \"according to whom?\" For example, \"reported by WHO or in a top medical journal (such as the Lancet, BMJ)\"</p><p>I am thinking of a paper like this one: <a href=\"https://www.thelancet.com/journals/lancet/article/PIIS0140-6736(21)02724-0/fulltext\">https://www.thelancet.com/journals/lancet/article/PIIS0140-6736(21)02724-0/fulltext</a> This was looking back at data from 10-15 years ago and gets to values just over 1 million deaths attributed to AMR.</p>", "parentCommentId": "hq5DeYknc5zMNTDWY", "user": {"username": "Luis Pedro Coelho"}}, {"_id": "j5uGJHwFjnvixudee", "postedAt": "2024-02-01T11:19:51.612Z", "postId": "W93Pt7xch7eyrkZ7f", "htmlBody": "<blockquote><p>I wrote a report for CE on an AMR idea; the cost-effectiveness analyses of which will be released soon and I will post here when they are!</p></blockquote><p>Hey Akhil, is there any update here?&nbsp;</p>", "parentCommentId": "MXFoG99RqMZQkpdB4", "user": {"username": "ElliotJDavies"}}]