[{"_id": "An95tjxw45PWHDGXD", "postedAt": "2022-11-11T21:04:28.239Z", "postId": "WAA9jborjiXqczsTk", "htmlBody": "<p>As a guy who failed a business 5 years ago, accepting the situation for what it is - no matter how hard it is have helped me go to the next step. Losing money is the sublayer of the issue but the bigger downfall can rise from us losing our values that kept us moving towards the right direction. There is no one size fits all acceptance mechanism but the sooner one gets to admit how painful a certain situation is - the faster the recovery will be..</p>", "parentCommentId": null, "user": {"username": "Miguel"}}, {"_id": "yBXf6dRCZZRACAriw", "postedAt": "2022-11-11T21:45:49.673Z", "postId": "WAA9jborjiXqczsTk", "htmlBody": "<p>Thank you for writing this - it articulates so many things that I have also been feeling and thinking over the past few days, in a way that I wouldn't have been able to.  I hope I'm not mistaken in sensing that you hold some optimism and hope even during this tumultuous time - if so, you're not alone. I think that fellow EAs who resonate with these sentiments will emerge at the end of this storm with the same convictions and moral beliefs that lead us here, and that things will be ok.</p>\n", "parentCommentId": null, "user": {"username": "Kaleem"}}, {"_id": "c4HkhFHpqzsmLwncA", "postedAt": "2022-11-11T22:12:33.538Z", "postId": "WAA9jborjiXqczsTk", "htmlBody": "<p>I cleared my calendar yesterday just to grieve. I relived losing family to the pandemic, thinking of all the resources lost for pandemic prevention.</p>\n<p>It’s true that there’s work to be done, but grief is heavy, and if we don’t deal with it honestly we’ll pay dividends later.</p>\n", "parentCommentId": null, "user": {"username": "Emily Dardaman"}}, {"_id": "KyfcphxF72xjrba5w", "postedAt": "2022-11-11T23:23:57.444Z", "postId": "WAA9jborjiXqczsTk", "htmlBody": "<p>Thank you for writing this.</p>", "parentCommentId": null, "user": {"username": "willbradshaw"}}, {"_id": "oapFm3u3r38F9oL9T", "postedAt": "2022-11-12T12:12:06.574Z", "postId": "WAA9jborjiXqczsTk", "htmlBody": "<p>This is a good start. But in my opinion, the questions we need to wrestle with are more structural.</p>\n<p>For instance, when EA (as a collection of institutions and individuals) was considering taking donations from a single donor to the extent SBF offered, what due diligence did we attempt to go through of the business practices of Alameda and FTX? Was this failure a case of blind trust, a coordination failure (surely Sequoia Capital did their due diligence…), or a known, calculated risk?</p>\n<p>I see a lot of attempts to clarify that fraud is bad. But if we actually believe that, what attempts have there been to actually check whether fraud was occurring until this week? If we were genuinely caught off-guard, what did we previously believe about the actual business of FTX?</p>\n<p>It seems like at the very least our baseline expectation should have featured a much higher degree of skepticism than seems to have been brought to the whole endeavor of entrusting a decent chunk of the financing and reputation of the entire EA movement to an offshore crypto business.</p>\n", "parentCommentId": null, "user": {"username": "Sam Elder"}}, {"_id": "9pX5gmohkQxhN682u", "postedAt": "2022-11-12T14:30:49.072Z", "postId": "WAA9jborjiXqczsTk", "htmlBody": "<p>I agree. A common trope in EA is that we don't just give money to any charity because it \"feels good\", we want it to be effective so we investigate and analyze deeply before giving. In same vain, if we want to prevent bad things from happening we need to implement well structured institutions and perform due diligence, even if it \"feels less good\" than trusting without verifying does.&nbsp;</p>", "parentCommentId": "oapFm3u3r38F9oL9T", "user": {"username": "DaneelO"}}, {"_id": "SsygTtd3PagB7eHJD", "postedAt": "2022-11-12T16:16:31.787Z", "postId": "WAA9jborjiXqczsTk", "htmlBody": "<p>Yes, we need to apply similarly rigorous analysis to our (major) sources of funding as we do to the destinations of that funding.</p>", "parentCommentId": "9pX5gmohkQxhN682u", "user": {"username": "Sam Elder"}}, {"_id": "tWres5q7DtmkhbRCK", "postedAt": "2022-11-12T18:36:03.160Z", "postId": "WAA9jborjiXqczsTk", "htmlBody": "<p>Yup, I agree. This post was written as a more personal response to a disorienting situation.</p>\n<p>Let the investigations and reevaluations ensue.</p>\n", "parentCommentId": "oapFm3u3r38F9oL9T", "user": {"username": "MJusten"}}, {"_id": "AxXbttvtpvvwuLJrh", "postedAt": "2022-11-13T11:17:08.547Z", "postId": "WAA9jborjiXqczsTk", "htmlBody": "<p>I work in crypto media. Worth noting that EA didn't just benefit from FTX, it created FTX. Jaan loaned Alameda $50m to do the original Bitcoin arbitrage, FTX founded on the back of that with nigh a dozen EAs. Source from Sequoia archives blog below\n<a href=\"https://archive.ph/qFJJN#selection-163.0-168.0\">https://archive.ph/qFJJN#selection-163.0-168.0</a></p>\n", "parentCommentId": null, "user": {"username": "learko"}}]