[{"_id": "QedczR6Rh9uNaekX6", "postedAt": "2022-11-28T09:11:58.621Z", "postId": "WAdeKMDs4m3koPGYK", "htmlBody": "<p>Thanks for saying this. One complexity is that there are people who will have already rearranged their lives to work of Future-Fund-funded projects, so handing back the money will leave them worse off than when they started. I can understand then why they'd be unwilling to give the money back.</p>\n<p>But I share your distaste for the dialogue and posts I've seen around the issue. People obviously have a heavy vested interest in keeping this money and this will bias some people's moral reasoning. I think it's a bad look for the community. Disappointing.</p>\n", "parentCommentId": null, "user": {"username": "Henry Howard"}}, {"_id": "XsMv8psMbpspy4Kxc", "postedAt": "2022-11-28T09:49:42.452Z", "postId": "WAdeKMDs4m3koPGYK", "htmlBody": "<p>FTX seems to have been turned definitely fraudulent sometime this mid year, and to have been a legitimate business before then. I think it is likely that grants given before then are NOT the result of fraud. You don't address this in your post, but I think it's one of the strongest arguments</p>", "parentCommentId": null, "user": {"username": "NunoSempere"}}, {"_id": "LvQ26kqroyJaZPzRu", "postedAt": "2022-11-28T10:32:18.426Z", "postId": "WAdeKMDs4m3koPGYK", "htmlBody": "<p>Hi OP,&nbsp;</p><p>Welcome to the EA Forum! I appreciate you sharing your thoughts and using this forum to engage with the EA community.&nbsp;</p><p>I'll use my own number system separate from yours so it doesn't get too confusing if you want to respond.</p><p>1. To summarize my personal thoughts, it's plausible that people <i>should</i> return unspent money (I'm mostly unsure but lean towards disagree). But if what you're saying is that people should return FTX Future Fund money that they've spent (and therefore go into personal debt), I disagree.&nbsp;</p><p>2. Regarding your #5, could you give examples of people giving \"zero empathy for the individuals who put money/crypto on the FTX exchange and then were criminally defrauded by FTX\"? And could you give examples of \"Those people do not seem to count to the EA community\"? I feel like most posts I've read about this have mentioned people feeling terrible about the effects on innocent people who lost money to FTX. I agree that the harm suffered by them is far greater than any harm to the EA community.</p><p>&nbsp;For some examples off the top of my head, there's the <a href=\"https://forum.effectivealtruism.org/posts/xafpj3on76uRDoBja/the-ftx-future-fund-team-has-resigned-1\">Future Fund team's post</a> (\"Our hearts go out to the thousands of FTX customers whose finances may have been jeopardized or destroyed.\"), &nbsp;<a href=\"https://forum.effectivealtruism.org/posts/WAA9jborjiXqczsTk/thoughts-on-ftx-and-returning-to-our-ideals\"> Michel's post</a> &nbsp;(\"people's lives got ruined...\"), <a href=\"https://forum.effectivealtruism.org/posts/WdeiPrwgqW2wHAxgT/a-personal-statement-on-ftx\">Will's post</a> (\"... that may cost many thousands of people their savings...\"), <a href=\"https://forum.effectivealtruism.org/posts/XHrHsrQGyr4NnqCA7/we-must-be-very-clear-fraud-in-the-service-of-effective\">evhub's post</a> (\"People's life savings and careers...\"), <a href=\"https://forum.effectivealtruism.org/posts/txGgPvKgZFpphdkHe/my-reaction-to-ftx-appalled\">Rob Wiblin's post</a> (\"Most importantly FTX's depositors... may lose savings they and their families were relying on...\"), and <a href=\"https://many customers are unable to retrieve funds held by FTX\">Rethink Priorities' Leadership Statement</a> (\"many customers are unable to retrieve funds held by FTX\").&nbsp;</p><p>3. It would help if you could spell out your exact logic here. The next few questions are sub-questions/specifics I fail to understand. Feel free to answer them specifically or just spell out your logic cohesively if you think that would answer all my questions.</p><p>3a. I (and every EA I'm aware of) agree that depositors in FTX who've lost their money are victims here. If FTX Future Fund recipients paid back all their money (including spent money), most would be in financial problems and be victims as well. What good would that do? And why should the recipients pay back the money and not the organizations that they paid their money to?&nbsp;</p><p>3a. How does this apply to money that had been spent before the FTX news came out? Many individuals or organizations would need to pay back thousands (or tens of thousands) of dollars that they don't have. FTX grantees who would face financial ruin as a result would also be victims here.&nbsp;</p><p>3c. Would you then agree that all organizations and celebrities that were paid by FTX should pay back whatever money they got? Including sponsorships like the Miami Heat, &nbsp;TSM (the e-sports team), and Stephen Curry? And the electrical company and janitors in the Bahamas paid by FTX? And other employees of FTX (uninvolved and unaware of the scandal) who received a salary?</p><p>3d. If your answer to 3c is that some parties shouldn't have to pay back money, then why? &nbsp;I really encourage you to think about why this should apply to the people and organizations who used or are using the money they received to fund charitable causes. Why is the financial burden on them?</p><p>3e. Is your logic affected by how the amount of money FTX grantees received compares to the amount of money owed to depositors? By my best findings, it seems like over $8 billion is owed back (<a href=\"https://www.nytimes.com/2022/11/17/business/ftx-bankruptcy.html\">New York Times</a>, \"The run on FTX...\"), and the FTX Foundation gave away $140 million (<a href=\"https://www.nytimes.com/2022/11/13/business/ftx-effective-altruism.html\">New York Times</a>, \"as recently as last month...\"). $140 mil divided by $8 bil is just under 2%. If all that $140 million is given back, then 98% of money owed will be remaining. The vast majority of depositors will still be financial affected, and now suddenly hundreds (if not more) of recipients &nbsp;of FTX Foundation grants will be financially affected.</p><p>Thank you!</p>", "parentCommentId": null, "user": null}, {"_id": "oPQwfYgzBEpBjYejJ", "postedAt": "2022-11-28T10:33:36.284Z", "postId": "WAdeKMDs4m3koPGYK", "htmlBody": "<p>Hi NunoSempre, grants given before <i>when</i> are the result of fraud? And is this an argument for or against OP's argument?</p>", "parentCommentId": "XsMv8psMbpspy4Kxc", "user": null}, {"_id": "roF3aMnDoKLA6amAe", "postedAt": "2022-11-28T10:52:03.859Z", "postId": "WAdeKMDs4m3koPGYK", "htmlBody": "<p>I think this is a somewhat useful post to prompt discussion and reflection, and agree there is probably some motivated reasoning going on. That being said, some pushbacks:</p><blockquote><p>The EA forum expresses almost zero empathy for the individuals who put money/crypto on the FTX exchange and then were criminally defrauded by FTX.</p></blockquote><p>I think this is demonstrably false - from some of the most upvoted posts on this issue alone:</p><p><a href=\"https://forum.effectivealtruism.org/posts/XHrHsrQGyr4NnqCA7/we-must-be-very-clear-fraud-in-the-service-of-effective\">We must be very clear: fraud in the service of effective altruism is unacceptable</a><br>\"It is clear that many people—customers and employees—have been deeply hurt by FTX's collapse. People's life savings and careers were very rapidly wiped out. I think that compassion and support for those people is very important.\"</p><p><br><a href=\"https://forum.effectivealtruism.org/posts/WdeiPrwgqW2wHAxgT/a-personal-statement-on-ftx\">A personal statement on FTX</a></p><p>First sentence:<br>\"This is a thread of my thoughts and feelings about the actions that led to FTX’s bankruptcy, and the enormous harm that was caused as a result, involving the likely loss of many thousands of innocent people’s savings.\"</p><p>&nbsp;</p><p><a href=\"https://forum.effectivealtruism.org/posts/txGgPvKgZFpphdkHe/my-reaction-to-ftx-appalled\">My reaction to FTX: appalled</a></p><p>\"One or more leaders at FTX have betrayed the trust of everyone who was counting on them.</p><p>Most importantly FTX's depositors, who didn't stand to gain on the upside but were unwittingly exposed to a massive downside and may lose savings they and their families were relying on.</p><p>FTX leaders also betrayed investors, staff, collaborators, and the groups working to reduce suffering and the risk of future tragedies that they committed to help.</p><p>No plausible ethics permits one to lose money trading then take other people's money to make yet more risky bets in the hope that doing so will help you make it back.\"<br><br>(edit: see Pranay's <a href=\"https://forum.effectivealtruism.org/posts/WAdeKMDs4m3koPGYK/if-you-received-ftx-grant-money-you-should-return-it?commentId=LvQ26kqroyJaZPzRu\">comment </a>for more examples)</p><p>&nbsp;</p><blockquote><p>It is dirty money, the proceeds of FTX’s criminal fraud. Real people have been victimized by FTX.</p><p>Keeping FTX grant money is ratifying the criminal fraud.&nbsp;</p></blockquote><p>Where do you draw the line for \"clean money\"? Is it due to the alleged criminal behavior? Or is it due to real people being victimized?</p><p>E.g. if your justification is due to \"real people being victimized\", then real people have been victimized by Facebook, should we not accept that money also? If your grandparents get their pension funds, they probably invest in and profit from companies that directly cause harm to real people, should you you tell them to decline that? Crypto assets globally use more electricity than entire countries like Argentina or Australia, does that count as real harm? Does spending that money count as ratifying those harmful actions? What about fossil fuels?</p><p>While I do think it's worth having a conversation about what the EA community or individual grantees' obligation are, and I think you're directionally correct about the motivated reasoning claims (though we might disagree about extent), I think I would be interested in a bit more nuance around what you are proposing, unless you literally mean: \"all money received from FTX should be returned, no matter what\", in which case I guess I'd be interested in stronger justification. FTX grantees aren't a monolith, the feasibility of returning the money will vary significantly, and while most of the retail investors were not at fault, nor were most of the FTX grantees. I think I'd consider a claim like \"All FTX grantees should return money regardless of their personal situation\" to be supererogatory, and not a moral requirement (you may have scenarios where a grantee is just taking the place of another victim, through no fault of their own, and it's unclear how this is actually net positive or fair, because neither victim is more 'blameworthy'). I'd be interested if you think otherwise. Again, I agree there was harm done, and I agree there's motivated reasoning going on, but the existence of motivated reasoning and harm done doesn't seem sufficient to suggest all FTX grantees should return all their money.</p>", "parentCommentId": null, "user": {"username": "pseudonym"}}, {"_id": "LJX8eou9mBrwREezh", "postedAt": "2022-11-28T12:50:22.653Z", "postId": "WAdeKMDs4m3koPGYK", "htmlBody": "<p>Why do you think FTX was legit before then? Any sort of presumption of legitimate operations has been shattered by subsequent events + worse-than-Enron internal controls. I'm remaining open to possibilities of what FTX was like prior to mid-2022, but I see very little reliable evidence to support a no-fraud conclusion. Because the answer may impact both the legal and ethical obligations,  I think it's important not to make assumptions unsupported by independent evidence (i.e., evidence not controlled by SBF or pre bankruptcy FTX).</p>\n", "parentCommentId": "XsMv8psMbpspy4Kxc", "user": {"username": "Jason"}}, {"_id": "zkcMhEvAxtA59MApP", "postedAt": "2022-11-28T13:15:13.024Z", "postId": "WAdeKMDs4m3koPGYK", "htmlBody": "<p>Thanks for taking the time to share your thoughts and feelings on this important issue. I would agree that <i>some</i> posts have displayed some self-interested reasoning in an attempt to justify keeping all the money. However, I don't think it's fair to characterize those posts as representing some sort of community consensus.</p><p>My reaction to your post is, I think, fundamentally the same as my reaction to certain posts veering toward self-interested reasoning, just in a different direction. What is your broader theory of what individuals and organizations (not just in EA) needs to return what money, and when? Does FTX's janitor need to figure out how much they were paid and return it all because it was \"dirty money\"? If not, why are grantees in a different moral position? Does your theory rest on certain factual assumptions -- such as a belief that FTX was rotten from day one and that <i>everything</i> it touched was \"dirty?\"</p><p>Although I think a lot of the money <i>should </i>be returned, I think it is also quite a bit more complex than \"everyone is ethically required to return everything.\"</p>", "parentCommentId": null, "user": {"username": "Jason"}}, {"_id": "v2zs2rSchxks54fFg", "postedAt": "2022-11-28T16:47:29.472Z", "postId": "WAdeKMDs4m3koPGYK", "htmlBody": "<ol>\n<li>You are correct that there have been expressions of sympathy for the ripped-off FTX investors.  I overstated the lack of empathy expressed by the forum.</li>\n</ol>\n<p>What appears absent, however, is anyone saying, “I received a grant from FTX and I am returning the money.”  So verbal expressions of empathy exist, but actions appear lacking.</p>\n<ol start=\"2\">\n<li>\n<p>Raising the issue of where does one abstractly draw the line between clean money and dirty money - this is the kind of misdirection and casting around for rationalizations to keep the grant money that raise eyebrows to non-EA people like me who read this forum.  Wherever that line is drawn in the abstract, FTX’s criminal fraud crossed it and FTX’s money is dirty, tainted proceeds of theft.   Saying, “what about fossil fuels?” does not change FTX’s criminal fraud.  That’s the concrete issue at hand.</p>\n</li>\n<li>\n<p>Nice try at implying that grant recipients are equal victims to FTX’s depositors. Grant recipients are not victims at all. Grant recipients received <em>gifts</em> of money from FTX.  Money they now know was stolen.</p>\n</li>\n<li>\n<p>Many of the grant recipients appear to be making a lack-of-knowledge argument to justify their keeping the money. They didn’t know it was stolen when they received it, so now they want to feel justified retaining it.</p>\n</li>\n</ol>\n<p>At the same time they don’t want the cognitive dissonance of recognizing that by keeping the grant money they just gave up their pretense of EA ideals.   So they search around for rationalizations, and this lack of knowledge argument is one.</p>\n<p>It’s not persuasive. Say you are walking down the street and you see person A rob person B at gunpoint. You then ask person A for money and he tosses you B’s wallet. Hopefully everyone would agree you should give the wallet back to B.</p>\n<p>Now imagine you are walking down the street and A runs around the corner. You ask him for money and he tosses you a wallet and runs off. Two seconds later a crowd of people, including B, come around the corner. They explain that A robbed B of his wallet 30 seconds ago, and that you are holding the wallet.  Do you start arguing that you too are the victim because when A gave you the wallet you didn’t know it was stolen? Well you know now and you should return it to B.  Or, if you decide to keep the wallet, you should not pretend you are doing so out of anything other than pure self-interest.</p>\n", "parentCommentId": "roF3aMnDoKLA6amAe", "user": {"username": "Thurgood"}}, {"_id": "suSqqJRL4zcazXzst", "postedAt": "2022-11-28T17:17:10.210Z", "postId": "WAdeKMDs4m3koPGYK", "htmlBody": "<ol>\n<li>I think you are correct that, as a practical matter, there is a difference between FTX grant money that has already been spent and grant money that is unspent.  Unspent money should be returned.  It would be asking too much for grant recipients to also return money already spent.  That would be ideal but it is unrealistic.</li>\n</ol>\n<p>3c.  Janitors? Please.  That is a false equivalency equating grant recipients with janitors.  Grant recipients didn’t scrub any toilets or empty any trash cans at FTX. Instead, grant recipients were given a <em>gift</em> of money from FTX.  This is another example of misdirection and searching around for a rationalization to keep the tainted grant money, it is an unseemly form of what-aboutism. “But, what about the janitors?”  Let the janitors figure out what they want to do.  What are the grant recipients going to do?</p>\n<p>As for the celebrity endorsers, of course they should return all the money they were paid. They affirmatively helped lure more depositors into the scheme.  But again, that’s a separate issue from the EA grant recipients.</p>\n<p>3e.  Is someone seriously arguing that because the amount of FTX grants was ‘only’ $140 million the money should not be returned because it’s only a fraction of the stolen $8 billion?  That is an unworthy and unseemly argument.  “Hey, I’m only going to keep a portion of the stolen money, so it’s okay.”  If that argument is indeed advanced then the moral compass has been tossed overboard and the ship is being intentionally run onto the reef.</p>\n", "parentCommentId": "LvQ26kqroyJaZPzRu", "user": {"username": "Thurgood"}}, {"_id": "GCM7iGZasD2uD2vbS", "postedAt": "2022-11-28T17:30:16.927Z", "postId": "WAdeKMDs4m3koPGYK", "htmlBody": "<p>Again with the janitors.  It raises the eyebrow to see the efforts to compare FTX grant recipients with janitors.  It’s an attempt at misdirection and diffusion of responsibility: “If I can say that everyone who got FTX money is the same, then I can point to a sympathetic person and say I’m the same - how about a janitor?  How about a janitor who used the money to pay for their mom’s life-saving operation?”</p>\n<p>The answer is that grant recipients are not janitors. Grant recipients received <em>gifts</em> of money from FTX. Grant recipients did not scrub toilets or empty trash cans. The janitors can figure out what they want to do. That has no bearing on what the grant recipients should do, which is return the money (at least the unspent portion). What janitors do or don’t do had no bearing on the grant recipients’ responsibility.</p>\n<p>What about the janitors, please.</p>\n", "parentCommentId": "zkcMhEvAxtA59MApP", "user": {"username": "Thurgood"}}, {"_id": "LfsNEZjRyGzQBQ26t", "postedAt": "2022-11-28T18:23:20.158Z", "postId": "WAdeKMDs4m3koPGYK", "htmlBody": "<p>1.<br>Fair, I haven't spent enough time reading the comments to push back on this. Not sure if you consider something like <a href=\"https://forum.effectivealtruism.org/posts/qtviXtEDgZ4Cr36XX/the-case-for-actively-assisting-ftx-clawbacks?commentId=aubwHd6tDp2ow3ts8#comments\">this </a>as reasonable or a rationalization.<br><br>2.<br>I'm not making a case that FTX grantees should keep the money where possible, I'm just pointing out that if your principle is that people shouldn't spend money they know to have an unclean source, then it actually isn't as obvious as you are making it out to be. If your argument is around harm done, then clearly there are also considerations around what harms might occur as a result of returning this money (and I hope you would also want to push strongly for those who are involved with returning money to be prioritizing harm mitigation, as one consideration is there might a lot more money available to be redirected from that pool than the EA one). If your argument is about legal proceedings, then I'm hopeful that EAs will follow the law here, and I would condemn EAs who tried to keep the money if it was against the law to. If your argument is about something like - \"doing right by retail investors\", then I think you still have to make a case that the retail investors are now the strongest focus of moral obligation for all grantees for that pool of money (though I think that could easily be true for some or even most grantees).&nbsp;</p><p>I'm also not casting around for rationalizations to keep the grant money because I've never received an FTX grant.<br><br>3.<br>I didn't claim that grant recipients are equal victims to FTX's depositors, I said there could be scenarios where a grantee takes the place of another victim, through no fault of their own. You can reasonably interpret that as \"sometimes grant recipients are also victims\". It sounds like you disagree because you say \"Grant recipients are not victims at all.\" but I strongly disagree with this.<br><br>Suppose someone quits their job to do independent research funded by the FTX future fund. then they lose the \"gift\" of money that they made some major life changes around, but now have no job to return to, meaning they quit their job for nothing.</p><p>Say an organization with 10 researchers who was running in part on FTX money now lose funding. But they've also spent millions of FTX money last year. Should they fire everyone and go bankrupt trying to return this money?</p><p>I don't understand how you have so much (and rightly so!) empathy for the retail investors, but at the same time don't see how it's possible for grant recipients to also be victims.</p><p>4.<br>I think this is not a great analogy, because most of the time you don't expect people to throw you a wallet and run off, and grant recipients don't really receive money like that. A better analogy might be: you apply to a scholarship to college. you successfully get this scholarship, and then 2 weeks into college, you find out that Gaddafi funded your scholarship. Should you now decline your scholarship? Now you find out that half of all the college entrance scholarships in your country was funded by Gaddafi, but you're not actually required to pay it back legally - but a third party is starting a process that allows you to pay it back, should you choose to. Should all those people be morally obliged to return their scholarships, regardless of the situation? What if you can't go to college if you didn't have this scholarship? What if 75% of the money wasn't going to go back to the people harmed by Gaddafi if you declined the scholarship, but kept by the third party? What if you thought you could do better than 75% if you didn't voluntarily return the money? I mean this is also not a great analogy but I'm mainly trying to illustrate why you could have recipients of grants also be a victim, as well as why modelling grants as wallets that a stranger throws you while running away isn't great.<br><br>FWIW, I think if you're not going to face major financial issues, then I do think it's likely morally preferable to return the money than not, all else equal. And I think if you would be in a financially stable situation if you return the money and choose not to, then you should be very careful about the reasoning for your justification, because it would be very easy for there to be some degree of motivated reasoning. But again, I think you haven't made a case for why it is a moral requirement for all grant recipients to return the money regardless of circumstance, as opposed to something supererogatory.</p>", "parentCommentId": "v2zs2rSchxks54fFg", "user": {"username": "pseudonym"}}, {"_id": "MSEnt7E7KiLSWHAJK", "postedAt": "2022-11-28T18:49:52.698Z", "postId": "WAdeKMDs4m3koPGYK", "htmlBody": "<p>I think this is a potentially stronger argument than the one in the original post, which decried all FTX money as \"dirty\" and said everyone who had it should return it. However, you're making an assumption that the grantees received gifts, rather than advance compensation for work to be performed. I don't think that assumption is correct for all or even most grants. There were grant contracts; I don't think FTX gave Joe Smith $50K free and clear to do whatever he wanted to with the money. As I understand it, most of the contracts obliged Joe Smith to provide $50K worth of research labor for that $50K grant. If Joe Smith spent time conducting the research (when he could have been working for someone else), I think his status is similar to that of the janitor.</p><p>As I've said in several posts, I generally agree that unearned/unspent monies should be returned -- I was responding to an original post that 100% of the funds should be returned in every case.</p><p>I wrote about a hypothetical janitor for two reasons: First, I didn't feel the original comment explained why it was OK for <i>anyone </i>to receive any money ever received from FTX. It is fair to push someone's stated policy position to its full logical extent. In response, you've qualified the original position and apparently clarified that it's OK for someone to retain money paid for work they had already done. The question served its purpose of helping clarify the argument. Second, one could argue that certain senior FTX employees should give back already-earned funds because they were negligent in not detecting that a fraud was afoot. I think that argument is likely wrong, but using a blue-collar employee as the comparator avoids wading into that possibility.</p>", "parentCommentId": "GCM7iGZasD2uD2vbS", "user": {"username": "Jason"}}, {"_id": "bHAErQuQ2Cuqf6xaA", "postedAt": "2022-11-28T19:50:03.659Z", "postId": "WAdeKMDs4m3koPGYK", "htmlBody": "<p>I don't think 3e is convincing, both because it doesn't account for other potential revenue streams for the bankruptcy estate and because partial recompense is still valuable. Also, as to much of the funds in question, the grantees are still in a position to avoid or at least manage financial loss. A grantee's continued interest in working on a cause that is important to them just isn't in the same category as a depositor's interest in recovering monies stolen from them. Nor is a larger organization's desire not to cancel initiatives that it was planning on due to the FTX money. Collasping the effect of the fraud into a binary of \"financially affected\" / \"not financially affected\" and counting noses doesn't make a whole lot of sense to me.</p><p>Would you be asking 3e -- and would your own answer be the same -- if FTX had made the grants to opera organizations and opera singers in the United States? I think there have been at least a few posts (not by you, to my recollection) that strongly suggest the author is applying a different standard to EA grantees than they would to opera grantees. I think it problematic if the answer to whether money should be returned changes much based on the nature of the charity. Such a stance will generally imply that we have some sort of right to tell crime victims that they will have to be involuntary donors because the cause is so important in our eyes as to justify <i>them</i> making that sacrifice.</p>", "parentCommentId": "LvQ26kqroyJaZPzRu", "user": {"username": "Jason"}}, {"_id": "ik797tSTEeQvYwprL", "postedAt": "2022-11-28T21:25:25.227Z", "postId": "WAdeKMDs4m3koPGYK", "htmlBody": "<p>I think you flipped something in here. Did you mean you think grants <i>after</i> this are likely the result of fraud?</p>", "parentCommentId": "XsMv8psMbpspy4Kxc", "user": {"username": "ChanaMessinger"}}, {"_id": "ijwkZHXQBqN6DiLPu", "postedAt": "2022-11-28T21:51:35.854Z", "postId": "WAdeKMDs4m3koPGYK", "htmlBody": "<blockquote>\n<p>You are correct that there have been expressions of sympathy for the ripped-off FTX investors. I overstated the lack of empathy expressed by the forum.</p>\n<p>What appears absent, however, is anyone saying, “I received a grant from FTX and I am returning the money.” So verbal expressions of empathy exist, but actions appear lacking.</p>\n</blockquote>\n<p>This seems wrong to me. E.g. Paul Christiano <a href=\"https://forum.effectivealtruism.org/posts/XHrHsrQGyr4NnqCA7/we-must-be-very-clear-fraud-in-the-service-of-effective?commentId=axHhc8eMLyc8bFE4f\">has written</a>:</p>\n<blockquote>\n<p>Earlier this year ARC received a grant for $1.25M from the FTX foundation. We now believe that this money morally (if not legally) belongs to FTX customers or creditors, so we intend to return $1.25M to them.</p>\n</blockquote>\n", "parentCommentId": "v2zs2rSchxks54fFg", "user": {"username": "Erich_Grunewald"}}, {"_id": "8bsTGk5WY27ayACwF", "postedAt": "2022-11-28T22:05:30.110Z", "postId": "WAdeKMDs4m3koPGYK", "htmlBody": "<blockquote>\n<p>Grant recipients didn’t scrub any toilets or empty any trash cans at FTX. Instead, grant recipients were given a <em>gift</em> of money from FTX. This is another example of misdirection and searching around for a rationalization to keep the tainted grant money, it is an unseemly form of what-aboutism.</p>\n</blockquote>\n<p>I would push back against this. Grant recipients were given money to carry out a job. They were not given money unconditionally, which is what a gift is. So I think you still need to spell out the underlying principle here.</p>\n", "parentCommentId": "suSqqJRL4zcazXzst", "user": {"username": "Erich_Grunewald"}}, {"_id": "gcTAtohcwc4gMrm4Q", "postedAt": "2022-11-28T22:23:34.332Z", "postId": "WAdeKMDs4m3koPGYK", "htmlBody": "<p>Excellent for ARC!  I am heartened to hear this.  ARC is to be commended and I applaud them.  Well done, ARC.</p>\n", "parentCommentId": "ijwkZHXQBqN6DiLPu", "user": {"username": "Thurgood"}}, {"_id": "Cy4L8ewJ7ACuoxjbq", "postedAt": "2022-11-28T22:58:18.263Z", "postId": "WAdeKMDs4m3koPGYK", "htmlBody": "<p>Well, if doing the right thing isn’t enough in itself to convince grant recipients (see ARC’s commendable statement that they are returning their $1.25 million grant) then how about wanting to stay out of prison.</p>\n<p>Right now FTX grant recipients are relying on the fig leaf that FTX and/or its former executives have not yet been been charged or convicted of criminally defrauding (embezzling from) FTX’s depositors.</p>\n<p>But even at this point grant recipients are on notice that their grant money likely was stolen funds.  If criminal convictions are obtained, this will be cemented - the money is stolen property.</p>\n<p>Therefore, grant recipients who possess stolen funds (grants from FTX made with stolen money) are on the cusp of potentially committing a crime themselves if they refuse to return it - the crime of retaining known stolen property.  It matters not that they did not know at the time they received it that it was stolen.  They know now and yet are retaining the money rather than returning the money to its rightful owners.</p>\n<p>In many jurisdictions retaining know stolen property is a crime (not talking about <em>receiving</em> stolen property - there you do have to know at the time you received it that it was stolen; talking about <em>retaining</em> known stolen property once you know it is stolen - that is an independent crime).  Look for example at Model Penal Code 223.6(1) “A person is guilty of theft if he purposely … retains or disposes of … property of another knowing that it has been stolen, or believing that it probably has been stolen, unless the property is … retained, or disposed with purpose to restore it to the owner.”</p>\n<p>Imagine you are a grant recipient, and in two years are in court trying to explain why you kept the grant money and then spent it, after you were on notice that it was likely stolen funds.</p>\n<p>Right now there is a window where people can freely choose to do the right thing, or not. That window will likely close, and then the discussion will reduce to return the money or potentially commit a crime and go to jail.</p>\n<p>(Again, I have have never owned or speculated in any cryptocurrency, and I have no connections whatsoever with FTX or any crypto business - I do not have a dog in this fight.)</p>\n", "parentCommentId": "8bsTGk5WY27ayACwF", "user": {"username": "Thurgood"}}, {"_id": "3kWKLey3k2BdJzxFc", "postedAt": "2022-11-29T02:38:00.633Z", "postId": "WAdeKMDs4m3koPGYK", "htmlBody": "<p>You make some persuasive points.</p>\n<p>Imagine person A steals your car. Person A then gives the car to Person B, who does not know at that point that the car is stolen.  B is going to use the car to deliver food for a food bank or some other good purpose - A  nods and gives B the car.</p>\n<p>The police then find B has your car, and tell B that the car is stolen and belongs to you.</p>\n<p>B starts looking at his shoes and shuffling his feet. He mumbles that he filled up the gas tank, and it was only half full when he got the car. Maybe he even put some new wiper blades on it. He keeps repeating that he didn’t know the car was stolen when A gave it to him, and that he was supposed to use it for good purposes.</p>\n<p>It dawns on you that B is not going to return your car. B is straining to think up excuses to keep your car.</p>\n<p>That’s how the FTX grant situation looks from the outside.</p>\n<p>Grants are gifts. They are, as you say, up front payments, and in return you say you’re going to use them for some purpose, but it’s not an economic benefit to the grantee. It’s like a rich donor giving a university money to build a sports stadium - it’s a gift even though the university does have to use it to build the stadium.</p>\n<p>In the scenario, B should return the car to you. If he doesn’t he may be committing the crime of refusing to return known stolen property.</p>\n", "parentCommentId": "MSEnt7E7KiLSWHAJK", "user": {"username": "Thurgood"}}, {"_id": "Qx2FfqCpEZwPzDfaP", "postedAt": "2022-11-29T02:40:21.964Z", "postId": "WAdeKMDs4m3koPGYK", "htmlBody": "<p>Meant “not an economic benefit to the <em>grantor</em>”</p>\n", "parentCommentId": "3kWKLey3k2BdJzxFc", "user": {"username": "Thurgood"}}, {"_id": "NbLNKTDSpBMDZzWvY", "postedAt": "2022-11-29T03:31:20.789Z", "postId": "WAdeKMDs4m3koPGYK", "htmlBody": "<p>I think there are some grantee situations in which your car metaphor generally makes sense. But I think there are others that look more like this:</p><p>Thief steals $3000. Thief gets in a car crash. Thief takes car to Innocent Mechanic, who spends significant time and resources repairing the car pursuant to a contract with Thief (without knowledge the money was stolen). Thief pays Innocent Mechanic with the $3000 and picks up the car. Thief is caught, has a heart attack (crashing the car which is now worthless), and dies without a penny to his name. Innocent Victim comes in and demands the $3000 back. Innocent Mechanic asserts the right to be compensated for the work he has performed in good faith and without knowledge his fee was stolen.</p><p>Either Innocent Mechanic or Innocent Victim is going to get unfairly screwed here. Assuming he is actually innocent, I think it is OK for Innocent Mechanic to keep the money. Although I feel bad for Innocent Victim, it's necessary for the smooth functioning of society that workers are confident they will be able to keep fair wages for the work they performed. That's why mechanics' liens exist, for instance, and why unpaid wages get priority treatment in bankruptcy. So if you (1) told me this story, (2) told me there was a 1/10 chance I was Innocent Mechnic, a 1/10 chance I was Innocent Victim, and a 8/10 chance I was random member of society, and (3) made me decide who should suffer the loss -- I would have said Innocent Victim. That has nothing to do with what I think of the merits of the grants at issue here.</p><p>Just saw your clarification -- I don't think it matters that there was no economic benefit to the grantor; the detriment to the grantee is sufficient to establish the grantee's legitimate interest in retaining the money (to the extent of that detriment). Charities serve important social functions. While I do not generally think charities should get <i>privileged </i>status compared to other transferees, I generally don't think they should get inferior status either. Hence my inclination to treat them like other vendors here.</p>", "parentCommentId": "3kWKLey3k2BdJzxFc", "user": {"username": "Jason"}}, {"_id": "giyDfGTrXpFLdLwnw", "postedAt": "2022-11-29T09:14:57.561Z", "postId": "WAdeKMDs4m3koPGYK", "htmlBody": "<p>Oof, yes</p>", "parentCommentId": "ik797tSTEeQvYwprL", "user": {"username": "NunoSempere"}}, {"_id": "K7iFHpxbweTRMK3mK", "postedAt": "2022-11-29T09:17:00.454Z", "postId": "WAdeKMDs4m3koPGYK", "htmlBody": "<p>Sorry, had a typo, grants given before mid-year probably are NOT the result of fraud. I'm less certain about grants afterwards. One particularly deciding moment seems to have been the crash of Luna, around May 7th, but I don't recall the fraud starting just then. I imagine the bankruptcy proceedings may surface more information.</p>", "parentCommentId": "oPQwfYgzBEpBjYejJ", "user": {"username": "NunoSempere"}}]