[{"_id": "m9xArRaLFm3sLyDka", "postedAt": "2022-11-12T16:53:31.964Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>Hello Wil,</p><p>&nbsp;</p><p>I &nbsp;commented this in Nathan's post earlier and this is a best practice that the EA governance team may consider creating...</p><blockquote><p>To point out what key features that EA may take seriously if setting up an Internal Audit Team &nbsp;is in its future plans based on <a href=\"https://www.theiia.org/en/standards/what-are-the-standards/\">standards</a></p><ul><li>&nbsp; The internal audit activity must be independent, and internal auditors must be objective in performing their work.&nbsp; (<i>Performance Standards</i>)</li><li>The chief audit executive must report to a level within the organization that allows the internal audit activity to fulfill its responsibilities. The chief audit executive must confirm to the board, at least annually, the organizational independence of the internal audit activity. (<i>Performance Standards</i>)</li><li>The chief audit executive must effectively manage the internal audit activity to ensure it adds value to the organization. (<i>Attribute Standards</i>)</li><li>The internal audit activity must evaluate the effectiveness and contribute to the improvement of risk management processes. (<i>Attribute Standards)</i></li></ul><p>There are many more standards that acts as safeguards to how an internal audit activity be done objectively and prevents large scale errors or frauds to happen.</p><p>These SOP in Internal Audit are proven methods ran by almost all large corporations and banks all over the world.&nbsp;</p></blockquote><p>&nbsp;</p><p>All the best,</p><p>Miguel</p>", "parentCommentId": null, "user": {"username": "Miguel"}}, {"_id": "2eBuk69aJGJ2rbxMr", "postedAt": "2022-11-12T17:38:42.798Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<blockquote><p>A clear-thinking EA should strongly oppose “ends justify the means” reasoning.</p></blockquote><p>This has indeed always been the case, but I'm glad it is so explicitly pointed out now. The overgeneralization from “FTX/SBF did unethical stuff” to “EA people think the end always justifies the means” is very easy to make for people that are less familiar with EA - or perhaps even SBF fell for this kind of reasoning, though his motivations are speculations for now.</p><p>It would probably be for the better to make the faulty nature of “end justify the means” reasoning &nbsp;(or the distinction between <a href=\"https://forum.effectivealtruism.org/posts/nvus8kuGxyacyfXeg/naive-vs-prudent-utilitarianism\">naive and prudent utilitarianism</a>) a core EA cultural norm that people can't miss.</p>", "parentCommentId": null, "user": {"username": "jelle-donders"}}, {"_id": "3ZNGqJEpQSrDuRpSu", "postedAt": "2022-11-12T18:02:10.811Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>It's fair enough to feel betrayed in this situation, and to speak that out.&nbsp;</p><p>But given your position in the EA community, I think it's much more important to put effort towards giving context on your role in this saga.&nbsp;</p><p>Some jumping-off points:&nbsp;</p><ul><li>Did you consider yourself to be in a mentor / mentee relationship with SBF prior to the founding of FTX? What was the depth and cadence of that relationship?&nbsp;<ul><li>e.g. from <a href=\"https://archive.ph/XTy9z\">this Sequoia profile </a>(archived as they recently pulled it from their site):&nbsp;<br><br>\"The math, MacAskill argued, means that if one’s goal is to optimize one’s life for doing good, often most good can be done by choosing to make the most money possible—in order to give it all away. “Earn to give,” urged MacAskill.<br><br>... And MacAskill—Singer’s philosophical heir—had the answer: The best way for him to maximize good in the world would be to maximize his wealth. SBF listened, nodding, as MacAskill made his pitch. The earn-to-give logic was airtight. It was, SBF realized, applied utilitarianism. Knowing what he had to do, SBF simply said, “Yep. That makes sense.”\"<br>&nbsp;</li></ul></li><li>What diligence did you / your team do on FTX before agreeing to join the Future Fund as an advisor?&nbsp;<ul><li>[Edited to add: Were you aware of the <a href=\"https://forum.effectivealtruism.org/posts/xafpj3on76uRDoBja/the-ftx-future-fund-team-has-resigned-1?commentId=GoDd83K7ipktDtWWs\">2018 dispute at Alameda</a> re: SBF's leadership? If so, how did this context factor into your decision to join the Future Fund?]&nbsp;</li><li>Did you have visibility into where money earmarked for Future Fund grants was being held?</li><li>Did you understand the mechanism by which FTX claimed to be generating revenue? Were the revenues they reported sanity-checked against a back-of-the-envelope estimate of how much their claimed mechanism would be able to generate?<br>&nbsp;</li></ul></li><li>What were your responsibilities at the Future Fund? How often were you in contact with SBF and other members of FTX leadership in your role as an advisor?&nbsp;</li></ul>", "parentCommentId": null, "user": {"username": "Milan_Griffes"}}, {"_id": "rg5ZAbzFwzwJ2YL22", "postedAt": "2022-11-12T18:12:11.987Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>My naive moral psychology guess—which may very well be falsified by subsequent revelations, as many of my views have this week—is that we probably won’t ever find an “ends justify the means” smoking gun (eg, an internal memo from SBF saying that we need to fraudulently move funds from account A to B so we can give more to EA). More likely, systemic weaknesses in FTX’s compliance and risk management practices failed to prevent aggressive risk-taking and unethical profit-seeking and self-preserving business decisions that were motivated by some complicated but unstated mix of misguided pseduo-altruism, self-preservation instincts, hubris, and perceived business/shareholder demands.</p>\n<p>I say this because we can and should be denouncing ends justify the means reasoning of this type, but I suspect very rarely in the heat of a perceived crisis will many people actually invoke it. I think we will prevent more catastrophes of this nature in the future by focusing more on on integrity as a personal virtue and the need for systemic compliance and risk-management tools within EA broadly and highly impactful/prominent EA orgs, especially those whose altruistic motives will be systematically in tension with perceived business demands.</p>\n", "parentCommentId": null, "user": {"username": "Cullen_OKeefe"}}, {"_id": "9vsDK4d8WAjXthMAu", "postedAt": "2022-11-12T18:23:59.896Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<blockquote><p>Did you understand the mechanism by which FTX claimed to be generating revenue? Were the revenues they reported sanity-checked against a back-of-the-envelope estimate of how much their claimed mechanism would be able to generate?</p></blockquote><p><br>I think it's important to note that <i>many</i> experts, traders, and investors did not see this coming, or they could have saved/made billions.<br><br>It seems very unfair to ask fund recipients to significantly outperform the market and most experts, while having access to way less information.<br><br>See <a href=\"https://twitter.com/ESYudkowsky/status/1591215030351323136\">this Twitter thread from Yudkowsky</a><br><br>Edit: I meant to refer to fund advisors, not (just) fund recipients</p>", "parentCommentId": "3ZNGqJEpQSrDuRpSu", "user": {"username": "Lorenzo Buonanno"}}, {"_id": "vZJ8dKhuZdYvQRndx", "postedAt": "2022-11-12T18:28:28.492Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>[Edit after months: While I still believe these are valid questions, I now think I was too hostile, overconfident, and not genuinely curious enough.]\nOne additional thing I’d be curious about:</p>\n<p>You played the role of a messenger between SBF and Elon Musk in a bid for SBF to invest up to 15 billion of (presumably mostly his) wealth in an acquisition of Twitter.  The stated reason for that bid was to make Twitter better for the world. This has worried me a lot over the last weeks. It could have easily been the most consequential thing EAs have ever done and there has - to my knowledge- never been a thorough EA debate that signalled that this would be a good idea.</p>\n<p>What was the reasoning behind the decision to support SBF by connecting him to Musk?\nHow many people from FTXFF  or EA at large were consulted to figure out if that was a good idea?\nDo you think that it still made sense at the point you helped with the potential acquisition to regard most of the wealth of SBF as EA resources? If not, why did you not inform the EA community?</p>\n<p>Source for claim about playing a messenger: <a href=\"https://twitter.com/tier10k/status/1575603591431102464?s=20&amp;t=lYY65-TpZuifcbQ2j2EQ5w\">https://twitter.com/tier10k/status/1575603591431102464?s=20&amp;t=lYY65-TpZuifcbQ2j2EQ5w</a></p>\n", "parentCommentId": "3ZNGqJEpQSrDuRpSu", "user": {"username": "TobiasH"}}, {"_id": "hotkTagmZTrhjYKHN", "postedAt": "2022-11-12T18:28:43.894Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>I think it's good practice to try to understand a project's business model and try to independently verify the implications of that model before joining the project.&nbsp;</p>", "parentCommentId": "9vsDK4d8WAjXthMAu", "user": {"username": "Milan_Griffes"}}, {"_id": "mNdPE6RxQm5J9eXnm", "postedAt": "2022-11-12T18:38:04.704Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>Hi &nbsp;Milan,</p><p>&nbsp;</p><p>I come from the traditional accounting/ internal audit where governance teams and internal controls at the very least are installed and due diligence is a best practice especially in large sums of money being distributed. I am new here to the EA community and have expected similar protocols are in place as large scale fraud is not some new thing - it had brought down the accounting profession in 2001 (Enron) and the mortgage crisis in 2008 (Lehman).&nbsp;</p><p>I guess what is clear to me is EA lacks the expertise on fraud / error detection, moreover has to make some improvements in the near future.</p><p>&nbsp;</p><p>All the best,&nbsp;</p><p>Miguel</p>", "parentCommentId": "3ZNGqJEpQSrDuRpSu", "user": {"username": "Miguel"}}, {"_id": "myh5uAYnCbP9NXu6T", "postedAt": "2022-11-12T19:08:23.641Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>My understanding is that FTX's business model fairly straightforwardly made sense? It was an exchange, and there are many exchanges in the world that are successful and probably not fraudulent businesses (even in crypto - Binance, Coinbase, etc). As far as I can tell, the fraud was due to supporting specific failures of Alameda due to bad decisions, but wasn't inherent to FTX making any money at all?</p>\n", "parentCommentId": "hotkTagmZTrhjYKHN", "user": {"username": "Neel Nanda"}}, {"_id": "cKbbBz8ffRcDBeSkw", "postedAt": "2022-11-12T19:17:27.180Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>I want to say that I have tremendous respect for you, I love your writing and your interviews, and I believe that your intentions are pure.</p><p>How concerned were you about crypto generally being unethical? Even without knowledge of the possibly illegal, possibly fraudulent behaviour. Encouraging people to invest in \"<a href=\"https://www.vox.com/future-perfect/2022/8/23/23313081/effective-altruism-billionaires-tax-inequality-dustin-moskovitz-sam-bankman-fried\">mathematically complex garbage</a>\" seemed very unethical. (Due to the harm to the investor and the economy as a whole).</p><p>SBF seemed like a generally dishonest person. He ran ads saying, \"<a href=\"https://www.youtube.com/watch?v=BH5-rSxilxo\">don't be like Larry</a>\". But in <a href=\"https://www.ft.com/content/83bc681a-a0f9-43bb-b627-c6dacae4a0a3\">this</a> FT interview, he didn't seem to have a lot of faith that he was helping his customers.</p><p>\"Does he worry about the clients who lose life-changing sums through speculation, some trading risky derivatives products that are banned in several countries? The subject makes Bankman-Fried visibly uncomfortable. Throughout the meal, he has shifted in his seat, but now he has his crossed arms and legs all crammed into a yogic pose.\"</p><p>It is now clear that he is dishonest. Given he said on Twitter that FTX US was safe when it wasn't (please correct me if I'm wrong here).</p><p>I think that even SBF thinks/thought crypto is <a href=\"https://www.youtube.com/watch?v=C6nAxiym9oc\">garbage</a>, yet he spent billions bailing out a scam industry, possibly with customer deposits. If he had been successful, the result would have been more people getting scammed.</p><p>I hate to say, \"I told you so\", but I told many people in EA privately that I thought SBF was possibly doing more harm than good. The mechanism I argued was that making EA associated with a scam industry would hurt EA and increase x-risk. Everyone I told dismissed my concerns as implausible/ defended crypto.</p><p>I obviously regret not saying this publicly; I was afraid of the impact this could have on my job security.&nbsp;</p><p>I believe that I, along with many other people in EA, was blinded by his massive philanthropy in an Emperor Wears No Clothes kind of situation. Or maybe <a href=\"https://ghibli.fandom.com/wiki/No-Face\">No-Face</a> from Spirited Away.</p><p>I think I was greedy and had a fear-based mindset. I don't know if the community was encouraging independent thought or free speech regarding SBF/FTX/crypto. Obviously, on the forum, people were, but maybe less so on the inside when employed in an EA org, particularly the higher-ups.</p><p>I'm feeling a lot of things right now. If this turns out to be an Enron/ Madoff situation, I don't know if I can trust you anymore. I don't know if I should stay in EA. I would feel very sad if you publicly praised someone who turned out to be morally bankrupt. Of course, everyone makes mistakes. But still, some trust has been lost.</p><p>My inside view is that <a href=\"https://en.wikipedia.org/wiki/Land_value_tax\">LVT</a> is on a similar order of magnitude in importance to AI safety. As it seems more neglected and tractable, the scale is, of course, much smaller. Everyone in EA said I was wrong, and I trusted them, so I updated my outside view. But now I don't know what to think. I hope I'm using the terms inside view and outside view correctly. Sorry if this is unclear/ too much of a rant. I'm very upset about all of this.</p><p>Edit: Many non-profits don't know what to do when being offered donations by morally questionable billionaires. Turning it down is, of course, challenging and possibly not the most impactful action. If they accept the money, they usually try to avoid praising the donor, being publicly associated with them or making them a central figure in their movement. Why didn't you do that?</p>", "parentCommentId": null, "user": {"username": "Dean Abele"}}, {"_id": "v8xrMib5jXvv3YgJi", "postedAt": "2022-11-12T19:21:24.944Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>This seems to be “not even wrong” - FTX’s business model isn’t and never was in question. The issue is Sam committing fraud and misappropriating customer funds, and there being a total lack of internal controls at FTX that made this possible.</p>\n", "parentCommentId": "hotkTagmZTrhjYKHN", "user": {"username": "HenryStanley"}}, {"_id": "gnL5kyqmxmZ3pPvn9", "postedAt": "2022-11-12T19:24:23.007Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>If you say that your business model is to hold depositor funds 1:1 and earn money from fees, but in fact you sometimes earn money via making trades with depositor funds, then you would be misrepresenting your business model.&nbsp;</p>", "parentCommentId": "v8xrMib5jXvv3YgJi", "user": {"username": "Milan_Griffes"}}, {"_id": "mPD8JrAnxAeLwezKN", "postedAt": "2022-11-12T19:26:54.030Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>Also from the Sequoia profile: \"After SBF quit Jane Street, he moved back home to the Bay Area, where Will MacAskill had offered him a job as director of business development at the Centre for Effective Altruism.\" It was precisely at this time that SBF launched Alameda Research, with Tara Mac Aulay (then the president of CEA) as a co-founder ( <a href=\"https://www.bloomberg.com/news/articles/2022-07-14/celsius-bankruptcy-filing-shows-long-reach-of-sam-bankman-fried\">https://www.bloomberg.com/news/articles/2022-07-14/celsius-bankruptcy-filing-shows-long-reach-of-sam-bankman-fried</a>).</p><p>To what extent was Will or any other CEA figure involved with launching Alameda and/or advising it?&nbsp;</p>", "parentCommentId": "3ZNGqJEpQSrDuRpSu", "user": {"username": "Stuart Buck"}}, {"_id": "jpmnCBxkwdoiFXuMy", "postedAt": "2022-11-12T19:29:34.489Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>I’m not as sure about advisors, as I wrote <a href=\"https://forum.effectivealtruism.org/posts/4zjnFxGWYkEF4nqMi/how-could-we-have-avoided-this?commentId=cErPLRzAppGEzfJ5f\">here</a>. Agree on recipients</p>\n", "parentCommentId": "9vsDK4d8WAjXthMAu", "user": {"username": "elifland"}}, {"_id": "FZAWYCn5gvF83JrXh", "postedAt": "2022-11-12T19:34:08.594Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p><a href=\"https://archive.ph/zfqYl\">Archived version</a> (that gets around the paywall)</p>", "parentCommentId": "mPD8JrAnxAeLwezKN", "user": {"username": "Milan_Griffes"}}, {"_id": "L5fQ55vAEutn54JR5", "postedAt": "2022-11-12T19:35:21.687Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>My $0.02 - (almost) the entire financial and crypto world, including many prominent VC funds that invested in FTX directly seem to have been blindsided by the FTX blowup. So I'm less concerned about the ability to foresee that. However the 2018 dispute at Alameda seems like good reason to be skeptical, and I'm very curious what what was known by prominent EA figures, what steps they took to make it right and whether SBF was confronted about it before prominent people joined the future fund etc.</p>\n", "parentCommentId": "3ZNGqJEpQSrDuRpSu", "user": {"username": "Asa Cooper Stickland"}}, {"_id": "sFmNQ8xuSubTGcr2D", "postedAt": "2022-11-12T19:54:05.785Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>Relatedly, I think a focus on ends-justify-the-means reasoning is potentially misguided because it seems super clear in this case that, even if we put zero intrinsic value on integrity, honesty, not doing fraud, etc., some of the decisions made here <strong>were pretty clearly very negative expected-value</strong>. We should expect the upsides from acquiring resources by fraud (again, if that is what happened) to be systematically worth much less than reputational and trustworthiness damage our community will receive by virtue of motivating, endorsing, or benefitting from that behavior.</p>\n", "parentCommentId": "rg5ZAbzFwzwJ2YL22", "user": {"username": "Cullen_OKeefe"}}, {"_id": "e2CxrJALa6hAJAKzq", "postedAt": "2022-11-12T20:02:30.951Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>Will, I highly recommend reading the books <a href=\"https://www.amazon.co.uk/Master-His-Emissary-Divided-Western/dp/0300245920/ref=sr_1_1?crid=3TMCD4YFW2852&amp;keywords=the+master+and+his+emissary+by+iain+mcgilchrist&amp;qid=1668281147&amp;sprefix=the+master+and+his+em%2Caps%2C294&amp;sr=8-1\">The Master and His Emissary </a>and <a href=\"https://www.amazon.co.uk/Matter-Things-Brains-Delusions-Unmaking/dp/1914568060/ref=sr_1_1?crid=EB7ZJ4SSYYT1&amp;keywords=the+matter+with+things+iain+mcgilchrist&amp;qid=1668281210&amp;sprefix=The+matter+with+%2Caps%2C256&amp;sr=8-1\">The Matter with Things</a>, both written by the psychiatrist Iain McGilchrist. The books are rigorous, and have been praised by many of the world's leading psychiatrists and experts in hemispheric specialization. These books could have told you that EA was destined to fail from the beginning. Here's the blurb for the first of these books:</p><blockquote><p>Why is the brain divided? The difference between right and left hemispheres has been puzzled over for centuries. Drawing upon a vast body of brain research, the renowned psychiatrist, author, and thinker Iain McGilchrist reveals that the difference between the two sides is profound―two whole, coherent, but incompatible ways of experiencing the world. The detail-oriented left hemisphere prefers mechanisms to living things and is inclined to self-interest, while the right hemisphere has greater breadth, flexibility, and generosity.<br><br>In the second part of his book, McGilchrist takes the reader on a journey through the history of Western culture, illustrating the tension between these two worlds as revealed in the thought and belief of thinkers and artists from the ancient to the modern, from Aeschylus to Magritte. He ultimately argues that, despite its inferior grasp of reality, the left hemisphere is increasingly taking precedence in today’s world―with potentially disastrous consequences.</p></blockquote><p>Reading these books makes it clear that the downfall of EA was predictable, has historical precedent, and has a clear neurological basis. The tools of EA (standardized epistemic rules, forecasting, and so on) cannot save us, because the EA community has made a point of consistently relying on the least reliable and least insightful hemisphere of our brains.</p><p>I know that this may sound wacky, but I really, really, <i>really</i> strongly recommend reading these books. They will bring everything into focus, and make what went wrong look painfully obvious. Here is a short <a href=\"https://www.youtube.com/watch?v=dFs9WO2B8uI\">YouTube video</a> that gives a short summary of the ideas in the first book, if you are interested (though the YouTube video is no substitute for actually reading the book).</p><p>And <a href=\"https://www.youtube.com/watch?v=MDHJDKPeB2A\">here is a talk</a> by V.S. Ramachandran that discusses hemispheric specialization. <a href=\"https://en.wikipedia.org/wiki/V._S._Ramachandran\">Ramachandran</a> is one of, if not <i>the </i>world's leading neuroscientists (who, by the way, speaks highly of McGilchrist's work). Again, watching Ramachandran's talk is no substitute for reading McGilchrist's books. But it will be enough to show you just how wacky an over-reliance on the left hemisphere can get, which should be enough to at least pique your interest.</p><p>Best of luck, Will.</p>", "parentCommentId": null, "user": null}, {"_id": "xvFxcf7MC2GvRckBE", "postedAt": "2022-11-12T20:16:09.506Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>Thanks for posting this, Dean. Just commenting because it aligns really well with everything I am feeling too.&nbsp;</p>", "parentCommentId": "cKbbBz8ffRcDBeSkw", "user": {"username": "Lauren Maria"}}, {"_id": "rQsXhFzbdWmHQPJtT", "postedAt": "2022-11-12T20:30:51.128Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>One specific question I would want to raise is whether EA leaders involved with FTX were aware of or raised concerns about non-disclosed conflicts of interest between Alameda Research and FTX.</p><p>For example, I strongly suspect that EAs tied to FTX knew that SBF and Caroline (CEO of Alameda Research) were romantically involved (I strongly suspect this because I have personally heard Caroline talk about her romantic involvement with SBF in private conversations with several FTX fellows). Given the pre-existing concerns about the conflicts of interest between Alameda Research and FTX (<a href=\"https://beincrypto.com/questions-of-propriety-arise-over-links-between-ftx-and-alameda-research/\">see</a> <a href=\"https://twitter.com/fintechfrank/status/1591459126047133696\">examples</a> <a href=\"https://www.pymnts.com/cryptocurrency/2022/bankman-frieds-stake-in-quant-trading-firm-raises-conflict-questions/\">such</a> <a href=\"https://moguldom.com/419908/top-crypto-trader-sam-trabucco-resigns-from-alameda-could-us-regulators-be-eying-the-mixing-of-trading-and-ftx-brokerage/\">as</a> <a href=\"https://coinyuppie.com/from-alameda-to-ftx-to-elaborate-on-the-two-or-three-things-of-sbf-and-the-encryption-industry/\">these</a>), if this relationship were known to be hidden from investors and other stakeholders, should this not have raised red flags?&nbsp;</p>", "parentCommentId": "3ZNGqJEpQSrDuRpSu", "user": {"username": "Tamay"}}, {"_id": "2t44jqobbCqjBPJwK", "postedAt": "2022-11-12T20:45:43.111Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>Please someone explain to me, how the information publicly available years ago did not clearly indicate this was a fraud risk , as before starting FTX SBF engaged in the Kimchi Premium, or arbitrage on South Korean and perhaps Japanese exchanges ? South Korean authorities may have a word to say about that, considering that such arbitrage was as illegal then as it is now, and SBF used a EA cutout to carry it out.&nbsp;</p><p>&nbsp;</p><p>How did the Goodwill MacAskill says existed with SBF originate, and what was the &nbsp;breaking point and limits defined? There is much more explaining to do here than pointing out at passages of your recent book I am afraid.&nbsp;</p>", "parentCommentId": null, "user": {"username": "cookiecut"}}, {"_id": "WJGkQtZCbiR7hYKGE", "postedAt": "2022-11-12T21:03:10.256Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>Will:</p><p>One item that should be a part of your reflections in the days and months to come is whether you are fit to be the public face of the effective altruism movement, given your <a href=\"https://forum.effectivealtruism.org/posts/xafpj3on76uRDoBja/the-ftx-future-fund-team-has-resigned-1?commentId=GoDd83K7ipktDtWWs\">knowledge of Sam's unethical behavior in the past</a>, <a href=\"https://twitter.com/KerryLVaughan/status/1591508717241077766?s=20&amp;t=ug8B2LpXRHiX1k9Q2lFAyA\">ties to him going back to 2013</a>, and your<a href=\"https://twitter.com/KerryLVaughan/status/1591508700128313344?s=20&amp;t=ug8B2LpXRHiX1k9Q2lFAyA\"> history of vouching for Ben Delo</a>, another disgraced crypto billionaire.</p><p>The EA community has many excellent people - including many highly capable women - who are uninvolved in this scandal and could step up to serve in this capacity.</p>", "parentCommentId": null, "user": {"username": "Kerry_Vaughan"}}, {"_id": "w9waXs8znModHob4x", "postedAt": "2022-11-12T21:36:32.615Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>I am glad you felt okay to post this - being able to criticise leadership and think critically about the actions of the people we look up to is extremely important.</p><p>I personally would give Will the benefit of the doubt of his involvement in/knowledge about the specific details of the FTX scandal, but as you pointed out the fact remains that he and SBF were friends going back nearly a decade.</p><p>I also have questions about Will Macaskill's<a href=\"https://www.nytimes.com/2022/10/08/business/effective-altruism-elon-musk.html\"> ties with Elon Musk</a>, his <a href=\"https://www.theatlantic.com/technology/archive/2022/10/sam-bankman-fried-crypto-ftx-2022-midterms/671823/\">introduction of SBF to Elon Musk</a>, his willingness to <a href=\"https://www.businessinsider.com/sam-bankman-fried-guru-texted-elon-musk-helping-buy-twitter-2022-9?r=US&amp;IR=T\">help SBF put up to 5 billion dollars towards the acquisition of Twitter</a> alongside Musk, and the lack of engagement with the EA community about these actions. We talk a lot about being effective with our dollars and there are so many debates around how to spend even small amounts of money (eg. at EA events or on small EA projects), but it appears that helping SBF put up to 5 billion towards Twitter to buy in with a billionaire who recently <a href=\"https://www.politico.com/news/2022/11/07/elon-musk-independents-vote-republican-midterms-twitter-00065412\">advocated voting for the Republican party in the midterms</a> didn't require &nbsp;that same level of discussion/evaluation/scrutiny. (I understand that it wasn't Will's money and possibly SBF couldn't have been talked into putting it towards other causes instead, but Will still made the introduction nonetheless.)</p>", "parentCommentId": "WJGkQtZCbiR7hYKGE", "user": {"username": "S.E. Montgomery"}}, {"_id": "8BeHcavP8xYELCs2M", "postedAt": "2022-11-12T23:15:51.888Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>I thank you for apologizing publicly and loudly. I imagine that you must be in a really tough spot right now.&nbsp;<br><br>I think I feel a bit conflicted on the way you presented this.&nbsp;<br><br>I treat our trust in FTX and dealings with him as bureaucratic failures. Whatever measures we had in place to deal with risks like this weren't enough.<br><br>This specific post reads a bit to me like it's saying, \"We have some blog posts showing that we said these behaviors are bad, and therefore you could trust both that we follow these things and that we encourage others to, even privately.\" I'd personally prefer it, in the future, if you wouldn't focus on the blog posts and quotes. I think they just act as very weak evidence, and your use makes it feel a bit like otherwise.<br><br>Almost every company has lots of public documents outlining their commitments to moral virtues.&nbsp;</p><p>I feel pretty confident that you were ignorant of the fraud. I would like there to be more clarity of what sorts of concrete measures were in place to prevent situations like this, and what measures might change in the future to help make sure this doesn't happen again.&nbsp;<br><br>There might also be many other concrete things that could be done to show your (and other senior people's) care about these values.&nbsp;<br><br>Again, I appreciate the words, but if there's one thing that the recent scandal taught us, it's that it's hard to take much from words. I don't blame you here - but I would like us to have a culture where EAs can focus on evidence of credibility that's much more high-signal than a list of previous altruistic writings.&nbsp;<br><br>All that said, I imagine that more rigorous evidence here will take more time.</p>", "parentCommentId": null, "user": {"username": "oagr"}}, {"_id": "kMArg5vRZbLamZoWG", "postedAt": "2022-11-12T23:27:48.615Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>Is the romantic relationship that big a deal? They were known to be friends and colleagues + both were known to be involved with EA and FTX future fund, and I thought it was basically common knowledge that Alameda was deeply connected with FTX as you show with those links - it just seems kind of obvious with FTX being composed of former Alameda employees and them sharing an office space or something like that.</p>\n", "parentCommentId": "rQsXhFzbdWmHQPJtT", "user": {"username": "Asa Cooper Stickland"}}, {"_id": "hE4jqDXFpxhKwdmkv", "postedAt": "2022-11-12T23:53:47.535Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>Sure, and what is your point?</p><p>My current best guess is that WM quite reasonably understood FTX to be a crypto exchange with a legitimate business model earning money from fees - just like the rest of the world also thought. The fact that FTX was making trades with depositor funds was very likely to be a closely kept secret that no one at FTX was likely to disclose to an outsider. Why the hell would they - it's pretty shady business!</p><p>Are you saying WM should have demanded to see proof that FTX's money was being earned legitimately, even if he didn't have any reason to believe it might not be? This seems to me like hindsight bias. To give an analogy - have you ever asked an employer of yours for proof that their activities aren't fraudulent?</p>", "parentCommentId": "gnL5kyqmxmZ3pPvn9", "user": {"username": "jackmalde"}}, {"_id": "3EKwTmmgyL2MrNSAB", "postedAt": "2022-11-13T00:00:27.133Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<blockquote><p>and probably not fraudulent businesses (even in crypto - Binance,</p></blockquote><p>I'm gonna wait it out on this one.</p>", "parentCommentId": "myh5uAYnCbP9NXu6T", "user": {"username": "Lukas_Gloor"}}, {"_id": "kStcca9bKZ4hCGp64", "postedAt": "2022-11-13T00:04:00.282Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<blockquote><p>How concerned were you about crypto generally being unethical?</p></blockquote><p>Also to add to that, whether or not crypto is in itself ethical its known to be a very unstable sector and one with a particularly negative reputation. Was there any discussion of how to compensate for that potential volatility, and of potential reputational risks of being associated?&nbsp;</p>", "parentCommentId": "cKbbBz8ffRcDBeSkw", "user": {"username": "projectionconfusion"}}, {"_id": "Cv7LHAgRrpEjXwgAj", "postedAt": "2022-11-13T00:08:26.810Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>+1, I think people are applying too much hindsight here.* The main counter consideration: To the degree that EAs had info that VCs didn't have, it should've made us do better.&nbsp;<br><br>*It's still important to analyze what went wrong and learn from it.</p>", "parentCommentId": "L5fQ55vAEutn54JR5", "user": {"username": "Lukas_Gloor"}}, {"_id": "QZJHH6ggWQjQh6yx3", "postedAt": "2022-11-13T00:16:07.257Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<blockquote><p>Almost every company has lots of public documents outlining their commitments to moral virtues.</p></blockquote><p>EA posts are very unlike company virtue statements. They include philosophical arguments (at least some of screenshots and linked posts do). I agree that there's more that can (and maybe should) be said, but I think linking to extensive discussion of naive/act utilitarianism vs. <a href=\"https://www.philosophyetc.net/2009/10/ord-on-global-consequentialism.html\">global consequentialism</a>, ethical injunctions, etc., is a great way to show that EAs have seriously engaged with these topics and come down pretty decisively on one side of it.</p>", "parentCommentId": "8BeHcavP8xYELCs2M", "user": {"username": "Lukas_Gloor"}}, {"_id": "WcuBu7ckW8o7EuvrA", "postedAt": "2022-11-13T00:17:18.876Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>These are great points and poignant question. My only disagreement is that crypto is not a scam industry. It has one clear use-case, and that use case is to help criminals and criminal organizations stow away money far away from government oversight. (thanks to @geuss for pointing this out).</p>", "parentCommentId": "cKbbBz8ffRcDBeSkw", "user": {"username": "oivavoi"}}, {"_id": "vrZcGHExPbKJh7nuv", "postedAt": "2022-11-13T00:31:11.019Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>Eh, let's not overrate how much abstract arguments actually work to achieve their goals. Now the broader EA sphere has responded surprisingly well, but we need to move beyond abstract words, and instead focus more on what they actually do.</p>\n", "parentCommentId": "QZJHH6ggWQjQh6yx3", "user": {"username": "Sharmake"}}, {"_id": "jaCgrJH5sXpYBLdeg", "postedAt": "2022-11-13T00:37:43.630Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>+1 on this. It is painfully clear that we need to radically improve our practices relating to due diligence moving forward.</p>", "parentCommentId": "mNdPE6RxQm5J9eXnm", "user": {"username": "Yitz"}}, {"_id": "FhEXB7y2bH5PtgtWP", "postedAt": "2022-11-13T00:43:23.703Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<blockquote><p>I personally would give Will the benefit of the doubt of his involvement in/knowledge about the specific details of the FTX scandal</p></blockquote><p>Of course. This reads as almost bizarre: it would be a baby-eater-type conspiracy theory to think that Will (or anyone else in EA leadership) knew about this. &nbsp;That's just not how things work in the world. The vast majority of people at Alameda/FTX didn't know (inner circle may have been as small as four). I mean, maybe there's a tiny chance that Sam phoned up someone a week ago and wanted a billion in secret, but you can see how ridiculous that sounds. I mean picture the conversation: \"Hey [EA leader], turns out I fucked up. Can you wire me a billion? You're down with me secretly trading with customer funds, right?\"<br><br>In any case, I think that isn't Kerry's point. The point isn't \"Did Will know about concrete fraud,\" but rather, \"Was there reason to think fraud is unusually likely? And if so, did people take the types of precautions that you'd want to take if you thought you were dealing with someone capable of doing shady things?\"</p><p>For comparison, think of Zuckerberg. If the Social Network movie is roughly accurate, then Zuckerberg acted in utterly despicable and unethical ways, lying to the Winklevoss twins repeatedly and stealing their idea (and then screwing over the guy played by Justin Timberlake). So anyone aware of this would've been faced with the choice to (1) not trust him at all and not invest in facebook or associate with him; (2) trust him like you'd trust any nice-seeming person without a suspicious history; (3) try to talk to him (e.g., give feedback, try to lecture or mentor, etc.) about how that was unacceptable, ask for concrete ways for him to change, maybe use leverage you have to set up good governance structures and accountability procedures or at least nudge things that way, etc. I'd say (2) is clearly stupid and immoral. (3) might be defensible depending on one's judgment call (and subsequent execution), and (1) can certainly be appropriate. In the case of facebook, I don't know if Zuckerberg got any feedback from anyone or how facebook set up its board or accountability procedures, but it <i>looks like</i>, <i>so far</i>, that Zuckerberg never ended up doing anything crazy illegal that destroyed billions in value. (Though maybe some would argue that social media isn't good for the world and that other inventors could maybe have taken more precautions to make it less bad.)</p>", "parentCommentId": "w9waXs8znModHob4x", "user": {"username": "Lukas_Gloor"}}, {"_id": "iZJqRp2rKBNZgxnjv", "postedAt": "2022-11-13T00:47:38.147Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<blockquote><p>It could have easily been the most consequential thing EAs have ever done and there has - to my knowledge- never been a thorough EA debate that signalled that this would be a good idea.</p></blockquote><p>I don't think EAs should necessary require a community-wide debate before making major decisions, including investment decisions; sometimes decisions should be made fast, and often decisions don't benefit a ton from \"the whole community weighs in\" over \"twenty smart advisors weighed in\".</p><p>But regardless, seems interesting and useful for EAs to debate this topic so we can form more models of this part of the strategy space -- maybe we should be doing more to positively affect the world's public fora. And I'd personally love to know more about Will's reasoning re Twitter.</p>", "parentCommentId": "vZJ8dKhuZdYvQRndx", "user": {"username": "RobBensinger"}}, {"_id": "LdN2XthJCo3wY93Lb", "postedAt": "2022-11-13T00:50:56.733Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>What do you mean, this community is largely composed of people who do really weird things in their day job based on abstract arguments.&nbsp;</p>", "parentCommentId": "vrZcGHExPbKJh7nuv", "user": {"username": "Lukas_Gloor"}}, {"_id": "pdMCix6tPqRNMSxi9", "postedAt": "2022-11-13T00:57:01.180Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>I agree with Lukas, though I also suspect this was mostly a failure of bureaucracy / competence / a few individuals' moral character, rather than a failure that has much connection to EA ideology. I expect we'll have more clarity on that later, as facts come to &nbsp;light.</p>", "parentCommentId": "QZJHH6ggWQjQh6yx3", "user": {"username": "RobBensinger"}}, {"_id": "bck6GhsuhcEGHqPxn", "postedAt": "2022-11-13T01:01:41.286Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>Thanks for verifying that for me.</p>\n", "parentCommentId": "LdN2XthJCo3wY93Lb", "user": {"username": "Sharmake"}}, {"_id": "AQ3JdRtoPeLjJ85H3", "postedAt": "2022-11-13T01:13:21.724Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>I'd prefer that the discussion focus on more concrete, less PR-ish things than questions of who is \"fit to be the public face of the effective altruism movement\". The latter feels close to saying that Will isn't allowed to voice his personal opinions in public if EAs think he fucked up.</p><p>I'd like to see EA do less PR-based distancing itself from people who have good ideas, and also less signal-boosting of people for reasons orthogonal to their idea quality (and ability to crisply, accurately, and honestly express those ideas). Think less \"activist movement\", more \"field of academic discourse\".</p>", "parentCommentId": "WJGkQtZCbiR7hYKGE", "user": {"username": "RobBensinger"}}, {"_id": "sqoejL8DAytSEqp7n", "postedAt": "2022-11-13T01:21:00.885Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>Is Ben Delo a \"disgraced crypto billionaire\"? From <a href=\"https://twitter.com/Jess_Riedel/status/1590819196858163200\">Jess Riedel's description</a>, it wasn't obvious to me whether the thing BitMEX got fined for was something seriously evil, versus something closer to \"overlooked a garden-variety regulation and had to go pay a fine, as large businesses often do\".</p><p>(Conflict-of-interest notice: I work for MIRI, which received money from Open Phil in 2020 that came in part from Ben Delo.)</p>", "parentCommentId": "WJGkQtZCbiR7hYKGE", "user": {"username": "RobBensinger"}}, {"_id": "7Cso7kdpofcPdhbBG", "postedAt": "2022-11-13T01:52:39.769Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>Thanks for your response. On reflection, I don't think I said what I was trying to say very well in the paragraph you quoted, and I agree with what you've said.</p><p>&nbsp;My intent was not to suggest that Will or other FTX future fund advisors were directly involved (or that it's reasonable to think so), but rather that there may have been things the advisors chose to ignore, such as Kerry's mention of Sam's unethical behaviour in the past. Thus, we might think that either Sam was incredibly charismatic and good at hiding things, or we might think there actually were some warning signs and those involved with him showed poor judgement of his character (or maybe some mix of both).&nbsp;</p>", "parentCommentId": "FhEXB7y2bH5PtgtWP", "user": {"username": "S.E. Montgomery"}}, {"_id": "koxg7FSuabt85vfYM", "postedAt": "2022-11-13T01:54:26.137Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>I'd currently wildly guess that Coinbase is not a fraud.</p>", "parentCommentId": "3EKwTmmgyL2MrNSAB", "user": {"username": "EliezerYudkowsky"}}, {"_id": "bYhKX5WpQKQtJbNYf", "postedAt": "2022-11-13T02:00:51.706Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>I believe that, even in the face of this particular disaster, who EAs are fucking is none of EA's business. &nbsp;There are very limited exceptions to this rule like \"maybe don't fuck your direct report\" or \"if you're recommending somebody for a grant, whom you have fucked, you ought to disclose this fact to the grantor\" or \"Notice when somebody in a position of power seems to be leaving behind a long trail of unhappy people they've fucked\", plus of course everything that shades over into harrassment, assault, and exploitation - none of which are being suggested here.</p><p>Outside of that, there's a heck of a lot of people in this world fucking a heck of a lot of other people; <i>most </i>people who are fucking don't blow up depository institutions; and controls and diligence on depository institutions should achieve reliability by some avenue other than checking which people are fucking. &nbsp;And I consider it generally harmful for a community to think that it has a right to pass judgment on fucking that is not like really clearly violating deontology. &nbsp;That's not something that community members owe to a community.</p>", "parentCommentId": "rQsXhFzbdWmHQPJtT", "user": {"username": "EliezerYudkowsky"}}, {"_id": "WuexMfaZk3Xp8HZ9A", "postedAt": "2022-11-13T02:12:31.797Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>[Edit: I have a reply to this in the comments]<br><br>I think it's nice, but I also think we should be raising the bar of the evidence we need to trust people.&nbsp;<br><br>SBF and the inner FTX crew seemed very EA. SBF had a utilitarian blog<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefp7rjnhegow9\"><sup><a href=\"#fnp7rjnhegow9\">[1]</a></sup></span>&nbsp;that I thought was pretty good (for the time, it was ~2014).<br><br>He repeatedly spoke about how important it was for crypto exchanges to not do illegal activity. He even actively worked to regulate the industry.<br><br>I'd bet that SBF spent a lot more effort speaking and advocating about the importance of trustworthiness in crypto, then perhaps any of us on the importance of trust and regularly-good moral principles.<br><br>Sam literally <a href=\"https://www.youtube.com/watch?v=F_kZELcynKQ\">argued for trust and accountability to congress</a>.<br><br>From what I understand, he was the poster boy for what trustworthy crypto looks like.<br><br>We at very least could really use measures that would have caught a SBF-lite.&nbsp;<br><br>&gt; EA posts are very unlike company virtue statements.<br><br>Sure, but SBF definitely got through. I'm sure any of his co-conspirators also would have. &nbsp;EA-adjacent people an clearly fool EAs using these sorts of methods.<br><br>(I considered raising this issue more in the first post, but am happy to add it now that there's push-back.)</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnp7rjnhegow9\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefp7rjnhegow9\">^</a></strong></sup></span><div class=\"footnote-content\"><p>I can't find the blog now, and wouldn't be surprised if it were no longer online. It's possible I'm misremembering. I remember the blog having like ~6 posts or so, in around 2014. If anyone else has a link, it seems valuable to share it.</p></div></li></ol>", "parentCommentId": "QZJHH6ggWQjQh6yx3", "user": {"username": "oagr"}}, {"_id": "5bk7GnhxSBtXwHei7", "postedAt": "2022-11-13T02:34:09.946Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>First of all, this language is wildly unhelpful, even outside of the current situation.</p><p>Secondly, this isn’t close to true, and shows ignorance and blasé disregard for a wide range of social and power structures in the real world, such as corporate environments. This is not some leftist social justice statement. Even before the #metoo era, there's a vast range of sexual conduct that wouldn't be acceptable for a middle/senior leader.</p><p>Finally, you, Eliezer Yudkowsky, are a major part of the problem, with EA, as you put it. Your intellectual contributions are poorly regarded in the real world and across EA. This is not a “sneerclub” view, but by open minded outsiders, and senior EAs across all cause areas. Even in a full AI safety worldview, your recent views/contributions on AI safety have not been positive, and would have been an issue to work around, even without the changes in longtermist funding.</p><figure class=\"image\"><img src=\"https://lh4.googleusercontent.com/h7QzwDIUu4iEOMSZE1muPsoLpneJl5WKIsGOGyrgs1e7DOui3GZNh01glt3RP8TMQUVxUsd9NoyhsnFyQO_Cb5YyC8yp-3Dhk4ZXz3SW9XaAYV4iuoZGHSZoo6GcKu6PNHX2S30mAjqhMo2L1zL_IXzXlG4_LbAD46zXVXova3kD5UVDqpLh817-e-oM0g\"></figure><p>As a heterosexual male who has interacted with many female EAs, I almost never consider any sort of romantic and sexual relationship with any female EA, and absolutely not junior. This is partially the consequence of past events due to misconduct of others, of which I am entirely innocent of. Many other male EAs have similar personal policies, for the same reasons.</p><p>As the public content above shows, it is not salacious to say that even this basic idea above is ignored by others. I have plausible reasons to believe this is costly, and I resent the cost the movement bears, carrying on like this, due to this kind of behavior.</p><p>&nbsp;</p><p>Note that this account is anonymous, but not because of a desire to communicate or criticize without retaliation, and my identity will be clear.<br>&nbsp;</p>", "parentCommentId": "bYhKX5WpQKQtJbNYf", "user": {"username": "Anonymous (for unimpressive reasons =[ )"}}, {"_id": "Y2niAnpYzrjpvyPzF", "postedAt": "2022-11-13T02:35:32.775Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>Thank you for writing this.<br><br>What do you think you/we could have done better? What should you/we have done differently? My sense is that the you were one of the key people who's job it was to ensure what Sam was doing was above board (I could be mistaken here). If that's the case, I'm surprised by a lack of discussion about what should have happened differently.</p><p>Likewise if there were no safeguards here, that seems startlingly naïve from us.</p>", "parentCommentId": null, "user": {"username": "nathan"}}, {"_id": "uMjfmBQs84gWJ9tuC", "postedAt": "2022-11-13T02:45:48.308Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>This statement has been downvoted and removed from view. I'm pretty skeptical that is helpful.</p>", "parentCommentId": "5bk7GnhxSBtXwHei7", "user": {"username": "Anonymous (for unimpressive reasons =[ )"}}, {"_id": "ndGQPKgLgkMq8cF3W", "postedAt": "2022-11-13T02:47:22.131Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>(Edit: I think now that I misread this a bit: I think this post is really meant as a hastily-written update, not a well-reasoned apology. I would appreciate just a head's up that a longer doc is coming.)&nbsp;<br><br>I think one issue I have is that this post seems to be doing a few things at once, and it's not very clear to me.<br><br>1. Publicly apologize for what happened<br>2. Re-affirm to those viewing this that doing things like fraud are not publicly endorsed by EA leadership<br>3. Outline Will's involvement in the situation and describe who was responsible for it<br>4. Make it clear that Will wasn't involved in the bad parts of the scandal, and can be trusted in the future<br><br>This post came from a Twitter thread. It seems like it was hastily written.<br><br>I don't think this post does a great job at all points. It seems likely to me that it wasn't meant to.<br><br>If this post is meant to be the best public statement of all 4 things, I would really like that to be made clear.&nbsp;</p>", "parentCommentId": "8BeHcavP8xYELCs2M", "user": {"username": "oagr"}}, {"_id": "7XvmazGm2T9mnPhY5", "postedAt": "2022-11-13T02:51:51.716Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>Indeed, even by 2019, anyone who took a cursory look at Alameda's materials would have known that they were engaged in Ponzi schemes or something equally fraudulent.</p><p>See <a href=\"https://twitter.com/DylanLeClair_/status/1591521505464455168\">https://twitter.com/DylanLeClair_/status/1591521505464455168</a>&nbsp;</p><p>As you can see in that Twitter thread, Alameda was promising a guaranteed 15% rate of return on investments, with \"no downside.\" This is impossible. Only the likes of Bernie Madoff would pretend to have a risk-free return at that level. And the materials look so amateurish (with a number of grammatical errors) that the person posting on Twitter originally thought it was \"so egregious my first thought was that it was fake.\"</p><p>This was fairly close to the time of Alameda's founding. As of 2019, how much were CEA folks (including Will and Tara) involved with Alameda's obvious fraud?&nbsp;</p>", "parentCommentId": "mPD8JrAnxAeLwezKN", "user": {"username": "Stuart Buck"}}, {"_id": "9HtnXG5gvB59PyuwE", "postedAt": "2022-11-13T03:07:00.286Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>This statement is incredibly out of touch Eliezer. If CEO #1 and CEO #2 are in a romantic relationship, there is a clear conflict of interest here, especially when not disclosed to the public. In agreement with Anonymous, I &nbsp;also strongly oppose the language you're using. I also agree with their comments regarding romantic relationships in the workplace. My general stance is 0 tolerance for workplace romance because it's messy and there are far too many power dynamics at play.&nbsp;</p>", "parentCommentId": "bYhKX5WpQKQtJbNYf", "user": {"username": "Lauren Maria"}}, {"_id": "weuawGnuS8Jfdw4BC", "postedAt": "2022-11-13T03:31:06.760Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>Note that <a href=\"https://forum.effectivealtruism.org/posts/WdeiPrwgqW2wHAxgT/a-personal-statement-on-ftx?commentId=5bk7GnhxSBtXwHei7\">my comment</a> is not policing or calling out private actual interpersonal conduct and seems well justified given the parent comment, as well as the wide range of topics discussed. A week ago, I think we all know that I would be voted down for factual, but off-color statements about SBF's business practices.</p><p>&nbsp;</p><figure class=\"image\"><img src=\"https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/5dcb9328eaff28f44b87b9a62198d3e609660c6187f9f0ef.png\" srcset=\"https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/5dcb9328eaff28f44b87b9a62198d3e609660c6187f9f0ef.png/w_112 112w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/5dcb9328eaff28f44b87b9a62198d3e609660c6187f9f0ef.png/w_192 192w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/5dcb9328eaff28f44b87b9a62198d3e609660c6187f9f0ef.png/w_272 272w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/5dcb9328eaff28f44b87b9a62198d3e609660c6187f9f0ef.png/w_352 352w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/5dcb9328eaff28f44b87b9a62198d3e609660c6187f9f0ef.png/w_432 432w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/5dcb9328eaff28f44b87b9a62198d3e609660c6187f9f0ef.png/w_512 512w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/5dcb9328eaff28f44b87b9a62198d3e609660c6187f9f0ef.png/w_592 592w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/5dcb9328eaff28f44b87b9a62198d3e609660c6187f9f0ef.png/w_672 672w\"></figure><p>&nbsp;</p><p>Now, here, I make the additional, specific accusation that the existence of Eliezer Yudkowsky as a major public figure in EA is out of proportion to his contributions or his popularity in EA, and is partially supported by de facto organized coordination by a group of people on the LessWrong and Effective Altruism forums.</p><p>That is, my comment has been shared on say, private FB groups, Slack, Discord servers with the expected aim of managing this content.</p><p>I encourage examination of the view/vote graph and the origin of view/votes for my comment and possibly other content.</p><p>I am not attacking the cultures, views to help the world or ways of interpersonal relationships of people close to Eliezer. I do not want Eliezer to be harmed, or reduce his agency to contribute in the ways he wants to.</p>", "parentCommentId": "uMjfmBQs84gWJ9tuC", "user": {"username": "Anonymous (for unimpressive reasons =[ )"}}, {"_id": "twPxJufGfyRbqRLeF", "postedAt": "2022-11-13T03:34:07.706Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>Perhaps the ditch the \"Your intellectual contributions are poorly regarded\" thread; at best, it is unsupported &amp; off-topic</p>\n", "parentCommentId": "uMjfmBQs84gWJ9tuC", "user": {"username": "John_Maxwell_IV"}}, {"_id": "sJhhmLH2gphoknJqe", "postedAt": "2022-11-13T03:40:57.951Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>As a Bloomberg article put it in September: <a href=\"https://www.pymnts.com/cryptocurrency/2022/bankman-frieds-stake-in-quant-trading-firm-raises-conflict-questions/\">https://www.pymnts.com/cryptocurrency/2022/bankman-frieds-stake-in-quant-trading-firm-raises-conflict-questions/</a></p><blockquote><p>Alameda’s position as a major market maker on FTX, profiting on the spread between buying and selling prices, puts it in a position to have a potential conflict of interest with FTX, which gets its revenue from transaction fees and margin loans to traders.</p><p>And while the firm’s executives, and Bankman-Fried, say there is a strong firewall between the two — something that, Bloomberg correctly notes, no one has actually said or even suggested has been breached — concerns about the potential for such conflicts of interest are growing as the size and activity of Alameda gains more attention.</p></blockquote><p>Are you trying to suggest that when two firms need to be at arms-length because of the potential for an enormous conflict of interest, it wouldn't matter if the two firms' chief executives were dating each other?</p>", "parentCommentId": "bYhKX5WpQKQtJbNYf", "user": {"username": "Stuart Buck"}}, {"_id": "wkKy24utxwD2Aj548", "postedAt": "2022-11-13T03:52:02.793Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>I'm saying that if your clearance process is unable to tell whether or not two firms are arms-length, when they have a great deal to potentially gain from illegally interoperating, without the further piece of info about whether the CEOs are dating, you're screwed. &nbsp;This is like trying to fix the liar loan problem during the mortgage meltdown by asking whether the loan issuer is dating the loan recipient. &nbsp;The problem is not that, besides the profit motive, two people might also be fond of each other and that's terrible; the problem is if your screening process isn't enough to counterbalance the profit motive. &nbsp;A screening process that can make sure two firms aren't colluding to illegally profit should not then break down if the CEOs go on a date.</p><p>Or to put it more compactly and specifically: &nbsp;Given the potential energy between Alameda and FTX as firms, not to mention their other visible degrees of prior entanglement, you'd have to be nuts to rely on an assurance process that made a big deal about whether or not the CEOs were dating.</p>", "parentCommentId": "sJhhmLH2gphoknJqe", "user": {"username": "EliezerYudkowsky"}}, {"_id": "PProZXz6jmfTgTnpn", "postedAt": "2022-11-13T05:19:32.101Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<blockquote>\n<p>I believe that, even in the face of this particular disaster, who EAs are fucking is none of EA's business.  There are very limited exceptions to this rule like \"maybe don't fuck your direct report\" or [...]</p>\n</blockquote>\n<p>Is the word \"maybe\" here just a style of writing? Should the EA community tolerate some cases in which person A is having sex with a person B who is a direct report of A (in an EA org)?</p>\n<p>I realize that inserting hedge words can allow one to publish things using much less time and energy (which can be a very good reason to insert hedge words).</p>\n", "parentCommentId": "bYhKX5WpQKQtJbNYf", "user": {"username": "ofer"}}, {"_id": "oi5LdpboBaAuF2BzE", "postedAt": "2022-11-13T05:32:07.694Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>Morale is low right now and senior EA figures are occupied and some have come under direct criticism, whether justified or not. In this environment, it's difficult to communicate or express leadership. Only the CEA community health team seems to be taking the initiative, which must be very difficult and this is heroic.</p><p>In this situation there is often gardening of the online space that tends to be performed by marginal actors. LW and MIRI has been left mostly unscathed by the FTX disaster, and now, Eliezer and Rob B (professional communicator employed by MIRI) are highly active. In the sense of advancing their cause, that's OK and natural. They are also helpful in tempering <a href=\"https://forum.effectivealtruism.org/posts/xafpj3on76uRDoBja/the-ftx-future-fund-team-has-resigned-1?commentId=GoDd83K7ipktDtWWs\">gardening attempts by other actors</a>.</p><p>Note that I don't think Eliezer's representations, such downplaying his interactions with FTX (he might have been a regrantor and was probably more actively jockeying/seeking money than it seems, which is understandable) and other statements are entirely truthful or disinterested.&nbsp;</p><p>More importantly, the low opinion of Eliezer's contributions is well known, relevant and should be communicated. <i>(The quality of his output and MIRI was considered low, which is why they received relatively little funding and were unscathed</i><span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnref005ztzryhrze7\"><sup><a href=\"#fn005ztzryhrze7\">[1]</a></sup></span><i>).&nbsp;</i></p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fn005ztzryhrze7\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnref005ztzryhrze7\">^</a></strong></sup></span><div class=\"footnote-content\"><p>The fact they were not funded by a bad person is not a sign of virtue or quality, to say this in \"LW speak\", see <a href=\"https://www.lesswrong.com/posts/qNZM3EGoE5ZeMdCRt/reversed-stupidity-is-not-intelligence\">Reversed Stupidity Is Not Intelligence</a>.</p></div></li></ol>", "parentCommentId": "twPxJufGfyRbqRLeF", "user": {"username": "Anonymous (for unimpressive reasons =[ )"}}, {"_id": "dKTgQFdLxfzY3R7XC", "postedAt": "2022-11-13T05:34:04.073Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>Because as somebody who could potentially be mistaken for a Leader I want to be pretty derned careful about laying down laws to regulate other people's sexuality; and while something like that would definitely be a red flag at, like, idk, CEA or MIRI, maybe it's different if we're talking about a 3-person startup. &nbsp;Maybe you'll say it's still ill-advised, but I don't know their circumstances and there's also a difference between ill-advised and Forbidden. &nbsp;I feel a lot more comfortable leaving out the 'maybe' when I pontificate my legislation about informing a donor that your recommended grantee is one with whom you've had a relationship - though even there, come to think, I'm relying on all the donors I ever talk to being sensible people who aren't going to go \"OH NO, PREMARITAL SEX\" about it.</p>", "parentCommentId": "PProZXz6jmfTgTnpn", "user": {"username": "EliezerYudkowsky"}}, {"_id": "H5i8T7wsfErHu88my", "postedAt": "2022-11-13T05:40:36.294Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>...I am confused and somewhat worried by the degree to which voters on this post seem to feel that it's not an important heuristic to try to construct your community regulatory process in a way that doesn't revolve around people's sex lives, except in so far as the sex itself is <i>per se</i> a bad thing (eg nonconsensual or under conditions where positive consent could not reasonably be determined).</p>", "parentCommentId": "bYhKX5WpQKQtJbNYf", "user": {"username": "EliezerYudkowsky"}}, {"_id": "EJZwQKE8FBNXvfZQy", "postedAt": "2022-11-13T05:42:50.704Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>I think this was downvoted in the first 10 seconds, I am bumping this so this gets read.</p>", "parentCommentId": "oi5LdpboBaAuF2BzE", "user": {"username": "Anonymous (for unimpressive reasons =[ )"}}, {"_id": "QQRNzuk9GFqzeLtDu", "postedAt": "2022-11-13T05:48:30.565Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>Maybe even more compactly: &nbsp;Any time two firms could gain a lot of financial free energy by colluding, just <i>pretend</i> you've been told their CEOs are dating, okay, and now ask what assurances or tests you want to run past that point.</p><p>...I think there must be some basic element of my <a href=\"https://www.lesswrong.com/posts/8gqrbnW758qjHFTrH/security-mindset-and-ordinary-paranoia\">security mindset</a> that isn't being shared with voters here (if they're not just a voting ring, a possibility that somebody else raised in comments), and I'm at somewhat of a loss for what it could be exactly. &nbsp;We're definitely not operating in the same frame here; the things I'm saying here sure feel like obvious good practices from inside my frame.</p><p>Taking prurient interest in other people's sex lives, trying to regulate them as you deem moral, is a classic easy-mode-to-fall-into of pontificating within your tribe, but it seems like an <i>absurd</i> pillar on which to rest the verification that two finance companies are not intermingling their interests. &nbsp;Being like \"Oh gosh SBF and Caroline were <i>dating,</i> how <i>improper</i>\" seems like finding this one distracting thing to jump on... which would super not be a key element of any correctly designed corporate assurance process about anything? &nbsp;You'd go <i>audit their books</i> and ask for proofs about crypto cold storage, not demand that somebody's romance be a dark secret that nobody got to hear about?</p><p>We sure are working in different frames here, and I don't understand the voters' (if they're not just a voting ring).</p>", "parentCommentId": "wkKy24utxwD2Aj548", "user": {"username": "EliezerYudkowsky"}}, {"_id": "p7FawdywRDuwAxoRx", "postedAt": "2022-11-13T06:29:24.042Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>It is extremely inaccurate to characterise the relationship between Bankman-Fried and Ellison as merely \"dating\", and that people are merely &nbsp;saying that this was \"improper\".</p><p>Bankman-Fried and Ellison were living together in a shared apartment. An unverified suggestion in one article suggests that Ellison may have been in some form of relationship with other residents of the apartment - residents who included the CTO and Director of Engineering of FTX.</p><p>If true, this is a genuinely alarming piece of information that would very obviously have caused anybody to question whether they should have placed their funds in the care of this specific group of people. However this information was not made public, and that lack of transparency is where the problem lies.</p>", "parentCommentId": "QQRNzuk9GFqzeLtDu", "user": {"username": "Paul Currion"}}, {"_id": "qiCLwF9EY2CG8TbHJ", "postedAt": "2022-11-13T06:29:28.305Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>The returns shown in the document are not indicative of fraud -- those sorts of returns are very possible when skilled traders deploy short-term trading strategies in inefficient markets, which crypto markets surely were at the time. &nbsp;The default risk when borrowing at 15% might have been very low, but not zero as they suggested. The \"no downside\" characterization should have been caught by a lawyer, and was misleading.&nbsp;</p><p><s>Nobody with an understanding of trading would have</s> [EDIT] I would not have concluded they were engaged in Ponzi schemes or were misrepresenting their returns based on the document. There are plenty of sloppy, overoptimistic startup pitch decks out there, but most of the authors of those decks are not future Theranoses.</p>", "parentCommentId": "7XvmazGm2T9mnPhY5", "user": {"username": "blonergan"}}, {"_id": "mokuFL6i72TxPJD8H", "postedAt": "2022-11-13T06:32:06.264Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>Not disagreeing with your overall point, but if my non-EA aligned, low-level crypto trader friend is any indication, then there certainly was reason to believe that SBF was at the very least doing some shady things. In August, I asked this friend for his thoughts on SBF, and this is what he replied:</p>\n<p>“He’s obviously super smart but comes across a bit evil while trying to portray the good guy front. His exchange is notorious for liquidating user positions, listing shit coins thats prices trend to zero. He also founded Alameda research (trading / market maker firm) alongside FTX (the exchange). Alameda are one of the biggest crypto trading firms with predatory reputation. There’s also the issue of barely any divide between the exchange and the trading firm so alameda likely sees a lot of exchange data that gives them an edge trading on FTX vs other users.”</p>\n<p>The irony is that this friend lost most of his savings because he was a FTX user.</p>\n", "parentCommentId": "hE4jqDXFpxhKwdmkv", "user": {"username": "vincho"}}, {"_id": "inbqnuLiTZ4tQBshB", "postedAt": "2022-11-13T06:44:37.890Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>Will,</p><p>Like others, I appreciate your openness about your role in the FTX debacle, no matter how limited that role was, and your readiness to consider seriously how this impacts your philosophy from the ground up. I am a long-time lurker on this forum who has a lot of admiration for the commitment shown to their cause by EA advocates, but who also has a lot of disregard for the politics of EA, which I consider to be frankly naive and inadequate to the actual nature of the problems EA seeks to address.</p><p>With regard to the collapse of FTX, it seems that only a handful people in the EA movement had a critique of wealth that would lead them to question whether the means by which Bankman-Fried acquired his wealth were entirely ethical, and (assuming that one agreed that those means were ethically questionable) whether the willingness of Bankman-Fried and his colleagues to use those means to create their wealth might lead them to make further questionable decisions in future.</p><p>I would be interested to hear from you or other EA advocates on this forum whether recent events have caused you to question not just whether Sam Bankman-Fried's behaviour in this instance was ethical, but more broadly whether the same events have caused any of you to reconsider your views about the ethical status of the super-wealthy in general, and what EA's collective view of such individuals should be. I recognise that my politics are probably not shared by most (if any!) contributors to this forum, but now might be a good time to have that conversation.</p>", "parentCommentId": null, "user": {"username": "Paul Currion"}}, {"_id": "WRfgBCxotRzSdCD9r", "postedAt": "2022-11-13T06:52:57.956Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>As of writing, I want to point out that Eliezer's comments, which are a probably strained digression to explain his original comment (and include speculation of a voting ring against him ???), has the following vote score.</p><figure class=\"image\"><img src=\"https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/5e573ca085c7376099739d93f5fe107b328616b9132181de.png\" srcset=\"https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/5e573ca085c7376099739d93f5fe107b328616b9132181de.png/w_90 90w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/5e573ca085c7376099739d93f5fe107b328616b9132181de.png/w_180 180w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/5e573ca085c7376099739d93f5fe107b328616b9132181de.png/w_270 270w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/5e573ca085c7376099739d93f5fe107b328616b9132181de.png/w_360 360w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/5e573ca085c7376099739d93f5fe107b328616b9132181de.png/w_450 450w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/5e573ca085c7376099739d93f5fe107b328616b9132181de.png/w_540 540w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/5e573ca085c7376099739d93f5fe107b328616b9132181de.png/w_630 630w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/5e573ca085c7376099739d93f5fe107b328616b9132181de.png/w_720 720w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/5e573ca085c7376099739d93f5fe107b328616b9132181de.png/w_810 810w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/5e573ca085c7376099739d93f5fe107b328616b9132181de.png/w_866 866w\"></figure><p>My comments below this have:</p><figure class=\"image\"><img src=\"https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/eeb92ea32f3a2e5b82740607e1c8bf74b655e3a81aa978d9.png\" srcset=\"https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/eeb92ea32f3a2e5b82740607e1c8bf74b655e3a81aa978d9.png/w_90 90w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/eeb92ea32f3a2e5b82740607e1c8bf74b655e3a81aa978d9.png/w_180 180w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/eeb92ea32f3a2e5b82740607e1c8bf74b655e3a81aa978d9.png/w_270 270w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/eeb92ea32f3a2e5b82740607e1c8bf74b655e3a81aa978d9.png/w_360 360w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/eeb92ea32f3a2e5b82740607e1c8bf74b655e3a81aa978d9.png/w_450 450w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/eeb92ea32f3a2e5b82740607e1c8bf74b655e3a81aa978d9.png/w_540 540w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/eeb92ea32f3a2e5b82740607e1c8bf74b655e3a81aa978d9.png/w_630 630w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/eeb92ea32f3a2e5b82740607e1c8bf74b655e3a81aa978d9.png/w_720 720w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/eeb92ea32f3a2e5b82740607e1c8bf74b655e3a81aa978d9.png/w_810 810w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/eeb92ea32f3a2e5b82740607e1c8bf74b655e3a81aa978d9.png/w_888 888w\"></figure><p>&nbsp;</p><p>This is not only not justifiable by content, this is literally suppressing criticism of a promoted EA figure on the EA forum.</p>", "parentCommentId": "EJZwQKE8FBNXvfZQy", "user": {"username": "Anonymous (for unimpressive reasons =[ )"}}, {"_id": "SzJdcrtiY2DAQr32x", "postedAt": "2022-11-13T07:52:46.133Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>I would have expected the opposite corner of the two axis voting (because I think people don't like the language)</p>\n", "parentCommentId": "H5i8T7wsfErHu88my", "user": {"username": "maxeonyx"}}, {"_id": "JXWD3RXjRjKmAdsxB", "postedAt": "2022-11-13T08:01:20.937Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>People who read this far seem to have upvoted</p>\n", "parentCommentId": "QQRNzuk9GFqzeLtDu", "user": {"username": "maxeonyx"}}, {"_id": "Y2hnxLyaiEdRubXiN", "postedAt": "2022-11-13T08:07:34.054Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>That's true. Crypto seems to have evolved from a convenient currency for criminals to a way for \"entrepreneurs\" to scam ordinary people.</p><p>None of them have the <a href=\"https://www.toppr.com/guides/business-economics-cs/money-and-banking/qualities-of-good-money/\">properties</a> of a good currency. Nor do they generate cash flow, so they aren't real investments. So in the best case, they are pure bubbles.&nbsp;</p><p>It is surprisingly easy to scam people into buying these economically worthless lines of code by simply repeating \"DeFi\", \"The Federal Reserve is evil\" (for some unexplained reason), \"You would have been a billionaire if you bought BitCoin in 2010\", \"Don't miss out\", \"It's the future\", \"Don't be a FUDer\".&nbsp;</p><p>This isn't enough for these greedy \"entrepreneurs\", so they have resorted to well-known financial scams. Ponzi Schemes (yield farming); Pump and Dump (most new cryptocurrencies); &nbsp;Pyramid Schemes (Web 3 \"jobs\"), and taking risky bets with deposits (FTX).</p><p>The result of all of this is that people waste their lives in an industry that can't produce anything economically valuable, huge amounts of energy are wasted, and financial resources that could be invested in productive businesses sit in worthless lines of code.</p><p>And of course, many ordinary hard-working people lose their life savings.</p><p>Banks, P2P platforms, listed corporations, Private Equity Firms and VCs all invest in potentially economically valuable enterprises that could generate cash flow. Mainstream finance isn't perfect, but crypto isn't the answer. The loss in economic growth from the underinvestment caused by crypto is potentially considerable.</p>", "parentCommentId": "WcuBu7ckW8o7EuvrA", "user": {"username": "Dean Abele"}}, {"_id": "udpBNoZjniatgtDj2", "postedAt": "2022-11-13T09:05:14.855Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>I agree that it is less likely than Binance, based on the fact that public stock market companies are required to be more transparent<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnref12oxjq3m4xw\"><sup><a href=\"#fn12oxjq3m4xw\">[1]</a></sup></span>, I do not know much about these particular companies.</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fn12oxjq3m4xw\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnref12oxjq3m4xw\">^</a></strong></sup></span><div class=\"footnote-content\"><p>&nbsp;of course Enron, Wirecard and others show that being listed on the stock market is no guarantee</p></div></li></ol>", "parentCommentId": "koxg7FSuabt85vfYM", "user": {"username": "DaneelO"}}, {"_id": "YvCAxHHesMMuNkau3", "postedAt": "2022-11-13T10:20:04.907Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>Don’t use phrases like “self-hatred”. This is a massive opportunity to improve EA organisations and you should have the self-confidence and enthusiasm to contribute to these improvements with alacrity.</p>", "parentCommentId": null, "user": {"username": "IanPitchford"}}, {"_id": "byP6muwztkrwXBLMG", "postedAt": "2022-11-13T11:11:51.196Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>It's not about the sex in and of itself, it's about the conflict of interest and favouritism. Romantic love interest is enough for that too. EA could probably learn a lot from how mainstream orgs deal with this.</p>\n", "parentCommentId": "H5i8T7wsfErHu88my", "user": {"username": "Greg_Colbourn"}}, {"_id": "DCa3Yg4jearNvTo7s", "postedAt": "2022-11-13T11:25:58.602Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>Eliezer is popular here. He founded LessWrong, MIRI and the AGI x-risk community. It's not surprising you are getting downvoted for criticising his work (note I have not downvoted you, just explaining here).</p>\n", "parentCommentId": "weuawGnuS8Jfdw4BC", "user": {"username": "Greg_Colbourn"}}, {"_id": "kBjt6tDdbDDHQtiyX", "postedAt": "2022-11-13T11:28:58.719Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>Romantic love is a lot more intense than mere friendship! Makes conflicts of interest way more likely.</p>\n", "parentCommentId": "kMArg5vRZbLamZoWG", "user": {"username": "Greg_Colbourn"}}, {"_id": "brbrfc5sJi9WtDDEY", "postedAt": "2022-11-13T11:40:07.147Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>I’d be interested to know why you thought it relevant to mention “women” specifically?</p>\n", "parentCommentId": "WJGkQtZCbiR7hYKGE", "user": {"username": "jackmalde"}}, {"_id": "v9xcKbNyvunXSs7zw", "postedAt": "2022-11-13T12:25:30.423Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>Lorenzo, I agree the expert traders and investor have more technical skills about investment. But it seems to me that MacAskill and FTX Future Fund board had more direct information about the personality of SBF and the personal connections among the leaders and the group dynamics. So, when it comes to your statement “having access to way less information”, I don’t think this is the case.</p>", "parentCommentId": "9vsDK4d8WAjXthMAu", "user": {"username": "Miguel Lima Medín"}}, {"_id": "ZM4vCBovrjsADtSsH", "postedAt": "2022-11-13T12:26:07.123Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>Yes - I almost can't believe I am reading a senior EA figure suggesting that every major financial institution has an <em>unreasonably</em> prurient interest in the sex lives of their risk-holding employees. EA has just taken a bath because it was worse at financial risk assessment than it thought it was. The response here seems to be to double-down on the view that a sufficiently intelligent rationalist can derive - from first principles - better risk management than the lessons embedded in professional organisations. We have ample evidence that this approach did not work in the case of FTX funding, and that real people are really suffering because EA leaders made the wrong call here.</p>\n<p>Now is the time to eat a big plate of epistemically humble crow, and accept that this approach failed horribly. Conspiracy theorising about 'voting rings' is a pretty terrible look.</p>\n", "parentCommentId": "byP6muwztkrwXBLMG", "user": {"username": "AnonymousRiskGuy"}}, {"_id": "aHvNrSrtJZhRSdemG", "postedAt": "2022-11-13T12:43:37.576Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>Yeah, fair. I have no real knowledge of crypto, so am not particularly endorsing Binance</p>\n", "parentCommentId": "3EKwTmmgyL2MrNSAB", "user": {"username": "Neel Nanda"}}, {"_id": "9vtAJw7pn9Tn3MREg", "postedAt": "2022-11-13T12:48:20.511Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>I work (indirectly) in financial risk management. Paying special attention to special categories of risk - like romantic relationships - is very fundamental to risk management. It is not that institutions are face with a binary choice of 'manage risk' or 'don't manage risk' where people in romantic relationships are 'managed' and everyone else is 'not'. Risk management is a spectrum, and there are good reasons to think that people with both romantic and financial entanglements are higher risk than those with financial entanglements only. For example:</p>\n<ol>\n<li>\n<p>Romantic relationships inspire particularly <em>strong</em> feelings, not usually characterising financial relationships. People in romantic relationships will take risks on each other's behalf that people in financial relationships will not. We should be equally worried about familial relationships, which also inspire very strong feelings.</p>\n</li>\n<li>\n<p>Romantic relationships inspire <em>different</em> feelings from financial relationships. Whereas with a business partner you might be tempted to act badly to make money, with a romantic partner you might be tempted to act badly for many other reasons. For example, to make your partner feel good, or to spare your romantic partner embarrassment</p>\n</li>\n<li>\n<p>Romantic relationships imply a different level of <em>access</em> than financial relationships. People in romantic relationships have levers to make their partner do things they might not want to - for example abusive relationships, threatening to end the relationship unless X is done, watching the partner enter their password into their computer to gain access to systems.</p>\n</li>\n</ol>\n", "parentCommentId": "QQRNzuk9GFqzeLtDu", "user": {"username": "AnonymousRiskGuy"}}, {"_id": "fhmis2vNNGDc9eu3s", "postedAt": "2022-11-13T12:55:39.883Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>Thank you so much for writing this! I wonder the same things regarding crypto and I really don't understand why so many EA's seem(ed) fine with it. I should've expressed these concerns more loudly before.</p>\n", "parentCommentId": "cKbbBz8ffRcDBeSkw", "user": {"username": "Jeroen_W"}}, {"_id": "9kzJW8kQKvXLmAEWG", "postedAt": "2022-11-13T12:55:53.620Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>I feel like people are mischarachterizing what Eliezer is saying. It sounds to me like he's saying the following.&nbsp;<br><br>\"Sure, the fact that the two were dating or having sex makes it even more obvious that something was amiss, but the real problem was &nbsp;obviously that Alameda and FTX were entangled from the very start with Sam having had total control of Alameda before he started FTX, and there were no checks and balances and so on, so why are you weirdos focusing on the sex part so much and ignore all the other blatant issues?!\"&nbsp;</p>", "parentCommentId": "ZM4vCBovrjsADtSsH", "user": {"username": "Lukas_Gloor"}}, {"_id": "i52mpNv9HCugTQu4H", "postedAt": "2022-11-13T13:09:23.817Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>Tara left CEA to co-found Alameda with Sam. As is discussed elsewhere, she and many others split ways with Sam in early 2018. I'll leave it to them to share more if/when they want to, but I think it's fair to say they left at least in part due to concerns about Sam's business ethics. She's had nothing to do with Sam since early 2018. It would be deeply ironic if, given what actually happened, Sam's actions are used to tarnish Tara.</p>\n<p>[Disclosure: Tara is my wife]</p>\n", "parentCommentId": "7XvmazGm2T9mnPhY5", "user": {"username": "mhpage"}}, {"_id": "nB5vzhr9gkhf2kfeg", "postedAt": "2022-11-13T13:12:18.658Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>I'll go with you part of the way, but I also think that experts, traders, and even investors were further from SBF than at least some of the people in the equation here, which seems more and more true the more accounts I hear about people from Alameda saying they warned top brass. I wouldn't expect an investor to have that kind of insight.</p>", "parentCommentId": "9vsDK4d8WAjXthMAu", "user": {"username": "DevonFritz"}}, {"_id": "W2wsJ38pRxW3dzTY9", "postedAt": "2022-11-13T13:12:30.223Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>Not just for criticism of his work but also for bringing this up in a totally unrelated context. If you're (I mean the anonymous commenter) bothered by the way Eliezer dismisses concerns around \"sex within orgs or close networks makes things messy and often ends badly,\" I think that's fair enough and I wouldn't have downvoted your comment for it. But then adding that you think his intellectual contributions are also shit (or at least are seen as bad by people outside the movement) – that just seems a bit mean-spirited (besides IMO being wrong).&nbsp;</p>", "parentCommentId": "DCa3Yg4jearNvTo7s", "user": {"username": "Lukas_Gloor"}}, {"_id": "Cy9F4A8Kj7njfEyAc", "postedAt": "2022-11-13T13:25:48.005Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<blockquote><p>I'd personally prefer it, in the future, if you wouldn't focus on the blog posts and quotes. I think they just act as very weak evidence, and your use makes it feel a bit like otherwise.</p></blockquote><p>Especially when they contain massive qualifiers like \"the ends do not ALWAYS justify the means\"</p>", "parentCommentId": "8BeHcavP8xYELCs2M", "user": {"username": "DevonFritz"}}, {"_id": "LTbKZWTKN5u2FdTeZ", "postedAt": "2022-11-13T13:33:50.034Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>I don't think leadership needed to know how the sausage was made to be culpable to some degree. Many people are claiming that they warned leadership that SBF was not doing things above board and if true then has serious implications, even if they didn't know exactly what SBF was up to.&nbsp;</p><p>Not I am not claiming that anyone, specific or otherwise, knew anything.</p>", "parentCommentId": "FhEXB7y2bH5PtgtWP", "user": {"username": "DevonFritz"}}, {"_id": "EiLHFxKbubkH8BykK", "postedAt": "2022-11-13T13:47:17.177Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>That doesn't strike me as a massive qualifier, it strikes me as something that's straightforwardly true (or as true as a moral claim can be). For example, if you're in a situation where you can lie to save 1B people from terrible suffering, then I bet most people think it's not only acceptable, but obligatory to lie. If so, the ends clearly do sometimes justify the means.</p>\n", "parentCommentId": "Cy9F4A8Kj7njfEyAc", "user": {"username": "Erich_Grunewald"}}, {"_id": "4qcu3dfqbKbApYTPu", "postedAt": "2022-11-13T13:56:11.537Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>That seems like a very charitable reading of the comment</p>\n<p>\"who EAs are fucking is none of EA's business.  There are very limited exceptions to this rule like ... none of which are being suggested here.\"</p>\n<p>I'd suggest that given the high stakes of the situation at the moment it is especially important not to inadvertently give the impression that  EA leadership think they have privileged insight into financial risk management that they actually don't. If EY has merely mangled his argument (as you suggest) it would be very sensible for him to edit his comment to reflect that, and apologise for implying that vote rigging was the only reason he could have been down voted.</p>\n", "parentCommentId": "9kzJW8kQKvXLmAEWG", "user": {"username": "AnonymousRiskGuy"}}, {"_id": "Mq76sFcAkcoenatDj", "postedAt": "2022-11-13T15:12:57.327Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<blockquote><p>That seems like a very charitable reading of the comment</p></blockquote><p>I was commenting on his overall stance from his comments throughout the threads here, not only on that particular first comment. I agree that the part you cite doesn't sound defensible. I considered his further comments to be admissions of \"Okay, you all have a point, but ...\" &nbsp;(If I'm right with my interpretation, he could've been more clear about the part of \"sorry, you all have a point and the initial comment was too crude.\")&nbsp;</p><p>Edit: FWIW, I thought the info/arguments you gave about why it's common practice in finance to carefully monitor romantic or sexual conflicts of interests were compelling, and your point about how EAs maybe shouldn't think they can do better based on first-principles reasoning also seems wise.&nbsp;</p>", "parentCommentId": "4qcu3dfqbKbApYTPu", "user": {"username": "Lukas_Gloor"}}, {"_id": "n8LndtX9LPQnPHbbv", "postedAt": "2022-11-13T15:25:50.347Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>I think it is morally correct and that people would agree with it, but I don’t think if it as strong evidence for the claim “we are against this type of behavior.”</p>\n", "parentCommentId": "EiLHFxKbubkH8BykK", "user": {"username": "DevonFritz"}}, {"_id": "cZJFN73gyAzR66pTk", "postedAt": "2022-11-13T15:27:18.848Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>So massive is too big of a word, but the qualifier in some sense let’s everything in and isn’t powerful.</p>\n", "parentCommentId": "n8LndtX9LPQnPHbbv", "user": {"username": "DevonFritz"}}, {"_id": "skYJyi64Ww2cJECa2", "postedAt": "2022-11-13T15:30:04.931Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<blockquote>\n<p>often decisions don't benefit a ton from \"the whole community weighs in\" over \"twenty smart advisors weighed in\".</p>\n</blockquote>\n<p>I don't think this is true? Especially for decisions in the billions of dollars? Why do you think 20 smart advisors can spot all the problems that thousands of community members will, or even the major ones?</p>\n", "parentCommentId": "iZJqRp2rKBNZgxnjv", "user": {"username": "Guy Raveh"}}, {"_id": "zNwYFLzyEzv3QxHzG", "postedAt": "2022-11-13T15:34:49.265Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>...You think it's important to disclose this conflict of interest when you recommend a grant to someone, but not important when you as a CEO decide on a multi-billion dollar loan to the company where the other person is the CEO?</p>\n", "parentCommentId": "bYhKX5WpQKQtJbNYf", "user": {"username": "Guy Raveh"}}, {"_id": "sPwwKR8GaQ6gQjYED", "postedAt": "2022-11-13T15:41:53.407Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>Conflict of interest is the issue my friend. Unbiased decisions cannot happen when one has an other-than-work-relationship with the persons they are dealing with.&nbsp;</p><blockquote><p>Any relationship that is, or appears to be, not in the best interest of the organization. A conflict of interest would prejudice an individual's ability to perform his or her duties and responsibilities objectively.​</p><p>IIA Standards Glossary of Terms, Conflicts of Interest.</p></blockquote>", "parentCommentId": "bYhKX5WpQKQtJbNYf", "user": {"username": "Miguel"}}, {"_id": "RyBByJt2ssvCTrt2u", "postedAt": "2022-11-13T17:16:53.498Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>It seems like there's this expectation of public figures to always have acted in a way that is correct given the information we have now - basically hindsight bias again.</p>\n<p>One of the many wildly charismatic people you hang out with later turns out to be No Good? Well of course you shouldn't have associated with them. One of the many rumours you might have heard turns out to be true and a big deal? Off course you should have acted on it.</p>\n<p>I don't think this is very fair or useful. I guess we might worry that the rest of the world will think like that but I don't see why we should.</p>\n", "parentCommentId": "WJGkQtZCbiR7hYKGE", "user": {"username": "Michael_PJ"}}, {"_id": "ndqwkcnRsLTbw7iur", "postedAt": "2022-11-13T18:06:05.478Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>Sorry to be jumping in having never posted here, but I've been following along for a while and I'm fascinated.</p><p>Everything mentioned in the Sequoia piece about MacAskill's involvement is strange. I'd be interested in hearing more about what his \"pitch\" was like back then:</p><blockquote><p>\"It was his fellow Thetans who introduced SBF to EA and then to MacAskill, who was, at that point, still virtually unknown. MacAskill was visiting MIT in search of volunteers willing to sign on to his earn-to-give program.\"</p></blockquote><p>What was with this recruitment process? The notion of \"signing on\" jumps out at me. Also MacAskill is the one who told SBF to go to Jane Street?&nbsp;</p><blockquote><p>\"His course established, MacAskill gave SBF one last navigational nudge to set him on his way, <strong>suggesting that SBF get an internship at Jane Street that summer</strong>.\"</p></blockquote><p>That's so weird. I get the idea of trying to spread the gospel, but has MacAskill ever spoken about his motives for...going around meeting college kids to...I don't even know what the correct description would be. Gain acolytes?&nbsp;</p>", "parentCommentId": "3ZNGqJEpQSrDuRpSu", "user": {"username": "skerple"}}, {"_id": "aHhYNxkJ34HqTLAEo", "postedAt": "2022-11-13T18:11:37.413Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>Mentioned in a response to another post, but has MacAskill ever discussed his visits to colleges looking for recruits?</p><blockquote><p>\"It was his fellow Thetans who introduced SBF to EA and then to MacAskill, who was, at that point, still virtually unknown. MacAskill was visiting MIT in search of volunteers willing to sign on to his earn-to-give program.\"</p></blockquote><p>And trying to point them in certain directions?</p><blockquote><p>\"His course established, MacAskill gave SBF one last navigational nudge to set him on his way, suggesting that SBF get an internship at Jane Street that summer.\"</p></blockquote>", "parentCommentId": null, "user": {"username": "skerple"}}, {"_id": "GKNfk7E3R753s8vmR", "postedAt": "2022-11-13T19:04:53.176Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>I believe this is SBF's blog: http://measuringshadowsblog.blogspot.com/</p>", "parentCommentId": "WuexMfaZk3Xp8HZ9A", "user": {"username": "DominikPeters"}}, {"_id": "jCPshXyZJfoXm7mTW", "postedAt": "2022-11-13T20:00:01.231Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>See Holden Karnofsky's <a href=\"https://forum.effectivealtruism.org/posts/gTaDDJFDzqe7jnTWG/some-thoughts-on-public-discourse\">Some Thoughts on Public Discourse</a>:</p><blockquote><p>For nearly a decade now, we've been putting a huge amount of work into putting the details of our reasoning out in public, and yet I am hard-pressed to think of cases (especially in more recent years) where a public comment from an unexpected source raised novel important considerations, leading to a change in views. This isn't because <i>nobody</i> has raised novel important considerations, and it certainly isn't because we haven't changed our views. Rather, it seems to be the case that we get a large amount of valuable and important criticism from a relatively small number of highly engaged, highly informed people. Such people tend to spend a lot of time reading, thinking and writing about relevant topics, to follow our work closely, and to have a great deal of context. They also tend to be people who form relationships of some sort with us beyond public discourse.</p><p>The feedback and questions we get from outside of this set of people are often reasonable but familiar, seemingly unreasonable, or difficult for us to make sense of. [...]</p><p>Regardless of the underlying reasons, we have put a lot of effort over a long period of time into public discourse, and have reaped very little of this particular kind of benefit (though we have reaped other benefits - more below). I'm aware that this claim may strike some as unlikely and/or disappointing, but it is my lived experience, and I think at this point it would be hard to argue that it is simply explained by a lack of effort or interest in public discourse.</p></blockquote>", "parentCommentId": "skYJyi64Ww2cJECa2", "user": {"username": "RobBensinger"}}, {"_id": "6pv3fcgQbwwYNZC9x", "postedAt": "2022-11-13T20:00:29.275Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<blockquote><p>The notion of \"signing on\" jumps out at me.</p></blockquote><p>They're probably talking about the <a href=\"https://www.givingwhatwecan.org/pledge\">Giving What We Can pledge</a> here, which MacAskill <a href=\"https://www.givingwhatwecan.org/people/william-macaskill\">co-founded</a>. I don't see why anyone would consider that controversial.</p>", "parentCommentId": "ndqwkcnRsLTbw7iur", "user": {"username": "tobias-daenzer"}}, {"_id": "vjPpWYBFhvJ7ecmRT", "postedAt": "2022-11-13T20:07:15.427Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>Copying my reply from above:</p><blockquote><p>The notion of \"signing on\" jumps out at me.</p></blockquote><p>They're probably talking about the <a href=\"https://www.givingwhatwecan.org/pledge\">Giving What We Can pledge</a> here, which MacAskill <a href=\"https://www.givingwhatwecan.org/people/william-macaskill\">co-founded</a>. I don't see why anyone would consider that controversial.</p>", "parentCommentId": "aHhYNxkJ34HqTLAEo", "user": {"username": "tobias-daenzer"}}, {"_id": "ntv4RJoAvKkiTxuFm", "postedAt": "2022-11-13T20:10:17.335Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>Seems to me that you have it exactly backwards? Everyone agrees that the ends usually justify the means -- e.g., it's a good idea to go grocery shopping <i>because</i> this results in getting food. \"Are there exceptions?\" is <i>exactly</i> the claim that naive consequentialists are getting wrong.</p>", "parentCommentId": "cZJFN73gyAzR66pTk", "user": {"username": "RobBensinger"}}, {"_id": "c9Ge6AoYeuEBPtAu4", "postedAt": "2022-11-13T21:01:15.206Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>I see. So it would be the equivalent MacAskill signing people up for a Giving What We Can pledge for as part of High Impact Careers (which became 80,000 Hours).</p><p>That in itself isn't controversial, but I'd be interested in knowing more about exactly how it works. The Sequoia article says that MacAskill himself suggested Jane Street. (I'll note that the 80,000 Hours website mentions Jane Street but not MacAskill's involvement).</p><p>What does that actually mean? Did he have a hand in helping SBF secure an interview or the gig? Did SBF pledge to donate to one of the organizations MacAskill was associated with?&nbsp;</p><p>It feels similar to a headhunting firm. I'm sure there are not finders fees for placing these positions, but I'd be interested in knowing if there's any kind of arrangement, even if it's mostly implicit - i.e. \"We found you a good candidate, so please donate to our organization.\"&nbsp;</p><p>And then the other big question: what is the pledge-pitching actually like? And does the person making the pledge get different treatment depending on what their pledge looks like. The amount? The organization? If someone pledges to one of MacAskill's affiliated organizations, is that more likely to result in a placement?</p><p>80000hours.org dances around all of this a bit. &nbsp;They certainly don't mention getting anything in return. But on a page where they list their \"mistakes\" there's an entry saying that they didn't focus enough on \"high-value plan changes.\" <a href=\"https://80000hours.org/about/credibility/evaluations/mistakes/?int_source=job-board#growth-of-high-value-plan-changes-slower-than-medium-value\">https://80000hours.org/about/credibility/evaluations/mistakes/?int_source=job-board#growth-of-high-value-plan-changes-slower-than-medium-value</a></p><p>Okay, well, what is that? It seems to be a phrase used internally, and barely shows up on the rest of the site. The closest we get to a definition is a post from 2016: <a href=\"https://forum.effectivealtruism.org/posts/WKkF36bJsH8FmYZkw/why-donate-to-80-000-hours\">https://forum.effectivealtruism.org/posts/WKkF36bJsH8FmYZkw/why-donate-to-80-000-hours</a></p><p>The phrase crops up in the \"Funding target\" section, and mentions that if they're going to raise £1.7m, they'll need to seek \"the easiest, scalable way to get more high-value plan changes.\" So it's clear that they're counting on some sort of money flowing in from either the job-seeker or the company in which they're placed, or both.&nbsp;</p><p>Now...</p><p>None of that is wrong, and it seems like an inventive (if slightly hidden?) system.</p><p>With that in mind, I do still think it would be good to know more about that original meeting and what happened after. How much of SBF's Jane Street income was going to MacAskill's organization, if any? I know that after he left, he went straight to the Centre for Effective Altruism and that's where he was for the successful arbitrage. (although in some articles this fact is elided, and it's described more as SBF bumming around trying to think of some good idea). Then he used the proceeds to found Alameda with Tara Mac Aulay, who was with CEA at the time and later deeply involved in the Celsius fiasco.</p>", "parentCommentId": "vjPpWYBFhvJ7ecmRT", "user": {"username": "skerple"}}, {"_id": "h4bcZaYpo4RgBh4jZ", "postedAt": "2022-11-13T21:16:07.305Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>I hadn't heard that the arbitrage was illegal. Here's a little more info for others: <a href=\"https://www.pymnts.com/cryptocurrency/2022/south-koreas-crypto-kimchi-premium-suspected-in-3-4b-fx-investigation/\">https://www.pymnts.com/cryptocurrency/2022/south-koreas-crypto-kimchi-premium-suspected-in-3-4b-fx-investigation/</a></p>\n", "parentCommentId": "2t44jqobbCqjBPJwK", "user": {"username": "cole_haus"}}, {"_id": "cc4sNRTYdiJxdBiX2", "postedAt": "2022-11-13T21:36:48.072Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>Disclose to who? &nbsp;The loan was blatantly bad; nobody in a position to take that disclosure should've given two flying floops whether the CEOs were dating or not.</p>", "parentCommentId": "zNwYFLzyEzv3QxHzG", "user": {"username": "EliezerYudkowsky"}}, {"_id": "ZRPQLpxzojZG42LnG", "postedAt": "2022-11-13T21:42:37.668Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>So if I were writing these rules, I might very well rephrase it as \"do you have a very strong friendship with this other person\" and \"do you occasionally spend time at each other's houses\" to avoid both allonormativity and the temptation to prurient sniffing; and I'd work hard to keep any disclosed information of that form private, like \"don't store in Internet-connected devices or preferably on computers at all\" private, to minimize incentives against honest disclosure. &nbsp;And even then, I might expect that among the consequences of the regulation, would be that CEOs in relationships would occasionally just lie to me about it, now that such incentives had been established against disclosure.&nbsp;</p><p>When you optimize against visible correlates of possible malfeasance, you optimize first and above all against visibility; and maybe secondarily against possible malfeasance <i>if</i> the visibility is very reliable and the correlations are strong enough to take causal leaning on them.</p><p>But, sure, if you know all that and you understand the consequences, then Sequoia could've asked if SBF and Caroline were in a relationship, understanding that a No answer might be a lie given the incentives they'd established, and that a Yes answer indicated unusual honesty.</p>", "parentCommentId": "9vtAJw7pn9Tn3MREg", "user": {"username": "EliezerYudkowsky"}}, {"_id": "vi5cit3cNqzGBjaJe", "postedAt": "2022-11-13T21:48:39.202Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>I'm under the impression that mainstream orgs deal with this <i>rather poorly,</i> by having the relationships still happen, but be Big Dark Forbidden Secrets instead of things that people are allowed to actually know about and take into account. &nbsp;But they Pretend to be acting with Great Propriety which is all that matters for the great kayfabe performance in front of those who'd perform pearl-clutching otherwise. &nbsp;People falsifying their romantic relationships to conform to ideas about required public image is part of our present culture of everything being fake; so what loves you forbid from being known and spoken of, by way of trying to forbid the loves themselves, you should forbid very hesitantly.</p><p>I think our current culture is better, even in light of current events, because I don't think the standard culture would have actually prevented this bad outcome (unless almost any minor causal perturbance would've prevented it). &nbsp;It would mean that SBF/C's relationship was just coming out now even though they'd previously supposedly properly broken up before setting up the two companies, or something - if we learned even that much!</p>", "parentCommentId": "byP6muwztkrwXBLMG", "user": {"username": "EliezerYudkowsky"}}, {"_id": "cAmvDop66jqWPJjCK", "postedAt": "2022-11-13T21:59:40.262Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>I have, as it happens, a &nbsp;low opinion of Eliezer's influence on EA (though I admit I've hardly read his stuff), but I still downvoted a generalized off-topic nasty personal attack.&nbsp;</p>", "parentCommentId": "DCa3Yg4jearNvTo7s", "user": {"username": "Dr. David Mathers"}}, {"_id": "yJiLjmwQgi8CufoYo", "postedAt": "2022-11-13T22:02:05.766Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>Good points, Brian . . . I'm sure there are lots of overoptimistic pitch decks, and that a 15% return might be feasible, and maybe I'm just looking at this with the benefit of hindsight.&nbsp;</p><p>Even so, an investment firm normally doesn't do anything like this, right? I mean, I assume that even Renaissance Technologies wouldn't want to offer one single investment opportunity packaged as a loan with a legally guaranteed 15% rate of return with \"no downside.\" <a href=\"https://www.bloomberg.com/news/articles/2021-02-10/simons-makes-billions-while-renaissance-investors-fume-at-losses#xj4y7vzkg\">https://www.bloomberg.com/news/articles/2021-02-10/simons-makes-billions-while-renaissance-investors-fume-at-losses#xj4y7vzkg</a> They might brag about their past returns, but would include lots of verbiage about the risks, and about how past performance is no guarantee of future returns, etc.&nbsp;</p>", "parentCommentId": "qiCLwF9EY2CG8TbHJ", "user": {"username": "Stuart Buck"}}, {"_id": "mHs8Dk6HwwNpvQXB6", "postedAt": "2022-11-13T22:05:13.360Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>I think what his public official motive would be is obvious: he's always tried to get people to do things he thinks have positive altruistic impact-for example, by writing books advocating they do stuff-so he was doing the same with potentially influential people at a more 1-1 level. I don't think this is something that's ever been hidden! I can see why you might reasonably think this sort of influence seeking feels a bit off, since on some level it is an attempt to exercise power in a way the bypasses democracy. I'm sure someone has criticized it on those grounds. But organizations recruiting talented college students is quite normal in itself, even if they don't usually have to sign on to a detailed philosophy. And even the latter is hardly unique: think of someone trying to network informally for people to get involved with their new libertarian think tank, or socialist magazine.&nbsp;</p>", "parentCommentId": "ndqwkcnRsLTbw7iur", "user": {"username": "Dr. David Mathers"}}, {"_id": "rumftCaKpyDgEZCdT", "postedAt": "2022-11-13T22:07:36.256Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>Strong agree, but in that case, it seems very unlikely that Will was unaware of these serious \"concerns about Sam's business ethics\" back in 2018, and it seems all the more incumbent on him to offer an explanation as to why he kept such a close affiliation with SBF thereafter.&nbsp;</p>", "parentCommentId": "i52mpNv9HCugTQu4H", "user": {"username": "Stuart Buck"}}, {"_id": "dgChbkhWTuCMWAzpH", "postedAt": "2022-11-13T22:17:35.094Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>Oh, yeah, I totally agree. I don't think of it as a way to bypass democracy or exercise undue influence. The main thing for me is that SBF and MacAskill are so interconnected. I thought it was primarily a philosophical connection, but the financial connection seems just as important, especially since MacAskill has been involved in every single part of SBF's career. The first job at Jane Street, the arbitrage, the founding of Alameda, and now all the FTX crap.</p><p>Outside recent political donations, it seems that SBF was shoveling most of his donations money back into MacAskill's organizations. (Someone else linked to his old blog, which gives a glimpse of this: <a href=\"http://measuringshadowsblog.blogspot.com/)\">http://measuringshadowsblog.blogspot.com/)</a></p><p>Now that SBF's biggest endeavor has turned out to be a giant scam, it's important to understand what MacAskill knew about everything and whether any of the same kind of financial misconduct is going on at any of the charitable organizations. I'm sure we'll know a lot more soon, though.</p>", "parentCommentId": "mHs8Dk6HwwNpvQXB6", "user": {"username": "skerple"}}, {"_id": "f2cxzFFJkicHWjDGN", "postedAt": "2022-11-13T22:27:04.295Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>The first half of this comment is tangential at best. It's also a bit odd to me how much you are defending \"our current culture\" when someone <a href=\"https://forum.effectivealtruism.org/posts/NacFjEJGoFFWRqsc8/women-and-effective-altruism\">posted</a> on the forum just yesterday expressing concerns about said culture.&nbsp;</p>", "parentCommentId": "vi5cit3cNqzGBjaJe", "user": {"username": "Lauren Maria"}}, {"_id": "3Qr3NDMH6g4N5f7jt", "postedAt": "2022-11-13T22:38:44.265Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>The 2nd google hit for it is \"Investopedia\" (no idea how reliable a source it is), which claims that it was widely perceived as legally unproblematic until recently, but might actually not have been: https://www.investopedia.com/terms/k/kimchi-premium.asp<br><br>'Was the Kimchi Premium Associated with Illegal Money Transfers?</p><p>While it was usually assumed that the Kimchi premium was innocuous, caused by technical limitations of the Korean banking system and the popularity of crypto, a new investigation in the summer of 2022 suspects that more than $3.4 billion of illegal foreign transactions in the country stemmed from cryptocurrencies.'<br><br>No further source is cited. I find it hard to tell whether this was something that CEA should have reasonably known was dodgy when SBF exploited it, and how dodgy they should have thought it was, but it certainly seems very worth investigating in any postmortem. In general, I think the actual harm-to-the-general-public causing decision here was helping persuade SBF to set up Alameda in the first place, as from that point on he was probably perfectly capable of making a lot of money, and then losing it, and stealing from his depositors whether or not he had the good will of EAs. (Even if getting a good reputation was somehow necessary, he could have just given to other charities and not mentioned EA, and we'd probably have shut up about him even if we'd officially decided he was bad. And it's not clear having &nbsp;reputation for public charity was particularly important to FTX's success, let alone Alameda's, anyway.) But that decision might not actually have been a bad one based on information available to the people who persuaded/influenced him at the time: \"set up a hedge fund\" is not obviously immoral, unless you have specific evidence that the person your getting to do it is really dodgy, or the business model of the hedge fund is morally dubious. So my guess is to know whether the really crucial harm-causing decision was actually bad on the information available at the time, or just unlucky, we need to know about this.&nbsp;</p>", "parentCommentId": "2t44jqobbCqjBPJwK", "user": {"username": "Dr. David Mathers"}}, {"_id": "jAsrLeJEw6cEvAGDN", "postedAt": "2022-11-13T22:50:31.037Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>...are you suggesting that nobody ought to dare to defend aspects of our current culture once somebody has expressed concerns about them?</p>", "parentCommentId": "f2cxzFFJkicHWjDGN", "user": {"username": "EliezerYudkowsky"}}, {"_id": "biiNAL9twHRRnmRRp", "postedAt": "2022-11-13T23:03:41.514Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>'Now that SBF's biggest endeavor has turned out to be a giant scam' &nbsp;I'm not sure that is quite right. As far as I can tell, the main definite issue that has been proven is that he stole money when he lost money, which is not quite the same as the endeavor itself being a scam from the beginning. Not that that is any morally better, and it was so deeply, deeply morally wrong that I strongly suspect SBF has done other very bad things, but it's good to be precise I think. (I agree that Will had a severe conflict of interest, but I do think we have to stress that there's no strong direct evidence of wrongdoing on his part yet, and that getting rich people to fund you is a standard charity/political party model used by everyone, even if known to be problematic and even if Will and SBF seem to have been unusually connected.)&nbsp;</p>", "parentCommentId": "dgChbkhWTuCMWAzpH", "user": {"username": "Dr. David Mathers"}}, {"_id": "YfgtxPEuAa8jet5Hb", "postedAt": "2022-11-13T23:10:56.202Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>Thanks for your reply. I do think it would be unusual to see such promises, particularly from a firm looking for large investments. And I would expect to see a bunch of disclaimers, as you suggest. There might have been such language in the actual investment documents, but still. The excerpt shared on Twitter would have set off red flags for me because it seems sloppy and unprofessional, and it would have made me particularly concerned about their risk management, but I wouldn't have concluded it was a Ponzi scheme or that there was something fraudulent going on with the reported returns.&nbsp;</p><p>It will be interesting to see if all of the FTX/Alameda fraud (if there was fraud, which seems very likely) took place after the most recent investment round. Investors may have failed not in financial diligence but in ensuring appropriate governance and controls (and, apparently, in assessing the character of FTX's leadership).</p>", "parentCommentId": "yJiLjmwQgi8CufoYo", "user": {"username": "blonergan"}}, {"_id": "GPMZXsJDiwGvbF7aA", "postedAt": "2022-11-13T23:34:08.947Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>I don't really understand why you are describing this as a hypothetical (\"If I were writing these rules...\"). You are the founder and head of a highly visible EA organisation recieving charitable money from donors, and presumably have some set of policies in place to prevent staff at that organisation from systematically defrauding those donors behind your back. You <em>have written</em> those policies (or delegated someone else to write them for you). You are sufficiently visible in the EA space that your views on financial probity materially affect the state of EA discourse. What you are telling me is that the policies which you wrote don't include a 'no undeclared sexual relationships with people who are supposed to act as a check on you defrauding MIRI' rule, based on your view that it is excessively paternalistic to inquire about people's sex life when assessing risk, and that your view is that this is the position that should be adopted in EA spaces generally.</p>\n<p>This is - to put it mildly - not the view of the vast majority of organisations which handle money at any significant scale. No sane risk management approach would equate a romantic relationship with 'a very strong friendship'. Romantic love is qualitatively different to fraternal love.  No sane risk management approach would equate \"occasionally spend[ing] time at each other's house\" to living together. My wife is often alone in the house for extended periods of time, but I usually hang out with friends when they come over (to give just one difference from an enormous list of possibilities).</p>\n<p>EA leadership - which includes you - has clearly made a catastrophic error of financial risk management with this situation. The extent to which they are 'responsible' is a fair debate, but it is unquestionable they failed to protect people who trusted them to steer EA into the future - hundreds of people have been made unemployed overnight and EA is potentially facing its first existential risk as a result. I am genuinely baffled how you can look at this situation and conclude that the approach you are describing - a very intelligent non-expert such as yourself creates their own standards of financial conduct at significant odds with the mainstream accepted approach - could still possibly be appropriate in the face of the magnitude of the error this thinking has led to.</p>\n<p>I also think it is extremely unedifying that you make the case elsewhere that the disagreement votes you are recieving for your position are from vote manipulation. A more plausible explanation is that people have independently reached the conclusion you are wrong that romantic love presents no special financial risks.</p>\n", "parentCommentId": "ZRPQLpxzojZG42LnG", "user": {"username": "AnonymousRiskGuy"}}, {"_id": "nt3Dqet3rzW5FHrdj", "postedAt": "2022-11-13T23:48:30.424Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>Somebody else in that thread was preemptively yelling \"vote manipulation!\" and \"voting ring!\", and as much as it sounds recursively strange, this plus some voting patterns (early upvotes, then suddenly huge amounts of sudden downvoting) did lead me to suspect that the poster in question was running a bunch of fake accounts and voting with them.</p><p>We would in fact be concerned if it turned out that two people who were supposed to have independent eyes on the books were in a relationship and didn't tell us! &nbsp;And we'd try to predictably conduct ourselves in such a mature, adult, understanding, and non-pearl-clutching fashion that it would be completely safe for those two people to tell the MIRI Board, \"Hey, we've fallen in love, you need to take auditing responsibility off one of us and move it to somebody else\" and have us respond to that in a completely routine, nonthreatening, and unexcited way that created no financial or reputational penalties for us being told about it.</p><p>That's what I think is the healthy, beneficial, and <i>actually useful for minimizing actual fraud in real life</i> culture, of which I do think present EA has some, and which I think is being threatened by performative indignation.</p>", "parentCommentId": "GPMZXsJDiwGvbF7aA", "user": {"username": "EliezerYudkowsky"}}, {"_id": "GykdRxKuq2HPsmCow", "postedAt": "2022-11-14T00:17:36.577Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>I'm struggling to follow your argument here. What you describe as the situation at MIRI is basically standard risk management approach - if two people create a risk to MIRI's financial security processes by falling in love, you make sure that neither signs off on risk taken by the other.</p>\n<p>But in this thread you are responding with strong disagreement to a comment which says \"if this relationship [between SBF and Caroline] were known to be hidden from investors and other stakeholders, should this not have raised red flags?\". You said \"who EAs are fucking is none of EA's business\", amongst other comments of a similar tone.</p>\n<p>I don't understand what exactly you disagree with if you agree SBF and Caroline should have disclosed their relationship so that proper steps could be taken to de-risk their interactions (as would happen at MIRI).  It seems that you do agree it matters who EAs are fucking in contexts like this? And therefore that it is relevant to know whether Will MacAskill knew about the undisclosed relationship?</p>\n", "parentCommentId": "nt3Dqet3rzW5FHrdj", "user": {"username": "AnonymousRiskGuy"}}, {"_id": "j382QXdHe5xTvXQrd", "postedAt": "2022-11-14T00:43:08.716Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>I'm suggesting that you show some humility.</p>", "parentCommentId": "jAsrLeJEw6cEvAGDN", "user": {"username": "Lauren Maria"}}, {"_id": "xvkxMH2eHnYm25pai", "postedAt": "2022-11-14T01:38:42.437Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>You could plausibly claim it gets disclosed to Sequoia Capital, <i>if</i> SC has shown themselves worthy of being trusted with information like that and responding to it in a sensible fashion eg with more thorough audits. &nbsp;Disclosing to FTX Future Fund seems like a much weirder case, unless FTX Future Fund is auditing FTX's books well enough that they'd have any hope of detecting fraud - otherwise, what is FTXFF supposed to do with that information?</p><p>EA <i>generally</i> thinking that it has a right to know who its celebrity donors are fucking strikes me as <i>incredibly</i> unhealthy.</p>", "parentCommentId": "GykdRxKuq2HPsmCow", "user": {"username": "EliezerYudkowsky"}}, {"_id": "DNezZ9i6ycSeZWqbj", "postedAt": "2022-11-14T01:40:39.109Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>...by not saying anything in favor of protecting some aspect of our current culture, when somebody else has just recently expressed concerns about it? &nbsp;That's a rule?</p>", "parentCommentId": "j382QXdHe5xTvXQrd", "user": {"username": "EliezerYudkowsky"}}, {"_id": "QS96Mc4g8SS37NpHL", "postedAt": "2022-11-14T02:26:19.326Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>This comment is, at time of writing, sitting at -7 karma from 5 votes. Can someone who downvoted or strong downvoted this clarify why they did so?</p>", "parentCommentId": "GPMZXsJDiwGvbF7aA", "user": {"username": "pseudonym"}}, {"_id": "W9fDhb3z9uN7ygvgE", "postedAt": "2022-11-14T03:04:14.244Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>I think we might be straying from the main point a bit;  nobody is proposing a general right to peer into EA sex lives, and I agree that would be unhealthy.</p>\n<p>There are some relatively straightforward financial risk management principles which msinstream orgs have been successfully using for decades. You seem to believe one of the pillars of these principles - surfacing risk due to romantic entanglements between parties - shouldn't apply to EA, and instead some sort of 'commonsense' approach should prevail instead (inverted commas because I think the standard way is basically common sense too).</p>\n<p>But I don't understand where your confidence that you're right here is coming from - EA leadership has just materially failed to protect EA membership from bad actor risk stemming at least in part from a hidden conflict of interest due to a romantic entanglement. EA leadership has been given an opportunity to run risk management their way, and the result is that EA is now associated with the biggest crypto fraud in history. Surely the Bayesian update here is that there are strong reasons to believe mainstream finance had it approximately right?</p>\n<p>Rereading the above, I think I might just be unproductively repeating myself at this point, so I'll duck out of the discussion. I appreciated the respectful back-and-forth, especially considering parts of what I was saying were (unavoidably) pretty close to personal attacks on you and the EA leadership more broadly. Hope you had a pleasant evening too!</p>\n", "parentCommentId": "xvkxMH2eHnYm25pai", "user": {"username": "AnonymousRiskGuy"}}, {"_id": "nsuRqCMmZTr2ncRGk", "postedAt": "2022-11-14T03:17:19.937Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>... I feel sad and uncomfortable about the commenters here criticizing Anonymous for \"personally attacking\" Eliezer, \"bringing this up in a totally unrelated context\", being \"mean-spirited\", etc.</p><p>It surely <i>matters</i> whether or not the intellectual contributions of someone in Eliezer's reference class are bad, and in a world where they <i>are</i> bad, I care a lot more about learning that fact than about exactly which thread or subthread the discussion occurs on.</p><p>I'm glad you mention \"besides IMO being wrong\" at all. But where's the objection that <i>no supporting argument has been given? </i>Where are the requests for specifics, so that it's even possible to evaluate Anon's claim by comparing notes about whether a given idea is a good intellectual contribution?</p><p>The problem with \"More importantly, the low opinion of Eliezer's contributions is well known\" isn't that it's rude or off-topic; it's that it's maximally vague, more like a schoolyard taunt (\"Oh, <i>everyone</i> knows X is lame, it's so obvious I don't even need to say why!\") than like a normal critique of someone's intellectual output. If you think Eliezer's wrong about tons of stuff, give some examples so those can be talked about, for goodness' sake.</p>", "parentCommentId": "W2wsJ38pRxW3dzTY9", "user": {"username": "RobBensinger"}}, {"_id": "MkESA8HR62GfW7QFc", "postedAt": "2022-11-14T03:41:58.430Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>What’s disappointing is not that Eliezer can’t make even a minor acknowledgement for the relevance of the models or experiences of others, that he is probably outright wrong on the substantial issues, but that Eliezer struggles to communicate and hold a thread in this conversation.</p><p>His counterpart is a literal domain expert and maybe very valuable talent to EA. (As a statement considering the totality of the votes and writing) this person is being badgered under what to any outsider should be the scary or unclear norms and power structures of the EA community on its own forum, while Eliezer’s de facto community keeps him afloat.</p><p>Elizier’s behavior is unacceptable for a funded, junior community builder, much less a senior leader.</p><p>Imagine a newcomer witnessing this, much less experiencing this.&nbsp;</p><p><img src=\"https://lh6.googleusercontent.com/5n2F8vyKGGB8KM6vQHPrXnGN9eLEO7Vu0wwW15d_T2JMvPizqRErC7VN0jduqq8KpCmMVv6lT-mJ-CKiZ89Ilcs5hv-KA9LASwtqBHE5GPfu34fsyxOi0hoL22o60eZauV2Ef7S7jfrEy-7OuV7rAvckBW3s3IlopXBcoGdrcM8rOrEUJ2U8gQs7QzQYpA\"></p>", "parentCommentId": "QS96Mc4g8SS37NpHL", "user": {"username": "Anonymous (for unimpressive reasons =[ )"}}, {"_id": "T8CNJDBj7HeMqBcAe", "postedAt": "2022-11-14T04:01:09.643Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>My (possibly wrong) understanding of what Eliezer is saying:</p>\n<p>FTX ought to have responded internally to the conflict of interest, but they had no obligation to disclose it externally (to Future Fund staff or wider EA community).</p>\n<p>The failure in FTX was that they did not implement the right internal controls—not that the relationship was \"hidden from investors and other stakeholders.\"</p>\n<p>If EA leadership and FTX investors made a mistake, it was failing to ensure that FTX had implemented the right internal controls—not failing to know about the relationship.</p>\n", "parentCommentId": "W9fDhb3z9uN7ygvgE", "user": {"username": "smountjoy"}}, {"_id": "3tsZRaCouhw6Yhcg7", "postedAt": "2022-11-14T06:20:07.244Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>One thing that people in mainstream orgs do, if they want to act with integrity, is resign from roles/go work somewhere else when they want to start a relationship that would create a conflict of interest whilst both are in their current positions (or if they value their job(s) more, give up on the idea of the relationship).</p>\n", "parentCommentId": "vi5cit3cNqzGBjaJe", "user": {"username": "Greg_Colbourn"}}, {"_id": "DPoFDsFS936FFArqw", "postedAt": "2022-11-14T09:06:46.924Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>This lady posted this 3 weeks ago. Some people in the crypto space have been warning about SBF, and FTX for over a year.&nbsp;</p><figure class=\"media\"><div data-oembed-url=\"https://youtu.be/2D5PcagsgDQ\"><div><iframe src=\"https://www.youtube.com/embed/2D5PcagsgDQ\" allow=\"autoplay; encrypted-media\" allowfullscreen=\"\"></iframe></div></div></figure>", "parentCommentId": "WuexMfaZk3Xp8HZ9A", "user": {"username": "Melissa"}}, {"_id": "mCfeFyX6A6cD8C9fN", "postedAt": "2022-11-14T09:35:24.174Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<blockquote>\n<p>I also think it is extremely unedifying that you make the case elsewhere that the disagreement votes you are recieving for your position are from vote manipulation. A more plausible explanation is that people have independently reached the conclusion you are wrong that romantic love presents no special financial risks.</p>\n</blockquote>\n<p>I agree that it does not seem likely that there was a manipulation here with the votes (I casted strong-disagreement-vote on multiple comments by Eliezer on this page). But concerns about potential voting manipulation on this forum are reasonable by default, considering that it's an open platform in which it's technically possible for someone to vote from multiple anonymous accounts.</p>\n", "parentCommentId": "GPMZXsJDiwGvbF7aA", "user": {"username": "ofer"}}, {"_id": "npey6jMX9amtM54PA", "postedAt": "2022-11-14T09:37:56.211Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>You should find a better example. The video above doesn't contain any a relevant warning. Her criticism is that SBF is pro-regulation. Not that he was defrauding his customers and neither does she make any predictions about his exchange going down due to insolvency.</p>", "parentCommentId": "DPoFDsFS936FFArqw", "user": {"username": "JesperOstman"}}, {"_id": "cC2LMn3SfmFgPCaE7", "postedAt": "2022-11-14T09:44:21.430Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>Not sure if you find this a better example:<br><br><a href=\"https://twitter.com/Hedgeye/status/1591240664779743232\">https://twitter.com/Hedgeye/status/1591240664779743232</a><br>&nbsp;</p>", "parentCommentId": "npey6jMX9amtM54PA", "user": {"username": "pseudonym"}}, {"_id": "884PenRYpjJyWSWAk", "postedAt": "2022-11-14T10:01:16.706Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>I, in general, share your sentiments, but I wanted to pick up on one thing (which I also said on <a href=\"https://twitter.com/MichaelDPlant/status/1591515733519106049\">twitter originally</a>)</p><blockquote><p>For years, the EA community has emphasised the importance of <strong>integrity, honesty</strong>, and the respect of common-sense moral constraints. [...] A clear-thinking EA should strongly<strong> oppose “ends justify the means” reasoning</strong>. I hope to write more soon about this. In the meantime, here are some links to writings produced over the years. [emphases added]</p></blockquote><p>While it might <i>sound good</i> to say people should be honest, have integrity, and reject 'ends justify the means' reasoning, &nbsp;I do see how you can expect people to do all three simultaneously: many people - including many EAs and almost certainly you, given your views on moral uncertainty - do accept that the ends <i>sometimes </i>justify the means. Hence, to go around saying \"the ends don't justify the means\" when you think that, sometimes - perhaps often - they do, smacks of dishonesty and a lack of integrity. So, I hope you do write something further to your statements above.&nbsp;</p><p>It seems like the better response is to accept that, in theory, the ends can sometimes justify the means - it would be right to harm one person to save *some* number more - but then say that, in practice, defrauding people of their money is really not a time when this is true.</p>", "parentCommentId": null, "user": {"username": "MichaelPlant"}}, {"_id": "QDajj9XGJPLjB2utu", "postedAt": "2022-11-14T10:05:15.373Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>I couldn't quite bottom out exactly what EY was saying, but I'm pretty sure it wasn't that. On your interpretation, EY said, \"who EAs are fucking is none of [wider] EA's business [except people who are directly affected by the COI]\".   But he goes on to clarify \"There are very limited exceptions to this rule like 'maybe don't fuck your direct report' \". If that's an exception to the rule of EAs fucking being only of interest to directly affected parties, then it mean EY thinks an EA having sex with a subordinate should be broadcast to the entire community. That's a very strict standard (although I guess not crazy - just odd that EY was presenting it as a more relaxed / less prurient standard than conventional financial risk management).</p>\n<p>It also doesn't address my core objection, which is that EA leadership failed very badly to implement proper financial risk management processes. Generally my point was that EA leadership should be epistemically humble now and just implement the risk management processes that work for banks, rather than tinkering around and introducing their own version of these systems. Regardless of what EY meant, unless he meant 'We should hire in PWC to implement the same financial controls as every Fortune company' then he is making exactly the same mistake EA leadership made with FTX - assuming that they could create better risk management from first principles than the mainstream system could from actual experience</p>\n<p>By the way, I disagree with the objective position here too. Every FTX investor needed to know about the COI and the management strategy FTX adopted in order to assess their risk exposure. This would be the standard at a conventional company (if the company knew about such a blatant COI from their CEO and didn't tell investors at a conventional company then their risk officers would potentially be liable for the fraud too, iirc)</p>\n", "parentCommentId": "T8CNJDBj7HeMqBcAe", "user": {"username": "AnonymousRiskGuy"}}, {"_id": "Z7FNJQ2ciAu6SyBzh", "postedAt": "2022-11-14T10:07:27.657Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>Fair enough, as long as that's the standard that is applied to all commenters and not just EA leadership. I appreciate EY agreed that there was likely no manipulation after I pointed this out</p>\n", "parentCommentId": "mCfeFyX6A6cD8C9fN", "user": {"username": "AnonymousRiskGuy"}}, {"_id": "TEGvmagAEyHnzATzm", "postedAt": "2022-11-14T10:08:56.770Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>More crimes are committed with cash, is cash a scam too? Criminals prefer cash, because as it turns out, most crypto transactions are very trackable, unlike cash.&nbsp;</p><p>People who do on-chain analysis have tracked FTX's crypto movements, something you would be unable to do with cash. It seems many here have a fundemental misunderstanding of cryptocurrency, and why it was invented in the first place.&nbsp;</p><p>Sam was using his own invented crypto that was basically worthless as collateral to borrow real money to then trade or buy politicians, or whatever else he was doing with it. His crypto coin was a scam, and he literally went on Bloomberg and bragged about his \"Ponzi\" scheme, using those words. More than a few people in the crypto community have been warning about Sam for months, but those people were mocked, ridiculed, and ignored.&nbsp;</p><p>What Sam did was completely against the ethos of crypto, (especially when he started lobbying for regulations and attempting to buy elections) just as what he did was against the ethos of EA.</p><p>It isn't fair or reasonable to judge all of crypto by his actions, just as it wouldn't be fair or reasonable to judge all of EA by Sam Bankman-Fried.</p>", "parentCommentId": "Y2hnxLyaiEdRubXiN", "user": {"username": "Melissa"}}, {"_id": "BPv6eLfhtiLGSsNMd", "postedAt": "2022-11-14T10:20:15.528Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>Actually...</p><p><strong>Facebook parent company fined in largest campaign finance penalty in U.S. history</strong></p><p><strong>Oct. 27th, 2022</strong></p><h3><code>— A Washington state judge on Wednesday fined Facebook parent company Meta nearly $25 million for repeatedly and intentionally violating campaign finance disclosure law, in what is believed to be the largest campaign finance penalty in U.S. history.</code></h3><h3><code>The penalty issued by King County Superior Court Judge Douglass North was the maximum allowed for more than 800 </code><a href=\"https://apnews.com/article/campaigns-seattle-washington-campaign-finance-af948e1c37a8ba69b2e1996474619d28\"><code>violations of Washington's Fair Campaign Practices Act,</code></a><code> passed by voters in 1972 and later strengthened by the Legislature. Washington Attorney General Bob Ferguson argued that the maximum was appropriate considering his office previously sued Facebook in 2018 for violating the same law.</code></h3>", "parentCommentId": "FhEXB7y2bH5PtgtWP", "user": {"username": "Melissa"}}, {"_id": "qLF8tZLibDmwz2Nqs", "postedAt": "2022-11-14T10:45:55.340Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>I agree that maximal vagueness is the much bigger issue with the intellectual criticism part of the comment than its unrelatedness and should also have said so. (And also via that vagueness implying that there's a consensus where there IMO isn't.)&nbsp;</p>", "parentCommentId": "nsuRqCMmZTr2ncRGk", "user": {"username": "Lukas_Gloor"}}, {"_id": "tz6sDb4abjT3nPPLw", "postedAt": "2022-11-14T12:42:19.814Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>Hi Sam, thanks for writing this. I'm not sure why I got so many disagree votes. I don't think crypto is a scam because criminals use it. I think they don't have the <a href=\"https://www.toppr.com/guides/business-economics-cs/money-and-banking/qualities-of-good-money/\">properties</a> of a good currency. Maybe some of the stablecoins have some of them. But many of them seem to have crashed, and the transaction costs don't seem much better than traditional money transfers. It's possible that the traceability of Blockchain is an advantage over government fiat currencies. But many businesses don't want everything to be traceable. So this only seems like an advantage to the police.&nbsp;</p><p>Nor do they seem like a real investment because they don't generate cash flow. They are just a sort of faith-based store in value like Gold. Is that wrong?</p><p>There are also many things in Web 3 that look like literal scams.</p><p>I listed: Ponzi Schemes (yield farming); Pump and Dump (most new cryptocurrencies); &nbsp;Pyramid Schemes (Web 3 \"jobs\"), and taking risky bets with deposits (FTX).</p><p>Yes, I agree with you regarding the Bloomberg interview. I linked <a href=\"https://www.youtube.com/watch?v=C6nAxiym9oc\">this</a> as evidence that he didn't think he was helping his customers. It was quite a viral interview which is why I'm surprised more people in EA weren't talking about it.</p><p>I can't claim to be a crypto expert, but the whole thing looks pretty unethical to me when you see ordinary people regularly losing all of their money. I wish EA was less associated with what I see as a scam industry.</p>", "parentCommentId": "TEGvmagAEyHnzATzm", "user": {"username": "Dean Abele"}}, {"_id": "hJ3sqfrYsBYzK9xsy", "postedAt": "2022-11-14T18:59:09.245Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>I think coming back to this, my point isn't straightforwardly fair. My post above uses a lot of evidence in a way that makes it seem like the point is very obvious.<br><br>I think that bars like \"does the person have public writing showing they deeply understand EA principles\" are generally pretty decent and often have worked decently well.<br><br>The case with SBF does seem extremely unusual to me. Protecting against it isn't just some \"obvious set of regular measures\". It might take a fair deal of thought and effort.<br><br>I think that we should be thinking about how to that thought of effort. I think we should be working to find and assume ways of verification that would have at least caught some lite-SBF.&nbsp;<br><br>So, the example of SBF &nbsp;seemed too good to not share, but &nbsp;it is extreme, so can't be taken too much as a typical example to be worried about.<br><br>I still think that we should set the bar higher than a few blog posts for situations like this though, and assume that Will would agree. (He meant this much more as a quick public statement, and not real evidence of innocence to EAs, I assume)</p>", "parentCommentId": "WuexMfaZk3Xp8HZ9A", "user": {"username": "oagr"}}, {"_id": "MSnbNxBiFRhG5d4Fq", "postedAt": "2022-11-14T20:06:33.548Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>I agree... Was very bothered by the categorical proscriptions against \"ends justifying the means\" as well as the seeming statements that some kinds of ethical epistemology are outside of the bounds of discourse. Seemed very contrary to the EA norm of open discourse on morality being essential to our project.</p>\n", "parentCommentId": "884PenRYpjJyWSWAk", "user": {"username": "Brad West"}}, {"_id": "PtK6Z4xszzDmDyZ4s", "postedAt": "2022-11-15T04:23:04.880Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>Voting ring? That sounds preposterous to me</p>", "parentCommentId": "nt3Dqet3rzW5FHrdj", "user": {"username": "Kristopher Knoplan"}}, {"_id": "CjwHqCwQ5CXo9Acje", "postedAt": "2022-11-17T00:34:56.512Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>Just want to let you know there are <a href=\"https://astralcodexten.substack.com/p/does-georgism-work-is-land-really\">Georgist EAs out there</a>. In my head I put something like 80% odds that Georgism (or maybe just LVT) will be a cause area (i.e. similar to how at first dismissed areas like mental health, wild animal suffering or great power conflict are now considered major cause areas in EA) within the next ten years.<br><br>A second reason I'm writing this comment is so I can look back on it in ten years.</p>", "parentCommentId": "cKbbBz8ffRcDBeSkw", "user": {"username": "Cornelis Dirk Haupt"}}, {"_id": "xKgwi8iNwde2Fp5u4", "postedAt": "2022-11-19T12:09:29.774Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>You are my first reply in this forum, friendly and thorough as one would desire, as I have come in a bad time or a time of need and suffering for a group that seems to know and care about these things, doctor.</p><p>I address you by your title as I would like to offer a reflection on someone who also carries titles: vice admiral sir Francis Drake. &nbsp;The difference a title makes! And their role in disguising the truth of piracy, of slavery, of pillage and plundering! But perhaps more interesting, what some call 'different perspectives of history' but in reality may be &nbsp;a whitewashing and rationalization that was fundamental to the creation of the british empire, that passed through much charity and justified as regulations not having been defined at the time.&nbsp;</p><p>Any crypto enterprise is closer to privateering than to a Ponzi scheme, which in any case is only concensually defined as such postfacto. Privateering, which is less discussed, is a breaking things to go fast approach, fast before regulations catch up as they have anticipated from the very beginning, a quasi anarchic and ambitious career making project that ultimately wants to be in good society, pretend the good, but will never shed its links to piracy.&nbsp;</p>", "parentCommentId": "3Qr3NDMH6g4N5f7jt", "user": {"username": "cookiecut"}}, {"_id": "QxLvEYsHM7tXQpWLT", "postedAt": "2022-11-19T12:11:45.175Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": "<p>Thank you, Cornelis. Yes, I'm a big fan of Lars Doucet. One of my goals was to try to make Georgism an EA cause area. YIMBYism is already a minor EA cause area. However, I don't want to distract from AI safety, particularly if EA is now more funding contained. So I might just do earning to give.</p>", "parentCommentId": "CjwHqCwQ5CXo9Acje", "user": {"username": "Dean Abele"}}, {"_id": "Gyiy5wvP64SdeQ3pt", "postedAt": "2022-11-12T20:53:43.296Z", "postId": "WdeiPrwgqW2wHAxgT", "htmlBody": null, "parentCommentId": "mNdPE6RxQm5J9eXnm", "user": null}]