[{"_id": "aZwbAiydanBBgm5fu", "postedAt": "2015-05-17T13:35:25.223Z", "postId": "WDiBMR2eXmNKSRjvd", "htmlBody": "<p>This is really excellent Jess - thanks for writing it up! I think I have been thinking about things in a very similar way, and strongly identify with pretty much everything you say! </p>\n<p>I started trying out a transition to being (mostly) vegan in September last year, as I thought a move to being 100% vegan straight away would be very difficult (I think most of the costs are 'transition' costs and decrease as you form new habits and learn more about stuff to buy). I have been surprised at how painless it has been, but have not yet tried being 100% vegan. </p>\n<p>At the moment, I think about 85% of my meals are vegan (and the rest vegetarian) - I try to count the non-vegan ones each week. I think you need a clear rule to do this, and I have been using something very similar to what you suggest. I no longer buy animal products at the supermarket, so everything I eat or prepare at home is vegan. But if I am out, or at a seminar/event where there is free food provided and there is no vegan option, I eat vegetarian. I also allow vegetarian eating when I am travelling, or at other people's houses. Most weeks this leads to roughly 3/21 non-vegan meals, but obviously this is a lot higher if I am travelling.</p>\n<p>The way I see this is getting from 85% to 100% is probably the most costly part for me (most inconvenience, most social cost) and I am getting the vast majority of the benefit with very little of the cost. I do feel uncomfortable with that 15% though. I think I will continue until September, and then reasses after a year, maybe getting closer to 100% with new rules. </p>\n", "parentCommentId": null, "user": {"username": "rossaokod"}}, {"_id": "2vpzhpG8dpASdtfyc", "postedAt": "2015-05-17T14:20:46.756Z", "postId": "WDiBMR2eXmNKSRjvd", "htmlBody": "<p>I was 95% vegetarian for about 5 years and found it worked pretty well, even without specific rules.</p>\n<p>In general, I ate meat at major family holiday gatherings, when I was traveling and there were no filling vegetarian options, occasionally when there was particularly ethical meat available, and when the meat in question was clearly headed to the trash can if I didn't eat it.  I think overall I ate meat about once a month, but I didn't keep close track, and the times I ate meat were pretty clustered, so it's hard to estimate.  I certainly felt that I was achieving my goals in being vegetarian.</p>\n<p>One thing that helped me not decide that every friend's birthday was a special occasion was that I just told everyone around me that I was vegetarian.  Since upsetting people's expectations makes me uncomfortable, I would only very rarely eat meat in social settings.</p>\n", "parentCommentId": null, "user": {"username": "ruthie"}}, {"_id": "QbxXt4mtvMQ3Lvjqi", "postedAt": "2015-05-17T14:50:53.404Z", "postId": "WDiBMR2eXmNKSRjvd", "htmlBody": "<blockquote>\n<p>I broadly agree with Katja Grace that if one can use the time/energy/willpower etc. that one would spend being vegetarian/vegan more effectively towards other altruistic activities, then it probably makes sense not to be vegetarian/vegan. But in my personal case, I’m really not sure that the costs of veganism are fungible in this way - perhaps just because they really are relatively small. But I haven’t thought about this a lot, and it’s possible that I could find some way to use the time and/or willpower I’d expend being vegan in an even better way.</p>\n</blockquote>\n<p>Warren Buffet <a href=\"http://calnewport.com/blog/2014/11/11/warren-buffett-on-goals-if-its-not-the-most-important-thing-avoid-it-at-all-costs/\">thinks</a> that in order to be successful, you should focus on doing just a few things well.</p>\n<p>Veganism is a habit that will take time and effort to inculcate and maintain.  (If you've failed multiple times in the past, the outside view suggests it will take effort to avoid failing again.)  And in principle that time and effort could be spent inculcating a habit that will increase your positive impact in other ways.  I'd argue that for most effective altruists, going to your news feed preferences on Facebook and unfollowing every friend who doesn't either talk about EA or make you better in some way (even by making you laugh) is a much higher return on your time than being vegan.  I think I could probably come up with a list of 100+ other such habit changes that are higher ROI for reducing global suffering than veganism.</p>\n<p>Like many people in the EA community, I am concerned with animal suffering.  But switching to veganism seems like a relatively low-impact way to do something about it.  <a href=\"http://www.overcomingbias.com/2012/12/breeding-happier-livestock-no-futuristic-tech-required.html\">Breeding happier livestock</a>, in vitro meat, and <a href=\"http://www.patheos.com/blogs/hallq/2015/02/when-passing-a-law-is-the-easy-route/\">passing laws</a> all seem much higher impact.</p>\n<p>Pragmatically speaking, I think having a few EAs work on one of these challenges full-time would do much more for suffering animals than having many EAs spend the mental overhead necessary to be vegan.  In general, the EA community seems pretty open to “specialization of labor” in the sense that some EAs work at Givewell and rate charities, some earn to give, some grow the EA movement, etc.  I don’t see why we can’t adopt the same approach for animal suffering.  The alternative is the non-pragmatic &quot;<a href=\"https://themerelyreal.wordpress.com/2014/09/13/liberal-purity/\">purity</a>&quot; mindset that animal products are tainted and should not be eaten.  (I prefer <a href=\"http://effective-altruism.com/ea/ip/dissociation_for_altruists/\">dissociation</a> myself, in line with my pragmatic consequentialist values.)</p>\n<p>Anyway, if you do decide to go vegan I’d recommend supplementing creatine and choline; as far as I know there’s no way to get either from animal products and both seem to increase intelligence.  (Maybe you’re supplementing them already?)</p>\n", "parentCommentId": null, "user": {"username": "xccf"}}, {"_id": "DyrT85WiwT9LW8ZD2", "postedAt": "2015-05-17T15:41:27.960Z", "postId": "WDiBMR2eXmNKSRjvd", "htmlBody": "<p>You mentioned the separation of parents and offspring, but it's worth including the effects on the economics of (non-crated) veal production into your considerations. Approximately, each dairy cow is productive for the last three of the five years it is kept alive, and is impregnated once per year to maintain an optimal lactation cycle. <a href=\"http://www.epa.gov/agriculture/ag101/dairyphases.html\">source</a></p>\n<p>I'd hypothesize that the overall amount of suffering experienced per day by an adult animal would be less than the amount of suffering experienced by a calf that's experiencing the stress of separation from its parent. Since they're slaughtered while still in this state, there could be an even better case for veal calves having lives that are overwhelmingly negative.</p>\n", "parentCommentId": null, "user": {"username": "ChrisJenkins"}}, {"_id": "h9PgPXKXwiBh5ccTN", "postedAt": "2015-05-17T15:44:44.744Z", "postId": "WDiBMR2eXmNKSRjvd", "htmlBody": "<p>Thanks for the essay. Before switching to veganism, I think you might want to give a bit more time to the health consequences. Personally, I know quite a few people who have been vegan and people don't tend to be so glowing about the health results. You'd want to take B12, and consider calcium and folate, and generally think more about your sources of nutrition. Whatever there is to be said about 'if you just put in a little effort, you can avoid health detriment', it seems like for the average person, there's some net loss of health.</p>\n", "parentCommentId": null, "user": {"username": "RyanCarey"}}, {"_id": "RqauCv5f7HWZnn3ih", "postedAt": "2015-05-17T15:47:05.790Z", "postId": "WDiBMR2eXmNKSRjvd", "htmlBody": "<p>Very detailed!</p>\n<p>I'm currently in between lacto-ovo vegetarianism and veganism in that I'm a lacto-vegetarian. This is only because I don't currently have a regular income (I'm still in high school), and attempting to replace dairy in particular has been quite an inconvenience.</p>\n<p>So, my experience is that it is a lot less inconvenient to give up eggs than to give up dairy products, so perhaps you could try lacto-vegetarianism, but seeing as you are willing to go &quot;95% vegan&quot; and potentially &quot;100% vegan&quot;, they're probably better in consequentialist terms overall.</p>\n", "parentCommentId": null, "user": {"username": "Vidur_Kapur"}}, {"_id": "XsKkrADEr6TuSDq5T", "postedAt": "2015-05-17T16:10:07.351Z", "postId": "WDiBMR2eXmNKSRjvd", "htmlBody": "<p>I'm in a similar place to you.</p>\n<p>One thing I think about that I didn't see you mention in your post is the pressure to remain consistent with this rise in your moral standards.</p>\n<p>i.e. if eating meat has a Badness Score of -20 but eating dairy has a badness score of -10, then going from vegetarian to vegan seems to apply pressure on you to give up all your other behaviours that fall between -20 and -10 on the spectrum. (Maybe you now have to care more about recycling or something.)</p>\n", "parentCommentId": null, "user": {"username": "Bitton"}}, {"_id": "kHDQfqoNRZCtsRSq9", "postedAt": "2015-05-17T16:26:13.337Z", "postId": "WDiBMR2eXmNKSRjvd", "htmlBody": "<p>Why lump milk and eggs together? I think that a cup of milk requires on the order of minutes of cow &quot;suffering&quot; (and an even smaller amount of calf suffering), and the lives of dairy cows don't seem especially bad. For perspective, a cow produces tens of thousands of dollars of milk in her life. I think it is very unlikely that the welfare of the cow is a big consideration compared to the cost of the milk. Also, cutting dairy is nutritionally/logistically non-trivial. Cutting eggs seems pretty easy.</p>\n<p>The issue isn't just time/energy/willpower. It's making your life worse. There are other ways to make your life worse to make the world better, and you clearly shouldn't (and don't) do all of them. It seems worth picking the ones that get an efficient tradeoff. At the point where you are cutting cheese from your pasta, the tradeoff seems very unfavorable. Many other ways of saving money would be a much more effective tradeoff, as would working like an extra few seconds each day. That's probably true even if you don't spend the money on an effective thing---money is still an indicator that someone else making a sacrifice on your behalf, such that you have to give them money to make them whole.</p>\n<p>I think that if EA's want to signal things, it should be being sensible and interesting rather than being eager to make sacrifices.</p>\n", "parentCommentId": null, "user": {"username": "Paul_Christiano"}}, {"_id": "zuqEngNSZaBeRicxp", "postedAt": "2015-05-17T16:35:50.236Z", "postId": "WDiBMR2eXmNKSRjvd", "htmlBody": "<p>Wonderful essay. Thanks, Jess. A few responses:</p>\n<p>(i) It's not clear to me that the vegan-vegetarian distinction makes sense, as I believe, for example, that consuming eggs or milk can be more harmful (in terms of animal suffering) than certain forms of meat consumption.</p>\n<p>(ii) Related to (i) (and to Paul_Christiano's point re &quot;other ways to make your life worse to make the world better&quot;), other than for signalling/heuristic reasons, I don't think being categorically vegan/vegetarian is all that important. I believe that reducing animal products in my diet is always a good thing. I also believe that not buying coffee at coffee shops and, instead, donating the money to an animal-welfare organization is always a good thing. But I don't make the latter a categorical life philosophy. For that reason, I treat my diet just like every other facet of my life: I try to understand the consequences of my actions, identify the ethically ideal direction, and move in that direction wherever I reasonably can, recognizing that I am a deeply imperfect ethical actor.</p>\n<p>(iii) Soylent is the solution to all!! It's now vegan, good for you, cheap, etc. I'd consume it in place of most meals even if I had no regard for animal welfare.</p>\n", "parentCommentId": null, "user": {"username": "mhpage"}}, {"_id": "ZJNHqWuMqrXtgvtD9", "postedAt": "2015-05-17T16:51:11.369Z", "postId": "WDiBMR2eXmNKSRjvd", "htmlBody": "<p>Yeah, good point. I'm definitely a lot less concerned about eating dairy than I am eggs. The main reason for lumping them together is that I think I'd find it quite a bit easier psychologically to be &quot;vegan&quot; than to be someone who &quot;doesn't eat eggs&quot;, and I think I'd be more likely to keep it up, but it's possible that's more malleable than I think. </p>\n<p>I'm not totally convinced that not eating dairy will make my life worse in any nontrivial way, though. I enjoy eating cheese, sure, but it's not an experience that's unlike any other. I'm pretty sure that the difference in enjoyment in a life in which I eat dairy products and one in which I don't will basically be completely trivial.</p>\n", "parentCommentId": "kHDQfqoNRZCtsRSq9", "user": {"username": "Jess_Whittlestone"}}, {"_id": "YMNhdS3mnPWyLXK46", "postedAt": "2015-05-17T16:51:37.230Z", "postId": "WDiBMR2eXmNKSRjvd", "htmlBody": "<p>Regarding willpower: If you maintain a vegan diet for a few months, it will probably stop requiring willpower since you will stop thinking of animal products as an option that you have available. This has been my experience and the experience of lots of other vegans, although it's probably not universal.</p>\n<p>Does it take willpower for you to be vegetarian? If not, then it probably won't take willpower for you to be vegan either once you get used to it. (It will certainly still take willpower while you're still transitioning.)</p>\n<p>Regarding time: In some ways veganism takes more time because sometimes you have to look harder to find products you can eat, but it some ways it takes less time because decisions are easier when you have fewer options. For me personally it's probably about a wash. (The biggest time loss is talking about it on the internet a lot.)</p>\n<p>I think Katja's argument about willpower proves too much, because it says you should not do anything that requires time/willpower that you could be expending on EA activities. It seems to imply that you should stop exercising and start eating unhealthy food whenever you want because that will leave you more time and willpower for more effective pursuits. The way people apply this argument to veganism but not to anything else looks suspiciously like motivated reasoning. (Although it's possible that people just tend to be more reflective when considering veganism but they don't put the same level of thought into most other decisions, so this argument doesn't come up.)</p>\n", "parentCommentId": null, "user": {"username": "MichaelDickens"}}, {"_id": "5MCKkHMBPtQS9ev7o", "postedAt": "2015-05-17T16:52:53.659Z", "postId": "WDiBMR2eXmNKSRjvd", "htmlBody": "<p>Yeah, I think lacto-vegetarianism is probably 95% of the way in terms of impact on animal suffering anyway (or even more.) As I said above, for me the main reason for cutting out dairy too is that I think if I eat dairy I might be more likely to slip into eating eggs too down the line. But it's possible I could just protect against that by setting more solid rules in place etc.</p>\n", "parentCommentId": "RqauCv5f7HWZnn3ih", "user": {"username": "Jess_Whittlestone"}}, {"_id": "ntj9ZoTMwS7J6LLeq", "postedAt": "2015-05-17T17:03:40.004Z", "postId": "WDiBMR2eXmNKSRjvd", "htmlBody": "<p>I like the idea of counting non-vegan meals, that sounds great. Maybe I'll beemind it... then I'd have an incentive to keep it low, but I don't have to be absolute about it. Diana told me that whenever she eats something non-vegan she makes a donation to an animal welfare charity - I like that idea too.</p>\n<blockquote>\n<p>The way I see this is getting from 85% to 100% is probably the most costly part for me (most inconvenience, most social cost) and I am getting the vast majority of the benefit with very little of the cost. I do feel uncomfortable with that 15% though. I think I will continue until September, and then reasses after a year, maybe getting closer to 100% with new rules.</p>\n</blockquote>\n<p>Yeah, I think that's right. It's quite possible that the main downside of not going 100% vegan is just the discomfort that you end up feeling about it! (And that in particular this is larger than any actual consequences, especially if you're mostly eating dairy.)</p>\n", "parentCommentId": "aZwbAiydanBBgm5fu", "user": {"username": "Jess_Whittlestone"}}, {"_id": "FpehpJg7qbQM5Mx7Q", "postedAt": "2015-05-17T17:06:10.932Z", "postId": "WDiBMR2eXmNKSRjvd", "htmlBody": "<p>I wonder why the only points discussed are about animal ethics. The strongest point for going vegan is simply enviromental (and thereby more about human ethics). The UN did a study on the enviromental effects of livestock called 'Livestock's Long Shadow'. When I do out myself as a vegan, I try to steer the discussion away from animal ethics (unless I can make a few points there) since with the denialists this turns way too philosophical and tedious.</p>\n<p>&quot;Warren Buffet thinks that in order to be successful, you should focus on doing just a few things well.&quot; -xccf</p>\n<p>Yea, fuck ethics. No seriously what? You can't change a cultural habit because other things you're doing will suffer? E.g. if you wanna be a successful investment banker don't leave your sect, cause managing two things in your life is too difficult. Sorry, that's just plain laziness. Though if you are not living in a larger city, your point might just be valid. In the larger german city I live in it was fairly easy to find vegan supplements.</p>\n<p>I think it's just a matter of time, there are some interesting startups tackling meat like products and as soon as they'll beat the price of &quot;real meat&quot; (which is very likely given the effort animal products take) change will come and I speculate that we will enter the era of hindsight ethics in which everyone will be pro-animal rights. And if you allow the Schadenfreude, I'll be glad to tell my grandkids that I was on the right side of the fence.</p>\n", "parentCommentId": null, "user": {"username": "Gregor"}}, {"_id": "b632FnnSqDuZvCf6N", "postedAt": "2015-05-17T18:03:44.561Z", "postId": "WDiBMR2eXmNKSRjvd", "htmlBody": "<p>Great post Jess! I was ~99% vegan from August to February and since then I've been vegan. When I was 99percent I didn't drink milk, eat eggs and only ate cheese 4-5 times for pizza or vegetarian salads. I also ate things that contained small amounts of egg whites or milk powder. I'm currently vegan but I think I might start eating things that contain small amounts of milk powder. The lives of dairy cows are, as you mention, not as bad as for example chicken and cows produce large quantities of milk per day, so the suffering caused per gram of milk powder would be pretty low. I'm not particularly interested in &quot;moral purity&quot; and I have experienced people seeming off-put by veganism, and to some extent vegetarianism too, by me being strictly vegan so I'm not entirely sure that me being strictly vegan has a net positive impact. I probably won't be eating cheese though since the production of cheese involves rennet, which makes it almost non-vegetarian in my eyes. </p>\n", "parentCommentId": null, "user": {"username": "Erik_Engelhardt"}}, {"_id": "6HyDuaMLrsips7hfk", "postedAt": "2015-05-17T18:18:00.870Z", "postId": "WDiBMR2eXmNKSRjvd", "htmlBody": "<blockquote>\n<p>Regarding willpower: If you maintain a vegan diet for a few months, it will probably stop requiring willpower since you will stop thinking of animal products as an option that you have available. This has been my experience and the experience of lots of other vegans, although it's probably not universal.</p>\n</blockquote>\n<p>Yeah, my experience previously has been that the willpower required mostly decreases over time - there was definitely a time a while ago when the thought of buying and eating eggs was kind of absurd to me. This was slightly counterbalanced by sometimes getting odd cravings for animal products, though. I think that if I put conscious effort into developing negative associations around animal products, though, I could probably end up in a situation where it took zero willpower. That would obviously take effort though.</p>\n<blockquote>\n<p>Does it take willpower for you to be vegetarian? If not, then it probably won't take willpower for you to be vegan either once you get used to it.</p>\n</blockquote>\n<p>No, being vegetarian takes zero willpower for me, but I was raised vegetarian, so I have hardly eaten any meat in my entire life, so I have very little desire to eat it - and even an aversive reaction to a lot of meat. (Which I'm very grateful to my parents for!)</p>\n", "parentCommentId": "YMNhdS3mnPWyLXK46", "user": {"username": "Jess_Whittlestone"}}, {"_id": "jYw3P2qqmEf4ND9Zn", "postedAt": "2015-05-17T18:21:43.423Z", "postId": "WDiBMR2eXmNKSRjvd", "htmlBody": "<blockquote>\n<p>To what extent will me being vegan lead others to consider their dietary choices more seriously compared to if I’m just vegetarian? Could it even be worse, if I seem too “weird” or “extreme” for people to seriously identify with?</p>\n</blockquote>\n<p>It's pretty hard to know exactly what subconscious and conscious impression you leave on people by being vegan. On one hand, it might seem a bit weird and hard. But one could also argue that you being vegan makes vegetarianism seem less weird and extreme, thus making them consider being vegetarian more seriously. </p>\n<p>Small anecdote: one of my friends went from eating fish and birds to become a vegan simply by meeting someone who showed her how to be a vegan without much hassle.</p>\n", "parentCommentId": null, "user": {"username": "Erik_Engelhardt"}}, {"_id": "Y7DDuJwb8zRxbvQRc", "postedAt": "2015-05-17T20:18:44.162Z", "postId": "WDiBMR2eXmNKSRjvd", "htmlBody": "<p>A neglected consideration in favor of veganism is that it gives one greater signalling flexibility over most other diets. Depending on one's audience, one can honestly describe oneself as a &quot;vegetarian&quot;, a &quot;lacto-vegetarian&quot;, a &quot;reducetarian&quot;, etc. as well as a &quot;vegan&quot;. The importance of this consideration will depend on the relative impact of signalling versus direct effects, the benefits of sending different signals in different contexts, the intrinsic and instrumental value of honesty, and other factors.</p>\n", "parentCommentId": null, "user": {"username": "Pablo_Stafforini"}}, {"_id": "uQuLvaEYauee486A2", "postedAt": "2015-05-17T20:34:13.191Z", "postId": "WDiBMR2eXmNKSRjvd", "htmlBody": "<p>I use the recycling analogy when talking to people about this issue. I consider myself to be one-who-recycles, but if I have bottle in my hand and there's nowhere convenient to recycle it, I'll throw it away. Holding onto that bottle all day because I've decided I'm a categorical recycler seems kind of silly. I treat food the same way.</p>\n<p>Regarding your broader point re consistency, my guess is that we way over-emphasize the effect of diet over other relatively cost-less things we can do to make the world a better place -- in large part because there are organized social movements around diet. That of course doesn't necessarily mean we should eat more animal products but rather that we should try to identify other low-hanging-fruit means of improving the world. </p>\n", "parentCommentId": "XsKkrADEr6TuSDq5T", "user": {"username": "mhpage"}}, {"_id": "JxPdeqvb3JenMX7J4", "postedAt": "2015-05-17T23:30:06.258Z", "postId": "WDiBMR2eXmNKSRjvd", "htmlBody": "<p>Thanks for writing this Jess, I feel like it's an important topic for many &quot;near vegans&quot;. I'd like to share my thoughts on it.</p>\n<p>I'm for a loose vegan diet in which dairy and eggs are cut down by about 95% of today's average consumption. </p>\n<p>I hold that as a pretty desirable goal -even for signalling- because if everyone consumed that little, farm animals could probably be ensured very good lives.</p>\n<p>Secondly, being completly vegan may easily take a slight toll on one's health, and not everyone finds taking supplements attractive.</p>\n<p>Some practical ways I use to mantain the 95% level are:</p>\n<ul>\n<li><p>replacing all 'easy' things, such as milk with veg milks;</p>\n</li>\n<li><p>virtually cutting off stand-alone cheese and eggs (i.e. eating them only when they are found as ingredients), especially when eating with others, or when those products are much cheaper than 100% vegan alternatives...EAs will know how to spend that $ difference well;</p>\n</li>\n<li><p>substitute honey with sugar [although I'm not confident we should care so much about bees, which arguably can't suffer much at all and anyway only have their honey 'stolen'. If we really go down that road, then we ought not to eat plants harvested with tractors (that kill mice + insects) and see weekend car trips as a mass death sentence by windshield]</p>\n</li>\n<li><p>decent consumption of mussels and oysters: they're probably non-sentient and they contain a boatload of (heme) iron and vitam B12, the most problematic nutrients for vegans. ( <a href=\"http://sentientist.org/.../the-ethical-case-for-eating.../\">http://sentientist.org/.../the-ethical-case-for-eating.../</a> <a href=\"http://www.slate.com/.../2010/04/consider_the_oyster.html\">http://www.slate.com/.../2010/04/consider_the_oyster.html</a> )</p>\n</li>\n</ul>\n<p>While I really appreaciate their motives, I'm not convinced by the black-or-white views that many vegans hold, believing as they do that their rules are the holy grail of morality. A presumptuos Jain (if one exists) would look at them with greater abhorrence than they do on everyone else.</p>\n", "parentCommentId": null, "user": {"username": "Alberto_E_Sichirollo"}}, {"_id": "Gv6mKo6piCJJDbKLj", "postedAt": "2015-05-18T02:03:59.657Z", "postId": "WDiBMR2eXmNKSRjvd", "htmlBody": "<p>The world has many problems.  I could point to any one of those problems and say &quot;Why aren't you trying to solve it?&quot;  And then when you responded, I could say &quot;Sorry, that's just plain laziness.  You should be working to solve it along with everything else you are trying to do.&quot;</p>\n<p>For a consequentialist like me who makes no act/omission distinction, that's how your argument sounds.  The reason that it's a bad argument is that your resources are finite.  The way to be an EA is to figure out which cause is the best use of your resources on the margin and spend your resources on that cause: <a href=\"http://www.slate.com/articles/arts/everyday_economics/1997/01/giving_your_all.html\">http://www.slate.com/articles/arts/everyday_economics/1997/01/giving_your_all.html</a></p>\n<blockquote>\n<p>E.g. if you wanna be a successful investment banker don't leave your sect</p>\n</blockquote>\n<p>I'm not exactly sure what you're trying to say here.  By &quot;sect&quot; do you mean religious sect?  If an EA finds emotional support from their religious sect and maintaining those ties seems like one of their best options available for staying mentally healthy, I'm in favor of them staying in it.  If leaving the sect makes them sad for a month but after that they are happier and more productive, I'd say leave it.  I don't see the relevance.</p>\n<blockquote>\n<p>I think it's just a matter of time, there are some interesting startups tackling meat like products and as soon as they'll beat the price of &quot;real meat&quot; (which is very likely given the effort animal products take) change will come</p>\n</blockquote>\n<p>My impression is the same.  That's why I think it's a much better use of resources to try to hasten that day than eat vegan.  I'd guess that bringing forward the development of quality in vitro meat by a single day would do much more for animal suffering than converting the entire EA movement as it currently stands to veganism.</p>\n", "parentCommentId": "FpehpJg7qbQM5Mx7Q", "user": {"username": "xccf"}}, {"_id": "tEBXd7kcDQe3izBMe", "postedAt": "2015-05-18T08:09:27.748Z", "postId": "WDiBMR2eXmNKSRjvd", "htmlBody": "<blockquote>\n<p>The way people apply this argument to veganism but not to anything else looks suspiciously like motivated reasoning. </p>\n</blockquote>\n<p>I endorse this argument and apply it across the board. Is there some place in particular you think people fail to apply it?</p>\n<p>Note that the argument against exercising is quantitatively <em>much</em> weaker than the argument against veganism.</p>\n", "parentCommentId": "YMNhdS3mnPWyLXK46", "user": {"username": "Paul_Christiano"}}, {"_id": "HoDLHPBQQsR9abech", "postedAt": "2015-05-18T11:36:40.277Z", "postId": "WDiBMR2eXmNKSRjvd", "htmlBody": "<blockquote>\n<p>The way people apply this argument to veganism but not to anything else looks suspiciously like motivated reasoning.</p>\n</blockquote>\n<p>I wrote a comment, the commenting system ate it, so I rewrote my response as a blog post: <a href=\"http://www.jefftk.com/p/applying-the-best-tradeoff-argument-generally\">http://www.jefftk.com/p/applying-the-best-tradeoff-argument-generally</a></p>\n", "parentCommentId": "YMNhdS3mnPWyLXK46", "user": {"username": "Jeff_Kaufman"}}, {"_id": "99tfYX4gbJDASoeoh", "postedAt": "2015-05-18T12:23:08.927Z", "postId": "WDiBMR2eXmNKSRjvd", "htmlBody": "<blockquote>\n<p>For a consequentialist like me who makes no act/omission distinction, that's how your argument sounds. The reason that it's a bad argument is that your resources are finite. The way to be an EA is to figure out which cause is the best use of your resources on the margin and spend your resources on that cause.</p>\n</blockquote>\n<p>So am I, I just don't see the big cost in ressources while I do think the cost in ressources livestock has is proven.</p>\n<blockquote>\n<p>I'm not exactly sure what you're trying to say here.</p>\n</blockquote>\n<p>I admit, the analogy wasn't as clear as I hoped it would be. My point was that we have the capacity to solve multiple problems in our lives. Peter Dinklage is an awesome actor while being vegan... so yeah.. Not my strongest argument maybe :D</p>\n<blockquote>\n<p>I'd guess that bringing forward the development of quality in vitro meat by a single day would do much more for animal suffering than converting the entire EA movement as it currently stands to veganism.</p>\n</blockquote>\n<p>A good way to bring development forward in an open market is to generate demand and from my personal experience (excuse the irrationality, or not) vegans tend to generate a higher demand for such products. So why the false dichotomy?</p>\n", "parentCommentId": "Gv6mKo6piCJJDbKLj", "user": {"username": "Gregor"}}, {"_id": "7KnvkARf2JeumAvXB", "postedAt": "2015-05-18T13:31:18.016Z", "postId": "WDiBMR2eXmNKSRjvd", "htmlBody": "<p>I agree with Paul that there's a big gulf between milk and eggs. I wish we had a short, 5-letter word for \"lacto-vegetarian\" and that more people advocated lacto-vegetarianism as the baseline, since lacto-vegetarianism is quite a bit easier than veganism but has almost the same animal impact.</p>\n<p>\"Veganism\" is a Schelling point but isn't morally special, because you could go further still by choosing the plant products that <a href=\"http://reducing-suffering.org/crop-cultivation-and-wild-animals/#A_specific_attempt_at_ranking\">are better for wild animals</a>, by driving less to reduce the <a href=\"https://en.wikipedia.org/wiki/Roadkill#Insects\">insects killed by that</a>, by doing more animal activism, etc.</p>\n", "parentCommentId": "5MCKkHMBPtQS9ev7o", "user": {"username": "Brian_Tomasik"}}, {"_id": "pWRKEfAbDDcvmovCB", "postedAt": "2015-05-18T15:11:42.409Z", "postId": "WDiBMR2eXmNKSRjvd", "htmlBody": "<p>The demand point is an interesting one.  I'd guess that funding in vitro meat development directly with earnings from a high-paying job is still much more promising than buying vegan food products in the hope that your actions will be reflected in statistics in the hope that investors will act on those statistics in order to invest in in vitro meat.  Other issues:</p>\n<ul>\n<li><p>Self-interested investors may not fund the basic research necessary for in vitro meat development if it's too far out.</p>\n</li>\n<li><p>Research funded by self-interested investors will likely be kept secret in order to maintain a competitive advantage.</p>\n</li>\n</ul>\n<p>BTW, these are the only ACE links I can find that seem to discuss in vitro meat in significant depth.  I'd be interested to see further EA coverage of the topic.</p>\n<p><a href=\"http://www.animalcharityevaluators.org/research/organizations/new-harvest/\">http://www.animalcharityevaluators.org/research/organizations/new-harvest/</a></p>\n<p><a href=\"http://www.animalcharityevaluators.org/blog/beyond-meat-vs-new-harvest/\">http://www.animalcharityevaluators.org/blog/beyond-meat-vs-new-harvest/</a></p>\n<blockquote>\n<p>So why the false dichotomy?</p>\n</blockquote>\n<p>Your time, energy, and attention are limited.  Time/energy/attention spent on veganism takes away from your stock to spend on other stuff.</p>\n", "parentCommentId": "99tfYX4gbJDASoeoh", "user": {"username": "xccf"}}, {"_id": "2sKiGtStdGxEkz6m5", "postedAt": "2015-05-18T16:21:07.530Z", "postId": "WDiBMR2eXmNKSRjvd", "htmlBody": "<p>Thanks a lot for this Jess, I'm in a similar situation, and have gone through similar considerations (though perhaps not articulated as clearly as yours!) Here are some of those thoughts, which I hope are the sort of thing you were looking for even though I'm <em>not</em> one of the people who's thought about it more than you, and also am not particularly well versed in the relevant empirical facts.</p>\n<blockquote>\n<p>Consequentialist considerations aren’t the only thing motivating me. To be honest, a huge part of my motivation comes from a strong emotional sense of “I don’t like this, and I don’t want to be part of it.” The more I think and learn about the industry that produces my milk and eggs, the more uncomfortable and upset I feel about it, and the more I feel that I want to completely disassociate myself from it.</p>\n</blockquote>\n<blockquote>\n<p>I know this isn’t exactly in line with the EA mentality of using reason and evidence to determine the ethical choices we make. </p>\n</blockquote>\n<p>I don't think this is out of line with EA. First, this sense can point to consequentialist considerations, and trusting it somewhat in some circumstances can be a good heuristic for avoiding bad consequences even when you can't immediately list them all. Secondly, <a href=\"http://effective-altruism.com/ea/eg/effective_altruism_and_consequentialism/\">effective altruism isn't consequentialism</a>. </p>\n<blockquote>\n<p>By going vegan myself, therefore, there’s some chance I’ll encourage others to think more about their dietary choices and reduce their consumption of animal products. I’m never going to be a militant vegan who tries to persuade everyone else she meets to go meat-free - it’s just not my personality and I think it’s unlikely to be effective - but I’m happy to strike up non-confrontational conversations and discuss my reasons with people.</p>\n</blockquote>\n<p>The extent to which you'll reduce others' consumption of animal products will vary hugely depending on your personality and approach - right down to approximately zero reduction. If you actively strike up non-confrontational conversations you'll probably do more than most! By contrast, I think I've only had a mild influence on one close person, and that hasn't affected their behaviour (though there are temporary situational impediments to this anyway). </p>\n<blockquote>\n<p>I broadly agree with Katja Grace that if one can use the time/energy/willpower etc. that one would spend being vegetarian/vegan more effectively towards other altruistic activities, then it probably makes sense not to be vegetarian/vegan</p>\n</blockquote>\n<p>Is this because you think your altruistic activities have astronomical impact, as I guess Katja does? I don't for my own part, so I've never wanted to rely on this being true for me.</p>\n<blockquote>\n<p>in my personal case, I’m really not sure that the costs of veganism are fungible in this way - perhaps just because they really are relatively small</p>\n</blockquote>\n<p>In my case it's pretty clear they are - perhaps because they are relatively large for me! I definitely think vegetarianism's notably reduced my happiness, and veganism did so significantly more, which has both an intrinsic cost and large knock-on ones.</p>\n<blockquote>\n<p>In theory this seems like it could work, but my main concern is that it’s much easier to stick to a very simple rule - “I’m a vegan” - than it is to stick to a vaguer one - “I’m 95% vegan.”</p>\n</blockquote>\n<p>Totally agree - besides the costs you mention, I found there was a significant willpower cost from turning each potential non-vegan meal into a weighty moral decision.</p>\n", "parentCommentId": null, "user": {"username": "Tom_Ash"}}, {"_id": "kC9ByYmkGSWS4SzhK", "postedAt": "2015-05-18T17:01:00.457Z", "postId": "WDiBMR2eXmNKSRjvd", "htmlBody": "<p>I can sympathize with this perspective, but if you are actually on the fence regarding animal welfare concerns, it seems like it would be a shame if you ended up eating eggs because you didn't want to give up milk! (e.g. if you actually caved because of cheese/butter).</p>\n<p>If you haven't tried just avoiding eggs, it seems worth at least trying.</p>\n<p>If the only reason it's psychologically harder is that &quot;vegan&quot; is a more familiar concept, then you will also be doing significant auxiliary good by giving more currency to lacto-vegetarianism. I expect more people would adopt this than would adopt veganism (if the two concepts had equal currency), and it seems basically equally morally good.</p>\n<p>I don't understand the &quot;completely trivial difference&quot; line. How do you think it compares to the quality of life lost by eating somewhat cheaper food? For me, the cheaper food is much more cost-effective, in terms of world-bettering per unit of foregone joy.</p>\n", "parentCommentId": "ZJNHqWuMqrXtgvtD9", "user": {"username": "Paul_Christiano"}}, {"_id": "PeqeP2ceqYjxtohpS", "postedAt": "2015-05-18T19:42:08.579Z", "postId": "WDiBMR2eXmNKSRjvd", "htmlBody": "<blockquote>\n<p>If you haven't tried just avoiding eggs, it seems worth at least trying.</p>\n</blockquote>\n<p>Yeah, that seems right! </p>\n<blockquote>\n<p>I don't understand the &quot;completely trivial difference&quot; line. How do you think it compares to the quality of life lost by eating somewhat cheaper food? For me, the cheaper food is much more cost-effective, in terms of world-bettering per unit of foregone joy.</p>\n</blockquote>\n<p>I think this is probably just a personal thing - for me I think eating somewhat cheaper food would be worse in terms of enjoyment than cutting out dairy. The reason I say it's a basically trivial difference is that, while I enjoy dairy products, I don't think I enjoy them <em>more</em> than I enjoy various other foods - they're just another thing that I enjoy. So given that I can basically replace all the non-vegan meals I would normally have with vegan meals that I like as much (which requires some planning, of course), then I don't think there will be much, if any, difference in my enjoyment of food over time. I also think that even a very small difference in the pleasure I get from eating dairy vs vegan food would be trivial in terms of my happiness/enjoyment over my life as a whole, or even any day as a whole - I don't think I'd ever look back on a day and think &quot;Oh, my enjoyment of that day would have been so much greater if I'd eaten cheese.&quot; I enjoy food, but it's not that big a deal relative to a lot of other more important things.</p>\n", "parentCommentId": "kC9ByYmkGSWS4SzhK", "user": {"username": "Jess_Whittlestone"}}, {"_id": "5CoX83Djiwxrj9hEu", "postedAt": "2015-05-18T21:34:59.896Z", "postId": "WDiBMR2eXmNKSRjvd", "htmlBody": "<p>What do you mean &quot;quantitatively&quot; weaker?</p>\n", "parentCommentId": "tEBXd7kcDQe3izBMe", "user": {"username": "MichaelDickens"}}, {"_id": "sebqJWSnEu4485ELT", "postedAt": "2015-05-18T21:40:30.568Z", "postId": "WDiBMR2eXmNKSRjvd", "htmlBody": "<p>Thanks Jeff! You make a good point there—people do apply this sort of argument in a lot of cases, and lots of times they're right to do so. It looks like I fell prey to the &quot;failure to think of examples implies no examples exist&quot; fallacy.</p>\n", "parentCommentId": "HoDLHPBQQsR9abech", "user": {"username": "MichaelDickens"}}, {"_id": "AgTfWWZimk2RhLTfp", "postedAt": "2015-05-19T07:34:46.975Z", "postId": "WDiBMR2eXmNKSRjvd", "htmlBody": "<p>That seems like a good system. Presumably you changed it after the 5 years - in what way, and why? (I hope you feel it's OK to say if you ate more meat - I for one won't judge as I find vegetarianism too difficult even though I buy the arguments for it. Much harder than the 'small, set %' version of EA I do anyway.)</p>\n", "parentCommentId": "2vpzhpG8dpASdtfyc", "user": {"username": "Nekoinentr"}}, {"_id": "HjzyX7TyixmgFrpr4", "postedAt": "2015-05-19T07:39:21.870Z", "postId": "WDiBMR2eXmNKSRjvd", "htmlBody": "<blockquote>\n<p>I think this is probably just a personal thing - for me I think eating somewhat cheaper food would be worse in terms of enjoyment than cutting out dairy. </p>\n</blockquote>\n<p>People's mileage on these things clearly varies very much, leading to a lot of talking past one another.</p>\n", "parentCommentId": "PeqeP2ceqYjxtohpS", "user": {"username": "Nekoinentr"}}, {"_id": "cQxpzmYQNAiZuhr3D", "postedAt": "2015-05-19T16:13:36.895Z", "postId": "WDiBMR2eXmNKSRjvd", "htmlBody": "<p>Both of these arguments are based on quantitative details---how much benefit do you get per unit of personal cost? It's not a general argument against doing hard things. I think the tradeoffs look more favorable for exercise.</p>\n", "parentCommentId": "5CoX83Djiwxrj9hEu", "user": {"username": "Paul_Christiano"}}, {"_id": "ao9h3z95pk7PR3aia", "postedAt": "2015-05-19T17:32:13.507Z", "postId": "WDiBMR2eXmNKSRjvd", "htmlBody": "<p>The trade-off argument is right as far as it goes, but that might not be as far as we think: the metaphor of the &quot;will power points&quot; seems problematic. As MichaelDickens and Jess note, many lifestyle changes have initial start-up costs but no ongoing costs. And many things we think will have ongoing costs do not (see, e.g., studies showing more money and more things don't on average make us happier; conversely, less money and fewer things might not make us less happy). An earning-to-give investment banker might use the trade-off logic to explain why she is not selling her sports car for a Honda Civic, and while that might be right in some cases, I think more often it would be wrong. Point being, it would be a shame if we used the trade-off argument to avoid trying lifestyle changes that, long term, might have no (or small) ongoing costs to our quality of life.</p>\n<p>More generally, diet is not a binary choice. Avoid animal products when it's convenient; don't when it's inconvenient. Over time, you might learn it's not as inconvenient as you thought. </p>\n", "parentCommentId": "YMNhdS3mnPWyLXK46", "user": {"username": "mhpage"}}, {"_id": "2zQzCaxmD5Ayn6x6t", "postedAt": "2015-05-19T21:21:15.486Z", "postId": "WDiBMR2eXmNKSRjvd", "htmlBody": "<p>It changed for medical reasons, so unrelated to how I felt the policy was working for me in terms of balancing temptation with my reasons for doing it.  I'd like to go back to it, or something like it, but I don't know how to do it without spending a lot more energy thinking about food than I want to right now.</p>\n", "parentCommentId": "AgTfWWZimk2RhLTfp", "user": {"username": "ruthie"}}, {"_id": "jv2EvLMPme5x3Fahn", "postedAt": "2015-05-20T14:29:10.744Z", "postId": "WDiBMR2eXmNKSRjvd", "htmlBody": "<p>Congrats on writing this up and coming to a good conclusion.  It makes me want to be more vegan!  My guess is that milk produces <a href=\"http://everydayutilitarian.com/essays/how-much-suffering-is-in-the-standard-american-diet/\">the lowest amount of animal suffering</a> relative to other animal products, so what do you think of eating milk and cheese but not eggs?  That's usually my approach.</p>\n<p>Also, a problem I have is that egg is contained within a lot of things.  How do you do deal with that?</p>\n", "parentCommentId": null, "user": {"username": "Peter_Hurford"}}, {"_id": "r9tjRiSxHL7jyvD97", "postedAt": "2015-05-20T22:52:28.711Z", "postId": "WDiBMR2eXmNKSRjvd", "htmlBody": "<p>&quot; (see, e.g., studies showing more money and more things don't on average make us happier;&quot;</p>\n<p>The studies do show having more money does make people feel happier. See RCTs of cash transfers like <a href=\"http://www.givewell.org/international/top-charities/give-directly\">GiveDirectly's</a>, and household <a href=\"http://reflectivedisequilibrium.blogspot.com/2014/01/turning-log-consumption-into-measure-of.html\">data within and between countries</a>. You get less happiness per dollar as you have more, but an n% fall or rise in income still has happiness effects in the same ballpark.</p>\n", "parentCommentId": "ao9h3z95pk7PR3aia", "user": {"username": "CarlShulman"}}, {"_id": "6HrDYcGtD9KcYbH47", "postedAt": "2015-05-21T09:32:10.443Z", "postId": "WDiBMR2eXmNKSRjvd", "htmlBody": "<p>Milk might also be the easiest thing to replace with lots of vegan milks including chocolate milk. I've also found it the hardest thing to go back to as cows milk begins to always smell like it's gone off.</p>\n", "parentCommentId": "jv2EvLMPme5x3Fahn", "user": {"username": "DavidNash"}}, {"_id": "Xmjc9BaEJ5yPhSE5M", "postedAt": "2015-05-22T19:56:39.281Z", "postId": "WDiBMR2eXmNKSRjvd", "htmlBody": "<p>That seems perfectly reasonable, and like your energy and willpower is plausibly better spent on other things (says I, as a possibly rationalising meat eater).</p>\n", "parentCommentId": "2zQzCaxmD5Ayn6x6t", "user": {"username": "Nekoinentr"}}, {"_id": "7fArERgLgPAqjFsc2", "postedAt": "2015-05-24T12:34:23.776Z", "postId": "WDiBMR2eXmNKSRjvd", "htmlBody": "<p>I am about 85% vegetarian. I suspect telling people that I am &quot;reducing my meat consumption because I think trying to eat less meat is a good thing&quot; probably has a greater signalling impact on my meat eating friends than telling them I am vegetarian. Reducing meat consumption comes across as an easy thing that anyone can do.</p>\n<p>(The rule I follow is not to ever eat meat except if it it is convenient, or cheaper, or I am offered it, or I feel like it etc. Also to aim for higher welfare stuff)</p>\n", "parentCommentId": null, "user": {"username": "weeatquince"}}, {"_id": "YSaHDB2rWLKFR9Rbq", "postedAt": "2015-05-25T18:12:46.075Z", "postId": "WDiBMR2eXmNKSRjvd", "htmlBody": "<p><em>sparkle fingers</em></p>\n", "parentCommentId": "zuqEngNSZaBeRicxp", "user": {"username": "Robert_Wiblin"}}, {"_id": "H3W8FjWjv24ykPmaD", "postedAt": "2015-05-25T18:19:23.453Z", "postId": "WDiBMR2eXmNKSRjvd", "htmlBody": "<p>Good analysis. I used to be vegan and now am in the 95% vegan camp for the reasons you outlined. By 95% vegan, I mean I eat milk and cheese in cases where avoiding them is inconvenient or impractical.</p>\n<p>I also eat mussels because I'm confident they are not sentient, and they fill in some of the potential nutrient deficits within a vegan diet. More on this here:</p>\n<p><a href=\"http://sentientist.org/2013/05/20/the-ethical-case-for-eating-oysters-and-mussels/\">http://sentientist.org/2013/05/20/the-ethical-case-for-eating-oysters-and-mussels/</a>\n<a href=\"http://sentientist.org/2013/06/15/oystersmusselspt2/\">http://sentientist.org/2013/06/15/oystersmusselspt2/</a></p>\n", "parentCommentId": null, "user": {"username": "Robert_Wiblin"}}, {"_id": "84gyWqKGsSKssJ3ER", "postedAt": "2015-05-27T07:02:27.529Z", "postId": "WDiBMR2eXmNKSRjvd", "htmlBody": "<p>I have three thoughts:</p>\n<p>1) I think people often undervalue the benefit of a generally vegan or vegetarian diet when they raise the &quot;best tradeoff&quot; argument.  The financial costs are of being a vegan or vegetarian are relatively small, if there are any, so there is no financial opportunity cost.  It is not as though we are giving up the chance to financially support a highly effective organization by choosing beans over meat.  The psychological &quot;cost,&quot; as other posters have pointed out, almost certainly diminishes over time.  Further, and more importantly, I'm not sure we can evaluate psychological cost in the same way that we evaluate financial cost.  It is not as though I am giving up the ability to make some other sacrifice because I am sacrificing meat.  I'm not sure it works that way.  Finally, while there is a small time commitment, it doesn't seem substantial enough to warrant an argument that we could have done something in that time that would have a greater impact.  However, particularly with regards to vegetarianism, the good accomplished can be very significant.  Depending on one's meat of choice, it isn't outrageous to think that a vegetarian could easily save the lives of 50-75 animals every year.  The good represented by that will depend on what types of animals, certainly, but it seems impossible to me that more good could be accomplished in the extra hour per week that someone spends on meal planning or reading up on the vegetarian lifestyle.</p>\n<p>For an additional comment on something relevant to the &quot;best tradeoff&quot; argument, see my third comment below.</p>\n<p>2) I don't believe we have a moral commitment, or even that it is morally preferable, to bring more organisms into existence, even assuming a pleasant quality of life.  The argument that factory farming is not ideal but is preferable to those animals not existing at all doesn't seem to hold water for me.  For one, that line of reasoning isn't consistent with many other moral intuitions we have.  For example, if a poor, homeless teenage girl approached us on the street and asked if we thought she should become pregnant soon, we would almost certainly advise her not to -- after all, her situation precludes her from giving the baby a quality life.  Yet, if we were to hold to the principle that &quot;some life is better than no life, regardless of quality,&quot; we should tell the girl to not only get pregnant, but hope for twins (ignoring considerations about how having children would affect the girl herself -- let's say she deeply wants children soon).  So, while I agree that we should seek some form of maximizing utility (or happiness or flourishing, etc.) in the world while minimizing suffering, I don't believe that entails maximizing total happiness by increasing populations.</p>\n<p>3) While I'm generally sympathetic to utilitarianism, I still have difficulty with the act/omission distinction.  It is very easy to concoct examples that are very intuitively problematic.  For example, let's imagine that Smith enjoys drowning young children, and it is his habit to wake up on Sundays, drive to a local park, and pick his victim.  After he drowns his victim, however, he drives home and donates $3,500 to the Against Malaria Foundation, which is the estimated cost of saving one life (I may have the exact figure wrong).  Is the weight of Smith's donation equal to the weight of his drowning a child?  My intuition is to strongly say no.  If you're inclined to say yes, let me pose the question differently: If Jones, Smith's neighbor, chose to throw $3,500 in the trash just for the fun of it, would his actions be equally immoral as Smith's drowning a child?  I can't imagine that anyone would say yes to that.  So, while it may be tempting to treat something like eating meat in the same vein as we treat the opportunity to give to effective charities, I am not convinced that the &quot;best tradeoff&quot; argument can apply to cases where we are proactively behaving immorally.  Your sensitivity to this critique will probably depend on your views on act/omission distinction.</p>\n", "parentCommentId": null, "user": {"username": "zackrobinson"}}, {"_id": "9FQyMBoxyqsWh5gbK", "postedAt": "2015-05-27T09:55:05.168Z", "postId": "WDiBMR2eXmNKSRjvd", "htmlBody": "<blockquote>\n<p>The psychological &quot;cost,&quot; as other posters have pointed out, almost certainly diminishes over time.</p>\n</blockquote>\n<p>Also true for any other habit, though.</p>\n<blockquote>\n<p>Further, and more importantly, I'm not sure we can evaluate psychological cost in the same way that we evaluate financial cost. It is not as though I am giving up the ability to make some other sacrifice because I am sacrificing meat. I'm not sure it works that way.</p>\n</blockquote>\n<p>Psychology research seems to indicate that attention &amp; willpower are limited.  You can only acquire one habit at a time; question is what the best habit to acquire next is.  (And yes I do believe EAs should seek to systematically acquire new habits.  That's why I'm bullish on organizations like CFAR.  I think it's better framed as an opportunity than an obligation pragmatically though.)</p>\n<blockquote>\n<p>Finally, while there is a small time commitment, it doesn't seem substantial enough to warrant an argument that we could have done something in that time that would have a greater impact. </p>\n</blockquote>\n<p>Small chunks of time add up to big chunks of time.  It seems intuitively implausible to me that our reasoning would flip as the chunk of time goes up.  If nothing else, you could spend more time writing posts on the EA forum or making EA reddit submissions or something like that.</p>\n<p>Agree that you can do a lot of good by being a vegan, conditional on a reasonable set of assumptions.  My position is that you can do <em>even more good</em> by investing your time/energy/money fully strategically (which is of course what EA is all about).  Spending time on veganism is simply <em>aiming too low</em> for a capable Westerner in my view.  You're bunting when you should be going for the grand slam (like bringing forward in vitro meat by 1 day).  Instead of donating money to charity ineffectively, you're donating time and energy ineffectively.</p>\n<blockquote>\n<p>3) While I'm generally sympathetic to utilitarianism, I still have difficulty with the act/omission distinction. It is very easy to concoct examples that are very intuitively problematic. For example, let's imagine that Smith enjoys drowning young children, and it is his habit to wake up on Sundays, drive to a local park, and pick his victim. After he drowns his victim, however, he drives home and donates $3,500 to the Against Malaria Foundation, which is the estimated cost of saving one life (I may have the exact figure wrong). Is the weight of Smith's donation equal to the weight of his drowning a child? My intuition is to strongly say no. If you're inclined to say yes, let me pose the question differently: If Jones, Smith's neighbor, chose to throw $3,500 in the trash just for the fun of it, would his actions be equally immoral as Smith's drowning a child? I can't imagine that anyone would say yes to that. So, while it may be tempting to treat something like eating meat in the same vein as we treat the opportunity to give to effective charities, I am not convinced that the &quot;best tradeoff&quot; argument can apply to cases where we are proactively behaving immorally. Your sensitivity to this critique will probably depend on your views on act/omission distinction.</p>\n</blockquote>\n<p>Interesting framing.  Here's my answer.  I would say that a society of EAs should throw Smith in prison despite his donations, because utilitarianism probably isn't the best way to write the legal code.  I feel a sense of disgust for Smith, and I endorse this sense of disgust... it's telling me that he's the sort of person who is willing to drown children for his own pleasure, which isn't the sort of person I want to associate with for various pragmatic reasons.  (Keep in mind it really is for his own pleasure since there's no &quot;best tradeoff&quot; argument here.)</p>\n<p><em>However</em>, let's say I've got a button that brings a different individual, &quot;Goldsmith&quot;, in to existence.  Goldsmith is just like Smith but he donates 10x as much, saving 9 lives on net.  I'm inclined to think I would, in fact, push the button that brought Goldsmith in to existence.  This seems about as straightforward as the trolley problem to me.</p>\n<p>BTW, I am not trying to convince anyone who has found veganism to work for them to switch away.  If you've already made it work for you you've paid most of the upfront willpower cost and at that point it's probably better to stick with it.  But for anyone else I would recommend exercising instead, as Paul Christiano points out, and put the additional energy and improved sleep you get from exercising in to a single higher-impact life goal.</p>\n<p>(Also, just FYI I was not the one who voted you down; I try to avoid doing that to people I debate with :P)</p>\n", "parentCommentId": "84gyWqKGsSKssJ3ER", "user": {"username": "xccf"}}, {"_id": "YLZKatuQAr3Zvx4K3", "postedAt": "2015-05-27T19:08:07.905Z", "postId": "WDiBMR2eXmNKSRjvd", "htmlBody": "<p>Regarding the best tradeoff argument and veganism: It is difficult for me to think of any activities one could do that, in the very small amount of time it takes to become at least a somewhat faithful vegetarian, would do more good.  If a 25 year-old becomes a vegetarian (let's start with vegetarianism), he or she will likely save around 2,500 animals over the next fifty years.  That is very substantial.  If we were talking about a time commitment of several hours per week for fifty years, I might be more open to the idea there are better alternatives.  However, for the vast majority of people, it requires far less time than that.  In reality, we might be talking about a couple hours per week initially, but that commitment quickly gets close to zero.  So, while I agree that becoming at least a vegetarian isn't necessarily the most ideal use of one's time, the reality for most people is that acquiring such a habit (I like that characterization) is hard to beat in terms of the good we can do per hour of time.</p>\n<p>Regarding Goldsmith and the act/omission distinction: I am also inclined to think that I would bring Goldsmith into existence, and I'm not even sure it would take an order of magnitude difference between he and Smith to persuade me.  I'm entirely open to the idea that we need to distinguish between moral assessments we make about people and moral assessments we make about actions.  In the case of Smith, I have a strong sentiment that he is a terrible person.  I don't feel the same about Jones, but it's possible that may be due to the fact that Jones' behavior isn't as far from &quot;normal&quot; behavior as Smith's.  Perhaps I should be skeptical of my intuitions in this case.  I certainly agree that, if we are creating the world, we have no good reason to pick Smith over Jones, but we do have good reason to pick Goldsmith over both of them.</p>\n<p>I do have some lingering reservations, and this may be more appropriate for another thread, but I'm hesitant because Jones' actions aren't that different from our everyday actions.  Almost all of us -- even committed EAs -- spend $3500 on things that aren't essential to our survival or even our flourishing, particularly if we look at our spending habits over time.  I have intuitive difficulty in picturing this frivolous spending as equivalent to a trolley problem with a child on one track and several sporting events, dinners out and maybe a bike on the other.  I have even greater difficulty imagining such spending as being equally immoral as shooting a child in the head.</p>\n<p>(I am confused as to why I got voted down.  I am new to EA, however, so it is possible that I may have unknowingly stepped on some toes or violated some norms of this forum.)</p>\n", "parentCommentId": "9FQyMBoxyqsWh5gbK", "user": {"username": "zackrobinson"}}, {"_id": "CFWGK9EuKJ8hAc3Ny", "postedAt": "2015-05-28T01:07:42.106Z", "postId": "WDiBMR2eXmNKSRjvd", "htmlBody": "<p>Third option: Give up milk and eggs but add fish. Overall I think fish is more ethical than most farmed eggs and milk, and also more healthy. (Dairy is fishy from a health perspective anyway. Fish are not fishy at all.)</p>\n<p>Health Pros: Fish gives you nutritional access to muscle, skin, bones, organs...thereby bypassing most of the health drawbacks of vegetarianism. (Depending on which nutritionists you listen to.)</p>\n<p>Moral Pros: I'm not sure if farmed fish suffer more than wild fish. They might be a bit more crowded together and have a different diet. You can choose wild caught fish. Most fish are probably <em>way</em> less sentient-ish than chickens and cows. Even if you don't agree about fish not &quot;suffering&quot; in a humanlike-sense, all wild fish experience birth and death regardless of your actions and I doubt death via human-catch is worse than the other variants of fish death.</p>\n<p>Are eggs and milk better than chickens and cows, from an ethical perspective? There's the producer, plus the male chicks and calves killed as byproduct. (But I'm sure someone has done that analysis already.)</p>\n<p>Cons: Price, Mercury, and Eco-friendliness but those can be mitigated by restriction to certain species. Conveniently, I think the eco friendly species are also lower in mercury. Those fish do tend to be <em>smaller</em>, though, so if you're considering sheer kill-count this might be a problem. On the human end, another con is that a fisherman's job is sometimes dangerous.</p>\n", "parentCommentId": null, "user": null}, {"_id": "gKsaEiJiaf66dAxr6", "postedAt": "2016-12-08T23:48:59.561Z", "postId": "WDiBMR2eXmNKSRjvd", "htmlBody": "<p>I appreciate your clearly honest and thoughtful appraisal of the situation, Jess. I have a few remarks that I hope you and others might find useful. The central issue can be framed with this question: Should we inflict unnecessary suffering upon nonhuman creatures? </p>\n<p>The &quot;unnecessary&quot; qualifier can be backed with evidence that vegan diets are suitable for humans at all stages of life (<a href=\"https://www.ncbi.nlm.nih.gov/pubmed/12826028\">https://www.ncbi.nlm.nih.gov/pubmed/12826028</a>) and healthier when measured by almost all relevant information concerning health, and are cheaper, more environmentally sustainable, and better for humans in almost every other conceivable way. Therefore, there is no sound argument to be made that humans benefit from consuming animal products. </p>\n<p>Now, it remains to question whether producing animal products actually causes suffering. I am not keen on measuring suffering in numbers - I think that we should be very quick to recognize it and try to do everything possible to alleviate it. Specifically, when I see videos of hundreds of chickens crammed into tiny cages on a truck in which they haven't had access to water in for days on end, I'm not very interested in statistics. Among our species, we recognize such behaviors as murder, slavery, and rape to be fundamentally wrong acts, regardless of their context and consequences. I believe this is a useful belief to hold, and we should be rightfully wary of someone that raises arguments defending them. However, the three aformentioned actions are central to producing animal products. All animals used for food are enslaved by humans for the entirety of their existence, cows must be raped to produce milk for babies that are forcefully taken from them, and of course producing meat requires the life of an innocent animal to be forcefully taken from it. </p>\n<p>So the question now becomes, do we extend the morals which govern human interactions to all creatures that can feel pain? As Jeremy Bentham says, the question is not whether they can talk, nor reason, but can they suffer? One would be hard pressed to answer negatively to that question, and if we agree that suffering is bad and we should avoid it, then I believe we should take the project of veganism very seriously. </p>\n", "parentCommentId": null, "user": {"username": "hylkecale"}}, {"_id": "nHrn57feDThnA5iMe", "postedAt": "2016-12-09T06:20:13.975Z", "postId": "WDiBMR2eXmNKSRjvd", "htmlBody": "<p>I agree re 'vegetarian' and 'vegan' but 'lacto-vegetarian' seems <a href=\"https://en.wikipedia.org/wiki/Lacto_vegetarianism\">dishonest</a>.</p>\n", "parentCommentId": "Y7DDuJwb8zRxbvQRc", "user": {"username": "CarlShulman"}}, {"_id": "XbnRzjK4Ef9AiCLJr", "postedAt": "2016-12-12T11:29:31.738Z", "postId": "WDiBMR2eXmNKSRjvd", "htmlBody": "<p>Upon reflection, I agree with you. I haven't been using the &quot;lactovegetarian&quot; label much, both because few people know what it means and because there isn't much need to use it. But I won't be using it at all from now on.</p>\n", "parentCommentId": "nHrn57feDThnA5iMe", "user": {"username": "Pablo_Stafforini"}}, {"_id": "vPmh9T33QzYJrj24P", "postedAt": "2018-01-13T19:13:42.632Z", "postId": "WDiBMR2eXmNKSRjvd", "htmlBody": "<p>It is really idiocy to be eating vegetables every day, humans need protein, thanks to it we have the brain we have and we evolved so fast, look at this website all the recipe nonsense that there is <a href=\"https://veganrecipes.stream/\">https://veganrecipes.stream/</a> for me It would be very stressful to live without meat</p>\n", "parentCommentId": "JxPdeqvb3JenMX7J4", "user": {"username": "Wilbertis"}}, {"_id": "6GzSAaeAgkhZzKGoG", "postedAt": "2018-03-13T23:03:42.637Z", "postId": "WDiBMR2eXmNKSRjvd", "htmlBody": "<p>Becoming vegan has completely changed my life. I no longer suffer from the subconscious guilt and cognitive dissonance that many non-vegans regularly go through. I can now truly say I love animals. Here is my blog post where I talk about my vegan journey and what veganism has done for me: <a href=\"http://www.justinbillingsleyarizona.com/about/\">http://www.justinbillingsleyarizona.com/about/</a></p>\n", "parentCommentId": null, "user": {"username": "JustinB"}}, {"_id": "SKf8owAZp85krowR9", "postedAt": "2019-12-27T09:23:38.673Z", "postId": "WDiBMR2eXmNKSRjvd", "htmlBody": "<p>testing1234</p>", "parentCommentId": null, "user": {"username": "zoltariolb"}}]