[{"_id": "NWQGxA5Gy9acxXbmq", "postedAt": "2017-06-05T14:24:25.485Z", "postId": "WdMnmmqqiP5zCtSfv", "htmlBody": "<p>I think these are all points that many people have considered privately or publicly in isolation, but that thus far no one has explicitly written them down and drawn a connection between them. In particular, lots of people have independently made the observation that ontological crises in AIs are apparently similar to existential angst in humans, ontology identification seems philosophically difficult, and so plausibly studying ontology identification in humans is a promising route to understanding ontology identification for arbitrary minds. So, thank you for writing this up; it seems like something that needed to be written quite badly.</p>\n<p>Some other problems that might be easier to tackle from this perspective include <a href=\"http://lesswrong.com/lw/l9t/superintelligence_12_malignant_failure_modes/\">mind crime</a>, <a href=\"http://lesswrong.com/lw/x4/nonperson_predicates/\">nonperson predicates</a>, and <a href=\"https://wiki.lesswrong.com/wiki/Suffering_risk\">suffering risk</a>, especially subproblems like <a href=\"http://reducing-suffering.org/is-there-suffering-in-fundamental-physics/\">suffering in physics</a>.</p>\n", "parentCommentId": null, "user": {"username": "Gram_Stone"}}, {"_id": "CJECx68caPMfvM5ob", "postedAt": "2017-06-05T16:32:21.824Z", "postId": "WdMnmmqqiP5zCtSfv", "htmlBody": "<p>Strong agreement.  Considerations from cognitive science might also help us to get a handle on how difficult the problem of general intelligence is, and the limits of certain techniques (e.g. reinforcement learning).  This could help clarify our thinking on AI timelines as well as the constraints which <em>any</em> AGI must satisfy.  Misc. topics that jump to mind are the mental modularity debate, the frame problem, and insight problem solving. </p>\n<p>This is a good article on AI from a cog sci perspective: <a href=\"https://arxiv.org/pdf/1604.00289.pdf\">https://arxiv.org/pdf/1604.00289.pdf</a></p>\n", "parentCommentId": null, "user": {"username": "JesseClifton"}}, {"_id": "LwfGkMHzk2uNsAPyQ", "postedAt": "2017-06-05T16:40:34.166Z", "postId": "WdMnmmqqiP5zCtSfv", "htmlBody": "<blockquote>\n<p>This is a good article on AI from a cog sci perspective: <a href=\"https://arxiv.org/pdf/1604.00289.pdf\">https://arxiv.org/pdf/1604.00289.pdf</a></p>\n</blockquote>\n<p>Yay, correctly guessed which article that was before clicking on the link. :-)</p>\n", "parentCommentId": "CJECx68caPMfvM5ob", "user": {"username": "Kaj_Sotala"}}, {"_id": "RJnNtq9ExWao3uveH", "postedAt": "2017-06-05T18:59:25.056Z", "postId": "WdMnmmqqiP5zCtSfv", "htmlBody": "<blockquote>\n<p>Defining just what it is that human values are. The project of AI safety can roughly be defined as &quot;the challenge of ensuring that AIs remain aligned with human values&quot;, but it's also widely acknowledged that nobody really knows what exactly human values are - or at least, not to a sufficient extent that they could be given a formal definition and programmed into an AI. This seems like one of the core problems of AI safety, and one which can only be understood with a psychology-focused research program. </p>\n</blockquote>\n<p>Defining human values, at least in the prescriptive sense, is not a psychological issue at all. It's a philosophical issue. Certain philosophers have believed that psychology can inform moral philosophy, but it's a stretch to say that even someone like Joshua Greene's work in experimental philosophy is a psychology-focused research program, and the whole approach is dubious - see, e.g., The Normative Insignificance of Neuroscience (<a href=\"http://www.pgrim.org/philosophersannual/29articles/berkerthenormative.pdf)\">http://www.pgrim.org/philosophersannual/29articles/berkerthenormative.pdf)</a>. Of course a new wave of pop-philosophers and internet bloggers have made silly claims that moral philosophy can be completely solved by psychology and neuroscience but this extreme view is ridiculous on its face.</p>\n<p>What people believe doesn't tell us much about what actually is good. The challenge of AI safety is the challenge of making AI that actually does what is right, not AI that does whatever it's told to do by a corrupt government, a racist constituency, and so on. </p>\n", "parentCommentId": null, "user": {"username": "kbog"}}, {"_id": "vxbMhoeMDddY3s6mq", "postedAt": "2017-06-06T13:34:17.143Z", "postId": "WdMnmmqqiP5zCtSfv", "htmlBody": "<p>I am a psychology PhD student with a background in philosophy/evolutionary psychology. My current research focuses on two main areas: effective altruism and the nature of morality and in particular the psychology of metaethics. My motivation for pursuing the former should be obvious, but my rationale for pursuing the latter is in part self-consciously about the third bullet point, &quot;Defining just what it is that human values are.&quot; More basic than even defining what those values are, I am interested in what people take values themselves to be. For instance, we do not actually have good data on the degree to which people regard their own moral beliefs as objective/relative, how common noncognitivist or error theoretic beliefs are in lay populations, etc.</p>\n<p>Related to the first point, about developing an AI safety culture, there is also the matter of what we can glean psychologically about how the public likely to receive AI developments. Understanding how people generally perceive AI and technological change more broadly could provide insight that can help us anticipate emerging social issues that result from advances in AI and improve our ability to raise awareness about and increase receptivity to concerns about AI risk among nonexperts, policymakers, the media, and the public. Cognitive science has more direct value than areas like mine (social psychology/philosophy) but my areas of study could serve a valuable auxiliary function to AI safety.</p>\n", "parentCommentId": null, "user": {"username": "LanceSBush"}}, {"_id": "hKkYyCpLuNX5DufbM", "postedAt": "2017-06-06T13:52:12.239Z", "postId": "WdMnmmqqiP5zCtSfv", "htmlBody": "<p>I agree that defining human values is a philosophical issue, but I would not describe it as &quot;not a psychological issue at all.&quot; It is in part a psychological issue insofar as understanding how people conceive of values is itself an empirical question. Questions about individual and intergroup differences in how people conceive of values, distinguish moral from nonmoral norms, etc. cannot be resolved by philosophy alone. </p>\n<p>I am sympathetic to some of the criticisms of Greene's work, but I do not think Berker's critique is completely correct, though explaining why I think Greene and others are correct in thinking that psychology can inform moral philosophy in detail would call for a rather titanic post. </p>\n<p>The tl;dr point I'd make is that yes, you can draw philosophical conclusions from empirical premises, provided your argument is presented as a conditional one in which you propose that certain philosophical positions are dependent on certain factual claims. If anyone else accepts those premises, then empirical findings that confirm or disconfirm those factual claims can compel specific philosophical conclusions. A toy version of this would be the following:</p>\n<p>P1: If the sky is blue, then utilitarianism is true.\nP2: The sky is blue.\nC: Therefore, utilitarianism is true.</p>\n<p>If someone accepts P1, and if P2 is an empirical claim, then empirical evidence for/against P2 bears on the conclusion. </p>\n<p>This is the kind of move Greene wants to make.</p>\n<p>The slightly longer version of what I'd say to a lot of Greene's critics is that they misconstrue Greene's arguments if they think he is attempting to move straight from descriptive claims to normative claims. In arguing for the primacy of utilitarian over deontological moral norms, Greene appeals the presumptive shared premise between himself and his interlocutors that, on reflection, they will reject beliefs that are the result of epistemically dubious processes but retain those that are the result of epistemically justified processes. </p>\n<p>If they share his views about what processes would in principle be justified/not justified, and if he can demonstrate that utilitarian judgments are reliably the result of justified processes but deontological judgments are not, then he has successfully appealed to empirical findings to draw a philosophical conclusion: that utilitarian judgments are justified and deontological ones are not. One could simply reject his premises about what constitutes justifed/unjustified grounds for belief, and in that case his argument would not be convincing. I don't endorse his conclusions because I think his empirical findings are not compelling; not because I think he's made any illicit philosophical moves. </p>\n", "parentCommentId": "RJnNtq9ExWao3uveH", "user": {"username": "LanceSBush"}}, {"_id": "n8ah8Etctqn9yGMdg", "postedAt": "2017-06-06T15:34:29.518Z", "postId": "WdMnmmqqiP5zCtSfv", "htmlBody": "<p>What is your model of why other people in the AI safety field disagree with you/don't consider this as important as you?</p>\n", "parentCommentId": null, "user": {"username": "Denise_Melchin"}}, {"_id": "YbQrCbtk556wcdEmB", "postedAt": "2017-06-06T18:07:34.850Z", "postId": "WdMnmmqqiP5zCtSfv", "htmlBody": "<p>My main guess is &quot;they mostly come from a math/CS background so haven't looked at this through a psych/cogsci perspective and seen how it could be useful&quot;.</p>\n<p>That said, some of my stuff linked to above has been mostly met with a silence, and while I <em>presume</em> it's a question of <a href=\"http://lesswrong.com/lw/iq6/inferential_silence/\">inferential silence</a> - a sufficiently long inferential distance that a claim doesn't provoke even objections, just uncomprehending or indifferent silence - there <em>is</em> also the possibility of me just being so wrong about the usefulness of my ideas that nobody's even bothering to tell me.</p>\n", "parentCommentId": "n8ah8Etctqn9yGMdg", "user": {"username": "Kaj_Sotala"}}, {"_id": "rFp939X8FBmhgpBm9", "postedAt": "2017-06-06T20:27:39.425Z", "postId": "WdMnmmqqiP5zCtSfv", "htmlBody": "<blockquote>\n<p>The tl;dr point I'd make is that yes, you can draw philosophical conclusions from empirical premises, provided your argument is presented as a conditional one in which you propose that certain philosophical positions are dependent on certain factual claims. </p>\n</blockquote>\n<p>You can do that if you want, but (1) it's still a narrow case within a much larger philosophical framework and (2) such cases are usually pretty simple and don't require sophisticated knowledge of psychology.</p>\n<blockquote>\n<p>The slightly longer version of what I'd say to a lot of Greene's critics is that they misconstrue Greene's arguments if they think he is attempting to move straight from descriptive claims to normative claims. </p>\n</blockquote>\n<p>To the contrary, Berker criticizes Greene precisely because his neuroscientific work is hardly relevant to the moral argument he's making. You don't need a complex account of neuroscience or psychology to know that people's intuitions in the trolley problem are changing merely because of an apparently non-significant change in the situation. Philosophers knew that a century ago.</p>\n<blockquote>\n<p>If they share his views about what processes would in principle be justified/not justified, and if he can demonstrate that utilitarian judgments are reliably the result of justified processes but deontological judgments are not, then he has successfully appealed to empirical findings to draw a philosophical conclusion: that utilitarian judgments are justified and deontological ones are not. </p>\n</blockquote>\n<p>But nobody believes that judgements are correct or wrong merely because of the process that produces them. That just produces grounds for skepticism that the judgements are reliable - and it is skepticism of a sort that was already known without any reference to psychology, for instance through Plantinga's evolutionary argument against naturalism or evolutionary debunking arguments.</p>\n<p>Also it's worth clarifying that Greene only deals with a particular instance of a deontological judgement rather than deontological judgements in general.</p>\n<blockquote>\n<p>One could simply reject his premises about what constitutes justifed/unjustified grounds for belief, and in that case his argument would not be convincing. </p>\n</blockquote>\n<p>It's only a question of moral epistemology, so you could simply disagree on how he talks about intuitions or abandon the idea altogether (<a href=\"https://global.oup.com/academic/product/philosophy-without-intuitions-9780199644865?cc=us&amp;lang=en&amp;)\">https://global.oup.com/academic/product/philosophy-without-intuitions-9780199644865?cc=us&amp;lang=en&amp;)</a>. </p>\n<p>Again, it's worth stressing that this is a fairly narrow and methodologically controversial area of moral philosophy. There is a difference between giving an opinion on a novel approach to a subject, and telling a group of people what subject they need to study in order to be well-informed. Even if you do take the work of x-philers for granted, it's not the sort of thing that can be done merely with education in psychology and neuroscience, because people who understand that side of the story but not the actual philosophy are going to be unable to evaluate or make the substantive moral arguments which are necessary for empirically informed work.</p>\n", "parentCommentId": "hKkYyCpLuNX5DufbM", "user": {"username": "kbog"}}, {"_id": "3eGRpyq8DkArajPj3", "postedAt": "2017-06-07T00:04:32.377Z", "postId": "WdMnmmqqiP5zCtSfv", "htmlBody": "<p>Also, have you seen this <a href=\"http://aiimpacts.org/tom-griffiths-on-cognitive-science-and-ai/\">AI Impacts post</a> and the interview it links to? I would expect so, but it seems worth asking. Tom Griffiths makes similar points to the ones you've made here.</p>\n", "parentCommentId": "LwfGkMHzk2uNsAPyQ", "user": {"username": "Gram_Stone"}}, {"_id": "7dz3zfGE4htE68Qzu", "postedAt": "2017-06-07T02:32:36.346Z", "postId": "WdMnmmqqiP5zCtSfv", "htmlBody": "<p>Your comment reads strangely to me because your thoughts seem to fall into a completely different groove from mine. The problem statement is perhaps: write a program that does what-I-want, indefinitely. Of course, this could involve a great deal of extrapolation.</p>\n<p>The fact that I am even aspiring to write such a program means that I am assuming that what-I-want can be computed. Presumably, at least some portion of the relevant computation, the one that I am currently denoting 'what-I-want', takes place in my brain. If I want to perform this computation in an AI, then it would probably help to at least be able to reproduce whatever portion of it takes place in my brain. People who study the mind and brain happen to call themselves psychologists and cognitive scientists. It's weird to me that you're arguing about how to classify Joshua Greene's research; I don't see why it matters whether we call it philosophy or psychology. I generally find it suspicious when anyone makes a claim of the form: &quot;Only the academic discipline that I hold in high esteem has tools that will work in this domain.&quot; But I won't squabble over words if you think you're drawing important boundaries; what do you mean when you write 'philosophical'? Maybe you're saying that Greene, despite his efforts to inquire with psychological tools, elides into 'philosophy' anyway, so like, what's the point of pretending it's 'moral philosophy' via psychology? If that's your objection, that he 'just ends up doing philosophy anyway', then what exactly is he eliding into, without using the words 'philosophy' or 'philosophical'?</p>\n<p>More generally, why is it that we should discard the approach because it hasn't made itself obsolete yet? Should the philosophers give up because they haven't made their approach obsolete yet either? If there's any reason that we should have more confidence in the ability of philosophers than cognitive scientists to contribute towards a formal specification of what-I-want, that reason is certainly not track record.</p>\n<blockquote>\n<p>What people believe doesn't tell us much about what actually is good.</p>\n</blockquote>\n<p>I don't think anyone who has read or who likely will read your comment equivocates testimony or social consensus with what-is-good.</p>\n<blockquote>\n<p>The challenge of AI safety is the challenge of making AI that actually does what is right, not AI that does whatever it's told to do by a corrupt government, a racist constituency, and so on.</p>\n</blockquote>\n<p>It's my impression that AI safety researchers are far more concerned about unaligned AGIs killing everyone than they are about AGIs that are successfully designed by bad actors to do a specific, unimaginative thing without killing themselves and everyone else in the process.</p>\n<blockquote>\n<p>Of course a new wave of pop-philosophers and internet bloggers have made silly claims that moral philosophy can be completely solved by psychology and neuroscience but this extreme view is ridiculous on its face.</p>\n</blockquote>\n<p>Bleck, please don't ever give me a justification to link a Wikipedia article literally named <a href=\"https://en.wikipedia.org/wiki/Pooh-pooh\">pooh-pooh</a>.</p>\n", "parentCommentId": "RJnNtq9ExWao3uveH", "user": {"username": "Gram_Stone"}}, {"_id": "M49oSTGijQpxhTrDg", "postedAt": "2017-06-08T20:01:02.756Z", "postId": "WdMnmmqqiP5zCtSfv", "htmlBody": "<p>Kaj, I tend to promote your stuff a fair amount to end the inferential silence, and it goes without saying that I agree with all else you said. </p>\n<p>Don't give up on your ideas or approach. I am dispirited that there are so few people thinking like you do out there. </p>\n", "parentCommentId": "YbQrCbtk556wcdEmB", "user": {"username": "Diego_Caleiro"}}, {"_id": "kudKkSpNzqfT8Ezhc", "postedAt": "2017-06-08T21:00:41.758Z", "postId": "WdMnmmqqiP5zCtSfv", "htmlBody": "<p>I got linked here while browsing a pretty random blog on deep learning, you're getting attention! (<a href=\"https://medium.com/intuitionmachine/seven-deadly-sins-and-ai-safety-5601ae6932c3\">https://medium.com/intuitionmachine/seven-deadly-sins-and-ai-safety-5601ae6932c3</a>)</p>\n", "parentCommentId": null, "user": null}, {"_id": "iip9gjMxkXvyzfFYW", "postedAt": "2017-06-08T23:00:55.455Z", "postId": "WdMnmmqqiP5zCtSfv", "htmlBody": "<p>Thanks for the excellent reply. </p>\n<p>Greene would probably not dispute that philosophers have generally agreed that the difference between the lever and footbridge cases are due to “apparently non-significant changes in the situation”</p>\n<p>However,  what philosophers have typically done is either bit the bullet and said one ought to push, or denied that one ought to push in the footbridge case, but then feel the need to defend commonsense intuitions by offering a principled justification for the distinction between the two. The trolley literature is rife with attempts to vindicate an unwillingness to push, because these philosophers are starting from the assumption that commonsense moral intuitions track deep moral truths and we must explicate the underlying, implicit justification our moral competence is picking up on.</p>\n<p>What Greene is doing by appealing to neuroscientific/psychological evidence is to offer a selective debunking explanation of some of those intuitions but not the others. If the evidence demonstrates that one set of outputs (deontological judgments) are the result of an unreliable cognitive process, and another set of outputs (utilitarian judgments) are the result of reliable cognitive processes, then he can show that we have reason to doubt one set of intuitions but not the other, provided we agree with his criteria about what constitutes a reliable vs. an unreliable process. A selective debunking argument of this kind, relying as it does on the reliability of distinct psychological systems or processes, does in fact turn on the empirical evidence (in this case, on his dual process model of moral cognition). </p>\n<p>[But nobody believes that judgements are correct or wrong merely because of the process that produces them.]</p>\n<p>Sure, but Greene does not need to argue that deontological/utilitarian conclusions are correct or incorrect, only that we have reason to doubt one but not the other. If we can offer reasons to doubt the very psychological processes that give rise to deontological  intuitions, this skepticism may be sufficient to warrant skepticism about the larger project of assuming that these intuitions are underwitten by implicit, non-obvious justifications that the philosopher’s job is to extract and explicate. </p>\n<p>You mention evolutionary debunking arguments as an alternative that is known “without any reference to psychology.” I think this is mistaken. Evolutionary debunking arguments are entirely predicated on specific empirical claims about the evolution of human psychology, and are thus a perfect example of the relevance of empirical findings to moral philosophy.</p>\n<p>[Also it's worth clarifying that Greene only deals with a particular instance of a deontological judgement rather than deontological judgements in general.]</p>\n<p>Yes, I completely agree and I think this is a major weakness with Greene’s account.</p>\n<p>I think there are two other major problems: the fMRI evidence he has is not very convincing, and trolley problems offer a distorted psychological picture of the distinction between utilitarian and non-utilitarian moral judgment. Recent work by Kahane shows that people who push in footbridge scenarios tend not to be utilitarians, just people with low empathy. The same people that push tend to also be more egoistic, less charitable, less impartial, less concerned about maximizing welfare, etc. </p>\n<p>Regarding your last point two points: I agree that one move is to simply reject how he talks about intuitions (or one could raise other epistemic challenges presumably). I also agree that training in psychology/neuroscience but not philosophy impairs one's ability to evaluate arguments that presumably depend on competence in both. I am not sure why you bring this up though, so if there was an inference I should draw from this help me out!</p>\n", "parentCommentId": "rFp939X8FBmhgpBm9", "user": {"username": "LanceSBush"}}, {"_id": "xQooEtFkf2uToHWat", "postedAt": "2017-06-09T11:31:09.393Z", "postId": "WdMnmmqqiP5zCtSfv", "htmlBody": "<p>Neat, thanks for the find. :)</p>\n", "parentCommentId": "kudKkSpNzqfT8Ezhc", "user": {"username": "Kaj_Sotala"}}, {"_id": "pN7kcpftXYiHDqDR4", "postedAt": "2017-06-09T12:31:02.358Z", "postId": "WdMnmmqqiP5zCtSfv", "htmlBody": "<p>I'd seen that, but re-reading it was useful. :)</p>\n", "parentCommentId": "3eGRpyq8DkArajPj3", "user": {"username": "Kaj_Sotala"}}, {"_id": "XaWvm3XKHvGJnKXkt", "postedAt": "2017-06-10T19:43:48.459Z", "postId": "WdMnmmqqiP5zCtSfv", "htmlBody": "<blockquote>\n<p>The problem statement is perhaps: write a program that does what-I-want, indefinitely</p>\n</blockquote>\n<p>No, the problem statement is write a program that does what is right.</p>\n<blockquote>\n<p>It's weird to me that you're arguing about how to classify Joshua Greene's research; I don't see why it matters whether we call it philosophy or psychology</p>\n</blockquote>\n<p>Then you missed the point of what I said, since I wasn't talking about what to call it, I was talking about the tools and methods it uses. The question is what people ought to be studying and learning.</p>\n<blockquote>\n<p>I generally find it suspicious when anyone makes a claim of the form: &quot;Only the academic discipline that I hold in high esteem has tools that will work in this domain.&quot; </p>\n</blockquote>\n<p>If you want to solve a philosophical problem then you're going to have to do philosophy. Psychology is for solving psychological problems. It's pretty straightforward.</p>\n<blockquote>\n<p>what do you mean when you write 'philosophical'? </p>\n</blockquote>\n<p>I mean the kind of work that is done in philosophy departments, and which would be studied by someone who was told &quot;go learn about moral philosophy&quot;.</p>\n<blockquote>\n<p>Maybe you're saying that Greene, despite his efforts to inquire with psychological tools, elides into 'philosophy' anyway</p>\n</blockquote>\n<p>Yes, that's true by his own admission (he affirms in his reply to Berker that the specific cognitive model he uses is peripheral to the main normative argument) and is apparent if you look at his work.</p>\n<blockquote>\n<p>If that's your objection, that he 'just ends up doing philosophy anyway', then what exactly is he eliding into, without using the words 'philosophy' or 'philosophical'?</p>\n</blockquote>\n<p>He's eliding into normative arguments about morality, rather than merely describing psychological or cognitive processes.</p>\n<blockquote>\n<p>More generally, why is it that we should discard the approach because it hasn't made itself obsolete yet? </p>\n</blockquote>\n<p>I don't know what you are talking about, since I said nothing about obsolescence.</p>\n<blockquote>\n<p>I don't think anyone who has read or who likely will read your comment equivocates testimony or social consensus with what-is-good.</p>\n</blockquote>\n<p>Great! Then they'll acknowledge that studying testimony and social consensus is not studying what is good.</p>\n<blockquote>\n<p>It's my impression that AI safety researchers are far more concerned about unaligned AGIs killing everyone than they are about AGIs that are successfully designed by bad actors to do a specific, unimaginative thing without killing themselves and everyone else in the process.</p>\n</blockquote>\n<p>Rather than bad actors needing to be restrained by good actors, which is neither a psychological nor a philosophical problem, the problem is that the very best actors are flawed and will produce flawed machines if they don't do things correctly.</p>\n<blockquote>\n<p>please don't ever give me a justification to link a Wikipedia article literally named pooh-pooh.</p>\n</blockquote>\n<p>Would you like to me to explicitly explain why the new wave of pop-philosophers and internet bloggers who think that moral philosophy can be completely solved by psychology and neuroscience don't know what they're talking about? It's not taken seriously; I didn't go into detail because I was unsure if anyone around here took it seriously. </p>\n", "parentCommentId": "7dz3zfGE4htE68Qzu", "user": {"username": "kbog"}}, {"_id": "2bNC7M8DofpajCZ7F", "postedAt": "2017-06-11T14:49:19.117Z", "postId": "WdMnmmqqiP5zCtSfv", "htmlBody": "<p>It took me a while to respond to this because I wanted to take the time to read &quot;The Normative Insignificance of Neuroscience&quot; first. Having now read it, I'd say that I agree with its claims with regard to criticism of Greene's approach. I don't think it disproves the notion of psychology being useful for defining human values, though, for I think there's an argument for psychology's usefulness that's entirely distinct from the specific approach that Greene is taking.</p>\n<p>I start from the premise that the goal of moral philosophy is to develop a set of explicit principles that would tell us what is good. Now this is particularly relevant for designing AI, because we also want our AIs to follow those principles. But it's noteworthy that at their current state, none of the existing ethical theories are up to the task of giving us such a set of principles that, when programmed into an AI, would actually give results that could be considered &quot;good&quot;. E.g. <a href=\"https://intelligence.org/files/IE-ME.pdf\">Muehlhauser &amp; Helm 2012</a>:</p>\n<blockquote>\n<p>Let us consider the implications of programming a machine superoptimizer to implement particular moral theories.</p>\n</blockquote>\n<blockquote>\n<p>We begin with hedonistic utilitarianism, a theory still defended today (Tännsjö 1998). If a machine superoptimizer’s goal system is programmed to maximize pleasure, then it might, for example, tile the local universe with tiny digital minds running continuous loops of a single, maximally pleasurable experience. We can’t predict exactly what a hedonistic utilitarian machine superoptimizer would do, but we think it seems likely to produce unintended consequences, for reasons we hope will become clear. [...]</p>\n</blockquote>\n<blockquote>\n<p>Suppose “pleasure” was specified (in the machine superoptimizer’s goal system) in terms of our current understanding of the human neurobiology of pleasure. Aldridge and Berridge (2009) report that according to “an emerging consensus,” pleasure is “not a sensation” but instead a “pleasure gloss” added to sensations by “hedonic hotspots” in the ventral pallidum and other regions of the brain. A sensation is encoded by a particular pattern of neural activity, but it is not pleasurable in itself. To be pleasurable, the sensation must be “painted” with a pleasure gloss represented by additional neural activity activated by a hedonic hotspot (Smith et al. 2009).</p>\n</blockquote>\n<blockquote>\n<p>A machine superoptimizer with a goal system programmed to maximize human pleasure (in this sense) could use nanotechnology or advanced pharmaceuticals or neurosurgery to apply maximum pleasure gloss to all human sensations—a scenario not unlike that of plugging us all into Nozick’s experience machines (Nozick 1974, 45). Or, it could use these tools to restructure our brains to apply maximum pleasure gloss to one consistent experience it could easily create for us, such as lying immobile on the ground.</p>\n</blockquote>\n<blockquote>\n<p>Or suppose “pleasure” was specified more broadly, in terms of anything that functioned as a reward signal—whether in the human brain’s dopaminergic reward system (Dreher and Tremblay 2009), or in a digital mind’s reward signal circuitry (Sutton and Barto 1998). A machine superoptimizer with the goal of maximizing reward signal scores could tile its environs with trillions of tiny minds, each one running its reward signal up to the highest number it could. [...]</p>\n</blockquote>\n<blockquote>\n<p>What if a machine superoptimizer was programmed to maximize desire satisfaction in humans? Human desire is implemented by the dopaminergic reward system (Schroeder 2004; Berridge, Robinson, and Aldridge 2009), and a machine superoptimizer mizer could likely get more utility by (1) rewiring human neurology so that we attain maximal desire satisfaction while lying quietly on the ground than by (2) building and maintaining a planet-wide utopia that caters perfectly to current human preferences. [...]</p>\n</blockquote>\n<blockquote>\n<p>Consequentialist designs for machine goal systems face a host of other concerns (Shulman, Jonsson, and Tarleton 2009b), for example the difficulty of interpersonal comparisons of utility (Binmore 2009), and the counterintuitive implications of some methods of value aggregation (Parfit 1986; Arrhenius 2011). [...] </p>\n</blockquote>\n<blockquote>\n<p>We cannot show that every moral theory yet conceived would produce substantially unwanted consequences if used in the goal system of a machine superoptimizer. Philosophers have been prolific in producing new moral theories, and we do not have the space here to consider the prospects (for use in the goal system of a machine superoptimizer) for a great many modern moral theories. These include rule utilitarianism (Harsanyi 1977), motive utilitarianism (Adams 1976), two-level utilitarianism (Hare 1982), prioritarianism (Arneson 1999), perfectionism (Hurka 1993), welfarist utilitarianism (Sen 1979), virtue consequentialism (Bradley 2005), Kantian consequentialism (Cummiskey 1996), global consequentialism (Pettit and Smith 2000), virtue theories (Hursthouse 2012), contractarian theories (Cudd 2008), Kantian deontology (R. Johnson 2010), and Ross’ prima facie duties (Anderson, Anderson, and Armen 2006).</p>\n</blockquote>\n<p>Yet the problem remains: the AI has to be programmed with <em>some</em> definition of what is good.</p>\n<p>Now this alone isn't yet sufficient to show that philosophy wouldn't be up to the task. But philosophy has been trying to solve ethics for at least the last 2500 years, and it doesn't look like there would have been any major progress towards solving it. The <a href=\"https://philpapers.org/archive/BOUWDP.pdf\">PhilPapers survey</a> didn't show any of the three major ethical schools (consequentialism, deontology, virtue ethics) being significantly more favored by professional philosophers than the others, nor does anyone - to my knowledge - even know what a decisive theoretical argument in favor of one of them <em>could</em> be.</p>\n<p>And at this point, we have pretty good theoretical reasons for believing that the traditional goal of moral philosophy - &quot;developing a set of explicit principles for telling us what is good&quot; - is in fact impossible. Or at least, it's impossible to develop a set of principles that would be simple and clear enough to write down in human-understandable form and which would give us clear answers to every situation, because morality is too complicated for that. </p>\n<p>We've already seen this in trying to define concepts: as philosophy noted a long time ago, you can't come up with a set of explicit rules that would define even any concept even as simple as &quot;man&quot; in such a way that nobody could develop a counterexample. &quot;The Normative Insignificance of Neuroscience&quot; also notes that the situation in ethics looks similar to the situation with trying to define many other concepts:</p>\n<blockquote>\n<p>... what makes the trolley problem so hard—indeed, what has led some to despair of our ever finding a solution to it—is that for nearly every principle that has been proposed to explain our intuitions about trolley cases, some ingenious person has devised a variant of the classic trolley scenario for which that principle yields counterintuitive results. Thus as with the Gettier literature in epistemology and the causation and personal identity literatures in metaphysics, increasingly baroque proposals have given way to increasingly complex counterexamples, and though some have continued to struggle with the trolley problem, many others have simply given up and moved on to other topics.</p>\n</blockquote>\n<p>Yet human brains do manage to successfully reason with concepts, despite it being impossible to develop a set of explicit necessary and sufficient criteria. The evidence from both psychology and artificial intelligence (where we've managed to train neural nets capable of reasonably good object recognition) is that a big part of how they do it is by building up complicated statistical models of what counts as a &quot;man&quot; or &quot;philosopher&quot; or whatever.</p>\n<p>So given that</p>\n<ul>\n<li>we can't build explicit verbal models of what a concept is * but we can build machine-learning algorithms that use complicated statistical analysis to identify instances of a concept</li>\n</ul>\n<p>and</p>\n<ul>\n<li>defining morality looks similar to defining concepts, in that we can't build explicit verbal models of what morality is</li>\n</ul>\n<p>it would seem reasonable to assume that</p>\n<ul>\n<li>we can build machine-learning algorithms that can learn to define morality, in that it can give such answers to moral dilemmas that a vast majority of people would consider them acceptable</li>\n</ul>\n<p>But here it looks likely that we need information from psychology to narrow down what those models should be. What humans consider to be good has likely been influenced by a number of evolutionary idiosyncrasies, so if we want to come up with a model of morality that most humans would agree with, then our AI's reasoning process should take into account those considerations. And we've already established that defining those considerations on a verbal level looks insufficient - they have to be established on a deeper level, of &quot;what are the actual computational processes that are involved when the brain computes morality&quot;.</p>\n<p>Yes, I am here assuming &quot;what is good&quot; to equate to &quot;what do human brains consider good&quot;, in a way that may be seen as reducing to &quot;what would human brains accept as a persuasive argument for what is good&quot;. You could argue that this is flawed, because it's getting dangerously close to defining &quot;good&quot; by social consensus. But then again, the way the field of ethics itself proceeds is basically the same: a philosopher presents an argument for what is good, another attacks it, if the argument survives attacks and is compelling then it is eventually accepted. For empirical facts we can come up with objective tests, but for moral truths it looks to me unavoidable - due to the is-ought gap - that some degree of &quot;truth by social consensus&quot; <em>is</em> the only way of figuring out what the truth is, even in principle.</p>\n", "parentCommentId": "RJnNtq9ExWao3uveH", "user": {"username": "Kaj_Sotala"}}, {"_id": "TWAZEtQ7ELnoMrnJm", "postedAt": "2017-06-11T14:50:25.560Z", "postId": "WdMnmmqqiP5zCtSfv", "htmlBody": "<p>Also, I find pretty compelling the argument that the classical definition of moral philosophy in trying to <em>define</em> &quot;the good&quot; is both impossible and not even a particularly good target to aim at, and that trying to find generally-agreeable moral solutions is something much more useful; and if we accept this argument, then moral psychology is relevant, because it can help us figure out generally-agreeable solutions.</p>\n<p>As Martela (<a href=\"http://onlinelibrary.wiley.com/doi/10.1111/meta.12229/full\">2017</a>) writes:</p>\n<blockquote>\n<p>...there is a deeper point in Williams's book that is even harder to rebut. Williams asks: What can an ethical theory do, if we are able to build a convincing case for one? He is skeptical about the force of ethical considerations and reminds us that even if we were to have a justified ethical theory, the person in question might not be concerned about it. Even if we could prove to some amoralists that what they are about to do is (a) against some universal ethical standard, (b) is detrimental to their own well-being, and/or (c) is against the demands of rationality or internal coherence, they still have the choice of whether to care about this or not. They can choose to act even if they know that what they are about to do is against some standard that they believe in. Robert Nozick—whom Williams quotes—describes this as follows: “Suppose that we show that some X he [the immoral man] holds or accepts or does commits him to behaving morally. He now must give up at least one of the following: (a) behaving immorally, (b) maintaining X, (c) being consistent about this matter in this respect. The immoral man tells us, ‘To tell you the truth, if I had to make the choice, I would give up being consistent’” (Nozick 1981, 408).</p>\n</blockquote>\n<blockquote>\n<p>What Williams in effect says is that the noble task of finding ultimate justification for some ethical standards could not—even if it was successful—deliver any final argument in practical debates about how to behave. “Objective truth” would have only the motivational weight that the parties involved choose to give to it. It no longer is obvious what a philosophical justification of an ethical standard is supposed to do or even “why we should need such a thing” (Williams 1985, 23).</p>\n</blockquote>\n<blockquote>\n<p>Yet when we look at many contemporary ethical debates, we can see that that they proceed as if the solutions to the questions they pose would matter. In most scientific disciplines the journal articles have a standard section called “practical bearings,” where the practical relevance of the accumulated results are discussed. Not so for metaethical articles, even though they otherwise simulate the academic and peer-reviewed writing style of scientific articles. When we read someone presenting a number of technical counterarguments against quasi-realist solutions to the Frege-Geach problem, there usually is no debate about what practical bearings the discussion would have, whether these arguments would be successful or not. Suppose that in some idealized future the questions posed by the Frege-Geach problem would be conclusively solved. A new argument would emerge that all parties would see as so valid and sound that they would agree that the problem has now been finally settled. What then? How would ordinary people behave differently, after the solution has been delivered to them? I would guess it is fair to say—at least until it is proven otherwise—that the outcome of these debates is only marginally relevant for any ordinary person's ethical life. [...]</p>\n</blockquote>\n<blockquote>\n<p>This understanding of morality means that we have to think anew what moral inquiry should aim at. [...] Whatever justification can be given for one moral doctrine over the other, it has to be found in practice—simply because there are no other options available. Accordingly, for pragmatists, moral inquiry is in the end directed toward practice, its successfulness is ultimately judged by the practical bearings it has on people's experiences: “Unless a philosophy is to remain symbolic—or verbal—or a sentimental indulgence for a few, or else mere arbitrary dogma, its auditing of past experience and its program of values must take effect in conduct” (Dewey 1916, 315). Moral inquiry should thus aim at practice; its successfulness is ultimately measured by how it is able to influence people's moral outlook and behavior. [...]</p>\n</blockquote>\n<blockquote>\n<p>Moral principles, ideals, rules, theories, or conclusions should thus be seen “neither as a cookbook, nor a remote calculus” (Pappas 1997, 546) but as instruments that we can use to understand our behavior and change it for the better. Instead of trying to <em>discover</em> the <em>correct</em> ethical theories, the task becomes one of <em>designing</em> the most <em>functional</em> ethical theories. Ethics serves certain functions in human lives and in societies, and the task is to improve its ability to serve these functions (Kitcher 2011b). In other words, the aim of ethical theorizing is to provide people with tools (see Hickman 1990, 113–14) that help them in living their lives in a good and ethically sound way. [...]</p>\n</blockquote>\n<blockquote>\n<p>It is true that the lack of foundational principles in ethics denies the pragmatist moral philosopher the luxury of being objectively right in some moral question. In moral disagreements, a pragmatist cannot “solve” the disagreement by relying on some objective standards that deliver the “right” and final answer. But going back to Williams's argument raised at the beginning of this article, we can ask what would it help if we were to “solve” the problem. The other party still has the option to ignore our solution. Furthermore, despite the long history of ethics we still haven't found many objective standards or “final solutions” that everyone would agree on, and thus it seems that waiting for such standards to emerge is futile.</p>\n</blockquote>\n<blockquote>\n<p>In practice, there seem to be two ways in which moral disagreements are resolved. First is brute force. In some moral disputes I am in a position in which I can force the other party to comply with my standards whether that other party agrees with me or not. The state with its monopoly on the legitimate use of violence can force its citizens to comply with certain laws even when the personal moral code of these citizens would disagree with the law. The second way to resolve a moral disagreement is to find some common ground, some standards that the other believes in, and start building from there a case for one's own position.</p>\n</blockquote>\n<blockquote>\n<p>In the end, it might be beneficial that pragmatism annihilates the possibility of believing that I am absolutely right and the other party is absolutely wrong. As Margolis notes: “The most monstrous crimes the race has ever (been judged to have) perpetrated are the work of the partisans of ‘right principles’ and privileged revelation” (1996, 213). Instead of dismissing the other's perspective as wrong, one must try to understand it in order to find common ground and shared principles that might help in progressing the dialogue around the problem. If one really wants to change the opinion of the other party, instead of invoking some objective standards one should invoke some standards that the other already believes in. This means that one has to listen to the other person, try to see the world from his or her point of view. Only through understanding the other's perspective one can have a chance to find a way to change it—or to change one's own opinion, if this learning process should lead to that. One can aim to clarify the other's points of view, unveil their hidden assumptions and values, or challenge their arguments, but one must do this by drawing on principles and values that the other is already committed to if one wants to have a chance to have a real impact on the other's way of seeing the world, or actually to resolve the disagreement. I believe that this kind of approach, rather than a claim for a more objective position, has a much better chance of actually building common understanding around the moral issue at hand.</p>\n</blockquote>\n", "parentCommentId": "2bNC7M8DofpajCZ7F", "user": {"username": "Kaj_Sotala"}}, {"_id": "42638vNDWYfC37j27", "postedAt": "2017-06-11T18:12:57.167Z", "postId": "WdMnmmqqiP5zCtSfv", "htmlBody": "<p>Hi Kaj,</p>\n<p>Even if we found the most agreeable available set of moral principles, that amount may turn out not to constitute the vast majority of people. It may not even reach a majority at all. It is possible that there simply is no moral theory that is acceptable to most people. People may just have irreconcilable values. You state that:</p>\n<p>“For empirical facts we can come up with objective tests, but for moral truths it looks to me unavoidable - due to the is-ought gap - that some degree of &quot;truth by social consensus&quot; is the only way of figuring out what the truth is, even in principle.”</p>\n<p>Suppose this is the best we can do. It doesn’t follow that the outputs of this exercise are “true.” I am not sure in what sense this would constitute a true set of moral principles.</p>\n<p>More importantly, it is unclear whether or not I have any rational or moral obligation to care about the outputs of this exercise. I do not want to implement the moral system that most people find agreeable. On the contrary, I want everyone to share my moral views, because this is what, fundamentally, I care about. The notion that we should care about what others care about, and implement whatever the consensus is, seems to presume a very strong and highly contestable metaethical position that I do not accept and do not think others should accept.</p>\n", "parentCommentId": "2bNC7M8DofpajCZ7F", "user": {"username": "LanceSBush"}}, {"_id": "asbEgKAsgXngDWKZ5", "postedAt": "2017-06-11T19:14:35.648Z", "postId": "WdMnmmqqiP5zCtSfv", "htmlBody": "<blockquote>\n<p>Even if we found the most agreeable available set of moral principles, that amount may turn out not to constitute the vast majority of people. It may not even reach a majority at all. It is possible that there simply is no moral theory that is acceptable to most people. </p>\n</blockquote>\n<p>It's certainly <em>possible</em> that this is the case, but looking for the kind of solution that would satisfy as many people as possible certainly seems like the thing we should try <em>first</em> and only give it up if it seems impossible, no? </p>\n<blockquote>\n<p>More importantly, it is unclear whether or not I have any rational or moral obligation to care about the outputs of this exercise. I do not want to implement the moral system that most people find agreeable. </p>\n</blockquote>\n<p>Well, the ideal case would be that the AI would show you a solution which it had found, and upon inspecting it and considering it through you'd be convinced that this solution really does satisfy all the things you care about - and all the things that most other people care about, too.</p>\n<p>From a more pragmatic perspective, you could try to insist on an AI which implemented <em>your</em> values specifically - but then everyone else would also have a reason to fight to get an AI which fulfilled <em>their</em> values specifically, and if it was you versus everyone else in the world, it seems like a pretty high probability that somebody else would win. Which means that your values would have a much higher chance of getting shafted than if everyone had agreed to go for a solution which tried to take into <em>everyone's</em> preferences into account.</p>\n<p>And of course, in the context of AI, everyone insisting on their own values and their values only means that we'll get arms races, meaning a <a href=\"http://www.fhi.ox.ac.uk/wp-content/uploads/Racing-to-the-precipice-a-model-of-artificial-intelligence-development.pdf\">higher probability of a worse outcome for everyone</a>.</p>\n<p>See also <a href=\"https://foundational-research.org/gains-from-trade-through-compromise/\">Gains from Trade Through Compromise</a>.</p>\n", "parentCommentId": "42638vNDWYfC37j27", "user": {"username": "Kaj_Sotala"}}, {"_id": "JkJZpRyXwFftxk5oT", "postedAt": "2017-06-12T00:52:12.617Z", "postId": "WdMnmmqqiP5zCtSfv", "htmlBody": "<blockquote>\n<p>It's certainly possible that this is the case, but looking for the kind of solution that would satisfy as many people as possible certainly seems like the thing we should try first and only give it up if it seems impossible, no?</p>\n</blockquote>\n<p>Sure. That isn't my primary objection though. My main objection is that that even if we pursue this project, it does not achieve the heavy metaethical lifting you were alluding to earlier. It doesn’t demonstrate nor provide any particularly good reason to regard the outputs of this process as moral truth.</p>\n<blockquote>\n<p>Well, the ideal case would be that the AI would show you a solution which it had found, and upon inspecting it and considering it through you'd be convinced that this solution really does satisfy all the things you care about - and all the things that most other people care about, too.</p>\n</blockquote>\n<p>I want to convert all matter in the universe to utilitronium. Do you think it is likely that an AI that factored in the values of all humans would yield this as its solution? I do not. Since I think the expected utility of most other likely solutions, given what I suspect about other people's values, is far less than this, I would view almost any scenario other than imposing my values on everyone else to be a cosmic disaster.</p>\n", "parentCommentId": "asbEgKAsgXngDWKZ5", "user": {"username": "LanceSBush"}}, {"_id": "5W9cPuRXnGfMFYrzD", "postedAt": "2017-06-12T06:57:32.261Z", "postId": "WdMnmmqqiP5zCtSfv", "htmlBody": "<blockquote>\n<p>My main objection is that that even if we pursue this project, it does not achieve the heavy metaethical lifting you were alluding to earlier. It doesn’t demonstrate nor provide any particularly good reason to regard the outputs of this process as moral truth.</p>\n</blockquote>\n<p>Well, what alternative would you propose? I don't see how it would even be possible to get any stronger evidence for the moral truth of a theory, than the failure of everyone to come up with convincing objections to it even after extended investigation. Nor a strategy for testing the truth which wouldn't at some point reduce to &quot;test X gives us reason to disagree with the theory&quot;.</p>\n<p>I would understand your disagreement if you were a moral antirealist, but your comments seem to imply that you <em>do</em> believe that a moral truth exists and that it's possible to get information about it, and that it's possible to do &quot;heavy metaethical lifting&quot;. But how?</p>\n<blockquote>\n<p>I want to convert all matter in the universe to utilitronium.</p>\n</blockquote>\n<p>I think anything as specific as this sounds worryingly close to <a href=\"https://intelligence.org/files/AIPosNegFactor.pdf\">wanting an AI to implement favoritepoliticalsystem</a>.</p>\n<blockquote>\n<p>What the first communist revolutionaries thought would happen, as the empirical\nconsequence of their revolution, was that people’s lives would improve: laborers would\nno longer work long hours at backbreaking labor and make little money from it. This\nturned out not to be the case, to put it mildly. But what the first communists thought\nwould happen, was not so very different from what advocates of other political systems\nthought would be the empirical consequence of their favorite political systems. They\nthought people would be happy. They were wrong.</p>\n</blockquote>\n<blockquote>\n<p>Now imagine that someone should attempt to program a “Friendly” AI to implement\ncommunism, or libertarianism, or anarcho-feudalism, or favoritepoliticalsystem, believing\nthat this shall bring about utopia. People’s favorite political systems inspire blazing suns\nof positive affect, so the proposal will sound like a really good idea to the proposer.</p>\n</blockquote>\n<blockquote>\n<p>We could view the programmer’s failure on a moral or ethical level—say that it is the\nresult of someone trusting themselves too highly, failing to take into account their own\nfallibility, refusing to consider the possibility that communism might be mistaken after\nall. But in the language of Bayesian decision theory, there’s a complementary technical\nview of the problem. From the perspective of decision theory, the choice for communism\nstems from combining an empirical belief with a value judgment. The empirical belief is\nthat communism, when implemented, results in a specific outcome or class of outcomes:\npeople will be happier, work fewer hours, and possess greater material wealth. This is\nultimately an empirical prediction; even the part about happiness is a real property of\nbrain states, though hard to measure. If you implement communism, either this outcome\neventuates or it does not. The value judgment is that this outcome satisfices or is\npreferable to current conditions. Given a different empirical belief about the actual realworld\nconsequences of a communist system, the decision may undergo a corresponding\nchange.</p>\n</blockquote>\n<blockquote>\n<p>We would expect a true AI, an Artificial General Intelligence, to be capable of changing\nits empirical beliefs (or its probabilistic world-model, et cetera). If somehow Charles\nBabbage had lived before Nicolaus Copernicus, and somehow computers had been invented\nbefore telescopes, and somehow the programmers of that day and age successfully\ncreated an Artificial General Intelligence, it would not follow that the AI would believe\nforever after that the Sun orbited the Earth. The AI might transcend the factual error\nof its programmers, provided that the programmers understood inference rather better\nthan they understood astronomy. To build an AI that discovers the orbits of the planets,\nthe programmers need not know the math of Newtonian mechanics, only the math of\nBayesian probability theory.</p>\n</blockquote>\n<blockquote>\n<p>The folly of programming an AI to implement communism, or any other political\nsystem, is that you’re programming means instead of ends. You’re programming in a fixed\ndecision, without that decision being re-evaluable after acquiring improved empirical\nknowledge about the results of communism. You are giving the AI a fixed decision\nwithout telling the AI how to re-evaluate, at a higher level of intelligence, the fallible\nprocess which produced that decision.</p>\n</blockquote>\n", "parentCommentId": "JkJZpRyXwFftxk5oT", "user": {"username": "Kaj_Sotala"}}, {"_id": "LqnJ9psAPS33fPwq6", "postedAt": "2017-06-12T14:54:30.884Z", "postId": "WdMnmmqqiP5zCtSfv", "htmlBody": "<p>Whoops. I can see how my responses didn't make my own position clear. </p>\n<p>I am an anti-realist, and I think the prospects for identifying anything like moral truth are very low. I favor abandoning attempts to frame discussions of AI or pretty much anything else in terms of converging on or identifying moral truth. </p>\n<p>I  consider it a likely futile effort to integrate important and substantive discussions into contemporary moral philosophy. If engaging with moral philosophy introduces unproductive digressions/confusions/misplaced priorities into the discussion it may do more harm than good.</p>\n<p>I'm puzzled by this remark:</p>\n<blockquote>\n<p>I think anything as specific as this sounds worryingly close to wanting an AI to implement favoritepoliticalsystem.</p>\n</blockquote>\n<p>I view utilitronium as an end, not a means. It is a logical consequence of wanting to maximize aggregate utility and is more or less a logical entailment of my moral views. I favor the production of whatever physical state of affairs yields the highest aggregate utility. This is, by definition, &quot;utilitronium.&quot; If I'm using the term in an unusual way I'm happy to propose a new label that conveys what I have in mind.</p>\n", "parentCommentId": "5W9cPuRXnGfMFYrzD", "user": {"username": "LanceSBush"}}, {"_id": "uxeBT66gLFuKHe4dM", "postedAt": "2017-06-16T14:41:54.479Z", "postId": "WdMnmmqqiP5zCtSfv", "htmlBody": "<blockquote>\n<p>I am an anti-realist, and I think the prospects for identifying anything like moral truth are very low. I favor abandoning attempts to frame discussions of AI or pretty much anything else in terms of converging on or identifying moral truth.</p>\n</blockquote>\n<p>Ah, okay. Well, in that case you can just read my original comment as an argument for why one would want to use psychology to design an AI that was capable of correctly figuring out just a <em>single</em> person's values and implementing them, as that's obviously a prerequisite for figuring out everybody's values. The stuff that I had about social consensus was just an argument aimed at moral realists, if you're not one then it's probably not relevant for you.</p>\n<p>(<em>my</em> values would still say that we should try to take everyone's values into account, but that disagreement is distinct from the whole &quot;is psychology useful for value learning&quot; question)</p>\n<blockquote>\n<p>I'm puzzled by this remark:</p>\n</blockquote>\n<p>Sorry, my mistake - I confused utilitronium with <a href=\"https://wiki.lesswrong.com/wiki/Orgasmium\">hedonium</a>.</p>\n", "parentCommentId": "LqnJ9psAPS33fPwq6", "user": {"username": "Kaj_Sotala"}}, {"_id": "W68xGdwiYJQTcDYja", "postedAt": "2017-06-17T11:32:11.333Z", "postId": "WdMnmmqqiP5zCtSfv", "htmlBody": "<p>There has recently been an effort started to make the pipeline better for <a href=\"http://lesswrong.com/r/discussion/lw/p5e/announcing_aasaa_accelerating_ai_safety_adoption\">getting people up to speed with AGI safety</a>. I'm trying to champion a broad view of AGI safety including psychology. </p>\n<p>Would anyone be interested in providing digested content? It would also be good to have an exit for the pipeline for psychology people interested in AGI. Would that be FHI? Who else would be good to talk to about what is required.</p>\n", "parentCommentId": null, "user": {"username": "WillPearson"}}, {"_id": "kT5p8aYoRZkgP6FSm", "postedAt": "2017-06-20T18:58:24.979Z", "postId": "WdMnmmqqiP5zCtSfv", "htmlBody": "<p>Hi Kaj,</p>\n<p>Thanks for writing this. Since you mention some 80,000 Hours content, I thought I’d respond briefly with our perspective.</p>\n<p>We had intended the <a href=\"https://80000hours.org/career-reviews/artificial-intelligence-risk-research/\">career review</a> and <a href=\"https://80000hours.org/ai-safety-syllabus/\">AI safety syllabus</a> to be about what you’d need to do from a technical AI research perspective. I’ve added a note to clarify this.</p>\n<p>We agree that there a lot of approaches you could take to tackle AI risk, but currently expect that technical AI research will be where a large amount of the effort is required. However, we’ve also advised many people on non-technical routes to impacting AI safety, so don’t think it’s the only valid path by any means. </p>\n<p>We’re planning on releasing other guides and paths for non-technical approaches, such as the <a href=\"https://80000hours.org/articles/ai-policy-guide/\">AI safety policy career guide</a>, which also recommends studying political science and public policy, law, and ethics, among others. </p>\n", "parentCommentId": null, "user": {"username": "Peter McIntyre"}}, {"_id": "Q9L7n6D8GNDLJyq8e", "postedAt": "2017-06-20T21:09:49.609Z", "postId": "WdMnmmqqiP5zCtSfv", "htmlBody": "<p>Hi Peter, thanks for the response!</p>\n<p>Your comment seems to suggest that you don't think the arguments in my post are relevant for technical AI safety research. Do you feel that I didn't make a persuasive case for psych/cogsci being relevant for value learning/multi-level world-models research, or do you not count these as technical AI safety research? Or am I misunderstanding you somehow?</p>\n<p>I agree that the &quot;understanding psychology may help persuade more people to work on/care about AI safety&quot; and &quot;analyzing human intelligences may suggest things about takeoff scenarios&quot; points aren't related to technical safety research, but value learning and multi-level world-models are very much technical problems to me.</p>\n", "parentCommentId": "kT5p8aYoRZkgP6FSm", "user": {"username": "Kaj_Sotala"}}, {"_id": "Xr9Yi5hch5mdnt6fs", "postedAt": "2017-06-21T10:44:38.218Z", "postId": "WdMnmmqqiP5zCtSfv", "htmlBody": "<blockquote>\n<p>It took me a while to respond to this because I wanted to take the time to read &quot;The Normative Insignificance of Neuroscience&quot; first.</p>\n</blockquote>\n<p>Great!</p>\n<blockquote>\n<p>But philosophy has been trying to solve ethics for at least the last 2500 years, and it doesn't look like there would have been any major progress towards solving it. The PhilPapers survey didn't show any of the three major ethical schools (consequentialism, deontology, virtue ethics) being significantly more favored by professional philosophers than the others, nor does anyone - to my knowledge - even know what a decisive theoretical argument in favor of one of them could be.</p>\n</blockquote>\n<p>Restricting analysis to the Western tradition, 2500 years ago we barely had any conception of virtue ethics. Our contemporary conceptions of virtue ethics are much better than the ones the Greeks had. Meanwhile, deontological and consequentialist ethics did not even exist back then. Even over recent decades there has been progress in these positions. And plenty of philosophers know what a decisive theoretical argument could be: either they purport to have identified such arguments, or they think it would be an argument that showed the theory to be well supported by intuitions, reason, or some other evidence, not generally different from what an argument for a non-moral philosophical theory would look like.</p>\n<blockquote>\n<p>it's noteworthy that at their current state, none of the existing ethical theories are up to the task of giving us such a set of principles that, when programmed into an AI, would actually give results that could be considered &quot;good&quot;. </p>\n</blockquote>\n<p>It would (arguably) give results that people wouldn't like, but assuming that the moral theory is correct and the machine understands it, almost necessarily it would do morally correct things. If you object to its actions then you are already begging the question by asserting that we ought to be focused on building a machine that will do things that we like regardless of whether they are moral. Moreover, you could tell a similar story for any values that people have. Whether you source them from real philosophy or from layman ethics wouldn't change the problems of optimization and systematization.</p>\n<blockquote>\n<p>And at this point, we have pretty good theoretical reasons for believing that the traditional goal of moral philosophy - &quot;developing a set of explicit principles for telling us what is good&quot; - is in fact impossible.</p>\n</blockquote>\n<p>But that's an even stronger claim than the one that moral philosophy hasn't progressed towards such a goal. What reasons are there?</p>\n<blockquote>\n<p>Or at least, it's impossible to develop a set of principles that would be simple and clear enough to write down in human-understandable form and which would give us clear answers to every situation, because morality is too complicated for that.</p>\n</blockquote>\n<p>That's contentious, but some philosophers believe that, and there are philosophies which adhere to that. The problem of figuring out how to make a machine behave morally according to those premises is still a philosophical one, just one based on other ideas in moral philosophy besides explicit rule-based ones.</p>\n<blockquote>\n<p>Yes, I am here assuming &quot;what is good&quot; to equate to &quot;what do human brains consider good&quot;, in a way that may be seen as reducing to &quot;what would human brains accept as a persuasive argument for what is good&quot;. You could argue that this is flawed, because it's getting dangerously close to defining &quot;good&quot; by social consensus. But then again, the way the field of ethics itself proceeds is basically the same: a philosopher presents an argument for what is good, another attacks it, if the argument survives attacks and is compelling then it is eventually accepted.</p>\n</blockquote>\n<p>Except the field of ethics does it with actual arguments among experts in the field. You could make the same story for any field: truths about physics can be determined by social consensus, since that's just what the field of physics is, a physicist presents an experiment or hypothesis, another attacks it, if the hypothesis survives the attacks and is compelling then it is eventually accepted! And so on for all non-moral fields of inquiry as well. I don't see why you think ethics would be special; basically everything can be modeled like this. But that's ridiculous. We don't look at social consensus for all forms of inquiry, because there is a difference between what ordinary people believe and what people believe when they are trained professionals in the subject.</p>\n<blockquote>\n<p>for moral truths it looks to me unavoidable - due to the is-ought gap - that some degree of &quot;truth by social consensus&quot; is the only way of figuring out what the truth is, even in principle.</p>\n</blockquote>\n<p>Then why don't you believe in morality by social consensus? (Or do you? It seems like you're probably not, given that you're an effective altruist. What do you think about animal rights, or Sharia law?)</p>\n", "parentCommentId": "2bNC7M8DofpajCZ7F", "user": {"username": "kbog"}}, {"_id": "EXQQQcp2XqwD29zyg", "postedAt": "2017-06-22T16:10:14.938Z", "postId": "WdMnmmqqiP5zCtSfv", "htmlBody": "<p>We agree these are technical problems, but for most people, all else being equal, it seems more useful to learn ML rather than cog sci/psych. \nCaveats:</p>\n<ol>\n<li>Personal fit could dominate this equation though, so I'd be excited about people tackling AI safety from a variety of fields. </li>\n<li>It's an equilibrium. The more people already attacking a problem using one toolkit, the more we should be sending people to learn other toolkits to attack it. </li>\n</ol>\n", "parentCommentId": "Q9L7n6D8GNDLJyq8e", "user": {"username": "Peter McIntyre"}}, {"_id": "m9HZq7WtQYCRo5B3b", "postedAt": "2017-06-22T20:38:59.791Z", "postId": "WdMnmmqqiP5zCtSfv", "htmlBody": "<blockquote>\n<p>it seems more useful to learn ML rather than cog sci/psych.</p>\n</blockquote>\n<p>Got it. To clarify: if the question as framed as &quot;should AI safety researchers learn ML, or should they learn cogsci/psych&quot;, then I agree that it seems better to learn ML. </p>\n", "parentCommentId": "EXQQQcp2XqwD29zyg", "user": {"username": "Kaj_Sotala"}}, {"_id": "WG9MjHzWgcCPW5mo4", "postedAt": "2017-07-09T16:15:53.672Z", "postId": "WdMnmmqqiP5zCtSfv", "htmlBody": "<p>(We seem to be talking past each other in some weird way; I'm not even sure what exactly it is that we're disagreeing over.)</p>\n<blockquote>\n<p>It would (arguably) give results that people wouldn't like, but assuming that the moral theory is correct and the machine understands it, almost necessarily it would do morally correct things. </p>\n</blockquote>\n<p>Well sure, if we proceed from the assumption that the moral theory really was correct, but the point was that none of those proposed theories has been generally accepted by moral philosophers.</p>\n<blockquote>\n<p>But that's an even stronger claim than the one that moral philosophy hasn't progressed towards such a goal. What reasons are there?</p>\n</blockquote>\n<p>I gave one in the comment? That philosophy has accepted that you can't give a set of human-comprehensible set of necessary and sufficient criteria for concepts, and if you want a system for classifying concepts you have to use psychology and machine learning; and it looks like morality is similar.</p>\n<blockquote>\n<p>Except the field of ethics does it with actual arguments among experts in the field. You could make the same story for any field: truths about physics can be determined by social consensus, since that's just what the field of physics is, a physicist presents an experiment or hypothesis, another attacks it, if the hypothesis survives the attacks and is compelling then it is eventually accepted! And so on for all non-moral fields of inquiry as well. I don't see why you think ethics would be special; basically everything can be modeled like this. But that's ridiculous. We don't look at social consensus for all forms of inquiry, because there is a difference between what ordinary people believe and what people believe when they are trained professionals in the subject.</p>\n</blockquote>\n<p>I'm not sure what exactly you're disagreeing with? It seems obvious to me that physics does indeed proceed by social consensus in the manner you describe. Someone does an experiment, then others replicate the experiment until there is consensus that this experiment really does produce these results; somebody proposes a hypothesis to explain the experimental results, others point out holes in that hypothesis, there's an extended back-and-forth conversation and further experiments until there is a consensus that the modified hypothesis really does explain the results and that it can be accepted as an established scientific law. And the same for all other scientific and philosophical disciplines. I <em>don't</em> think that ethics is special in that sense.</p>\n<p>Sure, there is a difference between what ordinary people believe and what people believe when they're trained professionals: that's why you look for a social consensus among the people who <em>are</em> trained professionals and have considered the topic in detail, not among the general public.</p>\n<blockquote>\n<p>Then why don't you believe in morality by social consensus? (Or do you? It seems like you're probably not, given that you're an effective altruist.</p>\n</blockquote>\n<p>I do believe in morality by social consensus, in the same manner as I believe in physics by social consensus: if I'm told that the physics community has accepted it as an established fact that e=mc^2 and that there's no dispute or uncertainty about this, then I'll accept it as something that's probably true. If I thought that it was particularly important for me to make sure that this was correct, then I might look up the exact reasoning and experiments used to determine this and try to replicate some of them, until I found myself to also be in consensus with the physics community.</p>\n<p>Similarly, if someone came to me with a theory of what was moral and it turned out that the entire community of moral philosophers had considered this theory and accepted it after extended examination, and I could also not find any objections to that and found the justifications compelling, then I would probably also accept the moral theory.</p>\n<p>But to my knowledge, nobody has presented a conclusive moral theory that would satisfy both me and nearly all moral philosophers and which would say that it was wrong to be an effective altruist - quite the opposite. So I don't see a problem in being an EA.</p>\n", "parentCommentId": "Xr9Yi5hch5mdnt6fs", "user": {"username": "Kaj_Sotala"}}, {"_id": "NvLKzkjX6XyWjuLaR", "postedAt": "2017-07-14T22:25:40.452Z", "postId": "WdMnmmqqiP5zCtSfv", "htmlBody": "<blockquote>\n<p>Well sure, if we proceed from the assumption that the moral theory really was correct, but the point was that none of those proposed theories has been generally accepted by moral philosophers.</p>\n</blockquote>\n<p>Your point was that &quot;none of the existing ethical theories are up to the task of giving us such a set of principles that, when programmed into an AI, would actually give results that could be considered &quot;good&quot;.&quot; But this claim is simply begging the question by assuming that all the existing theories are false. And to claim that a theory would have bad moral results is different from claiming that it's not generally accepted by moral philosophers. It's plausible that a theory would have good moral results, in virtue of it being correct, while not being accepted by many moral philosophers. Since there is no dominant moral theory, this is necessarily the case as long as some moral theory is correct.</p>\n<blockquote>\n<p>I gave one in the comment? That philosophy has accepted that you can't give a set of human-comprehensible set of necessary and sufficient criteria for concepts</p>\n</blockquote>\n<p>If you're referring to ethics, no, philosophy has not accepted that you cannot give such an account. You believe this, on the basis of your observation that philosophers give different accounts of ethics. But that doesn't mean that moral philosophers believe it. They just don't think that the fact of disagreement implies that no such account can be given.</p>\n<blockquote>\n<p>It seems obvious to me that physics does indeed proceed by social consensus in the manner you describe. Someone does an experiment, then others replicate the experiment until there is consensus that this experiment really does produce these results; somebody proposes a hypothesis to explain the experimental results, others point out holes in that hypothesis, there's an extended back-and-forth conversation and further experiments until there is a consensus that the modified hypothesis really does explain the results and that it can be accepted as an established scientific law. And the same for all other scientific and philosophical disciplines. I don't think that ethics is special in that sense.</p>\n</blockquote>\n<p>So you haven't pointed out any particular features of ethics, you've merely described a feature of inquiry in general. This shows that your claim proves too much - it would be ridiculous to conduct physics by studying psychology.</p>\n<blockquote>\n<p>Sure, there is a difference between what ordinary people believe and what people believe when they're trained professionals: that's why you look for a social consensus among the people who are trained professionals and have considered the topic in detail, not among the general public.</p>\n</blockquote>\n<p>But that's not a matter of psychological inquiry, that's a matter of looking at what is being published in philosophy, becoming familiar with how philosophical arguments are formed, and staying in touch with current developments in the field. So you are basically describing studying philosophy. Studying or researching psychology will not tell you anything about this.</p>\n", "parentCommentId": "WG9MjHzWgcCPW5mo4", "user": {"username": "kbog"}}, {"_id": "sQnuBnGA54oYasnnR", "postedAt": "2017-07-25T11:15:43.050Z", "postId": "WdMnmmqqiP5zCtSfv", "htmlBody": "<p>I see quite a bunch of relevant cognitive science work these days, e.g. this: <a href=\"http://saxelab.mit.edu/resources/papers/Kleiman-Weiner.etal.2017.pdf\">http://saxelab.mit.edu/resources/papers/Kleiman-Weiner.etal.2017.pdf</a></p>\n", "parentCommentId": null, "user": null}, {"_id": "FYKwJWiXpgFjsb5ff", "postedAt": "2017-07-25T13:10:42.532Z", "postId": "WdMnmmqqiP5zCtSfv", "htmlBody": "<p>That's super-neat! Thanks.</p>\n", "parentCommentId": "sQnuBnGA54oYasnnR", "user": {"username": "Kaj_Sotala"}}, {"_id": "q3XEL9uZh2iZFa98P", "postedAt": "2017-08-16T21:52:08.503Z", "postId": "WdMnmmqqiP5zCtSfv", "htmlBody": "<p>Excellent post; as a psych professor I agree that psych and cognitive science are relevant to AI safety, and it's surprising that our insights from studying animal and human minds for the last 150 years haven't been integrating into mainstream AI safety work.</p>\n<p>The key problem, I think, is that AI safety seems to assume that there will be some super-powerful deep learning system attached to some general-purpose utility function connected to a general-purpose reward system, and we have to get the utility/reward system exactly aligned with our moral interests. </p>\n<p>That's not the way any animal mind has ever emerged in evolutionary history. Instead, minds emerge as large numbers of domain-specific mental adaptations to solve certain problems, and they're coordinated by superordinate 'modes of operation' called emotions and motivations. These can be described as implementing utility functions, but that's not their function -- promoting reproductive success is. Some animals also evolve some 'moral machinery' for nepotism, reciprocity, in-group cohesion, norm-policing, and virtue-signaling, but those mechanisms are also distinct and often at odds. </p>\n<p>Maybe we'll be able to design AGIs that deviate markedly from this standard 'massively modular' animal-brain architecture, but we have no proof-of-concept for thinking that will work. Until then, it seems useful to consider what psychology has learned about preferences, motivations, emotions, moral intuitions, and domain-specific forms of reinforcement learning.</p>\n", "parentCommentId": null, "user": {"username": "geoffreymiller"}}, {"_id": "9Mw7W6g9DxCYezzEf", "postedAt": "2017-08-31T14:04:10.127Z", "postId": "WdMnmmqqiP5zCtSfv", "htmlBody": "<p>I totally sympathize with your sentiment and feel the same way about incorporating other people's values in a superintelligent AI. If I just went with my own wish list for what the future should look like, I would not care about most other people's wishes. I feel as though many other people are not even trying to be altruistic in the relevant sense that I want to be altruistic, and I don't experience a lot of moral motivation to help accomplish people's weird notions of altruistic goals, let alone any goals that are clearly non-altruistically motivated. In the same way I'd feel no strong (even lower, admittedly) motivation to help make the dreams of <a href=\"http://lesswrong.com/lw/y5/the_babyeating_aliens_18/\">baby eating aliens</a> come true. </p>\n<p>Having said that, I am confident that it would screw things up for everyone if I followed a decision policy that does not give weight to other people's strongly held moral beliefs. It is already hard enough to not mess up AI alignment in a way that makes things worse for everyone, and it would become much harder still if we had half a dozen or more competing teams who each wanted to get their idiosyncratic view of the future installed. </p>\n<p>BTW note that value differences are not the only thing that can get you into trouble. If you hold an important empirical beliefs that others do not share, and you cannot convince them of it, then it may appear to you as though you're justified to do something radical about it, but that's even more likely to be a bad idea because the reasons for taking peer disagreement seriously are stronger in empirical domains of dispute than in normative ones. </p>\n<p>There is a sea of considerations from Kantianism, contractualism, norms for stable/civil societies and <a href=\"https://intelligence.org/files/DeathInDamascus.pdf\">advanced decision theory</a> that, while each line of argument seems tentative on its own and open to skepticism, all taken together point very strongly into the same direction, namely that things will be <a href=\"http://slatestarcodex.com/2014/07/30/meditations-on-moloch/\">horrible</a> if we fail to cooperate with each other and that cooperating is often the truly rational thing to do. You're probably already familiar with a lot of this, but for general reference, see also <a href=\"https://foundational-research.org/files/Multiverse-wide-Cooperation-via-Correlated-Decision-Making.pdf\">this</a> recent paper that makes a particularly interesting case for particularly strong cooperation, as well as other work on the topic, e.g. <a href=\"https://foundational-research.org/gains-from-trade-through-compromise/\">here</a> and <a href=\"https://foundational-research.org/reasons-to-be-nice-to-other-value-systems/\">here</a>. </p>\n<p>This is why I believe that people interested in any particular version of utilitronium should not override AI alignment procedures last minute just to get an extra large share of cosmic stakes for their own value system, and why I believe that people like me, who care <a href=\"https://foundational-research.org/the-case-for-suffering-focused-ethics/\">primarily</a> about reducing suffering, should not increase existential risk. Of course, all of this means that people who want to benefit human values in general should take particular caution to make sure that idiosyncratic value systems that may diverge from them also receive consideration and gains from trade.  </p>\n<p><a href=\"https://foundational-research.org/reply-thomas-metzingers-baan-thought-experiment/\">This piece</a> I wrote recently is relevant to cooperation and the question of whether values are subjective or not, and how much convergence we should expect and to what extent value extrapolation procedures bake in certain (potentially unilateral) assumptions. </p>\n", "parentCommentId": "LqnJ9psAPS33fPwq6", "user": {"username": "Lukas_Gloor"}}]