[{"_id": "rpu7hjnXp6sBDKMyp", "postedAt": "2014-11-21T02:55:29.411Z", "postId": "WdtcxCKFLLCeLBR6H", "htmlBody": "<p>When I started reading this, I thought it would be an essay plugging concerns and interventions for the far future without being upfront about it, so I didn't think I would like it. However, it ended up being different than I thought, and I liked it. It was about a new tact for introducing people to effective altruism, which is one I may try myself.</p>\n", "parentCommentId": null, "user": {"username": "Evan_Gaensbauer"}}, {"_id": "pE6uYH5baWXAuYLYk", "postedAt": "2014-11-21T03:09:06.190Z", "postId": "WdtcxCKFLLCeLBR6H", "htmlBody": "<p>A lot of what is now the effective altruism movement was fed from the community focused on rationality formed around Less Wrong, who were already largely concerned with the risks  of superintelligent A.I. As they were  also the section of effective altruism most concerned with all of the far future, concerns about superintelligent A.I. dominated as an example of an effective focus area aside from charity focused on the very short-run like charities recommended by Givewell. Frankly, before this point I'm not sure that we had good examples of &quot;moderate long-run effective altruism&quot; aside from those generated in this post. Indeed, the collaborative projects between different organizations you mentioned are doing pioneering research into global prioritization. I believe this may be a sign the movement is growing, not in the sense of having greater numbers and popular appeal, but in terms of what its  learning.  Hopefully the latter type of growth will lead to more of the former as what the movement is doing becomes more commonly sensible.</p>\n", "parentCommentId": null, "user": {"username": "Evan_Gaensbauer"}}, {"_id": "YzGPFXix9SfvuyEau", "postedAt": "2014-11-21T10:51:57.116Z", "postId": "WdtcxCKFLLCeLBR6H", "htmlBody": "<p>I think what this post highlights for me is that we (or at least I) would like to see more work done on &quot;donation risk&quot; within the EA community, and how we allocate and make giving investments in causes with potentially large effects but uncertain upsides. </p>\n<p>For short run causes, we basically accept almost no donation risk - you must show that your organisation uses all the money effectively towards a cause that actually works and delivers the upside you have promised. Even slight delays or hiccups (like AMF struggling to allocate funds this year) are sufficient to prompt donors to look elsewhere. For extremely long run causes my perception is the exact opposite, but perhaps I should not comment, because I don't support most current work into them.</p>\n<p>What about medium run causes, should we look at donation risk like the short-run or do we treat them more like the extreme long run?  For many such cases - a  big difference is that an organisation like 80,000 hours seems only to have have a lack of evidence because it is new. If/when it becomes more mature and its students go on to take or not take their advice, a better picture of its effectiveness might emerge. Likewise with projects like the OPP where we may well get a better picture of the good it is doing over time, so I am quite positive about them in a venture capitalist sort of way.</p>\n<p>Medium run erisk and political projects face donation risk difficulties though. We can see the upsides are big but showing our contribution actually mattered and that we are doing the best job working towards it is very hard. </p>\n", "parentCommentId": null, "user": {"username": "AlasdairGives"}}, {"_id": "pa5xurA8ZQ9YNP3B7", "postedAt": "2014-11-21T15:42:21.469Z", "postId": "WdtcxCKFLLCeLBR6H", "htmlBody": "<p>Great point Ben!</p>\n", "parentCommentId": null, "user": {"username": "Robert_Wiblin"}}, {"_id": "uqHCFfMr4GS3Fggyv", "postedAt": "2014-11-21T16:06:57.175Z", "postId": "WdtcxCKFLLCeLBR6H", "htmlBody": "<p>This is the approach I take when talking to people about effective altruism, based partly on caring more about it, and partly on the observation that it goes over better with some audiences (e.g. academics, with whom I have a lot of contact).</p>\n<p>It also seems surprising that people go straight from poverty to existential risk reduction, often without pausing in the middle to appreciate the massive long-term humanitarian impacts of tech progress. (I got here via poverty, then concern about faster tech progress for humanitarian benefits, and then only after a long time became interested in existential risk.) As others have pointed out, I think this is a bit of a historical coincidence.</p>\n", "parentCommentId": null, "user": {"username": "Paul_Christiano"}}, {"_id": "QmGEBSrFTEwE7AoJz", "postedAt": "2014-11-21T16:41:16.222Z", "postId": "WdtcxCKFLLCeLBR6H", "htmlBody": "<p>Moderate long-run EA doesn't look close to having fully formed ideas to me, and therefore it seems to me a strange way to introduce people to EA more generally.</p>\n<blockquote>\n<p>you’ll want to make investments in technology</p>\n</blockquote>\n<p>I don't understand this.  Is there an appropriate research fund to donate to?  Or are we talking about profit-driven capital spending?  Or just going into applied science research as part of an otherwise unremarkable career?</p>\n<blockquote>\n<p>and economic growth</p>\n</blockquote>\n<p>Who knows how to make economies grow?</p>\n<blockquote>\n<p>This will mean better global institutions, smarter leaders, more social science</p>\n</blockquote>\n<p>What is a &quot;better&quot; global institution, and is there any EA writing on plans to make any such institutions better?  (I don't mean this to come across as entirely critical -- I can imagine someone being a bureaucrat or diplomat at the next WTO round or something.  I just haven't seen <em>any</em> concrete ideas floated in this direction.  Is there a corner of EA websites that I'm completely oblivious to?  A Facebook thread that I missed (quite plausible)?)</p>\n<p>I have even less idea of how you plan to make better politicians win elections.</p>\n<p>More social science I can at least understand: more policy-relevant knowledge --&gt; hopefully better policy-making.</p>\n<p>Underlying some of what you write is, I think, the idea that political lobbying or activism (?) could be highly effective.  Or maybe going into the public service to craft policy.  And that might well be right, and it would perhaps put this wing of EA, should it develop, comfortably within the sort of common-sense ideas that you say it would.  (I say &quot;perhaps&quot; because the most prominent policy idea I see in EA discussions -- I might be biased because I agree with and read a lot of it -- is open borders, which is decidedly <em>not</em> mainstream.)</p>\n<p>But overall I just don't see where this hypothetical introduction to EA is going to go, at least until the Open Philanthropy Project has a few years under its belt.</p>\n", "parentCommentId": null, "user": {"username": "pappubahry"}}, {"_id": "2iZv5o5tCbwDCxkjS", "postedAt": "2014-11-21T17:33:38.188Z", "postId": "WdtcxCKFLLCeLBR6H", "htmlBody": "<ol>\n<li><p>What's the difference between moderate and long term EA? I'm guessing x-risk would be long term and perhaps some kind of research, medium term?</p>\n</li>\n<li><p>As your second footnote suggested, I think that the short vs long term debate really boils down to a low vs high risk one. Just like people have different tastes for risk level in their financial investments, so to in their philanthropic investments. Long term goals such as developing technology or x-risk I don't think anyone thinks are unimportant, they're simply unpredictable (high risk), whereas GiveWell-type charities don't fix systemic probs but more “safe.”</p>\n</li>\n<li><p>Related to #2 is diversification. People diversify their financial investments because low risk doesn't yield that much whereas high yield is also high risk, so they hold various levels of risk in their portfolio (or even within the same risk level, it's lower risk to have multiple investments, of course). This even makes sense if someone wanted to hold only high risk (long term) donations in their philanthropic portfolio: they may feel that putting all their money on, for instance, fighting corruption, is a long shot, so may feel comfort in giving half their donations to promoting morals. In this case, the risk level is still high, but it will give the donor the psychological comfort that he has TWO chances of improving the world, rather that just one! </p>\n</li>\n<li><p>You associate long term EA with weirdness, and I agree that the public would see AI, and some other forms of x-risk that way, but there are so many other long-term high impact pursuits that are not weird: research on behavioural economics; designing technologies that help the poor along with their distribution and marketing systems; decreasing corruption including political reform; restructuring our economic and monetary systems to make them more fair and egalitarian; promoting more moral or sustainable lifestyles like veganism; lobbying; green tech; medical tech. I don't think people would find any of these weird. </p>\n</li>\n<li><p>As someone on the forum stated earlier, people tend to be more motivated to make the world better, rather than deal with sad things like extreme poverty. I think that's probably true. When promoting EA, would it not be ideal to have a little “something for everybody”? ie. For those with bleeding hearts, immediate measures for helping the global poor; for tech-oriented people developing high-impact technologies; for “save the world from injustice” types, combating corruption. It's unacceptable to me that someone would reject philanthropy or direct EA altogether because the person teaching her about it was dismissive of her place on the risk-type-duration spectrum. We should be empowering everyone, not trying to get them to conform to a specific form of EA!</p>\n</li>\n</ol>\n", "parentCommentId": null, "user": {"username": "Austen_Forrester"}}, {"_id": "K9h6y6NyFFiKbTfAL", "postedAt": "2014-11-21T21:12:39.388Z", "postId": "WdtcxCKFLLCeLBR6H", "htmlBody": "<p>I get the general sense that the field of development economics is starting to ask the bigger questions again, often using different techniques than randomization.  This is from an interesting <a href=\"http://growthecon.wordpress.com/2014/04/18/defining-development-economics/\">blog post</a> I read recently:</p>\n<blockquote>\n<p>Economic development is about the transition of whole economies from low-productivity, poor places into high-productivity industrial economies. This transition encompasses several aspects: a move out of agriculture and into manufacturing or services, urbanization, declining fertility rates, integration with global markets. Current research in development economics – the RCTs and their like – does not study the transition. “What will make these people better off today?” is a different question than “What will make this economy develop?”.</p>\n</blockquote>\n<p>This type of criticism has been around for a long time (<a href=\"http://papers.ssrn.com/sol3/papers.cfm?abstract_id=1296115\">Rodrik</a>, <a href=\"http://chrisblattman.com/2009/01/07/so-you-want-to-be-an-impact-evaluator-a-cautionary-tale/\">Blattman</a>), but it seems to be gaining more traction now.</p>\n", "parentCommentId": null, "user": {"username": "Phil_Thomas"}}, {"_id": "NCAQbvhXuGTkWXubM", "postedAt": "2014-11-21T22:07:06.873Z", "postId": "WdtcxCKFLLCeLBR6H", "htmlBody": "<p>Something like the <a href=\"http://en.wikipedia.org/wiki/Efficient_frontier\">efficient frontier</a> in modern portfolio theory comes to mind, where you have a tradeoff between risk and return.  We have nowhere near enough data, and don't have a uniform metric of return, as the $/DALY seems too controversial, but I can still dream.</p>\n", "parentCommentId": "YzGPFXix9SfvuyEau", "user": {"username": "Phil_Thomas"}}, {"_id": "eRZjaJD5rqfs2oTDp", "postedAt": "2014-11-22T00:00:13.695Z", "postId": "WdtcxCKFLLCeLBR6H", "htmlBody": "<p>I agree, and I'd add that what I see as one of the key ideas of effective altruism, that people should give substantially more than is typical, is harder to get off the ground in this framework. Singer's pond example, for all its flaws, makes the case for <em>giving a lot</em> quite salient, in a way that I don't think general considerations about maximizing the impact of your philanthropy in the long term are going to.</p>\n", "parentCommentId": "QmGEBSrFTEwE7AoJz", "user": {"username": "Alexander_Berger"}}, {"_id": "hdhaqmyPFk86MxJR9", "postedAt": "2014-11-22T05:29:18.944Z", "postId": "WdtcxCKFLLCeLBR6H", "htmlBody": "<p>EA's haven't been as substantially involved in science funding, but it's a pretty common target for philanthropy. And many people invest in technology, or pursue careers in technology, in the interests of making the world better. My best guess is that these activities have a significantly larger medium term humanitarian impact than aid. I think this is a common view amongst intellectuals in the US. We probably all agree that it's not a clear case either way.</p>\n<p>The story with social science, political advocacy, etc., is broadly similar to the story with technology, though I think it's less likely to be as good as poverty alleviation (or at least the case is more speculative). </p>\n<p>Note that e.g. spending money to influence elections is a pretty common activity, it seems weird to be so skeptical. And while open borders is very speculative, immigration liberalization isn't. I think the prevailing wisdom is that immigration liberalization is good for welfare, and there are many other technocratic policies in the same boat, where you'd expect money to be helpful.</p>\n<p>It seems like this comes down to a distinction between effective altruism, meaning altruism which is effective, and EA referring to a narrower group of organizations and ideas. I am more interested in the former, which may account for my different view on this point. The point of the introduction also depends on who you are talking to and why (I mostly talk with people whose main impact on the world is via their choice of research area, rather than charitable donations; maybe that means I'm not the target audience here).</p>\n", "parentCommentId": "QmGEBSrFTEwE7AoJz", "user": {"username": "Paul_Christiano"}}, {"_id": "ef6LWg8chy5tYsAxp", "postedAt": "2014-11-22T06:47:37.110Z", "postId": "WdtcxCKFLLCeLBR6H", "htmlBody": "<blockquote>\n<p>It seems like this comes down to a distinction between effective altruism, meaning altruism which is effective, and EA referring to a narrower group of organizations and ideas.</p>\n</blockquote>\n<p>I'm happy to go with your former definition here (I'm dubious about putting the label 'altruism' onto something that's profit-seeking, but &quot;high-impact good things&quot; are to be encouraged regardless).  My objection is that I haven't seen anyone make a case that these long-term ideas <em>are</em> cost-effective.  e.g.,</p>\n<blockquote>\n<p>My best guess is that these activities have a significantly larger medium term humanitarian impact than aid. I think this is a common view amongst intellectuals in the US. We probably all agree that it's not a clear case either way.</p>\n</blockquote>\n<p>Has anyone tried to make this case, discussing the marginal impact of an extra technology worker?  We'd agree that as a whole, scientific and technological progress are enormously important, and underpin the poverty-alleviation work that we're comparing these longer-term ideas to.  But, e.g., if you go into tech and help create a gadget, and in an alternative world some sort of similar gadget gets released a little bit later, what is your impact?</p>\n<p>The answer to that last question might be large in expectation-value terms (there's a small probability of you making a profoundly <em>different</em> sort of transformative gadget), but I'd like to see someone try to plug some numbers in before it becomes the main entry point for Effective Altruism.</p>\n<blockquote>\n<p>Note that e.g. spending money to influence elections is a pretty common activity, it seems weird to be so skeptical.</p>\n</blockquote>\n<p>When Ben wrote &quot;smarter leaders&quot;, I interpreted it as some sort of qualitative change in the politicians we elect -- a dream that would involve changing political party structures so that people good at playing internal power games aren't rewarded, and instead we get a choice of more honest, clever, and dedicated candidates.  If, on the other hand, electing smarter leaders it means donating to your preferred party's or candidate's get-out-the-vote campaign... well I would like to see the cost-effectiveness estimate.</p>\n<p>(Ben might also be referring to EA's going into politics themselves, and... fair enough.  I doubt it'll apply to more than a small minority of EA's, but he only spent a small minority of his post writing about it.)</p>\n<blockquote>\n<p>there are many other technocratic policies in the same boat, where you'd expect money to be helpful.</p>\n</blockquote>\n<p>I think this is reasonable, and expectation-value impact estimates should be fairly tractable here, since policy wonks have often done cost-benefit analyses (leaving only the question of how much marginal donated dollars can shift the probability of a policy being enacted).</p>\n<p>Overall I still feel like these ideas, <em>as EA ideas</em>, are in an embryonic stage since they lack cost-effectiveness guestimates.</p>\n", "parentCommentId": "hdhaqmyPFk86MxJR9", "user": {"username": "pappubahry"}}, {"_id": "XeuFj6fy7n4j5hqvm", "postedAt": "2014-11-22T08:24:24.898Z", "postId": "WdtcxCKFLLCeLBR6H", "htmlBody": "<blockquote>\n<p>Is there an appropriate research fund to donate to? Or are we talking about profit-driven capital spending? Or just going into applied science research as part of an otherwise unremarkable career? Who knows how to make economies grow? What is a &quot;better&quot; global institution, and is there any EA writing on plans to make any such institutions better?</p>\n</blockquote>\n<p>I’d also find it helpful to know the answers to these questions. In particular, to compare like with like, it would be interesting to know how advocates of long-run focused interventions would recommend spending a thousand dollars rather than funding, say, bednet distribution.</p>\n<p>This is a key action-relevant question for me and others. I’ve asked quite a few people, but haven’t yet heard an answer that I’ve personally been impressed by. I also haven’t been given many specific charities or interventions, which leaves the argument in the realm of intellectually interesting theory rather than concrete practicality. Of course this isn’t to say that there aren’t any, which is why I ask! (I have made an effort to ask quite a few far-future focused people though.)</p>\n<p>(I know some people advocate saving your money until a good opportunity comes up. Paul has an interesting discussion of this <a href=\"http://rationalaltruist.com/2014/05/04/we-can-probably-influence-the-far-future/\">here</a>.)</p>\n", "parentCommentId": "QmGEBSrFTEwE7AoJz", "user": {"username": "Tom_Ash"}}, {"_id": "R2iCtYaPGe2sSqGNf", "postedAt": "2014-11-22T08:43:39.656Z", "postId": "WdtcxCKFLLCeLBR6H", "htmlBody": "<blockquote>\n<p>When people see effective altruists focused on cash transfers, distributing bed-nets and cheap medicine - and claiming they’re doing the most good - there’s a common reaction: &quot;This looks naive and narrow : Sure these interventions help the immediate beneficiaries, but they hardly look like they’re solving the world’s greatest problems. &quot;</p>\n</blockquote>\n<p>This is only anecdotal evidence, but I and a few others who've tried pitching people on these interventions haven't got that reaction. More broadly, I'm curious as to what your evidence is that this is contrary to &quot;common-sense do-gooding&quot;. Many non-EAs I know find it common sense, and say that they knew that bednets were a great giving opportunity, and that they've thought that they should donate to them before I suggested it. </p>\n<blockquote>\n<p>It looks like they’ve [...] ignored the historical record (in which science, technology and better government are some of the main drivers of progress)</p>\n</blockquote>\n<p>That is the historical record, but it's not obvious that thinking that we should give to global poverty charities ignores it or is refuted by it. You'd need to make an argument that a particular, individual sort of work that was available in the past did the most good, and that this is good evidence that an analogous sort of work (e.g. creating a generic tech start-up) will do more good than spending those resources on deworming or bednets or cash transfers.</p>\n<hr />\n<p>More broadly, there is an interpretation of common sense which is cautious, empirical, friendly to global poverty charities, and sceptical about at least some x-risk interventions. But I suspect that it's fruitless to debate whether this interpretation is correct or not. People can mean many different things by the phrase &quot;common sense&quot;, and these will often bear a distinct resemblance to what the person thinks themself. (We could try to work out what the average person thinks, or would think after suitable reflection. It's not obvious how much weight we should give to that, but it's certainly worth taking into account to some extent. I suspect that they're open to seeing global poverty charities as the best, and wouldn't be sold on many particular far future interventions, but I really don't know.)</p>\n", "parentCommentId": null, "user": {"username": "Tom_Ash"}}, {"_id": "nF6TtY7jCW3m29YhD", "postedAt": "2014-11-22T15:31:39.504Z", "postId": "WdtcxCKFLLCeLBR6H", "htmlBody": "<p>&quot;Long-run focused effective altruism is often seen as even less common-sense than the short-run focused version.&quot;</p>\n<p>I'd say that it is less 'common sense' as such, in terms of principles, although I agree that taking into account factors like economic/technological growth and the sustainability of civilization might lead recommending some interventions that are more broadly supported. That would be something of a coincidence, and there may also be very outlandish recommendations..</p>\n<p>On the intuitiveness of principles, there are a many factors that separately contribute to people's intuitions.</p>\n<p>A big part of 'common sense' for many people is focus on their own communities, and so neglect of physically and socially distant foreigners. Things like nuclear disarmament or scientific research will be less counterintuitive to many rich country citizens because of the visible impact on the welfare of their own communities.</p>\n<p>A different but related angle is mutualism: cooperating on Prisoner's Dilemma, contributing to public goods in a way that benefits everyone, versus one-sided transfers. The costs of cutting carbon emissions, or boosting scientific research, could be allocated around the world such that everyone wins. For transfers and health aid to the poorest the mechanisms for mutual benefit are weaker and harder to implement (although possible). Immigration with taxes and transfers to approach Pareto-improvement may fit in better with the mutualistic framework.</p>\n<p>Intuitions about sustainability over time and high average standards of living are more common than linear concern with population size (intrinsically, for a given standard of living and instrumental import).</p>\n<p>In some cases these will tend to coincide with a long-run welfare view, and in other cases with a short-run welfare view.</p>\n", "parentCommentId": null, "user": {"username": "CarlShulman"}}, {"_id": "aXqHQPDKqeEs6aqaM", "postedAt": "2014-11-26T21:53:43.910Z", "postId": "WdtcxCKFLLCeLBR6H", "htmlBody": "<p>My main evidence is that these things are only supported by a relatively small proportion of other groups that contain some people who care a great deal about making a difference e.g. people involved in international development, social entrepreneurs, tech entrepreneurs who care about impact, the non-profit sector, some academics, people who work at the UN, etc.</p>\n<p>Also, it seems clear that existing altruistic communities regard a much wider range of projects as plausibly high impact, and think it's weird to focus on just one narrow area.</p>\n<p>I think GWWC would also agree that objections along the lines of &quot;what about the long-run or systemic effects&quot; are some of the most common reactions to pitching AMF etc.</p>\n", "parentCommentId": "R2iCtYaPGe2sSqGNf", "user": {"username": "Benjamin_Todd"}}, {"_id": "iJdZzdq52sMEfi6WC", "postedAt": "2014-11-26T22:07:00.090Z", "postId": "WdtcxCKFLLCeLBR6H", "htmlBody": "<p>To clarify, I was defining the different forms of EA more along the lines of 'how they evaluate impact', rather than which specific projects they think are best.</p>\n<p>Short-run focused EA focuses on evaluating short-run effects.\nLong-run focused EA also tries to take account of long-run effects.</p>\n<p>Extreme long-run EA combines a focus on long-run effects with other unintuitive positions such as a focus on specific xrisks. Moderate long-run EA doesn't.</p>\n<p>The point of moderate long-run EA is that <em>it's much less clear which interventions are best</em> by these standards. </p>\n<p>I wasn't trying to say that moderate long-run EA <em>should</em> focus on promoting economic growth and building better institutions, just that these are valuable outcomes, and it's pretty unclear that we should prefer malaria nets (which were mainly selected on the basis of short-run immediate impact) to other efforts to do good that are widely pursued by smart altruists outside of the EA community.</p>\n<p>A moderate long-run EA could even think that malaria nets are the best thing (at least for money, if not human capital), but they'll be more uncertain and give greater emphasis to the flow through effects.</p>\n<p>Yes, moderate long-run EA is more uncertain and doesn't have &quot;fully formed&quot; answers - but that's the situation we're actually in.</p>\n", "parentCommentId": "QmGEBSrFTEwE7AoJz", "user": {"username": "Benjamin_Todd"}}, {"_id": "dFfkypPiWxahSHKXS", "postedAt": "2014-11-26T22:09:02.552Z", "postId": "WdtcxCKFLLCeLBR6H", "htmlBody": "<p>That's true, though you can just present the best short-run thing as a compelling lower bound rather than an all considered answer to what maximizes your impact.</p>\n", "parentCommentId": "eRZjaJD5rqfs2oTDp", "user": {"username": "Benjamin_Todd"}}, {"_id": "HJ3GigFPbH5aDRu7c", "postedAt": "2014-11-26T22:12:38.521Z", "postId": "WdtcxCKFLLCeLBR6H", "htmlBody": "<p>See my reply to pappubahry above. The distinction is between (i) short-run EA (ii) moderate long-run EA and (iii) extreme long-run EA, not short vs. medium vs. long. I agree this is confusing, sorry!</p>\n<p>Also, I don't think the distinction boils down to high-risk vs. low-risk. It's more about what kinds of evidence you use, and maybe some questions about values too.</p>\n", "parentCommentId": "2iZv5o5tCbwDCxkjS", "user": {"username": "Benjamin_Todd"}}]