[{"_id": "cayP9yJfx6dM3sBJz", "postedAt": "2023-11-10T03:03:48.797Z", "postId": "We7GwjeKJ6wNvXsPN", "htmlBody": "<p>Julia - I appreciate this initiative, and just want to add a caveat.</p><p>I think with any policies and procedures for 'reporting concerns' or whistleblowing, it's important, as in any '<a href=\"https://en.wikipedia.org/wiki/Detection_theory\">signal detection problem</a>', to balance the risks and costs of false positives (e.g. false accusations, slander from disgruntled or mentally ill employees) against the risks and costs of false negatives (missing bad behavior or bad organizations).</p><p>My impression is that EA has suffered some important and salient false negatives (e.g. missing SBF's apparent sociopathy &amp; FTX frauds). But some EA individuals and organizations, arguably, have also been subject to a wide range of false allegations -- especially by certain individuals who have a very long history of false allegations against many former associates and former employers.</p><p>It can be very easy to be taken in by a plausible, distressed, emotionally intense whistleblower - especially if one has little professional experience of handling HR-type disputes, or little training in relevant behavioral sciences (e.g. psychiatry, clinical psychology). This is an especially acute danger if the whistleblower has any of the Cluster B personality disorders (antisocial, narcissistic, borderline, histrionic disorders) that tend to be associated with multi-year histories of false allegations against multiple targets.</p><p>And these problems may be exacerbated if there are financial incentives for making false allegations (e.g. 'financial support for people reporting problems'), without many social or professional costs of doing so (e.g. if the false allegations are made from behind a cloak of anonymity, and their falseness is never reported to the EA community).</p><p>Thus, I would urge any EAs who set themselves up as adjudicators of whistleblowing cases to get some serious training in recognizing some of the red flags that may indicate false allegations -- especially in assessing any patterns of persistent false accusations, mental illness, or personality disorders.</p><p>It only takes one or two people with serious borderline personality disorder (for example), who are willing to make multiple false allegations, to ruin the reputations of multiple individuals and organizations -- especially if the people trying to investigate those allegations are too naive about what might be going on. The same caveat applies to any EAs who take it upon themselves to do any independent 'investigative reporting' of allegations against individuals or organizations.</p>", "parentCommentId": null, "user": {"username": "geoffreymiller"}}]