[{"_id": "vLrjrNoa7TFJ6t6Yw", "postedAt": "2022-12-02T00:44:55.934Z", "postId": "WEAXu8yTt5XbKq4wJ", "htmlBody": "<blockquote>\n<p>Some skills are dual purpose. Writing clearly helps both with truth seeking and being influential.</p>\n</blockquote>\n<p>This isn't obvious to me - how does being a good writer make you better at truth seeking?</p>\n", "parentCommentId": null, "user": {"username": "Khorton"}}, {"_id": "vrxtKxobwujksmxcd", "postedAt": "2022-12-02T00:46:32.390Z", "postId": "WEAXu8yTt5XbKq4wJ", "htmlBody": "<p>I'm no longer having substantive discussions at this site due to the CC BY license rule. Do you want to discuss off-site?</p>\n", "parentCommentId": "vLrjrNoa7TFJ6t6Yw", "user": {"username": "Elliot Temple"}}, {"_id": "JtPcjXYgu39RrvnwJ", "postedAt": "2022-12-02T06:21:04.411Z", "postId": "WEAXu8yTt5XbKq4wJ", "htmlBody": "<p>What is the license problem that you foresee, Elliot?</p>\n<p>What specifics concern you? I haven't thought about it carefully, what perspective am I missing?</p>\n", "parentCommentId": null, "user": {"username": "Noah Scales"}}, {"_id": "Z7Nh36x3brvzC3Jpm", "postedAt": "2022-12-02T17:18:04.014Z", "postId": "WEAXu8yTt5XbKq4wJ", "htmlBody": "<blockquote>\n<p>What is the license problem that you foresee, Elliot?</p>\n<p>What specifics concern you? I haven't thought about it carefully, what perspective am I missing?</p>\n</blockquote>\n<p>The license gives anyone the right to e.g. put my posts in a book and sell them without my consent. It lets them do all kinds of stuff with my work. I think my work is valuable and and I want to retain my IP and copyright rights about it. I think the prior, default system was good: fair use and quotations, plus asking for permission for other stuff.</p>\n<p>BTW I've been plagiarized multiple times, I've had multiple people put my ideas in their published commercial books without consent or even notifying me (including some copyright violations), and including with mangling my ideas so badly that I wouldn't want to be associated with their version so simply giving credit doesn't fix the problem for me. Talking about someone's ideas and quoting and paraphrasing them fairly and reasonably takes some skill that many people lack. One person offered to credit me as a co-author of his book when I found out he'd put a ton of my ideas in it. I declined because I would not want authorship of his low quality writing and reasoning, plus I was not involved with authoring the book at all. I don't want him to plagiarize me, and I also don't want him to incompetently summarize my ideas then credit me, let alone say I endorse it... CC BY would make all this stuff worse not better.</p>\n<p>But mostly I just want to retain my property rights for my ideas, work, research, writing, etc. I think giving most of my ideas and writing away as free to read is more than generous enough.</p>\n<p>My plan is to quit using the EA forum, though I'll write a few things without important philosophy in them, like this one, rather than quitting abruptly. I will continue posting articles at <a href=\"https://criticalfallibilism.com\">https://criticalfallibilism.com</a> and <a href=\"https://curi.us\">https://curi.us</a> plus I'm actively using my forum and two YouTube channels. I have ~30,000 words of EA related draft articles which I'll no longer be able to use as planned. I'll probably try to quickly post a fair amount of that at <a href=\"http://curi.us\">curi.us</a> with only light editing.</p>\n<p>BTW, when reviewing EA's terms of use yesterday I found other problems, e.g. a prohibition on posting anything \"untrue\".</p>\n<p>EDIT: I should also mention that I don't want anyone translating my writing without consent because translations can easily be inaccurate and misleading, and essentially be like misquoting me. Translations basically come with an implication that I endorse what they say because it's allegedly just my own words. I've had an issue with this in the past too, and if I ever get more popular all this stuff will come up more including with my archives.</p>\n", "parentCommentId": "JtPcjXYgu39RrvnwJ", "user": {"username": "Elliot Temple"}}, {"_id": "4HnYrDjGB3yk86Lxg", "postedAt": "2022-12-02T18:41:34.129Z", "postId": "WEAXu8yTt5XbKq4wJ", "htmlBody": "<p>Huh, very interesting, although it doesn't seem that the license terms stopped all that from happening to you.</p>\n<p>BTW, it looks like I can't indicate agreement or disagreement with your post? Is that a setting you have set?</p>\n", "parentCommentId": "Z7Nh36x3brvzC3Jpm", "user": {"username": "Noah Scales"}}, {"_id": "oXqNhqpAAZ6yDAZpo", "postedAt": "2022-12-02T18:53:43.044Z", "postId": "WEAXu8yTt5XbKq4wJ", "htmlBody": "<p>Yes the current default (US) copyright/IP system is far from perfect.</p>\n<p>I'm not aware of setting a setting and both voting things are showing up for me on my own post just like on yours (including with a private browsing window).</p>\n", "parentCommentId": "4HnYrDjGB3yk86Lxg", "user": {"username": "Elliot Temple"}}, {"_id": "daAcE6bBq93iShXft", "postedAt": "2022-12-02T18:55:40.022Z", "postId": "WEAXu8yTt5XbKq4wJ", "htmlBody": "<p>Right, well, now the voting thing is working, whatever.</p>\n", "parentCommentId": "oXqNhqpAAZ6yDAZpo", "user": {"username": "Noah Scales"}}]