[{"_id": "7BjQa8ykgmuHpeWbi", "postedAt": "2024-01-10T14:41:16.748Z", "postId": "WeruztmEM53mLjbkL", "htmlBody": "<p><strong>Executive summary</strong>: The Copenhagen Consensus Center published 12 papers analyzing the benefit-to-cost ratios of potential investments related to the SDGs. The ratios ranged from 18 to 125, much higher than cash transfers.</p><p><strong>Key points</strong>:</p><ol><li>The 12 papers examine investments like agricultural R&amp;D, vaccination, and e-government procurement.</li><li>Benefit-cost ratios range from 18 for nutrition to 125 for e-government procurement.</li><li>Ratios are much higher than cash transfers and exceed GiveWell's cost-effectiveness bar.</li><li>Total annual investment is $41 billion with total benefits of $2.14 trillion.</li><li>New potential focus areas with high ratios include e-government procurement, trade, and land tenure.</li><li>Conclusions show investing in these areas could generate substantial economic and health benefits.</li></ol><p>&nbsp;</p><p>&nbsp;</p><p><br><i>This comment was auto-generated by the EA Forum Team. Feel free to point out issues with this summary by replying to the comment, and</i><a href=\"https://forum.effectivealtruism.org/contact\"><i>&nbsp;<u>contact us</u></i></a><i> if you have feedback.</i></p>", "parentCommentId": null, "user": {"username": "SummaryBot"}}, {"_id": "eEYnLp5RiteHRjNsL", "postedAt": "2024-01-10T15:07:27.803Z", "postId": "WeruztmEM53mLjbkL", "htmlBody": "<p>Thanks for sharing!</p><p>Are the numbers comparable to GiveWell, or is one of them more conservative? One data point could be Malaria. Is the Benefit-to-cost ratio GiveWell calculates for e.g. AMF around 48 as well?</p><blockquote><p><strong>Malaria</strong></p><p>Paper: <a href=\"https://copenhagenconsensus.com/sites/default/files/2023-12/Malaria%20Best%20Investment%20Manuscript%20230310.pdf\">Benefits and Costs of Scaling up Coverage and Use of Insecticide Treated Nets</a>.</p><p>Benefit-to-cost ratio: 48.</p><p>Investment:</p><p>&gt;Scale up coverage of <strong>long-lasting insecticidal bed nets</strong> coverage to 10 percentage points above the 2019 level. Use of chlorfenapir to offset insecticide resistance and social and behavioral change communication to increase the usage including hang-up campaigns.</p></blockquote>", "parentCommentId": null, "user": {"username": "Milli"}}, {"_id": "vYfDEkuQKhXYw6JBH", "postedAt": "2024-01-10T15:34:52.448Z", "postId": "WeruztmEM53mLjbkL", "htmlBody": "<p>Thanks for asking, Milli! I have added the following to the post:</p><blockquote><ul><li>I expect the benefit-to-cost ratios of the papers to be overestimates:<ul><li>The paper on malaria estimates a ratio of 48, whereas I infer GiveWell's is:<ul><li>35.5 (= 14.8*2.4) for the Against Malaria Foundation (<a href=\"https://forum.effectivealtruism.org/topics/against-malaria-foundation\">AMF</a>), considering the mean cost-effectiveness across 8 countries <a href=\"https://docs.google.com/spreadsheets/d/18ROI6dRdKsNfXg5gIyBa1_7eYOjowfbw5n65zkrLnvc/edit#gid=1364064522&amp;range=A219\">of</a> 14.8 times that of cash transfers.</li><li>40.8 (= 17.0*2.4) for the <a href=\"https://forum.effectivealtruism.org/topics/malaria-consortium\">Malaria Consortium</a>, considering the mean cost-effectiveness across 13 countries <a href=\"https://docs.google.com/spreadsheets/d/18ROI6dRdKsNfXg5gIyBa1_7eYOjowfbw5n65zkrLnvc/edit#gid=791021775&amp;range=A256\">of</a> 17.0 times that of cash transfers.</li><li>Actually 24.0 (= 10*2.4) for any intervention, given GiveWell's cost-effectiveness bar <a href=\"https://www.givewell.org/how-we-work/our-criteria/cost-effectiveness/cost-effectiveness-models#grantmaking\">of</a> 10 times that of cash transfers? I am confused about many of GiveWell's cost-effectiveness <a href=\"https://docs.google.com/spreadsheets/d/18ROI6dRdKsNfXg5gIyBa1_7eYOjowfbw5n65zkrLnvc/edit#gid=1377543212&amp;range=A1\">estimates</a> being much higher than their bar. In theory, each intervention should be funded until the <a href=\"https://forum.effectivealtruism.org/topics/thinking-at-the-margin\">marginal</a> cost-effectiveness reaches the bar.</li></ul></li><li>The paper on malaria studies an annual investment of 1.1 G 2020-$, whereas GiveWell's estimates <a href=\"https://docs.google.com/document/d/1ZKq-MNU-xtn_48uN33L6VvBEZRAduvjwWMeaEffL4K4/edit#heading=h.l4b761fv6tg5\">respect</a> marginal donations.</li><li>Consequently, assuming <a href=\"https://forum.effectivealtruism.org/topics/diminishing-returns\">diminishing marginal returns</a>, and that GiveWell's estimates are more accurate, that of the paper on malaria is a significant overestimate.</li><li>I guess the same reasoning applies to other areas.</li></ul></li></ul></blockquote>", "parentCommentId": "eEYnLp5RiteHRjNsL", "user": {"username": "vascoamaralgrilo"}}, {"_id": "W2QNhJCkgfLNbcnrk", "postedAt": "2024-01-10T23:38:59.775Z", "postId": "WeruztmEM53mLjbkL", "htmlBody": "<p>Interesting list! I had a quick look at the papers for three areas not covered by major EA funders: my thoughts below</p><p><strong>e-Government procurement - </strong>IT systems to manage government tenders/purchases - making it easy for private sector companies to sell to governments, reducing prices through increased competition and reducing opportunities for corruption.</p><p>Looks very attractive because of a high benefit to cost ratio and relatively tractable problem,</p><ul><li>benefit-to-cost ratio could be as low as 8 for small, low income countries like Liberia and over 300 for a mid size, lower middle income country - a pretty wide range!</li><li>The paper estimates that in the long-term implementing across half of all government procurement saves an average of 6.75% on prices paid by government for goods and services, providing some evidence from real world programs.&nbsp;</li><li>Their estimated implementation costs look very low for complex projects (but on the other hand they also don't estimate costs of manual processes replaced, which might balance out somewhat)</li></ul><p>The problem isn't as tractable as it first looks because you have to convince (many levels of) the governments to change their ways. Theoretical ways to tackle:</p><ul><li>advocacy promoting move to e-procurement<ul><li>but IT firms capable of delivering already commercially incentivised to do this</li><li>and governments with pervasive corruption incentivised to ignore!</li></ul></li><li>fund development of \"best practice\" IT procurement solutions<ul><li>but in practice the IT solution isn't the hard or expensive bit; it's the integrating with local laws and language, and getting govt departments to adopt it</li></ul></li><li>capacity building and upfront funding for bodies trying to deliver.&nbsp;<ul><li>if you believe the paper's numbers, could be funded for as little as $22m over 12 years (and may even repayable in later years based on KPIs)</li><li>Not a traditional EA opp, but paying a government to implement an IT system to save themselves money is the sort of thing that's so counterintuitive maybe only an EA org would consider it!&nbsp;</li></ul></li></ul><p>The financial side stacks up on paper, but the net impact in terms of things EAs care about like utility is less obvious. Reduced government procurement costs can allow them to do more for less, but it also means local firms earning less. Not all cost savings will be due to corruption and not all of the money saved will be spent well.</p><p>&nbsp;</p><p><strong>Land tenure security - </strong>creating a registry of land ownership - making it easier for new landowners to sell or borrow against the value of their land, and enabling for them to spend money improving it without the risk of being dispossessed.</p><ul><li>The actual mechanisms by which householders and farmers benefit varies between studies and countries, with some finding no effect&nbsp;<ul><li>The benefits take some time to accrue (the paper assumes typically 6 to have any effect and estimates the NPV of benefits over 30 years) and meta analysis suggests timing may explain some of the \"no effect\" results</li></ul></li><li>EA organisations could promote the idea, or even subsidise it, but any actual action is contingent on government action<ul><li>This idea is well known to development economists and has been heavily promoted by de Soto (I'm amazed the paper didn't namecheck or cite him) in Peru and various other places, so I'm not sure how much EA advocacy would add.</li><li>Organisations like the World Bank have supported land registration projects financially and there is some scope for a privately-funded NGO like De Soto's <a href=\"https://www.ild.org.pe\">ILD</a> to actually do the hard work of identifying informal landownerss with the local government's blessing</li><li>The paper assumes a surprisingly high cost per site to maintain the land registry, so it's not a one-time intervention</li></ul></li></ul><p>&nbsp;</p><p><strong>Trade - </strong>reducing tariffs and trade barriers</p><ul><li>Free(r) trade can only be implemented by national governments. The cost/benefit analysis is looking at the costs to negatively affected industries vs the benefits to everyone else across multiples countries, so it's not comparable to GiveWell's estimates</li><li>The idea has been promoted/debated by economists since the 1700s and is promoted by multilateral bodies like the WTO/World Bank/IMF, so it's not really clear what EA advocacy would add.&nbsp;</li></ul>", "parentCommentId": null, "user": {"username": "David T"}}, {"_id": "aoqmmCQKL8trD5rZJ", "postedAt": "2024-01-11T05:28:17.420Z", "postId": "WeruztmEM53mLjbkL", "htmlBody": "<p>Thanks for the investigation, David! Strongly upvoted. It does look like the benefit-to-cost ratios are overestimates.</p>", "parentCommentId": "W2QNhJCkgfLNbcnrk", "user": {"username": "vascoamaralgrilo"}}, {"_id": "k4iCaABrvWqzYthK4", "postedAt": "2024-01-11T15:27:02.233Z", "postId": "WeruztmEM53mLjbkL", "htmlBody": "<p>I suggest being highly skeptical of the work coming from the Copenhagen Consensus Center. It's founder, <a href=\"https://en.wikipedia.org/wiki/Bj%C3%B8rn_Lomborg\">Bjorn Lomborg</a>, has on several occasions been found to have committed scientific dishonesty. I wouldn't use this report to make an determinations of what are the \"best investments\" without independently verifying the data and methodology.</p>\n", "parentCommentId": null, "user": {"username": "MatthewDahlhausen"}}, {"_id": "C4Er2zwbazHGrSakz", "postedAt": "2024-01-11T15:49:17.624Z", "postId": "WeruztmEM53mLjbkL", "htmlBody": "<p>Thanks for commenting, Matthew!</p><blockquote><p>I suggest being highly skeptical of the work coming from the Copenhagen Consensus Center. It's founder, <a href=\"https://en.wikipedia.org/wiki/Bj%C3%B8rn_Lomborg\">Bjorn Lomborg</a>, has on several occasions been found to have committed scientific dishonesty.</p></blockquote><p>For reference, readers interested in digging further into Bjorn's case can search for \"Cases Nos. 4, 5 and 6\" in <a href=\"https://ufm.dk/en/publications/2004/files-2004/annual-report-2003-danish-committees-scientific-dishones.pdf\">this</a> report. Here is a relevant passage:</p><blockquote><p>If the book [The Skeptical Environmentalist by Bjorn] was intended to be evaluated as science and not as a contribution to the general debate, then in addition the scientific message had been so distorted that the objective criteria for establishing scientific dishonesty had been met. DCSD [The Danish Committees on Scientific Dishonesty] did not find a sufficient basis, however, on which to establish that the defendant had misled his readers with intent or gross negligence. DCSD noted, in this context, that in the preface to the book the defendant had himself drawn attention to the fact that he was no expert in environmental issues.</p></blockquote><p>For what it is worth, none of the papers has Bjorn as one of authors, and all were published in a peer-reviewed journal.</p><blockquote><p>I wouldn't use this report to make an determinations of what are the \"best investments\" without independently verifying the data and methodology.</p></blockquote><p>I would say that checking the methodology of papers makes sense in general to see how much one can trust their conclusions, regardless of who are the authors.</p>", "parentCommentId": "k4iCaABrvWqzYthK4", "user": {"username": "vascoamaralgrilo"}}, {"_id": "RbnGrCnJnuuuDhNjN", "postedAt": "2024-01-12T06:56:23.165Z", "postId": "WeruztmEM53mLjbkL", "htmlBody": "<p>How should we compare their (CCC's) cost-benefit estimates to GiveWell's (GW's) results?</p><p>I quickly spot two differences:</p><ol><li>GW's benefit estimates are in units of <strong>doubling of consumption</strong> (interventions are compared to direct cash transfers <i>through Give Directly</i>, itself measured in terms of doubling of consumption), whereas CCC's estimates are in units of <strong>value of a statistical life.</strong></li><li>CCC's analyses are for large-scale government operations, so&nbsp;<ol><li>they don't account for counterfactual investments,</li><li>they encounter diminishing returns (compared to GW's focus on the marginal dollar).</li></ol></li></ol><p>Points <i>1.</i> and <i>2.a.</i> are both indications that CCC's cost-benefit ratios are higher than GW-esque's cost-effectiveness ratios, while <i>2.b.</i> goes to the other direction.</p><p>From the Tuberculosis paper, regarding value of a statistical life (VSL):</p><blockquote><p>The GDP growth in this group of countries outpaces the population growth, so that the VSL grows rapidly over time. In constant 2020 US$ values, the benefit of an averted death is US$ 98,700 (2020), US$ 149,800 (2025), US$ 212,000 (2030), US$ 276,300 (2035), US$ 338,100 (2040), US$ 396,800 (2045), and US$ 456,000 (2050).</p></blockquote><p>In comparison, GW estimates that one can save a life (or have equivalent impact) at about $5000. That's a factor of ~20. [I think this is misleading, so I'd be interested in a more careful comparison here, directly comparing VSL to doubling of consumption].</p><p>I'm also not sure how exactly to account for the differences in 2.</p>", "parentCommentId": null, "user": {"username": "edoarad"}}, {"_id": "oKsQxXcaMBTKRJPG9", "postedAt": "2024-01-12T07:06:54.172Z", "postId": "WeruztmEM53mLjbkL", "htmlBody": "<p>Also, CCC are using a discount rate of 8% (compared with 4% that's common at least for CE)</p>", "parentCommentId": "RbnGrCnJnuuuDhNjN", "user": {"username": "edoarad"}}, {"_id": "meDCZoAZLrwaa4tNk", "postedAt": "2024-01-12T07:52:14.955Z", "postId": "WeruztmEM53mLjbkL", "htmlBody": "<p>Thanks for commenting, Edo!</p><blockquote><p>GW's benefit estimates are in units of <strong>doubling of consumption</strong> (interventions are compared to direct cash transfers <i>through Give Directly</i>, itself measured in terms of doubling of consumption), whereas CCC's estimates are in units of <strong>value of a statistical life</strong>.</p></blockquote><p>I think which metric to pick will depend on one's preferred heuristic for contributing to a better world (somewhat related <a href=\"https://docs.google.com/document/d/1RmaG_QgqGQ0iQ-QvuJMEKd3YCIunV1Sv4S0AYBH0_Mc/edit?usp=sharing\">draft</a>; comments are welcome):</p><ul><li>Units of doubling of consumption appear more strictly connected to improving nearterm welfare (as proxied by e.g. <a href=\"https://en.wikipedia.org/wiki/Quality-adjusted_life_year\">quality-adjusted life years</a>).</li><li>Units of value of a statistical life, roughly proportional to units of consumption, appear more strictly connected to economic growth (as proxied by e.g. <a href=\"https://en.wikipedia.org/wiki/Gross_world_product\">gross world product</a>).</li></ul><blockquote><p>they [the papers] don't account for counterfactual investments,</p></blockquote><p>The papers focus on large scale interventions with massive benefits, so the counterfactual benefits will be pretty small in comparison? There is a chance governments or international organisations go ahead with the interventions funded by GiveWell, but a seemingly much smaller chance that a big government investment has no counterfatual impact due to the potential intervention of other actors?</p><blockquote><p>In comparison, GW estimates that one can save a life (or have equivalent impact) at about $5000. That's a factor of ~20. [I think this is misleading, so I'd be interested in a more careful comparison here, directly comparing VSL to doubling of consumption].</p></blockquote><p>Your BOTEC looks good to me. GiveDirectly's unconditional cash transfers have a benefit-to-cost ratio of <a href=\"https://All 12 ratios are much higher than the 2.4 estimated for GiveDirectly's cash transfers to poor households in Kenya. 4 are similar to and 8 are higher than GiveWell's cost-effectiveness bar of around 24 (= 10*2.4), equal to 10 times the above.\">2.4</a>, and <a href=\"https://forum.effectivealtruism.org/topics/givewell\">GiveWell</a>'s cost-effectiveness bar is <a href=\"https://www.givewell.org/how-we-work/our-criteria/cost-effectiveness/cost-effectiveness-models#grantmaking\">10</a> times that, which suggests a bar for the benefit-to-cost ratio of around 24 (= 10*2.4). So one should expect the cost-effectiveness of the interventions supported by GiveWell to have benefit-to-cost ratios in that ballpark. I agree a more careful comparison would be useful.</p>", "parentCommentId": "RbnGrCnJnuuuDhNjN", "user": {"username": "vascoamaralgrilo"}}, {"_id": "bZ6nBL7JvwCNMyQqJ", "postedAt": "2024-01-14T20:53:28.457Z", "postId": "WeruztmEM53mLjbkL", "htmlBody": "<p>What's your basis for assuming GiveWell's estimates are more accurate?</p>\n", "parentCommentId": null, "user": {"username": "jooke"}}, {"_id": "nCorAH6ePKmhHTgF7", "postedAt": "2024-01-14T22:55:14.515Z", "postId": "WeruztmEM53mLjbkL", "htmlBody": "<p>Thanks for the question, Joshua. Briefly:</p><ul><li>I think way more time has been invested into GiveWell's <a href=\"https://www.givewell.org/charities/top-charities\">recommendations</a> of AMF and Malaria Consortium than the time dedicated to producing the best investment paper on malaria:<ul><li>A typical paper is written in a few months.</li><li>GiveWell has been doing doing cost-effectiveness <a href=\"https://www.givewell.org/how-we-work/our-criteria/cost-effectiveness/cost-effectiveness-models\">analyses</a> of AMF's interventions since 2012, and Malaria Consortium's since 2016.</li><li>GiveWell spends 51.1 kh/year (= 0.75*40*46*37) doing research.</li></ul></li><li>From what I have seen, GiveWell often \"goes beyond the papers\" in order to really get at the best guess of the cost-effectiveness intervention, often adjusting the results found in the literature.</li><li>GiveWell <a href=\"https://blog.givewell.org/2011/08/18/why-we-cant-take-expected-value-estimates-literally-even-when-theyre-unbiased/\">understands</a> well the limitations of naive cost-effectiveness estimates.</li></ul><p>I should also note I meant more accurate conditional on a given set of values (namely, value of saving lives as a function of age and country, and value of income compared to health):</p><ul><li>GiveWell has spent much more time studying the interventions than figuring out their <a href=\"https://www.givewell.org/how-we-work/our-criteria/cost-effectiveness/comparing-moral-weights\">moral weights.</a></li><li>I tend to think economic growth is a better proxy for contributing to a better world than GiveWell's moral weights, which I suspect put too much weight on health, and do not account for saving lives in low income countries contributing less to the global economy.</li></ul>", "parentCommentId": "bZ6nBL7JvwCNMyQqJ", "user": {"username": "vascoamaralgrilo"}}, {"_id": "otFgJj4YqzJfkvAsx", "postedAt": "2024-01-19T21:55:54.420Z", "postId": "WeruztmEM53mLjbkL", "htmlBody": "<p>Thanks to Vasco for reaching out to ask whether GiveWell has considered:&nbsp;</p><ul><li>e-Government procurement (benefit-to-cost ratio of 125)</li><li>Trade (95)</li><li>Land tenure security (21).</li></ul><p>GiveWell has not looked into any of these three areas. We'd likely expect both the costs and the benefits to be fairly specific to the particular context and intervention. For example, rather than estimating the impact of reduced tariffs broadly, we'd ask something along the lines of: What is the intervention that can actually e.g., lead to a reduction in tariffs? On which set of goods/services would it apply? Which sets of producers would benefit from those lower tariffs? And thus, what is the impact in terms of increased income/consumption?</p><p>We think there's a decent chance that different methodologies between Copenhagen Consensus Center and GiveWell would lead to meaningfully different bottom line estimates, based on past experience with creating our own estimates vs. looking at other published estimates, although we can't say for sure without having done the work.</p>", "parentCommentId": null, "user": {"username": "GiveWell"}}, {"_id": "NhywCEBx8MzboyLWP", "postedAt": "2024-01-20T11:11:28.997Z", "postId": "WeruztmEM53mLjbkL", "htmlBody": "<p>Thanks for the comment! I think it would be good if you did shallow investigations of the 3 areas to see if there are any promising interventions.</p>", "parentCommentId": "otFgJj4YqzJfkvAsx", "user": {"username": "vascoamaralgrilo"}}]