[{"_id": "pJvD8mzt5zqEyLoaa", "postedAt": "2022-11-14T16:31:49.997Z", "postId": "WfeWN2X4k8w8nTeaS", "htmlBody": "<p>Maybe another way of handling Tortured Tim in case the torture prevents any non-hedonic goods from counting is to ask whether he should experience a day of torture to get those non-hedonic goods a day more than otherwise. And getting them a day earlier rather than an extra day at the end may also reduce confounding with duties to others, like family or friends. You have more important reasons to maintain relationships than to start them earlier.</p>\n<p>There are also of course long-term side effects from torture, but we could also put the torture at the end of his life so that he could make friends/family a day earlier, although this starts to get pretty abstract.</p>\n<p>Also, this wouldn't necessarily change the conclusion, but maybe the loss of a relationship/a loved one (or another non-hedonic good) is also a non-hedonic bad rather than just the loss of a non-hedonic good or involves some kind of worseness that is only comparative, neither more/stronger bads nor less/weaker goods. Then undergoing a day of torture to extend the life of a loved one (or multiple) by one day may be rational from a \"selfish\" point of view, although I'd still guess it wouldn't be.</p>\n", "parentCommentId": null, "user": {"username": "MichaelStJules"}}, {"_id": "geXSgePLpFoJHCnne", "postedAt": "2022-11-14T18:34:27.959Z", "postId": "WfeWN2X4k8w8nTeaS", "htmlBody": "<p>One possibility in favour of non-hedonic values mattering much more could be internalizing an individual's ethical views, obligations or rankings of social outcomes as their own welfare. For example, maybe Tortured Tim is undergoing torture in order to prevent the torture or deaths of others, possibly loved ones or many other people. We wouldn't necessarily say the torture in itself is any less bad to him hedonically, and, among available alternatives, undergoing it may very well be best on his ethical views and best on many impartial views. Can we say that it's better <i>for him</i>? We might say so based on preference-based values, or by assigning substantial non-hedonic value to acting ethically or being virtuous.</p><p>On the other hand, if we allow such values, then our welfare range over a short interval of time may become unbounded (especially for someone with aggregative views like a utilitarian), which seems kind of suspect psychologically. Furthermore, if we're able to make interpersonal utility comparisons across such utility functions at all (but maybe we can't or shouldn't!), we may need to rely on psychologically plausible units, e.g. how psychologically motivating something is, which may keep such non-hedonic preferences from outweighing torture, since torture is extremely psychologically motivating, plausibly near the extreme of psychological motivation, at least while it's happening.&nbsp;</p><p>Or, Tim's non-hedonic preferences about his own torture relative to other things are just a separate component of his welfare, and we shouldn't normalize it by how bad torture is for him hedonically. Also, his preferences may just change over time, especially while being tortured compared to not being tortured.</p>", "parentCommentId": null, "user": {"username": "MichaelStJules"}}, {"_id": "sQNPEXfSd4hNRH9Df", "postedAt": "2022-11-14T20:19:25.669Z", "postId": "WfeWN2X4k8w8nTeaS", "htmlBody": "<p>Thanks for the post!</p><p>I am a little confused about the meaning of non-hedonic goods/bads. \"Friendship, romantic love, acquiring knowledge, engaging in theoretical contemplation, doing meaningful work, developing practical skills, and so on\" all refer to conscious/hedonic states. In which sense are those goods non-hedonic?</p>", "parentCommentId": null, "user": {"username": "vascoamaralgrilo"}}, {"_id": "zN2xMNkjKKtmJResd", "postedAt": "2022-11-14T21:11:44.386Z", "postId": "WfeWN2X4k8w8nTeaS", "htmlBody": "<p>Thanks for the interesting post! I basically agree with the main argument, including your evaluation of the Tortured Tim case.<br><br>To also share one idea: I wonder whether a variation of the famous experience machine thought experiment can be taken to elicit a contrary intuition to Tortured Tim and whether this should decrease our confidence in your evaluation of the Tortured Tim case. Suppose a subject (call her \"Sarah\") can choose between having blissful experiences in the experience machine and having a moderately net-positive live outside of the machine, involving a rather limited amount of positive prudential (experiential and non-experiential) goods. I take it some (maybe many? maybe most?) would say that Sarah should (prudentially) not choose to enter the machine. If rather few non-experiential goods (maybe together with some positive experiences) can weigh more than the best possible experiences, this suggests that non-experiential goods can be very important, relative to experiential goods.</p><p>A possible reply would be that most of the relevant non-experiential goods might not be relevant, as they might be things like “perceiving reality” or “being non-deceived” which all animals trivially satisfy. But, in response, one may reply that the relevant non-experiential good is, e.g., the possession of knowledge which many animals may not be capable of.&nbsp;</p><p>In general, in these kinds of intuitive trade-offs negative experiences seem more important than positive experiences. Few would say that the best non-experiential goods can be more important than the most terrible suffering, but many would say that the best non-experiential goods can be more important than purely the most blissful experiences. Thus, since, in the decision-contexts you have in mind, we mostly care about negative experiences, i.e. animal suffering, this objection may ultimately not be that impactful.</p>", "parentCommentId": null, "user": {"username": "LeonardDung"}}, {"_id": "E8huChZHdrhjagLoj", "postedAt": "2022-11-15T15:55:27.606Z", "postId": "WfeWN2X4k8w8nTeaS", "htmlBody": "<p>Strong upvoted, I think this is a really excellent point.&nbsp;</p>", "parentCommentId": "zN2xMNkjKKtmJResd", "user": {"username": "MHR"}}, {"_id": "SCentDvki8nweMZqY", "postedAt": "2022-11-16T00:36:22.003Z", "postId": "WfeWN2X4k8w8nTeaS", "htmlBody": "<p>Thanks for the question, Vasco! So it's true that all those things could provide hedonic benefits. However, the idea is that all those things might <i>not</i> provide hedonic benefits--knowledge could be depressing, love could be taxing, etc.--and yet the objective list theorist would still say they add value to a life.</p>", "parentCommentId": "sQNPEXfSd4hNRH9Df", "user": {"username": "bob-fischer"}}, {"_id": "Db952FtiZSWv7f9FN", "postedAt": "2022-11-16T00:41:33.947Z", "postId": "WfeWN2X4k8w8nTeaS", "htmlBody": "<p>Thanks for your comment, Leonard. I guess I'd want to push your case a bit further. Imagine that Sarah enters the experience machine and is maxed out with respect to hedonic goods. Would the &nbsp;objective list theorist want to say that her life is bad on balance? Is it actually net negative? Presumably not. Her life might be much less good than it could be, but would still be positive on balance. If that's right, then that's exactly what we'd expect based on the Tortured Tim case: we get symmetry with respect to the impacts of non-hedonic goods. &nbsp;On Tim's side, they can't make him net positive; on Sarah's side, they can't make her net negative. Either way, they play a role in total welfare that's no greater than the role played by hedonic goods and bads.</p>", "parentCommentId": "E8huChZHdrhjagLoj", "user": {"username": "bob-fischer"}}, {"_id": "BqvyBeS4hNSdtkP9P", "postedAt": "2022-11-16T17:19:41.668Z", "postId": "WfeWN2X4k8w8nTeaS", "htmlBody": "<p>Thanks for the reply!</p><blockquote><p>However, the idea is that all those things might <i>not</i> provide hedonic benefits--knowledge could be depressing, love could be taxing, etc.--and yet the objective list theorist would still say they add value to a life.</p></blockquote><p>I would say that, even under a purely hedonistic view, it is always the case that knowledge, love etc. add value to life. They can add positive or negative value, depending on the specific snenario, but this uncertainty applies to any moral theory.&nbsp;</p><p>It appears to me that objective list theory values all and only hedonic states. However, while hedonist theories strive for improving these conscious states via focussing on heuristics more closely related to such states (e.g. life satisfaction), non-hedonist theories give more weight to other heuristics (e.g. objective list theory relies significantly on what is on the list as heuristics).&nbsp;</p><p>So I guess hedonism and objective list theory are different with respect to their methodology to increase value, but not on what they fundamentally value. Confusion might be generated when one says a given heuristic is intrinsically valuable:</p><ul><li>It is not so in the sense that it is not perfectly correlated with value.</li><li>It is so in the sense that for practical purposes it may be the heuristic more correlated with value we know of.</li></ul>", "parentCommentId": "SCentDvki8nweMZqY", "user": {"username": "vascoamaralgrilo"}}, {"_id": "vw8s9tg2zbRiMDioF", "postedAt": "2022-11-16T19:02:32.881Z", "postId": "WfeWN2X4k8w8nTeaS", "htmlBody": "<p>Hi Vasco. I think you're using \"hedonism\" and \"objective list theory\" in different ways than I'm using them. I understand hedonism as the view &nbsp;that all and only positive experiences are good for you and all and only negative experiences are bad for you, independently of their sources. I understand objective list theory as the view that pleasures and pains are on the list of things that are good and bad for you, respectively, but there are lots of other things that are on those lists too--where those other things are good or bad for you independently of whether we enjoy them or dislike them.</p>", "parentCommentId": "BqvyBeS4hNSdtkP9P", "user": {"username": "bob-fischer"}}, {"_id": "vCA2tFMbDcegzeFCv", "postedAt": "2022-11-16T20:54:09.491Z", "postId": "WfeWN2X4k8w8nTeaS", "htmlBody": "<p>Hi Bob,</p><p>Thanks for clarifying.</p><blockquote><p>I understand hedonism as the view &nbsp;that all and only positive experiences are good for you and all and only negative experiences are bad for you, independently of their sources.</p></blockquote><p>My interpretation is similar, but without the part \"independently of their sources\". &nbsp;I think it is not logically consistent to say that something is good or bad \"independently of their sources\", because all the sources influence conscious states. However, I believe one can say \"without focussing primarily on the sources\", which is what I meant to refer to with my heuristics discussion above.</p>", "parentCommentId": "vw8s9tg2zbRiMDioF", "user": {"username": "vascoamaralgrilo"}}, {"_id": "9g5RgMYiHHiBpBYKY", "postedAt": "2022-11-17T08:28:31.878Z", "postId": "WfeWN2X4k8w8nTeaS", "htmlBody": "<p>Thanks for the reply, I think it helps me to understand the issue better. As I see it now, there are two conflicting intuitions:&nbsp;</p><p>1. Non-hedonic goods seem to not have much weight in flipping a life from net-negative to net-positive (Tortured Tim) or from net-positive to net-negative (The experience machine). That is, Tim seems to have a net-negative life, even though he has all attainable non-hedonic goods, and Sarah in the experience machine has a net-positive life although she lacks all positive non-hedonic goods (or even has negative non-hedonic goods).&nbsp;</p><p>2. In the experience machine case, it seems (to many) as if hedonic goods have a lot less weight than non-hedonic goods in determining overall wellbeing. That is, Sarah can have blissful experience (100 on a hedonic scale from -100 to 100) in the machine but would arguably have a better life if she had moderately net-positive experience (say, 10 on the same scale) combined with the non-hedonic goods contained in almost any ordinary life.</p><p>If you interpret the experience machine case as involving negative non-hedonic goods, then the first intuition suggests what you say: that non-hedonic goods “play a role in total welfare that's no greater than the role played by hedonic goods and bads”. However, the second intuition does suggest precisely the opposite, it seems to me. If a moderate number of incompletely realized non-hedonic goods has a higher positive impact on welfare than perfectly blissful experience, then this suggests that non-hedonic goods play a more important role in welfare than hedonic goods, in some cases.</p>", "parentCommentId": "Db952FtiZSWv7f9FN", "user": {"username": "LeonardDung"}}, {"_id": "onNNa7u4YivpPF7rx", "postedAt": "2022-11-17T10:47:22.266Z", "postId": "WfeWN2X4k8w8nTeaS", "htmlBody": "<p>Appreciate your pushing this forward, Leonard. I guess I’m still not seeing why this is a problem for the main line of argument. I‘m thinking of goods and bads as being straightforwardly additive. So it’s true that, if an objective list theory is true, Sarah may have sufficient reason not to enter the machine even if it would max her out hedonically, but it doesn’t follow from that that hedonic goods have a lot less weight than non-hedonic goods in determining overall wellbeing. Suppose that Sarah‘s hedonic scale goes from -100 to 100, as you suggested, and her total wellbeing scale goes from -300 to 300, as I’ve suggested (3x). Then, she’s potentially leaving a lot of value on the table if she goes into the machine, as she’d get all that hedonic value (100) but none of the non-hedonic value (which represents an additional 200 possible welfare units). In such circumstances, it’s prudential rational for her to take a lower hedonic level (say, 25) to get even half the possible non-hedonic benefits (100), as that makes her better off overall (125 vs. 100).&nbsp;</p>", "parentCommentId": "9g5RgMYiHHiBpBYKY", "user": null}, {"_id": "J7ma9qsaWsgDvhgTC", "postedAt": "2022-11-17T13:44:44.140Z", "postId": "WfeWN2X4k8w8nTeaS", "htmlBody": "<p>Your way of further fleshing out the example is helpful. Suppose we think that Sarah has some, but below average non-hedonic benefits in her live (and expects this for the future) and that she should nonetheless not enter the machine. The question would then come down to: In relative terms (on a linear scale), how close is Sarah to getting all the possible non-hedonic value (i.e., does she get 50% of it, or only 10%, or even less)? The farer she is away from getting all possible non-hedonic value, the more non-hedonic value contributes to welfare ranges. However, at this point, it is hard to know what the most plausible answer to this question is.</p>", "parentCommentId": "onNNa7u4YivpPF7rx", "user": {"username": "LeonardDung"}}, {"_id": "ZFwEQLz3zjC7tZNgG", "postedAt": "2023-01-23T19:42:50.196Z", "postId": "WfeWN2X4k8w8nTeaS", "htmlBody": "<p>Thanks very much for writing this, I think you did a very clear job with the graphics and scenarios laying out the considerations.</p><p>I do wonder though if you have somewhat stacked the deck in favour of the hedonist account here:</p><blockquote><p>Now imagine Tortured Tim, an individual who is experiencing extraordinarily intense physical suffering. Nevertheless, he may have many other goods in his life: friendship, romantic love, knowledge, practical skills, and so on.</p></blockquote><p>This is a pretty extreme ('extraordinarily intense') pain scenario, vs fairly pedestrian goods like 'friendship'. I think some people's intuitions might be quite different in this sort of scenario:</p><blockquote><p>Now imagine Tortured Tim, an individual who is experiencing extraordinarily intense physical suffering due to frostbite on his trip to the North Pole. Nevertheless, he has a bond of brotherhood with his fellow adventures , who have been his best friends since elementary school and view this trip as the culmination of years of training, putting a huge personal importance on succeeding in this feat. He is also sustained by daily calls with his high school sweetheart, who has supported him all the way and with whom he is excited to marry and start a family with upon his return. Finally, he knows that by doing this trip, he is fulfilling his promise to his grandfather, who taught him so much and would have loved to be there.</p></blockquote><p>In this example, where I've tried to fill in the positive good examples to have a higher, more 'extraordinarily intense' magnitude, and be more specific, it does seem pretty plausible to me that Tim is experiencing positive welfare at that moment. It's definitely not the case that I would feel qualified, as an outside to observer, to contradict Tim's claim that this is a very positive experience for him.</p>", "parentCommentId": null, "user": {"username": "Larks"}}, {"_id": "g3TS4ovE4XXsxPGfW", "postedAt": "2023-01-23T20:29:21.862Z", "postId": "WfeWN2X4k8w8nTeaS", "htmlBody": "<p>Great case, Larks! Thanks for sharing.</p><p>I feel the force of this. However, I confess that as you rachet up the intensity of his suffering, I become less and less convinced that he's net positive. I do think that the goods you're describing can outweigh a lot of pain. But when I imagine hypothermia setting in--shivering uncontrollably, with muscles spasming and aching--I lose the sense that he's net positive.</p><p>But suppose you disagree and think he's net positive even then. I guess my question is: how<i> </i>positive is he? Do you still think it's a borderline case? If so, then we're still learning a lot about the relationship between Tim's hedonic and non-hedonic welfare capacity. And that's probably enough for the main conclusion of the post, which is that a different theory of welfare wouldn't make more than an order of magnitude difference.</p>", "parentCommentId": "ZFwEQLz3zjC7tZNgG", "user": {"username": "bob-fischer"}}, {"_id": "htHxEwwyxaGdwoKyb", "postedAt": "2023-01-24T03:20:21.486Z", "postId": "WfeWN2X4k8w8nTeaS", "htmlBody": "<p>Thanks for your response!</p><blockquote><p>I guess my question is: how<i> </i>positive is he? Do you still think it's a borderline case?</p></blockquote><p>In general I think it is hard to judge how much better one scenario is than another. But one way of getting at this is to add extra costs to one side of the scale. I think if you told me Tim had paid $10,000 to go on this trip, my evaluation of whether or not it was a good idea wouldn't significantly change vs if he paid $20,000, or if it was free. Similarly, my evaluation also wouldn't change a lot if he was hungry. So that makes me think my intuition is this is a pretty positive experience.&nbsp;</p><p>I can certainly believe this is a scenario where our fundamental intuitions just differ and there's not much more to say on the topic.</p>", "parentCommentId": "g3TS4ovE4XXsxPGfW", "user": {"username": "Larks"}}, {"_id": "grf3YEf85Mv3gFPL4", "postedAt": "2023-01-24T07:44:45.637Z", "postId": "WfeWN2X4k8w8nTeaS", "htmlBody": "<p>I wonder if your original description is compatible with \"extraordinarily intense physical pain\". Or, maybe it could still be extraordinary, but well within what's bearable and far from torture. Could he carry on a conversation with his high school sweetheart if the pain were intense enough, or be excited to marry her, or think about his promise to his grandfather? When pain reaches a certain level of intensity, I expect it to be very difficult to focus attention on other things. And, to the extent that he is focusing his attention on other things and away from the pain, the pain's hedonic intensity is reduced.</p>\n<p>Imagine he's also or instead having a panic attack. Or, instead of the trip, he's undergoing waterboarding as a cultural rite of passage (with all the same goods, similar ones or greater ones from your original description). How long could the average person be voluntarly waterboarded for any purpose? (EDIT: Or for some personal positive good in particular? I can imagine a sense of duty, e.g. to prevent greater harm to others or harm to loved ones in particular, allowing someone to last a long time, and those may figure into welfare range, but I probably wouldn't describe these in terms of positive goods, or maybe even bads, so that they can't be put on a ratio scale, only an interval scale at most.) These seem intense enough to consume attention. (I honestly don't have much intuitive sense of how painful frostbite can be.)</p>\n<p>(I also don't expect added hunger to make much difference to his hedonic welfare in the moment, because he'll be focusing on the much more intense pain. Less sure about financial costs, although those would probably not really affect his welfare during the trip itself.)</p>\n", "parentCommentId": "htHxEwwyxaGdwoKyb", "user": {"username": "MichaelStJules"}}, {"_id": "QRPaJfHpzTpzoRdZe", "postedAt": "2023-01-30T04:14:53.691Z", "postId": "WfeWN2X4k8w8nTeaS", "htmlBody": "<p>Interesting point, thanks for raising.&nbsp;</p><p>I worry a bit we might be introducing some confusion here. As far as I am aware, there is disagreement about whether welfare is constuted only by things you can experience (e.g. happiness, pain, pride, excitement, the-feeling-of-being-in-love) or whether it can also include things that you are not directly aware of (e.g. your welfare is reduced by infidelity, even if you are unaware).</p><p>If we believe that welfare is only determined by things you can experience, then I agree with you that when the pain is sufficient that he can't direct his attention to the good things, his overall welfare is going to tank. But then I'm not sure it's the pain outweighing the other things; rather, I think it's the pain having a indirect negative effect on his welfare by reducing the goods as well as the direct negative effect. So really now we're comparing a large hedonic value to a smaller non-hedonic value, and hence can't draw any conclusions about the maximum possible size of the two things. Only a scenario in which both are able to be experienced to their greatest extent can allow for such a comparison.</p><p>And if welfare is not only determined by things we directly experience? Well, to the extent that things you're not aware of can increase your welfare, I think I would just bite the bullet and say his welfare is indeed high, even if he has trouble focusing on that.</p><p>I'm not convinced by this response, but I think this is my best guess.</p>", "parentCommentId": "grf3YEf85Mv3gFPL4", "user": {"username": "Larks"}}, {"_id": "Sy6nWwA9jJAjQbkJL", "postedAt": "2023-02-02T14:30:32.145Z", "postId": "WfeWN2X4k8w8nTeaS", "htmlBody": "<p>Seems right, Larks. But I don't set things up this way in the post--or didn't mean to, anyway. I grant that he can have all the non-hedonic goods while being tortured for exactly the reason you mention. But then I still want to say: those non-hedonic goods don't make him net positive.&nbsp;</p><p>FWIW, I've given this thought experiment to hard-core objective list theorists and they just bite the bullet, insisting that his life is well worth living even while being tortured. Clearly, then, we aren't going to get agreement based on this thought experiment alone. However, I can't help but think that they're confusing meaningfulness with prudential goodness. I concede that a life could be meaningful in the face of torture--or even precisely because of it in some circumstances. But many meaningful lives are bad for the people who live them, which is partly why they're heroic for continuing them.</p><p>Anyway, hard issues!</p>", "parentCommentId": "QRPaJfHpzTpzoRdZe", "user": {"username": "bob-fischer"}}, {"_id": "AcL4oLGRRYZ7kYjLh", "postedAt": "2023-02-02T17:34:47.287Z", "postId": "WfeWN2X4k8w8nTeaS", "htmlBody": "<p>As one example, I think Richard Yetter Chappell, an objective list theorist, would say torture with maximal non-hedonic goods at the same time would be bad overall per moment:\n<a href=\"https://rychappell.substack.com/p/a-multiplicative-model-of-value-pluralism\">https://rychappell.substack.com/p/a-multiplicative-model-of-value-pluralism</a></p>\n", "parentCommentId": "Sy6nWwA9jJAjQbkJL", "user": {"username": "MichaelStJules"}}, {"_id": "ZeLYXdhYqRsXvJsYK", "postedAt": "2023-02-02T18:35:52.736Z", "postId": "WfeWN2X4k8w8nTeaS", "htmlBody": "<p>I did have in mind that non-experientialist goods could count, but as you suggest, experientialist goods (or goods that depend on their acknowledgement to count, including non-hedonic ones, so other than pleasure) would probably be weakened during torture, so that could introduce a confounder. The comparison now would be mostly be between hedonic bads and non-experientialist goods.</p>\n<p>Another issue is how to determine the weight of non-experientialist goods, especially if we don't want to be paternalistic or alienating. If we do so by subjective appreciation, then it seems like we're basically just turning them back into experientialist goods. If we do so via subjective weights (even if someone can't appreciate a good at the time, they might still insist it's very important and we could infer how good it is for them), its subjective weight could also be significantly reduced during torture. So we still wouldn't necessarily be comparing the disvalue of torture to the maximum value of non-experientialist goods using Tim's judgement while being tortured.</p>\n<p>Instead, if we do still want to use subjective weights, we might consider the torture and non-hedonic goods happening at different times (and in different orders?), for equal durations, and ask Tim during the torture, during the non-hedonic goods and at other times whether the non-hedonic goods make up for the torture. If the answers agree, then great. But if they disagree, this could be hard to resolve, because Tim's answer could be biased in  each situation: he underweights non-hedonic goods during torture and otherwise while not focusing on them, and he underweights torture while not being tortured.</p>\n<p>EDIT: On the other hand, if I tried to come up with a cognitively plausible objective cardinal account of subjective weights and value, I'd expect torture to be able to reach the max or get close to it, and that would be enough to say that negative hedonic welfare can be at least about as bad as goods can be good (in aggregate, in a moment).</p>\n", "parentCommentId": "QRPaJfHpzTpzoRdZe", "user": {"username": "MichaelStJules"}}, {"_id": "eNer7BkX6LtidPgJa", "postedAt": "2023-05-25T20:24:33.915Z", "postId": "WfeWN2X4k8w8nTeaS", "htmlBody": "<p>If the pain is so strong he can't focus on and appreciate some good he otherwise would without the pain, isn't this his brain itself deciding the pain is more important? I think this is the cognitive process of motivational salience, which integrates both positive (incentives, pleasure, desire) and negative (aversion, unpleasantness). If (actual or hypothetical/idealized) motivational salience determines importance, then measures of attention during joint exposure experiments are plausibly more reliable for ranking importance than people's statements, because the latter can be subject to additional biases, e.g. believing your commitments, especially to others, are more important than your pain serves your self-image as a good person, partner, friend, child or parent.</p>\n<p>You could use more direct measures of motivational salience, including while separately exposed to the good or the pain and this is plausibly closer to what we want to actually measure to determine the scale, but I'd expect the same rankings from measuring attention during joint exposure, all else equal. Similarly if you used some measure of felt (hedonic, desire) intensity directly when separately exposed, although I'm less sure positive and negative would even be commensurable with such a measure. I have read attention disruption is one of the functions of pain, so maybe joint exposure experiments would be negatively biased.</p>\n<p>However, if reflective preferences are what matter or are part of it, then for those we would probably use people's (and other animal's) statements or choices. We'd still have to worry about some of the same biases in people, though, but then intense pain may especially interfere with reflection. It's also not clear to me how we would construct an absolute scale to use across even humans, let alone across all animals or possible conscious beings. Even if there isn't one, that doesn't rule reflective preferences out, but then the implications seem much less clear. We might get incomparability between beings or even for the same being over time.</p>\n<p>(Actual or hypothetical/idealized) motivational salience, felt intensity and reflective preferences could be different kinds of welfare, possibly incommensurable, if they're determined by very different kinds of valuing systems.</p>\n", "parentCommentId": "QRPaJfHpzTpzoRdZe", "user": {"username": "MichaelStJules"}}]