[{"_id": "CNKzwYJqEdZNfjE4R", "postedAt": "2023-07-18T11:10:09.949Z", "postId": "WFoReKJgbsuHpWsRy", "htmlBody": "<p>This is the hottest topic in the far-UVC field right now. There were also a bunch of talks about it at the recent ICFUST conference. You can watch recordings of those talks <a href=\"https://web.cvent.com/event/231ad906-ecc1-4577-9bf9-32e11ae26f1a/websitePage:0edb4b77-2385-4aae-9b7b-680115a7d7b0\">here</a>.</p><p>Also, see this helpful list of existing studies around far-UVC and indoor air chemistry: <a href=\"http://bit.ly/guv-chem\">http://bit.ly/guv-chem</a></p><p>While I haven't read all of the studies in detail, my impression is that some of the results seem to disagree with each other, and the issue isn't settled yet.&nbsp;</p><p>Some thoughts from a draft for a forum post I wrote:</p><ul><li>Undoubtedly,&nbsp;<strong>far-UVC has a substantial impact on indoor air chemistry</strong> by producing ozone, which oxidizes volatile organic compounds in the air that can result in harmful products such as particulate matter<ul><li>The debate surrounds the question of how detrimental this is and existing studies seem to disagree somewhat to what extent this is a substantial issue.</li><li>Importantly, little research has been done on methods to mitigate this issue!&nbsp;<ul><li>For example, using activated carbon filters to remove ozone, making sure far-UVC is used with sufficient ventilation to remove ozone, or altering far-UVC fixture designs.&nbsp;</li></ul></li></ul></li></ul><p>Maybe helpful context: Using germicidal UV-C has always been a risk-benefit calculus. With far-UVC, the tradeoff might be chemical vs. biological, while with conventional upper-room GUV it was probably <a href=\"https://onlinelibrary.wiley.com/doi/10.1111/php.12093\">physical (eye-irritation) vs. biological</a>.&nbsp;</p>", "parentCommentId": null, "user": {"username": "MaxG"}}, {"_id": "j38ixeNJYSjiqkgkP", "postedAt": "2023-07-19T23:27:33.958Z", "postId": "WFoReKJgbsuHpWsRy", "htmlBody": "<p>Thanks Max - I'm glad this is a hot research topic.&nbsp;<br><br>At Good Ancestors Policy, we have begun advocating for the adoption in Australia of various pandemic prevention and mitigation approaches. The residual uncertainty (specifically that we don't have enough evidence to confidently advise on how that risk-benefit calculus should be assessed in different contexts) makes it very difficult currently to advocate for anything specific relating to far-UVC.<br><br>My hunch is that government-directed advocacy for far-UVC is only likely to be successful if we can say \"this technology has significant benefits during a pandemic, but provides meaningful ongoing benefit from reducing 'colds and flus' even when there isn't a pandemic\". That is, if the pitch is instead \"install this technology, turn it on if a certain risk threshold is crossed, and the cost-benefit works out because pandemics are super bad\" governments might be unlikely to bite even if that cost-benefit assessment is robust.<br><br>Will keep following this closely!&nbsp;</p>", "parentCommentId": "CNKzwYJqEdZNfjE4R", "user": {"username": "Greg S"}}, {"_id": "oAKjWdMt288ow6GpG", "postedAt": "2023-07-20T11:05:00.702Z", "postId": "WFoReKJgbsuHpWsRy", "htmlBody": "<p>I agree. Getting more data on risks (safety) and real-world efficacy to formulate a more comprehensive and convincing cost-benefit calculus is probably the biggest priority for far-UVC right now.</p>", "parentCommentId": "j38ixeNJYSjiqkgkP", "user": {"username": "MaxG"}}]