[{"_id": "tnakYgxiaATbGrKjj", "postedAt": "2021-09-21T06:28:34.392Z", "postId": "WHL3EhgjdEcEca3ae", "htmlBody": "<p>Great animated video version by CGP Grey - <a href=\"https://www.youtube.com/watch?v=cZYNADOHhVY\">link</a></p>", "parentCommentId": null, "user": {"username": "edoarad"}}, {"_id": "hGrGJfveoYyfCaF6m", "postedAt": "2021-09-23T09:13:48.102Z", "postId": "WHL3EhgjdEcEca3ae", "htmlBody": "<p>I think the weak point of the fable is that they only begin to think about the reorganisation after the dragon is dead; this could lead to worse consequences than the dragon. Thinking about overpopulation, for example, at least they have to know that they have enough environmental buffer to sustain it until the culture drift back into having fewer children later. Otherwise, the whole population could just die of hunger.&nbsp;</p><p>Actually, I don't think this is a weak point of the fable, it actually makes it much more real; that's how we humans usually behave. What it shows is that we really need to avoid this mistake.</p>", "parentCommentId": null, "user": {"username": "mikbp"}}, {"_id": "ezvibGgLRxq3taPqs", "postedAt": "2022-01-09T09:39:53.033Z", "postId": "WHL3EhgjdEcEca3ae", "htmlBody": "<p>[I'm doing a bunch of low-effort reviews of posts I read a while ago and think are important. Unfortunately, I don't have time to re-read them or say very nuanced things about them.]</p><p>I think that this is one of the classic bits of EA-related creative writing.</p><p>I think I was already intellectually aligned with this piece before reading it, but I felt the emotional pull of the cause area more after reading it.&nbsp;</p><p>It's advocating for life extension etc research, which doesn't seem like the most pressing problem on the margin, but does seem potentially really good. And I think the reasoning style (thoughtfully challenging the status quo, really caring about the impact on people) is important to EA generally, and other EA causes.</p>", "parentCommentId": null, "user": {"username": "Maxdalton"}}]