[{"_id": "eJQ3hLEFqgL9dzWb4", "postedAt": "2015-05-02T18:29:26.763Z", "postId": "Who2J8N4gLDENAj7g", "htmlBody": "<p>I think that the impact purchase program has had more trouble finding good sellers of impact than buyers (Paul can correct me if I'm wrong). So I suspect the hard part of any such effort would be to get a large enough &quot;deal flow&quot; that the site actually gets used.</p>\n<p>Separately, this sounds an awful lot like a two-sided market for certificates of impact except that the bids aren't binding and people's CE estimates are public to each other before they donate. Are there other relevant differences I'm missing?</p>\n", "parentCommentId": null, "user": {"username": "Ben_Kuhn"}}, {"_id": "JagbSiidByFKgACmS", "postedAt": "2015-05-02T22:21:52.481Z", "postId": "Who2J8N4gLDENAj7g", "htmlBody": "<p>We had a bigger group of applications this month (we'll post about it soon), along with significant unpurchased impact from last month, so now I think the balance is less clear. We'll see how the next round plays out, and how interested people are in funding the other opportunities.</p>\n<p>In the long run and all else equal, it would be great to have additional non-binding estimates and public discussion for projects people are considering buying. The issue is the opportunity cost of the time spent discussing or thinking about them, especially for small projects. I don't think the character of the problem is really fundamentally different than for GiveWell. You can either spend a long time on scalable interventions, or a little bit of time on non-scalable interventions. You care more about the ratio of (size of opportunity) / (effort).</p>\n<p>My guess is that the implementation is not a bottleneck. For example, having a post in this forum and a thread for each project (which may contain links) seems like it could basically work.</p>\n", "parentCommentId": "eJQ3hLEFqgL9dzWb4", "user": {"username": "Paul_Christiano"}}, {"_id": "74ehdB8djtjYkA4Na", "postedAt": "2015-05-04T05:49:42.328Z", "postId": "Who2J8N4gLDENAj7g", "htmlBody": "<p>Those differences are central; another one is that the projects don’t have to be completed. Eventually funders may be able or willing to buy some impact equity of charity startup founders, first funding them and eventually selling their share of the impact certificate at a profit, but so long as that’s not happening yet, it seems like another difference to me.</p>\n<p>There is also the artificial unit of the person in addition to that of the project that makes it a bit more complicated to estimate where the impact has really originated. The problem at project level persists, but the person is not relevant. Then again you could imagine charities as a whole funding their operation by selling impact certificates, so it may not be a principle difference either.</p>\n<p>I’ve been thinking about whether there are ways to hide the estimates for a while, for example until two of them are posted, but I haven’t come up with anything that I think would work.</p>\n", "parentCommentId": "eJQ3hLEFqgL9dzWb4", "user": {"username": "Telofy"}}, {"_id": "jDtafqyMxvBKD6LwY", "postedAt": "2015-05-04T06:10:22.430Z", "postId": "Who2J8N4gLDENAj7g", "htmlBody": "<p>Looking forward to the results!</p>\n<p>And good idea! If we use this forum for it, the posts would have to follow a common format to make it easier for people to calculate the metrics. We’d also need a central place, like a tag, to collect them, so people can compare among them easily. That will be very important.</p>\n<p>If you buy my benchmark certificate, we can also convert dollars to utils more easily and draw on certificate prices to inform the estimates.</p>\n", "parentCommentId": "JagbSiidByFKgACmS", "user": {"username": "Telofy"}}, {"_id": "WzrepbpfGbW9F6aMp", "postedAt": "2015-05-09T02:13:25.787Z", "postId": "Who2J8N4gLDENAj7g", "htmlBody": "<p>This sounds awesome, and perhaps even the sort of thing we could use to assess the applications we get for EA Ventures (eaventures.org). I imagine the tough part will be acquiring and sustaining a user base of reviewers. Toward this end, you might first recruit an official board of dedicated reviewers yet still allow for anyone to leave impact estimates.</p>\n<p>The next couple weeks are going to be serious crunch time on EA Global, but feel free to ping me about this in ~2 weeks if you're interested in a potential EAV integration: <a href=\"mailto:tyler@centreforeffectivealtruism.org\">tyler@centreforeffectivealtruism.org</a></p>\n", "parentCommentId": null, "user": {"username": "tyleralterman"}}, {"_id": "zE8yDQyhTErTf42ws", "postedAt": "2015-05-10T10:18:54.310Z", "postId": "Who2J8N4gLDENAj7g", "htmlBody": "<p>Cool, noted. If we use this forum for it, or at least for the MVP, then the preparatory work will be concerned mostly with codifying a common structure for the impact analyses so readers can glean the most important data quickly and writers are forced to include various important considerations. I also thought of EA Ventures here, since you already have a framework that could perhaps be adapted.</p>\n", "parentCommentId": "WzrepbpfGbW9F6aMp", "user": {"username": "Telofy"}}, {"_id": "tHDL3iZaw4MZGq4hN", "postedAt": "2015-09-04T00:27:31.390Z", "postId": "Who2J8N4gLDENAj7g", "htmlBody": "<p>+1. Tyler, has Telofy pinged you about this yet?</p>\n", "parentCommentId": "WzrepbpfGbW9F6aMp", "user": {"username": "Evan_Gaensbauer"}}, {"_id": "5m2m839Di6FuPYD2c", "postedAt": "2015-09-04T13:53:48.977Z", "postId": "Who2J8N4gLDENAj7g", "htmlBody": "<p>I have, but it must’ve been still in the EA Global crunch time. I still don’t know when I’ll have time to work on it…</p>\n", "parentCommentId": "tHDL3iZaw4MZGq4hN", "user": {"username": "Telofy"}}]