[{"_id": "sw3c9EGDWqyZHKSWM", "postedAt": "2022-11-28T20:12:40.936Z", "postId": "Whztt59kSTrnRwawu", "htmlBody": "<p>Thanks for posting this!&nbsp;</p><p>At a skim, this looks related to <a href=\"https://forum.effectivealtruism.org/posts/un3fHR8azykyCoCui/passing-up-pay\">Passing Up Pay</a> by Jeff Kaufman, and <a href=\"https://forum.effectivealtruism.org/posts/QWLwfqkLxuhaqh3fg/should-effective-altruism-have-a-norm-against-donating-to\">Should effective altruism have a norm against donating to employers?</a> by Owen Cotton-Barratt. I don't remember what was in those posts, exactly, but imagine that readers who find this interesting might also find the discussion on those posts useful.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Lizka"}}, {"_id": "bbnbJHptHSnyS6bqR", "postedAt": "2022-11-28T20:17:06.289Z", "postId": "Whztt59kSTrnRwawu", "htmlBody": "<blockquote>\n<p>Would these relinquishments be seen by governments as actually income?</p>\n</blockquote>\n<p>I'm not an expert on this, but when I've looked into this before I've been told it probably would count as income as long as (a) the amount to relinquish was up to the employee and (b) the employee had influence on where the money was donated.</p>\n", "parentCommentId": null, "user": {"username": "Jeff_Kaufman"}}, {"_id": "Jirtx5Spescijh6YG", "postedAt": "2022-11-28T20:23:14.138Z", "postId": "Whztt59kSTrnRwawu", "htmlBody": "<p>Within <a href=\"https://forum.effectivealtruism.org/posts/un3fHR8azykyCoCui/passing-up-pay\">Passing up Pay</a>, the OP's comment thread in particular: <a href=\"https://forum.effectivealtruism.org/posts/un3fHR8azykyCoCui/passing-up-pay?commentId=z2uL9Egv7XLewekSd\">https://forum.effectivealtruism.org/posts/un3fHR8azykyCoCui/passing-up-pay?commentId=z2uL9Egv7XLewekSd</a></p>\n", "parentCommentId": "sw3c9EGDWqyZHKSWM", "user": {"username": "Jeff_Kaufman"}}, {"_id": "YFKK7jtAA43eyiWwA", "postedAt": "2022-11-28T20:25:24.458Z", "postId": "Whztt59kSTrnRwawu", "htmlBody": "<p>FYI: people usually say \"modest proposal\" for things they think are actually bad ideas, in the tradition of Swift's satirical <a href=\"https://en.wikipedia.org/wiki/A_Modest_Proposal\">https://en.wikipedia.org/wiki/A_Modest_Proposal</a></p>\n", "parentCommentId": null, "user": {"username": "Jeff_Kaufman"}}, {"_id": "fxqBTje6rwwQGnNk2", "postedAt": "2022-11-28T21:24:21.619Z", "postId": "Whztt59kSTrnRwawu", "htmlBody": "<p>Oh good point. I forgot</p>\n", "parentCommentId": "YFKK7jtAA43eyiWwA", "user": {"username": "david_reinstein"}}, {"_id": "KN5C2Dnj8X8mhQych", "postedAt": "2022-11-28T21:39:43.179Z", "postId": "Whztt59kSTrnRwawu", "htmlBody": "<p>My guess is that this would be considered akin to an <a href=\"https://ecommons.udayton.edu/cgi/viewcontent.cgi?article=1107&amp;context=udlr\">anticipatory assignment of income</a> and would be charged against the wage earner as income, but I didn't look at it for more than three minutes. So that is something you would want to run by a tax lawyer before actually doing (standard disclaimer that I can't give legal advice).</p><p>I can think of two other ways you <i>might </i>be able to pull something like this off, although they involve additional complications:</p><ul><li>If everyone in Organization X already donated at least $5000 per year to charity, Organization X could potentially cut salaries by $3750 and announce a 3:1 employee charitable matching program (up to $1250 in employee giving).&nbsp;</li><li>If you (an employee of Organization X) want to contribute $5000 to Organization Y, and an employee of Organization Y wants to contibute $5000 to Organization X, you might be able to agree to each petition your employers for a $5000 pay cut. In theory, one could develop an algorithm to match people who wanted to do this across organizations in any number of combinations.</li><li>I haven't given much thought to either of these, but they don't strike me as assignments of income in the same way as the initial suggestion. Definitely do not try without obtaining actual legal advice from a tax lawyer!</li><li>The common method to mitigate effects of losing the standard deduction -- which I use -- is to donate nothing in half of the years (drawing the money into a savings account instead), and donate twice as much in the other half. Yes, I mail a number of checks in December and January of odd-number years. Yes, I take a video of myself putting the December ones in a USPS mailbox that is uploaded to the cloud. :)</li></ul>", "parentCommentId": null, "user": {"username": "Jason"}}, {"_id": "ZYtGSBRGbh7rcLFN6", "postedAt": "2023-02-10T17:08:19.458Z", "postId": "Whztt59kSTrnRwawu", "htmlBody": "<p>I've heard from someone that Open Phil-sponsored companies are now doing essentially what you suggest. If you look at for example <a href=\"https://jobs.lever.co/Anthropic/8b85d37f-6201-489a-853e-a4523aeb45b8\">Anthropic's job board</a> you can see one of their benefits is, \"Optional equity donation matching at a 3:1 ratio, up to 50% of your equity grant.\" By donating equity they avoid income taxes, and perhaps there are other tax implications of donating tax instead of cash (I'm not an expert).</p>", "parentCommentId": null, "user": {"username": "Max Pietsch"}}, {"_id": "PBkvHxARQrZHADDzc", "postedAt": "2023-02-10T21:52:43.142Z", "postId": "Whztt59kSTrnRwawu", "htmlBody": "<p>Donating equity seems a bit different but also interesting! Thanks</p>\n", "parentCommentId": "ZYtGSBRGbh7rcLFN6", "user": {"username": "david_reinstein"}}]