[{"_id": "GzjmaCm6CzA2T7EpD", "postedAt": "2023-09-19T20:51:38.976Z", "postId": "WigMgsDrSzrnRZ5mm", "htmlBody": "<blockquote><p>Now this is not… great, and certainly quite different from the data by tenthkrige. I'm pretty sure this isn't a bug in my implementation or due to the switch from odds to log-odds, but a deeper problem with the method of rounding for perturbation.</p></blockquote><p>It's not particularly my place to discuss this, but when I replicated his plots I also found got very different results, and since then he shared his code with me and I discovered bug in it.</p>", "parentCommentId": null, "user": {"username": "Simon_M"}}, {"_id": "aJ5Kv9NbvBJiqLmpr", "postedAt": "2023-09-20T21:27:40.030Z", "postId": "WigMgsDrSzrnRZ5mm", "htmlBody": "<p><strong>Executive summary</strong>: The post investigates methods for estimating the precision of a set of probability forecasts, in order to determine at what level of granularity the forecasts add information. It finds issues with rounding-based approaches and instead proposes perturbing forecasts by adding noise.</p><p><strong>Key points</strong>:</p><ol><li>Precision should be measured in bits, not probabilities, using the logit function.</li><li>Rounding probabilities to bins worsens scores in unintuitive ways on small datasets.</li><li>Adding uniform noise to log-odds probabilities produces smoothly declining scores.</li><li>Binary search finds the point where score worsens faster but may underestimate.</li><li>Forecasting datasets have similar precision: ~1.2 bits for Metaculus, ~1.3 bits for PredictionBook.</li><li>Knowing precision allows sensitivity analysis and avoids false precision claims.</li><li>Noising perturbations seem better than rounding but more analysis is needed.</li></ol><p>&nbsp;</p><p><i>This comment was auto-generated by the EA Forum Team. Feel free to point out issues with this summary by replying to the comment, and</i><a href=\"https://forum.effectivealtruism.org/contact\"><i>&nbsp;<u>contact us</u></i></a><i> if you have feedback.</i></p>", "parentCommentId": null, "user": {"username": "SummaryBot"}}, {"_id": "ACaxPNyyjZm3bDKuo", "postedAt": "2023-09-22T14:51:49.977Z", "postId": "WigMgsDrSzrnRZ5mm", "htmlBody": "<p>Interesting, good to know!</p>\n<blockquote>\n<p>It's not particularly my place to discuss this</p>\n</blockquote>\n<p>I'm confused at this statement, though.</p>\n", "parentCommentId": "GzjmaCm6CzA2T7EpD", "user": {"username": "niplav"}}]