[{"_id": "wQZ4m8vY3AzvvSsCM", "postedAt": "2022-12-18T22:41:59.628Z", "postId": "Wj2Z2NXDZXiysnRv5", "htmlBody": "<p>This is a really good post and you're making me feel bad about my own&nbsp;<strong> </strong><a href=\"https://forum.effectivealtruism.org/posts/vHogKj87ZBLgN8TpQ/today-is-draft-amnesty-day-december-16-18\">Draft Amnesty Day</a> posts :P</p><p>[take this as a compliment :) ]</p><p>&nbsp;</p><p>I specifically resonate with your entire <a href=\"https://forum.effectivealtruism.org/posts/Wj2Z2NXDZXiysnRv5/lessons-learned-from-tyve-an-effective-giving-startup#Lesson_3___Probably_don_t_try_to_solve_lack_of_effective_giving_with_technology\">Lesson 3 - Probably don’t try to solve lack of effective giving with technology</a> , I didn't think about 'I think if the problem you’re trying to solve is “I feel guilty about being rich”', which is a nice insight pointing at \"understand the users really well\".</p><p>Here's <a href=\"https://forum.effectivealtruism.org/topics/software-engineering?tab=subforum&amp;commentId=A7bicw2djSmvy3TMP\">my version</a> of your <a href=\"https://forum.effectivealtruism.org/posts/Wj2Z2NXDZXiysnRv5/lessons-learned-from-tyve-an-effective-giving-startup#Lesson_5___Don_t_confuse__this_should_exist__with__people_want_this_to_exist_\">Don’t confuse “this should exist” with “people want this to exist”</a> (I really agree here too).</p><p>I love the humor as well as the correctness of <a href=\"https://forum.effectivealtruism.org/posts/Wj2Z2NXDZXiysnRv5/lessons-learned-from-tyve-an-effective-giving-startup#Lesson_6___Ignore_all_the_above__maybe_you_can_be_the_one_to_do_it_right\">Ignore all the above, maybe you can be the one to do it right</a>: Someone is going to crack this, yeah (maybe Momentum will). The main takeaway for this kind of project isn't [in my opinion] that it's impossible, it's more like \"it's harder than it seems / don't ignore this hard part\".&nbsp;</p><p>Anyway, that's my draft comment. Nice post!</p>", "parentCommentId": null, "user": {"username": "hibukki"}}, {"_id": "rdksC8A6bKCMqoxAr", "postedAt": "2022-12-19T00:47:13.170Z", "postId": "Wj2Z2NXDZXiysnRv5", "htmlBody": "<p>Thanks for sharing this, I really enjoy retrospectives of failure, and think they are very useful. Also, I think you could remove the 'draft' warning label; this seems like a totally respectable finished post to me.</p>\n", "parentCommentId": null, "user": {"username": "Larks"}}, {"_id": "CqxjefajJwyq8Wo6F", "postedAt": "2022-12-19T06:00:15.755Z", "postId": "Wj2Z2NXDZXiysnRv5", "htmlBody": "<p>What does EA/tech mean? EA-related tech?</p>\n", "parentCommentId": null, "user": {"username": "smountjoy"}}, {"_id": "AJCbrvTC6PDdP9enc", "postedAt": "2022-12-19T09:09:32.155Z", "postId": "Wj2Z2NXDZXiysnRv5", "htmlBody": "<p>Thank you for being transparent and insightful about the lessons learned. I found this post useful!<br><br>Would you be comfortable sharing some more statistics? I'm thinking things like...</p><ul><li>Rate of enrollment at companies</li><li>Average donation amount when you were up and running, I suspect it was lower than described in \"<i>It currently has £15,000 amount going through each month from 150 users.\"</i></li><li>Dropoff rates from users' payroll giving</li><li>...</li></ul><p>You've nudged me one step closer to writing a similar thing about learnings from a Swedish charity startup I worked with in 2017-2020.</p>", "parentCommentId": null, "user": {"username": "henrith"}}, {"_id": "nyzKutmZXESwDZN8Y", "postedAt": "2022-12-19T16:19:01.510Z", "postId": "Wj2Z2NXDZXiysnRv5", "htmlBody": "<p>Thank you for sharing your experience. I think your observation that there are not really big barriers to individuals effectively donating is correct.</p>\n<p>If you'd like to check out my approach to funding charities, it would enable individuals to fund charities without personal sacrifice, by buying from companies with charities in the vast majority equity position. That way they could pay the same amount for goods and services, but charities benefit rather than traditional shareholders.</p>\n<p>The back end of this project, which I call the Profit for Good model, is potentially pretty powerful: people can fund charities without personal sacrifice through economic discrimination. The front end is a much heavier lift however. Not only do you have to have companies with charities in the equity position, you also have to have a public that is aware of the option and has the means of exercising it easily available. Nonetheless, I think this model has a good chance of solving many major global problems because anyone would rather buy in a way that helps people if there are not associated sacrifices.</p>\n<p>If you would like to learn more :\n<a href=\"https://forum.effectivealtruism.org/posts/WMiGwDoqEyswaE6hN/making-trillions-for-effective-charities-through-the\">https://forum.effectivealtruism.org/posts/WMiGwDoqEyswaE6hN/making-trillions-for-effective-charities-through-the</a></p>\n", "parentCommentId": null, "user": {"username": "Brad West"}}, {"_id": "fSi6HeEAppMrRJc6o", "postedAt": "2022-12-20T08:40:19.048Z", "postId": "Wj2Z2NXDZXiysnRv5", "htmlBody": "<p>Thanks for sharing this, I really enjoyed it.</p>\n<p>I did some \"customer\" research around effective giving a year or so back and found some similar themes.</p>\n<p>Engaged EAs already seem to have what they need. Most other people give small amounts to affirm/signal their values, with little regard for impact. It is indeed easy to think of things that \"should exist\" but people don't want!</p>\n", "parentCommentId": null, "user": {"username": "Craig Drayton"}}, {"_id": "hStwaGM3Bcb8A4kub", "postedAt": "2022-12-22T14:13:40.805Z", "postId": "Wj2Z2NXDZXiysnRv5", "htmlBody": "<p>Thanks for posting, this is super interesting!\nLearning #1 is also my top learning from starting a company.</p>\n<p>It sounds like Tyve didn't have proper product / market fit and hence you struggled gaining more customers if I read it correctly? Looking at Deed, their posterchild efforts seem to be climate change and LGBTQ rights, which many startups/employees already care about greatly, so I can see executives viewing the product as a good way to showcase their company's committal to DEI etc.\nDid you go more with a bednets and effective giving pitch? Ofc I'm just speculating here.</p>\n", "parentCommentId": null, "user": {"username": "JanEbbing"}}, {"_id": "hDTxQB6Amw63YjThn", "postedAt": "2022-12-26T10:32:14.596Z", "postId": "Wj2Z2NXDZXiysnRv5", "htmlBody": "<p>Thank you Larks!</p>", "parentCommentId": "rdksC8A6bKCMqoxAr", "user": {"username": "imben"}}, {"_id": "ukC3JAsY9mjkn6q8z", "postedAt": "2022-12-26T10:35:06.990Z", "postId": "Wj2Z2NXDZXiysnRv5", "htmlBody": "<p>Thanks Yonatan. I like your version of \"should exist vs people want this to exist\". I've also seen and been tempted by proposals for \"lists\".</p>", "parentCommentId": "wQZ4m8vY3AzvvSsCM", "user": {"username": "imben"}}, {"_id": "PK23hCoWSqspC7xJt", "postedAt": "2022-12-26T10:47:26.496Z", "postId": "Wj2Z2NXDZXiysnRv5", "htmlBody": "<p>Thanks Henrith!<br><br>It would take me some time to get good numbers for these. Here are some thoughts off the top of my head in the meantime.<br><br>1. Rate of enrollment at companies.</p><p>I think this averaged 25%. We had a couple of enthusiastic companies of around 50 people where we got 35-40% . But it wasn't uncommon to have more like 6%.<br><br>2. Average donation amount.<br>The £15,000 number includes company matches. The average monthly donation is £75 and the average company contribution is £25. Some companies offer very generous matching e.g. topping up donations by £50 regardless of donation size. Also bear in mind a small number of people are donating 10x more than the average.<br><br>I don't think it was lower when we were operating as a for-profit.<br><br>3. Dropoff rates<br>Dropoff rates are very low (less than 5% a year if you exclude people who leave the company). This is one of the biggest advantages of payroll giving.<br><br>Would be great to hear your account of the Swedish charity startup.</p>", "parentCommentId": "AJCbrvTC6PDdP9enc", "user": {"username": "imben"}}, {"_id": "CzsbJ2zuYepzdWRpq", "postedAt": "2022-12-26T10:55:44.288Z", "postId": "Wj2Z2NXDZXiysnRv5", "htmlBody": "<p>Glad to hear Jan.<br><br>That's right re: PMF. We were very open about what causes people could support but I think you could be right that leaning into e.g. climate change could have helped. My sense was that companies in the UK preferred other ways to contribute to these causes because:<br>1. Donating money feels less direct than interventions like recycling, not using plastic, vegetarian catering<br>2. HR didn't want to be seen to ask people to give their money away (this felt awkward for some)<br>3. There are activities which are more visible, feel-good and cheaper to signal support (e.g. charity fundraisers).</p>", "parentCommentId": "hStwaGM3Bcb8A4kub", "user": {"username": "imben"}}, {"_id": "yNjPssoqjsuw8crz2", "postedAt": "2022-12-26T10:56:51.759Z", "postId": "Wj2Z2NXDZXiysnRv5", "htmlBody": "<p>Thanks Craig - I'm glad to hear it. Like I said in the piece, I'm sure there are some opportunities and angles here but I think that's a decent summary.</p>", "parentCommentId": "fSi6HeEAppMrRJc6o", "user": {"username": "imben"}}, {"_id": "YJiFddnZ5BJsL8gYx", "postedAt": "2022-12-26T11:02:46.989Z", "postId": "Wj2Z2NXDZXiysnRv5", "htmlBody": "<p>Sorry I meant it as two separate things.<br><br>1. I'm not sure tech will help you fundraise more at work.<br>I spoke to one traditional payroll-giving fundraiser and he raised more for charity in a day than I did in several months. His method was to go round each table in an office, pitch them for 5 mins on the tax benefits of signing up and ask them to sign up on a piece of paper to give to a charity close to their hearts.&nbsp;<br><br>2. I'm not sure EA will help you fundraise more at work.<br>As in the above example, people are happy to give to charity regardless of the EA pitch. I think the EA pitch can help inspire some people and the fact that a chunk of people chose our recommended charities is encouraging but I don't think it's a gamechanger in the volume of donations.</p>", "parentCommentId": "CqxjefajJwyq8Wo6F", "user": {"username": "imben"}}]