[{"_id": "iMAAriyRaAs6fqXkk", "postedAt": "2023-01-01T07:48:46.204Z", "postId": "WJbnygdFQwEpBez4i", "htmlBody": "<p>In Exampleville (parasite example), if money is infinitely divisible, Kelly betting will save everyone with probability 1.</p><p>If bets must be an integral number of coins (and you start with only one coin, a very inconvenient world!), &nbsp;the strategy of \"bet the highest amount not more than Kelly, except always bet at least one coin and never bet more than necessary to reach 1024\", will save everyone with probability of approximately 0.038, or about 1 in 26, which is significantly better than 1 in 840.</p><p>In an intermediate scenario where gold coins are divisible into 100 smaller units for betting purposes, the probability for an analogous strategy will exceed 0.94.</p><p>While these strategies do involve betting higher than Kelly in the sole situation that you bet your last betting unit instead of giving up, in general it is fair to call them Kelly variants in contrast to \"always bet everything\".</p><p>The reason that Kelly variants are vastly superior to always betting everything is that the terms of your hypothetical are that \"You can play as many times as you like.\" It is difficult to conceive of why anyone would risk more than Kelly with this allowance (again with exceptions for your last betting unit).</p><p>You can salvage the example by saying that you are limited to 10 bets.</p><p>However, if you are limited to, for example, 20 bets, then the best strategy will be some intermediate that is riskier than Kelly but definitely less risky than \"always bet everything\".</p><p>My advice to readers is that betting more than Kelly is usually a terrible idea and if you think it's a good idea, you're probably making a mistake. The fact that a thought experiment, in an intelligently written article, went awry and gave an example where risk neutral betting is worse than Kelly variants when it was supposed to do the opposite, is a great example of the danger.</p><p>Nonetheless, I concede that for small and medium donors, betting 100% of your funds-to-be-donated on a 51% coin flip is fine if it is genuinely limited to your personal donation. However, the reason for this concession is not that I endorse risk-neutral betting for EA, but rather that the correct way to look at the bet in this scenario, when the funds are already \"to be donated\", is not as part of your personal bankroll, but rather as part of the bankroll of the cause for which you intend to donate them. Since any individual small or medium donor will in all likelihood represent less than 0.1% of the bankroll of the cause, such an individual betting such funds in isolation is in practice never exceeding Kelly betting.</p><p>I would still caution against 51% coin flips in a scenario where a large fraction of the EA community coordinates, spreads news of \"an opportunity\", etc., such that a large fraction of EA funds are risked on highly correlated 51% coin flips, for reasons which are hopefully quite obvious.</p><span><span class=\"mjpage mjpage__block\"></span></span>", "parentCommentId": null, "user": {"username": "JaredS"}}, {"_id": "uwSFoNsXgcJpTfjkm", "postedAt": "2023-01-01T14:57:43.536Z", "postId": "WJbnygdFQwEpBez4i", "htmlBody": "<p>I read the example as one in which the pharmacist's only offer is for a series of double-or-lose-all wagers. That is unlikely to be a real-world scenario, admittedly.</p>\n<p>Maybe a more realistic hypo would allow betting in tenths of a coin, but after each round, some small fraction of the population is killed by the parasite. Very conservative risk management always looks good if you have a practically infinite time to flip coins before you need to act.</p>\n", "parentCommentId": "iMAAriyRaAs6fqXkk", "user": {"username": "Jason"}}, {"_id": "yMDyqAQvF6DHmezot", "postedAt": "2023-01-01T15:30:20.310Z", "postId": "WJbnygdFQwEpBez4i", "htmlBody": "<p>I had the same reading, but then the thought experiment doesn't do anything to justify why double or nothing is better than Kelly betting. It's just better than... not doing anything, I guess, which isn't an impressive conclusion.</p>\n", "parentCommentId": "uwSFoNsXgcJpTfjkm", "user": {"username": "therealslimkt"}}, {"_id": "niQ8ELTpmJyunmgso", "postedAt": "2023-01-01T16:34:43.853Z", "postId": "WJbnygdFQwEpBez4i", "htmlBody": "<p>I think it's moderately effective as a simplified model that quickly demonstrates the premise in the title could be true in some scenarios.</p>\n<p>The basic Kelly bet hypo, as I understand it, also contains some assumptions that are uncommon in the real world (indefinite number of available rounds that result instantly). It's a closer match to many real-world scenarios, but I'd be open to an argument that there are practical scenarios are closer to OP's simplified model than the basic Kelly model. That's what I would be interested in hearing more from OP about.</p>\n", "parentCommentId": "yMDyqAQvF6DHmezot", "user": {"username": "Jason"}}, {"_id": "aBhpfQLsEfafsirPz", "postedAt": "2023-01-01T23:34:11.725Z", "postId": "WJbnygdFQwEpBez4i", "htmlBody": "<p>Thanks, it didn't occur to me that \"double your money\" in the example meant \"double your entire bankroll\" not \"double some amount that you selected to bet\". I think you're right that that's what the author meant, but I share Karthik's concern that you're then comparing \"bet everything\" to \"do nothing\".</p><p>I understand your concerns about the number of coin flips required. I loosely addressed it in my original comment, noting that even with a fixed limit of 20 bets in Exampleville (but with the ability to select bet size), the optimal approach will be clearly be less risky than \"always bet everything\".</p><p>Furthermore, it's important to consider that any scenario based on a limited number of bets is only applicable to the real world if the bets in the scenario will be the only positive-EV bets you can make in your entire life, or if the resource you are betting will never have any utility outside of the constrained scenario, or something very strange like that. In the real world, if you encounter a positive-EV bet denominated in USD that you are only able to make a limited number of times, even if you have a salient group of people to aid with the outcome of the bet, you need to consider that you may have other positive-EV bets in your life and you may be able to use the USD to help other people in the future if you manage risk more normally and don't blow your entire net worth on the first set of positive-EV bets that you encounter.</p><p>With respect, it is highly unusual to call full Kelly betting \"very conservative risk management\". Most people familiar with the concept consider full Kelly betting to be extremely aggressive.</p>", "parentCommentId": "uwSFoNsXgcJpTfjkm", "user": {"username": "JaredS"}}, {"_id": "jBetjq6bJb74kNnEA", "postedAt": "2023-01-02T01:18:55.496Z", "postId": "WJbnygdFQwEpBez4i", "htmlBody": "<p>I definitely wouldn't call full Kelly \"very conservative.\" My point was that in Exampleville and other scenarios with a capped best outcome, a very conservative strategy (e.g., 0.001 Kelly) is trivially superior to even merely conservative strategies if there is practically infinite time to flip coins before you need to act, and flipping coins is a costless activity. So the specification of the constraints is what makes the problem interesting (and realistic). The example shows that there are constraints where very agressive betting makes sense; the rest of the post needs to demonstrate how those scenarios -- or at least somewhat similar scenarios -- might occur in real life.</p><p>Bets don't have to be in USD or anything else that is a store of value. One could imagine that the \"currency\" was virologists in a rapidly-moving pandemic. You can put them on safe research that will save a modest number of lives or tell them to roll the dice on speculative research with a possible big payoff. You can't really \"store\" their labor for a possible better bet that may appear ten years down the road, or use it for something else very effectively.</p>", "parentCommentId": "aBhpfQLsEfafsirPz", "user": {"username": "Jason"}}]