[{"_id": "3nDEaJjZDPhuSwm7S", "postedAt": "2023-12-17T10:44:13.983Z", "postId": "WkspTijXT3avko6bD", "htmlBody": "<p>Nice post, Karthik! Nitpick, you may want to spell out the meaning of the acronyms MNC (multi-national corporation) and FDI (foreign direct investment) in their 1st instances.</p>", "parentCommentId": null, "user": {"username": "vascoamaralgrilo"}}, {"_id": "2ryx8Ai87KsfLRms4", "postedAt": "2023-12-17T10:46:04.945Z", "postId": "WkspTijXT3avko6bD", "htmlBody": "<p>Done, thanks!</p>\n", "parentCommentId": "3nDEaJjZDPhuSwm7S", "user": {"username": "therealslimkt"}}, {"_id": "6tcHuPF4omg8Squdb", "postedAt": "2023-12-18T14:55:53.086Z", "postId": "WkspTijXT3avko6bD", "htmlBody": "<p><strong>Executive summary:</strong> Firm dynamics are critical for economic growth in developing countries. Small, informal, and stagnant firms characterize poor countries, while market pressures ensure firm growth or exit in rich countries. Increasing market size and exposure to global markets can incentivize developing country firms to adopt better technologies and management practices.</p><p><strong>Key points:</strong></p><ol><li>Firms in developing countries are smaller, more informal, and stagnant compared to rich countries. Firm growth seems necessary for development.</li><li>Small market size and information friction limit firm growth by constraining demand and incentives to improve productivity. Better infrastructure and communication technology can help.</li><li>Importing management practices and technologies from abroad can directly boost productivity. Interacting with global markets also facilitates learning.</li><li>Industrial policy should focus on overcoming barriers to firm growth rather than entry, especially by expanding market access and encouraging technology adoption.</li><li>Firm dynamics provide a useful lens for conceiving of growth interventions in developing countries. Creative destruction through firm growth and exit seems critical.</li></ol><p>&nbsp;</p><p>&nbsp;</p><p><i>This comment was auto-generated by the EA Forum Team. Feel free to point out issues with this summary by replying to the comment, and</i><a href=\"https://forum.effectivealtruism.org/contact\"><i>&nbsp;<u>contact us</u></i></a><i> if you have feedback.</i></p>", "parentCommentId": null, "user": {"username": "SummaryBot"}}, {"_id": "SZRhAF4PEsjFCdRPj", "postedAt": "2023-12-31T23:31:01.628Z", "postId": "WkspTijXT3avko6bD", "htmlBody": "<p>Thank you so much for this valuable breakdown of interventions, Karthik. &nbsp;</p><p>I am an absolute layman but in an effort to respond to your call from an entrepreneurial eye, I tried to dig further into the management training intervention mentioned in the Bloom (2013) paper. While the impact of this intervention is meaningful if not impressive, as you have noted, it is unclear how to operationalize this at scale.</p><p>However, something I found interesting was that one of the main barriers for firms not already investing in these practices is informational. Specifically, their owners didn't know their relative quality compared to their peers. Given this, I was wondering if it might be possible to have a <a href=\"https://www.povertyactionlab.org/evaluation/opower-evaluating-impact-home-energy-reports-energy-conservation-united-states\">OPower</a>-like intervention which could provide information about their relative performance to their peer firms to motivate them to perform better. This seems especially plausible since the authors mentioned that the ROI of the training was about 130% in the first year and at least these large firms in the study didn't have financial barriers.</p><p>However, it is not clear to me what incentives the firms might have to share their quality information or if there are external sources for us to gather this information.</p>", "parentCommentId": null, "user": {"username": "leaf_in_the_wind"}}, {"_id": "QyPrCjtmzLDu9CBPw", "postedAt": "2024-01-02T10:58:45.808Z", "postId": "WkspTijXT3avko6bD", "htmlBody": "<p>I'm ambivalent about whether the barriers really are informational. When firms are surveyed, they claim to be much more advanced than they are, but my suspicion is that this is just a cope. They want to tell these World Bank surveyors that they are cool and advanced firms even if they know they are not. But it seems worth trying for sure.</p>\n<p>In the Bloom study, they mention that information spillovers across firms are very limited, because owners guarded this information. But there were still local spillovers (to firms in the same town), possibly because of communication between workers at different firms.</p>\n", "parentCommentId": "SZRhAF4PEsjFCdRPj", "user": {"username": "therealslimkt"}}]