[{"_id": "Nyrqsu8tfej57LvSb", "postedAt": "2023-02-28T00:42:51.066Z", "postId": "WKSwH4eyDiqhJMcrz", "htmlBody": "<p>Mostly seems like a good thing to me. The more chips needed to build AI are dependent on supply chains that run through countries that are amenable to regulating AI, the safer we are. To that end, routing as much of the needed chip supply chain through the US and EU seems most likely to create conditions where, if we impose regulations on AI, it will take years to build up supply chains that could circumvent those regulations.</p>", "parentCommentId": null, "user": {"username": "gworley3"}}, {"_id": "DLrfRcKzyhsjzTHoD", "postedAt": "2023-02-28T04:51:00.497Z", "postId": "WKSwH4eyDiqhJMcrz", "htmlBody": "<p>If I understand correctly, it sounds like you think the US and EU are more amenable to regulating AI than mainland China, Taiwan, or South Korea. Is that true? The US and some European countries are famous for valuing individual liberty, so on that basis I might guess they would be less amenable to regulation than East Asian countries. And this article seems to indicate that the Chinese government is already regulating AI more strictly than the US government is: https://www.theverge.com/2023/2/22/23609945/china-ai-chatbots-chatgpt-regulators-censorship</p>", "parentCommentId": "Nyrqsu8tfej57LvSb", "user": {"username": "CC"}}, {"_id": "LmM4rMnGkYxerxSem", "postedAt": "2023-02-28T16:55:52.350Z", "postId": "WKSwH4eyDiqhJMcrz", "htmlBody": "<p>I guess it depends on what kind of regulation you're thinking of.</p><p>While it's true that the US and EU value individual liberty highly, these countries are also quite motivated to regulate arms to maintain their technological lead over other countries, for example by regulating the export of cyber, nuclear, and conventional weapons and putting restrictions on who can be part of their supply chain. Smaller countries have been more willing to treat other countries as equals when it comes to arms and not worry about the possibility of attach since they feel little threat from each other if they don't share borders, whereas the US and EU have global concerns.</p><p>Based on this I expect the US and EU to be more likely to engage in the type of regulation that is relevant for controlling and limiting the development of TAI that poses a potential threat to humans, though you're right to point out that countries like China are more likely to impose regulations to control the near-term social harms of AI, whereas the US and EU are more likely to take a hands off approach.</p><p>So tl;dr: the US and EU will impose regulations where it matters to slow down the acceleration of progress so they can maintain control, but other countries might care more about social regulation that's comparatively less relevant for time to TAI.</p>", "parentCommentId": "DLrfRcKzyhsjzTHoD", "user": {"username": "gworley3"}}]