[{"_id": "vSLG2bh2eb5teRGzr", "postedAt": "2023-04-30T22:21:30.200Z", "postId": "WLok4YuJ4kfFpDRTi", "htmlBody": "<p>Thanks for sharing this! Curating. I'd be excited to see more essays that dive into the histories of how societies accomplished something analogous to what we might want to do — or attempt to answer questions like: \"What's something that seems ~normal to us that future people might think was a constant tragedy or unnecessary problem until it was ~solved? How do we solve this?\"<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnreffg5c5027pnb\"><sup><a href=\"#fnfg5c5027pnb\">[1]</a></sup></span></p><p>I also really appreciated the back-of-the-envelope calculations for backing e.g. claims of cost-effectiveness (see e.g. the estimate for lost wages in the <a href=\"https://forum.effectivealtruism.org/posts/WLok4YuJ4kfFpDRTi/first-clean-water-now-clean-air#Appendix__costs_and_benefits\">appendix on cost</a>s and benefits).&nbsp;</p><p>Assorted other notes and questions:&nbsp;</p><ol><li>I initially thought this would be about <a href=\"https://forum.effectivealtruism.org/topics/air-pollution\">air pollution</a>, which also <a href=\"https://forum.effectivealtruism.org/posts/Td4nkg4v2spDgyyKL/air-pollution-founders-pledge-cause-report\">seems like a very promising area for work</a>. If you think it's important to avoid the misconception, you could change the title.&nbsp;</li><li>Re: \"Part of the problem with making these facts salient might be that our disgust reactions aren’t firing in helpful ways: unclean water is visibly (and olfactorily) unclean, but bad air is perfectly disguised as clean air, and contextual cues are needed.&nbsp;So the first step is bringing the human costs of unclean air into the open.\" I thought the emphasis on the visual aspect was interesting! And it seems plausible, so I'd be interested in testing the hypothesis as if it's true, it seems like there's a potential for advocacy through things like visualizations. (I still remember e.g. the <a href=\"https://www.nytimes.com/interactive/2020/04/14/science/coronavirus-transmission-cough-6-feet-ar-ul.html\">NYT's 3D visual of particles spreading in a room (paywalled)</a>, and there's also <a href=\"https://www.nytimes.com/interactive/2021/02/26/science/reopen-schools-safety-ventilation.html\">this piece on school ventilation (also paywalled)</a>.<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefz55e7jvoyy9\"><sup><a href=\"#fnz55e7jvoyy9\">[2]</a></sup></span>)</li><li>I noticed that I was tempted to check how much I agreed with a bunch of claims in the essay — like the implication that 2%/year is a conservative likelihood for a pandemic as bad as COVID (\"Conservatively assuming a yearly likelihood of a pandemic at least as bad as Covid of 2%\").<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefv57f7cqtwng\"><sup><a href=\"#fnv57f7cqtwng\">[3]</a></sup></span>&nbsp;There are a lot of (sub)claims in the essay and I expect that I'd disagree with some if I started checking, but I mostly think this is due to a virtue of the post; the claims are <a href=\"https://forum.effectivealtruism.org/posts/oRx3LeqFdxN2JTANJ/epistemic-legibility\">easy to argue with</a>.&nbsp;</li><li>It seems useful to re-emphasize that improving air quality to slow (or stop) the spread of airborne diseases in richer countries seems to just make sense from those countries' perspectives, even setting aside benefits to the rest of the world. (This is quite compatible with the approach taken in <a href=\"https://forum.effectivealtruism.org/posts/DiGL5FuLgWActPBsf/how-much-should-governments-pay-to-prevent-catastrophes\">How much should governments pay to prevent catastrophes?</a>)</li><li>I appreciated this note:&nbsp;<ol><li>\"The <a href=\"https://ourworldindata.org/water-access\">story of spreading access to clean water</a> and sanitation is not over. Unsafe water causes <a href=\"https://ourworldindata.org/grapher/number-of-deaths-by-risk-factor\">more than a million</a> deaths a year — the 13th leading risk factor on one way of slicing things up. Almost all the deaths from unsafe water are <a href=\"https://ourworldindata.org/grapher/share-deaths-unsafe-water\">concentrated on poor countries</a>, especially sub-Saharan Africa and India. And a solid 25% of the world lacks access to <a href=\"https://ourworldindata.org/explorers/water-and-sanitation?tab=chart&amp;facet=none&amp;hideControls=true&amp;Resource=Drinking+water&amp;Level+of+Access=Safely+managed&amp;Residence=Total&amp;Relative+to+population=Share+of+population&amp;country=~OWID_WRL\">safely managed drinking water</a>. But full access to clean water is no longer encumbered by knowledge about how diseases spread, or how to properly treat water: we have the blueprints.\"</li></ol></li></ol><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnfg5c5027pnb\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnreffg5c5027pnb\">^</a></strong></sup></span><div class=\"footnote-content\"><p>A relevant part from the post:&nbsp;</p><blockquote><p>...the first step is bringing the human costs of unclean air into the open.</p><p>In the hopeful story, these costs become historical. Covid could be to airborne diseases like London’s cholera outbreaks and Great Stink were to waterborne diseases: a confluence of (i) “wow, as long as we know how to end this, we should”; and (ii) “huh, looks like we do increasingly know how to end this”.</p></blockquote></div></li><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnz55e7jvoyy9\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefz55e7jvoyy9\">^</a></strong></sup></span><div class=\"footnote-content\"><p>From the <a href=\"https://www.google.com/url?sa=i&amp;url=https%3A%2F%2Fwww.nytimes.com%2Finteractive%2F2021%2F02%2F26%2Fscience%2Freopen-schools-safety-ventilation.html&amp;psig=AOvVaw2SqwdHCkDG68hTX4rSwTYZ&amp;ust=1682979518679000&amp;source=images&amp;cd=vfe&amp;ved=0CBIQjhxqFwoTCNCA2bTR0v4CFQAAAAAdAAAAABAQ\">paywalled piece on school ventilation</a></p><figure class=\"image\"><img src=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/vSLG2bh2eb5teRGzr/okarvuhd6sazfqb7j6fv\"></figure></div></li><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnv57f7cqtwng\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefv57f7cqtwng\">^</a></strong></sup></span><div class=\"footnote-content\"><p>This doesn't sound crazy to me, but I want to check it for myself (or find a link that seems credible). I decided not to continue down the side-quest right now in the interest of time, but would be interested.</p></div></li></ol>", "parentCommentId": null, "user": {"username": "Lizka"}}, {"_id": "HhAC9AQRTdvJHWesg", "postedAt": "2023-05-01T12:14:37.316Z", "postId": "WLok4YuJ4kfFpDRTi", "htmlBody": "<p>I'm convinced, what needs to happen for institutions such as the US HHS or European Commission's dg <a href=\"https://ec.europa.eu/commission/presscorner/detail/en/ip_21_4672\">HERA</a> to take on these initiatives? To what extent are they already?</p><p>I would suspect that one of the bottlenecks may be cheap and well-formulated plans. Good arguments can go far in policy, but I imagine success requires going from \"We need UVC/Ventilation in every hospital\" to \"Try this specific pilot scheme to test efficacy\".</p><p>Which are the pandemic preparedness organizations working on getting wins around the world? If eg. Denmark adopts Far-UVC and it is a smash success, it becomes a lot easier to advocate for elsewhere. My impression is that many of the EA organizations doing advocacy, mostly are doing it at the broader level of \"we need better biosecurity\" rather than proposing and pushing for very specific plans. Is my impression correct, or am I just not sufficiently familiar with the field?</p>", "parentCommentId": null, "user": {"username": "MathiasKirkBonde"}}, {"_id": "tyPKyF8Y9aaT3E4kt", "postedAt": "2023-05-02T15:02:47.939Z", "postId": "WLok4YuJ4kfFpDRTi", "htmlBody": "<p>Great post! I also believe in the need to get our air clean ASAP.&nbsp;</p><p>Self-promotion: check out SecureBio's <a href=\"https://securebio.org/far-uvc/\">work</a> on far-UVC. We will hopefully publish more write-ups soon.&nbsp;</p><p>Minor point: In an informal survey of experts in the field, most people preferred the term germicidal UV (GUV) over Ultraviolet germicidal irradiation (UVGI). I also think that UVGI is a bit unwieldy, and \"irradiation\" sounds scary (although in Rethink Priorities' survey on this, the name didn't seem to matter much for people's impressions of the technology).&nbsp;</p><p>Interesting observation: With indoor air cleaners, there doesn't seem to be any real-world epidemiological evidence of whether they reduce infection rates (of course, on priors, I would expect them to). At least I didn't find any studies when I looked into it a few months ago, which surprised me. Such data also doesn't yet exist for far-UVC, but there is a <a href=\"https://docs.google.com/spreadsheets/d/1SHZgz8BOcz5xwKxEoXYv8AdCnHeliUZ6q-d4QMAlZ10/edit?usp=sharing\">bunch</a> on conventional upper-room GUV (most of it decades old, though).</p><p>Good news on the regulation side: <a href=\"https://www.ashrae.org/about/news/2022/ashrae-commits-to-developing-an-iaq-pathogen-mitigation-standard\">ASHRAE Commits to Developing an IAQ Pathogen Mitigation Standard</a>. I'll be curious to see what comes out of it.&nbsp;</p><p>Also, I have a standing invitation for people to contact me if they are interested in working on GUV or far-UVC specifically and want to know what they could do!&nbsp;</p>", "parentCommentId": null, "user": {"username": "MaxG"}}, {"_id": "7mKJDscvjYGHnDp33", "postedAt": "2023-05-02T16:43:23.246Z", "postId": "WLok4YuJ4kfFpDRTi", "htmlBody": "<p>Great post. I understand indoor air quality is the focus of the piece but if we're looking holistically at clean air we should also consider the significant health costs of air pollution outdoors. Patrick Collison has a great overview: https://patrickcollison.com/pollution</p>", "parentCommentId": null, "user": {"username": "BenSchifman"}}, {"_id": "uDpSWfuGwQkxNKDkN", "postedAt": "2023-05-03T19:22:23.316Z", "postId": "WLok4YuJ4kfFpDRTi", "htmlBody": "<p>Thanks so much for the kind words about our report! We actually published an updated version just an hour ago--you can see the new report <a href=\"https://forum.effectivealtruism.org/out?url=https%3A%2F%2Fdrive.google.com%2Ffile%2Fd%2F1QKusCnLzUs041nIuiq6nMxSIRcXaGiKq%2Fview\">here</a> and the forum announcement with a summary <a href=\"https://forum.effectivealtruism.org/posts/SsZ4AqmBdgrfN6hfz/air-safety-to-combat-global-catastrophic-biorisks-revised\">here</a>. (Small note on organizational affiliation: the report is a collaboration between 1Day Sooner and Rethink Priorities.)</p>", "parentCommentId": null, "user": {"username": "Gavriel Kleinwaks"}}, {"_id": "2oKoA9FiorwFMkxxg", "postedAt": "2023-05-03T19:35:21.057Z", "postId": "WLok4YuJ4kfFpDRTi", "htmlBody": "<p>Great questions--my colleagues and I (at 1Day Sooner) have actually spoken to representatives from HERA and BARDA (which is under HHS) who are very interested in the potential of far-UVC. What we've seen is that policymakers are genuinely concerned about the effectiveness and safety of widespread far-UVC use, and want to see greater research in the field, without necessarily being able to guarantee that funding themselves. We, and other organizations, have been advocating for and trying to organize research and pilot programs. (I don't have a good sense of the international advocacy field around pandemic prep, though; most of our partners are based in the US.) I think that generally advocacy has actually been fairly specific, or at least been targeted at understanding specific concerns from policymakers, but it's not surprising that this doesn't necessarily come across at a glance. The more detailed and specific the plan, the more technical it gets and the more it's being communicated person-to-person or through gigantic reports. <a href=\"https://forum.effectivealtruism.org/posts/SsZ4AqmBdgrfN6hfz/air-safety-to-combat-global-catastrophic-biorisks-revised\">Our report</a> does contain specific recommendations in the \"Bottlenecks and Funding Opportunities\" section if you'd like to check it out!</p>", "parentCommentId": "HhAC9AQRTdvJHWesg", "user": {"username": "Gavriel Kleinwaks"}}, {"_id": "pjCicEZgEnWcDksQE", "postedAt": "2023-05-04T07:28:00.290Z", "postId": "WLok4YuJ4kfFpDRTi", "htmlBody": "<p>Excellent post, and great work on the research report!<br><br>From a narrative perspective I think the analogy between Clean Water and Clean Air is great. However, I'm wondering if from a R&amp;D and implementation perspective a more fitting analogy would be clean cooking fuel, heating or solar power (which you do mention). Clean water systems need large investment in infrastructure and government implementation upfront, as much as they need more technological advancement, since Clean Water is a public good. Indoor Clean Air, or at least the solutions you described above, don't <strong>need </strong>large infrastructure or government investment. The quality of the air in my house or office is a private good. The private market can develop the R&amp;D and market directly to consumers, without the need for the government to step in, as long as there's consumer interest.&nbsp;<br><br>The fact that the TOC for Clean Air Indoors doesn't <strong>need </strong>to go through government makes me more optimistic about success (although of course if there are government standards and gov R&amp;D spending, it will go faster).<br><br>On the other hand, perhaps Indoor Clean Air is more similar to lead paint regulation, where the individual consumer isn't aware enough of the dangers and benefits, even though theoretically it's more lucrative to sell safe paint than poisonous paint.</p>", "parentCommentId": null, "user": {"username": "ezrah"}}, {"_id": "LkLtoKRvbSijvAewW", "postedAt": "2023-05-08T03:41:14.632Z", "postId": "WLok4YuJ4kfFpDRTi", "htmlBody": "<p>A couple of thoughts:<br>-The solar analogy might need to be caveated - solar has been massively deployed because it outcompeted another energy source. Clean air is not in demand and is therefore quite different.</p><p>-One way to make people have clean air demand is for them to notice how much better their life becomes after they have clean air. I think there is a better setting for making people realize this than hospitals, offices and even schools: Pre-school. As a parent, kids get sick at an absurd rate in pre-school and it places great stress on the family. Also, it would be super easy to just oneself set up a pre-school with best-in-class air quality in a neighborhood with resourceful parents. These would then spread the word to other parents of how seldom the kids are sick and you can actually create a large business of pre-schools based on having kids that are much less sick.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Ulrik Horn"}}, {"_id": "kGdkA9mHbMfD8sniN", "postedAt": "2023-05-09T16:26:24.017Z", "postId": "WLok4YuJ4kfFpDRTi", "htmlBody": "<p>We (the biosecurity team at Convergent Research) also have curated a number of specific, tarmac-ready far-UVC projects with teams and timelines attached, that range from a few 100k to a few million and address various bottlenecks in far-UVC adoption. We've got a whole catalogue of 1-pagers if any funders reading this are interested :P&nbsp;</p><p>I think I have a slightly different read on USGOV's interest in far-UVC than Gavriel does. ~Every agency we've spoken to so far has gone \"cool, but not our problem,\" which I understand to mean that &nbsp;far-UVC is not being prioritized even within the already-deprioritized category of pandemic funding. Hell, even NIAID isn't interested. This might change, of course...but no real idea of what might be a turning point. That being said, the CDC doesn't seem actively unfriendly to the tech, so there is hope?</p>", "parentCommentId": "2oKoA9FiorwFMkxxg", "user": {"username": "vbelenky"}}, {"_id": "Qxv8gFywiersAxuXs", "postedAt": "2023-05-10T15:05:55.687Z", "postId": "WLok4YuJ4kfFpDRTi", "htmlBody": "<p>Hi! I'm a water resources engineer by day, so this post caught my eye. There are tons of parallels to be drawn here between water treatment and air treatment, and I think you've done a great job outlining the scale of potential benefits available to us. However, some key differences arise in how we interact with air and with water in our daily lives. The water supply chain is cordoned off from other environments and the larger global supply of water, meaning we can take small volumes relative to the total supply and apply targeted treatment techniques to improve the quality of the consumed volume. With regards to air quality, much of our consumption is still directly from the global supply (the atmosphere). While we do have systems in place to filter and treat this air indoors, outdoor air quality is a much larger beast to tackle, and it may be more efficient to opt for intervention at point of consumption, in the form of masks/aerators, than to attempt to treat the global air volume. Turning to pathogenic risk, I think you've correctly identified an area of great potential improvement, since most airborne pathogenic transmission happens indoors, where we could conceivably intervene via existing AC / air supply systems.&nbsp;<br><br>Both of these measures (Clean indoor air / clean drinking water) are really just proxies for how clean our bodies are, (both in terms of pathogen exposure but also of pollutants). I wonder what other tools you could include in a \"clean body\" framework? My first thought was about the potential for blood-donation to filter out bio-accumulated microplastics from the body (reducing the concentration as newly made blood does not contain any), but I'm sure there are other examples.<br><br>Great post, looking forward to more!&nbsp;</p>", "parentCommentId": null, "user": {"username": "Connor Tabarrok"}}, {"_id": "LqmvTjFmyKiBQWXdi", "postedAt": "2023-05-18T18:51:18.763Z", "postId": "WLok4YuJ4kfFpDRTi", "htmlBody": "<p>Has anyone thought about the effects of air pollution on animal welfare?</p>", "parentCommentId": null, "user": {"username": "Michael_Wiebe"}}, {"_id": "RNENQLJegmfCbvtgt", "postedAt": "2023-06-01T13:00:35.673Z", "postId": "WLok4YuJ4kfFpDRTi", "htmlBody": "<p>Love this idea! Visible effects, interested consumers</p>\n", "parentCommentId": "LkLtoKRvbSijvAewW", "user": {"username": "SiebeRozendal"}}, {"_id": "Mb3xkMqiZ2C4fEp9h", "postedAt": "2023-06-02T05:52:01.276Z", "postId": "WLok4YuJ4kfFpDRTi", "htmlBody": "<p><strong>Desperate </strong>consumers - I am talking from first hand experience, haha! I'll get in touch to see if you want to collaborate after my current project is handed over or winds down. That is, unless I find something else to do. Feel free to reach out to me anytime for an update.</p>", "parentCommentId": "RNENQLJegmfCbvtgt", "user": {"username": "Ulrik Horn"}}, {"_id": "QunEHazXmS5LrkrAJ", "postedAt": "2023-06-23T15:22:03.268Z", "postId": "WLok4YuJ4kfFpDRTi", "htmlBody": "<p>Intesesting article and framing, thank you. I've only just got round to reading it but have a few questions.</p>\n<p>First, by clean air, do you mean low CO2 or no pathogens? These seem to have quite different solutions and benefits but the article doesn't cleanly distinguish. Most of the solutions (excepting ventilation) do not reduce CO2 levels, and hence would not give the benefits to cognition etc that ventilation do. Furthermore, monitoring CO2 levels won't tell you much because, once you implement these solutions, the link between CO2 levels and pathogen levels is broken.</p>\n<p>Second, I'm not convinced the evidence supports the size of benefit you suggest here: near-elimination of respiratory illness through clean air alone. <a href=\"https://forum.effectivealtruism.org/posts/SsZ4AqmBdgrfN6hfz/air-safety-to-combat-global-catastrophic-biorisks-revised#Top_line_summary\">The updated 1DaySooner report</a> (which I appreciate wasn't published when you wrote this piece) estimates reducing transmission by 30--75%. While the mid-to-top-end of that range might remove flu epidemics (R0 up to around 2) as a threat, this seems less likely for all respiratory illnesses such as endemic coronaviruses (R0 around 10) or even original, Wuhan SARS-CoV-2 (R0 at least 3, likely 4 or higher). It certainly wouldn't be enough for measles (R0 15--20). Indoor air cleaning still seems valuable but I wouldn't want to oversell it as a silver bullet, rather than one line in multi-factorial pathogen defence.</p>\n<p>Finally, I was wondering if there was a reason you didn't mention <a href=\"https://www.gov.uk/government/publications/ventilation-approved-document-f\">the update to UK building regulations to include indoor air quality (published 2021)</a>. These look really promosing to me, although I'm not an expert in either the regulatary or technical side, so would appreciate further commentary!</p>\n", "parentCommentId": null, "user": {"username": "jooke"}}]