[{"_id": "wXynYGmHGFy89wN59", "postedAt": "2014-12-12T02:28:01.844Z", "postId": "WoQ8pub55TNzCjJb8", "htmlBody": "<p>What's the situation on US tax-deductibility?</p>\n<p>EDIT: answered my own question by reading the sidebar carefully; USA folks can donate through the Tides Foundation (instructions <a href=\"https://centreforeffectivealtruism.org/donations/donate-to-the-centre-for-effective-altruism-and-its-projects-us/\">here</a>). Is there any way to get these donations listed on the Causevox page, though?</p>\n", "parentCommentId": null, "user": {"username": "Ben_Kuhn"}}, {"_id": "y4qWpqQZhrj5Hcdj7", "postedAt": "2014-12-12T04:39:03.217Z", "postId": "WoQ8pub55TNzCjJb8", "htmlBody": "<p>Thanks for the updates. Small question: Why hold the EA summits simultaneously? Total reverberations of discussion might be higher if the summits were held separately, giving time for people to hear about the summits that they didn't attend without being overloaded.</p>\n", "parentCommentId": null, "user": {"username": "Brian_Tomasik"}}, {"_id": "BiLGM9dQGgMWuHK82", "postedAt": "2014-12-12T11:39:47.568Z", "postId": "WoQ8pub55TNzCjJb8", "htmlBody": "<p>Hi Ben,\nWe can add your donations to the CauseVox page manually.  Just let Rob or me know. Thanks, and let me know if you have any additional questions.  </p>\n", "parentCommentId": "wXynYGmHGFy89wN59", "user": {"username": "Niel_Bowerman"}}, {"_id": "pQqXMabhuYFau8obd", "postedAt": "2014-12-12T11:54:36.493Z", "postId": "WoQ8pub55TNzCjJb8", "htmlBody": "<p>This is an interesting argument and one that I'd like to think about some more.  I'll let Kerry respond in more detail as he is leading on EA Global, but IIRC the main reasons we had in mind were around fostering more of a sense of community, excitement, and illustrating the global scale of the movement.  It might also make it easier to use the events to promote the books on EA that are coming out if they are near one of the book launches.  Finally, having them simultaneously would make it easier to get pre- and post-event media coverage, especially if we have tie-ins with the books.  I know that these sorts of benefits are hard to define, but I think that having the events simultaneously will help foster a sense, both within the movement and among the public, that EA is a rapidly growing, exciting and influential global movement, which I think could be quite helpful to us.  </p>\n", "parentCommentId": "y4qWpqQZhrj5Hcdj7", "user": {"username": "Niel_Bowerman"}}, {"_id": "P6bJqSeJDWCHEkwqN", "postedAt": "2014-12-12T14:11:00.591Z", "postId": "WoQ8pub55TNzCjJb8", "htmlBody": "<p>Hey Brian. This is an interesting idea which I've thought about a bit. Here are a few considerations in favor of holding it simultaneously:</p>\n<p>1) Stronger feeling of community: By hosting it simultaneously we can do things to make us feel like one community. For example, we can livestream what's going on in other locations, have EAs ask questions of the speak live on Twitter etc.</p>\n<p>2) Better movement PR: One of the things I noticed in coming up with the idea is that non-EAs instantly get the wow factor of holding multiple events simultaneously all over the world. It helps give EA a globa This would be lost by holding multiple events at different times. Since this event helps attract new EAs, I think the PR matters a good deal.</p>\n<p>3) Less organizational attention devoted to EA Global: Holding the events in sequence means that EA Global steals attentional resources for longer. Since staff attention is one of our scarcest resources, I think it would be good to finish the event all in one weekend and then devote attention elsewhere.</p>\n<p>That said, I'm not confident that simultaneously holding the events is the best option, so I'd be happy to have someone convince me otherwise.</p>\n", "parentCommentId": "y4qWpqQZhrj5Hcdj7", "user": {"username": "Kerry_Vaughan"}}, {"_id": "k5jTzkBMmPcko9B5c", "postedAt": "2014-12-12T21:40:44.130Z", "postId": "WoQ8pub55TNzCjJb8", "htmlBody": "<p>Six questions:</p>\n<p>1.) What will EA Outreach do, if anything, to coordinate with other people working on marketing EA?  Will EA Outreach be transparent, or aim to produce research that is of value to typical EAs?  Will there be any attempt to bring forward some &quot;lessons learned&quot;?  While I know the Global Priorities Project has done a lot, I feel like there has been incredibly little that an EA can personally use and learn from (though I understand that may not have been the point).</p>\n<p>2.) What, if anything, has EA Outreach learned from those who have already done outreach, such as CEA's own orgs, or others?  Didn't, for example, GWWC already try VIP outreach?</p>\n<p>3.) I like the program plan and a lot of individual projects, but it feels a bit like throwing everything but the kitchen sink, very loosely fit together by theme.  There doesn't seem to be that much rationale for why some projects are taking place and others aren't.  While it's good to try many things to learn lots fast, it's also good to focus on a few things to do them well.  What thought has CEA given to this tradeoff?</p>\n<p>4.) Why is EA Ventures included in this?  It doesn't even seem thematically related.</p>\n<p>5.) Is there any danger in CEA increasing how central it is to the movement?  We certainly do want more resources and CEA seems to be in a very good place to execute these projects in a way that no one else can.  But it would be bad for CEA to become a single point of failure for the movement.  Has there been any spot in spinning off more orgs out of the CEA umbrella?  Any thought in putting some of these projects on hold and use EA Ventures to try to get some of them out instead?</p>\n<p>6.) How does CEA know that Will's viral Ice Bucket articles generated £10K for SCI?  What is being done, if anything, to track the impact of these outreach projects?  Even if we can't understand well the impact of outreach overall, it would be nice to be able to compare projects against each other.</p>\n", "parentCommentId": null, "user": {"username": "Peter_Hurford"}}, {"_id": "xgxghrwQz25SXHThG", "postedAt": "2014-12-13T10:36:10.172Z", "postId": "WoQ8pub55TNzCjJb8", "htmlBody": "<p>Excellent questions and points.</p>\n<blockquote>\n<p>2.) What, if anything, has EA Outreach learned from those who have already done outreach, such as CEA's own orgs, or others? Didn't, for example, GWWC already try VIP outreach?</p>\n</blockquote>\n<p>It'd be valuable to write this up for others to learn on.</p>\n<blockquote>\n<p>4.) Why is EA Ventures included in this? It doesn't even seem thematically related.</p>\n</blockquote>\n<p>I guess it's because it doesn't fit anywhere else, and it has to fit under some CEA branch.</p>\n<blockquote>\n<p>5.) Is there any danger in CEA increasing how central it is to the movement? We certainly do want more resources and CEA seems to be in a very good place to execute these projects in a way that no one else can. But it would be bad for CEA to become a single point of failure for the movement. Has there been any spot in spinning off more orgs out of the CEA umbrella? Any thought in putting some of these projects on hold and use EA Ventures to try to get some of them out instead?</p>\n</blockquote>\n<p>This is a very good point, and I agree there's a danger in this. It sounds as if CEA is taking over the EA Summit from another EA organisation (Leverage Research) which could be an example, although if the Summit/EA Global would not have happened otherwise it makes sense. The idea of using EA Ventures to fund projects we want to see is a very good one.</p>\n", "parentCommentId": "k5jTzkBMmPcko9B5c", "user": {"username": "jayd"}}, {"_id": "5ttgdxLbergWRwhZP", "postedAt": "2014-12-13T10:36:54.660Z", "postId": "WoQ8pub55TNzCjJb8", "htmlBody": "<p>Can people donate specifically to provide EA Ventures seed funding and if so how?</p>\n", "parentCommentId": null, "user": {"username": "jayd"}}, {"_id": "Nnp2aRZqYeZk28a48", "postedAt": "2014-12-13T11:56:32.392Z", "postId": "WoQ8pub55TNzCjJb8", "htmlBody": "<p>Hi Peter,</p>\n<p>Great questions, thanks for asking them. I'm going to respond to your different questions in different comments as my response is too long to be accepted as a single comment.   </p>\n", "parentCommentId": "k5jTzkBMmPcko9B5c", "user": {"username": "Niel_Bowerman"}}, {"_id": "ignjtwwmHrXTQFWCN", "postedAt": "2014-12-13T11:57:10.656Z", "postId": "WoQ8pub55TNzCjJb8", "htmlBody": "<p>On question one:</p>\n<blockquote>\n<p>1.) What will EA Outreach do, if anything, to coordinate with other people working on marketing EA? Will EA Outreach be transparent, or aim to produce research that is of value to typical EAs? Will there be any attempt to bring forward some &quot;lessons learned&quot;? While I know the Global Priorities Project has done a lot, I feel like there has been incredibly little that an EA can personally use and learn from (though I understand that may not have been the point).</p>\n</blockquote>\n<p>1a.  We would like to co-ordinate and collaborate with anyone who is working on marketing EA.  Currently the only person we know who is working on this full time is Tyler Alterman from Leverage, and we work so closely with him that he practically feels like part of the team!  We will be collaborating closely with LYCS, not least on Peter Singer's book, and we talk with Giving What We Can on a daily basis.  We are teaming up with 80,000 Hours on the EA Fellow's Programme, and we have been working with CEA to create its own branding that will make it more relevant to the movement as an incubator.  We've been talking with Tom Ash and looking for ways that we can best collaborate with effectivealtruismhub.org, which hosts many .impact projects.  As I mentioned in the plan we have been helping advise FHI on their efforts to make the discussion on AI in the media more accurate.  We have also been advising the Norwegian EAs on media strategy, and they've been helping us think through movement branding.  We've been talking with some of the German EAs about their plans to create &quot;superteams&quot; to work on new EA projects.  We've also been collaborating with the Australian EAs on the EA Forum, and we are currently in conversation with them about their hosting of EA Global.  If there are other groups that would like to collaborate with us, I'd love to hear from them! </p>\n<p>1b.  I won't speak for the Global Priorities Project (GPP) as I haven't been working on that project since August and so I'm not so up to date on their current plans.  It is worth noting though that Seb Farquhar has been hired from McKinsey to join GPP as its director and project manager, so their plans and outputs may change substantially from January when he starts.  </p>\n<p>On EA Outreach though, we do indeed plan to write up some of our lessons learned.  We have a draft post ready on our learnings from engaging with the media in 2014 that we hope to post soon.  You have probably seen my post on what I learned from engaging in policy work earlier this year: <a href=\"http://effective-altruism.com/ea/7e/good_policy_ideas_that_wont_happen_yet/\">http://effective-altruism.com/ea/7e/good_policy_ideas_that_wont_happen_yet/</a>    Writing up these learnings takes quite a lot of time and so we probably won't be able to share everything we learn, but we try to pass on any particularly useful information to teams that might benefit from it.  We love getting questions from different projects and people on their outreach strategies, and I really enjoy talking with all of these projects and helping them think through their work, so if there are people reading this who would be interested in talking through some questions about their EA project then please do get in touch. </p>\n", "parentCommentId": "Nnp2aRZqYeZk28a48", "user": {"username": "Niel_Bowerman"}}, {"_id": "s58k68AgMtTq9ypRr", "postedAt": "2014-12-13T11:57:26.295Z", "postId": "WoQ8pub55TNzCjJb8", "htmlBody": "<p>On question two:</p>\n<blockquote>\n<p>2.) What, if anything, has EA Outreach learned from those who have already done outreach, such as CEA's own orgs, or others? Didn't, for example, GWWC already try VIP outreach?</p>\n</blockquote>\n<p>2a.  We've tried to talk with everyone who we think might have useful insights or learnings we might be able to use on EA Outreach.  Kerry Vaughan in particular has been doing a lot of this (as he is coordinating the movement-facing side of our work) and he is regularly Skyping and talking with half a dozen people a day to ask for advice and feedback on things that he is working on.  I won't bore you with a long list of everyone we are currently getting advice from, but I can assure you that it is extensive!</p>\n<p>2b.  On your questions about learning within CEA, I am fortunate enough to have led on outreach for Giving What We Can, VIP engagement for CEA, and outreach for 80,000 Hours in previous roles I've had at CEA, so much of the project plan (<a href=\"http://bit.ly/EAO2015\">http://bit.ly/EAO2015</a>) is built off the back of things I felt I learned while in those roles, and I regularly discuss strategy and learnings with the current teams working on those projects.  Finally, at CEA we have 'training lunches' which all the teams are invited to, in which someone presents on a topic that they have experience with, or a topic that they have recently been studying, and the group gets to discuss and give feedback.  We regularly have these on outreach-related topics, and in fact on Wednesday Steph Crampin from GWWC will be giving one on what she has learned from the marketing diploma that she is in the final stages of getting. </p>\n", "parentCommentId": "Nnp2aRZqYeZk28a48", "user": {"username": "Niel_Bowerman"}}, {"_id": "muWyCBJ3eboxphyMs", "postedAt": "2014-12-13T11:59:25.979Z", "postId": "WoQ8pub55TNzCjJb8", "htmlBody": "<p>On question three (the forum keeps renumbering my answers to I'm writing the numbers in text):  </p>\n<blockquote>\n<p>3.) I like the program plan and a lot of individual projects, but it feels a bit like throwing everything but the kitchen sink, very loosely fit together by theme. There doesn't seem to be that much rationale for why some projects are taking place and others aren't. While it's good to try many things to learn lots fast, it's also good to focus on a few things to do them well. What thought has CEA given to this tradeoff?</p>\n</blockquote>\n<p>I agree with you that there are a lot of different projects here (and the list used to be much much longer before we had to cut it down to what was more realistic to achieve!)  The strategy that we tend to use at CEA is to experiment on a number of different things when we move into a new area and then scale up the things that work well.  For example when we created 80,000 Hours we experimented with making it a campaigning movement, an online app, a community, and a lecture series, before settling on the current model of it being a service to help people choose their careers.  Without this experimentation it is easy to commit too many resources to sub-optimal projects that we end up pivoting away from.  This is why this list does look long, and why we expect it will narrow at the end of this year, and possibly even during the year if one or more of the projects seem particularly bad on closer inspection. </p>\n<p>It is also notable that we have also taken one bigger bet, in the books that we are publishing.  In including writing time, William MacAskill's book and marketing campaign will have at least one person-year of time put into it.  This is because we were presented with a particularly good publishing deal - pretty much the best deal that it is possible to get as a non-celebrity first-time author.</p>\n", "parentCommentId": "Nnp2aRZqYeZk28a48", "user": {"username": "Niel_Bowerman"}}, {"_id": "mGdKRAgKcrJToZWC7", "postedAt": "2014-12-13T12:00:46.905Z", "postId": "WoQ8pub55TNzCjJb8", "htmlBody": "<p>On question four:</p>\n<blockquote>\n<p>4.) Why is EA Ventures included in this? It doesn't even seem thematically related.</p>\n</blockquote>\n<p>There are a number of ways of interpreting your question on EA Ventures.  The benefits of the project (increased coordination, less matching costs for donors and projects, incentives for and ease of creating new EA projects, etc.) are outlined here: <a href=\"http://bit.ly/EAVentures\">http://bit.ly/EAVentures</a> (note that the intended audience of this document is donors, and so it doesn't stress the benefits to entrepreneurs as much as it could)</p>\n<p>I agree that EA Ventures is less thematically relevant to the rest of the programme than many of the other projects, but I think it is unfair to say that it is not thematically related: this project is about making it easier for EAs to get the funding they need to start new projects, and it is in the plan in the context of  getting EAs access to the skills and resources they need to have impact. </p>\n<p>The idea was suggested by a number of different EAs in a number of different forums, and multiple people asked whether we were interested in leading on the project as no-one else seemed to want to take the lead on it.  We mentioned it to a couple of donors, who seemed pretty interested in the idea, and after writing it up in more detail and discussing its merits relative to the other things we would have been spending the time on, we decided to take it on. </p>\n", "parentCommentId": "Nnp2aRZqYeZk28a48", "user": {"username": "Niel_Bowerman"}}, {"_id": "FWWBrFq3qGpumXgXJ", "postedAt": "2014-12-13T12:01:31.003Z", "postId": "WoQ8pub55TNzCjJb8", "htmlBody": "<p>On question five: </p>\n<blockquote>\n<p>5.) Is there any danger in CEA increasing how central it is to the movement? We certainly do want more resources and CEA seems to be in a very good place to execute these projects in a way that no one else can. But it would be bad for CEA to become a single point of failure for the movement. Has there been any spot in spinning off more orgs out of the CEA umbrella? Any thought in putting some of these projects on hold and use EA Ventures to try to get some of them out instead?</p>\n</blockquote>\n<p>I agree with you that CEA is becoming an increasingly key node in the EA movement, and that this is a potential failure mode, and it is one that we have been taking steps to address. \nWe are currently in the process of finalising a governance reform package within CEA that would turn CEA into more of an incubator, which will make it easier for CEA to start and end projects.  We have already successfully spun two projects out of CEA (Animal Charity Evaluators and Life You Can Save), and these reforms would also potentially make it easier for projects to spin out of CEA should they wish to.  I won't go into the details of these reforms publicly until we are able to finalise the package and discuss it with the trustees, but we are certainly taking steps to make CEA more resilient, adaptable, and ultimately less likely to be a failure mode within the movement. </p>\n<p>As for whether EA Ventures should try to start up some of these initiatives instead, I see CEA and EA Ventures as occupying two different roles.  EA Ventures is a project to make it easier for projects to get financing, whereas CEA is an incubator of new projects.  EA Ventures primarily provides funding, whereas CEA provides: office space, book-keeping, hr and logistics support, fundraising support, legal support, charity status, and mentoring and strategy advice.  It would take a considerable amount of setup time for EA Ventures to be able to provide all of these services, and I don't think this would be the best use of resources.  Similarly, projects at CEA are always welcome to spin-off from CEA and source these services independently, but they find it beneficial enough that they choose not to do this as it allows them to focus purely on their project and not on non-profit administration which is largely handled by CEA.  For this reason I would like to continue using CEA's incubation services for the projects that I am starting and working on, at least until they reach sufficient scale, because it allows me to focus my attention directly on the project itself.</p>\n", "parentCommentId": "Nnp2aRZqYeZk28a48", "user": {"username": "Niel_Bowerman"}}, {"_id": "y9wpwzv2LWab9s2BJ", "postedAt": "2014-12-13T12:02:03.075Z", "postId": "WoQ8pub55TNzCjJb8", "htmlBody": "<p>On question six:  </p>\n<blockquote>\n<p>6.) How does CEA know that Will's viral Ice Bucket articles generated £10K for SCI? What is being done, if anything, to track the impact of these outreach projects? Even if we can't understand well the impact of outreach overall, it would be nice to be able to compare projects against each other.</p>\n</blockquote>\n<p>We got our money moved to SCI data from SCI.  They ask where the donations came from and they saw a large spike in donations citing online media at the time when I did a national radio segment with Elie from GiveWell on why to donate to SCI rather than ALS in the ice bucket challenge, which was the reproduced on BBC online and in the Financial Times.  They also asked a few of the donors and they said that our articles were the cause. </p>\n<p>I agree with you that it would be nice to be able to compare the impact of the different projects.  The impact metrics we are tracking for each of the projects are different in places, but we try and measure similar metrics across the projects such as direct money moved wherever we can.  We have also been attempting to monitor whenever one of the projects leads to a new Giving What We Can member, and GiveWell have been giving us numbers on new traffic to GiveWell as a result of our media (we will set this up for other projects as well once they reach scale).  For example multiple articles we have placed in the media have driven 1000s of new visitors to GiveWell (Approximately 1 in every 200 new visitors donates to GiveWell and the average donations size is $1000, though I imagine the visitors we sent over were substantially less likely than average to donate large amounts).  We hope to use direct money moved as one indicator of the impact of each project, though this is quite an imprecise metric that doesn't capture many of the other benefits of the projects, so we will be monitoring others as well such as the number of people who sign up to an EA org as a result of these projects, the number of people who become actively involved in the movement because of these projects, etc. </p>\n<p>I hope this answers some of your questions, and feel free to get in touch if you have further questions. </p>\n", "parentCommentId": "Nnp2aRZqYeZk28a48", "user": {"username": "Niel_Bowerman"}}, {"_id": "rxppDsyeKA7uKgNjK", "postedAt": "2014-12-13T12:22:38.369Z", "postId": "WoQ8pub55TNzCjJb8", "htmlBody": "<p>It may also be worth mentioning that if anyone would like to track what EA Outreach are doing in more detail, we send out monthly updates on our activities which you can sign up for here: <a href=\"https://groups.google.com/forum/#!forum/ea-outreach-updates\">https://groups.google.com/forum/#!forum/ea-outreach-updates</a></p>\n", "parentCommentId": "Nnp2aRZqYeZk28a48", "user": {"username": "Niel_Bowerman"}}, {"_id": "n7h4LpKwSii95xL8T", "postedAt": "2014-12-13T13:08:24.223Z", "postId": "WoQ8pub55TNzCjJb8", "htmlBody": "<p>Yes, I believe so.  Just contact <a href=\"mailto:kerry@centreforeffectivealtruism.org\">kerry@centreforeffectivealtruism.org</a> and he can let you know the details.  Thanks for showing an interest. </p>\n", "parentCommentId": "5ttgdxLbergWRwhZP", "user": {"username": "Niel_Bowerman"}}, {"_id": "ZDupS5orod3APzNPe", "postedAt": "2014-12-13T13:56:20.994Z", "postId": "WoQ8pub55TNzCjJb8", "htmlBody": "<p>I would actually push back on CEA being a bigger failure node than in the past. I think a smaller share of people identifying as working on 'effective altruism' are in CEA than ever before. GiveWell has grown faster than us, and we now have other groups like CS too.</p>\n<p>Also, CEA is an incubator for many different projects, so it would be surprising for them all to collapse simultaneously.</p>\n", "parentCommentId": "FWWBrFq3qGpumXgXJ", "user": {"username": "Robert_Wiblin"}}, {"_id": "ki6qun68esGtiNPNw", "postedAt": "2014-12-13T13:58:28.319Z", "postId": "WoQ8pub55TNzCjJb8", "htmlBody": "<p>Another practical reason is that Kerry Vaughan is very keen to push EA Ventures forward, and is on the Outreach team. In the longer run I could see EA Ventures being coordinated by central CEA, but at least in the short run funding to EA Outreach will in part go to help getting EA Ventures set up (assuming we get enough funding to include that).</p>\n", "parentCommentId": "mGdKRAgKcrJToZWC7", "user": {"username": "Robert_Wiblin"}}, {"_id": "wFbSpcoRo2BhnqSnm", "postedAt": "2014-12-13T14:12:24.611Z", "postId": "WoQ8pub55TNzCjJb8", "htmlBody": "<p>Thanks. Is there a more detailed project plan than the one on <a href=\"https://drive.google.com/file/d/0B3yC4Q2ekHgsM2Q2dWhsQkZtODQ/view?pli=1\">page 9 here</a>? Can you give examples of the sorts of projects that it might fund?</p>\n", "parentCommentId": "n7h4LpKwSii95xL8T", "user": {"username": "jayd"}}, {"_id": "TdZg4dS8QeS2ibNfg", "postedAt": "2014-12-13T14:12:56.829Z", "postId": "WoQ8pub55TNzCjJb8", "htmlBody": "<p>I wouldn't view this as throwing in 'everything and the kitchen sink'. A large majority of the funding will go to four things:</p>\n<p>1) Promotion for Singer's book</p>\n<p>2) Promotion for MacAskill's book, including websites for people to land on before/after reading it</p>\n<p>3) Getting EA Global to happen</p>\n<p>4) Getting EA Ventures off the ground.</p>\n<p>Much of the first three will be outsourced, which is why two people can handle this many projects at once, with the funding necessary to pay professionals.</p>\n", "parentCommentId": "muWyCBJ3eboxphyMs", "user": {"username": "Robert_Wiblin"}}, {"_id": "pAKnGqrfEgS89pb7w", "postedAt": "2014-12-13T14:25:03.631Z", "postId": "WoQ8pub55TNzCjJb8", "htmlBody": "<p>Regarding GPP, your expectations from this year have to be calibrated to the fact that GPP only has one dedicated staff member working 0.75 full time equivalents. It has also not had effective altruists as its target demographic, instead focussing on people working on government policy, and academics.</p>\n<p>Despite that, we have written up our experience with public policy work as mentioned by Niel. I also expect this line of research to be fruitful for effective altruists trying to choose what cause areas to work on: <a href=\"http://www.effective-altruism.com/ea/c4/make_your_own_costeffectiveness_fermi_estimates/\">http://www.effective-altruism.com/ea/c4/make_your_own_costeffectiveness_fermi_estimates/</a>. Owen is currently working on publishing a paper on this topic.</p>\n", "parentCommentId": "ignjtwwmHrXTQFWCN", "user": {"username": "Robert_Wiblin"}}, {"_id": "zPntarYwzHq36W9xP", "postedAt": "2014-12-13T15:52:31.421Z", "postId": "WoQ8pub55TNzCjJb8", "htmlBody": "<p>Hi Jayd,</p>\n<p><a href=\"https://docs.google.com/document/d/1x4NxgPbNce51_pFPzRSnUT5xYTXBCztJQ8FK1IuV8BA/edit?usp=sharing\">Here is a more complete writeup</a> of the project. I'd also recommend getting in touch with me so we can set up some time to chat!</p>\n", "parentCommentId": "wFbSpcoRo2BhnqSnm", "user": {"username": "Kerry_Vaughan"}}, {"_id": "nXgSQtkRhwvNFrtq7", "postedAt": "2014-12-13T15:59:35.138Z", "postId": "WoQ8pub55TNzCjJb8", "htmlBody": "<p>Another factor that I notice is that because Niel and I are, as far as I know, the first EAs to focus exclusively on EA outreach, the space of possible projects is vast, and there's lots of low-hanging fruit. </p>\n<p>EA Ventures is a great example. I think I've talked to around a dozen people who independently had an idea similar to EAV, but didn't have the time to get it off the ground. Given a vast space of high-impact projects, I think it makes sense to try many different things and then double down on the projects that show the most promise.</p>\n<p>That said, if there are good arguments for not doing some projects or for doing others instead, I think Niel and I would be very keen to update our views.</p>\n", "parentCommentId": "muWyCBJ3eboxphyMs", "user": {"username": "Kerry_Vaughan"}}, {"_id": "uoGcAx9N9Me9eQHoX", "postedAt": "2014-12-13T16:04:09.651Z", "postId": "WoQ8pub55TNzCjJb8", "htmlBody": "<p>Just to add to this, I do think EA Ventures is an outreach project.</p>\n<p>The medium-term plan is to change the name of the project to something other than EA Ventures and to pitch the project to impact-oriented donors who do not self-identify as EA. Tyler has already had some success in doing this. I think we can also reach entrepreneurs who are looking for funding for high-impact projects but who do not self identify as EA. </p>\n<p>To be sure, the primary benefit is likely to be connecting EAs with funding from other EAs, but there's no reason that needs to be the only benefit of the project.</p>\n", "parentCommentId": "mGdKRAgKcrJToZWC7", "user": {"username": "Kerry_Vaughan"}}, {"_id": "QkXhfEM2GfXj6u2Ax", "postedAt": "2014-12-13T18:26:01.782Z", "postId": "WoQ8pub55TNzCjJb8", "htmlBody": "<p>Hi Peter. I'll be joining GPP in January. Niel and Rob have both said exactly what I'd say on the point of GPP. I'd perhaps add that GPP has been experimenting with a number of avenues towards impact using the outcome of its research. We'll be deciding exactly what approach seems most promising early in the new year, and that will be really important for shaping the organisation. My current hypothesis is that out biggest comparative advantage as an EA org is in tools for policy rather than for EAs, though obviously many things useful for one can be made useful for the other. From your comment it sounds like you had some specific ideas for things you thought GPP could be bringing to EAs, PM me and I'd love to chat about it.</p>\n", "parentCommentId": "ignjtwwmHrXTQFWCN", "user": {"username": "Sebastian_Farquhar"}}, {"_id": "KqvX6Fs97CeroX4Tb", "postedAt": "2014-12-13T19:21:06.188Z", "postId": "WoQ8pub55TNzCjJb8", "htmlBody": "<blockquote>\n<p>Currently the only person we know who is working on this full time is Tyler Alterman from Leverage, and we work so closely with him that he practically feels like part of the team!</p>\n</blockquote>\n<p>Interesting - is what Tyler or Leverage are doing written up anywhere?</p>\n<blockquote>\n<p>We've been talking with Tom Ash and looking for ways that we can best collaborate with effectivealtruismhub.org, which hosts many .impact projects.</p>\n</blockquote>\n<p>Likewise interesting - what are the options for this?</p>\n<blockquote>\n<p>We've been talking with some of the German EAs about their plans to create &quot;superteams&quot; to work on new EA projects.</p>\n</blockquote>\n<p>Would this be the sort of thing that EA Ventures might fund, or are you imagining slightly different sorts of projects?</p>\n", "parentCommentId": "ignjtwwmHrXTQFWCN", "user": {"username": "Vincent_deB"}}, {"_id": "cKhtZCCqjwNxMBJky", "postedAt": "2014-12-14T01:03:10.333Z", "postId": "WoQ8pub55TNzCjJb8", "htmlBody": "<p>Thanks.  I feel like this concern of mine is as addressed as well as it can be.</p>\n", "parentCommentId": "ignjtwwmHrXTQFWCN", "user": {"username": "Peter_Hurford"}}, {"_id": "LBW2qp5QJSxN9zK9a", "postedAt": "2014-12-14T01:04:44.108Z", "postId": "WoQ8pub55TNzCjJb8", "htmlBody": "<blockquote>\n<p>From your comment it sounds like you had some specific ideas for things you thought GPP could be bringing to EAs, PM me and I'd love to chat about it.</p>\n</blockquote>\n<p>Yeah, that sounds like fun.  I'd be happy to expand on this some, but it's not relevant to the discussion here.  It would be good to chat regardless.  Feel free to reach me at <a href=\"mailto:peter@peterhurford.com\">peter@peterhurford.com</a>.</p>\n<p>I think that a lot of what GPP could do is also well covered by GiveWell Labs.</p>\n", "parentCommentId": "QkXhfEM2GfXj6u2Ax", "user": {"username": "Peter_Hurford"}}, {"_id": "2MGXRmGzzqgNJjpYb", "postedAt": "2014-12-14T01:08:30.086Z", "postId": "WoQ8pub55TNzCjJb8", "htmlBody": "<blockquote>\n<p>I agree with you that CEA is becoming an increasingly key node in the EA movement, and that this is a potential failure mode, and it is one that we have been taking steps to address. We are currently in the process of finalising a governance reform package within CEA that would turn CEA into more of an incubator, which will make it easier for CEA to start and end projects.</p>\n</blockquote>\n<p>That sounds good to me.  I look forward to seeing how this develops.</p>\n", "parentCommentId": "FWWBrFq3qGpumXgXJ", "user": {"username": "Peter_Hurford"}}, {"_id": "q5SePKCubDcyDTE6d", "postedAt": "2014-12-14T01:09:57.854Z", "postId": "WoQ8pub55TNzCjJb8", "htmlBody": "<blockquote>\n<p>Given a vast space of high-impact projects, I think it makes sense to try many different things and then double down on the projects that show the most promise.</p>\n</blockquote>\n<p>What sort of goals are you setting to tell whether a project has promise or not?</p>\n", "parentCommentId": "nXgSQtkRhwvNFrtq7", "user": {"username": "Peter_Hurford"}}, {"_id": "XBFfe7L98YqJmsjCy", "postedAt": "2014-12-14T01:10:30.496Z", "postId": "WoQ8pub55TNzCjJb8", "htmlBody": "<p>Applied!  Thanks.</p>\n", "parentCommentId": "rxppDsyeKA7uKgNjK", "user": {"username": "Peter_Hurford"}}, {"_id": "wrShq37g3JpwAvwdm", "postedAt": "2014-12-14T01:12:13.726Z", "postId": "WoQ8pub55TNzCjJb8", "htmlBody": "<p>That makes sense.  I hope someone from GWWC or CEA would be willing to write up some of these lessons learned for the benefits of the wider audience trying to spread EA ideas.</p>\n", "parentCommentId": "s58k68AgMtTq9ypRr", "user": {"username": "Peter_Hurford"}}, {"_id": "P2EhFN6vmdQSz2HGE", "postedAt": "2014-12-14T01:13:13.424Z", "postId": "WoQ8pub55TNzCjJb8", "htmlBody": "<blockquote>\n<p>I hope this answers some of your questions, and feel free to get in touch if you have further questions.</p>\n</blockquote>\n<p>Sure thing.  Thanks for the care and attention to these questions.</p>\n", "parentCommentId": "y9wpwzv2LWab9s2BJ", "user": {"username": "Peter_Hurford"}}, {"_id": "ec6PBG4hRstYvjr5f", "postedAt": "2014-12-14T03:22:16.474Z", "postId": "WoQ8pub55TNzCjJb8", "htmlBody": "<p>Some more questions:</p>\n<ol>\n<li><p>It's great that so many people are working on giving lots of people a positive initial impression of EA. But my sense is there's a pretty big gap between &quot;initial impression of EA&quot; and &quot;EA is a big part of my life&quot; that isn't being filled very well right now. Are there any plans to work on these later stages of the EA pipeline?</p>\n</li>\n<li><p>What's the difference between Will and Peter's books? Their titles are extremely similar, so it's hard to tell...</p>\n</li>\n<li><p>Nitpick: are there any plans to fix the fact that effective-altruism.org and effectivealtruism.org are two different sites? I could see this being pretty confusing for a first impression.</p>\n</li>\n<li><p>How does funding this related to funding CEA or other CEA sub-projects? It seems like part of your budget is actually a part of CEA central's expenses, so presumably donations are somewhat fungible between the two?</p>\n</li>\n<li><p>Does the claim &quot;We are currently due to run out of funding next month&quot; include the £62,500 donation? It seems like not, but you didn't insert any caveats about that into your claim. At any rate, what's the situation for marginal funds? What do you anticipate getting cut if you don't meet your goal, and what would you do with funds over your budget (or will you just stop accepting donations)?</p>\n</li>\n<li><p>What do you see as the biggest risks and failure modes of EA Outreach?</p>\n</li>\n</ol>\n<p>Thanks!</p>\n<p>Ben</p>\n", "parentCommentId": null, "user": {"username": "Ben_Kuhn"}}, {"_id": "rBXNTxk4whJAdFjQR", "postedAt": "2014-12-14T11:16:57.307Z", "postId": "WoQ8pub55TNzCjJb8", "htmlBody": "<p>These are more great questions Ben.  Do you mind if I come back to you on them on Monday as I'm going to try and take today as a day off?  Thanks in advance.  </p>\n", "parentCommentId": "ec6PBG4hRstYvjr5f", "user": {"username": "Niel_Bowerman"}}, {"_id": "PD5BkMnGi67AZZ3S6", "postedAt": "2014-12-14T14:14:48.073Z", "postId": "WoQ8pub55TNzCjJb8", "htmlBody": "<blockquote>\n<p>I think a lot of what GPP could do is also well covered by GiveWell Labs.</p>\n</blockquote>\n<p>I absolutely agree with this (and am delighted by it). GPP is likely to look for things which are either very distinct from or complementary to the kind of work OPP does.</p>\n", "parentCommentId": "LBW2qp5QJSxN9zK9a", "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "SzRX3hSabC2XPkbaL", "postedAt": "2014-12-14T19:45:55.216Z", "postId": "WoQ8pub55TNzCjJb8", "htmlBody": "<p>Niel and Rob. I understand that you are both extremely capable people, but I am pleased to see that part of the funding would go towards seeking professional help in promoting the books. </p>\n<p>My main question is around whether or not you see this as a one-off funding request, or part of an ongoing program that will need funding for several years?</p>\n", "parentCommentId": null, "user": {"username": "ChrisSmith"}}, {"_id": "NKBQ2tSex9frQbyC9", "postedAt": "2014-12-14T20:32:51.471Z", "postId": "WoQ8pub55TNzCjJb8", "htmlBody": "<p>Sure, go ahead.</p>\n", "parentCommentId": "rBXNTxk4whJAdFjQR", "user": {"username": "Ben_Kuhn"}}, {"_id": "zmu4zpXtMFsArvNGE", "postedAt": "2014-12-15T10:41:33.265Z", "postId": "WoQ8pub55TNzCjJb8", "htmlBody": "<p>A lot of these learnings are written up in the various organisations' annual and six-monthly reviews such as <a href=\"https://www.givingwhatwecan.org/sites/givingwhatwecan.org/files/Jacob%20Hilton/giving_what_we_can_six_month_review.pdf\">https://www.givingwhatwecan.org/sites/givingwhatwecan.org/files/Jacob%20Hilton/giving_what_we_can_six_month_review.pdf</a> and <a href=\"https://80000hours.org/2014/05/summary-of-the-annual-review-may-2014/\">https://80000hours.org/2014/05/summary-of-the-annual-review-may-2014/</a>  </p>\n<p>Unfortunately I think that much of our learning in areas like marketing is not generally applicable enough to be useful to more than a dozen or so people in the world right now.  We are talking with these people already and generally I find those conversations to be more useful than spending an equivalent amount of time writing up learnings because we can tailor the conversation to specific circumstances.  </p>\n<p>For example, writing up my policy learnings ( <a href=\"http://effective-altruism.com/ea/7e/good_policy_ideas_that_wont_happen_yet/\">http://effective-altruism.com/ea/7e/good_policy_ideas_that_wont_happen_yet/</a> ) took me at least 1.5 days, and it is unclear to me whether this was better than having 15 one-hour conversations with interested people.  This was a case where I had particularly well-organised thoughts and potentially novel insights, so I find it likely that in cases where I have less-insightful and worse-organised thoughts it would be better for me just to have the conversations instead, which is the route I am currently going down with a lot of this stuff.  </p>\n<p>I would be interested in your thoughts on this as someone who does take the time to write up substantial amounts of your thinking.  How do you compare the trade-off against spending the same amount of time simply having conversations with people? I'm pretty open to the idea that I'm not spending enough time writing up my learnings, but at the moment I'm trying to focus my effort on conversations instead as I think that's where more value lies.  </p>\n", "parentCommentId": "wrShq37g3JpwAvwdm", "user": {"username": "Niel_Bowerman"}}, {"_id": "ozW9bNLotY3CtTMmv", "postedAt": "2014-12-15T11:11:20.310Z", "postId": "WoQ8pub55TNzCjJb8", "htmlBody": "<p>Hi Ben,</p>\n<p>Great questions as always.  I'm going to hand a couple of these over to Kerry Vaughan, but I'll take a shot at answering most of them.  Again, I'm afraid my answers are too long to fit into a single comment, so I'll answer questions one-by-one.  </p>\n<blockquote>\n<ol>\n<li>It's great that so many people are working on giving lots of people a positive initial impression of EA. But my sense is there's a pretty big gap between &quot;initial impression of EA&quot; and &quot;EA is a big part of my life&quot; that isn't being filled very well right now. Are there any plans to work on these later stages of the EA pipeline?</li>\n</ol>\n</blockquote>\n<p>I agree that there is a need here.  On p2 <a href=\"http://bit.ly/EAO2015\">here</a> I outline how our activities can be thought of as fitting into this pipeline.  Some of them are earlier in this pipeline (making it easier for people to get up to speed on the ket ideas in EA at effectivealtruism.org), while others are later (the EA Fellows Programme). The main activities targeting the later stages of this pipeline are:</p>\n<ul>\n<li>EA Global, which is designed to allow lots of people to meet face-to-face to make it easy for people to dive into the community.  </li>\n<li>EA Fellows Programme, which is intended to provide an opportunity for a handful of high-potential people who are interested in EA to make it a much bigger part of their life.  </li>\n<li>And finally EA Ventures which we hope will providing funding for more people to work full-time on EA projects.  </li>\n</ul>\n<p>In my experience becoming very engaged in EA often comes about as a result of a large amount of one-on-one interaction with people in the community, so we hope to build some tools into EffectiveAltruism.org to make this easier.  I think that local chapters are likely to be a key part of how people become more involved, and I'm always interested to hear ways in which we might be able to help local chapters grow, so if you do have ideas let me know.  I hear that you're doing great work in this area already, so perhaps you have some suggestions?  </p>\n<p>Ultimately I think there is so much work to be done in the area you've mentioned that I would hope that there are people dedicated specifically to this aim in the future, and this is something that we are hoping to develop in CEA in time.  </p>\n", "parentCommentId": "ec6PBG4hRstYvjr5f", "user": {"username": "Niel_Bowerman"}}, {"_id": "PPMtHW2xMyEw7aFjw", "postedAt": "2014-12-15T11:19:39.997Z", "postId": "WoQ8pub55TNzCjJb8", "htmlBody": "<blockquote>\n<p>Two.  What's the difference between Will and Peter's books? Their titles are extremely similar, so it's hard to tell...</p>\n</blockquote>\n<p>While the books are on a similar topic, they approach effective altruism from slightly different angles.  For example: </p>\n<ul>\n<li>Peter's book is probably more focused on the altruism side of EA, while Will's focuses more on  the effectiveness side.  </li>\n<li>Peter's book focuses slightly more on big giving and the good you can do with your money, whereas Will's takes in a wider range of topics from career choice to consumerism.  </li>\n<li>Will's book discusses a wider range of potential causes than Peter's book (I think, I'd have to double check to be sure)</li>\n</ul>\n", "parentCommentId": "ec6PBG4hRstYvjr5f", "user": {"username": "Niel_Bowerman"}}, {"_id": "WADTRozsWsfeJNJwH", "postedAt": "2014-12-15T12:08:30.988Z", "postId": "WoQ8pub55TNzCjJb8", "htmlBody": "<blockquote>\n<p>Four.  How does funding this related to funding CEA or other CEA sub-projects? It seems like part of your budget is actually a part of CEA central's expenses, so presumably donations are somewhat fungible between the two?</p>\n</blockquote>\n<p>The 'Central Team' within CEA can be thought of as providing services to the projects that it incubates, and so the projects split the costs of 'Central' CEA according to a splitting algorithm.  Historically, unrestricted donations to CEA have been split following an algorithm between the different projects that it incubates.  In 2015, the use of unrestricted donations is likely to change somewhat, and is likely to include some fraction going to the different projects within CEA, as well as some used to support the creation of new projects, and potentially some to be assigned discretionarily by the trustees.  If you were to donate to CEA unrestricted in 2014, approximately 11% of your donation would have gone to EA Outreach, with the remainder going to the Global Priorities Project, 80,000 Hours and Giving What We Can.  </p>\n", "parentCommentId": "ec6PBG4hRstYvjr5f", "user": {"username": "Niel_Bowerman"}}, {"_id": "gbf4CQdGrrDmBE5Zi", "postedAt": "2014-12-15T12:28:57.583Z", "postId": "WoQ8pub55TNzCjJb8", "htmlBody": "<blockquote>\n<p>Does the claim &quot;We are currently due to run out of funding next month&quot; include the £62,500 donation? It seems like not, but you didn't insert any caveats about that into your claim. At any rate, what's the situation for marginal funds? What do you anticipate getting cut if you don't meet your goal, and what would you do with funds over your budget (or will you just stop accepting donations)?</p>\n</blockquote>\n<p>Unfortunately the £62,500 donation is only a ballpark figure at the moment and won't be confirmed until late December or January.  Sorry that I didn't make this clearer.  </p>\n<p>The first thing that would be cut from the budget is an external publicist for Will's book.  We would have to rely on Penguin to do much of the publicity, and we would do as much as we had time for in-house as well.  I would probably want to fundraise additional funds to hire a summer intern to help with marketing and pitching media outlets in this case.  </p>\n<p>You can see the full list of everything that we could fund if money was available in <a href=\"https://docs.google.com/spreadsheets/d/1Odt76Jns2b7Qgbm5fo1CFqrkQe6yD8zzfOLnvjGCYl4/edit?usp=sharing\">this spreadsheet</a> (which uses this now-outdated <a href=\"https://docs.google.com/document/d/1eB5v8_B3NXvPvCI_oJeTiYGY903gFxT1SwSUkZ4xJK4/edit?usp=sharing\">documentation</a>).  The <a href=\"http://bit.ly/EAO2015\">budget</a> that we are using to fundraise includes only a small fraction of these opportunities, as they are the ones that we most wanted to fund.  </p>\n<p>At time of writing, we need an additional £15k on top of our current pledges to be able to fund our top priorities except Will's publicist.  Paying for Will's publicist would require another ~£19k on top of that.  </p>\n", "parentCommentId": "ec6PBG4hRstYvjr5f", "user": {"username": "Niel_Bowerman"}}, {"_id": "xLLtLqbsZd5NibPtD", "postedAt": "2014-12-15T12:47:30.599Z", "postId": "WoQ8pub55TNzCjJb8", "htmlBody": "<blockquote>\n<p>What do you see as the biggest risks and failure modes of EA Outreach?</p>\n</blockquote>\n<p>Some of the most salient failure modes for EA Outreach are in the individual sub-projects:</p>\n<ul>\n<li><p>For Will and Peter's books, the outside-view median outcome is that they don't make a splash in the media and don't sell very well.  Unfortunately there are just so many books published each year (~1m per year) that the outside-view chances of ours being one of few that gain considerable attention and sell well is slim.  Even when you account for the fact that we have a substantial advance and top-tier publisher, the outside view says that we'll only sell a moderate number of books and will be unlikely to make more than the advance.  Inside view says that we'll do better than this because of the amount of resources going into the book, the fact that there is a movement behind the book, and because people seem pretty interested in EA-style questions at the moment.  The reason we are doing this is not for the median case though, it's for the upper tail in which we become a best-seller and EA becomes well known enough that media hosts feel the need to include it in their discussions of charity, philanthropy, and doing good.  The outside-view chances of this happening are slim, and the inside-view chances are better but not huge, though we have been told by publishers, publicists, etc. that it is a real possibility.  I will be working very hard over the coming year to give these books the best possible launches I can, but unfortunately the risk is still probably the biggest one that we are taking.  </p>\n</li>\n<li><p>My most salient worry for EA Global is that it doesn't sell tickets, people don't come, and it makes a major loss.  We are going to be marketing it hard, and part of the reason for moving to a global model is that it makes it easier for more people to come as they won't have to travel as far.  </p>\n</li>\n<li><p>My biggest worry for EffectiveAltruism.org is that it doesn't get much traffic.  There are now many popular sites that discuss EA, and though EA.org is ranked at no. 5 when I do an incognito search for 'Effective Altruism', my main worry is that it won't get enough traffic.  My other worry is that we will never actually finish building it as other higher-priority projects will take precedent, but I don't see that as as much of a risk.  </p>\n</li>\n<li><p>I suppose my worries can be put into two broad categories, either we fail to get enough attention for EA, or we get the attention and fail to convert it sufficiently into growth of the movement.  I think both of these are very real possibilities that we are working every day to reduce the chances of.  </p>\n</li>\n</ul>\n", "parentCommentId": "ec6PBG4hRstYvjr5f", "user": {"username": "Niel_Bowerman"}}, {"_id": "SpZ9jnLtZJF6N4FQ2", "postedAt": "2014-12-15T12:57:40.149Z", "postId": "WoQ8pub55TNzCjJb8", "htmlBody": "<p>Hi Chris,</p>\n<p>This is a good question.  Many of the sub-projects that we are doing are one-off opportunities which we are unlikely to seek funding for in future years (e.g. a publicist for Will and Peter).  Other projects are experiments that we would like to repeat and/or expand in future years if they are successful, such as EA Global, the EA Fellows Programme, etc.  </p>\n<p>EA Outreach as a whole is also in this category - if it is successful (or more accurately if it looks in hindsight like it was a worthwhile bet) then we would like to continue working on it and funding it.  On the otherhand if the project is not successful (or more accurately does not look like it was a worthwhile bet), then we would like to discontinue it.  My guess at this stage is that we will want to seek further funding for EA Outreach activities in future years, as this seems to be an under-invested area within the EA movement and we seem to be well placed to execute on it, however much will depend on how much we achieve over the coming year.  </p>\n<p>I hope that answers your question, and let me know if you have any others.  </p>\n<p>Cheers,</p>\n<p>Niel</p>\n", "parentCommentId": "SzRX3hSabC2XPkbaL", "user": {"username": "Niel_Bowerman"}}, {"_id": "5hWMjjh9y6wrvJHAi", "postedAt": "2014-12-15T15:58:52.807Z", "postId": "WoQ8pub55TNzCjJb8", "htmlBody": "<blockquote>\n<p>Interesting - is what Tyler or Leverage are doing written up anywhere?</p>\n</blockquote>\n<p>Not as of yet. I'll let Tyler decide when is a good time to write some things up.</p>\n<blockquote>\n<p>Likewise interesting - what are the options for this?</p>\n</blockquote>\n<p>I'm talking to Tom later today. One obvious plan include linking to more .impact projects from effectivealtruism.org .</p>\n<blockquote>\n<p>Would this be the sort of thing that EA Ventures might fund, or are you imagining slightly different sorts of projects?</p>\n</blockquote>\n<p>This could be the sort of thing EA Ventures might fund. I think EA Ventures will be in a position to fund a diverse range of projects including for-profits, nonprofits and projects that are valuable, but too small to be considered a full-fledged startup.</p>\n", "parentCommentId": "KqvX6Fs97CeroX4Tb", "user": {"username": "Kerry_Vaughan"}}, {"_id": "B3fgGzrJ2CSuA7zDC", "postedAt": "2014-12-15T18:18:57.696Z", "postId": "WoQ8pub55TNzCjJb8", "htmlBody": "<p>I get the sense from people on this forum, including CEA itself, that spreading EA is about “making EA's”, meaning creating more heroic individuals donating big to top charities or pursuing high-impact careers, or even just involved in the movement in some way such as hosting meet-ups. Those things are all terrific, but I see the potential for spreading EA (including EA Outreach's 2015 program) more as an effectiveness revolution: millions of people donating a little more, or a little “better”, or thinking about impact more when choosing their careers, will benefit the world much more than a couple hundred more GWWC members or movement volunteers. So when you say there's a gap between exposure to EA and having EA as a big part of one's life, I don't think that is the only proxy for success: isn't it better for EA to be a tiny part of many peoples' lives than a big part of the lives of a few? I'm supporting Will's book marketing, not only to maximize sales but mainly to raise his profile so as to make EA more mainstream and hopefully encourage millions of people to increase their heart footprint just a little bit. </p>\n<p>I find that donations/volunteering/career selection is generally self-serving and people don't even try to be effective so just nudging society to think about impact in these areas I think is a low hanging fruit we can pursue right away. </p>\n", "parentCommentId": "ec6PBG4hRstYvjr5f", "user": {"username": "Austen_Forrester"}}, {"_id": "muDD6LzpMqa63D5Pn", "postedAt": "2014-12-15T20:47:43.425Z", "postId": "WoQ8pub55TNzCjJb8", "htmlBody": "<blockquote>\n<p>Nitpick: are there any plans to fix the fact that effective-altruism.org and effectivealtruism.org are two different sites? I could see this being pretty confusing for a first impression.</p>\n</blockquote>\n<p>I'll be fixing the domain structure once effectivealtruism.org gets up and running. In addition to fixing this issue, the question of how to connect effectivealtruism.org and the forum will be part of what I investigate.</p>\n", "parentCommentId": "ec6PBG4hRstYvjr5f", "user": {"username": "Kerry_Vaughan"}}, {"_id": "LrRhgqXsH4H8HYjKa", "postedAt": "2014-12-16T05:39:16.434Z", "postId": "WoQ8pub55TNzCjJb8", "htmlBody": "<p>From your description, they sound quite similar. What's the rationale for releasing so close to each other and splitting publicity efforts between the two of them? Are you at all worried that they will interfere with each other or compete for attention?</p>\n", "parentCommentId": "PPMtHW2xMyEw7aFjw", "user": {"username": "Ben_Kuhn"}}, {"_id": "d7zwDP6iP5ehzKkyR", "postedAt": "2014-12-16T06:07:06.401Z", "postId": "WoQ8pub55TNzCjJb8", "htmlBody": "<p>For EA Global, I have a couple additional worries that I'd love your thoughts on:</p>\n<ol>\n<li><p>It seems like organizing the events itself will be another large difficulty. I understand that previous EA summits required a fairly large push from Leverage; I'm guessing Tyler Alterman will be able to command at least some of the same resources, but potentially not all of them (at least, that's what I infer from him explicitly being in charge and not Geoff Anders). Meanwhile, if costs are lower, the events could be even larger and more difficult to organize, especially for those without such extensive experience as Leverage.</p>\n</li>\n<li><p>If there are a number of different summits going on, some of which are less-officially organized but under the same &quot;EA brand,&quot; it seems like this increases the potential for damaging that brand if something weird happens. I think this was a decent risk factor even for the 2014 summit as it was run, for instance.</p>\n</li>\n</ol>\n<p>Do you have any plans to deal with these? Sorry to ask so many questions, but I'm hoping they'll be useful to other people as well!</p>\n", "parentCommentId": "xLLtLqbsZd5NibPtD", "user": {"username": "Ben_Kuhn"}}, {"_id": "aEiSc84nxgmkYxHpg", "postedAt": "2014-12-16T06:09:08.202Z", "postId": "WoQ8pub55TNzCjJb8", "htmlBody": "<p>For EffectiveAltruism.org, do you know the search volume for &quot;effective altruism&quot; or related queries? Do you have any sense of how much traffic you could possibly get (e.g., what quantitatively would count as &quot;lots of traffic&quot; vs. &quot;not much traffic&quot;)?</p>\n", "parentCommentId": "xLLtLqbsZd5NibPtD", "user": {"username": "Ben_Kuhn"}}, {"_id": "9rNMBZLvW3poKhmFm", "postedAt": "2014-12-16T06:32:50.654Z", "postId": "WoQ8pub55TNzCjJb8", "htmlBody": "<p>Thanks so much for answering in such detail!</p>\n<p>Have you written up anything about the 1:1 tools for EA.org anywhere?</p>\n<p>WRT chapter suggestions, I'm only just figuring things out myself and I'm afraid I don't have any magic bullets! I'll let you know if I come up with any though :)</p>\n", "parentCommentId": "ozW9bNLotY3CtTMmv", "user": {"username": "Ben_Kuhn"}}, {"_id": "3uGjzQ2F5vZh9FMtD", "postedAt": "2014-12-16T09:59:45.887Z", "postId": "WoQ8pub55TNzCjJb8", "htmlBody": "<blockquote>\n<p>Have you written up anything about the 1:1 tools for EA.org anywhere?</p>\n</blockquote>\n<p>Seconded. Also, what are the current ways in which proto-EAs can get one-on-one interaction, and what are the things that we can leverage to increase this?</p>\n", "parentCommentId": "9rNMBZLvW3poKhmFm", "user": {"username": "Vincent_deB"}}, {"_id": "RTXHKagzXeMhYwqHq", "postedAt": "2014-12-16T11:14:42.116Z", "postId": "WoQ8pub55TNzCjJb8", "htmlBody": "<p>I agree they are relatively similar.  We've been keeping the publishers up to date with the plans of the other authors and publishers that are publishing books on EA in 2015.  Thus the publishers think that these dates are pretty optimal in terms of when we would want them all released: spaced out enough that each can get its own media coverage and attention, but close enough that people can write about the trend and broader movement of EA with so many books coming out around the same time.  I am a little worried that they will compete for attention, which is part of the reason why I'm coordinating both Will and Peter's marketing, so that they can collaborate where possible.  I've been thinking about this quite a bit recently, and I've settled on thinking that each book trying to maximise its own success is actually going to be really quite close to optimal, so I'm going to be adopting a strategy that is not far from that.  Essentially, the chances of any one promotional push putting a lot of media attention on EA is relatively small, and so we want as many rolls of the dice as possible.  </p>\n", "parentCommentId": "LrRhgqXsH4H8HYjKa", "user": {"username": "Niel_Bowerman"}}, {"_id": "MqjvehrQWCXmEvKJY", "postedAt": "2014-12-16T16:31:57.602Z", "postId": "WoQ8pub55TNzCjJb8", "htmlBody": "<p>Google estimates that there are 720 searches a month for &quot;effective altruism.&quot; I expect that to increase over time, but I don't expect search to be the biggest source of traffic initially. I'm expecting that link traffic from people who want a site to explain EA will be the biggest source of traffic initially.</p>\n<p>I don't have a number attached to my expectations about traffic numbers. But, since CEA has a number of web properties, we can benchmark effectivelatruism.org pretty easily by comparing our traffic profile to the traffic profile of other CEA sites. We can use this to figure out whether the site is succeeding or failing from a traffic standpoint.</p>\n<p>However, I slightly disagree with Niel that low traffic is the biggest risk. I think the biggest risk is that the site does become the de facto landing page for EA, but the site isn't very good or doesn't encourage people to want to get involved. You can get lots of traffic and still not have much of an impact.</p>\n<p>I'm working to hedge against this by working with Andy Fallshaw who is an extremely talented designer and branding expert and by A/B testing a wide variety of aspects of the site.</p>\n", "parentCommentId": "aEiSc84nxgmkYxHpg", "user": {"username": "Kerry_Vaughan"}}, {"_id": "83uFzqbnciWmdGeXB", "postedAt": "2014-12-16T16:41:00.795Z", "postId": "WoQ8pub55TNzCjJb8", "htmlBody": "<blockquote>\n<p>It seems like organizing the events itself will be another large difficulty. I understand that previous EA summits required a fairly large push from Leverage; I'm guessing Tyler Alterman will be able to command at least some of the same resources, but potentially not all of them (at least, that's what I infer from him explicitly being in charge and not Geoff Anders). Meanwhile, if costs are lower, the events could be even larger and more difficult to organize, especially for those without such extensive experience as Leverage.</p>\n</blockquote>\n<p>There's no doubt that EA Global is an ambitious project and I agree that the size and scope of the plan creates an opportunity for failure. But, I have a few tricks up my sleeve that make me think this is manageable: 1) we're planning to hire an event planner to help with coordination and logistics, freeing up more of my time to focus on strategy and marketing; 2) I've been consulting with Nevin and Cathleen regularly and am benefiting from their experience; 3) We've scaled down some aspects of the events themselves which will reduce the number of components that might go wrong.</p>\n", "parentCommentId": "d7zwDP6iP5ehzKkyR", "user": {"username": "Kerry_Vaughan"}}, {"_id": "8Hg58nBZB9myAEoXQ", "postedAt": "2014-12-16T16:55:56.421Z", "postId": "WoQ8pub55TNzCjJb8", "htmlBody": "<blockquote>\n<p>If there are a number of different summits going on, some of which are less-officially organized but under the same &quot;EA brand,&quot; it seems like this increases the potential for damaging that brand if something weird happens. I think this was a decent risk factor even for the 2014 summit as it was run, for instance.</p>\n</blockquote>\n<p>I think the probability that some negative event happens increases as we add more different locations for events, but I think the total risk to the brand decreases. If something weird happened in 2014, it would mean that something went wrong at <em>the only EA gathering of the year.</em> If something weird happens at a single location this year, it's more plausible to explain that it was an isolated incident than that it is representative of all of EA.</p>\n<p>That said, I'm vetting people running the events carefully and focusing mostly on finding experienced event runners. I plan to exercise more extensive oversight for areas of managing the event that could damage the EA brand.</p>\n", "parentCommentId": "d7zwDP6iP5ehzKkyR", "user": {"username": "Kerry_Vaughan"}}]