[{"_id": "dAyZ3QAnsy5qh9h5j", "postedAt": "2022-09-24T19:34:26.040Z", "postId": "WQ7RKE2WpFWdm5pnh", "htmlBody": "<p>If I was going to spend longer on this post, I'd make it more empirical and talk through evidence for/against the effectiveness of ACT.&nbsp;</p><p>As it is, I didn't want to spend significantly longer writing it, so I've gone for a summary of the core ideas -- so that readers can assess the vibe and see if it's something that sounds interesting to them.</p><p>This might have been the wrong call though.</p>", "parentCommentId": null, "user": {"username": "Evie Cottrell"}}, {"_id": "NG2QDaCQxtZx6eS5s", "postedAt": "2022-09-24T21:30:26.761Z", "postId": "WQ7RKE2WpFWdm5pnh", "htmlBody": "<p>While I have not done a deep dive into the literature and checked the claims in depth, afaik ACT counts as one of the more evidence based psychotherapies with several hundred studies including RCTs demonstrating good effects.</p>\n<p>There is also a whole scientific paradigm “contextual behavioral science” based on “functional contextualism” which grounds the development of ACT. This is one of the clearest theoretical foundations for a scientific field I have come across (i.e., it’s a coherent account grounded in Pragmatism) and should be refreshing to have a look at for people interested in philosophy of science as well as behavioral science in general.</p>\n<p>I am pretty bullish on ACT and would recommend anyone interested in mental health to have a good look for aspects that might work for them.</p>\n<p>What I would maybe add to the post is a short description of the ACT Matrix, which is a thinking tool that can be useful for organizing thoughts about problematic situations. While it certainly depends on the person, some friends I have showed it to found it easy to grasp and very helpful for navigating difficult situations. It’s not a panacea but may be a good starting point for people who appreciate a hands-on learning approach.</p>\n<p>I also recommend the tools section in a liberated mind. Should be pretty relatable for people who have done or are generally interested in CFAR workshops / rationality techniques.</p>\n<p>Thanks for writing the post!</p>\n", "parentCommentId": "dAyZ3QAnsy5qh9h5j", "user": {"username": "alexherwix"}}, {"_id": "cXHivP9WjsdvskLX4", "postedAt": "2022-09-25T07:09:40.110Z", "postId": "WQ7RKE2WpFWdm5pnh", "htmlBody": "<p>Thanks for sharing! That's useful to know.</p><p>I'll look into adding to the post later today.</p>", "parentCommentId": "NG2QDaCQxtZx6eS5s", "user": {"username": "Evie Cottrell"}}, {"_id": "iWWQKvrkuRLickzHv", "postedAt": "2022-09-25T14:41:39.189Z", "postId": "WQ7RKE2WpFWdm5pnh", "htmlBody": "<p>Thank you so much for writing this up! I've also found a lot of benefits from ACT, and it seems like there is <a href=\"https://www.sciencedirect.com/science/article/pii/S2212144720301940\">quite a strong empirical grounding</a>. I'd also second your recommendation that anyone interested seek out the book <a href=\"https://stevenchayes.com/a-liberated-mind\">A Liberated Mind</a> by Steven Hayes, one of the progenitors of ACT.</p>\n<p>In that book, Hayes also mentions some research they did on ACT for goal-related outcomes, like improving school grades and chess performance. I don't have the links on hand, but I recall that they saw significant effects from relatively minor interventions, so I think it could be especially promising for people looking to deal not only with larger mental illness issues, but also smaller life goals.</p>\n<p>I have found more benefit from ACT than traditional CBT myself. As this post mentions, one of the fundamental differences is that CBT tries to change your thinking about difficult things, whereas ACT simply asks you to accept them wholeheartedly. Because of this, I've sometimes felt like CBT is kind of just gaslighting yourself, which may in fact be effective, but I suspect that ACT might produce more stable long-term improvements — especially for people who have epistemic issues with the idea of simply reframing difficult truths. I think ACT also has many similarities to mindfulness practice and certain forms of Buddhism, and people who find those ideas interesting and helpful will likely see some benefit from ACT.</p>\n", "parentCommentId": null, "user": {"username": "Tyler Johnston"}}, {"_id": "ofRxSTefpfCa4pXuZ", "postedAt": "2022-09-25T14:50:01.043Z", "postId": "WQ7RKE2WpFWdm5pnh", "htmlBody": "<p>I did a shallow review of the evidence for ACT last year:\n\"Anxiety defusion and acceptance (acceptance and commitment therapy)\nMind Ease’s anxiety defusion exercise is based on acceptance and commitment therapy (ACT), which is backed by the following evidence:\nTraditional ACT with a therapist:\nA 2017 review of RCTs of ACT to treat anxiety and depression shows that ACT improves depression relative to no treatment up to 6-months follow-up. (ds = 0.32 to 1.18). Two studies compared ACT with minimally active comparison conditions (expressive writing and minimal support group) and found ACT outperformed comparison conditions on depression at post, but were equivalent at follow-up.[74]\nA 2020 meta-analysis of 18 studies with 1,088 participants showed that ACT significantly reduced depression as compared with the control group (d= 0.59, 95% CI [0.38, 0.81]).[75]\nSelf-help: Traditionally face-to-face, ACT is also delivered in self-help formats. A meta-analysis shows that ACT self-help showed significant small effect sizes favoring intervention for depression (g=0.34; 95% CIs [0.07, 0.61]; Z=2.49, p=0.01) and anxiety (g=0.35; 95% CIs [0.09, 0.60]; Z=2.66, p=0.008). Higher levels of clinician guidance improved outcomes but intervention format (e.g. book/computer) was unlikely to moderate results.[76]\nInternet-based ACT (iACT): A systematic review of internet-delivered ACT (iACT) for anxiety[77] showed that 18 out 20 studies reported significant anxiety reduction after treatment. This was observed in studies that delivered iACT with (n=13) or without (n=5) therapist guidance. The average attrition rate during treatment was 19%. In 13 studies participants on average rated their iACT experience with above average to high treatment satisfaction.\nApp-based ACT: A recent RCT of ACT in an app form showed that help-seeking individuals vs. waitlist increased well-being with moderate effect sizes.[78]\nIn aggregate, anxiety defusion and acceptance (acceptance and commitment therapy) seems effective with small to medium effect sizes.\"</p>\n<p><a href=\"https://docs.google.com/document/u/0/d/1Y0Mc0pI-pDMQMPg8M4F0zA1KYiXuvW5q7MPXRH9sX7k/mobilebasic#h.3u6ryras7n0z\">https://docs.google.com/document/u/0/d/1Y0Mc0pI-pDMQMPg8M4F0zA1KYiXuvW5q7MPXRH9sX7k/mobilebasic#h.3u6ryras7n0z</a></p>\n", "parentCommentId": "dAyZ3QAnsy5qh9h5j", "user": {"username": "HaukeHillebrandt"}}]