[{"_id": "JwHd8XYbzDKrXK7Pe", "postedAt": "2024-03-12T12:41:22.984Z", "postId": "WRnT9hGfg3oKfKtXa", "htmlBody": "<p>Skimmed and this looks like a good list, thanks for writing this up and sharing! I also appreciate you sharing your reasoning.</p>\n<p>Minor question: I'm curious about your emphasis on statistical work, particularly wrt AI regulation and standards. I think mostly I'm unsure that the additional time and difficulty of doing robust statistical work would be worth it, relative to the current case study/best guess/experts' estimates approach. What am I missing?</p>\n", "parentCommentId": null, "user": {"username": "ceb"}}, {"_id": "HFTKfHnttLwybuNq4", "postedAt": "2024-03-12T14:25:13.615Z", "postId": "WRnT9hGfg3oKfKtXa", "htmlBody": "<p>Thanks for your comment Ceb.&nbsp;</p><p>I think my case for more focus on good statistical work when looking at governance is that when doing good statistical work on interventions, we often find very high degrees of variation in effect sizes that are enough to justify the extra work of the intervention. I'm personally very unsure of the effect size of changes in liability law, soft law, and various corporate governance interventions on accident rates.&nbsp;</p><p>There's been lots of great case study/best guess/expert consensus work on these questions which I think is often great and I'm very happy exists, but leaves me with large uncertainties about effect sizes, and so on the current margin, I want more good statistical work.&nbsp;</p><p>I think the case for good statistical work on areas like degree of misuse risk and forecasting is stronger because I think that people's takes on these questions are pretty grounded in quite theoretical arguments (unlike governance interventions which are much more empirically grounded) that I think would benefit a lot from more grounded statistical work.&nbsp;</p>", "parentCommentId": "JwHd8XYbzDKrXK7Pe", "user": {"username": "Nathan_Barnard"}}, {"_id": "pDF88kzoPdR8vjsK4", "postedAt": "2024-03-12T14:53:34.362Z", "postId": "WRnT9hGfg3oKfKtXa", "htmlBody": "<p>This is a useful list, thank you for writing it.<br><br>In terms of:</p><blockquote><p><strong>UK specific questions</strong></p><ul><li>Could the UK establish a new regulator for AI (similar to the Financial Conduct Authority or Environment Agency)? What structure should such an institution have? This question may be especially important because the UK civil service tends to hire generalists, in a way which could plausibly make UK AI policy substantially worse. &nbsp;</li></ul></blockquote><p>I wrote some coverage <a href=\"https://forum.effectivealtruism.org/posts/gKnRmfehJSGJRLJ8X/uk-ai-bill-analysis-and-opinion\">here</a> of <a href=\"https://bills.parliament.uk/bills/3519\">this bill</a> which seeks to do this, which may be useful for people exploring the above. Also well worth watching and not particularly well covered right now is how AUKUS will affect AI Governance internationally. I'm currently preparing a deeper dive on this as a post, but for people researching UK-specific governance it's a good head start to look at these areas as ones where not a lot of people are directing effort.</p>", "parentCommentId": null, "user": {"username": "AI Law"}}, {"_id": "GH2iAYCPqssyS4Sya", "postedAt": "2024-03-12T15:43:16.514Z", "postId": "WRnT9hGfg3oKfKtXa", "htmlBody": "<p><strong>Executive summary:</strong> This document compiles a list of research agendas and questions in AI governance that could be important for reducing existential risk, covering topics such as regulation, compute governance, corporate governance, international agreements, misuse, evaluation, China, information security, strategy and forecasting, and post-TAI governance.</p><p><strong>Key points:</strong></p><ol><li>AI regulation questions focus on estimating the effects of regulatory interventions, and exploring specific issues in the UK, US, and EU.</li><li>Compute governance questions examine failure modes and alternative bottlenecks to AI development besides compute.</li><li>Corporate governance questions look at the track record of governance tools like ethics boards, responsible scaling policies, and industry standards.</li><li>International governance questions explore distinguishing features of effective treaties and drivers of regulatory arbitrage.</li><li>Misuse questions focus on empirical evidence for the likelihood of existential risk from AI misuse by malicious actors.</li><li>Evaluation questions consider how to ensure the integrity of AI system assessments and how to integrate governance.</li><li>China questions examine the relative AI capabilities of China vs. the US/allies and the implications for racing dynamics and governance.</li><li>Information security questions look at how infosec concerns affect firm behavior, deterrence of cyattacks, and offensive/defensive dynamics.</li><li>Strategy and forecasting questions aim to anticipate AI progress while grounding predictions in solid empirical and theoretical methodology.</li><li>Post-TAI governance questions explore issues like the legal status of digital minds and the threat of AI-enabled misinformation to democracy.</li></ol><p>&nbsp;</p><p>&nbsp;</p><p><i>This comment was auto-generated by the EA Forum Team. Feel free to point out issues with this summary by replying to the comment, and</i><a href=\"https://forum.effectivealtruism.org/contact\"><i>&nbsp;<u>contact us</u></i></a><i> if you have feedback.</i></p>", "parentCommentId": null, "user": {"username": "SummaryBot"}}]