[{"_id": "2s9EQQFsMLb5Juthk", "postedAt": "2022-11-30T23:07:56.282Z", "postId": "WRvdL9jsXdBerWgte", "htmlBody": "<p>My non-EA group chats, mostly finance professionals, are tearing this apart. His claimed lack of knowledge of a number of key metrics and figures is not credible. The real estate question about his parents got an even more heat (I think justifiably so).&nbsp;</p>", "parentCommentId": null, "user": {"username": "Daedalus"}}, {"_id": "Dfk9ibyKpkFXfpajT", "postedAt": "2022-11-30T23:21:17.010Z", "postId": "WRvdL9jsXdBerWgte", "htmlBody": "<p>I wrote a <a href=\"https://forum.effectivealtruism.org/posts/yFfTbT7oWxSadNJQq/sbf-s-recent-live-interview-at-the-dealbook-summit\">post</a> as a summary in parallel of the interview.</p>", "parentCommentId": null, "user": {"username": "agucova"}}, {"_id": "nkyGin2Pu5eTKdApg", "postedAt": "2022-11-30T23:30:32.367Z", "postId": "WRvdL9jsXdBerWgte", "htmlBody": "<p>Background: I practiced securities litigation in the post 2008 time period. I don't know Sam personally, though I've had some chats with him over the years. My assessment of his impact on the movement I am most involved in - animal rights - is mostly negative, though I think his negative impacts were very well intentioned.&nbsp;<br><br>I disagree with Daedelus's comment that Sam's statements were not credible. I have worked with much larger and more sophisticated financial institutions which, when caught up in a mania (or a panic), had similarly poor controls.&nbsp;<br><br>I thought Sam came across as credible and honest.&nbsp;<br><br>I'd also add that, the fact that he spoke openly about the collapse, is a strong sign to me that there was not bad intent. Lawyers will almost always tell people not to say anything once litigation, much less criminal prosecution, is a possibility. (I have given many clients this advice myself and, indeed, there is a thread in this forum giving the same advice.) That advice is not unreasonable, if your goal is just self interest and preservation. But the fact that he was willing to speak openly about this, in direct contradiction to his lawyers' advice, suggests strongly that his intentions are good.&nbsp;<br><br>I'd go so far as to call it brave.&nbsp;<br><br>I have a personal friend who lost his entire savings in the collapse of FTX. It's a terrible thing. But I don't know that this is a case of fraud. Seems just as likely, if not moreso, that this is just a classic bank run.&nbsp;</p>", "parentCommentId": null, "user": {"username": "wayne"}}, {"_id": "HtxGHLgGL95a9XT7a", "postedAt": "2022-12-01T00:21:35.873Z", "postId": "WRvdL9jsXdBerWgte", "htmlBody": "<blockquote><p>I have a personal friend who lost his entire savings in the collapse of FTX. It's a terrible thing. But I don't know that this is a case of fraud. Seems just as likely, if not moreso, that this is just a classic bank run.&nbsp;</p></blockquote><p>An exchange that promises to \"never invest customer deposits\" cannot be subject to a bank run, as far as I can tell. Banks can be subject to bank runs because they practice fractional reserve banking. Crypto exchanges are not allowed to do that.&nbsp;</p><p>Many different sources have now indicated that he knowingly used customer deposits to cover Alameda liabilities, which really seems like a very straightforward case of fraud.</p>", "parentCommentId": "nkyGin2Pu5eTKdApg", "user": {"username": "Habryka"}}, {"_id": "7vatyW8KNmiexa2ti", "postedAt": "2022-12-01T01:07:24.748Z", "postId": "WRvdL9jsXdBerWgte", "htmlBody": "<p>Exactly. <s>The terms and conditions said that deposited funds were not being lent to Alameda (\"FTX Trading\"), </s>The terms and conditions said that title of digital assets would belong to the user, and not transfer to, or be loaned to FTX trading. Which would seem to make impossible loaning these funds from FTX trading to Alameda (end edit) whereas Sam said in today's NYT/CNBC interview that FTX allowed Alameda to take out an $8B line of credit, using I think money that was not given to FTX for lending. It immediately looks like he defrauded his customers.</p><p>In today's interview with NYT/CNBC Sam tried out a few defenses:&nbsp;</p><ul><li>there was another line in the T&amp;C that allowed this (sounds dubious absent further details)</li><li>FTX didn't have visibility into the size of Alameda's loans on its own dashboard; only Alameda knew about the loan (implausible; he was housemates with Alameda's CEO, who talked about these borrowed funds at a leaked company meeting during the collapse - to which he simply said that he wouldn't be able to clarify others' comments), and</li><li>Alameda was a small fraction of trading activity, and he paid attention to this rather than the size of the line of credit (also super implausible - how can one not be aware of a multibillion dollar line of credit?).&nbsp;</li></ul><p>So I don't see how any of these defenses work. There's also a question of if he defrauded customers, how long this was going on for. When asked when the comingling of funds began, he just talked about it getting bigger from mid-2022. That would mean at least four months, but the fact that he didn't give it a straight answer at least suggests to me that this might have actually begun significantly before that, possibly years.</p><p>&nbsp;You can also look at the predictions <a href=\"https://www.metaculus.com/questions/13653/ftxalameda-leadership-felony-convictions/\">here</a>, <a href=\"https://www.metaculus.com/questions/13532/sbf-prison-sentence-length/\">here</a>, <a href=\"https://manifold.markets/jack/will-we-believe-sbf-committed-willf\">here</a>, <a href=\"https://manifold.markets/andrew/will-sbf-be-criminally-charged-conn\">here</a>, and <a href=\"https://manifold.markets/VivaLaPanda/will-sbf-be-imprisoned-before-2030\">here</a>, which collectively suggest that Sam committed fraud, and is likely to be criminally charged and spend years in prison. Personally, if he's not imprisoned, I personally would guess it's &gt;50% that avoided facing the US justice system altogether, by somehow avoiding extradition.</p>", "parentCommentId": "HtxGHLgGL95a9XT7a", "user": {"username": "RyanCarey"}}, {"_id": "s7q7xuhK7rSSWTDGR", "postedAt": "2022-12-01T01:35:04.603Z", "postId": "WRvdL9jsXdBerWgte", "htmlBody": "<p>It seems like FTX offered borrowing and lending to its clients, and this was prominently marketed. &nbsp;I don't think you can call FTX offering margin loans to Alameda a \"straightforward case of fraud\" if they publicly offer margin loans to all of their clients. (There may be other ways in which their behavior was straightforwardly fraudulent, especially as they were falling apart, but I don't know.)</p><p>In general brokers can get wiped out by risk management failures. I agree this isn't just an \"ordinary bank run,\" the bank run was just an exacerbating feature once the damage had already been done.</p><p>\"Never invest customer deposits\" sounds like a misleading tweet. In the conversation with Kelsey, SBF clarifies that he meant that <i>FTX</i> never invests customer deposits, that it is just acting as an exchange that facilitates borrowing and lending between its customers one of whom was Alameda. I think this is probably technically true but misleading.</p><p>It seems like there are two distinctive problems:</p><ol><li>By November 2 Alameda's collateral looks like it was very bad. Nominally the market value might have exceeded their liabilities, but it was exceptionally illiquid even before considering the fact that a lot of it was FTT and hence correlated with FTX solvency. They were evidently not automatically liquidated as any normal customer would be, and it sounds like their liabilities were not tracked by the normal system at all.<br><br>If this was just a huge risk management and accounting failure that would be merely bad, but the beneficiary was a hedge fund mostly owned by SBF whose leadership he had a close relationship with. From the outside it looks quite likely that they knew this was a possibility, but didn't want to liquidate Alameda after its losses in 2022 (or perhaps deliberately avoided getting clarity about the accounting situation?) because they had a good chance of making money during a market recovery and wanted to take one last gamble at the customer's expense.<br><br>This isn't technically FTX investing customer's money, but the risk management is so bad, the joint ownership so extreme, and the organizational boundaries so blurred by bad accounting, that it seems likely to be willful negligence and fair to say that they were effectively investing customer money.<br>&nbsp;</li><li>I assume FTX also didn't pay back customers who weren't participating in asset lending &nbsp;and who weren't getting paid interest on their deposits. I don't actually know details here, either about FTX or about finance in general, &nbsp;and they would affect my view about how bad this part was (though point 1 is bad at any rate). My guess is that it this outcome was basically inevitable once the exchange was having liquidity problems (I'd have been surprised if they halted withdrawals for margin accounts while they still had a ton of $ and liquid coins in other accounts) and the question is just how much of a betrayal that is.<br><br>For normal brokerage accounts, my vague sense of expectations is that margin accounts would be at risk of going down with the exchange, whereas normal accounts wouldn't. I don't know if that expectation is grounded in legal reality. I don't know if FTX had any such distinction.<br><br>I would guess that &nbsp;FTX customers had the choice to opt in to lending, though I wouldn't be surprised if it was opt-out or if uptake of lending was very large. And legally I don't know if customers who don't use margin accounts or who don't click the \"lend asset\" box or whatever are supposed to be protected (kind of like more senior creditors). Morally it seems like they have a reasonable expectation of not losing it but I expect this is also not straightforward fraud.</li></ol><p>Overall my sense is that this is probably not straightforward fraud, but I don't know and would appreciate a bit more clarity.</p>", "parentCommentId": "HtxGHLgGL95a9XT7a", "user": {"username": "Paul_Christiano"}}, {"_id": "houHDosokeYyCARFS", "postedAt": "2022-12-01T01:40:48.244Z", "postId": "WRvdL9jsXdBerWgte", "htmlBody": "<p>Doesn't FTX pay interest on deposits and prominently offer margin loans? Do you have a citation for the claim that the terms of service excluded the prospect of lending? (All I've seen are some out-of-context screenshots.)</p><p>Why do you say \"Alameda (FTX trading)\"? Aren't these just separate entities?</p>", "parentCommentId": "7vatyW8KNmiexa2ti", "user": {"username": "Paul_Christiano"}}, {"_id": "nyY7zdzfKGuKJwsHL", "postedAt": "2022-12-01T01:50:47.018Z", "postId": "WRvdL9jsXdBerWgte", "htmlBody": "<p>Thanks for these replies.&nbsp;</p><p>I haven't seen any evidence that FTX promised to never invest customer deposits. Does anyone have a link? My understanding is that FTX offered customers the opportunity to make leveraged trades, i.e., to bet more than the money they had in their accounts. This suggests to me that FTX was not just an exchange but a lender, which is a very different sort of financial beast (with a different risk profile). I also understand that there was a significant interest rate on the customer accounts -- 6% -- which adds weight to that conclusion. You can't get a return on investment without risk.&nbsp;<br><br>I'd also love to see links to the terms of service, as I've seen many state that Sam violated the terms of service but little evidence to that effect. I've seen one document that indicated the property of customers was their own. That's not legally dispositive of the issue, as FTX never claimed to have an ownership interest in the customer deposits. The question is what it was allowed to do with customer deposits and, for example, whether it was required to keep segregated accounts. Far larger and more sophisticated entities, like MF Global, have failed with account segregation, so it would not surprise me if FTX failed as well.<br><br>The basic problem is this. Even if you WANT to prevent yourself from using customer deposits, if you are a lender to various account holders (including ordinary retail customers) and you are not properly segregating the funds, then when a bunch of people borrow money from you, beyond what they invested into their account, they will inevitably tap into the money of other customers. Corporate controls, account segregation, etc will prevent this. But early stage companies very often fail with this sort of thing because it's hard, and often very labor intensive. I can see FTX not imposing a limit on Alameda's right to leverage because: (a) they were overconfident in the ability of Alameda to manage risk; &nbsp;(b) they never thought that Alameda's leverage would dip into the amount other customers needed; and/or (c) they assumed incorrectly that some form of legal segregation of accounts would prevent the technical removal of customer accounts from happening.&nbsp;</p><p>I don't know what the right answer is to any of these questions. What I do know, having looked at the inside of collapsing financial institutions, is that it is far far far more complicated than most people think. It is one of the reasons why there was no criminal prosecution in the MF Global case, despite what seemed to me far clearer evidence of wrongful conduct.&nbsp;</p><p>Re: prediction markets, they are interesting, and I hadn't seen them before. Slightly moves my needle towards actual fraud, maybe back to 75-25. But I'm not sure this is a scenario where we should expect prediction markets, at least in the short term, to be particularly reliable, due to herding effects. See <a href=\"https://statmodeling.stat.columbia.edu/2019/11/10/when-prediction-markets-fail/\">here</a>.&nbsp;</p>", "parentCommentId": "7vatyW8KNmiexa2ti", "user": {"username": "wayne"}}, {"_id": "wsqGPccPayoeJ3Liz", "postedAt": "2022-12-01T01:50:49.755Z", "postId": "WRvdL9jsXdBerWgte", "htmlBody": "<p>It's reported here:\n<a href=\"https://www.axios.com/2022/11/12/ftx-terms-service-trading-customer-funds\">https://www.axios.com/2022/11/12/ftx-terms-service-trading-customer-funds</a></p>\n<p>I've heard (unverified) that customer deposits were $16B and voluntary customer lending &lt;$4B. It would make sense to me that a significant majority of customer funds were <em>not</em> voluntarily lent, based on the fact that returns from lending crypto were minimal, and lending was opt-in, and not pushed hard on the website.</p>\n", "parentCommentId": "houHDosokeYyCARFS", "user": {"username": "RyanCarey"}}, {"_id": "GnBbvhHJgDoduBasG", "postedAt": "2022-12-01T01:54:03.965Z", "postId": "WRvdL9jsXdBerWgte", "htmlBody": "<p>Per the screenshot at tweet 17 of <a href=\"https://twitter.com/adamscochran/status/1593020920695660546\">this </a>thread, it seems like 2.8B of customer assets were opted-in to lending. Not nearly enough to explain the amount that went to Alameda.</p>", "parentCommentId": "s7q7xuhK7rSSWTDGR", "user": {"username": "Jason"}}, {"_id": "TCyLPQBbKMGRWm76Q", "postedAt": "2022-12-01T01:54:13.010Z", "postId": "WRvdL9jsXdBerWgte", "htmlBody": "<blockquote>\n<p>Why do you say \"Alameda (FTX trading)\"? Aren't these just separate entities?</p>\n</blockquote>\n<p>You're right - fixed.</p>\n", "parentCommentId": "houHDosokeYyCARFS", "user": {"username": "RyanCarey"}}, {"_id": "PKQLYCh8ZvaHSXam8", "postedAt": "2022-12-01T01:56:14.391Z", "postId": "WRvdL9jsXdBerWgte", "htmlBody": "<p>I would also add, as a long time criminal defendant myself and someone who is very much against mass incarceration, that I may have a bias here, as I do not want to see anyone sent to prison. Even my worst enemy. Jails and prisons are cruel places, and there is relatively little evidence (if any) that they serve any rehabilitative purpose. That may be biasing my assessment of Sam because I do not WANT to see him (or anyone else, really) in prison.&nbsp;</p>", "parentCommentId": "nyY7zdzfKGuKJwsHL", "user": {"username": "wayne"}}, {"_id": "5ZLxtpjcKB2R6y6Gk", "postedAt": "2022-12-01T01:58:07.048Z", "postId": "WRvdL9jsXdBerWgte", "htmlBody": "<blockquote><p>It seems like FTX offers borrowing and lending to its clients, and this was prominently marketed. &nbsp;I don't think you can call FTX offering margin loans to Alameda a \"straightforward case of fraud\" if they publicly offer margin loans to all of their clients. (There may be other ways in which their behavior was straightforwardly fraudulent, especially as they were falling apart, but I don't know.)</p></blockquote><p>I think Matt Levine mentioned something similar, but I don't think I understand this, so let me try to get some more clarity on this by thinking through it step-by-step.</p><p>I think there are two separate documents here whose representation might have been fradulent:&nbsp;</p><p>1. The tweet by Sam Bankman Fried (or FTX Official, I don't remember, and I think it's now deleted) that said \"We never invest customer deposits, not even in something as secure as treasuries\"</p><p>Like, if you use your customer funds to finance loans to other clients, then clearly this does not count as \"never investing customer deposits\", since you did just invest your customer deposits into a loan to another client. And while there was no legal contract signed in this case, I think this presentation is quite deceptive, and seems pretty fradulent to me (though to what degree things said on Twitter should be legal fraud, and what the actual scale of the liability for this is, seems quite unclear to me).</p><p>I do think calling this fraud, or at least \"fradulent marketing\" seems accurate to me, and I would be pretty surprised if nobody somehow gets fined for this, though the magnitude seems likely to be much less than the full position.</p><p><strong>2. The FTX Terms of Service</strong></p><p>The <a href=\"https://help.ftx.com/hc/en-us/article_attachments/9719619779348/FTX_Terms_of_Service.pdf\">FTX Terms of Service</a> seem to have a few different things in them that pertain to the stuff that happened. The most relevant piece I could find is:&nbsp;</p><blockquote><p>Any available Assets held in your Account is available to be locked and used as collateral for margin trading, or to fund trades, in relation to any Services or part thereof offered through the Platform by FTX Trading or its Affiliates.</p></blockquote><p>This pretty clearly says that your funds can be used as collateral for margin trading or to fund trades, though it is quite ambiguous about whether it's used as collateral for you, or for the position of other clients (or Alameda) in this case.</p><p>It wouldn't surprise me if this happened to be written intentionally ambiguously, though people with more finance experience might have better takes here. When reading this the first time, I definitely thought this was trying to say \"we might use any assets in your account as collateral for your other trades\", not \"we might use any assets in your account as collateral for some random other person's trades\".</p><p>The Terms of Service also say:&nbsp;</p><blockquote><p>(A) Title to your Digital Assets shall at all times remain with you and shall not transfer to FTX Trading. As the owner of Digital Assets in your Account, you shall bear all risk of loss of such Digital Assets. FTX Trading shall have no liability for fluctuations in the fiat currency value of Digital Assets held in your Account.&nbsp;</p><p>(B) None of the Digital Assets in your Account are the property of, or shall or may be loaned to, FTX Trading; FTX Trading does not represent or treat Digital Assets in User’s Accounts as belonging to FTX Trading.&nbsp;</p><p>(C) You control the Digital Assets held in your Account. At any time, subject to outages, downtime, and other applicable policies (including the Terms), you may withdraw your Digital Assets by sending them to a different blockchain address controlled by you or a third party.</p></blockquote><p>This is a pretty tricky section. The ToS is between the client and FTX Trading, so it sure seems that somehow in the process of sending those assets to Alameda, it had to somehow enter the possession of FTX Trading.&nbsp;</p><p>I do have trouble understanding of how somehow FTX could end up with less than the depositors money/tokens in the bank/blockchain without somehow violating this part of the service agreement. Like, maybe there is some legal trickery where you get to say that due to the use of the customer funds as a collateral the assets directly transferred from client to Alameda or something, or to the trading partners of other clients who made a loss, but that sure seems like a huge stretch, and I feel like this section just straightforwardly says that if somehow FTX ended up sending a fraction of the customer deposits to any external party, whether it is to cover some losses or not, then they violated the ToS.</p><p>I can imagine there being some fancy legal defense here, but at least to me it looks really pretty clear. The ToS said that no assets deposited in FTX shall transfer to FTX Trading. Even if they were used as collateral, in the moment that FTX actually sends them to the debtor, they have to transfer through FTX Trading (who is the liable party), and as such violate the ToS.</p><p>So doing some more direct research here, both the public marketing statements made on Twitter, and the ToS seem to have been violated by the actual actions of FTX, though both sure could have some loophole that actually makes this a non-straightforward case of fraud, but at least I can't currently see any obvious loopholes (though someone with more legal experience very well might).</p><p>As I currently understand, the ToS basically committed FTX to cover the potential losses from leveraged trades <i>using its own profits or the assets of the users who had lending explicitly enabled</i>. Since they were committed to never take ownership over the assets that did not explicitly have lending enabled.&nbsp;</p><p>About $3B of the customer funds did seem to have lending enabled, and I think sending those to Alameda was likely fair game, though they can't cover close to the full amount, as far as I can tell.</p>", "parentCommentId": "s7q7xuhK7rSSWTDGR", "user": {"username": "Habryka"}}, {"_id": "r3v3f2e2XdYE7ey9z", "postedAt": "2022-12-01T02:02:01.854Z", "postId": "WRvdL9jsXdBerWgte", "htmlBody": "<blockquote><p>I haven't seen any evidence that FTX promised to never invest customer deposits.</p></blockquote><p>Here is a screenshot of the (now deleted) Tweet where SBF claims FTX does not invest customer deposits:&nbsp;</p><figure class=\"image\"><img src=\"https://pbs.twimg.com/media/FhqRDhLVsAAAwwu?format=png&amp;name=900x900\" alt=\"Bild\"></figure><p>Here is the relevant section of the FTX ToS:&nbsp;</p><blockquote><p>(A) Title to your Digital Assets shall at all times remain with you and shall not transfer to FTX Trading. As the owner of Digital Assets in your Account, you shall bear all risk of loss of such Digital Assets. FTX Trading shall have no liability for fluctuations in the fiat currency value of Digital Assets held in your Account.&nbsp;</p><p>(B) None of the Digital Assets in your Account are the property of, or shall or may be loaned to, FTX Trading; FTX Trading does not represent or treat Digital Assets in User’s Accounts as belonging to FTX Trading.&nbsp;</p></blockquote>", "parentCommentId": "nyY7zdzfKGuKJwsHL", "user": {"username": "Habryka"}}, {"_id": "Y65ecHxd7r98vK8EE", "postedAt": "2022-12-01T02:06:34.756Z", "postId": "WRvdL9jsXdBerWgte", "htmlBody": "<p>I disagree with the legal conclusion in the Axios article, as someone who has litigated securities fraud cases. The relevant language isn't &nbsp;dispositive to me. This appears to be the key term:&nbsp;<br><br><i>None of the Digital Assets in your Account are the property of, or shall or may be loaned to, FTX Trading; FTX Trading does not represent or treat Digital Assets in User’s Accounts as belonging to FTX Trading.</i><br><br>There are a few issues with trying to say this proves that using customer accounts (e.g., for Alameda) is a violation of the terms of service. First, the provision only states that FTX trading cannot be the recipient of a loan. It does not say other account holders cannot be the recipient of a loan. Second, using non-segregated customer deposits for another customer's leveraged trading may not be a loan. This is something I would have to legally research, but the usage of a customer's funds is probably considered something like a bailment and not a loan. For example, there's no principal or interest.&nbsp;</p><p>I'm honestly not particularly interested in the terms of service, however, in determining whether Sam committed fraud. I'm more interested in how FTX was marketing its product, and whether it promised risk-free deposits. Most people do not read the terms of service, and if FTX promised account segregation and risk-and-interest free deposits, I would say that there's a greater argument that Sam committed fraud -- rather than poor risk management.&nbsp;</p><p>Separately, assuming you are the same Ryan Carey I met many years ago, it's nice to speak to you again. Hope all is well.&nbsp;</p>", "parentCommentId": "wsqGPccPayoeJ3Liz", "user": {"username": "wayne"}}, {"_id": "ebLuyKxZ6iTma3E3a", "postedAt": "2022-12-01T02:09:10.594Z", "postId": "WRvdL9jsXdBerWgte", "htmlBody": "<p>I think what Sam is saying here is true, if customer deposits are being used as leverage and not as investments.&nbsp;</p><p>It's arguably a bit misleading, if Alameda was a customer with a seemingly unlimited line of credit. Bu t what Sam is saying is still true.&nbsp;</p><p>I respond to the TOS points above. But to me -- and I could be wrong on this, as I have not been in securities litigation for many years -- the terms of service aren't really dispositive.&nbsp;</p>", "parentCommentId": "r3v3f2e2XdYE7ey9z", "user": {"username": "wayne"}}, {"_id": "FKFr2TnhGadfj5Erx", "postedAt": "2022-12-01T02:13:42.713Z", "postId": "WRvdL9jsXdBerWgte", "htmlBody": "<p>Either brave and innocent, or incredibly naive and conceited.&nbsp;</p><p>I will say that <i>if </i>he's guilty of massive and repeated fraud, this kind of performance is how you potentially get a lifetime achievement award from a U.S. District Court. Well, technically only de facto life like Madoff's 150 years, since I doubt any potential charges have an actual life sentence.&nbsp;</p><p>Keeping a low profile is expected and won't be held against you at sentencing. Going on a media tour proclaiming your innocence when you are flagrantly guilty is not going to sit well with the judge.</p>", "parentCommentId": "nkyGin2Pu5eTKdApg", "user": {"username": "Jason"}}, {"_id": "KdiTebJtW7yCSSWmd", "postedAt": "2022-12-01T02:19:01.913Z", "postId": "WRvdL9jsXdBerWgte", "htmlBody": "<p>Agreed on how interviews will play with a judge. If there is evidence of his guilt, and he went on Dealbook to double down on his fraud, that is going to affect sentencing significantly. Speaking publicly about the case is a pretty good signal that Sam <strong><u>genuinely</u></strong> does not think he has criminal liability.&nbsp;</p>", "parentCommentId": "FKFr2TnhGadfj5Erx", "user": {"username": "wayne"}}, {"_id": "7HWckAYnBptx3iF5K", "postedAt": "2022-12-01T02:31:49.653Z", "postId": "WRvdL9jsXdBerWgte", "htmlBody": "<blockquote><p>I haven't seen any evidence that FTX promised to never invest customer deposits. Does anyone have a link? My understanding is that FTX offered customers the opportunity to make leveraged trades, i.e., to bet more than the money they had in their accounts. This suggests to me that FTX was not just an exchange but a lender, which is a very different sort of financial beast (with a different risk profile). I also understand that there was a significant interest rate on the customer accounts -- 6% -- which adds weight to that conclusion. You can't get a return on investment without risk.&nbsp;</p></blockquote><p>The issue is that as a user of FTX, you were supposed to be able to choose whether your money was being lent out or not - e.g. there was a \"lend/stop lending\" button in the interface. It seems totally reasonable to me that FTX loses your money if you lend it. But my current impression is that the amount lent to, and lost by, Alameda was much more than the amount that users agreed to have lent out. Agree that segregation of funds, if implemented properly, would solve the problem here.</p>", "parentCommentId": "nyY7zdzfKGuKJwsHL", "user": {"username": "RyanCarey"}}, {"_id": "eoEWcBRuX6uYspiXR", "postedAt": "2022-12-01T02:40:11.068Z", "postId": "WRvdL9jsXdBerWgte", "htmlBody": "<p>&nbsp;. . . or thinks he can talk his way out of it, like many more ordinary criminal targets who are arrested but decide to talk to the police investigator. People even choose to talk to grand juries when they know they are a target.</p>", "parentCommentId": "KdiTebJtW7yCSSWmd", "user": {"username": "Jason"}}, {"_id": "JgrnrmhGBrQyw4pxN", "postedAt": "2022-12-01T02:54:56.934Z", "postId": "WRvdL9jsXdBerWgte", "htmlBody": "<p>I don't see this screenshot as evidence as to the amount that FTX was entitled to use for other customers' leverage, including Alameda. It seems to be a snapshot of current margin lending?<br><br>If the point of this screenshot is to show there was hidden margin lending to Alameda, that wasn't being disclosed, fair point. But it's possible that Alameda had a special vehicle that wasn't picked up on the dashboard because of the size of its allowed margin and because FTX (arrogantly) figured that Alameda was involved in relatively risk-free trading. That seems to be what it was started to do - engage in supposedly \"risk-free\" arbitrage.&nbsp;</p><p>The notion of risk-free arbitrage is probably incorrect. But Sam would not be the first person to believe in it.&nbsp;</p><p>&nbsp;</p><figure class=\"image\"><img src=\"https://pbs.twimg.com/media/FhuMFTHVsAI2CUJ?format=png&amp;name=small\" alt=\"Image\"></figure>", "parentCommentId": "GnBbvhHJgDoduBasG", "user": {"username": "wayne"}}, {"_id": "emwCesvRSGyLzHfNG", "postedAt": "2022-12-01T02:58:02.984Z", "postId": "WRvdL9jsXdBerWgte", "htmlBody": "<p>FTX's legitimate operation -- for those who didn't opt in to lending -- was supposed to be like a valet parking service. \"The terms of service didn't <i>explicitly say</i> I couldn't lend out your car to the local dragracing club\" is not a good defense to an argument that the valet converted the customer's car. You need actual permission from the car/crypto owner to do that.</p>", "parentCommentId": "Y65ecHxd7r98vK8EE", "user": {"username": "Jason"}}, {"_id": "wWJtnifzDWEgCj2D7", "postedAt": "2022-12-01T06:34:41.876Z", "postId": "WRvdL9jsXdBerWgte", "htmlBody": "<p>It seems significant if only $3B of customers were earning interest on cash or assets, and the other customers had the option to opt in to lending but explicitly did not. I think all the other customers would have an extremely reasonable expectation of their assets just sitting there. &nbsp;I'm not super convinced by the close reading of the terms of service but it seems like the common-sense case is strong.</p><p>I'm interested in understanding that $3B number and any relevant subtleties in the accounting. &nbsp;I feel like if that number had been $15B then this would plausibly just be a failure of risk management, in which case I guess that number is central to the clear-cut fraud vs willful negligence question. The $3B estimate seems plausible but all I've seen is an out of context screenshot which is not great.</p>", "parentCommentId": "5ZLxtpjcKB2R6y6Gk", "user": {"username": "Paul_Christiano"}}, {"_id": "8v69YQvgQxe29bGwZ", "postedAt": "2022-12-01T08:47:31.606Z", "postId": "WRvdL9jsXdBerWgte", "htmlBody": "<p>Yeah, I also don't have anything else better.&nbsp;</p><p>I am piecing some of this together from this alleged report of someone who worked at in the two days before the end, from which I inferred that Caroline and Sam knew that they took an unprecedented step when they loaned that customer money that nobody knew about, which seems like it just wouldn't really be the case if they had only used money from the people who had lending enabled: <a href=\"https://twitter.com/libevm/status/1592383746551910400\">https://twitter.com/libevm/status/1592383746551910400</a>&nbsp;</p><p>I am definitely very interested in a better estimate of how many customers had lending enabled (but even separately from that, given various other aspects of FTX's finances, it seems very likely that the people who did deposit their money as non-lending in FTX will not get their money back, which seems like it would have required some kind of transfer of ownership from clients to FTX at some point, and therefore violating the ToS).</p>", "parentCommentId": "wWJtnifzDWEgCj2D7", "user": {"username": "Habryka"}}, {"_id": "GKLufainq3fRcxBbE", "postedAt": "2022-12-01T09:29:03.185Z", "postId": "WRvdL9jsXdBerWgte", "htmlBody": "<blockquote><p>I am definitely very interested in a better estimate of how many customers had lending enabled</p></blockquote><p>&nbsp;</p><p>I am curious as to how this would be decision-relevant at this moment.<br><br>It seems to me that there's a lot of information that will surface in the next months and years (random example: context behind the <a href=\"https://twitter.com/BrettHarrison88/status/1574782901748727809\">FTX US President stepping down</a> the <a href=\"https://twitter.com/sbf_ftx/status/1575112446460588035\">day before a suspicious (in hindsight) transaction</a>).</p><p>To me, the best thing to do seems to be to just wait for the judicial proceedings and for information to surface.<br>&nbsp;</p>", "parentCommentId": "8v69YQvgQxe29bGwZ", "user": {"username": "Lorenzo Buonanno"}}, {"_id": "HYaDHeoLH8ReS2uaQ", "postedAt": "2022-12-01T18:51:09.789Z", "postId": "WRvdL9jsXdBerWgte", "htmlBody": "<p>One important accounting complexity is that there might be a lot of futures contracts that effectively represent borrow/lend without involving physical borrowing or lending. My impression is that FTX offered a lot of futures so this could be significant.</p><p>For example, a bunch of people might have had long BTC futures contracts, with Alameda having the short end of that contract. If Alameda is insolvent then it can't pay its side of the contract; usually FTX (which is both broker and clearinghouse) would make a margin call to ensure that Alameda has enough collateral to pay, but it is clear that FTX was completely irresponsible about Alameda's collateral.</p><p>So it would be nice to know the volume of futures contracts, in addition to the $3B of borrow/lend. CoinGecko <a href=\"https://www.coingecko.com/en/exchanges/ftx\">currently lists</a> open interest of $2.5B, but I don't know if that number is accurate or if there are other subtleties, and moreover I could imagine that the number was significantly larger prior to the collapse.</p><p>No matter how large the futures volume, this would still leave point 2 above as a complaint. If the FTX clearinghouse was failing, then I think morally they should just admit it. Probably what would happen instead is that they would desperately try to make customers whole including by liquidating other customers whose assets weren't theirs to liquidate &nbsp;(especially given that if they do so successfully and FTX mostly recovers then they will ultimately be solvent).</p>", "parentCommentId": "5ZLxtpjcKB2R6y6Gk", "user": {"username": "Paul_Christiano"}}, {"_id": "Fw8AuvtdjS6HWnLSX", "postedAt": "2022-12-01T19:03:58.989Z", "postId": "WRvdL9jsXdBerWgte", "htmlBody": "<p>Another issue is the fiat that FTX owed customers. I think FTX did not say that the $ were being held as deposits (e.g. I think the terms of service explicitly say they aren't). Those numbers in accounts just represent the $ that FTX owes its customers. And if the main problem was a -$8B fiat balance, then it's less clear any of the expectations about assets and lending matters.</p><p>The statement \"we never invest customer funds\" is still deeply misleading but it's more clear how SBF could spin this as not being an outright lie: he could ask (i) \"How much cash are we owed?\" (ii) \"How much cash do we owe?\" (iii) \"How good is collateral for the cash we are owed?\" If the first number is larger than the second, and the collateral is good enough, then I think it's not too surprising if you aren't even tracking individual customer $ or thinking about where money is coming from, you are just adding up entries in a spreadsheet and saying \"we are a net lender to customers, not a net borrower.\"</p><p>I find this particularly unsurprising if lots of customers have negative fiat balances (which I expect was the case). For a reasonable broker I expect the <i>sum</i> of all the customer fiat balances to be equal the amount of fiat that the broker has on hand. I don't particularly expect FTX to have more $ on hand than the sum of all <i>positive</i> customer balances. (E.g. I wouldn't expect my broker to have so much $ on hand.)</p><p>But again, I think that the willfully negligent accounting and risk management is a big deal, and the distinction between \"customers owe money, with reasonable collateral posted that we could liquidate at any time\" and \"we've bought a bond and have no collateral at all\" is <i>entirely</i> &nbsp;about the quality and liquidity of the collateral. So this whole discussion is just about whether there needs to be additional fraud, or whether there's a reasonable description of the whole thing as willfully negligent risk management.</p>", "parentCommentId": "5ZLxtpjcKB2R6y6Gk", "user": {"username": "Paul_Christiano"}}, {"_id": "kkFet2hdab3re48oZ", "postedAt": "2022-12-01T19:05:29.004Z", "postId": "WRvdL9jsXdBerWgte", "htmlBody": "<p>None of this is decision-relevant for me and waiting a few months or years makes complete sense, but alas \"interesting\" != \"decision-relevant.\"</p>", "parentCommentId": "GKLufainq3fRcxBbE", "user": {"username": "Paul_Christiano"}}, {"_id": "bBxZBRtFwAXHtoDC2", "postedAt": "2022-12-01T19:40:52.950Z", "postId": "WRvdL9jsXdBerWgte", "htmlBody": "<p>Many people have to make plans about the future of the EA community, as well as the future of their own organizations who might have received FTX funding.&nbsp;</p><p>Things like this seem to have a decent bearing on the total amount of clawbacks as well as the actual ethical lines that were crossed in the process of FTX, which seem highly relevant to me for learning from this mess.&nbsp;</p><p>I think a world where you loaned out a bunch of customer deposits who had explicitly said \"yes, you can lend out my customer deposits\" is very different than a world where you stole a bunch of people's money. Both are bad, but I think they imply pretty different levels of wrongdoing.</p><p>I think given the speed of lawsuits in cases like this we might not have much clearer information for many years, and at least I have many decisions to make that cannot wait a year that relate to things like this.</p><p>(Just to be concrete, at least my personal continued involvement in the EA community is pretty contingent on the details of what happened here, e.g. the degree to which the EA community was partially responsible for this mess, the degree to which it seems likely to learn from its mistakes, the ways the rest of the world will relate to the EA community after this, so in some sense most of my career feels currently on hold, so finding out more stuff earlier has very high information value for me)</p>", "parentCommentId": "GKLufainq3fRcxBbE", "user": {"username": "Habryka"}}, {"_id": "5adMnkdYeLT68rNM5", "postedAt": "2022-12-01T23:06:17.720Z", "postId": "WRvdL9jsXdBerWgte", "htmlBody": "<p>The question is whether FTX's leadership knowingly misled for financial gain, right? We know that thety said they <strong>weren't borrowing</strong> (T&amp;C) or <strong>investing</strong> (public statements) users' digital assets, and that <strong>Alameda played by the same rules</strong> as other FTX users. They then took $8B of user-loaded money (most of which <strong>users did not ask to be lent</strong>) and <a href=\"https://www.wsj.com/articles/ftx-tapped-into-customer-accounts-to-fund-risky-bets-setting-up-its-downfall-11668093732?mod=article_inline\">knowingly</a> lent it to Alameda, <strong>accepting FTT (approximately the company's own stocks) as collateral</strong>, to make big crypto bets. Seems like just based on that, they might have defrauded the user in 4+ different ways. I think \"we were net-lenders, and seemed to have enough collateral\" might (assuming it is true) be a (partally) mitigating factor for the fourth point, but not the others?</p>", "parentCommentId": "Fw8AuvtdjS6HWnLSX", "user": {"username": "RyanCarey"}}, {"_id": "xdao2Y5dLDAur3K3B", "postedAt": "2022-12-02T00:01:27.145Z", "postId": "WRvdL9jsXdBerWgte", "htmlBody": "<p>The picture I was suggesting is: FTX leaves customer assets in customer accounts, FTX owes and is owed a ton of $ as part of its usual operation as a broker + clearinghouse, Alameda in particular owes them a huge amount of $ and is insolvent (requiring negligence on both risk management and accounting), FTX ends up owing customers $ that FTX can't pay, FTX starts grabbing customer assets to try to meet withdrawals.</p><p>I'm still at maybe 25-50% overall chance that their conduct is similar to a conventional broker+exchange+clearinghouse except for the two points I raised: (i) extremely and probably willfully negligent risk management + accounting, (ii) selling customer assets to raise $ once they were insolvent, rather than owning up to the shortfall. I do think it's <i>probably</i> worse than that, but (i) is already bad enough that I expect SBF could end up in prison indefinitely.</p><p>I'm interested in having more answers, but expect it will all become clear in time and it's easier to just wait.</p><p>(Small point: it was bad for FTX to take FTT as collateral but I think they did so openly from all of their clients, <a href=\"https://help.ftx.com/hc/en-us/articles/360031149632-Collateral-Management\">see here</a>.)</p>", "parentCommentId": "5adMnkdYeLT68rNM5", "user": {"username": "Paul_Christiano"}}, {"_id": "pCdTppHiXQiuNGRCs", "postedAt": "2022-12-02T08:17:52.065Z", "postId": "WRvdL9jsXdBerWgte", "htmlBody": "<p>I'm really surprised to read this, thank you for sharing!</p><blockquote><p>the actual ethical lines that were crossed in the process of FTX, which seem highly relevant to me for learning from this mess.</p></blockquote><p>I think that whether fraud was committed or not, it seems to me now even clearer than before that we should never allow it, and we should make it even more of a priority to <a href=\"https://youtu.be/HY5gT9_7AMo?t=1465\">speak out against evil</a>.<br>Much like whether COVID actually came from a lab or not wouldn't change too much our attitude towards biosecurity, given that a significant probability that it came from a lab already justifies being very careful about that risk in the future.</p><blockquote><p>my personal continued involvement in the EA community is pretty contingent on the details of what happened here, e.g. the degree to which the EA community was partially responsible for this mess</p></blockquote><p>The EA community is like 20k people, I find it surprising to judge whether e.g. ARC (I assume you're more on the AI Safety side) would be more or less worthy of support based on whether &lt;~20 people stole money. Even \"EA leadership\" is a lot of people, and before this scandal I don't think many were including SBF (but indeed he was wrongly seen as a role model).</p><p>If it turned out that SBF indeed stole money, in what different ways would you try to do the most good?</p>", "parentCommentId": "bBxZBRtFwAXHtoDC2", "user": {"username": "Lorenzo Buonanno"}}, {"_id": "Gxfb9EpGPH3GaKJho", "postedAt": "2022-12-02T08:36:31.409Z", "postId": "WRvdL9jsXdBerWgte", "htmlBody": "<blockquote><p>I think that whether fraud was committed or not, it seems to me now even clearer than before that we should never allow it, and we should make it even more of a priority to <a href=\"https://youtu.be/HY5gT9_7AMo?t=1465\">speak out against evil</a>.</p></blockquote><p>Just to be clear, I think \"never commit fraud\" is not a good ethical guideline to take away from this (both in that it isn't learning enough from this situation, and in the sense that there are a lot of situations where you want to do fraud-adjacent things that are actually the ethical thing to do), as <a href=\"https://forum.effectivealtruism.org/users/habryka\">I've tried to argue in various other places on the forum</a>. I think I would be quite sad if that is the primary lesson we take away from this.</p><p>I do think there is something important in the \"speak out against evil\" direction, and that's the direction I am most interested in exploring.</p><blockquote><p>The EA community is like 20k people, I find it surprising to judge whether e.g. ARC (I assume you're more on the AI Safety side) would be more or less worthy of support based on whether &lt;~20 people stole money.&nbsp;</p></blockquote><p>I think the situation with OpenAI is quite analogous to the situation with FTX in terms of its harms for the world and the EA community's involvement, and sadly I do think Paul has contributed substantially to the role that OpenAI has played in the EA ecosystem, so that's a concrete way in which I think the lessons we learn here have a direct relevance to how I relate to ARC. I also think I feel quite similar about the Anthropic situation.</p><p>My support for EA is not conditional on nobody in EA being blameworthy. I am part of EA in order to improve the world. If EA makes the world worse, I don't want to invest in it, independently of whether any specific individual can clearly be blamed for anything bad. In as much as we give rise to institutions like FTX and OpenAI, it really seems like we should change how we operate, or cease existing, and I do think the whole EA thing seemed quite load-bearing for both OpenAI and FTX coming into existence.</p><blockquote><p>and before this scandal I don't think many were including SBF (but indeed he was wrongly seen as a role model).</p></blockquote><p>I think it would have been quite weird to not include SBF in \"EA Leadership\" last year. It was pretty clear he was doing a lot of leading, and he was invited to all the relevant events I can think of.</p>", "parentCommentId": "pCdTppHiXQiuNGRCs", "user": {"username": "Habryka"}}, {"_id": "LoMNfH8sGrsLexfgs", "postedAt": "2022-12-07T21:47:11.614Z", "postId": "WRvdL9jsXdBerWgte", "htmlBody": "<p>One bit of clarifying info is that <a href=\"https://www.wsj.com/podcasts/the-journal/do-you-expect-to-go-to-prison-an-interview-with-sbf/7462fb31-e371-4585-9be2-39576cd1e02a\">according to Sam</a>, FTX wasn't just grabbing customer $ <i>after</i> Alameda became insolvent, but lent ~1/3 or more of the customer funds held to Alameda. And this happened whenever users deposited funds through Alameda, something we know was already happening years ago - from the early stages of FTX.</p><p><img src=\"https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/d828c03e9a4eec54650fd8ef2d1472766460fd4ac7666ee0.png\" srcset=\"https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/d828c03e9a4eec54650fd8ef2d1472766460fd4ac7666ee0.png/w_159 159w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/d828c03e9a4eec54650fd8ef2d1472766460fd4ac7666ee0.png/w_239 239w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/d828c03e9a4eec54650fd8ef2d1472766460fd4ac7666ee0.png/w_319 319w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/d828c03e9a4eec54650fd8ef2d1472766460fd4ac7666ee0.png/w_399 399w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/d828c03e9a4eec54650fd8ef2d1472766460fd4ac7666ee0.png/w_479 479w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/d828c03e9a4eec54650fd8ef2d1472766460fd4ac7666ee0.png/w_559 559w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/d828c03e9a4eec54650fd8ef2d1472766460fd4ac7666ee0.png/w_639 639w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/d828c03e9a4eec54650fd8ef2d1472766460fd4ac7666ee0.png/w_719 719w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/d828c03e9a4eec54650fd8ef2d1472766460fd4ac7666ee0.png/w_799 799w\"></p><p>The same gist comes across in interviewing from Coffezilla: https://t.co/rMljwAqhDq</p>", "parentCommentId": "xdao2Y5dLDAur3K3B", "user": {"username": "RyanCarey"}}]