[{"_id": "8DhRc8JE9yXcm6AEK", "postedAt": "2023-10-04T13:14:28.402Z", "postId": "WuLBav76CnLK7e6cw", "htmlBody": "<p>As someone who recently did this myself I can highly recommend it! I also want to add that some people might be able to, and perhaps even benefit from, taking a \"middle path\" where they reduce their work hours. I did this which allowed me 1 day/week over a couple of months to try to make working directly on EA causes happen. It probably comes with reduced pay but does not require enough savings to carry you through unpaid leave. Moreover, you can do this right now even if you do not have enough savings for a continuous break.</p>", "parentCommentId": null, "user": {"username": "Ulrik Horn"}}, {"_id": "Hk28EFWT6euzd8Xbv", "postedAt": "2023-10-04T16:54:43.338Z", "postId": "WuLBav76CnLK7e6cw", "htmlBody": "<p>Love this! Seems like a great push (importantly, in a constructive and thoughtful way) for many that might otherwise feel frustrated with their current situation. Will definitely share this from time to time :))</p>", "parentCommentId": null, "user": {"username": "henrith"}}, {"_id": "42JgwAZc2xBjcT6Cc", "postedAt": "2023-10-05T08:15:41.318Z", "postId": "WuLBav76CnLK7e6cw", "htmlBody": "<p>Glad to hear it resonates <a href=\"https://forum.effectivealtruism.org/users/henri-thunberg?mention=user\">@Henri Thunberg</a>!&nbsp;</p>", "parentCommentId": "Hk28EFWT6euzd8Xbv", "user": {"username": "SarahPomeranz"}}, {"_id": "oCFdNt7kE5SxFtFDm", "postedAt": "2023-10-05T16:00:59.881Z", "postId": "WuLBav76CnLK7e6cw", "htmlBody": "<p>I did this quite a few times throughout my career, my first sabbatical was after graduating and it got me moving into higher income country for a programming career. Soon after I joined a startup that is more mission driven and altruistic. Then I took another sabbatical as the startup was winding down and as I started reading about EA. I managed to convince my previous boss at the startup about EA too. I then joined another startup to rack up more savings and had another sabbatical where I was more determined to work at a highly impactful job. Seems like every sabbatical I took I get closer to EA ideas and ultimately stumbled upon a good fit at an effective giving org. I highly recommend people to take breaks/sabbaticals to help reorient yourself.</p>\n", "parentCommentId": null, "user": {"username": "owyongsk"}}, {"_id": "RESaKBZMp4rFKqu9w", "postedAt": "2023-10-06T10:43:38.531Z", "postId": "WuLBav76CnLK7e6cw", "htmlBody": "<p>Just wanted to echo this point about reducing work hours! In cases where this option is available + financially viable, I think it can be very worth considering. I did this a few years ago when I was in a non-impact-driven job, reducing my work schedule permanently from full-time to 4.5 days per week then later 3.5. I used the other time for small volunteering and consulting opportunities in EA (though finding them involved some luck), which I think really helped me towards eventually moving into a permanent direct work role later.</p>", "parentCommentId": "8DhRc8JE9yXcm6AEK", "user": {"username": "AmritSidhu-Brar"}}, {"_id": "FnAvZqzYbNggeRY7i", "postedAt": "2023-10-07T19:29:40.173Z", "postId": "WuLBav76CnLK7e6cw", "htmlBody": "<p>+1 part-timer here. I was very frustrated back then. Having learnt a lot of interesting ideas about using one’s career for social impact I felt that I do not have sufficient time to explore these ideas to the depth I wanted to. I wanted to head towards a transition but I felt that I got stuck. So earlier this year I told my employer that I’m thinking of quitting because of this (note that I’m in a furtunate position of having experience that is currently in high demand, so I could relatively easily find a job similar to my previous if needed). But they suggested that I could do part-time instead if I wanted to and I accepted their offer.</p>\n<p>It did not just give me time to explore the research around high-impact careers but now also allows me to spend signifficant time on applications, work trials and volunteering projects for testing my fit and upskilling.</p>\n<p>One thing that I’m still thinking about is that I was in a fortunate position of being able to afford this financially. It just does not feel right that I decided to “spend” these resorces (my time/the salary I did not earn) on this “project” without crosschecking with experts (e.g. grantmakers) that my “project” meets the bar of being an effective use of these resources. (Tried to summarize this here as my first forum post <a href=\"https://forum.effectivealtruism.org/posts/4TiBZxD7NLsSTsHDn/career-investments-vs-giving-in-the-short-term\">https://forum.effectivealtruism.org/posts/4TiBZxD7NLsSTsHDn/career-investments-vs-giving-in-the-short-term</a>)</p>\n", "parentCommentId": "8DhRc8JE9yXcm6AEK", "user": {"username": "Péter Drótos"}}, {"_id": "zAdtgZrrxYhCrnuDK", "postedAt": "2023-10-09T07:16:49.291Z", "postId": "WuLBav76CnLK7e6cw", "htmlBody": "<p>One more benefit of reducing working time: You might be more likely to be able to return to work afterwards if you need to. By eg going from 5 days a week to 4, you are probably still involved in pretty much the same work and thus less likely to be replaced by someone else or something else that could make s return after a sabbatical problematic.</p>\n", "parentCommentId": "8DhRc8JE9yXcm6AEK", "user": {"username": "Ulrik Horn"}}, {"_id": "dpq25pTkuodYcdHBe", "postedAt": "2023-10-12T08:07:20.887Z", "postId": "WuLBav76CnLK7e6cw", "htmlBody": "<p>This post is spot-on. After leading a tech-startup for 8 years I started my sabbatical in February of this year. Prior to this, I had started reading up on EA and once my sabbatical came around, I was able to rapidly dive in deep, further my thinking and build a network for myself.</p><p>Having time off to read, think, reflect and meet people was invaluable to this progress. I would never have been able to do so while working a full-time job.</p><p>Not only the time to work on figuring out how to do good, but also the free time to 'shut off' and allow your brain to connect the dots, and allow you to feel what's truly important to you.</p><p>My sabbatical ended with this post on LinkedIn about my new direction. Fortunately I still have a lot of free time now, but it's more aimed at finding impactful opportunities for myself to do a lot of good.</p><p>https://www.linkedin.com/posts/robkonterman_i-spent-the-past-7-months-figuring-out-activity-7110190879776104448-0qA0</p>", "parentCommentId": null, "user": {"username": "robkonterman"}}, {"_id": "jSCdEAoRg8guXXaYn", "postedAt": "2023-10-20T11:46:25.934Z", "postId": "WuLBav76CnLK7e6cw", "htmlBody": "<p>This post is much helpful &nbsp;<a href=\"https://forum.effectivealtruism.org/users/sarahpomeranz?from=post_header\"><strong>SarahPomeranz</strong></a><strong>, </strong><a href=\"https://forum.effectivealtruism.org/users/jona?from=post_header\"><strong>Jona</strong></a><strong>, </strong><a href=\"https://forum.effectivealtruism.org/users/sanjana-kashyap-1?from=post_header\"><strong>Sanjana Kashyap</strong></a><strong>,</strong> I'm on the verge of quitting my non-EA job. This has given me much clarity.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Emmanuel Awuni"}}]