[{"_id": "t3ZfFdqMrFQuyhAtE", "postedAt": "2018-09-05T20:49:37.714Z", "postId": "Wvwx29aoH9Jvs9SXN", "htmlBody": "<blockquote>\n<p>&quot;Whether we seek to alleviate poverty directly or indirectly, we might suppose that such efforts will get a privileged status over very different cause areas if we endorse the justice view. But our other cause priorities deal with injustices too; factory farming is an unjust emergency, and an existential catastrophe would clearly be a massive injustice that might only be prevented if we act now. And just like poverty, both of these problems have been furthered by selfish and corrupt international institutions which have also contributed to our wealth. So it's not really clear if the justice view might change much in our approach to cause prioritization.&quot;</p>\n</blockquote>\n<p>I'm most interested in how Ashford's views might affect cause prioritization. Yes factory farming and x-risk can be characterized as injustices, but it isn't clear to me if these cases are as clean as the case for global poverty being an injustice. For example, you might argue that x-risk is caused by corrupt international institutions that only favor present people, but this brings up a whole range of possible considerations like if you can be unjust towards future people given the non-identity problem. Overall, I think this issue is debatable and I'd be interested in seeing more work done on it. </p>\n", "parentCommentId": null, "user": {"username": "Parker_Whitfill"}}, {"_id": "NYNaQqfY4pP38nhcT", "postedAt": "2018-09-06T07:44:18.128Z", "postId": "Wvwx29aoH9Jvs9SXN", "htmlBody": "<p>Isn't factory farming a clear-cut case of injustice? A pretty standard view of justice is that you don't harm others, and if you are harming them then you should stop and compensate for the harm done. That seems to describe what happens to farmed animals. In fact, as someone who finds justice plausible, I think it creates a decent non-utilitarian argument to care about domestic animal suffering more than wild animal suffering.</p>\n<p>As my last sentence suggests, I do think that justice views are likely to affect cause prioritisation. I think you're right that justice may lead you to different conclusions about inter-generational issues, and is worth a deeper look.</p>\n", "parentCommentId": "t3ZfFdqMrFQuyhAtE", "user": {"username": "bwildi"}}, {"_id": "QTmmnrKsMif2kmj5v", "postedAt": "2018-09-07T06:22:10.124Z", "postId": "Wvwx29aoH9Jvs9SXN", "htmlBody": "<p>OK, I'm going to wrap this sequence up here because there is not a lot of voting or commenting and so I don't want to crowd the forum with more posts.</p>\n<p>Part Five</p>\n<p>Brandon Boesch's argument assumes Bernard Williams' theory of integrity. On Williams' account, we adopt moral commitments and identities that are comprised in part by our actions. Boesch agrees with Singer that we should donate much more money to charity than we already do, that the organizations which effectively alleviate extreme poverty are worthy targets of donations, and that consideration of utility is an important aspect of our philanthropic decision making. But Boesch points out that according to Williams' famous disagreement with utilitarianism, agents must take into account their particular position and commitments. So, if my decision to donate money is done purely with utilitarian logic, I am failing to think in the way an agent properly should. For instance, I might choose to identify as a proud resident of my local community; then consideration of local philanthropy is an important part of maintaining this identity. I might choose to identify as a grateful alumnus of my university; then consideration for giving back to it is an important part of maintaining this identity. We are not strictly required to act on these identities, but we are at least required to take them into consideration as things that may influence how we act. </p>\n<p>These identities are not something that automatically exist for us, they are our choices. They are moral in nature, but they are not morally determined; we identify as proud community members or grateful alumni just because we choose that moral identity. So it's hard to see exactly where this basic picture contradicts utilitarianism, which can be understood simply as the thesis that we ought to take up only a single moral identity, that of being utilitarian. Utilitarianism doesn't require that people contradict their alternate moral identities, it requires that they not have them. I can identify as a proud resident of my community in some weaker nonmoral sense, but not in the strong sense of privileging their interests over others.</p>\n<p>Now, a single moral identity for all people for all places (like utilitarianism) can more subtly contradict Williams' prescriptions because he thinks that moral identity must depend on unique features of the individual. But either way, Boesch's prescriptions are likely to seem strange to anyone who has already taken up Effective Altruism as their primary moral identity as far as their career and altruism are concerned. Boesch treats utilitarian philanthropy as if it abstracted away from the individual, but someone who is connected with EA institutions and ideas is in a perfect position to make them the object of a rich moral identity driven by one's particular position in the community and one's particular take on the philosophical differences within EA. Here one is inclined to say that the viability of refusing to focus on charities that satisfy dire ethical emergencies indicates that the fabric of the local institutions and norms that enter into our ordinary moral identities is deeply flawed. Therefore, the mission of EA as a community does not necessarily assume that the issue that Boesch raises is misguided; rather, the goal is to expand and permeate modern society so as to actively render it obsolete.</p>\n<p>Part Six</p>\n<p>The last proper chapter in the volume is written by William MacAskill, Toby Ord, and Andreas Morgensen. Faced with objections that traditional utilitarian standards giving are too demanding, they push the <em>Very Weak Principle of Sacrifice</em>: &quot;Most middle-class members of affluent countries ought, morally, to use at least 10 percent of their income to effectively improve the lives of others.&quot; The chapter contains a general argument that this principle skirts under the demandingness objection because its burdens are disproportionately easy.</p>\n<p>Unfortunately, the argument is limited to the idea of demandingness as a defense of the importance of one's personal well-being, whereas the other formulation of demandingness - as a loss of moral autonomy - is not considered. I would think that most who object to demanding moral principles would prefer to follow the latter idea rather than outright defend selfishness. And it seems possible to demonstrate that a 10% tithe doesn't remove this autonomy for most middle-class people, although it is a somewhat vague issue to target. </p>\n<p>For what it is, the argument is good. By surveying the empirical literature on well-being estimation, income happiness effects, and cost-effectiveness, they show that their principle would reduce one's happiness by less than 0.1 points on a 10-point scale, which is far below what any reasonable person would consider demanding. They show that giving is a habit that is likely to improve one's well-being in various ways. Then they show that the impact upon other people's lives is very large in comparison to these effects, referencing our standard ideas on the cost-effectiveness of global health and poverty initiatives. Finally, they survey the competing views on well-being and show that their argument is resilient to differences in opinion about the nature of well-being. It is a simple and straightforward chapter without much to comment on, and little in it is likely to be particularly novel for the EA reader. Their philosophical logic is sound, and their empirical claims are presented with multiple lines of parallel argument so that small inaccuracies or disputes about the data would not seriously threaten the overall thesis. </p>\n<p>Besides affirming the view that we generally don't donate enough money, the other authors in this book have not given any specific prescriptions about how much we ought to donate, perhaps due to fundamental indeterminacy in their views. And there is a worry here that the typical selfish person will fail to take such advice seriously. In this context, MacAskill et al's chapter makes a very useful argument as it puts the reader in a defensive position, compelling him to ask himself what he spends his money on and what he would be able to do in his budgeting to make room for the Very Weak Principle of Sacrifice.</p>\n<p>Part Seven (not really)</p>\n<p>Then, at the end the editor gives a sort of conclusion to the whole thing. Unlike the last two chapters I hadn't yet written a review of it, so I'm not going to bother doing it properly now that I have decided to wrap this sequence up succinctly. Woodruff rehashes some of the stuff that was said earlier about justice, but he adds in some detail in some areas, so it's worth checking out if you're into deontological ethics. There is one bit that is sloppy scholarship and has to be called out, where he claims that the Marines at the Battle of Chosin Reservoir &quot;saved army personnel who had not been trained to take such risks and probably would not have acted to save the marines,&quot; I have no idea what this guy is thinking, it's preposterous and insulting to say that Army Soldiers aren't as well trained or loyal as Marines, and the reality is that Army forces in Task Force Faith were destroyed while protecting the Marines. </p>\n<p>Now here are links to earlier parts in case you missed them:</p>\n<p><a href=\"http://effective-altruism.com/ea/1qw/the_ethics_of_giving_part_one_thomas_hill_on_the/\">http://effective-altruism.com/ea/1qw/the_ethics_of_giving_part_one_thomas_hill_on_the/</a></p>\n<p><a href=\"http://effective-altruism.com/ea/1rf/the_ethics_of_giving_part_two_christine_swanton/\">http://effective-altruism.com/ea/1rf/the_ethics_of_giving_part_two_christine_swanton/</a></p>\n<p><a href=\"http://effective-altruism.com/ea/1ru/the_ethics_of_giving_part_three_jeff_mcmahan_on/\">http://effective-altruism.com/ea/1ru/the_ethics_of_giving_part_three_jeff_mcmahan_on/</a></p>\n<p>So, that's the end of it; summary of the whole volume is that (a) it appears to be a consensus that doing some Givewell-style poverty relief is good and important and people need to be doing more of it, (b) people are still giving various reasons to give some of our money to the Usual Suspects instead (e.g. Amnesty International, Princeton University, local baseball team, etc), (c) no one is talking about EA in broader terms beyond Givewell-style poverty relief, no attention is paid to causes like animal rights or x-risk.</p>\n", "parentCommentId": null, "user": {"username": "kbog"}}, {"_id": "ch5jXpvJQweNWj5qo", "postedAt": "2018-09-07T17:18:54.137Z", "postId": "Wvwx29aoH9Jvs9SXN", "htmlBody": "<blockquote>\n<p>&quot;A pretty standard view of justice is that you don't harm others, and if you are harming them then you should stop and compensate for the harm done. That seems to describe what happens to farmed animals.&quot;</p>\n</blockquote>\n<p>I think this only applies to people who are contributing to the harm. But for a vegan for is staunchly opposed to factory farming, they aren't harming the animals, so factory farming is not an issue of justice for them. </p>\n", "parentCommentId": "NYNaQqfY4pP38nhcT", "user": {"username": "Parker_Whitfill"}}, {"_id": "3H9iybpyaQAkeitGj", "postedAt": "2018-09-07T17:20:17.781Z", "postId": "Wvwx29aoH9Jvs9SXN", "htmlBody": "<p>Thanks for the summary and the entire sequence of posts. I thoroughly enjoyed them. In my survey of the broader literature c) is mostly true and I'd certainly like to see more philosophical engagement on those issues. </p>\n", "parentCommentId": "QTmmnrKsMif2kmj5v", "user": {"username": "Parker_Whitfill"}}]