[{"_id": "JzwpguuyX88aT5uzx", "postedAt": "2015-03-11T06:48:19.209Z", "postId": "WwA9f3eCKm9yAHvKj", "htmlBody": "<p>That sounds like a neat idea! Could you also post the newsletters here? My news-reading methodology relies on feeds (Atom and RSS), so it’s easier for me to follow the feed of this board, but I don’t want to miss anything you write in the newsletters either.</p>\n<p>I’m also running a newsletter with Mailchimp, and emails with the two-column layout reliably got spam-filtered by Gmail, just in case you were considering it.</p>\n", "parentCommentId": null, "user": {"username": "Telofy"}}, {"_id": "zYMSHcoftPduYFTyr", "postedAt": "2015-03-12T06:29:00.628Z", "postId": "WwA9f3eCKm9yAHvKj", "htmlBody": "<p>The newsletter I send out in emails could be considered an abridged version, as there are minutiae and minor updates from other blogs and organizations which I don't include. I was thinking if I published the newsletter on this forum, I would include those as well. I'm not sure. However, I'd put major links first anyway. I'll start doing this next week.</p>\n", "parentCommentId": "JzwpguuyX88aT5uzx", "user": {"username": "Evan_Gaensbauer"}}, {"_id": "6HzYkFqEccnj64s69", "postedAt": "2015-03-12T12:07:03.585Z", "postId": "WwA9f3eCKm9yAHvKj", "htmlBody": "<p>This would save me enough time that I'd happily pay £s per newsletter!  Thanks so much for offering to put this together.  </p>\n", "parentCommentId": null, "user": {"username": "Niel_Bowerman"}}, {"_id": "H4kRyNuwD8qYzdToq", "postedAt": "2015-03-12T22:45:15.563Z", "postId": "WwA9f3eCKm9yAHvKj", "htmlBody": "<p>It seems good to me to post it here.</p>\n", "parentCommentId": "zYMSHcoftPduYFTyr", "user": {"username": "RyanCarey"}}, {"_id": "g3mtRc5kriqtwPXfM", "postedAt": "2015-03-17T07:09:25.870Z", "postId": "WwA9f3eCKm9yAHvKj", "htmlBody": "<p>Update:\nThere is so much content this week that I may save some content for next week. The newsletter for this week will also be posted on this forum by Wednesday. No RSS feeds available yet.</p>\n", "parentCommentId": null, "user": {"username": "Evan_Gaensbauer"}}, {"_id": "CDfq265XStwjiRMuk", "postedAt": "2015-03-18T12:17:30.351Z", "postId": "WwA9f3eCKm9yAHvKj", "htmlBody": "<p>Thanks so much Evan, Harvard EA will greatly appreciate that. I've been planning on doing something like that for our semi-involved members but never got around to actually doing that.</p>\n", "parentCommentId": null, "user": {"username": "Ales_Flidr"}}]