[{"_id": "BteRWzo5ygeqQzpFJ", "postedAt": "2023-02-28T15:52:02.859Z", "postId": "WWhSCnw5xdrdKjHeS", "htmlBody": "<p>Hi, thank you for organising this.<br><br>What are your thoughs on several offices closing EDIT: \"or failing to open\" recently?<br>Lightcone Offices, SOL and there are rumors of others considering their fate as well.<br>Does it spell the end of EA offices / hubs as a thing of the past, when funding was perhaps too abundant?<br>Or is it just a case by case basis and there is opportunity for people who used those spaces to support creation of new ones elsewhere?<br><br>How (if at all) does your understanding of that impact the expected content of the conference?<br><br>Thanks</p>", "parentCommentId": null, "user": {"username": "Martin Hrádela"}}, {"_id": "7EnSR3LaqzEi8iYQa", "postedAt": "2023-02-28T18:43:35.449Z", "postId": "WWhSCnw5xdrdKjHeS", "htmlBody": "<p>SOL didn't close - it just failed to open and my understanding was this was entirely due to financing falling through.</p>\n<p>Lightcone on the other hand does not have any financial issues to the best of my limited knowledge, but chose to close due to a change in strategy.</p>\n<p>These two situations seem very different.</p>\n<p>I'm not aware of any other office situations changing but it definitely makes sense that office strategy in general would be affected by a decline in available assets for offices. I expect this to continue case-by-case.</p>\n", "parentCommentId": "BteRWzo5ygeqQzpFJ", "user": {"username": "Peter_Hurford"}}, {"_id": "dwzXr4TKFwRXFNCQf", "postedAt": "2023-02-28T19:04:02.429Z", "postId": "WWhSCnw5xdrdKjHeS", "htmlBody": "<p>What was the plan for SOL?</p>\n", "parentCommentId": "BteRWzo5ygeqQzpFJ", "user": {"username": "casebash"}}, {"_id": "TuvR4SMMpw5bnakEj", "postedAt": "2023-02-28T21:40:40.781Z", "postId": "WWhSCnw5xdrdKjHeS", "htmlBody": "<p>Hi Martin, thanks a lot for the comment &amp; thanks for the clarification on the topic, Peter!</p>\n<p>As you stated, less abundant funding has already started to negatively impact some EA offices and this trend will probably continue in the months/years to come.</p>\n<p>The agenda is still very much in the making, but having time and space to get together to think about how to spend resources wisely and focus on creating spaces that carry the most potential to support the community seems to me like a valuable exericise, especially given the financial situation.</p>\n<p>Also, I would be very interested in finding out how others have dealt with the funding situation as there might be many lessons to be learnt across different types of spaces and expertise.</p>\n", "parentCommentId": "BteRWzo5ygeqQzpFJ", "user": {"username": "Tereza Flídrová"}}, {"_id": "hMj6cEzRLcWsmvLgf", "postedAt": "2023-03-01T01:14:48.901Z", "postId": "WWhSCnw5xdrdKjHeS", "htmlBody": "<p>Fwiw: This might locally differ. The EA coworking office in Berlin is going strong and a second related space (Aurea) just opened. I think there's probably demand for more co-living spaces and maybe also more coworking spaces in the coming year, and they probably could be (mostly) funded by members, so not depending on donors.</p>\n", "parentCommentId": "BteRWzo5ygeqQzpFJ", "user": {"username": "Manuel_Allgaier"}}, {"_id": "s5HmvDo5MGd6Jh5Rq", "postedAt": "2023-03-01T15:39:53.128Z", "postId": "WWhSCnw5xdrdKjHeS", "htmlBody": "<p>What does SOL stand for?</p>\n", "parentCommentId": "BteRWzo5ygeqQzpFJ", "user": {"username": "david_reinstein"}}, {"_id": "6Rc2YwMhnCfALcLAP", "postedAt": "2023-03-01T15:40:43.683Z", "postId": "WWhSCnw5xdrdKjHeS", "htmlBody": "<p>TLDR please: are you proposing a conference to discuss conferences (and hubs and coworking etc?)</p>\n", "parentCommentId": null, "user": {"username": "david_reinstein"}}, {"_id": "gBrEPaiZmroZtBhFv", "postedAt": "2023-03-01T17:00:58.166Z", "postId": "WWhSCnw5xdrdKjHeS", "htmlBody": "<p>Not conferences specifically, but more spaces where EAS work and gather in general, like offices, hubs, etc., but I guess in some sense conferences would also fall into this category, yes.</p>\n", "parentCommentId": "6Rc2YwMhnCfALcLAP", "user": {"username": "Tereza Flídrová"}}, {"_id": "Pem5oNv2HmTgoeW5S", "postedAt": "2023-03-02T04:31:26.305Z", "postId": "WWhSCnw5xdrdKjHeS", "htmlBody": "<p>I think the information you give on Aurea is expired. They've closed their form, taken down their initial EA Forum post, and have not responded to emails in months. In short, they seem to have shut down (though there probably still are individuals working on longtermist issues living there). <s>I personally see them as one of the most egregious failures for a longtermist hub from the info I was given.</s> (I don't give more detail because I wasn't there and would prefer if they wrote a postmortem themselves). &nbsp;<br>EDIT : I've crossed out the before-last sentence as I don't endorse it anymore and shouldn't have written in that tone in the first place. I didn't have first hand information and was unnecessarily hostile. I wish instead that I'd simply expressed my confusion as to why they disappeared.</p>", "parentCommentId": "hMj6cEzRLcWsmvLgf", "user": {"username": "Jonathan Claybrough"}}, {"_id": "NjMtrQW9rJodAaRGw", "postedAt": "2023-03-04T03:49:58.444Z", "postId": "WWhSCnw5xdrdKjHeS", "htmlBody": "<p>Do we really need a conference to determine whether or not we need more community-based offices and coworking spaces? I mean, common sentiment seen on this forum already indicates that we do.</p><p>The 6 months that it would take to plan and enact this workshop/conference are 6 months that could be used pursuing funding and actually making this into a possibility with your small strike team. If it’s something that you think is important, <i>just go do it</i>. From there the people should follow and those are the ones who you’ll will want to be having these conversations with. Build it and they will come and all of that.</p>", "parentCommentId": null, "user": {"username": "EAlly"}}, {"_id": "eRsK7h4JcnFGBhh3f", "postedAt": "2023-03-08T13:19:40.250Z", "postId": "WWhSCnw5xdrdKjHeS", "htmlBody": "<p>Hey, thanks so much for your comment! I also think most people would agree that additional spaces could be useful, so I want to clarify that the conference would not be centered around answering that specific question.&nbsp;</p><p>Rather, the conference would focus on how to make those spaces <i>as effective as possible </i>by thinking through high-level strategy, identifying opportunities for collaboration, and sharing best practices + documenting them for posterity, etc.</p><p>I think that it's incorrect to assume that opening a new space will always lead to a positive outcome. In fact, I think that a poorly-launched space could actually be a net negative if it were to fail to attract a sufficient or well-aligned user base, decrease trust in EA projects due to poor management, or simply fall short of fulfilling its full potential -- to name a few problems this conference would seek to address.&nbsp;</p><p>I hope that helps explain why I believe this conference would be beneficial! Please feel free to share any additional thoughts you might have.</p>", "parentCommentId": "NjMtrQW9rJodAaRGw", "user": {"username": "booritney"}}]