[{"_id": "HrNkcN5qpz6AMfzn4", "postedAt": "2023-07-09T22:51:46.832Z", "postId": "WxqyXbyQiEjiAsoJr", "htmlBody": "<p>I just want to say I really like this style of non-judgmental anthropology and think it gives an accurate-in-my-experience range of what people are thinking and feeling in the Bay, for better and for worse.</p><p>Also: one thing that I sort of expected to come up and didn't see, except indirectly in a few vignettes, is just how much of one's life in the Bay Area rationalist/EA scene is comprised of work, of AI, and/or of EA. Part of this is just that I've only ever lived in the Bay for up to ~6 weeks at a time and was brought there by work, and if I lived there permanently I'd probably try to carve out some non-EA/AI time, but I think it's a fairly common experience for people who move to the Bay to do AI safety-related things to find that it absorbs everything else unless you make a conscious effort not to. At basically all the social events I attended, &gt;25% of the attendees worked in the same office I did and &gt;25% of the people at any given time are talking about AI or EA. This has not been my experience even while doing related full-time work in Boston, Oxford, and DC.&nbsp;</p><p>Again, part of this is that I've been in Berkeley for shorter stints that were more work-focused. But yeah, I think it's not just my experience that the scene is very intense in this way, and this amplifies everything in this post in terms of how much it affects your day-to-day experience.</p>", "parentCommentId": null, "user": {"username": "levin"}}, {"_id": "2jFDekKkziDFMn3eC", "postedAt": "2023-07-10T17:57:56.988Z", "postId": "WxqyXbyQiEjiAsoJr", "htmlBody": "<p>For everyone who wanted to participate in the poll but didn't because it seemed like too much work – I updated it! Here's the <a href=\"https://forms.gle/CjNc4xSYwWpLSk6aA\">updated version</a>. It should be easier to answer now :)&nbsp;</p>", "parentCommentId": null, "user": {"username": "Yulia"}}, {"_id": "yZRL8EJgRnXv6hrYZ", "postedAt": "2023-07-10T20:39:10.798Z", "postId": "WxqyXbyQiEjiAsoJr", "htmlBody": "<p>I just wanted to say that this was a fantastic post, and one of the best reads (imo) on the Forum this year.</p><p>I've never been to the Bay or interacted in person with this culture, so I'd be very interested to hear to what extent other EAs on the Forum think that these perceptions are accurate.<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefa2jqakrmzxe\"><sup><a href=\"#fna2jqakrmzxe\">[1]</a></sup></span></p><p>In general it makes me appreciate coming to EA (at least the community side, as opposed to awareness of the philosophy) later in life - it means that my professional and personal life isn't so highly entangled with EA to the extent that seems to be causing a lot of dissonance and distress in these anecdotes.</p><p>I do think that some of these 'corrupting influences' are things that happen naturally in any human society and hierarchy (e.g. The Seeker's Game vignette itself - the phrase <i>\"It's not what you know it's who you know\" </i>is a common idiom for a reason!), but there do seem to be reasons why these concerns seem to be worse in the Bay than in other EA areas atm.</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fna2jqakrmzxe\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefa2jqakrmzxe\">^</a></strong></sup></span><div class=\"footnote-content\"><p>Only if you're comfortable sharing ofc</p></div></li></ol>", "parentCommentId": null, "user": {"username": "JWS"}}, {"_id": "2BEjkY59oLJuYmXca", "postedAt": "2023-07-11T09:28:30.275Z", "postId": "WxqyXbyQiEjiAsoJr", "htmlBody": "<p>Now I obviously can't speak about or for every Bay Area EA subculture or individual interaction, but the following sentence leapt out to me.</p><blockquote><p>So better lie low, occasionally drop sophisticated remarks – and don't be caught asking dumb questions.</p></blockquote><p>I would be <i>very</i> surprised if this is a good long-term strategy. I mean, this is close to the opposite of the advice I've received as a newcomer in (I think) literally every formal organization I've worked at (both in and outside of EA), and also the opposite of the advice I give to newcomers. I don't see why the situations should be very different between quasi-formal and formal situations in this case.</p><p>I also think there's a intuitive conceptual model for asking many questions:</p><ul><li>You learn and grow more by asking dumb questions than by nodding wisely and asking questions that you consider smart.</li><li>On the object-level, there's no sense in which asking dumb questions can plausibly have very significant downsides <i>for the world</i> (other than opportunity costs)<ul><li>Whereas bad research and bad decisions <i>could </i>plausibly be significantly harmful</li><li>Failure to ask questions may lead to bad inferences, and bad inferences could lead to bad decisions</li></ul></li><li>Nobody's going to ever remember dumb questions you ask, unless it's <i>really</i> out there, like \"Why are Americans afraid of <a href=\"https://w3.ric.edu/faculty/rpotter/temp/waaaod.pdf\">dragons</a>?\"<ul><li>And even then they'll only remember it humorously</li></ul></li><li>For better or worse, some people (hi!) really like explaining/mansplaining and hearing the sound of their own voice.&nbsp;<ul><li>So if you ask loads of dumb questions to different people, you might make a new friend!</li></ul></li></ul><p>So please, feel free to ask dumb questions, y'all! :)&nbsp;</p>", "parentCommentId": null, "user": {"username": "Linch"}}, {"_id": "WFTkdLzEr2NncWoCM", "postedAt": "2023-07-11T09:30:59.498Z", "postId": "WxqyXbyQiEjiAsoJr", "htmlBody": "<p>Thanks so much for this, I really enjoyed it! I really like this format and would enjoy seeing more of it.</p><p>This isn't the point, and there's likely so much behind each vignette that we don't see, but I so wish for some of these folks that they are able to find e.g. people/mentors who encourage their \"dumb questions\", people who want to talk about consciousness, <a href=\"https://www.lesswrong.com/posts/EvKa7EakoXreCkhC6/a-way-to-be-okay\">people who can help</a> figure out what to do with doomer-y thoughts, maybe telling aggregators of information about some of the things listed (community health is one for some topics including some cases of bad management, there are others). I wish them luck, encourage finding an information aggregator, and wonder if maybe the comments here might end up with offers to talk about the things people find hard to talk about. I just have a sense that (exempting all the complexity I don't see) there are people who want to talk about these things and feel open to weird and heterodox views here!</p><p>But I know that we're more talking about vibes and overall incentive gradients and so on. I'm pretty uncertain what systemic solutions would look like here, but I'll be curious what your poll ends up finding.<br><br>I myself have been worried about the social effects of friends working at AI labs and organizations and whether that's going to make it harder for me or others to criticize that org or have a negative sentiment towards them. Would love to talk more about that some time, especially with people who work at these places!<br><br>A small sadness I have (and not sure what there is to do about this, I appreciate the sharing) is that I think I'm pretty likely to remember the unendorsed ones about the same as the endorsed ones, because the vignettes are the memorable bits. Just an unfortunate fact about this kind of thing.</p>", "parentCommentId": null, "user": {"username": "ChanaMessinger"}}, {"_id": "9kToeYANo3hKnvcyo", "postedAt": "2023-07-11T12:56:07.387Z", "postId": "WxqyXbyQiEjiAsoJr", "htmlBody": "<p>I agree that avoiding asking \"dumb questions\" is harmful (to yourself), but I also think it's a tendency that's really hard to overcome, especially on your own. And I think it's often related to <a href=\"https://forum.effectivealtruism.org/topics/impostor-syndrome\">impostor syndrome</a>; a constant (usually unjustified!) fear of being exposed as unqualified inhibits risk-taking, including stuff like asking questions when you think there's a chance that everyone else thinks the answer is obvious. (I wrote a bit about this in <a href=\"https://forum.effectivealtruism.org/posts/mgQATJta9bEvSNhbw/notes-on-impostor-syndrome?commentId=GT9EegrKs2KJRJjvz\">this appendix</a>.)</p><p>Relatedly, I've found this diagram useful and \"sticky\" as a mental reference for how we end up with false beliefs about what everyone else knows (some people think the diagram should be made up of squiggly blobs of slightly different sizes, but that it's basically accurate besides that — sorry for never updating it! :) ):&nbsp;<br>&nbsp;</p><figure class=\"image image_resized\" style=\"width:526.875px\"><img src=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/9kToeYANo3hKnvcyo/kfqhqp1cpkpyq6q3zcjf\"><figcaption>I've seen many variations of this diagram. I don't know where this one is from, originally. I've been told that the circles should look more like blobs --- people's knowledge comes in different shapes. I agree, but don't want to bother changing it.&nbsp;</figcaption></figure><p>A few things have helped me with this kind of thinking:&nbsp;</p><ol><li>Finding trusted people / safe spaces where I could ask questions without feeling judged, asking \"dumb\" questions there, and building up confidence and habits for asking questions in other contexts, too.&nbsp;<ol><li>I think I asked Linch a lot of \"dumb questions\" when he was my research supervisor, and it was great. I'd recommend it!&nbsp;</li></ol></li><li>Bulldozing through the fear/anxiety for the first few times in new contexts breaks the ice for me and makes it easier for me to feel comfortable asking questions later on. (Sometimes I have this as an explicit goal the first few times I'm asking a \"dumb\" question somewhere.)&nbsp;</li><li><a href=\"https://forum.effectivealtruism.org/posts/mgQATJta9bEvSNhbw/notes-on-impostor-syndrome#_3__View_looking_silly_as_charity_unto_others\">Viewing looking silly as charity unto others</a></li><li>Learning about impostor syndrome</li><li>Caring a bit less about what the average person I interact with thinks of me (<a href=\"https://waitbutwhy.com/2014/06/taming-mammoth-let-peoples-opinions-run-life.html\">this</a> is a classic post<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefa3m3aptegy\"><sup><a href=\"#fna3m3aptegy\">[1]</a></sup></span>&nbsp;on the topic, but I'm not sure how this actually improved for me)</li></ol><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fna3m3aptegy\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefa3m3aptegy\">^</a></strong></sup></span><div class=\"footnote-content\"><p>From the post, another diagram I like (lightly adapted):&nbsp;</p><figure class=\"image\"><img src=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/9kToeYANo3hKnvcyo/t1rmxlgwfutes40hsi4j\" srcset=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/9kToeYANo3hKnvcyo/inwryg5eajwyqypxoysd 180w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/9kToeYANo3hKnvcyo/u7hzq8h1b2mszknzo96a 360w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/9kToeYANo3hKnvcyo/vngnlhxfxewnshbkiqff 540w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/9kToeYANo3hKnvcyo/kma2mfdkmr9oipee6aca 720w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/9kToeYANo3hKnvcyo/ll6djgtok4xbkknyi57j 900w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/9kToeYANo3hKnvcyo/sf09mxeqrgb67li4fc5k 1080w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/9kToeYANo3hKnvcyo/hiksvjshvfj400dfenqt 1260w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/9kToeYANo3hKnvcyo/uhleqv2i2mtpvltxpaux 1440w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/9kToeYANo3hKnvcyo/fo2dg7mc83phhgxhi8ms 1620w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/9kToeYANo3hKnvcyo/zvf2om5mqelshqzsrm5f 1704w\"></figure></div></li></ol>", "parentCommentId": "2BEjkY59oLJuYmXca", "user": {"username": "Lizka"}}, {"_id": "aikpotccd4gqJ4euu", "postedAt": "2023-07-16T15:23:29.142Z", "postId": "WxqyXbyQiEjiAsoJr", "htmlBody": "<blockquote>\n<p>there's no sense in which asking dumb questions can plausibly have very significant downsides for the world (other than opportunity costs)</p>\n</blockquote>\n<p>I think the opportunity costs are the key issue. :) There's a reason that companies use FAQs and automated phone systems to reduce the number of customer-support calls they have. There have been several times in my life when I've asked questions to someone who was sort of busy, and it was clear the person was annoyed.</p>\n<p>At one of my previous employers (not an EA organization), I asked a lot of questions during meetings, which apparently other people didn't like, because it was distracting. During one meeting, people didn't even bother to answer my questions. A few weeks later, my boss told me that he overheard someone saying: \"Don't invite Brian to this meeting; he'll slow us down with too many questions.\" I was accustomed to a school environment in which teachers would always say \"There's no such thing as a dumb question\", and I didn't realize that people outside of school may not feel the same way.</p>\n<p>The situation might be better among altruists. I think one reason people at that organization didn't want to answer my questions was because they had no career incentive to do so, since they were evaluated based on what they individually produced, not based on helping coworkers. That said, lack of time can still apply in EA contexts. I often fail to reply to people who ask me questions, not because I think the questions are dumb but just because I'm slow and lazy and get asked questions frequently.</p>\n", "parentCommentId": "2BEjkY59oLJuYmXca", "user": {"username": "Brian_Tomasik"}}]