[{"_id": "jME2wJkK7DPyXYieh", "postedAt": "2014-12-12T16:08:47.345Z", "postId": "WzYPT6XcscRha28Jd", "htmlBody": "<p>Thanks for these valuable tips Boris! One comment on the following:</p>\n<blockquote>\n<p>Remind yourself of what you really care about (e.g. “With every $1 I save, I can donate to a cost-effective charity like SCI and cure a child of parasitic worms”)</p>\n</blockquote>\n<p>I'm a big fan of the idea of having set altruistic and personal budgets, so that every spending decision doesn't become a great moral question, which is psychologically unhealthy. Even on this approach you can try to be frugal and aim to underspend on your personal budget. After doing so you could decide that you can live a satisfying life on a slightly smaller personal budget next year. But taking this approach cuts the direct connection between every $1 spending decision and a child dewormed, which is helpful psychologically.</p>\n", "parentCommentId": null, "user": {"username": "Tom_Ash"}}, {"_id": "fezX6vx4Shi6Z88YW", "postedAt": "2014-12-13T18:45:52.118Z", "postId": "WzYPT6XcscRha28Jd", "htmlBody": "<blockquote>\n<p>Shopping around for a cell phone plan that saves you $5/month means $120 over 2 years (3 hours spent finding such a plan means you earned $40/hour) </p>\n</blockquote>\n<p>This prompted me to spend a few minutes researching new plans. Turned out my mobile phone company had released a new plan since I joined them which strictly dominated my old plan; switching saved me around $9 a month. Thanks for the suggestion!</p>\n", "parentCommentId": null, "user": {"username": "Larks"}}, {"_id": "sw9rAxjWapXvZdTfE", "postedAt": "2014-12-15T00:41:33.237Z", "postId": "WzYPT6XcscRha28Jd", "htmlBody": "<p>I think you're exactly right that having a set altruistic and personal budget is the best strategy for EAs. I compiled the above list at a workshop we held at <em>Giving What We Can: Rutgers</em> some years back; I think this particular suggestion is a helpful reminder for students (with little spending money) that they <em>are</em> able to make a difference in the world with their donations.</p>\n<p>One possible time this technique can be helpful is if you feel you're being suckered into a purchase you really don't want to make; you can just commit to giving the price you would have paid to charity.</p>\n<p>I find frugality to be a habit - you discover some principles that work, you tinker with them, but after a while they are on auto-pilot.</p>\n", "parentCommentId": "jME2wJkK7DPyXYieh", "user": {"username": "yboris"}}, {"_id": "8wkRTWZkySotCS2nk", "postedAt": "2015-01-21T13:39:41.261Z", "postId": "WzYPT6XcscRha28Jd", "htmlBody": "<p>For the UK I'd add <a href=\"http://www.moneysavingexpert.com/\">http://www.moneysavingexpert.com/</a></p>\n", "parentCommentId": null, "user": {"username": "Tom_Ash"}}]