[{"_id": "dChsBo2kevjcndxA6", "postedAt": "2023-08-31T11:10:04.479Z", "postId": "X2w4uqjDuGPJFaHPp", "htmlBody": "<p>I know the author personally, and I want to signal that Michelle is genuinely interested in doing good, that the proposed technology does seem highly promising, and that an informed take on this question would help her make a better decision.&nbsp;</p><p>Thanks for anyone experienced with the subject matter who is willing to help here!</p>", "parentCommentId": null, "user": {"username": "edoarad"}}, {"_id": "hvWJs22rDjuwJQwaL", "postedAt": "2023-08-31T14:58:30.598Z", "postId": "X2w4uqjDuGPJFaHPp", "htmlBody": "<p>Thank you for asking.</p>", "parentCommentId": null, "user": {"username": "nathan"}}, {"_id": "BpkPJxm2CjQytybHD", "postedAt": "2023-08-31T15:55:28.428Z", "postId": "X2w4uqjDuGPJFaHPp", "htmlBody": "<p>I don’t have an answer, but would suggest you talk to the folks at the Good Food Institute if you haven’t already — they might have advice, or at the very least be able to point you towards other people you could ask about this.</p>\n", "parentCommentId": null, "user": {"username": "Shakeel Hashim"}}, {"_id": "njCjwJdvGTQRKopDh", "postedAt": "2023-08-31T16:06:17.666Z", "postId": "X2w4uqjDuGPJFaHPp", "htmlBody": "<p>Hey Sahkeel,</p><p>I actually work part-time for GFI. I have spoken to several of the Scitech folks, and surprisingly there is no set strategy for these cases. There seems to be a gradual change over time from strongly supporting open-source science to more nuanced 'maybe patent but in a non-limiting way'.</p>", "parentCommentId": "BpkPJxm2CjQytybHD", "user": {"username": "Michelle Hauser"}}, {"_id": "tPbWWz8k38er5A5mj", "postedAt": "2023-08-31T17:34:31.623Z", "postId": "X2w4uqjDuGPJFaHPp", "htmlBody": "<p>That's interesting to hear. What's the reasoning for the non-limiting patent being preferable over the pure open-science approach?&nbsp;</p>", "parentCommentId": "njCjwJdvGTQRKopDh", "user": {"username": "JamesOz"}}, {"_id": "dQFFzFChgBdiFKpK3", "postedAt": "2023-08-31T20:27:51.562Z", "postId": "X2w4uqjDuGPJFaHPp", "htmlBody": "<p>If you don't patent, how high is the risk that someone else will try to patent your method and patent troll over it?&nbsp;<br><br>This has historically been the reason that (non-patent troll) software tech companies in the past have claimed for patenting; I don't have a good sense of how common that is.</p>", "parentCommentId": null, "user": {"username": "Linch"}}, {"_id": "db4Dir7XvqsLLrtnp", "postedAt": "2023-08-31T22:00:58.426Z", "postId": "X2w4uqjDuGPJFaHPp", "htmlBody": "<p>What about filing a patent and then releasing it?</p>", "parentCommentId": "dQFFzFChgBdiFKpK3", "user": {"username": "evelynciara"}}, {"_id": "pENWYLyBj52nAzorD", "postedAt": "2023-08-31T22:11:40.383Z", "postId": "X2w4uqjDuGPJFaHPp", "htmlBody": "<p>That is exactly my worry with just publishing it. As I understand it, anyone can make a small tweak and patent the whole thing in a way that limits the technology from being used widely.&nbsp;</p>", "parentCommentId": "dQFFzFChgBdiFKpK3", "user": {"username": "Michelle Hauser"}}, {"_id": "fweK4ESRxBCSKFxuK", "postedAt": "2023-08-31T22:12:37.215Z", "postId": "X2w4uqjDuGPJFaHPp", "htmlBody": "<p>That would be the best option, but I'm afraid the tech transfer office at the university, who will be the ones doing the filing, has no incentive to release a patent. Their whole goal is profit.</p>", "parentCommentId": "db4Dir7XvqsLLrtnp", "user": {"username": "Michelle Hauser"}}, {"_id": "mDL6Jf4FCuTzafKz9", "postedAt": "2023-08-31T22:16:35.181Z", "postId": "X2w4uqjDuGPJFaHPp", "htmlBody": "<p>What I understand is that they now believe filing a non-limiting or free license patent is preferable, as otherwise anyone can make a small tweak in the published method and patent it for profit.</p><p>The thing is I would love to patent and give it license-free, but I'm afraid I don't have the power to make that decision, as the tech transfer office will do the filing and the ownership will be mostly the university's.</p>", "parentCommentId": "tPbWWz8k38er5A5mj", "user": {"username": "Michelle Hauser"}}, {"_id": "TkMQFw4t2pKMLTWYY", "postedAt": "2023-09-01T03:09:50.021Z", "postId": "X2w4uqjDuGPJFaHPp", "htmlBody": "<p><i>In theory,</i> publishing X and patenting X are both equally valid ways to prevent other people from patenting X. Does it not work that way in practice?</p><p>Could be wrong, but I had the impression that software companies have historically amassed patents NOT because patenting X is the best way to prevent another company from patenting the exact same thing X or things very similar to X, but rather because “the best defense is a good offense”, and if I have a dubious software patent on X and you have a dubious software patent on Y then we can have a balance of terror so that neither wants to sue the other. (That wouldn’t help defend Microsoft against patent trolls but <i>would</i> help defend Microsoft against Oracle etc.)</p><p>Possibly related? <a href=\"https://www.tdcommons.org/\">“Technical Disclosure Commons”</a>, <a href=\"https://en.wikipedia.org/wiki/IBM_Technical_Disclosure_Bulletin\">IBM Technical Disclosure Bulletin</a>, <a href=\"https://en.wikipedia.org/wiki/Defensive_publication\">Defensive Publication</a>.</p><p>IANAL.</p>", "parentCommentId": "dQFFzFChgBdiFKpK3", "user": {"username": "steve2152"}}, {"_id": "chjpt2pgpvzHsF5BW", "postedAt": "2023-09-01T03:12:03.954Z", "postId": "X2w4uqjDuGPJFaHPp", "htmlBody": "<p>If you publish it, a third party could make a small tweak and apply for a patent. If you patent it, a third party could make a small tweak and apply for a patent. What do you see as the difference? Or sorry if I’m misunderstanding the rules.</p>", "parentCommentId": "pENWYLyBj52nAzorD", "user": {"username": "steve2152"}}, {"_id": "HtMrSQBbH5gFKxsvg", "postedAt": "2023-09-01T10:34:09.680Z", "postId": "X2w4uqjDuGPJFaHPp", "htmlBody": "<p>Oh man, tough situation, and also congrats and this sounds awesome and admiration that you're thinking about this question.</p><p>As other commenters, I don't know the first thing about patents. Have you talked to a lawyer, including to figure out whether you can patent in a way that doesn't involve the Tech Transfer office (so much)?</p>", "parentCommentId": null, "user": {"username": "Chi"}}, {"_id": "X37F4EYwY2qMjooXv", "postedAt": "2023-09-01T17:17:14.576Z", "postId": "X2w4uqjDuGPJFaHPp", "htmlBody": "<p>I don't know how any of this works, but is it a possibility for you to tell the Tech Transfer office that you will let them file the patent conditionally on it being free-license/non-limiting, otherwise you will publish it open-source? In line with TeddyW's response — it sounds like licensing with \"altruistic clauses\" is something that the Tech Transfer office would be opposed to, given that they are for-profit; but maybe you have some leverage because presumably they have some incentive to file for the patent rather than it being fully open-source..?</p>", "parentCommentId": "mDL6Jf4FCuTzafKz9", "user": {"username": "LiterallyLimitless"}}, {"_id": "kQjQLWxgfqNqWz8uZ", "postedAt": "2023-09-02T18:35:02.900Z", "postId": "X2w4uqjDuGPJFaHPp", "htmlBody": "<p>Are you under a contractual obligation to go through the tech transfer office? Could you in theory patent it on your own, with the help of an independent attorney?</p>\n", "parentCommentId": "fweK4ESRxBCSKFxuK", "user": {"username": "James Payor"}}]