[{"_id": "2aRpLhKjYFHiRcYkL", "postedAt": "2024-02-22T15:45:18.093Z", "postId": "X65Lxnd4hbGpuMq78", "htmlBody": "<p>On the LMIC migration platform, I found this UK based for-profit doing what looks like a similar thing:</p>\n<p><a href=\"https://www.getborderless.io/about-us\">https://www.getborderless.io/about-us</a></p>\n", "parentCommentId": null, "user": {"username": "Gemma Paterson"}}, {"_id": "Gj8xC4v7NFy4otX6Z", "postedAt": "2024-02-22T16:31:14.428Z", "postId": "X65Lxnd4hbGpuMq78", "htmlBody": "<p>Hi Gemma, thanks for sharing! That platform indeed has several similarities with our proposed nonprofit idea (though also some differences, such as our focus low- and mid-skilled workers and on a specific country of origin rather than a specific destination country). Exciting to see more work being done in this otherwise quite neglected space!</p>", "parentCommentId": "2aRpLhKjYFHiRcYkL", "user": {"username": "Filip_Murar"}}, {"_id": "frKKeWR7TP5skJFW5", "postedAt": "2024-02-23T09:42:16.212Z", "postId": "X65Lxnd4hbGpuMq78", "htmlBody": "<p>That's great that you are focusing on low and mid-skill workers. Its a complicated question, but I think that moderate high skill workers leaving low and middle income for western jobs can be net-negative, especially in the healthcare field - for example the flood of West African doctors and nurses heading to Europe and the Middle east at the moment. I really like that some countries like Nigeria are bonding medical staff for 2+ years after they complete their training.<br><br><a href=\"https://www.semafor.com/article/02/15/2024/nigerian-nurses-reject-rules-attacking-japa\">https://www.semafor.com/article/02/15/2024/nigerian-nurses-reject-rules-attacking-japa</a></p><p>Sometimes though there can be claims of \"overproduction\" of positions such as nurses like in Kenya, but when public hospitals are grossly understaffed then why is the governement spending money on training nurses rather than actually putting the resources directly into their medical system?</p><p><a href=\"https://ntvkenya.co.ke/news/we-are-overproducing-graduates-health-ps-defends-govt-plan-to-export-nurses/\">https://ntvkenya.co.ke/news/we-are-overproducing-graduates-health-ps-defends-govt-plan-to-export-nurses/</a></p>", "parentCommentId": "Gj8xC4v7NFy4otX6Z", "user": {"username": "NickLaing"}}, {"_id": "hCPeD9ECCiFGz2kGj", "postedAt": "2024-02-23T10:46:10.554Z", "postId": "X65Lxnd4hbGpuMq78", "htmlBody": "<p>CGD has a <a href=\"https://www.cgdev.org/blog/uk-recruitment-nigerian-nurses-can-be-win-win\">different take</a> on this type of migration.<br><br>\"Between the start of 2021 and 2022, the number of Nigerian-born nurses joining the UK nursing register more than quadrupled, an increase of 2,325. Becker’s human capital theory would suggest that this increase in the potential wages earned by Nigerian-trained nurses should lead to an increase in Nigerians choosing to train as nurses. So what happened? Between late 2021 and 2022, the number of successful national nursing exam candidates increased by 2,982—that is, more than enough to replace those who had left for the UK.\"<br><br>\"To fully realise these benefits, Nigeria would need to embrace emigration, realising that nurses are likely going to leave anyway and doing everything they can to reap the benefits. Yet, they appear to be doing the opposite. New guidelines announced on 7 February 2024 state that nurses must work for two and half years before being allowed to work overseas, a move nurses contest. This policy is far from optimal; restrictions on emigration are inefficient, inequitable, and unethical. Indeed, Ghana had a similar scheme, but ended up scrapping it because they were unable to employ all of their nurse trainees at home.\"</p>", "parentCommentId": "frKKeWR7TP5skJFW5", "user": {"username": "DavidNash"}}, {"_id": "vH8SSuKJv5YNPAaTA", "postedAt": "2024-02-23T12:45:56.652Z", "postId": "X65Lxnd4hbGpuMq78", "htmlBody": "<p>Thanks David appreciate the article - I think its a good indication of how complex the question of immigration &nbsp;is and how I don't think its a slamdunk in either direction.</p><p>My impression is though that the article is a pretty poorly researched and misleading piece - even though some of its arguments might still stand in many cases despite that.<br><br>First its weird that the article makes zero mention of the state of the Nigerian health system, nor how this mass emmigration might be affecting it. Is staffing getting better or worse? Are outcomes getting better or worse? How many nurses are actually needed in the system? Building your entire argument on \"nurses trained\" vs \"nurses immigrating to England\" seems quite short sighted and reductionst.</p><p>Second (<strong>probably most important)</strong>, they only taken into account nurses leaving for England - a weird comparison decision. That 2300 nurses left for england that year is fairly irrelevant, what matters is the total number. Nurses leave for other european countries and the middle east too .The Nigerin government says 42,000 nurses left in the last 3 years, that's 14,000 a year, more than they are even training per year.&nbsp;</p><p><a href=\"https://africa.cgtn.com/nigeria-says-42000-nurses-left-the-country-in-3-years/\">https://africa.cgtn.com/nigeria-says-42000-nurses-left-the-country-in-3-years/</a></p><p>So their basic argument that enough new nurses are being trained is bogus</p><p>In addition, you must consider the increasing population. The population of Nigeria has grown by 5,000,000 people in that one year (2.5% increaser ). Nigeria has something like<a href=\"https://banyanglobal.com/story/strengthening-nursing-and-midwifery-education-in-nigeria-by-partnering-to-revise-the-nursing-and-midwifery-curricula/#:~:text=In%20March%202020%2C%20there%20were,364%20women%20of%20reproductive%20age.\"> 180,000 nurses.&nbsp;</a> This means even just to maintain their already poor nursing ratios, they would need to train and put into the workforce an extra 3000 or so nurses each year <i><strong>just to maintain the status quo, without even improving nurse/population ratios.</strong></i></p><p>Its also likely that many of the <i><strong>the best and brightest </strong></i>that are leaving Nigeria. They are more likely to pass English exams and be accepted (unless they cheat as ofen happens) and have the drive and gumption to try and move overseas. My guess would be its most likely that England is taking the better nurses to work in a health system that is 10x better while leaving the lower quality nurses in Nigeria, the health system which really needs the best nurse to lead and drive the system. The qualification itself is only a small part of the story, the difference in ability, skills and leadership potential between nurses is immense.<br><br>There are also other second order effects, If you've ever been in a country where many people are trying to emmigrate because many people are leaving, its hard to retain stability in your hospitals and health systems. People are distracted and staff turnover is high and morale can be low. This can really hurt productivity of those who remain.</p><p>I'm also more concerned about Doctors than nurses - but that's a whole nother story.</p><p>I probably wasted too much time hacking away at this poor article, but it annoyed me a little ;). I'm not anti immigration at all, but I am for medical staff in this kind of scenario and there are many, many factors to consider in the discussion.</p>", "parentCommentId": "hCPeD9ECCiFGz2kGj", "user": {"username": "NickLaing"}}, {"_id": "a9AQPn5LykzGaJfng", "postedAt": "2024-02-23T18:01:56.411Z", "postId": "X65Lxnd4hbGpuMq78", "htmlBody": "<p>Thanks for raising this point, Nick, and for the many good arguments you’re making!</p><p>Out of all the forms of labor emigration, I find physician and nurse migration to be the most concerning. I’d stress that the idea proposed in our report doesn’t focus on skilled workers (only as a potential later extension, needing careful consideration), so it largely avoids this concern. We focus on low- and mid-skilled workers, as those are poorer to begin with, much more numerous, and there’s an oversupply of them in many LMICs (as opposed to shortages).</p><p>I did spend a little bit of time looking into the literature on brain drain and didn’t arrive at a clear conclusion. There are many factors pointing in different directions, and whether the overall effect is net positive or net negative may vary between countries and professions.</p><p>Aside from the considerations that you and David mentioned, there are also remittances, the effects of return migration (the rates of which vary a lot) and associated \"brain gain\", or the fact emigrating physicians are more likely to come from well-staffed urban areas. E.g. this (very old) <a href=\"https://foreignpolicy.com/2009/10/22/think-again-brain-drain/\">article</a> by Clemens and McKenzie says that, in Kenya, some 66% of physicians live in Nairobi where only 8% of the national population lives. They argue that low incentives to work in rural areas are a much bigger problem than the total supply of physicians (and how that supply is affected by emigration).</p><p>Concerning the CGD, I’m actually quite excited about their efforts to push for so-called <a href=\"https://gsp.cgdev.org/\">global skills partnerships</a> in the skilled space. Within these programs, countries like the UK would pay countries like Nigeria to train nurses and have agreed quotas on how many nurses can stay vs migrate. This seems like a more sophisticated solution to the issue than saying “nurse emigration is good.” <a href=\"https://www.cgdev.org/publication/global-skill-partnership-nursing-between-nigeria-and-uk\">Here</a> is their proposal specifically for Nigeria.</p><p>In any case, this is not a topic that we at CE decided to focus on at this point. If we do look into skilled migration in the future, we will do a much more thorough dive (and will be keen to get your input!).</p>", "parentCommentId": "vH8SSuKJv5YNPAaTA", "user": {"username": "Filip_Murar"}}, {"_id": "CZgCef2ukQxXSnPkR", "postedAt": "2024-02-25T08:59:25.976Z", "postId": "X65Lxnd4hbGpuMq78", "htmlBody": "<p>Thanks those are all great points nice one and I agree with almost all of that. Again love the focus on low skill workers</p><p>On supply and medical staff<br><i>\"They argue that low incentives to work in rural areas are a much bigger problem than the total supply of physicians (and how that supply is affected by emigration).\"</i></p><p>The funny thing is that a big part of that exact issue there <i><strong>may well be supply</strong></i>! If there were more than enough doctors to fill roles in cities, and they struggled to emigrate (doctors find this far easier than other professionals) then doctors would be pushed into working in rural places as that's where the jobs&nbsp;<br><br>My example to back this up is that in Uganda there's a massive oversupply of nurses, and it means in search of jobs many open drug shops in the village and many are willing to work in rural areas. We have no problem at all recruiting at OneDay Health. <strong>Supply is a huge factor.</strong></p>", "parentCommentId": "a9AQPn5LykzGaJfng", "user": {"username": "NickLaing"}}]