[{"_id": "xJrRxKEuANKQmmofR", "postedAt": "2022-12-20T23:25:27.310Z", "postId": "X8oA5XvHYoPSndvCj", "htmlBody": "<p>The answer to this question probably depends to a substantial degree on your particular strengths, weaknesses, and beliefs about biorisk (that is: on how you’re hoping to contribute, what sort of research you’re hoping to do, etc.).</p>\n", "parentCommentId": null, "user": {"username": "HStencil"}}, {"_id": "tJf6BqvhE4aonZcnz", "postedAt": "2022-12-20T23:28:55.353Z", "postId": "X8oA5XvHYoPSndvCj", "htmlBody": "<p>I think this largely depends on what you're good at. Studying Biology is a very different experience from studying Bioinformatics. &nbsp;You can also consider studying public health, which is again very different. Maybe you want to apply to 80000hours.org/speak for counseling :)</p>", "parentCommentId": null, "user": {"username": "ludwigbald"}}, {"_id": "xL3AYFoeGGTxKzc6s", "postedAt": "2022-12-21T00:01:50.675Z", "postId": "X8oA5XvHYoPSndvCj", "htmlBody": "<p>I have applied, but they rejected me 🙁\nI know that it varies greatly from person from person (I have read 80.000 hours' page on personal fit), but what is the best undergraduate degree in general, not taking personal fit into consideration?</p>\n", "parentCommentId": "tJf6BqvhE4aonZcnz", "user": {"username": "Eduardo Luís Carls "}}, {"_id": "Bh3ZpuQsLvquMoFnr", "postedAt": "2022-12-21T00:03:24.379Z", "postId": "X8oA5XvHYoPSndvCj", "htmlBody": "<p>But have no idea on where to start. Please, just give me some direction, if you are able to.</p>\n", "parentCommentId": "xJrRxKEuANKQmmofR", "user": {"username": "Eduardo Luís Carls "}}, {"_id": "XiFEzuhBC9i5BxYqo", "postedAt": "2022-12-21T01:42:20.022Z", "postId": "X8oA5XvHYoPSndvCj", "htmlBody": "<p>Math or CS keeps your options open. Can you do a joint or double major like math/bio or CS/bio?</p>", "parentCommentId": null, "user": {"username": "Lixiang"}}, {"_id": "oBHd3mHZjr5bi2rCQ", "postedAt": "2022-12-21T02:59:27.134Z", "postId": "X8oA5XvHYoPSndvCj", "htmlBody": "<p>CS=Computing Science? How is computing science relevant to this field?</p>\n<p>I haven't considered taking two undergraduate degrees at once. I'll think about it.</p>\n", "parentCommentId": "XiFEzuhBC9i5BxYqo", "user": {"username": "Eduardo Luís Carls "}}, {"_id": "Mvcwr5PRCECFQj7gt", "postedAt": "2022-12-21T03:25:10.059Z", "postId": "X8oA5XvHYoPSndvCj", "htmlBody": "<p>I agree with the other comments saying that it depends on your interests and strengths, but empathise that this isn't as helpful as you were hoping. When do you need to decide? And what universities are you considering?</p><p>To flesh out the generic advice - biorisk is inherently a multidisciplinary area, and there's a large number of academic fields that are useful. The current cadre of leaders in the field are generally all people who began their career within a particular discipline and then turned to biorisk more in their mid-career.</p><p>&nbsp;No one is an expert on all of the relevant disciplines, and in my view there isn't a single 'best' undergraduate. Still, some are more useful than others. In general I'd expect courses with harder skills &nbsp;(like stats, modelling, economics etc.) might be more valuable than courses that are primarily about content. This is mainly because you can often learn &nbsp;content by reading and writing, but this is harder for more technical skills. Also, consider what proportion of the course is relevant to what you think is important. For example, I just finished my medical degree, and while its a useful qualification in the area, most of the content isn't very useful for biorisk.&nbsp;</p><p>&nbsp;I think your best approach is to read a bit (don't feel obligated to read everything! be selective and skim!) from lots of different areas of the problem. See what strikes you as interesting or fun to read and think about. Here are some good reading lists: <a href=\"https://docs.google.com/document/d/14xGN4yv_hvk6lAH-EWE3svyYEKcqiJiH03Bipmyj-gY/edit#heading=h.a9qqmc6ms5po\">Greg Lewis'</a>, <a href=\"https://forum.effectivealtruism.org/posts/iAowzcZm87wNrTQCb/a-biosecurity-and-biorisk-reading-list\">Tessa Alexanian's</a>, <a href=\"https://docs.google.com/document/d/10_UEhNYvGPnHMaqnVk_kk4Vpugvh6d_th5rZ1CMKukU/edit\">Chris Bakerlee's</a>.&nbsp;</p><p>In general, I don't think my or anyone else's view should strongly influence your decision - we're all often wrong and the field/problem can change quickly! It's more robust to try exploring relevant domains and seeing what you like. I assume you're a young person given you're pre-undergrad - so exploration is really important right now! The most important determinant of your future contribution to the area (or another area if it strikes your fancy) is your future health, wellbeing, and interest in your work - not what your major was!</p>", "parentCommentId": null, "user": {"username": "BenStewart"}}, {"_id": "qcamJFHAbhetKgTof", "postedAt": "2022-12-21T03:56:47.778Z", "postId": "X8oA5XvHYoPSndvCj", "htmlBody": "<p>Physical engineering (i.e. not software engineering) is another option if you're interested in a STEM field. For some examples of projects you could work on with an engineering skillset you can look at <a href=\"https://forum.effectivealtruism.org/posts/Bd7K4XCg4BGEaSetp/biosecurity-needs-engineers-and-materials-scientists\">https://forum.effectivealtruism.org/posts/Bd7K4XCg4BGEaSetp/biosecurity-needs-engineers-and-materials-scientists</a> . I'm not sure if it's the best undergraduate degree for research in biorisk but I think it's a valid option for biorisk more generally.</p>\n<p>(Disclaimer: I help run High Impact Engineers)</p>\n", "parentCommentId": null, "user": {"username": "Sean Lawrence"}}, {"_id": "DnDpxeKemwaQLfXat", "postedAt": "2022-12-21T04:51:14.227Z", "postId": "X8oA5XvHYoPSndvCj", "htmlBody": "<p>CS=Computer Science. The key thing is that once you learn a bunch of math (and some coding skills), you will be able to pick up other fields way more easily than vice-versa.&nbsp;</p><p>CS would have some classes in software engineering and data science and would also give skills.&nbsp;</p>", "parentCommentId": "oBHd3mHZjr5bi2rCQ", "user": {"username": "Lixiang"}}, {"_id": "wjabYFRRYGKeEDCTp", "postedAt": "2022-12-21T04:52:25.666Z", "postId": "X8oA5XvHYoPSndvCj", "htmlBody": "<p>Here is how you can get the definitive answer to this question for your particular case.</p><p>1. Make your own initial best guess about what the best discipline for you to study is, backed up by as much research as you can do. Make sure you read through some stuff from the biorisk syllabi Ben Stewart linked, study who employs biorisk researchers and what their qualifications are, and pay particular attention to the details of the careers of biorisk researchers you personally admire.</p><p>2a. Make a post to the EA Forum called \"If you want to research biorisk, study X,\" where X is the degree course you have provisionally concluded is best for you to become a biorisk researcher. Present your arguments for why degree X is better than degrees Y, Z, etc., based on your research. Your post should be lengthy. You have now made a public, controversial, and certainly oversimplified claim with which some people will disagree, and they will reply to your post with well-reasoned arguments about why you are wrong. This will expose gaps and flaws in your thinking and give you much more information to make your decision. It may also connect you with new conversation partners you can ask for additional help and advice.</p><p>2b. Alternatively, contact as many leaders in biorisk research as you can and interview them about what course of study they think is best, using your research from Part 1 to identify who to interview and to formulate good questions that will elucidate what you most care about in making your decision. Then, write up what they tell you in a post to the forum: \"20 biorisk leaders on how to get into biorisk research\" or something like that. You could append a note or comment with what you personally concluded for yourself based on doing the interviews. People will reply to your post with additional information.</p><p>Good luck with your decision!</p>", "parentCommentId": null, "user": {"username": "kl"}}, {"_id": "e4CpvAfDpCgnzgbRP", "postedAt": "2022-12-21T15:05:42.543Z", "postId": "X8oA5XvHYoPSndvCj", "htmlBody": "<p>Thank you!</p>\n", "parentCommentId": "Mvcwr5PRCECFQj7gt", "user": {"username": "Eduardo Luís Carls "}}, {"_id": "DoLyQTEXo5pj7vmKz", "postedAt": "2022-12-21T15:09:07.291Z", "postId": "X8oA5XvHYoPSndvCj", "htmlBody": "<p>I'll do that, thank you!</p>\n", "parentCommentId": "wjabYFRRYGKeEDCTp", "user": {"username": "Eduardo Luís Carls "}}, {"_id": "J94jkHXf8Tdo7cCjE", "postedAt": "2022-12-30T22:55:55.676Z", "postId": "X8oA5XvHYoPSndvCj", "htmlBody": "<p>If you like everything equally and are equally good at everything, I’d say biology at undergrad.</p>\n", "parentCommentId": null, "user": {"username": "freedomandutility"}}]