[{"_id": "damwTyz2ppurAHhR3", "postedAt": "2022-09-09T14:15:49.807Z", "postId": "XBHx9zhAtkiBJnZNu", "htmlBody": "<p>Amazing to see the variation and the effort put into the contributions here - a joy to skim through. Well done everyone!&nbsp;</p>", "parentCommentId": null, "user": {"username": "Simon Holm"}}, {"_id": "E7p3wCRZMMHw4mreX", "postedAt": "2022-09-09T15:39:17.157Z", "postId": "XBHx9zhAtkiBJnZNu", "htmlBody": "<p>Could you elaborate what made the top 4 stand out specifically?</p>\n<p>Is there any chance that I could get feedback on my submission, which hasn't received a prize?\n<a href=\"https://forum.effectivealtruism.org/posts/njgRDx5cKtSM8JubL/long-covid-mass-disability-and-broad-societal-consequences\">https://forum.effectivealtruism.org/posts/njgRDx5cKtSM8JubL/long-covid-mass-disability-and-broad-societal-consequences</a></p>\n", "parentCommentId": null, "user": {"username": "SiebeRozendal"}}, {"_id": "z2xq8tZgFvvdvKFHK", "postedAt": "2022-09-09T18:26:50.443Z", "postId": "XBHx9zhAtkiBJnZNu", "htmlBody": "", "parentCommentId": null, "user": {"username": "trevorw96"}}, {"_id": "3XZRLSWDH2mAd4K7N", "postedAt": "2022-09-09T18:43:20.891Z", "postId": "XBHx9zhAtkiBJnZNu", "htmlBody": "<p>How do you square that with the success of the Center for Pesticide Suicide Prevention in advocating for some pesticides to be banned in dozens of countries? Even if the CPSP wasn't instrumental in all of these cases, it doesn't seem to have been destroyed by the food and farming lobbies.</p>\n", "parentCommentId": "z2xq8tZgFvvdvKFHK", "user": {"username": "therealslimkt"}}, {"_id": "sWkjfz8koGcqhLekY", "postedAt": "2022-09-09T19:41:40.873Z", "postId": "XBHx9zhAtkiBJnZNu", "htmlBody": "", "parentCommentId": "3XZRLSWDH2mAd4K7N", "user": {"username": "trevorw96"}}, {"_id": "FYzBKA25fkbgpNBxh", "postedAt": "2022-09-09T21:09:29.261Z", "postId": "XBHx9zhAtkiBJnZNu", "htmlBody": "<p>I am not super clear on the delineation between DNT pesticides and suicide-risk pesticides and their relative importance so I'll defer to you.</p>\n", "parentCommentId": "sWkjfz8koGcqhLekY", "user": {"username": "therealslimkt"}}, {"_id": "uJSzEqdng2FtgAkEm", "postedAt": "2022-09-09T21:57:14.319Z", "postId": "XBHx9zhAtkiBJnZNu", "htmlBody": "<p>Holy moly thank you! I'm very honoured, especially given there were so many interesting and brilliant submissions. Congratulations to all the other winners!</p>\n", "parentCommentId": null, "user": {"username": "BenStewart"}}, {"_id": "udhX9x3ZNvPB7ZPSe", "postedAt": "2022-09-09T22:06:06.787Z", "postId": "XBHx9zhAtkiBJnZNu", "htmlBody": "<p>I think you're right that industry pushback/inertia is a key consideration, and that pesticide suicides are a much more tangible harm to motivate regulation.</p>\n<p>However, I think things are much more uncertain than you suggest. Industry have been quite on-board with the related international movement against 'highly hazardous pesticides' and the optics of 'slowly poisoning pregnant women and reducing their kids' potential' may be a compelling narrative for regulatory action.</p>\n<p>But I really don't know - I'd be very interested to see what CPSP staff reckon.</p>\n", "parentCommentId": "sWkjfz8koGcqhLekY", "user": {"username": "BenStewart"}}, {"_id": "HdTkJfmPcL8JjenKE", "postedAt": "2022-09-09T23:26:27.880Z", "postId": "XBHx9zhAtkiBJnZNu", "htmlBody": "", "parentCommentId": "udhX9x3ZNvPB7ZPSe", "user": {"username": "trevorw96"}}, {"_id": "wqF5caXwQEKSr5KKo", "postedAt": "2022-09-10T02:51:56.626Z", "postId": "XBHx9zhAtkiBJnZNu", "htmlBody": "<p>Manifold Markets ran a prediction tournament to see whether forecaster would be able to predict the winners! For each Cause Exploration Prize entry, we had a market on \"Will this entry win first or second place?\". Check out the tournament rules and view all predictions <a href=\"https://manifold.markets/group/predict-cep/about\">here.</a></p><p>I think overall, the markets did okay -- they managed to get the first place entry (\"Organophosphate pesticides and other neurotoxicants\") as the highest % to win, and one of the other winners was ranked 4th (\"Violence against women and girls\"). &nbsp;However, they did miss out on the two dark horse winners (\"Sickle cell disease\" and \"shareholder activism\"), which could have been one hypothetical way markets would outperform karma. Specifically, none of the Manifold forecasters placed a positive YES bet on either of the dark horse candidates.</p><figure class=\"image image_resized\" style=\"width:75.83%\"><img src=\"https://firebasestorage.googleapis.com/v0/b/mantic-markets.appspot.com/o/user-images%2Fdefault%2Fk8EdKEAbqz.png?alt=media&amp;token=67aa660c-cc27-49f6-95f3-155929b6d47a\"></figure><p>&nbsp;</p><p>I'm not sure that the markets were much better predictors than just EA Forum Karma -- and it's possible that most of the signal from the markets were just forecasters incorporating EA Forum Karma into their predictions. The top 10 predictions by Karma also had 2 of the 1st/2nd place winners:</p><figure class=\"image image_resized\" style=\"width:77.37%\"><img src=\"https://firebasestorage.googleapis.com/v0/b/mantic-markets.appspot.com/o/user-images%2Fdefault%2FfphHCof9IH.png?alt=media&amp;token=d95bd387-8ba6-4ad9-8034-ed77d1a72c13\"></figure><p>And if you include honorable mentions in the analysis, EA Forum Karma actually did somewhat better. Manifold Markets had 7/10 \"winners\" (first/second/honorable), while EA Forum Karma had 9/10.</p><p>Thanks again for the team at OpenPhil (especially Chris and Aaron) for hosting these prizes and thereby sponsoring so many great essays! Would love to see that writeup about learnings, especially curious what the decision process was that lead to these winners and honorable mentions.</p>", "parentCommentId": null, "user": {"username": "akrolsmir"}}, {"_id": "8nJ2FpznnEGiort5Q", "postedAt": "2022-09-10T06:05:10.799Z", "postId": "XBHx9zhAtkiBJnZNu", "htmlBody": "<p>Thank you for working on this, and congratulations to all the winners! Just wanted to mention that I think that it could be good to have a running competition for suggesting new cause areas on the forum, with an annual awards process. Suggesting new causes seems like a valuable activity to prompt and incentivise.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Peterslattery"}}, {"_id": "eBSe6cYTbPAEb4r4G", "postedAt": "2022-09-10T07:37:22.377Z", "postId": "XBHx9zhAtkiBJnZNu", "htmlBody": "<p>Okay fair. And I just remembered something during my research that strengthens your point - there are a few papers critiquing the neurotoxic effect of organophosphates. And if memory serves all of them were authored by and/or sponsored by the pesticide industry. So there is pre-existing industry pushback!</p>\n", "parentCommentId": "HdTkJfmPcL8JjenKE", "user": {"username": "BenStewart"}}, {"_id": "wyKvsmvgebt87hJPi", "postedAt": "2022-09-10T08:59:21.861Z", "postId": "XBHx9zhAtkiBJnZNu", "htmlBody": "<p>This was a great event which I followed very closely indeed. It generated so much interesting exploration of different areas and I learned so much about the world I live in.<br><br>I just want to add that the idea of having 'good-faith' submission prizes was a fantastic addition, and really helped level the playing field for people who otherwise might not have been able to contribute. &nbsp;I heard from a couple of people that they may not have been able to submit without them. I'd love to see more of these in similar contests in future.</p>", "parentCommentId": null, "user": {"username": "Luke Chambers"}}, {"_id": "mjsxd6QsMe7et4Zdg", "postedAt": "2022-09-10T10:58:42.270Z", "postId": "XBHx9zhAtkiBJnZNu", "htmlBody": "<p>Congratulations on running the competition. Reading and judging over 150 essays is no mean feat.</p>\n<p>Interested to hear what the next steps will be for the ideas within these submissions, and excited to hear about any new projects or funding streams in these areas.</p>\n", "parentCommentId": null, "user": null}, {"_id": "jnATFLEbziFoXBLfd", "postedAt": "2022-09-12T09:37:02.279Z", "postId": "XBHx9zhAtkiBJnZNu", "htmlBody": "<p>This makes me interested to know whether EA Forum engagement and the (real or perceived) popularity of these topics among the community contributed to Open Philanthropy's decision-making process.&nbsp;</p><p>I am hugely grateful for the opportunity and participation award, but I'm sure like many other contest entrants, I &nbsp;submitted my entry in the belief that my cause area (TB) met and even exceeded the neglectedness, tractability, and cost-effectiveness criteria. The above post suggests to me that maybe other criteria were used. Can entrants expect anything in the way of feedback or some general comments on how entries were selected?</p><p>Congratulations to the winners, and thank you to Open Philanthropy for taking this initiative. I would welcome another like it in the future.</p>", "parentCommentId": "wqF5caXwQEKSr5KKo", "user": {"username": "jserv"}}, {"_id": "suDWWxQ84RKSqDhbY", "postedAt": "2022-09-12T13:11:53.973Z", "postId": "XBHx9zhAtkiBJnZNu", "htmlBody": "<p>Out of curiosity, which parts of  Austin’s comment suggests to you something about the criteria used?</p>\n", "parentCommentId": "jnATFLEbziFoXBLfd", "user": {"username": "bec_hawk"}}, {"_id": "javrarGXdBLJ4mFfW", "postedAt": "2022-09-13T08:26:43.148Z", "postId": "XBHx9zhAtkiBJnZNu", "htmlBody": "<p>Mainly that forum karma was highly predictive of winners when you include honourable mentions, even moreso than Manifold Markets. It could be for several reasons; forum votes were taken into consideration, there was a high degree of alignment between forum voters and the Open Philanthropy panel on the known call criteria (slightly more than MM, another related community), karma acted as a proxy for something else that factored into selection like timing of the submission, general community interest, familiarity with the topic, or true quality of the submissions, or it could be chance.</p><p>As an entrant, I am very interested to know whether any of the above played a role. Also, Open Philanthropy have mentioned this was an experiment, so it would be great to know whether anything unexpected came up during their decision-making.</p>", "parentCommentId": "suDWWxQ84RKSqDhbY", "user": {"username": "jserv"}}, {"_id": "SxynW9j54Luqk5wfD", "postedAt": "2022-09-13T09:40:31.980Z", "postId": "XBHx9zhAtkiBJnZNu", "htmlBody": "<p>Hi Siebe - thank you again for your entry! Unfortunately we don't have capacity to provide feedback on every submission. There were many useful and interesting pieces of work that didn't receive a prize.</p>", "parentCommentId": "E7p3wCRZMMHw4mreX", "user": {"username": "ChrisSmith"}}, {"_id": "7ahBt35DZokcdCHjk", "postedAt": "2022-09-13T09:50:38.564Z", "postId": "XBHx9zhAtkiBJnZNu", "htmlBody": "<p>Hi jserv! I'll aim to say a bit more about the nuts and bolts of the process in an update before the end of the year, but prize selection was dominated by blind, independent review. I'm following up with you privately on tuberculosis.</p>", "parentCommentId": "jnATFLEbziFoXBLfd", "user": {"username": "ChrisSmith"}}, {"_id": "QyExmFWnnKF9FJLJK", "postedAt": "2022-09-13T10:50:59.691Z", "postId": "XBHx9zhAtkiBJnZNu", "htmlBody": "<p>Thank you!&nbsp;</p>", "parentCommentId": "7ahBt35DZokcdCHjk", "user": {"username": "jserv"}}, {"_id": "N7wCQn89vtonxW8NW", "postedAt": "2022-09-13T15:16:49.556Z", "postId": "XBHx9zhAtkiBJnZNu", "htmlBody": "<p>Thank you Chris, that's understandable.</p>\n<p>How about public feedback on just the top 4 though? Or even just the #1. I find it odd that,  in a competition of this scale, no specific reasons are provided for why you picked these winners.</p>\n<p>A lot of people put a lot of effort into these reports. Providing reasons why you pick certain winners seems to be like a basic aspect of running a competition in a way that's respectful to participants. This helps participants to compare their own submissions and learn from that. (I think the reward for good faith submissions is a nice contribution to that, and I'm grateful for it, but I don't think it's a replacement)</p>\n", "parentCommentId": "SxynW9j54Luqk5wfD", "user": {"username": "SiebeRozendal"}}, {"_id": "top7aKvz3NBbRWRrP", "postedAt": "2022-09-13T15:21:49.015Z", "postId": "XBHx9zhAtkiBJnZNu", "htmlBody": "<p>I briefly worked in a research consortium which worked on the EUs precautionary principle, which is under attack by industry: they're basically raising the bar for evidence and definitely push back against regulation a lot.</p>\n<p>See eg this: <a href=\"https://corporateeurope.org/en/environment/2018/12/innovation-principle-trap\">https://corporateeurope.org/en/environment/2018/12/innovation-principle-trap</a></p>\n", "parentCommentId": "eBSe6cYTbPAEb4r4G", "user": {"username": "SiebeRozendal"}}, {"_id": "8xKydm2FbZnWDAs4L", "postedAt": "2022-09-15T16:29:49.347Z", "postId": "XBHx9zhAtkiBJnZNu", "htmlBody": "<p>I'm glad to see SCD on the list. &nbsp;But I feel compelled to point out that SCD is 100% preventable with carrier genetic screening and IVF/PGT-M (pre-implantation genetic testing). &nbsp;Thus any strategy to address SCD should definitely include increasing access to IVF/PGT in low resource countries.</p>", "parentCommentId": null, "user": {"username": "Paula Amato"}}, {"_id": "tPqCbYQXtMcivsPhD", "postedAt": "2022-09-15T16:49:00.150Z", "postId": "XBHx9zhAtkiBJnZNu", "htmlBody": "<p>This is a great point that even just explaining why the submission/s that won did so is useful to other participants</p>\n", "parentCommentId": "N7wCQn89vtonxW8NW", "user": {"username": "bec_hawk"}}, {"_id": "umRRY7jTnchqWcbPg", "postedAt": "2022-09-15T23:01:31.131Z", "postId": "XBHx9zhAtkiBJnZNu", "htmlBody": "<blockquote>\n<p>Thus any strategy to address SCD should definitely include increasing access to IVF/PGT in low resource countries.</p>\n</blockquote>\n<p>That's a pretty bold claim. Are you sure that would be more cost-effective than the newborn screening and treatment intervention proposed in that post? IVF seems pretty expensive compared to the costs of screening and treatment.</p>\n", "parentCommentId": "8xKydm2FbZnWDAs4L", "user": {"username": "Erich_Grunewald"}}, {"_id": "eKmF3jNRJZdiPMBy8", "postedAt": "2022-09-16T16:52:03.007Z", "postId": "XBHx9zhAtkiBJnZNu", "htmlBody": "<p>Here is an analysis of Huntington's Disease. &nbsp;</p><p><a href=\"https://pubmed.ncbi.nlm.nih.gov/35618525/\">https://pubmed.ncbi.nlm.nih.gov/35618525/</a></p><p>&nbsp;</p><p>Not sure if a similar one has been done for SCD. &nbsp;But it's not hard to imagine that eradication of a disease in a population is much more cost-effective (especially in the long, long term) than continuing to create billions more people with SCD and treating them with increasingly expensive therapies eg gene therapies (despite what pharmaceutical companies would have you believe).</p>", "parentCommentId": "umRRY7jTnchqWcbPg", "user": {"username": "Paula Amato"}}, {"_id": "bzfe9yFcYD62A2WGd", "postedAt": "2022-09-18T13:47:43.347Z", "postId": "XBHx9zhAtkiBJnZNu", "htmlBody": "<p>Looking at the winners/honorable mentions of the prizes - I'm struck by how new most of those mentioned are to the forum.</p><p>Of the 26 names above who had a join date next to them, the median date of joining was 2021.</p><p>Only 3 people had posted on the forum for more than 5 years.</p><p>Of the 20 names I could easily identify as male/female; 9 were female and 11 were male.&nbsp;</p>", "parentCommentId": null, "user": null}, {"_id": "eBCZuzWCDEgGdAKpX", "postedAt": "2022-10-07T15:09:38.357Z", "postId": "XBHx9zhAtkiBJnZNu", "htmlBody": "<p>David Nash and I are organising a lightning talk session where we hope to feature presentations of several new cause ideas from the contest. If you submitted an entry and happen to be in London on 25th October, we'd love you to come along to the event with a short presentation. If you're interested, please get in touch. Here are more <a href=\"https://effectivealtruism.uk/events/2022/10/25/londonsocial\">details about&nbsp;the event</a>.</p>", "parentCommentId": null, "user": {"username": "Karolina Soltys"}}]