[{"_id": "tdEDgFYmNbMpdyQKe", "postedAt": "2018-09-03T02:49:46.891Z", "postId": "XbkCwCfXeAt25vFsA", "htmlBody": "<p>[Intercultural online communication]</p>\n<p>The <a href=\"http://effective-altruism.com/ea/1pc/ea_hotel_with_free_accommodation_and_board_for/\">EA Hotel</a> recently hosted EA London's weeklong retreat, and I got a chance to meet lots of EAs in Europe, which was great!  One of the many interesting discussions I had was about intercultural communication differences in online discussion.  Apparently my habit of spending a few minutes thinking about someone's post and writing the first thing that comes into my head as a comment is &quot;very American&quot;.  It seems that some EAs in the UK like to be fairly certain about their ideas before sharing them online, and when they do share their ideas, they put more effort into hedging their statements to communicate the correct level of confidence.  I thought this was important for forum readers to know; I would hate for people to think that the thoughts I have off the top of my head are carefully considered, and similarly, it seems worth knowing that some forum users comment infrequently because they want the thoughts they do share to carry more weight.  This is plausibly more of a UK vs US cultural difference than a cultural difference between the UK &amp; US EA communities specifically, but it still seems worth knowing.</p>\n", "parentCommentId": null, "user": {"username": "John_Maxwell_IV"}}, {"_id": "25owCJqpyxoRCbkdw", "postedAt": "2018-09-03T06:40:03.422Z", "postId": "XbkCwCfXeAt25vFsA", "htmlBody": "<p>[Did Career Research to Reach a Sense of Conclusion]</p>\n<p>About a year ago I left an organization I was closely involved in, and I spent the past year struggling quite a bit with what I wanted to do with my career. I applied to PhD programs in economics and got into a top one, Stanford. I spent several months thinking about what causes I want to focus on and whether this made sense for my career, and I made a pretty ambitious plan of reading up on debates that pertained to crucial considerations I'd longed neglected, such as how RCTs compare to other forms of evidence, what the best theories of consciousness are and their implications, and what the odds of various risks are.</p>\n<p>I'm pretty happy with where I am now after doing this. I updated my moral weight for animals downwards (though it was quite high before so it's still pretty high), my probability of machine sentience in the medium-term upwards, and my views on different forms of evidence and seriousness of risk stayed largely the same. Overall, I concluded that most of the things I'm most concerned about have research as their biggest gap, and the PhD is well-suited to that. I like to contemplate my career regularly, but I've reached a place of satisfaction that I had not been in for a while. Meanwhile, I started the PhD and am very happy with it so far.</p>\n", "parentCommentId": null, "user": {"username": "zdgroff"}}, {"_id": "qx4btCfniAFpyEbTJ", "postedAt": "2018-09-03T12:50:51.827Z", "postId": "XbkCwCfXeAt25vFsA", "htmlBody": "<p>[European Union Election 2019]</p>\n<p>In one year, the election to the European parliament will be held. The differences between parties can be unclear already at a national level, and so far I haven't seen any attempts to systematically compare how the party groups have voted and what they believe themselves to stand for.</p>\n<p>To make it easier to make a well-informed vote, I would like to gather interested EA's and make a handy guide on what group to vote on depending on values. To make it more useful, I'd suggest that it not only be written with EA's in mind, but also other voters.</p>\n", "parentCommentId": null, "user": {"username": "EgilElenius"}}, {"_id": "XPSHJkhJQwuBxcN8J", "postedAt": "2018-09-03T19:12:38.707Z", "postId": "XbkCwCfXeAt25vFsA", "htmlBody": "<p>RESEARCH PROPOSAL </p>\n<p>Mindfulness And Effective Altruism: Can The Former Help The Latter?</p>\n<p>In the UK, poor mental health is the main cause of disability amongst adults of working age. 1 in 4 people experience a mental health problem at some point in their lives and an estimated 15% of people at work suffer symptoms of a mental health condition. Depression, anxiety, stress, compassion fatigue and burnout are the most common sources of mental distress and disturbance in the workplace. These conditions are exacerbated amongst the helping and caring professions and are considered largely preventable...</p>\n<p>Hello Everyone</p>\n<p>I just wanted to write and introduce myself….I have been a member of the EA community for a few years and feel now is the time to make my first post. My background is in mental health, research and psychological wellbeing, and since studying Bioethics in 2013 I have become increasingly influenced by EA.</p>\n<p>Last year I spent some time at CEA as a Mental Health Research Assistant Intern. I wrote several reports drawing on the existing evidence base in the psychological sciences exploring ways to protect and promote optimum psychological wellbeing. A significant component of the wellbeing in the workplace initiative I proposed included following the Mindful Initiative (2015) recommendations</p>\n<p>(<a href=\"http://www.themindfulnessinitiative.org.uk/…/Mindfulness-AP…\">http://www.themindfulnessinitiative.org.uk/…/Mindfulness-AP…</a>)</p>\n<p>offering an 8-week, 2x hours per week mindfulness-based cognitive therapy (MBCT) course to employees as a health intervention aimed at addressing occupational mental health issues including work-related stress.</p>\n<p>The emerging evidence for secular based MBCT interventions in the workplace is encouraging. The reason why this is likely to be particularly important for EA, speaks to the shared ethics, values, virtues and character strengths explicit in MBI, see Baer (2015)</p>\n<p>(<a href=\"https://link.springer.com/…/pdf/10.1007%2Fs12671-015-0419-2…\">https://link.springer.com/…/pdf/10.1007%2Fs12671-015-0419-2…</a>)</p>\n<p>and the personal attributes / qualities we may wish to cultivate within the EA community. My particular interests include qualities like compassion (for self and others), friendliness, openness, kindness, gratitude and wisdom.</p>\n<p>Last weekend I attended the EA Blackpool Hotel Life Review discussing some of these ideas and my presentation was received with interest. I have agreed to run some mindfulness-based meditation sessions at EAG London next month where I look forward to meeting many more EAs.</p>\n<p>Finally, I have recently received an offer to study for a DPhil at Oxford University (Department of Psychiatry supervised by Oxford Mindfulness Centre (OMC)) exploring mindfulness in the workplace with a specific interest in the EA community.</p>\n<p>OMC is one of the leading institutions in the world for mindfulness training and research and has recently been nominated to receive a Chair in Perpetuity in Mindfulness and the Psychological Sciences so this is a very exciting, topical and world leading research opportunity. Unfortunately, following EA grants decision to not fund tuition fees / stipends this year, I have not yet secured funding (despite being due to start next month).</p>\n<p>If you have any ideas, thoughts or comments regarding funding streams or an interest in this area please feel free to get in touch. I would be delighted to hear from you.</p>\n<p>Thank you for reading, Georgina</p>\n", "parentCommentId": null, "user": {"username": "GeorginaGroome"}}, {"_id": "S4hCpnt9vbuimSej4", "postedAt": "2018-09-04T03:27:52.632Z", "postId": "XbkCwCfXeAt25vFsA", "htmlBody": "<p>I've been asked to post <a href=\"https://blog.jaibot.com/500-million-but-not-a-single-one-more/\">&quot;500 Million But Not a Single One More&quot;</a> on the EA Forum so that it's easier to include in a sequence of EA-related content. I need 5 karma to post - and the most straightforward way to get that seems like straight-up begging.</p>\n<p>Just so this comment isn't entirely devoid of content: <a href=\"http://polioeradication.org/polio-today/polio-now/this-week/\">This Week In Polio</a> is a great way to track humanity's (hopefully) final battles against Polio and one of my go-to pages when I'm looking to feel good about my species.</p>\n", "parentCommentId": null, "user": {"username": "jai"}}, {"_id": "ohCGPpF4tqhXvt7NT", "postedAt": "2018-09-04T08:09:33.698Z", "postId": "XbkCwCfXeAt25vFsA", "htmlBody": "<p>You made it!</p>\n", "parentCommentId": "S4hCpnt9vbuimSej4", "user": {"username": "Peter_Hurford"}}, {"_id": "cBbtHPaQu8J9aWfWH", "postedAt": "2018-09-04T09:41:25.654Z", "postId": "XbkCwCfXeAt25vFsA", "htmlBody": "<p>[Startup to improve predictions]</p>\n<p>I'm currently working on the startup <a href=\"https://www.primeprediction.com/\">https://www.primeprediction.com/</a>. We aim to help organizations make better decisions by improving their prediction capabilities.</p>\n<p>We're currently very early stage and are learning more about the problems people face when making predictions/forecasts.</p>\n<p>I'll be happy to answer any questions you may have. I'd also love to hear your feedback, especially about concrete problems you have faced in your line of work for our product could be relevant. </p>\n", "parentCommentId": null, "user": {"username": "yhoiseth"}}, {"_id": "Xkei7CwQ5gRqpaeo7", "postedAt": "2018-09-06T07:02:51.251Z", "postId": "XbkCwCfXeAt25vFsA", "htmlBody": "<p>Lovely meeting you at the EA Hotel Gina :) the importance of this research has been growing on me in the past few weeks, and I’m in full support of your work. Even your short workshop on the topic significantly changed my life (perspectives, behaviour and priorities). I’ll keep an eye and ear out, and just let me know if there’s any way specific way I can help. \nAlso, I’m trying to access the link but it’s broken :(</p>\n", "parentCommentId": "XPSHJkhJQwuBxcN8J", "user": {"username": "LaurenMcG"}}, {"_id": "GjWLe3vLMASTRAtBG", "postedAt": "2018-09-06T23:19:48.007Z", "postId": "XbkCwCfXeAt25vFsA", "htmlBody": "<p>Hi, I’m ACE’s new research director. Help give me karma to post on the forum!</p>\n", "parentCommentId": null, "user": {"username": "ToniA"}}, {"_id": "9czzSX95wwTsbeksv", "postedAt": "2018-09-07T02:41:34.297Z", "postId": "XbkCwCfXeAt25vFsA", "htmlBody": "<p>[Criminal Justice Reform Donation Recommendations]</p>\n<p>I emailed Chloe Cockburn (the Criminal Justice Reform Program Officer for the Open Philanthropy Project) asking what she would recommend to small donors. She told me she recommends <a href=\"https://realjusticepac.org/\">Real Justice PAC</a>. Since contributions of $200 or more to PACs are disclosed to the FEC, I asked her what she would recommend to a donor who wants to stay anonymous (and whether her recommendation would be different for someone who could donate significantly more to a 501(c)(3) than a 501(c)(4) for tax reasons). She told me that she would recommend 501(c)(4)s for all donors because it's much harder for 501(c)(4)s to raise money and she specifically recommended the following 501(c)(4)s: <a href=\"https://colorofchange.org/\">Color of Change</a>, <a href=\"https://organizetexas.org/\">Texas Organizing Project</a>, <a href=\"http://www.newvirginiamajority.org/\">New Virginia Majority</a>, <a href=\"http://www.faithinaction1.org/\">Faith in Action</a>, and <a href=\"https://peoplesaction.org/\">People's Action</a>.</p>\n<p><em>I asked for and received her permission to post the above.</em></p>\n<p>(I edited this to add a subject in brackets at the top.)</p>\n", "parentCommentId": null, "user": {"username": "RandomEA"}}, {"_id": "BMF5JJQo4xnraGHgx", "postedAt": "2018-09-07T14:13:00.730Z", "postId": "XbkCwCfXeAt25vFsA", "htmlBody": "<p>Hi Lauren </p>\n<p>Thank you for your kind words :)</p>\n<p>As you may remember, I spent last week at Oxford Mindfulness Centre Summer School being taught by Prof Mark Williams, Prof Willem Kuyken, Chis Cullen and Prof Ruth Baer....their collective experience and teaching was profound.  They spoke so eloquently about the confluence of ancient wisdom and modern psychological science and how compassion (for ourselves and others) can be cultivated.  I really believe the EA community could be greatly enhanced if everyone made taking care of themselves (and each other) a priority, and there is an emerging evidence base for how best to do this...</p>\n<p>I am however running out of time to secure funding as I have to pay tuition and college fees on 1st October.</p>\n<p>Sorry the links didn't work - here they are again:-</p>\n<p><a href=\"http://www.themindfulnessinitiative.org.uk/publications/mindful-nation-uk-report\">http://www.themindfulnessinitiative.org.uk/publications/mindful-nation-uk-report</a></p>\n<p><a href=\"https://link.springer.com/content/pdf/10.1007%2Fs12671-015-0419-2.pdf\">https://link.springer.com/content/pdf/10.1007%2Fs12671-015-0419-2.pdf</a></p>\n", "parentCommentId": "Xkei7CwQ5gRqpaeo7", "user": {"username": "GeorginaGroome"}}, {"_id": "jhbe5NDQnH3ejW2so", "postedAt": "2018-09-07T15:07:44.508Z", "postId": "XbkCwCfXeAt25vFsA", "htmlBody": "<p>Hi Toni, the moderators can also give you posting ability, you should be all set now!</p>\n", "parentCommentId": "GjWLe3vLMASTRAtBG", "user": {"username": "Julia_Wise"}}, {"_id": "zD5kNz7PJnpFy4PrN", "postedAt": "2018-09-07T16:07:15.084Z", "postId": "XbkCwCfXeAt25vFsA", "htmlBody": "<p>Ah, good to know. Thanks!</p>\n", "parentCommentId": "jhbe5NDQnH3ejW2so", "user": {"username": "ToniA"}}, {"_id": "SHDpznGtLRvRv3gwZ", "postedAt": "2018-09-09T16:31:30.475Z", "postId": "XbkCwCfXeAt25vFsA", "htmlBody": "<p>cool !</p>\n", "parentCommentId": null, "user": {"username": "kastugiki"}}, {"_id": "uMMarMJiBDoXcjG8p", "postedAt": "2018-09-10T11:10:02.144Z", "postId": "XbkCwCfXeAt25vFsA", "htmlBody": "<p>[Intro to Cause Prioritisation Article]</p>\n<p>I recently created a non-technical introduction to cause prioritisation, which some of you might find useful. It can be found <a href=\"https://medium.com/@Olafvanderveen/making-informed-decisions-the-value-of-cause-prioritisation-46ee80fcff27\">here</a>. When I accrue enough karma, I also plan to post it on the main forum. Let me know what you think!</p>\n", "parentCommentId": null, "user": {"username": "OlafvanderVeen"}}, {"_id": "Mxu9sEoQkGT6eFqTE", "postedAt": "2018-09-11T19:59:25.717Z", "postId": "XbkCwCfXeAt25vFsA", "htmlBody": "<p>Possibly Highly Effective Ways to Address Climate Change</p>\n<p>This thread by Josh Busby gives plenty of examples— </p>\n<p><a href=\"http://twitter.com/busbyj2/status/1038269431439388672\">http://twitter.com/busbyj2/status/1038269431439388672</a></p>\n<p>Skip the commentary I’ll add on after this sentence and just read that thread if you’re trying to save time.</p>\n<p>As this article (<a href=\"https://amp.theguardian.com/environment/2018/aug/29/local-climate-efforts-wont-undo-trump-inaction?__twitter_impression=true\">https://amp.theguardian.com/environment/2018/aug/29/local-climate-efforts-wont-undo-trump-inaction?__twitter_impression=true</a>) makes clear, local actions to address climate change that do not scale up to the national or higher level are just feel-good nothingburgers. It’s possible that every local action has a chance to scale to that level, but not all will scale at the speed that we need, and some actions taken to address climate change actually make things worse (see some advertising campaigns from the past.)</p>\n", "parentCommentId": null, "user": {"username": "zepedad"}}, {"_id": "xwuXCX9wnKFJQTuea", "postedAt": "2018-10-05T17:55:56.598Z", "postId": "XbkCwCfXeAt25vFsA", "htmlBody": "<p>I’d love to see a “EA Job board” organized not around open jobs, but around EAs who are looking for jobs. I’m hiring for an EA job and went to search for Boston area EAs looking for work and realized the tool I needed didn’t exist. This could probably be as simple as an “EA Job seekers” group on LinkedIn.</p>\n", "parentCommentId": null, "user": {"username": "Jon_Behar"}}, {"_id": "eQLktpbwbhtLs4zGF", "postedAt": "2018-10-06T13:49:00.480Z", "postId": "XbkCwCfXeAt25vFsA", "htmlBody": "<p>I'd be happy to post it for you on the Boston EA group if it's specifically in the Boston area.</p>\n", "parentCommentId": "xwuXCX9wnKFJQTuea", "user": {"username": "Julia_Wise"}}, {"_id": "acCc36TjKCwZWpuLh", "postedAt": "2018-10-11T04:42:17.682Z", "postId": "XbkCwCfXeAt25vFsA", "htmlBody": "<p>Hi Tonia, Julia. I'm new here and apologise for having have to use your thread to pass on my message which is totally unrelated to your post.\nWanted to ask if there's an EA group in Lagos, Nigeria I could join.</p>\n<p>I actually tried posting a comment directly on the open thread but saw that I needed 5 points to do that. Somehow, I still think I'm not doing this as I ought to, cause I imagine I should be able to post on an OT without points, but I admit I don't know the rules just yet.</p>\n", "parentCommentId": "zD5kNz7PJnpFy4PrN", "user": {"username": "QuadBee"}}, {"_id": "srTZ9JiDavEcJb722", "postedAt": "2018-10-11T14:55:53.672Z", "postId": "XbkCwCfXeAt25vFsA", "htmlBody": "<p>Hi! Sorry, I don't think there is a group in Nigeria. Here's a guide to starting one if you're interested in a project: <a href=\"https://app.effectivealtruism.org/groups/resources/resources-and-support\">https://app.effectivealtruism.org/groups/resources/resources-and-support</a></p>\n", "parentCommentId": "acCc36TjKCwZWpuLh", "user": {"username": "Julia_Wise"}}, {"_id": "G38yFdBQeLPttgXYp", "postedAt": "2018-10-11T22:41:45.966Z", "postId": "XbkCwCfXeAt25vFsA", "htmlBody": "<p>Hello! I am MercifulVoice and I am a new member of E.Altruism Forums! </p>\n", "parentCommentId": null, "user": {"username": "MercifulVoice"}}, {"_id": "rRALyExLy2RnSxD2M", "postedAt": "2018-10-11T22:42:38.551Z", "postId": "XbkCwCfXeAt25vFsA", "htmlBody": "<p>I have some insights regarding effective altruism of insect and animal welfare. They are questions and ideas I have thought about for a while, and it's a long post. May I post it here? Thank you!</p>\n", "parentCommentId": null, "user": {"username": "MercifulVoice"}}, {"_id": "fL2HNKxuRfoBLhnko", "postedAt": "2018-10-12T01:39:16.666Z", "postId": "XbkCwCfXeAt25vFsA", "htmlBody": "<p>EA Operations Job Opportunity</p>\n<p>If anyone is interested in a job in Vancouver or remote, Rethink Charity is in need of an Operations and Administration Officer: <a href=\"https://rtcharity.org/operations-officer/\">https://rtcharity.org/operations-officer/</a></p>\n", "parentCommentId": null, "user": {"username": "ghhass"}}, {"_id": "E5zE9k8Jgs7bt3934", "postedAt": "2018-10-12T02:14:03.008Z", "postId": "XbkCwCfXeAt25vFsA", "htmlBody": "<p>Go for it</p>\n", "parentCommentId": "rRALyExLy2RnSxD2M", "user": {"username": "Peter_Hurford"}}, {"_id": "wxwBEhrQx6AzTLHnd", "postedAt": "2018-10-12T03:38:44.712Z", "postId": "XbkCwCfXeAt25vFsA", "htmlBody": "<p>Thanks Julia! Here's the job description: <a href=\"https://docs.google.com/document/d/1-3BtxBnEa-7v_NQC2qcmrJgLkUat8HMcONKkc025Kmc/edit?usp=sharing\">https://docs.google.com/document/d/1-3BtxBnEa-7v_NQC2qcmrJgLkUat8HMcONKkc025Kmc/edit?usp=sharing</a></p>\n", "parentCommentId": "eQLktpbwbhtLs4zGF", "user": {"username": "Jon_Behar"}}, {"_id": "G8PGMbvgTPvNb63SN", "postedAt": "2018-10-13T12:51:12.227Z", "postId": "XbkCwCfXeAt25vFsA", "htmlBody": "<p>Thanks, Julia.</p>\n", "parentCommentId": "srTZ9JiDavEcJb722", "user": {"username": "QuadBee"}}, {"_id": "LEkQkbyzk9QwZNx6p", "postedAt": "2018-10-14T06:28:52.825Z", "postId": "XbkCwCfXeAt25vFsA", "htmlBody": "<p>Title: Shamelessly asking for karma</p>\n<p>Hello! My name is Benjamin Pence. I am a multi-year RSS lurker, first time poster. Can the lovely people of the community please give me enough karma to post? I swear I'm not a robot. Probably. I can do CAPTCHAs after all.</p>\n", "parentCommentId": null, "user": {"username": "benjamin-pence"}}, {"_id": "jqNyWA5vXi2gEzCYB", "postedAt": "2018-10-14T20:41:41.504Z", "postId": "XbkCwCfXeAt25vFsA", "htmlBody": "<p>You made it to five karma.</p>\n", "parentCommentId": "LEkQkbyzk9QwZNx6p", "user": {"username": "Peter_Hurford"}}, {"_id": "29QWXmdE5iKJHmsT6", "postedAt": "2019-01-23T17:21:05.723Z", "postId": "XbkCwCfXeAt25vFsA", "htmlBody": "<p>Has anyone reframed priorities choices (such as x-risk vs. poverty) as losses to check if they’re really biased?</p><p>I’ve read a little bit about the possibility that preferences for poverty reduction/global health/animal welfare causes over x-risk reduction may be due to some kind of ambiguity-aversion bias. Between donating U$3,000 for (A) saving a life (high certainty, presently) or (B) potentially saving 10^20 future lives (I know this may be a conservative guess, but it&#x27;s the reasoning that is important here, not the numbers), by making something like a marginal 10^-5 contribution to reducing in 10^-5 some extinction risk, people would prefer the first &quot;safe&quot; option A, despite the large pay-off of the second one. However, such bias is sensitive to framing effects: people usually prefer sure gains (like A) and uncertain losses (like B&#x27;). So, I was trying to find out, without success, if anyone had reframed this decision as matter of losses, to see if one prefers, e.g., (A’) reducing deaths by malaria from 478,001 to 478,000 or (B’) reducing the odds of extinction (minus 10^20 lives) in 10^-10.</p><p>Perhaps there’s a better way to reframe this choice, but I’m not interested in discussing one particular example (however, I’m concerned with the possibility that there’s no bias-free way of framing it). My point is that, if one chooses something like A-B’, then we have a strong case for the existence of a bias.</p><p>(I’m well aware of other objections against x-risk causes, such as Pascal’s mugging and discount rates arguments – but I think they’ve received due attention, and should be discussed separately. Also, I’m mostly thinking about donation choices, not about policy or career decisions, which is a completely different matter; however, IF this experiment confirmed the existence of such a bias, it could influence the latter, too.</p><p>I’m new here. Since I suspect someone has probably already made a similar question somewhere else - but I couldn’t find it, so sorry bothering you - I’m mostly trying to satisfy my curiosity; however, there’s a small probability that it touches an important unsolved dilemma about global priorities - the x-risk vs. safe causes. I&#x27;m not looking for karma - though you can&#x27;t have too much of it, right?) </p>", "parentCommentId": null, "user": {"username": "Ramiro"}}]