[{"_id": "68Tsch3fZW7bZZ9Gb", "postedAt": "2017-10-22T18:20:47.200Z", "postId": "XcLzQxDxnXW6xH6tx", "htmlBody": "<p>In general, a cause needs to score high on each of impact, tractability, and neglectedness to be worthwhile. Getting two out of three is no better than zero out of three. You've listed causes with high impact, but they're generally not tractable. For example, changing the political system is highly intractable.</p>\n<p>Overall, I think that EA has already incorporated the key insights from systems change, and there's no need to distinguish it as being separate from EA.</p>\n", "parentCommentId": null, "user": {"username": "Michael_Wiebe"}}, {"_id": "5e8bJ66aheqo2yFSq", "postedAt": "2017-10-23T14:00:23.429Z", "postId": "XcLzQxDxnXW6xH6tx", "htmlBody": "<p>I don't think there was any reason for this to be split into 3 posts? It'd be better to condense it into one.</p>\n", "parentCommentId": null, "user": {"username": "joshjacobson"}}, {"_id": "JZDrhQY8Ar9CeBYp7", "postedAt": "2017-10-23T15:20:36.241Z", "postId": "XcLzQxDxnXW6xH6tx", "htmlBody": "<p>I had written a much longer piece, and had feedback from a number of people that it would be best to split it up. </p>\n", "parentCommentId": "5e8bJ66aheqo2yFSq", "user": {"username": "oliverbramford"}}, {"_id": "nhdPd2xzNmhjqsKdM", "postedAt": "2017-10-23T15:53:09.834Z", "postId": "XcLzQxDxnXW6xH6tx", "htmlBody": "<p>Hello. I'll reply here even though my comment covers all three posts. My general worry is that I think you've drawn a distinction without a difference. I can see that 'optimise Earth' and 'do the most good' are different sentences, but I'm still not really sure what the practical differences are supposed to be between them. As a test: what would a 'do the most good-er' and an 'Earth optimiser' disagree about?</p>\n<p>On your EA paradigm vs systems changes paradigm, I fear you've specifed EA into a particular, not very generous, way just to make your point. For instance, why can't an EA say &quot;we should maximise our collective impact&quot;? I agree that EAs should be thinking about co-operation and the full impact of their actions but EAs tend to be aware of this already. I don't think I know anyone who really wants to maximise their personal impact at the expense of total impact (whatever exactly this means).</p>\n<p>Then on this post, you seem to be presenting this as if no EA has ever thought about systemic changes. But that's not true. EAs have often thought about systemic changes, they just haven't been (that) convinced by then. If you want to change people's minds on this issues, I would strongly encourage you to write up one of these areas as a cause profile and compare it to existing ones, e.g. how does it score on scale, tractability and neglectedness? I generally much prefer it if people give (at least somewhat) worked out arguments for why New Cause X is better than Old Cause Y, rather than saying only &quot;ah, but what about New Cause X? Have you considered that?&quot; Advocates of New Cause X tend to be able to do the best job of making the case for that cause anyway, so it makes sense for them to try to do it anyway. </p>\n", "parentCommentId": null, "user": {"username": "MichaelPlant"}}, {"_id": "JzabHovMYRdrZcfss", "postedAt": "2017-10-23T15:54:28.883Z", "postId": "XcLzQxDxnXW6xH6tx", "htmlBody": "<p>System change causes are inherently complex and thus often appear highly intractable initially. However, with detailed systems analysis a set of viable (and perhaps novel) approaches may (sometimes)  be identified, which are much more tractable than expected. </p>\n<p>For example, the system of animal agriculture and animal product consumption is pretty complex, but ACE have done a great job to identify charities that are working very effectively on different aspects of that system (cultured meat, advocacy to corporates, promoting veganism, etc.).</p>\n<p>Analysing a complex system in detail sheds new light on what's broken and why, and can highlight novel and neglected solutions (e.g. cultured meat) that make changing the system far more tractable. </p>\n<hr />\n<blockquote>\n<p>changing the political system is highly intractable</p>\n</blockquote>\n<p>The political systems is very complex, but we don't yet know how tractable it is. We are currently researching this at EA Geneva/Geneva Macro Labs. If we find a political systems change strategy that is even moderately tractable, I suspect it would be worth pursuing due to the magnitude of the likely flow through effects. If we change the political system to better prioritise policies, this would make changing many other important systems (economic, defence, education, etc.) way more tractable.</p>\n", "parentCommentId": "68Tsch3fZW7bZZ9Gb", "user": {"username": "oliverbramford"}}, {"_id": "HuwfzRfmviGzRZtec", "postedAt": "2017-10-23T16:07:37.758Z", "postId": "XcLzQxDxnXW6xH6tx", "htmlBody": "<p>And if your disagreement is with the scale/tractability/neglectedness framework, then argue against that directly.</p>\n", "parentCommentId": "nhdPd2xzNmhjqsKdM", "user": {"username": "Michael_Wiebe"}}, {"_id": "Ts4WhoipHTEyuPAGK", "postedAt": "2017-10-23T16:37:06.165Z", "postId": "XcLzQxDxnXW6xH6tx", "htmlBody": "<blockquote>\n<p>For example, the system of animal agriculture and animal product consumption is pretty complex, but ACE have done a great job</p>\n</blockquote>\n<p>But they didn't use complex systems theory, did they? They just used the regular EA framework of impact/tractability/neglectedness.</p>\n", "parentCommentId": "JzabHovMYRdrZcfss", "user": {"username": "Michael_Wiebe"}}, {"_id": "dFhCWc9qgtwuxE7np", "postedAt": "2017-10-23T16:43:00.287Z", "postId": "XcLzQxDxnXW6xH6tx", "htmlBody": "<p>I can't imagine why. Even all 3 together are shorter than many posts on here. And they really don't have much standalone value IMHO (i.e. the first).</p>\n", "parentCommentId": "JZDrhQY8Ar9CeBYp7", "user": {"username": "joshjacobson"}}, {"_id": "tYRgw9DYjn5thhxf8", "postedAt": "2017-10-23T16:44:25.678Z", "postId": "XcLzQxDxnXW6xH6tx", "htmlBody": "<p>This is an interesting point, though I wonder whether EAs have the right attitude about tractability. Tractability and neglectedness tend to be inversely related, and the relationship is imperfect - I think EAs can make reasonable bets about when society as a whole overly neglects low-tractability problems, making it worthwhile to disrupt complacency. Sea-changes are apparent even in recent history, say in treating HIV in sub-saharan Africa - something that many argued was impossible, unfeasible, and too costly. A similar transformation is apparent in TB care, especially in the treatment of drug resistant tuberculosis. Although these may not be priority areas for EAs, the global health community has majorly updated over the last 20 years about how tractable they are and at what cost these interventions could effectively improve people's lives. I think it's worth learning from these lessons.</p>\n", "parentCommentId": "68Tsch3fZW7bZZ9Gb", "user": {"username": "e19brendan"}}, {"_id": "FRk7Cu5wcRRSznovN", "postedAt": "2017-10-23T20:46:57.754Z", "postId": "XcLzQxDxnXW6xH6tx", "htmlBody": "<p>Not disagreeing with Michael_Wiebe, but just thought I'd add this: the SNT framework is just a few rules of thumb anyway. Where people can produce expected value calculations of the intervention in question (e.g. good done/pound), they should just do that. But SNT is a good place to start. </p>\n", "parentCommentId": "HuwfzRfmviGzRZtec", "user": {"username": "MichaelPlant"}}, {"_id": "Z6CL3BK48dhpEBs4k", "postedAt": "2017-10-23T20:51:55.045Z", "postId": "XcLzQxDxnXW6xH6tx", "htmlBody": "<p>I downvoted this for unfriendliness</p>\n", "parentCommentId": "dFhCWc9qgtwuxE7np", "user": {"username": "MichaelPlant"}}, {"_id": "bgMSXWKnvugm64Xds", "postedAt": "2017-10-23T21:02:34.568Z", "postId": "XcLzQxDxnXW6xH6tx", "htmlBody": "<p>As a data point for how useful ITN is for trying to think about system change I shall talk about my attempt.</p>\n<p>My attempt is <a href=\"https://improvingautonomy.wordpress.com/2017/08/26/outline-of-the-ea-argument-for-improving-autonomy/\">here</a>.</p>\n<p>So the intervention was to try and start a movement of people who shared technological development with each other to help them live (so food/construction/computing), with the goal of  creating autonomous communities (capable of space faring or living on other planets would be great, but is not the focus). The main difference between it and the normal open source movement is that it would focus on intelligence augmentation to start with <a href=\"https://improvingautonomy.wordpress.com/2017/09/01/economics-of-autonomy/\">for economic reasons</a>.</p>\n<p>The main problems I came across were arguing it would have positive long term impact due to existential risk and war risks compared to singletons (I think it would, because I am skeptical of the stability of singletons). </p>\n<p>It will take a long time to form a convincing argument about this one way or another, and probably a significant amount of more expertise in economics, sociology and game theory as well. </p>\n<p>If a fully justified ITN report is needed before EAs start to be interested in it, then it is likely that it and other ideas like it will be neglected. Some ideas will need significant resources put into determining their tractability and also the sign of their impact.</p>\n", "parentCommentId": null, "user": {"username": "WillPearson"}}, {"_id": "GtPAkgni4ALPyBaYk", "postedAt": "2017-10-25T14:49:55.443Z", "postId": "XcLzQxDxnXW6xH6tx", "htmlBody": "<blockquote>\n<p>what would a 'do the most good-er' and an 'Earth optimiser' disagree about?</p>\n</blockquote>\n<p>Great question!</p>\n<p>I'm not sure if there is any direct logical incompatibility between a 'do the most good-er' and an 'Earth optimiser'. Rather, I think the Earth optimiser frames the challenge of doing the most good in a particular way that tends to give greater consideration to collective impact and long run indirect effects than is typical in the EA community. </p>\n<p>As an Earth optimiser, I am confident that we can substantially improve on our current cause prioritisation methodology, to better account for long run indirect effects and better maximise collective impact. By modelling the Earth as a complex system, defining top-level systemic goals/preferred outcomes, and working backwards to identify the critical next steps to get there, I expect would lead many of us to revise what we currently consider to be top priority causes.</p>\n<blockquote>\n<p>I would strongly encourage you to write up one of these areas as a cause profile and compare it to existing ones</p>\n</blockquote>\n<p>When it comes to complex systems change causes, I think a substantial amount of up front research is typically required to write up a remotely accurate cause profile, that can be compared meaningfully with direct-impact causes. Complex systems typically seem highly intractable at first glance, but a systems analysis may highlight a set of neglected interventions, which when pursued together, make systems change fairly tractable.</p>\n<p>As a good example, I am currently part of the leadership team working on a political systems change research project (set up under EA Geneva). This is a year-long project with a team of (part-time volunteer) researchers. We will do a detailed literary review, a series of events with policy makers, and a series of expert interviews. We hope that this will be enough to evaluate the tractability of this as a cause area, and locate it's priority in relation to other cause areas.</p>\n", "parentCommentId": "nhdPd2xzNmhjqsKdM", "user": {"username": "oliverbramford"}}, {"_id": "SRrf7E7XkkxCy2wQF", "postedAt": "2017-10-25T19:55:07.125Z", "postId": "XcLzQxDxnXW6xH6tx", "htmlBody": "<blockquote>\n<p>I'm not sure if there is any direct logical incompatibility between a 'do the most good-er' and an 'Earth optimiser</p>\n</blockquote>\n<p>Well, in this case, I'm now struggling to see why it's worth making a fuss about the terminology if it's just a framing thing. I'm generally against people introducing new terminology just for the sake of it because it confuses people. It seems like you're reinventing the wheel and claiming you've done something more impressive.</p>\n<blockquote>\n<p>I expect would lead many of us to revise what we currently consider to be top priority causes.</p>\n</blockquote>\n<p>This could be true, and I look forward to seeing the arguments. In a similar vein, I'm more in favour of people arriving with new findings they can argue for, rather than just saying &quot;look, this could be <em>so</em> high impact!&quot; because that applies to loads of things. </p>\n", "parentCommentId": "GtPAkgni4ALPyBaYk", "user": {"username": "MichaelPlant"}}]