[{"_id": "pyCfSBopmciKCmGog", "postedAt": "2022-12-07T03:07:01.382Z", "postId": "XcsX8GEkszEhEumMo", "htmlBody": "<p>Not an answer, but why are you trying to do this? If you're excited about Biology, there seem to be plenty of ways to do impactful biological work.&nbsp;</p><p>Even if you're purely trying to maximize your impact, for areas like AI Alignment, climate change, or bioweapons, the relevant question is something like: what is the probability that me working on this area prevents a catastrophic event? According to utilitarianism, your # of lives saved is basically this time the total number of people that will ever live or something like this.&nbsp;</p><p>So if there's a 10% chance of AI killing anyone, and you working on this brings it down to 9.999999%, this is less impactful than if there's a 0.5 % chance of climate change killing everyone, and you working on this brings it down to 0.499 %. Since it's much more likely to do impactful work in an area that excites you, seems like bio is solid, since it's relevant to bioweapons and climate change?</p>", "parentCommentId": null, "user": {"username": "oh54321"}}, {"_id": "pecREQfMtbHa2L8pa", "postedAt": "2022-12-07T23:36:11.111Z", "postId": "XcsX8GEkszEhEumMo", "htmlBody": "<p>Love it listen to this person ;).</p>", "parentCommentId": "pyCfSBopmciKCmGog", "user": {"username": "NickLaing"}}, {"_id": "nNarZdioqCrGF2foE", "postedAt": "2022-12-08T00:57:32.726Z", "postId": "XcsX8GEkszEhEumMo", "htmlBody": "<p>I agree that the thing that matters is how the person working on this area prevents a catastrophic event, as opposed to the chance of catastrophe itself. And I agree that being excited about an issue/topic will make you more effective.</p>\n<p>But working on the topic where you are less excited about can still have an overall better impact. I think that \"being excited about\" makes  you unlikely to be more than ten times as effective as an average researcher.</p>\n<p>Your example numbers, where you have a 0.001% impact on the thing you are excited about and 0.000001% impact for another thing, seem unrealistic, if these differences are supposed to capture the additional impact of being excited about a thing (I don't think you meant to pick realistic here and these were just examples to illustrate your point. One might also argue that impacting AI alignment is much harder than climate change, then I would disagree based on arguments around neglectedness).</p>\n<p>However, for OP it might also be a case of the common-among-EAs question of how much are you willing to sacrifice. We generally accept if people limit the sacrifices they are willing to make for altruistic causes, and switching from a field you are excited about to another more impactful field can be a big sacrifice.</p>\n", "parentCommentId": "pyCfSBopmciKCmGog", "user": {"username": "harfe"}}, {"_id": "PToekwYiGAeLBFZjK", "postedAt": "2022-12-14T04:30:28.030Z", "postId": "XcsX8GEkszEhEumMo", "htmlBody": "<p>Echoing oh54321's comment: personal fit really matters, and luckily, the field you're already interested in provides many opportunities to do good! If you don't want to turn your back to biology, you don't have to.</p><p>With that said, if you're looking for recommendations about AI...</p><ul><li>There are <a href=\"https://www.youtube.com/watch?v=aircAruvnKk\">a couple of videos</a> from the YouTube channel 3blue1brown that do a good job of explaining the basics of deep learning.</li><li>In terms of current research, there's been some pretty fascinating (and biology-inspired!) work on interpretability. Two articles I'd recommend are <a href=\"https://distill.pub/2020/circuits/zoom-in/\"><i>Zoom In: An Introduction to Circuits</i></a> which lays out some high-level ideas, and<i> </i><a href=\"https://distill.pub/2021/multimodal-neurons/\"><i>Multimodal Neurons in Artificial Neural Networks</i></a> which reports findings from a real-world model.</li></ul>", "parentCommentId": null, "user": {"username": "ryanbloom"}}, {"_id": "EqXMBNHLiuQfQfnYL", "postedAt": "2022-12-14T09:06:35.150Z", "postId": "XcsX8GEkszEhEumMo", "htmlBody": "<p>Just checking, have you tried coding at all? I've found that solving simple coding challenges to be very fun (starting with interactive courses like codeacademy, and then sources of interesting problems like Project Euler, HackerRank, etc).</p>", "parentCommentId": null, "user": {"username": "Linch"}}]