[{"_id": "Hej299Tgzzbmzfwru", "postedAt": "2023-08-23T19:26:47.221Z", "postId": "Xd9ZZuPCKAvKpzvdB", "htmlBody": "<blockquote><p>FEM developed a new technology to evaluate our impact: a transmitter that identifies when FEM’s content is on air, and replaces it with music. This means the region surrounding the transmitter is temporarily not exposed to our programmes.</p></blockquote><p>This is <strong>SO COOL!</strong>&nbsp;</p><p>Really amazing progress all around 👏</p>", "parentCommentId": null, "user": {"username": "edoarad"}}, {"_id": "otSXFQEaqZis2zdjZ", "postedAt": "2023-08-24T02:48:06.655Z", "postId": "Xd9ZZuPCKAvKpzvdB", "htmlBody": "<p>Exciting work! Where can I find details about the survey - methodology and results? &nbsp;What contraception methods were most commonly used and how was use assessed? &nbsp;What was the continuation rate? &nbsp;Was there any impact on unplanned pregnancy rate?</p>", "parentCommentId": null, "user": {"username": "Paula Amato"}}, {"_id": "xpPsyxLxSLvgxgbgY", "postedAt": "2023-08-24T03:33:26.261Z", "postId": "Xd9ZZuPCKAvKpzvdB", "htmlBody": "<p>+1 on this would be interested to see.</p>", "parentCommentId": "otSXFQEaqZis2zdjZ", "user": {"username": "NickLaing"}}, {"_id": "oY8A8yJSFbEmouLk6", "postedAt": "2023-08-24T06:47:32.542Z", "postId": "Xd9ZZuPCKAvKpzvdB", "htmlBody": "<p>Congrats, this is really amazing work!</p>\n<p>Do you have a sense of a) why the Nigerian government’s ministry of health hasn’t prioritised this previously, b) whether they could eventually co-fund / take over these programs?</p>\n", "parentCommentId": null, "user": {"username": "freedomandutility"}}, {"_id": "CwKcTSgR9PHwk9nfP", "postedAt": "2023-08-24T14:12:58.845Z", "postId": "Xd9ZZuPCKAvKpzvdB", "htmlBody": "<p>I was incredibly impressed by the tables of numbers in their impact evaluation. After conversing with the team, I've witnessed their high ability to produce results, and their evaluation research methods certainly attest to this. This appears to be one of those rare opportunities where donations could have a significant counterfactual impact.</p><p><i>Edit: I am not in any way affiliated with FEM and randomly met one of the co-founders on a flight where we had a conversation about their work.</i></p>", "parentCommentId": null, "user": {"username": "esben-kran"}}, {"_id": "mWvMqPzLb2LAhmAyp", "postedAt": "2023-08-24T14:13:12.707Z", "postId": "Xd9ZZuPCKAvKpzvdB", "htmlBody": "<p>Impressive! All of it is a success--the simplicity of the idea, the good implementation, the partnerships with institutions while this topic is far from being culturally obvious...Well done! Truly impressive!</p>", "parentCommentId": null, "user": {"username": "Vaipan"}}, {"_id": "eheJ5APeoEZrySLif", "postedAt": "2023-08-25T16:19:15.341Z", "postId": "Xd9ZZuPCKAvKpzvdB", "htmlBody": "<p>The independent survey was done by PMA Data, here's a <a href=\"https://www.pmadata.org/sites/default/files/data_product_results/Nigeria%20Kano_Phase%203%20XS_Results%20Brief_Final_31Mar2022.pdf\">link</a>.&nbsp;</p>", "parentCommentId": "otSXFQEaqZis2zdjZ", "user": {"username": "hhart"}}, {"_id": "mKaaWY9XF6ZijfEfL", "postedAt": "2023-08-25T16:19:43.101Z", "postId": "Xd9ZZuPCKAvKpzvdB", "htmlBody": "<p>Thanks so much!&nbsp;</p><p>There have been some government programmes raising awareness about reproductive health and contraception. They have been limited due to fund limitations. There has been no precedent of the government of Nigeria taking over NGO high-intensity media campaigns as far as we are aware, and we expect to be a good partner for the government even at scale.&nbsp;<br>&nbsp;</p>", "parentCommentId": "oY8A8yJSFbEmouLk6", "user": {"username": "hhart"}}, {"_id": "CEYiwi7n5nvbRbYAL", "postedAt": "2023-08-25T16:20:38.975Z", "postId": "Xd9ZZuPCKAvKpzvdB", "htmlBody": "<p>Thank you for the support!</p>", "parentCommentId": "mWvMqPzLb2LAhmAyp", "user": {"username": "hhart"}}, {"_id": "tqoyt5rPoqbywx4aZ", "postedAt": "2023-08-25T16:21:00.854Z", "postId": "Xd9ZZuPCKAvKpzvdB", "htmlBody": "<p>Thanks, Esben! We appreciate the support.&nbsp;</p>", "parentCommentId": "CwKcTSgR9PHwk9nfP", "user": {"username": "hhart"}}, {"_id": "7hmxiAzPaKGxgutxj", "postedAt": "2023-08-25T22:11:21.824Z", "postId": "Xd9ZZuPCKAvKpzvdB", "htmlBody": "<p>Incredible results, great work.</p>\n<p>\"A similar trend was not seen in Lagos or other Nigerian states, suggesting the change was specific to Kano. We were the only new large scale family planning demand generation activity in the state at that time. We are working with researchers to better understand how much impact can be attributed to FEM’ campaigns. But these results are promising.\"</p>\n<p>I'm interested to hear how you might figure this out. Off the top of my head I struggle to imagine what data might help you drill down more on the cause and effect here, outside of asking women deeper questions. I wonder why PMI didn't just ask the women as well what contributed to them starting to use family planning for the first time, obviously that data would be flawed but if a decent number said \"I considered it after hearing on the radio\" that would help your case.</p>\n<p>If even half of these 250,000 new users (as a small comment it was strange that PMI had no error bars on their graphs) are due to FEM then this must be one of the most staggering results in the history of family planning interventions. I would be interested to hear if you know of any other interventions which have led to even close to that many new family planning users is a year?</p>\n<p>The 2023 survey (which just have already been done) will surely shed more light on this as well.</p>\n<p>And the RCT design sounds great. My instinct is to be careful about expectations from here, even if you never replicate this first year of apparently outrageous success and only produce a tenth of that impact from here on in, your approach may still be plenty cost effective enough to continue your growth trajectory.</p>\n<p>Keto up the good work</p>\n", "parentCommentId": null, "user": {"username": "NickLaing"}}, {"_id": "7MxSusmctNNLtAEE7", "postedAt": "2023-08-27T15:30:22.761Z", "postId": "Xd9ZZuPCKAvKpzvdB", "htmlBody": "<p>Thanks for the link. &nbsp;So the PMA survey shows a significant increase in modern contraceptive prevalence rate starting in Feb ‘21 - a full 7 months BEFORE the start of the FEM radio campaign - without any appreciable change on slope of the increase after the beginning of the FEM campaign (shaded area on the graph). &nbsp;How are you attributing ANY increase directly due to the FEM campaign itself? &nbsp;And any thoughts about what led to the increased rate preceding the start of the campaign?</p>", "parentCommentId": "eheJ5APeoEZrySLif", "user": {"username": "Paula Amato"}}, {"_id": "9gWx3mptcamAo2C2u", "postedAt": "2023-08-27T16:11:26.797Z", "postId": "Xd9ZZuPCKAvKpzvdB", "htmlBody": "<p>To be clear, I'm a gynecologist. &nbsp;I think increasing contraceptive use is extremely important and impactful and that mass media campaigns are likely to be effective. &nbsp;However, I find some of the claims in this narrative very misleading. &nbsp;I encourage the FEM team to engage in more rigorous research and to focus on capacity-building perhaps by partnering with other organizations that have a great deal of experience working in this space over a long period of time.</p>", "parentCommentId": "7MxSusmctNNLtAEE7", "user": {"username": "Paula Amato"}}, {"_id": "FkvngXQ4heFvaYh7Z", "postedAt": "2023-08-27T16:49:41.921Z", "postId": "Xd9ZZuPCKAvKpzvdB", "htmlBody": "<p>I think you're reading the graph wrong. There are two data points, one with data collection \"Dec 2020- Feb 2021\" (before the intervention) and one with data collection \"Dec 2021- Jan 2022\" (after the intervention).<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefxfxixwafeud\"><sup><a href=\"#fnxfxixwafeud\">[1]</a></sup></span>&nbsp;There are no in-between measures that would give you a \"slope\" from Feb ‘21 to the start of the intervention.</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnxfxixwafeud\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefxfxixwafeud\">^</a></strong></sup></span><div class=\"footnote-content\"><p>See page 9 of the report: \"Tables: Contraceptive prevalence and unmet need\"</p></div></li></ol>", "parentCommentId": "7MxSusmctNNLtAEE7", "user": {"username": "AnonymousAccount"}}, {"_id": "nP3XCSR3JqCCp8QJo", "postedAt": "2023-08-27T17:51:57.264Z", "postId": "Xd9ZZuPCKAvKpzvdB", "htmlBody": "<p>\"intervention period indicated by shaded area\"?</p>", "parentCommentId": "FkvngXQ4heFvaYh7Z", "user": {"username": "Paula Amato"}}, {"_id": "SxN3qmFrtnxtePNkg", "postedAt": "2023-08-27T18:05:03.937Z", "postId": "Xd9ZZuPCKAvKpzvdB", "htmlBody": "<p>The shaded area is between the two data points, which means that the two data points are one before and one after the intervention period.</p>", "parentCommentId": "nP3XCSR3JqCCp8QJo", "user": {"username": "AnonymousAccount"}}, {"_id": "2PFS5tjfFeJWXyBZg", "postedAt": "2023-08-27T18:28:58.510Z", "postId": "Xd9ZZuPCKAvKpzvdB", "htmlBody": "<p>Hi Paula, (1) \"<i>I encourage the FEM team to engage in more rigorous research and to focus on capacity-building...</i>\" &nbsp;FWIW, I think giving the organization (who are engaging with this thread) more time to respond on the point you raise about the PMA survey would be significantly preferable than making a conclusion in either direction at least based on my reading of this thread. (2)\"..<i>.partnering with other organizations that have a great deal of experience working in this space over a long period of time..</i>.\" Two separate points: a. to what extent do you know they don't do this? I know them to have extensively engaged with local organizations and had at least information sharing conversations with international organizations (f.e. Development Media International who were founded in 2005) from my <i>very</i> loose following of their work over the years. b. Sadly, and much to my personal heartbreak, from having worked in international women's human rights myself for a number of years, it is certainly not the case that an organization who has been around a long time is more effective or even effective at all than an evidence-based, well run and connected new organization. I have actually been deeply disappointed by the average &nbsp;long-standing organization in this field but perhaps you have had better luck! :) Thanks!&nbsp;</p>", "parentCommentId": "9gWx3mptcamAo2C2u", "user": {"username": "KathrynMecrow"}}, {"_id": "2jcyuZLqKEgGWDBLL", "postedAt": "2023-08-27T18:52:52.825Z", "postId": "Xd9ZZuPCKAvKpzvdB", "htmlBody": "<p>Right, my question is how can you infer causality from the data?</p>", "parentCommentId": "SxN3qmFrtnxtePNkg", "user": {"username": "Paula Amato"}}, {"_id": "Pa3ZNfyZ7kHdw7FvD", "postedAt": "2023-08-27T19:09:53.800Z", "postId": "Xd9ZZuPCKAvKpzvdB", "htmlBody": "<p>Fair enough. &nbsp;Was going mostly from what I've read in their post and on their website in addition to the RP report. &nbsp;I don't disagree. &nbsp;Although, some international organizations partnering with local public health departments in LMICs have a decent track record in this regard.</p>", "parentCommentId": "2PFS5tjfFeJWXyBZg", "user": {"username": "Paula Amato"}}, {"_id": "5Li5AnJCoN8RmjEkD", "postedAt": "2023-08-27T19:25:32.831Z", "postId": "Xd9ZZuPCKAvKpzvdB", "htmlBody": "<p>Thanks Paula, it's a good question</p>\n<p>As far as I can see they are inferring casualty (cautiously) because there are other regions that haven't seen the same drastic uptake in family planning on that year as the region they worked in, and no other major player they know of had a major campaign in that area.</p>\n<p>They also said they are engaging with researchers to see how much of the increase in uptake might be due to their work, and said that early results are promising. I struggle to understand what they mean by this and have asked above and hope for a reply.</p>\n<p>I would agree that it is dangerous to make any strong claim of casualty from any before and after cross sectional research in such a complex scenario. Because of this nature of the survey I don't think FEM can claim cause and effect here with high certainty.</p>\n<p>But assuming the survey is sound (I had a look and it seems solid) then I would say at least there is a good chance that some proportion of the increase in uptake is likely because of FEMs work - but how much they could claim is very difficult to ascertain.</p>\n<p>They might have other data they are using sad well which I can't see here though, but will wait for a comment from FEM.</p>\n", "parentCommentId": "2jcyuZLqKEgGWDBLL", "user": {"username": "NickLaing"}}, {"_id": "yeTTYNkhFtq4cGmeD", "postedAt": "2023-08-27T20:24:33.481Z", "postId": "Xd9ZZuPCKAvKpzvdB", "htmlBody": "<p>Thanks. In reviewing the survey methodology more carefully, I see the data comes from cross-sectional survey over 3 months at yearly time points Therefore impossible to say when during the year the increased use began. &nbsp;But as Nick and the post clearly state, if this was the only major intervention during 2021, it’s reasonable to assume that at least some of the increase was due to the FEM campaign.</p>", "parentCommentId": "FkvngXQ4heFvaYh7Z", "user": {"username": "Paula Amato"}}, {"_id": "PcNLkGRtFKZd9Mr9i", "postedAt": "2023-08-28T18:16:57.609Z", "postId": "Xd9ZZuPCKAvKpzvdB", "htmlBody": "<p>Editing my post as I may have come across too critical. &nbsp;Very supportive of this work and just trying to give helpful feedback.</p>", "parentCommentId": "9gWx3mptcamAo2C2u", "user": {"username": "Paula Amato"}}, {"_id": "Zr36evsnkhKYd3gpv", "postedAt": "2023-09-08T19:50:25.411Z", "postId": "Xd9ZZuPCKAvKpzvdB", "htmlBody": "<p>Wow, you guys are doing so great. I'm curious how you do the creative content? How do you find the people and manage the process using local writers and actors? I would also love to see any information on why you do radio instead of say TikTok?</p>", "parentCommentId": null, "user": {"username": "JeffreyK"}}]