[{"_id": "Mfryis7Ji9inbyd7e", "postedAt": "2023-02-20T12:19:33.906Z", "postId": "XDwnGK7x4EjkaHbje", "htmlBody": "<p>Fun game, great job!</p><p>Giving feedback, my only quibble would be with the \"prime california zip codes\" question. I'm not from the US so I only have a vague idea of what a zip code is, I don't know how many digits are in one and how dense they are, so anyone in the US has a signficant advantage in that question over me. Americans get a similar leg up in the \"netflix US\" question, but it's not as bad cause netflix is more universal.&nbsp;</p><p>Obviously it's not a big deal (I got both questions right anyway), but it might be worth thinking about issues like that in the future. Perhaps by providing a few relevant details to put everyone on the same page, or by including a clause in the \"don't look things up\" rule.&nbsp;</p>", "parentCommentId": null, "user": {"username": "titotal"}}, {"_id": "NWMCuEhSMRbhAeJJc", "postedAt": "2023-02-20T20:42:18.693Z", "postId": "XDwnGK7x4EjkaHbje", "htmlBody": "<p>Wow, thank you so much for this! I was looking for exactly this type of product a couple of months ago, and was feeling frustrated at the lack of good options in this niche.</p>\n<p>Really excited to try this out!</p>\n", "parentCommentId": null, "user": {"username": "Angelina Li"}}, {"_id": "6ZAouZzvuKk7GKkxe", "postedAt": "2023-02-20T21:07:27.404Z", "postId": "XDwnGK7x4EjkaHbje", "htmlBody": "<p>Thanks very much for the feedback, this is really helpful!</p>\n<p>If anyone has question suggestions, I'd really appreciate them! I think crowdsourcing questions will help us make them super varied and globally relevant. I made a suggestion form here <a href=\"https://forms.gle/792QQAfqTrutAH9e6\">https://forms.gle/792QQAfqTrutAH9e6</a></p>\n", "parentCommentId": "Mfryis7Ji9inbyd7e", "user": {"username": "Adam Binks"}}, {"_id": "GcpaGbeyZ8tCRfMrr", "postedAt": "2023-02-21T00:30:56.661Z", "postId": "XDwnGK7x4EjkaHbje", "htmlBody": "<p>Thanks for making this! It was a lot of fun to play and I imagine it will be good practice.</p>", "parentCommentId": null, "user": {"username": "kei"}}, {"_id": "PGfzFGcJbQ4ALLnQ2", "postedAt": "2023-02-21T15:12:07.981Z", "postId": "XDwnGK7x4EjkaHbje", "htmlBody": "<p>I would like to use the site without logging in. A Google account is required to use the site (pastcasting, calibration, estimation game). This is an unnecessary hurdle. Not everyone has or wants a Google account. From a technical point of view everything could work without logging in (using cookies or localstorage for persistent state) and I would be fine with not being able to show up on the leaderboards.</p><p>I understand that the Google login makes it easier for you to make the site and this might be an unreasonable request.</p>", "parentCommentId": null, "user": {"username": "Forslack"}}, {"_id": "9AoXMYiDTKfveQjAe", "postedAt": "2023-02-23T12:15:44.429Z", "postId": "XDwnGK7x4EjkaHbje", "htmlBody": "<p>Thanks for the feedback Forslack! I'm curious whether you'd prefer to play without logging in because you don't have a Google account or because you don't want to share your email?</p>\n", "parentCommentId": "PGfzFGcJbQ4ALLnQ2", "user": {"username": "Adam Binks"}}, {"_id": "wX7Np3BdvBhgR77Ev", "postedAt": "2023-02-23T14:27:56.776Z", "postId": "XDwnGK7x4EjkaHbje", "htmlBody": "<p>Not Forslack, but if you're going to ask for permission for Google to share all that info you should have a clear privacy policy visible for what you'll do with it. Also, I don't think you have to request all that info from Google, like real name, to use a Google login.</p>\n", "parentCommentId": "9AoXMYiDTKfveQjAe", "user": {"username": "Jason"}}]