[{"_id": "oDjG3wCaWFFAwps7o", "postedAt": "2022-11-07T15:57:48.207Z", "postId": "XDy8CQf2JnTz5bSXX", "htmlBody": "<p>Just found, at EA Oxford we just changed \"intro fellowship\" and \"in depth fellowship\" to \"intro seminar programme (ISP) and in depth seminar programme (idsp)</p>\n", "parentCommentId": null, "user": {"username": "Gideon Futerman"}}, {"_id": "kwPzdBoLFmH3AKak7", "postedAt": "2022-11-07T16:23:01.255Z", "postId": "XDy8CQf2JnTz5bSXX", "htmlBody": "<p>As I write this comment, the post has negative karma, but nobody seems to have explained why they disagree with the post. I haven’t made my mind up on this yet, and I’d love to hear from the people who push back on this (e.g. the people who are downvoting it).</p>\n", "parentCommentId": null, "user": {"username": "henryj"}}, {"_id": "YnEvrH9a86MuygfRT", "postedAt": "2022-11-07T17:46:46.688Z", "postId": "XDy8CQf2JnTz5bSXX", "htmlBody": "<p>Yeah I think college students will often think \"Fellowship\" is religious because that's likely the only context they have seen the word used in, even though it's often used for all kinds of non-religious opportunities.&nbsp;<br><br>I'm not sure how important this is - I soon realized lots of fellowships at my school were not religious and that it had a broader meaning.&nbsp;<br><br>I guess people could try different things out and see how they work. Maybe something simple like EA reading group. Or focus on a topic name: people would probably be less likely to confuse something like \"public health/pandemic prevention/AI Ethics fellowship\" as something religious.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Peter Gebauer"}}, {"_id": "JGsSkD8isceaaAf2H", "postedAt": "2022-11-07T18:32:27.366Z", "postId": "XDy8CQf2JnTz5bSXX", "htmlBody": "<p>The name change sounds good to me.</p>\n<p>Although, when I did the intro and in-depth course, it was simply called The Effective Altruism Introductory &amp; In-depth Program.</p>\n<p>If it was called a fellowship, it wouldn't mean a religious thing to me, perhaps because I have been on several fellowship programs and have co-run others, that has nothing to do with religion.</p>\n<p>Thanks for sharing. I may adopt some of the suggestions to my EA group, when sharing about the programs.</p>\n", "parentCommentId": null, "user": {"username": "fashdami"}}, {"_id": "2MzsYjAvYeekYLmG3", "postedAt": "2022-11-08T08:29:00.300Z", "postId": "XDy8CQf2JnTz5bSXX", "htmlBody": "<p>For what it's worth, my independent impression was that the fact that \"fellowship\" sounded more prestigious was probably a good thing, mostly because it could fit within an academic culture very well<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnref2g8vn6ujl0h\"><sup><a href=\"#fn2g8vn6ujl0h\">[1]</a></sup></span>.&nbsp;</p><p>I had never made the connection to religious fellowships<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnref2yb5zfi1p9u\"><sup><a href=\"#fn2yb5zfi1p9u\">[2]</a></sup></span>, and I don't quite understand the argument from epistemics<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefq69ick24qe\"><sup><a href=\"#fnq69ick24qe\">[3]</a></sup></span>. However, I do like the potential emphasis on doing and learning, which, I think, is a problem in the current form of most introductory fellowships (see <a href=\"https://forum.effectivealtruism.org/posts/ZPNNnEu2HGNSNmifo/we-re-all-teachers-learn-to-do-it-better#If_educate_is_the_goal__use_evidence_based_education_strategies\">here</a>).</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fn2g8vn6ujl0h\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnref2g8vn6ujl0h\">^</a></strong></sup></span><div class=\"footnote-content\"><p>This might be very dependent on the communications strategy of each group. At our local student group, we found the connection with academia helpful; however that also raises legitimate concerns with diversity.</p></div></li><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fn2yb5zfi1p9u\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnref2yb5zfi1p9u\">^</a></strong></sup></span><div class=\"footnote-content\"><p>This might be cultural; my first language is spanish, where \"fellowship\" is mostly used untranslated and only in the academic sense.&nbsp;</p></div></li><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnq69ick24qe\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefq69ick24qe\">^</a></strong></sup></span><div class=\"footnote-content\"><p>Why would \"fellowship\" point to a set of dogmas but \"seminar\" wouldn't?</p></div></li></ol>", "parentCommentId": null, "user": {"username": "agucova"}}, {"_id": "dLw4EZqA5Gey4bzpA", "postedAt": "2022-11-08T15:56:38.470Z", "postId": "XDy8CQf2JnTz5bSXX", "htmlBody": "<p>Perhaps one source of downvotes is that the main idea of this post is unoriginal. Anyone putting on an intro fellowship has put some amount of thought into:&nbsp;</p><ul><li>Do I call it a \"fellowship\" to give it prestige, or do I call it a \"seminar\" / \"reading group\" to make it sound academic, or do I call it a \"program\" or a more neutral tone, ...</li><li>Do I call it \"Arete\" to sound fancy, or do I call it \"intro\" to sound welcoming, ...</li><li>Do I explicitly put \"EA\" in the title?</li></ul><p>The one new thought here seems to be having the acronym \"IDEA\" stand for \"Introduction to making a Difference through Effective Altruism\". <i>And this post isn't even a comprehensive exploration of the pros and cons of this acronym!</i> &nbsp;OP leaves off one important downside: at other universities (e.g. Harvard, Brown), IDEA stands for \"In-Depth EA\". Another point OP doesn't expand on is why \"fellowship\" had religious connotations for so many people. (Could this be more of an issue in LSU / the US South in general, compared to other parts of US/Europe?)&nbsp;</p><p><a href=\"https://forum.effectivealtruism.org/posts/54R2Masg3C9g2GxHq/announcing-naming-what-we-can-1\">Finding good names is important</a>, but this post doesn't really do much in aim of this goal. The pros and cons here are exclusively supported by anecdotal evidence or OP's personal aesthetics. Stuff I would like to see in the \"naming CB interventions better\" space:&nbsp;</p><ul><li>More experiments such as <a href=\"https://forum.effectivealtruism.org/posts/hjhG6hb8dsPrcuwn8/should-you-use-ea-in-your-group-name-an-update-on-pise-s\">“Should you use EA in your group name?” An update on PISE’s naming experiment</a></li><li>A compendium of names used at different universities / regions, with attached retrospectives from organizers&nbsp;</li><li>(Probably too high effort) Proper user testing on group names</li></ul>", "parentCommentId": "kwPzdBoLFmH3AKak7", "user": {"username": "electroswing"}}, {"_id": "Civ2FruySHfofwbKi", "postedAt": "2022-11-09T20:26:10.377Z", "postId": "XDy8CQf2JnTz5bSXX", "htmlBody": "<p>To potentially confuse things even more: I know some groups in the Netherlands use the name 'IDEA program' to refer to the in-depth fellowship.<br><br><strong>I</strong>n-<strong>D</strong>epth <strong>EA</strong> program</p>", "parentCommentId": null, "user": {"username": "Joris P"}}]