[{"_id": "vkqdBmEuhwfGZP4vb", "postedAt": "2023-02-21T23:39:48.404Z", "postId": "XFBGu9sGfbYAsb8Gb", "htmlBody": "<p>Thank you for this post and the work you're doing. Given the small size and newness of the EA community and many orgs/projects, I'm personally also very worried about something like \"right group of people, great practices, unforeseen or unpreventable dependencies that lead to major risk of collapse should a few key things go wrong in succession.\" My impression is that in some cases things have been going very well but the external pressures have been so substantial and consistent the past few months that even very stable teams are trembling. Sound practices can help mitigate this, but I also want to see more people feeling ok saying, \"this is a shit time and we're treading water, but we're able to tread water until we reach shore <em>because</em> we prioritized a healthy infrastructure beforehand.\"</p>\n", "parentCommentId": null, "user": {"username": "Rockwell Schwartz"}}, {"_id": "YgFHqj2Q65wWkzW9j", "postedAt": "2023-02-22T04:17:07.051Z", "postId": "XFBGu9sGfbYAsb8Gb", "htmlBody": "<p>Happy to see this, thanks for putting it together.<br><br>For what it's worth, I roughly agree with a lot of this. I personally see EA challenges now very much as \"maturing in management, generally\" as opposed to anything very specific, like, \"stopping a few bad actors\".&nbsp;<br><br>I expect that many senior people roughly would agree.&nbsp;</p>", "parentCommentId": null, "user": {"username": "oagr"}}, {"_id": "z5EahhuvvsTgo9PNv", "postedAt": "2023-02-22T04:38:08.155Z", "postId": "XFBGu9sGfbYAsb8Gb", "htmlBody": "<p>What do you specifically mean by \"maturing in management, generally\"? I noticed that people &nbsp;tend to have very different things in mind when they are talking about \"Improving management in EA\" so could be worth clarifying</p>", "parentCommentId": "YgFHqj2Q65wWkzW9j", "user": {"username": "Jona"}}, {"_id": "pzCdoexkzvTKgEriQ", "postedAt": "2023-02-22T16:12:42.167Z", "postId": "XFBGu9sGfbYAsb8Gb", "htmlBody": "<p>What is the main issue in EA governance then, in your view? It strikes me [I'm speaking in a personal capacity, etc.] the challenge for EA is a combination of the fact the resources are quite centralised <i>and </i>that trustees of charities are (as you say) not accountable to anyone. One by itself might be fine. Both together is tricky. &nbsp;I'm not sure where this fits in with your framework, sorry.&nbsp;</p><p>There's one big funder (Open Philanthropy), many of the key organisations are really just one organisation wearing different hats (<a href=\"https://forum.effectivealtruism.org/posts/GoWNiPbrEb6NHD3MF/announcing-interim-ceos-of-evf\">EVF</a>), and these are accountable only to their trustees. What's more, &nbsp;as <a href=\"https://forum.effectivealtruism.org/posts/54vAiSFkYszTWWWv4/doing-ea-better-1?commentId=7cDqgi7bjdJ3uS9pS#comments\">Buck notes here</a>, all the <i>dramatis personae</i> are quite friendly (\"lot of EA organizations are led and influenced by a pretty tightly knit group of people who consider themselves allies\"). &nbsp;Obviously, some people will be in favour of centralised, unaccountable decision-making - those who think it gets the right results - but it's not the structure we expect to be conducive to good governance in general.</p><p>If power in effective altruism were decentralised, that is, there were lots of 'buyers' and 'sellers' in the 'EA marketplace', then you'd expect competitive pressure to improve governance: poorly run organisations will be wracked by the \"gales of creative destruction\" as donors go elsewhere.</p><p>If leaders in effective altruism were accountable, for instance, if EVF became a membership organisation and the board were elected by its (paying?) members, that would provide a different sort of check and balance. I don't think it's reasonable for individual donors, i.e. Dustin Mosktovitz and Cari Tuna, or cause-specific organisations, <a href=\"https://forum.effectivealtruism.org/posts/zuqpqqFoue5LyutTv/the-ea-community-does-not-own-its-donors-money\">to submit their money to the democratic will</a>, but it seems more sensible for central organisations, those that are something like natural monopolies and ostensibly serve the whole community, to have democratic elements.</p><p>As it is, the governance structure across EA &nbsp;is, essentially, for its leaders to police themselves - and wait for media stories to break. Particularly in light of recent events, it's unclear if this is the <i>optimal </i>approach. I am reminded of the following passage in Pratchett.</p><blockquote><p><i>Quis custodiet ipsos custodes</i>? Your Grace.”<br>“I know that one,” said Vimes. “Who watches the watchmen? Me, Mr. Pessimal.”<br>“Ah, but who watches you, Your Grace?” said the inspector with a brief little smile.<br>“I do that, too. All the time,” said Vimes. “Believe me.”<br>&nbsp;</p><p>-Terry Pratchett, <i>Thud!</i></p></blockquote>", "parentCommentId": null, "user": {"username": "MichaelPlant"}}, {"_id": "f5MYrdtzxR4Q6Dccb", "postedAt": "2023-02-22T16:29:09.893Z", "postId": "XFBGu9sGfbYAsb8Gb", "htmlBody": "<p>I defer a lot to experts / well respected managers.</p><p>To me, EA has a bunch of young people optimized a lot for some specific non-management talents. It seems a lot like a startup in that way.</p><p>Many startups go through \"growing up\" periods. Some totally fail at this, but when it works well, the outcome can be very successful.</p><p>I imagine as we get good consultants here, they will recommend some fairly straightforward and correlated recommendations that I'd agree with.<br><br>I found the Personal MBA reading list to be interesting. There are really a lot of \"serious organization\" skills that are hard to get good at.&nbsp;<br><a href=\"https://personalmba.com/best-business-books/\">https://personalmba.com/best-business-books/</a><br>&nbsp;</p>", "parentCommentId": "z5EahhuvvsTgo9PNv", "user": {"username": "oagr"}}, {"_id": "gbXahQZFxgWvMXdB6", "postedAt": "2023-02-22T16:36:35.083Z", "postId": "XFBGu9sGfbYAsb8Gb", "htmlBody": "<p>Upvoted. I think there is an assumption lurking in here, though. It seems likely that EVF would be a pale shadow of itself without Open Phil and other big-donor money. I dont member fees can plausibly replace that.</p>\n<p>So there seemingly has to be an assumption that the big donors should continue funding EVF even if they strongly disagree with who the demos elects, as opposed to funding whatever the old guard starts up after being deposed. There seems to be some tension with the idea that donors aren't obliged to defer to the democratic will.</p>\n", "parentCommentId": "pzCdoexkzvTKgEriQ", "user": {"username": "Jason"}}, {"_id": "KYSjKeqkHbLDGJzcs", "postedAt": "2023-02-22T18:21:45.504Z", "postId": "XFBGu9sGfbYAsb8Gb", "htmlBody": "<p>Ah. I should probably have flagged I'm pointing to an ideal world. &nbsp;As goes (almost) without saying, all this is easier said than done. You could say that EA's challenge is that it has only one mega-donor. It seems much better that it has one than none, but having just one creates distinctive governance challenges compared to if there was no mega-donor but lots of small donors; this latter scenario is a bit closer to a democracy in terms of how power is distributed.</p><p>But your comment does rather make my point. In a world where there is only one major donor, that is, effectively a monopsony (a market with single buyer) you could say \"look, all this talk about good governance is nice, but it's practically irrelevant; the only question to ask is 'what does the big funder want?'\".</p><p>I don't think donors can or should be forced to defer to the democratic will. &nbsp;People, qua citizens in their democracy, can be forced to do things, but charity is a necessarily private act. I think it would be <i>good </i>if EVF had <i>some </i>democratic elements <i>and </i>also that someone paid for it to keep going. But, who am <i>I</i> to tell people what they ought to do, a moral philosopher, or something? &nbsp;:)</p>", "parentCommentId": "gbXahQZFxgWvMXdB6", "user": {"username": "MichaelPlant"}}, {"_id": "hc6Q3fQchQ9ghfDgH", "postedAt": "2023-02-22T18:47:23.907Z", "postId": "XFBGu9sGfbYAsb8Gb", "htmlBody": "<p>Thanks for clarifying! I think Training for Good looked into \"scalable management trainings\", but had a hard time identifying a common theme, which they could work on (<i>This is my understanding based on a few &nbsp;informal chats. This might be outdated and I am sure they have a more nuanced take</i>). Based on my experience, different managers seem to have quite different struggles which change over time and good coaching and peer support seemed to be the most time-effective interventions for the managers (<i>This is based on me chatting occasionally to people and not based on proper research or deep thinking about the topic)&nbsp;</i></p>", "parentCommentId": "f5MYrdtzxR4Q6Dccb", "user": {"username": "Jona"}}, {"_id": "5iM6CdfsYzaHRJFgo", "postedAt": "2023-02-22T19:09:58.213Z", "postId": "XFBGu9sGfbYAsb8Gb", "htmlBody": "<p>I wrote in this direction a few years ago, and I'm very glad to see you clearly stating these points here.&nbsp;</p><p>From <a href=\"https://forum.effectivealtruism.org/posts/Cq97CRNhN6CZMzZ2k/what-s-the-best-structure-for-optimal-allocation-of-ea\">What's the best structure for optimal allocation of EA capital?</a> –&nbsp;</p><blockquote><p>So EA is currently in a regime wherein the large majority of capital flows from a single source, and capital allocation is set by a small number of decision-makers.</p><p>Rough estimate: if ~60% of Open Phil grantmaking decisioning is attributable to Holden, then <strong>47.2% of all EA capital allocation, or $157.4M, was decided by one individual in 2017</strong>. 2018 &amp; 2019 will probably have similar proportions.</p><p>It seems like EA entered into this regime largely due to historically contingent reasons (Cari &amp; Dustin developing a close relationship with Holden, then outsourcing a lot of their philanthropic decision-making to him &amp; the Open Phil staff).</p><p>It's not clear that this structure will lead to optimal capital allocation...</p></blockquote>", "parentCommentId": "pzCdoexkzvTKgEriQ", "user": {"username": "Milan_Griffes"}}, {"_id": "ZhmL2gEqPWbNXQvCp", "postedAt": "2023-02-22T19:31:43.868Z", "postId": "XFBGu9sGfbYAsb8Gb", "htmlBody": "<p>I think there’s no substitute for role models and experience.  Whenever I advise people in EA on careers, I always suggest spending some time in ‘normal’ organisations first</p>\n", "parentCommentId": "hc6Q3fQchQ9ghfDgH", "user": {"username": "Grayden"}}, {"_id": "aYHHvHnHG9q6cc2st", "postedAt": "2023-02-22T23:03:39.567Z", "postId": "XFBGu9sGfbYAsb8Gb", "htmlBody": "<p>Hmm. Obviously, career advice depends a lot on the individual and the specific context, all things equal, I tentatively agree that there is <i>some </i>value in having seen a large \"functioning\" org. I think many of these orgs have also dysfunctional aspects (e.g., I think most orgs are struggling with sexual harassment and concentration of formal and informal power) and that working at normal orgs has quite high opportunity costs. I also think that many of my former employers were net negative for some silly which I think are highly relevant, e.g., high-quality decision making&nbsp;</p>", "parentCommentId": "ZhmL2gEqPWbNXQvCp", "user": {"username": "Jona"}}, {"_id": "vCLJXafiZw8mr4fYo", "postedAt": "2023-02-23T09:54:16.193Z", "postId": "XFBGu9sGfbYAsb8Gb", "htmlBody": "<p>Something OpenPhil could do is fund explicit alternatives to core EA orgs. They don't have to be 'competitors' per se, in that there's no market they have to vie for, but they could do the same thing in a different context - events in Europe vs events in North America for example, or longtermist events vs animal welfare events, and be available for the occasional encroachment into the others' remit if someone asks them to. That way you could have multiple organisations with similar competence, and a visible signal if one was consistently doing better than the others, and &nbsp;funding could explicitly follow that signal.</p><p>This would be a lot easier the more focused the orgs/the less mission creep they had, since then the comparisons would be a lot higher fidelity. EVF's current structure doesn't seem ideal for this.</p>", "parentCommentId": "gbXahQZFxgWvMXdB6", "user": {"username": "Arepo"}}, {"_id": "dQwjRRuQXyuhLFkej", "postedAt": "2023-02-23T12:19:28.468Z", "postId": "XFBGu9sGfbYAsb8Gb", "htmlBody": "<p>This is an interesting idea, but I don't know how feasible or realistic it is.  I find it really helpful to think of EA as a marketplace for maximum impact goods and services. Like your local farmers' market, but instead of selling fruit and vegetables, people are offering charities, charity recommendations, and so on. (I've been reflecting on this for a while, and might write it up as a standalone post). The analogy doesn't have to be perfect to be informative. In this framing, what we'd want, presumably, is for there to be lots of competition and choice, so that consumers get a better deal. You don't want there to be just one guy that sells fruit, and only sells oranges, for example.</p>\n<p>The challenge for EA is that one buyer dominates the market: Open Philanthropy is, I think, 50+% of total. In effect, you're going to get <em>about</em> as much variety as OP wants, when they do their own 'shopping': if OP wants to buy your fruit, you're in business; if they don't, it's much harder to survive in the market. If they want there to be a greater variety of sellers, they can create demand for them - equivalent to saying \"hey, if you start selling apples in the market, we'll buy 10 crates\" or whatever. But it's not clear if it's a good use of their money, by their lights, to create a market for products they don't really want and other people may not want. It puts the new vendors in an odd, risky position too if they only exist because they have one, questionably enthusiastic consumer.  They could see it as a good use of money: they'd be subsiding the creation of products in the hope of creating demand and bringing other people into the market. Hence, it's not obvious the main buyer in a marketplace would want to creat variety vs just seek out the specific things they want.*</p>\n<p>*Mutatis mutandis, there are the same issues if major funders engage in regranting, which is like giving your friends some of your money and asking them to buy stuff in the market. If your friends have the same preferences to you, they'll buy the same stuff, so there's no point. If they buy stuff you'd hate, then you'll think you shouldn't have given them money. Either way, unless you keep giving them money, it's only an artificial spike in consumption.</p>\n", "parentCommentId": "vCLJXafiZw8mr4fYo", "user": {"username": "MichaelPlant"}}, {"_id": "JxxcRG42L37SRJPXs", "postedAt": "2023-02-23T13:06:22.581Z", "postId": "XFBGu9sGfbYAsb8Gb", "htmlBody": "<blockquote><p>But it's not clear if it's a good use of their money, by their lights, to create a market for products they don't really want and other people may not want</p></blockquote><p>I'm thinking more about separating existing markets, or perhaps setting up new orgs to catch the overflow from when existing ones expand. Fwiw FTX Foundation explicitly wanted to do this - they had a category for 'competition to existing EA orgs'. This could have been because as a different org they were sceptical of OP's priorities, &nbsp;though this seems unlikely given the substantial overlap between the people involved, so it seems more like a genuine desire for a better marketplace.</p><blockquote><p>If your friends have the same preferences to you, they'll buy the same stuff, so there's no point. If they buy stuff you'd hate, then you'll think you shouldn't have given them money. Either way, unless you keep giving them money, it's only an artificial spike in consumption.</p></blockquote><p>This seems too simplistic and worrying if we genuinely think this is how OP think. Most people recognise that there's a wisdom in crowds, and epistemic advantage to a diversity of thoughtful viewpoints.</p>", "parentCommentId": "dQwjRRuQXyuhLFkej", "user": {"username": "Arepo"}}, {"_id": "qYabdAxrKohbDSSCc", "postedAt": "2023-02-23T14:06:57.978Z", "postId": "XFBGu9sGfbYAsb8Gb", "htmlBody": "<p>Great post, thanks.</p>\n<p>I might elaborate on your last category to include a) well-intentioned high competence people accidentally creating bad systems; and b) well-intentioned high competence people put into bad systems by leadership (so not just leaders but e.g. a community health team trying to deal with sexual harassment by one of their own Board members).</p>\n<p>I think your section header covers this, but the body focuses specifically on CEOs and Boards. Lots of people in EA, not just leadership, can end up making mistakes because the systems/policies they work within aren't fit for purpose.</p>\n", "parentCommentId": null, "user": {"username": "jlewars"}}, {"_id": "r3ZmvMP8L3fyjGGAt", "postedAt": "2023-02-23T19:28:08.933Z", "postId": "XFBGu9sGfbYAsb8Gb", "htmlBody": "<p>Dear all</p><p>An interesting thread.</p><p>For what is worth, I have &nbsp;over 15 years experience observing &nbsp;governance failures at different levels in organization where I work (that shall name anonymous), as well a \"bad actor\" incident within one of the multiple project specific teams that I have developed and then disbanded or transferred once the work was complete. I fully agree with the analysis and the first part of the response/mitigation measure proposed by Grayden.</p><p>In addition, looking the EA sector personnel profiles and reading some of their posts, what strikes me is the amount of intelligence and energy demonstrated, in parallel with apparent limited life experience and in some cases simply a lack of wisdom. This in turn I feel reflects the recent surge in interest in EA. Previously it was a niche and fairly academic , and thus a bit grey haired. Then for a few years it has started to attract a lot of bright young talent, culturally trained for better or worse in part by the tech startup sector. &nbsp;</p><p>The timeless reality is that young energetic people with insufficient mentoring and/or oversight make mistakes, cause or sustain some damage and then learn from this. That happened to myself as well, more than once. The problem is when these young explorers are also leaders, in a position of serious authority or influence and in the public spotlight. Then the fall can be long and the collateral damage can be immense. &nbsp;</p><p>The clean up and recovery, as I know all too well, can take literally years, even for small to medium sized incidents. Major incidents can simply kill off entire teams, initiatives and organizations or leave a permanent mark.</p><p>EA right now is sadly in the global reputation doghouse and proving to be an easy target for critics. &nbsp;A 101 good governance improvement campaign will certainly help, starting at the top as Grayden proposes. I would also suggest that the movement look again at its team profiles and internal training.&nbsp;</p><p>What may work better in the long run is more of a balanced blend of youthful energy, external viewpoints and deeper older experience : neither dampening what makes EA so interesting and potentially useful, nor letting individuals drive the movement off the cliff.</p>", "parentCommentId": null, "user": {"username": "Andrew Morton"}}, {"_id": "rsGap7kwQaMTJ69Ew", "postedAt": "2023-02-23T23:24:27.925Z", "postId": "XFBGu9sGfbYAsb8Gb", "htmlBody": "<p>Re: \"I think many of these orgs have also dysfunctional aspects (e.g., I think most orgs are struggling with sexual harassment and concentration of formal and informal power)\"</p><p>I agree with that, but I also think there's something to be learned from dysfunctional orgs. Why are they dysfunction? How did they become dysfunctional? Why have attempts to make them less dysfunctional failed?&nbsp;</p><p>There is just as much — possibly more — to be learned from failures as there is to learn from successes.</p>", "parentCommentId": "aYHHvHnHG9q6cc2st", "user": {"username": "Trish"}}, {"_id": "zPYrQq5dqWcC4AJgm", "postedAt": "2023-02-26T16:51:54.599Z", "postId": "XFBGu9sGfbYAsb8Gb", "htmlBody": "<blockquote>\n<p>charity is a necessarily private act</p>\n</blockquote>\n<p>Why so?</p>\n", "parentCommentId": "KYSjKeqkHbLDGJzcs", "user": {"username": "Guy Raveh"}}, {"_id": "tZvSSwuk3hGuswFgp", "postedAt": "2023-02-28T11:59:24.856Z", "postId": "XFBGu9sGfbYAsb8Gb", "htmlBody": "<p>On the whole I think there's less to learn from failures than successes because there are many different ways to get things wrong, so ruling out just one doesn't help you that much. The lesson is only valuable if you would have been dysfunctional in that specific way, and are now able to avoid it.</p>\n<p>Working in dysfunctional workplaces can still be educational if:</p>\n<ul>\n<li>their dysfunction is the biggest / most obvious trap to fall into, and learning to avoid it really does affect your chances of success,</li>\n<li>they're not dysfunctional in <em>all</em> ways, and have enough other good examples to learn from.</li>\n</ul>\n<p>I suspect that in reality a lot of organizations are dysfunctional in ways that aren't useful, e.g. incentive problems. While incentive problems do exist in EA, the incentive landscape is pretty different and I'd guess a lot of the traps don't straightforwardly translate.</p>\n", "parentCommentId": "rsGap7kwQaMTJ69Ew", "user": {"username": "BenMillwood"}}, {"_id": "wXjquZ3FfCSYqhEBE", "postedAt": "2023-03-01T19:13:57.143Z", "postId": "XFBGu9sGfbYAsb8Gb", "htmlBody": "<p>I think EA has a particular problem where the emphasis on getting people who are \"value aligned\" means they don't get in experienced people from outside. Software startups have at least learned to bring in an experienced COO to help run day to day things</p>", "parentCommentId": "f5MYrdtzxR4Q6Dccb", "user": {"username": "projectionconfusion"}}, {"_id": "Emj2vaJ56cQdrChhf", "postedAt": "2023-03-01T20:27:39.890Z", "postId": "XFBGu9sGfbYAsb8Gb", "htmlBody": "<p>In the early days, it was hard to get people who were sufficiently “value aligned” with experience.  I don’t think that’s the case anymore.  For example, there are many value-aligned highly-experienced people on the EA Good Governance Project’s Trustee Directory.  The issue is that many people don’t want to give up partial control of something to somebody outside their clique and/or prior to October didn’t have an easy way to find them</p>\n", "parentCommentId": "wXjquZ3FfCSYqhEBE", "user": {"username": "Grayden"}}, {"_id": "FAJAzfHpjLuqM3ZEa", "postedAt": "2023-03-02T03:50:30.404Z", "postId": "XFBGu9sGfbYAsb8Gb", "htmlBody": "<p>I think good startups often do this, but lots of startups have trouble about this stage. Many do have their own cultures that are difficult to retain as they grow.&nbsp;<br><br>I think EA is more intense as there's more required material to understand, but it's a similar idea.</p>", "parentCommentId": "wXjquZ3FfCSYqhEBE", "user": {"username": "oagr"}}, {"_id": "9QBwwdi64gCCoGpiY", "postedAt": "2023-02-23T09:46:16.227Z", "postId": "XFBGu9sGfbYAsb8Gb", "htmlBody": null, "parentCommentId": "gbXahQZFxgWvMXdB6", "user": null}]