[{"_id": "roErDk2y5FWeQapc6", "postedAt": "2023-10-17T03:37:33.648Z", "postId": "XHedou8TjeAccuerm", "htmlBody": "<p>Hi William, interesting post :) Some reactions:&nbsp;</p><ul><li>I think the <a href=\"https://www.lesswrong.com/\">LW audience</a> may be interested in this as well, so consider cross-posting there</li><li>While I don't think this will change your (pretty unobjectionable) bottomline conclusion that \"the limit of computation is far above all humans combined\", I'd be curious to know if you've considered other approaches to estimating the theoretical computational limit of the solar system, and how those BOTECs would compare to your current approach (in the spirit of how Ajeya Cotra considered <a href=\"https://docs.google.com/document/d/1IJ6Sr-gPeXdSJugFulwIpvavc0atjHGM82QjIfUSBGQ/edit#heading=h.djncc8ogd3mw\">4 different anchors</a> in her <a href=\"https://drive.google.com/drive/u/0/folders/15ArhEPZSTYU8f012bs6ehPS6-xmhtBPP\">report</a> for estimating training computation requirements for a \"<a href=\"https://docs.google.com/document/d/1IJ6Sr-gPeXdSJugFulwIpvavc0atjHGM82QjIfUSBGQ/edit#heading=h.6t4rel10jbcj\">transformative</a>\" model, and arrived at a pretty wide range)</li><li>Same question for estimating the computational ability of all humans alive. In particular you may want to check out Open Philanthropy's 2020 report <a href=\"https://www.openphilanthropy.org/research/how-much-computational-power-does-it-take-to-match-the-human-brain/\">How Much Computational Power Does It Take to Match the Human Brain?</a> (see chart below from the report for how widely the numbers can range)</li><li>Come to think of it, if the idea is to show that the \"limit of computation is far above all humans combined\", you may be interested in a computation efficiency-oriented perspective (e.g. normalizing by power consumption), in which case Robert Freitas' <a href=\"http://www.rfreitas.com/Astro/Xenopsychology.htm\">sentience quotient</a> may interest you (scroll down to the last section). Seth Lloyd's <a href=\"https://arxiv.org/abs/quant-ph/9908043\">ultimate laptop</a> calculations may interest you as well&nbsp;</li><li>Considering instead the perspective of \"ultimate brains\", you may be interested in Anders Sandberg's <a href=\"https://philpapers.org/rec/SANTPO-19\">The physics of information processing superobjects: daily life among the Jupiter brains</a>, in particular his calculations w.r.t. the physics and engineering constraints guiding the design specs for Dyson brains, Jupiter brains and \"neutronium\" brains</li></ul><p>Happy reading :)&nbsp;</p><figure class=\"image\"><img src=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/roErDk2y5FWeQapc6/cew1of7pvtzxdcf0jqrl\" alt=\"FLOPsBudgets5.png\"></figure>", "parentCommentId": null, "user": {"username": "Mo Nastri"}}, {"_id": "SmtSdqvKK6HJeEd96", "postedAt": "2023-10-17T06:06:39.620Z", "postId": "XHedou8TjeAccuerm", "htmlBody": "<p>If you're trying to maximize computational efficiency, instead of building a Dyson sphere, shouldn't you drop the sun into a black hole and harvest the Hawking radiation?</p>\n", "parentCommentId": null, "user": {"username": "robirahman"}}, {"_id": "wfjz6q6nbujaXBFnc", "postedAt": "2023-10-17T10:18:23.967Z", "postId": "XHedou8TjeAccuerm", "htmlBody": "<p>Hi Robi,</p><p>For reference, Anders Sandberg <a href=\"https://80000hours.org/podcast/episodes/anders-sandberg-best-things-possible-in-our-universe/\">discussed</a> that on The 80,000 Hours Podcast (emphasis mine):</p><blockquote><p>[Anders:] The best method [to extract energy after the era of starts], in my opinion, is to use black holes. I’m very fond of black hole power. And I am assuming that maybe in a few trillion years I’m going to be dealing with protesters saying, “No black holes in our neighbourhood,” and “Don’t build that power plant, Anders.” But they’re actually lovely. Black holes have <a href=\"https://en.wikipedia.org/wiki/Accretion_disk\">accretion disks</a> when they suck in matter. Or rather, it’s not that they suck in matter — that’s kind of a picture we get from science fiction — they’re just an object with gravity like anything else. But what happens when you put a lot of junk around a black hole? They form a disk, and the friction between parts of the disk heats up the matter. That means it radiates away energy and gets more tightly bound and slowly spirals in. There is also some angular momentum leaking out at the sides where some dust gets thrown off.</p><p>The effect of this is that the potential energy of that junk — and it can be anything: burnt-out stars, old cars, old space probes, planets you don’t care for, et cetera — gets ground down, and the potential energy gets released as radiation. So now you can build a Dyson sphere, a very big one, around this whole system, and get all of that energy.</p><p>How much total mass energy can you get? It turns out it’s almost up to 40% for a rapidly spinning black hole. The exact limit depends on where the inner edge of the accretion disk is, because eventually you get close enough that you essentially fall straight in without releasing any more energy, and that gets trapped inside the black hole. Now, converting 40% of the mass energy of old cars and space probes into energy is kind of astonishing: that is way more effective than fusion. <strong>So actually, the stars might not be the biggest energy source around. We might actually be able to make the galaxies shine much more if we dump things into black holes and gather that energy.</strong></p></blockquote><p>William, I am guessing you would like Anders' episodes! You can find them searching for \"Anders Sandberg\" <a href=\"https://80000hours.org/podcast/#list-by-interviewee\">here</a>.</p>", "parentCommentId": "SmtSdqvKK6HJeEd96", "user": {"username": "vascoamaralgrilo"}}, {"_id": "Dkzn5Zbbe8tT4HWgw", "postedAt": "2023-10-17T15:42:50.517Z", "postId": "XHedou8TjeAccuerm", "htmlBody": "<p>Yea, I found him to be a fascinating person when I talked to him at EAGx Warsaw.<br><br>I'm initially sceptical of getting 40% of the mass-energy out of, well, anything. Perhaps I would benefit from reading more on black holes.&nbsp;<br><br>However I would in principle agree with the idea that if black holes are feasible power outputers, this would increase the theoretical maximum computation rate.&nbsp;</p>", "parentCommentId": "wfjz6q6nbujaXBFnc", "user": {"username": "William the Kiwi"}}, {"_id": "eu42sKfqTGbLFkJw3", "postedAt": "2023-10-17T16:30:14.058Z", "postId": "XHedou8TjeAccuerm", "htmlBody": "<p>Hi Mo, thanks for the feedback.</p><ol><li>Good thought, I've cross-posted it to my account there.</li><li>This post was spurred by a conversation I had about the upper limit of AI intelligence and the fact that it was likely very far above all humans combined. This is meant as, like you said, a pretty unobjectionable support for my then assumed conclusion. The conversion was heavily influenced by Cotra's Bioanchors report.</li><li>I was estimating the brains computation ability very roughly. I guessed that there would be more detailed estimations already done, but would take time to read through and understand their premises. I'll read through the document when I have some time.</li><li>These two look interesting to read.</li><li>Anders Sandberg is an interesting person. I speculated someone had done calculations similar to mine, I'm not surprised that he is one of such people.</li></ol>", "parentCommentId": "roErDk2y5FWeQapc6", "user": {"username": "William the Kiwi"}}, {"_id": "CSkPocMPoYPbd9KCs", "postedAt": "2023-10-18T04:27:14.925Z", "postId": "XHedou8TjeAccuerm", "htmlBody": "<p>Yeah, your initial guess was right that more detailed estimations had already been done. I figured the reason you posted your rough BOTEC was to invite others to refer you to those more detailed estimates (saves time on your end via crowdsourcing too), since I've done the same as well in the past, hence the shares :) Happy reading</p>", "parentCommentId": "eu42sKfqTGbLFkJw3", "user": {"username": "Mo Nastri"}}, {"_id": "8a5E5Jns9FhuYW9tp", "postedAt": "2023-10-18T11:42:20.932Z", "postId": "XHedou8TjeAccuerm", "htmlBody": "<p>An efficient idea, good thinking.</p>", "parentCommentId": "CSkPocMPoYPbd9KCs", "user": {"username": "William the Kiwi"}}]