[{"_id": "aMqZJpSxrgSSNbZiJ", "postedAt": "2022-08-25T08:11:49.073Z", "postId": "Xhm3vshLdufaDfC5Y", "htmlBody": "<p>A follow on book might be called What We Owe The Past. &nbsp; Many generations toiled their entire lives to hand us the comfortable civilization we enjoy today. &nbsp; We owe it to our ancestors not to squander what they so sacrificed for. &nbsp;We owe our elders that respect. &nbsp; And by respecting them, we respect ourselves.</p>", "parentCommentId": null, "user": {"username": "Phil Tanny"}}, {"_id": "QGYThnQ4bKAmoHY5r", "postedAt": "2022-08-25T15:54:37.511Z", "postId": "Xhm3vshLdufaDfC5Y", "htmlBody": "<p>Toby Ord touches on that in The Precipice.<br>For example here (at 11:40)</p><figure class=\"media\"><div data-oembed-url=\"https://youtu.be/CrMIEz_mSJM?t=699\"><div><iframe src=\"https://www.youtube.com/embed/CrMIEz_mSJM\" allow=\"autoplay; encrypted-media\" allowfullscreen=\"\"></iframe></div></div></figure>", "parentCommentId": "aMqZJpSxrgSSNbZiJ", "user": {"username": "TobiasH"}}, {"_id": "gjtB6oaNaAbvd9caY", "postedAt": "2022-08-26T01:46:03.943Z", "postId": "Xhm3vshLdufaDfC5Y", "htmlBody": "<p>Cool!</p><blockquote><p>A philosopher shares his perspective on what we should do now to ensure that civilization would rebound if it collapsed.</p></blockquote><p>The summary seems pretty reductive - I think most of the book is about other things, like making sure civilization doesn't collapse at all or preventing negative moral lock-in. I wonder how they chose it.</p>", "parentCommentId": null, "user": {"username": "caleb-biddulph"}}, {"_id": "NFQT5Be9sNbDmzfCt", "postedAt": "2022-08-26T04:55:42.513Z", "postId": "Xhm3vshLdufaDfC5Y", "htmlBody": "<p>Yes, it's quite bad. NYT bestseller one-sentence summaries are weirdly bad. The summary of \"Godel, Escher, Bach\" was \"A scientist argues that reality is a system of interconnected braids\"; whoever wrote that sentence clearly hadn't read the book.</p>", "parentCommentId": "gjtB6oaNaAbvd9caY", "user": {"username": "zsp"}}, {"_id": "v2hNHDxCWPBbnSQ3c", "postedAt": "2022-08-26T09:59:01.518Z", "postId": "Xhm3vshLdufaDfC5Y", "htmlBody": "<p>The book is marked with the dagger symbol: †<br>\"A dagger indicates that some retailers report receiving bulk orders.\"<br>&nbsp;</p><p>This means we have reason to suspect that a number of sales have not been organic sales to individuals, but bulk sales to game the rating system.&nbsp;</p>", "parentCommentId": null, "user": {"username": "ludwigbald"}}, {"_id": "Pb4ehQRdYKHqKmW9J", "postedAt": "2022-08-26T10:14:40.049Z", "postId": "Xhm3vshLdufaDfC5Y", "htmlBody": "<p>It seems to me there could be other explanations for bulk orders (giveaways?). I don't know what we have reason to believe.</p>", "parentCommentId": "v2hNHDxCWPBbnSQ3c", "user": {"username": "Stefan_Schubert"}}, {"_id": "AG6EpRNRiuk26v2LF", "postedAt": "2022-08-26T11:01:43.971Z", "postId": "Xhm3vshLdufaDfC5Y", "htmlBody": "<p>I don't believe anything nefarious happened, but other people might believe that. If the bulk orders are for giveaways and such, the book might simply be a bit less popular than the bestseller status would otherwise suggest :)</p>", "parentCommentId": "Pb4ehQRdYKHqKmW9J", "user": {"username": "ludwigbald"}}, {"_id": "NRdo48ydiY3Rt4fSR", "postedAt": "2022-08-26T11:16:04.573Z", "postId": "Xhm3vshLdufaDfC5Y", "htmlBody": "<p>Your previous comment gives a different impression of your beliefs, fwiw.</p>", "parentCommentId": "AG6EpRNRiuk26v2LF", "user": {"username": "Stefan_Schubert"}}, {"_id": "sBHX2tphAXzkGJnn8", "postedAt": "2022-08-26T15:12:51.941Z", "postId": "Xhm3vshLdufaDfC5Y", "htmlBody": "<p>Jumping in here — Will is doing a couple events which involved large purchases for attendees, and several university groups also made large orders for Fall 2022 reading groups back in the early summer, when we were driving early sales to ensure the publisher would do a large enough first print of the book. This played an important role in the book not selling out or running low on copies early on (as Superintelligence did, which <a href=\"https://web.archive.org/web/20140903001030/https://www.amazon.com/Superintelligence-Dangers-Strategies-Nick-Bostrom/dp/0199678111\">caused shipping delays</a> on launch day), as reprints can take over a month and the publisher’s original plan was to print as many copies as they do for a typical philosophy book (ie. very few, and possibly even fewer than typical due to <a href=\"https://www.theguardian.com/books/2022/feb/07/publishing-supply-chain-problems-lost-at-sea\">industry-wide supply chain issues</a>). Overall, these purchases constituted a minority of sales.</p>", "parentCommentId": "NRdo48ydiY3Rt4fSR", "user": {"username": "abierohrig"}}, {"_id": "jChazeYJSiFvqeyHY", "postedAt": "2022-08-26T16:24:52.022Z", "postId": "Xhm3vshLdufaDfC5Y", "htmlBody": "<p>Wow! Do we have any data on how much of this is a consequence of EA organisations mass-ordering the book to for instance hand out for free?<br><br>Especially, how much is a consequence of the bulk-buying by organisations that MacAskill is affiliated with, or the orgs funded by them (I'm thinking student groups)?</p>", "parentCommentId": null, "user": {"username": "A.C.Skraeling"}}, {"_id": "2YRYDLrSZKLxrpbB8", "postedAt": "2022-08-26T16:29:30.928Z", "postId": "Xhm3vshLdufaDfC5Y", "htmlBody": "<p>Would it be correct to say that university groups that were quite strongly and repeatedly encouraged to bulk-buy the book by central EA orgs (which MacAskill either works for, is a director of, or serves on the board of)?<br><br>I must say that I am also not convinced by the argument that the only or best way of preventing supply-chain issues is having a book bulk-ordered by affiliated organisations, but this is a weaker-held perspective.</p>", "parentCommentId": "sBHX2tphAXzkGJnn8", "user": {"username": "A.C.Skraeling"}}, {"_id": "rGySxxaQnLaMd6zDN", "postedAt": "2022-08-27T20:41:22.104Z", "postId": "Xhm3vshLdufaDfC5Y", "htmlBody": "<p>Does anyone have an estimate of how many organic book sales (ie not free/promotional/ea campaign organised) there have been so far (or projected)?</p>\n", "parentCommentId": null, "user": {"username": "david_reinstein"}}, {"_id": "usSXAJLdbCbE5cuM8", "postedAt": "2022-08-27T22:41:10.212Z", "postId": "Xhm3vshLdufaDfC5Y", "htmlBody": "<blockquote><p>Overall, these purchases constituted a minority of sales.</p></blockquote><p>By minority do you mean anything less than 50%, or something significantly smaller like 10% or 1%? Your comment seems consistent with either.&nbsp;</p>", "parentCommentId": "sBHX2tphAXzkGJnn8", "user": null}, {"_id": "jfHy2GjCpQaKXvLEQ", "postedAt": "2022-09-13T15:58:45.686Z", "postId": "Xhm3vshLdufaDfC5Y", "htmlBody": "<p>As the EA movement is getting more influential, it has a bigger responsibility to check its assumptions. EA, in its intellectual insularity, could deliver misleading messages, causing accidental harm. One example:</p><p>Many in EA see nature as net negative. The existence of wild animals is assumed as probably net negative because of widespread wild animal suffering (WWOTF page 213), and most assume plants, mushrooms, and bacteria are not really relevant because they would not be sentient and therefore can not suffer.&nbsp;</p><p>The counterintuitive conclusion that nature plausibly is negative might be a sign that the way the movement looks at the world does not reflect the complexity of nature, and it might lead to anthropocentric consequences,&nbsp;both theoretical and practical.</p><p>Could the EA focus on reducing suffering risk flattening the interpretation of life, both human and non-human, into the simplistic pleasure / pain dichotomy?</p><p>What would change, if nature might be plausibly net positive?&nbsp;</p><p>Might human space colonization be less important, if life already exists on other planets?&nbsp;</p><p>Could protecting nature and rewilding be something positive, beyond the services (like carbon storage) nature provides to humans?</p>", "parentCommentId": null, "user": {"username": "Kai S"}}]