[{"_id": "h8j7aEqSd2TtmKTyt", "postedAt": "2017-03-31T19:38:57.184Z", "postId": "XHuBagT6n7yRKobig", "htmlBody": "<blockquote>\n<p>If Clinton had won there would still be a Republican House and Senate</p>\n</blockquote>\n<p><a href=\"https://fivethirtyeight.com/features/there-were-no-purple-states-on-tuesday/\">These two outcomes are correlated</a>, so it's unclear to me how true this statement is.</p>\n<p>-</p>\n<blockquote>\n<p>If Clinton had won, it’s likely Democrats would have to wait until 2028 until they control the Presidency and Congress</p>\n</blockquote>\n<p>I agree that had Clinton won and had the Republicans still won the House and the Senate, it would likely be awhile until the Democrats would control all three, given the strong trend of midterm loss.</p>\n", "parentCommentId": null, "user": {"username": "Peter_Hurford"}}, {"_id": "SE4eoephqeMfMdDTs", "postedAt": "2017-03-31T20:34:26.166Z", "postId": "XHuBagT6n7yRKobig", "htmlBody": "<p>It's probably correlated but it seems easier to imagine the scenario where Clinton got 10,000 more votes in Michigan, and 120,000 in Florida. Rather than winning three seats in the Senate and 20+ in the house (and still be massively behind in state legislature).</p>\n", "parentCommentId": "h8j7aEqSd2TtmKTyt", "user": {"username": "DavidNash"}}, {"_id": "sBJ42cRQuZeBiHhz8", "postedAt": "2017-04-01T13:21:38.857Z", "postId": "XHuBagT6n7yRKobig", "htmlBody": "<p>I agree that the modal outcome of a Trump presidency is that he changes little and the Democrats come out stronger at the end of his presidency than they entered. However, I still think it would have been better that Clinton had won (even if we assume the same congress).</p>\n<p>The most important reason is tail risk. As others have commented, the risk of nuclear war may be greater under Trump than it would have been under Clinton. So far, he seems to be pursuing a more conventional foreign policy than I feared, but I still believe the risk is higher than with Clinton. Additionally, I'm worried that the Trump presidency is increasing the salience of Russian hostility among Democrats and could increase the chance of conflict in the future even when a Democrat takes office.</p>\n<p>Another are of concern is pandemics. Trump has expressed anti-Vaccine sentiments and submitted budgets which cut pandemic preparedness. Furthermore, the overall level of incompetence in his administration and many of his appointees leaves me worried that the response of the US to a major pandemic could be diminished.</p>\n<p>None of the above is likely to happen, but I'd much rather play it safe with a Clinton presidency. Additionally, even the modal outcome of a presidency isn't all good for the liberals. Most notably, he'll almost certainly be able to move at least one conservative into the supreme court and has a high chance of moving at least one more. If Trump replaces a liberal with a conservative on the court, the court will move to the right and it will likely be quite a while until Democrats retake it. With a Clinton presidency, liberals would have been able to achieve a majority on the court that would likely have lasted a long time itself.</p>\n", "parentCommentId": null, "user": {"username": "Michael_S"}}, {"_id": "yZMRiRSea8yfzSiwh", "postedAt": "2017-04-03T19:03:29.256Z", "postId": "XHuBagT6n7yRKobig", "htmlBody": "<p>Thanks for this! </p>\n<p>I personally agree that Democratic control of Congress, or even Congress and the Presidency, would be great. But I'm not sure how likely that is, or how certain that I should be about that likelihood. </p>\n<p>Even if there was a high certainty and high likelihood, I probably still wouldn't take that option - the increased risk for four years is just too high. As Michael_S says you get higher nuclear risk and higher pandemic risk. As I said in my post, I think Trump also raises the risks of increased global instability, increased international authoritarianism, climate change, and emerging technologies. Take climate change - we really don't have long to fix it! We need to make <a href=\"http://www.vox.com/energy-and-environment/2017/3/23/15028480/roadmap-paris-climate-goals\">significant progress by 2030</a> - we can't afford to go backwards for four years.</p>\n<p>[Writing in a personal capacity, my views are not my employer's]</p>\n", "parentCommentId": null, "user": {"username": "HaydnBelfield"}}, {"_id": "7m6aHywbEahZAxqFQ", "postedAt": "2017-04-18T15:48:33.166Z", "postId": "XHuBagT6n7yRKobig", "htmlBody": "<blockquote>\n<p>If you're passionate about politics and in America, than getting involved now seems like a potentially positive action but it wont be neglected if you align with Democrat positions (but potentially easier to get involved if you are Republican).</p>\n</blockquote>\n<p>Why do you believe it's easier to get involved as Republican?</p>\n<p>There are a lot more ways to get involved in state politics than in national policy. </p>\n", "parentCommentId": null, "user": {"username": "ChristianKleineidam"}}, {"_id": "WCQPnW98mBM9sC9vK", "postedAt": "2017-04-20T10:46:25.560Z", "postId": "XHuBagT6n7yRKobig", "htmlBody": "<p>At the moment Democrats are a lot more motivated and have a lot of people volunteering for them. As the Republicans have a majority less people will be getting involved with them as there doesn't seem to be a need to be helped and there'll be less competition for good positions.</p>\n<p>I agree that you can get involved at every level and depending on the state dynamics it may make more sense to get involved or to focus on national or international politics.</p>\n", "parentCommentId": "7m6aHywbEahZAxqFQ", "user": {"username": "DavidNash"}}]