[{"_id": "Q2s8Xb7nbNgwc8T6w", "postedAt": "2022-10-07T23:51:01.864Z", "postId": "XiYh7D9sJsjq324J8", "htmlBody": "<p>I think outreach to Buddhists is an interesting idea! I think many Buddhists would probably agree that the point of practice is to become a better person and thus have more impact on the world. And there are probably some who don't necessarily think about it the same way.&nbsp;<br><br>Buddhists and EAs could probably learn some things from each other yes. This is generally a good attitude to have towards others - curiosity and openness to experimentation.&nbsp;<br><br>I do think it's probably important for some people to dedicate themselves fulltime to practice and teaching as a profession, to keep the teachings and practices alive in a high-fidelity way.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Peter Gebauer"}}, {"_id": "FpfJjYqnJ34AKDEzp", "postedAt": "2022-10-08T01:29:44.951Z", "postId": "XiYh7D9sJsjq324J8", "htmlBody": "<p>There is an essay on <a href=\"https://www.nomos-elibrary.de/10.5771/9783748925361-17/buddhism-and-effective-altruism?page=1\">Buddhism and Effective Altruism</a> by Calvin Baker.</p>", "parentCommentId": null, "user": {"username": "dominicroser"}}, {"_id": "KP59LutHaST2JRhf2", "postedAt": "2022-10-08T08:17:36.670Z", "postId": "XiYh7D9sJsjq324J8", "htmlBody": "<p>Starting an EA Buddhist monastery is something I would donate to, and move to. Granted I can bring a couple of videographers and make it truly fractal</p>", "parentCommentId": null, "user": {"username": "AltruismAgency"}}, {"_id": "HaEWrAvHtR3FdZtdG", "postedAt": "2022-10-08T08:52:28.831Z", "postId": "XiYh7D9sJsjq324J8", "htmlBody": "<p>I have been attending a <a href=\"https://secularbuddhism.com/\">Secular Buddhist</a> &nbsp;group for a couple of years and I have also seen this similarity.</p><p>My main idea about how to link EA and Buddhism is as follows:</p><ol><li>People often become involved in Buddhism for the meditation and mindfulness - to learn about their own minds, change their experience of the world, and have a better life.</li><li>There are a lot of places where having greater impact as an EA is helped by developing positive motivation and different desires, through practicing meditation and mindfulness.&nbsp;<ol><li>Eg. For example, the idea of \"purchasing your fuzzies and utilons separately\" is a good one, but even better is to \"align your fuzzies with the utilons\", where you can learn to feel strongly positive about things that might have been boring or impersonal before.</li></ol></li><li>An \"EA Buddhism\" might focus on changing your mindset first, and the actual impact second. For example, it might be a regular Buddhist meditation group, but at some point when peopl have a question along the lines of \"Where am I aiming?\" the answer can be along the lines of \"to become someone for whom doing efficient altruism is aligned with doing efficient hedonism\"</li><li>Problems:<ol><li>In a buddhist context rather than in the EA context, the answer to \"Where am I aiming?\" is probably hard to explore too deeply, because the people involved won't all be intellectual and/or have good epistemics.</li><li>Also in a secular buddhist context, emphasizing that one do the \"maximum amount\" of altruism is probably not tenable. The meaning of EA here should definitely be \"efficient altruism\" and not \"effective altruism\".</li></ol></li></ol>", "parentCommentId": null, "user": {"username": "maxeonyx"}}, {"_id": "Czkw6KBTchkDafzFy", "postedAt": "2022-10-18T02:52:37.953Z", "postId": "XiYh7D9sJsjq324J8", "htmlBody": "<p>Would love to speak more about it on EARadio sometime :)</p>", "parentCommentId": "Q2s8Xb7nbNgwc8T6w", "user": {"username": "maximizealtruism"}}, {"_id": "vr2TMQmxcLNZwmvzC", "postedAt": "2022-10-21T20:46:52.492Z", "postId": "XiYh7D9sJsjq324J8", "htmlBody": "<p>Messaged you</p>", "parentCommentId": "Czkw6KBTchkDafzFy", "user": {"username": "Peter Gebauer"}}]