[{"_id": "zKKACLEFrf46RoxJd", "postedAt": "2023-12-05T12:12:16.549Z", "postId": "Xj75MiyaLNsfZWBcZ", "htmlBody": "<p>Whoa, thank you so much for this post - the topic of outreach and aligning people's moral intuitions seems incredibly important, as so many of the problems we are facing could be solved quite easily if everyone agreed to genuinely cooperate!</p><p>We do feel that two particular topics might have gotten a bit more attention (or maybe they are in there and we just didn't notice?)</p><ol><li>Maybe you could go a bit more in detail about how we can actually get people to enjoy the stories we write, and what is necessary to make them palatable / reach a wider audience?</li><li>Especially regarding the propaganda accusation (FAQ part, question 2) - maybe also talk about counterfactuals, and how any story that does not transport positive moral values is taking up space from other stories that would do so? (After thinking about this for a bit we feel it is actually quite a harmful action to write a story that gets read a lot, takes up a lot of space, but does not teach valuable lessons...)</li></ol>", "parentCommentId": null, "user": {"username": "Moya Schiller"}}, {"_id": "pjpCYbzWqBNJdKSJD", "postedAt": "2023-12-06T09:43:30.587Z", "postId": "Xj75MiyaLNsfZWBcZ", "htmlBody": "<p>Thank you Moya,<br><br>I think you raise two important questions here.<br><br>1. That seems to be the million-dollar question, doesn't it? How do you write a bestseller, how do you make a blockbuster film? I didn't focus on this aspect in my research, so I could just give you some conventional wisdom here, which I don't think would be very useful. There are a lot of books out there on the subject. You might want to check out books like Stephen King's memoir 'On Writing', which I really enjoyed. An excellent TED talk I recommend is this one: <a href=\"https://www.ted.com/talks/andrew_stanton_the_clues_to_a_great_story?utm_campaign=tedspread&amp;utm_medium=referral&amp;utm_source=tedcomshare\">https://www.ted.com/talks/andrew_stanton_the_clues_to_a_great_story?utm_campaign=tedspread&amp;utm_medium=referral&amp;utm_source=tedcomshare</a>&nbsp;<br><br>2. I also think that bad stories can (if not be harmful) waste people's time and that this can be a missed potential. Some popular stories, in my opinion, are quite superficial and not really valuable. They just seem to push the right buttons and get people hooked, as if they're scrolling through their social media feed. In the end, it's a waste of time and you don't really feel good about it. So there is certainly a lot of room for improvement. But I think it's also important not to go too far in that direction. Trying to optimise everything, including stories, seems unhealthy to me. Stories are more than simulations, they are art and we should keep them free.</p>", "parentCommentId": "zKKACLEFrf46RoxJd", "user": {"username": "Timon Renzelmann"}}, {"_id": "PqgagdAEmH5jGonwB", "postedAt": "2023-12-17T12:07:46.799Z", "postId": "Xj75MiyaLNsfZWBcZ", "htmlBody": "<p>This is great stuff, thank you for writing this up and sharing! Your extrapolations align with what I've learned/discovered over the past few years (but I don't have any scientific evidence to prove them either). It's sad to see such a small amount of upvotes on this post, but I hope you know that this write up is greatly appreciated and valuable for us writers in EA!</p>\n", "parentCommentId": null, "user": {"username": "Jeroen_W"}}, {"_id": "cKCQm4DgCrTL4833m", "postedAt": "2023-12-20T15:27:06.262Z", "postId": "Xj75MiyaLNsfZWBcZ", "htmlBody": "<p>Wow, nice to hear this, thank you Jeroen :)</p>", "parentCommentId": "PqgagdAEmH5jGonwB", "user": {"username": "Timon Renzelmann"}}]