[{"_id": "jNpvbhDa5jYmzM9CE", "postedAt": "2023-01-11T22:50:31.961Z", "postId": "XK8zrpoyPGkEyKDKv", "htmlBody": "<p>Hi Jeff, thanks for another helpful suggestion! (<a href=\"https://forum.effectivealtruism.org/posts/nGQ5BtFtxyP8Tw9d3\">previous one</a>) In this case, I agree there is room for improvement, and we'll aim to update our <a href=\"https://www.givingwhatwecan.org/inclusion-criteria\">inclusion criteria</a>\nthroughout 2023 and to provide more details where we can. The reasons this particular thing isn't in there yet are (1) we simply haven't prioritised writing this out yet, as it  is quite detailed/applies to just one of the four \"cause areas\" we cover and to just one evaluator (FP) and it would require quite a bit of extra context to explain to the broad audience we try to reach (e.g. laying out what we mean by these ratings, what is measured, limitations etc.) which was beyond the scope we were able to set for this giving season (during which we already had a lot of things to update with a small team) (2) this relies on FP's internal ratings and I'm not sure whether FP would want these to be public, e.g. given how rough they are/how much context they need/to avoid over-updating, but I'll leave it to them to respond on that point.</p>\n<p>On SCI specifically, my recollection is that GiveWell's November 2021 analysis is no longer current/that SCI has made significant changes to its programme since that evaluation was done, though I'm not 100% sure. In any case, for the deworming charities more generally we decided to stick closely with our inclusion criteria, which meant not recommending them as top-rated (because they don't clear GW's nor FP's current bar at this moment/they weren't recommended to us by either) and listing until we receive FP's updated estimates. This seemed the better option in particular because we know FP will have updated estimates relatively soon, and IIRC they don't expect all deworming charities to necessarily clear the 3x bar (though again referring to them here for a response, if they are willing to comment before finalizing the evaluation). Hope that clarifies!</p>\n", "parentCommentId": null, "user": {"username": "SjirH"}}, {"_id": "vAxghLcF8dydK4NA2", "postedAt": "2023-01-12T01:36:46.687Z", "postId": "XK8zrpoyPGkEyKDKv", "htmlBody": "<p>Thanks for clarifying!</p>\n<p>If FP does not recommend SCI right now it would be nice if they <a href=\"https://founderspledge.com/stories/deworming-children-report-summary\">noted that</a>; right now they just have \"Please note this page was last updated in 2018. While our overall views remain unchanged, some details may be out of date.\" But that's an issue for FP, not you!</p>\n", "parentCommentId": "jNpvbhDa5jYmzM9CE", "user": {"username": "Jeff_Kaufman"}}, {"_id": "R5jMoEomqwnLuH5ci", "postedAt": "2023-01-16T18:35:54.087Z", "postId": "XK8zrpoyPGkEyKDKv", "htmlBody": "<blockquote>\n<p>GiveWell's November 2021 analysis is no longer current/that SCI has made significant changes to its programme since that evaluation was done</p>\n</blockquote>\n<p>Since you wrote this, GiveWell's January 2023 update is out; they have SCI at <a href=\"https://www.givewell.org/how-we-work/our-criteria/cost-effectiveness/cost-effectiveness-models\">~13.5x cash</a>.</p>\n", "parentCommentId": "jNpvbhDa5jYmzM9CE", "user": {"username": "Jeff_Kaufman"}}, {"_id": "HcT4FFkGNvJPW7Wq7", "postedAt": "2023-01-19T09:28:45.658Z", "postId": "XK8zrpoyPGkEyKDKv", "htmlBody": "<p>Thanks for pointing at this! We'll make sure to ask GW about this at our next point of contact -i.e. whether they think we should recommend SCI/deworming charities given our different bar and their cost-effectiveness analysis - and this may lead us to change the status of these charities.</p>\n", "parentCommentId": "R5jMoEomqwnLuH5ci", "user": {"username": "SjirH"}}, {"_id": "uweKfbqf5HqB4esL3", "postedAt": "2023-08-11T09:47:51.476Z", "postId": "XK8zrpoyPGkEyKDKv", "htmlBody": "<p>For anyone reading this at a later time, we have now <a href=\"https://www.givingwhatwecan.org/donate/organizations\">updated</a> the status of our deworming charities in line with the above discussion and new research by Founders Pledge.</p>\n<p>The changes are as follows:</p>\n<ul>\n<li>Unlimit Health (formerly “SCI”), Sightsavers, DWI → Top-Rated</li>\n<li>The END Fund to remain listed.</li>\n</ul>\n<p>This is based on Founders Pledge’s new research (which is — at least right now — not public) and the ~3x GD bar we’re currently using internally for global health and wellbeing charities (but may update before this Giving Season).</p>\n<p>We’re going with FP’s recommendations here because GiveWell (understandably) have indicated they prefer us not to make charity recommendations based on their direct referral which don't meet their criteria for top charity status (we may continue to link to their research on the deworming charity pages to provide context though), and as this is consistent with our current <a href=\"https://www.givingwhatwecan.org/inclusion-criteria\">inclusion criteria</a> — which again, we may update later this year after completing the first iteration of <a href=\"https://forum.effectivealtruism.org/posts/pp2jmWHyDK9sfC4Rh/evaluating-the-evaluators-gwwc-s-research-direction\">evaluating the evaluators</a>.</p>\n<p>We'd like to thank Jeff again for his helpful suggestion and engagement with this issue.</p>\n", "parentCommentId": null, "user": {"username": "SjirH"}}]