[{"_id": "PmeqsmjJEuHJY52Nd", "postedAt": "2023-11-22T09:43:51.014Z", "postId": "XLSJkvr3ZF7i7CEij", "htmlBody": "<p>Thanks for writing this! You might find this article interesting: <a href=\"https://www.frontiersin.org/articles/10.3389/fpsyg.2023.1127221/full\">The heavy-tailed valence hypothesis: the human capacity for vast variation in pleasure/pain and how to test it </a>(largely based on this EA Forum post: <a href=\"https://forum.effectivealtruism.org/posts/gtGe8WkeFvqucYLAF/logarithmic-scales-of-pleasure-and-pain-rating-ranking-and\">Logarithmic Scales of Pleasure and Pain: Rating, Ranking, and Comparing Peak Experiences Suggest the Existence of Long Tails for Bliss and Suffering</a>).&nbsp;</p>", "parentCommentId": null, "user": {"username": "alfredoparra"}}, {"_id": "QDsZxcDyugxgQF27P", "postedAt": "2023-11-22T12:43:32.988Z", "postId": "XLSJkvr3ZF7i7CEij", "htmlBody": "<p><strong>Executive summary</strong>: The emergence of intense suffering, especially in non-human animals, raises important moral questions about the value of pleasure versus the badness of suffering.</p><p><strong>Key points</strong>:</p><ol><li>Suffering may be stronger and more important than pleasure, based on thought experiments and real-world examples.</li><li>The scale of intense suffering, especially in factory farms and the wild, seems to dwarf human pleasure.</li><li>Moral theories like utilitarianism struggle with intense suffering, which seems non-offsetable and non-comparable.</li><li>Individual compassion and systemic changes are needed to effectively alleviate intense suffering.</li><li>A dialectical mindset helps reconcile massive suffering with motivation for action.</li><li>Practices like mindfulness can build equanimity to accept suffering while still working to reduce it.</li></ol><p>&nbsp;</p><p><i>This comment was auto-generated by the EA Forum Team. Feel free to point out issues with this summary by replying to the comment, and</i><a href=\"https://forum.effectivealtruism.org/contact\"><i>&nbsp;<u>contact us</u></i></a><i> if you have feedback.</i></p>", "parentCommentId": null, "user": {"username": "SummaryBot"}}, {"_id": "LNNywyGMWP9AKK7Lm", "postedAt": "2023-11-22T15:11:51.008Z", "postId": "XLSJkvr3ZF7i7CEij", "htmlBody": "<p>Great TL;DR</p>\n", "parentCommentId": "QDsZxcDyugxgQF27P", "user": {"username": "Kenneth_Diao"}}, {"_id": "nuvix2Nkk3TE3JgjC", "postedAt": "2023-11-28T12:38:52.796Z", "postId": "XLSJkvr3ZF7i7CEij", "htmlBody": "<p>Thanks for the post! There's a lot of deep food for thought in it. I agree it's nice to know that you're not alone in having these kinds of feelings.</p>\n<blockquote>\n<p>reading an article by Brian Tomasik one night[...]. It was the most painful experience of my life.</p>\n</blockquote>\n<p>Sorry about that! Several people have had strong adverse reactions to my discussions of suffering. On the whole I think it's better for people to be exposed to such ideas, although some particular people may be more debilitated than motivated by thinking about extreme suffering.</p>\n<p>I notice a trend for news and Google results to be increasingly censored of violent and gory content. For example, in 2021 there was a news story about Darrell E. Brooks Jr. driving an SUV into a crowd of people, and the footage of the incident -- shown from far away -- was blurred and had no audio. Viewers couldn't really see what happened at all. Such censorship is plausibly good for viewers' mental health, and it's very likely good for advertisers' brand safety. But it's plausibly bad for the victims of violence if it reduces motivation to address their suffering.</p>\n<blockquote>\n<p>\"Darkness cannot drive out darkness: only light can do that. Hate cannot drive out hate: only love can do that.\"</p>\n</blockquote>\n<p>That's a great quote. It's applicable to so many misguided and harmful actions in the world today, from Israel's flattening of entire neighborhoods in Gaza to the vitriolic rhetoric used by some parts of the SJW community. I suspect the world would be more peaceful and advocates would be more effective if they embraced King's \"love your enemies\" approach more on the margin. That said, there are <em>some</em> cases where darkness and hate lead to love or at least a reduction in hate:</p>\n<ul>\n<li>Stockholm syndrome, abusive relationships, loyalty to oppressive dictators, worship of gods who threaten hell, etc. The general phenomenon is that a powerful alpha male is asserting supremacy by ruthlessness, and in that case, it may be more adaptive for primate brains to accept defeat and love Big Brother rather than continuing to fight him.</li>\n<li>If censorship is severe enough, it may be possible to reduce the exposure of future generations to certain hateful ideas. Also, if you murder enough of your enemies that their population becomes small, you can decrease the number of them who remain to hate you.</li>\n</ul>\n", "parentCommentId": null, "user": {"username": "Brian_Tomasik"}}, {"_id": "2WxqgvJsfxmLsYR7p", "postedAt": "2023-11-29T16:34:04.495Z", "postId": "XLSJkvr3ZF7i7CEij", "htmlBody": "<p>Hi Alfredo, thanks for reading and suggesting those articles! I've skimmed the logarithmic scales article and for sure find that terrifying and depressing. All the more reason to lighten that heavy tail!</p>", "parentCommentId": "PmeqsmjJEuHJY52Nd", "user": {"username": "Kenneth_Diao"}}, {"_id": "KAxsNS9cFiyYCeSEM", "postedAt": "2023-11-29T16:58:36.770Z", "postId": "XLSJkvr3ZF7i7CEij", "htmlBody": "<p>Hi Brian,</p><p>I'm honored that you read my article and thought it was valuable!</p><p>For the record, I also think that it's good to know the truth. Maybe I wish it wasn't necessary for us to know about these things, but I think it is necessary, and I very much prefer knowing about something and thus being able to act in accordance to that knowledge than not knowing about it. So yeah, don't let my adverse reaction fool you; I love your work and admire you as a person.</p><p>Regarding love and hatred, the points you brought up do make me think. I try to always keep an evolutionary perspective in mind; that is, I tend to assume something is adaptive, especially if it's survived across big time. So I think that, at least in certain environments, things like the dark tetrad traits (narcissism, machiavellianism, psychopathy, sadism) are adaptive even on a group level; maybe they reach some kind of local maximum of adaptiveness. My hope is that there is a better way to retain the adaptive behavioral manifestations of these traits while avoiding the volatile and maladaptive aspects of these traits, and my belief is that we can approach this by having more correct motivations. Like I really idealise the approaches of people like Gandhi and MLK who recognised the wrongness of the status quo while also trying to create positive change with love and peace; I believe we need more of that. That being said, I take your point that darkness and hate can lead to love/reduction in hatred, and that this may always be true, especially in our non-ideal world.</p>", "parentCommentId": "nuvix2Nkk3TE3JgjC", "user": {"username": "Kenneth_Diao"}}, {"_id": "PemMip5tmPFn8u5u5", "postedAt": "2023-11-29T20:41:04.523Z", "postId": "XLSJkvr3ZF7i7CEij", "htmlBody": "<p>Thanks for the kind words. :)</p>\n<blockquote>\n<p>things like the dark tetrad traits (narcissism, machiavellianism, psychopathy, sadism) are adaptive even on a group level</p>\n</blockquote>\n<p>Yup. And how adaptive they are depends on the distribution of other agent types. For example, against a population of pure pacifists, Dark Tetrad traits may be pretty effective. In a population of agents who cooperate with one another but punish rule-breakers, Dark Tetrad traits are probably less adaptive. Hopefully present-day society is somewhat close to the latter case, although human reproduction isn't very constrained by material resources in the developed world, so I'm unsure how much society punishing some Dark Tetrad people affects their reproductive fitness. Also, some narcissists \"succeed\" greatly in our society (Donald Trump, Elon Musk, and too many others to list).</p>\n<blockquote>\n<p>I take your point that darkness and hate can lead to love/reduction in hatred</p>\n</blockquote>\n<p>I mainly mentioned those points in case someone would quibble with the absoluteness of King's quote. As they say, \"all generalizations are false\". In our present world, where we generally don't kill or tyrannize everyone who disagrees with us, I think it's generally more effective to move more in King's direction than our primate instincts incline us to. If you can't massacre your enemies, you have to find a way to make peace with them.</p>\n", "parentCommentId": "KAxsNS9cFiyYCeSEM", "user": {"username": "Brian_Tomasik"}}]