[{"_id": "RNQEXwR6oomb3jnvb", "postedAt": "2023-08-10T19:24:53.485Z", "postId": "XmDGoEMAy9PH4Wk9z", "htmlBody": "<p>I have a framing that you might find interesting:</p>\n<p>I guess if I was trying to make an argument that we should be worried with minimal assumptions, I’d argue as follows:</p>\n<ul>\n<li>AI will lead to the creation of dangerous capacities</li>\n<li>The only possible defence against AI systems will be other AI systems acting with a substantial degree of autonomy. If these systems malfunction or turn against us we will be screwed.</li>\n<li>AI arms races will force us to deploy these systems fast and without proper testing. This probably results in us being screwed.</li>\n<li>Any given alignment technique is likely to break under a sufficient amount of optimisation pressure. Since we won’t have much time to develop new techniques on the fly, we are likely screwed again if we haven’t developed techniques for aligning powerful systems ahead of time.</li>\n</ul>\n", "parentCommentId": null, "user": {"username": "casebash"}}, {"_id": "wsrJt4GPz5rXmdPfZ", "postedAt": "2023-08-11T18:43:18.094Z", "postId": "XmDGoEMAy9PH4Wk9z", "htmlBody": "<p>I think that by far the less intuitive thing about AI X-risk is why AIs would want to kill us instead of doing what they would be \"programmed\" to do.</p><p>I would give more importance to that part of the argument than the \"intelligence is really powerful\" part.</p>", "parentCommentId": null, "user": {"username": "Patricio"}}, {"_id": "fPQyaWCpSzkECwwnZ", "postedAt": "2023-08-12T08:56:02.357Z", "postId": "XmDGoEMAy9PH4Wk9z", "htmlBody": "<p>Noted. &nbsp;I find many are stuck on the 'how'. &nbsp; &nbsp;That said, some polls have 2/3rds or 3/4ths of people consider AI might harm humanity, so it isn't entirely clear who needs to hear which arguments/analysis.&nbsp;</p>", "parentCommentId": "wsrJt4GPz5rXmdPfZ", "user": {"username": "Darren McKee"}}, {"_id": "TWwqfDZ5YF2HCrmAo", "postedAt": "2023-08-12T08:57:12.180Z", "postId": "XmDGoEMAy9PH4Wk9z", "htmlBody": "<p>Thank you.&nbsp;<br>I quite like the \"we don't have a lot of time\" part, both in the fact that we'd need to prepare in advance, and because making decisions under time pressure is almost always worse.&nbsp;</p>", "parentCommentId": "RNQEXwR6oomb3jnvb", "user": {"username": "Darren McKee"}}]