[{"_id": "kmfTP4aduMrAeFEs5", "postedAt": "2023-01-13T18:55:02.725Z", "postId": "XMKDvbjxtZCz3rueM", "htmlBody": "<p>Phil runs a tremendous program and I would definitely recommend that you apply!</p>", "parentCommentId": null, "user": {"username": "David Thorstad"}}, {"_id": "8zNucgokpHA7a8QaF", "postedAt": "2023-01-13T20:40:55.246Z", "postId": "XMKDvbjxtZCz3rueM", "htmlBody": "<p>I participated in this last year, and it was wonderful. Like all in-person conferences/retreats, a ton of the value comes from meeting and hanging out with people doing work that’s relevant to your own, so this would be especially valuable if you’re not already plugged into the EA economics or research community. I would highly recommend it for anyone doing or strongly considering an econ PhD.</p>\n", "parentCommentId": null, "user": {"username": "jmsanders"}}, {"_id": "3y4HrfQ9myFnTHLPa", "postedAt": "2023-01-13T21:59:22.760Z", "postId": "XMKDvbjxtZCz3rueM", "htmlBody": "<p>An additional data point:<br>I was working out of Trajan (as a non-attendee) when the 2022 course happened and met a significant portion of the course participants - they were a great group of people, and everyone I spoke to about this seemed to have a very positive experience and had great things to say about it, in ways that (like Phil mentioned), aren't well captured by the survey results linked above.</p><p>I feel pretty optimistic about Phil's <a href=\"https://forum.effectivealtruism.org/posts/L3WPuztkSMohBTWqZ/etgp-2022-materials-feedback-and-lessons-for-2023#Takeaways_and_tweaks_for_2023\">suggested tweaks </a>based on feedback, and would strongly encourage folks from diverse backgrounds to err on the side of applying, and for people who are considering applying or know people who this course would be relevant for to also share it with a wide range of prospective participants, as this forum may favour a particular demographic.</p><p>I don't want to set unreasonable expectations for prospective participants, and I don't want to make recommendations, as someone with no formal econ background, but from an observer's perspective, this course seemed very well-run and well-received; Phil clearly puts a lot of effort into this course. His <a href=\"https://forum.effectivealtruism.org/posts/L3WPuztkSMohBTWqZ/etgp-2022-materials-feedback-and-lessons-for-2023\">summary post </a>may be of interest for those on the fence.</p>", "parentCommentId": null, "user": {"username": "bruce"}}, {"_id": "7ubWPGza2ZqnaYb5x", "postedAt": "2023-01-14T01:30:15.598Z", "postId": "XMKDvbjxtZCz3rueM", "htmlBody": "<p>I was a participant last year, and I cannot recommend this course highly enough for econ students interested in global priorities research. Phil is in all likelihood the best person in the world to run this, as he is extremely knowledgeable about the topic, and clearly cared a lot about making the experience as useful as possible for the participants.&nbsp;</p><p>It was also great to meet so many people interested in EA and in economics who are are similar stages in their career, and I had a fun time in Oxford. It is an amazing opportunity and I highly encourage anyone interested to apply.</p>", "parentCommentId": null, "user": {"username": "Maxime"}}, {"_id": "tnAN2Hu3hEKEmJAgH", "postedAt": "2023-01-14T16:28:25.852Z", "postId": "XMKDvbjxtZCz3rueM", "htmlBody": "<p>Adding some thoughts regarding diversity, privilege, and inclusiveness, as someone who was on the fence about applying and going last year and also about interacting with the global priorities community in general.<br><br>Like others said, I attended and loved this course last year. I think the value in this course is <i>higher</i> if you're from an underprivileged background or if you're a \"big fish in a small pond\" at a solid but non-elite university.</p><p>Mainly, it's because you'll get to hang out with other strong students across &nbsp;a range of contexts. You attend rigorous lectures, solve problem sets, and socialize with them. Last year, this included talking to PhD students at top universities. Particularly for potential PhD applicants, it's a <strong>very</strong> good way to test your fit and seeing what your weaknesses / strengths are relative to other people. And for me, it was a good way to remove some of the idolization I had of other people.</p><p>For some, this means realizing their initial career path is arduous but interesting and ultimately doable. For others, this means realizing \"Oh wow this is too much and not that useful to me. I need to rethink my career path.\" Both are useful updates.<br><br>Also, as a general vibe, I found that GPI as a whole talks about diversity, equity and inclusiveness in a very thought out and genuine way. This doesn't entirely offset the very privileged demographics that econ + philosophy pulls from, but I think it should nudge people &nbsp;towards applying if on-the-fence.</p>", "parentCommentId": null, "user": {"username": "geoffreyyip"}}, {"_id": "o3oa8E7qvpgB5nXxD", "postedAt": "2023-01-16T12:05:08.554Z", "postId": "XMKDvbjxtZCz3rueM", "htmlBody": "<p>Thanks David!</p>", "parentCommentId": "kmfTP4aduMrAeFEs5", "user": {"username": "trammell"}}, {"_id": "37JbHwh9thsRfjX2Z", "postedAt": "2023-01-16T12:06:06.116Z", "postId": "XMKDvbjxtZCz3rueM", "htmlBody": "<p>Thanks James, really glad to hear you feel you got a lot out of it (including after a few months' reflection)!</p>", "parentCommentId": "8zNucgokpHA7a8QaF", "user": {"username": "trammell"}}, {"_id": "vhAQKbzyZGKjrzEdv", "postedAt": "2023-01-16T12:06:46.059Z", "postId": "XMKDvbjxtZCz3rueM", "htmlBody": "<p>Thanks Bruce! Definitely agreed that it was an amazing crowd : )</p>", "parentCommentId": "3y4HrfQ9myFnTHLPa", "user": {"username": "trammell"}}, {"_id": "FKEz2joeAmQ3ibNBJ", "postedAt": "2023-01-16T12:07:38.834Z", "postId": "XMKDvbjxtZCz3rueM", "htmlBody": "<p>Wow, thank you so much, Maxime!</p>", "parentCommentId": "7ubWPGza2ZqnaYb5x", "user": {"username": "trammell"}}, {"_id": "agp6uHZzPrzeyjiKL", "postedAt": "2023-01-16T12:12:03.983Z", "postId": "XMKDvbjxtZCz3rueM", "htmlBody": "<p>Hey, really glad you liked it so much! And thank you for emphasizing that people should consider applying even if they worry they might not fit in--I think this content should be interesting and useful to lots of people outside the small bubbles we're currently drawing from.</p>", "parentCommentId": "tnAN2Hu3hEKEmJAgH", "user": {"username": "trammell"}}, {"_id": "Hzy7d3NmXkDGkg5DH", "postedAt": "2023-01-19T21:51:31.179Z", "postId": "XMKDvbjxtZCz3rueM", "htmlBody": "<p>I participated in this last year,  halfway through doing a predoc and right before applying to econ grad schools.</p>\n<p>I really enjoyed the chance to meet a bunch of other kind, smart EAs. It also gave me a chance to learn about tons of areas of research that I wouldn't have otherwise.</p>\n<p>We covered a lot of cutting-edge research ideas in GPR, which Phil did a great job of. Several of these were Phil's own work, and it was fascinating to see how Phil thought of these ideas. There were also a lot of guest speakers, who often authored studies in areas we were learning about that.</p>\n<p>Phil was a great teacher of the basics, too! I went back to my ETGP notes when taking a graduate micro theory this semester.  Phil also clearly spent a lot of time making the problem sets. They were a really helpful way to learn both the basics and the more specialized knowledge Phil taught.</p>\n<p>I can't recommend this course enough for someone early in a research career, or considering doing a PhD in economics!</p>\n", "parentCommentId": null, "user": {"username": "johl@umich.edu"}}, {"_id": "qZJerwpm28CbPjBhT", "postedAt": "2023-01-20T17:06:53.601Z", "postId": "XMKDvbjxtZCz3rueM", "htmlBody": "<p>Awesome, good to hear on all counts!</p>", "parentCommentId": "Hzy7d3NmXkDGkg5DH", "user": {"username": "trammell"}}]