[{"_id": "YG9eKSnk9KuDeQGZR", "postedAt": "2022-09-18T14:49:28.594Z", "postId": "XmKhYQfnfqb3Z7Dkr", "htmlBody": "<p>Hi John! You might be interested in my Law-Following AI Sequence, where I've explored very similar ideas: <a href=\"https://forum.effectivealtruism.org/s/3pyRzRQmcJNvHzf6J\">https://forum.effectivealtruism.org/s/3pyRzRQmcJNvHzf6J</a></p>\n<p>I'm glad we've seemed to converge on similar ideas. I would love to chat sometime!</p>\n", "parentCommentId": null, "user": {"username": "Cullen_OKeefe"}}, {"_id": "Rr8gyGdgFjoEPBsKk", "postedAt": "2022-09-18T15:16:00.636Z", "postId": "XmKhYQfnfqb3Z7Dkr", "htmlBody": "<p>That's awesome - thank you for sharing!</p><p>&nbsp;</p><p>Would love to chat as well.</p>", "parentCommentId": "YG9eKSnk9KuDeQGZR", "user": {"username": "johnjnay"}}, {"_id": "FRh7kcYsKdjKfu7cE", "postedAt": "2022-09-19T00:48:59.377Z", "postId": "XmKhYQfnfqb3Z7Dkr", "htmlBody": "<p>Hi John, thanks for this post. I think it's a fascinating and fruitful idea.&nbsp;</p><p>My main concern would be that almost every mind that's been writing, debating, legislating, interpreting, and applying law, so far, has been a human mind, full of a vast amount of 'common sense', background, cultural context, and world-knowledge that might need to built into an AI system, for the system to really be able to use law as a crystallization of human values.&nbsp;</p><p>My hunch is that that we'll be surprised at how much of that background knowledge will be necessary for law to be very useful in alignment. But, I think it's well worth pursuing, with that caveat in mind! Also, law tends to track situations where humans have conflicts of interest with each other, and it might not track universal values that are so obvious to everyone that conflicts of interest hardly ever arise.</p><p>I have a second concern that in many cultures, codified law might embody a lot of values that people in other cultures might find objectionable. For example an AI system that's fully aligned with Muslim Sharia law might embody values that don't fit very well with secular Western law. Or, Americans might not like Chinese law very much, or vice versa.</p><p>Maybe we can try to find some cross-cultural universals in legal systems that exemplify some common ground for human values. That might be easier in some domains of law (e.g. contract law, property law, commercial law) than in other domains of law (e.g. sexual conduct, marriage law, family law, religious law).</p>", "parentCommentId": null, "user": {"username": "geoffreymiller"}}, {"_id": "67YLpsdHYktMQNCXt", "postedAt": "2022-09-19T00:58:32.492Z", "postId": "XmKhYQfnfqb3Z7Dkr", "htmlBody": "<p>Presumably you're aware of various Dylan Hadfield-Menell papers, e.g. <a href=\"https://dl.acm.org/doi/10.1145/3514094.3534130\">https://dl.acm.org/doi/10.1145/3514094.3534130</a> , <a href=\"https://dl.acm.org/doi/10.1145/3306618.3314258\">https://dl.acm.org/doi/10.1145/3306618.3314258</a> , &nbsp;<a href=\"https://dl.acm.org/doi/10.1145/3514094.3534130\">https://dl.acm.org/doi/10.1145/3514094.3534130</a>&nbsp;</p><p>And of course Xuan's talk ( <a href=\"https://www.lesswrong.com/posts/Cty2rSMut483QgBQ2/what-should-ai-owe-to-us-accountable-and-aligned-ai-systems\">https://www.lesswrong.com/posts/Cty2rSMut483QgBQ2/what-should-ai-owe-to-us-accountable-and-aligned-ai-systems</a> )</p><p>But, to be perfectly honest... I think there's part of this proposal that has merit, and part of this proposal that might sound good to many people but is actually bad.</p><p>First, the bad: The notion that \"Law is a computational engine that converts human values into legible directives\" is wrong. Legibility is not an inherent property of the directives. It is a property of the directives <i>with respect to &nbsp;the one interpreting them</i>, which in the case of law is humans. If you build an AI that doesn't try to follow the spirit of the law in a human-recognizable way, the law will not be legible in the way you want.</p><p>The notion that it would be good to build AI that humans direct by the same process that we currently create laws is wrong. Such a process works <i>for laws</i>, specifically <i>for laws for humans</i>, but the process is tailored to the way we currently apply it in many ways large and small, and has numerous flaws even for that purpose (as you mention, about expressions of power).</p><p>Then, the good: Law offers a lot of training data that directly bears on what what humans value, what vague statements of standards mean in practice, and what humans think good reasoning looks like. The \"legible\" law can't be used directly, but it can be used as a yardstick against which to learn the illegible spirit of the law. This research direction does not look like a Bold New Way to do AI alignment, instead it looks like a Somewhat Bold New Way to <i>apply</i> AI alignment work that is fully contiguous with other alignment research (e.g. attempts to learn human preferences by actively asking humans).</p>", "parentCommentId": null, "user": {"username": "Charlie Steiner"}}, {"_id": "LTxKt2BtDMvh8MmpS", "postedAt": "2022-09-19T10:38:01.806Z", "postId": "XmKhYQfnfqb3Z7Dkr", "htmlBody": "<p>Hi Charlie, thank you for your comment.</p><p>I &nbsp;cite many of Dylan's papers in the longer form version of this post: <a href=\"https://papers.ssrn.com/sol3/papers.cfm?abstract_id=4218031.\">https://papers.ssrn.com/sol3/papers.cfm?abstract_id=4218031</a></p><p>I will check out Xuan's talk. Thanks for sharing that.</p><p>Instead of:</p><blockquote><p>Law is a computational engine that converts human values into legible directives.</p></blockquote><p>I could expand the statement to cover the larger project of what we are working on:</p><blockquote><p>Law <i>and legal interpretation</i> form a computational engine that converts human values into legible directives.</p></blockquote><p>One of the primary goals of this research agenda is to teach AI to follow the spirit of the law in a human-recognizable way. This entails leveraging existing human capabilities for the \"law-making\" / \"contract-drafting\" part (how do &nbsp;we use &nbsp;the theory and practice of law about how to tell agents what to do?), and conducting research on building AI capabilities for the interpretation part (how do our machine learning processes use data and processes from the theory and practice of law about how agents interpret those directives / contracts?).&nbsp;</p><p>Reinforcement learning with human attorney feedback (there are more than 1.3 million lawyers in the US) via natural language interactions with AI models is potentially a powerful process to teach (through training, or fine-tuning, or extraction of templates for in-context prompting of large language models) statutory interpretation, argumentation, and case-based reasoning, which can then be applied more broadly for AI alignment. Models could be trained to assist human attorney evaluators, which theoretically, in partnership with the humans, could allow the combined human-AI evaluation team to have capabilities that surpass the legal understanding of the expert humans alone.&nbsp;</p><p>The Foundation Models in use today, e.g., GPT-3, have, effectively, conducted a form of behavioral cloning on a large portion of the Internet to leverage billions of human actions (through natural language expressions). It may be possible to, similarly, leverage billions of human legal data points to build Law Foundation Models through large-scale language model self-supervision on pre-processed legal text data.&nbsp;</p><p>Aspects of legal standards, and the \"spirit\" of the law, can be learned directly from legal data. &nbsp;We could also codify examples of human and corporate behavior exhibiting standards such as fiduciary duty into a structured format to evaluate the standards-understanding capabilities of AI models. &nbsp;The legal data available for AI systems to learn from, or be evaluated on, includes textual data from all types of law (constitutional, statutory, administrative, case, and contractual), &nbsp;legal training tools (e.g., bar exam outlines, casebooks, and software for teaching the casuistic approach), rule-based legal reasoning programs, &nbsp;and human-in-the-loop live feedback from law and policy human experts. &nbsp;The latter two could simulate state-action-reward spaces for AI fine-tuning or validation, and the former could be processed to do so.</p><p>Automated data curation processes to convert textual legal data into either state-action-reward tuples, or contextual constraints for shaping candidate action choices conditional on the state, is an important frontier in this research agenda (and promising for application to case law text data, contracts, and legal training materials). General AI capabilities research has recently found that learning from textual descriptions, rather than direct instruction, may allow models to learn reward functions that better generalize. Fortunately, much of law is embedded more in the form of descriptions and standards than it is in the form of direct instructions and specific rules. Descriptions of the application of standards provides a rich and large surface area to learn from.</p><p>Textual data can be curated and labeled for these purposes. We will aim for two outcomes with this labeling. First, data that can be used to evaluate how well AI models understand legal standards. Second, the possibility that the initial “gold-standard” human expert labeled data can be used to generate additional much larger sets of data through automated curation and processing of full corpora of legal text, and through model interaction with human feedback.</p><p>I think your statement:</p><blockquote><p>\"This research direction does not look like a Bold New Way to do AI alignment, instead it looks like a Somewhat Bold New Way to <i>apply</i> AI alignment work that is fully contiguous with other alignment research\"&nbsp;</p></blockquote><p>is spot on. That is how I was thinking about it, but I should have made that more clear; perhaps I should work on a follow-up post at some point that explicitly explores the intersections of <i>Law Informs Code </i>with other strands of alignment research. Some of this is in <a href=\"https://papers.ssrn.com/sol3/papers.cfm?abstract_id=4218031\">the longer form version of this post</a>, but with this inspiration from you, I may try to go further in that direction (although I am already beyond the length the Journal editors want!).</p>", "parentCommentId": "67YLpsdHYktMQNCXt", "user": {"username": "johnjnay"}}, {"_id": "MwtzNFLMmRyudAFip", "postedAt": "2022-09-19T11:10:48.527Z", "postId": "XmKhYQfnfqb3Z7Dkr", "htmlBody": "<p>Hi Geoffrey, thank you for this feedback.</p><p>On your background knowledge comment, I agree that is an important open question (for this proposal, and other alignment techniques).</p><p>Related to that, I have been thinking through the systematic selection of which data sets are best suited for self-supervised pre-training of large language models - an active area of research in AI capabilities and Foundation Models more generally, which may be even more important for this application to legal data. For self-supervision on legal data, we could use (at least) two filters to guide data selection and data structuring processes.&nbsp;</p><p>First, <i>is the goal of training on a data point to embed world knowledge into AI, or legal task knowledge</i>? Learning that humans in the U.S. drive on the right side of the road is learning world knowledge; whereas, learning how to map a statute about driving rules to a new fact pattern in the real world is learning how to conduct a legal reasoning task. World knowledge can be learned from legal and non-legal corpora. Legal task knowledge can primarily be learned from legal data.</p><p>Second, <i>is the approximate nature of the uncertainty &nbsp;that an AI could theoretically resolve by training on a data point epistemic or aleatory </i>? If the nature of the uncertainty is epistemic – e.g., whether citizens prefer climate change risk reduction over endangered species protection – then it is fruitful to apply as much data as we can to learning functions to closer approximate the underlying fact about the world or about law. If the nature of the uncertainty is more of an aleatory flavor – e.g., the middle name of the defendant in a case – then there is enough inherent randomness that we would seek to avoid attempting to learn anything about that fact or data point.&nbsp;</p><p>There are many other aspects of &nbsp;self-supervised pre-training data curation that we will need to explore, but figured I'd share a couple that are top of mind in the context of your world knowledge comment.</p><p>Public law informs AI more through negative than positive directives; and therefore it’s unclear the extent to which policy – outside of the human-AI “contract and standards” type of alignment we are working on – can inform which goals AI should proactively pursue to improve the world on society’s behalf. &nbsp;I agree with your comment that, \"law tends to track situations where humans have conflicts of interest with each other, and it might not track universal values that are so obvious to everyone that conflicts of interest hardly ever arise.\" This is a great illustration of the need to complement the <i>Law Informs Code</i> approach with other approaches to specifying human values. But I believe there are challenges with using the \"AI Ethics\" approach as the core framework, see section <i>IV. PUBLIC LAW: SOCIETY-AI ALIGNMENT </i>of the longer form version of this post, <a href=\"https://papers.ssrn.com/sol3/papers.cfm?abstract_id=4218031\">https://papers.ssrn.com/sol3/papers.cfm?abstract_id=4218031</a> . I think a blend of the frameworks could most fruitful.</p><p>Finally, it would be very interesting to conduct research on the possibility of \"cross-cultural universals in legal systems that exemplify some common ground for human values,\" and which domains of law have the most cultural overlap. There are many exciting threads to pursue here!</p>", "parentCommentId": "FRh7kcYsKdjKfu7cE", "user": {"username": "johnjnay"}}, {"_id": "vL96mjLRvyz8naAXK", "postedAt": "2022-09-19T23:07:25.865Z", "postId": "XmKhYQfnfqb3Z7Dkr", "htmlBody": "<p>Thanks for your thorough response, and yeah, I'm broadly on board with all that. I think learning from detailed text behind decisions, not just the single-bit decision itself, is a great idea that can leverage a lot of recent work.</p><p>I don't think that using modern ML to create a model of legal text is <i>directly </i>promising from an alignment standpoint, but by holding out some of your dataset (e.g. a random sample, or all decisions about a specific topic, or all decisions later than 2021), you can test the generalization properties of the model, and more importantly test interventions intended to improve those properties.</p><p>I don't think we have that great a grasp right now on how to use human feedback to get models to generalize to situations the humans themselves can't navigate. This is actually a good situation for <a href=\"https://www.alignmentforum.org/posts/PZtsoaoSLpKjjbMqM/the-case-for-aligning-narrowly-superhuman-models\">sandwiching</a>: suppose most text about a specific topic (e.g. use of a specific technology) is held back from the training set, and the model starts out bad at predicting that text. Could we leverage human feedback <i>from non-experts</i> in those cases (potentially even humans who start out basically ignorant about the topic) to help the model generalize better than those humans could alone? This is an intermediate goal that it would be great to advance towards.</p>", "parentCommentId": "LTxKt2BtDMvh8MmpS", "user": {"username": "Charlie Steiner"}}, {"_id": "gkXyHoF59MP76Fdfv", "postedAt": "2022-09-20T14:38:46.974Z", "postId": "XmKhYQfnfqb3Z7Dkr", "htmlBody": "<p>Interesting. I will think more about the sandwiching approach between non-legal experts and legal experts.</p>", "parentCommentId": "vL96mjLRvyz8naAXK", "user": {"username": "johnjnay"}}, {"_id": "d8jxqXt7aYSxS8wFQ", "postedAt": "2022-09-21T19:31:40.081Z", "postId": "XmKhYQfnfqb3Z7Dkr", "htmlBody": "<p>Thanks for this reply; it all makes sense.</p><p>Regarding cross-cultural universals, I think there's some empirical research on cross-cultural universals in which kinds of violent or non-violent crime are considered worst, most harmful, and most deserving of punishment. I couldn't find a great reference for that in a cursory lit search, but there is related work on the evolutionary psychology of crime and criminal law that might be useful, e.g. work by Owen Jones: <a href=\"https://onlinelibrary.wiley.com/doi/abs/10.1002/9780470939376.ch34\">https://onlinelibrary.wiley.com/doi/abs/10.1002/9780470939376.ch34</a></p><p>Also David Buss (UT Austin) has written a lot about violent crime, esp. murder, e.g. <a href=\"https://labs.la.utexas.edu/buss/files/2015/09/Evolutionary-psychology-and-crime.pdf\">https://labs.la.utexas.edu/buss/files/2015/09/Evolutionary-psychology-and-crime.pdf</a></p>", "parentCommentId": "MwtzNFLMmRyudAFip", "user": {"username": "geoffreymiller"}}, {"_id": "eXr8zFEW8GiXzJcpv", "postedAt": "2022-09-21T20:04:37.529Z", "postId": "XmKhYQfnfqb3Z7Dkr", "htmlBody": "<p>Thanks!</p>", "parentCommentId": "d8jxqXt7aYSxS8wFQ", "user": {"username": "johnjnay"}}, {"_id": "88tejGRWj85DLvQaj", "postedAt": "2022-09-26T17:55:48.664Z", "postId": "XmKhYQfnfqb3Z7Dkr", "htmlBody": "<p>This was cross-posted here as well:&nbsp;</p><ul><li><a href=\"https://law.stanford.edu/2022/09/25/aligning-ai-with-humans-by-leveraging-law-as-data/\">https://law.stanford.edu/2022/09/25/aligning-ai-with-humans-by-leveraging-law-as-data/</a></li><li><a href=\"https://www.lesswrong.com/posts/9xR4KExLQKNK4iggc/leveraging-legal-informatics-to-align-ai\">https://www.lesswrong.com/posts/9xR4KExLQKNK4iggc/leveraging-legal-informatics-to-align-ai</a>&nbsp;</li></ul><p>A follow-up thought based on conversations catalyzed by this post:</p><p>Much of the research on governing AI and managing its potential unintended consequences currently falls into two ends of a spectrum related to assumptions of the imminence of transformative AGI. Research operating under the assumption of a <i>high probability</i> of near-term transformative AI (e.g., within 10-15 years) is typically focused more on how to align AGI with ideal aggregations of human preferences (through yet to be tested aggregation processes). Research operating under the assumption of a <i>low probability</i> of near-term transformative AI is typically focused on how to reduce discriminatory, safety, and privacy harms posed by present-day (relatively \"dumb\") AI systems. The proposal in this post seeks a framework that, over time, bridges these two important ends of the AI safety spectrum.&nbsp;</p>", "parentCommentId": null, "user": {"username": "johnjnay"}}]