[{"_id": "iEDGbc7WpDcAznc4L", "postedAt": "2023-02-27T16:57:23.806Z", "postId": "XpeamS2yTNhagxAip", "htmlBody": "<p>Hi, thanks for writing this, I thought this was great. I agree with the limitations section.</p><p>Some nitpicks:</p><p>- Can you say a bit more about how you adjust for counterfactual impact? 5km is like an hour of walking? Are you halving this?<br>- Out of curiosity, how difficult would it be to subsidize transport instead?</p>", "parentCommentId": null, "user": {"username": "NunoSempere"}}, {"_id": "LLurihm7CWSsHa4Ha", "postedAt": "2023-02-27T17:38:01.132Z", "postId": "XpeamS2yTNhagxAip", "htmlBody": "<p>In addition to finding ODH's cost-effectiveness analysis very promising, one thing I like about its value proposition is how concrete it is to non-EAs. It may be even more legible than GiveDirectly, because the good of \"treating kids and others for malaria and other stuff\" is perhaps even more obvious than \"giving money to poor people\" (the effectiveness of which requires at least some additional context to show that the recipients spend money in ways that substantially furthers their long-term welfare).</p><p>I think talking about organizations like ODH can be a great introduction to charity effectiveness for a broad non-EA audience, in certain &nbsp;low-bandwidth environments, or with certain people. You have identifiable beneficiaries with a very high probability of benefitting from the intervention (and even stories on ODH's website), so you don't have to get your audience to become comfortable with the idea of more abstract benefits right away. You can offer very concrete examples of what the donor's money does -- e.g., $1.11 subsidizes the treatment of three patients who would have otherwise not received treatment or would have had to spend substantially more to receive treatment at a distant facility, $87.50 subsidizes the operating costs of a health center for a whole month, etc.&nbsp;</p><p>I think getting a donor to rigorously consider effectiveness for the first time is a major win, and I like the idea of having options like ODH that make that as psychologically easy for the donor as possible. I suggest the feedback loop between cognition and action is more two-way than our theories of change sometimes recognize, and so having options that make it easy for donors to make a first effective donation is important.</p><p>In the interests of full disclosure, I not only offered &nbsp;comments on Nick's post but also made a donation to OneDay Health US last month to stand up a new health center. In addition to concluding that the case for cost-effectiveness was good, I felt that both the EA and non-EA ecosystems don't have a lot of good funders for most micro-sized global health non-profits. And I thought I had a few comparative advantages to evaluating the case for a nanogrant here.</p>", "parentCommentId": null, "user": {"username": "Jason"}}, {"_id": "KFqjgjcKq2jXBd9yh", "postedAt": "2023-02-27T19:31:03.726Z", "postId": "XpeamS2yTNhagxAip", "htmlBody": "<p>Thanks so much for the comment and the questions. I really appreciate you reading this and thinking about it, especially given you are so engaged in longtermism stuff. Loved the skepitical braindump on existential risk from AI.&nbsp;</p><p>Not Nitpicks at all<br><br>1) This is the biggest weakness in our calculation. We use the global burden of disease data, because it estimates the average DALY burden of everyone who gets a disease (say malaria) in Uganda whether they were treated early lateor not at all. OneDay Health centers treatthe people who previously had the worst healthcare access in Uganda, so we assume that our treatment could remove at least that nationwide average DALY burden. You couldargue that this still is likely to overestimate the benefit of treating patients, but you could argue the opposite direction too. Without RCT data I think this is the best we can do at the moment - I couldn't think of a better way to estimate the DALYs we might avert for each disease and also others in big orgs like PSI have used this approach before which is reassuring.<br><br>5km can seem like a short distance, but when you &nbsp;or your child are sick it can be very difficult to walk that far. For what it's worth, the WHO uses this 5km threshold as a key accessibility indicator in countries like Uganda where walking is the only option for the vast majority of rural subsistance farmers. Also for context only 5-10% of Ugandans live in these healthcare black holes so the majority of people are in a better situation.<br><br>5km is only an indicator too - most of our patients live further than this from a government health center as well. It's also a very complicated ecosystem as many government health centers don't have enough medications so people have to buy the medication anyway even when you reach there. Distance isn't &nbsp;the whole story, I simplified somewhat for this post<br><br>2) Subsidising transport would be (close to) impossible for a variety of reasons, mostly the first 2 I thnk<br><br>- How would you decide who to give the money to? Over the phone it would be impossible to know who was really sick and needed money. The system would &nbsp;likely fall down pretty quickly as everyone claimed to be sick. I might be strawmanning &nbsp;your proposed system though if so let me know! Give directly only works because they give unconditional money to most people in a given area.<br><br>- Many people in \"Healthcare black holes\" (only the most remote 5-10% of Uganda) don't have good access to phones or cellphone reception which would be necessary for any kind of transport program.&nbsp;<br><br>- Motorbike transport means are not easily available in some of these areas (not the most important barrier, and motorbike accessibility is improving all the time).</p>", "parentCommentId": "iEDGbc7WpDcAznc4L", "user": {"username": "NickLaing"}}, {"_id": "NAfQeEzBzNNwC7ruW", "postedAt": "2023-02-27T20:29:27.012Z", "postId": "XpeamS2yTNhagxAip", "htmlBody": "<p>Moreover, a transit-subsidy model would overload the already under-resourced government health centers with additional patients compared to what they would have if ODH did not exist at all. So you'd need to account for the likely increased costs (due to, e.g., medications that patients had to purchase from private sources) and worsened care quality for all patients in those facilities.&nbsp;</p><p>In contrast, the existence of an ODH health center should reduce the demand on government health centers, which may well create some benefits for other users of those facilities. Nick's model does not attempt to capture those benefits.</p><p>Some more information about accessibility in Uganda is available <a href=\"https://equityhealthj.biomedcentral.com/articles/10.1186/s12939-020-01371-5\">here </a>although the most important map is hard to read. ODH works in Northern Uganda, where the access to healthcare is significantly lower than near Kampala.</p>", "parentCommentId": "KFqjgjcKq2jXBd9yh", "user": {"username": "Jason"}}, {"_id": "pjwiTf8SRRHnkfssd", "postedAt": "2023-02-27T22:18:44.295Z", "postId": "XpeamS2yTNhagxAip", "htmlBody": "<p>Strong upvote for the analysis. And a more general congratulations on what you are doing with ODH (even <i>if</i> it doesn't turn out as effective as hoped).</p><p>I agree with the biggest weakness identified.</p><p>A quick thought (i.e. excuse me if this is stupid) is that you could use the <a href=\"https://data.malariaatlas.org/trends?year=2020&amp;metricGroup=Malaria&amp;geographicLevel=pixel&amp;metricSubcategory=Pf&amp;metricType=rate&amp;metricName=mortality\">Malaria Atlas Project (MAP) pixel data</a>:&nbsp;</p><figure class=\"image\"><img src=\"https://res.cloudinary.com/cea/image/upload/v1677536325/mirroredImages/pjwiTf8SRRHnkfssd/kx5azwqi4tzki1cmd4mn.png\" srcset=\"https://res.cloudinary.com/cea/image/upload/v1677536325/mirroredImages/pjwiTf8SRRHnkfssd/e0znknesbejfsesp9pqj.png 140w, https://res.cloudinary.com/cea/image/upload/v1677536325/mirroredImages/pjwiTf8SRRHnkfssd/lynz4n0fnoyoug9yxmpc.png 280w, https://res.cloudinary.com/cea/image/upload/v1677536325/mirroredImages/pjwiTf8SRRHnkfssd/r7jmq0lzeuqcvrlrcwdw.png 420w, https://res.cloudinary.com/cea/image/upload/v1677536325/mirroredImages/pjwiTf8SRRHnkfssd/gvxcfyqlmgqhcdjangas.png 560w, https://res.cloudinary.com/cea/image/upload/v1677536325/mirroredImages/pjwiTf8SRRHnkfssd/mccsmd40fx1mtdsuwjby.png 700w, https://res.cloudinary.com/cea/image/upload/v1677536325/mirroredImages/pjwiTf8SRRHnkfssd/weqiq6rjcmkv72hmyskq.png 840w, https://res.cloudinary.com/cea/image/upload/v1677536325/mirroredImages/pjwiTf8SRRHnkfssd/wptq5ojxaid60bjtktfe.png 980w, https://res.cloudinary.com/cea/image/upload/v1677536325/mirroredImages/pjwiTf8SRRHnkfssd/jnfedd4p9do08gqicntp.png 1120w, https://res.cloudinary.com/cea/image/upload/v1677536325/mirroredImages/pjwiTf8SRRHnkfssd/ao3jfowkkxwdeiy50txh.png 1260w, https://res.cloudinary.com/cea/image/upload/v1677536325/mirroredImages/pjwiTf8SRRHnkfssd/ugzsrvalgjsw6h8pm97d.png 1349w\"></figure><p>to estimate burden at the location of ODH centres and analyse based on expectation of shifting mortality rate* closer to other regions where there are closer health care centers.&nbsp;</p><p>A few notes:</p><ul><li>MAP does incorporate <a href=\"https://data.malariaatlas.org/maps?layers=Accessibility:202001_Global_Walking_Only_Travel_Time_To_Healthcare,Malaria:202206_Global_Pf_Parasite_Rate&amp;extent=2726865.586096142,-297621.0433655238,4544860.112762324,525874.1126966141\">proximity to health care center</a> in their modelling but I do not know how to download in a format I can use (only see TFF option).</li><li>Proximity to health care obviously correlated with urbanisation, which reduces the malaria burden itself, but you can probably largely control for this off incidence or prevalence rates.</li><li>Obviously less helpful approach to non-malaria burden, but I think estimations of improvement could be generalised across other health issues.</li><li>This modelling (or at least a prior form) is a core contributor to the <a href=\"https://ghdx.healthdata.org/sites/default/files/record-attached-files/IHME_MALARIA_2000_2019_INFO_SHEET_Y2020M08D31.PDF\">GBD data</a>.</li></ul><p>If you think there is possible merit here, I am happy to discuss.</p><p>*can be converted to DALYs, although this might be an issue if we are to consider \"lives saved\" in the same way as GiveWell (i.e. not using DALYs). &nbsp;I have not quite got my head around if/how this is an issue yet.</p>", "parentCommentId": null, "user": {"username": "Punty"}}, {"_id": "SGZqsaQBPSvfA9r37", "postedAt": "2023-02-28T05:06:51.324Z", "postId": "XpeamS2yTNhagxAip", "htmlBody": "<p>Thanks so much Scott - is this the project you are working on?</p><p>I'll message you about this . There's a geomapping project I've never managed to get going along this line which I think could be hugely powerful, incorporating this kind of data and others such as distance to maternity centers, vaccination rates etc. to form an overall &nbsp;\"neglectedness map\" that can help NGOs and government target the most neglected areas, rather than roll out projects fairly randomly.</p><p>Yes, I think there is immense value in looking for practical and cost efficient ways to provide universal primary healthcare, even if like you say we are not as cost-effective as hoped. Many seem have given up on solving the problem of proximal, comprehensive primary care in remote places. I feel like the hope is that community health workers can treat a proportion of the population in the meantime, while countries develop and urbanise to the point that this is no longer necessary- but that's a whole nother discussion</p><p>We need to be using more data based methods in OneDay health like this - this malaria map is pretty amazing I didn't know about it! We could definitely do a more accurate analysis using this - no question.</p><p>Also I'm going to check out your post from a week ago. I didn't see it at the time.</p><p>Nick.</p>", "parentCommentId": "pjwiTf8SRRHnkfssd", "user": {"username": "NickLaing"}}, {"_id": "RRxT2nY2zzMjEucMT", "postedAt": "2023-02-28T06:16:33.996Z", "postId": "XpeamS2yTNhagxAip", "htmlBody": "<p>I am not working on MAP. That is a &nbsp;project mostly funded by the Bill &amp; Melinda Gates Foundation. That post I made a week ago was just intended as a potentially-interesting description, however as I mention there MAP estimates drive both WHO and GBD estimates. I was also surprised to only recently find out about MAP given that role, and their own slick site.</p><p>I have acquired some general knowledge about malaria doing volunteer research for SoGive (to whom I am grateful). Outside of that, I am now reading up on the <i>An. stephensi</i> threat to Africa, but I would stop short of calling that a project. If you have a malaria-related question you want answers to that doesn't involve advanced math, there is a reasonable chance I can help.</p>", "parentCommentId": "SGZqsaQBPSvfA9r37", "user": {"username": "Punty"}}, {"_id": "wdiNL2sYM3uL7coDc", "postedAt": "2023-03-01T00:36:41.959Z", "postId": "XpeamS2yTNhagxAip", "htmlBody": "<p>Hi Nick, your work sounds really great. I do want to get your view on whether it is potentially more cost-effective to (a) run centres which people come to, &nbsp;vs (b) send community health workers out into villages, rotating through on a regular basis. For (a) the benefit is you don't have to expend resources and time on identifying who is sick; for (b) the benefit is you get to reach out to people who are sick but who are too ill/poor to travel long distances to get treatment &amp; medication; this is especially true for chronic issues which can be detectable any time and whose management can be fairly light touch. The latter is an issue that experts I've been talking to seem fairly worried about, and I would value your opinion on how.</p><p>TLDR even for villages which may not warrant a centre per OneDay's metrics, would it be potentially be valuable to rotate nurses through on a semi-regular basis?</p>", "parentCommentId": null, "user": {"username": "Joel Tan"}}, {"_id": "GvocJr6rBytCEzKdf", "postedAt": "2023-03-01T02:06:46.271Z", "postId": "XpeamS2yTNhagxAip", "htmlBody": "<p>I'm not Nick, but it might be helpful to clarify what you mean by \"community health workers\" -- your TL;DR suggests you may be referring to nurses. (ETA: Nick's comment above explains the difference in scope of practice.)</p><p>Wikipedia (usual disclaimers apply) <a href=\"https://en.wikipedia.org/wiki/Healthcare_in_Uganda\">describes </a>Uganda's levels of public non-hospital care as follows:<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnref7fowufabll3\"><sup><a href=\"#fn7fowufabll3\">[1]</a></sup></span></p><p>The lowest rung of the district-based health system consists of Village Health Teams (VHTs). These are volunteer community health workers who deliver predominantly health education, preventive services, and simple curative services in communities. They constitute level 1 health services. The next level is Health Center II, which is an out patient service run by a nurse. It is intended to serve 5000 people. Next in level is Health Center III (HCIII) which serves 10,000 people and provides in addition to HC II services, in patient, simple diagnostic, and maternal health services. It is managed by a clinical officer. Above HC III is the Health Center IV, run by a medical doctor and providing surgical services in addition to all the services provided at HC III. HC IV is also intended to provide blood transfusion services and comprehensive emergency obstetric care.</p><p>&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fn7fowufabll3\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnref7fowufabll3\">^</a></strong></sup></span><div class=\"footnote-content\"><p><i>Cf. </i>The Guardian <a href=\"https://www.theguardian.com/katine/2009/apr/01/uganda-healthcare-system-explained\">here</a>, but dated.</p></div></li></ol>", "parentCommentId": "wdiNL2sYM3uL7coDc", "user": {"username": "Jason"}}, {"_id": "ezywBdrmvyZHdojGz", "postedAt": "2023-03-01T05:50:45.865Z", "postId": "XpeamS2yTNhagxAip", "htmlBody": "<p>Thanks Joel! Your community health worker question is a common one! I'm a big community health &nbsp;worker fan, and the movement is even part of the inspiration for ODH. But there are a number of common misconceptions about what they &nbsp;actually do</p><p>1) Community health workers might serve an area of 500 households (or more). Even the most active community health worker can't get around more than 50 housholds in a day &nbsp;(and the data &nbsp;shows the norm is more like 5-20 households). &nbsp;When you have malaria or pneumonia, you need help in the first 24 hours of illness and the illness can often get very bad within 1-2 days. So in reality most people visit a VHT for treatment - the VHT doesn't visit them, it's just not possible. This myth of the VHT actively case finding most of their work is persistant though...</p><p>2) Community health workers are not &nbsp;usually very cost effective. Monitoring them, supplying them and paying them to do a part time job works out as being surprisingly expensive. The orgs I've look at (Lastmile health and living goods) including all project costs seem to treat patients at between 4 and 10 dollars per patient (we are between $1-$2 depending on how you calculate), but it's hard to tell as I haven't seen these orgs release these numbers.</p><p>3) &nbsp;Community health workers only usually treat kids under 5 for malaria, pneumonia and diarrhoea - it would be medically irresponsible to get them treating others as they have minimal training. They don't treate adults for malaria. Yes these childhood illnesses are the highest DALY burden conditions, but they still can't treat the majority of patients.<br><br>I'm not sure you mean by chronic issues? Community health workers rarely treat chronic conditions, they treat malaria, pneumonia and diarrhoea in under 5s and sometimes (rarely) provide antenatal care. Maybe in urban places they are involved in NCD care, but certainly not in remote rural placee</p><p>There are a lot of good reasons for community health workers t be doing part of this job. Filling the gap of lack of trained personal (like Uganda), health education and getting as much malaria treatment out there as possible. There are many RCTs proving their worth But we still need more cost effective solutions, and high quality universal helathcare in remote places.<br>&nbsp;</p>", "parentCommentId": "wdiNL2sYM3uL7coDc", "user": {"username": "NickLaing"}}, {"_id": "tNBFiNEW9MpyMLRsz", "postedAt": "2023-03-01T07:03:13.639Z", "postId": "XpeamS2yTNhagxAip", "htmlBody": "<p>1) Ok, so let me try to rephrase and then you can tell me whether this makes sense</p><p>Per <a href=\"https://forum.effectivealtruism.org/posts/XpeamS2yTNhagxAip/remote-health-centers-in-uganda-a-cost-effective#DALYs_averted_treating_patients_for_malaria__Pneumonia_and_STIs\">here</a>, for an individual malaria patient, you are calculating the impact as:&nbsp;</p><p>Badness of malaria × Chance of correct diagnosis × Chance of treatment regime working<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnref41a2k6cjok4\"><sup><a href=\"#fn41a2k6cjok4\">[1]</a></sup></span>.</p><p>And then we are both thinking, well, this should really be something like:&nbsp;</p><p>Badness of malaria × Chance of correct diagnosis × Chance of treatment regime working × Chance that the treatment was counterfactual.</p><p>But then you are pointing out that your term for \"Badness of malaria\" is actually the \"Burden of disease of malaria\", which is actually how bad malaria is, but given that some of the patients are already receiving treatment. So in the original estimate, you didn't have the counterfactual adjustment, but in exchange your \"Badness of malaria factor\" was too low.</p><p>So that's my paraphrasing this so far. Do you think it's mostly correct?</p><p>Then, what my intuition tells me one could do would be to try to:&nbsp;</p><p>a) Make the \"Badness of malaria\" factor be \"Badness of untreated malaria\" and model the \"Chance that the treatment was counterfactual\" factor explicitly. But then this wouldn't capture all the benefits, so then maybe have some upwards adjustment for quality of care?&nbsp;</p><p>b) If gettting estimates for the badness of malaria is somehow too difficult, keep the burden of disease number, but add the counterfactual adjustment, and note that this is explicitly an underestimate.</p><p>At this point though, the counterfactual adjustment might get really gnarly:</p><ul><li>perhaps the most severe cases would have counterfactually been treated more often? Unclear how much this could reduce your estimate of impact.</li><li>One could also model downstream effects, e.g., maybe making it less urgent for the Ugandan gvmt to have more hospitals? But then freeing its capacity to do other things, etc.</li><li>The more factors you start to consider, the less this would be an apples-to-apples comparison against, say, GiveWell's estimate of AMF. Like, they have <a href=\"https://docs.google.com/spreadsheets/d/1yWneQFeOr6uFPa5242u1MrJOUURNpX1WslQcWr-bjXM/edit#gid=0\">some adjustment</a> for what would happen if AMF didn't exist, but do I buy those estimates? Not sure.</li></ul><p>One could also just have the non-counterfactually adjusted numbers, compare to the non-counterfactually adjusted AMF numbers, and leave it as an exercise to the reader to input the relative counterfactual adjustment<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefqb304up89g\"><sup><a href=\"#fnqb304up89g\">[2]</a></sup></span>. Idk, maybe this is too cute.</p><p>My biggest uncertainty would be to what extent the value of ODH comes from [counterfactually averting deaths/saving lots of DALYs], vs [providing better quality of care, or more convenient treatment]. Anyways, hope that these thoughts are midly useful, though obviously I'm missing lots of context and looking at this from a really abstracted perspective.</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fn41a2k6cjok4\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnref41a2k6cjok4\">^</a></strong></sup></span><div class=\"footnote-content\"><p>Or, chance that the treatment works × magnitude of the improvement, if we are being punctillious.</p></div></li><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnqb304up89g\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefqb304up89g\">^</a></strong></sup></span><div class=\"footnote-content\"><p>E.g., if the non-counterfactually-adjusted impact for ODH is X, and the non-counterfactually adjusted impact for AMF is Y, and you are choosing between the two, you don't actually have to calculate the counterfactual adjustments for both, you can just estimate the ratio R of \"how much more counterfactual is ODH than AMF\", and then see if X * R &gt; Y. As I said, maybe too cute.</p></div></li></ol>", "parentCommentId": "KFqjgjcKq2jXBd9yh", "user": {"username": "NunoSempere"}}, {"_id": "oh5ecN5hcKhJYJ8HA", "postedAt": "2023-03-01T09:46:50.817Z", "postId": "XpeamS2yTNhagxAip", "htmlBody": "<p>I think Joel's question and your response raise interesting issues about the most cost-effective ways to meet (at least more of) the health-care needs of people in places too small/remote to support a ODH health center. I can think of three general possibilities:</p>\n<p>One, improve transit for bringing sick people to a center, such as by providing a bike (with small pedicab trailer) for a trusted community member to lend out to those needing to transport friends or family members to an ODH or other health center. The obvious problem there is that the bike might disappear or be diverted to other uses.</p>\n<p>Two, create some sort of lightweight stationary version of ODH health centers for communities that cant support a full one -- employing a part-time, non-nurse community health worker with a sharply limited scope of practice (e.g., malaria, pneumonia and diarrhoea in under 5s).</p>\n<p>Three, put a nurse on a motorbike with a small trailer to create a mobile, semi-lightweight version of an ODH health center (e.g., two hours a day in each of three locations, with two hours of transit time). The cost per patient would obviously be higher than ODH's model due to lower patient volume per nurse, travel expenses, and likely higher facility costs per patient.</p>\n<p>I suspect all of those require more donor subsidy per patient than ODH's current model. The potential advantage would be that the treatment provided may be even more counterfactual than what ODH currently provides.</p>\n", "parentCommentId": "ezywBdrmvyZHdojGz", "user": {"username": "Jason"}}, {"_id": "Gehcm2GWF4geMfWKe", "postedAt": "2023-03-01T11:37:31.047Z", "postId": "XpeamS2yTNhagxAip", "htmlBody": "<p>Great to see analysis like this on the forum, and I would love for more charities to try to lay out their impact like this.<br><br>I'm struggling a bit to get my head around this bit and wonder whether an alternative approach might work better (or maybe I'm just misunderstanding it):<br>\"We used the average Global burden of disease DALY burden per patient in Uganda to estimate the DALY benefit of treating individual patients. This average includes everyone who suffered from each disease in Uganda, whether they were treated correctly, poorly or not at all. This accounts somewhat for what might have happened if we hadn’t treated the patient and avoids the counterfactual of assuming that patients would have not been treated without us.\"<br><br>I think the main pathways for impact from your model are (please add if I've missed something):<br>1) reaching patients who otherwise would have missed out on care<br>2) improved timeliness of care (probably quite a big deal for malaria, maybe less so for family planning)<br>3) improved quality of care vs. alternative (unclear whether you are claiming this or not, I could easily believe this is a big factor if the alternative is faith healers or traditional medicine but less so if you think govt clinics are similar standard)<br><br>Estimating the proportion of 1) is crucial I think.&nbsp;</p><p>One way of generating more evidence would be a baseline of careseeking frequency from health facilities before you establish your centre. If it is 2 visits/year/family before and 4 visits/year/family after - that gives you a reasonable sense of how much additional access you are providing. It sounds like you might already have some of that data too.</p><p>So (made up numbers) if we were just thinking about malaria patients... say there are 10 per month, we could assume that 5 of those are 'additional' ones vs. counterfactual with no facility-&gt; 100% of your treatment benefit is counted. The other 5 would have gotten slower care/poorer quality care -&gt; 50% of your treatment benefit is counted.</p><p>Patients will also benefit from reduced travel cost. I think you could model that as just the equivalent to a givedirectly donation with no overhead probably. Time savings for patients could be substantial also, I imagine for rural people who need to plant crops/harvest this could be a big factor.</p><p>Thanks for the writeup!</p>", "parentCommentId": null, "user": {"username": "Ray_Kennedy"}}, {"_id": "KG2zxPPfHgY4Jsc3s", "postedAt": "2023-03-01T12:33:50.049Z", "postId": "XpeamS2yTNhagxAip", "htmlBody": "<p>Thanks Ray. I think it's really valuable for smaller orgs like us to try and calculate our potential impact even with all the flaws!</p><p>Yes you're exactly right with those 3 points driving our impact. I think improved quality (which includes common complete misdiagnosis in many settings) and timeliness might be nearly as important in driving impact as serving those who would have missed out on care completely. Its not like those who don't get treated are likely to die, the human body is an incredible thing - &nbsp;without treatment we heal ourselves most of the time for most diseases, even malaria. Treatment Quality, prompt treatment and getting any treatment at all are all important impact factors</p><p>Sorry about the poor explanation - that's my bad I should have done better. The average DALYs incurred by a Ugandan with any given disease seemed the best measure available at this time, as it takes the average DALYs per person of whole spectrum of people who get that disease. From those who got no treatment at all to the majority who would get treatment. It's one of the few ways I could think of to get <strong>I</strong><i><strong>'m very open to other ways of calculating DALYs averted per individual patient</strong></i><strong> . </strong>At the time neither PSI or myself could think of a better one.</p><p>Measuring careseeking behaviour is a good thought, we have considered measuring this (we don't right now). One of the issues is that variability of malaria prevalence is so high that it can &nbsp;confound the data. For example let's say the first year there's a high malaria season and they visit healthcare 8x a year, then the second year is low malaria and they only visit 4x. It looks like careseeking behaviour is worsening but it's just that there's ess malaria. Obviously we could try and control for this using regional malaria data but it ain't easy. Also how do we account for going to a drug shop and buying a few pills? Does that count as accessing healthcare? There is much depth to these things.<br><br>&nbsp;Also decreased careseeking behaviour can even be the opposite, a sign of <strong>better health in the community. </strong>If an ODH health center had been doing good work treating patients well and the community is getting generally healthier, they will need to visit the facility less often. If people are treated poorly on the other hand the could end up coming back 5 times for the same condition. It's complicated that's for sure but I still think looking at healthseeking beahviour could have value!</p><p>I like your idea of 100%, 50% benefit etc and I might hit you up about that for futre analysis. We stlil run into that same problem though that we still need to decide what 100% benefit actually means in DALYs. We still need to pull that from somewhere - the problem described above that we currently use the GBD DALYs per person as &nbsp;a proxy for. Our current approach kind of does take this into account in a blunt and flawed way, as the average patent in Uganda takes into account &nbsp;whole spectrum of patient treatment &nbsp;(High quality, late, not at all)</p><p>Yes saving money a big factor and I like your idea of modelling it perhaps using a givedirectly model. I even thought about trying to include those benefits in the analysis, but it seemed like a lot both to do and present all at once. WE should definitely do this soon!</p>", "parentCommentId": "Gehcm2GWF4geMfWKe", "user": {"username": "NickLaing"}}, {"_id": "865eGoA2S44NKrKpg", "postedAt": "2023-03-01T15:56:31.284Z", "postId": "XpeamS2yTNhagxAip", "htmlBody": "<p>One of the things I like about modeling direct/indirect patient financial benefits is that it should allow a high-confidence lower bound for ODH's effectiveness. Let's unrealistically and uncharitably assume that all of ODH's patients would have counterfactually sought care at a more distant facility, and would have received as-timely and as-good care. In that case, the net benefit to patients includes avoided travel costs + loss-of-time costs + other-care costs (the other care is supposed to be free, but often isn't in practice for various reasons), less fees paid to ODH.&nbsp;</p><p>In that pessimistic scenario, we should also include estimated (but difficult to calculate!) benefits to those served by the public health care system, because ODH's existence diverted tens of thousands of patients a year from that underresourced and underfunded system. (Unless ODH scaled to multiple times its size, I doubt its existence would funge overall public health-care spending in Uganda. It's just too small to affect a nationwide budget given how political processes generally work.)</p><p>A somewhat more realistic, but still probably awfully conservative, model would credit ODH (say) 25% of the DALYs in Nick's model and 75% of the income effects in the model described above. Because the DALY source includes both treated and untreated cases, such a mixed model would assume more than 75% of patients would be counterfactually treated.&nbsp;</p><p>Doing a really quick BOTEC, that would yield 3.425 DALYs plus the [75% of net economic effects from the financial-only model, less $87.50<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnref2p7z6rv1gi4\"><sup><a href=\"#fn2p7z6rv1gi4\">[1]</a></sup></span>] for a donor/grantor spend of $137.50. &nbsp;If we assume $3 savings per patient in the financial-only model (based on Nick's travel estimate of $3 + time value of money and other-care costs equal to the ODH fee), that yields us a patient savings of 112.5 patients (75% of average volume) * $3, or $337.50. Subtracting the $87.50 yields $250. If you think those savings are equal in value to GiveDirectly cash transfers, you could model that at 1.81X GiveDirectly + getting the DALYs (and benefits to non-ODH patients from relieving the burden on nearby government health centers) for \"free.\" (I note that this is primarily intended to demonstrate the idea of a mixed-benefits model only, not to make assertion about a reasonable lower-bound estimate for ODH.)</p><p>I'm probably doing this wrong, but GiveWell's moral weights seem to suggest a DALY is morally \"worth\" about doubling the consumption of a person for two years. Given the median income in Uganda is $804, averting a DALY would be roughly equal to increasing consumption by $1600, which would make averting 3.425 DALYs roughly as effective as increasing consumption by $5480. I don't mean to assert that ODH is 41.67X GiveDirectly on this conservative model ($5480 from DALYs + $250 from economic savings / $137.50 donor spend), but this quick analysis does suggest that the bulk of the value in the mixed-model described above comes from the \"free\" components and not the hypothesized 1.81X GiveDirectly economic effect.</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fn2p7z6rv1gi4\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnref2p7z6rv1gi4\">^</a></strong></sup></span><div class=\"footnote-content\"><p>If 25% of visits are counterfactual, then 25% of patient expenses would never have occured.</p></div></li></ol>", "parentCommentId": "Gehcm2GWF4geMfWKe", "user": {"username": "Jason"}}, {"_id": "Z2jFhZTFodK8RmuaR", "postedAt": "2023-03-01T16:27:27.242Z", "postId": "XpeamS2yTNhagxAip", "htmlBody": "<p>Thanks for the explanation, definitely agree that there are some big limitations on looking at careseeking behaviour in that way. No perfect solution but possibly excluding malaria cases as they are so seasonal would be appropriate, or if you can collect baseline data for a year then you can compare month to month.&nbsp;</p><p>I think existing cost-effectiveness studies might be something you can mine to get to DALY/case... for instance, this study here: https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8757489/#!po=51.5625&nbsp;</p><p>suggests that in their intervention, treating an additional 124 cases of diarrhoea = saving almost 5 DALYs (if my quick skim of table 3 is right). That's modelled I think, but might be a good additional datapoint.</p>", "parentCommentId": "KG2zxPPfHgY4Jsc3s", "user": {"username": "Ray_Kennedy"}}, {"_id": "6AY23bJ4HWQcBZHRc", "postedAt": "2023-03-01T18:50:30.328Z", "postId": "XpeamS2yTNhagxAip", "htmlBody": "<p>Your paraphrasing is amazing (probably better than my original post). I just fear you know my brain a bit better than I do. <i><strong>Are you the first GAI? &nbsp;</strong></i>I also don't feel like your analysis is that abstracted at all - your points seem quite concrete actually.</p><p>One small correction I might make is that most Ugandans who get malaria would get treatment, not just a few. We target the 5-10% of places which are really remote and getting treatment is difficult - that's what where here for.</p><p>It's an interesting idea to do \"Badness of untreated malaria\" x &nbsp;\"Chance the treatment was counterfactual\". This is a cleaner method than what I did that's for sure. The first issue with this is that I'm not sure we have a clear data point for badness of untreated malaria (although I can look into this more). Obviously impossible to study now and we need to rely on older data.&nbsp;</p><p>The chance of &nbsp;treatment (yes or no) is counterfactual would be more realistic to find, but is very black and white when really there's a lot more too it than getting treatment or not. &nbsp;Quality of care is important - but perhaps even more important like <a href=\"https://forum.effectivealtruism.org/users/ray_kennedy?mention=user\"><strong>@Ray_Kennedy</strong></a><strong> &nbsp;</strong>pointed out is how quickly people get the treatment. Malaria is an exponentially replicating parasite, and hours can make a differece.</p><p>On your counterfactual adjustments (love it)</p><ul><li>The most severe cases would be more likely to get treated yes (interesting point never thought of ths) - but as a counterpoint as already discussed early treatment is really important. Often (not always) severe malaria is a &nbsp;direct result of inadequate, late or non-treatment.</li><li>Yes there's definitely the counterfactual of the government doing less because NGOs are doing the work. A given thing which should probably warrant a dscount with basically any NGO program! As a caveat here, the Ugandan government made the active decision to spend their resources upgrading current facilities rather than building more in remote places. In the last 10 years the government has opened 0 (or maybe 1) new health center in Northern Uganda. <i><strong>Also &nbsp;of course like many other NGOs we have the dream that perhaps someday a government could see the value in our model and potentially take it over or roll out a version of their own. So this could be a tiny point in our favour (see my bias kicking in again...)</strong></i></li><li>(Side note) Givewell seems quite rough on AMF on this front, positing a 50% chance that other funders would come in if they weren't there in some countries. This feels overconservative to me - what might well be happening is that Global Fund (or others) instead fund more nets in other places instead of working where AMF are working</li></ul><p>The only comment I didn't really understand was the difference between where the vale comes from.</p><p><i>\"My biggest uncertainty would be to what extent the value of ODH comes from [counterfactually averting deaths/saving lots of DALYs], vs [providing better quality of care, or more convenient treatment].\"</i></p><p>I might well be missing something, but better quality of care and more \"convenient\" treatment (meaning people get earlier treatment) both avert deaths and save DALYs, just like getting treatment vs. not getting at all does. So doesn't it all play into the same value proposition?</p>", "parentCommentId": "tNBFiNEW9MpyMLRsz", "user": {"username": "NickLaing"}}, {"_id": "AvWYBbZknKtkzyhHY", "postedAt": "2023-03-01T19:39:14.123Z", "postId": "XpeamS2yTNhagxAip", "htmlBody": "<p>On the counterfactual of the government potentially doing less, I speculate that it would be politically difficult for the government to copy ODH's business model under which 2/3 of total costs are covered by patient fees. Specifically, my understanding is that user fees for public healthcare were dropped in the early 2000s, although as a practical matter the public system isn't always free. Reinstating official fees only in certain areas probably wouldn't fly well politically. So the government would likely have to spend several times what ODH does to set up the same health centers, and that is probably relevant to assessing the odds that it might counterfactually do so.</p>\n", "parentCommentId": "6AY23bJ4HWQcBZHRc", "user": {"username": "Jason"}}, {"_id": "yCtmQj8Ja5GeqshAn", "postedAt": "2023-03-01T20:25:30.163Z", "postId": "XpeamS2yTNhagxAip", "htmlBody": "<blockquote><p>I might well be missing something, but better quality of care and more \"convenient\" treatment (meaning people get earlier treatment) both avert deaths and save DALYs, just like getting treatment vs. not getting at all does. So doesn't it all play into the same value proposition?</p></blockquote><p>See, me missing context matters here. I was imagining that the most pessimistic scenario would be that:</p><ul><li>ODH provides treatment for malaria which is faster, nearer &amp; more convenient</li><li>but patients would have otherwise gotten the same treatment, just later, further away and paying more costs to get it</li><li>So the value of ODH wouldn't be the value of the treatment, it would be the value of making it more convenient</li></ul><p>But as you point out (\"Quality of care is important - but perhaps even more important like <a href=\"https://forum.effectivealtruism.org/users/ray_kennedy?mention=user\"><strong>@Ray_Kennedy</strong></a><strong> &nbsp;</strong>pointed out is how quickly people get the treatment. Malaria is an exponentially replicating parasite, and hours can make a differece.\") you can't just neatly separate getting faster care from getting better care. There are some fun things you could do with distributions, i.e., explicitly model the benefit as a function of how fast you get treatment, and then estimate the counterfactual value as</p><p>∫∫ (Value of getting treatment in h hours - Chance of having otherwise gotten treatment in (h + x) hours instead × Value of getting treatment in (h + x) hours) dx dh</p><p>(where the double integral just means that you are explicitly estimating the value of each possible pair of x and h and then weighing them according to how likely they are)</p><p>But I think this would be overkill, and only worth coming back to do explicitly if/when ODH is spending a few million a year. Still they might add some clarity if we don't do the calculations. Anyways, best of luck.</p>", "parentCommentId": "6AY23bJ4HWQcBZHRc", "user": {"username": "NunoSempere"}}, {"_id": "ojXTThj2ya57D5bH5", "postedAt": "2023-03-02T20:37:15.020Z", "postId": "XpeamS2yTNhagxAip", "htmlBody": "<p>Thank you so much for the writing.\nI am Ugandan and I fully understand the situation.\nFrom what I have observed over time, the Health facilities may be there at whatever distance, and patients can juggle around the transport to reach them. The biggest challenge is that the Centres do not have medicine and other medical tools or equipment, so, patients will not travel to get there and be frustrated by lack of medicine!</p>\n<p>I also wonder, you say you are based in Northern Uganda and want to reach out to other East African countries...why so soon?\nEven in Central, East, West and Southern Uganda, there are similar rural areas facing the very same if not worse situations.\nIs it not possible to go to other areas even before you go to other East African countries?</p>\n<p>Annette Nakakande.</p>\n", "parentCommentId": null, "user": {"username": "Annette Nakakande"}}, {"_id": "7L7RpbYChPgNENvJ8", "postedAt": "2023-03-03T05:47:55.665Z", "postId": "XpeamS2yTNhagxAip", "htmlBody": "<p>Thanks Annette those are amazing questions and comments wow!</p>\n<p>Yes the government health centers have many problems including medications out of stock which I agree is an enormous problem We operate far from government though, and we're not in the business of fixing the government system right now - hundreds of other NGOs are trying as you know.</p>\n<p>You are definitely right that there are other parts of the country with many healthcare black holes. we are already in eastern Uganda and moving into central soon with 5 health centers there at the moment. In western Uganda though there are not as many healthcare bleack holes. Government coverage is better. It's not to say there aren't areas in WEstern far from government - just not as many as in the North and East</p>\n<p>The worst situation is actually in the North east, Karamajong and Pokot area, but the population there is so low and people so poor that our sustanable OneDay Health model wouldn't work there. Perhaps we could do an even more subsidised model there in future thogh because the healthcare situation really isn't good there..</p>\n<p>Thanks so much for the comments amazing</p>\n", "parentCommentId": "ojXTThj2ya57D5bH5", "user": {"username": "NickLaing"}}, {"_id": "CRw4mWCg85XDZzBem", "postedAt": "2023-03-31T09:46:48.739Z", "postId": "XpeamS2yTNhagxAip", "htmlBody": "<p>Thank for writing this and explaining your model to the wider EA community, as well as taking your time to explain the limitations of your calculations, that’s very thoughtful and can inspire an interesting discussion in a global health community here or elsewhere.</p>\n<p>And I am happy to hear that Lafiya Nigeria’s analysis has been helpful!</p>\n<p>I wish you best of luck with this project and I would be keen to work closer to assess the family planning benefits of your organisation, I know that Lafiya Nigeria can learn a lot from your vast experience and we can address some of the impact assessment limitations together.</p>\n", "parentCommentId": null, "user": {"username": "Klau"}}]