[{"_id": "sk8uNyFE4MF5cLgSh", "postedAt": "2023-03-06T17:42:47.769Z", "postId": "XQDS5F4pRRxBododx", "htmlBody": "<p><a href=\"https://www.longview.org/\">Longview Philanthropy</a> advises large donors, though I don't know whether they've tried targeting private foundations in the broad, systematic way you suggest.</p>\n<p><a href=\"https://www.effectivegiving.org/\">Effective Giving</a> superficially appears to be doing a similar thing, though I know less about the specifics.</p>\n<p>(I'm confused because there used to be two Effective Givings, until one of them renamed to Longview, but it sounds like they both do work like this.)</p>\n", "parentCommentId": null, "user": {"username": "BenMillwood"}}, {"_id": "uyRyJbCoantFDGCQC", "postedAt": "2023-03-06T18:11:22.392Z", "postId": "XQDS5F4pRRxBododx", "htmlBody": "<p>Hi Ben, thanks for the note. It does appear these two orgs are doing something fairly similar, primarily offering bespoke consulting for large donors.&nbsp;</p><p><br>I'd agree these two aren't taking a systematic approach, which is really what I had in mind. I think I'll reach out to both to figure out their scope.</p>", "parentCommentId": "sk8uNyFE4MF5cLgSh", "user": {"username": "Kyle Smith"}}, {"_id": "3Ku7MDGapvhkPrsba", "postedAt": "2023-03-06T21:03:28.090Z", "postId": "XQDS5F4pRRxBododx", "htmlBody": "<p><a href=\"https://www.charityentrepreneurship.com/\">Charity entrepreneurship</a> has led a pilot project somewhat related to your point (2). There's more info in <a href=\"https://forum.effectivealtruism.org/posts/s4f83vkkSDL6my44j/foundation-entrepreneurship-how-the-first-training-program\">their writeup</a>.&nbsp;<br><br>One thing to keep in mind with PF doing \"ineffective\"grants is that they're sometimes limited by their statutes, eg. the <a href=\"https://en.wikipedia.org/wiki/Hans_Wilsdorf#1945:_Hans_Wilsdorf_Foundation\">Hans-Wilsdorf foundation</a>, despite moving multiple hundreds of millions of $, can only do so in the canton of Geneva because the founder decided so when creating the org.</p>", "parentCommentId": null, "user": {"username": "Arthur D"}}, {"_id": "txuMb8AfSejrhyeED", "postedAt": "2023-03-06T21:55:32.980Z", "postId": "XQDS5F4pRRxBododx", "htmlBody": "<p>I read that CE post, it does make sense as a way to reach the goal. But they are focused on creating new foundations.</p>\n<p>Your point about statutes is well taken. For example, community foundations would be a poor target. I think the data approach could help deal with that.</p>\n", "parentCommentId": "3Ku7MDGapvhkPrsba", "user": {"username": "Kyle Smith"}}, {"_id": "u7CyqAevPnqCYq5Ah", "postedAt": "2023-03-07T07:43:38.010Z", "postId": "XQDS5F4pRRxBododx", "htmlBody": "<p>Hi Kyle!\nYou might be mixing this up with CE's Incubation Program, which does focus on creating new charities.\nThe Foundation Program does not, as is explained in the write-up linked above.</p>\n<p>CE is very prolific on the Forum lately so maybe you've seen of their other posts?</p>\n<p>[Disclaimer: I've worked with CE before and am a current Incubatee, but have never done any work on the Foundations Program. Send me a DM if you want me to put you in touch with some of the people who have]</p>\n", "parentCommentId": "txuMb8AfSejrhyeED", "user": {"username": "Moritz von Knebel"}}, {"_id": "WCsLCWocgJJd7LyZe", "postedAt": "2023-03-07T14:44:32.216Z", "postId": "XQDS5F4pRRxBododx", "htmlBody": "<p>Oh I think I misread the post a bit - I thought all of the foundations were brand new but it seems there is a part that says that some had already existed before the program.</p><p>This program is pretty similar to what I had in mind. It seems though that this program will only reach a small number of foundations and likely those already semi-aligned with EA.</p>", "parentCommentId": "u7CyqAevPnqCYq5Ah", "user": {"username": "Kyle Smith"}}, {"_id": "ikbzgBSLwGRLJHwKc", "postedAt": "2023-03-07T16:29:50.380Z", "postId": "XQDS5F4pRRxBododx", "htmlBody": "<blockquote>\n<p>Lobby/consult with PF on making effective grants. Givewell does the hard job of evaluating charities, but a more boutique solution could be useful to private foundations.</p>\n</blockquote>\n<p>This is how Open Philanthropy got started!</p>\n", "parentCommentId": null, "user": {"username": "evelynciara"}}, {"_id": "armkpPHGvjvAK9fYj", "postedAt": "2023-03-07T18:21:04.240Z", "postId": "XQDS5F4pRRxBododx", "htmlBody": "<h1>Posting some content from our email exchange, in case others benefit or want to weigh in. I think this idea is very promising.&nbsp;<br><br><br>A relevant list/Airtable&nbsp;</h1><p>&nbsp;<br>See&nbsp;<a href=\"https://airtable.com/shrRiyBGO4bD9VGW9\">THIS airtable view</a>, sort or filter on the last tickbox ... 'foundation-relevant' ... for a start.&nbsp;<br>&nbsp;</p><h1>Key potential partners/orgs</h1><p>From that list, my memory, and conversations on relevant Slacks,&nbsp; there are at least a few organizations that seem to be relevant here:<br><br>1.&nbsp;Charity Entrepreneurship: \"are working with a small number of foundations\"<br>&nbsp;</p><p>2.&nbsp;<a href=\"https://www.generationpledge.org/\">Generation Pledge</a>: Does interact with private foundations. Inside contact: But it's hard to 'break into this'/it's delicate and personal touch work<br>&nbsp;</p><p>3.&nbsp;<a href=\"https://www.effectivegiving.org/\">Effective Giving</a>: I believe they have been in this business for a while<br><br><i>Possibly/likely:</i></p><p>4. Open Philanthropy; they may help&nbsp;<i>other&nbsp;</i>foundations.&nbsp;<br><br>5. The&nbsp;<a href=\"https://total-portfolio.org/\">Total Portfolio Project</a>; focuses on 'impact investing',&nbsp; seems to have an EA/ITN framework<br>&nbsp;</p>", "parentCommentId": null, "user": {"username": "david_reinstein"}}, {"_id": "jaEt24jFvBy9iavLj", "postedAt": "2024-03-17T02:22:20.612Z", "postId": "XQDS5F4pRRxBododx", "htmlBody": "<p>Have you done anything with the dataset of 990-PFs? I'd be interested in helping you with the data analysis if you want.</p>\n", "parentCommentId": null, "user": {"username": "Griffin Young"}}]