[{"_id": "revgJp4qJJky4LrGg", "postedAt": "2023-11-12T21:56:44.344Z", "postId": "XqWZAQ7AiykFS4JoF", "htmlBody": "<p>What an extraordinary idea! I'm connecting with you from Jos, Nigeria. Presently, we're facing a shortage of electricity. For the last few days, we've only had electricity available from 12 am to 5:30 am daily. It's challenging for many to grasp the importance of a solar power system in such a situation. The energy costs here are unfavourable as well, negatively impacting research endeavours. I had previously hoped to acquire <a href=\"https://forum.effectivealtruism.org/posts/3AWxLAyaogvDeJaap/are-there-private-funds-that-will-be-willing-to-help-my-lab\">solar energy to fuel my laboratory</a>, but financial constraints stood in the way. I applaud this initiative; it has the potential to breathe new life into our rural community.</p>", "parentCommentId": null, "user": {"username": "emmannaemeka"}}, {"_id": "syDnHQkdWaWue3Bhu", "postedAt": "2023-11-16T14:25:19.351Z", "postId": "XqWZAQ7AiykFS4JoF", "htmlBody": "<p><strong>Executive summary</strong>: This post outlines a plan to subsidize and distribute long-lasting solar lights and batteries to families in rural Malawi, then determine the cost-effectiveness of the subsidy using standards from GiveWell and Open Philanthropy.</p><p><strong>Key points</strong>:</p><ol><li>The project aims to provide lithium-titanate solar lights and batteries, which have 10x longer lifespan than typical batteries, to rural Malawian families.</li><li>A subsidy model will be used to incentivize adoption, given people's bias for short-term gains over long-term benefits of solar.</li><li>Cost-benefit analysis will calculate the economic and health benefits compared to standard batteries.</li><li>Using GiveWell and OpenPhil standards, the maximum allowable subsidy will be calculated to maintain cost-effectiveness.</li><li>If deemed cost-effective, the subsidized solar lights and batteries will be distributed in Malawi.</li><li>The project hopes to provide sustainable energy access and generate long-term benefits for recipients.</li></ol><p>&nbsp;</p><p><i>This comment was auto-generated by the EA Forum Team. Feel free to point out issues with this summary by replying to the comment, and</i><a href=\"https://forum.effectivealtruism.org/contact\"><i>&nbsp;<u>contact us</u></i></a><i> if you have feedback.</i></p>", "parentCommentId": null, "user": {"username": "SummaryBot"}}]