[{"_id": "kmmaon5P2revLmLna", "postedAt": "2022-12-17T03:39:37.783Z", "postId": "XSs6HqFvTAHR3bHLg", "htmlBody": "<p>Disclaimer:&nbsp;</p><blockquote><p>the human tendency to refuse to seriously think about contingencies just because they're \"unthinkably horrible\" is the entire reason why a bunch of hobbyists from SF are humanity's first line of defense in the first place</p></blockquote><p>This is not necessarily true. There are some very solid alternative explanations for why it ended up like this.</p>", "parentCommentId": null, "user": {"username": "trevorw96"}}, {"_id": "7QSqJ2AuRyohxzDRL", "postedAt": "2022-12-17T15:14:08.657Z", "postId": "XSs6HqFvTAHR3bHLg", "htmlBody": "<p>FWIW I live in Vermont, on the border of NH and it’s about 2 hours to Boston. Not sure where this group house is, but Burlington is 90 minutes from here on the opposite side of the state, so 3.5 hours from Boston - not that it couldn’t take longer if you aren’t near a highway.</p>\n<p>I know of 2 or 3 (not sure if one of them is still there) people in Burlington working on AI safety and there are ~8 of us Vermont EAs that have been getting together sporadically for the last year or so. Would love to expand that group if anyone wants to  get in touch. Don’t be a stranger :)</p>\n", "parentCommentId": null, "user": {"username": "captainjc"}}, {"_id": "Y8eKQCgwknmrwmRRq", "postedAt": "2022-12-17T15:29:06.038Z", "postId": "XSs6HqFvTAHR3bHLg", "htmlBody": "<blockquote><p>Otherwise, they will be effectively alone in the middle of nowhere, totally dependent on the internet to exchange and verify ideas with other EA-minded people (and all the risks entailed by filtering most of your human connection through the internet).&nbsp;</p></blockquote><p>The first part of this sentence seems fine to me, and living in the country can be isolating and is not for everyone, but just because there aren't other EAs around, doesn't mean you have to get all your human connection through the internet. Having interests and relationships outside of EA/AI Safety circles is probably beneficial for mental health.&nbsp;</p>", "parentCommentId": null, "user": {"username": "captainjc"}}, {"_id": "FkpuaAZZ7m4SNFoxs", "postedAt": "2023-01-25T00:21:38.066Z", "postId": "XSs6HqFvTAHR3bHLg", "htmlBody": "<p>We've just announced ourselves (Cavendish Labs) <a href=\"https://forum.effectivealtruism.org/posts/xBeqaWEJfWZv8ALWn/announcing-cavendish-labs\">here</a>! We'll be in Windsor County, under 3 hours from Boston.</p>", "parentCommentId": "7QSqJ2AuRyohxzDRL", "user": {"username": "Derik K"}}, {"_id": "2aujJDeRui7vBNefu", "postedAt": "2023-01-26T17:34:16.090Z", "postId": "XSs6HqFvTAHR3bHLg", "htmlBody": "<p>Awesome! Let's keep in touch and when you guys are up and running we can provide you a proper welcome :)</p>", "parentCommentId": "FkpuaAZZ7m4SNFoxs", "user": {"username": "captainjc"}}]