[{"_id": "dtCpZMHNoaXvkCzBY", "postedAt": "2022-12-03T03:37:16.228Z", "postId": "XtmGK2inWzp9AG32M", "htmlBody": "<p>Thanks so much for doing this!</p>\n<p>Nitpick: the \"advice I've given people so far\" link is broken.</p>\n", "parentCommentId": null, "user": {"username": "Peter_Hurford"}}, {"_id": "HLHjbtiikKxYmaCxS", "postedAt": "2022-12-03T03:54:29.337Z", "postId": "XtmGK2inWzp9AG32M", "htmlBody": "<p>Whoops! Fixed, it was just supposed to point to the same advice-offer post as the first paragraph, to add context :)</p>", "parentCommentId": "dtCpZMHNoaXvkCzBY", "user": {"username": "Ben_Kuhn"}}, {"_id": "pwRejTBWTre4gdDJG", "postedAt": "2022-12-03T04:42:44.137Z", "postId": "XtmGK2inWzp9AG32M", "htmlBody": "<p>Thank you so much for sharing Ben! I'm glad to hear the calls have been fun.</p>\n<p>What you described fits my observations so far. I also think that management coaching is probably one of the key \"interventions\" here. As with any skill, a great deal of learning how to be a (good) manager is learning a set of new behaviors. Having  someone to reflect on the development of those behaviors and the respective decision-making can be extremely helpful.</p>\n", "parentCommentId": null, "user": {"username": "CristinaSchmidtIbáñez"}}, {"_id": "wmYjbXBBJeLCZ5dPM", "postedAt": "2022-12-03T12:21:22.087Z", "postId": "XtmGK2inWzp9AG32M", "htmlBody": "<p>Very interesting thread. I'm an non-EA experienced manager with a successful team-building company and was looking into how to help EA orgs with team-building, but it turns out I might be more useful as a manager coach?</p><p>I started managing teams 15 years ago and eventually left the corporate world to be a tour guide. Covid forced me back to the manager role and founded my current startup, <a href=\"https://www.woyago.com\">woyago</a>, which is almost on autopilot.</p><p>My Linkedin Profile: <a href=\"https://www.linkedin.com/in/antomontani/details/experience/\">https://www.linkedin.com/in/antomontani/details/experience/</a></p><p>I have free time and would be happy to offer advice for those of you looking for help on management.</p><p>Example areas I might have useful input on (copying heavily from your post Ben!):</p><ul><li>Hiring: clarifying roles, writing job descriptions, developing interview loops, executing hiring processes</li><li>People management: team-building (in person or remote), engagement, cohesiveness, coaching, feedback, handling unhappy or under-performing people, designing processes for things like performance reviews</li><li>Manager training: <a href=\"https://www.gallup.com/cliftonstrengths/en/350423/influential-good-manager.aspx\">70% of variance on employee engagement and performance can be attributed to the manager</a> . I can help managers bring psychological safety to your teams, <a href=\"https://rework.withgoogle.com/print/guides/5721312655835136/\">the number one indicator of performance according to Google</a></li></ul><p>My Calendly can be found in my bio.</p><p>Happy to (finally!) find a way to add impact to my life by helping you.</p>", "parentCommentId": null, "user": {"username": "wachichornia"}}, {"_id": "JsGqDkbCriFEevKzG", "postedAt": "2022-12-03T13:28:15.115Z", "postId": "XtmGK2inWzp9AG32M", "htmlBody": "<p>I feel like a lot of this is downstream from people being reluctant to hire experienced people who aren't already associated with EA. Particularly for things like operations roles experience doing similar roles is going to make far more of a difference to effectiveness than deep belief in EA values.&nbsp;</p><p>&nbsp;</p><p>When Coke need to hire new people they don't look for people who have a deep love of sugary drinks brands, they find people in similar roles for other things and offer them money. I feel like the reason EA orgs are reluctant to do this is that there's a degree of exceptionalism in EA.&nbsp;</p>", "parentCommentId": null, "user": {"username": "projectionconfusion"}}, {"_id": "D5cP5LR7ckhYywwTu", "postedAt": "2022-12-03T14:25:43.469Z", "postId": "XtmGK2inWzp9AG32M", "htmlBody": "<p>It's pretty common in values-driven organisations to ask for an amount of value-alignment. The other day I helped out a friend with a resume for an organisation which asked for people applying to care about their feminist mission.</p>\n<p>In my opinion this is a reasonable thing to ask for and expect. Sharing (overarching) values improves decision-making and requiring for it can help prevent value drift in an org.</p>\n", "parentCommentId": "JsGqDkbCriFEevKzG", "user": {"username": "Ideopunk"}}, {"_id": "FhswscLP4BJpDeKDn", "postedAt": "2022-12-03T15:01:30.958Z", "postId": "XtmGK2inWzp9AG32M", "htmlBody": "<p>I agree that it's downstream of this, but strongly agree with ideopunk that mission alignment is a reasonable requirement to have.* A (perhaps the) major cause of organizations becoming dysfunctional as they grow is that people within the organization act in ways that are good for them, but bad for the organization overall—for example, fudging numbers to make themselves look more successful, ask for more headcount when they don't really need it, doing things that are short-term good but long-term bad (with the assumption that they'll have moved on before the bad stuff kicks in), etc. (cf. the book <a href=\"https://thezvi.wordpress.com/2019/05/30/quotes-from-moral-mazes/\">Moral Mazes</a>.) Hiring mission-aligned people is one of the best ways to provide a check on that type of behavior.</p><p>*I think some orgs maybe should be more open to hiring people who are aligned with the org's particular mission but not part of the EA community—eg that's Wave's main hiring demographic—but for orgs with more \"hardcore EA\" missions, it's not clear how much that expands their applicant pool.</p>", "parentCommentId": "JsGqDkbCriFEevKzG", "user": {"username": "Ben_Kuhn"}}, {"_id": "A9ZYyqGesiQ9EtcdN", "postedAt": "2022-12-03T16:07:20.265Z", "postId": "XtmGK2inWzp9AG32M", "htmlBody": "<p>I think the problem of \"EA leadership <strong>doesn't consider it important</strong> to hire experienced people even for people who are leading a project (who in turn don't consider it important to hire experienced people)\" is a root cause problem for a lot of somewhat negative things going on in EA (which is nobody's fault, but could be useful to improve, I think).</p>", "parentCommentId": null, "user": {"username": "hibukki"}}, {"_id": "AZKajexwnqAKotpWJ", "postedAt": "2022-12-03T22:23:24.924Z", "postId": "XtmGK2inWzp9AG32M", "htmlBody": "<p>Why do you think people think it's unimportant (rather than, e.g., important but very difficult to achieve due to the age skew issue mentioned in the post)?</p>", "parentCommentId": "A9ZYyqGesiQ9EtcdN", "user": {"username": "Ben_Kuhn"}}, {"_id": "ajryvmRhCptLKRYKp", "postedAt": "2022-12-04T11:54:56.187Z", "postId": "XtmGK2inWzp9AG32M", "htmlBody": "<p>I regret that I have but one strong upvote to give this comment. I think this is a <i>huge</i> problem among EA orgs, to the extent that my impression is that moderate incompetence has basically been the <a href=\"https://www.facebook.com/jefftk/posts/979079255202?comment_id=979254219572\">norm</a> at many of them.</p><p>It obviously seems like a good idea to try and improve the resources we've got, but I desperately wish EA orgs would spend more effort trying to attract real experience. &lt;Management talent + management experience&gt; is always going to outperform &lt;management talent&gt;.</p>", "parentCommentId": "A9ZYyqGesiQ9EtcdN", "user": {"username": "Arepo"}}, {"_id": "22niPtphq3Ydwiyji", "postedAt": "2022-12-04T12:18:16.788Z", "postId": "XtmGK2inWzp9AG32M", "htmlBody": "<p>What qualifies as 'a (sufficient) amount of value alignment'? I worked with many people who agreed with the premise of moving money to the worst off, and found the actual practices of many self-identifying EAs hard to fathom.</p><p>Also, 'it's pretty common' strikes me as an insufficient argument - many practices are common and bad. More data seems needed.</p>", "parentCommentId": "D5cP5LR7ckhYywwTu", "user": {"username": "Arepo"}}, {"_id": "cXpgqFskviqjs9avq", "postedAt": "2022-12-04T12:24:56.170Z", "postId": "XtmGK2inWzp9AG32M", "htmlBody": "<p>Would one possible solution to some of these problems be to hire much more outside EA? Move \"familiarity with EA\" to the \"bonus\" part of the job requirements, and instead look for experienced managers as a main criterion?</p>\n", "parentCommentId": null, "user": {"username": "Guy Raveh"}}, {"_id": "imTsrYofWi5mn8L6p", "postedAt": "2022-12-04T12:31:00.512Z", "postId": "XtmGK2inWzp9AG32M", "htmlBody": "<p>Very good article!\nMany EA orgs are start-ups so it’s natural for them to start with a relatively inexperienced team.  However, it’s normal for start-ups to bring in senior people at the top as they grow rather than hiring from the bottom, which is what most EA orgs seem to.\nThe best CEO for a 5-person organisation is rarely the same as the best CEO for a 100-person organisation.  CEOs need to get better at recognising their own weaknesses and Boards need to get better at transitioning founders out of the CEO role.\nIn my opinion, EA orgs also need to increase the weight of experience and decrease the weight of moral philosophy / being in certain cliques.</p>\n", "parentCommentId": null, "user": {"username": "Grayden"}}, {"_id": "vBpmZ6cGgFiJYmNWG", "postedAt": "2022-12-04T14:18:22.870Z", "postId": "XtmGK2inWzp9AG32M", "htmlBody": "<p>Examples:</p><ul><li>A funded, reputable, [important in my opinion] EA org that I helped a bit with hiring an engineer for a [in my opinion] key role had, on their first draft, something like \"we'd be happy to hire a top graduate from a coding bootcamp\"</li><li>I spoke to 2-3 senior product managers looking for their way into EA, while at the same time..:<ul><li>(almost?) no EA org is hiring product people</li><li>In my opinion, many EA orgs could use serious help from senior product people</li></ul></li></ul><p>(Please don't write here if you can guess what orgs I'm talking about, I left them anonymous on purpose)</p><p>&nbsp;</p><p>From these examples I infer the orgs are not even trying. It's not that they're trying and failing due to, for example, an age skew in the community.</p><p>&nbsp;</p><p>I also have theories for why this would be the case, but most of my opinion comes from my observations.</p>", "parentCommentId": "AZKajexwnqAKotpWJ", "user": {"username": "hibukki"}}, {"_id": "HTsCJ4KGteoxyGu5B", "postedAt": "2022-12-04T14:45:23.329Z", "postId": "XtmGK2inWzp9AG32M", "htmlBody": "<p>I have somewhat of a problem writing such examples publicly since I'm afraid to imply that specific people are not good enough at their job, which I really don't want to do. (And so this problem remains hidden from most of the community, which I think is a shame)</p><p>&nbsp;</p><p>Maybe you (Ben, the author) could figure out, for the people/positions where you think it would be better to have someone with a lot of experience, how the hiring process looked. Did they &nbsp;try [reasonably in your opinion] reaching out to very senior people?</p>", "parentCommentId": "vBpmZ6cGgFiJYmNWG", "user": {"username": "hibukki"}}, {"_id": "LYR69FWTTbSETQSCp", "postedAt": "2022-12-04T14:49:37.934Z", "postId": "XtmGK2inWzp9AG32M", "htmlBody": "<p>Consider posting about it!</p>", "parentCommentId": "wmYjbXBBJeLCZ5dPM", "user": {"username": "hibukki"}}, {"_id": "skGEgYgPRkYsRHa2T", "postedAt": "2022-12-04T16:21:51.134Z", "postId": "XtmGK2inWzp9AG32M", "htmlBody": "<p>You're correct about all of this. I developed a fellowship program to help orgs specifically with upskilling and having the support they need to do well. I believe that the 3 critical ingredients to running an org successfully are: a) having the right knowledge b) having peer support and c) having a mentor and accountability. My personal mission is to help orgs succeed. You can find out more information on my <a href=\"https://workstreamsystems.com/our-work/#effective-altruism\">website</a>, or shoot me a PM / <a href=\"mailto:denglander@workstreamsystems.com\">email</a>.<br>I'm also working on developing an organization to consolidate all the org support resources - I've done this in the small business sector, and am applying the principles to EA. Would love to connect with anyone who wants to be a part of it.</p>", "parentCommentId": null, "user": {"username": "Deena Englander"}}, {"_id": "kcsZyLcF6EzjunwaC", "postedAt": "2022-12-04T21:30:43.559Z", "postId": "XtmGK2inWzp9AG32M", "htmlBody": "<p>Thanks for writing all of this Ben. I agree with everything you have said and like your ideas. I also think that we should:</p>\n<ul>\n<li>nudge more EAs to get research etc management experience in industry before returning to  work in new EA organisations.</li>\n<li>have a management consultancy type org or network for providing fractional management oversight/advice to new organisations. For instance, 10 hours a week to advise how to set up a research team or to sit in on supervision meetings and pass on best practices.</li>\n<li>have a norm that managers at places like Rethink occassionally do placements at other research organisations to pass on their knowledge and best practice</li>\n<li>have some people who are involved across many established and new research orgs (maybe as funders) and incentivised to understand and speed up the dissemination of collective best practice (e.g., via talk with CEOs/founders or writing up what they have learned)</li>\n</ul>\n", "parentCommentId": null, "user": {"username": "Peterslattery"}}, {"_id": "wqFPv2bpmJPqKahCA", "postedAt": "2022-12-05T01:55:28.414Z", "postId": "XtmGK2inWzp9AG32M", "htmlBody": "<p>I've had vaguely similar thoughts about youth and levels of professional experience, but you have articulated this much better than I have. Thanks for writing this.</p><p>I'd be very happy to see a \"EA managers\" Slack (or some other forum/conversation space/community), and I would be very happy to join.</p>", "parentCommentId": null, "user": {"username": "jlemien"}}, {"_id": "fsucCCvzfGWmG5oJb", "postedAt": "2022-12-05T11:42:13.087Z", "postId": "XtmGK2inWzp9AG32M", "htmlBody": "<p>I also wonder if commercial Boards understand that growing the business is ultimately more important than looking after the CEO emotionally or similar. So they exert pressure to perform, including potentially 'levelling' senior staff, that nonprofits are less likely to do.<br><br>Couple that with a lack of supply for these jobs (I don't know how many senior people are clamouring to work for EA orgs, versus people who want to be CEO of a 100-person company) and I think it leads to stagnation.</p>", "parentCommentId": "imTsrYofWi5mn8L6p", "user": {"username": "jlewars"}}, {"_id": "9HA6LpTAAPKksDxNN", "postedAt": "2022-12-05T20:34:15.024Z", "postId": "XtmGK2inWzp9AG32M", "htmlBody": "<p>Post summary (feel free to suggest edits!):<br>The author’s observations from talking to / offering advice to several EA orgs:</p><ul><li>Many orgs skew heavily junior, and most managers and managers-of-managers are in that role for the first time.</li><li>Many leaders are isolated (no peers to check in with) and / or reluctant (would prefer not to do people management).</li></ul><p>They suggest solutions of:</p><ul><li>Creating an EA manager's slack (let them know if you’re interested!)</li><li>Non-EA management/leadership coaches - they haven't found most questions they get in their coaching are EA-specific.</li><li>More orgs hire a COO to take over people management from whoever does the vision / strategy / fundraising.</li><li>More orgs consider splitting management roles into separate people management and technical leadership roles.</li></ul><p>(If you'd like to see more summaries of top EA and LW forum posts, check out the <a href=\"https://forum.effectivealtruism.org/s/W4fhpuN26naxGCBbN\">Weekly Summaries</a> series.)</p>", "parentCommentId": null, "user": {"username": "GreyArea"}}, {"_id": "oFbGT4AzdFjmF8nCN", "postedAt": "2022-12-05T22:19:56.892Z", "postId": "XtmGK2inWzp9AG32M", "htmlBody": "<p>I'd also be happy to join an \"EA managers\" Slack!</p>\n", "parentCommentId": "wqFPv2bpmJPqKahCA", "user": {"username": "Manuel_Allgaier"}}, {"_id": "sqsoyHQ3GD6jn5GuK", "postedAt": "2022-12-05T23:19:28.123Z", "postId": "XtmGK2inWzp9AG32M", "htmlBody": "<p>In fortune 500 companies, rarely you find people that are exceptional on the get go. Most of them that have succeeded were allowed to grow themselves within parameterized environments of multidisciplinary scope so they can have the room to combine ideas.</p>\n<p>Can EA develop the EA/ longtermist attitude in exceptionally talented people? I believe digging this question brutally can point every EA founder /Directorship role on how to deal with developing management talent..</p>\n", "parentCommentId": "FhswscLP4BJpDeKDn", "user": {"username": "Miguel"}}, {"_id": "7gXw4ee5xiffj2rTQ", "postedAt": "2022-12-06T01:04:04.810Z", "postId": "XtmGK2inWzp9AG32M", "htmlBody": "<p>I'd also be interested. Seems pretty necessary at this point. I could also help out with it more generally.&nbsp;</p>", "parentCommentId": "oFbGT4AzdFjmF8nCN", "user": {"username": "oagr"}}, {"_id": "dKaiMcogh4Yb3BgL9", "postedAt": "2023-01-09T18:54:14.720Z", "postId": "XtmGK2inWzp9AG32M", "htmlBody": "<p>Thank you for a great post. As another person in the experienced-manager-outside-EA group, but now moving more into this world as a manager, I would definitely be interested in a space to discuss management with other managers. I had a peer network like this in a previous management position, and it was quite helpful.</p>", "parentCommentId": null, "user": {"username": "KyleGracey"}}, {"_id": "regdvaGQXLGBEEJAX", "postedAt": "2023-01-14T15:10:21.821Z", "postId": "XtmGK2inWzp9AG32M", "htmlBody": "<p>Yeah, lot of the issues in EA are things I recognise from other fields that disproportionately hire academic high achievers straight out of college, who don't have much real world experience, and who overestimate the value of native intelligence over experience. But conveying the importance of that difference is difficult as, ironically, its something you mostly learn from experience.&nbsp;</p>", "parentCommentId": "A9ZYyqGesiQ9EtcdN", "user": {"username": "projectionconfusion"}}]