[{"_id": "ncZJKvcdvexWu9fs7", "postedAt": "2017-08-12T18:38:47.406Z", "postId": "XvbBCP3ryme5H5RsS", "htmlBody": "<blockquote>\n<p>In one study, 12 of 15 smokers (i.e. 80%) quit tobacco after 2-3 does of psilocybin (i.e. biological tests showed they had not smoked in 6 months); to the best of my knowledge, this result is unheard of in addiction treatment.[34]</p>\n</blockquote>\n<p>Although the sample size was very small (15), if psilocybin was effective for tobacco cessation, it seems it will have potential to &quot;save&quot; <a href=\"http://www.who.int/mediacentre/factsheets/fs339/en/\">7 million people/year</a>.</p>\n<p>Recently, I wrote <a href=\"http://jiwoonhwang.org/e-cigarettes-neglected-solution-to-7-million-life-year-problem/\">an article</a> on the distribution of E-cigarettes for smoking cessation, but psilocybin seems more effective than e-cigs, and possibly more cost-effective than AMF, or other GW-recommended charities.</p>\n<p>Also, psilocybin might be a substance that may be good to start DPR campaign, as we have a very good reason (tobacco cessation) to do DPR on that substance.</p>\n", "parentCommentId": null, "user": {"username": "Jiwoon"}}, {"_id": "GafTmpf2wZS86iEFw", "postedAt": "2017-08-12T18:43:31.735Z", "postId": "XvbBCP3ryme5H5RsS", "htmlBody": "<p>I hadn't made that link, but yes, that could be an additional reason to get excited about DPR. </p>\n", "parentCommentId": "ncZJKvcdvexWu9fs7", "user": {"username": "MichaelPlant"}}, {"_id": "wjGwk5fqPvj8Wdiep", "postedAt": "2017-08-14T14:53:09.273Z", "postId": "XvbBCP3ryme5H5RsS", "htmlBody": "<p>Hi Michael,</p>\n<p>This is fantastic work, thanks for all the effort and thought that went into these posts. Your overall case seems solid to me-- or at minimum, I think yours is 'the argument to beat'.</p>\n<p>One thought that I had while reading:</p>\n<blockquote>\n<p>Drug policy reform may also allow us to better understand current pain medications and develop new treatments and uses.\nYour focus here is on decriminalizing existing drugs such as psilocybin, opioids, and MDMA, because you believe (with substantial evidence) that these drugs have nontrivial therapeutic potential, despite their sometimes substantial drawbacks. This seems reasonable, especially in the case of drugs with fairly benign risk profiles (e.g. psilocybin).</p>\n</blockquote>\n<p>I do worry about some of the long-term side-effects associated with certain drugs, however, and it seems to me an interesting 'unknown unknown' here is if it's possible to develop new substances, or novel brain stimulation modalities, that allow us access to the upsides of such drugs, without suffering from the downsides. </p>\n<p>E.g., in the case of MDMA, the not-uncommon long-term effects of chronic use include heightened anxiety &amp; cognitive impairment, which seem very serious. But at the same time, there doesn't seem to be any 'law of the universe' mandating that the pleasant feelings of love &amp; trust elicited by MDMA that are so therapeutically useful for PTSD must be unavoidably linked to brain damage.</p>\n<p>I'm not completely sure how this observation interacts with your arguments, but I suspect it generally supports your case, since decriminalization could lower barriers for research into even better &amp; safer options. Quite possibly, this could be one of the major reasons why decriminalization could lead to a better future.</p>\n<p>On the other hand, the sword of innovation cuts both ways, as there seem to be a lot of very dangerous, toxic variants of drugs coming from overseas labs that are even <em>less safe</em> than current options (Fentanyl, Captagon, etc). Perhaps this is a case of &quot;Banning dangerous substances as a precautionary principle can have perverse effects if it causes people to take a more dangerous drugs instead,&quot; and decriminalization would help mitigate this phenomenon. But I must admit to some uncertainty &amp; worry here as to second-order effects.</p>\n<p>Anyway, I think this is worth pursuing further. OpenPhil might be interested? I think probably Nick Beckstead might be a good contact there.</p>\n", "parentCommentId": null, "user": {"username": "MikeJohnson"}}, {"_id": "ZutMpPHHosTqxMkpc", "postedAt": "2017-08-14T15:57:17.403Z", "postId": "XvbBCP3ryme5H5RsS", "htmlBody": "<p>Hello, and thanks!</p>\n<p>I agree with you there isn't any law of the universe here, although, for whatever reasons, many people actually do seem to believe drugs that make you feel good now must make you feel bad later, and the later badness is at least equal to the goodness experience. Maybe this is borne out by people's experiences of hangovers, not sure. But yeah, there's no obvious reason for this to be true. If there is, we should look for a neurological and evolutionary explanation. </p>\n<p>Nor does it seem it is true: i'm fairly confident the odd pint increases my well-being overall and than i've taken painkillers that have removed unhappiness without making me feel worse again later.</p>\n<p>On precautionary principles, my thought is we should look at the evidence <em>before</em> collapsing into a moral panic. It's not like we're uncertain about fentanyl's safety, we know it's pretty potent (used to be an elephant tranquiliser, etc.). And we should consider the counterfactuals, too. I don't have a line on exactly what should be legalised and i think it's worth thinking through. </p>\n<p>I hadn't occurred to me to pitch this directly of OPP. My plan was to put it up here so others could see if/where I'd gone wrong as the first step.</p>\n", "parentCommentId": "wjGwk5fqPvj8Wdiep", "user": {"username": "MichaelPlant"}}, {"_id": "kmpEgvtbFFbi3fJ2m", "postedAt": "2017-08-14T22:00:26.787Z", "postId": "XvbBCP3ryme5H5RsS", "htmlBody": "<p>No discussion of the US heroin epidemic?</p>\n", "parentCommentId": null, "user": {"username": "John_Maxwell_IV"}}, {"_id": "5cwo45ddB4koNuhYw", "postedAt": "2017-08-14T22:37:03.042Z", "postId": "XvbBCP3ryme5H5RsS", "htmlBody": "<p>We say we're not going to discuss it: it's a relevantly different problem from that of under-prescription in the developing world and this is already a huge document. We don't have particular suggestions for the US epidemic but everything else we say still stands. In part 3 I note it's an open question as to whether decriminalisation, legalisation (or even the status quo) is the right response to heroine.</p>\n<p>Do you have a suggestion?</p>\n", "parentCommentId": "kmpEgvtbFFbi3fJ2m", "user": {"username": "MichaelPlant"}}, {"_id": "YhxCSWGegc4KFbhfW", "postedAt": "2017-08-15T02:04:44.400Z", "postId": "XvbBCP3ryme5H5RsS", "htmlBody": "<blockquote>\n<p>According to 2005 data, production was valued at $13 billion, the wholesale industry priced at $94 billion and retail estimated to be worth $332 billion. The wholesale valuation for the drugs market is higher than the global equivalent for cereals, wine, beer, coffee, and tobacco combined.</p>\n</blockquote>\n<p>I couldn't see the full report from your link, but global grain (cereal) production is around <a href=\"http://www.earth-policy.org/indicators/C54/grain_2013\">2.2 billion tons per year</a>. Wholesale price fluctuates, but it is around $1/kg, so ~$2 trillion per year. This is more than an order of magnitude bigger than your illicit drug wholesale value.</p>\n", "parentCommentId": null, "user": {"username": "Denkenberger"}}, {"_id": "HNi9jedF5mwMptFKN", "postedAt": "2017-08-15T10:48:28.428Z", "postId": "XvbBCP3ryme5H5RsS", "htmlBody": "<p>Sorry, I don't see what your point is. Could you expand?</p>\n", "parentCommentId": "YhxCSWGegc4KFbhfW", "user": {"username": "MichaelPlant"}}, {"_id": "YGL3yW2wTemfi9BFJ", "postedAt": "2017-08-15T13:58:48.726Z", "postId": "XvbBCP3ryme5H5RsS", "htmlBody": "<p>He's saying that the value of the global cereal market alone is $2tr, which exceeds the value of the wholesale drugs market, contra what you say in your piece. </p>\n", "parentCommentId": "HNi9jedF5mwMptFKN", "user": null}, {"_id": "QXnctFADTKMmbpda6", "postedAt": "2017-08-15T14:58:38.364Z", "postId": "XvbBCP3ryme5H5RsS", "htmlBody": "<p>Okay. So the source I found was probably wrong. I can't see how this has any significance on the argument, so it would have been more useful to say &quot;this isn't important for the argument, but just so you know ... &quot;</p>\n", "parentCommentId": "YGL3yW2wTemfi9BFJ", "user": {"username": "MichaelPlant"}}, {"_id": "2ZmMY4yJMmwpYrYRv", "postedAt": "2017-08-16T08:16:44.680Z", "postId": "XvbBCP3ryme5H5RsS", "htmlBody": "<blockquote>\n<p>it's a relevantly different problem from that of under-prescription in the developing world</p>\n</blockquote>\n<p>Seems like it could potentially be pretty relevant if &quot;optimal&quot; levels of prescription tend to slide towards heroin epidemics, or something like that.</p>\n<blockquote>\n<p>this is already a huge document</p>\n</blockquote>\n<p>That's fair.  I guess I mainly wanted to ensure that you spent some time thinking about this before actually working on DPR.</p>\n<p>[Rant incoming]</p>\n<p>I am <a href=\"https://www.facebook.com/groups/effective.altruists/permalink/1263971716992516/\">generally frustrated</a> with EAs for not brainstorming how their projects might backfire.  In my view, the sign of a given intervention is much more important than the tractability/cost-effectiveness, and it seems like you devoted more space to the second two.  <a href=\"https://80000hours.org/2012/08/social-interventions-gone-wrong/\">Sign uncertainty should be high by default</a>.</p>\n<p>I am also frustrated by the fact that I feel like in this particular case, the 'EA way' of thinking about things is actually worse than the way the average American voter thinks about them.  Like, if I proposed to an average American voter that we should legalize all drugs, they would probably immediately say something like &quot;well what about the heroin epidemic&quot;, and this seems like a completely valid point to bring up!  I'm frustrated that EA has somehow caused us to focus on issues like tractability, cost-effectiveness, and neglectedness instead of addressing the issue of whether we should do the darn thing in the first place.  And this is a mistake that the average American voter does <strong>not</strong> make.</p>\n<p>This is also related to another thought pattern I see in EA where it seems like people consider EA to be some kind of magical fairy dust that creates effective interventions.  Like, I'm sure many gallons of ink have been spent writing about the optimal drug policy and I don't see you making a serious attempt to either summarize the existing literature or contribute something new (e.g. &quot;here is why drugs were made illegal, here's why the thinking is flawed&quot;--cc Chesterton's Fence--&quot;here's a new drug policy that gets us the benefits of the old policy without the costs&quot;).  And even if you were doing either of those things, that still doesn't necessarily constitute a basis for action.  I might as well randomly choose one of the many memos that have been written over the years and implement the drug policy suggested by that memo.  There's no magical fairy dust in the EA forum that makes your memo better than all the other memos that have been written.</p>\n<p>That said, you should not take this objection personally because like I said, it is a beef I have with EA culture in general.  This series is fine as a pointer to the topic, and you probably just meant to indicate &quot;hey, EAs should be paying more attention to this&quot;, so my rant is probably unjustified.</p>\n<blockquote>\n<p>In part 3 I note it's an open question as to whether decriminalisation, legalisation (or even the status quo) is the right response to heroine.</p>\n</blockquote>\n<p>Could you point to the specific passage you're referring to?</p>\n<p>As a final pragmatic note, I think if you actually wanted to work on DPR, solving the heroin epidemic could be a good first step to doing that, because that would create room to maneuver politically for legalization reforms.</p>\n", "parentCommentId": "5cwo45ddB4koNuhYw", "user": {"username": "John_Maxwell_IV"}}, {"_id": "egD6zknXBmy2i7eKd", "postedAt": "2017-08-16T10:26:33.074Z", "postId": "XvbBCP3ryme5H5RsS", "htmlBody": "<p>Thanks for the comment, although I largely feel you're accusing me/us of things I'm not guilty of. (note: Lee wrote the pain section but we both did editing, so I'm unsure whether to use 'I' or 'we' here)</p>\n<p>What I see this series of post as doing is suggesting DPR to the EA world as a cause worth taking seriously. I don't insist on particular policy suggestions. I haven't made my mind up and others are free to draw their own conclusions. </p>\n<p>One issue we highlight is the lack of pain medication in part A of the world, whilst noting there is too much in part B, but that we wont talk about B. That doesn't seem unreasonable to do in an essay limited in scope, unless it's obvious changing the situation in A would obviously lead to it becoming like B. It's not obvious (although we can argue about it) so we left it out. Indeed, given the use of psychedelics to treat addiciton (see footnote 27), you might think that part of DPR is important because you worry about the opiate crisis.</p>\n<p>Further, as I claim in part 1, there are multiple arguments for different types of DPR. So it's not sufficient to claim one part would backfire to say we shouldn't be interested in any of it. There are lots of ways we could do DPR, and you <em>could</em> change everything else whilst leaving opiates unchanged. By analogy, seems that I'm saying something like &quot;X will reduce crimes apart from murders&quot; and you're replying &quot;but you should think about stopping murders&quot; which strikes me as irrelevant.</p>\n<p>Here's the quote where I mentioned this in part 3:</p>\n<blockquote>\n<p>Perhaps we should legalise all those drugs up to and including cannabis on the graph of harms I used earlier, but no further. This would mean legalising everything apart from amphetamines, cocaine and heroin (and presumably keeping tobacco and alcohol legal too) [note: graph now added; must have been lost in transmission]</p>\n</blockquote>\n<p>I'm slightly unsure how to response to your point about original analysis, which feels unhelpfully personal. In section 2.1 above I say why drugs have been made illegal, but I didn't want to get stuck into that because I took the real objective to be explaining why DPR might do good. I also suggest a range of policies (in part 3) and how they each solve different parts of the problems. I'm not claiming to be the first to write about DPR. What I thought was missing was an analysis that brings all the different arguments together, as I also discuss in part 3, and, further, brings it to the attention to EA. If you already know lots about DPR the argumentative pay-off only comes in part 4 where I explain why this might be more cost-effective that causes EAs already support. If I'd just written part 4 you (or others) would be justified in complaining I hadn't made the case!</p>\n<p>Finally, FWIW, I think the largest ammount of value from DPR would come from tackling mental health with new methods, and that doesn't have the obvious backfire worries. I'm not really sure how to think about the heroin epidemic, nor do I see it as necessary for me to provide an answer. If you happen to have a solution to the opiate crisis and can give me a cost-effectiveness model, then I can build that in to what I do have. I'm not expecting you to have a solution, nor I think I need one to be able to deal with other parts of the topic. </p>\n", "parentCommentId": "2ZmMY4yJMmwpYrYRv", "user": {"username": "MichaelPlant"}}, {"_id": "Z8tvaj9Gj4f4p9nYZ", "postedAt": "2017-08-16T17:46:19.894Z", "postId": "XvbBCP3ryme5H5RsS", "htmlBody": "<blockquote>\n<p>(note: Lee wrote the pain section but we both did editing, so I'm unsure whether to use 'I' or 'we' here)</p>\n</blockquote>\n<p>I align myself Michael's comment. </p>\n", "parentCommentId": "egD6zknXBmy2i7eKd", "user": {"username": "Lee_Sharkey"}}, {"_id": "zy37tW3355JxGQBSf", "postedAt": "2017-08-16T21:20:37.778Z", "postId": "XvbBCP3ryme5H5RsS", "htmlBody": "<p>If illicit drugs were greater expenditure than grains, that would be amazing. But I agree, not that important to the argument.</p>\n", "parentCommentId": "QXnctFADTKMmbpda6", "user": {"username": "Denkenberger"}}, {"_id": "kuEgFnWQRA8mx3eSw", "postedAt": "2017-08-17T06:03:22.997Z", "postId": "XvbBCP3ryme5H5RsS", "htmlBody": "<p>Fair points.  I'm sorry.</p>\n", "parentCommentId": "egD6zknXBmy2i7eKd", "user": {"username": "John_Maxwell_IV"}}]