[{"_id": "qzFq97ogobb4x89Ln", "postedAt": "2014-10-28T10:26:06.033Z", "postId": "XvHrFnSbT37GFLYme", "htmlBody": "<p>Thank you for this very important post, this is something I have been wanting to do for a very long time. </p>\n<p>Do you know of any work that has been done comparing the effectiveness of outreach to other activities effective altruism supporters can take? I refer specifically to the limited kind of outreach suggested here, such as opening a local chapter, and not the kind of outreach Peter Singer is capable of.</p>\n<p>I will give you an example of what I am thinking about.</p>\n<p>A year ago I changed my career plan and started a technology startup. If my startup succeeds, it will substantially increase the amount I am able to give throughout my life. \nI expect work on an outreach program to require significant time and effort which I do not have to spare, so it will slow down my startup's progress, and decrease its chances of success. \nAssuming after 1 year I get 10 people to take GWWC's pledge, which I consider phenomenal success, my guesstimates show the expected dollars given to charity will be more or less the same. \nI am aware of the concept of flow through effects, and the tiny probability that I convince the next billionaire to join the cause, but I do not know how to add that to my calculation at this time.</p>\n<p>Any reference or help will be much appreciated.</p>\n", "parentCommentId": null, "user": {"username": "UriKatz"}}, {"_id": "W8xKDjbxTAWMgeYcJ", "postedAt": "2014-10-29T03:34:22.603Z", "postId": "XvHrFnSbT37GFLYme", "htmlBody": "<p>Uri, it is my understanding that a better EA model of a startup would be a collective one, than individualistic. Your business will grow faster by creating and growing  a larger team. For example, if your current team needs 12 month of full time work to complete the startup phase, then by increasing the team 3 times, the work  may be accomplished in 3 month.<br />I am interested to learn nature of your startup for more qualified communications with you. </p>\n", "parentCommentId": "qzFq97ogobb4x89Ln", "user": {"username": "Ilya"}}, {"_id": "6sbGf75DdmQccozFs", "postedAt": "2014-10-29T07:15:29.236Z", "postId": "XvHrFnSbT37GFLYme", "htmlBody": "<p>Hi Ilya, thanks for your reply. I may have misunderstood you, but your example seems not to take into account the overhead of managing a larger team, or the diminishing returns of each additional staff member. This goes to the heart of my question: what would be the most effective way for each individual to further EA causes? Should they work full time and donate more, or work part time and do other things (this question may only apply to those who are earning to give). \nThis question can best be determined on a case by case basis of course. It relates to the current article, because I was wondering if anyone tried to analyze the potential returns of localized outreach. I can compare such an analysis to the estimates I have of my startup's risks and rewards. These are numbers I prefer not to mention, mainly because they are highly speculative.  </p>\n", "parentCommentId": "W8xKDjbxTAWMgeYcJ", "user": {"username": "UriKatz"}}, {"_id": "XBmxsca3wQBECv5s7", "postedAt": "2014-10-29T08:55:23.456Z", "postId": "XvHrFnSbT37GFLYme", "htmlBody": "<blockquote>\n<p>Do you know of any work that has been done comparing the effectiveness of outreach to other activities effective altruism supporters can take? I refer specifically to the limited kind of outreach suggested here, such as opening a local chapter, and not the kind of outreach Peter Singer is capable of.</p>\n</blockquote>\n<p>Perhaps weeatquince could ask someone from <a href=\"http://www.thehighimpactnetwork.org/\">The High Impact Network</a> to comment?</p>\n", "parentCommentId": "qzFq97ogobb4x89Ln", "user": {"username": "Vincent_deB"}}, {"_id": "R5fmAM7S438dgrfBR", "postedAt": "2014-10-30T17:24:40.729Z", "postId": "XvHrFnSbT37GFLYme", "htmlBody": "<p>Hi Uri, I guess there is no modern (21st century) data yet on potential return of localized outreach because the Oxford-style EA mentality is very young, though the great minds thousand years ago have found the best answers to the challenge of best purpose/meaning of human life. \nMy intuition tells me that the most effective way to actualize EA causes would be  through creation of small teams/groups/collectives able of sustainable economical and ideological exchange with the environment. My assumption is that members of such a group recognize their need for harmonious interconnection. Think of a living organism in which all organs work in unity and harmony. A more or less normal organism does not have what you call “management overhead”. Complexity of physical human body, with all its “major and minor” organs, comprised of hundreds of millions of cells,  is much greater than complexity of a small (3 to10 person) team. \nIf you are interested and free in principle of forming a small project team for sustainable propagation, I’d like to chat with you in skype.  </p>\n", "parentCommentId": "6sbGf75DdmQccozFs", "user": {"username": "Ilya"}}, {"_id": "s9nNpESRCKTiJH5Po", "postedAt": "2014-10-30T18:31:14.417Z", "postId": "XvHrFnSbT37GFLYme", "htmlBody": "<p>Vincent, thank you referencing The High Impact Network, which stimulated my further comment to Uri, and an opportunity to meet Brooklyn members of THINK.</p>\n", "parentCommentId": "XBmxsca3wQBECv5s7", "user": {"username": "Ilya"}}, {"_id": "sRr2G4syR7vCheCZX", "postedAt": "2014-10-31T06:30:23.965Z", "postId": "XvHrFnSbT37GFLYme", "htmlBody": "<p>I'm pleased to hear that!</p>\n", "parentCommentId": "s9nNpESRCKTiJH5Po", "user": {"username": "Vincent_deB"}}, {"_id": "w7vre74whBF3yvv8n", "postedAt": "2014-11-01T20:42:35.156Z", "postId": "XvHrFnSbT37GFLYme", "htmlBody": "<p>Thank you for your offer to help me further, but having reviewed the link posted by Vincent, I am certain I do not have the time to start a local chapter right now.</p>\n", "parentCommentId": "R5fmAM7S438dgrfBR", "user": {"username": "UriKatz"}}, {"_id": "5AQurLtSKdZKGfyNJ", "postedAt": "2014-11-08T13:06:41.255Z", "postId": "XvHrFnSbT37GFLYme", "htmlBody": "<p>Hi Uri, Unfortunately I don't know the answer to your question. As you suggest the answer might vary from person to person or situation to situation and be skewed by effects with small probabilities but huge impacts.</p>\n<p>The only thing that I would say however is to disagree with your comment that &quot;work on an outreach program ..[will] require significant time and effort&quot;.</p>\n<p>It requires as much or as little time and effort as you are willing to put in.</p>\n<p>For example just creating a Facebook group in London and creating a social event every month has helped grow the movement in London. Organising the occasional evening with EAs has shown to be not too much more effort than organising a evening with friends.\nHappy to give you some tips on growing EA in minimal time - feel free to message me!</p>\n", "parentCommentId": "qzFq97ogobb4x89Ln", "user": {"username": "weeatquince"}}, {"_id": "5rw5m6FQr4LLRdihP", "postedAt": "2014-11-08T19:15:50.328Z", "postId": "XvHrFnSbT37GFLYme", "htmlBody": "<p>I did not offer you to start a local chapter.</p>\n", "parentCommentId": "w7vre74whBF3yvv8n", "user": {"username": "Ilya"}}, {"_id": "fhATXmHZG2bhfruhb", "postedAt": "2015-02-21T12:13:30.999Z", "postId": "XvHrFnSbT37GFLYme", "htmlBody": "<p>For anyone who might read this thread in the future I felt an update is in order. I revisited my numbers, and concluded that opening a local outreach EA chapter is very cost-effective. The reward/risk ratio is high, even when the alternative is entrepreneurship, assuming the time you invest in outreach does not severely hurt your chances of success and high profits.</p>\n<p>Previously I wrote that: &quot;Assuming after 1 year I get 10 people to take GWWC's pledge, which I consider phenomenal success, my guesstimates show the expected dollars given to charity will be more or less the same.&quot; My mistake was not factoring risk in correctly. When risk is factored in correctly, 1 lifetime pledge might be enough to tilt the balance in favor of investing time in outreach, and 3 - 5 pledges certainly do.</p>\n", "parentCommentId": null, "user": {"username": "UriKatz"}}]