[{"_id": "EAcdFPtorSfpjFdXt", "postedAt": "2023-09-04T19:32:01.158Z", "postId": "XWJcAEKYmNfodjnTL", "htmlBody": "<p>Very glad to hear this is still happening!</p>\n<p>Are you planning on asking any question related to farmed animals? If so, which ones? And if not, would you be up for doing so?</p>\n<p>If you’re not yet but would consider it: I’m happy to talk to a few relevant US folks to suggest some questions. Obviously RP has a very solid animal welfare so asking them is potentially an easier option but happy to do so regardless if you think it’ll be useful.</p>\n", "parentCommentId": null, "user": {"username": "JamesOz"}}, {"_id": "EnQrEzAvBidqaFtTm", "postedAt": "2023-09-05T09:24:49.282Z", "postId": "XWJcAEKYmNfodjnTL", "htmlBody": "<p>Excellent news! If anyone wants to fund this for the Netherlands hit me up...&nbsp;</p>", "parentCommentId": null, "user": {"username": "James Herbert"}}, {"_id": "YimYiarEqDS3gL5ED", "postedAt": "2023-09-05T11:28:16.608Z", "postId": "XWJcAEKYmNfodjnTL", "htmlBody": "<p>Thanks!&nbsp;</p><p>We've spoken to a few different orgs/researchers about animal welfare requests, but would welcome more.</p>", "parentCommentId": "EAcdFPtorSfpjFdXt", "user": {"username": "David_Moss"}}, {"_id": "oH8sz4wiSDJKAbJW6", "postedAt": "2023-09-05T14:36:29.294Z", "postId": "XWJcAEKYmNfodjnTL", "htmlBody": "<p>Really glad to see this is happening! In terms of questions, it might be easiest if you share a draft of the planned questions so that people can see what is already in there and what seems in scope to include. My desire to share my ideas for specific questions is hindered by the concern that it will be a wasted effort.<br><br>One option is to share a spreadsheet of potential questions with a relevant audience/here and ask people to indicate the X (e.g., 5) questions that are of most and least interest, and/or suggest changes or new questions.<br><br>Some general thoughts: I'd like you to cover concern for the major cause areas in EA, and some of the core values of EA (e.g., the extent to which people think we should care about animals, future people, people overseas etc)&gt;<br><br>I'd like you to think about how we can get most value from the data - can you share it so that other people can use it in publication? Can we get someone to create nice visualisations of relevant trends that we might want to publicise?</p>", "parentCommentId": null, "user": {"username": "Peterslattery"}}, {"_id": "HqXgE6qEpjZejvSNT", "postedAt": "2023-09-07T16:48:30.051Z", "postId": "XWJcAEKYmNfodjnTL", "htmlBody": "<p>Thanks!<br>&nbsp;</p><blockquote><p>it might be easiest if you share a draft of the planned questions so that people can see what is already in there and what seems in scope to include.</p></blockquote><p>Makes sense. We're trying to elicit another round of suggestions here first (since people may well have new requests since the original announcement).</p>", "parentCommentId": "oH8sz4wiSDJKAbJW6", "user": {"username": "David_Moss"}}]