[{"_id": "SQZc4abAYBNtBKBKL", "postedAt": "2023-11-09T13:07:08.412Z", "postId": "Xx9oWdJDfisAQwDtT", "htmlBody": "<p><strong>Executive summary</strong>: The post outlines various moral reasons why plausible minimalist views do not recommend absurd acts like murder or sabotaging healthcare.</p><p><strong>Key points</strong>:</p><ol><li>Minimalist views are broader than purely consequentialist views focused solely on conscious experiences. They are compatible with virtue ethics, deontology, social contract theory, care ethics, and moral skepticism.</li><li>Even for consequentialist minimalist views, acts like murder could have intrinsic disvalue. Wellbeing could include more than conscious experiences.</li><li>Rule consequentialism would oppose allowing murder, as this risks catastrophic outcomes from escalating conflict.</li><li>The multi-level approach recommends heuristics like respecting rights and cooperation, which best enable constructive solutions.</li><li>For any view giving weight to outcomes, the multi-level approach provides reasons to oppose absurd acts and pursue cooperative goals.</li></ol><p>&nbsp;</p><p><i>This comment was auto-generated by the EA Forum Team. Feel free to point out issues with this summary by replying to the comment, and</i><a href=\"https://forum.effectivealtruism.org/contact\"><i>&nbsp;<u>contact us</u></i></a><i> if you have feedback.</i></p>", "parentCommentId": null, "user": {"username": "SummaryBot"}}, {"_id": "PuCiGNDcNK3z2ytgs", "postedAt": "2023-11-10T03:20:56.104Z", "postId": "Xx9oWdJDfisAQwDtT", "htmlBody": "<p>These arguments all seem to be relying on using widespread support for traditional moral theories to attempt to cover up the absurd recommendations of negative utilitarianism. But the same intuitions that make some people support negative utilitarianism would probably mean people should support inverted versions of standard moral theories also.</p><p>For example, you claim that virtue ethics would stop negative utilitarians from killing people:</p><blockquote><p>Imagine a moral exemplar who embodies the widely emphasized virtues of courage, kindness, honesty, and integrity. Would they sneak around, opportunistically murdering innocent individuals in the name of reducing suffering? Walk past drowning children? Sabotage healthcare?</p><p>They most certainly would not act in such ways. After all, those widely emphasized virtues are highly antithetical to such acts of backstabbing, betrayal, deception, and the like.</p></blockquote><p>But a true negative utilitarian might not regard killing someone as backstabbing; rather, he would think his is being an agent of mercy, heroically protecting innocent people from the suffering of existence by providing them the sweet embrace of death.</p><p>Likewise, you suggest that deontology might protect us:</p><blockquote><p>For instance, deontology can entail a commitment to non-maleficence (“do no harm”), the golden rule (“treat others as you wish to be treated”), or respecting certain inviolable rights that apply universally to all individuals, such as the right to autonomy.</p></blockquote><p>But a negative deontologist would presumably have a different interpretation of these what should be the rules. Since there are no positive goods, painlessly killing a homeless person in her sleep wouldn't cause harm and hence not be forbidden. Similarly, since he thinks life is just gradations of suffering, a swift death would sound quite favourable to him, so treating others to the same would not be a big violation of the golden rule.</p><p>Similarly, your negative utilitarians, in their deliberations, seem to agree on a vision of society which does not include much negative utilitarian influence:</p><blockquote><p>Imagine a diverse set of people, endorsing a minimalist view of wellbeing, who deliberate on the moral principles governing their society. Would they endorse norms that allow callous acts like murder, passive bystanderism, or attempting to collapse the healthcare system? It seems doubtful that they would endorse the kind of chaotic and unsafe society where such unilateral choices were acceptable.</p></blockquote><p>If these people really wanted to agree on a set of rules to govern a society, I agree they wouldn't want to promote chaos. Instead, presumably they would focus on stockpiling enough cyanide to allow for a simultaneous mass suicide.</p><p>Similarly, you suggest that care ethics could protect us:</p><blockquote><p>A minimalist version of care ethics would naturally focus on anticipating and addressing the unmet needs of others, without necessarily assuming that their primary concern would be anything like minimizing personal suffering. Rather, it would plausibly involve attending and responding to others on their own terms, with sensitivity to their own goals and pursuits in life.<a href=\"https://forum.effectivealtruism.org/posts/Xx9oWdJDfisAQwDtT/varieties-of-minimalist-moral-views-against-absurd-acts#fn2f526ab7l1z\"><sup>[5]</sup></a>&nbsp;Thus, minimalist care ethics would likely oppose any acts that fail to respond to others in a caring way, such as acts of murder, betrayal, or being insensitive to the subjective perspectives of others.</p></blockquote><p>But again this basically relies on a conventional account of care ethics. The negative utilitarian, on the other hand, would presumably be primarily focused on anticipating and addressing the unmet needs of others for relief from suffering. The same reasons that made him reject conventional utilitarianism in favour of the negative kind would suggest that he should prioritise her unmet need for the cessation of pain. It's already the case that people will sometimes support and enable euthanasia for sick loved ones, but for most people this is only a small part of what caring means.&nbsp;</p><p>In the interests of brevity I will pause here, but I'm sure you can see the issue. In each example you suggest that follower of negative utilitarianism would resist the more absurd implications of NU because he would have various other moral commitments that temper his fervor. But it seems like this relies on a profound lack of moral curiousity on his part, of his not re-examining his other moral commitments. Each of these has its own negative flavour he could adopt, and the same reasons that made him endorse negative utilitarianism seem like they would also encourage negative versions of the other moral commitments, and hence not provide the moderating influence we might want.</p>", "parentCommentId": null, "user": {"username": "Larks"}}, {"_id": "h5pnKBGejpmSqKEvB", "postedAt": "2023-11-10T09:56:42.351Z", "postId": "Xx9oWdJDfisAQwDtT", "htmlBody": "<p>Greetings. :) This comment seems to concern a strongly NU-focused reading of the nonconsequentialist sections, which is understandable given that NU, particularly, its hedonistic version,&nbsp;<a href=\"https://www.utilitarianism.com/nu/nufaq\"><u>NHU</u></a>, is probably by far the most salient and well-known example of a minimalist moral view.</p><p>However, my post’s focus is much broader than that. The post doesn’t even mention NU except in the example given in footnote 2, and is never restricted to NHU (nor to NU of any kind, if the utilitarian part would entail a commitment to additive aggregation). For brevity, many examples were framed in terms of reducing suffering. Yet the points aren’t restricted to hedonistic views, as they would apply also to minimalist moral views with&nbsp;<a href=\"https://forum.effectivealtruism.org/posts/Xx9oWdJDfisAQwDtT/varieties-of-minimalist-moral-views-against-absurd-acts#Extra_experientialist_welfarist_axiologies\"><u>non-hedonistic</u></a> views of wellbeing. And if we consider only NHU, then the most relevant sections would be the ones on minimalist&nbsp;<a href=\"https://forum.effectivealtruism.org/posts/Xx9oWdJDfisAQwDtT/varieties-of-minimalist-moral-views-against-absurd-acts#Rule_consequentialism\"><u>rule</u></a> and&nbsp;<a href=\"https://forum.effectivealtruism.org/posts/Xx9oWdJDfisAQwDtT/varieties-of-minimalist-moral-views-against-absurd-acts#Multi_level_consequentialism__Relevant_for_all_minimalist_moral_views\"><u>multi-level</u></a> consequentialism.</p><p>The comment seems to assume that the minimalist versions of {virtue ethics / deontology / social contract theory / care ethics} would have their nonconsequentialist moral reasons grounded in NHU. Yet then they wouldn’t contain genuinely nonconsequentialist elements, but would rather be practical heuristics in the service of NHU. My main point there was that a minimalist moral view could endorse separate moral reasons against engaging in {vice, rights violations, breaking of norms, or uncaring responses}, independent of their effects on conscious experiences. To define the former in terms of the latter would seem to collapse back into welfarism.</p>", "parentCommentId": "PuCiGNDcNK3z2ytgs", "user": {"username": "Teo Ajantaival"}}]