[{"_id": "W3okPPwfKHH6LxkRx", "postedAt": "2024-03-25T09:24:12.078Z", "postId": "Xxo8r7SNXXPvWLmFj", "htmlBody": "<p>Hey EA Sweden team, really interesting post. Quick question: is there a link to your full budget somewhere? I am a bit unsure if $65k is like 50% or 5% of your current spend, and it's pretty hard to get a sense of cost effectiveness without knowing what the total expected spend is.</p>", "parentCommentId": null, "user": {"username": "Joey"}}, {"_id": "CMDyTPeSywnCHezqx", "postedAt": "2024-03-25T10:05:02.659Z", "postId": "Xxo8r7SNXXPvWLmFj", "htmlBody": "<p>Hi Joey! Our total budget for the year is $355k, so the mentioned funding gap constitutes 18% of the total budget. A rough breakdown of the expected costs:</p><ul><li>Staff: 60%</li><li>Office &amp; co-working space: 15%</li><li>Projects and community events: 10%</li><li>Operational and administrative costs: 12.5%</li><li>Other costs: 2.5%</li></ul>", "parentCommentId": "W3okPPwfKHH6LxkRx", "user": {"username": "Emil Wasteson"}}, {"_id": "4iKCf5goneDwguuXW", "postedAt": "2024-03-25T10:32:35.450Z", "postId": "Xxo8r7SNXXPvWLmFj", "htmlBody": "<p>Note that administrative and operational costs for the Employer of Record and Fiscal Sponsorship services we provide are included, but that certain events financed by EA Infrastructure Fund (e.g. a retreat for Nordics community builders and a conference for participants in the Swedish EA community) are excluded in the budget.&nbsp;</p>", "parentCommentId": "CMDyTPeSywnCHezqx", "user": {"username": "Emil Wasteson"}}, {"_id": "tbeNsPee53oerWbKm", "postedAt": "2024-03-25T13:45:50.148Z", "postId": "Xxo8r7SNXXPvWLmFj", "htmlBody": "<p><strong>Executive summary:</strong> EA Sweden made significant progress in 2023 towards building an engaged EA community in Sweden and supporting individuals and projects, but faces a €65,000 funding gap for its ambitious 2024 plans.</p><p><strong>Key points:</strong></p><ol><li>EA Sweden focuses on community building, supporting individuals' career impact, and supporting promising projects. In 2023 the Swedish EA community grew 23% to 642 members.</li><li>Key 2023 achievements include a successful EAGxNordics conference, expanded Nordic collaboration, increased career counseling and project support, and a new diversity strategy.</li><li>Areas for improvement in 2023 include gender diversity (38% women and non-binary) and lack of a robust outreach strategy.</li><li>2024 priorities are engaging more women and non-binary individuals, crafting a high-quality outreach strategy, scaling up project support, and increasing altruistic ambition.</li><li>EA Sweden faces a €65,000 funding gap for 2024 which limits its ability to scale high-impact activities and explore new projects. It is seeking additional funding.</li></ol><p>&nbsp;</p><p>&nbsp;</p><p><i>This comment was auto-generated by the EA Forum Team. Feel free to point out issues with this summary by replying to the comment, and</i><a href=\"https://forum.effectivealtruism.org/contact\"><i>&nbsp;<u>contact us</u></i></a><i> if you have feedback.</i></p>", "parentCommentId": null, "user": {"username": "SummaryBot"}}]