[{"_id": "agFKWNLbDAEXzxX44", "postedAt": "2022-11-02T00:04:01.589Z", "postId": "XyEKTDtfMH4DukhaF", "htmlBody": "<p>Thanks for this post, it’s helpful to step through the challenges and the state of the research. I’d make three observations:<br><br>1) Dwelling on what ‘lobbying success’ or ‘policy success’ means in detail might be relevant.</p><ul><li>In my on-the-ground experience (including being lobbied and lobbying) people rarely ask for what they want. They’re making an opening bid, and there’s a range of (hidden) outcomes that are still success criteria. If a lobbyist overtly asks for X and gets 1/2X or Y – you’d need insight into their actual strategy and their assessment of best case / worst case and most-likely case outcomes. Did they only want 1/2X and asked for X anticipating giving ground over time?<br>&nbsp;</li><li>Additionally, I’ve seen ‘policy success’ where a parliament passes a law that an interest group sought. The interest group then tends to move on to the next Bill. Meanwhile, executive government can ‘white-ant’ that law behind the scenes (never passing supporting regulations, not funding implementation, only doing the action for a year or two until people move on and then letting implementation fade into obscurity etc). That shouldn’t feel like success to EAs, but it might pass as success in a naïve study.&nbsp;</li></ul><p>&nbsp;</p><p>2) The lens of ‘neglectedness’ might be particularly relevant to how EAs want to engage in lobbying. The observation in the post that many issues have many organisations lobbying at them from different directions accords with my experience. It might be interesting to try and study the intensity of lobbying around a range of issues. In my experience (in Australia) there is a huge lobbying storm and public focus on a small number of high-profile issues, many issues have ‘the usual suspects’ come out (like a peak industry group etc), and other issues are of no apparent interest to anyone.&nbsp;</p><p>It might not be too difficult to research how lobbying effort is spread across the range of matters that could be lobbied for. I’m not a designer of research methodologies – but my bet would be that only 1-5% of legislation is ever mentioned in major media publications, and only a fraction of that would get sustained attention across multiple outlets. I’d guess in Australia that 50% of legislation is never mentioned anywhere in print media / internet outlets outside of government websites themselves. (These being accessible proxies for the conversations that are happening on the hill.) Perhaps if EAs target tail-end issues that align with EA priorities, we could find high-impact opportunities where we are the only voice and hence escape many of the challenges this post rightly highlights.&nbsp;</p><p>3) I like the Woll 2019 observation that: “[a] business can also have substantial structural power due to the popularity of its products with consumers. When a product is perceived as important by consumers, the line between a business's commercial activity and political activity becomes blurred. In this case, deliberate activity like lobbying may not be a useful way to think about political influence.”<br><br>This might be another useful way for EAs to think about political influence. That is, if EA issues are seen as popular with a segment of the public, we can blur the line between “EAs being passionate about X” and “intentional lobbying for X”. That might be another way for us to slide past the usual battlelines of lobbying.&nbsp;</p><p>Thanks again for the post.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Greg S"}}]