[{"_id": "vyvoyA4bXoXQAR4Dx", "postedAt": "2022-11-15T20:14:07.288Z", "postId": "YAsJCsvi4tBpCwuFB", "htmlBody": "<p>I disagree with lots of this, as I said privately before.<br><br>Yes, it would be great if funders donated everything upfront and had foundations manage the money. But that only works if the donors are liquid, or the funds can be donated as stock, often where the donor maintains voting control, for example, for startups. In other cases, many cases, it's reasonable to have them put in money as it is needed, and as it is committed. Yes, Dustin says that they have moved towards having lots of money controlled by Open Phil, but evidently that wasn't always the situation. That's fine.</p><p>And even if the Future Fund had cash to cover all its outstanding commitments as of the beginning of November (which I suspect they did not, given that at least a reasonable fraction of donations I know about were to be given over multiple years,) the reason they stopped giving out money had nothing to do with lack of cash on hand. The stopped because they legally, and morally, couldn't continue to donate money once they knew it might have been the product of fraud. So if they did what you suggest, and they were given money before it was committed... they still couldn't have done anything differently. Maybe they'd be able to pay it out in, optimistically, another decade, once the lawsuits are all settled. But that doesn't help now, and likely wouldn't change anything, since the funds would be taken FTX creditors.<br><br>The failure here wasn't the way the foundation was managed, it was the fraud.</p>", "parentCommentId": null, "user": {"username": "Davidmanheim"}}, {"_id": "JDHn3jrL2NrBspXk8", "postedAt": "2022-11-15T20:19:59.358Z", "postId": "YAsJCsvi4tBpCwuFB", "htmlBody": "<blockquote><p>Maybe they'd be able to pay it out in, optimistically, another decade, once the lawsuits are all settled.</p></blockquote><p>I don't think this is true. The clawbacks are likely to go back only <a href=\"https://forum.effectivealtruism.org/posts/o8B9kCkwteSqZg9zc/thoughts-on-legal-concerns-surrounding-the-ftx-situation#:~:text=of%20clawback%20processes.-,The%20first%20and%20most%20common%20(called%20a%20%E2%80%9Cpreference%20claim%E2%80%9D)%20target%20transactions%20that%20happened%20in%20the%2090%20days%20prior%20to%20the%20bankruptcy%20filing.%C2%A0,-Essentially%2C%20if%20you\">90 days</a>, so any funds that were in the Future Fund (/FTX Foundation) last year (as I say), and under independent control (as I say), would most likely be safe. Would it really take years for them to be unlocked?</p>", "parentCommentId": "vyvoyA4bXoXQAR4Dx", "user": {"username": "Greg_Colbourn"}}, {"_id": "tLaXeg3C7764dmy9T", "postedAt": "2022-11-15T20:31:51.124Z", "postId": "YAsJCsvi4tBpCwuFB", "htmlBody": "<p>I think you should ask a lawyer before guessing.<br><br>From by recollection working on similar cases - and IANAL, so this is informed guesswork, but I did work at the FTC on fraud cases for a summer - there's no way a judge would deny a request to freeze those funds pre-trial, and especially because of who controls the fund (a mistake, and a problem I think you're right about,) they'd need to prove the funds were not derived from the alleged fraud to get the freeze lifted. And the fraud allegation probably doesn't need to claim details about exact time frames, which would &nbsp;instead likely only come out at trial, after extensive review of the books.</p>", "parentCommentId": "JDHn3jrL2NrBspXk8", "user": {"username": "Davidmanheim"}}, {"_id": "tGJYvRj28dEZvvnjy", "postedAt": "2022-11-15T20:38:14.643Z", "postId": "YAsJCsvi4tBpCwuFB", "htmlBody": "<p>I mean the short answer to this is very simple: Because the people funding the foundation didn't want to (or couldn't) put their money into the foundation.</p><p>The more interesting question is why the FTX Foundation team were happy with this setup. It would be interesting to hear from them on this.</p>", "parentCommentId": null, "user": {"username": "Aleks_K"}}, {"_id": "XmsFgpk6rMx382gwd", "postedAt": "2022-11-15T20:40:12.728Z", "postId": "YAsJCsvi4tBpCwuFB", "htmlBody": "<p>Ok, but I'm saying that the situation we should've been in was that FTX/Alameda people (owners) should <strong>not</strong> have been in control of the funds (e.g. if they were &lt;50% of the board). Maybe it would still take a long time to establish the timeline for the fraud.</p>", "parentCommentId": "tLaXeg3C7764dmy9T", "user": {"username": "Greg_Colbourn"}}, {"_id": "e62jhu9xdbzjG44ya", "postedAt": "2022-11-16T00:40:01.318Z", "postId": "YAsJCsvi4tBpCwuFB", "htmlBody": "<p>It depends. What is your threat model? The answer could range from one day to six years.</p><p>One day: Yesterday, Megadonor Crypto was unquestionably solvent and transferred $100MM to Megadonor Foundation. Unfortunately, there was a massive non-insider hack the next day and Megadonor Crypto immediately became insolvent. The 90-day rule requires that the debtor be insolvent at the time of transfer, although it creates a rebuttable presumption that it was. See 11 USC 547(f).&nbsp;</p><p>Up to six years: Megadonor Ponzi was a clone on Bernie Madoff's operation and transferred $100MM. Because the Ponzi scheme is by definition insolvent and Megadonor Ponzi received no value for the transfer, this is a fraudulent conveyance unless the limited charitable safe harbor applies. Although the federal fraudulent conveyance rule in bankruptcy has a two-year limit, see 11 USC 548, a trustee may also use any analogous power under applicable state law (and some of them go back up to six years). See 11 USC 544.</p>", "parentCommentId": "JDHn3jrL2NrBspXk8", "user": {"username": "Jason"}}, {"_id": "eFBhtA9XaNpzqenTL", "postedAt": "2022-11-16T00:40:50.170Z", "postId": "YAsJCsvi4tBpCwuFB", "htmlBody": "<p>Just adding here that it is very common for foundations to receive stock, including in private companies, so liquidity is not the issue here. This would have done little to mitigate things given the fraud however, it’s not inconceivable that had FF had a smart CFO they would have suggested selling secondary at some point to reduce these risks. In 2020/2021 this would have been extremely easy. I don’t know the details here beyond what’s in the popular press, but simply want to note that there were tactics that could have been used to meaningfully reduce these risks (again, they would have had to cash some portion out pre fraud and at they would be in the identical position now if they had the stock but had not liquidated it).  Just putting my private equity hat on here - I am not a bankruptcy lawyer.</p>\n", "parentCommentId": "vyvoyA4bXoXQAR4Dx", "user": {"username": "Daedalus"}}, {"_id": "fKiFzKC8gMRKqzDnW", "postedAt": "2022-11-16T01:04:39.163Z", "postId": "YAsJCsvi4tBpCwuFB", "htmlBody": "<p>FTX and Alameda are corporations, and as far as I can tell had zero actual control of the FTX Foundation per se. Only natural persons were board members. Natural persons who were FTX / Alameda insiders controlled the FTX Foundation, although as far as I know their status as board members was <i>technically</i> unrelated to their status at FTX &nbsp;/ Alameda. It's a subtle but sometimes legally important difference.&nbsp;</p><p>I think where you're headed is that the associated charity shouldn't be an \"insider\" of the corporation, which creates additional legal risks. Unfortunately, the Bankruptcy Code provides no exhaustive definition of insider [11 USC 101(31)], and so I am not sure it follows that a 51% board overlap creates insider status or a 49% overlap negates it.</p>", "parentCommentId": "XmsFgpk6rMx382gwd", "user": {"username": "Jason"}}, {"_id": "zyzNRpmCNwJikPDGc", "postedAt": "2022-11-16T01:11:44.374Z", "postId": "YAsJCsvi4tBpCwuFB", "htmlBody": "<p>They didn't exactly have a lot of leverage here, so I wouldn't assume they were necessarily \"happy.\" The alternative was probably declining to serve as Foundation staff. Although there are some circumstances under which sservice would be unwise -- such as a concern that the money was procured by fraud -- I am not convinced that the funders' choice to fund on an pay-go basis rather than depositing several billion dollars up front is one of them.</p>", "parentCommentId": "tGJYvRj28dEZvvnjy", "user": {"username": "Jason"}}, {"_id": "EktEeKwJWwqNXqga9", "postedAt": "2022-11-16T02:07:03.972Z", "postId": "YAsJCsvi4tBpCwuFB", "htmlBody": "<p>Based on my read on the level of familiarity of governance within EA, I wouldn't blame FTX Foundation team too much on not being able to see further and not placing importance on the vulnerability of &nbsp;donors failing to deliver their commitments. &nbsp;</p><blockquote><p>Did anyone at the FTX Foundation or Future Fund, or others in advisory roles, press for this? A side benefit might’ve also been uncovering the fraud earlier and perhaps mitigating it somewhat.</p></blockquote><p>Fraud (as I have discussed in previous posts) is built to deceive, if no controls for detection were installed, one will not be able to like develop an investigative urge and start looking for unusual activities...</p>", "parentCommentId": null, "user": {"username": "Miguel"}}, {"_id": "uwmREnuFAYwCYtukP", "postedAt": "2022-11-16T02:09:16.952Z", "postId": "YAsJCsvi4tBpCwuFB", "htmlBody": "<p>I agree that these foundations should \"secure their bags\" much better than FTX Future Fund did. In fact, I think the EA community should be skeptical of pledges that don't include a substantial transfer of the funds in some way early on. When reporting how much a donor has pledged, perhaps we also ought to also note how much has actually been given. We're apparently just learning that we shouldn't count our chickens before they hatch, and I think we should find ways to withhold the social credit that large EA funders get until they've actually made good on the pledge.</p>", "parentCommentId": null, "user": {"username": "Marcus Rademacher"}}, {"_id": "9A5qsig586wcuZz55", "postedAt": "2022-11-16T08:36:45.937Z", "postId": "YAsJCsvi4tBpCwuFB", "htmlBody": "<p>Okay,  I think that's fair.  I would have preferred,  though,  if they would have been more transparent about this to the people the FTX Foundation had been supporting.</p>\n", "parentCommentId": "zyzNRpmCNwJikPDGc", "user": {"username": "Aleks_K"}}, {"_id": "yNj5b7vBfJb2DtcZT", "postedAt": "2022-11-16T09:32:53.708Z", "postId": "YAsJCsvi4tBpCwuFB", "htmlBody": "<blockquote><p>Unfortunately, the Bankruptcy Code provides no exhaustive definition of insider [11 USC 101(31)], and so I am not sure it follows that a 51% board overlap creates insider status or a 49% overlap negates it.</p></blockquote><p>Interesting, and surprising! I don't see how the 49% could make it insider, given that the 51% could at any time decide to unilaterally set up another foundation and transfer the assets there. Suppose that in fact happened, 2 years went by, and then the insiders (original 49%) committed fraud/went bankrupt. Surely clawbacks couldn't possibly apply to the new foundation in that case?</p>", "parentCommentId": "fKiFzKC8gMRKqzDnW", "user": {"username": "Greg_Colbourn"}}, {"_id": "9ec9SPnMBAuDGvmaM", "postedAt": "2022-11-16T09:52:10.032Z", "postId": "YAsJCsvi4tBpCwuFB", "htmlBody": "<p>Regarding the point about corporations vs natural persons, I've edited my above comment to read \"FTX/Alameda people (owners)\", and the post to read \"those who owned/controlled FTX/Alameda\".</p>", "parentCommentId": "fKiFzKC8gMRKqzDnW", "user": {"username": "Greg_Colbourn"}}, {"_id": "gs8WnmoDtESthzCmH", "postedAt": "2022-11-16T10:40:05.231Z", "postId": "YAsJCsvi4tBpCwuFB", "htmlBody": "<p>Yeah, them not being in charge would probably be helpful once things are resolved, but it wouldn't change the legal responsibility for directors not to distribute funds once they have reason to believe the funds had an illegitimate source.</p>", "parentCommentId": "XmsFgpk6rMx382gwd", "user": {"username": "Davidmanheim"}}, {"_id": "GdrxJrdaTeHuGedAC", "postedAt": "2022-11-16T10:42:36.780Z", "postId": "YAsJCsvi4tBpCwuFB", "htmlBody": "<blockquote><p>\"it is very common for foundations to receive stock, including in private companies,\"</p></blockquote><p>&nbsp;</p><p>From the parent post: \"that only works if the donors are liquid, or the funds can be donated as stock.\"<br><br>In this case, there was no stock to distribute, as they were a private company.</p>", "parentCommentId": "eFBhtA9XaNpzqenTL", "user": {"username": "Davidmanheim"}}, {"_id": "2Dk4tHgydhMjvQngJ", "postedAt": "2022-11-16T10:54:12.527Z", "postId": "YAsJCsvi4tBpCwuFB", "htmlBody": "<p>True, but there was a lot of interest in FTX from Venture Capital last year. It might've been possible for the foundation to find buyers for any share of FTX they were given (e.g a <a href=\"https://fundersclub.com/learn/safe-primer/safe-primer/safe/\">SAFE</a> or something), although I'm not sure how this would work in practice.</p>", "parentCommentId": "GdrxJrdaTeHuGedAC", "user": {"username": "Greg_Colbourn"}}, {"_id": "RYuhA6JkLkEeegsTq", "postedAt": "2022-11-16T11:21:46.118Z", "postId": "YAsJCsvi4tBpCwuFB", "htmlBody": "<p>Either way, in a fraud case it seems likely that - until these technical distinctions about control and source of funds are worked out in court - the court would have frozen the assets of the charity, given that it was explicitly created to hand out FTX funds, either at the request of the government, or of the civil litigants, depending on the case.<br><br>Is that correct?</p>", "parentCommentId": "fKiFzKC8gMRKqzDnW", "user": {"username": "Davidmanheim"}}, {"_id": "KE3e8q8icsbtAnapY", "postedAt": "2022-11-16T12:08:00.706Z", "postId": "YAsJCsvi4tBpCwuFB", "htmlBody": "<p>I'm claiming it would generally not work in practice. (There's a reason that founders pledge suggests pledging money for after you exit, not trying to donate earlier than that.)</p>", "parentCommentId": "2Dk4tHgydhMjvQngJ", "user": {"username": "Davidmanheim"}}, {"_id": "TcfsTcoJECTM7GWjF", "postedAt": "2022-11-16T15:50:44.945Z", "postId": "YAsJCsvi4tBpCwuFB", "htmlBody": "<blockquote><p><a href=\"https://forum.effectivealtruism.org/posts/SP3Hkas3jo6i2cmqb/who-s-at-fault-for-ftx-s-wrongdoing#:~:text=The%20amount%20that%20FTX%20spent%20on%20e%2Dsports%20naming%20rights%20for%20TSM%20was%20greater%20than%20everything%20they%20donated%20to%20effective%20altruism.\">The amount that FTX spent on e-sports naming rights for TSM was greater than everything they donated to effective altruism.</a></p></blockquote><p>I guess this is one answer to the question of why there was no bag secured for EA - Sam, Caroline, Gary and Nishad just didn't care <i>that much</i> about EA? (Although I imagine they would've argued at the time that the naming rights were a means to growing the pie for EA even bigger, and therefore positive EV, or something.)</p>", "parentCommentId": null, "user": {"username": "Greg_Colbourn"}}, {"_id": "8FRJZy9oxN5JkGrKB", "postedAt": "2022-11-16T18:59:39.121Z", "postId": "YAsJCsvi4tBpCwuFB", "htmlBody": "<blockquote>\n<p>As I understand it, OpenPhil has a few $B that is theirs[5], under independent legal control (i.e. separate from Moskovitz and Tuna, who, whilst being board members, do not have unilateral control of the funds; they make up 2/5 of the board). ... Edit: the Good Ventures Foundation (who Open Phil recommends their grants to) had &gt;$3bn in June 2020</p>\n</blockquote>\n<p>The GoodVentures board is three people, two of which are Moskovitz and Tuna: <a href=\"https://www.goodventures.org/about-us/governance\">https://www.goodventures.org/about-us/governance</a></p>\n<p>(Which is not surprising: it is a foundation to give away their money)</p>\n", "parentCommentId": null, "user": {"username": "Jeff_Kaufman"}}, {"_id": "YdLvHxHFN64a35pjf", "postedAt": "2022-11-16T19:04:54.630Z", "postId": "YAsJCsvi4tBpCwuFB", "htmlBody": "<p>Ah, ok. Maybe more needs to be done to secure OpenPhil's bag in that case!</p><p>EDIT: I've added this to the post:</p><blockquote><p>[Added 17Nov: actually Good Ventures, which sends out the grants recommended by OpenPhil, is <a href=\"https://www.goodventures.org/about-us/governance\">2/3 controlled by Moskovitz and Tuna</a><a href=\"https://forum.effectivealtruism.org/posts/YAsJCsvi4tBpCwuFB/why-didn-t-the-ftx-foundation-secure-its-bag#fnwkfpp0r7eu8\"><sup>[6]</sup></a>. Perhaps more needs to be done to secure OpenPhil's bag?]</p></blockquote>", "parentCommentId": "8FRJZy9oxN5JkGrKB", "user": {"username": "Greg_Colbourn"}}, {"_id": "ta3DgJ4MaZ8PzdEGM", "postedAt": "2022-11-16T19:44:38.200Z", "postId": "YAsJCsvi4tBpCwuFB", "htmlBody": "<p>I think there are circumstances in which the identity of the board members would make a difference as to the availability of this relief. &nbsp;However, in the event there is strong evidence of fraud and reason to think the funds could be clawed back, there's a good chance you could get the injunction either way.&nbsp;</p><p>The other possible relief -- which might be more of a state-law thing -- would be a requirement that the nonprofit replace its board members, at least on an interim basis. The NY AG's office obtained relief of that nature in a well-publicized 2019 case against a very <a href=\"https://ag.ny.gov/press-release/2019/ag-james-secures-court-order-against-donald-j-trump-trump-children-and-trump\">well-known public figure's</a> foundation.</p>", "parentCommentId": "RYuhA6JkLkEeegsTq", "user": {"username": "Jason"}}, {"_id": "GftwD2c4XjgyaGn4d", "postedAt": "2022-11-16T20:23:34.818Z", "postId": "YAsJCsvi4tBpCwuFB", "htmlBody": "<p>As for insider status -- at least in the Ninth Circuit, an entity who is not automatically an insider is considered one if (1) the closeness of its relationship with the debtor is comparable to that of the enumerated insider classifications in the Bankruptcy Code; and (2) the relevant transaction is negotiated at less than arm’s length.</p><p>If the entity conducting the transfer was solvent and the money was clean at the time of transfer, then the nonprofit should be in the clear. Doesn't matter if the donor (or the donor's officers in their capacity as such) <i>later </i>committed fraud, or the donor <i>later </i>became insolvent. If potential taint exists, it is based on the time of transfer.</p><p>This is generally true even if the donor's officers are on the board of the nonprofit. There's no general legal basis of which I am aware to hold a nonprofit financially responsible for the criminal or fraudulent actions of its directors if those were (1) outside the scope of the directors' work with the nonprofit and (2) not the subject of tort liability for another reason.</p><p>Likewise, if the entity conducting the transfer was insolvent, then the fact that the nonprofit was wholly independent may offer limited protection to the nonprofit. Generally, to get protection, there needs to be an exchange of reasonably equivalent value.</p><p>Insider status does have relevance -- for example, the 90-day period for clawing back preferences under 11 USC 547 is extended to one year under 11 USC 547(b)(4)(B). However, even then, if the insider transferee transfers to a non-insider, you can only go after the non-insider if the initial transfer was made within 90 days of the filing. See 11 USC 550(c). So while it is definitely better for the nonprofit to be a non-insider, the significance may not be as great as one might think. I'm not aware of any clear relevance to the FTX case, although I haven't thought about it that much.</p>", "parentCommentId": "yNj5b7vBfJb2DtcZT", "user": {"username": "Jason"}}, {"_id": "TmySEmXd6yQjuqCjK", "postedAt": "2022-11-17T03:28:56.141Z", "postId": "YAsJCsvi4tBpCwuFB", "htmlBody": "<p>I'm sorry this is not correct. Private companies have stock, it is just not publicly traded. I personally own stock in a number of private companies, as do funds I help manage. During or in between financing events, it is customary for existing holders of stock or options to sell on the secondary market, either to incoming investors or third parties. In 2020/2021, while the venture and tech markets were hot, these transactions were extremely common. Secondary shares are often sold at a discount to market, which over the past two years were very modest. The idea that it was impossible to generate liquidity is simply incorrect and a strategic CFO could have pointed that out.&nbsp;</p>", "parentCommentId": "GdrxJrdaTeHuGedAC", "user": {"username": "Daedalus"}}, {"_id": "iLhd9R7JXTz2oM8Ai", "postedAt": "2022-11-17T03:43:58.080Z", "postId": "YAsJCsvi4tBpCwuFB", "htmlBody": "<p>There is an established mechanism for doing this called selling shares into the secondary market. &nbsp;From Carta:&nbsp;</p><blockquote><p>Between 2012 and 2021, the global market for venture secondary deals grew <a href=\"https://www.industryventures.com/insight/how-big-is-the-secondary-market-for-venture-capital-an-updated-view-to-a-130b-market/\"><u>from $13 billion to $60 billion</u></a>. This growth happened in part because the primary market for venture capital also grew: Over the same span, annual global venture investment rose from just over $50 billion <a href=\"https://news.crunchbase.com/business/global-vc-funding-unicorns-2021-monthly-recap/\"><u>to well north of $600 billion</u></a>. This growth culminated in a <a href=\"https://carta.com/blog/state-of-private-markets-report-q4-2021/\"><u>record-setting 2021</u></a>.&nbsp;</p></blockquote><p><a href=\"https://carta.com/blog/venture-capital-secondary-market/\">https://carta.com/blog/venture-capital-secondary-market/</a>&nbsp;</p>", "parentCommentId": "KE3e8q8icsbtAnapY", "user": {"username": "Daedalus"}}, {"_id": "4oPWC3Rprnnau6C6W", "postedAt": "2022-11-17T09:42:27.821Z", "postId": "YAsJCsvi4tBpCwuFB", "htmlBody": "<p>Thanks, I've added this to the post:&nbsp;</p><blockquote><p>[Added 17Nov: the selling of private equity, e.g. in FTX, on the secondary market seems like it was <a href=\"https://forum.effectivealtruism.org/posts/YAsJCsvi4tBpCwuFB/why-didn-t-the-ftx-foundation-secure-its-bag?commentId=iLhd9R7JXTz2oM8Ai\">quite possible in 2021</a>. It is a tragedy that this wasn't done.]</p></blockquote>", "parentCommentId": "iLhd9R7JXTz2oM8Ai", "user": {"username": "Greg_Colbourn"}}, {"_id": "hCejG42StPxpccuoA", "postedAt": "2022-11-17T09:48:10.922Z", "postId": "YAsJCsvi4tBpCwuFB", "htmlBody": "<p>For the disagreement voters: I'm guessing your disagreement is something along the lines of \"it's their money, they should be in control of where it goes\". Yes that's true to some extent, but what I'm saying is that if their goal is doing (the most) good, entrusting it in others' hands to disburse is more important, from the point of view of ensuring that the funds do in fact get donated (e.g. to protect against bankruptcy risk and clawbacks etc). And they already do ~90% of that, by deferring to OpenPhil's judgement for the vast majority of their grantmaking. Moskovitz even says of himself that he's \"<a href=\"https://twitter.com/moskov/status/1579114423083741189\">basically just dumb money</a>\".</p>", "parentCommentId": "YdLvHxHFN64a35pjf", "user": {"username": "Greg_Colbourn"}}, {"_id": "LpP8EqMJAQwoEibYC", "postedAt": "2022-11-17T09:53:18.378Z", "postId": "YAsJCsvi4tBpCwuFB", "htmlBody": "<p>I didn't claim that it was impossible to generate liquidity, but it's not the \"very common\" thing of donating stock which was suggested.<br><br>I'm aware that there is ownership stake in private companies which can be transferred - that's not the same as shares. &nbsp;Insider deals involving dilution and sales are subject to investor compacts, and I don't know that SBF would have been able to do this. Even if he could, they'd need to sell the stake, which can be a problem - you can't sell non-traded stake in a company to a non-qualified investor. &nbsp;So it's not at all as simple as you're implying.</p>", "parentCommentId": "TmySEmXd6yQjuqCjK", "user": {"username": "Davidmanheim"}}, {"_id": "B8ZHW3Aax8YemZFzF", "postedAt": "2022-11-17T10:02:55.770Z", "postId": "YAsJCsvi4tBpCwuFB", "htmlBody": "<p>What do you mean by \"non-qualified investor\"? Do you need to be more than a simple <a href=\"https://www.investopedia.com/terms/a/accreditedinvestor.asp\">accredited investor</a>? (for which anyone in the market would be anyway)</p>", "parentCommentId": "LpP8EqMJAQwoEibYC", "user": {"username": "Greg_Colbourn"}}, {"_id": "EuSonQKahzpwQvxnW", "postedAt": "2022-11-17T11:28:44.956Z", "postId": "YAsJCsvi4tBpCwuFB", "htmlBody": "<p><a href=\"https://www.peoplescapitalgroup.com/qualified-investor-vs-accredited-investor/\">It's complicated</a>, and I don't know the exact rules, but I think accredited is enough in this case.</p>", "parentCommentId": "B8ZHW3Aax8YemZFzF", "user": {"username": "Davidmanheim"}}, {"_id": "mQfFoWXhJ7GuLgr2G", "postedAt": "2022-11-17T11:52:13.767Z", "postId": "YAsJCsvi4tBpCwuFB", "htmlBody": "<p>There are huge private equity firms that focus on buying venture secondaries. No one is talking about selling to individuals. There is also enormous demand for these, especially from firms unable to get into deals with primary capital. FTX raised far less than they could have in the 2019-2021 market to limit dilution, which is a totally reasonable strategy. The demand for exposure to FTX surely far outstripped the ‘supply’.</p>\n<p>All I’m saying is that as a professional investor this is extremely common and uncomplicated, especially for hot venture companies.  I have friends close friends who took tens of millions off the table in 21 through secondaries in far less exciting and earlier stage businesses. On if my neighbors works  at StepStone and entirely focused on venture secondaries.</p>\n<p>My broader actual point was this: I don’t blame Will or Nick or any of the FF people for this - this stuff is super niche financial markets minutia. My broader point/concern is around governance, financial controls, and funding strategy at EA orgs (looking in from the outside and reading a few case reports). If FF had a CFO they should/would have flagged the concentration risk and developed some proposals immediately. At the most basic level I just want you guys to hire some good finance people!</p>\n", "parentCommentId": "EuSonQKahzpwQvxnW", "user": {"username": "Daedalus"}}, {"_id": "ggSGQ9aTdnNcfTg8h", "postedAt": "2022-11-17T12:31:00.565Z", "postId": "YAsJCsvi4tBpCwuFB", "htmlBody": "<p>Fully agreed.</p>", "parentCommentId": "mQfFoWXhJ7GuLgr2G", "user": {"username": "Davidmanheim"}}, {"_id": "aFYPRPDxC8Xrzxm7c", "postedAt": "2022-11-18T21:00:54.187Z", "postId": "YAsJCsvi4tBpCwuFB", "htmlBody": "<blockquote><p>When FTX raised $420 million from an array of big-name investors in October last year, the cryptocurrency exchange said the money would help grow the business, improve user experience and allow it to engage more with regulators.</p><p>Left unmentioned was that nearly three-quarters of the money, $300 million, went instead to FTX founder Sam Bankman-Fried, who sold some of his personal stake in the company, according to FTX financial records reviewed by The Wall Street Journal and people familiar with the transaction.</p></blockquote><p>&nbsp;</p><p>https://www.wsj.com/articles/ftxs-sam-bankman-fried-cashed-out-300-million-during-funding-spree-11668799774?mod=hp_lead_pos4</p>", "parentCommentId": "TmySEmXd6yQjuqCjK", "user": {"username": "Daedalus"}}]