[{"_id": "kMaquw7dY7bQzdQh3", "postedAt": "2022-09-11T13:44:46.488Z", "postId": "YauYvwWkF3KdtBPxo", "htmlBody": "<p>I'm curious how this is affected by population projections. Given that the number of people on earth is going to increase, the main question is where these additional people will live:</p>\n<ul>\n<li>If density won't rise, that means they'll live in new settlements or expansions of old ones</li>\n<li>And that means some area is taken, whether it's natural, agricultural, industrial etc.</li>\n<li>You talked about externalities created by living in a denser city, but not about ones created by living in a rural area, which I think are negative and pretty big, e.g.\n<ul>\n<li>Transportation costs for goods</li>\n<li>Land conversion, as I mentioned before</li>\n<li>Transportation to get services (schooling, medicine, etc.)</li>\n<li>Additional infrastracture</li>\n</ul>\n</li>\n</ul>\n<p>Some other thoughts:</p>\n<ol>\n<li>Since population growth and density vary by location, the effectiveness of doing something about them should vary too.</li>\n<li>There could be negative side effects of trying to increase density without putting enough thought into it, like:</li>\n</ol>\n<ul>\n<li>Conversion of natural areas <em>inside</em> cities (very relevant to my own city of Haifa, which for some reason insists on keeping building new neighborhoods on natural areas)</li>\n<li>Badly designed neighborhoods that nobody wants to live in</li>\n</ul>\n<ol start=\"3\">\n<li>Some environmental orgs encourage higher density (at least some activists I encountered here in Israel say \"A nature lover lives in the city\"). On the other hand, it seems that some others do the opposite, maybe inadvertedly.</li>\n</ol>\n", "parentCommentId": null, "user": {"username": "Guy Raveh"}}, {"_id": "Edg6FDvgucmBmyPBr", "postedAt": "2022-09-11T17:24:16.802Z", "postId": "YauYvwWkF3KdtBPxo", "htmlBody": "<p>OpenPhil is already pretty hip to the cause of YIMBYism! &nbsp;See the <a href=\"https://www.openphilanthropy.org/focus/land-use-reform/\">\"land use reform\" section</a> of their US policy focus areas:</p><blockquote><p>Local laws often prohibit the construction of dense new housing, leading to higher housing prices, especially in a few large high-wage metropolitan areas (e.g., New York, Boston, San Francisco, Seattle, and Washington D.C.). More permissive policy could contribute to both affordable housing and the continued growth of centers of economic activity, allowing more people to access high-wage jobs and encouraging economic growth through returns to agglomeration. Working toward more permissive policy in those key regions from a public-interest perspective (as opposed to lobbying for specific developments) appears neglected considering the significant potential gains.</p></blockquote><p>However, they haven't made a huge number of donations to YIMBY causes (\"only\" $7 million of grants!), I suspect because they feel that the benefits of YIMBYism, although large, don't quite measure up to other even-more-effective areas. &nbsp;Perhaps also because in recent years, YIMBYism seems like it has attracted more attention &nbsp;and created its own successful ecosystem of charities and interest groups (at least in <a href=\"https://darrellowens.substack.com/p/yimby-triumph-in-california\">a few places</a>) -- OpenPhil might be figuring that the YIMBYs are already on-track for eventual victory.</p><p>I personally am a huge YIMBY (I literally have a copy of <a href=\"https://beyondchron.org/wp-content/uploads/2018/09/1-5.jpg\">this sign</a> outside my house), and I also think that EA should be paying more attention to the broader general cause area of \"<a href=\"https://80000hours.org/problem-profiles/improving-institutional-decision-making/\">improving institutional decisionmaking</a>\" and boosting <a href=\"https://marginalrevolution.com/marginalrevolution/2020/01/what-libertarianism-has-become-and-will-become-state-capacity-libertarianism.html\">state capacity</a> / \"<a href=\"https://equilibriabook.com/\">civilizational adequacy</a>\" in the developed world, of which YIMBYism is one part. &nbsp;But I can see where OpenPhil is coming from.</p><p>Some EA-adjacent groups are more focused on land use and fixing problems in the developed world -- see for instance <a href=\"https://www.moreisdifferent.com/2021/11/19/map-of-progress-studies\">progress studies</a> and its \"<a href=\"https://www.worksinprogress.co/issue/the-housing-theory-of-everything/\">Housing Theory of Everything</a>\", or the EA-adjacent political commentator <a href=\"https://www.slowboring.com/\">Matt Yglesias</a> who was involved in helping launch the modern YIMBY movement some years ago.</p>", "parentCommentId": null, "user": {"username": "Jackson Wagner"}}, {"_id": "dtpWmE8ZcQJLsigtQ", "postedAt": "2022-09-11T19:11:00.173Z", "postId": "YauYvwWkF3KdtBPxo", "htmlBody": "<p>Possibly of interest: discussion of the potential benefits of crime reduction for improving density <a href=\"https://forum.effectivealtruism.org/posts/cPDptuFTiCLr8XXkL\">here</a>.</p>", "parentCommentId": null, "user": {"username": "Larks"}}]