[{"_id": "uruJriyv7Q8ppTsrZ", "postedAt": "2015-08-17T00:28:56.911Z", "postId": "Ybapay39nm2CtwqJv", "htmlBody": "<p>Neat, thanks for the updates.</p>\n", "parentCommentId": null, "user": {"username": "RyanCarey"}}, {"_id": "aRja6mZyhPq7cWekm", "postedAt": "2015-08-18T12:35:36.561Z", "postId": "Ybapay39nm2CtwqJv", "htmlBody": "<p>looks like you're doing fantastic work! Very interested to see what comes out of the legacy exploration.</p>\n<p>In terms of 'the thing that we think is most effective to fund to generate funds for givewell recs that is scalable' at the moment - what is your view? Or is the answer 'charity science'? Is there option for funders to give to one particularly effective scalable activity within your portfolio?</p>\n", "parentCommentId": null, "user": {"username": "tomstocker"}}, {"_id": "xtEZjnwTEL2XNeGah", "postedAt": "2015-08-18T12:37:34.867Z", "postId": "Ybapay39nm2CtwqJv", "htmlBody": "<p>How do you think about the information hazard of publishing your results (that they'll become the new chugger method for less effective orgs) against the benefits of making them publicly available?</p>\n", "parentCommentId": null, "user": {"username": "tomstocker"}}, {"_id": "teZv4MZQEkTSTPNKP", "postedAt": "2015-08-18T13:49:56.940Z", "postId": "Ybapay39nm2CtwqJv", "htmlBody": "<p>When writing a will last year (through quite a basic legal-and- will-writing service), I encountered a potential serious pitfall for people writing unusual wills. One of the legacies I wanted to leave was larger than they expected. They had a maximum £ value for specific legacies, and wen I said I wanted to leave a bigger amount they cautioned me that it was likely to be overturned if legally challenged because 'nobody would expect you meant that'. I've heard similar stories from solicitors (eg a will written in the UK was overturned because the court ruled the parents would not have meant to leave the majority of their estate to the child who was better off. They did: they asked him to use the monety help the other child who was not good at handling finances, but the court reversed their legacies). One of the reasons to have a solicitor look over your will is that they challenge and confirm unusual clauses, which makes them harder to challenge when you die. </p>\n<p>All of which is to say: if you are seeking to raise funds via wills, or intended to leave a legacy that would count as unusual in normal practice, than the less formal legal input you have had the more vulnerable it will be to challenge. It cost us £99 for a joint will writing package, which is a reasonable insurance policy to ensure our estates are donated as we wish. </p>\n", "parentCommentId": null, "user": {"username": "Bernadette_Young"}}, {"_id": "LNc5Pd9anY9R78qh5", "postedAt": "2015-08-18T14:37:48.607Z", "postId": "Ybapay39nm2CtwqJv", "htmlBody": "<p>Sorry - its really clear on the website. Like the layout!</p>\n", "parentCommentId": "aRja6mZyhPq7cWekm", "user": {"username": "tomstocker"}}, {"_id": "GyLEHvpEB7GsJrgGu", "postedAt": "2015-08-18T14:42:01.508Z", "postId": "Ybapay39nm2CtwqJv", "htmlBody": "<p>There's been a recent legal update here making it even harder to leave a legacy in a particular way in the UK <a href=\"http://www.bbc.co.uk/news/uk-england-beds-bucks-herts-33684937\">woman wins inheritance from estranged mother</a></p>\n", "parentCommentId": "teZv4MZQEkTSTPNKP", "user": {"username": "tomstocker"}}, {"_id": "zx4adEcrxbSQiJMPN", "postedAt": "2015-08-18T22:00:12.765Z", "postId": "Ybapay39nm2CtwqJv", "htmlBody": "<p>Thanks Tom, will take that into account!</p>\n", "parentCommentId": "GyLEHvpEB7GsJrgGu", "user": {"username": "Tom_Ash"}}, {"_id": "cNMCEkiqE7tqfk9GB", "postedAt": "2015-08-18T22:09:28.521Z", "postId": "Ybapay39nm2CtwqJv", "htmlBody": "<p>Thanks Bernadette, I'll try to take that into account! Did you find a solution?</p>\n<p>I point to ways to find cheap lawyers (and free services in the UK) in the <a href=\"http://effective-altruism.com/ea/a7/how_to_leave_money_to_charity_in_your_will_a/\">current version of the will-writing guide</a>. I'd love to hear about other options for this.</p>\n", "parentCommentId": "teZv4MZQEkTSTPNKP", "user": {"username": "Tom_Ash"}}, {"_id": "D6sB3WmpiWoZ8E6nv", "postedAt": "2015-08-19T07:24:24.813Z", "postId": "Ybapay39nm2CtwqJv", "htmlBody": "<p>We have considered this hazard but currently do not think we get much non-EA traffic to our fundraising. Additionally I am not sure how much non-effective charity would benefit from the info (due to external validity concerns). If those factors were to change in the future we would update accordingly though.</p>\n", "parentCommentId": "xtEZjnwTEL2XNeGah", "user": {"username": "Joey"}}, {"_id": "8n4qWZXDTqPqWgzqM", "postedAt": "2015-08-19T08:36:21.405Z", "postId": "Ybapay39nm2CtwqJv", "htmlBody": "<p>One option you have already probably thought of, is for people wanting to read it to either give a significant donation through your site to a givewell rec or whatever, or demonstrate in some other way their committment. If they're giving regularly anyway this wont be an issue. The fear I have is that once it gets known about among fundraising industry you can't claw it back + advantage is gone, all the hard work you've done gone. But I'm sure you have a <em>much</em> better view of all this than I do sat at a computer across the Atlantic! Keep up the good work, its really interesting reading!</p>\n", "parentCommentId": "D6sB3WmpiWoZ8E6nv", "user": {"username": "tomstocker"}}, {"_id": "epLEJ9BmLJuh3ZPqy", "postedAt": "2015-08-19T08:38:57.549Z", "postId": "Ybapay39nm2CtwqJv", "htmlBody": "<p>External validity stuff / information hazard definitely only applies to a subset of the things you've explored currently, but I expect you to find fundraising strategies that do draw on non-EA resources more heavily and at more scale, and when that happens its a matter of time before that strategy is a victim of its own success?</p>\n<p>One option you have already probably thought of, is for people wanting to read it to either give a significant donation through your site to a givewell rec or whatever, or demonstrate in some other way their commitment. If they're giving regularly anyway this wont be an issue.</p>\n", "parentCommentId": "D6sB3WmpiWoZ8E6nv", "user": {"username": "tomstocker"}}, {"_id": "3RmcHT6AQqQyL8y6S", "postedAt": "2015-08-19T19:55:51.223Z", "postId": "Ybapay39nm2CtwqJv", "htmlBody": "<p>Yes, but a very specific one. After our experience I would generally recommend getting a solicitor to write your will. </p>\n", "parentCommentId": "cNMCEkiqE7tqfk9GB", "user": {"username": "Bernadette_Young"}}]