[{"_id": "9wPbi84EpDdwA4cf5", "postedAt": "2023-12-10T10:31:52.639Z", "postId": "YC3Mvw2xNtpKxR5sK", "htmlBody": "<p>What a great resource, thanks for putting it together!</p><p>Opinionated lists like this feel significantly more useful than comprehensive but unordered lists of relevant resources, because: (i) for most literatures, you're likely to get most of all the good insights from reading a small standout minority of everything written; and (ii) it's typically often not obvious to an outsider which resources are best in this respect. I hadn't heard of many of the books you rate highly.</p><p>Incidentally: consider reformatting the papers to not be headers? It makes the navigation bar feel cluttered to me.</p>", "parentCommentId": null, "user": {"username": "finm"}}, {"_id": "im8k3mjNRoaLFbN34", "postedAt": "2023-12-10T11:42:51.728Z", "postId": "YC3Mvw2xNtpKxR5sK", "htmlBody": "<p>Thanks for the support, Fin! I definitely agree with you, and I hope this way people can get most of the bang for their buck and save their research time. This topic is greatly time-inefficient, just because it's very broad and interdisciplinary, and there was no clear initial indication of what's good and what's not. So I think reading from either the \"TL;DR / Recommended Reading Order\", or some of the \"Five Star\" or \"Four Star\" books, or the \"Worthwhile Articles\" should be more than enough for the interest of EAs. The rest are more for completeness' sake.</p><p>Hopefully I was able to highlight some hidden gems. For example, Hanno Sauer's \"Moral Teleology\", Victor Kumar's \"A Better Ape\" and Philip Kitcher \"Moral Progress\" have flown under people's radar, but they're really good recent contributions. It's a literature that has grown a bit in the past five years.</p><p>Sorry for the headers thing. That was never my intention, I just didn't know putting something in Bold made it a header. I've fixed it now.</p>", "parentCommentId": "9wPbi84EpDdwA4cf5", "user": {"username": "rafaruizdelira"}}, {"_id": "yfCAFXsoghELubztA", "postedAt": "2023-12-10T12:27:16.681Z", "postId": "YC3Mvw2xNtpKxR5sK", "htmlBody": "<p>This is a really interesting resource; inspired me to take Kitcher off the bookshelf. Looking forward to part 2.</p><p>(Btw, small typo: word missing in ZFG's thesis title)</p>", "parentCommentId": null, "user": {"username": "Ben Stevenson"}}, {"_id": "fWEkuWY2mqGAmZRFE", "postedAt": "2023-12-10T12:37:04.586Z", "postId": "YC3Mvw2xNtpKxR5sK", "htmlBody": "<p>I hope you find it Kitcher's book worthwhile read! I always learn something from him.</p><p>(Typo fixed!)</p>", "parentCommentId": "yfCAFXsoghELubztA", "user": {"username": "rafaruizdelira"}}, {"_id": "S6xC6jpMQqvyFPjPZ", "postedAt": "2023-12-10T14:35:28.290Z", "postId": "YC3Mvw2xNtpKxR5sK", "htmlBody": "<p>Nice work!</p><p>Re: the unreadability of Parfit's Triple Theory, <a href=\"https://rychappell.substack.com/p/parfits-triple-theory\">my overview here</a> might provide some helpful background.</p>", "parentCommentId": null, "user": {"username": "RYC"}}, {"_id": "hsLRmXqnJ9cinpYYw", "postedAt": "2023-12-11T13:58:57.479Z", "postId": "YC3Mvw2xNtpKxR5sK", "htmlBody": "<p><strong>Executive summary: </strong>The post provides an extensive bibliography review and commentary on the literature regarding moral progress, covering key books, articles, and perspectives from effective altruists.</p><p><strong>Key points:</strong></p><ol><li>Buchanan and Powell's The Evolution of Moral Progress (2018) and Hanno Sauer's Moral Teleology (2023) offer compelling theories, but have limitations regarding mechanisms and scope of moral progress.</li><li>Historical declines in violence per Pinker and rises in standards of living per Galor provide empirical backing for progress, albeit with caveats around risks.</li><li>Cultural evolutionists like Henrich shed light on how information flows enable moral norms and cooperation, but overemphasize some factors.</li><li>Evaluations are given on dozens of other relevant books and articles, categorized by quality and relevance.</li><li>An account is provided of writing by effective altruists on progress, including moral circle expansion, economic growth, social movements, and institutional reform.</li><li>Guiding questions are laid out regarding defining moral progress, locating it within philosophy, developing a substantive conception of progress, predicting and securing progress, and more.</li><li>Justification is given for the author's personal fit and motivation for researching moral progress.</li></ol><p>&nbsp;</p><p>&nbsp;</p><p><i>This comment was auto-generated by the EA Forum Team. Feel free to point out issues with this summary by replying to the comment, and</i><a href=\"https://forum.effectivealtruism.org/contact\"><i>&nbsp;<u>contact us</u></i></a><i> if you have feedback.</i></p>", "parentCommentId": null, "user": {"username": "SummaryBot"}}, {"_id": "4Gy89otPbfoBLGTNE", "postedAt": "2023-12-12T20:49:43.081Z", "postId": "YC3Mvw2xNtpKxR5sK", "htmlBody": "<p>I’m curating this post. I love the idea of an openly opinionated literature review, and I found this a really interesting read (as opposed to a normal literature review, which I might bookmark for use in a likely non-existent future time). The author,&nbsp;<a href=\"https://forum.effectivealtruism.org/users/rafaruizdelira?from=post_header\">Rafael Ruiz</a>, was clearly thinking about how to make their research useful and accessible to a Forum audience. This is evident in the descriptive headings, the organisation (most useful content first), and the clear prose.&nbsp;<br><br>If you are an early career researcher thinking about sharing your research with the Forum, this post is a great example of how to go about it. For a very different example of communicating your research in a way that is useful for the community, see&nbsp;<a href=\"https://forum.effectivealtruism.org/posts/jCwuozHHjeoLPLemB/how-long-do-policy-changes-matter-new-paper\"><u>this recent post from zdgroff</u></a>.&nbsp;</p>", "parentCommentId": null, "user": {"username": "tobytrem"}}, {"_id": "ir7ed6yDXgtCWAZZw", "postedAt": "2023-12-15T09:41:04.919Z", "postId": "YC3Mvw2xNtpKxR5sK", "htmlBody": "<p>Wonderful resource and a great read.\nA few responses:</p>\n<ol>\n<li>Information flow is a key feature of a lot of mainstream economics and I've done some work in this area, so maybe I could point you in the right direction given a more particular question.</li>\n<li>Seems from your characterization of his argument that Robert Wright gets the relationship between wealth and zero sum games backwards. Plus sum games trivially increase wealth but higher wealth may promote conspicuous consumption which is a negative sum games in terms of wealth, so this direction seems dubious.</li>\n<li>Very curious about the apparent paucity of writing on the relationship of moral progress and personality psychology.</li>\n</ol>\n", "parentCommentId": null, "user": {"username": "Niki Kotsenko"}}, {"_id": "eGiNocZbz2CsuGJp6", "postedAt": "2023-12-15T10:20:09.616Z", "postId": "YC3Mvw2xNtpKxR5sK", "htmlBody": "<p>On further reflection, you might want to try Who Gets What and Why by Alvin Roth. Audiobook available. Don't recall how much of an explicit stress he places on information flow but he does give a good sense of market organization, and how it promotes or inhibits market functioning. The key importance of information flow is at least implicit in this.</p>\n<p>Phishing for Phools by Ackerlof and Shiller can be read as counterargument and is a nice read. Slightly heterodox, not fully developed. Audiobook is available.</p>\n<p>Economics for the Common Good By Jean Tirole is not bad as a an overview of various aspects about the debate of the moral value of economics written by one of the major figures in academic economics.</p>\n<p>Slouching towards utopia which you mention is not very well written in terms of style, at least to my tastes, but makes several interesting points and provides a solid economic history, well informed by (the left wing of) mainstream economics</p>\n", "parentCommentId": null, "user": {"username": "Niki Kotsenko"}}, {"_id": "eyq3oqPXxDcXDRnGb", "postedAt": "2023-12-15T22:12:41.343Z", "postId": "YC3Mvw2xNtpKxR5sK", "htmlBody": "<p>Thanks for your comments!</p><p>Regarding (1), I'll get in touch with you if I have a specific question.</p><p>(2) I'll rewrite my characterization of Robert Wright's work. I think his main line of argument is that cultural evolutionary processes lead to bigger networks of cooperation, which foster positive sum games, which in turn foster further cooperation in a positive feedback loop. (Though certainly not everything fosters further growth or cooperation, conspicuous consumption being one exception)</p><p>(3) Could you say more? Do you mean differences between people's personalities (as in the OCEAN Big 5 Personalities)? Or more like character traits such as obedience to authority? Whatever the case, I definitely haven't seen much of this work. Might be my personal ignorance or lack of search in psychology journals, but I think there's general lack of work. Perhaps something that partly explains it are the controversies that surrounded the Stanford Prison Experiment and Milgram's Experiment, which set back psychological research on morality quite a bit for several decades. Hopefully some moral psychologists pick up the topic of moral progress.</p>", "parentCommentId": "ir7ed6yDXgtCWAZZw", "user": {"username": "rafaruizdelira"}}, {"_id": "8oZs2DekaG88n4axG", "postedAt": "2023-12-15T22:13:58.937Z", "postId": "YC3Mvw2xNtpKxR5sK", "htmlBody": "<p>Thanks a lot for the further reading recommendations, I will take a look!</p>", "parentCommentId": "eGiNocZbz2CsuGJp6", "user": {"username": "rafaruizdelira"}}, {"_id": "KkG8SKd3E4FoQDHv8", "postedAt": "2023-12-18T15:08:13.235Z", "postId": "YC3Mvw2xNtpKxR5sK", "htmlBody": "<p>Interesting work and this type of work is what originally brought me into EA. Just a word of caution and you probably know this already: I think perhaps moral progress in the past (like &gt;50-100 years ago) was associated with colonization etc. So it might be wise to acknowledge other cultures of morality outside of the West. I am quite familiar with cultivating compassion within Tibetan Buddhism and other \"moral work\" by non-Westerners that comes to mind is the concept of Ubuntu. I think taking into account the historical and geographical diversity of moral projects might make your analysis more powerful as well, as it might show that many cultures in the past have undertaken projects of moral progress but perhaps not succeeded and learning from their mistakes might make for more robust outcomes. I like that you included Amartya Sen as a more contemporary, non-Western reference - maybe there is even more out there to broaden your analysis spatially and temporally.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Ulrik Horn"}}, {"_id": "uiuAmEsQbQonEgGse", "postedAt": "2023-12-19T21:56:27.029Z", "postId": "YC3Mvw2xNtpKxR5sK", "htmlBody": "<p>Thanks. This is excellent and it will affect my reading (at <i>least </i>by getting my hands on the Buchanan and Powell book). &nbsp;</p><p>For some of the reviews (e.g. Moral Uncertainty, The Blank Slate) you note that you downgrade them for not closely addressing the \"moral progress\" topic. Would be good if you noted how you rate them for what they are trying to address.</p>", "parentCommentId": null, "user": {"username": "Punty"}}, {"_id": "H9t5NQCWctgmvKv8N", "postedAt": "2023-12-21T20:03:38.075Z", "postId": "YC3Mvw2xNtpKxR5sK", "htmlBody": "<p>Hi Scott, glad I could motivate you to get Buchanan and Powell. It's a great book! It might feel a bit long if you're not a philosopher, but it's definitely a standout solid reading with many insights on this topic.</p><p>On The Blank Slate and Moral Uncertainty, sure, let me add the following to my reviews in order to add to that:&nbsp;</p><p>Those two books I think are really good with regards to their subject matter. They're both general overviews of their respective fields. Moral Uncertainty is much more technical, but basically the required reading if you're getting into that topic for the first time. So it's 5/5 stars if you're interested in the topic, probably the best starting point.</p><p>The Blank Slate is more replaceable with any other introduction to cognitive science. It presents stuff like the view of the mind as a computer, with debates like the Language of Thought, connectionism, and human nature. Pinker is more accessible than \"textbooks\" like Tim Crane's \"The Mechanical Mind\", which are more rigorous but technical and harder to read.</p><p>Pinker also presents his opinionated side of things, siding with the evolutionary psychologists John Tooby and Leda Cosmides on analyzing humans as biological animals which inherit a lot of instincts. So he wants to argue that we are instinctually hard-wired towards certain behavior, which explains stuff like our capacity for language.&nbsp;</p><p>At some points he rambles against \"leftists\" in academia which want to deny instinctual human nature. He wants to detach ethics and human rights from any particular conception of human nature.</p><p>I take a bit of a middle position between Pinker and the \"leftist that wants to deny human nature\". I think the evolutionary psychology standpoint is definitely worth taking into consideration, but it might be more straightforward to apply with regards to stuff like language learning, which happens in an individual mind, than to politics and societies, which is less straightforward since there are new phenomena that happens when you're dealing with interactions of large groups of people. (I think more recently Pinker would even agree with that, since in his later books like Better Angels and Enlightenment Now, Pinker is a defender of enlightenment values to overcome our \"pre-wired\" tribalism.) I'd say it's like a 4/5 stars reading.</p><p>I'll also edit the post to reflect this.</p>", "parentCommentId": "uiuAmEsQbQonEgGse", "user": {"username": "rafaruizdelira"}}, {"_id": "hPCGJx4B9D7uyXazj", "postedAt": "2023-12-21T20:18:55.309Z", "postId": "YC3Mvw2xNtpKxR5sK", "htmlBody": "<p>Hi Ulrik! I'm definitely aware of this issue, and it's a very ugly side of this debate, which is why some people might have moved away from the topic in the past.</p><p>The dangers of using moral progress to justify colonialism and imperialism will be one key point in my next post, and it's also a brief section in the first chapter of my thesis. It's definitely worth cautioning against imposing progress to other cultures. And political intervention is much more complicated than \"my culture is more progressed, so we should enforce it upon the rest\". It deals with difficult issues of epistemic biases, lack of political legitimacy, and political paternalism. Aside from being a convenient excuse for the powerful to come to other countries and exploit others. It's probably not enough, but at least the explicit warning and section is there.</p><p>I try not to adhere or rely on particularly \"western\" values in my view of progress. But there's controversy as whether values such as moral impartiality and individual human rights are western. Amartya Sen for example wants to claim that they aren't, and he finds examples of such values in nonwestern contexts (in Development as Freedom Chapter 10). But I am not fully convinced either way. It's probably a tricky issue that deserves its own book-length treatment by itself.</p><p>If you know any other authors, academics or philosophers that bring in the non-western perspective with regards to values and progress, I'd love to take a look!</p>", "parentCommentId": "KkG8SKd3E4FoQDHv8", "user": {"username": "rafaruizdelira"}}, {"_id": "t7Zckoeng5na3Wb98", "postedAt": "2023-12-22T04:16:51.830Z", "postId": "YC3Mvw2xNtpKxR5sK", "htmlBody": "<p>Excellent, I am happy you are on top of this. I will have a think and see if I can come up with some. Anthropology might have things to offer. One that comes to mind is a book I think called \"The Gift\" or something similar - perhaps not directly relevant. And as I said I am more versed in Tibetan Buddhism with a lot of focus on cultivating compassion and of ~empowering oneself to release all beings (not just humans) from suffering for ever - that is a pretty wide moral circle!</p>", "parentCommentId": "hPCGJx4B9D7uyXazj", "user": {"username": "Ulrik Horn"}}, {"_id": "RFbnb3cLRSvrzQcN7", "postedAt": "2023-12-25T15:55:59.778Z", "postId": "YC3Mvw2xNtpKxR5sK", "htmlBody": "<p>Thank you for this post! I will make sure to read the 5/5 books that I haven't read yet, especially excited about Joseph Heinrich's book from 2020, had read The Secret of Our Success before but not that one.&nbsp;<br><br>I actually come from an AI Safety interest when it comes to moral progress. The question is to some extent for me on how we can set up AI systems so that they continuously improve \"moral progress\" as we don't want to <a href=\"https://www.lesswrong.com/posts/DJRe5obJd7kqCkvRr/don-t-leave-your-fingerprints-on-the-future\">leave our fingerprints on the future</a>.&nbsp;<br><br>In my opinion, the larger AI Safety dangers come from \"big data hell\" like the ones described in Yuah Noah Harari's Homo Deus or Paul Christiano's slow take-off scenarios.&nbsp;<br><br>Therefore we want to figure out how to set up AIs in such a way that automatically improves moral progress in the structure of their use. I'm also a believer that AI will most likely in the future go through a similar process to the one described in The Secret of Our Success and that we should prepare appropriate optimisation functions for it.&nbsp;<br><br>So, if you ever feel like we might die from AI, I would love to see some work in that direction!&nbsp;<br>(happy to talk more about it if you're up for it.)</p>", "parentCommentId": null, "user": {"username": "Jonas Hallgren"}}, {"_id": "ydieBf7Ksi3nY6gAh", "postedAt": "2023-12-26T12:49:29.987Z", "postId": "YC3Mvw2xNtpKxR5sK", "htmlBody": "<p>Hi Jonas! Henrich's 2020 book is very ambitious, but I thought it was really interesting. It has lots of insights from various disciplines, attempting to explain why Europe became the dominant superpower from the middle ages (starting to take off around the 13th century) to modernity.</p><p>Regarding AI, I think it's currently beyond the scope of this project. Although I mention AI at some points regarding the future of progress, I don't develop anything in-depth. So sadly I don't have any new insights regarding AI alignment.</p><p>I do think theories of cultural evolution and processes of mutations and selection of ideas could play a key role in predicting and shaping the long-term future, whether it's for humans or AI. So I'm excited for some social scientists or computer modellers to try to take this kind of work in a direction applied to making AI values dynamic and evolving (rather than static). But again, it's currently outside of the scope of my work and area of expertise.</p>", "parentCommentId": "RFbnb3cLRSvrzQcN7", "user": {"username": "rafaruizdelira"}}, {"_id": "B6e3vvt4heodpP3Hn", "postedAt": "2023-12-27T10:34:37.982Z", "postId": "YC3Mvw2xNtpKxR5sK", "htmlBody": "<p>Looking forward to the sequel!<br><br>I'd be particularly interested in any takes on the probability that civilization will be better equipped to deal with the alignment problem in, say, 100 years. My impression is that there's an important and not well-examined balance between:</p><ol><li>Decreasing runaway AI risk &amp; systemic risks by slowing down AI</li><li>Increasing the time of perils<br><ul><li>Possibly increasing its intensity by giving malicious actors more time to catch up in destructive capabilities</li><li>But also possibly increasing the time for reflection on defense before a worse time of perils.</li></ul></li><li>Possibly decreasing the risk of an aligned AI with bad moral values (conditional on this risk being lower in year 2123)</li><li>Possibly increasing the risk of astronomic waste (conditional on this risk being higher if AI is significantly slowed down)</li></ol>", "parentCommentId": null, "user": {"username": "Daniel_Friedrich"}}, {"_id": "g96xhcHt6u3EzB6tp", "postedAt": "2023-12-31T18:05:25.943Z", "postId": "YC3Mvw2xNtpKxR5sK", "htmlBody": "<p>I agree with you this is very important, and I'd like to see more work on it. Sadly I don't have much concrete to say on this topic. The following is my opinion as a layman on AI:</p><p>I've found Toby Ord's framework here <a href=\"https://www.youtube.com/watch?v=jb7BoXYTWYI\">https://www.youtube.com/watch?v=jb7BoXYTWYI</a> to be useful for thinking about these issues. I guess I'm an advocate for <i>differential</i> <i>progress</i>, like Ord. That is, prioritizing safety advancements relative to technical advancements. Not stopping work on AI capabilities, but right now shifting the current balance from capabilities work to safety work. And then in some years/decades once we have figured out alignment, shift the focus on capabilities again.</p><p>My very rough take on things is that as long as we manage to develop advanced LLMs (e.g. GPT5, 6, 7... and Copilots) slowly and carefully before dangerous AGI, we should use those LLMs to help us with technical alignment work. I think technical alignment work is the current bottleneck of the whole situation. There are either not enough people or we're not smart enough to figure it out on our own (but maybe computers could help!).</p><p>So, to your points, I think right now <i>(1) Runaway AI Risk</i> is higher than <i>(2) Malicious actors catching up</i>. I don't know by how much, since I don't know how well Chinese labs are doing regarding AI, and if they could come to big breakthroughs on their own. (And I don't know how to compare those points (1) and (2) to (3) and (4).)</p><p>Perhaps somebody could do a BOTEC calculation or a rough model with some very rough numbers to see what's a good tradeoff, and put it up for discussion. I'd like to see some work on this.</p>", "parentCommentId": "B6e3vvt4heodpP3Hn", "user": {"username": "rafaruizdelira"}}, {"_id": "7JJz5sCvDdfi8FscL", "postedAt": "2024-01-13T19:32:48.585Z", "postId": "YC3Mvw2xNtpKxR5sK", "htmlBody": "<p>Sounds reasonable! I think the empirical side to the question \"Will society be better equipped to set AI values in 2123?\" is more lacking. For this purpose, I think \"better equipped\" can be nicely operationalized in a very value-uncertain way as \"making decisions based on more reflection &amp; evidence and higher-order considerations\".</p><p>This kind of exploration may include issues like:</p><ol><li>Populism. Has it significantly decreased the amount of rationality that goes into gov. decision-making, in favor of following incentives &amp; intuitions? And what will be faster - new manipulative technologies or the rate at which new generations get immune to them?</li><li>Demographics. Given that fundamentalists tend to have more children, should we expect there will be more of them in 2123?</li><li>Cultural evolution. Is <a href=\"https://80000hours.org/podcast/episodes/ian-morris-big-picture-history/\">Ian Morris</a> or <a href=\"https://80000hours.org/podcast/episodes/christopher-brown-slavery-abolition/\">Christopher Brown</a> more right, i.e. should we expect that as we get richer, we'll be less prone to decide based on what gives us more power, and in turn attain values better calibrated with the most honest interpretation of reality?</li></ol>", "parentCommentId": "g96xhcHt6u3EzB6tp", "user": {"username": "Daniel_Friedrich"}}, {"_id": "wJYTcxoHPWrBvrEBP", "postedAt": "2024-02-08T23:53:32.097Z", "postId": "YC3Mvw2xNtpKxR5sK", "htmlBody": "<p>Hey, thanks for this list! I was wondering if you have come across Benjamin Friedman's <a href=\"https://www.amazon.com/Moral-Consequences-Economic-Growth/dp/1400095719#:~:text=Economic%20growth%2D%2Dmeaning%20a,fairness%2C%20and%20dedication%20to%20democracy.\">Moral Consequences of Economic Growth</a> and, if so, what you thought. I thought I might see it on this list.</p>", "parentCommentId": null, "user": {"username": "jackmalde"}}, {"_id": "Fdt5j6mcnkSxvfvE9", "postedAt": "2024-02-09T12:27:58.513Z", "postId": "YC3Mvw2xNtpKxR5sK", "htmlBody": "<p>I hadn't! Thanks for bringing this to my attention, I will take a look in the coming months.</p>", "parentCommentId": "wJYTcxoHPWrBvrEBP", "user": {"username": "rafaruizdelira"}}, {"_id": "Wx9AsEkSyiAZsf3qk", "postedAt": "2024-02-10T22:26:59.761Z", "postId": "YC3Mvw2xNtpKxR5sK", "htmlBody": "<p>Please do! I'm fascinated by the idea that we can accelerate moral progress by focusing on economic growth.</p>", "parentCommentId": "Fdt5j6mcnkSxvfvE9", "user": {"username": "jackmalde"}}, {"_id": "6pqHdrafrjzXZdtGE", "postedAt": "2024-02-13T11:29:08.344Z", "postId": "YC3Mvw2xNtpKxR5sK", "htmlBody": "<p>Same! Seems like a fascinating, although complicated topic. You might enjoy Oded Galor's \"The Journey of Humanity\", if you haven't read it. :)</p>", "parentCommentId": "Wx9AsEkSyiAZsf3qk", "user": {"username": "rafaruizdelira"}}]