[{"_id": "hsjeNoKyMmGkpgrSo", "postedAt": "2018-03-26T16:37:07.733Z", "postId": "YCAEbRFT8pha3JiXZ", "htmlBody": "<p>Hi there! Thank you for doing this. Is there a place for people who have just or recently finished their undergrad to help in your AI governance and policy position? </p>\n", "parentCommentId": null, "user": {"username": "branperr"}}, {"_id": "L7ftn8RYmHcLgq38h", "postedAt": "2018-03-26T16:39:30.363Z", "postId": "YCAEbRFT8pha3JiXZ", "htmlBody": "<p>How do you enjoy living in/near and working San Francisco? How's the commute, the expensive housing, and all that affected your lives?</p>\n", "parentCommentId": null, "user": {"username": "branperr"}}, {"_id": "MaygoGLYn8WnhCFdy", "postedAt": "2018-03-26T16:40:56.391Z", "postId": "YCAEbRFT8pha3JiXZ", "htmlBody": "<p>I'd recommend that recent grads looking to help with AI governance and policy apply for the <a href=\"https://www.openphilanthropy.org/get-involved/jobs/research-analyst-2018\">Research Analyst</a> position. With Research Analysts, we'll first focus on mentorship &amp; training, then try to figure out where everyone can do the most good based on their interests and skills. Someone who has a high aptitude &amp; interest for AI strategy would likely end up putting substantial time into that within a year or so (maybe less).</p>\n<p>You can also check out <a href=\"https://www.fhi.ox.ac.uk/vacancies/\">roles at the Future of Humanity Institute</a>.</p>\n", "parentCommentId": "hsjeNoKyMmGkpgrSo", "user": {"username": "HoldenKarnofsky"}}, {"_id": "cAWKz4gozetKQzZYh", "postedAt": "2018-03-26T16:41:19.797Z", "postId": "YCAEbRFT8pha3JiXZ", "htmlBody": "<p>I really appreciate that your application form is so short, but what's the logic behind focusing on applicant's undergraduate degrees? What are you assessing in the application? </p>\n", "parentCommentId": null, "user": {"username": "Khorton"}}, {"_id": "Jbypy4RtXthWEykz3", "postedAt": "2018-03-26T16:41:45.170Z", "postId": "YCAEbRFT8pha3JiXZ", "htmlBody": "<p>What's daily work and office culture look like in the OPP? Do you all host group activities, happy hours, or anything like that outside of working hours? </p>\n", "parentCommentId": null, "user": {"username": "branperr"}}, {"_id": "H63wQjXCcPCrutag2", "postedAt": "2018-03-26T16:42:45.312Z", "postId": "YCAEbRFT8pha3JiXZ", "htmlBody": "<p>Hi Holden, nice initiative.</p>\n<p>I have a question about the Research Analyst role. How generalist will they be? I can imagine them being somewhat focused on one or two focus areas besides more general issues such as how to implement moral uncertainty practically.</p>\n", "parentCommentId": null, "user": {"username": "SiebeRozendal"}}, {"_id": "4Nqjg4xmGJnjdPf24", "postedAt": "2018-03-26T16:43:29.921Z", "postId": "YCAEbRFT8pha3JiXZ", "htmlBody": "<p>In my current field – biomedical research – there’s a tendency for the best researchers to be drawn towards important problem areas, but to then detour towards <em>interesting</em> problems instead of <em>important</em> ones when choosing a specific research topic.  I think this is especially true for generalists, who often have a wider perspective on why the Really Cool problem is Really Cool. I’m guessing similar things happen in most fields.     Does the Open Philanthropy Project try to combat this?  As a Research Analyst, will the aim always be Important over Interesting?</p>\n<p>Thanks! :)</p>\n", "parentCommentId": null, "user": {"username": "Michael_Cannon"}}, {"_id": "5KjQSNqigfqZxM6Ho", "postedAt": "2018-03-26T16:46:23.545Z", "postId": "YCAEbRFT8pha3JiXZ", "htmlBody": "<p>Thank you for your reply Holden! I submitted my application yesterday after hearing you all were talent constrained, so I hope to hear from you all sometime soon. What does the training process look like for people who are hired on as research analysts? </p>\n", "parentCommentId": "MaygoGLYn8WnhCFdy", "user": {"username": "branperr"}}, {"_id": "EwahWLgBYff7dcdbj", "postedAt": "2018-03-26T16:50:16.634Z", "postId": "YCAEbRFT8pha3JiXZ", "htmlBody": "<p>We're certainly not using the same standards as academia! In general, we aim to base assignments on a combination of 1. How we judge what's most important to do (in terms of accomplishing as much good as possible) 2. What the employees themselves are motivated and interested to work on (including their own judgments of how to do as much good as possible).</p>\n", "parentCommentId": "4Nqjg4xmGJnjdPf24", "user": {"username": "HoldenKarnofsky"}}, {"_id": "h9LrmCBhGGo8jenLA", "postedAt": "2018-03-26T16:50:33.953Z", "postId": "YCAEbRFT8pha3JiXZ", "htmlBody": "<p>It seems that OpenPhil wants a more satisfactory answer to moral uncertainty than just worldview diversification before ramping up the amount of grants per year. Is this part of why you are hiring new Research Analysts, and if so, how much will they work on this problem? (This seems like a very interesting but hard problem)</p>\n", "parentCommentId": null, "user": {"username": "SiebeRozendal"}}, {"_id": "wBoS4SotkGxWXbZkL", "postedAt": "2018-03-26T16:51:25.990Z", "postId": "YCAEbRFT8pha3JiXZ", "htmlBody": "<p>This varies by the individual. We have some Research Analysts who are always working on a variety of things, and some who have become quite specialized. It varies largely by the interests/preferences of the employee.</p>\n", "parentCommentId": "H63wQjXCcPCrutag2", "user": {"username": "HoldenKarnofsky"}}, {"_id": "gjZtNrySE6ncrj9Qk", "postedAt": "2018-03-26T16:52:37.039Z", "postId": "YCAEbRFT8pha3JiXZ", "htmlBody": "<p>All else equal, we consider applicants stronger when they have degrees in challenging fields from strong institutions. It’s not the only thing we’re looking at, even at that early stage. And the early stage is for filtering; ultimately, things like work trial assignments will be far more important to hiring decisions.</p>\n", "parentCommentId": "cAWKz4gozetKQzZYh", "user": {"username": "HoldenKarnofsky"}}, {"_id": "dmEx9HCgbRPZo23KE", "postedAt": "2018-03-26T16:56:23.481Z", "postId": "YCAEbRFT8pha3JiXZ", "htmlBody": "<p>We could certainly imagine ramping up grantmaking without a much better answer. As an institution we're often happy to go with a &quot;hacky&quot; approach that is suboptimal, but captures most of the value available under multiple different assumptions.</p>\n<p>If someone at Open Phil has an idea for how to make useful progress on this kind of question in a reasonable amount of time, we'll very likely find that worthwhile and go forward. But there are lots of other things for Research Analysts to work on even if we don't put much more time into researching or reflecting on moral uncertainty.</p>\n<p>Also note that we may pursue an improved understanding via grantmaking rather than via researching the question ourselves.</p>\n", "parentCommentId": "h9LrmCBhGGo8jenLA", "user": {"username": "HoldenKarnofsky"}}, {"_id": "oXheCuQmxLipqxmNJ", "postedAt": "2018-03-26T16:59:20.032Z", "postId": "YCAEbRFT8pha3JiXZ", "htmlBody": "<p>We currently have a happy hour every 3 weeks and host group activities as well, including occasional parties and a multiple-day staff retreat this year. We want to make it easy for staff to socialize and be friends, without making it a requirement or an overly hard nudge (if people would rather stick to their work, that's fine by us).</p>\n", "parentCommentId": "Jbypy4RtXthWEykz3", "user": {"username": "HoldenKarnofsky"}}, {"_id": "JXdE5araYjCBQyQt5", "postedAt": "2018-03-26T17:02:43.376Z", "postId": "YCAEbRFT8pha3JiXZ", "htmlBody": "<p>Not sure if interpreting Khorton correctly, but interested anyway:\nWhy focus on undergrad and not on postgrad (or highest level achieved/pursuing)?</p>\n", "parentCommentId": "gjZtNrySE6ncrj9Qk", "user": {"username": "SiebeRozendal"}}, {"_id": "6gdC2YqHSscccRs5f", "postedAt": "2018-03-26T17:07:37.425Z", "postId": "YCAEbRFT8pha3JiXZ", "htmlBody": "<p>Hey Holden, thanks for doing this. \nSuppose I applied for the research analyst position and didn't get it. Which of the following would then be more likely to eventually land me a job at OPP, and how much more likely (assuming I would perform well in both)?</p>\n<p>a) becoming research analyst at GiveWell</p>\n<p>b) doing research in one of OPP's focus areas (biosecurity/AI safety).</p>\n", "parentCommentId": null, "user": {"username": "JanBrauner"}}, {"_id": "cRCqn2JLsNadDPzhh", "postedAt": "2018-03-26T17:11:18.662Z", "postId": "YCAEbRFT8pha3JiXZ", "htmlBody": "<p>I would rate those about equally, though I'd add that GiveWell would prefer not to hire people whose main goal is to go to OP. </p>\n", "parentCommentId": "6gdC2YqHSscccRs5f", "user": {"username": "HoldenKarnofsky"}}, {"_id": "99rbT4wzCMaEhveG2", "postedAt": "2018-03-26T17:11:20.418Z", "postId": "YCAEbRFT8pha3JiXZ", "htmlBody": "<p>What are the working hours like for a position like Research Analyst? Strict/flexible? 40 hours/week or other? What is the overtime like on average, and what is it like on peaks?</p>\n", "parentCommentId": null, "user": {"username": "SiebeRozendal"}}, {"_id": "BxXh9uBPiM98D4Pje", "postedAt": "2018-03-26T17:15:46.173Z", "postId": "YCAEbRFT8pha3JiXZ", "htmlBody": "<p>Broadly speaking, we're going to try to give people assignments that are relevant to our work and that we think include a lot of the core needed skills - things like evaluating a potential grant (or renewal) and writing up the case for or against. We'll evaluate these assignments, give substantial feedback, and iterate so that people improve. We'll also be providing resources for gaining background knowledge, such as &quot;flex time,&quot; recommended reading lists and optional Q&amp;A sessions. We've seen people improve a lot in the past and become core contributors, and think this basic approach is likely to lead to more of that.</p>\n", "parentCommentId": "5KjQSNqigfqZxM6Ho", "user": {"username": "HoldenKarnofsky"}}, {"_id": "sfrYhksazZikWfX5p", "postedAt": "2018-03-26T17:16:06.942Z", "postId": "YCAEbRFT8pha3JiXZ", "htmlBody": "<p>I'm very curious about how that improved understanding would come about via grantmaking. Any write-up you have about this? I can see how you'd learn about tractability, and maybe about neglectedness, but I wonder how you incorporate this in your decision-making.</p>\n<p>Anyway, this might go a little too off-topic so I'd understand if you replied to other questions first :)</p>\n", "parentCommentId": "dmEx9HCgbRPZo23KE", "user": {"username": "SiebeRozendal"}}, {"_id": "gAKXqzntSnic37Zms", "postedAt": "2018-03-26T17:16:11.082Z", "postId": "YCAEbRFT8pha3JiXZ", "htmlBody": "<p>Hm, I'm not sure why our form asks for more detail on undergrad relative to grad - we copied the form from GiveWell and may not have thought about it. It's possible this is because the form was being used in an earlier GiveWell search where few applicants had been to grad schools. I'll ask around about this.</p>\n", "parentCommentId": "JXdE5araYjCBQyQt5", "user": {"username": "HoldenKarnofsky"}}, {"_id": "TkZeHyxM4SkgciagR", "postedAt": "2018-03-26T17:19:52.808Z", "postId": "YCAEbRFT8pha3JiXZ", "htmlBody": "<p>Perhaps other staff will chime in here, but my take: our pay is competitive and takes cost of living into account, and we are near public transportation, so I don't think the rents or commutes are a major issue. As a former NYC resident, I think the Bay Area is a great place to live (weather, food, etc.) and has a very strong effective altruist community. I don't see a lot of drawbacks to living here if you can make it work.</p>\n", "parentCommentId": "L7ftn8RYmHcLgq38h", "user": {"username": "HoldenKarnofsky"}}, {"_id": "4JypPzDnaSjasZffn", "postedAt": "2018-03-26T17:22:17.549Z", "postId": "YCAEbRFT8pha3JiXZ", "htmlBody": "<p>I'm under the impression that holidays, sick days, and parental leave are on average much less generous in the US compared to Europe or Canada. What are your policies on time off work?</p>\n", "parentCommentId": null, "user": {"username": "Khorton"}}, {"_id": "2FLMxi3r3tsGJ3dEs", "postedAt": "2018-03-26T17:28:47.224Z", "postId": "YCAEbRFT8pha3JiXZ", "htmlBody": "<p>If someone can't apply right now due to other commitments, do you expect there to be new roles for generalist research analysts next year as well? What are the best ways one could make oneself a better candidate meanwhile?</p>\n", "parentCommentId": null, "user": {"username": "Risto_Uuk"}}, {"_id": "Tr3XQKBwuPtkMpn98", "postedAt": "2018-03-26T17:31:24.453Z", "postId": "YCAEbRFT8pha3JiXZ", "htmlBody": "<p>A quick Google search gave me the impression that it isn't very easy to get a work visa in the US even though it will be sponsored. Is this correct, and do you have stronger requirements for non-US applicants because they'll be less likely to actually be able to work for you? (I'm completely unfamiliar with the visa system)</p>\n", "parentCommentId": null, "user": {"username": "SiebeRozendal"}}, {"_id": "bWbMpFDrsieSkXcPE", "postedAt": "2018-03-26T17:43:02.578Z", "postId": "YCAEbRFT8pha3JiXZ", "htmlBody": "<p>We're in the process of reviewing our policies, but we're likely to settle on something like 25 paid days off (including sick days), 10 holiday days (with the option to work on holidays and use the paid time off elsewhere), several months of paid parental leave, and a flexible unpaid leave policy for people who want to take more time off. We are also flexible with respect to working from home.</p>\n", "parentCommentId": "4JypPzDnaSjasZffn", "user": {"username": "HoldenKarnofsky"}}, {"_id": "xKAwnQ5CsHpTLdwQB", "postedAt": "2018-03-26T17:48:57.342Z", "postId": "YCAEbRFT8pha3JiXZ", "htmlBody": "<p>To clarify, are the 10 holiday days part of the 25 paid days off, or in addition to? </p>\n", "parentCommentId": "bWbMpFDrsieSkXcPE", "user": {"username": "Khorton"}}, {"_id": "u84WCdhtxCXEYKJSo", "postedAt": "2018-03-26T17:49:45.765Z", "postId": "YCAEbRFT8pha3JiXZ", "htmlBody": "<p>We're flexible. People don't clock in or out; we evaluate performance based on how much people get done on a timescale of months. We encourage people to work hard but also prioritize work-life balance. The right balance varies by the individual.</p>\n<p>Most people here work more than one would in a traditional 9-5 job. (A common figure is 35-40 &quot;focused&quot; hours per week.) I think that reflects that they're passionate about their work rather than that they feel pressure from management to work a lot. We regularly check in with people about work-life balance and encourage them to work less if it seems this would be good for their happiness. </p>\n", "parentCommentId": "99rbT4wzCMaEhveG2", "user": {"username": "HoldenKarnofsky"}}, {"_id": "LgE9ZRyWD2Nz2pefo", "postedAt": "2018-03-26T17:53:03.406Z", "postId": "YCAEbRFT8pha3JiXZ", "htmlBody": "<p>Or by 'holiday days' do you mean statutory holidays like Thanksgiving?</p>\n", "parentCommentId": "xKAwnQ5CsHpTLdwQB", "user": {"username": "Khorton"}}, {"_id": "grsCCYch3WP7SPZ6j", "postedAt": "2018-03-26T18:01:11.911Z", "postId": "YCAEbRFT8pha3JiXZ", "htmlBody": "<p>What key metrics do research analysts pay attention to in the course of their work? More broadly, how do employees know that they're doing a good job? </p>\n", "parentCommentId": null, "user": {"username": "Girish_Sastry"}}, {"_id": "en7cdYbF5rwQLSuCx", "postedAt": "2018-03-26T18:10:11.833Z", "postId": "YCAEbRFT8pha3JiXZ", "htmlBody": "<p>What are things that previous Research Analysts have struggled with at Open Phil? What are reasons others have found it not to be a good fit?</p>\n", "parentCommentId": null, "user": {"username": "itty"}}, {"_id": "bczT6SSEBMYeP3woe", "postedAt": "2018-03-26T18:12:06.046Z", "postId": "YCAEbRFT8pha3JiXZ", "htmlBody": "<p>Hi Holden, </p>\n<p>the job description for Research Analysts says:</p>\n<blockquote>\n<p>Research Analysts will receive intensive training and mentorship, and over time will become \nhighly experienced with our approach to reasoning transparency, cost-effectiveness analysis, \ncritical evidence assessment, grant investigation, and balancing thoroughness with efficiency.&quot;</p>\n</blockquote>\n<p>Could you please elaborate a bit more on the <strong>training and mentorship</strong> part? E.g.: How much time is reserved for training? Who would be the mentors? What would the relation with the mentor(s) be like?  </p>\n<p>Thanks for offering this Q&amp;A!</p>\n", "parentCommentId": null, "user": {"username": "Ekaterina_Ilin"}}, {"_id": "Ywt8DYKojL4wm3QCm", "postedAt": "2018-03-26T18:14:34.021Z", "postId": "YCAEbRFT8pha3JiXZ", "htmlBody": "<p>GiveWell is also hiring for several roles right now. How should a person decide whether to apply to GiveWell or Open Phil? Are there significant differences in the work culture? Do Research Analysts at each org take on similar types of tasks?</p>\n", "parentCommentId": null, "user": {"username": "itty"}}, {"_id": "NQmfQbkRGjQWW4EcE", "postedAt": "2018-03-26T18:17:21.607Z", "postId": "YCAEbRFT8pha3JiXZ", "htmlBody": "<p>How much collaboration exists between research analysts (or operations associates, for that matter)? </p>\n<p>I decided against working in academic research because I do much better in a team environment (short feedback loops, bouncing ideas off peers, sense that my work contributes to shared purpose and projects) than I do working independently. I prefer the industry side of basically all of Philip Guo's <a href=\"http://www.pgbovine.net/academia-industry-junior-employee.htm\">industry vs. academia comparisons</a>. Would it still make sense for me to apply for an OpenPhil job? I think I have relevant skills, but I'm worried that I wouldn't be effective in a research environment, even if it is non-academic.</p>\n", "parentCommentId": null, "user": {"username": "tessa"}}, {"_id": "NMkDGxtzPXhPXHrLT", "postedAt": "2018-03-26T18:18:01.912Z", "postId": "YCAEbRFT8pha3JiXZ", "htmlBody": "<p>Who is likely to manage new Grants Associates, Operations Associates, and Research Analysts?</p>\n", "parentCommentId": null, "user": {"username": "itty"}}, {"_id": "QThfhxiQCFx2JWv7D", "postedAt": "2018-03-26T18:18:40.694Z", "postId": "YCAEbRFT8pha3JiXZ", "htmlBody": "<p>Yes, I mean statutory holidays like Thanksgiving.</p>\n", "parentCommentId": "LgE9ZRyWD2Nz2pefo", "user": {"username": "HoldenKarnofsky"}}, {"_id": "8PRPKBjRDade6LjHy", "postedAt": "2018-03-26T18:24:01.052Z", "postId": "YCAEbRFT8pha3JiXZ", "htmlBody": "<p>I’m pretty confused about the work of the RA role - it seems to include everything from epidemiological literature reviews to philosophical work on population ethics to following up on individual organisations you’ve funded. </p>\n<p>Could you give some concrete info about how you and the RA determine what the RA works on?</p>\n", "parentCommentId": null, "user": {"username": "Ben Pace"}}, {"_id": "9tH32BFccCw8wFw6W", "postedAt": "2018-03-26T18:24:11.751Z", "postId": "YCAEbRFT8pha3JiXZ", "htmlBody": "<p>Is there any possibility for the research analyst (or some other) role to be taken up completely remotely? (i.e. while living in another country)</p>\n", "parentCommentId": null, "user": {"username": "Mario"}}, {"_id": "Gg2Fgb45W3ywdaQik", "postedAt": "2018-03-26T18:28:05.739Z", "postId": "YCAEbRFT8pha3JiXZ", "htmlBody": "<p>I answered a similar question here: <a href=\"http://effective-altruism.com/ea/1mf/hi_im_holden_karnofsky_ama_about_jobs_at_open/dpl\">http://effective-altruism.com/ea/1mf/hi_im_holden_karnofsky_ama_about_jobs_at_open/dpl</a></p>\n<p>In general, people who have been in the Research Analyst role for a while will be the managers and primary mentors of new Research Analysts. There will be regular (~weekly) scheduled checkins as well as informal interaction as needed (e.g., over Slack). </p>\n<p>There's no hard line between training and &quot;just doing the work&quot; - every assignment should have some direct value and some training value. We expect to lean pretty hard toward the training end of the spectrum for people's first few months, then gradually move along the spectrum to where assignments are more optimized for direct value.</p>\n", "parentCommentId": "bczT6SSEBMYeP3woe", "user": {"username": "HoldenKarnofsky"}}, {"_id": "egmjfHxpNW44BFtDz", "postedAt": "2018-03-26T18:29:56.686Z", "postId": "YCAEbRFT8pha3JiXZ", "htmlBody": "<p>They're different organizations and I don't know nearly as much about the GiveWell role. One big difference is the causes we work on. </p>\n<p>If you're interested in both, I'd recommend applying to both, and if you are offered both roles, there will be lots of opportunities to learn more about each at that point in order to inform the decision.</p>\n", "parentCommentId": "Ywt8DYKojL4wm3QCm", "user": {"username": "HoldenKarnofsky"}}, {"_id": "iTsnY5GBWBTTcNaEz", "postedAt": "2018-03-26T18:33:00.722Z", "postId": "YCAEbRFT8pha3JiXZ", "htmlBody": "<p>The job description for Research Analyst says that the best candidates will have &quot;comfort thinking in terms of expected value and using systematic, quantitative frameworks.&quot; How quantitative should a candidate be to apply? For example, if a person feels comfortable with basic expected value concepts but finds GiveWell's CEA overwhelming (and probably could never produce something similar to GiveWell's CEA), is that not quantitative enough?</p>\n", "parentCommentId": null, "user": {"username": "itty"}}, {"_id": "eHdaSu8KpDwp7JRxD", "postedAt": "2018-03-26T18:33:12.720Z", "postId": "YCAEbRFT8pha3JiXZ", "htmlBody": "<p>I am a Program Officer at Open Philanthropy who joined as a Research Analyst about 3 years ago.</p>\n<p>The prior two places I lived were New Brunswick, NJ and Oxford, UK. I live in a house with a few friends. It is 25-30m commute door-to-door via BART. My rent and monthly expenses are comparable to what I had in Oxford but noticeably larger than what I had in New Brunswick. I got pay increases when I moved to Open Phil, and additional raises over time. I’m comfortable on my current salary and could afford to get a single-bedroom apartment if I wanted, but I’m happy where I am.</p>\n<p>Overall, I would say that it was an easy adjustment.</p>\n", "parentCommentId": "L7ftn8RYmHcLgq38h", "user": {"username": "Nick_Beckstead"}}, {"_id": "6T4QdANTbWCtkkzTr", "postedAt": "2018-03-26T18:34:06.552Z", "postId": "YCAEbRFT8pha3JiXZ", "htmlBody": "<p>Most of the roles here involve a lot of independent work, consisting of reading/writing/analysis and one-on-one checkins rather than large-group collaboration. It’s possible that this will change for some roles in the future (e.g. it’s possible that we’ll want more large-group collaboration as our cause prioritization team grows), but we’re not sure of that. I think you should probably be prepared for a fair amount of work along the lines of what I've described here.</p>\n", "parentCommentId": "NQmfQbkRGjQWW4EcE", "user": {"username": "HoldenKarnofsky"}}, {"_id": "eWfH2SGwvmApPdKS9", "postedAt": "2018-03-26T18:35:50.772Z", "postId": "YCAEbRFT8pha3JiXZ", "htmlBody": "<p>There will probably be similar roles in the future, though I can't guarantee that. To become a better candidate, one can accomplish objectively impressive things (especially if they're relevant to effective altruism); create public content that gives a sense for how they think (e.g., a blog); or get to know people in the effective altruism community to increase the odds that one gets a positive &amp; meaningful referral.</p>\n", "parentCommentId": "2FLMxi3r3tsGJ3dEs", "user": {"username": "HoldenKarnofsky"}}, {"_id": "2EmpeDai4qfbDQeBe", "postedAt": "2018-03-26T18:36:35.312Z", "postId": "YCAEbRFT8pha3JiXZ", "htmlBody": "<p>We don't control the visa process and can't ensure that people will get sponsorship. We don't expect sponsorship requirements to be a major factor for us in deciding which applicants to move forward with.</p>\n", "parentCommentId": "Tr3XQKBwuPtkMpn98", "user": {"username": "HoldenKarnofsky"}}, {"_id": "YPHXzcRDr3cNRdQFS", "postedAt": "2018-03-26T18:37:07.286Z", "postId": "YCAEbRFT8pha3JiXZ", "htmlBody": "<p>A few things that come to mind:</p>\n<ol>\n<li><p>The work is challenging, and not everyone is able to perform at a high enough level to see the career progression they want.</p>\n</li>\n<li><p>The culture tends toward direct communication. People are expected to be open with criticism, both of people they manage and of people who manage them. This can be uncomfortable for some people (though we try hard to create a supportive and constructive context).</p>\n</li>\n<li><p>The work is often solitary, consisting of reading/writing/analysis and one-on-one checkins rather than large-group collaboration. It's possible that this will change for some roles in the future (e.g. it's possible that we'll want more large-group collaboration as our cause prioritization team grows), but we're not sure of that.</p>\n</li>\n</ol>\n", "parentCommentId": "en7cdYbF5rwQLSuCx", "user": {"username": "HoldenKarnofsky"}}, {"_id": "Jbx7NfY4v8FTSP4qi", "postedAt": "2018-03-26T18:41:35.104Z", "postId": "YCAEbRFT8pha3JiXZ", "htmlBody": "<p>All bios here: <a href=\"https://www.openphilanthropy.org/about/team\">https://www.openphilanthropy.org/about/team</a></p>\n<p>Grants Associates and Operations Associates are likely to report to Derek or Morgan. Research Analysts are likely to report to people who have been in similar roles for a while, such as Ajeya, Claire, Luke and Nick. None of this is set in stone though.</p>\n", "parentCommentId": "NMkDGxtzPXhPXHrLT", "user": {"username": "HoldenKarnofsky"}}, {"_id": "EnbcN8BTXWnRquaBe", "postedAt": "2018-03-26T18:49:50.751Z", "postId": "YCAEbRFT8pha3JiXZ", "htmlBody": "<p>Jumping in here for Holden (I'm an Open Phil RA)…</p>\n<p>We would like our Research Analysts to work in the SF office most of the time, with 'partly remote' in the job ad meaning that they can occasionally work from home/different locations. Despite our policy, we aren't totally closed to the idea of hiring someone who mostly works remotely, but they'd have to meet a higher bar.</p>\n", "parentCommentId": "9tH32BFccCw8wFw6W", "user": {"username": "lukeprog"}}, {"_id": "4wZeBwyohz8ab6p7q", "postedAt": "2018-03-26T18:54:33.185Z", "postId": "YCAEbRFT8pha3JiXZ", "htmlBody": "<p>We do formal performance reviews twice per year, and we ask managers to use their regular (~weekly) checkins with reports to sync up on performance such that nothing in these reviews should be surprising. There's no unified metric for an employee's output here; we set priorities for the organization, set assignments that serve these priorities, set case-by-case timelines and goals for the assignments (in collaboration with the people who will be working on them), and compare output to the goals we had set.</p>\n", "parentCommentId": "grsCCYch3WP7SPZ6j", "user": {"username": "HoldenKarnofsky"}}, {"_id": "2Po54bDfz3twzZEmS", "postedAt": "2018-03-26T18:58:19.292Z", "postId": "YCAEbRFT8pha3JiXZ", "htmlBody": "<p>The role does include all three of those things, and I think all three things are well served by the job qualifications listed in the posting. A common thread is that all involve trying to deliver an informative, well-calibrated answer to an action-relevant question, largely via discussion with knowledgeable parties and critical assessment of evidence and arguments.</p>\n<p>In general, we have a list of the projects that we consider most important to complete, and we look for good matches between high-ranked projects and employees who seem well suited to them. I expect that most entry-level Research Analysts will try their hand at both cause prioritization and grant investigation work, and we'll develop a picture of what they're best at that we can then use to assign them more of one or the other (or something else, such as the work listed at <a href=\"https://www.openphilanthropy.org/get-involved/jobs/analyst-specializing-potential-risks-advanced-artificial-intelligence\">https://www.openphilanthropy.org/get-involved/jobs/analyst-specializing-potential-risks-advanced-artificial-intelligence</a>) over time.</p>\n", "parentCommentId": "8PRPKBjRDade6LjHy", "user": {"username": "HoldenKarnofsky"}}, {"_id": "grCfLfXpMHBRJNCjW", "postedAt": "2018-03-26T19:09:04.040Z", "postId": "YCAEbRFT8pha3JiXZ", "htmlBody": "<p>Thanks Holden!</p>\n", "parentCommentId": "2Po54bDfz3twzZEmS", "user": {"username": "Ben Pace"}}, {"_id": "NRvD7MfS6r8aTksYx", "postedAt": "2018-03-26T19:15:26.525Z", "postId": "YCAEbRFT8pha3JiXZ", "htmlBody": "<p>GiveWell's CEA was produced by multiple people over multiple years - we wouldn't expect a single person to generate the whole thing :)</p>\n<p>I do think you should probably be able to imagine yourself engaging in a discussion over some particular parameter or aspect of GiveWell's CEA, and trying to improve that parameter or aspect to better capture what we care about (good accomplished per dollar). Quantitative aptitude is not a hard requirement for this position (there are some ways the role could evolve that would not require it), but it's a major plus.</p>\n", "parentCommentId": "iTsnY5GBWBTTcNaEz", "user": {"username": "HoldenKarnofsky"}}, {"_id": "ENXirior3rdkTWARM", "postedAt": "2018-03-26T19:31:05.952Z", "postId": "YCAEbRFT8pha3JiXZ", "htmlBody": "<p>Keep in mind that Milan worked for GiveWell, not OP, and that he was giving his own impressions rather than speaking for either organization in that post. </p>\n<p>That said:</p>\n<p>*His &quot;Flexible working schedule&quot; point sounds pretty consistent with how things are here. </p>\n<p>*We continue to encourage time tracking (but we don't require it and not everybody does it). </p>\n<p>*We do try to explicitly encourage self-care. </p>\n<p>Does that respond to what you had in mind?</p>\n", "parentCommentId": "ye5nLb2HzHBBPiXPH", "user": {"username": "HoldenKarnofsky"}}, {"_id": "ZDp6EhG5w7saXkqcx", "postedAt": "2018-03-26T19:38:52.687Z", "postId": "YCAEbRFT8pha3JiXZ", "htmlBody": "<p>I'm referring to the possibility of supporting academics (e.g. philosophers) to propose and explore different approaches to moral uncertainty and their merits and drawbacks. (E.g., different approaches to operationalizing the considerations listed at <a href=\"https://www.openphilanthropy.org/blog/update-cause-prioritization-open-philanthropy#Allocating_capital_to_buckets_and_causes\">https://www.openphilanthropy.org/blog/update-cause-prioritization-open-philanthropy#Allocating_capital_to_buckets_and_causes</a> , which may have different consequences for how much ought to be allocated to each bucket)</p>\n", "parentCommentId": "sfrYhksazZikWfX5p", "user": {"username": "HoldenKarnofsky"}}, {"_id": "i5kM5cSsLfTwJQTy3", "postedAt": "2018-03-26T19:41:28.176Z", "postId": "YCAEbRFT8pha3JiXZ", "htmlBody": "<p>This is still a common practice. The point of it isn't to evaluate employees by # of hours worked; the point is for their manager to have a good understanding of how time is being used, so they can make suggestions about what to go deeper on, what to skip, how to reprioritize tasks, etc.</p>\n<p>Several employees simply opt out from this because they prefer not to do it. It's an optional practice for the benefit of employees rather than a required practice used for performance assessment.</p>\n", "parentCommentId": "yoq7nTQrARiRM6TxZ", "user": {"username": "HoldenKarnofsky"}}, {"_id": "5FBJppAnQak5EsnNt", "postedAt": "2018-03-26T19:41:53.539Z", "postId": "YCAEbRFT8pha3JiXZ", "htmlBody": "<p>I'm graduating from the University of Michigan (Ann Arbor) with an Honors History degree this year. This gave me a nonstandard amount of experience with literature reviews and research for an undergraduate student.\nHowever, I've seen that OpenPhil generally prefers its candidates to have non-humanities majors.</p>\n<p>1) Is the latter claim true?</p>\n<p>2) In general, how does OpenPhil rate research experience that is not in the field(s) currently being explored?</p>\n", "parentCommentId": null, "user": {"username": "NatKozak"}}, {"_id": "jh7sCcnbhWsc6s2EG", "postedAt": "2018-03-26T19:44:12.740Z", "postId": "YCAEbRFT8pha3JiXZ", "htmlBody": "<p>Do you recommend any textbooks (or other resources) that might help an applicant become more familiar with the expected value frameworks used at OpenPhil?</p>\n", "parentCommentId": null, "user": {"username": "NatKozak"}}, {"_id": "D4KS3DimWEj7Bt3kv", "postedAt": "2018-03-26T19:49:37.218Z", "postId": "YCAEbRFT8pha3JiXZ", "htmlBody": "<p>What does a &quot;challenging field&quot; mean here? Do you have a ranking of fields by degree of challenge or rely mainly on intuition? </p>\n", "parentCommentId": "gjZtNrySE6ncrj9Qk", "user": {"username": "Khorton"}}, {"_id": "vEbYCsR9o9ftC76h5", "postedAt": "2018-03-26T19:55:07.333Z", "postId": "YCAEbRFT8pha3JiXZ", "htmlBody": "<p>Hi,</p>\n<p>What would be the attitude towards someone who wanted to work with you after undergrad for a year or two, but then go on to graduate school (likely for philosophy in my case), with an eye towards then continuing to work with you or other EA orgs after grad school? </p>\n", "parentCommentId": null, "user": {"username": "Ikaxas"}}, {"_id": "motGNMj85zWoHTrc5", "postedAt": "2018-03-26T20:51:33.120Z", "postId": "YCAEbRFT8pha3JiXZ", "htmlBody": "<p>What are the most important ways in which Open Phil's culture is different from GiveWell's culture?</p>\n", "parentCommentId": null, "user": {"username": "Milan_Griffes"}}, {"_id": "5vCbHwjqyRPbedEDQ", "postedAt": "2018-03-26T21:13:22.756Z", "postId": "YCAEbRFT8pha3JiXZ", "htmlBody": "<p>How is doing research at Open Philanthropy different from doing research in academia? To make things concrete, how would the work of someone doing economic modelling or ML research in academia differ from typical research at OpenPhil?</p>\n", "parentCommentId": null, "user": null}, {"_id": "ZdDpg3CQMZewAKaTo", "postedAt": "2018-03-27T00:26:02.612Z", "postId": "YCAEbRFT8pha3JiXZ", "htmlBody": "<p>I'm curious whether Open Phil has done any estimates of the relative impact of someone who goes to work for you vs someone who does direct work in one of your focus areas? All else equal (i.e., assume personal fit is the same, etc.), which option might be better? </p>\n", "parentCommentId": null, "user": {"username": "scarves"}}, {"_id": "46EgfjEFmeh4XLE2q", "postedAt": "2018-03-27T04:35:31.510Z", "postId": "YCAEbRFT8pha3JiXZ", "htmlBody": "<p>Surely rent is much higher than Oxford on average? It's possible to get a great place in Oxford for under £700 per month, while comparable in SF would be $1300+. Food also seems about 30% more expensive, and in Oxford you don't have to pay for a commute. My overall guess is that $80k p.a. in SF is equivalent to about £40k p.a. in Oxford.</p>\n", "parentCommentId": "eHdaSu8KpDwp7JRxD", "user": {"username": "Benjamin_Todd"}}, {"_id": "YzNEc7ZtbrgyRbqCT", "postedAt": "2018-03-27T07:05:51.096Z", "postId": "YCAEbRFT8pha3JiXZ", "htmlBody": "<p>OpenPhil is big on history, I would apply.</p>\n", "parentCommentId": "5FBJppAnQak5EsnNt", "user": {"username": "John_Maxwell_IV"}}, {"_id": "3Y9GfK2afWS7d6icG", "postedAt": "2018-03-27T17:25:39.964Z", "postId": "YCAEbRFT8pha3JiXZ", "htmlBody": "<p>It is still unclear to me whether the statutory holidays are supposed to be included in the 25 days paid days off or in addition to.</p>\n", "parentCommentId": "QThfhxiQCFx2JWv7D", "user": {"username": "Denise_Melchin"}}, {"_id": "LqRiXCEY9wYao2Mi9", "postedAt": "2018-03-27T17:39:24.630Z", "postId": "YCAEbRFT8pha3JiXZ", "htmlBody": "<p>To chime in as someone who has very recently spent a lot of time in both London and SF, a 1.8:1 ratio (as in $1.8y is about the same as £y) is very roughly what I would have said for living costs between that pair, though living circumstances will vary significantly.</p>\n<p>Pound to dollar exchange rates have moved a ton in the last few years, whereas I don't think local salaries or costs of living have moved nearly as much, so I expect that 1.8:1 heuristic to be more stable/useful than trying to do the same comparison including a currency conversion (depending what point in the last few years you picked/moved, that ratio would imply anywhere between a 1.05x increase and a 1.55x increase).</p>\n", "parentCommentId": "46EgfjEFmeh4XLE2q", "user": {"username": "AGB"}}, {"_id": "EsLpKMBQn5PzxYjDW", "postedAt": "2018-03-27T17:47:57.691Z", "postId": "YCAEbRFT8pha3JiXZ", "htmlBody": "<p>I don't mean to make a claim re: averages, just relaying personal experience.</p>\n", "parentCommentId": "46EgfjEFmeh4XLE2q", "user": {"username": "Nick_Beckstead"}}, {"_id": "bPhpXwnSX82J48uSP", "postedAt": "2018-03-27T17:58:46.324Z", "postId": "YCAEbRFT8pha3JiXZ", "htmlBody": "<p>Cost-of-living comparison between San Francisco, CA and Oxford, UK: <a href=\"https://www.numbeo.com/cost-of-living/compare_cities.jsp?country1=United+Kingdom&amp;country2=United+States&amp;city1=Oxford&amp;city2=San+Francisco%2C+CA&amp;tracking=getDispatchComparison\">https://www.numbeo.com/cost-of-living/compare_cities.jsp?country1=United+Kingdom&amp;country2=United+States&amp;city1=Oxford&amp;city2=San+Francisco%2C+CA&amp;tracking=getDispatchComparison</a></p>\n", "parentCommentId": "46EgfjEFmeh4XLE2q", "user": {"username": "Roxanne_Heston"}}, {"_id": "wtJg6FZkJ6bhyByD3", "postedAt": "2018-03-27T18:10:56.873Z", "postId": "YCAEbRFT8pha3JiXZ", "htmlBody": "<p>Is there a standard contract length you will offer RA's if there is no trial period?</p>\n", "parentCommentId": null, "user": {"username": "SiebeRozendal"}}, {"_id": "35XBN5SzjKcj6mEbS", "postedAt": "2018-03-27T18:27:55.247Z", "postId": "YCAEbRFT8pha3JiXZ", "htmlBody": "<p>What advice would you give to a potential OpenPhil hire re how to think about the value of joining OpenPhil full time vs starting an organization that OpenPhil would be likely to fund vs joining an organization that has already received funding from OpenPhil?</p>\n", "parentCommentId": null, "user": {"username": "alexflint"}}, {"_id": "JWHbfmMfQpHqGFJNW", "postedAt": "2018-03-27T18:49:58.863Z", "postId": "YCAEbRFT8pha3JiXZ", "htmlBody": "<p>In addition to, 35 days total. (I work at Open Phil.)</p>\n", "parentCommentId": "3Y9GfK2afWS7d6icG", "user": {"username": "Nick_Beckstead"}}, {"_id": "mkYa7HsbzXNRRGhpc", "postedAt": "2018-03-28T13:56:39.197Z", "postId": "YCAEbRFT8pha3JiXZ", "htmlBody": "<p>Meta: It might be good to announce AMA's in advance so that more people know to be online at that time.</p>\n", "parentCommentId": null, "user": {"username": "casebash"}}, {"_id": "r7qSCAjyPNDNg84a7", "postedAt": "2018-03-28T13:59:58.275Z", "postId": "YCAEbRFT8pha3JiXZ", "htmlBody": "<p>What's Givewell's CEA?</p>\n", "parentCommentId": "iTsnY5GBWBTTcNaEz", "user": {"username": "casebash"}}, {"_id": "zbnPPJuei76YnoKyM", "postedAt": "2018-03-28T14:28:03.837Z", "postId": "YCAEbRFT8pha3JiXZ", "htmlBody": "<p>Cost-Effectiveness Analysis :) </p>\n", "parentCommentId": "r7qSCAjyPNDNg84a7", "user": {"username": "MarkusAnderljung"}}, {"_id": "vB6gwFqYkjqkvhuju", "postedAt": "2018-03-28T15:50:08.773Z", "postId": "YCAEbRFT8pha3JiXZ", "htmlBody": "<p>(I work for Open Phil.) </p>\n<p>As Holden said elsewhere, &quot;Quantitative aptitude is not a hard requirement for this position (there are some ways the role could evolve that would not require it), but it's a major plus.&quot; In that sense we prefer candidates with quantitative/technical majors, but also note that in most cases we pay more attention to an applicant's performance on the work tests that are part of our application process than we do to their CV. </p>\n<p>Research experience in a current Open Phil focus area is a bonus, but less important than general quantitative aptitude and performance on our work tests.</p>\n", "parentCommentId": "5FBJppAnQak5EsnNt", "user": {"username": "lukeprog"}}, {"_id": "cBE5EbupKzri6ZGot", "postedAt": "2018-03-28T15:50:42.339Z", "postId": "YCAEbRFT8pha3JiXZ", "htmlBody": "<p>(I work for Open Phil.)</p>\n<p>Spending time with <a href=\"https://www.givewell.org/how-we-work/our-criteria/cost-effectiveness/cost-effectiveness-models\">GiveWell's CEA</a> is probably more helpful than reading a textbook. You could also just <a href=\"http://lesswrong.com/lw/h5e/fermi_estimates/\">practice doing Fermi estimates</a> in general.</p>\n", "parentCommentId": "jh7sCcnbhWsc6s2EG", "user": {"username": "lukeprog"}}, {"_id": "LGhMS679fKYt8fQgP", "postedAt": "2018-03-28T15:51:12.466Z", "postId": "YCAEbRFT8pha3JiXZ", "htmlBody": "<p>(I work for Open Phil.)</p>\n<p>Comparing to academia, I'd say that research at Open Phil is (1) consistently targeted at what will help us do as much good as possible rather than what is most intellectually interesting or prestigious, (2) aimed at informing our actions as cheaply as possible, meaning that we cut corners when we don't think doing so will change our bottom-line conclusions, rather than trying to live up to the standards for thoroughness etc. expected in academia, and (3) only aimed at what academia would consider &quot;novel research&quot; when that's what is required to help us do the most good.</p>\n", "parentCommentId": "5vCbHwjqyRPbedEDQ", "user": {"username": "lukeprog"}}, {"_id": "dHgJ6GfLpnDT4SKP9", "postedAt": "2018-03-28T15:53:06.036Z", "postId": "YCAEbRFT8pha3JiXZ", "htmlBody": "<p>The core values and norms are very similar, so specific differences are relatively hard to articulate/pinpoint (which isn't to say they aren't there).</p>\n", "parentCommentId": "motGNMj85zWoHTrc5", "user": {"username": "lukeprog"}}, {"_id": "uLYCYAYz7DgQEbAvf", "postedAt": "2018-03-28T15:53:34.600Z", "postId": "YCAEbRFT8pha3JiXZ", "htmlBody": "<p>(I work for Open Phil.)</p>\n<p>This is tough to answer in general. It would depend hugely on the focus area, their role in that focus area, their fit for Open Phil research analyst work, etc. I can easily think of people who I think are doing more good by working in a focus area, and I can easily think of other people who would be valuable in a focus area but even more valuable as a generalist research analyst at Open Phil.</p>\n", "parentCommentId": "ZdDpg3CQMZewAKaTo", "user": {"username": "lukeprog"}}, {"_id": "Av9XtFzSgNKwZm9ba", "postedAt": "2018-03-28T15:53:58.088Z", "postId": "YCAEbRFT8pha3JiXZ", "htmlBody": "<p>(I work for Open Phil.)</p>\n<p>We'd encourage someone like that to apply, and flag in their application that they currently would plan to leave after a couple years to go to graduate school. Depending on their fit for the work, we might be excited to consider their application anyway, or we might not.</p>\n", "parentCommentId": "vEbYCsR9o9ftC76h5", "user": {"username": "lukeprog"}}, {"_id": "KS6yooPviEs7moEQv", "postedAt": "2018-03-28T15:54:52.573Z", "postId": "YCAEbRFT8pha3JiXZ", "htmlBody": "<p>This one was announced <a href=\"http://effective-altruism.com/ea/1me/upcoming_ama_with_holden_karnofsky_on_job/\">here</a>.</p>\n", "parentCommentId": "mkYa7HsbzXNRRGhpc", "user": {"username": "lukeprog"}}, {"_id": "4gW6C4efoTpcJipPF", "postedAt": "2018-03-28T18:32:02.062Z", "postId": "YCAEbRFT8pha3JiXZ", "htmlBody": "<p>Are you saying that Open Phil &amp; GiveWell cultures are different in hard-to-articulate but important ways? Or that the cultures are basically the same in any way that matters?</p>\n", "parentCommentId": "dHgJ6GfLpnDT4SKP9", "user": {"username": "Milan_Griffes"}}, {"_id": "M4HDAoavfacxrCnXW", "postedAt": "2018-03-29T10:45:02.359Z", "postId": "YCAEbRFT8pha3JiXZ", "htmlBody": "<p>Wow. Working at Open Phil sounds like a dream compared to academia. You've identified three things I spend huge amounts of time doing as part of my research and find intensely irritatingly.</p>\n", "parentCommentId": "LGhMS679fKYt8fQgP", "user": {"username": "MichaelPlant"}}, {"_id": "4otYEFnQg7r8ya4qk", "postedAt": "2018-03-30T15:19:29.686Z", "postId": "YCAEbRFT8pha3JiXZ", "htmlBody": "<p>(I work for Open Phil.)</p>\n<p>For salaried positions there is no &quot;contract length&quot;; employment at Open Philanthropy is <a href=\"https://en.wikipedia.org/wiki/At-will_employment\">at-will</a>, just as it is with most California employers.</p>\n", "parentCommentId": "wtJg6FZkJ6bhyByD3", "user": {"username": "lukeprog"}}, {"_id": "bRQuuecyhy9Nejvww", "postedAt": "2018-03-30T15:19:49.977Z", "postId": "YCAEbRFT8pha3JiXZ", "htmlBody": "<p>(I work for Open Phil.)</p>\n<p>This is tough to answer in general; see my reply to a similar question <a href=\"http://effective-altruism.com/ea/1mf/hi_im_holden_karnofsky_ama_about_jobs_at_open/drr\">here</a>. Probably best to discuss this on an individual basis if/when an applicant reaches the interview stage of our application process.</p>\n", "parentCommentId": "35XBN5SzjKcj6mEbS", "user": {"username": "lukeprog"}}, {"_id": "t7iyhyqygrim3cekx", "postedAt": "2018-03-30T15:20:16.265Z", "postId": "YCAEbRFT8pha3JiXZ", "htmlBody": "<p>It's hard to say. To me the cultures seem very similar, but my personal access to GiveWell culture is limited since I work for Open Phil. Perhaps to other people the cultures seems importantly different, but I can't predict what those perceived differences would be.</p>\n", "parentCommentId": "4gW6C4efoTpcJipPF", "user": {"username": "lukeprog"}}, {"_id": "zudQ2nFcqqJAvW3nJ", "postedAt": "2018-04-01T14:44:05.861Z", "postId": "YCAEbRFT8pha3JiXZ", "htmlBody": "<p>Thanks, Holden, for the AMA and everyone for their questions!</p>\n<p>When looking at the application form initially, there was a mentioning of an applied task as part of the application -- as far as I can tell this has now been removed.</p>\n<p>Could someone confirm this change? Does that mean that the application now only consists of the Google Form plus resume in the first stage?</p>\n<p>Thanks in advance!</p>\n", "parentCommentId": null, "user": {"username": "jackva"}}, {"_id": "xbFJuAh9qPP9saETn", "postedAt": "2018-04-02T20:52:09.056Z", "postId": "YCAEbRFT8pha3JiXZ", "htmlBody": "<p>Yes, we recently removed a 2-question timed test from the job ad page. We wanted to lower the cost of submitting an initial application, and also we want to filter some applications before we request that applicants take the timed test. However, we are still using this timed test in an early part of our application process, and we still think it is diagnostic of who will be a good fit for our research analyst positions.</p>\n<p>(I work for Open Phil.)</p>\n", "parentCommentId": "zudQ2nFcqqJAvW3nJ", "user": {"username": "lukeprog"}}, {"_id": "BaN6ujwPwFiN5SNs8", "postedAt": "2018-04-03T13:30:09.173Z", "postId": "YCAEbRFT8pha3JiXZ", "htmlBody": "<p>Thanks, Luke!</p>\n", "parentCommentId": "xbFJuAh9qPP9saETn", "user": {"username": "jackva"}}, {"_id": "TYKgRPxdB5F58e3Wt", "postedAt": "2018-04-04T15:25:57.920Z", "postId": "YCAEbRFT8pha3JiXZ", "htmlBody": "<p>Thanks for the question - I have wondered the same, as I also studied History at undergraduate level. </p>\n<p>A slight detour from your question, but maybe of interest. There is currently is no community / FB group for people with backgrounds or research interests in History within EA that I know of. There have been quite a few times when discussions around the usefulness of historical studies has come up and it might be good to share ideas and collaborate.</p>\n<p>I don't have time to try and coordinate this at the moment, but it seems like trying to establish some sort of discussion forum (or organisation?) for using the study of history to advance our understanding of (and strategy towards) cause areas which are often prioritised within EA.</p>\n<p>If this is something you (or anyone else seeing this) has an interest in me developing, it's something to bear in mind? People should feel free to contact me at james_a_harris [at] hotmail.co.uk if you want to talk about it further.</p>\n<p>Examples: I'm thinking primarily within Effective Animal Advocacy (Sentience Institute's study of the British antislavery movement; ACE discontinuing their social studies project; technology adoption being considered as a precedent for clean meat e.g. by Sentience Institute and Paul Shapiro) but this would also apply to other fields. The systematic approach described in the post linked at [1] seems to correlate more closely with the approach Holden and others took at OPP than it does the studies done in the Effective Animal Advocacy sphere.</p>\n<p>[1] <a href=\"http://effective-altruism.com/ea/1lz/why_we_should_be_doing_more_systematic_research/\">http://effective-altruism.com/ea/1lz/why_we_should_be_doing_more_systematic_research/</a> </p>\n", "parentCommentId": "5FBJppAnQak5EsnNt", "user": {"username": "Jamie_Harris"}}, {"_id": "Nv3WioEAZS3Qp4EHu", "postedAt": "2018-04-06T23:39:35.088Z", "postId": "YCAEbRFT8pha3JiXZ", "htmlBody": "<p>just emailed you. </p>\n", "parentCommentId": "TYKgRPxdB5F58e3Wt", "user": {"username": "MichaelPlant"}}, {"_id": "AeeCDqQx4SRxj9emK", "postedAt": "2018-04-12T23:29:36.095Z", "postId": "YCAEbRFT8pha3JiXZ", "htmlBody": "<p>What are the stages of the application process? What proportion of applicants do you expect to filter out at each stage? </p>\n", "parentCommentId": null, "user": {"username": "Khorton"}}, {"_id": "sjrLb8SFz2RmKaSDE", "postedAt": "2018-04-13T18:01:32.507Z", "postId": "YCAEbRFT8pha3JiXZ", "htmlBody": "<p>How does Open Philanthropy weigh conformity against talent?  </p>\n", "parentCommentId": null, "user": {"username": "KevinWatkinson"}}, {"_id": "Zh8XGFKk3z22Kh9h3", "postedAt": "2018-04-13T21:44:31.444Z", "postId": "YCAEbRFT8pha3JiXZ", "htmlBody": "<p>Because applicants are working through our application process at different speeds, we're still learning what portion of applicants are invited forward at each stage. We are also adjusting the process as we go along. As of today, our application process looks like this:</p>\n<ol>\n<li>Initial submission of application + résumé.</li>\n<li>2-question timed test.</li>\n<li>A &quot;conversation notes&quot; work test. (compensated via honorarium)</li>\n<li>A brief call, to explain the rest of our process and answer the applicant's questions.</li>\n<li>An &quot;internal grant write-up&quot; work test. (compensated via honorarium)</li>\n</ol>\n<p>To some degree we are still determining next steps after #5, and they depend somewhat on the applicant's availability and preferences, and that's the main thing we discuss with applicants at step #4, on an individual basis.</p>\n", "parentCommentId": "AeeCDqQx4SRxj9emK", "user": {"username": "lukeprog"}}, {"_id": "xb68TaZP4PxPasrKQ", "postedAt": "2018-04-13T21:45:44.156Z", "postId": "YCAEbRFT8pha3JiXZ", "htmlBody": "<p>What kind of conformity are you asking about? Certainly, some degree of alignment with our mission and values is important to us, and so is talent and &quot;fit&quot; for the work. Our team members are encouraged to focus on optimizing for Open Phil's mission, even when it means pushing back on their manager.</p>\n", "parentCommentId": "sjrLb8SFz2RmKaSDE", "user": {"username": "lukeprog"}}, {"_id": "2Apd8mC8zMPeYPDvJ", "postedAt": "2018-04-14T08:45:41.610Z", "postId": "YCAEbRFT8pha3JiXZ", "htmlBody": "<p>Thanks for the response, yes I was wondering about conformity in the sense of prevailing thinking within a particular cause area.  Is there an expectation for talent to conform to prevailing thinking to a certain degree and would this then reinforce that idea of being talented, or could talent be more related to a set of core values or principles?  </p>\n<p>I think some cause areas seem to have fairly high expectations of conformity toward in-group / out-group identity, so if this is the case then talented people may conform or not (given the assumption that not all talented people would necessarily be in-group thinkers), but it seems to confer various advantages on those that do. </p>\n", "parentCommentId": "xb68TaZP4PxPasrKQ", "user": {"username": "KevinWatkinson"}}, {"_id": "JAee4ShpjgByineCN", "postedAt": "2018-04-15T01:00:23.189Z", "postId": "YCAEbRFT8pha3JiXZ", "htmlBody": "<p>Is there any room in the application process for applicants to submit samples of original research or academic letters of recommendation? </p>\n<p>Thank you!</p>\n", "parentCommentId": null, "user": {"username": "Calvin_Baker"}}, {"_id": "RKe84BekTCfdrmDAR", "postedAt": "2018-04-15T01:13:08.633Z", "postId": "YCAEbRFT8pha3JiXZ", "htmlBody": "<p>Yes, you may submit a writing sample by sending it to <a href=\"mailto:jobs@openphilanthropy.org\">jobs@openphilanthropy.org</a>, as FirstName.LastName.Sample (e.g. John.Smith.Sample.doc or John.Smith.Sample.pdf). If you'd like to submit a letter of recommendation, please include it as a page of your résumé.</p>\n<p>Please keep in mind that writing samples and letters of recommendation are entirely optional, so if you don't already have them handy, I don't recommend spending time pulling them together. Our application process puts much more weight on work test performance anyway.</p>\n", "parentCommentId": "JAee4ShpjgByineCN", "user": {"username": "lukeprog"}}, {"_id": "MgfGeYNy4PGYkZLpz", "postedAt": "2018-04-19T03:04:58.375Z", "postId": "YCAEbRFT8pha3JiXZ", "htmlBody": "<p>Here's a question I received via email, which I'll answer here so others can benefit from the answer.</p>\n<p>QUESTION</p>\n<p>Would you be able to give examples of how the research has been used for decision making around giving money/grants?</p>\n<p>ANSWER</p>\n<p>Sure, here are a few examples:</p>\n<ul>\n<li>Our research on the <a href=\"https://www.openphilanthropy.org/research/history-of-philanthropy\">history of philanthropy</a> helped us decide to be more ambitious: &quot;we are more interested in working on daunting problems over long periods of time after learning about some of philanthropy’s past contributions.&quot; This has increased the amount of attention and funding we've spent on daunting challenges that will likely require investment over many years to achieve the impacts we hope for.</li>\n<li>Our <a href=\"https://www.openphilanthropy.org/research/cause-reports#Shallow-0\">shallow investigations into several different global catastrophic risks</a> enabled us to choose initial priorities in that category. Most importantly, we launched grantmaking focus areas in &quot;biosecurity and pandemic preparedness&quot; and &quot;potential risks from advanced artificial intelligence.&quot; Across those two focus areas we've since made more than $80 million in grants.</li>\n<li>Our research on <a href=\"https://www.openphilanthropy.org/blog/new-report-consciousness-and-moral-patienthood\">moral patienthood</a> persuaded us to begin making grants related to fish welfare. Since then, we've made more than $6 million in fish welfare grants.</li>\n</ul>\n", "parentCommentId": null, "user": {"username": "lukeprog"}}, {"_id": "jwA2ceSyjs6gMZMQw", "postedAt": "2018-04-19T10:34:30.659Z", "postId": "YCAEbRFT8pha3JiXZ", "htmlBody": "<p>Is it possible to switch to remote work (in my case in Europe) after working from office in SF e.g. for one year?</p>\n", "parentCommentId": "EnbcN8BTXWnRquaBe", "user": {"username": "MaxRa"}}, {"_id": "vfu6B9aq7JrpPjwKD", "postedAt": "2018-04-21T02:46:22.505Z", "postId": "YCAEbRFT8pha3JiXZ", "htmlBody": "<p>Possibly. If a research analyst excels at the job after being hired, and seems likely to continue excel even while remote, we'd certainly consider it.</p>\n", "parentCommentId": "jwA2ceSyjs6gMZMQw", "user": {"username": "lukeprog"}}, {"_id": "MCa4wXFTKExcNC6EH", "postedAt": "2018-04-25T05:28:05.862Z", "postId": "YCAEbRFT8pha3JiXZ", "htmlBody": "<ul>\n<li><p>If someone was looking to work for OPP would an honours* or masters program be more beneficial than an undergraduate degree?</p>\n</li>\n<li><p>Are there particular questions or areas that could be worked on for a research project in honours/masters that are particularly helpful directly or develop the right kinds of skills for OPP? (especially in economics, philosophy or cognitive science)</p>\n</li>\n<li><p>(&quot;Honours&quot; in Australia is a 1 year research/coursework program)</p>\n</li>\n</ul>\n", "parentCommentId": null, "user": {"username": "rileyharris"}}, {"_id": "Cdw8vSCvhASb8u439", "postedAt": "2018-04-26T05:08:17.979Z", "postId": "YCAEbRFT8pha3JiXZ", "htmlBody": "<p>Completion of an honours or masters program provides us with a bit more evidence about an applicant's capabilities than an undergraduate degree does, but both are less informative to us than the applicant's performance on the various work samples that are part of our application process.</p>\n<p>Because our roles are so &quot;generalist,&quot; there are few domains that are <em>especially</em> relevant, though microeconomics and statistics are two unusually broadly relevant fields. In general, we find that those with a STEM background do especially well at the kind of work we do, but a STEM background is not required. A couple other things that are likely helpful for getting and excelling in an Open Phil research analyst role are <a href=\"https://www.openphilanthropy.org/blog/efforts-improve-accuracy-our-judgments-and-forecasts#Calibration_training\">calibration training</a> and <a href=\"https://www.lesswrong.com/posts/PsEppdvgRisz5xAHG/fermi-estimates\">practice making Fermi estimates</a>.</p>\n", "parentCommentId": "MCa4wXFTKExcNC6EH", "user": {"username": "lukeprog"}}, {"_id": "4w78uwc79QMWkPwbd", "postedAt": "2018-05-02T13:34:56.290Z", "postId": "YCAEbRFT8pha3JiXZ", "htmlBody": "<p>1a. Has Open Phil set any aggressive org-wide goals or timelines for 2018?<br />1b. The published plan for 2018 says that OPP <em>expects</em> to give &quot;well over $100 million&quot; [1]. What is this expectation based on? Or is it a goal?</p>\n<p>2a. Other than current funders, who considers the research coming from Open Phil RAs to be reputable, credible and useful? (ie. government?)<br />2b. Does it matter that RAs aren't PhDs or that Open Phil isn't directly affiliated with any educational institution?</p>\n<p>[1] <a href=\"https://www.openphilanthropy.org/blog/our-progress-2017-and-plans-2018\">https://www.openphilanthropy.org/blog/our-progress-2017-and-plans-2018</a></p>\n", "parentCommentId": null, "user": {"username": "markm"}}, {"_id": "76TXmctEdaEaxAXK6", "postedAt": "2018-05-02T20:44:12.051Z", "postId": "YCAEbRFT8pha3JiXZ", "htmlBody": "<p>Thanks for the response. I understand OPP doesn't control the visa process, but do you have a rough sense of how likely a successful applicant would be to get a visa after being sponsored, or is it a complete unknown?</p>\n", "parentCommentId": "2EmpeDai4qfbDQeBe", "user": {"username": "rjmk"}}, {"_id": "QBj9YhC2H2pgSCM7f", "postedAt": "2018-05-02T22:43:15.441Z", "postId": "YCAEbRFT8pha3JiXZ", "htmlBody": "<p>Quick replies to each:</p>\n<p>1a. Our goals for 2018 are laid out in the post you linked to.</p>\n<p>1b. The expectation is based mostly on the fact that we gave well over $100 million last year, and we're devoting similar time and effort to grantmaking in 2018.</p>\n<p>2a. Open Phil is still a fairly new organization, and I don't think many know much about us yet. Probably we are best known in the effective altruism community, where we seem to have a strong reputation.</p>\n<p>2b. Does it matter for our reputation, do you mean? I'm not sure. I'm not aware of us having received critiques about that. </p>\n", "parentCommentId": "4w78uwc79QMWkPwbd", "user": {"username": "lukeprog"}}, {"_id": "du5QZRxE5chSpxFQR", "postedAt": "2018-05-02T22:43:33.362Z", "postId": "YCAEbRFT8pha3JiXZ", "htmlBody": "<p>Unfortunately the likelihood is still pretty unclear to us at this point, and the available options vary a fair bit by applicant, depending on which country they're from, whether they recently graduated from undergrad or graduate school, and other factors.</p>\n", "parentCommentId": "76TXmctEdaEaxAXK6", "user": {"username": "lukeprog"}}, {"_id": "JZsBTyiwipnQTnc9t", "postedAt": "2018-05-03T13:41:23.844Z", "postId": "YCAEbRFT8pha3JiXZ", "htmlBody": "<p>The purpose of these questions was to better estimate if an RAs impact can be expected to increase, decrease, or remain the same in the coming years.</p>\n<p>An aggressive measurable goal (ie. increase estimated QALYs gained by a factor of x) would indicate to me that an RAs expected impact would increase. (<em>It's possible that a measurable goal might be trivial to set because the error bars might be too large. I don't know enough to know.</em>)  </p>\n<p>If other funders (esp. big funders such as government) considered Open Phil research credible enough to base their decisions on, that would also indicate more expected impact. ie. already published research would be reused in the future by other large donors to effectively allocate more funds.  </p>\n<p>Either way, it seems that an RAs expected impact is higher than many other career alternatives, even if it decreases a bit in the next few years.  </p>\n", "parentCommentId": "QBj9YhC2H2pgSCM7f", "user": {"username": "markm"}}, {"_id": "SRKmJmsNjQd3HzGDM", "postedAt": "2018-05-11T09:59:14.789Z", "postId": "YCAEbRFT8pha3JiXZ", "htmlBody": "<p>Thanks Holden and Luke for answering so many questions &lt;3</p>\n<p>Thinking in terms of broad generalisations/approximations - if you had to draw a graph depicting the value provided to OP by a new research analyst over time, what kind of shape would this graph have?</p>\n<p>Or to ask the question in a different way: Are your efforts to hire for new OP roles motivated more by a desire to make better grants in the next couple of years, or by an intention to have a strong team in place several years from now which does high quality work in the future?</p>\n", "parentCommentId": null, "user": {"username": "Xavier_ORourke"}}, {"_id": "tLpLQQw4Ff7ApQsr8", "postedAt": "2018-05-11T21:11:10.151Z", "postId": "YCAEbRFT8pha3JiXZ", "htmlBody": "<p>Responding to your second formulation of the question, the answer is &quot;more the latter than the former.&quot; We intend to invest heavily in training and mentoring new hires, and we hope that research analysts will end up being long-term core contributors at Open Phil — as research analysts, as grant investigators, and as high-level managers, among other roles — or, in some cases, in important roles that require similar skills outside Open Phil.</p>\n", "parentCommentId": "SRKmJmsNjQd3HzGDM", "user": {"username": "lukeprog"}}, {"_id": "XxTHX2R6MACBx5XNJ", "postedAt": "2018-05-23T21:01:43.745Z", "postId": "YCAEbRFT8pha3JiXZ", "htmlBody": "<p>Somebody asked the following question:</p>\n<blockquote>\n<p>I understand that OP’s preference is to have promising candidates attend an in-person work trial rather than do an additional remote work test; would this preference still stand if the candidate in question has to obtain a US work visa sponsorship in order to attend the in-person trial?</p>\n</blockquote>\n<p>Our reply is: Yes, that preference stands regardless of current work authorization status, though of course in some cases there won't be any way for us to help an applicant get US work authorization, depending on their situation.</p>\n", "parentCommentId": null, "user": {"username": "lukeprog"}}, {"_id": "SvcEMHufRL8PXh8j5", "postedAt": "2018-05-25T17:50:39.930Z", "postId": "YCAEbRFT8pha3JiXZ", "htmlBody": "<p>Thanks for the answer, Luke. I removed the question from here after I reread the &quot;Update on Open Philanthropy research analyst recruiting for 2018&quot; file sent earlier and found the answer there! </p>\n", "parentCommentId": "XxTHX2R6MACBx5XNJ", "user": {"username": "Ahmad"}}, {"_id": "M6PSF6X9zWxRSfK7E", "postedAt": "2018-09-28T22:49:41.570Z", "postId": "YCAEbRFT8pha3JiXZ", "htmlBody": "<p>Michael, apologies for this. I just came back to check this post.\nI didn't ever receive the email because the formatting of the EA forum removed the underscore from my email, and I didn't notice at the time. If you can find the email that you sent from your sent box in April, and could forward it to me at <a href=\"mailto:jamie@sentienceinstitute.org\">jamie@sentienceinstitute.org</a> that would be great! </p>\n", "parentCommentId": "Nv3WioEAZS3Qp4EHu", "user": {"username": "Jamie_Harris"}}]