[{"_id": "S4Wc2ABpXcjdKWizC", "postedAt": "2023-10-04T06:00:01.964Z", "postId": "YcdFW92vXfuFCp4sz", "htmlBody": "<p>Creditors are expected by manifold markets to receive only 40c on each dollar that was invested on the platform (I didn't notice this info in the post when I previously viewed it). And, we do know why there is money missing: FTX stole it and invested it in their hedge fund, which gambled away and lost the money.</p>\n", "parentCommentId": null, "user": {"username": "RyanCarey"}}, {"_id": "ecGyzcFTS6CaDpz9L", "postedAt": "2023-10-04T06:53:58.290Z", "postId": "YcdFW92vXfuFCp4sz", "htmlBody": "<p>It is a bit disheartening to see that some readers will take the book at face value.</p>\n", "parentCommentId": "S4Wc2ABpXcjdKWizC", "user": {"username": "Denise_Melchin"}}, {"_id": "ket6cDyLPeKqgkqKS", "postedAt": "2023-10-04T07:40:57.366Z", "postId": "YcdFW92vXfuFCp4sz", "htmlBody": "<p>I've added manifold markets and more details from the book, not to be fully trusted on face value. Thought they spent/lost a lot of money, and misused funds in Alameda, they had huge amounts of money, so the book figures suggest that might not account for all the customer funds to be lost (if one writes off VC investment and similar)</p>", "parentCommentId": "S4Wc2ABpXcjdKWizC", "user": {"username": "nicky"}}, {"_id": "zQJCxNPmqdcJ7fpYe", "postedAt": "2023-10-04T10:43:16.128Z", "postId": "YcdFW92vXfuFCp4sz", "htmlBody": "<p>I think this is the first description of the book I've seen that hasn't attacked the author.</p><p>The author. You know, one of if not the <a href=\"https://wwnorton.com/books/9780393338829\">world's greatest financial journalists</a> who happens to have also interviewed SBF <a href=\"https://nymag.com/intelligencer/2023/10/michael-lewiss-sbf-book-3-important-things-to-know.html\">over 100 times</a> - before, <a href=\"https://www.theguardian.com/books/2023/may/16/ftx-founder-sam-bankman-fried-to-be-subject-of-high-octane-book-by-michael-lewis\">during</a> and after the collapse - and who <a href=\"https://www.theguardian.com/books/2023/may/16/ftx-founder-sam-bankman-fried-to-be-subject-of-high-octane-book-by-michael-lewis\">said</a> a few months back,</p><blockquote><p>I wanted to be a fly on the wall and he said yes. And to this day he’s never limited my access.</p></blockquote><p>I'd be curious to know if anyone here has significantly updated their view of what happened in light of this book. If there's anyone who hasn't suffered from confirmation bias, I think/hope there's a good chance they can be found in this community.</p>", "parentCommentId": null, "user": {"username": "aprilsun"}}, {"_id": "dbhruj4jpGX7KcArZ", "postedAt": "2023-10-04T11:56:50.997Z", "postId": "YcdFW92vXfuFCp4sz", "htmlBody": "<p>Ryan, you continue to make IMO very overconfident criticisms of others relating to FTX, and I think someone should finally draw public attention to the fact that you<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefvosrh4bbn0q\"><sup><a href=\"#fnvosrh4bbn0q\">[1]</a></sup></span>&nbsp;were actually<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefbbti1lxwsbe\"><sup><a href=\"#fnbbti1lxwsbe\">[2]</a></sup></span>&nbsp;<a href=\"https://felicifia.github.io/thread/657.html#p5945\">the person who introduced SBF to earning to give</a>.</p><p>I'm not quite sure how this all fits together, but I would guess that these two things are not unrelated. And even that you were probably aware of this, given how in your <a href=\"https://forum.effectivealtruism.org/posts/i7DWM6zhhPr2ccq35/thoughts-on-ea-post-ftx#4_\">last post</a> you referenced SBF's/\"Hutch's\" comments on stealing on your Felicifia website (<i>before</i> you pitched earning to give to him, incidentally)?</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnvosrh4bbn0q\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefvosrh4bbn0q\">^</a></strong></sup></span><div class=\"footnote-content\"><p>My aim here is not to criticise you for this. Utilitarians were promoting earning to give at least as far back as <a href=\"https://reducing-suffering.org/why-activists-should-consider-making-lots-of-money/\">2006</a>, Sam was exposed to utilitarianism a lot growing up and in any case, I don't share your apparent urge to place a lot of blame at the feet of any person or idea that played a causal role in this chain of events. My aim is to take some of the wind out of your sails -- I'm tired of you casting stones. If the motivation comes from psychological projection or deflection, I think it's important for others to know that.</p></div></li><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnbbti1lxwsbe\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefbbti1lxwsbe\">^</a></strong></sup></span><div class=\"footnote-content\"><p>Michael Lewis tells us that William MacAskill reached out to SBF in SBF's junior year / \"fall of 2012\" i.e. <a href=\"https://www.scribd.com/document/124816760/Academic-Calendar-2012-2013-MIT\">September to December</a>. You explained earning to give to SBF in July 2012.</p></div></li></ol>", "parentCommentId": "S4Wc2ABpXcjdKWizC", "user": {"username": "aprilsun"}}, {"_id": "CBW8nqwEDG6aribTe", "postedAt": "2023-10-04T12:31:57.072Z", "postId": "YcdFW92vXfuFCp4sz", "htmlBody": "<p>Today, we will start hearing from one of the world's leading sources on massive financial crimes -- the U.S. Attorney's Office for SDNY -- backed by the investigative resources of the U.S. Government and the nearly all-access pass that comes with that and the FTX debtor's cooperation. And we will soon hear from several people, under oath, who were intimately involved in the situation. SBF will have a chance to subject that to the crucible of cross-examination and then tell his own story subject to the same. Perhaps we should defer updates until that happens over the next six weeks.</p>\n", "parentCommentId": "zQJCxNPmqdcJ7fpYe", "user": {"username": "Jason"}}, {"_id": "opJCWuuthvNwaiHCw", "postedAt": "2023-10-04T13:22:11.606Z", "postId": "YcdFW92vXfuFCp4sz", "htmlBody": "<p>I'm sorry, but it's not an \"overconfident criticism\" to accuse FTX of investing stolen money, when this is something that 2-3 of the leaders of FTX have already <a href=\"https://www.nytimes.com/2022/12/21/technology/ftx-fraud-guilty-pleas.html\">pled guilty</a> to doing.</p><p>This interaction is interesting, but I wasn't aware of it (I've only reread a fraction of Hutch's messages since knowing his identity) so to the extent that your hypothesis involves me having had some psychological reaction to it, it's not credible.&nbsp;</p><p>Moreover, these psychoanalyses don't ring true. I'm in a good headspace, giving FTX hardly any attention. Of course, I am not without regret, but I'm generally at peace with my past involvement in EA - not in need of exotic ways to process any feelings. If these analyses being correct would have taken some wind out of my sails, <a href=\"https://www.lesswrong.com/tag/conservation-of-expected-evidence#:~:text=Conservation%20of%20Expected%20Evidence%20is,counter%2Devidence%20%5B1%5D.\">then</a> their being so silly ought to put some more wind in.</p>", "parentCommentId": "dbhruj4jpGX7KcArZ", "user": {"username": "RyanCarey"}}, {"_id": "8yFbSgHTmYEmXuumw", "postedAt": "2023-10-04T13:34:56.947Z", "postId": "YcdFW92vXfuFCp4sz", "htmlBody": "<p>Yes, instead they should take a play money low liquidity prediction market at face value</p>", "parentCommentId": "ecGyzcFTS6CaDpz9L", "user": {"username": "burner"}}, {"_id": "zrG8T9JrPELHesXj2", "postedAt": "2023-10-04T13:39:10.512Z", "postId": "YcdFW92vXfuFCp4sz", "htmlBody": "<p>\"<a href=\"https://forum.effectivealtruism.org/posts/YcdFW92vXfuFCp4sz/going-infinite-new-book-on-ftx-sbf-released-today-my-tl-dr?commentId=S4Wc2ABpXcjdKWizC\">We know they stole it</a>\" does indeed seem overconfident <a href=\"https://forum.effectivealtruism.org/posts/YcdFW92vXfuFCp4sz/going-infinite-new-book-on-ftx-sbf-released-today-my-tl-dr?commentId=CBW8nqwEDG6aribTe\">at this point</a> (and seem to be part of a <a href=\"https://forum.effectivealtruism.org/posts/i7DWM6zhhPr2ccq35/thoughts-on-ea-post-ftx?commentId=6B98LYk3NnDqkdviT\">pattern</a>).</p><p>If you didn't know about the earning to give intro, fair enough.</p>", "parentCommentId": "opJCWuuthvNwaiHCw", "user": {"username": "aprilsun"}}, {"_id": "LeNkcFJKQ4eBhcyyw", "postedAt": "2023-10-04T13:40:07.645Z", "postId": "YcdFW92vXfuFCp4sz", "htmlBody": "<p>On the meta-level, anonymously sharing negative psychoanalyses of people you're debating seems like very poor behaviour.&nbsp;</p><p>Now, I'm a huge fan of anonymity. Sometimes, one must criticise some vindictive organisation, or political orthodoxy, and it's <i>needed</i>, to avoid some unjust social consequences.</p><p>In other cases, anonymity is <i>inessential</i>. One wants to debate in an aggressive style, while avoiding the <i>just</i> social consequences of doing so. When anonymous users misbehave, we think worse of anonymous users in general. If people always write anonymously, then writing anonymously is no-longer a political statement. We no-longer see anonymous writing as a sign that someone might be hiding from unjust retaliation.</p><p>Now, Aprilsun wants EA to mostly continue as normal, which is a majority position in EA leadership. And not to look to deeply into who is to blame for FTX, which helps to defend EA leadership. I don't see any vindictive parties or social orthodoxies being challenged. So why would anonymity be needed?</p>", "parentCommentId": "dbhruj4jpGX7KcArZ", "user": {"username": "RyanCarey"}}, {"_id": "Hwi29J8A7vMGHLrxz", "postedAt": "2023-10-04T13:43:17.323Z", "postId": "YcdFW92vXfuFCp4sz", "htmlBody": "<p>My response to the third link is: <a href=\"https://forum.effectivealtruism.org/posts/i7DWM6zhhPr2ccq35/thoughts-on-ea-post-ftx?commentId=pJMPeYWzpPYNrhbHT\">https://forum.effectivealtruism.org/posts/i7DWM6zhhPr2ccq35/thoughts-on-ea-post-ftx?commentId=pJMPeYWzpPYNrhbHT</a>&nbsp;</p>", "parentCommentId": "zrG8T9JrPELHesXj2", "user": {"username": "RyanCarey"}}, {"_id": "fQk9pREfPQPfar2vw", "postedAt": "2023-10-04T14:05:16.079Z", "postId": "YcdFW92vXfuFCp4sz", "htmlBody": "<p>How about looking at the evidence instead? A large amount of which will soon be evaluated in public court, including testimony from co-conspirators, <a href=\"https://decrypt.co/199852/three-reasons-sbf-will-be-convicted-former-sec-lawyer\">which is not looking good for SBF</a>.&nbsp;</p><p>It's kinda dumb to speculate now when we are getting a ton of extra evidence in the next month, but I personally think there's bugger all chance that all the missing billions are recovered.&nbsp;</p>", "parentCommentId": "8yFbSgHTmYEmXuumw", "user": {"username": "titotal"}}, {"_id": "D8ukBvdB35jZtc9qQ", "postedAt": "2023-10-04T15:46:24.493Z", "postId": "YcdFW92vXfuFCp4sz", "htmlBody": "<p>There's also fairly robust market for (at least larger) real-money claims against FTX with <a href=\"https://www.coindesk.com/markets/2023/09/28/ftx-bankruptcy-claims-soar-in-value-in-over-the-counter-markets-as-estate-recovers-73b/\">prices around 35-40 cents on the dollar</a>. I'd expect recovery to be somewhat higher in nominal dollars, because it may take some time for distributions to occur and that is presumably priced into the market price. (Anyone with a risk appetite for buying large FTX claims probably thinks their expected rate of return on their next-best investment choice is fairly high, implying a fairly high discount rate is being applied here.)</p>", "parentCommentId": "S4Wc2ABpXcjdKWizC", "user": {"username": "Jason"}}, {"_id": "DbbkbrjHRxcCxYrmZ", "postedAt": "2023-10-05T09:28:01.206Z", "postId": "YcdFW92vXfuFCp4sz", "htmlBody": "<p>Reading the book right now like everybody else, I guess. If Lewis is to be believed (complex in parts, as he is clearly seeing all this through Sam-tinted glasses), ALL the members of his inner circle (Caroline, but also Nishad and Wang) were committed EAs, which is something I find disturbing.</p>", "parentCommentId": null, "user": {"username": "Manuel Del Río Rodríguez"}}, {"_id": "xcgvZmtbbTYiR2Bnb", "postedAt": "2023-10-05T12:49:07.791Z", "postId": "YcdFW92vXfuFCp4sz", "htmlBody": "<p>It is remarkable to me that the portrayal of EA in this book seemed more positive vibes than in a lot of popular articles about the actual charity stuff.</p>", "parentCommentId": null, "user": {"username": "Larks"}}, {"_id": "s9f3XjGbY8uQvxcCs", "postedAt": "2023-10-05T20:32:56.406Z", "postId": "YcdFW92vXfuFCp4sz", "htmlBody": "<p>I do think the portrayal of EAs could be worse, but it's pretty bad? EAs are accused of being hypocritical (e.g., way more concerned with money than they would care to admit), culty, overly trusting, overconfident, and <a href=\"https://twitter.com/EAheadlines/status/1709896587604816098\">generally uncool</a>.</p>", "parentCommentId": "xcgvZmtbbTYiR2Bnb", "user": {"username": "hobbes"}}, {"_id": "KwjJm2vLPdaytrwd4", "postedAt": "2023-10-05T22:27:57.978Z", "postId": "YcdFW92vXfuFCp4sz", "htmlBody": "<p>I'd say there are two main aspects that impact negatively on EA portrayal. One I've mentioned below - Lewis goes out of his way to establish that the inner circle were 'the EAs', and implicitly seems to be making the point that Sam's mentality is a perfect match to EA mentality. But much more damning is how he depicts The Schism in early Alameda. Even though he is practically siding with Sam in the dispute, from what he describes it beggars belief how the EA community -and more so its top figures- didn't react in a stronger way after hearing what the Alameda quitters were saying. The pattern of the early Alameda mess very eerily prefigured what would happen, and Sam's shadiness.&nbsp;</p>", "parentCommentId": "s9f3XjGbY8uQvxcCs", "user": {"username": "Manuel Del Río Rodríguez"}}, {"_id": "wLRWYqdQKcPzfu5jY", "postedAt": "2023-10-05T22:38:05.181Z", "postId": "YcdFW92vXfuFCp4sz", "htmlBody": "<p>That assessment seems accurate to me fwiw.&nbsp;</p>", "parentCommentId": "DbbkbrjHRxcCxYrmZ", "user": {"username": "Linch"}}, {"_id": "2ZyJEj4aYKvvHrpXo", "postedAt": "2023-10-06T05:43:57.677Z", "postId": "YcdFW92vXfuFCp4sz", "htmlBody": "<p>I didn’t think that was new information?</p>\n", "parentCommentId": "DbbkbrjHRxcCxYrmZ", "user": {"username": "bec_hawk"}}, {"_id": "HpcwzSxxYBQfqwCjt", "postedAt": "2023-10-06T06:54:52.382Z", "postId": "YcdFW92vXfuFCp4sz", "htmlBody": "<p>It was for me. Also, I had read about Tara and others leaving Alameda and having issues with Sam, but not the gory details.</p>", "parentCommentId": "2ZyJEj4aYKvvHrpXo", "user": {"username": "Manuel Del Río Rodríguez"}}, {"_id": "GbSbBCJBbqJmDDbj4", "postedAt": "2023-10-06T08:09:12.532Z", "postId": "YcdFW92vXfuFCp4sz", "htmlBody": "<p>Independent of aprilsun's spat with Ryan, I am incredibly grateful they have dug up and linked SBF's content on Felicifia. I had tried looking for it and failed, including asking people who I thought might know once or twice, and at least partly questioned whether it was an act of imagination on my part or someone else's that he had posted on there. And the interaction where it seems like Ryan persuaded him of earn-to-give is fascinating as a historical matter (and much less importantly, quite the unilateral first strike to establish a sour internet argument).</p>\n", "parentCommentId": "dbhruj4jpGX7KcArZ", "user": {"username": "DonyChristie"}}, {"_id": "2bqiAjxHmpCys7fpy", "postedAt": "2023-10-06T15:55:32.495Z", "postId": "YcdFW92vXfuFCp4sz", "htmlBody": "<p>Adding an article from the Chronicle of Philantrophy for reference:</p><p><a href=\"https://www.philanthropy.com/article/this-is-effective-altruism-new-book-offers-unflattering-glimpses-of-sam-bankman-frieds-philanthropy\">https://www.philanthropy.com/article/this-is-effective-altruism-new-book-offers-unflattering-glimpses-of-sam-bankman-frieds-philanthropy</a> (free registration required)</p><p>I have not read Lewis' book, but the article appears to summarize several themes in the book related to EA. It is, as the title suggests, not a pro-EA piece.</p>", "parentCommentId": null, "user": {"username": "Jason"}}, {"_id": "PBuZEtxBrfmQJazH8", "postedAt": "2023-10-07T07:39:38.944Z", "postId": "YcdFW92vXfuFCp4sz", "htmlBody": "<p>Is it you, the author? Because your worship of him is akin to Michael's worship of SBF.</p>", "parentCommentId": "zQJCxNPmqdcJ7fpYe", "user": {"username": "Michał Zabłocki"}}, {"_id": "2tZobCGdttfhZdHQx", "postedAt": "2023-10-07T15:19:58.628Z", "postId": "YcdFW92vXfuFCp4sz", "htmlBody": "<p>Speaking as a moderator, this comment seems to break a number of <a href=\"https://forum.effectivealtruism.org/posts/yND9aGJgobm5dEXqF/guide-to-norms-on-the-forum\">our norms</a>. It isn't on-topic, and it's an unnecessary personal attack. I'd like to see better on the forum.</p>", "parentCommentId": "dbhruj4jpGX7KcArZ", "user": {"username": "brook"}}]