[{"_id": "2c5TACQEDGqziqppH", "postedAt": "2023-09-26T23:17:02.549Z", "postId": "YcDXWTzyyfHQHCM4q", "htmlBody": "<p>This is an awesome list! Thanks for putting it together!</p>", "parentCommentId": null, "user": {"username": "MHR"}}, {"_id": "ztXJn4wDJKspu6xvq", "postedAt": "2023-09-27T13:21:14.897Z", "postId": "YcDXWTzyyfHQHCM4q", "htmlBody": "<p><strong>Executive summary</strong>: The post provides a primer on insect sentience and welfare, aimed at helping readers get acquainted with the key scientific evidence, history, scale, and open questions regarding insects' capacity for suffering.</p><p><strong>Key points:</strong></p><ol><li>Insects may have moral significance due to their sentience and capacity for welfare, but this field is poorly understood and full of empirically-unsupported assumptions.</li><li>A lot of work is being done to understand insect nervous systems, behavior, and physiology to improve their welfare.</li><li>The post includes an extensive list of resources for understanding insect pain, sentience, and welfare, including academic papers, forum posts, and books.</li><li>The resources are categorized into topics such as insect sentience and capacity for welfare, history of the discussion, insect welfare cause area and scope, species-specific farmed insect welfare concerns, wild insect welfare concerns, and resources for continuing education.</li><li>The author notes some biases in the list, including a focus on biological information, a skew towards the author's own work and collaborators, and a lack of regular updates.</li><li>The post ends with an invitation to follow the author's lab work on farmed insect welfare and neurobiology starting in January 2024.</li></ol><p>&nbsp;</p><p><i>This comment was auto-generated by the EA Forum Team. Feel free to point out issues with this summary by replying to the comment, and</i><a href=\"https://forum.effectivealtruism.org/contact\"><i>&nbsp;<u>contact us</u></i></a><i> if you have feedback.</i></p>", "parentCommentId": null, "user": {"username": "SummaryBot"}}, {"_id": "a8JC96uLnM79DwQ4F", "postedAt": "2023-09-28T20:15:49.929Z", "postId": "YcDXWTzyyfHQHCM4q", "htmlBody": "<p>Thanks ! This is useful</p>", "parentCommentId": null, "user": {"username": "Corentin Fressoz"}}]