[{"_id": "wP5NgwSpSH3sTzatT", "postedAt": "2022-09-21T09:50:49.414Z", "postId": "YCMgg6x6zWJmran5L", "htmlBody": "<p>I'd be happy for some explanation on why even a binary tag - \"impact\" vs. \"career capital\" - is infeasible. What's the selection process that leads to this being unclear?</p>\n", "parentCommentId": null, "user": {"username": "Guy Raveh"}}, {"_id": "fRsZkFMXakMTJ39MH", "postedAt": "2022-09-21T13:08:57.477Z", "postId": "YCMgg6x6zWJmran5L", "htmlBody": "<p>Imagine a junior level role in gov't where you're working on writing documents about emerging technology that no one important will read. Some things that would seem to my quick thoughts to make this hard:</p><ol><li>This job will initially not have much direct impact, but will ramp up if you're good.</li><li>To be clear, even in the world where you're good, a major source of impact of this role is career capital.</li><li>It's rude to the partners with whom 80k is working to say \"your org is not impactful, we're sending people to you with the understanding that they'll build career capital and leave\".</li></ol>", "parentCommentId": "wP5NgwSpSH3sTzatT", "user": {"username": "jpaddison"}}, {"_id": "RcgFtWfRwohcejtgt", "postedAt": "2022-09-21T13:34:11.619Z", "postId": "YCMgg6x6zWJmran5L", "htmlBody": "<p>I have lots of thoughts and some suggested solutions for this, but my main pushback is that sending someone to that kind of role for that goal without giving them this context is problematic.</p>", "parentCommentId": "fRsZkFMXakMTJ39MH", "user": {"username": "hibukki"}}, {"_id": "DaCqEZzqatdY2Aivg", "postedAt": "2022-09-21T13:37:50.165Z", "postId": "YCMgg6x6zWJmran5L", "htmlBody": "<p>My secondary pushbacks are</p><ol><li>Saying \"we think this org is impactful but not our top in terms of [our complicated calculation]\" isn't something that I think a non-EA org would be insulted about.</li><li>Saying \"you'll learn a lot there that can help you in the rest of your career\" might even be considered positive by such organizations.</li></ol><p>(I'm not jumping to my actual proposed solutions because (A) I'm trying to keep the post focused, and (B) I'd like to wait for 80k's comment, which I expect they'll write soon, and might address what you (JP) wrote)</p>", "parentCommentId": "RcgFtWfRwohcejtgt", "user": {"username": "hibukki"}}, {"_id": "jru4HhLrsfHFbGeBH", "postedAt": "2022-09-21T14:08:50.658Z", "postId": "YCMgg6x6zWJmran5L", "htmlBody": "<p>I think this is putting too much on 80k. They have hundreds of jobs in many different areas listed on their website, and it's a very daunting task to evaluate each one of them when the evaluators are generalists who often have to rely on (conflicting) opinions from people in the community. On top of that, what is career capital for one person could plausibly be direct impact for some other person, so it doesn't really seem one size fits all.</p>\n<p>If somebody can't evaluate jobs on the job board for themselves, I'm not that confident that they'll take a good path regardless. People have a tendency to try to offload thinking to places like 80k, and I actually think it could be bad if 80k made it easier to do that on extremely fine grained topics like individual jobs.</p>\n<p>I do like the idea of having comments on particular jobs. And it also would be good for 80k to be more clear they don't expect all these jobs to necessarily have direct impact.</p>\n<p>I don't know whether it's the case that many people on the internet are looking at the job board and deciding which jobs to apply to when they don't have a strong engagement with EA ideas, and that these sorts of people are the types who would actually get the jobs. If that's the case (80k would know better than me), then I think it maybe does make sense to restrict to jobs that aren't going to be bad if such a person gets them. That seems like an empirical question.</p>\n", "parentCommentId": null, "user": {"username": "ThomasWoodside"}}, {"_id": "kfub8RuJ4bHKcBuTp", "postedAt": "2022-09-21T14:14:33.538Z", "postId": "YCMgg6x6zWJmran5L", "htmlBody": "<p>I disagree - I think it's okay if 80,000 Hours occasionally makes mistakes, but I'd prefer it if their policy was to only add jobs to their job board that they believe would make a positive difference to the world. I don't think that's too much to ask.</p>\n", "parentCommentId": "jru4HhLrsfHFbGeBH", "user": {"username": "Khorton"}}, {"_id": "zZHtmpFRXGg8SK43b", "postedAt": "2022-09-21T14:24:11.253Z", "postId": "YCMgg6x6zWJmran5L", "htmlBody": "<p>Hey Yonatan, thanks very much for posting this! It’s useful for 80k to know this stuff so we can improve what we do and how we communicate about it!</p><p>Posting below a few concrete things we're planning to do (hopefully soon) to help solve some of the issues outlined:<br><br><strong>Better distinguishing more impactful roles</strong></p><p>1. We plan to visually distinguish between orgs on our top recommended list (which we think are the most promising places to work in each problem area) and other orgs we list. Note: we plan to make this available as a filter &amp; in our public API<br><br><strong>Clearly communicating what we think (esp on how we think about career capital and direct impact)</strong></p><p>2. We’ve updated our FAQs to outline as clearly as we can our reasons for listing roles</p><p>3. We’re updating the tagline for the job board (our current one can be improved IMO!). I’ll reply to Guy’s comment now with some more of our thinking on this..</p><p><strong>Encouraging pushback / users to see more info on orgs</strong></p><p>4. We plan to add a link to each org’s EA Forum page on our listings. This is the easiest way we can think of for our users to see more discussion of the orgs</p><p>5. We’re adding the new feedback form to the homepage. Also note: (1) the anonymous feedback form goes to a slack channel that we check regularly and is visible to everyone at 80k, (2) we regularly include or de-list roles based on expert views in each problem area&nbsp;</p>", "parentCommentId": null, "user": {"username": "kush_kan"}}, {"_id": "hhkBt7656dKRLG5oC", "postedAt": "2022-09-21T14:27:13.135Z", "postId": "YCMgg6x6zWJmran5L", "htmlBody": "<p>Hey, (Kush here, new product manager for the 80k job board). This is a good question!&nbsp;<br><br>So we basically post roles for a&nbsp;<i>combination</i> of (1) they are an opportunity for people to have impact in the role, (2) they are an opportunity for the person to build career capital to have an impact in the future.&nbsp;</p><p>In practice very few roles fall squarely in each of these categories and separating out the mix of each factor ex ante is really hard. (All of the roles we think are the most impactful are also great career capital opportunities, and even in a mostly career building role a great person can have a lot of impact).</p><p>I think we haven’t communicated this super well (we're planning on changing our landing page taglines to reflect, and also have updated our FAQs). I’m also hoping that some of the changes in my other comment help on this but we’re also open to further suggestions</p>", "parentCommentId": "wP5NgwSpSH3sTzatT", "user": {"username": "kush_kan"}}, {"_id": "AEKPSdFpgpAfg3pYy", "postedAt": "2022-09-21T14:43:20.527Z", "postId": "YCMgg6x6zWJmran5L", "htmlBody": "<h2>My vision (agreeing but elaborating):</h2><p>If each job<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefa2tmfsx35xr\"><sup><a href=\"#fna2tmfsx35xr\">[1]</a></sup></span>&nbsp;will have a clear place to discuss it, where someone can comment \"I think this is harmful because...\" and someone else can reply \"I think this is wrong because...\", and even the org itself (or 80k) can reply with their take - I would personally say this is a good situation.</p><h1>Extra bonuses from this solution:</h1><ol><li>If I want an impactful job, I have a clear place to check if anyone pushed back on this job and why (and also: seeing no pushback is a useful data point)</li><li>We get a healthy [in my opinion] conversation about impact within the community</li><li>As you said, not \"putting too much on 80k\", which I also endorse</li></ol><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fna2tmfsx35xr\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefa2tmfsx35xr\">^</a></strong></sup></span><div class=\"footnote-content\"><p>Or each org, I'm not sure</p></div></li></ol>", "parentCommentId": "jru4HhLrsfHFbGeBH", "user": {"username": "hibukki"}}, {"_id": "rDer5djfpygtDhnZZ", "postedAt": "2022-09-21T14:54:48.869Z", "postId": "YCMgg6x6zWJmran5L", "htmlBody": "<p>I find myself slightly confused -<strong> does 80k ever promote jobs they consider harmful (but ultimately worth it if the person goes on to leverage that career capital)?</strong></p><p>My impression was that all career-capital building jobs were ~neutral or mildly positive. My stance on the 80k job board—that the set up is largely fine, though the perception of it needs shifting—would change significantly if 80k were listing jobs they thought were net negative if they didn't expect the person to later take an even higher-impact role because of the net negative job.</p>", "parentCommentId": null, "user": {"username": "starmz12345@gmail.com"}}, {"_id": "vKsBnpDHGChGPdvcD", "postedAt": "2022-09-21T15:02:11.134Z", "postId": "YCMgg6x6zWJmran5L", "htmlBody": "<blockquote><p>If somebody can't evaluate jobs on the job board for themselves, I'm not that confident that they'll take a good path regardless.</p></blockquote><p><br>That was also my instinctive reaction to this post. At least in the sense of \"if someone can't distinguish what's mostly for career capital vs. where a specific role ends up saving lives or improving the world, that's a bit strange.\"<br><br>That said, I agree with the post that the communication around the job board can probably be improved!</p>", "parentCommentId": "jru4HhLrsfHFbGeBH", "user": {"username": "Lukas_Gloor"}}, {"_id": "ui55xmYLiji4vrfka", "postedAt": "2022-09-21T15:18:50.888Z", "postId": "YCMgg6x6zWJmran5L", "htmlBody": "<p>I'd worry that this leads to a false sense of security. Just like jobs that people take purely for career capital require some active thinking on the part of the person about when it's enough and when to pivot, one could make a case that <i>most</i> highly impactful jobs wouldn't be exceptionally impactful without \"active thinking\" of a similar kind.<br><br>For instance, any sort of policy work has more or less impact depending on what specific policies you advocate for, not just how well one does it.<br><br>Unfortunately, I think it's somewhat rare that for-profit organizations (especially outside of EA) or governments have streamlined missions and the type of culture that encourages \"having impact\" as a natural part of one's job description. Hospitals are the main counter-example I could think of, since your job description as a doctor or nurse or even as almost any hospital staff is literally about saving lives and may include instructions for working under triage conditions. By contrast, the way I envision work in policy (you obviously know more about this than I do) or things like biosecurity research, I'd imagine it depends a lot on the specific program / group and that people can make a big difference if they have personal initiative – which are things that require paying close attention to one's path to impact (on top of excelling at one's immediate job description).&nbsp;<br><br>What IMO could be quite useful is if 80k would say how much of a given job's impact comes from \"following the job description and doing well in a conventional sense\" vs. \"introducing particular ideas or policies to this organization based on EA principles.\"&nbsp;<br>&nbsp;</p>", "parentCommentId": "kfub8RuJ4bHKcBuTp", "user": {"username": "Lukas_Gloor"}}, {"_id": "8QXW6Betp8CHDkcDr", "postedAt": "2022-09-21T15:38:49.758Z", "postId": "YCMgg6x6zWJmran5L", "htmlBody": "<p>I kind of don't see the point of the job board if it's just \"these are jobs, some are good and some are bad, good luck\"? Why would I use their job board at all? I'd prefer a job board where the rationale for posting each role was something like\"80k thinks you should consider whether you'd have significant impact in this role based on your individual circumstances.\"</p>\n<p>80k doesn't even need to change how they write about their jobs, if that's your concern, and I agree people should still use critical thinking - but I don't think they should list jobs that are likely negative impact or only useful for career capital.</p>\n<p>(As a data point I currently don't use their job board, but I'd be more likely to if they at least aimed to know list jobs that would have a significant positive impact on the world.)</p>\n", "parentCommentId": "ui55xmYLiji4vrfka", "user": {"username": "Khorton"}}, {"_id": "kRL2gFHfhMnanQGMM", "postedAt": "2022-09-21T16:01:09.530Z", "postId": "YCMgg6x6zWJmran5L", "htmlBody": "<p>See also <a href=\"https://www.effectivejobsboard.org/,\">https://www.effectivejobsboard.org/,</a> courtesy of Nathan Young and Superlinear.</p>", "parentCommentId": null, "user": {"username": "Ezra Newman"}}, {"_id": "ZKSJRKdrXHFfrTv67", "postedAt": "2022-09-21T18:11:35.654Z", "postId": "YCMgg6x6zWJmran5L", "htmlBody": "<p>One obvious example is working in AI companies, particularly companies directly aimed at building AGI. The jobs are default harmful, but it might be good for <i>EAs</i> to be the ones to work there (especially if they are careful/have good judgement and substantial moral courage). But the sign of the direct impact case is at best unclear. The career capital case is comparatively stronger however.</p>", "parentCommentId": "rDer5djfpygtDhnZZ", "user": {"username": "Linch"}}, {"_id": "wyGkL5NX3ZdDxM42f", "postedAt": "2022-09-21T18:41:00.048Z", "postId": "YCMgg6x6zWJmran5L", "htmlBody": "<p>Personally I’m super grateful 80,000 Hours posts roles that are good for career capital, even if they are at organisations that have questionable overall impact, and even if the roles themselves may actively do harm. This is because I’m still fairly young and am interested in building career capital!</p>\n<p>It’s plausible a software engineering role at Facebook might do harm, but I still think many EAs would rightly jump at this opportunity, and I’d rather have an EA in the role than a non-EA.</p>\n<p>Also, I feel like it’s pretty easy for me to know which roles are directly impactful and which are for career capital (or which are both). For example, roles that aren’t clearly related to one of 80K’s top problems are usually going to be there for career capital reasons - these are also usually at very well known orgs. 80K actually gives some examples of organisations some people might think are harmful but which they still recommend roles for in their guidance - these being Amazon, Facebook and the US military. It seems pretty obvious to me as someone who has read the rest of 80K’s guidance how to judge the roles for myself and I’m just grateful 80K has listed them for me.</p>\n<p>So I think it would be a big loss if 80,000 Hours stopped posting these roles. Should they make it clearer which roles are immediately directly impactful and which aren’t? Maybe. This would be catering for people who can’t figure it out for themselves, but that isn’t necessarily a bad thing…</p>\n", "parentCommentId": "8QXW6Betp8CHDkcDr", "user": {"username": "jackmalde"}}, {"_id": "r49FJwHREaNBqG66a", "postedAt": "2022-09-21T18:43:47.271Z", "postId": "YCMgg6x6zWJmran5L", "htmlBody": "<p>I agree AGI companies are a good example for where this question matters, and where the impact may not be ~neutral or mildly positive, and this is an important example.</p>\n<p>I agree it might sometimes be worth working there for career capital, which isn't negligible.</p>\n<p>I don't agree that it's ok to send people there without telling them about this plan.</p>\n<p>A \"naive\" example is an engineer working at a great company and building career capital, wanting to move to a company that has high impact, and unknowingly picking an AI org from the 80k job board that does harm, where 80k put the org there for career capital reasons.</p>\n", "parentCommentId": "ZKSJRKdrXHFfrTv67", "user": {"username": "hibukki"}}, {"_id": "pDkD3GBJ5XEShQCZo", "postedAt": "2022-09-21T18:49:03.807Z", "postId": "YCMgg6x6zWJmran5L", "htmlBody": "<p>&lt;3</p><p>0. Communicating your plans: I endorse this!</p><p>&nbsp;</p><ol><li>\"We plan to visually distinguish between orgs on our top recommended list\": Yay!</li><li>\"We’ve updated our FAQs\": Please note I don't think people read your FAQ. We can make another Twitter poll to check this, or (what seems to me like best practice) - watch users browse the site without nudging them to any direction.</li><li>\"We’re updating the tagline for the job board\" - same as &nbsp;point 2: I don't think this will solve the problem, and I'm afraid that hoping otherwise is what lead to this situation originally.</li><li>[see below]</li></ol><p>&nbsp;</p><p>&nbsp;</p><h1>\"We plan to add a link to each org’s EA Forum page on our listings\"&nbsp;</h1><p>I endorse this, <strong>but it doesn't solve the problem</strong>.</p><p>There is no clear place to say \"I think this org isn't impactful / is harmful\", and no clear place to check if anyone said that.</p><p>What do you think?</p><p>Also see <a href=\"https://forum.effectivealtruism.org/posts/YCMgg6x6zWJmran5L/criticism-of-the-80k-job-board-listing-strategy?commentId=AEKPSdFpgpAfg3pYy#zZHtmpFRXGg8SK43b\">this comment</a>.</p><p>&nbsp;</p><p>As I already said, I'm really happy you're working to improve the situation</p>", "parentCommentId": "zZHtmpFRXGg8SK43b", "user": {"username": "hibukki"}}, {"_id": "KNSSLM7nPSPjc332o", "postedAt": "2022-09-21T18:53:18.495Z", "postId": "YCMgg6x6zWJmran5L", "htmlBody": "<p>Big upvote to:</p><blockquote><p>What IMO could be quite useful is if 80k would say how much of a given job's impact comes from \"following the job description and doing well in a conventional sense\" vs. \"introducing particular ideas or policies to this organization based on EA principles.\"</p></blockquote><p>This would <a href=\"https://forum.effectivealtruism.org/posts/YCMgg6x6zWJmran5L/criticism-of-the-80k-job-board-listing-strategy?commentId=zZHtmpFRXGg8SK43b#zZHtmpFRXGg8SK43b\">not solve everything</a>, but it would improve a lot.</p>", "parentCommentId": "ui55xmYLiji4vrfka", "user": {"username": "hibukki"}}, {"_id": "Y6uCvWZNn9nBNuwoc", "postedAt": "2022-09-21T18:56:17.934Z", "postId": "YCMgg6x6zWJmran5L", "htmlBody": "<p>I think I’d be in favour of you guys indicating for each role if it is:</p>\n<ul>\n<li>Mainly there for direct impact</li>\n<li>Mainly there for career capital</li>\n<li>There for both impact and career capital (I.e. neither one clearly dominates the other)</li>\n</ul>\n<p>Obviously whoever is putting the role on the board is doing so for a reason, so should know the answer to this question.</p>\n", "parentCommentId": "hhkBt7656dKRLG5oC", "user": {"username": "jackmalde"}}, {"_id": "pugqqtmHxGvF6y4sY", "postedAt": "2022-09-21T19:01:43.912Z", "postId": "YCMgg6x6zWJmran5L", "htmlBody": "<p>Hey,</p><h1>Regarding jobs for building career capital</h1><p>This is a much simpler problem that I'm happy to help with [<a href=\"https://forum.effectivealtruism.org/posts/ouFFDFmRNwKAc3RMD/i-m-offering-free-engineering-and-consultation-for-ea\">1</a>] [<a href=\"https://forum.effectivealtruism.org/posts/g7kDhcsHeRCpeJijb/become-a-professional-software-developer\">2</a>] [<a href=\"https://forum.effectivealtruism.org/posts/bCDzacsx5cbzNzdHF/software-developers-how-to-have-impact-a-software-career#Plan_B__Work_in_the_industry__build_skills_and_make_money\">3</a>].</p><h1>The problem of finding impactful roles is much harder&nbsp;</h1><p>And that's where I need (and I think others too) help from an org like 80k.</p><h1>Facebook</h1><p>This is not an example of a company that worries me.</p><h1>\"roles that aren’t clearly related to one of 80K’s top problems are usually going to be there for career capital reasons\"</h1><p>I think:</p><ol><li>Some of these are potentially overly damaging</li><li>Roles that are related to 80k's top causes might also be there for career capital</li></ol><h1>\"I’m just grateful 80K has listed them [Amazon, Facebook and the US military] for me\"</h1><p>Again, I think it would be very easy to list roles like this without help from 80k experts. If it seems to be a pain point, perhaps we could talk about it.</p><h1>\"This [saying which roles are impactful and which not] would be catering for people who can’t figure it out for themselves\"</h1><p>I think this is useful in a similar way to how Givewell are useful. They do the analysis so we don't all need to do it individually. Not a perfect example, but points to something I mean.</p><p>I can also tell you in practice that many developers (dozens?) expect this from 80k, and also see the Twitter poll at the top of the post, which I think hints this is a problem for many people</p>", "parentCommentId": "wyGkL5NX3ZdDxM42f", "user": {"username": "hibukki"}}, {"_id": "kHLL7J4X5WJZkAeHD", "postedAt": "2022-09-21T19:04:15.572Z", "postId": "YCMgg6x6zWJmran5L", "htmlBody": "<p>If you'd know that there are many developers (including senior ones) who don't want to do an effectiveness analysis and mainly want to go work somewhere useful, and expect this to be the 80k job board, would that change your mind?</p><p>Or would you say something like \"we don't want to hire those people\"?</p>", "parentCommentId": "vKsBnpDHGChGPdvcD", "user": {"username": "hibukki"}}, {"_id": "4zLuqLpnK94G9Naav", "postedAt": "2022-09-21T19:05:21.627Z", "postId": "YCMgg6x6zWJmran5L", "htmlBody": "<p>This is extra true for complicated calculations like \"<strong>does this AI company do more safety or more capabilities?</strong>\"</p><p>[example <a href=\"https://forum.effectivealtruism.org/posts/zzFbZyGP6iz8jLe9n/agi-ruin-a-list-of-lethalities#Section_C_\">link</a> for why this matters]</p>", "parentCommentId": "kHLL7J4X5WJZkAeHD", "user": {"username": "hibukki"}}, {"_id": "5FYZtGyApE5dczfQ6", "postedAt": "2022-09-21T19:07:47.157Z", "postId": "YCMgg6x6zWJmran5L", "htmlBody": "<p>I didn't write about them because, as opposed to 80k:</p><ol><li>They don't vet and don't claim to. Anyone can add a job.</li><li>They are not (sorry for being extra subjective here, feel free to push back) a corner stone of EA that many people know and trust and have certain <a href=\"https://forum.effectivealtruism.org/posts/YCMgg6x6zWJmran5L/criticism-of-the-80k-job-board-listing-strategy#I_ll_describe_the_poll_in_words__mainly_for_listeners_of_the_Nonlinear_Podcast_\">expectations</a> from.</li></ol>", "parentCommentId": "kRL2gFHfhMnanQGMM", "user": {"username": "hibukki"}}, {"_id": "3MojPkkLZKktJk2Au", "postedAt": "2022-09-21T19:18:44.779Z", "postId": "YCMgg6x6zWJmran5L", "htmlBody": "<blockquote><p>This is a much simpler problem that I'm happy to help with</p></blockquote><p>I'd rather all roles be summarised in one place for simplicity. If people are concerned about not knowing which roles are for career capital vs direct impact then 80K can signpost that - which I think I am in favour of. I'm not sure why removing the career capital roles would be the better approach - I think it would be a loss of value.</p><blockquote><p>Some of these are potentially overly damaging</p></blockquote><p>Can you give some examples? I'm interested.</p><blockquote><p>\"I'm just grateful 80K has listed them for me\"</p></blockquote><p>When I said this I was referring to all roles they list not just the career capital ones by the way.</p>", "parentCommentId": "pugqqtmHxGvF6y4sY", "user": {"username": "jackmalde"}}, {"_id": "QdbXWmcrzLxWdcjr2", "postedAt": "2022-09-21T19:22:12.066Z", "postId": "YCMgg6x6zWJmran5L", "htmlBody": "<p>Thanks, those are good examples and I think you're changing my mind a bit! If the board just lists all kinds of jobs at a particular org and that org also hires for developers (or some other role that requires comparatively little involvement with organizational strategy, perhaps operations in some cases – though note that operations people often take on various responsibility that shape the direction of an organization), that could be quite misleading. This would be a problem even if we don't expect 80k to directly recommend to developers to take developer jobs at an org that they don't think has positive impact.</p><blockquote><p>\"<strong>does this AI company do more safety or more capabilities?</strong>\"</p></blockquote><p>That's yet another challenge, yeah. Especially because there may not even always be a consensus among thoughtful EAs on how much safety work (and what sort of org structure) is enough.&nbsp;</p>", "parentCommentId": "4zLuqLpnK94G9Naav", "user": {"username": "Lukas_Gloor"}}, {"_id": "T3qPbJgG3E9dEd5xH", "postedAt": "2022-09-21T19:54:29.316Z", "postId": "YCMgg6x6zWJmran5L", "htmlBody": "<p>Are you, as a software developer, not aware of roles at Facebook unless you see 80,000 Hours advertise them? I'm struggling to see the value add of advertising a role like that</p>\n", "parentCommentId": "wyGkL5NX3ZdDxM42f", "user": {"username": "Khorton"}}, {"_id": "6EzcB77cnZyM46dcv", "postedAt": "2022-09-21T20:27:05.619Z", "postId": "YCMgg6x6zWJmran5L", "htmlBody": "<p>You might not be aware of them if you haven't signed up for Facebook careers alerts or look at the Facebook careers website regularly.</p><p>Of course you might say \"just sign up for the careers alerts then\". But you'd then want to do this for <strong>all </strong>of the impressive organisations that you would potentially want to work for, of which there may be quite a few. Two possible downsides of this are:</p><ul><li><strong>You might miss a few good options accidentally. </strong>Maybe the places to work as a software engineer are pretty obvious, but this won't always be the case. For example, maybe someone looking to build career capital in policy won't be aware of all of the good options available, including individual think tanks or other organisations that do impactful policy work. I work at the Confederation of British Industry (CBI) which surprisingly many people aren't aware of (I met Will MacAskill one time and he hadn't heard of it!) - but it's got a pretty good reputation and soon after I joined the CBI <a href=\"https://www.linkedin.com/in/felicity-burch-87aa8915/?originalSubdomain=uk\">someone left to become Executive Director of the Centre for Data Ethics &amp; Innovation</a>, a pretty high impact and EA-relevant role. Furthermore I don't <i>think</i> the role she came from at the CBI was a directly high impact role (by EA lights), so the role she came from would have been excluded from 80K's job board under your preference. In short, I doubt everyone is automatically aware of all good career capital roles.</li><li><strong>It might be annoying to have loads of career alert emails when you could see them all in one place. </strong>I quite like getting the email from 80,000 Hours reminding me to look at the job board and then seeing everything in one place. Makes life kind of easy! I don't 100% rely on the 80K job board, but if the 80K job board covers all bases then one could rely on it guilt-free, and it might make life easier for them.</li></ul>", "parentCommentId": "T3qPbJgG3E9dEd5xH", "user": {"username": "jackmalde"}}, {"_id": "hEM7f36eHkXHxMGK8", "postedAt": "2022-09-21T21:43:16.332Z", "postId": "YCMgg6x6zWJmran5L", "htmlBody": "<p>I think you meant to reply to Yonatan Cale and not me?</p>\n", "parentCommentId": "4PPzFhrgNmrHMzbym", "user": {"username": "jackmalde"}}, {"_id": "QCjhKNg7K97goyp8C", "postedAt": "2022-09-21T22:57:43.362Z", "postId": "YCMgg6x6zWJmran5L", "htmlBody": "<blockquote>\n<p>This is a much simpler problem that I'm happy to help with</p>\n</blockquote>\n<p>Just flagging that you're referring to the problem of \"getting career capital as a SW engineer\" and not \"getting career capital\", which is in general much harder.</p>\n<p>Though the problem you are talking about is in my opinion somewhat more complex than you think.</p>\n", "parentCommentId": "pugqqtmHxGvF6y4sY", "user": {"username": "Guy Raveh"}}, {"_id": "EhdfPqwAjnzDwkh54", "postedAt": "2022-09-21T22:58:40.369Z", "postId": "YCMgg6x6zWJmran5L", "htmlBody": "<p>And you're right. I wonder why I can't delete it?</p>\n", "parentCommentId": "hEM7f36eHkXHxMGK8", "user": {"username": "Guy Raveh"}}, {"_id": "AvTmgjXSHDmF4unBG", "postedAt": "2022-09-22T04:16:54.820Z", "postId": "YCMgg6x6zWJmran5L", "htmlBody": "<p>Thanks. I did not mean to imply that working in AGI companies to build career capital is clearly good or even something that will come out to be net positive after (more informed) reflection. I find myself pretty confused about the sign, and know people who have strong arguments or beliefs in both directions.</p>", "parentCommentId": "r49FJwHREaNBqG66a", "user": {"username": "Linch"}}, {"_id": "iCyYGsqxXEsyHwe4J", "postedAt": "2022-09-22T07:44:51.592Z", "postId": "YCMgg6x6zWJmran5L", "htmlBody": "<p>I'm talking to guy one on one about what complexity I'm missing and he may share anything I say</p>\n", "parentCommentId": "QCjhKNg7K97goyp8C", "user": {"username": "hibukki"}}, {"_id": "i9S4RxcCCTaHFaeYq", "postedAt": "2022-09-22T07:49:49.545Z", "postId": "YCMgg6x6zWJmran5L", "htmlBody": "<p>I'm not against keeping career capital roles in if they're clearly marked</p>\n", "parentCommentId": "3MojPkkLZKktJk2Au", "user": {"username": "hibukki"}}, {"_id": "xqzF8hY3dK4smy7Ez", "postedAt": "2022-09-22T07:57:23.530Z", "postId": "YCMgg6x6zWJmran5L", "htmlBody": "<p>JP,  regarding your point 3:</p>\n<blockquote>\n<p>It's rude to the partners with whom 80k is working to say \"your org is not impactful, we're sending people to you with the understanding that they'll build career capital and leave\".</p>\n</blockquote>\n<p>See 80k's response, which I interpret as \"they are willing to be 'rude' and say that an org isn't top recommended\"</p>\n<blockquote>\n<p>We plan to visually distinguish between orgs on our top recommended list (which we think are the most promising places to work in each problem area) and other orgs we list.</p>\n</blockquote>\n<p><a href=\"https://forum.effectivealtruism.org/posts/YCMgg6x6zWJmran5L/criticism-of-the-80k-job-board-listing-strategy?commentId=zZHtmpFRXGg8SK43b\">https://forum.effectivealtruism.org/posts/YCMgg6x6zWJmran5L/criticism-of-the-80k-job-board-listing-strategy?commentId=zZHtmpFRXGg8SK43b</a></p>\n<p>I endorse their approach here</p>\n", "parentCommentId": "DaCqEZzqatdY2Aivg", "user": {"username": "hibukki"}}, {"_id": "9EKKBki8BitsGfk4C", "postedAt": "2022-09-22T08:01:41.876Z", "postId": "YCMgg6x6zWJmran5L", "htmlBody": "<p>Examples:\nDiscussing one here:\n<a href=\"https://forum.effectivealtruism.org/posts/YCMgg6x6zWJmran5L/criticism-of-the-80k-job-board-listing-strategy?commentId=zZHtmpFRXGg8SK43b\">https://forum.effectivealtruism.org/posts/YCMgg6x6zWJmran5L/criticism-of-the-80k-job-board-listing-strategy?commentId=zZHtmpFRXGg8SK43b</a></p>\n", "parentCommentId": "3MojPkkLZKktJk2Au", "user": {"username": "hibukki"}}, {"_id": "wFgymvYgzaqG9jMDM", "postedAt": "2022-09-22T08:03:58.878Z", "postId": "YCMgg6x6zWJmran5L", "htmlBody": "<p>Thanks for saying!</p>\n<p>Regarding</p>\n<blockquote>\n<p>there may not even always be a consensus among thoughtful EAs on how much safety work (and what sort of org structure) is enough.</p>\n</blockquote>\n<p>My current best suggestion is \"let there be a place for the community to discuss this, and then job seekers can at least see the discussion, at least see what the main arguments are of if they even exist\".\nWhat do you think?</p>\n", "parentCommentId": "QdbXWmcrzLxWdcjr2", "user": {"username": "hibukki"}}, {"_id": "dF3BZF9xitGrzEXNR", "postedAt": "2022-09-22T08:29:24.719Z", "postId": "YCMgg6x6zWJmran5L", "htmlBody": "<p>Are you sure you linked to the right place? I don’t see an example of a role you think is very harmful</p>\n", "parentCommentId": "9EKKBki8BitsGfk4C", "user": {"username": "jackmalde"}}, {"_id": "dZcmGCNgFJaktqYpT", "postedAt": "2022-09-22T14:21:40.214Z", "postId": "YCMgg6x6zWJmran5L", "htmlBody": "<p>Building career capital doesn't automatically mean leaving. If we take the example of the junior-level role in government, building career capital means being able to access senior roles in government in the future instead of leaving.&nbsp;</p>", "parentCommentId": "fRsZkFMXakMTJ39MH", "user": {"username": "ChristianKleineidam"}}, {"_id": "JbmpfrrR8CHjrA9nc", "postedAt": "2022-09-22T22:08:01.976Z", "postId": "YCMgg6x6zWJmran5L", "htmlBody": "<p>Hi,</p><p>I was quite afraid when I read that there are jobs listed for career capital. I'm glad to read that actually there is a combination of impact and capital. I hope all jobs posted have a significant positive impact.</p><p>In my mind \"High Impact\" should be the first priority. If we have to add other considerations I would also go for “EA Community Expansion and Diversity” as more important than \"Career Capital\".</p><p>Let's assume we have already listed all the High Impact opportunities we can find. As the next step I would go for listing the second job position in China rather than the 301<sup>st</sup> in San Francisco, even if the second one is better for career capital.<br><br><i>Note: I edited my original post to make it more clear</i>.</p>", "parentCommentId": "hhkBt7656dKRLG5oC", "user": {"username": "Miguel Lima Medín"}}, {"_id": "DnBkZWFciG8t8sHFP", "postedAt": "2022-09-22T22:46:00.006Z", "postId": "YCMgg6x6zWJmran5L", "htmlBody": "<p>I think it is kind of odd to say that the setup of the jobs board is fine but the perspective needs shifiting, as 80k are by far best positioned to change the perspective people have of the jobs board.<br><br>I am not confident that 80k are making a bad trade off here, the current setup may well be close to optimal given the tradeoffs (including the time tradeoff of bothering to optimise these things). But, I am a bit averse to attitudes of 'it's not this one orgs problem, everyone else needs to change' when it seems more efficient to address issues at the source.<br>&nbsp;</p>", "parentCommentId": "rDer5djfpygtDhnZZ", "user": {"username": "calebp"}}, {"_id": "QEDjC78JoCpArjWJr", "postedAt": "2022-09-22T22:54:20.656Z", "postId": "YCMgg6x6zWJmran5L", "htmlBody": "<blockquote><p>If somebody can't evaluate jobs on the job board for themselves, I'm not that confident that they'll take a good path regardless. People have a tendency to try to offload thinking to places like 80k, and I actually think it could be bad if 80k made it easier to do that on extremely fine grained topics like individual jobs.</p></blockquote><p>&nbsp;</p><p>I often agree with something in this direction in specific cases, when there is some skill that is present in both the job choosing and job performing endeavour. I think job choosing is often largely about 'having good judgement and caring a lot' whereas doing well in a job often does not rely on 'having good judgment'.&nbsp;<br><br>I think there are many examples of solid software engineers, operations staff, marketers etc. where having good judgement does not seem to be particularly important for their role (although that's not to say good judgement and these roles are anticorrelated or that good judgment isn't ever required here).</p>", "parentCommentId": "jru4HhLrsfHFbGeBH", "user": {"username": "calebp"}}, {"_id": "Fi3fhvup5SgjtN6RY", "postedAt": "2022-09-23T01:06:14.997Z", "postId": "YCMgg6x6zWJmran5L", "htmlBody": "<p>I think you're right and it's worth thinking about these cases. That being said, I think tail impact is going to come from people who have good judgement including on how to develop their careers, open new opportunities, and select future jobs across their career. It's unclear to me which group the 80k job board should be catering to, but plausibly those most extremely self-motivated people don't need a job board to show them their options.</p>\n", "parentCommentId": "QEDjC78JoCpArjWJr", "user": {"username": "ThomasWoodside"}}, {"_id": "kqoJk5pxeATqjjjgr", "postedAt": "2022-09-23T02:46:03.893Z", "postId": "YCMgg6x6zWJmran5L", "htmlBody": "<p>+1</p><p>People who don't need a job board don't need a job board</p>", "parentCommentId": "Fi3fhvup5SgjtN6RY", "user": {"username": "hibukki"}}, {"_id": "ahJKKC374zCmck22a", "postedAt": "2022-09-23T14:57:01.101Z", "postId": "YCMgg6x6zWJmran5L", "htmlBody": "<p>To clarify, I agree that 80k is the main actor who could + should change people's perceptions of the job board!</p>\n", "parentCommentId": "DnBkZWFciG8t8sHFP", "user": {"username": "starmz12345@gmail.com"}}, {"_id": "Pqo95gnZFaqT6MS6H", "postedAt": "2022-09-24T15:16:03.952Z", "postId": "YCMgg6x6zWJmran5L", "htmlBody": "<p>How would you plan this exactly? Comments per job posting or per organisation?</p>\n<p>On the one hand job postings come and go, so if you think anyone working at [Effective Consultancy] is doing a bad thing, you don't want to have to keep looking for their postings and re-comment.</p>\n<p>On the other hand, maybe you think their [Consultancy Safety] team is currently doing good work, and you want to endorse it temporarily while not endorsing the rest of EC.</p>\n", "parentCommentId": "AEKPSdFpgpAfg3pYy", "user": {"username": "Guy Raveh"}}, {"_id": "aCNApdHMZ9rhjNDCt", "postedAt": "2022-10-07T11:34:14.075Z", "postId": "YCMgg6x6zWJmran5L", "htmlBody": "<p>A problem for 80,000 Hours' jobs board and marketing departments (from my outside perspective): the overall effect we should expect, if 80K have powerful marketing that brings new people into the website, and if the jobs board doesn't distinguish career capital roles from impact roles, is that 80K funnels people with little exposure to EA ideas straight into career capital roles (which those people mistake for impactful roles), and 80K loses contact with them thereafter; and the overall effect of that would be to have ~no direct impact, and possibly prevent a more-engaged person from accessing the career capital.</p>", "parentCommentId": null, "user": {"username": "David Mears"}}, {"_id": "zWzHJWNQfYns32P7n", "postedAt": "2023-05-24T21:55:36.901Z", "postId": "YCMgg6x6zWJmran5L", "htmlBody": "<p>(I see that this is old) Etsy's product reviews for every product in the seller's shop are all on every product page. There might be some fancy sorting bringing the more relevant reviews to the top, I'm not sure. So with a model like this, you could review one job posting, and people could see that job posting review on all the company's other job postings.</p>", "parentCommentId": "Pqo95gnZFaqT6MS6H", "user": {"username": "Spencer Ericson"}}, {"_id": "FiDhKgpfjPCiqQBTA", "postedAt": "2023-09-11T11:52:44.511Z", "postId": "YCMgg6x6zWJmran5L", "htmlBody": "<p>Update:</p><p>I love that the 80k job board team added this filter:</p><figure class=\"image\"><img src=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/FiDhKgpfjPCiqQBTA/q6zqwhauc8p6zsybtacy\" srcset=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/FiDhKgpfjPCiqQBTA/kpiwdaqwd2nl71yusfcl 118w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/FiDhKgpfjPCiqQBTA/ltezvz62hcjbgjxbusnn 198w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/FiDhKgpfjPCiqQBTA/pbogymzrmpgim3fxdsyg 278w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/FiDhKgpfjPCiqQBTA/u7irt8ynkobogmdl0hhi 358w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/FiDhKgpfjPCiqQBTA/r2sjscqevl1wtk3j0upj 438w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/FiDhKgpfjPCiqQBTA/kk1qjkb1nzzljailpttk 518w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/FiDhKgpfjPCiqQBTA/c6khhvq4srionuqorwcz 598w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/FiDhKgpfjPCiqQBTA/zhf7smtbkiamxsrleaob 678w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/FiDhKgpfjPCiqQBTA/wreolqscibfbnq65vqdo 758w\"></figure><p>as well as in the \"area\":</p><figure class=\"image\"><img src=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/FiDhKgpfjPCiqQBTA/oibx7dlfcxz17f6oly8u\" srcset=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/FiDhKgpfjPCiqQBTA/cfduspwdesfe82zpzek6 90w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/FiDhKgpfjPCiqQBTA/c87j2f3sowqbar8nbjoq 180w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/FiDhKgpfjPCiqQBTA/kx4gxys9ibsm9y0ffuwk 270w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/FiDhKgpfjPCiqQBTA/gai2ntjbirwhaybj5hzi 360w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/FiDhKgpfjPCiqQBTA/nesnsjfr5rh4j0bo2dpf 450w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/FiDhKgpfjPCiqQBTA/hnwcsorgftrvjdboqqqi 540w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/FiDhKgpfjPCiqQBTA/iozfnwgqaylkr3wt8cbd 630w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/FiDhKgpfjPCiqQBTA/loi3b6jwdmp9e2gtzum0 720w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/FiDhKgpfjPCiqQBTA/qflq6ski768n0wtwdbzu 810w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/FiDhKgpfjPCiqQBTA/vdxvtugdko4gwwrzl2ay 850w\"></figure><p>And the tags (and even title!) in some of the postings:</p><figure class=\"image\"><img src=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/FiDhKgpfjPCiqQBTA/dpcmihiocxr6wsrxvemw\" srcset=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/FiDhKgpfjPCiqQBTA/juglgcehk3uv1wecr7cb 200w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/FiDhKgpfjPCiqQBTA/lmnf2bzhteuxf0teewh6 400w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/FiDhKgpfjPCiqQBTA/cszrhnmoizvivofv7rvp 600w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/FiDhKgpfjPCiqQBTA/fvgk6edkkcfgpcnn5mlb 800w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/FiDhKgpfjPCiqQBTA/xsixq1xkeahrzmpfcsmg 1000w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/FiDhKgpfjPCiqQBTA/pca0eupes07kdp3ppbdl 1200w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/FiDhKgpfjPCiqQBTA/zqjppsg8swd3ru86zxp6 1400w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/FiDhKgpfjPCiqQBTA/izkeaarnrqyxdxu2rtmb 1600w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/FiDhKgpfjPCiqQBTA/xdlefpvjw3oiwuj7xwsx 1800w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/FiDhKgpfjPCiqQBTA/el80flud0jxd0927itkk 1986w\"></figure><p>(and maybe more things I didn't notice yet?)</p><p>&nbsp;</p><p>This seems both well communicated (I won't take a job that I mistakenly think is rated by 80k as high impact) and it's easy to configure based on what I'm actually looking for.</p><p>I really like it, and I'll edit the post to indicate that the original criticism I had is mostly resolved.</p><p>Kudos from me to <a href=\"https://forum.effectivealtruism.org/users/kush_kan?mention=user\">@kush_kan</a> and the rest of the team</p>", "parentCommentId": null, "user": {"username": "hibukki"}}, {"_id": "ad8CkBCxyhiebcGoY", "postedAt": "2023-09-11T11:57:27.943Z", "postId": "YCMgg6x6zWJmran5L", "htmlBody": "<p>Tiny suggestion:&nbsp;</p><p>&nbsp;</p><p>In the \"Career development: Technical tag\"</p><figure class=\"image\"><img src=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/ad8CkBCxyhiebcGoY/yhxagssxyccvani09jfa\" srcset=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/ad8CkBCxyhiebcGoY/ukrrxij37jh23hnfqrdm 112w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/ad8CkBCxyhiebcGoY/slcvnqsw9xt5ynlg3ebz 192w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/ad8CkBCxyhiebcGoY/pwyjvxpdg0u82knuzayp 272w, https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/ad8CkBCxyhiebcGoY/bfx0iebkmynt0yfobjon 352w\"></figure><p>add alt text that appears when my mouse is over it, similarly to what you did here:</p><figure class=\"image\"><img src=\"https://res.cloudinary.com/cea/image/upload/f_auto,q_auto/v1/mirroredImages/FiDhKgpfjPCiqQBTA/q6zqwhauc8p6zsybtacy\"></figure><p>(which looks really good and clear to me, I love it)</p>", "parentCommentId": "FiDhKgpfjPCiqQBTA", "user": {"username": "hibukki"}}, {"_id": "4PPzFhrgNmrHMzbym", "postedAt": "2022-09-21T21:31:05.158Z", "postId": "YCMgg6x6zWJmran5L", "htmlBody": null, "parentCommentId": "3MojPkkLZKktJk2Au", "user": null}]