[{"_id": "uFMXsdbtebBLB5v2Q", "postedAt": "2017-10-26T14:42:40.623Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>You report EA as being 70% male. How unusual is that for a skew? One comparison point for this, for which data is easily abundant, is readerships of websites that are open-to-read (no entry criteria, no member fees). Looking at the distribution of such websites, 70% seems like a relatively low end of skew. For instance, Politico and The Hill, politics news sites, see 70-75% male audiences (<a href=\"https://www.quantcast.com/politico.com#demographicsCard\">https://www.quantcast.com/politico.com#demographicsCard</a> and <a href=\"https://www.quantcast.com/thehill.com#demographicsCard\">https://www.quantcast.com/thehill.com#demographicsCard</a>) whereas nbc.com, a mainstream TV, entertainment, and celebrity site, sees a 70% female audience: <a href=\"https://www.quantcast.com/nbc.com#demographicsCard\">https://www.quantcast.com/nbc.com#demographicsCard</a></p>\n<p>(I'm not trying to pick anything too extreme, I'm picking things pretty close to the middle. A lot of topics have far more extreme skews, like programming, hardcore gaming, fashion, see <a href=\"https://www.wikihow.com/Understand-Your-Website-Audience-Profile#Understanding_the_gender_composition_and_index_of_your_website_sub\">https://www.wikihow.com/Understand-Your-Website-Audience-Profile#Understanding_the_gender_composition_and_index_of_your_website_sub</a> for more details on how the gender skew of websites differs based on the topic).</p>\n<p>Based on this, and similar data I've seen, a 70% skew in either gender direction feels pretty unremarkable to me in the context of today's broader society and the domain-specific skews that are common across both mainstream and niche domains. I expect something similar to be true for race/ethnicity based on the Quantcast and similar data but I haven't obtained that much familiarity with the numbers or their reliability.</p>\n", "parentCommentId": null, "user": {"username": "vipulnaik"}}, {"_id": "wNWrmLquQCbnqxiqY", "postedAt": "2017-10-26T15:22:26.082Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>Obligatory SlateStarCodex post for the graphs: <a href=\"http://slatestarcodex.com/2017/08/07/contra-grant-on-exaggerated-differences/\">http://slatestarcodex.com/2017/08/07/contra-grant-on-exaggerated-differences/</a></p>\n<p>&quot;We can relax the Permanent State Of Emergency around too few women in tech, and admit that women have the right to go into whatever field they want, and that if they want to go off and be 80% of veterinarians and 74% of forensic scientists, those careers seem good too.&quot;</p>\n", "parentCommentId": "uFMXsdbtebBLB5v2Q", "user": {"username": "casebash"}}, {"_id": "T392qW8NgjZWov33x", "postedAt": "2017-10-26T15:39:09.977Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>Thank you for the interesting post Kelly. I was interested in your comment:</p>\n<blockquote>\n<p>people tend to think that women are more intuitively-driven and less analytical than men, which does not seem to be borne out and in fact the opposite may be more likely</p>\n</blockquote>\n<p>And followed the link through to Forbes. I think the part you are citing is this:</p>\n<blockquote>\n<p>But research shows that women are just as data-driven and analytical as men, if not more so. In a sample of 32 studies that looked at how men and women thought about a problem or made a decision, 12 of the studies found that women adopted an analytical approach more often than men, meaning that women systematically turned to the data, while men were more inclined to go with their gut, hunches, or intuitive reactions. The other 20 studies? They found no difference between men and women’s thinking styles.</p>\n</blockquote>\n<p>Unfortunately, the link there is broken. Do you know what the original source is?</p>\n", "parentCommentId": null, "user": {"username": "Ben_West"}}, {"_id": "RAJM47Syj59SkS6rx", "postedAt": "2017-10-26T15:49:22.716Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>Thanks so much for this thoughtful and well-researched write-up, Kelly. The changes you recommend seem extremely promising and it's very helpful to have all of these recommendations in one place.</p>\n<p>I think that there are some additional reasons that go beyond those stated in this post that increase the value of making the EA a more diverse and inclusive community. First, if the EA movement genuinely aspires to cause-neutrality, then we should care about benefits that accrue to others regardless of who these other people are and independent of what the causal route to these benefits is. As such, we should also care about the benefits that becoming a diverse and inclusive movement would have for women, people of color, and disabled and trans people in and outside of the community. If, as you argue and as is antecedently quite plausible, the EA movement is essentially engaging in the very same discriminatory practices in our movement-building as people tend to engage in everywhere else, then as a result we are artificially boosting the prestige, visibility, and status perception of white, cis, straight, able-bodied men, we are creating a community that is less sensitive to stereotype threat and to micro- and macroaggressions than it otherwise could be, and we are giving legitimacy to stereotypes and to business and nonprofit models which arbitrarily exclude many people. All of this causes harm or a reduction in the status or power of women, people of color, and disabled and trans people and advances their discrimination - which is a real and significant cost to organizing in this way.</p>\n<p>Second, even if one thinks that this effect size will be very small compared to the good that the EA movement is doing (which is less obvious than EAs sometimes assume without argument), 1) these are still pure benefits, which strengthens the case for and the reasons favoring improving the EA community in the respects you argue, and 2) if the EA community fails to become more diverse and inclusive we'll suffer reputation costs in the media, in academia, among progressives, and in the nonprofit world for being a community that is exclusionary. This would come at a significant cost to our potential to build a large and sustainable movement and to create strong, elite networks and ties. And at this point, this worry is very far from a mere hypothetical:</p>\n<p><a href=\"https://www.vox.com/2015/8/10/9124145/effective-altruism-global-ai\">https://www.vox.com/2015/8/10/9124145/effective-altruism-global-ai</a></p>\n<p><a href=\"https://www.lrb.co.uk/v37/n18/amia-srinivasan/stop-the-robot-apocalypse\">https://www.lrb.co.uk/v37/n18/amia-srinivasan/stop-the-robot-apocalypse</a></p>\n<p><a href=\"https://www.youtube.com/watch?v=ICKxhc5VOr8&amp;feature=youtu.be&amp;t=33m24s\">https://www.youtube.com/watch?v=ICKxhc5VOr8&amp;feature=youtu.be&amp;t=33m24s</a></p>\n<p>I think we have our work cut out for us if we want to build a better reputation with the world outside of our (presently rather small) community, and that the courses of action you recommend will go quite a long way to getting us there.</p>\n", "parentCommentId": null, "user": {"username": "tylermjohn"}}, {"_id": "tQ7nEuY29X2nSxJX9", "postedAt": "2017-10-26T15:49:25.001Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<blockquote>\n<p>I prefer to play the long game with my own investments in community building, and would rather for instance invest in someone reasonably sharp who has a track record of altruism and expresses interest in helping others most effectively than in someone even sharper who reasoned their way into EA and consumed all the jargon but has never really given anything up for other people</p>\n</blockquote>\n<p>I believe that Toby Ord has talked about how, in the early days of EA, he had thought that it would be really easy to take people who are already altruistic and encourage them to be more concerned about effectiveness, but hard to take effectiveness minded people and convince them to do significant altruistic things. However, once he actually started talking to people, he found the opposite to be the case.</p>\n<p>You mention &quot;playing the long game&quot; – are you suggesting that the &quot;E first, A second&quot; people are easier to get on board in the short run, but less dedicated and therefore in the long run &quot;A first, E second&quot; folks are more valuable? Or are you saying that my (possibly misremembered) quote from Toby is wrong entirely?</p>\n", "parentCommentId": null, "user": {"username": "Ben_West"}}, {"_id": "XSgzGcBC8hdiAxjqa", "postedAt": "2017-10-26T16:24:49.094Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>I think that your link to Georgia Ray's piece should make it clearer that her conclusion is</p>\n<blockquote>\n<p>Studies don’t show that diversity has an overall clear effect, positive or negative, on the performance of teams or groups of people. (1) (2) The same may also be true on an organizational level. (3)</p>\n</blockquote>\n<p>Your link implies that Georgia's post is overall positive on the effect of diversity on the performance of teams or groups, which I think is incorrect.</p>\n", "parentCommentId": null, "user": {"username": "Buck"}}, {"_id": "AT3L6zSHeMj7pHNv8", "postedAt": "2017-10-26T16:48:46.497Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>I didn’t mean to imply that — I just cited it as a source for the specific claims in that sentence. The other evidence I cite seems to imply it overall, and she doesn’t seem to account for all of that evidence.</p>\n<p>I can’t tag here, but Georgia, if you see this I’d be curious for your opinion on how the totality of evidence weighs, particularly in expectation regardless of how robust it is.</p>\n", "parentCommentId": "XSgzGcBC8hdiAxjqa", "user": {"username": "Kelly_Witwicki"}}, {"_id": "4u6Ze6ETmyWsocNGd", "postedAt": "2017-10-26T17:13:04.984Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>It feels like a bad practice to take a post which concludes that the effects are mixed or small, then <em>just</em> cite the effects in that post which seem positive and not mention the ones that seem negative or that the post overall disagrees with what you're trying to use it to argue for.</p>\n", "parentCommentId": "AT3L6zSHeMj7pHNv8", "user": {"username": "Buck"}}, {"_id": "py9mJSmx5dkiEcEZK", "postedAt": "2017-10-26T17:19:48.919Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>Thanks Kelly. I agree that this is a problem in EA in ways that people don't realize. In retrospect, I feel stupid for not realizing how casual discussion of IQ and eugenics would be hurtful. Same thing with applying that classic EA skepticism to people's lived experiences. </p>\n<p>Culture isn't the main reason I left EA, but it's #3. And I think it contributes to the top two reasons I felt alienated: the mockery of moral views that deviate from strict utilitarianism, and what I believed were naive over-confident tactics. </p>\n", "parentCommentId": null, "user": {"username": "Lila"}}, {"_id": "HEF9sxQu73vbJ8ovz", "postedAt": "2017-10-26T17:24:24.036Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>Politics is rarely used as an example of a positive environment for women. </p>\n<p>It's not just the actual numbers that are concerning (though I disagree with you that a 70% skew can be brushed off). It's the exclusionary behavior within EA.</p>\n", "parentCommentId": "uFMXsdbtebBLB5v2Q", "user": {"username": "Lila"}}, {"_id": "KPoDGpyeMbmxgjJeP", "postedAt": "2017-10-26T18:28:46.748Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>I just want to quickly call attention to one point: &quot;these are still pure benefits&quot; seems like a mistaken way of thinking about this - or perhaps I'm just misinterpreting you. To me &quot;pure benefits&quot; suggests something costless, or where the costs are so trivial they should be discarded in analysis, and I think that really underestimates the labor that goes into building inclusive communities. Researching and compiling these recommendations took work, and implementing them will take a lot of work. Mentoring people can have wonderful returns, but it requires significant commitments of time, energy, and often other resources. Writing up community standards about conduct tends to be emotionally exhausting work which demands weeks of time and effort from productive and deeply involved community members who are necessarily sidelining other EA projects in order to do it. </p>\n<p>None of this is to say 'it isn't worth it'. I expect that some of these things have great returns to the health, epistemic standards, and resiliency of the community, as well as, like you mentioned, good returns for the reputation of EA (though from my experience in social justice communities, there will be articles criticizing any movement for failures of intersectionality, and the presence of those articles isn't very strong evidence that a movement is doing something unusually wrong). My goal is not to say 'this is too much work' but simply 'this is work' - because if we don't acknowledge that it requires work, then work probably will not get done (or will not be acknowledged and appreciated). </p>\n<p>Once we acknowledge that these are suggestions which require varying amounts of time, energy and access to resources, and that they impose varying degrees of mental load, then we can start figuring out which ones are good priorities for people with limited amounts of all of the above. I've seen a lot of social justice communities suffer because they're unable to do this kind of prioritization and accordingly impose excessively high costs on members and lose good people who have limited resources. </p>\n<p>So I think it's a bad idea to think in terms of 'pure benefit'. Here, like everywhere else, if we want to do the most good we need to keep in mind that not all actions are equally good or equally cheap so we can prioritize the effective and cheap ones.</p>\n<p>I'm also curious why you think the magnitude of the current EA movement's contributions to harmful societal structures in the United States might outweigh the magnitude of the effects EA has on nonhumans and on the poorest humans. To be clear about where I'm coming from, I think the most important thing the EA community can do is be a community that fosters fast progress on the most important things in the world. Obviously, this will include being a community that takes contributions seriously regardless of their origins and elicits contributions from everyone with good ideas, without making any of them feel excluded because of their background. But that makes diversity an instrumental goal, a thing that will make us better at figuring out how to improve the world and acting on the evidence. From your phrasing, I think you might believe that harmful societal structures in the western world are one of the things we can most effectively fix? Have you expanded on that anywhere, or is there anyone else who has argued for that who you can point me to?</p>\n", "parentCommentId": "RAJM47Syj59SkS6rx", "user": {"username": "Kelsey Piper"}}, {"_id": "MDeQcK5sqx48LcZgg", "postedAt": "2017-10-26T19:06:14.316Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>I take your point that skews can happen, but it seems a bit suspicious to me that desire to be effective and altruistic should be so heavily skewed towards white dudes.</p>\n<p>Edit: I previous said &quot;straight white dudes&quot; but removed the &quot;straight&quot;. See below.</p>\n", "parentCommentId": "uFMXsdbtebBLB5v2Q", "user": {"username": "MichaelPlant"}}, {"_id": "xY5uSjqf3WKGomTWq", "postedAt": "2017-10-26T19:14:28.325Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>What evidence causes you to think that heterosexuality is overrepresented in EA? That seems backwards to me.</p>\n", "parentCommentId": "MDeQcK5sqx48LcZgg", "user": {"username": "Buck"}}, {"_id": "qA4MWWEkhCHi6jqHR", "postedAt": "2017-10-26T19:21:19.151Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>Thank you very much for bringing this up. Discussion about inclusivity is really conspicuous by it's absence within EA. It's honeslty really weird we barely talk about it.</p>\n<p>Three thoughts.</p>\n<ol>\n<li><p>I'd like to emphasise how important I think it is that members of the community trying and speak in as jargon-free a way as possible. My impression is this has been getting worse over time: there seems to be something of a jargon arms race as people (always males, typically those into 'rationality'-type stuff) actively try to drop in streams of unnecessary, technical, elitist, in-group-y words to make themselves look smart. I find this personally annoying and I assume it's unwelcoming to outsiders.</p>\n</li>\n<li><p>You gave loads of suggestions (thanks!). There were so many suggestions though, I can't possibly remember them all. Do you think you could pick out what you think the most important 2 or 3 are and highlight them somewhere?</p>\n</li>\n<li><p>On a personal note</p>\n</li>\n</ol>\n<blockquote>\n<p>young, white, cis-male, upper middle class, from men-dominated fields, technology-focused, status-driven, with a propensity for chest-beating, overconfidence, narrow-picture thinking/micro-optimization, and discomfort with emotions</p>\n</blockquote>\n<p>Ouch. I find this a painful and mostly accurate description of myself. Except emotions. Those are fine. </p>\n", "parentCommentId": null, "user": {"username": "MichaelPlant"}}, {"_id": "7eqDMvj8nKKJq5p92", "postedAt": "2017-10-26T19:41:00.296Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>Georgia here - The direct context, &quot;Research also shows that diverse teams are more creative, more innovative, better at problem-solving, and better at decision-making,&quot; is true based on what I found. </p>\n<p>What I found also seemed pretty clear that diversity doesn't, overall, have a positive or negative effect on performance. Discussing that seems important if you're trying to argue that it'll yield better results, unless you have reason to think that EA is an exception. </p>\n<p>(E.g., it seems possible that business teams aren't a good comparison for local groups or nonprofits, or that most teams in an EA context do more research/creative/problem-solving type work than business teams, so the implication &quot;diversity is likely to help your EA team&quot; would be possibly valid - but whatever premise that's based on would need to be justified.)</p>\n<p>That said, obviously there are reasons to want diversity other than its effect on team performance, and I generally quite liked this article.</p>\n", "parentCommentId": "XSgzGcBC8hdiAxjqa", "user": {"username": "eukaryote"}}, {"_id": "CxgzGQxFjyfc2DtAf", "postedAt": "2017-10-26T19:55:07.611Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>That doesn't seem like what I'm doing. Georgia doesn't seem to be disagreeing with my post's overall argument (that EA would benefit from diversity; she actually seems to explicitly agree with that in her last paragraph), and she doesn't explicitly agree or disagree with the argument of that specific paragraph (that diversity tends to be net beneficial for groups). The quote you cite is about a &quot;clear&quot; effect on groups, from the evidence she evaluates, and I might not have the same bar for robustness that she's thinking of with that claim.</p>\n<p>Moreover, her post argues</p>\n<blockquote>\n<p>If we look at [the effect of diversity] further, we can decompose it into two effects (one where diversity has a neutral or negative impact on performance, and one where it has a mostly positive impact)</p>\n</blockquote>\n<p>and goes onto explore these effects. The negative ones seem related to something like tribalism (e.g. less identification with the group), and I hope the EA community is able to overcome these avoidable downsides so it can on net benefit from diversity. I didn't mention them in the post because I think we can overcome them given our desire to de-bias ourselves, and given the tools that Georgia mentions we have to overcome them: </p>\n<blockquote>\n<p>The more balanced a team is along some axis of diversity, the less likely you are to see negative effects on performance... recognition of less-obvious cognitive differences (e.g. personality and educational diversity) increases over time... diverse teams end up outperforming non-diverse teams [over time]... the longer a group works together, the less surface-level differences matter</p>\n</blockquote>\n<p>I linked to her whole post so readers could see all of that. Linking directly to the citations I was pointing to in her post would have felt like cherry-picking. I could have given more explanation of her whole post in my own, and if I had spent more time writing this post, I probably would have done that.</p>\n<p>[Edit: Georgia made a comment above that suggests she believes the statement without the robustness qualification, so we do have disagreement here.]</p>\n", "parentCommentId": "4u6Ze6ETmyWsocNGd", "user": {"username": "Kelly_Witwicki"}}, {"_id": "2C8PpiGuDsTYDCn3L", "postedAt": "2017-10-26T19:55:16.025Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>While I agree with a lot of this, it's worth pointing out that the claims about gender diversity increasing 'collective intelligence' are controversial within psychology. For example, see this paper:</p>\n<p>&quot;We examined group-IQ in three independent studies.</p>\n<p>• Gender balance and turn-taking were unrelated to group performance.\n• Social sensitivity had no impact on latent group-IQ.\n• Individual IQ emerged as the cause of group-IQ.\n• Group-IQ almost exclusively reflects individual cognition.</p>\n<p>What allows groups to behave intelligently? One suggestion is that groups exhibit a collective intelligence accounted for by number of women in the group, turn-taking and emotional empathizing, with group-IQ being only weakly-linked to individual IQ (Woolley, Chabris, Pentland, Hashmi, &amp; Malone, 2010). Here we report tests of this model across three studies with 312 people. Contrary to prediction, individual IQ accounted for around 80% of group-IQ differences. Hypotheses that group-IQ increases with number of women in the group and with turn-taking were not supported. Reading the mind in the eyes (RME) performance was associated with individual IQ, and, in one study, with group-IQ factor scores. However, a well-fitting structural model combining data from studies 2 and 3 indicated that RME exerted no influence on the group-IQ latent factor (instead having a modest impact on a single group test). The experiments instead showed that higher individual IQ enhances group performance such that individual IQ determined 100% of latent group-IQ. Implications for future work on group-based achievement are examined.&quot;</p>\n<p><a href=\"http://www.sciencedirect.com/science/article/pii/S0160289616303282\">http://www.sciencedirect.com/science/article/pii/S0160289616303282</a></p>\n<p>There's also some evidence that a more critical style stimulates higher levels of creativity and improves the quality of ideas:</p>\n<p>&quot;Nemeth’s studies suggest that the ineffectiveness of brainstorming stems from the very thing that Osborn thought was most important. As Nemeth puts it, “While the instruction ‘Do not criticize’ is often cited as the important instruction in brainstorming, this appears to be a counterproductive strategy. Our findings show that debate and criticism do not inhibit ideas but, rather, stimulate them relative to every other condition.” Osborn thought that imagination is inhibited by the merest hint of criticism, but Nemeth’s work and a number of other studies have demonstrated that it can thrive on conflict.</p>\n<p>According to Nemeth, dissent stimulates new ideas because it encourages us to engage more fully with the work of others and to reassess our viewpoints. “There’s this Pollyannaish notion that the most important thing to do when working together is stay positive and get along, to not hurt anyone’s feelings,” she says. “Well, that’s just wrong. Maybe debate is going to be less pleasant, but it will always be more productive. True creativity requires some trade-offs.”&quot;</p>\n<p><a href=\"https://www.newyorker.com/magazine/2012/01/30/groupthink\">https://www.newyorker.com/magazine/2012/01/30/groupthink</a></p>\n<p>For obvious reasons any criticism should be done as politely as possible, and must remain focussed on improving ideas rather than attacking people.</p>\n", "parentCommentId": null, "user": {"username": "Anon123456"}}, {"_id": "ZrgkTYBFh7g8AeGjT", "postedAt": "2017-10-26T20:18:23.843Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>I only hold this view weakly, but yes, I'm worried that, as you put it, &quot;E first, A second&quot; people are less likely to stick around.</p>\n<p>I don't think &quot;A first, E second&quot; people are necessarily easier to get in the first place though, as they are more likely to already have a calling (and so to have less personally to gain) and to be committed to other altruistic pursuits that are hard for them to drop as &quot;ineffective.&quot;</p>\n<p>That said, I've seen significant movement among heavily committed farmed animal advocates towards thinking more about and acting in the interest of maximizing impact... though farmed animal advocates are often already doing that advocacy because they're already thinking about effectiveness: they see the issue as massively important and very tractable. So I suppose realistically I'm putting most of my investments in people who are A first, but still clearly already E.</p>\n", "parentCommentId": "tQ7nEuY29X2nSxJX9", "user": {"username": "Kelly_Witwicki"}}, {"_id": "rwjsLqqe6d9ccGHu8", "postedAt": "2017-10-26T20:23:07.006Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>I believe sexuality is a demographic we do well on.</p>\n", "parentCommentId": "xY5uSjqf3WKGomTWq", "user": {"username": "Kelly_Witwicki"}}, {"_id": "XrayqXJuw3bt6DPMv", "postedAt": "2017-10-26T20:25:26.763Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>We also have way more trans women than society at large.</p>\n", "parentCommentId": "rwjsLqqe6d9ccGHu8", "user": {"username": "Buck"}}, {"_id": "LBYYYmomBohHrmHP4", "postedAt": "2017-10-26T20:38:07.449Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>Thanks! I added a note about the debate.</p>\n<p>I'm not sure what your comments about critical discussion style are referring to in the post.</p>\n", "parentCommentId": "2C8PpiGuDsTYDCn3L", "user": {"username": "Kelly_Witwicki"}}, {"_id": "JhtXqoLyJ5pRFpDCQ", "postedAt": "2017-10-26T20:47:15.424Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>You made an extremely long list of suggestions. Implementing such a huge list would mean radically overhauling the EA community. Is that a good idea?</p>\n<p>I think its important to keep in mind that the EA community has been tremendously successful. Givewell and OpenPhil now funnel tremendous amounts of money towards effective global poverty reduction efforts. EA has also made substantial progress at increasing awareness of AI-risk and promoting animal welfare. There are now many student groups in universities around the world. EA has achieved these things in a rather rapid timeframe. </p>\n<p>Its rather rare for a group to have comparable success to the current EA community. Hence I think its very dangerous to overhaul our community and its norms. We are doing very well. We could be doing better, but we are doing well. Making changes to the culture of a high performance organization is likely to reduce performance. Hence I think you should be very careful about which changes you suggest. </p>\n<p>In addition to being long your list of changes has many rather speculative suggestions. Here are some examples: &quot;\n-- You explicitly say we should be more welcoming towards things like &quot;dog rescue&quot;. Does this not risk diluting EA into just another ineffective community. \n-- You say that suing the term &quot;AI&quot; without explanation is too much jargon. Is that really a reasonable standard? AI is not an obscure term. If you want us to avoid the term &quot;AI&quot; your standards of accessibility seem rather extreme. \n-- You claim we should focus on making altruistic people effective instead of effective people altruistic. However Toby Ord claims he initially had the same intuition but his experience is that the later is actually easier. How many of your intuitions are you checking empirically? (This has been mentioned by other commenters)</p>\n<p>In general I think you should focus on a much smaller list of core suggestions. It is easier to argue rigorously for a more conservative set of changes. And as I said earlier EA is doing quite well so we should be skeptical of dramatic culture shifts. Obviously we should be open to new norms, but those norms should be vetted carefully. </p>\n", "parentCommentId": null, "user": {"username": "deluks917"}}, {"_id": "4tZcwGRmyz7nrQwge", "postedAt": "2017-10-26T20:49:13.969Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>I haven't thought about prioritization yet, and was hoping other people would discuss that here. Since a lot of these are actions individuals can take, it will vary a lot by what roles an individual plays and what they have the most room for improvement in.</p>\n<p>That said... toning down jargon, I suspect you'd agree, is probably pretty cost-effective, as I would think is toning up the visibility of people from underrepresented groups. A Diversity &amp; Inclusion Officer who could review and advise on social media communications, ads, community recruitment, website UX, conference speakers, talk content and descriptions, job postings and hiring processes, etc, and who could establish metrics and goals for and conduct annual reviews on inclusionary practices, sounds easily worth their salary, at the very least as an experiment for a year.</p>\n", "parentCommentId": "qA4MWWEkhCHi6jqHR", "user": {"username": "Kelly_Witwicki"}}, {"_id": "BrskKz3vkM2s3s9va", "postedAt": "2017-10-26T20:55:08.574Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>I couldn't find it unfortunately, and was just relying on the veracity of that rather detailed extract and the credibility of the source publication. I considered not putting that in at all since what matters is that the prejudiced view doesn't seem to have backing, but I figured this was still information, worth a &quot;may be more likely&quot; even if I couldn't confirm that it's been demonstrated.</p>\n", "parentCommentId": "T392qW8NgjZWov33x", "user": {"username": "Kelly_Witwicki"}}, {"_id": "PXW4kugDDo9uK3NYS", "postedAt": "2017-10-26T20:57:51.956Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>This reminds me of a pattern I see in social justice movements, which goes something like this: We are observing some kind of gender or race-based disparity, with a variety of different hypotheses for why it might be occurring.  Some people think discrimination is the most likely hypothesis.  Other people have other hypotheses.  The people who think discrimination is the most likely hypotheses see the people suggesting other hypotheses and loudly decry those people as discriminatory.  Those people get quieter.  The gender or race-based disparity persists.  The only hypothesis that anyone is allowed to talk about is the discrimination one.  So it's more clear than ever that discrimination is the only possible explanation.  Given this clarity, the people pushing the discrimination hypothesis have the mandate to decry milder and milder instances of discrimination.  Eventually, the community undergoes a schism over the issue of whether to be hypersensitive to mild instances of discrimination or not.</p>\n<p>The <a href=\"https://drive.google.com/viewerng/viewer?url=https://assets.documentcloud.org/documents/3914586/Googles-Ideological-Echo-Chamber.pdf\">Google memo</a> Kelly references is a good case study.  Kelly implies that the author is an &quot;outright asshole&quot;.  I assume she makes this judgement solely based on the author's willingness to explore hypotheses besides the discrimination one--in terms of communication style, it's clear that the author takes pains to be as civil as possible.</p>\n<p>The question for me is: How long do we need to test out the discrimination hypothesis before it's disconfirmed?  If it's been 5 years since anyone talked about any hypothesis besides the discrimination one, and the disparity still persists, are we allowed to consider the possibility that the discrimination hypothesis is incorrect?  What if it's been 10 years?</p>\n<p>Realistically, if there's a disparity, there's probably a combination of several things going on.  So, how can we capture the low-hanging fruit from fighting discrimination without putting ourselves on a path towards a schism?</p>\n", "parentCommentId": "MDeQcK5sqx48LcZgg", "user": {"username": "xccf"}}, {"_id": "7BQ8bfRhEz3Ye3g4q", "postedAt": "2017-10-26T21:01:28.668Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>This smells a lot like a Social Justice Warrior takeover of effective altruism. The idea of restricting free speech is particularly worrying. I would write a full rebuttal, but it might not be worth my time or that of others - the movement might already be unsalvageable (does anyone agree/disagree with that?)</p>\n<p>EDIT: Replying to XCCF below: I don't think there's much in this post that doesn't qualify as generic SJW ideology and talking points.</p>\n<p>EDIT: Regarding the noncentral fallacy: I think this is a pretty central example of an SJW takeover from a pretty central SJW, but I'm open to new information. </p>\n", "parentCommentId": null, "user": {"username": "the_jaded_one"}}, {"_id": "3nu8t2Y2Cob5gijH2", "postedAt": "2017-10-26T21:17:21.185Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<blockquote>\n<p>Discussion about inclusivity is really conspicuous by it's absence within EA. It's honeslty really weird we barely talk about it.</p>\n</blockquote>\n<p>Are you sure? Here are some previous discussions (most of which were linked in the article above):</p>\n<p><a href=\"http://effective-altruism.com/ea/1ft/effective_altruism_for_animals_consideration_for/\">http://effective-altruism.com/ea/1ft/effective_altruism_for_animals_consideration_for/</a>\n<a href=\"http://effective-altruism.com/ea/ek/ea_diversity_unpacking_pandoras_box/\">http://effective-altruism.com/ea/ek/ea_diversity_unpacking_pandoras_box/</a>\n<a href=\"http://effective-altruism.com/ea/sm/ea_is_elitist_should_it_stay_that_way/\">http://effective-altruism.com/ea/sm/ea_is_elitist_should_it_stay_that_way/</a>\n<a href=\"http://effective-altruism.com/ea/zu/making_ea_groups_more_welcoming/\">http://effective-altruism.com/ea/zu/making_ea_groups_more_welcoming/</a>\n<a href=\"http://effective-altruism.com/ea/mp/pitfalls_in_diversity_outreach/\">http://effective-altruism.com/ea/mp/pitfalls_in_diversity_outreach/</a>\n<a href=\"http://effective-altruism.com/ea/1e1/ea_survey_2017_series_community_demographics/\">http://effective-altruism.com/ea/1e1/ea_survey_2017_series_community_demographics/</a>\n<a href=\"https://www.facebook.com/groups/effective.altruists/permalink/1479443418778677/\">https://www.facebook.com/groups/effective.altruists/permalink/1479443418778677/</a></p>\n<p>I recall more discussions elsewhere in comments. Admittedly this is over several years. What would not barely talking about it look like, if not that?</p>\n", "parentCommentId": "qA4MWWEkhCHi6jqHR", "user": {"username": "DonyChristie"}}, {"_id": "dpZPDaREodaJfGhLq", "postedAt": "2017-10-26T21:32:08.420Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>As a guy who used to be female (I was AMAB), Kelly's post rings true to me. Fully endorsed. It would be particularly interesting to hear about AFAB transmen's experiences with respect to this.</p>\n<p>The change in how you're treated is much more noticeable when making progress in the direction of becoming more guyish; not sure if this is because this change tends to happen quickly (testosterone is powerful + quick) or because of the offsetting stigma re: people making transition progress towards being female. I could also see this stigma making up some of the positive effect that AMAB people feel on detransitioning, though it's mostly possible to disentangle the effect of the misogyny from that of the transmisogyny if you have good social sense.</p>\n<p>In anticipation of being harassed (based on past experience with this community), I'll leave it at that. I'm not going to respond to any BS or bother with politics.</p>\n", "parentCommentId": null, "user": {"username": "Fluttershy"}}, {"_id": "6RLgwPzM4NxSwNHNc", "postedAt": "2017-10-26T21:32:58.538Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>Great post. </p>\n<blockquote>\n<p>Yes, some people broader society now respond to correctable offenses with a mob mentality and too much readiness for ostracization, but just because some people have swung too far past the mark doesn’t mean we should default to a status quo that falls so short of it.</p>\n</blockquote>\n<p>I think there's an &quot;in&quot; missing between &quot;people&quot; and &quot;broader&quot; </p>\n", "parentCommentId": null, "user": {"username": "Milan_Griffes"}}, {"_id": "BDGN78cXahWWL8EmL", "postedAt": "2017-10-26T21:40:06.398Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>As a general note for the discussion: Given the current incentive landscape in the parts of society most EAs are part of, I expect opposition to this post to be strongly underrepresented in the comment section. </p>\n<p>As a datapoint, I have many disagreements with this article, but based on negative experiences with similar discussions, I do not want to participate in a longer discussion around it. I don't think there is an easy fix for this, but it seems reasonable for people reading the comments to be aware that they might be getting a very selective set of opinions. </p>\n", "parentCommentId": null, "user": {"username": "Habryka"}}, {"_id": "ZXSx5Cot4jRGbRb4c", "postedAt": "2017-10-26T21:56:06.276Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>I second most of these concerns.</p>\n<blockquote>\n<p>Does this not risk diluting EA into just another ineffective community.</p>\n</blockquote>\n<p>The core of EA is cause-neutral good-maximization. The more we cater to people who cannot switch their chosen object-level intervention, the less ability the movement will have to coordinate and switch tracks. They will <em>become offended</em> by suggestions that their chosen intervention is not the best one. As it is I wish more people challenged how <em>I</em> prioritize things, but they probably don't for fear of offending others as a general policy. </p>\n<blockquote>\n<p>You say that suing the term &quot;AI&quot; without explanation is too much jargon. Is that really a reasonable standard? AI is not an obscure term. If you want us to avoid the term &quot;AI&quot; your standards of accessibility seem rather extreme.</p>\n</blockquote>\n<p>I am in favor of non-dumbed-down language as it creates an added constraint in how I can communicate when I have to keep running a check on whether a person understands a concept I am referring to. I do agree that jargon generation is sometimes fueled by the desire for weird neologisms moreso than the desire to increase clarity.</p>\n<blockquote>\n<p>You claim we should focus on making altruistic people effective instead of effective people altruistic.</p>\n</blockquote>\n<p>I once observed: &quot;Effectiveness without altruism is lame; altruism without effectiveness is blind.&quot; 'Effectiveness' seems to load most of the Stuff that is needed; to Actually Do Good Things requires more of the Actually than the Good. It seems that people caring about others takes less skill than being able to accomplish consequential things. I am open to persuasion otherwise; I've experienced most people as more apathetic and nonchalant about the fate of the world, an enormous hindrance to being interested in effective altruism.</p>\n", "parentCommentId": "JhtXqoLyJ5pRFpDCQ", "user": {"username": "DonyChristie"}}, {"_id": "dBTGmuZWjnvErA9tt", "postedAt": "2017-10-26T22:18:01.765Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>As a relevant piece of data:</p>\n<p>I looked into the 4 sources you cite in your article as improving the effectiveness of diverse teams and found the following:  </p>\n<ul>\n<li>1 didn't replicate, and the replication found the opposite effect with a much larger sample size (which you link to in your article)</li>\n<li><p>One is a Forbes article that cites a variety of articles, two of which I looked into and didn't say at all what the Forbes article said they say, with the articles usually saying &quot;we found no significant effects&quot; </p>\n</li>\n<li><p>One study you cited directly found the opposite result of what you seemed to imply it does, with its results table looking like this: </p>\n</li>\n</ul>\n<p><a href=\"https://imgur.com/a/dRms0\">https://imgur.com/a/dRms0</a></p>\n<p>And the results section of the study explicitly saying: </p>\n<p>&quot;whereas background diversity displayed a small negative, yet nonsignificant, relationship with innovation (\u0001.133).&quot; </p>\n<p>(the thing that did have a positive relation was &quot;job-related diversity&quot; which is very much not the kind of diversity the top-level article is talking about)</p>\n<ul>\n<li>The only study that you cited that did seem to cite some positive effects was one with the following results table: </li>\n</ul>\n<p><a href=\"https://imgur.com/a/tgS6q\">https://imgur.com/a/tgS6q</a></p>\n<p>Which found some effects on innovation, though overall it found very mixed effects of diversity, with its conclusion stating: </p>\n<p>&quot;Based on the results of a series of meta-analyses, we conclude that cultural diversity in teams can be both an asset and a liability. Whether the process losses associated with cultural diversity can be minimized and the process gains be realized will ultimately depend on the team’s ability to manage the process in an effective manner, as well as on the context within which the team operates.&quot;</p>\n", "parentCommentId": "7eqDMvj8nKKJq5p92", "user": {"username": "Habryka"}}, {"_id": "RT6dvyfWWnSd5zDaF", "postedAt": "2017-10-26T22:25:53.398Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>&quot;I assume she makes this judgement solely based on the author's willingness to explore hypotheses besides the discrimination one&quot; - This seems like a very uncharitable assumption to make. I can easily think of multiple other reasons why she might consider him an asshole. </p>\n", "parentCommentId": "PXW4kugDDo9uK3NYS", "user": {"username": "Khorton"}}, {"_id": "awRc2RB53PPuyasSu", "postedAt": "2017-10-26T22:32:11.659Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>I would agree that the comments will likely be from a small subset of real opinions because this topic can be quite emotionally charged. From a look at the comments landscape right now -\nin particular, the number of posts that seem to question the existence of sexism - I think it's plausible that a woman who had experienced sexism in EA would not be incentivized to comment. </p>\n", "parentCommentId": "BDGN78cXahWWL8EmL", "user": {"username": "Khorton"}}, {"_id": "wpJn9EPjzRbiWKkRX", "postedAt": "2017-10-26T22:36:40.697Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>I think there's a bit of an empathy gap in this community. When people are angry for what seems to be no reason, a good first step is to ask whether you've done something that made them feel unsafe/humiliated/demeaned/etc, even if that wasn't your intention. It doesn't take a lot of imagination to see how unsolicited exploration of &quot;other hypotheses&quot; (cough cough) for racial and gender disparities could be very distressing for the people who are being discussed as if they're not there. </p>\n", "parentCommentId": "PXW4kugDDo9uK3NYS", "user": {"username": "Lila"}}, {"_id": "CWi6kQ4tNviR98rHp", "postedAt": "2017-10-26T22:38:41.666Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>From what I've heard, most of the people would are A first are already involved in causes. Now, unfortunately, there is a sense in which EA unavoidably is threatening, as the logical implication is often is that the work that they have done is less impactful than it could have been and that their current work or things they are working towards are less effective than it could have been. And we can phrase things as nicely as we want, and talk about how you can do EA plus other things and that all charity work is valuable even if it isn't EA and that there are valuable causes we haven't discovered yet, ect., but at the end of the day, this is still the logical implication and no matter what we do, this will make people uncomfortable. This effect is especially bad since if everyone adopted EA, it is likely certain organisations would cease to exist.</p>\n<p>Further, because we unavoidably threaten current power structures within charity, many people there have written incredibly unfair articles articles criticising EA and misrepresenting us (there has been valid criticism too, but this is a minority). This makes recruiting A people even harder.</p>\n", "parentCommentId": "ZrgkTYBFh7g8AeGjT", "user": {"username": "casebash"}}, {"_id": "WFwPihZdZuRLAgazk", "postedAt": "2017-10-26T22:40:46.061Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>&quot;Same thing with applying that classic EA skepticism to people's lived experiences&quot;</p>\n<p>I suppose this comes down to why the person is sharing their lived experience. If someone is just telling you their story, you want to try and keep an open mind. On the other hand, if someone is sharing their lived experiences in order to make a political argument, a certain amount of criticism, whilst not being unnecessarily insensitive, is fair game.</p>\n", "parentCommentId": "py9mJSmx5dkiEcEZK", "user": {"username": "casebash"}}, {"_id": "7eNepoWADTptL9jp6", "postedAt": "2017-10-26T22:42:28.217Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>Hmm. Maybe EA is more inclusively representated on the sexual dimension. I'd hadn't really noticed this either way, and more typed this out of habit. I stick by there being an oddly high number of white dudes though. </p>\n", "parentCommentId": "xY5uSjqf3WKGomTWq", "user": {"username": "MichaelPlant"}}, {"_id": "FbrhCR3oEMthv38T3", "postedAt": "2017-10-26T22:42:34.929Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>An example of a particular practice that I think might  look kind of innocuous but can be quite harmful to women and minorities in EA is what I'm going to call &quot;buzz talk&quot;. Buzz talk involves making highly subjective assessments of people's abilities, putting a lot of weight in those assessments, and communicating them to others in the community. Buzz talk can be very powerful, but the beneficiaries of buzz seem to disproportionately be those that conform to a stereotype of brilliance: a white, upper class male might be &quot;the next big thing&quot; when his black, working class female counterpart wouldn't even be noticed. These are the sorts of small, unintentional behaviors that I that it can be good for people to try to be conscious of.</p>\n<p>I also think it's really unfortunate that there's such a large schism between those involved in the social justice movement and people who largely disagree with this movement (think: SJWs and anti-SJWs). The EA community attracts people from both of groups, and I think it can cause people to see this whole issue through the lens of whatever group they identify with. It might be helpful if people tried to drop this identity baggage when discussing diversity issues in EA.</p>\n", "parentCommentId": null, "user": {"username": "Askell"}}, {"_id": "BKuiJX2Ctqn8ZRmT7", "postedAt": "2017-10-26T22:46:05.872Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>Your suspicions provide a small amount of Bayesian evidence, but could you explain why you believe none of the alternate explanations that have been proposed seem satisfactory?</p>\n", "parentCommentId": "MDeQcK5sqx48LcZgg", "user": {"username": "casebash"}}, {"_id": "kKJEpQvBL7sFpYgkw", "postedAt": "2017-10-26T22:46:59.053Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>I appreciate this comment for being specific!</p>\n<blockquote>\n<p>It might be helpful if people tried to drop this identity baggage when discussing diversity issues in EA.</p>\n</blockquote>\n<p>I don't understand what you mean by that; could you clarify?</p>\n", "parentCommentId": "FbrhCR3oEMthv38T3", "user": {"username": "Buck"}}, {"_id": "H74Bsvam6k9g99BMY", "postedAt": "2017-10-26T22:48:31.224Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>Thank you so much for writing this.</p>\n", "parentCommentId": "KPoDGpyeMbmxgjJeP", "user": {"username": "Michael_PJ"}}, {"_id": "rY6h2AXuJKjGpTkDR", "postedAt": "2017-10-26T22:49:59.793Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>So you research suggests that it improves creativity, innovation, problem solving and decision making, but not performance. That is a rather unexpected result. Do you have any thoughts on why this did not result in an improvement in total performance?</p>\n", "parentCommentId": "7eqDMvj8nKKJq5p92", "user": {"username": "casebash"}}, {"_id": "QpNjtyq3YrQy9wiGT", "postedAt": "2017-10-26T22:50:29.706Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>I'm seeing a lot of comments questioning the literature around diversity improving performance. EA prizes accuracy, so that's a good thing.</p>\n<p>However, I'm concerned we're falling into two very common traps of requiring women to prove themselves more competent than men and status quo bias.</p>\n<p>In general, I'd expect teams to be diverse unless a non-diverse team can be proven more effective. Because so many EA leaders are currently white men, I can imagine some reasons why we might have less-diverse teams in the short-term, but my baseline expectation would always be to prefer a more diverse team all other things being equal. </p>\n", "parentCommentId": null, "user": {"username": "Khorton"}}, {"_id": "iknrnzT2Y5cKgWj3Z", "postedAt": "2017-10-26T22:51:34.001Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>I strongly agree. Put another way, I suspect we, as a community, are bad at assessing talent. If true, that manifests as both a diversity problem and a suboptimal distribution of talent, but the latter might not be as visible to us. </p>\n<p>My guess re the mechanism: Because we don't have formal credentials that reflect relevant ability, we rely heavily on reputation and intuition. Both sources of evidence allow lots of biases to creep in. </p>\n<p>My advice would be: </p>\n<ol>\n<li><p>When assessing someone's talent, focus on the content of what they're saying/writing, not the general feeling you get from them.</p>\n</li>\n<li><p>When discussing how talented someone is, always explain the basis of your view (e.g., I read a paper they wrote; or Bob told me).</p>\n</li>\n</ol>\n", "parentCommentId": "FbrhCR3oEMthv38T3", "user": {"username": "mhpage"}}, {"_id": "xbMH5gHLdBc6X3LzH", "postedAt": "2017-10-26T22:56:02.197Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>FWIW, I'm sympathetic to the google guy. However, it's not clear to me this case in the same. It might be, but I'd want someone to give me a series of reasons, backed by evidence, before we conclude &quot;oh, it turns out affluent white males are just a lot more moral than everyone else and there's nothing to explain here&quot;.</p>\n", "parentCommentId": "PXW4kugDDo9uK3NYS", "user": {"username": "MichaelPlant"}}, {"_id": "2kmXgMWD8aw9XHNpS", "postedAt": "2017-10-26T22:56:51.377Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>My gut reaction is that most of the people who <em>have</em> stuck around are &quot;E first&quot;, but I think there's probably a higher base rate of those amongst early adopters, so hard to say.</p>\n<p>It seems like we could gather some data on this, though. It's a vague question, but I suspect most people would be able to answer some variant of &quot;Were you E first or A first? E/A/Other&quot;. Then we could see if that had any relationship to tenure in the community, or anything else. Perhaps an item for the next Effective Altruism survey?</p>\n", "parentCommentId": "ZrgkTYBFh7g8AeGjT", "user": {"username": "Michael_PJ"}}, {"_id": "ZwxqouWE8eqBPy8zM", "postedAt": "2017-10-26T22:57:16.205Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>&quot;Even if one thinks that this effect size will be very small compared to the good that the EA movement is doing&quot; - I would like to hear why you believe that the effects that you mention in your first paragraph might be comparable to the direct good that we do. I mean, I would be rather surprised if this was the case, but I haven't heard your argument.</p>\n", "parentCommentId": "RAJM47Syj59SkS6rx", "user": {"username": "casebash"}}, {"_id": "zi5wF6GxAjYRhF5GT", "postedAt": "2017-10-26T22:59:01.387Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>I think this is a big deal, unfortunately. I try to talk about EA very carefully when talking to people who're &quot;A first&quot;, but people can sense any implicit criticism a mile off. It's really hard to avoid some variant of &quot;So you think I've been wasting my time, then?&quot;</p>\n<p>Strangely, &quot;E first&quot; people may be easier to reach because they're less likely to be already invested in something.</p>\n", "parentCommentId": "CWi6kQ4tNviR98rHp", "user": {"username": "Michael_PJ"}}, {"_id": "GxgnMRQwjkrKQPyax", "postedAt": "2017-10-26T23:03:25.431Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>&quot;god rescue&quot; - Well, maybe he is a utility monster.</p>\n<p>But thanks for posting this comment. For several of the cultural changes suggested, diversity could be a relevant factor, but it would be unlikely to be the most significant consideration. Things like changing our marketing or reducing competitiveness are plausibly good changes, diversity is only one factor to consider.</p>\n", "parentCommentId": "JhtXqoLyJ5pRFpDCQ", "user": {"username": "casebash"}}, {"_id": "s4c2TmdFPMdBEqfsk", "postedAt": "2017-10-26T23:11:45.140Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>So I think that if you identify with or against some group (e.g. 'anti-SJWs'), then anything that people say that pattern matches to something that this group would say triggers a reflexive negative reaction. This manifests in various ways: you're inclined to attribute way more to the person's statements than what they're actually saying or you set an overly demanding bar for them to &quot;prove&quot; that what they're saying is correct. And I think all of that is pretty bad for discourse.</p>\n<p>I also suspect that if we take a detached attitude towards this sort of thing, disagreements about things like how much of a diversity problem EA has or what is causing it would be much less prominent than they currently are. These disagreements only affect benefits we expect to directly accrue from trying to improve things, but the costs of doing these things are usually pretty low and the information value of experimenting with them is really high. So I don't really see many plausible views in this area that would make it rational to take a strong stance against a lot of the easier things that people could try that might increase the number of women and minorities that get involved with EA.</p>\n", "parentCommentId": "kKJEpQvBL7sFpYgkw", "user": {"username": "Askell"}}, {"_id": "AaxSGeWysLwtgsLNu", "postedAt": "2017-10-26T23:12:46.910Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>The histories of many forms of prejudice are histories biological essentialism and biological determinism. Even if such claims are now made out of a &quot;willingness to explore&quot; alternative hypotheses despite this long history of precisely being an <em>unwillingness</em> to explore the much newer hypothesis of prejudice, they tend to be over-simplistic, as in the memo, and tend to have the effect -- if not also the intention -- of dismissing the other, newer hypothesis of prejudice, which is robustly supported by data that the memo's author fails to include.</p>\n<p>That's not to say it's a black and white matter of total biological similarity or total culturally-imposed disparities and prejudice. That's what the author of the memo implies, and I disagree. The evidence that prejudice is a major problem that is holding people back is substantial nonetheless.</p>\n<p>Some of his suggestions for ways to reduce the gender gap are worth considering, and charitably he's not exceptionally prejudiced and is able to analyze information that has found its way to him, but is just very poorly informed and has no willingness to explore the alternative explanation of prejudice. At most charitable this still enables that prejudice.</p>\n<p>Given the extent of my knowledge, which is just the words in the memo, I can agree he's not an outright asshole, and I should have phrased my side note about this example of zero tolerance with a heavy hand differently. It may even be a poor example, as I would say corrective action should have been taken in his case before he was fired if it wasn't, which I don't know about either way.</p>\n", "parentCommentId": "PXW4kugDDo9uK3NYS", "user": {"username": "Kelly_Witwicki"}}, {"_id": "TjHqeBqiMiroeBL5x", "postedAt": "2017-10-26T23:13:01.648Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>I am also worried about something similar; that the social justice community has certain epistemic problems that I do not want to see us make the same mistakes in EA. So I'd like to encourage you comment on this issue, but in a way that is less combative, as you might then find more success. In particular, I would like to note that several people here have made critiques of part of the argument and been upvoted.</p>\n", "parentCommentId": "7BQ8bfRhEz3Ye3g4q", "user": {"username": "casebash"}}, {"_id": "7wKETCt7toA26C53q", "postedAt": "2017-10-26T23:19:06.148Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>Yeah, this sort of thing is basically always in danger of becoming politics all the way down. One good heuristic is to keep the goals you hope to satisfy by engaging in mind--if you want to figure out whether to accept an article's central claim, is the answer to your question decisive with respect to your decision? If you're trying to sway people, are you being careful to make sure it's plausibly deniable that you're doing anything other than truthseeking? If you're engaging because you think it's impactful to do so, are you treating your engagement as a tool rather than an end?</p>\n", "parentCommentId": "QpNjtyq3YrQy9wiGT", "user": {"username": "Fluttershy"}}, {"_id": "B8anTfP8kEcDnZa5M", "postedAt": "2017-10-26T23:19:31.160Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>Danke schoen :)</p>\n", "parentCommentId": "6RLgwPzM4NxSwNHNc", "user": {"username": "Kelly_Witwicki"}}, {"_id": "qecs2NQ3xoRBwLj27", "postedAt": "2017-10-26T23:23:49.236Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>I'd like to move towards an inclusive community that doesn't damage the valuable aspects of EA. I think this post mostly did a good job of suggesting things in that vein (I was heartened to see &quot;don't stop being weird&quot; as an item), but I'd like to push on the point a bit more.</p>\n<p>For example, I'm hugely in favour of collaborative discussions over combative discussions, but I find it very helpful to have discussions that <em>stylistically</em> appear combative while actually being collaborative. For example: frequent, direct criticism of ideas put forward by other people is a hallmark of combative discussion, but can be fine so long as everyone is on an even footing and &quot;you are not your ideas&quot; is common knowledge. If we ban this, then we make some parts of our discourse worse. Overly zealous pursuit of formalized markers can destroy a lot of value.</p>\n<p>Of course, the solution is &quot;don't do that&quot;, but the <em>most obvious</em> approach to &quot;have more X&quot; is &quot;pick some formal markers of X and select for them&quot;. Doing better is harder, perhaps something like &quot;have workshops/talks on good disagreement&quot;, &quot;praise people who're known for being excellent at this&quot; etc.</p>\n<hr />\n<p>I agree with others that there are too many suggestions in this post. They're also a bit of a grab bag. I can see a few categories:</p>\n<ul>\n<li>Miscellaneous criticisms, many of which seem plausible, but aren't obviously any more important for diversity than for their other benefits (collaborative discussions, humility, less hero-worship, better interpersonal interactions etc.).</li>\n<li>Larger-scale shifts of uncertain effect (head vs heart, jargon, caution over &quot;free speech&quot;, etc.). A lot of these are unclear to me, and I think we'd want to take a clear-headed look at the costs and benefits.</li>\n<li>More specific diversity-boosting measures (female speakers, try to counteract bias, mentor people etc.). These seem clearest to me, and hopefully we can look and see what's worked well in other places vs the costs.</li>\n</ul>\n<p>I think the miscellaneous improvements could (and should!) go stand on their own; the larger-scale shifts are perhaps best discussed individually; and what I think a diversity criticism is uniquely placed to bring is more of the third kind of thing.</p>\n", "parentCommentId": null, "user": {"username": "Michael_PJ"}}, {"_id": "rtTx7aTXKaiRWkAJA", "postedAt": "2017-10-26T23:37:44.378Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<blockquote>\n<p>It doesn't take a lot of imagination to see how unsolicited exploration of \"other hypotheses\" (cough cough) for racial and gender disparities could be very distressing for the people who are being discussed as if they're not there.</p>\n</blockquote>\n<p>Oh, I totally agree, and I don't think we should explore them.  [I edited my comment in an attempt to clarify this.]</p>\n", "parentCommentId": "wpJn9EPjzRbiWKkRX", "user": {"username": "xccf"}}, {"_id": "Efp55tKr9X7u5KMad", "postedAt": "2017-10-26T23:41:19.003Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>I don't actually believe that affluent white males are a lot more moral than everyone else, but anyway, let's put aside the question of whether such evidence exists for a moment and ask: if such evidence did exist, would it be sensible for us to discuss it?  My answer is no.  I would rather take a compromise position of addressing clear cases of discrimination, being mildly worried about mild cases, and letting sleeping dogs lie.</p>\n", "parentCommentId": "xbMH5gHLdBc6X3LzH", "user": {"username": "xccf"}}, {"_id": "oYuFR85ixAZ82CBTc", "postedAt": "2017-10-26T23:41:28.369Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>But you don't want discrimination hypotheses to be discussed either? I guess that could be an acceptable compromise, to not debate the causes of disparities but at the same time focus on improving diversity in recruitment. </p>\n", "parentCommentId": "rtTx7aTXKaiRWkAJA", "user": {"username": "Lila"}}, {"_id": "q3GJLTBHXoYhgKxxk", "postedAt": "2017-10-26T23:45:38.571Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>Unfortunately since the respondents would be members of the EA community, it would be hard to control that data for cultural fit in order to get at how robustly EA people from each demographic are. People have stuck around in the community for reasons other than how EA they are or can be, as I hope I've shed some light on.</p>\n", "parentCommentId": "2kmXgMWD8aw9XHNpS", "user": {"username": "Kelly_Witwicki"}}, {"_id": "9rLAQqPkRzGWwZwMX", "postedAt": "2017-10-26T23:46:59.315Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>Thanks for the reply, Kelly, and I'm sorry you're getting downvoted.  I really appreciate your willingness to be charitable and admit your mistakes, and I will strive to emulate your example.</p>\n<blockquote>\n<p>That's not to say it's a black and white matter of total biological similarity or total culturally-imposed disparities and prejudice. That's what the author of the memo implies</p>\n</blockquote>\n<p>Hm, that's not how I read it.  For example, in the first sentence, he says he doesn't deny that sexism exists.  Later, he writes: &quot;Of course, men and women experience bias, tech, and the workplace differently and we should be cognizant of this...&quot;  My interpretation is that Google already has a ton of discussion of the impact of sexism, bias, etc. and Damore wanted to fill in the other side of the story, so he didn't bother to repeat stuff that everyone already agrees on.  Maybe that was a mistake in retrospect.</p>\n", "parentCommentId": "AaxSGeWysLwtgsLNu", "user": {"username": "xccf"}}, {"_id": "u4T6unLbmgAbfiwwN", "postedAt": "2017-10-26T23:58:30.644Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<blockquote>\n<p>So I think that if you identify with or against some group (e.g. 'anti-SJWs'), then anything that people say that pattern matches to something that this group would say triggers a reflexive negative reaction. This manifests in various ways: you're inclined to attribute way more to the person's statements than what they're actually saying or you set an overly demanding bar for them to &quot;prove&quot; that what they're saying is correct. And I think all of that is pretty bad for discourse.</p>\n</blockquote>\n<p>This used to be me... It wasn't so much my beliefs that changed (I'm not a leftist/feminist/etc). It was more a change in attitude, related to why I rejected ultra-strict interpretations of utilitarianism. Not becoming more agreeable or less opinionated... just not feeling like I was on a life-or-death mission. Anyway, happy to discuss these things privately, including with people who are still on the anti-SJW mission. </p>\n", "parentCommentId": "s4c2TmdFPMdBEqfsk", "user": {"username": "Lila"}}, {"_id": "gNmpBZ28vYchHPwiA", "postedAt": "2017-10-27T00:00:20.823Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>Yeah.  I'm also in favor of trying to grab low-hanging fruit from addressing discrimination, as long as we don't get overzealous.  But in terms of trying to make our demographics completely representative... there are already a lot of groups trying and failing to do that, sometimes in a way that crashes &amp; burns spectacularly, so I would rather hang back and wait for a model that seems workable/reliable before aiming that high.</p>\n", "parentCommentId": "oYuFR85ixAZ82CBTc", "user": {"username": "xccf"}}, {"_id": "NcNQxpz3qKwjQGjaM", "postedAt": "2017-10-27T00:16:19.699Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>I find it interesting that most of the examples given in the article conform to mainstream, politically correct opinion about who is and isn't overrepresented. A pretty similar article could be written about e.g. math graduate students with almost the exact list of overrepresented and underrepresented groups. In that sense it doesn't seem to get to the core of what unique blind spots or expansion problems EA might have.</p>\n<p>An alternate perspective would be to look at minorities, subgroups, and geographical patterns that are way overrepresented in EAs relative to the world population, or even, say, the US population; this could help triangulate to blind spots in EA or ways that make it difficult for EA to connect with broader populations. A few things stand out.</p>\n<p>Of these, I know at least (1) and (2) have put off people or been major points of concern.</p>\n<p>(1) Heavy clustering in the San Francisco Bay Area and a few other population centers, excluding large numbers of people from being able to participate in EA while feeling a meaningful sense of in-person community. It doesn't help that the San Francisco Bay Area is one of the most notoriously expensive in the world, and also located in a country (the United States) that is hard for most people to enter and live in.</p>\n<p>(2) Overrepresentation of &quot;poly&quot; sexual orientations and behaviors relative to larger populations -- so that even those who aren't poly have trouble getting along in EA if they don't like rubbing shoulders with poly folks. </p>\n<p>(3) Large proportion of people of Jewish descent. I don't think there's any problem with this, but some people might argue that this makes the ethics of EA heavily influenced by traditional Jewish ethical approaches, to the exclusion of other religious and ethical traditions. [This isn't just a reflection of greater success of people of Jewish descent; I think EAs are overrepresented among Jews even after education and income controls].</p>\n<p>(4) Overrepresentation of vegetarians and vegans. I'm not complaining, but others might argue that this reduces EAs' ability to connect with the culinary habits and food-related traditions of a lot of cultures.</p>\n", "parentCommentId": null, "user": {"username": "vipulnaik"}}, {"_id": "biwKDqSKY5wXCBxnz", "postedAt": "2017-10-27T00:16:36.668Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>Regarding discussion style: I think several EAs are great at discussions where they're fully critical of each other but aren't combative (e.g. they don't raise their voices, go ad hominem, tear apart one aspect of an argument to dismiss the rest, or downvote comments that signal an identity that theirs is constructed in opposition to). I think it's possible to get all the benefit of criticism and disagreement without negative emotions clouding our judgement.</p>\n<p>I think the key may be to work against the impulse to be right, or the impulse that someone who disagrees with you is your enemy. I'm much better than I used to be at seeing disagreement as the route to everyone in the discussion getting closer to the truth, though unfortunately that takes a constant drive to improve. (It does help a lot to just remind myself that the person I'm disagreeing with --\n in most cases at least -- is on my team in the bigger picture.) Doing more to penalize combative behavior and reward constructive behavior -- like how downvotes and upvotes are supposed to be used in this forum -- seems like a feasible solution.</p>\n<p>Regarding the grab-bag: That was my intention, to get the ball rolling. I hope for others to bring in their own thinking on prioritization and implementation.</p>\n", "parentCommentId": "qecs2NQ3xoRBwLj27", "user": {"username": "Kelly_Witwicki"}}, {"_id": "QZmYneTERNiZX2Y9G", "postedAt": "2017-10-27T00:18:44.383Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>Moving you to <a href=\"http://effective-altruism.com/ea/1g3/why_how_to_make_progress_on_diversity_inclusion/c7i\">my answer to the same question above</a> to for further discussion :)</p>\n", "parentCommentId": "MxYd5iJrZHQynJshD", "user": {"username": "Kelly_Witwicki"}}, {"_id": "ZcNfjLuNQZW4ry3ky", "postedAt": "2017-10-27T00:29:34.546Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>&quot;I take your point that skews can happen, but it seems a bit suspicious to me that desire to be effective and altruistic should be so heavily skewed towards straight, white dudes.&quot;</p>\n<p>(1) Where did &quot;straight&quot; come into this picture? The author says that EAs are well-represented on sexual diversity (and maybe even overrepresented on some fairly atypical sexual orientations), and my comment (and the data I used) had nothing to say about sexual orientation?</p>\n<p>(2) &quot;&quot;&quot;it seems a bit suspicious to me that desire to be effective and altruistic should be so heavily skewed towards straight, white dudes&quot;&quot;&quot;</p>\n<p>I didn't say that <em>desire to be effective and altruistic</em> is heavily skewed toward men. I just said that membership in a specific community, or readership of a specific website, and things like that, can have significant gender skews, and that is not atypical. The audience for a specific community, like the effective altruist community, can be far smaller than the set of people with desire to be effective and altruistic.</p>\n<p>For instance, if a fashion website has a 90% female audience (a not atypical number), that is not a claim that the &quot;desire to look good&quot; is that heavily skewed toward female. It means that the specific things that website caters to, the way it has marketed itself, etc. have resulted in it getting a female audience. Men could also desire to look good, albeit in ways that are very different from those catered to by that fashion website (or more broadly by the majority of present-day fashion websites).</p>\n", "parentCommentId": "MDeQcK5sqx48LcZgg", "user": {"username": "vipulnaik"}}, {"_id": "68XfBRqm2eqzdF5Nu", "postedAt": "2017-10-27T00:31:06.956Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>I can see 1-3 being problems to some extent (and I don't think Kelly would disagree)... but &quot;overrepresentation of vegetarians and vegans&quot;?? You might as well complain about an overrepresentation of people who donate to charity. </p>\n", "parentCommentId": "NcNQxpz3qKwjQGjaM", "user": {"username": "Lila"}}, {"_id": "Yckc54G3gT5cgkyYZ", "postedAt": "2017-10-27T00:35:46.725Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<blockquote>\n<p>&quot;pick some formal markers of X and select for them&quot;.</p>\n</blockquote>\n<p>Can you say what you mean by 'formal markers'? I've never heard this term before. </p>\n", "parentCommentId": "qecs2NQ3xoRBwLj27", "user": {"username": "MichaelPlant"}}, {"_id": "es4FuRGkvi23MFwRk", "postedAt": "2017-10-27T00:39:10.334Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>Katja Grace gives a related [edited - said &quot;the same&quot; - see Katja's comment below] argument here:</p>\n<p><a href=\"https://meteuphoric.wordpress.com/2013/07/09/effectiveness-or-altruism/\">https://meteuphoric.wordpress.com/2013/07/09/effectiveness-or-altruism/</a></p>\n<p>&quot;When I was younger, I thought altruism was about the most promising way to make the world better. There were extremely cheap figures around for the cost to save a human life, and people seemed to not care. So prima facie it seemed that the highly effective giving opportunities were well worked out, and the main problem was that people tended to give $2 to such causes occasionally, rather than giving every spare cent they had, that wasn’t already earmarked for something more valuable than human lives.</p>\n<p>These days I am much more optimistic about improving effectiveness than altruism, and not just because I’m less naive about cost-effectiveness estimates.&quot;</p>\n<p>She goes on to list several reasons,  including greater past success and greater neglect.</p>\n", "parentCommentId": "tQ7nEuY29X2nSxJX9", "user": {"username": "Stefan_Schubert"}}, {"_id": "gH7svyCxjPutsScrW", "postedAt": "2017-10-27T00:41:15.931Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>Sorry, that was me being unclear! The situation I'm envisaging is:</p>\n<ul>\n<li>We want more X.</li>\n<li>We can't detect X directly, so we'll pick some marker for X that <em>looks</em> like X (that's what I was going at with &quot;formal&quot;, &quot;relating to the form of&quot;), and then aim for that.</li>\n<li>Oops our markers don't capture X, or even exclude some important bits of X.</li>\n</ul>\n", "parentCommentId": "Yckc54G3gT5cgkyYZ", "user": {"username": "Michael_PJ"}}, {"_id": "iagHEksCKy9sLaZ64", "postedAt": "2017-10-27T00:42:58.648Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>I agree that that qualification suggests his view on the contribution of biology to the gender gap is weaker than his otherwise definitive framings suggest. [Edit: Sentence here removed because I'm too tired and my thoughts are not in order, will get sleep before responding to any more comments. Replacement: He's still presenting it as a black-and-white issue if he's only presenting one side.]</p>\n<p>Google may have had that conversation on prejudice going, but he is very <a href=\"https://www.wired.com/story/the-pernicious-science-of-james-damores-google-memo/\">oversimplistic</a> and offers the essentialist view as so definitive that his solutions are the right ones, that Google is the &quot;biased&quot; party for talking about prejudice, and that it isn't worth even mentioning that evidence demonstrating a bias against women exists (if he even knows or believes that), not to mention that the evidence for the real-world effect of prejudice is far more vast and robust than his evidence for biological causes. And he does all this when the essentialist view has been so dominant and people are only talking so much about prejudice because they're trying to overcome the essentialist thinking that so inhibits people. (Sure, there are differences, but there are even more misconceptions, as well as oversimplistic and deterministic assumptions about what real differences mean.)</p>\n<p>[Edit for clarification and additional analysis: In a context of prejudice, presenting stereotypes is a delicate matter even if you think them sufficiently biologically valid and are content to make simplistic inferences about their real-world effects. Doing so without acknowledgement of the prejudices people experience which line up with these stereotypes and which harm them serves to reinforce those stereotypes and prejudices.]</p>\n<p>So it's not an appropriate way to contribute to the conversation -- at best it's reacting to perceived overshooting by retreating to a flawed status quo.</p>\n", "parentCommentId": "9rLAQqPkRzGWwZwMX", "user": {"username": "Kelly_Witwicki"}}, {"_id": "yymYHrA936BowgQJC", "postedAt": "2017-10-27T00:50:57.544Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>As I said, I'm totally in favour of collaborative discussions, i.e. this stuff</p>\n<blockquote>\n<p>they don't raise their voices, go ad hominem, tear apart one aspect of an argument to dismiss the rest, or downvote comments that signal an identity that theirs is constructed in opposition to</p>\n</blockquote>\n<p>(except possibly raised voices), but I wanted to argue that sometimes things that look like combative discussion aren't. Imagine:</p>\n<p>A: </p>\n<p>B: I think that's a pretty bad argument because .  seems much better.</p>\n<p>A: No, you didn't understand what I'm saying, I said .</p>\n<p>This could be a snippet of a tense combative argument, or just a vigorous collaborative brainstorming session. A might feel unfairly dismissed by B, or might not even notice it. If we were trying to combat combtiveness by calling out people abruptly shooting down other people's ideas, then we might prevent people from doing this particular style of rapid brainstorming.</p>\n<p>(Sorry, this stuff is hard to talk about because it's very contextual. I should probably have picked a better example :))</p>\n<p>What I'm trying to say is that we just need to be a little bit careful how we shoot for our goals.</p>\n", "parentCommentId": "biwKDqSKY5wXCBxnz", "user": {"username": "Michael_PJ"}}, {"_id": "Svci7gbrxArogdRXb", "postedAt": "2017-10-27T00:51:05.398Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>I have no doubt that there are things worth doing in this field, but I do worry about the potential for this to take attention away from even higher priorities. One reason why big organisations move slowly is because they have to get approval/input from so many people before they can actually do anything. Secondly, I worry that this is an example of dispersed costs and concentrated benefits in that optimising on second factor tends to be making some sacrifice or compromise on the first.</p>\n<p>There is likely to be an adverse selection effect in that the kinds of people who would want to be a diversity officer tend to be the kinds of people who also take the strongest stance and hence are more likely to push us toward prioritising this more than we should.</p>\n<p>I am not saying that this is necessarily a bad idea, just it isn't as obviously good as it looks at first glance.</p>\n", "parentCommentId": "4tZcwGRmyz7nrQwge", "user": {"username": "casebash"}}, {"_id": "ryF5HBoe7RqwhTkSm", "postedAt": "2017-10-27T00:53:04.835Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>Maybe voters on the EA forum should be blinded to the author of a post until they've voted!</p>\n", "parentCommentId": "FbrhCR3oEMthv38T3", "user": {"username": "Michael_PJ"}}, {"_id": "qgMNhqhzjsoHFoumY", "postedAt": "2017-10-27T00:55:16.461Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>Thanks so much for taking the time to write this. As a man, the crux of my feeling disaffected from EA has been this part: &quot;● Take up that humility more generally. Don’t judge that you’re right and another party is wrong before ensuring you know their reasoning — ask someone why they hold the position they do, maybe they’ve thought of something you haven’t just as you may be assuming you’ve thought of things they haven’t.&quot; As a rule, I have found that EA people believe that they are the world leading expert on literally every single topic. A fellow, for example, said he was starting a blog and wanted submissions on certain topics which I have presented academic papers related to at international conferences. I offered to provide articles for his blog, free. He responded that he would have to see my previous work so he could review it. He had a Bachelors in computer programming and wanted to review my academic work in evolutionary psychology and political science that had been presented at leading international conferences. Because he is the leading expert in every single thing. Just this week I suggested that EA should focus more on threats to bees and other insect pollinators. Another fellow responded that all the claimed problems are false and the issue that does exist is easily solved. Amazing that he knows more than scores of professional entomologists publishing in peer reviewed journals, despite not being an entomologist or in science at all. But again, he is clearly the world leading expert in literally every topic.</p>\n<p>At the same time, people like myself who have put serious effort and several decades into developing our knowledge on certain topics, and who have lengthy records of achieving altruistic results dating long before your group existed, find that our posts are not approved by the &quot;moderators&quot; of the FB main group, we are not invited to conferences, our views are not respected as a rule. </p>\n<p>Whatever data and techniques you have, as currently constituted EA is more counter-effective than effective and on the road to irrelevance. However intelligent you are, being sure that you literally know everything makes you one of the dumbest people alive. </p>\n", "parentCommentId": null, "user": null}, {"_id": "z9ggykWGCFc8zyoh7", "postedAt": "2017-10-27T00:55:17.115Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>I see, we're just thinking of &quot;combative&quot; differently.</p>\n", "parentCommentId": "yymYHrA936BowgQJC", "user": {"username": "Kelly_Witwicki"}}, {"_id": "ErbvwZEZnEw53hcou", "postedAt": "2017-10-27T00:55:49.243Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>I feel that many of the words or terms that we have created are useful because they allow us to create common knowledge. However, if you want to reduce the amount of jargon, I would suggest writing up a list of words that could be replaced with non-jargony words or phrases (for reference, I posted in the LW fb group suggesting using Co-ordination problems or Race to the Bottom instead of Moloch and I got a large number of upvotes).</p>\n", "parentCommentId": "qA4MWWEkhCHi6jqHR", "user": {"username": "casebash"}}, {"_id": "Q7scXQsdHYnQtX2SD", "postedAt": "2017-10-27T01:01:14.998Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>The difficulty for movements against discrimination (between humans) in a lot of modern society lies in that definition of what constitutes &quot;clear&quot; discrimination. For instance, people don't say explicitly discriminatory things as much as they used to, but they still hold discriminatory beliefs that make them e.g. mistrust, discredit and undervalue others, and we can for the most part only assess e.g. hiring bias by looking at whole samples, not at any one individual.</p>\n", "parentCommentId": "Efp55tKr9X7u5KMad", "user": {"username": "Kelly_Witwicki"}}, {"_id": "8TGD5aBarytYz5GdC", "postedAt": "2017-10-27T01:14:01.411Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>I actually think we should discuss other hypotheses.</p>\n<p>Firstly, &quot;other hypotheses&quot; includes all kinds of inoffensive explanations like the primary cause of a difference being:</p>\n<ul>\n<li>Broader society has instilled certain social norms in people, as opposed to it being anything specific about this group</li>\n<li>Founder effects - A guy gets a few of his mates to start the group, they rope in their mates, ect.</li>\n<li>That the message happens to resonate among groups of people that are currently disproportionately one gender (ie. programmers)</li>\n</ul>\n<p>But going further than this, I don't think we should limit discussion of different intrinsic preferences either, especially if someone makes an argument that is dependent on this being false.</p>\n", "parentCommentId": "wpJn9EPjzRbiWKkRX", "user": {"username": "casebash"}}, {"_id": "ro58uQPYbsCfsvsZb", "postedAt": "2017-10-27T01:17:53.202Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>While I thoroughly appreciate your thoughts here and I'm glad you voiced them, I think you started on a miscommunication:</p>\n<p>I don't think the fact that there are costs to this, as anything, is controversial (though I know its cost-effectiveness is), and it sounds to me like Tyler just meant &quot;intrinsic benefits,&quot; in addition to the instrumental benefits to EA community-building. If he thought improving diversity and inclusion in the community had no cost, I would think he'd say its case is irrefutable, not that these benefits merely &quot;strengthen&quot; its case.</p>\n", "parentCommentId": "KPoDGpyeMbmxgjJeP", "user": {"username": "Kelly_Witwicki"}}, {"_id": "mwJtgQBJWZdJgvCtT", "postedAt": "2017-10-27T01:18:25.110Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>If you aren't going to defend the claim made in the original comment, I would suggest that it would be good practise to edit the word &quot;straight&quot; out of the comment. There are a lot of Cached Thoughts on both sides of the debate and I would like to encourage people to break out of them.</p>\n", "parentCommentId": "7eNepoWADTptL9jp6", "user": {"username": "casebash"}}, {"_id": "ku59BZxpGDRfAE5BE", "postedAt": "2017-10-27T01:35:14.042Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>Hi KelseyPiper, thanks so much for a thoughtful reply. I really agree with most of this - I was talking in terms of these benefits as &quot;pure&quot; benefits because I assumed the many costs you rightly point out up front. That is, assuming that we read Kelly's piece and we come away with a sense of the costs and benefits that promoting diversity and inclusion in the Effective Altruism movement will have, these benefits I've pointed out above are &quot;pure&quot; because they come along for free with that labor involved in making the EA community more inclusive, and don't require additional effort. But I understand how that could be misleading, and so I take all of your criticism on board. I also agree that this will involve priority-setting - even if we think that all of these suggestions are important and some people should be doing all of them to some extent (and especially if not), there are some that we ought to spend more time on than others as a community.</p>\n<p>I also agree that the EA community should focus on identifying and working on the very most important things. Although I might disagree slightly with how you've characterized that. I don't think that we should be a community doing work that fosters &quot;fast progress on the most important things,&quot; because I think that we should be doing whatever does the most good in the long run, all-things-considered, and fostering &quot;fast progress&quot; on the most important things does not necessarily correlate with doing the most good in the long run, all-things-considered - unless we define &quot;fosters fast progress&quot; in a way that makes this trivial. But if, for example, we could perform one of two different interventions, one which added an additional +5 well-being to all of the global poor, on average, over twenty years, for one generation, and one which added an additional +5 well-being to all of the global poor, on average, over one hundred years, for all generations, we should choose the latter intervention, even though the former intervention is in a sense fostering faster progress. I make this point not to be pedantic, but because I think some EAs sometimes forget that what we (or many of us) are trying to do is to produce the most benefits and avert the most harm all-things-considered, and not simply make a lot of progress on some very important projects very quickly, and I think that this is quite relevant to this conversation.</p>\n<p>To your question as to why &quot;the magnitude of the current EA movement's contributions to harmful societal structures in the United States might outweigh the magnitude of the effects EA has on nonhumans and on the poorest humans,&quot; I unfortunately haven't written something on this and perhaps I should. But I can say a few things. I should first say that I certainly don't think it's obvious that the EA movement's contributions to such harmful structures clearly will outweigh the magnitude of the effects we have on nonhumans and on the poorest humans. I only claimed that it was non-obvious that the effect size was &quot;very small&quot; compared to the positive effects we have. It's something more EAs should treat as non-negligible more often than they do.</p>\n<p>Still, here are some of the basic reasons why I think that the EA movement's contributions to harmful social structures could well be of sufficient magnitude that we should keep constant accounting of them in our efforts to do good in the world, apart from reputation costs and instrumental epistemic benefits of inclusion and diversity work. First, the fundamental structure of society and its social, legal, and political norms profoundly shape the kinds and quality of life of all beings, as well as profoundly shaping cultural and moral mores, and so ensuring that the fundamental structure of society and these norms are good ones is crucial to ensuring that the long-run future is good, and shaping these structures for the better may make the trajectory of the future far better than the counterfactual where we shape these structures for the worse (for reasons of legal precedent, memetics, psychological and value anchoring, and more). Second, norms against harming others are very sticky - much stickier than norms favoring helping others except in certain particular cases (e.g. within one's own family). They are psychologically sticky, whether for innate biological reasons which fix this, or for entirely cultural reasons. Which of these is true makes a difference to how much staying power this stickiness has. But whichever is true, ensuring that we set good norms in place around not causing harm to others and ensuring that these norms are stringently upheld and not violated so that we internalize them as commonsense norms seems like a good way to shape how the future goes. They are also easier to enforce through sanction, blame, and punishment, whereas norms of aid (especially effective aid) are more difficult to enforce. And our human legal and political history suggests that they are much easier to codify into law. So for all these reasons, ensuring that we have good norms in these areas and not violating them looks like a very important intervention for shaping the social and legal institutions of future societies. Third, there are reasons to think that our moral and political attitudes towards others are psychologically intertwined in complex ways. How we treat and think about some groups, and the norms we have around harming and helping them, seems to have an impact on how we treat and think about other groups. This seems especially important if we are interested in expanding our human moral circle to include nonhuman animals and silicon-based sentient life. If our negative attitudes, norms, laws, and practices around other humans have negative downstream effects on our attitudes, norms, laws, and practices around other animals and other, inorganic sentient beings, then the benefits of prioritizing moral development and averting harmful social structures which favor some sentient beings over others may be very important. If AI value alignment is decided as a result of a political arms race, then it seems that having a broader moral circle may significantly shape the impact of intelligent and superintelligent AI for better or worse. (Here I'm out of my depth, and my impression is that this is a matter of significant disagreement, so I certainly won't come down hard on this.) The main point is that the downstream effects of our norms, attitudes, laws, and practices around humans, and who our society decides is worthy of full moral consideration, may have significant downstream effects in complicated and to some extent unpredictable ways. The more skeptical we are about how much we know about the future, the greater our uncertainty should be about these effects. I think it's reasonable to be concerned that this may be too speculative or too optimistic about the downstream consequences of our norm-shaping on the far future, but we should be careful to remember that there are also skeptical considerations cutting in the opposite direction - measurability bias may lead us to exclude less measurable, long-term effects in favor of more measurable, short-term effects of our actions irrationally.</p>\n<p>I am not arguing that actively averting oppressive social structures and hierarchies of dominance should be a main cause area for EAs (although that could be an upshot of this conversation, too, depending on the probabilities we assign to the hypotheses delineated above), but given the psychological, social, and legal stickiness of norms against harming and the fact that failing to make EA a more diverse and inclusive community will raise the probability of EAs harming marginalized communities and failing to create and uphold norms around not harming them. And the more influential the EA community is as a community, the more this holds true. So it seems to me that there's a plausible case to be made that entrenching strong norms against treating marginalized communities inequitably within the EA community is an effective cause area that we should spend some of our time on, even if we should spend the majority of our time advocating for farmed and wild animals and the global poor.</p>\n", "parentCommentId": "KPoDGpyeMbmxgjJeP", "user": {"username": "tylermjohn"}}, {"_id": "L9hStGgeTLCy8p7wP", "postedAt": "2017-10-27T01:38:22.399Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>EA prizes accuracy? Seriously? When? Where? I have zero experience of that being the case so far. </p>\n", "parentCommentId": "QpNjtyq3YrQy9wiGT", "user": null}, {"_id": "8mfCEwaMw3bRRXimT", "postedAt": "2017-10-27T01:46:19.746Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>How do you think we are requiring women to prove themselves more competent than men? For example, if A says study X says P and B points at that it actually says Q, is this an example? Or were you thinking about something else?</p>\n<p>Status quo bias exists, but there is also a counter-balancing action bias. When someone cares about an issue, they want to do <em>something</em> about it and they often fail to consider all of the secondary effects are reasons why you might not want to take a particular action.</p>\n<p>That said, I am doubtful that there is <em>nothing</em> we can do on diversity.</p>\n", "parentCommentId": "QpNjtyq3YrQy9wiGT", "user": {"username": "casebash"}}, {"_id": "GvtzKJ5DckaBWL2s5", "postedAt": "2017-10-27T01:53:56.168Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>Can I suggest that the Damore issue be parked? Even though it is currently producing a high quality, civil conversation, I worry that talking about such a highly polarised topic is somewhat risky as you never know who might join the thread.</p>\n", "parentCommentId": "iagHEksCKy9sLaZ64", "user": {"username": "casebash"}}, {"_id": "2ExmDysTwMYpsc7bB", "postedAt": "2017-10-27T01:54:20.628Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<blockquote>\n<p>I find it interesting that most of the examples given in the article conform to mainstream, politically correct opinion about who is and isn't overrepresented</p>\n</blockquote>\n<p>I think about this a different way. I think it weird, given there's so much mainstream discussion of inclusion, that it hasn't seemed to penetrate into EA. That makes EA the odd one out. Hence it might be good to identify the generic blindspots, even if we haven't yet honed in on EA specific ones.</p>\n<p>I think you're approach of looking for over-represented people is interested and promising. What I find surprising is that you didn't zone in on the most obvious one, which is that EA is really heavily weighed with philosophers and maths-y types, such as software engineers.</p>\n", "parentCommentId": "NcNQxpz3qKwjQGjaM", "user": {"username": "MichaelPlant"}}, {"_id": "DcLhzfATnjwP2NJTR", "postedAt": "2017-10-27T02:16:59.959Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>I tried to avoid things that have already been discussed heavily and publicly in the community, and I think the math/philosopher angle is one that is often mentioned in the context of EA not being diverse enough. The post itself notes:</p>\n<p>&quot;&quot;&quot;people who are both that and young, white, cis-male, upper middle class, from men-dominated fields, technology-focused, status-driven, with a propensity for chest-beating, overconfidence, narrow-picture thinking/micro-optimization, and discomfort with emotions.&quot;&quot;&quot;</p>\n<p>This also mentioned in the post by Alexander Gordon-Brown that Kelly links to: <a href=\"http://effective-altruism.com/ea/ek/ea_diversity_unpacking_pandoras_box/\">http://effective-altruism.com/ea/ek/ea_diversity_unpacking_pandoras_box/</a></p>\n<p>&quot;&quot;&quot;EA is heavy on mathematicians, programmers, economists and philosophers. Those groups can get a lot done, but they can't get everything done. If we want to grow, I think we could do with more PR types. Because we're largely web-based, people who understand how to make things visually appealing also seem valuable. My personal experience in London is that we would love more organisers, though I can imagine this varying by location.&quot;&quot;&quot;</p>\n", "parentCommentId": "2ExmDysTwMYpsc7bB", "user": {"username": "vipulnaik"}}, {"_id": "TFmpfJ6KuLYKfaEvH", "postedAt": "2017-10-27T02:24:45.697Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>Variant on this idea: I'd encourage a high status person and a low status person, both of whom regularly post on the EA Forum, to trade accounts for a period of time and see how that impacts their likes/dislikes. </p>\n<p>Variant on that idea: No one should actually do this, but several people should talk about it, thereby making everyone paranoid about whether they're a part of a social experiment (and of course the response of the paranoid person would be to actually vote based on the content of the article). </p>\n", "parentCommentId": "ryF5HBoe7RqwhTkSm", "user": {"username": "mhpage"}}, {"_id": "44fcqwZ4MW8ZuHPPE", "postedAt": "2017-10-27T02:27:20.428Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>Thanks for putting in the effort to write such a detailed post, I imagine that this would have taken a lot of time and effort. I also appreciate that you offered to have a discussion on the extent to which this is a problem. I have had negative experiences in the past with people who were opposed to this line of questioning, so I am really glad to see you actually invite this discussion.</p>\n<p>Firstly, in regard to the communities we draw from, I've seen a lot of articles about how problematic the IT industry is, but I am rather skeptical of these claims and hence of the claim that EA is especially problematic. Clearly there are a lot of bad things that have happened in certain places, but people are acting as though it is an established fact industry is worse than other industries without there being any research backing it up. I think we need to be careful about anecdotal evidence because of the <a href=\"http://slatestarcodex.com/2015/09/16/cardiologists-and-chinese-robbers/\">Chinese Robber Fallacy</a> - ie. neglect of base rates. I feel that many people look at the industry with the preconception that it is sexist because it is majority male and it is hardly surprising that they find confirmatory evidence. This isn't to say that the industry might not be disproportionately sexist, my suspicion is that we do not know because no-one has conducted the research.</p>\n<p>Secondly, I would suggest that similarly it is not clear whether the problem in EA is larger than in the rest of society. It might be larger or it might be smaller, but I haven't seen strong evidence either way. I'm not saying that we should therefore not try to be more inclusive, I'm just pushing back a tendency that I've seen to declare a group especially bad without sufficient evidence to justify claiming this as an established fact.</p>\n<p>Thirdly, I would be wary about relying to much evidence about correlations. Does diversity increase the success of companies or due more successful and wealthier companies have an easier time attracting women and minorities? I would not be surprised if it was a mix, although I won't guess at the split.</p>\n<p>Fourth, I wouldn't say that the effects of quotas are clear from the one study (<a href=\"http://slatestarcodex.com/2014/12/12/beware-the-man-of-one-study/)\">http://slatestarcodex.com/2014/12/12/beware-the-man-of-one-study/)</a>. As it says, &quot;Competence was measured by comparing the private incomes across people with the same education, occupation, age, and residence in the same geographical region. Those with higher incomes were deemed more competent&quot;. That's an interesting result, but it needs to be combined with other research to be reliable.</p>\n<p>Fifth, &quot;some people in the community have made other thoroughly unreasonable claims to justify the status quo, such as that women would be a distraction in the workplace&quot;. Where were these claims made and how many people made them?</p>\n<p>Sixth, I'm in favour of people being able to anonymously share experiences, but I believe it would be of the utmost importance to ensure that we did not create a site that enabled people to anonymously spread rumours that harmed the reputation of other people and could possibly lead to divisions within the movement. If such a site is made, I would suggest that there be rules against identifying information be shared in the general discussion area. If someone wants the kind of advice that requires them to identify the specific individual, such as if they were intending to lodge a formal complaint with an organisation, then there could be specific persons tasked tasked with advising them. There's a huge debate about anonymous vs. identified complaints that I don't want to get involved in, but anonymous, public, unscreened accusations are a recipe for disaster.</p>\n<p>Lastly, you write, &quot;Unfortunately I suspect some people in the community are content, implicitly or explicitly, to assume that women and people of color are inherently so much worse than white men at thinking about altruism effectively that the constitution of the community is merely an effect of this presumed difference&quot;. I believe there are two main issues with recruiting women: a) Women are less likely to be in the groups we have been successful in recruiting from (ie. maths, philosophy, computer science) b) In our society, women are encouraged to embrace their emotions more and men are encouraged to be objective. Given this socialisation, men are more likely to find EA matches their thought process.</p>\n", "parentCommentId": null, "user": {"username": "casebash"}}, {"_id": "xurw9FT7YMrSPou33", "postedAt": "2017-10-27T02:34:30.329Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>&quot;oh, it turns out affluent white males are just a lot more moral than everyone else and there's nothing to explain here&quot;</p>\n<p>Do you think it is possible that EA could be majority white affluent male because programmers, philosophers, mathematicians, ect. are disproportionately white affluent male and EA has become good at recruiting these specific audiences?</p>\n", "parentCommentId": "xbMH5gHLdBc6X3LzH", "user": {"username": "casebash"}}, {"_id": "zu6SSnxTzxGTKWmQS", "postedAt": "2017-10-27T03:04:41.389Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>Thanks for this post.  There's a lot I agree with here.  I'm in especially vigorous agreement with your points regarding hero worship and seeing newcomers as a source of fresh ideas/arguments instead of condescending them.</p>\n<p>There are also some points I disagree with.  And in the spirit of not considering any arguments above criticism, and disagreement being critical for finding the best answers, I hope you won't mind if I lay my disagreements out.  To save time, I'll focus on the differences between your view and mine.  So if I don't mention a point you made, you can default to assuming I agree with it.</p>\n<p>First, I'm broadly skeptical of the social psychology research you cite.  Whenever I read about a study that claims women are more analytical than men, or women are better leaders than men, I imagine whether I would hear about it if the experiment found the opposite result.</p>\n<p>I recommend <a href=\"http://econlog.econlib.org/archives/2015/01/diversity_of_th.html\">this blog post</a> on the lack of ideological diversity in social psychology.  Social psychologists are overwhelmingly liberal, and many openly admit to discriminating against conservatives in hiring.  <a href=\"http://www.joseduarte.com/blog/i-was-denied-admission-to-a-phd-program-because-of-my-perceived-political-views-reflections-of-a-sellout-how-diversity-would-strengthen-social-science\">Here</a> is a good post by a Mexican social psychologist that discusses how this plays out.  There's also the issue of publication bias at the journal level.  I know someone who served on the selection committee of a (minor &amp; unimportant, so perhaps not representative) psychology journal.  The committee had an explicit philosophy of only publishing papers they liked, and espousing &quot;problematic&quot; views was a strike against a paper.  Anyway, I think to some degree the field functions as a liberal echo chamber on controversial issues.</p>\n<p>There's really an entire can of worms here--social psychology is currently experiencing a major reproducibility crisis--but I don't want to get too deep in to it, because to defend my position fully, I'd want to share evidence for positions that make people uncomfortable.  Suffice to say that there's a third layer of publication bias at the level of your Facebook feed, and I could show you a different set of research-backed thinkpieces that point to different conclusions.  (Suggestion: if you wouldn't want someone on the EA Forum to make arguments for the position not X, maybe avoid making arguments for the position X.  Otherwise you put commenters in an impossible bind.)</p>\n<p>But for me this point is really the elephant in the room:</p>\n<blockquote>\n<p>some people in broader society now respond to correctable offenses with a mob mentality and too much readiness for ostracization, but just because some people have swung too far past the mark doesn’t mean we should default to a status quo that falls so short of it.</p>\n</blockquote>\n<p>I would like to see a much deeper examination here.  Insofar as I feel resistant to diversity efforts, this feels like most of what I'm trying to resist.  If I was confident that pro-diversity people in EA won't spiral towards this, I'd be much more supportive.  <a href=\"http://www.bartleby.com/17/1/60.html\">Relevant fable</a>.</p>\n<p>All else equal, increased diversity sounds great, but my issue is I see a pattern of other pro-diversity movements sacrificing all other values in the name of trying to increase diversity.  Take a statement like this one:</p>\n<blockquote>\n<p>Some of the most talented and resolute people in this community are here because they are deeply emotionally compelled to help others as much as possible, and we’re currently missing out on many such people by being so cold and calculating. There are ways to be warm and calculating! I can think of a few people in the community who manage this well.</p>\n</blockquote>\n<p>Being warm and calculating sounds great, but what if there's actually a tradeoff here?  Just taking myself as an example, I know that as I've become aware of how much suffering exists in the grand scheme of things, I've begun to worry less about random homeless people I see and stuff like that.  Even if there's some hack I can use to empathize with homeless people while retaining a global perspective, that hack would require effort on my part--effort I could put towards goals that seem more important.</p>\n<blockquote>\n<p>this particular individual — who is probably a troll in general — was banned from the groups where he repeatedly and unrelentingly said such things, though it’s concerning there was any question about whether this was acceptable behavior.</p>\n</blockquote>\n<p>Again, I think there's a real tradeoff between &quot;free speech&quot; and sensitivity.  I view the moderation of online communities as an unsolved problem.  I think we benefit from navigating moderation tradeoffs thoughtfully rather than reactively.</p>\n<p>Reminding people off the forum to upvote this post, in order to deal with possible hostility, is also a minor red flag from my perspective.  This resembles something Gleb Tsipursky <a href=\"http://effective-altruism.com/ea/12z/concerns_with_intentional_insights/\">once did</a>.</p>\n<p>None of this seems very bad in the grand scheme of things, especially not compared to what I've seen from other champions of diversity--I just thought it'd be useful to give concrete examples.</p>\n<p>Anyway, here are some ideas of mine, if anyone cares:</p>\n<ul>\n<li><p>Phrase guidelines as neutrally as possible, e.g. &quot;don't be a jerk&quot; instead of &quot;don't be a sexist&quot;.  The nice thing about &quot;don't be a jerk&quot; is it at admits the possibility that someone could violate the guideline by e.g. loudly calling out a minor instance of sexism in a way that generates a lot of drama and does more harm than good.  Rules should exist to serve everyone, and they should be made difficult to weaponize.  If most agree your rules are legitimate, that also makes them easier to enforce.</p>\n</li>\n<li><p>Team-building activities, icebreakers, group singalongs, synchronous movement, sports/group <a href=\"https://www.instagram.com/p/BKuM7GrgYwz/\">exercise</a>, and so on.  The ideal activity is easy for anyone to do and creates a shared EA tribal identity just strong enough to supersede the race/gender/etc. identities we have by default.  Kinda like how students at the same university will all cheer for the same sports team.</p>\n</li>\n<li><p>Following the example of the animal-focused EAs: Work towards achieving critical mass of underrepresented groups.  Especially if you can saturate particular venues (e.g. a specific EA meetup group).  I know that as a white male, I sometimes get uncomfortable in situations where I am the only white person or the only man in a group, even though I know perfectly well that no one is discriminating against me.  I think it's a natural response to have when you're in the minority, so in a certain sense there's just a chicken-and-egg problem.  Furthermore, injecting high-caliber underrepresented people into EA will help dismantle stereotypes and increase the number of one-on-one conversations people have, which I think are critical for change.</p>\n</li>\n<li><p>Take a proactive, rather than reactive, approach to helping EA men with women.  Again, I think having more women is playing a big role for animal-focused EAs.  More women means the average man has more female friends, better understands how women think, and empathizes with the situations women encounter more readily.  In this <a href=\"https://80000hours.org/2017/10/christine-peterson-computer-security/\">podcast</a>, Christine Peterson discusses the value of finding a life partner for productivity and mental health.  In the same way that CFAR makes EAs more productive through lifehacking, I could imagine someone working covertly to make EAs more productive through solving their dating problems.</p>\n</li>\n<li><p>Invite the best thinkers who have heterodox views on diversity to attend &quot;diversity in EA&quot; events, in order to get a diverse perspective on diversity and stay aware of tradeoffs.  Understand their views in enough depth to market diversity initiatives to the movement at large without getting written off.</p>\n</li>\n<li><p>When hiring a Diversity &amp; Inclusion Officer, find someone who's good at managing tradeoffs rather than the person who's most passionate about the role.</p>\n</li>\n</ul>\n<p>Again, I appreciate the effort you put in to this post, and I support you working towards these goals in a thoughtful way.  Also, I welcome PMs from you or anyone else reading this comment--I spent several hours on it, but I'm sure there is stuff I could have put better and I'd love to get feedback.</p>\n", "parentCommentId": null, "user": {"username": "xccf"}}, {"_id": "qkgiwLbAnsnYDfspr", "postedAt": "2017-10-27T03:29:15.775Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>I don't think we should police thoughts, only actions.</p>\n<p>We don't make it a crime to fantasize about killing someone--you only become a criminal when you act on those thoughts.  This illustrates a useful and widely applied principle of our legal system.  The willingness of some diversity advocates to disregard this principle is a good example of diversity advocates getting overzealous about diversity and sacrificing other values, as I complain about in <a href=\"http://effective-altruism.com/ea/1g3/why_how_to_make_progress_on_diversity_inclusion/c9o\">this</a> comment.</p>\n<p>Furthermore, I don't think condemning people for having beliefs we don't want is an effective way to change those beliefs--a <a href=\"https://www.vox.com/identities/2016/11/15/13595508/racism-trump-research-study\">variety</a> <a href=\"http://slatestarcodex.com/2013/06/22/social-psychology-is-a-flamethrower/\">of</a> <a href=\"https://www.nytimes.com/2015/12/13/opinion/sunday/the-rise-of-hate-search.html\">research</a> seems to indicate this doesn't work (though, I generally don't put too much stock in social psychology research, which includes those links, and I'm also not a good paper scrutinizer).</p>\n", "parentCommentId": "Q7scXQsdHYnQtX2SD", "user": {"username": "xccf"}}, {"_id": "ZprDkSwJS53MnMCyh", "postedAt": "2017-10-27T03:32:01.386Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>I think there are some varied skews here. It seems that we do well on representation of trans people generally and queer women relative to the total number of women, but not on queer men relative to the number of men. I think there are probably more political queer men (rejection of gay/straight binary sort of thing) than in most communities, but not many men who regularly sleep or seek to sleep with men. I know I was in the community for years before meeting one.</p>\n<p>So yes, I think the skew is toward straight, white dudes, and I'll say I do find the machismo off-putting even as a fairly straight-passing gay man.</p>\n", "parentCommentId": "XrayqXJuw3bt6DPMv", "user": {"username": "zdgroff"}}, {"_id": "5FbDMB36meKKCp9da", "postedAt": "2017-10-27T03:51:27.209Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<blockquote>\n<p>I suspect we, as a community, are bad at assessing talent. If true, that manifests as both a diversity problem...</p>\n</blockquote>\n<p>How we do we know that we are not bad at assessing talent in the opposite direction?</p>\n", "parentCommentId": "iknrnzT2Y5cKgWj3Z", "user": {"username": "David_Moss"}}, {"_id": "5hmCXKkrbYXSHnT3g", "postedAt": "2017-10-27T04:22:14.332Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>I found this comment frustrating because I see it making the mistake described <a href=\"http://effective-altruism.com/ea/1g3/why_how_to_make_progress_on_diversity_inclusion/c83\">here</a>:</p>\n<blockquote>\n<p>...I think that if you identify with or against some group (e.g. 'anti-SJWs'), then anything that people say that pattern matches to something that this group would say triggers a reflexive negative reaction. This manifests in various ways: you're inclined to attribute way more to the person's statements than what they're actually saying or you set an overly demanding bar for them to &quot;prove&quot; that what they're saying is correct. And I think all of that is pretty bad for discourse.</p>\n</blockquote>\n<p>I.e. &quot;rounding to the nearest outgroup&quot; instead of trying to understand what Kelly in particular is trying to communicate.</p>\n<p>Anyway, I wrote a long reply <a href=\"http://effective-altruism.com/ea/1g3/why_how_to_make_progress_on_diversity_inclusion/c9o\">here</a> where I took a first stab at differentiating between &quot;SJWs&quot; vs &quot;diversity advocates I can get behind&quot;.</p>\n", "parentCommentId": "7BQ8bfRhEz3Ye3g4q", "user": {"username": "xccf"}}, {"_id": "4YAaYTt2wXX53of95", "postedAt": "2017-10-27T04:23:47.514Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>It seems worth distinguishing 'effectiveness' in the sense of personal competence (as I guess is meant in the first case, e.g. 'reasonably sharp') and 'effectiveness' in the sense of trying to choose interventions by cost-effectiveness. </p>\n<p>Also remember that selecting people to encourage in particular directions is a subset of selecting interventions. It may be that 'E not A' people are more likely to be helpful than 'A not E' people, but that chasing either group is less helpful than doing research on E that is helpful for whichever people already care about it. I think I have stronger feelings about E-improving interventions overall being good than about which people are more promising allies. </p>\n", "parentCommentId": "es4FuRGkvi23MFwRk", "user": {"username": "Katja_Grace"}}, {"_id": "Gb5ZJ3MQKX9bHBdNZ", "postedAt": "2017-10-27T04:34:00.418Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>I think I've noticed a pattern where basically any hypothesis that's not the discrimination hypothesis gradually leaves the Overton window.</p>\n", "parentCommentId": "8TGD5aBarytYz5GdC", "user": {"username": "xccf"}}, {"_id": "BoFXAJaTpvSwY4edy", "postedAt": "2017-10-27T05:29:05.755Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>Many of these are good arguments, and I really appreciate the honesty and detail Kelly has put forth here. But zoinks, some are also quite controversial, and not accepted by many scholars in academia. </p>\n<p>Here are some sharp thinkers who argue against the notion that diversity and inclusion can be enforced without severe repercussions:</p>\n<p>Prof. Jonathan Haidt's <a href=\"https://www.youtube.com/watch?v=kaQ-ZF9S3uk\">presentation on Truth and Social Justice</a>.</p>\n<p>Prof. Jordan Peterson's <a href=\"https://www.youtube.com/watch?v=V7HPbjsYYGg\">presentation on equity and authoritarianism</a>.</p>\n<p>Prof. and EA Geoff Miller's argument about <a href=\"http://quillette.com/2017/07/18/neurodiversity-case-free-speech/\">the neurodiversity case for free speech</a>.</p>\n<p>Prof. Steven Pinker, who endorses MacAskill's book, and EA, and identifies as utilitarian, said these words in his book on the decline of violence:</p>\n<p>“Politically correct sensibilities may bridle at the suggestion that a group of people, like a variety of fruit, may have features in common, but if they didn’t, there would be no cultural diversity to celebrate and no ethnic qualities to be proud of. Groups of people cohere because they really do share traits, albeit statistically. So a mind that generalizes about people from their category membership is not ipso facto defective. African Americans today really are more likely to be on welfare than whites, Jews really do have higher average incomes than WASPs, and business students really are more politically conservative than students in the arts — on average.</p>\n<p>The problem with categorization is that it often goes beyond the statistics. For one thing, when people are pressured, distracted, or in an emotional state, they forget that a category is an approximation and act as if a stereotype applies to every last man, woman, and child. For another, people tend to moralize their categories, assigning praiseworthy traits to their allies and condemnable ones to their enemies. During World War II, for example, Americans thought that Russians had more positive traits than Germans; during the Cold War they thought it was the other way around.”</p>\n<p>EA supporter Peter Thiel's <a href=\"https://www.youtube.com/watch?v=E6cxRYgqfHY\">comments on diversity</a> from twenty years ago.</p>\n<p>Professor Thomas Sowell <a href=\"https://www.youtube.com/watch?v=P7FrBYi8pKA\">gives his perspective</a> on social justice. Sowell's book <a href=\"https://en.wikipedia.org/wiki/The_Vision_of_the_Anointed\">Vision of the Anointed</a> has set ground for much of the discussion that came later.</p>\n<p>There is the <a href=\"https://www.facebook.com/groups/1449282541750667/\">Heterodox EA Facebook group</a>, inspired by Haidt's <a href=\"https://heterodoxacademy.org/\">Heterodox Academy</a>.</p>\n", "parentCommentId": null, "user": {"username": "ScoobyDoo"}}, {"_id": "MjuDpFkL9h8Xr4Doe", "postedAt": "2017-10-27T08:30:54.668Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>On one hand, it is technically better to change things if that motivates people to become involved in the community. But on the other hand, if someone is ethically motivated to do the right thing, and they find that EA is plausibly in the right lane for this purpose, then you would expect them to be involved in productive activities regardless of whether their personality types are similar or not. That's not any more of a sacrifice than we make in other sorts of things: I recruited for a finance career, despite the fact that the personality types and culture are antithetical to my own, I am in the military, despite the fact that the personality types and culture are antithetical to my own, I donate money, despite the fact that I would have more personal happiness than if I didn't, and so on. </p>\n<p>The kinds of people who <em>would</em> be doing EA things <em>if and only if</em> we were a little bit more appealing are the kinds of people who <em>won't</em> take the ethically optimal career route, because the ethically optimal career route is not likely to be optimally appealing, and that is something that we can't change. If someone can only be brought into the movement by catering, they're not going to suddenly change and automatically act as forcefully and positively as the rest of us; they'll <em>still</em> need to be catered to for additional steps on and on into the future. You can see examples of this with activist groups on college campuses, where administrations make costly room and concessions to activists and yet continually face additional demands and disruption.</p>\n<p>This, of course, is not a statement that all people who are motivated in such a way are like this nor is it a statement that such people would not bring substantial positive value to the movement on balance. And I'm not making any judgements about character, just observing the ethically relevant facets of human behavior. The point is that the positive impact of such expansion is more limited than you would naively think and therefore warrants less resource allocation than expansions which would attract similar numbers of other types of people.</p>\n<p>I'm also skeptical that concessions like this actually do much. If you want an example, look at the early criticisms of EA, where people talked about how we 'neglect systemic change'. Over and over and over again, we explained that you can do systemic change in EA, please come and do systemic change with us, we're compatible, and so on. There were a couple articles saying &quot;Can EA change the world? It already has&quot; and &quot;We love systemic change.&quot; Now there have even been two peer-reviewed published philosophy papers driving this point home, by Joshua Kissel and Brian Berkey. Then 80,000 Hours said &quot;hold up guys, only 15% of people should earn to give, we don't want to be misunderstood.&quot; And on and on and on. This was all a fine response, of course. </p>\n<p>But has it actually changed the behavior of the people who raised those critiques? Have any of the critics recanted and said &quot;okay, I'll join EA now, and develop some EA-based systemic change&quot;? Are EA's ranks swelling with a new crop of excited leftist revolutionaries? No! This kind of movement growth is nowhere to be found! When was the last time you heard ANY Effective Altruist argue that poverty alleviation is neutral or harmful because it reduces the probability that capitalism will be superseded? Never! Yes, there are a few EA leftists whose main priority is to systemically reform capitalism, but not significantly more than there were in the first place, and they are a tiny group in comparison to the liberals, the conservatives, the vegans, the x-risk people, and so on. As far as I can tell, the impact of all these articles and comments in bringing leftists into active participation with EA was totally nonexistent. </p>\n<p>So while there is a difference between the demographics under consideration here and the progressive-leftist political group in this example, don't expect to work any wonders from piling on disclaimers and bureaucracy and openness and other things. You can look outside EA for other examples. The US military does many of the things that you suggest. SHARP/EO representatives, briefings, policies, and on and on and on. But that didn't substantially change our demographics, culture, sexual assault rates, or anything of the sort. It didn't stop PVT Manning from going sufficiently crazy and disassociated with military culture on the basis of gender dysphoria to decide to harm the organization.</p>\n<p>So instead of engaging in the knee-jerk logic of &quot;there's a diversity problem - let's start doing pro-diversity things!&quot; we should be focusing on reason and evidence so that we only spend time and money on solutions where we have a significant expectation of something meaningful being accomplished.</p>\n<p>Of course you are pretty clear in your post that, yes, things should be evidence based, there is weak-but-mounting evidence supporting interventions like this, and so on. But I want to emphasize a higher bar of skepticism than what people are likely to take away from your post, especially since the opportunity cost for EA resources is much higher than it is in other contexts.</p>\n<p>E.g.:</p>\n<blockquote>\n<p>● CEA and EAF could both, or jointly, hire a Diversity &amp; Inclusion Officer</p>\n</blockquote>\n<blockquote>\n<p>● All organizations should hire communications staff who are versed in inclusionary communications practices. Alternatively, the Diversity &amp; Inclusion Officer could train them.</p>\n</blockquote>\n<p>These are both moderately costly additions to bureaucracy, and I don't really see what their value is. I'm aware that lots of organizations put emphasis on these types of things, but what are the exact outputs and impacts? </p>\n<blockquote>\n<p>● Adopt and enforce a clear policy — as organizations and individuals — for dealing seriously and fully with illegal actions like sexual harassment and explicit discrimination or discrimination revealed by HR or legal counsel. </p>\n</blockquote>\n<p>While I'm not saying this is a bad thing, I don't see what the motivation is. If the problem is gender bias, or ineffective marketing, or narrow appeal, or things of that nature, then they should be dealt with appropriately. What we should not do is lump together every gender-related problem as part of a monolithic reason to implement all gender-related solutions. It's simply less efficient.</p>\n<blockquote>\n<p>For instance, it should be outright unacceptable for someone to say that women do not contribute to society and are leeches if they don’t offer men sex. This actually happened, recently, </p>\n</blockquote>\n<p>So I was the one who, more than anyone else, told that person that they were an idiot who ought to shut up. But it wasn't just because they were sexist. I think one of the underlying problems here is not just sexism but people who just don't care enough about the EA movement itself. I would expect any sexist or racist to at least be decent and intelligent enough to know that there are some pots you don't stir, purely as a practical means of maintaining a productive movement. I see lots of people talk about making EA more appealing or more diverse, which is fine, but one of the underlying causes of <em>all</em> of these issues, both when it comes to sexists picking fights and when it comes to members of marginalized groups refraining from contributing, is that people care more about things like lifestyle, community and tribal affiliation than they do about sitting down to do productive ethical work. And that's a super hard thing to change, but it warrants some attention. We can't just sit around and rely on a shaky combination of atypical saints on one hand and clever marketing on the other.</p>\n<p>Edit: also, I have to add that you are being a little bit uncharitable to the person who said that. They said something bad, but not quite how you describe it. I'm not saying this because I care about them, but just because it's bad if people read this and think &quot;omg, an effective altruist said this! Look how sexist EAs are!&quot; and it gets repeated and spread as a false rumor.</p>\n", "parentCommentId": null, "user": {"username": "kbog"}}, {"_id": "i5Partpi9W2aXvoXX", "postedAt": "2017-10-27T08:41:33.868Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<blockquote>\n<p>Variant on this idea: I'd encourage a high status person and a low status person, both of whom regularly post on the EA Forum, to trade accounts for a period of time and see how that impacts their likes/dislikes.</p>\n</blockquote>\n<p>Problem is that the participants would not be not blinded, so they would post differently. People act to play the role that society gives them.</p>\n", "parentCommentId": "TFmpfJ6KuLYKfaEvH", "user": {"username": "kbog"}}, {"_id": "E8MHH4vnj4rCKDAxQ", "postedAt": "2017-10-27T08:57:15.993Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>The reason that we don't blindly follow credentials is not that we think that we're better than everyone else. It's because we're the first to approach new kinds of problems which haven't been addressed before with a rigorous, interdisciplinary framework. When you have those goals and ingredients, new people can make progress just as well as traditional experts can.</p>\n", "parentCommentId": "qgMNhqhzjsoHFoumY", "user": {"username": "kbog"}}, {"_id": "s9SKvFRoKECmfhPJh", "postedAt": "2017-10-27T09:08:28.227Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<blockquote>\n<p>First, if the EA movement genuinely aspires to cause-neutrality, then we should care about benefits that accrue to others regardless of who these other people are and independent of what the causal route to these benefits is. As such, we should also care about the benefits that becoming a diverse and inclusive movement would have for women, people of color, and disabled and trans people in and outside of the community. </p>\n</blockquote>\n<p>Aside from the direct question of cause prioritization which has already been mentioned, I think it's bad to be explicitly self-serving. Even if the concept would technically work out in the grand calculus, it's better for social-moral reasons to <em>not</em> treat ourselves as ultimate ends. It runs counter to the idea of an altruist movement.</p>\n<blockquote>\n<p>if the EA community fails to become more diverse and inclusive we'll suffer reputation costs in the media, in academia, among progressives, and in the nonprofit world for being a community that is exclusionary</p>\n</blockquote>\n<p>The people who get bothered along these lines to such a degree - as in, they think negatively of EA for being &quot;exclusionary&quot; just because we don't do enough catering and decide to condemn it - are not a substantial proportion of media, academia, or the broad liberal political sphere. They are a small group of people who care more about tribal politics than they do about ethical work, and they won't turn around and cooperate just because you want to get along with them. In the long run, it's bad to fall victim to these kinds of heckler's vetoes. (The phrase &quot;negotiating with terrorists&quot; comes to mind.)</p>\n", "parentCommentId": "RAJM47Syj59SkS6rx", "user": {"username": "kbog"}}, {"_id": "fqfZpLoW5PrWhSPq2", "postedAt": "2017-10-27T10:20:08.326Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<blockquote>\n<p>All else equal, increased diversity sounds great, but my issue is I see a pattern of other pro-diversity movements sacrificing all other values in the name of trying to increase diversity. </p>\n</blockquote>\n<p>It's not unheard of, but it seems more common than it is because only the movements and initiatives which go too far merit headlines and attention. The average government agency, F500 company, or similar organization piles on all kinds of diversity policies without turning into the Nightmare on Social Justice Street.</p>\n", "parentCommentId": "zu6SSnxTzxGTKWmQS", "user": {"username": "kbog"}}, {"_id": "Ne9wBDCbn7Saj7LoW", "postedAt": "2017-10-27T10:27:25.484Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<blockquote>\n<p>For example, I'm hugely in favour of collaborative discussions over combative discussions, but I find it very helpful to have discussions that stylistically appear combative while actually being collaborative. For example: frequent, direct criticism of ideas put forward by other people is a hallmark of combative discussion, but can be fine so long as everyone is on an even footing and &quot;you are not your ideas&quot; is common knowledge.</p>\n</blockquote>\n<p>Yeah, we have already gone too far with condemning combaticism on the EA forum in my opinion. Demanding that everyone stop and rephrase their language in careful flowery terms is pretty alienating and marginalizing to people who aren't accustomed to that kind of communication, so you're not going to be able to please everyone.</p>\n", "parentCommentId": "qecs2NQ3xoRBwLj27", "user": {"username": "kbog"}}, {"_id": "yf3p8epmpZHRK6BZZ", "postedAt": "2017-10-27T10:29:09.677Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>I'm really not sure why my comment was so heavily downvoted without explanation. I'm assuming people think discussion of inclusion issues is a terrible idea. Assuming that is what I've been downvoted for, that makes me feel disappointed in the online EA community and increases my belief this is a problem.</p>\n<blockquote>\n<p>I tried to avoid things that have already been discussed heavily and publicly in the community</p>\n</blockquote>\n<p>I think this may be part of the problem in this context. Some EAs seem to take the attitude (i'm exaggerating a bit for effect) that if there was a post on the internet about it once, it's been discussed. This itself is pretty unwelcoming and exclusive, and it penalises people who haven't been in the community for multiple or haven't spend many hours reading around internet posts. My subjective view is that this topic is under-discussed relative to how much I feel it should be discussed. </p>\n", "parentCommentId": "DcLhzfATnjwP2NJTR", "user": {"username": "MichaelPlant"}}, {"_id": "PsXSbhpaDC7WpfZAa", "postedAt": "2017-10-27T10:30:40.881Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>okay. point taken</p>\n", "parentCommentId": "mwJtgQBJWZdJgvCtT", "user": {"username": "MichaelPlant"}}, {"_id": "CzD3JNWaKQGoK7EZ4", "postedAt": "2017-10-27T10:33:25.629Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>Interesting. Hadn't put these together in my mind. Could well be something here. </p>\n", "parentCommentId": "xurw9FT7YMrSPou33", "user": {"username": "MichaelPlant"}}, {"_id": "q2mFW8MqJn36m2RhT", "postedAt": "2017-10-27T10:40:46.654Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>I guess I'm basing my subjective judgement of 'conspicuous by it's absence' by comparing how much inclusivity gets discussed in wider society vs how much it gets discussed in EA. I don't think a few posts over a few years really cuts the mustard, not when it's not obvious how much is being done on this issue. </p>\n", "parentCommentId": "3nu8t2Y2Cob5gijH2", "user": {"username": "MichaelPlant"}}, {"_id": "xPQD9kEC3Gw25su6h", "postedAt": "2017-10-27T10:42:20.997Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>I find this troubling. If a small sample of the evidence cited has been misreported or is weak, this seems to cast serious doubt on the evidence cited in the rest of the piece. Also, my prior is that pointing to lots of politically amenable social psychology research is a big red flag. </p>\n", "parentCommentId": "dBTGmuZWjnvErA9tt", "user": null}, {"_id": "9gmwBwtZeQXydmmnB", "postedAt": "2017-10-27T10:48:14.568Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>So it is &quot;social justice warrior&quot; ideology. So what? Maybe some kinds of social justice warrior ideology are good. </p>\n<p>See: <a href=\"http://lesswrong.com/lw/e95/the_noncentral_fallacy_the_worst_argument_in_the/\">http://lesswrong.com/lw/e95/the_noncentral_fallacy_the_worst_argument_in_the/</a></p>\n", "parentCommentId": "7BQ8bfRhEz3Ye3g4q", "user": {"username": "kbog"}}, {"_id": "uvwGt49GjyTKwJPhM", "postedAt": "2017-10-27T11:17:16.294Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>Hmm, I am surprised that people downvoted it so much as well. Perhaps people thought that the comment was naive, ie. that even if you were in favour of taking some diversity measures, we shouldn't do it just because everyone else is jumping on the bandwagon.</p>\n<p>I suspect that you would have received a more positive response if you'd written something more measured like: &quot;The fact that so many other groups have decided to implement diversity measures provides some degree of Bayesian evidence that it is a good idea&quot;</p>\n", "parentCommentId": "yf3p8epmpZHRK6BZZ", "user": {"username": "casebash"}}, {"_id": "9ZvgFgJ8JqS7jceJv", "postedAt": "2017-10-27T11:24:16.149Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>That's a fascinating suggestion.</p>\n", "parentCommentId": "vdNw488ucu7X9JCqP", "user": {"username": "casebash"}}, {"_id": "n2YDRRb9yM2xbeJPt", "postedAt": "2017-10-27T11:41:50.766Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>The pattern I see is that &quot;organizations&quot; (such as government agencies or Fortune 500 companies) usually turn out OK, whereas &quot;movements&quot; or &quot;communities&quot; (e.g. the atheism movement, or the open source community) often turn out poorly.</p>\n", "parentCommentId": "fqfZpLoW5PrWhSPq2", "user": {"username": "xccf"}}, {"_id": "GKqJpen4ckXS74Ap6", "postedAt": "2017-10-27T11:50:45.325Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>Hm, that's a good point. I can't come up with a solid counterexample off the top of my head.</p>\n", "parentCommentId": "n2YDRRb9yM2xbeJPt", "user": {"username": "kbog"}}, {"_id": "kezQBhqKmKcPXGNd2", "postedAt": "2017-10-27T12:57:49.410Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>I can't address all of this but will say three quick things:</p>\n<blockquote>\n<p>I'm broadly skeptical of the social psychology research you cite</p>\n</blockquote>\n<p>I appreciate it's weakness, but it's at least some evidence against people's intuitions and in addition to the literature on how those intuitions are demonstrably false and discriminatory it should update people away from those discriminatory beliefs.</p>\n<p>[Edit: I appreciate that I should generally behave as though my community will behave well, and as such I should not have requested that people upvote even if I just asked them to &quot;upvote if [they] find the post useful.&quot; I want to be sure to flag in this response though the incredibly poor way in which people who disagree with claims and arguments in favor of diversity and inclusion are using their votes, in comments and on the whole post. It's worth explicitly observing that identity-driven voting here is not equal among opposers and supporters, but seems clearly dominated by opposers.]</p>\n<p>I appreciate your suggestions a lot, but caution you to be careful of your own assumptions. For instance, I never suggested that a Diversity &amp; Inclusion Officer should be the person most passionate about the role instead of most smart about it.</p>\n<p>To emphasize though, so it doesn't get lost behind those critical thoughts: I thoroughly appreciate the suggestions you've contributed here.</p>\n<p>[Edit: Apologies for some excessive editing. I readily acknowledge that in an already a hostile environment, my initial reaction to criticism regarding an important issue that is causing a lot of harm is too defensive.]</p>\n", "parentCommentId": "zu6SSnxTzxGTKWmQS", "user": {"username": "Kelly_Witwicki"}}, {"_id": "aBHBKGEQPj6SWytB7", "postedAt": "2017-10-27T13:19:51.613Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>Where do we draw the line? Is intrinsic abilities an acceptable topic of casual discussion? Do you think it would be humiliating for people who are being discussed as having less intrinsic ability?</p>\n", "parentCommentId": "8TGD5aBarytYz5GdC", "user": {"username": "Lila"}}, {"_id": "b2CAh7Q7XcRznQHEG", "postedAt": "2017-10-27T13:20:53.416Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>I wouldn't concern yourself much with downvotes on this forum. People use downvotes for a lot more than the useful/not useful distinction they're designed for (most common other reason is to just signal against views they disagree with when they see an opening). I was recently talking to someone about what big improvements I'd like to see in the EA community's online discussion norms, and honestly if I could either remove bad comment behavior or remove bad liking/voting behavior, it'd actually be the latter.</p>\n<p>To put it another way, though I'm still not sure exactly how to explain this, I think no downvotes and one thoughtful comment explaining why your comment is wrong (and no upvotes on that comment) should do more to change your mind than a large number of downvotes on your comment.</p>\n<p>I'm really still in favor of just removing downvotes from this forum, since this issue has been so persistent over the years. I think there would be downsides, but the hostile/groupthink/dogpiling environment that the downvoting behavior facilitates is just really really terrible.</p>\n", "parentCommentId": "yf3p8epmpZHRK6BZZ", "user": {"username": "Jacy"}}, {"_id": "sBskYXzcpJYkrrdzC", "postedAt": "2017-10-27T13:22:23.325Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>The problem is that those thoughts, as I noted, become actions, just actions we can usually only see as systematic trends. Just because someone does not say &quot;women are incompetent&quot; does not mean they aren't underestimating women's competence and e.g. hiring them less than he should. Taking action on this just requires a more systematic approach than explicit discrimination does.</p>\n<p>I agree that in terms of what works, just pointing out bias doesn't seem to help and can even backfire, as I mentioned, which is why I provided a list of other possible solutions.</p>\n", "parentCommentId": "qkgiwLbAnsnYDfspr", "user": {"username": "Kelly_Witwicki"}}, {"_id": "2ggJpxWc5PECbhB9Z", "postedAt": "2017-10-27T13:23:56.414Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>I think that's a huge part of the reason why we overrepresent people the demographics we do. But offloading responsibility onto part of the pipeline below us isn't sufficient, least of all when we can source from other pipelines.</p>\n", "parentCommentId": "xurw9FT7YMrSPou33", "user": {"username": "Kelly_Witwicki"}}, {"_id": "Xp4ocq73PL9RoZyMu", "postedAt": "2017-10-27T13:24:49.050Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>If people have to opt into it, we can assume the people who currently misuse their votes won't.</p>\n", "parentCommentId": "vdNw488ucu7X9JCqP", "user": {"username": "Kelly_Witwicki"}}, {"_id": "uvgurJqeFtadkFk4m", "postedAt": "2017-10-27T13:25:18.414Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>For what it's worth, I think if you had instead commented with: &quot;As a newcomer to this community, I see very little evidence that EA prizes accuracy more than average. This seems contrary to its goals, and makes me feel sad and unwelcome,&quot; (or something similar that politely captures what you mean) that would have been a valuable contribution to the discussion.</p>\n<p>That being said, you might have still gotten downvoted. People's downvoting behavior on this forum is really terrible and a huge area for improvement in online EA discourse.</p>\n", "parentCommentId": "L9hStGgeTLCy8p7wP", "user": {"username": "Jacy"}}, {"_id": "8biG8rrqcReEuCd8t", "postedAt": "2017-10-27T13:28:20.141Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>Another concrete suggestion: I think we should stop having downvotes on the EA Forum. I might be not appreciating some of the downsides of this change, but I think they are small compared to the big upside of mitigating the toxic/hostile/dogpiling/groupthink environment we currently seem to have.</p>\n<p>When I've brought this up before, people liked the idea, but it never got discussed very thoroughly or implemented.</p>\n<p>Edit: Even this comment seems to be downvoted due to disagreement. I don't think this is helpful.</p>\n", "parentCommentId": "vdNw488ucu7X9JCqP", "user": {"username": "Jacy"}}, {"_id": "LQft5GzqavGmiHf7A", "postedAt": "2017-10-27T13:39:43.701Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>I think thoughtful, rationality-focused people (not just EA, but even, say, young software engineers) can often outperform the average 'expert,' with expertise measured by traditional credentials like having a PhD. There are many biases that pervade academia and other fields (e.g. publication bias, status quo bias, publish or perish incentives), and thoughtful people have often done a lot more than traditional experts to understand and overcome these biases. They also get the benefit of going into a field without as many preconceptions and personal investments, allowing them to better synthesize the literature in a less-biased way.</p>\n<p>I don't have many examples on hand (and would really like if someone else can provide them), but I feel there's a solid track record of a thoughtful, rationality-focused person disagreeing strongly with traditional experts. Only two are coming to mind right now:</p>\n<p>One is Eliezer Yudkowsky, a self-educated blogger, advocating for a focus on safety in the AI community that most traditional AI experts thought was crazy, but now the traditional AI community has shifted heavily towards Yudkowsky.</p>\n<p>Another one is the Superforecasters discussed by Phil Tetlock doing very well at predicting future events (e.g. whether there will be a civil war in a certain country), despite traditional experts doing little better than chance.</p>\n", "parentCommentId": "qgMNhqhzjsoHFoumY", "user": {"username": "redmoonsoaring"}}, {"_id": "rnByfQREwrinMPnKx", "postedAt": "2017-10-27T14:02:08.730Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>I'm not sure why you brought up the downvoting in your reply to <em>my</em> reply to your comment, rather than replying directly to the downvoted comment. To be clear, though, I did not downvote the comment, ask others to downvote the comment, or hear from others saying they had downvoted the comment.</p>\n<p>Also, I could (and should) have been clearer that I was focusing only on points that I didn't see covered in the post, rather than providing an exhaustive list of points. I generally try to comment with marginal value-add rather than reiterating things already mentioned in the post, which I think is sound, but for others who don't know I'm doing that, it can be misleading. Thank you for making me notice that.</p>\n<p>Also:</p>\n<blockquote>\n<p>I think this may be part of the problem in this context. Some EAs seem to take the attitude (i'm exaggerating a bit for effect) that if there was a post on the internet about it once, it's been discussed.</p>\n</blockquote>\n<p>In my case, I was basing it on stuff <em>explicitly, directly mentioned in the post on which I am commenting, and a prominently linked post</em>. This isn't &quot;there was a post on the internet about it once&quot; this is more like &quot;it is mentioned right here, in this post&quot;. So I don't think my comment is an example of this problem you highlight.</p>\n<p>Speaking to the general problem you claim happens, I think it is a reasonable concern. I don't generally endorse expecting people to have intricate knowledge of years' worth of community material. People who cite previous discussions should generally try to link as specifically as possible to them, so that others can easily know what they're talking about without having had a full map of past discussions.</p>\n<p>But imo it's also bad to bring up points as if they are brand new, when they have already been discussed before, and <em>especially</em> when others in the discussion have already explicitly linked to past discussions of those points.</p>\n", "parentCommentId": "yf3p8epmpZHRK6BZZ", "user": {"username": "vipulnaik"}}, {"_id": "QuwBwrPFbfYj86Dwg", "postedAt": "2017-10-27T14:13:23.824Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>I think it depends on the particular space. The rationality community should aim to have everything open to discussion because that is its purpose. The EA community should minimise these discussions in that they are rarely necessarily and quite often a distraction. In most groups I've been in, social norms can prevent the need for formal rules though.</p>\n", "parentCommentId": "aBHBKGEQPj6SWytB7", "user": {"username": "casebash"}}, {"_id": "nSA4JEeEf7rSfqvtp", "postedAt": "2017-10-27T15:05:37.242Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>I like Michael's distinction between the style and core of an argument. I'm editing this paragraph to clarify the way in which I'm using a few words. When I talk about whether an argument is actually combative or collaborative, I mean to indicate whether it is more effective at goal-oriented problem-solving or at achieving political ends. By politics, I mean something like &quot;social maneuvers taken to redistribute credit, affirmation, etc. in a way that is expected to yield selfish benefit&quot;. For example, questioning the validity of sources would be combative if the basic points of an argument held regardless of the validity of those sources.</p>\n<p>Claims like “EA would attract many additional high quality people if women were respected” or “social justice policing would discourage many good people from joining EA” are, while true, basically all combative, and the framing of effectiveness is just helping people self-deceive into thinking they’re motivated by impact or truth. They’re using a collaborative style (the style of caring about impact/truth) to do a combative thing (politics, in the wide definition of that word).</p>\n<p>Ultimately, I can spin the observation that these things are combative into a stylistically collaborative but actually combative argument for my own agenda, so everything I’m saying is suspect. To illustrate: the EA phrase “politics is the mindkiller” is typically combatively used in this way, and I have the ability to do something similar here. “Politics is the mindkiller” is the mindkiller, but recognizing this won’t solve the problem, in the same way recognizing politics is the &quot;mindkiller&quot; doesn’t.</p>\n<p>People can smell this, and they’d be right to distrust your movement’s ability to think clearly about impact, if you’re using claims of impact and clearer thinking to justify your own politics. People who are bright enough to figure this out are typically the ones I'd want to be working with.</p>\n<p>Yeah, you all have a problem with how you treat women and other minority groups. Kelly did a lot of work in order to point out a real phenomenon, and I don’t see anyone taking her very seriously. You let people who want to disparage women get away with doing so by using a collaborative “impact and truth” discussion style to achieve combative, political aims. That’s just the way the social balance of power lies in EA. People would use “impact and inclusivity” as a collaborative style to achieve political aims if the balance of power were flipped. Plausibly there’s an intermediate sweet spot where this happens less overall, though shifting the balance of power to such spots is never a complete solution. I suspect a better approach would be to get rid of the politics first; this will make it easier to make progress on inclusivity.</p>\n<p>The norm of letting people stylize politics with talk of impact and truth is deeply ingrained in EA. It’s best to work outside the social edifice of EA, if you want to think clearly about impact and truth. Which feels like a shame, but isn’t too bad if you take the view that good people will eventually be drawn to you if you’re doing excellent work. That was GiveWell's strategy, and it worked.</p>\n", "parentCommentId": "qecs2NQ3xoRBwLj27", "user": {"username": "James_Winterford"}}, {"_id": "aivM3SQkk9Xu66SSj", "postedAt": "2017-10-27T16:40:06.065Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>&quot;I'm assuming people think discussion of inclusion issues is a terrible idea.&quot;</p>\n<p>This is a misreading. I'm almost sure you were downvoted because readers perceived this to be the reverse of the truth: &quot;I think it weird, given there's so much mainstream discussion of inclusion, that it hasn't seemed to penetrate into EA.&quot;</p>\n<p>It's a topic that has been discussed intensely, frequently and continuously in EA since its inception, both online and off. If someone had asked me to compile a list of the all-time most-discussed topics in EA, this would be near the top. That's not to say we shouldn't continue discussing it here of course and I appreciate Kelly's quite comprehensive list of the possible ways we could try to increase diversity in the community.</p>\n", "parentCommentId": "yf3p8epmpZHRK6BZZ", "user": {"username": "Robert_Wiblin"}}, {"_id": "RXusjQkbDPvRcacF2", "postedAt": "2017-10-27T17:26:35.150Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>I previously defended keeping down-votes, I confess I'm not so sure now. </p>\n<p>A fairly common trait is people conflate some viewpoint independent metric of 'quality' with 'whether I like this person of the view they espouse'. I'm sure most users have voting patterns that line up with these predictors pretty strongly, although there is some residual signal from quality: I imagine a view where one has a pretty low threshold for upvoting stuff sympathetic to ones view, and a very high one for upvoting non-sympathetic, and vice versa for downvotes.</p>\n<p>I'm not sure how the dynamic changes if you get rid of downvotes though. Assuredly there's a similar effect where people just refrain to upvote your stuff and slavishly upvote your opponents. There probably is some value in 'nuking' really low quality remarks to save everyone time. Unsure.</p>\n", "parentCommentId": "b2CAh7Q7XcRznQHEG", "user": {"username": "Gregory_Lewis"}}, {"_id": "Z33v9RNDYFuZRoduS", "postedAt": "2017-10-27T17:41:16.635Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>I do think that there should be higher bars for overtly signalling collaborativeness online, because so many other cues are missing.</p>\n", "parentCommentId": "Ne9wBDCbn7Saj7LoW", "user": {"username": "Michael_PJ"}}, {"_id": "MDLZhoFjW6mMWmysJ", "postedAt": "2017-10-27T17:55:26.798Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<blockquote>\n<p>I'm assuming people think discussion of inclusion issues is a terrible idea. Assuming that is what I've been downvoted for, that makes me feel disappointed in the online EA community and increases my belief this is a problem.</p>\n</blockquote>\n<p>This seems like a lot to infer from some downvotes.</p>\n<p>FWIW I didn't downvote your comment but it annoyed me. It was this:</p>\n<blockquote>\n<p>I think it weird, given there's so much mainstream discussion of inclusion, that it hasn't seemed to penetrate into EA.</p>\n</blockquote>\n<p>I feel like I've seen quite a lot of discussion of diversity in EA, and I don't think it's been overly unsophisticated. This comment therefore feels frustrating, like the &quot;why doesn't EA talk about systemic change?&quot; comments. I would guess this is a common feeling, given the positive response to <a href=\"http://effective-altruism.com/ea/1g3/why_how_to_make_progress_on_diversity_inclusion/c7n\">http://effective-altruism.com/ea/1g3/why_how_to_make_progress_on_diversity_inclusion/c7n</a> . That might explain the downvotes. On the other hand, this</p>\n<blockquote>\n<p>My subjective view is that this topic is under-discussed relative to how much I feel it should be discussed.</p>\n</blockquote>\n<p>feels much more positive to me. Okay, Michael Plant thinks we need to have a <em>lot</em> of discussion about this for some reason. Fair enough.</p>\n", "parentCommentId": "yf3p8epmpZHRK6BZZ", "user": {"username": "Michael_PJ"}}, {"_id": "Lfk4iCgvER5JbCZbi", "postedAt": "2017-10-27T17:59:02.527Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>I'm confused, you mean people should be expected to explicitly signal that they are being collaborative?</p>\n<p>In my view the basic structure of a &quot;combative&quot; debate need not entail any negative connotation of hostility or interpersonal trouble. Point/counterpoint is just a standard, default, acceptable mode of discussion. So ideally, when you see people talking like that, as long as things are reasonably civil then you don't feel a need to worry about it. It's a problem that some people don't see &quot;combative&quot; discussions in this way, but I don't think there is any better solution in the long run. If you try to evolve norms to avoid the uncertainty and negative perceptions then you run along a treadmill - like the story with politically correct terminology. It's okay to have a combative structure as long as you stick within the mainstream window of professional and academic discourse, and I think EA is mostly fine at that.</p>\n", "parentCommentId": "Z33v9RNDYFuZRoduS", "user": {"username": "kbog"}}, {"_id": "7fGfEYgkG3BFGbfpb", "postedAt": "2017-10-27T18:36:31.129Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>Your portrait of what the EA community could be is a beautiful one and made me tear up. You hit the nail on the head many times in this post on the subtle connections between things that I think can be hard to identify: the connection between heart and head, the E and the A, the overuse of jargon, and the hero worship, and so on. I have to say that as a fairly straight-passing gay man with immense amounts of privilege, even I feel many of these pressures and am often put off by the alpha-male machismo you often see in EA spaces.</p>\n<p>I’ve witnessed discrimination and harassment, and heard of assault, in EA-ish spaces, and it seems pretty clear that this is contributing to the gender gap. I’ve definitely exhibited some of the combative and argumentative behaviors you mention. When I got into the EA community a few years ago, I began in global poverty and animal advocacy circles, and I found they were much better on these issues than the community is now, sadly. (That’s with both of those areas’ having plenty of problems.)</p>\n<p>I think Kelly moved us toward a type of dialogue on this issue that is lacking in the world, and I hope we can have more of it. Right now, discussions around diversity and inclusion seem polarized between the sort of “rationalist” discussion that’s snarky and dismissive on the one hand and an ostracizing mob mentality on the other hand. I don’t want to say EA should chart a middle path, because I think we should lean toward being overly zealous on diversity and inclusion rather than away, but I think EA and its aligned movements (animal advocacy in my mind) would benefit from a conversation that is at the same time inclusive and data-based. I don’t think the world has that type of conversation very often.</p>\n<p>The lack of conversations that are both inclusive and data-based seems to lead to pretty bad results, where diversity and inclusion are may not be promoted in the most effective ways, and people opposed to diversity and inclusion harbor suspicions about the world (e.g. that discrimination does not exist) that continue to fester unaddressed.</p>\n<p>From my exploration of these matters, I’ve come to see that generally, when one reads about data on discrimination, differences between groups, etc. one finds that (a) discrimination exists and can be quite powerful; (b) there are differences between genders, but the differences are subtle and go in varied directions (e.g. men are more combative, and women are more collaborative, as Kelly notes); and (c ) these differences are <em>not</em> the reason for the vast majority of gaps that we see.</p>\n<p>I think that because discussion about differences between genders is often consigned to the more diversity-hostile corners of the internet, though, ideas that would be proven wrong by the data go unchallenged. Again, I think if we were to have the right sort of conversation on these issues, we would find that discrimination is indeed the primary cause of the gender gap in EA, but without that conversation, people will not be convinced. (And if an honest conversation engaged with data and personal experiences came to the conclusion that this was not the case, that would probably be good information to have.)</p>\n<p>For instance, I read the Damore memo, but then saw <a href=\"https://cdn-images-1.medium.com/max/1600/0*H5PrnnEAD7GteRHf.\">this graph</a> which seems to be pretty good evidence that the vast majority of the gap in tech is not from biological differences (and so likely some iteration of discrimination, implicit or explicit). I don’t remember where I came across this graph, but it was very helpful to me. Without looking at the whole picture, though, one can look solely at the individual components of the picture (e.g. Damore’s arguments on specific gender differences) and come to conclusions that would be put in doubt with fuller information.</p>\n<p>As an additional reason why I think EA is a movement that could have the right conversation on this, I think that EAs recognize a moral principle similar to equality of interests, where differences in personal traits do not lead to moral differences. It seems that in many diversity and inclusion conversations, both the right and the left consider personal trait differences to imply moral differences, and I think EAs can challenge and move beyond that assumption–though with care and only after we start improving on our demographics.</p>\n<p>This is a very challenging issue because, as noted in a comment below, racism and sexism have long been motivated by biological essentialism, and it’s extremely disturbing to have people talk about a group you are a part of in this way. (As a Jew, I can say that I feel discomfort with the conversation about Jewish values below, for instance, though I don’t have a strong opinion on its propriety.) I think that the way to deal with this problem is to exercise caution when speaking about these sorts of things, to avoid casual discussion of them, and to have a higher evidence standard for when we talk about these things. I think that our community can learn the appropriate maturity to do that, though.</p>\n<p>Anyway, all this is to say that I hope that as this conversation goes on, we can bring data to bear and recognize the implications of the way we speak for others in this community. Words and ideas do cause harm, and we should be utilitarians about the way we speak. With appropriate caution, though, I think that EAs can have a conversation that gets to the heart of the matter and offers a model for how these conversations can be had.</p>\n<p>————————————</p>\n<p>For those looking for examples of places where these discussions could be valuable, I have a few:</p>\n<ul>\n<li><p>Gender and cosmopolitan values–<a href=\"https://www.amazon.com/Better-Angels-Our-Nature-Violence/dp/0143122010\">The Better Angels of Our Nature</a> cites feminism as one of the reasons for declines in all sorts of violence (war, sexual violence, torture), and I’ve seen enough data to match my intuition that feminism is also very good for animals. I think there are lots of things to explore empirically in this domain (that likely would have implications for the A vs. E debate), but they probably involve engaging with uncomfortable questions about where these gender differences arise.</p>\n</li>\n<li><p>On another note, animal advocates will often assert that if we focus on multiple causes, we will solve our diversity and inclusion problem. I think this is a very important claim to test, because focusing on multiple causes may be quite costly. I’m fully supportive of focusing on creating justice within our movements and groups, e.g. by aggressively fighting sexual assault and getting rid of income barriers, but I think the claim about movements’ outward focus is a debatable one that really needs to be empirically explored.</p>\n</li>\n<li><p>Similarly to the above note, animal advocates often work on issues to promote diversity and inclusion including things like fighting urban food deserts without looking into the evidence around them. This could not only hinder direct impacts but also create the impression that advocates’ diversity and inclusion efforts are an afterthought without the same rigor applied to it that advocates apply to work for animals.</p>\n</li>\n</ul>\n", "parentCommentId": null, "user": {"username": "zdgroff"}}, {"_id": "EkESq8QtRGCHfbq8n", "postedAt": "2017-10-27T18:44:18.083Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<blockquote>\n<p>The problem is that those thoughts... become actions... we can usually only see as systematic trends. Just because someone does not say &quot;women are incompetent&quot; does not mean they aren't underestimating women's competence and e.g. hiring them less than he should.</p>\n</blockquote>\n<p>The flip side of it being hard to discern whether people have <em>bad thoughts</em> and act biasedly except by drawing inferences from broader patterns is that it's also hard to discern whether people <em>actually do</em> have bad thoughts and acted biasedly from those broader patterns. (c.f. the many fields where women dominate men in terms of prevalence and performance, as well as EAs many other demographic biases which don't receive the same treatment e.g. a 14:1 left-right bias, and a 4:1 20-35:any age over 35 bias).</p>\n", "parentCommentId": "sBskYXzcpJYkrrdzC", "user": {"username": "David_Moss"}}, {"_id": "5LkLL3PLDNJ2YkpoE", "postedAt": "2017-10-27T18:45:21.491Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>Whether a discussion proceeds as collaborative or combative depends on how the participants interpret what the other parties say. This is all heavily contextual, but as with many things involving conversational implicature, you can often spend some effort to clarify your implicature.</p>\n<p>The internet is <em>notoriously</em> bad for conveying the unconscious signals that we usually use to pick up on implicature, and I think this is one of the reasons that internet discussions often turn hostile and combative.</p>\n<p>So it's worth putting in more signals of your intent into the text itself, since that's all you have.</p>\n", "parentCommentId": "Lfk4iCgvER5JbCZbi", "user": {"username": "Michael_PJ"}}, {"_id": "LhWh4bswotXCSySXm", "postedAt": "2017-10-27T19:44:03.083Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<blockquote>\n<p>Yes, there are a few EA leftists whose main priority is to systemically reform capitalism, but not significantly more than there were in the first place, and they are a tiny group in comparison to the liberals, the conservatives, the vegans, the x-risk people, and so on. As far as I can tell, the impact of all these articles and comments in bringing leftists into active participation with EA was totally nonexistent.</p>\n</blockquote>\n<p>I'm not sure I count or not. My work on autonomy can be seen as investigating systemic change. I've been to a couple of meetups and hung around this forum a bit and I can tell you why the community is not very enticing or inviting from my point of view, if you are interested.</p>\n<p>Edit to add: </p>\n<p>I can only talk about EA London which I went to a couple of the meetups. To preface things I had generally good interactions with people they were nice and we chatted a bit about non-systemic EA interests (which I am also interested in). There was lots of conversation and not too much holding-forth.</p>\n<p>I was mainly trying to find people interested in discussing AI/future things as any systemic change has to take this into consideration and there is lots of uncertainty. I was asked what I was interested in by organisers and asked if anyone knew people primarily interested in AI, and I didn't get any useful responses.  At the time I didn't know enough about EA to ask about systemic change (and wasn't as clear on what I exactly wanted). </p>\n<p>This slightly rambling point is to illustrate that it is hard to connect with people on niche topics (which AI seems to be in London). There probably needs to be a critical mass of people joining at once for a locality to support a topic. </p>\n<p>I've joined a London EA facebook group focused on the future so I have my hopes.</p>\n<p>That is pretty benign, a problem but not a large one.  More could be done, but more could always be done.</p>\n<p>The second, which I think might be more exclusionary, is EAG. I applied for tickets and to volunteer but I've heard nothing so far. I'm unsure why there is even selection on tickets.</p>\n<p>I suspect I don't look like lots of EAs on an application form: I don't earn to give, but have taken a pay cut to work part time on my project, which I hope will help everyone in the long run. I may not have quite the same chipper enthusiasm. </p>\n<p>I suspect other people interested in systemic change will look similarly different from lots of EAs, and the curation of EAG might be biased against them. If it is, then I probably have not lost out much by not going!</p>\n<p>I mainly wrote this comment to try and give some possible reasons for the lack of a significant group interested in systemic change (despite articles/comments to the contrary). I'm not expecting EA to change, you can't be a group for everyone and you do interesting and good things. But it is good to know some of the potential  reasons why things are how they are.</p>\n<p>Edit2: I got a polite email from Julia Wise telling me that the reason I didn't get an invite was because London was a smaller event and that people were selected on the basis of &quot;those who will benefit most from attending EA Global London.&quot; It would be nicer if these things were a little more transparent, e.g. you are applicant #X we can only accept #Y applicants, to give you a better idea of the chances. From my own perspective for the people that are interested in current niche EA topics it is important to be able to potentially meet other people  from around the world interested in their topics. EAG might not be the place for that though. </p>\n", "parentCommentId": "MjuDpFkL9h8Xr4Doe", "user": {"username": "WillPearson"}}, {"_id": "e7cTCs6EpXTaEYkP3", "postedAt": "2017-10-27T19:50:04.422Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>&quot;fighting urban food deserts without looking into the.&quot;\nI think there's a word or phrase missing.</p>\n", "parentCommentId": "7fGfEYgkG3BFGbfpb", "user": {"username": "Khorton"}}, {"_id": "d48K7yuWGYJfbHNcx", "postedAt": "2017-10-27T19:53:44.431Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>Since I've not seen it mentioned here, <a href=\"https://pbs.twimg.com/media/DMqPDl5X0AAdjJs.jpg\">unconferences</a> seem like a inclusive type of event as described above. I'm not sure how EAG compare.</p>\n", "parentCommentId": null, "user": {"username": "WillPearson"}}, {"_id": "fsB4Yb6yWd45NPkY7", "postedAt": "2017-10-27T20:02:44.557Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>Just in reply to the graph section - this post made me think about possible reasons for the discrepancy between computer science and law/medicine.</p>\n<p><a href=\"http://slatestarcodex.com/2017/08/07/contra-grant-on-exaggerated-differences/\">http://slatestarcodex.com/2017/08/07/contra-grant-on-exaggerated-differences/</a></p>\n", "parentCommentId": "7fGfEYgkG3BFGbfpb", "user": {"username": "DavidNash"}}, {"_id": "7gHKwJcG4LkZdkSpQ", "postedAt": "2017-10-27T20:42:56.978Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>To speak to the section about EA orgs hiring a diversity &amp; inclusion officer:</p>\n<p>That's essentially my role at CEA as Community Liaison, with help from other staff. Some of my work is focused on helping CEA work well for lots of kinds of people, both internally as a workplace and externally in our events and projects for the community.</p>\n<p>I also try to be a resource on these topics for other EA orgs, groups, and individuals. I'm very happy to be contacted (<a href=\"mailto:julia.wise@centreforeffectivealtruism.org\">julia.wise@centreforeffectivealtruism.org</a>) about anything in this area where I might be able to give information or advice. Some examples of things we've helped with:</p>\n<ul>\n<li>How to run a &quot;Living on Less&quot; campaign in a way that's respectful of people actually living in poverty</li>\n<li>How to help a group member who has just experienced a mental health crisis</li>\n<li>Designing policies for Facebook groups that balance competing needs/wishes from different group members</li>\n<li>Serving as a contact point for people who have experienced abuse or harassment within the community, either simply to provide support or to also take next steps if the person wishes</li>\n<li>Promoting pro-social norms through measures like the <a href=\"http://effective-altruism.com/ea/181/introducing_ceas_guiding_principles/\">Guiding Principles</a> of EA.</li>\n</ul>\n<p>Edited to add: someone pointed out that I didn't mention confidentiality. I will keep anything you tell me as confidential as you want it to be kept.</p>\n", "parentCommentId": null, "user": {"username": "Julia_Wise"}}, {"_id": "LbbT3X9ZqsuoFXxAJ", "postedAt": "2017-10-27T21:01:47.515Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>An explanation of what you mean by &quot;turn out OK&quot; would be helpful. For instance, do movements that err more towards social justice fare worse than those that err away from it (or than those that sit at the status quo)?</p>\n<p>Whether that's the case for the atheism movement or the open source community is a heavy question that merits more explanation.</p>\n<p>Actually, I would think that any overshooting you see in these communities is a reaction to how status-quo (or worse) both of those communities are. Note for instance that when women are not collaborators on a project (but not when they are), <a href=\"http://www.slate.com/blogs/future_tense/2016/02/17/if_women_are_better_at_coding_it_s_because_they_have_to_be.html\">their open-source contributions</a> are more likely to be accepted than men's when their gender is not known but despite that they're less likely to be accepted than men's when their gender is known.</p>\n", "parentCommentId": "n2YDRRb9yM2xbeJPt", "user": {"username": "Kelly_Witwicki"}}, {"_id": "FWudx7rdeWcPtuvab", "postedAt": "2017-10-27T21:45:21.343Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>Julia,</p>\n<p>I appreciate the work you've done and continue to do on community-building. It seems though that there is a lot more productive work that can done than can be achieved by one part-time role, and that there are angles we're not addressing.</p>\n<p>For instance, we could bring in someone who can advise on all forms of communication from job postings to website UX to social media content and strategy; assist with speaker recruitment and selection and provide feedback for presentations at conferences; and conduct reviews of inclusionary performance in organizations' hiring and management practices, in outreach efforts, and in local communities' practices.</p>\n", "parentCommentId": "7gHKwJcG4LkZdkSpQ", "user": {"username": "Kelly_Witwicki"}}, {"_id": "z4Fzz8mX5GoeutMxe", "postedAt": "2017-10-27T21:46:00.355Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>Kelly, I don't think the study you cite is good or compelling evidence of the conclusion you're stating. See <a href=\"http://slatestarcodex.com/2016/02/12/before-you-get-too-excited-about-that-github-study/\">Scott's comments on it</a> for the reasons why. </p>\n<p>(edited because the original link didn't work)</p>\n", "parentCommentId": "LbbT3X9ZqsuoFXxAJ", "user": {"username": "ClaireZabel"}}, {"_id": "wFJsbuECuJWFmX76k", "postedAt": "2017-10-27T22:07:48.663Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>Thanks, clarified.</p>\n", "parentCommentId": "z4Fzz8mX5GoeutMxe", "user": {"username": "Kelly_Witwicki"}}, {"_id": "aeXDeHmQi3pv295uP", "postedAt": "2017-10-27T22:12:15.730Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>&quot;Kelly did a lot of work in order to point out a real phenomenon, and I don’t see anyone taking her very seriously.&quot; - Kelly put in a lot of work, but there were a lot of issues with the original post. I think this was inevitable to an extent, unless you're already a policy expert producing high quality work really needs a group of people or multiple feedback cycles. I think that it is especially important to maintain high standards of evidence in regards to this issue because the increasing political polarisation means that both sides of the spectrum are dropping their own standards.</p>\n", "parentCommentId": "nSA4JEeEf7rSfqvtp", "user": {"username": "casebash"}}, {"_id": "rDYa6xEi23sqgahAM", "postedAt": "2017-10-27T22:23:54.642Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>The Atheism Plus split was pretty bad. They were a group that wanted <em>all</em> atheists to also be involved in social justice. Naturally many weren't happy with this takeover of the movement and pushed back. The Atheism Plus side argues that this was due to misogyny, ect, ignoring the fact that some people just wanted to be atheists and do atheist stuff and not get involved in politics. The end result was Atheism Plus was widely rejected, many social justice leaning atheists left the movement, Atheism widely defamed, remaining atheists not particularly open to social justice.</p>\n<p>I don't know very much about open source, but I've heard that there's been some pretty vicious/brutal political fights over codes of conduct, ect.</p>\n", "parentCommentId": "LbbT3X9ZqsuoFXxAJ", "user": {"username": "casebash"}}, {"_id": "N7vWGkchzMbnYNxXC", "postedAt": "2017-10-27T23:25:04.492Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>Even after clarification, your sentence is misleading. The true thing you could say is &quot;Among outsiders to projects, women are more likely to have their contributions accepted than men. Both men and women are less likely to have their contributions accepted when their genders are revealed; the effect was measured to be a percentage point different between the genders and may or may not be statistically significant. There are also major differences between the contribution patterns of men and women.&quot;</p>\n<p>As a side note, I find the way you're using social science quite frustrating. You keep claiming that social science supports many of your particular beliefs, and then other people keep digging into the evidence and pointing out the specific reason that the evidence you've presented isn't very convincing. But it takes a lot of time to rebut all of your evidence that way, much more time than it takes for you to link to another bad study.</p>\n", "parentCommentId": "wFJsbuECuJWFmX76k", "user": {"username": "Buck"}}, {"_id": "WT9ZNQ4AKbWTwhHoM", "postedAt": "2017-10-27T23:32:29.180Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<blockquote>\n<p>it's at least some evidence against people's intuitions</p>\n</blockquote>\n<p>I don't think it is, at all, any more than Daryl Bem's research updates me towards thinking ESP is real. Like, who knows, the world is a crazy place, maybe the papers here are in the <a href=\"http://science.sciencemag.org/content/349/6251/aac4716\">36% of published psychology papers which hold up under replication</a>. But I don't think that it makes sense to update against your beliefs about this stuff based on the published science--if you think that the scientists would have published these papers regardless of their truth, as I do, you shouldn't regard them as evidence.</p>\n", "parentCommentId": "kezQBhqKmKcPXGNd2", "user": {"username": "Buck"}}, {"_id": "KjZzmm7AfdnChivDr", "postedAt": "2017-10-27T23:35:22.564Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>Just for the record, I think this is a bad idea: I think it's costly for the community when people make bad arguments, and I think that the community is pretty good at recognizing and downvoting bad arguments where they appear, and I don't think it too often downvotes stuff it shouldn't.</p>\n", "parentCommentId": "8biG8rrqcReEuCd8t", "user": {"username": "Buck"}}, {"_id": "P2RxAC382Lu6ekt2J", "postedAt": "2017-10-27T23:37:58.649Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>This is a similar issue that's going on in another thread where people feel you're cherrypicking results rather than sampling randomly in a way that will paint an accurate picture. Perhaps this dialogue can help to explain the concerns that others have expressed:</p>\n<p>Person One: Here are 5 studies showing that coffee causes cancer, which suggests we should limit our coffee consumption.</p>\n<p>Person Two: Actually if you do a comprehensive survey of the literature, you'll fine 3 studies showing that coffee causes cancer, 17 showing no effect, and 3 showing the coffee prevents cancer. On balance there's no stronger evidence that coffee causes cancer than that it prevents it, and in fact it probably has no effect.</p>\n<p>Person One: Thanks for the correction! [Edits post to say: &quot;Here are <em>3</em> studies showing that coffee causes cancer, which suggests we should limit our coffee consumption.&quot;]</p>\n<p>Person Two: I mean... that's technically true, but I don't feel the problem is solved.</p>\n", "parentCommentId": "N7vWGkchzMbnYNxXC", "user": {"username": "Buck"}}, {"_id": "hBZEEFCo6kRLsDzov", "postedAt": "2017-10-27T23:53:55.159Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>I read the Forbes article which links to a empty page on 'talentlens.co.uk'. It becomes clear the the Forbes article is only referring to results on a test called the 'Cognitive Style Index.' If you read the Talent Lens 'Technical Manual and User Guide' for the Cognitive Style Index, you can find the same reference to there being 32 studies, 13 of which found women to be more analytic than men, and 8 which found women to have lower scores than men (I assume these results were not statistically significant and so weren't counted). </p>\n<p>The CSI seems to be used almost exclusively in a business and management/marketing context (which it what it was originally designed for) hence, of the 32 studies reported, almost all are on business students or managers. In Psychology, we tend to use the Rational-Experiential Inventory <a href=\"http://www.sjdm.org/dmidi/Rational-Experiential_Inventory_-_revised_40_item.html\">http://www.sjdm.org/dmidi/Rational-Experiential_Inventory_-_revised_40_item.html</a> which tends to find results in the <a href=\"https://books.google.co.uk/books?hl=en&amp;lr=&amp;id=QAYIra8zB34C&amp;oi=fnd&amp;pg=PA97&amp;dq=rational+experiential+inventory+gender+differences&amp;ots=uWOZ4ApYFo&amp;sig=e8PjIpGHde3qfDcF0-NqbqDpId8#v=onepage&amp;q=rational%20experiential%20inventory%20gender%20differences&amp;f=false\">opposite direction</a> though inconsistently, and the Cognitive Reflection Test finds even <a href=\"https://mpra.ub.uni-muenchen.de/68049/\">larger differences</a> (unlike the others is not based on self-report). Personally I don't put much stock in any of these results, but I don't think that saying that women tending to be more intuitive and men more analytical/deliberative&quot; does not seem to be borne out and in fact the opposite may be more likely&quot; is an appropriate summary of the evidence.</p>\n", "parentCommentId": "T392qW8NgjZWov33x", "user": {"username": "David_Moss"}}, {"_id": "AnvhPagCdMPbaFarE", "postedAt": "2017-10-28T00:03:40.911Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<blockquote>\n<p>I think we should stop having downvotes on the EA Forum</p>\n</blockquote>\n<p>I agree with this. Contra Buck, I think people use downvotes to express things they ultimately disagree with, rather that because they genuinely find someone's comments 'unhelpful', i.e. malicious, lazy, something like that. I might also prompt people to say what they didn't like with the other person's vote, rather than just voting anonymously (and snarkily) with karma points.</p>\n", "parentCommentId": "KjZzmm7AfdnChivDr", "user": {"username": "MichaelPlant"}}, {"_id": "ydWCMGKz29skswLcS", "postedAt": "2017-10-28T00:06:41.881Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<blockquote>\n<p>I might also prompt people to say what they didn't like with the other person's vote, rather than just voting anonymously (and snarkily) with karma points.</p>\n</blockquote>\n<p>The problem is that this takes a lot of time, and people with good judgement are more likely to have a high opportunity cost of time; you want to make it as cheap as possible for people with good judgement to discourage bad comments; I think that the current downvoting system is working pretty well for that purpose. (One suggestion that's better than yours is to only allow a subset of people (perhaps those with over 500 karma) to downvote; Hacker News for example does this.)</p>\n", "parentCommentId": "AnvhPagCdMPbaFarE", "user": {"username": "Buck"}}, {"_id": "cGTSAj3q4s496cjdJ", "postedAt": "2017-10-28T00:16:57.716Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<blockquote>\n<p>As a side note, I find the way you're using social science quite frustrating. You keep claiming that social science supports many of your particular beliefs, and then other people keep digging into the evidence and pointing out the specific reason that the evidence you've presented isn't very convincing. But it takes a lot of time to rebut all of your evidence that way, much more time than it takes for you to link to another bad study.</p>\n</blockquote>\n<p>To be charitable to Kelly, in most parts of the internet, a link to popular reporting on social science research is a high quality argument.  I can understand how it might be frustrating for people to tell you you need to up your paper scrutinizing game while you are busy trying to respond to an entire thread full of people expressing disagreement.</p>\n", "parentCommentId": "N7vWGkchzMbnYNxXC", "user": {"username": "xccf"}}, {"_id": "7FBybnnZ2pztAHjWk", "postedAt": "2017-10-28T00:25:32.425Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<blockquote>\n<p>An explanation of what you mean by &quot;turn out OK&quot; would be helpful. For instance, do movements that err more towards social justice fare worse than those that err away from it (or than those that sit at the status quo)?</p>\n</blockquote>\n<p>I'm referring to mob mentality, trigger-happy ostracization, and schisms.  I don't think erring towards/away from social justice is quite the right question, because in these failure cases, the distribution of support for social justice becomes a lot more bimodal.</p>\n<blockquote>\n<p>Actually, I would think that any overshooting you see in these communities is a reaction to how status-quo (or worse) both of those communities are.</p>\n</blockquote>\n<p>Sounds plausible.  That's a big reason why I support thoughtful work on diversity: as a way to remove the motivation for less thoughtful work.</p>\n", "parentCommentId": "LbbT3X9ZqsuoFXxAJ", "user": {"username": "xccf"}}, {"_id": "pYmXBc66p4u9WMXNb", "postedAt": "2017-10-28T00:35:03.986Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>I am disinclined to be sympathetic when someone's problem is that they posted so many bad arguments all at once that they're finding it hard to respond to all the objections.</p>\n", "parentCommentId": "cGTSAj3q4s496cjdJ", "user": {"username": "Buck"}}, {"_id": "rzxJMZFRKPy9wPJ6A", "postedAt": "2017-10-28T00:47:00.463Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<blockquote>\n<p>To be charitable to Kelly, in most parts of the internet, a link to popular reporting on social science research is a high quality argument. </p>\n</blockquote>\n<p>I dearly hope we never become one of those parts of the internet. </p>\n<p>And think we should fight against every slip down that terrible incentive gradient, for example by pointing out that the bottom of that gradient is a really terribly unproductive place, and by pushing back against steps down that doomy path. </p>\n", "parentCommentId": "cGTSAj3q4s496cjdJ", "user": {"username": "ClaireZabel"}}, {"_id": "A9SfjB7WrNYwgAyws", "postedAt": "2017-10-28T00:51:26.457Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>I think you're overstating your case.</p>\n<blockquote>\n<p>I don't think it is, at all, any more than Daryl Bem's research updates me towards thinking ESP is real.</p>\n</blockquote>\n<p>This strikes me as a misunderstanding of how Bayesian updates work.  The reason you still don't believe in ESP is because your prior for ESP is very low.  But I think hearing about Bem's research should still cause you to update your estimate in favor of ESP a tiny amount.  In a world with ESP, Bem finds it easier to discover ESP effects.</p>\n<blockquote>\n<p>if you think that the scientists would have published these papers regardless of their truth</p>\n</blockquote>\n<p>I don't think social psychologists are <em>that</em> dishonest.  Even 36% replicability suggests <em>some</em> relationship between paper-publishing and truth.</p>\n<p>Furthermore, I think the fact that social psychologists are so liberal should cause some update in the direction that studying humans causes you to realize liberal views about human nature are correct.</p>\n", "parentCommentId": "WT9ZNQ4AKbWTwhHoM", "user": {"username": "xccf"}}, {"_id": "tnFGypN46ueiefp4k", "postedAt": "2017-10-28T00:51:31.615Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<blockquote>\n<p>I'm not sure why you brought up the downvoting in your reply to my reply to your comment</p>\n</blockquote>\n<p>Sorry. That was a user error. </p>\n", "parentCommentId": "rnByfQREwrinMPnKx", "user": {"username": "MichaelPlant"}}, {"_id": "fz2QHeSfhLTfchnMw", "postedAt": "2017-10-28T00:54:40.078Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>So many different boxes to reply to! I'll do one reply for everything here.</p>\n<p>My main reflection is that either 1. I really haven't personally had much discussion of inclusivity in my time in the EA movement (and this may just be an outlier/coincidence) or 2. I'm just much more receptive to this sort of chat than the average EA. I live among Oxford students and this probably gives me a different reference point (e.g. people do sometimes introduce themselves with their pronouns here). I forget how disconcertingly social justice-y I found the University when I first moved here.</p>\n<p>Either way, the effect is I really haven't <em>felt</em> like I've had too many discussion in EA about diversity. It's not like it's my favourite topic or anything. </p>\n", "parentCommentId": "yf3p8epmpZHRK6BZZ", "user": {"username": "MichaelPlant"}}, {"_id": "CCn7NEeAjoE5DspDe", "postedAt": "2017-10-28T01:16:45.591Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<blockquote>\n<p>This strikes me as a misunderstanding of how Bayesian updates work. The reason you still don't believe in ESP is because your prior for ESP is very low. But I think hearing about Bem's research should still cause you to update your estimate in favor of ESP a tiny amount. In a world with ESP, Bem finds it easier to discover ESP effects.</p>\n</blockquote>\n<p>I think you slightly misunderstand me. What I'm saying is that Bem's work isn't really a Bayesian update for me, because I think Bem is approximately as likely to publish papers in the world where (extremely weak) ESP works as the worlds where it doesn't. The strength of my prior doesn't feel relevant to me.</p>\n<p>I think you're right that I slightly overstated my case.</p>\n", "parentCommentId": "A9SfjB7WrNYwgAyws", "user": {"username": "Buck"}}, {"_id": "qPxkCBHiMkCNJR8sH", "postedAt": "2017-10-28T01:36:51.054Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>Easy money: <a href=\"https://userstyles.org/styles/150270/effective-altruism-form-anti-kibitzer\">https://userstyles.org/styles/150270/effective-altruism-form-anti-kibitzer</a></p>\n<p>I'd tell you to keep it or donate it, but I want to encourage the norm that such offers represent a real cost, so I hereby commit to use this money entirely on hedonistic pleasures.</p>\n", "parentCommentId": "35Tpqy4dsu6WyMfiN", "user": {"username": "Michael_PJ"}}, {"_id": "ifk4a5S8Xcb9Fx59T", "postedAt": "2017-10-28T01:41:12.991Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<blockquote>\n<p>I dearly hope we never become one of those parts of the internet.</p>\n</blockquote>\n<p>Me too.  However, I'm not entirely clear what incentive gradient you are referring to.</p>\n<p>But I do see an incentive gradient which goes like this: Most people responding to threads like this do so in their spare time and run on intrinsic motivation.  For whatever reason, on average they find it more intrinsically motivating to look for holes in social psych research if it supports a liberal conclusion.  There's a small population motivated the opposite way, but since people find it less intrinsically motivating to hang out in groups where their viewpoint is a minority, those people gradually drift off.  The end result is a forum where papers that point to liberal conclusions get torn apart, and papers that point the other way get a pass.</p>\n<p>As far as I can tell, essentially all online discussions of politicized topics fall prey to a failure mode akin to this, so it's very much something to be aware of.</p>\n<p>Full disclosure: I'm not much of a paper scrutinizer.  And the way I've been behaving in this thread is the same way Kelly has been.  For example, I linked to Bryan Caplan's <a href=\"http://econlog.econlib.org/archives/2015/01/diversity_of_th.html\">blog post</a> covering a paper on ideological imbalance in social psychology.  The original paper is <a href=\"http://journals.cambridge.org/images/fileUpload/documents/Duarte-Haidt_BBS-D-14-00108_preprint.pdf\">53 pages long</a>.  Did I read over the entire thing, carefully checking for flaws in the methodology?  No, I didn't.</p>\n<p>I'm not even sure it would be useful for me to do that--the best scrutinizer is someone who feels motivated to disprove a paper's conclusion, and this ideological imbalance paper very much flatters my preconceptions.  But the point is that Kelly got called out and I didn't.</p>\n<p>I don't know what a <em>good</em> solution to this problem looks like.  (Maybe LW 2.0 will find one.)  But an <em>obvious</em> solution is to extend special charity to anyone who's an ideological minority, to try &amp; forestall <a href=\"http://lesswrong.com/lw/lr/evaporative_cooling_of_group_beliefs/\">evaporative cooling</a> effects.  [Also could be a good way to fight ingroup biases etc.]</p>\n<p>As a side note, I suspect we should re-allocate resources away from social psychology as a resolution for SJ debates, on the margin.  It provides great opportunities for IQ signaling, but the flip side is the investment necessary to develop a well-justified opinion is high--I don't think social psych will end up solving the problem for the masses.  I would like to see people brainstorm in a larger space of possible solutions.</p>\n", "parentCommentId": "rzxJMZFRKPy9wPJ6A", "user": {"username": "xccf"}}, {"_id": "LDGW3QJRxy7WgQNwh", "postedAt": "2017-10-28T01:58:36.398Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<blockquote>\n<p>[Edit: I appreciate that I should generally behave as though my community will behave well, and as such I should not have requested that people upvote if they find the post helpful. I want to be sure to flag in this response though the incredibly poor way in which people who disagree with claims and arguments in favor of diversity and inclusion are using their votes, in comments and on the whole post.]</p>\n</blockquote>\n<p>Thanks.</p>\n<p>I'm also finding the voting in this thread frustrating.</p>\n<blockquote>\n<p>I appreciate your suggestions a lot, but caution you to be careful of your own assumptions. For instance, I never suggested that a Diversity &amp; Inclusion Officer should be the person most passionate about the role instead of most smart about it.</p>\n</blockquote>\n<p>Sorry about that.</p>\n<blockquote>\n<p>To emphasize though, so it doesn't get lost behind those critical thoughts: I thoroughly appreciate the suggestions you've contributed here.</p>\n</blockquote>\n<p>Glad to hear it :)</p>\n<blockquote>\n<p>[Edit: Apologies for some excessive editing. I readily acknowledge that in an already a hostile environment, my initial reaction to criticism regarding an important issue that is causing a lot of harm is too defensive.]</p>\n</blockquote>\n<p>I'm an excessive editor too, I'm not sure it's something you need to apologize for :)</p>\n", "parentCommentId": "kezQBhqKmKcPXGNd2", "user": {"username": "xccf"}}, {"_id": "9WG3XjAMAe7aFH33K", "postedAt": "2017-10-28T02:03:33.609Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>Regarding the terrible incentive gradients mentioned by Claire above, I think discussion is more irenic if people resist, insofar as possible, to impute bad epistemic practices to certain people, and even to try and avoid identifying the individual with the view or practice you take to be mistaken, even though they in fact advocate it. </p>\n<p>As a concrete example (far from alone, and selected not because it is 'particularly bad', but rather because it comes from a particularly virtuous discussant) the passage up-thread seems to include object level claims on the epistemic merits of a certain practice, but also implies an adverse judgement about the epistemic virtue of the person it is replying to:</p>\n<blockquote>\n<p>As a side note, I find the way <em>you're using social science quite frustrating</em>. <em>You keep claiming</em> that social science supports many of your particular beliefs, and then other people keep digging into the evidence and pointing out the specific reason that the evidence you've presented isn't very convincing. But it takes a lot of time to rebut all of your evidence that way, much more time than it takes for <em>you to link to another bad study.</em> [my emphasis]</p>\n</blockquote>\n<p>The 'you-locutions' do the work of imputing, and so invite subsequent discussion about the epistemic virtue of the person being replied to (e.g. &quot;Give them a break, this mistake is understandable given some other factors&quot;/ &quot;No, this is a black mark against them as a thinker, and the other factors are not adequate excuse&quot;).</p>\n<p>Although working out the epistemic virtue of others can be a topic with important practical applications (but see discussion by Askell and others above about 'buzz talk'), the midst of a generally acrimonious discussion on a contentious topic is not the best venue. I think a better approach is a rewording that avoids the additional implications:</p>\n<blockquote>\n<p>I think there's a pattern of using social science data which is better avoided. Suppose one initially takes a set of studies to support P. Others suggest studies X, Y and Z (members of this set) do not support P after all. If one agrees with this, it seems better to clearly report a correction along the lines of &quot;I took these 5 studies to support P, but I now understand 3 of these 5 do not support P&quot;, rather than offering additions to the set of studies that support P. </p>\n</blockquote>\n<blockquote>\n<p>The former allows us to forecast how persuasive additional studies are (i.e. if all of the studies initially taken to support P do not in fact support P on further investigation, we may expect similar investigation to reveal the same about the new studies offered). Rhetorically, it may be more persuasive to sceptics of P, as it may allay worries that sympathy to P is tilting the scales in favour of reporting studies that prima facie support P.</p>\n</blockquote>\n<p>The rewording can take longer (but I am not rewording myself, rather a better writer), but even if so I expect other benefits will outweigh it.</p>\n", "parentCommentId": "pYmXBc66p4u9WMXNb", "user": {"username": "Gregory_Lewis"}}, {"_id": "GAjNF2KsghRTQzvj3", "postedAt": "2017-10-28T02:19:14.078Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>The incentive gradient I was referring to goes from trying to actually figure out the truth to using arguments as weapons to win against opponents. You can totally use proxies for the truth if you have to(like an article being written by someone you've audited in the past, or someone who's made sound predictions in the past). You can totally decide not to engage with an issue because it's not worth the time. </p>\n<p>But if you just shrug your shoulders and cite average social science reporting on a forum you care about, you are not justified in expecting good outcomes. This is the intellectual equivalent of catching the flu and then purposefully vomiting into the town water supply. People that do this are acting in a harmful manner, and they should be asked to cease and desist. </p>\n<blockquote>\n<p>the best scrutinizer is someone who feels motivated to disprove a paper's conclusion</p>\n</blockquote>\n<p>The best scrutinizer is someone that feels motivated to actually find the truth. This should be obvious.</p>\n<blockquote>\n<p>For whatever reason, on average they find it more intrinsically motivating to look for holes in social psych research if it supports a liberal conclusion. </p>\n</blockquote>\n<p>Yet EAs are mostly liberal. The <a href=\"http://effective-altruism.com/ea/1ex/demographics_ii/\">2017 Survey</a> had 309 EAs identifying as Left, 373 as Centre-Left, 4 identifying as Right, 31 as Centre Right. My contention is that this is not about the conclusions being liberal. It's about specific studies and analyses of studies being terrible. E.g. (and I hate that I have to say this) I lean very socially liberal on most issues. Yet I claim that the article Kelly cited is not good support for anyone's beliefs. Because it is terrible, and does not track the truth. And we don't need writings like that, regardless of whose conclusions they happen to support.</p>\n", "parentCommentId": "ifk4a5S8Xcb9Fx59T", "user": {"username": "ClaireZabel"}}, {"_id": "MGLMqe5ZpFe3v9wfo", "postedAt": "2017-10-28T02:32:31.698Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>[random] I find the survey numbers interesting, insofar as they suggest that EA is more left-leaning than almost any profession or discipline. </p>\n<p>(see e.g. <a href=\"https://www.washingtonpost.com/news/wonk/wp/2015/06/03/why-your-flight-attendant-is-probably-a-democrat/?utm_term=.bc0c8931c716\">this</a> and <a href=\"https://heterodoxacademy.org/2016/01/09/professors-moved-left-but-country-did-not/\">this</a>). </p>\n", "parentCommentId": "GAjNF2KsghRTQzvj3", "user": {"username": "ClaireZabel"}}, {"_id": "EmLG8MhiS3X64PdJx", "postedAt": "2017-10-28T02:49:53.666Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<blockquote>\n<p>The best scrutinizer is someone that feels motivated to actually find the truth. This should be obvious.</p>\n</blockquote>\n<p>How does &quot;this should be obvious&quot; compare to average social science reporting on the epistemic hygiene scale?</p>\n<p>Like, this is an empirical claim we could test: give people social psych papers that have known flaws, and see whether curiosity or disagreement with the paper's conclusion predicts flaw discovery better.  I don't think the result of such an experiment is obvious.</p>\n", "parentCommentId": "GAjNF2KsghRTQzvj3", "user": {"username": "xccf"}}, {"_id": "HcFtfohpRjQ44uXtk", "postedAt": "2017-10-28T04:17:22.963Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>Flaws aren't the only things I want to discover when I scrutinize a paper. I also want to discover truths, if they exist, among other things </p>\n", "parentCommentId": "EmLG8MhiS3X64PdJx", "user": {"username": "ClaireZabel"}}, {"_id": "8NAeTcvFaMo2o4vrK", "postedAt": "2017-10-28T04:38:14.704Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>Another idea I had: add questions to the EA Survey to understand how people feel about the issues you are describing.  This accomplishes a few things:</p>\n<ul>\n<li><p>It allows us to track progress more effectively than observing our demographic breakdown.  Measuring how people feel about EA movement culture gives us a shorter feedback loop, since changes in demographics lag behind culture changes.  Furthermore, by attempting to measure the climate issue directly, we can zero in on factors under our control.</p>\n</li>\n<li><p>It helps fight selection effects that occur in online discussion of these issues.  People on both sides can be reluctant to share their thoughts &amp; ideas in a thread like this one.  Online discussions in general can be wildly unrepresentative.  I was surprised to learn about polls which found that most Native Americans <a href=\"https://www.washingtonpost.com/local/new-poll-finds-9-in-10-native-americans-arent-offended-by-redskins-name/2016/05/18/3ea11cfa-161a-11e6-924d-838753295f9a_story.html\">aren't offended</a> by the use of &quot;Redskins&quot; as a team name (<a href=\"https://www.thenation.com/article/on-the-shameful-and-skewed-redskins-poll/\">criticism of this poll</a>), and that a <a href=\"http://news.gallup.com/poll/193508/oppose-colleges-considering-race-admissions.aspx\">majority of black people</a> are against affirmative action.  And among the &quot;anti-SJW&quot; crowd, there's a perception that some folks are going to see racism/sexism in everything, and they will never be satisfied.  So taking a representative poll of EAs, and perhaps comparing the results to some baseline, can help us come to agreement on the degree to which we have issues.</p>\n</li>\n</ul>\n", "parentCommentId": "kezQBhqKmKcPXGNd2", "user": {"username": "xccf"}}, {"_id": "Ryvjp2sSPT49zhCxE", "postedAt": "2017-10-28T06:14:45.906Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>xccf, I'd be interested to hear an examples of comments which you think were excessively downvoted.</p>\n", "parentCommentId": "LDGW3QJRxy7WgQNwh", "user": {"username": "Buck"}}, {"_id": "AYpAhsMQ2MR4zxCZX", "postedAt": "2017-10-28T08:34:22.314Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>I actually tend to observe the other effect in most intellectual spaces. Any liberal supporting result will get a free pass and be repeated over and over again, while any conservative leaning claim will be torn to shreds. Of course, you'll see the opposite if you hang around the 50% of people who voted Trump, but not many of them are in the EA community.</p>\n", "parentCommentId": "ifk4a5S8Xcb9Fx59T", "user": {"username": "casebash"}}, {"_id": "DMR85WyhjrAkAJnz8", "postedAt": "2017-10-28T09:58:46.425Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>Please let's not give people any more incentives to game the karma system than they already have.</p>\n", "parentCommentId": "ydWCMGKz29skswLcS", "user": {"username": "Arepo"}}, {"_id": "RhjkKndY5sBeMMzCx", "postedAt": "2017-10-28T14:11:28.124Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>Yeah, I don't think downvotes are usually the best way of addressing bad arguments in the sense that someone is making a logical error, mistaken about an assumption, missing some evidence, etc. Like in this thread, I think that's leading to dogpiling, groupthink, and hostility in a way that outweighs the benefit of downvoting from flagging bad arguments when thoughtful people don't have time to flag them via a thoughtful comment.</p>\n<p>I think downvotes are mostly just good for bad comments in the sense that someone is purposefully lying, relying on personal attacks instead of evidence, or otherwise not abiding by basic norms of civil discourse. In these cases, I don't think the downvoting comes off as nearly as hostile.</p>\n<p>If you agree with that, then we must just disagree on whether examples (like my downvoted comment above) are bad arguments or bad comments. I think the community does pretty often downvote stuff it shouldn't.</p>\n", "parentCommentId": "KjZzmm7AfdnChivDr", "user": {"username": "Jacy"}}, {"_id": "g4ZiNAEswjFiQ6L3q", "postedAt": "2017-10-28T14:18:19.970Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>Yeah, I'm totally onboard with all of that, including the uncertainty.</p>\n<p>My view on downvoting is less that we need to remove it, and more that the status quo is <em>terrible</em> and we should be trying really hard to fix it.</p>\n", "parentCommentId": "RXusjQkbDPvRcacF2", "user": {"username": "Jacy"}}, {"_id": "6mrpx4x7hxNPjButj", "postedAt": "2017-10-28T14:24:05.955Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>Opinions mine, not my employer’s.</p>\n<p>Very important article Kelly, thanks for writing!  I don’t agree with 100% of your diagnoses or prescriptions (honestly I rolled my eyes at some of them), but absolutely share your concern that a lack of gender and racial diversity is hurting EA.  I’d also add age diversity to the mix, and in my experience (which I doubt is unique) this issue interacts with the gender and racial issues in a problematic way.</p>\n<p>Back in my 20s, I would have brushed off and rationalized away your diversity concerns.  At that time, I was the type of person over-represented in EA: young, male, studied econ at an elite school, working as a hedge fund quant in an explicitly hyper-rational and confrontational work environment, maximum “thinker” assessment on the Myers-Briggs thinker vs. feeler spectrum, etc.  Many (probably “most”, or even “almost all”) of my friends and co-workers fit the same description.  And I placed a very high value on my opinion, and the opinions of people like me.</p>\n<p>Now I’m pushing 40, and I’m still a quanty, thinker vs. feeler guy with a blunt communication style.  But I’ve acquired a valuable perspective on just how stupid really smart 20 somethings can be.  When you work at a place that hires lots of people that fit the same profile year after year, certain patterns become obvious.  You see the first year analyst class making the same mistakes each year, and realize they’re the same mistakes you and your cohorts made when you were first year analysts.  You see that some people, with impeccable backgrounds/resumes, simply aren’t very good at their jobs for a variety of reasons.  It turns out that even really really smart people mess up in very systematic ways.  For instance, the type of people overrepresented at EA (myself included) generally aren’t that great at being humble (probably because of all the good grades and accomplishments).  They also undervalue people skills- until I was lucky enough to meet an enormously talented salesperson and watch him build and nurture relationships that were critical to landing many multibillion dollar accounts, I thought the marketers were just people who couldn’t hack the math to do real finance work.  I’m sure I still carry this bias to some degree.</p>\n<p>When I was younger, I would have fallen in the “sure EA is homogeneous, but can you prove that’s a problem?” camp.  With another ~15 years of perspective, I think that gets the burden of proof backwards.  We’ve already experienced some of the negatives- remember when an EA journalist went to EA Global and felt a big part of the <a href=\"https://www.vox.com/2015/8/10/9124145/effective-altruism-global-ai\">story</a> was EA naiveté?  We know the EA community and its leadership disproportionately represent populations who systematically lack humility (the “best and brightest”), experience (the young), and access to alternative perspectives (the women, people of color, people who remember the 70s, etc. who are mission aligned but think EA is too much work to interact with).  That’s a lot of red flags (and FWIW most of my background is in risk management).  </p>\n<p>So now I’ve come around to the view that the EA community should seek out low cost ways to improve diversity (e.g. limiting jargon), and at least weigh the costs of changes that could significantly improve diversity (e.g. a community diversity officer).  And if people want to argue that the lack of diversity in EA isn’t a problem, I think the burden of proof is clearly on them.  </p>\n<p>I’m amazed and inspired by all the young EAs who want to make the world a better place- I spent my time in college getting drunk at my frat, not reading 80,000 hours.  The last thing I want to is discourage any of them.  And I’m still kind of young and plenty dumb.  So please just consider this a perspective to consider, and an endorsement of the principle of considering different perspectives.</p>\n", "parentCommentId": null, "user": {"username": "Jon_Behar"}}, {"_id": "YZwvnxbtZAevnFP2c", "postedAt": "2017-10-28T14:34:35.649Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>Another (possibly bad, but want to put it out there) solution is to list names of people who downvoted. That of course has downsides, but it would have more accountability, especially when it comes to my suspicion that it's a few people doing a lot of the downvoting against certain people/ideas.</p>\n<p>Another is to have downvotes 'cost' karma, e.g. if you have 500 total karma, that allows you to make 50 downvotes.</p>\n", "parentCommentId": "ydWCMGKz29skswLcS", "user": {"username": "Jacy"}}, {"_id": "mhR6oS4ex4tXjkRJc", "postedAt": "2017-10-28T14:56:17.431Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>FWIW, I read your comments as a useful data point (&quot;Huh. Here's someone who's been pretty involved in EA for a year or two [not certain that's accurate] and hasn't come across many discussions of diversity/inclusion.&quot;)</p>\n", "parentCommentId": "fz2QHeSfhLTfchnMw", "user": null}, {"_id": "bKQXh9DNXPKCkrCJt", "postedAt": "2017-10-28T16:53:44.833Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>I don’t see many people who want to figure out how much of a problem there is, and then apply e.g. utilitarianism to decide what to do about that. That would count as acting seriously.</p>\n", "parentCommentId": "aeXDeHmQi3pv295uP", "user": {"username": "James_Winterford"}}, {"_id": "LLEBjKGTLJrMN4Fqy", "postedAt": "2017-10-28T22:25:23.635Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>All these threads are framed in a very non-&quot;culture war&quot;-y style, and there is little disagreement or criticism expressed in the comments, which is why they feel inconspicuous. This one, on the other hand, has already amassed 200+ comments within 3 days, which is more than any other thread on this forum, as far as I can tell (the only one that gets anywhere close is an II/Gleb drama thread).</p>\n", "parentCommentId": "3nu8t2Y2Cob5gijH2", "user": {"username": "ateabug"}}, {"_id": "T5gr3ZpFLHPwJcqF8", "postedAt": "2017-10-28T22:35:43.890Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>I'd like to point out that the main post is written in a somewhat &quot;culture war&quot;-y style, which is why it has attracted so many comments/criticisms (and within 3 days it already has more comments than any other thread one these forums, ever, as far as I can tell). Here's a somewhat similar thread that makes some good suggestions about diversity without getting too much into politics: <a href=\"http://effective-altruism.com/ea/mp/pitfalls_in_diversity_outreach/\">http://effective-altruism.com/ea/mp/pitfalls_in_diversity_outreach/</a> (also take a look at the top comment).</p>\n", "parentCommentId": null, "user": {"username": "ateabug"}}, {"_id": "eYsan56rrz3NEg2wh", "postedAt": "2017-10-28T23:58:51.685Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>Hmm, part of the problem is that downvotes are overloaded. They can either indicate:</p>\n<ul>\n<li>This is a good comment OR</li>\n<li>This is a good policy</li>\n</ul>\n<p>I don't think that people think it is a bad comment, they just think it is a bad policy.</p>\n", "parentCommentId": "RhjkKndY5sBeMMzCx", "user": {"username": "casebash"}}, {"_id": "6LFQ2Xc6NWQrh2pp7", "postedAt": "2017-10-29T00:00:44.006Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>Do you know of any spaces that don't have the problem one way or the other?</p>\n", "parentCommentId": "AYpAhsMQ2MR4zxCZX", "user": {"username": "xccf"}}, {"_id": "7vbuNutm35Yjyh9fT", "postedAt": "2017-10-29T00:06:57.656Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>&quot;I think that gets the burden of proof backwards&quot; - I agree that claiming that there are some ways in which we could improve diversity is really an anti-prediction. On the other hand for any <em>specific</em> that we should do X, the burden of proof is on the person who wants us to do it.</p>\n", "parentCommentId": "6mrpx4x7hxNPjButj", "user": {"username": "casebash"}}, {"_id": "6C42mLRWPQdZKP8rz", "postedAt": "2017-10-29T00:17:45.177Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>Yeah, the original post was much more culture war-y, but fortunately Kelly edited it to make it less so.</p>\n", "parentCommentId": "T5gr3ZpFLHPwJcqF8", "user": {"username": "casebash"}}, {"_id": "FGgqKc6tepgu2wtSN", "postedAt": "2017-10-29T00:28:50.654Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>If I recall correctly, <a href=\"http://effective-altruism.com/ea/1g3/why_how_to_make_progress_on_diversity_inclusion/c8g\">this comment</a> was at -2 when I first saw it, which frustrated me because I think people who publicly admit mistakes should get upvotes.  Publicly admitting mistakes is really hard to do.  I think we should take a moment to give people credit for this before demanding that they confess their sins even more thoroughly.</p>\n", "parentCommentId": "Ryvjp2sSPT49zhCxE", "user": {"username": "xccf"}}, {"_id": "jQTiFydf3dCuwzHwc", "postedAt": "2017-10-29T00:51:52.028Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>This would make it harder for people to downvote on topics like this one where it's really risky to admit disagreeing with people.</p>\n", "parentCommentId": "YZwvnxbtZAevnFP2c", "user": {"username": "Buck"}}, {"_id": "eRwgciqkxfWnXbSMv", "postedAt": "2017-10-29T03:02:20.316Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>I like this idea. It will be skewed towards people who aren't turned off by the culture, as those who are will have less interest in, and in some or many cases may not even be exposed to, the survey, but getting more systematic info on people's feelings here would be very useful.</p>\n", "parentCommentId": "8NAeTcvFaMo2o4vrK", "user": {"username": "Kelly_Witwicki"}}, {"_id": "Z3oduEaqApcCMm6Lg", "postedAt": "2017-10-29T03:37:27.533Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>I would say that EA/Less Wrong are better in that <em>any</em> controversial claim you make is likely to be torn to shreds.</p>\n", "parentCommentId": "6LFQ2Xc6NWQrh2pp7", "user": {"username": "casebash"}}, {"_id": "KJNTMsvSxrZaJPDKi", "postedAt": "2017-10-29T03:40:34.685Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>Someone who prefers to remain anonymous shared with me that there were multiple issues that made her and other women interns feel excluded at an EA organization, but she felt it was too intimidating to bring them up because the staff seemed too tight, including the women, and the interns felt too separate from them.</p>\n", "parentCommentId": null, "user": {"username": "Kelly_Witwicki"}}, {"_id": "776LvA77iavWT6Zqz", "postedAt": "2017-10-29T03:44:56.921Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<blockquote>\n<p>CEA and EAF could both, or jointly, hire a Diversity &amp; Inclusion Officer. CEA and EAF, your intention is to be institutional leaders of the EA community, so lead the way on this critical aspect of movement-building — there is definitely a full-time job’s worth of advising and other work to do, probably even just with the suggestions I list here. Some universities and companies have such a position, and I — and I’m sure others — would be happy to advise on what the position’s responsibilities would look like. (Thank you Sana Al Badri for this suggestion.)</p>\n</blockquote>\n<ul>\n<li>I saw some comments countering this, but I think such a position would add value and is necessary for a philosophy which is snowballing into a perception of ‘white male’ pervasion.</li>\n<li>I would be keen for more diversity and women’s EA events to be arranged more regularly, perhaps at university societies etc.</li>\n</ul>\n<blockquote>\n<p>We could establish a website providing resources for legal counsel and enabling people to anonymously share experiences regarding discrimination, harassment, and assault, both to inform less-aware community members of issues in the community and to provide a sense of accountability to the movement as a whole, as the testimonies would be publicly accessible.</p>\n</blockquote>\n<ul>\n<li>I think this could be useful, but I feel as though the women’s EA Facebook group serves this purpose to an extent. My worry with making something like this a public website would be if non-EAs looking in believe discrimination and harassment to be very common in EA circles and to put them off altogether, when it’s actually widespread everywhere. I would be in favour of some sort of platform where we can share experiences, issues and guidance, but perhaps not referencing EA explicitly so that it does not ruin the brand of the philosophy itself, but rather brings to light individual experiences.</li>\n</ul>\n", "parentCommentId": null, "user": {"username": "nikitapatel"}}, {"_id": "BA4gadWBT5G3qKShi", "postedAt": "2017-10-29T03:50:40.275Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>The same person, in response to the point &quot;Don’t dismiss or trivialize the altruistic concerns ordinary people have,&quot; said:</p>\n<p>Agree – this is one of the most alienating parts of EA groups I have come across. Charity snobbishness has become quite extreme in some contexts I’ve been in, and I found it to be a somewhat closed-minded approach to altruism generally. At one point, I became persuaded by this attitude and even noticed myself becoming judgmental with the people around me. It was only when my mum told me she thought I had become more judgmental, and not for the better, that I took initiative to really analyse why I was behaving like I was, and to understand that this is not a way to do the most good for people around you nor for trying to encourage people to give their time and money more effectively. I think many people in EA should take a step back and realise that in their attempt to do the most good, they are acting in a closed-minded way, which is actually preventing them to be able to achieve the most good they can.</p>\n", "parentCommentId": "KJNTMsvSxrZaJPDKi", "user": {"username": "Kelly_Witwicki"}}, {"_id": "G3AQMHP3zH77cGmj5", "postedAt": "2017-10-29T04:19:45.445Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>Yeah, I've read that and think there are very good points in there. I think I'd actually thought the graph said &quot;physics&quot; rather than &quot;physical sciences,&quot; so I now realize I misread it a bit. I do think that SSC piece leaves two questions open though:</p>\n<p>First, do we think that EA should be more like physics or more like medicine? This probably speaks to the E vs. A question Kelly addressed above. I think EA could benefit from having more people in it emphasizing the A. This is something we should all talk about at length, though.</p>\n<p>Second, even if there are gender differences in interest that mean that an equitable distribution in a field would be unequal, the gap may be larger than what the differences suggest. I think that's actually what we should expect: in fields that men are more interested in, the higher concentration of men should breed more sexism, and the gap should be inflated.</p>\n", "parentCommentId": "fsB4Yb6yWd45NPkY7", "user": {"username": "zdgroff"}}, {"_id": "97Gdv4jR79gPmKLnd", "postedAt": "2017-10-29T10:19:45.571Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<blockquote>\n<p>how much inclusivity gets discussed in wider society vs how much it gets discussed in EA. </p>\n</blockquote>\n<p>With the exception of groups which specifically exist for the purpose of promoting inclusivity, I can't think of any groups which discuss it more than EA.</p>\n<p>Heck, even groups like that - e.g., BLM or anti-GamerGate groups or other leftist cultural movements - don't spend significantly more time worrying about <em>their own</em> inclusivity than EA does.</p>\n", "parentCommentId": "q2mFW8MqJn36m2RhT", "user": {"username": "kbog"}}, {"_id": "jSFrDRkz4jY9rm8Nb", "postedAt": "2017-10-29T10:24:55.171Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>The right approach is to only look at actual points being made, and not try to infer implications in the first place.</p>\n<p>When someone reacts to an implication, the appropriate response is to say &quot;but I/they didn't say anything about that,&quot; ignore their complaints and move on. </p>\n", "parentCommentId": "5LkLL3PLDNJ2YkpoE", "user": {"username": "kbog"}}, {"_id": "WbRCkryJBDewxWZSQ", "postedAt": "2017-10-29T12:24:30.868Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>The most efficient point of intervention on this issue is for confident insiders to point out when a behavior has unintended consequences or is otherwise problematic.</p>\n<p>The post mentions this. It's hard to get stable, non-superficial buy-in for this from the relevant parties; everyone wants to talk the talk. But when you do, you'll get a much different effect than you will from hiring another diversity &amp; inclusion officer.</p>\n<p>I know of a few Fortune 500 companies that take the idea that <a href=\"https://en.wikipedia.org/wiki/Micro-inequity\">this stuff affects their bottom line</a> seriously enough that people in positions of power act on it, but EA seems more like a social club.</p>\n", "parentCommentId": null, "user": {"username": "James_Winterford"}}, {"_id": "FFjmSPoLNq8obXAHz", "postedAt": "2017-10-29T14:58:56.561Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>Animal advocates definitely discuss inclusion in their movement(s) more, or at least more productively. A small organization was even established in the space recently to increase racial inclusion in the movement. EA discussion on the issue has led to far less action and results in a lot more pushback and hostility. If EAs do discuss it more, I'd say the excess is in people expressing frustration and that not going anywhere.</p>\n<p>(My source is observation -- I have been heavily involved in both communities for several years.)</p>\n<p>In terms of wider society, it's an issue that people and institutions from governments to non-profits that exist to solve the issue to tech companies are putting a lot of discussion and action into. BLM isn't something separate, it's part of the discussion in wider society. And IIRC US companies spend $8bn on diversity programs annually. (How effectively they're spending it is another matter, but the point is it's getting a lot of attention.)</p>\n", "parentCommentId": "97Gdv4jR79gPmKLnd", "user": {"username": "Kelly_Witwicki"}}, {"_id": "dptGsXQ3AQe2GwRcS", "postedAt": "2017-10-29T15:14:11.022Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<blockquote>\n<p>Either way, the effect is I really haven't felt like I've had too many discussion in EA about diversity. It's not like it's my favourite topic or anything.</p>\n</blockquote>\n<p>It's extremely hard to generalize here because different geographies have such different stories to tell, but my personal take is that the level of (public) discussion about diversity within EA has dipped somewhat over time. </p>\n<p>When I wrote the Pandora's Box 2.5 years ago, I remember being sincerely worried that low-quality discussion of the issue would swamp a lot of good things that EA was accomplishing, and I wanted build some consensus before that got out of hand. I can't really imagine feeling that way now.</p>\n", "parentCommentId": "fz2QHeSfhLTfchnMw", "user": {"username": "AGB"}}, {"_id": "HvEzsQfp9s3amdngH", "postedAt": "2017-10-29T15:34:39.990Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>So as a general principle, it's true that discussion of an issue filters out (underrepresents) people who find or have found the discussion itself unpleasant*. In this particular case I think that somewhat cuts both ways, since these discussions as they take place in wider society often aren't very pleasant in general, for either side. See this <a href=\"https://www.smbc-comics.com/?id=2939\">comic</a>.</p>\n<p>To put it more plainly, I could easily name a lot of people who will strongly agree with this post but won't comment for fear of criticism and/or backlash. Like you I don't think there is an easy fix for this.</p>\n<p>*Ironically, this is part of what Kelly is driving at when she says that championing free speech can sometimes inhibit it.</p>\n", "parentCommentId": "BDGN78cXahWWL8EmL", "user": {"username": "AGB"}}, {"_id": "rhqt5pQYn3GLYkE4W", "postedAt": "2017-10-29T16:32:59.108Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>Came to say this as well. </p>\n<p>See, for example: </p>\n<p><a href=\"https://www.reddit.com/r/atheism/comments/2ygiwh/so_why_did_atheism_plus_fail/\">https://www.reddit.com/r/atheism/comments/2ygiwh/so_why_did_atheism_plus_fail/</a></p>\n<p>The atheists even started to disinvite their intellectual founders, e.g. Richard Dawkins. Will EA eventually go down the same path - will they end up disinviting e.g. Bostrom for not being a sufficiently zealous social justice advocate? </p>\n<p>All I'm saying is that there is a precedent here. If SJW-flavored EA ends up going down this path, please don't say you were not warned. </p>\n", "parentCommentId": "rDYa6xEi23sqgahAM", "user": {"username": "the_jaded_one"}}, {"_id": "gSKk67Biv2k6RRRP7", "postedAt": "2017-10-29T16:55:13.204Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>I entirely appreciate the concern of going too far. Let's just be careful not to assume that risks only come with action -- the opposite path is an awful one too, and with inaction we risk moving further down it.</p>\n", "parentCommentId": "rhqt5pQYn3GLYkE4W", "user": {"username": "Kelly_Witwicki"}}, {"_id": "FHvx2mrgNcrfobLux", "postedAt": "2017-10-29T16:57:31.132Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>The idea of introducing social justice into an existing movement has already been tried, and I think it's worth going over the failures and problems that social justice has caused in the atheist movement before jumping headlong into it in the EA movement. This reddit page about why Atheism+ failed makes for interesting reading: <a href=\"https://www.reddit.com/r/atheism/comments/2ygiwh/so_why_did_atheism_plus_fail/\">https://www.reddit.com/r/atheism/comments/2ygiwh/so_why_did_atheism_plus_fail/</a></p>\n<blockquote>\n<p>Unfortunately, the people who ended up in charge of the movement cared much more about perpetuating their radical ideologies, their cults of personality, and their easy paycheques than any of these issues. ...\nNo matter how noble your cause, someone who practices dishonesty, censorship, intimidation, and harassment in alleged pursuit of that cause is not your friend. </p>\n</blockquote>\n<p>See also this: <a href=\"https://athefist.wordpress.com/2013/09/04/the-atheism-plusftb-problem/\">https://athefist.wordpress.com/2013/09/04/the-atheism-plusftb-problem/</a></p>\n<blockquote>\n<p>Attempts to interfere with harassment policies and promoting the (unevidenced) idea that atheist meetings are hotbeds of sexual exploitation have slashed female attendance at events like TAM which were practically on 50/50 parity. Rather than trying to invest in the future of the movement or seek the best and most effective speakers there’s <em>an insistence on the basis of gender rather than expertise</em>. Not that there aren’t good speakers of all genders but when you pass over expert male speakers to include sub-par ones with axes to grind rather than progress to make that’s an issue</p>\n</blockquote>\n<p>it continues: </p>\n<blockquote>\n<p>There’s also something peculiar in claiming to be atheists and skeptics while suspending skepticism when it comes to certain claims – like the highly questionable 1-in-4 rape statistic or broader concepts like patriarchy and rape culture. Skepticism or demands for evidence in these arenas is treated as hostility.</p>\n</blockquote>\n<p>The post by Kelly that I am responding to seems to contain several red flags indicating that EA+SJ is falling into the same traps that Atheism+SJ fell into; </p>\n<ul>\n<li>suspending healthy skepticism of questionable claims, </li>\n<li>advocating identity categories over competence, </li>\n<li>supporting the silencing of dissenting opinions and abandoning free speech</li>\n</ul>\n<p>As I said in another comment: don't say you weren't warned if this goes badly. </p>\n", "parentCommentId": null, "user": {"username": "the_jaded_one"}}, {"_id": "cpTcj74tnBjjjJL8g", "postedAt": "2017-10-29T18:11:17.383Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>People nominally within EA have already called for us to disavow or not affiliate with Peter Singer so this seems less hypothetical than one might think.</p>\n<p>'Yvain' gives a good description of a process along along these lines within his comment <a href=\"https://www.benkuhn.net/inclusivity\">here</a> (which also contains lots of points which pre-emptively undermine claims within this post). </p>\n", "parentCommentId": "rhqt5pQYn3GLYkE4W", "user": {"username": "David_Moss"}}, {"_id": "5NdmCpjCTj7pnt6aT", "postedAt": "2017-10-29T18:33:47.629Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>I already commented this on your earlier, similar comment, but since you're repeating this here I will too so it's not missed:</p>\n<p>I entirely appreciate the concern of going too far. Let's just be careful not to assume that risks only come with action -- the opposite path is an awful one too, and with inaction we risk moving further down it.</p>\n", "parentCommentId": "FHvx2mrgNcrfobLux", "user": {"username": "Kelly_Witwicki"}}, {"_id": "2ghJZE9tsZNvHPPaq", "postedAt": "2017-10-29T18:46:57.114Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>Regarding your &quot;red flags&quot;:</p>\n<p>1) The post does not advocate for identity categories over competence, but competence over identity categories. As I've argued, we're missing out on a lot of people because they don't match irrelevant criteria.</p>\n<p>2) No skepticism of questionable claims has been suspended. You are welcome, as others have, to point out what claims are too confident and why. You'll note that I've edited the post to qualify a claim I made that a commenter pointed out is debated in the literature, and an implication I made that a commenter convinced me I made too confidently.</p>\n<p>You are also welcome to provide arguments for the position you seem to take that the status quo (or an even more exclusive community, which we may be becoming) is better than a more inclusive community. Bringing up the risk is a valuable contribution to this discussion and I really appreciate it. Let's go further with our analysis of tradeoffs and discuss specific steps we can take to become more inclusive while limiting the risks in either direction, and let's have a healthy skepticism of the status quo.</p>\n<p>3) A dismissal of the whole project of inclusion because of the risk that it will go too far is itself something of a silencing of dissenting opinions and an abandoning of free speech. As I said very explicitly in my comment about free speech, the term is often used to justify speech that pushes people out and reduces the diversity of opinions in the community and the freedom that people have to speak. The question is where the line is -- and it's probably a blurry, messy one -- and how we should address transgressions of it to keep our debates as free and productive as possible.</p>\n", "parentCommentId": "FHvx2mrgNcrfobLux", "user": {"username": "Kelly_Witwicki"}}, {"_id": "bzBrDeFQTd36d67bs", "postedAt": "2017-10-30T05:12:23.193Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>Some more thoughts:</p>\n<ul>\n<li><p>I mentioned my concern that pro-diversity efforts in EA might &quot;spiral&quot; towards a mob mentality.  I think one way in which this might happen is if the people working towards diversity in EA recruit people from underrepresented groups that they know through other pro-diversity groups, which, as you mention, frequently suffer from a mob mentality.  If the pool of underrepresented people we draw from is not selected this way (e.g. if the majority of black people who are joining EA are against affirmative action, as is true for the majority of the black population in general), then I'm less worried.</p>\n</li>\n<li><p>I think some of your suggestions are not entirely consistent.  For example, you mention that EA should not &quot;throw around the term “AI” with no qualification or explanation&quot;.  From my perspective, if I was hearing about EA for the first time and someone felt the need to explain what &quot;AI&quot; was an acronym for, I would feel condescended to.  I imagine this effect might be especially acute if I was a member of a minority group (&quot;How dumb do these people think I am?&quot;)  Similarly, you suggest that we cut our use of jargon.  In practice, I think useful jargon is going to continue getting used no matter what.  So the way this suggestion may be interpreted in practice is: <em>Don't use jargon around people who are members of underrepresented groups</em>.  I think people from underrepresented groups will soon figure out they are being condescended to.  I think a better idea is to remember that we were once ignorant about jargon ourselves, and make an effort to explain jargon to newbies.  Hopefully they feel like members of the ingroup after they've mastered the lingo.</p>\n</li>\n<li><p>Relatedly, there is a question which I think sometimes gets tied up with the diversity question, but perhaps should not get tied up, which is the question of whether EA should aim more to be a committed, elite core vs a broad church.  My impression is lots of people privately favor the committed, elite core approach.  I think we can have both diversity and a committed, elite core: consider institutions such as Harvard which are both elite and diverse.  Furthermore, I think being more public about our elitism might actually help with diversity, because we'd be making our standards clearer and more transparent, and we could rely less heavily on subjective first impressions.  (CC <a href=\"http://effective-altruism.com/ea/1g3/why_how_to_make_progress_on_diversity_inclusion/c83\">Askell</a> on &quot;buzz talk&quot;.)  To put it another way: although &quot;diversity&quot; and &quot;inclusion&quot; are often treated as synonyms, it's actually possible to be both &quot;diverse&quot; and &quot;exclusive&quot; (and this seems likely ideal).</p>\n</li>\n<li><p>A benefit of diversity you didn't mention: Insofar as the EA movement has world peace and global cooperation as part of our goals, it's useful to have people from as many different groups as possible.  This is also useful if we want to be able to speak authoritatively on topics like how AI should be used for the benefit of humanity and whatnot.</p>\n</li>\n<li><p>Unjustified hunch here, but I think maybe another failure mode that can come up when a movement tries to increase diversity is that people who are underrepresented start to receive more attention.  Even if this attention is positive (e.g. &quot;How can we cater to people like you better?&quot;), I think this can result in an increased level of self-consciousness.  (See my previous point about how people who look different may feel self-conscious by default even if they're not discriminated against.)  Further unjustified conjecture: the sort of black person who supports affirmative action tends to enjoy the power they get from this, whereas the sort of black person who doesn't support affirmative action doesn't like it, thereby enhancing the &quot;spiral&quot; effect.</p>\n</li>\n<li><p>Another possible failure mode: Diversity advocates see something they don't like (e.g. a person suggesting that women do not contribute to society and are leeches if they don’t offer men sex), and they want to root the problem out.  In order to rally support, they let everyone know about the problem (like you did in this post).  But by letting everyone know about the problem, they've also made it in to a bigger problem: now every woman who reads this post knows that someone, at one point in an EA-related discussion somewhere, made this outrageous claim--which results in those women feeling less welcome and more on edge.  The toxic echo of this person's post continues to reverberate as it is held up as part of a broader trend within EA, even though their post itself was long ago deleted.  (This could contribute to the &quot;spiral&quot; effect I described, if the women who stick around after hearing about posts like these are disproportionately those that enjoy engaging in flame wars with people who make outrageous statements.)</p>\n</li>\n<li><p>I mentioned the EA Survey.  One thing you could do is look at existing EA survey data and try to understand whether our issues with underrepresentation seem to be getting better or worse over the years.  My impression is that gender thing, at least, has gotten much better since EA was founded.  In any case, if things are already on a good path, I'm more skeptical about major diversity initiatives--&quot;if it ain't broke, don't fix it&quot;.</p>\n</li>\n</ul>\n<p>Incidentally, I realized some of the points I'm making here are redundant with <a href=\"http://effective-altruism.com/ea/mp/pitfalls_in_diversity_outreach/\">this essay</a> which was already posted.  (But I highly recommend reading it anyway, because it has some great points I hadn't thought of.)</p>\n", "parentCommentId": "eRwgciqkxfWnXbSMv", "user": {"username": "xccf"}}, {"_id": "br9JQWagyr3xq2Hcd", "postedAt": "2017-10-30T13:57:23.013Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<blockquote>\n<p>But by letting everyone know about the problem, they've also made it in to a bigger problem: now every woman who reads this post knows that someone, at one point in an EA-related discussion somewhere, made this outrageous claim--which results in those women feeling less welcome and more on edge. The toxic echo of this person's post continues to reverberate as it is held up as part of a broader trend within EA, even though their post itself was long ago deleted.</p>\n</blockquote>\n<p>This can get very dangerous as it opens a door for trolls to negatively impact the community and potentially damage its reputation. Maybe these kinds of discussions need to be gated in some way, or be had offline or something.</p>\n", "parentCommentId": "bzBrDeFQTd36d67bs", "user": {"username": "ateabug"}}, {"_id": "kTXadQbD5N6sXP2uX", "postedAt": "2017-10-30T19:29:30.075Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>Risk does come with greater publicity of such behavior, but that's part of the point of making it more public (in addition to the information value for people who want to avoid or address it). This is the first I've ever publicly said something about these issues in EA, after three years of many private conversations that seem to have resulted in limited or no impact. Greater publicity means greater accountability and motivation for action, both for the people who behave poorly and the people who let them do so without consequence.</p>\n", "parentCommentId": "br9JQWagyr3xq2Hcd", "user": {"username": "Kelly_Witwicki"}}, {"_id": "pgbJaBS5mJe3MXRGD", "postedAt": "2017-10-30T23:39:28.360Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>Christine Peterson's life partner discussion is around 1:17:20 at the above link^^</p>\n<p>It's part of a broader discussion about supporting yourself while being altruistic over the long haul (starts around 1:15:00).</p>\n", "parentCommentId": "zu6SSnxTzxGTKWmQS", "user": {"username": "Milan_Griffes"}}, {"_id": "GkPJBH4CfyyR7qfLt", "postedAt": "2017-10-31T22:12:03.536Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>Is it true that men score higher than women in 'thinking' vs 'feeling'? If so, the EA community (being dominated by men) might be structured in ways that appeal to 'thinkers' and deter 'feelers'. To reduce the gender gap in EA, we would have to make the community be more appealing to 'feelers' (if women are indeed disproportionately 'feelers').</p>\n", "parentCommentId": null, "user": {"username": "Michael_Wiebe"}}, {"_id": "TtLBr38XtzqCm4zTv", "postedAt": "2017-10-31T23:30:05.384Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>Out of curiosity, have you tried anything besides private conversations?</p>\n", "parentCommentId": "kTXadQbD5N6sXP2uX", "user": {"username": "xccf"}}, {"_id": "pM6z4jDRve3MPa6ZQ", "postedAt": "2017-11-01T00:09:10.276Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>I think we score quite a bit worse on &quot;feeling&quot; than most altruistically-driven communities and individuals, men included.</p>\n<p>[Edit: Point being, yes we're lacking in feeling, but &quot;thinking vs. feeling&quot; is not a tradeoff we have to make to increase our A (or our gender parity, which isn't an inherent problem but is tightly related to our problems). EA's whole purpose is to combine both and we should aim to recruit people who score high on both, not just one or the other. Sorry for the excessive edits.]</p>\n", "parentCommentId": "GkPJBH4CfyyR7qfLt", "user": {"username": "Kelly_Witwicki"}}, {"_id": "pZiSpXKhfRBsmCxu8", "postedAt": "2017-11-01T00:54:51.014Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>Since I'm already working on inclusionary practices myself, there's not much else to do but private or public discussion.</p>\n<p>The private discussions I have had explicitly around the issue have varied a lot in their content and purpose and can be characterized as any of the following or a combination thereof: Listening to people's experiences; sharing my own; discussing solutions; actively (beyond just listening) supporting people who were treated poorly; sharing information and concern about the issue with people in a better or still good position to do something about it; trying to discuss why this or more specific issues of exclusion are a problem with people who prefer the status quo; or endeavoring to show people why something they did was a problem and what they should do differently.</p>\n<p>Dealing with a bewilderingly amateur situation myself and working to privately help the people responsible to understand the problem and improve took a month out of my life, and with a really important counterfactual, and that's strictly in time spent on the issue that I don't think I would have had to lose in e.g. the animal advocacy community, and not accounting for the emotional toll. I have good reason for (cautious) optimism that that was fruitful but also a red flag restraining that optimism and regardless only time will tell.</p>\n<p>Basically I've spent a huge amount of time on those private and often solution-oriented conversations and have been hanging over the precipice of burnout with the community since day 1 several years ago. (The broader community at least, not the animal advocacy sub/intersected-community. And disclaimer that there are great individuals throughout the broader community who are my friends and/or whose presence in the community I am so happy for, etc.) And I'm definitely not alone in that.</p>\n<p>I can do more to have private conversations with people in better positions than myself to make change here (such as people who are looked up to in the community by the people whose behavior could be more inclusionary, or donors to EA orgs), and I might if this post and the discussion here doesn't inspire other people to take more action on this issue, which is my hope.</p>\n", "parentCommentId": "TtLBr38XtzqCm4zTv", "user": {"username": "Kelly_Witwicki"}}, {"_id": "a53grXvq8khvCWr6y", "postedAt": "2017-11-01T21:22:41.780Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<blockquote>\n<p>In all likelihood men just hide their emotions <a href=\"https://www.elitedaily.com/dating/guys-more-emotional-girls/1077730\">better than women</a></p>\n</blockquote>\n<p>I think citing this article weakens your overall argument. The study has n=30 and is likely more of the same low-quality non-preregistered social psychology research that is driving the replication crisis. Your argument is strong enough (to think about examples of men being snarky, insulting others, engaging in pissing contests) without needing to cite some flimsy study. Otherwise, people start questioning whether your other citations are trustworthy.</p>\n", "parentCommentId": null, "user": {"username": "Michael_Wiebe"}}, {"_id": "zwhj45AXogYGDocon", "postedAt": "2017-11-01T21:52:46.255Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>My understanding of Myers Briggs is that 'thinking' and 'feeling' are mutually exclusive, at least on average, in the sense that being more thinking-oriented means you're less feeling-oriented. The E vs. A framing is different, and it seems you could have people who score high in both. Is there any personality research on this? </p>\n", "parentCommentId": "pM6z4jDRve3MPa6ZQ", "user": {"username": "Michael_Wiebe"}}, {"_id": "zcHQe7LCQ2iTaoqTT", "postedAt": "2017-11-02T21:19:21.091Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<blockquote>\n<p>Is there any personality research on this?</p>\n</blockquote>\n<p>Doesn't personality psychology use <a href=\"https://en.wikipedia.org/wiki/Big_Five_personality_traits\">the BIg Five</a> instead of Myers Briggs? AFAIK there isn't enough research to determine the validity and usefulness of the 'thinking' / 'feeling' categories (and Myers Briggs in general).</p>\n", "parentCommentId": "zwhj45AXogYGDocon", "user": {"username": "ateabug"}}, {"_id": "Mvj4Z5fRqJCeqprpB", "postedAt": "2017-11-07T21:23:55.538Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>I made a survey for all the suggestions to try to sort them out, cause it seemed like people thought there were too many.</p>\n<p>Unfortunately only 3 people responded, but you can also answer or share it around more if you wish.</p>\n<p><a href=\"https://docs.google.com/forms/d/e/1FAIpQLSd0QsGqbyVN49mtAqgN-z8t7P6dkTpNugZ7tVPShFIRvs5dig/viewform?usp=sf_link\">https://docs.google.com/forms/d/e/1FAIpQLSd0QsGqbyVN49mtAqgN-z8t7P6dkTpNugZ7tVPShFIRvs5dig/viewform?usp=sf_link</a></p>\n", "parentCommentId": null, "user": {"username": "kbog"}}, {"_id": "qvHD948Mxj57DymCP", "postedAt": "2017-11-15T19:08:50.650Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<blockquote>\n<p>So I think that if you identify with or against some group (e.g. 'anti-SJWs'), then anything that people say that pattern matches to something that this group would say triggers a reflexive negative reaction</p>\n</blockquote>\n<p>Agreed. I'm not sure how we escape from that trap, except by avoiding loaded terms, even at the expense of brevity. </p>\n", "parentCommentId": "s4c2TmdFPMdBEqfsk", "user": {"username": "HenryStanley"}}, {"_id": "RifwE3hpn3EdFhMvB", "postedAt": "2017-11-18T21:47:38.130Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>I just played with Parable of the Polygons recently    <a href=\"http://ncase.me/polygons/\">http://ncase.me/polygons/</a>    and I think it illustrates a simple general strategy for building more diversity which may underly many of the strategies in this article. The simple strategy is to have a preference against high levels of sameness (/homogeneity), given that one already has a preference for more diversity. I think it is important to not be okay with a demographically homogenous EA movement, manifested with more general strategies, e.g. 'I will try to notice, feel bad/ disapproving, and do something about an EA meeting with over 80% white, male, tech, etc.', along with the many great general and specific strategies in this article.</p>\n<p>Thanks for the article Kelly.</p>\n<p>Also, parable of the polygons is fun to play around with, aside from its instructive benefits. :)</p>\n", "parentCommentId": null, "user": {"username": "ColinBested"}}, {"_id": "5AbEnST9QpH44Kdbc", "postedAt": "2017-11-18T22:22:25.860Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<blockquote>\n<p> 'I will try to notice, feel bad/ disapproving, and do something about an EA meeting with over 80% white, male, tech, etc.'</p>\n</blockquote>\n<p>This will only work if you get the 80% to have a preference for more diversity first (as explained in the Parable of the Polygons), otherwise it will be ineffective even if you are pushing for more diversity from the top.</p>\n", "parentCommentId": "RifwE3hpn3EdFhMvB", "user": {"username": "ateabug"}}, {"_id": "P8edyB8avDHmv4cuD", "postedAt": "2017-11-22T11:01:09.348Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>Don't just try to be more inclusive, include! </p>\n<p>ie. go to where women and BME people already are, find those who also want their altruism to be effective, and see how they are ALREADY organising themselves, and support that....</p>\n<p>....rather than imagining that we can co-opt THEIR skills and talent into OUR network!</p>\n<p>It may be that we are not the ones who are best placed to  shift the EA network to something more welcoming to women and BME people. I'm not saying effort isn't worthwhile, and valuable in itself, it is. but forming an alliance may be much more viable than trying to &quot;include people in&quot;. be our best selves, rather than pretend we can be a level playing field. Humility doesn't suck! Presumption does.</p>\n<p>I can't speak to where women with a likely interest in EA goals are, but for people from other cultures, two movements stand out: for South America, the Freirian movement, inspired by Paolo Freire and others. In India and Africa (and Canada and UK) the participatory movement and especially Participatory Evaluation - something we could learn a lot from!</p>\n", "parentCommentId": null, "user": {"username": "RayTaylor"}}, {"_id": "ohAKTDLNycBjLgXKe", "postedAt": "2018-05-13T16:35:30.534Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>You only have control over your own actions: you can't control whether your interlocutor over-interprets you or not.</p>\n<p>Your &quot;right approach&quot;, which is about how to behave as a listener, is compatible with Michael_PJ's, which is about how to behave as a speaker: I don't see why we can't do both.</p>\n", "parentCommentId": "jSFrDRkz4jY9rm8Nb", "user": {"username": "David Mears"}}, {"_id": "SdXD6p9hexDDk5Lqm", "postedAt": "2018-05-14T13:00:38.327Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<blockquote>\n<p>You only have control over your own actions: you can't control whether your interlocutor over-interprets you or not</p>\n</blockquote>\n<p>But I can control whether I am priming people to get accustomed to over-interpreting.</p>\n<blockquote>\n<p>I don't see why we can't do both.</p>\n</blockquote>\n<p>Because my approach is not merely about how to behave as a listener. It's about speaking without throwing in unnecessary disclaimers.</p>\n", "parentCommentId": "ohAKTDLNycBjLgXKe", "user": {"username": "kbog"}}, {"_id": "Xus6KADSd55jPg2gY", "postedAt": "2018-05-14T16:01:15.306Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<blockquote>\n<p>But I can control whether I am priming people to get accustomed to over-interpreting.</p>\n</blockquote>\n<p>That sounds potentially important. Could you give an example of a failure mode?</p>\n<blockquote>\n<p>Because my approach is not merely about how to behave as a listener. It's about speaking without throwing in unnecessary disclaimers.</p>\n</blockquote>\n<p>Consider how my question &quot;Could you give an example...?&quot; reads if I didn't precede it with the following signal of collaborativeness: &quot;That sounds potentially important.&quot; At least to me (YMMV), I would be like 15% less likely to feel defensive in the case where I precede it with such a signal, instead of leaping into the question -- which I would be likely (on a System 1y day) to read as &quot;Oh yeah? Give me ONE example.&quot; Same applies to the phrase &quot;At least to me (YMMV)&quot;: I'm chucking in a signal that I'm willing to listen to your point of view.</p>\n<p>Those are examples of disclaimers. I argue these kinds of signals are helpful for promoting a productive atomsphere; do they fall into the category you're calling &quot;unnecessary disclaimers&quot;? Or is it only something more overt that you'd find counterproductive?</p>\n<p>I take the point that different people have different needs with regards to this concern. I hope we can both steer clear of typical-minding everyone else. I think I might be particularly oversensitive to anything resembling conflict, and you are over on the other side of the bell curve in that respect. </p>\n", "parentCommentId": "SdXD6p9hexDDk5Lqm", "user": {"username": "David Mears"}}, {"_id": "KDHJKi9srvo6BunGk", "postedAt": "2018-05-15T17:46:37.996Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<blockquote>\n<p>That sounds potentially important. Could you give an example of a failure mode?</p>\n</blockquote>\n<p>The failure mode where people over-interpret things that other people say, and then come up with wrong interpretations.</p>\n<blockquote>\n<p>I argue these kinds of signals are helpful for promoting a productive atomsphere; do they fall into the category you're calling &quot;unnecessary disclaimers&quot;? </p>\n</blockquote>\n<p>Well you should probably signal however friendly you are actually feeling, but I'm not really talking about showing how friendly you are, I'm talking about going out of your way to say &quot;of course I don't mean X&quot; and so on.</p>\n<p><a href=\"https://www.overcomingbias.com/2018/05/skip-value-signals.html\">https://www.overcomingbias.com/2018/05/skip-value-signals.html</a></p>\n", "parentCommentId": "Xus6KADSd55jPg2gY", "user": {"username": "kbog"}}, {"_id": "ktRKnQM3kFCX5WYym", "postedAt": "2018-05-17T17:00:12.789Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<blockquote>\n<p>I'm not really talking about showing how friendly you are</p>\n</blockquote>\n<p>It looks like we were talking at cross purposes. I was picking up on the admittedly months-old conversation about &quot;signalling collaborativeness&quot; and [anti-]&quot;combaticism&quot;, which is a separate conversation to the one on value signals. (Value signals are probably a means of signalling collaborativeness though.)</p>\n<blockquote>\n<p>you should probably signal however friendly you are actually feeling</p>\n</blockquote>\n<p>I think politeness serves a useful function (within moderation, of course). 'Forcing' people to behave more friendly than they feel saves time and energy.</p>\n<p>I think EA has a problem with undervaluing social skills such as basic friendliness. If a community such as EA wants to keep people coming back and contributing their insights, the personal benefits of taking part need to outweigh the personal costs.</p>\n", "parentCommentId": "KDHJKi9srvo6BunGk", "user": {"username": "David Mears"}}, {"_id": "p7Yut4dk5Xe4LQZnT", "postedAt": "2018-05-17T17:44:29.646Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<blockquote>\n<p>I think EA has a problem with undervaluing social skills such as basic friendliness. If a community such as EA wants to keep people coming back and contributing their insights, the personal benefits of taking part need to outweigh the personal costs.</p>\n</blockquote>\n<p>Not if people aren't attracted to such friendliness. Lots of successful social movements and communities are less friendly than EA.</p>\n", "parentCommentId": "ktRKnQM3kFCX5WYym", "user": {"username": "kbog"}}, {"_id": "ziyDYdeJHDKd9g2iA", "postedAt": "2019-03-28T22:57:02.365Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<blockquote>Adopt and enforce a clear policy — as organizations and  individuals — for dealing seriously and fully with illegal actions like  sexual harassment and explicit discrimination or discrimination revealed  by HR or legal counsel. Commensurate consequences and  reform procedures, escalating as necessary to expulsion, are critical.  The perpetrator is not so much more important than the greater number of  people they are driving away, the risk of a lawsuit to the organization  protecting them, or the risk they bring to the community’s reputation,  that such actions should be protected. If this community’s members are  as smart as we like to think, using a heavy hand once, if necessary at  all, should be all it takes, so long as the threat of using it again is  credibly maintained. </blockquote><p>One defining feature of the #metoo movement has been its exposing of powerful men, often in leadership positions and protected by influential friends, who sexually harassed women.  </p><p>As you know, Jacy Reese (previously known as Jacy Anthis), recently admitted to harassing women in the EA movement.  While exactly what he did is not public, it was apparently severe enough that CEA has found it necessary to ban him from all CEA-associated events.  His undergraduate college, Brown University, expelled him in 2012 after similar accusations, though he denied them at the time. </p><p><a href=\"https://forum.effectivealtruism.org/posts/8XdAvioKZjAnzbogf/apology\">https://forum.effectivealtruism.org/posts/8XdAvioKZjAnzbogf/apology</a></p><p>In light of the above, does the Sentience Institute agree that CEA&#x27;s actions were reasonable to protect women in the EA movement? </p><p>Secondly, could you explain how the Sentience Institute is handling the issue?  To my knowledge Jacy is currently Head of Research, and many organizations instinctively protect their leaders.  Additionally, Jacy is in a relationship with you, the Executive Director, which seems like a conflict of interest.  How are you reassuring people that he will not receive more lenient treatment as a result?</p>", "parentCommentId": null, "user": {"username": "throwaway456"}}, {"_id": "srMHiJevLCN8brNMW", "postedAt": "2020-12-13T05:03:55.615Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>Thank you for writing this! You've made a lot of good points in here, some of which I've been thinking of myself.&nbsp;</p><p>A note on this point though:</p><blockquote><p>Similarly, when considering whether to go vegetarian or take some other step to avoid participating in a major moral problem, consider how not doing so could validate and perpetuate the biases and selfishness that enable people commit that act normally, and how that act could help others feel licensed to do other selfish and harmful things that you disagree with, like lying to sexual partners about having an STI or being dishonest and uncharitable in representations of your organization or preferred cause area.</p></blockquote><p>I generally agree with your position re: the potential harm of perpetuating harmful behaviors in the status quo by &nbsp;ignoring the moral issue of how diverse groups are treated. However, the vegetarian example used conflates declining to be vegetarian with &nbsp;\"selfish and harmful\" act of avoiding participating in a major moral problem. The problem is, there are a number of people in the world who have limited access to vegetarian substitutes and/or food in general, diverse cultural pressures, medical conditions, etc. which make changing their diet difficult or in some cases impossible. Therefore it may be more respectful and inclusive to caveat this statement by indicating that not all choices to abstain from vegetarianism are for simplistic or selfish reasons due to ignoring the moral problem.</p>", "parentCommentId": null, "user": {"username": "Keirra_W"}}, {"_id": "kcuhsdi2Erf8nRnHC", "postedAt": "2021-07-27T01:25:02.972Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<blockquote><p>Companies in the top quartile for diversity in gender and ethnicity are <a href=\"http://www.mckinsey.com/business-functions/organization/our-insights/why-diversity-matters\">15% and 35% more likely to outperform their industry’s median performance</a>, respectively, and companies in the bottom quartile lag behind the median.&nbsp;</p></blockquote><p>Many other commentators have already pointed out the problems with other pieces of evidence cited in the post, but I thought it was worth noting that this study also <a href=\"https://papers.ssrn.com/sol3/papers.cfm?abstract_id=3849562\">failed to replicate</a>:</p><blockquote><p>However, when we revisit McKinsey’s tests using recent data for US S&amp;P 500® firms, we find statistically insignificant relations between McKinsey’s inverse normalized Herfindahl-Hirschman measures of executive racial/ethnic diversity and not only industry-adjusted EBIT margin, but also industry-adjusted sales growth, gross margin, ROA, ROE, and TSR. Our results suggest that despite the imprimatur often given to McKinsey’s (2015, 2018, 2020) studies, caution is warranted in relying on their findings to support the view that US publicly traded firms can deliver improved financial performance if they increase the racial/ethnic diversity of their executives.&nbsp;</p></blockquote>", "parentCommentId": null, "user": {"username": "Larks"}}, {"_id": "wgzZD2My2XTrom3xm", "postedAt": "2021-07-27T10:07:16.162Z", "postId": "YCPc4qTSoyuj54ZZK", "htmlBody": "<p>Thanks for taking the time to post this result four years later!</p>\n", "parentCommentId": "kcuhsdi2Erf8nRnHC", "user": {"username": "Khorton"}}]