[{"_id": "TGzWAG9q3X3xTDt8t", "postedAt": "2014-11-30T03:36:20.351Z", "postId": "YCTHxP6tcT4FcDwki", "htmlBody": "<p>Nice post and thanks for the shout out to my blog but for the record, I'm not &quot;a marketer&quot; by any means. I just took an interest in marketing and related fields while researching my <a href=\"http://a-nice-place-to-live.blogspot.ca/2014/08/my-thesis-paper-fiction-fast-and-slow.html\">thesis paper</a>. I actually do production office work in film.</p>\n", "parentCommentId": null, "user": {"username": "Bitton"}}, {"_id": "CFgGY3MANeKGQ9jJK", "postedAt": "2014-11-30T03:42:36.812Z", "postId": "YCTHxP6tcT4FcDwki", "htmlBody": "<blockquote>\n<p>Generally Solid Jobs</p>\n</blockquote>\n<ul>\n<li>Alaskan truck driver</li>\n<li>Welder in US south</li>\n<li>Many jobs in the oil &amp; gas industry</li>\n</ul>\n<p>Basically jobs that pay very well but have less intellectual prerequisites than most EA jobs. They are not glamorous but I think they are unfairly overlooked for this reason.</p>\n<p>I think the only concern with these would be the recent oil price moves - WTI has probably now fallen far enough to significantly dis-incent US capacity expansion. </p>\n<p><em>edit: formatting</em></p>\n", "parentCommentId": null, "user": {"username": "Dale"}}, {"_id": "Rxn2AYYQX6d6DubXw", "postedAt": "2014-11-30T06:10:18.152Z", "postId": "YCTHxP6tcT4FcDwki", "htmlBody": "<blockquote>\n<p>Generally solid jobs</p>\n</blockquote>\n<p>Shoutout for <a href=\"http://www.lesswrong.com/lw/43m/optimal_employment/\">considering Australia</a>, assuming this advice still currently holds.</p>\n", "parentCommentId": null, "user": {"username": "Peter_Hurford"}}, {"_id": "7gXpb7dydBZxcjwfb", "postedAt": "2014-11-30T06:11:59.891Z", "postId": "YCTHxP6tcT4FcDwki", "htmlBody": "<blockquote>\n<p>Developing-world entrepreneurship</p>\n</blockquote>\n<p>What would a developing world start-up look like?</p>\n", "parentCommentId": null, "user": {"username": "Peter_Hurford"}}, {"_id": "FEZ8GTv4hpvcZXFaq", "postedAt": "2014-11-30T10:41:38.058Z", "postId": "YCTHxP6tcT4FcDwki", "htmlBody": "<p>This has been a bit hit and miss, and I don't hear so many people recommending it anymore.</p>\n", "parentCommentId": "Rxn2AYYQX6d6DubXw", "user": {"username": "RyanCarey"}}, {"_id": "Mvvwzi98wCXkzstJh", "postedAt": "2014-11-30T17:54:09.698Z", "postId": "YCTHxP6tcT4FcDwki", "htmlBody": "<p>Thanks for the post but the thing is its is just spitballing.. I don't see that these lists (including what i have seen from 80,000) offer much guidance to people beyond: &quot;be very competent and get a good job and you will have potential to leverage that&quot;</p>\n", "parentCommentId": null, "user": {"username": "AlasdairGives"}}, {"_id": "Eogbfec4oQCGTwqTH", "postedAt": "2014-11-30T21:12:49.106Z", "postId": "YCTHxP6tcT4FcDwki", "htmlBody": "<p>Are you trying to imagine like a silicon valley of the developing world?</p>\n", "parentCommentId": "7gXpb7dydBZxcjwfb", "user": {"username": "kdbscott"}}, {"_id": "pevNYvStx3oo5jayG", "postedAt": "2014-11-30T23:22:53.067Z", "postId": "YCTHxP6tcT4FcDwki", "htmlBody": "<p>Not necessarily -- just want to know more about what for-profit ventures in the developing world are like.  Mobile phones seem to have done well.</p>\n", "parentCommentId": "Eogbfec4oQCGTwqTH", "user": {"username": "Peter_Hurford"}}, {"_id": "G6f6cueXgnw9rKNBM", "postedAt": "2014-12-01T13:30:13.033Z", "postId": "YCTHxP6tcT4FcDwki", "htmlBody": "<p>Specifically:</p>\n<ul>\n<li>The author (Louie) is now in the bay area working for MIRI.</li>\n<li>MyleyCyrus tried it and after a <a href=\"http://lesswrong.com/lw/cge/off_to_alice_springs/6lzs\">rough start</a> saved some money and are <a href=\"http://lesswrong.com/lw/fuz/my_experience_as_an_australian_workholiday_maker/\">glad they did it</a>.</li>\n<li>Psy-Kosh also tried it and also had a <a href=\"http://lesswrong.com/r/discussion/lw/cge/off_to_alice_springs/\">rough start</a>, but doesn't seem to have posted anything about it since.  Which probably means it didn't go well, but someone could ask them.</li>\n<li>smerda <a href=\"http://lesswrong.com/lw/43m/optimal_employment/3g7p\">went the other way</a> and thinks they make more in the bay area, but they're also a programmer so that's pretty much expected.</li>\n<li>Other people who were already in Australia trying something similar give cautions: <a href=\"http://lesswrong.com/lw/43m/optimal_employment/3g4s\">Petro</a> <a href=\"http://lesswrong.com/lw/43m/optimal_employment/8s6n\">Mithy</a>.</li>\n</ul>\n<p>A key thing is that the work-holiday visa is only good for a year and you can't work a job more than six months, so if you find something that's great you need to be looking again very soon.</p>\n", "parentCommentId": "FEZ8GTv4hpvcZXFaq", "user": {"username": "Jeff_Kaufman"}}, {"_id": "pY9TAXwWRPcyancQb", "postedAt": "2014-12-01T15:09:04.939Z", "postId": "YCTHxP6tcT4FcDwki", "htmlBody": "<p>Perhaps Ben meant social entrepreneurship, which is often geared towards the developing world? Forbes <a href=\"http://www.forbes.com/sites/randalllane/2012/12/17/30-under-30-social-entrepreneurs/\">30 under 30</a> has some ideas for what those projects can be. If you don't like those, I recommend filtering through the <a href=\"https://www.ashoka.org/fellows\">Ashoka fellows</a>. The most recent Ashoka fellow started a foundation/for-profit combo called <a href=\"http://www.soronkosolutions.com/about.html\">Soronko Solutions</a>, which teaches kids programming and sells tech solutions to startups.</p>\n<p>--</p>\n<p>In general, if you're going to run a normal for-profit business in the developing world that sells products or provides a service, you're probably not going to make very much money. Money goes further in the developing world because you don't make as much.</p>\n<p>If you want to help other people, the logic is to register as a non-profit and get some of those philanthropy dollars. Many non-profits work to cultivate entrepreneurship, with a few approaches:</p>\n<ul>\n<li><p>What Givewell calls <a href=\"http://www.givewell.org/international/economic-empowerment\">economic empowerment</a>, e.g. providing capital, skills training, mentorship, government advocacy, etc. The Global Entrepreneurship Monitor has a long list of <a href=\"http://www.gemconsortium.org/key-indicators\">entrepreneurship indicators</a>, and could be a starting point to inspire work in under-addressed areas.  </p>\n</li>\n<li><p><a href=\"http://www.entrepreneur.com/article/232260\">Social franchising</a>, whether it is re-selling <a href=\"http://en.wikipedia.org/wiki/International_Development_Enterprises\">micro irrigation systems</a> or opening <a href=\"http://www.cfwshops.org/\">rural health stores</a>.</p>\n</li>\n<li><p>For-profit / Non-profit hybrids like the Ashoka example mentioned above.</p>\n</li>\n</ul>\n<p>I've probably done a terrible job of introducing the topic, but I'm going to cut myself off before the rest of my day disappears.</p>\n", "parentCommentId": "pevNYvStx3oo5jayG", "user": {"username": "kdbscott"}}, {"_id": "fBc8QC8m2F2o5Bo3E", "postedAt": "2014-12-01T16:29:47.364Z", "postId": "YCTHxP6tcT4FcDwki", "htmlBody": "<p>Yes. Louie just finished at miri in the last few months but is still working  in the bay area</p>\n", "parentCommentId": "G6f6cueXgnw9rKNBM", "user": {"username": "RyanCarey"}}, {"_id": "kxesZtPeyWsiD5k69", "postedAt": "2014-12-01T16:31:16.975Z", "postId": "YCTHxP6tcT4FcDwki", "htmlBody": "<p>This is cool Ben, thanks for doing this! I agree with the general idea that personal fit is very important and we should be open to considering a wide range of careers. </p>\n<p>I do think this slightly misrepresents 80k though. You say they only have a list of four top careers, but in fact <a href=\"https://80000hours.org/career-guide/top-careers/\">what they have is</a> four careers they consider &quot;very promising, but highly competitive and with low chance of success&quot;, and ten more careers they consider promising. I think 80k also talk about most of the careers you list - if not all the specific sub-categories. And the 80k website actually <a href=\"https://80000hours.org/career-guide/how-to-choose/\">actively advises against narrowing down based on what you're interested in</a>, and emphasises <a href=\"https://80000hours.org/career-guide/framework/personal-fit/\">the importance of personal fit</a>.</p>\n", "parentCommentId": null, "user": {"username": "Jess_Whittlestone"}}, {"_id": "AXRmuWmAfZcTCAYkC", "postedAt": "2014-12-01T17:43:38.931Z", "postId": "YCTHxP6tcT4FcDwki", "htmlBody": "<p>Most of what I said was not attempting to represent 80k at all, though--it was largely based on how I observed real EAs making career decisions, which somehow often got framed as &quot;tech vs. trading&quot; (possibly vs. academia) despite 80k's excellent advice!</p>\n<p>The sentence that you picked out did end &quot;...and ten or so other second- or third-tier options&quot;, which was my understanding of how that list was organized--perhaps the headings were different the last time I read it or something. At any rate, three of the second four are dominated in the sub-rankings by one of the first four, so I think it's fair to call them &quot;second-tier&quot; based on that, even if the headings don't make it explicit.</p>\n<p>(Edited for grammar)</p>\n", "parentCommentId": "kxesZtPeyWsiD5k69", "user": {"username": "Ben_Kuhn"}}, {"_id": "hJmJS8v6uY5rAaCag", "postedAt": "2014-12-01T17:55:20.651Z", "postId": "YCTHxP6tcT4FcDwki", "htmlBody": "<p>Yeah, fair - the way I read it at the beginning sounded more like the whole thing was talking about 80k than perhaps it was. Anyway, just wanted to make clear that I think 80k very much agrees with most (if not all) or what you're saying here :)</p>\n", "parentCommentId": "AXRmuWmAfZcTCAYkC", "user": {"username": "Jess_Whittlestone"}}, {"_id": "kzyPfcoww7DDwZmL2", "postedAt": "2014-12-01T19:03:37.301Z", "postId": "YCTHxP6tcT4FcDwki", "htmlBody": "<p>One example is <a href=\"http://thesegovia.com/\">Segovia</a>.</p>\n", "parentCommentId": "Eogbfec4oQCGTwqTH", "user": {"username": "Peter_Hurford"}}, {"_id": "2DsDyHbAJ5Yake5Ny", "postedAt": "2014-12-02T03:29:44.517Z", "postId": "YCTHxP6tcT4FcDwki", "htmlBody": "<p>This actually isn't a bad idea, something like the IT industry in India.  Dani Rodrik keeps making the point that the labor force in many developing nations is making the transition directly from low productivity agriculture jobs to low productivity service jobs <a href=\"http://www.project-syndicate.org/commentary/dani-rodrikdeveloping-economies--missing-manufacturing\">without going through high productivity manufacturing jobs</a> that have traditionally led to the formation of a middle class.  Some way to get people trained for high productivity service jobs, like in IT, could be really helpful for economic development, although there is probably a massive educational gulf to cover.   The power grid would need some work to build a steady IT industry, too.  </p>\n<p>Rodrik's <a href=\"https://www.youtube.com/watch?v=689F2P5MYb0\">talk</a> on this and some of his writings (<a href=\"http://www.project-syndicate.org/commentary/are-services-the-new-manufactures-by-dani-rodrik-2014-10\">1</a>) are the most informative I have seen in a while.    </p>\n", "parentCommentId": "Eogbfec4oQCGTwqTH", "user": {"username": "Phil_Thomas"}}, {"_id": "8bHn4osHKStaGuCAG", "postedAt": "2014-12-02T04:55:14.377Z", "postId": "YCTHxP6tcT4FcDwki", "htmlBody": "<p>I think it's worth considering avoiding jobs/careers that are somewhat likely to be automated in the near future. Pharmacy and accounting seem like they probably fall into this category. Most jobs in transportation will probably be gone in the next two decades.</p>\n", "parentCommentId": null, "user": {"username": "MasonHartman"}}, {"_id": "cmesQW7pBSD4huM4t", "postedAt": "2014-12-02T11:29:17.743Z", "postId": "YCTHxP6tcT4FcDwki", "htmlBody": "<p>Neat!</p>\n<p>If you're looking for cool socially-oriented for-profits in the developing world, maybe we could open up the question to the FB group. </p>\n", "parentCommentId": "kzyPfcoww7DDwZmL2", "user": {"username": "kdbscott"}}, {"_id": "2jrQzMm8QDWM2bJYb", "postedAt": "2014-12-02T21:15:24.416Z", "postId": "YCTHxP6tcT4FcDwki", "htmlBody": "<p>A couple examples I've run across:\nDataWind (<a href=\"http://en.wikipedia.org/wiki/DataWind)\">http://en.wikipedia.org/wiki/DataWind)</a>, which is now at a more mature stage.\nWent to a talk by one of the founders recently. They made a really cheap tablet and internet services that work over 2G, which opens up the market of large sections of India currently without internet access. I think they could end up being quite successful.</p>\n<p>A early stage example is EyeCheck (<a href=\"http://www.eyechecksolutions.com/)\">http://www.eyechecksolutions.com/)</a>, started by a couple of engineers out of undergrad. They're developing a tool to improve diagnosis of vision problems to increase efficiency of providing glasses (think they're starting working with NGOs running vision camps).</p>\n", "parentCommentId": "7gXpb7dydBZxcjwfb", "user": {"username": "William_S"}}, {"_id": "2CXe4kLtmRwtYJxTL", "postedAt": "2014-12-02T21:22:27.385Z", "postId": "YCTHxP6tcT4FcDwki", "htmlBody": "<p>I know someone who would be interested in looking through a list of organizations like this right now (hoping to find places to work).</p>\n", "parentCommentId": "cmesQW7pBSD4huM4t", "user": {"username": "William_S"}}, {"_id": "udT4h38zMuq6wWKEx", "postedAt": "2014-12-03T02:36:42.018Z", "postId": "YCTHxP6tcT4FcDwki", "htmlBody": "<p>Why would a country invest in lower-productivity industries? If a country is moving to low productivity service jobs it's probably because high productivity jobs are not available.</p>\n", "parentCommentId": "2DsDyHbAJ5Yake5Ny", "user": {"username": "Larks"}}, {"_id": "hqqkJkzkMDvYyNeQv", "postedAt": "2014-12-03T17:56:30.077Z", "postId": "YCTHxP6tcT4FcDwki", "htmlBody": "<p>Just adding a few more clarifications of our views here:</p>\n<ul>\n<li>The current list is just the careers that we've found promising among those we've investigated, but we haven't yet investigated very many. There's definitely many other good options out there.</li>\n<li>We also include <a href=\"https://80000hours.org/career-guide/framework/learning-value/\">'learning value'</a> in our framework, to flag the value of doing things you don't already know much about.</li>\n<li>Many of these career options are already listed on the 'other careers we'd like to investigate' list <a href=\"https://80000hours.org/career-guide/top-careers/career-profiles/\">here</a></li>\n</ul>\n<p>I really like the idea of having a list of promising careers we haven't investigated yet that includes a couple of sentences of explanation, like you've done here, so I'll probably add a page like that in the next iteration of the site. Thanks for suggesting it.</p>\n<p>You're also right that if you want to coordinate with the EA community, then there's extra value from doing stuff that other EAs aren't doing. We don't include that in our guide, however, because the guide isn't aimed only at EAs. I think this is an important consideration that's often neglected though, so I'm really pleased to see it being discussed here.</p>\n", "parentCommentId": "kxesZtPeyWsiD5k69", "user": {"username": "Benjamin_Todd"}}, {"_id": "hsvj8q8xSpp2jj596", "postedAt": "2014-12-03T18:00:46.502Z", "postId": "YCTHxP6tcT4FcDwki", "htmlBody": "<p>We've started to make more and more comparisons at 80,000 Hours e.g. we recommend consulting, tech ent and quant trading, but not investment banking, law or medicine, although these are all in the category of &quot;generally good competitive jobs&quot;. I hope for many more comparisons like this when we've prepared more career profiles.</p>\n<p>We've also found that people find lists like these very useful in our coaching. There are often options that people have overlooked but might actually be promising, or there were aware of but weren't aware of the arguments in favor of them being high-impact.</p>\n", "parentCommentId": "Mvvwzi98wCXkzstJh", "user": {"username": "Benjamin_Todd"}}, {"_id": "D57MrBW4BJyH5n4LY", "postedAt": "2014-12-03T23:10:58.583Z", "postId": "YCTHxP6tcT4FcDwki", "htmlBody": "<p>It's not that a country is investing in low productivity industries, this is just what is naturally happening.  Poor people from the countryside are moving to cities for a marginally better life, but they're selling trinkets on the street when in the past they may have been manufacturing the trinkets.  The point is to figure out how to encourage high productivity jobs, not just observe that they're unavailable.    </p>\n", "parentCommentId": "udT4h38zMuq6wWKEx", "user": {"username": "Phil_Thomas"}}, {"_id": "ddm4JLdpZZbykzaCs", "postedAt": "2014-12-05T07:30:24.760Z", "postId": "YCTHxP6tcT4FcDwki", "htmlBody": "<p>Re: random solid jobs.</p>\n<ul>\n<li><p>Being a dentist is much better than being a doctor according to <a href=\"https://benbrownmd.wordpress.com/2010/06/20/informedconsent/\">this guy</a>; ctrl-f &quot;dentist&quot; for commentary.</p>\n</li>\n<li><p>Indeed.com has a cool salary estimator tool; <a href=\"http://t.co/justtUQrVk\">here</a> is an example usage examining specialties within software development, but it can also easily be used to compare occupations.</p>\n</li>\n<li><p>There are lots of threads on the internet about this, e.g. <a href=\"http://www.reddit.com/r/AskReddit/comments/1bcsal/redditors_who_make_more_than_100k_per_year_what/\">this one</a> and <a href=\"http://www.reddit.com/r/AskReddit/comments/2m2lv5/what_are_some_surprising_professions_where_the/\">this one</a> and <a href=\"http://lesswrong.com/lw/f5v/economy_gossip_open_thread/\">this one</a>.</p>\n</li>\n<li><p>My general impression is that certain blue collar occupations like cop, prison warden, plumber, welder, oil rig worker, etc. can be lucrative if you're operating in the right area.  (Cops/prison wardens in areas with solvent governments have pensions that can be factored in.)</p>\n</li>\n<li><p>I heard somewhere that government jobs typically hire based on an aptitude test rather than degrees, and economist Steven Landsburg <a href=\"http://webcache.googleusercontent.com/search?q=cache:http://www.thebigquestions.com/2011/03/01/wisconsins-smoking-gun/\">thinks</a> that they pay more on average.</p>\n</li>\n</ul>\n", "parentCommentId": null, "user": {"username": "John_Maxwell_IV"}}, {"_id": "dC8hfSZDJ77kXce6W", "postedAt": "2014-12-09T23:33:52.041Z", "postId": "YCTHxP6tcT4FcDwki", "htmlBody": "<p>I've been meaning to contact 80,000 Hours with a suggestion they look at (and hopefully write something about) Multi-Level Marketing (MLM) as a viable career option. I have first-hand experience and can thus share a bit from my point of view.</p>\n<p><em>Basics</em>. MLM is a different way for companies to sell their product: rather than having stores display their products on their shelves, they ship directly to customers. Customers who tell others about the product can receive money from the company as a &quot;thank you&quot; for word-of-mouth advertising.</p>\n<p><em>Income</em>. My parents have been in an MLM company for about 8 years. They have reached an income of about $80,000/year. A person they directly know in the company has received over $500,000/year. Others within this company make several $million per year. While these results are not common, they are not impossible. This makes MLM potentially one of the highest-paid careers for those who want to Earn to Give (E2G).</p>\n<p><em>Influence</em>. A second component of an MLM career is that you end up talking to hundreds of people, many of whom regard you as someone who helps them with their business. Many of these people become close friends. This means that an MLM career could provide the ability to influence others. For example you could encourage everyone who also becomes financially successful thanks to your invitation and help, to give 10% of their income to charity.</p>\n<p><em>Freedom</em>. This type of work allows for a very flexible schedule and often a lot of free time. My parents have taken many month-long vacations with <em>no</em> drop in their monthly income. Residual income is one of the most alluring aspects of MLM.</p>\n<p><em>Harm</em>. On the harm side, not all MLM companies provide good products. If you are able to find a good company (I firmly believe my parents have), you could also be encouraging people to use products that are healthier for them, or provide benefits over the conventional ones. This would not be a misalignment with your values.</p>\n<p>All these factors make me think MLM is a career path that should be at least considered within the EA community. I look forward to your replies.</p>\n", "parentCommentId": null, "user": {"username": "yboris"}}, {"_id": "NzD6yN98rDnNxYAdT", "postedAt": "2014-12-10T03:31:45.388Z", "postId": "YCTHxP6tcT4FcDwki", "htmlBody": "<p>How do you address the criticism that MLM schemes are essentially pyramid schemes, that rely on constantly recruiting more gullible people to sign up?</p>\n", "parentCommentId": "dC8hfSZDJ77kXce6W", "user": {"username": "Larks"}}, {"_id": "Kf5hjRseuwKmXbGzk", "postedAt": "2014-12-10T15:58:12.448Z", "postId": "YCTHxP6tcT4FcDwki", "htmlBody": "<p>There are many things to say about it. Pyramid schemes are illegal in the US. And it all depends on the business plan (compensation plan) the company offers. Some companies will allow you to earn a decent income if you just get people to buy products. If the products are good, I see no harm. </p>\n<p>There is a harm if you lie and promise people riches (that seems unethical); there is harm if you let people believe they will become rich (lie by omission is still a lie in my 'book'). There is harm if you lie about the products. The last harm seem identical to one present if you just become a car salesman (or any kind of salesman).</p>\n", "parentCommentId": "NzD6yN98rDnNxYAdT", "user": {"username": "yboris"}}, {"_id": "nJ4XS2yfvTsbTEMRu", "postedAt": "2014-12-15T02:35:15.326Z", "postId": "YCTHxP6tcT4FcDwki", "htmlBody": "<p>My argument is that this is not really an accurate description. The difference between selling trinkets and manufacturing jobs is that the latter requires a large amount of upfront capital investment. If people are not doing this, we need to work out why and address it. Once it is viable, capital is naturally invested where its marginal product is highest, which in turn increases the marginal product of its compliments, like labour. As the wage rate is equal to the marginal productivity of labour, this ultimately increases the wage rate.</p>\n", "parentCommentId": "D57MrBW4BJyH5n4LY", "user": {"username": "Larks"}}, {"_id": "CdKf8JPDP4Towyapy", "postedAt": "2014-12-15T23:31:24.186Z", "postId": "YCTHxP6tcT4FcDwki", "htmlBody": "<blockquote>\n<p>Once it is viable, capital is naturally invested where its marginal product is highest, which in turn increases the marginal product of its compliments, like labour.</p>\n</blockquote>\n<p>I think the main challenge is finding out how to make investments viable, which is really hard for a number of reasons that are often grouped into the term &quot;poor business environment&quot;.  It seems like the debate centers around whether anything can be done to improve the business environment, or if we're better off treating the symptoms of poverty while economies sort themselves out. </p>\n<p>What you describe above would happen in an efficient market, but stock markets barely exist in most sub-saharan countries so I think most SSA economies are operating far from efficiently.  It seems like private equity deals, or doing due diligence for PE deals could have a big impact.  Most private equity in SSA is <a href=\"http://www.ey.com/GL/en/Industries/Private-Equity/Private-equity-value-creation-in-Africa\">growth equity</a> rather than leveraged buyouts, and the counterfactual is probably some other risky investment that might not have as much development impact.  This is an understudied area, but I'm excited to see the results of this <a href=\"http://www.poverty-action.org/sme/competitivefund/project05\">research</a> from IPA.      </p>\n", "parentCommentId": "nJ4XS2yfvTsbTEMRu", "user": {"username": "Phil_Thomas"}}, {"_id": "pdDfHcwXPCRA7Cf3H", "postedAt": "2014-12-18T04:33:25.004Z", "postId": "YCTHxP6tcT4FcDwki", "htmlBody": "<p>Medical science liaison, as a high-paid career.  It's like a higher-end drug rep, typically requires a PhD.  Good fallback for someone getting a PhD in something biomedical-related.  Glassdoor estimates the average salary as $140K.  (This is particularly striking given that other salaries seem to be lowballed on Glassdoor.  Computer engineer is $71K, for example.)  </p>\n<p>It seems to be fairly easy to move back and forth between being an MSL and doing other jobs in the biotech/pharma industries.  </p>\n", "parentCommentId": null, "user": {"username": "Lila"}}, {"_id": "T4zm72Es8nDWdvqwN", "postedAt": "2014-12-22T16:00:48.986Z", "postId": "YCTHxP6tcT4FcDwki", "htmlBody": "<p>My worry with these is that they're high paying right now, but the skills are quite narrow, so aren't robustly high paying in the future. e.g. Truck drivers could get automated; oil &amp; gas industry jobs are vulnerable to the oil price going down.</p>\n<p>Status also matters for your career capital and general influence, so I think that's a real concern too, rather than just an bad reason these careers get overlooked.</p>\n", "parentCommentId": "CFgGY3MANeKGQ9jJK", "user": {"username": "Benjamin_Todd"}}, {"_id": "GB9fDdSthrKQyCRKq", "postedAt": "2014-12-22T17:21:51.502Z", "postId": "YCTHxP6tcT4FcDwki", "htmlBody": "<p>Some trades like plumbing have had high wages for a while, and could be a good fit for some people. Income would probably be the only good outcome though.</p>\n", "parentCommentId": "T4zm72Es8nDWdvqwN", "user": {"username": "Robert_Wiblin"}}, {"_id": "3Mw3L4YmYpjgWEsev", "postedAt": "2023-06-10T03:26:20.814Z", "postId": "YCTHxP6tcT4FcDwki", "htmlBody": "<p>In regards to automation in pharmacy (or rather pharmaceutical industry), I agree that preclinical drug discovery is already being highly automated. There is a lot of human capital required though in other subareas that I think will continue to be required. From pharmacists (while more is sold online, selling drugs is highly regulated and requires a specialist for consultation), people who conduct clinical trials, in regulatory affairs, medical affairs and marketing etc.</p>\n", "parentCommentId": "8bHn4osHKStaGuCAG", "user": {"username": "Nina Boxberger"}}, {"_id": "sZS4PoGu9jBjFtNRg", "postedAt": "2023-06-10T03:32:54.364Z", "postId": "YCTHxP6tcT4FcDwki", "htmlBody": "<p>To add some info for MSLs in Germany: It is fairly easy to get in with a bioscience degree as there is a high demand for this role. From what I‘ve seen the expected salary for „beginners“ is about 75k €/year. With five years experience this quickly rises above 100k €/year. Switching between MSL and other Medical Affairs or Marketing seems to be fairly easy when I consider the careers of dozens people I am acquainted with.</p>\n", "parentCommentId": "pdDfHcwXPCRA7Cf3H", "user": {"username": "Nina Boxberger"}}]