[{"_id": "SCD8TXxdDJeMAbNbh", "postedAt": "2022-10-28T11:54:58.882Z", "postId": "YejEjygKjqe2BA2pp", "htmlBody": "<p>wow...seems based...i can't see a reason not to do this!</p>", "parentCommentId": null, "user": {"username": "pfox"}}, {"_id": "AKTnxz4Lc8Z8zkbdg", "postedAt": "2022-10-28T20:39:52.186Z", "postId": "YejEjygKjqe2BA2pp", "htmlBody": "<p>My understanding is that the NHS isn't perfect, but is pretty good at prioritization.  If they're not making the booster available to all, my interpretation is that they don't think it passes their QALY bar.</p>\n<p>Is your view that they're wrong and the death/suffering avoided by additional covid vaccination is pretty high, that individuals should be much more willing to pay for their own protection than the NHS is, or something else?</p>\n", "parentCommentId": null, "user": {"username": "Jeff_Kaufman"}}, {"_id": "FK9WcGqzcDJNYni7J", "postedAt": "2022-10-28T20:55:54.159Z", "postId": "YejEjygKjqe2BA2pp", "htmlBody": "<p>Many individuals are not subject to the same tight resource constraints of the NHS, so I don’t understand why we wouldn’t expect a fraction of individuals to be willing to deploy their own resources to pay for a booster? The efficient frontier for them is simply different.</p>\n", "parentCommentId": "AKTnxz4Lc8Z8zkbdg", "user": {"username": "John_Myers"}}, {"_id": "Jzvimp7k86R2nFAzN", "postedAt": "2022-10-28T21:44:48.445Z", "postId": "YejEjygKjqe2BA2pp", "htmlBody": "<p>\"Pfizer currently intends to sell the vaccine in the US for around $110-130 per dose\"<br>Just to check – this is the sticker price, where the cost is (mostly) covered by insurers (and possibly bargained down from this), right? Not the out-of-pocket cost to most US consumers? This would be another reason to expect lower costs for the UK than this.</p>", "parentCommentId": null, "user": {"username": "Daniel_Eth"}}, {"_id": "FR8mAzooeHtRZHBcn", "postedAt": "2022-10-28T21:48:26.415Z", "postId": "YejEjygKjqe2BA2pp", "htmlBody": "<p>I'd be happy to be on the team and do what I can on social media.</p>\n", "parentCommentId": null, "user": {"username": "rharris"}}, {"_id": "baZCv4ofnxcfrejxQ", "postedAt": "2022-10-28T23:35:04.584Z", "postId": "YejEjygKjqe2BA2pp", "htmlBody": "<p>For some extra context, the NHS offers a free seasonal flu vaccine to vulnerable groups (similar eligibility to the Covid booster), and healthy adults can choose to purchase a seasonal flu vaccine at a pharmacy for about £10. Some people do this, and some employers pay for their employees to get vaccinated. So there is precedent for this kind of thing, and although I doubt it would get rolled out this year, this is a good time to plan for next year.</p>\n", "parentCommentId": "AKTnxz4Lc8Z8zkbdg", "user": {"username": "Khorton"}}, {"_id": "PaWKmzt84NzGPtoaq", "postedAt": "2022-10-29T05:05:55.418Z", "postId": "YejEjygKjqe2BA2pp", "htmlBody": "<p>That's excellent - thank you!</p>\n", "parentCommentId": "FR8mAzooeHtRZHBcn", "user": {"username": "Lawrence Newport"}}, {"_id": "Jy9p4wFW9wZ87KJdd", "postedAt": "2022-10-29T09:02:25.151Z", "postId": "YejEjygKjqe2BA2pp", "htmlBody": "<p>Really love this idea, and would encourage you to\nevaluate additional barriers to getting vaccines in arms.Maybe this could be via basic surveys or interviews or via browsing some medical publications  and talking to vaccine clinic organizers.</p>\n<p>Also curious if there is an existing ( or soon to exist) non profit that might be able to assist financially. Global vaccine shortage and insufficient public health tools amidst a pandemic seems like an important, tractable cause. I’d be interested in helping out if it makes sense.</p>\n<p>Personally I’d be super excited about a “vaccines for all” type program with initial focus on increasing access to — and delivery of —vaccines against pandemic agents with aims to expand globally . Does anyone know what orgs are doing that? I’d also love to see an org that distributed public health tools like masks and provide materials for and potentially hosted local community sessions to assemble lower cost filtration devices like Corsi-Rosenthal boxes. With the amount of air pollution in much of the world now, this could be helpful for mitigating airborne spread of pandemic pathogens as well as harmful air pollution.</p>\n<p>Supply very well could be the main vaccine bottleneck in the UK. In the US, a significant percentage of the population ( I’m forgetting the specifics) has yet to get the bivalent vaccine despite it being free.</p>\n<p>When I got my variant booster it was at the same time as a flu shot and that was convenient and offering a twofer might appeal to some, though it may be a bit late for this year.</p>\n<p>Another issue in the US is with delivery:  healthcare systems here are generally overwhelmed and understaffed. Anecdotally it seems like pharmacies are too. In some places, the paucity of available vaccinators is likely contributing to lower vaccine uptake. Hoping the UK healthcare system is more aptly prepared.</p>\n<p>Thanks for  sharing and really appreciate that you’re thinking about this .</p>\n", "parentCommentId": null, "user": {"username": "more better "}}, {"_id": "LGshpYZruo64KmxpA", "postedAt": "2022-11-02T17:08:06.005Z", "postId": "YejEjygKjqe2BA2pp", "htmlBody": "<p>The way you are assessed for eligibility for a seasonal COVID booster in the UK is a short online questionnaire. I ticked that I \"thought I might be at high risk of COVID\" (I don't, but I want a booster) and was able to book one without being asked for any extra supporting evidence.</p><p>Now, this could be bad if the NHS relies on survey response data to estimate how many people &nbsp;are <i>actually</i> &nbsp;at risk (this seems very unlikely to me, given that they must have much higher quality data on disease rates in the UK). It could also be bad if the UK is constrained on supply of vaccines - but again this seems unlikely to me.&nbsp;</p><p>All in, as a very mild act of civil disobedience, I think it's net-positive, and worth it for me. I'd buy a dose if I was allowed to, but the UK gov won't allow me to...</p>", "parentCommentId": null, "user": {"username": "Matt g"}}, {"_id": "J7YhftEZg59hnjBkt", "postedAt": "2022-11-27T22:23:18.466Z", "postId": "YejEjygKjqe2BA2pp", "htmlBody": "<p>Is it now possible to sign up?</p><p>This petition may be a substitute for the OP plan: <a href=\"https://petition.parliament.uk/petitions/623325\">https://petition.parliament.uk/petitions/623325</a></p><p>A better outcome would increase the NHS rollout, so more people benefit. A (different) successful petition on the above government platform could help with that.</p>", "parentCommentId": null, "user": {"username": "ramana.kumar@gmail.com"}}, {"_id": "LAqcrS4yiwvukeyJ4", "postedAt": "2022-11-29T12:17:21.093Z", "postId": "YejEjygKjqe2BA2pp", "htmlBody": "<blockquote>\n<p>The issue is that there is no option, other than travel to the US, for the majority of willing UK adults to receive a bivalent vaccine.</p>\n</blockquote>\n<p>FWIW if we're resorting to \"vaccine tourism\", it may be possible to get it from Europe rather than the US. I think some people attending the Prague Fall Season were able to buy a vaccine there.</p>\n", "parentCommentId": null, "user": {"username": "BenMillwood"}}, {"_id": "qmEvo8aJKE6NqLpvX", "postedAt": "2022-11-29T12:18:32.342Z", "postId": "YejEjygKjqe2BA2pp", "htmlBody": "<p>If the OP is correct in suggesting that selling the vaccine is already legal and it's just a matter of consumer demand, then I don't see how petitioning the government will help.</p>\n", "parentCommentId": "J7YhftEZg59hnjBkt", "user": {"username": "BenMillwood"}}, {"_id": "iqvQTEbhvWC5BQMHb", "postedAt": "2022-12-02T11:08:11.860Z", "postId": "YejEjygKjqe2BA2pp", "htmlBody": "<p>Other places in Europe will certainly provide it.</p>\n", "parentCommentId": "LAqcrS4yiwvukeyJ4", "user": {"username": "Duarte M"}}, {"_id": "yt2dCjkAyEfhqrtYR", "postedAt": "2022-12-02T11:15:13.848Z", "postId": "YejEjygKjqe2BA2pp", "htmlBody": "<p>I very much doubt the reason it’s won’t be made privately available is due to Pfizer thinking it wouldn’t be worth it. More likely it’s down to sufficient stock being available in the NHS for the cohort that will be receiving it, and the government not wanting to add more demand, which would increase the cost per dose for the NHS.</p>\n<p>It’s perverse, but a likely consequence of the Beveridge style universal healthcare system used in the U.K.</p>\n", "parentCommentId": null, "user": {"username": "Duarte M"}}, {"_id": "GRnHmQ8QZnpAaQ9iQ", "postedAt": "2022-12-03T11:19:30.806Z", "postId": "YejEjygKjqe2BA2pp", "htmlBody": "<p>The suggestion is to treat the COVID vaccine like the flu vaccine, and make it free for those who need it most, and available to buy for those who don't. Making it available for sale doesn't increase costs to the NHS.</p>\n", "parentCommentId": "yt2dCjkAyEfhqrtYR", "user": {"username": "BenMillwood"}}, {"_id": "8ksxXwHbjvLvJs4mn", "postedAt": "2022-12-03T17:50:52.402Z", "postId": "YejEjygKjqe2BA2pp", "htmlBody": "<p>Yes this is true - that might be a very viable option.</p>\n", "parentCommentId": "LAqcrS4yiwvukeyJ4", "user": {"username": "Lawrence Newport"}}]