[{"_id": "L2YKD5XgGYTQwMnnC", "postedAt": "2024-03-25T00:04:48.621Z", "postId": "YEkKJrvWXJBqDFkt3", "htmlBody": "<p>I think \"Beware\" is probably a suboptimal word to be using in the headline because it gives a vibe of \"they're dangerous\" rather than \"they're well meaning but only one piece of the puzzle\". I can't think of a better word, maybe \"Be wary\"? But that's not much better.</p>", "parentCommentId": null, "user": {"username": "Yanni Kyriacos"}}, {"_id": "vLqHNGFJLsjHLcfzx", "postedAt": "2024-03-25T05:09:13.750Z", "postId": "YEkKJrvWXJBqDFkt3", "htmlBody": "<p>I definitely think beware is too strong. I would recommend “discount” or “be skeptical” or something similar.</p>\n", "parentCommentId": "L2YKD5XgGYTQwMnnC", "user": {"username": "Harrison D"}}, {"_id": "GW3dEM2ccX9uJudu6", "postedAt": "2024-03-25T05:14:11.563Z", "postId": "YEkKJrvWXJBqDFkt3", "htmlBody": "<p>I like \"“be skeptical\"! thanks for the feedback :)</p>", "parentCommentId": "vLqHNGFJLsjHLcfzx", "user": {"username": "Yanni Kyriacos"}}, {"_id": "iMBeJhqRpAEgRPJwo", "postedAt": "2024-03-25T13:24:54.140Z", "postId": "YEkKJrvWXJBqDFkt3", "htmlBody": "<p>I'd be quite interested in reading a more fleshed-out version of this, if you were considering whether that was worth your time. What dimensions of advice about a given career path are you seeing people given that should be discounted without domain success?</p>", "parentCommentId": null, "user": {"username": "bec_hawk"}}, {"_id": "ejBqkhtbEY6jEg4mj", "postedAt": "2024-03-25T13:35:44.081Z", "postId": "YEkKJrvWXJBqDFkt3", "htmlBody": "<p>Regarding your last paragraph, I see the Profile 1 vs Profile 2 axis as basically distinct from the Doer vs Thinker axis. People can spend years in large companies without ever needing or developing a get sh*t done mentality, and otoh starting an EA org and rapidly iterating can be a great way to develop or exercise that skill (see e.g. BlueDot Impact, AI-Plans.com). Maybe it's that you're leaving out a Profile 3 - people who start their career in (or very quickly switch into) EA but by starting a new thing rather than working their way up the ladder of an EA org. (Though the starting of a new thing could technically happen within an existing org as well).</p>", "parentCommentId": null, "user": {"username": "bec_hawk"}}, {"_id": "2LoXDjvzLHhMrDkS9", "postedAt": "2024-03-25T16:03:09.821Z", "postId": "YEkKJrvWXJBqDFkt3", "htmlBody": "<p>Yep, seems true that useful advice comes from people who were in a similar situation and then solved the problem.</p>\n<p>Does it happen often in EA that unqualified people give a lot of advice? 80,000 hours comes to mind, but you would hope they're professional enough to having thought of this failure mode.</p>\n", "parentCommentId": null, "user": {"username": "niplav"}}, {"_id": "8tFifwrreTqJMXF3s", "postedAt": "2024-03-25T16:15:28.664Z", "postId": "YEkKJrvWXJBqDFkt3", "htmlBody": "<p>I sort of agree, but a couple of points:</p><ol><li>&nbsp;I think advice can be useful from those who have tried something but failed (though plausibly many of those who <i>eventually </i>succeeded will have initially failed).&nbsp;<ol><li>If we only seek advice from those who have quite easily succeeded, we risk hearing a biased view of the world that may not be the best advice for us. We may have more in common with those who failed, and may be better off hearing from these people in order to avoid their mistakes.</li></ol></li><li>Presumably, we would like to hear from a broad range of people who have been successful (possibly at different things).&nbsp;<ol><li>In order to hear all of these different views, it would be useful for someone to research, collate, and summarise them. But to do this well, what actually matters are research and communications skills - <i>not</i> necessarily the ability to do the things that the successful people have done.&nbsp;<ol><li>For example, you don't have to be a successful entrepreneur in order to interview 50 entrepreneurs and write about what they have in common. In this case, we should take into account the writer's previous success at being a researcher and writer, <i>not </i>their entrepreneurial success.</li></ol></li></ol></li></ol>", "parentCommentId": null, "user": {"username": "Matt_Sharp"}}, {"_id": "pphefPbsmwLwECAix", "postedAt": "2024-03-25T19:08:35.968Z", "postId": "YEkKJrvWXJBqDFkt3", "htmlBody": "<p>The general point you're making seems valuable.</p>\n<p>One piece of pushback: it seems like you’re implying that success or experience ‘doing things’ = selling products / making money. I’d like to think that not all altruistic work can be aided by this type of experience. Altruism is not a consumer product.</p>\n<p>If your post is just trying to make the point that people who have experience around X (private sector or otherwise) are better equipped to give advice about X, well then yeah, I don’t think anybody will argue with you about that.</p>\n", "parentCommentId": null, "user": {"username": "blehrer"}}, {"_id": "L5deYnEQxsXbYGHb9", "postedAt": "2024-03-25T22:49:04.076Z", "postId": "YEkKJrvWXJBqDFkt3", "htmlBody": "<blockquote><p>I think EAs spend a lot of time thinking about things. They think about things because EAs want to be smart, and smart people spend lots of time thinking. That’s why EAs make enourmous google docs, substacks, tweet a lot, go on forums and become researchers.</p></blockquote><p>This seems false to me. People spend a lot of time thinking about things because they want to come to the right answer, not because they are cargo-culting what smart people do. In fact EAs probably spend more time thinking about things than typical smart people do.</p>", "parentCommentId": null, "user": {"username": "Larks"}}, {"_id": "Mse3Lbte5wNnAyvgX", "postedAt": "2024-03-26T08:49:55.261Z", "postId": "YEkKJrvWXJBqDFkt3", "htmlBody": "<p>That wasn’t my interpretation of this section. I took “be smart” to mean  like  ‘make smart career decisions’, not ‘be Smart^TM’</p>\n", "parentCommentId": "L5deYnEQxsXbYGHb9", "user": {"username": "bec_hawk"}}]