[{"_id": "pkKs9cmvvciJAexjF", "postedAt": "2023-10-05T14:02:13.436Z", "postId": "YHoHn7KeQLBPjJ5jb", "htmlBody": "<p>Nice</p>", "parentCommentId": null, "user": {"username": "NunoSempere"}}, {"_id": "m9ZorbwQYPs68jgor", "postedAt": "2023-10-05T14:27:02.902Z", "postId": "YHoHn7KeQLBPjJ5jb", "htmlBody": "<p>Some pushback on this:</p><p>I think this is a limited model for understanding meetings. (Citing from the <a href=\"https://www.cambridge.org/core/books/cambridge-handbook-of-meeting-science/BF8D238A6062347DC177731365760380\">handbook of meeting science</a>) there are different cognitive processes taking place during meetings (usually several in one meeting):</p><ul><li>Problem identification and construction</li><li>Information exchange/information sharing</li><li>Idea generation and brainstorming</li><li>Idea evaluation and selection</li><li>Implementation planning</li></ul><p>When I conduct meetings as a project manager (or participate in team meetings) I rarely have a clear \"decision brief meeting\" or a \"planning and course of action development\". All of these may take place in one meeting depending on the scope of the decision(s) to be made. If a decision is consequential enough I can understand the need for fragmenting these processes into different meetings.</p><p>Additionally, other processes take place that are worth highlighting:</p><ul><li>Trust and psychological safety</li><li>Support for innovation</li><li>Conflict</li></ul><p>I think the main takeaway from your post would be for readers to highlight the purposes that the meetings they plan serve and approach meeting planning with more intention.</p>", "parentCommentId": null, "user": {"username": "CristinaSchmidtIbáñez"}}, {"_id": "ht8ePtPXkrDdK4ckh", "postedAt": "2023-10-11T15:10:36.958Z", "postId": "YHoHn7KeQLBPjJ5jb", "htmlBody": "<p>Thanks for this. This comes from a relatively top down (but locally administered) org structure which may not reflect exactly on other organizations.&nbsp;</p><p>We do have a structure that the commanders/decision makers may not always be present when we discuss things due to them needing to speak to higher echelons or other commitments and this may not reflect outside of a governmental structure.</p><p>I'm adding the handbook to my reading list, though and hope to update this when I do. (Rough that it costs so much though!)</p>", "parentCommentId": "m9ZorbwQYPs68jgor", "user": {"username": "Weaver"}}]