[{"_id": "XGKtdCpFHkg2EtPyd", "postedAt": "2023-01-18T06:17:12.300Z", "postId": "Yi2vGpsAQftuA9DHj", "htmlBody": "<p>My impression is that many people are subconsciously or implicitly aware of this dynamic, and that contributes to the high level of interest in topics or decisions that are likely to set the tone for the future. I think many people are acting in ways that they hope <i>would</i> set the standard precisely because they want the movement to be defined in the ways they act. I don't mean to single out any particular point of view as being motivated in this way, because in my experience most of the views being expressed here are sincerely held and principled.</p><p>Nevertheless I applaud your reminder, because I think becoming <i>consciously</i> aware of what is going on could cause people to be more conscientious about defining those norms. It has shades of Nietzsche's \"<a href=\"https://en.wikipedia.org/wiki/Eternal_return\">Eternal Recurrence</a>\", which I quite enjoy.</p>", "parentCommentId": null, "user": {"username": "ben.smith"}}, {"_id": "ztitxTcTide5pdvro", "postedAt": "2023-01-18T15:13:15.543Z", "postId": "Yi2vGpsAQftuA9DHj", "htmlBody": "<p>I think this is generally true, but might benefit from some examples or more specifics.</p>\n", "parentCommentId": null, "user": {"username": "Parrhesia"}}, {"_id": "ZWDcbyCKLRNZP6CKy", "postedAt": "2023-01-19T00:59:41.185Z", "postId": "Yi2vGpsAQftuA9DHj", "htmlBody": "<p>Rob -- I guess it's valid and unobjectionable to say we should try to stay conscious about what norms we're creating, following, and reinforcing, with a view towards how we shape the future culture of EA.</p><p>However, it sounds like you might be alluding to a somewhat more specific claim that certain good norms are currently at risk of being compromised or corrupted, and/or &nbsp;certain bad norms are at risk of spreading.</p><p>I wonder if you could spell this out a bit more? I'm not sure what your intended takeaway is, or in what direction you're trying to nudge us (e.g. towards more 'inclusive kindness', or towards more 'epistemic integrity'?).</p>", "parentCommentId": null, "user": {"username": "geoffreymiller"}}, {"_id": "MfxsCyhLFphqFkTCs", "postedAt": "2023-01-19T02:28:29.643Z", "postId": "Yi2vGpsAQftuA9DHj", "htmlBody": "<p>From my perspective, there's currently a sort of tug-of-war happening between three EA orientations (which already existed, though things like the Bostrom e-mail have inspired people to put them into words and properly attend to them):</p><ul><li>one that's worried EA risks losing sight of principles like \"honesty\" and \"open discourse\" (and maybe \"scientific inquiry and scholarship\"),</li><li>one that's worried EA risks losing sight of principles like \"basic human compassion\" and \"care and respect for everyone regardless of life-circumstance\" (and potentially also \"scientific inquiry and scholarship\", with a different model of what the science says),</li><li>and a more pragmatic \"regardless of all that stuff, the PR costs and benefits are clear and those considerations dominate the utilitarian calculus here\".</li></ul><p>Obviously these aren't mutually exclusive, at least at that level of abstraction. You can simultaneously be worried about PR risk, about EAs' epistemic integrity eroding, <i>and</i> about EAs' interpersonal compassion eroding. But a lot of the current disagreement seems to pass through EAs putting different relative weightings on these three classes of consideration.</p><p>On the current margin, I want to encourage more discussion that's coming from the first or second perspective, relative to the third perspective. And I want the third perspective to flesh out its models more, and consider a larger option and hypothesis space — in part just so it's easy to tell when EAs have models of the strategy space that they're drawing on at all. (Versus arguments based more on mental motions like \"feel socially unsafe 🢡 generate post-facto arguments for why the socially-safe-feeling local action is also the best consequentialist strategy\".)</p>", "parentCommentId": "ZWDcbyCKLRNZP6CKy", "user": {"username": "RobBensinger"}}, {"_id": "v22xzmJhAMHu2bBAv", "postedAt": "2023-01-19T10:30:56.833Z", "postId": "Yi2vGpsAQftuA9DHj", "htmlBody": "<p>I think this is generally false, but might benefit from some examples or more specifics.</p><p>(Referring to the OP, not the comment)</p>", "parentCommentId": "ztitxTcTide5pdvro", "user": {"username": "rohinmshah"}}, {"_id": "b2dM5AR3jitqonhjq", "postedAt": "2023-01-19T17:11:45.993Z", "postId": "Yi2vGpsAQftuA9DHj", "htmlBody": "<p>Rob -- this is an excellent clarification; thank you. I agree that there are these three orientations in some tension within EA, and that it's important to be honest about some of these trade-offs, and their implications for the future social and intellectual and ethical norms in EA.&nbsp;</p><p>I guess I'm mostly in the first camp.&nbsp;</p><p>I'm also sympathetic to taking PR issues seriously -- but I think some EA organizers have sometimes been rather inept and amateurish at handling the PR issues, and aren't working with an accurate model of how PR crises flare up and die down, or of how much to say, and what to say, when the crises at at their peak.&nbsp;</p><p>IMHO, we need to realize that any sufficiently large, powerful, and well-funded movement (like ours) will reliably and frequently experience PR crises, some of which arise from deliberate PR attacks from individuals or organizations hostile to our mission.&nbsp;</p><p>That will be the new normal. We'll have to learn to live with it, and to have the PR crisis response teams in place to deal with it. And we'll need the emotional resilience to accept that not everyone will like, love, or respect what we do -- and that's OK.</p>", "parentCommentId": "MfxsCyhLFphqFkTCs", "user": {"username": "geoffreymiller"}}]