[{"_id": "Ez3yPFodLja3AtFPv", "postedAt": "2015-03-03T16:23:51.463Z", "postId": "YiFdK2D8xq2YxyhNi", "htmlBody": "<p>Neat idea to simply set up a spreadsheet for it.</p>\n", "parentCommentId": null, "user": {"username": "Vincent_deB"}}, {"_id": "Y4n7fFkPAyFEvweYi", "postedAt": "2015-03-03T18:05:48.063Z", "postId": "YiFdK2D8xq2YxyhNi", "htmlBody": "<p>I've been thinking about something like this as well--it does seem promising.</p>\n<p>Figuring out how to clear a set of multiple transactions is actually an interesting problem. You need to:</p>\n<ul>\n<li>Figure out how to allocate the surplus from trade</li>\n<li>Figure out a set of transactions that optimizes both convenience and gift amount</li>\n<li>Check that everyone is honest/resolve any disputes</li>\n</ul>\n", "parentCommentId": null, "user": {"username": "Ben_Kuhn"}}, {"_id": "SGmAebHFpx55idjoy", "postedAt": "2015-03-03T23:17:15.992Z", "postId": "YiFdK2D8xq2YxyhNi", "htmlBody": "<p>An important point which it might be worth flagging in the post: it's helpful to get signups from people in countries which have a range of tax deductible EA donation targets. Even if it doesn't help them donate to somewhere they couldn't before, they can help those in other countries to do so. So this is a way to do some extra good with your donations.</p>\n", "parentCommentId": null, "user": {"username": "Tom_Ash"}}, {"_id": "2ivAimraKfWD6bjD7", "postedAt": "2015-03-03T23:19:38.910Z", "postId": "YiFdK2D8xq2YxyhNi", "htmlBody": "<p>I've helped set up a system like this for EA grant-making organisations and would be happy to share the tools I've developed for this.</p>\n", "parentCommentId": null, "user": {"username": "Tom_Ash"}}, {"_id": "qR7WZZEMSk57iqFH9", "postedAt": "2015-03-04T09:39:42.572Z", "postId": "YiFdK2D8xq2YxyhNi", "htmlBody": "<p>Thanks, Tom! Please do share.</p>\n", "parentCommentId": "2ivAimraKfWD6bjD7", "user": {"username": "Brian_Tomasik"}}, {"_id": "noLY96uE63vJNnMRE", "postedAt": "2015-03-04T09:47:21.452Z", "postId": "YiFdK2D8xq2YxyhNi", "htmlBody": "<p>Great points. Honesty would become tricky if this became an actual company. In the short run, verification would be worked out by communication between the people exchanging donations and perhaps sharing donation receipts. In the long run, maybe the trading company could hire people to do this verification.</p>\n<p>I was thinking surplus could be split 50-50. In a bigger market, I suppose surplus could be apportioned based on supply and demand, but it might still make sense to split 50-50 for the sake of fairness.</p>\n", "parentCommentId": "Y4n7fFkPAyFEvweYi", "user": {"username": "Brian_Tomasik"}}, {"_id": "KZTYK6bmym5wJd97w", "postedAt": "2015-03-04T09:51:42.359Z", "postId": "YiFdK2D8xq2YxyhNi", "htmlBody": "<p>I will do after talking to everyone, though it's pretty inside-baseball. I've described it at .impact meetings.</p>\n", "parentCommentId": "qR7WZZEMSk57iqFH9", "user": {"username": "Tom_Ash"}}, {"_id": "5i6z4sKWCANkFAYPA", "postedAt": "2015-03-04T13:55:03.134Z", "postId": "YiFdK2D8xq2YxyhNi", "htmlBody": "<p>I am mildly worried that connecting strangers to make honor-system donation trades could lead to a dispute.  There are going to be more and more new faces around if the various EA growth strategies this year pan out.  The fact that donation trading has been going on smoothly until now means folks might get overly relaxed, and it only takes one publicized dispute to really do damage to the culture.  Even if no one is outright dishonest, miscommunication could lead to a someone thinking they have been wronged to the tune of thousands of dollars.</p>\n<p>I don't think that communication between the donors, as Brian <a href=\"http://effective-altruism.com/ea/fu/can_we_set_up_a_system_for_international_donation/2vp\">mentions</a>, is fully satisfactory.  Even if everyone promises to send receipts afterwards, you still have Byzantine generals' problems.  One idea is that we find someone at CEA who, at the least, can be listed as an email contact to which two donors can send their agreement before they execute, just so there's a records and so the CEA person can point out any obvious confusion.  I think this could be a very efficient use of CEA time, especially if it increases trust and therefore makes more trades possible.</p>\n", "parentCommentId": null, "user": {"username": "Jess_Riedel"}}, {"_id": "z8sBL8NpytkZjEYgi", "postedAt": "2015-03-04T15:29:55.612Z", "postId": "YiFdK2D8xq2YxyhNi", "htmlBody": "<p>It seems good to have an arbiter...</p>\n", "parentCommentId": "5i6z4sKWCANkFAYPA", "user": {"username": "RyanCarey"}}, {"_id": "4v97hqN9CYAooJvay", "postedAt": "2015-03-05T06:01:30.853Z", "postId": "YiFdK2D8xq2YxyhNi", "htmlBody": "<p>Great point! Normally such problems are handled by an escrow, but that won't work here, since the individual donors need to make the donations, not a third party.</p>\n<p>In theory, one solution for minimizing risk would be to donate incrementally, e.g., only $1K at a time, so that the maximum loss would be $1K. But it would be burdensome to do so many small donations and share receipts after each one.</p>\n", "parentCommentId": "z8sBL8NpytkZjEYgi", "user": {"username": "Brian_Tomasik"}}, {"_id": "wnYrbGSJYCeesYhH4", "postedAt": "2015-03-07T00:16:45.336Z", "postId": "YiFdK2D8xq2YxyhNi", "htmlBody": "<p>Brian, would you (or someone you find) be happy to be the arbiter?</p>\n", "parentCommentId": "5i6z4sKWCANkFAYPA", "user": {"username": "Tom_Ash"}}, {"_id": "x9ZJfNRiwhCS2qELz", "postedAt": "2015-03-07T16:46:11.155Z", "postId": "YiFdK2D8xq2YxyhNi", "htmlBody": "<p>In the near term I'd be glad to do that, since I don't expect a high work load. In the longer term, if trading picks up steam, we can find something more permanent.</p>\n", "parentCommentId": "wnYrbGSJYCeesYhH4", "user": {"username": "Brian_Tomasik"}}, {"_id": "HvKTbsPRd5Wcoeyj3", "postedAt": "2015-03-09T09:24:24.869Z", "postId": "YiFdK2D8xq2YxyhNi", "htmlBody": "<p>From the discussion I gather that we're facing the following challenges:</p>\n<ul>\n<li>Trust</li>\n<li>Handling amounts that can't be traded</li>\n<li>Maybe some technical challenges – once the number of trades, charities and countries increases, overview and coordination might become more difficult</li>\n<li>Also, the charities will want to know who the <em>actual</em> donors are, and thank them</li>\n</ul>\n<p>These challenges could be resolved by a global network of EA organisations who offer donation trading (and, if possible in their legislation, donation regranting). Trust and professional communications and management seems easier to achieve with organisations who stick around longer-term than with individuals.</p>\n<p>At GBS Switzerland, we already have some of the technical and legal components needed for this (we're tax-deductible in several countries, can regrant donations, have a significant amount of donors who don't pay taxes, and have some nice spreadsheets). Making progress in this direction is not a top priority for us at the moment, but if you're interested in one of the things I've mentioned, please get in touch with me (and also Tom Ash, as he mentions below).</p>\n", "parentCommentId": "5i6z4sKWCANkFAYPA", "user": {"username": "Jonas Vollmer"}}, {"_id": "yF5gqtbDGeajcMDHR", "postedAt": "2015-03-09T19:07:28.463Z", "postId": "YiFdK2D8xq2YxyhNi", "htmlBody": "<p>Agreed, doing it through organisations is probably better. Brian, how about putting people who fill in the spreadsheet in touch with the relevant organisations? Right now that'd be GBS for Switzerland and the countries listed at <a href=\"http://effectivealtruismhub.com/actions/donating/europe\">http://effectivealtruismhub.com/actions/donating/europe</a> plus Charity Science for Canada - plus any other organisations that are willing to participate.</p>\n", "parentCommentId": "HvKTbsPRd5Wcoeyj3", "user": {"username": "Tom_Ash"}}, {"_id": "JraC7CoGTTa7ssRcn", "postedAt": "2015-03-09T20:36:26.425Z", "postId": "YiFdK2D8xq2YxyhNi", "htmlBody": "<p>Looks like Jonas entered GBS into the Google Doc. Would you like to add Charity Science for Canada to it?</p>\n<p>I think the people besides me in the GDoc already have their charity of choice tax-deductible and only added themselves as possible trading partners.</p>\n<p>My impression is that trading through organizations only works for a restricted set of charities? It possible in theory to create an org that can donate to any charity in a set of countries? I guess that's what TIDES, Charities Aid Foundation, etc. do, but there's overhead to set that up. If so, there's still value in trading among individuals.</p>\n", "parentCommentId": "yF5gqtbDGeajcMDHR", "user": {"username": "Brian_Tomasik"}}, {"_id": "Q2SZjXjLLBLSCap3X", "postedAt": "2015-03-09T23:00:21.278Z", "postId": "YiFdK2D8xq2YxyhNi", "htmlBody": "<p>Done.</p>\n<p>Yes, it's restricted for us and GBS has a restricted list named on their site. And yes, it'd be a lot of overhead to register a whole new charity just for this. I have been setting up an EA donation routing mechanism in the US which might be able to do this though.</p>\n", "parentCommentId": "JraC7CoGTTa7ssRcn", "user": {"username": "Tom_Ash"}}, {"_id": "qMJoTxafysxEimTHi", "postedAt": "2015-05-03T03:19:33.883Z", "postId": "YiFdK2D8xq2YxyhNi", "htmlBody": "<p>EA orgs don't have Australian tax deductibility, but I think we could probably give through this system too. Aussies could give to an EA expense which can't be claimed on tax such as;</p>\n<ol>\n<li>Expenses incurred through running a GWWC chapter - hiring a lecture hall, food, copies of an EA book etc</li>\n<li><a href=\"http://effective-altruism.com/ea/i4/ea_handbook_hard_copies_for_local_hubs/\">mhpage's offer to print EA handbooks</a> (I would imagine)</li>\n<li><a href=\"http://effective-altruism.com/ea/fk/10k_of_experimental_ea_funding/\">Paul and Katja's grant experimental EA funding</a> (I would imagine)</li>\n</ol>\n<p>In exchange, a partner could give to an EA org which they can get tax deducibility on of the Aussie's choice. </p>\n<p>Without allocating them specifically, the gains from trade in this instance will only go to the person who gives to the org and gets a tax deduction; splitting this up would incentivise Aussies to get involved in trading. <a href=\"http://effective-altruism.com/ea/fu/can_we_set_up_a_system_for_international_donation/2vp\">Brian Tomasik suggests a 50/50 split.</a></p>\n<p>Most of the concerns raised above hold in this example, but can anyone think of a reason specific to this trade which is problematic? The main one I can see is that this would require some publicising for people to put EA expenses on the spreadsheet as well as EA donations. Another which might be stronger in this instance is the difficulty of Aussies trying to select the partner with the best tax deduction. </p>\n<p>I've put my name and contact details on the spreadsheet and pending no-one thinking of a good reason this is a bad idea, I'm happy for people to contact me to get in touch with Aussie donors initially. There will be more than $10 000 available at the Australian end for these trades. </p>\n", "parentCommentId": null, "user": {"username": "BrentonMayer"}}, {"_id": "zL3NHRDrAxRpAwdhs", "postedAt": "2015-05-03T09:21:07.298Z", "postId": "YiFdK2D8xq2YxyhNi", "htmlBody": "<p>Also, I think that we <em>can</em> donate tax-deductibly to Oxford and Cambridge - based organizations like CSER and FHI.</p>\n", "parentCommentId": "qMJoTxafysxEimTHi", "user": {"username": "RyanCarey"}}, {"_id": "cB3693ARwcmJqXHeL", "postedAt": "2015-05-05T15:05:16.791Z", "postId": "YiFdK2D8xq2YxyhNi", "htmlBody": "<p>That should work in theory. It may be hard to find large enough non-deductible spending - I'd recommend contacting Paul and Katja directly. The unusually large gap in the size of tax-deductibility (e.g. 0% in Oz, 25% in the UK) may also put off traders who value what you want to give to much less.</p>\n", "parentCommentId": "qMJoTxafysxEimTHi", "user": {"username": "Tom_Ash"}}, {"_id": "YTeCMKoY6qfh3PBCm", "postedAt": "2015-05-05T15:14:45.348Z", "postId": "YiFdK2D8xq2YxyhNi", "htmlBody": "<p>Here's the .impact project page which covers this, among other things: <a href=\"https://impact.hackpad.com/Expand-Tax-Deductibility-for-Top-Charities-ROR81FGrnRU\">Expand Tax Deductibility for Top Charities</a></p>\n", "parentCommentId": null, "user": {"username": "Tom_Ash"}}, {"_id": "KSSQE4DxYcn75xJp4", "postedAt": "2016-12-14T21:08:11.172Z", "postId": "YiFdK2D8xq2YxyhNi", "htmlBody": "<p>When I worked at a large charity, we sometimes had people request refunds because they misunderstood something, or changed their mind, or whatever. We always honored their requests, and I'd guess most other nonprofits do too (particularly if it was by credit card, because they can always report it as fraudulent and then their card company will take the money back from the charity anyway).</p>\n<p>I think a dishonest person could game this by making the donation, providing the receipt, and then getting a refund from the charity.</p>\n", "parentCommentId": "noLY96uE63vJNnMRE", "user": {"username": "Julia_Wise"}}, {"_id": "ingsWEc9WHw5hMRTS", "postedAt": "2016-12-15T08:33:35.272Z", "postId": "YiFdK2D8xq2YxyhNi", "htmlBody": "<p>Does anyone else think that a column structure along the lines of:</p>\n<p>Name | Contact | Your Country | Charities that are tax-deductible in your country | Charities you want to donate to | Countries where these charities are tax-deductible</p>\n<p>would be more comprehensible?</p>\n<p>I had to do more than a quick glance to understand the current structure, <a href=\"http://lesswrong.com/lw/f1/beware_trivial_inconveniences/\">which worries me a little bit</a>, but it might just be me.</p>\n", "parentCommentId": null, "user": {"username": "CalebWithers"}}, {"_id": "3XkJZZFaQP9aMaf7s", "postedAt": "2017-04-10T12:04:54.433Z", "postId": "YiFdK2D8xq2YxyhNi", "htmlBody": "<p>Yeah, I agree with this.</p>\n<p>Also, as a side note, I'd like to donate to MIRI in future but I'm currently based in Australia.</p>\n", "parentCommentId": "ingsWEc9WHw5hMRTS", "user": {"username": "AndyMorgan"}}]