[{"_id": "oBemvchCpZEGJEcno", "postedAt": "2023-05-30T09:54:48.331Z", "postId": "Yk4D4DZpx6eriMDyY", "htmlBody": "<p>Thank you to the CAIS team (and other colleagues) for putting this together. This is such a valuable contribution to the broader AI risk discourse.</p>", "parentCommentId": null, "user": {"username": "julianhazell"}}, {"_id": "XtFh9urZBijDEveTj", "postedAt": "2023-05-30T10:46:44.192Z", "postId": "Yk4D4DZpx6eriMDyY", "htmlBody": "<p>Great work guys, thanks for organising this!</p>", "parentCommentId": null, "user": {"username": "Larks"}}, {"_id": "XuPyoiXesiJeLz7pK", "postedAt": "2023-05-30T12:30:55.190Z", "postId": "Yk4D4DZpx6eriMDyY", "htmlBody": "<p>This is exciting!</p>\n<p>Do you have any thoughts on how the community should be following up on this?</p>\n", "parentCommentId": null, "user": {"username": "casebash"}}, {"_id": "52QyioK3BTvsZ7Ymm", "postedAt": "2023-05-30T13:03:39.933Z", "postId": "Yk4D4DZpx6eriMDyY", "htmlBody": "<p>This is so awesome, thank you so much, I'm really glad this exists. The recent shift of experts publicly worrying about AI x-risks has been a significant update for me in terms of hoping humanity avoids losing control to AI.</p><blockquote><p>(but notably not Meta)</p></blockquote><p>Wondering how much I should update from Meta and other big tech firms not being represented on the list. Did you reach out to the signing individuals via your networks and maybe the network didn't reach some orgs as much? Maybe there are company policies in place that prevent employees from some firms from signing the statement? And is there something specific about Meta that I can read up on (besides Yann LeCun intransigence on Twitter :P)?</p>", "parentCommentId": null, "user": {"username": "MaxRa"}}, {"_id": "F8wr8yrw8DSr9ejpt", "postedAt": "2023-05-30T15:02:35.515Z", "postId": "Yk4D4DZpx6eriMDyY", "htmlBody": "<p>Very cool!</p>\n<p>I am surprised you did not mention climate since this is the one major risk where we are doing a good job (i.e. if we paying as much attention to AI as to future pandemics and nuclear risk this isn't very reassuring, as it seems these are major risks there are not well addressed / massively underresourced compared to importance).</p>\n", "parentCommentId": null, "user": {"username": "jackva"}}, {"_id": "EQpuQ2eaoHrGwa9jW", "postedAt": "2023-05-30T15:21:13.834Z", "postId": "Yk4D4DZpx6eriMDyY", "htmlBody": "<p>Note that this was <a href=\"https://www.nytimes.com/2023/05/30/technology/ai-threat-warning.html\">covered in the New York Times</a> (paywalled) by Kevin Roose. I found it interesting to skim the comments. (Thanks for working on this, and sharing!)&nbsp;</p>", "parentCommentId": null, "user": {"username": "Lizka"}}, {"_id": "rrNwH2XToaumGbAcW", "postedAt": "2023-05-30T16:45:11.071Z", "postId": "Yk4D4DZpx6eriMDyY", "htmlBody": "<blockquote><p>climate since this is the one major risk where we are doing a good job</p></blockquote><p>Perhaps (at least in the United States) we haven't been doing a very good job on the communication front for climate change, as there are many social circles where climate change denial has been normalized and the issue has become very politically polarized with many politicians turning climate change from an empirical scientific problem into a political \"us vs them\" problem.</p>", "parentCommentId": "F8wr8yrw8DSr9ejpt", "user": {"username": "Gabe Mukobi"}}, {"_id": "ji5SHuWkq6oazDKwo", "postedAt": "2023-05-30T17:13:46.045Z", "postId": "Yk4D4DZpx6eriMDyY", "htmlBody": "<p>I, for one, think that it is good that climate change was not mentioned. Not necessarily because there are no analogies and lessons to be drawn, but rather because it can more easily be misinterpreted. I think that the kind of actions and risks are much more similar to bio and nuclear, in that there are way less actors and, at least for now, it is much less integrated to day-to-day life. Moreover, in many scenarios, the risk itself is of more abrupt and binary nature (though of course not completely so), rather than a very long and gradual process. I'd be worried that comparing AI safety to climate change would be easily misinterpreted or dismissed by irrelevant claims.</p>\n", "parentCommentId": "F8wr8yrw8DSr9ejpt", "user": {"username": "shaybenmoshe"}}, {"_id": "eEiJfmowfqXBH9WeL", "postedAt": "2023-05-30T18:24:51.120Z", "postId": "Yk4D4DZpx6eriMDyY", "htmlBody": "<p>I'm really heartened by this, especially some of the names on here I independently admired who haven't been super vocal about the issue yet, like David Chalmers, Bill McKibben, and Audrey Tang. I also like certain aspects of this letter better than the FLI one. Since it focuses specifically on relevant public figures, rapid verification is easier and people are less overwhelmed by sheer numbers. Since it focuses on an extremely simple but extremely important statement it's easier to get a broad coalition on board and for discourse about it to stay on topic. I liked the FLI one overall as well, I signed it myself and think it genuinely helped the discourse, but if nothing else this seems like a valuable supplement.</p>\n", "parentCommentId": null, "user": {"username": "Devin Kalish"}}, {"_id": "aXQZRt67pWFvseReJ", "postedAt": "2023-05-30T23:07:37.880Z", "postId": "Yk4D4DZpx6eriMDyY", "htmlBody": "<p>At least in the US, I'd worry that comparisons to climate change will get you attacked by ideologues from both of the main political sides (vitriol from the left because they'll see it as evidence that you don't care enough about climate change, vitriol from the right because they'll see it as evidence that AI risk is as fake/political as climate change).</p>", "parentCommentId": "F8wr8yrw8DSr9ejpt", "user": {"username": "Linch"}}, {"_id": "srTF6yshQWriu8mtK", "postedAt": "2023-05-30T23:09:49.086Z", "postId": "Yk4D4DZpx6eriMDyY", "htmlBody": "<p>I'm not sure, we can dismiss Yann LeCun's statements so easily; mostly, because I do not understand how Meta works. How influential is he there? Does he set general policy around things like AI risk?</p><p>I feel there is this unhealthy dynamic where he represents the leader of some kind of \"anti-doomerism\" – and I'm under the impression that he and his Twitter crowd do not engage with the arguments of the debate at all. I'm pretty much looking at this from the outside, but LeCun's arguments seem to be so far behind. If he drives Meta's AI safety policy, I'm honestly worried about that. Meta just doesn't seem to be an insignificant player.</p>", "parentCommentId": "52QyioK3BTvsZ7Ymm", "user": {"username": "Jörg Weiß"}}, {"_id": "NaK6qWzM549rcLy6d", "postedAt": "2023-05-30T23:48:33.672Z", "postId": "Yk4D4DZpx6eriMDyY", "htmlBody": "<p>Made the front page of Hacker News. Here's the <a href=\"https://news.ycombinator.com/item?id=36123082\">comments</a>.</p>\n<p>The most common pushback (and the first two comments, as of now) are from people who think this is an attempt at regulatory capture by the AI labs, though there's a good deal of pushback and (I thought) some surprisingly high-quality discussion.</p>\n", "parentCommentId": null, "user": {"username": "reallyeli"}}, {"_id": "GkipAjmLuxoQKuWoT", "postedAt": "2023-05-31T05:03:17.384Z", "postId": "Yk4D4DZpx6eriMDyY", "htmlBody": "<blockquote><p>since this is the one major risk where we are doing a good job</p></blockquote><p>What about ozone layer depletion?</p>", "parentCommentId": "F8wr8yrw8DSr9ejpt", "user": {"username": "Linch"}}, {"_id": "iAGgBydv2B4mZEeEK", "postedAt": "2023-05-31T09:53:53.713Z", "postId": "Yk4D4DZpx6eriMDyY", "htmlBody": "<p>Huge appreciation to the CAIS team for the work put in here</p>\n", "parentCommentId": null, "user": {"username": "ElliotJDavies"}}, {"_id": "GjPyPTbCt6oe7sZvd", "postedAt": "2023-05-31T10:40:13.707Z", "postId": "Yk4D4DZpx6eriMDyY", "htmlBody": "<p>Not a current major risk, but also turned out to be trivially easy to solve with minimal societal resources (technological substitution was already available when regulated, only needed regulating a couple of hundred factories in select countries), so does not feel like it belongs in the class of major risks.</p>\n", "parentCommentId": "GkipAjmLuxoQKuWoT", "user": {"username": "jackva"}}, {"_id": "GB3eNDpBb5biRAKeo", "postedAt": "2023-05-31T17:29:54.744Z", "postId": "Yk4D4DZpx6eriMDyY", "htmlBody": "<blockquote><p>The most common pushback (and the first two comments, as of now) are from people who think this is an attempt at regulatory capture by the AI labs</p></blockquote><p>&nbsp;</p><p>This is also the case in the comments on this <a href=\"https://www.ft.com/content/084d5627-5193-4bdc-892e-ebf9e30b7ea3\">FT article</a> (paywalled I think), which I guess indicates how less techy people may be tending to see it.</p>", "parentCommentId": "NaK6qWzM549rcLy6d", "user": {"username": "Pagw"}}, {"_id": "ruyJDFyeigDdEhkT6", "postedAt": "2023-05-31T22:20:02.667Z", "postId": "Yk4D4DZpx6eriMDyY", "htmlBody": "<p>IMO it was tactically correct to not mention climate. The point of the letter is to get wide support, and I think many people would not be willing to put AI X-Risk on par with climate</p>\n", "parentCommentId": "F8wr8yrw8DSr9ejpt", "user": {"username": "Neel Nanda"}}, {"_id": "aqDgzi7PWQGeKpdxh", "postedAt": "2023-05-31T22:40:24.780Z", "postId": "Yk4D4DZpx6eriMDyY", "htmlBody": "<p>Yeah, I can see that though it is a strange world where we treat nuclear and pandemics as second-order risks.</p>\n", "parentCommentId": "ruyJDFyeigDdEhkT6", "user": {"username": "jackva"}}, {"_id": "udDvj4Aa4Yv9qjoGM", "postedAt": "2023-05-31T23:59:56.457Z", "postId": "Yk4D4DZpx6eriMDyY", "htmlBody": "<p>I disagree, I think major risks should be defined in terms of their potential impact sans intervention, rather than taking tractability into account (negatively).&nbsp;</p><p>Incidentally there was some <a href=\"https://www.lesswrong.com/posts/qfiHikNEfjR4bDhGr/is-this-true-tyler_m_john-if-we-had-started-using-cfcs\">earlier speculation </a>of what counterfactually might happen if we had invented CFCs a century earlier, which you might find interesting.</p>", "parentCommentId": "GjPyPTbCt6oe7sZvd", "user": {"username": "Linch"}}, {"_id": "LF9gJKZrycMnd7LMy", "postedAt": "2023-06-01T02:04:12.105Z", "postId": "Yk4D4DZpx6eriMDyY", "htmlBody": "<p>Truly brilliant coalition-building by CAIS and collaborators. It is likely that the world has become a much safer place as a result. Congratulations!</p>", "parentCommentId": null, "user": {"username": "Peter S. Park"}}, {"_id": "mEwkDvoMg8Y8rtLhD", "postedAt": "2023-06-01T06:55:57.894Z", "postId": "Yk4D4DZpx6eriMDyY", "htmlBody": "<p>I think we're talking past each other.</p>\n<p>While I also disagree that we should ignore tractability for the purpose you indicate, the main point here is more \"if we'd chose the ozone layer as an analogy we are suggesting the problem is trivially easy\" which doesn't really help with solving the problem and it already seems extremely likely that AI risk is much trickier than ozone layer depletion.</p>\n", "parentCommentId": "udDvj4Aa4Yv9qjoGM", "user": {"username": "jackva"}}, {"_id": "dF7yFXDWAE6aDEHEo", "postedAt": "2023-06-01T11:51:36.392Z", "postId": "Yk4D4DZpx6eriMDyY", "htmlBody": "<p>I'm mildly surprised that Elon Musk hasn't signed, given that he did sign the FLI 6-month pause open letter and has been vocal about being worried about AI x-risk for years.</p><p>Probably the simplest explanation for this is that the organizers of this statement haven't been able to reach him, or he just hasn't had time yet (although he should have heard about it by now?).&nbsp;</p>", "parentCommentId": null, "user": {"username": "MaxG"}}, {"_id": "TFxDvpEtCMPJERvB9", "postedAt": "2023-06-01T16:08:48.124Z", "postId": "Yk4D4DZpx6eriMDyY", "htmlBody": "<p>I reckon there's a pretty good chance he didn't sign because he wasn't asked, because he's a controversial figure.</p>", "parentCommentId": "dF7yFXDWAE6aDEHEo", "user": {"username": "Erich_Grunewald"}}, {"_id": "LLCqiw9cy9dLbwTZx", "postedAt": "2023-06-01T23:27:54.836Z", "postId": "Yk4D4DZpx6eriMDyY", "htmlBody": "<p>It seems relevant that most of the signatories are academics, where this criticism wouldn't make sense. <a href=\"https://forum.effectivealtruism.org/users/haydnbelfield?mention=user\">@HaydnBelfield</a> created a nice graphic <a href=\"https://twitter.com/HaydnBelfield/status/1663678184720662538?s=20\">here</a> demonstrating this point.</p>", "parentCommentId": "NaK6qWzM549rcLy6d", "user": {"username": "Daniel_Eth"}}, {"_id": "LjZSxmu2gHWPKhqFY", "postedAt": "2023-06-02T08:31:19.804Z", "postId": "Yk4D4DZpx6eriMDyY", "htmlBody": "<p>Yea, that could be the case, although I assume having Elon Musk sign could have generated 2x the publicity. Most news outlets seem to jump on everything he does.&nbsp;<br><br>Not sure what the tradeoff between attention and controversy is for such a statement.&nbsp;</p>", "parentCommentId": "TFxDvpEtCMPJERvB9", "user": {"username": "MaxG"}}, {"_id": "8kEzkWvJG4Eondetx", "postedAt": "2023-06-02T08:55:14.723Z", "postId": "Yk4D4DZpx6eriMDyY", "htmlBody": "<blockquote><p>Most news outlets seem to jump on everything he does.</p></blockquote><p>That's where my thoughts went, maybe he and/or CAIS thought that the statement would have a higher impact if reporting focuses on other signatories. That Musk thinks AI is an x-risk seems fairly public knowledge anyways, so there's no big gain here.</p>", "parentCommentId": "LjZSxmu2gHWPKhqFY", "user": {"username": "MaxRa"}}, {"_id": "HE5pqFbhTKsBF7Hit", "postedAt": "2023-06-02T09:26:14.370Z", "postId": "Yk4D4DZpx6eriMDyY", "htmlBody": "<p>I've also been trying this to people claiming financial interests. On the other hand, the tweet Haydn replied to actually makes another good point though, that does apply to professors - diverting attention to from societal risks that they're contributing to but can solve, to x-risk where they can mostly sign such statements and then go \"🤷🏼‍♂️\", shields them from having to change anything in practice.</p>\n", "parentCommentId": "LLCqiw9cy9dLbwTZx", "user": {"username": "Guy Raveh"}}, {"_id": "DJ7NDido7vPFRxcqG", "postedAt": "2023-06-10T06:23:08.401Z", "postId": "Yk4D4DZpx6eriMDyY", "htmlBody": "<p>In the vein of \"another good point\" made in public reactions to the statement, an article I read in The Telegraph:</p>\n<p>\"Big tech’s faux warnings should be taken with a pinch of salt, for incumbent players have a vested interest in barriers to entry. Oppressive levels of regulation make for some of the biggest. For large companies with dominant market positions, regulatory overkill is manageable; costly compliance comes with the territory. But for new entrants it can be a killer.\"</p>\n<p>This seems obvious with hindsight as one factor at play, but I hadn't considered it before reading it here. This doesn't address Daniel / Haydn's point though, of course.</p>\n<p><a href=\"https://www.telegraph.co.uk/business/2023/06/04/worry-climate-change-not-artificial-intelligence/\">https://www.telegraph.co.uk/business/2023/06/04/worry-climate-change-not-artificial-intelligence/</a></p>\n", "parentCommentId": "HE5pqFbhTKsBF7Hit", "user": {"username": "Jamie_Harris"}}]