[{"_id": "4NRoBBmARzMfB8iBs", "postedAt": "2022-12-14T23:13:27.152Z", "postId": "YkjDHYqEubHaDsEQT", "htmlBody": "<p>Thanks for sharing these thoughts! I'm curious to know more about smoother operations - could you elaborate?</p>\n", "parentCommentId": null, "user": {"username": "vaidehi_agarwalla"}}, {"_id": "cAcxvD7nFjbEHo9i8", "postedAt": "2022-12-15T01:25:56.196Z", "postId": "YkjDHYqEubHaDsEQT", "htmlBody": "<p>What is the view toward animal welfare of the Progress Studies movement?&nbsp;</p><p>A large community of \"near-EA\" animal welfare people exist, but don't post on the forum as much as others. Note that this community has a mature, coordinated, cooperative outlook, different from some kinds of activism.</p>", "parentCommentId": null, "user": {"username": "worldoptimization was based"}}, {"_id": "xbg4hTrkHDNtng7Rb", "postedAt": "2022-12-15T01:48:15.139Z", "postId": "YkjDHYqEubHaDsEQT", "htmlBody": "<blockquote>\n<p>Overall, I think the Progress studies community seems decently aligned with what EAs care about, and could become more-so in the coming years. The event had decent epistemics and was less intimidating than an EA conference. I think many people who feel that EA is too intense, cares too much about longtermism, or uses too much jargon could find progress studies as a suitable alternative. If the movement known as EA dissolved (God forbid) I think progress studies could absorb many of the folks.</p>\n</blockquote>\n<p>I'm curious about how you think this will develop. It seems like Progress studies often takes the stance that for all technologies, progress in that technology is good. This seems relatively central to their shtick.</p>\n<p>Maybe their views will start to shift towards thinking strongly in terms of what we would call differential technological development. Where they can maintain their view that progress is good, but append onto that that progress is only good if certain technologies get developed sooner than other technologies. Perhaps this is the perspective they have on many technologies already, and I don't know enough about the community to tell.</p>\n", "parentCommentId": null, "user": {"username": "D0TheMath"}}, {"_id": "zEvC8CrXBPWfpzdFE", "postedAt": "2022-12-15T05:45:52.622Z", "postId": "YkjDHYqEubHaDsEQT", "htmlBody": "<p>You know that's what I thought as well, but I've found the community to be more open to caution than I initially thought. Derek Thompson in particular (the main organizer for the event) harped on safety quite a bit. And if more EAs got involved (assuming they don't get amnesia) I assume they can carry over some of these concerns and shift the culture.&nbsp;</p>", "parentCommentId": "xbg4hTrkHDNtng7Rb", "user": {"username": "Nick Corvino"}}, {"_id": "NjrrmYvzzxNKQQwtM", "postedAt": "2022-12-15T05:46:45.599Z", "postId": "YkjDHYqEubHaDsEQT", "htmlBody": "<p>Did not hear animal welfare mentioned once, and they had lots of meat options for lunch. That's all I got lol.&nbsp;</p>", "parentCommentId": "cAcxvD7nFjbEHo9i8", "user": {"username": "Nick Corvino"}}, {"_id": "Djz2zqGkHf5gvZTW2", "postedAt": "2022-12-15T05:49:45.516Z", "postId": "YkjDHYqEubHaDsEQT", "htmlBody": "<p>it's hard to put into words, but like there were cocktails and nice background music and all the events transitioned super smoothly. It's like when you watch the Oscars or something and everything seems like it's been rehearsed--that's how this felt. EA conferences, on the other hand, usually seem more hectic and improvisational.&nbsp;</p>", "parentCommentId": "4NRoBBmARzMfB8iBs", "user": {"username": "Nick Corvino"}}, {"_id": "ZzKNf84dMkHq6s6kq", "postedAt": "2022-12-15T06:25:35.144Z", "postId": "YkjDHYqEubHaDsEQT", "htmlBody": "<p>In this case, if I had to choose between</p>\n<p>A) attending an event with nicer background music + cocktails and</p>\n<p>B) one that doesn't seem \"rehearsed\"</p>\n<p>I'd probably end up choosing the latter...</p>\n", "parentCommentId": "Djz2zqGkHf5gvZTW2", "user": {"username": "Moritz von Knebel"}}, {"_id": "tLkNwtkWkDr2Je9jM", "postedAt": "2022-12-16T00:35:48.041Z", "postId": "YkjDHYqEubHaDsEQT", "htmlBody": "<p>You can read what Jason Crawford had to say on the topic here when&nbsp;<br>Peter Wildeford &nbsp;asked:<br><a href=\"https://twitter.com/peterwildeford/status/1520911804288966656\">https://twitter.com/peterwildeford/status/1520911804288966656</a><br><br>Peter: &nbsp;What do progress studies people think about nonhuman animals?<br>Jason : It's not discussed much. There are probably a range of views. Personally, my current position is that we shouldn't be inhumane or needlessly cruel, but that animals aren't on the same moral level as humans<br><br>Peter: Do you think modern factory farming is inhumane?<br>Jason: I've only read a little bit about it, and what I read was pretty bad. But the topic is controversial enough that I'd want to hear multiple takes (ideally from different sides) before having a real opinion<br><br>Also mentions that he doesn't see factory farming of animals as &nbsp;one of the biggest problems/negatives caused by progress.</p>", "parentCommentId": "NjrrmYvzzxNKQQwtM", "user": {"username": "Incogneilo18"}}, {"_id": "JJsEqfWr8746SSwsF", "postedAt": "2022-12-15T10:10:02.147Z", "postId": "YkjDHYqEubHaDsEQT", "htmlBody": null, "parentCommentId": "ZzKNf84dMkHq6s6kq", "user": null}]