[{"_id": "DZFRTp8otmmRjn5nb", "postedAt": "2017-12-31T03:19:16.872Z", "postId": "YKTKsZB8j5gXNsNB6", "htmlBody": "<p>The closest is probably <a href=\"https://was-research.org\">Wild-Animal Suffering Research</a>, since they have published (on their website) a few papers on invertebrate welfare (e.g., <a href=\"https://was-research.org/writing-by-others/invertebrate-species-feel-pain/\">Which Invertebrate Species Feel Pain?</a>, <a href=\"https://was-research.org/paper/analysis-lethal-methods-wild-animal-population-control-invertebrates/\">An Analysis of Lethal Methods of Wild Animal Population Control: Invertebrates</a>). However, their work doesn't focus exclusively on invertebrates, as they have published some articles that either apply to all animals (e.g., <a href=\"https://was-research.org/paper/fit-happy-measure-wild-animal-suffering/\">“Fit and Happy”: How Do We Measure Wild-Animal Suffering?</a>), or only apply to vertebrates (e.g., <a href=\"https://was-research.org/paper/analysis-lethal-methods-wild-animal-population-control-vertebrates/\">An Analysis of Lethal Methods of Wild Animal Population Control: Vertebrates</a>).</p>\n<p><a href=\"http://www.animal-ethics.org\">Animal Ethics</a> and <a href=\"https://www.utility.farm\">Utility Farm</a> also work on issues relating to wild animal suffering. My impression is that AE mostly focuses on outreach (e.g., <a href=\"http://www.animal-ethics.org/about-us/\">About Us</a>, <a href=\"http://www.animal-ethics.org/download-and-use-animal-ethics-leaflets-and-factsheets/\">leaflets</a>, <a href=\"https://www.facebook.com/Animal-Ethics-1424658461139957/\">FB page</a>), and UF mostly focuses on advocacy and social change research (e.g., <a href=\"https://www.utility.farm/words/2017/7/13/study-effective-communication-strategies-for-addressing-wild-animal-suffering\">Study: Effective Communication Strategies For Addressing Wild Animal Suffering</a>, <a href=\"https://www.utility.farm/words/2017/10/18/reviewing-2017-and-looking-to-2018\">Reviewing 2017 and Looking to 2018</a>), although AE also claims to do some <a href=\"http://www.animal-ethics.org/volunteer-research-animal-ethics/\">research</a> (mainly moral philosophy literature reviews?). Again, these organizations don't only focus on invertebrates. In fact, AE doesn't even focus solely on wild animals, as they seem to spend significant resources on traditional animal advocacy (farm animals, veganism) as well.</p>\n<p>I don't know of any insect-specific charities, although some may exist. Unfortunately, the <a href=\"http://insectrights.org/parody.html\">Society for the Prevention of Cruelty to Insects</a> is only satire. If we widen the scope a bit and include invertebrate-specific charities, I know only of <a href=\"https://www.crustaceancompassion.org.uk\">Crustacean Compassion</a>, but there may be others. There was also at one point a website called <a href=\"https://archive.li/L34Ie\">Invertebrate Considerations</a> that seemed to be EA-aligned, but it's gone now and I don't think it was ever anything more than just a mockup.</p>\n<p><a href=\"http://reducing-suffering.org/humane-insecticides/\">Humane insecticides</a> might be a promising area for future work.</p>\n", "parentCommentId": null, "user": {"username": "MetricSulfateFive"}}, {"_id": "LX35BdCW4rt3HcSnT", "postedAt": "2017-12-31T04:51:27.909Z", "postId": "YKTKsZB8j5gXNsNB6", "htmlBody": "<p>Great overview!</p>\n<p>Yeah, Wild-Animal Suffering Research's plans include some invertebrate components, especially <a href=\"https://was-research.org/blog/georgia-rays-research-plan/\">Georgia Ray’s topics</a>.</p>\n<p>If you're also concerned about reducing the suffering of small artificial minds in the far future, <a href=\"https://foundational-research.org/\">Foundational Research Institute</a> may be of interest.</p>\n", "parentCommentId": "DZFRTp8otmmRjn5nb", "user": {"username": "Brian_Tomasik"}}, {"_id": "LTMJgznE4Rtwauixq", "postedAt": "2017-12-31T08:17:13.422Z", "postId": "YKTKsZB8j5gXNsNB6", "htmlBody": "<p>While this isn't an answer I suspect that if you are interested in insect welfare one first needs a philosophical/scientific program to get a grip on what that entails.  </p>\n<p>First, unlike other kinds of animal suffering it seems doubtful there are any interventions for insects that will substantially change their quality of life without also making a big difference in the total population.  Thus, unlike large animals, where one can find common ground between various consequentialist moral views it seems quite likely that whether a particular intervention is good or actually harmful for insects will often turn on subtle questions about one's moral views, e.g., average utility or total, does the welfare of possible future beings count, is the life of your average insect a net plus or minus.</p>\n<p>As such simply donating to insect welfare risks doing (what you feel is) a great moral harm unless you've carefully considered these aspects of your moral view and chosen interventions that align with them.</p>\n<p>Secondly, merely figuring out what makes insects better off is hard.  While our intuitions can go wrong its not too unreasonable to think that we can infer other mammals and even vertebrates level of pain/pleasure based on analogies to our own experiences (a dog yelping is probably in pain).  However, when it comes to something as different as an insect its unclear if its even safe to assume an insect's neural response to damage even feels unpleasant.  After all, surely at some simple enough level of complexity, we don't believe those lifeform's response to damage manifests as a qualitative experience of suffering (even though the tissues in my body can react to damage and even change behavior to avoid further damage without interaction with my brain we don't think my liver can experience pain on its own).  At the very least to figure out what kinds of events might induce pain/pleasure responses in an insect  would require some philosophical analysis of what is known about insect neurobiology.</p>\n<p>Finally, it is quite likely that it will be the indirect effects of any intervention on the wider insect ecosystem rather than any direct effect which will have the largest impact.  As such, it would be a mistake to try and engage in any interventions without first doing some in depth research into the downstream effects.</p>\n<hr />\n<p>Point of this all is that with respect to insects we need to support academic study and consideration more before actually engaging in any interventions.</p>\n", "parentCommentId": null, "user": {"username": "TruePath"}}, {"_id": "xf6FdJnwZ2GckSNAi", "postedAt": "2017-12-31T08:23:24.000Z", "postId": "YKTKsZB8j5gXNsNB6", "htmlBody": "<p>I'm disappointed that the link about which invertebrates feel pain doesn't go into more detail on the potential distinction between merely learning from damage signals and the actual qualitative experience of pain.  It is relatively easy to build a simple robot or write a software program that demonstrates reinforcement learning in the face of some kind of damage but we generally don't believe such programs truly have a qualitative experience of pain.  Moreover, the fact that some stimuli are both unpleasant yet rewarding (e.g. encourage repetition) indicates these notions come apart.</p>\n", "parentCommentId": "DZFRTp8otmmRjn5nb", "user": {"username": "TruePath"}}, {"_id": "z9BjEgPKJzoHnbjir", "postedAt": "2017-12-31T11:15:20.663Z", "postId": "YKTKsZB8j5gXNsNB6", "htmlBody": "<p>It's a big topic area, and I think we need articles on lots of different issues. The overview piece for invertebrate sentience was just a small first step. Philosophers, neuroscientists, etc. have written thousands of papers debating criteria for sentience, so I don't expect such issues to be resolved soon. In the meanwhile, cataloguing what abilities different invertebrate taxa have seems valuable. But yes, some awareness of the arguments in philosophy of mind and how they bear on the empirical research is useful. :)</p>\n", "parentCommentId": "xf6FdJnwZ2GckSNAi", "user": {"username": "Brian_Tomasik"}}, {"_id": "haGDNXGoCa3YfYMZy", "postedAt": "2017-12-31T13:51:09.344Z", "postId": "YKTKsZB8j5gXNsNB6", "htmlBody": "<p>Nice points. :)</p>\n<blockquote>\n<p>it seems doubtful there are any interventions for insects that will substantially change their quality of life without also making a big difference in the total population</p>\n</blockquote>\n<p>One exception might be identifying insecticides that are less painful than existing ones while having roughly similar effectiveness, broad/narrow-spectrum effects, etc. Other forms of humane slaughter, such as on insect farms, would also fall under this category.</p>\n", "parentCommentId": "LTMJgznE4Rtwauixq", "user": {"username": "Brian_Tomasik"}}, {"_id": "dYucy7RziEJkFp7qt", "postedAt": "2018-01-02T08:06:59.725Z", "postId": "YKTKsZB8j5gXNsNB6", "htmlBody": "<p>Or maybe <a href=\"http://reducing-suffering.org/malaria-foundation-reduce-invertebrate-suffering/\">do donate to AMF</a>. :)</p>\n", "parentCommentId": "wffhBp4xdwBfWNiJy", "user": {"username": "Brian_Tomasik"}}]