[{"_id": "Yur92N87kBzaD4Jgh", "postedAt": "2022-12-28T22:34:01.096Z", "postId": "YmPnzpzo5dxPozinc", "htmlBody": "<p>I think most of these top scoring (good or bad) comments come in the context of high attention hot-button controversy-related posts. Maybe the awards should try to adjust for that?</p>\n", "parentCommentId": null, "user": {"username": "david_reinstein"}}, {"_id": "xZ32jk5aQcCmCvNqY", "postedAt": "2022-12-28T23:47:11.169Z", "postId": "YmPnzpzo5dxPozinc", "htmlBody": "<p>I did not imagine <em>this</em> would be the achievement that gets me recognition on the EA Forum, but I'm honoured still!</p>\n", "parentCommentId": null, "user": {"username": "Guy Raveh"}}, {"_id": "PNHFYgj8nQJtAgXSC", "postedAt": "2022-12-29T01:29:07.500Z", "postId": "YmPnzpzo5dxPozinc", "htmlBody": "<p>I'd be interested in a look at the <i>ratios</i> of upvotes to agreements. Like, one of the hall of fame posts has three times as many upvotes as agreements, which seems to indicate that it's a controversial opinion at least.&nbsp;</p>", "parentCommentId": null, "user": {"username": "titotal"}}, {"_id": "PAYofCjyqK7NdbqeB", "postedAt": "2022-12-30T06:35:08.388Z", "postId": "YmPnzpzo5dxPozinc", "htmlBody": "<p>It's interesting that all of the highest \"agreement Karma\" are <strong>defences </strong>against questioning or criticism, mostly levelled at either EA leadership or something EA leadership has done. That could be good in showing solidarity and support for leadership and the movement in general.</p><p>But while all the comments are important, none of them are about core effective altruism stuff</p><p>This possibly is because forums and social media get more traffic around drama and negativity rather than positive ideas and intellectual discussion. Maybe this is unavoidable in online discourse. I even notice myself often &nbsp;gravitating to the \"drama\" posts rather than good ideas and more interesting discussion.&nbsp;<br><br>I hope in future though that some of the highest agreed comments are around the core business of effective altruism.</p>", "parentCommentId": null, "user": {"username": "NickLaing"}}, {"_id": "wQnZKjJ2jkcbcoecr", "postedAt": "2022-12-30T16:09:00.290Z", "postId": "YmPnzpzo5dxPozinc", "htmlBody": "<p>I enjoyed the way this post was written -- nice work!</p>", "parentCommentId": null, "user": {"username": "willbradshaw"}}, {"_id": "wyKyyZDhpn7Q2igqr", "postedAt": "2022-12-31T03:11:43.944Z", "postId": "YmPnzpzo5dxPozinc", "htmlBody": "<p>Are there stats on how many people up voted (rather than the karma), as some people have interacted with the forum more therefore their vote by default may be worth e.g. 5+ x as much as that of other people. Particularly interested to see how this looks in the defense posts.</p>\n<p>Also would be interested to see with the number of people rather than karma how much something was strong voted rather than more individual people agreeing/disagreeing</p>\n", "parentCommentId": "PAYofCjyqK7NdbqeB", "user": {"username": "LinBowkerLonnecker"}}, {"_id": "zAt5Ht94SX5ikwQ65", "postedAt": "2023-01-02T12:47:38.731Z", "postId": "YmPnzpzo5dxPozinc", "htmlBody": "<p>Nice one I agree that would be interesting - you are right that those who are hardcore EAs are more likely to defend the movement, and that might be part of the reason for the defence posts being so highly rated. Personally I'm &nbsp;uncomfortable with any system where some animals are more equal than others, but I understand the sentiment of giving senior forumers more weight. It has been discussed a couple of times but i can't find the threads right nw.</p>", "parentCommentId": "wyKyyZDhpn7Q2igqr", "user": {"username": "NickLaing"}}, {"_id": "fgwxvKxt5gmtGKnhu", "postedAt": "2023-01-02T13:49:37.507Z", "postId": "YmPnzpzo5dxPozinc", "htmlBody": "<p>I think whether or not it makes sense to give senior forumers more weight, the fact that this is the case needs to be considered when drawing conclusions:</p>\n<p>e.g. Higher agreement karma does not imply that <em>more people</em> agree with a comment. It may be that, but it may also be that fewer-than-that people who have interacted with the forum more agree, or a certain group of people agree more strongly.</p>\n<p>You get some idea when you look at the number of votes as well as the karma, but for example in this post something like this could have been discussed but wasn't.</p>\n", "parentCommentId": "zAt5Ht94SX5ikwQ65", "user": {"username": "LinBowkerLonnecker"}}, {"_id": "qXd3Pc3tGjn8KbMWM", "postedAt": "2023-01-02T16:31:50.180Z", "postId": "YmPnzpzo5dxPozinc", "htmlBody": "<p>One possible modest change to the formula: No more than half of all upvotes (or downvotes) can count as strong. I think it's natural to read high karma count as expressing some breadth of support. So while I'm fine with, e.g., two strong upvotes (each worth +6 in this example) and nine regular upvotes (each worth +2 in this example) equalling 15 regulars, I'm less  convinced that five strong upvotes should carry the same karma. That seems too open to a small group strong-upvoting their friends/allies and giving the appearance of broader support.</p>\n<p>Another possibility would be that strong upvote/downvote costs the casting user one karma.</p>\n<p>[Edited to clarify]</p>\n", "parentCommentId": "fgwxvKxt5gmtGKnhu", "user": {"username": "Jason"}}, {"_id": "s2DCJtGNccbrPTEnJ", "postedAt": "2023-01-02T17:19:57.930Z", "postId": "YmPnzpzo5dxPozinc", "htmlBody": "<p>I find the way your example is written is a bit unclear (perhaps a less confusing phrasing is e.g. \"two strong upvotes (each worth +6)\"). I understood what you were trying to say  but I had to read it a few times. By my understanding: that you are not convinced that just 5 strong votes should not be worth the same as 11 votes which include some strong votes, or fifteen regular votes.</p>\n<p>To make things perhaps more confusing I'm not sure everyone has the same multiplier between regular and strong votes. Initially a regular vote is worth 1 and a strong vote 2, now my regular votes are worth 1 and strong votes are worth 3. So at the very least the 3x multiplier is not the same for newer users.</p>\n<p>I can also see the potential of people trying to balance out the fact that their votes are worth less by doing strong votes, or generally people not being completely consistent between what they count as a strong vote and what they just count as a regular vote (e.g. between days or depending on the mood, or on the type of post) . I expect between people there is also likely variation of how strongly they need to agree to something before they strong vote it.</p>\n<p>Adding a cost to the strong votes would certainly make people less likely to strong vote, but having it as a 'fixed fine' of 1 will make no real difference if you have a lot of karma, but if you have less karma it will make more of one (e.g. I believe you need a certain amount of karma to add coauthors to posts). So for newer users this would be both having their votes be worth less in comparison and higher costs for them using the strong votes, which I do not think is a good idea.</p>\n", "parentCommentId": "qXd3Pc3tGjn8KbMWM", "user": {"username": "LinBowkerLonnecker"}}, {"_id": "ouyB4vfkRtbYN92Jm", "postedAt": "2023-01-02T18:32:29.298Z", "postId": "YmPnzpzo5dxPozinc", "htmlBody": "<p>Thanks -- edited to try to clarify that the +2/+6 were example values. I believe you are correct that the ratio is not the same; the most recent chart I have seen is <a href=\"https://forum.effectivealtruism.org/posts/gNHFRWyo58cTQ8pe8/ea-forum-2-0-initial-announcement-1#A_reworked_karma_system\">here</a> which suggests that the ratio can be up to 5:1.</p><p>I could see an argument for a scaled loss of karma for strongvotes depending on how many points one's strongvotes were worth. I would view this as a transfer of karma, at least where strongupvotes are concerned, rather than a \"fine.\" I pulled the -1 suggestion from <a href=\"https://stackoverflow.com/help/whats-reputation\">Stack Overflow</a>, where <i>all </i>downvotes incur -1 to reputation.&nbsp;</p>", "parentCommentId": "s2DCJtGNccbrPTEnJ", "user": {"username": "Jason"}}, {"_id": "86NCJ2AG4nvPQxdQj", "postedAt": "2023-01-03T07:04:13.069Z", "postId": "YmPnzpzo5dxPozinc", "htmlBody": "<p>Trying to give you more fame here , but looks like you won't quite reach the dizzying heights/depths of your previous comment :D.</p>", "parentCommentId": "xZ32jk5aQcCmCvNqY", "user": {"username": "NickLaing"}}, {"_id": "dvxqFBepmYH9F6ijf", "postedAt": "2023-05-30T13:49:38.184Z", "postId": "YmPnzpzo5dxPozinc", "htmlBody": "<blockquote><p>Unsurprisingly there is a strong relationship between overall karma and agreement</p></blockquote><p>I'm not sure a strong correlation here is <i>super</i> unsurprising, and, even if it is, I can think of two rather different explanations:</p><ol><li>Despite the split regular/agreement karma system's raison d'etre being to separate out evaluations of usefulness from evaluations of agreement, people are implicitly biased and, on average, rate comments they agree with as better contributions than they really are.</li><li>There's a positive correlation between what people tend to agree with, and what's actually true. There's also a positive correlation between what's a useful contribution, and what's true. Therefore, there's a positive correlation between agreement karma (comments people tend to agree with) and regular karma (comments that make useful contributions).</li></ol><p>One could view these two explanations as forming an axis, with (1) being at the \"(EA Forum voting is) epistemically unvirtuous\" end and (2) being at the \"epistemically virtuous\" end. I personally suspect voting is closer to virtuous than unvirtuous, but I wouldn't take this as given, and I also suspect that, in theory at least, there's room for improvement. (In practice, though, steering voting further in the epistemically virtuous direction may be difficult. I tried thinking for five minutes but couldn't come up with any potentially promising interventions.)</p>", "parentCommentId": null, "user": {"username": "Will Aldred"}}, {"_id": "3PAyudisZYwnqTD7T", "postedAt": "2023-05-30T15:30:37.679Z", "postId": "YmPnzpzo5dxPozinc", "htmlBody": "<p>There's a 3rd reason, which I expect is the biggest contributor. Number of readers of the post/comment.</p>", "parentCommentId": "dvxqFBepmYH9F6ijf", "user": {"username": "Simon_M"}}, {"_id": "KLEAnhaLYycFH9fge", "postedAt": "2023-05-30T16:42:29.113Z", "postId": "YmPnzpzo5dxPozinc", "htmlBody": "<p>I think this 3rd explanation can be decomposed into the first two (and possibly others that I haven't laid out)?</p><p>(For what it's worth, I agree with a \"<a href=\"https://forum.effectivealtruism.org/posts/KFMMRyk6sTFReaWjs/you-don-t-have-to-respond-to-every-comment\"><u>You don’t have to respond to every comment</u></a>\" norm. So, don't feel obligated to reply, especially if you think—as may well be the case—that I'm talking past you and/or that I'm missing something and the resulting inferential distance is large.)</p>", "parentCommentId": "3PAyudisZYwnqTD7T", "user": {"username": "Will Aldred"}}]