[{"_id": "HPsgdWEbdEZH3WN6j", "postedAt": "2022-10-31T05:01:36.770Z", "postId": "YnBwoNNqe6knBJH8p", "htmlBody": "<p>Nice. This post and the previous post did significantly clarify what a post like Luisa's is/should be measuring.&nbsp;</p><p>Some very speculative thoughts -</p><p>Not sure we need to classify extinction as human descendants dying, or even make extinction a binary. If animals are still alive there is a higher base rate of intelligent life popping than if not, if mammals are alive then probably higher still, etc. &nbsp;Perhaps the chance of getting to interstellar civilization is just so much lower if humans die that this distinction is just unnecessarily complicated, but I'm not sure and think it's at least worth looking into. I'm sure people who are into the hard steps model have thought about this a bit. &nbsp;</p><p>This is sort of an insane thought, but if we figure out the necessary environmental pressures to select for intelligence, we can try to genetically modify the earth's habitats so that if humans go extinct the chance of another intelligent species evolving will be higher.&nbsp;</p><p>The way I see the decay model, outside of culture change stuff, is that we need some amount of available resources (energy, fertilizer, etc.) to get to interstellar. As time passes on earth and humans are alive, we will burn through non-renewable resources, thus reducing the potential resources on earth. However, humans can invent renewable resources. Moreover, we can use renewable resources now to create non-renewable resources and put them in the ground. So is decay the fundamental state of things? If we put a bunch of fusion reactors everywhere, couldn't the available energy go up, even if there is less coal/oil? And what if we figure out how to create phosphorus or a new fertilizer that we can make/ or a different farming paradigm? &nbsp;Edit: I just listened to <a href=\"https://open.spotify.com/episode/6b8FZru8xh90GSN7KEpUvE?si=RBf5WM1CRPGJWsxeR9vk9g&amp;nd=1\">this</a> podcast and lewis dartnell seems to think this \"green reboot\" isn't super possible, &nbsp;but I didn't really follow his logic. He seemed to focus heavily on not being able to re-make photo-voltaics and not on the fact that future people could access the existing renewable tech lying around.&nbsp;</p><p>This seems to present an opportunity. Leaving anti-decay objects everywhere, but not WMDs, we can speed up recovery without equivalently speeding up military technology. The important thing here is that it disputes your assumption that civilization-harming weaponry is critical on the path to ICs. If we leave sufficient energy production for the next civilization and a blueprint for spaceships, perhaps they can liftoff before an inevitable military buildup gets especially perilous.</p>", "parentCommentId": null, "user": {"username": "Charles_Guthmann"}}, {"_id": "soH8a65bdhxPgqGnr", "postedAt": "2022-10-31T10:49:26.521Z", "postId": "YnBwoNNqe6knBJH8p", "htmlBody": "<p>Thanks Charlie... there's a lot to unpack here!&nbsp;</p><blockquote><p>Not sure we need to classify extinction as human descendants dying, or even make extinction a binary.</p></blockquote><p>I think this is worth looking into. My first thoughts, not really meant to establish any proposition:</p><ul><li>You can kind of plug this into the models above, and just treat reference to human-descendants as Earth-originating life. Obviously you'll lose some fidelity, and the time-insensitivity problem would start to look more of a concern</li><li>In particular, on the timescales on which new intelligent non-mammalian species would emerge (I'm imagining 10-100 million years if most mammals go extinct), we might actually start losing significant expected value from the delay</li><li>The timescale doesn't actually seem enough for fossil fuels to replenish, so if that turns out to be the major problem facing our descendants, a new species probably wouldn't fare any better</li><li>So for it to be a major factor, you'd probably have to believe both that whatever stopped humans from becoming interstellar was a relatively sudden extinction event rather than a drawn out failure to get the requisite technology, and that whatever killed us left a liveable planet behind</li></ul><blockquote><p>we can try to genetically modify the earth's habitats</p></blockquote><p>This feels like it would be a very expensive project and very sensitive to natural selection un-modifying itself unless those traits would have been selected for anyway!</p><blockquote><p>However, humans can invent renewable resources</p></blockquote><p>If I understand you right, &nbsp;you're imagining human resources generally leading to efficiency gains in a virtuous circle? If so, I would say I agree that's plausible from our current state in which we're lucky enough to have plenty of energy spare to devote to such work (though maybe even now it [could be tough](https://forum.effectivealtruism.org/posts/wXzc75txE5hbHqYug/the-great-energy-descent-short-version-an-important-thing-ea)) - but the worse your starting technology, the higher a proportion of your population need to work in agriculture and other survival-necessary roles, and so the harder it becomes to do the relevant research.</p><blockquote><p>what if we figure out how to create phosphorus&nbsp;</p></blockquote><p>Phosphorus is an atom, so not something we can create or destroy (at least without very advanced technology). The problem is its availability - how much energy it costs to extract in a useable form. At the moment, we're extracting the majority of what we use from high-density rocks, which will run out, and we're flushing most of <i>that</i> into lakes and oceans where, from what I understand (though I've found it hard to find work on this), it's basically impossible to reclaim even with modern technology. So future civilisations will have less energy with which to extract it, and lower energy efficiency of the extraction process.</p><blockquote><p>or a new fertilizer that we can make</p></blockquote><p>What makes phosphorus useful both in growing plants and in us eating those plants is it's a major component of human chemistry. In this sense, you can't replace it (at least, not without dramatically altering human chemistry). Less phosphorus basically = fewer humans.</p><blockquote><p>If we leave sufficient energy production for the next civilization and a blueprint for spaceships, perhaps they can liftoff before an inevitable military buildup gets especially perilous.</p></blockquote><p>If you mean actually building spare energy technology for them, in a sense that's what all our energy technology is - we put it in the places where it's most useful to current humans, who are living there because they're the most habitable places. But windmills, solar panels, nuclear reactors etc need constant maintenance. Within a couple of generations they'd probably all have stopped functioning at a useful level. So what you need to leave future generations is knowledge of how to rebuild them, which is both trivial in the sense that it's what we're doing by scattering technology around the world for them to reverse engineer and extremely hard in the sense that leaving anything more robust requires a lot of extra work both to engineer it well enough and to protect it from people who might destroy it before understanding (or caring about) its value.&nbsp;</p><p>I can think of a few organisations working on this - I think it's a big part of Allfed's mission, there's the Svalbard Global Seed Vault on a Norwegian Island, and in some sense knowledge preservation is the main value of refuges and fallout shelters - but I haven't looked into it closely, and I'd be surprised if there weren't many others (I think it's something Western governments have at least some contingency plans for).</p><p>It doesn't seem realistic to let them develop the economy to settle other planets without getting any harmful tech, though. <i>We</i> don't have good enough rocket technology to send much mass other planets yet, so the future civilisations would have to leapfrog our current capabilities without getting any time to develop eg biotech on the way. And Robert Zubrin, the main voice for Mars colonisation strategies before Elon Musk, thinks it would be almost impossible to set up a permanent Mars base without nuclear technology, so you'd need to develop nuclear energy without getting nuclear weaponry.</p>", "parentCommentId": "HPsgdWEbdEZH3WN6j", "user": {"username": "Arepo"}}, {"_id": "QjdxHE7jbsjiZwtuf", "postedAt": "2022-11-03T14:09:11.953Z", "postId": "YnBwoNNqe6knBJH8p", "htmlBody": "<p>I like this type of models very much! As it happens, a few years ago I had <a href=\"https://www.mdpi.com/2071-1050/10/6/1947\">a paper in <i>Sustainability</i></a> that used an even simpler model in a similar spirit, which I used to discuss and compare the implications of various normative systems.</p><blockquote><p>Abstract: We introduce and analyze a simple formal thought experiment designed to reflect a qualitative decision dilemma humanity might currently face in view of anthropogenic climate change. In this exercise, each generation can choose between two options, either setting humanity on a pathway to certain high wellbeing after one generation of suffering, or leaving the next generation in the same state as the current one with the same options, but facing a continuous risk of permanent collapse. We analyze this abstract setup regarding the question of what the right choice would be both in a rationality-based framework including optimal control, welfare economics, and game theory, and by means of other approaches based on the notions of responsibility, safe operating spaces, and sustainability paradigms. Across these different approaches, we confirm the intuition that a focus on the long-term future makes the first option more attractive while a focus on equality across generations favors the second. Despite this, we generally find a large diversity and disagreement of assessments both between and within these different approaches, suggesting a strong dependence on the choice of the normative framework used. This implies that policy measures selected to achieve targets such as the United Nations Sustainable Development Goals can depend strongly on the normative framework applied and specific care needs to be taken with regard to the choice of such frameworks.</p></blockquote><p>The model is this:</p><p><img src=\"https://www.mdpi.com/sustainability/sustainability-10-01947/article_deploy/html/images/sustainability-10-01947-g001-550.jpg\"></p><p>Here L is the current \"lake\" state, from which action A (\"taking action\") certainly leads to the absorbing \"shelter\" state S via the passing \"valley of tears\" state P, while action B (\"business as usual\") likely keeps us in L but might also lead to the absorbing \"trench\" state.</p><p>The names \"lake\", \"shelter\", \"trench\" I had introduced earlier in <a href=\"https://esd.copernicus.org/articles/7/21/2016/\">another paper on sustainable management</a> that contained this figure to explain that terminology:</p><figure class=\"image image_resized\" style=\"width:43.69%\"><img src=\"https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/6fbf2381d2b8a62e2d8f03ffea5ef85fa3485d3a44946c43.png\" srcset=\"https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/6fbf2381d2b8a62e2d8f03ffea5ef85fa3485d3a44946c43.png/w_134 134w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/6fbf2381d2b8a62e2d8f03ffea5ef85fa3485d3a44946c43.png/w_214 214w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/6fbf2381d2b8a62e2d8f03ffea5ef85fa3485d3a44946c43.png/w_294 294w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/6fbf2381d2b8a62e2d8f03ffea5ef85fa3485d3a44946c43.png/w_374 374w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/6fbf2381d2b8a62e2d8f03ffea5ef85fa3485d3a44946c43.png/w_454 454w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/6fbf2381d2b8a62e2d8f03ffea5ef85fa3485d3a44946c43.png/w_534 534w\"></figure><p>(Humanity sits in a boat and can row against slow currents but not up waterfalls. The dark half is ethically undesirable, the light half desirable. We are likely in a \"lake\" or \"glade\" state now, roughly comparable to your \"age of perils\". Your \"interstellar\" state would be a \"shelter\".)</p>", "parentCommentId": null, "user": {"username": "Jobst Heitzig (vodle.it)"}}, {"_id": "qgQGpsDYfbA3ymAha", "postedAt": "2022-11-06T09:39:45.553Z", "postId": "YnBwoNNqe6knBJH8p", "htmlBody": "<p>Thanks, I think this is a pretty valuable series!</p><p>FYI, I have estimated <a href=\"https://forum.effectivealtruism.org/posts/EixrWYgkox7noLacn/probability-of-extinction-for-various-types-of-catastrophes\">here</a> the probability of extinction for various types of catastrophes.</p><blockquote><p>The inputs are predictions from Metaculus’ <a href=\"https://www.google.com/url?q=https://www.metaculus.com/questions/?search%3Dcat:series--ragnarok&amp;sa=D&amp;source=editors&amp;ust=1665325154020588&amp;usg=AOvVaw0e06Fm9lrHtUOiwvd1Gbb9\"><u>Ragnarok Series</u></a><a href=\"https://forum.effectivealtruism.org/posts/EixrWYgkox7noLacn/probability-of-extinction-for-various-types-of-catastrophes#fngjgc5emnyyl\"><sup>[2]</sup></a>, and guesses from me, and provided by Luisa Rodriguez <a href=\"https://www.google.com/url?q=https://forum.effectivealtruism.org/posts/GsjmufaebreiaivF7/what-is-the-likelihood-that-civilizational-collapse-would&amp;sa=D&amp;source=editors&amp;ust=1665325154020885&amp;usg=AOvVaw3OAkbVb938m5u9YR-CssLl\"><u>here</u></a>.</p></blockquote>", "parentCommentId": null, "user": {"username": "vascoamaralgrilo"}}, {"_id": "MQ9ShgY5avceNPRAK", "postedAt": "2022-11-17T00:11:35.936Z", "postId": "YnBwoNNqe6knBJH8p", "htmlBody": "<p>responding to this super late but two quick things.&nbsp;</p><blockquote><p>But windmills, solar panels, nuclear reactors etc need constant maintenance. Within a couple of generations they'd probably all have stopped functioning at a useful level</p></blockquote><p>Does anyone have incentives to make long-lasting renewable resources? &nbsp;Curious about what would happen if a significant portion of energy tech switched from trying to optimize efficiency to lifespan (my intuition here is that there isn't much incentive to make long-lasting stuff). Seems like this could be low-hanging fruit and change the decay paradigm - of course, possible this has been extensively looked at and I'm out of my depth.</p><blockquote><p>It doesn't seem realistic to let them develop the economy to settle other planets without getting any harmful tech, though. <i>We</i> don't have good enough rocket technology to send much mass other planets yet, so the future civilisations would have to leapfrog our current capabilities without getting any time to develop eg biotech on the way. And Robert Zubrin, the main voice for Mars colonisation strategies before Elon Musk, thinks it would be almost impossible to set up a permanent Mars base without nuclear technology, so you'd need to develop nuclear energy without getting nuclear weaponry.</p></blockquote><p>I guess I wouldn't see this as a binary. Can we set up a civilization that will get to space before creating nukes, via well-placed knowledge about spaceships that conveniently don't include stuff about weapons? probably not, but it's not a binary. We could in theory push in this direction to reduce the time of perils length or magnitude.&nbsp;</p><p>and regarding the phosphorus stuff, I've unfortunately exposed my knowledge of the hard sciences.&nbsp;</p>", "parentCommentId": "soH8a65bdhxPgqGnr", "user": {"username": "Charles_Guthmann"}}]