[{"_id": "rtp9CKhjZBJtCyrD3", "postedAt": "2022-09-19T08:23:21.899Z", "postId": "YNcjDoH6DaHzfhWGb", "htmlBody": "<p>I'm understanding the TLDR to be \"EAG organizers should be more deliberate about COVID precautions.\" Correct me if I'm wrong.<br><br>I think that's a great idea! I estimate that 70-95% of EAG-SF participants did not wear a mask consistently during the conference. Conclusion: at the next EAG, people are again going to accept high COVID risk as the default, unless EAG organizers set different policies.</p>", "parentCommentId": null, "user": {"username": "jakubkraus07@gmail.com"}}, {"_id": "KBagupJDGh7wBhSm5", "postedAt": "2022-09-19T08:56:41.360Z", "postId": "YNcjDoH6DaHzfhWGb", "htmlBody": "<p>From my read it's more like: Try to be more hardcore about it, because that has some value of information, e.g., about how well current techniques work.</p>", "parentCommentId": "rtp9CKhjZBJtCyrD3", "user": {"username": "NunoSempere"}}, {"_id": "zG6r6XC7jHsddaFY7", "postedAt": "2022-09-19T11:10:24.912Z", "postId": "YNcjDoH6DaHzfhWGb", "htmlBody": "<p>Organizational response like upper-room UV isn't about how participants act. I think Josh is pushing for the organizers to try to do things to keep people safe, regardless of mask wearing. (And that has other benefits as well, as a proof-of-concept.)</p>", "parentCommentId": "rtp9CKhjZBJtCyrD3", "user": {"username": "Davidmanheim"}}, {"_id": "88a4hAjaDpmKYiRLj", "postedAt": "2022-09-19T12:32:21.527Z", "postId": "YNcjDoH6DaHzfhWGb", "htmlBody": "<p>Yes, David and Nuno's interpretation was my intended meaning. Sorry to be unclear. The goal here is to implement (presumably impermanent) built environment controls that make the air safe regardless of individual behavior.&nbsp;</p><p>To be fair, if we tried to do this and &nbsp;it seemed impossible to accomplish a meaningful goal without source control (masking) that would also be useful info to discover.</p>", "parentCommentId": "zG6r6XC7jHsddaFY7", "user": {"username": "joshcmorrison"}}, {"_id": "nXq3adN7agGjuh8Zb", "postedAt": "2022-09-19T12:45:37.266Z", "postId": "YNcjDoH6DaHzfhWGb", "htmlBody": "<p>Does it make sense to do this at an event that lasts 3 days? Is it worth the costs of such an intervention, relative to doing this in a space that's occupied long-term (e.g. Trajan House)?</p>\n<p>In other words, are there candidate interventions that only require mobile equipment and not (semi-)permanent changes to buildings?</p>\n", "parentCommentId": null, "user": {"username": "Guy Raveh"}}, {"_id": "uwGkvQ3DSbEAQuFE6", "postedAt": "2022-09-19T14:08:14.540Z", "postId": "YNcjDoH6DaHzfhWGb", "htmlBody": "<p>That is true, but I also do think that the symbolic value of doing it is very high. If you're a community that believes that the government should do [policy] it is not only good PR but also makes you understand your beliefs better if you also pursue that policy (to the extent that you can scale it down)</p>", "parentCommentId": "rtp9CKhjZBJtCyrD3", "user": {"username": "pradyusp"}}, {"_id": "hDATDd6gfZy2PBpAM", "postedAt": "2022-09-19T14:31:47.182Z", "postId": "YNcjDoH6DaHzfhWGb", "htmlBody": "<p>Agreed, I meant \"COVID precautions\" more broadly. 2nd paragraph was just to illustrate that this won't happen by default, although for things like upper-room UV that was already clear.</p>", "parentCommentId": "zG6r6XC7jHsddaFY7", "user": {"username": "jakubkraus07@gmail.com"}}, {"_id": "AiXdPnfokf3MrqJdn", "postedAt": "2022-09-19T16:26:10.576Z", "postId": "YNcjDoH6DaHzfhWGb", "htmlBody": "<p>Hi Josh — jumping in as the lead organizer for EA Global. While I think this could be interesting, as someone else commented I’m skeptical this would be worth it for an event lasting only three days, and would be more excited about people trialing this in office spaces or something else more permanent.</p><p>Additionally, taking a lot of these actions for a three day event would be quite logistically challenging (though not impossible). I’m not sure there’s a way to rent air filtration equipment and it would be non-trivial to buy it and then store it or give it away — and I doubt it would be worth convincing a venue to undergo construction work to install air filtration systems in the building. With a lot of household air purifiers (i.e., the ones you can get on Amazon), there are also trade-offs re noise pollution — with an event the size of EA Global, we’d need a lot of these, and altogether these could be quite loud. We very frequently get complaints that people can’t hear each other at our events, so this could make things even more problematic. This means that at the end of the day there are other marginal improvements to the conference I’m more excited about making.</p>", "parentCommentId": null, "user": {"username": "Eli_Nathan"}}, {"_id": "BkXPookk7bhH6EiLN", "postedAt": "2022-09-19T16:27:16.147Z", "postId": "YNcjDoH6DaHzfhWGb", "htmlBody": "<p>Minor, personal (non-CEA) take that isn’t really core to your post — I’m actually somewhat critical of the microCOVID project and don’t see it as a great example of EA in action. As I understand it, this involved people managing their personal risk exposure to a virus that at the time was considered to not be that dangerous to young and healthy people, rather than working on x-risk or another EA priority. While cool and interesting, it seems not that different to building an app for managing one’s exercise routine, for example.</p>", "parentCommentId": null, "user": {"username": "Eli_Nathan"}}, {"_id": "XDxae8kNoyRfoqsHi", "postedAt": "2022-09-19T16:53:57.539Z", "postId": "YNcjDoH6DaHzfhWGb", "htmlBody": "<p>Perhaps I'm reading into it too much, but the implication in the title is that the indoor air at EAG was somehow unsafe.</p>\n<p>I don't want people to get that impression, or in the worst case, avoid EAG because they think the air is unsafe.</p>\n<p>Venues that have hosted EAG have commercial ventilation.  These spaces provide at least a continuous 20 cfm per person of filtered, conditioned air, and the committee that sets those standards is acutely aware of the tradeoff between energy use from higher ventilation rates and health.</p>\n<p>There is far greater risk from indoor house after-parties, as older residential homes don't have ventilation and even if they do they were never designed to handle that many people.</p>\n<p>We could ask the venue to make sure the filters on the air handlers were changed recently.  And/or sprinkle in-room air cleaners throughout the meeting areas.  People that have a much lower risk tolerance should just wear masks.</p>\n", "parentCommentId": null, "user": {"username": "MatthewDahlhausen"}}, {"_id": "ZEBaa8wumwycBvQX6", "postedAt": "2022-09-19T17:08:10.447Z", "postId": "YNcjDoH6DaHzfhWGb", "htmlBody": "<p>Yeah there are considerations on both sides. On the one hand, you can't install permanent changes and it's a short period of time. On the other, events where large numbers of people mix from a wide number of locations probably have a unique role in spreading infectious disease + conferences have a unique need to prove COVID safety and venues might compete on those grounds, so establishing a model in that context could be particularly useful.</p><p>It's not that I think \"get all EA offices to implement optimal indoor air safety\" is a bad idea (or necessarily a worse idea than EA Global doing it), and I'll probably send some emails today in that vein. But the EA Global version &nbsp;appeals to me for two reasons: 1. It is a shared space for the EA community (unlike particular offices owned by particular organizations), which makes it a chance for us to express our values; and 2. the fact that it's an event on a specific date creates a deadline, which i think has a lot of value in improving productivity and forcing decisions.&nbsp;</p>", "parentCommentId": "nXq3adN7agGjuh8Zb", "user": {"username": "joshcmorrison"}}, {"_id": "yzkgLBbmBjG3tmJcQ", "postedAt": "2022-09-19T17:18:12.191Z", "postId": "YNcjDoH6DaHzfhWGb", "htmlBody": "<p>It's 3 days, but it's hundreds of people mixing with people from all over (so high chance someone has something other people don't), many of whom arrived in mass transit (last minute chance to catch something), are sleeping less and eating worse than normal (stressing the immune system), continuously talking in mostly crowded rooms (easy spreading).</p>\n<p>Even if you don't think covid is unusually dangerous, I think standard cold and flu risk, and the fact that high co2 reduces efficacy, justifies caring a lot about air quality.</p>\n", "parentCommentId": "AiXdPnfokf3MrqJdn", "user": {"username": "Elizabeth"}}, {"_id": "wBpx9R6jaCpdBsRxR", "postedAt": "2022-09-19T17:25:55.286Z", "postId": "YNcjDoH6DaHzfhWGb", "htmlBody": "<p>Sorry, that was not my intention: I'm not at all casting aspersions on EA Global or claiming that EA Global is less safe than other conferences or average spaces with commercial ventilation. I just think we can do better, and this is a worthy challenge to take on.&nbsp;</p><p>Another way of stating my intuition here (apart from the view that piloting indoor air safety interventions has a unique value at this moment in time) is that 1. EA spaces should make a deliberate effort to vacuum out infectious disease risk from the community* rather than be a passive medium through which infection spreads and 2. that this risk vacuum norm would be a &nbsp;good one to model for other spaces/actors to adopt.</p><p>*By which I mean something vaguely like either: 1. in a world with optimal indoor air safety measures, someone's presence in an EA space should not increase the risk of respiratory disease transmission vs. their presence in a comparable space, 2. spending time in this space should reduce the risk of transmitting infection vs. other ways a person could spend their time, or 3. assuming it were possible to establish how spending time in different spaces contributed to transmitting respiratory infection and a risk budget for daily life could be created such that the effective rate of transmission for (all?) respiratory infection were below ~0.9, spending time in this space would not spend a person's budget at a rate greater than other social behavior.&nbsp;</p>", "parentCommentId": "XDxae8kNoyRfoqsHi", "user": {"username": "joshcmorrison"}}, {"_id": "hJer6mhsv4zryZwwr", "postedAt": "2022-09-19T17:31:37.400Z", "postId": "YNcjDoH6DaHzfhWGb", "htmlBody": "<p>Convincing a venue to implement it well (or rewarding one that has already done that) will have benefits that last more than three days.</p>\n", "parentCommentId": "AiXdPnfokf3MrqJdn", "user": {"username": "PeterMcCluskey"}}, {"_id": "ZKTFr6suwatzxaWWE", "postedAt": "2022-09-19T17:42:38.561Z", "postId": "YNcjDoH6DaHzfhWGb", "htmlBody": "<blockquote>\n<p>are there candidate interventions that only require mobile equipment and not (semi-)permanent changes to buildings?</p>\n</blockquote>\n<p>Fortunately, yes. Within-room UVC (upper-room 254nm and lower-room 222nm) can be provided by mobile lights on tripod stands.</p>\n<p>This is what the JHU Center for Health Security did for their IAQ conference last month. (Pictures at <a href=\"https://twitter.com/DrNikkiTeran/status/1567864920087138304\">https://twitter.com/DrNikkiTeran/status/1567864920087138304</a> )</p>\n", "parentCommentId": "nXq3adN7agGjuh8Zb", "user": {"username": "rossry"}}, {"_id": "NBdFyF6nC5FpijBmJ", "postedAt": "2022-09-19T17:43:19.071Z", "postId": "YNcjDoH6DaHzfhWGb", "htmlBody": "<p>This is a problem where I think we can get some returns with minimal investment. For example, maybe just ask volunteers to bring in their air purifiers from home and hook them up during the day. That won't be a perfect solution, but it will provide cleaner air than having no purifiers. This seems like a space where we can get something like logarithmic returns on effort, which means even doing a little can be quite impactful.</p>", "parentCommentId": "AiXdPnfokf3MrqJdn", "user": {"username": "gworley3"}}, {"_id": "JmvM9gjrSEHGznuoc", "postedAt": "2022-09-19T18:20:57.977Z", "postId": "YNcjDoH6DaHzfhWGb", "htmlBody": "<p>Minor point, but I'll note that most volunteers come from out of town, and I expect only a minority of them own air purifiers anyway.</p>", "parentCommentId": "NBdFyF6nC5FpijBmJ", "user": {"username": "Eli_Nathan"}}, {"_id": "cr74WFji3jGswEAZ8", "postedAt": "2022-09-19T20:49:39.966Z", "postId": "YNcjDoH6DaHzfhWGb", "htmlBody": "<blockquote>\n<p>a virus that at the time was considered to not be that dangerous to young and healthy people</p>\n</blockquote>\n<p>I don't think this was true at the time. Not even for a young, healthy person only caring about themselves.</p>\n<p>But I think the following categories probably cover 30-90% of participants in EA events anyway:</p>\n<ul>\n<li>People who have a health issue that makes them more susceptible</li>\n<li>People who aren't that young</li>\n<li>People who are close to someone in one of the above categories</li>\n<li>People who don't want to catch the disease because they know there's a high chance they'd infect other people</li>\n</ul>\n<p>I also don't think an efficient tool to help EAs with personal exercise would be a bad thing.</p>\n<p>In the end, you have a community of EAs, and you want people who'll do impactful work to come from that community. If the community is unhealthy, less people would join, and out of those who do join less people would be able to make an impactful contribution. Community health is a meta cause, but that doesn't make it inferior to \"direct work\" cause areas.</p>\n<p>Edit: with all of this said, I don't actually mean this as an endorsement of microCOVID. I didn't find it very useful, both because I wasn't sure what meaning I should really assign to the numbers, and because I didn't have much choice over my environment at EA Global.</p>\n", "parentCommentId": "BkXPookk7bhH6EiLN", "user": {"username": "Guy Raveh"}}, {"_id": "Tqa3H7bxnBf7GHuin", "postedAt": "2022-09-19T20:50:13.250Z", "postId": "YNcjDoH6DaHzfhWGb", "htmlBody": "<p>I like this take. Seems like this fits in a broader discussion of how rigorously we should try to line up actions with principles, ex: going vegan, not flying for climate, or more extreme things like going zero waste</p>\n", "parentCommentId": "BkXPookk7bhH6EiLN", "user": {"username": "Emily Dardaman"}}, {"_id": "YXWvBtucvdz2LniMR", "postedAt": "2022-09-19T20:54:43.420Z", "postId": "YNcjDoH6DaHzfhWGb", "htmlBody": "<p>I think we'd have to know how tractable improving air quality is (in terms of less spreading) to care about it a lot. Right now, at least from the OP it sounds experimental, as if the value of information is the main benefit.</p>\n", "parentCommentId": "yzkgLBbmBjG3tmJcQ", "user": {"username": "Guy Raveh"}}, {"_id": "TdA4BvSDN8t4iYb8n", "postedAt": "2022-09-19T21:43:55.580Z", "postId": "YNcjDoH6DaHzfhWGb", "htmlBody": "<p>Rather than focusing on ventilation, I suggest thinking about recommending the voluntary use of respirators (preferably the elastomeric kind) instead. The problem with ventilation (even if it was theoretically 100% effective) is that it's only as good as how it was setup and maintained, and during a dangerous pandemic, I wouldn't trust any of these external systems to function properly.</p>\n", "parentCommentId": null, "user": {"username": "Florin"}}, {"_id": "4YeALYLLArRbbwe8a", "postedAt": "2022-09-20T07:35:18.757Z", "postId": "YNcjDoH6DaHzfhWGb", "htmlBody": "<p>A small-cost (at least materially) and perhaps difficult intervention would be to get as many people flying in to wear a face mask on the airplane going to an event.&nbsp;<br><br>If I understand correctly flights is one of the highest risk activity for getting sick via air-borne diseases. My perhaps naïve understanding is that if something like 90% of participants wore a mask during their flight to an event, it would very cheaply and drastically reduce the risk that anyone at the event gets sick. Hopefully people going to the event worried about the stares they would get at the airport (been there, done that!) could just think \"I am doing this because this is a requirement for going to the conference so I do not feel to bad about people judging me.\"</p>", "parentCommentId": null, "user": {"username": "Ulrik Horn"}}, {"_id": "Av7AvqZMDoReGeKa4", "postedAt": "2022-09-20T17:16:20.206Z", "postId": "YNcjDoH6DaHzfhWGb", "htmlBody": "<p>It helped me know how much I should change my behaviour in a global pandemic, which I think was pretty beneficial to me and many other EAs. I can believe it saved a lot of EA time.</p>", "parentCommentId": "BkXPookk7bhH6EiLN", "user": {"username": "nathan"}}, {"_id": "Lah9dDsCxCCD3yv7Z", "postedAt": "2022-09-20T17:17:40.803Z", "postId": "YNcjDoH6DaHzfhWGb", "htmlBody": "<p>Given the amount of valuable time is wasted when people at EAG get sick, spending say 1% of the total budget to reduct the number of people who were sick in half seems good value for money?<br><br>Is this possible?</p>", "parentCommentId": null, "user": {"username": "nathan"}}, {"_id": "hXpNCnjGMmpJvRrBC", "postedAt": "2022-09-20T22:17:25.896Z", "postId": "YNcjDoH6DaHzfhWGb", "htmlBody": "<p>I think that microCOVID probably looks pretty good on EA grounds just via saving a bunch of EAs a bunch of time worrying about what their COVID policies should be. But I like your point.</p>", "parentCommentId": "BkXPookk7bhH6EiLN", "user": {"username": "Buck"}}, {"_id": "qNFSzgqQYWDKAzAgN", "postedAt": "2022-09-21T03:04:00.070Z", "postId": "YNcjDoH6DaHzfhWGb", "htmlBody": "<p>For doing this at an EAG, I think it could make sense to start doing this in a single (or a few) rooms as a trial. Should at least be much easier to convince venue &amp; organizers that it's not gonna be a major burden.</p>\n<p>Especially fitting if it's rooms used for biorisk discussions!</p>\n<p>Since eag's are already volunteer-heavy (I just volunteered at EAGxBerlin), it feels relatively plausible for you/somebody to take ownership of this idea:</p>\n<ul>\n<li>contact IAQ organizers and ask for more details &amp; retrospective (this feels worthwhile on it's own regardless! Very good forum content)</li>\n<li>contact CEA/organizing teams for upcoming conferences and pitch the idea\n<ul>\n<li>if other points work out: contact the venue</li>\n</ul>\n</li>\n<li>volunteer yourself (and/or recruit other interested) for the conference as responsible for the management &amp; running of the equipment</li>\n</ul>\n", "parentCommentId": null, "user": {"username": "John Litborn"}}, {"_id": "YSCCuLZZaekhG8oRe", "postedAt": "2022-09-21T03:17:18.486Z", "postId": "YNcjDoH6DaHzfhWGb", "htmlBody": "<p>in a related vein, just putting up air quality/CO2 monitors (and maybe noise while you're on it) could be a quite cheap &amp; scaleable intervention that might offer some valuable/interesting data. If attendees are getting unnecessarily fatigued from a bad environment it might cancel out a bunch of the value from the conference.</p>\n", "parentCommentId": null, "user": {"username": "John Litborn"}}, {"_id": "d6wER2kEuBug2uP5w", "postedAt": "2022-09-21T10:48:33.585Z", "postId": "YNcjDoH6DaHzfhWGb", "htmlBody": "<blockquote>\n<p>flights is one of the highest risk activity for getting sick via air-borne diseases</p>\n</blockquote>\n<p>Link?</p>\n", "parentCommentId": "4YeALYLLArRbbwe8a", "user": {"username": "Jeff_Kaufman"}}, {"_id": "zyhQYxS4TatAYEycF", "postedAt": "2022-09-21T11:17:22.490Z", "postId": "YNcjDoH6DaHzfhWGb", "htmlBody": "<p>Yeah sorry for not including that. I simply went by memory and had read articles such as <a href=\"https://www.cnet.com/health/10-activities-that-expose-you-to-coronavirus-from-most-to-least-risky/\">this one</a>, but not spent time digging into the details. I just consulted microCOVID (still not sure if this is super reliable though!) and indeed it seems going to a bar/nightclub is more than twice as risky (I got 2800 microCOVIDs for 6-hour flight where people talked at normal volume while a 2 hour visit to a bar resulted in 8900 microCOVIDs). Thanks for encouraging me to look it up although I am not sure it significantly changed my suggestion. But I would definitely recommend an expert to make a final recommendation on whether what I proposed is indeed an intervention with among the lowest cost/benefit ratios. I guess asking participants to not visit a bar before going to the event might be even more effective.</p>", "parentCommentId": "d6wER2kEuBug2uP5w", "user": {"username": "Ulrik Horn"}}, {"_id": "5vZbCEyiQNfxMnyZh", "postedAt": "2022-09-21T13:50:50.888Z", "postId": "YNcjDoH6DaHzfhWGb", "htmlBody": "<blockquote>\n<p>where people talked at normal volume</p>\n</blockquote>\n<p>Why are you modeling people on the flight as, on average, talking?  On flights I've been on most people are watching videos, reading, sleeping, eating, etc and only a few people traveling together talk.</p>\n<p>Microcovid gives more details on how they're modeling airplanes: <a href=\"https://www.microcovid.org/paper/all#airplanes\">https://www.microcovid.org/paper/all#airplanes</a></p>\n", "parentCommentId": "zyhQYxS4TatAYEycF", "user": {"username": "Jeff_Kaufman"}}, {"_id": "9Lx8Gs3TbBQXmisj9", "postedAt": "2022-09-21T16:27:26.062Z", "postId": "YNcjDoH6DaHzfhWGb", "htmlBody": "<p>At EAGx Berlin just now, I and a few others discussed 80/20 interventions.</p><p>My first suggestion was mandatory FFP2 or better masks indoors and many outdoors activities, ideally with some sort of protection from rain – a roof or tent.</p><p>Another participant anticipated the objection that people would probably object to that that it’s harder to read facial expressions with masks, which could make communication harder for those people who are good at using and reading facial expressions. A counter-suggestion was hence to mandate masks only for the listeners during talks since that is a time when they might fill a room with Covid spray but don’t need to talk.</p><p>Improving the air quality is another good option that I do a lot at home but haven’t modeled. It feels like one that is particularly suitable to EA offices and group houses.</p><p>The Less Wrong Community Weekend in Berlin was successful with very rigorous testing every day with the most sensitive test that is available.</p><p>All in all I would just like to call for a lot more risk modeling to get a better idea of the magnitude of the risks to EA and EAs, and then proportionate solutions (technical or social) to mitigate the various sources of risk. Some solution may be better suited for short events, some for offices and group houses.</p><hr><p>This seems all easily important enough that someone should quantitatively model it.&nbsp;</p><p><a href=\"https://www.facebook.com/drescher.denis/posts/pfbid08RhkhxZsdzic3NAAbH7ZKprPL6EuVcSEyVTyQP4XhqB5GgJWMMT5v5RUrVQkNbi2l\">I did the math for the last EAG London</a>, though I underestimated the attendee count by 3–4x. (Does someone know the number?)</p><p>Without mask, <strong>the event cost 6 years of EA time</strong> (continuous, so 24 hours in a day, not 8 h). Maybe it was worth it, maybe not, hard to tell. But if everyone had worn N95 or better masks, that would’ve been down to about 17 days. They could’ve kept about 100% of the value of EAG while reducing the risk to &lt; 1%.</p><p>If the event really had more like 900 attendees, then that’s almost 20 years of EA time that is lost in expectation through these events. I’m not trying to model this conservatively; I don’t know in which direction I’m erring.</p><p>One objection that I can see is that maybe this increases the time lost from EAGs by some low single digit factor, and since the event is only 3 days long, that doesn’t seem so bad on an individual level. (Some people spend over a week on a single funding application, so if it’s rejected, maybe that comes with a similar time cost.)</p><p>Another somewhat cynical objection could be that maybe there’s the risk that someone doesn’t contribute to the effective altruism enterprise throughout two decades of their life because they were put off by having to wear a mask and so never talked to someone who could answer their objections to EA. Maybe losing a person like that is as bad as a few EAs losing a total of 20 years of their lives. This seems overly cynical to me, but I can’t easily argue against it either.</p><p><a href=\"https://www.getguesstimate.com/models/19497\">My Guesstimate model is here.</a></p>", "parentCommentId": "nXq3adN7agGjuh8Zb", "user": {"username": "Telofy"}}, {"_id": "stkKvpdBFGFudcbAK", "postedAt": "2022-09-21T17:54:31.330Z", "postId": "YNcjDoH6DaHzfhWGb", "htmlBody": "<p>Having to wear masks would reduce the value of EAG by &gt;20% for me, mostly due to making 1-1s worse.</p>", "parentCommentId": "9Lx8Gs3TbBQXmisj9", "user": {"username": "tkwa"}}, {"_id": "G3ZEYbAKifMkkBhBj", "postedAt": "2022-09-21T21:41:52.768Z", "postId": "YNcjDoH6DaHzfhWGb", "htmlBody": "<p>Sorry that I only have time for a short reply:</p>\n<ol>\n<li>\n<p>I don't think the OP was talking about interventions that require action from participants, like masks and testing, but rather about ones that the organisers deploy independently.</p>\n</li>\n<li>\n<p>Testing everyone might be good for COVID prevention, but again I think the point of the OP is about preventing airborne infections in general and not just COVID.</p>\n</li>\n<li>\n<p>I wasn't in the last EAG London but I think there were ~1500 people. I did go to the previous one, which had ~1000 people.</p>\n</li>\n<li>\n<p>That EAG London that I attended published details about every COVID case discovered in some time period after the conference (10 days or so?). I think there were &lt;20 infections out of those 1000 people. Does that match your model?</p>\n</li>\n</ol>\n", "parentCommentId": "9Lx8Gs3TbBQXmisj9", "user": {"username": "Guy Raveh"}}, {"_id": "G6x9vttmXSxDAHLtQ", "postedAt": "2022-09-22T04:52:09.960Z", "postId": "YNcjDoH6DaHzfhWGb", "htmlBody": "<p>Hi Jeff, thanks for taking the time to give a more expert view on this and helping me update my view on this topic.&nbsp;</p><p>To your question: I guess my subjective perspective of silent is perhaps different than the criteria used in the microCOVID calculations. &nbsp;I guess I might also have suffered some confirmation bias in choosing parameters \"favorably\".&nbsp;</p><p>I do want to emphasize the use of words/phrases such as \"perhaps\", &nbsp;\"if I understand correctly\" and \"naïve understanding\" in my original comment. I did not feel very confident in my original suggestion (perhaps I should not have posted? I am still new to the EAF and gladly accept advice on how to use it). I now think that perhaps (I am still not 100% convinced as the data on confirmed cases on flights seems scarce) flights, especially if they are on average in fact \"silent\", are substantially less risky than visiting a crowded, loud and poorly ventilated bar. Before you had the patience to walk me through the evidence, I had perhaps erroneously believed that taking a flight was on par with such an activity.</p><p>(one more reason for my suggestion is that I very often get sick when travelling by air no matter how much hand sanitizer I use. However, I very seldom get sick when going to bars and the like, perhaps except for the occasional hangover - haha!)</p>", "parentCommentId": "5vZbCEyiQNfxMnyZh", "user": {"username": "Ulrik Horn"}}, {"_id": "xFkc37RHsTopcrETP", "postedAt": "2022-09-22T08:34:31.098Z", "postId": "YNcjDoH6DaHzfhWGb", "htmlBody": "<ol><li>Yeah, but I can see Guy’s point that there’s some threshold where an event is short enough that a social intervention is cheaper than a technical one, so that different solutions are best for different contexts. But I don’t really have an opinion on that.</li><li>Hmm, true. Testing for fever maybe?</li><li>Thanks!</li><li>My model (based on Microcovid) would’ve predicted about 9 cases (3–26) for a 1,000-person event around nowish in Berlin. I don’t have easy access to the data of London back then, but the case count must’ve been higher. With these numbers we “only” lose about a year of EA time in expectation and have less than one case of long-covid.&nbsp;</li></ol>", "parentCommentId": "G3ZEYbAKifMkkBhBj", "user": {"username": "Telofy"}}, {"_id": "gtnCDrLEJB2nwJqGy", "postedAt": "2022-09-22T14:18:32.596Z", "postId": "YNcjDoH6DaHzfhWGb", "htmlBody": "<p>Thanks for spending the time thinking about this! My focus had not been masks because, insofar as they would make EAG safer in a cost-beneficial way, I don't think increasing mask adoption at EAG would have strong follow-on effects on other actors/the personal protective equipment (PPE) field in general. On the other hand, interventions to clean the air directly (ventilation, filtration, and UV light) seem to require better piloting on the critical path to wide adoption. Since a world with clean indoor air has both near-term health and long-term existential safety benefits my hypothesis is that piloting them in EA spaces is uniquely attractive compared to masks.</p><p>I know a lot of EAG biosecurity groups are excited about next-gen PPE and insofar as prototypes become available where EAG could serve as a useful testing ground, I'd become much more excited about implementing PPE there.</p><p>That said, I acknowledge your arguments that the direct benefits to EA health may justify masking. I personally do tend towards the \"I dislike wearing masks; I think they impose real burdens that likely outweigh the health benefits for EAs\" side of things, but I don't feel like my view on that is particularly well-justified.</p>", "parentCommentId": "xFkc37RHsTopcrETP", "user": {"username": "joshcmorrison"}}, {"_id": "r3EaXxCf2e3M863RZ", "postedAt": "2022-09-22T14:28:54.348Z", "postId": "YNcjDoH6DaHzfhWGb", "htmlBody": "<p>Air quality is in a funny place where 1. directionally, it is clear that removing pathogens from the air is definitely helpful in reducing infection (also removing other pollutants is useful as well) but 2. the level of benefit requires further research to quantify (i.e. if you remove 99% of pathogens from the air every hour, we don't know what % effect that will have on transmission). The benefit of piloting is A. it makes implementation and adoption much more efficient and convenient and B. it can generate evidence to help quantify the benefits.&nbsp;</p><p>That is all to say I think \"we shouldn't clean the air because we don't know the impact of cleaning the air\" ends up being a bit self-defeating (insofar as piloting air safety is the best way to generate evidence on the impact).</p>", "parentCommentId": "YXWvBtucvdz2LniMR", "user": {"username": "joshcmorrison"}}, {"_id": "TgeM77SqiJbdt3pwr", "postedAt": "2022-09-22T17:50:22.148Z", "postId": "YNcjDoH6DaHzfhWGb", "htmlBody": "<p>We have an <a href=\"https://www.phonesoap.com/products/airsoap\">AirSoap</a> at <a href=\"https://ceealar.org/\">CEEALAR</a>. It's meant to filter viruses out of the air; not sure how effective it has been. Could be a relatively simple 80/20 for smaller events at least.</p>", "parentCommentId": null, "user": {"username": "Greg_Colbourn"}}, {"_id": "GneXvW53yqLooSDvZ", "postedAt": "2022-09-24T19:46:44.141Z", "postId": "YNcjDoH6DaHzfhWGb", "htmlBody": "<p>I see! Yeah, I don’t have an overview of the bottlenecks in the biosecurity ecosystem, so that’s good to consider.</p>", "parentCommentId": "gtnCDrLEJB2nwJqGy", "user": {"username": "Telofy"}}, {"_id": "EhqtA3qiX6ABCXHrS", "postedAt": "2022-09-24T20:01:19.562Z", "postId": "YNcjDoH6DaHzfhWGb", "htmlBody": "<p>Another note on 4: A friend of mine contracted Covid at EAGx and says that she knows of many people how have. That’s just one pick from almost a thousand people. Her bubble may be unusually Covidious due to being a bubble with Covid though. So I don’t think Microcovid overestimates the risk of infection.</p><p>I’ve so far used the individual’s risk of infection and multiplied it with the number of individuals. But of course these people infect each other, so they are very much not independent. I would imagine that an EAG has either very few or very many infections. So that would require tracking the number over the course of several events to be able to average over them.</p><p>But a relatively Covid-conscious event like the Less Wrong Community Weekend may also cause or be correlated with more people afterwards reporting their Covid infections. A more Covid-oblivious EAG probably suffers underreporting afterwards. Maybe 10x from the same source that causes people not to fill in feedback surveys unless they are strongly coerced to and maybe another 10x from bad tests and bad sample-taking.</p><p>Some people don’t have the routine figured out of rubbing the swap first against the tonsils and then sticking it through the nose all the way down into the throat. Plus there are order-of-magnitude differences in the sensitivity of the self-tests. Bad tests and bad sample-taking can easily make a difference of 10x among the people who think they just had a random cold. So maybe a follow-up survey should ask about symptoms rather than confirmed positive tests, be embedded in various other feedback questions (so that it’s not just filled in by people with Covid), and then be used as a sample to extrapolate to the whole attendee population.</p><p>I’ve been trying to find studies on medical conferences but the only one I could find had various safety mechanisms in place, very much unlike EAGx, so it’s unsurprising that very few people got Covid. (I’m assuming that the vaccination statuses of the attendees are similar between a medical conference and an EAG.)</p>", "parentCommentId": "G3ZEYbAKifMkkBhBj", "user": {"username": "Telofy"}}, {"_id": "KRE6A6iZrJkJzguf3", "postedAt": "2022-11-22T07:58:02.874Z", "postId": "YNcjDoH6DaHzfhWGb", "htmlBody": "<p>(1) I do want to note that I don't think one should evaluate microcovid as though it was an altruistic action selected by a prioritization process! It was more like a selfish and friend-oriented project, which we made scalable enough to unlock big positive externalities in our broader community and beyond. The first version of the system was purely to save my own group house! (That said, I do think it's well-described as a project in the spirit of rationality, and a good example of rationality in action.)</p>", "parentCommentId": "BkXPookk7bhH6EiLN", "user": {"username": "catherio"}}, {"_id": "Wh6mG87jgEvihz8Ew", "postedAt": "2022-11-22T08:01:38.552Z", "postId": "YNcjDoH6DaHzfhWGb", "htmlBody": "<p>(2) Much more cantankerously: \"If your dear friends are suffering deeply, and you have created a system that can help, do not spend any spare time (outside your EA day job) on teaching them the system. You need to spend that spare time on altruistic things, not your friends' suffering. Certainly do not allow any motivated non-EA friends to spend THEIR time helping you build a scalable version for your entire community\" is not a moral system or set of community norms I can get behind.</p>", "parentCommentId": "BkXPookk7bhH6EiLN", "user": {"username": "catherio"}}]