[{"_id": "ZCPdGz9rgTP9go5fd", "postedAt": "2023-01-10T03:18:00.834Z", "postId": "YNcWioEzJwEHxbJ64", "htmlBody": "<p>To be sure, have you checked that there are not already private channels for this in other Spack groups? I welcome the initiative but I’m somewhat concerned about disaggregating into too many Slacks making communication difficult. Perhaps this could be merged with any existing channels or groups, or some could be shut down?</p>\n", "parentCommentId": null, "user": {"username": "david_reinstein"}}, {"_id": "2YtpswD4km5LXJBgJ", "postedAt": "2023-01-10T07:37:32.952Z", "postId": "YNcWioEzJwEHxbJ64", "htmlBody": "<p>I &nbsp;agree with this, there's both a communication and a memory-hogging issue for each new Slack workspace you bring in.<br>So many conversations you're in include a \"Yeah, I <i>think</i> I'm in that Slack space, not sure\" since a few of them look alike.<br><br>That aside, I applaud the creation and hope to contribute.</p>", "parentCommentId": "ZCPdGz9rgTP9go5fd", "user": {"username": "henrith"}}, {"_id": "8dbWSLP5sw4binfiA", "postedAt": "2023-01-10T09:48:06.307Z", "postId": "YNcWioEzJwEHxbJ64", "htmlBody": "<p>I am not an EA Manager, but a founding entrepreneur with lots of experience managing teams successfully looking to add a bit of impact. Happy to answer questions and provide advice.</p>", "parentCommentId": null, "user": {"username": "wachichornia"}}, {"_id": "mRRo4svBdmnetzEfD", "postedAt": "2023-04-17T23:24:43.707Z", "postId": "YNcWioEzJwEHxbJ64", "htmlBody": "<p>Hey David, you might already be aware, but Vaidehi Agarwalla has recently spearheaded a project to migrate numerous EA Slacks, Discords, etc into the EA Anywhere Slack.</p>\n<p><a href=\"https://docs.google.com/document/d/1YluxFbKmZipIXbzJDPWBqrTPtFMI_3pzWcidzZHT3OQ/edit?usp=sharing\">https://docs.google.com/document/d/1YluxFbKmZipIXbzJDPWBqrTPtFMI_3pzWcidzZHT3OQ/edit?usp=sharing</a></p>\n<p>Edit: I see you're one of the editors! I'll keep this comment up for others to reference.</p>\n", "parentCommentId": "ZCPdGz9rgTP9go5fd", "user": {"username": "Quinn McHugh"}}]