[{"_id": "TxPCEBsXZnowN8dFu", "postedAt": "2017-08-31T16:53:13.105Z", "postId": "YnXwXKbvmCDnHWx8s", "htmlBody": "<blockquote>\n<p>the Open Philanthropy Project (Open Phil) as the donor of last resort (unlikely to allow GFI to fall short when GFI likely advocate on behalf of investments for philanthropists who also support Open Phil)</p>\n</blockquote>\n<p>Do you have evidence that the funders of Open Phil have significant investments in plant-based meat or clean meat? And, if so, do you have evidence that Open Phil considers this in making grant decisions?</p>\n<blockquote>\n<p>Two groups working in a similar area to GFI.</p>\n</blockquote>\n<p>In addition to New Harvest and the Plant Based Food Association, there is the <a href=\"https://www.futuremeat.org/\">Modern Agriculture Foundation</a>.</p>\n", "parentCommentId": null, "user": {"username": "RandomEA"}}, {"_id": "gtkEdfb5RgGaWXSTE", "postedAt": "2017-08-31T16:59:42.173Z", "postId": "YnXwXKbvmCDnHWx8s", "htmlBody": "<p>After reading this post I'm still a bit confused as to why you doubt GFI specifically is a cost-effective target for donations relative to alternatives. Maybe you can try putting it in really simple terms in the comments? :)</p>\n", "parentCommentId": null, "user": {"username": "Robert_Wiblin"}}, {"_id": "2PwRtm9X4iGGr7u7T", "postedAt": "2017-08-31T17:07:02.697Z", "postId": "YnXwXKbvmCDnHWx8s", "htmlBody": "<p>Reading between the lines here, are you saying ACE may not be living up to EA standards given this and other recommendations it has made?</p>\n", "parentCommentId": null, "user": {"username": "gworley3"}}, {"_id": "y7cbPRKNPTB6mHbqb", "postedAt": "2017-08-31T17:08:14.652Z", "postId": "YnXwXKbvmCDnHWx8s", "htmlBody": "<p>I don’t doubt it is cost effective (ACE have said it is). What I am saying is that its financial needs are likely met, for instance Lewis Bollard says about GFI in relation to EA Funds “I’m also excited about the Good Food Institute’s work in this space, but I think that big funders (including Open Phil) will fill GFI’s funding needs in the medium term.”</p>\n<p>So I’m saying there isn’t much value in considering it as a viable donation opportunity if its needs are met.   I’m not saying it shouldn’t be funded, instead I am saying what could happen when we start to look elsewhere.</p>\n", "parentCommentId": "gtkEdfb5RgGaWXSTE", "user": {"username": "KevinWatkinson"}}, {"_id": "3oSLhF2ywj7nS4yca", "postedAt": "2017-08-31T17:39:18.078Z", "postId": "YnXwXKbvmCDnHWx8s", "htmlBody": "<p>It’s true I don’t know who gives money to New Crop Capital or the Open Philanthropy Project.  However, I think it is fairly ok to assume that people investing in meat alternative start ups could also be giving money to various groups that will support and promote their investments.  It is likely what I would do if I had a foundation.  </p>\n<p>As a claim it is a fairly intuitive one, because even if that wasn’t the case, I still believe Open Phil would fill a funding gap because GFI is highly rated by them, and they donated $1,000,000 to the fledgling project toward the end of last year. </p>\n<p>Thanks also for the link to MAF, I don't think i had heard of them, though I am aware of SuperMeat.</p>\n", "parentCommentId": "TxPCEBsXZnowN8dFu", "user": {"username": "KevinWatkinson"}}, {"_id": "ogcdcNAazn2nhvTv4", "postedAt": "2017-08-31T19:09:26.009Z", "postId": "YnXwXKbvmCDnHWx8s", "htmlBody": "<p>I think it depends how we choose to look at it.  GFI would certainly be a departure from what ACE generally agree upon as part of the seven criteria.  Though it doesn't really matter to me they did that, it could be the case that i wouldn't favour the group they replaced them with.  </p>\n<p>Maybe it would be Animal Equality. I think generally it could depend how concerned we would be about how they could have benefitted from Top Charity status.  Jon Bockman wrote the following article:  <a href=\"https://animalcharityevaluators.org/blog/our-2016-recommendation-of-animal-equality/\">https://animalcharityevaluators.org/blog/our-2016-recommendation-of-animal-equality/</a></p>\n<p>In a recent post ACE said they would fund their recommended charities if / when they meet a $1m fundraising target, and i disagreed with that for a number of reasons, not least because i think ACE need to do more work around establishing which animal groups meet the seven criteria (or maybe six, so we can include newer ones).  </p>\n<p>In that way it would be easier to look at alternative non-profits in the different areas people might be interested in.  At present it is difficult to discuss groups outside the top and standout charities within EA because we don't know whether they meet the seven criteria.  I think depending on which ethical theory we are using, it may be the mainstream groups aren't very appealing anyway, so i think there needs to be more scope for people to take different issues into account.</p>\n<p>The blog discussing fundraising restrictions, and how ACE will distribute funds if they exceed $1m.  <a href=\"https://animalcharityevaluators.org/blog/ace-fundraising-restrictions/\">https://animalcharityevaluators.org/blog/ace-fundraising-restrictions/</a></p>\n", "parentCommentId": "2PwRtm9X4iGGr7u7T", "user": {"username": "KevinWatkinson"}}, {"_id": "spbyWmgTMA3rFko23", "postedAt": "2017-08-31T21:03:31.014Z", "postId": "YnXwXKbvmCDnHWx8s", "htmlBody": "<p><em>Hi, I'm on the board of Animal Charity Evaluators and participated in some of the charity evaluation process. Here's a few of my own opinions. Note that this is not an official ACE response.</em></p>\n<p>-</p>\n<blockquote>\n<p>The idea that a group with no discernible track record would ascend to top charity status seemed an unlikely proposition. However, the decision itself seemed to have some basis in GFI arising out of Mercy for Animals*, a group which is a regular beneficiary of top ACE status.</p>\n</blockquote>\n<p>It's not truly the case that GFI has no track record. They have had a strong start and have had a few notable early successes, though unfortunately I believe some of their successes are not public information. For more, see <a href=\"https://animalcharityevaluators.org/charity-review/the-good-food-institute/#c5\">the relevant section in the GFI review</a>.</p>\n<p>That being said, it is true that GFI has a weaker track record than other organizations. The seven criteria were meant to help us rank charities, they were never meant to be a &quot;pass all seven or no recommendation&quot; gate. Moreover, the criteria are not binary... it's possible that exceptional performance on some of the criteria could make up for weaknesses on other criteria.</p>\n<p>-</p>\n<blockquote>\n<p>Some of the main considerations for making a funding decision about GFI would probably include factoring in such issues as diminishing returns, the funding gap (presently likely negligible),</p>\n</blockquote>\n<p><a href=\"https://animalcharityevaluators.org/charity-review/the-good-food-institute/#c1\">ACE's analysis is that the Good Food Institute could productively use $3M to $3.5M in 2017 fundraising</a>. That being said, this is not an exact science and productively using funding is also not a binary, so they certainly could excel with more.</p>\n<p>My understanding was as of the time of the recommendation, there still was a gap of $500K-$1M, even after <a href=\"http://www.openphilanthropy.org/focus/us-policy/farm-animal-welfare/good-food-institute-general-support\">the $1M grant by OpenPhil</a>. I do not believe this has been fully filled. Thus, I still think GFI represents a good use of funds.</p>\n<p>-</p>\n<blockquote>\n<p>and the scenario of the Open Philanthropy Project (Open Phil) as the donor of last resort (unlikely to allow GFI to fall short when GFI likely advocate on behalf of investments for philanthropists who also support Open Phil).</p>\n</blockquote>\n<p>I don't think OpenPhil operates that way, where they fully fund 100% of the organization to the point where the organization has no use of additional funds. They have written at length about how they balance their grants to specifically avoid being a donor of last resort (see <a href=\"http://blog.givewell.org/2014/12/02/donor-coordination-and-the-givers-dilemma/\">here</a>, <a href=\"http://blog.givewell.org/2014/12/19/donor-coordination-and-the-givers-dilemma-part-ii/\">here</a>, and <a href=\"http://blog.givewell.org/2015/11/25/good-ventures-and-giving-now-vs-later/\">here</a>).</p>\n<p>-</p>\n<blockquote>\n<p>If we choose to work outside EA Funds and Open Phil, then it is reasonably the case that we need to find alternatives to GFI, so we could start to look at other groups that might fit our criteria.</p>\n</blockquote>\n<p>You could consider other ACE top charities or standout charities. :) I think Mercy for Animals has the largest remaining funding gap right now (though that is my personal impression, not a careful or official analysis) among top charities.</p>\n<p>-</p>\n<blockquote>\n<p>As part of this process, if we accept the claims made by GFI, then I would suggest there is little value to be found elsewhere in the ‘mainstream’ (ideologically reducetarian) animal movement.</p>\n</blockquote>\n<p>I don't think this is true, as you do need to also build the demand for replacement meat products in addition to creating the supply.</p>\n<p>-</p>\n<blockquote>\n<p> For a starting point, I would be most interested in the Food Empowerment Project, perhaps Encompass (new), and Better Eating International (also new).  These groups wouldn’t represent a large funding opportunity, though a degree of funding will be required to help some of them develop further. </p>\n</blockquote>\n<p>I'd be interested in more analysis here. I personally donated $10K to Better Eating International and have privately and personally analyzed their operations and found them to be a great start-up organization to support. I believe they still have room for more funding and could productively use more funds, and I'd personally encourage other people to donate to them. That being said, donating to them is more risky than donating to ACE top charities, as they've received less overall vetting and have much less of a track record.</p>\n<p>I may personally write more about their activities in the future. It's also possible ACE may review them in the future, after they develop more of a track record.</p>\n<p>I do not yet have opinions about the Food Empowerment Project or Encompass. I'd be curious to hear more. It's possible these organizations may be reviewed by ACE (I don't personally know).</p>\n<p>-</p>\n<blockquote>\n<p>There is also a further option, that we consider whether EAs could prioritise meta-evaluation projects for ACE and other EA related groups.</p>\n</blockquote>\n<p>I think this would also be a great idea. Donations to ACE could certainly be used for this purpose.</p>\n<p>-</p>\n<blockquote>\n<p>Mercy for Animals has the appearance of a one stop shop for interventions.  Where various interventions are constructed without a corresponding assessment of how they fit (or don’t fit) together. </p>\n</blockquote>\n<p>MFA does do a lot of things, but from personal conversations with MFA staff I think they do have a very coherent and well-thought strategy for how they integrate all the different interventions.</p>\n", "parentCommentId": null, "user": {"username": "Peter_Hurford"}}, {"_id": "g8tQgy2ytcZS7KGZg", "postedAt": "2017-08-31T21:05:06.062Z", "postId": "YnXwXKbvmCDnHWx8s", "htmlBody": "<p>ACE does not have an official policy of requiring there to be three top charities. It's possible there could be two or four or another number. So it's not necessarily the case that GFI would have been replaced by something else.</p>\n", "parentCommentId": "ogcdcNAazn2nhvTv4", "user": {"username": "Peter_Hurford"}}, {"_id": "t9TcqLZBpcMGpywA5", "postedAt": "2017-08-31T21:26:11.781Z", "postId": "YnXwXKbvmCDnHWx8s", "htmlBody": "<p>I work for ACE, but below are my immediate personal thoughts. <em>This is not an official ACE response.</em></p>\n<blockquote>\n<p>There is also a further option, that we consider whether EAs could prioritise meta-evaluation projects for ACE and other EA related groups. If we desire to optimise evidence based (rather than more ideologically weighted) opportunities for donors, it could be argued that we ought to limit donations until these criteria are met…</p>\n</blockquote>\n<p>Just to be clear, you are proposing that EAs stop donating to ACE and ACE’s top charities and instead use the money to fund an external review of ACE. This is a dramatic proposition.</p>\n<p>ACE believes transparency is extremely important. It would not be difficult for an external reviewer to go through ACE’s materials privately. <a href=\"https://animalcharityevaluators.org/blog/response-to-a-recent-critique-of-our-research/\">We welcome such criticism</a>, and when we find that we’ve made a mistake, <a href=\"https://animalcharityevaluators.org/transparency/mistakes/\">we publicly announce those mistakes</a>.</p>\n<p>If you’re serious about performing an evaluation of ACE, you should be aware of our most recent <a href=\"https://animalcharityevaluators.org/transparency/internal-evaluations/\">internal evaluation</a> as well as <a href=\"http://blog.givewell.org/2013/03/01/external-evaluation-of-our-research/\">GiveWell’s stance on external evaluation</a>.</p>\n<p>With that said, I don’t believe that the effort/expense of going through an external review is warranted. Below I will explain why.</p>\n<blockquote>\n<p>Like <a href=\"https://medium.com/@harrisonnathan/the-actual-number-is-almost-surely-higher-92c908f36517\">some</a> others I was a little surprised…</p>\n</blockquote>\n<p>In your opening line, you linked to Harrison Nathan’s essay “<a href=\"https://medium.com/@harrisonnathan/the-actual-number-is-almost-surely-higher-92c908f36517\">The Actual Number is Almost Surely Higher</a>”. I and other staff members at ACE strongly disagree with the criticism he has made in this and other essays. Last year, <a href=\"https://animalcharityevaluators.org/blog/responses-to-common-critiques/\">we responded to his claims</a>, pointing out why we felt they were inaccurate. Later, he gave an interview with SHARK, where <a href=\"https://animalcharityevaluators.org/transparency/criticisms/shark/\">we yet again responded</a> to his criticism. When he continued to give the same critiques publicly, <a href=\"https://animalcharityevaluators.org/blog/response-to-a-recent-critique-of-our-research/\">we gave an in-depth response</a> that goes into full detail of why his continued claims are false.</p>\n<p>If you share any of the criticisms Nathan made in his essays, I highly recommend reading <a href=\"https://animalcharityevaluators.org/blog/response-to-a-recent-critique-of-our-research/\">our latest response</a>.</p>\n<blockquote>\n<p>…it would seem reasonable that EAs might choose not to fund GFI or the other top ACE charities, primarily because these are not neglected groups.</p>\n</blockquote>\n<p>When ACE recommends a charity, the concept of neglectedness is already baked into that recommendation. One of the criteria ACE uses when evaluating charities includes checking to make sure that there is room for more funding and concrete plans for growth. This factor takes into account funding sources from outside of ACE.</p>\n<p><a href=\"https://animalcharityevaluators.org/charity-review/the-good-food-institute/#c1\">The OPP’s grant to GFI was taken into account</a> when making GFI a top charity. <a href=\"http://effective-altruism.com/ea/19d/update_on_effective_altruism_funds/\">Bollard’s statement that he thought OPP would take care of GFI’s room for more funding in the medium term</a> is from April 2017, after our latest recommendations were made. I’m not on ACE’s research team, so I don’t know the exact details behind this. But I can assure you that as ACE is updating our yearly recommendations in December 2017, this is exactly the kind of thing that will be taken into account, if they haven't already done so.</p>\n<blockquote>\n<p>…it may well be the case that EAs ought to invest in developing more inclusive frameworks for intervention, and concentrate more resources on movement theorising.  It is my belief that undertaking work to further explore these issues through a system of meta-evaluation could in turn create a stronger foundation for improved outcomes.</p>\n</blockquote>\n<p>I agree that exploring more is particularly impactful when it comes to effective animal advocacy. But I disagree with your proposal on how to do this.</p>\n<p>I’m most excited about additional research into potential intervention types, such as the work being done by the ACE <a href=\"http://researchfund.animalcharityevaluators.org/\">Research Fund</a> and ACE’s new <a href=\"https://animalcharityevaluators.org/blog/introducing-aces-experimental-research-division/\">Experimental Research Division</a>. I think <a href=\"https://www.youtube.com/watch?v=o8rVscSHJT4\">it makes a lot of sense for us to focus on more research</a>, and my personal donations are geared more toward this area than the direct advocacy work that the top charities perform.</p>\n<p>Your alternative proposal is to fund groups like <a href=\"http://www.foodispower.org/\">Food Empowerment Project</a>, <a href=\"http://encompassmovement.org/\">Encompass</a>, and <a href=\"http://www.bettereating.com/\">Better Eating International</a> specifically because “they tend to fall outside the welfare / abolition paradigm favored by EAA, ACE and Open Phil”, and thus presumably are relatively neglected. I strongly disagree with this line of thinking, even though I personally like these specific organizations. (I’ve personally donated to Encompass this year.)</p>\n<p>80k Hours points out that <a href=\"https://80000hours.org/articles/effective-social-program/#how-important-is-it-to-be-evidence-based\">being evidence-based doesn’t have nearly as large an impact as choosing the right cause area</a>. When it comes to the welfare/abolition paradigm, <a href=\"https://animalcharityevaluators.org/donation-advice/donation-impact/\">avoiding welfare organizations is costly</a>.</p>\n<p>This isn’t to say that abolitionism isn’t a worthy goal; I personally would love to see a world where speciesism is eradicated and no animals are so callously harmed for food. But to get from here to there requires a welfare mindset; abolitionist techniques lack <a href=\"https://concepts.effectivealtruism.org/concepts/importance-neglectedness-tractability/\">tractability</a>.</p>\n<p>One of the reasons why ACE likes being transparent is that we recognize that our philosophy might not correspond exactly to those of everyone else. By making our reasoning transparent, this makes it easier for others to insert their own philosophical underpinnings and assumptions to choose a more appropriate charity for them. This is one reason why we list so many standout charities; <a href=\"https://animalcharityevaluators.org/blog/comparing-top-and-standout-charities/\">we believe that there are donors out there who have specific needs/desires that would make it more appropriate for them to fund a standout charity than any of our top charities</a>. We are currently in the process of making it even easier to do this by creating a questionnaire that allows users to answer a few philosophical questions, allowing us to customize a recommendation specifically tailored to them.</p>\n", "parentCommentId": null, "user": {"username": "EricHerboso"}}, {"_id": "C8xvX7T6A6umoFNH2", "postedAt": "2017-08-31T21:43:47.231Z", "postId": "YnXwXKbvmCDnHWx8s", "htmlBody": "<blockquote>\n<p>I don't think OpenPhil operates that way, where they fully fund 100% of the organization to the point where the organization has no use of additional funds. They have written at length about how they balance their grants to specifically avoid being a donor of last resort (see here, here, and here).</p>\n</blockquote>\n<p>Here's some information I found a few months ago when trying to figure out the approach Open Phil takes with its recommendations to Good Ventures regarding funding gaps of its grant recipients. It's somewhat different than the approach that Open Phil / GiveWell takes with recommendations regarding funding gaps of GiveWell top charities.</p>\n<p>In December 2015, Open Phil <a href=\"http://www.openphilanthropy.org/blog/suggestions-individual-donors-open-philanthropy-project-staff\">wrote</a> regarding Open Phil grants: &quot;In many cases, we find a funding gap we’d like to fill, and then we recommend filling the entire funding gap with a single grant. That doesn’t leave much scope for making a recommendation to individuals.&quot;</p>\n<p>In March 2017, however, Open Phil <a href=\"http://www.openphilanthropy.org/blog/technical-and-philosophical-questions-might-affect-our-grantmaking\">wrote</a>: &quot;We typically avoid situations in which we provide &gt;50% of an organization’s funding, so as to avoid creating a situation in which an organization’s total funding is 'fragile' as a result of being overly dependent on us. To avoid such situations, one approach we’ve sometimes taken is to fill the organization’s funding gap up to the point where we are matching all their other donors combined.&quot;</p>\n<p>Similarly, in December 2016, Lewis Bollard, Farm Animal Welfare Program Officer at Open Phil <a href=\"http://www.openphilanthropy.org/blog/suggestions-individual-donors-open-philanthropy-project-staff-2016#Compassion_in_World_Farming_USA_\">wrote</a>: &quot;In April, we made a two-year $550K grant to CIWF, which filled much of its room for more funding at the time. I think it’s now likely ready to absorb more funds, and we’re limited in our ability to provide all of them by the public support test and a desire to avoid being the overwhelming funder of any group.&quot;</p>\n", "parentCommentId": "spbyWmgTMA3rFko23", "user": {"username": "AviN"}}, {"_id": "ALeNauKGtCKm2WxCw", "postedAt": "2017-09-01T12:46:40.573Z", "postId": "YnXwXKbvmCDnHWx8s", "htmlBody": "<p>Hi Peter, thanks for those comments.  </p>\n<p>-</p>\n<p>I believe that one issue with thinking of the seven criteria as fairly rules based is that people can have an expectation the criteria will be met in relation to consistency and impartiality.  I am not in favour of maintaining strict rules, though I think there are some potential negative consequences of not doing so that need to be taken into account.  So in which circumstances would they be overlooked or minimised?  I think it is fine to be open that it could happen, but it raises issues in relation to how other groups perform well, but wouldn’t get top status for less certain reasons. There are further  problems with this in relation to how the process is viewed by potential groups taking part in the evaluation process, and by people who look upon recommendations as sufficient consideration.  In this way, I think we need to take into account evaluation isn’t a particularly competitive area, and there aren’t many groups that do it.</p>\n<p>-</p>\n<p>I reasonably believe the funding gap is presently fairly negligible at GFI (for example EA Funds are not very concerned about it, and already look for alternatives to GFI in that area), and I don’t think EAs generally ought to be funding groups in preparation for 2018.  Once a group has had their funding requirements met then I think we probably ought to move onto other areas of interest.  Though people can choose to do what they like, and if they believe donating now for next year is a good thing, then that is their choice, but I think there are other projects that are neglected today that need further consideration and resources.  Also, if GFI receive more money today that could be a factor against them receiving top status next year, because their funding requirements are met over and above their needs.  So if people think they benefit, or should benefit more than others then it may be more helpful to GFI not to receive more money now.</p>\n<p>-</p>\n<p>I think it could be possible to second guess Open Phil.  I like the considerations they put into different areas, but I have spoken to Holden Karnofsky and don’t feel there is any tangible process that ensures that checks and balances are applied.  I think there are issues now with the funding that Open Phil engage in, and Holden doesn’t.  It essentially seems to come down to the idea he thinks things are fine, rather than there being some form of system in place that can be pointed toward that would take care of this process.  In some ways it reminds me of issues with too much red tape, it is the case there can be onerous criteria that start to limit efficiency and effectiveness, but at some point we find red tape exists for a reason.  At the moment I think there aren’t enough checks and balances, others will be less inclined to think this is an issue where they are reasonably content with the overall pattern of how resources are distributed, and how that is encouraged by ACE and Open Phil.</p>\n<p>In terms of the donor of last resort, Open Phil don’t announce who they are going to give to at the beginning of the year, but I would second guess at least some of their donations based on their ideological leanings (it is more explicit with EA Funds, in their section about why people may choose not to <a href=\"https://app.effectivealtruism.org/funds/animal-welfare\">donate</a> to EA funds).  It could also just be better if they didn’t tell anyone who they are donating to at all.  As a general matter there are some <a href=\"https://animalcharityevaluators.org/blog/updates-on-select-recommended-charities-room-for-more-funding/\">updates</a> posted by ACE, but I don’t think this sufficiently takes into account what other groups / people are likely to do in relation to those top charities, or really considers diminishing returns.  </p>\n<p>So taking a couple of points “THL has already received more funding that we predicted they would be able to use this year (including their forthcoming grant money), Coman-Hidy hopes that THL can raise an additional $2.2 million–$2.7 million this year.”</p>\n<p>MfA had raised $5m in five months.  So I don’t think there is much reason to believe they wouldn’t hit $8.3m in twelve (including a budget increase of $1m over the previous year) so in relation to GFI, MfA and THL, i think many EAs ought to be looking at other areas.  Whilst AE have continued to grow, though likely at a lower rate than if they had top charity status.</p>\n<p>Whilst stated in one of the links you posted: “For the highest-value giving opportunities, we want to recommend that Good Ventures funds 100%. It is more important to us to ensure these opportunities are funded than to set incentives appropriately.”</p>\n<p>I think there are few grounds to believe any of the top groups aren’t going to easily hit their targets, so I am most interested in what follows from that, and I think my main point here is that donor agency is something that can be quite different depending on where people stand in the organisational donor structure.  The idea that Open Phil are building knowledge or funding groups to build knowledge is a good idea, like many of their ideas, but there isn’t much evidence they do this, at least not in the areas in which I am most interested.</p>\n", "parentCommentId": "spbyWmgTMA3rFko23", "user": {"username": "KevinWatkinson"}}, {"_id": "ri3xhhhpYiffLYx3W", "postedAt": "2017-09-01T12:47:19.153Z", "postId": "YnXwXKbvmCDnHWx8s", "htmlBody": "<p>Continued.</p>\n<p>-</p>\n<blockquote>\n<p>You could consider other ACE top charities or standout charities.</p>\n</blockquote>\n<p>I think to be fair I did mention standout ACE charities the Non-human Rights project and Animal Ethics as considerations, so I left the door open with those groups, rather than to close it.</p>\n<p>-</p>\n<blockquote>\n<p>I don't think this is true, as you do need to also build the demand for replacement meat products in addition to creating the supply.</p>\n</blockquote>\n<p>In terms of building demand, I think this is true, but there are differences within animal advocacy and the relationship with marketing, differences which are rarely examined in depth.  I think a fair amount of the contestation in the animal movement is created through neglecting this issue.  Robert Grillo discussed some of these issues in his recent book <a href=\"https://www.amazon.com/Farm-Fable-Fictions-Animal-Consuming-Culture/dp/1940184347/ref=sr_1_1?ie=UTF8&amp;qid=1504266466&amp;sr=8-1&amp;keywords=farm+to+fable\">Farm to Fable</a>.</p>\n<p>-</p>\n<p>In relation to Better Eating International, i’m thinking in terms of the criteria of needing x amount more money.  I haven’t heard anything from them about further fundraising after the Kickstarter project.  Though I haven’t asked either.  As a group I personally like it, and supported the Kickstarter, but I am not sure they would presently meet the room for further funding criteria given they recently had a fundraiser which was oversubscribed.  So where people are looking for opportunities this month, I wouldn’t prioritise BEI.</p>\n<p>Where large donors are looking for opportunities it may be they would think about breaking down sums of money between smaller groups, but I’m not sure how much this happens or where (A Well Fed World seem to do some work here, but I don’t know what criteria they use, and I don’t think ideological differences are accounted for).  In terms of Open Phil most of the announcements are for larger donations, so it isn’t clear how they manage smaller funding opportunities, or how they consider them / what resources they have to do that.</p>\n<p>-</p>\n<p>I have quite a few opinions on the Food Empowerment Project as a group working more closely in relation to my own outlook.  ACE <a href=\"https://animalcharityevaluators.org/advocacy-interventions/advocacy-advice/learn-from-professionals/lauren-ornelas/\">interviewed</a> lauren Ornelas fairly recently and covered some useful ground.  </p>\n<p>In terms of Encompass it looks like an interesting group, quite new and working in what I feel is an important area within the animal movement and the Effective Altruism movement.  I have some concerns over the difference between how the large organisations operate and how that fits with grassroots organisations, and how this is represented within the <a href=\"http://encompassmovement.org/our-team/\">advisory council</a>.  Yet I’m fairly confident this is an issue which is being taken into account.  Aryenish Birdie discusses some points in this <a href=\"http://thecommentist.com/bearded-vegans/bv93/\">interview</a> that I really liked (starts at 1.21.35).  I also discuss some of the issues with larger non-profits and smaller grassroots groups <a href=\"https://network23.org/orcasandanimals/2017/06/21/effective-altruism-for-animals-utilitarian-equivocation-and-moral-consistency/\">here</a>.</p>\n<p>I also think it would be a good thing if ACE look at the organisations I mentioned in some depth, I think that would be useful and I would encourage all groups to be open to this process.</p>\n<p>-</p>\n<p>In terms of meta-evaluation I would like to see ACE ring fence donations for a particular project with an accompanied plan.  It’s true that money could be donated to ACE for it, but when I spoke with them it wasn’t on the table, and they’ve capped funding this year at $1m with further funds going to recommended charities.  So I would be inclined to believe that people donating with this intention will find their money going to the other charities, whilst if the end of year <a href=\"https://animalcharityevaluators.org/blog/ace-fundraising-restrictions/\">fundraising</a> is a matching opportunity I wouldn’t donate to ACE (if I were, and I’m not) until that point.</p>\n<p>-</p>\n<p>From a deontological perspective I don’t find MfA’s current approach very convincing.  I think it is possible to suggest it is an ideological difference, but I tend to view Effective Altruism as being more about applying EA principles and values, so we could say that each division at MfA is separate enough from the other, but I don’t think that is the case.  In terms of how organisations function, the divisions which bring in more funding will arguably be valued differently, and the inconsistencies between different interventions aren’t well established.  For example, the five freedoms and undercover investigations into the welfare systems MfA promote.</p>\n<p>In a sense the reason why large non-profit groups are ‘pro-veg’ is part of this issue, in order to not disrupt the different work they tend to be doing, or the systems they are working in.  There isn’t much in the way of criticial analysis around this approach from utilitarians from an EA perspective, which would have to take deontology into account.  This is part of the reason I say groups don’t tend to do their counterfactuals.  I think partly because we don’t find many deontologists in EA anyway, and most of the people EAs talk to are other utilitarians and so there isn’t much discussion about rights based approaches.  The other issue is that many utilitarians tend to say they now do rights based advocacy through ends justify the means thinking, and this marginalises deontology, generally in a way that utilitarians haven’t really considered.   At least not that I have seen so far.</p>\n", "parentCommentId": "ALeNauKGtCKm2WxCw", "user": {"username": "KevinWatkinson"}}, {"_id": "HKrHHENt5aabCEDQX", "postedAt": "2017-09-01T15:49:43.454Z", "postId": "YnXwXKbvmCDnHWx8s", "htmlBody": "<blockquote>\n<p>I believe that one issue with thinking of the seven criteria as fairly rules based is that people can have an expectation the criteria will be met in relation to consistency and impartiality. I am not in favour of maintaining strict rules, though I think there are some potential negative consequences of not doing so that need to be taken into account. So in which circumstances would they be overlooked or minimised?</p>\n</blockquote>\n<p>So far, all seven criteria are followed for every top charity. But it's not a binary. How much track record is enough track record to have a &quot;good&quot; track record? GFI does have enough of a track record that we felt comfortable evaluating it, but it does have less of a track record than our other recommended organizations.</p>\n<p>-</p>\n<blockquote>\n<p>I reasonably believe the funding gap is presently fairly negligible at GFI (for example EA Funds are not very concerned about it, and already look for alternatives to GFI in that area)</p>\n</blockquote>\n<p>I'm not sure I'd read that much into the EA Funds donations, personally.</p>\n<p>-</p>\n<blockquote>\n<p> I don’t think EAs generally ought to be funding groups in preparation for 2018.</p>\n</blockquote>\n<p>Speaking about room for more funding generally --  I agree it has been harder to find room for more funding lately (and this is definitely a good problem to have) and this is something ACE has been monitoring closely. The next charity update will be in just a few months and will include fresh re-estimations of room for more funding. You may consider waiting until then.</p>\n<p>Either way, I'm confident that GFI could continue to productively use money given now. I don't think there's any particular reason to give in January but not September as you say, unless you're worried that ACE's recommendation will change or that they are out of RFMF for a good portion of 2018 also.</p>\n<p>Additionally, organizations that get more money now might be encouraged to take on more, to scale, and to build a bigger budget in the future. More money now would help them give them more confidence.</p>\n<p>-</p>\n<blockquote>\n<p>In relation to Better Eating International, i’m thinking in terms of the criteria of needing x amount more money. I haven’t heard anything from them about further fundraising after the Kickstarter project. Though I haven’t asked either. </p>\n</blockquote>\n<p>You could consider asking. I think they could make use of another $20-40K to boost their analytics capabilities.</p>\n<p>-</p>\n<blockquote>\n<p>I also think it would be a good thing if ACE look at the organisations I mentioned in some depth, I think that would be useful and I would encourage all groups to be open to this process.</p>\n</blockquote>\n<p>I can suggest those organizations if they are not already on ACE's radar.</p>\n", "parentCommentId": "ALeNauKGtCKm2WxCw", "user": {"username": "Peter_Hurford"}}, {"_id": "wyazRcSZFp4dnF9Gy", "postedAt": "2017-09-01T19:05:27.413Z", "postId": "YnXwXKbvmCDnHWx8s", "htmlBody": "<p>To reduce future confusion I think that ACE's <a href=\"https://animalcharityevaluators.org/charity-reviews/evaluating-charities/evaluation-criteria/#full-criteria-template\">charity evaluation criteria page</a> should be edited to acknowledge the fact that ACE is increasingly open to 'hits based' charity recommendations, and rightly so: <a href=\"http://www.openphilanthropy.org/blog/hits-based-giving\">http://www.openphilanthropy.org/blog/hits-based-giving</a></p>\n", "parentCommentId": null, "user": {"username": "Robert_Wiblin"}}, {"_id": "k6kGTcxjBqP9fDbRt", "postedAt": "2017-09-01T19:28:18.079Z", "postId": "YnXwXKbvmCDnHWx8s", "htmlBody": "<p>I'm personally less sure if ACE is thinking about it or framing it in those terms.</p>\n", "parentCommentId": "wyazRcSZFp4dnF9Gy", "user": {"username": "Peter_Hurford"}}, {"_id": "sw9wCnm9fyDbhMQhX", "postedAt": "2017-09-01T19:31:20.263Z", "postId": "YnXwXKbvmCDnHWx8s", "htmlBody": "<p>In that case I think they should start thinking about it in those terms. :)</p>\n", "parentCommentId": "k6kGTcxjBqP9fDbRt", "user": {"username": "Robert_Wiblin"}}, {"_id": "zn94dZH5yZZCk7jfX", "postedAt": "2017-09-01T19:34:40.366Z", "postId": "YnXwXKbvmCDnHWx8s", "htmlBody": "<p>I'd personally disagree, but it's a good discussion to have either way.</p>\n", "parentCommentId": "sw9wCnm9fyDbhMQhX", "user": {"username": "Peter_Hurford"}}, {"_id": "fyAhw2GG5cRuBHReP", "postedAt": "2017-09-01T22:59:50.518Z", "postId": "YnXwXKbvmCDnHWx8s", "htmlBody": "<p>Thanks for raising this. I just want to clarify Open Phil’s policy on filling funding gaps. We look at each case and think about the pros and cons to ‘leaving space’ in a cost-benefit framework, which includes thinking about likely donor behavior in different cases. The ‘splitting’ policy applies to GiveWell top charities only; in other cases we often avoid being too high a % of someone’s budget, and are sometimes constrained by soft cause-level giving targets, but otherwise generally fill what we see as important funding gaps. It’s possible though not certain that we’ll fund GFI more - though if we do it won't be because GFI will &quot;advocate on behalf of investments for philanthropists who also support Open Phil&quot; — that's not a consideration I think about. I’d encourage potential donors to ask GFI what they’d do with more funds this year — I wouldn’t assume that ACE’s estimated room for more funding is still accurate.</p>\n", "parentCommentId": null, "user": {"username": "LewisBollard"}}, {"_id": "c2nC8aYRnTSh2FS2m", "postedAt": "2017-09-02T08:21:01.268Z", "postId": "YnXwXKbvmCDnHWx8s", "htmlBody": "<p>Thanks for your comment.  </p>\n<p>This is what ACE say in relation to the criterion.</p>\n<p>“4. The charity possesses a strong track record of success. The charity has a record of successful achievement of incremental goals or of demonstrated progress towards larger goals. Note that this implies the charity has been in existence for some length of time. While very young charities may have strong potential to return large results for small initial amounts of funding, donating to charities without track records is inherently risky.”</p>\n<p>I think it is reasonable to say that GFI has not been in existence for a particularly long time, having launched in 2016, and having been reviewed in 2016.  Whatever other considerations might mitigate this issue, it still stands that the charity has been in existence for a very short period of time, and GFI did not possess a strong track record of success, and therefore it couldn’t in my view meet criteria four.  But like I said in the article, I think there is room for flexibility with newer groups.</p>\n<p>My post here asked the question whether we ought to think more before we donate to GFI, not that EAs shouldn’t want GFI to be fully funded, or necessarily any of the other groups that ACE recommend. As I said, I think it is highly unlikely GFI wouldn’t be, as they are viewed as such a good prospect. I would generally expect most people to agree that it would be a good idea to think more about the different issues that are related to funding, and I would expect very few people to agree that GFI shouldn’t be fully funded. </p>\n<p>I personally don’t donate money to ACE, for some of the reasons i have stated and others that follow, but just like with GFI, it isn't that i wouldn't want to see it fully funded, but I think other EAs could consider the issues more, and it might be they think it is a less good idea to put as much money into ACE until certain issues are resolved.  </p>\n<p>Some EAs believe there are few issues, others believe there are more, i'm one of the people who believe there are more.  In my view there are also reasons to believe that ACE have been underfunded for some years, as i believe scope should have been expanded, and more charities evaluated, but i am uncertain whether there has been much interest in resolving a number of these issues, partly because people weight them differently.  Whilst I was in favour of Open Phil donating $500,000 to ACE this year, as a way to potentially resolve some issues, and i am not in favour of the $1m funding cap.  </p>\n<p>I would prefer that more EAs consider reasons for thinking differently about the situation in relation to donations overall, including whether or not to let larger philanthropic organisations do most of the funding of top groups, or just to let them to do it, and for EAs to look at a broader range of organisations outside the ‘mainstream’.  Something which might have more appeal to people outside of EA, and that would need to be instigated from within EA.  It’s not even an either/or situation in terms or evaluation, it would be possible to do both, if there was a desire to do this.  </p>\n<p>It’s true I’m not presently very satisfied with the process at ACE, and I think there are reasonable grounds that some other people might like to think differently about what to do in relation to that situation too.  Incidentally, I would be in favour of independent and funded external meta-evaluation for all evaluation groups related to EA, and I see no reason why this shouldn’t be encouraged in order to improve the likelihood different issues are taken into account (that organisations might be missing) and to support evaluation groups to do the work they do. I regard it as incorporating a strategy to increase the likelihood different issues are fairly considered.  It also gives reassurance to donors, and I see no reason not to put a system in place as a matter of best practice, or as is sometimes considered, better than best practice.  This is something I have spoken about before with ACE, and I find the reasons to do it compelling, not least because it could add more legitimacy to the evaluation process.</p>\n<p>-</p>\n<p>On the issue of interventions, I also believe they need to include meta-evaluation.  So what is the impact of say, vegan advocacy in relation to reducetarian advocacy?  What is the impact of marginalising veganism to focus on ‘mainstreamness’?  Or for saying we need to use the idea people love animals but hate vegans?  I’m in favour of working out which interventions are effective, and within different approaches, not just comparisons between approaches to attempt to work out which one is ‘best’ (welfare or abolition).  I would also like to see how ACE are considering the differences between top down and bottom up advocacy, social movements, ethical systems, and how ideas are represented or distorted within a mainstream / non-mainstream context.  I think this could be something for the Experimental Research Division, and I think a good place to begin would be with foundational issues, with dialogue across the animal movement to establish where people are at with these forms of ideas. </p>\n<p>It also wasn’t really my intention to suggest that Encompass or BEI fall outside the paradigm of abolition and welfare, but it is my belief the Food Empowerment Project do.  They were all examples of groups I am more interested in, but I haven't spoken to either Encompass or BEI to know where they see themselves in relation to welfare / abolition (nor do i intend to at the present time).</p>\n<p>The problem I am referring to by mentioning the dichotomy of welfare and abolition is that it doesn’t provide enough scope for different groups to fit in, if people reject the EA idea of welfare and also reject abolition, where do they go?  Where are these different approaches generally explored within EA?  I am not saying this doesn't happen at all, but it happens very little, and in a very marginal way.  So i wonder where the curiosity largely exists in relation to what different people are doing in the animal movement outside the idea of 'welfare'?  For me it looks a lot like larger organisations are being functionally rational within the movement, which is understandable to a degree, but i think this has impacted how evaluation works (I think Robert Jackall explores some of these issues in the book &quot;Moral Mazes: The World of Corporate Managers.&quot;  I also believe Jonathon Smucker maps some of the issues in his new book &quot;Hegemony How-To&quot;.)</p>\n<p>I also question whether ACE should <a href=\"https://animalcharityevaluators.org/blog/welfarists-or-abolitionists-division-hurts-animal-advocacy/\">use</a> the abolitionist / welfare paradigm without really having completed a thorough consideration of its <a href=\"https://qz.com/829956/how-the-vegan-movement-broke-out-of-its-echo-chamber-and-finally-started-disrupting-things/\">origins</a> and implications. If this examination does however exist, i would welcome seeing it.</p>\n<p>Without this work I disagree about the idea of a ‘welfare’ mindset for tractability.  How has that been articulated? What are the alternative mindsets?  Where are they considered and comparisons made?  People are highly interested in doing effective advocacy and some people want to be consistent with their approach, and find that is a sound way to empower people with the knowledge to make changes, whilst others are more interested in marketing techniques.  </p>\n<p>If we are in favour of diversity then we need to acknowledge and understand different approaches, and find ways that improve the work different people do, rather than adopting a dichotomy of welfare / abolition and saying welfare is best and that everyone ought to do it if they want to be most effective. For example, if we are looking at issues of social justice and speciesism, then the framework we use reasonably ought to fit with other frameworks in relation to discrimination and oppression.  However, if people want to do conventional welfare, or reducetarianism, then ok, but the limitations ought to be acknowledged, and how they relate considered. I don't think I have seen where  organisations in EA have completed this type of work, where it has had cross movement input.</p>\n<p>As a movement model I would probably consider something along the lines of the following, to more easily refer to different ideas in the animal movement and improve communication. Though i would consult broadly to get more ideas: </p>\n<p>Welfare, new welfare.<br />Reducetarian, reducetarian animal rights.<br />Vegan, animal rights.<br />Abolitionist Approach.  </p>\n", "parentCommentId": "t9TcqLZBpcMGpywA5", "user": {"username": "KevinWatkinson"}}, {"_id": "eJJvdeSXQbmSY7wRi", "postedAt": "2017-09-06T14:53:45.669Z", "postId": "YnXwXKbvmCDnHWx8s", "htmlBody": "<p>As of December 2016, my impression was that ACE wasn't and hadn't shifted towards a hits based or more risk-averse approach. I don't know if this is because they already were more in that direction than Rob thinks, or because they didn't move to the hits based position Rob thinks they currently have.</p>\n<p>[I worked for ACE on the board then as a researcher until December 2016. This is just my personal opinion.]</p>\n", "parentCommentId": "k6kGTcxjBqP9fDbRt", "user": {"username": "Jacy"}}]