[{"_id": "NFx8KuioHS2stqRvZ", "postedAt": "2022-10-02T07:26:07.313Z", "postId": "Youhe5KQK6SwFS6Bq", "htmlBody": "<p>Hey Aron, thanks for your post!</p><blockquote><p>we should weight suffering today much more highly than suffering in the future, because <strong>only we can do something about it</strong>.</p></blockquote><p>This can be framed in terms of both the <a href=\"https://forum.effectivealtruism.org/topics/itn-framework\">importance, tractability and neglectedness</a> (ITN) framework and the <a href=\"https://forum.effectivealtruism.org/topics/spc-framework\">significance, persistence and contingency</a> (SPC) framework.</p><p>Using the ITN framework, you might argue that suffering that occurs in the present is more <i>neglected</i> than suffering in the distant future because fewer people will ever be in a position to address it (only the present generation). By contrast, everyone from now until a given point in the future will be in a position to address suffering that occurs at that point in time. It is also more <i>tractable</i> because we can address it directly, whereas we can only address suffering in the future indirectly, e.g. by empowering future generations to address it when it occurs. (These considerations weigh against each other, though.)</p><p>Using the SPC framework, you might argue that suffering in the distant future is not very <i>contingent</i> on our actions in the present because people in the future will be able to address it regardless of what we do now.</p><p>These points are not fatal to longtermism, though. The idea that future people will be better positioned to address future problems is the basis of <a href=\"https://forum.effectivealtruism.org/topics/patient-altruism\">patient longtermism</a>, \"the view that individuals can have a greater positive impact by investing current altruistic resources and spending them later than by spending them now.\"</p>", "parentCommentId": null, "user": {"username": "evelynciara"}}, {"_id": "h9uJXyxs53nGSg78K", "postedAt": "2022-10-02T08:40:54.390Z", "postId": "Youhe5KQK6SwFS6Bq", "htmlBody": "<p>Overall agreed, except that I'm not sure the idea of patient longtermism does anything to defend longtermism against Aron's criticism? By my reading of Aron's post, the assumptions there are that people in the future will have a lot of wealth to deal with problems of their time, compared to what we have now—which would make investing resources for the future (patient longtermism) less effective than spending them right away.</p><p>I think your point is broadly valid, Aron: if we knew that the future would get richer and more altruistically-minded as you describe, then we would want to focus most of our resources on helping people in the present.</p><p>But if we're even a little unsure—say, there's just a 1% chance that the future is not rich and altruistic—then we might still have very strong reason to put our resources toward making the future better: because the future is (in expectation) so big, if there's anything at all we can do to influence it, that could be very important.</p><p>And to me it seems pretty clear that the chance of a bad future is quite a bit more than 1%, which further strengthens the case.</p>", "parentCommentId": "NFx8KuioHS2stqRvZ", "user": {"username": "smountjoy"}}]