[{"_id": "2qaZNds5DokummDDi", "postedAt": "2023-03-24T16:05:08.108Z", "postId": "YrXZ3pRvFuH8SJaay", "htmlBody": "<p>I should note that I don’t see a stronger focus on character as the only thing we should be doing to improve effective altruism! Indeed, I don’t even think it is the most important improvement. There have been many other suggestions for improving institutions, governance, funding, and culture in EA that I’m really excited about. I focused on character (and decision procedures) in my talk because it was a topic I hadn’t seen much in online discussions about what to improve, because I have some distinctive expertise to impart, and because it is something that everyone in EA can work on.</p>", "parentCommentId": null, "user": {"username": "Toby_Ord"}}, {"_id": "MQsii3fXtDAk6qsp8", "postedAt": "2023-03-24T17:29:53.828Z", "postId": "YrXZ3pRvFuH8SJaay", "htmlBody": "<p>Thanks for sharing this, including the text! It was one of my favorite presentations I've seen at an EAG. Also, I really loved the line, \"And it increasingly seems he was that most dangerous of things — a naive utilitarian,\" and I'm waiting for the memes to roll in!</p>", "parentCommentId": null, "user": {"username": "Rockwell Schwartz"}}, {"_id": "PwP5zM9NCFKC8aa7g", "postedAt": "2023-03-24T17:34:37.515Z", "postId": "YrXZ3pRvFuH8SJaay", "htmlBody": "<blockquote><p>The bigger the kind of impact someone is planning, the more important it is that they have a good character.</p></blockquote><p>Loved this line. And I second Rockwell's opinion: It's one of my favorite presentations I've seen at an EAG.</p>", "parentCommentId": null, "user": {"username": "CristinaSchmidtIbáñez"}}, {"_id": "gHF8trfcmqxQqFzFM", "postedAt": "2023-03-24T18:48:01.846Z", "postId": "YrXZ3pRvFuH8SJaay", "htmlBody": "<p>Toby - thanks for sharing this wonderful, wise, and inspiring talk.&nbsp;</p><p>I hope EAs read it carefully and take it seriously.</p>", "parentCommentId": null, "user": {"username": "geoffreymiller"}}, {"_id": "2uTKtFLMbnifPYPyj", "postedAt": "2023-03-25T12:18:50.599Z", "postId": "YrXZ3pRvFuH8SJaay", "htmlBody": "<p>I'm really grateful that you gave this address, especially with the addition of this comment. Would you be willing to say more about which other suggestions for improvement you would be excited to see adopted in light of the FTX collapse and other recent events? For the reasons I gave <a href=\"https://forum.effectivealtruism.org/posts/uBSwt2vEGm4RisLjf/holden-karnofsky-s-recent-comments-on-ftx?commentId=ReiNbv6GrFptjiror\">here</a>, I think it would be valuable for leaders in the EA community to be talking much more concretely about opportunities to reduce the risk that future efforts inspired by EA ideas might cause unintended harm.</p>", "parentCommentId": "2qaZNds5DokummDDi", "user": {"username": "NewLeaf"}}, {"_id": "pqhbESkQqe9ccotFp", "postedAt": "2023-03-25T14:19:17.346Z", "postId": "YrXZ3pRvFuH8SJaay", "htmlBody": "<p>I value the “it is something that everyone in EA can work on“-sentiment.</p><p>Particularily in these times, I think it is excellent to find things that (1) seem robustly good and (2) we can broadly agree on as a community to do more of. It can help alleviate feelings of powerlessness (and help with this is, I believe, one of the things we need.)</p><p>This seems to be one of those things. Thanks!</p>", "parentCommentId": "2qaZNds5DokummDDi", "user": {"username": "Jonathan Mannhart"}}, {"_id": "GcEcMiKkQtj9K6iBD", "postedAt": "2023-03-25T16:59:40.345Z", "postId": "YrXZ3pRvFuH8SJaay", "htmlBody": "<p>This feels like a missed opportunity.</p><p>My sense is that this was an opportunity to give a \"big picture view\" rather than note a particular underrated aspect.&nbsp;</p><p>If you think there were more important improvements, why not say them, at least as context, in one of the largest forums on this topic?</p><p>Thanks for your work :)</p>", "parentCommentId": "2qaZNds5DokummDDi", "user": {"username": "nathan"}}, {"_id": "u4LHZ3XC9dnpx3GpR", "postedAt": "2023-03-25T17:18:22.904Z", "postId": "YrXZ3pRvFuH8SJaay", "htmlBody": "<p>I had the same impression, that a big picture view talk was expected but that the actual talk was focused on a single issue and in a fairly philosophical framing.</p>\n<p>So I thought it was an excellent talk but it still gave me a strange feeling as the dominant and first EAG response to what happened (I know this made sense given other sessions covering other aspects, but I am unsure it will be perceived this way (one slice of the puzzle) given its keynote character).</p>\n", "parentCommentId": "GcEcMiKkQtj9K6iBD", "user": {"username": "jackva"}}, {"_id": "yetTvBFvvRJ5zek2d", "postedAt": "2023-03-26T11:04:39.444Z", "postId": "YrXZ3pRvFuH8SJaay", "htmlBody": "<p>\"A focus on excellence rather than perfection.\"</p>\n<p>I really like this.</p>\n<p>(And I feel like it completes the aphorism \"Perfect is the enemy of the good,\" which I believe you told me in 2010 when I was overstretching myself.)</p>\n", "parentCommentId": null, "user": {"username": "Holly"}}, {"_id": "xEv9whgtukzj4xLbC", "postedAt": "2023-03-26T16:43:05.671Z", "postId": "YrXZ3pRvFuH8SJaay", "htmlBody": "<p>Hi Toby, thanks so much for posting a transcript of this talk, and for giving the talk in the first place. It has been one of my key desires in community building to see more leaders engaging with the EA community post-FTX. This talk strikes a really good tone, and I dunno, impact measures are hard, but I suspect it was pretty important for how good of vibes EAG Bay Area felt over all, and I'm excited for the Forum community to read it.</p><p>I overall like the content of the talk, but will be expressing some disagreements. First, though, things I liked about the content: I&nbsp;<i>conceptually</i> love the \"strive for excellence\" frame, and the way you made \"maximization is perilous\" much more punchy for me than Holden's post did. I see the core of your talk as being about your dissertation. I overall think it was a valuable contribution to my models.</p><p>The core of my disagreement is about how we should think about naive utilitarianism/consequentialism. I'd like to introduce some new terms, which I find helpful when talking to people about this subject:</p><ul><li><strong>Myopic consequentialism</strong> — e.g.: shoplifting to save money. Everyone can pretty easily see how this is going to go wrong pretty fast. It may be slightly nontrivial to work out how (\"Nobody can see me! I'm really confident!\"), but basically everyone agrees this is the bad kind of utilitarianism.</li><li><strong>Base-level consequentialism</strong> — My read is that you, and most people who ground their morality in a fundamentally consequentialist way, start from here. It's the consequentialism you see in intro philosophy definitions. Good consequences are good.</li><li><strong>Multi-layered consequentialism</strong> — We can start adding things on to our base-level consequentialism, to rescue it from the dangers of myopia that come from unrefined base-level consequentialism as a decision criterion.</li></ul><p>I know many people who are roughly consequentialist. Everyone must necessarily use some amount of heuristics to guide decisions, instead of trying to calculate out the consequences of each breath they take. But in my experience, people vary substantially in how much they reify their heuristics into the realm of morality vs simply being useful ways to help make decisions.</p><p>For example, many people will have a pretty bright line around lying. Some might elevate that line into a moral dictum. Others might have it as a “really solid heuristic”, maybe even one that they commit to never violating. But lying is a pretty easy case. There’s a dispositional approach to “how much of my decision-making is done by thinking directly about consequences.”</p><p>My best guess is that Toby will be too quick to create ironclad rules for himself, or pay too much attention to how a given decision fits in with too many virtues. But I am really uncertain whether I actually disagree. The disagreement I have is more about, \"how can we think about and talk about adding layers to our consequentialism\", and, crucially, how much respect can we have for someone who is closer to the base-level.</p><p>I'm not suggesting that we be tolerant of people who lie or cheat or have very bad effects on important virtues in our community. In fact I want to be say that the people in my life who are clear enough with themselves and with me about the layers on top of their consequentialism that they don't hold sacred, are generally very good models of EA virtues, and very easy to coordinate with, because they can take the other values more seriously.</p>", "parentCommentId": null, "user": {"username": "jpaddison"}}, {"_id": "wFomdozEkzkMPQEnK", "postedAt": "2023-03-26T22:15:29.254Z", "postId": "YrXZ3pRvFuH8SJaay", "htmlBody": "<p>To echo the general sentiment, I also want to express my gratitude and appreciation for this talk. I found it warm, inclusive and positive. Thanks!</p>\n", "parentCommentId": null, "user": {"username": "HakonHarnes"}}, {"_id": "hY4d8TtoytZrixuM4", "postedAt": "2023-03-27T10:26:55.673Z", "postId": "YrXZ3pRvFuH8SJaay", "htmlBody": "<p>I want to second this being a missed opportunity as being a missed opportunity to talk about wider issues, including governance (I <a href=\"https://twitter.com/MichaelDPlant/status/1629593924519211008\">tweeted so at the time</a>). Listeners are likely to interpret, from your focus on character, and given your position as a leading EA speaking on the most prominent platform in EA - the opening talk at EAG - that this is all effective altruists should think about. But we don't try to stop crimes just by encouraging people to have good character. And, if the <a href=\"https://forum.effectivealtruism.org/posts/b83Zkz4amoaQC5Hpd/time-article-discussion-effective-altruist-leaders-were\">latest Time article is to be believed</a>, there was lots of evidence of SBF's bad character, but this seemingly wasn't sufficient to avert or mitigate disaster. &nbsp;</p><p>I still find it surprising and disappointing that there has been no substantive public discussion of governance reform from EA leaders (I keep asking people to point me to some, but no one has!). At the very least you'd have expected someone to do the normal academic thing of \"we considered all these options, but we ruled them out, which is why we're sticking with the status quo\".</p>", "parentCommentId": "GcEcMiKkQtj9K6iBD", "user": {"username": "MichaelPlant"}}, {"_id": "aTfsLx9wqApt7MHeE", "postedAt": "2023-03-27T16:29:03.634Z", "postId": "YrXZ3pRvFuH8SJaay", "htmlBody": "<blockquote><p>Listeners are likely to interpret, from your focus on character, and given your position as a leading EA speaking on the most prominent platform in EA - the opening talk at EAG - that this is all effective altruists should think about.</p></blockquote><p>Really? I don't think I've ever encountered someone interpreting the topic of an EAG opening talk as being \"all EAs should think about\".</p>", "parentCommentId": "hY4d8TtoytZrixuM4", "user": {"username": "matthew.vandermerwe"}}, {"_id": "jixb8PHw84GjNoFdK", "postedAt": "2023-03-27T17:08:44.115Z", "postId": "YrXZ3pRvFuH8SJaay", "htmlBody": "<p>Maybe I should have phrased what I'd said somewhat differently, but I expect EAs to very heavily take their cues from what established community leaders say, particularly when they speak in the 'prime time' slots.</p>\n", "parentCommentId": "aTfsLx9wqApt7MHeE", "user": {"username": "MichaelPlant"}}, {"_id": "iqwwmGWGJqyp9dY9h", "postedAt": "2023-03-25T13:21:47.854Z", "postId": "YrXZ3pRvFuH8SJaay", "htmlBody": null, "parentCommentId": "MQsii3fXtDAk6qsp8", "user": null}, {"_id": "Hc7uq36CFqb7SusnP", "postedAt": "2023-03-25T14:16:56.168Z", "postId": "YrXZ3pRvFuH8SJaay", "htmlBody": null, "parentCommentId": "2qaZNds5DokummDDi", "user": null}]