[{"_id": "4oNRauorwYLPz4SDR", "postedAt": "2017-07-07T23:36:47.719Z", "postId": "YRzELEmB8eqqwpp8J", "htmlBody": "<blockquote>\n<p>One reason this is that, because there are donors with money on the sidelines, if the organisations were able to find someone with a good level of fit, they could fundraise enough money to pay for their salaries.</p>\n</blockquote>\n<p>Can you (very roughly) quantify to what extent this is the case for EA organisations? (I imagine they will vary as to how donor-rich vs. potential-hire-rich they are, so some idea of the spread would be helpful.)</p>\n", "parentCommentId": null, "user": {"username": "Nekoinentr"}}, {"_id": "imYLyag6saEqA5WgP", "postedAt": "2017-07-08T06:25:48.165Z", "postId": "YRzELEmB8eqqwpp8J", "htmlBody": "<p>Hey, the most relevant data we have on this is here:\n<a href=\"https://80000hours.org/2017/03/what-skills-are-effective-altruist-organisations-missing/\">https://80000hours.org/2017/03/what-skills-are-effective-altruist-organisations-missing/</a></p>\n<p>We hope to do a more detailed survey this summer.</p>\n<p>In terms of quantifying the amount of money available, we also have some survey results that I'm hoping to publish. But a key recent development is that now the Open Philanthropy Project is funding charities in the community.</p>\n", "parentCommentId": "4oNRauorwYLPz4SDR", "user": {"username": "Benjamin_Todd"}}, {"_id": "ugDk8BgdYKbXebz4i", "postedAt": "2017-07-08T21:02:57.901Z", "postId": "YRzELEmB8eqqwpp8J", "htmlBody": "<p>Very much enjoyed this. Good to see the thinking developing.</p>\n<p>My only comment is on simple replacability. I think you're right to say this is too simple in an EA context, where someone this could cause a cascade or the work wouldn't have got done anyway.</p>\n<p>Do you think simple replacability doesn't apply outside the EA world? For example, person X wants to be a doctor because they think they'll do good. If they take a place at med school, should we expect that 'frees up' the person who doesn't get the place to go and do something else instead? My assumption is the borderline medical candidate is probably not that committed to doing the most good anyway. </p>\n<p>To push the point in a familiar case, assume I'm offered a place in an investment bank and I was going to E2G, but I decide to do something more impactful, like work at an EA org. It's unlike the person who gets my job and salary instead would be donating to good causes.</p>\n<p>If you think replacability is sometimes true and other times not, it would be really helpful to specify that. My guess is motivation and ability to be an EA play the big role.</p>\n", "parentCommentId": null, "user": {"username": "MichaelPlant"}}, {"_id": "RPYpYiNcspaBHQt2d", "postedAt": "2017-07-09T03:42:20.756Z", "postId": "YRzELEmB8eqqwpp8J", "htmlBody": "<p>Hi Michael,</p>\n<p>I'm writing a much more detailed piece on replaceability.</p>\n<p>But in short, simple replaceability could still be wrong in that the doctor wouldn't be replaced. In general, a greater supply of doctors should mean that more doctors get hired, even if it's less than 1.</p>\n<p>But yes you're right that if the person you'd replace isn't value-aligned with you, then the displacement effects seem much less significant, and can probably often be ignored.</p>\n<blockquote>\n<p>If you think replacability is sometimes true and other times not, it would be really helpful to specify that. My guess is motivation and ability to be an EA play the big role.</p>\n</blockquote>\n<p>We did state this in our most recent writing about it from 2015:\n<a href=\"https://80000hours.org/2015/07/replaceability-isnt-as-important-as-you-might-think-or-weve-suggested/\">https://80000hours.org/2015/07/replaceability-isnt-as-important-as-you-might-think-or-weve-suggested/</a>\nIt's pretty complex to specify the exact conditions under which it does and doesn't matter, and I'm still working on that.</p>\n", "parentCommentId": "ugDk8BgdYKbXebz4i", "user": {"username": "Benjamin_Todd"}}, {"_id": "nyP5EMc2fuQzdaDHt", "postedAt": "2017-07-13T18:20:44.842Z", "postId": "YRzELEmB8eqqwpp8J", "htmlBody": "<p>With regards to &quot;following your comparative advantage&quot;:</p>\n<p>Key statement : While &quot;following your comparative advantage&quot; is beneficial as a community norm, it might be less relevant as individual advice.</p>\n<p>Imagine 2 people Ann and Ben. \nAnn has very good career capital to work on cause X. She studied a relevant subject, has relevant skill, maybe some promising work experience and a network.\nBen has very good career capital to contribute to cause Y.\nBoth have aptitude to become good at the other cause as well, but it would take some time, involve some cost, maybe not be as save.</p>\n<p>Now Ann thinks that cause Y is 1000 times as urgent as cause X, and for Ben it is the other way around.\nBoth consider retraining for the cause they think is more urgent.</p>\n<p>From a community perspective, it is reasonable to promote the norm that everyone should follow their comparative advantage. This avoids prisoner's dilemma situations and increases total impact of the community. After all, the solution that would best satisfy both Ann's and Ben's goals was if each continued in their respective areas of expertise. (Let's assume they could be motivated to do so)</p>\n<p>However, from a personal perspective, let's look at Ann's situation: \nIn reality of course, there will rarely be a Ben to mirror Ann, who would also be considering retraining at exactly the same time as Ann. And if there was, they would likely not know each other. So Ann is not in the position to offer anyone the specific trade that she could offer Ben, namely: &quot;I keep contributing to cause X, if you continue contributing to cause Y&quot;</p>\n<p>So these might be Ann's thoughts:\n&quot;I really think that cause Y is much more urgent than anything I could contribute to cause X. And yes, I have already considered moral uncertainty. If I went on to work on cause X, this would not directly cause someone else to work on cause Y. I realize that it is beneficial for EA to have a norm that people should follow their comparative advantage, and the creation of such a norm would be very valuable. However, I do not see how my decision could possibly have any effect on the establishment of such a norm&quot;</p>\n<p>So for Ann it seems to be a prisoner’s dilemma without iteration, and she ought to defect.</p>\n<p>I see one consideration why Ann should continue working towards cause X: \nIf Ann believed that EA is going to grow a lot, EA would reach many people with better comparative advantage for cause Y. And if EA successfully promoted said norm, those people would all work on cause Y, until Y would not be neglected enough any more to be much more urgent than cause X. Whether Ann believes this is likely to happen depends strongly on her predictions of the future of EA and on the specific characteristics of causes X and Y. If she believed this would happen (soon), she might think it was best for her to continue contributing to X.\nHowever, I think this consideration is fairly uncertain and I would not give it high weight in my decision process.</p>\n<p>So it seems that</p>\n<ul>\n<li>it clearly makes sense (for CEA/ 80000 hours/ ...) to promote such a norm </li>\n<li>it makes much less sense for an individual to follow the norm, especially if said indiviual is not cause agnostic or does not think that all causes are within the same 1-2 orders of magnitude of urgency.</li>\n</ul>\n<p>All in all, the situation seems pretty weird. And there does not seem to be a consensus amongst EAs on how to deal with this. A real world example: I have met several trained physicians who thought that AI safety was the most urgent cause. Some retrained to do AI safety research, others continued working in health-related fields. (Of course, for each individual there were probably many other factors that played a role in their decision apart from impact, e.g. risk aversion, personal fit for AI safety work, fit with the rest of their lives, ...)</p>\n<p>Ps: I would be really glad if you could point me to errors in my reasoning or aspects I missed, as I, too, am a physician currently considering retraining for AI safety research :D</p>\n<p>Pps: I am new to this forum and need 5 karma to be able to post threads. So feel free to upvote.</p>\n", "parentCommentId": null, "user": {"username": "JanBrauner"}}, {"_id": "HbDmtFHz3HTWSsdNj", "postedAt": "2017-07-14T01:03:01.393Z", "postId": "YRzELEmB8eqqwpp8J", "htmlBody": "<p>Hi there,</p>\n<p>I think basically you're right, in that people should care about comparative advantage to the degree that the community is responsive to your choices, and they're value-aligned with typical people in the community. If no-one is going to change their career in response to your choice, then you default back to whatever looks highest-impact in general.</p>\n<p>I have a more detailed post about this, but I conclude that people should consider all of role impact, personal fit and comparative advantage, where you put or less emphasis on comparative advantage compared to personal fit given certain conditions.</p>\n", "parentCommentId": "nyP5EMc2fuQzdaDHt", "user": {"username": "Benjamin_Todd"}}, {"_id": "2g5b9WWNGrQowiudo", "postedAt": "2017-07-25T11:27:33.850Z", "postId": "YRzELEmB8eqqwpp8J", "htmlBody": "<p>Great talk!</p>\n<p>Given the value that various blogs and other online discussion has provided to the EA community I'm a bit surprised by the relative absence of 'advancing the state of community knowledge by writing etc' in 80k's advice. In fact, I've found that the advice to build lots of career capital and fill every gap with an internship has discouraged me from such activities in the past. </p>\n", "parentCommentId": null, "user": null}, {"_id": "CYQ8FFeY5nLxwnhQT", "postedAt": "2017-07-25T13:31:47.193Z", "postId": "YRzELEmB8eqqwpp8J", "htmlBody": "<p>That's a great talk, thank you for it. This is why I've started to mind that people get encouraged to figure out what &quot;their cause area&quot; is. </p>\n<p>Apart from the fact that they're likely to change their mind within a few years anyway, it's more valuable for the world for them to focus on what they're good at even if it's not in their preferred cause area. Cooperation between cause areas is important.</p>\n<p>(Also, &quot;figuring out what the best cause areas are&quot; might be something that should also be done by people whose comparative advantage it is).</p>\n", "parentCommentId": null, "user": {"username": "Denise_Melchin"}}]