[{"_id": "Hw8XpYLcAtZPFYxK9", "postedAt": "2024-02-16T15:19:59.310Z", "postId": "YScdhSQBhkxpfcF3t", "htmlBody": "<p>Datapoint: I put money in my pension.</p>", "parentCommentId": null, "user": {"username": "Sean_o_h"}}, {"_id": "6D9KJKJQpdWy9vNds", "postedAt": "2024-02-16T15:23:17.986Z", "postId": "YScdhSQBhkxpfcF3t", "htmlBody": "<p>I was previously very uncertain about this, but given the updates in the last week, I'm now feeling confident enough in my prediction of the future that I regret any money I put into my super (our equivalent of a pension).<br><br>Please do not interpret this comment as financial advice, rather just a statement of where I am at.</p>", "parentCommentId": null, "user": {"username": "casebash"}}, {"_id": "3FdHamcFsEtXb8HRB", "postedAt": "2024-02-16T16:18:12.378Z", "postId": "YScdhSQBhkxpfcF3t", "htmlBody": "<p>I know this is a tangent, but I think at least in the US putting money in tax-advantaged retirement accounts still usually makes sense.  I'll take the Roth 401k case, since it's the easiest to argue for:</p>\n<ul>\n<li>\n<p>In worlds that somehow end up as a vague continuation of the status quo, you'll want to have money at retirement.</p>\n</li>\n<li>\n<p>The money is less locked up then it sounds:</p>\n<ul>\n<li>\n<p>If you want to withdraw just the contributions (and so untaxed) you can roll a Roth 401k over to a Roth IRA, if your employer allows this.</p>\n</li>\n<li>\n<p>Five years from when you open your account there are options for taking money out tax-free (including gains) even if you're not 59.5 yet. If you think you might want to live off your savings while you do something uncompensated you can take \"substantially equal periodic payments\", but there are also ones for various kinds of hardship.</p>\n</li>\n<li>\n<p>In an emergency you can take the money out now and owe taxes later.</p>\n</li>\n</ul>\n</li>\n<li>\n<p>The money is more protected than if you save it normally:</p>\n<ul>\n<li>\n<p>The first ~1.5M in your retirement account is protected from bankruptcy.</p>\n</li>\n<li>\n<p>Means testing generally ignores retirement accounts but does include conventional ones. College financial aid that uses the more thorough CSS PROFILE is a partial exception here: the college does still look at the information, but often ignores them and is less likely to ask for them than if the money is in a conventional account.</p>\n</li>\n<li>\n<p>If you lose a lawsuit, your 401k (but not an IRA) is protected from judgement creditors.</p>\n</li>\n<li>\n<p>In future cases where people are trying to come up with rules about what counts as money you have right now, they're much less likely to count retirement assets than regular ones, which is usually what you want.</p>\n</li>\n</ul>\n</li>\n</ul>\n", "parentCommentId": "Hw8XpYLcAtZPFYxK9", "user": {"username": "Jeff_Kaufman"}}, {"_id": "M5gL2nijZheYdzx3N", "postedAt": "2024-02-17T07:47:15.696Z", "postId": "YScdhSQBhkxpfcF3t", "htmlBody": "<p>I'm still saving for retirement in various ways, including by making pension contributions.</p>\n<p>If you're working on GCR reduction, you can always consider your pension savings a performance bonus for good work :)</p>\n", "parentCommentId": null, "user": {"username": "alexrjl"}}, {"_id": "LdMo6JXPAhoNc7mfG", "postedAt": "2024-02-19T20:57:36.623Z", "postId": "YScdhSQBhkxpfcF3t", "htmlBody": "<p>Expanded this into <a href=\"https://www.jefftk.com/p/retirement-accounts-and-short-timelines\">Retirement Accounts and Short Timelines</a>.</p><p>(And both derive from a draft blog post I wrote in May but didn't end up publishing because it had a modeling component that was only half baked. &nbsp;It would be great to be able to connect the probability that you'll need money in different scenarios to the penalties for early withdrawal but it's all kind of tricky.)</p>", "parentCommentId": "3FdHamcFsEtXb8HRB", "user": {"username": "Jeff_Kaufman"}}, {"_id": "y6wkggXX7cdqh6Fs5", "postedAt": "2024-02-20T15:44:31.216Z", "postId": "YScdhSQBhkxpfcF3t", "htmlBody": "<p>Thank you for sharing this!</p><p>I'm a little bit surprised the other comments only focus on the pension thing, even though it's the title.</p><p>I enjoyed how you unravel the chronology of your thoughts on existential risk from AI. It shows the complexity of this topic and the challenging journey towards developing an opinion and structuring ideas about it. That's the kind of story that helps me deal with my own confusion, as I can see the struggle of others too.</p>", "parentCommentId": null, "user": {"username": "alix.pham"}}, {"_id": "eD4bfxnbQWRQgoxrn", "postedAt": "2024-02-22T05:26:40.537Z", "postId": "YScdhSQBhkxpfcF3t", "htmlBody": "<p>What updates are you thinking of? Gemini 1.5?</p>\n", "parentCommentId": "6D9KJKJQpdWy9vNds", "user": {"username": "Oscar Delaney"}}, {"_id": "Se3cpzs6YaqaMAQFC", "postedAt": "2024-02-22T06:37:27.058Z", "postId": "YScdhSQBhkxpfcF3t", "htmlBody": "<p>Yep, that's the main one, but to a lesser extent Sora being ahead of schedule + realising what this means for AI agents.<br><br>It's less about my median timeline moving down, but more about the tail end not extending out as far.</p>", "parentCommentId": "eD4bfxnbQWRQgoxrn", "user": {"username": "casebash"}}, {"_id": "3xJEyACfhZxzTyw9e", "postedAt": "2024-02-22T10:06:33.391Z", "postId": "YScdhSQBhkxpfcF3t", "htmlBody": "<p>Yes, super interesting to see the transition of <a href=\"https://forum.effectivealtruism.org/users/tobyjolly_duplicate0-09558505769084791?mention=user\">@tobyj</a> 's thoughts on AI!&nbsp;</p><p>I wonder how much time it takes for the average EA without technical background and AI-related job to fully wrap their mind around the complexities of AI (given that now there are much more resources and discussions about this topic).&nbsp;</p><p>Obviously, there are many factors playing into this, but I would love to hear some rough estimates about this :))</p>", "parentCommentId": "y6wkggXX7cdqh6Fs5", "user": {"username": "Elisabeth Rieger"}}, {"_id": "wEFCYMj6qD853sg8G", "postedAt": "2024-02-23T13:48:46.857Z", "postId": "YScdhSQBhkxpfcF3t", "htmlBody": "<p>Sometimes I wish we had laughing emoji on the form for nice comments like this. But I get the downsides too :D.</p>", "parentCommentId": "M5gL2nijZheYdzx3N", "user": {"username": "NickLaing"}}, {"_id": "xdFnRkzSJGpEgvG84", "postedAt": "2024-03-08T12:08:29.279Z", "postId": "YScdhSQBhkxpfcF3t", "htmlBody": "<p>I understand and emphasise with you. The possibility of doom can cause paralysing fear. But it can also free us, shedding all pretense, awakening us to focus on what truly matters without wasting time, and reigniting the love for life. And the love of life seems like a better motivator for working on x-risks than the fear of death. Movies where characters rediscover life after a terminal diagnosis like&nbsp;<i>Living&nbsp;</i>(2022) and songs/poems like&nbsp;<a href=\"https://www.youtube.com/watch?v=CZGB_pxrNVg\"><u>this</u></a> (content warning: some nudity) inspire me to reframe the possibility of doom and death in this way.</p>", "parentCommentId": null, "user": {"username": "saulius"}}]