[{"_id": "gez68FphpXPaouSLG", "postedAt": "2013-12-10T20:28:00.000Z", "postId": "YujtHBxk7L6o6YPaP", "htmlBody": "<p>I agree with this essay in principle, but I think the examples of potential top domestic charities are poor.  It's not going to be possible to get broad popular agreement on which political party is the &quot;better&quot; one.</p><p>Moreover, the amount of time that will need to go into assessing what are the best domestic charities will probably have to be massive as these charities will be much harder to assess and the evidence bases will be fewer.  I'd suggest we start by finding all the RCTs on domestic charities and start looking for cost-effectiveness there. </p><p>I think another good starting point will be the organizations suggested by GiveWell labs (see <a href=\"http://blog.givewell.org/2013/09/26/givewell-labs-update-2/)\">http://blog.givewell.org/2013/09/26/givewell-labs-update-2/)</a>.  Things like geoengeneering research, criminal justice, and open science are pretty domestic and yet still potentially very high impact.  Same with, perhaps, x-risk reduction or 80K Hours.</p>", "parentCommentId": null, "user": {"username": "Peter_Hurford"}}, {"_id": "sZ2TKmiEgE86ngDFQ", "postedAt": "2013-12-10T21:39:00.000Z", "postId": "YujtHBxk7L6o6YPaP", "htmlBody": "<p>Thanks for the comment, Peter. I agree that we couldn't get broad popular agreement on which political party is the better one, but I'm pretty sure we could get about 50% agreement! In the UK at least, people who get into EA are usually either on the left or don't have political leanings (though with some notable exceptions, like  Ben Hoskin). So I think that if you promoted funding GOTV for the Democrats/Labour, you'd only alienate something like 10% of potential EAs.</p><p>And we wouldn't need to put massive amounts of time into it. Even a first-pass guess at a charity that seems particularly good for both the home nation and the world would generate most of the benefits I list above. (I think that many people would also be much happier donating to foreign countries if it also benefited the home country).</p><p>Agree on GW labs, though I think that geoengineering research, open science, 80k, xrisk reduction, are even less likely to get taken seriously than political funding.</p><p>Also, I should have said I'm not suggesting this as &quot;the most important thing to be doing right now&quot; - just something I think would be worthwhile that I used to think wouldn't have been worthwhile.</p>", "parentCommentId": "gez68FphpXPaouSLG", "user": {"username": "William_MacAskill2"}}, {"_id": "wFazCzwZMeijCcnMH", "postedAt": "2013-12-10T22:17:00.000Z", "postId": "YujtHBxk7L6o6YPaP", "htmlBody": "<p>I agree with Peter that the examples are a bit wild and distracting from the piece. </p><p>Mindfulness meditation a) comes across as a bit strange, perhaps causing confusion with religious groups; b) seems to be a bit out of the blue with regards to evidence.</p><p>Getting EA aligned with partisan politics (rather than issue-based politics aimed at affecting the policies parties adopt as they compete) means spending a lot of effort on lower-priority issues, and compromising the ability to reach out broadly.</p><p>For example, with respect to effective foreign aid, large portions of private aid donations come from people across the political spectrum. Government foreign aid is often seen as more an issue of the left, but George W. Bush was notable for massive expansions of public health aid, as in PEPFAR, which have saved millions of lives in Africa. If a number of the most important political issues have cross-cutting appeal, it could be quite costly to alienate potential allies based on conflicts on lower-priority issues (along with the reduced efficiency of a general or unconditional push, rather than say supporting high-impact policies, and factions in any parties advancing those goals).</p>", "parentCommentId": null, "user": {"username": "CarlShulman"}}, {"_id": "CKXhvGaC9CcRFgZtS", "postedAt": "2013-12-11T06:04:00.000Z", "postId": "YujtHBxk7L6o6YPaP", "htmlBody": "<p>My working assumption is that medical research is the most cost-effective domestic charity.  My toy model is:</p><p>\n- Disease X kills N people per year</p><p>\n- In expectation, we'll need M researcher-years to find a cure, costing salary<em>M dollars</em></p><p>\n- Currently disease X receives F dollars in funding each year, so in expectation we'll find the cure in salaryM/F years</p><p>\n- With an extra donation of D dollars, the expectation date of the cure gets brought forward to (salary<em>M - D)/F years, i.e., bringing it forward by D/F years.</em></p><p>\n- The earlier cure means that ND/F people who would have died will now live.</p><p>\nOrders of magnitude: 10^7 cancer deaths worldwide annually, 10^10 dollars in funding --&gt; 10^3 dollars per future statistical life saved.</p><p>\nThere are enough problems with this toy model not to take it too seriously.  I know that GiveWell have thought a lot about medical research, but it's a complicated thing with commercial interests getting involved in some stages, the question of how important the marginal researcher is, different diseases might have a different number of research &quot;leads&quot;, and so on.  The numbers will also change depending on the discount rate.</p><p>\nStill, given the orders of magnitude involved, I think medical research is pretty good impact-per-dollar-wise.  Choosing a particular charity then comes down to looking at which diseases are most underfunded relative to their DALY burden, and which charity puts the money into research rather than &quot;awareness raising&quot; or whatever.  And the latter issue is definitely one which most people can appreciate.</p>", "parentCommentId": null, "user": {"username": "pappubahry"}}, {"_id": "JGrFs3Wwa8a9hNSRc", "postedAt": "2013-12-11T07:00:00.000Z", "postId": "YujtHBxk7L6o6YPaP", "htmlBody": "<p>A THOUGHT EXPERIMENT</p><p>I am sceptical to the outreach benefit of finding effective 'at home' charities. However I do not think I am a good person to judge as to me the 'charity begins at home' idea seems highly irrational, tantamount to racism.\nThis makes me wonder why it is so common. As little though experiment I have considered why people might believe this and how telling them there is a more effective charity may or may not help.</p><p>- Defensiveness. One of the most difficult things to do is to persuade people to stop giving to a cause that they currently give to. No-one wants to feel that they have been doing the wrong thing for years, or to be told that their actions are lacking morality that they believed their actions had. Criticising someone's current giving pushes people into a corner and makes the defensive. I wonder to what extent the 'well charity begins at home' response or the 'people should give to causes close to their heart' line is used by people in an attempt to justify their current charitable giving.\nI suspect for these people telling them a different 'at home' charity is highly effective may occasionally have a some positive effect, but could just increase defensiveness.</p><p>- Social norm to give at home.\nFor these people it is perhaps more important to persuade them that it is a social norm to give effectively.</p><p>- Self-interest. Make the society they live in nicer.\nPerhaps you could persuade these people to give to a more effective 'at home' charity. However unless you persuade them to act instead in the interest of others, this change to an effective charity will not be a first step to being more EA, although it may be a foot in the door.</p><p>- They have a particular cause they feel strongly about\nIn this case you may want to recommend a charity that deals with that cause more effectively, as a foot in the door, but it is unlikely that a different at home charity would interest them.</p><p>CONCLUSION:\nI think research into at home charities would have a very limited effect at making conversation easier or helping spread EA ideas </p><p>(NOTE:\n- I have no evidence to base any of this on, just speculation\n- My conclusion maths my intuition which I admit is bias as I do not understand 'giving at home well'. This may be a reason to doubt me.\n- It may be worth clarifying that I doubt making someone change from one 'at home' charity to the most effective 'at home' charity (that is relatively normal, so not like x-risk etc) another would be an effective use of EA time as I doubt this charity would be anywhere near as effective as any of the charities that EAs support. Others may disagree.)</p>", "parentCommentId": null, "user": {"username": "weeatquince"}}, {"_id": "M7Ek3bTgz6myBNi5S", "postedAt": "2013-12-12T07:47:00.000Z", "postId": "YujtHBxk7L6o6YPaP", "htmlBody": "<p>I would change &quot;kills X people&quot; to &quot;reduces X years of quality life&quot;. If there is a late onset disease that affects people who might not live much longer or much happier then that is different to a disease which kills those with many years of quality life left.</p><p>\nObviously the proof is in the pudding and you would have to be able to measure all that.</p><p>\nCombined with the effects of diminishing returns this is the reason I don't think much of cancer research warrants a lot more funds from an EA because each individual extra dollar makes little impact on quality life years across the population.</p><p>\nThe cancers I would focus on are ones that affect children, but then again, the cost of research is high and the number of children affected is low.</p>", "parentCommentId": "CKXhvGaC9CcRFgZtS", "user": null}, {"_id": "TjYRYduaAWzHJ7twE", "postedAt": "2013-12-12T08:21:00.000Z", "postId": "YujtHBxk7L6o6YPaP", "htmlBody": "<p>Sure.  But if you change 10^3 into 10^4, we're still talking the same order of magnitude of cost-effectiveness as GiveDirectly's cash transfers (depending on how highly consumption should be valued against DALY's averted, etc.).  Even if we assume that a full accounting would show the cost-effectiveness of donations to medical research to be worse than that, what other domestic charities would have a &quot;first-guess cost-effectiveness estimate&quot; even in the same ballpark?</p>\n", "parentCommentId": "M7Ek3bTgz6myBNi5S", "user": {"username": "pappubahry"}}, {"_id": "gmarvrTSGXZbvjHAs", "postedAt": "2013-12-12T08:42:00.000Z", "postId": "YujtHBxk7L6o6YPaP", "htmlBody": "<p>Agreed :)</p>\n", "parentCommentId": "TjYRYduaAWzHJ7twE", "user": null}, {"_id": "HECJzTjSL2JrteNL2", "postedAt": "2013-12-12T10:49:00.000Z", "postId": "YujtHBxk7L6o6YPaP", "htmlBody": "<p>It's tempting to bend on the geographic equality aspect of EA because most people are primarily concerned with their own country, but worldwide human equality is so important from a moral point of view that I don't think we should be flexible in this regard. My view of altruism is that it should be about others, not about oneself and one's personal biases. If there were first world charities that were even in the ballpark of cost efficient reduction of suffering that we can get in the third world, perhaps it may be worth putting that charity in a &quot;Best of Country&quot; category, but as far as I know that isn't even the case, so I'd stick to developing world causes. Not only that, but if an extremely efficient charity was created in the first world, you wouldn't think it would be underfunded for long.</p><p>Another point I'd like to make is regarding meditation promotion as an altruistic endeavor. Effective altruism is about maximizing the benefit that you can have for others, so why should it be limited to physical well being? Spiritual/psychological well being is just as important! I don't know how promoting meditation would work or how quantifiable it would be, but I just wanted to comment that it's good that people's spiritual lives are also being recognized. Not only is meditation good for a person psychologically, but it can also has positive social effects ie. decreasing violent conflicts.</p>", "parentCommentId": null, "user": {"username": "Austen_Forrester"}}, {"_id": "LqPe8sM4fs5P8fFWA", "postedAt": "2013-12-12T16:48:00.000Z", "postId": "YujtHBxk7L6o6YPaP", "htmlBody": "<p>I like the main point here. I'd suggest that having a series of concentric &quot;rings&quot; around yourself for local, regional and global charity is in a sense more &quot;logical&quot; than an arbitrary discrete jump from spending money on yourself to global charity. But a counterargument would be that people just don't think like this and in practice things work out to a dichotomy of me vs. not me.</p>\n", "parentCommentId": null, "user": {"username": "Alexander_Gabriel"}}, {"_id": "2AcmxnksG2aopkGgd", "postedAt": "2013-12-19T15:28:00.000Z", "postId": "YujtHBxk7L6o6YPaP", "htmlBody": "<p>Thanks for the comment, Carl. I've taken back those examples, which were mistakes. In general am going to have a higher bar for quality before putting up posts, as I've found it's been easier to mislead people than I was expecting. (Maybe I could introducing a new operator? E.g. [Thinking out loud]:[sentence]&quot;) I agree that recommending funding GOTV, even non-officially, would be a bad move for the movement, for the reasons you say. I was just trying to give an example of a donation opportunity that could conceivably have high expected value in the eyes of both the &quot;charity begins at home&quot; advocate and the globally-minded effective altruist.</p><p>I was basing the mindfulness recommendation on opinions with academics, including someone doing a meta-analysis on the intervention at the Oxford Centre for Evidence-based Medicine, who reported that it was effective in the short-term (but not in the long-term). The views I heard reported were &quot;I was sceptical at first, because it seems so 'alternative', but the studies show it actually works.&quot;. But I hadn't actually looked into the data myself, which I should have done.</p>", "parentCommentId": null, "user": {"username": "William_MacAskill2"}}]