[{"_id": "nhrPrkGddcTiRk4xh", "postedAt": "2018-08-02T06:05:37.754Z", "postId": "YuwXeASg3aeiPdLdh", "htmlBody": "<p>Thank you for starting that discussion. Some resources that come to mind that should be relevant here are:</p>\n<ul>\n<li>Lukas Gloor’s concept of <a href=\"https://foundational-research.org/tranquilism/\">Tranquilism</a>,</li>\n<li>different <a href=\"http://www.plantinghappiness.co.uk/whatshappinessfor/\">types of happiness</a> (a talk by Michael Plant where I think I heard them explained), and</li>\n<li>the case for the relatively greater moral urgency and robustness of suffering minimization over happiness maximization, i.e., a bit of a <a href=\"https://foundational-research.org/the-case-for-suffering-focused-ethics/\">focus on suffering</a>.</li>\n</ul>\n", "parentCommentId": null, "user": {"username": "Telofy"}}, {"_id": "APy6EmhZfL3pDwhMa", "postedAt": "2018-08-02T10:24:34.719Z", "postId": "YuwXeASg3aeiPdLdh", "htmlBody": "<p>Generally we think about maximizing happiness as an abstract moral claim. We're in favor of whatever really does maximize happiness in the long run, even if the direct strategy is different. So we're okay with the idea of promoting stoicism rather than positive psychology, even if we're utilitarian. The possibilities that we may become unstable, suffer greatly at the first sign of hardship, lose productivity due to addiction, etc are all things that matter to a happiness maximizer in various ways, because they make people suffer in the long run.</p>\n<p>On the other hand, this really seems like a difficult psychology question. What attitude promotes the best mental well-being in the long run? Maybe stoicism is more sustainable and robust. Or maybe it's not, maybe positive psychology is also a good route to acceptance. I think it's not clear. </p>\n", "parentCommentId": null, "user": {"username": "kbog"}}, {"_id": "Xzv96r5gfT9oNj6Dg", "postedAt": "2018-08-02T11:19:31.268Z", "postId": "YuwXeASg3aeiPdLdh", "htmlBody": "<p>Thank you very much, Telofy, for your contribution! I am actually not addressing or arguing about value systems like positive or negative utilitarianism or suffering focused ethics. I see how my arguments may seem like being related to that discussion, but sustainability and propagation of well-being I think is as important for positive utilitarians as sustainable suffering reduction for negative utilitarians, so I hope I can win both sides over for my arguments. \nIt is rather true that I am partly referring to Michael Plant's use of words. However, I do actually approve of his work very much so this post isn't really addressing that, but the confusion and misunderstanding that is coming from not using differential terms (according to their connotations) and moreover the concept of positive psychology.<br />And since I'm working on similar issues I notice how much confusion there is among professionals, that make working together rather hard. So this post is partly to clarify my take on things in order to avoid repeatedly debate on principles, and rather have it once on a high level (which so far doesn't seem to work, as people keep their arguments for themselves). \nI wish people would reveal a bit more then dislike, so I could actually address things accordingly. \nBut maybe my writing doesn't reach a quality standard people feel worthy to argue with. </p>\n", "parentCommentId": "nhrPrkGddcTiRk4xh", "user": {"username": "Ruth_Freiling_duplicate0.9597937224729234"}}, {"_id": "b8WbtHWt5jgbia4sK", "postedAt": "2018-08-02T12:20:27.174Z", "postId": "YuwXeASg3aeiPdLdh", "htmlBody": "<p>I try to be in a state of happiness at least several hours a day. </p>\n<p>(For example, since yesterday i missed my daily walk, i decided to do it last night --go see the creek--because weather prediction was the rain would start today, not last night. </p>\n<p> So, as soon as i got outside about 11 pm it started pouring rain with alot of pretty lightening and thunder but i went anyway. I have 3 places i can sort of stay dry and not get hit by lighting near the creek ---a bridge and some cliffs. I went to see the flood. Then i decided to take a dip in that dirty water.  (It went from like 3 feet deep to 10 feet deep in 1 hour). I was on borderline of drowning but I can deal with that.)</p>\n<p>I heard a radio show with a talk by some womyn who said she had been depressed and unhappy---due to things like global warming, floods, fires, poverty, lots of violence. She got some 'help' and medications and then became happier---she could sit in a traffic jam during daily commute and it didn't bother her. Had a sort of stoic attitude. </p>\n", "parentCommentId": null, "user": {"username": "ishi"}}, {"_id": "ojstjQTK8tJGJi7ue", "postedAt": "2018-08-02T13:01:17.294Z", "postId": "YuwXeASg3aeiPdLdh", "htmlBody": "<blockquote>\n<p>What attitude promotes the best mental well-being in the long run? Maybe stoicism is more sustainable and robust. Or maybe it's not, maybe positive psychology is also a good route to acceptance. I think it's not clear.</p>\n</blockquote>\n<p>I agree! My own understanding comes mostly from personal experience,  observation and logic reasoning, as well as a lot of research around that topic. However, I don't know of actual quantitative data collection comparing both approaches and their effects on well-being and the sustainability. So I try very much to stay open minded towards new data, and would love people to share it if they know of comparing research data. </p>\n<p>However, to be honest my interest isn't actually aiming for improvement of individual feelings but for improving the ability and skills to do good. And what we know so far in order to be efficient in being good (meaning effective in working for one's own values) one needs to be mentally strong and resilient, and not fearful to a potentially cruel truth, to not manipulate data collection and analysis. </p>\n<p>Because, what is the value if it is discovered that being an ideal effective altruist isn't a happiness maximizing thing to do. I question that, because I very much believe being classic altruistic (if at all), and not effective altruistic, has way more potential to gather positive feelings. </p>\n", "parentCommentId": "APy6EmhZfL3pDwhMa", "user": {"username": "Ruth_Freiling_duplicate0.9597937224729234"}}, {"_id": "sRwqeXD2D9YQt7Gmq", "postedAt": "2018-08-02T20:34:13.593Z", "postId": "YuwXeASg3aeiPdLdh", "htmlBody": "<p>Hi Ruth, </p>\n<p>I think your post is thoughtful and there is a lot of truth in what you say, I would agree with a lot of it, and think it is an important and interesting discussion. This is something I have been thinking quite a lot about recently, and have come to similar conclusions.</p>\n<p>I think that positive feelings like, joy and engagement, and other feelings of happiness are important because they can give us more emotional energy and drive, and a sense of confidence, and greater self esteem. I think that positive psychology techniques such as gratitude, mindfulness and savouring the good things in life, can be really helpful and important to help us to notice the good, and train our brain away from always focusing on the negative and help us to be less anxious. However I don’t think that using positive psychology techniques and a Stoic attitude are mutually exclusive ways of being or training your mind. I would say that I use both approaches and that both are helpful.</p>\n<p>I think problems occur when we become too attached to being happy or to positive feelings, and then are constantly striving to create more of these same feelings. I think that this can actually create a lot of anxiety about when the next thing is going to be that will generate these happy feelings again. I also think that if you are too attached or too used to being happy all the time then you become less able to tolerate negative states of mind, and less able to face up to difficulties and challenges in the world and your own life, so this is actually quite a fragile way of being. </p>\n<p>&quot;But the state of happiness has the down side of getting addictive and lose the ability to handle unhappy states. In order to not freak out every time the next horrible thing is happening one needs to learn to accept the consistency of change&quot;</p>\n<p>I completely agree with this. The book ‘Staying Sane’ by Dr Raj Persaud is a bit old, but I have found it very interesting and helpful. Some interesting quotes from book: </p>\n<p>“It seems that those prone to intense happiness are also prone to more intense unhappiness, suffering from spectacular highs and lows… Happiness based on the pleasure which follows from external events is always likely to be fragile, as pleasure is usually fleeting…. Maintaining and improving mental health seems more strongly linked to this satisfaction component of happiness than to that of momentary pleasure… I would go further than saying that the pleasure part of happiness is not synonymous with positive mental health and argue that many people’s rather desperate pursuit of happiness is symptomatic of poor mental health… mentally healthy people often find themselves strengthened by negative events and are less likely to suffer a breakdown should another crisis follow on the heals of the last. In other words, mentally healthy people are able to learn emotionally from whatever life throws at them..</p>\n<p>Evidence from medical research indicates that the incidence of depression is increasing, whilst sociological research suggests that levels of happiness have not fallen..</p>\n<ul>\n<li>Happiness is not the opposite of depression, and therefore the pursuit of happiness is not the same as the avoidance of depression</li>\n<li>The chase for happiness, in particular intense happiness, will in all probability render depression more likely</li>\n<li>The attempt to enhance mood in some permanent way is usually doomed to failure because of intense mechanisms built into our mood systems which lead eventually to us getting used to improvements in our lives, with the effect that they no longer make us as happy as they did at the beginning</li>\n<li>Contentment is possible, but only by employing some strategies that do not always include the avoidance of personal difficulties</li>\n<li>Mental health is best established by aiming for mood stability rather than extreme happiness”</li>\n</ul>\n<p>Being able to accept our states of mind as simply changing states of mind and also accept situations in our life and in the world and not panic is important and builds strength and resilience. I think that the western culture can be quite unhealthy because in my opinion a lot of people prioritise feelings of happiness too much, and are constantly striving towards this, and there is social comparison about how happy other people are, and then anxiety about whether other people are more happy or having more fun than you are, an approach which is bound to lead to unhappiness and emptiness. </p>\n<p>I think that being ‘too happy’ can be problematic and research has found that people who are very happy are more likely to engage in impulsive and risky behaviours (the extreme end of the scale is to be in a state of mania) . research has also found that usually people are overconfident about their abilities, but depressed people are more realistic, and I think that the happier you are the more likely you are to be overconfident but also perhaps unrealistic, and the extreme end of this is to lose touch with reality and to become delusional about your abilities.\n<a href=\"https://greatergood.berkeley.edu/article/item/four_ways_happiness_can_hurt_you\">https://greatergood.berkeley.edu/article/item/four_ways_happiness_can_hurt_you</a></p>\n<p>There was an interesting study by a Professor of Psychology, Oettingen that showed that being really optimistic can actually hinder the achievement of goals and that the best way to achieve goals is through a process of ‘mental contrasting’ which is about being optimistic/ believing that you can achieve your goals but also recognising and working on the challenges and barriers that will occur on your progress towards your goals. \n<a href=\"https://www.businessinsider.com/this-easy-mental-contrasting-technique-can-help-you-achieve-your-goals-2014-10?IR=T\">https://www.businessinsider.com/this-easy-mental-contrasting-technique-can-help-you-achieve-your-goals-2014-10?IR=T</a></p>\n<p>And I also think that feeling very very happy is not that healthy and as you said you risk being  less able to tolerate negative emotions or situations in your life, and perhaps this is what happens in people with bipolar disorder when they swing from one extreme to the other.</p>\n<p>I think the trick is to be able to feel positive emotions and to use them to our advantage to improve our energy and drive, and optimism about life, but too not become too attached to those feelings in themselves, and to not get too carried away with them, but to keep our feet on the ground and ourselves grounded, for which we need a continued sense of mindfulness and an awareness that there are difficulties and challenges, and uncomfortable feelings in life that we need to deal with. This is about emotional regulation and is an important quality to build, in order to build strength, resilience and cope with setbacks and negative events in our lives and the world. </p>\n<p>Also, Having a strong sense of purpose has been shown to lead to many positive psychological benefits, and I think that we should use different psychological techniques , and generate positive states like joy and optimism, not really for our own pleasure but to aid us in the pursuit of our purpose. </p>\n<p>These are the principles that Acceptance and Commitment Therapy is based on, which can be really helpful – to think of your values driving you forward in life, rather than constantly being caught up in your momentary thoughts and feelings. <a href=\"https://www.actmindfully.com.au/\">https://www.actmindfully.com.au/</a> </p>\n<p>I think that effective altruism can be beneficial in giving people a strong sense of purpose, but I have also wondered the same thing as what you said here</p>\n<p>&quot;I question that, because I very much believe being classic altruistic (if at all), and not effective altruistic, has way more potential to gather positive feelings.&quot;</p>\n<p>I think that being altruistic can lead to a lot of happiness, but have also wondered myself whether being a classical altruist would lead to more happiness and less distress, because part of the philosophy or way of thinking of effective altruism is about ‘maximising’, wanting to achieve ‘the best’, always wanting better, and striving for more, and often being sceptical and dissatisfied with a lot of altruistic actions that you could take and feel happy and satisfied about, but if you are constantly thinking about whether your altruistic action is very effective and if there is a more effective way of doing something, then you are just going to be dissatisfied with yourself and experience negative feelings. Having a maximising tendency when making choices in life has been found to lead to more anxiety and depression, and less satisfaction in the end when you have made the decision. I really think that this is something the effective altruist community needs to look at, because there is a risk that people think like this too much, and experience poor mental health and too much stress because of this way of thinking.  <a href=\"https://hbr.org/2006/06/more-isnt-always-better\">https://hbr.org/2006/06/more-isnt-always-better</a></p>\n<p>In my opinion the EA community needs to look at this, and supporting people when they are using this ‘maximising tendency’ because it can potentially be a more unhealthy and distressing way of thinking.</p>\n<p>In my opinion we should also not really be striving to improve ‘happiness’ in the sense of ‘pleasure’ in the world or in the EA community but should be working on improving mental health, satisfaction with life, and happiness as a sense of contentedness. </p>\n", "parentCommentId": null, "user": {"username": "Alicegibb"}}, {"_id": "dfNwAuRNYYc9xyEx6", "postedAt": "2018-08-02T20:52:56.338Z", "postId": "YuwXeASg3aeiPdLdh", "htmlBody": "<p>I generally have found the pursuit or search for happiness transitory.  Happiness to me is a fleeting thing.  What I strive for instead is contentment.  It is a more encompassing and satisfying state to pursue because the concept encompasses so many more emotions than just being happy</p>\n<p>Oxford Definition:</p>\n<p>Contentment: a state of happiness and satisfaction.\n&quot;he found contentment in living a simple life in the country&quot;</p>\n<p>It is the pursuit of satisfaction with one's life along with a sense of happiness I feel really contributes to the well-being of one's health.</p>\n", "parentCommentId": null, "user": {"username": "WBArtists"}}, {"_id": "xgxGZpnYDiMsG92fK", "postedAt": "2018-08-02T20:56:21.544Z", "postId": "YuwXeASg3aeiPdLdh", "htmlBody": "<p>While Stoicism is one philosophy to enable a person to be at ease with themselves it, in my view, is a somewhat spartan philosophy in that, from what I have read of Seneca's writings so far, it is more a matter-of-fact philosophy that discounts happiness.</p>\n", "parentCommentId": null, "user": {"username": "WBArtists"}}, {"_id": "26evHjRgg8oS7P6ZX", "postedAt": "2018-08-03T15:59:05.111Z", "postId": "YuwXeASg3aeiPdLdh", "htmlBody": "<p>What a coincidence - I just started reading the book &quot;The Happiness Advantage&quot; by Shawn Achor.  While I'm only on the second chapter, the gist seems to be: <em>Happiness is not a product of success, but rather a precursor.  Happy people are more likely to succeed.</em>  </p>\n<p>If this premise is true, then I think positive psychology would have an edge over stoicism, when looking forward.  Stoicism might be a better technique when thinking about events in the past.</p>\n<p>Neutral evaluation of things you cannot change, but a focus on the future states that you prefer.  I wish I could have some actual evidence to back this up, but this way of thinking has worked for me so far.</p>\n", "parentCommentId": null, "user": {"username": "Naryan"}}, {"_id": "oBFjmkpN3CnEaRrgT", "postedAt": "2018-08-03T17:11:34.083Z", "postId": "YuwXeASg3aeiPdLdh", "htmlBody": "<p>Thanks for you post :-).</p>\n<p>Here's my two pence. I prefer a two pronged approach to life, and happiness.</p>\n<p>In the short-term, when life deals me cards I prefer a stoic approach. This way I can minimise the suffering caused by an inevitable situation. </p>\n<p>Whereas, in the long-term I try to shed that stoic attitude as it can lead to calloused, insensitive moral skin and an apathy to my life situation. I know many pious people with this attitude and many more oppressed people who believe nothing can be done, and are content with that.  </p>\n<p>Instead I let my dissatisfaction guide me and try to leave the game life's got me playing for a more preferable one.</p>\n<p>S</p>\n", "parentCommentId": null, "user": {"username": "Safa_Amirbayat"}}, {"_id": "pihhc6JPY8znKJT9h", "postedAt": "2018-08-03T17:16:17.162Z", "postId": "YuwXeASg3aeiPdLdh", "htmlBody": "<p>A note: Shifting between the two-modes is a considerable difficulty, for me and for others. I know of a person who lets people close to him physically attack him because of his religious beliefs in nonviolence, love and righteous suffering. To do good I feel people need to santify a nagging dissatisfaction within themselves. While that person may be perfectly happy with that, if extrapolated it's a very cruel world indeed with righteous sufferers on one side and a violent uncaring minority on the other.</p>\n", "parentCommentId": "oBFjmkpN3CnEaRrgT", "user": {"username": "Safa_Amirbayat"}}, {"_id": "fdhx8HkSrGGg49hzP", "postedAt": "2018-08-03T17:27:51.185Z", "postId": "YuwXeASg3aeiPdLdh", "htmlBody": "<p>That's the attitude I got. But from my reading of Seneca's writings on how he dealt with his exile - worse than death for many - by relishing the world's natural beauty was so heart wrenchingly beautiful I even felt a slight sense of envy.</p>\n", "parentCommentId": "xgxGZpnYDiMsG92fK", "user": {"username": "Safa_Amirbayat"}}]