[{"_id": "PhPniAoXefvLCY5HG", "postedAt": "2015-04-25T13:05:12.921Z", "postId": "YvGntsuLXzff6Gbdg", "htmlBody": "<p>Thanks for making this public! It's great to hear where things are upto, and feel a part of a larger project of people trying to concretely improve our lives and impact on others. </p>\n<p>Are there any parts that require outside assistance, or that you have open questions about?</p>\n", "parentCommentId": null, "user": {"username": "RyanCarey"}}, {"_id": "EJcW7QQpba7kxqWkW", "postedAt": "2015-04-25T16:09:49.463Z", "postId": "YvGntsuLXzff6Gbdg", "htmlBody": "<p>I'm feeling pretty good about this one, but -- as always -- if you think I'm focusing in the wrong areas or that I should focus more in one particular area, I like to know.  Your comments last quarter were helpful in making me focus more on learning.</p>\n<p>Also, if anyone has any suggestions for improving areas I feel weak at (consistency in general; consistency in exercising, sleeping, and socializing in particular), I'd love to hear them.</p>\n<p>I'm open to any comments, really.</p>\n", "parentCommentId": "PhPniAoXefvLCY5HG", "user": {"username": "Peter_Hurford"}}, {"_id": "jpCpwyr9T2Kq69ejZ", "postedAt": "2015-04-25T22:11:37.351Z", "postId": "YvGntsuLXzff6Gbdg", "htmlBody": "<p>Things sound like they're going well. Here are some thoughts:</p>\n<ul>\n<li><p>make sure to get extra feedback on future startup ideas who have different startup and life experience to you. Assume your ideas are terrible, and frequently unsalvageably so and the challenge is to find out why. Until significant and diverse feedback is incorporated, one's prior would be that this is the case for the stealth startups too.</p>\n</li>\n<li><p>have you considered meeting online with people who want to &quot;study data science for good&quot;? That's something I'd like to see, and that I think some altruists might be motivated by: brayden, Alex Robson, Marek Duda and occasionally me to name a few, and one could even usefully recruit high-impact analytic, altruistic people.</p>\n</li>\n<li><p>The brand-new Johns Hopkins applied machine learning course in R is great and you've probably reached the appropriate level for it.</p>\n</li>\n<li>The main thing that I think would increase your impact is still meeting people in SF, to move your understanding of some EA and rationality conceptd to the gut level and practice implementing them. Although there are no reliable generators of planning or prioritisation insights, it's a good candidate.</li>\n</ul>\n<p>Good luck!</p>\n", "parentCommentId": "EJcW7QQpba7kxqWkW", "user": {"username": "RyanCarey"}}, {"_id": "NXCzaFGp2aPP4F3yr", "postedAt": "2015-04-26T03:35:13.814Z", "postId": "YvGntsuLXzff6Gbdg", "htmlBody": "<blockquote>\n<p>Assume your ideas are terrible, and frequently unsalvageably so and the challenge is to find out why.</p>\n</blockquote>\n<p>Yeah, that's good advice.  Sort of like <a href=\"https://hbr.org/2007/09/performing-a-project-premortem\">a project pre-mortem</a>.</p>\n<p>-</p>\n<blockquote>\n<p>have you considered meeting online with people who want to &quot;study data science for good&quot;?</p>\n</blockquote>\n<p>Sounds good, but I'm not sure what we'd do.  Any suggestions?</p>\n<p>-</p>\n<blockquote>\n<p>The brand-new Johns Hopkins applied machine learning course in R is great and you've probably reached the appropriate level for it.</p>\n</blockquote>\n<p>I'll have to give it a look through.  A lot on my &quot;to learn&quot; plate. :)</p>\n<p>-</p>\n<blockquote>\n<p>The main thing that I think would increase your impact is still meeting people in SF</p>\n</blockquote>\n<p>Yeah, I agree.  I'll have to come visit sometime, either for the EA Summit or for an impromptu trip.</p>\n<p>-</p>\n<blockquote>\n<p>to move your understanding of some EA and rationality conceptd to the gut level</p>\n</blockquote>\n<p>Do you have any particular concepts in mind that you think I might be missing?  Certainly I have some, if not, many, but curious what you think.</p>\n", "parentCommentId": "jpCpwyr9T2Kq69ejZ", "user": {"username": "Peter_Hurford"}}, {"_id": "vTiQyBmPNEHouCm8J", "postedAt": "2015-04-26T09:36:00.260Z", "postId": "YvGntsuLXzff6Gbdg", "htmlBody": "<blockquote>\n<blockquote>\n<p>to move your understanding of some EA and rationality concepts to the gut level</p>\n</blockquote>\n</blockquote>\n<blockquote>\n<p>Do you have any particular concepts in mind that you think I might be missing? </p>\n</blockquote>\n<p>Presumably neither of us know most of the things that are known about EA and rationality... You probably know more about EA than rationality, more about animals than tech risks, and more about EA theory than EA orgs? One insight that I picked up in my travels is that in a certain sense, asteroid detection is the most 'robust' cause, since we know a lot more about how to do it, compared to entering a complex human system like global poverty. An interesting meditation on whether we should pivot to asteroid deflection, whether we want 'robustness', and what people mean by 'robustness'.</p>\n", "parentCommentId": "NXCzaFGp2aPP4F3yr", "user": {"username": "RyanCarey"}}, {"_id": "tQgA4XHxAoMjFyEyn", "postedAt": "2015-04-27T18:01:52.860Z", "postId": "YvGntsuLXzff6Gbdg", "htmlBody": "<p>Seems like another uncharitable implicit argument against the EAs known for favouring robustness (GiveWell, the Vancouverites, people skeptical about leafleting and metacharities and xrisk on those grounds). I've heard experts say the most important parts of asteroid detection are fully funded. If they weren't people would generally accept funding them as a priority.</p>\n", "parentCommentId": "vTiQyBmPNEHouCm8J", "user": {"username": "Ervin"}}, {"_id": "MGiCTgRoaBetzKPNp", "postedAt": "2015-04-27T19:01:28.522Z", "postId": "YvGntsuLXzff6Gbdg", "htmlBody": "<p>I'm not trying to say folks who espouse robustness are fools - Until I encountered it, I had not thought of this line of reasoning myself. As I understand it, the point is that sometimes the connotations of such words lead in different directions from if we thought more carefully. Yes, &gt;1km asteroid detection is well-covered now. So is next thing to move onto is asteroid deflection? You can see how an argument would run, that since physical annihilation is so final and well-understood, it wins on robustness grounds...</p>\n", "parentCommentId": "tQgA4XHxAoMjFyEyn", "user": {"username": "RyanCarey"}}, {"_id": "wuLSpgaqTve26qfbk", "postedAt": "2015-05-02T07:01:47.429Z", "postId": "YvGntsuLXzff6Gbdg", "htmlBody": "<p>Interesting read.  I’ll share some random thoughts of mine I’m not very confident in.</p>\n<ul>\n<li><p>You give me the overall impression of being stretched pretty thin.  You seem aware of this, but it doesn’t seem to me like you’re making the hard decisions you need to about what activities to cut out of your life.  The analogy here might be a government that’s currently spending beyond its means and has no way of going in to debt in order to sustain deficit spending.  The only way to add something new to the budget is to cut something that exists already.  You might make an argument that by taking on more than you can expect to accomplish, you’ll always have something to do and you’ll get pushed beyond your current abilities.  This argument might be true, but I think it’s likely enough to be untrue to experiment with scaling your ambitions back to see how that works out.  Ultimately stress is bad for your productivity and mental health.  I tend to think personal growth comes from optimizing your behaviors at a micro level (e.g. developing a routine that reliably transitions you in to working on personal projects at the end of your workday), not by setting macro level goals and letting the micro level details work themselves out.  If I were you, for instance, I would cut learning Chinese (I’m sure we’ll find some EAs with native fluency at some point if we haven’t already) and connecting more with friends (unless this is something you do mainly because it makes you happy and rejuvenates you.  I don’t make efforts to keep in touch with old friends beyond being friends on Facebook, and this seems to have worked out fine for me so long as I’m getting my socializing needs met somehow.)</p>\n</li>\n<li><p>I’ve been playing the startup game off and on for the past four years or so.  My current view is that capitalism is a different game than hacking, but still one that’s a lot of fun to play.  To be good at capitalism you want to know a lot about how the economy works.  Knowledge of how the economy works has a short half-life because the economy is constantly changing.  Almost everyone has a decent amount of firsthand knowledge about how the economy works through their experiences as an employee and consumer, but people who try to fit their experiences, and the experiences of businesses they read about, and the stuff you learn in an economics textbook, in to an overall framework that gives them a nose for finding, evaluating, and improving opportunities are rare.  There’s a saying in the startup world that ideas don’t matter and execution is everything.  I’ve spent lots of time executing and my view is that saying is wrong, but it points to something true.  There’s a certain kind of excited wannabee entrepreneur you meet who is convinced that they have a super hot startup idea that’s going to make them rich.  Typically they’re wrong about this because they’re not sufficiently knowledgeable capitalists to be very good at evaluating ideas in the first place.  For example, maybe their idea is to improve product Y by giving it characteristic Z, when in fact buyers of Y don’t care about characteristic Z.  Or maybe their idea only works if thousands of people are users of it, and they don’t have a battle plan to scale things up to that point (example: an acquaintance started a failed YC startup that let users clip/highlight bits of web pages that seemed interesting; the goal was to make it so that when reading a web page, you could easily pick out the good bits based on text that was frequently highlighted/clipped).  Or their idea is only a small improvement over the status quo, and no one is going to go to the trouble of using it (example: a friend’s startup would broadcast text messages with your location to friends you were going to meet up with; imploded due to lack of funding).  Paul Graham says that the best startup ideas look like bad ideas, and he cites the example of AirBNB, which seemed like a bad idea to him because he was too old to imagine letting strangers sleep in his house.  I don’t think this contradicts my point; rather; I think the founders of AirBNB were unusually good at evaluating this idea relative to Paul Graham in the sense that they had a better mental model of young people like themselves than he did.  In general, having access to information about the economy (in this case, the preferences of young people with spare rooms in their apartments) gives you a bit of an edge in the same way knowing insider information about a publicly traded company gives you an edge when trading its stock.  Anyway, a typical wannabee entrepreneur guards their idea like a delicate vase and doesn’t gather any information (e.g. a simple Google search for what players already exist in this space) that might smash it.  The cure is to not get too invested in your ideas; instead, see them as exciting opportunities to do some research in a particular industry to see what opportunities exist there.  If I was seriously evaluating a startup idea right now I’d use the Waterloo quiz described in this article: <a href=\"https://80000hours.org/2012/02/entrepreneurship-a-game-of-poker-not-roulette/\">https://80000hours.org/2012/02/entrepreneurship-a-game-of-poker-not-roulette/</a>  It’s been validated in its predictive accuracy quite heavily and seems like it could be a pretty good shortcut to evaluating ideas well without having to gain the necessary expertise.  The other thing that’s important for entrepreneurs is sheer personal competence.  Even if you don’t have any sustainable competitive advantage in an industry, it’s possible to outdo your competitors just by having great people who work really smart and really hard, like Google or Walmart.  It’s unlikely that you’ll have the opportunity to hire anyone more competent than you are to work for your startup.  So being personally very competent is important.  The typical wannabee entrepreneur is not competent enough to even get started on their idea; they just dream about it.  You’ve already passed that bar with flying colors, it sounds like.  Still, I would prioritize sleep and exercise over your startup for a while to see if you can get those competence gains locked in.  In principle studying R etc. also increases one’s competence, but your startup is probably doing double duty and improving your coding skills to a decent extent as you work on it anyway, so I’m not sure how best to manage that tradeoff.  Anyway, the main reason to launch your startup quickly is so you can start collecting data ASAP, especially unique data that no one else would have unless they were running another company of the same sort as yours.  For example, part of what inspired Zuck to create Facebook was his observation that Harvard students would spend a lot of time stalking each other on a previous tool he had created that let you see what classes everyone was taking.  But often you can cheat and just talk to customers about their needs, or do some research.  You always want to be prioritizing the collection of data regarding whichever aspect of your business you’re most uncertain about.  If you knew in advance exactly what you needed to build, startups would be pretty easy, just as easy as being an employee, with the same guaranteed payoff.  Startups are hard because hacking the economy is not the same as hacking code, and most people don’t realize they need to get good at hacking the economy in order to guide their code hacking efforts (and specifically have lots of detailed knowledge of the economic terrain in whatever industry they’re playing in; you might be surprised by how easy it is to gain an edge on competitors by doing a little homework).</p>\n</li>\n</ul>\n", "parentCommentId": null, "user": {"username": "John_Maxwell_IV"}}, {"_id": "HtbmbNXHbedjDscH5", "postedAt": "2015-05-02T13:05:41.807Z", "postId": "YvGntsuLXzff6Gbdg", "htmlBody": "<blockquote>\n<p>I tend to forget to actually do this in any of the actual work. We keep adding cool features because they’re fun and we’re sure they’ll be useful, without just getting the project out there first and asking potential users.</p>\n</blockquote>\n<p>I've used beeminder for this with some success. As with a lot of things that I used beeminder for, a large part of the value I get is by being forced to make an explicit goal about how many customers am going to talk to. E.g. right now I'm fundraising and so it might be easy for me to focus on that instead of customer validation, so having the beeminder set up forces me to figure out if I should put customer validation on hold or if it's still important to talk to customers while raising.</p>\n<p>I only started doing beeminder after I had already had a completed product, but you can see my progress after that <a href=\"https://www.beeminder.com/xodarap/goals/interviews\">here</a>.</p>\n", "parentCommentId": null, "user": {"username": "Ben_West"}}, {"_id": "RL6rYgXjqA7eArng3", "postedAt": "2015-05-05T15:21:10.132Z", "postId": "YvGntsuLXzff6Gbdg", "htmlBody": "<p>&quot;You give me the overall impression of being stretched pretty thin. [There are] hard decisions you need to about what activities to cut out of your life.&quot;</p>\n<p>FWIW, I agree with this and I'd cut Chinese and some/all startups myself. Say if you'd prefer to discuss this in personal conversations Peter!</p>\n", "parentCommentId": "wuLSpgaqTve26qfbk", "user": {"username": "Tom_Ash"}}]