[{"_id": "CGMrFFp6yeyAeABJH", "postedAt": "2023-10-10T12:20:48.946Z", "postId": "YWofbSJvDrPjFGvvs", "htmlBody": "<p>Wow thanks so much for this opportunity!</p><p>What's the feeling both yourself and among your peers about what the best approach for Israel is here over the next month or so. A heavy attack? Gaza occupation? Some form of negotiation.<br><br>From afar all I can see is political statements, what do you think might be the best (of a lot of very painful) ways forward.</p><p>Perhaps that's too broad a question, answer it as you like.</p>", "parentCommentId": null, "user": {"username": "NickLaing"}}, {"_id": "YsCyYAKk3zYSEDAeL", "postedAt": "2023-10-10T12:53:39.683Z", "postId": "YWofbSJvDrPjFGvvs", "htmlBody": "<p>Some answers from the LW AMA:<br><a href=\"https://www.lesswrong.com/posts/zJCKn4TSXcCXzc6fi/i-m-a-former-israeli-officer-ama?commentId=K8Cjv9rTzfa5Lp4gd\">https://www.lesswrong.com/posts/zJCKn4TSXcCXzc6fi/i-m-a-former-israeli-officer-ama?commentId=K8Cjv9rTzfa5Lp4gd</a></p>", "parentCommentId": "CGMrFFp6yeyAeABJH", "user": {"username": "hibukki"}}, {"_id": "APygaS2uiWNvsEWgp", "postedAt": "2023-10-10T13:54:58.951Z", "postId": "YWofbSJvDrPjFGvvs", "htmlBody": "<p>As I read about this conflict, I keep thinking about charter cities and open borders/immigration policy.</p>\n<p>As I understand it: Israel was created to be a homeland for the Jewish people after the Holocaust.  Neither Israel nor Egypt wants to let Palestinians out of Gaza, and no country wants to accept them as refugees.  So for both sides, \"having a nice place to live\" is a key issue.</p>\n<p>I'm very sympathetic to anyone who wants to lead a safe and prosperous life.  I'm not as sympathetic to anyone who insists that their people deserve a particular chunk of territory for historical or religious reasons.  Fulfilling some sort of historical or religious purpose seems near the top of Maslow's hierarchy of needs, and I don't think people should be causing others to suffer so they can fulfill such a purpose.</p>\n<p>I find myself wondering if both Jews and Palestinians would be better off if they weren't living right next to each other.  <a href=\"https://www.nytimes.com/2022/12/15/opinion/israel-palestinians-arabs-jews.html\">It seems as though</a> the dynamic illustrated in the <a href=\"https://ncase.itch.io/wbwwb\">We Become What We Behold</a> browser game has been playing out in Israel/Palestine for many decades, and I don't see how to stop that cycle once it's started.</p>\n<p>Milton Friedman once said:</p>\n<blockquote>\n<p>Only a crisis - actual or perceived - produces real change. When that crisis occurs, the actions that are taken depend on the ideas that are lying around. That, I believe, is our basic function: to develop alternatives to existing policies, to keep them alive and available until the politically impossible becomes the politically inevitable.</p>\n</blockquote>\n<p>Up until now, the idea of charter cities has existed somewhat on the fringe, but I'm wondering if it's an idea that's lying around which could be helpful.</p>\n<p>It so happens that one of the world's only chunks of unclaimed land, <a href=\"https://en.wikipedia.org/wiki/Bir_Tawil\">Bir Tawal</a>, lies south of Egypt.</p>\n<p>My wild idea is: Israel strikes a deal with Egypt, Sudan, and the local Bedouins to create a Palestinian state there, hires international firms to build the area up with buildings and transport links, and creates a corridor for Palestinians willing to relocate out of Gaza.</p>\n<p><strong>The pitch for Israel</strong> is: This allows you to invade Gaza/isolate militants with fewer IDF soldiers and Palestinian civilians dying.  It could even be cheaper financially.  It achieves a way better humanitarian outcome.  And it ends the cycle of radicalization.  Every Palestinian who moves to Bir Tawal is a Palestinian who is less likely to be radicalized into Hamas during the invasion, and a Palestinian who can't easily storm your border wall or fire a rocket into Israel.</p>\n<p><strong>The pitch for Gazans</strong> would focus on improved quality of life.  Bir Tawil is 4x as large as the Gaza Strip, so there's more room.  Israel should subsidize the new state for the first X years of its existence, e.g. through a basic income.  To make sure Israel follows through with its promise, signatories to the Abraham Accords could pledge to break off relations with Israel anew if the funds don't come through.  Signatories could also supervise the process of Gazan relocation to ensure no human rights abuses.  The threat of breaking off relations with Israel would ensure a good relocation experience.</p>\n<p><strong>The pitch for the rest of the world</strong> is reducing the risk of a great power conflict, e.g. between the US and Iran.  Perhaps you could involve Saudi Arabia in the idea if you can persuade them that weakening Hamas will weaken Iran.  Saudi Arabia has a <a href=\"https://www.astralcodexten.com/p/model-city-monday-8122\">demonstrated interest</a> in creating futuristic new cities in the middle of nowhere.</p>\n<p><strong>Alternatively, from an immigration policy perspective</strong>: Israel could just pay other countries to accept Gazan refugees.  The IDF has an annual budget of $10-20 billion USD.  There are about 2 million people in Gaza.  So on a napkin it seems reasonable for Israel to pay, say, $10K USD per Gazan to any country willing to give any number of Gazans permanent residency.  That $10K would break down into transportation funds, funds for the destination country's government, and funds for the emigrant Gazan to find their feet in a new country.  (Presumably militants will have trouble getting permanent residency, but they'll probably want to stay behind anyways.)</p>\n<p>What do you think of these ideas?  I'm fairly ignorant about this conflict so I assume my ideas have major holes.  (If they <em>don't</em> have holes, I encourage someone else to grab them and run with them, since I'm focused on AI alignment.  I don't have a platform to signal boost stuff, nor do I have thoughts on the best messaging strategy.  Feel free to plagiarize me shamelessly though.  <strong>EDIT</strong>: That goes for all the comments I make with this account.)</p>\n<p><strong>EDIT</strong>: New idea <a href=\"https://forum.effectivealtruism.org/posts/YWofbSJvDrPjFGvvs/i-m-a-former-israeli-officer-ama?commentId=aozeEhbJ3N3dMTmif\">here</a></p>\n", "parentCommentId": null, "user": {"username": "chinscratch"}}, {"_id": "vLePqPoXut8SneLqQ", "postedAt": "2023-10-10T14:12:25.145Z", "postId": "YWofbSJvDrPjFGvvs", "htmlBody": "<p>Thanks, I'm interested that you think occupation is a real possibility, with another leadership to take over control - that would mean a battle and complete takeover I suppose, its hard to imagine Hamas surrendering easily...</p>", "parentCommentId": "YsCyYAKk3zYSEDAeL", "user": {"username": "NickLaing"}}, {"_id": "Bag3q8MCdbrHGxdGK", "postedAt": "2023-10-10T17:28:02.572Z", "postId": "YWofbSJvDrPjFGvvs", "htmlBody": "<p>Hey, just saying explicitly that I linked to opinions of other people, not my own.</p><p>(and I'm suggesting that you reply there if you have questions for them)</p>", "parentCommentId": "vLePqPoXut8SneLqQ", "user": {"username": "hibukki"}}, {"_id": "v9GyamCsYbN5GByoh", "postedAt": "2023-10-10T19:56:46.619Z", "postId": "YWofbSJvDrPjFGvvs", "htmlBody": "<p>Israel would be very much in favour, and would pay quite a lot of money. At least 10% of our annual 125 billion $ defense budget goes to protect from the Gaza strip specifcally.&nbsp;</p><p>Palestinians would not accept that, since they very much do want the specific land, and not an improved quality of life. Also I'm not actually sure they will get it in a landlocked desert, but that's besides the point.</p><p>Forced population tranfer is considered a crime against humanity and is not an option currently on the table.</p><p>Paying every immigrant actually has been a suggestion, mainly from the far right. It's considered close enough to forced population transfer that it's not mainstream, and I'm not sure how many takers you'll have. Also countries tend to not actually want Gazan immigrants.</p>", "parentCommentId": "APygaS2uiWNvsEWgp", "user": {"username": "Yovel Rom"}}, {"_id": "bKCXcwvAGgfFmabzE", "postedAt": "2023-10-10T20:00:41.802Z", "postId": "YWofbSJvDrPjFGvvs", "htmlBody": "<p>As Yonatan said, I answered in that comment. You're more than welcome to add follow- up questions here.</p>", "parentCommentId": "CGMrFFp6yeyAeABJH", "user": {"username": "Yovel Rom"}}, {"_id": "g9W5mZK7di3oCKJu5", "postedAt": "2023-10-10T20:01:58.309Z", "postId": "YWofbSJvDrPjFGvvs", "htmlBody": "<p>Not easy, but personally I don't see an alternative, as seems to be a growing concensus. Whether it's possible we'll have to see.</p>", "parentCommentId": "vLePqPoXut8SneLqQ", "user": {"username": "Yovel Rom"}}, {"_id": "MMoGCba3sxKShrFPC", "postedAt": "2023-10-10T21:06:05.243Z", "postId": "YWofbSJvDrPjFGvvs", "htmlBody": "<p>Can you see any realistic path to a long-term future where both Israelis and Palestinians have peace, security, freedom and democratic autonomy?&nbsp;</p>", "parentCommentId": null, "user": {"username": "titotal"}}, {"_id": "Z3jk9ZTGAMgzrPwYC", "postedAt": "2023-10-11T06:54:44.140Z", "postId": "YWofbSJvDrPjFGvvs", "htmlBody": "<p>Israeli Arabs already have that, as a minority inside a jewish country.</p><p>As for the West Bank and Gaza Strip Palestinians: Not really. I think too many of them literally want to kill all the jews, and their education system <a href=\"https://he.wikipedia.org/wiki/%D7%94%D7%A1%D7%AA%D7%94_%D7%9C%D7%98%D7%A8%D7%95%D7%A8_%D7%91%D7%9E%D7%A2%D7%A8%D7%9B%D7%AA_%D7%94%D7%97%D7%99%D7%A0%D7%95%D7%9A_%D7%91%D7%A8%D7%A9%D7%95%D7%AA_%D7%94%D7%A4%D7%9C%D7%A1%D7%98%D7%99%D7%A0%D7%99%D7%AA\">encourages that</a> (Hebrew Wikipedia, sorry) even in the West Bank which is considered more moderate. The Palestinian Authority <a href=\"https://he.wikipedia.org/wiki/%D7%A2%D7%99%D7%93%D7%95%D7%93_%D7%98%D7%A8%D7%95%D7%A8_%D7%A2%D7%9C_%D7%99%D7%93%D7%99_%D7%94%D7%A8%D7%A9%D7%95%D7%AA_%D7%94%D7%A4%D7%9C%D7%A1%D7%98%D7%99%D7%A0%D7%99%D7%AA\">pays handsome salary </a>(Hebrew Wikipedia again) to every terrorist for every person they kill, be they military or civilian.</p><p>I think when enough people want peace we will get it, one way or another. Until then we will get one semi- stable bad equilibrium after the other.</p>", "parentCommentId": "MMoGCba3sxKShrFPC", "user": {"username": "Yovel Rom"}}, {"_id": "Gyev9yye3dvRFBmYf", "postedAt": "2023-10-11T08:13:07.577Z", "postId": "YWofbSJvDrPjFGvvs", "htmlBody": "<p>Strongly disagree.</p><p>Most people are the silent majority, who just want peace and don't have leverage to make it happen. That applies to the Palestinians and Israelis, most of whom don't know what to do, but want things to be peaceful and allow them to live happy lives. Unfortunately, political leaders on both sides have incentives to ensure that the easiest path to their near-term goals of staying in power involve continuing the cycle of violence.&nbsp;</p><p>The critical path in my mind is prosperity - if Palestinians had a median income of Jordanians and Iraqis, double the current level, or of Egyptians, which triple the current level, it wouldn't matter that median Israelis had four or five times as much. But Iran has probably successfully maneuvered Israeli into undermining the Saudi deal, and I think that Israel's narrow short term needs will continue the cycle.</p>", "parentCommentId": "Z3jk9ZTGAMgzrPwYC", "user": {"username": "Davidmanheim"}}, {"_id": "8JHGXJqiFyPEoxoc5", "postedAt": "2023-10-11T08:14:03.819Z", "postId": "YWofbSJvDrPjFGvvs", "htmlBody": "<p>Bir Tawil sounds like one of the least hospitable places in the world; getting people to move there, away from their holy land, might be a tough sell.</p>", "parentCommentId": "APygaS2uiWNvsEWgp", "user": {"username": "Linch"}}, {"_id": "2iBd9fJbr3SKjuTiF", "postedAt": "2023-10-11T08:15:10.289Z", "postId": "YWofbSJvDrPjFGvvs", "htmlBody": "<p>The problem is that there is no endgame. As I <a href=\"https://twitter.com/davidmanheim/status/1711344270605447586\">said two days ago</a>, we're repeating what the US did after 9/11, mistakes and all.</p>", "parentCommentId": "g9W5mZK7di3oCKJu5", "user": {"username": "Davidmanheim"}}, {"_id": "z6RA3mxBgMaQfmXmv", "postedAt": "2023-10-11T09:10:24.364Z", "postId": "YWofbSJvDrPjFGvvs", "htmlBody": "<p>I agree those are heavy short-term and medium-term obstacles. But I was asking about the long-term. How do you <i>persuade</i> the population of Gaza to want peace?&nbsp;</p><p>Right now, Gazans are being born packed like sardines into a poverty-stricken strip that they can't leave, and their primary exposure to Israelis is via blockades and bombs. Those conditions clearly contribute to a ripe recruitment ground for hatred and terrorism.&nbsp;</p><p>If instead Gaza was a relatively prosperous land, with freedom of movement and control over it's own future, and the violence with Israel was a distant memory, then it seems unlikely the average citizen would jeopardize that prosperity by supporting terrorism.&nbsp;</p><p>The problem is how to get from point A to point B, given that it take time for hatred to fade, and that helping Gaza be prosperous might also help terrorists get more deadly.&nbsp;</p>", "parentCommentId": "Z3jk9ZTGAMgzrPwYC", "user": {"username": "titotal"}}, {"_id": "nhkAkq2qXvBihAsHB", "postedAt": "2023-10-11T10:39:37.188Z", "postId": "YWofbSJvDrPjFGvvs", "htmlBody": "<blockquote>\n<p>Gazans are being born packed like sardines</p>\n</blockquote>\n<p>Considered as a city-state, Gaza doesn't seem notably population-dense?  It's less dense than all <a href=\"https://en.wikipedia.org/wiki/List_of_cities_proper_by_population_density\">these cities</a>, for instance.  (Maybe lack of tall buildings is a factor here?)</p>\n", "parentCommentId": "z6RA3mxBgMaQfmXmv", "user": {"username": "chinscratch"}}, {"_id": "ypxoEENyb9GrYBHey", "postedAt": "2023-10-11T11:23:45.451Z", "postId": "YWofbSJvDrPjFGvvs", "htmlBody": "<blockquote>\n<p>Paying every immigrant actually has been a suggestion, mainly from the far right. It's considered close enough to forced population transfer that it's not mainstream, and I'm not sure how many takers you'll have.</p>\n</blockquote>\n<p>Seems like there's an important distinction regarding whether the transaction is voluntary or not.  If someone gave me the option of a stipend and free airfare to relocate to a different country, I probably wouldn't take their offer, but I wouldn't consider myself a victim of a crime against humanity either.</p>\n<p>I wasn't proposing an all-or-nothing approach.  It seems to me that there is value on the margin in giving individual Palestinians more options.  If Israel is about to invade Gaza, I'll bet there are at least a few women, children, and elderly who would appreciate the option of a permanent residency elsewhere.  And this is also likely to benefit Israel from a PR perspective.</p>\n<p>In terms of countries wanting immigrants -- $10K per immigrant means $10M for a country that takes in 1000 immigrants.  I imagine some countries could use the cash -- ideally countries where Arabic is the primary language.</p>\n<p>Anyway, thanks for your response!</p>\n", "parentCommentId": "v9GyamCsYbN5GByoh", "user": {"username": "chinscratch"}}, {"_id": "aozeEhbJ3N3dMTmif", "postedAt": "2023-10-11T11:49:51.395Z", "postId": "YWofbSJvDrPjFGvvs", "htmlBody": "<p>Anyway, I think your analysis is interesting.  My new idea is for Israel to set up microincentives related to peace and prosperity: e.g. from the start of every morning, Gaza gets as much electricity as it wants, but as soon as the first rocket is fired, reduce electricity to the restricted level for the rest of the day.  That incentivizes Gazans to put social pressure on each other not to fire rockets.</p>\n<p>The long-term goal would be to progressively remove all aspects of the blockade, and eventually give Gaza the status of an independent state, as peace-related milestones are met.  (Note: I personally am uncertain whether I'm on board with <em>any</em> blockade, but I'm trying to brainstorm plans that would be acceptable to the Israeli electorate, once things have cooled down at least.)</p>\n", "parentCommentId": "z6RA3mxBgMaQfmXmv", "user": {"username": "chinscratch"}}, {"_id": "RZuGFLbodGeaHe4gX", "postedAt": "2023-10-11T14:01:36.348Z", "postId": "YWofbSJvDrPjFGvvs", "htmlBody": "<blockquote><p>Most people are the silent majority, who just want peace and don't have leverage to make it happen. That applies to the Palestinians and Israelis, most of whom don't know what to do, but want things to be peaceful and allow them to live happy lives.</p></blockquote><p>Do you have a source for this? My impression was that a lot of Gazans were quite supportive of violence. For example, from the top results on google for 'Gaza public opinion', earlier this year:</p><blockquote><p>Overall, 57% of Gazans express at least a somewhat positive opinion of Hamas—along with similar percentages of Palestinians in the West Bank (52%) and East Jerusalem (64%)—though this is fewer than those who support Fatah (64%). <a href=\"https://www.washingtoninstitute.org/policy-analysis/polls-show-majority-gazans-were-against-breaking-ceasefire-hamas-and-hezbollah\">https://www.washingtoninstitute.org/policy-analysis/polls-show-majority-gazans-were-against-breaking-ceasefire-hamas-and-hezbollah</a></p></blockquote><p>and</p><blockquote><p>Support for a return to armed confrontations and intifada increases from 55% to 58% <a href=\"https://www.washingtoninstitute.org/policy-analysis/polls-show-majority-gazans-were-against-breaking-ceasefire-hamas-and-hezbollah\">https://www.washingtoninstitute.org/policy-analysis/polls-show-majority-gazans-were-against-breaking-ceasefire-hamas-and-hezbollah</a>&nbsp;</p></blockquote>", "parentCommentId": "Gyev9yye3dvRFBmYf", "user": {"username": "Larks"}}, {"_id": "cGW2SN7Zx2jGedHoq", "postedAt": "2023-10-11T17:33:13.974Z", "postId": "YWofbSJvDrPjFGvvs", "htmlBody": "<p>The last attack was completely unprecedented in terms of cruelty and mercilessness towards civilians. I don't know how much previous surveys about support for Hamas (who were perceived as \"resisting occupation in the only way they can\") can tell us now.</p>\n", "parentCommentId": "RZuGFLbodGeaHe4gX", "user": {"username": "Guy Raveh"}}, {"_id": "wcWhtJXDy5HKprBGB", "postedAt": "2023-10-11T17:37:58.531Z", "postId": "YWofbSJvDrPjFGvvs", "htmlBody": "<p><a href=\"https://en.wikipedia.org/wiki/Palestinian_Legislative_Council\">The Hamas holds 56% of the Palestinian Legislative Council seats</a>, elected democratically in 2006. Neither Presidency nor legislative council elections have not been held since 2006, because Hamas would win them.&nbsp;</p><p>What evidence do you have for a silent, peaceful majority?</p>", "parentCommentId": "Gyev9yye3dvRFBmYf", "user": {"username": "Yovel Rom"}}, {"_id": "Jb5qdT79FqizABj5r", "postedAt": "2023-10-11T17:40:14.406Z", "postId": "YWofbSJvDrPjFGvvs", "htmlBody": "<p>I agree there's no endgame. I'm working on a long answer explaining why that's not too terrible.</p>", "parentCommentId": "2iBd9fJbr3SKjuTiF", "user": {"username": "Yovel Rom"}}, {"_id": "s2ckqXjdRgZZHH5yk", "postedAt": "2023-10-11T17:52:04.430Z", "postId": "YWofbSJvDrPjFGvvs", "htmlBody": "<p>A very good question, with no good answer. If I knew one I would be advising the prime minister, not writing on this forum :)</p><p>I imagine a model closer to the West Bank, where there's some joint Israeli- Palestinian control. It's not great, but way better than the current situation in Gaza, and hopefully might de- escalate somewhat the situation. In such case the blockade will probably be lifted, and Gaza might get some actual economic development.</p>", "parentCommentId": "z6RA3mxBgMaQfmXmv", "user": {"username": "Yovel Rom"}}, {"_id": "kdqBwoetczs2QANP7", "postedAt": "2023-10-11T18:56:20.492Z", "postId": "YWofbSJvDrPjFGvvs", "htmlBody": "<p>Sure, if David is basing his view on more recent data he is welcome to share it.</p>", "parentCommentId": "cGW2SN7Zx2jGedHoq", "user": {"username": "Larks"}}, {"_id": "dsXXEb8JfqveJpmts", "postedAt": "2023-10-12T07:25:56.302Z", "postId": "YWofbSJvDrPjFGvvs", "htmlBody": "<p>How can people outside of Israel help?&nbsp;</p>", "parentCommentId": null, "user": {"username": "Linch"}}, {"_id": "DQNZf6kmF8LpyWmAt", "postedAt": "2023-10-12T12:56:44.288Z", "postId": "YWofbSJvDrPjFGvvs", "htmlBody": "<p>First, election of Hamas and Hamas affiliated seats is very different than support for Hamas. These were local representative elections, not a national party election like Israel. So the 58% number seems misleading. And the reason there have not been elections since 2006 has much more to do with Hamas being unwilling to have elections than you seem to think</p><p>Second, I think there is a critical difference between support for a political group and support for violence. Most Gazans <a href=\"https://www.washingtoninstitute.org/policy-analysis/polls-show-majority-gazans-were-against-breaking-ceasefire-hamas-and-hezbollah\">did not want violence</a>, and a majority of Palestinians, when polled, would accept peace under various terms - they no longer support a two state solution with the current borders, though they did a decade ago, especially because such a deal still leaves Israel in control of the borders. However, there are a variety of scenarios which include concessions Israel is unwilling to offer, for political and/or security reasons, that would have a solid majority of Palestinians supporting a deal.</p>", "parentCommentId": "wcWhtJXDy5HKprBGB", "user": {"username": "Davidmanheim"}}, {"_id": "mJoh3p4uLMgwDmwJK", "postedAt": "2023-10-12T12:59:15.153Z", "postId": "YWofbSJvDrPjFGvvs", "htmlBody": "<p>See my reply to Yovel, but preferring violence to the status quo is very different than not wanting peace. And given that they keep getting bombed by Israel, it makes sense that they don't want to simply lay down arms - but per the last link, a majority supported continuing the ceasefire.</p>", "parentCommentId": "RZuGFLbodGeaHe4gX", "user": {"username": "Davidmanheim"}}, {"_id": "riayLZmTcaywdbfKv", "postedAt": "2023-10-12T16:59:42.604Z", "postId": "YWofbSJvDrPjFGvvs", "htmlBody": "<p>Thanks for your concern! As a private citizen I don't know of much you can personally do (I struggle to find such things myself).</p><p>I think the most pressing concern is to force Egypt to open a humanitarian corridor from the Gaza strip, so that refugees can run away from the battlezone, saving their lives and making the war easier for Israel. <a href=\"https://www.reuters.com/world/egypt-discussing-plans-provide-aid-gaza-under-limited-ceasefire-security-sources-2023-10-11/\">So far, they have refused</a>. Serious international pressure on them might help. I had a <a href=\"https://www.lesswrong.com/posts/zJCKn4TSXcCXzc6fi/i-m-a-former-israeli-officer-ama?commentId=PYYyGXoPfnf3pAmBG\">short discussion</a> about this in a parallel post in Less Wrong, and I think this is one of the highest life saving interventions right now.</p><p>In addition, in recent days there started efforts to deny the massacre of last Saturday. Since some of it was streamed on Tik Tok, Telegram and more, and some are deleted in effort to destroy evidence, high ranking managers in social media companies who could prevent that and preseve the evidence would be immense help.</p>", "parentCommentId": "dsXXEb8JfqveJpmts", "user": {"username": "Yovel Rom"}}, {"_id": "jwLfyovf6c9TkB52u", "postedAt": "2023-10-13T05:02:02.016Z", "postId": "YWofbSJvDrPjFGvvs", "htmlBody": "<p>Yeah -- there's an old marxist take that looks like \"religion is a fake proxy battle for eminent domain and 'separate but equal' style segregation\" that I always found compelling. I can't imagine it's 100% true, but Yovel implies that it's 100% false.&nbsp;</p>", "parentCommentId": "Gyev9yye3dvRFBmYf", "user": {"username": "quinn"}}, {"_id": "kRhh6DTAiCotDGyTR", "postedAt": "2023-10-18T09:56:52.476Z", "postId": "YWofbSJvDrPjFGvvs", "htmlBody": "<p>I like the idea but I also doubt a significant number of Palestinians from Gaza would accept that.<br><br>A <strong>more realistic option</strong> might be to try to make it easier for Palestinians to emigrate to any country that accepts them. Maybe Israel could offer everyone who successfully emigrates a $5-10k incentive / \"starting budget for a new life abroad\" and then maybe some other countries would be more interested in taking them if they have more money to spend. It might also help that most Gazans are young, speak Arabic and many also English, and could help fill labor shortages in other countries.&nbsp;<br><br>Which countries might be most open to accepting Palestinian migrants (as refugees, student migrants or work migrants)? Any effective pro-migration interventions there?</p>", "parentCommentId": "APygaS2uiWNvsEWgp", "user": {"username": "Manuel_Allgaier"}}, {"_id": "2v3SEXj9idBJoAcqi", "postedAt": "2023-10-18T17:01:43.450Z", "postId": "YWofbSJvDrPjFGvvs", "htmlBody": "<p>Another wild idea I've been dreaming about is financialization of immigration.</p>\n<p>Assume for the sake of argument that Gazans tend to fall into two groups: Hamas-supporting radical terrorists, and peaceful people who just want safety.</p>\n<p>If there was a magical method to identify which group an immigrant falls into, then countries could accept everyone from Group 2, and leave the Group 1 people in Gaza to fight for their epic historical/religious purpose.</p>\n<p>There is no magical method, but there are some heuristics.  Is the person a woman, child, or elderly?  Are they willing to post a video to social media condemning Hamas?  Are they willing to sign a statement recognizing Israel's right to exist and defend itself in some form?  Etc.  However, we can't predict with confidence which heuristics will work, and working heuristics are liable to degrade over time as terrorists figure out how to game them.</p>\n<p>Therefore, instead of trusting the government to tell the difference, imagine if any citizen could post an \"immigration bond\" for an immigrant Gazan -- analogous to a bail bond.  Perhaps the bond would be $100K or something like that.  If the immigrant Gazan commits a serious crime or terrorist attack, the person who posted the bond loses the entire amount.  If the immigrant Gazan becomes a productive member of society, perhaps the person who posted the bond would be entitled a fraction of the income tax revenue they generate for the government, if that tax revenue exceeds the amount of money the immigrant receives through government programs.</p>\n<p>I'm imagining this bond program working via two channels:</p>\n<ul>\n<li>\n<p>Personal relationships.  If my cousin is in Gaza and I believe she just wants peace, I post a bond so she can come to my country and live peacefully.  If she ever gets tempted to commit a terrorist attack, I remind her that I stand to lose $100K if she does so, and it wouldn't be right to betray a family member like that.</p>\n</li>\n<li>\n<p>Financial speculators.  Imagine a hedge fund doing a bunch of research and data analysis, conducting interviews, trying to figure out the best predictors of terrorism in order to invest in immigration bonds and receive income tax revenues.  Same with financial markets, over time the best speculators make more money and increase their influence on the market, as they're able to figure out how to separate Group 1 from Group 2 effectively.</p>\n</li>\n</ul>\n", "parentCommentId": "kRhh6DTAiCotDGyTR", "user": {"username": "chinscratch"}}, {"_id": "9PvmrD9bqobhfkXq9", "postedAt": "2023-10-19T05:17:37.072Z", "postId": "YWofbSJvDrPjFGvvs", "htmlBody": "<p>I totally disagree with this suggestion. Forcing the resettlement of Palestinians out of their homeland to Egypt with no regard for Egyptian sovereignty raises the question of how to prioritize the sovereignty of one country over the other. Second, it violates all ethical and international norms by taking indigenous inhabitants out of their homeland. Third, this is not a solution, this is basically moving a problem to another country that has nothing to do with its start, and here I want to support David Manheim’s perspectives on the current events (check his comments on your thread). And even from a utilitarian point of view (Although it’s not the most suitable argument for the current situation), resettlement outside the Israeli/Palestinian territories will only cause more causalities, &nbsp;because, by involving the host country (Egypt), you’re basically risking the lives of 100 million Egyptians to save less than 10 million Israelis, and it won’t save Palestinian either especially if the current apartheid Netanyahu government remained. Although resettlement is not the best solution in my opinion (and here again I assert to check &nbsp;David’s proposition), theoretically, if Palestinians have to move, the most realistic option would be the Negev desert, given it’s within the Israeli territory so they can assure and control its security status, and around 25% of its population are Arab Bedouin so Palestinians could be easily integrated there until Israel finishes up with Hamas in Gaza&nbsp;</p>", "parentCommentId": "riayLZmTcaywdbfKv", "user": {"username": "Zainab Asal"}}, {"_id": "wieLgTJJp9w5tcmEQ", "postedAt": "2023-10-19T05:48:09.042Z", "postId": "YWofbSJvDrPjFGvvs", "htmlBody": "<p>Given your experience with the IDF, and your current work in EA Isreal. What could be done through EA to help bridge the gap or shift the general perception from supporting the eradication of indigenous inhabitants to supporting the peaceful coexistence of Palestinians and Israelis? And I'm here ready to help by any means. The only thing I could do from my place was share posts for Israeli citizens who have more balanced views of the problem on Arabic social media pages and accounts. I wish I could do something else, so feel free to share your opinion and everyone in the forum is more than welcome to so do.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Zainab Asal"}}, {"_id": "Xut6gvcAokozbu3Th", "postedAt": "2023-10-21T03:23:05.520Z", "postId": "YWofbSJvDrPjFGvvs", "htmlBody": "<p>From my encounters with many civilians from both sides in Egypt. I didn't meet any of them who wanted this conflict to continue. They all want to live a peaceful life. And there is actually a space to establish cooperative dynamics between them. For example, many Palestinians find that the labor market in Israel is much better than in Palestine ( Better salary and compensation). On the other side, labor jobs in Israel are actually benefiting from hiring Palestinians to cover their needs for labor workers, from my experience in speaking with several Palestinians they are more in need within construction and agriculture. The big problem is making it easier for Palestinians to get work permits in Israel. If this process can be made simpler, it could help bring people closer together and meet the demand for workers in Israel.. I'll also link for you a source for you to check on your own time: &nbsp;https://www.ituc-csi.org/IMG/pdf/ituc_palestinereport_en.pdf&nbsp;</p><p>In response to Yovel Rom's comment, &nbsp;it's important to note that the Palestinian Authority faced backlash, &nbsp;two days ago, from its own citizens, who protested against perceived failures in addressing the Palestinian issue and the speculations of his potential collaboration with the current Israeli government in the current event, and the authority actually killed and arrested many of them. Therefore, the assertion that the authority is paying a handsome salary for every Israeli killed is far from the truth and such claims should be treated with more caution. For further verification, search for recent protests online and consider the attached source for more context.: &nbsp;https://www.reuters.com/world/middle-east/palestinians-clash-with-abbas-west-bank-forces-after-gaza-hospital-strike-2023-10-17/</p>", "parentCommentId": "MMoGCba3sxKShrFPC", "user": {"username": "Zainab Asal"}}, {"_id": "ocYCeAnJxMGc6DrXd", "postedAt": "2023-10-21T03:19:35.306Z", "postId": "YWofbSJvDrPjFGvvs", "htmlBody": null, "parentCommentId": "Z3jk9ZTGAMgzrPwYC", "user": null}]