[{"_id": "y6FhGvzjMkFoJrgda", "postedAt": "2023-03-01T19:03:23.333Z", "postId": "YYg5RPDa8zoshRS7n", "htmlBody": "<p>I practise gratefulness. What are 10 things I'm grateful for this morning?</p><p>I pray</p><p>I meditate</p><p>I play some race for the galaxy with my wife</p><p>But &nbsp;I don't really fit. I have the joys of working on the coal face of healthcare so I don't have so many of these issues. I have enormous respect (and sometimes even awe) of people like you who work hard towards distant and even low percentage goals.&nbsp;<br><br>Maximum respect</p><p>Please keep working on them, so our rural communities here in Uganda will have a world which still exists in 50 years when we finally develop :).</p>", "parentCommentId": null, "user": {"username": "NickLaing"}}, {"_id": "BbngGBKcjmm5kngje", "postedAt": "2023-03-01T19:31:07.589Z", "postId": "YYg5RPDa8zoshRS7n", "htmlBody": "<p>My level of hope is a function of the model that I have of how the relevant parts of the world work. Within the model I might assign a &lt; 1% chance to any kind of success, but I’m not very confident in my model at all. That doesn’t mean that the chance is higher than I think, &nbsp;but the variance is wider. That’s sort of hope-adjacent for me.</p>", "parentCommentId": null, "user": {"username": "Telofy"}}, {"_id": "pJ4gAxmdmf5roGfA9", "postedAt": "2023-03-01T20:31:06.137Z", "postId": "YYg5RPDa8zoshRS7n", "htmlBody": "<p>The core insight of Buddhism, that everything arises and passes away, is helpful here. Low hope is also something that arises and passes away if you let it. There's no need to cling to it. Just let it go and keep plugging away.</p><p>If there's anything useful to meditation, it is realizing at a deep level how everything arises and passes away, though I think you need to sit for an hour a day for some time before it really sinks in.</p>", "parentCommentId": null, "user": {"username": "Carlos Ramírez"}}, {"_id": "BH2cnyzzGAchFtjqP", "postedAt": "2023-03-01T20:36:28.610Z", "postId": "YYg5RPDa8zoshRS7n", "htmlBody": "<p>Race for the galaxy is an excellent game.</p>\n<p>Gratefulness can sound cheesy but it's one of the most scientifically-backed ways to make humans happy. I've found that a nice ritual to do with the people you live with is to go around the table and have each person say something they're grateful for before eating dinner together.</p>\n", "parentCommentId": "y6FhGvzjMkFoJrgda", "user": {"username": "Sam Battis"}}, {"_id": "fGqAgKmPTxP5mRfo2", "postedAt": "2023-03-02T03:55:44.741Z", "postId": "YYg5RPDa8zoshRS7n", "htmlBody": "<p>Akash - thanks for an interesting, unusual, and timely post. Many of us could benefit from some new tips, tricks, and mind-hacks to stay motivated even in the face of despair and apparently low likelihoods of success in certain cause areas (such as slowing down AI capabilities development until AI alignment catches up).</p><p>We might have to rediscover some of the more traditional heroic virtues, which often involved fighting against truly hopeless odds, and maintaining one's drive, integrity, grit, and determination even when there seems no rational reason to keep fighting.&nbsp;</p><p>The modern, watered-down, Hollywood version of heroism means 'getting knocked down in act 2, and then getting back up and triumphing in act 3'. Whereas the more primal, pagan, tragic version involves getting knocked down, and getting back up, and losing to an overwhelming foe, yet maintaining magnificent valor even &nbsp;in the face of death and failure. I'm thinking of those rare genuinely tragic movies such as '300' (2006), 'Valhalla Rising' (2009), &nbsp;and 'The Northman' (2022).</p><p>We EAs have to be prepared for the possibility that we might not reduce X risks enough to avoid extinction. But we should be prepared to go down fighting anyway -- even if it seems utterly irrational to keep fighting. It's a matter of maintaining an ironclad 'subjective costly commitment' to the cause, as analyzed by people like evolutionary psychiatrist Randolph Nesse (in <a href=\"https://www.amazon.com/Evolution-Capacity-Commitment-Russell-Foundation/dp/0871546221\">this book</a>) and evolutionary economist Robert Frank (in <a href=\"https://www.amazon.com/Passions-Within-Reason-Strategic-Emotions/dp/0393960226/\">this book</a>).&nbsp;</p><p>The reason for keeping this faith, even when it seems hopeless, is a matter of epistemic humility: the mind can talk itself into a state of despair through motivated reasoning based on pessimism, but a heroic, tragic commitment to keep fighting can buy some time until more information comes in, or a new strategy becomes apparent, or the cavalry arrives.</p>", "parentCommentId": null, "user": {"username": "geoffreymiller"}}, {"_id": "ykmcuYQzgKp3FBh9K", "postedAt": "2023-03-02T19:42:47.235Z", "postId": "YYg5RPDa8zoshRS7n", "htmlBody": "<p>Thank you Akash!<br><br>I appreciate the distinction between epistemic and emotional hope. You may appreciate the vaguely defined but seemingly interesting <a href=\"https://www.existentialhope.com/\">existential hope collection.</a><br>&nbsp;</p><p>I'd further add the following points:<br>1. Focus on the fundamentals (sleep, exercise, meditation, and socializing in particular).<br>2. Ask yourself, how can I make today a success? Sometimes focusing on the smaller things we have control of can make a big difference.<br>3. Consider getting a professional who can empower you to be at your best while working on very challenging things. This could be a coach - you can find an overview of coaches and therapists <a href=\"https://www.mentalhealthnavigator.co.uk/providers\">here</a>. This is a strong recommendation based on my own work as a coach (which may make me biased but I'm not listed on the site) and ~ 30+ people who I think very highly of speaking highly of coaching and similar services.</p>", "parentCommentId": null, "user": {"username": "SebastianSchmidt"}}, {"_id": "6iytkTMNt7KQdPmtX", "postedAt": "2023-03-03T00:17:48.857Z", "postId": "YYg5RPDa8zoshRS7n", "htmlBody": "<p>\"How do people actually find motivation without hope? This isn’t a rhetorical question. I hope you offer some ideas in the comments.\"</p>\n<ol>\n<li>\n<p>Let yourself get incredibly emotionally invested in what you're fighting for.</p>\n</li>\n<li>\n<p>Wait until your mounting failures explode into a full-blown existential crisis.</p>\n</li>\n<li>\n<p>Remember when you used to take epistemology seriously. (I imagine \"Remember that acid trip\" might also do the job.)</p>\n</li>\n<li>\n<p>Go full-on Daoist/Buddhist/nihilist, pick your flavour. Forget goodness, forget truth, notice beauty. Slow down. Chill out. Drift...</p>\n</li>\n<li>\n<p>Remember when you felt that something actually mattered. Think \"Eh. Come on, I've (like literally, tautologically) got nothing better to do.\"</p>\n</li>\n<li>\n<p>Nudge your life back in the direction of what you were fighting for. May take many nudges. That's fine.</p>\n</li>\n<li>\n<p>If ever you notice yourself getting worked up or a bit despair-y, juuuuust gently remind yourself that no one knows anything, everything's basically out of everyone's hands...but we may as well give it a jolly good go and laugh at the absurdity of it all on the way.</p>\n</li>\n</ol>\n<p>I'm afraid it's a little idiosyncratic (n=1) and it took a few years and I may not recommend if you're not already at 2. But that's my story.</p>\n", "parentCommentId": null, "user": {"username": "Holly"}}, {"_id": "RsqvLnAozuN7suN8Y", "postedAt": "2023-03-04T14:23:21.802Z", "postId": "YYg5RPDa8zoshRS7n", "htmlBody": "<p>You could substitute \"work\" where you write \"fight\". &nbsp;The latter evokes violence.&nbsp;</p>", "parentCommentId": null, "user": {"username": "TeddyW"}}, {"_id": "jsmqWYq4d6Zpk3mfc", "postedAt": "2023-03-09T22:06:15.637Z", "postId": "YYg5RPDa8zoshRS7n", "htmlBody": "<p>I found this post insightful! Although it's a brief post, I'd recommend providing a brief heading for each section for people who are heavy skimmers.</p>", "parentCommentId": null, "user": {"username": "nathan98000"}}]