[{"_id": "FADmRSo8cTNJd3h8X", "postedAt": "2023-11-13T09:23:27.896Z", "postId": "YYnjHt5YzuHSH7oRR", "htmlBody": "<p>Thanks for writing this! I agree making this decision very carefully seems well warranted.\nOne minor thing - you generously offer for people to contact you to ask about out-of-scope things (delivery research). I can well imagine someone finding this post in several years' time and wanting to contact you, but I'm not sure if this anonymous account will exist/be monitored then; one possible solution is to link to a google form that would go to your email (without revealing what your name/email is).</p>\n", "parentCommentId": null, "user": {"username": "Oscar Delaney"}}, {"_id": "vAyqkL8FW4wA3a9Kw", "postedAt": "2023-11-13T14:43:28.898Z", "postId": "YYnjHt5YzuHSH7oRR", "htmlBody": "<p>Thanks for the article.</p>\n<p>Did aspects of the child's wellbeing, expected life satisfaction, life expectation etc enter your considerations?</p>\n", "parentCommentId": null, "user": {"username": "Achim"}}, {"_id": "Wg3brnwdQii2o4LRb", "postedAt": "2023-11-13T14:57:10.273Z", "postId": "YYnjHt5YzuHSH7oRR", "htmlBody": "<p>Thanks for writing this—super helpful. Just one anecdote on the childcare front: my siblings and I had full-time nannies/au pairs from when we were babies until we could drive, because our parents worked full-time and often traveled. (My mom had an intensive screening process for said nannies/au pairs, and chose excellent ones.) I view this as having been a really good thing for my development—I became less shy, valued my time with my parents more, learned about other parts of the world/cultures/ways of life, was mentored by women in their 20s as a pre-teen/teenager, and developed close relationships with some amazing people. I think parents sometimes view hiring external childcare as a necessary evil, but for me (and, I think, my siblings) it was a really positive aspect of our childhoods.</p>\n", "parentCommentId": null, "user": {"username": "hobbes"}}, {"_id": "Qtf69uDNXrLgtCbyX", "postedAt": "2023-11-13T15:28:54.959Z", "postId": "YYnjHt5YzuHSH7oRR", "htmlBody": "<p>I love these kinds of writeups! Thank you for sharing your process and how you've found it so far!</p>", "parentCommentId": null, "user": {"username": "Julia_Wise"}}, {"_id": "wvjLWni3ij2tG4phD", "postedAt": "2023-11-13T15:44:43.118Z", "postId": "YYnjHt5YzuHSH7oRR", "htmlBody": "<blockquote>\n<p>full-time nannies/au pairs</p>\n</blockquote>\n<p>As in 40hr/wk, continuous, or something else?</p>\n", "parentCommentId": "Wg3brnwdQii2o4LRb", "user": {"username": "Jeff_Kaufman"}}, {"_id": "HThbQBGXPiMADaCWp", "postedAt": "2023-11-13T15:46:34.114Z", "postId": "YYnjHt5YzuHSH7oRR", "htmlBody": "<p>Thanks for writing this up!</p>\n<p>At the top it says it is a linkpost for <a href=\"https://www.lesswrong.com/posts/3MzDMBk4DZrbYePJS/kids-or-no-kids\">https://www.lesswrong.com/posts/3MzDMBk4DZrbYePJS/kids-or-no-kids</a> , which seems to be private?</p>\n", "parentCommentId": null, "user": {"username": "Jeff_Kaufman"}}, {"_id": "SH9ybsyqKzDqYCjkD", "postedAt": "2023-11-13T16:26:29.978Z", "postId": "YYnjHt5YzuHSH7oRR", "htmlBody": "<p>Thanks for sharing -- sounds like a fascinating childhood!</p>\n<p>I'm curious to hear about your mom's screening process if you're willing to share.</p>\n", "parentCommentId": "Wg3brnwdQii2o4LRb", "user": {"username": "chinscratch"}}, {"_id": "NWAnismtFZYDsi69b", "postedAt": "2023-11-13T16:41:50.632Z", "postId": "YYnjHt5YzuHSH7oRR", "htmlBody": "<p>Combination of full-time nannies (who probably worked 40 hrs/week and didn’t live with us) before we were school-aged and live-in au pairs when we were school-aged (who probably worked 6:30-9am and 4-8pm on weekdays, and maybe one full day/weekend).</p>\n", "parentCommentId": "wvjLWni3ij2tG4phD", "user": {"username": "hobbes"}}, {"_id": "RXLcjTgCnCcvqn5nd", "postedAt": "2023-11-13T17:14:32.586Z", "postId": "YYnjHt5YzuHSH7oRR", "htmlBody": "<p>It's probably really important to go to lots of events and meet and talk to a bunch of different people and get a wider variety of perspectives; there's only so much that a couple can do from inside one's own two heads.</p><p>Western culture is highly individualistic, especially when it comes to major life decisions. However, aligning oneself with empirical reality is typically best done by gathering information from lots of people.</p>", "parentCommentId": null, "user": {"username": "trevorw96"}}, {"_id": "pmtHPn8FmdhneyD4m", "postedAt": "2023-11-13T17:18:26.341Z", "postId": "YYnjHt5YzuHSH7oRR", "htmlBody": "<p>Henrik Karlsson's post <a href=\"https://www.lesswrong.com/posts/CYN7swrefEss4e3Qe/childhoods-of-exceptional-people\">Childhoods of Exceptional People</a> did research indicating that there are intensely positive effects from young children spending lots of time talking and interacting with smart, interested adults; so much so that we could even reconsider the paradigm of kids mostly spending time with other kids their age.</p>", "parentCommentId": "Wg3brnwdQii2o4LRb", "user": {"username": "trevorw96"}}, {"_id": "3Y3PmSMvSHuaLbXgo", "postedAt": "2023-11-13T17:34:49.745Z", "postId": "YYnjHt5YzuHSH7oRR", "htmlBody": "<p>Interesting! I'd like to see an analysis of things correlated with most/all <i>o</i>f the children in one family turning out well, because I'd be more inclined to emulate the parenting style of parents where (1) all of their kids became happy, reasonably successful, well-adjusted adults than ones where (2) one kid became a superstar.&nbsp;</p>", "parentCommentId": "pmtHPn8FmdhneyD4m", "user": {"username": "hobbes"}}, {"_id": "Kv9ycrK5Af2tr8Hjk", "postedAt": "2023-11-13T19:08:40.205Z", "postId": "YYnjHt5YzuHSH7oRR", "htmlBody": "<p><strong>Executive summary</strong>: The author and their partner thoroughly researched the costs and benefits of having a child over hundreds of hours. They decided to have a child after determining the impact on their careers and happiness would be manageable.</p><p><strong>Key points</strong>:</p><ol><li>They estimated the impact on work time and flexibility. With planning, they maintained 50-60 hour work weeks.</li><li>They budgeted costs like childcare. With a nanny, costs are ~$40k per year.</li><li>They researched risks to health, relationships and sleep. With planning, those risks were mitigated.</li><li>They weighed social factors like family connections. Those were a key benefit for them.</li><li>They considered community effects of their decision. Their stability made them well-suited.</li><li>The expected impact reduction was small enough to be worth the happiness gain.</li></ol><p>&nbsp;</p><p><i>This comment was auto-generated by the EA Forum Team. Feel free to point out issues with this summary by replying to the comment, and</i><a href=\"https://forum.effectivealtruism.org/contact\"><i>&nbsp;<u>contact us</u></i></a><i> if you have feedback.</i></p>", "parentCommentId": null, "user": {"username": "SummaryBot"}}, {"_id": "4mAoYwZp2igSJB9or", "postedAt": "2023-11-13T20:27:48.458Z", "postId": "YYnjHt5YzuHSH7oRR", "htmlBody": "<p>Thanks! This is a good point - I'll look into that.</p>", "parentCommentId": "FADmRSo8cTNJd3h8X", "user": {"username": "KidsOrNoKids"}}, {"_id": "Zg6JvP9GqpgTaxxi5", "postedAt": "2023-11-13T20:29:21.798Z", "postId": "YYnjHt5YzuHSH7oRR", "htmlBody": "<p>It's still under review by the Lesswrong team I believe - should hopefully go live shortly</p>", "parentCommentId": "HThbQBGXPiMADaCWp", "user": {"username": "KidsOrNoKids"}}, {"_id": "t7rNpv8bizwTjt4Ai", "postedAt": "2023-11-13T20:36:09.749Z", "postId": "YYnjHt5YzuHSH7oRR", "htmlBody": "<p>Thanks for the question! While from an emotional perspective, I care a ton about our kids' wellbeing, from a utilitarian standpoint this is a relatively minor consideration given I hope to positively impact many beings' lives through my career. Thus, we looked at the child's wellbeing on a very high level - guessing that our children have good chances at a net positive life because they will likely grow up with lots of resources and a good social environment. The one aspect we weren't confident enough to just eyeball was whether lots of nanny would be bad for them, hence we did some research on that (under \"Child health\").</p>", "parentCommentId": "vAyqkL8FW4wA3a9Kw", "user": {"username": "KidsOrNoKids"}}, {"_id": "h5pr8bwxrNf5h9ybx", "postedAt": "2023-11-13T21:20:08.048Z", "postId": "YYnjHt5YzuHSH7oRR", "htmlBody": "<p>If you go to “Account settings”—which is the second from bottom item when you hover over your user avatar in the top right—then go to “Notifications” then “Private messages,” you can make it so that you’ll receive an email when someone messages you on this forum, to whichever email you used to sign up. (This is in fact the default setting, I believe.) I think as long as you don’t deactivate your account, you can thus ensure that you’ll be notified if someone tries to contact you in the future, even if you’re not actively monitoring your account.</p>", "parentCommentId": "4mAoYwZp2igSJB9or", "user": {"username": "Will Aldred"}}, {"_id": "GvrDJngWnpJb8Aeuq", "postedAt": "2023-11-14T02:46:02.558Z", "postId": "YYnjHt5YzuHSH7oRR", "htmlBody": "<p>Does anyone know of a dedicated space where people in the EA / rationalist community can discuss parenting? For e.g. my daughter is 2YO and I'm wondering how much effort I should put into having her placed in a \"Good\" school. Discussions on this topic would be super valuable for me and I don't trust mainstream sources.</p>", "parentCommentId": null, "user": {"username": "yanni"}}, {"_id": "c4PbB7NyDAgsKXuhY", "postedAt": "2023-11-14T05:03:40.966Z", "postId": "YYnjHt5YzuHSH7oRR", "htmlBody": "<p>https://www.facebook.com/groups/eaparents/?mibextid=oMANbw</p>", "parentCommentId": "GvrDJngWnpJb8Aeuq", "user": {"username": "Ulrik Horn"}}, {"_id": "ppxxtEccacFoFXz2a", "postedAt": "2023-11-14T14:31:33.813Z", "postId": "YYnjHt5YzuHSH7oRR", "htmlBody": "<p>\"While from an emotional perspective, I care a ton about our kids' wellbeing, from a utilitarian standpoint this is a relatively minor consideration given I hope to positively impact many beings' lives through my career.\"</p>\n<p>I find this distinction a bit confusing. After all, every hour spent with your kid is probably \"relatively minor\" compared to the counterfactual impact of that hour on \"many beings' lives\". So it seems to me that your evaluating personal costs and expected experiences and so on at all only makes sense if the kid's wellbeing is very important to you, or do I misunderstand that?</p>\n<p>\"Thus, we looked at the child's wellbeing on a very high level - guessing that our children have good chances at a net positive life because they will likely grow up with lots of resources and a good social environment.\"</p>\n<p>Out of interest: Do you consider catastrophic risks to be small enough not to matter, and is there a point at which that would change?</p>\n", "parentCommentId": "t7rNpv8bizwTjt4Ai", "user": {"username": "Achim"}}, {"_id": "WdTyZEuyYfPLjChCn", "postedAt": "2023-11-14T23:45:36.738Z", "postId": "YYnjHt5YzuHSH7oRR", "htmlBody": "<p>thanks!</p>", "parentCommentId": "c4PbB7NyDAgsKXuhY", "user": {"username": "yanni"}}, {"_id": "dRj8wE9ir9iJRQNtP", "postedAt": "2023-11-15T08:50:46.843Z", "postId": "YYnjHt5YzuHSH7oRR", "htmlBody": "<blockquote>\n<p>We also don't plan to ask the kids for \"permission\" to move.</p>\n</blockquote>\n<p>A comment on this: as a child, my parents moved twice in the space of a few years (basically, I never did more than two years in a row in the same elementary school). I never really even thought I should have been consulted, but in hindsight, those two quick moves probably contributed significantly to my attachment issues, as they both broke some nice friendships I had found myself in and pretty much taught me a sort of unconscious \"don't get too attached to people\" lesson. Between that and the bad luck that the last school I ended up in was not quite as nice an environment for me as the first two, this probably had a big impact on me that I still feel the effects of. So, what I mean here is, it's easy to consider the needs of children secondary to those of the big, important, money-making adults, but when it comes to things like these, a few key moments during development can have big impacts downstream.</p>\n", "parentCommentId": null, "user": {"username": "Simone S."}}, {"_id": "Fg6XyFhGQXNo2WgfL", "postedAt": "2023-11-15T11:33:57.780Z", "postId": "YYnjHt5YzuHSH7oRR", "htmlBody": "<p>No worries! Just noticed you got downvoted for saying \"thanks\" - it must surely be someone who clicked the wrong button. I am upvoting to correct this error.</p>", "parentCommentId": "WdTyZEuyYfPLjChCn", "user": {"username": "Ulrik Horn"}}, {"_id": "XaCKuMxR7Bugai8uZ", "postedAt": "2023-11-15T13:42:26.813Z", "postId": "YYnjHt5YzuHSH7oRR", "htmlBody": "<p>I have emailed her and will update this comment when she gets back! I think there was an ~8-page questionnaire that evolved over time (since there were probably about 12 nannies/au pairs, and lessons were learned along the way) and a Skype interview, though.</p>", "parentCommentId": "SH9ybsyqKzDqYCjkD", "user": {"username": "hobbes"}}, {"_id": "mbmwPfZv5uZa2kiDA", "postedAt": "2023-11-15T22:58:57.980Z", "postId": "YYnjHt5YzuHSH7oRR", "htmlBody": "<p>Thanks for writing this!</p><p>Since your decision seems to come down to the expected positive effect on your happiness, I'm curious whether you considered even cheaper happiness-boosting interventions. For example, hundreds (thousands?) of hours of meditation might give you the \"love, belonging, connection\" and \"personal growth\" benefits with fewer downsides, though this might work less reliably than having kids.</p>", "parentCommentId": null, "user": {"username": "Javier Prieto"}}, {"_id": "BXMQkgTWw8a87sXRa", "postedAt": "2023-11-16T01:59:42.310Z", "postId": "YYnjHt5YzuHSH7oRR", "htmlBody": "<p>Thanks but I wouldn't worry too much about that kinda stuff.</p>", "parentCommentId": "Fg6XyFhGQXNo2WgfL", "user": {"username": "yanni"}}, {"_id": "DWnBnpmxEtwfjHbh2", "postedAt": "2023-11-16T12:29:39.110Z", "postId": "YYnjHt5YzuHSH7oRR", "htmlBody": "<p>I have considered for a time writing a comment here as your process felt quite foreign to me. I am sure it might work for some people, maybe even most EAs (judging by the upvotes), but I would also perhaps put up a warning flag for EAs considering whether to become parents or not: This might not be the right process for you and I think it is not at all necessary if you want to be an EA and a parent. I know you caveated the post this way, but I am commenting both to reinforce this caveat, to offer a bit more balance to this post and to offer an alternative strategy.<br><br>Therefore, I would like to outline an alternative and perhaps <strong>simpler approach: Ask yourself only if you want to bring another life into this world or not, leaving out all considerations of impact. If you land on \"yes\", then do it and do not worry about impact.</strong> Sure, it <i>could</i> have a \"negative\" effect on your impact, but I think it could easily also be net positive in sublime ways (like emotional safety, meaning in life, etc. that can affect your productivity in large ways).<br><br>I would also warn against trading off kids with impact. Another comment here touches upon it but I think there is value to always putting the kids first if you want to have kids. There are many times this will come up and having been a parent only for 6 years they could be situations such as the kids not feeling 100% and taking a day off instead of sending them to daycare, even though you during that day could save 0.1 lives in expectation.<br><br>I think the reality is that many of us will have careers that are at least 40 years long, and kids might only take up significant time 10-15 years of these. So you still have most of your career to work breakneck hours, taking financial risk, etc.<br><br>You also might not want your kids to come across this post (maybe a reason for the pseudonym!) - I tried for a few minutes reading this as if my parent wrote it and felt quite conflicted.<br><br>That said, I love a lot of the advice here, e.g. the red lights at night (we now read bedtime stories with headlights with red light - hard to stay awake for us parents too!), talking through splitting responsibilities in terms of hours (for gender equality in the relationship) and much more.</p>", "parentCommentId": null, "user": {"username": "Ulrik Horn"}}, {"_id": "QdGzhdDos83MTekbW", "postedAt": "2023-11-18T12:29:08.257Z", "postId": "YYnjHt5YzuHSH7oRR", "htmlBody": "<p>Thanks! Good question - indeed I did consider lots of meditation, writing a book, and various other things, and the decision was close. Having kids had the added bonus of \"exploring the breadth of human experience\" and that felt important. It also has a certain reliability as you mentioned.</p>", "parentCommentId": "mbmwPfZv5uZa2kiDA", "user": {"username": "KidsOrNoKids"}}, {"_id": "qMpXE7rkYWCex2gJA", "postedAt": "2023-11-18T12:33:48.137Z", "postId": "YYnjHt5YzuHSH7oRR", "htmlBody": "<p>Thanks for the added perspective!</p>", "parentCommentId": "DWnBnpmxEtwfjHbh2", "user": {"username": "KidsOrNoKids"}}]