[{"_id": "F3fmknChfEQ3dwMzJ", "postedAt": "2023-12-01T12:43:58.551Z", "postId": "YzCF2NDLSwKayZXb7", "htmlBody": "<p><strong>Executive summary</strong>: ALLFED made major strides towards increasing resilience to global food catastrophes through research, policy engagement, communications, and operations. They submitted 6 papers, advised 3 governments, gave 20+ presentations, and doubled their staff.</p><p><strong>Key points</strong>:</p><ol><li>ALLFED's research included papers on seaweed, crop relocation, agricultural residues, leaf protein, and nuclear winter's interaction with planetary boundaries.</li><li>Policy engagement involved advising the US, Australia, and Argentina on resilience planning against abrupt sunlight reduction.</li><li>Communications focused on GCR terminology, media features, creative workshops, and crisis preparedness.</li><li>20+ events reached broad audiences, including an in-depth simulation exercise at EAGx Australia.</li><li>Operations expanded across IT, finance, programs, and HR while incorporating resilience thinking.</li><li>The team grew to have 17 board members and representation across 9 countries while retaining close bonds.</li></ol><p>&nbsp;</p><p><i>This comment was auto-generated by the EA Forum Team. Feel free to point out issues with this summary by replying to the comment, and</i><a href=\"https://forum.effectivealtruism.org/contact\"><i>&nbsp;<u>contact us</u></i></a><i> if you have feedback.</i></p>", "parentCommentId": null, "user": {"username": "SummaryBot"}}, {"_id": "j7gwFWYKs3HNa8AKs", "postedAt": "2023-12-01T21:22:16.013Z", "postId": "YzCF2NDLSwKayZXb7", "htmlBody": "<p>This is a decent summary, but there are a couple corrections:</p><p>ALLFED increased paid team members, but much less than doubled (we have capacity to expand more quickly with additional funding).</p><p>We do have 17 advisory board members, but they represent 4 countries, not 9 (the 9 countries were represented by the 17 team members at the retreat).</p><p><br>&nbsp;</p>", "parentCommentId": "F3fmknChfEQ3dwMzJ", "user": {"username": "Denkenberger"}}, {"_id": "oMeBeCGd9JjAk2SL7", "postedAt": "2023-12-07T20:57:13.478Z", "postId": "YzCF2NDLSwKayZXb7", "htmlBody": "<p>Nice! Perhaps when you say Cambridge Centre for Existential Risk you mean the <a href=\"https://www.cser.ac.uk/ \">Centre for the Study of Existential Risk</a>? Could you link to their database you mention - I couldn't find it on a quick search.</p>", "parentCommentId": null, "user": {"username": "Oscar Delaney"}}, {"_id": "tcy5ofutspj5Lfkcp", "postedAt": "2023-12-08T01:48:50.110Z", "postId": "YzCF2NDLSwKayZXb7", "htmlBody": "<p>Thanks for the correction! I have fixed it and added a <a href=\"https://terra.cser.ac.uk/\">link </a>(the link was in the main document, but it's good to have it in the executive summary as well).</p>", "parentCommentId": "oMeBeCGd9JjAk2SL7", "user": {"username": "Denkenberger"}}, {"_id": "HEjtAuCgrDo48goiD", "postedAt": "2023-12-08T08:11:20.725Z", "postId": "YzCF2NDLSwKayZXb7", "htmlBody": "<p>THanks!</p>\n", "parentCommentId": "tcy5ofutspj5Lfkcp", "user": {"username": "Oscar Delaney"}}]