[{"_id": "KL2hDMp3ffCzsELje", "postedAt": "2022-10-20T19:29:31.504Z", "postId": "YZNswjspTd2MYAaDf", "htmlBody": "<p>I'm pretty excited by this direction of thinking. I filled out your form, let me know if I can help in various ways.</p>\n", "parentCommentId": null, "user": {"username": "lincolnq"}}, {"_id": "csH7BBkr6e9saxCur", "postedAt": "2022-10-20T19:30:43.078Z", "postId": "YZNswjspTd2MYAaDf", "htmlBody": "<p>Earthling Ed has a few restaurants, 👀</p>\n", "parentCommentId": null, "user": {"username": "Daryl D'Souza"}}, {"_id": "XwPcMXWchHwt2Eobo", "postedAt": "2022-10-20T20:08:42.097Z", "postId": "YZNswjspTd2MYAaDf", "htmlBody": "<p>Love this post, It's so engaging! &nbsp;I hope that you will get more attention and your idea become real. I'm wondering which types of businesses could most easily convert/insert tofu production. The meat industry could have some reservations about expanding production to include tofu, perhaps R&amp;D into cheaper methods of tofu production would be useful in this regard.</p>", "parentCommentId": null, "user": {"username": "Daniel_Polak"}}, {"_id": "vsdPQ8tEeaba8Tujv", "postedAt": "2022-10-20T22:09:36.020Z", "postId": "YZNswjspTd2MYAaDf", "htmlBody": "<p>Not sure I fit the criteria for co-founding, but would love to help in other ways when I can!! Lovely post and as you know I am all in favour of creating a generation of tofutarians!</p>\n", "parentCommentId": null, "user": {"username": "Vardev"}}, {"_id": "zyHZFP5CHm8fbaNtm", "postedAt": "2022-10-20T23:24:55.448Z", "postId": "YZNswjspTd2MYAaDf", "htmlBody": "<p>Fab post George!</p>\n<p>Some assorted, unrefined thoughts (it's 12am and I don't have a coherent view of the world atm)</p>\n<ol>\n<li>\n<p>Agree on restaurants being the best place to start promotion because you can generate both supply and demand while maintaining control. Have you done case studies of how people have approached restaurants, developed dishes, managed launch and press? E.g. with the restaurants serving cultivated meat in Singapore. There is almost certainly a handbook on how to get your product into restaurants. I know a bit about getting products into supermarkets.</p>\n</li>\n<li>\n<p>East Asians LOVE a food trend. These trends tend to stay within the community though, bubble tea/boba is an exception. But possibly with deliberate marketing there can be some positive impact of targeting Asians in the US?\n(I say this as someone of East Asian ethnicity)</p>\n</li>\n<li>\n<p>Disagree with this bit -- 'I don’t think cultural appropriation is as big an issue in food as other spaces of society. No one boycotts Thai food for using American chilies, or Mexican food for using European wheat flour tortillas, even though those ingredients originally came from a different culture.'</p>\n</li>\n</ol>\n<p>First of all nobody is boycotting these in the US context because they are global South / majority cultures using Western ingredients.</p>\n<p>Second of all, I don't think there is a moral difference between cultural appropriation of food vs. clothes, spiritual practice, language. I think the appropriation of food is less 'condemned' because it's harder for an individual to avoid it if they're eating at restaurants, following recipes written by Americans, etc. And people are less likely to see something as wrong if they are participants.</p>\n<ol start=\"4\">\n<li>The food pics look absolutely delicious and fascinating and I wish I still had some of your tofu in my freezer!</li>\n</ol>\n", "parentCommentId": null, "user": {"username": "clairey"}}, {"_id": "phEQpbZB96SKfxLyL", "postedAt": "2022-10-21T01:31:59.027Z", "postId": "YZNswjspTd2MYAaDf", "htmlBody": "<p>I wouldn’t be worried about Chinese Americans being too familiar with rare Chinese Tofu  varieties, simply cause China is a large culturally diverse place  and most Chinese-Americans are from The south eastern Cantonese speaking regions ,</p>\n<p>As an English speaking Vegan on the internet I’ve noticed and increased interest in “ tofus” made with other legumes, like peanuts or black beans, I think there is value in having substitutes available for a common allergen, and wonder If you could market “ black bean  tofu” at a Mexican restaurant as something new and trendy and that “fits the restaurant” even If it’s still standard firm tofu.</p>\n", "parentCommentId": null, "user": {"username": "Vgvt"}}, {"_id": "wJBZp3yZfhNEcAE4J", "postedAt": "2022-10-21T05:50:23.136Z", "postId": "YZNswjspTd2MYAaDf", "htmlBody": "<p>Off the top of my head, <a href=\"https://www.jennydorsey.co/\">Jenny Dorsey</a> is a Chinese-American chef who's written several cookbooks and other writings about cooking. I suggest you talk to her about promoting tofu in the states.</p>", "parentCommentId": null, "user": {"username": "evelynciara"}}, {"_id": "PqLvTiCCaDtrmForn", "postedAt": "2022-10-21T05:51:06.432Z", "postId": "YZNswjspTd2MYAaDf", "htmlBody": "<p>I agree with the third point. Cultural appropriation involves a power dynamic.</p>", "parentCommentId": "zyHZFP5CHm8fbaNtm", "user": {"username": "evelynciara"}}, {"_id": "2YHiA4nR9LbhAjFsz", "postedAt": "2022-10-21T11:54:31.851Z", "postId": "YZNswjspTd2MYAaDf", "htmlBody": "<p>I’m all for diversity of thought, but I really hope EA doesn’t become a vehicle for the ideas stemming from critical social science.</p>\n", "parentCommentId": "PqLvTiCCaDtrmForn", "user": {"username": "Duarte M"}}, {"_id": "6iesrASafGGqGiYyH", "postedAt": "2022-10-21T12:34:17.754Z", "postId": "YZNswjspTd2MYAaDf", "htmlBody": "<p>I am rooting for this so hard (for selfish as much as altruistic reasons). I passed it on to the only person I know who funds alt-protein stuff, though I imagine he would have seen it anyway. I am not sure what else I can do to help. If you ever need small scale help with a website (IE we need to update this info quickly, or add this small feature, but probably not we need to design a whole website), DM me and I will make it happen.</p><p>I do also really like the idea that this is going for more highbrow, rather than fast food, which is so crowded with alt-protein options these days (don't need another realistic burger or chicken nuggets, thanks).&nbsp;</p>", "parentCommentId": null, "user": {"username": "captainjc"}}, {"_id": "T8KrqTw2WHNG3vBcw", "postedAt": "2022-10-21T12:37:42.594Z", "postId": "YZNswjspTd2MYAaDf", "htmlBody": "<p>I agree, but I think it has to be a consideration when trying to market something widely these days. That said, my general impression is that it's less of an issue with food than in other areas.&nbsp;</p>", "parentCommentId": "2YHiA4nR9LbhAjFsz", "user": {"username": "captainjc"}}, {"_id": "DS6FPufCGBLtRYpgQ", "postedAt": "2022-10-21T13:40:11.572Z", "postId": "YZNswjspTd2MYAaDf", "htmlBody": "<p>Great post George!</p><p>I'd love to discuss with you how I can help.</p><p>Please have a look at my company, <a href=\"https://www.berapartners.com/\">BERA</a>, and my <a href=\"https://www.linkedin.com/in/benjaminhapp/\">background</a>, and feel free to drop me an <a href=\"mailto:ben@berapartners.com\">email </a>to find a time to connect -&nbsp;</p>", "parentCommentId": null, "user": {"username": "Benjamin Happ"}}, {"_id": "KEqp8HeLxB26mHtim", "postedAt": "2022-10-22T00:31:13.426Z", "postId": "YZNswjspTd2MYAaDf", "htmlBody": "<p>I love the phrase \"delicious impact\" 😋</p>\n<p>I wonder how much spillover effects would add here - meaning the influence on other American-inspired cultures if this takes off.</p>\n", "parentCommentId": null, "user": {"username": "Guy Raveh"}}, {"_id": "jRhG8BhKhWwhj2sv5", "postedAt": "2022-10-22T06:53:11.762Z", "postId": "YZNswjspTd2MYAaDf", "htmlBody": "<p>Thanks Desampo! The tofu production process is pretty specialized, so I don't think there's much equipment overlap with other food categories. Could be missing something though!</p>", "parentCommentId": "XwPcMXWchHwt2Eobo", "user": {"username": "George Stiffman"}}, {"_id": "6Auu3gAphQZiAPHus", "postedAt": "2022-10-22T06:55:20.535Z", "postId": "YZNswjspTd2MYAaDf", "htmlBody": "<p>Appreciate the signal boost on point 3!</p>", "parentCommentId": "zyHZFP5CHm8fbaNtm", "user": {"username": "George Stiffman"}}, {"_id": "eg4vgGbwLmCiueuGs", "postedAt": "2022-10-22T06:56:24.196Z", "postId": "YZNswjspTd2MYAaDf", "htmlBody": "<p>Going to see about connecting 👀&nbsp;</p>", "parentCommentId": "csH7BBkr6e9saxCur", "user": {"username": "George Stiffman"}}, {"_id": "pqF6JdcE6Ge3FSeG9", "postedAt": "2022-10-22T07:06:44.062Z", "postId": "YZNswjspTd2MYAaDf", "htmlBody": "<p>Interesting idea! Funny enough, black bean tofu is actually made with black soybeans, not black beans. The standard beans don't curdle the same way - too much starch content - so they can only form starch not protein gels. Would be cool to see more of them, though, and be able to better personalize towards different restaurants</p>", "parentCommentId": "phEQpbZB96SKfxLyL", "user": {"username": "George Stiffman"}}, {"_id": "iPxfSbhuzxZTt3Ezg", "postedAt": "2022-10-22T07:07:37.810Z", "postId": "YZNswjspTd2MYAaDf", "htmlBody": "<p>Oh amazing! Thanks so much for the suggestion - I'll definitely reach out to Jenny :)</p>", "parentCommentId": "wJBZp3yZfhNEcAE4J", "user": {"username": "George Stiffman"}}, {"_id": "NSNnD73xEWqEtck9d", "postedAt": "2022-10-22T10:12:21.364Z", "postId": "YZNswjspTd2MYAaDf", "htmlBody": "<p>This is amazing to see, George! As a local who needs to try very hard to find authentic juicy tofu in Yunnan, I can attest to how delicious it is and feel excited about the possibility of popularising it elsewhere!</p>", "parentCommentId": null, "user": {"username": "Yufeng Tao"}}, {"_id": "ZFgjsCxTAmKAFwkyJ", "postedAt": "2022-10-24T07:10:42.439Z", "postId": "YZNswjspTd2MYAaDf", "htmlBody": "<p>I must have a piece of fermented tofu with every meal as a probiotic. It works very well :)</p><p>I live close by Huainan, where tofu was invented as legends have it. Can I help with finding suppliers?</p>", "parentCommentId": null, "user": {"username": "yu"}}, {"_id": "dYnAe8XGe4hyt6xio", "postedAt": "2022-10-24T18:30:17.573Z", "postId": "YZNswjspTd2MYAaDf", "htmlBody": "<p>Too cool - I'd love to hear your favorite ways to eat it :)</p><p>And thank you for offering! Just sent you a message</p>", "parentCommentId": "ZFgjsCxTAmKAFwkyJ", "user": {"username": "George Stiffman"}}, {"_id": "oJmCszuAJDMQgjiA8", "postedAt": "2022-10-26T14:46:09.421Z", "postId": "YZNswjspTd2MYAaDf", "htmlBody": "<p>On how sushi became popular in the United States, I found New York Times' <a href=\"https://www.nytimes.com/interactive/2021/11/05/magazine/sushi-us.html\">The Untold Story of Sushi in America</a> to be a fascinating read.</p>", "parentCommentId": null, "user": {"username": "Seo Sanghyeon"}}, {"_id": "kf2PmcEiuudhmx23P", "postedAt": "2022-10-27T17:28:03.307Z", "postId": "YZNswjspTd2MYAaDf", "htmlBody": "<p>Yuba sandwiches are THE BEST!</p>", "parentCommentId": null, "user": {"username": "Matt Noble"}}, {"_id": "RxPRntyEbDHRriu7k", "postedAt": "2022-10-27T17:50:10.066Z", "postId": "YZNswjspTd2MYAaDf", "htmlBody": "<p>If you go the youtuber / influencer / blogger route at any point, definitely have a yuba sandwich showdown!</p>", "parentCommentId": "kf2PmcEiuudhmx23P", "user": {"username": "Matt Noble"}}, {"_id": "2xaYNoqmoNerqiupp", "postedAt": "2022-10-27T21:50:17.963Z", "postId": "YZNswjspTd2MYAaDf", "htmlBody": "<p>Sounds delish! How do you usually prepare your yuba sandwiches?</p>", "parentCommentId": "RxPRntyEbDHRriu7k", "user": {"username": "George Stiffman"}}, {"_id": "vchcKEYQGwDGbAmDC", "postedAt": "2022-10-28T11:33:29.399Z", "postId": "YZNswjspTd2MYAaDf", "htmlBody": "<blockquote><p>Out-of-house R&amp;D. Instead of hiring a chef, we could inspire food bloggers, restaurant chefs, or CPG brands to develop their own recipes. If we mailed ten $100 tofu boxes to ten different food bloggers, I'd guess that at least one or two would try out, like them, and create a video or two on their channel.&nbsp;</p></blockquote><p>I know one German youtuber that has a cooking channel. He makes most of his money via paid product placement. I would expect that the same is true for popular US food bloggers as well.</p><p>My model would be that those food bloggers generally don't promote products you send them for free just because they tried and liked them.&nbsp;</p><p>If you manage to be one of the only online shops that sell those new tofus I would expect that you could negotiate some affiliate deals with many of the popular vegan food influencers.&nbsp;</p><p>Maybe, you could also find a food influencer who already sells their own products and pitch them onto selling the tofus.&nbsp;</p>", "parentCommentId": null, "user": {"username": "ChristianKleineidam"}}, {"_id": "fmH6JXTFdndmwtRv3", "postedAt": "2022-10-28T11:42:34.924Z", "postId": "YZNswjspTd2MYAaDf", "htmlBody": "<blockquote><p>I don’t think people who are anti-soy are racist – but convincing a swath of Americans that being anti-soy is culturally insensitive could be one way to reduce stigma.</p></blockquote><p>Such a campaign might also significantly increase the stigma. It could turn soy into a culture war topic.&nbsp;</p><p>If you tell a bodybuilder that he should be less anti-soy because it's culturally insensitive, I would expect that to reinforce anti-soy attitudes for most bodybuilders.</p>", "parentCommentId": null, "user": {"username": "ChristianKleineidam"}}, {"_id": "6KFemyJJQwrqFwYXQ", "postedAt": "2022-10-28T16:32:13.294Z", "postId": "YZNswjspTd2MYAaDf", "htmlBody": "<p>What do you mean? I’ve not heard of critical social science before and just googled it. Are you saying that EA should ignore ‘social conditions that contribute to relations of domination and oppression’?</p>\n", "parentCommentId": "2YHiA4nR9LbhAjFsz", "user": {"username": "clairey"}}, {"_id": "CeMcZuxxGL7A46rhu", "postedAt": "2022-10-28T21:34:47.589Z", "postId": "YZNswjspTd2MYAaDf", "htmlBody": "<p>Turns out my last comment was wrong! Mary's Test Kitchen (https://www.instagram.com/marystestkitchen/) has found that by removing the starch from other legumes, you can make soy-like tofu out of them. Haven't tried yet but looks legit!</p>", "parentCommentId": "phEQpbZB96SKfxLyL", "user": {"username": "George Stiffman"}}, {"_id": "XgagDraswto36YsXS", "postedAt": "2022-10-28T21:37:01.772Z", "postId": "YZNswjspTd2MYAaDf", "htmlBody": "<p>Huh I guess I haven't chatted with (or know) enough influencers, but I'm familiar with some that do try products for free, and sometimes post about them. Maybe that's the exception though?</p>", "parentCommentId": "vchcKEYQGwDGbAmDC", "user": {"username": "George Stiffman"}}, {"_id": "4BeSjgfGKagXokqbh", "postedAt": "2022-10-28T21:41:14.758Z", "postId": "YZNswjspTd2MYAaDf", "htmlBody": "<p>Very cool! Thanks for the rec</p>", "parentCommentId": "oJmCszuAJDMQgjiA8", "user": {"username": "George Stiffman"}}, {"_id": "vgxBKiXpEReY7ks2u", "postedAt": "2022-10-29T14:18:15.104Z", "postId": "YZNswjspTd2MYAaDf", "htmlBody": "<p>Just because someone tried products for free and then posted about them doesn't mean that they haven't been paid to post about them.&nbsp;</p><p>When I say that I know the German youtuber, I'm meaning that I privately talked with him about how that industry works.&nbsp;</p><p>The people who make the most money in that industry do it through paid product placement.</p>", "parentCommentId": "XgagDraswto36YsXS", "user": {"username": "ChristianKleineidam"}}, {"_id": "ACmwPH6GaJ6aW9E7X", "postedAt": "2022-11-06T16:18:09.235Z", "postId": "YZNswjspTd2MYAaDf", "htmlBody": "<p>I'm super excited about this! Seems like there's a lot of potential. Just a few half-thought observations and data points below in case helpful.</p><p>A potential &nbsp;worry about the restaurant-first approach - anecdotally it seems like hip restaurants in places like NYC/Boston/Philly may already doing quite a bit with tofu in different varieties. The mechanism by which food goes from \"being used in chic restaurants\" to \"drastically changing the volume of tofu eaten\" probably needs some proving.</p><p>&nbsp;For example the first (non-random) restaurants I looked up has <a href=\"https://media-cdn.getbento.com/accounts/2f9a5949ac10f668443d4e18b37daba2/media/fZWcNIOlS6eadTh3Bp5w_BROOKLYN_EVENING_10.28.pdf\">Mustard Seed Crusted Tofu with spaghetti squash</a>. The second just has <a href=\"https://media-cdn.getbento.com/accounts/2f9a5949ac10f668443d4e18b37daba2/media/fZWcNIOlS6eadTh3Bp5w_BROOKLYN_EVENING_10.28.pdf\">glass noodles with roasted tofu</a>, which maybe supports your point that it's limited varieties of tofu being used.</p><p>It may be unrealistic to expect a modern American restaurant to devote more than a couple dishes to \"non-Chinese\" dishes. (maybe this is averted if the main channel is things like lasagnas and grilled \"cheeses\" like you're trying).</p><p>&nbsp;</p><p>Potential inspiration: Mtofu is a newish company in Kenya that is markets flavored tofus, eg chorizo substitutes: https://m.facebook.com/mtofukenya/</p>", "parentCommentId": null, "user": {"username": "Luke Eure"}}, {"_id": "kAGesAGCfNhqAaXwC", "postedAt": "2022-11-10T00:37:05.566Z", "postId": "YZNswjspTd2MYAaDf", "htmlBody": "<p>Yum, thanks for sharing that link! Cool to hear that there's exciting tofu happening in Kenya. And absolutely, I think you're right - making tofu hip doesn't necessarily mean it will spread. That said, it's hard to imagine the tofu market growing without it becoming a more desirable food, and that seems easiest via restaurants for now. A lot of work to still be done!</p>", "parentCommentId": "ACmwPH6GaJ6aW9E7X", "user": {"username": "George Stiffman"}}, {"_id": "rWS3Yz6HoTrZHCzLd", "postedAt": "2022-11-15T03:42:11.100Z", "postId": "YZNswjspTd2MYAaDf", "htmlBody": "<p><a href=\"https://m.youtube.com/watch\">https://m.youtube.com/watch</a>\nStumbled across a youtube video of a guy making a version of fermented tofu at home from firm tofu. He pickled it and after waiting for it to age, mixed it with olive oil, potato starch, and coconut oil to give it a soft stretchy cheese like texture.</p>\n", "parentCommentId": null, "user": {"username": "Vgvt"}}, {"_id": "iCJdmQWpfFh9rgScJ", "postedAt": "2022-12-31T02:44:20.248Z", "postId": "YZNswjspTd2MYAaDf", "htmlBody": "<p>Hi George! Sorry I'm just getting around to reading as I promised I would. I absolutely love this post as a tofu enthusiast myself, and I especially appreciate your note about cultural appropriation. &nbsp;I just filled out your form noting that I can be of help with navigating that.<br><br>I also recently came across the Pragmatic Visionary Award, a \"blank-slate grant for food-systems change-makers using business as a force for good.\" that you could be a promising candidate for! Check it out here: https://www.pragmaticvisionaryaward.org/</p>", "parentCommentId": null, "user": {"username": "elly"}}, {"_id": "jcgnLRnBSSdEuHo7e", "postedAt": "2023-01-23T18:50:18.546Z", "postId": "YZNswjspTd2MYAaDf", "htmlBody": "<p>Eli, I'm sorry I just saw your message! This program sounds really interesting. I missed the signup deadline but will shoot them a message. Thanks for the recommendation!</p>", "parentCommentId": "iCJdmQWpfFh9rgScJ", "user": {"username": "George Stiffman"}}]