[{"_id": "m8yHcwM3DokGtbGuj", "postedAt": "2023-01-12T00:57:41.576Z", "postId": "Z2tFtS3azcxT2yyxf", "htmlBody": "<p>Hi Dhruv, thanks for sharing! Thoughtful posts which go against the grain are always great to see here.</p><p>Structural note: Perhaps a <a href=\"https://forum.effectivealtruism.org/posts/4kKm88pXsnaZZ4Qqr/making-more-sequences-1\">sequence </a>would have been a better format for this series of posts?</p><p>Good points you made:</p><ul><li>LMICs could benefit from increased animal advocacy, especially given the likely lower scrutiny on their factory farming practices.</li><li>Focusing animal advocacy on the ethical argument rather than other considerations is important for ensuring the message's <a href=\"https://www.centreforeffectivealtruism.org/blog/the-fidelity-model-of-spreading-ideas\">fidelity</a> over time. For example, if veganism for health reasons or for \"leaving animals alone (including wild animals)\" became the dominant message, animal advocacy's longtermist implications could be completely different.</li><li>Ensuring that animal farmers are taken under consideration is underemphasized in animal advocacy. One additional benefit is that abolitionism is very left-coded, and farmers are quite <a href=\"https://www.agri-pulse.com/articles/6513-new-poll-sheds-light-on-how-farmers-ranchers-will-vote-for-president\">right-coded</a> (at least in the US). Considering farmers helps to reduce the movement's codedness.</li></ul><p>Some questions/comments:</p><ul><li>Brian Tomasik <a href=\"https://reducing-suffering.org/vegetarianism-and-wild-animals/\">thinks</a> it's \"pretty unclear whether promoting vegetarianism reduces or increases total animal suffering, both when considering short-run effects on wild animals on Earth and when considering long-run effects on society's values\". It seems plausible that if wild animals live net negative lives in expectation, then well-meaning memes of environmental conservation accompanying animal advocacy could cause more harm than good. If we seek a robust net positive effect, wouldn't it be easier to argue for evidence-based welfarist interventions like the <a href=\"https://reducing-suffering.org/why-i-support-the-humane-slaughter-association/\">Humane Slaughter Association</a> than for abolitionist advocacy?</li><li>Do you think there's a substantial long-term difference between immediate abolitionist advocacy and an incrementalist, welfarist approach which seeks to turn public opinion over the next few decades? Which do you think would more permanently and robustly expand society's moral circle? (By analogy, from the perspective of the temperance movement, it's arguable that the Prohibition would have endured for much longer if the Overton window had been shifted more in favor of temperance before Prohibition was enacted.)</li><li>You argue that cultured meat could turn meat into a luxury good rather than abolishing it altogether, which could perpetuate a culture where it's still considered \"okay\" to eat meat. It seems to me that if the price of cultured meat falls below parity, then people would be more likely to think: \"I <i>could</i> pay X to create a chicken, torture it for its short life, and cruelly slaughter it, <i>or</i> I could pay 0.9 * X to <i>not</i> do that and get the same benefit...maybe torturing chickens is <i>bad</i>.\" (Similarly, a slave-abolitionist could argue that promoting industrialization over slavery could be bad for slave welfare, because we could just industrialize without ever making the moral leap to \"slavery is bad\".) Your consideration has merit, but do you think it's more decisive than the points in favor of cultured meat?</li></ul>", "parentCommentId": null, "user": {"username": "Ariel Simnegar"}}, {"_id": "dDwSz6qyzAfzQNrdn", "postedAt": "2023-01-12T20:03:18.217Z", "postId": "Z2tFtS3azcxT2yyxf", "htmlBody": "<p>Hi Ariel! Thank you for the kind words. May I suggest moving this discussion to the overview piece given its cross-cutting content?</p>\n<p>And yes perhaps a sequence might have been better, but I'd already started, had some glitches trying to create a sequence, and got the impression (from other examples) that sequences are \"heavier\"/longer.</p>\n<p>Edit: I'll just answer here while I have the time. I especially appreciate you highlighting the points you thought were good, thank you.</p>\n<ol>\n<li>\n<p>Clearly I disagree with Tomasik with respect to the point about \"long-run effects on society's values\". What you said seems possible, rather than plausible, but that just suggests to me we should be careful about the message/argument (whenever I ask people why they care about \"the environment\", it's pretty easy to get most to see it's due to instrumental value to sentient beings). And yes, if ones values \"robust net-positive effects\" above abolition, then yes the implication you draw out seems correct, but I don't see a good reason to do that valuation in the first place.</p>\n</li>\n<li>\n<p>I thought I answered these questions in the first post (as yes and abolitionism)? And I don't understand what the relevant similarities with prohibition are to comment meaningfully.</p>\n</li>\n<li>\n<p>Not more decisive, but worth keeping in mind given the difficulty with cultured meat.</p>\n</li>\n</ol>\n", "parentCommentId": "m8yHcwM3DokGtbGuj", "user": {"username": "Dhruv Makwana"}}, {"_id": "CxE6s65MGbgn2By8H", "postedAt": "2023-01-13T16:46:41.430Z", "postId": "Z2tFtS3azcxT2yyxf", "htmlBody": "<p>Thank you for sharing so many thoughts. I encourage you to push further, and I'm intersted in talking or collaborating as well. I have been involved in different types of direct advocacy in the past and have been most active in recent years as a donor - primarily to groups I believe may move animal product alternatives forward and which are being overlooked by other donors.</p><p>One thing I've been curious about is whether doing explicit moral education is useful and in what mode. Animal Ethics is the group that comes to mind that seems to be doing the most of this, and most closely aligned with abolitionism. I mean, they seem to be delivering moral arguments at various levels - from academic to the street - and in different modes. My assumption is that helping to spread simply put, common sense arguments for animal rights will an important and necessary part of moving to abolition.</p>", "parentCommentId": null, "user": {"username": "jasonk"}}, {"_id": "Ks9ohEqv7vJ95N3FG", "postedAt": "2023-01-13T19:10:43.990Z", "postId": "Z2tFtS3azcxT2yyxf", "htmlBody": "<p>Thanks for the kind words, and I look forward to hearing about any opportunities for collaboration.</p>\n", "parentCommentId": "CxE6s65MGbgn2By8H", "user": {"username": "Dhruv Makwana"}}, {"_id": "nBWfBsnfyeWeQkfWK", "postedAt": "2023-01-17T01:04:44.940Z", "postId": "Z2tFtS3azcxT2yyxf", "htmlBody": "<p>Thanks for the great post! Just wanted to add Mercy for Animal's Transfarmation if you have not seen this yet. https://thetransfarmationproject.org/</p>", "parentCommentId": null, "user": {"username": "Josh Baldwin"}}]