[{"_id": "wvsHaf2DLT7DzyAsB", "postedAt": "2022-09-05T11:57:44.419Z", "postId": "Z6oqfKcax9yC2Cadk", "htmlBody": "<p>I'm guessing here, but I imagine that the source of the downvotes might be that this piece is a specific criticism of one organisation, framed as a more general commentary on hiring. I also suspect that the organisation is guessable (there's lots of quite specific detail, including quotes from job ads), though I haven't guessed.</p>\n<p>I suspect that either a general piece about pitfalls to avoid when hiring, or an open criticism of \"hirely\" (potentially having given them a chance to respond), would be better received.</p>\n<p>(I haven't up or down voted, as I haven't dug into the object level claims yet)</p>\n", "parentCommentId": null, "user": {"username": "alexrjl"}}, {"_id": "HM7RycoMosohegtQp", "postedAt": "2022-09-05T12:23:33.536Z", "postId": "Z6oqfKcax9yC2Cadk", "htmlBody": "<p>[Unfortunately didn't have time to read this whole post but thought it was worth chiming in with a narrow point.]</p>\n<p>I like Manager Tools and have recommended it but my impression is that some of their advice is better optimized for big, somewhat corporate organizations than for small startups and small nonprofits with an unusual amount of trust among staff. I'd usually recommend somebody pair MT with a source of advice targeted at startups (e.g. CEO Within though the topics only partially overlap) so you know when the advice differs and can pick between them.</p>\n", "parentCommentId": null, "user": {"username": "HowieL"}}, {"_id": "CoSZyM2MzGkizdbQQ", "postedAt": "2022-09-05T12:40:59.020Z", "postId": "Z6oqfKcax9yC2Cadk", "htmlBody": "<p>I agree with Alex.</p>\n<p>In this article I also saw lots of general assertions without a clear explanation as to why people should believe you. For example, you express disdain for scenario questions, but I'm an experienced hiring manager and I've often seen scenario questions (with follow up questions to understand the candidate's thought process and normal way of working) referenced as an example of good practice in an interview. I would need a clearer explanation from you than \"people could be nervous\" as to why you think these are not useful. (I also disliked the repeated use of the word \"stud\" given its sexual connotations!)</p>\n<p>I also didn't upvote or downvote.</p>\n", "parentCommentId": "wvsHaf2DLT7DzyAsB", "user": {"username": "Khorton"}}, {"_id": "hdtYKr4PwXqHitgjX", "postedAt": "2022-09-05T21:43:50.096Z", "postId": "Z6oqfKcax9yC2Cadk", "htmlBody": "<p>Thanks for attempting an explanation! I've now added a bit of clarification at the end of the introduction. Ie. I did write a closed criticism and gave them a chance to respond. They didn't want me to publish it as-is, so I ‘rewrote’ it to be more general. As is obvious now, I should have been less lazy and rewritten the whole thing rather than only searching and replacing the org name and rewriting the introduction.</p>\n<p>To reduce guessability further, I've now rewritten the quote as much as I could while preserving its flavour.</p>\n", "parentCommentId": "wvsHaf2DLT7DzyAsB", "user": {"username": "rmoehn"}}, {"_id": "srKK5GvhZpqrtY5df", "postedAt": "2022-09-05T22:07:33.356Z", "postId": "Z6oqfKcax9yC2Cadk", "htmlBody": "<p>Thank you, too, for explaining your reservations! And sorry about the word ‘stud’ – I didn't know the connotations. I've now replaced it with ‘ace’.</p>\n<p>I'll try to explain the general assertions and my disdain for scenario questions. This is not arguing against the points you made. It's just a clarification, which I should work into the article.</p>\n<ul>\n<li>\n<p>General assertions – I wasn't aware of this as a problem of my article. Thanks for pointing it out! – There are so many claims in the article that I don't have space and time to argue them all properly. That's why I have lots of Manager Tools links throughout, since they  have whole podcasts/whitepapers on each topic, where  they do argue things (mostly) properly.</p>\n</li>\n<li>\n<p>Scenario questions – a better way to structure the argument: Assume you need someone who can manage projects well and you have limited time. Which is going to give you more (and more reliable) information about a candidate's ability to manage projects? Asking about how they've managed past projects or about how they would manage project X? Which is more predictive? Now, an experienced person would probably justify scenario answers with examples from their experience. And someone inexperienced could only cite from the course they just visited. So I see how scenario questions can work. Behavioural questions are just a more direct way of getting at what I want to know. (This is still only a plausibility argument. Ultimately it comes down to data, which I haven't looked at. But I mostly trust MT to have looked at the data.)</p>\n</li>\n</ul>\n", "parentCommentId": "CoSZyM2MzGkizdbQQ", "user": {"username": "rmoehn"}}, {"_id": "TyxEvfmuzX3LmRvJA", "postedAt": "2022-09-05T22:20:25.043Z", "postId": "Z6oqfKcax9yC2Cadk", "htmlBody": "<p>Good point, thanks! Manager Tools usually explain their guidance in detail, which makes it adaptable to all kinds of organizations. And since MT itself is a small company with, I guess, an unusual amount of trust among staff, I don't think they would put out material that fails to apply to them.</p>\n<p>But I do agree that wider reading is necessary. Paul Graham's essays, for example, are a good counterpoint to MT's corporate emphasis, too.</p>\n", "parentCommentId": "HM7RycoMosohegtQp", "user": {"username": "rmoehn"}}, {"_id": "9PgLjgTScBevWpWNv", "postedAt": "2022-09-06T05:27:44.629Z", "postId": "Z6oqfKcax9yC2Cadk", "htmlBody": "<p>\"I don't think they would put out material that fails to apply to them.\"</p>\n<p>I think we mostly agree but I don't think that's necessarily true. My impression is that they mainly study what's useful to their clients and from what I can glean from their book, those clients are mostly big and corporate. I think they might fall outside of their main target audience.</p>\n<p>+1 to Paul grahams essays.</p>\n", "parentCommentId": "TyxEvfmuzX3LmRvJA", "user": {"username": "HowieL"}}, {"_id": "ziJD6JJdHKAsacigz", "postedAt": "2022-09-06T08:23:42.056Z", "postId": "Z6oqfKcax9yC2Cadk", "htmlBody": "<p>Makes sense. I'm a bit worried that people reading this will take away: ‘We're a small shop, therefore MT doesn't apply at all.’ This is not the case and I think Howie would agree.  I've never worked at a big organization and MT still has helped me a lot. I've also read and listened to a ton of non-MT material on leadership, doing work, business, processes etc. So I could well be putting MT guidance in its proper context without being aware of it.</p>\n", "parentCommentId": "9PgLjgTScBevWpWNv", "user": {"username": "rmoehn"}}, {"_id": "oDDSubJvSFeuwzYDS", "postedAt": "2022-09-06T09:51:42.456Z", "postId": "Z6oqfKcax9yC2Cadk", "htmlBody": "<p>Addendum – from <a href=\"https://www.manager-tools.com/2019/01/manager-tools-data-one-ones-part-1-hall-fame-guidance:\">https://www.manager-tools.com/2019/01/manager-tools-data-one-ones-part-1-hall-fame-guidance:</a></p>\n<blockquote>\n<p>Going back to company size, we've done 3 studies comparing the effect of WO3s in small, medium, and large organizations. We have never been able to find any significant difference in R&amp;R improvements based on organization size. We have measured statistically similar improvements in companies of less than 50, and companies greater than 100,000 employees.</p>\n</blockquote>\n<p>WO3s … weekly one-on-ones,\nR&amp;R … results and retention</p>\n<p>This is not directly relevant to the article above, but it's about one-on-ones, which are a core MT thing and which chapter 4 of the Effective Manager book is about.</p>\n<p>Another excerpt, talking about their data in general:</p>\n<blockquote>\n<p>We've measured and followed tens of thousands of managers in academia, and government, and non-profits. Hospitals, and charities, and religious organizations, and medical practices, and retail firms like grocery stores and mall-based clothing chains. We've measured over a quarter of a million managers in the Fortune 500 alone.</p>\n</blockquote>\n<p>They often say that their guidance is for 90 % of people 90 % of the time. And their goal is: ‘Every manager effective, every professional productive.’</p>\n<p>(Since I realize that I sound like a shill for MT, I'll say again that I'm not affiliated nor have any hidden agenda. It's just that my article refers to a lot of MT material and I'm trying to add evidence for their authority.)</p>\n", "parentCommentId": "9PgLjgTScBevWpWNv", "user": {"username": "rmoehn"}}, {"_id": "xQphzri3eomfay7Hu", "postedAt": "2022-09-06T17:41:59.416Z", "postId": "Z6oqfKcax9yC2Cadk", "htmlBody": "<p>I definitely agree that takeaway would be a mistake. I think my view is more like \"if the specifics of what MT says on a particular topic don't feel like they really fit your organisation, you should not feel bound to them. Especially if you're a small organisation with an unusual culture or if their advice seems to clash with conventional wisdom from other sources, especially in silicon valley.</p>\n<p>I'd endorse their book as useful for managers at any org. A lot of the basic takeaways (especially having consistent one on ones) seem pretty robust and it would be surprising if you shouldn't do them at all.</p>\n", "parentCommentId": "ziJD6JJdHKAsacigz", "user": {"username": "HowieL"}}, {"_id": "XbGwqFr4FZZtarPhA", "postedAt": "2022-09-06T21:57:13.586Z", "postId": "Z6oqfKcax9yC2Cadk", "htmlBody": "<p>I agree. Thanks for taking the time to hash this out with me!</p>\n", "parentCommentId": "xQphzri3eomfay7Hu", "user": {"username": "rmoehn"}}, {"_id": "7FHdi75xnY7796pH5", "postedAt": "2022-10-17T20:39:34.287Z", "postId": "Z6oqfKcax9yC2Cadk", "htmlBody": "<p>A note from the moderation team: this post was shared on September 5, but a user used a number of anonymous/throwaway accounts to downvote it,<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefevck26h0hll\"><sup><a href=\"#fnevck26h0hll\">[1]</a></sup></span>&nbsp;so we are reposting it.&nbsp;</p><p>Down-voting using multiple accounts is a serious breach of Forum norms (you can see&nbsp;<a href=\"https://forum.effectivealtruism.org/posts/yND9aGJgobm5dEXqF/guide-to-norms-on-the-forum#Rules_for_pseudonymous_and_multiple_accounts\"><u>the guide</u></a>).&nbsp;<strong>We are banning the user for 6 months.</strong></p><p>We will not be sharing the identity of this user, because our old&nbsp;<a href=\"https://forum.effectivealtruism.org/posts/yND9aGJgobm5dEXqF/guide-to-norms-on-the-forum\"><u>Guide to Norms</u></a> was not clear on which situations would lead to de-anonymization of any part of voting behavior. We take privacy and protecting anonymity seriously, and didn’t want to act in a way that would endanger users’ ability to trust us on this (by, for instance, interpreting our guide in a way that is less generous than would be possible, or applying new guidelines retroactively). We have updated the&nbsp;<a href=\"https://forum.effectivealtruism.org/posts/yND9aGJgobm5dEXqF/guide-to-norms-on-the-forum\"><u>Guide</u></a> to make it clear that, given serious breaches of Forum norms (e.g. if something leads to a ban), we may leave a public comment about the reason for the ban, even if that threatens the user’s anonymity. (We will try to maximally protect privacy and pseudonymity, as long as it does not seriously interfere with our ability to enforce important norms on the Forum.) Please&nbsp;<a href=\"https://forum.effectivealtruism.org/posts/yND9aGJgobm5dEXqF/guide-to-norms-on-the-forum#Contact_the_moderators_or_report_inappropriate_behavior\"><u>let us know</u></a> if you have any questions about this.&nbsp;</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnevck26h0hll\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefevck26h0hll\">^</a></strong></sup></span><div class=\"footnote-content\"><p>which led to the post's quick disappearance from the Frontpage</p></div></li></ol>", "parentCommentId": null, "user": {"username": "Lizka"}}, {"_id": "AhocbfskyX8J8KwWJ", "postedAt": "2022-10-17T22:09:06.219Z", "postId": "Z6oqfKcax9yC2Cadk", "htmlBody": "<p>Thank you for this! I'm hoping that this enables me to spend a lot less time on hiring in the future. I feel that this is a topic that could easily have taken me 3x the effort to understand if I hadn't gotten some very good resources from this post so I will definitely check out the book and again, awesome post!</p>", "parentCommentId": null, "user": {"username": "Jonas Hallgren"}}, {"_id": "ii8kbhfvgS7HN6kbv", "postedAt": "2022-10-17T22:48:40.637Z", "postId": "Z6oqfKcax9yC2Cadk", "htmlBody": "<blockquote><p>They ask applicants to take a Big Five assessment. Personality tests are not predictive of job performance (at least integrity and conscientiousness tests aren’t: <a href=\"https://web.archive.org/web/20160227075513/http://lab4.psico.unimib.it/nettuno/forum/free_download/articolo_114.pdf\">selval</a>). And they can be gamed.</p></blockquote><p>This is not how I read your link (pg 265 in Psychological Bulletin 1998, Vol. 124, No. 2, pg.4 in pdf). In the relevant metrics, it seems like incremental validity (above just using intelligence tests) for both conscientiousness and integrity tests is very high, on comparable levels (!) to work sample performance and structured interviews.</p>", "parentCommentId": null, "user": {"username": "Linch"}}, {"_id": "i7fNaKJHwQ53GcHhN", "postedAt": "2022-10-17T22:59:29.274Z", "postId": "Z6oqfKcax9yC2Cadk", "htmlBody": "<p>Thank you so much for your hard work guarding the forum against malicious behavior.</p>", "parentCommentId": "7FHdi75xnY7796pH5", "user": {"username": "Linch"}}, {"_id": "fjAoh49baju6o7GPu", "postedAt": "2022-10-17T23:48:05.394Z", "postId": "Z6oqfKcax9yC2Cadk", "htmlBody": "<p>Thanks for pointing that out. I had only looked at the validity of each method on its own and not at the validity gain numbers. Don't the results indicate, though, that you would have to <em>also</em> subject the candidate to a GMA test if you want to get validity from conscientiousness and integrity tests? And GMA tests are rarely performed in hiring processes.</p>\n<p>Pulling up an addendum from below (added 2022-10-19):</p>\n<blockquote>\n<p>I would explain the high incremental validity by the fact that a GMA test barely measures conscientiousness and integrity. In fact, footnote ‘c,d’ mentions that ‘the correlation between integrity and ability is zero’. But conscientiousness and integrity are important for job performance (depending on the job [and the hiring manager]). I would expect much lower incremental validity over structured interviews or work samples. Because these, when done well, tell a lot about conscientiousness and integrity by themselves.</p>\n</blockquote>\n", "parentCommentId": "ii8kbhfvgS7HN6kbv", "user": {"username": "rmoehn"}}, {"_id": "wwAemN6JnruJLtQL5", "postedAt": "2022-10-17T23:51:09.718Z", "postId": "Z6oqfKcax9yC2Cadk", "htmlBody": "<p>Thanks! I'm glad you liked it!</p>\n", "parentCommentId": "AhocbfskyX8J8KwWJ", "user": {"username": "rmoehn"}}, {"_id": "HzMACiHjHxrhGaveP", "postedAt": "2022-10-18T07:34:11.106Z", "postId": "Z6oqfKcax9yC2Cadk", "htmlBody": "<p>[Update: This comment of mine was wrong, but I still think the claim in the post is contradicted by the source cited; see below.]</p><p><strong>It looks like integrity and conscientiousness tests were also the 3rd and 4th highest rated things for the \"Validity\" column itself, out of a large list</strong>? And they appear to have ranked above interviews and some CV-like things (e.g., reference checks and job experience (years)), yet your post recommends interviews and CVs.&nbsp;</p><p>I'm pretty confused by this apparent misreading of the source. I think readers should treat that as a reason for being more skeptical of the rest of the post. My guess is it'd be worth you \"moving a bit slower\" (to check sources more carefully etc.) and stating things less confidently in future posts.&nbsp;</p>", "parentCommentId": "fjAoh49baju6o7GPu", "user": {"username": "MichaelA"}}, {"_id": "DkEER5fvDS8DCbdkf", "postedAt": "2022-10-18T07:48:18.874Z", "postId": "Z6oqfKcax9yC2Cadk", "htmlBody": "<p>There's a decent amount in this post that I agree with, but also sufficiently poor epistemics/<a href=\"https://www.openphilanthropy.org/research/reasoning-transparency/\">reasoning transparency</a>[1] (in my view) and enough advice that seems inaccurate[2] that <strong>I would recommend people either (a) don't read this post or (b) read it only with substantial skepticism and alongside other sources of advice</strong> (and <i>not </i>just Manager Tools, though maybe use that as well, just with skepticism). One place other advice can be found is in this quick collection I made: <a href=\"https://docs.google.com/document/d/1637kIL0U2vZHRiwX3Rmpm68X2u3KcEU8bnp6ouRHtPQ/edit\">Quick notes/links on hiring/vetting</a></p><p>I do think this post has some advice many people would benefit from, but the post also confidently asserts some things that I think are probably inaccurate or bad advice.[2] And (in my view) the post doesn't make it easy for people to discern the good from bad advice unless they already have good knowledge here (in which case they'll also gain little from the post), since the post provides very little sources or arguments and has the same confident tone for all its advice (rather than presenting some things as more tentative).&nbsp;</p><p>Overall, I think that this post is below the epistemic standards we should want for the Forum. (I'm aware this is somewhat rude/aggressive to write, and I promise I come across as friendlier in person! Also, in part [1] of this comment I provide some concrete recommendations / constructive advice that may be helpful for future posts. And to be clear, I do expect that the author was well-intentioned and trying to be helpful when writing this.)</p><hr><p>[1] Regarding poor epistemics / reasoning transparency in my view: It sounds like the author deliberately chose to release a short-ish and maybe quickly-ish written post rather than no post at all (\"I won't be arguing every point fully. [...] That's because doing otherwise would have made the article ten times longer\"). That's a reasonable choice. But in this case I think it turns out too much of this advice is probably bad for the resulting quick post to be useful to many people. I think the ideal version of this post would involve maybe a bit more word count and a bit longer time spent (but doesn't have to be much more) and would:</p><ul><li>Indicate differing levels of confidence in different claims</li><li>Probably be substantially less confident on average<ul><li>I'm not saying that all posts should be low-confidence. But I think that should probably be the case when:<ul><li>the author has limited experience<ul><li>I'm basing this on the author saying \"Hiring is a wide field and I've only tilled a small patch of it myself\". To be clear, I'm not saying people should only write posts about things they have lots of experience on, just that limited experience plus the following things should warrant lower confidence.</li></ul></li><li>The author didn't have time to properly find sources or explain the arguments<ul><li>This is relevant because in the process of doing so one often realises oneself that the claims rest on shakier ground than one thought.</li></ul></li><li>The main source seems to be a podcast/site (Manager Tools) which (I think) itself has poor epistemics<ul><li>I've engaged a fair bit with Manager Tools, and think it's useful overall, but in my experience they also usually provide no evidence or arguments for their claims except their personal experience, and I think many of their claims/advice are bad. So when I'm engaging with it I'm doing so with skepticism and sifting for a few takeaways that are in hindsight obviously true or that I can test out easily myself.&nbsp;</li></ul></li></ul></li></ul></li><li>Provide more of the reasoning/arguments for various claims, even if that just means saying more of what one already believes or thinks rather than thinking things through in more detail or finding more sources</li><li>Be based on more careful reading of sources, to avoid <a href=\"https://forum.effectivealtruism.org/posts/Z6oqfKcax9yC2Cadk/be-careful-with-outsourcing-hiring?commentId=ii8kbhfvgS7HN6kbv#comments\">drawing from one source a conclusion that seems exactly opposite to what the source finds</a><ul><li>(I haven't checked any of the other claims/sources properly, so this may not be the only such issue)</li></ul></li><li>Probably defer less to sources which don't themselves have strong evidence bases or reasoning transparency (Manager Tools)</li><li>Maybe find more high-quality sources (though it'd also be reasonable to not bother with that)</li></ul><hr><p>[2] Some things in this post that I think are inaccurate or bad advice (though unfortunately don't have time to explain my reasoning for most of these):</p><ul><li>The claim that personality tests aren't predictive of job performance<ul><li>My prior belief from reading some papers a while ago and from what I think would make sense (given how well I think Big Five personality tests can predict some other things) is that they <i>are </i>predictive. And <a href=\"https://forum.effectivealtruism.org/posts/Z6oqfKcax9yC2Cadk/be-careful-with-outsourcing-hiring?commentId=ii8kbhfvgS7HN6kbv\">the paper cited in this post for the claim that they're not predictive actually seems to be showing they are <s>one of the most predictive things</s></a><s>.</s> [Edited to add: Whoops, I misread the source myself. Though still the source seems to be saying they're weakly/moderately predictive, and have unusually high incremental validity when added to other specific assessments, rather than saying \"not predictive\".]</li></ul></li><li>Saying it's bad to outsource things you don't know because you can't assess performance well in those cases, without flagging that this might not apply anywhere near as much in cases where an outsourcee comes highly recommended by people you trust and whose situation is similar to yours, and when the outsourcee has credible signals of sharing a lot of your values&nbsp;<ul><li>(E.g., if they're a credibly EA-aligned hiring service/advisor who comes recommended from relevant other people based on performance there.)</li></ul></li><li>Suggesting filtering only via resumes rather than instead/also via screening questions that are basically a very short work test</li><li>Suggesting giving many interviews and relying heavily on them, and suggesting candidates answering the same questions from each interviewee<ul><li>I think that latter advice could only make sense if interviewees don't have a pre-set rubric and are just assessing answers subjectively, which seems unwise to me, or if the interviews are close to unstructured rather than structured, which also seems unwise to me. Also, relative to work tests, this takes up a lot of candidate and esp. hirer time.</li></ul></li><li>Making final decisions based on a meeting where people verbally share their assessments one at a time (which could then be anchored by whoever speaks first or groupthink or whatever), rather than collecting scores along the way and sticking to them by default (though with room to manoeuvre) to minimise noise (see also the book <i>Noise</i>)</li></ul><p>Those last three things basically seem consistent with the ways traditional hiring is bad and seems based on prizing subjective judgement and not really quantitatively assessing things or checking what research shows works best, in contrast to what's common in EA orgs + leading tech firms (as far as I'm aware). And that seems consistent with my experience of the kind of advice Manager Tools tends to give.</p><p>Also, these are just most of the things that stood out to me when casually listening to the post (in audio form), and that's enough to make me think that there may also be some other issues.&nbsp;</p>", "parentCommentId": null, "user": {"username": "MichaelA"}}, {"_id": "ZemvJ5oWE7zjDNwzJ", "postedAt": "2022-10-18T08:08:37.849Z", "postId": "Z6oqfKcax9yC2Cadk", "htmlBody": "<p>They are the third and fourth row in the table, but the rows aren't ordered by the validity column. When you order by the validity column, integrity tests are 8th and conscientiousness tests are 12th unless I've miscounted.</p>\n<p>I admit that I cherry-picked this article, basically only looked at the validity numbers in the table, and don't know anything else from that literature. This post has a wider view for those interested: <a href=\"https://forum.effectivealtruism.org/posts/j9JnmEZtgKcpPj8kz/hiring-how-to-do-it-better\">https://forum.effectivealtruism.org/posts/j9JnmEZtgKcpPj8kz/hiring-how-to-do-it-better</a> On the other hand, the validity table was excerpted on an 80,000 Hours page for years, which gives me some confidence by proxy. Also, the points of my post rely only lightly on this article.</p>\n<p>Added 2022-10-19: It would be nice if you removed the bolding on the text that you found to be wrong. Otherwise the impatient reader is apt to miss the bracketed text above.</p>\n", "parentCommentId": "HzMACiHjHxrhGaveP", "user": {"username": "rmoehn"}}, {"_id": "LvqyqFc8c8bAfgYLv", "postedAt": "2022-10-18T09:10:05.061Z", "postId": "Z6oqfKcax9yC2Cadk", "htmlBody": "<p>It would be nice if you moved your last paragraph first. Recommending (in bold) based on a casual listening not to read a post  feels unfair. (Speaking about fairness, there are other posts about hiring (eg. <a href=\"https://forum.effectivealtruism.org/posts/XpnJKvr5BKEKcgvdD/perhaps-the-highest-leverage-meta-skill-an-ea-guide-to#comments\">https://forum.effectivealtruism.org/posts/XpnJKvr5BKEKcgvdD/perhaps-the-highest-leverage-meta-skill-an-ea-guide-to#comments</a>) that are argued more thinly than my post and have gotten much less criticism.) I agree with your alternative recommendation to read the post with skepticism. That's the case with any post.</p>\n<p>I agree with some of your points. Especially the one about ways to outsource without knowing about the subject. I might work it into the article. (Two sentences added 2022-10-19.) (2022-10-22: I've worked it into the article.) Overall I think there are misunderstandings, which I should have worked harder to avoid.</p>\n<ul>\n<li>The main point is not hiring advice. (2022-10-20: Added clarifying comments to this end.) The main point is that people who hire need to learn more about hiring. I'm merely demonstrating this by countering Hirely, which I do based on hiring guidance that I'm fairly confident is better than theirs. How this came about I describe in the section about the article's history.</li>\n<li>I agree that it would be nice to have more epistemic nuance and diligence. But this article wouldn't exist had I tried for that, because I don't have more time. Given the choice between not publishing the article and publishing it with some epistemic hubris, I thought the latter is more beneficial.</li>\n<li>The main resource for this article is Manager Tools because I think their hiring guidance is an excellent starting point. This is based on wider reading and listening and thinking and experiencing, which I have been doing for years. I agree that their arguments are often sloppy and there are areas other than hiring in which they're weaker than they admit. Your claim that ‘they also usually provide no evidence or arguments for their claims except their personal experience’ is wrong as it stands. They provide evidence for some of their claims, which I've linked in my section on why Manager Tools is a decent authority. (Note that I wrote ‘a decent’, not ‘the ultimate’ – epistemic humility.) I wish they would provide evidence for other claims, too. And the bulk of each podcast/whitepaper is made up of arguments for their claims, spotty though they might be at times. Personal experience can be a valid support for arguments, too, if it's believable that you have a lot of it. It is believable that MT has a lot of personal experience (and data) about hiring, which I also point out in my section about them.</li>\n</ul>\n<p>By the way:</p>\n<ul>\n<li>I do think I'm fairly transparent and indicate levels of confidence to some degree, perhaps in a different way than you're used to. I don't have time to read and digest the full Reasoning Transparency article. But if I look at the top recommendations:\n<ul>\n<li>‘Open with a linked summary of key takeaways.’ – That's the title in my article.</li>\n<li>‘Throughout a document, indicate which considerations are most important to your key takeaways.’ – With some squinting that's the table of contents in my article.</li>\n<li>‘Throughout a document, indicate how confident you are in major claims, and what support you have for them.’ – I do indicate my support (Manager Tools) and why I think it's a support. I am quite confident in my main claim and in the main supporting claims. Note also that I don't write that outsourcing hiring is terrible, but that you need to be careful. And I don't write ‘Hirely will cause you to make a bad hire’, but that they put you at risk of making a bad hire. Among others.</li>\n</ul>\n</li>\n<li>I think I've refuted part of your claim about personality tests in <a href=\"https://forum.effectivealtruism.org/posts/Z6oqfKcax9yC2Cadk/be-careful-with-outsourcing-hiring?commentId=fjAoh49baju6o7GPu\">other comments</a>. Added 2022-10-22: Even if Big Five assessments can predict some things well, I would expect that to only be the case when they're not gamed. The one I know can easily be gamed. (Eg. just answer ‘very accurate’/‘very inaccurate’ to all the question that sound like pushing up/down the conscientiousness score.) And an important part of hiring is keeping out people that make themselves look better than they are.</li>\n<li>Expanded 2022-10-23: Some of the arguments against the ‘bad’ hiring advice had already been addressed in my article. Eg.: I point out that the résumé screen is a flawed filter and needs to be supplemented or replaced, depending on the situation. I briefly argue why it's okay to take a lot of time interviewing. There is also an easy fix for anchoring/groupthink in the interview results capture meeting (as well as other, more subtle, reasons to do it): Ask people to send you their recommendations and justifications before the meeting.</li>\n<li>Added 2022-10-19, edited 2022-10-23: In general, the items about ‘inaccurate or bad advice’ have common-sense arguments for and against them. (If anyone wants me to write any of them out, let me know.) It would come down to analysing Manager Tools' (unfortunately non-public) data as well as the research you're referring to. I would expect ‘traditional hiring’ when done right to work roughly equally well to whatever good EA orgs and leading tech firms do. My default expectation when people say that the ‘traditional way to do X is bad’ is that it actually works well when done right, but that it has a bad image because it got corrupted over time/is usually done mediocrely.</li>\n</ul>\n", "parentCommentId": "DkEER5fvDS8DCbdkf", "user": {"username": "rmoehn"}}, {"_id": "yKRanzBDJz6rYy7ps", "postedAt": "2022-10-18T15:26:01.134Z", "postId": "Z6oqfKcax9yC2Cadk", "htmlBody": "<p>Oh crap, my bad, should've looked closer! (And that's ironic given my comment, although at least I'd say the epistemic standards for comments can/should be lower than for posts.) Sorry about that.&nbsp;</p><p>Though still I think \"not predictive\" seems like a strong misrepresentation of that source. I think <a href=\"https://www.bmj.com/about-bmj/resources-readers/publications/statistics-square-one/11-correlation-and-regression#:~:text=If%20we%20wish%20to%20label,the%20results%20should%20be%20considered.\">correlations of .41 and .31 would typically be regarded as moderate/weak</a> and definitely not \"approximately zero\". (And then also the apparently high incremental validity is interesting, though not as immediately easy to figure out the implications of.)</p><p>I agree that \"the points of [your] post rely only lightly on this article\". But I still think this is a sufficiently strong &amp; (in my view, seemingly) obvious* misrepresentation of the source that it would make sense to see this issue as a reason for readers to be skeptical of any other parts of the post that they haven't closely checked.&nbsp;</p><p>(I also find it surprising that in your two replies in this thread you didn't note that the table indeed seems inconsistent with \"not predictive\".)</p><p>*I.e., it doesn't seem like it requires a very close/careful reading of the source to determine that it's saying something very different to \"not predictive\". (Though I may be wrong - I only jumped to the table, and I guess it's possible other parts of the paper are very misleadingly written.)</p>", "parentCommentId": "ZemvJ5oWE7zjDNwzJ", "user": {"username": "MichaelA"}}, {"_id": "xuxFCgAnNkZqCJSxr", "postedAt": "2022-10-18T15:45:41.823Z", "postId": "Z6oqfKcax9yC2Cadk", "htmlBody": "<p>Particularly when the most predictive things in that table were .51 and .54.</p>", "parentCommentId": "yKRanzBDJz6rYy7ps", "user": {"username": "Linch"}}, {"_id": "NptAr4MpHy2BsjTXC", "postedAt": "2022-10-18T23:09:00.969Z", "postId": "Z6oqfKcax9yC2Cadk", "htmlBody": "<p>Okay, you convince me. I've rewritten that item.</p>\n<p>The reason why I wasn't noting that the table is inconsistent with ‘not predictive’ is that I was unconsciously equating ‘not predictive’ with ‘not sufficiently predictive to be worth the candidate's time’. Only your insisting made me think about it more carefully. Given that unconscious semantics, it's not a strong misrepresentation of the source either. But of course it's sloppy and you were right to point it out.</p>\n<p>I hope this somewhat restores your expectation of my epistemic integrity. Also, I think there is not just evidence against, but also evidence for epistemic integrity in my article. That should factor into how ‘skeptical’ readers ought to be. Examples: The last paragraph of the introduction. The fact that I edit the article based on comments once I'm convinced that a comment is correct. The fact that I call out edits and don't just rewrite history. The fact that it's well-structured overall (not necessarily at the paragraph level), which makes it easy to respond to claims. The fact that I include and address possible objections to my points.</p>\n<p>Addendum: I would explain the high incremental validity by the fact that a GMA test barely measures conscientiousness and integrity. In fact, footnote ‘c,d’ mentions that ‘the correlation between integrity and ability is zero’. But conscientiousness and integrity are important for job performance (depending on the job). I would expect much lower incremental validity over structured interviews or work samples. Because these, when done well, tell a lot about conscientiousness and integrity by themselves.</p>\n", "parentCommentId": "yKRanzBDJz6rYy7ps", "user": {"username": "rmoehn"}}, {"_id": "tQJYP69vqfxMcMQWS", "postedAt": "2022-10-18T23:13:42.264Z", "postId": "Z6oqfKcax9yC2Cadk", "htmlBody": "<p>It turns out that the article was mass-downvoted by throwaway accounts. So there weren't many downvotes to find a reason for after all. Your comment helped me clarify some points, though.</p>\n", "parentCommentId": "wvsHaf2DLT7DzyAsB", "user": {"username": "rmoehn"}}, {"_id": "chitoW4yfYqDcLagB", "postedAt": "2022-10-18T23:15:50.075Z", "postId": "Z6oqfKcax9yC2Cadk", "htmlBody": "<p>It turns out that the article was mass-downvoted by throwaway accounts. So there weren't many downvotes to find a reason for after all. Thanks for your comment anyway. It allowed me to partially address some weaknesses of my article.</p>\n", "parentCommentId": "CoSZyM2MzGkizdbQQ", "user": {"username": "rmoehn"}}, {"_id": "SAGLppC6stT8u9LGu", "postedAt": "2022-10-18T23:49:56.313Z", "postId": "Z6oqfKcax9yC2Cadk", "htmlBody": "<p>This article is hard &nbsp;to read and the tone is strong, which makes it come off as ranty. This is bad because it seems like it has substantive content that you've thought out.</p><p>For example, the second paragraph has a few good ideas, but these have been chopped up. This makes it laborious to read:</p><blockquote><p>What do you want from a hiring process? A good hire. Crucially, no bad hire. And for those people whom you haven’t hired to be mostly happy with how things went. Because you care for them.</p></blockquote><p>The issues continues in the third paragraph. Even though the ideas are good, you're coming across as overbearing. This is distracting, which is especially bad since this paragraph gives the overview/purpose of the article and introduces the key org (Hirely) that you're talking about.&nbsp;</p><blockquote><p>Sadly, you’re at risk of making a bad hire and disgruntling your other applicants if you don’t know what you’re doing. If you don’t know what you’re doing, outsourcing isn’t a solution, either, because you don’t know how to judge the actions of those you’re outsourcing to. I will demonstrate this by example of a hiring process I’ve observed as an outsider, in which the hiring firm (call them Hirely) acted in a way that would have <i>seemed</i> sensible to the average founder who knows little about hiring, but to me looked like blundering. Even if you don’t plan to outsource hiring, the following points are worth thinking about.</p></blockquote><p>Other comments:</p><ul><li>After this, it seems like there's with multiple sections of meta (\"<strong>Added 2022-10-16</strong>\" and \"<strong>This is a repurposed article with a history</strong>\"). These suggest serious misconduct by someone hostile to you, but this is sort of buried.&nbsp;</li><li>Terms like \"Manager Tools\" and \"Hirely\" are really important to you, but this requires closer reading to figure out what they really mean and most people won't push past this.&nbsp;<ul><li>Your views/promotion of Manager Tools seems pretty disjoint about the other issues in this post.</li></ul></li><li>You've given each hyperlink it's own custom tag. This convention/process seems wildly different and seems to make a lot of extra amount of work for you?</li></ul><p><img src=\"https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/c5ca57529b5e2646034b2e6f19fa013be6ba94d8c234a3e7.png\" srcset=\"https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/c5ca57529b5e2646034b2e6f19fa013be6ba94d8c234a3e7.png/w_85 85w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/c5ca57529b5e2646034b2e6f19fa013be6ba94d8c234a3e7.png/w_165 165w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/c5ca57529b5e2646034b2e6f19fa013be6ba94d8c234a3e7.png/w_245 245w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/c5ca57529b5e2646034b2e6f19fa013be6ba94d8c234a3e7.png/w_325 325w, https://39669.cdn.cke-cs.com/cgyAlfpLFBBiEjoXacnz/images/c5ca57529b5e2646034b2e6f19fa013be6ba94d8c234a3e7.png/w_405 405w\">&nbsp;</p><p>A lot of your content is thoughtful and thinks from the perspective of the \"users\"/\"customers\".</p><p>It sounds like you have good perspectives, and small tweaks, like a summary up front, would add a lot.<br>&nbsp;</p>", "parentCommentId": null, "user": {"username": "Charles He"}}, {"_id": "tZWfmYhkTHcaRDCjv", "postedAt": "2022-10-18T23:54:03.648Z", "postId": "Z6oqfKcax9yC2Cadk", "htmlBody": "<p>The performance of the org you're describing is wildly bad by itself. What you wrote seems credible (besides the style things I mentioned).&nbsp;</p><p>You have also experienced serious misconduct/abuse by voting manipulation against you.</p><p><strong>Can you say whether the org you're criticizing is an \"EA org\", or \"EA funded\", or has people known to the community? Can you say if the people who abusively mass voted you are part of this org you criticized?</strong></p><p>EA isn't some big corporation, or friends who get funding for each other. It seems good to communicate this.</p>", "parentCommentId": null, "user": {"username": "Charles He"}}, {"_id": "xNiFvkuoPsg2kssFw", "postedAt": "2022-10-19T00:09:53.450Z", "postId": "Z6oqfKcax9yC2Cadk", "htmlBody": "<p>I appreciate your questions and can't comment on them right now, I'm afraid. Sorry. I hope to be able to answer in a few weeks' or months' time. Please have patience.</p>\n<p>(Thanks also for your other comment. I'll respond to that later today or tomorrow.)</p>\n", "parentCommentId": "tZWfmYhkTHcaRDCjv", "user": {"username": "rmoehn"}}, {"_id": "tdg4nkHnCRCsaMJff", "postedAt": "2022-10-20T09:21:35.091Z", "postId": "Z6oqfKcax9yC2Cadk", "htmlBody": "<p>Thanks for taking the time to write up balanced feedback! I was surprised.</p>\n<p>I'm starting to understand the message from your and other comments that the tone of the article is distracting from the content and even causing people to misunderstand it. When I write another article, I will take more time to work on the tone.</p>\n<p>I knew that the introduction is written in a choppy way, but I didn't expect that it would be hard to read. Thanks for telling me that. Good point also that I should introduce key terms more explicitly. You pointing this out made me see it as another source of confusion.</p>\n<p>One clarification about ‘promoting Manager Tools’: The reason is that I'm using arguments from authority a lot. From the authority of Manager Tools. In order for those arguments to be convincing, I need to establish that Manager Tools is reliable. That's why I write how their guidance leads to success etc. Now, arguments from authority tend to be weak (see also <a href=\"https://en.wikipedia.org/wiki/Argument_from_authority\">https://en.wikipedia.org/wiki/Argument_from_authority</a>). If I had the time, I would write out all the arguments properly, gather data etc. But I don't have the time, unfortunately. Also, it's not crucial for my main point, particularly my original main point. My original main point is that Hirely does bad work (they're hopefully doing better now – that's why I half-assedly repurposed the article) and one can be convinced of that without being convinced by each and every sub-point.</p>\n<p>The hyperlink thing is to comply with my own demand from an old LessWrong post: <a href=\"https://www.lesswrong.com/posts/ytStDZ7BaC23GvGPb/please-give-your-links-speaking-names\">https://www.lesswrong.com/posts/ytStDZ7BaC23GvGPb/please-give-your-links-speaking-names</a> It wasn't that much extra work because I wrote a little Clojure script to transform one Markdown file into another.</p>\n<p>As to the summary up-front: Recently I try to structure articles in a way that the title and the table of contents can be read as the summary. In this article this got lost a bit because of the repurposing.</p>\n", "parentCommentId": "SAGLppC6stT8u9LGu", "user": {"username": "rmoehn"}}, {"_id": "ufEpACFKanSGn3PyC", "postedAt": "2023-01-22T21:55:50.054Z", "postId": "Z6oqfKcax9yC2Cadk", "htmlBody": "<p>Finally I got some answers for you, although they don't address your questions directly. Earlier I didn't want to cast suspicion on a potentially innocent person and wanted to investigate further. But now I’ve found a way to respond without spending time investigating and in a way that gives the person a chance to clear the suspicion.</p>\n<p>In the top comment, Lizka writes that the user who did the mass voting is being banned for six months (ie. until around April 2023). I suspect that it is Neil Ferro (<a href=\"https://forum.effectivealtruism.org/users/neil-ferro-1\">https://forum.effectivealtruism.org/users/neil-ferro-1</a>) and I’ve emailed him that I posted this comment. If he replies to this comment, he is not banned and therefore most likely innocent. If he doesn’t reply to this comment, he is most likely banned for creating a bunch of accounts to downvote my post. Whatever the outcome, I have no plans to take further steps.</p>\n<p>As to the organization  behind ‘Hirely’: I want to point out again that they've probably improved. And it's not like other EA orgs do hiring perfectly either (see <a href=\"https://forum.effectivealtruism.org/posts/jmbP9rwXncfa32seH/after-one-year-of-applying-for-ea-jobs-it-is-really-really\">https://forum.effectivealtruism.org/posts/jmbP9rwXncfa32seH/after-one-year-of-applying-for-ea-jobs-it-is-really-really</a>, <a href=\"https://forum.effectivealtruism.org/posts/qJMjbHp9HKxT8XEhp/\">https://forum.effectivealtruism.org/posts/qJMjbHp9HKxT8XEhp/</a>, <a href=\"https://forum.effectivealtruism.org/posts/njJzBcaWJqtuFgqCh/the-job-interview-process-is-borderline-predatory\">https://forum.effectivealtruism.org/posts/njJzBcaWJqtuFgqCh/the-job-interview-process-is-borderline-predatory</a>). And I still won't mention their name, but I will list a few organizations they claim they have worked/are working with. This allows you (or the rare other person who comes across this) to ask those organizations (and ideally the applicants) about their experience with any former hiring consultants and find out how they're doing with regard to the points I've laid out about hiring well:</p>\n<ul>\n<li><a href=\"https://far.ai/\">https://far.ai/</a></li>\n<li><a href=\"https://futuremattersproject.org/\">https://futuremattersproject.org/</a></li>\n<li><a href=\"https://www.cfactual.com/\">https://www.cfactual.com/</a></li>\n<li><a href=\"https://ea-internships.pory.app/\">https://ea-internships.pory.app/</a></li>\n<li><a href=\"https://allfed.info/\">https://allfed.info/</a></li>\n<li><a href=\"https://existence.org/\">https://existence.org/</a></li>\n<li><a href=\"https://safe.ai/\">https://safe.ai/</a></li>\n<li><a href=\"https://gfi.org/\">https://gfi.org/</a></li>\n<li><a href=\"https://www.linkedin.com/in/peter-hrosso/\">https://www.linkedin.com/in/peter-hrosso/</a></li>\n<li>Jaan Tallinn</li>\n<li><a href=\"https://www.aisafetysupport.org/\">https://www.aisafetysupport.org/</a></li>\n</ul>\n", "parentCommentId": "tZWfmYhkTHcaRDCjv", "user": {"username": "rmoehn"}}, {"_id": "jxiGTbwqLZnnrYQhh", "postedAt": "2023-01-24T04:26:29.115Z", "postId": "Z6oqfKcax9yC2Cadk", "htmlBody": "<p>Mod here. Please don't try to munchkin our rules to find a way to deanonymize someone from a ban that was intended to be anonymous. (It's fine to give other evidence that you might have.) &nbsp;People may choose to reply or not to reply to things for a bunch of different reasons. We really don't endorse pressuring people to engage on a given Forum thread. (See also: <a href=\"https://forum.effectivealtruism.org/posts/KFMMRyk6sTFReaWjs/you-don-t-have-to-respond-to-every-comment\">You don't have to respond to every comment</a>.)</p>", "parentCommentId": "ufEpACFKanSGn3PyC", "user": {"username": "Ben_West"}}, {"_id": "MFwa5sGCYwRhKutFA", "postedAt": "2023-01-24T05:45:17.666Z", "postId": "Z6oqfKcax9yC2Cadk", "htmlBody": "<p>This is the wrong call as communicated.</p><p>The <strong>_moderator comment_</strong> develops a norm/enforces a novel rule in a way that lacks clarity and clashes with other established norms.</p><ul><li>It should be permitted to make strong allegations on the EA forum<ul><li>The class of allegations should include say, severe criminality and sexual assault (at least for funded EAs)</li><li>EA discourse was supposed to be a strong filter for truth/an environment for effectiveness to rise to the top</li></ul></li><li>You are reaching/editing into public discourse with little clarity/purpose<ul><li>If you want to forbid Mohn's demand, at least it should be explained better, ideally downstream of some broad, clear principle—not merely because they are taking advantage of a mechanic</li></ul></li><li>Forum banning and other mechanics/design should take into account the external knowledge induced by the mechanics/design<ul><li>This includes downstream information implied by moderator decisions like banning.</li><li>You are responsible for what the banning system or the forum mechanics imply and shouldn't rely on reaching into the world and editing public spaces for forum aims<ul><li>To some degree, \"public spaces\" includes the EA forum, because the EA forum is a monopoly and that carries obligations&nbsp;</li></ul></li></ul></li><li>Ideally, the harm/issue here should be self-limiting and ideally the forum should be allowed express itself<ul><li>E.g., if the accused XXXX doesn't care, ignores Mohn, and others view the demand to present themselves as silly or unreasonable, Mohn's demand has no power</li><li>We should prefer these norms and their decisions to accurately reflect the substance/seriousness/truth of the accusation (and not when a moderator expresses their dislike of how someone is using forum mechanics)</li></ul></li></ul><p>Suggestions:</p><ul><li>What you should do is make clear this is your rumination/thought or a future norm to be enforced<ul><li>E.g. Oliver Habryka's style in many of his comments, which does not use moderator authority explicitly</li><li>You have plenty of soft power in doing so</li></ul></li><li>If you think there is a stronger reason to forbid Mohn's accusation, and you should use moderator power, you should communicate the reason</li></ul><p>Also:&nbsp;</p><ul><li>I think if you think an innocent person is seriously wronged and the situation is serious, you can just exonerate them: \"<i>Note that XXX actually wasn't banned for this, I normally don't say this, but this is a one-time exception because &lt;reason YYYY&gt;</i>\"</li></ul><p><i><strong>(I support strong moderation, including using broad, even arbitrary seeming action, I'm critiquing the comment based on the arguments above, not because it's not in &nbsp;a rule book.)</strong></i></p>", "parentCommentId": "jxiGTbwqLZnnrYQhh", "user": {"username": "Un Wobbly Panda"}}, {"_id": "d36nh2au4qjDeu6c6", "postedAt": "2023-01-24T06:26:38.613Z", "postId": "Z6oqfKcax9yC2Cadk", "htmlBody": "<p>This whole affair has cost me way more time than anyone else, I suspect. I just wanted to have some closure. And it's not like I ‘pressured’ someone to engage on the front page. (Although for some reason, more people appear to be looking at this than I expected.)</p>\n<p>Thanks for not deleting my comment outright, though.</p>\n", "parentCommentId": "jxiGTbwqLZnnrYQhh", "user": {"username": "rmoehn"}}, {"_id": "vxpKzgAPcaq8neZ2A", "postedAt": "2023-01-24T06:27:40.191Z", "postId": "Z6oqfKcax9yC2Cadk", "htmlBody": "<p>Why would someone downvote this detailed comment without explanation?</p><figure class=\"image image_resized\" style=\"width:74.25%\"><img src=\"https://res.cloudinary.com/cea/image/upload/v1674541789/mirroredImages/vxpKzgAPcaq8neZ2A/y8zjbjkwpqlemr3bljme.png\" srcset=\"https://res.cloudinary.com/cea/image/upload/v1674541790/mirroredImages/vxpKzgAPcaq8neZ2A/rqnbw03qyxex3luurzih.png 100w, https://res.cloudinary.com/cea/image/upload/v1674541789/mirroredImages/vxpKzgAPcaq8neZ2A/dhutqx0cqyyhcij4q7db.png 200w, https://res.cloudinary.com/cea/image/upload/v1674541789/mirroredImages/vxpKzgAPcaq8neZ2A/v4acwl3h7mmrqbsqtplg.png 300w, https://res.cloudinary.com/cea/image/upload/v1674541789/mirroredImages/vxpKzgAPcaq8neZ2A/vuudgipq6jlnronissgk.png 400w, https://res.cloudinary.com/cea/image/upload/v1674541789/mirroredImages/vxpKzgAPcaq8neZ2A/ia78bccwkclxo1qyiesp.png 500w, https://res.cloudinary.com/cea/image/upload/v1674541789/mirroredImages/vxpKzgAPcaq8neZ2A/qpv6pxbilyxim64vijz8.png 600w, https://res.cloudinary.com/cea/image/upload/v1674541789/mirroredImages/vxpKzgAPcaq8neZ2A/qon7sdhfqayz1bbvfjtv.png 700w, https://res.cloudinary.com/cea/image/upload/v1674541789/mirroredImages/vxpKzgAPcaq8neZ2A/ci26dgavdvy9lxcki94n.png 800w, https://res.cloudinary.com/cea/image/upload/v1674541789/mirroredImages/vxpKzgAPcaq8neZ2A/u0zveltbozfdqtfd6cp4.png 900w, https://res.cloudinary.com/cea/image/upload/v1674541789/mirroredImages/vxpKzgAPcaq8neZ2A/z9nupjsucm2otuicksch.png 917w\"></figure>", "parentCommentId": "MFwa5sGCYwRhKutFA", "user": {"username": "Un Wobbly Panda"}}, {"_id": "9fsjq9QJaH5kKgTym", "postedAt": "2023-01-24T06:31:09.738Z", "postId": "Z6oqfKcax9yC2Cadk", "htmlBody": "<p>It happens often on this forum. 🤷‍♂️ (This is meant seriously, not as a reference to the mass-downvoting my article experienced.)</p>\n", "parentCommentId": "vxpKzgAPcaq8neZ2A", "user": {"username": "rmoehn"}}, {"_id": "ybLFQNbTbaXhbmTov", "postedAt": "2023-01-24T06:42:16.849Z", "postId": "Z6oqfKcax9yC2Cadk", "htmlBody": "<p>I'm mostly annoyed by the downvote because it makes the content invisible—I don't mind losing a lot of \"karma\" or being proven wrong or disagreed with.</p><p>As an aside, I thought you, Richard Mohn, were one of the most thoughtful, diligent people on the forum. I thought your post was great. Maybe it was clunky, but in a way I think I understand and emphasize with—the way a busy, technically competent person would produce a forum post. There was a lot of substance to it. You were also impressively magnanimous about the abusive action taken against you.</p><p>The vibe is sort of like a Michael Aird (who also commented), but with a different style.</p>", "parentCommentId": "9fsjq9QJaH5kKgTym", "user": {"username": "Un Wobbly Panda"}}, {"_id": "wQQ2NqAeZsu4m9Pxs", "postedAt": "2023-01-24T12:06:24.602Z", "postId": "Z6oqfKcax9yC2Cadk", "htmlBody": "<p>Thanks! I appreciate your comment. (Not so sure about the magnanimity. I spent a lot of time thinking about how to get my <a href=\"https://youtu.be/YgJvgESR920?t=141\">revenge</a>.) But <a href=\"https://www.lesswrong.com/users/harold-1\">Harold Godsoe</a> gave me some good advice.)</p>\n", "parentCommentId": "ybLFQNbTbaXhbmTov", "user": {"username": "rmoehn"}}, {"_id": "ELdXvsBE8rx3JWMEx", "postedAt": "2022-09-06T08:56:07.925Z", "postId": "Z6oqfKcax9yC2Cadk", "htmlBody": null, "parentCommentId": "HgmQynHZ82JdGTupe", "user": null}]