[{"_id": "BQTr7twEJHfPC4BjN", "postedAt": "2018-03-05T08:06:08.217Z", "postId": "Z95TxtkjHGPq4TAqY", "htmlBody": "<p>Thanks for articulating arguments for this. There is a strong bias in favour of growth of various kinds in EA. There is an elementary growth strategy of naively pursuing growth as fast as possible. I also know several community members who are opposed to growing the movement much at all, as opposed to doing so carefully. However, hardly any effective altruists opposed to different kinds of movement growth lay out their arguments against them. This frustrates me as I'm genuinely curious to separate the good and bad arguments against rapid movement  growth in EA, and that they're not publicly written out like this makes that difficult. </p>\n<p>Giving arguments for <em>how</em> to do movement growth to allow for nuanced discussion, rather than if we should do much movement growth <em>at all</em>, is very helpful.</p>\n", "parentCommentId": null, "user": {"username": "Evan_Gaensbauer"}}, {"_id": "gNeoTctaowzhoA5v9", "postedAt": "2018-03-05T12:08:49.627Z", "postId": "Z95TxtkjHGPq4TAqY", "htmlBody": "<p>Is it still alien and uncool if you look at an article as a whole and just rewrite it from scratch in French, rather than translating each line? (Kind-of like if I lose my copy of an essay and then rewrite the same ideas in new prose.)</p>\n", "parentCommentId": "oH6LDDxLF3cPK8BpC", "user": {"username": "RyanCarey"}}, {"_id": "XtcuDBffuLFp9Tsid", "postedAt": "2018-03-05T16:41:10.257Z", "postId": "Z95TxtkjHGPq4TAqY", "htmlBody": "<p>Regarding Doing Good Better, is there any follow-up in the pipeline that is more up-to-date? </p>\n<p>I find the book a great introduction into EA, but I have had multiple instances where I needed to point out to new members who'd just read the book that for some points &quot;that's not actually what's thought anymore&quot;.</p>\n", "parentCommentId": null, "user": {"username": "SiebeRozendal"}}, {"_id": "pxG9KLQLZZz8KWgt3", "postedAt": "2018-03-05T19:32:32.623Z", "postId": "Z95TxtkjHGPq4TAqY", "htmlBody": "<p>Good article Ben!</p>\n<p>1.</p>\n<p>I think similar risks arise with translating effective altruism to new domains or new audiances with particular expertise.</p>\n<p>I've felt this when interacting with people looking to apply effective altruism ideas in policy. Such exercises should be approached with caution: you cannot just tell policy makers to use evidence (they've already heard about evidence) or to put all their resources to whatever looks most effective (wouldn't work) etc. </p>\n<p>Similarly I suspect there is something to the fact that I find EA materials have had limited acceptance among experts in international development.</p>\n<p>2.</p>\n<p>I would go a step further and say that the aim should not solely be one of translating EA ideas but also of improving EA ideas. Currently EA is fairly un-diverse in terms of cultures, plurality of ethical views, academic background, etc. I think we can learn a lot from those we are trying to reach out to.</p>\n<p>-</p>\n<p>(Minor aside I think mass outreach efforts done well have been are still are valuable and this article underplays that)</p>\n", "parentCommentId": null, "user": {"username": "weeatquince"}}, {"_id": "f2zZfnsfpzzubLEbg", "postedAt": "2018-03-05T22:04:02.801Z", "postId": "Z95TxtkjHGPq4TAqY", "htmlBody": "<blockquote>\n<p>There is a strong bias in favour of growth of various kinds in EA. </p>\n</blockquote>\n<p>This seemed more the case a couple of years ago. I think the pendulum has swung pretty hard in the other direction among EA thought leaders.</p>\n", "parentCommentId": "BQTr7twEJHfPC4BjN", "user": {"username": "David_Moss"}}, {"_id": "GdBrsHvzrnbscHBny", "postedAt": "2018-03-05T22:53:04.069Z", "postId": "Z95TxtkjHGPq4TAqY", "htmlBody": "<p>Hopefully, but it may take a few years.</p>\n<p>In the meantime, this is good: <a href=\"https://www.effectivealtruism.org/resources/\">https://www.effectivealtruism.org/resources/</a></p>\n<p>And we're working on an advanced series of articles at 80k.</p>\n", "parentCommentId": "XtcuDBffuLFp9Tsid", "user": {"username": "Benjamin_Todd"}}, {"_id": "YM47DcFLuRYrhNmHi", "postedAt": "2018-03-06T00:31:41.542Z", "postId": "Z95TxtkjHGPq4TAqY", "htmlBody": "<p>Most of the arguments here seem to be more about not rushing into conducting mass (media) outreach in foreign cultures, rather than about not rushing to translate materials. </p>\n<p>Regarding the arguments which do concern translation:</p>\n<p>Argument #3 (existing English materials are out of date) concerns translation, but doesn't seem an argument against translation tout court, but only against translating Doing Good Better (if we suppose this is dangerously out-dated). From #3 we might instead conclude that we need to hurry to produce new English materials, since DGB is still influencing English-speakers, and then ensure these new materials are translated for foreign readers, lest they too be corrupted by the impression given by DGB. Alternatively we might think that we should generally hold off on any kind of popularisation, in order that we can wait to popularise a superior later version of EA (but then this is just another argument against mass outreach in general).</p>\n<p>Argument #2 (translation is very difficult) seems strong when applied to China but, as you acknowledge, less compelling when applied to closer languages/cultures like French/German. This is an important qualification, since it seems plausible that most (or almost all) active non-English-speaking EA groups fall a lot closer to France/Germany than they do to China, and EAs may reasonably disagree about whether on balance producing translations in the contexts.</p>\n<p>The end of your post proposes an alternative to mass media outreach, the alternative 'small group, close connections' model seems very compatible with using/needing translation work, of at least a few up to date texts. </p>\n<p>You do state in that section that you favour EA-inspired new texts being created in those new contexts, rather than translations, it seems like fidelity considerations may push in the opposite direction. If you are concerned with the fidelity of EA ideas (so much so that you think Doing Good Better, translated, might be too off-message), then it might be better to ensure that some translated EA materials are accessible to new groups rather than having people around the world try to create EA-inspired approaches. </p>\n", "parentCommentId": null, "user": {"username": "David_Moss"}}, {"_id": "eQy2X33biKKo9vJF6", "postedAt": "2018-03-06T15:08:10.570Z", "postId": "Z95TxtkjHGPq4TAqY", "htmlBody": "<p>Great points!</p>\n<p>I like the book Doing Good Better a lot: it is the single most important source that introduced me to EA and convinced me that it is a remarkable and very exciting idea and movement.</p>\n<p>Does having &quot;doing good better&quot; available at stores do more good than bad?\n-- In my estimation it does more good. It is one of the vehicles of spreading the word about EA.</p>\n<p>How much less viable vehicle of spreading word a translation of the book would be given that the translation is distributed in a similar cultural environment as the original book (eg. parts of Europe - Sweden, Norway, Finland, France etc) ? \n-- If additionally given that translation is done professionally by or commissioned by EA-minded locals, in my estimation he difference to the effect of the original language book would be small. Thus, this option is worth considering in my opinion.</p>\n<p>I think a translation of short career guide (a book) summarizing the key content in 80kh could be even more interesting to people. 80kh does a superb job of examining at careers from the perspective of having as much impact as possible. I am not aware of any other career guide that take this perspective rigorously.</p>\n", "parentCommentId": null, "user": {"username": "tuukkasarvi"}}, {"_id": "qgZmNc6NZo8hGZmh7", "postedAt": "2018-03-06T16:14:23.814Z", "postId": "Z95TxtkjHGPq4TAqY", "htmlBody": "<p>Side note - Have you looked at the Wikipedia pages for Effective Altruism in different languages and translated to [English]? </p>\n<p>Examples, <a href=\"https://sv.wikipedia.org/wiki/Effektiv_altruism\">sv.wikipedia.org/wiki/Effektiv_altruism</a> ~ marginal impact, opartic thinking, contraceptive thinking. Es.wikipedia.org ~ comparative wealth, etc.</p>\n<p>Just something someone here may find interesting.</p>\n", "parentCommentId": null, "user": {"username": "adamaero"}}, {"_id": "DDmXM2kzk5WrN3iHw", "postedAt": "2018-03-06T16:47:43.746Z", "postId": "Z95TxtkjHGPq4TAqY", "htmlBody": "<p>Yeah, I haven't been checking. What data gave you that impression?</p>\n", "parentCommentId": "f2zZfnsfpzzubLEbg", "user": {"username": "Evan_Gaensbauer"}}, {"_id": "E4nRKhx4iRoAmQCuW", "postedAt": "2018-03-06T16:56:55.133Z", "postId": "Z95TxtkjHGPq4TAqY", "htmlBody": "<p>I've tried to initiate translation projects for EA into non-English languages in the past. I was looking for EAs who were (close to) fluent in a language and local to where outreach would take place. This was a couple years ago. So, the local EA communities outside the English-speaking world were new, small and didn't have enough people to start up their own translation project. Given the arguments in Ben's post, I don't think necessarily much was lost in not having capitalized on the opportunity to translate EA content into other languages as well. </p>\n<p>The most successful case of translation of EA content, and moreover, the generation of brand new EA content, outside of English is in Germany. This was started by EAs who were native speakers of German, and the work of their EA Foundation (EAF). Depending on how much one thinks their circumstances could generalize, it might be best for the movement to work with local groups which successfully develop over a few years to generate new content in other languages. This content could be specialized in its messaging to the culture. </p>\n", "parentCommentId": "YM47DcFLuRYrhNmHi", "user": {"username": "Evan_Gaensbauer"}}, {"_id": "hsBNfpf8vLW737xif", "postedAt": "2018-03-06T17:19:59.736Z", "postId": "Z95TxtkjHGPq4TAqY", "htmlBody": "<p>It's my impression most policy efforts coming out of EA in most countries are from experienced, professional organizations which work with or hire policy experts. The Centre for Effective Altruism (CEA) has worked with university institutes at Cambridge and Oxford to produce policy reports of global catastrophic risks for European governments. The Effective Altruism Foundation (EAF) has in Germany and Switzerland done policy advocacy, initiated by philosophy post-docs and the like. Before involvement in EA, they weren't particularly experienced in philosophy, but their efforts haven't backfired in any sense. I haven't tracked what portion of their campaigns succeeded at the ballot box, but being able to start things like referendums on animal rights/welfare without opposition and backlash from the public could be considered successes in themselves. </p>\n<p>There isn't centralization across the EA community worldwide for work in the policy sector, so technically a group some country could start doing policy work in the name of EA without any kind of external assessment. So a culture of pursuing policy work much more cautiously can definitely still be worth promoting within EA. I notice the examples I gave were about causes like animal advocacy and global catastrophic risks, compared to your example of international development. My examples are of sectors which aren't already as common in academia and policy. So the EA community has been able to effectively break a lot of new ground in policy research and advocacy regarding these causes. Fields like international development and others with a history of more extensive institutional support are more complicated. They require more specialization and expertise to do effective work upon. </p>\n", "parentCommentId": "pxG9KLQLZZz8KWgt3", "user": {"username": "Evan_Gaensbauer"}}, {"_id": "CibK5Gi2QvNRXvjP9", "postedAt": "2018-03-06T17:23:36.795Z", "postId": "Z95TxtkjHGPq4TAqY", "htmlBody": "<p>The EA Handbook you put together included essays originally published as blog posts by individual EA community members in English. There's no reason there couldn't be an EA Handbook for original content generated in and for other languages. There's probably enough content in German to produce a &quot;German EA Handbook&quot;. I'm not confident there is enough original EA content in other languages such that a corresponding EA handbook could be produced.</p>\n", "parentCommentId": "gNeoTctaowzhoA5v9", "user": {"username": "Evan_Gaensbauer"}}, {"_id": "JYkYXkAM8Nbw7J5MW", "postedAt": "2018-03-06T17:29:48.744Z", "postId": "Z95TxtkjHGPq4TAqY", "htmlBody": "<p>If you don't give feedback, here's a tip for how I figure why I might have been downvoted when it's not at first clear to me why. I read my comment again, and imagine from a perspective of someone in EA very different from me. Other people's perceptions and intuitions of how our words come across on the internet can be very different from our own. I often notice things in my own comments after the fact as a result. The part of your comment which stood out to me with the typical tone on the EA Forum was referring to some earnest translation effort as &quot;alien and uncool&quot;. For various reasons, I can imagine someone seeing arguments from coolness are bad or inappropriate for the EA Forum, although I assume ostensibly you weren't that serious about the comment.</p>\n", "parentCommentId": "Ccud3iA67vCnWeymC", "user": {"username": "Evan_Gaensbauer"}}, {"_id": "EbcEJT3NRhctviQf3", "postedAt": "2018-03-07T18:03:21.720Z", "postId": "Z95TxtkjHGPq4TAqY", "htmlBody": "<p>Somewhat tangentially, am I unusual in finding the idea of 'thought leaders' for a movement about careful and conscientious consideration of ideas <em>profoundly</em> uncomfortable?</p>\n", "parentCommentId": "f2zZfnsfpzzubLEbg", "user": {"username": "Arepo"}}, {"_id": "qiK5hMXE4P4B72iMg", "postedAt": "2018-03-07T18:27:23.382Z", "postId": "Z95TxtkjHGPq4TAqY", "htmlBody": "<p>Definitely not. Often when I see the term used in EA it's being used negatively. To be fair though, the alternative terms I was considering using, &quot;EA insiders&quot;, &quot;EA elites&quot;, aren't too comfortable either.</p>\n", "parentCommentId": "EbcEJT3NRhctviQf3", "user": {"username": "David_Moss"}}, {"_id": "WFpvY3fACc25fDeh7", "postedAt": "2018-03-07T22:36:12.578Z", "postId": "Z95TxtkjHGPq4TAqY", "htmlBody": "<p>Hey David,</p>\n<p>I'm not able to fully respond, but a few quick comments which might help to clarify:</p>\n<p>I agree I'm combining mass media and translation somewhat. In principle, someone could propose spending translating lots of materials but not sharing them widely, but in practice people don't. Rather, the options are more like (i) translate existing materials into the new language and share widely, or (ii) speak to people in small groups.</p>\n<p>I'm arguing in favour of (ii) initially. But then like I say near the end of the post, you'd then start to work on translating materials on the side. The aim is that we'll end up with much better translations if we do lots of in-person outreach first, work on the translations iteratively, and first build up a base of people who really understand both EA and the local language and culture.</p>\n<p>(Whereas instead people often move directly to ideas like translating DGB and releasing, or creating an EA website in the local country with lots of content on it).</p>\n<p>I think &quot;lock in&quot; might also be pretty significant. DGB creates less problems in English since we've <em>already</em> been locked into those misconceptions about EA. But in countries where there are no existing materials, we want to avoid those mistakes and get a fresh start. </p>\n<p>(I also think we should prioritise having a new DGB or alternative intro resource in English, but it will take some time - this might be the best we have right now: <a href=\"https://www.effectivealtruism.org/resources/\">https://www.effectivealtruism.org/resources/</a>)</p>\n", "parentCommentId": "YM47DcFLuRYrhNmHi", "user": {"username": "Benjamin_Todd"}}, {"_id": "sFiWCcyyvzXFe7M2E", "postedAt": "2018-03-07T22:37:57.703Z", "postId": "Z95TxtkjHGPq4TAqY", "htmlBody": "<p>I agree it's a great book, and it has net positive value. My concern is that we might be able to get something even better.</p>\n<p>Also I don't think professional translators are in a good position to do this work, since they don't understand the nuance and aims of EA well enough to decide what the terms should be in the local language. We already find it really hard to pick the right terms in English. You'd need someone who really understands EA marketing and a professional translator working together.</p>\n", "parentCommentId": "eQy2X33biKKo9vJF6", "user": {"username": "Benjamin_Todd"}}, {"_id": "bdbTyyfXqBxHzbnTG", "postedAt": "2018-03-07T22:39:30.084Z", "postId": "Z95TxtkjHGPq4TAqY", "htmlBody": "<p>Some concerning data in this recent post about local groups:\n<a href=\"http://effective-altruism.com/ea/1l7/2017_lean_impact_assessment_evaluation_strategic/\">http://effective-altruism.com/ea/1l7/2017_lean_impact_assessment_evaluation_strategic/</a></p>\n<blockquote>\n<p>One other striking feature of this category is that all of the top groups [in terms of new event attendees] were from non-Anglo-American countries. While this is purely speculative, an explanation for this pattern might be that these groups are aggressively reaching out to people unfamiliar with EA in their areas, getting them to attend events, but largely not seeing success in transferring this into increased group membership. </p>\n</blockquote>\n", "parentCommentId": null, "user": {"username": "Benjamin_Todd"}}, {"_id": "NL9WmQTaD3c6MY3vh", "postedAt": "2018-03-07T22:40:45.170Z", "postId": "Z95TxtkjHGPq4TAqY", "htmlBody": "<p>Another consideration I'm not sure of is that a mainly English speaking community will be easier to coordinate than one of the same size split across many languages and cultures, so this might be reason to focus initially on one language (to the extent that efforts across different languages funge with each other).</p>\n", "parentCommentId": null, "user": {"username": "Benjamin_Todd"}}, {"_id": "ZvHFgQLu6tkXwvG9K", "postedAt": "2018-03-07T23:34:39.762Z", "postId": "Z95TxtkjHGPq4TAqY", "htmlBody": "<p>This seems no more (to me, less) of a concern than that having a diversity of languages and cultures would help avoid it becoming tribalised.</p>\n<p>Also, re the idea of coordination, cf my comment above about 'thought leaders'. I know it's something Will's been pushing for, but I'm concerned about the overconcentration of influence in eg EA funds (although that's a slightly different issue from an overemphasis on the ideas of certain people)</p>\n", "parentCommentId": "NL9WmQTaD3c6MY3vh", "user": {"username": "Arepo"}}, {"_id": "3xGjtPYvkocM3vSr5", "postedAt": "2018-03-08T00:10:13.309Z", "postId": "Z95TxtkjHGPq4TAqY", "htmlBody": "<p>Seconding Evan - it's great to have this laid out as a clear argument.</p>\n<p>Re this:</p>\n<blockquote>\n<p>In this way, any kind of broad based outreach is risky because it’s hard to reverse. Once your message is out there, it tends to stick around for years, so if you get the message wrong, you’ve harmed years of future efforts. We call this the risk of “lock in”.</p>\n</blockquote>\n<p>I think there are some ways that this could still pan out as net positive, in reverse order of importance:</p>\n<p>1) It relies on the arguments against E2G as a premium EA cause, which I'm still sceptical of given numerous very large funding gaps in EA causes and orgs. Admittedly In the case of China (and other semideveloped countries) the case against E2G seems stronger though, since the potential earnings are substantially lower, and the potential for direct work might be as strong or higher.</p>\n<p>2) Depending on how you discount over time, and (relatedly) how seriously you take the haste consideration, getting a bunch of people involved sooner might be worth slower takeup later.</p>\n<p>3) You mentioned somewhere in the discussion that you've rarely known anyone to be more amenable to EA because they'd encountered the ideas, but this seems like underestimating the nudge effects on which 99% of marketing are based. Almost no-one ever consciously thinks 'given that advert, I'm going to buy that product' - but when you see the product on the shelf, it just feels marginally more trustworthy because you already 'know' it. It seems like mass media EA outreach could function similarly. If so, lock-in might be a price worth paying.</p>\n<hr />\n<p>This isn't to say that I think your argument is wrong, just that I don't yet think it's clear-cut. </p>\n<p>It also seems like the risks/reward ratio might vary substantially from country to country, so it's perhaps worth thinking about at least each major economy separately?</p>\n<p>To the degree that the argument <em>does</em> vary from country to country, I wonder whether there's any mileage in running some experiments with outreach in less economically significant countries, esp when they have historically similar cultures? Eg perhaps for China, it would be worth trialling a comparatively short termist strategy in Taiwan.</p>\n", "parentCommentId": null, "user": {"username": "Arepo"}}, {"_id": "Kj7TpC5LwfYaAEYaX", "postedAt": "2018-03-08T18:34:33.097Z", "postId": "Z95TxtkjHGPq4TAqY", "htmlBody": "<p>Thanks for the reply Ben.</p>\n<blockquote>\n<p>In principle, someone could propose spending translating lots of materials but not sharing them widely, but in practice people don't. Rather, the options are more like (i) translate existing materials into the new language and share widely, or (ii) speak to people in small groups.</p>\n</blockquote>\n<p>We may be speaking to different people. I know a number of small group leaders who want materials in their native language to share with their (small) groups, rather than to broadcast a translation on a mass scale. </p>\n<p>I suspect that if the alternative is groups struggling through English-language materials or not using written EA materials in their groups at all (and just going it alone), then it's probably better that they have some basic translated materials (one can always advise them not to try to broadcast them widely). I agree groups can develop without mass media outreach, but I'm not sure how well they can develop (e.g. up to the 100 members you suggest in the OP) without EA materials in their language.</p>\n<p>-</p>\n<p>I think the question of 'lock-in' is trickier, though am not sure how far it applies to small groups rather than the mass media outreach. I agree that in the English speaking world memes like 'EA = effective charity' and 'EA careers = ETG' are prevalent and perhaps impossible to reverse en mass. But how 'locked in' are individual EAs and small EA groups who have, for example, read Doing Good Better? i.e. how intractable is changing their view from the Doing Good Better view to the updated view (and how far would it have been better to delay publication of Doing Good Better a few years until the ideas were more developed)? If we're dealing with translations for small groups, the situation looks more similar to small groups of EAs who have read Doing Good Better, than to mass-media broadcasting of EAish memes to the general populace. Since it's not clear how far small groups of English speaking EAs are locked in or that it would have been better to delay EA messaging in English speaking areas a few years, it's not clear to me that we should be trying to avoid/delay 'lock in' wherever else we can e.g. in the non-English speaking world. </p>\n<p>I think this is especially so if we think less in terms of the possibility of avoiding irreversible lock-in and more in terms of a trade-off between incrementally improving EA messaging and delaying EA messaging several years (assuming that we don't think that the next iteration of EA ideas will be final, but will themselves need to be updated a handful of years later).</p>\n", "parentCommentId": "WFpvY3fACc25fDeh7", "user": {"username": "David_Moss"}}, {"_id": "rkYdjHsYTEwWPBxma", "postedAt": "2018-03-08T19:33:42.115Z", "postId": "Z95TxtkjHGPq4TAqY", "htmlBody": "<p>Thanks for the citation!</p>\n<p>We agree this doesn't look good for (non-Anglo-American) groups running large events as outreach, in that it looks like it doesn't bear fruit in terms of increasing members or other outputs. But note the rest of the paragraph you quote, where we say:</p>\n<blockquote>\n<p>it seems plausible that EA groups outside of the traditional geographical areas may face distinct challenges and require more tailored support (such as translation of materials).</p>\n</blockquote>\n<p>One possible explanation for the observation above is that these groups' large events in non-Anglo-American countries don't bear so much fruit <em>because</em> they lack the supporting background and infrastructure (like translated materials). So, for example, if someone attends a large event in London they can easily immediately check out lots of EA websites and materials, find places to follow-up and so on; if someone attends a large event in a different country without these touch-points and critical mass, then not so much. Of course, it may also just be that these areas were less fertile ground for receiving EA message in some other way.</p>\n<p>It's also important to note that it's not clear from the data we provided above that non-Anglo-American groups distinctively receive low payoffs from large events. If you look at the <a href=\"https://lh6.googleusercontent.com/SV3XRHTFo5Jek-DBSOYzlhVuorvUxbmTfUeVKW9Gt9VUnpEQKjy_Vk1GpKafPYXgSdGaoEza37caPhMg7vL9NkxWmlKn5-bMb6yDeeVnz63vZx2imOO5oK4K7fJkMISV6nQvnxgp\">specific graph</a> you'll see that these groups are pretty clear outliers, reporting events with many more people who are unfamiliar with effective altruism, but it's not that Anglo-American groups are running large events with lots of people unfamiliar with EA <em>and</em> receiving comparatively larger payoffs: rather it's that most other groups are just not running such large events with so many people unfamiliar with effective altruism. So what is distinctive about these groups is that they are running large events with lots of unfamiliar attendees at all, not that they are running these large events <em>and failing to receive payoff</em>.</p>\n", "parentCommentId": "bdbTyyfXqBxHzbnTG", "user": {"username": "David_Moss"}}, {"_id": "3w2hjpwF7BdxBgfBh", "postedAt": "2018-03-09T15:24:45.698Z", "postId": "Z95TxtkjHGPq4TAqY", "htmlBody": "<p>My point was not trying to pick up policy interventions specifically. I think more broadly there is too often an attitude of arrogance among EAs who think that because they can do cause prioritisation better than their peers they can also solve difficult problems better than experts in those fields. (I know I have been guilty of this at points).</p>\n<p>-</p>\n<p>In policy, I agree with you that EA policy projects fall across a large spectrum from highly professional to poorly thought-out.</p>\n<p>That said I think that even at the better end of the spectrum there is a lack of professional lobbyists being employed by EA organisations and more of a do-it-ourselves attitude. EA orgs often prefer to hire enthusiastic EAs rather than expensive experts (which maybe a totally legitimate approach, I have no strong view on the matter).</p>\n", "parentCommentId": "hsBNfpf8vLW737xif", "user": {"username": "weeatquince"}}, {"_id": "RFPRqrXDQiDKfNoNA", "postedAt": "2018-03-10T00:01:44.771Z", "postId": "Z95TxtkjHGPq4TAqY", "htmlBody": "<p>What fields come to mind specifically as ones EAs arrogantly think they can solve problems better than experts can? EA is diverse, so we could be talking about a lot of different things. Re: policy, I think a large part of it is EA is still too small a movement to afford expensive experts or otherwise have a high degree of influence. I consider policy efforts in EA successes as a young movement it's been able to get tabled initiatives in a few countries. These don't often result in much happening, so these are relatively modest outcomes. Certainly there is greater opportunity in the future for EA to influence policy, hopefully by working more with experts in the future. </p>\n", "parentCommentId": "3w2hjpwF7BdxBgfBh", "user": {"username": "Evan_Gaensbauer"}}, {"_id": "Gu353LndnuYzk2D9Y", "postedAt": "2018-03-10T15:51:02.346Z", "postId": "Z95TxtkjHGPq4TAqY", "htmlBody": "<p>Based on EAF's experience in Germany and Switzerland, I strongly agree with Ben's main points in the post. In the early days we made several mistakes that could have been prevented fairly easily. In particular, it seems hard to correct the perception that EA is not just about donating (to GiveWell top charities). It also remains very difficult to counter the impression that EA is mainly the practical implementation of Singer's views; e.g. Singer's views on infanticide get quoted in many media articles about EA.</p>\n<p>Some of the challenges that might have led to this:</p>\n<ul>\n<li>DGB and Singer's EA book were translated to German, but much of the more advanced content is only available in English.</li>\n<li>Quickly translating English content is easy. However, it takes much more time to ensure high quality both in terms of language and framings/nuance, and it's even more challenging to keep these translations up to date. See the &quot;fidelity model&quot; blog post referenced above for more discussion of this.</li>\n<li>The media frequently interview members of the community. Community members are more or less up to date with recent EA publications and would explain EA well, but the media very proactively ask about charitable donations and related issues. It takes a lot of active effort and experience with media interviews to counter this pigeonholing, which is hard to do without much practice. I personally find it pretty hard to give good guidance on this.</li>\n</ul>\n<p>So as a conclusion, I think the expansion to Germany, Switzerland, and Austria could have gone much better still, and while I agree it could be the deemed most successful case of translation of EA content, I think it was worse than what we should be aiming for.</p>\n", "parentCommentId": "E4nRKhx4iRoAmQCuW", "user": {"username": "Jonas Vollmer"}}, {"_id": "RP9iHyM3hsWTpxEK7", "postedAt": "2018-03-10T18:28:07.078Z", "postId": "Z95TxtkjHGPq4TAqY", "htmlBody": "<p>I found this article useful and convincing. Thanks for writing, Ben!</p>\n<p>However, I was surprised to see that this has become one of the most upvoted posts of all time on the EA forum. I would expect an insightful and convincing post like this to get between 20 and 30 upvotes. I'm worried that I'm missing a more important takeaway. Can someone explain why this has been so positively received?</p>\n", "parentCommentId": null, "user": {"username": "avacyn"}}, {"_id": "k3PSSwau6S5sMmMLf", "postedAt": "2018-03-10T18:42:03.005Z", "postId": "Z95TxtkjHGPq4TAqY", "htmlBody": "<p>That's really great feedback. Thanks.</p>\n", "parentCommentId": "Gu353LndnuYzk2D9Y", "user": {"username": "Evan_Gaensbauer"}}, {"_id": "6vkNRwZFhcwbJhxsJ", "postedAt": "2018-03-11T12:37:50.559Z", "postId": "Z95TxtkjHGPq4TAqY", "htmlBody": "<p>Thank you for the post! </p>\n<p>I agree that from the point of view of translation Doing Good Better might be too focused on donating to charity and on global health, but this doesn't seem to be an issue at all when it comes small in-depth discussion groups. I guess this is another argument in favor of focusing on these types of activities rather than large-scale outreach. </p>\n", "parentCommentId": null, "user": {"username": "Risto_Uuk"}}, {"_id": "nLSpM6f3RTkTJQv2r", "postedAt": "2018-03-11T15:01:11.071Z", "postId": "Z95TxtkjHGPq4TAqY", "htmlBody": "<p>I'm curious how much mass outreach there actually _is_ in EA and/or what people have in mind when they talk about mass outreach.</p>\n<p>Aside from Doing Good Better and Will/CEA's other public intellectual work, which they seem to be retreating from, it's not clear to me what mass outreach has actually been done.</p>\n", "parentCommentId": "6vkNRwZFhcwbJhxsJ", "user": {"username": "David_Moss"}}, {"_id": "2Dcg5uXErXtvmX2wh", "postedAt": "2018-03-11T15:45:43.232Z", "postId": "Z95TxtkjHGPq4TAqY", "htmlBody": "<p>I think this depends on how we define mass outreach. I would consider a lot of activities organized in EA community to be mass outreach. For example, EAG, books, articles in popular media outlets, FB posts in EA group, 80 000 Hours podcast, etc. They are mass outreach because they reach a lot of people and very often don't enable an in-depth work on. Exceptions would be career coaching session at EAG event and discussing books/articles in discussion groups. </p>\n", "parentCommentId": "nLSpM6f3RTkTJQv2r", "user": {"username": "Risto_Uuk"}}, {"_id": "MvJ2pHScEaY6cTfsh", "postedAt": "2018-03-11T16:45:09.153Z", "postId": "Z95TxtkjHGPq4TAqY", "htmlBody": "<p>I agree re. books and articles in the mass media- and these are the kinds of things it seems people are stepping back from. </p>\n<p>I think of the EA FB group, EAG etc. to be more insider-facing than outreach (EAG used to seem to be more about general outreach, but not anymore). </p>\n<p>The 80K podcast is an interesting middle case, since it's clearly broadcast generally, but I imagine the actual audience is pretty niche and it's a lot more in depth than any media article or even Doing Good Better (in my view). I have to wonder how far, in a couple of years, people will be saying of the podcast the same things being said of DGB, i.e. the content is sub-optimal or out of date and so we wouldn't want to spread it around. The same considerations seem, in principle, to apply in both cases, since even if people within the English-speaking world are already locked into some bad ideas, we don't want to continue locking them into <em>new</em> ideas, which we will judge in 2020 to have been premature/mistaken/sub-optimal.</p>\n", "parentCommentId": "2Dcg5uXErXtvmX2wh", "user": {"username": "David_Moss"}}, {"_id": "7rc9MjcPsRk5uxwfz", "postedAt": "2018-03-11T23:28:20.753Z", "postId": "Z95TxtkjHGPq4TAqY", "htmlBody": "<p>Hi Ben,</p>\n<p>As a Chinese national currently living in the west, I think I broadly agree with your argument that &quot;efforts to expand effective altruism into other languages should initially focus on person-to-person outreach to a small number of people with key expertise.&quot; I also appreciate your grasp of the complexity of cultural and linguistic barriers in promoting EA ideas in the Chinese context, which can often be lost on EAs who are less familiar with other cultures.</p>\n<p>One potential objection to this is that not rushing into massive translation effort does not equal to not at least attempt some translation at all. A set of core materials can still be useful, if it is carefully curated by professional translators (not merely bilingual volunteers like me). Without written material, it can be difficult to make ideas stick, even among a small group of personal contacts. A counter argument to this, however, is that the initial promising groups are very likely elite college students and urban professionals who would have no problem reading English materials. I don't have a strong opinion on this.</p>\n<p>Another potential problem I can foresee regarding 'personal contact' approach is that to my knowledge, the Chinese government keeps close tabs on any recruitment activities by foreign social movements. Anecdotes from missionary friends 10 years ago suggest that their religious activities, especially when involving locals,  were closely monitored by the police, kept under 20 people, and sometimes harassed. I cannot speak with any confidence that this is still the case, or if it will be applied to EAs equally. But this is something to keep in mind when evaluating personal outreach versus media effort.</p>\n", "parentCommentId": null, "user": {"username": "letianw"}}, {"_id": "fgTXrXhnH52GoXYYL", "postedAt": "2018-03-13T08:15:29.563Z", "postId": "Z95TxtkjHGPq4TAqY", "htmlBody": "<p>I just published a short history of creating effective altruism movement in the Czech Republic\n<a href=\"http://effective-altruism.com/ea/1ls/introducing_czech_association_for_effective/\">http://effective-altruism.com/ea/1ls/introducing_czech_association_for_effective/</a>\nand I think it is highly relevant to this discussion</p>\n<p>Compared to Ben's conclusions I would use it as a data-point showing</p>\n<ul>\n<li><p>it can be done</p>\n</li>\n<li><p>it may not be worth delaying </p>\n</li>\n<li><p>there are intermediate forms of communication in between &quot;mass outreach&quot; and &quot;person-to-person outreach&quot;</p>\n</li>\n<li><p>you should consider more complex model of communication than just (personal vs. mass media): specifically, a viable model in new country could be something like &quot;very short message in mass media, few articles translated in national language to lower the bareer and point in the right direction, much larger amount transmitted via conferences &amp; similar</p>\n</li>\n</ul>\n<p>Putting too much weight into &quot;person to person&quot; interaction runs into the problem you are less likely to find the right persons (consider how such connections may be created)</p>\n<p>Btw it seems to me the way e.g. 80k hours and CEA works are inadeqate in creating the required personal connections in new countries, so it's questionable if it makes sense to focus on it</p>\n<p>(I completely agree China is extremely  difficult, but I don't think China should be considered a typical example - considering mentality it's possibly one of the most remote countries from from Eurpoean POV)</p>\n", "parentCommentId": null, "user": {"username": "Jan_Kulveit"}}, {"_id": "pkfwKn69LiBdLHAjy", "postedAt": "2018-03-14T21:07:09.266Z", "postId": "Z95TxtkjHGPq4TAqY", "htmlBody": "<p>Hi Jan,</p>\n<p>It's a useful case study, however, two quick responses:</p>\n<p>1) To some extent you were following the suggested approach, because you only pushed ahead having already built a core of native speakers who had been involved in the past with English language materials (e.g. Ales Flidr was head of EA Harvard; core of LW people helped to start it). </p>\n<p>You also mention how doing things like meeting CFAR and attending EAGxOxford were very useful in building the group. This suggests to me that doing <em>even more</em> to build expertise and connections with the core English-speaking EA community before pushing ahead with Czech outreach might have led to <em>even</em> better results.</p>\n<p>I also guess that most of the group can read English language materials? If so, that makes the situation much easier. As I say, the less the distance, the weaker the arguments for waiting.</p>\n<p>2) You don't directly address my main concern. I'm suggesting that if we try to spread EA in new languages and cultures without laying out groundwork could lead to a suboptimal version of EA being locked into the new audience. However, in your report, you don't directly respond to this concern.</p>\n<p>You do give some evidence of short-term impact, which is evidence that benefits outweighed the opportunity costs. But I'd also want to look at questions like: (i) how accurately was EA portrayed in your press coverage? (ii) how well do people getting involved in the group understand EA? (iii) might you have put off important groups in ways that could have been avoided?</p>\n", "parentCommentId": "fgTXrXhnH52GoXYYL", "user": {"username": "Benjamin_Todd"}}, {"_id": "BchQywqKGQHrFYD3D", "postedAt": "2018-03-16T00:39:43.009Z", "postId": "Z95TxtkjHGPq4TAqY", "htmlBody": "<p>Hi Ben,</p>\n<p>1) I understand your concerns.</p>\n<p>On the other hand I'm not sure if you take into account the difficuties</p>\n<ul>\n<li><p>e.g. going to EAG could require something like &quot;heroic effort&quot;. If my academic job was my only source of income, going to EAGxOxford would have meant spending more than my monthly disposable income on it (even if EAGxOxford organizers were great in offering me big reduction in fees) </p>\n</li>\n<li><p>I'm not sure if you are modelling correctly barriers in building connections to the core of the community(*). Here is my guess at some problems people from different countries ol cultures may run into when trying to make connections, e.g. by applying for internships, help, conferences, etc.</p>\n</li>\n</ul>\n<p>1) People unconsciously take language sophistication as a proxy for inteligence. By not being proficient in English you loose points.</p>\n<p>2) People are evaluated on proxies like &quot;attending prestigeous university&quot;. Universities outside of US or UK are generally discounted as regional </p>\n<p>3) People are often in fact evaluated based on social network distance; this leads to &quot;rich gets richer&quot; dynamics</p>\n<p>4) People are evaluated based on previous &quot;EA achievements&quot; which are easier to achieve in places where EA is allready present. </p>\n<p>(*) you may object e.g. Ales Flidr is a good counterexample, but Harvard alumni are typically relatively &quot;delocalized&quot;, in demand everywhere, and may percieve greater value in working in the core than spreading ideas from core to emerging local groups. (Prestige and other incentives also point that way)</p>\n<p>one risk I see in your article is it may influence the people who would be best at mitigating risks of &quot;wrong local EA movements&quot; being founded to not work on it at all.  </p>\n<p>I dont think &quot;the barriers&quot; should be zero, as such barriers in a way help the selection of motivated people. Just in my impression they may be higher than they appear from inside. Asking people to first build conections, while building such connections is not systematically supported, may make the barriers higher than optimal.</p>\n<p>Btw yes the core of the group can read English materials. Also it could do research in machine learning, found a startup, work in quantitive finance, in part get elected to the parliament, move out of the country, and more. What I want to point at, if you imagine  members of a group of people working on &quot;translation&quot; of EA into new culture you would like, they are likely paying huge opportunity costs in doing so.  It may be hard to keep them at some state of waiting and building connections.</p>\n<p>In our case, counterfactually it seems plausible &quot;waiting even more&quot; could have also led to the group not working, or worse organization beeing created, as the core people would loose motivation / pursue other opportunities. </p>\n<p>2) In counting long-term impact and the lock-in effect you should consider the chance movements in new languages and cultures develop in some respects better versions of effective altruism, and beneficial mutations can than spread, even back to the core. More countries may mean more experiments running and faster evolution of better versions of EA. It's unclear to me how these terms  (lock in, more optimization power) add up but both should be counted. One possible resolution may be to prioritize founding movements in smaller countries where you create experience, but the damage is limited. </p>\n<p>To your questions </p>\n<p>i] with one exception, reasonably well taken from the viewpoint of strategic communication (communicating easily communicable concepts, eg impact and effectivity). I don't think the damage is great, and part of misconceptions is unavoidable givent the name &quot;effective altruism&quot;.</p>\n<p>ii] it has a distribution... IMO the understanding at the moment is highly correlated with the enagagement in the group.  Which may be more important than criteria like &quot;average understanding&quot; or &quot;public understanding&quot;</p>\n<p>iii] yes, it's complicated, depends on some misalignments, and I dont want to disscuss it publicly. </p>\n", "parentCommentId": "pkfwKn69LiBdLHAjy", "user": {"username": "Jan_Kulveit"}}, {"_id": "p6oJnCW6jsXLWZHJ9", "postedAt": "2018-03-17T23:11:54.677Z", "postId": "Z95TxtkjHGPq4TAqY", "htmlBody": "<p>Quick addition that I realise the lack of support for local groups is not ideal, but this capacity constraint is another reason to go slow. I'd favour a more &quot;all or nothing&quot; approach, where we select a small number of countries / languages / locations and then make a major attempt to get them going (e.g. ideally supplying enough money so that 1-2 people can go full-time, pay for trips to visit other groups etc., plus provide in-depth mentoring from CEA), while in other locations we minimise outward facing activities. The middle ground of lots of small groups with few resources doesn't seem ideal. I'm optimistic we're moving in this direction with things like the EA Grants and <a href=\"http://effective-altruism.com/ea/1l3/announcing_effective_altruism_community_building/\">http://effective-altruism.com/ea/1l3/announcing_effective_altruism_community_building/</a></p>\n", "parentCommentId": "BchQywqKGQHrFYD3D", "user": {"username": "Benjamin_Todd"}}, {"_id": "3qBvLTNXbeSCrFG95", "postedAt": "2018-03-21T23:29:20.892Z", "postId": "Z95TxtkjHGPq4TAqY", "htmlBody": "<p>Are there new terms for EA and x-risk in Chinese besides 有效利他主义 and 生存危机, by the way?</p>\n", "parentCommentId": null, "user": {"username": "michaelchen"}}, {"_id": "TdzZFHsBjtTC6rWBM", "postedAt": "2018-03-25T13:07:25.093Z", "postId": "Z95TxtkjHGPq4TAqY", "htmlBody": "<p>We may just be seeing upvote inflation if the EA forum now has more readers than before</p>\n", "parentCommentId": "RP9iHyM3hsWTpxEK7", "user": {"username": "Alex_Barry"}}, {"_id": "GF7dimWBjap6FpgMw", "postedAt": "2018-04-03T01:38:13.480Z", "postId": "Z95TxtkjHGPq4TAqY", "htmlBody": "<p>Maybe &quot;full time EAs?&quot;</p>\n", "parentCommentId": "qiK5hMXE4P4B72iMg", "user": {"username": "Denkenberger"}}, {"_id": "QCLSnKnWHPNbFCoqJ", "postedAt": "2018-04-03T03:17:20.643Z", "postId": "Z95TxtkjHGPq4TAqY", "htmlBody": "<p>I think someone suggested this in previous discussions about what euphemism we could use for extreme/hardcore EAs. The problem here is that one can be a full time EA without being an insider and one can be an insider without being full time.</p>\n", "parentCommentId": "GF7dimWBjap6FpgMw", "user": {"username": "David_Moss"}}, {"_id": "BeG5LR2ZLJ3YNFzq9", "postedAt": "2018-04-03T20:36:45.091Z", "postId": "Z95TxtkjHGPq4TAqY", "htmlBody": "<p>While I think that could be a fair metacritique, the science of social change nearly always requires thought leaders/leadership as a method of normalization.  It's likely a sociological hangover of our tribal evolved psychology, but every tribe looks for a tribal leader.  I'd say the EA movement is doing a decent job of put forward thoughtful voices without building a messianic culture.  What do you think?</p>\n", "parentCommentId": "EbcEJT3NRhctviQf3", "user": {"username": "frankfredericks"}}, {"_id": "3aRJsqKzvg4HpPD2v", "postedAt": "2018-04-03T20:45:30.792Z", "postId": "Z95TxtkjHGPq4TAqY", "htmlBody": "<p>A needed reflection for sure.  I'd add that culture extends beyond language, which can make even technically well-translated materials ineffective in other cultural contexts.  One example is from a friend of mine who is a Chinese screenwriter.  She mentioned that there's a ton of Mandarin-fluent writers from the US who ultimately flop when writing for Chinese audiences.  It isn't the language, she said, but it's the story arc.  In the US and western culture at large (if we can clump so many peoples together) the prototypical story is a battle between good a evil, followed by epiphany/battle (read &quot;Hero With a Thousand Faces&quot;).  The Chinese story frame, she explained, was a progression between balance, imbalance, followed by rebalance.  As culture is so much more than \n language and music (etc), but a system of practices, beliefs, narratives, and social structures.  So if/when translation happens, it ought to be by those native to that community, in order to translate not just the language, but the cultural framing as well.</p>\n", "parentCommentId": null, "user": {"username": "frankfredericks"}}, {"_id": "ceFQ2EA6j6ad6eGSN", "postedAt": "2018-09-19T15:36:45.754Z", "postId": "Z95TxtkjHGPq4TAqY", "htmlBody": "<blockquote>\n<p>The recent survey of the community, showed that the media has played a comparatively small role in getting people involved.</p>\n</blockquote>\n<p>Following <a href=\"http://effective-altruism.com/ea/1lh/why_not_to_rush_to_translate_effective_altruism/di8\">David Moss</a>, I'm curious about how much mass media on EA there has actually been? Could it not just be that we are not seeing new EAs as a result of media exposure simply because there has been hardly any of it in the last few years? What are the biggest TV appearances EA has featured in recently?</p>\n<p>Given a lack of recent mass media, it's hard to say how many productive new EAs could result from a big mainstream media piece, and in the event they do, how long it would’ve taken for them to hear about EA otherwise. [This speaking about the English-speaking world].</p>\n", "parentCommentId": null, "user": {"username": "Greg_Colbourn"}}, {"_id": "ZctKMyrMp22WFpbB7", "postedAt": "2018-09-19T21:50:09.133Z", "postId": "Z95TxtkjHGPq4TAqY", "htmlBody": "<p>Will did just give a TED talk.</p>\n", "parentCommentId": "ceFQ2EA6j6ad6eGSN", "user": {"username": "Peter_Hurford"}}, {"_id": "8F8uNQdHD9nFKzHJC", "postedAt": "2018-09-20T16:10:20.929Z", "postId": "Z95TxtkjHGPq4TAqY", "htmlBody": "<p>Yes I saw, and it's great! That's a bit different to what I'm thinking of though, in that TED is more something that people actively seek out/watch. </p>\n<p>I'm thinking in terms of pieces that reach millions of passive readers/viewers (i.e. national newspapers and TV). [Context: The EA Hotel has recently been receiving a fair few requests to do pieces of this type].</p>\n", "parentCommentId": "ZctKMyrMp22WFpbB7", "user": {"username": "Greg_Colbourn"}}, {"_id": "ygFJMba8DaWZ2nMco", "postedAt": "2018-09-20T21:53:34.942Z", "postId": "Z95TxtkjHGPq4TAqY", "htmlBody": "<p>It seems from experience like the median news piece is fairly underwhelming (~0 long-term impact) but there is a small chance of very large impact, so it's hard to get the exact expected value.</p>\n", "parentCommentId": "8F8uNQdHD9nFKzHJC", "user": {"username": "Peter_Hurford"}}, {"_id": "3ujfntdtMB6SaoSoX", "postedAt": "2019-03-22T07:05:13.558Z", "postId": "Z95TxtkjHGPq4TAqY", "htmlBody": "<p>If anyone out there is interested in supporting EAs in India, or visiting EAs in India, please feel free to message me via www.ALLFED.info ....or join the Effective Altruism India Facebook group</p>", "parentCommentId": null, "user": {"username": "RayTaylor"}}, {"_id": "QNj5nKnSyZZTgSstQ", "postedAt": "2019-03-22T07:09:59.973Z", "postId": "Z95TxtkjHGPq4TAqY", "htmlBody": "<p>Concerning translation, it can be a mistake to imagine it&#x27;s necessary to translate the whole of texts, or large texts. </p><p>Instead, translating a title and summary, or first paragraphs, or a contents page or back cover of a book, can be enough to help people decide in if they want to translate the whole thing into their own language, or read with the help of google/dictionary.</p>", "parentCommentId": null, "user": {"username": "RayTaylor"}}, {"_id": "Z6HspKQheetd7qyHz", "postedAt": "2022-01-18T18:21:43.480Z", "postId": "Z95TxtkjHGPq4TAqY", "htmlBody": "<p>I think the post made some important but underappreciated arguments at the time, especially for high stakes countries with more cultural differences, such as China, Russia, and Arabic speaking countries. I might have been too negative about expanding into smaller countries that are culturally closer. I think it had some influence too, since people still often ask me about it.</p><p>One aspect I wish I'd emphasised more is that it's very important to expand to new languages – my main point was that the way we should do it is by building a capable, native-language team, who can build a community in that language, and then investing heavily once we have that (rather than rushing to do more piecemeal efforts in the meantime). For instance, the Tianxia Fellowship in China seems great.</p><p>These days I think we're in a better position to expand EA into new languages (tho I still wish we had more up-to-date intro materials), and to do mass outreach in general, and expanding into new languages also seems higher priority since it's more plausible we've already reached the low hanging fruit in English-speaking countries. So overall I'm more pro-expansion than I was when I wrote it, though I would still say the ideal way to go about it is as in the paragraph above.</p>", "parentCommentId": null, "user": {"username": "Benjamin_Todd"}}]