[{"_id": "rCvPEzeDcPYCBuQxW", "postedAt": "2024-01-02T23:32:07.431Z", "postId": "ZAXeywg7mcgLGeisA", "htmlBody": "<p>This looks very interesting!</p><p>One note: Friends Peace Teams has also been producing ceramic water filters, formerly in Indonesia and more recently in the Philippines, I believe. Unfortunately it's not well documented on their website (I only found out about it through a talk that I went to). At that talk one of their members implied that they thought that they had a better production method based on training local people to make the filters using local materials in some way and then having them train others; I'm not really sure how this differs from other locally-produced water filter manufacturers but they implied that it was.</p><p>Link:</p><p><a href=\"https://friendspeaceteams.org/wp-content/uploads/2018/06/Spring-2010.pdf\">https://friendspeaceteams.org/wp-content/uploads/2018/06/Spring-2010.pdf</a></p><p>Alma \"Kins\" Aparece was the person who gave most of the talk and, if I remember correctly, helped facilitate the water filter making.</p><p>They very much don't fulfill the idea of a charity focusing on one intervention (or maybe a few interventions), however; they do a wide variety of programs, most of which are focused on mediation and interpersonal training rather than clean water/other more tangible goods.</p>", "parentCommentId": null, "user": {"username": "Benjamin M."}}, {"_id": "xkyeQYMgbBovWwr94", "postedAt": "2024-01-03T11:09:39.239Z", "postId": "ZAXeywg7mcgLGeisA", "htmlBody": "<p>Thanks for sharing this reference, <a href=\"https://forum.effectivealtruism.org/users/benjamin-m?mention=user\">@Benjamin M.</a> We added Friends for Peace Teams to the <a href=\"https://docs.google.com/spreadsheets/d/13-demoRlx4I_qfA2tzZhknOCWRUHshS_sGYl_0mPnW4/#gid=1844414804\">list of existing organizations</a> we had found in this space.</p><p>I'd be curious to know how this approach of training multipliers went for them after a few years. Since this intervention is a somewhat intensive in infrastructure (you need to set up a small manufacturing site) and logistics, I'd be slightly surprised to learn that just teaching the production techniques to a few multipliers would have that much of an effect without at least some financial and technical assistance.</p>", "parentCommentId": "rCvPEzeDcPYCBuQxW", "user": {"username": "bcbernardo"}}, {"_id": "LgAKahqquzh7CMzEg", "postedAt": "2024-01-03T13:42:59.076Z", "postId": "ZAXeywg7mcgLGeisA", "htmlBody": "<p>Thanks for this report, it makes a lot of sense and reads well! I agree that ceramic water filters can be a great solution. We use ceramic candles at home to filter the rainwater we drink, that we catch off our outdoor toilet roof. This actually reminds me to replace our candles, we haven't in far too long...</p><p>My intuition likes this intervention especially in areas which have...</p><ol><li>Very high disease burden plus one of the 2 issues below</li><li>Sparse population, where other cleaning methods might be even more expensive</li><li>Conflict, as one off deliveries could reach households in areas where ongoing chlorine projects might be hard to maintain</li></ol><p>My first thought is <i><strong>have you reached out directly to Evidence Action and Givewell to ask about why they went so hard on chlorination and not ceramic filters? &nbsp;</strong></i>Given that in many scenarios (especially in remote hard to reach areas) ceramic filters seem to clean the water more cheaply than chlorine (either with direct or inline) I would imagine they have good reasons why they preferred chlorination to filters, given that they have gone all in on them spending tens of millions of dollars as their preferred cleaning method.</p><p>I'm most interested in your decisions around your primary outcome measure (I think the crux of your DALY burden reduction), which was summarised in your full article like this<br><br><i>\"Impact through mortality and morbidity was obtained by multiplying the total DALYs</i><br><i>lost per year due to those diarrheal diseases by 1 minus the (adjusted - see next</i><br><i>section) risk ratios for ceramic filters (without education) found in our subgroup. &nbsp;Each GiveWell moral weight unit equals the doubling in consumption for one person during a</i><br><i>year. A disability-adjusted life year averted equals 2.3 moral units. &nbsp;This number was then multiplied by GiveWell’s estimates of the Mills-Reincke effect (3.7x for under 5s and 2.35x for over 5s) to get</i><br><i>the effects on all-cause mortality and morbidity.\"</i></p><p>The 2 assumptions here that I think might be shaky here are...</p><ol><li>Your assumption here that there is a direct connection between cases of diarrhoea and mortality. <a href=\"https://forum.effectivealtruism.org/posts/hFPbe2ZwmB9athsXT/clean-water-the-incredible-30-mortality-reducer-we-can-t#:~:text=TLDR%3A%20The%20best%20research%20we,fully%20understand%20why%20it%20works.\">We have very little clue why clean water leads to a mortality reduction</a>, so I'm not sure its reasonable to make the leap, first that there is a causal relationship at all between diarrhoea reduction and the huge mortality reduction, and second that that connection moves linearly like is assumed here (For every % of diarrhoea reduction, mills-reincke effect moves the same).<br><br>I can't immediately think of a great solution here, but the current method doesn't seem right.<br>&nbsp;</li><li>(Potentially shaky assumption shared by GiveWell). The 2.35 Mills Reincke multiplier for over 5s. I could be wrong but I'm not sure there's any good data at all on mortality reductions for clean water in over 5s. <a href=\"https://bfi.uchicago.edu/wp-content/uploads/2022/03/BFI_WP_2022-26.pdf\">The Kremer study</a> Is the only one I know which looks directly at mortality at all, and then only in under 5s. Where does this number come from? My intuition would that the multiplier should be far smaller than this (very very uncertain).<br>&nbsp;</li></ol><p><strong>A few other more minor points</strong></p><ol><li>I think 2 years is ambitious number for lifespan. Between families neglecting to use it (perhaps most important) kids breaking, families selling it (not the end of the world), dirty water clogging it etc. I would have perhaps gone for 1 or 1.5 years use as realistic, but this isn't so important. <i><strong>I struggled in a 5 minute search to find decent research on ceramic filter lifespan in the real world, do you have one?\"</strong></i></li><li>&nbsp;From my experience it is <i><strong>borderline implausible that 5.8% of diarrhoeal episodes lead to hospitalisation. </strong></i>I'm not sure if you referenced where this number came from? I've worked in Northern Uganda for 10 years and diarrhoea is a far less common than you would expect reason for presentation to primary care (Under 3% of our OneDay Health Patients present with diarrhoea) and at best an uncommon reason for hospitalisation. I even removed treating diarrhoea from our OneDay Health cost-effectiveness analysis because it appeared insignificant (both because the effect of treating one patient is so small, and because we treat so few patients for it)<br><br>Taking a less anecdata approach, doing a<a href=\"https://forum.effectivealtruism.org/posts/s6k9cKdX8c4nhH8qq/estimation-for-sanity-checks\"> 'sanity check\"</a> (Thanks <a href=\"https://forum.effectivealtruism.org/users/nunosempere?mention=user\">@NunoSempere</a>) We know fairly well that sub-saharan African children have something like 2-5 episodes of diarrhoea a year (data varies) If 6% of these episodes led to hospitalisation, then that would mean every 5 year old would have on average about <strong>one hospital admission for diarrhoea before the age of 5</strong> (6% of 15 episodes), which is an absurdly high number of admissions<br><br>Kenya for example has about 7 million kids under 5, which would mean about 1.3 million hospital admissions for diarrhoea yearly which can't eb right. Assuming each kid was admitted for 2 nights, this would mean 7100 hospital beds permanently filled with kids with diarrhoea in Kenya - <i><strong>most certainly not the case.</strong></i><br><br><i><strong>(Note this calculation was done quickly so could be plain wrong)</strong></i><br>&nbsp;</li><li>Also quick correction I think you mean the $8 country is Nigeria here.</li></ol><p><i>\"We found the cost-effectiveness of our proposed ceramic filter intervention to be $67 dollars per DALY in Kenya, $54 dollars per DALY in Uganda, and $8 dollars per DALY in Kenya.\"</i></p><p><br><strong>Anyway great job and an important contribution to the clean water discussion!</strong></p><p>If you could be bothered as well, you could definitely get a shorter version of this published in a health economics journal - <i><strong>if you are interested in this maybe message me I might be able to help</strong></i></p><p>Nice one!</p>", "parentCommentId": null, "user": {"username": "NickLaing"}}, {"_id": "jyBEL6sebgsPKnGqt", "postedAt": "2024-01-05T22:17:00.488Z", "postId": "ZAXeywg7mcgLGeisA", "htmlBody": "<p>Hi Nick! Thanks so much for your thoughtful response. Here are some of our thoughts on your questions:</p><blockquote><p>**Have you reached out directly to Evidence Action and GiveWell to ask about why they went so hard on chlorination and not ceramic filters?&nbsp;**</p></blockquote><ul><li>Since this comment, I have reached out to Givewell and Evidence Action! Thanks for the suggestion - we had not previously reached out due to time constraints.</li></ul><blockquote><p><strong>Your assumption here that there is a direct connection between cases of diarrhoea and mortality.&nbsp;</strong><a href=\"https://forum.effectivealtruism.org/posts/hFPbe2ZwmB9athsXT/clean-water-the-incredible-30-mortality-reducer-we-can-t#:~:text=TLDR%3A%20The%20best%20research%20we,fully%20understand%20why%20it%20works.\"><strong>We have very little clue why clean water leads to a mortality reduction</strong></a><strong>, so I'm not sure its reasonable to make the leap, first that there is a causal relationship at all between diarrhoea reduction and the huge mortality reduction, and second that that connection moves linearly like is assumed here (For every % of diarrhoea reduction, mills-reincke effect moves the same).</strong></p></blockquote><ul><li>You’re right, the leap in assuming a causal relationship between diarrhea reduction and mortality reduction is not ideal and we aren’t assuming this is exactly correct. However, using diarrhea cases as a proxy for morbidity and mortality was the best we could come up with. We welcome any additional suggestions.</li><li>In addition, from what we saw from the individual studies considered in the systematic reviews we took into account, none seem to be powered to detect effects on mortality, and most do not report it as an outcome. To make sure reductions in diarrhea cases translate into mortality reductions, one would probably need to do what Kremer and his colleagues did for their 2015 systematic review - individually reach the authors of each study and ask whether they collected any mortality data that went undisclosed due to low statistical power. This could be further work for researchers to perform in the future.</li></ul><blockquote><p>**I could be wrong but I'm not sure there's any good data at all on mortality reductions for clean water in over 5s.&nbsp;**<a href=\"https://bfi.uchicago.edu/wp-content/uploads/2022/03/BFI_WP_2022-26.pdf\"><strong>The Kremer study</strong></a> <strong>Is the only one I know which looks directly at mortality at all, and then only in under 5s. Where does this number come from? My intuition would that the multiplier should be far smaller than this (very very uncertain).</strong></p></blockquote><ul><li>This is a really good point. When applying the 2.35 Mills Reincke multiplier in our cost-effectiveness analysis, we were more concerned with comparing different water quality interventions than getting the exact number for a CEA (dollars per DALY). To compare ceramic filters to chlorination, we applied the same methodology as Givewell to create as close of a comparison between the two.</li><li>However, we can perform an&nbsp;analysis removing the Mills-Reinke effect for over 5s. This would affect our estimates both for chlorination and ceramic filters in similar ways but would lower the overall cost-effectiveness. We can likely do this next week!</li></ul><blockquote><p>I think 2 years is ambitious number for lifespan. Between families neglecting to use it (perhaps most important) kids breaking, families selling it (not the end of the world), dirty water clogging it etc. I would have perhaps gone for 1 or 1.5 years use as realistic, but this isn't so important.&nbsp;<i><strong>I struggled in a 5 minute search to find decent research on ceramic filter lifespan in the real world, do you have one?\"</strong></i></p></blockquote><ul><li>You hit on an important topic, as the lifespan of the ceramic filter actually can significantly impact the overall cost-effectiveness analysis.</li><li>Our assumption of a two-year lifespan for ceramic filters in our analysis is based on a Unicef report&nbsp;<a href=\"https://web.archive.org/web/20231025101345/https://www.unicef.org/supply/media/5221/file/%20household-water-treatment-filters-product-guide.pdf\">(Unicef, 2020)</a>, which suggests a minimum two-year effectiveness. However, field insights from organizations like \"<a href=\"https://www.potterswithoutborders.com/\">Potters Without Borders</a>\" and experts at&nbsp;<a href=\"https://purehomewater.org/\">Pure Home Water</a> indicate that, with proper care, these filters can endure beyond this conservative timeframe.<ul><li>Michael Anyekase, with over 10 years of experience working with manufacturing and distributing ceramic filters in Uganda at Purehome Water (similar to our theory of change), proposes a potential lifespan of 5 to 6 years under clear water conditions.</li><li>Yvette Neh suggests an upper limit of 4 years.. Yvette Neh (who also works at purehome water), proposes an upper limit of 4 years for somewhat good water conditions. &nbsp;In addition, none of the experts we spoke with were overly concerned with filter breakage, and agree that this 2 year lifespan is a conservative timeline?</li></ul></li><li>**We ultimately chose a 2-year filter lifespan as we believe this might be a conservative estimate, and that, in practice, these filters often last much longer.&nbsp;**</li></ul><blockquote><p>From my experience it is&nbsp;<i><strong>borderline implausible that 5.8% of diarrhoeal episodes lead to hospitalisation</strong></i></p></blockquote><ul><li><strong>This</strong> intuitively makes a lot of sense, and we will look into this more deeply in the upcoming days and weeks.</li></ul><blockquote><p><strong>Also quick correction I think you mean the $8 country is Nigeria here.</strong></p></blockquote><ul><li>Thank you! We updated this in the forum and the report!</li></ul><p>Again, thank you so much for your thoughtful response.</p>", "parentCommentId": "LgAKahqquzh7CMzEg", "user": {"username": "Juan Benzo"}}, {"_id": "NFpy9rbGd8wqdQDwX", "postedAt": "2024-03-16T19:41:10.160Z", "postId": "ZAXeywg7mcgLGeisA", "htmlBody": "<p>Hi again, Nick! Sorry it took so long to answer your remaining points!</p><p>So, first about this one:</p><blockquote><p>(Potentially shaky assumption shared by GiveWell). The 2.35 Mills Reincke multiplier for over 5s. I could be wrong but I'm not sure there's any good data at all on mortality reductions for clean water in over 5s. The Kremer study Is the only one I know which looks directly at mortality at all, and then only in under 5s. Where does this number come from? My intuition would that the multiplier should be far smaller than this (very very uncertain).</p></blockquote><p>Taking a more careful look into the footnotes and supplemental materials for GiveWell’s <a href=\"https://www.givewell.org/international/technical/programs/water-quality-interventions#Studies_of_historical_water_quality_improvements\">discussion of the Mills-Reincke effect</a>, it appears that they have gathered mixed evidence on its existence for the over-5 population:</p><ul><li>This <a href=\"https://docs.google.com/spreadsheets/d/1I_VCKCrRKKUQ3M3OUQoH_cpPndcrbMeRn6LL29-8P4I/edit#gid=0\">supplementary spreadsheet</a> lists six econometric studies including overall all-cause mortality effects from water quality improvements. These are mostly natural experiments regarding the implementation of municipal water quality improvements in now-developed countries (Germany, USA, Sweden, Japan), during the 20th and early 21st centuries (a summary of all papers is available <a href=\"https://docs.google.com/document/d/1QV4rx0gaivrDgUzBVHzStOi06vQ0nfw-3fxs6XDrRxE/edit\">here</a>; we have only briefly reviewed the relevant ones). Both the mean and the median effect sizes on the population-wide all-cause mortality were -19%, ranging from +0.9 to -58%. Surprisingly, this is an even larger effect size than the one observed when considering under-5 mortality alone (median: -11%; mean: -10 to -13%). This can be taken at least as some rough evidence that the MR phenomenon can be widespread across age groups.&nbsp;<span class=\"footnote-reference\" data-footnote-reference=\"\" data-footnote-index=\"1\" data-footnote-id=\"upqq1hwdzg\" role=\"doc-noteref\" id=\"fnrefupqq1hwdzg\"><sup><a href=\"#fnupqq1hwdzg\">[1]</a></sup></span></li><li>On the other hand, a long note to the “<i>Adjustment for smaller Mills-Reincke effect in over-5s</i>” <a href=\"https://docs.google.com/spreadsheets/d/1dxRfhPnTBJ_UYAeoAyVd8u6Orxh4pR9hB3wvdfZcXFs/edit#gid=1674952052&amp;range=A4\">cell of their CEA</a>, authors of the GW report on water quality interventions mention one study (<a href=\"https://dx.doi.org/10.4269%2Fajtmh.19-0405\">Newman et al. 2020</a>) that looked into one of the plausible mechanisms for explaining the MR phenomenon and found no evidence of such effects on adults. However, the report's authors argue that it may still be true for older children and adolescents:</li></ul><blockquote><p>[...] However, we do not have much evidence on whether it operates in people over 5. Based on <a href=\"https://docs.google.com/document/d/1ZFwNK2RUI8k5hKA8oDI8-Z33nERaLbvt-Y5lYmojPTg/edit?usp=sharing\">conversations with experts</a>[...], we believe a likely mechanism by which the Mills-Reincke phenomenon operates is that enteric diseases impair nutritional status and body energy reserves, increasing risk from subsequent infectious diseases. This mechanism is expected to affect young children the most since they have smaller body reserves of energy, protein, and other nutrients.<br>We identified one study that addresses this hypothesis empirically in under-5s and over-5s side-by-side. Newman et al. 2020 measured the risk of respiratory infection following a bout of diarrhea in infants and mothers. Infants had a substantially elevated risk of respiratory infection following diarrhea, while mothers did not. This provides some evidence that the Mills-Reincke phenomenon may not operate in adults. It is worth noting that the “over 5” category we use in this CEA is not composed solely of adults, and children over 5 may still be susceptible to the Mills-Reincke phenomenon. To derive this adjustment, we assume that Mills-Reincke has an impact half as large in over-5s as in under-5s. This is a very uncertain guess. We also assume that water quality interventions avert 2.7 non-enteric deaths for each enteric death averted (see water quality report for calculation, link below), and that the 50% downward adjustment only applies to non-enteric deaths.</p></blockquote><p>In any case, we added a sensitivity analysis to our <a href=\"https://docs.google.com/spreadsheets/d/1Se_gaDm8-kkCi459vuBK4a0RyfDuZ853mtrHvkwStNI/edit#gid=1561319653&amp;range=CH:CJ\">Effectiveness Supplement</a> where we consider no Mills-Reincke effect for age groups over 5 y.o. And it does make a great difference. On average, it <strong>reduces the estimated (cost-)effectiveness of filtration interventions by 33%, and by 21% for chlorination interventions across all countries</strong> <i>(simple average)</i>. For our top 5 prioritized countries, the difference is even bigger: <strong>a 43% reduction for filtration, and 36% for chlorination&nbsp;</strong><span class=\"footnote-reference\" data-footnote-reference=\"\" data-footnote-index=\"2\" data-footnote-id=\"wm794whx99\" role=\"doc-noteref\" id=\"fnrefwm794whx99\"><sup><a href=\"#fnwm794whx99\">[2]</a></sup></span>. For Nigeria, for instance, the effectiveness lowers from ~24k DALYs/100,000 people served, to ~13k DALYs/100,000 people served.</p><p>Given the magnitude of the difference, we suggest further research would greatly benefit from trying to better understand the evidence base for or against the existence of the Mills-Reincke effect among older children, adolescents, and adults.</p><hr><ol class=\"footnote-section footnotes\" data-footnote-section=\"\" role=\"doc-endnotes\"><li class=\"footnote-item\" data-footnote-item=\"\" data-footnote-index=\"1\" data-footnote-id=\"upqq1hwdzg\" role=\"doc-endnote\" id=\"fnupqq1hwdzg\"><span class=\"footnote-back-link\" data-footnote-back-link=\"\" data-footnote-id=\"upqq1hwdzg\"><sup><strong><a href=\"#fnrefupqq1hwdzg\">^</a></strong></sup></span><div class=\"footnote-content\" data-footnote-content=\"\"><p>Note that GiveWell itself mentioned reasons to take these estimates with a grain of salt. Quoting them (end of the “Studies of historical water quality improvements” section of their report):</p><blockquote><p>Several factors lead us to be uncertain about the relevance of these studies to modern interventions that target waterborne disease in low-income settings:</p><p>- Most were conducted in contexts that differ substantially from the contexts in which water quality interventions would be applied today. This includes differences in location, infectious disease profile, baseline mortality rates, and other factors.</p><p>- The water quality interventions represented in these studies vary, and none is identical to the interventions to which we might direct funding.</p><p>- These studies are observational and use different strategies to attempt to isolate the causal impact of water quality on mortality. We believe some of these strategies are more convincing than others, but all of them may be susceptible to some degree of confounding from other variables that changed alongside water quality.</p><p>- We do not know whether unsupportive studies went unpublished, potentially creating publication bias. This would make the overall literature appear more supportive than it would otherwise be.</p><p>- None of these studies were preregistered, increasing the risk of bias.</p><p>For these reasons, we view these studies as providing rough triangulation for our mortality reduction estimate and a plausible mechanism to explain its unexpectedly large effect size. We do not see them as providing precise effect size estimates for the impact of water quality interventions on mortality.<br>&nbsp;</p></blockquote></div></li><li class=\"footnote-item\" data-footnote-item=\"\" data-footnote-index=\"2\" data-footnote-id=\"wm794whx99\" role=\"doc-endnote\" id=\"fnwm794whx99\"><span class=\"footnote-back-link\" data-footnote-back-link=\"\" data-footnote-id=\"wm794whx99\"><sup><strong><a href=\"#fnrefwm794whx99\">^</a></strong></sup></span><div class=\"footnote-content\" data-footnote-content=\"\"><p>Differences across countries and intervention types are due to the different YLL and YLD proportions coming from each pathogen and each age group in each country (according to data from GBD 2019).</p></div></li></ol>", "parentCommentId": "LgAKahqquzh7CMzEg", "user": {"username": "bcbernardo"}}, {"_id": "bqL9BHtfAh5oECfi8", "postedAt": "2024-03-16T19:44:45.558Z", "postId": "ZAXeywg7mcgLGeisA", "htmlBody": "<p>About this other point:</p><blockquote><p>From my experience it is borderline implausible that 5.8% of diarrhoeal episodes lead to hospitalisation. I'm not sure if you referenced where this number came from? I've worked in Northern Uganda for 10 years and diarrhoea is a far less common than you would expect reason for presentation to primary care (Under 3% of our OneDay Health Patients present with diarrhoea) and at best an uncommon reason for hospitalisation. I even removed treating diarrhoea from our OneDay Health cost-effectiveness analysis because it appeared insignificant (both because the effect of treating one patient is so small, and because we treat so few patients for it)</p></blockquote><p>It took a while, but we finally found some good empirical data regarding hospitalization rates due to diarrhea in LMICs, beyond the four smaller studies GiveWell references for justifying their 5.8% estimate&nbsp;<span class=\"footnote-reference\" data-footnote-reference=\"\" data-footnote-index=\"1\" data-footnote-id=\"pjmcdi86kh\" role=\"doc-noteref\" id=\"fnrefpjmcdi86kh\"><sup><a href=\"#fnpjmcdi86kh\">[1]</a></sup></span>.</p><p>So, the Global Enteric Multicenter Study of Diarrheal Disease in Infants and Young Children in Developing Countries (GEMS) was a 3-year, multi-site case-control study focusing on diarrhea in children under 5 years old living in seven low-income countries in sub-Saharan Africa and South Asia (<a href=\"https://doi.org/10.1093/cid/cis753\">source</a>).</p><p>Even though the main GEMS study had a focus on moderate and severe cases, it was preceded by a preparatory survey called “Health Care Utilization and Attitudes Survey (HUAS)”. According to their “Establishing a Sampling Frame for the Case/Control Study and Selecting Health Centers for Case Recruitment” <a href=\"https://academic.oup.com/cid/article/55/suppl_4/S232/325786#97955700\">section</a>:</p><blockquote><p>In preparation for the case/control study, we performed a Health Care Utilization and Attitudes Survey (HUAS). An age-stratified sample of approximately 1000 children aged 0–59 months per site randomly selected from each updated DSS [demographic surveillance system] dataset was visited at home, and parents/primary caretakers were asked whether their child had experienced diarrhea during the previous 14 days. If so, the presence of findings suggestive of MSD [moderate-to-severe diarrhea] was solicited (sunken eyes, wrinkled skin, hospitalization, receipt of intravenous hydration, or dysentery), and source(s) of healthcare were recorded. These data were used to adjust the size of the DSS population at each site as necessary to contribute the requisite number of cases of MSD to each age stratum, and to select 1 or more “sentinel” health centers (SHCs) serving the DSS population at each site (Table 1) as venues for the case/control study based on their potential to capture MSD cases from the DSS.</p></blockquote><p>It turns out that the resulting data from the HUAS study is easily accessible <a href=\"https://clinepidb.org/ce/app/workspace/analyses/DS_221d2bcac4/new\">for anyone to consult</a>. And it recorded the number of children under 5 who reportedly had diarrhea during the 14 days previous to the interview, and whether they were admitted to a hospital.</p><p>According to this data, out of 5,171 who reportedly suffered from diarrhea in the previous 14 days, and for whom data for this variable was available, 270 children were admitted to hospitals. This gives a 5.22% hospitalization rate (95% CI: 4.65-5.86%), which is roughly what GiveWell estimated from a set of smaller studies.</p><p>Therefore, we think this part of the CEA is also roughly aligned with evidence.</p><ol class=\"footnote-section footnotes\" data-footnote-section=\"\" role=\"doc-endnotes\"><li class=\"footnote-item\" data-footnote-item=\"\" data-footnote-index=\"1\" data-footnote-id=\"pjmcdi86kh\" role=\"doc-endnote\" id=\"fnpjmcdi86kh\"><span class=\"footnote-back-link\" data-footnote-back-link=\"\" data-footnote-id=\"pjmcdi86kh\"><sup><strong><a href=\"#fnrefpjmcdi86kh\">^</a></strong></sup></span><div class=\"footnote-content\" data-footnote-content=\"\"><p>The four studies are&nbsp;<a href=\"https://dx.doi.org/10.3329%2Fjhpn.v29i1.7567\"><u>Burton et al. 2011</u></a>,&nbsp;<a href=\"https://dx.doi.org/10.1186%2F1471-2458-11-389\"><u>Page et al. 2011</u></a>,&nbsp;<a href=\"https://dx.doi.org/10.3329%2Fjhpn.v29i2.7854\"><u>Breiman et al. 2011</u></a>, and&nbsp;<a href=\"https://dx.doi.org/10.4269%2Fajtmh.12-0755\"><u>Omore et al. 2013</u></a>. See footnote&nbsp;<a href=\"https://www.givewell.org/international/technical/programs/water-quality-interventions#footnote92_1nc1822\"><u>#92</u></a> of GW’s report.</p></div></li></ol>", "parentCommentId": "NFpy9rbGd8wqdQDwX", "user": {"username": "bcbernardo"}}, {"_id": "vCaQn9gzEEQ9LQbff", "postedAt": "2024-03-16T20:41:41.538Z", "postId": "ZAXeywg7mcgLGeisA", "htmlBody": "<p>Finally, about the other points you raised, we recommend you (and everyone interested in the theme) check the <a href=\"https://9475dbf4-555e-4808-9886-5f8ee815cc82.usrfiles.com/ugd/9475db_98362d974b1942aab99c4dc66d6e828c.pdf\">new version of the report</a> published by Ambitious Impact/Charity Entrepreneurship when recommending this intervention for CE's <a href=\"https://forum.effectivealtruism.org/posts/X65Lxnd4hbGpuMq78/from-salt-intake-reduction-to-labor-migration-announcing-top\">next incubation round</a>&nbsp;<span class=\"footnote-reference\" data-footnote-reference=\"\" data-footnote-index=\"1\" data-footnote-id=\"xfq0zutw9s\" role=\"doc-noteref\" id=\"fnrefxfq0zutw9s\"><sup><a href=\"#fnxfq0zutw9s\">[1]</a></sup></span>.</p><p>AIM/CE researchers dedicated a few hours to polishing the remaining loose ends in our previous version. It includes a model for calculating the mortality reductions based on diarrhea case-fatality rates. This is a slightly enhanced version of our model and represents an interesting proposition on how to extrapolate the effect of the intervention from cases to mortality - given more time, it could even be expanded to consider pathogen-specific case-fatality rates, which should be even better.</p><p>&nbsp;</p><ol class=\"footnote-section footnotes\" data-footnote-section=\"\" role=\"doc-endnotes\"><li class=\"footnote-item\" data-footnote-item=\"\" data-footnote-index=\"1\" data-footnote-id=\"xfq0zutw9s\" role=\"doc-endnote\" id=\"fnxfq0zutw9s\"><span class=\"footnote-back-link\" data-footnote-back-link=\"\" data-footnote-id=\"xfq0zutw9s\"><sup><strong><a href=\"#fnrefxfq0zutw9s\">^</a></strong></sup></span><div class=\"footnote-content\" data-footnote-content=\"\"><p>We, the authors of the originial report, had only very limited participation in the changes made between the two versions.&nbsp;</p></div></li></ol>", "parentCommentId": "bqL9BHtfAh5oECfi8", "user": {"username": "bcbernardo"}}]