[{"_id": "Zqk94rfBA9pFmadFe", "postedAt": "2024-01-26T19:27:40.176Z", "postId": "ZeXoCJ426CocFzxJq", "htmlBody": "<p>This is great! You should consider doing a whole series of posts like this, especially focusing on common misconceptions--the time cost thing was something I fuzzily knew about, but hadn't ever explicitly considered as the single major cost of a policy, such that money cost can be basically ignored.</p><p>I'm surprised that a policy only fails the cost-benefit test if the FTE cost <i>five </i>times more expensive than the benefit, and anything less ineffective than that is simply not a priority. What's the reasoning behind that?&nbsp;</p>", "parentCommentId": null, "user": {"username": "vbelenky"}}, {"_id": "XwvtgBeaAREBGfqnM", "postedAt": "2024-01-26T20:42:43.179Z", "postId": "ZeXoCJ426CocFzxJq", "htmlBody": "<p>The official framing is that a DALY is valued at 2 to 4 times GDP per capita, so given uncertainty, it's probably good if you're buying a DALY for less than GDP per capita and probably bad if you're paying 5x.</p>\n<p>My framing is that the disutility of working a job, holding income constant, is probably between 0.2 and 1 DALY.</p>\n", "parentCommentId": "Zqk94rfBA9pFmadFe", "user": {"username": "Richard Bruns"}}, {"_id": "ghc8zeRpaKgLF9ZSk", "postedAt": "2024-01-29T09:17:33.560Z", "postId": "ZeXoCJ426CocFzxJq", "htmlBody": "<p>Interesting! Can you link to any (reasonably simple) example CEAs where this process is applied?</p>", "parentCommentId": null, "user": {"username": "Stan Pinsent"}}, {"_id": "Ag5mWeKszmPrriPdd", "postedAt": "2024-01-29T09:29:50.626Z", "postId": "ZeXoCJ426CocFzxJq", "htmlBody": "<p>Also, do you have any recommendations for estimating the disvalue of a policy that curtails people's freedom (eg. by increasing the price of a good they value)?</p>", "parentCommentId": "ghc8zeRpaKgLF9ZSk", "user": {"username": "Stan Pinsent"}}, {"_id": "pbJd6NpxHdcwNJuBc", "postedAt": "2024-01-29T19:22:06.578Z", "postId": "ZeXoCJ426CocFzxJq", "htmlBody": "<p>Sadly no, although many EA-style shallow dives use a similar approach. The target audience for this is people like industrial hygienists or nurse managers who want to do an analysis of an operational change. I posted this because a couple people at a recent conference asked me for a guide like this and there was nothing like it available.</p>", "parentCommentId": "ghc8zeRpaKgLF9ZSk", "user": {"username": "Richard Bruns"}}, {"_id": "RKXypmcDwA5mcpo2r", "postedAt": "2024-01-29T19:28:29.002Z", "postId": "ZeXoCJ426CocFzxJq", "htmlBody": "<p>There are standard approaches for valuing the loss of consumer surplus from price changes. Traditionally, moving money from one entity to another is just a transfer, not a cost, but there is a <a href=\"https://en.wikipedia.org/wiki/Deadweight_loss\">deadweight loss</a> associated with price changes, and we measure that as a cost. But you have to have an estimate for how many trades will not happen as a result of the price change.</p><p>There are no existing metrics for valuing loss of freedom in DALY terms. You'd basically have to do a proper survey, using similar methodology to the one that generates the DALY losses of various health states.</p>", "parentCommentId": "Ag5mWeKszmPrriPdd", "user": {"username": "Richard Bruns"}}, {"_id": "veduFrARikvufsJHY", "postedAt": "2024-01-30T10:24:51.157Z", "postId": "ZeXoCJ426CocFzxJq", "htmlBody": "<p>Thank you!</p>", "parentCommentId": "RKXypmcDwA5mcpo2r", "user": {"username": "Stan Pinsent"}}, {"_id": "uuu9H52Yv5MHa63Kv", "postedAt": "2024-01-30T13:38:03.169Z", "postId": "ZeXoCJ426CocFzxJq", "htmlBody": "<p><strong>Executive summary</strong>: This post provides a simplified framework for non-experts to conduct cost-benefit analyses of policies and interventions using life-years as the benefit metric.</p><p><strong>Key points</strong>:</p><ol><li>Estimate time costs for all personnel involved in implementing and maintaining the policy.</li><li>Convert expected health benefits into life-years gained using disability-adjusted life year (DALY) scores.</li><li>Compare annualized time costs (in FTEs) to annual life-years gained.</li><li>If FTE cost is less than life-year benefit, the policy is cost-effective. If FTE cost is more than 5 times life-year benefit, the policy likely fails cost-benefit test.</li><li>Consider uncertainties in estimates. If only average estimates available, use proposed heuristic.</li><li>Can convert monetary and social benefits to life-year equivalents. Add appropriate caveats if speculative.</li></ol><p>&nbsp;</p><p>&nbsp;</p><p><i>This comment was auto-generated by the EA Forum Team. Feel free to point out issues with this summary by replying to the comment, and</i><a href=\"https://forum.effectivealtruism.org/contact\"><i>&nbsp;<u>contact us</u></i></a><i> if you have feedback.</i></p>", "parentCommentId": null, "user": {"username": "SummaryBot"}}]