[{"_id": "cXDJKJWTEvNLzC7gm", "postedAt": "2022-09-03T15:06:04.579Z", "postId": "ZgQFw6vRDo8hboPKK", "htmlBody": "<p>What are the main benefits of fiat that Bitcoin doesn't have?</p>\n<p>Doesn't fiat allow governments to raise money more easily, by increasing the money supply and possibly easier taxation, to pay for important programs, including health care, education, research (and other public goods) and for emergencies (like COVID)?</p>\n", "parentCommentId": null, "user": {"username": "MichaelStJules"}}, {"_id": "tPqGRKLvemQyHi8zp", "postedAt": "2022-09-03T16:51:30.225Z", "postId": "ZgQFw6vRDo8hboPKK", "htmlBody": "<p>I'm still unclear on the problems that Bitcoin is solving versus fiat. I can also imagine many issues that Bitcoin has that fiat doesn't. This post is a one-sided take, and it'd be more honest to put both the disadvantages/advantages side-by-side by fiat. There are clear advantages to our current system that we'd give up by switching more to Bitcoin; for example, if I lose my banking account login information, I can recover it with the help of a customer service representative. Whereas if I lose my wallet keys, I'm screwed.<br><br>Furthermore, fiat benefits the population because a central actor can intervene. I don't see it as necessarily evil that the Fed can perform quantitative easing to fight inflation or stimulate economic growth, say when a crippling pandemic hits. Could many of the issues you're highlighting be solved just by better functioning government?</p><p>Some other more specific issues:&nbsp;</p><blockquote><p>State control of money has empowered corruption, surveillance, and restriction of people’s ability to save and transact freely.</p></blockquote><p>Why/how does Bitcoin solve corruption? Also, all the transactions are public. If I'm performing Bitcoin transactions in China, the government will be able to surveil my transactions. Whereas, no one else can deduce my Bank of America transactions without having access to the system.</p><blockquote><p>Lack of accountability</p></blockquote><p>I'm not seeing how this solved by Bitcoin. Malefactors can obfuscate financial behavior with Bitcoin too.<br><br>Let me end by asking whether Bitcoin can solve significant problems better than fiat. Problems include climate change, suffering, risk of pandemics, risk of misaligned AI, disease, and poverty. With scant altruism resources, are we best served to invest it into Bitcoin projects in order to do the most good?</p>", "parentCommentId": null, "user": {"username": "Karthik Sekar"}}, {"_id": "kKwCu5Bb9tjH6m6ut", "postedAt": "2022-09-07T15:23:04.149Z", "postId": "ZgQFw6vRDo8hboPKK", "htmlBody": "<p>Hi Karthik, I appreciate your feedback. &nbsp;I've added a couple of paragraphs to the original post in order to cover more explicitly some of the points you've raised.</p><p><strong>1. Seeing this article as a dishonest or one-sided take:&nbsp;</strong></p><p>The article devotes an entire appendix to the most popular arguments against Bitcoin. &nbsp;<br><br>Nevertheless, the purpose of this essay is not to compare the pros and cons of Bitcoin with those of the fiat system, and to declare a \"winner\" on the basis of intellectual analysis.&nbsp;<br><br>Rather, it is to point out that, whatever form the global monetary system takes 50 years from now, it should reflect the preferences of individuals who are free to choose what is best for them. Unfortunately, today's monetary system has major drawbacks from which many people around the world wish to escape - but, because money is currently a government monopoly, <i>these people have no alternative</i>.&nbsp;</p><p>If you prefer using fiat money, then nobody should stop you. But if you need a form of money that can't be inflated away, that doesn't depend on the good behaviour of the authorities, and that you can receive directly without having it channelled through third parties (and if those requirements are more important than any drawbacks you might associate with such a system), then that option ought to be available to you too. &nbsp;That potential is what Bitcoin offers.&nbsp;</p><p><strong>2. Regarding the benefit of having a central actor intervene with QE/interest rates, I've added:</strong></p><blockquote><p>debt accumulates in a vicious cycle: as the amount of societal debt outgrows the amount of money that exists (Figure 1), the only solution is to print and lend even more money – thereby creating more debt.</p><p>In other words, while the current system gives governments more freedom to print money and inject economic stimulus in the short term, most of this stimulus is required simply to pay down debt that was accumulated in previous rounds of spending. This is inherently unsustainable in the long run.</p></blockquote><p>&nbsp;The Fed had to print trillions of dollars during the pandemic so that we wouldn't see mass insolvency. But the situation was only that dire in the first place because they'd allowed so much money (and therefore debt) to be created in the past. And by adding more money/debt to the system on this occasion, they've ensured that it will be even more vulnerable next time. &nbsp;The anonymous author of the <a href=\"https://forum.effectivealtruism.org/posts/Kg7KixqEHWBctJ4az/cause-exploration-prizes-fix-the-money-fix-the-world\">\"Fix the money\" essay</a> goes into more detail on this point.</p><p><strong>3. How Bitcoin addresses corruption:</strong> if a small group of people have control over the money source in your society, some of them will inevitably abuse that power for their own ends. &nbsp;Furthermore, if you have corrupt officials in charge of handling aid money from abroad, then some of them will steal that money for themselves. &nbsp;</p><p>Bitcoin avoids these specific problems by having no centralised authority over its money supply, and by allowing people to receive money (e.g. aid) directly instead of having to rely on middlemen. &nbsp;It doesn't purport to solve all corruption per se.<br><br><strong>4. Regarding how Bitcoin addresses privacy, I've added:</strong></p><blockquote><p>While the Bitcoin blockchain (the ledger containing all Bitcoin transactions) is public, payments are pseudonymous, and do not require the sort of personal information (e.g. name, bank account, or address) that governments, corporations, and merchants sell or leak on a regular basis. &nbsp;Further developments to Bitcoin (such as the Lightning Network, Taproot, Graftroot, and Schnorr Signatures) are already making it cheaper and easier to send bitcoins privately.</p></blockquote><p><strong>5. &nbsp;Bitcoin versus government accountability:</strong> &nbsp;if Bitcoin ruled the world, then governments wouldn't be able to simply print money in order to fund their unpopular ventures (as opposed to taxing their people and having to justify their expenditure). &nbsp; On an individual level, it's another reason why you can trust that your bitcoins won't be susceptible to inflation.<br><br><strong>6. Losing your Bitcoin-wallet key:&nbsp;</strong> if you choose to take sole custody of your bitcoins (and it is a choice), then, yes, you are responsible for storing your key safely. The reason that your local bank can recover your account, on the other hand, is that they (not you) have custody of your savings. &nbsp;<br><br>That said, there is no reason why you couldn't make use of equivalent services in a Bitcoin economy. Bitcoin may not necessarily be user-friendly right now, but such relatively minor issues are unlikely to persist as the network undergoes development over the next few years – and it is this work that I encourage EA and other groups to support.</p><p><strong>7. Whether Bitcoin can solve global issues better than fiat money:</strong> Bitcoin is just another form of money, so in theory, you can spend it on the same things that you would with fiat. &nbsp;The difference is that it appears to meet the fundamental requirements of sound money better than fiat does - in which case, the downstream benefits for issues such as poverty, climate change etc. would be huge.&nbsp;<br><br><strong>8. \"Could many of the issues you're highlighting be solved just by better functioning government?\":</strong> I'm suggesting that Bitcoin <i>is</i> a way to achieve better-functioning government. Political/economic reform necessarily occurs at an institutional level.</p>", "parentCommentId": "tPqGRKLvemQyHi8zp", "user": {"username": "Alex Gunner"}}, {"_id": "DDFB3x8rW8rzgDiZR", "postedAt": "2022-09-08T04:33:57.485Z", "postId": "ZgQFw6vRDo8hboPKK", "htmlBody": "<p>Alex, I appreciate the thoughtful comment and all of the edits. I gave you an upvote, but I'm still far from convinced that this is worth EA's time and money. Most of what you've written so far as convinced me that poor, unstable governance is the ultimate pathology to treat, and Bitcoin is a potential ointment for (some) resultant symptoms. I know EAers work on improving <a href=\"https://electionscience.org/commentary-analysis/voting-methods-an-open-target-for-effective-altruism/\">election </a>and <a href=\"https://forum.effectivealtruism.org/posts/8cr7godn8qN9wjQYj/decreasing-populism-and-improving-democracy-evidence-based\">democracy system</a>s. A few more follow up thoughts on a few of your remarks:<br><br>Responding to (3) and (5): Sure, I see other issues that need to be worked out, for example, governments being able to tax fairly to pay for social goods such as schools and health care. I'm not convinced that the problems solved here outweigh those sorts of bad.</p><p>Responding to (6): How much of this is just fundamental though? Any sort of \"customer service\" will require a middle man, i.e. a brokerage or institution. It's not like we can retrofit the blockchain to have a \"Forgot my Password\" feature.&nbsp;</p><p>Responding to (7): But how much better? Are we better off into investing into anti-corruption projects or the democracy improvement ones?&nbsp;</p>", "parentCommentId": "kKwCu5Bb9tjH6m6ut", "user": {"username": "Karthik Sekar"}}, {"_id": "ZciWxdEBrxYLNMWFA", "postedAt": "2022-09-08T18:39:16.363Z", "postId": "ZgQFw6vRDo8hboPKK", "htmlBody": "<p>All of those things would still be possible under a hypothetical \"Bitcoin standard\". &nbsp;The difference is that they wouldn't be funded by limitless money-printing and runaway debt. &nbsp;<br><br>The goal of Bitcoin is essentially to create a digital version of the classical gold standard (the monetary system used by Europe, the US, and other countries, before 1914). &nbsp;Under that system,</p><ul><li>lending still happened;</li><li>governments still had the power to raises taxes for public projects; and</li><li>while governments would issue standardised notes that represented fixed amounts of gold, they weren't able to inflate the gold supply itself.</li></ul><p>&nbsp;Incidentally, that era is regarded as one of the most peaceful and innovative in human history - it's referred to as the \"Belle Epoque\" in Europe, and as the \"Gilded Age\" in the US. &nbsp;&nbsp;<br><br>All that having been said: theorising is fun, but the success or failure of a currency ultimately depends on whether the individuals using it find that it serves their needs. &nbsp; Right now, there are many people around the world whose local currencies are clearly not serving their needs - but because money is currently a government monopoly, these people don't have an alternative. &nbsp;The point of Bitcoin, then, is simply to give people a choice.</p>", "parentCommentId": "cXDJKJWTEvNLzC7gm", "user": {"username": "Alex Gunner"}}, {"_id": "w8SyTvPK9CZs8zJAa", "postedAt": "2022-09-21T13:01:14.644Z", "postId": "ZgQFw6vRDo8hboPKK", "htmlBody": "<p>1)</p><blockquote><p>poor, unstable governance is the ultimate pathology to treat, and Bitcoin is a potential ointment for (some) resultant symptoms.</p></blockquote><blockquote><p>Are we better off investing into anti-corruption projects or the democracy improvement ones?</p></blockquote><p>&nbsp;A sound monetary system is a crucial element of a healthy democracy.</p><p>It is not enough to address these problems simply with better governance. &nbsp;An institution is vulnerable to the extent that it relies on a small group to govern responsibly; the aim of political reform is instead to construct a system that cannot be hijacked by the incompetent or authoritarian actors that it will inevitably encounter. &nbsp;The most foolproof way of doing that is to make it impossible (e.g. by technological means) for any single entity to wield such power in the first place.</p><p>That’s precisely the approach that Bitcoin takes: instead of relying on political leaders to self-regulate, or counting on imperfect carrot-and-stick institutions to police good governance, Bitcoin ends the government monopoly on money altogether. &nbsp;Instead of hoping that people vote more rationally, Bitcoin appeals to people’s economic self-interest, offering a way out of their failing monetary systems.&nbsp;</p><p>As a result, Bitcoin is perhaps the only effective measure that could help to democratise societies that are hostile to reform. &nbsp;Members of Effective Altruism have offered many suggestions for strengthening democracy in nations where there is already some kind of avenue for popular change. &nbsp;But when it comes to authoritarian states where the ruling regimes show no interest in ceding power, we seem to have had no answers until now. &nbsp;Bitcoin is unusual in that it initiates institutional change from the ground up; governments can no more stop its proliferation than they can switch off the Internet. &nbsp;It is no accident that the nations most hostile to Bitcoin tend to be the most authoritarian ones.</p><p>2)</p><blockquote><p>I see other issues that need to be worked out, for example, governments being able to tax fairly to pay for social goods such as schools and health care.</p></blockquote><p>I don’t see how fairer taxation is made more challenging by Bitcoin. &nbsp;Decentralised money is not an aberration that humanity has never seen before – we’ve been there for most of human history (commodity money, such as gold, is fundamentally decentralised). &nbsp;Bitcoin is essentially trying to create a digital version of the classical gold standard that prevailed until 1914. &nbsp;Lending, taxation, and public works still happened in that era – if anything, it was a relatively peaceful and prosperous time. &nbsp;There is no reason to believe the same would not be possible when using Bitcoin. &nbsp;Government-enforced paper money, on the other hand, <i>is </i>an aberration, and one that has <a href=\"https://en.wikipedia.org/wiki/Fiat_money#History\">consistently resulted in rapid devaluation</a> (as we are seeing right now).</p><p>3)</p><blockquote><p>Any sort of \"customer service\" will require a middle man, i.e. a brokerage or institution. It's not like we can retrofit the blockchain to have a \"Forgot my Password\" feature.&nbsp;</p></blockquote><p>I've added this to the appendix:</p><blockquote><p>8. &nbsp;<i>“If you lose your private key, you lose your bitcoins forever”</i></p><ul><li>Then take care not to lose your private key. &nbsp;Alternatively, use custodial wallets: services where your private keys are held by an institution, similarly to how you might entrust your savings to a bank. &nbsp;Multi-signature wallets also allow you to spread your risk between several keys or people. &nbsp;That said, the option to take sole responsibility for your savings is the fundamental point, and the problem is that it's not currently available to people who need it.</li></ul></blockquote>", "parentCommentId": "DDFB3x8rW8rzgDiZR", "user": {"username": "Alex Gunner"}}]