[{"_id": "szsBXRhmX5asEJBrd", "postedAt": "2022-12-27T10:23:22.286Z", "postId": "ZHeWGCCanuBj65rQH", "htmlBody": "<p>My sense is that there isn't a consensus. ACE could be better, but absent a competitor which is unlikely to come into existence, looking at their <a href=\"https://animalcharityevaluators.org/donation-advice/recommended-charities/\">top and standout charities</a> isn't a bad starting point, or an endpoint if you don't want to do research yourself. Among these, I particularly like the <a href=\"https://www.fishwelfareinitiative.org/\">Fish Welfare Initiative</a> because I intuit that it's particularly valuable from a risk-neutral perspective. Your mileage may vary.</p>", "parentCommentId": null, "user": {"username": "NunoSempere"}}, {"_id": "EDnhMySCvgdcSL4kY", "postedAt": "2022-12-27T11:51:18.024Z", "postId": "ZHeWGCCanuBj65rQH", "htmlBody": "<p>In 2018, someone expressed concerns with ACE's research (<a href=\"https://forum.effectivealtruism.org/posts/zri7LsivEAqnYZ6Wt/concerns-with-ace-research\">link</a>) and ACE responded to these concerns (<a href=\"https://forum.effectivealtruism.org/posts/Sur4yHbkWL7bpRoby/ace-s-response-to-john-halstead\">link</a>). I vaguely remember they were relying too heavily on the cost-effectiveness of things like leafletting and online ads, which later turned out to be not as cost-effective as initially thought. There was also the criticism that they did not independently check the charity's claims about how successful corporate campagins are. (e.g. if corporates follow through)</p>\n<p>ACE has a more challenging task than GiveWell regarding evidence-based charity. There has been much more research from RCTs and other studies in global health and development, than in animal welfare. However, has been a lot of progress in corporate campagns in recent years, so I guess ACE can build upon a larger evidence base now than they could back in 2018.</p>\n<p>There was also criticism about ACE's approach to social justice. See <a href=\"https://forum.effectivealtruism.org/posts/5iCsbrSqLyrfP55ry/concerns-with-ace-s-recent-behavior-1\">here</a> and please also note the edits and responses linked on the top. As always, social justice is a sensitive topics.</p>\n<p>I personally decided to trust ACE's assessment of charities.</p>\n<p>See also this <a href=\"https://forum.effectivealtruism.org/posts/LNbzDCgCH2py3cnJv/where-are-you-donating-this-year-and-why-open-thread#FBAFH4bEA7F9r3xq4\">recent comment</a> .</p>\n", "parentCommentId": null, "user": {"username": "Imma Six"}}, {"_id": "r2SucmbJPA3w8Kh9d", "postedAt": "2022-12-27T11:53:40.150Z", "postId": "ZHeWGCCanuBj65rQH", "htmlBody": "<p>You can also publish this post as a question :)</p>\n", "parentCommentId": null, "user": {"username": "Imma Six"}}, {"_id": "rrw2smDqAPtBTms4e", "postedAt": "2022-12-27T11:54:18.149Z", "postId": "ZHeWGCCanuBj65rQH", "htmlBody": "<p>Thanks!</p>\n", "parentCommentId": "szsBXRhmX5asEJBrd", "user": {"username": "Frederik"}}, {"_id": "3rsqfekG2CBoW56S3", "postedAt": "2022-12-27T12:00:40.610Z", "postId": "ZHeWGCCanuBj65rQH", "htmlBody": "<p>Oops! I was under the impression that I had done that when clicking on \"New question\". But maybe something somewhere went wrong on my end when switching interfaces :D</p>\n", "parentCommentId": "r2SucmbJPA3w8Kh9d", "user": {"username": "Frederik"}}, {"_id": "3YFNcHn3mmKWSAJMj", "postedAt": "2022-12-27T12:01:41.218Z", "postId": "ZHeWGCCanuBj65rQH", "htmlBody": "<p>If you don't want to (fully) rely on ACE, you might want to look at the <a href=\"https://funds.effectivealtruism.org/funds/animal-welfare\">Animal Welfare Fund</a> or <a href=\"https://founderspledge.com/stories/animal-welfare-cause-report\">Founder's Pledge</a>. Also Open Philanthropy Project works on animal welfare.</p>\n", "parentCommentId": "szsBXRhmX5asEJBrd", "user": {"username": "Imma Six"}}, {"_id": "KDKfhAZxYNuaz6Gv3", "postedAt": "2022-12-27T12:02:26.177Z", "postId": "ZHeWGCCanuBj65rQH", "htmlBody": "<p>Is there a way to this post-hoc, while keeping the comments in tact? Otherwise, I'd just leave it as is now that it already received answers.</p>\n", "parentCommentId": "r2SucmbJPA3w8Kh9d", "user": {"username": "Frederik"}}, {"_id": "dumCcFhjxkEyLFXek", "postedAt": "2022-12-27T12:38:37.550Z", "postId": "ZHeWGCCanuBj65rQH", "htmlBody": "<p>There has historically been some overlap between the charities that Open Phil and the Animal Welfare Fund have supported, and ACE's recommendations, which suggests that there is a degree of consensus. See also the discussion <a href=\"https://forum.effectivealtruism.org/posts/cGn5HrDKdCkaf3REy/announcing-our-2022-charity-recommendations?commentId=DEg9rgh4cyMjY4vjg#comments\">here</a>, in which some endorse the changes that ACE has made to its methodology.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Vidur_Kapur"}}, {"_id": "iRBvXDSJiCyCShxfo", "postedAt": "2022-12-27T14:56:35.817Z", "postId": "ZHeWGCCanuBj65rQH", "htmlBody": "<p>Thanks for asking this, the comments surfaced some criticisms of ACE that I wasn't aware of.</p><p>I <a href=\"https://forum.effectivealtruism.org/posts/LNbzDCgCH2py3cnJv/where-are-you-donating-this-year-and-why-open-thread?commentId=uEFLj88iCXDwXmwFy\">split my 2022 animal welfare contributions </a>between ACE and Direct Action Everywhere, with more going to ACE; I agree with a commenter below that they're the best we have. Still good to be aware of some common criticisms and concerns.</p>", "parentCommentId": null, "user": {"username": "setgree"}}, {"_id": "7rTN7WvFWHNk3AjbZ", "postedAt": "2022-12-29T19:56:08.123Z", "postId": "ZHeWGCCanuBj65rQH", "htmlBody": "<p>It's a complicated question, I think in the animal movement there are a variety of different \"<a href=\"https://forum.effectivealtruism.org/posts/yq5NyHqEdewn6JBpn/pathways-to-victory-how-can-we-end-animal-agriculture\">Pathways to Victory</a>\" and ongoing debates on what the most effective solutions are.</p><p>Realistically though your donation is counterfactually going to go further in neglected geographies so it may be worth looking towards Asia, Africa, Latin America and the Middle East.</p><p>Beyond that, you have your animal cause area (Wild, Farmed etc), intervention type (Direct help, Lobbying, Movement Building, Research, Education and so on), and stage of the organisation. Then, maybe, you're adding how talented and how much you trust the founders/staff and organisation.</p><p>So basically you're playing mix and match with the above based on what you think is effective.&nbsp;</p><p>Some Ideas:<br><br><a href=\"https://www.animalallianceasia.org/\">https://www.animalallianceasia.org/</a> - Asian capacity building, are starting a regranting program, so could see what effective orgs there are in Asia through them.</p><p><a href=\"https://www.animaladvocacyafrica.org/\">https://www.animaladvocacyafrica.org/</a> - African capacity building, we're looking to regrant in 2023 and have a funding gap for it, I'm a co-founder so am slightly biased! (<a href=\"https://www.animaladvocacyafrica.org/our-reach\">Orgs to look at in Africa</a>)</p><p><a href=\"https://www.sinergiaanimalinternational.org/\">https://www.sinergiaanimalinternational.org/</a> - Doing work In Latin America and Asia (I'm least familiar with south America as a region) but could be a good touchpoint to find effective programs there.</p><p><a href=\"https://funds.effectivealtruism.org/funds/animal-welfare\">https://funds.effectivealtruism.org/funds/animal-welfare</a> - If you don't know where to give or want to evaluate this is a great bet, they fund a lot of early work that probably wouldn't happen without them</p><p><a href=\"https://animalcharityevaluators.org/donation-advice/ace-movement-grants/\">https://animalcharityevaluators.org/donation-advice/ace-movement-grants/</a> - Imo they have improved their granting and evaluation criteria recently, I think now an EA is a primary evaluator (but not sure), it's not perfect but I think it's a lot better than it historically has been</p><p><a href=\"https://kafessizturkiye.com/\">https://kafessizturkiye.com/</a> - Turkish org doing cage-free, I've met the founder, and he is a great advocate</p><p>Just some orgs/areas I'd be looking to if I were to donate, but it strongly depends on your personal and moral thoughts on what works and what doesn't. For example, I'm more interested in meta, movement building orgs as I believe we're quite early stage to ending animal agriculture, but there are tons of other different types of organisations as well, like fish/shrimp welfare, Animal Ask, alt protein, Cage-free movements like THL and so on.</p>", "parentCommentId": null, "user": {"username": "Cameron.K"}}]