[{"_id": "toZXqdFdk4ESjFgiF", "postedAt": "2022-10-17T17:08:49.235Z", "postId": "ZhNaizQgYY9dXdQkM", "htmlBody": "<p>I think this is exceptionally well-written, compelling and informative. Fantastic job!</p>", "parentCommentId": null, "user": {"username": "Fergus"}}, {"_id": "xXraGE8gkgmMeCbne", "postedAt": "2022-12-11T21:44:26.103Z", "postId": "ZhNaizQgYY9dXdQkM", "htmlBody": "<p>\"For instance, some charities help 100 or even 1,000 times as many people as others, when given the same amount of resources\"<br><br>Someone told me that an EA org is about to publish an article saying this isn't true.</p>", "parentCommentId": null, "user": {"username": "nathan"}}, {"_id": "bswHEABFNx28aNwJW", "postedAt": "2022-12-12T00:24:48.111Z", "postId": "ZhNaizQgYY9dXdQkM", "htmlBody": "<p>See also <a href=\"https://tinyurl.com/3wxtsp35\"><u>Why Charities Usually Don't Differ Astronomically in Expected Cost-Effectiveness</u></a>, mentioned in <a href=\"https://forum.effectivealtruism.org/s/x3KXkiAQ6NH8WLbkW/p/QRSBgzkGjF3adwM4q#Criticisms_of_the_use_of_cost_effectiveness_estimates\">Criticisms of the use of cost-effectiveness estimates</a>, at the end of Chapter 2</p>", "parentCommentId": "xXraGE8gkgmMeCbne", "user": {"username": "Lorenzo Buonanno"}}, {"_id": "pLrYeYQyFj2x6FHRH", "postedAt": "2022-12-19T14:42:00.142Z", "postId": "ZhNaizQgYY9dXdQkM", "htmlBody": "<ol>\n<li>I agree with the essence and future of artificial intelligence,which needs modifications towards efficiently serving and managing the excesses accruing from it's usage.</li>\n<li>I agree on looking onto issues ,surrounding factory farming,which needs to proper assessment and handling issues around it.</li>\n<li>I agree on , finding ways to improving decision making, in various ramifications.\n4.finally ,I agree on values that unite effective altruism</li>\n</ol>\n", "parentCommentId": null, "user": {"username": "Zumji "}}, {"_id": "Hda67AjnGhYoaXhji", "postedAt": "2023-01-11T07:48:19.568Z", "postId": "ZhNaizQgYY9dXdQkM", "htmlBody": "<p>More efforts should be put into ending factory farming, it's a big contributor to climate change other than animal suffering.&nbsp;</p>", "parentCommentId": null, "user": {"username": "saline_A"}}, {"_id": "WQ6ZY76X267i4CPsY", "postedAt": "2023-01-25T02:04:15.619Z", "postId": "ZhNaizQgYY9dXdQkM", "htmlBody": "<p>When we serve others, we often do so in expectation of personal benefit... The senses of connectedness, worth, well-being, and so on, that can arise.  Not to mention the visceral appreciation of others' lives by serving them individually.  Personal service to others is vital and worthy.  Please do not minimize it.</p>\n<p>A key value to consider in all efforts is their sustainability.  An effort that does not nourish the altruist should not continue.  Merely emphasizing maximum instantaneous benefit to the recipient does not maximize long term benefit of the needs of the altruist are not also part of the equation.</p>\n<p>I'm grateful for some related content in the FAQ referenced here.  But I believe if you're going to examine our whole system of altruism, you need to view the servant as part of that system.</p>\n<p>I commend to you  the book  Standing at the Edge by Joan Halifax for lots more about sustainable service.</p>\n", "parentCommentId": null, "user": {"username": "Lee Marshall"}}, {"_id": "c9xzkL7MaH4mXJpub", "postedAt": "2023-02-23T01:00:09.262Z", "postId": "ZhNaizQgYY9dXdQkM", "htmlBody": "<p>Great article, and easy to understand. I believe more emphasis should be placed on not just ending factory farming, but on strengthening non human animal rights. Furthermore, apart from the cruelty involved in animal agriculture, it is a major contributor to climate crisis and future pandemics.</p>", "parentCommentId": null, "user": {"username": "farah"}}, {"_id": "NWa2a2iii9XooHQRS", "postedAt": "2023-05-25T10:42:54.085Z", "postId": "ZhNaizQgYY9dXdQkM", "htmlBody": "<p>I fully agree with this! It's also key to solving many different issues - animal suffering, climate change, and nutrition-related illnesses&nbsp;</p>", "parentCommentId": "Hda67AjnGhYoaXhji", "user": {"username": "Rosalind95"}}, {"_id": "wsY9ixZmfuou2ozJN", "postedAt": "2023-06-06T22:23:59.369Z", "postId": "ZhNaizQgYY9dXdQkM", "htmlBody": "<p>That is such an interesting light to shine on this perspective. It really sends home the drive to serve as an advocate to end animal farming.</p>", "parentCommentId": "NWa2a2iii9XooHQRS", "user": {"username": "PiltoverQueen"}}, {"_id": "XXksFkCkZMpHwBkqH", "postedAt": "2023-06-06T22:26:10.364Z", "postId": "ZhNaizQgYY9dXdQkM", "htmlBody": "<p>The two causes that have really caught my eye are the AI alignment problem and improving decision making. I'd never fully realized just how interesting and impactful these issues are.&nbsp;</p>", "parentCommentId": null, "user": {"username": "PiltoverQueen"}}, {"_id": "aMevX2FzdQm4RKksp", "postedAt": "2023-08-09T09:40:50.775Z", "postId": "ZhNaizQgYY9dXdQkM", "htmlBody": "<p>The article highlights the proactive approach of identifying significant yet overlooked global challenges and seeking optimal solutions, while tailoring contributions to match personal resources. This thoughtful approach can yield substantial impacts, potentially saving numerous lives throughout one's career.</p><p>Furthermore, the article encourages collaboration within the community to collectively address critical contemporary challenges. By uniting efforts, individuals can actively participate in tackling some of society's most pressing issues, thus playing a pivotal role in shaping a better future. Overall, this article resonates as an inspiring call to action for effecting meaningful change through purposeful and strategic altruism.</p>", "parentCommentId": null, "user": {"username": "Fatmeh Shaal"}}, {"_id": "bZQznvQxiseMkWikx", "postedAt": "2023-08-20T23:01:53.650Z", "postId": "ZhNaizQgYY9dXdQkM", "htmlBody": "<p>I love what I am exposing myself to via Effective Altruism Rwanda.</p>", "parentCommentId": null, "user": {"username": "FrankGreat "}}, {"_id": "pKr29uWDWn8zdALhj", "postedAt": "2023-10-07T16:06:07.509Z", "postId": "ZhNaizQgYY9dXdQkM", "htmlBody": "<p>I feel like poverty or low quality-of-life should be in the list of examples.</p>", "parentCommentId": null, "user": {"username": "Andreas Chrysopoulos"}}, {"_id": "M2tEhpjdZeLGG5Tno", "postedAt": "2023-10-09T18:15:05.991Z", "postId": "ZhNaizQgYY9dXdQkM", "htmlBody": "<p>I agree that helping the largest number of people in need on a particular issue is important. &nbsp;I think we also need to consider both the resources we have available to us and the area of geography that we are needing to align with. &nbsp; Our Foundation is restricted to a specific geography based on government direction and historical relationships. &nbsp;Within this geography there may be more need is certain areas than others, but either there are others that are helping to meet this need in that area while there are few helping to meet this need in a area of lower population. &nbsp; So we look to fill gaps where we think we can have an impact even if the numbers helped are lower. &nbsp;</p>", "parentCommentId": null, "user": {"username": "Barry Ross"}}, {"_id": "ZWvmcHX7oc5GbJNWL", "postedAt": "2024-01-25T14:54:40.845Z", "postId": "ZhNaizQgYY9dXdQkM", "htmlBody": "<p>Very good introduction to effective altruism. However, I was thinking about the example of the spending on counter terrorism and pandemics prevention. The low number of deaths by terrorism could be due to the large spending on counter terrorism so if we allocate such spending in pandemic prevention the number of terrorism victims could increase. How to know how much resources to re-allocate for optimal distribution?</p>", "parentCommentId": null, "user": {"username": "lamparita"}}, {"_id": "XEgf8NWZEuJwmjohp", "postedAt": "2023-07-21T12:25:33.362Z", "postId": "ZhNaizQgYY9dXdQkM", "htmlBody": null, "parentCommentId": null, "user": null}]