[{"_id": "SQuHvBxM59WB29CvR", "postedAt": "2018-03-21T12:48:01.720Z", "postId": "ZidxqR8utH8CCkf3X", "htmlBody": "<p>Impressive work - I especially liked the graphs. For humane space colonization, rather than photosynthesis, it would be far more efficient to use solar or nuclear electricity for direct chemical synthesis of food or powering electric bacteria. One non-space colonization motivation would include <a href=\"http://allfed.info/total-food-production-loss/\">agricultural catastrophes</a>. Outside a catastrophe, it would likely be more fossil energy intensive than growing plants, but maybe not than producing animals. And it would be far less fossil energy intensive than artificial light growing of plants, which people are working on.</p>\n", "parentCommentId": null, "user": {"username": "Denkenberger"}}, {"_id": "mfSFedSRK478ninYF", "postedAt": "2018-03-25T09:49:59.130Z", "postId": "ZidxqR8utH8CCkf3X", "htmlBody": "<p>Cool, thank you! Have you written about direct chemical synthesis of food or can you recommend some resources to me?</p>\n", "parentCommentId": "SQuHvBxM59WB29CvR", "user": {"username": "Telofy"}}, {"_id": "iZCsdXyNPaJvv5r3L", "postedAt": "2018-03-26T00:30:39.556Z", "postId": "ZidxqR8utH8CCkf3X", "htmlBody": "<p>From my <a href=\"https://en.wikipedia.org/wiki/Feeding_Everyone_No_Matter_What\">book</a>: &quot;Synthetic food production refers to using chemical synthesis. Sugar has been synthesized from noncarbohydrates for decades (Hudlicky et al., 1996).\nHudlicky, T., Entwistle, D.A., Pitzer, K.K., Thorpe, A.J., 1996. Modern methods of monosaccharide synthesis from non-carbohydrate sources. Chem. Rev. 96, 1195–1220.&quot;\nI didn't write much because I don't know enough about catalysis to say whether it can be ramped up quickly in a catastrophe. But for space colonization, that is not an issue.</p>\n", "parentCommentId": "mfSFedSRK478ninYF", "user": {"username": "Denkenberger"}}, {"_id": "EEDHFFwYRQaSKTdjW", "postedAt": "2018-03-30T08:30:39.866Z", "postId": "ZidxqR8utH8CCkf3X", "htmlBody": "<p>Awesome, thank you!</p>\n", "parentCommentId": "iZCsdXyNPaJvv5r3L", "user": {"username": "Telofy"}}, {"_id": "TuwMHHfBRjGSooNNZ", "postedAt": "2018-08-28T11:58:20.256Z", "postId": "ZidxqR8utH8CCkf3X", "htmlBody": "<p>I am still not finished with the article, just want to share a novel approach to prioritization using network theory that I found today, shared by World Bank, and got quite excited about it. </p>\n<p>It is an application of network theory in prioritization of Sustainable Development Goals with counter-intuitive conclusions for people used to reasoning along the lines of cost-benefit estimates, like the ones by Copenhagen Consensus. In short, goals like affordable clean energy and sanitation are central to many of the SDGs and can thus increase probabilities of their achievement.\n<a href=\"http://sdg.iisd.org/news/world-bank-paper-tests-methodology-for-prioritizing-sdgs-indicators/\">http://sdg.iisd.org/news/world-bank-paper-tests-methodology-for-prioritizing-sdgs-indicators/</a> </p>\n<p>&quot;The authors note that the extent to which capacities can be used between SDGs is dependent on their proximity to one another. They define “SDG proximity” as the conditional probability of two indicators being “successful” together, a function of the commonalities shared. For example, the indicator “number of physicians per 1,000 people” is likely to have more commonalities with—and be closer in proximity to—an indicator to measure malnutrition than it would with one on marine protected areas.</p>\n<p>If a country performs well on a Goal or indicator with many “proximities,” the country is likely to also achieve progress in others.</p>\n<p>The sum of a Goal’s proximities provides its measure of “SDG centrality,” the paper explains. If a country performs well on a Goal or indicator with high centrality, the country is likely to also achieve progress in others. SDGs 7 (affordable and clean energy) and 6 (clean water and sanitation) are calculated to be the most “central,” while Goals 1 (no poverty) and 13 (climate action) are calculated to be the least central.</p>\n<p>The highest-ranked indicators in terms of centrality relate to access to electricity, and populations using improved drinking water sources. The least central indicators address varied themes, including gender parity, disaster risk reduction strategies, education, time spent on unpaid domestic work, employment in agriculture, malaria incidence rates, and the number of breeds classified as being not-at-risk of extinction, among others. However, the authors caution against “writing off” an SDG or indicator as irrelevant simply because it features limited connections.</p>\n<p>To prioritize actions, the authors cite the importance of an SDG’s “density” in a country. This is defined on the basis of the Goal’s proximities to others in which the country is successful. It will be easier to make progress on a high-density SDG than a low-density SDG. The paper suggests that governments can use the concepts of SDG proximity, centrality and density to redeploy SDG delivery mechanisms or other capacities, in order to maximize impact.&quot; </p>\n<p>I quickly summarized &quot;four modes of thinking&quot; about prioritization here: Sequence Thinking vs Cluster Thinking (both &quot;horizontal&quot;) and Analytic Thinking vs. Synthetic/Systemic Thinking (both vertical) and used the above example <a href=\"https://medium.com/giving-on-the-edge/four-modes-of-thinking-about-cause-prioritization-8b9f81abd6b0\">https://medium.com/giving-on-the-edge/four-modes-of-thinking-about-cause-prioritization-8b9f81abd6b0</a></p>\n", "parentCommentId": null, "user": {"username": "jaksim_duplicate0.9774940011688109"}}, {"_id": "xuXPreRNedMxdpoWj", "postedAt": "2018-09-02T16:27:50.387Z", "postId": "ZidxqR8utH8CCkf3X", "htmlBody": "<p>Oh, cool! I'm reading that study at the moment. I'll be able to say more once I'm though. Then I'll turn to your article. Sounds interesting!</p>\n", "parentCommentId": "TuwMHHfBRjGSooNNZ", "user": {"username": "Telofy"}}]