[{"_id": "oyuwpZcgb9fL5PHqu", "postedAt": "2023-05-02T17:26:22.324Z", "postId": "ZKYpu4WAiwTXDSrX8", "htmlBody": "<p>Thanks this is brilliantly articulated and also fun to read. The sad thing is that strong arguments can be made for the expected value of many forms of smart, even semi-revolutionary activist methods (and have been on this forum) but like you said they seem not keen to engage with our framework at all.</p>\n<p>Perhaps they should have hired you to help them write more compelling book!</p>\n<p>I have one observation about your use of the term \"social justice\" which surprised me a little. The way I used to use the word at least, I would consider effective altruism's approach to be an effective \"social justice\" approach, to rectify social injustices like kids dying from malaria and factory farming. But your use (and perhaps the generally accepted use now) is very different. Like here...</p>\n<p>\"We should fully expect maximizing welfare to generate complaints about “inequitable cause prioritization” (p. 82) from those who care more about social justice.\"</p>\n<p>I would have thought of maximizing welfare to be one form of social justice, and they would certainly not be mutually exclusive, but apparently the term now has more sinister connotations. When I think of social justice, I think of MLK, Ghandi and Mandela, all pragmatic activists who were wildly successful at creating lasting change with a cost effectiveness and scale that should make effective altruists salivate. I find it sad that \"social justice\" these days seems to carry the baggage of something like a...</p>\n<p>Far-left-slightly-unstable-person-ranting-on-the-internet-about-identity-politics</p>\n<p>And \"social justice warrior\" seems to be even worse. Until 15 years ago I would have been proud to identify as a social justice warrior, ie someone who thoughtfully and effectively fights injustice against animals, malaria deaths as well as racial inequity, but I fear the politicisation and pigeonholing of the term may now be irreversible.</p>\n<p>Mind you I've lived in Uganda for the last 10 years and so perhaps I'm just behind on a legitimate evolution of the English language!</p>\n<p>Would be interested to hear your thoughts.</p>\n", "parentCommentId": null, "user": {"username": "NickLaing"}}, {"_id": "rXajjm9QeESjNmDum", "postedAt": "2023-05-02T18:58:02.182Z", "postId": "ZKYpu4WAiwTXDSrX8", "htmlBody": "<p>Thanks for writing this up Richard. There was a plan a few months ago on the forum to divide and conquer the book, and maybe post up a joint review, but it fell by the wayside. That's partly due to real-life being higher priority, but I also got ground down by the hostile nature of the book - and slogging through it to reproduce the arguments just wasn't going to happen. I welcome attempts to steelman parts of this book<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnref3szvx3qktu5\"><sup><a href=\"#fn3szvx3qktu5\">[1]</a></sup></span>, or associated works, as I do think it is important for EA to understand and to engage with our critics.</p><p>I think there are some good bits in there that are worth understand where critical/leftist challenges to Effective Altruism come from. Srinivasan's foreword is a good outline of a 'low decoupling' challenge to the analytic philosophy approach that's core to a lot of EA thinking, and I found Simone de Lima's Chapter 2 the highlight of what I read - I think that the Chapter title does it an injustice. I'd encourage people to read David Thorstad's <a href=\"https://ineffectivealtruismblog.com/2023/03/25/the-good-it-promises-the-harm-it-does-part-2-simone-de-lima/\">review of that chapter</a> for a charitable/steelman reading of it. In many places, especially the end of Chapter 17, the contributors are clear that they view Capitalism as the primary source of evil - and that this is a self-evident moral fact, and it's a pretty clear crux to understand their point-of-view.</p><p>But yeah, a lot of it is just... really, really bad. I'm going to single out Crary's Chapter 16 <i>\"Against Effective Altruism\"</i> here. I believe it's mostly a reproduction of a previous essay (perhaps with small changes) that are already in the public domain.<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnref214q5zsopll\"><sup><a href=\"#fn214q5zsopll\">[2]</a></sup></span>&nbsp;Some points that are especially egregious to me:</p><ul><li>Crary presents the 'Institutional' and 'Philosophical' critiques, before combining them into her 'Composite' critique that is meant to carry the weight of both. But there's very little evidence cited for it at all - for the Composite Critique the main argument is that it <i>\"finds extensive support in philosophical reflection about the social sciences\"</i>, such as the Frankfurt school, which... will do very little to persuade many EAs. If the choice is between EA or the Frankfurt school, then that's a very easy choice.</li><li>Much like the rest of the book, there's an assumption that Capitalism is wrong, and that any deviations from removing it are of very little moral value. Instead of working with animal industries, we should be working for complete abolition. Instead of donating to Give Directly, we should be undoing the Bretton Woods organisations. This is, as you say, just a testimonial of their anti-capitalist perspective, and reads more as a rallying cry for fellow critics of EA to join the fight against it, rather than a consideration of <i>whether EA is right at all.</i></li><li><strong>In particular, </strong>Crary keeps calling EA morally corrupt throughout her piece. Perhaps I have too naïve a view of the academy - but this seems beyond the pale. Any academics who are reading this, how often have mentors/reviewers/interlocutors called your work <i>\"a textbook case of moral corruption\"</i>? What do you think would happen if they did? In her reference to this, she quotes the original source of the idea as saying that this isn't villifying any individuals and - well, my response is \"yeah right\". You should know you're playing with fire when you use that kind of language, and cowardly hiding a get-out-of-jail free card in your citations about how your terminology doesn't mean what it usually means doesn't cut it. Calling what someone believes as 'moral corruption' is a serious and harmful attack. &nbsp;</li><li>Her quip at the end, that accepting her philosophical critiques and changing the way EA works would allow it <i>\"finally a step toward doing a bit of good\" </i>is I think both historically wrong and frankly insulting to the good work that EA individuals and organisations have done.</li></ul><p>I honestly think that Crary's article might be one of worst anti-EA articles I've read and boy is that saying something, because there are a lot. As I said in the intro maybe someone can make a stronger case for it, it definitely riled me up, but it may honestly just be as bad an article as it seems.&nbsp;</p><p>There is one final point worth considering though. There's a meme in some rationalist-spaces that EAs are \"quokkas\" - which I don't like<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefyavw3lnwgq\"><sup><a href=\"#fnyavw3lnwgq\">[3]</a></sup></span>, but it may have a kernel of truth if we're so \"turn the other cheek, don't fight noise with noise\" etc. I want to suggest that EA should take a stronger response to this kind of critique in the future. I think the current line is to just not respond to this kind of thing? But I think we're big enough as a movement where our criticism is also noticeable, and will on its own persuade critics. I think it was completely avoidable for someone as prominent as Timnit Gebru to <a href=\"https://twitter.com/timnitGebru/status/1614366414671937536\">call us all fascists</a>. &nbsp;Instead, we should be pushing back on prominent criticisms that are clearly wrong and beyond the pale - and do so clearly but forcefully. In short, in cases like this, we may have too many Darwins and not enough Huxleys.</p><p>&nbsp;</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fn3szvx3qktu5\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnref3szvx3qktu5\">^</a></strong></sup></span><div class=\"footnote-content\"><p>Hopefully we can find someone in addition to Thorstad willing to give it a go?</p></div></li><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fn214q5zsopll\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnref214q5zsopll\">^</a></strong></sup></span><div class=\"footnote-content\"><p>The earliest source I could find was <a href=\"https://www.youtube.com/watch?v=JuK4fiT5Wtw\">this talk</a>, but the article also appeared in <i>Radical Philosophy</i> <a href=\"https://www.radicalphilosophy.com/article/against-effective-altruism\">in 2021</a>.</p></div></li><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnyavw3lnwgq\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefyavw3lnwgq\">^</a></strong></sup></span><div class=\"footnote-content\"><p>Clarification - I don't like the use of this term pejoratively. Quokkas themselves are objectively adorable.</p></div></li></ol>", "parentCommentId": null, "user": {"username": "JWS"}}, {"_id": "rdqERdqSzvk8eKs4A", "postedAt": "2023-05-02T19:13:30.532Z", "postId": "ZKYpu4WAiwTXDSrX8", "htmlBody": "<p>Just putting up a link of <a href=\"https://forum.effectivealtruism.org/posts/YFGkyDjKvsr9tHzkS/book-post-the-good-it-promises-the-harm-it-does-critical\">this previous post about this book</a>, on which there was quite a bit of discussion in the comments.</p>", "parentCommentId": null, "user": {"username": "Erich_Grunewald"}}, {"_id": "jLPm96BwLiahBXDQ3", "postedAt": "2023-05-02T19:49:02.926Z", "postId": "ZKYpu4WAiwTXDSrX8", "htmlBody": "<p>It seems one of the core ideas you describe here corresponds directly to “Explicit vs implicit prioritisation” from my post, “a socialist’s view on liberal progressive criticisms of EA” (<a href=\"https://forum.effectivealtruism.org/posts/f58guFdECnXgsjn2v/a-socialist-s-view-on-liberal-progressive-criticisms-of-ea\">https://forum.effectivealtruism.org/posts/f58guFdECnXgsjn2v/a-socialist-s-view-on-liberal-progressive-criticisms-of-ea</a>).</p>\n<p>From your post  it seems this set of essays is more primarily aimed at informing other American liberal-progressive social justice types that some EA principles differ from theirs, and these essays aren’t really aimed at convincing EAs or others that EA should do things differently.</p>\n", "parentCommentId": null, "user": {"username": "freedomandutility"}}, {"_id": "Ez9N4knhREE2eoJS8", "postedAt": "2023-05-02T19:56:57.243Z", "postId": "ZKYpu4WAiwTXDSrX8", "htmlBody": "<blockquote><p>There’s a larger issue (not really addressed in this volume) of when it makes sense for a funder to go “all in” on their best bets vs. when they’d do better to “diversify” their philanthropic portfolio. This is something EAs have discussed a bit before (often by making purely theoretical arguments that the “best bet” maximizes expected value), but I’d be excited to see more work on this problem using different methodologies, including taking into account the risk of “model error” or systemic bias in our initial EV estimates. (Maybe such work is already out there, and I just don’t know about it? The closest I can think of is <a href=\"https://www.openphilanthropy.org/research/worldview-diversification/\">Open Philanthropy’s work on worldview diversification</a>, which I like a lot.)</p></blockquote><p>There's also <a href=\"https://forum.effectivealtruism.org/posts/8Ban7AnoqwdzQphsK/we-can-do-better-than-argmax\">We can do better than argmax</a>, but yeah, seems like surprisingly little discussion so far on such an important topic.</p>", "parentCommentId": null, "user": {"username": "Erich_Grunewald"}}, {"_id": "ePfehHiry4gTFDHca", "postedAt": "2023-05-02T21:01:07.091Z", "postId": "ZKYpu4WAiwTXDSrX8", "htmlBody": "<p>It is sometimes hard for communities with very different beliefs to communicate. But it would be a shame if communication were to break down.</p><p>I think it is worth trying to understand why people from very different perspectives might disagree with effective altruists on key issues. <a href=\"https://ineffectivealtruismblog.com/category/my-papers/the-good-it-promises/\">I have tried</a> on my blog to bring out some key points from the discussions in this volume, and I hope to explore others in the future.</p><p>I hope we can bring the rhetoric down and focus on saying as clearly as possible what the main cruxes are and why a reasonable person might stand on one side or another.&nbsp;</p>", "parentCommentId": null, "user": {"username": "David Thorstad"}}, {"_id": "MDLdr7zgaHCTjFenW", "postedAt": "2023-05-02T21:05:16.926Z", "postId": "ZKYpu4WAiwTXDSrX8", "htmlBody": "<p>I liked your comment but disagree with this part:</p><blockquote><p>I welcome attempts to steelman parts of this book<a href=\"https://forum.effectivealtruism.org/posts/ZKYpu4WAiwTXDSrX8/review-of-the-good-it-promises-the-harm-it-does#fn3szvx3qktu5\"><sup>[1]</sup></a>, or associated works, as I do think it is important for EA to understand and to engage with our critics.</p></blockquote><p>I think \"steelmanning\" a view is not something we should generally strive to do, and I wish people stopped treating the inclination to \"steelman\" an opponent as a sign of epistemic virtue. \"Steelmanning\" is a pretty poor hueristic for many reasons, including that (1) it lacks the resources to distinguish views that may deserve to be steelmanned from views that ought to be dismissed as nonsense; (2) it is an instance of countering a potential bias in one direction with a bias in the opposite direction, which will often result in excessive correction, insufficient correction, or unnecessary correction; and (3) it often impedes understanding and communication, since the \"steelmanned\" version of a view may bear little resemblance to what its proponent intended.</p><p>As superior alternatives to \"steelmanning\", I would suggest trying to pass the <a href=\"https://forum.effectivealtruism.org/topics/ideological-turing-test\">ideological Turing test</a>, writing a <a href=\"https://www.overcomingbias.com/p/write-your-hypothetical-apostasyhtml\">hypothetical apostasy</a>, and being willing to turn disagreements into <i>bets</i> (a practice which, to paraphrase Dr Johnson, \"concentrates the mind wonderfully\").</p>", "parentCommentId": "rXajjm9QeESjNmDum", "user": {"username": "Pablo_Stafforini"}}, {"_id": "cjrH39exeTrMfR5AD", "postedAt": "2023-05-02T21:31:17.003Z", "postId": "ZKYpu4WAiwTXDSrX8", "htmlBody": "<blockquote><p>This is something EAs have discussed a bit before (often by making purely theoretical arguments that the “best bet” maximizes expected value),</p></blockquote><p>Coincidentally, I recent wrote my (negative) perspective on worldview diversification here: &lt;<a href=\"https://nunosempere.com/blog/2023/04/25/worldview-diversification/\">https://nunosempere.com/blog/2023/04/25/worldview-diversification/</a>&gt;. It could be of interest.</p>", "parentCommentId": null, "user": {"username": "NunoSempere"}}, {"_id": "5D53fsKK8NY4aQjja", "postedAt": "2023-05-02T22:00:10.797Z", "postId": "ZKYpu4WAiwTXDSrX8", "htmlBody": "<p>It would be worth cross posting each blog post here!</p>\n", "parentCommentId": "ePfehHiry4gTFDHca", "user": {"username": "sjsjsj"}}, {"_id": "gZv6bFLvk5r5kxPsG", "postedAt": "2023-05-02T22:30:44.936Z", "postId": "ZKYpu4WAiwTXDSrX8", "htmlBody": "<blockquote><p>The second chapter tells us that featuring endorsements from attractive celebrities constitutes “body shaming, ableism, and sexism.” (p. 13)</p></blockquote><p><br>I haven't read the chapter or the book, but something like this just seems pretty plausible to me. By <i>disproportionately</i> featuring people filtered on the basis of a <a href=\"https://en.wikipedia.org/wiki/Lookism\">lookist</a><span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnref0hiy1af6xaga\"><sup><a href=\"#fn0hiy1af6xaga\">[1]</a></sup></span>&nbsp;selection process (e.g. their popularity in lookist industries, or partially directly based on how attractive we think they are to us or to society), we may be condoning and/or perpetuating (societal) lookism, and increasing its harms. And lookism of course overlaps with \"body shaming, ableism, and sexism\", e.g. people discriminate on the basis of how disabilities or other conditions <i>look</i>, which is ableist, and women and girls seem to be more often the targets of lookism and body shaming, which is sexist. By supporting a specific standard of beauty, we may invite comparisons to it, and so possibly body shaming.</p><p>However, featuring any attractive celebrities <i>at all</i> doesn't necessarily seem lookist. OTOH, it could be that attractive celebrities are so rare in the population we should be sampling from (and it's not clear what that is) that even featuring one would be very unlikely to happen other than through lookism at some step.</p><p>My guess is that our contribution to lookism here is very small relative to the impacts for animals (whether good or bad for animals).</p><p>I wonder if it would be acceptable to them if we offset our contributions to lookism (and/or \"body shaming, ableism, and sexism\") by supporting work against it, too. I'd guess it wouldn't be that costly to do, if fully offsetting just means not increasing lookism <i>on net</i>, rather than preventing every harm of lookism we'd (foreseeably?<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefemdeorism8r\"><sup><a href=\"#fnemdeorism8r\">[2]</a></sup></span>) cause.</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fn0hiy1af6xaga\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnref0hiy1af6xaga\">^</a></strong></sup></span><div class=\"footnote-content\"><p>Discrimination on the basis of physical attractiveness against those considered less attractive or in favour of those considered more attractive.</p></div></li><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnemdeorism8r\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefemdeorism8r\">^</a></strong></sup></span><div class=\"footnote-content\"><p>Trying to prevent every harm of lookism we'd cause, <i>including unforeseeable ones</i>, probably leads to decision paralysis, due to butterfly effects.</p></div></li></ol>", "parentCommentId": null, "user": {"username": "MichaelStJules"}}, {"_id": "gBXqT7t8XtPfzjhLG", "postedAt": "2023-05-02T22:41:49.126Z", "postId": "ZKYpu4WAiwTXDSrX8", "htmlBody": "<p>I disagree with this take, and fortunately now have a <a href=\"https://forum.effectivealtruism.org/posts/h8aTwFh5PkbifaPnk/in-favor-of-steelmanning\">post to link to</a>. I think steelmanning is a fine response to this situation.</p><p>I think your (3) is the one I spend the most time digging into in the post, and I feel quite confident is not a good reason not to steelman.</p><p>Re: 1&amp;2, I agree I'm, like, not that bullish on getting a bunch of value from this book, but it looks like a bunch of people have already gotten value from the theme of excessive focus on measurability. And generally I want to see more constructive engagement with criticism, and don't think \"eh, low prior on it working\" is a good critique of a good mental move.</p>", "parentCommentId": "MDLdr7zgaHCTjFenW", "user": {"username": "jpaddison"}}, {"_id": "iqpyC8TYdoZJ25N9b", "postedAt": "2023-05-03T00:14:54.219Z", "postId": "ZKYpu4WAiwTXDSrX8", "htmlBody": "<p>It would be helpful if criticism could be marked by intended audience and purpose. It's OK if authors publish stuff that is targeted to people who already firmly believe in the core principles of their system, rather than attempting to engage with a broader audience. Lots of posts on the Forum (probably most posts) do the same thing. However, authors who make that particular targeting choice have no standing to complain when people outside their system (and inside the system they don't like) don't engage with their criticism.&nbsp;</p>", "parentCommentId": "jLPm96BwLiahBXDQ3", "user": {"username": "Jason"}}, {"_id": "CGqzdDRkGB6qb6bgF", "postedAt": "2023-05-03T00:23:21.678Z", "postId": "ZKYpu4WAiwTXDSrX8", "htmlBody": "<p>Thanks. I hadn't seen that post, nor most of the arguments against steelmanning that Rob Bensinger mentions. I thought I was expressing a less popular view than now seems to me to be the case. I found it particularly interesting to read that Holden Karnofsky finds it <a href=\"https://forum.effectivealtruism.org/posts/gTaDDJFDzqe7jnTWG/some-thoughts-on-public-discourse\">unsatisfying</a> to engage with \"steelmanned\" versions of his views.</p><p>I agree with you that steelmanning in the context of a discussion with others or of interpreting the views of others is importantly different from steelmanning in your own inner monologue, and I think the latter may be justified in some cases. Specifically, I think steelmanning can indeed be useful as a heuristic device for uncovering relevant considerations for or against some view as part of a brainstorming session. This seems pretty different from how steelmanning is typically applied, though.</p>", "parentCommentId": "gBXqT7t8XtPfzjhLG", "user": {"username": "Pablo_Stafforini"}}, {"_id": "y9r4fuexeG7j3FdKe", "postedAt": "2023-05-03T02:00:24.119Z", "postId": "ZKYpu4WAiwTXDSrX8", "htmlBody": "<p>We ought to have a new word, besides \"steelmanning\", for \"I think this idea is bad, but it made me think of another, much stronger idea that sounds similar, and I want to look at <em>that</em> idea now and ignore the first idea and probably whoever was advocating it\".</p>\n", "parentCommentId": "MDLdr7zgaHCTjFenW", "user": {"username": "NicholasKross"}}, {"_id": "5wNRNaM32nnTppKXH", "postedAt": "2023-05-03T04:25:30.235Z", "postId": "ZKYpu4WAiwTXDSrX8", "htmlBody": "<blockquote><p><strong>In particular, </strong>Crary keeps calling EA morally corrupt throughout her piece. Perhaps I have too naïve a view of the academy - but this seems beyond the pale.</p></blockquote><p>Small disagreement: if someone genuinuely believes some work to be morally corrupt, I'd prefer they go out and say it rather than hide behind more euphemisms. I don't think it's structurally any different from e.g. calling factory farming \"evil\" or AI capabilities research \"terrible for the world.\"</p><p>Part of this might just be a norms difference: in most fields regular uses of morally laden language is uncommon, often counterproductive, and comes across as aggressive. But Crary is a moral philosopher, and at their best, the job of a good moral philosopher<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefcqcjegylnr\"><sup><a href=\"#fncqcjegylnr\">[1]</a></sup></span>&nbsp;<i>is</i> to regularly interrogate the nature of good and evil.</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fncqcjegylnr\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefcqcjegylnr\">^</a></strong></sup></span><div class=\"footnote-content\"><p>not saying that she's necessarily a good one</p></div></li></ol>", "parentCommentId": "rXajjm9QeESjNmDum", "user": {"username": "Linch"}}, {"_id": "8uk6W8BneQEdmqSDi", "postedAt": "2023-05-03T06:17:50.057Z", "postId": "ZKYpu4WAiwTXDSrX8", "htmlBody": "<blockquote><p>\"What have we come to when we call a diversification of business portfolios by these [agribusiness and fast food] companies—which are involved, through their caucus in Congress, in the dismantlement of environmental laws, human rights, and animal protection laws—a success for the animals, and even going as far as to offer “vegan” certifications to a Unilever product?\"</p></blockquote><blockquote><p>(I would’ve thought that any vegan product could be certified as such, but apparently it doesn’t count if it’s made by the wrong people?)</p></blockquote><p>&nbsp;</p><p>I think these are indeed successes <i>overall</i>, but I can imagine being more concerned about vegan-washing, humane-washing or otherwise legitimizing bad stuff a company does and improving their reputation and nonvegan/inhumane sales by applauding them for the little good they do or small improvements they make. The profits made off vegan products by non-vegan companies can also be reinvested in harmful products, at the same company or by shareholders in other nonvegan products, or to undermine \"environmental laws, human rights, and animal protection laws\". Of course, the profits can be reinvested into more vegan stuff, but we'd expect a greater share of reinvestment in vegan products from vegan companies.</p><p>Plus, I think products can still be labeled as vegan even if literal human slavery/forced labour was involved in their production (or at least wasn't certified not to be involved, from regions/industries of concern, like cocoa production). I don't think we should consider human slavery to be vegan.</p><p>So, it could cause harm, which may be of concern even if the benefits seem greater, and, at least a priori, it could even cause more harm than benefit.</p><p>&nbsp;</p><p>But I disagree with them (or at least what I expect they're arguing; again I haven't read any of the book, although I've read Crary's critiques elsewhere), because I think benefits can outweigh harms, the numbers actually matter, and the specific harms they worry about seem small in comparison to the more direct benefits (the effects on farmed animals from people buying vegan products instead of nonvegan ones), and they might even have the sign wrong for the harms.<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefdltsoy1iihp\"><sup><a href=\"#fndltsoy1iihp\">[1]</a></sup></span>&nbsp;Some similar points here: <a href=\"https://www.sentienceinstitute.org/foundational-questions-summaries#momentum-vs.-complacency-from-welfare-reforms\">https://www.sentienceinstitute.org/foundational-questions-summaries#momentum-vs.-complacency-from-welfare-reforms</a>.</p><p>Also, brand recognition could be important. I'd guess vegan items from large nonvegan companies would replace more animal products than vegan items sold by vegan companies, because the former sell more among those who aren't committed to veganism than the latter, and we don't get as much out of targeting committed vegans.</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fndltsoy1iihp\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefdltsoy1iihp\">^</a></strong></sup></span><div class=\"footnote-content\"><p>The more a company is invested in vegan or more humane products, the less their profits depend on opposing them and laws protecting animals, and the more likely they are to actually support animal protection laws, even just to avoid being undercut by less humane companies (e.g. cage-free eggs vs caged eggs). It's not even clear counterfactuals matter to them; maybe just participating in a system that cause harm, even if your particular participation has no expected effect on how much harm is caused by that system (or even reduces it?).</p></div></li></ol>", "parentCommentId": null, "user": {"username": "MichaelStJules"}}, {"_id": "bzyES2gLmeQfAn2aY", "postedAt": "2023-05-03T07:44:31.051Z", "postId": "ZKYpu4WAiwTXDSrX8", "htmlBody": "<p>Thanks! I always appreciate engagement and would be very happy to see any of my posts discussed on the EA Forum, either as linkposts or not.</p><p>I need a bit more independence than the EA Forum can provide. I want to write for a diverse audience in a way that isn't beholden primarily to EA opinions, and I want to be clear that while much of my blog discusses issues connected to effective altruism, and while I agree with effective altruists on a great many philosophical points, I am not an effective altruist.</p><p>For that reason, I tend not to post much on the EA Forum, though I do try to comment when I can. I'd be happy to comment at least to some degree on any linkpost, and I'm always very responsive to comments on my blog.</p><p>I appreciate this can be a bit frustrating, but I need to be clear about who I am and who my audience is.</p>", "parentCommentId": "5D53fsKK8NY4aQjja", "user": {"username": "David Thorstad"}}, {"_id": "ZfDeMjJx3pJEWSx6r", "postedAt": "2023-05-03T11:40:47.126Z", "postId": "ZKYpu4WAiwTXDSrX8", "htmlBody": "<p>Your discussion of the 'good' in the book doesn't mention a part of Amia's foreword that I think is a fairly powerful critique (though far from establishing \"effective altruism is bad as currently practiced\" or anything that strong):&nbsp;<br><br>'These [above] are some of the questions raised when the story of Effective Altruism’s success is told not by its proponents, but by those engaged in liberation struggles and justice movements that operate outside Effective Altruism’s terms. These struggles, it must be said, long predate Effective Altruism, and it is striking that Effective Altruism has not found anything very worthwhile in them: in the historically deep and ongoing movements for the rights of working-class people, nonhuman animals, people of color, Indigenous people, women, incarcerated people, disabled people, and people living under colonial and authoritarian rule. For most Effective Altruists, these movements are, at best, examples of ineffective attempts to do good; negative examples from which to prescind or correct, not political formations from which to learn, with which to create coalition, or to join.'<br><br>(Got the quote from David Thorstad's blog: <a href=\"https://ineffectivealtruismblog.com/2023/02/25/the-good-it-promises-the-harm-it-does-part-1-introduction/)\">https://ineffectivealtruismblog.com/2023/02/25/the-good-it-promises-the-harm-it-does-part-1-introduction/)</a><br><br>Now, we can debate the extent to which this is true (most EAs are actually pretty sympathetic to animal rights activism I suspect, Open Phil. gave money to criminal justice reform etc.). But insofar as it is true, I take it the challenge is something like: 'what's more likely, all those movements were in fact ineffective, or you're biased demographically against them'. And I think the <i>bite</i> of the challenge comes from something like this. Most EAs are *liberal/centre-left* in political orientation. So they probably believe that <i>historically</i> these movements have been of very high value and have produced important insights about the world and social reality. (Even if we also think some other things have been high value too, including perhaps some many people in these movements disliked or opposed.) So how come they act like those movements probably aren't still doing that? What changed?&nbsp;<br><br>I think there are lots of good responses that can be made to this, but it's still a challenge very much worth thinking about. More worth thinking about than gloating/getting angry over the dumbest or most annoying things the book says. (And to be clear, I do find most of the passages Richard quotes in his review pretty annoying.)&nbsp;</p>", "parentCommentId": null, "user": {"username": "Dr. David Mathers"}}, {"_id": "hbzMFEduEKJ4KhsZG", "postedAt": "2023-05-03T12:44:12.174Z", "postId": "ZKYpu4WAiwTXDSrX8", "htmlBody": "<p>I think steelmanning is bad for understanding and engaging with your <em>critics</em>, but is still useful for engaging with <em>criticism</em>, and for challenging and refining your own ideas.</p>\n", "parentCommentId": "MDLdr7zgaHCTjFenW", "user": {"username": "freedomandutility"}}, {"_id": "GQthCyCZaMY9Gwmht", "postedAt": "2023-05-03T12:57:06.488Z", "postId": "ZKYpu4WAiwTXDSrX8", "htmlBody": "<p>Yeah, <a href=\"https://forum.effectivealtruism.org/posts/ZKYpu4WAiwTXDSrX8/review-of-the-good-it-promises-the-harm-it-does?commentId=5wNRNaM32nnTppKXH\">like Linch</a>, I don't think there's anything wrong in principle with making a charge of \"moral corruption\" or other harsh criticism. But it needs to be supported; the problem with Crary's piece is just that it's abysmally argued and substantively deeply unreasonable.</p>", "parentCommentId": "rXajjm9QeESjNmDum", "user": {"username": "RYC"}}, {"_id": "e6ZLHjAuZqrqKLXjK", "postedAt": "2023-05-03T13:07:47.624Z", "postId": "ZKYpu4WAiwTXDSrX8", "htmlBody": "<p>Yes, fair point! Though it's a bad sign for a book if the best thing about it is the foreword by a different author.</p><p>My overall judgment is that the book <i>itself</i> is not worth reading, and anyone interested in ideas from this quarter would do much better to just read David Thorstad's commentary (which is much better, and less aggravating, than the book itself).</p>", "parentCommentId": "ZfDeMjJx3pJEWSx6r", "user": {"username": "RYC"}}, {"_id": "7gJu5EkBFbEbxvpon", "postedAt": "2023-05-03T13:20:16.054Z", "postId": "ZKYpu4WAiwTXDSrX8", "htmlBody": "<p>Hi David, yes, I've appreciated your blog commentary on these issues, and would recommend that people read that over the book itself!</p>", "parentCommentId": "ePfehHiry4gTFDHca", "user": {"username": "RYC"}}, {"_id": "cmX7rxdNsp5gKmABj", "postedAt": "2023-05-03T13:47:48.832Z", "postId": "ZKYpu4WAiwTXDSrX8", "htmlBody": "<p>Thanks Richard -- I've appreciated your comments on the blog!</p>", "parentCommentId": "7gJu5EkBFbEbxvpon", "user": {"username": "David Thorstad"}}, {"_id": "wgZaHmGLo2eNTQrPJ", "postedAt": "2023-05-03T13:52:17.440Z", "postId": "ZKYpu4WAiwTXDSrX8", "htmlBody": "<p>This is a pretty good review that highlights the biggest problems with this book quite well. I was also annoyed by the lack of good arguments throughout the book. This book feels like a missed opportunity in two senses.</p><p>First, it seems like a missed opportunity to collect actually impressive criticisms of effective altruism (which I believe very much can exist). For example, many authors of this book suggest effective altruism is problematically capitalist, which <i>could</i> be an interesting critique, but in my opinion they barely offer any interesting arguments to support this critique. The same thing applies for the critique that effective altruism's approach to animal advocacy is ineffective, which is another claim that is at once central in the book yet not adequately argued for.</p><p>Second, it seems like a missed opportunity to create a meaningful contribution to the debate on effective altruism. As David Thorstad pointed out, the authors of this book clearly have quite different worldviews and backgrounds than many effective altruists do. It is admirable that Thorstad tries to overcome this obstacle to debate by reading this book as charitably as possible so as to convince effective altruists not to dismiss it all too quickly. However, most of the authors of this book seem to make almost no serious effort to make themselves clear to people who do not already basically agree with their views. I find it very ironic that Amia Srinivasan writes in the book's foreword that</p><blockquote><p>There is every possibility, then, that Effective Altruists will ignore what these voices [the authors of the essays of this book] have to say—or fail to take the time to understand what their significance might be. (p. 17)</p></blockquote><p>However, as of writing this, there have already been four posts on this forum to discuss this book (the above topic, <a href=\"https://forum.effectivealtruism.org/posts/YFGkyDjKvsr9tHzkS/book-post-the-good-it-promises-the-harm-it-does-critical\">a discussion of the book</a>, <a href=\"https://forum.effectivealtruism.org/posts/7pMvc3dHN5GXy8c8x/reading-group-the-good-it-promises-the-harm-it-does\">a topic about a reading group for the book</a>, and <a href=\"https://forum.effectivealtruism.org/posts/Ny3v2Qe4LfaYJYKcq/book-critique-of-effective-altruism\">a post about the book before it was even published</a>). <s>Conversely, as far as I am aware, none of the 22 authors who have contributed to this book have ever attempted to engage in conversation with effective altruists (on this forum or elsewhere).</s> Matthew C. Halteman, one of the book's authors, has had constructive discussion with the author of the above post! Even if I think the book's essays were quite flawed, I can still imagine constructive debate taking place between effective altruists and the book's authors. But this will require more effort on the part of the contributors to the book.</p><p>Other than that, I had a bunch of smaller issues with this book. Fifteen of the book's seventeen essays focus mainly or exclusively on effective altruism's approach to animal advocacy, but this choice is never justified. This focus is not bad per se, especially considering how compared to global health and x-risks, animal advocacy is relatively neglected in effective altruism. But it is quite misleading for a volume that promises to provide general critiques of effective altruism (<a href=\"https://philpapers.org/rec/ADATGI\">the book's editors claim that</a> it is \"the first book-length critique of Effective Altruism\"). The book's editing overall could have been far better, anyway. I felt like many of the essays made the same points, and a lot of sections were rather irrelevant to effective altruism. This was especially troubling in what I think is one of the worst essays of the book (5. 'Who Counts?') which was basically just a lengthy history of US wildlife conservation, followed by the vague and tendentious claim - of course without good arguments in support of it - that effective altruists treat animals like objects, in the same way that hunting lobbyists historically have done.</p><p>To the book's credit, I think the final essay (17. 'The Change We Need') was surprisingly good, and I think it rightly emphasizes that reforms should always keep an ideal in mind. When they do not, they risk merely making the whole problem worse. But I do not know enough about animal advocacy to know whether effective altruist animal advocacy actually lacks vision.</p><p>I agree with Thorstad that effective altruists should engage with what this book's worth anyway, even if that is certainly not easy, considering all the book's flaws.</p>", "parentCommentId": null, "user": {"username": "Maxim Vandaele"}}, {"_id": "yca8vj8XYgEEa8bvj", "postedAt": "2023-05-03T14:02:50.893Z", "postId": "ZKYpu4WAiwTXDSrX8", "htmlBody": "<p>I agree that this book rightly asks the question whether effective altruism is not undemocratically excluding certain valuable perspectives and movements. However, I believe the book's authors fail to provide many specific and convincing examples of people that effective altruists should listen more to (with the exception, possibly, of those who run farmed animal sanctuaries, and I must add, of those who advocate veganism to students in higher education). This is unfortunate, because I think the book's authors are probably right when they suggest that effective altruism should listen to more diverse voices.</p>", "parentCommentId": "ZfDeMjJx3pJEWSx6r", "user": {"username": "Maxim Vandaele"}}, {"_id": "ff6p5TJRgacBGbux7", "postedAt": "2023-05-03T14:14:00.615Z", "postId": "ZKYpu4WAiwTXDSrX8", "htmlBody": "<blockquote><p>I hope we can bring the rhetoric down and focus on saying as clearly as possible what the main cruxes are and why a reasonable person might stand on one side or another.&nbsp;</p></blockquote><p>I agree with this. But in order for constructive debate to happen, the authors of this book will need to make better efforts. It would be great to see any of them reach out to effective altruists and engage in debate, but as far as I know, this has not yet happened at all</p><p>UPDATE: Matthew C. Halteman now appears to be the first author of <i>The Good it Promises, the Harm it Does</i> to have posted on this forum and has engaged in constructive discussion with the author of this topic. This is great! I'd love to see more like this!</p>", "parentCommentId": "ePfehHiry4gTFDHca", "user": {"username": "Maxim Vandaele"}}, {"_id": "gYw2Eduw8mAfBftLn", "postedAt": "2023-05-03T16:25:45.002Z", "postId": "ZKYpu4WAiwTXDSrX8", "htmlBody": "<blockquote><p>But it is quite misleading for a volume that promises to provide general critiques of effective altruism (<a href=\"https://philpapers.org/rec/ADATGI\">the book's editors claim that</a> it is \"the first book-length critique of Effective Altruism\").</p></blockquote><p>This is an aside, but that is almost certainly false, right? Larry Temkin's <a href=\"https://global.oup.com/academic/product/being-good-in-a-world-of-need-9780192849977?cc=hk&amp;lang=en&amp;\">Being Good in a World of Need</a> was published last year (and seems, from skimming it, like it gets a lot of the things you mention right -- for example, it does engage in dialogue with EAs).</p>", "parentCommentId": "wgZaHmGLo2eNTQrPJ", "user": {"username": "Erich_Grunewald"}}, {"_id": "KMxmwGKabWmswBwur", "postedAt": "2023-05-03T17:57:29.811Z", "postId": "ZKYpu4WAiwTXDSrX8", "htmlBody": "<p>How about a blog update in a month or so about the post series I've written so far, lessons learned, and future directions, posted to the EA Forum?</p>", "parentCommentId": "5D53fsKK8NY4aQjja", "user": {"username": "David Thorstad"}}, {"_id": "kANDWGj5ResDpWaoP", "postedAt": "2023-05-03T19:27:59.960Z", "postId": "ZKYpu4WAiwTXDSrX8", "htmlBody": "<p>Thank you for pointing this out! From what I can tell, Temkin's book also isn't really meant as a book-length critique of effective altruism, although it does criticize aspects of it. It also looks like his book focuses only on effective altruism's approach to global health and development, not on the other cause areas or the effective altruism movement as a whole. The claim that <i>The Good it Promises, the Harm it Does</i> is \"the first book-length critique of Effective Altruism\" is still wrong though, because I think that book simply can't be considered a 'book-length critique of effective altruism' if it almost exclusively focuses on effective altruism's approach to one cause area (in a rather limited way too - I felt like the book's authors did very little effort to explain the arguments used by organizations like Animal Charity Evaluators, I found that rather unhelpful).</p><p>It looks like Temkin has the same concerns about effective altruist charities that other so-called 'aid critics' (like William Easterly, Dambisa Moyo and Angus Deaton) seem to have, so I'm not sure how original the book is in that respect. Either way I'm not going to read it, because it looks very long and complicated and I'm not sure how much of it is actually relevant to effective altruism. I do think I might check out parts of Temkin's lectures on which his book is based, the lectures can apparently be listened to online <a href=\"https://www.practicalethics.ox.ac.uk/uehiro-lectures-2017#tab-420611\">here</a>. Interestingly, <a href=\"https://forum.effectivealtruism.org/posts/zowvLzCK35MBhLjm8/aid-scepticism-and-effective-altruism-1\">William MacAskill wrote a very sharp critique of Temkin's work</a>.&nbsp;</p>", "parentCommentId": "gYw2Eduw8mAfBftLn", "user": {"username": "Maxim Vandaele"}}, {"_id": "2HfbaWLyWnhhhEC63", "postedAt": "2023-05-03T23:36:55.585Z", "postId": "ZKYpu4WAiwTXDSrX8", "htmlBody": "<p>Thanks for this review, Richard.&nbsp;</p><p>In the section titled, \"The Bad,\" you cite a passage from my essay--\"Diversifying Effective Altruism's Longshots in Animal Advocacy\"--and then go on to say the following:&nbsp;</p><p>\"Another author tells us (p. 81):</p><blockquote><p>it is morally ill-advised to invest tens of millions of dollars in tech long shots that <i>might someday</i> have a huge impact on the world at large while failing to combat intimately related systemic injustices <i>that are doing disproportionate damage right now</i> to already at-risk communities.</p></blockquote><p>(Of course, no argument is offered in support of this short-sighted thinking. It’s just supposed to be obvious to all right-thinking individuals. This sort of vacuous moralizing, in the total absence of <i>any</i> sort of grappling with—or even recognition of—opposing arguments, is found throughout the volume.)\"</p><p>It sounds from your framing like you take it that I <i>assert</i> the claim in question, <i>believe</i> that the alleged claim is obvious, and hold this belief<i> \"in the total absence of any sort of grappling with--or even recognition of--opposing arguments.\"</i>&nbsp;</p><p>With respect, I don't think your reading is fair on any of these fronts.</p><p>First, I don't assert the claim in question. The passage you (partially) cite actually reads \"<i>One might object that</i> it is morally ill-advised to invest...\", and what I'm trying to do in this context is to get behind why someone skeptical of certain EA cause-prioritizations <i>might be worried</i> that it is morally ill-advised given other considerations that you don't mention in your review. (I recognize that one has limited space in a review and can't get to everything.)</p><p>Second, I don't believe that the claim you misattribute to me is \"obvious to all right-thinking individuals.\" Here are two bits of support for my explicit recognition (in the chapter) of my belief that right-thinking people might disagree:</p><p>(i) On pages 79-80, the pages immediately before the passage you cite, I consider the hope to \"mitigate important but often neglected 'longtermist' concerns about suffering-risk\", providing footnotes to an FAQ on s-risk, citations to work by MacAskill, Bostrom, and Ord, and gratitude to Dominic Roser for \"helping me to see the complexity of this problem through the lens of intergenerational justice.\" I go on to say, \"Though it is tempting, given the pressing concern of inequitable cause prioritization, to weigh the opportunity costs of funding such tech long shots only in terms of the interests of <i>presently</i> disadvantaged communities, there are also the interests of <i>future</i> disadvantaged communities to consider\", citing Roser and Seidel 2017.&nbsp;</p><p>(ii) On page 80, about four lines of text before the passage that you cite as an instance of \"vacuous moralizing\", I say this: \"A reasonable person could be forgiven, it seems, for judging the opportunity costs associated with possibly foiling a misaligned AI in fifty years to be too high, and for suspecting that these millions of dollars could be better invested elsewhere. (I should add that the same reasonable person might simultaneously conclude that it is nonetheless wise to devote some resources to mitigating s-risk; my intent here is not to try to minimize these serious risks, but to emphasize that significant investment in their potential mitigation, however important, is nonetheless a long shot with present opportunity costs worth keeping in mind.\")&nbsp;</p><p>Third, the above two bits also seem to me to sit ill with the framing of my essay as \"lacking any sort of grappling with--or even recognition of--opposing arguments.\" I may still be engaged in \"vacuous moralizing\" by your lights, and perhaps I've fallen short of your standard for \"any sort of grappling\". But I hope I've at least succeeded in recognizing the existence of opposing arguments (maybe I cited the wrong people or too few of them?).&nbsp;</p><p>On the bright side, those in this thread who are skeptical of steel-manning as a strategy for engaging critics will have no quarrel with you. :)</p><p>Thanks again for reading the piece and I'm sorry that it was a dispiriting experience!</p>", "parentCommentId": null, "user": {"username": "Matthew C. Halteman"}}, {"_id": "EYbHsbbFddatMz8JF", "postedAt": "2023-05-04T00:51:41.772Z", "postId": "ZKYpu4WAiwTXDSrX8", "htmlBody": "<p>Hi Matthew, thanks for clarifying that! &nbsp;I owe you an apology. The quoted passage jumped out at me as illustrating a trend that I was finding irksome about the volume as a whole, but I wasn't careful enough to double-check that my editorializing was a fair representation of your article in particular. &nbsp;I'll update my post with a correction.</p>", "parentCommentId": "2HfbaWLyWnhhhEC63", "user": {"username": "RYC"}}, {"_id": "mpFn96gJ4C7byoDZe", "postedAt": "2023-05-04T01:29:00.747Z", "postId": "ZKYpu4WAiwTXDSrX8", "htmlBody": "<p>Thanks, Richard! I appreciate your posting a correction.&nbsp;</p>", "parentCommentId": "EYbHsbbFddatMz8JF", "user": {"username": "Matthew C. Halteman"}}, {"_id": "mmQ5dhj6dXtat76uk", "postedAt": "2023-05-04T02:10:41.260Z", "postId": "ZKYpu4WAiwTXDSrX8", "htmlBody": "<p>I have only read small pieces of the book, but the sections I have read have been fairly clear that the main aim of the book is to shine a light onto a diverse range of voices speaking about negative consequences of effective altruism within animal advocacy. Here's the ending of the introduction:</p><blockquote><p><i>The Good It Promises, The Harm It Does</i> is, in real part, a project of recovery: there are voices and projects much older than EA, keenly needed activist traditions that EA lacks the resources to asses and so threatens to squelch. We seek to recover, positively, what we are in danger of losing. &nbsp;(pg. xxx)</p></blockquote><p>It is not intended to persuade effective altruists. Amia Srinivasan more or less says in the forward that she expects effective altruists to essentially ignore the book:</p><blockquote><p>This volume contains many voices to which Effective Altruism as a whole is not in the practice of listening, even when those voices call for things - like the end of farmed animal suffering - that Effective Altruism also supports. Most of the volume's contributors are not philosophers and academics, and do not write in the chosen vernacular of Effective Altruism. They raise worries about the overwhelming whiteness, middle-classness, and maleness of the Effective Altruist community that many of its members are likely to think irrelevant to the assessment of Effective Altruism's value. They often speak from experience, and do not purport to offer alternative general principles that can guide all moral decision-making. There is every possibility, then, that Effective Altruists will ignore what these voices have to say - or fail to take the time to understand what their significance might be. That would be a deep shame, and what's more, a betrayal of what I believe is a real commitment, on the part of many Effective Altruists, to bring about a better world. (pg. xii)</p></blockquote>", "parentCommentId": "iqpyC8TYdoZJ25N9b", "user": null}, {"_id": "hPE7YpbMJyjRqbLu3", "postedAt": "2023-05-04T02:28:06.439Z", "postId": "ZKYpu4WAiwTXDSrX8", "htmlBody": "<p>Quick follow-up that I hope isn't too pedantic (but maybe is, despite my hope?). I just had a chance to check the correction itself on my computer (my phone wouldn't take me to the link for some odd reason) and noticed that, while the unwarranted criticism has been retracted, the misattribution itself has not. The set-up for the quotation still seems to read, \"Another author tells us (p. 81), 'it is morally ill-advised to invest tens of millions...', which isn't technically true. I don't \"tell\" readers that \"it is morally ill-advised...\" by observing that \"One might object that it is morally ill-advised...\" any more than I would have told them \"Keith kills it at Scrabble\" had I written \"One might wonder whether Keith kills it at Scrabble.\" Maybe that seems like a small quibble, but if my work is going to be used as Exhibit B in a section of a book review titled \"The Bad,\" I want to be guilty of the alleged wrongdoing, ya know? :)</p>", "parentCommentId": "EYbHsbbFddatMz8JF", "user": {"username": "Matthew C. Halteman"}}, {"_id": "J3b3cbJSFLx5rk9uy", "postedAt": "2023-05-04T02:46:37.993Z", "postId": "ZKYpu4WAiwTXDSrX8", "htmlBody": "<p>Understandable! I've cut the passage entirely, since as you say it isn't really fair to exhibit your work in that section of the review.</p>", "parentCommentId": "hPE7YpbMJyjRqbLu3", "user": {"username": "RYC"}}, {"_id": "365TgroyqbMwFHRKx", "postedAt": "2023-05-04T07:57:23.996Z", "postId": "ZKYpu4WAiwTXDSrX8", "htmlBody": "<p>Thanks for the review, Richard!</p><blockquote><p>We learn that EA funders have focused on two main strategies to reform or eventually upend animal agriculture: (i) corporate cage-free (and similar) campaigns, and (ii) investment in meat alternatives.</p></blockquote><p>Relatedly, the Sentience Institute has <a href=\"https://www.sentienceinstitute.org/foundational-questions-summaries#momentum-vs.-complacency-from-welfare-reforms\">a nice summary</a> of the pros and cons of welfare reforms.</p>", "parentCommentId": null, "user": {"username": "vascoamaralgrilo"}}, {"_id": "8zonFqcEjX56RnrRS", "postedAt": "2023-05-04T10:44:25.732Z", "postId": "ZKYpu4WAiwTXDSrX8", "htmlBody": "<p>I think you're misreading \"morally corrupt\" here. Morally corrupt in the left usually refers to purity politics and moral contamination rather than corrupt is bad. This is common in left wing parlance.&nbsp;</p>", "parentCommentId": "rXajjm9QeESjNmDum", "user": {"username": "zichenghuang"}}, {"_id": "ADzhupzMSrvXzZmTJ", "postedAt": "2023-05-05T19:35:58.255Z", "postId": "ZKYpu4WAiwTXDSrX8", "htmlBody": "<p>Thanks Matthew for engaging, particularly given that this post may not have been written in the most friendly way!</p><blockquote><p>I don't assert the claim in question... what I'm trying to do in this context is to get behind why someone skeptical of certain EA cause-prioritizations <i>might be worried</i> that it is morally ill-advised given other considerations that you don't mention in your review.</p></blockquote><p>I feel confused about what your chapter is asserting then? Your chapter starts off with your two reservations about EA:<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefpprr7b9iyzf\"><sup><a href=\"#fnpprr7b9iyzf\">[1]</a></sup></span></p><ol><li>It isn't always clear that we really can do more good by supporting EA-preferred causes</li><li>Doing the most good might have opportunity costs (e.g. making the world less just)</li></ol><p>These reservations seem pretty clearly consistent with the fragments that Richard excerpted. And in both cases, you go on to give additional argumentation about why these excerpted objections are correct.</p><p>For example with the \"morally ill-advised\" one you go on to say: \"To make this worry more concrete in the context of the animal-focused applications of EA discussion in this book, consider the disproportionate toll that the ascendance of industrial animal agriculture has taken on communities of color in the United States, and on Black communities in particular.\" You then elaborate on these inequalities for several paragraphs, without using the \"one might…\" voice.</p><p>The excerpted fragments are also consistent with what I took the point of your chapter to be (EA should diversify away from food tech into outreach to black vegans, higher ed, and religious people). But maybe I am completely misunderstanding your point?</p><blockquote><p>I don't \"tell\" readers that \"it is morally ill-advised...\" by observing that \"One might object that it is morally ill-advised...\" any more than I would have told them \"Keith kills it at Scrabble\" had I written \"One might wonder whether Keith kills it at Scrabble.\"</p></blockquote><p>I am very sympathetic that readers will see meanings that writers didn't intend, but for what it's worth: yes, if you wrote \"One might wonder whether Keith kills it at Scrabble\", gave many pages of evidence supporting the claim that Keith kills it at Scrabble, and then concluded your chapter with a suggestion that we should send Keith to the Scrabble world championship, I would, in fact, think you are telling me that Keith kills it at Scrabble.&nbsp;</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnpprr7b9iyzf\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefpprr7b9iyzf\">^</a></strong></sup></span><div class=\"footnote-content\"><p>I'm paraphrasing lightly, hopefully this is still accurate</p></div></li></ol>", "parentCommentId": "hPE7YpbMJyjRqbLu3", "user": {"username": "Ben_West"}}, {"_id": "sD4JecJszW55DrtbW", "postedAt": "2023-05-06T01:18:19.375Z", "postId": "ZKYpu4WAiwTXDSrX8", "htmlBody": "<p>[TL; DR: I'm a little confused too, and this essay was an attempt (maybe a failed one?) to try to work out a \"both/and\" that would synthesize my fledgling sense that EA has something important to offer in spite of methodological idiosyncrasies, hermeneutic blindspots, and demographic challenges that seem seriously to limit its appeal and reach; and that grassroots advocacy work in various culturally influential communities that seem positioned to do great good (but are often lacking the resources to scale it and viewed with skepticism by some EAs) could benefit from EA-channeled resource-infusions.]</p><p>Hi Ben! That you have carried on with the \"Keith kills it at Scrabble\" thing gives me joy. An occupational hazard of doing philosophy is time sacrificed to fashioning examples calculated to seem like the effortless progeny of a rapier wit when in fact one struggles mightily and usually fails. I confess to lingering over Keith for a minute before I cut him loose, and to witness him flourishing in this comment thread even unto the Scrabble world championships...I am moist-eyed!</p><p>Before I go any further, let me confess in humility that I am a relative newcomer to thinking about EA and not very well versed in the lingua franca, so I hope that at least some of what I say is intelligible even if the words \"priors\", \"counterfactual\", and \"expected value\" are nowhere to be found! :)</p><p>Truthfully, I'm a little confused myself as to exactly what I'm trying to do in this essay (which is why there's all that hedging language throughout: one <i>might</i> this, one <i>could</i> that, \"worries\" and \"reservations\" rather than \"objections\" and \"refutations,\" etc.). I think it's one of those \"both/and\" sorts of projects where I'm hoping--maybe too optimistically? maybe in vain?--that if EA diversifies the ol' methodological and cause-prioritization portfolios a bit, the whole movement and the world, too, will get more of what it wants and needs? Something like that? (By \"movement\" here, I've got animal advocacy in mind (the main focus of the volume), but given that my activist's imagination has been greatly shaped by the work of Carol Adams, Aph and Syl Ko, Christopher Carter and others, it's a holistic pro-flourishing/anti-oppression movement more than just a one-issue focus on animal advocacy).&nbsp;</p><p>Here's how I frame this \"both/and\" gesture in the first few pages:</p><p>\"In what follows, I'll explain each of these reservations and then suggest some exciting new initiatives--institution-building in Black vegan advocacy, higher education, and religious communities--that could mitigate these reservations, energize and diversify the movement, and remain true to the EA method of supporting underexploited but potentially high-impact causes that produce non fungible goods otherwise unlikely to be funded.\" (77)</p><p>If this conversation is to continue, it might help for me to fess up to a couple of idiosyncrasies in my background that really complicate my outlook on these matters and have prompted me to search for a \"both/and\" in a situation where some seem to think we must choose between EA and grassroots approaches.&nbsp;</p><p>My methodological worries about EA are largely rooted in my training as a hermeneutic phenomenologist. Though I studied analytic philosophy in both undergrad and graduate school, I ended up doing some coursework in both places that raised serious concerns about Enlightenment approaches to method in the humanities and social sciences, especially in cases where science-envy in these fields generates overconfident appeals to objectivity and fixation on measurement as ways to try to corral the unpredictable vicissitudes of human history (or, worse, to dominate and exploit others (e.g., colonization (society/reason vs. nature/savagery), eugenics, etc.). Hans-Georg Gadamer's <i>Truth and Method</i> convinced me that there are many pre-reflective and ultimately immeasurable forces at play in the interpretive contexts that are always already shaping our understanding of things, and that--as a result--staying in touch with reality requires ongoing dialogue with others whose different hermeneutic situations and life experiences offer us a clearer vantage point than even the most rigorous self- or communal reflection could leverage on the hidden blindspots and unwitting exclusions of our own limited perspectives. After reading thinkers in the hermeneutic phenomenological tradition (like Beauvoir and Fanon) who extended these insights into their implications for matters of gender, race, and systemic/institutional injustice, I became a lot more sensitive than I had been before to the risks associated with methodologically and demographically homogenous communities (not just the risks of exclusion and oppression, but the risks of falsely presumed supremacy, impoverished thinking, and cultural stagnation and decline into which homogenous cultures can unwittingly descend--maybe some of the recent events around SBF could be viewed as cautionary tales in this register?).&nbsp;</p><p>One might think, given all of this, that I'd be an anti-capitalist. But it turns out my Dad is an economics professor who devoted his career to arguing that capitalism, while woefully imperfect, is the best approach we've found so far to meeting human needs and curbing human suffering in a world of scarcity (he did a lot of advisory work in the former Soviet Union and had a front row seat to some of the other approaches on offer in contrast to which capitalism, warts and all, looked much better to him). Dad was always beating the drum that the problem isn't capitalism per se, but the fact that--as a citizenry--we've failed to develop and evolve the moral sentiments and fellow feeling that would enable us to demand the proper things and create markets that deliver on those demands. He always said that the invisible hand would do a very bad job without a very good citizenry to set the parameters of its field of play, citing Adam Smith's claims that one could not understand <i>The Wealth of Nations</i> or pull off the project described therein without enacting the world of <i>The Theory of Moral Sentiments</i> first as the foundation.&nbsp;</p><p>So, despite having read a bunch of stuff (and having a bunch of corroborating experiences of those insights in the philosophical, religious, and advocacy communities of which I am a part) that inclines me to think we're all doomed if we don't become significantly more methodologically and demographically diverse in our approaches to social problem solving, I've also been heavily shaped by the beliefs that capitalism is the best we human beings have done so far in terms of providing systemic solutions to scarcity and that capitalism might be able to do much, much better if our methodological and demographic diversification efforts expand our consciousness and our problem solving skills so that we can demand better things from new and better markets. These experiences are obviously in some tension with one another, and I guess the cageyness of my paper is rooted in that tension. That tension also explains why I'm excited about organizations like Afro-Vegan Society, CreatureKind, and GFI, even though they're doing very different sorts of things.&nbsp;</p><p>Gosh. That was way, way too long and rambling. Better add a TL;DR before I sign off. Thanks again, Ben, for getting me to think harder about what's going on here! I hope it's a little clearer what I was trying to carry off.&nbsp;</p>", "parentCommentId": "ADzhupzMSrvXzZmTJ", "user": {"username": "Matthew C. Halteman"}}, {"_id": "kAk7LRexk3x8ywTpM", "postedAt": "2023-05-06T02:24:43.951Z", "postId": "ZKYpu4WAiwTXDSrX8", "htmlBody": "<p>Just wanted to say that I appreciate you taking the time to respond so politely to quite a critical review.</p>", "parentCommentId": "2HfbaWLyWnhhhEC63", "user": {"username": "casebash"}}, {"_id": "vg6wmZFSz8MFXhJA9", "postedAt": "2023-05-06T02:41:03.401Z", "postId": "ZKYpu4WAiwTXDSrX8", "htmlBody": "<blockquote><p>For most Effective Altruists, these movements are, at best, examples of ineffective attempts to do good; negative examples from which to prescind or correct, not political formations from which to learn, with which to create coalition, or to join.'</p></blockquote><p><br>I think that this would be an accurate characterization of early effective altruism which was explicitly pushing back against these kinds of interventions.</p><p>I suspect what happened is as follows:</p><ul><li>Those EAs most focused on high-quality evidence are reluctant to switch from GiveWell/ACE interventions to political interventions because they are very challenging to evaluate.</li><li>Those EAs who are most focused on hits-based giving ended up becoming focused on existential risk (primarily AI Safety) and whilst drawing some lessons from left social movements, find these lessons more limited due to not falling centrally within this category<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefv8iftfbfn2\"><sup><a href=\"#fnv8iftfbfn2\">[1]</a></sup></span>.</li></ul><p>Because people in EA tend to swing one way or the other pretty heavily, it means that there hasn't been a large enough group within EA to co-ordinate much political action for the purpose of addressing poverty.<br><br>There is an exception in that animal rights folks seem more open to political interventions, but I suspect that's related to the influence of left thought within animal rights as a whole.</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnv8iftfbfn2\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefv8iftfbfn2\">^</a></strong></sup></span><div class=\"footnote-content\"><p>Although long-termists have drawn lessons from these movements. They're just less relevant to AI Safety than to global poverty or criminal justice reform.</p></div></li></ol>", "parentCommentId": "ZfDeMjJx3pJEWSx6r", "user": {"username": "casebash"}}, {"_id": "NAh4mgg3iMthBTgQ5", "postedAt": "2023-05-06T08:32:49.811Z", "postId": "ZKYpu4WAiwTXDSrX8", "htmlBody": "<p>Thank you for reading and reviewing the book for the rest of us!<br>Disappointed to hear it is close minded in regards to the political framework it comes from.<br>I do think there are many valid arguments to be made to criticize EA on its own terms and hope this is what the book set out to do.</p>", "parentCommentId": null, "user": {"username": "annaleptikon"}}, {"_id": "ZnnjQsZmbjRw3AgGG", "postedAt": "2023-05-06T11:30:11.847Z", "postId": "ZKYpu4WAiwTXDSrX8", "htmlBody": "<p>Thanks for this expression of gratitude, Chris!   For better or worse, with an average philosophy paper getting a readership of like 8-12 people (including sympathy reads from family members?), I tend to view even the most scathing criticism in the frame of “SOMEBODY READ IT! Victory is mine!” 🤣👍🏻</p>\n", "parentCommentId": "kAk7LRexk3x8ywTpM", "user": {"username": "Matthew C. Halteman"}}, {"_id": "tDxg5zAESYyiLzYWu", "postedAt": "2023-05-07T22:10:48.979Z", "postId": "ZKYpu4WAiwTXDSrX8", "htmlBody": "<p>I think it is great that you, one of the authors of <i>The Good it Promises, the Harm it Does</i>, have taken the time to engage in constructive discussion with effective altruists.</p><p>Here are a few thoughts I had after reading your essay. The advantage of focusing on students in higher education might be that they are more likely to sympathize with veganism and thus more likely to actually become vegan than people from other groups are. On the other hand, the impact of additional resources in this area might be lower because students are probably more likely to already be aware of the arguments in favor of veganism, and might already have more knowledge about healthy, tasty plant-based food, and thus a lot of students might have become vegan anyway, even without reaching out to them. Conversely, getting people from religious and/or Black communities to go vegan might be more challenging, but the impact might be very high because, as you rightly point out in your essay, financial support for animal advocacy outreach to religious and/or Black communities is neglected.</p><p>Overall I think your essay raises great questions and I really hope that effective altruists will engage with them.</p>", "parentCommentId": "2HfbaWLyWnhhhEC63", "user": {"username": "Maxim Vandaele"}}, {"_id": "9FBmZHpKCA8Znqx7M", "postedAt": "2023-05-08T05:21:24.373Z", "postId": "ZKYpu4WAiwTXDSrX8", "htmlBody": "<p>Thanks for the thoughtful reply. That makes sense. I don't consider myself an EA, and read EA Forum 80% out of intellectual interest, 20% out of altruistic motives, so I'll leave my end of the conversation here (and perhaps subscribe to your blog!), but from the upvotes on your suggestion of a blog update, seems like it met with significant interest among EA Forum readers, so I'd encourage you to do that!</p>", "parentCommentId": "bzyES2gLmeQfAn2aY", "user": {"username": "sjsjsj"}}, {"_id": "TH7u8nRG7Bkz69hac", "postedAt": "2023-05-08T13:20:51.352Z", "postId": "ZKYpu4WAiwTXDSrX8", "htmlBody": "<p>Thanks so much for this positive feedback, Maxim, and for the reflections on potential impact! I really appreciate your taking the time to share them!</p><p>I have some additional thoughts, but no time at the moment to share them! So, gratitude for now and a promise to circle back when time permits! :)</p>", "parentCommentId": "tDxg5zAESYyiLzYWu", "user": {"username": "Matthew C. Halteman"}}, {"_id": "Z7a2hRoBjydr6GSHD", "postedAt": "2023-05-09T13:03:20.935Z", "postId": "ZKYpu4WAiwTXDSrX8", "htmlBody": "<p>Agreed, and will do!</p>", "parentCommentId": "9FBmZHpKCA8Znqx7M", "user": {"username": "David Thorstad"}}, {"_id": "CJti9N9byhmDdLNnA", "postedAt": "2023-05-09T15:36:28.010Z", "postId": "ZKYpu4WAiwTXDSrX8", "htmlBody": "<p>Hi again, Maxim! Thanks for your patience.&nbsp;</p><p>Your point is well taken about the risk that additional resources in higher education settings might be redundant given that college students are perhaps more likely than the general population already to be \"aware of the arguments in favor of veganism.\" I think that this would be a serious concern if \"awareness of the arguments in favor of veganism\" alone were sufficient to support behavioral change over the long-term.&nbsp;</p><p>In my experience, however--and I think the most recent social scientific evidence supports this observation, too--\"awareness of the arguments\" is generally not enough for many even to motivate serious experimentation toward behavioral change much less to support it over time. For many people, indeed, exposure to the arguments can have a counterproductive effect, in that data and argumentative support for positions they find threatening trigger identity-protective cognition that leads to a doubling-down on the attitudes and actions perceived as under threat (Ezra Klein's <i>Why We're Polarized</i> has some really helpful, accessible discussions of this phenomenon and its effects on people's ability to process data and arguments).&nbsp;</p><p>How do we mitigate the serious threat to cultural change posed by identity-protective cognition? I'm intrigued by the strategy of implementing slow-releasing changes in the epistemic atmosphere that collectively serve to defang and normalize the data and supporting arguments so that they can be received without triggering identity-protective cognition. In other words, by creating environments that help people both pre-reflectively and communally to take the data and supporting arguments in stride and maybe even find them intriguing or inspiring, we can circumvent the threat-detection response that closes many people off to attitudinal and behavioral change.&nbsp;</p><p>By pre-reflective environmental conditioning, I have in mind giving people lots of opportunities pre-reflectively to intuit that something is non-threatening, credible, and maybe even cool without having to engage in an argumentative way that threatens one's identity. By communal environmental conditioning, I have in mind giving people lots of opportunities to get social and cultural support from similarly interested people and organizations in the event that their interest is piqued.&nbsp;</p><p>I'm hard-pressed to think of a better place to cultivate both pre-reflective and communal environmental conditioning than the hallowed halls of institutions of higher learning. Anyone who is paying attention to the higher ed culture wars in American institutions likely already understands the ripeness of this environment for shaping people's values and behaviors over the long term. Students come in chomping at the bit to get out from under their parents' influence and values, so they're highly open to suggestion. For 4+ years, they are surrounded on all sides by opportunities to expand their consciousness and expertise--not just explicitly by going to classes and talks and lectures, but pre-reflectively by breathing in an atmosphere that normalizes all kinds of differences that may have seemed anything but normal in one's previous day-to-day life. There are charismatic professors, compelling student leaders, amazing vocational training and networking opportunities. &nbsp;Unsurprisingly, the well-funded programs that institutions innovate, support, and proudly advertise are the ones that often generate the most interest, excitement, and participation.&nbsp;</p><p>So imagine what could happen if we got serious about accelerating and scaling the vegan-friendly cultures that are already seeded in higher education. Generally speaking, the faculty presence and student clubs and extracurricular opportunities in many places are already there on the ground, but are both decentralized and underfunded. In a lot of cases, scaling these cultures (or at least nudging them in the direction of scalability) could be as easy as giving a substantial lead gift for an institute or center--let the university decide how to mission-fit and brand it for galvanizing its alumni and current students (sustainability? creation care? human/animal studies? food systems? green economy?). The director(s) of the center and key faculty and administrators, then, audit everything that is going on around and tangent to these issues, build a central institutional hub to connect and empower the different intermeshed programs and opportunities, and then help faculty to build out curricular programs (majors, minors, certificate programs, themed dorms and cohorts, honors programs, etc.) and student life to build out supporting extra-curricular and cultural programs, using funding opportunities and internal grant-making programs to nudge everyone who's got anything going that is tangent to food-systems stuff (which is almost everyone, in the end) to ramp up the facets of their work that feed into creating ferment around changing our food system. Over time, there will be lots of vegan-friendly people, classes, clubs, receptions, student groups, educational and extracurricular programs, even restaurants and businesses in the town that support the ever-growing populations of students who come to do this work. People who come to the university thinking that going vegan is silly or threatening will see how exciting and transformative it is, both individually and culturally and will be much more receptive to the arguments (if indeed they even need to hear them at all; once the atmosphere is where it needs to be, the arguments themselves become redundant, which is probably better anyway given how post-hoc the average human being's relationship to \"the arguments\" is anyway).&nbsp;</p><p>If it seems far-fetched that such a thing could happen, consider how quickly (in the grand scheme of things, at least) universities have shifted the national and international narratives around many other cultural and political topics and movements. And of course, the history of the agriculture industry's involvement in the shape of higher education gives us a compelling case study that the university has already been used in precisely this way to shape and change the cultural and political landscape that has allowed the current food system to deflect criticism and put off urgently needed change.&nbsp;</p><p>Two exciting non-profits that are pioneering this sort of holistic approach to engaging the whole human being and providing support that goes beyond just \"exposure to the arguments\" toward life- and institution-building are Afro-Vegan Society ( <a href=\"https://www.afrovegansociety.org/copy-of-about-avs\">https://www.afrovegansociety.org/copy-of-about-avs</a> ) and CreatureKind*( <a href=\"https://www.becreaturekind.org\">https://www.becreaturekind.org</a>) . These orgs primary constituencies are Black and Christian audiences, respectively, but their holistic approaches to creating atmospheric shifts in the culture and building positive supporting institutions (rather than just handing out pamphlets with all the bad news) are valuable models that could be replicated in lots of different contexts. Also, the Good Food Institute** is engaging higher ed directly with its \"Research Centers of Excellence\" program: <a href=\"https://gfi.org/solutions/building-interdisciplinary-university-research-centers-of-excellence/.\">https://gfi.org/solutions/building-interdisciplinary-university-research-centers-of-excellence/.</a>&nbsp;</p><p>*I am on the board of directors for CreatureKind.</p><p>**I have a family member who works at The Good Food Institute.</p>", "parentCommentId": "tDxg5zAESYyiLzYWu", "user": {"username": "Matthew C. Halteman"}}, {"_id": "vaYcccugC7QxRoc36", "postedAt": "2023-05-09T17:22:01.031Z", "postId": "ZKYpu4WAiwTXDSrX8", "htmlBody": "<p><i>The following comment was initially intended to be some combination of synthesis, steelmanning, \"translation\" into EA concepts, and riffing on the result. It's gone more heavily into the last two categories as I have written it. It's possible that some or even all of the authors wouldn't agree with how I have translated/riffed on their concerns. I've deliberately not attempted to reference specific articles for that reason.</i></p><p><i>I do not have object-level opinions of any significance in the animal-welfare space, and I do not indentify as a member of the ideological left. I don't have a clear opinion on whether EA should act differently in the animal-welfare space. However, I do think the book's contributors at least indirectly touch on some broader themes that are worth reflecting on.</i></p><p><u>How Farmed Animal Welfare </u><i><u>Might</u></i><u> Be Different</u></p><p>One key theme of the book seems to be an argument that EA methodology is reductionistic -- including that EA's cost-effectiveness analyses cannot capture the complexity of the world particularly well (especially in diverse cultural contexts), that a heavy focus on utilitarianism fails to capture all the dimensions we should be evaluating on, and so forth. Some of the authors seem to advocate for what I might call methodological diversification -- those authors don't necessarily seem opposed to EA-style interventions, but don't think animal advocacy should put too many vegan egg-substitutes in that (or perhaps any) basket.</p><p>It occured to me that how we think about methodological diversification could be different in farmed animal welfare than other cause areas. In (e.g.) global health &amp; development, EA spend is a small fraction of total spend in the cause area. So EA GH&amp;D work is relatively focused on what the other funders have missed or undervalued, and the methodological diversity in GH&amp;D comes predominately from what non-EA funders (e.g., Gates, governments) do. You can think that EA-favored projects and frameworks fail to measure and evaluate a lot of important outcomes, or that they give more credence to utilitarianism than warranted, and <u>still</u> think they are the best use of your marginal charitable dollar. In some other areas, EA may be the only actor, and so there is no risk of actively displacing pre-existing approaches.&nbsp;</p><p>I don't have a good sense of how large EA funding is a percentage of the entire farmed animal welfare (FAW) funding world. However, it seems plausible that, given how underfunded FAW has been historically, EA functions as a big fish in what is a rather small pond. And many of the authors seem to view EA in that light. Moreover, much existing non-EA funding may be bound as a practical matter to existing work, so it's plausible that an large proportion of the FAW funding potentially available for new or expanded work may be EA-flavored even if it's not as large in absolute terms.</p><p>Thus, the FAW context causes us to reflect on whether we think there is a limit on the proportion of charitable endeavor in a given cause area that should be conducted according to EA principles, and whether not disrupting methodological diversity becomes an important consideration at some point.</p><p><u>On Skepticism of Big Fish</u></p><p>EAs spill a lot of digital ink about epistemics. I wonder if a sizable fraction of the authors' concerns about and criticism of EA relate to epistemics -- what are the purposes of the FAW movement, and how can they best be achieved? Who decides the answers to those questions, and how?</p><p>Like most attempts at doing good, FAW needs a framework of ethical systems and values against which to evaluate its efforts. Where should that come from? I think the authors would be much more comfortable with answers like \"the viewpoints of people who have made sustained and significant personal sacrifices for FAW\" or even \"a survey of faculty in philosophy departments\" rather than giving much weight to \"the views of a few major EA funders and their agents.\"&nbsp;</p><p>I'm sure most of the authors had thought about utilitarianism as it relates to animal advocacy before EA got involved; Peter Singer wrote a while ago, and by my count six of the contributors hold positions in philosophy departments (plus two in religious studies). It's not unreasonable for them to doubt that the increased influence of utilitarianism on what gets funded in FAW was primarily driven by advances in utilitarian thought or by its increasing acceptance by a broad swath of society.&nbsp;</p><p>If you're sympathetic to EA ways of doing things, then having EA firepower in a cause area you care about is a good thing. If you <i>aren't </i>sympathetic, then you are probably worried about the effect of that firepower on the epistemics of your cause area. If that cause area is FAW, you probably don't think it healthy that the power wielded by a small group of people (wealthy capitalists and their agents) has an outsize effect on what the FAW movement does -- both now and in the future. Stated another way, you probably don't think that what major EA FAW donors think should update you much at all on what the epistemics of the FAW movement should be.&nbsp;</p><p>And this is consistent with how we might think about the epistemic implications of New Big Fish in general, behind a veil of ignorance of sorts (i.e, without knowing whether their perspective is better or worse than the mix of existing perspectives in one's cause area). We'd likely conclude that their viewpoints shouldn't change cause area epistemics much at all, because there is no a priori reason to think the New Big Fish knows better than the greater number of other participants.</p><p>A thought experiment: imagine someone lurking the Forum suddenly died and left Open Phil-level money in their will, restricted to the pursuit of effective altruism in a cause area that is currently viewed as second-tier and/or with a methodology that is currently viewed as second-tier. What would the likely effects on EA epistemics be? My guess is that, within a decade, people would think the cause area or methodology was significantly more important / more sound than they would have thought in the absence of the lurking benefactor. In other words, throwing lots of money around tends to alter epistemics in practice. Although it's possible that the hypothetical mysterious lurker knew better than the community consensus, it's more likely that they were acting as a unilateralist and generated net harmful changes in EA epistemics.</p><p><u>The Unilateralist's Curse</u></p><p>Although perhaps not clearly stated as such, I think there is a kernel of an argument about the unilateralist's curse in the book that goes <i>something </i>like this:</p><ul><li>(1) Some/many EA-inspired projects in FAW are bad, overrated, etc.</li><li>(2) Despite (1), they still get a ton of funding because they don't have to persuade a broad range of the relevant community of their worth; they only have to persuade one wealthy EA funder (or that person's agents).&nbsp;</li><li>(3) Pre-EA, an activist would need to get a lot of buy-in from others before taking an action that <i>could </i>produce a big net negative result (e.g., the risk that widespread cage-free corporate campaigns will impede efforts at getting people to stop eating eggs altogether, and the benefits of corporate campaigns are not worth that cost). Thus, the structural features of the pre-EA FAW world provided substantial protection against the risk of projects with significant net expected value.</li><li>(4) There is no ex ante reason to believe that wealthy EA funders (or their agents) are more capable of determining what is in animals' best interest than a larger group of people who have devoted significant sweat equity and sacrifice to the cause of FAW. In other words, ability to make a lot of money in the tech industry has little correlation with ability to serve as a proxy for farmed animals. Where the EA funder acts in opposition to the broader universe of people invested in FAW, this observation significantly raises the possibility that the wealthy EA funder is acting as a cursed unilateralist.</li></ul><p>My takeaway would be: when one is entering a new cause area with a large pocketbook, one should be careful to consult with existing stakeholders about proposed new projects, and listen carefully to any concerns they have about downside risk. (I don't know whether this happened in FAW or not.)</p><p><u>Thinking about the Long Term</u></p><p>Considering the effects of EA on the broader FAW ecosystem is particularly important to the extent that neither we nor the authors know where EA will focus its resources in a decade or two. For instance, it's plausible that more and more resources will flow to longtermist causes.&nbsp;</p><p>Apart from EA, FAW is most likely to draw funding and workers from communities that are rather left-focused in orientation. So, to the extent that EA's long-term commitment to the field isn't ironclad, it should be particularly careful to ensure that -- if it exits or sharply reduces investment -- the field is left in a position where it can carry on with the resources it has available to it. For instance, it would be bad for EA to transform the FAW field into one focused on working with corporations (e.g., corporate crate-free campaigns, alternative protein), to such an extent that there is a loss of institutional memory about other approaches, <i>and then leave</i>.</p><p><u>A Lesson for Each Side?</u></p><p>Interestingly, I think some of the lessons to draw from the book potentially apply to both sides (albeit to different extents and in different ways).&nbsp;</p><p>One suggestion is that, when critiquing those with different methodological commitments, one should always hold the mirror up to yourself as well. &nbsp;For instance, the author of the main post suggests a conflict of interest on the book authors' part, suggesting that at least some of them are reacting to threats of harm \"to the wallets of the authors and their allies.\" I think it's proper to consider that the authors may have personal reasons for their positions -- many have invested significant portions of their careers into that work and presumably draw a great sense of purpose/meaning/fulfillment from it. (I doubt many people in FAW are getting rich off the work, though!)</p><p>However, EAs should recognize that they have their own personal interests as well and are -- well, human (i.e., not dispassionate dispensers of utilons). For example, many people who have done well in a capitalist system are at higher risk of underrating arguments that capitalism is the root of much harm. And it's common to care a lot about how much impact you are personally generating, which could potentially bias people into favoring top-down solutions rather than taking a more indirect role of supporting grassroots activism.</p><p>It seems that it would be helpful to turn the temperature down a bit on both sides. That is <u>not </u>to suggest that disagreements shouldn't be vetted, that people's feelings aren't allowed to get hurt, or that anyone needs to sing songs around the campfire together. On a related note, I think sitting down and <i>talking </i>to one another is usually more productive than writing articles/blog posts/etc. at the other group (although the latter has its place). I don't have a podcast or anything, but think it would be fruitful to have some of these authors on an EA podcast for a mutual attempt at understanding perspectives and cruxes.</p>", "parentCommentId": null, "user": {"username": "Jason"}}, {"_id": "QFwpEaopfCgM6XAFe", "postedAt": "2023-05-09T18:36:53.658Z", "postId": "ZKYpu4WAiwTXDSrX8", "htmlBody": "<p>Thank you, Matthew, for writing this fantastic comment. The arguments from your essay seem a lot stronger to me now that I take your comment into consideration. It is true that higher education can be a great force for positive social change. As far as I know, many of those involved in emancipatory social movements were educated at university, and this can be no coincidence. And I wholeheartedly agree that getting people to go vegan is not a matter of telling them the arguments in favor of veganism, even if they are not aware of these arguments yet. We may indeed be far more successful if we can <i>first</i> get people to experience how vegan food can be just as delicious and healthy (if not more) than non-vegan food, and <i>then</i> get them to go vegan themselves. This is, in any case, how it worked for me: I was already a vegetarian, so I knew that you could eat great food without eating meat, and after recently discovering tofu, vegan mayonaise, coconut-based dairy yoghurt replacement and vegan chocolate desserts (all of which I had almost never eaten before), it became clear to me that I could eat great food without dairy and eggs too, and so I became a vegan too. Of course, I had already been (vaguely) aware of the arguments in favor of veganism for quite some time, but back then, I just couldn't picture myself enjoying vegan food. Indeed, we need to get people to experience how great vegan food is, and the proposals you discuss in your comment can definitely contribute to that.</p>", "parentCommentId": "CJti9N9byhmDdLNnA", "user": {"username": "Maxim Vandaele"}}, {"_id": "DkLGhCCkLwzMHjarZ", "postedAt": "2023-05-09T22:07:56.693Z", "postId": "ZKYpu4WAiwTXDSrX8", "htmlBody": "<p>Learned a ton about my own concerns from this post. Thank you for it!</p>\n", "parentCommentId": "vaYcccugC7QxRoc36", "user": {"username": "Matthew C. Halteman"}}, {"_id": "i9ckjJHmiboruvYx8", "postedAt": "2023-05-09T23:43:50.504Z", "postId": "ZKYpu4WAiwTXDSrX8", "htmlBody": "<p>About this footnote:<br><br>============================<br><br>Carol Adams even informs us that:</p><blockquote><p>Sebo and Singer flourish as academics in a white supremacist patriarchal society <i>because</i> others, including people of color and those who identify as women, are pushed down. (p. 135, emphasis added.)</p></blockquote><p>Maybe treading on the oppressed is a crucial part of Singer’s daily writing routine, without which he would never have written a word? If there’s some other reason to believe this wild causal claim, we’re never told what it is.<br><br>=============================<br><br>Here's a potential more charitable interpretation of this claim. Adams might not be claiming:<br><br>\"Singer personally performs some act of oppression as part of his writing process.\"<br><br>Adam's causal model might be more of the following:<br><br>\"Singer's ideas aren't unusually good; there are lots of other people, including people of color and those who identify as women, who have ideas that are as good or better. But those other people are being pushed down (by society in general, not by Singer personally) which leaves that position open for Singer. If people of color and those who identify as women weren't oppressed, then some of them would be able to outcompete Singer, leaving Singer to not flourish as much.\"</p>", "parentCommentId": null, "user": {"username": "Alex319"}}, {"_id": "nhGqRvtLCfJpfocBH", "postedAt": "2023-05-12T14:49:41.010Z", "postId": "ZKYpu4WAiwTXDSrX8", "htmlBody": "<p>It's interesting, I had heard some vague criticism from social justice communities that EA is bad, but at first I had dismissed it. Your review made me look up the book and compare what the book says to how EAs (that is, you) interpret the book. And I've got to say, a lot of the social justice criticism of EA really looks spot-on as critiques of your review. I'd encourage readers to do some epistemic spot checks of this review, as at least when I did so, it didn't seem to fare super well. On the other hand I will probably read the full book when I find the time.</p>", "parentCommentId": null, "user": {"username": "tailcalled"}}, {"_id": "NRuiPhf7SkdrCwQnt", "postedAt": "2024-01-21T16:21:24.150Z", "postId": "ZKYpu4WAiwTXDSrX8", "htmlBody": "<p>Hi Richard, thank for sharing your opinions.&nbsp;</p><p>The thing is, we all have opinions, it is great to think. However, when accumulated scientific evidence shows a direction on a certain topic, we are supposed to align our opinions with the scientific facts.</p><p>Criticism to your following opinion: \"w and technological progress are good. (Crazy, I know!)\"</p><p>Now we know <strong>quite clearly</strong> that economic growth is a major driver of ecological collapse (you can check the works of Parrique, Kallis, Hickel, Meadows, Haberl as a starting point). The rate of economic growth is so fast that our countermeasures (efficiency improvements, carbon capture technologies, etc.) are not sufficient enough to neutralize ecological impact due to the exponential growth of economic activities. In the past decades, Kuznetz claimed that after reaching a certain 'development' level of the economy, the ecological impact would reach a peak point, then start to decline despite the economic growth. Yet this did not happen and there is no supporting evidence that it is likely to happen in short run. Some argues that, for instance Hannah Ritchie from Our World in Data, that absolute decoupling of greenhouse gas emissions and economic growth has been achieved in some developed countries. This is true, yet it does not mean that these developed countries are still crossing planetary boundaries far more than their fair share (check &nbsp;2023 The Lancet Planetary Health article of Vogel). Their decoupling rate is insufficient and must be at least 16 times faster. And it is only about ghg emissions. A common mistake is to view the world with carbon tunnel vision. Economic activities do not only produce greenhouse gas emissions, and resource and material use have definitely not been decoupled from economic growth.</p><p>The main reason for the significant ecological impact of economic growth is that the world economy must <strong>continuously</strong> grow (otherwise, it collapses). This growth and economic activity is measured in gross domestic product. Any type of production contributes to the growth of gross domestic product (GDP). The production of food, housing, and clothes (basic needs) contributes to it. And also production of weapons, private jets, luxury items, space shuttles, animal products (unnecessary and unrelated to human welfare). I think the former can be classified as good, and the latter group can be classified as bad. We must be aware that the 'bad group of produced goods' contributes a lot to the growth of the world economy. Therefore, your argument that \" Generally speaking, I think economic growth and technological progress is good\" is refuted.</p><p>It is important to note that criticism of your argument does not mean criticism of your personality. Many people claim what you claim, probably because of the dominant 'growthist' ideology. Luckily it is refuted.&nbsp;</p><p>Similarly, carnistic ideology teaches us that animals are food and it is necessary and good to eat them. Luckily, it is also wrong, and we refute this ideology's claims as well.&nbsp;</p><p>Lastly, about the book you criticized. I did not read it, but I will definitely read it. You seem to be giving emotional reactions to its critics. Yet the book provides with opportunity for ea people to improve. The following quote for instance:</p><p>\"Effective Altruists will no doubt continue to see hopeful signs of incremental, quantitative progress in specific areas of policy—e.g., in extreme poverty or malaria reduction—right up to the moment when the entire system collapses, <i>leaving billions to starve to death and all animal life obliterated</i>. (pp. 218-19, emphasis added)\"</p><p>This quote emphasizes that we are moving toward an ecological and systemic collapse. The probability of it happening is increasing after every COP or climate summit fails to address the root causes of the crisis. Of course, EA people should continue to do their best to help others effectively. However, the inability to see the direction of systemic collapse is widespread among EA people. For instance, the opinion of 80000 on climate change is very much a carbon-tunnel vision and can even be considered climate denialism (they do not even evaluate ecological collapse and 6th mass species extinction from planetary boundaries and ecological tipping points perspective). Soon, there might not be a functioning society EA people would be able to do their philantrophy in. This is the warning.</p>", "parentCommentId": null, "user": {"username": "canadali"}}, {"_id": "yvbMLzPSY8Frf8tbb", "postedAt": "2023-05-03T14:36:23.111Z", "postId": "ZKYpu4WAiwTXDSrX8", "htmlBody": null, "parentCommentId": "yca8vj8XYgEEa8bvj", "user": null}]