[{"_id": "QubmxKzLdw2wJxXhP", "postedAt": "2023-10-06T12:41:54.288Z", "postId": "ZNcdt7eYWW7YXALvx", "htmlBody": "<p><strong>Executive summary:</strong> The development and implementation of Artificial Intelligence (AI) could have profound implications for animals, both positive and negative, across various areas including animal farming, animal advocacy, research, and potential risks tied to AI advancement.</p><p><strong>Key points</strong>:</p><ol><li>AI could automate factory farming, boosting production and minimizing oversight. But it could also enable humane monitoring and meat alternatives.</li><li>Technology often overlooks animal welfare, but AI could also transform infrastructure to avoid harm. Expansion into space is an uncertainty.</li><li>AI-driven population control and animal testing raise ethical issues. But medical drones and lab-grown meat alternatives could counterbalance them.</li><li>Virtual minds and diminished human-animal bonds are concerning. But understanding interspecies communication and caring for digital beings may increase compassion.</li><li>We can't reliably predict AI's implications for animals. Lock-in scenarios or unnoticed harms are risks. But productivity gains and moral circle expansion are hopes.</li><li>Thoughtful governance, transparency, and civil society participation are essential to direct AI in an animal-friendly direction. But uncertainty remains high.</li></ol><p>&nbsp;</p><p><i>This comment was auto-generated by the EA Forum Team. Feel free to point out issues with this summary by replying to the comment, and</i><a href=\"https://forum.effectivealtruism.org/contact\"><i>&nbsp;<u>contact us</u></i></a><i> if you have feedback.</i></p>", "parentCommentId": null, "user": {"username": "SummaryBot"}}, {"_id": "AREqSA2mZAbkdWxbt", "postedAt": "2023-10-06T18:03:24.140Z", "postId": "ZNcdt7eYWW7YXALvx", "htmlBody": "<p>Thanks a lot for the post! I’m happy that people are trying to combine the field of longtermism and animal welfare.&nbsp;</p><p>&nbsp;</p><p>Here’s a few initial thoughts from a non-professional (note I didn't read the full post so I might have missed something):&nbsp;</p><p>I generally believe that moral circle expansion, especially for wild animals and artificial sentience, is one of the best universal ways to help ensure a net positive future. I think that invertebrates or artificial sentience will make up the majority of moral patients in the future. I also suspect this to be good in a number of different future scenarios, since it could lower the chance of s-risks and better the scenario for animals (or artificial sentience) no matter if there will be a lock-in scenario or not.&nbsp;</p><p>I think progression in short-term direct WAW interventions is also very important since I find it hard to believe that many people will care about WAW unless they can see a clear way of changing the status quo (even if current WAW interventions will only have a minimal impact). I also think short-term WAW interventions could help to change the narrative that interfering in nature is inherently bad.&nbsp;<br>(Note: I have personally noticed several people that have similar values as me (in terms of caring greatly about WAW in the far future) only caring little about short-term interventions.)</p><p>It could of course be argued that working directly on reducing the likelihood of certain s-risk and working on AI-alignment might be a more efficient way of ensuring a better future for animals. I certainly think this might be true, however I think these measures are less reliable due to the uncertainty of the future.&nbsp;</p><p>I think Brian Tomasik has written great pieces on why <a href=\"https://reducing-suffering.org/dont-focus-hedonistic-imperative/\">animal-focused hedonistic imperative</a> and <a href=\"https://reducing-suffering.org/will-gene-drives-reduce-wild-animal-suffering/\">gene drive</a> might be less promising and more unlikely than it seems. I do personally also believe that it’s unlikely to ever happen on a large scale for wild animals. However, I think if it happens and it’s done right (without severely disrupting ecosystems), genetic engineering could be the best way of increasing net well-being in the long term. But I haven't thought that much about this.&nbsp;</p><p>&nbsp;</p><p>Anyways, I wouldn't be surprised if you already have considered all of these arguments.&nbsp;</p><p>&nbsp;</p><p>I’m really looking forward to your follow-up post :) &nbsp;</p>", "parentCommentId": null, "user": {"username": "Jens Aslaug"}}, {"_id": "bmxkJLTGSmRcLDfgc", "postedAt": "2023-10-09T09:18:35.713Z", "postId": "ZNcdt7eYWW7YXALvx", "htmlBody": "<p>Hey Jens, thanks a lot for your comment! I agree that moral circle expansion efforts and direct WAW interventions seem like really important elements of a portfolio of actions to bring about a net-positive future.&nbsp;</p><p>In terms of the unreliability of AI-specific animal advocacy actions given the uncertainty of the future: I guess there could be some pretty broad actions that would apply across various areas and scenarios, like lobbying governments to ensure that animal interests are mentioned in any cross-cutting national/international standards and regulations on responsible AI use. The best bet might be a balance of those sorts of actions with more targeted, industry-specific actions (like engaging with regulators to ensure that AI systems used in e.g. intensive chicken farming are sensitive enough to genuinely detect most welfare concerns).&nbsp;</p><p>Thanks for those resources on gene drives, I'll check them out!</p><p>And cheers, watch this space! :-)&nbsp;</p>", "parentCommentId": "AREqSA2mZAbkdWxbt", "user": {"username": "max_blakemore"}}, {"_id": "vnHS8vvWEyqbasCXF", "postedAt": "2023-10-09T12:23:27.699Z", "postId": "ZNcdt7eYWW7YXALvx", "htmlBody": "<p>I agree. :) Your idea of lobbying and industry-specific actions might also be more neglected. In terms of WAW, I think it could help reduce the amount of human caused suffering to wild animals, but likely not have an impact on natural caused suffering.&nbsp;</p>", "parentCommentId": "bmxkJLTGSmRcLDfgc", "user": {"username": "Jens Aslaug"}}, {"_id": "5rWzdoS9pRYJzhbkQ", "postedAt": "2023-10-19T03:07:01.912Z", "postId": "ZNcdt7eYWW7YXALvx", "htmlBody": "<p><br>Thanks for that excellent summary, Max.&nbsp;<br>One area I haven't seen addressed to date is the potential impact of AI on commensal rodents that are considered pests. I like to imagine that a device such as the Rae robot &lt;https://www.kickstarter.com/projects/opencv/rae-0/description&gt; might be trained to effectively track comings and goings of unwelcome critters, identifying entry points and issuing instructions for effective exclusion, helping avert use of cruel devices like glue traps.<br>Wish I had the skill to implement something like that. Would love to hear from anyone who does ;-)</p>", "parentCommentId": null, "user": {"username": "Stephen Ronan"}}, {"_id": "aat9GpneK5pY8eRnb", "postedAt": "2023-10-24T09:13:52.252Z", "postId": "ZNcdt7eYWW7YXALvx", "htmlBody": "<p>Cheers Stephen, that's really interesting! Taking your example, I can also imagine people finding ways to use this tech to e.g. track down and kill rodents in their homes more efficiently, so definitely agree this is an important area to explore in more detail.</p>", "parentCommentId": "5rWzdoS9pRYJzhbkQ", "user": {"username": "max_blakemore"}}, {"_id": "3YjwvQANTPd76cJRe", "postedAt": "2023-11-07T09:13:45.768Z", "postId": "ZNcdt7eYWW7YXALvx", "htmlBody": "<p>Thanks, <a href=\"https://forum.effectivealtruism.org/users/max-taylor?from=post_header\"><strong>Max Taylor</strong></a><strong>, </strong>for this post. I wasn't aware of the extent of the harm that can be caused by AI. I knew about the problems that could arise on large farms, the intensification of production, and the significant harm to animals, but I never thought about self-driving cars that can collide with small animals. This text perfectly summarized my lack of knowledge about AI, and I look forward to another post on this topic. The amount of sources is incredible; thanks to you, I learned about human-controlled insects, which raises another ethical issue.</p>", "parentCommentId": null, "user": {"username": "Rahela"}}, {"_id": "MzWtGrQeyDiYXsoTX", "postedAt": "2023-11-07T18:16:56.774Z", "postId": "ZNcdt7eYWW7YXALvx", "htmlBody": "<p>Thanks Rahela, really appreciate the feedback and great to hear that you found it helpful!</p>", "parentCommentId": "3YjwvQANTPd76cJRe", "user": {"username": "max_blakemore"}}]