[{"_id": "xHMutCh8HuySAruDL", "postedAt": "2022-11-15T00:45:56.845Z", "postId": "ZnhLAzQxSi9svpkLQ", "htmlBody": "<p>\"Meanwhile, at a meeting with Alameda employees on Wednesday, Ms. Ellison explained what had caused the collapse, according to a person familiar with the matter. Her voice shaking, she apologized, saying she had let the group down. Over recent months, she said, Alameda had taken out loans and used the money to make venture capital investments, among other expenditures.</p><p>Around the time the crypto market crashed this spring, Ms. Ellison explained, lenders moved to recall those loans, the person familiar with the meeting said. But the funds that Alameda had spent were no longer easily available, so the company used FTX customer funds to make the payments. Besides her and Mr. Bankman-Fried, she said, two other people knew about the arrangement: Mr. Singh and Mr. Wang.\"</p>", "parentCommentId": null, "user": {"username": "Darren McKee"}}, {"_id": "xQt8wpXeTix4xLs4A", "postedAt": "2022-11-15T00:59:31.503Z", "postId": "ZnhLAzQxSi9svpkLQ", "htmlBody": "<p>I'll add this to the post :)&nbsp;</p>", "parentCommentId": "xHMutCh8HuySAruDL", "user": {"username": "Lauren Maria"}}, {"_id": "DtE9zE8syqpbSN98P", "postedAt": "2022-11-15T01:18:13.400Z", "postId": "ZnhLAzQxSi9svpkLQ", "htmlBody": "<p>I think Sam comes across very poorly here, even given the situation. I’m not sure who benefitted from him giving this interview. The ‘cryptic tweets’ make it seem like he’s treating the whole situation like some kind of joke, and the focus seems to be on his and FTX’s failures rather than the &nbsp;creditors who have been wronged. Quoting the article:</p><p><br>\"Shortly before the interview, Mr. Bankman-Fried had posted a cryptic tweet: the word “What.” Then he had tweeted the letter H. Asked to explain, Mr. Bankman-Fried said he planned to post the letter A and then the letter P. “It’s going to be more than one word,” he said. “I’m making it up as I go.”</p><p>So he was planning a series of cryptic tweets? “Something like that.”<br><br>But why? “I don’t know,” he said. “I’m improvising. I think it’s time.”\"</p>", "parentCommentId": null, "user": {"username": "TheoC"}}, {"_id": "WvLo9sJRHage2vTqk", "postedAt": "2022-11-15T01:35:10.426Z", "postId": "ZnhLAzQxSi9svpkLQ", "htmlBody": "<p>Yes, that's exactly how I feel too. It seems like he doesn't grasp the magnitude of this, and thinks he can come back from it. The jokes just make it seem like he doesn't have compassion for the number of people who were effected by this. I was disappointed, but I guess I shouldn't have been expecting much.&nbsp;</p>", "parentCommentId": "DtE9zE8syqpbSN98P", "user": {"username": "Lauren Maria"}}, {"_id": "7oq5CthAyCtpLh54j", "postedAt": "2022-11-15T02:13:31.102Z", "postId": "ZnhLAzQxSi9svpkLQ", "htmlBody": "<p>I agree - I sympathise with the people who lost the money, and I can see them being furious after reading this article. People have different methods of dealing with stress, some binge eats, and some play video games. Still, I think we as a community need to be more compassionate towards SBF and provide him with the legal right to be treated as innocent until proven guilty.&nbsp;</p>", "parentCommentId": "DtE9zE8syqpbSN98P", "user": {"username": "Jayasimha Nuggehalli"}}, {"_id": "LHbJ3TdtmRyKqHSwA", "postedAt": "2022-11-15T02:24:25.260Z", "postId": "ZnhLAzQxSi9svpkLQ", "htmlBody": "<p>Apparently the video game 'Storybook Brawl' that Sam mentions in the article is a game he <a href=\"https://www.geekwire.com/2022/storybook-brawl-developer-acquired-by-crypto-exchange-firm-ftx/\">owns</a>. &nbsp;This is sort of off topic, but still interesting.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Lauren Maria"}}, {"_id": "bCrt5SrH2eqyWCnKB", "postedAt": "2022-11-15T03:28:51.910Z", "postId": "ZnhLAzQxSi9svpkLQ", "htmlBody": "<p><a href=\"https://twitter.com/AutismCapital/status/1592343051523198977\">https://twitter.com/AutismCapital/status/1592343051523198977</a></p><p>Get the word out. &nbsp;To everyone.</p><p>Before I saw this, I was still open to a redemption arc for SBF, if he was willing to accept the legal consequences for what he did.</p><p>But after? &nbsp;There is no longer any reasonable doubt that, whatever he was before, he is an unlawful oathbreaker now.</p><p>EDIT: suspending judgment after <a href=\"https://twitter.com/ercwl/status/1592378315431550977\">https://twitter.com/ercwl/status/1592378315431550977</a> .</p>", "parentCommentId": "DtE9zE8syqpbSN98P", "user": null}, {"_id": "YRfv58xjqztTKCK3w", "postedAt": "2022-11-15T03:39:03.351Z", "postId": "ZnhLAzQxSi9svpkLQ", "htmlBody": "<p>See my comment above.</p><p>Legal rights, ok. &nbsp;Compassion? &nbsp;Not anymore. &nbsp;Anyone who still voluntarily associates with him (outside of formal services like legal representation), after being aware of both the NYT reporting of his tweets and what he has actually been doing with them, should be permanently exiled from the EA community, if the EA community wants to survive. &nbsp;This is obvious.</p><p>EDIT: suspending judgment after <a href=\"https://twitter.com/ercwl/status/1592378315431550977\">https://twitter.com/ercwl/status/1592378315431550977</a> . &nbsp;The principle remains, though: if he tries to escape any consequences for what he did, that's the last straw.</p>", "parentCommentId": "7oq5CthAyCtpLh54j", "user": null}, {"_id": "frvLsxn5yojQJegQj", "postedAt": "2022-11-15T04:04:37.266Z", "postId": "ZnhLAzQxSi9svpkLQ", "htmlBody": "<p>I find his risk quote most concerning. I don’t really even get it to be honest.</p>\n<p>How on one hand can you bet big on upside, and on the other not be concentrated enough on what you’re doing to see what’s going on with risk? Let alone in financial markets!</p>\n<p>Feels like an absolute bastardization of any reasonable approach to EV wrt decision making.</p>\n<p>Maybe this was the crux of problem… yet somehow he’s turning it into his excuse.</p>\n", "parentCommentId": null, "user": null}, {"_id": "TvQZNp7MtbrCRMuoB", "postedAt": "2022-11-15T04:11:33.545Z", "postId": "ZnhLAzQxSi9svpkLQ", "htmlBody": "<p>Maybe not expecting much, but certainly expecting more than this!</p>\n<p>Not only did he ignore those effected, but he demeaned them. “It could be worse” appears he’s looking on the bright side of having lost billions worth of customer money, billions in potential giving had been maintained his station/profits over time, all while setting back EA considerably in the public eye.</p>\n<p>Could it be worse?</p>\n", "parentCommentId": "WvLo9sJRHage2vTqk", "user": null}, {"_id": "chqjctj9BbwPNr9GS", "postedAt": "2022-11-15T04:17:39.448Z", "postId": "ZnhLAzQxSi9svpkLQ", "htmlBody": "<p>Note that he is now also attempting to obstruct justice; see <a href=\"https://twitter.com/AutismCapital/status/1592343051523198977\">https://twitter.com/AutismCapital/status/1592343051523198977</a> , and compare to what he said in the NYT article.</p><p>If he had just lost his coin flip, and then accepted the consequences of that loss, that would be one thing. &nbsp;But no.</p><p>EDIT: suspending judgment after <a href=\"https://twitter.com/ercwl/status/1592378315431550977\">https://twitter.com/ercwl/status/1592378315431550977</a> .</p>", "parentCommentId": "TvQZNp7MtbrCRMuoB", "user": null}, {"_id": "a2h2frP7xz52rPbvH", "postedAt": "2022-11-15T04:47:53.952Z", "postId": "ZnhLAzQxSi9svpkLQ", "htmlBody": "<p>That account &gt; NYT</p>\n", "parentCommentId": "chqjctj9BbwPNr9GS", "user": null}, {"_id": "twWedX8Gtjy62Si3w", "postedAt": "2022-11-15T04:50:19.795Z", "postId": "ZnhLAzQxSi9svpkLQ", "htmlBody": "<p>I can't believe he is taking to the media and on Twitter. His criminal defense lawyer -- assuming he is wise enough to have one -- is probably in the ER right now having a hypertensive emergency.</p>\n", "parentCommentId": null, "user": {"username": "Jason"}}, {"_id": "pkvqw4LbRJLphmsaA", "postedAt": "2022-11-15T04:52:19.384Z", "postId": "ZnhLAzQxSi9svpkLQ", "htmlBody": "<p>Strong agree</p>", "parentCommentId": "a2h2frP7xz52rPbvH", "user": {"username": "Lauren Maria"}}, {"_id": "MzXkcy4D8ofhTv69t", "postedAt": "2022-11-15T05:24:46.730Z", "postId": "ZnhLAzQxSi9svpkLQ", "htmlBody": "<p>\"exiled from community\" is a bit too harsh, no? This edit is an excellent example of why one should not judge too quickly, or rather we as a community should not be too quick to judge. When SBF was able to contribute, we said SBF was a poster boy for earning to give; now, we say no one should even associate. &nbsp;We need to learn to slow down and listen deeply before we judge.&nbsp;</p>", "parentCommentId": "YRfv58xjqztTKCK3w", "user": {"username": "Jayasimha Nuggehalli"}}, {"_id": "pkeJbG5sAaLj3rfi5", "postedAt": "2022-11-15T05:29:24.852Z", "postId": "ZnhLAzQxSi9svpkLQ", "htmlBody": "<p>I agree that \"exiled from community\" is strong language, but \"slow down and listen deeply before we judge\" doesn't make any sense if you consider how many people lost money, careers, funding, etc from his poor decisions, which he is showing almost no remorse for. Taking naps and playing video games? That must be nice when people are genuinely in a bind because their projects were being funded by the FTX Future Fund.&nbsp;</p>", "parentCommentId": "MzXkcy4D8ofhTv69t", "user": {"username": "Lauren Maria"}}, {"_id": "HDKsKDbZ767JKLzSR", "postedAt": "2022-11-15T05:33:16.992Z", "postId": "ZnhLAzQxSi9svpkLQ", "htmlBody": "<p>Yes, I'm leaving the comment and edit in place as evidence for your point.</p><p>With that said, there is (i) some time pressure here, and (ii) the consequences of a mistake on my part were minimal if I was wrong, so I don't regret my initial comments, I'm willing to eat the consequences for having guessed wrong. &nbsp;The tone of this NYT article makes it clear that there are powerful organizations and people still defending him as we speak. &nbsp;In the event there ever is clear evidence that he is STILL an \"unlawful oathbreaker\", as opposed to being willing to walk the long road to redemption, no, I do not think \"exiled from community\" is too harsh a penalty for continued unnecessary association with him.</p>", "parentCommentId": "MzXkcy4D8ofhTv69t", "user": null}, {"_id": "s4TCSTgyjazaRdygZ", "postedAt": "2022-11-15T05:41:28.578Z", "postId": "ZnhLAzQxSi9svpkLQ", "htmlBody": "<p>Yikes.<br><br>As an outside observer I appreciate getting this insight, but boy oh boy I would have told her to not say it if I was her lawyer.</p>", "parentCommentId": "xHMutCh8HuySAruDL", "user": {"username": "Nathan Ashby"}}, {"_id": "2i3TiKrb4dkp2fj8z", "postedAt": "2022-11-15T05:50:34.783Z", "postId": "ZnhLAzQxSi9svpkLQ", "htmlBody": "<p>It may be difficult to parse what happened as an outsider, but for those who work in or near finance it is clear that Sam engaged in wildly unethical and illegal behaviour.</p>\n<p>At a minimum, Sam played a reckless game with customer deposits and gambled with money that was never his. At the worst, Sam had suffered massive losses in his hedge fund and tried to use FTX deposits to survive (creating a form of Ponzi scheme). At the moment it appears a mix of the two of is true. It’s horrific fraud either way.</p>\n<p>The hole he has dug is very, very deep (billions of dollars deep) and a redemption arc is not forthcoming.</p>\n", "parentCommentId": "MzXkcy4D8ofhTv69t", "user": {"username": "RagtagJack"}}, {"_id": "MbeWfcMYYQY523bLR", "postedAt": "2022-11-15T06:00:34.681Z", "postId": "ZnhLAzQxSi9svpkLQ", "htmlBody": "<p>I will still push back on \"exiled from community\" - it almost makes it seem like EA is a cult, which I hope it's not.</p>", "parentCommentId": "HDKsKDbZ767JKLzSR", "user": {"username": "Jayasimha Nuggehalli"}}, {"_id": "W69NSaanExcJmvRHx", "postedAt": "2022-11-15T06:33:13.547Z", "postId": "ZnhLAzQxSi9svpkLQ", "htmlBody": "<p>And I will stand by it, due to the magnitude of the problem and the visible power of his defenders.</p><p>Now, I've really only been EA-adjacent so far, I've never attended any EA-affiliated events beyond a solstice and a house gathering. &nbsp;But I do have some common sense about how trust works. &nbsp;I do not see an alternative path for the EA community to regain trust in the event he is proven to still be an unlawful oathbreaker.</p><p>Again, this does not apply if he <i>was</i> an oathbreaker but is now unusually accepting of the consequences.</p>", "parentCommentId": "MbeWfcMYYQY523bLR", "user": null}, {"_id": "etEaveosKiXeSi95M", "postedAt": "2022-11-15T09:55:34.821Z", "postId": "ZnhLAzQxSi9svpkLQ", "htmlBody": "<p>How can we provide him with that legal right? We're not a court. Are you suggesting we withhold moral judgement until a court provides one? Besides being far too high an epistemic bar for judging people's actions, that will probably be years away, at which point EA's reputation would (rightly) have withered away.</p>", "parentCommentId": "7oq5CthAyCtpLh54j", "user": {"username": "David Mears"}}, {"_id": "RRA4BNckEhbiprqTd", "postedAt": "2022-11-16T17:52:14.930Z", "postId": "ZnhLAzQxSi9svpkLQ", "htmlBody": "<p>He should change his name to Bankrupt-Fried</p>", "parentCommentId": null, "user": {"username": "J.Alexa"}}]