[{"_id": "oHM3HsGXNyxNSXLAC", "postedAt": "2022-11-10T03:53:50.302Z", "postId": "ZpFzTwBKHkLDeQ9Ms", "htmlBody": "<p>Seems interesting, I'll def check it out sometime&nbsp;<br><br>Jokes &nbsp;aside, this is a cool idea. I wonder if reading it yourself and varying the footage, or even adapting the concepts into something &nbsp;would help it be more attractive to watch. Though of course these would all increase the time investment cost. I can't say it's my jam but I'd be curious to see how these do on TikTok though since they seem to be a sort of prevalent genre/content style.&nbsp;</p>", "parentCommentId": null, "user": {"username": "Peter Gebauer"}}, {"_id": "oQrMd2s5HttH39Cri", "postedAt": "2022-11-10T11:07:49.254Z", "postId": "ZpFzTwBKHkLDeQ9Ms", "htmlBody": "<p>I like the idea, though I think even in that reddit overlay format, which I've seen, people are unlikely to watch a 9 minute tiktok.</p>", "parentCommentId": null, "user": {"username": "ChanaMessinger"}}, {"_id": "HvfvD3RYpm8R95hQW", "postedAt": "2022-11-10T16:18:23.025Z", "postId": "ZpFzTwBKHkLDeQ9Ms", "htmlBody": "<p>Interesting idea! I do like the subway surfers format.</p><p>If you upload them to TikTok I would be interested to learn what kind of engagement they get. I agree with Chana's comment that they seem pretty long, but it's hard to predict these things.</p>", "parentCommentId": null, "user": {"username": "Ben_West"}}, {"_id": "jYNQgLmDnLWs58ZRF", "postedAt": "2022-11-10T21:42:00.706Z", "postId": "ZpFzTwBKHkLDeQ9Ms", "htmlBody": "<p>Oh my goodness, this worked on me! I think you're onto gold</p>\n", "parentCommentId": null, "user": {"username": "Pseudonym101"}}, {"_id": "Gu9WttbAivuaWP8vH", "postedAt": "2022-11-13T23:36:10.915Z", "postId": "ZpFzTwBKHkLDeQ9Ms", "htmlBody": "<p>I agree with other commenters saying 9mins seems too long but the general idea is good. I think a human read shorter summary would be really good. A lot of the videos like this I’ve seen also have some synthy soundtrack over the top which I’d add, just because I was put off by it being missing</p>\n", "parentCommentId": null, "user": {"username": "Will Payne"}}]