[{"_id": "3m32yePsQ2oCh8oFi", "postedAt": "2022-10-01T05:38:20.521Z", "postId": "ZPNNnEu2HGNSNmifo", "htmlBody": "<p>You may be interested in this convo I had about research on pedagogical models. The tl;dw if you just want the interventions that have replicated with large effects sizes:</p><ol><li><a href=\"https://fs.blog/deliberate-practice-guide/\">Deliberate practice</a></li><li>&nbsp;Lots of low stakes quizzing</li><li>Elaboration of context (deliberately structuring things to give students the chance to connect knowledge areas themselves)</li><li>Teaching the material to others (forcing organization of the material in a way helpful to the one doing the teaching, and helping them identify holes in their own understanding)</li></ol><figure class=\"media\"><div data-oembed-url=\"https://www.youtube.com/watch?v=HRkUcbQ639o\"><div><iframe src=\"https://www.youtube.com/embed/HRkUcbQ639o\" allow=\"autoplay; encrypted-media\" allowfullscreen=\"\"></iframe></div></div></figure>", "parentCommentId": null, "user": {"username": "RomeoStevens"}}, {"_id": "62pA8GKSgjKqqfAEK", "postedAt": "2022-10-01T10:31:06.448Z", "postId": "ZPNNnEu2HGNSNmifo", "htmlBody": "<p>Thanks so much for writing this up.&nbsp;<br>I carefully read through the \"how to teach effectively in five steps\" and got a lot of value from it. &nbsp;I've yet to read through other aspects of the blog post.&nbsp;<br><br><br>The thing I love the most about this section is that it builds on robust findings from meta-analyses. Why do I love this? Because i) <i><strong>nothing</strong></i><strong> &nbsp;</strong>in community-building is based on robust evidence and &nbsp;ii) it counteracts a tendency for EA to rely to much on what's EA - reinventing a new paradigm rather than recalling that the majority of what's useful in the world in the world isn't \"EA\" (we're substantially standing on the shoulders of giants).<br><br>Additionally, here's a couple of reactions and questions to five step section specifically:<br>1. I appreciate the focus on defining a learning objective as a skill and then working backward from that. &nbsp;I think that \"creating personal theory of changes and impactful career plans that one can wholeheartedly (or agentically) pursue\" is a good default to have in mind. One downside to this approach is that it might lead to Goodharting and leading the teacher to go in \"exploitation\" mode. &nbsp;E.g., I worry that I might become too attached to a specific outcome on behalf of the students and tacitly start to persuade (similar to some concerns expressed by <a href=\"https://forum.effectivealtruism.org/posts/xomFCNXwNBeXtLq53/bad-omens-in-current-community-building\">Theo Hawkins)</a> and/or neglect other important opportunities that might emerge during the program. How do you think of that risk?<br><br>2. Can you say anything about what forms summative assessments are particularly useful? For Future Academy, we're contemplating pitching project ideas or presentation and discussion of career plans (although we likely wouldn't label it as an assessment but rather as an exciting culmination of their work).&nbsp;<br><br>3. I think there's a typo under 3a. (“Formative assessments” —&gt; formative activities)?<br><br>4. While I appreciate the rigor of the evidence upon which this post is built, I worry about this being true for <i>on average for average university students </i>and might not generalize to the subpopulation that some portion of community-building efforts is targetted towards (e.g., people who are in the 90th percentile on various domains, including openness to experience, conscientiousness, need-for-cognition, etc.). How worried are you about this?<br><br>5. Strongly agree with the importance of role models. Humans are deeply social and our social incentives (including role models) might be <a href=\"https://www.goodreads.com/quotes/11138756-the-truth-is-that-a-more-reasoned-approach-to-politics\">the most important things</a> to change. In fact, being generally good people (or virtuous) in addition to the unique virtues you mentioned appears important as we have some research showing that this might be <a href=\"https://www.sciencedirect.com/science/article/pii/S0022103117308181?via%3Dihub\">off-putting</a>. Finally, same-race role-models <a href=\"https://www.iza.org/publications/dp/10630\">appear to be particularly important</a>.</p>", "parentCommentId": null, "user": {"username": "SebastianSchmidt"}}, {"_id": "5soy7B8KHoYRoN5wz", "postedAt": "2022-10-01T10:35:47.476Z", "postId": "ZPNNnEu2HGNSNmifo", "htmlBody": "<p>Regarding self-determination theory. How would you relate that to agency &nbsp;(similarities and differences)? Agency (or the related <a href=\"https://dictionary.apa.org/self-efficacy\">self-efficacy</a>) appears relatively popular among EA and has been around in psychology for a while.</p>", "parentCommentId": null, "user": {"username": "SebastianSchmidt"}}, {"_id": "bYsLeAu3wbM6EvJS8", "postedAt": "2022-10-03T06:51:04.336Z", "postId": "ZPNNnEu2HGNSNmifo", "htmlBody": "<p>It will take me some time to digest the information in this post, and I've only skimmed through part of it so far, but I want to express my appreciation for providing such a resource-dense post.</p>", "parentCommentId": null, "user": {"username": "jlemien"}}, {"_id": "wqv3eusYrvqR8FbA6", "postedAt": "2022-10-03T12:28:15.631Z", "postId": "ZPNNnEu2HGNSNmifo", "htmlBody": "<p>Thanks for writing this post! I would love to see how elements of what is reported here could potentially improve CEA's virtual introductory program and be more discussed among/taught to community builders on a consistent basis. I look forward to digesting these topics more properly to see how it can benefit the work I do as university group supporter.</p>", "parentCommentId": null, "user": {"username": "Simon Holm"}}, {"_id": "KriB3oofE6DHQRaZH", "postedAt": "2022-10-04T06:37:18.307Z", "postId": "ZPNNnEu2HGNSNmifo", "htmlBody": "<p>This is a useful list of interventions, some of which are mentioned in the post (e.g., quizzes; <a href=\"https://www.inspiretoolkit.com.au/articles/quizzes\">we've summarised the meta-analyses for these here</a>). I <a href=\"https://forum.effectivealtruism.org/posts/ZPNNnEu2HGNSNmifo/we-all-teach-here-s-how-to-do-it-better#How_to_teach_effectively__in_five_steps\">think steps 1, 2 and 3 from the summary of the above post</a> are the 'teacher focused' versions of how to promote deliberate practice (have a focus, get feedback, fix problems). Deliberate practice literature often tells <i>learners</i> how they should structure their own practice (e.g., how musicians should train). &nbsp;Teaching to others is a useful way to frame collaboration in a way that makes it safe to not know all the answers. Thanks for the nudges.</p>", "parentCommentId": "3m32yePsQ2oCh8oFi", "user": {"username": "mnoetel"}}, {"_id": "5jhA5mFArGbtvQbEL", "postedAt": "2022-10-06T00:13:11.687Z", "postId": "ZPNNnEu2HGNSNmifo", "htmlBody": "<p>Thanks for taking the time to add these really useful observation, Seb.</p><blockquote><p>One downside to this approach is that it might lead to Goodharting and leading the teacher to go in \"exploitation\" mode. &nbsp;E.g., I worry that I might become too attached to a specific outcome on behalf of the students and tacitly start to persuade (similar to some concerns expressed by <a href=\"https://forum.effectivealtruism.org/posts/xomFCNXwNBeXtLq53/bad-omens-in-current-community-building\">Theo Hawkins)</a> and/or neglect other important opportunities that might emerge during the program. How do you think of that risk?</p></blockquote><p>&nbsp;It's been a while since I read Theo's post so I might be missing the mark here. I agree both explore and exploit are important, especially for young people. I haven't thought deeply about this but my intuition says \"if it's also important to x, be explicit that you have multiple goals.\" For example, to use 'create personal theory of change' via Future Academy is the goal, you might also want people to 'create tentative career plans for 5 distinct careers', or 'develop connections so you have 3 people you could call to ask for career advice'. Sure the latter isn't a 'learning objective' and it might be better un-said. Still, I think a generally good way of goodharting might be using multiple goals or criteria for success.</p><blockquote><p>2. Can you say anything about what forms summative assessments are particularly useful? For Future Academy, we're contemplating pitching project ideas or presentation and discussion of career plans</p></blockquote><p>The word that comes to mind is to make it 'authentic.' Basically, make it as close as possible to the real world skill you want people to do. This is rare. Universities expect critical thinking, creativity, and communication, but use recall-based multiple-choice questions. I've seen essays and reflections to assess interpersonal skills, instead of videos or presentations. Pitching project ideas and presenting career plans sounds well above average. If I had to nit-pick, I've never 'presented my career plans', so to make it slightly closer to something people might do anyway would be 'write a grant application.'</p><blockquote><p>I think there's a typo under 3a. (“Formative assessments” —&gt; formative activities)?</p></blockquote><p>Both are things. I should have clarified it. Formative assessments are formative activities that count toward a grade or completion status. As mentioned by <a href=\"https://forum.effectivealtruism.org/posts/ZPNNnEu2HGNSNmifo/we-all-teach-here-s-how-to-do-it-better?commentId=3m32yePsQ2oCh8oFi#comments\">another commenter</a>, low-stakes quizzes are helpful for providing feedback and accountability to learners, but better fit university courses than fellowships etc.</p><blockquote><p>I worry about this being true for <i>on average for average university students </i>and might not generalize to the subpopulation that some portion of community-building efforts is targetted towards (e.g., people who are in the 90th percentile on various domains, including openness to experience, conscientiousness, need-for-cognition, etc.). How worried are you about this?&nbsp;</p></blockquote><p>This is an important question. I don't think I know yet how big a problem this is (as I said, <a href=\"https://forum.effectivealtruism.org/posts/ZPNNnEu2HGNSNmifo/we-all-teach-here-s-how-to-do-it-better#If_you_want_to_study_how_to_do_this_better__reach_out_\">people should reach out if they want to work on it</a>). One of the benefits of having worked in sport and performance psychology is that it mostly focuses on people in the top 1–5% of their field. As far as I can tell, the core principles underlying most of the above (psychological needs; deliberate practice; cognitive load limits) still apply to those people. You do need to calibrate the challenge to the person. People in the top 5% are going to be bored if you spend 10 hours explaining a t-test. So, &nbsp;I'm sure some things don't generalise perfectly, but I think that's more likely to be the specific techniques (e.g., 'use quizzes') than the mechanisms (e.g., 'provide feedback').</p><blockquote><p>... being generally good people (or virtuous) in addition to the unique virtues you mentioned appears important as we have some research showing that this might be <a href=\"https://www.sciencedirect.com/science/article/pii/S0022103117308181?via%3Dihub\">off-putting</a>. Finally, same-race role-models <a href=\"https://www.iza.org/publications/dp/10630\">appear to be particularly important</a>.</p></blockquote><p>Yeah I didn't go into this much so it's a good pickup. Both are useful to remember.</p>", "parentCommentId": "62pA8GKSgjKqqfAEK", "user": {"username": "mnoetel"}}, {"_id": "8YZkk2kYqRC7jbKbu", "postedAt": "2022-10-06T00:25:13.069Z", "postId": "ZPNNnEu2HGNSNmifo", "htmlBody": "<p>So in education 'agency' is often defined as 'agentic engagement'—basically taking ownership over your own learning. I couldn't find any good systematic reviews on interventions that increase agentic engagement. This is pretty weak evidence and might have a healthy dose of motivated reasoning (my end, and theirs), but people who have thought about <a href=\"https://www.tandfonline.com/doi/full/10.1080/00405841.2019.1702451\">agency for longer than I have seem to think</a>...</p><blockquote><p>In conclusion, the answer as to how teachers can support students’ agentic engagement is to adopt a significantly more autonomy-supportive classroom motivating style.</p></blockquote><p>... so I don't have any better ideas than <a href=\"https://forum.effectivealtruism.org/posts/ZPNNnEu2HGNSNmifo/we-all-teach-here-s-how-to-do-it-better#Educators_that_support_autonomy_tend_to_\">those described above</a>.</p>", "parentCommentId": "5soy7B8KHoYRoN5wz", "user": {"username": "mnoetel"}}, {"_id": "Tij2bYcFpd67fgwkf", "postedAt": "2022-10-07T09:22:34.094Z", "postId": "ZPNNnEu2HGNSNmifo", "htmlBody": "<p>This is great content! Thank you for writing and sharing it. I added the tag \"High Impact Psychology\" because this is an example of how psychology can help to increase EA impact.</p>", "parentCommentId": null, "user": {"username": "Inga"}}, {"_id": "nLZMHXnCLCf7y3Kd5", "postedAt": "2022-10-11T08:10:34.540Z", "postId": "ZPNNnEu2HGNSNmifo", "htmlBody": "<p>There's a typo:<br>\"(<i>r</i> = .3; about ~10% of the variance explained [<i><strong>R²</strong></i><strong> = .01</strong>]\" --&gt; \"R^2=0.1\"</p>", "parentCommentId": null, "user": {"username": "SebastianSchmidt"}}, {"_id": "ihPqqhQyT9kcqhzGR", "postedAt": "2022-10-11T22:30:54.761Z", "postId": "ZPNNnEu2HGNSNmifo", "htmlBody": "<p>Ahhh! Yes, thanks. Fixed.</p>\n", "parentCommentId": "nLZMHXnCLCf7y3Kd5", "user": {"username": "mnoetel"}}, {"_id": "ewWdniQYHNy3EFrco", "postedAt": "2022-10-12T11:59:16.638Z", "postId": "ZPNNnEu2HGNSNmifo", "htmlBody": "<p>That makes sense in the context of education. However, I'd add that agency also contains some components related to general ability (and perceived ability) to exert influence on the world in a way that's aligned with one's values.\nThe section on what autonomy supportive educators tend to do is highly valuable. Appears quite related to coaching (although coaching is a much broader term).</p>\n", "parentCommentId": "8YZkk2kYqRC7jbKbu", "user": {"username": "SebastianSchmidt"}}]