[{"_id": "rqFFfaErN4zxW65q5", "postedAt": "2023-07-29T20:18:00.516Z", "postId": "ZQ77uGtKX8mR4vtxo", "htmlBody": "<p>Very interesting discussion. I think something that (understandably, as your thesis here is narrow) should be considered is how ethical theories outside of utilitarianism and deontology should be considered. Although you provided a fairly strong argument against deontology, there was no argument for <i>uniquely</i> utilitarianism as many of the intuition you had against deontology could also apply to most other ethical theories. Perhaps a virtue ethical, care ethical, or communitarian approach could accommodate for the short comings of deontology as well as (or maybe better than!) utilitarianism.&nbsp;</p><p>Thank you for the post!</p>", "parentCommentId": null, "user": {"username": "Ryan F Baylon"}}, {"_id": "7YzuFywXZLotffHfx", "postedAt": "2023-07-29T20:33:29.264Z", "postId": "ZQ77uGtKX8mR4vtxo", "htmlBody": "<p>I'm not fully sure to what extent this piece means to argue for i) utilitarianism beats deontology, versus ii) utilitarianism is the correct moral theory or at least close to the correct moral theory. (At times it felt to me like the former, and at times the latter, though it's very possible that I did not read closely enough.)</p><p>To the extent that ii is the intended conclusion, I think this is overconfident on a couple of counts. Firstly, one’s <a href=\"https://forum.effectivealtruism.org/posts/2WS3i7eY4CdLH99eg/independent-impressions\">all-things-considered view</a> should probably take into account that only 30% of academic philosophers are consequentialists (see <a href=\"https://philarchive.org/archive/BOUPOP-3\">Bourget &amp; Chalmers, 2020, p. 8</a>; note that consequentialism is a superset of utilitarianism). Secondly, reasons relating to infinite ethics. As Joe Carlsmith (<a href=\"https://forum.effectivealtruism.org/posts/CeeeLu9PoDzcaSfsC/on-infinite-ethics\">2022</a>) puts it:</p><blockquote><p>I think infinite ethics punctures a certain type of utilitarian dream. It’s a dream I associate with the utilitarian friend quoted above (though over time he’s become much more of a nihilist), and with various others. In my head (content warning: caricature), it’s the dream of hitching yourself to some simple ideas – e.g., expected utility theory, totalism in population ethics, maybe&nbsp;<a href=\"https://handsandcities.com/2021/02/14/contact-with-reality/\">hedonism about well-being</a> — and riding them wherever they lead, no matter the costs. Yes, you push fat men and harvest organs; yes, you destroy Utopias for tiny chances of creating zillions of evil, slightly-happy rats (plus some torture farms on the side). But you always “know what you’re getting” – e.g., more expected net pleasure.</p><p>…</p><p>But I think infinite ethics changes this picture. As I mentioned above: in the land of the infinite, the bullet-biting utilitarian train runs out of track. You have to get out and wander blindly. The issue isn’t that you’ve become fanatical about infinities: that’s a bullet, like the others, that you’re willing to bite. The issue is that once you’ve resolved to be 100% obsessed with infinities,&nbsp;<i>you don’t know how to do it</i>. Your old thing (e.g., “just sum up the pleasure vs. pain”) doesn’t make sense in infinite contexts, so your old trick – just biting whatever bullets your old thing says to bite – doesn’t work (or it leads to&nbsp;<i>horrific&nbsp;</i>bullets, like trading&nbsp;<i>Heaven + Speck</i> for&nbsp;<i>Hell + Lollypop</i>, plus a tiny chance of the lizard). And when you start trying to craft a new version of your old thing, you run headlong into Pareto-violations, incompleteness, order-dependence, spatio-temporal sensitivities, appeals to persons as fundamental units of concern, and the rest. In this sense, you start having problems you thought you transcended – problems like the problems the other people [e.g., deontologists] had. You start having to rebuild yourself on new and jankier foundations.</p><p>…</p><p>All in all, I currently think of infinite ethics as a lesson in humility: humility about how far standard ethical theory extends; humility about [...] how little we might have seen or understood.</p></blockquote>", "parentCommentId": null, "user": {"username": "Will Aldred"}}, {"_id": "KqYh4dWzfgLYsjgcg", "postedAt": "2023-07-29T20:45:40.403Z", "postId": "ZQ77uGtKX8mR4vtxo", "htmlBody": "<p>I respectfully disagree. Firstly, that is by no means the last word on infinite ethics (see papers by Manheim and Sandberg, and a more recent paper out of the Global Priorities Institute). Prematurely abandoning utilitarianism because of infinites is a bit like (obviously the analogy is not perfect) abandoning the general theory of relativity because it can’t deal with infinities.</p>\n<p>Secondly, we should act as if we are in a finite world: it would be seen as terribly callous of someone not to have relieved the suffering of others if it turned out we were in a finite universe all along. It is telling that virtually no one has substantively changed their actions as a result of infinite ethics. This is sensible and prudent.</p>\n<p>Thirdly, in an infinite world, we should understand that utilitarianism is not about maximising some abstract utility function or number in the sky, but about improving the conscious experiences of sentient beings. Infinities don’t change the fact that I can reduce the suffering of the person in front of me, or the sentient being on the other side of the world, or the fact that this is good for them. And there are good practical, utilitarian reasons not to spend one’s time focusing on other potential worlds.</p>\n", "parentCommentId": "7YzuFywXZLotffHfx", "user": {"username": "JBentham"}}, {"_id": "gkgoEM2z8h2EL5ix7", "postedAt": "2023-07-29T22:22:43.614Z", "postId": "ZQ77uGtKX8mR4vtxo", "htmlBody": "<p>Thank you for engaging. Respectfully, however, I’m not compelled by your response.</p><blockquote><p>Prematurely abandoning utilitarianism because of infinites is a bit like [...].</p></blockquote><p>I’m not saying that we should prematurely abandon utilitarianism (though perhaps I did not make this clear in my above comment). I’m saying that we do not have an “ultimate argument” for utilitarianism at present, and that there’s a good chance that further reflection on known unknowns such as infinite ethics will reveal that our current conception of utilitarianism—in so far as we’re putting it forward as a “correct moral theory” candidate—is non-trivially flawed.</p><blockquote><p>Secondly, we should act as if we are in a finite world [...] This is sensible and prudent.</p></blockquote><p>I disagree. I think we should act to do the most good, and this may involve, for example,&nbsp;<a href=\"https://longtermrisk.org/msr\"><u>evidentially cooperating</u></a> with other civilizations across the potentially infinite universe/multiverse. Your sentence “it would be seen as terribly callous of someone not to have relieved the suffering of others if it turned out we were in a finite universe all along” seems to me to be claiming that we should abandon expected value calculus (or that we should set our credence on the universe/multiverse being infinite to zero, notwithstanding the possibility that we could reduce suffering by a greater amount by having and acting on a best guess credence), which I view as incorrect.</p><blockquote><p>Thirdly, [...] Infinities don’t change the fact that I can reduce the suffering of the person in front of me, or the sentient being on the other side of the world</p></blockquote><p>I believe this claim falls foul of the Pareto improvement plus agent-neutrality impossibility result in infinite ethics, once you try to decide on whose suffering to reduce. (Another objection some—e.g.,&nbsp;<a href=\"https://nickbostrom.com/ethics/infinite.pdf\"><u>Bostrom</u></a>—might make is that if there is infinite total suffering, then reducing suffering by a finite amount does nothing to reduce total suffering. But I'm personally less convinced by this flavor of objection.)</p>", "parentCommentId": "KqYh4dWzfgLYsjgcg", "user": {"username": "Will Aldred"}}, {"_id": "CZFfjmxj2k4ufjFe2", "postedAt": "2023-07-29T23:17:48.780Z", "postId": "ZQ77uGtKX8mR4vtxo", "htmlBody": "<p>Thanks for your response. It seems we disagree on much less than I had initially assumed. My response was mostly intended for someone who has prematurely become a nihilist (as apparently happened to one of Carlsmith’s friends), whereas you remain committed to doing the most good. And I was mainly addressing the last flavour of objection you mention.</p>\n", "parentCommentId": "gkgoEM2z8h2EL5ix7", "user": {"username": "JBentham"}}, {"_id": "mZjxqEeLXKnDiBnr7", "postedAt": "2023-07-30T23:46:26.891Z", "postId": "ZQ77uGtKX8mR4vtxo", "htmlBody": "<p>If we reject any side constraints--which my argument supports--then we get something very near utilitarianism. &nbsp;</p>", "parentCommentId": "rqFFfaErN4zxW65q5", "user": {"username": "Omnizoid"}}, {"_id": "tAwBxpucTEJwTDxTu", "postedAt": "2023-07-30T23:47:13.495Z", "postId": "ZQ77uGtKX8mR4vtxo", "htmlBody": "<p>It was trying to argue for 2. &nbsp;I think that if we give up any side constraints, which is what my piece argued for, we get something very near utilitarianism--at the very least consequentialism. &nbsp;Infinitarian ethics is everyone's problem.&nbsp;</p>", "parentCommentId": "7YzuFywXZLotffHfx", "user": {"username": "Omnizoid"}}, {"_id": "KrnLqKcjuS8ntG5kk", "postedAt": "2023-08-05T17:58:25.298Z", "postId": "ZQ77uGtKX8mR4vtxo", "htmlBody": "<p>Correct me if Im wrong, but it doesnt seem like virtue ethics or care ethics relies on side constraints -- they seem uniquely deontic. Im not sure that rejecting deontology implies a form consequentialism as virtue or feminist ethics are still viable at that point.&nbsp;</p>", "parentCommentId": "mZjxqEeLXKnDiBnr7", "user": {"username": "Ryan F Baylon"}}, {"_id": "oKAno3vQ25fm2429L", "postedAt": "2023-08-27T12:53:56.148Z", "postId": "ZQ77uGtKX8mR4vtxo", "htmlBody": "<p>They will still endorse the same things as side constraints views do (E.g. not killing one to save 5).&nbsp;</p>", "parentCommentId": "KrnLqKcjuS8ntG5kk", "user": {"username": "Omnizoid"}}]