[{"_id": "PYnd4nM58jToMZ7Fr", "postedAt": "2014-09-23T12:33:16.799Z", "postId": "ZqiGXrqLQg2ocFGQk", "htmlBody": "<p>A corollary of my view here is that I hope in a few year's time the distribution of causes supported looks different to now, because I think that will be indicative of an appropriate openness to change.</p>\n", "parentCommentId": null, "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "pwihmXYPsNZbS5BZN", "postedAt": "2014-09-23T14:13:16.727Z", "postId": "ZqiGXrqLQg2ocFGQk", "htmlBody": "<p>Thanks for the great post Owen, this is an important topic. I agree that one can go too far in pushing others to change cause if they sincerely think that a different one is best, for reasons including epistemic modesty and being nice. But I also agree that the potential good done is significant enough to make some efforts in this regard. I'm personally struck by how little effort I see EAs make to persuade others of particular causes or charities, given the value that this would have given a decent chance of success (as I briefly discussed in my <a href=\"http://effective-altruism.com/ea/5o/where_im_giving_and_why_tom_ash/\">Where I'm giving and why</a> post.)</p>\n<p>Also, as I said when representing global poverty in the causes debate at last year's CEA away weekend, I think that dialogues about which causes to focus on would be most productive if they were focused on specific actions or, even better, charities. This makes them concrete and action relevant for those of deciding whether to donate to, say, deworming or an alternative charity within a different cause area.</p>\n", "parentCommentId": null, "user": {"username": "Tom_Ash"}}, {"_id": "bcXDhhQkuR4urSALK", "postedAt": "2014-09-23T14:54:12.121Z", "postId": "ZqiGXrqLQg2ocFGQk", "htmlBody": "<p>I share Tom's feeling of being struck by this. As someone who is relatively young and undecided, I would appreciate more people arguing for their own causes/paths. I agree there is a <em>happy medium</em> here, and I would likely put it in a place of, &quot;People who focus on a particular cause publicly state their reasoning and welcome critique, but don't actively try to 'convert' others unless invited to do so.&quot; I would love to hear such reasoning (with critique) from many EAs.</p>\n", "parentCommentId": "pwihmXYPsNZbS5BZN", "user": null}, {"_id": "jZM9o4BkJ77DvsfET", "postedAt": "2014-09-23T14:59:09.243Z", "postId": "ZqiGXrqLQg2ocFGQk", "htmlBody": "<blockquote>\n<p>But I also agree that the potential good done is significant enough to make some efforts in this regard. I'm personally struck by how little effort I see EAs make to persuade others of particular causes or charities, given the value that this would have given a decent chance of success.</p>\n</blockquote>\n<p>I think this may be right. I'd like to see more careful discussion of this -- perhaps with posts on this forum laying out a clear case for various different causes. One reason that it happens less than it might is that trying it's not just a case of trying to persuade them that the thing you like is <em>good</em> -- you also have to persuade them that it's <em>better</em> than the thing they like. This can make it seem more like an attack, which may put people off (perhaps correctly).</p>\n<p>Something which I think would help here would be more willingness to engage in creating and critiquing cost-effectiveness estimates. While they have limitations they are ultimately one of the best methods we have for <em>comparing</em> between different kinds of outcome. I have the impression that the EA community may have turned away from them a little further than ideal. (I plan to write more on this and I how I think they might best be used.)</p>\n", "parentCommentId": "pwihmXYPsNZbS5BZN", "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "9Y7YAQhNnxD4W4YA9", "postedAt": "2014-09-23T15:12:16.784Z", "postId": "ZqiGXrqLQg2ocFGQk", "htmlBody": "<blockquote>\n<p>I think that dialogues about which causes to focus on would be most productive if they were focused on specific actions or, even better, charities. This makes them concrete and action relevant for those of deciding whether to donate to, say, deworming or an alternative charity within a different cause area.</p>\n</blockquote>\n<p>I substantially disagree with this. I do think there are some advantages to bringing it right down to the concrete at times, but I think that discussing causes is often useful for deciding things like <em>where to investigate or wait further for specific opportunities</em>, and asking for definite actions can inadvertently cut off consideration of such options. </p>\n<p>I'd prefer for example to think of &quot;we already have good knowledge about great charities in global health&quot; as a factor in favour of it as a cause. I think this has the extra benefit that cause comparison is a hard and complicated question, so it's best to avoid complicating it further by trying to consider how good specific charities are <em>at the same time</em>, if this can be factored out and considered separately.</p>\n", "parentCommentId": "pwihmXYPsNZbS5BZN", "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "dFphHQqzZSC4j9Q9q", "postedAt": "2014-09-23T15:27:20.774Z", "postId": "ZqiGXrqLQg2ocFGQk", "htmlBody": "<blockquote>\n<p>I think this may be right. I'd like to see more careful discussion of this -- perhaps with posts on this forum laying out a clear case for various different causes. </p>\n</blockquote>\n<p>That would be great!</p>\n<blockquote>\n<p>One reason that it happens less than it might is that trying it's not just a case of trying to persuade them that the thing you like is good -- you also have to persuade them that it's better than the thing they like. This can make it seem more like an attack, which may put people off (perhaps correctly).</p>\n</blockquote>\n<p>Agreed that this makes it tricky, and this consequence of focusing on what's 'best' reminds me of what Jess described in <a href=\"http://effective-altruism.com/ea/7x/supportive_scepticism/\">Supportive Scepticism</a>. Hopefully EAs can find a way to have productive discussions about these things that aren't phrased or taken as attacks.</p>\n", "parentCommentId": "jZM9o4BkJ77DvsfET", "user": {"username": "Tom_Ash"}}, {"_id": "gjxTr898JvsrxzNzj", "postedAt": "2014-09-23T15:38:27.013Z", "postId": "ZqiGXrqLQg2ocFGQk", "htmlBody": "<blockquote>\n<p>I do think there are some advantages to bringing it right down to the concrete at times, but I think that discussing causes is often useful for deciding things like where to investigate or wait further for specific opportunities, and asking for definite actions can inadvertently cut off consideration of such options.</p>\n</blockquote>\n<p>That could be so. My focus on this concrete question partly stems from being concerned with the issue I presented at the weekend away talk: I was going to give several thousand pounds to charity that year, so needed to hear a specific alternative that was better than AMF. I also find it helpful to discuss the more tractable issue of choosing between specific charities first, where one can look at things like track record. But there are certainly other ways of looking at the issue! </p>\n", "parentCommentId": "9Y7YAQhNnxD4W4YA9", "user": {"username": "Tom_Ash"}}, {"_id": "nEuDS7cPHC83HLyqm", "postedAt": "2014-09-23T20:23:41.927Z", "postId": "ZqiGXrqLQg2ocFGQk", "htmlBody": "<p>Thanks for a really interesting post Owen! Movements, religions and groups of people in general seem really prone to schisms, even when they have a pretty well defined view, so it seems like disagreements leading to people falling out could be one of the big risks effective altruism faces, given the diversity of views and the emphasis on finding the very best thing. I like your emphasis on epistemic modesty and creating a collaborative culture. I also like your suggestion of forum posts carefully stating the case for different causes. Hopefully if we succeed in making a collaborative culture, that will help both at avoiding those kinds of posts being felt as an attack, and preventing comments on them from getting too vehement, which will make writers happier to post them. </p>\n<p>One thing it might be nice to see more of is people writing about and defending different causes than the ones they usually do. I think most people interested in effective altruism think that there are many causes that are really effective, and focus on a particular one either because it seems probably even more effective than the others, or just because they can’t do everything. It would be really nice for that to be more evident outside of informal discussions, for example in the posts people write. It seems difficult to do that, partly because it might seem obvious, and partly because it’s boring to talk about things that the people in the discussion already agree on. Yet that makes it easy, at least from a distance, to get the impression that people barely agree, and for people to feel confrontational towards each other.</p>\n<p>I wonder if it might even be good to avoid too much asking people ‘what cause do you support?’. A question like that feels like it creates an expectation that people pin their colours to a particular mast, which could create a confrontational rather than collaborative atmosphere.</p>\n", "parentCommentId": null, "user": {"username": "Michelle_Hutchinson"}}, {"_id": "2txjbESZ8q5tkzdNA", "postedAt": "2014-09-23T23:42:33.006Z", "postId": "ZqiGXrqLQg2ocFGQk", "htmlBody": "<p>There's an interesting question related to this which is: Suppose Alice will work well as an EA as long as she believes she is fighting for global poverty now. Alice's emotions are tuned to her long term goal of decreasing poverty. It is also the case that if Alice believed X-risk was more important, she would not be as motivated to work (emotionally, or due to not feeling she has relative advantage in X-risk reduction).  Should Bob try to persuade Alice of the importance of X-risk?\nI say no. If there is strong reason to suggest that Alice is more effective at reaching the instrumental goals of all EA's while believing something that she will be convinced against in the future, at least for the time being, we should let her be. </p>\n<p>Giving What We Can might not have started if Toby Ord didn't think poverty alleviation was the outstanding cause of our age. IF he is convinced now that actually Superintelligence is more important, the benefit that he created for poverty alleviation will still thrive. Also due to the propensity to having minds changed of EA's, the creation of GWWC may well increase the number of people studying and working in Superintelligence. </p>\n", "parentCommentId": null, "user": {"username": "Diego_Caleiro"}}, {"_id": "Sqgk2g9ibB5S54Nxq", "postedAt": "2014-09-23T23:42:51.894Z", "postId": "ZqiGXrqLQg2ocFGQk", "htmlBody": "<blockquote>\n<p>One thing it might be nice to see more of is people writing about and defending different causes than the ones they usually do.</p>\n</blockquote>\n<p>Interesting idea. How much detail would you expect such articles to go into? It seems they run the risk of a knee-jerk, this is not what EA is about, downvote.</p>\n", "parentCommentId": "nEuDS7cPHC83HLyqm", "user": {"username": "Dale"}}, {"_id": "ovXQhH2PjeydmzMfw", "postedAt": "2014-09-24T00:31:42.026Z", "postId": "ZqiGXrqLQg2ocFGQk", "htmlBody": "<p>I tend to tell people that I don't know enough to support a particular cause yet.  That seems to work well at avoiding pinning myself down, and it's true.</p>\n", "parentCommentId": "nEuDS7cPHC83HLyqm", "user": {"username": "Peter_Hurford"}}, {"_id": "tMnTppWnxjuXa9xQX", "postedAt": "2014-09-24T08:55:32.969Z", "postId": "ZqiGXrqLQg2ocFGQk", "htmlBody": "<p>My reading of Michelle's point was not that we should be writing about and defending causes that we wouldn't normally think of as EA (although this <em>could</em> also be beneficial!) - I think she meant, within the space of the causes EAs generally talk about, it would be good if people wrote about and defended causes different to the ones they normally do. So, for example, if a person is known for talking about and defending animal causes, they could spend some time also writing about and defending xrisk or poverty. This would then lessen the impression that many people are &quot;fixed&quot; to one cause, but wouldn't have the problem you mention. I might be reading this wrong though.</p>\n", "parentCommentId": "Sqgk2g9ibB5S54Nxq", "user": {"username": "Jess_Whittlestone"}}, {"_id": "PoZjq4LaXZpv24S5p", "postedAt": "2014-09-24T09:13:02.961Z", "postId": "ZqiGXrqLQg2ocFGQk", "htmlBody": "<p>A nice middle ground between &quot;not talking about our reasons for supporting different causes at all&quot; and &quot;having people try to persuade others that their cause is the most important one&quot; could be to simply encourage more truth-seeking, collaborative discussion about causes. </p>\n<p>So rather than having people lay out their case for different causes (which risks causing people to get defensive and further entrenching peoples' sense of affiliation to a certain cause, and a divide between different &quot;groups&quot; in the movement) it would be nice to see more discussion where people who support different causes explicitly try and find out where their disagreements lie, and learn from each other. I'm thinking of the kind of <a href=\"http://intelligence.org/wp-content/uploads/2014/02/Conversation-with-Holden-Karnofsky-about-Future-Oriented-Philanthropy.pdf\">discussion that was had between Eliezer, Luke and Holden</a>, for example, where they discussed their views on the far future and eventually found they didn't disagree as much as they thought they did. This kind of thing seems <em>really</em> valuable, both in terms of learning and bringing people closer together.</p>\n", "parentCommentId": null, "user": {"username": "Jess_Whittlestone"}}, {"_id": "zcbeCD8RM5soEu7Hi", "postedAt": "2014-09-24T09:23:12.352Z", "postId": "ZqiGXrqLQg2ocFGQk", "htmlBody": "<p>I meant Jess' reading, sorry I wasn't clear. I was thinking people would write about / defend causes they thought were very effective, though they weren't the ones they usually focused on (and perhaps weren't the one they thought very most effective). I think the knee-jerk would mostly be a problem if people wrote about causes they didn't actually think were particularly effective, which does seem like it would be problematic.</p>\n", "parentCommentId": "tMnTppWnxjuXa9xQX", "user": {"username": "Michelle_Hutchinson"}}, {"_id": "y7v8BbEbqW96sW4Ns", "postedAt": "2014-09-27T20:26:57.127Z", "postId": "ZqiGXrqLQg2ocFGQk", "htmlBody": "<p>I believe a substantial portion of effective altruism, like myself, are drawn by the general principles, approaches, and examples effective altruism provides of so much good being done, but don't yet favor a particular cause. For me, I don't which cause I consider the best to currently be working in.</p>\n<p>I wonder how many effective altruists who have a mixed opinion between two, or more, causes. That is, effective altruists who don't favor one cause because they can't tell which if any seems most promising, but because the case between at least two of them is so close that it seems too difficult to decide given current evidence.</p>\n", "parentCommentId": null, "user": {"username": "Evan_Gaensbauer"}}]