[{"_id": "zjX9ovMwGbu93yyNJ", "postedAt": "2023-03-21T00:14:51.624Z", "postId": "ZSFWLn6ZKfy3rj8Kf", "htmlBody": "<p>Thank you for going through the effort of writing this up!</p>\n<p>Ditto this experience of a successful stall (we've also been iterating on a set up similar to yours) but difficulty translating that into regular event attendance (about a handful). EA UNSW (Australia). New member influx tends to come from catching folks who have discovered EA via internet or through event collaborations with other related societies. Tabling at the start of the year has caught such EA internet lurkers.</p>\n", "parentCommentId": null, "user": {"username": "chelsea_liang"}}, {"_id": "if4LiAwspAzJKJP6d", "postedAt": "2023-03-21T01:25:11.008Z", "postId": "ZSFWLn6ZKfy3rj8Kf", "htmlBody": "<p>Thanks for sharing—this seems like a good strategy. I'm curious what people said when you asked whether they had heard of EA; like, what percent had, and of those, what percent had a positive/neutral/negative impression?</p>", "parentCommentId": null, "user": {"username": "hobbes"}}, {"_id": "5YFdePmae8DMCnMqF", "postedAt": "2023-03-21T02:38:33.018Z", "postId": "ZSFWLn6ZKfy3rj8Kf", "htmlBody": "<p>I'd say maybe 10% of people we talked to said they'd heard of EA. Most of those were fairly evenly split between \"Positive impression after having some form of previous/current engagement\" and \"Have seen news about FTX/SBF\", with some overlap between the two groups. There were 1 or 2 with vague neutral impressions.&nbsp;</p>", "parentCommentId": "if4LiAwspAzJKJP6d", "user": {"username": "TJPHutton"}}, {"_id": "h9DeGfyXv96RLp89e", "postedAt": "2023-03-21T09:23:20.583Z", "postId": "ZSFWLn6ZKfy3rj8Kf", "htmlBody": "<p>To add more data here from a different location, we ran tabling (~30 hours / 70 man-hours) across 4 different universities in first month of term, and did not go on to find any significant impact (i.e. newsletter sign-ups, but no-new members).&nbsp;</p>", "parentCommentId": null, "user": {"username": "ElliotJDavies"}}]