[{"_id": "WgdqXRKx9AnAjGfHq", "postedAt": "2023-05-14T20:04:16.654Z", "postId": "ZtZmkgDW6MH8AEEK6", "htmlBody": "<p>Re revenue, $200M is only 833k paid subscribers using chatGPT with GPT-4 (it's $20/month). This seems like a massive underestimate.</p>", "parentCommentId": null, "user": {"username": "Greg_Colbourn"}}, {"_id": "e9x7Crbqzijf4SLhf", "postedAt": "2023-05-14T20:52:58.572Z", "postId": "ZtZmkgDW6MH8AEEK6", "htmlBody": "<p>There are public biotech companies with ~$10B valuations and higher price/sales ratios:\n<a href=\"https://finviz.com/screener.ashx?v=121&amp;f=cap_midover&amp;o=-ps\">https://finviz.com/screener.ashx?v=121&amp;f=cap_midover&amp;o=-ps</a></p>\n<p>And private valuations are much more generous than public valuations</p>\n", "parentCommentId": null, "user": {"username": "Pat Myron"}}, {"_id": "TtcN3NwWiQdkEfshd", "postedAt": "2023-05-14T22:39:36.062Z", "postId": "ZtZmkgDW6MH8AEEK6", "htmlBody": "<blockquote><p>One particularly confusing fact is that OAI's valuation appears to have gone from $14 billion in 2021 to $19 billion in 2023. Even ignoring anything about transformative AI, I would have expected that the success of ChatGPT etc. should have resulted in a more than a 35% increase.</p></blockquote><p>I've frequently seen people fail to consider the fact that potential competitors (including borderline copycats) can significantly undermine the profitability of one company's technology, even if the technology could generate substantial revenue. Are you taking this into account?</p>", "parentCommentId": null, "user": {"username": "Harrison D"}}, {"_id": "ikdbZAjifBgtTLCgz", "postedAt": "2023-05-14T23:00:24.783Z", "postId": "ZtZmkgDW6MH8AEEK6", "htmlBody": "<p>Amazing, thanks! I will update the post appropriately.</p>\n", "parentCommentId": "e9x7Crbqzijf4SLhf", "user": {"username": "Ben_West"}}, {"_id": "Z6eyFrYyAZZqGDx8i", "postedAt": "2023-05-14T23:15:41.273Z", "postId": "ZtZmkgDW6MH8AEEK6", "htmlBody": "<p>I have not done a formal analysis, but yes, even given the possibility of copycats I still feel like the unexpected success of ChatGPT should have resulted in more than a 35% increase to their value.</p>", "parentCommentId": "TtcN3NwWiQdkEfshd", "user": {"username": "Ben_West"}}, {"_id": "eJHTPoMTborSJBXTm", "postedAt": "2023-05-14T23:21:41.882Z", "postId": "ZtZmkgDW6MH8AEEK6", "htmlBody": "<blockquote><p>A BOTEC indicates that Open AI might have been valued at &gt;200x their annual recurring revenue, which is by far the highest multiple I can find evidence of for a company of that size. This seems consistent with the view that markets think OAI will be exceptional, but not “equivalent to the Industrial Revolution” exceptional, and a variety of factors make this multiple hard to interpret.</p></blockquote><p>I would be very cautious about trying to extract information from private valuations, especially at this still somewhat early stage. Private markets are far less efficient than public ones, large funding rounds are less efficient still, and large funding rounds <i>led by the organization that controls your infrastructure</i> might as well be poker games.&nbsp;</p>", "parentCommentId": null, "user": {"username": "yefreitor"}}, {"_id": "XdBoDQJJuzzdKqsFh", "postedAt": "2023-05-14T23:22:23.421Z", "postId": "ZtZmkgDW6MH8AEEK6", "htmlBody": "<p>It looks to me like paid subscriptions <a href=\"https://openai.com/blog/chatgpt-plus\">were not available</a> in January? But regardless: if <a href=\"https://www.reuters.com/technology/chatgpt-sets-record-fastest-growing-user-base-analyst-note-2023-02-01/\">they have 100M MAUs</a> then 833k paid would be ~1% of their user base which doesn't seem crazy to me?</p><p>I would love better numbers here though, if you have them.</p>", "parentCommentId": "WgdqXRKx9AnAjGfHq", "user": {"username": "Ben_West"}}, {"_id": "JgNwBBiGDhprAB2oC", "postedAt": "2023-05-15T09:51:02.591Z", "postId": "ZtZmkgDW6MH8AEEK6", "htmlBody": "<p>Private R&amp;D cannot be protected perfectly because patents expire or industry know-how diffuses to other firms and not all rents from investments can be captured. There was a leaked memo out of Google recently that said that <a href=\"https://www.semianalysis.com/p/google-we-have-no-moat-and-neither\">Open source foundation models are very good and don't need much compute to run</a>. Recently, OpenAI's CEO Altman has often highlighted that their models are not based on any one fundamental technical breakthrough, but thousands of little hacks from tinkering- but perhaps this is wrong and a strategic statement to boost the valuation of the company.&nbsp;</p>", "parentCommentId": null, "user": {"username": "HaukeHillebrandt"}}, {"_id": "TEWfxSeZEKr7jfpzN", "postedAt": "2023-05-15T10:05:57.439Z", "postId": "ZtZmkgDW6MH8AEEK6", "htmlBody": "<p>Paid subscriptions started with the official release of GPT-4 (March). 100M is likely a significant underestimate now, I don't think the user-base saturated there. This say <a href=\"https://www.demandsage.com/chatgpt-statistics/#:~:text=ChatGPT%20currently%20has%201.16%20billion,million%20users%20within%20two%20months.\">1B users</a> (but doesn't seem that credible). Also 1% seems kind of low when the GPT-4 answers are significantly better (I guess you can also get GPT-4 for free on Bing though). I'd be surprised if there were &lt;10M paid subscribers (c.f. Netflix and Spotify with ~200M each).</p>", "parentCommentId": "XdBoDQJJuzzdKqsFh", "user": {"username": "Greg_Colbourn"}}, {"_id": "8Aju5NoB3uyDPNLK4", "postedAt": "2023-05-15T13:05:02.316Z", "postId": "ZtZmkgDW6MH8AEEK6", "htmlBody": "<p>Agreed that it's hard to precisely interpret private valuations, but if e.g. we knew for certainty that OAI would be valued at $1T 10 years from now, it's hard to imagine their round closing for $19B today. So this places some bounds on investor expectations of future growth.</p>", "parentCommentId": "eJHTPoMTborSJBXTm", "user": {"username": "Ben_West"}}, {"_id": "tzjHiyxuEAn4HTHhe", "postedAt": "2023-05-15T13:21:29.493Z", "postId": "ZtZmkgDW6MH8AEEK6", "htmlBody": "<p>Cool, I think you know this but: revenue multiples are by definition based on historical data; since the round closed before March it by definition could not have included ChatGPT Pro subscriptions.</p><p>I'm sure Open AI tried to convince its investors that it was on the verge of making a bunch of money, and maybe investors believed them, who knows. I think it could be useful to redo this analysis under that assumption, if someone wants to. It does seem weird that they are supposedly only forecasting $200 million in revenue this year if they are plausibly getting more than that from just ChatGPT.</p>", "parentCommentId": "TEWfxSeZEKr7jfpzN", "user": {"username": "Ben_West"}}, {"_id": "afSBrpcpo8TKGb42X", "postedAt": "2023-05-17T21:47:44.112Z", "postId": "ZtZmkgDW6MH8AEEK6", "htmlBody": "<p>Relatedly: \"without the gains of stocks that are possible AI winners, the S&amp;P 500 would now be down 2 per cent this year, rather than up 8 per cent.\" <a href=\"https://archive.ph/KFMJU\">https://archive.ph/KFMJU</a></p><p>This might suggest that the gains from AI might be distributed more evenly amongst different Big Tech companies and that economies of scope are more important than relatively small technical leads.</p>", "parentCommentId": "JgNwBBiGDhprAB2oC", "user": {"username": "HaukeHillebrandt"}}, {"_id": "PgWSbBqiDSfqkdkoG", "postedAt": "2023-06-19T07:24:29.617Z", "postId": "ZtZmkgDW6MH8AEEK6", "htmlBody": "<p>Yes, absolutely! It's important to recognize and account for the potential impact of competitors, including those who may closely replicate a company's technology or offerings. Competition in the market can indeed pose a significant threat to the profitability of a company, regardless of how promising its technology might be. Even if a technology has the potential to generate substantial revenue, if competitors emerge with similar or even slightly different solutions, it can lead to a loss of market share and decreased profitability.</p>", "parentCommentId": "TtcN3NwWiQdkEfshd", "user": {"username": "Davidsk"}}]