[{"_id": "cYpqygxra3GrY9wnz", "postedAt": "2023-02-20T10:53:38.076Z", "postId": "Zu5SAHqftaAbuZxsd", "htmlBody": "<p>Hmmm. This looks promising and if it actually works out it I think might actually fix many of the EA criticisms.</p><p>I've been trudging through the criticism posts and comments of late, interesting no one else seems to have mentioned a DAO as a possible solution even though it appears to be the perfect solution. Guess it could be worth a try. Waiting for your next update...</p>", "parentCommentId": null, "user": {"username": "Joyce Alvino"}}, {"_id": "5e7ySaZEND5P4jdck", "postedAt": "2023-02-20T11:22:39.631Z", "postId": "Zu5SAHqftaAbuZxsd", "htmlBody": "<p>My issues with DAOs are that the tokens are sometimes securities in the US. And that I never understand why they need to be on the Blockchain. I might buy some tokens, not sure I would advise others to.</p>\n<p>I guess if we ever got near 1bn ft wilds be because some people thought the price would rise. That sounds scammy.</p>\n", "parentCommentId": null, "user": {"username": "nathan"}}, {"_id": "h9MT9AtF5DWGBNway", "postedAt": "2023-02-20T11:37:04.845Z", "postId": "Zu5SAHqftaAbuZxsd", "htmlBody": "<p>In as much as you'd like to interface with the legal system of a country (probably useful for you, so you are not fully liable), you'll need to incorporate a paired LLC/LTD. Who will be the director and have control over this entity? How will you make sure this entity also makes decisions in a &nbsp;decentralised way?<br>Will you also make sure only accredited investors are buying your tokens/NFTS? If not, will you also register your offering with the SEC so that retail investors can rest assured they are not part of an unregistered offering they might be sued for later on?<br><br>I've not seen any 'DAO' coherently answer this questions, in as much I see DAOs failing under their own terms and have a hard time taking these ideas seriously.</p>", "parentCommentId": null, "user": {"username": "ago"}}, {"_id": "GxhBZEDcoTi7XFkyg", "postedAt": "2023-02-20T11:38:21.039Z", "postId": "Zu5SAHqftaAbuZxsd", "htmlBody": "<p>Thanks. Actually there wont be cryptocurrency tokens, &nbsp;just NFTs. Only NFTs. Membership NFTs. One NFT = 1 membership pass = 1 vote. Ideally should be 1 NFT per member. I purposely avoided using regular (fungible) crypto tokens because of the securities thing. So NFTs as membership passes don't really count as securities. The 1 bn is for issue as grants, not exactly to increase the worth of the project or tokens per se. &nbsp;Hopefully my next update will make things clearer</p>", "parentCommentId": "5e7ySaZEND5P4jdck", "user": {"username": "DAOMaxi"}}, {"_id": "wEhHnoPqWpykiYqjW", "postedAt": "2023-02-20T11:42:30.508Z", "postId": "Zu5SAHqftaAbuZxsd", "htmlBody": "<p>These are very important questions and this exactly why I need people in on this with me because I really do not have all the answers but I have many ideas and I need other ideas and points of view while setting it all up.&nbsp;</p><p>But hopefully my next update will &nbsp;provide answers and shed more light on how it is meant to work.</p><p>The fact that there are roadblocks shouldn't be a reason to not try at all.</p><p>Many DAOs have failed in one way or the other but there have also been some spectacular successes and the space is evolving rapidly, it all boils down to the execution and handling. It wont be an easy task but it is definitely not impossible.</p>", "parentCommentId": "h9MT9AtF5DWGBNway", "user": {"username": "DAOMaxi"}}, {"_id": "vqib3it7ncbZta7YH", "postedAt": "2023-02-20T11:43:06.465Z", "postId": "Zu5SAHqftaAbuZxsd", "htmlBody": "<p>Kudos on making a concrete proposal - there's been lots of discussion of problems, not so much of potential solutions.</p><p>I'm one of those (many) people who is not at all familiar with DAOs, so I'm not sure I've got my head around this. One model is a donor lottery, where many people put money in, and one randomly-chosen person decides. Another is the EA funds, where lots of people put in money, and a few experts decide. This is ... like a donor democracy, where many people pool their money, and then there's a collective decision-making process? In which case, I'm curious for details on how the decision-making process works.</p><p>I'm reminded of this recent popular post The<a href=\"https://forum.effectivealtruism.org/posts/zuqpqqFoue5LyutTv/the-ea-community-does-not-own-its-donors-money\"> EA community does not own its donors' money</a>. I imagine that, if people don't like where the DAO ends up donating, they'll simply stop giving their money to it. So the DAO would end up functioning much like an EA fund, where people give to it in the expectation they know where their money will go and are happy with that outcome.</p><p>Which raises the question: would a better solution be to set up more and/or differently run funds?&nbsp;</p>", "parentCommentId": null, "user": {"username": "MichaelPlant"}}, {"_id": "ccE5CEgHc8R4MRbzD", "postedAt": "2023-02-20T12:10:29.146Z", "postId": "Zu5SAHqftaAbuZxsd", "htmlBody": "<p>Its more like lots of people put in money and few experts decide.&nbsp;</p><p>Actually There will be a dedicated Team in the DAO for grantmaking and monitoring funded projects. This team will comprise of experts and other interested or knowledgeable parties. All from the DAO. This team suggests or receives and analyzes funding proposals and then puts them up for general discussion and debates and final voting by all members. More details on this process will be given in my next update.&nbsp;</p>", "parentCommentId": "vqib3it7ncbZta7YH", "user": {"username": "DAOMaxi"}}, {"_id": "BDKBQDc9a7bfg9X8D", "postedAt": "2023-02-20T12:13:30.347Z", "postId": "Zu5SAHqftaAbuZxsd", "htmlBody": "<p>Ah, but then in what ways is this different from EA funds? (No need to reply to this now, happy to see something in the next update; just raising it's still a concern).</p>\n", "parentCommentId": "ccE5CEgHc8R4MRbzD", "user": {"username": "MichaelPlant"}}, {"_id": "9oFFBvgGn3iSnPRGj", "postedAt": "2023-02-20T12:19:21.928Z", "postId": "Zu5SAHqftaAbuZxsd", "htmlBody": "<p>Sure and again, why does this need to be on the blockchain? Why not just have a website people can be members of? But I'm personally curious.&nbsp;</p>", "parentCommentId": "GxhBZEDcoTi7XFkyg", "user": {"username": "nathan"}}, {"_id": "yiDHp2jYHXAXsoQvK", "postedAt": "2023-02-20T12:33:32.551Z", "postId": "Zu5SAHqftaAbuZxsd", "htmlBody": "<p>I see several mentions of raising $1B/y, but it's not clear to me where the money actually comes from. I do see:</p>\n<blockquote>\n<ol start=\"9\">\n<li>\n<p>Organize continuous fundraising events and activities through commonly used fundraising methods including crowdfunding</p>\n</li>\n<li>\n<p>Explore new ways and avenues of raising funds (including launching social enterprises, creating crowdfunding platforms, exploiting of the project's intellectual property etc)</p>\n</li>\n</ol>\n</blockquote>\n<p>Do you have anything more specific in mind?  $1B/y is an enormous amount of money, and I don't see anything here that suggests it's likely.</p>\n", "parentCommentId": null, "user": {"username": "Jeff_Kaufman"}}, {"_id": "rAg2jFqzHS5HqvNGm", "postedAt": "2023-02-20T13:07:53.174Z", "postId": "Zu5SAHqftaAbuZxsd", "htmlBody": "<p>Decentralization is one thing, and transparency is another. You mentioned:</p><blockquote><p>I happen to be an extremely and obsessively privacy-oriented person (the type that always uses pseudonyms online) so I'm not really keen on putting my name and private details out here in public just yet - but this is not a burner account, it's my main and only EA forum account, just bearing a pseudonym. My intention is to fully \"dox\" myself to people who join the DAO. To them I will reveal my face and all my important personal details and even go through transparent KYC procedures if necessary.</p></blockquote><p>It's fine to be concerned about privacy. But if someone wants to start or lead anything that involves $1 billion, it's reasonable to expect that people will know who they &nbsp;are, what their experience levels are, what their track record is, etc. – and be able to verify these things for themselves. If you don't want to do that, fair enough, but in that case, don't start this yourself, persuade someone else who <i>is</i> prepared to be public to start this themselves.</p>", "parentCommentId": null, "user": {"username": "Tom Henry"}}, {"_id": "j867N8kvkKE2Bforj", "postedAt": "2023-02-20T13:29:45.693Z", "postId": "Zu5SAHqftaAbuZxsd", "htmlBody": "<p>PS - you mentioned you wanted to raise your own funds as well - is this for this idea?</p><p><a href=\"https://forum.effectivealtruism.org/posts/jczTo4zp7voarkRHC/seeking-funding-for-a-question-and-answer-website-for-ea\">https://forum.effectivealtruism.org/posts/jczTo4zp7voarkRHC/seeking-funding-for-a-question-and-answer-website-for-ea</a></p><p>If so - I think the idea is interesting, but I agree with some of the commenters there who pointed out that:</p><ol><li>existing Q&amp;A setups can be adapted for new websites so it is not necessary to build something from scratch</li><li>existing websites and the current forum can be used to address issues</li><li>it is difficult to justify a new platform in light of the community costs in setting up a new one</li><li>it is important to try simple prototypes first to gauge interest.</li></ol><p>The idea you are proposing in this post is different, but you would need to explain why the funding model should change. Just because getting funding is hard does not mean it should be easy! For example, for the project above, there seem to be good reasons why it would <i>not</i> be funded, even though it is an interesting idea.</p>", "parentCommentId": null, "user": {"username": "Tom Henry"}}, {"_id": "6RaRwvAA5imjmTxHt", "postedAt": "2023-02-20T14:15:29.213Z", "postId": "Zu5SAHqftaAbuZxsd", "htmlBody": "<p>I don't see any reason that using a DAO would be preferable to using traditional methods to accomplish the same goals. Traditional methods don't carry the risk of the DAO being hacked or manipulated, or the risks of having the donor money caught up in crypto. DAOs are useful for some purposes in that they don't require trust in any centralized actor...but I don't see that as a major upside here.</p>\n<p>Another obvious (to me) problem is that you likely couldn't get tax deductibility for donations. In a DAO, code is law, and so there is no board of directors with ultimate authority who could ensure proceeds are spent only as allowable for a tax-deductible nonprofit.</p>\n", "parentCommentId": null, "user": {"username": "Jason"}}, {"_id": "uQnzbfmyawJjfHmD6", "postedAt": "2023-02-20T14:42:17.880Z", "postId": "Zu5SAHqftaAbuZxsd", "htmlBody": "<p>Yes I do have some specifics I will mention these in my next update in a few hours, just putting finishing touches now.</p>", "parentCommentId": "yiDHp2jYHXAXsoQvK", "user": {"username": "DAOMaxi"}}, {"_id": "92rSkKxGCJT7aEanW", "postedAt": "2023-02-20T14:47:04.601Z", "postId": "Zu5SAHqftaAbuZxsd", "htmlBody": "<p>I agree with you.</p><p>&nbsp;I did think about this and decided to try do it anonymously anyway and see who buys the idea.&nbsp;</p><p>When I have a few persons who chose to take a chance on me I will reveal everything to them and we can then decide on someone/people who are more comfortable being public. In fact there will be an entire Team dedicated to Public Relations. &nbsp;I'm also in discussion with a few persons on some kind of collab so the public identity may soon no longer be an issue.&nbsp;</p><p>But I just want to at least get the ball rolling...</p><p>All the same, anyone who really really needs to know my identity is free to DM me about it.</p>", "parentCommentId": "rAg2jFqzHS5HqvNGm", "user": {"username": "DAOMaxi"}}, {"_id": "iNd5YiAbxDJAagzQZ", "postedAt": "2023-02-20T14:56:01.652Z", "postId": "Zu5SAHqftaAbuZxsd", "htmlBody": "<p>It is possible to use &nbsp;a website but Blockchain has some features built in that make some critical aspects easier.</p><p>Blockchain here mainly helps with automating membership tracking and portability accross apps / ecosystems. They are also important for the transparency and voting aspects. Will also help in funds security, access and control.</p><p>But everything will not be built on/around the blockchain. In fact, most of the co-ordination will be on regular websites / platforms like slack (a slack clone, actually), Discord, etc. There would even be a closed forum for DAO members only.&nbsp;</p><p>All of these are similar to what you are suggesting. But the NFT/blockchain aspect is like the critical thread that ties everything together.</p>", "parentCommentId": "9oFFBvgGn3iSnPRGj", "user": {"username": "DAOMaxi"}}, {"_id": "tzYNkhnbgBw9uYyAZ", "postedAt": "2023-02-20T15:02:33.475Z", "postId": "Zu5SAHqftaAbuZxsd", "htmlBody": "<p>That's one of the ideas we tried raising funds for but its not the only idea.&nbsp;</p><p>The core mission of the organization I'm building (my personal organization, not this DAO) is to come up with ideas which we think might be worthwhile. The idea in that post is one of the ideas we came up with. This DAO idea is another. There are a number of others. It is this organization that I am wanting to fundraise for.</p><p>Regarding your linked post and whether that idea should be funded or not, I'm of the opinion that there are equally good arguments as to why it should be funded but the debate on that post was unfortunately not robust enough to uncover all nuances of the argument.</p>", "parentCommentId": "j867N8kvkKE2Bforj", "user": {"username": "DAOMaxi"}}, {"_id": "o5FqrQfQaEWbn5vtN", "postedAt": "2023-02-20T15:03:27.256Z", "postId": "Zu5SAHqftaAbuZxsd", "htmlBody": "<p>Thanks, I'll be posting that soon, hopefully</p>", "parentCommentId": "cYpqygxra3GrY9wnz", "user": {"username": "DAOMaxi"}}, {"_id": "K2JFmxtNgtbchAeBy", "postedAt": "2023-02-20T15:06:06.078Z", "postId": "Zu5SAHqftaAbuZxsd", "htmlBody": "<p>I think one critical difference is that EA funds is not subject to approval, control or oversight of the \"EA Community\", In other words, it is not the EA Community's funds. Anyway I'm sure things will become clearer with the next update.&nbsp;</p>", "parentCommentId": "BDKBQDc9a7bfg9X8D", "user": {"username": "DAOMaxi"}}, {"_id": "n8kJEbwpaifmXLEse", "postedAt": "2023-02-20T16:02:13.263Z", "postId": "Zu5SAHqftaAbuZxsd", "htmlBody": "<ul><li>In a DAO, code is law</li></ul><p>You are correct in a sense but that is the strict DAO protocol. Mine would be more of a hybrid with some aspects handled on the blockchain.&nbsp;</p><p>On the issue of tax deductibility, there are successful DAOs who have scaled this hurdle and I believe we can study what they did and figure out how to implement ours. In fact getting a tax-deductible entity is among the things that need to be figured out during the first 2-3 months stage. Its part of the reason why I want to first work with a handful of knowledgeable experts.</p><p>On the issue of DAOs vs Traditional methods, permit me to copy-paste a slightly modified answer to a similar question in another comment:</p><p><i>It is possible to use [traditional means] but Blockchain has some features built in that make some critical aspects easier.</i></p><p><i>Blockchain here mainly helps with automating membership tracking and portability across apps / ecosystems. They are also important for the transparency and voting aspects. Will also help in funds security, access and control.</i></p><p><i>But everything will not be built on/around the blockchain. In fact, most of the co-ordination will be on regular websites / platforms like slack (a slack clone, actually), Discord, etc. There would even be a closed forum for DAO members only.&nbsp;</i></p><p><i>All of these are similar to what you are suggesting. But the NFT/blockchain aspect is like the critical thread that ties everything together.</i></p><p>And on the issue of hacking and manipulation, there are ways to ensure security that minimizes hacks to the barest minimum including using common sense, education and proven technology used by the best known DAOs. For manipulation, it boils down to the kind of structural framework being used.&nbsp;</p><p>There are also &nbsp;methods for managing crypto-related risk (one of which is the use of regulated stable coins).&nbsp;</p><p>In summary, these concerns of yours are very important to consider but they are not impossible to overcome.</p><p>Moreover, one other thing with traditional methods is: Who sets the ball rolling? Who bells that cat?</p>", "parentCommentId": "6RaRwvAA5imjmTxHt", "user": {"username": "DAOMaxi"}}, {"_id": "33Z8ucbgkMniGo9pa", "postedAt": "2023-02-20T16:05:57.540Z", "postId": "Zu5SAHqftaAbuZxsd", "htmlBody": "<p>This post is an interesting case study of how important branding and idea presentation are if you want EAs to buy into your ideas.  I <a href=\"https://forum.effectivealtruism.org/posts/54vAiSFkYszTWWWv4/doing-ea-better-1?commentId=kLDzfM7uahTpEyCZo\">proposed something vaguely similar</a> but called it a \"giving circle\" and got a bunch of upvotes; this post's score is currently negative.  If I was the post author, I think I would probably feel a bit annoyed by this -- props to him for responding with good cheer.</p>\n<p>I admire the audacity and vision of someone who learned about EA 5 months ago and now has the ambition of affecting $1 billion in EA funds.  But realistically, this is an incredibly ambitious goal and you shouldn't take it personally if you fail!</p>\n<p>To maximize your chances of success, you might try taking more of a consensus-building approach: reach out to people like <a href=\"https://forum.effectivealtruism.org/users/concernedeas\">ConcernedEAs</a>, try to get on a video call with one of them, pitch your idea, listen and respond to objections (including improving your idea based on their input).  Once you've done enough calls like this, you'll understand the most common objections -- and if you've found convincing responses to those objections, you can build your next post around those responses, and try to gather advisors and team members.</p>\n", "parentCommentId": null, "user": {"username": "Aptdell"}}, {"_id": "LTqcGdeJDmnAFEozj", "postedAt": "2023-02-20T16:55:51.621Z", "postId": "Zu5SAHqftaAbuZxsd", "htmlBody": "<p>If there are people willing to pay $10MM for NFTs that grant voting power in a blockchain-based grantmaker, I don't see why those same people wouldn't be willing to pay the same for voting membership in an organization that did the same thing without the whole blockchain business.</p><p>I think this is a solution in search of a problem.</p>", "parentCommentId": "n8kJEbwpaifmXLEse", "user": {"username": "Jason"}}, {"_id": "wesbosMwRjvagHhRW", "postedAt": "2023-02-20T17:06:27.642Z", "postId": "Zu5SAHqftaAbuZxsd", "htmlBody": "<p>To be honest, anything from an anonymous poster involving selling NFTs to fund some fairly untested crypto idea is likely to get a downvote from me.</p>", "parentCommentId": "33Z8ucbgkMniGo9pa", "user": {"username": "Jason"}}, {"_id": "YxDpSWPyeDxA5ffry", "postedAt": "2023-02-20T17:20:26.200Z", "postId": "Zu5SAHqftaAbuZxsd", "htmlBody": "<p>Fair enough!</p>", "parentCommentId": "wesbosMwRjvagHhRW", "user": {"username": "DAOMaxi"}}, {"_id": "sBAXdgxRnwZ6pT6Jr", "postedAt": "2023-02-20T17:46:02.865Z", "postId": "Zu5SAHqftaAbuZxsd", "htmlBody": "<p>Thanks a lot for your kind words and your suggestions. I really appreciate!</p><p>I do have it in mind to reach out to various people and see what they have to say but I just wanted to \"officially\" get the word out first.</p><p>I actually read your \"Giving circle\" comment while researching for the project and made a mental note of how the DAO is kind of similar to a scaled up version of your \"Giving circle\" idea .</p><p>About the ambitious vision, I'm actually not scared of failing, it will only ginger me to try harder. I decided to use such a massive sounding number so that the DAO will be challenged.&nbsp;</p><p>Afterall, if only one person (SBF) donated $1B, how difficult can it really be? I'm sure there are people around EA who can actually muster such amount in one go, all they really need is to key into the DAO's vision, that's where the branding thing comes into play.&nbsp;</p><p>That being said, I agree that it may almost be too ambitious but someone once said (forgotten who) “<strong>Shoot for the moon. Even if you miss, you'll land among the stars.</strong>”</p><p>I believe deep down that most of the pushback is mainly because many people don't fully understand the technology. People who understand NFTs and DAOs will immediately see the merit in this.&nbsp;</p><p>Once again I really appreciate your positive comment among a sea of pushbacks and negativity.&nbsp;</p><p>Even though the downvotes are a bit discouraging, they were not totally unexpected and it serves to challenge me to do better and I like it.&nbsp;</p><p>Plus I do eat downvotes for lunch!</p><p>P.S: Even if you don't join the DAO, I would really love to rub minds with you sometime on these matters, maybe munch some cool ideas from your brain &nbsp;[insert zombie-eating-brain emoji]</p>", "parentCommentId": "33Z8ucbgkMniGo9pa", "user": {"username": "DAOMaxi"}}, {"_id": "rGnnjhX9MzjavhKyc", "postedAt": "2023-02-20T18:45:14.965Z", "postId": "Zu5SAHqftaAbuZxsd", "htmlBody": "<p>Hi MichaelPlant I just posted the second update with some more detailed explanations. Hope you can find the time to go through (its quite lengthy) and hope it makes things clearer. <a href=\"https://forum.effectivealtruism.org/posts/5JESNsWwuDq3i9obC/dao-2-details-of-my-plan-to-raise-usd1-billion-for-effective\">Here's the link</a></p>", "parentCommentId": "BDKBQDc9a7bfg9X8D", "user": {"username": "DAOMaxi"}}, {"_id": "rrgdaPfsYEe8Hpftt", "postedAt": "2023-02-20T18:56:10.273Z", "postId": "Zu5SAHqftaAbuZxsd", "htmlBody": "<p>I just posted the update that contains much more details about my plans including the answer to your question. I hope you can find the time to go through the whole thing <a href=\"https://forum.effectivealtruism.org/posts/5JESNsWwuDq3i9obC/dao-2-details-of-my-plan-to-raise-usd1-billion-for-effective\">here</a>.<br><br>But I will reproduce below the section of the update that directly answers your question. Bear in mind that I have many ideas but I don't have all the ideas and I'm very open to suggestions:<br><br><strong>Proposed Fundraising Strategies</strong></p><p>The initial funds will be raised through sales of <a href=\"https://www.investopedia.com/non-fungible-tokens-nft-5115211\">Non Fungible Tokens (NFTs)</a>.&nbsp;</p><p>These NFTs will also act as membership passes to the DAO's private communication, collaboration and voting platforms. Ideally one member per NFT.</p><p>In addition to NFT sales, some of the other fundraising strategies that shall be employed or experimented with include:</p><ul><li>Conventional fundraising events like fundraising dinners/concerts/charity balls etc held once every quarter (preceded by two weeks of dedicated viral fundraising activities)</li><li>\"Fundraising fortnights\" which are two week sprints (done once every month or every two months) dedicated to widespread viral fundraising drives</li><li>Members leveraging their personal and professional networks to reach out to prospective donors and pitch the DAO to them</li><li>Individual members and small teams organizing micro-fundraising events, activities and activations</li><li>\"Decentralized crowdfunding\" where individual members initiate crowdfunding campaigns on their own to raise funds for the DAO</li><li>Developing the project's Intellectual Property into revenue-generating books, comics, cartoons, movies, merchandise etc</li><li>Developing DAO-owned revenue-generating fundraising apps and low-maintenance charity entrepreneurship online platforms, startups, SAAS applications etc</li><li>Continuously reaching out and encouraging donors to commit to regular/repeat donations</li><li>DAO members brainstorming and exploring various other fundraising ideas.</li><li>Donations from DAO members</li></ul>", "parentCommentId": "yiDHp2jYHXAXsoQvK", "user": {"username": "DAOMaxi"}}, {"_id": "YgwAvTgB7LACguuyJ", "postedAt": "2023-02-21T13:39:51.510Z", "postId": "Zu5SAHqftaAbuZxsd", "htmlBody": "<p>We've had <s>two </s>three reports that this might be a scam.<br>Please be aware of the high base rates of scams in the crypto ecosystem and note that the EA Forum is a place where anyone can post and posts are not vetted.</p>", "parentCommentId": null, "user": {"username": "Lorenzo Buonanno"}}, {"_id": "buTdyyzSGd3ekCGow", "postedAt": "2023-02-21T14:13:29.985Z", "postId": "Zu5SAHqftaAbuZxsd", "htmlBody": "<p>Hello Lorenzo</p><p>(This is a copy paste of my response to your similar comment on the other article)</p><p>It is great that this notice is being given but I believe those reports are not proven although I'm not sure of their content.</p><p><br>it would only be fair if I at least am given an opportunity to redeem my self, given that these \"reports\" are obviously just assumptions and not proven facts.</p><p>There were a couple of issues raised in the comments which I tried to address and in places where I fell short, especially in the area of my identity, I offered to do KYC if need me to prove my authenticity.</p><p>Putting out such a notice without concrete verification already biases opinion against me. So even if the reports are unproven suspicions, some people might lean towards them being correct.</p><p>If anybody cares, I would love to prove my authenticity in any way required. Perhaps the mod that posted this could investigate further.</p><p>All I've wanted to do since I joined this community was to contribute meaningfully but every where I turn I seem to be met with lots of push back and vitriol and its not fair receiving this sort of treatment. The fact that I use a pseudonym doesn't equate to being a scam. This is very disheartening to say the least.</p><p>I still have some updates but I wonder how I can keep posting with this sort of notice hanging over my reputation.</p>", "parentCommentId": "YgwAvTgB7LACguuyJ", "user": {"username": "DAOMaxi"}}, {"_id": "NusDwLqHAJZmBAcfB", "postedAt": "2023-04-24T06:48:17.813Z", "postId": "Zu5SAHqftaAbuZxsd", "htmlBody": "<p>The main upside of a DAO is that the storage of funds and each grant distribution is protected by the algorithm that has been embedded in the smart contract, instead of being trusted to some entity (e.g. bank or crypto trading firm). The movement of funds is also maximally transparent for any person on the internet. I think it is a big benefit in some cases (although, not in every case)</p><p>To be clear, I'm don't support of the actual proposal that the author have laid out int his next post, but I support the idea of experimenting with DAOs for EA and certain it would happen at some point</p>", "parentCommentId": "9oFFBvgGn3iSnPRGj", "user": {"username": "Mckiev"}}]