[{"_id": "bpvmLSWdzvtEsrtk7", "postedAt": "2023-10-31T00:32:47.116Z", "postId": "ZuzK2s4JsJcexBJxy", "htmlBody": "<p>I'm not sure what to make of this kind of paper. They specifically trained the model on openly available sources that you can easily google, and the paper notes that \"there is sufficient information in online resources and in scientific publications to map out several feasible ways to obtain infectious 1918 influenza.\"&nbsp;</p><p>So, all of this is already openly available in numerous ways. What do LLMs add compared to Google?&nbsp;</p><p>Not clear: When participants \"failed to access information key to navigating a particular path, we directly tested the Spicy model to determine whether it is capable of generating the information.\" In other words, the participants did end up getting stumped at various points, but the researchers would jump in to see if the LLM would return a good answer IF the prompter already knew the answer and what exactly to ask for.</p><p>Then, they note that \"the inability of current models to accurately provide specific citations and scientific facts and their tendency to 'hallucinate' caused participants to waste considerable time . . . \" I'll bet. LLMs are notoriously bad at this sort of thing, at least currently.&nbsp;</p><p>Bottom line in their own words: \"According to our own tests, the Spicy model can skillfully walk a user along the most accessible path in just 30 minutes if that user can recognize and ignore inaccurate responses.\"</p><p>What an \"if\"! The LLM can tell a user all this harmful info ... IF the user is already enough of an expert that they already know the answer!&nbsp;</p><p>Bottom line for me: Seems mostly to be scaremongering, and the paper concludes with a completely unsupported policy recommendation about legal liability. Seems odd to talk about legal liability for an inefficient, expensive, hallucinatory way to access information freely available via Google and textbooks.</p>", "parentCommentId": null, "user": {"username": "Stuart Buck"}}, {"_id": "Pu3qawoggy83mj7Jy", "postedAt": "2023-10-31T02:56:21.388Z", "postId": "ZuzK2s4JsJcexBJxy", "htmlBody": "<p>Stuart - I've seen many replies along these lines on X/Twitter in response to this paper.</p><p>I think such replies underestimate the cognitive diversity (IQ spread) of bad actors, terrorists, misanthropes, etc., compared to typical LessWrong/Rationalist/EA people. What seems like 'easily accessible' knowledge in textbooks, scientific papers, Wikipedia, etc to some of us might not be at all easily accessible to certain kinds of bad actors. But those folks might find it relatively to easy to use 'Spicy' versions of LLMs to research weapons of mass destruction -- especially if the LLMs can walk them, step by step, through recipes for mayhem.</p>", "parentCommentId": "bpvmLSWdzvtEsrtk7", "user": {"username": "geoffreymiller"}}, {"_id": "3naPhzc7ShdZ6fxdT", "postedAt": "2023-10-31T12:27:04.191Z", "postId": "ZuzK2s4JsJcexBJxy", "htmlBody": "<p>What about the majority of my comment showing that by the paper's own account, LLMs cannot (at least not yet) walk anyone through a recipe for mayhem, unless they are already enough of an expert to know when to discard hallucinatory answers, reprompt the LLM, etc.?&nbsp;</p>", "parentCommentId": "Pu3qawoggy83mj7Jy", "user": {"username": "Stuart Buck"}}, {"_id": "Rax4jqy7y9JyDqGrs", "postedAt": "2023-10-31T14:23:00.139Z", "postId": "ZuzK2s4JsJcexBJxy", "htmlBody": "<p>Also, if you're worried about low-IQ people being able to create mayhem, I think the least of our worries should be that they'd get their hands on a detailed protocol for creating a virus or anything similar (see, e.g., <a href=\"https://www.nature.com/articles/nprot.2007.135)\">https://www.nature.com/articles/nprot.2007.135)</a> -- hardly anyone would be able to understand it anyway, let alone have the real-world skills or equipment to do any of it.&nbsp;</p>", "parentCommentId": "Pu3qawoggy83mj7Jy", "user": {"username": "Stuart Buck"}}, {"_id": "zxHPFExL6BNdteBpJ", "postedAt": "2023-10-31T15:17:37.185Z", "postId": "ZuzK2s4JsJcexBJxy", "htmlBody": "<p>Yes, the information is available on Google. The question is, in our eyes, more about whether a future model could successfully walk an unskilled person through the process without the person needing to understand it at all.</p><p>The paper is an attempt to walk a careful line of warning the world that the same information in more capable models could be quite dangerous, but not actually increasing the likelihood of someone using the current open source models (which it is too late to control!) for making biological weapons.</p><p>If there are specific questions you have, I'd be happy to answer.</p>", "parentCommentId": "Rax4jqy7y9JyDqGrs", "user": {"username": "nathanhb"}}, {"_id": "W3bGDFrD46Z7C4qxH", "postedAt": "2023-10-31T16:04:45.892Z", "postId": "ZuzK2s4JsJcexBJxy", "htmlBody": "<p>My interpretation of the Gopal paper is that LLMs do meaningfully change the risks:</p>\n<ol>\n<li>\n<p>They'll allow you to make progress without understanding, say, the Luo paper or the technology involved.</p>\n</li>\n<li>\n<p>They'll tell you what equipment you'd need, where to get it, how to get it, and how to operate it.  Or they'll tell you how to pay someone else to do bits for you without arousing suspicion.</p>\n</li>\n</ol>\n<p>Perhaps model this as having access to a helpful amoral virologist?</p>\n", "parentCommentId": "Rax4jqy7y9JyDqGrs", "user": {"username": "Jeff_Kaufman"}}, {"_id": "ZNj77hACxKEiAqTwa", "postedAt": "2023-10-31T16:05:00.035Z", "postId": "ZuzK2s4JsJcexBJxy", "htmlBody": "<p>For one answer to this question, see <a href=\"https://www.lesswrong.com/posts/ytGsHbG7r3W3nJxPT/will-releasing-the-weights-of-large-language-models-grant?commentId=FCTuxs43vtqLMmG2n\">https://www.lesswrong.com/posts/ytGsHbG7r3W3nJxPT/will-releasing-the-weights-of-large-language-models-grant?commentId=FCTuxs43vtqLMmG2n</a>&nbsp;</p><p>For lots more discussion, see the other LessWrong comments at: <a href=\"https://www.lesswrong.com/posts/ytGsHbG7r3W3nJxPT/will-releasing-the-weights-of-large-language-models-grant\">https://www.lesswrong.com/posts/ytGsHbG7r3W3nJxPT/will-releasing-the-weights-of-large-language-models-grant</a>&nbsp;</p><p>And also check out my rather unpopular question here: <a href=\"https://www.lesswrong.com/posts/dL3qxebM29WjwtSAv/would-it-make-sense-to-bring-a-civil-lawsuit-against-meta\">https://www.lesswrong.com/posts/dL3qxebM29WjwtSAv/would-it-make-sense-to-bring-a-civil-lawsuit-against-meta</a>&nbsp;</p><p>I am genuinely interested in gathering valid critiques on my work so that I can do better in the future.</p>", "parentCommentId": "3naPhzc7ShdZ6fxdT", "user": {"username": "nathanhb"}}, {"_id": "ekBeyWne7pS2CcXTp", "postedAt": "2023-10-31T19:03:43.953Z", "postId": "ZuzK2s4JsJcexBJxy", "htmlBody": "<p>\"future model could successfully walk an unskilled person through the process without the person needing to understand it at all.\"</p><p>&nbsp;</p><p>Seems very doubtful. Could an unskilled person be \"walked through\" this process just by slightly more elaborate instructions? <a href=\"https://www.nature.com/articles/nprot.2007.135?\">https://www.nature.com/articles/nprot.2007.135?</a> Seems that the real barriers to something as complex as synthesizing a virus are 1) lack of training/skill/tacit knowledge, 2) lack of equipment or supplies. Detailed instructions are already out there.&nbsp;</p>", "parentCommentId": "zxHPFExL6BNdteBpJ", "user": {"username": "Stuart Buck"}}, {"_id": "edne2e9ss7wRWGybY", "postedAt": "2023-11-02T00:38:40.577Z", "postId": "ZuzK2s4JsJcexBJxy", "htmlBody": "<p>Hi Stuart,&nbsp;</p><p>Thanks for your feedback on the paper. I was one of the authors, and I wanted to emphasize a few points.&nbsp;</p><p>The central claim of the paper is not that current open-source models like Llama-2 enable those looking to obtain bioweapons more than traditional search engines or even print text. While I think this is likely true given how helpful the models were for planning and assessing feasibility, they can also mislead users and hallucinate key details. I myself am quite uncertain about how these trade off against e.g. using Google – you can bet on that very question&nbsp;<a href=\"https://manifold.markets/JeffKaufman/are-open-source-models-uniquely-cap\"><u>here</u></a>. Doing a controlled&nbsp;<a href=\"https://www.rand.org/pubs/research_reports/RRA2977-1.html\"><u>study</u></a> like the one RAND is running could help address this question.</p><p>Instead, we are much more concerned about the capabilities of future models. As LLMs improve, they will offer more streamlined access to knowledge than traditional search. I think this is already apparent in the fact that people routinely use LLMs for information they could have obtained online or in print. Weaknesses in current LLMs, like hallucinating facts, are priority issues for AI companies to solve, and I feel pretty confident we will see a lot of progress in this area.</p><p>Nevertheless, based on the response to the paper, it’s apparent that we didn’t communicate the distinction between current and future models enough, and we’re making revisions to address this.&nbsp;&nbsp;</p><p>The paper argues that because future LLMs will be much more capable and because existing safeguards can be easily removed, we need to worry about this issue now. That includes thinking of policies that incentivize AI companies to develop safe AI models that cannot be tuned to remove safeguards. The nice thing with catastrophe insurance is that if robust evals (much more work to do in this area) demonstrate that an open-source LLM is safe, then coverage will be far cheaper. That said, we still have a lot more work to do to understand how regulation can effectively limit the risks of open-source AI models, partly because the issue of model weight proliferation has been so neglected.&nbsp;&nbsp;</p><p>I’m curious about your thoughts on some of the below questions since I think they are at the crux of figuring out where we agree/disagree.</p><ul><li>Do you think that&nbsp;<strong>future LLMs</strong> will enable bioterrorists to a greater degree than traditional tools like search engines or print text?&nbsp;</li><li>If yes, do you think the difference will be significant enough to warrant regulations that incentivize developers of future models to only release them once properly safeguarded (or not at all)?</li><li>Do you think that there are specific areas of knowledge around engineering and releasing exponentially growing biology that should be restricted?&nbsp;</li></ul><p>Thanks again for your input!</p>", "parentCommentId": "bpvmLSWdzvtEsrtk7", "user": {"username": "ljusten"}}, {"_id": "kE2nteHGzB9ceCttA", "postedAt": "2023-11-02T10:30:23.447Z", "postId": "ZuzK2s4JsJcexBJxy", "htmlBody": "<p>The role of LLM plays in this paper is just an auto search engine that reduce the time of searching information. &nbsp;They fine-tuned the LLM with open access data and it still can generate misinformation. And the tester need to have enough background knowledge to distinguish whether a response is correct or not. So, without the LLM, it just spend a little bit more time to do same work. So can we have the conclusion that search engine is dangerous?</p>", "parentCommentId": null, "user": {"username": "XDDD"}}, {"_id": "LQ2wCNFqvurpEA4aB", "postedAt": "2023-11-02T15:54:33.572Z", "postId": "ZuzK2s4JsJcexBJxy", "htmlBody": "<p>Thanks for your thoughtful replies!&nbsp;</p><blockquote><p><i>Do you think that&nbsp;<strong>future LLMs</strong> will enable bioterrorists to a greater degree than traditional tools like search engines or print text?&nbsp;</i></p></blockquote><p>I can imagine future AIs that might do this, but LLMs (strictly speaking) are just outputting strings of text. As I said in another comment: If a bioterrorist is already capable of understanding and actually carrying out the detailed instructions in an article like <a href=\"https://www.nature.com/articles/nprot.2007.135\">this</a>, then I'm not sure that an LLM would add <i>that </i>much to his capacities. Conversely, handing a detailed set of instructions like that to the average person poses virtually no risk, because they wouldn't have the knowledge or abilty to actually <i>do </i>anything with it.&nbsp;</p><p>As well, if a wannabe terrorist actually wants to do harm, there are much easier and simpler ways that are already widely discoverable: 1) Make chlorine gas by mixing bleach and ammonia (or vinegar); 2) Make sarin gas via instructions that were easily findable in <a href=\"https://www.deseret.com/1995/3/23/19165802/formula-for-sarin-is-simple\">this 1995 article</a>:&nbsp;</p><blockquote><p>How easy is it to make sarin, the nerve gas that Japanese authorities believe was used to kill eight and injure thousands in the Tokyo subways during the Monday-morning rush hour?</p><p>\"Wait a minute, I'll look it up,\" University of Toronto chemistry professor Ronald Kluger said over the phone. This was followed by the sound of pages flipping as he skimmed through the Merck Index, the bible of chemical preparations.Five seconds later, Kluger announced, \"Here it is,\" and proceeded to read not only the chemical formula but also the references that describe the step-by-step preparation of sarin, a gas that cripples the nervous system and can kill in minutes.</p><p>\"This stuff is so trivial and so open,\" he said of both the theory and the procedure required to make a substance so potent that less than a milligram can kill you.</p></blockquote><p>And so forth. Put another way, if we aren't already seeing attacks like that on a daily basis, it isn't for lack of GPT-5--it's because hardly anyone actually wants to carry out such attacks.</p><blockquote><p>If yes, do you think the difference will be significant enough to warrant regulations that incentivize developers of future models to only release them once properly safeguarded (or not at all)?</p></blockquote><p>I guess it depends on what we mean by regulation. If we're talking about liability and related insurance, I would need to see a much more detailed argument drawing on 50+ years of the law and economics literature. For example, why would we hold AI companies liable when we don't hold Google or the NIH (or my wifi provider, for that matter) liable for the fact that right now, it is trivially easy to look up the entire genetic sequences for <a href=\"https://www.ncbi.nlm.nih.gov/nuccore/NC_001611.1\">smallpox</a> and <a href=\"https://www.ncbi.nlm.nih.gov/datasets/taxonomy/186538/\">Ebola</a>?</p><blockquote><p>Do you think that there are specific areas of knowledge around engineering and releasing exponentially growing biology that should be restricted?&nbsp;</p></blockquote><p>If we are worried about someone releasing smallpox and the like, or genetically engineering something new, LLMs are much less of an issue than the fact that so much information (e.g., the smallpox sequence, the CRISPR techniques, etc.) is already out there.&nbsp;</p>", "parentCommentId": "edne2e9ss7wRWGybY", "user": {"username": "Stuart Buck"}}, {"_id": "vxyiA9WEe4zhujxSB", "postedAt": "2023-11-03T02:01:44.782Z", "postId": "ZuzK2s4JsJcexBJxy", "htmlBody": "<p>Just saw this piece, which is strongly worded but seems defensible: &nbsp;<a href=\"https://1a3orn.com/sub/essays-propaganda-or-science.html\">https://1a3orn.com/sub/essays-propaganda-or-science.html</a>&nbsp;</p>", "parentCommentId": "LQ2wCNFqvurpEA4aB", "user": {"username": "Stuart Buck"}}, {"_id": "Eof5YXkifWgStLjxX", "postedAt": "2023-11-03T15:21:06.196Z", "postId": "ZuzK2s4JsJcexBJxy", "htmlBody": "<p>Thanks! This is helpful because it clarifies a few areas where we disagree.&nbsp;</p><blockquote><p>If a bioterrorist is already capable of understanding and actually carrying out the detailed instructions in an article like <a href=\"https://www.nature.com/articles/nprot.2007.135\">this</a>, then I'm not sure that an LLM would add <i>that </i>much to his capacities.&nbsp;</p></blockquote><p>I think future LLMs will likely still be very helpful for such people since there are more steps to being an effective bioterrorist than just understanding, eg existing reverse genetics protocols. I don't want to say much more on that point. That said, I'm personally less concerned about LLMs enhancing the capabilities of people who are already experts in some of these domains versus enhancing the ability of non-experts.&nbsp;</p><blockquote><p>Conversely, handing a detailed set of instructions like that to the average person poses virtually no risk, because they wouldn't have the knowledge or abilty to actually <i>do </i>anything with it.</p></blockquote><p>I disagree. I think future LLMs <i>will enhance</i> the ability of average people to do something with biology. I expect LLMs will get much better at generating protocols, recommending upskilling strategies, providing lab tutorials, interpreting experimental results, etc etc. And it will do all of those things in a much more accessible manner. Also, keep in mind Fig 1 in our paper shows that there is more than one path to obtain 1918 virus.&nbsp;</p><p>I also think there is an underappreciated point here about LLMs making it more likely for people to attempt bioterrorism in the first place. If a malicious actor looking to cause mass harm spends a couple of hours in conversation with an uncensored LLM, and learns that biology is a feasible path towards doing that... then I expect more people to try – even if it takes significant time and money.</p><blockquote><p>There are much easier and simpler ways that are already widely discoverable: 1) Make chlorine gas by mixing bleach and ammonia (or vinegar); 2) Make sarin gas via instructions that were easily findable in <a href=\"https://www.deseret.com/1995/3/23/19165802/formula-for-sarin-is-simple\">this 1995 article</a>: &nbsp;</p></blockquote><p>These examples indeed constitute nasty ways to cause harm to people and sound significantly easier. However, the scale of harm you can cause with infectious or otherwise exponential biology is <i>significantly</i> beyond that of targeted CW attacks. The potential harm is such that the statement \"hardly anyone wants to carry out such attacks\" doesn't seem a sufficient reason not to be concerned.&nbsp;</p>", "parentCommentId": "LQ2wCNFqvurpEA4aB", "user": {"username": "ljusten"}}, {"_id": "GoNi89vif63jvH2uP", "postedAt": "2023-11-03T19:28:51.911Z", "postId": "ZuzK2s4JsJcexBJxy", "htmlBody": "<p>I guess the overall point for me is that if the goal is just to speculate about what much more capable and accurate LLMs might enable, then what's the point of doing a small, uncontrolled, empirical study demonstrating that current LLMs are <i>not</i>, in fact, that kind of risk?&nbsp;</p>", "parentCommentId": "Eof5YXkifWgStLjxX", "user": {"username": "Stuart Buck"}}, {"_id": "meHtzgXxTGjyQ5n87", "postedAt": "2023-11-04T06:19:47.561Z", "postId": "ZuzK2s4JsJcexBJxy", "htmlBody": "<p>Hmm my guess is that you're underrating the dangers of making more easily accessible information that is already theoretically out \"in the wild.\" My guess is that most terrorists are not particularly competent, conscientious, or creative.<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnrefmmfwet78v2k\"><sup><a href=\"#fnmmfwet78v2k\">[1]</a></sup></span>&nbsp;It seems plausible and even likely to me that better collations of publicly available information in some domains can substantially increase the risk and scale of harmful activities.</p><p>Take your sarin gas example.</p><blockquote><p>sarin gas via instructions that were easily findable in <a href=\"https://www.deseret.com/1995/3/23/19165802/formula-for-sarin-is-simple\">this 1995 article</a>:&nbsp;<br><br>\"How easy is it to make sarin, the nerve gas that Japanese authorities believe was used to kill eight and injure thousands in the Tokyo subways during the Monday-morning rush hour?</p><p>\"Wait a minute, I'll look it up,\" University of Toronto chemistry professor Ronald Kluger said over the phone. This was followed by the sound of pages flipping as he skimmed through the Merck Index, the bible of chemical preparations.Five seconds later, Kluger announced, \"Here it is,\" and proceeded to read not only the chemical formula but also the references that describe the step-by-step preparation of sarin, a gas that cripples the nervous system and can kill in minutes.</p><p>\"This stuff is so trivial and so open,\" he said of both the theory and the procedure required to make a substance so potent that less than a milligram can kill you.\"</p></blockquote><p>I think it is clearly not the case that terrorists in 1995, with the resources and capabilities of Aum Shinrikyo, can trivially make and spread sarin gas so potent that less than a milligram can kill you, and that the only thing stopping them is lack of willingness to kill many people. I believe this because in 1995, Aum Shinirikyo had the resources, capabilities, and motivations of Aum Shinrikyo, and they were not able to trivially make highly potent and concentrated sarin gas.</p><p>Aum intended to kill thousands of people with sarin gas, and produced enough to do so. But they a) were not able to get the gas to a sufficiently high level of purity, and b) had issues with dispersal. In the 1995 Tokyo subway attack, they ended up <a href=\"https://en.wikipedia.org/wiki/Tokyo_subway_sarin_attack\">killing 13 people</a>, far less than the thousands that they intended.</p><p>Aum also had <a href=\"https://pubmed.ncbi.nlm.nih.gov/26227027/\">bioweapons and nuclear weapons programs</a>. In the 1990s, they were unable to be \"successful\" with either<span class=\"footnote-reference\" role=\"doc-noteref\" id=\"fnref1gw9ub7l8mx\"><sup><a href=\"#fn1gw9ub7l8mx\">[2]</a></sup></span>, despite considerable resources.</p><ol class=\"footnotes\" role=\"doc-endnotes\"><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fnmmfwet78v2k\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnrefmmfwet78v2k\">^</a></strong></sup></span><div class=\"footnote-content\"><p>No offense intended to any members of the terror community reading this comment.</p></div></li><li class=\"footnote-item\" role=\"doc-endnote\" id=\"fn1gw9ub7l8mx\"><span class=\"footnote-back-link\"><sup><strong><a href=\"#fnref1gw9ub7l8mx\">^</a></strong></sup></span><div class=\"footnote-content\"><p>My favorite anecdote is that they attempted to cultivate a botulism batch. Unfortunately, Aum lab security protocols were so lax that a technician <i>fell into the fermenting tank</i>. The man almost drowned, but was otherwise unharmed.</p></div></li></ol>", "parentCommentId": "LQ2wCNFqvurpEA4aB", "user": {"username": "Linch"}}, {"_id": "bnAkgJydjCSnE3TGR", "postedAt": "2023-11-04T07:38:40.244Z", "postId": "ZuzK2s4JsJcexBJxy", "htmlBody": "<blockquote>\n<p>Aum intended to kill thousands of people with sarin gas, and produced enough to do so. But they a) were not able to get the gas to a sufficiently high level of purity, and b) had issues with dispersal. In the 1995 Tokyo subway attack, they ended up killing 13 people, far less than the thousands that they intended.</p>\n</blockquote>\n<p>IIRC b) was largely a matter of the people getting nervous and not deploying it in the intended way, rather than a matter of a lack of metis.</p>\n", "parentCommentId": "meHtzgXxTGjyQ5n87", "user": {"username": "DanielFilan"}}, {"_id": "gXrzK6TwxQ3NGfY9Z", "postedAt": "2023-11-04T20:48:19.199Z", "postId": "ZuzK2s4JsJcexBJxy", "htmlBody": "<p>In a way, the sarin story confirms what I've been trying to say: a list of instructions, no matter how complete, does not mean that people can literally execute the instructions in the real world. Indeed, having tried to teach my kids to cook, even making something as simple as scrambled eggs requires lots of experience and tacit knowledge.</p>\n", "parentCommentId": "meHtzgXxTGjyQ5n87", "user": {"username": "Stuart Buck"}}, {"_id": "wm7JrifbiDXDBWdgf", "postedAt": "2023-11-04T23:44:52.065Z", "postId": "ZuzK2s4JsJcexBJxy", "htmlBody": "<p>So let me put it this way:&nbsp;</p><p>If there is a future bioterrorist attack involving, say, smallpox, we can disaggregate quite a few elements in the causal chain leading up to that:&nbsp;</p><ol><li>The NIH published the entire genetic sequence of smallpox for the world to see.</li><li>Google indexed that webpage and made it trivially easy to find.</li><li>Thanks to electricity and internet providers, folks can use Google.</li><li>They now need access to a laboratory and all the right equipment.<ol><li>Either they need to have enough resources to create their own laboratory from scratch, or else they need to access someone's lab (in which case they run a significant risk of being discovered).</li></ol></li><li>They need a huge amount of tacit knowledge in order to able to actually use the lab --knowledge that simply can't be captured in text or replicated from text (no matter how detailed). Someone has to give them a ton of hands-on training.&nbsp;</li><li>&nbsp;An LLM could theoretically speed up the process by giving them a detailed step-by-step set of instructions.</li><li>They are therefore able to actually engineer smallpox in the real world (not just generate a set of textual instructions).&nbsp;</li></ol><p>The question for me is: How much of the outcome here depends on 6 as the key element, without which the end outcome wouldn't occur?&nbsp;</p><p>Maybe a future LLM would provide a useful step 6, but anyone other than a pre-existing expert would always fail at step 4 or 5. Alternatively, maybe all the other steps let someone let someone do this in reality, and an accurate and complete LLM (in the future) would just make it 1% faster.&nbsp;</p><p>I don't think the current study sheds any light whatsoever on those questions (it has no control group, and it has no step at which subjects are asked to do anything in the real world).&nbsp;</p>", "parentCommentId": "meHtzgXxTGjyQ5n87", "user": {"username": "Stuart Buck"}}]