[{"_id": "g6pEoGaLouB7LDfe6", "postedAt": "2022-12-19T18:37:45.280Z", "postId": "Zxrv2kBhHzyd2gzsQ", "htmlBody": "<p><strong>EDIT:</strong> Made edits to this one day later, for clarity and to add one paragraph.</p>\n<p>People muddle through life, adopting imperfect solutions routinely, iterating through some approaches, abandoning others, learning about new possibilities, seeing solutions clearly only in hindsight sometimes. The point is, if they take a problem seriously, then they take steps to solve it.  Others can evaluate the effort or offer assistance, trying to redirect their efforts or save them from the consequences of a poor solution. Or they might be sold on ineffective solutions by others, dooming them to a worse path if they go along. Rarely do problems just solve themselves. Whatever solutions start with taking the problem seriously.</p>\n<p>Despite doom-scrolling and predicting the end of the world, taking a problem seriously is not that common. Preppers do it, some politicians do it (not that many), and plenty of think tanks, rich people, and private orgs do it. From there you see solutions to existential risk, regardless of the quality of the solutions.</p>\n<p>Between not taking a problems seriously, and doing the selfish thing, if the problem <em>is</em> taken seriously, there's not a lot of wiggle room for altruistic locally or globally effective solutions. For example, while people are still offering solutions to the climate crisis, it's been a crisis since the 1980's, and it's been under analysis since then. The solutions are not that different now, and that is actually worrying,  because the situation has worsened, both in reality and in its implications, since the 1980's. Despite that, you can see developed countries don't take it seriously, there's corruption and shilling at all levels of policy and strategy around it, and the most widely cited sources mostly get ignored (ie, the IPCC).</p>\n<p>If the world's countries are still in denial in 20-30 years, when GAST is at 2C,  when we've seen many novel extreme weather events, and when we know to expect far worse near-term consequences for the biosphere than now, then we know that few feasible solutions to our extinction crisis will remain. As a scenario exercise, you can examine those remaining feasible ones for any that seem worthwhile. You'll be disappointed.</p>\n<p>I took my time deciding that saving humanity was not, per se, an ethical requirement of being human. I consider existing people to have moral status, but I don't see the ethicality in guaranteeing lots of future people are conceived. In seeking moral clarity, I have reduced the solutions to existential risk to those that seem desirable to me. I don't consider it spiteful, more just disinterested.</p>\n<p>EDIT: I also came to realize that life is not a party. I don't mean that I was once some lazy party animal, or that life should be split between parties and hard work. I mean that life lived properly wouldn't offer many sustainable opportunities for frivolous fun if one is not already fairly happy and safe in a supportive community. If you take away vices, a poison to culture, society, and psychological health, frivolous fun becomes harder to create on demand. This shifts the burden for life satisfaction to maintenance of desirable circumstances on a daily basis, or increases the demand for effort to gain those circumstances. And that can be a lot of effort over a long time period. I suspect that living in such a state of difficulty, when tasked with finding or maintaining happiness without vices (for example, without recreational drugs of various types, modern distractions, and novelties that we consider harmless), could  be part of the solution to humanity's general problems as a species. However, I suspect anyone from today's society would find that alternative society undesirable, and so would not form such a goal as their future. If that is so, then we ignore the only option that seems available to us. The boring option of cleaning up our behavior and ending our indulgence in our vices. And avoiding the actual solution is a typical response for a lot of problems. \"Of course we could stop problem X, but then we'd have to stop doing Y, and we like doing Y, so lets pretend Y doesn't matter and solve problem X some other way! \" Which typically doesn't work. And so our pathway remains ambiguous, risking dangers from problem X so that we can keep doing vice Y.</p>\n<p>Also, the disaster that has been human response to existential crisis has informed me that being a human that guarantees a future for humanity is actually really difficult,  that that combination of altruism and selfishness, is not sustainable in all circumstances as a societal current. With that conclusion, I can form a different model of how and whether society can and should survive longterm, one built around a society that consistently works toward its own survival and well-being.</p>\n<p>In my belief, that society has to:</p>\n<ul>\n<li>be small</li>\n<li>know its ecological niche and keep it</li>\n<li>show a strong altruistic streak, among its own people and toward other species</li>\n<li>have plenty of humility about its own future.</li>\n<li>stay on Earth in a single location</li>\n<li>have no interest in a diaspora</li>\n<li>not see itself as deserving to spread or grow</li>\n<li>maintain its own population size without difficulty or conflict</li>\n<li>have overcome humanity's worst ills (for examples, drug abuse, misogyny, slavery, child abuse, epidemics, and war)</li>\n<li>carry on despite setbacks and burdens</li>\n</ul>\n<p>For me, it's less that humanity must survive so it can develop, and more that humanity must develop so that it is worthwhile if it survives.  Technology is an essential part of that, mainly in its ability to raise life satisfaction and overcome humanity's ills.</p>\n<p>Obviously, if people overcome simple denial, they'll pursue solutions of some sort. A focus on available solutions brings the discussion back to whether the solutions are worthwhile.</p>\n", "parentCommentId": null, "user": {"username": "Noah Scales"}}, {"_id": "pfzjaTHdYRNwcRer6", "postedAt": "2022-12-20T21:30:50.985Z", "postId": "Zxrv2kBhHzyd2gzsQ", "htmlBody": "<p>These tragic tradeoffs also worry me deeply. Existential wagering is to me one of the more worrying, but also possible to avoid. However, the tradeoff between existential co-option and blackmail seems particularly hard to avoid for AI.</p>", "parentCommentId": null, "user": {"username": "HaydnBelfield"}}, {"_id": "7taj6TZJkL7tatmpT", "postedAt": "2022-12-22T07:35:56.298Z", "postId": "Zxrv2kBhHzyd2gzsQ", "htmlBody": "<p>I have only skimmed this, but it seems quite good and I want more things like it on the forum. Positive feedback!&nbsp;</p>", "parentCommentId": null, "user": {"username": "Aaron_Scher"}}]