[{"_id": "AuYMDustactf46rxK", "postedAt": "2023-03-04T09:32:51.172Z", "postId": "ZyjARuFsDBTFXeMP4", "htmlBody": "<p>I appreciate cultural works creating common knowledge that the AGI labs are behaving strongly unethically.&nbsp;</p><p>As for the specific scenario, point 17 seems to be contradicted by the orthogonality thesis / lack of moral realism.</p>", "parentCommentId": null, "user": {"username": "Søren Elverlin"}}, {"_id": "zuGRbRRAkkycfDtRG", "postedAt": "2023-03-04T10:06:03.856Z", "postId": "ZyjARuFsDBTFXeMP4", "htmlBody": "<p>Looks cool! Do we know who funded this?</p>", "parentCommentId": null, "user": {"username": "pseudonym"}}, {"_id": "BAuuqoqQnryfeWTZF", "postedAt": "2023-03-04T15:49:13.342Z", "postId": "ZyjARuFsDBTFXeMP4", "htmlBody": "<p>I don't think the orthogonality thesis is correct in practice, and moral antirealism certainly isn't an agreed upon position among moral philosophers, but I agree that point 17 seems far fetched.</p>\n", "parentCommentId": "AuYMDustactf46rxK", "user": {"username": "ThomasWoodside"}}, {"_id": "HhzD9TeviYDSDXeha", "postedAt": "2023-03-04T17:45:56.909Z", "postId": "ZyjARuFsDBTFXeMP4", "htmlBody": "<p>Michael - thanks for posting about this.&nbsp;</p><p>I think it's valuable to present ideas about AI X-risk in different forms, venues, and contexts, to spark different cognitive, emotional, and aesthetic reactions in people.</p><p>I've been fascinated by visual arts for many decades, have written about the evolutionary origins of art, and one of my daughters is a professional artist. My experience is that art installations can provoke a more open-minded contemplation of issues and ideas than just reading things on a screen or in a book. There's something about walking around in a gallery space that encourages a more pensive, non-reactive, non-judgmental response.</p><p>I haven't seen the Misalignment Museum in person, but would value reactions from anyone who has.</p>", "parentCommentId": null, "user": {"username": "geoffreymiller"}}, {"_id": "RSfNMLknHEvRcQDXf", "postedAt": "2023-03-05T01:04:13.746Z", "postId": "ZyjARuFsDBTFXeMP4", "htmlBody": "<p>The donor is anonymous.</p><p>From the Wired article: \"The temporary exhibit is funded until May by an anonymous donor...\"</p>", "parentCommentId": "zuGRbRRAkkycfDtRG", "user": {"username": "Michael Huang"}}, {"_id": "CdGdPP7nanpqMaLyJ", "postedAt": "2023-03-10T09:57:52.991Z", "postId": "ZyjARuFsDBTFXeMP4", "htmlBody": "<p>Thanks for sharing!</p><p>I think to would be nice to have Q&amp;As that the visitors could fill at the end of the visit to see whether the museum successfully increased their awareness about the risk of advanced misaligned AI.</p>", "parentCommentId": null, "user": {"username": "vascoamaralgrilo"}}]