[{"_id": "6kevHfxiyeHiwZGC6", "postedAt": "2022-12-23T04:31:06.577Z", "postId": "ZziiF6ycby5u6TCfs", "htmlBody": "<p>If you’re serious about pursuing a master’s in economics, it might make sense for us to chat — I know a bit about those programs (in the U.S. context). Depending on where you went to undergrad, what courses you took, your GRE scores, and whether you can spin a compelling narrative about why you finished with a 2.95 GPA, you may be able to get into decent master’s programs without any post-bacc coursework. I know folks who’ve done so with similar grades. That doesn’t mean, of course, that heading off in that direction would be a good idea, but it may be more of a live option than you think.</p>\n", "parentCommentId": null, "user": {"username": "HStencil"}}, {"_id": "7aprbAghSs7P2FtSh", "postedAt": "2022-12-23T06:41:33.183Z", "postId": "ZziiF6ycby5u6TCfs", "htmlBody": "<p>First, it's important to consider what you really want to do. How much time do you have to explore different options and how much risk are you willing to take? It's also important to think about whether you need a stable income.</p><p>One resource that may be helpful is the 80,000 Hours career guide. It covers key ideas such as problem selection, contribution, personal fit, and career capital. You can find more information here: <a href=\"https://80000hours.org/key-ideas/\"><u>https://80000hours.org/key-ideas/</u></a> and <a href=\"https://80000hours.org/career-guide/job-satisfaction/\"><u>https://80000hours.org/career-guide/job-satisfaction/</u></a>.</p><p>Another thing to think about is Cal Newport's idea of \"Lifestyle-Centric Career Planning.\" This involves determining the lifestyle you want and then working backwards to see how you can get there. Consider factors like your schedule, job intensity and prestige, social life, and work/leisure balance. And when you're looking at career opportunities, choose ones that align with your desired lifestyle instead of just going for the most prestigious or financially lucrative options. You can read more about this approach here: <a href=\"https://www.calnewport.com/blog/2008/05/21/the-most-important-piece-of-career-advice-you-probably-never-heard/.\"><u>https://www.calnewport.com/blog/2008/05/21/the-most-important-piece-of-career-advice-you-probably-never-heard/</u>.</a></p><p>(For example: If social interaction is important for you, don't pursue a job that involves working in isolation unless you <i>have</i> to. [This also goes for graduate studies.] If your idea of an ideal week is one with lots of meetings with people, coordinating and managing people and events, etc., then pursue a job with that instead. You might be interested in operations, e.g. <a href=\"https://80000hours.org/articles/operations-management/\">https://80000hours.org/articles/operations-management/</a> &nbsp;)</p><p>It's also important to remember that your past academic history and current career situation don't define you. It sounds like you might be telling yourself some negative things, like \"I barely escaped college with a 2.95 GPA\" or \"I probably should not have done engineering.\" But there are plenty of things you can do. It's usually not helpful to try to prove to yourself (or other people) that you're smart or capable, because it can lead to a focus on external validation rather than on impact and personal growth. This creates unnecessary stress and makes it harder to make good decisions. Sometimes people pursue graduate studies to do that, and it rarely turns out well.</p><p>If you are interested in a career direction, talk to people who are already working in that area. Set up brief calls with them and ask them about their day-to-day work. If the work and the people are compelling to you, then consider doing graduate studies if they are a prerequisite for that career direction.</p>", "parentCommentId": null, "user": {"username": "Tom Henry"}}, {"_id": "su7bgjFLq3FzJt6Jc", "postedAt": "2022-12-23T08:45:25.958Z", "postId": "ZziiF6ycby5u6TCfs", "htmlBody": "<p>This group might have useful advice for your background: <a href=\"https://www.highimpactengineers.org/\">https://www.highimpactengineers.org/</a> could reach out to them ...</p>\n<p>Good luck with the career moves</p>\n", "parentCommentId": null, "user": {"username": "weeatquince"}}, {"_id": "LTW4afspBaM2J5vLH", "postedAt": "2022-12-23T09:45:20.909Z", "postId": "ZziiF6ycby5u6TCfs", "htmlBody": "<p>In addition to the 80,000 Hours career guide already mentioned, it's worth noting that they can schedule a free 1:1 call to help you think through your options, help you work out next practical steps etc.: <a href=\"https://80000hours.org/speak-with-us/\">https://80000hours.org/speak-with-us/</a></p>\n", "parentCommentId": null, "user": {"username": "pseudobison"}}, {"_id": "r3WBccNpHrwDo9WF9", "postedAt": "2022-12-26T13:17:17.338Z", "postId": "ZziiF6ycby5u6TCfs", "htmlBody": "<p>This was so much more helpful than I ever imagined. I am going to be going through your helpful links this week to start the next phase of my career mapping. I will update you with how it goes.</p>\n<p>P.S. Are you a counselor or psychologist because the advice about not seeking external validation was something I really needed to hear. Thank you.</p>\n", "parentCommentId": "7aprbAghSs7P2FtSh", "user": {"username": "slowwber"}}, {"_id": "vWxhvEAJ2eWAq2kpS", "postedAt": "2022-12-26T13:17:42.350Z", "postId": "ZziiF6ycby5u6TCfs", "htmlBody": "<p>Thank you! I Will give them a call this week!</p>\n", "parentCommentId": "LTW4afspBaM2J5vLH", "user": {"username": "slowwber"}}, {"_id": "7HsFtw6qFZxB9mKr4", "postedAt": "2022-12-26T13:18:04.608Z", "postId": "ZziiF6ycby5u6TCfs", "htmlBody": "<p>Adding to my list of research, thank you!</p>\n", "parentCommentId": "su7bgjFLq3FzJt6Jc", "user": {"username": "slowwber"}}, {"_id": "uHPxjMFv92cwybcRB", "postedAt": "2022-12-26T13:18:33.848Z", "postId": "ZziiF6ycby5u6TCfs", "htmlBody": "<p>I can shoot you a direct message with my email, thank you!</p>\n", "parentCommentId": "6kevHfxiyeHiwZGC6", "user": {"username": "slowwber"}}, {"_id": "trHKNbuQhHq9gr7iQ", "postedAt": "2023-09-26T21:59:29.128Z", "postId": "ZziiF6ycby5u6TCfs", "htmlBody": null, "parentCommentId": null, "user": null}]