[{"_id": "dqmzbiK8nXdRpqFYv", "postedAt": "2022-09-14T14:04:41.934Z", "postId": "ZzwMBRq5KAo6wfP4K", "htmlBody": "<blockquote><p>In aggregate, the group places 38% on AI existential catastrophe, conditional on AGI being developed by 2070, and 25% on existential catastrophe via misaligned AI takeover by 2100 (<strong>suggesting that takeover is roughly two-thirds of the overall AI risk </strong>[emphasis mine]).</p></blockquote><p>The bolded portion isn't correct, since the 38% is conditional on development of AGI while the 25% is unconditional. The probability of takeover conditional on TAI is estimated as .25/.81 = 31%, so a more accurate estimate for the portion of AI risk coming from misaligned takeover is .31/.38=~82%.</p><p>Apologies for any lack of clarity in the post.</p>", "parentCommentId": null, "user": {"username": "elifland"}}, {"_id": "KwDwnTWZWNPQYoPEp", "postedAt": "2022-09-14T14:51:42.474Z", "postId": "ZzwMBRq5KAo6wfP4K", "htmlBody": "<p>Hi Eli — this was my mistake; thanks for flagging. We'll correct the post.</p>", "parentCommentId": "dqmzbiK8nXdRpqFYv", "user": {"username": "matthew.vandermerwe"}}, {"_id": "ZEHN8doHEA3y3iQY9", "postedAt": "2022-09-14T17:05:21.332Z", "postId": "ZzwMBRq5KAo6wfP4K", "htmlBody": "<p>Hi Pablo and Matthew, just a quick one:</p><blockquote><p>\"Michael Cassidy and Lara Mani warn about the risk from&nbsp;<a href=\"https://www.nature.com/articles/d41586-022-02177-x\"><strong><u>huge volcanic eruptions</u></strong></a>. Humanity devotes significant resources to managing risk from asteroids, and yet very little into risk from supervolcanic eruptions, despite these being substantially more likely. The absolute numbers are nonetheless low; super-eruptions are expected roughly once every 14,000 years. Interventions proposed by the authors include better monitoring of eruptions, investments in preparedness, and research into geoengineering to mitigate the climatic impacts of large eruptions or (most speculatively) into ways of intervening on volcanoes directly to prevent eruptions.\"</p></blockquote><p>However, their <i>Nature</i> paper is about <strong>magnitude 7</strong> eruptions, which may have a probability this century of <strong>1/6</strong>, not supervolcanic eruptions (magnitude 8), which as you point out have a much lower probability.&nbsp;</p><p>&nbsp;</p><p>I think its a fascinating paper that in a prominent, rigorous and novel way applies importance/neglectedness/tractability to a comparison of two hazards:</p><blockquote><p>\"Over the next century, large-scale volcanic eruptions are hundreds of times more likely to occur than are asteroid and comet impacts, put together. The climatic impact of these events is comparable, yet the response is vastly different. ‘Planetary defence’ receives hundreds of millions of dollars in funding each year, and has several global agencies devoted to it. [...] By contrast, there is no coordinated action, nor large-scale investment, to mitigate the global effects of large-magnitude eruptions. This needs to change.\"</p></blockquote>", "parentCommentId": null, "user": {"username": "HaydnBelfield"}}, {"_id": "BTjdvJYvNN2S8JP2G", "postedAt": "2022-09-16T09:25:14.130Z", "postId": "ZzwMBRq5KAo6wfP4K", "htmlBody": "<p>Hi Haydn — the paper is about eruptions of magnitude 7 <strong>or greater</strong>, which includes magnitude 8. The periodicity figure I quote for magnitude 8 is taken directly from the paper.&nbsp;</p>", "parentCommentId": "ZEHN8doHEA3y3iQY9", "user": {"username": "matthew.vandermerwe"}}, {"_id": "qwHWABHDgxqJAKAnB", "postedAt": "2022-09-16T18:52:47.985Z", "postId": "ZzwMBRq5KAo6wfP4K", "htmlBody": "<p>Hmm I strongly read it as focussed on magnitude 7. Eg In the paper they focus on magnitude 7 eruptions, and the 1/6 this century probability: \"The last magnitude-7 event was in Tambora, Indonesia, in 1815.\" / \"Given the estimated recurrence rate for a magnitude-7 event, this equates to more than US$1 billion per year.\" This would be corroborated by their <a href=\"https://twitter.com/MikeVolc/status/1559930496297173003\">thread</a>, <a href=\"https://forum.effectivealtruism.org/posts/8jHLSjQ6KRwHYshMD/crosspost-huge-volcanic-eruptions-time-to-prepare-nature\">Forum post</a>, and <a href=\"https://forum.effectivealtruism.org/posts/jJDuEhLpF7tEThAHy/on-the-assessment-of-volcanic-eruptions-as-global\">previous</a> <a href=\"https://www-nature-com.ezp.lib.cam.ac.uk/articles/s41467-021-25021-8\">work</a>, which emphasise 7 &amp; 1/6.</p><p>Sorry to be annoying/pedantic about this. I'm being pernickety as I view a key thrust of their research as distinguishing 7 from 8. We can't just group magnitude 7 (1/6 chance) along with magnitude 8 and write them off as a teeny 1/14,000 chance. We need to distinguish 7 from 8, consider their severity/probability seperately, and prioritise them differently.</p>", "parentCommentId": "BTjdvJYvNN2S8JP2G", "user": {"username": "HaydnBelfield"}}]