[{"_id": "sFGBzeh4PqWWpFJiB", "title": "What is evidence? ", "postedAt": "2007-09-22T04:09:00.000Z", "htmlBody": "<blockquote><p>The sentence “snow is white” is <i>true</i> if and only if snow is white.</p><p>—Alfred Tarski</p></blockquote><p>&nbsp;</p><blockquote><p>To say of what is, that it is, or of what is not, that it is not, is <i>true</i>.</p><p>—Aristotle, <i>Metaphysics IV</i></p></blockquote><p>Walking along the street, your shoelaces come untied. Shortly thereafter, for some odd reason, you start <i>believing</i> your shoelaces are untied. Light leaves the Sun and strikes your shoelaces and bounces off; some photons enter the pupils of your eyes and strike your retina; the energy of the photons triggers neural impulses; the neural impulses are transmitted to the visual-processing areas of the brain; and there the optical information is processed and reconstructed into a 3D model that is recognized as an untied shoelace. There is a sequence of events, a chain of cause and effect, within the world and your brain, by which you end up believing what you believe. The final outcome of the process is a state of <i>mind</i> which mirrors the state of your actual <i>shoelaces</i>.</p><p>What is <i>evidence?</i> It is an event entangled, by links of cause and effect, with whatever you want to know about. If the target of your inquiry is your shoelaces, for example, then the light entering your pupils is evidence entangled with your shoelaces. This should not be confused with the technical sense of “entanglement” used in physics—here I’m just talking about “entanglement” in the sense of two things that end up in correlated states because of the links of cause and effect between them.</p><p>Not every influence creates the kind of “entanglement” required for evidence. It’s no help to have a machine that beeps when you enter winning lottery numbers, if the machine <i>also</i> beeps when you enter <i>losing</i> lottery numbers. The light reflected from your shoes would not be useful evidence about your shoelaces, if the photons ended up in the same physical state whether your shoelaces were tied or untied.</p><p>To say it abstractly: For an event to be <i>evidence about</i> a target of inquiry, it has to happen <i>differently</i> in a way that’s entangled with the <i>different</i> possible states of the target. (To say it technically: There has to be Shannon mutual information between the evidential event and the target of inquiry, relative to your current state of uncertainty about both of them.)</p><p>Entanglement can be contagious when processed correctly, which is why you need eyes and a brain. If photons reflect off your shoelaces and hit a rock, the rock won’t change much. The rock won’t reflect the shoelaces in any helpful way; it won’t be detectably different depending on whether your shoelaces were tied or untied. This is why rocks are not useful witnesses in court. A photographic film will contract shoelace-entanglement from the incoming photons, so that the photo can itself act as evidence. If your eyes and brain work correctly, <i>you</i> will become tangled up with your own shoelaces.</p><p>This is why rationalists put such a heavy premium on the paradoxical-seeming claim that a belief is only really worthwhile if you could, in principle, be persuaded to believe otherwise. If your retina ended up in the same state regardless of what light entered it, you would be blind. Some belief systems, in a rather obvious trick to reinforce themselves, say that certain beliefs are only really worthwhile if you believe them <i>unconditionally</i>—no matter what you see, no matter what you think. Your brain is supposed to end up in the same state regardless. Hence the phrase, “blind faith.” If what you believe doesn’t depend on what you see, you’ve been blinded as effectively as by poking out your eyeballs.</p><p>If your eyes and brain work correctly, your beliefs will end up entangled with the facts. <i>Rational thought produces beliefs which are themselves evidence.</i></p><p>If your tongue speaks truly, your rational beliefs, which are themselves evidence, can act as evidence for someone else. Entanglement can be transmitted through chains of cause and effect—and if you speak, and another hears, that too is cause and effect. When you say “My shoelaces are untied” over a cellphone, you’re sharing your entanglement with your shoelaces with a friend.</p><p>Therefore rational beliefs are contagious, among honest folk who believe each other to be honest. And it’s why a claim that your beliefs are <i>not</i> contagious—that you believe for private reasons which are not transmissible—is so suspicious. If your beliefs are entangled with reality, they <i>should</i> be contagious among honest folk.</p><p>If your model of reality suggests that the outputs of your thought processes should <i>not</i> be contagious to others, then your model says that your beliefs are not themselves evidence, meaning they are not entangled with reality. You should apply a reflective correction, and stop believing.</p><p>Indeed, if you <i>feel</i>, on a <i>gut</i> level, what this all <i>means</i>, you will <i>automatically </i>stop believing. Because “my belief is not entangled with reality” <i>means</i> “my belief is not accurate.” As soon as you stop believing “ ‘snow is white’ is true,” you should (automatically!) stop believing “snow is white,” or something is very wrong.</p><p>So try to explain why the kind of thought processes you use systematically produce beliefs that mirror reality. Explain why you think you’re rational. Why you think that, using thought processes like the ones you use, minds will end up believing “snow is white” if and only if snow is white. If you <i>don’t</i> believe that the&nbsp;outputs of your thought processes are entangled with reality, why believe the outputs of your thought processes? It’s the same thing, or it should be.</p><p>&nbsp;</p><p><i>This work is licensed under a&nbsp;</i><a href=\"https://creativecommons.org/licenses/by/4.0/\"><i>Creative Commons Attribution 4.0 International License</i></a><i>.</i></p>", "user": {"username": "EliezerYudkowsky"}}, {"_id": "JMsJhxRbTnPuADdCi", "title": "Brian Tomasik – The Importance of Wild-Animal Suffering", "postedAt": "2009-07-08T12:42:44.362Z", "htmlBody": "<p><i>Request from author: please avoid crossposting the full essay (instead of e.g. posting a link with summary), as more copies means greater difficulty updating the content. It applies to this crosspost, as well as to potential future crossposts of this essay.</i></p><h1>Summary</h1><p>The number of wild animals <a href=\"http://www.utilitarian-essays.com/number-of-wild-animals.html\">vastly exceeds</a> that of animals on factory farms, in laboratories, or kept as pets. Therefore, animal advocates should consider focusing their efforts to raise concern about the suffering that occurs in the natural environment. While in theory this could involve trying directly to engineer more humane ecological systems, in practice I think activists should concentrate on promoting the meme of <a href=\"http://www.utilitarian-essays.com/caring-about-animal-suffering.html\">caring about</a> wild animals to other activists, academics, and other sympathetic groups. The massive amount of suffering occurring now in nature is indeed tragic, but it pales by comparison to the scale of good or harm that our descendants -- with advanced technological capability -- might effect. I fear, for instance, that future humans may undertake <a href=\"https://web.archive.org/web/20161010063519/http://quest.nasa.gov:80/mars/background/terra.html\">terraforming</a>, <a href=\"http://www.panspermia-society.com/\">directed panspermia</a>, or sentient <a href=\"https://en.wikipedia.org/wiki/Artificial_life\">simulations</a> without giving much thought to the consequences for wild animals. Our #1 priority should be to ensure that future human intelligence is used to prevent wild-animal suffering, rather than to multiply it.</p>", "user": {"username": "TianyiQ"}}, {"_id": "BbKSHJbZpgsCeE4pN", "title": "Scott Alexander – A Modest Proposal", "postedAt": "2008-11-26T17:00:16.133Z", "htmlBody": "<p><em>Some numbers have changed since 2008; as of 2021, estimates for the present marginal cost to save a child's life are more like $5000.</em></p>\n<hr>\n<p>I think dead children should be used as a unit of currency. I know this sounds controversial, but hear me out.</p>\n<p>According to Population Services International, a respected charity research group, it costs <a href=\"https://web.archive.org/web/20101014114328/http://www.givewell.net/PSI\">between $650 and $1000</a> to save one child's life through charity. You've probably heard lower numbers like twenty cents somewhere. The lower numbers are wrong. Yes, maybe an anti-measles vaccine for a kid in Africa only costs twenty cents, and measles can be fatal. But there's a lot of overhead, and you have to immunize a lot of people before you get the one kid otherwise destined to die of measles. I find the $650-$1000 figure much more believable. Let's round it off to $800.</p>\n<p>So one dead child = eight hundred dollars. If you spend eight hundred dollars on a laptop, that's one African kid who died because you didn't give it to charity. Distasteful but true. Now that we know that, we can get down to the details of designing the currency itself. It should be a big gold coin, with a picture of a smiling Burmese child on the front, and a tombstone on the back. The abbreviation can be DC.</p>\n<p>Of course, most things won't cost a whole dead child, so we'll need smaller denominations. There are four dead puppies to the dead child, since <a href=\"https://web.archive.org/web/20101014114328/http://www.helpsaveastray.com/support-your-shelter.html\">dogs cost a bit above $200 to keep alive in an animal shelter</a>. There are two <a href=\"https://web.archive.org/web/20101014114328/http://www.staro.org/index.php?id=faq039s\">burnt rainforests</a> per puppy, and five <a href=\"https://web.archive.org/web/20101014114328/http://kenyaredcross.org/aboutdetail.php?subcat=27&amp;sublev=43\">infected wounds</a> per burnt rainforest. I'm sure we can find talented artists to design the coins for all of these.</p>\n<p>Yes, you grudgingly admit, such a system is technically feasible, but why in blue blazes would we want to replace our reassuring green dollar bills graced with dignified ex-presidents, with that?</p>\n<p>I leave that question to an article I read on the BBC site today: <a href=\"https://web.archive.org/web/20101014114328/http://news.bbc.co.uk/2/hi/uk_news/england/gloucestershire/7750192.stm\">woman spends £250,000 on a luxury doghouse for her Great Danes complete with spa and plasma TV</a>.</p>\n<p>This does sound sort of ridiculous, but clearly it is not ridiculous enough. After all, at least one person thought it would be a good idea. Clearly, saying \"doghouse that costs 250,000 pounds\" does not carry the appropriate punch of \"do not buy this.\"</p>\n<p>And that's why I recommend switching to a dead-child-based currency. \"Doghouse that costs 250,000 pounds\" might not carry the proper punch. \"Doghouse that costs 500 dead children\" does. Using dead children as a unit of currency carries a built-in awareness of <a href=\"https://web.archive.org/web/20101014114328/http://www.overcomingbias.com/2008/11/positive-vs-opt.html\">opportunity</a> <a href=\"https://web.archive.org/web/20101014114328/http://en.wikipedia.org/wiki/Opportunity_costs\">costs</a>. Yes, you can buy that doghouse, if you <em>really</em> think it's more important than spending that same money to save five hundred Haitian kids' lives. Go on! Dogs watching plasma TV! That sounds <em>adorable</em>!</p>\n<p>After reading an article about <a href=\"https://web.archive.org/web/20101014114328/http://www.exmormon.org/mormon/mormon403.htm\">Mormon tithing practices</a>, I am hopeful that the switch from dollars to DCs will destroy organized religion as well. It sounds plausible for a church to say it needs two million dollars to move to a larger building. It even sounds plausible when a pastor gets up there in front of his congregation and says that God really wants every family to just give whatever little bit they're able, so that they can all buy a better house of worship and praise God in a more fitting sanctuary. My old synagogue did this for years, and no one found anything wrong with it; my parents even donated quite a big chunk of money. If my rabbi'd had to say \"We need twenty-five hundred dead children to move to a sweeter pad\", the gig would have been up.</p>\n<p>Not like I am any saint myself. The past two years, I've spent about two dead puppies on books from <a href=\"http://Amazon.com\">Amazon.com</a> alone. I am probably going to spend very close to a whole dead child to fly home for my two week winter break, and I spent ten dead children on my trip around the world this summer. I spent four infected wounds on <em>fantasy map-making software</em>. But at least in the back of my mind I realize I'm doing it. Can the people who spend a dead kid plus a dead puppy on <a href=\"https://web.archive.org/web/20101014114328/http://www.boingboing.net/2006/02/14/worlds-most-expensiv.html\">the world's most expensive sundae</a> say the same? What about <a href=\"https://web.archive.org/web/20101014114328/http://www.luxist.com/2007/01/03/diamond-studded-mobile-phone-strap/\">the Japanese guy spending 1050 dead kids on a mobile phone strap?</a></p>\n<p>One of America's top pro-life groups, Focus on the Family, spends <a href=\"https://web.archive.org/web/20101014114328/http://blog.christianitytoday.com/ctliveblog/archives/2008/11/focus_on_the_fa.html\">two hundred thousand dead children a year</a> pushing its message of conservatism and opposition to abortion. Take a second to fully appreciate the irony there.</p>\n<p>I'm not saying these people don't have a right to spend their presumably hard-earned money on whatever they want. Of course they have that right. I am just saying that if we took the simple common sense step of changing our monetary denomination from dollars to dead children, maybe they'd want something different.</p>\n<p>C'mon, I bet you an infected wound it'd work great.</p>\n", "user": {"username": "zsp"}}, {"_id": "WHL3EhgjdEcEca3ae", "title": "The Fable of the Dragon-Tyrant", "postedAt": "2005-05-01T13:18:02.785Z", "htmlBody": "<p><em>Written by Nick Bostrom.</em></p>\n<p>Once upon a time, the planet was tyrannized by a giant dragon. The dragon stood taller than the largest cathedral, and it was covered with thick black scales. Its red eyes glowed with hate, and from its terrible jaws flowed an incessant stream of evil-smelling yellowish-green slime. It demanded from humankind a blood-curdling tribute: to satisfy its enormous appetite, ten thousand men and women had to be delivered every evening at the onset of dark to the foot of the mountain where the dragon-tyrant lived. Sometimes the dragon would devour these unfortunate souls upon arrival; sometimes again it would lock them up in the mountain where they would wither away for months or years before eventually being consumed.</p>\n<p>The misery inflicted by the dragon-tyrant was incalculable. In addition to the ten thousand who were gruesomely slaughtered each day, there were the mothers, fathers, wives, husbands, children, and friends that were left behind to grieve the loss of their departed loved ones.</p>\n<p>Some people tried to fight the dragon, but whether they were brave or foolish was difficult to say. Priests and magicians called down curses, to no avail. Warriors, armed with roaring courage and the best weapons the smiths could produce, attacked it, but were incinerated by its fire before coming close enough to strike. Chemists concocted toxic brews and tricked the dragon into swallowing them, but the only apparent effect was to further stimulate its appetite. The dragon’s claws, jaws, and fire were so effective, its scaly armor so impregnable, and its whole nature so robust, as to make it invincible to any human assault.</p>\n<p>Seeing that defeating the tyrant was impossible, humans had no choice but to obey its commands and pay the grisly tribute. The fatalities selected were always elders. Although senior people were as vigorous and healthy as the young, and sometimes wiser, the thinking was that they had at least already enjoyed a few decades of life. The wealthy might gain a brief reprieve by bribing the press gangs that came to fetch them; but, by constitutional law, nobody, not even the king himself, could put off their turn indefinitely.</p>\n<p>Spiritual men sought to comfort those who were afraid of being eaten by the dragon (which included almost everyone, although many denied it in public) by promising another life after death, a life that would be free from the dragon-scourge. Other orators argued that the dragon has its place in the natural order and a moral right to be fed. They said that it was part of the very meaning of being human to end up in the dragon’s stomach. Others still maintained that the dragon was good for the human species because it kept the population size down. To what extent these arguments convinced the worried souls is not known. Most people tried to cope by not thinking about the grim end that awaited them.</p>\n<p>For many centuries this desperate state of affairs continued. Nobody kept count any longer of the cumulative death toll, nor of the number of tears shed by the bereft. Expectations had gradually adjusted and the dragon-tyrant had become a fact of life. In view of the evident futility of resistance, attempts to kill the dragon had ceased. Instead, efforts now focused on placating it. While the dragon would occasionally raid the cities, it was found that the punctual delivery to the mountain of its quota of life reduced the frequency of these incursions.</p>\n<p>Knowing that their turn to become dragon-fodder was always impending, people began having children earlier and more often. It was not uncommon for a girl to be pregnant by her sixteenth birthday. Couples often spawned a dozen children. The human population was thus kept from shrinking, and the dragon was kept from going hungry.</p>\n<p>Over the course of these centuries, the dragon, being well fed, slowly but steadily grew bigger. It had become almost as large as the mountain on which it lived. And its appetite had increased proportionately. Ten thousand human bodies were no longer enough to fill its belly. It now demanded eighty thousand, to be delivered to the foot of the mountain every evening at the onset of dark.</p>\n<p>What occupied the king’s mind more than the deaths and the dragon itself was the logistics of collecting and transporting so many people to the mountain every day. This was not an easy task.</p>\n<p>To facilitate the process, the king had a railway track constructed: two straight lines of glistening steel leading up to the dragon’s abode. Every twenty minutes, a train would arrive at the mountain terminal crammed with people, and would return empty. On moonlit nights, the passengers traveling on this train, if there had been windows for them to stick their heads out of, would have been able to see in front of them the double silhouette of the dragon and the mountain, and two glowing red eyes, like the beams from a pair of giant lighthouses, pointing the way to annihilation.</p>\n<p>Servants were employed by the king in large numbers to administer the tribute. There were registrars who kept track of whose turn it was to be sent. There were people-collectors who would be dispatched in special carts to fetch the designated people. Often traveling at breakneck speed, they would rush their cargo either to a railway station or directly to the mountain. There were clerks who administered the pensions paid to the decimated families who were no longer able to support themselves. There were comforters who would travel with the doomed on their way to the dragon, trying to ease their anguish with spirits and drugs.</p>\n<p>There was, moreover, a cadre of dragonologists who studied how these logistic processes could be made more efficient. Some dragonologists also conducted studies of the dragon’s physiology and behavior, and collected samples – its shed scales, the slime that drooled from its jaws, its lost teeth, and its excrements, which were specked with fragments of human bone. All these items were painstakingly annotated and archived. The more the beast was understood, the more the general perception of its invincibility was confirmed. Its black scales, in particular, were harder than any material known to man, and there seemed no way to make as much as a scratch in its armor.</p>\n<p>To finance all these activities, the king levied heavy taxes on his people. Dragon-related expenditures, already accounting for one seventh of the economy, were growing even faster than the dragon itself.</p>\n<p>Humanity is a curious species. Every once in a while, somebody gets a good idea. Others copy the idea, adding to it their own improvements. Over time, many wondrous tools and systems are developed. Some of these devices – calculators, thermometers, microscopes, and the glass vials that the chemists use to boil and distil liquids – serve to make it easier to generate and try out new ideas, including ideas that expedite the process of idea-generation.</p>\n<p>Thus the great wheel of invention, which had turned at an almost imperceptibly slow pace in the older ages, gradually began to accelerate.</p>\n<p>Sages predicted that a day would come when technology would enable humans to fly and do many other astonishing things. One of the sages, who was held in high esteem by some of the other sages but whose eccentric manners had made him a social outcast and recluse, went so far as to predict that technology would eventually make it possible to build a contraption that could kill the dragon-tyrant.</p>\n<p>The king’s scholars, however, dismissed these ideas. They said that humans were far too heavy to fly and in any case lacked feathers. And as for the impossible notion that the dragon-tyrant could be killed, history books recounted hundreds of attempts to do just that, not one of which had been successful. “We all know that this man had some irresponsible ideas,” a scholar of letters later wrote in his obituary of the reclusive sage who had by then been sent off to be devoured by the beast whose demise he had foretold, “but his writings were quite entertaining and perhaps we should be grateful to the dragon for making possible the interesting genre of dragon-bashing literature which reveals so much about the culture of angst!”</p>\n<p>Meanwhile, the wheel of invention kept turning. Mere decades later, humans did fly and accomplished many other astonishing things.</p>\n<p>A few iconoclastic dragonologists began arguing for a new attack on the dragon-tyrant. Killing the dragon would not be easy, they said, but if some material could be invented that was harder than the dragon’s armor, and if this material could be fashioned into some kind of projectile, then maybe the feat would be possible. At first, the iconoclasts’ ideas were rejected by their dragonologist peers on grounds that no known material was harder than dragon scales. But after working on the problem for many years, one of the iconoclasts succeeded in demonstrating that a dragon scale could be pierced by an object made of a certain composite material. Many dragonologists who had previously been skeptical now joined the iconoclasts. Engineers calculated that a huge projectile could be made of this material and launched with sufficient force to penetrate the dragon’s armor. However, the manufacture of the needed quantity of the composite material would be expensive.</p>\n<p>A group of several eminent engineers and dragonologists sent a petition to the king asking for funding to build the anti-dragon projectile. At time when the petition was sent, the king was preoccupied with leading his army into war against a tiger. The tiger had killed a farmer and subsequently disappeared into the jungle. There was widespread fear in the countryside that the tiger might come out and strike again. The king had the jungle surrounded and ordered his troops to begin slashing their way through it. At the conclusion of the campaign, the king could announce that all 163 tigers in the jungle, including presumably the murderous one, had been hunted down and killed. During the tumult of the war, however, the petition had been lost or forgotten.</p>\n<p>The petitioners therefore sent another appeal. This time they received a reply from one of the king’s secretaries saying that the king would consider their request after he was done reviewing the annual dragon-administration budget. This year’s budget was the largest to date and included funding for a new railway track to the mountain. A second track was deemed necessary, as the original track could no longer support the increasing traffic. (The tribute demanded by the dragon-tyrant had increased to one hundred thousand human beings, to be delivered to the foot of the mountain every evening at the onset of dark.) When the budget was finally approved, however, reports were coming from a remote part of the country that a village was suffering from a rattlesnake infestation. The king had to leave urgently to mobilize his army and ride off to defeat this new threat. The anti-dragonists’ appeal was filed away in a dusty cabinet in the castle basement.</p>\n<p>The anti-dragonists met again to decide what was to be done. The debate was animated and continued long into the night. It was almost daybreak when they finally resolved to take the matter to the people. Over the following weeks, they traveled around the country, gave public lectures, and explained their proposal to anyone who would listen. At first, people were skeptical. They had been taught in school that the dragon-tyrant was invincible and that the sacrifices it demanded had to be accepted as a fact of life. Yet when they learnt about the new composite material and about the designs for the projectile, many became intrigued. In increasing numbers, citizens flocked to the anti-dragonist lectures. Activists started organizing public rallies in support of the proposal.</p>\n<p>When the king read about these meetings in the newspaper, he summoned his advisors and asked them what they thought about it. They informed him about the petitions that had been sent but told him that the anti-dragonists were troublemakers whose teachings were causing public unrest. It was much better for the social order, they said, that the people accepted the inevitability of the dragon-tyrant tribute. The dragon-administration provided many jobs that would be lost if the dragon was slaughtered. There was no known social good coming from the conquest of the dragon. In any case, the king’s coffers were currently nearly empty after the two military campaigns and the funding set aside for the second railway line. The king, who was at the time enjoying great popularity for having vanquished the rattlesnake infestation, listened to his advisors’ arguments but worried that he might lose some of his popular support if was seen to ignore the anti-dragonist petition. He therefore decided to hold an open hearing. Leading dragonologists, ministers of the state, and interested members of the public were invited to attend.</p>\n<p>The meeting took place on the darkest day of the year, just before the Christmas holidays, in the largest hall of the royal castle. The hall was packed to the last seat and people were crowding in the aisles. The mood was charged with an earnest intensity normally reserved for pivotal wartime sessions.</p>\n<p>After the king had welcomed everyone, he gave the floor to the leading scientist behind the anti-dragonist proposal, a woman with a serious, almost stern expression on her face. She proceeded to explain in clear language how the proposed device would work and how the requisite amount of the composite material could be manufactured. Given the requested amount of funding, it should be possible to complete the work in fifteen to twenty years. With an even greater amount of funding, it might be possible to do it in as little as twelve years. However, there could be no absolute guarantee that it would work. The crowd followed her presentation intently.</p>\n<p>Next to speak was the king’s chief advisor for morality, a man with a booming voice that easily filled the auditorium:</p>\n<p>“Let us grant that this woman is correct about the science and that the project is technologically possible, although I don’t think that has actually been proven. Now she desires that we get rid of the dragon. Presumably, she thinks she’s got the right not to be chewed up by the dragon. How willful and presumptuous. The finitude of human life is a blessing for every individual, whether he knows it or not. Getting rid of the dragon, which might seem like such a convenient thing to do, would undermine our human dignity. The preoccupation with killing the dragon will deflect us from realizing more fully the aspirations to which our lives naturally point, from living well rather than merely staying alive. It is debasing, yes debasing, for a person to want to continue his or her mediocre life for as long as possible without worrying about some of the higher questions about what life is to be used for. But I tell you, the nature of the dragon is to eat humans, and our own species-specified nature is truly and nobly fulfilled only by getting eaten by it...”</p>\n<p>The audience listened respectfully to this highly decorated speaker. The phrases were so eloquent that it was hard to resist the feeling that some deep thoughts must lurk behind them, although nobody could quite grasp what they were. Surely, words coming from such a distinguished appointee of the king must have profound substance.</p>\n<p>The speaker next in line was a spiritual sage who was widely respected for his kindness and gentleness as well as for his devotion. As he strode to the podium, a small boy yelled out from the audience: “The dragon is bad!”</p>\n<p>The boy’s parents turned bright red and began hushing and scolding the child. But the sage said, “Let the boy speak. He is probably wiser than an old fool like me.”</p>\n<p>At first, the boy was too scared and confused to move. But when he saw the genuinely friendly smile on the sage’s face and the outreached hand, he obediently took it and followed the sage up to the podium. “Now, there’s a brave little man,” said the sage. “Are you afraid of the dragon?“</p>\n<p>“I want my granny back,” said the boy.</p>\n<p>“Did the dragon take your granny away?”</p>\n<p>“Yes,” the boy said, tears welling up in his large frightened eyes. “Granny promised that she would teach me how to bake gingerbread cookies for Christmas. She said that we would make a little house out of gingerbread and little gingerbread men that would live in it. Then those people in white clothes came and took Granny away to the dragon… The dragon is bad and it eats people… I want my Granny back!”</p>\n<p>At this point the child was crying so hard that the sage had to return him to his parents.</p>\n<p>There were several other speakers that evening, but the child’s simple testimony had punctured the rhetorical balloon that the king’s ministers had tried to inflate. The people were backing the anti-dragonists, and by the end of the evening even the king had come to recognize the reason and the humanity of their cause. In his closing statement, he simply said: “Let’s do it!”</p>\n<p>As the news spread, celebrations erupted in the streets. Those who had been campaigning for the anti-dragonists toasted each other and drank to the future of humanity.</p>\n<p>The next morning, a billion people woke up and realized that their turn to be sent to the dragon would come before the projectile would be completed. A tipping point was reached. Whereas before, active support for the anti-dragonist cause had been limited to a small group of visionaries, it now became the number one priority and concern on everybody’s mind. The abstract notion of “the general will” took on an almost tangible intensity and concreteness. Mass rallies raised money for the projectile project and urged the king to increase the level of state support. The king responded to these appeals. In his New Year address, he announced that he would pass an extra appropriations bill to support the project at a high level of funding; additionally, he would sell off his summer castle and some of his land and make a large personal donation. “I believe that this nation should commit itself to achieving the goal, before this decade is out, of freeing the world from the ancient scourge of the dragon-tyrant.”</p>\n<p>Thus started a great technological race against time. The concept of an anti-dragon projectile was simple, but to make it a reality required solutions to a thousand smaller technical problems, each of which required dozens of time-consuming steps and missteps. Test-missiles were fired but fell dead to the ground or flew off in the wrong direction. In one tragic accident, a wayward missile landed on a hospital and killed several hundred patients and staff. But there was now a real seriousness of purpose, and the tests continued even as the corpses were being dug out from the debris.</p>\n<p>Despite almost unlimited funding and round-the-clock work by the technicians, the king’s deadline could not be met. The decade concluded and the dragon was still alive and well. But the effort was getting closer. A prototype missile had been successfully test fired. Production of the core, made of the expensive composite material, was on schedule for its completion to coincide with the finishing of the fully tested and debugged missile shell into which it was to be loaded. The launch date was set to the following year’s New Year’s Eve, exactly twelve years after the project’s official inauguration. The best-selling Christmas gift that year was a calendar that counted down the days to time zero, the proceeds going to the projectile project.</p>\n<p>The king had undergone a personal transformation from his earlier frivolous and thoughtless self. He now spent as much time as he could in the laboratories and the manufacturing plants, encouraging the workers and praising their toil. Sometimes he would bring a sleeping bag and spend the night on a noisy machine floor. He even studied and tried to understand the technical aspects of their work. Yet he confined himself to giving moral support and refrained from meddling in technical and managerial matters.</p>\n<p>Seven days before New Year, the woman who had made the case for the project almost twelve years earlier, and was now its chief executive, came to the royal castle and requested an urgent audience with the king. When the king got her note, he excused himself to the foreign dignitaries whom he was reluctantly entertaining at the annual Christmas dinner and hurried off to the private room where the scientist was waiting. As always of late, she looked pale and worn from her long working hours. This evening, however, the king also thought he could detect a ray of relief and satisfaction in her eyes.</p>\n<p>She told him that the missile had been deployed, the core had been loaded, everything had been triple-checked, they were ready to launch, and would the king give his final go-ahead. The king sank down in an armchair and closed his eyes. He was thinking hard. By launching the projectile tonight, one week early, seven hundred thousand people would be saved. Yet if something went wrong, if it missed its target and hit the mountain instead, it would be a disaster. A new core would have to be constructed from scratch and the project would be set back by some four years. He sat there, silently, for almost an hour. Just as the scientist had become convinced that he had fallen asleep, he opened his eyes and said in a firm voice: “No. I want you to go right back to the lab. I want you to check and then re-check everything again.” The scientist could not help a sigh escaping her; but she nodded and left.</p>\n<p>The last day of the year was cold and overcast, but there was no wind, which meant good launch conditions. The sun was setting. Technicians were scuttling around making the final adjustments and giving everything one last check. The king and his closest advisors were observing from a platform close to the launch pad. Further away, behind a fence, large numbers of the public had assembled to witness the great event. A large clock was showing the countdown: fifty minutes to go.</p>\n<p>An advisor tapped the king on the shoulder and drew his attention to the fence. There was some tumult. Somebody had apparently jumped the fence and was running towards the platform where the king sat. Security quickly caught up with him. He was handcuffed and taken away. The king turned his attention back to the launch pad, and to the mountain in the background. In front of it, he could see the dark slumped profile of the dragon. It was eating.</p>\n<p>Some twenty minutes later, the king was surprised to see the handcuffed man reappearing a short distance from the platform. His nose was bleeding and he was accompanied by two security guards. The man appeared to be in a frenzied state. When he spotted the king, he began shouting at the top of his lungs: “The last train! The last train! Stop the last train!”</p>\n<p>“Who is this young man?” said the king. “His face seems familiar, but I cannot quite place him. What does he want? Let him come up.”</p>\n<p>The young man was a junior clerk in the ministry of transportation, and the reason for his frenzy was that he had discovered that his father was on the last train to the mountain. The king had ordered the train traffic to continue, fearing that any disruption might cause the dragon to stir and leave the open field in front of the mountain where it now spent most of its time. The young man begged the king to issue a recall-order for the last train, which was due to arrive at the mountain terminal five minutes before time zero.</p>\n<p>“I cannot do it,” said the king, “I cannot take the risk.”</p>\n<p>“But the trains frequently run five minutes late. The dragon won’t notice! Please!”</p>\n<p>The young man was kneeling before the king, imploring him to save his father’s life and the lives of the other thousand passengers onboard that last train.</p>\n<p>The king looked down at the pleading, bloodied face of the young man. But he bit his lip, and shook his head. The young man continued to wail even as the guards carried him off the platform: “Please! Stop the last train! Please!”</p>\n<p>The king stood silent and motionless, until, after while, the wailing suddenly ceased. The king looked up and glanced over at the countdown clock: five minutes remaining.</p>\n<p>Four minutes. Three minutes. Two minutes.</p>\n<p>The last technician left the launch pad.</p>\n<p>30 seconds. 20 seconds. Ten, nine, eight…</p>\n<p>As a ball of fire enveloped the launch pad and the missile shot out, the spectators instinctively rose to the tips of their toes, and all eyes fixated at the front end of the white flame from the rocket’s afterburners heading towards the distant mountain. The masses, the king, the low and the high, the young and the old, it was as if at this moment they shared a single awareness, a single conscious experience: that white flame, shooting into the dark, embodying the human spirit, its fear and its hope… striking at the heart of evil. The silhouette on the horizon tumbled, and fell. Thousand voices of pure joy rose from the assembled masses, joined seconds later by a deafening drawn-out thud from the collapsing monster as if the Earth itself was drawing a sigh of relief. After centuries of oppression, humanity at last was free from the cruel tyranny of the dragon.</p>\n<p>The joy cry resolved into a jubilating chant: “Long live the king! Long live us all!” The king’s advisors, like everybody that night, were as happy as children; they embraced each other and congratulated the king: “We did it! We did it!”</p>\n<p>But the king answered in a broken voice: “Yes, we did it, we killed the dragon today. But damn, why did we start so late? This could have been done five, maybe ten years ago! Millions of people wouldn’t have had to die.”</p>\n<p>The king stepped off the platform and walked up to the young man in handcuffs, who was sitting on the ground. There he fell down on his knees. “Forgive me! Oh my God, please forgive me!”</p>\n<p>The rain started falling, in large, heavy drops, turning the ground into mud, drenching the king’s purple robes, and dissolving the blood on the young man’s face. “I am so very sorry about your father,” said the king.</p>\n<p>“It’s not your fault,” replied the young man. “Do you remember twelve years ago in the castle? That crying little boy who wanted you to bring back his grandmother – that was me. I didn’t realize then that you couldn’t possibly do what I asked for. Today I wanted you to save my father. Yet it was impossible to do that now, without jeopardizing the launch. But you have saved my life, and my mother and my sister. How can we ever thank you enough for that?”</p>\n<p>“Listen to them,” said the king, gesturing towards the crowds. “They are cheering me for what happened tonight. But the hero is you. You cried out. You rallied us against evil.” The king signaled a guard to come and unlock the handcuffs. “Now, go to your mother and sister. You and your family shall always be welcome at the court, and anything you wish for – if it be within my power – shall be granted.”</p>\n<p>The young man left, and the royal entourage, huddling in the downpour, accumulated around their monarch who was still kneeling in the mud. Amongst the fancy couture, which was being increasingly ruined by the rain, a bunch of powdered faces expressed a superposition of joy, relief, and discombobulation. So much had changed in the last hour: the right to an open future had been regained, a primordial fear had been abolished, and many a long-held assumption had been overturned. Unsure now about what was required of them in this unfamiliar situation, they stood there tentatively, as if probing whether the ground would still hold, exchanging glances, and waiting for some kind of indication.</p>\n<p>Finally, the king rose, wiping his hands on the sides of his pants.</p>\n<p>“Your majesty, what do we do now?” ventured the most senior courtier.</p>\n<p>“My dear friends,” said the king, “we have come a long way… yet our journey has only just begun. Our species is young on this planet. Today we are like children again. The future lies open before us. We shall go into this future and try to do better than we have done in the past. We have time now – time to get things right, time to grow up, time to learn from our mistakes, time for the slow process of building a better world, and time to get settled in it. Tonight, let all the bells in the kingdom ring until midnight, in remembrance of our dead forbears, and then after midnight let us celebrate till the sun comes up. And in the coming days… I believe we have some reorganization to do!”</p>\n<h2>Moral</h2>\n<p>Stories about aging have traditionally focused on the need for graceful accommodation. The recommended solution to diminishing vigor and impending death was resignation coupled with an effort to achieve closure in practical affairs and personal relationships. Given that nothing could be done to prevent or retard aging, this focus made sense. Rather than fretting about the inevitable, one could aim for peace of mind.</p>\n<p>Today we face a different situation. While we still lack effective and acceptable means for slowing the aging process<sup class=\"footnote-ref\"><a href=\"#fn-DZooNPWDeE2c3BTdL-1\" id=\"fnref-DZooNPWDeE2c3BTdL-1\">[1]</a></sup>, we can identify research directions that might lead to the development of such means in the foreseeable future. “Deathist” stories and ideologies, which counsel passive acceptance, are no longer harmless sources of consolation. They are fatal barriers to urgently needed action.</p>\n<p>Many distinguished technologists and scientists tell us that it will become possible to retard, and eventually to halt and reverse, human senescence.<sup class=\"footnote-ref\"><a href=\"#fn-DZooNPWDeE2c3BTdL-2\" id=\"fnref-DZooNPWDeE2c3BTdL-2\">[2]</a></sup> At present, there is little agreement about the time-scale or the specific means, nor is there a consensus that the goal is even achievable in principle. In relation to the fable (where aging is, of course, represented by the dragon), we are therefore at a stage somewhere between that at which the lone sage predicted the dragon’s eventual demise and that at which the iconoclast dragonologists convinced their peers by demonstrating a composite material that was harder than dragon scales.</p>\n<p>The ethical argument that the fable presents is simple: There are obvious and compelling moral reasons for the people in the fable to get rid of the dragon. Our situation with regard to human senescence is closely analogous and ethically isomorphic to the situation of the people in the fable with regard to the dragon. Therefore, we have compelling moral reasons to get rid of human senescence.</p>\n<p>The argument is not in favor or life-span extension <em>per se</em>. Adding extra years of sickness and debility at the end of life would be pointless. The argument is in favor of extending, as far as possible, the human <em>health-span</em>. By slowing or halting the aging process, the healthy human life span would be extended. Individuals would be able to remain healthy, vigorous, and productive at ages at which they would otherwise be dead.</p>\n<p>In addition to this general moral, there are a number of more specific lessons:</p>\n<p><em>(1)</em>  <em>A recurrent tragedy became a fact of life, a statistic</em>. In the fable, people’s expectations adapted to the existence of the dragon, to the extent that many became unable to perceive its badness. Aging, too, has become a mere “fact of life” – despite being the principal cause of an unfathomable amount of human suffering and death.</p>\n<p><em>(2)</em>  <em>A static view of technology</em>. People reasoned that it would never become possible to kill the dragon because all attempts had failed in the past. They failed to take into account accelerated technological progress. Is a similar mistake leading us to underestimate the chances of a cure for aging?</p>\n<p><em>(3)</em>  <em>Administration became its own purpose</em>. One seventh of the economy went to dragon-administration (which is also the fraction of its GDP that the U.S. spends on healthcare). Damage-limitation became such an exclusive focus that it made people neglect the underlying cause. Instead of a massive publicly-funded research program to halt aging, we spend almost our entire health budget on health-care and on researching individual diseases.</p>\n<p><em>(4)</em>  <em>The social good became detached from the good for people</em>. The king’s advisors worried about the possible social problems that could be caused by the anti-dragonists. They said that no known social good would come from the demise of the dragon. Ultimately, however, social orders exist for the benefit of people, and it is generally good for people if their lives are saved.</p>\n<p><em>(5)</em>  <em>The lack of a sense of proportion.</em> A tiger killed a farmer. A rhumba of rattlesnakes plagued a village. The king got rid of the tiger and the rattlesnakes, and thereby did his people a service. Yet he was at fault, because he got his priorities wrong.</p>\n<p><em>(6)</em>  <em>Fine phrases and hollow rhetoric</em>. The king’s morality advisor spoke eloquently about human dignity and our species-specified nature, in phrases lifted, mostly verbatim, from the advisor’s contemporary equivalents.<sup class=\"footnote-ref\"><a href=\"#fn-DZooNPWDeE2c3BTdL-3\" id=\"fnref-DZooNPWDeE2c3BTdL-3\">[3]</a></sup> Yet the rhetoric was a smoke screen that hid rather than revealed moral reality. The boy’s inarticulate but honest testimony, by contrast, points to the central fact of the case: the dragon is bad; it destroys people. This is also the basic truth about human senescence.</p>\n<p><em>(7)</em>  <em>Failure to appreciate the urgency.</em> Until very late in the story, nobody fully realized what was at stake. Only as the king was staring into the bloodied face of the young pleading man does the extent of the tragedy sink in. Searching for a cure for aging is not just a nice thing that we should perhaps one day get around to. It is an urgent, screaming moral imperative. The sooner we start a focused research program, the sooner we will get results. It matters if we get the cure in 25 years rather than in 24 years: a population greater than that of Canada would die as a result. In this matter, time equals life, at a rate of approximately 70 lives per minute. With the meter ticking at such a furious rate, we should stop faffing about.</p>\n<p><em>(8)</em>  <em>“And in the coming days… I believe we have some reorganization to do!”</em> The king and his people will face some major challenges when they recover from their celebration. Their society has been so conditioned and deformed by the presence of the dragon that a frightening void now exists. They will have to work creatively, on both an individual and a societal level, to develop conditions that will keep lives flourishingly dynamic and meaningful beyond the accustomed three-score-years-and-ten. Luckily, the human spirit is good at adapting. Another issue that they may eventually confront is overpopulation. Maybe people will have to learn to have children later and less frequently. Maybe they can find ways to sustain a larger population by using more efficient technology. Maybe they will one day develop spaceships and begin to colonize the cosmos. We can leave, for now, the long-lived fable people to grapple with these new challenges, while we try to make some progress in our own adventure.<sup class=\"footnote-ref\"><a href=\"#fn-DZooNPWDeE2c3BTdL-4\" id=\"fnref-DZooNPWDeE2c3BTdL-4\">[4]</a></sup></p>\n<hr class=\"footnotes-sep\">\n<section class=\"footnotes\">\n<ol class=\"footnotes-list\">\n<li id=\"fn-DZooNPWDeE2c3BTdL-1\" class=\"footnote-item\"><p>Calorie restriction (a diet low in calories but high in nutrients) extends maximal lifespan and delays the onset of age-related illnesses in all species that have been tested. Preliminary results from an ongoing study on rhesus and squirrel monkeys show similar effects. It seems quite likely that calorie restriction would work for our species too. Few humans, however, would be willing to put themselves through a lifelong hunger-diet. Some researchers are searching for calorie-restriction mimetics – compounds that elicit the desirable effects of lowered caloric intake without us having to go hungry. (See e.g. Lane, M. et al. (1999) “Nutritional modulation of aging in nonhuman primates,” <em>J. Nutr. Health &amp; Aging</em>, 3(2): 69-76.) <a href=\"#fnref-DZooNPWDeE2c3BTdL-1\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"fn-DZooNPWDeE2c3BTdL-2\" class=\"footnote-item\"><p>A recent straw poll at the 10&lt;sup&gt;th&lt;/sup&gt; Congress of the International Association of Biomedical Gerontology revealed that the majority of the participants thought it either probable or “not improbable” that comprehensive functional rejuvenation of middle-aged mice would be possible within 10-20 years (de Grey, A. (2004), “Report of open discussion on the future of life extension research,” (Annals NY Acad. Sci., 1019, in press)). See also e.g. de Grey, A., B. Ames, et al. (2002) “Time to talk SENS: critiquing the immutability of human aging,” <em>Increasing Healthy Life Span: Conventional Measures and Slowing the Innate Aging Process: Ninth Congress of the International Association of Biomedical Gerontology</em>, ed. D. Harman (Annals NY Acad. Sci. 959: 452-462); and Freitas Jr., R. A., <em>Nanomedicine, Vol. 1</em> (Landes Bioscience: Georgetown, TX, 1999). <a href=\"#fnref-DZooNPWDeE2c3BTdL-2\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"fn-DZooNPWDeE2c3BTdL-3\" class=\"footnote-item\"><p>See, e.g. Kass, L. (2003) “Ageless Bodies, Happy Souls: Biotechnology and the Pursuit of Perfection,” _The New Atlantis, _1. <a href=\"#fnref-DZooNPWDeE2c3BTdL-3\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"fn-DZooNPWDeE2c3BTdL-4\" class=\"footnote-item\"><p>I’m grateful to many people for comments on earlier drafts, including especially Heather Bradshaw, Roger Crisp, Aubrey de Grey, Katrien Devolder, Joel Garreau, John Harris, Andrea Landfried, Toby Ord, Susan Rogers, Julian Savulescu, Ian Watson, and Kip Werking. I am also very grateful to Adi Berman, Pierino Forno, Didier Coeurnelle, and others who have translated the fable into other languages, and everybody who has helped spread the word or who have given encouragement. Thank you! <a href=\"#fnref-DZooNPWDeE2c3BTdL-4\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n</ol>\n</section>\n", "user": {"username": "EA Forum Archives"}}, {"_id": "zKduwYoHAEgmkpLpv", "title": "Pascal's Mugging", "postedAt": "2009-07-01T07:00:00.000Z", "htmlBody": "<p>In some dark alley. . .</p>\n<p><strong>Mugger:</strong> Hey, give me your wallet.</p>\n<p><strong>Pascal:</strong> Why on Earth would I want to do that?</p>\n<p><strong>Mugger:</strong> Otherwise I’ll shoot you.</p>\n<p><strong>Pascal:</strong> But you don’t have a gun.</p>\n<p><strong>Mugger:</strong> Oops! I knew I had forgotten something.</p>\n<p><strong>Pascal:</strong> No wallet for you then. Have a nice evening.</p>\n<p><strong>Mugger:</strong> Wait!</p>\n<p><strong>Pascal:</strong> Sigh.</p>\n<p><strong>Mugger:</strong> I’ve got a business proposition for you.. . .How about you give me your wallet now? In return, I promise to come to your house tomorrow and give you double the value of what’s in the wallet. Not bad, eh? A 200% return on investment in 24 hours.</p>\n<p><strong>Pascal:</strong> No way.</p>\n<p><strong>Mugger:</strong> Ah, you don’t believe that I will be as good as my word? One can’t be too careful these days. . . . Tell you what: give me your wallet, and I come to your house tomorrow and pay you 10 times its value.</p>\n<p><strong>Pascal:</strong> Sorry.</p>\n<p><strong>Mugger:</strong> OK, let me ask you something. Many people are dishonest, but some people are honest. What probability do you give to the hypothesis that I will keep my promise?</p>\n<p><strong>Pascal:</strong> 1 in 1,000?</p>\n<p><strong>Mugger:</strong> Great! OK, so give me your wallet, and tomorrow I give you 2,000 times the value of its contents. The expectation value is greatly to your advantage.</p>\n<p><strong>Pascal:</strong> There are 10 livres in my wallet. If we made a deal for you to take the wallet and bring me 10 times the value of its contents tomorrow, then maybe there’s a 1-in-a-1,000 chance that I would see the 100 livres you owe. But I’d rate the chances that you will deliver on a deal to return me 20,000 livres much lower. I doubt you even have that much money.</p>\n<p><strong>Mugger:</strong> Your scepticism is understandable, although in this particular case it happens to be misguided. For you are M. Pascal if I’m altogether not mis-taken? And I’ve heard that you’re a committed expected-Utility maximizer, and that your Utility function is aggregative in terms of happy days of life. Is that not so?</p>\n<p><strong>Pascal:</strong> It is. My Utility function is unbounded. And I deem two days of happy life twice as good as one such day; and 2,000 days twice as good as 1,000 days. I don’t believe in risk aversion or temporal discounting.</p>\n<p><strong>Mugger:</strong> Excellent. I don’t necessarily have to know that you reject risk aversion and temporal discounting, but it makes things easier. Well, have I got good news for you! I have magical powers. I can give you any finite amount of money that you might ask for tonight. What’s more, I can give you any finite amount of Utility that I choose to promise you tonight.</p>\n<p><strong>Pascal:</strong> And I should believe you why?</p>\n<p><strong>Mugger:</strong> Trust me! OK, I realize this does not give you conclusive evidence, but surely it counts a least a little bit in favour of the truth of what I am asserting. Honestly, I really do have these powers.</p>\n<p><strong>Pascal:</strong> Your conduct tonight has not inspired me with confidence in your honesty.</p>\n<p><strong>Mugger:</strong> OK, OK, OK, OK. But isn’t it possible that I am telling the truth?</p>\n<p><strong>Pascal:</strong> It is possible that you have the magic powers that you claim to have, but let me tell you, I give that a very, very low probability.</p>\n<p><strong>Mugger:</strong> That’s fine. But tell me, how low a probability exactly? Remember, you might think it all seems implausible, but we are all fallible, right? And you must admit, from what you’ve already seen and heard, that I am a rather atypical mugger. And look at my pale countenance, my dark eyes; and note that I’m dressed in black from top to toe. These are some of the telltale signs of an Operator of the Seventh Dimension. That’s where I come from and that’s where the magic work gets done.</p>\n<p><strong>Pascal:</strong> Gee. . .OK, don’t take this personally, but my credence that you have these magic powers whereof you speak is about one in a quadrillion.</p>\n<p><strong>Mugger:</strong> Wow, you are pretty confident in your own ability to tell a liar from an honest man! But no matter. Let me also ask you, what’s your probability that I not only have magic powers but that I will also use them to deliver on any promise – however extravagantly generous it may seem – that I might make to you tonight?</p>\n<p><strong>Pascal:</strong> Well, if you really were an Operator from the Seventh Dimension as you assert, then I suppose it’s not such a stretch to suppose that you might also be right in this additional claim. So, I’d say one in 10 quadrillion.</p>\n<p><strong>Mugger:</strong> Good. Now we will do some maths. Let us say that the 10 livres that you have in your wallet are worth to you the equivalent of one happy day. Let’s call this quantity of good 1 Util. So I ask you to give up 1 Util. In return, I could promise to perform the magic tomorrow that will give you an extra 10 quadrillion happy days, i.e. 10 quadrillion Utils. Since you say there is a 1 in 10 quadrillion probability that I will fulfil my promise, this would be a fair deal. The expected Utility for you would be zero. But I feel generous this evening, and I will make you a better deal: If you hand me your wallet, I will perform magic that will give you an extra 1,000 quadrillion happy days of life.</p>\n<p><strong>Pascal:</strong> I admit I see no flaw in your mathematics.</p>\n<p><strong>Mugger:</strong> This is my final offer. You’re not going to pass up a deal that we have just calculated will give you an expected Utility surplus of nearly 100 Utils, are you? That’s the best offer you are likely to see this year.</p>\n<p><strong>Pascal:</strong> Is this legitimate? You know, I’ve committed myself to trying to be a good Christian.</p>\n<p><strong>Mugger:</strong> Of course it’s legitimate! Think of it as foreign trade. Your currency is worth a lot in the Seventh Dimension. By agreeing to this transaction, you give a major boost to our economy. Oh, and did I mention the children? If only you could see the faces of the sweet little orphans who will be made so much better off if we get this influx of hard currency – and there are so many of them, so very, very, very many . . . .</p>\n<p><strong>Pascal:</strong> I must confess: I’ve been having doubts about the mathematics of infinity. Infinite values lead to many strange conclusions and paradoxes. You know the reasoning that has come to be known as ‘Pascal’s Wager’? Between you and me, some of the critiques I’ve seen have made me wonder whether I might not be somehow confused about infinities or about the existence of infinite values . . .</p>\n<p><strong>Mugger:</strong> I assure you, my powers are strictly finite. The offer before you does not involve infinite values in any way. But now I really must be off; I have an assignation in the Seventh Dimension that I’d rather not miss. Your wallet, please!</p>\n<p>Pascal hands over his wallet.</p>\n<p><strong>Mugger:</strong> Pleasure doing business. The magic will be performed tomorrow, as agreed.</p>\n", "user": {"username": "EA Fellowship"}}, {"_id": "C88E2BKGsyBxBazqX", "title": "Three ways to advance science (Nick Bostrom)", "postedAt": "2008-01-31T21:04:29.791Z", "htmlBody": "<p>There are three ways to contribute to scientific progress.&nbsp;&nbsp;The direct way is to conduct a good scientific study and publish the results.&nbsp;&nbsp;The indirect way is to help others make a direct contribution.&nbsp;&nbsp;Journal editors, university administrators and philanthropists who fund research contribute to scientific progress in this second way.&nbsp;&nbsp;A third approach is to marry the first two and make a scientific advance that itself expedites scientific advances.&nbsp;&nbsp; The full significance of this third way is commonly overlooked.&nbsp;</p><p>It is, of course, widely appreciated that certain academic contributions lay the theoretical or empirical foundations for further work.&nbsp;&nbsp;One reason why a great scientist such as Einstein is celebrated is that his discoveries have enabled thousands of other scientists to tackle problems that they could not have solved without relativity theory.&nbsp;</p><p>Yet even this deep and beautiful theory is, in one sense, very narrow.&nbsp;&nbsp;While relativity is of great help in cosmology and some other parts of physics, it is of little use to a geneticist, a paleontologist, or a neuroscientist.&nbsp;&nbsp;General relativity theory is therefore a significant but not a vast contribution to the scientific enterprise as a whole.&nbsp;</p><p>Some findings have wider applicability.&nbsp;&nbsp;The scientific method itself — the idea of creating hypotheses and subjecting them to stringent empirical tests — is one such.&nbsp;&nbsp; Many of the basic results in statistics also have very wide applicability.&nbsp;&nbsp;And some scientific instruments, such as the thermometer, the microscope, and the computer, have proved enormously useful over a wide range of domains.&nbsp;&nbsp;Institutional innovations — such as the peer‐reviewed journal — should also be counted.&nbsp;</p><p>Those who seek the advancement of human knowledge should focus more on these kinds of indirect contribution.&nbsp;&nbsp;A “superficial” contribution that facilitates work across a wide range of domains can be worth much more than a relatively “profound” contribution limited to one narrow field, just as a lake can contain a lot more water than a well, even if the well is deeper.&nbsp;</p><p>No contribution would be more generally applicable than one that improves the performance of the human brain.&nbsp;&nbsp;Much more effort ought to be devoted to the development of techniques for cognitive enhancement, be they drugs to improve concentration, mental energy, and memory, or nutritional enrichments of infant formula to optimize brain development.&nbsp;&nbsp;Society invests vast resources in education in an attempt to improve students’ cognitive abilities.&nbsp;&nbsp;Why does it spend so little on studying the biology of maximizing the performance of the human nervous system?&nbsp;</p><p>Imagine a researcher invented an inexpensive drug which was completely safe and which improved all‐round cognitive performance by just 1%.&nbsp;&nbsp;The gain would hardly be noticeable in a single individual.&nbsp;&nbsp;But if the 10 million scientists in the world all benefited from the drug the inventor would increase the rate of scientific progress by roughly the same amount as adding 100,000 new scientists.&nbsp;&nbsp;Each year the invention would amount to an indirect contribution equal to 100,000 times what the average scientist contributes.&nbsp;&nbsp; Even an Einstein or a Darwin at the peak of their powers could not make such a great impact.&nbsp;&nbsp;Meanwhile others too could benefit from being able to think better, including engineers, school children, accountants, and politicians.&nbsp;</p><p>This example illustrates the enormous potential of improving human cognition by even a tiny amount.&nbsp;&nbsp;Those who are serious about seeking the advancement of human knowledge and understanding need to crunch the numbers.&nbsp;&nbsp;Better academic institutions, methodologies, instrumentation, and especially cognitive enhancement are the fast tracks to scientific progress.</p>", "user": {"username": "EA Forum Archives"}}, {"_id": "hxM3zJHQQaF8zi2iK", "title": "Objections and Concerns About Our New Direction", "postedAt": "2012-06-22T15:59:28.903Z", "htmlBody": "<p><i>Note: The Open Philanthropy Project was </i><a href=\"https://www.openphilanthropy.org/blog/open-philanthropy-project-formerly-givewell-labs\"><i>formerly known as GiveWell Labs</i></a><i>. Before the launch of the Open Philanthropy Project Blog, this post appeared on the </i><a href=\"http://blog.givewell.org/\"><i>GiveWell Blog</i></a><i>. Uses of “we” and “our” in the below post may refer to the Open Philanthropy Project or to GiveWell as an organization. Additional comments may be available at the </i><a href=\"http://blog.givewell.org/2012/06/22/objections-and-concerns-about-our-new-direction/\"><i>original post</i></a><i>.</i></p><p>GiveWell has recently been taking on activities that may seem to represent a pretty substantial change of direction, especially for those who think of us as a “charity evaluator focused on saving the most lives per dollar spent.”</p><ul><li>Within global health and nutrition, we’re <a href=\"https://www.openphilanthropy.org/blog/givewell-labs-update-and-priority-causes#GlobalHealthAndNutrition\">considering restricted funding for specific projects</a>, not just recommendations of particular charities.</li><li>We’re also exploring other causes that are extremely different from global health and may be far less amenable to measurement and “cost per life saved” type calculations, such as <a href=\"https://www.openphilanthropy.org/blog/meta-research\">meta-research</a>.</li></ul><p>When discussing these activities, we’ve lately been encountering a couple of different objections and concerns; this post discusses the objections and our responses. In a nutshell:</p><ul><li>Some are concerned that <strong>we’ll lose our objectivity if we get involved in providing restricted funding:</strong> we’ll be tempted to rank the groups following our plans ahead of the groups following their own plans, and we’ll thus lose the quality of being a disinterested third-party evaluator. We believe we can draw a meaningful line between “charities we recommend for unrestricted funding” and “plans we have designed,” leaving individual donors to decide whether they’d rather take our recommendation unconditionally or only follow our advice in the areas where we’re disinterested; we also believe that being open to providing restricted funding is necessary and important, and justifies the resources we’ll be investing. <a href=\"https://www.openphilanthropy.org/blog/objections-and-concerns-about-our-new-direction#Objectivity\">More</a></li><li>Some are concerned that by going into new causes, we’ll be <strong>spreading ourselves too thin</strong>. Understanding global health is already an ambitious and difficult goal; it’s been suggested that we should “stick to our knitting.” We feel that sticking to global health, when we see other causes as <i>potentially</i> more promising, would be out of line with our fundamental mission and value-added as an organization that seeks to help people do as much good as possible. <a href=\"https://www.openphilanthropy.org/blog/objections-and-concerns-about-our-new-direction#Knitting\">More</a></li><li>Some are concerned specifically about <strong>new causes that don’t lend themselves to measurement and cost-effectiveness calculations</strong> (such as <a href=\"https://www.openphilanthropy.org/blog/meta-research\">meta-research</a>). It may be difficult to remain systematic and transparent about how we make decisions in these more speculative areas. We recognize this concern, but feel that we can remain systematic and transparent even where measurement is difficult or impossible; furthermore, we feel that we must find a way to do this if we are to have a strong case that philanthropy as a whole (not just sub-sectors of it) should be more systematic and transparent. <a href=\"https://www.openphilanthropy.org/blog/objections-and-concerns-about-our-new-direction#Measurement\">More</a></li></ul><p>Despite the concerns and risks above, we feel that the <a href=\"https://www.openphilanthropy.org/blog/objections-and-concerns-about-our-new-direction#Benefits\">benefits</a> of our new direction outweigh them. A major input into this view is the feeling that sticking to our old process would be extremely unlikely to result in finding more outstanding giving opportunities within a reasonable period of time; this is something we will be writing more about.</p><p>That said, <strong>we do recognize the concerns and risks, and we are interested in others’ thoughts on them.</strong></p><h1>The risk of losing our objectivity</h1><p>To date, all of GiveWell’s recommendations have involved unrestricted support to existing organizations. Because of this, we can be pointed to as a “neutral third party” that recommends organizations based exclusively on impact-related criteria. But we’re now contemplating doing what a lot of major funders do and helping to <i>set the agenda</i> for a funded organization, through the mechanism of restricted funding. If we did this, we might have difficulty being neutral between (a) projects that we help design and (b) charities that are simply asking for unrestricted funds, not contracting with us. In fact, we might be tempted to eschew (b) entirely and focus exclusively on designing - rather than finding - giving opportunities.</p><p>One important principle here is that <strong>we will draw a clear line between organizations we recommend for unrestricted funding and projects designed by GiveWell.</strong> We don’t know exactly how the visual presentation will work yet, but we have agreed on the principle that there will be a clear distinction - including on our higher-level and frequently-accessed pages - between GiveWell-designed projects and recommended charities.</p><p>Of course, there is still a risk that recommendations for unrestricted funding will have “soft conditions” (i.e., that it will be clear to charities what activities they have to carry out in order to earn or maintain recommendations); this is something that has always been true, though I think the situation is somewhat mitigated by the nature of the <a href=\"http://www.givewell.org/international/technical/criteria/scalability#HowGiveWellanalyzesroomformorefunding\">room for more funding analysis</a> we perform. (Our analysis asks for predicted charity activities based on <i>total unrestricted funding</i>, not based on <i>GiveWell-specific funding</i>. The expectation is that if GiveWell-directed funding falls short of expectations and the gap is made up by other funding, the activities will still be as outlined; this hopefully provides charities an incentive to project the activities they would most like to carry out, rather than projecting the activities they hope will most appeal to GiveWell specifically.)</p><p>Even with a clear distinction, there could still be a reasonable concern that GiveWell will over-allocate resources (in terms of investigative capacity) to designing its own projects, as opposed to finding great organizations. We recognize this concern, but wish to note that - philosophically - we <strong>greatly prefer unrestricted to restricted funding, and greatly prefer a “hands-off” to a “hands-on” approach.</strong> We don’t have the capacity to actively manage projects ourselves, and we believe projects are likely to work out better when they are run by people who fully buy into them (as opposed to people who are fulfilling the requirements of restricted funding).</p><p>It’s partly because of this philosophy that we’ve stayed away from restricted funding to date, and we remain highly cautious about it. We would prefer to stick to unrestricted funding and may never in fact deal in restricted funding.</p><p>Yet it is worth noting why we are considering restricted funding now in a way that we haven’t before. Our impression is that major funders frequently make extensive use of restricted funding; as a result, the existing landscape consists of many charities whose agendas are set partly or fully by external funders.</p><ul><li>We’ve been surprised by the disconnect we’ve observed in which there is a large number of <a href=\"http://www.givewell.org/international/technical/programs#Priorityprograms\">promising interventions</a> but few charities that focus on these interventions (in a way such that <a href=\"http://www.givewell.org/international/technical/criteria/scalability#HowGiveWellanalyzesroomformorefunding\">additional dollars</a> will mean additional execution).</li><li>More generally, we’ve been surprised that in the majority of conversations in which we ask an organization what it would do with more unrestricted funding, it has no clear answer, and prefers instead to tailor its answer to our priorities.</li></ul><p>Practically speaking, charities have to focus on what they can fund; and in today’s world, it seems possible that agendas are largely set by funders. Our ideal role would be to “free” great organizations from restricted funding, allowing them to carry out promising projects that they can’t fund otherwise. However, it seems possible that there are too few charities for whom funding would make this sort of a difference, and there is thus some argument for our taking the sort of active role that other funders do.</p><p>Finally, by being open to restricted funding, we’ve come across some opportunities that are similar to “unrestricted funding” in most relevant ways, but that structurally involve restrictions and that we couldn’t have come across using our former approach. For example, we’re currently considering the idea of funding particular parts of UNICEF that work on particular interventions that we’re interested in. This wouldn’t involve laying out our own plan, and it would involve getting money to a specific team and leaving the use of the funds at their discretion; however, we could not find this sort of giving opportunity by talking to general UNICEF representatives and asking what they would do with more unrestricted funding. In some sense it may be appropriate to think of UNICEF (and other organizations like it) as a coalition of teams with their own priorities rather than as a single team with a single set of priorities; so in this case a gift that is formally restricted may have many of the desirable qualities of an unrestricted gift. To avoid confusion, we will still distinguish any recommendations along these lines from purely unrestricted gifts, as laid out above.</p><h1>The risk of spreading ourselves too thin</h1><p>We still have a lot to learn about <a href=\"http://blog.givewell.org/2011/12/22/my-favorite-cause-for-individual-donors-global-health-and-nutrition/\">global health and nutrition</a> (as indicated by, among other things, <a href=\"http://blog.givewell.org/2012/03/26/villagereach-update/\">our continued learning from VillageReach’s progress</a>). It has been suggested that we should “stick to our knitting,” focusing on the areas of giving in which (a) we’ve built up the brand we have; (b) data and feedback loops tend to be unusually good for the nonprofit world, facilitating learning.</p><p>In response, I’d observe:</p><ul><li>GiveWell is still a young organization. I believe we have attracted attention more for “bringing a different perspective and approach to giving” than for “being experts in global health” (the latter certainly does not describe us). We recognize that we’re taking some level of risk in moving into new areas, but we also believe that taking risks and staying open to new approaches is a major part of what makes GiveWell what it is and that part of “sticking to our knitting” is retaining this quality. We believe that GiveWell and the donors who use our research will be best served by our continuing to do whatever we believe will lead to the best giving opportunities, continuing to change course as much as necessary to facilitate this, and continuing to bring a different perspective and approach to giving - not continuing to focus on global health.</li><li>While we <a href=\"http://blog.givewell.org/2011/12/22/my-favorite-cause-for-individual-donors-global-health-and-nutrition/\">currently believe that global health is the most promising cause given the information available</a>, we are not confident in this conclusion. We believe that <a href=\"https://www.openphilanthropy.org/blog/givewell-labs-update-and-priority-causes\">other causes are potentially promising as well</a>, and if we never investigate them, we will be failing in our mission of finding the best giving opportunities possible.</li><li>We are currently expanding our staff; we expect that we will invest at least as much time in global health over the next few years as over the last few (while also investing time in other causes).</li></ul><h1>The risk of losing transparency and systematicity as we move away from highly measurable interventions</h1><p>We have <a href=\"http://blog.givewell.org/2011/12/22/my-favorite-cause-for-individual-donors-global-health-and-nutrition/\">written before</a> that the cause of “global health and nutrition” seems unusually well-suited to meaningful measurement and metrics (by the standards of the nonprofit sector). When working within this cause, we have been able to be relatively clear about our <a href=\"http://www.givewell.org/international/process/2011\">process</a> and about what distinguishes a recommended from a non-recommended charity. There is some risk that as we tackle other causes, such as <a href=\"https://www.openphilanthropy.org/blog/meta-research\">meta-research</a>, we will have less of an evidence base to go off of; our goals will be further out; we will have to use more intuition and may therefore become less systematic and transparent.</p><p>We believe this is a real risk. However, we also believe that (a) the best opportunities for good giving don’t necessarily lie in the domains with the highest measurability (though there is something to be said for measurability, all else equal); (b) we have reached the point where we feel we can explore causes such as meta-research in a way that - while not as systematic as our work on global health - will still include a great deal of public discussion of how we’re thinking, why we recommend what we do, what the key assumptions are in our thinking and recommendations, and how our projects progress over time.</p><p>We have long advocated that philanthropists should be more systematic and transparent in their work. If our own systematicity and transparency applies only to the cause where measurement is easiest, we won’t have a very strong case; if, however, we can consistently bring an unusually level of systematicity and transparency to every cause we examine (even those that are less prone to measurement), we will have much more potential to change philanthropy broadly rather than just a single sector of it.</p><h1>The benefits of our new direction</h1><p>The above discussion addresses potential concerns over our new direction. We have <a href=\"https://www.openphilanthropy.org/blog/why-givewell-labs\">previously discussed the substantial benefits</a>: finding the best giving opportunities possible and reaching the largest donors possible, both of which are core to our mission. Dealing with the above issues - keeping a focus on recommending unrestricted funding when possible, covering new causes without overly detracting from continued progress on the causes we know well, and remaining systematic and transparent - will be a challenge, but we feel that it is well worth it, <strong>especially because we feel we are reaching the limits (for the moment) of our old approach</strong>. (We went through a <a href=\"http://www.givewell.org/international/process/2011\">large number of charities in 2011</a> and are skeptical that we will find new contenders for our <a href=\"http://www.givewell.org/charities/top-charities\">top charities</a>, using that basic methodology, anytime in the near future.)</p><p>We welcome further comments and criticisms regarding our new approach.</p>", "user": {"username": "HoldenKarnofsky"}}, {"_id": "wGnv6yDuSTWwgGrnE", "title": "Philanthropy's Success Stories", "postedAt": "2012-03-01T16:53:11.722Z", "htmlBody": "<p><i>Note: The Open Philanthropy Project was </i><a href=\"https://www.openphilanthropy.org/blog/open-philanthropy-project-formerly-givewell-labs\"><i>formerly known as GiveWell Labs</i></a><i>. Before the launch of the Open Philanthropy Project Blog, this post appeared on the </i><a href=\"http://blog.givewell.org/\"><i>GiveWell Blog</i></a><i>. Uses of “we” and “our” in the below post may refer to the Open Philanthropy Project or to GiveWell as an organization. Additional comments may be available at the </i><a href=\"http://blog.givewell.org/2012/03/01/philanthropys-success-stories/\"><i>original post</i></a><i>.</i></p><p>The first item on the agenda for <a href=\"https://www.openphilanthropy.org/blog/announcing-givewell-labs\">GiveWell Labs</a> is to get the broadest possible view of philanthropy: its history (what’s gone well, what hasn’t) and its current state (what’s being funded and what isn’t).</p><p>On the history front, I’ve found very little of interest. Most <a href=\"http://www.amazon.com/s/ref=nb_sb_noss?url=search-alias%3Dstripbooks&amp;field-keywords=philanthropy&amp;x=6&amp;y=26\">books on philanthropy</a> are how-to’s rather than histories, and most of the histories don’t appear to focus on listing specific cases where foundations had (or failed to have) impact. One exception is <a href=\"http://www.amazon.com/Casebook-Foundation-Great-American-Secret/dp/1586484885/ref=sr_1_1?s=books&amp;ie=UTF8&amp;qid=1329784288&amp;sr=1-1\">the Casebook for <i>The Foundation: A Great American Secret</i></a>, which lists and discusses “100 of the highest-achieving foundation initiatives” since 1900.</p><p>I thoroughly examined this volume, and collected some basic notes into a <a href=\"http://blog.givewell.org/attachments/casebook%20notes%20-%20for%20publication.xls\">spreadsheet</a>. My reflections follow. In brief, I felt there were some very strong cases here, particularly in the area of medical research, and I was surprised by philanthropy’s history of being active in shaping various graduate education programs. At the same time, I thought the Casebook’s history had important shortcomings - in particular, not putting successes in context along with failures - and I see a lot of room for improvement in the amount of information available about the history of philanthropic successes and failures.</p><p>Note that I am not well-informed about most of the cases discussed here and have relied on the Casebook for my information. The notes that follow <strong>are only loose impressions and are not backed by the sort of evidence that we usually seek (even for blog posts).</strong></p><p><strong>Philanthropy has some extremely impressive accomplishments.</strong> Among other things, foundations have been (in my view) reasonably credited for leading the way on building schools and hospitals in the rural Southern U.S., piloting the shoulder line on U.S. roads, successfully advocating for federal legislation in areas including health care for the homeless and nuclear deproliferation, the research that led to the <a href=\"http://blog.givewell.org/2009/03/16/can-the-green-revolution-be-repeated-in-africa/\">Green Revolution</a>, and many major advances in medical research (including the first combination drug therapy for AIDS and the development of the pap smear). There are many other projects that sound like they may have been impactful, but which the Casebook doesn’t give enough context on for me to have a strong view.</p><p><strong>The most impressive cases (in my view) are mostly the earlier ones.</strong> Though the Casebook focuses on more recent philanthropy (78 of its 100 cases are post-1950), 9 of the 14 cases I found most impressive are pre-1950 (and a 10th is from 1952).</p><p>A possible explanation is that <a href=\"http://blog.givewell.org/2011/06/11/why-we-should-expect-good-giving-to-be-hard/\">the space of doing good has become more crowded</a> over time. For example, note that</p><ul><li>Total U.S. government health spending was 0.26% of GDP in 1902 and 0.92% of GDP in 1950; by contrast, in 2009, it was 7.06% of GDP (these figures are in the spreadsheet linked above), and even most <i>developing</i> countries spend 2%+ of GDP on in this area (<a href=\"http://data.worldbank.org/indicator/SH.XPD.PUBL.ZS\">source</a>). In 1927, the Commonwealth Fund piloted a rural hospital program; there aren’t a lot of “philanthropic opportunities” that look like that today.</li><li>Total U.S. government education spending was 1.07% of GDP in 1902 and 3.28% of GDP in 1950; by contrast, in 2009, it was 6.16% of GDP (these figures are in the spreadsheet linked above), and even most <i>developing</i> countries spend 3%+ of GDP on in this area (<a href=\"http://data.worldbank.org/indicator/SH.XPD.PUBL.ZS\">source</a>). In 1902, the Rockefeller Foundation funded advocacy for providing public schools in the U.S. South; there aren’t a lot of “philanthropic opportunities” that look like that today.</li><li>More context: The Department of Education was created in 1979, the National Science Foundation was created in 1950, and the National Institutes of Health began in 1930 (but have grown significantly since; in fact one of the “success stories” in the Casebook discusses the growth of the NIH budget from $2.4 million in 1945 to $5.5 billion in 1985).</li></ul><p><strong>The most impressive achievements (in my view) are concentrated in the sectors of research (particularly medical research) and health care.</strong> In part, these reflect the fact that achievements in these two fields tend to be unusually tangible. However, it’s worth noting that many of the cases discussed in the Casebook have had decades to show a tangible impact on policy and institutions.</p><p><strong>Foundations have a long history of influencing the curricula of colleges and graduate schools.</strong> I was surprised by how many of the cases fell into this category (marked “graduate education” or “undergraduate education” in the spreadsheet linked above) because I rarely hear about it in the context of modern philanthropy. While in most cases the long-term impact of foundations’ work in this area remains unclear, they appear to have had a lot of highly tangible proximate success, i.e., they have succeeded in getting universities to follow the paths they’ve advocated for.</p><p><strong>Some “philanthropic success stories” may have created institutions that have now outlived their purpose.</strong> For example, the National Merit Scholarship Corporation was created in 1955; at that time, “38 percent of students in the top 2 percent of intelligence quotients were not pursuing a college education” and the scholarships it offered may have been highly impactful. Today, my impression of National Merit Scholarships is that they are small compared to college tuition (<a href=\"https://www.nationalmerit.org/s/1758/interior.aspx?sid=1758&amp;gid=2&amp;pgid=424\">$2500</a>) and that they are fungible with need-based aid; they therefore don’t seem to impact people’s ability to attend college.</p><p><strong>I see impressive choices of causes and organizations; I don’t see impressive “tactics,” i.e., choices of projects or theories of change.</strong> This may simply be a reflection of the Casebook’s choice of approach and focus. There are many cases in which I found myself agreeing with the Casebook that a foundation had chosen an important and overlooked problem to put its money toward, but few (if any) cases where its strategy <i>within</i> the sector seemed particularly intricate, clever, noteworthy or crucial to its success. The spreadsheet above categorizes grants both by “sector” and by “type of grantmaking”; there is a surprising (to me) amount of variety when it comes to the former, and not as much when it comes to the latter.</p><p>My intuition is that the choice of sector is the most important choice a funder makes.</p><p><strong>Two particular approaches - “blue-ribbon panels” and pilots for government programs - were common in early philanthropy, but have recently been more rare (at least among success stories).</strong> Regarding the former: the Casebook gives the impression that in some early cases, a foundation was the first/only agent to commission a “blue-ribbon panel” to produce a report on, e.g., medical or legal education, and that the report was eagerly awaited and garnered instant attention. Today, my impression is that it is very common for foundations to produce these sorts of reports, but that getting people to pay attention to them is more of an uphill battle.</p><p><strong>Strong patterns emerge when one asks, “Why was philanthropy needed here - why didn’t beneficiaries create change for themselves?”</strong> We’ve <a href=\"http://blog.givewell.org/2011/06/11/why-we-should-expect-good-giving-to-be-hard/\">written previously</a> that there are many mechanisms for helping people other than philanthropy. In Column J, I tried to summarize the relevant properties of a project’s “constituency” (the people who stood to benefit from it) with an eye toward explaining why this constituency didn’t address (or wasn’t perceived to have addressed) its own needs, leading to a (perceived) need for philanthropy. I found that the following situations were common:</p><ul><li>Many projects’ primary constituencies were disadvantaged people (18 cases) or the environment (8 cases); it is easy to see why these constituencies wouldn’t create change for themselves.</li><li>Many projects were focused on funding research for public consumption (24 cases) or on funding/improving education (27 cases). In theory, there are incentives for people to work on improving their own education (or their children’s) and there are incentives to do research; but in practice the connection between investment and reward may be weak enough that these links often break. (Research is also a global public good: when it is disseminated publicly, most of the benefits of the research cannot be captured by those who paid for it. Note that there are other kinds of public goods, such as parks, that seem less of a fit for large-scale philanthropy since they can be supported by community- or government-level philanthropy.)</li><li>2 projects focused on educating the general public on health; 1 advocated for increased government support for public radio; 3 focused on facilitating coordination between nations (e.g., nuclear deproliferation); 2 couldn’t be categorized because the projects were too general in scope.</li><li>The remaining projects present, in my view, the most puzzling cases in terms of this question. There were 6 cases in which philanthropic funding led to the creation of organizations or movements that eventually came to be supported directly by their customers or communities (such as Blue Cross Blue Shield and Grameen Bank); there were 8 cases in which philanthropy focused on improving the general efficacy of government services. These were cases in which philanthropists may have found (or believed they had found) that <a href=\"http://blog.givewell.org/2011/06/11/why-we-should-expect-good-giving-to-be-hard/\">other actors</a> were fulfilling their roles suboptimally.</li></ul><p><strong>The Casebook has major biases and limitations, and there could be many impressive cases that it does not reveal</strong> (either by not covering them or by not discussing them convincingly enough).</p><ul><li>It often makes a thin case, or no case, for the big-picture impact of a foundation’s work. Chapter 71, on the Annie E. Casey Foundation’s collection and publication of data on well-being of U.S. children, is a particularly vivid example of this: it seems a case for impact might be possible to make but the book makes no attempt to do so.</li><li>It seems overly eager to ascribe positive impact to a foundation’s work, and to overlook possible negative/offsetting impact. For example, in Chapter 24, it implicitly credits the Rockefeller Foundation’s work on studying population for subsequent slowing of population growth (the latter has many other, and I believe stronger, candidates for explanation).</li><li>It seems very focused on large foundations (in Chapter 40, only the Edna McConnell Clark Foundation appears in the chapter headline, even though three other foundations are given credit for being the earlier seed funding for the project discussed).</li><li>It also seems to place a heavy emphasis on “innovative work” rather than on results (for example, Chapter 92 emphasizes the dramatic change and unusual approach the Edna McConnell Clark Foundation took in funding the Nurse-Family Partnership, Harlem Children’s Zone, and Youth Villages, but does not discuss the evidence - which I independently believe to be reasonably strong by the standards of U.S. social programs - that these programs have been impactful).</li></ul><p><strong>The Casebook is the best resource I’ve found for getting a sense of the history of philanthropy, but its usefulness is severely limited by the lack of “failure stories” and the lack of dissenting perspectives.</strong> Which of these cases are widely/consensually believed to have had strong impact, and which are simply admired by the Casebook’s authors? How many failures accompanied the listed successes for each foundation, for each sector? Without this information, it’s not possible to get a real sense of “what’s worked and what hasn’t” in philanthropy.</p><p>I don’t think the Casebook authors can be blamed for this situation. The larger issue is that foundations publish very little of substance on the case for their work’s impact (or lack thereof). We don’t want to go into <a href=\"https://www.openphilanthropy.org/blog/announcing-givewell-labs\">GiveWell Labs</a> with so little historical context, but unfortunately it looks like we will have to. Hopefully, future philanthropists will be more easily able to learn from our work.</p>", "user": {"username": "HoldenKarnofsky"}}, {"_id": "gG4vFboiHsNGMSpy4", "title": "Biotechnology and biosecurity", "postedAt": "2008-09-01T07:00:00.000Z", "htmlBody": "<p>This is chapter 20 of \"<a href=\"https://www.goodreads.com/book/show/2659696-global-catastrophic-risks\">Global Catastrophic Risks</a>\". The chapter was written by Ali Nouri and Christopher F. Chyba.</p><p>We've made a few small formatting changes to make the text easier to follow.</p><h2><strong>Introduction</strong></h2><p>Biotechnological power is increasing exponentially, reminiscent of the increase in computing power since the invention of electronic computers. The co-founder of Intel Corporation, Gordon Moore, pointed out in 1965 that the number of transistors per computer chip - a measure of how much computation can be done in a given volume - has doubled roughly every 18 months (Moore, 1965). This exponential increase in computing power, now called 'Moore's Law', has continued to hold in the decades since then (Lundstrom, 2003) and is the reason that individuals now have more computing power available in their personal computers than that was available only to the most advanced nations only decades ago.&nbsp;</p><p>Although biotechnology's exponential lift off began decades after that of computing, its rate of increase, as measured, for example, by the time needed to synthesize a given DNA sequence, is as fast or faster than that of Moore's Law (Carlson, 2003). Just as Moore's Law led to a world of personal computing and home appliance microprocessors, so biotechnological innovation is moving us into a world where the synthesis of DNA, as well as other biological manipulations, will be increasingly available to small groups of technically competent and even individual users.</p><p>There is already a list of well-known experiments - and many others that have received less public attention - that illustrates the potential dangers intrinsic to modern biological research and development. We review several examples of these in some detail below, including:&nbsp;</p><ul><li>Genetic manipulations that have rendered certain viruses far more deadly to their animal hosts (Jackson et al., 2001).</li><li>The synthesis of polio virus from readily purchased chemical supplies (Cello et al., 2002) - so that even if the World Health Organization (WHO) succeeds in its important task for eradicating polio worldwide, the virus can be reconstituted in laboratories around the world.</li><li>The reduction in the time needed to synthesize a virus genome comparable in size to the polio virus from years to weeks.</li><li>The laboratory re-synthesis of the 1918 human influenza virus that killed tens of millions of people worldwide (Tumpey et al., 2005).</li><li>The discovery of 'RNA interference', which allows researchers to turn off certain genes in humans or other organisms (Sen et al., 2006).</li><li>And the new field of 'synthetic biology', whose goal is to allow practitioners<br>to fabricate small 'biological devices' and ultimately new types of microbes<br>(Fu, 2006).</li></ul><p>The increase in biological power illustrated by these experiments, and the global spread of their underlying technologies, is predicted to lead to breathtaking advances in medicine, food security, and other areas crucial to human health and economic development. For example, the manipulation of biological systems is a powerful tool that allows controlled analysis of the function - and therefore vulnerabilities of and potential defences against - disease organisms. However, this power also brings with it the potential for misuse (NRC, 2006). It remains unclear how civilization can ensure that it reaps the benefits of biotechnology while protecting itself from the worst misuse.&nbsp;</p><p>Because of the rapid spread of technology, this problem is an intrinsically international one. However, there are currently no good models from Cold War arms control or non-proliferation diplomacy that are suited to regulating this uniquely powerful and accessible technology (Chyba and Greninger, 2004). There are at least two severe challenges to any regulatory scheme (Chyba, 2006). The first is the mismatch between the rapid pace of biotechnological advances and the comparative sluggishness of multilateral negotiation and regime building. The second is the questionable utility of large-scale monitoring and inspections strategies to an increasingly widespread, small-scale technology.</p><p>However, this is not a counsel for despair. What is needed is a comprehensive strategy for the pursuit of biological security - which we assume here to be the protection of people, animals, agriculture and the environment against natural or intentional outbreaks of disease. Such a strategy is not yet in place, either nationally or globally, but its contours are clear. Importantly, this strategy must be attentive to different categories of risk, and pay attention to how responses within one category strengthen or weaken the response to another. These categories of risk include: naturally occurring diseases; illicit state biological weapons programmes; non-state actors and bio-hackers; and laboratory accidents or other inadvertent release of disease agents.</p><p>Just this listing alone emphasizes several important facts. The first is that while about 14 million people die annually from infectious diseases (WHO, 2004) (mostly in the developing world), only five people died in the 2001 anthrax attacks in the United States (Jernigan et al., 2002), and there have been very few other modern acts of biological terrorism. Any approach to the dual-use challenge of biotechnology, which substantially curtails the utility of biotechnology to treat and counter disease, runs the risk of sacrificing large numbers of lives to head off hypothetical risks.&nbsp;</p><p>Yet it is already clear that humans can manipulate pathogens in ways that go beyond what evolution has so far wrought, so the hypothetical must nevertheless be taken seriously. A proper balance is needed, and an African meeting on these issues in October 2005 suggested one way to strike it. The Kampala Compact declared that while 'the potential devastation caused by biological weapons would be catastrophic for Africa' , it is 'illegitimate' to address biological weapons threats without also addressing key public health issues such as infectious disease. The developed and developing world must find common ground.</p><p>A second important observation regarding biological terrorism is that there have, so far, been very few actual attacks by non-state groups. It is clearly important to understand why this has been the case, and to probe the extent to which it has been due to capabilities or motivations - and how whatever inhibitions may have been acting can be strengthened. Sceptical treatments of the biological terrorism threat, and of the dangers of apocalyptic dramatization more generally, can place important focus on these issues - though the examples of dual-use research already mentioned, plus recent US National Academy of Sciences studies and statements by the UN Secretary-General make it clear that the problem is real, not hype.&nbsp;</p><p>(One important sceptical discussion of the bioterrorism threat is Milton Leitenberg, <a href=\"https://armscontrolcenter.org/wp-content/uploads/2016/02/M-Leitenbergs-full-Army-War-College-Book.pdf\"><i>Assessing the Biological Weapons and Bioterrorism Threat</i></a>.)</p><p>While the focus of this chapter will be on biotechnological capabilities, and how those capabilities may be responsibly controlled, it should be remembered that a capabilities-based threat assessment only provides part of the comprehensive picture that is required. Indeed, it is striking to compare the focus on capabilities in many technology oriented threat assessments with the tenor of one of the most influential threat assessments in US history, George Kennan's 'X' article in <i>Foreign Affairs</i> in 1947. In this piece, Kennan crystallized the US policy of containment of the Soviet Union that prevailed for decades of the Cold War. On reading today, one is struck by how little of the X article addressed Soviet capabilities. Rather, nearly all of it concerned Soviet intentions and motives, with information based on Kennan's experience in Soviet society, his fluency in Russian, and his knowledge of Russian history and culture. To the extent that the biological security threat emanates from terrorist groups or irresponsible nations, a similar sophistication with respect to motives and behaviour must be brought to bear (see also Chapters 4 and 19 in this volume).</p><p>In this chapter, we first provide a survey of biological weapons in history and efforts to control their use by states via multilateral treaties. We then describe the biotechnological challenge in more detail. Finally, we survey a variety of approaches that have been considered to address these risks. As we will see, there are no easy answers.</p><h3><a href=\"https://drive.google.com/file/d/18Aq_7_f-PM5POuAFK9U-JbPDVdHFKLDo/view?usp=sharing\"><strong>Read the rest of the chapter</strong></a></h3>", "user": {"username": "EA Fellowship"}}, {"_id": "s5s7dNM6v2vg2xz6A", "title": "The Cognitive Science of Rationality", "postedAt": "2011-09-12T10:35:42.246Z", "htmlBody": "<p><em><em>Update, March 2021:</em> I wrote this post ten years ago. Since then, we've learned more about the replication crisis in many fields, including psychology. Some of the specific studies I've mentioned here may be tainted by poor methodology or other problems. However, I still believe that the main ideas of the post (that human reasoning is flawed, and that there are ways we can improve it) hold true.</em></p>\n<hr>\n<p>The last 40 years of cognitive science have taught us a great deal about how our brains produce errors in thinking and decision making, and about how we can overcome those errors. These methods can help us form more accurate beliefs and make better decisions.</p>\n<p>Long before the first Concorde supersonic jet was completed, the British and French governments developing it realized it would lose money. But they continued to develop the jet when they should have cut their losses, because they felt they had \"invested too much to quit\"<sup class=\"footnote-ref\"><a href=\"#fn-ETotYQmrKgzCNzw6Z-1\" id=\"fnref-ETotYQmrKgzCNzw6Z-1\">[1]</a></sup> (sunk cost fallacy<sup class=\"footnote-ref\"><a href=\"#fn-ETotYQmrKgzCNzw6Z-2\" id=\"fnref-ETotYQmrKgzCNzw6Z-2\">[2]</a></sup>).</p>\n<p>John tested positive for an extremely rare but fatal disease, using a test that is accurate 80% of the time. John didn't have health insurance, and the only available treatment — which his doctor recommended — was very expensive. John agreed to the treatment, his retirement fund was drained to nothing, and during the treatment it was discovered that John did <em>not</em> have the rare disease after all. Later, a statistician explained to John that because the disease is so rare, the chance that he had had the disease even <em>given</em> the positive test was less than one in a million. But neither John's brain nor his doctor's brain had computed this correctly (<a href=\"http://en.wikipedia.org/wiki/Base_rate_fallacy\">base rate neglect</a>).</p>\n<p>Mary gave money to a charity to save lives in the developing world. Unfortunately, she gave to a charity that saves lives at a cost of $100,000 per life instead of one that saves lives at 1/10th that cost, because the less efficient charity used a vivid picture of a starving child on its advertising, and our brains respond more to single, identifiable victims than to large numbers of victims (identifiability effect<sup class=\"footnote-ref\"><a href=\"#fn-ETotYQmrKgzCNzw6Z-3\" id=\"fnref-ETotYQmrKgzCNzw6Z-3\">[3]</a></sup> and scope insensitivity<sup class=\"footnote-ref\"><a href=\"#fn-ETotYQmrKgzCNzw6Z-4\" id=\"fnref-ETotYQmrKgzCNzw6Z-4\">[4]</a></sup>).</p>\n<p>During the last four decades, cognitive scientists have discovered a long list of <a href=\"http://wiki.lesswrong.com/wiki/Bias\">common thinking errors</a> like these. These errors lead us to false beliefs and poor decisions.</p>\n<p>How are these errors produced, and how can we overcome them? Vague advice like \"be skeptical\" and \"think critically\" may not help much. Luckily, cognitive scientists know a great deal about the mathematics of <em>correct</em> thinking, how thinking errors are <em>produced</em>, and how we can <em>overcome</em> these errors in order to live more fulfilling lives.</p>\n<h2>Rationality</h2>\n<p>First, what is <a href=\"https://www.lesswrong.com/lw/31/what_do_we_mean_by_rationality/\">rationality</a>? It is not the same thing as intelligence, because even those with high intelligence fall prey to some thinking errors as often as everyone else.<sup class=\"footnote-ref\"><a href=\"#fn-ETotYQmrKgzCNzw6Z-5\" id=\"fnref-ETotYQmrKgzCNzw6Z-5\">[5]</a></sup> But then, what <em>is</em> rationality?</p>\n<p>Cognitive scientists recognize two kinds of rationality:</p>\n<ul>\n<li><strong>Epistemic rationality</strong> is about forming true beliefs, about getting the <em>map in your head</em> to accurately reflect the <em>territory of the world</em>. We can measure epistemic rationality by comparing the rules of logic and probability theory to the way that a person <em>actually</em> updates their beliefs.</li>\n<li><strong>Instrumental rationality</strong> is about making decisions that are well-aimed at bringing about what you want. Due to habit and bias, many of our decisions don't actually align with our goals. We can measure instrumental rationality with a variety of techniques developed in economics, for example testing whether a person obeys the 'axioms of choice'.<sup class=\"footnote-ref\"><a href=\"#fn-ETotYQmrKgzCNzw6Z-6\" id=\"fnref-ETotYQmrKgzCNzw6Z-6\">[6]</a></sup>\nIn short, rationality improves our choices concerning what to believe and what to do.</li>\n</ul>\n<p>Unfortunately, human <em>irrationality</em> is quite common, as shown in popular books like <em><a href=\"http://www.amazon.com/Predictably-Irrational-Revised-Expanded-Decisions/dp/0061353248/ref=as_li_ss_tl?ie=UTF8&amp;camp=1789&amp;creative=390957&amp;creativeASIN=0321928423&amp;linkCode=as2&amp;tag=lesswrong-20\">Predictably Irrational: The Hidden Forces that Shape Our Decisions</a></em> and <em><a href=\"http://www.amazon.com/Kluge-Haphazard-Evolution-Human-Mind/dp/B002ECETZY/ref=as_li_ss_tl?ie=UTF8&amp;camp=1789&amp;creative=390957&amp;creativeASIN=0321928423&amp;linkCode=as2&amp;tag=lesswrong-20\">Kluge: The Haphazard Evolution of the Human Mind</a></em>.</p>\n<p>Ever since Aristotle spoke of humans as the \"rational animal,\" we've had a picture of ourselves as rational beings that are hampered by shortcomings like anger, fear, and confirmation bias.</p>\n<p>Cognitive science says just the opposite. Cognitive science shows us that humans just <em>are</em> a collection of messy little modules like anger and fear and the modules that produce confirmation bias. We have a <em>few</em> modules for processing logic and probability and rational goal-pursuit, but they are slow, energy-expensive, and rarely used.</p>\n<p>As we'll see, our brains avoid using these expensive modules whenever possible. Robert Boyd and Pete Richerson explain:</p>\n<blockquote>\n<p>...all animals are under stringent selection pressure to be as stupid as they can get away with.<sup class=\"footnote-ref\"><a href=\"#fn-ETotYQmrKgzCNzw6Z-7\" id=\"fnref-ETotYQmrKgzCNzw6Z-7\">[7]</a></sup></p>\n</blockquote>\n<p>Or, as philosopher David Hull put it:</p>\n<blockquote>\n<p>The rule that human beings seem to follow is to engage [rational thought] only when all else fails — and usually not even then.<sup class=\"footnote-ref\"><a href=\"#fn-ETotYQmrKgzCNzw6Z-8\" id=\"fnref-ETotYQmrKgzCNzw6Z-8\">[8]</a></sup></p>\n</blockquote>\n<h2>Human reasoning</h2>\n<p>So how does human reasoning work, and why does it so often produce mistaken judgments and decisions?</p>\n<p>Today, cognitive scientists talk about <a href=\"https://www.lesswrong.com/lw/531/how_you_make_judgments_the_elephant_and_its_rider/\">two kinds</a> of processes, what Daniel Kahneman (2011) calls \"fast and slow\" processes:</p>\n<ul>\n<li><strong>Type 1 processes</strong> are fast, do not require conscious attention, do not need input from conscious processes, and can operate in parallel.</li>\n<li><strong>Type 2 processes</strong> are slow, require conscious effort, and generally only work one at a time.</li>\n</ul>\n<p>Type 1 processes provide judgments quickly, but these judgments are often wrong, and can be overridden by corrective Type 2 processes.</p>\n<p>Type 2 processes are computationally expensive, and thus humans are '<a href=\"https://www.lesswrong.com/lw/2ey/a_taxonomy_of_bias_the_cognitive_miser/\">cognitive misers</a>'. This means that we (1) default to Type 1 processes whenever possible, and (2) when we <em>must</em> use Type 2 processes, we use the least expensive kinds of Type 2 processes, those with a 'focal bias' — a disposition to reason from the <em>simplest</em> model available instead of considering all the relevant factors. Hence, we are subject to confirmation bias (our cognition is focused on what we already believe) and other biases.</p>\n<p>So, cognitive miserliness can cause three types of thinking errors:</p>\n<ol>\n<li>We default to Type 1 processes when Type 2 processes are needed.</li>\n<li>We fail to override Type 1 processes with Type 2 processes.</li>\n<li>Even when we override with Type 2 processes, we use Type 2 processes with focal bias.</li>\n</ol>\n<p>But the problem gets worse. If someone is going to override Type 1 processes with Type 2 processes, then she also needs the right <em>content</em> available with which to do the overriding. For example, she may need to override a biased intuitive judgment with a correct application of probability theory, or a correct application of deductive logic. Such tools are called '<a href=\"https://www.lesswrong.com/lw/2fj/a_taxonomy_of_bias_mindware_problems/\">mindware</a>'.<sup class=\"footnote-ref\"><a href=\"#fn-ETotYQmrKgzCNzw6Z-9\" id=\"fnref-ETotYQmrKgzCNzw6Z-9\">[9]</a></sup></p>\n<p>Thus, thinking can also go wrong if there is a 'mindware gap' — that is, if an agent lacks crucial mindware like probability theory.</p>\n<p>Finally, thinking can go wrong due to 'contaminated mindware' — mindware that exists but is <em>wrong</em>. For example, an agent may have the naive belief that they know their own minds quite well, which is <a href=\"https://www.lesswrong.com/lw/5sk/inferring_our_desires/\">false</a>. Such mistaken mindware can lead to mistaken judgments.</p>\n<h2>Types of errors</h2>\n<p>Given this understanding, a taxonomy of thinking errors could begin like this:<sup class=\"footnote-ref\"><a href=\"#fn-ETotYQmrKgzCNzw6Z-10\" id=\"fnref-ETotYQmrKgzCNzw6Z-10\">[10]</a></sup></p>\n<p><img src=\"https://i.ibb.co/b1hvTmT/Pic-1.png\" alt=\"\"></p>\n<p>The circles on the left capture the three normal sources of thinking errors. The three rectangles to the right of 'Cognitive Miserliness' capture the three categories of error that can be caused by cognitive miserliness. The <em>rounded</em> rectangles to the right of 'Mindware Gap' and 'Corrupted Mindware' propose some <em>examples</em> of (1) mindware that, if missing, can cause a mindware gap, and (2) common contaminated mindware.</p>\n<p>The process for solving a reasoning task, then, may look something like this:<sup class=\"footnote-ref\"><a href=\"#fn-ETotYQmrKgzCNzw6Z-11\" id=\"fnref-ETotYQmrKgzCNzw6Z-11\">[11]</a></sup></p>\n<p><img src=\"https://i.ibb.co/ZY3Bhq5/Pic-2.png\" alt=\"\"></p>\n<p>First, do I have mindware available to solve the reasoning problem before me with slow, deliberate, Type 2 processes? If not, my brain must use fast but inaccurate Type 1 processes to solve the problem. If I do have mindware available to solve this problem, do I notice the need to engage it? If not, my brain defaults to the cheaper Type 1 processes. If I <em>do</em> notice the need to engage Type 2 processes and have the necessary mindware, is <em>sustained</em> (as opposed to momentary) 'Type 2 override' required to solve the problem? If not, then I use that mindware to solve the problem. If sustained override <em>is</em> required to solve the reasoning problem and I don't have the cognitive capacity (e.g. working memory) needed to complete the override, then my brain will default back to Type 1 processes. Otherwise, I'll use my cognitive capacities to sustain Type 2 override well enough to complete the reasoning task with my Type 2 processes (mindware).</p>\n<p>That may be something like how our brains determine how to solve a reasoning task.</p>\n<p>It's this model that Stanovich and colleagues (2010) use to explain why, among other things, <a href=\"http://commonsenseatheism.com/wp-content/uploads/2011/09/Tasks-that-do-and-do-not-correlate-with-cognitive-ability.pdf\">IQ is correlated with performance on some reasoning tasks but not others</a>. For example, IQ correlates with performance on tests of outcome bias and hindsight bias, but not with performance on tests of anchoring effects and omission bias. To overcome these latter biases, subjects seem to need not just high cognitive capacity (<a href=\"http://en.wikipedia.org/wiki/Fluid_and_crystallized_intelligence\">fluid intelligence</a>, <a href=\"http://en.wikipedia.org/wiki/Working_memory\">working memory</a>, etc.), but also specific rationality training.</p>\n<p>If this is right, then we may talk of three different 'minds' at work in solving reasoning problems:</p>\n<ul>\n<li>\n<p>The <em>autonomous</em> mind, made of unconscious Type 1 processes. There are few individual differences in its operation.</p>\n</li>\n<li>\n<p>The <em>algorithmic</em> mind, made of conscious Type 2 processes. There are significant individual differences in fluid intelligence in particular and cognitive capacity in general — that is, differences in perceptual speed, discrimination accuracy, working memory capacity, and the efficiency of the retrieval of information stored in long-term memory.<sup class=\"footnote-ref\"><a href=\"#fn-ETotYQmrKgzCNzw6Z-12\" id=\"fnref-ETotYQmrKgzCNzw6Z-12\">[12]</a></sup></p>\n</li>\n<li>\n<p>The <em>reflective mind</em>, which shows individual differences in the disposition to use rationality mindware — the disposition to generate alternative hypotheses, to use fully disjunctive reasoning, to engage in actively open-minded thinking, etc.<sup class=\"footnote-ref\"><a href=\"#fn-ETotYQmrKgzCNzw6Z-13\" id=\"fnref-ETotYQmrKgzCNzw6Z-13\">[13]</a></sup></p>\n</li>\n</ul>\n<h4><strong>Rationality Skills</strong></h4>\n<p>But it is not enough to understand how the human brain produces thinking errors. We also must find ways to meliorate the problem if we want to have more accurate beliefs and more efficiently achieve our goals. As Milkman et al. (2010) say:</p>\n<blockquote>\n<p>...the time has come to move the study of biases in judgment and decision making beyond description and toward the development of improvement strategies.</p>\n</blockquote>\n<p>Stanovich (2009) sums up our project:</p>\n<blockquote>\n<p>To jointly achieve epistemic and instrumental rationality, a person must display judicious decision making, adequate behavioral regulation, wise goal prioritization, sufficient thoughtfulness, and proper evidence calibration. For example, epistemic rationality — beliefs that are properly matched to the world — requires probabilistic reasoning and the ability to calibrate theories to evidence. Instrumental rationality — maximizing goal fulfillment — requires adherence to all of the axioms of rational choice. People fail to fulfill the many different strictures of rational thought because they are cognitive misers, because they lack critical mindware, and because they have acquired contaminated mindware. These errors can be prevented by acquiring the mindware of rational thought and the thinking dispositions that prevent the overuse of the strategies of the cognitive miser.</p>\n</blockquote>\n<p>This is the project of 'debiasing' ourselves<sup class=\"footnote-ref\"><a href=\"#fn-ETotYQmrKgzCNzw6Z-14\" id=\"fnref-ETotYQmrKgzCNzw6Z-14\">[14]</a></sup> with 'ameliorative psychology'.<sup class=\"footnote-ref\"><a href=\"#fn-ETotYQmrKgzCNzw6Z-15\" id=\"fnref-ETotYQmrKgzCNzw6Z-15\">[15]</a></sup></p>\n<p>What we want is a <strong>Rationality Toolkit</strong>: a set of skills and techniques that can be used to overcome and correct the errors of our primate brains so we can form more accurate beliefs and make better decisions.</p>\n<p>Our goal is not unlike Carl Sagan's '<a href=\"http://www.youtube.com/watch?v=eUB4j0n2UDU\">Baloney Detection Kit</a>', but the tools in our Rationality Toolkit will be more specific and better grounded in the cognitive science of rationality.</p>\n<p>I mentioned some examples of debiasing interventions that have been tested by experimental psychologists in my post <a href=\"https://www.lesswrong.com/lw/76x/is_rationality_teachable/\">Is Rationality Teachable?</a> I'll start with those, then add a few techniques for ameliorating the <a href=\"https://www.lesswrong.com/lw/jg/planning_fallacy/\">planning fallacy</a>, and we've got the beginnings of our Rationality Toolkit:</p>\n<ol>\n<li>A simple instruction to \"think about alternatives\" can promote resistance to overconfidence and confirmation bias. In one study, subjects asked to generate their own hypotheses are more responsive to their accuracy than subjects asked to choose from among pre-picked hypotheses.<sup class=\"footnote-ref\"><a href=\"#fn-ETotYQmrKgzCNzw6Z-16\" id=\"fnref-ETotYQmrKgzCNzw6Z-16\">[16]</a></sup> Another study required subjects to list reasons for and against each of the possible answers to each question on a quiz prior to choosing an answer and assessing the probability of its being correct. This process resulted in more accurate confidence judgments relative to a control group.<sup class=\"footnote-ref\"><a href=\"#fn-ETotYQmrKgzCNzw6Z-17\" id=\"fnref-ETotYQmrKgzCNzw6Z-17\">[17]</a></sup></li>\n<li>Training in microeconomics can help subjects avoid the sunk cost fallacy.<sup class=\"footnote-ref\"><a href=\"#fn-ETotYQmrKgzCNzw6Z-18\" id=\"fnref-ETotYQmrKgzCNzw6Z-18\">[18]</a></sup></li>\n<li>Because people avoid the base rate fallacy more often when they encounter problems phrased in terms of frequencies instead of probabilities,<sup class=\"footnote-ref\"><a href=\"#fn-ETotYQmrKgzCNzw6Z-19\" id=\"fnref-ETotYQmrKgzCNzw6Z-19\">[19]</a></sup> teaching people to translate probabilistic reasoning tasks into frequency formats improves their performance.<sup class=\"footnote-ref\"><a href=\"#fn-ETotYQmrKgzCNzw6Z-20\" id=\"fnref-ETotYQmrKgzCNzw6Z-20\">[20]</a></sup></li>\n<li>Warning people about biases can decrease their prevalence. So far, this has been demonstrated to work with regard to framing effects,<sup class=\"footnote-ref\"><a href=\"#fn-ETotYQmrKgzCNzw6Z-21\" id=\"fnref-ETotYQmrKgzCNzw6Z-21\">[21]</a></sup> hindsight bias,<sup class=\"footnote-ref\"><a href=\"#fn-ETotYQmrKgzCNzw6Z-22\" id=\"fnref-ETotYQmrKgzCNzw6Z-22\">[22]</a></sup> and the outcome effect,<sup class=\"footnote-ref\"><a href=\"#fn-ETotYQmrKgzCNzw6Z-23\" id=\"fnref-ETotYQmrKgzCNzw6Z-23\">[23]</a></sup> though attempts to mitigate anchoring effects by warning people about them have produced weak results so far.<sup class=\"footnote-ref\"><a href=\"#fn-ETotYQmrKgzCNzw6Z-24\" id=\"fnref-ETotYQmrKgzCNzw6Z-24\">[24]</a></sup></li>\n<li>Research on the planning fallacy suggests that taking an 'outside view' when predicting the time and resources required to complete a task will lead to better predictions. A specific instance of this strategy is 'reference class forecasting',<sup class=\"footnote-ref\"><a href=\"#fn-ETotYQmrKgzCNzw6Z-25\" id=\"fnref-ETotYQmrKgzCNzw6Z-25\">[25]</a></sup> in which planners project time and resource costs for a project by basing their projections on the outcomes of a distribution of comparable projects.</li>\n<li>Unpacking the components involved in a large task or project helps people to see more clearly how much time and how many resources will be required to complete it, thereby partially meliorating the planning fallacy.<sup class=\"footnote-ref\"><a href=\"#fn-ETotYQmrKgzCNzw6Z-26\" id=\"fnref-ETotYQmrKgzCNzw6Z-26\">[26]</a></sup></li>\n<li>One reason we fall prey to the planning fallacy is that we do not remain as focused on the task at hand throughout its execution as when we are planning its execution. The planning fallacy can be partially meliorated, then, not only by improving the planning but by improving the execution. For example, in one study<sup class=\"footnote-ref\"><a href=\"#fn-ETotYQmrKgzCNzw6Z-27\" id=\"fnref-ETotYQmrKgzCNzw6Z-27\">[27]</a></sup> students were taught to imagine themselves performing each of the steps needed to complete a project. Participants rehearsed these simulations each day. 41% of these students completed their tasks on time, compared to 14% in a control group.</li>\n</ol>\n<p>But this is <a href=\"https://www.lesswrong.com/lw/5x8/teachable_rationality_skills/\">only the start</a>. We need more rationality skills, and we need step-by-step instructions for how to teach them and how to implement them at the <a href=\"https://www.lesswrong.com/lw/5kz/the_5second_level/\">5-second level</a>.</p>\n<h2>References</h2>\n<p>Ackerman, Kyllonen &amp; Richards, eds. (1999). <em><a href=\"http://www.amazon.com/Learning-Individual-Differences-Process-Determinants/dp/1557985367/ref=as_li_ss_tl?ie=UTF8&amp;camp=1789&amp;creative=390957&amp;creativeASIN=0321928423&amp;linkCode=as2&amp;tag=lesswrong-20\">Learning and individual differences: Process, trait, and content determinants</a></em>. American Psychological Association.</p>\n<p>Arkes &amp; Blumer (1985). <a href=\"https://www.sciencedirect.com/science/article/abs/pii/0749597885900494\">The psychology of sunk cost</a>. <em>Organizational Behavior and Human Decision Processes, 35</em>: 124-140.</p>\n<p>Arkes &amp; Ayton (1999). <a href=\"https://psycnet.apa.org/doiLanding?doi=10.1037%2F0033-2909.125.5.591\">The sunk cost and Concorde effects: Are humans less rational than lower animals?</a> <em>Psychological Bulletin, 125</em>: 591-600.</p>\n<p>Arkes &amp; Hutzel (2000). <a href=\"https://onlinelibrary.wiley.com/doi/abs/10.1002/1099-0771%28200007/09%2913%3A3%3C295%3A%3AAID-BDM353%3E3.0.CO%3B2-6\">The role of probability of success estimates in the sunk cost effect</a>. <em>Journal of Behavioral Decision Making, 13</em>: 295-306.</p>\n<p>Baron (2007). <em><a href=\"http://www.amazon.com/Thinking-Deciding-Jonathan-Baron/dp/0521680433/ref=as_li_ss_tl?ie=UTF8&amp;camp=1789&amp;creative=390957&amp;creativeASIN=0321928423&amp;linkCode=as2&amp;tag=lesswrong-20\">Thinking and Deciding, 4th edition</a></em>. Cambridge University Press.</p>\n<p>Bishop &amp; Trout (2004). <em><a href=\"http://www.amazon.com/dp/0195162307/ref=as_li_ss_tl?ie=UTF8&amp;camp=1789&amp;creative=390957&amp;creativeASIN=0321928423&amp;linkCode=as2&amp;tag=lesswrong-20\">Epistemology and the Psychology of Human Judgment</a></em>. Oxford University Press.</p>\n<p>Block &amp; Harper (1991). Overconfidence in estimation: testing the anchoring-and-adjustment hypothesis. <em>Organizational Behavior and Human Decision Processes, 49</em>: 188–207.</p>\n<p>Buehler, Griffin, &amp; Ross (1994). <a href=\"https://psycnet.apa.org/record/1995-04284-001\">Exploring the 'planning fallacy': Why people underestimate their task completion times</a>. <em>Journal of Personality and Social Psychology, 67</em>: 366-381.</p>\n<p>Buehler, Griffin, &amp; Ross (1995). <a href=\"https://www.tandfonline.com/doi/abs/10.1080/14792779343000112\">It's about time: Optimistic predictions in work and love</a>. <em>European Review of Social Psychology, 6</em>: 1-32.</p>\n<p>Buehler, Griffin, &amp; Ross (2002). Inside the planning fallacy: The causes and consequences of optimistic time predictions. In Gilovich, Griffin, &amp; Kahneman (eds.), <em>Heuristics and biases: The psychology of intuitive judgment</em> (pp. 250-270). Cambridge University Press.</p>\n<p>Buehler, Griffin, &amp; Peetz (2010). <a href=\"https://www.sciencedirect.com/science/article/pii/S0065260110430014\">The planning fallacy: cognitive, motivational, and social origins</a>. <em>Advances in Experimental Social Psychology, 43</em>: 1-62.</p>\n<p>Carson &amp; Mitchell (1995). <a href=\"http://econ.ucsd.edu/~rcarson/papers/Sequencing.pdf\">Sequencing and Nesting in Contingent Valuation Surveys</a>. <em>Journal of Environmental Economics and Management, 28</em>: 155-73.</p>\n<p>Cheng &amp; Wu (2010). Debiasing the framing effect: The effect of warning and involvement. <em>Decision Support Systems, 49</em>: 328-334.</p>\n<p>Clarkson, Emby, &amp; Watt (2002). Debiasing the effect of outcome knowledge: the role of instructions in an audit litigation setting. <em>Auditing: A Journal of Practice and Theory, 21</em>: 1–14.</p>\n<p>Connolly &amp; Dean (1997). <a href=\"https://www.jstor.org/stable/2634342\">Decomposed versus holistic estimates of effort required for software writing tasks</a>. <em>Management Science, 43</em>: 1029–1045.</p>\n<p>Dawes (1998). Behavioral decision making and judgment. In Gilbert, Fiske, &amp; Lindzey (eds.), The handbook of social psychology (Vol. 1, pp. 497–548). McGraw-Hill.</p>\n<p>Deary (2000). <em><a href=\"http://www.amazon.com/Looking-Down-Human-Intelligence-Psychometrics/dp/019852417X/ref=as_li_ss_tl?ie=UTF8&amp;camp=1789&amp;creative=390957&amp;creativeASIN=0321928423&amp;linkCode=as2&amp;tag=lesswrong-20\">Looking down on human intelligence: From psychometrics to the brain</a></em>. Oxford University Press.</p>\n<p>Deary (2001). <em><a href=\"http://www.amazon.com/Intelligence-Very-Short-Introduction-Introductions/dp/0192893211/ref=as_li_ss_tl?ie=UTF8&amp;camp=1789&amp;creative=390957&amp;creativeASIN=0321928423&amp;linkCode=as2&amp;tag=lesswrong-20\">Intelligence: A very short introduction</a></em>. Oxford University Press.</p>\n<p>Desvousges, Johnson, Dunford, Boyle, Hudson, &amp; Wilson (1992). Measuring non-use damages using contingent valuation: experimental evaluation accuracy. Research Triangle Institute Monograph 92-1.</p>\n<p>Elqayam &amp; Evans (2011). <a href=\"http://www.psy.dmu.ac.uk/elqayam/Elqayam_BBS-D-10-00343_preprint.pdf\">Subtracting 'ought' from 'is': Descriptivism versus normativism in the study of human thinking</a>. <em>Brain and Behavioral Sciences</em>.</p>\n<p>Evans (1989). <em><a href=\"http://www.amazon.com/Bias-Human-Reasoning-Consequences-psychology/dp/0863771068/ref=as_li_ss_tl?ie=UTF8&amp;camp=1789&amp;creative=390957&amp;creativeASIN=0321928423&amp;linkCode=as2&amp;tag=lesswrong-20\">Bias in Human Reasoning: Causes and Consequences</a></em>. Lawrence Erlbaum Associates.</p>\n<p>Evans (2007). <em><a href=\"http://www.amazon.com/Hypothetical-Thinking-Processes-Reasoning-Psychology/dp/1841696609/ref=as_li_ss_tl?ie=UTF8&amp;camp=1789&amp;creative=390957&amp;creativeASIN=0321928423&amp;linkCode=as2&amp;tag=lesswrong-20\">Hypothetical Thinking: Dual Processes in Reasoning and Judgment</a></em>. Psychology Press.</p>\n<p>Fetherstonhaugh, Slovic, Johnson, &amp; Friedrich (1997). <a href=\"https://link.springer.com/article/10.1023/A:1007744326393\">Insensitivity to the value of human life: A study of psychophysical numbing</a>. <em>Journal of Risk and Uncertainty, 14</em>: 238-300.</p>\n<p>Flyvbjerg (2008). <a href=\"https://www.researchgate.net/publication/233258056_Curbing_Optimism_Bias_and_Strategic_Misrepresentation_in_Planning_Reference_Class_Forecasting_in_Practice\">Curbing optimism bias and strategic misrepresentation in planning: Reference class forecasting in practice</a>. <em>European Planning Studies, 16</em>: 3–21.</p>\n<p>Flyvbjerg, Garbuio, &amp; Lovallo (2009). Delusion and deception in large infrastructure projects: Two models for explaining and preventing executive disaster. <em>California Management Review, 51</em>: 170–193.</p>\n<p>Foley (1987). <em><a href=\"http://www.amazon.com/Theory-Epistemic-Rationality-Richard-Foley/dp/0674882768/ref=as_li_ss_tl?ie=UTF8&amp;camp=1789&amp;creative=390957&amp;creativeASIN=0321928423&amp;linkCode=as2&amp;tag=lesswrong-20\">The Theory of Epistemic Rationality</a></em>. Harvard University Press.</p>\n<p>Forsyth &amp; Burt (2008). <a href=\"https://link.springer.com/article/10.3758/MC.36.4.791\">Allocating time to future tasks: The effect of task segmentation on planning fallacy bias</a>. <em>Memory and Cognition, 36</em>: 791–798.</p>\n<p>George, Duffy, &amp; Ahuja (2000). Countering the anchoring and adjustment bias with decision support systems. <em>Decision Support Systems, 29</em>: 195–206.</p>\n<p>Gigerenzer &amp; Hoffrage (1995). How to improve Bayesian reasoning without instruction: Frequency formats. <em>Psychological Review, 102</em>: 684–704.</p>\n<p>Gilovich, Grifﬁn, &amp; Kahneman (eds.) (2002). <em><a href=\"http://www.amazon.com/Heuristics-Biases-Psychology-Intuitive-Judgment/dp/0521796792/ref=as_li_ss_tl?ie=UTF8&amp;camp=1789&amp;creative=390957&amp;creativeASIN=0321928423&amp;linkCode=as2&amp;tag=lesswrong-20\">Heuristics and Biases: The Psychology of Intuitive Judgment</a></em>. Cambridge University Press.</p>\n<p>Harman (1995). Rationality. In Smith &amp; Osherson (eds.), <em>Thinking</em> (Vol. 3, pp. 175–211). MIT Press.</p>\n<p>Hasher, Attig, &amp; Alba (1981). I knew it all along: or did I? <em>Journal of Verbal and Learning Behavior, 20</em>: 86-96.</p>\n<p>Hastie &amp; Dawes (2009). <em><a href=\"http://www.amazon.com/Rational-Choice-Uncertain-World-Psychology/dp/1412959039/ref=as_li_ss_tl?ie=UTF8&amp;camp=1789&amp;creative=390957&amp;creativeASIN=0321928423&amp;linkCode=as2&amp;tag=lesswrong-20\">Rational Choice in an Uncertain World, 2nd edition</a></em>. Sage.</p>\n<p>Hull (2000). <em><a href=\"http://www.amazon.com/Science-Selection-Biological-Evolution-Philosophy/dp/0521644054/ref=as_li_ss_tl?ie=UTF8&amp;camp=1789&amp;creative=390957&amp;creativeASIN=0321928423&amp;linkCode=as2&amp;tag=lesswrong-20\">Science and selection: Essays on biological evolution and the philosophy of science</a></em>. Cambridge University Press.</p>\n<p>Hunt (1987). The next word on verbal ability. In Vernon (ed.), <em>Speed of information-processing and intelligence</em> (pp. 347–392). Ablex.</p>\n<p>Hunt (1999). Intelligence and human resources: Past, present, and future. In Ackerman &amp; Kyllonen (Eds.), <em>The future of learning and individual differences research: Processes, traits, and content</em> (pp. 3-30) American Psychological Association.</p>\n<p>Jenni &amp; Loewenstein (1997). <a href=\"http://www.andrew.cmu.edu/user/gl20/GeorgeLoewenstein/Papers_files/pdf/identifiable-victim.pdf\">Explaining the 'identifiable victim effect.'</a> <em>Journal of Risk and Uncertainty, 14</em>: 235–257.</p>\n<p>Kahneman (1986). Comments on the contingent valuation method. In Cummings, Brookshie, &amp; Schulze (eds.), <em>Valuing environmental goods: a state of the arts assessment of the contingent valuation method</em>. Roweman and Allanheld.</p>\n<p>Kahneman &amp; Tversky (2000). <em><a href=\"http://www.amazon.com/Choices-Values-Frames-Daniel-Kahneman/dp/0521627494/ref=as_li_ss_tl?ie=UTF8&amp;camp=1789&amp;creative=390957&amp;creativeASIN=0321928423&amp;linkCode=as2&amp;tag=lesswrong-20\">Choices, Values, and Frames</a></em>. Cambridge University Press.</p>\n<p>Kahneman (2011). <em><a href=\"http://www.amazon.com/Thinking-Fast-Slow-Daniel-Kahneman/dp/0374275637/ref=as_li_ss_tl?ie=UTF8&amp;camp=1789&amp;creative=390957&amp;creativeASIN=0321928423&amp;linkCode=as2&amp;tag=lesswrong-20\">Thinking, Fast and Slow</a></em>. Farrar, Straus and Giroux.</p>\n<p>Kane &amp; Engle (2002). <a href=\"https://link.springer.com/article/10.3758/BF03196323\">The role of prefrontal cortex working-memory capacity, executive attention, and general fluid intelligence: An individual differences perspective</a>. <em>Psychonomic Bulletin and Review, 9</em>: 637–671.</p>\n<p>Knox &amp; Inkster (1968). <a href=\"https://psycnet.apa.org/record/1968-08407-001\">Postdecision dissonance at post time</a>. <em>Journal of Personality and Social Psychology, 8</em>: 319-323.</p>\n<p>Koehler (1994). Hypothesis generation and confidence in judgment. <em>Journal of Experimental Psychology: Learning, Memory, and Cognition, 20</em>: 461-469.</p>\n<p>Kogut &amp; Ritov (2005a). <a href=\"http://pluto.mscc.huji.ac.il/~msiritov/KogutRitovIdentified.pdf\">The 'identified victim effect': An identified group, or just a single individual?</a> <em>Journal of Behavioral Decision Making, 18</em>: 157–167.</p>\n<p>Kogut &amp; Ritov (2005b). <a href=\"https://www.sciencedirect.com/science/article/pii/S0749597805000336\">The singularity effect of identified victims in separate and joint evaluations</a>. <em>Organizational Behavior and Human Decision Processes, 97</em>: 106–116.</p>\n<p>Kogut &amp; Ritov (2010). The identifiable victim effect: Causes and boundary conditions. In Oppenheimer &amp; Olivola (eds.), <em>The Science of Giving: Experimental Approaches to the Study of Charity</em> (pp. 133-146). Psychology Press.</p>\n<p>Koriat, Lichtenstein, &amp; Fischhoff (1980). <a href=\"https://www.semanticscholar.org/paper/Reasons-for-confidence.-Koriat-Lichtenstein/ecf140454ea3032837403b627ab606f85300944d\">Reasons for confidence</a>. <em>Journal of Experimental Psychology: Human Learning and Memory, 6</em>: 107-118.</p>\n<p>Koole &amp; Vant Spijker (2000). <a href=\"https://www.semanticscholar.org/paper/Overcoming-the-planning-fallacy-through-willpower-%3A-Koole-Spijker/49ef9ce127b5ae45b01150f519c2126411644ed0\">Overcoming the planning fallacy through willpower: Effects of implementation intentions on actual and predicted task-completion times</a>. <em>European Journal of Social Psychology, 30</em>: 873–888.</p>\n<p>Krueger (2000). <a href=\"https://www.cambridge.org/core/journals/behavioral-and-brain-sciences/article/individual-differences-and-pearsons-r-rationality-revealed/6269B7BBAB4BB9DEE944766823A43FA7\">Individual differences and Pearson's r: Rationality revealed?</a> <em>Behavioral and Brain Sciences, 23</em>: 684–685.</p>\n<p>Kruger &amp; Evans (2004). If you don’t want to be late, enumerate: Unpacking reduces the planning fallacy. <em>Journal of Experimental Social Psychology, 40</em>: 586–598.</p>\n<p>Larrick (2004). <a href=\"https://psycnet.apa.org/record/2004-19929-016\">Debiasing</a>. In Koehler &amp; Harvey (eds.), <em>Blackwell Handbook of Judgment and Decision Making</em> (pp. 316-337). Wiley-Blackwell.</p>\n<p>Larrick, Morgan, &amp; Nisbett (1990). Teaching the use of cost-benefit reasoning in everyday life. <em>Psychological Science, 1</em>: 362-370.</p>\n<p>Lohman (2000). Complex information processing and intelligence. In Sternberg (ed.), <em>Handbook of intelligence</em> (pp. 285–340). Cambridge University Press.</p>\n<p>Lovallo &amp; Kahneman (2003). <a href=\"https://hbr.org/2003/07/delusions-of-success-how-optimism-undermines-executives-decisions\">Delusions of success: How optimism undermines executives' decisions</a>. <em>Harvard Business Review, July 2003</em>: 56-63.</p>\n<p>Manktelow (2004). Reasoning and rationality: The pure and the practical. In Manktelow &amp; Chung (eds.), <em>Psychology of reasoning: Theoretical and historical perspectives</em> (pp. 157–177). Psychology Press.</p>\n<p>McFadden &amp; Leonard (1995). Issues in the contingent valuation of environmental goods: methodologies for data collection and analysis. In Hausman (ed.), <em>Contingent valuation: a critical assessment</em>. North Holland.</p>\n<p>Milkman, Chugh, &amp; Bazerman (2010). <a href=\"http://www.hbs.edu/research/pdf/08-102.pdf\">How can decision making be improved?</a> <em>Perspectives on Psychological Science 4</em>: 379-383.</p>\n<p>Mussweiler, Strack, &amp; Pfeiffer (2000). Overcoming the inevitable anchoring effect: Considering the opposite compensates for selective accessibility. <em>Personality and Social Psychology Bulletin, 26</em>: 1142–50.</p>\n<p>Oreg &amp; Bayazit. <a href=\"https://journals.sagepub.com/doi/abs/10.1037/a0015656\">Prone to Bias: Development of a Bias Taxonomy From an Individual Differences Perspective</a>. <em>Review of General Psychology, 3</em>: 175-193.</p>\n<p>Over (2004). <a href=\"https://psycnet.apa.org/record/2004-19929-001\">Rationality and the normative/descriptive distinction</a>. In Koehler &amp; Harvey (eds.), <em>Blackwell handbook of judgment and decision making</em> (pp. 3–18). Blackwell Publishing.</p>\n<p>Peetz, Buehler &amp; Wilson (2010). <a href=\"https://www.semanticscholar.org/paper/Planning-for-the-near-and-distant-future%3A-How-does-Peetz-Buehler/f67493a4412c39f6413980ffcb93868202e7890f\">Planning for the near and distant future: How does temporal distance affect task completion predictions?</a> <em>Journal of Experimental Social Psychology, 46</em>: 709-720.</p>\n<p>Perkins (1995). <em><a href=\"http://www.amazon.com/Outsmarting-IQ-Emerging-Learnable-Intelligence/dp/0029252121/ref=as_li_ss_tl?ie=UTF8&amp;camp=1789&amp;creative=390957&amp;creativeASIN=0321928423&amp;linkCode=as2&amp;tag=lesswrong-20\">Outsmarting IQ: The emerging science of learnable intelligence</a></em>. Free Press.</p>\n<p>Pezzo, Litman, &amp; Pezzo (2006). <a href=\"https://www.semanticscholar.org/paper/On-the-distinction-between-yuppies-and-hippies%3A-in-Pezzo-Litman/d95f80a4189980b1ff2b3bea7c01707b4fc3f2bc\">On the distinction between yuppies and hippes: Individual differences in prediction biases for planning future tasks</a>. <em>Personality and Individual Differences, 41</em>: 1359-1371.</p>\n<p>Reimers &amp; Butler (1992). The effect of outcome knowledge on auditor's judgmental evaluations. <em>Accounting, Organizations and Society, 17</em>: 185–194.</p>\n<p>Richerson &amp; Boyd (2005). <em><a href=\"http://www.amazon.com/Not-Genes-Alone-Transformed-Evolution/dp/0226712125/ref=as_li_ss_tl?ie=UTF8&amp;camp=1789&amp;creative=390957&amp;creativeASIN=0321928423&amp;linkCode=as2&amp;tag=lesswrong-20\">Not By Genes Alone: How Culture Transformed Human Evolution</a></em>. University of Chicago Press.</p>\n<p>Ross, Greene, &amp; House (1977). <a href=\"http://www.acsu.buffalo.edu/~jsawusch/PSY250/1-ResearchDemo.pdf\">The false consensus phenomenon: An attributional bias in self-perception and social perception processes</a>. <em>Journal of Experimental Social Psychology, 13</em>: 279–301.</p>\n<p>Roy, Christenfeld, &amp; McKenzie (2005). <a href=\"http://users.etown.edu/r/roym/my%20papers/royetal.,2005.pdf\">Underestimating the duration of future events: Memory incorrectly used or memory bias? </a><em>Psychological Bulletin, 131</em>: 738-756.</p>\n<p>Sedlmeier (1999). <em><a href=\"http://www.amazon.com/Improving-Statistical-Reasoning-Theoretical-Implications/dp/0805832823/ref=as_li_ss_tl?ie=UTF8&amp;camp=1789&amp;creative=390957&amp;creativeASIN=0321928423&amp;linkCode=as2&amp;tag=lesswrong-20\">Improving Statistical Reasoning: Theoretical Models and Practical Implications</a></em>. Erlbaum.</p>\n<p>Shaﬁr &amp; LeBoeuf (2002). <a href=\"https://www.annualreviews.org/doi/abs/10.1146/annurev.psych.53.100901.135213\">Rationality</a>. <em>Annual Review of Psychology, 53</em>: 491–517.</p>\n<p>Slovic (2007). <a href=\"http://www.sas.upenn.edu/~baron/journal/7303a/jdm7303a.htm\">If I look at the mass I will never act: Psychic numbing and genocide</a>. <em>Judgment and Decision Making, 2</em>: 1–17.</p>\n<p>Slovic, Zionts, Woods, Goodman, &amp; Jinks (2011). <a href=\"https://papers.ssrn.com/sol3/papers.cfm?abstract_id=1809951\">Psychic numbing and mass atrocity</a>. In E. Shafir (ed.), <em>The behavioral foundations of policy</em>. Sage and Princeton University Press.</p>\n<p>Small &amp; Loewenstein (2003). <a href=\"https://www.jstor.org/stable/41761095\">Helping a victim or helping the victim: Altruism and identifiability</a>. <em>Journal of Risk and Uncertainty, 26</em>: 5–16.</p>\n<p>Small, Loewenstein, &amp; Slovic (2007). <a href=\"https://www.semanticscholar.org/paper/Sympathy-and-callousness%3A-The-impact-of-thought-on-Small-Loewenstein/48c2c6ba719f55ca0016d224ff42f7e107287839\">Sympathy and callousness: The impact of deliberative thought on donations to identifiable and statistical victims</a>. <em>Organizational Behavior and Human Decision Processes, 102</em>: 143–153.</p>\n<p>Soll &amp; Klayman (2004). Overconfidence in interval estimates. <em>Journal of Experimental Psychology: Learning, Memory, and Cognition, 30</em>: 299–314.</p>\n<p>Stanovich (1999). <em><a href=\"http://www.amazon.com/Who-Rational-individual-Differences-Reasoning/dp/0805824731/ref=as_li_ss_tl?ie=UTF8&amp;camp=1789&amp;creative=390957&amp;creativeASIN=0321928423&amp;linkCode=as2&amp;tag=lesswrong-20\">Who is rational? Studies of individual differences in reasoning</a></em>. Erlbaum.</p>\n<p>Stanovich (2009). <em><a href=\"http://www.amazon.com/What-Intelligence-Tests-Miss-Psychology/dp/0300164629/ref=as_li_ss_tl?ie=UTF8&amp;camp=1789&amp;creative=390957&amp;creativeASIN=0321928423&amp;linkCode=as2&amp;tag=lesswrong-20\">What Intelligence Tests Miss: The Psychology of Rational Thought</a></em>. Yale University Press.</p>\n<p>Stanovich &amp; West (2008). <a href=\"https://www.tandfonline.com/doi/abs/10.1080/13546780701679764\">On the failure of cognitive ability to predict myside bias and one-sided thinking biases</a>. <em>Thinking and Reasoning, 14</em>: 129–167.</p>\n<p>Stanovich, Toplak, &amp; West (2008). <a href=\"https://www.semanticscholar.org/paper/The-development-of-rational-thought%3A-a-taxonomy-of-Stanovich-Toplak/bc533eebfffdc6771c27c0289cafc2c02c5c637f\">The development of rational thought: A taxonomy of heuristics and biases</a>. <em>Advances in Child Development and Behavior, 36</em>: 251-285.</p>\n<p>Stanovich, West, &amp; Toplak (2010). <a href=\"https://www.researchgate.net/publication/259982116_Individual_differences_as_essential_components_of_heuristics_and_biases_research\">Individual differences as essential components of heuristics and biases research</a>. In Manktelow, Over, &amp; Elqayam (eds.), <em>The Science of Reason: A Festschrift for Jonathan St B.T. Evans</em> (pp. 355-396). Psychology Press.</p>\n<p>Stanovich, West, &amp; Toplak (2011). <a href=\"https://psycnet.apa.org/record/2011-12794-039\">Intelligence and rationality</a>. In Sternberg &amp; Kaufman (eds.), <em>Cambridge Handbook of Intelligence, 3rd edition</em> (pp. 784-826). Cambridge University Press.</p>\n<p>Staw (1976). <a href=\"https://www.semanticscholar.org/paper/Knee-Deep-in-the-Big-Muddy-%3A-A-Study-of-Escalating-Staw/e3195f80c4a910897dcaa2b0547b2e66c2d448f8\">Knee-deep in the big muddy: a study of escalating commitment to a chosen course of action</a>. <em>Organizational Behavior and Human Performance, 16</em>: 27-44.</p>\n<p>Sternberg (1985). <em><a href=\"http://www.amazon.com/Beyond-IQ-Triarchic-Theory-Intelligence/dp/0521278910/ref=as_li_ss_tl?ie=UTF8&amp;camp=1789&amp;creative=390957&amp;creativeASIN=0321928423&amp;linkCode=as2&amp;tag=lesswrong-20\">Beyond IQ: A triarchic theory of human intelligence</a></em>. Cambridge University Press.</p>\n<p>Sternberg (1997). <em><a href=\"http://www.amazon.com/Thinking-Styles-Robert-Sternberg-PhD/dp/052165713X/ref=as_li_ss_tl?ie=UTF8&amp;camp=1789&amp;creative=390957&amp;creativeASIN=0321928423&amp;linkCode=as2&amp;tag=lesswrong-20\">Thinking Styles</a></em>. Cambridge University Press.</p>\n<p>Sternberg (2003). <em><a href=\"http://www.amazon.com/Wisdom-Intelligence-Creativity-Synthesized-Sternberg/dp/0521002710/ref=as_li_ss_tl?ie=UTF8&amp;camp=1789&amp;creative=390957&amp;creativeASIN=0321928423&amp;linkCode=as2&amp;tag=lesswrong-20\">Wisdom, intelligence, and creativity synthesized</a></em>. Cambridge University Press.</p>\n<p>Taylor, Pham, Rivkin &amp; Armor (1998). <a href=\"https://www.semanticscholar.org/paper/Harnessing-the-imagination.-Mental-simulation%2C-and-Taylor-Pham/34daf8a101f6131cfd3f52bc6f204dcc8b689115\">Harnessing the imagination: Mental simulation, self-regulation, and coping</a>. <em>American Psychologist, 53</em>: 429–439.</p>\n<p>Teger (1980). <em><a href=\"http://www.amazon.com/Much-Invested-Quit-General-Psychology/dp/0080229956/ref=as_li_ss_tl?ie=UTF8&amp;camp=1789&amp;creative=390957&amp;creativeASIN=0321928423&amp;linkCode=as2&amp;tag=lesswrong-20\">Too Much Invested to Quit</a></em>. Pergamon Press.</p>\n<p>Tversky &amp; Kahneman (1979). <a href=\"http://www.dtic.mil/cgi-bin/GetTRDoc?AD=ADA047747&amp;Location=U2&amp;doc=GetTRDoc.pdf\">Intuitive prediction: Biases and corrective procedures</a>. <em>TIMS Studies in Management Science, 12</em>: 313-327.</p>\n<p>Tversky &amp; Kahneman (1981). <a href=\"http://www.brainvitge.org/papers/tverski_kahneman.pdf\">The framing of decisions and the psychology of choice</a>. <em>Science, 211</em>: 453–458.</p>\n<p>Unsworth &amp; Engle (2005). Working memory capacity and fluid abilities: Examining the correlation between Operation Span and Raven. <em>Intelligence, 33</em>: 67–81.</p>\n<p>Whyte (1986). <a href=\"https://www.semanticscholar.org/paper/Escalating-Commitment-to-a-Course-of-Action%3A-A-Whyte/4ffda3db4220ab5f3e159d5d584cb01e3e4d53f2\">Escalating Commitment to a Course of Action: A Reinterpretation</a>. <em>The Academy of Management Review, 11</em>: 311-321.</p>\n<p>Wu, Zhang, &amp; Gonzalez (2004). <a href=\"https://www.semanticscholar.org/paper/Decision-Under-Risk-Wu-Zhang/ef1a0f549d930dff8514f6d2003958f6e4e192a1\">Decision under risk</a>. In Koehler &amp; Harvey (eds.), <em>Blackwell handbook of judgment and decision making</em> (pp. 399–423). Blackwell Publishing.</p>\n<hr class=\"footnotes-sep\">\n<section class=\"footnotes\">\n<ol class=\"footnotes-list\">\n<li id=\"fn-ETotYQmrKgzCNzw6Z-1\" class=\"footnote-item\"><p>Teger (1980). <a href=\"#fnref-ETotYQmrKgzCNzw6Z-1\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"fn-ETotYQmrKgzCNzw6Z-2\" class=\"footnote-item\"><p>A sunk cost is a cost from the past that cannot be recovered. Because decision makers should consider only the future costs and benefits of the choices before them, sunk costs should be irrelevant to human decisions. Alas, sunk costs regularly do effect human decisions: Knox &amp; Inkster (1968); Arkes &amp; Blumer (1985); Arkes &amp; Ayton (1999); Arkes &amp; Hutzel (2000); Staw (1976); Whyte (1986). <a href=\"#fnref-ETotYQmrKgzCNzw6Z-2\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"fn-ETotYQmrKgzCNzw6Z-3\" class=\"footnote-item\"><p>People are more generous (say, in giving charity) toward a single identifiable victim than toward unidentifiable or statistical victims (Kogut &amp; Ritov 2005a, 2010; Jenni &amp; Loewenstein 1997; Small &amp; Loewenstein 2003; Small et al. 2007; Slovic 2007), even though they say they prefer to give to a group of people (Kogut &amp; Ritov 2005b). <a href=\"#fnref-ETotYQmrKgzCNzw6Z-3\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"fn-ETotYQmrKgzCNzw6Z-4\" class=\"footnote-item\"><p>Yudkowsky summarizes <a href=\"https://www.lesswrong.com/lw/hw/scope_insensitivity/\">scope insensitivity</a>:</p>\n<blockquote>\n<p>Once upon a time, three groups of subjects were asked how much they would pay to save 2000 / 20000 / 200000 migrating birds from drowning in uncovered oil ponds. The groups respectively answered $80, $78, and $88 [Desvousges et al. 1992]. This is scope insensitivity or scope neglect: the number of birds saved — the scope of the altruistic action — had little effect on willingness to pay.</p>\n</blockquote>\n<p>See also: Kahneman (1986); McFadden &amp; Leonard (1995); Carson &amp; Mitchell (1995); Fetherstonhaugh et al. (1997); Slovic et al. (2011). <a href=\"#fnref-ETotYQmrKgzCNzw6Z-4\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"fn-ETotYQmrKgzCNzw6Z-5\" class=\"footnote-item\"><p>Stanovich &amp; West (2008); Ross et al. (1977); Krueger (2000). <a href=\"#fnref-ETotYQmrKgzCNzw6Z-5\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"fn-ETotYQmrKgzCNzw6Z-6\" class=\"footnote-item\"><p>Stanovich et al. (2008) writes:</p>\n<blockquote>\n<p>Cognitive scientists recognize two types of rationality: instrumental and epistemic... [We] could characterize instrumental rationality as the optimization of the individual’s goal fulfillment. Economists and cognitive scientists have reﬁned the notion of optimization of goal fulfillment into the technical notion of expected utility. The model of rational judgment used by decision scientists is one in which a person chooses options based on which option has the largest expected utility...\nThe other aspect of rationality studied by cognitive scientists is termed epistemic rationality. This aspect of rationality concerns how well beliefs map onto the actual structure of the world. Instrumental and epistemic rationality are related. The aspect of beliefs that enter into instrumental calculations (i.e., tacit calculations) are the probabilities of states of affairs in the world.\nAlso see the discussion in Stanovich et al. (2011). On instrumental rationality as the maximization of expected utility, see Dawes (1998); Hastie &amp; Dawes (2009); Wu et al. (2004). On epistemic reality, see Foley (1987); Harman (1995); Manktelow (2004); Over (2004).\nHow can we measure an individual's divergence from expected utility maximization if we can't yet measure utility directly? One of the triumphs of decision science is the demonstration that agents whose behavior respects the so-called 'axioms of choice' will behave as if they are maximizing expected utility. It can be difficult to measure utility, but it is easier to measure whether one of the axioms of choice are being violated, and thus whether an agent is behaving instrumentally irrationally.\nViolations of both instrumental and epistemic rationality have been catalogued at length by cognitive psychologists in the 'heuristics and biases' literature: Baron (2007); Evans (1989, 2007); Gilovich et al. (2002); Kahneman &amp; Tversky (2000); Shaﬁr &amp; LeBoeuf (2002); Stanovich (1999). For the argument against comparing human reasoning practice with normative reasoning models, see Elqayam &amp; Evans (2011).</p>\n</blockquote>\n <a href=\"#fnref-ETotYQmrKgzCNzw6Z-6\" class=\"footnote-backref\">↩︎</a></li>\n<li id=\"fn-ETotYQmrKgzCNzw6Z-7\" class=\"footnote-item\"><p>Boyd &amp; Richerson (2005), p. 135. <a href=\"#fnref-ETotYQmrKgzCNzw6Z-7\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"fn-ETotYQmrKgzCNzw6Z-8\" class=\"footnote-item\"><p>Hull (2000), p. 37. <a href=\"#fnref-ETotYQmrKgzCNzw6Z-8\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"fn-ETotYQmrKgzCNzw6Z-9\" class=\"footnote-item\"><p>Perkins (1995). <a href=\"#fnref-ETotYQmrKgzCNzw6Z-9\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"fn-ETotYQmrKgzCNzw6Z-10\" class=\"footnote-item\"><p>Adapted from Stanovich et al. (2008). <a href=\"#fnref-ETotYQmrKgzCNzw6Z-10\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"fn-ETotYQmrKgzCNzw6Z-11\" class=\"footnote-item\"><p>Adapted from Stanovich et al. (2010). <a href=\"#fnref-ETotYQmrKgzCNzw6Z-11\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"fn-ETotYQmrKgzCNzw6Z-12\" class=\"footnote-item\"><p>Ackerman et al. (1999); Deary (2000, 2001); Hunt (1987, 1999); Kane &amp; Engle (2002); Lohman (2000); Sternberg (1985, 1997, 2003); Unsworth &amp; Engle (2005). <a href=\"#fnref-ETotYQmrKgzCNzw6Z-12\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"fn-ETotYQmrKgzCNzw6Z-13\" class=\"footnote-item\"><p>See table 17.1 in Stanovich et al. (2010). The image is from Stanovich (2010). <a href=\"#fnref-ETotYQmrKgzCNzw6Z-13\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"fn-ETotYQmrKgzCNzw6Z-14\" class=\"footnote-item\"><p>Larrick (2004). <a href=\"#fnref-ETotYQmrKgzCNzw6Z-14\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"fn-ETotYQmrKgzCNzw6Z-15\" class=\"footnote-item\"><p>Bishop &amp; Trout (2004). <a href=\"#fnref-ETotYQmrKgzCNzw6Z-15\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"fn-ETotYQmrKgzCNzw6Z-16\" class=\"footnote-item\"><p>Koehler (1994). <a href=\"#fnref-ETotYQmrKgzCNzw6Z-16\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"fn-ETotYQmrKgzCNzw6Z-17\" class=\"footnote-item\"><p>Koriat et al. (1980). Also see Soll &amp; Klayman (2004); Mussweiler et al. (2000). <a href=\"#fnref-ETotYQmrKgzCNzw6Z-17\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"fn-ETotYQmrKgzCNzw6Z-18\" class=\"footnote-item\"><p>Larrick et al. (1990). <a href=\"#fnref-ETotYQmrKgzCNzw6Z-18\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"fn-ETotYQmrKgzCNzw6Z-19\" class=\"footnote-item\"><p>Gigerenzer &amp; Hoffrage (1995). <a href=\"#fnref-ETotYQmrKgzCNzw6Z-19\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"fn-ETotYQmrKgzCNzw6Z-20\" class=\"footnote-item\"><p>Sedlmeier (1999). <a href=\"#fnref-ETotYQmrKgzCNzw6Z-20\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"fn-ETotYQmrKgzCNzw6Z-21\" class=\"footnote-item\"><p>Cheng &amp; Wu (2010). <a href=\"#fnref-ETotYQmrKgzCNzw6Z-21\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"fn-ETotYQmrKgzCNzw6Z-22\" class=\"footnote-item\"><p>Hasher et al. (1981); Reimers &amp; Butler (1992). <a href=\"#fnref-ETotYQmrKgzCNzw6Z-22\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"fn-ETotYQmrKgzCNzw6Z-23\" class=\"footnote-item\"><p>Clarkson et al. (2002). <a href=\"#fnref-ETotYQmrKgzCNzw6Z-23\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"fn-ETotYQmrKgzCNzw6Z-24\" class=\"footnote-item\"><p>Block &amp; Harper (1991); George et al. (2000). <a href=\"#fnref-ETotYQmrKgzCNzw6Z-24\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"fn-ETotYQmrKgzCNzw6Z-25\" class=\"footnote-item\"><p>Lovallo &amp; Kahneman (2003); Buehler et al. (2010); Flyvbjerg (2008); Flyvbjerg et al. (2009). <a href=\"#fnref-ETotYQmrKgzCNzw6Z-25\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"fn-ETotYQmrKgzCNzw6Z-26\" class=\"footnote-item\"><p>Connolly &amp; Dean (1997); Forsyth &amp; Burt (2008); Kruger &amp; Evans (2004). <a href=\"#fnref-ETotYQmrKgzCNzw6Z-26\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"fn-ETotYQmrKgzCNzw6Z-27\" class=\"footnote-item\"><p>Taylor et al. (1998). See also Koole &amp; Vant Spijker (2000). <a href=\"#fnref-ETotYQmrKgzCNzw6Z-27\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n</ol>\n</section>\n", "user": {"username": "lukeprog"}}, {"_id": "kQLTBkinALMNuDPfo", "title": "Policymaking for Posterity", "postedAt": "2008-09-02T01:39:00.000Z", "htmlBody": "<h1>Abstract</h1><blockquote><p>Policymaking for posterity involves current decisions with distant consequences. Contrary to conventional prescriptions, we conclude that the greater wealth of future generations may strengthen the case for preserving environmental amenities; lower discount rates should be applied to the far future, and special effort should be made to avoid actions that impose costs on future generations.</p><p>Posterity brings great uncertainties. Even massive losses, such as human extinction, however, do not merit infinite negative utility. Given learning, greater uncertainties about damages could increase or decrease the optimal level of current mitigation activities.</p><p>Policies for posterity should anticipate effects on: alternative investments, both public and private; the actions of other nations; and the behaviors of future generations. Such effects may surprise.&nbsp;</p><p>This analysis blends traditional public finance and behavioral economics with a number of hypothetical choice problems.&nbsp;</p></blockquote><h3><a href=\"https://www.nber.org/papers/w14359\"><strong>Read the rest of the paper</strong></a></h3>", "user": {"username": "EA Fellowship"}}, {"_id": "WdmCe6dr3snACxehL", "title": "Scope Insensitivity", "postedAt": "2007-05-13T23:08:50.742Z", "htmlBody": "<p>Once upon a time, three groups of subjects were asked how much they would pay to save 2,000 / 20,000 / 200,000 migrating birds from drowning in uncovered oil ponds. The groups respectively answered $80, $78, and $88.<sup class=\"footnote-ref\"><a href=\"#fn-zSJqPmYKvaN9vDJDd-1\" id=\"fnref-zSJqPmYKvaN9vDJDd-1\">[1]</a></sup></p>\n<p>This is <em>scope insensitivity</em> or <em>scope neglect</em>. The number of birds saved—the <em>scope</em> of the altruistic action—had little effect on willingness to pay. Similar experiments showed that Toronto residents would pay little more to clean up all polluted lakes in Ontario than polluted lakes in a particular region of Ontario,<sup class=\"footnote-ref\"><a href=\"#fn-zSJqPmYKvaN9vDJDd-2\" id=\"fnref-zSJqPmYKvaN9vDJDd-2\">[2]</a></sup> or that residents of four western US states would pay only 28% more to protect all 57 wilderness areas in those states than to protect a single area.<sup class=\"footnote-ref\"><a href=\"#fn-zSJqPmYKvaN9vDJDd-3\" id=\"fnref-zSJqPmYKvaN9vDJDd-3\">[3]</a></sup></p>\n<p>People visualize “a single exhausted bird, its feathers soaked in black oil, unable to escape.”<sup class=\"footnote-ref\"><a href=\"#fn-zSJqPmYKvaN9vDJDd-4\" id=\"fnref-zSJqPmYKvaN9vDJDd-4\">[4]</a></sup> This image, or <em>prototype</em>, calls forth some level of emotional arousal that is primarily responsible for willingness-to-pay — and the image is the same in all cases. As for scope, it gets tossed out the window — no human can visualize 2,000 birds at once, let alone 200,000.</p>\n<p>The usual finding is that <em>exponential</em> increases in scope create <em>linear</em> increases in willingness-to-pay—perhaps corresponding to the linear time for our eyes to glaze over the zeroes; this small amount of affect is added, not multiplied, with the prototype affect. This hypothesis is known as “valuation by prototype.”</p>\n<p>An alternative hypothesis is “purchase of moral satisfaction.” People spend enough money to create a <em>warm glow</em> in themselves, a sense of having done their duty. The level of spending needed to purchase a warm glow depends on personality and financial situation, but it certainly has nothing to do with the number of birds.</p>\n<p>We are insensitive to scope even when human lives are at stake: Increasing the alleged risk of chlorinated drinking water from 0.004 to 2.43 annual deaths per 1,000 — a factor of 600 — increased willingness-to-pay from $3.78 to $15.23.<sup class=\"footnote-ref\"><a href=\"#fn-zSJqPmYKvaN9vDJDd-5\" id=\"fnref-zSJqPmYKvaN9vDJDd-5\">[5]</a></sup> Baron and Greene found no effect from varying lives saved by a factor of 10.<sup class=\"footnote-ref\"><a href=\"#fn-zSJqPmYKvaN9vDJDd-6\" id=\"fnref-zSJqPmYKvaN9vDJDd-6\">[6]</a></sup></p>\n<p>A paper entitled <a href=\"http://web.archive.org/web/20130328012735/http://commonsenseatheism.com/wp-content/uploads/2011/09/Fetherstonhaugh-et-al-Insensitivity-to-the-value-of-human-life-A-study-of-psychophysical-numbing.pdf\">“Insensitivity to the value of human life: A study of psychophysical numbing”</a> collected evidence that our perception of human deaths follows Weber’s Law — obeys a logarithmic scale where the “just noticeable difference” is a constant fraction of the whole. A proposed health program to save the lives of Rwandan refugees garnered far higher support when it promised to save 4,500 lives in a camp of 11,000 refugees, rather than 4,500 in a camp of 250,000. A potential disease cure had to promise to save far more lives in order to be judged worthy of funding, if the disease was originally stated to have killed 290,000 rather than 160,000 or 15,000 people per year.<sup class=\"footnote-ref\"><a href=\"#fn-zSJqPmYKvaN9vDJDd-7\" id=\"fnref-zSJqPmYKvaN9vDJDd-7\">[7]</a></sup></p>\n<p>The moral: If you want to be an effective altruist, you have to think it through with the part of your brain that processes those unexciting inky zeroes on paper, not just the part that gets worked up about that poor struggling oil-soaked bird.</p>\n<hr class=\"footnotes-sep\">\n<section class=\"footnotes\">\n<ol class=\"footnotes-list\">\n<li id=\"fn-zSJqPmYKvaN9vDJDd-1\" class=\"footnote-item\"><p>William H. Desvousges et al., <em>Measuring Nonuse Damages Using Contingent Valuation: An Experimental Evaluation of Accuracy</em>, technical report (Research Triangle Park, NC: RTI International, 2010). <a href=\"#fnref-zSJqPmYKvaN9vDJDd-1\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"fn-zSJqPmYKvaN9vDJDd-2\" class=\"footnote-item\"><p>Daniel Kahneman, “Comments by Professor Daniel Kahneman,” in <em>Valuing Environmental Goods: An Assessment of the Contingent Valuation Method</em>, ed. Ronald G. Cummings, David S. Brookshire, and William D. Schulze, vol. 1.B, Experimental Methods for Assessing Environmental Benefits (Totowa, NJ: Rowman &amp; Allanheld, 1986), 226–235; Daniel L. McFadden and Gregory K. Leonard, “Issues in the Contingent Valuation of Environmental Goods: Methodologies for Data Collection and Analysis,” in <em>Contingent Valuation: A Critical Assessment</em>, ed. Jerry A. Hausman, Contributions to Economic Analysis (New York: North-Holland, 1993), 165–215. <a href=\"#fnref-zSJqPmYKvaN9vDJDd-2\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"fn-zSJqPmYKvaN9vDJDd-3\" class=\"footnote-item\"><p>Daniel L. McFadden and Gregory K. Leonard, \"Issues in the Contingent Valuation of Environmental Goods: Methodologies for Data Collection and Analysis,\" <em>Contingent Valuation: A Critical Assessment</em>, ed. Jerry A. Hausman, Contributions to Economic Analysis 220 (New York: North-Holland, 1993), 165-215. <a href=\"#fnref-zSJqPmYKvaN9vDJDd-3\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"fn-zSJqPmYKvaN9vDJDd-4\" class=\"footnote-item\"><p>Daniel Kahneman, Ilana Ritov, and David Schkade, “Economic Preferences or Attitude Expressions?: An Analysis of Dollar Responses to Public Issues,” <em>Journal of Risk and Uncertainty</em> 19, nos. 1–3 (1999): 203–235. <a href=\"#fnref-zSJqPmYKvaN9vDJDd-4\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"fn-zSJqPmYKvaN9vDJDd-5\" class=\"footnote-item\"><p>Richard T. Carson and Robert Cameron Mitchell, “Sequencing and Nesting in Contingent Valuation Surveys,” <em>Journal of Environmental Economics and Management</em> 28, no. 2 (1995): 155–173. <a href=\"#fnref-zSJqPmYKvaN9vDJDd-5\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"fn-zSJqPmYKvaN9vDJDd-6\" class=\"footnote-item\"><p>Jonathan Baron and Joshua D. Greene, “Determinants of Insensitivity to Quantity in Valuation of Public Goods: Contribution, Warm Glow, Budget Constraints, Availability, and Prominence,” <em>Journal of Experimental Psychology: Applied</em> 2, no. 2 (1996): 107–125. <a href=\"#fnref-zSJqPmYKvaN9vDJDd-6\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"fn-zSJqPmYKvaN9vDJDd-7\" class=\"footnote-item\"><p>David Fetherstonhaugh et al., “Insensitivity to the Value of Human Life: A Study of Psychophysical Numbing,” <em>Journal of Risk and Uncertainty</em> 14, no. 3 (1997): 283–300. <a href=\"#fnref-zSJqPmYKvaN9vDJDd-7\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n</ol>\n</section>\n", "user": {"username": "EA Fellowship"}}, {"_id": "f384sGgrp74DWdGyj", "title": "How to be a high impact philosopher", "postedAt": "2012-05-08T04:00:25.000Z", "htmlBody": "<html><body><p>Philosophy is often impractical. That&#x2019;s an understatement. It might therefore be surprising to think of a career as a philosopher as a potentially high impact ethical career - the sort of career that enables one to do a huge amount of good in the world. But I don&#x2019;t think that philosophy&#x2019;s impracticality is in the nature of the subject-matter. In fact, I think that research within certain areas of philosophy is among some of the most important and practical research that one can do. This shouldn&#x2019;t be surprising when one considers that philosophy is the only subject that addresses directly the fundamental practical question: what ought I to do?</p>\n\n<p>In this post I&#x2019;ll focus in on normative ethics, practical ethics, and decision theory. Within these areas, I&#x2019;m going to give a recipe for choosing research topics, if one wants to maximise the practical importance of one&#x2019;s work as a philosopher. Here it goes:</p>\n\n<ol>\n<li>Begin by asking &#x2018;which issues might conceivably be the most important moral issue that we currently face?&#x2019;</li>\n\n<li>Then ask &#x2018;what are the crucial normative considerations for determining which of these issues really is the most important?&#x2019;</li>\n\n<li>Then figure out which of these crucial considerations is most likely to produce an action-relevant outcome given your marginal research time?</li>\n\n<li>Then work on that topic!</li>\n</ol>\n\n<p>That was the outline. It&#x2019;s by no means a perfect methodology, and there are many ways in which it could be expanded upon. Its main point is to give one the gist, and hopefully to make one wonder about why research topics within ethics aren&#x2019;t typically chosen in the above way. In the rest of the post I&#x2019;ll briefly flesh out these different steps.</p>\n\n<p><strong>1. What&#x2019;s the list of the conceivably most important current moral issues?</strong></p>\n\n<p>There are many problems in the world, and there are many ways of carving up the space of &#x2018;problems&#x2019;. I&#x2019;ll talk about these issues in a later post. But, in the mean time, here are a few contenders:</p>\n\n<p>i. Global poverty</p>\n\n<p><em>Why?</em></p>\n\n<p>Currently 1.4 billion people live on less than $1.25 a day, purchasing power parity adjusted (that is: they consume fewer goods than $1.25 could buy in the US in 2005). 18 million people die per year of poverty-related causes - that&#x2019;s about one third of all human deaths.</p>\n\n<p>ii. Abortion</p>\n\n<p><em>Why?</em></p>\n\n<p>Around 42 million abortions are performed per year. Many people think that a fetus has similar rights to an adult person, in which case performing an abortion would be roughly on a par, morally, with murder. To get a sense of scale on this issue, consider that if this were true then the murder toll from the government sanction of abortions would outstrip all previous genocides combined.</p>\n\n<p>iii. Animal suffering and slaughter</p>\n\n<p><em>Why?</em></p>\n\n<p>A staggering 50 billion non-human land animals are killed every year for food. A large proportion of those animals are factory farmed, living in extreme suffering. There are compelling arguments to the conclusion that we should treat non-human animal suffering as being on a par, morally, as human animal suffering. If this were true, then the annual animal suffering caused by humans could easily outweigh all human suffering.</p>\n\n<p>iv. The risk of human extinction</p>\n\n<p><em>Why?</em></p>\n\n<p>The number of people who might live in the future, if we survive the next few centuries, numbers in the trillions (consider that, if humans live at current population levels for the average lifespan of a mammalian species, then there are over 10^13 (or ten trillion) humans in the future). If we ought, morally, to value potential future people in the same way that we value present people, then the loss from the human race going extinct in the near future might number in the trillions of lives.</p>\n\n<p><strong>2. What are the crucial normative considerations?</strong></p>\n\n<p>It would be controversial to claim, of any of the above issues, that it is the most important moral issue that we face. Even if we knew all the empirical facts, there would still remain tricky moral issues &#x2013; moral considerations that are crucial insofar as, if we knew the right opinion on the matter, we could write off certain of the above issues as not of the greatest importance.</p>\n\n<p>There are many we could put on the list. But the list would certainly include:</p>\n\n<ul>\n<li>\n<p>How should we value future people, and merely possible people, compared with present people? (Relevant to abortion, animal suffering, extinction risk)</p>\n</li>\n\n<li>\n<p>What moral status do non-human animals have, and how should we make inter-species comparisons of wellbeing? (Relevant to animal suffering)</p>\n</li>\n\n<li>\n<p>At what stage does a human fetus become a person, with rights to life similar to that of an adult? (Relevant to abortion)</p>\n</li>\n\n<li>\n<p>How should we act under empirical uncertainty &#x2013; in particular should we follow expected utility even when it comes to tiny probabilities of huge amounts of value? (Relevant to extinction risk)</p>\n</li>\n\n<li>\n<p>All other things being equal, should we prioritise the prevention of wrongs over the alleviation of naturally caused suffering? (Relevant to abortion, animal suffering)</p>\n</li>\n\n<li>\n<p>Given that we aren&#x2019;t ever going to be certain in answers to the above questions, how should we take into account uncertainty about these moral issues in our decision-making? (Relevant to: global poverty, abortion, animal suffering, extinction risk)</p>\n</li>\n</ul>\n\n<p><strong>3. Which topic would be advanced the most from one&#x2019;s marginal research time?</strong></p>\n\n<p>This one is more dependent on one&#x2019;s own abilities and interests. But, in general, we could suppose that research time on a particular topic has diminishing marginal value. So, for example, working on the question of when a fetus becomes a person probably isn&#x2019;t the area when one will have greatest marginal research impact: the subject has been extensively studied by hundreds of good thinkers. In contrast, the topics of how to handle moral uncertainty, or how to make inter-species wellbeing comparisons, or whether to prioritise averting wrongs over preventing naturally caused suffering, have been comparatively rarely studied.</p></body></html>", "user": {"username": "William_MacAskill"}}, {"_id": "5Chut58EATH8JH85u", "title": "Practical ethics given moral uncertainty", "postedAt": "2012-01-31T05:00:01.000Z", "htmlBody": "<html><body><p>Practical ethics aims to offer advice to decision-makers embedded in the real world.  In order to make the advice practical, it typically takes empirical uncertainty into account.  For example, we don&#x2019;t currently know exactly to what extent the earth&#x2019;s temperature will rise, if we are to continue to emit CO2 at the rate we have been emitting so far.  The temperature rise might be small, in which case the consequences would not be dire.  Or the temperature rise might be very great, in which case the consequences could be catastrophic.  To what extent we ought to mitigate our CO2 emissions depends crucially on this factual question.  But it&#x2019;s of course not true that we are unable to offer any practical advice in absence of knowledge concerning this factual question. It&#x2019;s just that our advice will concern what one ought to do in light of uncertainty about the facts.\n \nBut if practical ethics should take empirical uncertainty into account, surely it should take moral uncertainty into account as well.  In many situations, we don&#x2019;t know all the moral facts.  I think it is fair to say, for example, that we don&#x2019;t currently know exactly how to weigh the interests of future generations against the interests of current generations.  But this issue is just as relevant to the question of how one ought to act in response to climate change as is the issue of expected temperature rise.  If the ethics of climate change offers advice about how best to act given empirical uncertainty concerning global temperature rise, it should also offer advice about how best to act, given uncertainty concerning the value of future generations.\n \nCases such as the above aren&#x2019;t rare.  Given the existence of widespread disagreement within ethics, and given the difficulty of the subject-matter, we would be overconfident if we were to claim to be 100% certain in our favoured moral view, especially when it comes to the difficult issues that ethicists often discuss.</p><p>So we need to have an account of how one ought to act under moral uncertainty.  The standard account of making decisions under uncertainty is that you ought to <em>maximise expected value</em>: look at all hypotheses in which you have some degree of belief, work out the likelihood of each hypothesis, work out how much value would be at stake if that hypothesis were true, and then trade off the probability of a hypothesis being true against how much would be at stake, if it were true.  One implication of maximizing expected value is that sometimes one should refrain from a course of action, not on the basis that it will probably be a bad thing to do, but rather because there is a reasonable chance that it will be a bad thing to do, and that, if it&#x2019;s bad thing to do, then it&#x2019;s really bad.  So, for example, you ought not to speed round blind corners: the reason why isn&#x2019;t because it&#x2019;s likely that you will run someone over if you do so.  Rather, the reason is that there&#x2019;s some chance that you will &#x2013; and it would be seriously bad if you did.</p><p>With this on board, let&#x2019;s think about the practical implications of maximising expected value under moral uncertainty.   It seems that the implications are pretty clear in a number of cases. Here are a few.</p><p>1. One might think it more likely than not that it&#x2019;s not wrong to kill animals for food.  But one shouldn&#x2019;t be certain that it&#x2019;s not wrong.  And, if it is wrong, then it&#x2019;s seriously wrong &#x2013; <a href=\"http://www.animal-rights-library.com/texts-m/singer02.htm\">in the same ballpark as murder</a>. So, in killing an animal, one risks performing a major moral wrong, without any correspondingly great potential moral upside.  This would be morally reckless.  So one ought not to kill animals for food.</p><p>2. One might think it more likely than not that it&#x2019;s not wrong to have an abortion, for reasons of convenience.  But one shouldn&#x2019;t be certain that it&#x2019;s not wrong.  And, if it is wrong, then it&#x2019;s seriously wrong &#x2013; <a href=\"http://rci.rutgers.edu/~tripmcc/phil/cmsi/csmi-abortion/marquis-whyabortionisimmoral.pdf\">in the same ballpark as murder</a>.  So, in having an abortion for convenience, one risks performing a major moral wrong, without any correspondingly great potential moral upside.  This would be morally reckless.  So one ought not to have an abortion for reasons of convenience.</p><p>3. One might think it more likely than not that it&#x2019;s not wrong to spend money on luxuries, rather than giving it to fight extreme poverty.  But one shouldn&#x2019;t be certain that it&#x2019;s not wrong.  And, if it is wrong, then it&#x2019;s seriously wrong &#x2013; <a href=\"http://www.utilitarian.net/singer/by/1972----.htm\">in the same ballpark as walking past a child drowning in a shallow pond</a>. So, in spending money on luxuries, one risks performing a major moral wrong, without any correspondingly great potential moral upside.  This would be morally reckless.  So one ought not to spend money on luxuries rather than giving that money to fight poverty.</p></body></html>", "user": {"username": "William_MacAskill"}}, {"_id": "W7Ms6fvE2ZzoqcEPH", "title": "Giving isn’t demanding*", "postedAt": "2011-11-25T05:00:04.000Z", "htmlBody": "<html><body><p>Christmas is about giving.&#xA0; But giving how much?&#xA0; &#xA3;50 might seem like a lot for a Christmas present.&#xA0; But how about giving 50% of your annual wage?</p><p>There are now-familiar arguments that we in rich countries ought to give a lot more to the developed world than we typically do. In fact, Peter Singer and Peter Unger argue that we ought to give a <em>lot</em>.&#xA0; They don&#x2019;t specify a figure, but let&#x2019;s pick, just for the sake of having a nice round number, 50% of one&#x2019;s annual wage.</p><p>The standard response to the views of Singer and Unger, in the philosophical literature, is that giving such extortionate sums is just <em>too</em> demanding for it to be plausible as a moral requirement.</p><p>But is giving this much really too demanding?&#xA0; I&#x2019;ll suggest not, for two reasons.</p><p>\nFirst, you&#x2019;re probably richer than you think.&#xA0; If you are earning &#xA3;40 000/yr, you&#x2019;re easily in the richest 1% of the world&#x2019;s population; if you were to give half that, you&#x2019;d still be in the richest 2%.&#xA0; If you&#x2019;re earning &#xA3;20 000 and were to give 50%, you&#x2019;d still be in the richest 8%.</p><p>Imagine if, before you were born, when you didn&#x2019;t know who you were going to be in society, you got told you were going to end up in the richest 10% of the world&#x2019;s population.&#xA0; Would you be happy?&#xA0; You&#x2019;d be over the moon!&#xA0; But if that&#x2019;s true, how could we complain about <em>merely</em> living in the richest 10%?</p><p>You might think that, well, the money goes much further in poor countries &#x2013; so having a lower wage isn&#x2019;t so bad if you live there, and so the figures I&#x2019;ve given are skewed.&#xA0; But those figures I&#x2019;ve given are &#x2018;purchasing power parity&#x2019; adjusted &#x2013; that is, they&#x2019;ve already taken into account the fact that money goes farther in poor countries.&#xA0; Some people are <em>poor</em>!</p><p>Second, the latest psychological research suggests that, despite what you may think, income level really doesn&#x2019;t make much of a difference to your overall happiness. Once we&#x2019;ve got the basics in life &#x2013; food, water and shelter &#x2013; then other things, like health and relationships, become much more important. In particular, it&#x2019;s been found that &#x2018;prosocial&#x2019; spending of money &#x2013; for example, giving the money to people more in need &#x2013; provides a &#x2018;warm glow&#x2019; that can keep you happy for weeks.</p><p>In fact, rather than being insanely demanding, giving away large chunks of your income will actually have very little effect on your wellbeing, and may well be a net benefit.</p><p>So giving really isn&#x2019;t demanding.&#xA0; This year, let&#x2019;s put ethics into practice, and make the world a little better: <a href=\"http://www3.imperial.ac.uk/schisto/donate\">http://www3.imperial.ac.uk/schisto/donate</a>\n</p><p>Merry Christmas!</p><p></p><p>\n*More information on these and related topics can be found at <a href=\"http://www.givingwhatwecan.org/\">www.givingwhatwecan.org</a></p></body></html>", "user": {"username": "William_MacAskill"}}]