[{"_id": "3frgtt8aocavEGMat", "title": "Expert Philanthropy vs. Broad Philanthropy", "postedAt": "2014-10-16T12:48:26.740Z", "htmlBody": "<p><i>Note: Before the launch of the Open Philanthropy Project Blog, this post appeared on the </i><a href=\"http://blog.givewell.org/\"><i>GiveWell Blog</i></a><i>. Uses of “we” and “our” in the below post may refer to the Open Philanthropy Project or to GiveWell as an organization. Additional comments may be available at the </i><a href=\"http://blog.givewell.org/2014/10/16/expert-philanthropy-vs-broad-philanthropy/\"><i>original post</i></a><i>.</i></p><p>It seems to me that the most common model in philanthropy - seen at nearly every major staffed foundation - is to have staff who specialize in a particular <a href=\"https://www.openphilanthropy.org/blog/refining-goals-givewell-labs\">cause</a> (for example, specializing in <a href=\"https://www.openphilanthropy.org/research/cause-reports/policy/criminal-justice-reform\">criminal justice</a> policy). Often, such staff have a very strong background in the cause before they come to the foundation, and they generally seem to focus their time exclusively on one cause - to the point of becoming (if they weren’t already) an expert in it.</p><p>I think this model makes a great deal of sense, partly for reasons we’ve <a href=\"https://www.openphilanthropy.org/blog/refining-goals-givewell-labs\">discussed previously</a>. Getting to know the people, organizations, literature, challenges, etc. most relevant to a particular cause is a significant investment - a “fixed cost” that can then make one more knowledgeable about all giving opportunities within that cause. Furthermore, evaluating and following a single giving opportunity can be a great deal of work. Now that the <a href=\"http://www.openphilanthropy.org/\">Open Philanthropy Project</a> has made some early grants, it is hitting home just how many questions we could - and, it feels, should - ask about each. If we want to follow each grant to the best our abilities, we’ll need to allocate a lot of staff time to each; having staff specialize in causes is likely the only way to do so efficiently.</p><p>Yet I’m not convinced that this model is the right one for us. Depth comes at the price of breadth. With our limited <a href=\"http://blog.givewell.org/2013/08/29/we-cant-simply-buy-capacity/\">management capacity</a>, following each grant to the best of our abilities shouldn’t be assumed to be the right approach. I’ve been asking myself the question of whether there’s a way to be involved in many more causes at a much lower level of depth, looking for the most outstanding giving opportunities to come along in the whole broad set of causes. I’ve been thinking about this question recently mostly in the context of <a href=\"https://www.openphilanthropy.org/focus/us-policy\">policy</a>, which will be the focus of this post.</p><p>Having a “low-depth” involvement in a given issue could take a number of forms - for example:</p><ul><li>One might make a concerted effort to identify a small number of “big bets” related to an issue, and focus effort on following these “big bets.”</li><li>One might make a concerted effort to identify a small number of “gaps” - aspects of an issue that get very little attention and have very few people working on them - and focus grantmaking activity on these “gaps.” This approach could be consistent with making a relatively large number of grants in the hopes that some grantee gains traction.</li><li>One might focus on identifying a trusted advisor in an issue space, and make a small number of grants as recommended by the advisor (this is largely the approach behind our <a href=\"https://www.openphilanthropy.org/research/cause-reports/policy/labor-mobility\">grants so far on labor mobility</a>).</li><li>One might co-fund the work of another major funder, join a collaboration of major funders, or support the work of a large and established organization, and gain more familiarity with the issue over time by following this partner’s work.</li><li>One might aim for a very basic level of understanding of an issue - in particular, which way we would like to see policy change relative to the status quo, and whom we feel aligned enough with to take their advice. With this understanding in hand for multiple issues, one might then be well-positioned to support: (a) “cross-issue” organizations and projects that are likely to have a small impact on many issues; (b) campaigns aiming to take advantage of short-term “windows of opportunity” that arise for various issues.</li></ul><p>I can see a few arguments in favor of trying one or more of these, all of which make it possible to take some form of a “breadth” oriented approach (more causes, at with a lower degree of depth and expertise, than the standard cause-specialist approach would involve).</p><p>First and most importantly, <strong>we will never know as much about grantees’ work as they do</strong>, and it arguably makes more sense to think of grantees as the relevant experts. The best funder might be the one who picks qualified grantees in an important cause, supports them and otherwise stays out of their way. With this frame in mind, focusing on in-house expertise is arguably inefficient (in the sense that our expertise would become somewhat redundant with grantees’) and possibly even counterproductive (in the sense that it could lead us to be overly “active” with grantees, pushing them toward our theory of the case).</p><p>Of course, picking qualified grantees is a serious challenge, and one that is likely harder without deep context. But the question is how much additional benefit deep context provides. Even without expertise, it is possible to get some signals of grantee quality - general reputation, past accomplishments, etc. - and even with expertise, there will be a great deal of uncertainty. In a high-risk model of the world, where perhaps 10% of one’s grants will account for 90% of one’s impact, it may be better pick “potentially outstanding” grantees from a relatively broad space of possibilities than to limit oneself to a narrower space, while having more precise and reliable ways of distinguishing between marginally better or worse giving opportunities.</p><p>Expertise would also be an advantage for following a grant, learning from it and continuing to help grantees as they progress. However, it seems quite possible to me that the best grantees tend to be self-driven and improvisatory, such that following them closely wouldn’t add value to what they’re doing, and would largely serve to assuage our own anxiety without doing much to increase our impact.</p><p>Secondly, <strong>the best giving opportunities may sometimes cut across multiple causes</strong> and be hard to assess if we’ve engaged seriously with only a small number of causes. This issue seems particularly important to me in the area of <a href=\"https://www.openphilanthropy.org/focus/us-policy\">U.S. policy</a>, where the idea of strengthening the network of people who share our values - or the platform representing those values - could be very important. If we focus exclusively on a small number of policy areas, and give little attention to others, we could end up lacking the knowledge and networks to perform well on this goal, and we could be ill-positioned to evaluate the ramifications of a giving opportunity for the full set of issues we care about. (An argument for pursuing both breadth- and depth-oriented strategies simultaneously is that the depth-oriented work may surface opportunities that are relevant to a large number of issues, and the breadth-oriented work could then be helpful in assessing such opportunities.)</p><p>Finally, it seems to us that <strong>there are some issue areas where the giving opportunities are quite limited</strong> - particularly issues that we think of as <a href=\"https://www.openphilanthropy.org/blog/potential-us-policy-focus-areas\">green fields</a>, as well as neglected sub-areas of other issues. Devoting a full staff member to such an issue would pose particular risks in terms of inefficiency, and it might be better to fund the few available opportunities while waiting for more to emerge.</p><p>I think the cases of <a href=\"http://edscott.org/philanthropy/\">Ed Scott</a> and the <a href=\"http://www.sandlerfoundation.org/grants/\">Sandler Foundation</a> represent interesting examples of what a philanthropist can accomplish despite not specializing exclusively in a particular cause, and despite not building out a staff of domain experts.</p><ul><li><a href=\"https://hewlett.org/friday-note-getting-giving-right/\">Ruth Levine of the Hewlett Foundation writes</a> that Ed Scott has “built at least four excellent organizations from the ground up” - including the Center for Global Development, which we have <a href=\"https://www.openphilanthropy.org/blog/grant-center-global-development-cgd\">supported and think positively of</a>. She adds that “Far more than many others seem to be able to do, he lets go – and as he does, the organizations he supports go further and faster than if he were holding on tight.”</li><li>We know less about the Sandler Foundation, but it seems to have played a founding role in <a href=\"https://www.sandlerfoundation.org/grants/\">several prominent organizations</a> and to be well-respected by many, despite not having staff who specialize in a particular cause over the long run. It does do deep cause investigations in sequence, in order to identify promising grantees, but staff work on new cause investigations even while maintaining their funding of previous causes and organizations; this approach therefore seems distinct from the traditional foundation model and can be thought of as one approach to the kind of “broad” work outlined here. One of its core principles is that of looking for excellence in organizations and in leadership, and entrusting those it supports with long-term, flexible support (rather than continuously revisiting and revising the terms of grants).</li></ul><p>In both cases, from what we can tell (and we are considering trying to learn more via <a href=\"https://www.openphilanthropy.org/research/history-of-philanthropy\">case studies</a>), a funder helped create organizations that shared a broad set of values but weren’t focused on a particular policy issue; the funder did not appear to become or hire a domain expert, and may have been <i>more</i> effective by being <i>less</i> hands-on than is the norm among major foundations. My point isn’t that these funders should be emulated in every way (I know relatively little about them), but that the “cause-focused, domain expert” model of grantmaking is not the only viable one.</p><p>I’m not yet sure of exactly what it would look like for us to try a breadth-emphasizing model, and I know that we don’t want this to be the <i>only</i> model we try. The depth-emphasizing model has much to recommend it. I can anticipate that, in some ways, a breadth-emphasizing model could be both genuinely risky and psychologically challenging, as we’d have a lower level of knowledge about our grants than many foundations have of theirs. But I think the potential benefits are big, and I think this idea is worth experimenting with.</p>", "user": {"username": "HoldenKarnofsky"}}, {"_id": "WHRjrk7zmobBJGW7i", "title": "Productivity through self-loyalty", "postedAt": "2014-11-02T07:00:00.000Z", "htmlBody": "<h1>1</h1><p>I can be <a href=\"http://lesswrong.com/lw/jg3/the_mechanics_of_my_recent_productivity/\">pretty dang productive</a> when I put my mind to it.</p><p>Many people have a generic mind-model which runs roughly as follows: a person's reported desires are but one voice among the thronging mob of forces that govern the brain, and it takes significant effort and force of will to align the mob for long enough for people to get something done. Many of us have experienced a desire to stop procrastinating, and then have watched helplessly as we continue to surf the internet. Many of us have resolved to do something difficult, only to watch the opportunity flit by us as we stand motionless at the sidelines.</p><figure class=\"image\"><img src=\"http://mindingourway.com/content/images/2016/03/PrettyRational_NotTheKing.jpg\"></figure><p>People use something like this model when they speak of <a href=\"http://en.wikipedia.org/wiki/Akrasia\">akrasia</a>, the tendency to act against your own better judgement. Haidt <a href=\"http://en.wikipedia.org/wiki/The_Happiness_Hypothesis\">analogizes</a> the brain to someone riding an elephant, where the conscious mind is a rider struggling to steer. Kahneman <a href=\"http://en.wikipedia.org/wiki/Thinking,_Fast_and_Slow\">writes of</a> a dichotomy between \"fast,\" emotional, immediate processes that govern most of our thinking, and \"slow,\" deliberate, conscious processes that occasionally assume command. I have found that the <a href=\"http://en.wikipedia.org/wiki/Spoon_theory\">\"spoon theory\" model of energy reserves</a> resonates for many people, even those who aren't chronically ill or otherwise disabled.</p><p>In all these models, there is a tendency to separate the voice from the mob. Insofar as the voice has the ability to direct the mob (steer the elephant, convince system 1, etc.), we get to do what we want. But when the mob loses interest or focus or motivation, we are at it's leisure.</p><p>I find a lot of truth in these models, and so do many others. Thus, many people, upon seeing my high levels of productivity, expect that I must be very very good at keeping tight control over the mental mob, and forcing them to do things that they would rather not do. It's not uncommon for people to remark that I need to be careful about strong-arming the mob (as eventually they rebel, leading to burn-out), or for people to tell me that I must have some sort of iron will (which they cannot replicate).</p><p>I don't think this is the case. As I said <a href=\"http://mindingourway.com/self-signaling-the-ability-to-do-what-you-want/\">last time</a>:</p><blockquote><p><i>A problem isn't solved until it's solved automatically, without need for attention or willpower.</i></p></blockquote><p>It's <i>possible</i> to force the mob to do something, and this is why willpower is often useful in the short term. But it's seldom a good idea to try to force yourself to do things the mob doesn't want to do in the long term. Ultimately, the mob is the one actually managing your motivation systems, and any plan that relies upon a permanent use of mental force is unlikely to succeed.</p><p>It is much better to have the mob on the same side as the voice of reason.</p><p>But this is something of a catch 22: many people have mind-mobs that just want to sit around all day and watch TV shows or surf the internet. If your mind-mob just wants to rest and I'm cautioning against force, then how does one ever attain high levels of productivity?</p><p>My answer is complex, and relies upon many tools. I've <a href=\"http://lesswrong.com/lw/jh0/deregulating_distraction_moving_towards_the_goal/\">discussed a few of them in the past</a>, and today I'll discuss another.</p><h1>2</h1><p>First, a word of warning: remember the law of <a href=\"http://slatestarcodex.com/2014/03/24/should-you-reverse-any-advice-you-hear/\">equal and opposite advice</a>. For every piece of advice useful to one person, there is some other person who needs exactly the opposite advice.</p><p>I am going to discuss a technique that I use for productivity which results in a sense of austerity through compassion/camaraderie: the parts of me that need rest take as much rest as they need, but also try to take as little as they need out of awareness of the scarcity of resources and compassion for the other parts of me.</p><p>This has proved a powerful technique for me, but it may be exactly the wrong tool for many others. The goal is <i>not</i> to guilt-trip the parts of you that need extra rest, and the goal is <i>not</i> to give yourself over to self-indulgent whims. I personally find a lot of power somewhere in between, at \"compasionate austerity,\" but many others may react poorly to any internal narrative of scarce resources and mental frugality. <i>Remember the law of equal and opposite advice.</i></p><h1>3</h1><p>Imagine a student who has been assigned a very important bit of homework with a deadline looming ever closer. Let's say they're trying to kick themselves into high productivity mode. How can they do this? Well, they can pull out the whips and cattle prods and <i>force</i> their mind-mob to be productive (with gritted teeth and building malcontent), or they can use their most desperate voice and plead with themselves, promising rewards for good behavior (that the mob might just take anyway, if it suits them), or they can wait until the deadline is so close that even the short-sighted mob can see it, at which point they'll go into panic mode (which is kinda like high productivity mode, if you squint).</p><p>But there's also a fourth option, which is something like \"gain the trust of the mob, and build rapport.\" If the student gets the mob onto <i>their</i> side, then the paper will be done automatically, no willpower or pleading or panic necessary. This obviously sounds nice, but how is it done?</p><p>I do this, at least in part, by <i>showing the mob that I am on their side first.</i> This involves self-signalling, as discussed in <a href=\"http://mindingourway.com/self-signaling-the-ability-to-do-what-you-want/\">last week's post</a>. Specifically, it involves signaling to yourself that <i>you are loyal to the mob.</i></p><p>Sometimes, the mob in you will make demands that sound unreasonable, such as \"cancel everything today, I need a break.\" In these situations, it's easy to try to force or plea or bargain with yourself. I take a different tactic: I ask myself if this is really what I need, and if it is, <i>then I do it.</i></p><p>I show the mob that I respect its demands, and that I'm on its side. After all, we have the same goals; and furthermore, I am not the king in my mind. I do not desire a fight (and if I did, I wouldn't win it).</p><p>There are some really bad ways to do this (remember the law of equal and opposite advice!), and if you do this incorrectly it may lead to destructive self-indulgence. If your voice of reason signals helplessness in the face of the mob's whims, if it <i>gives itself up</i> to the mob, then you might end up unhappily pursuing short-sighted whims. The trick is to signal <i>respect</i> for the mob instead: what my mind reports it needs, it gets. This—an unflinching willingness to get the mob what it wants—<i>tempers</i> the mob's demands.</p><p>The appropriate sentiment can perhaps best be described by this clip from the film <i>It's a Wonderful Life</i>:</p><p>(start at 2:58, watch through 6:26)</p><figure class=\"media\"><div data-oembed-url=\"https://www.youtube.com/watch?v=lbwjS9iJ2Sw\"><div><iframe src=\"https://www.youtube.com/embed/lbwjS9iJ2Sw\" allow=\"autoplay; encrypted-media\" allowfullscreen=\"\"></iframe></div></div></figure><h1>4</h1><p>This scene portrays a bank run during the beginning of the great depression. It features the protagonist, George Bailey, trying to calm down a worried mob by reminding them that they're all in this crisis together. The mob doesn't really go for it, and he ends up using his honeymoon money to keep the bank alive.</p><p>The first member of the mob to get his money out of the bank demands the full value of his account, $242. George pleads for austerity, reminding him that they're all in this together, but Tom still demands all his money. George doesn't protest or argue, he just nods and pays out Tom's entire account (and then extends the man a little extra compassion, to boot). The next two members of the mob say they can get away with $20, and are starting to express some concern for George using his own money for this. Then Mrs. Davis bids <i>lower</i>, asking for only $17.50. Overcome, George gives her a kiss on the cheek.</p><p>This is the sort of relationship—between George Bailey and the mob—that I have the \"voice of reason\" cultivate with the varied and disparate parts of my mind. When some part of me demands that I pay its full account, I'll ask it once how much it <i>needs,</i> but if it still demands its full account I'll pay up without hesitation (and extend some additional compassion). This is done not in an appeasing way, but it a respectful way: we're all in this together.</p><p>The mob understands that the voice of reason is responsible for many of the good outcomes that I've achieved, and the mob understands that things like \"rest\" and \"relaxation\" and \"procrastination\" are expensive in terms of ability to achieve good outcomes—I'm \"paying out of the honeymoon money.\"</p><p>But the voice of reason, in turn, is <i>willing</i> to pay out of its honeymoon money. It knows that everyone is going to need some resources to make it through, and does not begrudge any part of me for that.</p><p>There are two important components to this sort of self-relationship: First, the mob must respect the voice of reason, by understanding that the voice of reason achieves many nice things, such as food and roofs and clever schemes and so on. Second, the mob must know that the voice of reason is <i>loyal to them.</i> When some mind part <i>does</i> demand something ostentatious, such as \"a few days of doing nothing,\" then the voice of reason is willing to acquire it.</p><p>My loyalty is not to any individual appointment or task. My own mental health is among my top priorities.</p><p>Once the mob sees this, once the mob <i>knows</i> that I will move the heavens and the earth in order to meet its needs, it doesn't tend to demand the full account. Because, in fact, the mob <i>respects</i> the scarcity of scarce resources, it <i>wants</i> the voice of reason to have enough flexibility to keep on achieving good outcomes. Done right, the mob enters a sort of camaraderie where it takes as little as it can out of <i>compassion,</i> because we all know that life can be hard.</p><p>When Mrs. Davis leaves that bank with $17.50, she isn't feeling resentment or smugness. She knows that she's going to have to struggle a bit to live on only $17.50 until the bank re-opens, but she isn't dreading the struggle or muttering curses. No, she goes home filled with compassion, with respect for George Bailey who is taking great pains to get everyone through this crisis together, and with a tighter feeling of community and closeness to those around her enduring similar austerity. She goes home happy and warm.</p><h1>5</h1><p>This is the mindstate in which I attain high productivity: various parts of the mob of my mind occasionally need rest, recuperation, and procrastination. Parts of me ask for these things. When they do, I ask them how much they really need, how much they can get by with. Do I actually need to take four days off? Because I will, but it's expensive.</p><p>Often, when a part of me really needs a break, and throws up its hands feeling overwhelmed, its initial demands are unrealistic—\"two weeks with no responsibilities!\" So then I ask it again, with the demeanor of George Bailey, what it really needs to get by. And that part of me quickly remembers that all of me is in this together, and that I'm trying to do some very difficult things, and that all parts of me are constrained by scarce resources. Then the part that protested searches for what it really needs, the bare minimum, and it usually answers something like \"I can get the rest I need in fifteen minutes.\"</p><p>And this sacrifice can leave me feeling stronger, feeling warmth and compassion and self-camaraderie, the same feeling that spurs George Bailey to kiss Mrs. Davis' cheek in the video clip above.</p><h1>6</h1><p>There is only so much time and attention that we have in this world, and we're trying to do many amazing and wonderful things. If you want to be able to do more than you're currently doing, I don't suggest trying to force yourself. Instead, I suggest showing yourself that you really are willing to move the heaven and earth <i>for yourself,</i> in order to satisfy your needs. This, in turn, can help you build up the mental camaraderie (and resulting austerity) that comes from all the parts of you understanding that you're all in this together.</p>", "user": {"username": "So8res"}}, {"_id": "HQauBA4NfKoYJ9wuX", "title": "Self-signaling the ability to do what you want", "postedAt": "2014-10-26T07:00:00.000Z", "htmlBody": "<h1>1</h1><p>In college, I would often find that I had just a little bit too much food. Either I'd cooked too much or the food I'd ordered was just a bit too large, or whatever.</p><p>I'm sure many of you are familiar with the feeling of having four bites of food left, wanting roughly one more bite, but knowing that three bites is too few to justify saving the food for later.</p><p>(Then you either apply lots of willpower to save the food for later, or you take another bite, realize that there isn't enough food left to save, and proceed to stuff yourself.)</p><p>This is pretty much a standard instance of the <a href=\"http://lesswrong.com/lw/at/sunk_cost_fallacy/\">sunk cost fallacy</a>, where reasoning of the form \"I can't just <i>not eat the food</i>, because I already paid for it\" neglects the fact that the costs are already sunk. In these scenarios, the <i>only</i> consideration should be whether or not eating the rest of the food is be better than throwing it away. Your money, which is gone no matter what you choose, shouldn't factor into the decision.</p><p>As a student of economics, I understood the sunk cost fallacy well. But extra food didn't <i>quite</i> seem sunk: after all, the food would still give me more calories, and even if it made me overfull for an hour or two, it could lead me to have smaller (and thus cheaper) subsequent meals.</p><p>Or, at least, that's the argument that my internal monologue would spin up to distract me long enough for my hands to keep shoving food into my mouth.</p><p>The counterargument would go something like</p><blockquote><p><i>First of all, many of the calories will be either wasted or harmful if I consume them now. Secondly, the cost of dinner is more dependent upon what's available than how hungry I am. Third, even if the cost of dinner is reduced, it will be reduced by maybe a dollar, and a few hours of discomfort is not worth a dollar.</i></p></blockquote><p>But by then, it would already be too late; the food would be gone and I'd be overfull.</p><h1>2</h1><p>Failures of this form can generally be fixed by \"just not doing that,\" which in this case entails forcing yourself to stop eating. I don't like that solution, as it requires an application of willpower, and in general, any solution that requires an application of willpower is a stopgap, not a remedy. I much prefer solutions that get all of myself onto the same page, <i>including</i> the parts that make distracting arguments so they can shovel more food into my mouth while I'm not looking.</p><p>(A problem isn't solved until it's solved automatically, without need for attention or willpower.)</p><p>The way I solved this problem was by committing to save any amount of leftover food, <i>no matter how small</i>. Two bites left? Screw it, get me a take-out box.</p><p>Committing to this, and actually doing it once or twice to show myself that I mean business, had an interesting effect.</p><p>First of all, it had the obvious effects that I stopped stuffing myself and that I occasionally had three-bite snacks available in the fridge.</p><p>But more importantly, credibly committing (to myself) that I would do the right thing <i>even if it seemed too late</i> made it much easier to automatically do the right thing.</p><p>Roughly speaking, I managed to signal to the part of myself that was worried about food scarcity that it didn't need to distract me in order to squirrel food away, because I would <i>actually listen to it.</i> I showed it that I was on its side, via an unflinching willingness to save food (even one or two bites) with a blatant disregard for social norms and weird looks from confused waiters.</p><p>And this, in turn, got that part of me onto <i>my</i> side. A willingness (and demonstrated ability) to save any amount of food no matter how small eliminated the <i>impetus</i> to keep eating when near full. This, in turn, allowed me to actually look at the remaining food and (armed with more experience about which tiny portions of food are actually appreciated later) and decide whether or not to save it.</p><p>These days, my bar for how little food I'm willing to take home is quite low, but I'm <i>also</i> comfortable throwing food out (if I'm in a rush or if it won't keep well), and I no longer get the feeling that I'm trying to distract myself for long enough to do something that I wouldn't approve of.</p><h1>3</h1><p>I occasionally see people hitting the failure mode where they try to apply willpower in order to do a thing (such as only eat half of their sandwich, and save the other half for later) and then fail slightly (such as by taking a bite out of the second half) at which point they proceed to completely ignore the parts of themselves that suggest restraint (such as by eating the entire second half of the sandwich and thereby stuffing themselves).</p><p>I refer to this failure mode as \"failing with abandon.\" It seems to me that it's at least somewhat related to a failure of self-signalling: once the initial target is missed, the target itself is completely discredited and ignored in favor of total indulgence.</p><p>The technique I'm describing — self-signalling an ability to do the right thing even if it seems too late — can address this failure mode in general.</p><p>People might feel strange saving the second half of the sandwich after they've taken two bites out of it, but <i>if you actually do that a few times</i> then it becomes much easier to believe that you <i>can.</i> The narrative shifts from \"well I guess I'm not saving the second half of <i>this</i> sandwich\" to \"I guess I was hungry enough for two more bites, but now I'll save the rest.\"</p><p>As it turns out, you can do the right thing after missing the initial target! Just promise yourself that you'll allow yourself to do the right thing, no matter how late.</p><h1>4</h1><p>There's a certain amount of self-trust that comes from making and honoring commitments to do what you want to do <i>even after</i> it's \"too late\" or \"no longer worth it.\" For me, this entails a certain amount of self-loyalty: I'm willing to accept strange looks from waiters in order to save small amounts of food because I'm more loyal to the part of me that is possessive about food than I am to the social norms.</p><p>(I expect this is much easier above a certain confidence threshold, such that others say you are \"eccentric\" rather than \"a weirdo.\" Your mileage may vary. But don't take that as an excuse; I still strongly encourage you to show yourself that you are able to do the right thing even after it's \"too late\".)</p><p>I have found that there is significant power in signalling to myself that I'm willing and able to do the thing that I want to do, no matter how futile it may seem; that I'm willing to get as close to the target as possible even if I've already missed it. This prevents me from the impulse to \"fail with abandon\" in the first place.</p><h1>5</h1><p>This technique is one facet of a more general mindset that I find quite useful, which is that of \"loyalty to the self.\" I'll touch upon that general mindstate more next week.</p>", "user": {"username": "So8res"}}, {"_id": "YJjeCrAs8rcvu8zno", "title": "Meetup : Harvard College Effective Altruism presents:  Steven Pinker on \"The Past, Present, and Future of Violence\"", "postedAt": "2014-11-03T20:07:25.562Z", "htmlBody": "<html><body><h2>Discussion article for the meetup : <a href=\"/meetups/18\">Harvard College Effective Altruism presents:  Steven Pinker on &quot;The Past, Present, and Future of Violence&quot;</a></h2>\n\t\t  <div>\n\t\t\t\t<p>\n\t\t    \t<strong>WHEN:</strong> \n\t\t    \t<span>17 November 2014 07:00:00PM (-0500)</span><br>\n\t\t\t\t</p>\n\t\t\t\t<p>\n\t\t    \t<strong>WHERE:</strong> \n\t\t    \t<span>Science Center D, Harvard University</span>\n\t\t\t\t</p>\n\t\t  </div><!-- .meta -->\n\t\t  <div>\n\t\t    <div><p>&#x201C;The Past, Present, and Future of Violence.&#x201D;</p>\n\n<p>The past: Contrary to the popular impression view that we are living in extraordinarily violent times, rates of violence at all scales have been in decline over the course of history.</p>\n\n<p>The present: Human nature comprises faculties that encourage violence, such as dominance and revenge, but also faculties that inhibit it, such as self-control, empathy, and reason. The level of violence in a given society depends on how its norms and institutions affect the balance between them.</p>\n\n<p>The future: Professor Pinker speculates on which of the historical changes that reduced violence in the past will continue into the future.</p>\n\n<p>This lecture is open to the public.</p>\n\n<p>Hosted by Harvard College Effective Altruism.</p></div>\n\t\t  </div><!-- .content -->\n\t\t<h2>Discussion article for the meetup : <a href=\"/meetups/18\">Harvard College Effective Altruism presents:  Steven Pinker on &quot;The Past, Present, and Future of Violence&quot;</a></h2></body></html>", "user": {"username": "Angie_Jo"}}, {"_id": "yz5bqvG2sG92tLHmM", "title": "Open Thread 4", "postedAt": "2014-11-03T16:57:07.873Z", "htmlBody": "<html><body><p><span>Welcome to the fourth open thread on the Effective Altruism Forum. This is our place to discuss relevant topics that have not appeared in recent posts.</span></p></body></html>", "user": {"username": "RyanCarey"}}, {"_id": "a9s8tYStGawjX9WNb", "title": "Meetup : Stanford EA meetup", "postedAt": "2014-10-31T19:58:32.063Z", "htmlBody": "<html><body><h2>Discussion article for the meetup : <a href=\"/meetups/17\">Stanford EA meetup</a></h2>\n\t\t  <div>\n\t\t\t\t<p>\n\t\t    \t<strong>WHEN:</strong> \n\t\t    \t<span>02 November 2014 05:30:00PM (-0700)</span><br>\n\t\t\t\t</p>\n\t\t\t\t<p>\n\t\t    \t<strong>WHERE:</strong> \n\t\t    \t<span>Old Union, Lasuen Mall, Stanford CA 94305</span>\n\t\t\t\t</p>\n\t\t  </div><!-- .meta -->\n\t\t  <div>\n\t\t    <div><p>We&apos;re talking about development economics this week!</p></div>\n\t\t  </div><!-- .content -->\n\t\t<h2>Discussion article for the meetup : <a href=\"/meetups/17\">Stanford EA meetup</a></h2></body></html>", "user": {"username": "CarolineEllison"}}, {"_id": "JdpE5ZQcpR3G8NcPL", "title": "How Much Can We Generalize from Impact Evaluations? (link)", "postedAt": "2014-10-30T08:09:17.489Z", "htmlBody": "<html><body><p>Tyler Cowen posted a link to <a href=\"http://evavivalt.com/wp-content/uploads/2014/10/Vivalt-JMP-10.28.14.pdf\">this paper</a>(PDF), outlining how effective programs are when transported to new contexts, or scaled up by governments.</p>\n<p>Two key quotes:</p>\n<blockquote>\n<p>The program implementer is the main source of heterogeneity in results,</p>\n<p>with government-implemented programs faring worse than and being poorly predicted</p>\n<p>by the smaller studies typically implemented by academic/NGO research teams, even</p>\n<p>controlling for sample size</p>\n</blockquote>\n<div>and:</div>\n<div>\n<blockquote>\n<p>The average intervention-outcome combination is comprised 37% of positive, significant studies;</p>\n<p>58% of insignificant studies; and 5% of negative, significant studies. If a particular result is positive</p>\n<p>and significant, there is a 61% chance the next result will be insignificant and a 7% chance the</p>\n<p>next result will be significant and negative, leaving only about a 32% chance the next result will</p>\n<p>again be positive and significant.</p>\n</blockquote>\n</div>\n<div>This seems a gloomy diagnosis of the state of interventions. Small scale promising interventions usually have problems scaling.</div></body></html>", "user": {"username": "RomeoStevens"}}, {"_id": "MDTxRbcYYaaAZovRG", "title": "Meetup : Discussion with Jonathan Courtney from Giving What We Can", "postedAt": "2014-10-29T20:16:34.309Z", "htmlBody": "<html><body><h2>Discussion article for the meetup : <a href=\"/meetups/16\">Discussion with Jonathan Courtney from Giving What We Can</a></h2>\n\t\t  <div>\n\t\t\t\t<p>\n\t\t    \t<strong>WHEN:</strong> \n\t\t    \t<span>09 November 2014 12:00:00PM (-0700)</span><br>\n\t\t\t\t</p>\n\t\t\t\t<p>\n\t\t    \t<strong>WHERE:</strong> \n\t\t    \t<span>109 15th Ave, Seattle WA 98122</span>\n\t\t\t\t</p>\n\t\t  </div><!-- .meta -->\n\t\t  <div>\n\t\t    <div><p>NOTE: The meetup starts at 11:00am; I&apos;m not sure why it&apos;s displaying 12:00pm.</p>\n\n<p>&quot;Our regular monthly meetup:\nOver brunch, Jonathan Courtney will be talking with via video about the Giving What We Can pledge (<a href=\"https://www.givingwhatwecan.org/become-member\">https://www.givingwhatwecan.org/become-member</a> 10% of lifetime income to best charities for alleviating poverty). What the goal of the pledge is, what&apos;s expected of you etc.\nI&apos;m considering taking the pledge, so I&apos;m especially interested.\nI&apos;ll be making some vegan pancakes. Feel free to bring other breakfast items!&quot;\nFacebook event: <a href=\"https://www.facebook.com/events/854673011231806\">https://www.facebook.com/events/854673011231806</a></p></div>\n\t\t  </div><!-- .content -->\n\t\t<h2>Discussion article for the meetup : <a href=\"/meetups/16\">Discussion with Jonathan Courtney from Giving What We Can</a></h2></body></html>", "user": {"username": "riceissa"}}, {"_id": "ygNkcHYL5h5T2KA7S", "title": "How to leave money to charity in your will: a simple guide", "postedAt": "2014-10-29T16:57:43.758Z", "htmlBody": "<html><body><p><em>This will-writing guide will get periodic updates <a href=\"http://effectivealtruismhub.com/actions/leaving-money-to-charity-in-your-will\">here</a>. And you can now&#xA0;</em><em><a href=\"http://www.charityscience.com/donate-in-your-will.html\">get a free will by completing this form</a>.</em></p>\n<p>Many effective altruists will be interested in leaving some of their money to cost-effective charities when they die. In fact (2015 update!) Charity Science now has a <a href=\"http://www.charityscience.com/donate-in-your-will.html\">simple form</a> to make a will leaving money to GiveWell&apos;s recommended charities and they&apos;ll help you write your will for free. I&#x2019;ve also written the following guide to explain how to do so. It walks you through writing a will from start to finish; I&#x2019;ve based it on my own experience when I first did this a few years ago (with a lawyer&#x2019;s help), plus some additional research to cover people from the US, Canada and Switzerland. I hope that you will find it helpful - if you do, <a href=\"mailto:publicaddress@effectivealtruismhub.com\">I&#x2019;d love to hear from you</a>! If you have any other helpful tips on this subject, do leave them in the comments section.</p>\n<p>It&#x2019;s worth noting that, even leaving aside the fact that you may want to bequeath some of your money to charity, writing a will is a prudent thing to do. If you die without one, your assets will be distributed according to the law of your country rather than according to your own wishes. This could, for example, mean that your partner gets nothing if you&#x2019;re not married or in a civil partnership. That&#x2019;s worth avoiding.</p>\n<p>Just a few of the other reasons to take the time to write a will include:</p>\n<ul>\n<li>Reducing the inheritance tax incurred - leaving money to charity being an excellent way to do so.</li>\n<li>Making provision for your children if you have any, for example by choosing who will take care of them and setting aside funds for this.</li>\n<li>Making any other necessary provisions, such as for your pets, or your business, or other responsibilities that you have.</li>\n<li>Specifying what sort of funeral you would like, which will spare your family from having to make the decision.</li>\n<li>Declaring that you would like your organs donated, and/or your body donated to science. Be sure to tell your next of kin about this in case it comes up unexpectedly.</li>\n<li>Naming your executors (family members are a standard choice).</li>\n</ul>\n<h2>Step one: decide how much you want to leave to charity</h2>\n<p>The main choice here is whether you want to bequeath a fixed amount to your chosen charities, or else first make provision for your near and dear and then leave the remainder. If you go for the first option, you simply need to add a clause to your will specifying the amount and the charity or charities that you pick. If you pick the second option, you&#x2019;ll need to add a clause like the following at the end of your will:</p>\n<blockquote>&quot;MY TRUSTEES shall stand possessed of the residue of the said monies and of such of my estate as remains for the time being unsold UPON TRUST for [insert the charity that you pick], AND I DECLARE that the receipt of the Treasurer or other proper Officer for the time being of the aforesaid body shall be a good and sufficient discharge to my Trustees in respect of the same.&quot;</blockquote>\n<p>Here, &#x201C;the residue of the said monies&#x201D; means the money that is left over after the provisions made in previous clauses. For example, if you want to leave your personal effects and the first &#xA3;25,000 of your savings to a relative before giving the remainder to charity, you would first have your will state this, and afterwards add a clause like the above. The exact language comes from my own will, so has legal language appropriate to the UK; as I explain below, you should ensure that the language you use is appropriate in your jurisdiction.</p>\n<h2>Step two: pick a method for writing your will</h2>\n<p>One of the reasons why so many people die intestate every year is that they don&#x2019;t realise how easy writing a will really is unless your financial affairs or wishes are unusually complex. In most countries it is possible to do it yourself by using a template, although you should be aware that using a lawyer is the safest option as it will ensure that your will is valid.</p>\n<p>If you decide to make a DIY will, you&#x2019;ll want to find a template that is appropriate for your jurisdiction. Americans can start by <a href=\"http://www.docracy.com/doc/showalltagged?sortBy=3&amp;page=3&amp;tag=Will\">searching this list at Docracy</a>, an open collection of sample legal documents. Brits can find <a href=\"http://www.compactlaw.co.uk/free-legal-documents.html\">free templates at compactlaw.co.uk</a>, or buy a <a href=\"http://www.whsmith.co.uk/products/last-will-and-testament-diy-will-kit-valid-in-uk/90009259\">cheap DIY kit from WH Smith</a>. Canadians can use <a href=\"http://www.gblegalclinic.com/Will%20kit.pdf\">this guide</a>.</p>\n<p>If like me you&#x2019;re from the UK, there are several schemes which let you make a will with a lawyer for free. Every November many solicitors participate in <a href=\"http://www.willaid.org.uk/\">&#x2018;WillAid&#x2019;</a>, which is a free service in exchange for which they suggest you make a donation of about &#xA3;100 to charity - an offer which should appeal to EAs! Similarly, each September Scottish residents can get a will through <a href=\"http://www.willreliefscotland.co.uk/\">Will Relief Scotland</a> in exchange for a donation to a global poverty charity. And if you&#x2019;re 55 or over you can also take advantage of the <a href=\"http://freewillsmonth.org.uk/\">Free Wills Month scheme </a>in October.</p>\n<p>A final alternative is to pay a lawyer to make a will for you. Here, searching for a cheap online lawyer is a good approach. Right now, affordable options in the UK are <a href=\"http://www.quickonlinewills.com/\">quickonlinewills.com</a> and <a href=\"https://www.glosslegal.co.uk/\">glosslegal.co.uk</a>. Americans can use <a href=\"http://www.legalmatch.com/\">legalmatch.com</a>&#x2019;s search facility. Canadians can find a lawyer through the Law Society in their province.</p>\n<h2>Step three: consider inheritance tax</h2>\n<p>In most countries leaving money to charity will reduce the inheritance tax payable. For example, in the US gifts to charities are exempt from federal wealth transfer taxes, gift and estate taxes, and appear to be exempt from state taxes. In the UK a charitable legacy it will be deducted from your estate before the amount of inheritance tax is calculated, and if you leave over 10% of your estate&#x2019;s net value to charity, any part of your estate that is subject to inheritance tax will be taxed at 36% rather than 40%.</p>\n<h2>Step four: pick your charities and find out how to leave money to them</h2>\n<p>You&#x2019;ll need to specify your chosen charity or charities. Note that only charities that are tax-deductible in your country will entitle you to inheritance tax breaks. <strong>I&#x2019;ve made a <a href=\"http://effectivealtruismhub.com/actions/donating\">webpage which lets you find these</a> by selecting your charity and then following the resultant links.</strong></p>\n<p>Rather than specifying one particular charity, effective altruists may wish to bequeath money to whatever charities GiveWell considers most effective at the time they die (the examples I&#x2019;ve focused on in this guide). In the US, you can do this by leaving the money to GiveWell, earmarked for regranting to its recommended charities. They would then follow their recommended split across their top charities, just as they do when people donate via them for regranting. This is the split which they think does the most good, taking into account charities&#x2019; <a href=\"http://www.givewell.org/international/technical/criteria/scalability\">room for more funding</a> and other factors. It&#x2019;s the path I&#x2019;ve taken after talking to GiveWell employees about this, and one I&#x2019;d recommend for others.</p>\n<p>Either way - and especially if you&apos;ve specified an end charity rather than GiveWell, which is likely to stay in existence - it is a good idea to name fallbacks in case your beneficiaries aren&apos;t around when you end your days. You can name particular charities, but as a final fallback you should at least give disbursement instructions that your executors can follow whatever charities are around. Here is the flexible language that my solicitor advised me to include in my will, having told my executors (my immediate family) my wishes without having to put these into legally binding language:</p>\n<blockquote>But if the trusts hereinbefore declared shall fail or determine then and in that event my Trustees shall stand possessed of the said residue of my estate UPON TRUST to transfer pay or apply the same to or for such exclusively charitable institution or purpose or exclusively charitable institutions or purposes and if more than one in such proportions as my Trustees may in their absolute discretion select.</blockquote>\n<p>Here are some specific instructions for this step for people in living in the countries below:</p>\n<h3>US</h3>\n<p><a title=\"Find tax-deductible charities in your country\" href=\"http://effectivealtruismhub.com/actions/donating\"><img src=\"http://effectivealtruismhub.com/sites/effectivealtruismhub.com/media/images/icons-etc/flags/us.png\" alt=\"us\"></a></p>\n<p>Americans can leave money to GiveWell for regranting directly, leaving the money &#x201C;to GiveWell (Employer Identification Number: 20-8625442), earmarked for regranting to its recommended charities&#x201D;. Bequests require only stating the amount and naming the beneficiary, as in this sample wording.</p>\n<h3>Canada</h3>\n<p><a title=\"Find tax-deductible charities in your country\" href=\"http://effectivealtruismhub.com/actions/donating\"><img src=\"http://effectivealtruismhub.com/sites/effectivealtruismhub.com/media/images/icons-etc/flags/canada.png\" alt=\"canada\"></a></p>\n<p>Canadians can donate to proven global charities via Charity Science, the organisation that I work with, leaving the money &#x201C;to Charity Science (charity number: 80963 6236 RR0001) of Vancouver, BC&quot;. You can specify which charities you would like us to route your money to, and can discuss this with us by emailing <a href=\"mailto:joey@charityscience.com\">joey@charityscience.com</a></p>\n<h3>UK</h3>\n<p><a title=\"Find tax-deductible charities in your country\" href=\"http://effectivealtruismhub.com/actions/donating\"><img src=\"http://effectivealtruismhub.com/sites/effectivealtruismhub.com/media/images/icons-etc/flags/uk.png\" alt=\"uk\"></a></p>\n<p>You can bequeath money to GiveWell&#x2019;s recommended charities in the UK via the Giving What We Can Trust, with language like the following, from my own will:</p>\n<blockquote>&#x201C;MY TRUSTEES shall stand possessed of the residue of the said monies and of such of my estate as remains for the time being unsold UPON TRUST for the Giving What We Can Trust (Registered Charity Number: 1155773) of 6 Temple Mews, 6 Temple Road, Cowley, Oxford, OX4 2DY earmarked for GiveWell for regranting to GiveWell&apos;s recommended global poverty charities, at GiveWell&apos;s discretion, AND I DECLARE that the receipt of the Treasurer or other proper Officer for the time being of the aforesaid body shall be a good and sufficient discharge to my Trustees in respect of the same&#x201D;</blockquote>\n<p>Alternatively you can leave money to the Giving What We Can Trust directly and specify the charities to which it should be routed in an alternative way, such as following the Trust&#x2019;s default split (25% each to the charities that Giving What We Can recommends: AMF, SCI, Deworm the World and Project Healthy Children).</p>\n<h3>Switzerland and Germany</h3>\n<p><a title=\"Find tax-deductible charities in your country\" href=\"http://effectivealtruismhub.com/actions/donating\"><img src=\"http://effectivealtruismhub.com/sites/effectivealtruismhub.com/media/images/icons-etc/flags/switzerland.png\" alt=\"switzerland\"></a></p>\n<p>Swiss and German taxpayers can donate to GiveWell-recommended charities tax-efficiently via <a href=\"http://gbs-schweiz.org/\">GBS Schweiz</a> (one of the Swiss EA organisations). Instructions can be found <a href=\"http://gbs-schweiz.org/tax/\">here</a>, and if you wish to bequeath money via GBS you can contact them about this <a href=\"http://gbs-schweiz.org/informationen/kontakt/\">here</a>. They hope that this will soon be possible for Austrians too.</p>\n<h2>Step five: make your will</h2>\n<p>Now that you&#x2019;ve made the key decisions you can make your will via the method you picked in step two. You will need to sign and date it with witnesses, who will also need to sign it - in the UK, you need two witnesses, neither of whom can be beneficiaries. You&#x2019;ll then simply need to follow the requirements for storing it that apply in your country. Wills are often stored by solicitors, although in many countries you can instead keep a copy in a safe place at home. Either way, be sure to tell the executors that you&#x2019;ve named in your will where it is stored.</p>\n<h2>...and that&#x2019;s it</h2>\n<p>Armed with the above guide, you should now be able to write your own will, and - if you choose to do so - leave some of your money to the very best charities out there. Morbid though the topic inevitably is, I hope that some of you will find this helpful! If you use the guide or have any suggested additions to it then I&#x2019;d <a href=\"mailto:publicaddress@effectivealtruismhub.com\">love to hear from you</a>.</p>\n<p><em>Thanks to Therese Gj&#xF8;nnes, Jonas Vollmer, George McGowan and Peter Hurford for answers and feedback which helped me write this guide.</em></p>\n<p><em>See also: <a href=\"http://effectivealtruismhub.com/actions/donating\">How to donate to GiveWell charities tax-efficiently</a></em></p></body></html>", "user": {"username": "Tom_Ash"}}, {"_id": "XvHrFnSbT37GFLYme", "title": "Outreaching Effective Altruism Locally – Resources and Guides", "postedAt": "2014-10-28T01:58:14.236Z", "htmlBody": "<html><body><p>Do you want to start an EA group in your local area or University, or want to grow the effective altruism group that already exists? Do you want to give a     talk about effective altruism at your church or club or get involved in any other sort of local outreach? If so that&#x2019;s great! Growing the EA movement is     potentially one of the most high impact things that you can do with your spare time and sharing EA ideas with those around you can be effective and fun.     <br> <br> There are a huge amount of resources to help with outreach and in this post I have tried to collect all of them that I know. Enjoy.         <br> <br><br> <strong> <br> KEY RESOURCES             <br> </strong> <br> Here are the resources I find the most useful.         <br> <br> <strong>Getting started.</strong> The first resource I&#x2019;d recommend is this     <a href=\"https://docs.google.com/document/d/1Je-VilRVv5A5u0c9WWFf4wTrOs-Fqc0nLv9u-loiYzQ\">Guide to starting and running a local EA group</a> .     <br> <br> This guide for further <a href=\"https://docs.google.com/document/d/1L2aPnqFv5Q4rRt6bI5qx1h-GwU3bbcwtZLFQST-O02s/edit\">growing a group</a> might also be     useful     <br> <br> If that is not enough then various EA organisations have specific guides to starting up and running groups. Here are the links for the guides for<a href=\"https://docs.google.com/document/d/1LeaKwVGkj9Wl7ijLf2uR69eWvo9MUJmUVbXQJmsZNv0/edit\">THINK</a> (this is my second favourite guide),<a href=\"https://docs.google.com/document/d/1mRDbZgRIefzQ45w6T8xFuluFBFkIc0WNnUX5dpKqjuY\">Giving What We Can (GWWC)</a>,<a href=\"https://docs.google.com/document/d/1Csx6tMe_VO7eMANKccHOescWsKi1hYVfC7WVKg0bMtY/edit\">The Life You Can Save (TLYCS)</a> (short and sweet),<a href=\"https://docs.google.com/document/d/1MCaWs5oSsXPw2ODkzDOZ_8svNKvbCIfmn6BtQpAAnXE\">TLYCS - 2</a> (long version) and    <a href=\"http://wiki.lesswrong.com/mediawiki/images/c/ca/How_to_Run_a_Successful_Less_Wrong_Meetup_Group.pdf\">Less Wrong</a>.     <br><br> <strong>Events.</strong> For tips and ideas for running events see:     <br> <a href=\"https://docs.google.com/file/d/0B5tNAaAvGxc9Z0NLV0pkTUQwT00\">GWWC&#x2019;s event Guide</a> &#x2013; An in depth guide to running an event and specifics about running different types of events, especially talks and discussions.     <br> <a href=\"https://docs.google.com/document/d/1Y5ZLeeRNTrWJnoEs4tQ8p8ShknVX9vncCpEuE4ejmqo\"> [Guide] Tabling, activism, discussions, workshops &amp; quizzes </a> &#x2013; Lots of examples and ideas for different types of events that you could run (everything other than talks) and how to run them.     <br> <a href=\"http://www.thehighimpactnetwork.org/modules\">thehighimpactnetwork.org</a> &#x2013; Some pre-packaged events.     <br> <strong> <br> Inspiration. </strong> If you are looking for inspiration for what your groups should do then perhaps have a read of    <a href=\"https://docs.google.com/a/peterhurford.com/document/d/1cMyRqIwnPB_dBCEOkcueF2aQ67q9VbOPpY-JJzsLq3A/edit\">this document</a> where others have     shared how their EA groups are run.     <br> <br> <br><br> <strong> MORE RESOURCES         <br> <br> </strong> Over the years, effective altruist groups have developed volumes of further resources for community building. It is not always easy to find what you want     (and to be honest as someone who runs a local group I rarely look at much of this) but it can prove useful. The stuff I know about is:     <br> <br> <strong>GWWC&#x2019;s old resources.</strong> There is also a vast host of useful old GWWC resources such as old talks (and not finished talks), power point presentations, leaflets, useful facts,     useful images and so on. These resources all have a global poverty focus. These can be found spread across the following locations:     <br> - <a href=\"https://drive.google.com/folderview?id=0Byrm5bZmjP4qRnlYQWctbnJJYjA&amp;usp=drive_web\">GWWC Shared - Communication - Events</a> <br> - <a href=\"https://www.dropbox.com/sh/kit6abfpheo7t0b/AACe6T-QXwLY-G8B7ji7Dctoa?dl=0\">GWWC Shared Dropbox</a> <br> - <a href=\"https://www.dropbox.com/sh/3su7qcanfiplzrp/AAB5xB0TQddbhKRZL5SD-U1va?dl=0\">GWWC Chapters Dropbox</a> <br> <br> <strong>Guides to specific topics.</strong> On top of that GWWC and TLYCS and THINK all have public folders that contain various short guides on specific topics. For example there are useful guides on <a href=\"https://docs.google.com/presentation/d/1cdbrVeivIsWhy4KVRFCHJxKBDFcrCh25kfz4JQdOi1c\">using social media to start and grow a chapter</a>,<a href=\"https://docs.google.com/document/d/1O8yiwLg2jWP4RYKaD5MM0xtCr5VbsUt5OPrSdDZEtls/edit?usp=sharing\">book and film list</a>,<a href=\"https://drive.google.com/folderview?id=0BxRcSW9OHhuPVTAtVWRhdUswX3c&amp;usp=drive_web\">running a giving game</a>,<a href=\"https://drive.google.com/file/d/18zdeOy-S_8eZeER_86bRjI31PkARKKNK_wtLgSAe6bW6rnfRRcEpaNCZb8KE/view?usp=sharing\">persuasive speaking</a>,<a href=\"https://docs.google.com/document/d/15b9csPko4lJFFCPDl2h2e0EcAdY_VPbYk15yq0lnvEg/edit\">attracting speakers</a>,    <a href=\"https://docs.google.com/spreadsheet/ccc?key=0ArYS-LMvhlZWdDhqbXBKVGhHaVJVYkgydHh6VmFyNnc&amp;usp=sharing\">suggested speakers</a>, event ideas,     growing a chapter, and much much more. Those produced by GWWC and TLYCS all have a global poverty focus. Guides produced by THINK have a general EA focus     and are specifically targeted for student groups. These folders can be found at:     <br> - <a href=\"https://drive.google.com/#folders/0B9ou-zj3xxwbOW16N096d0tyUWc\">GWWC Chapter Resources</a> <br> - <a href=\"https://drive.google.com/folderview?id=0B5tNAaAvGxc9Qy00SUNNeVY4RVU&amp;usp=drive_web\">GWWC Chapter Workshop Resources</a> <br> - <a href=\"https://drive.google.com/folderview?id=0Bwh3yYYQPD1WZ2k2cHR3Skc2TVE&amp;usp=drive_web\">[TLYCS] Student Groups</a> <br> - <a href=\"https://drive.google.com/folderview?id=0BwwvTgW1FiT_VEtwZjNob2hTOXc&amp;usp=drive_web\">The Life You Can Save: Public Resources</a> <br> - <a href=\"https://drive.google.com/folderview?id=0B7YS-LMvhlZWaS0tRWxkX3VPbmc&amp;usp=drive_web\">THINK Shared</a> <br> <br> <strong> Stay in touch.         <br> </strong> If you have any questions good places to ask other people are:     <br> - <a href=\"https://www.facebook.com/groups/227236067388692\">GWWC Chapters facebook page</a> <br> - <a href=\"https://groups.google.com/forum/#!forum/ea-student-leaders\">EA Student leaders Google group</a> <br> <br><br> <br> <strong> ANYTHING ELSE?         <br> <br> </strong> I am sure this list is not complete. Feel free to comment below if you know of any other resources that people may find helpful.     <br> <br> Also you may notice that some of this is slightly disorganised and perhaps you will pick up on a typo or broken link. If you have the time to sort through,     organise or improve any of these resources then please do. Just get in touch with me or with whoever owns the relevant folder and offer to help.     <br></p></body></html>", "user": {"username": "weeatquince"}}, {"_id": "7JTZAuuohSGisPTvw", "title": "Upcoming Meetups 3", "postedAt": "2014-10-27T22:02:04.564Z", "htmlBody": "<html><body><p><a><img src=\"https://i.imgur.com/SiuBMIv.jpg\" alt=\"\"></a></p>\n<div><br></div>\n<div>Meetups coming up this fortnight are:</div>\n<div><br></div>\n<div>\n<li><a href=\"/meetups/11\">Vancouver</a>&#xA0;29 Oct 2014 18:00</li>\n<li><a href=\"/meetups/l\">Film Caf&#xE9; Oskar, Slachtstraat 5, Utrecht</a>&#xA0;02 Nov 2014 15:00</li>\n<li><a href=\"/meetups/15\">30 W Mifflin St, 6th Floor, Madison, Wisconsin 53703</a> 02 Nov 2014 18:08</li>\n<li><a href=\"https://www.facebook.com/events/714916321924243/\">Rob Mathers talks to GWWC in Oxford</a>, 06 Nov</li>\n<li><a href=\"/meetups/16\">109 15th Ave, Seattle WA 98122</a>&#xA0;09 Nov 2014 12:00</li>\n</div>\n<li><a href=\"/meetups/14\">Dot Impact Biweekly Meeting</a>&#xA0;09 Nov 2014 21:00</li>\n<div><br></div>\n<div>The photo is again from NTNU (EA Norway), captioned &apos;first meeting with new members and some old&apos;. And all in stunning dress, I might add!</div>\n<div><br></div>\n<div>This meetup announcement is one week late but I&apos;ll continue these announcements fortnightly!</div></body></html>", "user": {"username": "RyanCarey"}}, {"_id": "NW8RWuvitKeghuEaX", "title": "Meetup : .impact project updates meeting (via Google Hangouts)", "postedAt": "2014-10-27T07:00:09.491Z", "htmlBody": "<html><body><h2>Discussion article for the meetup : <a href=\"/meetups/14\">.impact project updates meeting (via Google Hangouts)</a></h2>\n\t\t  <div>\n\t\t\t\t<p>\n\t\t    \t<strong>WHEN:</strong> \n\t\t    \t<span>09 November 2014 10:00:00PM (+0000)</span><br>\n\t\t\t\t</p>\n\t\t\t\t<p>\n\t\t    \t<strong>WHERE:</strong> \n\t\t    \t<span>Tower of London, UK</span>\n\t\t\t\t</p>\n\t\t  </div><!-- .meta -->\n\t\t  <div>\n\t\t    <div><p><em>NB: this is a teleconference meeting which anyone can join, so the location&apos;s fictitious</em> This is the fortnightly .impact meeting for project updates, discussion, and any new ideas that people might be thinking about! It&apos;s on Sunday, 26 October at 10pm UTC/GMT. It&apos;s normally pretty brief, under an hour. We meet by Google Hangout; a Hangout link will be posted in the .impact Facebook event at the time, so people can join it:\n<a href=\"https://www.facebook.com/events/347179518785350/\">https://www.facebook.com/events/347179518785350/</a>\n(If you might come, put yourself down as a &apos;Yes&apos; or &apos;Maybe&apos; on that event.)</p></div>\n\t\t  </div><!-- .content -->\n\t\t<h2>Discussion article for the meetup : <a href=\"/meetups/14\">.impact project updates meeting (via Google Hangouts)</a></h2></body></html>", "user": {"username": "Tom_Ash"}}, {"_id": "ks7gHgFCzWZRjhLaH", "title": "Shop for Charity: how to earn proven charities 5% of your Amazon spending in commission", "postedAt": "2014-10-26T08:56:49.899Z", "htmlBody": "<p><strong>UPDATE: This link is no longer functional. We&apos;re leaving up this post as a record of the project, and so people can still view the comments.</strong></p><p>If you shop on Amazon in the countries listed below, you can earn a substantial commission for charity by doing so via the links below. This is a cost-free way to do a lot of good, so I&apos;d encourage you to do so! You can bookmark one of the direct links to Amazon below and then use that bookmark every time you shop.</p><p>The commission will be around 5%, though it varies by product category. This is substantially better than the AmazonSmile scheme available in the US, which only gives 0.5% of the money you spend to charity. Amazon&apos;s &apos;Associates Program&apos;&#xA0;pays this commission for referring purchasers to them, from the unaltered purchase price (<a href=\"https://en.wikipedia.org/wiki/Amazon.com#Third-party_sellers\">details here</a>). The money goes to Amazon accounts that I&apos;ve set up for this project, and from there I&apos;ll always direct it only to GiveWell-recommended charities. For ease of administration and to get tax-deductibility, I&apos;ll send it to the <a href=\"http://www.givewell.org/international/top-charities/schistosomiasis-control-initiative\">Schistosomiasis Control Initiative</a>&#xA0;until further notice, though if you make a large purchase which yields over &#xA3;50 of commission you can <a href=\"http://effectivealtruismhub.com/user/1/contact\">ask me</a> to donate it to another charity.</p><h2>Direct links to Amazon for your bookmarks</h2><p>If you&apos;d like to shop for charity, bookmark the appropriate link below now:</p><ul><li><a href=\"http://www.amazon.com/?tag=charity48-20\">US</a> </li><li><a href=\"http://www.amazon.ca/?tag=charity48ca-20\">Canada</a> </li><li><a href=\"http://www.amazon.co.uk/?tag=charity48-21\">UK</a> </li><li><a href=\"http://www.amazon.it/?tag=charity48it-21\">Italy</a> </li><li><a href=\"http://www.amazon.es/?tag=charity48esp-21\">Spain</a> </li><li><a href=\"http://www.amazon.de/?tag=charity48deutsch-21\">Germany and Austria</a> </li><li><a href=\"http://www.amazon.fr/?tag=charity48fr-21\">France</a> </li></ul><p></p><span><figure><img src=\"https://ir-na.amazon-adsystem.com/e/ir?t=effectivecharities-20&amp;l=ur2&amp;o=1\" class=\"draft-image \" style=\"\"></figure></span><span><figure><img src=\"https://ir-ca.amazon-adsystem.com/e/ir?t=effectivecharitiescanada-20&amp;l=ur2&amp;o=15\" class=\"draft-image \" style=\"\"></figure></span><span><figure><img src=\"https://ir-uk.amazon-adsystem.com/e/ir?t=effectcharit-21&amp;l=ur2&amp;o=2\" class=\"draft-image \" style=\"\"></figure></span><span><figure><img src=\"https://ir-es.amazon-adsystem.com/e/ir?t=effectchari03-21&amp;l=ur2&amp;o=30\" class=\"draft-image \" style=\"\"></figure></span><span><figure><img src=\"https://ir-de.amazon-adsystem.com/e/ir?t=effectchari00-21&amp;l=ur2&amp;o=3\" class=\"draft-image \" style=\"\"></figure></span><span><figure><img src=\"https://ir-it.amazon-adsystem.com/e/ir?t=effectchari0a-21&amp;l=ur2&amp;o=29\" class=\"draft-image \" style=\"\"></figure></span><p></p><p>I&apos;ll add other links here and on the main <a href=\"http://effectivealtruismhub.com/actions/shopping\">&apos;Shop for Charity&apos; page</a> later, including for France. I&apos;d love to <a href=\"http://effectivealtruismhub.com/user/1/contact\">hear</a> suggestions for good commission schemes in other countries.&#xA0;If you&apos;d like to share these links with friends and family, please point them to this page or even better <a href=\"http://effectivealtruismhub.com/actions/shopping\">this project&apos;s main page</a>, as this is the safest way to ensure that the commission gets earned.</p><p>Happy shopping!</p><p><em>&apos;Shop for Charity&apos; is a <a href=\"http://www.charityscience.com/\">Charity Science</a> project</em></p><p></p><span><figure><img src=\"http://www.keralapost.gov.in/images/parcels45224s.jpg\" class=\"draft-image \" style=\"\"></figure></span><p></p>", "user": {"username": "Tom_Ash"}}, {"_id": "oXy7wpRazXn7n2F8D", "title": "Meetup : .impact project updates meeting (via Google Hangouts)", "postedAt": "2014-10-23T11:34:41.170Z", "htmlBody": "<html><body><h2>Discussion article for the meetup : <a href=\"/meetups/13\">.impact project updates meeting (via Google Hangouts)</a></h2>\n\t\t  <div>\n\t\t\t\t<p>\n\t\t    \t<strong>WHEN:</strong> \n\t\t    \t<span>26 October 2014 09:00:00PM (+0000)</span><br>\n\t\t\t\t</p>\n\t\t\t\t<p>\n\t\t    \t<strong>WHERE:</strong> \n\t\t    \t<span>Tower of London, UK</span>\n\t\t\t\t</p>\n\t\t  </div><!-- .meta -->\n\t\t  <div>\n\t\t    <div><p><em>NB: this is a teleconference meeting which anyone can join, so the location&apos;s fictitious</em>\nThis is the fortnightly .impact meeting for project updates, discussion, and any new ideas people might be thinking about! It&apos;s on Sunday, 26 October at 9p UTC (5p Eastern, 2p Pacific, 9p in the UK as the clocks change that day). It&apos;s normally pretty brief, under an hour. We meet by Google Hangout; a Hangout link will be posted in the .impact Facebook event at the time, so people can join it:\n<a href=\"https://www.facebook.com/events/346860572105326/\">https://www.facebook.com/events/346860572105326/</a>\n(If you might come, put yourself down as a &apos;Yes&apos; or &apos;Maybe&apos; on that event.)</p></div>\n\t\t  </div><!-- .content -->\n\t\t<h2>Discussion article for the meetup : <a href=\"/meetups/13\">.impact project updates meeting (via Google Hangouts)</a></h2></body></html>", "user": {"username": "Tom_Ash"}}, {"_id": "fTyT8jF4ZGpBHPBRR", "title": "Meetup : Stanford THINK", "postedAt": "2014-10-23T02:10:42.641Z", "htmlBody": "<html><body><h2>Discussion article for the meetup : <a href=\"/meetups/12\">Stanford THINK</a></h2>\n\t\t  <div>\n\t\t\t\t<p>\n\t\t    \t<strong>WHEN:</strong> \n\t\t    \t<span>26 October 2014 04:30:00PM (-0700)</span><br>\n\t\t\t\t</p>\n\t\t\t\t<p>\n\t\t    \t<strong>WHERE:</strong> \n\t\t    \t<span>Old Union, 520 Lasuen Mall, Stanford, CA 94305</span>\n\t\t\t\t</p>\n\t\t  </div><!-- .meta -->\n\t\t  <div>\n\t\t    <div><p>Weekly EA discussion at Stanford</p></div>\n\t\t  </div><!-- .content -->\n\t\t<h2>Discussion article for the meetup : <a href=\"/meetups/12\">Stanford THINK</a></h2></body></html>", "user": {"username": "MichaelDickens"}}, {"_id": "9Xp7BGoKnbSiP3Ng8", "title": "Should Giving What We Can change its Pledge? ", "postedAt": "2014-10-22T16:40:35.480Z", "htmlBody": "<html><body><p>Giving What We Can is considering broadening the pledge it asks people to make. We&#x2019;d like to hear your thoughts about that idea!<a></a></p>\n<p>If the Effective Altruism movement increases in size (particularly with the release of books by Peter Singer and Will MacAskill) it will become very important to make sure that enthusiasm for effective altruism translates into impact. It might be easier to do that if there were a standard, concrete action everyone in the movement tended to take. One promising such action is donating 10% of our salaries (and committing to doing so). Currently, many people who identify as effective altruists join Giving What We Can. However, Giving What We Can&#x2019;s pledge is currently somewhat restrictive in cause areas it covers. Broadening Giving What We Can&#x2019;s pledge would be one way to bring together effective altruists and thereby increase the chance of enthusiasm for effective altruism translating into concrete actions and long-term commitment<span>. </span></p>\n<p>To work out if this plan is realistic, we need to know how many people actually would join Giving What We Can based on this change to the pledge. So bear in mind as you read this &#x2013; if you aren&#x2019;t yet a member of Giving What We Can, would you join if this change was made? Do you know others who would?</p>\n<p>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; The proposed pledge is: <em>I recognise that I can use part of my income to do a significant amount of good. Since I can live well enough on a smaller income, I pledge that for the rest of my life or until the day I retire, I shall give at least ten percent of what I earn to whichever organisations can most effectively use it to improve the lives of others, now and in the years to come. I make this pledge freely, openly, and sincerely.</em></p>\n<p>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; This differs from the current pledge (the full text of which is below) in two ways: it takes out &#x2018;in the developing world&#x2019; from the first sentence, and replaces &#x2018;to help people in the developing world&#x2019; with &#x2018;to improve the lives of others&#x2019; in the second sentence. Importantly, it continues to use the phrase &#x2018;organisations which can <strong>most</strong> effectively use it...&#x2019;. This is significant because most people think that the charity they donate to is effective, but to fulfil the pledge, they need to believe the far stronger claim that it is the most effective.</p>\n<p>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; This pledge gets to the heart of what we care about: that we should help people out of extreme poverty because we care about suffering and about making others better off, and because we are in a position to be able to help those in extreme poverty so much at so little cost to ourselves. We understand &#x2018;improving the lives of others&#x2019; to include organisations seeking to improve the welfare of animals.<span> </span>If Giving What We Can adopted the new pledge, it would mean that someone joining who believed that a particular organisation helped others even more than the most effective organisation improving the lives of those in developing countries would be fulfilling the pledge by donating to that organisation.</p>\n<p>Even if this change to the pledge were made, we plan to continue to focus on alleviating extreme poverty. Our mission, vision, values and branding would remain the same. We would continue to evaluate only global poverty charities (broadly construed as now, including for example climate change charities). We think that we can do more good by continuing to focus in this way &#x2013; it is our comparative advantage and it provides a concrete and motivating focus. There would be some changes to the website: for example to explain what the new pledge encompassed. We would likely have a page along on what causes other than poverty members might be interested in (for example, this might say a little about animal suffering and point interested people to ACE).</p>\n<p>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; Hopefully you&#x2019;ve now got a sense of our thoughts. So &#x2013; if you aren&#x2019;t yet a member of Giving What We Can, would a change like this prompt you to join? Do you know others you think would be prompted by it? Do you have any comments or suggestions on the wording of the new pledge? What do you think about the idea of our changing the pledge? We&#x2019;d love to hear from you, so please let us know your thoughts, whether by commenting below or <a href=\"mailto:communications@givingwhatwecan.org\">writing to us</a> privately!</p>\n<p>&#xA0;</p>\n<p>&#xA0;</p>\n<p><span>The current pledge: </span></p>\n<p><em>I recognise that I can use part of my income to do a significant amount of good in the developing world. Since I can live well enough on a smaller income, I pledge that for the rest of my life or until the day I retire, I shall give at least ten percent of what I earn to whichever organisations can most effectively use it to help people in developing countries, now and in the years to come. I make this pledge freely, openly, and sincerely.</em></p>\n<p>&#xA0;</p>\n<p><span>&#xA0;</span></p>\n<p><span>Further thoughts:</span></p>\n<p>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; If you&#x2019;re interested in more of our thinking about this question, below is the more detailed document we previously sent to members for comments:</p>\n<p>&#xA0;</p>\n<p><strong><span>What&#x2019;s the change?</span></strong></p>\n<p>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; We&#x2019;re considering changing the pledge to: <em>I recognise that I can use part of my income to do a significant amount of good. Since I can live well enough on a smaller income, I pledge that for the rest of my life or until the day I retire, I shall give at least ten percent of what I earn to whichever organisations can most effectively use it to improve the lives of others, now and in the years to come. I make this pledge freely, openly, and sincerely.</em><em></em></p>\n<p>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; This differs from the current pledge in two ways: it takes out &#x2018;in the developing world&#x2019; from the first sentence, and replaces &#x2018;to help people in the developing world&#x2019; with &#x2018;to improve the lives of others&#x2019; in the second sentence.</p>\n<p>&#xA0;</p>\n<p><strong><span>What would the change imply?</span></strong></p>\n<p>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; This broadens the pledge from only being about helping people in the developing world to being about those we can most effectively help whether inside or outside the developing world. It does not mean that people in rich countries would be likely to be fulfilling the pledge if they give to local charities, since we can typically do far more good for those in extreme poverty (which is why GWWC focuses on the charities it does). It does mean that people who think that the most effective way to prevent suffering is to donate to charities which help animals &#x2013; for example which try to eradicate factory farming &#x2013; would be fulfilling the pledge by donating to those organisations.</p>\n<p>The change is not likely to make a difference to people who think that the best way to help others is to ensure that the future will go well, since the pledge already explicitly includes people who will live in the future, as well as those alive now. (We already have members who believe, for example, that we should be trying to avert catastrophes in the future, and that that is the best way to help humanity, including those in the developing world.)</p>\n<p>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; Giving What We Can&#x2019;s focus would not change. Our mission and vision would remain the same, the website would continue to be oriented towards poverty, and the events we put on would continue to be about extreme poverty. We would continue to evaluate only global poverty charities (broadly construed, as it currently is, including (for example) climate change charities). This is somewhat similar to the fact that currently some people think that the biggest risk facing those in poverty is from biological terrorism, and those people might join GWWC and fulfil the pledge by donating to organisations that aim to fight bio-terrorism, but we do not evaluate charities of that kind.</p>\n<p>We would have an explanation of the fact that the pledge included charities other than ones directed towards extreme poverty on the FAQs page. We would likely have a page on the website along the lines of &#x2018;Beyond poverty&#x2019;. It would say something like: &#x2018;You might think that the most effective organisations are those working outside of the area of extreme poverty. If you think, for example, that the most effective organisations are those which work to prevent animals from suffering, we encourage you to check out Animal Charity Evaluators...&#x2019;</p>\n<p>&#xA0;</p>\n<p><strong><span>Why would we make the change? </span></strong></p>\n<p><strong>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; </strong>Giving What We Can is about ending extreme poverty, but it is also part of the effective altruism movement, which is about helping others as effectively as possible and making doing so a serious part of one&#x2019;s life. This idea has had some exposure so far (for example through GiveWell and the wide exposure of Peter Singer&#x2019;s TED talk). Over the coming year, two books on Effective Altruism are going to be published by William MacAskill and Peter Singer, which have a chance of making effective altruism more mainstream than it has been in the past. This brings with it increased risk of the term getting watered down, such that it does not change people&#x2019;s behaviour. Therefore, it seems sensible to have a clear action associated with effective altruism which is considered the minimum standard for people to do: donate 10% of their income to the most effective charities. The way we can really persuade others that this is the right thing to do, and encourage them to join us, is for a large number of us to stand together. At the moment the separation between organisations focusing on different cause areas seem to imply that you should make a commitment to helping one to the exclusion of the others. That seems antithetical to effective altruism: it seems better to avoid such fragmentation by having one clear commitment which unites us.</p>\n<p>&#xA0;</p>\n<p><strong><span>Issues we would need to work out: </span></strong></p>\n<p><!--[if !supportLists]-->-<span>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; </span><!--[endif]-->How the old and the new pledge would interact. One possibility would be for both pledges to exist in parallel, although new members encouraged to take the new pledge. Another possibility would be to simply replace the existing pledge for new people joining. In either case, we would give existing members a choice of whether to change to the new pledge or not.</p>\n<p><!--[if !supportLists]-->-<span>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; </span><!--[endif]-->How we made clear that Giving What We Can is focussed on poverty alleviation, but supports those who believe there are more effective ways of helping others. This is likely to be through the pages mentioned earlier.</p>\n<p><!--[if !supportLists]-->-<span>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; </span><!--[endif]-->The precise wording of the new pledge. In particular, one option we would consider is adding on to the first sentence something along the lines of &#x2018;...and that there is a large evidence base suggesting that some organisations are orders of magnitude more effective than others.&#x2019;&#xA0; This might help to ensure that people took a global rather than local focus when deciding which charities to donate to.</p>\n<p>&#xA0;</p>\n<p><strong><span>Alternatives we considered:</span></strong></p>\n<p><!--[if !supportLists]-->-<span>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; </span><!--[endif]-->There being a cause-neutral pledge which brings together people donating to different effective causes, but hosted by a different organisation. In particular, we discussed this in the context of Effective Altruism Outreach. This seems like it could be a worse option for a couple of reasons:</p>\n<p><!--[if !supportLists]--><span>o<span>&#xA0;&#xA0; </span></span><!--[endif]-->Giving What We Can has an infrastructure built up for people to take a pledge and join a community, including My Giving dashboards, a CRM, member newsletters etc. It would be a huge understanding to replicate this for a second organisation.</p>\n<p><!--[if !supportLists]--><span>o<span>&#xA0;&#xA0; </span></span><!--[endif]-->Giving What We Can is an established community with a large number of members, which has existed for a number of years and endeavoured to build up solidity and credibility. That seems likely to help both in encouraging people to join the community and in ensuring people take the commitment seriously and change their actions accordingly.</p>\n<p><!--[if !supportLists]--><span>o<span>&#xA0;&#xA0; </span></span><!--[endif]-->Having a number of different pledges is likely to lead to a fractured community. In addition, someone might &#xA0;initially feel that the most effective way of helping living creatures is to fight extreme poverty and later change their mind to thinking that the most effective way is to prevent factory farming. It seems like if they still intend to donate at least 10% of their income to the most effective charities, it would be better to support them in that than to say that they have leave GWWC and join a different community instead (unlike, for example, if someone decides they no longer want to rely on evidence to pick effective charities, or no longer wants to donate as much as 10% of their income).</p>\n<p><!--[if !supportLists]-->-<span>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; </span><!--[endif]-->Giving What We Can having multiple pledges &#x2013; the current one and a cause neutral one &#x2013; and allowing people to take whichever they would prefer. This seems to be a worse option to us because it would be confusing for people, particularly as the two seem so similar. This confusion could be reduced by having the cause neutral pledge be harder to find on the website, so that people only get to it if they are looking for it. But a large part of the point of the pledge is in order for people to stand up and be counted &#x2013; to publicly declare that they believe we are in the fortunate position that we can afford to donate at least 10% of our income to help others, and that we should think carefully about where we donate to. Therefore, a pledge that was deliberately difficult to find would seem to diminish a large part of the impact. We have in the past tried having multiple pledges &#x2013; we used to have a &#x2018;Give More Tomorrow&#x2019; pledge, because we had had requests from people for being able to commit to donating when they had a pay rise, or got their first job. Although the psychological literature seems to provide additional evidence that future pledges are effective, GMT did not catch on at all. It seemed merely to cause confusion. We would therefore be unwilling to institute two ongoing pledges again.</p>\n<p>&#xA0;</p>\n<p><strong><span>Potential concerns we have: </span></strong></p>\n<p><!--[if !supportLists]-->-<span>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; </span><!--[endif]-->Current members being against the change. That might be due to them disagreeing with the current pledge, or due to being unhappy about the idea of the Giving What We Can pledge changing. In order to try to work out to what extent our members will feel this way and whether there are ways to prevent or ameliorate it, we will be talking to them as much as possible throughout the decision process.</p>\n<p><!--[if !supportLists]-->-<span>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; </span><!--[endif]-->New members thinking that their pledge would be fulfilled by donating to a charity in their local area, rather than considering charities on a global scale. We think that the website as a whole, and our recommended charities in particular, will make clear that this isn&#x2019;t the case. We also try to talk to people both before and after they become members. Therefore, we have multiple opportunities to make sure that people fully understand the pledge.</p>\n<p><!--[if !supportLists]-->-<span>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; </span><!--[endif]-->That the broader idea of &#x2018;helping others as much as possible&#x2019; is not as appealing as specifically helping people in extreme poverty. We are less worried about this than we used to be, because we had assumed that the idea of &#x2018;effective altruism&#x2019; would be entirely unappealing to people, and that has turned out not to be the case (given, for example, Singer&#x2019;s TED talk). In addition, the extent to which people find the ideas compelling and plausible does not depend just on what the core idea is, but also on what ideas are presented first and context. Right now, all of our members care about helping those in the developing world as effectively as possible, and the fact that some people think that the best way to do that is to ensure that the far future goes well does not seem off-putting to those who think that only current people matter.</p>\n<p><!--[if !supportLists]-->-<span>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; </span><!--[endif]-->Confusion over the fact that Giving What We Can is focused on preventing extreme poverty, but that its members also donate to other causes. It is difficult to know how much confusion this might cause. So far we have not had a problem with people finding it strange that one could think that the best way to help those in the developing world was to work to avoid e.g. biohazards, even though Giving What We Can does not deal with charities of that kind. It does not seem particularly surprising that Giving What We Can would need to have a focus area for its research, and for the talks it gave, even if some of its members cared about and donated to a broader range of organisations than those in that focus area.</p>\n<p>After much thought about the various considerations at play, the Giving What We Can staff and the trustees are all inclined to think that changing the pledge as above is the best course of action. It wouldn&#x2019;t involve a change in the focus of what Giving What We Can works on, or its research. But we&#x2019;re really excited about possibility it provides for bringing together people who all want to help the world as effectively as possible and are willing to donate a significant portion of their income to doing so. We hope that this change would ensure that as the effective altruist movement grows it continues to inspire real change in people&#x2019;s actions towards helping others as much as we can. &#xA0;</p></body></html>", "user": {"username": "Michelle_Hutchinson"}}, {"_id": "t49q8tNxFoDhdyiYB", "title": "The Harvard Research Center in Creative Altruism", "postedAt": "2014-10-21T23:33:59.138Z", "htmlBody": "<html><body><p>I just happened upon this long bygone research institute in my own research. Established by Pitirim A. Sorokin - established and headed the first sociology department at the university - at Harvard sometime around the mid-twentieth century. Unfortunately, I don&apos;t have time to pursue its archives/work at the moment. Thought I would throw it out here if anyone else was interested.</p>\n<p>From my impression, a lot of the output is methodologically suspect if not subsumed or transcended by subsequent work. Nevertheless, some real intellects work at the institute. Might be worth briefly excavating, if only for a very interesting historical antecedent- a footnote in effective altruism.</p></body></html>", "user": {"username": "Geuss"}}, {"_id": "utSBRjbPNLPFNXKZd", "title": "Charity Science's first annual review: how effective is fundraising?", "postedAt": "2014-10-21T07:45:38.200Z", "htmlBody": "<html><body><p><em>Here is <a href=\"http://www.charityscience.com/\">Charity Science</a>&apos;s one year review, cross-posted from our website for those of you interested in reading about our progress so far.&#xA0;</em></p>\n<p>In this internal review, we describe and evaluate Charity Science&#x2019;s progress after its first year of operations. We mainly focus on the most recent 6 months, as we have already shared information on and results from our <a href=\"http://www.charityscience.com/operations-details/6-month-review-of-the-grant-writing-experiment\">first 6 month experiment</a>. However we have compiled yearly totals for important metrics such as money moved to effective charities.</p>\n<p>This review focuses on hard metrics rather than offering an in-depth narrative description of the lessons we have learned or how well we felt specific fundraising strategies succeeded. That information is linked to in the section below describing our experiments.</p>\n<p>We also want to thank our volunteers and donors for making it all possible. This could not have been accomplished without everybody&#x2019;s combined efforts. This report is a list of everything we have managed to achieve. We look forward to seeing how many people we will be able to help next year.</p>\n<h1>Summary</h1>\n<ul>\n<li> We raised 4.5 times more money in our second 6 months than in our first 6 months, which is a substantial improvement. </li>\n<li> We moved $55,974 to effective charities over the last year. Taking into account our costs, this means that for every dollar we spent we raised $3.70. </li>\n<li> We will be continuing with Charity Science. Our plans will be published on <a href=\"http://www.charityscience.com/operations-details\">our operations blog</a> at a later date. </li>\n</ul>\n<h1>Historic goals</h1>\n<p>We view money moved as the best reflection of awareness of and support for our proven charities. Here are the goals we have previously set for this:</p>\n<p>Goal from July 2013:</p>\n<ul>\n<li> $50,000 over 1 year (around what we could donate doing earning to give) </li>\n</ul>\n<p>Benchmarks from April 2014:</p>\n<ul>\n<li> If we move less than $20,000 (over the year) to effective charities then shut down </li>\n<li> If we move $20,000-$40,000 then keep going but only in a lean and experimental mode </li>\n<li> If we move over $50,000 then consider expansion </li>\n</ul>\n<h1>In-depth reports on our experiments</h1>\n<p>Here are the experiments we have conducted, with reports and data on them:</p>\n<h2>Grant writing</h2>\n<ul>\n<li> <a href=\"http://www.charityscience.com/grant-writing.html\">Summary</a> </li>\n<li> <a href=\"http://www.charityscience.com/operations-details/grants-fundraising-overview-and-lessons-learned\"> Lessons learned and overview </a> </li>\n<li> <a href=\"http://www.charityscience.com/operations-details/6-month-review-of-the-grant-writing-experiment\"> Six month review of grant writing </a> </li>\n</ul>\n<h2>Networking</h2>\n<ul>\n<li> <a href=\"http://www.charityscience.com/networking.html\">Summary</a> </li>\n<li> <a href=\"http://www.charityscience.com/operations-details/what-we-have-learned-in-networking\">Lessons learned</a> </li>\n<li> <a href=\"http://www.charityscience.com/operations-details/6-month-review-of-networking\">6 month review of networking</a> </li>\n</ul>\n<h2>Events</h2>\n<ul>\n<li> <a href=\"http://www.charityscience.com/events1.html\">Summary</a> </li>\n<li> <a href=\"http://www.charityscience.com/operations-details/lessons-learned-from-our-event\">Lessons learned</a> </li>\n</ul>\n<h2>Matching</h2>\n<ul>\n<li> <a href=\"http://www.charityscience.com/operations-details/the-power-of-donation-matching\">6 month review of matching</a></li>\n</ul>\n<h1>Timeline</h1>\n<p>Here is a rough timeline of our activities so far:</p>\n<ul>\n<li> <strong>Grant writing:</strong> July - December 2013 (6 months) </li>\n<li> <strong>Planning next steps and charity evaluation:</strong> December 2013 - February 2014 (3 months) </li>\n<li> <strong>Networking:</strong> February - August 2014 (7 months) </li>\n<li> <strong>Events:</strong> July - September (3 months) </li>\n</ul>\n<p>We spent about 3 months working full time on planning and reviewing charities as well as some unrecorded time before we started working on this project full time. During this time we also worked on re-branding and getting charitable status.</p>\n<p>We spent about 12 months doing full time fundraising, with the team spending about 78 hours per week on this. The breakdown of this time was as follows:</p>\n<ul>\n<li> 6 months on grant writing </li>\n<li> 3 months on planning/research/operations </li>\n<li> 3 months on networking </li>\n<li> 1.5 months on the event </li>\n<li> 1.5 months on logistics/website/reports/email </li>\n</ul>\n<p>Here is a breakdown of our time over the most recent 6 months:</p>\n<p><img src=\"http://tog.philosofiles.com/uploads/linked-elsewhere/websites/charity-science/posts/2014-10-21-first-annual-review/time-spent-over-last-6-months.png\" alt=\"\"></p>\n<p>A breakdown of our time over our first 6 months can be seen <a href=\"http://www.charityscience.com/grant-writing.html\">here</a>.</p>\n<p>The total cost of these activities (including salaries) was around $15,000. This is lower than the total we spent as we spent a portion of our personal savings to cover various costs.</p>\n<p>We spent about $12,000 on salaries (three full time staff, two of whom worked full time on these fundraising projects), and about $3,000 on other expenses. At some points we experienced financial pressures due to not receiving a large donation which we were expecting. We plan on raising more money for operating expenses at the start of 2015 to guarantee that this does not happen again and slow down our work.</p>\n<h1>Money moved by category</h1>\n<p><img src=\"https://www.charityscience.com/uploads/1/0/7/2/10726656/6040483_orig.png\" alt=\"Picture\"></p>\n<p>These figures are in Canadian dollars. More donations are coming in in these categories, so we will update them periodically to reflect this.</p>\n<p>The totals above exclude $5,875 in donations ($11,750 counting the match) and the Google Grants that we obtained for various charities, because it was unclear whether these would have happened without our work, and unclear how much money in donations a Google Grant is worth. We suspect that many organizations would include these numbers in their totals. We also expect that several donations were made that we were unable to track this year due to our directly pointing people to GiveWell or to our proven charities, but we do not have a concrete estimate of their total size. We only counted donations for which we had tax receipts (or other solid proof that the donation was made), and which we were convinced could be attributed to a Charity Science staff member or volunteer project.</p>\n<h1>Money moved by charity</h1>\n<p>This is the total counterfactual amount donated over the last 6 months, organized by which charity it went to. Evidence Action got the most donations due to being the charity for which we fundraised through our charity event. SCI did not get very much due to us mainly promoting Evidence Action as the deworming charity and GiveDirectly as the cash transfer charity.</p>\n<ul>\n<li> Evidence Action - $22,812 CAD including match </li>\n<li> Give Directly - $20,428* CAD including match </li>\n<li> GiveWell unrestricted - $2,000 CAD including match </li>\n<li> SCI - $724 CAD including match </li>\n</ul>\n<p>* A few donations have been made and counted in these numbers but not processed until we acquire charitable status in Canada</p>\n<p>Below is a chart of the total amount moved to each charity (including funds from the match) over the last year to provide a visual sense of which charities got the most donations.</p>\n<h1>Money moved to effective charities by time period</h1>\n<p>Over our first 6 months: ~$10,000</p>\n<p>Over our second 6 months: ~$45,974 (including funds from the match)</p>\n<p><img src=\"http://tog.philosofiles.com/uploads/linked-elsewhere/websites/charity-science/posts/2014-10-21-first-annual-review/monthly-graph.png\" alt=\"\"></p>\n<p>The large boost later on is mainly due to our Charity Science Walk (in September) and scaling up our birthday fundraising campaign (in August and September).</p>\n<p><strong>Ratio: 3.7:1</strong> (over the year)</p>\n<h1>Conclusions</h1>\n<ul>\n<li> We think that our grant writing experiment during our first 6 months was not successful. </li>\n<li> We think that our experiments over our second 6 months were relatively successful. </li>\n<li> We have been improving at fundraising significantly and feel that we will continue to do so over time. </li>\n<li> We currently think that Charity Science is worth continuing (with some large changes and improvements). </li>\n</ul>\n<p>We are currently writing a separate post describing our future plans, including the changes and improvements referred to above. Look out for that on our operations blog, or consider subscribing to our operations blog&apos;s <a href=\"http://www.charityscience.com/2/feed\">RSS feed</a>.</p></body></html>", "user": {"username": "Joey"}}, {"_id": "4MCkuXk8GrcP9MJGP", "title": "Meetup : How to Evaluate a Charity Meetup", "postedAt": "2014-10-20T21:58:52.957Z", "htmlBody": "<html><body><h2>Discussion article for the meetup : <a href=\"/meetups/11\">How to Evaluate a Charity Meetup</a></h2>\n\t\t  <div>\n\t\t\t\t<p>\n\t\t    \t<strong>WHEN:</strong> \n\t\t    \t<span>29 October 2014 06:00:00PM (-0700)</span><br>\n\t\t\t\t</p>\n\t\t\t\t<p>\n\t\t    \t<strong>WHERE:</strong> \n\t\t    \t<span>Vancouver</span>\n\t\t\t\t</p>\n\t\t  </div><!-- .meta -->\n\t\t  <div>\n\t\t    <div><p>This is a general social meetup and the topic of discussion is how to evaluate a charity. We will be discussing what factors are important when choosing which charities to support. This includes considerations such as how well is it organized and how strong is the reference class.</p>\n\n<p><a href=\"http://www.meetup.com/Effective-Altruism/events/214440512/\">http://www.meetup.com/Effective-Altruism/events/214440512/</a></p></div>\n\t\t  </div><!-- .content -->\n\t\t<h2>Discussion article for the meetup : <a href=\"/meetups/11\">How to Evaluate a Charity Meetup</a></h2></body></html>", "user": {"username": "Joey"}}, {"_id": "FpjQMYQmS3rWewZ83", "title": "Effective Altruism is a Question (not an ideology)", "postedAt": "2014-10-16T04:16:15.951Z", "htmlBody": "<p><em>What is the definition of Effective Altruism? What claims does it make? What do you have to believe or do, to be an Effective Altruist?</em></p>\n<p>I don’t think that any of these questions make sense.&nbsp;</p>\n<p>It’s not surprising that we ask them: if you asked those questions about feminism or secularism, Islamism or libertarianism, the answers you would get would be relevant and illuminating. Different proponents of the same movement might give you slightly different answers, but synthesising the answers of several people would give you a pretty good feeling for the core of the movement.</p>\n<p>But each of these movements is <em>answering </em>a question. Should men and women be equal? (Yes.) What role should the church play in governance? (None.) What kind of government should we have? (One based on Islamic law.) How big a role should government play in people’s private lives? (A small one.)&nbsp;</p>\n<p>Effective Altruism isn’t like this. Effective Altruism is <em>asking </em>a question, something like:&nbsp;</p>\n<blockquote>\n<p>“How can I do the most good, with the resources available to me?”</p>\n</blockquote>\n<p>There are <a href=\"http://blog.givewell.org/2013/08/13/effective-altruism/\">some</a>&nbsp;<a href=\"http://effectivealtruism.org/\">excellent</a>&nbsp;<a href=\"https://80000hours.org/2012/03/what-is-an-effective-altruist/\">introductions</a> to Effective Altruism out there. They often outline common conclusions that Effective-Altruism-style thinking leads to: things like <a href=\"https://80000hours.org/earning-to-give/\">earning to give</a>, or favouring interventions in <a href=\"http://www.givewell.org/giving101/Your-dollar-goes-further-overseas\">poorer countries</a> over those in richer countries. This makes sense - Effective Altruism does seem to imply that those things are a good idea - but it doesn't make the conclusions part of the core of the movement.</p>\n<p>&nbsp;</p>\n<h2>What does this mean for how we think and talk about Effective Altruism?</h2>\n<p>Reframing Effective Altruism as a question has some pretty significant implications. These aren’t necessarily new – some people already act on the points below. But I think they are worth thinking about explicitly.&nbsp;</p>\n<p><strong>1. We should try to avoid calling ourselves “effective altruists”</strong></p>\n<p>Feminist, secularist, Islamist, environmentalist... it’s not surprising that people who think Effective Altruism is interesting and important want to switch the “-ism” into an “-ist”, and use it to refer to themselves. The linguistic part of our brain does it automatically.</p>\n<p>But there’s a big problem with this. “Effective Altruism” is a carefully and cleverly chosen name, and it describes its own core question succinctly. But it does this by combining a common adjective with a common noun, which means that changing the last syllable gives you not an identifier, but a truth claim.</p>\n<p>“I am an effective altruist” may sound to the speaker like “I think Effective Altruism is really important”, but to the listener, it sounds like “I perform selfless acts in a manner that is successful, efficient, fruitful or efficacious.” (Thesauruses are fun!)</p>\n<p>Effective Altruism is already a slightly impudent name, since its claim to be a ground-breaking idea rests on the premise that other altruism is ineffective.</p>\n<p>Calling oneself an effective altruist is much worse. As well as provoking scepticism or hostility, it automatically leads into questions like “Can I [x] and still be an effective altruist?” “How much do I have to donate to be an effective altruist?” “How does an effective altruist justify spending money on anything beyond bare survival?” These questions feel like they should have meaningful answers, but trying to answer them <a href=\"http://lesswrong.com/lw/np/disputing_definitions/\">probably won't get us very far</a>.</p>\n<p>Alternative descriptors include “aspiring effective altruist”, “interested in Effective Altruism”, “member of the Effective Altruism movement”… What do you think of those options? Do you have others? When could it still be appropriate to use “effective altruist”?</p>\n<p><strong>2. Our suggested actions and causes are best guesses, not core ideas</strong></p>\n<p>It’s extremely important that Effective Altruism does get translated into actions in the real world. To date, the most concrete of concrete suggestions come from <a href=\"http://givewell.org\">GiveWell</a>, in the form of charity recommendations. GiveWell itself is extremely good at revising its recommendations in line with the best information and analysis available to them. They never claim that cash transfers or deworming are part of their key agenda.</p>\n<p>Effective Altruism enthusiasts who support common EA causes like animal rights, extreme poverty reduction or the welfare of future generations need to keep this in the back of their minds. It is not coincidental that these causes are prominent within Effective Altruism – each does seem to offer significant opportunities to do good.</p>\n<p>But they can only be so prominent while they appear to be areas where a great positive impact can be made. As soon as our understanding of what can best make the world a better place changes, our actions and priorities must also change.</p>\n<p>This also means that...</p>\n<p><strong>3. We can honestly tell others that we want to be persuaded that their cause is better</strong></p>\n<p>It’s very tempting, having found the Effective Altruism movement, to think that you have discovered the Way To Fix The World and need only share it with others to make everything better. But this just isn’t the case.</p>\n<p>We don’t know how to think about political change. We can’t measure the long term effects of increased education for poor children. We have no good way to compare the potential gains from researching cures with the immediate gains of treatment.</p>\n<p>So when someone new to Effective Altruism starts talking about the cause they find most important – especially if it’s someone you think is thoughtful and intelligent – don’t brush it off, or tell them that the Best Thing To Do has already been found and their thing is <a href=\"/ea/7x/supportive_scepticism/\">obviously worse</a>. Ask them about it!</p>\n<p>It’s really unusual for someone who supports a movement to actively want to <a href=\"http://lesswrong.com/lw/jy/avoiding_your_beliefs_real_weak_points/\">change their mind</a>. But that’s the position that every aspiring Effective Altruist is in.&nbsp;</p>\n<p>Anyone who can help us answer the question we care most about is a valuable ally. We can and should tell anyone who disagrees with our object-level beliefs that we really, truly want to be persuaded to think otherwise. This will not only make it easier for them to take us seriously - it will also increase the chances that we direct our efforts well.</p>\n<p>&nbsp;</p>\n<p><strong>In short:</strong> thinking of Effective Altruism as a question rather than a particular set of beliefs or policies has some interesting and useful implications. It makes questions of what “counts” as an Effective Altruist or an Effective Altruism organisation moot – if you’re honestly trying to figure out how to do the most good, that’s that. It shows that Effective Altruism isn't all about donating to health interventions in Africa. It reminds us that we still don't really know how to be effective altruists.</p>\n<p>I can imagine a hypothetical future in which I don’t agree with the set of people that <a href=\"https://www.google.com.au/url?sa=t&amp;rct=j&amp;q=&amp;esrc=s&amp;source=web&amp;cd=1&amp;cad=rja&amp;uact=8&amp;ved=0CB8QFjAA&amp;url=http%3A%2F%2Fwww.paulgraham.com%2Fidentity.html&amp;ei=mdQ8VJS7NY3W8gXm_4K4CA&amp;usg=AFQjCNEkETv7iiXCaMdIVvn0FxIBhW1iww&amp;sig2=efMJoYTspsiafZiaKlxMwg&amp;bvm=bv.77161500,d.dGc\">identify</a> with the “EA movement”. But I can’t imagine a future where I’m not trying to figure out how to answer the question \"How can I do the most good?\"</p>", "user": {"username": "HelenToner"}}, {"_id": "zHQaSBxqNFPHQMLgk", "title": "Open Thread 3", "postedAt": "2014-10-15T17:04:02.457Z", "htmlBody": "<html><body><p><span>Welcome to the third open thread on the Effective Altruism Forum. This is our place to discuss relevant topics that have not appeared in recent posts. Thanks to an upgrade by Trike Apps, each time you visit the open thread, new comments will now be highlighted!</span></p></body></html>", "user": {"username": "Diego_Caleiro"}}, {"_id": "L9tpuR6ZZ3CGHackY", "title": "On Progress and Prosperity", "postedAt": "2014-10-15T07:03:21.055Z", "htmlBody": "<html><body><p>I often encounter the following argument, or a variant of it:</p>\n<blockquote>\n<p>Historically, technological, economic, and social progress have been associated with significant gains in quality of life and significant improvement in society&apos;s ability to cope with challenges. All else equal, these trends should be expected to continue, and so contributions to technological, economic, and social progress should be expected to be very valuable.</p>\n</blockquote>\n<p>I encounter this argument from a wide range of perspectives, including most of the social circles I interact with other than the LessWrong community (academics, friends from school, philanthropists, engineers in the bay area). For example, Holden Karnofsky writes about the general positive effects of progress <a href=\"http://blog.givewell.org/2013/05/15/flow-through-effects/\">here</a>&#xA0;(I agree with many of these points). I think that similar reasoning informs people&apos;s views more often than it is actually articulated.</p>\n<p><strong>I disagree with this argument</strong>. This disagreement appears to be responsible for many of my other contrarian views, and to have significant consequences for my altruistic priorities; I discuss some concrete consequences at the end of the post. (The short summary is that I consider differential intellectual progress to be an order of magnitude more important than absolute intellectual progress.) In the body of this post I want to make my position as clear as possible.&#xA0;</p>\n<p>My impression is that I disagree with the conventional view because (1) I take the long-term perspective much more seriously than most people, (2) I have thought at more length about this question than most people. But overall I remain a bit hesitant in this view due to its unpopularity. Note that my view is common in the LessWrong crowd and has been argued for elsewhere. In general I endorse significant skepticism for views which are common amongst LessWrong but unpopular in the wider world (though I think this one is unusually solid).</p>\n<h1>Values</h1>\n<p>I suspect that one reason I disagree with conventional wisdom is that I consider the welfare of individual future people to be nearly as valuable as the welfare of existing people, and consequently the collective welfare of future people to be <a href=\"https://docs.google.com/viewer?a=v&amp;pid=sites&amp;srcid=ZGVmYXVsdGRvbWFpbnxuYmVja3N0ZWFkfGd4OjExNDBjZTcwNjMxMzRmZGE\">substantially more important</a> than the welfare of existing people.</p>\n<p>In particular, I think the original argument is accurate--and a dominant consideration--if we restrict our attention to people living over the next 100 years, and perhaps even the next 500 years. (Incidentally, most serious intellectuals appear to consider it unreasonable to have a view that discriminates between &quot;Good for the people living over the next 500 years&quot; and &quot;Good for people overall.&quot;)</p>\n<p>Some people who raise this argument consider the welfare of far future people to be of dubious or reduced moral value. But many people who raise this argument purport to share a long-term, risk-neutral, aggregative perspective. I think that this latter group is making an empirical error, which is what I want to address here.</p>\n<p>Incidentally, I hope that in the future the EA crowd adopts a more reasonable compromise between long-term, species-agnostic, risk-neutral utilitarianism, and more normal-looking intuitions that by behaving morally we can collectively make all of our lives much better. It seems most EA&apos;s grant that there is a place for selfishness, but often reject conventional behaviors which collectively benefit the modern developed world.</p>\n<p>I think that part of the resistance to anti-progress arguments comes from the desire to recover conventional pro-social behavior, without explicit recognition of that goal.</p>\n<h1>This is a painful disagreement</h1>\n<p>This is a painful disagreement for me for two reasons.</p>\n<p><strong>First</strong>, I believe that society at large <em>substantially</em>&#xA0;underestimates the welfare gains from economic and technological progress. Indeed, I think that given an exclusive concern for the next few generations, these should probably be overwhelming concerns of a would-be altruist. I could talk at length about this view and the errors which I think underly conventional views, but it would be a digression.</p>\n<p>In light of this, I find it extremely unpleasant to find myself on the anti-progress side of almost any argument. First, because I think that someone sensible who learns my position will rationally assume that I am guilty of the most common errors responsible for the position, rather than making a heroically charitable assumption. Second, I have a visceral desire to argue for what I think is right (I hear the call of someone being wrong on the internet), and in most everyday discussions that means arguing for the merits of technological and economic progress.</p>\n<p><strong>Second</strong>, I think that pursuing plans which result in substantially slower growth comes at a material expense for the people alive today, and especially for their children and grandchildren. For the same reason that I would be uncomfortable hurting those around me for personal advantage, I am uncomfortable hurting those around me in the service of utilitarian ends (a problem much exacerbated by the erosion of the act-omission distinction).</p>\n<p>[In fact I mostly do try to be a nice guy; in part this is due to the good effects of not-being-a-jerk (which are often substantial), but it&apos;s also largely due to a softening of the aggregate-utilitarian perspective and a decision-theoretic view partially calibrated to reproduce intuitions about what we ought to do.]</p>\n<h1>Why I disagree</h1>\n<p>For reference, the argument in question:</p>\n<blockquote>\n<p>Historically, technological, economic, and social progress have been associated with significant gains in quality of life and significant improvement in society&apos;s ability to cope with challenges. All else equal, these trends should be expected to continue, and so contributions to technological, economic, and social progress should be considered highly valuable.</p>\n</blockquote>\n<h3>[Meta]</h3>\n<p>This is an instance of the general schema &quot;In the past we have observed an association between X [progress] and Y [goodness]. This suggests that X is generally associated with Y, and in particular that this future instance of X will be associated with Y.&quot;</p>\n<p>I have no problem with this schema in general, nor with this argument in particular. One way of responding to such an argument is to offer a clear explanation of why X and Y have been associated in the observed cases. This then screens off the evidence about the general association of X with Y; if the clear explanation doesn&apos;t predict that X and Y will be associated in the future, this undermines the predicted association.</p>\n<h3>[Object level]</h3>\n<p>In this case, it seems clear that greater technological capabilities at time T lead to improved quality of life at time T. This is a very simple observation, robustly supported by the historical record. Moreover, it is also clear that improved technological capabilities at time T lead to improved technological capabilities at time T+1. And I could make similar statements for economic progress, and arguably for social progress.</p>\n<p>Once we accept this, we have a clear explanation of why faster progress leads to improvements in quality of life. There is no mysterious correlation to be explained.</p>\n<p>So now we might ask: do the same mechanisms suggest that technological progress will be good <em>overall</em>, on aggregate utilitarian grounds?</p>\n<p>The answer appears to me to be <em>no</em>.</p>\n<p>It seems clear that economic, technological, and social progress are limited, and that material progress on these dimensions must stop long before human society has run its course. That is, the relationship between progress at time T and progress at time T+1 will break down eventually. For example, if exponential growth continued at 1% of its current rate for 1% of the remaining lifetime of our sun, Robin Hanson points out each atom in our galaxy would need to be about 10<sup>140</sup>&#xA0;times as valuable as modern society. Indeed, unless our current understanding of the laws of physics, progress will eventually necessarily slow to an extremely modest rate by any meaningful measure.</p>\n<p>So while further progress today increases our current quality of life, it will not increase the quality of life of our distant descendants--they will live in a world that is &quot;saturated,&quot; where progress has run its course and has only very modest further effects.</p>\n<p>I think this is sufficient to respond to the original argument: we have seen progress associated with good outcomes, and we have a relatively clear understanding of the mechanism by which that has occurred. We can see pretty clearly that this particular mechanism doesn&apos;t have much effect on very long-term outcomes.</p>\n<h3>[Some responses]</h3>\n<p><strong>1.&#xA0;</strong>Maybe society will encounter problems in the future which will have an effect on the long-term conditions of human society, and their ability to solve those problems will depend on levels of development when they are encountered?&#xA0;</p>\n<p>[My first response to all of these considerations is really &quot;Maybe, but you&apos;re no longer in the regime of extrapolating from past progress. I don&apos;t think that this is suggested by the fact that science has made our lives so much better and cured disease.&quot; But to be a good sport I&apos;ll answer them here anyway.]</p>\n<p>For better or worse, almost all problems with the potential to permanently change human affairs are <a href=\"http://rationalaltruist.com/2013/01/06/how-useful-is-progress/\">of our own making</a>. There are natural disasters, periodic asteroid impacts, diseases and great die-offs; there is aging and natural climate change and the gradual burning out of the stars. But compared to human activity all of those events are <em>slow</em>. The risk of extinction from asteroids each year is very small, fast climate change is driven primarily by human activity, and the stars burn down at a glacial pace.&#xA0;</p>\n<p>The ability to permanently alter the future is almost entirely driven by technological progress and the use of existing technologies. With the possible exceptions of anthropogenic climate change and a particularly bad nuclear war, we barely even have the ability to really mess things up today: it appears that almost all of the risk of things going terribly and irrevocably awry lies in our future. Hastening technological progress improves our ability to cope with problems, but it also hastens the arrival of the problems at almost the same rate.</p>\n<p><strong>2. </strong>&#xA0;Why should progress continue indefinitely? Maybe there will be progress until 2100, and the level of sophistication in that year will determine the entire future?</p>\n<p>This scenario just seems to strain plausibility. Again, almost all ways that progress could plausibly stop don&apos;t depend on the calendar year, but are driven by human activities (and presumably some intermediating technological progress).</p>\n<p><strong>3. </strong>Might&#xA0;faster progress beget more progress and a more functional society, which will be better able to deal with the problems that arise at each fixed level of development?</p>\n<p>I think this is an interesting discussion but I don&apos;t think it has any plausible claim to a &quot;robust&quot; or &quot;non-speculative&quot; argument, or to be a primary consideration in what outcomes are desirable. In particular, you can&apos;t justify this kind of thing with &quot;Progress seems to have been good so far,&quot; you need to run a much more sophisticated historical counterfactual, and probably you need to start getting into speculating about causal mechanisms if you actually want the story to be convincing. Note that you need to distinguish wealth-related effects (which don&apos;t depend on how fast wealth is accumulated, and consequently don&apos;t affect our ability to address problems at each fixed level of development) from rate-of-progress related effects, which seems empirically treacherous (not to mention the greater superficial plausibility of wealth effects).</p>\n<p>In particular I might note that technological progress seems to have proceded essentially continuously for the last 1000 or so years, with periodic setbacks but no apparent risk of stalling or backpedaling (outside of small isolated populations). Without the risk of an indefinite stagnation leading to eventual extinction, it&apos;s not really clear why momentum effects would have a positive long-term impact (this seems to be begging the question). It is more clear how people being nicer could help, and I grant that there is some evidence for faster progress leading to niceness, but I think this is definitely in the relatively speculative regime.&#xA0;</p>\n<h2>[An alternative story]</h2>\n<p>An alternative story is that while progress has a modest positive effect on long-term welfare, this effect is radically smaller than the observed medium-term effects, and in particular much smaller than differential progress. Magically replacing the world of 1800 with the world of 1900 would make the calendar years 1800-1900 a lot more fun, but in the long run all of the same things happen (just 100 years sooner).</p>\n<p>That is, if most problems that people will face are of their own creation, we might be more interested in the relative rate at which people create problems (or acquire the ability to create them) vs. resolve problems (or acquire the ability to resolve them). Such relative rates in progress would be much more important than an overall speedup in technological, economic, and social progress. And moreover, we can&apos;t use the fact that X has been good for quality of life historically in order to say anything about which side of the ledger it comes down on.</p>\n<p>I&apos;d like to note that this is not an argument about AI or about any particular future scenario. It&apos;s an argument that I could have made just as well in 1500 (except insofar as natural phenomena have become even less concerning now than they were in 1500). And the observations since 1500 don&apos;t seem to discredit this model at all. Predictions only diverge regarding what happens <em>after</em>&#xA0;quality of life stops increasing from technological progress.&#xA0;</p>\n<p>This might operate at the level of e.g. differential technological development, so that some kinds of technological progress create value while others destroy it; or it might operate at a higher level, so that e.g. the accumulation of wealth destroys value while technological progress creates it (if we thought it was better to be as poor as possible given our level of technological sophistication). Or we might think that population growth is bad while everything else is good, or whatever.</p>\n<p><strong>The key message</strong>&#xA0;is that when we compare our situation to the situation of last century, we mostly observe the overall benefits of progress, but that on a long-run perspective these overall benefits are likely to be much smaller than the difference between &quot;good stuff&quot; and &quot;bad stuff.&quot;</p>\n<p>(For a more fleshed out version of this story, see again Nick Beckstead&apos;s&#xA0;<a href=\"https://sites.google.com/site/nbeckstead/research\">thesis</a>&#xA0;or&#xA0;<a href=\"http://www.gooddoneright.com/#!nick-beckstead/cxpp\">this presentation</a>.)</p>\n<h1>Implications</h1>\n<p>Why does any of this matter? A few random implications:</p>\n<ul>\n<li>I suspect that addressing poverty is good for the overall pace of progress, and for the welfare of people over the next 200 years. But I don&apos;t see much reason to think that it will make our society better in the very long-run, and I think that the arguments to this effect are quite speculative. For example, I think they are much more speculative than arguments offered for more explicitly future-shaping interventions. The same can be said for many other common-sense interventions.</li>\n<li>I think that faster AI progress is a huge boon for this generation&apos;s welfare. But I think that improving our understanding of where AI is going and how it will develop is probably more important, because that reduces the probability that the development of AI unfolds in an unfavorable way rather than merely accelerating its arrival.</li>\n<li>I think that improvements in decision-making capabilities or (probably) intelligence are more important than other productivity benefits, e.g. the benefits of automation, and so tend to focus on cognitive enhancement or improvements collective decision-making rather than the more conventional menu of entrepreneurial projects.</li>\n</ul>\n<div>I don&apos;t think that any of these are particularly speculative or wild propositions, but often people arguing against investment in differential progress seem to have unreasonably high expectations. For example, I expect understanding-where-AI-is-going to have a much smaller effect on the world than helping-AI-get-there, but don&apos;t think that is a sufficient argument against it.</div></body></html>", "user": {"username": "Paul_Christiano"}}, {"_id": "XwXpkwQ45acG5guLb", "title": "Meetup : Effective Altruism Melbourne Screening & Discussion: Does Foreign Aid Work?", "postedAt": "2014-10-15T02:14:54.615Z", "htmlBody": "<html><body><h2>Discussion article for the meetup : <a href=\"/meetups/10\">Effective Altruism Melbourne Screening &amp; Discussion: Does Foreign Aid Work?</a></h2>\n\t\t  <div>\n\t\t\t\t<p>\n\t\t    \t<strong>WHEN:</strong> \n\t\t    \t<span>26 October 2014 03:30:00PM (+1100)</span><br>\n\t\t\t\t</p>\n\t\t\t\t<p>\n\t\t    \t<strong>WHERE:</strong> \n\t\t    \t<span>E1/140 Arden St, North Melborne</span>\n\t\t\t\t</p>\n\t\t  </div><!-- .meta -->\n\t\t  <div>\n\t\t    <div><p>Over the past sixty years or so, several trillion dollars has been given by western countries as foreign aid to countries in the developing world. How effective have these donations been in promoting economic growth, reducing poverty, and raising living standards? Which types of aid work, and which don&#x2019;t? How could we reform the way aid is given and used so is to make it more effective? Are there additional things besides aid that are needed or could be helpful? Do China, India, or Brazil provide good examples for less developed countries to emulate, and if so how can a country be moved in that direction?</p>\n\n<p>Any of these questions would take years to answer properly, so we&#x2019;ll turn to experts on the subject. Specifically, at this event, we&#x2019;ll watch some talks by renowned economists Dambisa Moyo and Jeffrey Sachs, who have strident and mutually opposing views on the subject. (Let us know if you have suggestions of further speakers or videos we could watch). We will then have a discussion about the ideas and issues they raise.</p>\n\n<p>After the event we will head out to dinner for continued discussion. Everyone is welcome. See you there!</p></div>\n\t\t  </div><!-- .content -->\n\t\t<h2>Discussion article for the meetup : <a href=\"/meetups/10\">Effective Altruism Melbourne Screening &amp; Discussion: Does Foreign Aid Work?</a></h2></body></html>", "user": {"username": "Fods12"}}, {"_id": "D22kwgFWPnKjoqWuS", "title": "Giving Without Sacrifice? (Some excerpts) ", "postedAt": "2014-10-14T12:33:27.671Z", "htmlBody": "<html><body><p>(You can find the complete paper <a href=\"http://www.givingwhatwecan.org/sites/givingwhatwecan.org/files/attachments/giving-without-sacrifice.pdf\">on the GWWC website</a>)</p>\n<p>Cross-sectional studies consistently show that at any given time, within any given country, income is positively correlated with happiness (see [Diener &amp; Biswas-Diener 2002, 122-127] for overview and discussion). Thus, the World Value Survey II found the percentage of respondents in the UK reporting above neutral life-satisfaction to be 19% higher for high income groups compared to low income groups; in France the di&#xFB00;erence was 29%, in the Netherlands it was 6%, and the global average was 17%<sup>1</sup>&#x2026;</p>\n<p>What, if anything, can we conclude from this regarding the probable e&#xFB00;ects of giving away 10% of our income? We might choose to think of this as equivalent to simply exchanging our level of happiness for that attributed by a cross-sectional survey to someone within our country whose income is 10% lower than our own. Since we know that income is positively correlated with happiness in cross-sectional surveys, we should then expect that the e&#xFB00;ect of donating our income will be to decrease happiness.</p>\n<p>However, we must be careful in inferring causation from correlation. The existence of a positive correlation between happiness and income might be partly due, for example, to the in&#xFB02;uence of happiness on income: people of a cheerful disposition might end up wealthier than others. In fact, an e&#xFB00;ect of this kind exists<sup>2</sup>. Similarly, the correlation between income and happiness might be partly due to any number of third variables that cause both higher income and higher happiness. And, in fact, the correlation between income and happiness is weakened if one controls for variables such as education and unemployment<sup>3</sup>.&#xA0;</p>\n<p>On top of this, it might be argued that the available data in&#xFB02;ates the size of the correlation between income and happiness. In surveys of this correlation, wellbeing is almost always measured by asking subjects to provide global reports of life-satisfaction: for example, they may be asked, &#x201C;All things considered, how satis&#xFB01;ed are you with your life as a whole these days?&#x201D; However, there exists another technique for measuring happiness, experiential sampling, where subjects are asked to report their instantaneous feelings of happiness or unhappiness at several points over an extended period of time. It has been argued that experiential sampling provides a superior method of measuring happiness, because it overcomes the biases and imperfections associated with the cognitive capacities required to provide an accurate estimate of the happiness associated with ones life as a whole<sup>4,5</sup>. The choice of method is of importance, because the correlation between income and happiness is weakened by the replacement of such experiential measures for global self-report measures<sup>6,7</sup>. If experiential sampling provides a more objective measure of wellbeing, then money buys less happiness than most studies indicate.</p>\n<p>Since giving away 10% of ones income involves only the loss of money and no sacri&#xFB01;ce of ones educational achievement or sunny disposition, giving away 10% of ones income will not produce as great a drop in happiness as would exchanging ones level of wellbeing for that of a typical person earning 10% less, as people who earn di&#xFB00;erent amounts of money typically di&#xFB00;er in other ways which are relevant to happiness. On top of this, it must be emphasized that the data shows the correlation between income and happiness to be small, and signi&#xFB01;cantly smaller than people estimate<sup>8</sup>. Based on Helliwell<sup>9</sup>, Layard<sup>10</sup> calculates that &#x201C;[a] fall in income by one third (holding national income constant) causes a fall in happiness of 2 points on the scale of happiness (from 10 to 100).&#x201D; (65, my emphasis) The modest size of the correlation ensures that the e&#xFB00;ects of income on happiness are dwarfed by other non-pecuniary factors. On one analysis of their data, Ball &amp; Chernova<sup>11</sup> calculate that for the median single individual, the happiness boost produced by marriage is matched only by a 767% increase in absolute income, or by an increase in relative income from the 50th to the 88th percentile; the boost associated with moving from a health rating of 3 to 4 (when health is scored from 1 to 5) is matched only by a 6,531% increase in absolute income, or by a move from the 50th to the 100th percentile in relative income.</p>\n<p>Supposing, then, that we adopt the approach suggested above and think of donating 10% of our income as equivalent to simply exchanging our level of happiness for that attributed by a cross-sectional survey to someone within our country whose income is 10% lower than our own (keeping all other variables constant), we may conclude that this should produce a very small reduction in personal happiness.</p>\n<p>However, the methodology relied upon here is open to challenge. We might ask why we should think of giving away 10% of our income as equivalent to earning 10% less? After all, that assumption is literally false: we will not have a lower income, but one that is spent di&#xFB00;erently&#x2026;</p>\n<p>To determine the probable e&#xFB00;ects of donating our income we should examine empirical studies that address the correlation between di&#xFB00;erent kinds of spending and happiness, rather than the correlation between income and happiness.</p>\n<p>Unfortunately, relatively little research has explored this issue, though it has gained increasing attention of late (see Dunn, Gilbert, &amp; Wilson in press for an overview). Certain important results have already been established: for example, spending money on experiences, such as holiday trips, typically yields greater happiness than spending money on material goods<sup>12</sup>. There is also evidence to indicate that bene&#xFB01;tting others might bene&#xFB01;ts us more than spending money on ourselves.</p>\n<p>Imagine the following scenario. You are a participant in a psychological experiment: you are given an envelope containing a small sum of money, which you are asked to spend within 24 hours. The experimenter can assign you to one of conditions: she can require that you spend the money on yourself (paying a bill or buying yourself a treat) or she can require that you spend the money on others (buying a present for someone or donating the money to charity). Which condition do you suppose would bring the greatest happiness: spending the windfall on yourself or in an altruistic fashion?</p>\n<p>If you are like the typical participant in an experiment of this kind, conducted by Dunn, Aknin, &amp; Norton<sup>13</sup>, you believe that spending on yourself brings greater happiness. If you are of this opinion, your a&#xFB00;ective forecast is mistaken: the experimenters found that subjects in the prosocial spending condition reported greater happiness after spending their windfall than did those in the personal spending condition. This was not an isolated result. Dunn et al. also conducted a longitudinal study of 16 employees at a Boston- based company who received a pro&#xFB01;t-sharing bonus, &#xFB01;nding that those who devoted more of their bonus to prosocial spending experienced greater happiness as a result of spending their windfall; a cross-sectional study of a representative sample of Americans also found greater prosocial spending correlated with signi&#xFB01;cantly greater happiness, while personal spending turned out to be unrelated to happiness.</p>\n<p>Aknin et al.<sup>14</sup> examined survey-data from 136 countries gathered by the Gallup Organization, to see whether ratings of subjective wellbeing were positively correlated with donating to charity. Controlling for household income, it was found, in 122 of the 136 countries, that there is a positive correlation between subjective wellbeing and answering Yes to the question Have you donated money to charity in the last month? On average, it was found, &#x201C;donating to charity has a similar relationship to S[ubjective]W[well]B[eing] as a doubling of household income.&#x201D;</p>\n<p>Of course, we must be cautious in extrapolating from these results to the conclusion that donating 10% of our income to charity will be better for us than would be keeping this money for ourselves. The Gallup data did not assess the amount given to charity, and is correlational. The sums involved in the experiment described above are small. The experiment also involved windfall gains, such that subjects were not using money that they had already planned to spend on themselves. Moreover, insofar as the e&#xFB00;ects of donating 10% of our income might be expected to resemble those achieved for the prosocial spenders in the experiment described above, it is important that this 10% be taken from spending that would otherwise have gone on ourselves: the experiment does not support the view that giving money to charity is better than not giving, if the money donated would instead have been spent on presents for friends or family. Nonetheless, these results lend credence to the idea that giving money to charity can be a source of life-satisfaction that outweighs whatever minor frustrations we might experience from having less money to spend for our own purposes. Anecdotally, this idea is borne out by the testimony of members of Giving What We Can. Far from feeling like a sacri&#xFB01;ce, joining Giving What We Can tends to be a very positive experience, as you become part of a global community of like-minded individuals and gain deep satisfaction from the knowledge that you are helping others and making a positive impact on the world.</p>\n<p>It must be conceded that we have not been able to arrive at any secure verdict regarding the expected e&#xFB00;ects of donating 10% of our income to charity. Nonetheless, we have uncovered good evidence to support the view that this will involve no great sacri&#xFB01;ce on our behalf, and certainly less sacri&#xFB01;ce than we initially expected&#x2026;</p>\n<p>Ultimately, of course, the important thing is to help others. Given the extraordinary bene&#xFB01;ts that we can achieve for individuals living in poverty, it is something we should be doing even if did mean a real sacri&#xFB01;ce. But it is important to know that it does not, for we can then put to rest whatever self-interested doubts might be holding us back.</p>\n<p>Endnotes:</p>\n<p>1. [Diener &amp; Biswas-Diener 2002, 125]</p>\n<p>2. [Diener &amp; Biswas-Diener 2002, 134-135]</p>\n<p>3. [Easterlin 2001, 468]; see [Diener &amp; Biswas-Diener 2002, 128] for general discussion</p>\n<p>4. [Kahneman 1999]</p>\n<p>5. [Stone et al. 1999]</p>\n<p>6. [Kahneman et al. 2006]</p>\n<p>7. [Diener et al. 2010]</p>\n<p>8. [Aknin et al. 2009]</p>\n<p>9. [Helliwell 2003]</p>\n<p>10. [Layard 2006]</p>\n<p>11. [Ball &amp; Chernova 2008]</p>\n<p>12. [Van Boven &amp; Gilovich 2003]</p>\n<p>13. [Dunn et al. 2008]</p>\n<p>14. [Aknin et al. 2010]</p>\n<p>References:</p>\n<p>[Aknin et al. 2009] Aknin, Lara, Michael Norton, &amp; Elizabeth Dunn (2009). &#x201C;From wealth to well-being? Money matters, but less than people think&quot;, The Journal of Positive Psychology 4, 523-527.</p>\n<p>[Aknin et al. 2010] Aknin, Lara, Christopher P. Barrington-Leigh, Elizabeth W. Dunn, John F. Helliwell, Robert Biswas-Diener, Imelda Kemeza, Paul Nyende, Claire Ashton-James, Michael I. Norton (2010). &#x201C;Prosocial Spending and Well-Being: Cross-Cultural Evidence for a Psychological Universal.&quot; Harvard Business School Working Paper 11-038.</p>\n<p>[Ball &amp; Chernova 2008] Ball, Richard &amp; Chernova, Kateryna (2008). &#x201C;Absolute Income,Relative Income, and Happiness&quot;, Social Indicators Research 88, 497- 529.</p>\n<p>[Diener &amp; Biswas-Diener 2002] Diener, Ed &amp; Biswas-Diener, Robert (2002). &#x201C;Will Money Increase Subjective Well-Being? A Literature Review and Guide to Needed Research&quot;, Social Indicators Research 57, 119-169.</p>\n<p>[Diener et al. 2010] Diener, Ed, Weiting Ng, James Harter, &amp; Raksha Arora (2010). &#x201C;Wealth and Happiness Across the World: Material Prosperity Predicts Life Evaluation, Whereas Psychosocial Prosperity Predicts Positive Feeling&quot;, Journal of Personality and Social Psychology 99. 52-61.</p>\n<p>[Dunn et al. 2008] Dunn, Elizabeth, Lara Aknin, &amp; Michael Norton (2008). &#x201C;Spending Money on Others Promotes Happiness&quot;, Science 319, 1687-1688.</p>\n<p>[Easterlin 2001] Easterlin, Richard (2001). &#x201C;Income and Happiness: Towards a Unified Theory&quot;, The Economic Journal 111, 465-484.</p>\n<p>[Helliwell 2003] Helliwell, John (2003). &#x201C;How&apos;s life? Combining individual and national variables to explain subjective well-being&quot;, Economic Modelling 20, 331-360.</p>\n<p>[Kahneman 1999] Kahneman, Daniel (1999). &#x201C;Objective Happiness&quot; in Daniel Kahneman, Ed Diener, &amp; Norbert Schwarz, eds. Well-Being: The Foundations of Hedonic Psychology. New York, NY: Russell Sage, 1999, 3-25.</p>\n<p>[Kahneman et al. 2006] Kahneman, Daniel, Alan Krueger, David Schkade, Norbert Schwarz, &amp; Arthur Stone (2006). &#x201C;Would You Be Happier If You Were Richer? A Focusing Illusion&quot;, Science 312, 1908-1910.</p>\n<p>[Layard 2006] Layard, Richard (2006). Happiness: Lessons From a New Science. London: Penguin.</p>\n<p>[Stone et al. 1999] Stone, Arthur, Saul Shiman, &amp; Marten deVries (1999). &#x201C;Ecological Momentary Assessment&quot; in Daniel Kahneman, Ed Diener, &amp; Norbert Schwarz, eds. Well-Being: The Foundations of Hedonic Psychology. New York, NY: Russell Sage, 1999, 26-39.</p>\n<p>[Van Boven &amp; Gilovich 2003] Van Boven, L., &amp; Gilovich, T. (2003). &#x201C;To do or to have? That is the question&#x201D;, Journal of personality and social psychology, 85(6), 1193.</p>\n<p>&#xA0;</p></body></html>", "user": {"username": "Andreas_Mogensen"}}, {"_id": "rK2gn939BAnSpZ2Xz", "title": "How can people be persuaded to give more (and more effectively)?", "postedAt": "2014-10-14T09:49:42.426Z", "htmlBody": "<html><body><p><em>Written by Angus Smith, Michael Davies and me as part of the Giving What We Can September Internship.</em></p>\n<p>Encouraging people to give to charity is often based on appeals to emotion. Encouraging people to give to the most effective charities, however, involves appealing to their reason. Do these facts necessarily clash? Does the effective altruism movement face an uphill struggle against people&#x2019;s intuitions, gut feelings and personal experiences?</p>\n<p>Our findings investigate the ways in which giving with your head can appeal to the heart. A number of simple, intuitive, persuasion techniques can dramatically alter an individual&#x2019;s ability to understand, and really internalise, their potential to do good.</p>\n<p><strong>Crunching Numbers</strong></p>\n<p>&#x2018;Giving ten per cent of your income&#x2019; is a scary thought, until you actually think about it. So, when persuading someone to take the Giving What We Can pledge, giving someone the space to think it over can be a surprisingly useful tool. A 2011 paper by economist Anna Breman showed that when regular donors were encouraged to increase their donations, the mean increase in monthly donations was 32% higher among people asked to do so after two months, than those who were asked to do so immediately. In a second experiment this figure stood at 11% So, when inviting someone to take the pledge, consider asking for a commitment first, and allowing them space to adjust to the idea before actually starting payments.</p>\n<p>Another way of framing the ten per cent donation in a more appealing way is through suggesting that the donations be made frequently, and in smaller amounts. A study by Strahilevitz in 2010 showed that &#x2018;the relative appeal of giving to charity rather than having those resources for oneself is greater for small amounts than for large amounts.&#x2019; Have you ever been reminded of how much you could give to charity if you simply cut down on the latt&#xE9;s? This is the &#x2018;little-but-often&#x2019; model at work: when people see a donation as a series of small sacrifices, they are much more likely to appreciate its overall good.</p>\n<p>This brings us on to a fundamental problem with fundraising for effective altruism: people struggle with conceptualising large numbers. When Kurt Tucholsky (not Stalin, who was hardly an insightful man) said that one death is a tragedy, and thousands is a statistic, he was alluding to a truth that social psychologists have recently come to elucidate. Take a recent series of studies by V&#xE4;stfj&#xE4;ll et al. (2014) which found that as more children were introduced in different charity appeals, activity in the Zygomaticus Major muscles decreased. Activity in these muscles is typically associated with compassion and the anticipated &#x2018;warm glow&#x2019; of giving. As more victims of poverty were introduced, then, people&#x2019;s empathy towards them decreased. V&#xE4;stfj&#xE4;ll, understandably annoyed, organised a second study in which these children were grouped into &#x2018;entities,&#x2019; such as families. He found that eight related children elicited more empathy, and donations, than eight unrelated children. So, when talking about the lives that one can save through effective giving, stress that these are not simply abstract third-worlders, who exist as nothing more than statistics, but real people who relate to one another.</p>\n<p><strong>&#x2018;It&#x2019;s not that I dislike people but I&#x2019;m a great animal lover&#x2026;&#x2019;</strong></p>\n<p>There are, however, some heavily ingrained biases in people&#x2019;s altruistic behaviour which can take real effort to break. Today&#x2019;s society is saturated with different charitable appeals, and interview data suggests that donors use a variety of heuristic, experience-based rules of thumb to cope with the complexity. A study in 2014 pulled up such responses as, &#x2018;I very rarely look at a new charity,&#x2019; &#x2018;I&#x2019;m not adding to my list,&#x2019; or &#x2018;I have a box&#x2026;all the [charity leaflets] go in and every month I donate to two of them.&#x2019; In persuading someone to give effectively, we have a responsibility to help people see through the complexity of charity and explain clearly and concisely why organisations like the Against Malaria Foundation deserve our support.</p>\n<p>Arguably more damaging is the idea that there is a limit to how much good one can really be expected to do. Having done one&#x2019;s &#x2018;good deed for the day,&#x2019; people can get defensive, even offended, about being asked to do more. It falls to us, then, to remind people of their potential to save lives, resisting the temptation to rest on one&#x2019;s laurels and focus on future aims rather than past virtues. Indeed, one study has shown that people primed to think of themselves as virtuous behave less altruistically than those primed to think of themselves in a negative light. Without going so far as to advocate a wholesale campaign against people&#x2019;s self-esteem, it can be useful to shift the emphasis of a discussion away from someone&#x2019;s previous acts of generosity and towards what should be done in the future.</p>\n<p><strong>Persuasion Techniques</strong></p>\n<p>More generally, there are a number of things to keep in mind, whatever the nature of your appeal, for encouraging people to give more. We have already gone over a number of barriers towards attitude change that many perfectly well-intentioned people can experience. In persuasion, it is always better, and indeed, more sympathetic, to yield to some of these truisms rather than attack them outright. Cialdini, Green and Rusch found that students interviewed about exam reform at their university were more receptive, even to specious arguments, when the interviewer yielded to some of the subjects&#x2019; arguments rather than resisting them.</p>\n<p>Suppose, however, that you are in a position of responsibility for delivering a presentation on altruism to a large group of people. A different, very easily applicable technique is not to immediately tell the prospective donors what your aim is. Begin with a brief discussion centring on the precise goals that Giving What We Can and other effective altruism movements seek to tackle. Go into some detail about the nature of different interventions and encourage people to think in a logical way by guiding them through how poverty alleviation works in practice. One study showed that people prepared to engage their minds by memorising long sequences of letters were much more likely to donate to a charitable appeal which focussed on the plight of multiple children as opposed to just one, than those asked to memorise just two letters.</p>\n<p>Equally, what best helps people to put their ideas into actions is giving them clear instructions. In a study by Levanthal, Singer and Jones, students were given leaflets to get Tetanus shots. The students who received leaflets with directions to the medical centre were much more likely to get the shots despite the fact that they were already familiar with where the medical centre was.</p>\n<p><strong>Conclusion</strong></p>\n<p>We have outlined a number of problems, and, hopefully, a number of solutions, to the question of how to encourage people to break their implicit assumptions about charity, and to give with their heads as much as their hearts. The mental blocks that keep people from giving effectively are often long-ingrained beliefs that, while firm, can be brittle. If you can really get someone to engage their brains by discussing charity in an intelligent way, you may be surprised how quickly attitudes change.</p>\n<p>It&#x2019;s an unfortunate quirk of the human mind that it struggles to conceive of large numbers in a meaningful way, and this is an obstacle that Giving What We Can must overcome in order to press home points about effective giving. The scale of what we can accomplish can, both for better and for worse, be unimaginable.</p></body></html>", "user": {"username": "Denise_Melchin"}}, {"_id": "2Mdih3jfB4xtJsFG6", "title": "Meetup : Animal Suffering Documentary Night", "postedAt": "2014-10-13T05:18:47.293Z", "htmlBody": "<html><body><h2>Discussion article for the meetup : <a href=\"/meetups/y\">Animal Suffering Documentary Night</a></h2>\n\t\t  <div>\n\t\t\t\t<p>\n\t\t    \t<strong>WHEN:</strong> \n\t\t    \t<span>22 October 2014 10:18:41PM (-0700)</span><br>\n\t\t\t\t</p>\n\t\t\t\t<p>\n\t\t    \t<strong>WHERE:</strong> \n\t\t    \t<span>435 summit ave E #301, Seattle, WA</span>\n\t\t\t\t</p>\n\t\t  </div><!-- .meta -->\n\t\t  <div>\n\t\t    <div><p>Come join us to watch &quot;Earthling&quot; a documentary about animal suffering with regards to animal consumption, followed by a brief video called &quot;Farm to Fridge&quot;.</p>\n\n<p>After that we will head out for vegetarian food.</p>\n\n<p>In some of our past events, we discussed the issue of animal suffering as a cause for EA, including some kind of conversion rate from animal pain to human pain. This will be a chance to learn more about what animals go through in order for us to eat them.</p>\n\n<p>Additionally, it has been suggested that it is easier to make people care about animal suffering than human suffering, so animal rights causes can be seen as a gateway drug for human rights causes.</p>\n\n<p>Finally, since we&apos;re all going to be vegan in the future, we might as well start learning about it now :)</p>\n\n<p>Note on venue: there are two cats in residence, and good luck to you on parking.</p></div>\n\t\t  </div><!-- .content -->\n\t\t<h2>Discussion article for the meetup : <a href=\"/meetups/y\">Animal Suffering Documentary Night</a></h2></body></html>", "user": {"username": "riceissa"}}, {"_id": "CmGPp5p9RvTLuuzbt", "title": "Aim high, even if you fall short", "postedAt": "2014-10-11T17:26:53.809Z", "htmlBody": "<p><span>Let’s say I believe it would be good for my health to go running every day. But I quickly realize that I don’t want to run every day, and that realistically I’ll only run a few times a month. It’s embarrassing to think of myself as being inconsistent, so perhaps I decide that running isn't actually good for my health after all. In short, I come up with new beliefs to suit the action I was already planning to take.</span><br><br><span>It's obviously silly to come up with new \"facts\" for the sake of convenience. Is it any better to come up with new moral beliefs for the same reason?&nbsp;</span><br><br><span>Sometimes I hear people say, \"It seems reasonable to believe that people on the other side of the world matter as much as anyone else. But if I believed that, I should be trying a lot harder to help them, and that would require drastic changes to my life. So that's why I don't believe we have the same responsibility to help everyone.\" This way their actions are consistent with their beliefs—or at least, their beliefs are consistent with their actions.</span></p>\n<p><span>Let’s take the question, “Is it wrong for me to eat meat?” Upon hearing the question, I immediately translate it as, “Do I want to stop eating meat?” The answer to that is, “No, I want to keep eating it.” So it’s tempting to answer the first question as, “No, animals don’t really suffer, so it’s fine for me to eat meat.” Very tidy.</span><br><br><span>Inconsistency, in addition to feeling icky, opens you up to criticism. People love to catch vegetarians eating things they’re “not supposed to,” while catching an omnivore eating a turkey sandwich gives no such pleasure. People love to criticize Peter Singer because he wrote an <a href=\"http://philosophyfaculty.ucsd.edu/faculty/rarneson/Singeressayspring1972.pdf\">essay</a></span><span>&nbsp;saying we should give money to poor people rather than buying new clothes and cars for ourselves, and yet he personally doesn’t wear rags or live in a hovel. (People rarely talk about the fact that he would find it harder to work as a professor and would persuade fewer people if he wore rags.)</span><br><br><span>And yet people might accomplish more good if they were willing to set high goals and fail sometimes. Give yourself permission to go partway. I’ve often heard people say, “I couldn’t be vegetarian because I’d miss [particular food] too much.” I felt that way about ice cream. So I spent a summer eating vegan - except for ice cream. It was morally inconsistent, and it felt much less morally pure to say, \"I'm eating vegan&nbsp;</span><span>...um,&nbsp;except for ice cream</span><span>,\" but it resulted in me eating far fewer animal products than I usually did.</span><br><br><span>And maybe if I'm honest about what I believe is right, someone else with more willpower or different life circumstances will be persuaded and go farther than I will. Certainly Peter Singer has persuaded many people that giving money is a good thing to do, even if he hasn't given away every last penny of his own.</span><br><br><span>In the end, it’s about what your goals are. Is your goal to be able to take pride in how consistent you are? To be irreproachable because your standards for yourself are low enough that you can easily meet them? </span></p>\n<p><span>Or is it more important to be honest about your moral beliefs and make some progress toward them, even if you don’t get everything done as well as you would like to?</span></p>", "user": {"username": "Julia_Wise"}}, {"_id": "NuzHBJRh8SgysoP8K", "title": "Meetup : Effective Altruism Brisbane Meet Up.", "postedAt": "2014-10-11T09:15:41.325Z", "htmlBody": "<html><body><h2>Discussion article for the meetup : <a href=\"/meetups/x\">Effective Altruism Brisbane Meet Up.</a></h2>\n\t\t  <div>\n\t\t\t\t<p>\n\t\t    \t<strong>WHEN:</strong> \n\t\t    \t<span>16 October 2014 05:30:00PM (+1000)</span><br>\n\t\t\t\t</p>\n\t\t\t\t<p>\n\t\t    \t<strong>WHERE:</strong> \n\t\t    \t<span>69 Vulture St, Brisbane, Australia</span>\n\t\t\t\t</p>\n\t\t  </div><!-- .meta -->\n\t\t  <div>\n\t\t    <div><p>This is the second meet up of EA Brisbane. We&apos;ll be getting to know each other and talking about plans for future events. If you&apos;re in the Brisbane area we&apos;d love to meet you. If you can&apos;t make it, join our facebook group for future events: <a href=\"https://www.facebook.com/groups/1686724351553318/\">https://www.facebook.com/groups/1686724351553318/</a></p></div>\n\t\t  </div><!-- .content -->\n\t\t<h2>Discussion article for the meetup : <a href=\"/meetups/x\">Effective Altruism Brisbane Meet Up.</a></h2></body></html>", "user": {"username": "Joseph_ONeill"}}, {"_id": "mgnsvBCAmfP4hEE9j", "title": "One month in - it's time for more introductions", "postedAt": "2014-10-10T22:51:51.504Z", "htmlBody": "<html><body><p><img src=\"http://cdn.cakecentral.com/e/e0/900x900px-LL-e0f29340_full-7073.jpeg\" alt=\"\"></p>\n<p>Hello everyone,</p>\n<p>It&apos;s been a big launch month for the Effective Altruism Forum. To the roughly 100 existing posts on the Effective Altruism Blog, we&apos;ve added 43 new posts.</p>\n<p>Congrats <a href=\"/ea/7x/supportive_scepticism/\">Jess</a>, <a href=\"/ea/8h/effective_altruism_as_the_most_exciting_cause_in/\">Kaj</a>, <a href=\"/ea/7k/what_small_things_can_an_ea_do/\">Peter</a>, <a href=\"/ea/8t/why_is_effective_altruism_new_and_obvious/\">Katja</a> and <a href=\"/ea/6w/cosmopolitanism/\">Topher</a>&#xA0;for writing the five&#xA0;<a href=\"/top/\">most popular</a> posts! Thanks everyone for your comments, without which the forum would not be such a fun place to hang out!</p>\n<p>Now is the time to throw the forum open to lots more new contributions. To facilitate this, we&apos;ve decreased the karma requirement for writing a new article. You can now post as soon as you get ten karma (posting used to require 30). As usual, you can upvote, downvote, comment, write in the <a href=\"/ea/99/open_thread_2/\">Open Thread</a> and post meetups right away. I&apos;ll continue to supplement your articles with some classic introductory essays.</p>\n<p>In terms of updates in the last week, we&apos;ve installed the ability to moderate user&apos;s contributions. Note that contributors on this site have so far been sufficiently well-behaved so far that I haven&apos;t had to delete a single comment, which is a credit to effective altruists, and may this continue far into the future! We have also updated the Recent on EA Blogs section to include just the rationality-related posts, rather than all posts from <a href=\"http://www.slatestarcodex.com\">Slate Star Codex</a>, which means that our sidebar will be less densely filled with Scott&apos;s articulate and provocative commentaries but will hopefully give people a more representative impression of effective altruism. (Including this subset of Scott&apos;s posts was always our original intent anyway.)</p>\n<p>If you haven&apos;t already <a href=\"/ea/7r/introduce_yourself/\">introduced yourself</a>, then now is a great time to do so. Use the comment thread below to tell others something that others might find interesting about you!</p>\n<p>Enjoy!</p></body></html>", "user": {"username": "RyanCarey"}}, {"_id": "JrtgQMxEcJDRZCg2r", "title": "Types of planners and plans for EAs", "postedAt": "2014-10-10T19:22:48.411Z", "htmlBody": "<html><body><address><span>What would it look like if we were winning?&#xA0;<br></span> What would it look like getting from here to there?</address><address><address><br></address> </address>\n<p>This post:<br><strong>Tales of people within effective altruism who succeeded because they had plans<br></strong><strong>Secret planning<br></strong><strong>Plan design</strong></p>\n<p>Next post:<br><strong>Have an idealized plan<br></strong><strong>Murphy-jitsu your plans<br></strong><strong>Compare with other people&apos;s plans last</strong></p>\n<p><strong><br></strong></p>\n<h2><strong> Tales of people who succeeded because they had plans </strong></h2>\n<p>On a foggy Wednesday afternoon we were scheduled to talk for an hour. All the people I had met in that building were interesting, smart, and quirky, so I expected that, no less. Compared to the other visitors to the appropriately named Haste street apartments, however, he seemed more focused and organized, which was not saying much. Within maybe fifteen minutes of conversation we mutually perceived a distinctive trait we shared, but others didn&apos;t. Everyone in that building was smart, everyone was altruistic, everyone wanted the world to improve, but both of us <em>had a plan</em>. Three hours later we shook hands and decided to work together.</p>\n<p>My plan and Geoff Anders&apos; plan were at different levels of analysis, using different methodologies, different levels of abstraction. That was before Leverage Research or IERFH (Institute Ethics Rationality, and Future of Humanity) had their respective names, or even existed at all. Those plans, mine written, his in flowchart form, were the seeds of two institutions.</p>\n<p>Geoff used to say that the way he got people to work with him was basically by impressing The Plan upon them. It worked for me; I decided to dedicate 15+ hours of my week to what would become Leverage Research, even though my main quest was still to pursue my relative advantage - returning to Brazil to create my own institution there - It also worked for many of Leverage&apos;s initial members.</p>\n<p>Not long after that Wednesday, another planner arrived at the Haste apartments. Luke Muehlhauser, who would later become the CEO of MIRI. Though many different things have contributed to Luke&apos;s position, in particular blogging at commonsenseatheism.com, I perceive his continuous insistence on a <em>yearly plan</em> for MIRI as pivotal to his ascendance to CEO.</p>\n<p>Those were important days at the Haste apartments and they were important days because people were making plans. Plans that start with a box saying &quot;we are here&quot; and end with a box saying &quot;the World is significantly improved&quot;.</p>\n<p>Another case study of having plans is that of Matt Fallshaw, a successful effective altruist who has created several successful companies, giving him substantial resources to direct to the causes he finds most important. Fallshaw is remarkable for his productivity. He sleeps for four hours a day, fasts daily and exercises by sprinting repetitively up a hill. When asked about productivity techniques, Fallshaw <a href=\"http://lesswrong.com/lw/kt9/productivity_thoughts_from_matt_fallshaw/\">described</a> basically techniques for making good failsafe accurate plans. His advice is: 1) Use a randomized spaced repetition system like anki to make sure you are successfully installing the habits that will cause you to execute your plan. 2) Make sure you have above average energy when making and reviewing plans. 3) If a goal seems impossible or intractable, use a 5-Minute timer (i.e. CFAR&apos;s Focused Grit) to try to a) solve the problem, or, failing that b) Generate a set of action sequence steps, each less than 5 minutes long, that will take you 80 or 100% of the way towards the goal. 4) Use a system for freeing attention, such as Getting Things Done. 5) Apply the principles of <a href=\"http://en.wikipedia.org/wiki/Theory_of_constraints\">Theory of Constraints</a> to large plans.</p>\n<p>Finally, another successful founder of EA projects, Peter Thiel, has recently spend considerable effort in giving&#xA0;<a href=\"https://www.youtube.com/watch?v=iZM_JmZdqCw\">presentations</a> about and writing a <a href=\"http://libgen.org/search.php?req=peter+thiel+zero+to+one&amp;open=0&amp;view=simple&amp;phrase=1&amp;column=def\">book chapter</a> on the idea that <em>You are not a lottery ticket</em>. By that he means that trying to find a reference class to which you belong, and evaluating your chances of obtaining a particular outcome can only go so far. It is not just chance that brings new ideas - zero to one - to the world. Having a probabilistic view of the world, an indefinite view of the future, is dangerous - yes, this applies to you too, Bayesian startup creators. Let me illustrate this with some examples of actions you&apos;d take:</p>\n<p>If you see the future as indefinite and optimistic, if whether you succeed or not depends on chance, then the best thing you can do is <em>improve your chances</em>. Since chances are imagined relative to a reference class, then you will feel incentivized to be in the right reference class. So entering Harvard will seem like a good place to seed a successful startup. Once you get in, the grass will be greener if you drop out. No reference class beats Harvard drop-outs right? If you are an investor, having a broad portfolio of stocks will also feel like a sound investment decision, since you &quot;know&quot; it&#x2019;s unwise to choose any definite thing, including stocks. That is not how the world works, according to your indefinite model. In an indefinite world, everyone outsources everything, no one takes responsibility and makes specific decisions, things stop being built, everyone fights for reference class hopping, and hopes that over the long run the dice will turn in their favor.</p>\n<p>Thiel contrasts this with a definite optimistic view of the future, which can be seen in Marx, Hegel, US policy from 1950 to 1960, and I&apos;d argue also in his investment decisions, in planners like Anders, Luke Muehlhauser, Toby Ord, <a href=\"http://lesswrong.com/lw/jl3/on_saving_the_world/\">Nate Soares</a>, Thiel himself, and a minority of effective altruists. According to the definite view, it is worthwhile to have ideas, to seek opportunities, to find market failures, and to act on them. It is desirable to conceive of specific ways the world could be, and design plans to move us there. Thiel says this approach was more common in the 1940&#x2019;s:</p>\n<blockquote>\n<p>Bold plans were not reserved just for political leaders or government scientists. In the late 1940&apos;s a Californian named John Reber set out to reinvent the physical geography of the whole San Francisco Bay Area. Reber was a schoolteacher, an amateur theater producer, and a self-taught engineer. Undaunted by his lack of credentials, he publicly proposed to build two huge dams in the Bay, construct massive freshwater lakes for drinking water and irrigation, and reclaim 20,000 acres of land for development. Reber though he had no personal authority, people took the Reber Plan seriously. It was endorsed by newspaper editorial boards across California. The US congress held hearings on its feasibility. [...]</p>\n<p>But would anybody today take such a vision seriously in the first place? In the 1950&apos;s, people welcomed big plans and asked whether they would work. Today a grand plan coming from a schoolteacher would be dismissed as crankery, and a long-range vision coming from anyone more powerful would be derided as hubristic.</p>\n</blockquote>\n<p>We can see two messages here:</p>\n<p>1) Having a definite view of the future has been a major driving force of few particularly productive people in the current effective altruist movement.</p>\n<p>2) Adopting a definite view of the future predicts success, and requires making specific action plans.</p>\n<p>&#xA0;</p>\n<h2>Secret planning</h2>\n<p>If you are convinced that having a definite vision of the future is a good idea, then you have two choices: create your own view of the future and make a plan to make it happen; or <a href=\"http://www.ted.com/talks/derek_sivers_how_to_start_a_movement?language=en\">adopt someone&apos;s</a> specific view of the future, and make it happen.</p>\n<p>These are the most important actions. Moving from 0 to 1, and from 1 to 2. Not unlike geometry, getting from 2 onwards is not only easier, it what everyone is already doing. If you are determining a line, the third point is one point too many. It is, in a word, redundant.</p>\n<p>If you adopt a plan that more than 0 or 1 people already have then you are incurring in a specific failure mode, you are zooming in at the wrong level of granularity. For instance, suppose you consider the creation of Friendly Artificial Intelligence to be the most important task. Well, so do Muehlhauser and Yudkowsky, therefore you should look elsewhere right? No. What you should look for are actions - steps instrumental to the creation of Friendly Artificial Intelligence that others are not looking into. As Thiel contends, this is very hard, it is unnatural to try new things. It is especially unsettling to look for failures in worldscale plans in part because, should you actually find an error, you may inherit responsibility for fixing it, it is now your responsibility to make it happen. You are the only person who knows the secret path, it is a necessary route to arrive at your goal, and if you don&apos;t go through it, no one will. Furthermore, others may not only fail to see the path, but be dismissive of it&#x2019;s importance. This is good indication that your planning lens are zooming in from the right distance - if everyone agrees with you, you are too far, if no one understands you, you are too near - when in between you may still be wrong, but in that zone fly the ideas Peter Thiel calls secrets, ideas that looks clearly bad, but happen to be actually good. That is the group of ideas Thiel seeks to fund, in case you are wondering. When you find a secret, you become irreplaceable.</p>\n<p>&#xA0;</p>\n<h2>Plan design</h2>\n<p>Now what would your plan look like?</p>\n<p>Your plan may be an <a href=\"http://yudkowsky.net/obsolete/singularity.html\">emotional grandiose vision</a> of what is to come. Yet that is suboptimal.<br>It may be <a href=\"http://intelligenceexplosion.com/\">a narrative</a>, with describes in linear fashion what needs to happen. Yet that is still suboptimal.<br>It may be a <a href=\"https://docs.google.com/viewer?a=v&amp;pid=sites&amp;srcid=ZGVmYXVsdGRvbWFpbnxuYmVja3N0ZWFkfGd4OjExNDBjZTcwNjMxMzRmZGE\">call to arms</a>, so that people see the importance of what you have noticed. - We are getting hotter, but still not optimal.</p>\n<p>Remember Fallshaw&apos;s advice that using Theory of Constraints can help in designing your plan, it helps you predict time pressures, releasing valves before they constrain your ability to move. Furthermore, your plan must have parallel paths depending on how reality reacts to your actions, and so that actions can be done in parallel. Finally your plans must be understandable and communicable, which is how Geoff attracted the first researchers to Leverage.</p>\n<p>The optimal plan then , is, like <a href=\"https://docs.google.com/file/d/0BxADVDGSaIVZNnppbG45NDIyU2M/edit\">Leverage&apos;s old plan</a>, a flowchart, or another clear <a href=\"https://drive.google.com/file/d/0BxADVDGSaIVZbnlXdE5PNkhGQUU/view?usp=sharing\">structure</a> (my <a href=\"https://drive.google.com/file/d/0BxADVDGSaIVZVmdCSE1tSktneFU/view?usp=sharing\">EA plan</a>) that permits parallel paths, hierarchization with different levels of granularity visible at particular times. A graph. I use <a href=\"http://freemind.sourceforge.net/wiki/index.php/Download\">Freemind</a> for ease of keyboard shortcuts, then Mindmup for different visualization, though it loses formatting and pictures.</p>\n<p>Maybe you think Geoff<sub>2011</sub> choose the wrong level of granularity to design a plan. Perhaps, but just having a plan allows much more thorough monitoring of what is going on, tractability of how well we are doing in relation to predictions, and specially pre-conceived reactions in case reality reacts in one or other particular way.</p>\n<p>Nick Bostrom&apos;s book Superintelligence doesn&apos;t create one causal story and run with it. It maps out many different ways in which reality can behave as it approaches an intelligence explosion. In unprecedented detail, it scrutinizes ways to steer the future so that reality&apos;s moves are, as much as possible, amenable to some level of control, before, during, and after an intelligence explosion. It is not a complete flowchart, but it is the best set of predictions and contingency plans we have so far regarding this particular cause.</p>\n<p>Superintelligence and Leverage&apos;s plan are good examples of what a plan should look like. An initial plan to personally act on the secret you discovered, however, will justifiably be simpler. We will return to that on the next post, for now, here is&#xA0;<a href=\"https://drive.google.com/file/d/0BxADVDGSaIVZNXoydFRManhwOEk/view?usp=sharing\">a template of a plan</a> without content so you can use it for your own EA plan. <a href=\"http://freemind.sourceforge.net/wiki/index.php/Download\">Freemind</a> has faster commands, Mindmup has more visual variety.</p>\n<p>Try things.</p>\n<p>&#xA0;</p>\n<hr>\n<h6><span><span>If anyone solved the problem of copying texts from google docs to here without losing some spaces,&#xA0;bold&#xA0;and&#xA0;</span>italics<span>&#xA0;when you&#xA0;<a href=\"http://word2cleanhtml.com/cleanit\">clean it</a>&#xA0;let me know<br></span></span></h6>\n<p><span>Thanks Ryan Carey for careful commenting and editing, Oliver and Nate for increasing the urges and urgency.&#xA0;</span></p>\n<p><span><span><br></span></span></p></body></html>", "user": {"username": "Diego_Caleiro"}}, {"_id": "udwhAe2FKn9oDx4n4", "title": "Meetup : .impact's fortnightly projects meeting", "postedAt": "2014-10-10T16:40:38.752Z", "htmlBody": "<html><body><h2>Discussion article for the meetup : <a href=\"/meetups/w\">.impact&apos;s fortnightly projects meeting</a></h2>\n\t\t  <div>\n\t\t\t\t<p>\n\t\t    \t<strong>WHEN:</strong> \n\t\t    \t<span>12 October 2014 10:00:00PM (+0100)</span><br>\n\t\t\t\t</p>\n\t\t\t\t<p>\n\t\t    \t<strong>WHERE:</strong> \n\t\t    \t<span>London, UK</span>\n\t\t\t\t</p>\n\t\t  </div><!-- .meta -->\n\t\t  <div>\n\t\t    <div><p>On Sunday, 12 October at 9p UTC (5p Eastern, 2p Pacific), we&apos;ll be having a pretty brief meeting (usually ~1hr) about project updates and any new ideas people might be thinking about!\nWe meet by Google Hangout. A hangout link will be posted on the Facebook event about 0-5 minutes before the meeting starts.\n<a href=\"https://www.facebook.com/events/722257344525738/\">https://www.facebook.com/events/722257344525738/</a></p></div>\n\t\t  </div><!-- .content -->\n\t\t<h2>Discussion article for the meetup : <a href=\"/meetups/w\">.impact&apos;s fortnightly projects meeting</a></h2></body></html>", "user": {"username": "Tom_Ash"}}, {"_id": "NMA3nriCkPPa6Dpzr", "title": "Meetup : Social EA career path meetup", "postedAt": "2014-10-10T15:26:50.876Z", "htmlBody": "<html><body><h2>Discussion article for the meetup : <a href=\"/meetups/v\">Social EA career path meetup</a></h2>\n\t\t  <div>\n\t\t\t\t<p>\n\t\t    \t<strong>WHEN:</strong> \n\t\t    \t<span>23 October 2014 06:26:05PM (+0300)</span><br>\n\t\t\t\t</p>\n\t\t\t\t<p>\n\t\t    \t<strong>WHERE:</strong> \n\t\t    \t<span>Caf&#xE9; Mascot, Nelj&#xE4;s linja 2, Helsinki, Finland</span>\n\t\t\t\t</p>\n\t\t  </div><!-- .meta -->\n\t\t  <div>\n\t\t    <div><p>(See below for English)</p>\n\n<p>Edellisess&#xE4; tapahtumassa keskitytttiin hyv&#xE4;ntekev&#xE4;isyyksien v&#xE4;lill&#xE4; valitsemiseen, t&#xE4;ll&#xE4; kertaa on muodossa vapaamuotoisempaa keskustelua. Tapaamisen teemana ovat henkil&#xF6;kohtaiset uravalinnat. Millaisella uralla voi tehd&#xE4; suurimman vaikutuksen maailmaan, tai jos on uransa jo valinnut, mit&#xE4; mahdollisuuksia se tarjoaa tehokkaaseen toimintaan maailman muuttamiseksi?</p>\n\n<p>Ennen tapaamista voi halutessaan tutustua esim. alla oleviin materiaaleihin, joista osasta tuodaan my&#xF6;s tulosteita paikalle. Tai vain tulla muuten vain tutustumaan muihin ja keskustelemaan.</p>\n\n<p>Meid&#xE4;t l&#xF6;yt&#xE4;&#xE4; kahvilasta etsim&#xE4;ll&#xE4; miest&#xE4; jolla on kissankorvat.</p>\n\n<hr>\n\n<ul>\n<li><p>5 ways to make a big difference in any career: <a href=\"https://80000hours.org/2014/02/5-ways-to-make-a-big-difference-in-any-career/\">https://80000hours.org/2014/02/5-ways-to-make-a-big-difference-in-any-career/</a></p></li>\n<li><p>How to assess the impact of a career: <a href=\"https://80000hours.org/2013/07/how-to-assess-the-impact-of-a-career/\">https://80000hours.org/2013/07/how-to-assess-the-impact-of-a-career/</a></p></li>\n<li>Top careers: <a href=\"https://80000hours.org/research/top-careers/\">https://80000hours.org/research/top-careers/</a></li>\n<li>Don&apos;t follow your passion: <a href=\"https://80000hours.org/research/the-big-picture/dont-follow-your-passion/\">https://80000hours.org/research/the-big-picture/dont-follow-your-passion/</a></li>\n</ul>\n\n<hr>\n\n<p>Time for a bit of social hanging out, with a theme of personal career choices. What kind of a career can make the biggest impact on the world, or how can you make the biggest impact if you&apos;ve already settled on a particular career?</p>\n\n<p>Before the meeting, you may familiarize yourself with some of the above links if you wish, or just show up to get to know others and talk.</p>\n\n<p>You can find us from the cafe by looking for the man with the cat ears.</p></div>\n\t\t  </div><!-- .content -->\n\t\t<h2>Discussion article for the meetup : <a href=\"/meetups/v\">Social EA career path meetup</a></h2></body></html>", "user": {"username": "Kaj_Sotala"}}, {"_id": "j8Aqb5EmRwD4aqfxR", "title": "Tell us about your recent EA activities", "postedAt": "2014-10-10T13:18:14.313Z", "htmlBody": "<html><body><p>We have plenty of effective altruists around the world, each doing something to make the world a better place. If we all work separately and don&apos;t report of our work, most of our efforts will go unnoticed by others in the community, who could otherwise provide encouragement or suggestions, or be inspired by our work.</p>\n<p><strong>If you&apos;ve recently carried out some effective altruist activity, come here and let us know about it.</strong></p></body></html>", "user": {"username": "Kaj_Sotala"}}, {"_id": "mXhAFQC7yf6sHPD2v", "title": "Meetup : Doing Good Better - Rory Brooks & Will MacAskill", "postedAt": "2014-10-09T15:42:51.178Z", "htmlBody": "<html><body><h2>Discussion article for the meetup : <a href=\"/meetups/u\">Doing Good Better - Rory Brooks &amp; Will MacAskill</a></h2>\n\t\t  <div>\n\t\t\t\t<p>\n\t\t    \t<strong>WHEN:</strong> \n\t\t    \t<span>15 October 2014 07:00:00PM (+0100)</span><br>\n\t\t\t\t</p>\n\t\t\t\t<p>\n\t\t    \t<strong>WHERE:</strong> \n\t\t    \t<span>Palmerston Room, St John&apos;s College, Cambridge, United Kingdom</span>\n\t\t\t\t</p>\n\t\t  </div><!-- .meta -->\n\t\t  <div>\n\t\t    <div><p>If you want to make the world a better place, you need to know how. Come and hear a philanthropist and a non-profit founder discuss how we can use evidence to figure out how best to do good, and join us afterwards for a drinks reception. Rory Brooks is the co-founder of private equity group MML Capital and one of Britain&#x2019;s biggest philanthropists, having funded the Brooks World Poverty Institute at Manchester University.\nWill MacAskill is the co-founder of Giving What We Can and 80,000 Hours. He is a research fellow at Emmanuel College, writes a column in Atlantic spin-off Qz.com and has published in top philosophy journal Ethics.\nThis event is co-hosted by Giving What We Can: Cambridge and 80,000 Hours: Cambridge</p></div>\n\t\t  </div><!-- .content -->\n\t\t<h2>Discussion article for the meetup : <a href=\"/meetups/u\">Doing Good Better - Rory Brooks &amp; Will MacAskill</a></h2></body></html>", "user": {"username": "mattvdm"}}, {"_id": "ih4o9NbgwgdgfqmLh", "title": "Meetup : Challenges of Effective Altruism", "postedAt": "2014-10-08T20:33:23.917Z", "htmlBody": "<html><body><h2>Discussion article for the meetup : <a href=\"/meetups/t\">Challenges of Effective Altruism</a></h2>\n\t\t  <div>\n\t\t\t\t<p>\n\t\t    \t<strong>WHEN:</strong> \n\t\t    \t<span>12 October 2014 11:00:00AM (-0700)</span><br>\n\t\t\t\t</p>\n\t\t\t\t<p>\n\t\t    \t<strong>WHERE:</strong> \n\t\t    \t<span>Seattle, WA, USA</span>\n\t\t\t\t</p>\n\t\t  </div><!-- .meta -->\n\t\t  <div>\n\t\t    <div><p>From Facebook ( <a href=\"https://www.facebook.com/events/378328112316907/\">https://www.facebook.com/events/378328112316907/</a> ):</p>\n\n<p>&quot;EA was a great leap forward in charitable efficacy, but there&apos;s no reason to believe it was the final one. This meeting will be about identifying areas where EA is weak and potential improvements. Possible topics include:</p>\n\n<p>What kind of charities/causes does EA favor? Why does it favor them?\nWhat important causes is it missing? How do we want to address that?\nOur best measurement tool right now is RCTs. When do those not work? What can we use instead?\nWhat is the efficient amount of energy to put into evaluating efficacy? How do you decide?</p>\n\n<p>This is about the worst possible intro topic to EA, so we&apos;ll be doing a special &quot;intro to EA&quot; meeting for newbies. The full schedule is as folows\n11: newbies + helpful veterans show up\n11:15: intro meeting starts\n12:00: regular meeting starts&quot;</p></div>\n\t\t  </div><!-- .content -->\n\t\t<h2>Discussion article for the meetup : <a href=\"/meetups/t\">Challenges of Effective Altruism</a></h2></body></html>", "user": {"username": "riceissa"}}, {"_id": "hkimyETEo76hJ6NpW", "title": "On Caring", "postedAt": "2014-10-07T05:12:16.238Z", "htmlBody": "<p><i>This version of the essay has been lightly edited. You can find the original </i><a href=\"https://web.archive.org/web/20200108195437/http://mindingourway.com/on-caring/\"><i><u>here</u></i></a><i>.</i></p><h1>1</h1><p>I'm not very good at <i>feeling</i> the size of large numbers. Once you start tossing around numbers larger than 1,000 (or maybe even 100), the numbers just seem \"big\".</p><p>Consider Sirius, the brightest star in the night sky. If you told me that Sirius is as big as a million Earths, I would feel like that's a lot of Earths. If, instead, you told me that you could fit a <i>billion</i> Earths inside Sirius … I would still just feel like that's a lot of Earths.</p><p>The feelings are almost identical. <i>In context</i>, my brain grudgingly admits that a billion is a lot larger than a million, and puts forth a token effort to feel like a one-billion-Earths-sized star is bigger than a one-million-Earths-sized star. But out of context — if I weren’t anchored at \"a million\" when I heard \"a billion\" — both of these numbers just feel vaguely large.</p><p>I feel a <i>little</i> respect for the bigness of numbers if you pick really, really large numbers. If you say, \"One followed by 100 zeroes,\" then this feels <i>a lot</i> bigger than a billion. But it certainly doesn't feel (in my gut) like it's 10 000 000 000 000 000 000 000 000 000 000 000 000 000 000 000 000 000 000 000 000 000 000 000 000 000 000 000 000 000 000 times bigger than a billion. Not in the way that four apples <i>internally feels</i> like twice as many as two apples. My brain can't even begin to wrap itself around this sort of magnitude differential.</p><p>This phenomenon is related to <a href=\"http://lesswrong.com/lw/hw/scope_insensitivity/\">scope insensitivity</a>, and it's important to me because I live in a world where sometimes the things I care about are really, really numerous.</p><p>For example, <a href=\"https://www.worldbank.org/en/topic/poverty/overview\">billions of people live in dire poverty</a>, with hundreds of millions of them deprived of basic needs and/or dying from disease. And though most of them are out of my sight, I still care about them.</p><p>The loss of a human life with all its joys and all its sorrows is tragic no matter what the cause, and the tragedy is not reduced simply because I was far away, or because I did not know of it, or because I did not know how to help, or because I was not personally responsible.</p><p>Knowing this, I care about every single individual on this planet. The problem is, my brain is <i>simply incapable</i> of taking the amount of caring I feel for a single person and scaling it up by a billion times. I lack the internal capacity to feel that much. My care-o-meter simply doesn't go up that far.</p><p>And this is a problem.</p><h1>2</h1><p>It's a common trope that courage isn't about being fearless; it's about being afraid but <i>doing the right thing anyway</i>. In the same sense, caring about the world isn't about having a gut feeling that corresponds to the amount of suffering in the world; it's about <i>doing the right thing anyway</i>. Even without the feeling.</p><p>My internal care-o-meter was calibrated to deal with <a href=\"http://en.wikipedia.org/wiki/Dunbar's_number\">about 150 people</a>, and it <i>simply can't express</i> the amount of caring that I have for billions of sufferers. The internal care-o-meter just doesn't go up that high.</p><p>Humanity is playing for unimaginably high stakes. At the very least, there are billions of people suffering today. At the worst, there are quadrillions (or more) potential humans, transhumans, or posthumans whose existence depends upon what we do here and now. All the intricate civilizations that the future could hold, the experience and art and beauty that is possible in the future, depends upon the present.</p><p>When you're faced with stakes like these, your internal caring heuristics — calibrated on numbers like 10 or 20, and <a href=\"http://en.wikipedia.org/wiki/Dunbar's_number\">maxing out around </a>150 — completely fail to grasp the gravity of the situation.</p><p>Saving a person's life feels <i>great</i>, and <a href=\"http://lesswrong.com/lw/hx/one_life_against_the_world/\">it would probably feel just about as good to save one life as it would feel to save the world</a>. It surely wouldn't be <i>many billion times</i> more of a high to save the world, because your hardware can't express a feeling a billion times bigger than the feeling of saving a person's life. But even though the altruistic high from saving someone's life would be shockingly similar to the altruistic high from saving the world, always remember that <i>behind</i> those similar feelings there is a whole world of difference.</p><p>Our internal care-feelings are woefully inadequate for deciding how to act in a world with big problems.</p><h1>3</h1><p>There's a mental shift that happened to me when I first started internalizing scope insensitivity. It is a little difficult to articulate, so I'm going to start with a few stories.</p><p>Consider Alice, a software engineer at Amazon in Seattle. Once a month or so, college students show up on street corners with clipboards, looking ever more disillusioned as they struggle to convince people to donate to <a href=\"http://www.doctorswithoutborders.org/\">Doctors Without Borders</a>. Usually, Alice avoids eye contact and goes about her day, but this month they finally manage to corner her. They explain Doctors Without Borders, and she actually has to admit that it sounds like a pretty good cause. She ends up handing them $20 through a combination of guilt, social pressure, and altruism, and then rushes back to work. (Next month, when they show up again, she avoids eye contact.)</p><p>Now consider Bob, who has been given the <a href=\"http://en.wikipedia.org/wiki/Ice_Bucket_Challenge\">Ice Bucket Challenge</a> by a friend on Facebook. He feels too busy to do the challenge, and instead just donates $100 to <a href=\"http://www.alsa.org/\">ALSA</a>.</p><p>Now consider Christine, who is in the college sorority ΑΔΠ. ΑΔΠ is engaged in a competition with ΠΒΦ (another sorority) to see who can raise the most money for the National Breast Cancer Foundation in a week. Christine has a competitive spirit and gets engaged in fundraising, and gives a few hundred dollars herself over the course of the week (especially at times when ΑΔΠ is especially behind).</p><p>All three of these people are donating money to charitable organizations, and that's great. But notice that there's something similar in these three stories: These donations are largely motivated by a <i>social context</i>. Alice feels obligation and social pressure. Bob feels social pressure and maybe a bit of camaraderie. Christine feels camaraderie and competitiveness. These are all fine motivations, but notice that these motivations are related to the <i>social setting</i>, and only tangentially to the <i>content</i> of the charitable donation.</p><p>If you took Alice or Bob or Christine aside and asked them why they aren't donating <i>all</i> of their time and money to these causes that they apparently believe are worthwhile, they'd look at you funny and they'd probably think you were being rude (with good reason!). If you pressed, they might tell you that money is a little tight right now, or that they would donate more if they were a better person.</p><p>But the question would still feel kind of <i>wrong</i>. Giving all of your money away is just not what you do with money. We can all <i>say out loud</i> that people who give all of their possessions away are really great, but behind closed doors we all know that those people are crazy. (Good crazy, perhaps, but crazy all the same.)</p><p>This is a mindset that I inhabited for a while. But there's an alternative mindset that can hit you like a freight train when you start internalizing scope insensitivity.</p><h1>4</h1><p>Consider Daniel, a college student. Shortly after the <a href=\"http://en.wikipedia.org/wiki/Deepwater_Horizon_oil_spill\">Deepwater Horizon</a> BP oil spill, he encounters one of those people with the clipboards on the street corners, soliciting donations to the <a href=\"http://www.worldwildlife.org/\">World Wildlife Foundation</a>. They're trying to save as many oiled birds as possible. Normally, Daniel would simply dismiss the charity as Not The Most Important Thing, or Not Worth His Time Right Now, or Somebody Else's Problem, but this time Daniel has been thinking about how his brain is bad at numbers and decides to do a quick sanity check.</p><p>He pictures himself walking along the beach after the oil spill and encountering a group of people cleaning birds as fast as they can. They simply don't have the resources to clean all of the available birds. A pathetic young bird flops toward his feet, slick with oil, eyes barely able to open. He kneels down to pick it up and help it onto the table. One of the bird-cleaners informs him that they won't have time to get to that bird themselves, but he could pull on some gloves and could probably save the bird with three minutes of washing.</p><figure class=\"image\"><img src=\"http://res.cloudinary.com/cea/image/upload/v1667995740/mirroredImages/hkimyETEo76hJ6NpW/yzv0psp0mbvcfcsdz2vd.jpg\"></figure><p>Daniel decides that he <i>would</i> spend three minutes of his time to save the bird, and that he would <i>also</i> be happy to pay at least $3 to have someone else spend a few minutes cleaning the bird. He introspects and finds that this is not just because he imagined a bird right in front of him: He feels that it is <i>worth</i> at least three minutes of his time (or $3) to save an oiled bird in some vague, platonic sense.</p><p>And, because he's been thinking about scope insensitivity, he <i>expects</i> his brain to misreport how much he actually cares about large numbers of birds; the internal feeling of caring can't be expected to line up with the actual importance of the situation. So instead of just <i>asking his gut</i> how much he cares about de-oiling lots of birds, he shuts up and multiplies.</p><p><a href=\"http://dailydeadbirds.com/\">Thousands and thousands</a> of birds were oiled by the BP spill alone. After shutting up and multiplying, Daniel realizes (with growing horror) that the amount he <i>actually</i> cares about oiled birds is lower-bounded by two months of hard work and/or fifty thousand dollars. And that's not even counting wildlife threatened by <a href=\"http://en.wikipedia.org/wiki/List_of_oil_spills\">other oil spills</a>.</p><p>And if he cares that much about <i>de-oiling birds</i>, then how much does he actually care about factory farming, nevermind hunger, or poverty, or sickness? How much does he actually care about wars that ravage nations? About neglected, deprived children? About the future of humanity? He <i>actually</i> cares about these things to the tune of much more money than he has, and much more time than he has.</p><p>For the first time, Daniel sees a glimpse of how much he actually cares, and how poor a state the world is in.</p><p>This has the strange effect that Daniel's reasoning goes full-circle, and he realizes that he actually <i>can't</i> care about oiled birds to the tune of 3 minutes or $3 — not because the birds aren't <i>worth</i> the time and money (in fact, he thinks that the economy produces things priced at $3 which are worth less than a bird's survival), but because he can't spend <i>his</i> time or money on saving the birds. The opportunity cost suddenly seems far too high: There is <i>too much else to do!</i> People are sick and starving and dying! The very future of our civilization is at stake!</p><p>Daniel doesn't wind up giving $50,000 to the World Wildlife Fund, and he also doesn't donate to the ALS Association or the National Breast Cancer Foundation. But if you ask <i>Daniel</i> why he's not donating all his money, he won't look at you funny or think you're rude. He's left the place where you don't care far behind, and has realized that <i>his mind was lying to him the whole time</i> about the gravity of the real problems.</p><p>Now he realizes that he <i>can't possibly do enough</i>. After adjusting for his scope insensitivity (and the fact that his brain lies about the size of large numbers), even the \"less important\" causes like the WWF suddenly seem worthy of dedicating a life to. Wildlife destruction and ALS and breast cancer are suddenly all problems that he would <i>move mountains</i> to solve — except he's finally understood that there are just too many mountains, and ALS isn't the bottleneck, and AHHH HOW DID ALL THESE MOUNTAINS GET HERE?</p><p>In the original mindstate, the reason he didn't drop everything to work on ALS was because it just didn't seem … pressing enough. Or tractable enough. Or important enough. Kind of. These are sort of the reason, but the real reason is more that the concept of \"dropping everything to address ALS\" never even <i>crossed his mind</i> as a real possibility. The idea was too much of a break from the standard narrative. It wasn't his problem.</p><p>In the new mindstate, <i>everything</i> is his problem. The only reason he's not dropping everything to work on ALS is because there are far too many things to do first.</p><p>Alice and Bob and Christine usually aren't spending time solving all the world's problems because they forget to see them. If you remind them — put them in a social context where they remember how much they care (hopefully without guilt or pressure) — then they'll likely donate a little money.</p><p>By contrast, Daniel and others who have undergone the mental shift aren't spending time solving all the world's problems because there are <i>just too many problems</i>. (Daniel hopefully goes on to discover movements like effective altruism and starts contributing toward fixing the world's most pressing problems.)</p><h1>5</h1><p>I'm not trying to preach here about how to be a good person. You don't need to share my viewpoint to be a good person (obviously).</p><p>Rather, I'm trying to point at a shift in perspective. Many of us go through life understanding that we <i>should</i> care about people suffering far away from us, but failing to. I think that this attitude is tied, at least in part, to the fact that most of us implicitly trust our internal care-o-meters.</p><p>The \"care feeling\" isn't usually strong enough to compel us to frantically save everyone dying. So while we acknowledge that it would be <i>virtuous</i> to do more for the world, we think that we <i>can't</i>, because we weren't gifted with that virtuous extra-caring that prominent altruists must have.</p><p>But this is an error — prominent altruists aren't the people who have a larger care-o-meter; they're the people who have <i>learned not to trust their care-o-meters</i>.</p><p>Our care-o-meters are broken. They don't work on large numbers. Nobody has one capable of faithfully representing the scope of the world's problems. But the fact that you can't <i>feel</i> the caring doesn't mean that you can't <i>do</i> the caring.</p><p>You don't get to feel the appropriate amount of \"care\" in your body. Sorry — the world's problems are just too large, and your body is not built to respond appropriately to problems of this magnitude. But if you choose to do so, you can still <i>act</i> like the world's problems are as big as they are. You can stop trusting internal feelings to guide your actions and switch over to manual control.</p><h1>6</h1><p>This, of course, leads us to the question of \"What the hell do you do, then?\"</p><p>And I don't really know yet. (Though I'll plug the <a href=\"http://givingwhatwecan.org/\">Giving What We Can pledge</a>, <a href=\"http://givewell.org/\">GiveWell</a>, <a href=\"http://intelligence.org/\">MIRI</a>, and <a href=\"http://www.fhi.ox.ac.uk/\">The Future of Humanity Institute</a> as a good start.)</p><p>I think that at least part of it comes from a certain sort of desperate perspective. It's not enough to think you <i>should</i> change the world — you also need the sort of desperation that comes from realizing that you would dedicate your entire life to solving the world's 100th biggest problem if you could, but you can't, because there are 99 bigger problems you have to address first.</p><p>I'm not trying to guilt you into giving more money away — becoming a philanthropist is <i>really, really hard</i>. (If you're <i>already</i> a philanthropist, then you have my respect and my affection.) First it requires you to have money, which is uncommon, and then it requires you to <i>throw that money at distant, invisible problems</i>, which is not an easy sell to a human brain. <a href=\"http://en.wikipedia.org/wiki/Akrasia\">Akrasia</a> is a formidable enemy. And more importantly, guilt doesn't seem like a good long-term motivator: If you want to join the ranks of people saving the world, I would rather you join them proudly. There are many trials and tribulations ahead, and we'd do better to face them with our heads held high.</p><h1>7</h1><p>Courage isn't about being fearless; it's about being able to do the right thing even if you're afraid.</p><p>And similarly, addressing the major problems of our time isn't about feeling a strong compulsion to do so. It's about trying to address them even when internal compulsion utterly fails to capture the scope of the problems we face.</p><p>It's easy to look at especially virtuous people — Gandhi, Mother Teresa, Nelson Mandela — and conclude that they must have cared more than we do. But I don't think that's the case.</p><p>Nobody gets to comprehend the scope of these problems. The closest we can get is doing the multiplication: finding something we care about, putting a number on it, and multiplying. And then trusting the numbers more than we trust our feelings.</p><p>Because our feelings lie to us.</p><p>When you do the multiplication, you realize that addressing global poverty and building a brighter future deserve more resources than currently exist. There is not enough money, time, or effort in the world to do what we need to do.</p><p>There is only you, and me, and everyone else who is trying anyway.</p><h1>8</h1><p>You can't actually feel the weight of the world. The human mind is not capable of that feat.</p><p>But sometimes, you can catch a glimpse.</p><p>&nbsp;</p><p>&nbsp;</p><p><i>This work is licensed under a&nbsp;</i><a href=\"https://creativecommons.org/licenses/by/4.0/\"><i>Creative Commons Attribution 4.0 International License</i></a><i>.</i></p>", "user": {"username": "So8res"}}, {"_id": "EgMRzYLjRxXhceCxH", "title": "Peter's Personal Review for July-Sep 2014", "postedAt": "2014-10-06T23:29:47.195Z", "htmlBody": "<html><body><p>This year, I&apos;ve been doing three month personal reviews (<a href=\"http://everydayutilitarian.com/essays/personal-review-for-december-2013-february-2014/\">Dec &apos;13 - Feb &apos;14</a>, <a href=\"http://everydayutilitarian.com/essays/personal-review-for-march-may-2014/\">March-May</a>, <a href=\"http://everydayutilitarian.com/essays/personal-review-for-may-june-2014/\">May-June</a>) to track my progress against my EA goals. &#xA0;In this model, I review what I have done over the past three months, where it has gotten me, and then reflect upon it. &#xA0;In doing this review, I hope to be not all that different from the three month review of any other EA org, except I&apos;m an EA org of precisely one person.<br><br>Hopefully, posting such a review here is useful as a case-study of a particular effective altruist approach, and you might find something useful in it, or have some useful commentary to offer me. &#xA0;I&apos;d also love to see some of these from other people. &#xA0;(Just sayin&apos;.)</p>\n<h2><br></h2>\n<h2>General Philosophy</h2>\n<p>The overall idea is that I self-identify as an effective altruist and want to make sure that a large bulk of my time is spent on some sort of personally optimal path to EA impact goodness.</p>\n<p>More broadly, I&apos;ve recently taken to heart the idea that since I am pretty young and don&apos;t yet have a good idea of what my talents can get me and what my options are, I should try to do a wide variety of things that seem like they could be useful down the road, and then assess them later. &#xA0;One could think of this as the &quot;explore&quot; mode of an <a href=\"http://en.wikipedia.org/wiki/Multi-armed_bandit\">&quot;explore-exploit&quot; model</a>.</p>\n<p>&#xA0;</p>\n<h2>How Did I Spend My Time?</h2>\n<p>On 27 Jul 2014, I switched to <a href=\"https://www.toggl.com/\">Toggl</a> from Google Calendar for my time tracking of choice (more notes on productivity forthcoming). &#xA0;This means I now have much finer-grained time data, potentially down to the minute, though there are some inaccuracies. &#xA0;Here is how I spent my time over August and September.</p>\n<table>\n<tbody>\n<tr>\n<th>Project</th><th>Total</th><th>Per Week[1]</th><th>% Week</th>\n</tr>\n<tr>\n<td>Sleep</td>\n<td>482.2</td>\n<td>56.3</td>\n<td>33.5</td>\n</tr>\n<tr>\n<td>Day Job</td>\n<td>250.86</td>\n<td>29.3</td>\n<td>17.4</td>\n</tr>\n<tr>\n<td>Social</td>\n<td>238.3</td>\n<td>27.8</td>\n<td>16.5</td>\n</tr>\n<tr>\n<td>Break</td>\n<td>113.94</td>\n<td>13.3</td>\n<td>7.9</td>\n</tr>\n<tr>\n<td>Prep[2]</td>\n<td>107.6</td>\n<td>12.6</td>\n<td>7.5</td>\n</tr>\n<tr>\n<td>Programming</td>\n<td>76.6</td>\n<td>8.9</td>\n<td>5.3</td>\n</tr>\n<tr>\n<td>EA Direct</td>\n<td>65.9</td>\n<td>7.7</td>\n<td>4.6</td>\n</tr>\n<tr>\n<td>Other</td>\n<td>39.4</td>\n<td>4.6</td>\n<td>2.7</td>\n</tr>\n<tr>\n<td>Planning</td>\n<td>32.7</td>\n<td>3.8</td>\n<td>2.3</td>\n</tr>\n<tr>\n<td>Moving</td>\n<td>30.8</td>\n<td>3.6</td>\n<td>2.1</td>\n</tr>\n<tr>\n<td>Email</td>\n<td>26.8</td>\n<td>3.1</td>\n<td>1.9</td>\n</tr>\n<tr>\n<td>Entrepreneurship</td>\n<td>19.3</td>\n<td>2.2</td>\n<td>1.3</td>\n</tr>\n<tr>\n<td>Food[3]</td>\n<td>12.2</td>\n<td>1.4</td>\n<td>0.8</td>\n</tr>\n<tr>\n<td>Cleaning</td>\n<td>6</td>\n<td>0.7</td>\n<td>0.4</td>\n</tr>\n<tr>\n<td>Errands</td>\n<td>4.1</td>\n<td>0.5</td>\n<td>0.3</td>\n</tr>\n<tr>\n<td>Exercise</td>\n<td>3.2</td>\n<td>0.4</td>\n<td>0.2</td>\n</tr>\n</tbody>\n</table>\n<p>[1]:&#xA0;On average &#x2013; obviously not all of these activities took place every week.<br>[2]: Includes getting ready in the morning and all commuting to and from places (not just work).<br>[3]: Includes making, but not eating food.</p>\n<p>&#xA0;</p>\n<h2>What Did I Accomplish?</h2>\n<p><em>My Day Job</em></p>\n<p>Besides sleeping, I spent the next most largest amount of time on my day job.</p>\n<p>This job is full-time, and supposed to be 40hrs a week or more. &#xA0;The reason why this appears as under 30hrs a week over the two months is because (a) I took one week off for vacation and (b) working 8 hours of day is actually very difficult. &#xA0;What I mean by this is that when I use Toggl, any distraction -- to read Reddit, eat food, go to the bathroom, no matter how brief -- is counted as something other than work. &#xA0;This means that I regularly spend ten hours a day in the office, but only get about 7 hours of actual work done. &#xA0;...If someone is coming in at 9am and leaving by 5pm, they&apos;re certainly not working an actual 40 hour week. &#xA0;Run a timer for yourself, and you&apos;ll be amazed by what I mean.</p>\n<p>At my last three month review, I was just starting as a Software Engineer Intern, and had not done any actual work yet. &#xA0;In the past three months, I have successfully completed my internship, been hired as a permanent Software Engineer, and then transferred to become a Data Scientist. &#xA0;In doing so, I learned a lot more about computer programming and a lot more about data science.</p>\n<p>I think my job has been the most valuable for the immense amount of learning. &#xA0;With my day job and another ~9 hours a week of additional programming training, I think it&apos;s not an exaggeration to suggest that my programming knowledge has more than doubled, even though I only went from 700hrs of programming work to ~1100hrs of programming work. &#xA0;Having mentorship is pretty useful. &#xA0;I strengthened my knowledge of Ruby on Rails and R, and added knowledge in Coffeescript, Angular, Knockout, Mongo, Express, Node.js, VimScript, and Shell script.</p>\n<p>Also, my day job has afforded me the ability to donate more than $3K to date, and save even more than that to donate later.</p>\n<div><address>\n<p>&#xA0;</p>\n<p>Entrepreneurship</p>\n<p><span>As an off-shoot to learning how to program, I&apos;ve started working on a few &quot;passive income&quot;&#xA0;entrepreneurship&#xA0;projects -- the kinds of projects that I hope will bring in some additional money, but not require too much maintenance. &#xA0;I think doing projects like these is good for (a) building programming skills, (b) building management/entrepreneurship&#xA0;skills that may be valuable if I want to work on start-ups later, (c) building career capital, and (d) potentially earning more money.</span></p>\n<p><span>So I compiled a list of ideas and got to 54 of them. &#xA0;Many of them sucked, but I got to work on a few of them that I thought might not suck that much.</span></p>\n<p><span>The first project I launched was <a href=\"http://64or32.com/\">64or32.com</a>, which is a website that tells you what type of processor your computer is (64-bit or 32-bit). &#xA0;The website contains an ad, which has made ~$8 to date. &#xA0;Not quite enough to cover the $10 of domain costs or the ~5 hours of programming time, but still a good start in that I have officially made money online and learned a bit.</span></p>\n<p><span>I have a couple more ideas for ad-supported websites that I want to launch that might go live in the future, but ultimately I&apos;d like to get away from that and toward other monetization models. &#xA0;I hope by the next review I&apos;ll be announcing the launch of some much meatier ideas that are currently in the works, and more than $8 in revenue.</span></p>\n<p><span>But currently, like all great companies, I am in the red.</span></p>\n<p><span><br></span></p>\n<p>Direct EA Work</p>\n<p><span>One of my main career goals since I started thinking about careers has always been to keep a careful eye toward whether I&apos;d be more valuable doing direct work.</span></p>\n<p><span>So far, I&apos;ve experimented with 13 different EA projects. &#xA0;I hope to pare this down significantly to the top performers soon, as I don&apos;t have </span>that <span>much time to spend on these projects.</span></p>\n<ul>\n<li><span><strong>Charity Science: </strong><a href=\"http://charityscience.com/\">Charity Science</a> is the EA org being run by Joey Savoie, Xio Kikauka, and Tom Ash that aims to fundraise for GiveWell top charities. &#xA0;So far they&apos;ve raised a good bit of money. &#xA0;I&apos;ve been helping them out with strategy.</span></li>\n</ul>\n<ul>\n<li><span><strong>The Birthday for Charity Project: </strong>One of Charity Science&apos;s fundraising campaigns has been to encourage EAs to <a href=\"http://www.charityscience.com/birthday-fundraisers.html\">raise money for their birthdays</a>. &#xA0;This has been a surprisingly good value for a very small amount of time. &#xA0;All my work on this project sums to 2.5 hours, and the project has brought in nearly $9K. &#xA0;Split that among four people, and it&apos;s still $900/hr. I don&apos;t think I&apos;ve ever had returns that good before.</span></li>\n</ul>\n<ul>\n<li><span><strong>EA Survey Data Analysis: </strong>Back in May, .impact launched <a href=\"http://effectivealtruismhub.com/survey\">a survey of effective altruists</a>&#xA0;(still open if you want to participate). &#xA0;I&apos;m working on doing the data analysis for that. &#xA0;I&apos;m almost finished. &#xA0;Expect results by the end of the month.</span></li>\n</ul>\n<ul>\n<li><span><strong>A Study of Facebook Veg Ads: </strong>I&apos;m working to study the effectiveness of vegetarian advocacy Facebook ads on getting people to go vegetarian. &#xA0;Work is slow, but steady.</span></li>\n</ul>\n<ul>\n<li><span><strong>EA Profiles and the EA Donation Registry:&#xA0;</strong>Recently launched were&#xA0;<a href=\"http://effectivealtruismhub.com/user/profiles\">EA Profiles</a>&#xA0;and the&#xA0;<a href=\"http://effectivealtruismhub.com/donations\">EA Donation Registry</a>. &#xA0;I helped a bit with putting that together, but it was nearly entirely the work of Tom Ash.</span></li>\n</ul>\n<ul>\n<li><span><strong>This EA Forum: </strong>I helped a bit with advising Ryan Carey on setting it up and being part of the initial seed content. &#xA0;I hope to write more blogs here to keep my karma count competitive. ;)</span></li>\n</ul>\n<ul>\n<li><span><strong>EA Job Board: </strong>The <a href=\"http://jobboard.im/\">EA Job Board</a> exists to help catalog jobs related to effective altruism. &#xA0;It still needs a few more features, but it&apos;s mostly finished and completely usable.</span></li>\n</ul>\n<ul>\n<li><span><strong>80K Trial Research: </strong>I&apos;ve been working with 80K on a trial basis to do some career research. &#xA0;I did a bit more research into foundations. &#xA0;Still need to work a lot more on this.</span></li>\n</ul>\n<ul>\n<li><span><strong>Chicago Skeptics Meetup: </strong>Charity Science has had a fair amount of success by networking with atheists and humanists in Vancouver. &#xA0;I went to the Chicago Skeptics Meetup to see if I could do the same thing. &#xA0;I only have been able to go once, so results are inconclusive, but I found another EA there and convinced him to sign up with Giving What We Can, so it didn&apos;t go all that badly. &#xA0;I&apos;m interested in going more, if just for social reasons.</span></li>\n</ul>\n<ul>\n<li><span><strong>Animal Rights Protesting:</strong> <a href=\"http://directactioneverywhere.com/\">Direct Action Everywhere</a> came to Chicago, so I went out to try out animal rights protesting and see what it&apos;s all about. &#xA0;It&apos;s exceedingly difficult to figure out if my participation had any value, but it was fun and a good way to expand my own comfort zone. &#xA0;More notes on this are forthcoming.</span></li>\n</ul>\n<div>\n<p><span>I&apos;m still not very clear on my value as a EA direct worker, relative to my value as a programmer / entrepreneur who can move money to direct workers. &#xA0;I think there has been a ton of value in having very high engagement with EA orgs that I donate with, however, and direct work has really helped with this.</span></p>\n<p><span><br></span></p>\n</div>\n<p>Moving</p>\n<p>In my previous review, I spent a lot of time moving again, switching to my second apartment. &#xA0;I think this was worth it, as I cut my rent down by $255/month (Chicago is expensive) and cut my commute down by 20 minutes a day (valued at $400/month) for a place I consider just as good (better in some aspects, worse in others). &#xA0;I expect it to be more than three months or more before I move again, so the 30 hours spent will ultimately get me ~$65/hour in value. &#xA0;Though moving is pretty stressful and I don&apos;t want to do it too often.</p>\n<p>&#xA0;</p>\n<p>Sleep, Break, and Social</p>\n<p><span>Sleep is 8 hours a day, which I consider pretty typical. &#xA0;I&apos;m considering experimenting with different methods of sleeping less (e.g., naps, caffeine, </span>maaaybe <span>modafinil), but ultimately I&apos;m pretty concerned that the desire to sleep less is a fallacy and actually I do more on 8 hours of sleep, since I&apos;m well-rested enough to do good work.</span></p>\n<p>Time spent on break is higher than in the last review, but I see this mostly as an artifact of switching to Toggl, and therefore being able to penalize the short 2-10 minute breaks that I used to not count. &#xA0;While I think it would be more productive to cut this down, I think I&apos;m at a pretty ideal point in terms of my break amount and spacing. &#xA0;While I don&apos;t want to break to excess, they are pretty important for restoring focus. &#xA0;Like sleep, I think breaks may be underrated by people who are focused on productivity.</p>\n<p>Lastly, my social time continues to be quite high at 27 hours a week. &#xA0;While down from the 37 hours a week of my summer time, it&apos;s not the focused 15 hours a week I achieved in February. &#xA0;I&apos;m excited, however, to make social connections here in Chicago, and think spending a large amount of time upfront making connections is pretty justified. &#xA0;A lot of my social time is also spent with my girlfriend, who I like a lot. &#xA0;Furthermore, I went on vacation for a week, went to Gen Con, and went to a college reunion, all three of which made social time larger than what would be normal.</p>\n<p>&#xA0;</p>\n<div>\n<p>Prepping, Planning, Email, Food, Cleaning, Errands, and Exercise</p>\n<p>It&apos;s nice to have Toggl now because my estimates for these activities will be much more active. &#xA0;There&apos;s not a whole lot I have to comment on any of these. &#xA0;Some people may be interested in how a lot of these times are so low, and I plan to offer more discussion about that at a later date. &#xA0;(Though the reason why exercise is so low is because I&apos;ve fallen off the exercise wagon a couple times, and I hope to have this be a larger amount by the next review.)</p>\n<p>&#xA0;</p>\n<h2>Conclusion</h2>\n<p><span>I&apos;ve been very excited about the rich variety of activities I&apos;ve been able to partake in, from socializing to my day job to a rich life of EA and entrepreneurship projects. &#xA0;However, I&apos;ve also felt the cost of having my attention divided in too many places, and not being able to have enough time to focus on any individual thing to the degree that it deserves to really see it through.</span></p>\n<p><span>I&apos;ve been experimenting with restructuring my schedule to find more time to do things, and have had a fair amount of success with this in the past week. &#xA0;However, I think I&apos;ll soon be faced with the harsh reality that I&apos;ll just need to prioritize things and decide which things are providing the highest amount of value, and ruthlessly end the remainder. &#xA0;I don&apos;t currently know yet which remainder to end, though.</span></p>\n<p><span>Ultimately, I&apos;m still interested in whether I should continue my day job, or whether I should pursue independent work (either in entrepreneurship or in direct work), though I feel a lot less conflicted in this than I was a month ago. &#xA0;I think that the day job is a good direction for me in terms of providing real skill building, good career capital, status, and the ability to donate.</span></p>\n<p><span>Three months ago, I was just moving into Chicago, having no idea what is ahead of me. &#xA0;In many ways, things are different than they were in college, where I knew what I would be doing a year ahead. &#xA0;Now, I&apos;m not even sure where I&apos;ll be -- both physically and in terms of my beliefs about what my future should be -- by my next review.</span></p>\n<p><span>I think the wisdom of keeping options open is very wise, and by my variety of activities, I think I&apos;ve done this to it&apos;s fullest extent. &#xA0;I&apos;ve often found that I have no idea what value certain projects will have until I do them, and so -- until then -- I&apos;ll just continue to do.</span></p>\n<p><span>It&apos;s amazing how much you can get done if you just keep on doing things.</span></p>\n</div>\n</address></div></body></html>", "user": {"username": "Peter_Hurford"}}, {"_id": "7xFQAQrWuH4ye73QS", "title": "Open Thread 2", "postedAt": "2014-10-06T18:54:51.842Z", "htmlBody": "<html><body><p>Welcome to the second open thread on the Effective Altruism Forum. This is our place to discuss relevant topics that have not appeared in recent posts. Thanks to an upgrade by Trike Apps, each time you visit the open thread, new comments will now be highlighted!</p></body></html>", "user": {"username": "RyanCarey"}}, {"_id": "sm3axpxJLtphvF6Jj", "title": "How a lazy eater went vegan", "postedAt": "2014-10-06T17:56:15.718Z", "htmlBody": "<html><body><p>I went vegetarian in college, and had wanted to go vegan ever since I read Julia Galef&apos;s article on <a href=\"http://blogs.scientificamerican.com/guest-blog/2011/08/11/want-to-kill-fewer-animals-give-up-eggs-not-meat/\">why eating eggs may kill more animals than eating meat</a>. But I was nervous about the potential health consequences of going vegan, and a lot of the guides to going vegan made it sound like a ridiculous amount of work. Some guides seemed to assume you loved spending lots of time cooking. Or they&apos;d recommend other things I just couldn&apos;t see myself doing, like eating 6 cups of leafy greens per day for calcium. (6 cups may not sound like a lot, until you go to the grocery story and realize the big bags they sell there are only 2.5 cups. Try to imagine yourself eating two or more of those bags <em>every day.</em>)</p>\n<p>Eventually, though, I worked out a diet plan that would be both healthy and easy to follow. Cooking effort is minimal; everything can be made with a microwave and rice cooker. I don&apos;t claim the following diet is nutritionally optimal <em>a la</em> Soylent or MealSquares, but I <em>do </em>think it&apos;s probably healthier than the diet of the average American omnivore:</p>\n<ul>\n<li>Plan on getting most of your calories and protein from a mix of <a href=\"http://en.wikipedia.org/wiki/Cereal\">cereals</a> (bread, corn, rice, etc.) and legumes (beans, lentils, peanuts, soy, etc.)</li>\n<li>Keep fruit and vegetables around to snack on. A handful of baby carrots per day will take care of all your vitamin A needs.</li>\n<li>Adding a moderate amount of iodized salt to your meals is probably good idea, for both nutrition and taste.</li>\n<li>There are just two nutrients that you&apos;ll really need to get from supplements (or foods fortified with them): calcium and vitamin B12.&#xA0;</li>\n<li>I also take a vitamin D3 + K2 supplement, but that has more to do with not getting much sun than with veganism.</li>\n<li>So that your diet isn&apos;t <em>completely </em>boring, keep an eye out for good vegan and vegan-friendly grocery stores and restaurants. Chipotle and Trader Joe&apos;s are two examples of good vegan-friendly national chains.</li>\n</ul>\n<div>Looking over these bullet points, part of me doesn&apos;t believe it&apos;s really that simple... but it&apos;s what I&apos;m doing, and I have no major worries about my health or ability to be happy with this diet over the long haul. You should be aware that iron is an issue for <em>some </em>people, but most people don&apos;t have to worry about it. Also, there&#xA0;<em>may </em>be benefits from making an effort to consume creatine and omega-3 fatty acids, but if worrying about them seems like too much of a hassle, you&apos;ll probably be fine.</div>\n<div><br></div>\n<div>Since many in the Bay Area effective altruist community are into low-carb dieting for weight-loss purposes, I should address that. The most prominent low-carb advocates, like Gary Taubes and the late Robert Atkins, have made claims that simply have no scientific basis. For example, both have claimed that people can eat unlimited amounts of fatty foods and not gain weight, because only carbs cause weight gain. I&apos;ve never heard Taubes give a coherent account of how this is supposed to be true; Atkins claimed it was due to excess calories being excreted in the urine as ketones, but <a href=\"http://onlinelibrary.wiley.com/doi/10.1111/j.1753-4887.1974.tb05180.x/abstract\">urine ketone levels are too small for this to be possible</a>.</div>\n<div><br></div>\n<div>Some studies comparing low-carb diets to other diets have found <a href=\"http://www.ncbi.nlm.nih.gov/pmc/articles/PMC2949959/?log%24=activity\">essentially no difference</a>&#xA0;in terms of weight-loss, while others have found <a href=\"http://www.nejm.org/doi/full/10.1056/NEJMoa0708681#t=articleResults\">modest benefits for low-carb diets over low-fat diets</a>. Based on my own personal experience, and reading Yoni Freedhoff&apos;s book <em><a href=\"http://www.amazon.com/The-Diet-Fix-Diets-Yours/dp/0804137579\">The Diet Fix</a>, </em>I suspect any benefits of low-carb diets come from the fact that they also tend to be high-protein. I&apos;ve found that eating high-protein plant foods like soy and lentils works wonders in terms of my ability to eat in moderation without feeling hungry. For the past couple of weeks, I&apos;ve actually been making a conscious effort to eat <em>more </em>calories, mostly to avoid having to buy new pants again.</div>\n<div><br></div>\n<div>A final point to note is that there may be an <a href=\"http://sentientist.org/2013/05/20/the-ethical-case-for-eating-oysters-and-mussels/\">ethical case for eating bivalves</a>. I haven&apos;t tried this yet, mainly out of laziness (see the title of this post). However, it&apos;s something I may do in the future.</div></body></html>", "user": {"username": "TopherHallquist"}}, {"_id": "xDAJYSuNDJ2DXaxh9", "title": "Upcoming Meetups 2", "postedAt": "2014-10-05T22:41:58.103Z", "htmlBody": "<html><body><p><img src=\"https://i.imgur.com/JdBEdpu.jpg\" alt=\"\"></p>\n<p>Meetups coming up this fortnight are:</p>\n<ul>\n<li>5 Oct <a href=\"/meetups/q\">Stanford EA</a></li>\n<li>8 Oct <a href=\"/meetups/r\">Glasgow University: Peter Singer on Effective Altruism</a></li>\n<li>9 Oct <a href=\"/meetups/n\">Introduction to Effective Altruism in Finnish</a></li>\n<li>11 Oct <a href=\"/meetups/s\">Yale Effective Altruists</a></li>\n<li>12 Oct <a href=\"/meetups/t\">Seattle EA: Challenges of Effective Altruism</a></li>\n<li>12 Oct <a href=\"/meetups/w\">.impact&apos;s fortnightly projects meeting</a></li>\n<li>14 Oct <a href=\"/meetups/p\">EA University of York: Introduction to Effective Altruism and drinks</a></li>\n<li>14 Oct <a href=\"/meetups/k\">EA/LW Netherlands, on artificial intelligence</a></li>\n<li>15 Oct <a href=\"/meetups/u\">Cambridge, UK: Rory Brooks &amp; Will MacAskill</a></li>\n<li>16 Oct <a href=\"/meetups/x\">EA Brisbane</a></li>\n</ul>\n<p>There is also an <a href=\"/meetups/b\">upcoming meetup</a> in Madison, Wisconsin, whenever someone offers to co-organise this. The Effective Altruism Forum may have some new members from the Life You Can Save blog this week, so it will be good to add more meetups to the site, which I will add to this list.</p>\n<p><span>Lastly, the photo is from Effective Altruism NTNU, whose recent launch event packed out a lecture theatre with over 170 individuals. Congratulations, and good luck growing the Norwegian effective altruist community!</span></p></body></html>", "user": {"username": "RyanCarey"}}, {"_id": "QQXtNxjY7ioCedTfZ", "title": "Meetup : Peter Singer presents at Glasgow University", "postedAt": "2014-10-05T22:18:55.703Z", "htmlBody": "<html><body><h2>Discussion article for the meetup : <a href=\"/meetups/r\">Peter Singer presents at Glasgow University</a></h2>\n\t\t  <div>\n\t\t\t\t<p>\n\t\t    \t<strong>WHEN:</strong> \n\t\t    \t<span>08 October 2014 06:00:00PM (+0100)</span><br>\n\t\t\t\t</p>\n\t\t\t\t<p>\n\t\t    \t<strong>WHERE:</strong> \n\t\t    \t<span>Glasgow University</span>\n\t\t\t\t</p>\n\t\t  </div><!-- .meta -->\n\t\t  <div>\n\t\t    <div><p>Peter Singer presents at Boyd Orr:222, Lecture Theatre 2, Glasgow University</p>\n\n<p>If you&apos;d like to go to this, it&apos;s all sold out! But you can join Glasgow&apos;s Giving What We Can Group and attend one of their events later to meet other people interested in effective altruism. <a href=\"https://www.facebook.com/GivingWhatWeCanGlasgow\">https://www.facebook.com/GivingWhatWeCanGlasgow</a></p>\n\n<p><a href=\"https://www.facebook.com/events/1496390157285847/?ref=2&amp;ref_dashboard_filter=upcoming\">https://www.facebook.com/events/1496390157285847/?ref=2&amp;ref_dashboard_filter=upcoming</a></p></div>\n\t\t  </div><!-- .content -->\n\t\t<h2>Discussion article for the meetup : <a href=\"/meetups/r\">Peter Singer presents at Glasgow University</a></h2></body></html>", "user": {"username": "RyanCarey"}}, {"_id": "npKtTvHBRGDeSXhhT", "title": "Meetup : Stanford THINK", "postedAt": "2014-10-04T19:15:39.307Z", "htmlBody": "<html><body><h2>Discussion article for the meetup : <a href=\"/meetups/q\">Stanford THINK</a></h2>\n\t\t  <div>\n\t\t\t\t<p>\n\t\t    \t<strong>WHEN:</strong> \n\t\t    \t<span>05 October 2014 04:30:00PM (-0700)</span><br>\n\t\t\t\t</p>\n\t\t\t\t<p>\n\t\t    \t<strong>WHERE:</strong> \n\t\t    \t<span>Stanford University, Old Union rm 121</span>\n\t\t\t\t</p>\n\t\t  </div><!-- .meta -->\n\t\t  <div>\n\t\t    <div><p>Stanford&apos;s EA group meets here weekly; please stop by!</p></div>\n\t\t  </div><!-- .content -->\n\t\t<h2>Discussion article for the meetup : <a href=\"/meetups/q\">Stanford THINK</a></h2></body></html>", "user": {"username": "Kelsey Piper"}}, {"_id": "ktsPJuhvTvgG3nkKn", "title": "Introducing an EA Donation Registry", "postedAt": "2014-10-03T23:15:04.255Z", "htmlBody": "<html><body><p>One of the most important messages of effective altruism is that you can do a phenomenal amount of good through well-chosen donations. As a community, EAs also further this goal by publicly establishing a norm of giving to effective charities, making their own commitments to do so and encouraging others. With this in mind, we&#x2019;ve created an <a href=\"http://effectivealtruismhub.com/donations\">EA Donation Registry</a> through which people can share plans to donate (of any form, and to any cause), as well as record past donations that they&#x2019;ve made.</p>\n<p>If you&#x2019;ve donated to effective charities in the past or have plans to do so, then we&#x2019;d encourage you to <a href=\"http://effectivealtruismhub.com/donations/add\">sign up</a>. (Or if you already described your past or planned donations in the <a href=\"http://survey.effectivealtruismhub.com\">2014 EA Survey</a>, you can simply <a href=\"http://effectivealtruismhub.com/survey/sharing-your-survey-answers-your-ea-profile\">convert these to a registry entry</a> instead.) Peter Hurford&#x2019;s post <a href=\"/ea/7q/to_inspire_people_to_give_be_public_about_your/\">To Inspire People to Give, Be Public About Your Giving</a> succinctly describes some of the familiar reasons for doing so - it shows that giving large amounts to effective charities is something that people actually do, providing <a href=\"http://en.wikipedia.org/wiki/Social_proof\">social proof</a> and normalising and encouraging this, particularly among peer groups. We also hope that it can serve as a gentle prompt to action and commitment device, although understanding that plans change we&#x2019;ve given donors the ability to edit them at any time - it&apos;d be both expected and understood that many will do so. This a registry of plans, not necessarily pledges.</p>\n<p>You can already see hundreds of EAs&#x2019; past and planned donations on the registry. There&#x2019;s some inspiring material there, from the over $40 million that <a href=\"http://effectivealtruismhub.com/user/jim-greenbaum\">Jim Greenbaum</a> has given over his lifetime, to the many people aiming to donate substantial portions of their income, such as <a href=\"http://effectivealtruismhub.com/user/peter-singer\">Peter Singer</a>.&#xA0;</p>\n<p>We created this registry partly in response to requests for a cause neutral venue for donation plans. For example, you can use it to see people donating to <a href=\"http://effectivealtruismhub.com/donations/plans/animal-welfare\">animal charities</a> or <a href=\"http://effectivealtruismhub.com/donations/plans/existential-risk\">existential risk alleviation</a>. People concerned with animal welfare are pointed to it by Animal Charity Evaluators, taking the place of this functionality in the old Effective Animal Activism website; people reporting their donations to ACE are given the option of making them public on the registry at the same time. For people concerned with global poverty, we think that the Giving What We Can and Life You Can Save pledges are fantastic devices, with a clear message about the compelling case about giving money to those who need it most. We point people to <a href=\"http://www.givingwhatwecan.org/pledge\">the GWWC pledge</a> in the hope that they can take or build up to it, while also letting them share plans of any size on the registry.</p>\n<p>The registry is an open, community-owned project coordinated through .impact, so we&#x2019;d love to hear of any uses that you might make of it, and you can also send us suggestions or feedback via our <a href=\"http://effectivealtruismhub.com/contact\">contact form</a>. But most of all, we&#x2019;d encourage you to share your past and planned donations on it for the reasons above. You can register plans of any form and size via a free text field, so take a moment to consider if there are any that you&#x2019;d like to share - and if you&#x2019;ve yet to think about where you might donate, we hope that this will provide a great opportunity to do so!&#xA0;</p>\n<p><em>See also:&#xA0;<a href=\"http://bit.ly/introducing-ea-profiles-eaf\">Introducing EA Profiles</a></em></p></body></html>", "user": {"username": "Tom_Ash"}}, {"_id": "5kFwcwDawAHZx6Tqd", "title": "Introducing EA Profiles", "postedAt": "2014-10-03T23:01:37.317Z", "htmlBody": "<html><body><p>We&#x2019;re excited to announce <a href=\"http://effectivealtruismhub.com/user/profiles\">EA Profiles</a>, a new community platform for effective altruists. There are already hundreds of profiles for you to browse from members of the community such as Peter Singer and Jeff Kaufman, full of interesting information like people&#x2019;s favoured causes and charities, and the actions they&#x2019;re taking to make the world a better place. And you can <a href=\"http://effectivealtruismhub.com/user/register\">create your own right now</a>!</p>\n<p>The Profiles should serve as a virtual &#x201C;Who&#x2019;s Who&#x201D; of EA - a place to see information about those who identify with effective altruism, and share what we&#x2019;re doing to inspire and motivate others. They enable applications such as a <a href=\"http://effectivealtruismhub.com/map\">map of EAs</a> and a <a href=\"http://effectivealtruismhub.com/donations\">cause-neutral registry of past and planned donations</a>, which we cover in a <a href=\"/ea/94/introducing_an_ea_donation_registry/\">separate announcement</a>.&#xA0;</p>\n<p><a href=\"http://effectivealtruismhub.com/user/profiles\"><img src=\"http://effectivealtruismhub.com/sites/effectivealtruismhub.com/media/images/specific-pages/eaprofiles-mosaic.jpg\" alt=\"Individual members of the effective altruist community\"></a></p>\n<p>Your EA Profile provides a natural, standard way to share your identification with the ideas of effective altruism and the ways in which you and people you know can do enormous amounts of good, from spreading these ideas to donating to highly efficient charities. We know that people can be slow or cautious about sharing this, but for <a href=\"/ea/7q/to_inspire_people_to_give_be_public_about_your/\">familiar reasons</a> think that doing so is highly valuable, spreading and normalising a focus on effectiveness and high impact donations. And making a Profile is a great excuse to do so: you&#x2019;re sharing this information because we asked for it! You can then point people to it, potentially triggering interesting conversations with friends who might like to hear about the ways they can do the most good.</p>\n<p>Many of the Profiles come from answers which people opted to make public in the first <a href=\"http://survey.effectivealtruismhub.com/\">annual survey of effective altruists</a> this year (which is still open if you haven&#x2019;t taken it yet; if you have, you can <a href=\"http://effectivealtruismhub.com/survey/sharing-your-survey-answers-your-ea-profile\">retroactively make selected answers public in a Profile</a>, from your past donations to your location for the map). Peter Hurford is currently working on analysing the survey results and will share them and the raw data from the survey soon, but for now the EA Profiles provide some of the most interesting results: public information on the inspiring actions that individuals are taking.</p>\n<p>If you&#x2019;re interested in building up this project, or working on other similar projects, consider looking into <a href=\"http://www.dotimpact.im\">.impact</a>, a coordinated volunteer force working on potentially high-impact projects like this one.</p>\n<p><em>See also: <a href=\"/ea/94/introducing_an_ea_donation_registry/\">Introducing an EA Donation Registry</a></em></p></body></html>", "user": {"username": "Tom_Ash"}}, {"_id": "rAoznpQSF4u7XJWzW", "title": "Two interviews with Holden", "postedAt": "2014-10-03T21:44:12.163Z", "htmlBody": "<html><body><p>80,000 Hours has just released two interviews with Holden Karnofsky (the co-founder of GiveWell), in which we discuss: (i) should effective altruists mainly aim to be good at their jobs rather than pick paths that seems &apos;high-impact&apos; (ii) to what extent do the results of GiveWell Labs apply to effective altruists choosing careers.</p>\n<p>The full interviews are <a href=\"https://80000hours.org/2014/10/interview-holden-karnofsky-on-the-importance-of-personal-fit/\">here</a> and <a href=\"https://80000hours.org/2014/10/interview-holden-karnofsky-on-cause-selection/\">here</a>.  I&apos;ve pasted the main points Holden made here:</p>\n<p>&#xA0;</p>\n<p><strong>Personal fit</strong></p>\n<p>\n</p><p>\n</p><ul>\n<li>Your degree of &#x201C;fit&#x201D; with a role depends on your chances of ultimately excelling in the role if you work at hard at it, arising from the match between yourself and the requirements of the role.</li>\n</ul>\n<ul>\n<li>Holden believes that if you want to make a difference, seeking out roles with which you have a high degree of fit should be a top priority, especially early in your career. This is because:</li>\n</ul>\n<ul>\n<li>Fit is easier to judge than many other factors, such as how much immediate impact you have, which means it&#x2019;s easier to improve your degree of fit over time.</li>\n</ul>\n<ul>\n<li>It&#x2019;s harder to change your career &#x2018;role&#x2019; than your cause later in your career. For instance, if you become a great salesperson, it&#x2019;s relatively easy to transition into an organisation that works on a different cause, but much harder to become great at some other skill. This means that early in your career it&#x2019;s more important to figure out what types of roles suit you than what cause to support early in your career.</li>\n</ul>\n<ul>\n<li>There&#x2019;s huge, robust benefits from being good at your job including (i) better career capital &#x2013; &#x201C;it gives you a better learning experience, better personal development, better overall status, better overall opportunities&#x201D; &#x2013; (ii) higher impact within your field.</li>\n</ul>\n<ul>\n<li>Excelling at what you do is one of the most important rules of thumb for having more impact, partly because a lot of the world&#x2019;s impact comes from extreme cases, so your chances of being an extreme case may dominate your expected impact. In particular, extreme impact often arises from innovation &#x2013; spotting ideas others haven&#x2019;t &#x2013; and this is more likely when you&#x2019;re at the top of your field.</li>\n</ul>\n<ul>\n<li>Some other criteria that are important early in your career are: (i) the general status of the option (ii) the pay (iii) how much you&#x2019;ll learn about yourself and your other options from taking this option.</li>\n</ul>\n<p></p>\n<p></p>\n<p>&#xA0;</p>\n<p><strong>Cause selection</strong></p>\n<p>\n</p><ul>\n<li>If a cause is on the Open Philanthropy Project&#x2019;s list, that&#x2019;s an extra reason to seek a job in that area.</li>\n</ul>\n<ul>\n<li>However, if a cause isn&#x2019;t on the list, it may still be promising, especially if you have good personal fit with the area. Personal fit may often overwhelm considerations about the general effectiveness of a cause.</li>\n</ul>\n<ul>\n<li>There can be other differences between the causes that are most promising for philanthropists and those that are most promising for job seekers. For instance, since OPP&#x2019;s causes are often constrained by a lack of money, it may be difficult to get a job within them.</li>\n</ul>\n<ul>\n<li>Some ideas for causes OPP isn&#x2019;t investigating, but at first glance still look promising for job seekers include: environment and climate change, scientific research, for-profit work (especially in innovative areas), and foreign relations.</li>\n</ul>\n<ul>\n<li>OPP aren&#x2019;t highly likely to drastically change their list of causes (especially within global catastrophic risks and political advocacy) for at least two to three years.</li>\n</ul>\n<ul>\n<li>If you want to make a difference in the for-profit world, avoid activities that make money through (i) zero-sum games (ii) addiction (iii) a marketing-first approach. If you&#x2019;ve cleared those filters, then ask (i) is this scalable? (ii) does it make people&#x2019;s lives better in a significant way? (iii) are you good at this activity?</li>\n</ul>\n<p></p></body></html>", "user": {"username": "Benjamin_Todd"}}, {"_id": "J65EZcjLjdGcBjyHw", "title": "Meetup : Introduction to Effective Altruism", "postedAt": "2014-10-02T23:37:37.669Z", "htmlBody": "<html><body><h2>Discussion article for the meetup : <a href=\"/meetups/p\">Introduction to Effective Altruism</a></h2>\n\t\t  <div>\n\t\t\t\t<p>\n\t\t    \t<strong>WHEN:</strong> \n\t\t    \t<span>14 October 2014 07:00:00PM (+0100)</span><br>\n\t\t\t\t</p>\n\t\t\t\t<p>\n\t\t    \t<strong>WHERE:</strong> \n\t\t    \t<span>University of York, York</span>\n\t\t\t\t</p>\n\t\t  </div><!-- .meta -->\n\t\t  <div>\n\t\t    <div><p>Introduction to Effective Altruism, in room P/L/005 in the Physics/Exhibition Centre. Followed by drinks in a campus bar.</p></div>\n\t\t  </div><!-- .content -->\n\t\t<h2>Discussion article for the meetup : <a href=\"/meetups/p\">Introduction to Effective Altruism</a></h2></body></html>", "user": {"username": "Matt_Sharp"}}, {"_id": "98Fe4vYuDAAT7v6MY", "title": "Improvements to the Effective Altruism Forum", "postedAt": "2014-10-02T22:00:52.756Z", "htmlBody": "<html><body><p>Hey all,</p>\n<p>There have been a few minor updates with the forum over the past few weeks.</p>\n<p>First, new comments are now highlighted. Each time you visit an article, any new comments since your last login will now be displayed with a bright blue outline. This should make it easier to read new thoughts on an article, especially if they are buried deep in a comment thread. A good effect of this is that now when you write a comment, you know that some other users will see it and read it. This feature will start working after your second login, starting from now.</p>\n<p>Second, under &apos;Recent on EA Blogs&apos;, Jeff Kaufman&apos;s posts about effective altruism are now displayed.</p>\n<p>Third, Jeff Kaufman has made us an awesome favicon, which now identifies the site:</p>\n<p><img src=\"https://i.imgur.com/C0W26hh.png\" alt=\"\"></p>\n<p>It&apos;s great to see improvements like these. If you have more feature suggestions, rather than scattering these suggestions all over the site, it&apos;s best to concentrate them in this thread or in this <a href=\"https://docs.google.com/forms/d/1qqAVBSGGG106l4lk_v7QU0tf0k7ibNqaCF1mrm0jVuM/viewform\">Google form</a>&#xA0;(responses&#xA0;<a href=\"https://docs.google.com/spreadsheets/d/1UBcyyGeBhx8Cpq1QIopwHmsDKySDAsMqsOQthIGAnDM/edit#gid=697942856\">here</a>).</p>\n<p>In order to facilitate more improvements to the Effective Altruism Forum, its developers, Trike Apps have shared its&#xA0;<a href=\"https://github.com/tricycle/eaforum\">code respository</a> on GitHub, and they will welcome contributions there over the coming months to years.</p>\n<p>In a couple of days, we will also welcome some new users from The Life You Can Save mailing list. If you&apos;re reading this, LYCS readers, then we hope you enjoy your stay here.&#xA0;</p>\n<p>In one week, the karma requirement will be decreased, and so more users can post articles on the forum.</p>\n<p>Ryan</p></body></html>", "user": {"username": "RyanCarey"}}, {"_id": "zvRerivrWdZ5J5rD9", "title": "Effective policy? Requiring liability insurance for dual-use research", "postedAt": "2014-10-01T18:36:15.177Z", "htmlBody": "<html><body><p>Hi all,</p>\n<p>I thought people might be interested in some of the policy work the Global Priorities Project has been looking into. Below I&apos;m <a href=\"http://www.fhi.ox.ac.uk/liability-insurance/\">cross-posting some notes</a> on one policy idea. I&apos;ve talked to several people with expertise in biosafety and had positive feedback, and am currently looking into how best to push further on this (it will involve talking to people in the insurance industry).</p>\n<p>In general quite a bit of policy is designed by technocrats and already quite effective. Some other areas are governed by public opinion which makes it very hard to have any traction. When we&apos;ve looked into policy, we&apos;ve been interested in finding areas which navigate between these extremes -- and also don&apos;t sound too outlandish, so that they have some reasonable chance of broad support.</p>\n<p>I&apos;d be interested in hearing feedback on this from EAs. Criticisms and suggestions also very much welcome!</p>\n<p>---</p>\n<h2>Requiring liability insurance for dual-use research with potentially catastrophic consequences</h2>\n<p><em>These are notes on a policy proposal aimed at reducing catastrophic risk. They cover some of the advantages and disadvantages of the idea at a general level; they do not yet constitute a proposal for a specific version of the policy.</em></p>\n<p><em></em> Research produces large benefits. In some cases it may also pose novel risks, for instance work on&#xA0;potential pandemic pathogens. There is widespread agreement that such &apos;dual use research of concern&apos; poses challenges for regulation.</p>\n<p>There is a convincing case that we should avoid research with large risks if we can obtain the benefits just as effectively with safer approaches. However, there do not currently exist natural mechanisms to enforce such decisions. Government analysis of the risk of different branches of research is a possible mechanism, but it must be performed anew for each risk area, and may be open to political distortion and accusations of bias.</p>\n<p>We propose that all laboratories performing dual-use research with potentially catastrophic consequences should be required by law to hold insurance against damaging consequences of their research.</p>\n<p>This market-based approach would force researcher institutions to internalise some of the externalities and thereby:</p>\n<ul>\n<li>Encourage university departments and private laboratories to work on safer research, when the benefits are similar;</li>\n<li>Incentivise the insurance industry to produce accurate assessments of the risks;</li>\n<li>Incentivise scientists and engineers to and devise effective safety protocols that could be adopted by research institutions to reduce their insurance premiums.</li>\n</ul>\n<p>Current safety records do not always reflect an appropriate level of risk tolerance. For example, the economic damage caused by the escape of the foot and mouth virus from a BSL-3 or BSL-4 lab in Britain in 2007 was high (mostly through trade barriers) and could have been much higher (the previous outbreak in 2001 caused &#xA3;8 billion of damage). If the lab had known they were liable for some of these costs, they might have taken even more stringent safety precautions. In the case of potential pandemic pathogen research, insurers might require it to take place in BSL-4 or to implement other technical safety improvements such as &#x201C;molecular biocontainment&#x201D;.</p>\n<h3>Possible criticisms and responses</h3>\n<ul>\n<li>The potential risks are too large, and nobody would be willing to insure against them. \n<ul>\n<li>We could avoid this by placing an appropriate limit on the amount of insurance that could be required. If it were a sufficiently large sum (perhaps in the billions of dollars), the effect should be more appropriate risk aversion, even if the tail risk for the insurer were not fully internalised.</li>\n</ul>\n</li>\n<li>The risks are too hard to model, and nobody would be willing to insure against them. \n<ul>\n<li>There are insurance markets for some risks that are arguably harder to model and have equally high potential losses, such as terrorism.</li>\n</ul>\n</li>\n<li>We already have demanding safety standards, so this wouldn&#x2019;t reduce risk. \n<ul>\n<li>Much of the current safety standards are focused on occupational health and safety of the lab workers rather than the general public.</li>\n<li>The market-driven approach proposed would focus attention on whichever steps were rationally believed to have the largest effect on reducing risk, and reduce other bureaucratic hurdles.</li>\n<li>Liability has been useful at improving behaviour in other domains, for example in industrial safety.</li>\n</ul>\n</li>\n<li>It is hard to draw a line around the harmful effects of research. Should we punish research which enables others to perform harmful acts? \n<ul>\n<li>There is a hard question, but we think we would get much of the benefit by using the simple rule that labs are only liable for simple direct consequences of their work. For example, the release &#x2013; accidental or deliberate &#x2013; of a pathogenic virus manufactured in that lab.</li>\n</ul>\n</li>\n<li>Research has positive externalities, and it is unfair if they have to internalise only the negative ones. \n<ul>\n<li>This is true, although research receives funding for precisely this reason.</li>\n<li>If we don&#x2019;t make an attempt to introduce liability then we are effectively subsidising unsafe research relative to safe research.</li>\n</ul>\n</li>\n<li>Why require insurance rather than just impose liability? Shouldn&#x2019;t this be a decision for the individuals? \n<ul>\n<li>Some work may be sufficiently risky that the actors cannot afford to self-insure. In such circumstances it makes sense to require insurance (just as we require car insurance for drivers).</li>\n<li>This will help to ensure that appropriate analysis of the risks is performed.</li>\n</ul>\n</li>\n<li>Which research should this apply to? How can we draw a line? \n<ul>\n<li>The bureaucracy would be too costly to impose this requirement on all research. We should adapt existing guidelines for which areas need extra oversight. In the first place, potential pandemic pathogen research is an obvious area which should be included.</li>\n</ul>\n</li>\n</ul>\n<p>&#xA0;</p></body></html>", "user": {"username": "Owen_Cotton-Barratt"}}, {"_id": "tRr8PMJnzaEN4P43H", "title": "Why is effective altruism new and obvious?", "postedAt": "2014-09-30T22:10:16.444Z", "htmlBody": "<html><body><p><a href=\"http://www.benkuhn.net/ea-critique\">Ben Kuhn</a>, playing Devil&apos;s advocate:</p>\n<blockquote>Effective altruists often express surprise that the idea of effective altruism only came about so recently. For instance, my student group recently hosted Elie Hassenfeld for a talk in which he made remarks to that effect, and I&#x2019;ve heard other people working for EA organizations express the same sentiment. But no one seems to be actually worried about this&#x2014;just smug that they&#x2019;ve figured out something that no one else had.</blockquote>\n<blockquote>The &#x201C;market&#x201D; for ideas is at least somewhat efficient: most simple, obvious and correct things get thought of fairly quickly after it&#x2019;s possible to think them. If a meme as simple as effective altruism hasn&#x2019;t taken root yet, we should at least try to understand why before throwing our weight behind it. The absence of such attempts&#x2014;in other words, the fact that non-obviousness doesn&#x2019;t make effective altruists worried that they&#x2019;re missing something&#x2014;is a strong indicator against the &#x201C;effective altruists are actually trying&#x201D; hypothesis.</blockquote>\n<p>I think this is a good point.&#xA0;If you find yourself in a small group&#xA0;advocating for an obvious and timeless idea, and it&apos;s 2014, something a bit strange is probably going on. As a side note, if people actually come out and&#xA0;disagree, this is more worrying&#xA0;and you should really take some time out to be puzzled by it.</p>\n<p>I can think of a few&#xA0;reasons that &apos;effective altruism&apos; might seem so obvious and yet the EA movement might only just be starting.</p>\n<p>I will assume that&#xA0;the term &apos;effective altruism&apos; is intended to mean&#xA0;roughly&#xA0;what the words in it suggest: helping other people in&#xA0;efficient ways. If you took&#xA0;&apos;effective altruism&apos; to be defined by <a href=\"http://en.wikipedia.org/wiki/Effective_altruism#Principles\">principles</a> regarding&#xA0;counterfactual reasons and supererogatory&#xA0;acts and so on, I don&apos;t think you should&#xA0;be surprised that&#xA0;it is&#xA0;a new movement. However I don&apos;t think that&apos;s what &apos;effective altruism&apos; generally means to people; rather&#xA0;these recent principles are&#xA0;an upshot of&#xA0;people&apos;s&#xA0;efforts to be&#xA0;altruistic in an effective manner.</p>\n<p><strong>Explanation 1: Turning something&#xA0;into a social movement is a higher bar than thinking of it</strong></p>\n<p>Perhaps people have thought of effective altruism&#xA0;before, and they just didn&apos;t make much noise about it. Perhaps even because it was obviously correct.&#xA0;There is no temptation to start&#xA0;a &apos;safe childcare&apos; movement because&#xA0;people generally come up with that on their own (whether or not they actually carry it out).&#xA0;On the other hand, if&#xA0;an idea is too obviously correct for anyone to&#xA0;advocate for, you might expect more people to actually be doing it, or trying to do it. I&apos;m not sure how many people were trying to be effective altruists&#xA0;in the past on their own, but&#xA0;I don&apos;t think it was a&#xA0;large fraction.</p>\n<p>However&#xA0;there might be some&#xA0;other reason that people would think of the idea, but fail to spread it.</p>\n<p><strong><strong>Explanation 2: </strong>There are lots of obvious things, and it takes some&#xA0;insight to pick the important ones to emphasize</strong></p>\n<p>Consider an analogy to my life. Suppose that after having been a human&#xA0;for many years&#xA0;I&#xA0;decide to exercise&#xA0;regularly&#xA0;and&#xA0;go to sleep at the same time every night. In some sense, these things are obvious, perhaps because my housemates and parents and the media have pointed them out to me on a regular basis basically since I could walk and sleep for whole nights at a time. So perhaps I should not be surprised if these make my life hugely better.&#xA0;However&#xA0;my acquaintences&#xA0;have also pointed out so many other &apos;obvious&apos; things - that I should avoid salt&#xA0;and learn the piano and be&#xA0;nice and eat vitamin tablets&#xA0;and wear make up and&#xA0;so on - that it&apos;s hard to pick out the really high priority things from the rest, and each one takes scarce effort to implement and try out.</p>\n<p>Perhaps, similarly, while &apos;effectiveness&apos; and &apos;altruism&apos; are obvious, so are &apos;tenacity&apos; and &apos;wealth&apos; and &apos;sustainability&apos; and so on. This would explain the world taking a very long time to get to them. However it would also suggest&#xA0;that we haven&apos;t necessarily picked the right obvious things to emphasize.</p>\n<p>If&#xA0;this were&#xA0;the explanation, I would expect&#xA0;everyone to basically be on board with the idea, just not to emphasize it as&#xA0;a central principle in their life.&#xA0;I&apos;m not sure to what extent this is true.</p>\n<p><strong><strong>Explanation 3: Effectiveness and altruism don&apos;t appear&#xA0;to be the&#xA0;contentious points</strong></strong></p>\n<p>Empirically, I think this is why &apos;effective altruism&apos; didn&apos;t stand out to me as an important concept prior to meeting the Effective Altruists.</p>\n<p>As&#xA0;a teen, I was interested&#xA0;in&#xA0;giving all of my money to the most cost-effective charities (or rather, saving it to give later). It was also clear that virtually everyone else&#xA0;disagreed with me on this, which seemed a bit perplexing given their purported high valuation of human lives and the purported low cost of saving them. So I did actually think about our disagreement&#xA0;quite a bit. It did not occur to me to advocate for &apos;effectiveness&apos; or &apos;altruism&apos; or both of them in concert, I think because&#xA0;these did not stand out as the ideas&#xA0;that people were&#xA0;disagreeing over. My family&#xA0;was interested in altruism some of the time, and seemed reasonably effective in their efforts. As far as I could tell, where we differed in opinion was in something like whether &#xA0;people in foreign countries really existed in the same sense as people you can see do; whether&#xA0;it was &apos;okay&apos; in some sense to&#xA0;buy a socially sanctioned&#xA0;amount of stuff, regardless of the opportunity costs; or&#xA0;whether one should have inconsistent beliefs.</p>\n<p><strong><strong>Explanation 4: </strong>The disagreement isn&apos;t about effectiveness or altruism</strong></p>\n<p>A salient next hypothesis then is that the contentious claim made by Effective Altruism&#xA0;is in fact not about effectiveness or altruism, and is less obvious.</p>\n<p>&apos;Effective&apos; and &apos;altruism&apos; together&#xA0;sound almost tautologically good. Altruism is&#xA0;good for the world almost by definition, and if you are going to be altruistic, you would be a fool to be ineffective at it.</p>\n<p>In practice, Effective Altruism advocates for&#xA0;measurement and comparison.&#xA0;If measurement and comparison were free,&#xA0;this would obviously be a good idea. However since they are not, effective altruism stands for putting more scarce resources into measurement and comparison, when&#xA0;measurement is hard, comparison is demoralizing and politically fraught, and there are many other plausible ways that in practice philanthropy could be improved. For instance, perhaps it&apos;s&#xA0;more effective to get more donors to talk to each other, or to&#xA0;improve the effectiveness of foundation staff at menial tasks. We don&apos;t know, because at this meta level we haven&apos;t actually measured whether&#xA0;measuring&#xA0;things is the most effective thing to do. It seems very plausible, but&#xA0;this is a much easier thing to imagine a person reasonably disagreeing with.</p>\n<p>Effective altruists sometimes criticize&#xA0;people who look to overhead ratios and other simple metrics of performance, because&#xA0;of course these are not the&#xA0;important thing. We should care about results. If there is a charity that gets better results, but has a worse overhead ratio, we should still choose it! Who knew? As far as I can tell, this misses the point. Indeed, overhead ratio is not the same as quality. But surely nobody was suggesting that it was. If you were perfectly&#xA0;informed about outcomes, indeed you should ignore overhead ratios. If you are ignorant about everything, overhead ratios are a gazillion times&#xA0;cheaper&#xA0;to get hold of than data on results. According to this <a href=\"http://overheadmyth.com/wp-content/uploads/2013/06/GS_OverheadMyth_Ltr_ONLINE.pdf\">open letter</a>, overhead ratios are &apos;inaccurate and imprecise&apos; because 75-85% of organizations incorrectly report their spending on grants. However this means that 15-25% report it correctly, which in my experience is a lot more than even try to&#xA0;report their impact, let alone do it correctly. Again, the question of whether to use&#xA0;heuristics like this seems like an empirical one of relative costs and accuracies,&#xA0;where it is&#xA0;not at all obvious that we are correct.</p>\n<p>Then there appear to be real disagreements about ethics and values. Other people think of themselves as having different values to Effective Altruists, not as merely liking their aggregative consequentialism to be ineffective. They&#xA0;care more about the&#xA0;people around them than those far away, or they care more about some kinds of problems than others, and they care about how things are done, not just the outcome. Given the large number of&#xA0;ethical disagreements in the world, and unpopularity of utilitarianism, it is hardly a new surprise&#xA0;that others don&apos;t find&#xA0;this aspect of Effective Altruism&#xA0;obviously good.</p>\n<p>If&#xA0;Effective Altruism really stands for pursuing unusual&#xA0;values,&#xA0;and furthermore doing this via&#xA0;zealous&#xA0;emphasis on accurate metrics, I&apos;m not especially surprised that it wasn&apos;t thought of&#xA0;years ago, nor that people disagree.  If this is true though, I fear that we are&#xA0;using <a href=\"http://slatestarcodex.com/2014/07/07/social-justice-and-words-words-words/\">impolite debate&#xA0;tactics</a>.</p></body></html>", "user": {"username": "Katja_Grace"}}, {"_id": "LzooYBq4cEfp6BLsj", "title": "We're looking for stories of EA career decisions", "postedAt": "2014-09-30T18:20:28.169Z", "htmlBody": "<html><body><p>If you&#x2019;ve made a career decision recently, or are still thinking about one, we&#x2019;d like to feature your story on the 80,000 Hours blog. Here&#x2019;s some examples: <a href=\"https://80000hours.org/2014/01/case-study-choosing-between-working-at-effective-altruist-organisations-earning-to-give-and-graduate-school/\">Peter</a>, <a href=\"https://80000hours.org/2013/10/why-i-m-doing-a-phd/\">Jess</a>, <a href=\"https://80000hours.org/2013/06/maximizing-your-donations-via-a-job/\">Alexei</a>.</p>\n<p>If you&#x2019;re interested, please email ben@80000hours.org.</p>\n<p>&#xA0;</p>\n<p><strong>Why are we looking?</strong></p>\n<p>\n</p><ul>\n<li>We find these case studies really useful in our research - they help us to identify the key considerations, most common sticking points and most promising solutions.</li>\n<li>Our readers find them useful. The three examples above were very popular. Concrete examples help to communicate our approach and bring it to life.</li>\n<li>Writing up your career decision helps you make better choices. First, writing out your reasoning forces you to think deeply about the decision. Second, putting your ideas out there helps you to get feedback and support. Jess and Peter found it really useful to write about their career decisions.</li>\n</ul>\n<p></p>\n<p>&#xA0;</p>\n<p><strong>What are we looking for?</strong></p>\n<p>\n</p><ul>\n<li>A written-out study of a specific decision e.g. &#x201C;what should I study at university?&#x201D;, &#x201C;which of these three jobs should I take?&#x201D;, &#x201C;what&#x2019;s the next step I should take if I want to start a startup?&#x201D;. The decision can either be in the past, or still in progress.</li>\n<li>Your long-term potential to make a difference is one of the main priorities in the decision.</li>\n</ul>\n<p></p>\n<p>Otherwise, there&#x2019;s no restrictions!</p>\n<p>&#xA0;</p>\n<p><strong>A template</strong></p>\n<p>\n</p><ul>\n<li>Feel free to use whatever structure you like in writing up. Here&#x2019;s some suggested subheadings as a starting point.</li>\n<li>What&#x2019;s the decision you&#x2019;re making to make?</li>\n<li>What are your priorities in making this decision? (e.g. career capital, earnings, learning more about your long-term options).</li>\n<li>What&#x2019;s your current situation and background?</li>\n<li>What options are you considering? What are the pros and cons of each?</li>\n<li>What did you decide, and why? / How do you plan to make this decision?</li>\n<li>(If in the past) Are you satisfied with the decision? What have you learned from the process?</li>\n</ul>\n<p></p>\n<p>&#xA0;</p>\n<p><strong>Next steps</strong></p>\n<p>If you&#x2019;re interested, send a rough draft to ben@80000hours.org.</p>\n<div><br></div></body></html>", "user": {"username": "Benjamin_Todd"}}, {"_id": "mkCB5NAFizkCAzBxr", "title": "How to Meet Effective Altruists", "postedAt": "2014-09-30T12:28:53.296Z", "htmlBody": "<html><body><p><em>(this post is co-authored by Tom Ash and Ryan Carey)</em></p>\n<p>Growing numbers of people identify with effective altruism worldwide, and there are now regular meetups from Adelaide to Vancouver. By meeting with local effective altruists, you can have a lot of fun and make long-lasting social connections! Meeting up gives a way to share your experience and thoughts of giving. So here is how you can arrange meetups, either with a group or one-to-one:</p>\n<ul>\n<li>\n<p>1. Use the <a href=\"http://effectivealtruismhub.com/map\">map of effective altruists</a> to find people near you - you can <a href=\"http://effectivealtruismhub.com/map/people/all\">search by city or country</a>, and contact people you find via their linked contact forms. If you&#x2019;d like others to be able to find you, <a href=\"http://effectivealtruismhub.com/map/add\">sign up to the map yourself</a>! To avoid decision paralysis, it is often better to meet any effective altruists that you discover sooner, even if it&#x2019;s just over a coffee, rather than agonising over the ideal location for a full-scale meetup that may never get around to creating.</p>\n</li>\n<li>\n<p>2. Find more effective altruists. Let others know that you might be interested in meeting by commenting on this article. Do the same at the <a href=\"https://www.facebook.com/groups/effective.altruists/\">Effective Altruists Facebook group</a>. You can contact effective altruist organisations like Giving What They Can and 80,000 Hours, who may also be able to link you in with some contacts, especially if they have previously established a chapter near you.</p>\n</li>\n<li>\n<p>3. Once you&#x2019;ve arranged to meet, <a href=\"/meetups/new/\">announce it</a>&#xA0;on&#xA0;the Effective Altruism Forum.</p>\n</li>\n</ul>\n<p>We hope that by using these resources, meeting effective altruists is now easier than ever. As for how to make meetups awesome, Sam Hilton has some extra resources that he will share in an upcoming post.</p></body></html>", "user": {"username": "RyanCarey"}}]