[{"_id": "buMADtyMPmvRs9KGC", "title": "Open Philanthropy Project Convening on Policy Priorities - November 10, 2014", "postedAt": "2014-11-13T03:45:14.977Z", "htmlBody": "<p>On November 10, the Open Philanthropy Project held a day-long convening in Washington, D.C. to discuss possible priorities for <a href=\"https://www.openphilanthropy.org/focus/us-policy\">our work on U.S. policy</a>.</p><p>Our main goal was to present our picture of several policy issues, as well as to receive input into our upcoming decisions about which issue(s) we should focus on. For each issue, we laid out what sort of change we’d like to see, why we find the issue especially promising for philanthropy, what the current landscape looks like (including other funders), and what possible strategies might look like. We sought feedback on all of these points, as well as ideas for promising issue areas and promising strategies that haven’t occurred to us.</p><p>Because we covered multiple issues, we tried to convene a set of people with fairly broad experience in areas relevant to influencing policy, representing a variety of backgrounds and including people who have focused both on shorter- and longer-term strategy. We particularly sought out attendees whom we see as strategic thinkers and whom we believed were likely to be honest and direct with us.</p><p>The briefing materials we provided - giving basic background and key questions for each topic on our agenda - are available <a href=\"https://www.openphilanthropy.org/files/Focus_Areas/US_Policy/Issue_writeups_for_Nov_10_meeting.pdf\">here (PDF)</a>, slightly edited to be appropriate for public distribution.</p><p>A summary of points raised at the convening, including a partial list of participants, is available <a href=\"https://www.openphilanthropy.org/files/Focus_Areas/US_Policy/Notes_from_Nov_10_meeting_on_policy.pdf\">here (PDF)</a> and below:</p><h1>Notes from Open Philanthropy Project convening on November 10th</h1><p>Partial list of participants:&nbsp;</p><ul><li>Frank Baumgartner</li><li>Gara LaMarche</li><li>Susan Sandler</li><li>Mark Schmitt</li><li>Alexis Schuler</li><li>Amanda Shanor</li><li>Steven Teles</li><li>Ben Wikler</li><li>Open Philanthropy Project representatives</li></ul><p><strong>Note:</strong> this set of notes was compiled by the Open Philanthropy Project, and gives an overview of the major points raised in our November 10 meeting, without attributing specific comments to specific people. The participants do not necessarily hold all the views set forth below. Note also that we provided briefing materials and key questions for each session; these are available at http://www.givewell.org/files/labs/Issue writeups for Nov. 10 meeting.docx.</p><h2>Introductory session&nbsp;</h2><p>We laid out our basic comparative advantages as a foundation and took questions and comments.&nbsp;</p><p>We discussed the basic question of whether to be an \"operating foundation\" (carrying out a great deal of our work in-house, and treating external partners somewhat as contractors) vs. \"active grantmaker\" (making grants for specific purposes with specific expectations and conditions) vs. \"passive grantmaker\" (more hands-off grantmaking). We expressed a preference for \"passive grantmaker\" to the extent we can find sufficiently aligned grantees/partners.&nbsp;</p><p>There were remarks to the effect that foundations tend to emphasize their own angle/strategy on an issue, but they are ultimately defined - and the field is ultimately shaped - by their grantees.&nbsp;</p><p>We discussed the tradeoff between \"alignment\" (how much a given person/organization shares our general values and goals) and \"capacity\" (how much money a given person/organization can spend productively). Given our somewhat unusual platform, we are likely to face tradeoffs between how much activity we're able to support and how aligned we can expect to be with our grantees. We were encouraged to be open to \"strange bedfellows\" approaches (working with people who disagree with us on many issues but may have areas of overlap), but not to take these approaches too far and not to make our biggest commitments along these lines.</p><h2>Session on criminal justice reform&nbsp;</h2><p>There was general agreement with our feeling that this issue presents unusual political opportunities.</p><p>There was a mixed reaction to the idea, proposed in our writeup, that we should prioritize reducing crime as well as reducing incarceration, because crime may be harder to reduce than incarceration and the link between the crime rate and the politics of incarceration is not completely straightforward. On the other hand, it was remarked that policy reforms seeking to be neutral or positive with respect to public safety could be more durable: a vivid story of a crime would be less likely to lead to retrenchment for these sorts of policies.</p><p>We had an extended discussion of prosecutor incentives. People remarked that prosecutors are currently largely judged on how many people they've gotten incarcerated, and we discussed how to introduce other ways of evaluating them, including a focus on prosecuting white-collar crime and a focus on \"crimes of wrongful liberty\" (prosecuting the wrong person while the real criminal goes free and commits more crimes).</p><p>There were generally mixed-to-negative reactions to the idea of focusing on campaigns to reduce mass incarceration, as opposed to other approaches laid out in our briefing materials. We asked how to assess when a campaign is a good idea; responders felt that there's no clear and reliable way to do this, without being \"in the thick of things.\" Political operatives, lobbyists, etc. can often present a misleading picture of how worthwhile a campaign would be.</p><p>There was some discussion of framing and terminology, both generally and for this cause. The idea was raised of sourcing ideas for terminology from the people who care most about the issue, then testing poll-testing different options for mainstream reaction; this contrasts with the more traditional strategy of starting with mainstream-friendly messages and asking the base to adopt them, which can result in the base losing some ability to energize people. There was some thought about how to frame criminal justice reform in positive terms - something like \"second chance economy\" as opposed to \"reducing incarceration.\"</p><p>We also discussed the idea of going “all in in one or two states” with our institution-building grants, as opposed to spreading out our bets geographically. There were generally positive reactions to the idea of going “all in” in a specific location.&nbsp;</p><p>Other ideas raised included:</p><ul><li>Addressing the \"school to prison pipeline\" via school reform, though this might involve major conflicts with school boards</li><li>Addressing other \"root causes\" such as lead poisoning, foster care and child welfare. There were mixed reactions to whether this would be a promising approach.</li><li>Asset forfeiture reform</li><li>Focusing on marijuana decriminalization since marijuana usage can be a \"gateway crime\" and a tool for police to make stops.</li><li>Research on improving policing</li><li>Prosecutors</li><li>Building capacity at the state level</li></ul><h2>Session on labor mobility&nbsp;</h2><p>Several people thought this was a good cause for us because of its boldness and unfamiliarity. However, most people in the room were uncomfortable with at least some of the substance of the cause - particularly the idea of focusing on temporary work visas, as they fear that such visas often lead to exploitation of workers.</p><p>There was relatively more interest in promoting the long-term vision of large increases in immigration and the cosmopolitan-humanitarian benefits of this. Some commented that younger people may be more cosmopolitan in their interests.</p><p>We were warned against making excessively major or long-term commitments to \"strange bedfellows,\" e.g., people who agree with us on wanting to increase labor mobility but disagree with us on many other issues.</p><p>Ideas raised included:</p><ul><li>Focusing on policy in Asia rather than in the U.S., though it was acknowledged that this might be impractical at this stage of our development.</li><li>Aiming to reduce the costs of remittances.</li><li>Promulgating the message that America's most prosperous periods have been high-immigration periods.</li><li>Research on what a high-immigration state would look like.</li></ul><h2>Session on macroeconomic stabilization policy&nbsp;</h2><p>Several people thought this was one of the best issues to focus on that we had highlighted, noting that it gets fairly little attention from politics-oriented groups and funders currently but has significant potential.</p><p>One challenge of this cause is that there aren't major existing organizations that focus specifically on this issue, especially from a more political, rather than academic, perspective. Our grants so far have been project support rather than general operating support. We discussed whether this should be considered problematic, in light of earlier discussion about the value of general support. The general reaction was that this shouldn't be considered problematic, as long as the grants are allocated to people within organizations who are intrinsically motivated to do particular work and these people are given the freedom to do it as they see fit. Grants like this should be thought of as somewhere between (a) fully general (organization-level) operating support; (b) highly prescriptive, contractual grantmaking.</p><p>Ideas raised included:</p><ul><li>(Re-)nationalizing the welfare state to make it more effectively countercyclical</li><li>Creating a \"hub\" to bring together the work different organizations (such as EPI, Roosevelt, Demos) can do</li><li>Studying up on the history of monetary policy, since it used to draw much more public interest than it does today</li><li>Working with people on both the left and right</li><li>Learning about the Washington Center for Equitable Growth as a model for how to raise the profile of an issue primarily by supporting and drawing on existing work from other organizations</li><li>Focusing on financial regulation as a way of making financial crises less likely; several people were highly positive on this area, feeling it does not get enough attention from nonprofits and funders</li></ul><h2>Session on alcohol policy and land use reform&nbsp;</h2><p>The participants were split on the topic of land use reform, with some seeing it as a promising issue and some seeing it as too divorced from the goal of helping the disadvantaged. People also commented that land use reform might be more of concern to younger people than to the middle-aged.</p><p>Alcohol policy was said to be an \"orphan cause\" in the sense that it doesn't have strong thematic links to the rest of our work. We had some discussion of how to tie it into broader themes, such as criminal justice. One participant stated that campaigns on alcohol policy would likely meet strong industry opposition. The general reaction to the idea of working on alcohol policy was negative.</p><p>Ideas raised focused in some cases on the general goal of raising the profile of relatively low-profile issues.&nbsp;</p><ul><li>Funding media for general dissemination of arguments to raise the profile of issues like these.</li><li>Funding legal clinics on land use reform</li><li>Postgraduate fellowships for public policy schools and urban planning schools, as a way of build up young expertise and make connections to people who can become advocates</li><li>Support for recent law school graduates who want to work in public service; it was stated that there is an oversupply of interested graduates relative to opportunities.</li></ul><h2>Session on income security&nbsp;</h2><p>Participants were supportive of the goal, but less sure about where there is space to fund things that aren't already being funded. Much of the discussion centered around experimenting with new ways of organizing and mobilizing people.&nbsp;</p><p>Ideas raised included:&nbsp;</p><ul><li>Funding research re-examining the federal-vs-state breakdown of social welfare programs</li><li>Centralized strategizing on where and when to launch state-level campaigns</li><li>Building the general capacity of relevant groups such as the Center for Popular Democracy</li><li>Experimenting with new ways of organizing people sustainably (an example: coworker.org, which organizes corporate employees)</li></ul><h2>Session on breadth vs. depth&nbsp;</h2><p>We discussed how a funder might operate effectively without relying on causespecific staff.&nbsp;</p><ul><li>Some noted that this might involve making a relatively small number of grants, and focusing on general support of organizations rather than on funding very specific project-oriented work, since it can be more tractable as a non-cause-expert to keep up with organizations at the \"board member\" level than to try to track the details of specific work.</li><li>We discussed the idea of funding fellowships in a variety of causes, since the goal of \"getting more people to work on an issue\" doesn't necessarily require expertise on that issue. In addition to fellowships for people to work at public service organizations, we also discussed the idea of fellowships for people to work on Congressional staffs, along the model of the AAAS Science &amp; Technology Policy Fellowships.</li></ul><p>We discussed how we might approach promoting a broad political platform and approach, as opposed to just working on specific issues. Some emphasized the importance of networking broadly; at the same time, several commented that we'll be in better position to promote a broad platform - in terms of our knowhow and credibility - if there are specific issues and/or organizations we're concretely and strongly committed to (as opposed to focusing only on promoting a platform).&nbsp;</p><p>We discussed the danger of \"churn\" and the importance of having - and showing - credible, long-term commitments to particular areas, to prevent a situation in which we're asking organizations and people to change very long-term plans and then going back on our involvement. We raised the idea of making 3-year commitments to specific area to start; some felt a 3-year commitment is too short, while others noted that foundations regularly change priorities and that starting off in this way wouldn't necessarily be unusual.</p><h2>Wrapup session&nbsp;</h2><p>The idea of fellowships came up again, and more than one participant endorsed sponsoring fellowships as a way of generally improving our network and our ability to spot good opportunities.&nbsp;</p><p>There were suggestions to cultivate a mix between \"low-alignment, high-capacity work\" (funding people and organizations to do good specific work, often on an experimental basis, even if we aren't perfectly aligned with these people/organizations); \"high-alignment, low-capacity work\" (finding and supporting a smaller number of people/organizations we feel generally highly aligned with) and \"surge capacity\" (the ability to take advantage of sudden opportunities).&nbsp;</p><p>We went around the room and asked each person for their thoughts on which cause they would work on. Many attempted to tie several of our causes into an overarching theme, such as combining macroeconomic stabilization and income security (and perhaps immigration policy) under a broad theme having to do with an \"economy that values workers.\" In general, multiple people favored macroeconomic stabilization and income security; there were split views on criminal justice reform, since it does seem like an unusual window of opportunity (and is a particularly ripe area for better research and evidence), but is also attracting major ramp-up from other funders. There was less enthusiasm for other causes.</p><p>We then asked for people to name other high-potential causes we hadn't discussed in the meeting.&nbsp;</p><p>Ideas raised included:&nbsp;</p><ul><li>Public provision of child care</li><li>Police reform - reforming asset forfeiture practices (currently an interest of Institute for Justice), body cameras, \"demilitarization of police.\"</li><li>Examining the global supply chain and how to identify/work against abuses such as child slavery in cocoa production.</li><li>Voting rights, redistricting, and other structural reforms to democracy</li><li>Lead poisoning reduction</li><li>Foster care</li><li>Working toward long-term shifts in political coalitions; for example, making durable long-term commitments to mobilizing evangelicals who share some of our values. Faith in Public Life was named as a possible partner on this front.</li><li>Student activism and media as general approaches to policy influence that can get relatively strong results for the money</li><li>Advocacy regarding regulation, as a generally under-exploited approach to influencing policy</li></ul><p>Other suggestions we received:&nbsp;</p><ul><li>Identify organizations that we perceive as generally highly effective and get to know them in great depth.</li><li>Don't make deep, long-term commitments to people/organizations we don't feel highly aligned with.</li><li>\"Communicate in English\" rather than in the sort of jargon that is sometimes common for foundations.</li><li>Seek diversity in who leads partner organizations.</li><li>Try to connect with affected communities, and encourage grantees to do so as well.</li><li>When considering possible focus areas, consider the lens of how they affect human empowerment, both for better and for worse. For example, labor mobility progress might make it much easier for migrant workers to live and work in the US; but without the right strategy, it may also lead to significant harms for migrant workers, such as multi-year separation of children and parents and increasing the scale of routine rape.</li><li>Pay careful attention to the problem of scaling \"proven\" interventions (such as the HOPE \"swift and certain\" program piloted in Hawaii), and ensuring that replications are sufficiently similar to the original proven programs.</li></ul>", "user": {"username": "EA Forum Archives"}}, {"_id": "fHy3pMXpWDWHiywdm", "title": "Moving towards the goal", "postedAt": "2014-12-07T08:00:00.000Z", "htmlBody": "<p>This post contains some advice. I dare not call it obvious, as the <a href=\"http://en.wikipedia.org/wiki/Illusion_of_transparency\">illusion of transparency</a> is ever-present. I will call it simple, but people occasionally remind me that they really appreciate the simple advice. So here we go:</p><h1>1</h1><p>(As usual, this advice is not for everyone; today I am primarily speaking to those who have <a href=\"http://lesswrong.com/lw/nb/something_to_protect/\">something to protect</a>.)</p><p>I have been spending quite a bit of time, recently, working with people who are explicitly trying to hop on a higher growth curve and have a larger impact on the world. (Most of them <a href=\"http://www.ted.com/talks/peter_singer_the_why_and_how_of_effective_altruism?language=en\">effective altruists</a>.) They wonder how the big problems can be solved, or how one single person can themselves move the needle in a meaningful way. They ask questions like \"what needs to be done?\", or \"what sort of high impact things can I do right now?\"</p><p>I think this is the wrong way of looking at things.</p><p>When I have a big problem that I want solved, I have found that there is one simple process which tends to work. It goes like this:</p><ol><li>Move towards the goal.</li></ol><p>(It's simple, not easy.)</p><p>If you follow this process, you either win or you die. (Or you run out of time. Speed is encouraged. So are shortcuts, so is cheating.)</p><p>The difficult part is hidden within step 1: it's often hard to keep moving towards the goal. It's difficult to stay motivated. It's difficult to stay focused, especially when pursuing an ambitious goal such as \"end ageing,\" which requires overcoming some fairly significant obstacles.</p><p>But we are human beings. We are the single most powerful optimization process in the known universe, with the only exception being <i>groups</i> of human beings. If we set ourselves to something and don't stop, we either suceed or we die. There's a whole slew of advice which helps make the former outcome more likely than the latter (via efficiency, etc.), but first it is necessary to begin.</p><p>Moving towards the goal doesn't mean you have to work directly on whatever problem you're solving. If you're trying to end aging, then putting on a lab coat and combining random chemicals likely won't do you much good.</p><p>Rather, moving towards the goal is about <i>always acting to solve the problem,</i> with each motion. Identify the path to the goal that seems shortest, and then walk it. Maybe you need to acquire financial stability first, and more knowledge second. Maybe you need to expand your social network, or fulfill your social attachment needs. Maybe you need to acquire a new skill. Maybe you have <i>no idea</i> how to start, in which case you need to gain more information, do some thinking, and gain a higher vantage point from which to search for a path to the goal.</p><p>But no matter what, there is always <i>some</i> way to keep moving towards the goal. Get stronger. Get smarter. Return with allies at your back.</p><h1>2</h1><p>Here's the pattern that this advice is designed to work against: consider the effective altruist, asking \"what needs to be done?\", or \"what sort of high impact things can I do right now?\"</p><p>I expect people to go much farther by first identifying an actual goal, and then moving towards it. Which breaks my one-step advice above into a more practical two-step process:</p><p><strong>Step 1: identify the goal.</strong> Figure out what you're actually trying to accomplish. Probe your motivations, and trace them back to something that compels.</p><p>I'm not suggesting tracing your motivations all the way up to \"final\" goals; it's a bit presumptuous to claim knowledge of \"final goals\" given modern introspective capabilities. Rather, look for important problems that you're trying to solve in the world today.</p><p>For example, you might be trying to fix education, end hunger, eliminate a disease, prevent aging, become immortal, end suffering, prevent human extinction, or whatever. None of these are <i>ends unto themselves</i>, but they're all problems that need solving.</p><p>Identifying a goal that compels—that really needs to be solved, and that won't be solved (or won't be solved fast enough) by default—is not always an easy task. Many people are locked into a mindset where they couldn't possibly actually solve any big problems, because big problems are big and people are small. Breaking out of that mindset is a topic for another day; for now I'll assume you have picked your poison and identified some goal to achieve, even if only a minor one.</p><p><strong>Step 2: move towards it.</strong> So, you've found a goal. Nice work.</p><p>Now solve it tomorrow.</p><p>Can you? Seriously ask yourself whether or not you can solve the problem tomorrow. I don't care how ambitious it is. Can you solve it tomorrow? If yes, then do it. If not, why not? Say the obstacles aloud.</p><p>The usual answers are something like \"I lack the power, time, money, network, and so on.\" Which is great! Now we're getting somewhere.</p><p><i>These</i> are what you need to work on tomorrow, if you want to solve the problem.</p><p>Don't ask \"what would be good to do,\" ask \"what is standing between me and solving the problem immediately.\" Identify the obstacles. Your task is now to either remove them or cheat your way around them.</p><p>Of course, most of the obstacles themselves are still too big and vague. So ask yourself why you can't solve those problems tomorrow. Say you don't know the people you'd need to know to have a shot at fixing education. Can you contact them all tomorrow? That <i>probably</i> wouldn't go well, but why not? What are the obstacles between you and acquiring the resources you're going to need?</p><p>Rinse, repeat. Identify the obstacles to overcoming the obstacles, and so on. Eventually, this process will ground out in things that you can actually start doing tomorrow, with a path that you can trace all the way back up to your goal.</p><p>Once you have that, throw reservations to the wind, and start <i>today.</i></p><h1>3</h1><p>Moving towards the goal doesn't solve the whole problem. If you want to solve a goal effectively, in the time allotted, it is important to approach the obstacles in the right order, to identify the ones you can safely cheat past, to correctly distinguish between short paths to the goal and long ones. But many people aren't there yet: they're still asking \"what would be good for me to do,\" and not \"what stands between me and solving the whole problem tomorrow.\"</p><p>My advice, if you want to be effective, is <i>always be solving the problem.</i> With each motion, be overcoming an obstacle that stands between you and the goal. If the obstacles are too large, then your next task is to get stronger, get smarter, or find a way around. That is what it means, to find a path to the goal.</p><p>To achieve a goal, simply keep moving along that path.</p>", "user": {"username": "So8res"}}, {"_id": "CTD4yLt4Tgrr4wE2x", "title": "Anti Publication Bias Registry", "postedAt": "2014-12-10T16:42:03.354Z", "htmlBody": "<html><body><p>Are you conducting some kind of experiment, or planning to? Well, I don&apos;t know about it yet! So when the stunning results come out, I can say &quot;hey, maybe you just got lucky. If your experiment had returned a negative result then we wouldn&apos;t have heard anything about it&quot;.</p>\n<p>This is called publication bias.</p>\n<p>So I&apos;m launching the <a href=\"http://effective-altruism.wikia.com/wiki/Anti_Publication_Bias_Registry\">anti publication bias registry</a>, a place to record EA-related experiments before you know what the results are going to be.</p>\n<p>It&apos;s on a wiki, which allows you to change the description afterwards - this has good points and bad points. A good point is that it allows you to change your experimental design as you go along, in order to best fit the world. A bad point is that this can introduce bias. But remember, we do have the edit history so blatant cheating will be hard (such as completely changing an experiment, or deleting it). More subtle cheating is also discouraged, such as adding extra statistical tests because the data seem to be pointing that way.</p>\n<p>You can also register experiments by commenting on this post - someone will probably copy it to the wiki eventually anyway.</p>\n<p>Be as detailed as you can be bothered to be in your experiment descriptions. This will hopefully encourage others to follow your example and be careful in how they set up their experiments.</p>\n<p>A second purpose of this is to introduce social commitment towards actually completing and writing up experiments once they&apos;ve been suggested.</p>\n<p>Have fun doing science!</p></body></html>", "user": {"username": "Giles"}}, {"_id": "pFCs54XG5JGj6aey3", "title": "Stuck? Talk to an EA Buddy!", "postedAt": "2014-12-10T04:40:01.782Z", "htmlBody": "<html><body><p>Several times in the past, I&apos;ve had burning questions and not been sure who to talk to about them. People outside the EA movement have too great an inferential distance, and people inside the EA movement are all so busy doing important stuff! Why would they want to answer my question which will probably turn out to be silly anyway?</p>\n<p>Just in case there are other people who feel like that, I&apos;m launching the <a href=\"https://impact.hackpad.com/Effective-Altruism-Buddies-uqd9s3yXr5P\">EA Buddy System</a>. The idea is to get people to talk to each other when stuck.</p>\n<ul>\n<li><span>Not sure what&apos;s the &quot;most effective&quot; thing to do next?</span></li>\n<li><span>Unable to get yourself to do stuff?</span></li>\n<li><span>Generally bewildered by the effective altruism concept?</span></li>\n<li><span>Want &quot;permission&quot; to help out on a project?</span></li>\n<li><span>Aren&apos;t sure if you &quot;qualify&quot; as an effective altruist yet?</span></li>\n</ul>\n<p><span>The EA buddies are here to help with these kinds of problem. It&apos;s peer-to-peer rather than master/apprentice, meaning we all have problems and can all learn from each other.</span></p>\n<p><span>The way into the system is easy enough - just email </span><span><a href=\"https://altruismbuddy@gmail.com\">altruismbuddy@gmail.com</a></span><span>, or get in touch with <a href=\"https://impact.hackpad.com/Effective-Altruism-Buddies-uqd9s3yXr5P\">one of the people on this list</a> on facebook. After that, we&apos;ll set up Skype calls at convenient times. After <em>that </em>we&apos;ll have to see, because I&apos;ve only just set this up.</span></p>\n<p><span>I&apos;m posting this here in order to advertise it, and also to ask for advice on what really obvious things I can do to make the system more effective.<br></span></p></body></html>", "user": {"username": "Giles"}}, {"_id": "uthnm5ZXKFiwn6WPy", "title": "Upcoming Meetups 6", "postedAt": "2014-12-08T17:29:00.830Z", "htmlBody": "<html><body><p>Meetups coming up this fornight include:</p>\n<li><a href=\"/meetups/1o\">Toronto</a>&#xA0;<span>11 Dec 2014 19:00</span></li>\n<li><a href=\"/meetups/1e\">Seattle, WA</a>&#xA0;<span>13 Dec 2014 17:30</span></li>\n<li><a href=\"/meetups/1d\">La Place, Utrecht, Rijnkade 5</a>&#xA0;<span>14 Dec 2014 18:51</span></li>\n<li><span><a href=\"https://www.facebook.com/events/972960009386423/?ref=2&amp;ref_dashboard_filter=upcoming\">Christmas Potluck with Effective Altruism Melbourne</a>&#xA0;13 Dec 2014 18:00</span><span>&#xA0;</span></li></body></html>", "user": {"username": "RyanCarey"}}, {"_id": "4eYQboiQ3tDaStPYS", "title": "Want to make $100/hr for charity? Raise money this Christmas, with donation matching", "postedAt": "2014-12-07T18:03:19.034Z", "htmlBody": "<html><body><p><img src=\"https://www.charityscience.com/uploads/1/0/7/2/10726656/2696689_orig.gif\" alt=\"ecard\"></p>\n<p>The air is chill, the days are short and the streets are decked with lights - it&#x2019;s Christmastime. But if you&#x2019;re anything like me, you struggle to come up with presents for people to get you, not wanting to accumulate yet more stuff. You may even have stopped getting presents from friends or family. Or perhaps you don&#x2019;t like to ask for things for yourself, or don&#x2019;t buy into the materialism and consumerism of it all.</p>\n<p>If this description fits you then you may be interested in running one of Charity Science&#x2019;s Christmas fundraisers. These provide a webpage through which your family and friends can easily donate to one of the world&#x2019;s best charities, as a present to you. You simply tell them that this is what you&#x2019;d like. You can <a href=\"http://www.charityscience.com/christmas-fundraisers.html\">find suggested messages here</a>, and we provide default copy for your fundraiser page, so it&#x2019;s very easy on your part. If people want to give you something physical, we provide illustrated tokens (pictured above) that they can print out or email. And there&#x2019;s a way to have your donations be revealed on Christmas day.&#xA0;<strong>All donations get matched dollar-for-dollar too.</strong></p>\n<p>We&#x2019;ve helped many people run similar fundraisers for their birthdays, and these have got great reactions from their friends and family, raising hundreds or thousands of dollars each - <a href=\"http://birthday.causevox.com/\">one raised $7,000</a>! This was so even when people hadn&#x2019;t received presents for years, so if you&#x2019;re in that boat then there&#x2019;s no need to let it put you off - instead, see it as the first present for some time that&#x2019;s been worth asking for. When you can treat someone for worms for $1 or distribute a bednet for $6, it&#x2019;s worth starting getting presents again - and you&#x2019;ll also be sharing a great opportunity with the people you tell! This outreach effect is another reason to run a fundraiser.</p>\n<p>Christmas is the classic time of year to talk about giving, and a time when people can fundraise for charity without appearing pushy. <strong>So why not take this opportunity and </strong><strong>create a Christmas fundraiser now</strong><strong>, or </strong><a href=\"http://www.charityscience.com/christmas-fundraisers.html#788349117760338128\">register your interest</a><strong>?</strong> Donations to the world&#x2019;s best charities are a chance to save and improve lives - and a present worth asking for.</p>\n<p>&#xA0;</p>\n<ul>\n<li><a href=\"http://uschristmas.causevox.com/\">Create a fundraiser in the US</a></li>\n<li><a href=\"http://christmas.causevox.com/\">Create a fundraiser in Canada</a></li>\n<li><a href=\"http://ukchristmas.causevox.com/\">Create a fundraiser in the UK</a></li>\n<li><a href=\"http://ozchristmas.causevox.com/\">Create a fundraiser in Australia</a></li>\n</ul>\n<p>&#xA0;</p></body></html>", "user": {"username": "Tom_Ash"}}, {"_id": "pF3rZw8RzmiqQn26L", "title": "Interview with Nir Eyal on Population-Level Bioethics and Non-Utilitarian Effective Altruism", "postedAt": "2014-12-07T04:32:03.802Z", "htmlBody": "<html><body><div>\n<p>This interview was done by Melody Guan and Yifan Wu from <a href=\"/harvardea.org\">Harvard College Effective Altruism</a>. It was originally <a href=\"http://harvardea.org/news/2014/11/14/eyal-interview/\">posted</a> on our blog, and I thought it was worth cross-posting on this forum.</p>\n<hr>\n<p><em>Nir Eyal is Associate Professor of Global Health and Social Medicine in the Center for Bioethics at Harvard Medical School and at the Department of Global Health and Population at the Harvard T.H. Chan School of Public Health. He is co-editor of the Oxford University Press series Population-Level Bioethics, and (among other things) chairs the Committee on Philosophy and Medicine of the American Philosophical Association. Eyal&#x2019;s writings fall primarily in clinical, research, and population-level bioethics. He wrote on ethical questions surrounding HIV research, health worker shortages, healthcare rationing in resource-poor settings, informed consent, personal responsibility for health, fair risk distribution, and accrediting corporations for improving global health. Beyond bioethics, he researches egalitarian theory and consequentialism. Eyal also serves as the faculty advisor of Harvard College Effective Altruism.</em></p>\n<p><strong>HEA:</strong><span> How do we define &#x2018;effectiveness&#x2019;? What is the relationship between &#x2018;effectiveness&#x2019; and &#x2018;fairness&#x2019; and how do we balance these two considerations?</span></p>\n<p><strong>Eyal:</strong><span> In my view, fairness matters, and it matters independently of effectiveness understood as maximizing utility. I am a philosophical egalitarian. An egalitarian means someone who cares at least some for equality. For example if we can improve the utility or the health of people who are worse off, say with very bad lifetime health or income, and improve by the same amount the utility or the health of people who are very healthy or wealthy, in my view helping those who are worse off is preferable. One reason is simply that they are worse off. Some effective altruists don&#x2019;t share my position, but for our purposes this disagreement is not very important, for two reasons. One is that money and other fungible resources have decreasing marginal value, so a poor person typically benefits more from an extra dollar than Bill Gates does. Another reason why there often is agreement between utilitarians who don&#x2019;t value equality intrinsically and people like me who do is that the most effective things one could do to improve wellbeing happen to address the problems of some of the world&#x2019;s poorest populations. As Toby Ord emphasizes, a band of interventions such as child vaccinations and mosquito nets have cost effectiveness that far surpasses that of most other interventions currently promoted, by an order of one thousand or more. Even if you give some independent weight to equality, surely you are not going to give it the kind of weight that could override that kind of advantage in cost effectiveness. So in practice we can work very well together.</span></p>\n<p>Another lesson from this. which I don&#x2019;t think people understand enough, is that you do not need to be a utilitarian in order to be a serious effective altruist. As I said, I&#x2019;m not a utilitarian. A lot of Harvard philosophers are anti-consequentialist; they think that there are some methods for promoting good consequences that remain wrong. For example, to promote good causes by torturing innocents or by lying to people can remain wrong. But they can all be effective altruists because the &#x201C;band&#x201D; of interventions we just talked about are of the sort that any sane person would promote when there no gross violation is demanded. It&#x2019;s very rare for promoting these causes to require gross violations of individual rights or to be grossly opposed to equality. In short, every reasonable person could be and should be an effective altruist. Even if you give some weight to non-consequentialist considerations, it&#x2019;s rare to find an ethicist who would just leave on the sidewalk a check for a thousand times more impact, in the name of avoiding a minor transgression or accomplishing any improvement in equality.</p>\n<p><strong>HEA:</strong><span> How do we determine utility in dimensions beyond mortality or quality of living? For example how do we quantify the value of saving a child&#x2019;s life versus making a blind person see again? Is valuation subjective in the sense that we care more about causes that we are connected to through experience?</span></p>\n<p><strong>Eyal: </strong><span>Health economists and epidemiologists already have techniques to try to assess overall impact. They are already in the business of comparing the prevention of mortality and that of blindness, for example. These techniques sometimes involve surveying a large population regarding which of two health states they would prefer, say a small likelihood of dying and a high likelihood of a certain degree of blindness, and then doing careful epidemiological work to glean a general lesson about the weights that should be assigned to the different states. There are many problems with the prevailing techniques for doing that. Experts are working on improving these techniques, but the bottom line is that we are already [ assigning weights to different health states ], so effective altruists could potentially use existing strategies or hone them.</span></p>\n<p><strong>HEA:</strong><span> Do organizations like GiveWell evaluate effectiveness only based on how effective they are at achieving their goals or also on how important their goals are?</span></p>\n<p><strong>Eyal:</strong><span> The latter. GiveWell try to find how much impact on well being different organizations have. That&#x2019;s very fortunate because it&#x2019;s very easy to be effective at achieving one&#x2019;s goals &#x2014; all one needs to do is to find an easy goal to meet even if that goal has no importance whatsoever, or other organizations have already achieved it. GiveWell use findings from research groups such as the Disease Control Priorities second iteration, called DCP2, which gave rough numbers on the cost-effectiveness of various health interventions in developing countries. For instance, what&#x2019;s more effective for combatting Cholera: giving vaccinations or teaching nurses to wash their hands? Colleagues at Harvard are promoting Cholera vaccination, but DCP2 quotes the effectiveness of teaching nurses to wash their hands at 1000 times greater.</span></p>\n<p><strong>HEA: </strong><span>How should investing in novel, research-based solutions be balanced against tackling current, low-hanging-fruit issues using known solutions? It seems that a lot of global development work does not emphasize scientific innovation.</span></p>\n<p><strong>Eyal:</strong><span> Delivering now something that&#x2019;s known to work versus delivering later what is currently only experimental, if and when it gets proven, involves two differences. One is in the level of &#x201C;gambling&#x201D; and the other one is between close in time and farther along in time. I think there is no intrinsic value in being risk averse and in showing value in the nearer future [ as opposed to in the later future ]. But the answer will differ according to the details and the numbers in concrete cases.</span></p>\n<p><strong>HEA:</strong><span> When making explicit models for quantifying the value of causes, should we always embed complications like risk aversion and time value of money calculations (as captured in most economic models)?</span></p>\n<p><strong>Eyal:</strong><span> You are right in that these are issues of ethical complexity here. A related, third topic of ethical complexity: how to count deaths at different stages of life? Should we count the death of a one day old baby expected otherwise to live many years as a far worse tragedy than the death of a college student expected to live a few less years forthwith? This requires careful consideration.</span></p>\n<p><strong>HEA: </strong><span>Will we ever agree on one answer for these questions? Or perhaps we&#x2019;ll have to live with uncertainty?</span></p>\n<p><strong>Eyal:</strong><span> One possible policy is to prioritize the areas where genuine uncertainty shows up less, so that we are relatively immune from uncertainty. By &#x201C;uncertainty,&#x201D; I don&#x2019;t mean a matter of actual public debate. Many public debates are due to simple misunderstanding, or money infusion into the political debate. I mean genuine, deep doubt among highly informed people. One reason why I&#x2019;m excited about working in global health is that there is very little doubt about the urgency of the basic causes being served&#x2014;promoting the health of relatively unhealthy and poor people. Little if any uncertainty about the value of that.</span></p>\n<p><strong>HEA:</strong><span> What are some difficult open questions related to global health?</span></p>\n<p><strong>Eyal:</strong><span> One hard question is how to allocate organs for transplantation. You could prioritize the patients who are likely to benefit the most from the organs, that is, those whose prospects would improve the most from receiving them. You could alternatively prioritize those patients who have been registered on the waitlist or on dialysis the longest time, which is how in the US kidneys are currently being allocated. You could also prioritize patients by how ill they would be without receiving the organ, that is, give the organs to severely ill patients. Ethicists try to find good arguments for and against different distributive principles.</span></p>\n<p><strong>HEA:</strong><span> How do cultural considerations factor in?</span></p>\n<p><strong>Eyal:</strong><span> Culture enters the picture, because it affects what intervention would work and which would fail. Furthermore, if for cultural reasons people feel utterly violated by an intervention that would improve their health, that&#x2019;s not a happy scenario. Effective altruists should take that into account even if, like myself, they are not cultural relativists.</span></p>\n</div>\n<div></div></body></html>", "user": {"username": "Ales_Flidr"}}, {"_id": "AuPXwvGHrXmSQQczM", "title": "Economic altruism", "postedAt": "2014-12-05T00:51:44.715Z", "htmlBody": "<html><body><p>Alice and Bob have joint ownership of a pie, and they would like to split it. If they want to do anything other than split it evenly, there are two common approaches:</p>\n<ul>\n<li><strong>Altruism. </strong>They talk it out, determine who likes pie more, and implement the socially optimal allocation.</li>\n<li><strong>Economic self-interest.&#xA0;</strong>Each gets half of the pie, and if one of them likes pie more they can buy the other out. Each acts in their own self-interest.</li>\n</ul>\n<p>I think the best approach is in between:</p>\n<ul>\n<li><strong>Economic altruism. </strong>Each says how much they would be willing to pay for the pie. The price of the pie is the average, and the high bidder buys out the loser.</li>\n</ul>\n<p>[ETA: Jess points out that Bethany already has <a href=\"http://messymatters.com/autonomy\">a nice post about very similar ideas</a>.]</p>\n<p>This scheme has three excellent properties:</p>\n<ol>\n<li>It is optimal, if everyone behaves honestly.</li>\n<li>It involves only local decisions. Each participant only has to answer: how much do <em>I </em>want X?</li>\n<li>It is robust: if someone behaves dishonestly, makes mistakes, or communicates incorrectly, the worst they can do is &#x201C;walk away&#x201D; with their half of the pie.</li>\n</ol>\n<p>Economic self-interest fails on count [1]. Whenever there is a surplus to be divided, economically rational agents will fight to capture more of it. And in their efforts, they <a href=\"http://en.wikipedia.org/wiki/Myerson%E2%80%93Satterthwaite_theorem\">will typically</a> make things worse. Alice will overstate how much she likes pie to sell it for more, and Bob will understate how much he likes pie to buy it for less. And in the end, too little pie will be exchanged. Not sharing information is another canonical way to capture a large share of a smaller surplus.</p>\n<p>Altruism fails on counts [2] and [3]. If you can count on everyone to be honest, then altruism gets you to an optimal outcome&#x200A;&#x2014;&#x200A;but so does economic altruism. And thinking about what other people want is hard. In practice, I would expect the altruists to just split the pie fairly, which is uninspiring.</p>\n<p>The general principle is: &#x201C;Make good deals, but don&#x2019;t worry about how you split the surplus.&#x201D; The part where you split the surplus evenly isn&#x2019;t really important, though 50&#x2013;50 is a nice Schelling point.</p>\n<p>Economic behavior can help make efficient, robust decisions. You don&#x2019;t need to give up on altruism to get those benefits. And conversely, altruism can grease the wheels of trade. I think economic altruism is a good attitude towards many interactions between nice people. If you can&#x2019;t see how it applies to a particular situation, odds are you aren&#x2019;t looking hard enough.</p>\n<p>&#xA0;</p>\n<p>I <em>almost</em> stopped there and successfully wrote a short post. But I can&apos;t resist raising and addressing possible problems. Read on only if you have the stamina for it.</p>\n<h1>Problems</h1>\n<p><strong>Issue 1</strong>: Quantifying things is hard. Alice might have an easier time thinking <em>qualitatively </em>about what Bob wants than thinking&#xA0;<em>quantitatively </em>about what Alice wants. But based on experience I think that this is a matter of practice&#x200A;&#x2014;&#x200A;and that it&#x2019;s good practice.</p>\n<p>Perhaps the bigger problem is that when people quantify they also feel the need to be <em>precise. </em>When they can&#x2019;t be precise, they don&#x2019;t want to quantify, and when they see something quantified, they assume it is precise. This is a trap. It doesn&#x2019;t matter that much if you guess wrong about which of Alice and Bob most wants the pie. And it doesn&#x2019;t matter that much if you guess wrong about whether the pie is worth $1 or $3. Just go with your best guess; it&#x2019;s what you were doing anyway.</p>\n<p>Taking time to make a better estimate is useful if it helps you better allocate the pie&#x200A;&#x2014;&#x200A;but that would have been helpful even if you weren&#x2019;t quantifying. Taking time to make a better estimate might also help you get <em>exactly </em>what you are owed, rather than a noisy estimate; but just because you are being quantitative doesn&apos;t mean you have to start fighting over the surplus. (Though see the discussion of adverse selection below.)</p>\n<p>Quantifying willingness to pay also makes our motives more explicit, where we might prefer them remain implicit. I&apos;m not going to dwell on this point, but I will suggest that transparency is actually an important social good, and we should actually try to encourage it. It&apos;s unrealistic to be transparent about everything, but we can at least be a bit more transparent.</p>\n<p>Comparing between &#x201C;Alice gets a pie&#x201D; and &#x201C;Bob gets a pie&#x201D; doesn&#x2019;t seem fundamentally easier than comparing between &#x201C;Alice gets a pie&#x201D; and &#x201C;Alice gets $2.&#x201D; And if Alice can&#x2019;t make the second kind of decision, she has bigger problems than being unable to efficiently split a pie with Bob.</p>\n<p><strong>Issue 2</strong>: People don&#x2019;t like dealing with money. That&#x2019;s fine&#x200A;&#x2014;&#x200A;economics isn&#x2019;t about money. If Alice and Bob often interact, they can trade pie for hamburgers or labor or whatever.</p>\n<p>Or they can introduce a new currency only for use in Alice-Bob trades. The hard part is specifying how Alice and Bob should make decisions about this fictional currency, given that it has no intrinsic value. I&#x2019;ll leave the details to the reader or to a future post. (One short answer is &#x201C;logarithmic returns to fictional money&#x201D;.) Also note the analogy with real currency.</p>\n<p>Or two altruists can trade <a href=\"/ea/ak/certificates_of_impact/\">certificates of impact</a> if they both use that system. You can do the same with donations; this has a number of problems, but might still work better than directly exchanging cash.</p>\n<p><strong>Issue 3</strong>: When dealing with profit-seekers who know more than you, you need a bid-ask spread to compensate for adverse selection. If someone is willing to sell you a car, it&#x2019;s more likely to be junk. This breaks property [3]: it is possible for a dishonest participant to do harm. So with a profit-seeking counterparty, you should be willing to buy only at a strictly lower price than you are willing to sell. As a result, deals happen less often than would be optimal.</p>\n<p>Homo economicus only holds back information to capture more of the surplus. So altruists share relevant information. And when dealing with an altruist, you don&apos;t want a spread beyond the transaction costs.</p>\n<p>To be very explicit about it, you might even ask &quot;is there anything else I should know?&quot;, behave altruistically if you get a straight answer, and only be vulnerable to active malice.</p>\n<p>If I&#x2019;m dealing with a stranger from the internet, then I anticipate adverse selection from the outset. Being nice doesn&#x2019;t mean being a fool. But for repeat interactions, I normally assume innocence and only defect when it becomes necessary---e.g. if you and I interact every day, I won&apos;t charge you a spread until I see that it is necessary.&#xA0;</p>\n<p><strong>Issue 4</strong>: Does this ever come up? Is there really room for improvement? I think so. And if you have it in mind&#x200A;&#x2014;&#x200A;if you compare the decisions we <em>actually </em>make to the best decisions we <em>could </em>make&#x200A;&#x2014;&#x200A;I think that you too will see it all around you.</p></body></html>", "user": {"username": "Paul_Christiano"}}, {"_id": "ttLkgziaDn6AqmTcx", "title": "Meetup : Toronto EA meetup", "postedAt": "2014-12-04T20:17:39.072Z", "htmlBody": "<html><body><h2>Discussion article for the meetup : <a href=\"/meetups/1o\">Toronto EA meetup</a></h2>\n\t\t  <div>\n\t\t\t\t<p>\n\t\t    \t<strong>WHEN:</strong> \n\t\t    \t<span>11 December 2014 07:00:00PM (-0500)</span><br>\n\t\t\t\t</p>\n\t\t\t\t<p>\n\t\t    \t<strong>WHERE:</strong> \n\t\t    \t<span>Toronto</span>\n\t\t\t\t</p>\n\t\t  </div><!-- .meta -->\n\t\t  <div>\n\t\t    <div><p><a href=\"http://www.meetup.com/THINK-Toronto/events/219068850/\">See here</a> for location and RSVP.</p>\n\n<p>We haven&apos;t had an effective altruism meetup in Toronto for a while, so time for a relaunch! No particular fixed topic, just a chance to meet each other, hang out and discuss what&apos;s new.</p></div>\n\t\t  </div><!-- .content -->\n\t\t<h2>Discussion article for the meetup : <a href=\"/meetups/1o\">Toronto EA meetup</a></h2></body></html>", "user": {"username": "Giles"}}, {"_id": "6KrsMimFJb3BiRFAp", "title": "Introducing a website for local EA groups", "postedAt": "2014-12-03T20:48:46.211Z", "htmlBody": "<html><body><p>Local effective altruist groups play a valuable role. They&#x2019;re where much outreach and fundraising happens, and are the way in which many effective altruists first get involved. They help build community and gradually get people more into EA. There are many groups around the world from Auckland to Vancouver with a lot of great people working on them.</p>\n<p>With this in mind, one of .impact&#x2019;s first projects was to create a map of local groups at <a href=\"http://meetups.im/\">http://meetups.im/</a>. We&#x2019;re now relaunching this with a comprehensive list of local groups and meetups around the world. Each group has its own <a href=\"http://effectivealtruismhub.com/groups/giving-what-we-can-penn\">dedicated page</a> through which it can share information like donations made or influenced by the group, its meetup schedule, and the place where you can find upcoming meetups (be it the EA Forum&#x2019;s <a href=\"/meetups/\">upcoming meetups list</a> or the group&#x2019;s Facebook page). You can see the relaunched site and find groups near you at:</p>\n<p><strong><a href=\"http://effectivealtruismhub.com/groups\">http://effectivealtruismhub.com/groups </a></strong></p>\n<p>The <a href=\"http://effectivealtruismhub.com/map\">EA Map</a> now points people to nearby groups, as several people have requested since we launched it recently. At <a href=\"http://effectivealtruismhub.com/groups/giving-what-we-can-penn\">GWWC Penn</a>&#x2019;s suggestion, people <a href=\"http://effectivealtruismhub.com/donations/add\">reporting donations via the EA Donation Registry</a> can also now tag a local group they&#x2019;re associated with, so that these can show up on the group&#x2019;s page.</p>\n<p>We&#x2019;re pleased that the groups site has got a great reception from the local groups that we&#x2019;ve shared it with. We hope that it will help many people find groups near them, now and in the future.</p>\n<p><img src=\"http://tog.philosofiles.com/uploads/linked-elsewhere/ea/groups-map.png\" alt=\"\"></p></body></html>", "user": {"username": "Tom_Ash"}}, {"_id": "9XFofMHc8hJpGeWka", "title": "Ideas for new experimental EA projects you could fund!", "postedAt": "2014-12-02T02:47:04.545Z", "htmlBody": "<html><body><p>A while ago there was a thread about ideas for <a href=\"/ea/8l/brainstorming_thread_ideas_for_large_ea_funders/\">new projects for large EA funders to back</a>. We had a similar email thread here at the Centre for Effective Altruism (CEA) and the Future of Humanity Institute (FHI) at Oxford, about &apos;blue sky funding opportunities&apos;. As the Christmas giving season approaches, I thought I would mention a few of my favourites. I am happy to field questions about the details in the comments section, inasmuch as I know them.</p>\n<p>1. <a href=\"https://docs.google.com/document/d/1x4NxgPbNce51_pFPzRSnUT5xYTXBCztJQ8FK1IuV8BA/edit\">Put money in an EA &apos;venture&apos; fund</a> that publicly announces it is seeking to fund new projects with particular characteristics (e.g. scaling a demonstrated anti-poverty intervention). Use this &apos;money on the table&apos; to encourage more entrepreneurs to come forward with early-stage business plans. Otherwise help to connect donors with founders. More or less the same idea is mentioned <a href=\"/ea/8l/brainstorming_thread_ideas_for_large_ea_funders/so\">here</a>.</p>\n<ul>\n<li>There is a &gt;50% chance CEA will launch something like this in the coming year.</li>\n</ul>\n<p>2.&#xA0;<a href=\"/ea/8l/brainstorming_thread_ideas_for_large_ea_funders/t5\">Offer prizes</a>&#xA0;for people who have achieved awesome things to both help and encourage them to continue achieving awesome things.</p>\n<p>3. <a href=\"http://lesswrong.com/r/discussion/lw/lco/could_you_be_prof_nick_bostroms_sidekick/\">Hire a full or part-time Personal Assistant for Prof Nick Bostrom</a>, so he can spend as much time as possible doing follow-up research for his popular book,&#xA0;<a href=\"https://en.wikipedia.org/wiki/Superintelligence:_Paths,_Dangers,_Strategies\">Superintelligence</a>. This would also indirectly free up staff time for project managers and researchers in the rest of FHI.</p>\n<ul>\n<li>CEA would try to recruit someone suitable for this role if it could be funded, but there may not be anyone who would meet all the requirements.</li>\n</ul>\n<p>4. Fund a founding employee for &apos;CEA USA&apos;. This person would:</p>\n<ul>\n<li>Develop a strategy for how CEA USA can be most useful to the movement. The Board has met and considered a couple of options so far.</li>\n<li>Simultaneously, start cultivating a donor base who might support that expansion. If donors aren&apos;t convinced, go back and edit the strategy, as that would be a bad sign.</li>\n<li>Do the remaining operations necessary for CEA USA to receive donations in a variety of ways; hire people; do payroll; meet its legal reporting requirements;&#xA0;set up a basic website,&#xA0;and so on.</li>\n</ul>\n<p>The board would probably approve a recruitment process to try to find someone suitable for this position if funds were available.</p>\n<ul>\n</ul>\n<p>5. Fund a professional fundraiser to raise money for CEA/FHI/<a href=\"http://cser.org/\">CSER</a>/<a href=\"http://futureoflife.org/\">FLI</a>. We have not yet found a good candidate for this, but if we were offering closer to market wages (&#xA3;40-60,000p.a.) we might find someone suitable to bring us expertise fundraising from major donors.</p>\n<ul>\n<li>If you want to fund this for CEA, talk to me. If you want to fund this for FHI, talk to Cecilia Tilli. If you want to fund this for CSER talk to Sean O&apos;Heigeartaigh.</li>\n</ul>\n<p>&#xA0;</p>\n<p><strong>Possible individual projects you could already fund by giving to CEA</strong></p>\n<p>The following you could fund by <a href=\"https://centreforeffectivealtruism.org/donations/\">giving to CEA</a>. <a href=\"/message/compose/\">Message me</a> if you are interested, so I can send you more information on how much we would need to raise to press ahead with these projects.</p>\n<p>1. We are raising money to help market both William MacAskill&apos;s book Doing Good Better, and Peter Singer&apos;s book, The Most Good You Can Do. If funds are available, we will hire a professional book promotion company to do this. Outputs could include, depending on the amount of money raised: websites for the books; launch events; more media appearances booked; more opportunities to write op-eds based on the books&apos; content; articles placed in newspapers connecting the books to current events; potentially even a promotional video.</p>\n<p>2. CEA could hire a contractor to work on a set of&#xA0;<a href=\"/ea/bl/should_we_launch_a_podcast_about_highimpact/\">podcasts about effective altruism</a>. If we liked them, we could then produce more.</p>\n<p>3.&#xA0;Test out&#xA0;<a href=\"https://docs.google.com/document/d/1k5meevj7ONs67X6g5-8iDJEGST76V8pFPm4GX5zchEI/edit\">mainstream pamphleting about effective altruism</a>&#xA0;to see how many, e.g. Giving What We Can members, this can create.</p>\n<p>4. Giving What We Can now has almost 700 members. The majority of our resources go towards attracting new members, as we see this as the most valuable use of time. Some of the work of our Director of Community goes towards deepening engagement with existing members. However, we could now usefully dedicate the Director of Community to&#xA0;<em>just constantly talk to existing members</em>&#xA0;- splitting out the role of talking to potential new members. What would this Director of Community do?</p>\n<ul>\n<li>Speak to, or personally email, every member at least once a year. Ideally build a personal relationship with them in the process.</li>\n<li>Enquire about their giving - Are they fulfilling the pledge? What is holding them back from giving more? Where are they giving? Are they aware of the latest recommendations, and the reasons for them?</li>\n<li>In some cases, give them advice on tax deductibility, our trust, other members who live near them, which charity most aligns with their values, and so on.</li>\n<li>In some cases, let them know about other activities in the effective altruist community they might want to look into, like 80,000 Hours, the Open Philanthropy Project, and so on.</li>\n<li>In the process of doing all this, drive up reporting rates for our annual giving survey. Each year we get data from (a different) 50% of members, after chasing them a bunch. This makes it hard to know how much money we are moving, and what share are dropping out each year.&#xA0;</li>\n</ul>\n<p>I also think that merely speaking regularly with someone from Giving What We Can would make members more likely to stick with the pledge long term.</p>\n<div>If it were me, I would rather fund new member recruitment over the above. However, if I were more skeptical about how much new members would give, and how long they will naturally stick with the pledge, I could prefer to fund the above. I think we will definitely want someone to take on this role full time, sooner or later.</div>\n<div><br></div></body></html>", "user": {"username": "Robert_Wiblin"}}, {"_id": "f4MaRHPLcbcbTnxrN", "title": "Figuring Good Out - Launch Thread", "postedAt": "2014-12-01T22:57:04.307Z", "htmlBody": "<html><body><p>Cross-posted from <a href=\"http://a-nice-place-to-live.blogspot.ca/2014/12/figuring-good-out-december.html\">A Nice Place To Live</a>.</p>\n<p>Recently, I&apos;ve been pitching the idea of an <span><a href=\"http://a-nice-place-to-live.blogspot.ca/2014/11/ea-blogging-carnival.html\">EA blogging carnival</a></span>&#xA0;where each month, somebody picks a topic and then everybody blogs about it.</p>\n<p>As today is the first of the month, I&apos;m going to announce the December topic for&#xA0;<strong>Figuring Good Out*</strong>, the new EA blogging carnival. If you&apos;d like to participate, just write a post on the topic and mention that you&apos;d like to include it in the carnival for this month.</p>\n<p>The topic for December is&#xA0;<strong>&quot;Blind spots.&quot;&#xA0;</strong>You can take that in any direction that you like. For example, what is something altruistically important that you know about that you think most EAs don&apos;t know about? Is there a cause, organization, insight, or productivity tip that EAs are ignoring?</p>\n<p>On December 31, I&apos;ll write a post linking to all the submissions. If you&apos;d like to volunteer to host the January carnival, then let me know below. We can start a queue. As host, you can choose any topic you like but keep in mind that some topics will get more responses than others. If you intend to contribute to this month&apos;s carnival, I recommend commenting below.</p>\n<p>&#xA0;</p>\n<p>*The title &quot;Figuring Good Out&quot; is negotiable if everybody really hates it but it works for me.</p>\n<p>&#xA0;</p></body></html>", "user": {"username": "Bitton"}}, {"_id": "3b87XHvfgd7N7aLgy", "title": "Open Thread 6", "postedAt": "2014-12-01T21:58:29.063Z", "htmlBody": "<html><body><p><span>Welcome to the sixth open thread on the Effective Altruism Forum. This is our place to discuss relevant topics that have not appeared in recent posts.</span></p></body></html>", "user": {"username": "RyanCarey"}}, {"_id": "k4W42YzHk6n2ZDnFE", "title": "The new Animal Charity Evaluators recommendations are out", "postedAt": "2014-12-01T17:43:26.683Z", "htmlBody": "<html><body><p>On the same day as the new GiveWell recommendations, the <a href=\"http://www.animalcharityevaluators.org/blog/introducing-recommendations-december-2014/\">new Animal Charity Evaluators recommendations</a> are out. What are everyone&apos;s thoughts on them? I&apos;d be interested to hear from people who are planning to give to them, or have used ACE&apos;s research in the past.</p>\n<p>The Humane League and Mercy for Animals remain on the list, and are joined by Animal Equality. Like GiveWell, ACE has added a second tier of &quot;standout charities&quot; (they recently <a href=\"http://www.animalcharityevaluators.org/blog/thinking-upcoming-recommendations/\">discussed the pros &amp; cons of doing so</a> on their blog). This list contains the Humane Society of the United States&#x2019; Farm Animal Protection Campaign, Farm Animal Rights Movement, Vegan Outreach, and the Albert Schweitzer Foundation. They have detailed reviews of each of these organisations.</p>\n<p>ACE have set a target of $150,000 in donations for their top three charities, but think that they could use about $1,070,000 in funding this year. So it looks like there&apos;s no shortage of room for more funding in the animal rights movement!</p>\n<p>It&apos;s worth thanking ACE for the great research work that they do. They need donations themselves to keep doing that work, and a generous donor has offered to <strong><a href=\"http://double.animalcharityevaluators.org/\">match donations to them</a></strong> until December 5th.</p>\n<p>Here is a summary of the top charities, taken from ACE&apos;s in depth reports:</p>\n<h2>ACE&apos;s top charities</h2>\n<h3>Animal Equality</h3>\n<p>&quot;Animal Equality advocates for animals by conducting undercover investigations and promoting them through media outlets. They also conduct grassroots outreach, including demonstrations, protests, leafleting, and video showings. Related to their undercover investigations, they also conduct some legal and corporate outreach efforts.</p>\n<p>&quot;Animal Equality has branches in several countries, including the United Kingdom, Germany, Spain, Mexico, and India. We think their model of employing local activists to lead offices while coordinating actions internationally amplifies their effectiveness both by allowing them to present materials to more people and by directing resources to locations where they can be particularly effective.&quot;</p>\n<h3>The Humane League</h3>\n<p>&quot;The Humane League (THL) works to reduce suffering of farm animals through conducting online advertising, organizing grassroots outreach, instigating cage-free and Meatless Monday campaigns, giving presentations, and engaging in corporate outreach. THL shows exceptional strength in their desire to test for effectiveness, as evidenced by their efforts with Humane League Labs, a program designed to evaluate advocacy presentation and methods. They also use the evidence they find to guide their efforts.</p>\n<p>&quot;THL employs a local model. We find their approach of continually adding local offices an intriguing method to increase their presence and impact, as they claim their new offices are self-sustaining in fundraising within two years of opening.&quot;</p>\n<h3>Mercy For Animals</h3>\n<p>&quot;Mercy for Animals (MFA) advocates for farm animals by conducting undercover investigations, engaging in corporate and legal outreach, running online vegetarian ads, and organizing grassroots outreach events. In particular, their undercover investigations show promise through the multi-faceted positive benefits stemming from their publication and sharing. MFA&#x2019;s professional presentation increases the likelihood of their success in all areas, and they test different arrangements of their materials to maximize impact. They show a willingness to change based on new evidence, and are continually refining their strategic approach in accordance with what seems most successful and cost-effective. We are proud to recognize MFA as one of our top charities.</p>\n<p>&quot;MFA is working to centralize their efforts, reducing the number of offices they have around the country and instead focusing more on investigations and online advocacy. Given their success and increased presence in advocacy, this move makes sense to us as a way to minimize costs and maximize impact.&quot;</p>\n<h2><a href=\"http://effectivealtruismhub.com/donations\"><img src=\"http://effectivealtruismhub.com/sites/effectivealtruismhub.com/media/images/specific-pages/donations-piggy-bank.jpg\" alt=\"\"></a>How to donate</h2>\n<p>The Humane League and Mercy For Animals are tax-deductible in the US, and you can claim GiftAid when giving to&#xA0;Animal Equality in the UK. ACE <a href=\"http://www.animalcharityevaluators.org/donate/donation-register/\">recommends</a> that people donating to effective animal charities <a href=\"http://effectivealtruismhub.com/donations/past/add\">register their donations on the EA Donation Registry</a>, which also lets you report the influence of their research.</p></body></html>", "user": {"username": "Tom_Ash"}}, {"_id": "aJnH5A5GPTqZPdWPB", "title": "The new GiveWell recommendations are out: here's a summary of the charities", "postedAt": "2014-12-01T17:22:27.537Z", "htmlBody": "<html><body><p>GiveWell have <a href=\"http://blog.givewell.org/2014/12/01/our-updated-top-charities/\">just announced</a> their latest charity recommendations! What are everyone&#x2019;s thoughts on them?</p>\n<p>A summary: all of the old charities (GiveDirectly, SCI and Deworm the World) remain on the list. They&apos;re rejoined by AMF, as the room for more funding issues that led to it being delisted have been resolved to GiveWell&apos;s satisfaction. Together these organisations form GiveWell&apos;s list of &apos;top charities&apos;, which is now joined by a list of other charities which they see as excellent but not quite in the top tier. The charities on this list are Development Media International, Living Goods, and two salt fortification programs (run by GAIN and ICCIDD).</p>\n<p>As normal, GiveWell&apos;s site contains extremely detailed writeups on these organisations. Here are some shorter descriptions which I wrote for <a href=\"http://www.charityscience.com/proven-charities.html\">Charity Science&apos;s donations page</a> and my <a href=\"http://effectivealtruismhub.com/actions/donating\">tool for donating tax-efficiently</a>, starting with the new entries:</p>\n<h2>GiveWell&apos;s newly-added charities</h2>\n<h3>Boost health and cognitive development with salt fortification</h3>\n<p>The charities <a href=\"http://www.gainhealth.org/\">GAIN</a> and <a href=\"http://www.iccidd.org/\">ICCIDD</a> run programs that fortify the salt that millions of poor people eat with iodine. There is <a href=\"http://www.who.int/nutrition/topics/idd/en/\">strong evidence</a> that this boosts their health and cognitive development; iodine deficiency causes pervasive mental impairment, as well as stillbirth and congenital abnormalities such as severe retardation. It can be done very cheaply on a mass scale, so is highly cost-effective. GAIN is registered in the US and ICCIDD in Canada <span>(although Canadians can give to either via Charity Science, which for complex reasons helps others who donate tax-deductibly to other charities)</span>, allowing for especially efficient donations from these countries, and taxpayers from other countries can also often give to them tax-deductibly. For more information, read GiveWell&apos;s detailed reviews of <a href=\"http://www.givewell.org/international/charities/GAIN\">GAIN</a> and <a href=\"http://www.givewell.org/international/charities/iccidd\">ICCIDD</a>.</p>\n<h3>Educate millions in life-saving practices with Development Media International</h3>\n<p>Development Media International (DMI) produces radio and television broadcasts in developing countries that tell people about improved health practices that can save lives, especially those of young children. Examples of such practices include exclusive breastfeeding. DMI are conducting a randomized controlled trial of their program which has found promising indications of a large decrease in children&apos;s deaths. With more funds they would be able to reach millions of people, due to the unparalleled reach of broadcasting. For more information, read <a href=\"http://www.givewell.org/international/charities/DMI\">GiveWell&apos;s detailed review</a>.</p>\n<h3>Bring badly-needed goods and health services to the poor with Living Goods</h3>\n<p>Living Goods is a non-profit which runs a network of people selling badly-needed health and household goods door-to-door in their communities in Uganda and Kenya and provide free health advice. A randomized controlled trial suggested that this caused a 25% reduction in under-5 mortality among other benefits. Products sold range from fortified foods and mosquito nets to cookstoves and contraceptives. Giving to Living Goods is an exciting opportunity to bring these badly needed goods and services to some of the poorest families in the world. For more information, read <a href=\"http://www.givewell.org/international/charities/living-goods\">GiveWell&apos;s detailed review</a>.</p>\n<h2>GiveWell&apos;s old and returning charities</h2>\n<h3>Treat hundreds of people for parasitic worms</h3>\n<p>Deworm the World and the Schistosomiasis Control Initiative (SCI) treat parasitic worm infections such as schistosomiasis, which can cause urinary infections, anemia, and other nutritional problems. For more information, read <a href=\"http://www.givewell.org/international/technical/programs/deworming\">GiveWell&apos;s detailed review</a>, or the <a href=\"http://www.charityscience.com/deworming-charities.html\">more accessible Charity Science summary</a>. Deworm the World is registered in the USA and SCI in the UK, allowing for tax-efficient direct donations in those countries, and taxpayers from other countries can also often give to them efficiently.</p>\n<h3>Make unconditional cash transfers with GiveDirectly</h3>\n<p>GiveDirectly lets you empower people to purchase whatever they believe will help them most. <a href=\"http://www.givewell.org/international/technical/programs/cash-transfers\">Eleven randomized controlled trials</a> have supported cash transfers&#x2019; impact, and there is strong evidence that recipients know their own situation best and generally invest in things which make them <a href=\"http://www.givewell.org/files/DWDA%202009/Interventions/Cash%20Transfers/Haushofer%20and%20Shapiro%202013.pdf\">happier in the long term</a>. For more information, read <a href=\"http://www.givewell.org/international/top-charities/give-directly\">GiveWell&apos;s detailed review</a>, or the <a href=\"http://www.charityscience.com/cash-transfers.html\">more accessible Charity Science summary.</a></p>\n<h3>Save lives and prevent infections with the Against Malaria Foundation</h3>\n<p>Malaria causes about a million deaths and two hundred million infections a year. Thankfully a $6 bednet can stop mosquitos from infecting children while they sleep, preventing this deadly disease. This intervention has exceptionally robust evidence behind it, with many randomized controlled trials suggesting that it is one of the most cost-effective ways to save lives. The Against Malaria Foundation (AMF) is an exceptional charity in every respect, and was GiveWell&apos;s top recommendation in 2012 and 2013. Not all bednet charities are created equal, and AMF outperforms the rest on every count. They can distribute nets cheaper than most others, for just $6.13 US. They distribute long-lasting nets which don&#x2019;t need retreating with insecticide. They are extremely transparent and monitor their own impact carefully, requiring photo verification from each net distribution. For more information, read <a href=\"http://www.givewell.org/international/top-charities/AMF\">GiveWell&apos;s detailed review</a>, or the <a href=\"http://www.charityscience.com/malaria-charities.html\">more accessible Charity Science summary</a>.</p>\n<h2><a href=\"http://effectivealtruismhub.com/donations\"><img src=\"http://effectivealtruismhub.com/sites/effectivealtruismhub.com/media/images/specific-pages/donations-piggy-bank.jpg\" alt=\"\"></a>How to donate</h2>\n<p>To find out which charities are tax-deductible in your country and get links to give to them tax-efficiently, you can use <a href=\"http://effectivealtruismhub.com/actions/donating\"><strong>this interactive tool that I made</strong></a>. If you give this season, consider <a href=\"http://effectivealtruismhub.com/donations/past/add\"><strong>sharing the charities you choose on the EA Donation Registry</strong></a>. We can see which charities EAs pick, and which of the new ones prove popular!</p></body></html>", "user": {"username": "Tom_Ash"}}, {"_id": "NrM5J7GwmELMH3iof", "title": "Should we launch a podcast about high-impact projects and people?", "postedAt": "2014-12-01T16:52:41.206Z", "htmlBody": "<html><body><p>An idea I have repeatedly returned to is creating a podcast where I, or someone else, interviews people who are trying to work on high impact projects. It would cover questions like how they decided what to work on, and what practical challenges they face day-to-day.</p>\n<p>Mixing a complicated radio show is very time consuming, so&#xA0;I think I would model it on my favourite podcast, <a href=\"http://econtalk.org/\">EconTalk</a>, which is a straightforward two-person interview. The main overhead is learning about the person&apos;s work ahead of time so that the conversation flows smoothly and the answers are actually interesting.</p>\n<p><strong>Reasons in favour</strong></p>\n<ul>\n<li>It will allow us to meet and learn from people trying to have a large impact across a range of different causes and projects. I am concerned that effective altruism is too insular and does not take enough interest in mainstream professionals and experts, and this could help address that. I also think we invest too little in learning how to actually implement things well, relative to doing theoretical prioritisation research. </li>\n<li>There are not many highly informative podcasts out there. If this turns out to be interesting to listen to, it could attract a decent listenership, particularly of the kinds of people we are most keen to get involved.</li>\n<li>I am excited at the prospect, so it&apos;s likely it would actually happen, and I would probably enjoy working on it.</li>\n</ul>\n<div><strong>Reasons against</strong></div>\n<div>\n<ul>\n<li>It will take a significant investment of time and attention to do well.</li>\n<li>As I don&apos;t know anyone with radio or podcasting experience, it is likely to come across as amateurish at first.</li>\n<li>GiveWell already has something like this on their &apos;<a href=\"http://www.givewell.org/conversations\">Conversations</a>&apos; page. On the other hand, these interviews are not designed to be entertaining or accessible, and so I doubt they are read or listened to by many people. </li>\n</ul>\n</div>\n<div>So my questions are:</div>\n<div>\n<ul>\n<li>Would this be a good use of my or someone else&apos;s time?</li>\n<li>If so, would you be interested in helping schedule these conversations, turn the recordings into podcast episodes, and perhaps later take over doing the interviews yourself?</li>\n</ul>\n<div><br></div>\n</div></body></html>", "user": {"username": "Robert_Wiblin"}}, {"_id": "YCTHxP6tcT4FcDwki", "title": "Spitballing EA career ideas", "postedAt": "2014-11-30T00:02:32.521Z", "htmlBody": "<html><body><div>\n<p><em>Cross-posted from <a href=\"http://www.benkuhn.net/\">my blog</a>. I&apos;d love to hear your thoughts or additional brainstorming of interesting careers!</em></p>\n<p>The standard way of thinking about using one&#x2019;s career for effective altruism focuses a lot on narrowing down what fields you&#x2019;re interested in. For instance, 80,000 Hours has a list of just four <a href=\"https://80000hours.org/career-guide/top-careers/\">&#x201C;top careers&#x201D;</a> and ten or so other second- or third-tier options.</p>\n<p>Thinking about specific fields is important, because some fields do contain more high-impact opportunities than others. But another important piece is the variation you&#x2019;ll see in the best opportunities available <em>within</em> each field. Factors of personal fit also mean that some people might not be well-suited to a lot of the current &#x201C;EA-approved&#x201D; careers.</p>\n<p>Because of this, I think it would be interesting to see some wider-ranging career thinking, considering more possible fields and more different types of skillsets. So I&#x2019;ve made a list of as many jobs as I could think of that sound potentially interesting from an EA perspective.</p>\n<p>I don&#x2019;t think all of these jobs necessarily contain high-impact opportunities, and probably most high-impact opportunities lie outside the fields on this list&#x2014;my only goal is to help get people started thinking more broadly and creatively about their altruistic impact.</p>\n<p><em>Thanks to <a href=\"http://www.ruthiebyers.com/\">Ruthie</a> for suggesting many of these and reading a draft of this post.</em></p>\n<div><span>Contents</span> \n<ul>\n<li><a href=\"#interesting-skillsets\">Interesting skillsets</a> \n<ul>\n<li><a href=\"#product-management\">Product management</a></li>\n<li><a href=\"#event-organizing\">Event organizing</a></li>\n<li><a href=\"#recruiting\">Recruiting</a></li>\n<li><a href=\"#sales\">Sales</a></li>\n<li><a href=\"#marketing\">Marketing</a></li>\n<li><a href=\"#promoting\">Promoting</a></li>\n</ul>\n</li>\n<li><a href=\"#influencing-money\">Influencing money</a> \n<ul>\n<li><a href=\"#venture-capital\">Venture capital</a></li>\n<li><a href=\"#grantmaking\">Grantmaking</a></li>\n<li><a href=\"#wealth-management\">Wealth management</a></li>\n</ul>\n</li>\n<li><a href=\"#influencing-politics\">Influencing politics</a> \n<ul>\n<li><a href=\"#lobbying\">Lobbying</a></li>\n<li><a href=\"#regulation\">Regulation</a></li>\n<li><a href=\"#think-tank-work\">Think-tank work</a></li>\n</ul>\n</li>\n<li><a href=\"#influencing-people\">Influencing people</a> \n<ul>\n<li><a href=\"#mainstream-career-advising\">Mainstream career advising</a></li>\n<li><a href=\"#life-coaching\">Life coaching</a></li>\n<li><a href=\"#religiouspseudo-religious-leadership\">Religious/pseudo-religious leadership</a></li>\n<li><a href=\"#teaching\">Teaching</a></li>\n<li><a href=\"#running-a-summer-camp-or-other-extracurricular\">Running a summer camp (or other extracurricular)</a></li>\n<li><a href=\"#writing\">Writing</a></li>\n</ul>\n</li>\n<li><a href=\"#generic-leverage\">Generic leverage</a> \n<ul>\n<li><a href=\"#developing-world-entrepreneurship\">Developing-world entrepreneurship</a></li>\n<li><a href=\"#data-science\">Data science</a></li>\n<li><a href=\"#consulting-for-nonprofits\">Consulting for nonprofits</a></li>\n<li><a href=\"#technology-in-academia\">Technology in academia</a></li>\n</ul>\n</li>\n<li><a href=\"#generally-solid-jobs\">Generally solid jobs</a></li>\n</ul>\n</div>\n<h2>Interesting skillsets</h2>\n<p>Lots of jobs seem worth exploring purely because they build interesting skills that are very different from the current demographics of the EA movement. This has a ton of benefits: it makes the movement more robust, adds diversity of thought and of capability, and set a good role model for prospective new aspiring EAs who aren&#x2019;t cut from the software-engineer/philosopher cloth. (Many of these apply to some extent to jobs in other categories as well, but especially strongly to jobs in this category.)</p>\n<h3>Product management</h3>\n<p>At tech companies, product managers are responsible for coordinating engineering efforts on a product&#x2014;making sure that the engineers respond to what users want, that they work on important features, that everyone is properly coordinated, etc. It&#x2019;s not necessarily a technical position, and it involves a lot of interesting work.</p>\n<h3>Event organizing</h3>\n<p>The fact that I currently have any authority on the subject of organizing EA events should be enough to justify the inclusion of this skillset.</p>\n<h3>Recruiting</h3>\n<p>A good recruiter&#x2019;s job is basically to build strong networks of awesome people. Given the current insularity and mediocre networking abilities of the EA movement (and most groups of people in general), it seems like an incredibly underrated skillset.</p>\n<h3>Sales</h3>\n<p>One of the biggest cheap wins that Harvard Effective Altruism ever got was when I read something <a href=\"http://www.nickbeckstead.com/\">Nick Beckstead</a> wrote about doing sales and invented a new <a href=\"http://www.thelifeyoucansave.org/Giving-Games\">Giving Game</a> pitch based on it. You can read about it <a href=\"http://www.benkuhn.net/embarrassed\">here</a>&#x2014;it practically quadrupled the number of email-list signups we got. The point is, HEA members had trouble even with basic sales moves like &#x201C;don&#x2019;t be super awkward about it,&#x201D; and upping our game there was incredibly helpful.</p>\n<h3>Marketing</h3>\n<p>I know of one marketer who hangs around the EA movement. He has <a href=\"http://a-nice-place-to-live.blogspot.com/\">one of the more interesting EA blogs</a>. He probably has a lot of other interesting things to say, but I don&#x2019;t really know because <em>I have no idea how marketing works</em>. I feel like this is probably true of a lot of this post&#x2019;s audience.</p>\n<h3>Promoting</h3>\n<p>As a promoter, you basically get paid to make places look like attractive places to be. That seems like a pretty useful/generally cool skill. For instance, <a href=\"https://en.wikipedia.org/wiki/Charity:_Water\">the guy who runs charity: water</a> was originally a club promoter.</p>\n<h2>Influencing money</h2>\n<p>It&#x2019;s pretty obvious that jobs where one can influence a lot of money have the potential to do a lot of good.</p>\n<h3>Venture capital</h3>\n<p>A lot of venture capital seems to be deployed towards pretty dumb things and in a pretty dumb way. If you can shift some capital towards investments that are more likely to have a good impact on the world, you could potentially be responsible for a huge amount of impact. A thought leader in venture capital could do even more good by influencing what kind of companies people start even without investing in them.</p>\n<p>I haven&#x2019;t worked very closely with VCs, so I&#x2019;m not sure how easy it is to become influential in the field&#x2014;my impression is that since it&#x2019;s prestigious there are a lot of associates who basically don&#x2019;t have any input on investment decisions and just do a lot of grunt work. So it may be hard to break in. That said, it seems worth thinking about.</p>\n<h3>Grantmaking</h3>\n<p>A GiveWell conversation had this to observe about NIH grants:</p>\n<blockquote>\n<p>Grant reviewers at NIH tend to fund similar projects year after year, and NIH&#x2019;s grant system is often biased toward those researchers who have become savvy about applying for funding through NIH. Moreover, since 1991, NIH&#x2019;s grant applications no longer require information about researchers&#x2019; existing resources. Previously, it was possible to evaluate researchers&#x2019; productivity as a factor of their funding, but now the researchers with the most existing funding appear to be the most productive and so are more likely to receive additional funding. A better mechanism is needed to remove biases in the grant system and reduce the size of some grants. A start has been made: a few NIH agencies, such as the National Cancer Institute (NCI), require an extra review when researchers being recommended for more funding already receive more than $1M a year from NIH.</p>\n</blockquote>\n<p>&#x2014; <a href=\"http://files.givewell.org/files/conversations/Alberts%201-29-14%20(public).pdf\">source</a></p>\n<h3>Wealth management</h3>\n<p>Wealth management seems to have a similar problem to venture capital where a lot of the money is pretty dumb. (I&#x2019;m basing this on what I hear from Theorem&#x2019;s sales team talking to wealth managers.)</p>\n<p>The bad news is that this means that being smart probably isn&#x2019;t a big competitive edge. The good news is that if you <em>do</em> manage to compete successfully on whatever dimensions wealth managers compete on (connections? fancy clothes?), you can probably do much more interesting things with the money than other people do.</p>\n<h2>Influencing politics</h2>\n<p>Public policy is also a subject of some EA exploration, but I think people aren&#x2019;t aware of many careers outside <a href=\"/TODO\">elected party politics</a> which made it onto 80k&#x2019;s website. But policy is another great tool of leverage. This area seems under-explored compared to influencing money, probably again due to demographics of the EA movement.</p>\n<h3>Lobbying</h3>\n<p><a href=\"http://www.nybooks.com/articles/archives/2012/mar/22/our-corrupt-politics-its-not-all-money/?pagination=false\">Lawrence Lessig on lobbying</a>:</p>\n<blockquote>\n<p>The lobbyist today is ethical, and well educated. He or she works extremely hard to live within the letter of the law. More than ever before, most lobbyists are just well-paid policy wonks, expert in a field and able to advise and guide Congress well. Regulation is complex; regulators understand very little; the lobbyist is the essential link between what the regulator wants to do and how it can get done&#x2026;. Most of it is decent, aboveboard, the sort of stuff we would hope happens inside the Beltway.</p>\n</blockquote>\n<p>Sign me up!</p>\n<h3>Regulation</h3>\n<p>Elected party politics is one way to get a lot of leverage, but non-elected officials also have considerable power to do altruistic good. This seems especially important in light of the huge problems with <a href=\"https://en.wikipedia.org/wiki/Regulatory_capture\">regulatory capture</a> in many agencies; it seems likely that you could do a lot of good simply by being a regulator who is more resistant to capture than most.</p>\n<h3>Think-tank work</h3>\n<p>Lots of think tanks publish research that ends up being used in policy reform. My impression from <a href=\"http://files.givewell.org/files/conversations/Teles%206-12-13%20%28public%29.pdf\">this GiveWell conversation with Steve Teles</a> is that think tanks&#x2019; research on any particular problem may be very effectiveness-driven, they don&#x2019;t often explicitly seek out high-leverage areas to do research in, so some EA-style priority-setting could be quite influential.</p>\n<h2>Influencing people</h2>\n<p>People are another leverage point that seems relatively neglected by the current EA movement compared to money or even policy influence. Here are some ideas in that department.</p>\n<h3>Mainstream career advising</h3>\n<p>I think that 80,000 Hours wants to get their career counselors into colleges at some point, but you don&#x2019;t have to wait for them to do this! Most colleges already have career-advising offices that might benefit from the EA perspective. (Caveat: I&#x2019;m not sure how much they give students substantial career advice compared to, e.g., resume proofreading; you&#x2019;d obviously want to look for positions that would be heavy on the former and light on the latter.)</p>\n<h3>Life coaching</h3>\n<p>My impression is that many people get interested in the effective altruism movement for similar reasons that people look for life coaching (wanting a sense of purpose/goals/motivation). So as a life coach you might have the chance to pique a lot of people&#x2019;s interest in effective altruism.</p>\n<h3>Religious/pseudo-religious leadership</h3>\n<p>I suspect this is underrated right now because the EA community is fairly atheist-heavy, but Harvard Effective Altruism has always gotten a great response to EA ideas from religious service groups. Even for atheists you could become a pseudo-religious leader like <a href=\"http://harvardhumanist.org/greg-epstein/\">Greg Epstein</a>. Again, this is a natural place that could benefit from the EA perspective since people are already looking for ways to improve the world.</p>\n<h3>Teaching</h3>\n<p>Not very many teachers end up being huge influences on their students down the road, but the ones that do seem to influence lots of their students very strongly. Being this kind of teacher could result in a lot of kids being more interested in improving the world than they otherwise would be.</p>\n<h3>Running a summer camp (or other extracurricular)</h3>\n<p>When I was young I was pretty strongly influenced by the summer camps I went to. This seems a lot like teaching, except lower-commitment and with more influence relative to the amount of time you spend doing it.</p>\n<h3>Writing</h3>\n<p>There are a number of examples here already: Peter Singer, Larissa MacFarquhar, Will MacAskill, Scott Alexander. Obviously it&#x2019;s very tough to be as influential as these folks, but the payoff is enormous. I know plenty of people who have gotten interested in effective altruism through essays like Scott&#x2019;s <a href=\"http://lesswrong.com/lw/3gj/efficient_charity_do_unto_others/\"><em>Efficient Charity: Do Unto Others&#x2026;</em></a>. In fact, I even know of a few people who got interested through my own blog&#x2014;so there may be good payoffs from writing even as a side thing and even if you&#x2019;re nowhere near the level of Scott Alexander.</p>\n<h2>Generic leverage</h2>\n<p>There are a bunch of other things I thought of that give you a lot of altruistic leverage without fitting into one of the above categories. So, rounding out the list:</p>\n<h3>Developing-world entrepreneurship</h3>\n<p>It&#x2019;s been <a href=\"http://www.nber.org/papers/w10433\">estimated</a> that American entrepreneurs capture on the order of 1% of the value they create. In the developing world, a dollar of social value is worth about 100 times as much as in the US (for instance, in the developing world a good program can achieve $5,000 per life saved, whereas in the US $500,000 per life saved would be extraordinary). A back-of-the-envelope calculation based on these ratios suggests that a startup in the US would have to be worth about 50 times as much to have the same impact as one in the developing world. This calculation is obviously not definitive, but it&#x2019;s suggestive that the idea of developing-world entrepreneurship has potential.</p>\n<h3>Data science</h3>\n<p>I stole this one wholesale from <a href=\"http://www.bayesimpact.org/\">Bayes Impact</a>. Basically, it seems like there are a lot of places where data science has the potential to do a lot of good but those improvements are hard to capture (government and healthcare leap out). Hence a motivated altruist could make a lot of improvements.</p>\n<h3>Consulting for nonprofits</h3>\n<p>GiveWell has observed that many nonprofits don&#x2019;t keep careful enough track of the results of their programs to even know how well they&#x2019;re doing. And even for charities that do collect data, they can <a href=\"http://www.jefftk.com/p/saving-lives-for-seven-cents-each\">interpret the results in a bogus way</a>. Even if a charity&#x2019;s intervention isn&#x2019;t effective enough to compete with GiveWell&#x2019;s top charities, if you can make it more effective you can do a lot of good, especially if the charity is large.</p>\n<h3>Technology in academia</h3>\n<p>Hat tip to Dario Amodei for this one. My impression from talking to academics in e.g. biology is that this area is <em>seriously</em> under-resourced. Lots of research is held back by shoddy software but there aren&#x2019;t many people with the skills to fix it, and it&#x2019;s not sexy enough to attract the attention of many funders.</p>\n<h2>Generally solid jobs</h2>\n<p>There are a number of jobs that aren&#x2019;t as &#x201C;sexy&#x201D; as typical EA picks (that is, they&#x2019;re not incredibly strong on any one dimension), but are generally solid, pay fairly well, aren&#x2019;t super competitive or difficult to break into, and have fairly robust demand.</p>\n<p>I&#x2019;m going off of fairly weak impressions when I list these, so I&#x2019;m just going to list them instead of writing paragraphs. But I think this category is worthy of a lot more consideration than it gets right now.</p>\n<ul>\n<li>Nursing</li>\n<li>Pharmacy</li>\n<li>Physical therapy</li>\n<li>Elder care</li>\n<li>Skilled trades</li>\n<li>Accounting</li>\n<li>Actuarial science</li>\n</ul>\n</div></body></html>", "user": {"username": "Ben_Kuhn"}}, {"_id": "a8qYJ5Re75Mo7zoMC", "title": "Effective Altruism Blogs", "postedAt": "2014-11-28T17:26:05.861Z", "htmlBody": "<p><i>Added January 2015: As I no longer have time to keep both posts updated, all further updates will be made to the version of this post hosted </i><a href=\"http://www.stafforini.com/blog/effective-altruism-blogs/\"><i>on my personal blog</i></a><i>; the version here is now archived and won't be updated.</i></p><p><i><strong>Added January 2017: The list has now become </strong></i><a href=\"http://eablogs.net/\"><i><strong>eablogs.net</strong></i></a><i><strong>—check it out!</strong></i></p><p><i><strong>Added April 2022: Now moved to </strong></i><a href=\"http://ea.news/\"><i><strong>ea.news</strong></i></a><i><strong>.</strong></i></p><p>What follows is a list of blogs of potential interest to effective altruists. I tried to include all blogs that either feature EA content on a regular basis or are officially linked to an existing EA organization. If you think I'm missing something, please let me know.</p><p><i>&nbsp;</i></p><h2>Organizations</h2><ul><li><a href=\"http://80000hours.org/blog\">80,000 Hours</a></li><li><a href=\"http://www.animalcharityevaluators.org/blog/\">Animal Charity Evaluators</a></li><li><a href=\"http://rationality.org/blog/\">Center for Applied Rationality</a></li><li><a href=\"http://www.charityscience.com/blog\">Charity Science</a></li><li><a href=\"http://blog.givewell.org/\">GiveWell</a></li><li><a href=\"http://www.givingwhatwecan.org/blog\">Giving What We Can</a></li><li><a href=\"http://www.goodventures.org/research-and-ideas/blog\">Good Ventures</a></li><li><a href=\"http://harvardea.org/blog/\">Harvard College Effective Altruism</a></li><li><a href=\"http://a-nice-place-to-live.blogspot.ca/\">Machine Intelligence Research Institute</a></li><li><a href=\"http://reg-charity.org/blog/\">Raising for Effective Giving</a></li><li><a href=\"http://www.thelifeyoucansave.org/StayInformed/Blog.aspx\">The Life You Can Save</a></li></ul><h2>Individuals</h2><ul><li><a href=\"http://slatestarcodex.com/\">Scott Alexander</a> (Slate Star Codex)</li><li><a href=\"http://thebestwecan.org/\">Jacy Anthis</a> (The Best We Can)</li><li><a href=\"http://tog22.tumblr.com/tagged/effective-altruism\">Tom Ash</a></li><li><a href=\"http://a-nice-place-to-live.blogspot.ca/\">Michael Bitton</a> (A Nice Place to Live)</li><li><a href=\"http://careyryan.com/\">Ryan Carey</a></li><li><a href=\"http://rationalaltruist.com/\">Paul Christiano</a>&nbsp;(Rational Altruist)</li><li><a href=\"https://effectivereaction.wordpress.com/\">Dale</a> (Effective Differentials)</li><li><a href=\"https://ozziesblog.hackpad.com/\">Ozzie Gooen</a></li><li><a href=\"http://meteuphoric.wordpress.com/\">Katja Grace</a>&nbsp;(Meteuphoric)</li><li><a href=\"http://www.patheos.com/blogs/hallq/\">Christ Hallquist</a>&nbsp;(The Uncredible Hallq)</li><li><a href=\"http://www.overcomingbias.com/\">Robin Hanson</a>&nbsp;(Overcoming Bias)</li><li><a href=\"http://roxanneheston.com/\">Roxanne Heston</a></li><li><a href=\"http://www.jefftk.com/news/giving\">Jeff Kaufman</a></li><li><a href=\"http://www.benkuhn.net/tag/effective-altruism/1/\">Ben Kuhn</a></li><li><a href=\"http://www.thepolemicalmedic.com/\">Greg Lewis</a> (The Polemical Medic)</li><li><a href=\"http://closetomyhead.com/\">Catriona Mackay</a>&nbsp;(A Cause Close to My Head)</li><li><a href=\"http://lukemuehlhauser.com/\">Luke Muehlhauser</a></li><li><a href=\"http://reflectivedisequilibrium.blogspot.com\">Carl Shulman</a>&nbsp;(Reflective Disequilibrium)</li><li><a href=\"http://jonahsinick.com/blog-posts/\">Jonah Sinick</a></li><li><a href=\"http://jesswhittlestone.com/\">Jess Whittlestone</a></li><li><a href=\"http://robertwiblin.com/\">Robert Wiblin</a></li><li><a href=\"http://www.givinggladly.com/\">Julia Wise</a>&nbsp;(Giving Gladly)</li></ul><p><i>Crossposted to </i><a href=\"http://www.stafforini.com/blog/effective-altruism-blogs/\"><i>my blog</i></a></p>", "user": {"username": "Pablo_Stafforini"}}, {"_id": "gPGFXNLLWjmScqxPo", "title": "Meetup : EA Madison: Giving Games", "postedAt": "2014-11-28T14:13:35.453Z", "htmlBody": "<html><body><h2>Discussion article for the meetup : <a href=\"/meetups/1n\">EA Madison: Giving Games</a></h2>\n\t\t  <div>\n\t\t\t\t<p>\n\t\t    \t<strong>WHEN:</strong> \n\t\t    \t<span>06 December 2014 03:00:00PM (-0600)</span><br>\n\t\t\t\t</p>\n\t\t\t\t<p>\n\t\t    \t<strong>WHERE:</strong> \n\t\t    \t<span>Epic, 5301 Tokay Blvd, Madison, WI</span>\n\t\t\t\t</p>\n\t\t  </div><!-- .meta -->\n\t\t  <div>\n\t\t    <div><p>Giving Game!</p>\n\n<p>A giving game is a way to get experience thinking critically about charities, comparing cost-effectiveness, pros/cons, etc. We&apos;ll pick a few charities to evaluate, then we&apos;ll vote on which is doing the most good, and allocate money towards that one. (It&apos;s not as much about the money as the process; we&apos;ll either each throw a dollar into the pool, or I&apos;ll obtain funding from The Life You Can Save or somewhere else (working on that now)). We&apos;ll be comparing environmental charities, not b/c those are necessarily the most effective, but just so that it&apos;s easy to compare one to the other (instead of comparing across causes).</p>\n\n<p>Hope you can join us!</p></div>\n\t\t  </div><!-- .content -->\n\t\t<h2>Discussion article for the meetup : <a href=\"/meetups/1n\">EA Madison: Giving Games</a></h2></body></html>", "user": {"username": "Gina_Stuessy"}}, {"_id": "MH9suFZbxXCYsr5Z5", "title": "You have a set amount of \"weirdness points\". Spend them wisely.", "postedAt": "2014-11-27T21:08:36.573Z", "htmlBody": "<html><body><p><em>I&apos;ve heard of the concept of &quot;weirdness points&quot; many times before, but after a bit of searching I can&apos;t find a definitive post describing the concept, so I&apos;ve decided to make one. &#xA0;As a disclaimer, I don&apos;t think the evidence backing this post is all that strong and I am skeptical, but I do think it&apos;s strong enough to be worth considering, and I&apos;m probably going to make some minor life changes based on it.</em></p>\n<p>-</p>\n<p>Chances are that if you&apos;re reading this post, you&apos;re probably a bit weird in some way.</p>\n<p>No offense, of course. &#xA0;In fact, I actually mean it as a compliment. &#xA0;Weirdness is <em>incredibly important</em>. &#xA0;If people weren&apos;t willing to deviate from society and hold weird beliefs, we wouldn&apos;t have had the important social movements that ended slavery and pushed back against racism, that created democracy, that expanded social roles for women, and that made the world a better place in numerous other ways.</p>\n<p>Many things we take for granted now as why our current society as great were once...&#xA0;<em>weird</em>.</p>\n<p>&#xA0;</p>\n<p>Joseph Overton theorized that&#xA0;<a href=\"http://en.wikipedia.org/wiki/Overton_window\">policy develops through six stages</a>:&#xA0;<em>unthinkable</em>, then&#xA0;<em>radical</em>, then&#xA0;<em>acceptable</em>, then<em>&#xA0;sensible</em>, then&#xA0;<em>popular</em>, then&#xA0;<em>actual policy.</em>&#xA0;&#xA0;We could see this happen with many policies -- currently same-sex marriage is making its way from popular to actual policy, but not to long ago it was merely acceptable, and not too long before that it was pretty radical.</p>\n<p>Some good ideas are currently in the <em>radical</em><em>&#xA0;</em>range.&#xA0; Effective altruism itself is such a collection of beliefs typical people would consider pretty radical. &#xA0;Many people think donating 3% of their income is a lot, let alone the 10% demand that Giving What We Can places, or the 50%+ that some people in the community do.</p>\n<p>And that&apos;s not all. &#xA0;Others would suggest that <a href=\"http://lesswrong.com/lw/i3s/why_eat_less_meat/\">everyone become vegetarian</a>, advocating for <a href=\"http://www.openborders.info\">open borders</a> and/or <a href=\"http://slatestarcodex.com/2013/12/08/a-something-sort-of-like-left-libertarianism-ist-manifesto/\">universal basic income</a>, the <a href=\"http://www.cs.virginia.edu/~evans/cs655/readings/purity.html\">abolishment of gendered language</a>, having more resources into <a href=\"http://www.nickbostrom.com/existential/risks.html\">mitigating existential risk</a>, <a href=\"http://intelligence.org/smarter-than-us/\">focusing on research into Friendly AI</a>, <a href=\"http://www.overcomingbias.com/2008/12/we-agree-get-froze.html\">cryonics</a> and <a href=\"http://www.calicolabs.com/\">curing death</a>, etc.</p>\n<p>While many of these ideas might make the world a better place if made into policy, all of these ideas are pretty <em>weird</em>.</p>\n<p>&#xA0;</p>\n<p>Weirdness, of course, is a drawback. &#xA0;People take weird opinions less seriously.</p>\n<p><a href=\"http://lesswrong.com/lw/j4/absurdity_heuristic_absurdity_bias/\">The absurdity heuristic</a> is a real bias that people -- even you -- have. &#xA0;If an idea sounds <em>weird </em>to you, you&apos;re less likely to try and believe it, <a href=\"http://lesswrong.com/lw/2d/talking_snakes_a_cautionary_tale/\">even if there&apos;s overwhelming evidence</a>. &#xA0;And <a href=\"http://en.wikipedia.org/wiki/Social_proof\">social proof</a> matters -- if less people believe something, people will be less likely to believe it. &#xA0;Lastly, don&apos;t forget&#xA0;<a href=\"http://en.wikipedia.org/wiki/Halo_effect\">the halo effect</a> -- if one part of you seems weird, the rest of you will seem weird too!</p>\n<p>(<strong>Update:&#xA0;</strong>apparently this concept is, itself, already known to social psychology as&#xA0;<a href=\"https://en.wikipedia.org/wiki/Idiosyncrasy_credit\">idiosyncrasy credits</a>. &#xA0;Thanks,&#xA0;<a href=\"/lw/lbn/you_have_a_set_amount_of_weirdness_points_spend/bogz?context=3\">Mr. Commenter</a>!)</p>\n<p>...But we can use this knowledge to our advantage. &#xA0;The halo effect can work in reverse -- if we&apos;re normal in many ways, our weird beliefs will seem more normal too. &#xA0;If we have a notion of weirdness as a kind of currency that we have a limited supply of, we can spend it wisely, without looking like a crank.</p>\n<p>&#xA0;</p>\n<p>All of this leads to the following actionable principles:</p>\n<p><strong>Recognize you only have a few &quot;weirdness points&quot; to spend. &#xA0;</strong>Trying to convince all your friends to donate 50% of their income to MIRI, become a vegan, get a cryonics plan, and demand open borders will be met with a lot of resistance. &#xA0; But -- I hypothesize -- that if you pick one of these ideas and push it, you&apos;ll have a lot more success.</p>\n<p><strong>Spend your weirdness points effectively. &#xA0;</strong>Perhaps it&apos;s really important that people advocate for open borders. &#xA0;But, perhaps, getting people to donate to developing world health would overall do more good. &#xA0;In that case, I&apos;d focus on moving donations to the developing world and leave open borders alone, even though it is really important. &#xA0;You should triage your weirdness effectively the same way you would triage your donations.</p>\n<p><strong>Clean up and look good. &#xA0;</strong>Lookism is a problem in society, and I wish people could look &quot;weird&quot; and still be socially acceptable. &#xA0;But if you&apos;re a guy wearing a dress in public, or some punk rocker vegan advocate, recognize that you&apos;re spending your weirdness points fighting lookism, which means less weirdness points to spend promoting veganism or something else.</p>\n<p><strong>Advocate for more &quot;normal&quot; policies that are almost as good. &#xA0; </strong>Of course, allocating your &quot;weirdness points&quot; on a few issues doesn&apos;t mean you have to stop advocating for other important issues -- just consider being less weird about it. &#xA0;Perhaps universal basic income truly would be a very effective policy to help the poor in the United States. &#xA0;But <a href=\"http://www.vox.com/2014/7/29/5946395/eitc-poverty-supplemental-measure-official-threshold\">reforming the earned income tax credit</a>&#xA0;and <a href=\"http://www.vox.com/2014/11/12/7193609/zoning-wage-stagnation\">relaxing zoning laws</a>&#xA0;would also both do a lot to help the poor in the US, and such suggestions aren&apos;t weird.</p>\n<p><strong>Use the foot-in-door technique and the door-in-face technique. &#xA0;</strong>The <a href=\"http://en.wikipedia.org/wiki/Foot-in-the-door_technique\">foot-in-door technique</a> involves starting with a small ask and gradually building up the ask, such as suggesting people donate a little bit effectively, and then gradually get them to take the Giving What We Can Pledge. &#xA0;The <a href=\"http://en.wikipedia.org/wiki/Door-in-the-face_technique\">door-in-face technique</a> involves making a big ask (e.g., join Giving What We Can) and then substituting it for a smaller ask, like the Life You Can Save pledge or Try Out Giving.</p>\n<p><strong>Reconsider effective altruism&apos;s clustering of beliefs. &#xA0;</strong>Right now, effective altruism is associated strongly with donating a lot of money and donating effectively, less strongly with impact in career choice, veganism, and existential risk. &#xA0;Of course, I&apos;m not saying that we should drop some of these memes completely. &#xA0;But maybe EA should disconnect a bit more and compartmentalize -- for example, leaving AI risk to MIRI, for example, and not talk about it much, say, on 80,000 Hours. &#xA0;And maybe instead of asking people to both give more AND give more effectively, we could focus more exclusively on asking people to donate what they already do more effectively.</p>\n<p><strong>Evaluate the above with more research. &#xA0;</strong>While I think the evidence base behind this is decent, it&apos;s not great and I haven&apos;t spent that much time developing it. &#xA0;I think we should look into this more with a review of the relevant literature and some careful, targeted, market research on the individual beliefs within effective altruism (how weird are they?) and how they should be connected or left disconnected. &#xA0;Maybe this has already been done some?</p>\n<p>-</p>\n<p><em>Also <a href=\"http://lesswrong.com/lw/lbn/you_have_a_set_amount_of_weirdness_points_spend/\">discussed on LessWrong</a> and on <a href=\"https://www.facebook.com/groups/effective.altruists/780842221972137\">the EA Facebook group</a>.</em></p></body></html>", "user": {"username": "Peter_Hurford"}}, {"_id": "frJPjswnu2X66Bdg3", "title": "Tell us about your recent EA activities: thread 2", "postedAt": "2014-11-27T14:37:51.671Z", "htmlBody": "<html><body><p>To quote Kaj_Sotala&apos;s <a href=\"/ea/9g/tell_us_about_your_recent_ea_activities/\">original thread</a>:</p>\n<p>We have plenty of effective altruists around the world, each doing something to make the world a better place. If we all work separately and don&apos;t report of our work, most of our efforts will go unnoticed by others in the community, who could otherwise provide encouragement or suggestions, or be inspired by our work.</p>\n<p><strong>If you&apos;ve recently carried out some effective altruist activity, come here and let us know about it.</strong></p></body></html>", "user": {"username": "Vincent_deB"}}, {"_id": "Ro9Z4gFD9SC3teSkD", "title": "The Centre for Effective Altruism is hiring to fill five roles in research, operations and outreach", "postedAt": "2014-11-25T13:48:36.283Z", "htmlBody": "<html><body><p>The&#xA0;<a href=\"https://centreforeffectivealtruism.org/careers/\">Centre for Effective Altruism</a>, the group behind&#xA0;<a href=\"https://80000hours.org/\">80,000 Hours</a>,&#xA0;<a href=\"http://www.givingwhatwecan.org/\">Giving What We Can</a>, the&#xA0;<a href=\"http://www.fhi.ox.ac.uk/research/global-priorities-project/\">Global Priorities Project</a>, Effective Altruism Outreach, and to a lesser extent&#xA0;<a href=\"http://www.thelifeyoucansave.org/\">The Life You Can Save</a>&#xA0;and&#xA0;<a href=\"http://www.animalcharityevaluators.org/\">Animal Charity Evaluators</a>, is looking to grow its team with a number of new roles:</p>\n<ul>\n<li><span><a href=\"https://centreforeffectivealtruism.org/job/director-of-research-for-giving-what-we-can/\">Giving What We Can: Director of Research</a></span></li>\n<li><span><a href=\"https://centreforeffectivealtruism.org/job/giving-what-we-can-communications-manager/\">Giving What We Can: Communications Manager</a></span></li>\n<li><span><a href=\"https://centreforeffectivealtruism.org/job/head-of-research-for-80000-hours/\">80,000 Hours: Head of Research</a></span></li>\n<li><span><a href=\"https://centreforeffectivealtruism.org/job/chief-operating-officer-for-the-centre-for-effective-altruism/\">Central CEA: Chief Operating Officer</a></span></li>\n<li><span><a href=\"https://centreforeffectivealtruism.org/job/the-global-priorities-project-is-seeking-a-research-fellow/\">Global Priorities Project: Research Fellow</a>&#xA0;(accepting expressions of interest at this point)</span></li>\n<li><span>We are also looking for&#xA0;<a href=\"https://www.givingwhatwecan.org/get-involved/volunteer-or-work-us\">&apos;graduate volunteers&apos; for Giving What We Can</a>&#xA0;in 2015, particularly over the summer</span></li>\n</ul>\n<p><span>We are so keen to find great people that&#xA0;<em>if you introduce us to someone new who we end up hiring, we will pay you $1,000 for the favour</em>! If you know anyone awesome who would be a good fit for us please let me know: robert [dot] wiblin [at] centreforeffectivealtruism [dot] org. They can also&#xA0;<a href=\"https://calendly.com/robertwiblin\">book a short meeting with me directly</a>.</span></p>\n<p><span>We may be able to sponsor outstanding applicants from the USA.</span></p>\n<p><span>Applications close Friday 5th December 2014.</span></p>\n<p><strong>Why is CEA an excellent place to work?</strong>&#xA0;</p>\n<p>First and foremost, &#x201C;making the world a better place&#x201D; is our bottom line and central aim. We work on the projects we do because we think they&#x2019;re the best way for us to make a contribution.&#xA0;<a href=\"http://www.centreforeffectivealtruism.org/careers/why-work-with-us\">But there&#x2019;s more.</a></p>\n<p><a href=\"http://www.centreforeffectivealtruism.org/careers/why-work-with-us\"></a><strong>What are we looking for?</strong></p>\n<p><strong></strong>The specifics of what we are looking for depend on the role and details can be found in the job descriptions. In general, we&apos;re looking for people who have many of the following traits:</p>\n<ul>\n<li>Self-motivated, hard-working, and independent;</li>\n<li>Able to deal with pressure and unfamiliar problems;</li>\n<li>Have a strong desire for personal development;</li>\n<li>Able to quickly master complex, abstract ideas, and solve problems;</li>\n<li>Able to communicate clearly and persuasively in writing and in person;</li>\n<li>Comfortable working in a team and quick to get on with new people;</li>\n<li>Able to lead a team and manage a complex project;</li>\n<li>Keen to work with a young team in a startup environment;</li>\n<li>Deeply interested in making the world a better place in an effective way, using evidence and research;</li>\n<li>A good understanding of the aims of the Centre for Effective Altruism and its constituent organisations.</li>\n</ul>\n<p><strong>I hope to work at CEA in the future. What should I do now?</strong></p>\n<p><strong></strong>Of course this will depend on the role, but generally good ideas include:</p>\n<ul>\n<li>Study hard, including gaining useful knowledge and skills outside of the classroom.</li>\n<li>Degrees we have found provide useful training include: philosophy, statistics, economics, mathematics and physics. However, we are hoping to hire people from a more diverse range of academic and practical backgrounds in the future. In particular, we hope to find new members of the team who have worked in operations, or creative industries.</li>\n<li>Write regularly and consider starting a blog.</li>\n<li>Manage student and workplace clubs or societies.</li>\n<li>Work on exciting projects in your spare time.</li>\n<li>Found a start-up business or non-profit, or join someone else early in the life of a new project.</li>\n<li>Gain impressive professional experience in established organisations, such as those working in consulting, government, politics, advocacy, law, think-tanks, movement building, journalism, etc.</li>\n<li>Get experience promoting effective altruist ideas online, or to people you already know.</li>\n<li>Use&#xA0;<a href=\"https://80000hours.org/\">80,000 Hours&apos; research</a>&#xA0;to do a detailed analysis of your own future career plans.</li>\n</ul></body></html>", "user": {"username": "Robert_Wiblin"}}, {"_id": "6GHCqkzLmZz5SWmWJ", "title": "Meetup : An Introduction to Effective Altruism", "postedAt": "2014-11-25T12:13:03.754Z", "htmlBody": "<html><body><h2>Discussion article for the meetup : <a href=\"/meetups/1m\">An Introduction to Effective Altruism</a></h2>\n\t\t  <div>\n\t\t\t\t<p>\n\t\t    \t<strong>WHEN:</strong> \n\t\t    \t<span>04 December 2014 05:00:00PM (+0000)</span><br>\n\t\t\t\t</p>\n\t\t\t\t<p>\n\t\t    \t<strong>WHERE:</strong> \n\t\t    \t<span>Queen&apos;s Building, University of Bristol</span>\n\t\t\t\t</p>\n\t\t  </div><!-- .meta -->\n\t\t  <div>\n\t\t    <div><p>Come along to our first <a href=\"https://www.facebook.com/events/311445649050828/\">speaker event</a>!</p>\n\n<p>Jonathan Courtney, Giving What We Can&apos;s community director will be giving a talk addressing questions such as:</p>\n\n<p>Why give money to charity?\nIs there such a thing as a bad charity?\nCan I really make a difference?</p>\n\n<p>The speaker event will be from 5-6pm with a Q &amp; A session after and then we shall smoothly transition to a pub for more of a social and informal chat.</p>\n\n<p>Hope to see you there!</p></div>\n\t\t  </div><!-- .content -->\n\t\t<h2>Discussion article for the meetup : <a href=\"/meetups/1m\">An Introduction to Effective Altruism</a></h2></body></html>", "user": {"username": "DanielMay"}}, {"_id": "kF5KGRKTfbXzsbtRR", "title": "Upcoming Meetups 5", "postedAt": "2014-11-24T21:02:07.631Z", "htmlBody": "<html><body><p><span>Meetups coming up this fortnight are:</span></p>\n<li><a href=\"https://www.facebook.com/events/1551854215049296/?fref=ts\">London Effective Altruism House-warming</a><span>&#xA0;</span><span>29 Nov 2014 20:00</span></li>\n<li><a href=\"/meetups/1j\">La Place, Utrecht, Rijnkade 5</a>&#xA0;<span>30 Nov 2014 14:00</span></li>\n<li><span><a href=\"https://www.facebook.com/groups/THINKMelbourne/?fref=ts\">Sunday Assembly Melbourne</a>, Doing Good Better presentation 30 Nov 2014 11:00</span></li>\n<div>\n<li><a href=\"/meetups/1m\">Queen&apos;s Building, University of Bristol</a><span>&#xA0;</span><span>04 Dec 2014 17:00</span></li>\n</div>\n<li><a href=\"/meetups/1d\">La Place, Utrecht, Rijnkade 5</a>&#xA0;<span>07 Dec 2014 14:00</span></li>\n<li><a href=\"/meetups/1g\">Dot Impact</a>&apos;s monthly meetup&#xA0;<span>07 Dec 2014 22:00</span></li></body></html>", "user": {"username": "RyanCarey"}}, {"_id": "tPtY46ucbnMfNJjFE", "title": "Expected value estimates you can take (somewhat) literally", "postedAt": "2014-11-24T15:55:29.144Z", "htmlBody": "<html><body><h1>Summary</h1>\n<p>A geometric interpretation of tail divergence offers a pseudo-robust mechanism of quantifying the expected &apos;regression to the mean&apos; of a cost effectiveness estimate (i.e. expected value&#xA0;<em>given</em>&#xA0;estimated value). With caveats, this seems to be superior to current attempts at guestimation and &apos;calling the bottom&apos; of anticipated regression to the mean. There are a few pleasing corollaries: 1) it vindicates a &apos;regressive mindset&apos; (particularly championed by Givewell), and underscores the value of performing research to achieve more accurate estimation; 2) it suggests (and provides a framework for quantification for) how much an estimated expected value should be discounted by how speculative it is; 3) it suggests empirical approaches one can use to better quantify degree of regression, using variance in expected-value estimates.</p>\n<p>[Cross-posted <a href=\"http://www.thepolemicalmedic.com/2014/11/expected-value-estimates-you-can-take-somewhat-literally/\">here</a>. I&apos;m deeply uncertain about this, and wonder if this is an over-long elaboration on a very simple error. If so, please show me!]</p>\n<h1>Introduction</h1>\n<p>Estimates of expected value regress to the mean - something that seems much more valuable than average will generally look not-quite-so-valuable when one has a better look. This problem is particularly acute for effective altruism and its focus on the highest expected value causes, as these are likely to regress the most. Quantifying how much one expects an estimate to regress is not straightforward, and this has in part lead to groups like&#xA0;<a href=\"http://blog.givewell.org/2011/08/18/why-we-cant-take-expected-value-estimates-literally-even-when-theyre-unbiased/\">Givewell warning against explicit expected value estimates</a>. More robust estimation has obvious value, especially when comparing between diverse cause areas, but worries about significant and differential over-estimation make these enterprises highly speculative.</p>\n<p>&apos;In practice&apos;, I have seen people offer discounts to try and account for this effect (e.g. &quot;Givewell think AMF averts a DALY for $45-ish, so lets say it&apos;s $60 to try and account for this&quot;), or mention it as a caveat without quantification. It remains very hard to get an intuitive handle on how big one should expect this effect to be, especially when looking at different causes: one might expect more speculative causes in fields like animal welfare or global catastrophic risks to &apos;regress more&apos; than relatively well-studied ones in public health, but how much more?</p>\n<p>I am unaware of any previous attempts to directly quantify this effect. I hope this essay can make some headway on this issue, and thus allow more trustworthy expected value estimates.<a></a></p>\n<h1>A geometric explanation of regression to the mean</h1>\n<p>(A related post&#xA0;<a href=\"http://lesswrong.com/lw/km6/why_the_tails_come_apart/\">here</a>)</p>\n<p>Why is there regression to the mean for expected value calculations? For a toy model, pretend there are some well-behaved normally distributed estimates of expected value, and the estimation technique that it captures 90% of the variance in expected value. A stylized scatter plot might look something like this, with a fairly tight ellipse covering the points.</p>\n<p><a href=\"http://www.thepolemicalmedic.com/wp-content/uploads/2014/11/actualexpected.png\"><img src=\"http://www.thepolemicalmedic.com/wp-content/uploads/2014/11/actualexpected.png\" alt=\"actualexpected\"></a></p>\n<p>Despite the estimates of expected value being closely correlated to the actual expected values, there remains some scatter, and so the tails come apart: the estimated-to-be highest expected value things are unlikely to have the highest actual expected value (although it should still be pretty high). The better the estimate, the tighter the correlation, and therefore the tails diverge less:</p>\n<p><a href=\"http://www.thepolemicalmedic.com/wp-content/uploads/2014/11/estimateregression.png\"><img src=\"http://www.thepolemicalmedic.com/wp-content/uploads/2014/11/estimateregression.png\" alt=\"estimateregression\"></a></p>\n<p>Another way of representing what is going on is using two vectors instead of Cartesian coordinates. If the set of estimates and actual expected values were plotted as vectors in n-dimensional space (normalized to a mean of zero), the cosine between them would be equal to the r-squared of their correlation. [1] &#xA0;So our estimates correlated to the actual cost effectiveness values with an r-square of 0.9 looks like this:</p>\n<p><a href=\"http://www.thepolemicalmedic.com/wp-content/uploads/2014/11/angles2.png\"><img src=\"http://www.thepolemicalmedic.com/wp-content/uploads/2014/11/angles2.png\" alt=\"angles2\"></a></p>\n<p>The two vectors lie in a similar direction to one another, as the arccos of 0.9 is ~26 degrees, (in accord with intuition, an r-square of 1 - perfect correlation - leads to vectors parallel, an r-square of zero vectors orthogonal, and and r-square of -1 vectors antiparallel). It also supplies a way to see how one can estimate the &apos;real&apos; expected value given an estimated expected value - just project the expected value vector onto the &apos;actual&apos; value vector, and the rest is basic trigonometry: multiply the hypotenuse (the estimate) by the cosine of the angle (the r-square) to arrive at the actual value. So, in our toy model with an R-square of 0.9, an estimate which is 1SD above the mean estimate puts the expected value at 0.9SD above the mean expected value.</p>\n<p>There are further dividends to this conceptualization: it helps explain why regression to mean happens across the entire range, but it is particularly noticeable at the tails: the absolute amount of regression to the mean (taken as estimate minus actual value given estimate) grows linearly with the size of the estimate. [2] Reassuringly, it is order preserving: although E &gt; A|E if E is above the mean, A|E1 &gt; A|E2 if E1&gt;E2, and so among a set of estimates of expected value, the highest estimate has the highest expected value.</p>\n<p>Given this fairly neat way of getting from an estimate to the expected value given an estimate, can this be exploited to give estimates that &apos;pre-empt&apos; their own regression?</p>\n<h1>A quick and fairly dirty attempt at &apos;regression-proofing&apos; an estimate</h1>\n<p>A natural approach would be to try and estimate the expected value given an estimate by correcting for the correlation between the estimated expected value and the actual expected value. Although the geometry above was neat, there are several obstacles in the way of application to &apos;real&apos; cost-effectiveness estimates. In ascending order of difficulty:</p>\n<p>1) The variances of the two distributions need to be standardized.</p>\n<p><em>Less of a big deal, we we&apos;d generally hope for and aim that our estimates of expected value are drawn from a similar distribution to the actual expected values - if it&apos;s not, our estimates are systemically wrong somehow.</em></p>\n<p>2) We need to know the means of the distribution to do the standardization - after all, if an intervention was estimated to be&#xA0;<em>below</em>&#xA0;the mean, we should anticipate it to regress&#xA0;<em>upwards</em>.</p>\n<p><em>Trickier for an EA context, as the groups that do evaluation focus their efforts on what appear to be the most promising things, so there isn&apos;t a clear handle on the &apos;mean global health intervention&apos; which may be our distribution of interest. To some extent though, this problem solves itself if the underlying distributions of interest are log normal or similarly fat tailed and you are confident your estimate lies far from the mean (whatever it is): log (X - something small) approximates to log(X)</em></p>\n<p>&#xA0;3) Estimate errors should be at-least-vaguely symmetrical.</p>\n<p><em>If you expect your estimates to be systematically &apos;off&apos;, this sort of correction has limited utility. That said, perhaps this is not as burdensome as it first appears: although we should expect our estimates (especially in more speculative fields) to be prone to systematic error, this can be modelled as&#xA0;symmetrical&#xA0;error if we are genuinely uncertain of what sign the systematic error&#xA0;should be. And, if you expect your estimate to be systematically erring one way or another, why haven&apos;t you revised it accordingly?</em></p>\n<p>4) How do you know the r-square between your estimates and their true values?</p>\n<p>&#xA0;<em>Generally, these will remain hard to estimate, especially so for more speculative causes, as the true expected values will depend on recondite issues in the speculative cause itself. Further, I don&apos;t think many of us have a good &apos;handle&apos; on what an r-square = 0.9 distribution looks like compared to an r-square of 0.5, and our adjustments (especially in fat-tailed distributions) will be highly sensitive to it. However, there is scope for improvement - one can use various approaches of benchmarking (if you think your estimator has an r-square of 0.9, you could ask yourself whether you think it&#xA0;</em>really&#xA0;<em>should track 90% of the variance in expected value, and one could gain a better &apos;feel&apos; for the strength of various correlations by seeing some representative examples, and then use these to anchor an intuition about where the estimator should fall compared to these). Also, at least in cases with more estimates available, there would be pseudo-formal approaches to estimating the relevant angle between estimated and actual expected value (on which more later).</em></p>\n<p>5) What&apos;s the underlying distribution?</p>\n<p><em>Without many estimates, this is hard, and there is a risk of devolving into reference class tennis with different offers as to what underlying distributions &apos;should&apos; be (broadly, fat tailed distributions with low means &apos;hurt&apos; an estimate more, and vice-versa). This problem gets particularly acute when looking between cause areas, necessitating some shared distribution of actual expected values. I don&apos;t have any particularly good answers to offer here. Ideas welcome!</em></p>\n<p>With all these caveats duly caveated, let&apos;s have a stab at estimating the &apos;real&apos; expected value of malaria nets, given Givewell&apos;s estimate: [3]</p>\n<ol>\n<li>(One of) Givewell&apos;s old estimates for malaria nets&#xA0;<a href=\"http://www.givewell.org/files/DWDA%202009/Interventions/Nets/Cost-effectiveness%20analysis%20for%20LLIN%20distribution%20updated%20for%202013%20final.xls\">was $45 dollars per DALY averted</a>. This rate is the &apos;wrong way around&apos;, as we are interested in&#xA0;<a href=\"https://www.givingwhatwecan.org/blog/2012-12-21/the-daly-illusion-part-i-comparing-improvements\">Unit/Cost rather than Cost/Unit</a>. So convert it to something like &apos;DALYs averted per $100000&apos;:&#xA0;<strong>2222 DALYs/100000$&#xA0;</strong>[4]&#xA0;</li>\n<li>I aver (and&#xA0;<a href=\"https://www.givingwhatwecan.org/sites/givingwhatwecan.org/files/attachments/protocol.pdf\">others</a>&#xA0;<a href=\"http://givingwhatwecan.org/blog/2012-10-27/estimating-the-effectiveness-of-dcp\">agree</a>) that developing world interventions are approximately log-normally distributed, with a correspondingly fat tail to the right. [5]&#xA0;So take logs to get to normality:&#xA0;<strong>3.347</strong></li>\n<li>I think pretty highly of givewell, and so I rate their estimates pretty highly too. I think their estimation captures around 90% of the variance in actual expected value, so they correlate with an R-square of 0.9. So multiply by this factor:<strong>&#xA0;3.012</strong>.</li>\n<li>Then we do everything in reverse, so the &apos;revised&apos; expected value estimate is&#xA0;<strong>1028 DALYs/100000$</strong>, or back in the headline figure,&#xA0;<strong>$97 dollars per DALY averted</strong>.</li>\n</ol>\n<h1>Some middling reflections</h1>\n<p>Naturally, this &apos;attempt&apos; is far from rigorous, and it may take intolerable technical liberties. That said, I &apos;buy&apos; this bottom line estimate more than my previous attempts to guestimate the &apos;post regression&apos; cost effectiveness: I had previously been worried I was being too optimistic, whereas now my fears about my estimate are equal and opposite: I wouldn&apos;t be surprised if this was too optimistic, but I&apos;d be similarly unsurprised if I was too pessimistic either.</p>\n<p>It also has some salutary lessons attached: the correction turns out be&#xA0;<em>greater than a factor of two</em>, even when you think the estimate is really good. This vindicates my fear we are prone to under-estimate the risk, and how strongly regression can bite on the right of a fat-tailed distribution.</p>\n<p>The &apos;post regression&apos; estimate of expected value depends a lot on the r-square - the &apos;angle&apos; between the two vectors (e.g., if you thought Givewell were &apos;only&apos; as good as a 0.8 correlation to real effect, then the revised estimate becomes&#xA0;<strong>$210 per DALY averted</strong>). It is unfortunate to have an estimation method sensitive to a variable that is hard for us to grasp. It suggests that although our central measure for expected value may be $97/DALY, this should have wide credence bounds.</p>\n<h1>Comparing estimates of differing quality</h1>\n<p>One may be more interested not in the absolute expected value of a something, but how it compares to something else. This problem gets harder when comparing across diverse cause areas: one intuition may be that a more speculative estimate should be discounted when &apos;up against&apos; a more robust estimate when comparing two causes or two interventions. A common venue I see this is comparing interventions between human and animal welfare. A common line of argument is something like:</p>\n<blockquote>\n<p>For $1000 you might buy 20 or so QALYs, or maybe save a life (though that is optimistic) if you gave to AMF, in comparison, our best guess for an animal charity like The Humane League is it&#xA0;<a href=\"http://www.animalcharityevaluators.org/recommendations/top-charities/the-humane-league/\">might save 3400 animals from a life in agriculture</a>. Isn&apos;t that even better?</p>\n</blockquote>\n<p>Bracketing all the considerable uncertainties of the right &apos;trade off&apos; between animal and human welfare, anti- or pro-natalist concerns, trying to cash out &apos;a life in agriculture&apos; in QALY terms, etc. etc. there&apos;s an underlying worry that ACE&apos;s estimate will be more speculative than Givewell&apos;s, and so their bottom line figures should be adjusted downwards compared to Givewell&apos;s as they have &apos;further to regress&apos;. I think this is correct:</p>\n<p><a href=\"http://www.thepolemicalmedic.com/wp-content/uploads/2014/11/speculativeness.png\"><img src=\"http://www.thepolemicalmedic.com/wp-content/uploads/2014/11/speculativeness.png\" alt=\"speculativeness\"></a></p>\n<p>Suppose there&apos;s a more speculative source of expected value estimates, and you want to compare these to your current batch of higher quality expected value estimates. Say you think the speculative estimates correlate to real expected value with an r-square of 0.4 - they leave most of the variance unaccounted for. Geometrically, this means your estimates and &apos;actual&apos; value diverge quite a lot - the angle is around 66 degrees, and as a consequence you expected value given the estimate is significantly discounted. This can mean an intervention with a high (but speculative) estimate still has a lower expected value than an intervention with a lower but more reliable estimate. (Plotted above: E2 &gt; E1, but A2|E2 &lt; A1|E1)</p>\n<p>This correction wouldn&apos;t be a big deal (it&apos;s only going to be within an order of magnitude) except that we generally think the distributions are fat tailed and so these vectors are on something like a log scale. Going back to the previous case, if you thought that Animal Charity Evaluators estimates were &apos;only&apos; correlated to real effects to a R-square of 0.4, your &apos;post regression&apos; estimate as to how good The Humane League should be around&#xA0;<strong>25 Animals saved per $1000 dollars</strong>, a reduction by&#xA0;<em>two orders of magnitude</em>.</p>\n<p>Another fast and loose example would be something like this: suppose you are considering donating to a non-profit that wants to build a friendly AI. You estimate looks like it would be very good, but you know it is highly speculative, so estimates about its valuable might only be very weakly correlated with the truth (maybe R-square 0.1). How would it stack up to the AMF estimate made earlier? If you take Givewell to correlate much better to the truth (r-square 0.9, as earlier), then you can run the mathematics in reverse to see how &apos;good&apos; your estimate of the AI charity has to be to still &apos;beat&apos; Givewell&apos;s top charity after regression. The estimate for the friendly AI charity would need to be something greater than&#xA0;<strong>10^25 DALYs averted per dollar donated&#xA0;</strong>for you to believe it a &apos;better deal&apos; than AMF - at least when Givewell were still recommending it. [6]</p>\n<h1>A vindication of the regressive mindset</h1>\n<p>Given the above, regression to the mean, particularly on the sort of distributions Effective Altruists are dealing with, looks significant. If you are like me, you might be surprised at how large the downward adjustment is, and how much bigger it gets as your means of estimation get more speculative.</p>\n<p>This vindicates the &apos;<a href=\"https://www.givingwhatwecan.org/blog/2013-08-22/a-conversation-with-holden-karnofsky-co-founder-of-givewell-part-i\">regressive mindset</a>&apos;, championed most prominently by Givewell: not only should we not take impressive sounding expected value estimates literally, we often should adjust them downwards by&#xA0;<em>orders of magnitude</em>. [7] Insofar as you are surprised by the size of correction required in anticipation of regression to the mean, you should be less confident of more speculative causes (in a manner commensurate with their speculativeness), you should place a greater emphasis on robustness and reliability of estimation, and you should be more bullish about the value of cause prioritization research: improving the correlation of our estimates with actuality can massively increase the expected value of the best causes or interventions subsequently identified. [8] Givewell seem &apos;ahead of the curve&apos;, here, for which they deserve significant credit: much of this post can be taken as a more mathematical recapitulation of principles they already espouse. [9]</p>\n<h1>Towards more effective cost-effectiveness estimates</h1>\n<p>These methods are not without problems: principally, a lot depends on estimate of the correlation, and estimating this is difficult and could easily serve as a fig leaf to cover prior prejudice (e.g. I like animals but dislike far future causes, so I&apos;m bullish on how good we are at animal cause evaluation but talk down our ability to estimate far future causes, possibly giving orders of magnitude of advantage to my pet causes over others). Pseudo-rigorous methods can supply us a false sense of security, both in our estimates, but also in our estimation of our own abilities.</p>\n<p>In this case I believe the dividends outweigh the costs. It underscores how big an effect regression to the mean can be, and (if you are anything like me) prompts you to be more pessimistic when confronted with promising estimates. It appears to offer a more robust framework to allow our intuitions on these recondite matters to approach reflective equilibrium, and to better entrain them to the external world: the r-squares I offered in the examples above are in fact my own estimates, and on realizing their ramifications I my outlook on animal and targeted far future interventions has gone downwards, but my estimate of research has gone up. [10] If you disagree with me, we could perhaps point to a more precise source of our disagreement (maybe I over-egg how good Givewell is, but under-egg groups like ACE), and although much of our judgement of these matters would still rely on intuitive judgement calls, there&apos;s greater access for data to change our minds (maybe you could show me some representative associations with an r-square of 0.9 and 0.4 respectively, and suggest these are too strong/too weak to be analogous to the performance of Givewell and ACE). Prior to the mathematics, it is not clear what we could appeal to if you held that ACE should &apos;regress down&apos; by ~10% and I held it should regress down by &gt;90%. [11]</p>\n<p>Besides looking for &apos;analogous data&apos; (quantitative records of prediction of various bodies would be an obvious - and useful! - place to start) there are well-worn frequentist methods to estimate error that could be applied here, albeit with caveats: if there were multiple independent estimates of the same family of interventions, the correlation between them could be used to predict the correlation between them (or their mean) and the &apos;true&apos; effect sizes (perhaps the &apos;repeat&apos; of the Disease Control and Prevention Priorties project may provide such an opportunity, although I&apos;d guess they wouldn&apos;t be truly independent, nor what they are estimating would be truly stationary). Similarly, but with greater difficulty, one could try and look at the track record of how far your estimates have previously regressed to anticipate how much ones in the future will. Perhaps these could be fertile avenues for further research. More qualitatively, it speaks in favour of multiple independent approaches to estimation, and so supports&#xA0;<a href=\"http://blog.givewell.org/2014/06/10/sequence-thinking-vs-cluster-thinking/\">&apos;cluster-esque&apos;</a>&#xA0;thinking approaches.</p>\n<p>&#xA0;</p>\n<p>[1] See&#xA0;<a href=\"http://www.the-idea-shop.com/article/221/a-more-elegant-view-of-the-correlation-coefficient\">here</a>, or&#xA0;<a href=\"http://www.johndcook.com/blog/2010/06/17/covariance-and-law-of-cosines/\">here</a>.</p>\n<p>[2] Again, recall that this with the means taken as zero - consequently, estimates below the mean will regress&#xA0;<em>upwards.</em></p>\n<p>[3] Given Givewell&apos;s&#xA0;<a href=\"http://blog.givewell.org/2013/11/26/change-in-against-malaria-foundation-recommendation-status-room-for-more-funding-related/\">move away from recommending AMF</a>, this &apos;real&apos; expected value might be more like &apos;expected value a few years ago&apos;, depending on how much you agree with their reasoning.</p>\n<p>[4] It is worth picking a big multiple, as it gets fiddly dealing with logs that are negative.</p>\n<p>[5] There are further lines of supporting evidence: it looks like the factors that contribute to effectiveness multiply rather than add, and correspondingly&#xA0;<a href=\"http://blog.givewell.org/2011/09/29/errors-in-dcp2-cost-effectiveness-estimate-for-deworming/\">errors in the estimate tend to range over multiples as well.</a></p>\n<p>[6] This ignores worries about &apos;what distribution&apos;: we might think that given the large uncertainties about poor meat-eating, broad-run convergence, value of yet-to-exist beings etc. etc. mean both Givewell estimates and others are going to be prone to a lot of scatter - these considerations might comprise the&#xA0;<em>bulk&#xA0;</em>of variance in expected value. You can probably take out sources of uncertainty that are symmetric when comparing between two estimators, but it can be difficult to give &apos;fair dealing&apos; to both, and not colour ones estimates of estimate accuracy with sources of variance you include for one intervention but not another. Take this as an illustration rather than a careful attempt to evaluate directed far future interventions.</p>\n<p>There is an interesting corollary here, though. You might take the future seriously (e.g. you&apos;re a total utilitarian), but also hold their is some convergence between good things now and good things in the future thanks to flow-through effects. You may be uncertain about whether you should give to causes with proven direct impact now (and therefore likely good impact into the future thanks to flow through) or to a cause with a speculative but very large potential upside across the future.</p>\n<p>The foregoing suggests a useful heuristic for these decisions. If you hold there is broad run covergence, then you could phrase it as something like, &quot;Impact measured over the near term and total impact are positively correlated&quot;. The crucial question is how strong this correlation is: roughly, if you think measured near-term impact correlates&#xA0;<em>more strongly</em>&#xA0;with total impact than your estimation of far future causes correlates with total impact,&#xA0;this weighs in favour of giving to the &apos;good thing now&apos; cause over the &apos;speculative large benefit in the future&apos; cause, and vice versa.</p>\n<p>[7] This implies that the sort of &apos;back of the envelope&apos; comparisons EAs are fond of making are probably worthless, and better refrained from.</p>\n<p>[8] My hunch is this sort of surprise should also lead one to update towards &apos;broad&apos; in the &apos;broad versus targeted&apos; debate, but I&apos;m not so confident about that.</p>\n<p>[9] Holden Karnofsky has also offered a&#xA0;<a href=\"http://blog.givewell.org/2011/09/29/errors-in-dcp2-cost-effectiveness-estimate-for-deworming/\">mathematical gloss</a>&#xA0;to illustrate Givewell&apos;s scepticism and regressive mindset (but he is keen to point out this is meant as illustration, that it is not Givewell&apos;s &apos;official&apos; take, and that Givewell&apos;s perspective on these issues does not rely on the illustration he offers). Although I am not the best person to judge, and will all due respect meant, I believe this essay improves on his work:</p>\n<p>The model by Karnofsky has the deeply implausible characteristic that your expected value should start to&#xA0;<em>fall</em>&#xA0;as you estimated expected value&#xA0;<em>rises</em>, and so the mapping of likelihood onto posterior is no longer order-preserving: if A has a mean estimate of 10 units value and B an estimate of 20 units value, you should think A has a&#xA0;<em>higher&#xA0;</em>&#xA0;expected value than B.&#xA0;The reason the model demonstrates this pathological feature is that it stipulates the SD of the estimate should always equal its mean: as a consequence for their model, no matter how high the mean estimate, you should assign ~37% credence (&gt;-1SD) that the real value should be negative - worse, as the mean estimate&#xA0;<em>increases</em>, lower percentiles (e.g. the 5% ~-2SD confidence bound) continue to fall, so that whilst an intervention of mean expected value of 5 Units has &lt;&lt;1% of its probability mass at -10 or less, this ceases to be the case with an intervention with a mean expected value of 50 Units or 500. Another way of looking at what is going on is the steep increase in the SD means that the estimate becomes less informative far more rapidly than its mean rises, and so the update ignores the new information more and more as the mean rises (given updating is commutative, it might be clearer the other way around: you have this very vague estimate, and then you attend to the new estimate with &apos;only&apos; an SD of 1 compared to 500 or 1000 or so, and strongly update to that).</p>\n<p>This seems both implausible on its face and doesn&apos;t concord with our experience as to how estimators work in the wild either. The motivating intuition (that your expected error/credence interval/whatever of an estimate should get bigger as your estimate grows) is better captured with using fatter tailed distributions (e.g. the confidence interval grows in absolute terms with log-normal distributions).</p>\n<p>I also think this is one case where the frequentist story gives an easier route to something robust and understandable than talk of Bayesian updating. It is harder to get &apos;hard numbers&apos; (i.e. &apos;so how much do I adjust downwards from the estimate?&apos;) out the Bayesian story as easily as the geometric one provided above, and the importance (as we&apos;ll see later) of multiple - preferably independent - estimates can be seen more easily, at least by my lights.</p>\n<p>[10] These things might overlap: it may be the best way of doing research in cause prioritization is trialing particular causes and seeing how they turn out, and - particularly in far future directed causes - the line between &apos;intervention&apos; and &apos;research&apos; could get fuzzy. However, it suggests in many cases the primarily value of these activities&#xA0;<em>is&#xA0;</em>the value of information gains, rather than the putative &apos;direct&apos; impact (c.f. &apos;<a href=\"http://blog.givewell.org/2012/12/20/more-on-the-ranking-of-our-top-charities/\">Giving to Learn</a>&apos;).</p>\n<p>[11] It also seems fertile ground to better analyse things like search strategy, and the trade off between evaluating many things less accurately or fewer things more rigorously in terms of finding the highest expected value causes.</p></body></html>", "user": {"username": "Gregory_Lewis"}}, {"_id": "kscC6AhLJbE2Hsra5", "title": "When should an Effective Altruist be vegetarian?", "postedAt": "2014-11-23T05:23:51.290Z", "htmlBody": "<html><body><p><em>Crossposted from <a href=\"http://meteuphoric.wordpress.com/2014/11/21/when-should-an-effective-altruist-be-vegetarian/\">Meteuphoric</a></em></p>\n<p>I have lately noticed several&#xA0;people&#xA0;wondering why more&#xA0;<a href=\"/\">Effective Altruists</a>&#xA0;are not vegetarians.&#xA0;I am personally not a vegetarian because I don&apos;t think it is an effective way to be altruistic.</p>\n<p><span>As far as I can tell the&#xA0;fact that many EAs are not vegetarians&#xA0;is surprising&#xA0;to some&#xA0;because they think &apos;animals are probably morally relevant&apos; basically implies &apos;we shouldn&apos;t eat animals&apos;. To my ear, this sounds about as absurd&#xA0;as if&#xA0;Givewell&apos;s explanation&#xA0;of their&#xA0;<a href=\"http://www.givewell.org/international/top-charities/schistosomiasis-control-initiative\">recommendation of SCI</a>&#xA0;stopped after&#xA0;&apos;the developing world exists, or at least has a high probability of doing so&apos;.</span></p>\n<p>(By the way,&#xA0;I do get to a calculation at the bottom, after some speculation&#xA0;about why the calculation I think is appropriate is&#xA0;unlike what I take others&apos; implicit calculations to be. Feel free to&#xA0;just scroll down and look at it).</p>\n<p>I think this fairly large&#xA0;difference between&#xA0;my and many&#xA0;vegetarians&apos;&#xA0;guesses at the value of vegetarianism arises because they think the relevant question is whether the suffering to the animal is worse than the pleasure to themselves at eating the animal. This question sounds superficially plausibly&#xA0;relevant, but I think on closer consideration you will agree that it is the wrong question.</p>\n<p>The real question is not whether the cost to you is small, but whether you could do more&#xA0;good for the same small cost.</p>\n<p>Similarly, when deciding whether to donate $5 to a random charity, the&#xA0;question is whether you could do more good by&#xA0;donating the&#xA0;money&#xA0;to&#xA0;the most effective charity&#xA0;you know of.&#xA0;Going vegetarian because it&#xA0;relieves the animals more than it hurts you&#xA0;is the equivalent of donating to a random developing world charity because&#xA0;it&#xA0;relieves&#xA0;the suffering of an&#xA0;impoverished child more than&#xA0;foregoing $5&#xA0;increases your suffering.</p>\n<p><strong>Trading with&#xA0;inconvenience and displeasure</strong></p>\n<p>My imaginary vegetarian debate partner&#xA0;objects to this on grounds&#xA0;that vegetarianism is different from donating to ineffective&#xA0;charities, because to be a vegetarian you are spending effort and enjoying your life less rather than spending money, and&#xA0;you can&apos;t really reallocate that&#xA0;inconvenience and&#xA0;displeasure&#xA0;to, say,&#xA0;preventing artificial intelligence disaster or feeding the hungry,&#xA0;if don&apos;t use it on reading food labels and eating tofu. If I&#xA0;were to go ahead and eat the sausage&#xA0;instead - the concern&#xA0;goes -&#xA0;probably I&#xA0;would just go on with the rest of my&#xA0;life&#xA0;exactly&#xA0;the same, and a bunch of farm animals&#xA0;somewhere&#xA0;would be&#xA0;the worse for it, and I&#xA0;scarcely better.</p>\n<p>I agree that if the meat eating decision&#xA0;were separated from everything else in this way, then the decision really would be about your welfare vs. the animal&apos;s welfare,&#xA0;and you should probably eat the tofu.</p>\n<p>However whether you can trade being vegetarian for more effective sacrifices&#xA0;is largely&#xA0;a question of whether you choose to do so. And&#xA0;if vegetarianism is not the most effective&#xA0;way to inconvenience yourself, then it&#xA0;is clear that&#xA0;you should choose to do so.&#xA0;If you eat meat now in exchange for suffering some more effective annoyance at another time,&#xA0;you and the&#xA0;world&#xA0;can be&#xA0;better off.</p>\n<p>Imagine an EA friend&#xA0;says to you that&#xA0;she gives&#xA0;substantial&#xA0;money to whatever random charity&#xA0;has put a tin in&#xA0;whatever shop she is in, because it&apos;s better than the donuts and new dresses&#xA0;she&#xA0;would buy otherwise. She&#xA0;doesn&apos;t see how not giving the money to the random charity would&#xA0;really cause her to&#xA0;give&#xA0;it to a better charity - empirically she would spend it on luxuries. What do you say to this?</p>\n<p>If she were my friend, I might point out that the money isn&apos;t meant to magically move somewhere better - she may have to consciously direct it there. She might need to write down how much she was going to give to the random charity, then look at the note&#xA0;later for instance. Or she might do well to decide once and for all how much to give to charity and how much to spend on herself, and then stick to that. As an aside, I might&#xA0;also feel&#xA0;that&#xA0;she was using the term &apos;Effective Altruist&apos; kind of&#xA0;broadly.</p>\n<p>I see vegetarianism for the sake of&#xA0;not managing to&#xA0;trade&#xA0;inconveniences as&#xA0;quite similar.&#xA0;And&#xA0;in both&#xA0;cases you risk&#xA0;spending your life doing suboptimal things every time a suboptimal altruistic opportunity has a chance to steal resources from what would be your personal purse. This seems like&#xA0;something that&#xA0;your personal and altruistic values should cooperate in avoiding.</p>\n<p>It is likely&#xA0;too&#xA0;expensive to keep track of&#xA0;an elaborate trading system, but you should&#xA0;at least be able to make reasonable long term&#xA0;arrangements. For instance, if instead of eating vegetarian you ate a bit frugally and saved and donated a few dollars per meal,&#xA0;you would probably do more good (see calculations lower in this post). So if frugal eating&#xA0;were similarly annoying, it would be better. Eating frugally&#xA0;is inconvenient in very similar ways to vegetarianism, so is a particularly plausible trade if you are skeptical that such trades can be made. I claim you could make very different trades though, for instance foregoing&#xA0;the pleasure of an extra five minute&apos;s break and working instead&#xA0;sometimes. Or you could decide once and for all how much annoyance to have, and then choose most worthwhile bits of annoyance, or put a dollar value on your own time and suffering&#xA0;and try to be consistent.</p>\n<p><strong>Nebulous life-worsening costs of vegetarianism</strong></p>\n<p>There is a separate psychological question which is often mixed up with the above issue. That is, whether making your life marginally less gratifying and more annoying in small ways will make you sufficiently less productive to undermine the good done by your sacrifice. This is not about whether you will do something a bit costly another time for the sake of altruism, but whether just spending your attention and happiness on vegetarianism will harm your other&#xA0;efforts to do good, and cause more&#xA0;harm than good.</p>\n<p>I find this plausible in many cases, but I expect&#xA0;it&#xA0;to vary a lot by person.&#xA0;My mother seems to&#xA0;think it&apos;s&#xA0;basically free to eat supplements, whereas to me&#xA0;every additional daily routine seems to encumber my life and require me to&#xA0;spend disproportionately more time thinking about unimportant things. Some people find it hard to concentrate when unhappy, others don&apos;t.&#xA0;Some people struggle to feed themselves adequately&#xA0;at all,&#xA0;while others actively enjoy preparing&#xA0;food.</p>\n<p>There are offsetting positives from vegetarianism which also vary across people.&#xA0;For instance there is the pleasure&#xA0;of&#xA0;self-sacrifice, the joy&#xA0;of&#xA0;being&#xA0;part of a proud and moralizing minority, and the absence of&#xA0;the horror of&#xA0;eating other beings. There are also perhaps health benefits, which probably don&apos;t vary that much by people, but people do vary in how big they think&#xA0;the health benefits are.</p>\n<p>Another &#xA0;way you might accidentally lose more value than you save is in&#xA0;spending little bits of time which are hard to measure or&#xA0;notice. For instance,&#xA0;vegetarianism means&#xA0;spending a bit&#xA0;more time searching for vegetarian alternatives,&#xA0;researching nutrition, buying&#xA0;supplements,&#xA0;writing emails back to people who invite you to dinner explaining your dietary restrictions, etc.&#xA0;The value of different people&apos;s time varies a lot,&#xA0;as does the extent to which an additional&#xA0;vegetarianism routine would tend to eat their time.</p>\n<p>On a less psychological note, the&#xA0;<a title=\"Intelligence Amplification Interview\" href=\"http://meteuphoric.wordpress.com/2014/03/28/intelligence-amplification-interview/\">potential drop in IQ</a>&#xA0;(~5 points?!) from missing out on creatine is a particularly terrible example of vegetarianism making people less productive. Now that we know about creatine and&#xA0;<a href=\"http://www.amazon.com/s/ref=nb_sb_noss_1?url=search-alias%3Daps&amp;field-keywords=creatine\">can supplement it</a>, creatine itself is not such an issue. An issue does remain though: is this an&#xA0;unlikely one-off failure, or&#xA0;should we&#xA0;worry&#xA0;about more such deficiency?&#xA0;(this goes for any kind of unusual diet, not just meat-free ones).</p>\n<p><strong>How much is avoiding meat worth?</strong></p>\n<p>Here is my own calculation of&#xA0;how much it costs to do the same amount of good as replacing one meat meal with one&#xA0;vegetarian meal.&#xA0;If you would be willing to pay this&#xA0;much extra to eat meat for one meal, then you should eat meat. If not, then you should abstain. For instance, if eating&#xA0;meat does $10 worth of&#xA0;harm, you should eat meat whenever&#xA0;you would hypothetically pay an extra $10 for the privilege.</p>\n<p>This is a tentative calculation. I will probably&#xA0;update it if people&#xA0;offer substantially better numbers.</p>\n<p>All&#xA0;quantities are&#xA0;in terms of social harm.</p>\n<p><strong>Eating&#xA0;1 non-vegetarian meal</strong></p>\n<p><strong>&lt; eating 1 chickeny meal</strong>&#xA0;(I am told chickens are particularly bad&#xA0;animals to eat, due to their poor living conditions and large animal:meal ratio. The relatively small size of their brains might offset this, but I will conservatively give all animals the moral weight of humans&#xA0;in this calculation.)</p>\n<p><strong>&lt; eating 200 calories of chicken</strong>&#xA0;(a McDonalds crispy chicken sandwich&#xA0;<a href=\"http://nutrition.mcdonalds.com/getnutrition/nutritionfacts.pdf\">probably contains</a>&#xA0;a bit over&#xA0;100 calories of chicken (based on its listed protein content); a Chipotle chicken burrito&#xA0;<a href=\"http://www.chipotle.com/en-US/menu/nutrition_calculator/nutrition_calculator.aspx\">contains</a>&#xA0;around 180 calories of chicken)</p>\n<p><strong>= causing&#xA0;~0.25 chicken lives</strong>&#xA0;(1 chicken is equivalent in price to&#xA0;800 calories of chicken breast i.e. eating an additional 800 calories of chicken breast conservatively results in one additional chicken. Calculations from data&#xA0;<a href=\"http://www.housetohomestead.com/2011/03/chicken-math-how-much-meat-is-in-a-whole-chicken/\">here</a>&#xA0;and&#xA0;<a href=\"https://www.google.com/webhp?sourceid=chrome-instant&amp;ion=1&amp;espv=2&amp;ie=UTF-8#q=calories+chicken+breast\">here</a>.)</p>\n<p><span><strong>&lt; -$0.08&#xA0;given to&#xA0;the Humane League&#xA0;</strong>(<a href=\"http://www.animalcharityevaluators.org/\">ACE</a>&#xA0;<a href=\"http://www.animalcharityevaluators.org/research/organizations/the-humane-league-review/\">estimates</a>&#xA0;the Humane League spares 3.4 animal lives per dollar). However since the humane league basically convinces other people to be vegetarians,&#xA0;this may be hypocritical or otherwise dubious.</span></p>\n<p><strong>&lt;&#xA0;causing 12.5 days of chicken life&#xA0;</strong>(broiler chickens&#xA0;<a href=\"http://en.wikipedia.org/wiki/Broiler\">are slaughtered</a>&#xA0;at between 35-49 days of age)</p>\n<p><strong>= causing 12.5 days of chicken suffering</strong>&#xA0;(I&apos;m being generous)</p>\n<p><span>&lt;&#xA0;<strong>-$0.50 subsidizing free range eggs</strong>, &#xA0;(This is a somewhat random example of the cost of more systematic efforts to improve animal welfare, rather than necessarily the best.&#xA0;The cost here is the&#xA0;cost of buying&#xA0;free range eggs and selling them as non-free range eggs. It&#xA0;<a href=\"http://en.wikipedia.org/wiki/Free-range_eggs#Cost\">costs</a>&#xA0;about 2.6 2004 Euro cents [= US 4c in 2014] to pay for an egg to be free range instead of produced in a battery. This corresponds to a bit over one&#xA0;day of chicken life. I&apos;m assuming here that the life of a battery egg-laying chicken&#xA0;is not substantially better than that of a meat chicken, and that free range chickens have lives that are at least neutral. If they are positive, the figure becomes even more favorable to the free range eggs).</span></p>\n<p><strong>&lt; losing 12.5 days of high quality human life</strong>&#xA0;(assuming saving one year&#xA0;of human life is at least as good as stopping one year&#xA0;of an animal suffering, which you may disagree with.)</p>\n<p><span><strong>= -$1.94-5.49 spent on&#xA0;GiveWell&apos;s top charities</strong>&#xA0;(This was GiveWell&apos;s&#xA0;<a href=\"http://www.givewell.org/giving101/Your-dollar-goes-further-overseas%20\">estimate</a>&#xA0;for AMF if we assume saving&#xA0;a life corresponds to saving 52 years - roughly the life expectancy of children in Malawi. GiveWell&#xA0;doesn&apos;t&#xA0;recommend AMF at the moment, but they recommend charities they considered comparable to AMF when AMF had this value.</span></p>\n<p><span>GiveWell employees&apos; median estimate for the cost of &apos;saving a life&apos; through donating to SCI&#xA0;is $5936 [see spreadsheet&#xA0;<a href=\"http://www.givewell.org/international/technical/programs/deworming#Howcosteffectiveismassdeworming\">here</a>]. If we suppose a life &#xA0;is 37 DALYs, as they assume in the spreadsheet, then 12.5 days is worth 5936*12.5/37*365.25 = $5.49. Elie produced two estimates that were generous to cash and to deworming separately, and gave the highest and lowest estimates for the cost-effectiveness of deworming, of the group. They imply&#xA0;a range of&#xA0;$1.40-$45.98 to do as much good via SCI as eating vegetarian for a meal).</span></p>\n<p>Given this calculation, we get a few cents to a couple of dollars as the cost of doing similar amounts of good to averting a meat meal via other means.&#xA0;We are not finished yet though - there were many factors&#xA0;I didn&apos;t take into account in the calculation, because I wanted to separate relatively straightforward&#xA0;facts for which I have good evidence from guesses.&#xA0;Here are other considerations&#xA0;I can think of, which reduce the relative value of averting meat eating:</p>\n<ol>\n<li>Chicken brains&#xA0;are fairly&#xA0;small, suggesting their internal experience is less than that of humans. More generally, in the spectrum of entities&#xA0;between&#xA0;humans and&#xA0;microbes, chickens are at least some of the way to microbes. And you wouldn&apos;t pay much to save a microbe.</li>\n<li>Eating a chicken only reduces the number of chicken produced by some fraction.&#xA0;According to Peter Hurford,&#xA0;an extra&#xA0;<a href=\"http://everydayutilitarian.com/essays/why-eat-less-meat/\">0.3 chickens</a>&#xA0;are produced if&#xA0;you demand&#xA0;1 chicken. I didn&apos;t include this in the above calculation because I am not sure&#xA0;of&#xA0;the time scale of the relevant&#xA0;elasticities (if they are short-run elasticities, they might&#xA0;underestimate the effect of vegetarianism).</li>\n<li>Vegetable production&#xA0;may also have negative effects on animals.</li>\n<li>Givewell estimates have been rigorously checked relative to other things, and&#xA0;<a title=\"Why would info worsen altruistic options?\" href=\"http://meteuphoric.wordpress.com/2014/07/15/why-would-info-worsen-altruistic-options/\">evaluations tend to get worse as you check them</a>. For instance, you&#xA0;might forget to include any of the things in this list in your evaluation of vegetarianism. Probably there&#xA0;are more things I forgot. That is, if you looked into vegetarianism with the same detail as SCI,&#xA0;it would become&#xA0;more pessimistic, and so cheaper to do as much good with SCI.</li>\n<li>It is not at all obvious that meat animal lives are not worth living on average.&#xA0;Relatedly, animals generally want to be alive, which we might want to give some weight to.</li>\n<li>Animal welfare in general&#xA0;<a href=\"http://www.effective-altruism.com/ea/6c/human_and_animal_interventions_the_longterm_view/\">appears</a>&#xA0;to have negligible predictable&#xA0;effect on the future&#xA0;(very debatably), and there are probably things which can have huge impact on the&#xA0;<a href=\"https://sites.google.com/site/nbeckstead/research\">future</a>. This would&#xA0;make animal altruism&#xA0;worse&#xA0;compared to&#xA0;present-day human interventions, and much&#xA0;worse compared to&#xA0;interventions directed&#xA0;at affecting the far future, such as averting existential risk.</li>\n</ol>\n<p>My own quick&#xA0;guesses at factors by which&#xA0;the relative value of avoiding meat&#xA0;should be multiplied, to account for&#xA0;these considerations:</p>\n<ol>\n<li>Moral value of small animals: 0.05</li>\n<li>Raised price reduces others&apos; consumption: 0.5</li>\n<li>Vegetables&#xA0;harm&#xA0;animals too: 0.9</li>\n<li>Rigorous estimates look worse: 0.9</li>\n<li>Animal lives might be worth living: 0.2</li>\n<li>Animals don&apos;t affect the future:&#xA0;0.1 relative to human&#xA0;poverty&#xA0;charities</li>\n</ol>\n<p>Thus given my estimates, we scale down the above figures by&#xA0;0.05*0.5*0.9*0.9*0.2*0.1 =0.0004. This&#xA0;gives us&#xA0;$0.0008-$0.002 to do as much good as eating a vegetarian meal by spending on GiveWell&apos;s top charities.&#xA0;Without the factor for the future (which doesn&apos;t apply to these other animal charities), we only&#xA0;multiply the&#xA0;cost of eating a meat meal by 0.004.&#xA0;This gives us a price of $0.0003 with&#xA0;the Humane League, or $0.002 on improving chicken&#xA0;welfare in other ways.&#xA0;These are not price differences&#xA0;that will&#xA0;change my meal&#xA0;choices very often! I think I would often be willing to pay at least a couple of extra dollars to eat meat, setting aside animal suffering. So if I were to avoid eating meat, then assuming I keep fixed&#xA0;how much of my budget I spend on myself and how much I spend on altruism, I would be trading&#xA0;a&#xA0;couple of dollars of value for less than one&#xA0;thousandth of that.</p>\n<p>I&#xA0;encourage you to estimate your own numbers for the above factors, and to&#xA0;recalculate&#xA0;the overall price according to your beliefs.&#xA0;<strong>If you&#xA0;would happily pay this much&#xA0;(in my case, less than $0.002) to eat meat on many&#xA0;occasions, you probably shouldn&apos;t be a vegetarian.</strong>&#xA0;You are better off paying that cost elsewhere.&#xA0;If you would rarely be willing to pay the calculated price,&#xA0;you should perhaps consider being a vegetarian, though note that the calculation was&#xA0;conservative in favor of vegetarianism, so you might want to run it again more carefully. Note that&#xA0;in judging&#xA0;what you would be willing to pay to eat meat, you should take into account everything except the direct cost to animals.</p>\n<p>There are many common&#xA0;reasons you might not be willing to eat meat, given these calculations, e.g.:</p>\n<ul>\n<li>You don&apos;t enjoy&#xA0;eating meat</li>\n<li>You think meat is pretty unhealthy</li>\n<li>You belong to a social cluster&#xA0;of vegetarians, and don&apos;t like conflict</li>\n<li>You think convincing enough others to be vegetarians is the most cost-effective way to make the world&#xA0;better, and being a vegetarian is a great way to have heaps of conversations about vegetarianism, which you believe makes people feel better about vegetarians overall,&#xA0;to the extent that they are frequently compelled to become vegetarians.</li>\n<li>&apos;For signaling&apos; is another common explanation I have heard, which I think is meant to be similar to the above, though I&apos;m not actually sure of the details.</li>\n<li>You aren&apos;t able to&#xA0;treat costs like these as fungible (as discussed above)</li>\n<li>You&#xA0;are completely&#xA0;indifferent to&#xA0;what you eat (in that case,&#xA0;you&#xA0;would probably do better eating as cheaply as possible, but maybe everything is the same price)</li>\n<li>&#xA0;You consider the&#xA0;act-omission distinction morally relevant</li>\n<li>You are very skeptical of the ability to affect anything, and in particular&#xA0;have&#xA0;substantially greater confidence in the market - to farm&#xA0;some fraction of a&#xA0;pig fewer in expectation if you abstain from pork for long enough - than in&#xA0;nonprofits and complicated schemes. (Though in that case, consider buying free-range eggs and selling them as cage eggs).</li>\n<li>You think&#xA0;the suffering of animals is of extreme importance compared to the suffering of humans or loss of human lives, and don&apos;t trust the figures I have given for improving the lives of egg-laying chickens, and don&apos;t want to be a hypocrite. Actually, you still probably shouldn&apos;t here - the egg-laying chicken number is just an example of a plausible alternative way to help animals. You should really check quite a few of these before settling.</li>\n</ul>\n<p>However&#xA0;I think for&#xA0;wannabe effective altruists&#xA0;with the usual array of characteristics,&#xA0;vegetarianism&#xA0;is likely to be quite ineffective.</p></body></html>", "user": {"username": "Katja_Grace"}}, {"_id": "tsPxdNB9LXSoGJxWB", "title": "EARadio: A New Podcast for Effective Altruists", "postedAt": "2014-11-22T18:16:27.337Z", "htmlBody": "<html><body><p><a href=\"http://earad.io/\">EARadio</a> is a new podcast made up of material relevant to effective altruists. There are a lot of great talks online, such as those from the <a href=\"https://www.youtube.com/user/nnevvinn/videos\">2013 Effective Altruism Summit</a> and <a href=\"https://www.youtube.com/channel/UC_gBQtUE3BBl-Mh_IBQkg9Q\">Giving What We Can</a>. But this content is spread out over multiple websites and often available only as video.</p>\n<p>EARadio packages this material into a convenient podcast.</p>\n<p>Subscribe with</p>\n<ul>\n<li><a href=\"https://itunes.apple.com/us/podcast/earadio/id929612068\">iTunes</a></li>\n<li><a href=\"http://earad.io/feed/podcast/\">RSS</a></li>\n<li><a href=\"http://www.stitcher.com/podcast/earadio\">Stitcher</a></li>\n</ul>\n<p>EARadio was created by Chris Calabro and Patrick Brinich-Langlois. If you have suggestions for materials to add, please let us know in the comments.</p></body></html>", "user": {"username": "Patrick"}}, {"_id": "6PBo5Gmcr4gnJj5Kc", "title": "Meetup : Utrecht: a critique of effective altruism", "postedAt": "2014-11-22T07:22:31.224Z", "htmlBody": "<html><body><h2>Discussion article for the meetup : <a href=\"/meetups/1l\">Utrecht: a critique of effective altruism</a></h2>\n\t\t  <div>\n\t\t\t\t<p>\n\t\t    \t<strong>WHEN:</strong> \n\t\t    \t<span>04 January 2015 02:00:00PM (+0100)</span><br>\n\t\t\t\t</p>\n\t\t\t\t<p>\n\t\t    \t<strong>WHERE:</strong> \n\t\t    \t<span>La Place, Utrecht, Rijnkade 5</span>\n\t\t\t\t</p>\n\t\t  </div><!-- .meta -->\n\t\t  <div>\n\t\t    <div><p>For details, see meetup.com <a href=\"http://www.meetup.com/LWEANL/events/218834877/,\">http://www.meetup.com/LWEANL/events/218834877/,</a> which is supposed to be up-to-date.</p></div>\n\t\t  </div><!-- .content -->\n\t\t<h2>Discussion article for the meetup : <a href=\"/meetups/1l\">Utrecht: a critique of effective altruism</a></h2></body></html>", "user": {"username": "ImmaSix"}}, {"_id": "A3Q6dQ7CE3gDh843z", "title": "Meetup : Utrecht", "postedAt": "2014-11-22T07:21:18.725Z", "htmlBody": "<html><body><h2>Discussion article for the meetup : <a href=\"/meetups/1k\">Utrecht</a></h2>\n\t\t  <div>\n\t\t\t\t<p>\n\t\t    \t<strong>WHEN:</strong> \n\t\t    \t<span>04 January 2015 02:00:00PM (+0100)</span><br>\n\t\t\t\t</p>\n\t\t\t\t<p>\n\t\t    \t<strong>WHERE:</strong> \n\t\t    \t<span>La Place, Utrecht, Rijnkade 5</span>\n\t\t\t\t</p>\n\t\t  </div><!-- .meta -->\n\t\t  <div>\n\t\t    <div><p>For details, see meetup.com: <a href=\"http://www.meetup.com/LWEANL/events/218834861/\">http://www.meetup.com/LWEANL/events/218834861/</a> , which is supposed to be up-to-date.</p></div>\n\t\t  </div><!-- .content -->\n\t\t<h2>Discussion article for the meetup : <a href=\"/meetups/1k\">Utrecht</a></h2></body></html>", "user": {"username": "ImmaSix"}}, {"_id": "WiyqQr59ELFacLuwq", "title": "Meetup : Utrecht: Game Theory", "postedAt": "2014-11-22T07:19:48.530Z", "htmlBody": "<html><body><h2>Discussion article for the meetup : <a href=\"/meetups/1j\">Utrecht: Game Theory</a></h2>\n\t\t  <div>\n\t\t\t\t<p>\n\t\t    \t<strong>WHEN:</strong> \n\t\t    \t<span>30 November 2014 02:00:29PM (+0100)</span><br>\n\t\t\t\t</p>\n\t\t\t\t<p>\n\t\t    \t<strong>WHERE:</strong> \n\t\t    \t<span>La Place, Utrecht, Rijnkade 5</span>\n\t\t\t\t</p>\n\t\t  </div><!-- .meta -->\n\t\t  <div>\n\t\t    <div><p>For details, see meetup.com: <a href=\"http://www.meetup.com/LWEANL/events/218834835/\">http://www.meetup.com/LWEANL/events/218834835/</a></p></div>\n\t\t  </div><!-- .content -->\n\t\t<h2>Discussion article for the meetup : <a href=\"/meetups/1j\">Utrecht: Game Theory</a></h2></body></html>", "user": {"username": "ImmaSix"}}, {"_id": "WdtcxCKFLLCeLBR6H", "title": "Why long-run focused effective altruism is more common sense", "postedAt": "2014-11-21T00:12:34.020Z", "htmlBody": "<html><body><p><span>If you set out to maximise the welfare of people alive today, treating them all equally, you&#x2019;ll end up doing some pretty weird things. Who&#x2019;d have thought &#x201C;doing the most good&#x201D; boiled down to handing out cash to poor Kenyan farmers?</span></p>\n<p><strong><br></strong></p>\n<p><span>When people see effective altruists focused on cash transfers, distributing bed-nets and cheap medicine - and claiming they&#x2019;re doing the most good - there&#x2019;s a common reaction:</span></p>\n<p><strong><br></strong></p>\n<blockquote>\n<p><span>This looks naive and narrow : Sure these interventions help the immediate beneficiaries, but they hardly look like they&#x2019;re solving the world&#x2019;s greatest problems. </span></p>\n</blockquote>\n<p><strong><br></strong></p>\n<p><span>It looks like they&#x2019;ve made the mistakes of ignoring small probabilities of big upsides, focusing only on concrete outcomes, and ignored the historical record (in which science, technology and better government are some of the main drivers of progress). It also looks like they&#x2019;ve completely discounted common-sense do-gooding, which is not mainly focused on global health.</span></p>\n<p><strong><br></strong></p>\n<p><span>Now suppose you care about both the welfare of people today *and* helping people in the future. If you care about the future, you&#x2019;ll want to make investments in technology and economic growth that will pay off later. You&#x2019;ll also want to make sure society is in a position to navigate unpredictable future challenges. This will mean better global institutions, smarter leaders, more social science, and so on. And it&#x2019;s hard to know which of these are most pressing.1</span></p>\n<p><strong><br></strong></p>\n<p><span>Overall, this menu of global priorities looks much closer to common-sense efforts to make a difference. In this way, long-run focused effective altruism ends up looking more common-sense than efforts just focused on helping present generations.2</span></p>\n<p><strong><br></strong></p>\n<p><span>Long-run focused effective altruism is often seen as even less common-sense than the short-run focused version. But it doesn&#x2019;t have to be that way. Long-run focused effective altruism only becomes unintuitive when taken to an extreme and combined with further non-common-sense beliefs, such as the belief that reducing existential risk is the best way to aid the future, and within that, the belief that artificial intelligence is the most pressing existential risk.3 </span></p>\n<p><strong><br></strong></p>\n<p><span>Because long-run focused effective altruism is associated with these further weird positions, it&#x2019;s often downplayed when speaking to new people, in favor of short-run effective altruism (malaria nets and so on). I propose that it will be better, especially for people who are already engaged with making a difference, to introduce them first to *moderate long-run focused effective altruism* rather than the short-run focused version. It&#x2019;s more intuitive and reasonable sounding.</span></p>\n<p><strong><br></strong></p>\n<p><span>The reason this doesn&#x2019;t happen already, I think, is that people aren&#x2019;t sure how to explain moderate long-run focused effective altruism - it&#x2019;s much easier to say &#x201C;malaria nets&#x201D; and direct someone to (traditional) GiveWell. But in the last year it has become much easier to explain. When it comes to picking causes, emphasise that effective altruists take a strategic approach. Yes, they consider their personal passions, but they also try to work on causes that are important, tractable and neglected. Explain that the most important causes are the ones that do the most to build a flourishing society now and in the long-run. Then give several examples: yes there&#x2019;s global health (especially good on tractability), but there&#x2019;s also global catastrophic risks (good on importance and neglectedness); scientific research, penal reform, and much else. Link them the Open Philanthropy Project, 80,000 Hours and the Copenhagen Consensus.</span></p>\n<p><strong><br></strong></p>\n<p><span>In conclusion, short-run effective altruism is often favored as more intuitive and better for introducing to new people compared to long-run focused effective altruism, because long-run focused effective altruism is often associated with further weird positions. However, a more moderate and uncertain long-run focused effective altruism is actually the most reasonable sounding position.</span></p>\n<p><strong><br></strong></p>\n<p><span>* * *</span></p>\n<p><strong><br></strong></p>\n<p><span>1 Of course, interventions which maximise short-run welfare might *also* happen to be the best-way to help the long-run future, but that&#x2019;s a topic for a different day.</span></p>\n<p><strong><br></strong></p>\n<p><span>2 It also looks more common-sense because it involves less certainty. It&#x2019;s very hard to know what the long-run effects of our actions are, so long-run focused effective altruism tends to work with a broader range of causes than the short-run focused version.</span></p>\n<p><br><span>3. In fact, even if you believe both of these things, once the low-hanging fruit with friendly AI research etc. are used up, you&#x2019;re going to then focus on common-sense causes like international collaboration.</span></p></body></html>", "user": {"username": "Benjamin_Todd"}}, {"_id": "wr46E3DQ3xBjWesEi", "title": "An interactive webpage showing how to donate to effective charities tax-deductibly in any country", "postedAt": "2014-11-19T14:06:48.291Z", "htmlBody": "<html><body><p>I&#x2019;ve built a webpage which lets people select their country from a dropdown menu and then clearly see which GiveWell-recommended charities are tax-deductible in their country, and click through to donate via the best method. (It&#x2019;ll show this for the new recommendations as soon as they&#x2019;re announced around December 1st - exciting times!) &#xA0;You can see it at:</p>\n<p><strong><a href=\"http://effectivealtruismhub.com/actions/donating\">http://effectivealtruismhub.com/actions/donating</a></strong></p>\n<p>After you&#x2019;ve selected your country, this page provides buttons to donate to the charities via the most tax-efficient means. For example, because the Against Malaria Foundation is registered in most countries, you&#x2019;ll see links to donate to it directly. But the links for other charities often go via EA organisations that provide tax deductibility for them in their respective countries (GiveWell for the US, Charity Science for Canada, the GWWC Trust for the UK, and GBS for Switzerland).</p>\n<p>The page also shows short pitches for the charities. My hope is that it will be a useful place for EAs to point international audiences to when encouraging them to donate - it saves having to type out complex descriptions of tax-deductibility for different charities, which I found myself having to do way too often before deciding to make this page. (&#x201C;If you&#x2019;re in the UK then a deworming charity you can support is SCI,&#x201D; I&#x2019;d say, &#x201C;but if you&#x2019;re in the US then Deworm the World is tax-deductible, except you can give to either via GiveWell, and if you&#x2019;re elsewhere it&#x2019;s a little more complicated, but...&#x201D;)</p>\n<p>I&#x2019;m happy to broaden this out to other popular charities besides those recommended by GiveWell if people would find this helpful. If you have any other helpful information about tax-deductibility, share it in the comments!</p>\n<p><a href=\"http://effectivealtruismhub.com/actions/donating\"><img src=\"http://effectivealtruismhub.com/sites/effectivealtruismhub.com/media/images/specific-pages/donations-piggy-bank.jpg\" alt=\"Donations from members of the effective altruist community\"></a></p></body></html>", "user": {"username": "Tom_Ash"}}, {"_id": "DpRTqSmfiHKrqqkFb", "title": "Meetup : Donation Decision Day", "postedAt": "2014-11-18T00:12:17.364Z", "htmlBody": "<html><body><h2>Discussion article for the meetup : <a href=\"/meetups/1i\">Donation Decision Day</a></h2>\n\t\t  <div>\n\t\t\t\t<p>\n\t\t    \t<strong>WHEN:</strong> \n\t\t    \t<span>28 December 2014 11:00:00AM (-0800)</span><br>\n\t\t\t\t</p>\n\t\t\t\t<p>\n\t\t    \t<strong>WHERE:</strong> \n\t\t    \t<span>109 15th Ave, Seattle, WA 98122</span>\n\t\t\t\t</p>\n\t\t  </div><!-- .meta -->\n\t\t  <div>\n\t\t    <div><p>&quot;Lets get together and work on making our final donation decisions for the year!</p>\n\n<p>Doesn&apos;t matter if you&apos;re giving $20,000 or $20.</p>\n\n<p>Doesn&apos;t matter if you&apos;ve never done research on charities, or if you&apos;ve read the primary literature on malaria net research.</p>\n\n<p>Wherever you&apos;re at, try to beat your personal best: give a little more this year and do a little better research this year.</p>\n\n<p>Come and work on your personal donation decisions; with a partner or by yourself. Do research, run the numbers, and if you run into trouble, have a 1-on-1 discussion with someone about it.</p>\n\n<p>Once you&apos;ve made your decisions, send out your checks with our stamps!</p>\n\n<p>Come starting at 11am to have a short discussion about donor advised funds etc.</p>\n\n<p>People will be here all day, so feel free to come at any time.&quot;</p></div>\n\t\t  </div><!-- .content -->\n\t\t<h2>Discussion article for the meetup : <a href=\"/meetups/1i\">Donation Decision Day</a></h2></body></html>", "user": {"username": "riceissa"}}, {"_id": "JdqzNvvPscsghW8xR", "title": "Open thread 5", "postedAt": "2014-11-17T15:57:12.988Z", "htmlBody": "<html><body><p><span>Welcome to the fifth open thread on the Effective Altruism Forum. This is our place to discuss relevant topics that have not appeared in recent posts.</span></p></body></html>", "user": {"username": "RyanCarey"}}, {"_id": "5APWrFEkQYnYXH372", "title": "Meetup : Stanford Effective Altruism", "postedAt": "2014-11-16T08:38:01.872Z", "htmlBody": "<html><body><h2>Discussion article for the meetup : <a href=\"/meetups/1h\">Stanford Effective Altruism</a></h2>\n\t\t  <div>\n\t\t\t\t<p>\n\t\t    \t<strong>WHEN:</strong> \n\t\t    \t<span>16 November 2014 04:30:00AM (-0800)</span><br>\n\t\t\t\t</p>\n\t\t\t\t<p>\n\t\t    \t<strong>WHERE:</strong> \n\t\t    \t<span>Old Union, Stanford CA</span>\n\t\t\t\t</p>\n\t\t  </div><!-- .meta -->\n\t\t  <div>\n\t\t    <div><p>We&apos;re talking about measuring the impact of activism today!</p></div>\n\t\t  </div><!-- .content -->\n\t\t<h2>Discussion article for the meetup : <a href=\"/meetups/1h\">Stanford Effective Altruism</a></h2></body></html>", "user": {"username": "CarolineEllison"}}, {"_id": "pt3Y3EAzbEFkrpXr9", "title": "Happy Birthday, Giving What We Can!", "postedAt": "2014-11-15T23:39:28.899Z", "htmlBody": "<html><body><p><span><a href=\"https://www.givingwhatwecan.org/blog/2012-11-14/happy-birthday-giving-what-we-can\">Giving What We Can recently celebrated its 5th birthday</a>.</span> It&apos;s not much of a party if no-one external congratulates you, so here we go: Happy Birthday, GWWC!</p>\n<p>It&apos;s pretty impressive how much GWWC has grown since <a href=\"https://web.archive.org/web/20110129082754/http://www.givingwhatwecan.org/\"><span>those early days</span></a>. Here&apos;s a chart of total membership, which I&apos;ve put together from GWWC emails and liberal use of the internet archive. I&apos;m sure they have better data (without gaps!) internally, but I&apos;ve never seen this chart before. Notably, growth seems to have picked up since the fall of 2013. Did GWWC change their strategy at that point? (or their membership-counting-methodology?)</p>\n<p><a href=\"https://effectivereaction.files.wordpress.com/2014/11/gwwc-membership-linear.png\"><img src=\"https://effectivereaction.files.wordpress.com/2014/11/gwwc-membership-linear.png?w=300\" alt=\"Lines going up are always good\"></a></p>\n<p>Putting the same chart on a log scale, we can see that GWWC have actually done a reasonably good job of sustaining exponential growth.</p>\n<p><a href=\"https://effectivereaction.files.wordpress.com/2014/11/gwwc-membership-log.png\"><img src=\"https://effectivereaction.files.wordpress.com/2014/11/gwwc-membership-log.png?w=300\" alt=\"Lines that go up on a log scale are even better!\"></a></p>\n<p>Fitting a line of best fit to the chart, I estimate GWWC&apos;s membership is growing 73.1% a year. Assuming 2% population growth, it will take just 30.25 years before all the world&apos;s population are GWWC members. Taking over the world by the time I&apos;m 58 sounds like pretty good going!</p>\n<p>Happy Birthday, Giving What We Can!</p>\n<p><a href=\"https://effectivereaction.wordpress.com/2014/11/15/happy-5th-birthday-giving-what-we-can/\"><em>Cross-posted on my blog</em></a></p>\n<p><em>edit: formatting of links</em></p></body></html>", "user": {"username": "Dale"}}, {"_id": "yTu9pa9Po4hAuhETJ", "title": "Kidney donation is a reasonable choice for effective altruists and more should consider it", "postedAt": "2014-11-15T11:53:04.671Z", "htmlBody": "<html><body><div>\n<p><span><em>This article was written by Thomas Kelly and Josh Morrison<a href=\"#_ftn1\">[1]</a>, who asked me to format and post it on the Forum. It makes a detailed case which I&apos;d encourage people to read - it&apos;s made me seriously consider donating, since I hadn&apos;t realised the health costs were so low. People in the UK interested in donating can do so <a href=\"http://www.giveakidney.org/how-to-give/\">here</a>; people in the US can do so <a href=\"https://www.kidney.org/transplantation/livingdonors\">here</a>.&#xA0;</em></span></p>\n<p><span>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; This piece makes the argument that kidney donation is a reasonable choice for many effective altruists. For some relevant background information, I donated my kidney through the National Kidney Registry in September 2014. I&#x2019;m also the cofounder of <a href=\"http://www.waitlistzero.org\">Waitlist Zero</a>, a nonprofit that seeks to end the kidney shortage by promoting support for living kidney donors and increasing living donation rates. This is also going to be more relevant to potential donors within the United States as I understand more about kidney donation in this country. </span></p>\n<p><span>I encourage EAs who are considering kidney donation to talk with me or my co-founder <a href=\"mailto:josh@waitlistzero.org\">Josh</a> (also a kidney donor). We definitely understand it&#x2019;s not a choice for everyone, and we aren&#x2019;t interested in making a hard sell to become a donor. But we are interested in knowing what motivates people to consider donation, and we also have ideas on how to maximize the (significant) public awareness and political benefits of individual non-directed donations.</span></p>\n<p><span>&#xA0;</span></p>\n<p><strong><span>Table of Contents</span></strong></p>\n<p><strong><span>&#xA0;</span></strong></p>\n<p><strong><span>1.<span>&#xA0;&#xA0;&#xA0; </span></span></strong><strong><span>Summary</span></strong></p>\n<p><strong><span>2.<span>&#xA0;&#xA0;&#xA0; </span></span></strong><strong><span>Benefits</span></strong></p>\n<p><span>a.<span>&#xA0;&#xA0;&#xA0;&#xA0; </span></span><span>Direct Benefits of Kidney Donation</span></p>\n<p><span><span>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; </span>i.<span>&#xA0;&#xA0;&#xA0;&#xA0; </span></span><span>Benefits of an Individual Transplant</span></p>\n<p><span><span>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; </span>ii.<span>&#xA0;&#xA0;&#xA0;&#xA0; </span></span><span>Kidney Chains</span></p>\n<p><span>b.<span>&#xA0;&#xA0;&#xA0;&#xA0; </span></span><span>Indirect Benefits</span></p>\n<p><span><span>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; </span>i.<span>&#xA0;&#xA0;&#xA0;&#xA0; </span></span><span>Is Kidney Donation Contagious?</span></p>\n<p><span><span>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; </span>ii.<span>&#xA0;&#xA0;&#xA0;&#xA0; </span></span><span>Political Efficacy of Donor Support Movement</span></p>\n<p><strong><span>3.<span>&#xA0;&#xA0;&#xA0; </span></span></strong><strong><span>Costs</span></strong></p>\n<p><span>a.<span>&#xA0;&#xA0;&#xA0;&#xA0; </span></span><span>Surgical Discomfort, Inconvenience, and Risk of Complication</span></p>\n<p><span>b.<span>&#xA0;&#xA0;&#xA0;&#xA0; </span></span><span>Long-Term Risk</span></p>\n<p><span><span>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; </span>i.<span>&#xA0;&#xA0;&#xA0;&#xA0; </span></span><span>No Decrease in Life Expectancy</span></p>\n<p><span><span>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; </span>ii.<span>&#xA0;&#xA0;&#xA0;&#xA0; </span></span><span>Increased Risk of Kidney Failure</span></p>\n<p><span><span>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; </span>iii.<span>&#xA0;&#xA0;&#xA0;&#xA0; </span></span><span>Minor Long-Term Income Effect</span></p>\n<p><span>1.<span>&#xA0;&#xA0;&#xA0;&#xA0; </span></span><span>Financial Effect of Mortality Risk</span></p>\n<p><span>2.<span>&#xA0;&#xA0;&#xA0;&#xA0; </span></span><span>Financial Effect of ESRD Risk</span></p>\n<p><span>c.<span>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; </span></span><span>Immediate Financial Costs of Kidney Donation</span></p>\n<p><strong><span>4.<span>&#xA0;&#xA0;&#xA0; </span></span></strong><strong><span>How to Evaluate the Donation Choice as an Effective Altruist</span></strong></p>\n<p><span>a.<span>&#xA0;&#xA0;&#xA0;&#xA0; </span></span><span>How Does Donating Compare to Other EA Choices?</span></p>\n<p><span>b.<span>&#xA0;&#xA0;&#xA0;&#xA0; </span></span><span>Now vs. Later</span></p>\n<p><span>c.<span>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; </span></span><span>EA Identity and Movement Building</span></p>\n<p><strong><span>5.<span>&#xA0;&#xA0;&#xA0; </span></span></strong><strong><span>Conclusion</span></strong></p>\n<p><strong><span>&#xA0;</span></strong></p>\n<p><strong><span>&#xA0;</span></strong></p>\n<p><strong><span>&#xA0;</span></strong></p>\n<p><strong><span>&#xA0;</span></strong></p>\n<p><strong><span>Summary</span></strong></p>\n<p><span>&#xA0;</span></p>\n<p><span>The direct benefits of kidney donation are somewhat difficult to calculate, but our best estimate is an increase of about fourteen quality-adjusted life-years saved with an optimistic estimate of twenty QALYs and a pessimistic one of six. Significantly higher indirect gains may be possible by influencing others to donate and by advocating for policies that would end the transplant shortage, though these gains are more uncertain. </span></p>\n<p><span>&#xA0;</span></p>\n<p><span>Kidney donation is a significant but laparoscopic and broadly safe surgery with a hospital stay of a couple nights and a return to work within a few weeks. It does not decrease one&#x2019;s life expectancy and causes long-term harms in less than 1% of cases. If one does not have paid medical leave, the direct financial costs of lost wages may be significant.</span></p>\n<p><span>&#xA0;</span></p>\n<p><span>For a donor who doesn&apos;t forgo wages or pay significant travel expenses, the expected benefits to recipients are more than 100 times the expected costs to the donor (both calculated in QALYs).</span></p>\n<p><span>&#xA0;</span></p>\n<p><span>The decision to donate is broadly consistent with EA principles. Different EAs will give different weights to the inconvenience, discomfort, and health effects of donation, and comparisons to effectiveness of monetary donations are challenging. That said, depending on subjective valuation of costs, many EAs may find kidney donation&#x2019;s cost-effectiveness to be of a roughly similar order of magnitude to other EA interventions such as monetary donations to a GiveWell-recommended charity. </span></p>\n<p><span>&#xA0;</span></p>\n<p><strong><span>Benefits</span></strong></p>\n<p><span>&#xA0;</span></p>\n<p><strong><span>Direct Benefits of Kidney Donation</span></strong></p>\n<p><span>&#xA0;</span></p>\n<p><span>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; A kidney donor who gives to a stranger can cause multiple transplants. It is difficult to calculate the impact of each transplant, but it is clear they yield a significant number of life-years, with our best estimate as being about <strong><em>14 quality-adjusted life-years</em></strong>. </span></p>\n<p><strong><em><span>Benefits of an Individual Transplant</span></em></strong><em><span>: </span></em><span>A commonly used estimate from 2004 is that kidney recipients of a living donor can expect to receive an increase in 3.5 years of quality-adjusted life compared to remaining on dialysis.<a href=\"#_ftn2\"><span><span><span>[2]</span></span></span></a> While there is some definite uncertainty in this figure, <strong><em>our estimate would be something closer to ~8 QALYs/transplant</em></strong>. The difference is due largely to technological improvement, lags in the data, sampling bias, and incongruity with deceased donation results. </span></p>\n<p><strong><em><span>Our Estimate</span></em></strong><em><span>:</span></em><span> The half-life of a living donor transplant is 14.2 years.<a href=\"#_ftn3\"><span><span><span>[3]</span></span></span></a> Patients are generally medically eligible for transplant when they have a survival prognosis of about 5 years on dialysis.<a href=\"#_ftn4\"><span><span><span>[4]</span></span></span></a> If we were to take the experience of 60-64 year old patients as typical (since their median life expectancy on dialysis is 5.1 years), their average life-years gained per transplant though a transplant would be 8.9 (14.0-5.1).<a href=\"#_ftn5\"><span><span><span>[5]</span></span></span></a> &#xA0;The quality adjustment used in the Matas paper discounts a transplant year of life at 84% and a dialysis year of life at 68%, though we think that estimated difference might be conservative, since dialysis is very burdensome.<a href=\"#_ftn6\"><span><span><span>[6]</span></span></span></a> Using that discount, however, implies a <strong><em>QALY gain of 8.29 years</em></strong> (14.0*0.84-5.1*0.68).</span></p>\n<p><span>Given the difference between our calculations and the Matas figure, we&#x2019;ve tried to be conservative in our estimate. Nevertheless, we think there are good reasons for optimism. </span></p>\n<p><span>1.<span>&#xA0;&#xA0;&#xA0;&#xA0; </span></span><strong><em><span>Technological improvements</span></em></strong><span> have occurred in the past decade and are likely to be underrepresented in the data due to time lags in reporting. The Matas and Schnitzler 2004 figure relies on data from patients who were waitlisted or received transplants between 1995 and 1999,<a href=\"#_ftn7\"><span><span><span>[7]</span></span></span></a> when 5.7% of kidneys were reported to fail within a year of transplant.<a href=\"#_ftn8\"><span><span><span>[8]</span></span></span></a> Now 3.2% do.<a href=\"#_ftn9\"><span><span><span>[9]</span></span></span></a> The 14.2-year graft-survival figure is itself incomplete because it refers to kidneys transplanted in the late 1990s, and survival rates have been increasing since then. For example, 2013 figures reported that the percentage of transplants that fail within five years of transplantation fell to 15.4% from 17.5% in the previously reported year.<a href=\"#_ftn10\"><span><span><span>[10]</span></span></span></a> </span></p>\n<p><span>2.<span>&#xA0;&#xA0;&#xA0;&#xA0; </span></span><strong><em><span>Methodological Questions</span></em></strong><span>: The Matas figure only comes from recipients on Medicare, excluding healthier, wealthier recipients with private insurance who likely live longer. &#xA0;Note that the Matas figures also discount QALYs by 5% annually.</span></p>\n<p><span>3.<span>&#xA0;&#xA0;&#xA0;&#xA0; </span></span><strong><em><span>Kidney Exchange Chains</span></em></strong><span>: If you donate to start a chain (see below), your transplant may last longer: 3 year graft survival rates are about 1.5 percentage points higher in chains than in average living donor transplants,<a href=\"#_ftn11\"><span><span><span>[11]</span></span></span></a> which makes sense since chains are able to deliver higher quality matches. </span></p>\n<p><span>4.<span>&#xA0;&#xA0;&#xA0;&#xA0; </span></span><strong><em><span>Deceased Donor Estimates:</span></em></strong><span> It is hard to reconcile estimates of deceased donor impact with QALY estimates as low as 3.5. Living donor kidneys last about 1.5-1.7 times as long as deceased donor kidneys.<a href=\"#_ftn12\"><span><span><span>[12]</span></span></span></a> Estimates of deceased donor impact between 1999 and 2011 have given a range of 2-10 years with an unweighted average across studies of 4.31 years gained.<a href=\"#_ftn13\"><span><span><span>[13]</span></span></span></a></span></p>\n<p><span>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; </span></p>\n<p><strong><em><span>Kidney Chains: </span></em></strong><span>A non-directed kidney donor can usually facilitate more than one patient by facilitating chains of paired kidney exchange (exchanges between incompatible donor-recipient pairs).<a href=\"#_ftn14\"><span><span><span>[14]</span></span></span></a> These chains of donation include a mean of 4.6 transplants,<a href=\"#_ftn15\"><span><span><span>[15]</span></span></span></a> though the longest on record led to thirty-six transplants.<a href=\"#_ftn16\"><span><span><span>[16]</span></span></span></a> That said, it is not correct to think of one non-directed donor as being the but-for cause of every transplant in the chain&#x2014;an easy-to-match pair in the matching pool will likely become a part of some chain within a few months. Hard-to-match pairs are more difficult to calculate &#x2013; some patients can only match with less than 1% of the population. Generally, chains alternate between easy-to-match and hard-to-match pairs. Donors with O blood type start significantly longer chains. Roughly guessing, we expect participating in a chain to cause 1.5-2 transplants that would not have otherwise occurred.</span></p>\n<p><span>&#xA0;</span></p>\n<p><span>Combining our estimates, we&apos;d guess that donating to start a chain leads to ~14 QALYs, though there is substantial uncertainty around the right figure to use with a range of 7-20 seeming realistic. </span></p>\n<p><span>&#xA0;</span></p>\n<p><strong><span>Indirect Benefits</span></strong></p>\n<p><span>&#xA0;</span></p>\n<p><span>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; <strong><em>Is Kidney Donation Contagious? </em></strong>It&#x2019;s possible that your living donation will persuade others to donate. If I hadn&#x2019;t read stories about other people donating, I doubt I would have. Other non-directed donors I know have reported people they know personally deciding to donate in part due to hearing their stories. </span></p>\n<p><span>Non-directed kidney donation has grown substantially over the last few years.<a href=\"#_ftn17\"><span><span><span>[17]</span></span></span></a> However, a sizeable fraction of this increase may be attributed to a coordinated effort to encourage Orthodox Jews to become non-directed donors to other Orthodox Jews.<a href=\"#_ftn18\"><span><span><span>[18]</span></span></span></a> </span></p>\n<p><span>&#xA0;</span></p>\n<p><span>&#xA0;</span></p>\n<table>\n<tbody>\n<tr>\n<td colspan=\"2\">\n<p><span>Kidney Donations to Strangers Per Year in US<a href=\"#_ftn19\"><span><span><span>[19]</span></span></span></a></span></p>\n</td>\n</tr>\n<tr>\n<td>\n<p><span>2008</span></p>\n</td>\n<td>\n<p><span>179</span></p>\n</td>\n</tr>\n<tr>\n<td>\n<p><span>2009</span></p>\n</td>\n<td>\n<p><span>240</span></p>\n</td>\n</tr>\n<tr>\n<td>\n<p><span>2010</span></p>\n</td>\n<td>\n<p><span>294</span></p>\n</td>\n</tr>\n<tr>\n<td>\n<p><span>2011</span></p>\n</td>\n<td>\n<p><span>272</span></p>\n</td>\n</tr>\n<tr>\n<td>\n<p><span>2012</span></p>\n</td>\n<td>\n<p><span>354</span></p>\n</td>\n</tr>\n</tbody>\n</table>\n<p><span>&#xA0;</span></p>\n<p><span>In England, since 2009 when their transplant system began allowing non-directed donation and a small non-profit began publicly raising awareness, such donations increased from 0 to 10% of all living donation, compared to 3% in the U.S.<a href=\"#_ftn20\"><span><span><span>[20]</span></span></span></a></span></p>\n<p><span>It is obviously difficult to estimate the probability distribution, but for an effective altruist who is reasonably open about their donation (e.g. perhaps talking to friends and colleagues about it privately or writing for a public venue), I think it&apos;s fairly likely that you would eventually convince someone else to donate. </span></p>\n<p><strong><em><span>Political Efficacy of Donor Support Movement</span></em></strong><span>: Non-directed kidney donors have a powerful story and unique moral authority for advocating political change for the transplant system. Policy measures exist that would end the transplant shortage and reduce government healthcare spending by providing support to donors (such as health insurance or an annuity) sufficient to clear the shortage between need and availability. Each year about 20K more people are added to the waitlist than receive a transplant,<a href=\"#_ftn21\"><span><span><span>[21]</span></span></span></a> which means ending the shortage through living donation would save ~160K QALYs/yr. It is difficult to quantify one&#x2019;s political impact, but for EAs who think this cause is worthwhile, donation should be more compelling. </span></p>\n<p><span>&#xA0;</span></p>\n<p><strong><span>Costs</span></strong></p>\n<p><span>&#xA0;</span></p>\n<p><em><span>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; <strong>Surgical Discomfort, Inconvenience, and Risk of Complication</strong></span></em><strong><span>: </span></strong><span>Kidney donation is a laparoscopic surgery that typically necessitates a typical hospital say of two nights, prescription painkiller usage of about 5-8 days, and a return to deskwork within 2-4 weeks. For donors who do not have high blood pressure, the chance of death during surgery is about 1.3/10,000<a href=\"#_ftn22\"><span><span><span>[22]</span></span></span></a> &#x2013; about the same as in childbirth. For donors taken as a whole, it&apos;s 3.1/10,000.<a href=\"#_ftn23\"><span><span><span>[23]</span></span></span></a> Short-term complications affect about 2-5% of donors and typically involve things like wound infections.<a href=\"#_ftn24\"><span><span><span>[24]</span></span></span></a></span></p>\n<p><span>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; The total QALY costs of this discomfort and risk are not large. The undiscounted QALY cost of a 3.1/10,000 risk to a person with 60 remaining years of perfect-quality life is 0.019 QALYs (roughly equivalent to a week of full value life). I haven&apos;t investigated the disability weights that should be applied, but assuming that a donor gets no value from their time in the hospital, half value from the following week, and &#xBE; value from the following 4 weeks before returning to full health, the total &quot;QALY cost&quot; of the operation, hospital stay, and recovery period is &lt;2 weeks. Combining the risk of death and the hospitalization and recovery period, we get costs of ~0.06 QALYs for donating.</span></p>\n<p><span>At face value, this may seem surprisingly low &#x2013; donating a kidney is only as bad as giving up 3 weeks of life? Upon reflection, though, this makes sense &#x2013; donors are able to return to work and most everyday activities within 4 weeks, and run only a <em>very </em>small risk of death. </span></p>\n<p><span>Note that the above assumes incurring zero utility from donating, but that&#x2019;s unlikely. Donors may have many positive experiences (e.g. reading, spending time with friends or family, developing interesting stories) during those 4 weeks and should expect a feeling of pride in the tangible and public accomplishment of donation even above what might be likely from a more abstractly-experienced financial gift. &#xA0;&#xA0;</span></p>\n<p><span>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; Most of the costs that prevent people from donating in practice seem to be psychological ones (i.e. fear) rather than these literal incapacitation costs. Of course, these will vary across potential donors, and effective altruists may be particularly well-disposed to take them on. </span></p>\n<p><strong><span>&#xA0;</span></strong></p>\n<p><strong><span>Long-Term Risk</span></strong></p>\n<p><strong><span>&#xA0;</span></strong></p>\n<p><span>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; No credible studies have demonstrated that kidney donation decreases life expectancy. However, it does increase the risk of kidney failure. The best data currently indicates that long-term medical harms affect less than 1% of donors. </span></p>\n<p><span>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; <strong><em>No Decrease in Life Expectancy</em>: </strong>Kidney donation has not been shown to measurably decrease long-term life expectancy.<a href=\"#_ftn25\"><span><span><span>[25]</span></span></span></a> Donors live longer than the general population because they are healthier to start with.<a href=\"#_ftn26\"><span><span><span>[26]</span></span></span></a> The remaining kidney grows after surgery to accommodate the function of the previous kidney, and chronic kidney disease tends to impact both kidneys equally. A study of World War II soldiers who suffered a traumatic injury that destroyed one kidney found them to have similar health outcomes to two-kidney&#x2019;d soldier controls.<a href=\"#_ftn27\"><span><span><span>[27]</span></span></span></a> </span></p>\n<p><strong><em><span>Increased Risk of Kidney Failure</span></em></strong><span>: The average American has a lifetime risk of kidney failure of 3.2%. Kidney donors must have very good kidney function pre-surgery, so their lifetime risk (if they do not donate) is about 0.14%. A 2014 study indicates that people who donate have a 0.9% lifetime chance of developing kidney failure.<a href=\"#_ftn28\"><span><span><span>[28]</span></span></span></a> </span></p>\n<p><span>The risk of kidney failure mounts over time and the risk of developing ESRD during one&#x2019;s working years are much lower. At age 50, only 0.28% of living donors had experience kidney failure.<a href=\"#_ftn29\"><span><span><span>[29]</span></span></span></a> As such the expected loss of income due to ESRD is very low. Kidney failure is typically the outcome of decades of degenerative kidney disease (in about half of cases this is caused by obesity and/or diabetes, so about half the risk is controllable by diet and exercise). Donating one&#x2019;s kidney likely does not increase the chance of that chronic kidney disease; instead, donating reduces one&#x2019;s total kidney function to about 70% of where it was before. Only donors with excellent kidney function are allowed to donate, so this does not typically have any health impacts. However, for those who develop chronic kidney disease in the future (a small number), donating reduces somewhat the buffer of excess function before chronic kidney disease leads to kidney failure.<a href=\"#_ftn30\"><span><span><span>[30]</span></span></span></a> </span></p>\n<p><span>There are several challenges to calculating long-term risk of living kidney donation. The first is that ESRD takes so long to develop. Given the medical advances in kidney donation, such as the switch to a laparoscopic procedure, it&#x2019;s possible that long-term risks of donation have diminished for current donors but have not yet showed up in the data. That said, the long progression of kidney disease may also imply that studies will tend to underestimate the failure effect due to limitations in follow-up duration,<a href=\"#_ftn31\"><span><span><span>[31]</span></span></span></a> and there may be significant uncertainty about health impact (trying to extrapolate to health effects thirty to fifty years in the future is very difficult). Finally, the significant majority of donors give to relatives making it possible that these related donors are actually at greater risk than unrelated donors<a href=\"#_ftn32\"><span><span><span>[32]</span></span></span></a> (and because of transplant center selection criteria, non-directed donors are likely to be healthier to start with than the average donor).</span></p>\n<p><span>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; While kidney failure for living donors remains tragic, living donors receive significant priority on the organ waitlist and are thus much more likely to receive a kidney transplant of their own.<a href=\"#_ftn33\"><span><span><span>[33]</span></span></span></a></span></p>\n<p><span>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; Moreover, it seems appropriate to believe technological innovations like artificial organs are likely on a multi-decade timescale,<a href=\"#_ftn34\"><span><span><span>[34]</span></span></span></a> significantly reducing the expected costs of risking ESRD in middle or old age. Based on this consideration (along with fact that living donors receive priority on the waitlist), I&apos;m inclined to significantly discount the potential long-term negative health effects for donors who are young and healthy today.</span></p>\n<p><span>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; A 1% risk of developing kidney failure in 30 years has a relatively limited QALY impact even if not discounted for technological improvement. If the average patient develops kidney failure at 65, and the average donor receives a transplant, they should expect to live about 11 years with a disability weight of 0.84, compared to about 15.5 for Americans without ESRD, yielding a total estimated QALY cost of 0.063<a href=\"#_ftn35\"><span><span><span>[35]</span></span></span></a> or about three weeks. Nearly any positive discount rate would reduce that cost (30 years in the future) substantially.</span></p>\n<p><span>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; <strong><em>Minor</em></strong><em> <strong>Long-Term Income Effects</strong></em>: One argument that&#x2019;s been made is that kidney donation could be on some level self-defeating from an EA standpoint because it reduces your long-term giving by an amount with greater impact than your donation. We disagree strongly with this position, and think the best estimate of long-term income loss is something less than ~$150. </span></p>\n<p><span>&#xB7;<span>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; </span></span><strong><em><span>Financial Effect of Mortality Risk: </span></em></strong><span>If you donate $10K per year and have 40 years of remaining working life, the risk of death in surgery would reduce your donations by only an expected $120. Risks to income from potential kidney failure are unlikely because of evolving technology, but even if they occurred, they&apos;re likely to become an issue near retirement.</span></p>\n<p><span>&#xB7;<span>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; </span></span><strong><em><span>Financial Effect of ESRD Risk: </span></em></strong><span>Long-term income effects of ESRD risk are likely negligible. Here&#x2019;s a quick back-of-the-envelop calculation to demonstrate. Say there is a 1% risk of kidney failure, and 50% chances each of retirement, technological improvement, ability to receive a transplant, and defection from the EA cause (each conservative estimates). Say that if none of those conditions holds one would lose $250K in charitable donations thirty years from now. This means that the expected loss will be $156.25 (250,000*.01*.5*.5*.5*.5) in 2044, but this figure needs to be discounted to net present value to be compared to a choice today. If you invest a dollar today at 5% annual compounding interest, in thirty years, it would be worth $4.32. Thus, the long-term income loss expected from kidney donation would be equivalent to paying $36.17 (156.25/4.32) today. </span></p>\n<p><span>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; </span></p>\n<p><strong><span>Immediate Financial Costs of Kidney Donation</span></strong></p>\n<p><span>&#xA0;</span></p>\n<p><span>The costs of surgery and of any complications from surgery are covered by the recipient&#x2019;s insurance (usually Medicare). However, financial costs you incur in donating (such as lost wages if you don&#x2019;t have paid medical leave) are typically borne by the donor. In the United States, there is no federal law requiring paid leave for organ donors. However, federal employees receive paid leave, as do employees in many states and employees of companies with generous benefits in other states.<a href=\"#_ftn36\"><span><span><span>[36]</span></span></span></a> The cost of donation for donors who do not receive paid leave is of course substantial. The other major cost of donation is travel, which is reimbursed by the National Living Donor Assistance Center for any donor whose recipient makes under 300% of the US poverty line, and is also under 300% of the poverty line.<a href=\"#_ftn37\"><span><span><span>[37]</span></span></span></a> The National Kidney Registry also reimburses all costs for donors who donate to start chains.</span></p>\n<p><span>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; There are meaningful costs that are not reimbursed in the United States. Homemakers who donate do not receive any money to pay for childcare, eldercare, or chores they cannot complete. In addition, there is no compensation for the pain or discomfort of the process.</span></p>\n<p><span>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; For full-time employees with paid leave, the financial costs of living donation are greatly ameliorated.</span></p>\n<p><span>&#xA0;</span></p>\n<p><strong><span>How to Evaluate the Donation Choice as an Effective Altruist</span></strong></p>\n<p><span>&#xA0;</span></p>\n<p><span>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; The choice to donate a kidney to a stranger clearly has a powerful positive health effect to the recipients that is at least an order of magnitude larger than the cost to the donor. It fits effective altruist principles by being a gift that is significant to the donor and has a measurable and highly positive impact. This does not by any means imply that donating is the right decision for all (or even most) effective altruists since different people will value the costs of having surgery differently. </span></p>\n<p><strong><em><span>How Does Donating Compare to Other EA Choices</span></em></strong><span>? Donating a kidney is similar in direct impact to, but on the lower end of, other EA choices like giving money to a GiveWell recommended charity. Donating a kidney gets ~14 QALYs at a cost of something on the order of ~0.1 QALYs. If you can give a month of your life to extend someone else&apos;s by 14 years, that seems to be a good decision and one where a small sacrifice yields a significant gain for others. Believing that donating will encourage others to do so or that the returns to political advocacy are high could easily double these expected returns.</span></p>\n<p><span>GiveWell estimates the cost-per life saved for their top charities as ~$3-5K.<a href=\"#_ftn38\"><span><span><span>[38]</span></span></span></a> Assuming a healthy 50 year lifespan for those who are saved, this works out to $60-$100/DALY. GiveWell cautions not to take these cost-estimates literally, due to significant uncertainty around them.<a href=\"#_ftn39\"><span><span><span>[39]</span></span></span></a></span></p>\n<p><span>A possible EA critique to kidney donation is to say that, &quot;If donating a kidney will save ~14 QALYs and a developing world DALY only costs ~$100 to save, then donating a kidney is only worth $1,400 in donations.&quot; We think there is something true and important in this argument, and we wouldn&apos;t encourage someone to donate a kidney if it meant they would forego significant donations to GiveWell&apos;s top charities. But we don&#x2019;t see why that should be the case, since giving a kidney is a complement to and not a replacement for monetary donation. </span></p>\n<p><span>Put somewhat differently, &quot;donating a kidney is only worth $1,400 in donations&quot; takes our failure to donate the maximum we could and uses it to avoid orthogonal actions that would be extremely net beneficial but don&apos;t necessarily quite reach the benefit-cost threshold we&apos;ve set for our financial donations.<a href=\"#_ftn40\"><span><span><span>[40]</span></span></span></a> This would also imply an incorrect fungibility between moral choices and is a principle that could lead to worse behavior in the long-run (i.e. constantly forgoing positive-utility actions whose gains are not the same as charitable donations with the best expected value). </span></p>\n<p><span>Donation may also have benefits personal to the donor, indirect to other transplant recipients, and supportive to the EA cause that are not accounted for in its direct QALY figure, and giving through non-financial donation may also be a useful diversification strategy for one&#x2019;s altruism. </span></p>\n<p><em><span>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; <strong>Now vs. Later</strong></span></em><span>: If one intends to donate a kidney, donating now is significantly more effective than donating much later. Currently, the transplant shortage is serious, but future policy or technological change could greatly decrease the marginal benefit of kidney donation. That same change could cause a donation today to be a bridge for the recipient into a period with significantly decreased mortality for kidney failure that they would not otherwise have survived to. Opportunity to influence future donors and the political system are likely also higher now than later. </span></p>\n<p><span>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; From a risk perspective, donating when young is inferior to donating when old, because younger donors do not have as much information on future health conditions as older donors (i.e. a 50 year-old without chronic kidney disease will almost certainly never develop it, but a 25 year-old still could). For either group, the absolute risk of kidney failure is still small and less than that of the general population. However, we note that donors who are currently young are more likely to benefit from future advances in technology (such as artificial organs) that reduce the expected costs of donation.</span></p>\n<p><strong><em><span>EA Identity and Movement Building</span></em></strong><span>: One concern that has been expressed is that, since kidney donation is an unusual and serious choice, donation can marginally pull the EA movement away from the mainstream. This concern comes from a model of successful social movements as incremental and moderate.</span></p>\n<p><span>A different model finds movements do better when they are dramatic, salient, and compelling. Kidney donation is a very admired choice with clear and identifiable beneficiaries. It is a visible choice and attractive narrative that demonstrates significantly stronger commitment than a non-binding pledge to donate money in the future. It also may open opportunities for a broader discussion of EA principles. The more EAs save the lives of identifiable strangers, the more notice the movement gets and the better it looks.</span></p>\n<p><span>Additionally, much of the EA movement to date&#x2014; GiveWell, Giving What We Can, and the earning to give discussion at 80,000 Hours&#x2014;has focused on money as the core resource we have to allocate. We don&apos;t disagree that decisions about money are important, but we think that the EA movement will be stronger and more compelling to newcomers if it can offer a broader variety of ways to make the world a better place. Kidney donation should very much be considered as one of those activities.</span></p>\n<p><strong><span>&#xA0;</span></strong></p>\n<p><strong><span>Conclusion</span></strong></p>\n<p><span>&#xA0;</span></p>\n<p><span>Kidney donation confers direct benefits to recipients that clearly exceed the cost to the donor by a large factor (more than a hundred, according to our estimate). It is a tangible choice to significantly and publicly affirm one&#x2019;s commitment as an effective altruist. For many effective altruists, kidney donation is a good choice, and as someone who identifies as an Effective Altruist, I&#x2019;m glad I donated.</span></p>\n<p><span>&#xA0;</span></p>\n</div>\n<div><br> \n<hr>\n<div>\n<p><a href=\"#_ftnref1\"><span><span><span><span>[1]</span></span></span></span></a><span> </span><span>Thanks to Josh Morrison for helping write this and to Ryan Carey, Howie Lempel,</span><span> </span><span>and Alexander Berger for reviewing it. All mistakes are Josh and my own</span><span>. </span></p>\n</div>\n<div>\n<p><a href=\"#_ftnref2\"><span><span><span><span>[2]</span></span></span></span></a><span> </span><span><a href=\"http://onlinelibrary.wiley.com/doi/10.1046/j.1600-6143.2003.00290.x/full\"><span>Matas and Schnitzler</span></a></span><span> (AJT). See also </span><span><a href=\"http://transplantpolicy.org/2014/03/the-problem/\"><span>The Problem</span></a></span><span><span>. See generally </span></span><span><a href=\"http://www.kidneyregistry.org/living_donors.php#recipient_benefits\"><span>National Kidney Registry, Living Donors</span></a></span></p>\n</div>\n<div>\n<p><a href=\"#_ftnref3\"><span><span><span><span>[3]</span></span></span></span></a><span> </span><span><a href=\"http://srtr.transplant.hrsa.gov/annual_reports/2012/pdf/01_kidney_13.pdf\"><span>2012 OPTN Annual Report</span></a></span><span>, figure 6.7. See </span><span><a href=\"http://srtr.transplant.hrsa.gov/annual_reports/2012/pdf/01_kidney_13.pdf\"><span>2012 Kidney Data</span></a></span><span> for the exact figure. If you remove from consideration patients who died for reasons unrelated to graft failure, the half-life of a living donor graft that survives past the first year post-surgery is 26.6 years.<sup> </sup></span><span><a href=\"http://srtr.transplant.hrsa.gov/annual_reports/2010/pdf/01_kidney_11.pdf\"><span>OPTN Annual Report 2010</span></a></span></p>\n</div>\n<div>\n<p><a href=\"#_ftnref4\"><span><span><span><span>[4]</span></span></span></span></a><span> See </span><span><a href=\"http://www.ncbi.nlm.nih.gov/pubmed/17979999\"><span>Schold, AJT</span></a></span><span>.</span></p>\n</div>\n<div>\n<p><a href=\"#_ftnref5\"><span><span><span><span>[5]</span></span></span></span></a><span> &#xA0;</span><span><a href=\"http://www.usrds.org/2013/pdf/v2_ch5_13.pdf\"><span>2013 USRDS, p. 266</span></a></span><span>. For comparison, the difference in life expectancy between 45-49 year olds on dialysis (8.3 years) and receiving a transplant (22.8 years) is 14.5 years. Id. These figures include living and deceased transplants and are thus likely to undercount the impact of a living donor.</span></p>\n</div>\n<div>\n<p><a href=\"#_ftnref6\"><span><span><span><span>[6]</span></span></span></span></a><span> </span><span>Dialysis involves several, uncomfortable treatments several times per week and leaves 80% of patients unable to work, whereas transplant patients can live a fairly normal life. It also has a very high rate of complication compared to transplant. &#x201C;Adjusted rates of all-cause mortality are 6.5&#x2013;7.9 times greater for dialysis patients than for individuals in the general population. For renal transplant patients, rates approach those of the general population, yet remain 1.0&#x2013;1.5 times higher.&#x201D; Id. To use a specific example, &#x201C;<span>female dialysis patients in their 30s, 40s, and 50s &#x2026; are expected to live just one-fourth as long as their counterparts without ESRD. Transplant patients fare better, with expected remaining lifetimes 75&#x2013;80 percent as long as those in the general popula&#xAD;tion.&#x201D; Id.</span> </span></p>\n</div>\n<div>\n<p><a href=\"#_ftnref7\"><span><span><span><span>[7]</span></span></span></span></a><span> Survival rates are projected forward from mortality rates in early years.</span></p>\n</div>\n<div>\n<p><a href=\"#_ftnref8\"><span><span><span><span>[8]</span></span></span></span></a><span> </span><span><a href=\"http://onlinelibrary.wiley.com/doi/10.1046/j.1600-6143.2003.00290.x/full\"><span>Matas and Schnitzler</span></a></span><span> (AJT), pg 218.</span></p>\n</div>\n<div>\n<p><a href=\"#_ftnref9\"><span><span><span><span>[9]</span></span></span></span></a><span> </span><span><a href=\"http://www.usrds.org/2013/pdf/v2_ch7_13.pdf\"><span>2013 USRDS, p. 284</span></a></span></p>\n</div>\n<div>\n<p><a href=\"#_ftnref10\"><span><span><span><span>[10]</span></span></span></span></a><span> </span><span><a href=\"http://www.usrds.org/2013/pdf/v2_ch7_13.pdf\"><span>2013 USRDS, p. 284</span></a></span></p>\n</div>\n<div>\n<p><a href=\"#_ftnref11\"><span><span><span><span>[11]</span></span></span></span></a><span> http://www.kidneyregistry.org/pages/p308/NKRQuarterlyReport3rdQuarter.php</span></p>\n</div>\n<div>\n<p><a href=\"#_ftnref12\"><span><span><span><span>[12]</span></span></span></span></a><span> See </span><span><a href=\"http://srtr.transplant.hrsa.gov/annual_reports/2010/pdf/01_kidney_11.pdf\"><span>OPTN Annual Report 2010</span></a></span><span>; </span></p>\n</div>\n<div>\n<p><a href=\"#_ftnref13\"><span><span><span><span>[13]</span></span></span></span></a><span> See </span><span><a href=\"http://transplantpolicy.org/2014/03/the-problem/\"><span>The Problem</span></a></span><span><span> for a list of these studies.</span></span></p>\n</div>\n<div>\n<p><a href=\"#_ftnref14\"><span><span><span><span>[14]</span></span></span></span></a><span> </span><span><a href=\"https://www2.bc.edu/~unver/research/nejm-paper.pdf\"><span>Rees, NEJM</span></a></span><span>.&#xA0; </span></p>\n</div>\n<div>\n<p><a href=\"#_ftnref15\"><span><span><span><span>[15]</span></span></span></span></a><span> </span><span><a href=\"http://www.kidneyregistry.org/pages/p308/NKRQuarterlyReport3rdQuarter.php\"><span>NKR Quarterly Report 2014Q3</span></a></span><span>. The NKR is the largest kidney exchange network.</span></p>\n</div>\n<div>\n<p><a href=\"#_ftnref16\"><span><span><span><span>[16]</span></span></span></span></a><span> </span><span><a href=\"http://www.nytimes.com/interactive/2012/02/18/health/record-chain-of-kidney-transplants.html?_r=0\"><span>A Record Chain of Kidney Transplants, NY Times</span></a></span></p>\n</div>\n<div>\n<p><a href=\"#_ftnref17\"><span><span><span><span>[17]</span></span></span></span></a><span> </span><span><a href=\"http://srtr.transplant.hrsa.gov/annual_reports/2012/\"><span>OPTN Annual Report 2012</span></a></span></p>\n</div>\n<div>\n<p><a href=\"#_ftnref18\"><span><span><span><span>[18]</span></span></span></span></a><span> </span><span><a href=\"http://www.life-renewal.org\"><span>Renewal website</span></a></span></p>\n</div>\n<div>\n<p><a href=\"#_ftnref19\"><span><span><span><span>[19]</span></span></span></span></a><span> </span><span>OPTN Annual Report 2012</span></p>\n</div>\n<div>\n<p><a href=\"#_ftnref20\"><span><span><span><span>[20]</span></span></span></span></a><span> </span><span><a href=\"https://www.organdonation.nhs.uk/statistics/transplant_activity_report/current_activity_reports/ukt/kidney_activity.pdf\"><span>Kidney Activity</span></a></span></p>\n</div>\n<div>\n<p><a href=\"#_ftnref21\"><span><span><span><span>[21]</span></span></span></span></a><span> See </span><span><a href=\"http://optn.transplant.hrsa.gov/converge/latestData/step2.asp\"><span>Organ Transplantation and Procurement Network, National Data</span></a></span></p>\n</div>\n<div>\n<p><a href=\"#_ftnref22\"><span><span><span><span>[22]</span></span></span></span></a><span> </span><span><a href=\"http://phdres.caregate.net/jclub-articles/Tobey.060810.pdf\"><span>Segev, JAMA (2010).</span></a></span></p>\n</div>\n<div>\n<p><a href=\"#_ftnref23\"><span><span><span><span>[23]</span></span></span></span></a><span> </span><span><a href=\"http://phdres.caregate.net/jclub-articles/Tobey.060810.pdf\"><span>Id.</span></a></span></p>\n</div>\n<div>\n<p><a href=\"#_ftnref24\"><span><span><span><span>[24]</span></span></span></span></a><span> 2012 OPTN Annual Data Report</span></p>\n</div>\n<div>\n<p><a href=\"#_ftnref25\"><span><span><span><span>[25]</span></span></span></span></a><span> <span>Id.</span> See also </span><span><a href=\"http://www.nejm.org/doi/full/10.1056/NEJMoa0804883\"><span>Ibrahim, NEJM</span></a></span><span> and generally </span><span><a href=\"http://www.ncbi.nlm.nih.gov/pubmed/24519297\"><span>Muzaale, JAMA</span></a></span><span> (2014). Note that a 2014 study indicated more serious health risks (</span><span><a href=\"http://www.nature.com/ki/journal/v86/n1/abs/ki2013460a.html\"><span>Mjoen, 2013</span></a></span><span><span>)</span></span><span>. But this piece had serious methodological problems-- for example, the mean age of the control group was 37.6 compared to 46.0 for the donors, and the study did not have BMI data for much of the control group. See </span><span><a href=\"http://www.nature.com/ki/journal/v86/n1/full/ki2013560a.html\"><span>Boudville, Kidney International</span></a></span><span> and </span><span><a href=\"http://onlinelibrary.wiley.com/doi/10.1111/ajt.12804/full\"><span>Kaplan, AJT</span></a></span><span> for some of the limitations with the Mjoen piece.</span></p>\n</div>\n<div>\n<p><a href=\"#_ftnref26\"><span><span><span><span>[26]</span></span></span></span></a><span> </span><span><a href=\"http://www.ncbi.nlm.nih.gov/pubmed/9381544\"><span>Kidney Donors Live Longer</span></a></span></p>\n</div>\n<div>\n<p><a href=\"#_ftnref27\"><span><span><span><span>[27]</span></span></span></span></a><span> </span><span><a href=\"http://www.nature.com/ki/journal/v43/n5/abs/ki1993156a.html\"><span>Narkun-Burgess, Kidney International</span></a></span></p>\n</div>\n<div>\n<p><a href=\"#_ftnref28\"><span><span><span><span>[28]</span></span></span></span></a><span> </span><span><a href=\"http://www.ncbi.nlm.nih.gov/pubmed/24519297\"><span>Muzaale, JAMA</span></a></span><span> (2014). See </span><span><a href=\"http://jama.jamanetwork.com/article.aspx?articleid=1829665\"><span>Gill, JAMA (2014)</span></a></span><span>, </span><span><a href=\"http://www.ajkd.org/article/S0272-6386(14)00738-0/pdf\"><span>Kasiske, AJKD</span></a></span><span>, and </span><span><a href=\"http://onlinelibrary.wiley.com/store/10.1111/ajt.12861/asset/ajt12861.pdf?v=1&amp;t=i27ldsmn&amp;s=667bd361da7e8ab5e84ceaaaf11b553b27c38c54\"><span>Allegretti, AJT</span></a></span><span> for critiques and commentary of the Muzaale piece. Kidney donation also increases the risk of </span><span><a href=\"http://en.wikipedia.org/wiki/Pre-eclampsia#Differential_diagnosis\"><span>preeclampsia</span></a></span><span> (a disorder of pregnancy characterized by&#xA0;</span><span><a title=\"Hypertension\" href=\"http://en.wikipedia.org/wiki/Hypertension\"><span>high blood pressure</span></a></span><span>&#xA0;and large amounts of&#xA0;</span><span><a title=\"Proteinuria\" href=\"http://en.wikipedia.org/wiki/Proteinuria\"><span>protein in the urine</span></a></span><span>.) by 5-6%. </span><span><a href=\"http://www.ncbi.nlm.nih.gov/pmc/articles/PMC2747242/\"><span>Ibrahim, AJT, 2009</span></a></span><span>. See also </span><span><a href=\"http://www.myast.org/blog/risks-of-living-donor\"><span>Potential Risks for Kidney Donation</span></a></span><span> for a general overview on risk of donation. </span></p>\n</div>\n<div>\n<p><a href=\"#_ftnref29\"><span><span><span><span>[29]</span></span></span></span></a><span> Muzaale, JAMA (2014)</span></p>\n</div>\n<div>\n<p><a href=\"#_ftnref30\"><span><span><span><span>[30]</span></span></span></span></a><span> </span><span><a href=\"http://www.ncbi.nlm.nih.gov/pubmed/24612746\"><span>Steiner, AJT</span></a></span><span> </span></p>\n</div>\n<div>\n<p><a href=\"#_ftnref31\"><span><span><span><span>[31]</span></span></span></span></a><span> Id.</span></p>\n</div>\n<div>\n<p><a href=\"#_ftnref32\"><span><span><span><span>[32]</span></span></span></span></a><span> The 2014 Muzaale study found the risk of related donors developing ESRD within 15 years was 34.1/10,000 as compared to 15.1/10,000 in unrelated donors, but this result was not statistically significant. </span></p>\n</div>\n<div>\n<p><a href=\"#_ftnref33\"><span><span><span><span>[33]</span></span></span></span></a><span> </span><span><a href=\"http://optn.transplant.hrsa.gov/converge/ContentDocuments/KAS_FAQs.pdf\"><span>OPTN FAQ</span></a></span></p>\n</div>\n<div>\n<p><a href=\"#_ftnref34\"><span><span><span><span>[34]</span></span></span></span></a><span> Discussed in </span><span><a href=\"http://www.sciencemag.org/content/338/6109/899.full.pdf\"><span>Lavine, Science</span></a></span><span>, </span><span><a href=\"http://www.nytimes.com/2013/08/20/science/next-out-of-the-printer-living-tissue.html?_r=0&amp;adxnnl=1&amp;pagewanted=all&amp;adxnnlx=1415369429-30uBK/Qc249VX40/nQL45Q\"><span>Fountain, NY Times</span></a></span><span>, and </span><span><a href=\"http://3dprint.com/3617/3d-printed-artificial-kidneys/\"><span>Krassenstein, 3D Printing News</span></a></span><span>. UCSF is also trying to develop an implantable miniaturized dialysis machine. </span><span><a href=\"http://www.ucsf.edu/news/2013/03/13699/artificial-kidney-holds-promise-vast-majority-dialysis\"><span>UCSF, 2013</span></a></span><span> and </span><span><a href=\"http://www.mercurynews.com/ci_23098487/artificial-kidney-offers-hope-patients-tethered-dialysis-machine\"><span>Kleffman, San Jose Mercury News</span></a></span><span>.</span></p>\n</div>\n<div>\n<p><a href=\"#_ftnref35\"><span><span><span><span>[35]</span></span></span></span></a><span> (15.5-11*0.84)*0.01</span></p>\n</div>\n<div>\n<p><a href=\"#_ftnref36\"><span><span><span><span>[36]</span></span></span></span></a><span> </span><span><a href=\"http://kidney.org/sites/default/files/LDTaxDed_Leave.pdf\"><span>National Kidney Foundation Tax Deductions</span></a></span></p>\n</div>\n<div>\n<p><a href=\"#_ftnref37\"><span><span><span><span>[37]</span></span></span></span></a><span> </span><span><a href=\"https://www.livingdonorassistance.org/potentialdonors/eligibilityguidelines.aspx\"><span>NLDAC Eligibility Guidelines</span></a></span></p>\n</div>\n<div>\n<p><a href=\"#_ftnref38\"><span><span><span><span>[38]</span></span></span></span></a><span> See, e.g. <a href=\"http://www.givewell.org/international/technical/programs/insecticide-treated-nets#HowcosteffectiveisLLINdistribution\">Bednets</a>; <a href=\"http://blog.givewell.org/2012/12/19/cost-effectiveness-of-nets-vs-deworming-vs-cash-transfers/\">Bednets vs. Deworming vs. Cash Transfers</a>. See also <a href=\"http://blog.givewell.org/2014/10/03/a-promising-study-on-the-long-term-effects-of-deworming/\">Deworming Update</a>.</span></p>\n</div>\n<div>\n<p><a href=\"#_ftnref39\"><span><span><span><span>[39]</span></span></span></span></a><span> <a href=\"http://blog.givewell.org/2011/08/18/why-we-cant-take-expected-value-estimates-literally-even-when-theyre-unbiased/\">Can&#x2019;t Take EV Estimates Literally</a></span></p>\n</div>\n<div>\n<p><a href=\"#_ftnref40\"><span><span><span><span>[40]</span></span></span></span></a><span> See <a href=\"http://lesswrong.com/lw/d4v/altruistic_kidney_donation/6vpw\">Alexander B on Altruistic Kidney Donation</a></span></p>\n</div>\n</div></body></html>", "user": {"username": "Tom_Ash"}}, {"_id": "Tpnwg6egWjhTbkKd7", "title": "Meetup : .impact project updates meeting (via Google Hangouts)", "postedAt": "2014-11-13T15:32:37.286Z", "htmlBody": "<html><body><h2>Discussion article for the meetup : <a href=\"/meetups/1g\">.impact project updates meeting (via Google Hangouts)</a></h2>\n\t\t  <div>\n\t\t\t\t<p>\n\t\t    \t<strong>WHEN:</strong> \n\t\t    \t<span>07 December 2014 10:00:00PM (+0000)</span><br>\n\t\t\t\t</p>\n\t\t\t\t<p>\n\t\t    \t<strong>WHERE:</strong> \n\t\t    \t<span>Liberty Island, New York</span>\n\t\t\t\t</p>\n\t\t  </div><!-- .meta -->\n\t\t  <div>\n\t\t    <div><p><em>NB: This meeting is now monthly. This is a teleconference meeting which anyone can join, so the location&apos;s fictitious.</em></p>\n\n<p>This is the monthly .impact meeting for project updates, discussion, and any new ideas that people might be thinking about! It&apos;s on Sunday, December 7th at 10pm UTC/GMT. It&apos;s normally pretty brief, under an hour. We meet by Google Hangout; a Hangout link will be posted in the .impact Facebook event at the time, so people can join it:</p>\n\n<p><a href=\"https://www.facebook.com/events/837665382920677/?ref=4\">https://www.facebook.com/events/837665382920677/?ref=4</a></p>\n\n<p>If you might come, put yourself down as a &apos;Yes&apos; or &apos;Maybe&apos; on that event.</p>\n\n<p>PS: If you&apos;re not already in the .impact Facebook group, you should join it to get notifications:</p>\n\n<p><a href=\"https://www.facebook.com/groups/dotimpact/\">https://www.facebook.com/groups/dotimpact/</a></p></div>\n\t\t  </div><!-- .content -->\n\t\t<h2>Discussion article for the meetup : <a href=\"/meetups/1g\">.impact project updates meeting (via Google Hangouts)</a></h2></body></html>", "user": {"username": "Tom_Ash"}}, {"_id": "x68a56F9fPzEcvMgi", "title": "Effective Altruism at Your Work", "postedAt": "2014-11-12T14:06:39.089Z", "htmlBody": "<html><body><p>Talking about effective altruism with coworkers can be really awkward. There&apos;s potential to come off as &quot;I&apos;m more moral than you&quot;, potential for &quot;I think the charities you do support are useless&quot;, for &quot;I&apos;m so rich I can afford to give away lots of money&quot;, &quot;I&apos;m trying to convert you&quot;, &quot;I think you&apos;re a bad person because you don&apos;t do this&quot;, and for just seeming weird.  Most of the year I just don&apos;t bring it up, but as we get into giving season I feel like I ought to try.</p>\n<p>I think most of the social difficulty around effective altruism comes from the demandingness aspect, the idea that to be a good person you should be devoting a substantial effort to making the world better. One way around this is to mostly focus on the effectiveness angle, saying &quot;here&apos;s an awesome charity that can do huge amounts of good with your donation&quot;.  The best charities are <a href=\"http://www.jefftk.com/p/the-unintuitive-power-laws-of-giving\">so much</a> <a href=\"http://www.jefftk.com/p/charity-variance-vision\">better</a> than the rest that pushing effectiveness seems well worth it, and any sort of discussion of giving helps normalize it and lead people to give more.  So here are three ideas for promoting effective giving among your coworkers:</p>\n<ol>\n<li>\n<p><strong>Matching Donations</strong>. Offer to match donations to one of GiveWell&apos;s picks.  This provides openings to talk about effective altruism, why evaluation matters, and the good this charity can do. Lots of people are more willing to give if they see the people around them are giving too.</p>\n</li>\n<li>\n<p><strong>Donation Drives</strong>.  Many workplaces traditionally have donation drives around the holidays.  If your work has one, consider getting involved and helping out.  This can then let you push some for effectiveness as a consideration in choosing what charity to raise money for.  If you don&apos;t have one yet, or the one you have is tightly coupled to an existing charity, like collecting cans for a foodbank, then consider starting a new one.</p>\n</li>\n<li>\n<p><strong>Updated Recommendations Discussion</strong>.  GiveWell will be putting out their updated recommendations by <a href=\"http://blog.givewell.org/2014/10/25/reminder-annual-rankings-refresh-2/\">December 1st</a>, and judging from their <a href=\"http://blog.givewell.org/\">recent blog posts</a> there are likely to be several new top charities, each presenting different benefits and tradeoffs.  Hosting a discussion to talk about these new options when they come out is a great opportunity to get into ideas about how to choose a charity and what matters.</p>\n</li>\n</ol>\n<p>I hosted a recommendations discussion last year and this year I&apos;m doing that again plus getting together with some other EAs here to match donations.  I haven&apos;t tried organizing a donation drive but it seems promising.</p></body></html>", "user": {"username": "Jeff_Kaufman"}}, {"_id": "kg7t2vGyM6WLEgH5e", "title": "Meetup : Effective Alruism Madison (2nd meetup)", "postedAt": "2014-11-11T20:19:57.178Z", "htmlBody": "<html><body><h2>Discussion article for the meetup : <a href=\"/meetups/1f\">Effective Alruism Madison (2nd meetup)</a></h2>\n\t\t  <div>\n\t\t\t\t<p>\n\t\t    \t<strong>WHEN:</strong> \n\t\t    \t<span>16 November 2014 03:30:00PM (-0600)</span><br>\n\t\t\t\t</p>\n\t\t\t\t<p>\n\t\t    \t<strong>WHERE:</strong> \n\t\t    \t<span>Central Library, 201 W. Mifflin Street, Madison, WI</span>\n\t\t\t\t</p>\n\t\t  </div><!-- .meta -->\n\t\t  <div>\n\t\t    <div><p>How much of our resources should be given to improve the world? Of all the ways to make a difference, what will have the greatest impact? What are the best charities? Let&apos;s meet to discuss these ideas!</p>\n\n<p>Last time we decided that for this meetup, we will all bring ideas of what you&apos;d like this group to do. At that time, I&apos;ll also&#x200B; briefly&#x200B; &#x200B;share my research on what other EA groups around the&#x200B; &#x200B;world&#x200B; are doing, and we&apos;ll form a plan from there!</p>\n\n<p>We will meet in the 1st floor conference room.</p></div>\n\t\t  </div><!-- .content -->\n\t\t<h2>Discussion article for the meetup : <a href=\"/meetups/1f\">Effective Alruism Madison (2nd meetup)</a></h2></body></html>", "user": {"username": "Gina_Stuessy"}}, {"_id": "QnyJyuWRZ7TfST3Qd", "title": "Meetup : Secular Solstice (Seattle)", "postedAt": "2014-11-11T08:25:25.155Z", "htmlBody": "<html><body><h2>Discussion article for the meetup : <a href=\"/meetups/1e\">Secular Solstice (Seattle)</a></h2>\n\t\t  <div>\n\t\t\t\t<p>\n\t\t    \t<strong>WHEN:</strong> \n\t\t    \t<span>13 December 2014 05:30:00PM (-0800)</span><br>\n\t\t\t\t</p>\n\t\t\t\t<p>\n\t\t    \t<strong>WHERE:</strong> \n\t\t    \t<span>Seattle, WA</span>\n\t\t\t\t</p>\n\t\t  </div><!-- .meta -->\n\t\t  <div>\n\t\t    <div><p>Venue to be determined; Inspired by Raymond Arnold&apos;s Secular Solstice, we&apos;re putting together something similar. There will be song and dance and food and drink and small amounts of fire, reflecting on the darkness of the world and the light in it that is us.</p></div>\n\t\t  </div><!-- .content -->\n\t\t<h2>Discussion article for the meetup : <a href=\"/meetups/1e\">Secular Solstice (Seattle)</a></h2></body></html>", "user": {"username": "jai"}}, {"_id": "yNn2o3kEhixZHkRga", "title": "Certificates of impact", "postedAt": "2014-11-11T05:22:42.438Z", "htmlBody": "<html><body><h1>0. Introduction</h1>\n<div>In this post I describe a simple institution for altruistic funding and decision-making, characterized by the creation and exchange of &quot;certificates of impact.&quot; I&#x2019;m interested in your thoughts and criticisms.&#xA0;</div>\n<div><br></div>\n<div>Typically an effectiveness-minded altruist would try to do as much good as possible. Instead, users of the certificates system try to collect certificates for as much good as possible.</div>\n<div><br></div>\n<div>Whenever anyone does anything, they can declare themselves to own an associated certificate of impact. Users of the system treat owning a certificate for X as equivalent to doing X themselves. In the case where certificates never change hands, this reduces precisely to the status quo.</div>\n<div><br></div>\n<div>The primary difference is that certificates can also be bought, sold, or bartered; an altruist can acquire certificates through any combination of doing good themselves, and purchasing certificates from others.</div>\n<div><br></div>\n<div>For example, a project to develop a malaria vaccine might be financed by investors. If the project succeeds the developers can declare themselves owners of an associated certificate, and distribute it to investors in the same way they might distribute profits. These investors could then resell this certificate to a philanthropist who is interested in funding malaria prevention and who honors certificates. The philanthropist would recognize the certificate as valuable to the extent that they believed that the original project was causally responsible for the development of the vaccine, and their willingness to pay would be the same as their willingness to develop the vaccine themselves (evaluated with the benefit of hindsight).</div>\n<div><br></div>\n<div>Note that judging the value of a certificate is just as subjective as judging the value of the underlying activity, and is done separately by any philanthropist considering acquiring that certificate.</div>\n<div><br></div>\n<h1>1. Some existing challenges</h1>\n<div><ol>\n<li>Evaluating philanthropic opportunities is difficult, and most are not very good. Predictions are expensive and inaccurate, and often infeasible for small donors. The problem is worst when evaluating novel interventions. Prizes can address some of these difficulties, but have their own set of problems.</li>\n<li>One person might have the ability to do a project, another the desire to fund it, and a third the knowledge to evaluate it. Coordination is hard, and existing incentives misaligned, both for disseminating good information and executing good projects.</li>\n<li>Thinking about crowding out and causal responsibility is hard: if I don&#x2019;t do something, will someone else? Does it matter which of Oxfam&#x2019;s activities I fund? How is causal responsibility divided between donors and employees? Between the philanthropist who buys malaria nets and the government which distributes them?</li>\n<li>Prices are an elegant and flexible system for communication and coordination, which are often unavailable for altruists.</li>\n<li>Reasoning about leverage, and interacting with funders with different priorities, is tough. It&#x2019;s easy to end up neglecting a large possible upside or engaged in zero-sum conflict.</li>\n</ol></div>\n<h1>2. Certificates of impact</h1>\n<div>Whenever anyone does something good in the world, they can &#x201C;mint&#x201D; an associated certificate of impact and declare themselves to be the owners. This can be as simple as making a public statement, analogous to acknowledging a funder. At the bottom of this post I could write &#x201C;This post backs certificate [RationalAltruist-22], which is now owned by Paul Christiano;&#x201D; I could do the same in a press release describing a medical intervention, an academic paper reporting the results of an experiment, or a piece of open source software. Independently, I might post an offer to sell these certificates, or a philanthropist might contact me and express interest in purchasing them.</div>\n<div><br></div>\n<div>By deciding which certificates they are willing to pay for, altruists using the system define the rules of the game. The protocol suggests considering a certificate valuable only if</div>\n<div><ol>\n<li><span> </span>It was issued by the group or individual that performed the associated activity.</li>\n<li><span> </span>It is the unique certificate associated with that activity.</li>\n</ol></div>\n<div>Users should be willing to pay the same amount for a valid certificate of X that they would be willing to pay to cause X to happen (and to keep the resulting certificate). That is, I should be indifferent between spending $100 to do a good deed and paying someone else $100 to do it, provided that in either case I get the entire certificate for that good deed.</div>\n<div><br></div>\n<div>Naturally this willingness to pay is subjective, depending on both values and views&#x2014;just like conventional grantmaking. Users maximize the total value of all of the certificates they hold, using whatever combination they prefer of doing good deeds themselves or acquiring others&#x2019; certificates.</div>\n<div><br></div>\n<div>Certificates can be transferred just like any other IOU or title, and have the same practical issues with bookkeeping and double-spending. We can resolve these however we like (word of mouth, a bulletin board, a trusted central party, the bitcoin blockchain&#x2026;). Establishing properties [1] and [2] probably involves trusting the issuer&#x2014;just like conventional grantmaking.</div>\n<div><br></div>\n<div>Certificates can be subdivided arbitrarily. When a group accomplishes a project together, they must decide how to divide the resulting certificates in the same way that a profitable enterprise would decide how to divide the profits.</div>\n<div><br></div>\n<div>Owning a certificate for X would probably not carry the same prestige as doing X yourself. Funders using the system purchase certificates as a way to do good, not necessarily as a way to earn credit (though helping them get credit may be useful for getting them on board).</div>\n<div><br></div>\n<div>For now, I&apos;m most interested in the question: would philanthropic activity in an area be improved, if many funders used this system or a similar incentive scheme?</div>\n<h1>3. Commentary</h1>\n<h2>Some simple examples</h2>\n<div><strong>No transfers.</strong> In the simplest possible example, certificates never change hands. In this case, the protocol reduces to &#x201C;Do the activities that you think have the largest positive impact on the world,&#x201D; i.e. the status quo.</div>\n<div><br></div>\n<div><strong>Grants.</strong> A grantmaker might pay a charitable organization to perform some charitable work, in return for the resulting certificates. This also reduces to the status quo, at least for the grantmaker. A grantmaker might also leave some of the certificates to the charities, in the same way that a startup retains equity as an incentive.</div>\n<div><br></div>\n<div><strong>Prizes.</strong> An unfunded do-gooder might keep the resulting certificates to themselves. Later, a philanthropist who appreciates the value of their work could buy the certificate off of them. The end result is very similar to a prize or bounty. As with a prize or bounty, that philanthropist could state their intentions in advance, choosing their own balance between flexibility and predictability.</div>\n<h2>So what?</h2>\n<div>Reproducing the status quo isn&#x2019;t so exciting. Do certificates improve the situation, or even change it? I think so, in ways that should be interesting to particularly effectiveness-minded funders. For example:</div>\n<div><br></div>\n<div><ol>\n<li>Allocating certificates requires explicit and transparent allocation of causal responsibility, both within teams and between teams and donors. In addition to the obvious cultural effects (which I would welcome despite the costs), this aligns individual incentives with altruistic goals, reducing incentives to mislead donors, volunteers, and employees.</li>\n<li>Exchanging certificates for money leads to a more consistent conversion between good done and compensation, especially if funders use a mix of prizes and grants. It can prevent good deeds from falling through the cracks, ameliorate some winner-take-all PR dynamics, and eliminate some zero-sum conflict. It also makes it easier to move between different funding modes.</li>\n<li>Purchasing certificates helps funders with different values coordinate; if I see a good deal I have an incentive to take it, without worrying about whether it might be an even better deal for someone else.</li>\n<li>The ability to resell certificates makes a purchase less of a commitment of philanthropic capital, and less of a strategic decision; instead it represents a direct vote of confidence in the work being funded.</li>\n</ol>\n<div><br></div>\n</div>\n<div>There are also risks inherent in bringing altruistic incentives closer to profit incentives (substituting extrinsic for intrinsic motivations, introducing new scope for zero-sum conflict...). How you feel about the tradeoff depends on how you feel about the relative merits of the two approaches, and may vary across domains.</div>\n<h2>Some more examples</h2>\n<div>In addition to these simple examples, certificates of impact can facilitate more exotic interactions.</div>\n<div><br></div>\n<div><strong>Financing.</strong> If I&#x2019;m optimistic about your project I might give you a loan which I expect you to pay back by selling a certificate. Or I could buy the certificates off you, as if I were a grantmaker, with the intention of reselling them.</div>\n<div><br></div>\n<div><strong>Research universities.</strong> A research group can employ researchers in exchange for ownership of some of the certificates of impact they produce. These certificates can then be sold to funding agencies or philanthropists. This shields those funders from having to make predictions about research output, which they are often not equipped to do, and provides good incentives to both researchers and research groups. (This is a special case of financing and causal attribution, but it&#x2019;s an application close to my heart.)</div>\n<div><br></div>\n<div><strong>Interpolating between prizes and grants. </strong>By implementing both prizes and grants as trades, it is easier to interpolate between the two, providing some funding to get a project going in exchange for part of its output (presumably at an expected discount) and then purchasing more of its output after the fact.</div>\n<div><br></div>\n<div><strong>Moral trade.</strong> Many cases of <a href=\"http://www.gooddoneright.com/#!toby-ord/c1dae\">moral trade</a> can be implemented by turning good deeds into certificates and bartering or trading in a marketplace. For others, such as abstaining from eating meat, this would be problematic (though it&#x2019;s not clear that the use of certificates s to blame).</div>\n<div><br></div>\n<div><strong>Targeted donations.</strong> If I want to fund only part of an organization&#x2019;s activities, I can purchase only those certificates of impact which I find valuable.&#xA0;</div>\n<div><br></div>\n<div><strong>Research on effectiveness.</strong> If I think a certificate is too cheap, I can do research to evaluate its effectiveness; depending on the result I can buy the certificate, publish my research, and resell the certificate.</div>\n<div><br></div>\n<div><strong>Trades across time.</strong> If my discount rate is lower than interest rates, I can sell certificates of impact today, invest the proceeds, and purchase certificates next year. (The price of each fixed certificate should rise at roughly market rates; but in addition to that, a certificate for a life saved in year 1 may have a different value than a certificate for a life saved in year 2, reflecting the discount rates of philanthropists.)</div>\n<div><br></div>\n<div><strong>Speculation.</strong> If I think at a change will be considered good in retrospect, I can purchase appropriate certificates now and aim to resell them later at a profit.</div>\n<div><br></div>\n<div><strong>Multiple bottom lines.</strong> If a project has several objectives, it can use certificates to monetize all of them and then make local profit-maximizing decisions. This may lead to more sane decision-making, and much more transparency, than the status quo.</div>\n<div><br></div>\n<div>(I&#x2019;m sparing you a much longer list.)</div>\n<div><br></div>\n<h2>Some theory</h2>\n<div>Suppose that everyone who valued X were using the certificate protocol. (For concreteness, suppose it&#x2019;s everyone interested in cosmology research.)</div>\n<div><br></div>\n<div>Then at equilibrium, the price of certificates of impact on X is equal to the marginal cost of achieving an impact on X. Any deviation is an arbitrage opportunity: if you can do X more cheaply, then you can sell the resulting certificates for a profit; if you are doing X more expensively, then you could save money by buying certificates instead.</div>\n<div><br></div>\n<div>Moreover, the status quo corresponds to one way of producing certificates, with total value equal to the total good being done. The actual outcome should be a Pareto improvement, and in particular should increase the total value of available certificates. As a result, it also increases the total amount of good being done.</div>\n<div><br></div>\n<div><br></div>\n<div>I wouldn&apos;t lean on this argument alone. But I do think it suggests that things might tend to work themselves out, at least if the system were widely adopted. For me, considering concrete cases bolsters that intuition.</div>\n<div><br></div>\n<div><br></div>\n<div>The infra-marginal units of X, those that were cheaper to produce than the marginal unit, pose a theoretical problem. These units of X get produced and purchased (good news!), but the resulting certificates are most likely to be sold for the marginal price of X (bad news!). That means there is a transfer of wealth, from the people who care about X (and who use the certificates system) to those who have infra-marginal opportunities to do X.&#xA0;</div>\n<div><br></div>\n<div>This problem is worst for the early adopters of the certificate system, which is particularly unfortunate. And it&#x2019;s even worse when the opportunities to do X are so cheap that they were going to get done anyway. For example, suppose some high energy physicists would have to go out of their way to <em>avoid</em> doing some cosmology. Under the certificates system they would get paid for this research by cosmology funders who purchase the resulting certificates. But the cosmology funders might not be so happy about this, since the counterfactual impact of this funding is zilch.&#xA0;</div>\n<div><br></div>\n<div>Whether this is a feature or bug depends on how many really cheap opportunities to do X were failing to get done. Maybe the high energy physicists wouldn&#x2019;t even bother publishing their cosmology in a format that cosmologists would understand, because the high energy community wouldn&#x2019;t give them any respect for it. In this case there might be huge social benefits from paying them to do so. My own guess is that we leave a lot of low hanging fruit hanging, and that picking it is more important than worrying about the transfers.</div>\n<div><br></div>\n<h1>-1. Note&#xA0;</h1>\n<div>I have omitted any discussion of how certificates might be implemented, especially discussion of how you might get from here to there. This is a tough problem, but I think that a single advocate could make meaningful headway if it seemed worthwhile. I&#x2019;m interested in the prior question, is it a &#x201C;there&#x201D; worth thinking about?</div></body></html>", "user": {"username": "Paul_Christiano"}}, {"_id": "RM3DX3ozvqo3AK3xm", "title": "Upcoming Meetups 4", "postedAt": "2014-11-10T13:54:39.551Z", "htmlBody": "<html><body><p><a><img src=\"https://i.imgur.com/58JLzqr.jpg\" alt=\"\"></a></p>\n<div><br></div>\n<div>Meetups coming up this fortnight are:</div>\n<div><br></div>\n<div>\n<li><a href=\"https://www.facebook.com/events/1476967902591746/?ref=br_rs\">Effective Altruism at Giving What We Can UPenn</a>, 10 Nov</li>\n<li><a href=\"/meetups/1c\">EA Netherlands: Game Theory, how people respond to incentives</a>&#xA0;<span>16 Nov 2014 15:06</span></li>\n<li><a href=\"/meetups/18\">Steven Pinker at Harvard Effective Altruism</a><span>&#xA0;</span><span>17 Nov 2014 19:00</span></li>\n<li><span><a href=\"https://www.facebook.com/events/781886278542422/?ref=br_rs\">Effective Altruism pub social, London</a><span>, 17 Nov</span></span></li>\n</div>\n<div><br></div>\n<div>As Part of access to medicines week (pictured), Effective Altruism Norway held an event on neglected tropical diseases and a workshop on effective altruism. Well done, guys!</div>\n<div><br></div>\n<div>Lucky Harvard Effective Altruism always gets the best speakers!</div>\n<div><br></div>\n<div>Feel free to suggest other meetups for this list.</div></body></html>", "user": {"username": "RyanCarey"}}, {"_id": "L2SWdcecLywdPBgjx", "title": "Meetup : Utrecht: Rationality Games", "postedAt": "2014-11-09T15:16:45.883Z", "htmlBody": "<html><body><h2>Discussion article for the meetup : <a href=\"/meetups/1d\">Utrecht: Rationality Games</a></h2>\n\t\t  <div>\n\t\t\t\t<p>\n\t\t    \t<strong>WHEN:</strong> \n\t\t    \t<span>14 December 2014 06:51:13PM (+0100)</span><br>\n\t\t\t\t</p>\n\t\t\t\t<p>\n\t\t    \t<strong>WHERE:</strong> \n\t\t    \t<span>La Place, Utrecht, Rijnkade 5</span>\n\t\t\t\t</p>\n\t\t  </div><!-- .meta -->\n\t\t  <div>\n\t\t    <div><p>For details, see meetup.com: <a href=\"http://www.meetup.com/LWEANL/events/218834835/,\">http://www.meetup.com/LWEANL/events/218834835/,</a> which is supposed to be up-to-date.</p></div>\n\t\t  </div><!-- .content -->\n\t\t<h2>Discussion article for the meetup : <a href=\"/meetups/1d\">Utrecht: Rationality Games</a></h2></body></html>", "user": {"username": "ImmaSix"}}, {"_id": "JWSiybr8LGPt7n3oG", "title": "Meetup : Game Theory: People Respond to Incentives... How?", "postedAt": "2014-11-09T15:09:53.523Z", "htmlBody": "<html><body><h2>Discussion article for the meetup : <a href=\"/meetups/1c\">Game Theory: People Respond to Incentives... How?</a></h2>\n\t\t  <div>\n\t\t\t\t<p>\n\t\t    \t<strong>WHEN:</strong> \n\t\t    \t<span>16 November 2014 03:06:07PM (+0100)</span><br>\n\t\t\t\t</p>\n\t\t\t\t<p>\n\t\t    \t<strong>WHERE:</strong> \n\t\t    \t<span>La Place, Utrecht, Rijnkade 5</span>\n\t\t\t\t</p>\n\t\t  </div><!-- .meta -->\n\t\t  <div>\n\t\t    <div><p>Please note that the location has been changed.</p>\n\n<p>For details, see meetup.com: <a href=\"http://www.meetup.com/LWEANL/events/215180412/,\">http://www.meetup.com/LWEANL/events/215180412/,</a> which is supposed to be up-to-date.</p></div>\n\t\t  </div><!-- .content -->\n\t\t<h2>Discussion article for the meetup : <a href=\"/meetups/1c\">Game Theory: People Respond to Incentives... How?</a></h2></body></html>", "user": {"username": "ImmaSix"}}, {"_id": "3QqHs8yptSRXmQwn3", "title": "People and charitable causes are importantly different things", "postedAt": "2014-11-09T09:30:18.236Z", "htmlBody": "<html><body><p><em>A blog post by&#xA0;Theron Pummer, <a href=\"http://blog.practicalethics.ox.ac.uk/2014/10/people-and-charitable-causes-are-importantly-different-things/\">cross-posted from the Practical Ethics blog</a> at his request.</em></p>\n<p>Like Prot &#x2013; the lovable character played by Kevin Spacey in the underrated movie <em>K-PAX</em> &#x2013; you&#x2019;re an intelligent benevolent extraterrestrial who has just been beamed to Earth.&#xA0; Sadly, unlike Prot, you have no return ticket.&#xA0; The good news for you is that just moments after hopping off of your beam of light, you found a briefcase stuffed with $3 million.&#xA0; Being benevolent, and having concern for the inhabitants of Earth, you decide to give nearly all of this money to charity.&#xA0; Being completely new to the planet, however, you do not yet have any <em>special </em>concern for anyone here &#x2013; no friends, no loved ones.&#xA0; Having this equal concern for everyone, you want simply to do the most good possible, and so you decide to give this money to <a href=\"http://www.givewell.org/\">the most cost-effective charities you can find</a>.</p>\n<p>Exit science fiction scenario.</p>\n<p>One important difference between each of us and this Prot-agonist is that we do have friends and loved ones; we have rich shared histories with them, we care deeply about them, and, crucially, the level of concern we have for them is <em>not</em> on a par with the general concern we have for strangers.&#xA0; If your fianc&#xE9; were drowning in a lake to your north, and ten strangers were drowning in a lake to your south, and you could either rescue the one to your north or instead the ten to your south (but not all eleven!), you&#x2019;d probably head north.&#xA0; Whether this constitutes morally good behavior on your part <a href=\"http://plato.stanford.edu/entries/special-obligations/\">is a matter of controversy among contemporary ethical theorists</a>.&#xA0; But let&#x2019;s assume the commonsense view that it&#x2019;s not wrong of you to save your fianc&#xE9; over the ten others.&#xA0; This degree of special partial concern is, we&#x2019;ll suppose, justified.</p>\n<p>Tragedy strikes: &#xA0;after several long months of battling, your fianc&#xE9; dies of cancer.&#xA0; You are absolutely devastated.&#xA0; But, quite admirably, you remain the kindhearted person you always were, and &#x2013; inspired by <a href=\"http://en.wikipedia.org/wiki/Ice_Bucket_Challenge\">some recent social media spotlights on philanthropy and fundraising</a>&#xA0;&#x2013; you decide to give a substantial portion of your income to charity.&#xA0; You could focus your donations on a wide variety of causes:&#xA0; heart disease, AIDS, cancer, tuberculosis, malaria, schistosomiasis, and so on.&#xA0; Having recently lost someone to cancer, and owing to our tendency to &#x201C;<a href=\"http://www.nonprofitmarketingblog.com/comments/why_people_take_action/\">take action and give for deeply personal reasons</a>,&#x201D;&#xA0;you browse the internet for the best cancer charities you can find, and eventually settle on one.&#xA0; Before pressing &#x201C;enter&#x201D; on its payment page, you have another thought:&#xA0; <em>Hold on, what exactly </em>is<em> the connection between my fianc&#xE9; and this particular cause?</em></p>\n<p>It occurs to you that your fianc&#xE9; is not among the beneficiaries of the charity (and not only because they&#x2019;re no longer living).&#xA0; Indeed, those you&#x2019;d be helping, whether your money went towards fighting AIDS, cancer, or malaria, would <em>all</em> be complete strangers to you.&#xA0; We granted that the special concern you had for your fianc&#xE9; would justify you in placing significantly more importance on <em>their </em>life and well-being than that of strangers, but would this same special concern for your (now deceased) fianc&#xE9; justify you in placing significantly more importance on the lives and well-being of <em>strangers afflicted with cancer</em> than that of strangers afflicted with heart disease, AIDS, tuberculosis, malaria, or schistosomiasis?&#xA0; Suppose you could prevent one stranger from dying of cancer, or instead prevent ten &#x2013; or one hundred &#x2013; from dying of malaria.&#xA0; Shouldn&#x2019;t you help the greater number in this case?&#xA0; The bond between you and the stranger dying of cancer doesn&#x2019;t seem sufficiently strong to outweigh something as morally heavy as ninety-nine lives.&#xA0; And this is no outlandish scenario:&#xA0; <a href=\"http://www.givingwhatwecan.org/research/charities-area/malaria\">charities combating malaria are likely to be hundreds of times more cost-effective than most other charities</a>. &#xA0;(Though focusing on <a href=\"http://www.givingwhatwecan.org/blog/2014-05-13/toby-ord-and-dcp3\">particular cancer treatments in the developing world can also be highly cost-effective</a>.)</p>\n<p>You continue to ruminate:&#xA0; <em>fighting cancer is a meaningful way of </em>honoring<em> my late fianc&#xE9;, and this is what justifies me in especially favoring cancer charities.</em>&#xA0; I am not sure this will cut the moral mustard.&#xA0; This latest thought questionably presupposes that the relevant group to which your fianc&#xE9; belongs is &#x201C;people with cancer&#x201D; rather than &#x201C;people who have suffered from a crippling illness&#x201D; or simply &#x201C;people who have suffered.&#x201D;&#xA0; Without some such questionable presupposition, it would be at least as plausible to claim that <em>reducing unnecessary death and suffering</em> appropriately honors, and sincerely expresses your love for, your late fianc&#xE9; (and you should then in turn be open to the possibility that you could do much more toward realizing this italicized aim by giving to a malaria charity than a cancer one).&#xA0; On reflection, it often seems bizarre to invest much special emotional, personal, or moral significance in the very particular way in which someone is harmed.&#xA0; Holding constant the amount of harm done, does it really matter whether the cause is cancer, malaria, or oncoming traffic?</p>\n<p>If you do give to <a href=\"http://www.againstmalaria.com/\">a malaria charity</a>&#xA0;as a symbolic expression of concern for your loved one, simply as someone who has suffered, it may not be immediately obvious to those around you that this is part of your reason for giving &#x2013; whereas it might be if you gave to a cancer charity (given that someone close to you was a victim of cancer).&#xA0; But this shouldn&#x2019;t dictate where you donate, and anyway you can always explain yourself!</p>\n<p>Special concern for your fianc&#xE9; may justify your prioritizing <em>them</em> over others, but it does not entail a special reason or justification for you to focus your donations on cancer <em>charities</em>.&#xA0; At least, if there is a connection between these two types of special partiality, it is not obvious what it is.&#xA0; <a href=\"http://qz.com/250845/this-week-lets-dump-a-few-ice-buckets-to-wipe-out-malaria-too/\">Other authors</a> have also cautioned against projecting moral properties of persons onto causes:&#xA0; the plausible claim that all people are equally morally important is not be confused with the very <em>im</em>plausible claim that all <em>causes</em> are equally morally important.&#xA0; Moreover, it is not the case that being fair to all people translates into giving equally to all charities, or determining where to give on the basis of a coin toss (or several).&#xA0; The general lesson:&#xA0; people and charitable causes are importantly different things.&#xA0; If we can remember this at the right times, we&#x2019;ll be better able to give using our heads, in addition to our hearts.</p></body></html>", "user": {"username": "Tom_Ash"}}, {"_id": "25vy2j8ZnxFa2yj6F", "title": "Meetup : Stanford Effective Altruism", "postedAt": "2014-11-09T04:10:10.639Z", "htmlBody": "<html><body><h2>Discussion article for the meetup : <a href=\"/meetups/1b\">Stanford Effective Altruism</a></h2>\n\t\t  <div>\n\t\t\t\t<p>\n\t\t    \t<strong>WHEN:</strong> \n\t\t    \t<span>09 November 2014 04:30:00PM (-0800)</span><br>\n\t\t\t\t</p>\n\t\t\t\t<p>\n\t\t    \t<strong>WHERE:</strong> \n\t\t    \t<span>Old Union, Stanford CA</span>\n\t\t\t\t</p>\n\t\t  </div><!-- .meta -->\n\t\t  <div>\n\t\t    <div><p>We&apos;re talking about political and lobbying careers!</p></div>\n\t\t  </div><!-- .content -->\n\t\t<h2>Discussion article for the meetup : <a href=\"/meetups/1b\">Stanford Effective Altruism</a></h2></body></html>", "user": {"username": "CarolineEllison"}}, {"_id": "Ae3pLwMPa76EfmxKi", "title": "Meetup : Stanford Effective Altruism", "postedAt": "2014-11-07T18:37:33.504Z", "htmlBody": "<html><body><h2>Discussion article for the meetup : <a href=\"/meetups/1a\">Stanford Effective Altruism</a></h2>\n\t\t  <div>\n\t\t\t\t<p>\n\t\t    \t<strong>WHEN:</strong> \n\t\t    \t<span>07 November 2014 04:00:00PM (-0800)</span><br>\n\t\t\t\t</p>\n\t\t\t\t<p>\n\t\t    \t<strong>WHERE:</strong> \n\t\t    \t<span>Room 200-013, Main Quad, Stanford CA</span>\n\t\t\t\t</p>\n\t\t  </div><!-- .meta -->\n\t\t  <div>\n\t\t    <div><p>We&apos;re working on instrumental rationality today!</p></div>\n\t\t  </div><!-- .content -->\n\t\t<h2>Discussion article for the meetup : <a href=\"/meetups/1a\">Stanford Effective Altruism</a></h2></body></html>", "user": {"username": "CarolineEllison"}}, {"_id": "ebcvJwEFo5NqcKG5B", "title": "Saving administration costs or saving lives?", "postedAt": "2014-11-06T12:55:36.227Z", "htmlBody": "<html><body><p><em>A blog post by&#xA0;Lucius Caviola &amp; Nadira Faulm&#xFC;ller, cross-posted from the <a href=\"http://blog.practicalethics.ox.ac.uk/2014/11/saving-administration-costs-or-saving-lives/\">Practical Ethics</a> blog at Lucius&apos; request.</em></p>\n<p>Imagine a car company advertising as follows: &#x201C;90c of any dollar you pay for your car <a href=\"http://blog.givewell.org/2007/01/16/which-of-these-boasts-is-not-like-the-others/\">goes directly to building cars</a>. Only 10% of our expenses go into planning, designing, and advertising them.&#x201D; Such a campaign strategy would seem patently bizarre; when buying a product few of us are interested in how much went into administration, all we care about is what we get for our money. Overhead ratio (the proportion of money going into administration) is irrelevant; only cost-effectiveness matters.</p>\n<p>This common sense approach to purchasing goods or services does not seem to translate into the non-profit sector, however. Consider the following advertisement by the&#xA0;<a href=\"http://www.care.org/about/financial-990\">organisation CARE</a>:&#xA0; &#x201C;More than 90 percent of our expended resources &#x2013; among the highest of all philanthropic organisations &#x2013; support our poverty-fighting projects around the world. Less than 10 percent of expended resources go toward administrative and fundraising costs.&#x201D;</p>\n<p>CARE campaign strategy is quite common for a non-profit. Many charities attempt to win donors by emphasising their low overhead ratio. Perhaps they are right to so do, as&#xA0;<a href=\"http://greymatterresearch.com/index_files/Grey_Matter_Report_Perceptions_of_Non-profit_Efficiency.pdf\">more than a third of US citizens</a> believe that charities should spend much less on administration. Further, lab studies have shown that <a href=\"http://www.sas.upenn.edu/~baron/papers/charity.pdf\">people tend to donate more to charities with low overhead ratios</a>. Consequently, in order to fulfil donors&#x2019; expectations&#xA0;charities are forced to keep their overheads small&#xA0;as illustrated in <a href=\"http://www.ted.com/talks/dan_pallotta_the_way_we_think_about_charity_is_dead_wrong?language=en\">Dan Pallotta&#x2019;s TED talk</a>.</p>\n<p>Few donors are able to identify the irrelevance of overhead ratio to effective giving. The interventions of <a href=\"http://www.givewell.org/charities/top-charities\">some charities</a> are far more cost-effective than others, so that even if only a small percentage of donated money reaches the destination, the overall impact will be much more beneficial than a larger percentage of donations for a less effective intervention.</p>\n<p>Indeed, charity evaluators have not found any correlation between overhead ratio and cost-effectiveness: Organisations with a low overhead ratio can still fail to be effective, and organisations with a high overhead ratio can be very effective &#x2013; maybe precisely due to&#xA0;<a href=\"http://kresge.org/library/nonprofit-overhead-costs-breaking-vicious-cycle-misleading-reporting-unrealistic-expectation\">good administration</a>, <a href=\"http://vimeo.com/108518074\">including competent staff, infrastructure, fundraising</a>, and evaluation.</p>\n<p>Given donor&#x2019;s proven aversion towards overhead, charities could consider offering &#x2018;overhead-free&#x2019; donations (by, for example, soliciting unrestricted funding from a few large donors to cover administration costs). <a href=\"http://www.sciencemag.org/content/346/6209/632\">A recent study&#xA0;published in Science</a>&#xA0;has found that average donations can triple when donors are told that overhead costs are already covered. One explanation for this result is that people perceive their personal impact to be greater if all of their money reaches the destination.</p>\n<p>These findings raise an important question: Why are people so preoccupied with overhead ratio in the first place?&#xA0;<a href=\"http://journal.sjdm.org/14/14402a/jdm14402a.pdf\">A study</a> we have recently conducted suggests that they may be falling prey to an error called evaluability bias; people focus on overhead ratio because it is easier to evaluate than cost-effectiveness.</p>\n<p>We found that when people are presented with information for a single charity (namely its overhead ratio and number of lives saved per dollar), on average charities with lower overhead ratios received more donations, irrespective of cost-effectiveness. However, when people are presented with information for two charities (allowing them to compare the cost-effectiveness of the two charities), they gave more to the charity with the greater cost-effectiveness, irrespective of overhead ratio. These findings suggest that people<em> do</em> care about saving lives, not administration costs, but that unless the information needed to evaluate cost-effectiveness is readily available, they will fall back on the easier-to-evaluate overhead ratio.</p>\n<p>So although people are biased about what matters in the non-profit sector, the good news is that appropriate information about cost-effectiveness can go a long way to correcting this bias. We must try to<a href=\"http://overheadmyth.com/\"> better inform</a> potential donors about the irrelevance of overhead ratio when selecting a charitable cause, and work to improve their&#xA0;<a href=\"http://en.wikipedia.org/wiki/Nudge_(book)\">decisional architecture</a> to make it easier for them to realise the importance of cost-effectiveness.&#xA0;<a href=\"http://www.givingwhatwecan.org/sites/givingwhatwecan.org/files/attachments/moral_imperative.pdf\">Shifting resources to the most cost-effective charities is crucial</a>; a lot of individuals&#x2019; lives depend on it.</p></body></html>", "user": {"username": "Tom_Ash"}}, {"_id": "TCr8gEfeFyZQcEHFR", "title": "Productivity 101 For Beginners", "postedAt": "2014-11-05T23:17:25.314Z", "htmlBody": "<html><body><p>I&apos;d like to believe that&#xA0;<a href=\"/ea/90/peters_personal_review_for_julysep_2014/\">I&apos;m pretty productive</a>, and people seem interested in how I do it. &#xA0;Previously, I had written&#xA0;<a href=\"http://lesswrong.com/lw/ifl/how_i_am_productive/\">&quot;How I Am Productive&quot;</a>and it became one of&#xA0;<a href=\"http://peterhurford.com/blog\">my most popular essays</a>&#xA0;of all time.</p>\n<p>The real secret is that, in the past, I wasn&apos;t nearly as productive. &#xA0;I struggled with procrastination, had issues completing assignments on time, and always felt like I never had enough time to do things. &#xA0;But, starting in January 2013 and continuing for the past year and a half, I have slowly implemented several systems and habits in my life that, taken together, have made me productive.</p>\n<p>I&apos;ve&#xA0;<em>learned&#xA0;</em>productivity, and I want to try to teach it to others.</p>\n<p>When I wrote&#xA0;<a href=\"http://lesswrong.com/lw/ifl/how_i_am_productive/\">&quot;How I Am Productive&quot;</a>, I kind of brain dumped everything that I knew in one place. &#xA0;To do better, I should help people go one step at a time. &#xA0;I also focused a lot on particulars of my situation -- to do better, I should be more general. &#xA0;The aim of this -- Productivity 101 for Beginners -- is to try to make a general, step-by-step guide to increasing people&apos;s productivity.</p>\n<p>...It&apos;s basically what I would do if I somehow had to start over.</p>\n<p>-</p>\n<p><strong>Disclaimer:&#xA0;</strong>This is still advice based on what works for me. &#xA0;I&apos;ve attempted to validate it by trying it on a couple of other people and integrating feedback. &#xA0;I&apos;ve also tried to improve it based on what I&apos;ve learned in the year between writing this and writing&#xA0;<a href=\"http://lesswrong.com/lw/ifl/how_i_am_productive/\">&quot;How I Am Productive&quot;</a>. &#xA0;But your mileage still may vary, and I&apos;m not a professional coach.</p>\n<p>&#xA0;</p>\n<p>&#xA0;</p>\n<h2><strong>Step One: Get some goals!</strong></h2>\n<p>...So here&apos;s my step-by-step guide to being productive. &#xA0;...Start on step one. &#xA0;Focus on step one. &#xA0;<em>Do not move on from step one until you&apos;re done with step one.</em></p>\n<p>Most people think productivity starts with &quot;how&quot;, but I always find that it starts with &quot;why&quot;.</p>\n<p><em>Why do you want to be productive?</em></p>\n<p>...If you could do more, what would you do? &#xA0;Would you&#xA0;<a href=\"http://lesswrong.com/lw/juc/optimal_exercise/\">try to exercise</a>? &#xA0;Would you&#xA0;<a href=\"http://www.everydayutilitarian.com/essays/notes-on-the-odin-project/\">practice programming</a>&#xA0;regularly? &#xA0;Would you&#xA0;<a href=\"http://zenhabits.net/write-daily/\">start writing</a>?</p>\n<p><strong>Action point for this step:&#xA0;</strong>Carefully pick&#xA0;<strong>two</strong>&#xA0;goals -- two things that you want to accomplish that you&apos;re currently not doing. &#xA0;Focus on them and how awesome it would be if you could get those things done!</p>\n<p><strong>Avoid this common mistake:&#xA0;</strong>Do not pick more than two goals. &#xA0;Only focus on&#xA0;<strong>two&#xA0;</strong>to start small and simple. &#xA0;You can add more goals later.</p>\n<p><strong>You can progress to the next step when&#xA0;</strong>you&apos;ve picked two goals that you&apos;re excited about. &#xA0;These are the reasons why you want to be productive.</p>\n<p>&#xA0;</p>\n<p>&#xA0;</p>\n<h2><strong>Step Two: Track Your Time!</strong></h2>\n<p>So you have your two goals now. &#xA0;(If you don&apos;t have your two goals, go back to Step One.) &#xA0;We now know why you want to be productive.</p>\n<p>Now we have to make some time for your goals. &#xA0;But in order to do that, we have to figure out where your time is currently going.</p>\n<p><strong>Action point for this step:&#xA0;</strong>Using paper and a pencil, Google Calendar,&#xA0;<a href=\"http://www.toggl.com\">Toggl</a>, or&#xA0;<a href=\"https://www.google.com/search?q=time+tracker&amp;oq=time+tracker&amp;aqs=chrome..69i57j0j69i61j0l3.1503j0j7&amp;sourceid=chrome&amp;es_sm=119&amp;ie=UTF-8\">some other time tracker</a>, map out roughly what you do on a given week. &#xA0;If your week is atypical, wait until a more typical week. &#xA0;If all your weeks are atypical, just track one and we&apos;ll work with it.</p>\n<p><strong>Avoid this common mistake:&#xA0;</strong>Don&apos;t stress out about timing. &#xA0;You can do rough estimates (I started out with fifteen minute intervals, but half hour intervals are fine) and if you miss something, it&apos;s ok. &#xA0;It might take a day of practice. &#xA0;Remember to have your timer with you (carry your notebook, get Toggl&apos;s mobile app, etc.) so it&apos;s easier to track things.</p>\n<p><strong>You can progress to the next step when&#xA0;</strong>you have at least three days of usable timelogs, preferably a week of timelogs.</p>\n<p>&#xA0;</p>\n<p>&#xA0;</p>\n<h2><strong>Step Three: Timebox</strong></h2>\n<p>Now you have to figure out when you want to accomplish your goals. &#xA0;Timeboxing refers to making a box of time in your calendar when you&apos;ll accomplish something.</p>\n<p><strong>Action point for this step:&#xA0;</strong>Look in your timelog to see if you have any time that you&apos;re not spending the way you want, and make that the time you do your goals. &#xA0;When I started out, I found that I would read the internet aimlessly for two hours a day. &#xA0;I cut that down to one hour and then used that free hour to exercise.</p>\n<p>You might find that good times include right when you wake up, right before you go to sleep, after class, before work, after work, etc. &#xA0;Lots of different times work for different people -- just find a time that works for you!</p>\n<p><strong>Avoid this common mistake:&#xA0;</strong>Don&apos;t cut out&#xA0;<em>too much&#xA0;</em>suboptimal time. &#xA0;Breaks are important for rest! &#xA0;Maybe you can set a timer (implicitly based on agreeing only to watch one TV episode, or an actual timer that rings), take a break for that amount, and then do what productive thing you want. &#xA0;Remember how excited you are about doing it, and how bad you&apos;ll feel if you watch that second TV show!</p>\n<p><strong>You can progress to the next step when&#xA0;</strong>you have a concrete time in which you will accomplish both your goals.</p>\n<p>&#xA0;</p>\n<h2><br></h2>\n<h2><strong>Step Four: Commit!</strong></h2>\n<p>We&apos;ve long recognized that we can&apos;t get our goals done ourselves -- weakness of will is just too strong. &#xA0;You need the power of a commitment device if you actually want to accomplish your goals in the long-run -- there is no other way.</p>\n<p><strong>Action point for this step:&#xA0;</strong>Bind both your goals to some sort of commitment device that works for you. &#xA0;Go to the gym with a friend and don&apos;t let them let you cancel. &#xA0;Sign up for&#xA0;<a href=\"http://www.beeminder.com\">Beeminder</a>. &#xA0;Sign up for&#xA0;<a href=\"http://www.habitrpg.com\">HabitRPG</a>. &#xA0;Bet a friend. &#xA0;<a href=\"http://lifehacker.com/281626/jerry-seinfelds-productivity-secret\">Start making checkmarks for every day on track and don&apos;t let yourself break the streak</a>. &#xA0;Do more than one of these things. &#xA0;Do whatever it takes to get yourself on track!</p>\n<p><strong>Avoid this common mistake:&#xA0;</strong>Don&apos;t use a commitment device that doesn&apos;t work for you. &#xA0;If you&apos;d lie to Beeminder, don&apos;t use it. &#xA0;If you&apos;d lie to a friend you bet, find some way to increase their oversight so that you can&apos;t lie. &#xA0;You have to make your commitment device inescapable.</p>\n<p><strong>You can progress to the next step when&#xA0;</strong>you have a commitment device that has successfully made you stick to your two habits for five days in a row. &#xA0;If your commitment device isn&apos;t working, get a new one. &#xA0;If your time isn&apos;t working, choose a new time. &#xA0;If you find yourself still failing, maybe your goal isn&apos;t important to you? &#xA0;Focus on why you want to do this goal, or consider switching goals.</p>\n<p>&#xA0;</p>\n<p>&#xA0;</p>\n<h2><strong>Step Five: Keep Going!</strong></h2>\n<p>Don&apos;t stop now! &#xA0;Keep your habit up!</p>\n<p><strong>Action point for this step:&#xA0;</strong>Continue to stick to your two goals.</p>\n<p><strong>Avoid this common mistake:&#xA0;</strong><a href=\"http://zenhabits.net/small-scale/\">Do not add more goals</a>. &#xA0;You must focus on your current two goals in order to make them stick. &#xA0;It&apos;s worth it in the long run.</p>\n<p><strong>You can progress to the next step when&#xA0;</strong>you have stuck to your goal successfully for three weeks.</p>\n<p>&#xA0;</p>\n<p>&#xA0;</p>\n<h2><strong>Step Six: Build!</strong></h2>\n<p>Congrats on getting this far. &#xA0;Now you&apos;re ready to add more goals as you see fit and dig into&#xA0;<a href=\"http://lesswrong.com/lw/ifl/how_i_am_productive/\">more advanced productivity advice</a>.</p>\n<p><a href=\"http://zenhabits.net/small-scale/\">Remember to keep things going slow</a>. &#xA0;Productivity is a marathon, not a sprint, and the same rules apply. &#xA0;Minor setbacks don&apos;t matter if the long-run is an improvement.</p>\n<p>You have reached the end of Productivity 101, but I&apos;d be glad to help you further. &#xA0;I&apos;d love feedback on how it went for you.</p>\n<p>...I&apos;d also love feedback if one of the steps didn&apos;t work for you, so I can improve this guide for you or others.</p></body></html>", "user": {"username": "Peter_Hurford"}}, {"_id": "2oHRPta8Akzo2EamJ", "title": "Comparative Bias", "postedAt": "2014-11-05T05:57:04.588Z", "htmlBody": "<html><body><p>I see a lot of talk about biases in effective altruist circles. I agree that it is very important to acknowledge that the human mind is flawed and consistently makes many mistakes. I wish there was much more discussion of how these biases compare to one another. On many topics there are biases going in both directions and without some sense of how they compare to one another it is hard to make sense of where the bias actually ends up leading. It seems that people assume that most people are biased against their specific perspective, rather than towards it.</p>\n<p>Imagine for example that there is a member of the LessWrong community who is considering x-risk:</p>\n<p>&#xA0;</p>\n<div>\n<table>\n<colgroup><col><col></colgroup> \n<tbody>\n<tr>\n<td>\n<p><strong>Biases that would make this person think that x-risk is a large concern</strong></p>\n</td>\n<td>\n<p><strong>Biases that would make this person think that x-risk is not a large concern</strong></p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Anchoring - The tendency to rely too heavily, or &quot;anchor,&quot; on one trait or piece of information when making decisions (usually the first piece of information that we acquire on that subject)</p>\n</td>\n<td>\n<p>Ambiguity effect - The tendency to avoid options for which missing information makes the probability seem &quot;unknown.&quot;</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Availability Cascade - A self-reinforcing process in which a collective belief gains more and more plausibility through its increasing repetition in public discourse (or &quot;repeat something long enough and it will become true&quot;)</p>\n</td>\n<td>\n<p>Availability heuristic - The tendency to overestimate the likelihood of events with greater &quot;availability&quot; in memory, which can be influenced by how recent the memories are or how unusual or emotionally charged they may be.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Attentional bias - The tendency of our perception to be affected by our recurring thoughts</p>\n</td>\n<td><br></td>\n</tr>\n</tbody>\n</table>\n</div>\n<p>&#xA0;</p>\n<p>This is just from the &#x201C;A&#x201D; section of the very long list of biases from <a href=\"http://en.wikipedia.org/wiki/List_of_cognitive_biases\"> Wikipedia </a> and I am sure that a full list would have dozens of biases going each way. I am less interested in this specific example and more interested in how people deal in general with conflicting biases. What do you think?</p></body></html>", "user": {"username": "Joey"}}, {"_id": "mAct6rZFi8tdxqh7P", "title": "Meetup : EA Brisbane Social Lunch", "postedAt": "2014-11-05T05:14:43.948Z", "htmlBody": "<html><body><h2>Discussion article for the meetup : <a href=\"/meetups/19\">EA Brisbane Social Lunch</a></h2>\n\t\t  <div>\n\t\t\t\t<p>\n\t\t    \t<strong>WHEN:</strong> \n\t\t    \t<span>08 November 2014 01:00:00PM (+1000)</span><br>\n\t\t\t\t</p>\n\t\t\t\t<p>\n\t\t    \t<strong>WHERE:</strong> \n\t\t    \t<span>Mu&apos;ooz restaurant - 54 Mollison St, West End QLD 4101</span>\n\t\t\t\t</p>\n\t\t  </div><!-- .meta -->\n\t\t  <div>\n\t\t    <div><p>Social meetup for EA Brisbane. No specific topic. Newcomers welcome. Facebook event: <a href=\"https://www.facebook.com/events/349376211900070/?ref=4\">https://www.facebook.com/events/349376211900070/?ref=4</a></p></div>\n\t\t  </div><!-- .content -->\n\t\t<h2>Discussion article for the meetup : <a href=\"/meetups/19\">EA Brisbane Social Lunch</a></h2></body></html>", "user": {"username": "Joseph_ONeill"}}]
